{"title": "No trade war. Dow to 30K.", "selftext": "", "id": "8avjmb", "created_utc": 1523245211.0, "score": 534, "upvote_ratio": 0.96, "num_comments": 133, "comments": [{"body": "MOOOOOOOON", "score": 119, "replies": [{"body": "MUUUUUNN?", "score": 16, "replies": [{"body": "Nah", "score": 8, "replies": [{"body": "SAD!", "score": 13, "replies": []}]}, {"body": "Get off WSB, Jebediah!", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Lol he’s telling China what to do, I’m assuming this will go well.", "score": 313, "replies": [{"body": "Obviously just like literally all the other winning ", "score": 83, "replies": [{"body": "How about all that winning in Syria? #WMD #MAGA Kek, Libtard Killary wanted to go in Syria!", "score": -100, "replies": [{"body": "What?\n\nWhat does this word salad even mean?", "score": 46, "replies": [{"body": "It means that guy probably didn't get a college degree", "score": 58, "replies": [{"body": "Still better returns than me probably", "score": 2, "replies": []}, {"body": "I did actually, and I am making fun of both Trump and Hillary supporters, Amerikans are far too cucked. Have fun fighting wars for Israel with trillions of your tax dollars.", "score": -1, "replies": [{"body": "Sorry - Poe's law in effect. Your post would have fit in perfectly on r/TD", "score": 2, "replies": [{"body": "OK, I know you want to just hate on Donald Trump supporters, but please understand that people like you are the problem. People who cannot think in shades of gray and have to make this blue vs red, when Trump is violating his promise not to invade Syria.\n\nThat was the only way this could have worked because Hillary was the pro-Syrian war candidate. \n\nDo you not understand this simple point?", "score": -2, "replies": [{"body": "r/TD is the place where you get banned for anything short of sucking Chump's Cheeto, how the fuck am *I* the one that apparently can't think in terms of grey? Their black and white perspective is exactly why I can't respect Trump supporters. And what did I say that made you think I'm making anything red vs. blue? I'm not a member of either party and think the two party system is bullshit", "score": 2, "replies": [{"body": "Well again that is the point, I was making fun of Trump supports *after* Trump has gotten into this Syria racket. Before that, he was doing better than the establishment government historically has done over the last 25 years or so. That's all out the window now though. \n\nIt's post irony as a form of humor, people in this sub must not be advanced enough in terms of brain size/humor to appreciate the fine hues and shades of gray contained within such humor. ", "score": 0, "replies": [{"body": "You had me until the snobby r/iamverysmart second paragraph there.\n\nI think a much more likely explanation is that your sarcasm was just lost on most people, since text doesn't convey auditory/body language cues and you didn't include the common \"/s\" tag, rather than \"everyone here has the stoopid and I have a very high iq!\"", "score": 2, "replies": [{"body": "/s is for autists, typing \"iamverysmart\" is autistic. ", "score": 1, "replies": [{"body": "Wow, you really would fit in perfectly as a submission there...", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Take a good look, this is what happens when all the autism gets too much for your brain to handle.", "score": 16, "replies": []}, {"body": "you have to understand.", "score": 4, "replies": []}]}, {"body": "Thank god Trump’s here to immediately lessen all involvement in Syria. ~~except for the fact that he ordered to fire Tomahawk missiles to an airstrip~~", "score": 20, "replies": []}, {"body": "Libtard doesn't sound good coming from a republican because they could just be called retards", "score": 3, "replies": [{"body": "The fact that you Amerikans are going to fight another war for Israel over \"weapons of mass destruction\", YET AGAIN, shows that you are all retarts. ", "score": 1, "replies": [{"body": "Israel is a puppet state lol. ", "score": 2, "replies": [{"body": "Let me get this straight, Obama gives like 40 billion to Israel at the end of his term, and we can't find 40 billion to build a border wall, and somehow they are the puppet state. Their borders are very secure and they want to send 40,000 African refugees back to Africa, not only is that not questioned at all by the west, but they decide they want to send those African refugees to western countries (they want to dump what they consider to be \"trash\" in our back yard), and again we have no problem with that. Are these people going to come and be doctors and lawyers etc? No. The taxpayer and citizen doesn't want it, but since they decided it, it's happening. It's like that with all of their decisions btw. They decide it, good as done. End of story. \n\nCan you explain what sort of logic you are following here to get it all so backwards? I can be convinced if you can lay out a rational argument. ", "score": 0, "replies": []}]}]}]}, {"body": "[removed]", "score": 4, "replies": [{"body": "You must be pretty young. Anything that even approached the word “socialism” used to be a political death sentence. I still can’t believe Bernie became that popular. Unions were neutered or have been disintegrating for 30-40 years. The anti union propaganda being they are corrupt and harmful to the economy, inefficient, whatever. And, illegal immigrants? For god’s sake they call them “undocumented immigrants” now. I remember when they were referred to as illegal *aliens* and Bill Clinton had to put on being super tough on border control.\n\nNice vague associations and hitler takes though. \n\nEdit: I really doubt you know much about history but I don’t doubt your smugness. “If you paid attention in history class” fuck off with that shit, all that tells me is how much you don’t know.", "score": 11, "replies": [{"body": "Unions are simply an entity that makes sure employers don't abuse their workers and workers get fair treatment and pay. It doesn't matter what you are talking about about, you can find bad apples in a group, but unions are very important for the American worker and you're right they have been disintegrating over the past 30-40 years. You know what else has been disintegrating over the past 30-40 years? The middle class. The wealth inequality gap is larger than it's ever been, the rich are as rich as they have ever been in America and more and more people are falling into the lower class. Lack of unions plus illegal immigration are a large reason for that. \n\nWalmart is one of the largest employers in America and very against unions. They have to have food drives for their employees because they aren't paid enough. That's just great for the country. \n\nI do think they need to get rid of pensions for government jobs and perhaps pay them higher in return, because entitlements are simply too expensive. There are bad unions, but overall they are a beneficial entity for America. Large corporations obviously hate unions, so they spend a lot of money spinning unions as bad for America.\n\nSeriously, if you aren't concerned about Trump's words and actions then you simply haven't seen all this before, but history has, many many times. It's a shame people can't handle peacetime without turning on each other and it takes a war or tragedy like 9/11 to unite people and give them perspective on what's important. ", "score": 4, "replies": [{"body": "Who are you talking to?", "score": -3, "replies": []}]}, {"body": "Can you explain why you think unions are a bad thing?", "score": -1, "replies": [{"body": "Is that what you took out of that? That I, personally, think unions are a bad idea? You’d think with all that vast knowledge of “history” you’d have better comprehension.", "score": -4, "replies": [{"body": "You didn't really say anything other than state general facts with implication that those  parallels don't exist. ", "score": -2, "replies": [{"body": "Exactly, those parallels don’t exist and are not something unique to trump. Also, Hitler takes are lowest common denominator, generally not useful, and the guy making them tends to appear like an idiot. That was true for the Obama hitler takes, the bush hitler takes, the Clinton hitler takes and all the other hitler takes that manifest on “people I don’t like.” It’s Godwin’s law. \n\nEdit: huh, it looks like your original comment was removed.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "\nhttps://youtu.be/yxgybgEKHHI\n\n“Take guns first, go through due process second.”\n\nEdit: fixed link", "score": 2, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "“Shall not be infringed”", "score": 2, "replies": []}]}]}, {"body": "http://insider.foxnews.com/2018/03/01/tucker-carlson-rips-trump-gun-control-remarks-due-process-right-second-amendment\n\nhttp://www.foxnews.com/world/2018/03/04/president-for-life-not-bad-idea-trump-says-china-proposal.html\n\n\nEven Fox News couldn't ignore those ones. ", "score": 1, "replies": []}]}]}]}]}, {"body": "He also called Kim Jung Un short and fat after Kim shot some rockets over JApan and threatened to Nuke Guam. Trump's middle school bully tactics appeared to be super effective. ", "score": 51, "replies": [{"body": "Trump is not the first person to get N. Korea to talk about denuclearisation.\n\nThey will make demands that can't be met and then blame the US for not trying. ", "score": 22, "replies": [{"body": "Or more likely Trump will blindly agree to anything so he can chalk up the ‘win’ of denuclearisation. ", "score": 4, "replies": [{"body": "Yeah gonna guess no on that one. Every prediction by leftists about Trump as president has been a catastrophic failure.\n\nNothing more enjoyable than watching leftists cheer Obama's complete roll over on Iran to get a \"deal\" while impuning Trump with NK before anything happens. It's not batshit at all.", "score": -1, "replies": [{"body": "I don’t know how the Iran deal was a ‘roll over’. And they aren’t on the same level as NK in any case. \n\nAlso, can you name one thing Trump hasn’t rolled over on? His whole tactic seems to be screaming about all the things he’s going to do then massively retreating when he has to actually do them. ", "score": 5, "replies": []}, {"body": "Liberals have turned into warhawks after Trump was elected. Remember the gas attack in Syria? Liberal media was all over Trump not retaliating quickly enough or whatever. It's just basic double standards.  \nTrump rolling over for N-Korea to de-escalate would be a pleasant surprise.", "score": 1, "replies": [{"body": "Uhh I assume you’ve seen the stat on “number of democrats who supported action in Syria under Obama and Trump vs number of republicans who do?”\n\nTLDR: You’re projecting. Yet again. ", "score": 1, "replies": [{"body": "Yeah now that I think about it, it's not that they turned into anything, they've always been pro-war. Just an illusion created by the contrast to the usual bashing of Trump to hear liberals applaud him for a change... or bash him because he didn't do enough, which is kinda funny. \"oh he warned Putin, now we can't have a ww3, what a puppet\".", "score": 2, "replies": [{"body": "Democrats went from 38% supporting in 2013 to 37% supporting in 2017. \n\nRepublicans went from 22% to 86%. \n\nRemind me again who the warhawks are. ", "score": 1, "replies": [{"body": "I never said a word about republicans. Both are. But democrats/liberals are supposed to be the anti-war party or you end up with 2 pro-war parties.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": ">Trump is not the first person to get N. Korea to talk about denuclearisation.\n\nYes and they all failed horribly. Hell, Billy gave them the keys to nuclear fission. \n\n\n> They will make demands that can't be met and then blame the US for not trying. \n\nWow, what a bunch of worthless speculation only so you can shit on the president. The negotiations are in may, we don't even have to wait that long to see the outcome.", "score": -4, "replies": [{"body": "Didn't actually shit on the president though did I? You're a raging homosexual. ", "score": 7, "replies": []}]}]}, {"body": "Yes but China is nowhere near the same as North Korea, that’s a pretty poor comparison.", "score": 6, "replies": [{"body": "They all look the same to me.\n\nCheck mate", "score": 64, "replies": [{"body": "*chink mate", "score": 13, "replies": [{"body": "ho lee fuk", "score": 9, "replies": [{"body": "http://www.nydailynews.com/news/national/4-5-ktvu-staffers-prank-pilot-names-broadcast-report-article-1.1420574\n\nBang ding ow", "score": 2, "replies": []}]}]}, {"body": "Nah Chinese people have body fat. ", "score": 1, "replies": []}]}, {"body": "China is pretty near to North Korea though.", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Hah. He don't care about this economy at all.", "score": 6, "replies": [{"body": "He likes having something to brag about... but besides that you are right.", "score": 3, "replies": []}]}]}, {"body": "When a democracy has a recession, we vote out the leaders.  When a communist country has a recession....well things get bloody.\n\nXi will bend the knee because after cementing his indefinite rule, the last thing he can afford is an angry population.", "score": 2, "replies": [{"body": "Clearly you don't understand anything about a communist dictatorship. The Chinese population will not blame Xi for a recession, as there is no free speech, free media, or protesting allowed. Media is state run, and their opinions are controlled. ", "score": 4, "replies": [{"body": "It's very hard for any of us to understand what it's like", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 93, "replies": [{"body": "Is *any* of this shit real?", "score": 74, "replies": [{"body": "M I rel ?", "score": 8, "replies": [{"body": "am I even exist?", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 41, "replies": [{"body": "no more boring presidents, this shit rocks", "score": 20, "replies": []}, {"body": "smh...thank you for the link", "score": 15, "replies": []}]}, {"body": "At first, I thought it was too good to be true but then I realized China probably didn't agree to take down the trade barriers and this is Trump's way of telling them to take them down. Kind of the same way he fired all the people he had high praise for when he hired them. It's not like he fired them in person then posted on Twitter, Twitter was the official notice of firing. Real strong man, can't even fire people in person. Coward lmfao. ", "score": 7, "replies": [{"body": "Maybe he thinks they are beneath him??  Also, what if he never fired them?  Maybe they still work for him in the shadows, so the media shifts focus off of them?", "score": -5, "replies": [{"body": "What if unicorns were made of cotton candy and farted butterflies?", "score": 7, "replies": [{"body": "Lol, yeah I get where you're coming from.  Sometimes I wonder if he actually is smarter than we give him credit for.  For instance, ppl around me still say Billy Clinton is an idiot for selling the panama canal.  Here we are 20 years later, and the expansion has only recently finished.  Our use of the canal had been dwindling as larger ships were created.\n\nTrump has allowed net neutrality to go, and then states started passing their own forms of nn to protect consumers.  It's as if in Trump's mind, **state's rights** are preferable to having a massive federal government.  \n\nI am not a fan of everything he says or does, but I wonder if he is actually ***winning.***\n\nbut if this is utterly ridiculous, i figure redditors will call me a fag and go on with their day.", "score": -2, "replies": [{"body": "Did he ever state anything about removing nn because of states rights? ", "score": 3, "replies": [{"body": "Good point.  His ego wouldn't allow him not to brag about it.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I'm feeling an open green and slowly bleed monday", "score": 50, "replies": [{"body": "Good call ", "score": 6, "replies": [{"body": "I got out of my calls near the top.  I should have gotten some puts during the afternoon.  MSFT bounces between 88-92 constantly", "score": 1, "replies": []}]}, {"body": "Tuesday red", "score": 8, "replies": [{"body": "no, it's thursday that's red my friend.", "score": 2, "replies": [{"body": "porque no los dos?", "score": 7, "replies": []}, {"body": "Everyday is red here, lately", "score": 2, "replies": []}]}]}, {"body": "Finish way off the highs tomorrow and bleed out on Tuesday after China announces new potential tariffs in response to Trump's tariff announcement last week.", "score": 5, "replies": []}, {"body": "It can't be red because it was red 2 days in a row. Can't be 3. impossible.", "score": 2, "replies": [{"body": "*BAKANA! MURI MURI MURI!*\n\n\"impossible never never never\" in moonspeak", "score": 2, "replies": []}]}]}, {"body": "you fucking idiots.\n\nHe always does the opposite of what he tweets.\n\nYou're god damn right there's gonna be a trade war.", "score": 82, "replies": [{"body": "lol fr tho this the same dude that tweeted out that tillerson was his boy and then a week later tweeted out that he was donezo\n\ntrade war 2018 guaranteed", "score": 14, "replies": []}, {"body": "Looks like the Federal Reserve will be buying a few more Treasuries than planned at the next auction.", "score": 8, "replies": []}, {"body": "Looks like a classic trump WH trap to me. He's trying to trick a sycophant into being really vigorous about defending the position that there's no trade war and no tarrifs. Then he'll tweet that there is and make that person look like a fool, and he can fire them and slide blame for whatever out the door with them. It's happened a bunch of times over the last year. This guy ran a reality show for years, don't forget.", "score": 3, "replies": []}, {"body": "^^^ this man donald trumps.", "score": 2, "replies": []}]}, {"body": "Sounds like a ban challenge. Give OP to end of year? ", "score": 22, "replies": [{"body": "No shit, +4% tomorrow or ban.", "score": 8, "replies": []}]}, {"body": "SPY 300 NIGGA", "score": 49, "replies": [{"body": "Needs to happen before 420", "score": 15, "replies": [{"body": "Here's how it can happen, Trump daddy shows lil ping ping his big white man schlong. Ping Ming gets cucked bigly. Trump takes all of China's hoes and assets. Market Cap doubles. Everybody buys a yacht and has hookers and blow.", "score": 25, "replies": [{"body": "$MU goes up by -5%.", "score": 24, "replies": []}, {"body": "> Everybody buys a yacht and has hookers and blow.\n\ni would get tired of that winning\n\nthat and the inflation would be retarded\n\ni mean more so than my current amount\n\nso like\n\na lot", "score": 1, "replies": []}]}, {"body": "you can get a 4/20 290c for .01 don't let your memes be dreams", "score": 2, "replies": [{"body": "11.7% gain in 11 days, no way this ISN'T happening", "score": 2, "replies": []}]}]}]}, {"body": "This reminds me a lot of Italian Mafia tactics.\n\n\n**Shakes hand while staring you deep in the eye**\n\n \"And I'm *sure* you'll do the right thing\". \n\nExcept instead it's Donald Trump trying to intimidate the fucking President of China. Ridiculous ", "score": 91, "replies": [{"body": "Holy fuck this truly is the dankest timeline.\n\nWho would have thought just three years ago that fucking Trump from The Apprentice would be in charge of the law, economy, military in USA. Godspeed, big dinner boy.\n", "score": 73, "replies": [{"body": "Indeed, you all said he'd have nuked Germany by now, he hasn't even killed as many Middle Easterners as Obama has at this time of his presidency.", "score": 1, "replies": [{"body": "\\#goals", "score": 2, "replies": [{"body": "Hell he hasn't even gotten us into a new war we have no fucking business being yet, Obama had already overthrown Libya by now and was well on his way to backing the Muslim Brotherhood in Egypt.", "score": 1, "replies": []}]}, {"body": "> he hasn't even killed as many Middle Easterners as Obama has at this time of his presidency.\n\nKilled more civvies though than in Obama's entire 8 years. What a champ.", "score": 1, "replies": []}]}]}]}, {"body": "Lol no, this is Trump signalling absolute unwillingness to back down.\n\nTrade war inevitable. Trade war big. Good and easy to win. BTFO Xi", "score": 36, "replies": [{"body": "War big if trade.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 17, "replies": [{"body": "Driver isn't even asleep at the wheel anymore. He fell out and the chimp in the back is trying to learn stick. It's a fun time.", "score": 17, "replies": []}, {"body": "He's subtly telling China what to do, not telling us what China is doing lol. ", "score": 5, "replies": []}]}, {"body": "Just like Mexico will pay for the wall.", "score": 59, "replies": []}, {"body": "Seeing how people have been reacting to his tweets, 2.5% rally tomorrow. My leftover QQQ 163 calls may have hope this time. ", "score": 12, "replies": []}, {"body": "Don't forget that Trump and his ilk said the same things the first time around. Then China was like, \"Here's our response,\" and then we found out that nobody's even tried to talk to China yet. My point is: be skeptical as fuck. There's a reason lawyers won't meet with Trump without having at least one other person in the room.", "score": 8, "replies": []}, {"body": "jebaited?", "score": 2, "replies": []}, {"body": "The moment we break 270, buy puts. 260/265.", "score": 2, "replies": [{"body": "Who are we?", "score": 1, "replies": []}]}, {"body": "The thing I honestly hate most about Trump's tweets is his fairly random usage of capitalization. I'm not sure he actually knows when a capital letter is supposed to be used. Why the fuck is \"Reciprocal\" capitalized?", "score": 3, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "You have to understand. Everything good is priced in, everything bad is not", "score": 33, "replies": []}, {"body": "Can't price in if the market's closed. \n\nhttps://imgur.com/gallery/VUKrP", "score": 4, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Those are cash settled futures on the index. They do not predict future prices. Need actual delivery for that. Haven't you ever noticed futures don't predict the future?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "And then there's an entire day's worth of trading that happens after opening bell. Futures are rarely reliable predictors.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "ITS FAPPENING BOYS", "score": 3, "replies": []}, {"body": "Prepare for blood bath. ", "score": 1, "replies": []}, {"body": "If this is not market manipulation/inside trading, I don’t know what it is. ", "score": 1, "replies": []}, {"body": "Fucccckkkkkkkkk seeing how this guy works, trade war imminent. Sell? ", "score": 1, "replies": []}, {"body": "4/13 Apple calls @172.50\n😍😍😍😍", "score": 1, "replies": []}, {"body": "is this real or not? My emotions cant handle this and i have calls expiring 4/20", "score": 1, "replies": [{"body": "I bought a bunch of 4/13 dia calls end of day Friday. Let's see if I can sell tomorrow for mucho denero.", "score": 1, "replies": []}]}, {"body": "Lmao what kind of lonely loser starts off a tweet about the economy with “we’ll always be friends”", "score": 1, "replies": []}, {"body": "One should first consider that reality is often the exact opposite of what Trump writes in a tweet.", "score": 1, "replies": []}, {"body": "China currently disappears dissidents in the middle of the night, pulls out their fingernails while showing hot irons up their rectal cavities, and then starts the real torture once that warm-up is completed.\n\nBut sure, China will base its trade policies on \"the right thing to do.\"", "score": 1, "replies": []}, {"body": "This tweet is the MISSION ACCOMPLISHED banner of the US-China trade war", "score": 1, "replies": []}]}
{"title": "When you're broke, the game is over", "selftext": "So don't go fucking broke.\n\nThere's a lot of new people here, and a lot of young people here, and on online forums lying-as-memes gets taken seriously by the naieve and the stupid. So even though I'm a super fag for writing this gay shit, I'm going to break it down for you how you can increase your risk-taking. It's by being financially secure in 4 steps. Then you can blow whole paychecks on SPY calls. I've clawed my way out of legit stealing-electricity poverty and this is how you stay out.\n\n1) Get a 1.5% cash back credit card, put your expenses on it, and here's the important part, *pay it off every fucking month so you don't pay interest.* This will give you like $400 bucks a year plus sweet perks like fraud protection and sometimes insurance.\n\n2) Bundle your insurance for cheaper rates.\n\n3) Put 3-6 months worth of bills in a fucking ALLY HIGH YIELD SAVINGS ACCOUNT. You FUCKING CUCKS joke about that shit all the time but when you smash your fucking car and need to get to work for a week, Robinhood will not be forthcoming on the bank deposits.\n\n4) Start a ROTH *401k because tax rates won't get better. Ideally you max this bitch out with employer contributions but we want to leave money for TSLA losses so go for at least 2k a year.  EDIT: TO CLARIFY, Let your the fucking investment company handle this account. Don't look at it. Don't touch it. Check it twice a year for 30 years. Do a growth stocks mix if your're young, switch it to more bonds when you're older. Don't be the two retards in this thread with options enabled who treat this shit like a 2nd TD Ameritrade account. The account manager will do a healthy mix of growth stocks and other shit and you'll have a cool mil when you retire despite your fuckups here.\n\nAnd that's it. Do this, THEN lose on options. This will keep you out of the god damn payday loan shop. You can keep eating chicken instead of peanut butter.\n\nMore importantly, you can take riskier plays because you're not worried about losing the money you need for fucking rent.", "id": "8b1rq8", "created_utc": 1523306220.0, "score": 2956, "upvote_ratio": 0.96, "num_comments": 461, "comments": [{"body": "[deleted]", "score": 250, "replies": [{"body": "Can't baghold forever if you need to sell for groceries", "score": 86, "replies": []}, {"body": "[deleted]", "score": 47, "replies": [{"body": "Unless you pay 22 percent income taxes on it. Closer to 1.2 to maybe 1 percent. ", "score": 9, "replies": []}]}, {"body": "And percentage back credit cards are memed on /r/churning where people spend 5 hours a weekend driving to various walmarts and post offices to make $12 in points doing things that look like money laundering but arent as interesting. ", "score": 34, "replies": []}, {"body": "Thats assuming 3-6 months expenses is your entire net worth", "score": 15, "replies": [{"body": "No expenses when you lose your house on AMD", "score": 6, "replies": []}]}]}, {"body": "OR you can just dump all your money into spx super FD 0day calls/puts and let jesus take the wheel. 1 step > 4 steps, checkmate.", "score": 2159, "replies": [{"body": "No realistic counter argument to this, you win", "score": 648, "replies": [{"body": "Schwab makes you print out the papers and sign them and scan them back to enable options on your IRA. \n\nI never got around to it and now I have a full account of money. ", "score": 127, "replies": [{"body": "It’s an online application now. ", "score": 22, "replies": [{"body": "they made me scan mine for my ira", "score": 6, "replies": []}]}, {"body": "Tastyworks will give you options and futures in a few clicks. ", "score": 2, "replies": []}, {"body": "No they don't I just got level 2 in less than 24 hrs online", "score": 1, "replies": [{"body": "> on your IRA\n\n", "score": 1, "replies": [{"body": "Yes", "score": 1, "replies": []}]}]}]}, {"body": "For real. Roth IRA isnt how you spell YACHT", "score": 1, "replies": []}, {"body": "1 is actually < 4", "score": 1, "replies": []}]}, {"body": "Besides, I like peanut butter. ", "score": 122, "replies": [{"body": "Someone fucking gets it.  Thank you!  ", "score": 21, "replies": []}]}, {"body": "How many credit cards should I open to max out my gains?", "score": 76, "replies": [{"body": "As many as you can, and I'm not joking. If you want to travel, start with Chase and follow the guides at /r/churning, otherwise, get the Schwab Platinum and get the max bonus on all of the Amex cards, cash out into your brokerage account at 1.25cpp. ", "score": 32, "replies": [{"body": "Oh damn, thanks, I just opened up 5 lines and put as many naked puts as I can on $crox expiring 4/27", "score": 30, "replies": [{"body": "I bought 6/15 $19 CROX calls because of this post", "score": 1, "replies": []}]}, {"body": "For real, I've earned almost $20,000 worth of points in 2 years following /r/churning", "score": 4, "replies": []}, {"body": "Get the Uber credit card...something like 4% cash back at bars and restaurants.", "score": 2, "replies": [{"body": "Only downside is no real signup bonus, but it’s a great card for no annual fee. ", "score": 3, "replies": [{"body": "[$100 sign-up bonus for spending $500 in the first 90 days](https://cards.barclaycardus.com/cards/uber-visa-card.html). That's a couple weekends at the bar for me.", "score": 2, "replies": [{"body": "If you're under 5/24 (Chase rule that prevents you from getting any cards if you have gotten 5 or more accounts from any issuer in 2 years), Sapphire Reserve is a way better deal to start with, even if you don't keep it past the first year. $750 bonus (towards travel, $500 cash) for 4,000 in spend (a lot, but not too ridiculous, especially if you can charge rent) within the first three months. The annual fee is $450, and it's not waived, but it includes a $300 travel credit that is automatically applied towards any travel expenses, including hotels, car rental, flights, parking, mass transit passes. So that brings the effective annual fee down to $150, it's trivially easy to burn the $300 credit if you do any traveling at all. It also includes a credit for TSA Pre-check/Global Entry, if you don't already have that, that's worth another $100 for Global Entry. So you're looking at $700 net if you don't have pre-check, and $600 net if you do. Plus, it comes with lounge access, which means free drinks/snacks at a lot of airports, and they're starting to add airport restaurants to that as well, usually that means you get a $28 credit to those restaurants. The earn rate for restaurants and travel is 3X, but it lets you redeem points for 1.5cpp towards travel, bringing it up to 4.5% back on those categories, and if you have other chase cards, you can transfer your points to it and redeem with that 50% bonus. \n\nAll that said, if you're annual fee averse for whatever reason and just want one card to use everywhere, the Uber card is one of the best.", "score": 4, "replies": [{"body": "The problem is that I rarely travel and drink a lot.", "score": 6, "replies": []}]}]}]}]}]}, {"body": "Open all of them. Make sure you get even more from extended family, friends (ok so you probably dont have those), whatever random tinder fatties you hook up with, and whoever else will say more than three words to you. Barricade the door and buy calls on the first 10-500x ETF you come across. The next day, you should be able to buy reddit so you can ban any of these faggots that tried to give you \"safe\" advice. ", "score": 8, "replies": []}]}, {"body": "I turned 100% in 20 minutes on my very first 0day puts today.\n\nIt's making me irrationally comfortable with risk.", "score": 35, "replies": [{"body": "The first high is free", "score": 46, "replies": []}]}, {"body": "This guy gambles", "score": 31, "replies": []}, {"body": "Move over, Warren Buffet, there's a new big boy in town. ", "score": 13, "replies": []}, {"body": "Robinhood won’t let me buy calls on the day they expire weeklies just don’t give me the rush I need", "score": 28, "replies": [{"body": "I wanted to buy expired options on Robinhood and it's not working? WTF!?", "score": 30, "replies": [{"body": "You need robinhood platinum for that", "score": 4, "replies": []}]}]}, {"body": "Don't forget to invest in some $ROPE before you lose it all but!", "score": 3, "replies": []}, {"body": "Checkmate atheists ", "score": 5, "replies": []}, {"body": "Pretty sure if you did this today, just bought a straddle at opening. You would of made a killing. ", "score": 2, "replies": []}, {"body": "This reply is why I come here", "score": 2, "replies": []}, {"body": "Jesus Christ this sub is dead. ", "score": 1, "replies": []}, {"body": "Thanks for this advice.. Going to do it riight now", "score": 1, "replies": []}, {"body": "Large if factual ", "score": 1, "replies": []}]}, {"body": "Be a real man and sell chunks of your liver to cover your margin calls. It'll grow back plus makes it cheaper to get drunk", "score": 385, "replies": [{"body": "I tell you what. Instead of selling your own liver, you can have the option to buy shares of my liver in 30 days at an agreed upon price. In 30 days, there will be many overdoses, so this is a great deal. You can collect my liver tissue if its less fatty than your liver tissue in one month. You can pay me $1k now for this option, deal?", "score": 111, "replies": [{"body": "Tell you what, instead of selling your own liver contracts, why don't we start a liver contract market exchange?  We'll call it the LCME.  Why sell your own liver when you can make money selling other people's livers?", "score": 38, "replies": [{"body": "You mean the option to sell other people's liver.", "score": 25, "replies": [{"body": "How do I short this guys liver?", "score": 25, "replies": [{"body": "Fuck what the fuck is going on. Its like I'm watching The Big Short. I don't understand shit ", "score": 1, "replies": []}]}]}]}, {"body": "Anyone wants to swap CDOs on this?", "score": 7, "replies": [{"body": "What if we take a bunch of alcoholic bums' livers, and pile them into a big cooler? Does that diversification count as AAA-rated livers?", "score": 5, "replies": []}, {"body": "Cirrhosis Diagnosis Options? :(", "score": 3, "replies": []}]}]}, {"body": "The man speaketh truth!", "score": 4, "replies": []}, {"body": "Iirc you can only do that once.\n\nYou can give someone half your liver and the remaining half grows into a super liver but you can't do that again.", "score": 1, "replies": []}]}, {"body": ">1) Get a 1.5% cash back credit card, put your expenses on it, and here's the important part, pay it off every fucking month so you don't pay interest. This will give you like $400 bucks a year plus sweet perks like fraud protection and sometimes insurance.\n\nI honestly can't believe how many people don't do this shit.", "score": 484, "replies": [{"body": "Yep, it's super easy money and is exactly the same as paying with a debit card.", "score": 186, "replies": [{"body": "I have 5% cash back from discover!", "score": 75, "replies": [{"body": "On rotating categories", "score": 159, "replies": [{"body": "it's ok some quarters I eat gasoline just to maximize my cash back", "score": 682, "replies": [{"body": "I almost choked on my lunch", "score": 77, "replies": [{"body": "yea the first couple of times it's hard not to die but on the plus side now I can spit hot fiya", "score": 151, "replies": [{"body": "🧘‍♂️ 🔥 ", "score": 10, "replies": []}, {"body": "your comment made my day dude\nJust reading \"on the plus side now I can spit hot fiya\" gives me a confidence boost", "score": 8, "replies": [{"body": "glad I could help", "score": 1, "replies": []}]}, {"body": "i rofled so hard, also +1 for username", "score": 1, "replies": []}]}, {"body": "Choking on dick is nothing new here", "score": 30, "replies": [{"body": "Can't have tendies without some ranch sauce.", "score": 3, "replies": []}]}, {"body": "oh look at this fat cat here with his LUNCH ", "score": 16, "replies": []}, {"body": "Was it Diesel or Regular?", "score": 3, "replies": []}, {"body": "He said gasoline not lunch, how do you expect to make any money if you don’t eat gasoline ", "score": 1, "replies": []}, {"body": "I'd choke too if I was eating gasoline.", "score": 0, "replies": []}]}, {"body": "Long XOM", "score": 4, "replies": []}, {"body": "5 🌟 post", "score": 2, "replies": []}]}, {"body": "And limits", "score": 2, "replies": []}]}, {"body": "Are you shutting me? I might switch! Ive got the AMEX platinum (no fees, military, fuck off) but 5% is a hell of a deal ", "score": 15, "replies": [{"body": "Changes each quarter. But they double your cash back the 1st year. ", "score": 26, "replies": [{"body": "I have this card too. Works well young kids first getting credit cards or full grown austists with shit credit. Getting another soon after i cash in that sweet cash back match.", "score": 11, "replies": []}]}, {"body": "Get the Sapphire Reserve instead and start grabbing the other Chase cards, the vanilla Platinum's only justifiable benefit over the other premium cards (with the exception of the Centurion Lounge) for the fee is its theoretical ability to drop panties, unless you're the type that flies every other day for work. 3X \"travel\" and restaurants with points worth 1.5cpp towards any kind of travel > 5X direct-booked flights and 1X everything else with points either worth 1cpp or however much you can get with transfers. Also, you can earn Chase points with other cards and transfer them to the Reserve and redeem them at 1.5cpp for travel, making the Freedom a 7.5% category spend card and the Freedom Unlimited a 2.25% everywhere card. I'd hang onto the Amex for free in addition to this, though, can't complain about free hotel upgrades.", "score": 8, "replies": [{"body": "I had two Reserve cards, 5 AMEX,1 Barclays, 1 Citi and 1 Capital One Playstation card (for buying games and not have my wife on my case.)\n\nRecently though I tried getting a Southwest card and was rejected! They said I had too many cards! I cancelled two Amex and I’m giving it a few months before trying again. Apparently you can have too many", "score": 2, "replies": [{"body": "You were rejected for Southwest due to the 5/24 rule, which is a rule on most of Chase's cards saying that applicants will be auto rejected if they have opened more than 5 new credit accounts in 2 years. Closing accounts does not reduce that number. ", "score": 8, "replies": [{"body": "Oh snap, I didn’t know about that shit. Anyway around it? I really want the miles? I’m taking a cruise to Italy and Greece with flights paid by the 200k+ miles I earned on Sapphire. Need this card to ferry my children around.", "score": 3, "replies": [{"body": "Go to a branch and see if you're pre-qualified for any cards, that is the only thing that can bypass that rule. Online prequalifications don't work. This is why /r/churning says to hit Chase first, they have some of the best bonuses in the industry and you want to get those before they lock you out.\n\nGet your wife involved? Maybe? Authorized user may or may not count for 5/24, depending on how it shows upon her credit report. I would recommend NOT adding each other as AUs and then both play the system with separate accounts.", "score": 2, "replies": []}]}]}]}, {"body": "If you live near a centurion lounge or fly Delta (5+ times a year) Amex Plat is king.  You don’t get skyclub access with reserve.  ", "score": 2, "replies": [{"body": "Agreed, Platinum can certainly be worth it for some people. My issue with platinum is that it’s a good card to have, but not a good card to use. It needs better earn rates.", "score": 2, "replies": [{"body": "For sure, I use chase sapphire for everyday spend but will probably trade it for the Amazon Prime visa when I’m up for renewal. 5% back on Amazon and Whole Foods is hard to pass up. ", "score": 2, "replies": []}]}]}]}, {"body": "I’ve got a $50 referral for you if you’re interested. ", "score": 4, "replies": []}, {"body": "Pick up a freedom chase card as well. ", "score": 1, "replies": []}, {"body": "Maxes at $1500 in spending for the month so the most you get is $75. The better thing to do if you are more baller is get in bed with Bank of America's tiered rewardss card (3, 2, 1% in categories) THEN have a minimum balance of 50,000 in your combined BOFA and meril edge trading account and they double the rate (something like 5.5% on gas, 3.75% grocery,, and 1.75% everything else) and give you 100 free trades a month and they start calling you ", "score": 1, "replies": []}]}, {"body": "5% amazon purchase year round!", "score": 2, "replies": []}, {"body": "Wow OP was right you all are a bunch of kids.", "score": 4, "replies": []}, {"body": "5% from Target Red Card, 5% from amazon prime business chase, 3% on kroger branded products with kroger visa, 2% on entertainment with Citi TY, 5% back on gas with Costco credit card. \n\nIt's literally free money if you have the discipline to not overspend. ", "score": 0, "replies": [{"body": "Jesus Christ. Do not get store brand credit cards people. Amazon is the ONLY one that is worth it. You will get much more bang for your buck with Chase/Amex/Shiti on just their initial bonuses than you ever will on a target red card (that only gets cash back/points at target)", "score": 4, "replies": []}]}]}, {"body": "Unless a bunch of your expenses charge you a 2.75% fee for using a credit card", "score": 1, "replies": []}, {"body": "It's far far better than debit card. You are not liable for any misuse or theft or fraud or whatever. Using a debit card? Tough titties, ur account is empty.", "score": 1, "replies": []}]}, {"body": "It's fucking ridiculous to me that this isn't the de-facto way that people handle EVERY GODDAMN TRANSACTION THAT WILL ACCEPT A CREDIT CARD WITH NO FEE. Not only is it literally free money, you get a shitload benefits you don't get with a debit card like fraud protection on top of building credit. The people who ran my last apartment complex were retarded enough to let me pay rent on a credit card with no fee, guess who has hundreds of dollars sitting in cash back rewards at their expense? Yes I get it, you're afraid because your dumbass parents maxed some out and told you that credit cards are a serial killer armed only with a spiked metal dildo. Ignore them like you do for most of their other advice and cut up your debit cards you little shits. ", "score": 137, "replies": [{"body": "Maybe your renters were just doing you a solid because it doesn't matter how you paid them? Even if you didn't pay off your credit card they still got the money...\n\nUnless I'm missing why it would be stupid for them to let you pay using a credit card. ", "score": 24, "replies": [{"body": "They generally pay around 2-3% of the transaction in processing fees, generally on the higher end for online transactions. \n", "score": 44, "replies": [{"body": "Maybe OP looks like a poor slob so they'd rather pay 2-3% than have his check bounce or have to deal with late rent ", "score": 42, "replies": [{"body": "Maybe OP is paying their mortgage plus 20%, so they just don't give a fuck as long as he pays and leaves the place untrashed", "score": 18, "replies": [{"body": "He said it's an apartment complex so I doubt he's paying the mortgage but Idk how mortgages on complexes work or if they even have mortgages ", "score": 2, "replies": []}]}]}]}, {"body": "Those rewards and one month interest free loan are getting paid for by someone, and the first hint is that Visa isn't a non profit org.", "score": 13, "replies": [{"body": "glad I'm not a degenerate or a merchant then", "score": 3, "replies": []}]}, {"body": "It was all online, but I do have that homeless look going for me. Anyone who accepts credit cards is most likely paying something in the neighborhood of upper 2 - lower 3% range of the transaction plus about $0.35 per swipe. They eat the cost and accept them anyway generally without even adding a fee because a large percentage of people want to buy stuff with credit cards and they don't know or care that businesses get the big dick when you use them. The credit card company isn't going to let jack or shit come between them and that sweet percentage, so consumers enjoy fantastic benefits just for using them - great fraud protection, the ability to chargeback when someone fucks you over, rewards, all kinds of shiny shit. ", "score": 7, "replies": [{"body": "Most companies just raise prices to balance out the credit card transaction fees.  The people who get the dick are the guys paying cash since they are paying the credit card mark up without getting any of the benefits.", "score": 21, "replies": [{"body": "The people paying with cash or debit cards are definitely getting screwed properly, but passing on the cost doesn't do the business accepting the cards any favors either. The price you're selling stuff for is going to have an influence on the amount of stuff you sell.", "score": 1, "replies": [{"body": "Not exactly.  Just to give you an example.  I have a local sub shop called Kenny's sub shop.  They were cash only up until 2 years ago.  They had a $5 lunch special with 8\" sub, fries and a bottle of soda.  They were $3 cheaper than any other sub shop in the area and 100x better than Subway or Quiznos.  \n\nHowever they got a Micros POS device and started accepting credit cards.  Their prices went up immediately.  The $5 lunch special went to $6 immediately and currently it is $7.25.  However they have a lot more business now than they had two years ago.\n\nTheir prices went up, but so did their customer base since they now accept credit cards.\n\nThey do give cash customers a bit of a discount since they'll round down to the nearest 25cent if you pay by cash, but it's still not as cheap as it would have been if they didn't start taking credit card orders.", "score": 4, "replies": [{"body": "For contrast, there's a Chinese food place near me that always has a massive line around dinner time practically going out the building. \n Cash only.  The food is good, hot/fresh (necessarily I suppose), large portions, and cheap.  There are a few other ethnic food places in my city just like it.  Only a few people have ever complained about it but they still drive 45 minutes through traffic and hit the ATM to eat here.", "score": 4, "replies": [{"body": "So did this place lose customers after they started accepting credit cards or are they still cash only?  \n\nIf they are still cash only that doesn't really make this a contrast.  My guess is a place that is good enough to drive 45 minutes to get to would be fine even if they bumped up prices to accept credit cards.  As long as their quality remained the same.", "score": 1, "replies": [{"body": "I believe the primary draw is the portion size to price ratio.  There are other Chinese food places nearby with slightly better food but their portion:price ratio is nowhere near as good.  If they had to raise prices I'm not sure they'd compete as well with the other places.", "score": 1, "replies": []}]}]}, {"body": "Thinking about it a little more thoroughly I could definitely see that happening now especially considering I'm one of those people who only buys stuff with my credit card or a direct bank draft (I honestly don't even know my debit card pin number and I do not carry cash). If that kind of mechanic didn't exist and ultimately work out in their favor you'd have a rough time finding businesses accepting credit cards. The fact that they allow customers to spend money they don't have for some knick-knack they just have to have right now is icing on the cake. ", "score": 1, "replies": []}]}]}]}, {"body": "And some businesses are going credit card only. Takes out the hassle of dealing with cash: counterfeits, employees pocketing some, robberies, hassle of depositing it in the bank. ", "score": 5, "replies": []}]}, {"body": "Ever wonder where that money comes from for the cash back?\n\nBusinesses pay that to the CC company.\n\nWe killed all MasterCard bill payments because of being raped by 4% cash back on a large organization's monthly bill.", "score": 1, "replies": []}, {"body": "Credit cards have higher fees than debit cards. Also, Discover and AMEX have higher fees than Visa and Mastercard which is a reason why Visa is taken everywhere but AMEX not so much. The person paying never sees the fees.", "score": 1, "replies": []}]}, {"body": "I have 2 cards that have cashback, I use one for expenses and my wife uses the other one.  We pay them off every month and rack up some ridiculous cashback amounts.  I just used mine for the down payment on a (well overdue) new car and got $100 cashback.  We do the apartment thing as well, it's a free night out every month just for paying rent.", "score": 1, "replies": []}]}, {"body": "Get a 2% card wtf", "score": 63, "replies": [{"body": "Citi Double Cash (we really are in the wrong sub)", "score": 27, "replies": [{"body": "This ugly ass credit card is my daily driver", "score": 2, "replies": []}, {"body": "Yup double cash is the shit. Especially since you can cash out rewards anytime.\n\nI have gotten about 1.3k back a year for the last three years I've had that card because I put literally everything possible on it except for Amazon purchases.", "score": 2, "replies": [{"body": "If by “anytime” you mean once your cash back is above $25 then yea you can cash out anytime. ", "score": 9, "replies": [{"body": "Well, true, but it's pretty easy to rack up 25.\n\nI meant anytime in relation to some cards that send you a check once a year for your rebate which is pretty lame. ", "score": 1, "replies": [{"body": "Wow, didn't realize there were still cards out there that did this", "score": 3, "replies": []}]}]}, {"body": "Why not amazon purchases?", "score": 3, "replies": [{"body": "Probably has the Amazon card that gives 5%", "score": 2, "replies": [{"body": "Yup. Exactly. ", "score": 1, "replies": []}, {"body": "Ah right. Curse my terrible credit, I don't even qualify for that card :(", "score": 1, "replies": []}]}]}]}]}, {"body": "Get a 5% amazon card wtf.", "score": 41, "replies": [{"body": "Well yeah but both because you can't live off Amazon", "score": 24, "replies": [{"body": "Edit: also if you don't have a CC get one as soon as possible. You'll never be able to qualify for a mortgage without credit.\n\nCall me a faggot but I shop at WF so it's a no brainer. I also have a CSR for travel and dining. If you're starting to get into credit cards and you know you can hit the minimum for the bonus: go for the Chase Sapphire Preferred. 2x dining and travel, 50,000 sign up bonus, TSA pre-check\n\n\n\n/r/churning is a good spot if you want free vacations. Just got 7 free nights for my honeymoon and a first class flight for points. Probably will cover my rental car too.", "score": 45, "replies": [{"body": "Yeah I have like 15 cards and a 750 rating, I know all the tricks but these dudes out here acting like 1.5% is the ceiling. Good looks though man!", "score": 20, "replies": [{"body": "Yea I haven't gone full churn. Do you cancel your cards before your fees hit usually?", "score": 7, "replies": [{"body": "Ideally you downgrade it to another card they offer with no fee because then your credit doesn't take a hit AKA Chase Sapphire Reward -> Chase Freedom", "score": 13, "replies": [{"body": "Have you ever had a CC company refuse to downgrade?", "score": 1, "replies": [{"body": "They have no reason to deny a downgrade. They know their other option is you canceling. There are some edge cases though like you can't go from an Amex charge to a regular amex credit card.", "score": 1, "replies": []}, {"body": "No, just tell them you're not feeling like you get enough value out of the card to justify the fee", "score": 1, "replies": []}, {"body": "Sometimes they don't have an available downgrade option, but if they do, they'll always let you downgrade.", "score": 1, "replies": []}]}]}]}, {"body": "how much your credit go down after churning? I'm in the 800s right now", "score": 2, "replies": [{"body": "I'd wager most churners are between 750 and 800. The high inquiries and recent accounts are a detriment, but having a lot of paid off accounts also helps a lot too, especially over time.", "score": 5, "replies": []}, {"body": "Usually scores go up at first.\n\nI was 730 before starting, 8 months in I peaked at about 810, now I'm floating around 760. If my score is too high, that means it's time to open another card.", "score": 1, "replies": []}]}, {"body": "I know next to nothing about cards, how did you go about researching? ", "score": 1, "replies": [{"body": "reddit.com/r/churning", "score": 2, "replies": []}]}]}, {"body": "Only issue with chase cards is 5/24 rule :( ", "score": 3, "replies": []}, {"body": "You shop at Wells Fargo? Fag!", "score": 2, "replies": []}, {"body": "I have like 600k points/miles I was looking into selling so I can buy more calls. ", "score": 1, "replies": []}]}, {"body": "Who says? I've bought nearly every single thing in my house from Amazon. Since the closing in August, I bet I've spent +20k on everything imaginable for the inside of a house, specifically on Amazon.  Desk, mattress, bed frame, Apple Jacks, almond milk, toilet paper, dish washer latch, bleach, Goldfish, projector, tiny crossbow, utility shelves, rope & pulleys, cell phone, clothing, and even a fire poker, just to name less than 1%. As soon as they start shipping Hot Pockets, I'll never leave again.", "score": 7, "replies": []}, {"body": "But you can buy things like toilet paper, shampoo toothpaste etc. as well as food like pasta and other things. So you can shift a decebt part of your monthly expenses there if you make the effort.", "score": 3, "replies": [{"body": "Just buy that shit at a grocery store with the Amex blue cash preferred card and you'll get 6% cash back. Not to mention cheaper prices to begin with on all those things you mentioned. If you spend more than $275/month on groceries, you're wasting money by not getting the blue cash preferred card.\n\nAlso, 3% back at gas stations!", "score": 2, "replies": []}]}, {"body": "You can come pretty close. ", "score": 2, "replies": []}, {"body": "challenge accepted.", "score": 1, "replies": []}, {"body": "The fuck you can't", "score": 1, "replies": []}, {"body": "Not with that attitude.", "score": 1, "replies": []}]}, {"body": "Get a 6% card that works at grocery stores and buy Amazon gift cards", "score": 2, "replies": []}, {"body": "Using the Chase Sapphire Reserve combined with a Chase 5x card (Ink Cash, Freedom) is essentially 7.5% if you plan on traveling.\n\nI've got both, so right now I'm getting 7.5% back on groceries, anything paypal, Amazon, AirBnb, CVS, Chipotle, Uber, Delta, more. (I get those last ones by buying gift cards at grocery stores or office supply stores)", "score": 1, "replies": []}]}, {"body": "I have an amazon card and a chase sapphire reserve ", "score": 15, "replies": [{"body": "That and the chase freedom unlimited are the only three cards one would ever need.  ", "score": 4, "replies": [{"body": "Gotta get the Chase quad-fecta. \n\n1. Sapphire Reserve\n2. Freedom Unlimited\n3. Freedom\n4. Ink Cash", "score": 2, "replies": [{"body": "Why?  What's the point of having more than two rewards cards?", "score": 2, "replies": [{"body": "Each card provides different benefits, usually different categories.\n\nAll 4 of those cards earn UR points, which can be transferred between cards.\n\n**Sapphire Reserve:** 3x dining, 3x travel    \n_The sapphire also gives your points their value, points are worth 1.5¢ towards travel, while points on the other cards are only worth 1¢ cash back. This is also the only card with no international fees, and other benefits_\n\n**Ink Cash:** 5x on office supplies and utility bills    \n_Use the 5x on office supplies to buy gift cards for places like Amazon, Ebay, Delta, Uber_\n\n**Freedom:** 5x on rotating categories (this quarter it's grocery stores & PayPal)\n\n**Freedom Unlimited:** 1.5x on Everything _(fallback card)_\n\nIf you use all 4 cards (and travel), you're getting a minimum return of 2.5%, maximum of 7.5%.", "score": 2, "replies": []}]}]}]}]}, {"body": "For us Canadians: MBNA RWE is what you want for 2% flat cashback!", "score": 2, "replies": []}]}, {"body": "Plenty of people do. Then they lose their job and pay 20% for a couple of months, wiping our years of cash back at 1.5% in an instant. There's a reason credit card companies want you to spend on their cards. \n\nThat's why pairing this strategy with a 6-12 month emergency fund is critical. ", "score": 55, "replies": [{"body": "The average person gets fucjed by credit cards. The average person also doesn't have 6 months worth of salaries on their high yeield Ally account", "score": 44, "replies": [{"body": "Also the average person is retarded", "score": 81, "replies": [{"body": "Guilty", "score": 25, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "Relevent username", "score": 19, "replies": []}, {"body": "I bought amd at 13.76.... please don’t ask me anything", "score": 3, "replies": []}, {"body": "Did AMD make it to the promise land in a month?", "score": 1, "replies": []}]}]}]}, {"body": "Not 6 months worth of salary, just of necessary bills. If you lose your job you need to stop trading options until you find another one.", "score": 6, "replies": []}, {"body": "The average person lives paycheck to paycheck", "score": 2, "replies": [{"body": "Yeah, it's a real fucking challenge to get out of that, too. It takes sacrifice, and being miserable, and mostly luck.", "score": 1, "replies": []}]}]}, {"body": "Also you can just set a low limit on the card. Mine is less than one paycheque. It's super easy these days to top up your cc in the checkout line if you're spending significantly more money than usual. I had a card with a $300 for years, now that I have a career I feel fine with a grand but the cc company sure seems to think I need more than 10 times that limit.", "score": 8, "replies": [{"body": "If you care about your credit score, don't do this. Utilization ratios are a big part of your score, the banks generally extend about 3X more than they think you'll use, which dovetails well with the FICO model, where you score drops rapidly once you're over 30% utilization.", "score": 18, "replies": [{"body": "When I applied for a pre approved mortgage my score was over 800. I've been told that my cc setup is not ideal for my credit score but I seem to be doing just fine regardless.", "score": 1, "replies": []}]}]}, {"body": "A N N U A L\n\nDefinition: Recurring, done, or performed every year; \n\n", "score": 1, "replies": []}, {"body": "Don't use more credit than you have as cash and you're fine. There's no difference between spending $50 on a credit card and spending $50 with a debit card if you intend to spend $50 on something. Just pay off your statement in full every time and you're fine.\n\n\nYou only get into trouble when you have $100 in your bank account and spend $5,000 worth of credit. But if you're doing that then you're a fucking idiot and deserve to be in debt.", "score": 1, "replies": []}]}, {"body": "Is there a card that offers cash back on buying options on credit? Asking for /r/personalfinance", "score": 14, "replies": []}, {"body": "I do this but with a travel rewards card instead (Chase Sapphire wussup). Just paid for a trip to Japan with ~6 months of normal spending.\n\nDoesn't matter if you are spending a lot or spending a little, get rewarded for it. I haven't used my debit card in years.", "score": 13, "replies": [{"body": "Yee I'm on that Sapphire shit too bruh.  The card itself is awesome too makes you feel like you're rich.", "score": 13, "replies": []}, {"body": "I was looking into this days ago. Is that the go to card? I was looking into discovery.", "score": 3, "replies": [{"body": "I think the Sapphire is universally acclaimed as the best. I have the preferred because the reserve has a $450 annual fee. ", "score": 3, "replies": [{"body": "The Reserve has a $300 travel credit, though, which is immediately applied to anything that codes as \"travel\". This includes flights, hotels, Uber, public transit (in my experience, including monthly passes), rental cars, parking. With that in mind, it's only $55 more than the Preferred, and for that $55, you get free lounge access (which can mean free nice meals in some airports and free drinks in others), Pre-check/global entry credit, .25c more per point in redemptions (which adds up), and 3X on travel and restaurants instead of 2X, along with better trip insurance (including delay insurance). Reserve is a no-brainer.", "score": 11, "replies": [{"body": "The CSR also comes with tsa precheck/global entry reimbursement iirc.", "score": 2, "replies": []}]}, {"body": "The Reserve is essentially $55 more than the preferred and comes with _way_ more than $55 of benefits, I can't think of any reason to have the preferred.", "score": 1, "replies": [{"body": "For people who don't spend as much...", "score": 2, "replies": []}]}]}]}, {"body": "Preferred or reserve?", "score": 1, "replies": [{"body": "Reserve.\n\nIf you account for the $300 travel credit, it's essentially $150 for the Reserve, only $55 more. The perks like Global Entry, Priority Pass and rental car insurance are well worth the $55. You'll also earn 150% more points in the travel/dining categories, which will offset the fee anyways.", "score": 1, "replies": []}, {"body": "Preferred. I ain't paying $450 annual fee to get points for spending money.", "score": 0, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": ">Reserve has a $300 annual travel credit that gets automatically applied with eligible spending.\n\nIf you spend $300+ on travel yearly. \n\n\nThe reserve is better, but it requires some semi-heavy spending to make up for the $450 fee. It also charges $75 for an authorized user, where the preferred is free.\n\nI'd recommend the preferred to most folks.\n", "score": 0, "replies": [{"body": "You actually should be able to double dip on that travel credit as well. Spend $300 in travel during your first year of having the card and use your travel credits, then the month your yearly fee hits spend another $300 in travel and cancel the card that same month. You end up with $600 in free travel and the annual fee for year 2 gets refunded in full as long as you cancel the card within the same month of the fee showing up on your statement ", "score": 1, "replies": []}]}]}, {"body": "Same here.  I know the reserve is more efficient, but I don't spend nearly enough to make it worth it. The preferred was my first dip into the travel card market, so if that goes well, hopefully I'll get the reserve in a few years when I have more money to through around.  \n\nI've also been eyeing the cap one venture card, but don't really think it makes sense to have both that and the preferred. ", "score": 1, "replies": []}]}]}, {"body": "Did that include the signup bonus?", "score": 1, "replies": [{"body": "Yeah it did, 50K", "score": 1, "replies": [{"body": "Yeah that's the problem, the sign up bonus will get you a nice trip, but once you spend that, I find the Amount of UR I get through everyday spend is never enough to really do anything nice with. Having the chase trifecta for over a year now, I've really only earned 5k or 10k UR that weren't a sign up or referral bonus. ", "score": 1, "replies": []}]}]}, {"body": "Some of the rewards card can be worth it but it's a bit more work to make sure you can use the points efficiently. I'm lazy so I just do cash back.", "score": 1, "replies": [{"body": "Honestly a lot of times cash back ends up being a better deal anyway. Sure, you can get great redemptions on travel, but would you have taken that trip without those points? Also have to factor in all the money you spend while actually on vacation", "score": 2, "replies": []}]}]}, {"body": "My venture card for capital one has basically paid out over 500 bucks a year to me in rewards lol.\n\nFucking morons I swear. \n\nAlso Chase freedom is legit for their categorical 5% cash back every quarter...easy money savings. ", "score": 18, "replies": [{"body": "For every $500 you make in rewards they probably bring in $50k in interest from people with the same card that carry a balance. ", "score": 40, "replies": [{"body": "No doubt they can make bank from just one person carrying a balance over month while still giving out freebies to ppl like me", "score": 13, "replies": [{"body": "All about that responsible life", "score": 3, "replies": []}]}, {"body": "Not on the high-end rewards cards. All the revenue there comes from interchange fees.", "score": 2, "replies": []}]}, {"body": "They make tons of other people's interest, but they also make a big kickback from the credit card processors.\n\nEvery time you swipe your card, a flat amount+percent gets taken by VISA/MC/etc and kicked back to the banks. That's why some places won't let you use ancard under $10, because the transaction fees kill their margins.", "score": 11, "replies": []}]}, {"body": "Whats worse is how defiant they are when you tell them otherwise. Like everytime you use cc, an angel loses it's wings.", "score": 17, "replies": [{"body": "So true. You hear all sorts of stupid excuses too. \"I don't like them tracking my purchases.\" Proceeds to swipe debit card. \"The interest charges are very high.\" Don't carry a balance and pay it off. \"Getting another card is so bad for your credit.\" WRONG. People are just fucking stupid. And you know what? That puts more money in my pocket, so I just shake my head at them and smile. Personally, I get a new credit card every time I see better rewards for a particular shopping category or benefits that I think I might take advantage of. ", "score": 17, "replies": [{"body": "It can be mildly bad for your credit. When I opened my Amazon card, it cost me 50 points. Within 2 years I had those points back, though, and it saved me $150 when I opened it plus God only knows how much in cash back. Very worth, but maybe not if you're buying a house in 4 months", "score": 2, "replies": [{"body": "There are times when it will not be advantageous to you, and I would be especially cautious if you anticipate getting a mortgage within a couple years. That it is unequivocally bad is patently false though, and that's more to what I'm speaking. For many people, the increase in available credit will result in a lower credit utilization, so they'll see a bump in their scores. I'm surprised that opening that card cost you 50 points though. ", "score": 6, "replies": [{"body": "A new card can lower your average credit age, plus any inquiries that show up.  My apartment complex started reporting rent to one reporting agency and it lowered by score 20 to 30 points lower than the 2 agencies it isn't reported to just due to credit account age being lowered.", "score": 2, "replies": []}, {"body": "It was my second card, so I suspect that was most of the reason. Either way, it was a good decision for me at that time.", "score": 1, "replies": []}]}]}]}, {"body": "Everytime you use your credit card, Dave Ramsey blows a casket", "score": 7, "replies": [{"body": "The expression is 'blows a gasket'", "score": 1, "replies": []}]}, {"body": "Some people get carried away when they have a cc. If you’re bad with managing your money it’s much safer to take out x amount of cash a week and only spend that. Obviously these types of people need to get better at managing their finances but it’s better to miss out on cc rewards than go into debt.", "score": 1, "replies": []}]}, {"body": "Why not a 2% card or 2.65% with Merrill Edge?", "score": 7, "replies": [{"body": "You got to have 100k in Merrill Edge for it to pay out like that.\n\nThe 2% Fidelity Card is the real answer.  Maybe the 3% card from Alliant Credit Union, but that's only good for one year.", "score": 7, "replies": [{"body": "yeah you should get 100k in merrill edge. free trades and no atm fees too", "score": 6, "replies": [{"body": "If you have 100k in Merrill, then you probably already have your shit together and don't need this advice.", "score": 11, "replies": [{"body": "Yeah yeah people with 100k don't like 2.65% back on everything, that makes sense", "score": 0, "replies": [{"body": "More like \"if you have 100k in Merrill, you probably already have the Bank of America cashback card. So telling you about it is redundant\".  \n\nBank of America spams me with the damn card and I don't have a Merrill account or a Bank of America account.  I could only imagine how much spam people who actually have accounts with them get.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "You cucks get the 2% cash back credit card.", "score": 3, "replies": []}, {"body": "Citi card is 2%, checkmate atheists ", "score": 3, "replies": []}, {"body": "cause a lot of us get much more value through Amex reward points for flights and shit, than gay cash back", "score": 6, "replies": [{"body": "That's not what I meant.  I meant the number of people who don't even use a CC or use one and think making the minimum payment is OK.  I use my CC for miles as well.", "score": 5, "replies": [{"body": "I know mate, just pulling your leg. wait, that’s not your leg", "score": 4, "replies": [{"body": "Keep pulling...harder...", "score": 6, "replies": []}]}]}]}, {"body": "Fuck me, Amazon gives you back *5%* on your purchases from them if you have Prime? That's beer money.", "score": 4, "replies": [{"body": "Wtf why don't I have this card ", "score": 5, "replies": [{"body": "It's a legit card. No annual fee, no foreign transaction fee. 2% on gas, restaurants, drug stores. 3% on Amazon without prime, 5% with prime.", "score": 2, "replies": []}]}]}, {"body": "/r/churning", "score": 2, "replies": []}, {"body": "1.5% cash back is equivalent to the Ally Savings account you guys make fun of so much. That ror is trash.\n\n/r/churning got the right idea\n\nPoints are way better than cash back, especially if you redeem them to travel\n/r/awardtravel to max out that bitch\n\n\nChase Freedom Unlimited the only 1.5% card worth a damn cuz Ultimate Rewards can transfer points to other airlines and hotels. BASE value is 3 cents per point...it only goes up from there.\n\n - open Chase Sapphire and get 50k bonus\n\n - downgrade to Chase Freedom Unlimited\n\n - go on a free vacation", "score": 2, "replies": [{"body": "My point wasn’t on the 1.5% is was on the free money aspect", "score": 1, "replies": []}]}, {"body": "Literally a dollar fifty back on every hundred with a free chance to become indebted for life with one mistake.", "score": 2, "replies": [{"body": "I guess if that mistake is being poor and spending more money than you have?  Which you wouldn’t be doing with cash/debit anyway?  I get at least two free long distance plane tickets a year from my chase card and fraud detection for next to nothing while continuing to build and maintain excellent credit.  You’re right sounds like I’m getting the raw end of that deal.", "score": 3, "replies": [{"body": "Wow, this guy jets away on a shitty off season trips to nowhere Florida and third rate Las Vegas hotels, all comp'd by Chase Manhattan - a true shark folks. He gets over a $568 value in red-eye only tickets by making the minimums on his buissness school balance. Churn away you brave crazy dreamer.", "score": 1, "replies": [{"body": "Yeah man it really blows having 0 debt and getting free money for doing literally nothing different than I would normally do, but keep arguing against one of the few actual freebies in life if it helps you sleep better.", "score": 1, "replies": [{"body": "You dont have shit, enjoy your backout dates and yearly statement credit.", "score": 1, "replies": []}]}]}]}]}, {"body": "My spouse had money to pay for a big chunk of her grad school. The university let me pay her tuition on my credit card. Banked 70k worth of air miles for free. Just pay that shit off each month and they will literally pay you. Anyone that has credit card debt is fucking retarded. Take a loan at a bank before credit card debt ", "score": 2, "replies": [{"body": "You are a wise man.  My apt complex charges 0.5% to pay for rent with you CC, free monie$.", "score": 2, "replies": []}]}, {"body": "Dont they prorate the interest now? I swear I read it in the fine print on one of my many credit card offers. Even if you carry the balance for 20 days and pay it off they still charge you the let's say 18% interest fee on the balance for those 20 days and you get 1.5% back... ", "score": 2, "replies": [{"body": "The simple answer is...pay off your card, then you owe nothing.", "score": 9, "replies": []}, {"body": "if you pay cards off before the due date you don't pay any fucking interest at all", "score": 8, "replies": []}, {"body": "No, they cannot charge interest if you don’t carry a balance. You could make a $10,000 purchase on the first day of your statement period and pay it off after 30 days (whenever your payment is due) interest free ", "score": 4, "replies": []}]}, {"body": "Yep I've done this since I was 19 with a Scene Visa. I mean it's a lot less useful since it's just for free movies and concessions and I don't go to movies very often anymore, but I haven't paid for a movie in 5 years and have enough points saved for my next 19 trips (got opening night tickets to Infinity War RIP the 20 dream) to be paid for. ", "score": 1, "replies": []}, {"body": "The people with shit loads of credit card debt and shit credit? That isn't going to be you; that's going to be the dumbfucks financing your benefits lmao.", "score": 1, "replies": []}, {"body": "50% of the country hovers around a grand and CC companies make a slaying for people who have car trouble/bad months and can't pay up. ", "score": 1, "replies": []}, {"body": "+1.... I use the Citi 2% cash back card and  it’s given me about $1200 over the 2 years I’ve had it. Literally free money.\n\nPay it off every month, winner ", "score": 1, "replies": []}]}, {"body": "Get an Amazon prime credit card, get 5% back on anything on Amazon, buy literally everything on Amazon (even toilet paper), profit. ", "score": 279, "replies": [{"body": "There’s one that’s 5% back on anything amazon, 2% on gas, restaurants, and certain brand stores, 1% on everything else. Remember to specify to these autist because there are two amazon cards, but one only gives you the 5% back on amazon while you get more benefits on the other one.", "score": 80, "replies": [{"body": "Actually I think one does 5% on Amazon stuff, 2% gas and 1% everything else. You get this if you actually have Amazon prime.\n\n\nIf you don't have Amazon prime the only difference is you only get like 2% on Amazon, but still get 2% gas and 1% everything else. \n\n\n\n", "score": 24, "replies": [{"body": "I know, but there is an amazon.com store card which only offers the 5%. That’s what I’m talking about. I wanted it to be clear just in case someone didn’t see the other card option.", "score": 5, "replies": [{"body": "Yup you are correct, there are two cards, an amazon.com prime only card and a amazon.com prime branded chase Visa card.. you want the Visa card with the 5/2/1% benefits. ", "score": 11, "replies": []}]}]}]}, {"body": "WHERE DID YOU FIND OUT ABOUT THIS TRADE SECRET", "score": 84, "replies": [{"body": "The real secret is to tell all your friends about your prime membership\n\nBuy them stuff and charge them full price on venmo, you get free 5% on all their purchases", "score": 135, "replies": [{"body": "Damn talk about an arbitrage opp.", "score": 72, "replies": []}, {"body": "This is just called “drop-shipping.”", "score": 7, "replies": []}, {"body": "Woah brother. Woah now", "score": 4, "replies": []}]}]}, {"body": "Its like they’re paying me!", "score": 13, "replies": []}, {"body": "buy amazon gift cards with your amazon credit card for unlimited money", "score": 39, "replies": [{"body": "Gift cards are excluded for any geniuses out there wondering", "score": 56, "replies": []}, {"body": "This is called manufactured spending and while not being illegal can get your card closed or look very suspicious. I would not recommend this.", "score": 9, "replies": [{"body": "You have to season the account first. If you buy $500s immediately after you activate, you're going to have a bad time.", "score": 5, "replies": [{"body": "Most of this stuff is designed with churners and manufactured spending in mind anyway.  They obviously had some bean counters figure out if they could afford the churners while still making bank on everyone else.", "score": 2, "replies": []}]}]}]}, {"body": "Unless you can find it for 6% cheaper somewhere else. ", "score": 5, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Lol is that the paper from portable bathrooms? ", "score": 2, "replies": []}, {"body": "Sure, if you want your asshole to be shredded by 1 ply", "score": 2, "replies": []}, {"body": "That's sandpaper I treat my asshole better than that.", "score": 1, "replies": []}]}]}, {"body": "\"how do you buy SPY FDs with a cash back credit card\" post incoming", "score": 64, "replies": [{"body": "CC -> VGC -> MO -> Checking -> Brokerage", "score": 3, "replies": []}]}, {"body": "This sounds like advice for poor people too dumb to get rich on leveraging volatility. ", "score": 102, "replies": [{"body": "Tell me what to buy. ", "score": 19, "replies": [{"body": "$AMD", "score": 12, "replies": [{"body": "Old meme\n\n...NEXT", "score": 2, "replies": [{"body": "VXX", "score": 1, "replies": []}]}]}, {"body": ">going long\n\nYou're already a big boi in spirit.", "score": 2, "replies": []}]}]}, {"body": "This post here is the surest sign a catastrophic crash is coming very soon.", "score": 99, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "WSB is now advocating the ally 1.45% savings account. Ally savings accounts are like those aliens from Independence day, just slowly traveling everywhere wiping out gainz.", "score": 6, "replies": []}, {"body": "When WSB starts giving honest, serious financial advice about how not to go broke, and advocating responsible financial behavior, the end is nigh. ", "score": 3, "replies": []}]}]}, {"body": "Or you could just go down to the local street corner and suck dick for quarters to cover your AMD calls", "score": 69, "replies": [{"body": "[deleted]", "score": 33, "replies": [{"body": "Not if you’re enjoying it!", "score": 5, "replies": []}]}, {"body": " follow the above steps and you can go down to the local street corner and suck dick for quarters for fun", "score": 4, "replies": []}]}, {"body": "\"check it twice a year for 30 years\"\n\nI dunno, that sounds like a lot of commitment", "score": 29, "replies": []}, {"body": "Only poor people are allowed to use roth ira's tho", "score": 23, "replies": [{"body": "No, only people that make under a certain income can use Roth’s. I know a few guys that are “retired” that trade in IRAs all day long and don’t have any income and max a Roth every year.  It’s not hard to be very rich but have little income. ", "score": 3, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "There are no capital gains on current income in a retirement account, gains are only income when a retirement account makes a distribution. If you only have interest income on some bank accounts it’s hard to get to an income level high enough to prohibit a Roth. Wealth and growth of wealth is irrelevant to the AGI on your 1099. ", "score": 12, "replies": []}]}, {"body": "> No, only people that make under a certain income can use Roth’s\n\nYeah. Poor people.\n\nEdit: Nobody you know is maxing out roth IRAs without having any income.", "score": 4, "replies": []}]}, {"body": "Backdoor conversions for life", "score": 2, "replies": []}, {"body": "1) Contribute up to 36k/year to Non-Roth After-Tax 401(k).   \n2) Quit and roll over everything into a Roth IRA.   \n3) ????  \n4) Profit", "score": 1, "replies": []}]}, {"body": "3. Sounds gay. Isn’t that what credit cards are for?", "score": 42, "replies": [{"body": "think 1-4 are what credit cards are for", "score": 19, "replies": []}]}, {"body": "what if your Roth IRA is options enabled and that's how you've been losing?", "score": 42, "replies": [{"body": "Don't use your retirement account for trading ya fuckin gomer.", "score": 120, "replies": [{"body": "What? You want him to get his gainz in his traditional ira? Nah, option away the roth to millions.", "score": 23, "replies": []}, {"body": "but now my losses are tax advantaged, fucking check mate atheists", "score": 19, "replies": []}, {"body": "Look here you silly bitch. I go hard. If i lose it all then im going to lose it ALL.", "score": 9, "replies": []}, {"body": "lol fuck off, all my sweet sweet nvda gainz are in my roth", "score": 4, "replies": []}, {"body": "Why not though? No taxes bruh. \n\nUse some for losing in options and most to invest responsibly. \n\nIf you need more money in there and you're able, just mega back door roth that shit", "score": 1, "replies": []}, {"body": "But what if I’m writing covered calls on a high dividend utility ya fuckin gomer?", "score": 1, "replies": []}, {"body": "If he's already saving enough in a 401k is there anything really wrong with trading in a Roth IRA? ", "score": 1, "replies": []}]}]}, {"body": "I did this once. I had a couple trees removed in my back yard that was gonna be like 2 grand. I could have paid cash, but instead got the Chase Southwest reward card that gives you 50,000 Southwest points for spending 2k in the first 3 months. \n\nPaid it off immediately, and now I have free miles. ", "score": 20, "replies": []}, {"body": "gay.\n\nget rich or die trying", "score": 55, "replies": [{"body": " \n> ~~get rich or~~ die ~~trying~~\n\nftfy", "score": 40, "replies": []}]}, {"body": "I set my 401k to 15% and buy VOO. Then I max my IRA and buy target dates.\n\nThen what is left over I actively trade. I know that trading is retarded for 90% of the population and I shouldn't do it at all. But I miss out on a ton of memes if I  dont.", "score": 33, "replies": [{"body": "Target dates are garbage and underperform almost every other (suitable) option in the long term. 2 visits with a CFP or other professional planner will pay for itself within the first business cycle.\n\nNinja edit: find an advisor with a selling agreement with DFA funds and you'll thank me when you have scrooge McDuck money when you retire.\n\nEdit 2: hey /r/investing fags, do some fucking homework like you pride yourself on doing, and find out how many bps target date funds underperform in the long term. I can't cure cancer by myself, but damn, the level of ignorance makes me not feel so bad for taking all your money.", "score": -2, "replies": []}]}, {"body": "Why not a 2% credit card? ;)", "score": 34, "replies": [{"body": "Citi Double cash?", "score": 9, "replies": [{"body": "*Unzips*", "score": 12, "replies": []}, {"body": "Yes purchasing an item is literally foreplay with that shit", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Y tho? Is the cashback more than 2%?", "score": 1, "replies": []}]}]}]}, {"body": ">1) Get a 1.5% cash back credit card, put your expenses on it, and here's the important part, pay it off every fucking month so you don't pay interest. This will give you like $400 bucks a year plus sweet perks like fraud protection and sometimes insurance.\n\n\nI lurk on /r/churning way too much. Amazing that there are people out there who don't take advantage of cc offers.", "score": 15, "replies": [{"body": "And amazing to me that there are apparently enough people who pay interest and fees every month to fund these people and still make the banks profit", "score": 10, "replies": []}]}, {"body": "When the fuck did I subscribe to r/investing", "score": 15, "replies": []}, {"body": "This post got x-posted to robinhood.  \nr/wallstreetbets crossposted to r/robinhood  \nWhat a great day to be alive", "score": 15, "replies": [{"body": "I already complained about OP before. He said that volatility was too high to buy options.\n\nhttps://www.reddit.com/r/wallstreetbets/comments/8a7vtp/too_many_memes_and_bullshit/dwww9jf/", "score": 1, "replies": []}]}, {"body": "Seems like r/personalfinance has infiltrated our autistic ranks. ", "score": 41, "replies": [{"body": "comment erased with Power Delete Suite", "score": 22, "replies": [{"body": "Welcome to my fucking world.\n\nhttps://www.reddit.com/r/wallstreetbets/comments/8awqwf/your_point_of_view_on_rlatestagecapitalism/dx39xot/", "score": 3, "replies": []}]}, {"body": "We went over there to shitpost, we brought this on ourselves.", "score": 25, "replies": [{"body": "every post there is by definition a shit post", "score": 13, "replies": []}, {"body": "Next thing we know we will have people asking if they need to file taxes on the gains for their Ally savings account. ", "score": 9, "replies": [{"body": "I can already see the reply, \"IANAL/IANACPA but I think...\"", "score": 2, "replies": []}]}]}, {"body": "Yup.", "score": -1, "replies": []}]}, {"body": "I'm unemployed and live with my parents. Why would I need to do any of this?", "score": 11, "replies": [{"body": "Cause you're gay", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Quick! Act autistic!", "score": 7, "replies": []}]}, {"body": "> Start a ROTH IRA because tax rates won't get better. Ideally you max this bitch out with employer contributions but we want to leave money for TSLA losses so go for at least 2k a year.\n\nYou mean ROTH 401k? Either way, having an IRA or 401k account doesn't help much when you incur huge losses on stupid trades like me.", "score": 17, "replies": [{"body": "Let the company handle it, or do indexes and ETFs. Christ, you should not be trading in your retirement account.", "score": 48, "replies": [{"body": "Most of these clowns on here shouldnt be trading in any account, even a fucking paper trading account. ", "score": 71, "replies": [{"body": "Truth.  Source:  am clown/shouldn't be trading options.", "score": 2, "replies": []}]}, {"body": "If you have over $100k, you can definitely buy individual dividend stocks. That's enough money to realistically hold 40+ stocks. You can use the dividends to diversify in the future.", "score": 5, "replies": [{"body": "If you're holding 40 fucking stocks, just buy an ETF. Moron.", "score": 0, "replies": [{"body": "No. You will pay less fees by owning the stocks themselves while only taking on marginally more risk.\n\nETFs are for people that either don't have much money or are entirely financially illiterate. ", "score": 3, "replies": []}]}]}, {"body": "Indexes are honestly the way to go", "score": 5, "replies": []}, {"body": "It's the only way to avoid getting taxed on short term gains", "score": 1, "replies": []}]}]}, {"body": "This sub is getting soft", "score": 8, "replies": [{"body": "Soft af", "score": 1, "replies": []}]}, {"body": "5. Once you feel comfortable take out loans against your retirement funds and take as many cash advances as you can and chase the market. Don’t worry, you have enough saved already.", "score": 7, "replies": []}, {"body": "A very small percentage of millionaires are in their 20s-30s, a very large number of millionaires are in their 60s-70s. So the shit you're saying really isn't anything special. The whole point is to be a millionaire NOW. The stuff you're saying is common knowledge, everybody knows this. The point is, who gives a fuck about being a millionaire when you're 70?? Fuckin life has passed u bye. Get that shit at your peak, 20s, 30s, 40s. This is why everybody here takes risks. They want it now. This post was a waste. ", "score": 12, "replies": [{"body": ">Get that shit at your peak, 20s, 30s, 40s. \n\nSo how do we do that fuck-ass", "score": 3, "replies": [{"body": "BUY. THE. DIP. SELL. THE. DIP.", "score": 1, "replies": []}]}]}, {"body": "Some people make enough disposable income to save for their future and gamble the rest away you filthy peasant.", "score": 18, "replies": []}, {"body": "[deleted]", "score": 22, "replies": [{"body": "Advanced Money Destroyer", "score": 17, "replies": [{"body": "Oof", "score": 8, "replies": []}]}, {"body": "no u", "score": 1, "replies": [{"body": "No you both", "score": 1, "replies": [{"body": "agree-with-me", "score": 1, "replies": [{"body": "Agreed", "score": 1, "replies": []}]}]}]}]}, {"body": "Ok, but what MU calls should i buy?", "score": 6, "replies": []}, {"body": "Reserve only 3-6 months' worth of expenses in savings? I've got about a year's worth. I guess that's money I could be dumping into MU and AMD!", "score": 9, "replies": [{"body": "Why so much? What scenario would you need a year's worth?", "score": 7, "replies": [{"body": "For when you all in MU!", "score": 2, "replies": []}, {"body": "Idk but that dude is wasting 6 months worth of expenses that could be trading SPX 🤦", "score": 2, "replies": []}, {"body": "I dunno, I guess I'm kinda conservative and that's the advice I got", "score": 2, "replies": [{"body": "No problem there's nothing wrong with that! I just find a lot of times people have cash saved up or are shooting for a particular goal but aren't really sure why. So if you figure out the why, then you could figure out the best options on how. Usually people have 3-6 months expenses saved in cash for emergencies. Anything outside emergencies/immediate opportunities should be invested. Would you say that's the purpose?", "score": 1, "replies": [{"body": "That's a good point. I used to hoard money with no real purpose. I only recently got the guts to invest the majority of what I have", "score": 1, "replies": []}]}]}, {"body": "For when you want to quit your job and fuck around for a while. ", "score": 1, "replies": [{"body": "For a year? And also, that's not an emergency, that's a vacation. Your \"quitting my job to fuck around for a year\" fund probably shouldn't be the same as your emergency fund", "score": 1, "replies": []}]}]}]}, {"body": "Thank you.", "score": 4, "replies": []}, {"body": "FYI - Goldman Sachs just raised their interest rate on their savings account to 1.60% APR. ", "score": 4, "replies": [{"body": "FYI - 1.75% with CIT. Or don't be a full autist and do insight card like a god damned independent ", "score": 2, "replies": [{"body": "Found what you were talking about CIT money market is at 1.75%\n\nThanks for the insight card tip!", "score": 3, "replies": []}, {"body": "Correct me if I’m wrong. I just looked on their website. It’s 1.55% for CIT and they require a $100 min deposit. To make sure we’re in the right sub, ppl can start dropping their pennies into GS. ", "score": 2, "replies": [{"body": "Yes you're right. I'm the autist. I'm thinking of vanguard's money market which you need a minimum of $3K to start. \n\nEdit: wait I am right. ", "score": 1, "replies": []}]}]}]}, {"body": "Gaaaaay.", "score": 3, "replies": []}, {"body": "New to this sub, been needing this. \nThanks.... you fuck.", "score": 4, "replies": []}, {"body": "This is how I have my emergency fund stored. It's a bitch and a half to pull out, which honestly isn't a bad thing, and gets 5% a year on up to 5k with the 5% compounding on balances over 5k: https://www.doctorofcredit.com/insight-5-apy-prepaid-card-5000/", "score": 3, "replies": [{"body": "5%? \nHow legit is this?", "score": 2, "replies": [{"body": "It’s legit, the only catches are the 5k limit and a heinous number of fees on the attached prepaid card, which you can avoid by just not using it (it’s the kind of product they market in payday loan places). The biggest hassle is the inability for a lot of banks to set up direct deposit to it because the verification deposits don’t always return, but I was able to get Schwab checking to link to it and I have a friend with Ally that was able to get it to work too. There is also an inactivity fee, if you ACH $1 to every 90 days, you’ll be able to avoid this (and you can do this even when your savings is at its limit, the prepaid card is treated like a separate account). The online interface also kinda sucks, but the entire point is that you don’t touch this money unless you absolutely have to. The link I posted details all of the potentially tricky bits. I personally think they are able to provide 5% because of all of the fees, we’re talking $1 per debit transaction, $1 for phone support, really stupid stuff. But if you do it right you’ll pay none of them and reap the profits from the suckers that (for some reason) do. ", "score": 3, "replies": []}]}]}, {"body": "Step 1 is a little misleading because most of your large expenses are going to charge a 2-3% fee for paying with a credit card. ", "score": 3, "replies": [{"body": "What are you paying on a consistent basis that would be considered a large expense? Rent?  \n  \nDon’t forget that you’re still getting that 2% back on all expenses, not just large ones. 50 small transactions could end up equaling one large one by the end of the month. ", "score": 2, "replies": [{"body": "Don't get me wrong. I have the citi double cash card and use it for all my purchases ", "score": 2, "replies": []}]}]}, {"body": "In Canada, everyone should check out the Westjet Elite MasterCard. 1.5% back into flight dollars, $250 bonus on sign up. The best perk is that you get one companion flight a year - so if you book a round trip ticket, you can add another for 99$ in NA, 299 to Caribbean or 399 to Europe, and no restrictions on which flights. Basically if you fly one a year it’s a no brainer. Also 1st checked bags are free for up to 8 people on the same reservation instead of $25/each. It’s dope ", "score": 5, "replies": []}, {"body": "Everyone says tax rates won't get better.  Here we are in 2018 and they just got better.", "score": 5, "replies": [{"body": "Yeah but in 30 years when you retire they won't be", "score": 1, "replies": [{"body": "I hear you, but this year is the year that breaks this assumption if you made it many years back.  \n\n", "score": 1, "replies": []}]}]}, {"body": "roth ira's, caring about 1.5% cash back and bundled insurance... go back to r/povertyfinance you fucking faggot", "score": 6, "replies": []}, {"body": "I swear to God, op is talking to me, specifically me. From the Tsla,  td account, losing ass on options, and just bein an asshole to my future self financially. Dear self, sorry about that. I'll do better.", "score": 2, "replies": []}, {"body": "MY FATHER BUILT THIS EXCHANGE! TURN THOSE MACHINES BACK ON!! TURN THOSE^(MACHINES back on...)", "score": 2, "replies": [{"body": "Mortimer! Your brother's not well!\n\n\nFUCK HIM!!!", "score": 2, "replies": []}]}, {"body": "This post is gayer than aids", "score": 3, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "OP is a dumbass but he means that you can usually designate your 401K as a Roth 401k if you want, with the same tax implications as Roth, and the limits of a 401k.", "score": 7, "replies": []}, {"body": "I'm not allowed to contribute to a Roth IRA if I make more than 190k though, right?", "score": 3, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "[deleted]", "score": 10, "replies": []}]}]}, {"body": "Index funds and cwedit cawdsss reeeee", "score": 1, "replies": []}, {"body": "Yeah he just wanted to sound smart. Like who doesn't already know this? It's everywhere.", "score": 1, "replies": []}, {"body": "What is the income cap? I am currently doing 7% 401k with company profit sharing (this year was 4% of salary, not employee contribution matching). I had started doing an after tax ROTH EE with my company 401k in fidelity, but was told I should maximize my current tax benefit and max out my 401k pre tax before I hit the income cap, then switch to 100% ROTH. SO many conflicting advices, I just want to know whats the correct thing to be doing! ", "score": 1, "replies": [{"body": "401k income limit is 270k, ROTH limit is 130k", "score": 2, "replies": []}]}]}, {"body": "Hollyshit, this is so gay fag", "score": 3, "replies": []}, {"body": "Never broke. You just give up", "score": 1, "replies": []}, {"body": "Hear hear", "score": 1, "replies": []}, {"body": "No spoilers, but I wonder what homeless people gamble on...", "score": 1, "replies": [{"body": "You don't remember bum fights?", "score": 5, "replies": []}, {"body": "Craps table\n\n\nSource: am New Orleans", "score": 1, "replies": []}, {"body": "probably RAD", "score": 1, "replies": []}]}, {"body": "\n\n *\"I never go all in because I always hold this one $100 Chip, that way I'm always in the game\"*", "score": 1, "replies": []}, {"body": "or just invest in weedstocks r/usweedstocks", "score": 1, "replies": []}, {"body": "Yes, Roth IRA is great. Someday you’ll be like me, earning too much money to have one, So make sure to max yours out every year no matter what. ", "score": 1, "replies": []}, {"body": "I wish I read this 5 years ago. Thanks for the write up ", "score": 1, "replies": []}, {"body": "You cuck get the 2% cash back credit card.", "score": 1, "replies": []}, {"body": "Roth IRAs don't get employer contributions dumbass.", "score": 1, "replies": []}, {"body": "Is there anyway to get flair without going broke tho?", "score": 1, "replies": []}, {"body": "what the FUCK is this??????", "score": 1, "replies": [{"body": "Obviously, you're not a golfer.", "score": 2, "replies": []}]}, {"body": "I feel proud because this is my day to day advice that I live off of. I have my retirement account and I have my play trading account. When I lose on my trading account I don't lose at life. \n\nThanks and own where you live. Don't pay rent. But you might need to save for that.. ", "score": 1, "replies": []}, {"body": "It’s not over it just restarts ", "score": 1, "replies": []}, {"body": "Great advice. Emergency fund. Force yourself to be conservative in some areas off tour life. Recognize addiction if you’re addicted (like me).", "score": 1, "replies": [{"body": "Coke is a silent assasin", "score": 2, "replies": []}]}, {"body": "Wait, this isn't r/wallstreetcirclejerk?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "My bad, Roth 401k. A post tax retirement account. Whatever you want to call it.", "score": 0, "replies": []}]}, {"body": "But I LIKE peanut butter.", "score": 1, "replies": []}, {"body": "Sage advice", "score": 1, "replies": []}, {"body": "This is good advice. Not gonna follow it but thanks. ", "score": 1, "replies": []}, {"body": "This is the wrong sub for this shit. If I wanted personal finance advice, guess where I'd go? Fucking r/personalfinance. \n\n\nIf you come to r/wsb for personal finance advice you've got bigger problems in your life.", "score": 1, "replies": []}, {"body": "If you have a cool mill in a $5500 contribution/year Roth IRA then please link me to your money manager and whatever insider information he is abusing", "score": 1, "replies": [{"body": "mitt romney has like 100 million in his Roth ", "score": 1, "replies": []}]}, {"body": "when WSB is just r/personalfinance, you know the market is fucked", "score": 1, "replies": []}, {"body": "mods, ban this smuck", "score": 1, "replies": []}, {"body": "Emigrant bank spinoffs like Dollar Savings Direct are better than Ally for interest rates.", "score": 1, "replies": []}, {"body": "Good God, this is absolutely brilliant, and might be my start to escape suburban hell and move to the ciry! Though, number one, I've been in the middle of many arguments with my parents, I don't know how people simply cannot understand interest. I always have my card paid off, and I'm in a credit score rating that's pretty good, but don't get how people let it accumulate. Using the cash back for rent, now that's smart! Can't wait to see what other advice you have!", "score": 1, "replies": []}, {"body": "I think the real takeaway here other than OP being a huge fag is to long $V", "score": 1, "replies": []}, {"body": "I do all this shit and also lose money on options. Checkmate. ", "score": 1, "replies": []}, {"body": "Yeah either that or go 500x leverage on a offshore forex account ", "score": 1, "replies": []}, {"body": "This makes too much sense", "score": 1, "replies": []}, {"body": "Why high yield savings? Buy some corporate bonds from a cash heavy corporation & don’t lose money to inflation.\n\nOr Russia.", "score": 1, "replies": []}, {"body": "I hope you get raped till the room stinks for this faggot ass nonsense ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "He said bundle it so fucking bundle it", "score": 1, "replies": []}]}, {"body": "Citi has a 2% cash back card", "score": 1, "replies": []}, {"body": "I'm torn on this because yeah, there are probably mentally disabled people on this sub who need this advice, but also, WSB is supposed to be irreverent.  Fuck it, it's good advice.", "score": 1, "replies": [{"body": "Those were exactly my thoughts as well.", "score": 1, "replies": []}]}, {"body": "\"don't look at it\"\n\nFuck that. Choose good active fund managers and hold them accountable. This bogle cult (AA for investors) is going to be wiped out in the next bear.", "score": 1, "replies": []}, {"body": "Lol fuck off with this shait", "score": 1, "replies": []}, {"body": "Your post got the best vote from Robinhood forum", "score": 1, "replies": []}, {"body": "I already have a mil. Does that mean i retire?", "score": 1, "replies": []}, {"body": "1. 1.5 percent is dumb. Get rotating 5 percent cards or better yet get yourself an Uber card for 4 percent back at restaurants since none of you losers cook anyways\n\n2. Find yourself an independent guy. Have him shop polices. \n\n3. You don't need 3-6 months in ally. You need like maybe one month. If you own any stock that declines in value you just sell that and take the loses as carry forward write offs. Or you sell at high cause you pay way less on capital gains. My Ally savings is BRK.B.\n\n4. Don't do a 401k Roth and don't let your advisory plan the shit for you. If you do that they are going to do some Monte Carlo bullshit putting you like 20 percent in \"Real Assets\", 20 percent in Bonds all which have higher expense ratios. For example my Charles Schwab auto election puts like 50 percent in the MFS Value/Contrafund. I like Contrafund but both carry like .5-.7 expense ratios. They also offer a S&P500 fund for .03 but that never comes up on their allocation models. Weird huh? My last employer was the same way with vanguard funds. Putting me in dog shit bonds when I had the Total Bond Market available. \n\nAlso unless you are a poor fag if you are in the 25-35 percent bracket live up your life now and MAX a standard 401k. Retire early and live poorly. You will be able to since you 1. Won't have a fucking house payment but will still be able to live in your house without a nurse wiping your ass. 2. Can easily pick up a part time job 3. You can climb a roth ladder by converting your 401k amounts to Roth. Since you will have less income and the tax brackets will only increase you will be able to convert on avg ~50 a year without paying more than 12 percent of income taxes. Saving you 13 percent in the long run.\n\nSee here:\n\nhttps://www.gocurrycracker.com/roth-sucks/", "score": 1, "replies": []}, {"body": "Thought this was going to be about risk management for your trading portfolio instead of basic personal finance advice.", "score": 1, "replies": []}, {"body": "If you want \"surprise\" funds to play with, sign up for Digit and have their algos save as aggressively as possible. Within a few weeks, you find an \"extra\" $500-1000 sitting there and get to use it for fun YOLOs (or for BTFD).", "score": 1, "replies": []}, {"body": "You still pay taxes on your 401k bud.", "score": 1, "replies": []}, {"body": ">switch it to more bonds when you're older.\n\nmaybe if the return gets better", "score": 1, "replies": []}, {"body": "Where is the European version of this write up?  \nWe need an EU focused version including FUCKS and all.\nWe don't have 401k...", "score": 1, "replies": []}, {"body": "the realest shit a homie ever wrote......", "score": 1, "replies": []}, {"body": "What is this faggotry? I'm maxing all my payday loans on spx calls!", "score": 1, "replies": []}, {"body": "Whats a good card to get with bad credit ?", "score": 1, "replies": []}, {"body": "RemindMe! One year ", "score": 1, "replies": []}, {"body": "When you're young, it's OK to swing for the fences straight buying options and hoping to catch a merger or the like.\n\n\nThat being said, you will almost always make more money over the long haul SELLING options. If you're afraid or short on margin, do spreads. Every one of those option you bought that expired worthless? Somebody sold them and kept the premium.", "score": 1, "replies": []}, {"body": ">You can keep eating chicken instead of peanut butter.\n\nHave you never heard of [peanut butter chicken](https://www.bbcgoodfood.com/recipes/peanut-butter-chicken)?\n\nOP doesn't know what he's talking about. Don't listen to him.", "score": 1, "replies": []}, {"body": "I think you belong on reddit/r/investing fag. ", "score": 0, "replies": [{"body": "These retards can't buy my options if they're in the poorhouse.", "score": 22, "replies": []}, {"body": "For realz.  This is Wallstreet BETS.\n\nNot wallstreetsensibleinvesting\n\n", "score": 2, "replies": []}]}, {"body": "OG respek", "score": 1, "replies": []}, {"body": "I’ve been subscribed for a couple months and his is the closest to a non shit post I’ve read", "score": 1, "replies": []}, {"body": "Wrong sub", "score": -2, "replies": [{"body": "I go where I am needed.", "score": 16, "replies": []}]}]}
