{"title": "Real DD for Grubhub: Expect a massive beat on 5/1", "selftext": "A quick primer on what Grubhub is:\n\nGrubhub is an online and mobile food-ordering company that connects diners with local restaurants. Diners use their website or their app to order food from local restaurants, and then Grubhub will deliver the food from the restaurant to the Diners' residence.\n\n---\n\nTop line relevent data:\n\n- Average Alexa Ranking for Q1 2017: 4401.867\n- Average Alexa Ranking for Q1 2018: 2241.78\n\n- Organic Searches in Q1 2017: 6.911m\n- Organic Searches in Q1 2018: 13.341m\n\nGrubhub's website rank has halved in the past year, and their organic search hits have increased by 90%.\nReminder that Grubhub's business model is:\n\n- Customer goes on to their website\n- Customer buys food\n\nThis means that their revenue should be directly proportional to the traffic their website gets. Having your Alexa rank halve from 4400 to 2200 should indicate a traffic increase of 80-90%, and organic searches would seem to confirm this. This doesn't mean that Revenue will go up 80-90%, as not all visits buy something. I would conservatively estimate a revenue increase of 62% to $253m; the street expects a revenue increase of 46.9% to $230m. Also, if you take a look at when the analysts made their predictions, you see that all of them made their predictions a long ass time ago before this data was even finished.\n\nAs for the bottom line, know that Grubhub gets the overwhelming majority of its revenue from the United States, with the rest coming from the United Kingdom. This means they should be able to take full advantage of the tax cuts.\n\n--- \n\nReasoning + Proof of position:\n\n- Netflix previously reached an ATH on March 5th at $331.44. After it beat its earnings, it surpassed this ATH and hit $336.\n- Grubhub's ATH is currently $110.53 reached on Marth 12th. Similar performance after a beat should land it at $112.\n\nGrubhub reports premarket on 5/1, so buy the 5/4 calls.\n\nPositions:\n\n- 2x $102 5/4 Call\n- 2x $103 5/4 Call\n- 8x $104 5/4 Call\n- 2x $105 5/4 Call\n- Proof: https://imgur.com/a/Ci0lr\n\n---\n\nSources (Note: I cannot upload the csv files showing raw data so ill just snip the chart form of the data)\n\n- Alexa Rankings: https://i.imgur.com/ftdWikW.png\n- Organic Searches: https://i.imgur.com/H8jp5tO.png\n\n---\n\nTrack record: \n\nOnly other \"real DD\" I posted was this [OSTK put post](https://www.reddit.com/r/wallstreetbets/comments/84nlza/short_ostk_actual_dd_trade_proof_inside_earnings/), but will do more later if this one works out.\n\n---\n\nEdit: full disclosure if $GRUB somehow hits $112+ **before earnings** im selling my options \n\nAlso, at time of this post (9:00AM PDT, noon Eastern) $GRUB was trading at $102.33\n\n---\n\nEdit: rip me", "id": "8d6s60", "created_utc": 1524067497.0, "score": 270, "upvote_ratio": 0.98, "num_comments": 159, "comments": [{"body": "[deleted]", "score": 186, "replies": [{"body": "I actually posted about a great stock last night, realized what I had just done, then quickly went back and deleted the post before something terrible happened to the stock.", "score": 50, "replies": [{"body": "Too late, I already saw it and bought MU", "score": 42, "replies": []}, {"body": "what stock, fag? pm me", "score": 6, "replies": [{"body": "$vrx", "score": 1, "replies": []}]}]}, {"body": "- Owns Grubhub Shares In Paper Trading Account", "score": 2, "replies": []}]}, {"body": "Damn. This is real dd which means I actually have to read it. ", "score": 178, "replies": [{"body": "[deleted]", "score": 114, "replies": [{"body": "I legit believe that this lazy fucker theory is true. I think there is a much higher correlation between netflix, amazon, and these smaller lazy companies than people realize.\n\nGrubhub should be going up for the exact same reason those 2 companies are going up", "score": 16, "replies": [{"body": "Always bet on fat and lazy", "score": 12, "replies": []}, {"body": "Cramer is a clown, but he is right on his crusade about people lying on their fat asses, ordering pizza, watching Netflix and gaming; he’s right that stocks operating successfully in this world are killing it.*\n\nNot sure I’ll play el Grubbo, but reading ting I do regret not investigating the, sooner.\n\nSource: laying on my fat ass eating pizza and watching Netflix as we speak.", "score": 9, "replies": []}]}, {"body": "Dude, half the people in the whole foods I go to is instacart... About 10% of the people that go to my costco is instacart... this shit is real business. ", "score": 1, "replies": []}]}]}, {"body": "I'm not willing to risk it but I appreciate the no bullshit position, godspeed ", "score": 58, "replies": []}, {"body": "The premiums are hella high for 5/4", "score": 53, "replies": [{"body": "One does not simply play earnings without iv", "score": 21, "replies": [{"body": "But Apple and Microsoft are around 28%. Grubhub is at 77%", "score": 5, "replies": [{"body": "It is because there was a $20 increase one day after the earning report last time, wallstreet is hungry for this.", "score": 8, "replies": []}]}]}, {"body": "Sell some $90 puts then, you'd need a 14% movement downward to not profit.", "score": 8, "replies": []}, {"body": "Sell . Chomp chomp. I'm eating your theta. GrubHub slave! Get me more tendies", "score": 6, "replies": []}]}, {"body": "I'm out, stock is up over 100% over last year, and to break even on the 105 strike I need stock to go up by approx 10%. Too risky imo. Good luck though! ", "score": 30, "replies": []}, {"body": "Why would you buy the calls already instead of waiting until right before earnings? Aren't you just eating the theta decay loss for no reason?", "score": 20, "replies": [{"body": "Because I believe we will have a run up to earnings as more people realize that this is going to beat. The key here is all the analysts made their predictions a long time ago before february/march traffic numbers were even available and havn't adjusted.", "score": 21, "replies": [{"body": "I'm scared of options so I just did stocks. I'm also scared of options if the stock adjusts down before up.", "score": 13, "replies": [{"body": "Buy an ITM call and sell an OTM call, you have a greater chance of making profit and if you do lose, you lose less money. If you bought the $98 call for 5/4 ($1000) and sold the $104 call for 5/4 ($650), you would be profitable so long as the stock price was above $101.50 and only lose $350 at the most if things go badly. Your max gain is $250 though if the stock price goes past $104; however, if you only bought the $98 call and the stock price was $104, you would loose $400 instead.", "score": 12, "replies": [{"body": "Yes. But alas I'm super tight on moolah ATM. Bought 3 shares. Hopefully I will have one tendie before malnourishment kicks in.", "score": 3, "replies": [{"body": "Well 3 shares costs about as much as what the spread would cost, but you know your risk tollerance. [The spread improves your odds of making money by about 8%](https://imgur.com/a/FKf0F)\n\n", "score": 8, "replies": [{"body": "What tool is that?", "score": 4, "replies": [{"body": "Etrade options analyzer tool, most brokers have their own version of it.", "score": 6, "replies": []}]}, {"body": "What site is that?", "score": 1, "replies": [{"body": "Etrade, its their options analyzer tool.", "score": 4, "replies": []}]}, {"body": "What graph is that?", "score": 1, "replies": []}]}]}, {"body": "> Your max gain is $250 though if the stock price goes past $104\n\nForgive my ignorance, would you care to explain the math of this part please? Is it 6*100 from the profits of call plus the sold call of $650 then minus the premium on the 98 call, which is 1K? It adds up but I'd like to know for sure since I just started looking into options.", "score": 2, "replies": [{"body": "Sure, going by prices atm a 13:35PM EDT.\n\nBuy $98 Call GRUB 5/4 = $10.15\n\nSell $104 Call GRUB 5/4 = -$6.90\n\n----------------------\n\nNet Debit (what you spend) = $3.25 \n\n- Your max loss is $325/contract if the stock price is below $98, because of the credit for selling the call. \n\n- You will get money so long as GRUB is above $98/share, but since you paid $3.25 per share in the spread you need the stock price to be at $101.25 (98+3.25) to get back what you spent. \n\n- If the stockprice is above $104, the other person you sold the call to will take this amount, this gives max profit of $275/contract (104-98-3.25=2.75).", "score": 13, "replies": [{"body": "I was going to do a butterfly 107, 112, 117. Haven’t been able to do all the math yet but cost basis is max loss and that should be less than $100.  Max profit would be $500 less cost.  Not the riskiest play and return is capped but I got tired of straight call plays into earning. Stocks beat but not usually enough to make the premium back.  At least with this you have protection and a pretty wide window for profit.", "score": 1, "replies": []}]}]}, {"body": "So a bull call spread? On my to do list thanks. What do you think about both calls being otm?", "score": 1, "replies": [{"body": "There is a lower probability of profit, but if you feel really good about a company go ahead. If you want to go OTM, a bull put spread will generally net you more premium and its easier to close your position early.", "score": 1, "replies": []}]}]}, {"body": ">scared of options\n\nThis is the wrong board for you son", "score": 10, "replies": [{"body": "I'm \"diversified\" between r/stocks, r/wsb and r/investing?", "score": 12, "replies": [{"body": "Same", "score": 2, "replies": []}]}]}, {"body": "Smells like bitch in here", "score": 3, "replies": [{"body": "Yep. Seen too many of y'all's FDs go south", "score": 2, "replies": []}]}]}, {"body": "So if you're admitting that people know that it'll be a beat, why are you confident that the amount that the beat will be by is underrepresented in the current options prices?\n\nWhy isn't this information already available to everyone else?", "score": 6, "replies": [{"body": "Because markets arnt efficient and if you think it is then buy an index fund and open an ally banking account", "score": 18, "replies": []}, {"body": "P R I C E D I N\n\nR\n\nI\n\nC\n\nE\n\nD\n\nI\n\nN", "score": 17, "replies": []}]}]}, {"body": "Volatility reaches peak right before earnings, so the options tend to cost more. It's how people make money off selling right before earnings when the IV crush happens.", "score": 2, "replies": []}]}, {"body": "To play devil's advocate, does app usage reflect the same growth in web traffic that you've pointed out? As someone who has spent close to five figures last year across a number of food delivery services, I have never once placed an order through a website. I don't want to generalize because I don't have the slightest idea of usage patterns here, but I would wager the majority of actionable growth is through mobile apps. Your DD with Alexa ranking is interesting, but a look at other statistics shows that the site has a 60% bounce rate per unique visitor, which has only gone up over time, which says to me that in general, people who want to order food online have, over time, been increasingly likely to go to a competitor. But as you've pointed out, the entire space has been growing overall, so I don't doubt that Grubhub has experienced growth, just not the kind of numbers you're expecting.", "score": 38, "replies": [{"body": "5 figures? Jeez, how much do you eat", "score": 27, "replies": [{"body": "I take group orders for coworkers and meals are expensed to the company.", "score": 39, "replies": [{"body": "Do you keep the receipts and write them off on your own 1040?", "score": 10, "replies": [{"body": "I'm not very eager for the IRS to audit my taxes.", "score": 5, "replies": [{"body": "But you have receipts.", "score": 3, "replies": [{"body": "I've never been audited so I don't know how it goes, but what happens when they ask for a bank statement and see a net income equal to the sum of those receipts that I didn't report...", "score": 3, "replies": []}]}]}]}]}]}, {"body": "A lot of startups these days order lunch for their employees using GrubHub or similar companies. We use GrubHub in my office, and they order via web rather than mobile app.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Luckily American cities have literally millions and millions of people ", "score": 13, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "The post was a lot more serious than most on this subreddit, so people are expecting a more serious comment section, so sarcasm will not be assumed here", "score": 5, "replies": [{"body": "Ahhh, I see. It was a lot different a year ago when autism was constantly assumed. I like the changes here dude, this is cool. ", "score": 3, "replies": []}]}, {"body": "My bad I'm retarded ", "score": 1, "replies": []}]}]}, {"body": "but then again, most cities keep on getting larger and more densely populated?", "score": 2, "replies": [{"body": "One day we will be Coruscant.", "score": 4, "replies": []}]}, {"body": "Uber eats is gonna run this new niche because of this. ", "score": 2, "replies": [{"body": "Uber eats is pure trash you have to pay like $15 for a $6 meal at McDonald’s. ", "score": 2, "replies": []}]}, {"body": "This is WSB. We really only care a few months out, or a lot are looking to do options plays around earnings.", "score": 1, "replies": []}]}, {"body": "Keep in mind Grubhub also owns a whole portfolio of food-ordering companies:\n\n>OrderUp, Seamless, AllMenus, MenuPages, Restaurants on the Run, DiningIn, Delivered Dish, Eat24 and LAbite\n\nI doubt these factor into the Alexa rankings, but I haven't done anything more than cursory research here.", "score": 4, "replies": []}, {"body": "I would assume google analytics tracks forwarding to apps. If you Google some restaurants they will give you a takeout/delivery option which will show the provider options to redirect you to an app.", "score": 2, "replies": []}]}, {"body": "Careful. Stocks tend (recently at least) to dip after crushing earnings.", "score": 9, "replies": []}, {"body": "Take a look at this.  6 months of Organic search traffic on the bottom, 6 months of stock price on the top.  PRICED IN SON!  https://imgur.com/a/2vM35", "score": 9, "replies": []}, {"body": "What about Uber Eats, Amazon Prime Now and PostMates? ", "score": 7, "replies": [{"body": "All food delivery is in a massive secular trend up, but Grubhub is the only public company that you can actually profit off of right now. GL buying options for uber/postmates/doordash.\n\nAmazon prime now is not in the same category; they deliver mostly grocery essentials and household items like toilet paper. The rest of the players mentioned do fast food and restaurant food.", "score": 15, "replies": [{"body": "> Amazon prime now is not in the same category; they deliver mostly grocery essentials and household items like toilet paper. The rest of the players mentioned do fast food and restaurant food.\n\n\n\nThen why do they delivery my hangover meals every Sunday? ", "score": 9, "replies": [{"body": "GRUB has an advantage in the sector right now. [Per this September article they have 34% of the market cornered vs 20% from UberEATS and 11% from Amazon](https://www.fool.com/investing/2017/09/29/will-grubhub-inc-sink-or-swim.aspx).\n\nThe key advantage to GRUB vs the others is the point to sales system they can offer restaurants on top of the customers they have on the app. \n\nThey have seen growth despite AMZN and Uber being in the game for almost 4 years now. Uber has been killing it recently though. IMO the race is between GRUB and Uber and Uber has the pull internationally speaking.", "score": 7, "replies": [{"body": "I just like talking to you. ", "score": 6, "replies": [{"body": "", "score": 3, "replies": []}]}]}]}, {"body": "you can order food from restauraunts on amazon , that being said they don't have a huge list available.", "score": 1, "replies": []}, {"body": "Secular?", "score": 0, "replies": [{"body": "As opposed to religious", "score": 6, "replies": [{"body": "Lol I know what the word means I just have no idea how it applies to grubhub's upward trend", "score": 0, "replies": [{"body": "I was being sarcastic; you clearly dont know what it means lmao", "score": 4, "replies": [{"body": "Oh I guess I didn't know what it means in terms of investing lol. Care to share?", "score": 1, "replies": [{"body": "How about you use context clues. And maybe sound it out with your mouth and think of similar sounding words. Like a baby would. Or look it up, like a real fag", "score": 2, "replies": []}]}]}]}]}, {"body": "Online food delivery is up for all players. Grubhub doesn't have to steal share from someone else to benefit. ", "score": 1, "replies": []}]}]}, {"body": "PostMates is straight ASS, also \n\n1. idk anyone who uses Uber Eats\n\n\n2. Wtf is Amazon Prime Now?", "score": 3, "replies": [{"body": "> Wtf is Amazon Prime Now?\n\n\nBruh, you haven't lived. It's the greatest shit.  Get shit delivered the same day, groceries, items and restaurant orders. ", "score": 1, "replies": [{"body": "Is that part of a prime membership or do you have to pay extra?", "score": 1, "replies": [{"body": "There's a delivery charge for groceries and restaurants. I think it's $4.99, or free if over $40.  \n\n\nOnly available in certain areas.  Just go to your app store and type it in, as it's a separate app than regular amazon. ", "score": 2, "replies": [{"body": "fug ya im gonna try that shit out", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Appreciate the insight.  Wish for more posts\nlike this. The overstock one was interesting as well.  Like to see the discussions afterwards on how people agree or disagree with the thesis.  This is the shit WSB needs.  Make WSB great again.  ", "score": 6, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Your \"professional estimates\" show a flat line through 2016 and 2017 when the released financial statements show that grubhub grew by ~40% during that period. The fact that is starts on an uptrend near the tail end of 2017 merely confirms the acceleration of growth from 40% upwards.", "score": 1, "replies": []}]}, {"body": "What's your gains now? ", "score": 6, "replies": []}, {"body": "Well... this is awkward.", "score": 5, "replies": []}, {"body": "Good write up, but in no fuckin universe does a 90 or even 200% increase in front end traffic translate to +62% net rev 😂\n\nThey’ll beat by a little, 48-50% yoy, but operating costs doubling from the expansion and tax change charges are gonna rip this bitch this time\n\n5/18 90P \n6/15 90P\n", "score": 5, "replies": [{"body": "In q4 2017, Grubhub's average traffic rank compared to q4 2016 went from 3882 to 2638 representing a decrease of 32%. That quarter, revenue increased 49%.\n\nThis quarter, Grubhub's average traffic rank went from 4401 to 2241, representing a decrease of 49%. Also, it is harder to improve traffic ranking the lower you get.", "score": 4, "replies": [{"body": "As mentioned earlier in the thread ^^ mobile use and installed base growth is where the real revs are derived\n\nThey’re just priced too perfectly right now, the expansion is great for them long term and could result in an AMZN buyout one day, but that PE is coming dooooown to 80ish one way or another\n\nAnyhow, GL, I’m betting the other way tho\n", "score": 3, "replies": [{"body": "The fact that you are trading this off the pe makes no sense. Are you short amzn and nflx too? You sound like a poor mans einhorn. I’m with op.", "score": 3, "replies": []}, {"body": "i agree with you. I'm thinking about those 6/15 puts", "score": 1, "replies": []}]}]}]}, {"body": "RIP", "score": 4, "replies": []}, {"body": "Welp.", "score": 4, "replies": []}, {"body": "Those is some high premiums. It's okay, buying shares though ", "score": 3, "replies": [{"body": "Same here.", "score": 3, "replies": [{"body": "Sounds gud to me", "score": 1, "replies": []}]}]}, {"body": "Grubhub might continue to grow short term but there’s no way this company is viable long term. There is way to much competition in that industry with literally no barriers to entry. Amazon and/or Ubereats will eventually wipe them out when they get their shit figured out ", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "There are too many players in this space, they have to compete against amazon, ubereats, postmates, doordash, etc.\n\nNot to mention local options. When I went to school in Boulder everyone used HungryBuffs.com\n\nAs the industry matures, margins are going to decrease and/or costs will increase with so many competitors. They don’t do anything special that sets them apart.\n\nI never said that networking with restaurants and getting users is easy, and I’m not saying I could do it better than they can. I’m only saying I wouldn’t put my money in GrubHub long term.", "score": 1, "replies": [{"body": "1) Ubereats doesn't have the same lucrative partnerships with massive chains that grub does (see partnership with yum brands, which owns both KFC and pizza hut) \n\n\n.\n2) Grub has lower fees (that the restaurant has taken out of their profit margins)\n\n\n.\n3) Ubereats advantage comes from huge network of drivers which allows fast delivery; but grub is also expanding into takeout rather than just delivery which is also often cheaper for restaurants and poses less risk of dissatisfied customers (cause food gets shitty when it has to be delivered a long way) \n.\n\n\n4) as a comment above indicated, there's room at least in the short term for both grub and ubereats to gain market share as they take customers from places like postmates and doordash; they're both definitely on top, but uber going up /=/ grub going down\n.\n\n\n5) services like grub have massive brand loyalty/recognition especially in large cities where local small services (like HungryBuffs) don't have as much sway over consumers\n.\n\n\n6) rn amazon is only doing grocery delivery etc; bit late for them to to suddenly jump into food ordering/delivery", "score": 2, "replies": []}]}]}, {"body": "I thought that exact same thing about NFLX @ $30. Same with FB @ $25.  ", "score": 1, "replies": []}]}, {"body": "wHaT aBoUT uBEr EaTs ThOo??", "score": 3, "replies": []}, {"body": "you still on board with this thesis my niqqua?", "score": 3, "replies": [{"body": "I was clearly wrong on there being any run up to earnings, but I am going to reload and buy some calls using a portion of my amazon profits", "score": 1, "replies": [{"body": "nice, I think i'm gunna go all in shares since premiums are high", "score": 1, "replies": []}]}]}, {"body": "No DD here-\n\nI’ve been a devout Grubhub customer since they absorbed my college ordering service 5-6 years ago, and I think they’ve finally lost me as a customer forever yesterday.\n\n40% of my orders never show up because their drivers are so unreliable. One of them defaced my apartment building and I got tied up in a legal issue from it. The times the food does show up, it is cold or the wrong order, and every time they botch a $30 order, they offer me an insultingly low $5-$10 credit for my next nightmare experience.\n\nThis has only been consistent for the past 4 months. Maybe it is my area. ", "score": 6, "replies": [{"body": "What does this actually have to do with anything lol", "score": 4, "replies": [{"body": "Just an anecdote. Might actually speak to their growth- but I can’t be the only one being consistently dicked over.", "score": 1, "replies": []}]}, {"body": "I've heard similar horror stories from UberEats. It seems the delivery companies give you like 0 compensation for wrong orders / late orders.", "score": 2, "replies": [{"body": "CC chargeback. I don't even bother dealing with that shit anymore. Open dispute->item didn't arrive/item wasn't as described->money back immediately->1 month later dispute resolved and money back for good.", "score": 3, "replies": []}, {"body": "I'm sure the stories are similar. But GrubHub has been in the biz for quite a bit longer, and I probably had less than 3 issues the first 4 years or so I used GH.\n\nIt seemed like there was a point in time where GrubHub changed from just passing off orders to restaurants who delivered their own food, to providing their own sub-par GrubHub drivers to haphazardly scramble trying to get food delivered. ", "score": 2, "replies": []}]}, {"body": "Same here, I hate GH. ", "score": 1, "replies": []}]}, {"body": "OP deserves a ban if they miss", "score": 4, "replies": []}, {"body": "I've been seeing grubhub coupons for $10 off your first order at just about every restaurant this past week. Do you think this increase in traffic is due to that? This promotion may drag their bottom line down short term until new customers become regulars. ", "score": 2, "replies": []}, {"body": ">Marth  \n\nDD literally worthless. ", "score": 2, "replies": []}, {"body": "Good DD, but by the logic of your own DD, shouldn't this newfound recognition be deferred until the next quarter? Like, if their organic searches are significantly up this quarter, wouldn't it take some time for that to reflect in terms of generating revenue? ", "score": 2, "replies": [{"body": "If you think of Grubhub's industry, I don't think that would be the case. If a customer were to search for food delivery today, why would they wait a month before actually making a purchase? A customer looking for food delivery is almost certainly going to order that food and not wait a quarter.\n\nAlso, even if they did delay for a quarter for some reason, then it would be reflected in guidance and the stock would go up anyway.", "score": 3, "replies": []}]}, {"body": "never even bothered looking at competetors like grubhub and just used ubereats because I already have an uber account, short grubhub", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes, actually when I am home (I live in a city where everything is close) I order McDonald’s a shit ton. That’s because I eat a lot and McDonald’s is way cheaper for a lot of food than most ubereats resturants. It’s actually the most convenient thing, and it’s really bad cause I got in the habit over the summer of getting McDonald’s delivered at 1am. Where I live it’s delivered in 20 minutes which is the fastest you can order literally anything, but if you live far from one it might take 30 minutes to an hour. And most of my experiences have been good (sometimes they forget sauce or mess up the order like any McDonald’s), they keep the food well packed and hot, and if you have any issues ubereats support is very good to loyal customers.", "score": 2, "replies": []}]}]}, {"body": "Solid, saw your overstock write up and regretted not following it,  Will likely look at bull credit spreads after the IV run up.  (Selling put spreads)", "score": 2, "replies": []}, {"body": "Thanks for this post. Just put my lifesavings up on grubhub.", "score": 2, "replies": []}, {"body": "I'm in. 4x $102 5/4C. Thanks for the DD. ", "score": 3, "replies": []}, {"body": "Useless in my area, none delivers", "score": 2, "replies": [{"body": "Wow thanks for the insight ", "score": 4, "replies": [{"body": "Uw dad", "score": 3, "replies": []}]}]}, {"body": "We used to have a lot of actual DD like this before the sub was invaded by wanna be comedian photoshop experts. We used to have actual traders here. Now everybody just wants to be funny.", "score": 2, "replies": []}, {"body": "Grubhug to smash earnings?? Will it pop like Netflix? Or am I autistic?", "score": 1, "replies": [{"body": ">Grubhug\n\nThis sounds like a much sketchier yet funnier app", "score": 3, "replies": [{"body": "Soo now I'm either autistic or a genious because I've created a hot new app. Y'all better not screw this up for me!", "score": 1, "replies": []}]}]}, {"body": "Alright, let's take a stab at it. Just opened the 102/112/122 butterfly for 2.15.", "score": 1, "replies": []}, {"body": "Bought 5 calls of the 5/4 105s", "score": 1, "replies": []}, {"body": "I wonder how much of the traffic is cannibalization from Seamless.  I've been a seamless user for some time now, but when I learned that there were more Grubhub options in my neighborhood, I technically became a 'new' grubhub customer, however this was to no benefit to Grubhub as I stopped using Seamless.", "score": 1, "replies": [{"body": "Heres an image with grubhub in green and seamless in yellow. Seamless has also substantially increased in traffic from Q1 2017 to Q1 2018, although not as much as grubhub.\n\nedit: forgot to link the pic lmao https://imgur.com/a/pphJq", "score": 2, "replies": []}]}, {"body": "What was the traffic increase from Q4 last year to recent Q4?  And what was corresponding revenue increase?", "score": 1, "replies": [{"body": "See this: https://www.reddit.com/r/wallstreetbets/comments/8d6s60/real_dd_for_grubhub_expect_a_massive_beat_on_51/dxktgw7/?context=1", "score": 1, "replies": []}]}, {"body": "I noticed last night that GRUB was in the 88% IV Rank. Interesting. Thanks for the DD man.\n\nedit: There's like no volume in the options for this though until may 18, a bit concerning", "score": 1, "replies": [{"body": "yeah some conspiracy level shit is going down right now; morgan stanley just downgraded GRUB to 100 today? someone somewhere is orchestrating some nonsense! u/SEC get in here!", "score": 2, "replies": [{"body": "Why would there be a conspiracy?", "score": 1, "replies": []}]}]}, {"body": "Nice chart.  I would just be concerned the market will already be in sell mode by then.  Will definitely keep an eye on this one in case there are tendies to be made that day!", "score": 1, "replies": []}, {"body": "I can't believe the stock is over $100. I remember looking at it after they tweeted against Trump and it was hovering around $40.. just last year", "score": 1, "replies": []}, {"body": "Don’t they also own Seamless. What % of their revenue is actually grubhub.com? Your projections are only for that domain. ", "score": 1, "replies": []}, {"body": "Less than 100 open interest on most of these call options. IV’s already indicating a move of 13% +/-. They’re also up huge for the year already, looks like most of this is already factored into the option price. I would stay away unless you strongly believe the move will be greater than what’s expected or you’ll get IV crushed.", "score": 1, "replies": []}, {"body": "We use GH all the time once it expanded in our market earlier this year. Prior had used Uber Eats exclusively. Uber screws up all the time though and cancels literally 15% of our orders for stupid shit. GH has been much more reliable, though it's still not perfect. What is good however is their resolutions via app that favor the customer. That makes them our go to food ordering app. ", "score": 1, "replies": []}, {"body": "I don't see GH as a long-term play. Website growth doesn't mean too much, as their target audience should be using the app. Regarding traffic, you're assuming roughly 1:1 ratio with traffic and purchases. I'd bet a decent % of traffic comparison shops between GrubHub, UberEats, DoorDash, etc.\n\nThen take a look at their app compared to Door Dash or Uber Eats....GH charges higher fees, half the time the menus are wrong or missing chunks of items, along with what seems to be worse service.\n\nNew users aren't going to go to one app and stick to it. I see market share only going down from where they are unless they make some big changes.\n\nNote that a lot of this is anecdotal, but my take is this may be a decent short-term play, but I don't see it having legs long-term.", "score": 1, "replies": []}, {"body": "Soon nobody will leave their house, they'll be jerking off all day eating pizza delivered by GrubHub. Bought and sold with Mommy's money.", "score": 1, "replies": []}, {"body": "Winter sucked, I know all I did was order Grub. All In.", "score": 1, "replies": []}, {"body": "Yeah but If they beat are they still going to go down? ", "score": 1, "replies": []}, {"body": "Solid DD, thanks", "score": 1, "replies": []}, {"body": "Google trends data ain’t too promising.\n\nYou got any idea on their ad spend to generate the traffic uplift you mention?\n\nAware of marketing costs being a point of concern in previous reports?\n\nCompany has flown too high too recently for my tastes.. suggesting a beat is um.. priced in. \n\nBut idk. Just fucking about here, not looking in any depth.", "score": 1, "replies": []}, {"body": "DD: I just got a coupon for $12 off my first order on GrubHub this morning.\n\nSo IMO they tryna pump those numbers which means nah I don't think we're beating guidance my dude", "score": 1, "replies": []}, {"body": "Loading up on the faggiest of D's.", "score": 1, "replies": []}, {"body": "Good job but you missed the HUGE LOSSES THEY ARE TAKING FOR THEIR DISCOUNT CAMPAIGN. You can get $10 off on your orders which they have to fork out ", "score": 1, "replies": [{"body": "thats only your first order tho", "score": 1, "replies": []}]}, {"body": "i fucking hate grubhub and they put their cancerous web UI over my prior favorite food ordering site eat24...  have you seriously ever orseres food using that site or app?  straight garbage yo👎", "score": 1, "replies": []}, {"body": "I am short selling 10 shares of GRUB, See you on the other side", "score": 1, "replies": []}]}
{"title": "This is why Tesla stopped Model 3 production this week", "selftext": "", "id": "8d85xb", "created_utc": 1524077784.0, "score": 11988, "upvote_ratio": 0.92, "num_comments": 205, "comments": [{"body": "I can't tell if this is fake or not, I really can't", "score": 1866, "replies": [{"body": "I mean the IG:god wasn't a dead giveaway? ", "score": 78, "replies": [{"body": "Barely noticed that, I aint familiar with instagram. Young people stuff. I am just 21", "score": 46, "replies": [{"body": "[deleted]", "score": -12, "replies": [{"body": "Your anecdote does not refute theirs", "score": 10, "replies": []}, {"body": "/r/woooosh", "score": 1, "replies": [{"body": "I guess so. ", "score": 2, "replies": []}]}]}]}]}, {"body": "I can tell, by the pixels. Spend more time on the internet, my friend.", "score": 486, "replies": [{"body": "Couldn't like somebody get the HTML and edit it or something.", "score": 211, "replies": [{"body": "Inspect Element, yes", "score": 173, "replies": [{"body": "Honestly surprised this isn’t more common, I’m a web dev by trade and seem to always blow people’s hair back with the most menial task of editing HTML in the inspector ", "score": 25, "replies": [{"body": "change \"password\" on a friends computer to \"text\" if they have cookies. I love freaking people out with that one.", "score": 4, "replies": [{"body": "I've used this a couple times to remind myself what a certain Wordpress password was that I chose, it was cached in my browser I just couldn't remember what it was. Chance your  friends instagram followers number to a massive one, screenshot it and tell them they just went viral", "score": 3, "replies": [{"body": "I'm pretty sure other browsers have this, but if you're using chrome you can go to passwords.google.com and login to see your cached passwords. It's super handy, I use it a lot.", "score": 3, "replies": [{"body": "That is if you allow Google to store your passwords on their servers. Otherwise, you can still see them in the settings of the browser.", "score": 1, "replies": [{"body": "Yeah you do have to be logged in to your account", "score": 1, "replies": []}]}, {"body": "Super handy or super stupid...me thinks super stupid. Just remember your God damn passwords or use last pass.", "score": 1, "replies": [{"body": "Considering 70% of my passwords are 30+ character random strings, I'm not sure if I'd be able to remember them.", "score": 1, "replies": []}]}]}]}, {"body": "Shit i haven't realised that :O thanks dude :D", "score": 2, "replies": []}]}, {"body": "You always forget that not everyone knows about it even though it is one of the most basic tasks. ", "score": 2, "replies": []}]}, {"body": "[Takes like 20 secs at most](https://i.imgur.com/e0er61Z.png)", "score": 160, "replies": [{"body": "/u/Violent_Blue says he can do it in ten, sorry but we’re going to have to give him the contract. ", "score": 94, "replies": [{"body": "[deleted]", "score": 72, "replies": [{"body": "But I can do it in sixteen hours... for free.", "score": 4, "replies": [{"body": "Time is money, my dude.", "score": 2, "replies": []}]}]}, {"body": "I can do it in 5", "score": -1, "replies": []}]}, {"body": "inspectelementyes.com", "score": 2, "replies": []}, {"body": "Damn, Ol'Musky fooled me again!", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 26, "replies": [{"body": "Or Firefox.\nOr Opera.\nOr Chromium.\nOr literally every modern and good browser.", "score": 4, "replies": [{"body": "Hell, even IE12 and Edge can do this.", "score": 2, "replies": []}, {"body": "Forgot Brave", "score": -1, "replies": [{"body": "Out of all the browsers, Brave? Its market share is so minuscule it's not even on the market share lists.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Sure...", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Sorry senpai, I'm still new.", "score": 34, "replies": []}, {"body": "You can tell it by the way it is", "score": 11, "replies": []}, {"body": "Upvote because I'm old enough to remember this meme. ", "score": 6, "replies": [{"body": "Got a few responses calling me an idiot with upvotes, but i've seen quite a few shops in my time. Kids these days, sheesh. ", "score": 1, "replies": []}]}, {"body": "Or the watermark lol.", "score": 2, "replies": []}, {"body": "You can tell by the pixels? Man someone so arrogant shouldn’t be so dumb", "score": 7, "replies": [{"body": "He's probably seen quite a few shops in his time tho tbf", "score": 8, "replies": [{"body": "People don't get this reference \n\nFeels bad man", "score": 10, "replies": [{"body": "Seriously there's like 3 or 4 people who aren't getting it at all. They also probably don't know what feels bad man means at this rate. Damn children get off my lawn. ", "score": 5, "replies": []}]}]}, {"body": "Someone who is new to the internet shouldn't get their jimmies russled by a well known classic joke. ", "score": 3, "replies": []}, {"body": "The fact that you are at +6 is said. Its an old meme. Do you have your mommie's permission to be online?", "score": 2, "replies": []}]}, {"body": "Also 666 likes", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "...he says, on the internet", "score": 4, "replies": []}]}, {"body": "r/imverybadass ", "score": -2, "replies": [{"body": "/r/idontrecognizememes", "score": 1, "replies": []}]}]}, {"body": "If I get 3000 upvotes I'll tell you", "score": 53, "replies": [{"body": "If I get 3000 upvotes I will upvotes this guy so he can reach 3000 and we can know the answer.\n", "score": 24, "replies": []}, {"body": "I thought this was funny, sorry others didn’t :(", "score": 2, "replies": [{"body": "I upvoted, sorry others didn’t :(", "score": 4, "replies": [{"body": "3000 upvotes and I'll upvote it", "score": 15, "replies": [{"body": "Git’er rolling boys! On the road to 3K!", "score": -3, "replies": []}]}]}]}]}, {"body": "currently they are having production issues.i would say it's all planned out.\n\nsource: it's work related ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1953, "replies": [{"body": "Also bringing an upper stage back from orbital velocity using a giant party balloon, and something about driving a Model 3 while listening to Lil Wayne.", "score": 387, "replies": [{"body": "*Boutta take off on you peons and go back to Mars*", "score": 136, "replies": []}, {"body": "Wait did he really reference lil Wayne? I can't tell anymore with him", "score": 22, "replies": [{"body": "He considers Kanye West his hero. Referencing lil wayne aint that weird.", "score": 21, "replies": [{"body": "Who amongst us _wouldn't_ consider yeezy our spirit animal?", "score": 15, "replies": []}]}]}]}, {"body": "Oh come one it was obviously fake but I still got my chuckles out of it. Real Elon would be asking for 3 million likes.", "score": 54, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Link? ", "score": 1, "replies": [{"body": "https://m.imgur.com/gallery/QXuvA\n\nEnjoy", "score": 7, "replies": [{"body": "No longer available :(", "score": 1, "replies": [{"body": "Huh, works for me.  Anyway just google elon musk horse and it will show up.", "score": 2, "replies": [{"body": "Thanks! Pretty funny tbh", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Lmfaoo", "score": 17, "replies": []}, {"body": "The fact that you're not 100% sure it's fake... makes you think.", "score": 3, "replies": []}, {"body": "You mean a jump house?", "score": 0, "replies": [{"body": "I think you mean jumping castle", "score": 5, "replies": []}, {"body": "Jump house ", "score": 2, "replies": [{"body": "Jumpy bouncy housey", "score": 1, "replies": []}]}]}]}, {"body": "I'm Poe's Lawing pretty hard right now", "score": 260, "replies": [{"body": "He's said some mad shit on twitter before so the only way to see if he posted it is to go through his twitter yourself.  ", "score": 56, "replies": []}]}, {"body": "Elon: Our automation tech is too advanced! Back to having humans do stuff!  \n\nAlso Elon: Have more humans already working per car than any other factory in North america.  ", "score": 174, "replies": [{"body": "Just targeted via Facebook such that it can all be true at the same time!", "score": 22, "replies": []}]}, {"body": "is there any kind of bullish analysis that would explain the +2% price movement today? I can't imagine any other company announcing this news and avoiding a catastrophic sell off...", "score": 133, "replies": [{"body": "Tesla loses money making Model 3. By stopping production of Model 3 they actually increase value of the company.", "score": 413, "replies": [{"body": "Elon Musk is a genius", "score": 96, "replies": [{"body": "Every time I restore a Ferrari I lose so much money. Not restoring ferraris is going to make me so much money! ", "score": 33, "replies": []}, {"body": "If he declares bankruptcy under trump economics, he gets a billion dollars ", "score": 8, "replies": []}]}, {"body": "Anything that makes the news is free advertising. So, yes, he is a genius!", "score": 3, "replies": []}, {"body": "Really? That's kind of funny. ", "score": 1, "replies": []}, {"body": "That's why he left the Trump board. Trump wasn't on board with the idea that not producing stuff is the real money maker.", "score": 1, "replies": []}, {"body": "there is no way that they lose money on the model 3 currently. They only sell one of the most optioned cars.", "score": 1, "replies": []}]}, {"body": "They're being investigated by workplace safety regulators. This is good for Tesla. ", "score": 72, "replies": [{"body": "[deleted]", "score": 107, "replies": [{"body": "All news is good news for Tesla", "score": 21, "replies": []}]}, {"body": "Screw musks record of lying \n\nhttps://www.revealnews.org/episodes/tesla-and-beyond-hidden-problems-of-silicon-valley/", "score": 6, "replies": []}, {"body": "notably, people are getting hit by forklifts at their factories because musk hates yellow so there aren't any caution lines.", "score": 3, "replies": [{"body": "Source?", "score": 2, "replies": []}]}]}, {"body": "> Asking for TSLA bulls to out themselves during this hate-on for TSLA. \n\nOK McCarthy. So you can take our families out of town and kill us?\n\nI'll bite, and go on a little tangent for the \"overvalued!\" crowd. I can't explain today's \"2% gain\" because, I mean, fuck, Elon can tweet a stool sample and it would go up by more. But, overall: In the grand scheme of things, nothing has changed. As a guy who is nearly 100% focused on tech, the entire plan of these guys (the tech visionaries who have produced the top 10 market cap companies) is to burn as much cash as humanly possible until your platform (your \"machine\") hits escape velocity. This is not a quarterly event. This is not a linear event.\n\nProfit and dividends are BAD, because it creates an insatiable thirst for more by shareholders. Which comes at the expense of growth & development. In a rare-time I agree with a shit-talk about Google: \"Google has [billions] in cash because they don't know what to do with it; they're out of ideas\" \n(I disagree with the statement being accurate today, but the underlying is true). In almost any tech investment circle, dividends come when ideas run out. \n\nThree things that must be true to continue: 1) Tesla is not a car company. 2) The success of **all** EVs is beneficial to Tesla's profitable end-game 3) Elon Musk can achieve his end-game goal (just like Beezy is doing, and just like Page/Brin are doing) \n\nThe brand factor hasn't changed. The supercharger network is growing incredibly fast. And if you look at Tesla's end game as a \"motor\" company, you never should have been involved in the first place. I/we understand that's how it looks in front of us right now, but that's not the end game that tech investors are betting on. \n\nNow, that brings us to a little sidebar about tech and valuations in general, so pardon me for a little ENJOYABLE DISCUSSION for anyone interested:\n\n**Tech investor valuations are based on total potential profits of the endgame and a multiplier for how likely the visionary is to succeed at doing such.** I didn't decide this, capital investors did. Yes, this is after the wonderful end of the 1990s. \n\nThe stock price for tech platforms will never be in line with \"traditional\" valuations (again, until escape velocity...they seem to grow into their shoes, GOOG, AMZN and NFLX are perfect examples). Those days are over. Tech platforms were not a conceivable idea when these valuation formulas were created. (What was WMT taking 50+ Years building a vast, expensive distribution & store network and hiring 2.1M people to become Americas #1 store with 500B rev @ 25gross margin, 3%net)... Now you have a company like FB who can monetize half the world and become top5 market cap in 10Y and a with just recently hitting the 20K employee mark. \n\n\nFor anyone who wants to dabble into what makes a tech company solid vs. shit, and how tech investors think,  I always recommend you start with Thiel's Zero to One. \n\nIf someone is reading The Intelligent Investor and then applying that to figure out whether you should have bought NFLX 3 years ago, you are bringing a biology textbook to calculus class. But believe it or not, there were *clear* modern-day indicators NFLX was hitting escape velocity quite early on.   ", "score": 59, "replies": [{"body": "Or in sperg terms: it's like valve and steam. Why bother being a game developer when you can skim 30% off the top of every other game? But also having a dota, tf2, csgo that brings revenue and helps develop your wider platform. \n\nSell batteries, charging ports, and tech while reaping those benefits for your own flagship products.\n\nWill it work? Fuck if I know, but that's the idea.", "score": 21, "replies": []}, {"body": "What exactly does NFLX own that is worth money? \n\nI understand their business, but I just don't think it's worth anything. Why do you think it's worth anything without referring to what other people think about it? \n\nTheir content is worth a few billion, their IT is worth perhaps 1 billion. Their distribution deals, well add another billion per year. Now, how do we end up at their existing stock price? It does not compute. There is also a risk that NFLX stops producing interesting content. It is hard to continue to make binge worthy content and it's not all obvious that this will continue nor that people won't find some other kind of entertainment in the next decades (you have seen the stock price, right?). ", "score": 7, "replies": [{"body": "125 million subscribers paying ~$10 a month.", "score": 45, "replies": [{"body": "That's .. more than I thought it would be.", "score": 7, "replies": []}, {"body": "OK, so they are the first to be \"better than piracy\" for the masses. I suppose that represents some value until the next company comes along (Amazon already has a product, which is probably inferior at this point). Question is how long they can stay ahead. ", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "How long will they stay ahead, if you think the answer is so simple?\n\nMost people on Reddit are poor, so this is a bad investment platform regardless.", "score": 1, "replies": []}]}, {"body": "At this point they will stay ahead until the product is unviable because there are no content producers sharing media. Then they will have to survive on their own content alone.\n\nNo one else is entering this market. The big media producers are no longer willing to share and are developing their own platforms.", "score": 1, "replies": []}]}]}]}, {"body": "Excellent post.\n\nI just bought Theil’s book, thanks for the reccomendash.", "score": 2, "replies": []}, {"body": "So the question is that is Tesla a real high-tech company or a fancy auto maker (plus solar)?\n\nAlmost all of the major car makers have been developing autonomous driving for a long time they just don't make a lot of headlines. Another question is that are solar panels from tesla any better than other manufacturers in terms of efficiency. Lots of manufacturers incorporate driving assistance tech and active safety the what is separating Tesla from others apart from hype?\n", "score": 1, "replies": []}]}, {"body": "I'm a big tesla fan but I think their stock is way overvalued. Its basically people super optimistic about tesla controlling the electronic car and autonomous driving market. Ford is what $11 a share and sells how many more cars than Tesla? A lot of tesla's value comes in with their IP with creating batteries for cars and those analogs and unless the sell out other companies will eventually develop the same method.", "score": 14, "replies": [{"body": "what does Ford being $11 a share have to do with it. you can't compare companies purely on the price of their shares", "score": 48, "replies": [{"body": "Ok then, Ford's market cap is 44 Billion, TSLA's is 50 billion. \n\nI'd agree TSLA might be over valued. ", "score": 50, "replies": [{"body": "Because right now Tesla is a car company that makes energy products. In 10 years it'll be the opposite. With energy products making up 90% of the company. ", "score": 22, "replies": [{"body": "I can also play your game. In 15 years what they are making has almost no value. ", "score": 18, "replies": [{"body": "Yes, because mass storage for renewable energy generation, load balancing and microgrids have totally no value. If you think residential and commercial battery (or some kind of storage) isn't the future give your head a shake. ", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "If you don't know why grid scale storage is a tech with transformational growth potential, you don't know what Tesla's stock valuation is for.", "score": 9, "replies": [{"body": "If you think Tesla is going to suddenly beat out the thousands of Dams around the country for grid storage using lithium batteries you are delusional.\n\nBatteries aren't efficient energy storage and lithium batteries are already at the peak of their energy density, all you can do is make more cells to store more energy. Elon isn't actually doing anything that is tech, he's manufacturing things that come from tech companies.\n\nIf either they make cars or they make batteries, they are an industrial not a tech company. They are a hybrid of $F and $ENR with a market cap well above both and a market share of a thousandth of a percent of either.", "score": 5, "replies": [{"body": "> If you think Tesla is going to suddenly beat out the thousands of Dams around the country for grid storage using lithium batteries you are delusional.\n\nThey don't necessarily compete with dams. Tesla just installed a huge battery pack in South Australia where it's completely unfeasible to use reservoirs to store energy. \n\nEven in less arid environments, you don't always have a spare valley you can flood and kick out all of the current residents. The energy business will be huge for them.\n\n", "score": 8, "replies": []}, {"body": "Grid constraints drive lmp. Lmp arbitrage makes location more important to economics than lcoe. There aren't valleys everywhere. Look at NJs new storage mandate. You can't build 50gw of pumped storage in NJ.", "score": 2, "replies": []}, {"body": "> Batteries aren't efficient energy storage \n\nBatteries have a 90 charge and discharge cycle. So they are one of the most efficient energy storages available. Even pumped hydro is worse!.\n\nThe energy density is not import. The cost is the only factor which is important. You can already get 310+ miles out of a Model 3 LR. And there would still be lots of space to use. Its about the price not the energy density.", "score": 1, "replies": []}]}, {"body": "Why is packing 18650s or 21770s into bricks and connecting them in series or parallel such a big deal? Why cant others do it? ", "score": 2, "replies": [{"body": "It's not that others can't do it, it's that they aren't. ", "score": 3, "replies": [{"body": "May be because its a dead end technology? ", "score": 0, "replies": []}]}, {"body": "The cooling.... Nissan leaf - even the Bolt can't do it that well.\n\nlook up teslas cooling system for the battery. they use cylindric cells (your number say nothing about the density, power output, etc. They only say the width and length) | and they get rediculed for that by people like you.\n\nNot using cylindric cells is a mistake. A Tesla Model 3 (small battery) can charger about 30 % faster than a Bolt. -> Because of the climate controll system!\n\nThere is currently no electric car which match anything like this. And there won't be for a long time. Their competition will only really start at 2021.", "score": 2, "replies": []}]}]}, {"body": "You really don’t grasp how important energy storage is do you?", "score": 2, "replies": [{"body": "Oh it is, but it's already being done. Elon doesn't bring anything new to the table.", "score": 1, "replies": []}]}]}]}, {"body": "That's more like it. ", "score": 1, "replies": []}]}]}, {"body": "Tesla is lagging in car autonomy tech though. Waymo is miles ahead and even some of the GM and Volvo products are looking much more intelligent. I wouldn't be surprised if the Model 3 drivers who purchase the \"full autonomy\" package never get to use it and it just ends up being free money for papa Musk.", "score": 20, "replies": [{"body": "This", "score": 3, "replies": []}, {"body": "I'd be careful with that assumption. Good AI is a function of how much training data it has, and Tesla has one of the largest sources of real world autonomous driving training data there is.", "score": 10, "replies": [{"body": "Good AI is a function of how much data you have AND the quality AND the relevance to the problem. If I want to predict the odds you'll get sick, but I only have measurements of your body hair length, I probably won't do very well. The big question is can tesla develop self driving without lidar. Most experts say no, but time will tell. Teslas AI director karpathy is very talented but the success of the their AI program is still uncertain.", "score": 10, "replies": []}, {"body": "You can overoptimise easily, and unfortunately even throwing off the data a smidge has even the best AI convinced it's looking at something entirely different.\n\nex.\n\nTrain it to understand what a dog looks like. Now, with the 'warp' function, in a *VERY* minor way, apply a filter to rotate something a few pixels in a whirlpool just a couple degrees off- not much, enough that ANYONE can tell it's *definitely still a picture of a dog* but the AI will suddenly think it's something *way* off the mark. I'm talking 'elephant' or 'chimpanzee,' it's not even *close*. ", "score": 2, "replies": [{"body": "It doesn't need to know dogs..... It needs to know objects which are moving and objects which are not moving. It needs to see lane markings. \n\nYou don't need the diffrence betwewen of a men or a woman. You just need to know that a living beeing is walking there.\n\nAlso roads will be customized for autonomos cars. I mean we did the same for normal cars. Horses had some advantages which got obselet after there were good roads and roads nearly to every play. With a horse you could just ride up a hill and even go through a river. \n\nSo they build bridges where no bridges were. They build roads and made them good accesable with cars. They invented Dual Motors and mby wheels with spikes so that they also can go uphill very well.", "score": 1, "replies": [{"body": "And a perpetually shifting object is going to give AI fits. \"Line. Line. LEG! OMG LEG! Wait, no, line.\"\n\n>You just need to know that a living beeing is walking there.\n\nUber fucked up.\n\n>\nAlso roads will be customized for autonomos cars\n\nYou mean the same interstates that have huge gouges in them that can swallow entire wheels? With what tax base?\n\n", "score": 1, "replies": [{"body": ">Uber fucked up.\n\nYes Uber. Look at Waymos record. its way more advanged. At just currently the graphic card producers started producing for AI and machine learning. We have a lot of exponential growth infront of us.\n\n>You mean the same interstates that have huge gouges in them that can swallow entire wheels? With what tax base?\n\nThere are more countries than the US. Countries which pay a good amount of taxes to keep their roads in good conditions... ", "score": 1, "replies": []}]}]}]}, {"body": "> Good AI is a function of how much training data it has\n\nThis betrays a fundamental lack of understanding of the technology behind self-driving cars. Only a small portion of it involves machine learning.", "score": 2, "replies": []}, {"body": "Google?", "score": 0, "replies": []}]}]}, {"body": "Long term Tesla is a victim of its own success. They demonstrated that the market for electric cars exists in huge excess of Nissan Leaf customers. A significant percentage of people within the target demographic of BMW or Mercedes or Porsche would rather buy an electric equivalent, even if it costs noticeably more money. The problem being that the big automakers have realized that now too, and are starting to position themselves to move into that market. It's not a quick process by any means, but once it gets going there is absolutely no way Tesla can compete with a Volkswagen or a Volvo or a Porsche electric car, they are just so vastly out produced and out supply-chained.", "score": 4, "replies": [{"body": "Big automakers are positioning themselves to compete, but there are also those who have made a huge errors. Passively cooled batteries have demostrated remarkable degradation. Companies like Nissan and VW who have put their eggs in that basket will suffer over the longer term. \n\nGM is one of big companies well positioned to build quality EVs, but personally, I think they are in the minority. ", "score": 8, "replies": [{"body": "That's very true. I'm not saying it will happen soon, just that now the big automakers know about the market and are going to put a massive amount of money towards eating Tesla's lunch. Porsche (and by extension VW) has been promising a performance EV for years, Volvo has been saying 2019 for a while, as has Toyota if I recall correctly, BMW has the i models, but have pulled back from EV I heard.\n\nTesla has done really well, I absolutely don't deny that, and they may well prove me wrong, but I am not confident in their ability to play ball with the big boys.", "score": 3, "replies": [{"body": "Tesla is a brand which is more liked by the  \"early\" electric cars adopters than any other brand. ", "score": 1, "replies": []}]}, {"body": "Why is putting your batteries inside a fridge such a big deal that it cant be fixed in future iterations? Look at the R&D budgets of the behemoths compared to that of Tesla. Its an order of magnitude less. ", "score": 2, "replies": []}, {"body": "The Volt is a genuinely good car- or has been. But Ford, Nissan, VW, etc. have really shot themselves in the foot, and they don't have the *brand* of a reliable, exclusive car.", "score": 1, "replies": []}, {"body": "As VW is now apparently fully committed to EVs, I'm convinced that it will become a serious competitor in the mass market. They have not only the experience in car manufacturing but also substantial capital to invest into R&D. Besides that, the whole German economy depends on the success of the automotive industry, so I'm sure they'll receive massive (indirect) subsidies and support from the government. ", "score": 1, "replies": []}]}, {"body": "the market grows faster than the production.  Here in Germany you would have to wait months till a year for an e-golf, ampera-e (chevrolet Bolt), The new Nissan leaf, Hyundai ioniq electro. And you don't really want anything like an BMW i3 because his wind resistence is a hughe problem.", "score": 1, "replies": [{"body": "Hey, blfire, just a quick heads-up:  \n**resistence** is actually spelled **resistance**. You can remember it by **ends with -ance**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": 1, "replies": []}]}]}]}, {"body": "Tesla and SpaceX are going to be worth a stupid amount of money in the future. I'm literally working my ass off right now to buy as much of their stock right now as I can.\n\nThe more bad news they get right now, the more I want to buy them. I doubt I'm alone in that.", "score": 2, "replies": [{"body": "A) You can't buy spacex stock right now, that i know of. I don't know much about their venture series of funding or percentage of equity ownership. Am I wrong about that? SpaceX could be succesful even if TSLA goes down the tubes.  \n  \nB) Why do you believe TSLA is going to be worth a stupid amount of money in the future? I don't see them as having disrupted anything to an entire order of magnitude. You can buy other cars that are electric. The dealership model is marginally better. Manufacturing is not terribly impressive other than being problematic and very inefficient. The prices for the solar city roof is not economically compelling, nor is the power wall. I think TSLA would be a great investment, at like 50$ a share.", "score": 6, "replies": [{"body": "Thank you for making me clarify. True, no SpaceX stock. I believe that they will be worth a stupid amount in the future, when they do go public. That being said, I envy the spacex employees if they have any stake in the company.\n\nSo yeah, that's SpaceX.\n\nTesla for me is just still starting to grow. They are in a shit position right now news wise (I guess) but once they work out engineering kinks, and then optimize then at some point there will be a headline that reads something like \"all orders up to date, Tesla filling 5000 orders a month\" and then all anyone will hear about for awhile (again) is about how electric cars are replacing gasoline cars and blah blah blah.\n\nThen they announce a $10,000 model that has like built in boring tunnel features and works with starlink and Nueralink to like, help you reimagine the universe or something, and then bam. Shit goes bonkers because by the time that happens today's kids are driving and it's time to buy them a car and \"fuck gasoline that shits old and bad for the Earth\"\n\nIn other words, Tesla is gonna spread out and fast once they optimize their build pipeline. Then, they're going to be the coolest thing on the planet.", "score": 8, "replies": [{"body": "This is your brain on wallstreetbets", "score": 13, "replies": [{"body": "I'm half kidding, half dead serious.", "score": 3, "replies": []}]}, {"body": "> Then they announce a $10,000 model that has like built in boring tunnel features and works with starlink and Nueralink to like, help you reimagine the universe or something\n\nThis is actually the most convincing argument I've read that Tesla is not overvalued. ", "score": 3, "replies": [{"body": "But still...see how Kanye and Musk are budying up? They will be a cool car company.\n\nNeed to get efficient first, though.", "score": 1, "replies": []}]}]}, {"body": "Hey, MinutePotato, just a quick heads-up:  \n**succesful** is actually spelled **successful**. You can remember it by **two cs, two s’s**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": -2, "replies": [{"body": "Oh boy. Whoever made this needs to get fcuked. Who cares?", "score": 6, "replies": []}, {"body": "Good bot", "score": 1, "replies": []}]}]}, {"body": ">Tesla and SpaceX are going to be worth a stupid amount of money in the future.\n\nP R I C E D        I N\n\n>The more bad news they get right now, the more I want to buy them. \n\nMakes sense, we're on WSB.\n", "score": 2, "replies": []}, {"body": "If you want help with the cache losing campaign there's no shortage of reality. \n\nhttps://www.revealnews.org/episodes/tesla-and-beyond-hidden-problems-of-silicon-valley/", "score": 0, "replies": [{"body": "Uh let's see. I see 'worker injury' and 'lack of diversity' in that article. No one on wallstreet gives a crap about those two things because: it doesn't affect the profits.\n\nNow, things like worker strikes might kill them or hurt them a lot. In other words if Tesla doesn't address them then they could fester and grow, but that's not really the Tesla style.", "score": 1, "replies": [{"body": "Gulp that kool aid ", "score": 2, "replies": [{"body": "It's called Truth.", "score": 1, "replies": [{"body": "So accept the evidence and quit making shit up", "score": 3, "replies": [{"body": "That's what I'm trying to tell you...read that article and just accept the evidence. ", "score": 1, "replies": [{"body": "You flatly refuse to accept what was covered in the podcast. That was your first comment. \n\nYou're probably over tesla sub claiming for 6 mo now that model three will be producing 1000 cars a week .... any day now ", "score": 1, "replies": [{"body": "Nah. Also I didn't hear the podcast. Just read the article.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "We definitely live in a bizaaro timeline.", "score": 1, "replies": []}, {"body": "Have you ready Musk's recent company email about the line shutdown? It's nothing concrete, but seems like papi musk is working with renewed focus on tesla after the approval of his new stock option plan and is starting to tighten the screws on production, efficiency, and profitability across the company and suppliers. He's wants to be the worlds tendiest man", "score": 1, "replies": [{"body": "Who would have thought the only thing holding TSLA back was suppliers not being excellent enough, and workers not working hard enough, and managers spending too much money. ", "score": 8, "replies": []}, {"body": "So sly of him to send such a secretive email.  Who can believe it leaked!!?", "score": 17, "replies": []}, {"body": "It actually reads as \"5000 per week was never possible without installation of a third line that will take total capacity to 6000 and my earlier claims of 5000 were solely to pump stock price.\"", "score": 9, "replies": []}, {"body": "I actually hadn't seen it, got a link?  ", "score": 1, "replies": []}]}]}, {"body": "It really says something about the perception of Elon Musk when people believe this happened. ", "score": 23, "replies": []}, {"body": "If you haven't already, listen to the story put out by Reveal. It's kind of damning ", "score": 29, "replies": [{"body": "\nWhat's it say?", "score": 9, "replies": [{"body": ">tesla plans to be best in industry by a wide margin.... someday\n\nTesla actually much worse than the rest of industry today\n\n\n>tesla has to comply with many regulations\n\nTesla not actually complying with regulations. Tesla may be hiding information from having to be reported for regulations \n\n", "score": 9, "replies": []}]}, {"body": "Great Suggestion!  I'm a big fan of Tesla vehicles and continue to be after reading that [article](https://www.revealnews.org/article/tesla-says-its-factory-is-safer-but-it-left-injuries-off-the-books/).  But now I believe that safety is being **seriously** undervalued at Tesla in the effort to realize the ambitious productions goals of the Model 3.", "score": 11, "replies": []}]}, {"body": "I wanna be his friend IRL though like the best hobbies and just works a little when he feels like it and skips meetings all the time and then when he’s sick of me just blast me into space ", "score": 55, "replies": [{"body": "Tesla is a customer of the company I work for. I have sat in meetings where Elon has graced us with his greatness. He really doesn't say anything to anyone. He is not charismatic and out going like you would think. None of the employees like jokes like \"So, before we end this meeting anyone know when I will get my Model 3?\"", "score": 67, "replies": [{"body": "Just because you have a lot of money, doesn't mean you should actually be in the meeting. A lesson I have learned a decade ago.\n\nGood luck with handling Elon.", "score": 29, "replies": []}, {"body": "That’s why I like him. Awkward and introverted af ", "score": 19, "replies": []}, {"body": "[deleted]", "score": 15, "replies": [{"body": "Ya, you can't laugh if you're crying.", "score": 9, "replies": []}]}, {"body": "You’re not cool enough. ", "score": 4, "replies": []}]}]}, {"body": "Compelling evidence", "score": 13, "replies": []}, {"body": "You don’t get a car! You don’t get a car! Nobody gets a car!", "score": 6, "replies": []}, {"body": "What investors need to get is that you can love Teslas while hating Tesla (a money-losing subsidy-dependent company) and Elon (not the most competent executive). ", "score": 13, "replies": [{"body": "I think people love the idea of a Tesla, but in practice there is a lot of things that Tesla cannot provide. Like for example easy maintenance. Why do I need to call Tesla to get something fixed? Why can't my existing dealer do repairs?", "score": 8, "replies": [{"body": "Try it. The dealer probably can't fix it anyway.", "score": 14, "replies": [{"body": "What dealer?", "score": 3, "replies": [{"body": "Dealer? But I hardly know her.", "score": 17, "replies": []}, {"body": "Whatever car dealer he's talking about", "score": 4, "replies": []}]}]}, {"body": "This is what really turned me against tesla. Despite their lies about being \"open source\", the cars are not repairable and locked down with shitloads of DRM and proprietary components. Fuck Tesla. I hope they go bankrupt and the people dumb enough to buy their cars are left with worthless bricks.", "score": -2, "replies": [{"body": "Salty are we?? Not that a disagree with the analysis of the dumpster fire that's is TSLA", "score": 3, "replies": []}, {"body": "Thanks for sharing your opinion. I don't think this sentiment (that the product being created does not meet the needs of the market) is priced in. Companies should make what customers are interested in and investment in companies which do not, is unwise. It's just speculation.\n\nTesla's patent structure is much less advantageous then one would initially think. No large company would agree to it. What are all car companies? Large companies. ", "score": 1, "replies": []}]}]}]}, {"body": "wonder why he's silent on all those wonderful lawsuits ", "score": 2, "replies": []}, {"body": "Doesn't production technically shut down every night when everyone goes home?", "score": 2, "replies": [{"body": "Nog all factories work in day shifts only, some run 24/5 and some even 24/7", "score": 2, "replies": []}]}, {"body": "Yea right.. you would not stop a million dollar deal for some whatever person.. which I’m sure the comment or  is important.. but Elon just wouldn’t .. I need a public announcement..", "score": 1, "replies": [{"body": "The commentor was also Elon", "score": 2, "replies": [{"body": "Yep..(sip on my Apple juice now from a tea cup...now...)", "score": 1, "replies": []}]}]}, {"body": "Dude can do anything just about. I'm amazed every day", "score": 1, "replies": []}, {"body": "As an Aussie, what does fam even mean?", "score": 1, "replies": [{"body": "Family ", "score": 1, "replies": []}]}, {"body": "Benzinga article says something else about [model 3](https://www.benzinga.com/analyst-ratings/analyst-color/18/04/11536849/teslas-plant-shutdowns-model-3-prospects-q1-earnings-wh)", "score": 1, "replies": []}, {"body": "When you’re a billionaire and bored!!!", "score": 1, "replies": []}, {"body": "He could do it, just for fun. Like, he would even enjoy if these things stops getting such attention, so he can just don't think about trillion consequences 😄", "score": 0, "replies": []}, {"body": "Hahah", "score": 0, "replies": []}, {"body": "I mean he has his whole staff I mean cmon", "score": 0, "replies": []}, {"body": "It wasn’t the billion dollars a week Elon Musk was burning through? It wasn’t the production of 50 cars a week when 3,000 was promised? ", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Abbreviation of \"family\"", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Are you sure you are not in the wrong place?", "score": 3, "replies": []}]}]}
{"title": "Lord Bezos reveals that Amazon OVER 100 million prime subscribers. Beats estimates of 65 million.", "selftext": "https://www.cnbc.com/2018/04/18/amazon-ceo-jeff-bezos-2018-shareholder-letter.html\n\nThis is the first time Amazon has ever revealed prime numbers and they blew estimates out of the water. Stock up significantly After hours", "id": "8d9b33", "created_utc": 1524086602.0, "score": 452, "upvote_ratio": 0.98, "num_comments": 164, "comments": [{"body": "[deleted]", "score": 319, "replies": [{"body": "I find your lack of mu disturbing ", "score": 173, "replies": [{"body": "Annnndddddd... cue the tape: Bezo’s AMAZON will begin production of their own semiconductors.", "score": 32, "replies": []}, {"body": "It’s not something a Jedi would tell you. ", "score": 27, "replies": []}]}, {"body": "This is what peak performance looks like.", "score": 39, "replies": []}, {"body": "Just wait until all the faggots in the world find out that Alexa has been recording them every second of their lives", "score": 47, "replies": [{"body": "It's literally a surveillance device that people pay to put into their own homes. Although so is the Apple TV, smartphones in general, any computer with a webcam and/or mic, some TVs, etc. \n\nPrivacy is dead. I've come to terms with it and don't even bother closing the blinds now when I jerk off.", "score": 50, "replies": [{"body": "Long VPN", "score": 20, "replies": []}, {"body": "You’re supposed to close the blinds? Shit. ", "score": 4, "replies": []}, {"body": "Short blinds...", "score": 3, "replies": []}]}, {"body": "so like fb? 5% down then come back? ", "score": 35, "replies": [{"body": "FB lost 20% from ATH", "score": 16, "replies": [{"body": "and is in the midst of a v shape recovery \n\ndid you delete your fb?", "score": 10, "replies": [{"body": "Nah. Have barely used it since high school", "score": 6, "replies": []}]}]}]}, {"body": "P R I C E D I N\n\nbut for real, everyone knows that shit is a surveillance device, they just dont care.", "score": 3, "replies": [{"body": "Except the dumbass faggots that make up half the country", "score": 5, "replies": []}]}, {"body": "I tell them and they say they know and they don't care if some government guy listens to them jerk off and tell secrets. ", "score": 2, "replies": []}]}, {"body": "That’s my portfolio ", "score": 6, "replies": [{"body": "Portfolio? Is that when you are waiting for the sell to go through, but the buy already did, so you are on margin for a while? ", "score": 10, "replies": [{"body": "What? I’m saying I’m 100% AMZN stock. ", "score": 4, "replies": [{"body": "Stock? Is that the thing you end up with if you keep your options for too long?", "score": 26, "replies": []}]}]}]}, {"body": "But then I'll only own one share", "score": 3, "replies": []}, {"body": "50% AMZN, 50% NFLX", "score": 3, "replies": [{"body": "2/3 of my portfolio is this with both of them in almost equal parts", "score": 1, "replies": []}]}, {"body": "u werent saying that when it was in the shitter near 1300s and getting trump attacked", "score": 6, "replies": []}, {"body": "https://www.bizjournals.com/sanjose/stories/2000/03/20/story2.html", "score": 1, "replies": []}, {"body": "Trump tweets that he and Andrew left are sorting amzn and outing tariffs on it", "score": 1, "replies": []}, {"body": "Well you post on reddit so I know you're a scrub that can't afford to hedge any Amazon position. Since an option hedge would require a 100 share position, which would be 150 grand at these levels, I'd say you're either a low volume gambler with like 3 shares, or you're trading OTM option spreads. \n\nEither way, your money would best be spent elsewhere. Amazon is trading at very high levels even for an aggressive growth stock. You'd need at least a hundred grand to trade this stock properly as your whole portfolio. ", "score": -21, "replies": [{"body": "If u want to hedge amaZon just buy qqq puts. Amazon is their second largest holding and qqq took a nasty af dump during trump tweets", "score": 10, "replies": []}, {"body": "You don't trade Amazon. You just buy what you can and long it forever. \n\nTrading Amazon?  That's for big boys not retail degenerates on Robinhood.\n\n", "score": 9, "replies": [{"body": "Which, as I already addressed, is a stupid idea. 1 or 2 shares with no hedge has 100% downside. You should never trade with 100% downside. You should, instead, always try to maximize risk/reward. ", "score": -12, "replies": [{"body": "Who says you need to hedge Amazon?\n\nPlease. Trump ain't gonna do shit. One share of Amazon bought last year is still doing mighty fine. ", "score": 11, "replies": [{"body": "You should hedge all investments unless you can guarantee something like a 90% prediction success rate. The math on that is pretty simple. ", "score": -15, "replies": [{"body": "Wait what? You're saying ALWAYS buy protective puts? That is the most faggoty and also 100% blatantly incorrect bullshit I have ever heard on this sub", "score": 26, "replies": [{"body": "Pretty much. Would you like me to explain the simple math to you?\n\nLet's say youre right in your predictions 50% of the time, and have a portfolio of 10 stocks you all bought at $20 that either go to $30 or to $10 before you sell.\n\nScenario 1) Unhedged. 5 times you make $10 a share and 5 times you lose $10 per share. Result: break even.\n\nScenario 2) Hedged with a put. A $20 put with 60 days at 30% IV would cost 90 cents. This means you give up the first 90 cents of profit, but 90 cents is also your max loss. So 5 times you lose 90 cents for a total of $4.50, and 5 times you make $9.10 for $45.50 and for a total of a $41 gain.\n\nIn the above scenario using a put hedge you can be right only 20% of the time and you still make money.\n\nAnd you have 24 upvotes? No wonder the kids in this sub always lose money. You guys have no idea what youre talking about, but all think youre experts. That's the kind of narcissism that's common to the millennial. I mean, keep it coming I guess. We'll all take your money.", "score": 1, "replies": [{"body": ">have a portfolio of 10 stocks you all bought at $20 that either go to $30 or to $10 before you sell.\n>A $20 put with 60 days at 30% IV would cost 90 cents\n\nThese are ridiculous numbers you flaming faggot. I would forget about buying stock, and just buy puts for $.90 apparently, half of them would go in the money, and I would make $10 on every $1.80, or 5.5x my initial investment in 60 days you faggot which goes to show how ridiculous these numbers are and how you are pulling all of this bullshit straight from your ass. Tell me, who is the fucking idiot selling you these puts? Maybe somebody like you, come to think of it.\n\n", "score": 0, "replies": [{"body": "You really are pretty new at this aren't you? People sell puts to add to positions while pocketing a commission, or as part of a spread, and I'm sure lots of ignorant kids like you also sell them naked because they think they're smart.\n\nUse whatever numbers you like, it still works out the same unless you're looking at short term swings of a few days for a few dollars.\n\nAnd yes, it is a good idea to just buy puts or calls without the stock because they have a built in hedge. This is the entire point of options. Rather than buying stock and a put, you can just buy a call. However you wouldn't do that if you want to collect the dividend, be more liquid, trade it AH, or if the strikes and expiry's available aren't where you need them.\n\nThrough all your screaming idiocy I can see you're probably learning something today. Glad to help.", "score": 1, "replies": [{"body": "Shut the fuck up you dumb faggot. I can't fucking stand people like you who act like they're experts and then spout idiocy like:\n\n\"assume your stock will go up 50% or down 50% in 60 days, then buy a put for 30% IV HURRR DURRR FREEE MONEY\"\n\nThat is honestly without question the most retarded thing I have ever seen on this sub. In the real world, IV>RV. Have fun while theta eats you alive you dumb fag. ", "score": 0, "replies": [{"body": "Theta, IV>RV? WTF are you talking about? The idea isn't to make any money on the option hedge. It eithers expires useless or you execute it at strike. If you're talking about using options instead of shares, you pay attention to IV as always. High vol = credit spread, Low vol = debit spread. That's option trading 101 kid.\n\nTry it with a $3 move - it still works dumbass. I was just making the numbers easy for you.\n\n5x2.1 = 10.5 - 5x0.9 = 4.5 = $6 profit/share in hedged scenario vs. break even without.\n\nCan a stock move 15% in 60 days? Do you even think before you type? I sincerely hope youre not trading with anyone else's money when you can't even do basic math.\n\n", "score": 0, "replies": [{"body": "You are using bad math and faulty assumptions to justify a retarded position. If you start by assuming that puts are hugely underpriced, as was the case in your example, then your conclusions about whether adding those puts to the portfolio is a good idea or not, are gonna be retarded.\n\nShares + puts= synthetic call. That makes theta and IV>RV relevant concepts because of arbitrage. Suggesting that holding a deep ITM call is always less risky than holding shares is asinine, and only situationally true at best.\n\nTell me why there are a huge number of professional money managers who don't always hedge with puts if it's so obviously the better strategy. It's basic math, right? Give me a break.\n\nEdit: If it's actually your opinion that it's better to always use options and never touch shares except in creating a synthetic option, then I can't argue with that. I definitely disagree as do many, but I know there are a lot of people who trade that way. Sorry for using bad words.\n", "score": 0, "replies": [{"body": "Your arguments from authority about what you assume fund managers do are adorable. Why do you think they are called *hedge funds*? Ofc not all hedge funds actually have hedging strategies in modern times, but that's traditionally what they were about and how they got their name. And even today most hedge funds that are interested in long term positions definitely have hedging strategies. \n\nK let's use a real life example:\n\nI scanned for a $20 stock with about 30% IV 60 days out. I found one - ticker: GHL. One standard deviation for June 15th would be a $2.66 (13%) range, and the $20 puts for June 15th have the bid/ask range settling at $1.20. Fair value is actually $1.00 but let's assume $1.20 to be as generous to you as possible.\n\nSo you buy 10 companies with exactly these numbers and youre right 50% of the time with simple put hedge play:\n\n2.66 -1.20 = 1.46*5 = $7.30 profit\n\n1.20 * 5 = $6 loss\n\nTotal: $1.30 per share profit when you're right only half the time.\n\nThis is simple shit kid. IV affects the option price and standard deviation of the stock at the same time. The only time this would be bad is if you expect IV to fall dramatically off a cliff in the very near term and never come back. At which point, you should hedge with an option spread instead of buying shares at all.\n\nOf course the standard deviation is a very conservative estimate too. GHL has earnings on 5/3 and their last ER the stock moved up $3.74 (22%) in just a few days. So if you buy good companies you've done DD on your risk/reward is almost for sure even better since when you hedge your loss is fixed and you returns are potentially infinite.\n\nGot any more excuses for me to debunk? You. Don't. Know. What. You're. Talking. About. Stop embarrassing yourself.\n\nEdit: Just saw your apology edit. No problem. Have a good day.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "No the downside is just 100% loss of initial investment", "score": 5, "replies": [{"body": "Which is how returns are always measured..... What are we talking about here? ", "score": 1, "replies": [{"body": "I thought we were kind of bulshitting", "score": 20, "replies": []}]}]}]}]}, {"body": "I bet you talk pretty constantly about Rick and Morty.", "score": 1, "replies": []}]}]}, {"body": "carry my qqq , i can't afford u amzn monthlies =(", "score": 46, "replies": [{"body": "This shit might lift the entire tech sector. QQQ is gonna moon into FANG earnings next week. Jesus Christ this company is a fucking machine. ", "score": 21, "replies": [{"body": "> QQQ is gonna moon\n\nok, buying puts", "score": 9, "replies": []}, {"body": "Netflix the other day, Amazon today. Incredible.", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 115, "replies": [{"body": "They don't want poor fags to buy their stock", "score": 169, "replies": [{"body": "Amazon being +$1000 is the only thing that saves it from the kiss of death that is WSB. If it was cheap fags on here could afford it and sell the second it drops 2%", "score": 98, "replies": [{"body": "Incoming 1:10 reverse split", "score": 21, "replies": []}, {"body": "WSB doesn't buy stocks.  Options is where it's at for this place.", "score": 8, "replies": [{"body": "Problem is an atm contract one month out is 6k, we're poor faggots here", "score": 6, "replies": [{"body": "This sub is all about the OTM FD's, especially the juicy 4/20's", "score": 2, "replies": [{"body": "4/27 otms are still well above 3k", "score": 2, "replies": []}]}]}]}, {"body": "Ding ding ding", "score": 2, "replies": []}, {"body": "> and sell the second it drops 2%\n\nmore for me", "score": 1, "replies": []}]}, {"body": "Until some enterprising fund manager somewhere opens the AMZN Fund.", "score": 2, "replies": [{"body": "kek\n\n*RH introduces a new service - index funds on everything!*", "score": 2, "replies": [{"body": "And then a tracking fund on the index funds!", "score": 2, "replies": []}]}]}]}, {"body": "They were actually gonna 12:1 split a few weeks ago then their CFO visited wsb. They're now planning a 1:12 reverse split", "score": 30, "replies": []}, {"body": "They probably want to keep it that way so their stock is less volatile and easy for M&A. They couldn't care less about the poor saps who couldn't cough up enough money to buy one share of their stock.\n", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Thank you so much for all these info. I'm still trying to comprehend it more. So you mean splitting the stock will likely be in AMZN's favor? Will look up the NFLX split. What's the share price after splitting? Around $100 per share?", "score": 1, "replies": []}]}]}, {"body": "just create a synthetic long position if you have enough buying power to cover margin on the naked put. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 38, "replies": [{"body": "They crashed really hard during the dot com bubble ", "score": 14, "replies": [{"body": "More than 93% at one point. In the book *Everything Store*, people interviewed claimed that Jeff Bezos didn't even blink his eyes on that. Cold ice runs in his blood. \n\nThe fact that Charlie Monger says \"I will never bet against Jeff Bezos.\" gives me enough temptation to go all in AMZN.", "score": 3, "replies": []}]}]}, {"body": "I have Prime and I don’t even remember how much I’m paying for that shit ", "score": 40, "replies": [{"body": "$100/year unless you're a student. ", "score": 7, "replies": []}]}, {"body": "I got a 1557.5C FD at close today. Oh boy", "score": 44, "replies": [{"body": "Time to party", "score": 11, "replies": [{"body": "AMZN FD’s have made like 2,200 this week without risking more than $400 at a time, but every time I sold too soon cuz I’m a faggot who protects profits and meanwhile the 1475C I bought Monday for 3.6 and sold at 13 is now worth like 57. \n\n", "score": 10, "replies": [{"body": "Stop looking at those unrealized gains or you’ll get depressed ", "score": 40, "replies": [{"body": ">Stop looking at those unrealized gains or you’ll get depressed\n\n\n\nMore like unrealized unrealized gains\n", "score": 1, "replies": []}]}, {"body": "Don't worry bro you could be me and never owned anything Amazon related ", "score": 9, "replies": []}]}]}, {"body": "I have 1395 and 1410 calls that I bought when it dipped to 1375", "score": 4, "replies": []}, {"body": "FD?", "score": 2, "replies": [{"body": "You know it", "score": 2, "replies": [{"body": "Sorry, I’m too stupid to know what that stands for. ", "score": 3, "replies": [{"body": "It’s not an acronym the market makers would tell you....\n\nFD = faggot’s delight = OTM options expiring the week in which they are purchased. So named because they are very likely to fuck you in da butt", "score": 6, "replies": []}]}]}]}, {"body": "Damn son.", "score": 2, "replies": []}]}, {"body": "You hear that? It’s raining tendies ", "score": 16, "replies": []}, {"body": "I think Jeff just stoked a market rally for tomorrow.", "score": 31, "replies": [{"body": "Stoked my market rally that's for sure. ^^I'm ^^talking ^^about ^^my ^^penis.", "score": 5, "replies": [{"body": "Are you one of those degenerates that likes handholding?", "score": 1, "replies": []}]}]}, {"body": "I got $AMZN at 650 a share >:)))))", "score": 40, "replies": [{"body": "*a single share", "score": 51, "replies": [{"body": "[deleted]", "score": -17, "replies": [{"body": "wow thats almost $200", "score": 43, "replies": [{"body": "15x1527=200", "score": 22, "replies": [{"body": "huh... you forgot a zero buddy. 200.0", "score": 38, "replies": []}]}]}, {"body": "Uhh... 3? I'm guessing at least $3", "score": 3, "replies": []}, {"body": "Lol that's still only $22k. Doesn't matter if you bought at $1 a share. You're poor", "score": 7, "replies": [{"body": "[deleted]", "score": -23, "replies": [{"body": "You say 15 as if it’s a lot. You sound poor", "score": 17, "replies": [{"body": "I mean its significantly more than 1 share lmao, but hey \\\\\\_(ツ)_/", "score": -14, "replies": [{"body": "You dropped this \\ \n *** \n^^&#32;To&#32;prevent&#32;anymore&#32;lost&#32;limbs&#32;throughout&#32;Reddit,&#32;correctly&#32;escape&#32;the&#32;arms&#32;and&#32;shoulders&#32;by&#32;typing&#32;the&#32;shrug&#32;as&#32;`¯\\\\\\_(ツ)_/¯`&#32;or&#32;`¯\\\\\\_(ツ)\\_/¯`\n\n [^^Click&#32;here&#32;to&#32;see&#32;why&#32;this&#32;is&#32;necessary](https://np.reddit.com/r/OutOfTheLoop/comments/3fbrg3/is_there_a_reason_why_the_arm_is_always_missing/ctn5gbf/)", "score": 2, "replies": [{"body": "Good Bot ", "score": -1, "replies": [{"body": "ur poor af", "score": 4, "replies": [{"body": "nooooooooo", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "In at 319", "score": 8, "replies": [{"body": "The actual price... 314.95!!! /u/connor371, come on down!", "score": 5, "replies": [{"body": "Youre not allowed to go over tho.", "score": 1, "replies": [{"body": "Dude I was so tired. Lol my comment is way off.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "bad bot\n", "score": 2, "replies": []}]}]}]}]}, {"body": "When I started working there in 2011 they gave me 335 shares as a signing bonus (~$200 a share at the time). Too bad I had to sell them  in early 2014, when they were $350.", "score": 3, "replies": [{"body": "Out half a million dollars. Noice.", "score": 4, "replies": []}, {"body": "Gains are gains. You probably needed the money then. Are you still working there and what's your job there?", "score": 1, "replies": [{"body": "Well, let's just say I would have found a way to not sell if I knew they were going to blast off like that. I don't work for them any longer, but I used to run a software development center where we built tools that run the warehouses.", "score": 1, "replies": [{"body": "Nice. Sounds like you are probably making big bucks with your skills anyway. What kind of tools do you build to run the warehouses, if you care to explain? Thanks.", "score": 1, "replies": [{"body": "I no longer make big bucks because I left the industry to work on bioinformatics research. It comes with its own set of benefits, but money isn't one of them.\n\nWe custom built all of the software that runs the warehouse - product flows in and out, and needs to be managed inside, it's a huge constraint satisfaction problem. Each warehouse has a couple of thousand people working in it, and they all need to know what to do.\n\nA truck with product comes in: where does it go, who unloads it, where in the warehouse does each product go.\nPeople buy stuff: who is going to get the products off the shelf, in which order, when, put them on which conveyor so that multiple items that people bought end up together.\nHow does the conveyor route products around the warehouse?\nWhich box should the person packing orders into boxes select?\nHow do you know the right stuff is in the box?\nHow do you print the right label?\nWhich truck does the order need to go on to be delivered on time?\n\nThere's software that is trying to manage and optimize all of this. When I worked there my department had about 600 software engineers working in it to manage all of this.\n", "score": 1, "replies": [{"body": "Wow, that sounds super cool and honestly a ton of work and coordination. \n\n> People buy stuff: who is going to get the products off the shelf, in which order, when, put them on which conveyor so that multiple items that people bought end up together. How does the conveyor route products around the warehouse? Which box should the person packing orders into boxes select? How do you know the right stuff is in the box? How do you print the right label? Which truck does the order need to go on to be delivered on time?\n\nI actually never thought of these questions. Sounds like a lot of specific queries. Thanks for the perspective.\n\nHow long did it take you to be this adept at your job? Did you study software engineering or computer science in college? I took one course in data analysis using Python in grad school. But without proper foundation I was struggling very hard. Only until recently did I start taking CS foundation courses online. So far I am enjoying the challenges. Do you think it's possible for one to devote to most of the spare time and some of the working time to learning programming in order to be reasonably good at it? My main goal is to write my own code to automate routine tasks, create my own software tool and hopefully find another job.\n\n>When I worked there my department had about 600 software engineers working in it to manage all of this.\n\nGee, how big was the company? These 600 software engineers are for your department alone?\n\nThanks again.", "score": 1, "replies": []}]}]}]}]}, {"body": "Damn.", "score": 1, "replies": []}]}, {"body": "In at 3-something. ", "score": 2, "replies": [{"body": "Good shit", "score": 2, "replies": []}]}]}, {"body": "lol Get ready for the hastily arranged tweet conference at market open by Trump. ", "score": 13, "replies": []}, {"body": "How pissed you think DJT is rn", "score": 26, "replies": [{"body": "Pissed enough to tweet out that USPS and Amazon conspired to inflate the Prime numbers. ", "score": 30, "replies": [{"body": "I can't bring myself to check his Twitter.. is that real", "score": 13, "replies": [{"body": "It could be by morning. You never know with this POTUS.", "score": 13, "replies": []}]}]}, {"body": "He'll tweet something about AMZN soon enough.", "score": 9, "replies": []}]}, {"body": "1.7% is up significantly? Bitch my ally account gets that ", "score": 20, "replies": [{"body": "per day?", "score": 5, "replies": [{"body": "yep, bought calls on it", "score": 3, "replies": []}]}]}, {"body": "NFLX numbers must’ve irked the Beeezzz\n", "score": 10, "replies": [{"body": "Bezzz about to peak all over that chart.", "score": 2, "replies": []}]}, {"body": "God I love Bezos so much held my 1540/1560 4/20 call spreads through the Trump bashing and I believed in Amazon. Praise the Lord", "score": 19, "replies": []}, {"body": "Picked up 1530 calls at close ", "score": 6, "replies": []}, {"body": "Bezos is Elons daddy ", "score": 15, "replies": [{"body": "Except Bezos is a profitable company", "score": 5, "replies": [{"body": "But remember when it wasn't and everyone said LOL OVERVALUED AMZN IS GONNA GO BROKE THEY DON'T MAKE MONEY\n\n", "score": 1, "replies": []}, {"body": "Musk did sell Paypal to Ebay...", "score": 0, "replies": []}]}]}, {"body": "Well boys, my bagholding is about to pay off. ", "score": 6, "replies": []}, {"body": "So the 5 FD $1,540 calls I bought in the afternoon for $9 each might look good tomorrow after they did almost nothing today. I hate being such a fomo, but looks like it's gonna work out for once.", "score": 4, "replies": []}, {"body": "Wish I could afford the shares tho its time for a split Jeff", "score": 3, "replies": []}, {"body": "If only there were a main competitor to Amazon valued at half the valuation of Amazon that could have access to more people domestically..... Oh wait.... #BABA", "score": 4, "replies": []}, {"body": "9,000,000,000 a year. ", "score": 2, "replies": [{"body": "$99-$155.88/yr  \n100,000,000 subscribers  \n$9.9B to $15.6B per year\n", "score": 1, "replies": []}]}, {"body": "Where can I get an autographed piss-bottle?", "score": 2, "replies": []}, {"body": "Buying calls at open would be dumb right.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Here in Italy it only costed like 19 euros before this year. Now it's slightly higher. So your math isn't the same worldwide. ", "score": 2, "replies": []}, {"body": "I'd like to see their UPS/FedEx/USPS bills though. I bet it eats up most of that figure.", "score": 1, "replies": []}]}, {"body": "Im about to cancel mine. Hardly order anything and outside of 4 or 5 shows its video service may as well be the streaming equivalent of the walmart movie bin.", "score": 1, "replies": []}, {"body": "Its all those dam Fortnite kids downloading Amazon prime and linking it to their twitch prime accounts. I bet only half of them are actually active..", "score": 1, "replies": [{"body": "seebz69\n\n>Its all those dam Fortnite kids downloading Amazon prime and linking it to their twitch prime accounts. I bet only half of them are actually active..\n\nhttps://www.statista.com/statistics/546894/number-of-amazon-prime-paying-members/\n\n>This statistic shows the number of paying Amazon Prime members in the United States as of September 2017. As of the last measured period, the source estimated 90 million Amazon Prime subscribers in the United States, up from 63 million in June during the previous year. On average, Amazon Prime members spent 1,300 U.S. dollars on the e-retail platform per year. June 2017 data also states that non-Prime members only spent 700 U.S. dollars annually, which is still an improvement over the average 500 U.S. dollars of annual Amazon spend as of June 2016. ", "score": 1, "replies": []}]}, {"body": "Over 100 million prime subscribers and still his workers have to piss in bottles??", "score": 1, "replies": [{"body": "Thats WHY they have to piss in bubbles. Those 100 million people want their 2 day deliveries. If something is a day later than the delivery date people complain and get a free month of prime.", "score": 7, "replies": [{"body": "\n.. Or maybe the billionaire can hire more people. ", "score": 2, "replies": []}]}]}, {"body": "They only posted the prime subscribers because they are chasing after $NFLX. Makes them seem weak. I only subscribe to prime for delivery deals, I barely watch anything on their streaming service.", "score": 1, "replies": []}, {"body": "That's OVERlord Bezos to you.", "score": 1, "replies": []}, {"body": "Stock is still a massive bubble ", "score": -20, "replies": [{"body": "Explain", "score": 19, "replies": [{"body": "From a fundamentals perspective it definitely is. It's trading at 50X EBITDA. With the most obscene growth numbers your can reasonably imagine and only modest competition from Alibaba, Amazon's future cash flows simply do not meet its enterprise value. It is overvalued from a simple market cap standpoint.", "score": 12, "replies": [{"body": "That's the most shallow  analysis I have heard, probably ever. AMZN's true economic earnings are far higher than their GAAP earnings. If they're doing $150B in sales from third parties, and AMZN  takes on average 15% from that, then that's $22.5B in cash flow for 35x cash flow valuation. Add in AWS, the core retail operation, each which as a stand-alone operation would be worth hundreds of billions of dollars, and you reach the valuation easily. \n\nBut here's the even bigger picture. They're not standalone businesses. Every business that Amazon engages in, props up the rest of their businesses in driving cost reductions and benefit to the consumer. There are absolutely massive network effects here. The true worth of AMZN will always be far greater than the sum of the parts.", "score": 14, "replies": [{"body": ">The true worth of AMZN will always be far greater than the sum of the parts.\n\nSure, maybe in MBA Finance classes. At the end of the day, stock ownership is nothing more than a claim on the cash flows that a business can return the shareholders from now until perpetuity. And by that measure, Amazon is a bad bet for shareholders at today’s prices. $2 billion in GAAP earnings to be spread around a $750 billion market cap. Not saying that Amazon won’t be enormously profitable one day, because they might be. But they certainly aren’t today, and haven’t been for the last 20 years.", "score": 7, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "80% of market gains over the last century come from dividends. He's not wrong. No company can trade at a 300 multiple forever. Amazon maybe has 5 or 10 years to show some real earnings to back up that valuation. Otherwise the price will come down, its just how it works.", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Facts aren't cute, nor are they nice, nor bad... they're just facts douche. Anyone who holds Amazon with the kind of faith and fervor of the religious are fools. They're a company, no matter how many portfolio boners they pop between now and 8 years from now there will be bag holders if earnings don't increase literally ten fold of what they are now. Even free cash flow has to improve at least 5 fold. Don't be ignorant.", "score": 0, "replies": [{"body": "[deleted]", "score": 5, "replies": []}]}]}]}]}, {"body": ">MBA finance classes\n\nEarnings are real whether they show up in GAAP accounting or not. With some companies, their GAAP earnings greatly overstate their true earnings. AMZN is spending tens of billions on R&D, most of which deserves to be capitalized. WMT doesn't spend very much on R&D. \n\nAmazon is an aggregator. Anytime Amazon launches a benefit to prime, they can get tens of millions of people using it. They go from zero to scale instantly. Amazon music, Amazon originals, etc. are successful because they tacked it onto prime, which was successful because they tacked it onto a gigantic logistics network and marketplace, which was successful because it was where people bought their books. All of these get more efficient and profitable with growth, and they all drive growth for each other. It's the world's biggest network effect.\n", "score": 3, "replies": []}, {"body": "> At the end of the day, stock ownership is nothing more than a claim on the cash flows that a business can return the shareholders from now until perpetuity.\n\nFunny... That's what I learned in MBA Finance classes. Not sure where you went to school if you think they teach witchcraft or something. ", "score": 3, "replies": []}]}, {"body": "\"They're not standalone businesses. Every business that Amazon engages in, props up the rest of their businesses in driving cost reductions and benefit to the consumer.\"\n\nAn ecosystem is being created,sure, and much of it may be valuable, but it is in no way able to justify a 750B valuation. As someone who has run a M&A deals in the past, that is undergrad finance bullshit to justify high IB fees. Most business M&A destroy value in the long run, that's why major companies have done and are doing reverse mergers. (Ebay/Paypal is one, Dell is doing one, etc.) \n\n\"AMZN takes on average 15% from that.\" - It doesn't \n\n\"that's $22.5B in cash flow\" - Forgot expenses? Much of the high value 3rd party sales are FULFILLED BY AMAZON (IE the actual costly stuff of running a business) \n\nWhether AMZN is a good stock buy or not is up to the animal spirits and candlesticks. But if you really want to denote a current value based on exceptional performance of AMZN and its core business...it is not 750B. \n\n\n\n\n\n", "score": 2, "replies": [{"body": ">As someone who has run a M&A deals in the past, that is undergrad finance bullshit to justify high IB fees. Most business M&A destroy value in the long run, that's why major companies have done and are doing reverse mergers. (Ebay/Paypal is one, Dell is doing one, etc.)\n\nWow, comparing Amazon's in-house prime benefits to corporate M&A? The point is Amazon has unbelievable customer reach, so they don't need to do M&A. It didn't have to buy Spotify, it just built a copycat, and had tens of millions of customers in two and a half years. Ecosystems are hugely valuable. \n\n>\"that's $22.5B in cash flow\" - Forgot expenses? Much of the high value 3rd party sales are FULFILLED BY AMAZON (IE the actual costly stuff of running a business)\n\nNo, FBA is an entirely different service. You need to do your research. Amazon takes the seller's cut whether you use FBA or not. Is FBA operating at a loss? Probably, and that would be a fair criticism. \n\n>\"AMZN takes on average 15% from that.\" - It doesn't\n\n[It does.](https://fitsmallbusiness.com/amazon-seller-fees/) I said \"if\" because the numbers are partly guesswork, and since I assume their bigger volume sellers get a discount, I'd say it's probably lower than 15%. But the total volume may be higher as well. ", "score": 2, "replies": []}]}]}, {"body": ">Alibaba\n\ndude... the fuck??? who gives a shit about retail. \n\nheard of AWS??? like 90% of the internet is amazon. ", "score": 5, "replies": []}]}]}, {"body": "Mr.Trader1, is that you?", "score": 5, "replies": []}]}, {"body": "Too bad IV is super-high because of upcoming earnings, so despite being deep ITM, I can't close my spreads for max profit.", "score": -8, "replies": [{"body": "71IV is tiny in this market, 80+ is where you start getting \"super high.\"", "score": 3, "replies": []}]}]}
