{"title": "Sold TGT Mar $56.50 puts today for 81 cents", "selftext": "Only sold enough so that exercise would result in a position size that is not uncomfortable. \n\nHopefully the downdraft doesn't extend. But would probably roll down 1 or 2 dollars and out 2 weeks for a credit (I hope) if it did.\n\nYield to exercise is like 4.25%.\nI understand the company's fundamentals. \n\nThoughts?", "id": "5wqvrz", "created_utc": 1488320716.0, "score": 12, "upvote_ratio": 0.93, "num_comments": 8, "comments": [{"body": "I would sell in April. Mar 17 doesn't leave much room to roll should things not go your way initially.", "score": 5, "replies": [{"body": "Yeah, might have to roll out a full month to get a credit.", "score": 1, "replies": []}]}, {"body": "Hmm, the chart I'm looking at says the March 17 put never went over 80 cents today.  Was it a different March option?\n\nAlso, I wouldn't be surprised to see TGT hit $55 by March 17.", "score": 2, "replies": [{"body": "I show a high of .90 and last of .52. ", "score": 1, "replies": []}]}, {"body": "Seems decent.  I would do it. ", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "What is ELI5?\n\n--noob", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "on what? buying or selling options? use your google", "score": 1, "replies": []}]}]}]}]}
{"title": "Why do people buy stocks in companies that have never and never will give out dividends?", "selftext": "I'm not talking about high-growth stuff from tech and bio (such as Amazon etc). I am talking about companies with just moderate/minimal growth that give out no dividends at all (or perhaps very little dividend of <1%).\n\nWhy would people buy stocks in such companies? Is there any rationale? ", "id": "5wowff", "created_utc": 1488298741.0, "score": 7, "upvote_ratio": 0.67, "num_comments": 18, "comments": [{"body": "Um, because dividends aren't the only source of income in the stock market? If you buy stock XYZ that pays a 4% dividend and yields 3% average yearly gains, cool 7%. But if you buy stock ZYX that pays 0% dividend but has 12% average yearly gains, you're doing better.", "score": 21, "replies": [{"body": "Dividends is a direct return of your investment, yield is only realised when you sell the stock... One has not realised losses or gains until the stock is sold", "score": 2, "replies": []}]}, {"body": "In short investors believe the stock price will rise.\n\n* From investopedia [why companies do pay / not pay dividends](http://www.investopedia.com/ask/answers/12/why-do-some-companies-pay-a-dividend.asp)\n\n* stock buybacks or reinvesting in the company may be more beneficial to the stock price than dividends.  I would not say a company will never pay a dividend, it may just be very far into the future.  \n\n* In the case of small dividends <1% investors may believe there is significant future growth of the dividend.  Dividend may be 1% now but that dividend may be increased 20%+ year over year for multiple years. \n\n* Company may have low to no growth currently but investors may believe something may change in the future.  Politics, new CEO, new product, something.  Also the company may be low growth but the stock could still be undervalued.\n \n* Lastly some investors may speculate on a takeover bid", "score": 5, "replies": []}, {"body": "We've all bought a stock that didn't perform, but at the time we thought it would grow.  We also sold too soon before the peak because we didn't think it could grow anymore.  We were wrong.  Everyone has a rational at the time that makes sense, but hindsight is 20/20.", "score": 3, "replies": []}, {"body": "Berkshire Hathaway might be Exhibit A of a stock that pays no dividend, and is moderate growth. The main reason is that Buffett believes he can reinvest the money better than you can. The long term investors of BRKB and BRKA have done  well. So the obvious answer is to the main question is to make money. The high growth days of Berkshire are for the most part over, but they still sometimes out perform by a percentage point or two or more.\n\nKeep in mind that the yield on SPY (S&P 500) is around 2.0%. So there are a lot of low growth big companies that are paying in the 1.0% range. Also keep in mind the 30 year long bull market in bonds. This background means high dividend stocks (with the earnings to back the dividend) were good performers for most of that time period. The future may be very different.\n", "score": 3, "replies": []}, {"body": "Tough question to answer, but there are several reasons. \n\nOne, people want ownership and the ability to influence decisions by using the rights associated with their class of stock.\n\nTwo, people or retail investors do not want to miss the stock market boom. Human psychology at play. \n\nThree, they have friends making so much money and didn’t want to miss out, therefore buying companies, which are peaking. \n", "score": 4, "replies": []}, {"body": "Because they're scarce and because people trust in others giving them value.  Gold doesn't return dividends either - why is that valuable?  At least with shares there's the possibility of dividends in future - with gold you don't even have that.", "score": 3, "replies": [{"body": "Gold is a hedge, I don't think a non-dividend-paying stock is remotely comparable to gold.", "score": 2, "replies": []}, {"body": "But even then most shares offer very little dividends together with the downside risk in capital valuations. \n\nIt boggles my mind why people buy and sell something that actually has little if at all any value. Curious to know what I'm missing.", "score": 0, "replies": [{"body": "Gold also has downside risk, returns no dividends, is costly to store, and yet people buy it, some fanatically.", "score": 3, "replies": [{"body": "But you can wear gold. ", "score": -3, "replies": []}]}]}]}, {"body": "Well they are part of an index usually, and there are funds that purchase all the components of each index.  Additionally, there are some entities that have so much money to put to work, they buy a lot of securities.", "score": 2, "replies": []}, {"body": "A lot of people like to purchase shares in companies that they support. Regardless of size, ROI, or dividends  people will be buying those tiny stocks that everybody scrolls right past.", "score": 1, "replies": []}, {"body": "Grabbing a low beta defensive stock can be a good way to gain some price appreciation with less risk (people that choose to do this tend to be fairly risk averse). Its also a good way to avoid interest rate risk (stocks that pay dividends tend to react to changing interest rates). ", "score": 1, "replies": []}, {"body": "greater fool theory", "score": 1, "replies": []}, {"body": "Many growing companies don't pay out dividends, as it would take capitol away from the company that they are reinvesting to keep the company growing (Look at Amazon for example). \n\nSo to answer your question, people buy in now because they believe the price will be higher later. ", "score": 1, "replies": [{"body": "OP literally said:\n\n>I'm not talking about high-growth stuff from tech and bio (such as Amazon etc). I am talking about companies with just moderate/minimal growth that give out no dividends at all (or perhaps very little dividend of <1%)", "score": 1, "replies": [{"body": "Whoops, I must have missed that part, sorry! \n\nMy point still remains, people are buying in hopes that the price will appreciate. It's nothing more than that. I will agree tho, if a company has slow growth, and isn't paying a dividend, I'd probably look to invest elsewhere. ", "score": 3, "replies": []}]}]}]}
{"title": "For those who sold AMD at around 15... when are you getting back in?", "selftext": "[deleted]", "id": "5wpufu", "created_utc": 1488308905.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 11, "comments": [{"body": "I'm sort of kicking myself, because when I bought in at $6, I said I'd sell at $15..... and didn't.\n\nif so, I would have bought back in after todays drop. I may add to my position if its down again tomorrow. ", "score": 2, "replies": [{"body": "Amd comes up in this sub like everyday for the passed 4 years. I wish I had bought when it was around 2, sure. But in those 4 years the stock really only had one great run, and that was in the last 6 months or so. Anyone buying now, I would assume is buying to hold. You missed the boat on exponential growth, myself included. If you are looking for a quick flip, your money is much better served in other places around the market. My 2 cents. I always remind people to look at the all time chart for amd and remind you that this is far from a new company. ", "score": 1, "replies": []}]}, {"body": "buy back in when it reaches sub 10", "score": 2, "replies": [{"body": "Alright I'll just grab some popcorn and wait for that day to come once again. ", "score": 11, "replies": [{"body": "yea. i was making a joke. I dont think it will go down to 10 especially since everyone is hands and feet over it.", "score": 4, "replies": [{"body": "yeah I got it, I was sending back another joke. double jokes all around", "score": 6, "replies": []}]}, {"body": "Oh it wont reach 10, speculation has it increasing probably after the Mar 2nd AMA and obvious release of Ryzen.\n\nIm riding this wave, I bought at around $14.50 and waiting it out.", "score": 1, "replies": [{"body": "I bought a couple of shares just to learn the process and such, what would you way you're waiting out to? Like a set price or possible decline on the horizon. Just trying to expand my knowledge", "score": 1, "replies": [{"body": "Im hoping it reaches the speculated $18 a share and then probably taking out half of what iv got invested and then let it ride the rest of year because possibly with the release of Vega it could go up more.\n\nSome speculations say possibly $21 by the end of the year", "score": 1, "replies": [{"body": "Ty for the insight ", "score": 1, "replies": [{"body": "Obviously take it with a grain of salt, of course market value takes a bunch into consideration.\n\nIntel's stock might start going down a tad so that could help AMD or affect the whole micro processor sector in general.\n\nThe official benchmarks once released could have an effect on the price of course, their server processors, their Vega architecture for GPU's\n\nA lot comes into play", "score": 1, "replies": []}]}]}]}]}]}]}]}
{"title": "Will AMD rise at all again or is it going to hover around $14?", "selftext": "[deleted]", "id": "5wq0jy", "created_utc": 1488311125.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 12, "comments": [{"body": "Please STOP BEING IMPATIENT", "score": 13, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "Stocks can become overbought and a correction can be healthy. I don't understand this view that, \"oh, it stopped going up so I guess it's over.\" Did you like the story when you bought it or were you just following hype? Did the story change recently?", "score": 1, "replies": [{"body": "I'm new to stocks, so I'm asking these questions out of genuine curiosity and with the intention of learning. I purchased the stock honestly because of both. I first saw the stock was rising, and looked into it. Saw that they were putting out a new product that could do very well, and figured the gamble was worth it. Due to me being new, I don't know if this quick drop means the hype is over, that's why I'm here.\nMy plan was to sell March 1st, when I'm assuming the hype would be the highest. I understand that March 2nd it could go even higher, but it could drop a lot too. Any advice on that?", "score": 2, "replies": [{"body": "I always sell when I feel the gains are unsustainable. That said, you could always sell some to recoup the money you invested and let the rest ride. That way you're guaranteed not to lose money. ", "score": 1, "replies": []}]}]}]}]}, {"body": "It most certainly will move. AMD has too much stuff on the horizon for it to not move.\n\nRyzen launch, Vega, Naples, and more.\n\nIn which direction? who knows. depends how all these things perform.\n\nI'm optimistic. In with cost basis of 8.72 and holding at least through the end of this year. ", "score": 6, "replies": []}, {"body": "http://www.magicmgmt.com/gary/magic8ball/index1.html", "score": 3, "replies": []}, {"body": "It's clear many people in here are new to investing. It's fine, I can understand how its difficult to see something you've invested in lose value, but you can't look at it day in day out and panic anytime it falls.\n\nInvesting should be a longer term strategy (which is different from trading). you should be buying companies with a good long term outlook.             \n\nPersonally I think AMD has a fairly good long term outlook, so if you can, buy more on the dip. If I had any extra cash I would have bought more today, i'm still debating if I should sell out of some other investments to put more on AMD. ", "score": 2, "replies": []}, {"body": "Do you have any thoughts on which direction it will go and why it will go in that direction?", "score": 1, "replies": []}, {"body": "Fuck off you asshole. Seriously. \n\nNOPE. It's going back to 2. Sell now. ", "score": 1, "replies": [{"body": "Very aggressive. Someone lost a lot of money today.", "score": 1, "replies": [{"body": "1%", "score": 1, "replies": []}]}]}]}
{"title": "Its getting close to investing in Brick and Mortar Stocks again...", "selftext": "Some retail stocks are getting hit ridiculously hard:\n\nTarget, Walmart, ect.\n\nThese are quality names. Sure the boarder tax is scary. Sure online is stealing some sales. But come on. This is totally overboard.\n\nI see great value in Retail right now. Now don't go putting 100% in Retail or buy on margin. This may take several months to stabilize and maybe a year or two to yield profit. But these valuations are just plain ridiculous.", "id": "5wqc3h", "created_utc": 1488315330.0, "score": 1, "upvote_ratio": 0.54, "num_comments": 16, "comments": [{"body": "The only retail worth buying is something like BBY where their knowledgeable sales people add real value to the shopping experience. Or HD that doesn't have to worry so much about AMZN until there are AMZN forklift drones.\n\nI haven't ventured into other retailers to shop since 2012 and don't expect to in the future.", "score": 3, "replies": [{"body": "Knowledgeable sales people at Best buy? Was that sarcastic? Most are teenagers or 20 somethings that don't have much of a clue about what they are selling besides what they've been told by managers (who were told by corporate, Sell this thing!) Sure, you get the occasional diamond in the rough who actually knows his stuff, but in my experience, its not very often.                   \n\nI'd say Home Depot or Lowes are better long term than BBY. much like you said, people won't be buying lumber, drywall and kitchen sinks online for the most part. ", "score": 4, "replies": []}, {"body": "I just did a down to the studs remodel on my house and I probably spent more at Amazon than at HD.", "score": 1, "replies": []}, {"body": "Many people refuse to pay the $100 prime membership.\n\nMany others want to see goods before they buy it.\n\nYes there are people like you who only do online shopping, but there are many more who do shopping the old fashion way.", "score": 0, "replies": [{"body": ">but there are many more who do shopping the old fashion way.\n\nIf that were true, Nordstrom's wouldn't have said that Christmas traffic was the worst since '72. And retailers that do well online only seem to be successful in cannibalizing their own brick and mortar stores. Until the retail footprint shrinks a lot more, they are not investments that have value but value traps.\n\nStick with the ones that are working like BBY, HD, COST or the discounters like TJX and ROST   ", "score": 4, "replies": []}]}]}, {"body": "As much as I hate brick and mortar in the \"internet era\". Some places will always be around (Walmart, target, etc.). as you'll always need a place to pick up things locally (groceries, clothes, and so on)\n", "score": 1, "replies": [{"body": "Agree.\n\nThere will always be B&M retail for at least the next few decades. The second tier retailers will get hurt, but Walmart/Target will do well. Especially at the valuations they are at right now.\n\nAnd Walmart/Target has the ability to increase their web presence also.", "score": 1, "replies": [{"body": "Very true, both of these already have a decent web presence. And offer pick up in store that Amazon can't match. (I know Amazon has the lockers, but you can't buy bigger items, like a TV and pick it up same day).  ", "score": 1, "replies": []}]}]}, {"body": "My wife and I went to a mall in North Florida a couple of weeks ago. We used to go to this mall about once every month.  It has been about a year since we were last there.  A lot of the retail stores were gone and replaced with IPod screen replacement stores and such.  Even the Disney store was gone and replaced by a toy store that was selling knockoff stuff.  Now we have had a shift to outside malls, I guess if you want to call them that, apple and microsoft stores, Nordstrom.   But you really never see people buy stuff..more of just people walking around.  ", "score": 1, "replies": []}, {"body": "I dont see this  'value' in WMT youre talking about.  Look at the long term growth rate of 4%.  4.33 eps estimate for  year end.  $65 at PE 15x.  At 72 its overpriced.   This isnt a growth stock deserving of a higher PE multiple.  At a lower than average PE multiple  WMT could be considered a value stock.", "score": 1, "replies": []}, {"body": "My vote is for the strong stocks in the sector, not the ones that are getting their lunch money taken. Some names near their highs are Home Depot, Tiffanys, Costco. I have small positions in TIF and COST. \n\nIf a person wants to buy stocks that are careening lower, I suggest looking for technical signs of capitulation on the chart and/or more analyst downgrades and/or newbies on the sub asking about shorting them or buying put options. Other sentiment buy signals might be lead articles about the \"death of retail\" in financial magazines or websites.\n", "score": 1, "replies": []}, {"body": "Can you provide some statistics of research to support this idea?", "score": 1, "replies": []}, {"body": "I see a trend toward austerity in western society.  Retailers lose in this scenario as consumption decreases. Cost of providing goods matters a lot In this type of environment.  Online retail is a lower cost model and I think there's a greater than 50% probability the trend toward online retail and away from brick and mortar will continue over the coming decades.  I don't think this is a dip in physical retail, I think it's part of a long term trend. ", "score": 1, "replies": [{"body": "Been contemplating going large on $amzn recently. You're sentiment is exactly what I've thinking about. Personally, brick and morter will be extinct in 20 years and I think seeing them below $1000 will be comical. ", "score": 1, "replies": [{"body": "I am not qualified to give any investing advice, but since 90% of stocks follow the market and the US (and other parts of the world) are at the end of a long-term debt cycle (see 35 year bond market bull run and economicprinciples.org by Ray Dalio), imho I don't think going large on any large US stock is good timing right now.  But they say you can't time the market... so who knows.", "score": 2, "replies": []}]}]}, {"body": "You're talking from emotion. None of what you're saying has any financial credibility. You're speculating, guessing, and hoping. It's the dumbest way to invest.\n\nBring numbers, facts, graphs to the table, then we're talking.", "score": 1, "replies": []}]}
{"title": "What's the next meme stock?", "selftext": "AMD is the current one, I believe meme power was the main catalyst.\n\nWhat's the next one?", "id": "5wqnmn", "created_utc": 1488319091.0, "score": 12, "upvote_ratio": 0.75, "num_comments": 13, "comments": [{"body": "I mean, AMD does hold a lot of potential, its just the fact that redditors all own gaming PCs and therefore feel like they have a larger stake and understanding of the company. AMD? I know them, they make sweet graphics cards! AMD ALL IN, WAIT WHY IS AMD DOWN TODAY???? SHOULD I SELL???  ", "score": 18, "replies": [{"body": "Drops 1% sell all! Gains 1 % all in!", "score": 5, "replies": [{"body": "Computer crashes while playing Witcher 3, SELL AMD, BUY NVDA.", "score": 9, "replies": []}]}, {"body": "My favorite part is NVDA was right next to them and they chose the wrong horse after so much shit posting. Still has had gains, not nearly as much.  ", "score": 1, "replies": []}]}, {"body": "$NAKD Is going through merger negotiations right now. It's $2 only now but could get AMDed ", "score": 5, "replies": []}, {"body": "Nokia.  \n\n/r/nokia_stock for further d.d.", "score": 6, "replies": [{"body": "Wait.. Nokia?", "score": 1, "replies": [{"body": "like their phones, they are indestructable", "score": 1, "replies": []}]}]}, {"body": "ETRM", "score": 1, "replies": []}, {"body": "$DRYS is still a meme stock", "score": 1, "replies": []}, {"body": "SNAP", "score": 1, "replies": []}, {"body": "Wrong sub", "score": -5, "replies": [{"body": "You want to be poor huh", "score": 9, "replies": []}]}]}
{"title": "It's been a wild 2 months WSB", "selftext": "[deleted]", "id": "5wkwyb", "created_utc": 1488244608.0, "score": 57, "upvote_ratio": 0.89, "num_comments": 18, "comments": [{"body": "been a crazy 2 months here too. look at all this shit I've done year to date so far. http://imgur.com/a/qaGgx \n\ncongrats on the YOLO sir", "score": 14, "replies": [{"body": "Damn dude, you made a fucking killing. Should be top 5 on WSB. What was your starting capital?", "score": 6, "replies": [{"body": "200k at the start of this year. had 50k at start of 2016", "score": 4, "replies": [{"body": "Great job, you are really killing it.", "score": 4, "replies": []}, {"body": "You quadrupled your money in 2 months? JESUS, good fucking job", "score": 2, "replies": [{"body": "the power of futures leverage", "score": 3, "replies": [{"body": "So.. just buy silver futures after a dip?", "score": 2, "replies": [{"body": "I'm short now from 18.36, stop at 18.55. if I get stopped out, then I'd consider buying again. I think risk is to the downside for now. ", "score": 3, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yea right", "score": 1, "replies": []}]}]}, {"body": "What the shit, you made so much on silver?", "score": 4, "replies": [{"body": "look at silver year to date. steady grind higher and I was long 27 contracts for most of that. also caught a few of the little corrections along the way by going short. I have a position on silver almost all the time so far this year", "score": 1, "replies": []}]}, {"body": "Oh god that's hot.", "score": 4, "replies": []}]}, {"body": "Well done comrade", "score": 5, "replies": []}, {"body": "Good shit. I'm proud of you. ", "score": 2, "replies": []}, {"body": "Good job. ", "score": 2, "replies": []}, {"body": "Teach me your ways.", "score": 1, "replies": []}, {"body": "What happened in the beginning of Feburary? All buying puts and calls or do you have a more advanced strategy of writing options?", "score": 1, "replies": []}]}
{"title": "When are you planning on buying the Tesla dip?", "selftext": "[deleted]", "id": "5wle9b", "created_utc": 1488249918.0, "score": 2, "upvote_ratio": 0.67, "num_comments": 13, "comments": [{"body": "you should never buy until you get your one sided view out of the way but after that you should use covered calls to get in cheaply and build cushion, its too wild to just outright buy", "score": 3, "replies": [{"body": "Wait, you mean sell covered calls, or sell cash secured puts?\n\nTSLA isn't a stock I want to limit my upside on with CCs", "score": 1, "replies": [{"body": "1. those two have equally limited upside\n\n2. It has a enough volatility so that if it pops all the way to the point where you can't roll it then, fine whatever, shit happens, but look at its one year chart and tell me you don't want some buffer", "score": 1, "replies": [{"body": "My point is that with selling calls you still have much of the downside of holding the shares, but not the whole upside if it pops, which for me defeats the purpose of holding TSLA.\n\n", "score": 1, "replies": [{"body": "My point is that the stock now trades at 249, two days ago it was 257,  pre earnings it was 280, a month ago it was 235.  Tesla is not going to magically rocket to $400, its stable now until a Model 3 update later in the year.  But if you buying 100+ shares at $250 and it drops to $240 tomorrow in normal volatility that's $1000 difference.  I'm not talking about selling a year call I'm talking about rolling month to month\n\nSource: been rolling TSLA covered call for 1+ year", "score": 1, "replies": [{"body": "I get what you're saying, and I'm glad it's worked for you so far, but I don't discount the possibility of an announcement or a leak sending the price skyrocketing. Imagine if all of the sudden there's good reason to believe Tesla will be the first to market with full autonomy? $400 won't seem crazy then.", "score": 1, "replies": [{"body": "and when nothing happens and it goes to its year low of 178?  and you're already out 7200 before you even get going.  you have to see that they just had earnings, and all they anounced was literally no update and they need more cash - the probability of some breakthrough news vs. them seeeking equity as a discount that knocks off the share price is heavily favored toward the latter", "score": 1, "replies": [{"body": "If you think it's going to 178 then sell..it's not unlikely. It'll either hit 0 or explode eventually. I sold some shares and plan to average down over the next few months. \n\nI agree with you on the probability, but it's not about that, it's about pot odds. The downside of them diluting shares is dwarfed by the upside, even though the downside is much more likely.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "When do they announce Model 3 sales? You buy a few weeks before that.", "score": 2, "replies": []}, {"body": "When it hits 235 I'm gonna see if it levels out and then as soon as it begins peeking up I'll hop on", "score": 1, "replies": []}, {"body": "I am accumulating $TSLA throughout 2017, I buy every month on the first business day of the month.  I also have a *reserve* fund of 2 extra buys if the stock were to have a significant correction.", "score": 1, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}]}
{"title": "$TGT getting dumped on, down 13% Pre-market (Exited yesterday)", "selftext": "[deleted]", "id": "5wnzzc", "created_utc": 1488288927.0, "score": 23, "upvote_ratio": 0.78, "num_comments": 18, "comments": [{"body": "But where will people shop now to pretend they arent lower middle class?", "score": 17, "replies": [{"body": "J-Mart", "score": 2, "replies": []}, {"body": "Hopefully JCP since I'm still long that pile of trash.", "score": 1, "replies": []}]}, {"body": "Damn I really should have sold yesterday. Oh well, time to hold until black Friday", "score": 6, "replies": []}, {"body": "Man, they are going to be insanely cheap now. But retail is kind of scary...anyone jumping in once it shakes out?", "score": 5, "replies": [{"body": "Not sure whether to be jumping in, or buying puts.\n\nNot sure whether to be doing something, or doing the exact opposite.\n\nI shall do nothing.", "score": 6, "replies": [{"body": "My fcking life", "score": 2, "replies": []}]}]}, {"body": "spent too much time talking shit about bathroom policy rather than focusing on their sales", "score": 8, "replies": [{"body": "Too much focus on shit, now their stock takes the biggest turd of them all.", "score": 2, "replies": []}]}, {"body": "YES!!! I sold some call spreads against TGT before the market closed yesterday. Great news to wake up to :D", "score": 3, "replies": []}, {"body": "Obviously down due to fear of store bombings", "score": 2, "replies": [{"body": "That guys probably sitting at ~~home~~ prison thinking he's a genius right now ", "score": 2, "replies": [{"body": "Something tells me he's not sitting at home after having his terrorist bomb plot foiled", "score": 2, "replies": [{"body": "There we go", "score": 1, "replies": []}]}]}]}, {"body": "Garbage earnings. \n\nGlad I dogged the bullet like 50 Cent. This stock has a Target on its back.\n\n... Reports Q4 (Jan) earnings of $1.45 per share, excluding non-recurring items, $0.06 worse than the Capital IQ Consensus of $1.51; revenues fell 4.3% year/year to $20.69 bln vs the $20.69 bln Capital IQ Consensus, reflecting a 1.5 percent decline in comparable sales combined with the removal of pharmacy and clinic sales from this year’s results.\n\nComparable digital channel sales grew 34 percent and contributed 1.8 percentage points of comparable sales growth.\nSegment earnings before interest expense and income taxes (EBIT), which is Target’s measure of segment profit, were $1,344 million in fourth quarter 2016, a decrease of 13.5 percent from $1,554 million in 2015. Fourth quarter EBITDA and EBIT margin rates were 9.5 percent and 6.5 percent, respectively, compared with 9.8 percent and 7.2 percent, respectively, in 2015.\n\nFourth quarter gross margin rate was 26.9 percent, compared with 27.9 percent in 2015, reflecting markdown pressure from promotional and clearance activity and costs associated with the mix shift between the Company’s store and digital channels, partially offset by the benefit of the sale of the Company’s pharmacy and clinic businesses, a favorable merchandise mix, and cost of goods savings.\n\nWarned on Jan 18: Guided Q4 EPS $1.45-1.55 vs. $1.65 consensus; comps (1.5)-(1%).\n\nCo issues downside guidance for Q1, sees EPS of $0.80-1.00, excluding non-recurring items, vs. $1.33 Capital IQ Consensus Estimate.\nCo issues downside guidance for FY18, sees EPS of $3.80-4.20, excluding non-recurring items, vs. $5.33 Capital IQ Consensus Estimate...", "score": 2, "replies": [{"body": "I appreciate your pun.", "score": 2, "replies": [{"body": "http://www.fullredneck.com/wp-content/uploads/2016/10/Funny-Target-Meme-4.jpg", "score": 2, "replies": [{"body": "I appreciate this as well.", "score": 1, "replies": []}]}]}]}]}
{"title": "NVDA dip day 1", "selftext": "Looking like downtrend confirmed. Goodnight sweet Prince \n\nSee you again at 85", "id": "5woinc", "created_utc": 1488294899.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 12, "comments": [{"body": "http://www.nvidia.com/page/home.html", "score": 4, "replies": [{"body": "whats this countdown thingy? is that my last chance to sell?", "score": 2, "replies": [{"body": "probably GTX 1080 ti", "score": 3, "replies": [{"body": "idk seems more sinister. also how priced in is GTX 1080?", "score": 3, "replies": []}]}]}]}, {"body": "I already have $95 3/17 Puts so, this is just making my losses look a little less terrible.", "score": 3, "replies": [{"body": "sold those to you. have fun.", "score": 3, "replies": [{"body": "Maybe some of them; I didn't buy that many.", "score": 1, "replies": []}]}]}, {"body": "i mean worst case we're holding until next er, should reach around $115 again by then", "score": 1, "replies": [{"body": "ya but that is boring stock shit. we want volatility beyond whats expected!", "score": 1, "replies": [{"body": "agreed, nothing would make me happier than +$112.50 by end of week, but we have to be realistic...", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "word. i got 115s i gave up hope on. and 106s......im pissed the 106s didnt hit my PT yesterday but im pretty sure theyll be worth somethin tmrw.", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "well march is tmrw so....", "score": 1, "replies": []}]}]}]}]}
{"title": "Where my AMD put owners at?", "selftext": "[deleted]", "id": "5wp8d5", "created_utc": 1488301877.0, "score": 2, "upvote_ratio": 0.58, "num_comments": 9, "comments": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Bold. Expiry on the call?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "shiieeeeeeeeeet, balls of steel. Hope you win.", "score": 2, "replies": []}]}]}]}, {"body": "Present.\nAverage $15.08\nAin't skeeeerd", "score": 2, "replies": []}, {"body": "I wasn't sure enough to buy puts this morning, but I did sell all my positions at 14.93 yesterday (missed the second half of the run up). I actually made two tick's worth on calls this morning before quickly gtfo'ing.", "score": 1, "replies": []}, {"body": "I've got puts, but its just to protect my gainzzzz", "score": 1, "replies": []}, {"body": "I sold a bunch of 14.50 3/3 puts this morning. I'm ok with getting assigned there.\n\nI'm also selling 15 3/3 calls, and bought a 3/10 15 call. Also bought an October 16 call. \n\nIt's a shitty market day, I could see my 15 calls getting assigned still. Guess we'll see - either way, I'm ok holding a shitload of AMD.", "score": 1, "replies": []}, {"body": "Right here. Holding Mar10 14.5 P's. ", "score": 1, "replies": []}, {"body": "Mine expired... great timing, had 15s for like a month and you cucks kept driving the shit up until today. I didn't rolll them into more puts ", "score": 1, "replies": []}, {"body": "Why did you sell so fast", "score": 1, "replies": []}]}
{"title": "Amazons AWS S3 Service is Down SHORT $AMZN!", "selftext": "Do it now", "id": "5wpko3", "created_utc": 1488305385.0, "score": 5, "upvote_ratio": 0.67, "num_comments": 12, "comments": [{"body": "Doesn't seem wide-reaching enough...they are also now recovering service. Stock didn't move", "score": 5, "replies": []}, {"body": "[removed]", "score": 3, "replies": [{"body": "Spell it with me, S-t-o-c-k-t-w-a-t-s! Now try it again.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "fuck u i swear i thought i blocked ur ass.", "score": 3, "replies": []}]}]}, {"body": "Back to the Stone Age we go", "score": 2, "replies": []}, {"body": "https://status.aws.amazon.com/", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Despite what their status page says, services across all us regions is being affected, or at least us-west-2 as well", "score": 0, "replies": []}]}, {"body": "stupid, don't do this. ", "score": 1, "replies": []}, {"body": "Do so at your own risk. ", "score": 1, "replies": []}]}
{"title": "Let's hear it for $CRM; betting on an earnings beat", "selftext": "Popcorn is ready. Feel like demand for the company's marketing, service, and e-commerce cloud will show continued growth this quarter. Recent deals and increased geographical presence should also serve as positive catalysts.\n\nBanking on a reported EPS of $0.28, versus estimates of $0.25. Let's wait and see.\n\n", "id": "5wqaef", "created_utc": 1488314751.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 11, "comments": [{"body": "Do not buy before earnings. Salesforce, Splunk, workday - all fell after earnings.", "score": 2, "replies": [{"body": "Sales Forces ($CRM) has a mixed history of drop/gain after positive earnings.", "score": 1, "replies": []}]}, {"body": "Fukkin snitch\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "~~Why are the deltas so low on the faggot delights?~~  \nnm, just etrade failing me again and showing me the wrong spread.  \n  \nVolatility seems to be an understatement here ... moving +/- 2% in seconds.", "score": 1, "replies": []}, {"body": "Time to inverse?", "score": 1, "replies": []}, {"body": "so all buyers lose. again.", "score": 1, "replies": []}, {"body": "My prediction was spot-on", "score": 1, "replies": []}, {"body": "It's a good buy for long plays, But short plays not so much.", "score": 1, "replies": []}, {"body": "Dynamics CRM is a superior product and leverages Azure for many many features. I wouldnt hold this long", "score": 1, "replies": [{"body": "I agree. Salesforce is easier for small businesses though. Startups, etc...", "score": 1, "replies": []}]}]}
{"title": "Long GOOGL, Short NFLX", "selftext": "", "id": "5wqh9s", "created_utc": 1488317070.0, "score": 11, "upvote_ratio": 0.73, "num_comments": 14, "comments": [{"body": "Is it really going to compete with Netflix? I feel like people who sign up for Netflix instead of a cable subscription wouldn't consider YouTube TV because it's basically cable. ", "score": 6, "replies": [{"body": "It's not really a competitor. You get a few TV channels where you can watch it live or record it to the cloud for DVR functionality. Netflix and YouTube are great compliments to one another but as a cord cutter myself I have Netflix, HBO Go, DirectTV Now (probably to be replaced by YouTube TV), and I might resubscribe to Hulu. Each service has its own unique content for the most part.", "score": 2, "replies": [{"body": "i'm thinking longer term than you though imo. at some point, i think it would be possible for one of these digital entertainment platforms (netflix, youtube, etc) to become the cable killer. like a monopoly essentially. google stepping up with youtube tv kind of boxes netflix in so netflix wouldn't have a monopoly on cable tv if they decided to go in that direction 10 years from now for example", "score": 1, "replies": [{"body": "You're thinking differently than me, I wouldn't say you're thinking longer term than me. Cable is good because you have content through the channels on there, that's it. Netflix, Amazon, Hulu, and YouTube are all getting into original content which attracts people to their service.\n\nIf I want to watch House of Cards, I need Netflix. If I want to watch Grand Tour, I need Amazon Prime. If I want to watch House Hunters the night it premiers then I need HGTV. So yes, YouTube TV could position themselves a cable killer but they are more competing with DirectTV Now or Sling TV rather than Netflix or Amazon which already produce their own original content.", "score": 1, "replies": []}]}, {"body": "You're basically making their case since you're paying for 4 different subscriptions whereas YouTube would make it free? If I'm not mistaken", "score": 1, "replies": [{"body": "YouTube TV is a paid subscription plan. I'd say it's probably on par with Sling TV with their current offerings.", "score": 1, "replies": []}]}]}]}, {"body": "Nah. Netflix is not focused on TV or live sports. $35 is a bit outrageous tho, if were on there internet were basically one click away from pirating it anyway. ", "score": 3, "replies": []}, {"body": "Fuck yeah, finally ", "score": 2, "replies": []}, {"body": "So stupid to call it Youtube TV.\n\nAlmost as stupid as calling a free \"follow\" service a subscription. ", "score": 2, "replies": []}, {"body": "if it's taken you 12 years to go long GOOG, you might be autistic\n\n", "score": 2, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "What's so bad about the pixel? I have not really read anything that bad about it expect maybe the price?", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "\"the pixel sucks because I break smartphones\" ", "score": 6, "replies": []}]}]}]}]}
{"title": "mmm tastey", "selftext": "", "id": "5wr292", "created_utc": 1488322209.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 15, "comments": [{"body": "What are the gainz from?", "score": 5, "replies": [{"body": "gse preferreds fannie and freddie", "score": 5, "replies": [{"body": "So you're recouping losses from the dip? Or did you buy the dip? Or both?", "score": 2, "replies": [{"body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.8522 \n > [The Story of the Hoover Dam](https://www.youtube.com/watch?v=YNQ4-Cm5AhY)", "score": 3, "replies": [{"body": "LOLOLOLOL, what a shab", "score": 2, "replies": []}]}, {"body": "recouping. sold $3000 worth to pay rent yesterday,", "score": 3, "replies": [{"body": "3000 in rent? Where do you live sugah tits", "score": 3, "replies": [{"body": "A closet in San Fransisco", "score": 3, "replies": []}]}, {"body": "brb gambling 1 mill, doesn't own property", "score": 1, "replies": []}]}]}]}]}, {"body": "Bruh, nobody cares about you quad posting. ", "score": 5, "replies": [{"body": "right i made a mistake there", "score": 1, "replies": []}]}, {"body": "Who let the gimp out of its box?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "lol", "score": 1, "replies": []}]}, {"body": "inb4 stroke b4 50", "score": 1, "replies": [{"body": "yayo", "score": 1, "replies": []}]}]}
