{"title": "Question about TSLA Iron Condor", "selftext": "I'm pretty new to options trading, just started about a month ago when I got my Tastyworks invite, and I have a question about an iron condor I sold in TSLA.\n\nThe strikes are at 245/250/285/290 with 30DTE (as of today, when I opened the position it was 45DTE), and I collected $169 credit for this trade. Initially my put strikes were lower, but when the short call was breached on 2/14 I rolled the put side up to the current strikes of 245/250 and collected some more credit.\n\nThis is my first iron condor, so I'm not entirely sure how to interpret the price action. Even though TSLA has been trading within the range of my IC, the position is showing a gain of -$106 (at time of writing). Is this just because the share price of TSLA is closer to one side of my IC (the call side)? This position has been showing a loss since day 1, but since it's only breached my short call once and then retreated I've kept the position for now and have been watching it.\n\nIs this typical of an iron condor? Should I just wait it out and keep and eye on it? Or should I be managing this trade more closely?", "id": "5vjfup", "created_utc": 1487778975.0, "score": 3, "upvote_ratio": 0.8, "num_comments": 14, "comments": [{"body": "Doing an earnings IC on a volatile stock for your first IC is like saying *\"I want to learn to ride horses, do you have any bucking broncos I can try?\"*.\n\nThe reason your P/L is negative is that TSLA has earnings later today and the IV is increasing.  This works against ICs.  Tomorrow you'll either be better off or dead.  The IV will drop and the price will hopefully stay in your range.", "score": 12, "replies": [{"body": "Good analogy lol. Yeah, I'm definitely regretting this trade, but it's on now and I might as well wait until tomorrow to see where it goes.\n\nAnyway, thanks for the input, increased IV hurting my P/L definitely makes sense, and now I know to stay away from ICs around earnings. \n\nI did several months of research before opening my account, but part of the reason I wanted to jump in at this point was to learn lessons like this that you just can't really get just by watching videos and reading.", "score": 3, "replies": [{"body": "You'll probably know how you're doing tomorrow.  You gave yourself 30 days, which will help.   I'd close the winning side (buy back the short option for .05 or less and let the long side of that spread run.)\n\nEven if you look boned in the morning, it could come back your way.  Don't panic.", "score": 5, "replies": []}, {"body": "I think it's got a 6% move up or down immediately after earnings, but I can't tell you where it'll be in 30 days.  I think your puts are fine, but a 6% move on the upside and you'll have losses on short call.  Hopefully you'll be within the range and with the IV crush, you can close out your IC tomorrow with some gains.", "score": 2, "replies": [{"body": "Down 6.41% today.  I even impressed myself.", "score": 2, "replies": [{"body": "Great call, but my IC is still in the red for some reason :(\n\nIt's a little better now, only about -$60, but it's still within my strikes and still in the red. VOL has halved since earnings, so I'm not sure what's working against me at this point.", "score": 1, "replies": [{"body": "I'm thinking it's because you still have a lot time value, 28 days left if it's the March 24th expiration.  Assuming TSLA stays between $250-285, you'll start seeing more gains closer towards expiration as the time decays more.", "score": 1, "replies": []}]}]}]}]}, {"body": "OMG THIS. I blew out my 5k account on tastytrade following their method to the T because they seem to promote \"follow the stats, dont worry about the underlying\", so I sold premium and ICs specifically on vol stocks........trust me vol is ONLY overstated for etfs. with stock options pick a direction if you do some DD otherwise just do ETFs", "score": 2, "replies": []}]}, {"body": "It is hard to say without knowing all the details.  Your P&L is your initial credit plus the credit for the roll (in other words, the total credit received) minus whatever the condor is trading for now.", "score": 2, "replies": []}, {"body": "woohooo tesla basically unchanged afterhours!!\n\nmy short 277 iron fly might pay off!!", "score": 2, "replies": [{"body": "Hell yeah, I checked at 8, ready to close this IC for a profit!", "score": 1, "replies": []}]}, {"body": "From an account view, it's showing negative not only because the curve is heavy on one side, but also because you rolled the positive side of the trade at least once. That automatically makes the loss look larger than it actually is.\n\nMake sure to take account and calculate the positive side into the current trades P/L.", "score": 1, "replies": []}, {"body": "Sold a Feb.24 250/255/285/290 IC for $2.17, let's hope it stays under 285 tomorrow. ", "score": 1, "replies": [{"body": "looks to be a good trade", "score": 1, "replies": []}]}]}
{"title": "Accurate AMD Valuation", "selftext": "Does anyone have a sound financial estimate of potential AMD earnings?  I keep seeing the buy calls but I don't see any hard financial stats about future performance.\n\nThanks.", "id": "5vf9ie", "created_utc": 1487722070.0, "score": 7, "upvote_ratio": 0.73, "num_comments": 20, "comments": [{"body": "[removed]", "score": 17, "replies": [{"body": "!remindme 260 days", "score": 3, "replies": [{"body": "I will be messaging you on [**2017-11-09 02:14:33 UTC**](http://www.wolframalpha.com/input/?i=2017-11-09 02:14:33 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/5vf9ie/accurate_amd_valuation/de1rjy1)\n\n[**10 OTHERS CLICKED THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/5vf9ie/accurate_amd_valuation/de1rjy1]%0A%0ARemindMe!  260 days) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! de1rl1f)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 3, "replies": []}]}, {"body": "!remindme 260 days", "score": 2, "replies": []}, {"body": "!remindme 259 days", "score": 1, "replies": []}, {"body": "!remindme 260 days", "score": 1, "replies": []}, {"body": "!remindme 260 days", "score": 1, "replies": []}, {"body": "!remindme 259 days \n\nEDIT: I'm back and the comment is deleted. I think it estimated AMD at $17 at this time of the year or something. ", "score": 1, "replies": []}, {"body": "!remindme 260 days\n\n", "score": 1, "replies": []}, {"body": "!remindme 260 days", "score": 1, "replies": []}, {"body": "!remindme 100 days", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}, {"body": "AMD's CEO is LISA SU\n\nL-I-S-A S-U\n\n12 + 9 + 19 + 1 + 19 + 21 = $81\n\nThat's how much AMD's stock is worth. Get in, AMD is powering the rocket ship to space with or without you", "score": 9, "replies": [{"body": "With or without you.....", "score": 0, "replies": [{"body": "Nice to see you can type", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Can't you estimate some type of sales based on current Intel desktop CPU sales?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well, I'm a bad example because of my heavy use of finite element analysis.  The wife renders heavily, too.\n\nWith that said, it does seem even the most basic of CPUs in the last five years is acceptable for the vast majority of people who just want to read Facebook.\n\nI am very interested, however, in their Naples line of server CPUs.  Dual CPU, thirty two core and hyper threading?  That's 128 threads per machine.... and with the rise of cloud computing....", "score": 1, "replies": []}]}]}]}, {"body": "$AMD Pre-Market high of $14.19 so far", "score": 1, "replies": []}]}
{"title": "Thoughts on GOOGL (Alphabet)", "selftext": "Almost on the all-time high. Is it a good time to jump on it or is it too late?\n-looking to hold for about 5 years. I see big growth.", "id": "5vi2ga", "created_utc": 1487761247.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 13, "comments": [{"body": "Google is a safe place to park it IMO", "score": 6, "replies": []}, {"body": "What \"big growth\" does google have? Self driving cars is soon old news - as self flying drones with passengers are moving into market in a few months. My best bet is go for amazon. They have huge spending right now (airport anyone?) constantly moving into new markets and beating competition.", "score": 1, "replies": [{"body": "They are the leaders in online ad-revenue, firms are dependent on advertising on Google. They own YouTube.  Their P/E ratio is healthy compared to Amazon, which might suggest it is overvalued (everyone's buying into the hype at the moment). For Google I don't necessarily see strong growth in the short term, rather in the long-run, meaning in 5-10 years.", "score": 1, "replies": [{"body": "compared to Amazon......don't compare anything to Amazon.\n\nBut Google is a pretty good stock to buy if you are willing to hold 5 years. Personally I'd wait a bit for a dip.", "score": 2, "replies": [{"body": "Tell me why not. Everyone seems to worship Amazon, thus being overvalued. And I understand that their revenue growth, future plan is huge and their diversification in products as well but in the end it is just another company.", "score": 1, "replies": [{"body": "I don't own Amazon. All I'm saying is Amazon is the exception to the rule. I would not base your investment decision with Amazon as the baseline. They are a weird stock. Wall Street is valuing Amazon as if its a no brainer they will dominate retail in the future. Not just online retail, but ALL retail. IMO, its bunch of hot air and when the Amazon bubble bursts, it will be ugly.", "score": 1, "replies": [{"body": "Yes exactly, that´s the issue. Whether they will dominate the market or not, the chance is there of collapsing and like every other company there are risks involved. Therefore I think Google is a safer bet (lower risk of a correction)", "score": 1, "replies": []}]}]}]}, {"body": "Google is losing money on youtube. It has never been a cash cow.\n\nOnline ads? Maybe. But facebook and others are competing with them hard.", "score": 1, "replies": [{"body": "Okay that might be true. Yet, YouTube was bought for just 1.6 billion and is now a lot more worth. Secondly there is still a lot more room for growth (e.g YouTube live, more ad-revenue etc.). The market for online videos has never been that essential before (also starting to be for Facebook).", "score": 1, "replies": []}]}]}]}, {"body": "For a 5 year hold Google is a good stock", "score": 1, "replies": []}, {"body": "Technically $867 is the previous high so as kdcurry said you may want to wait for a pullback, but this is a level to keep an eye on.  If it breaks through this and closes above then it could go higher.  If it pulls back it could retest support at $812-$815.", "score": 1, "replies": []}, {"body": "Never heard of them. How do I look them up?", "score": 1, "replies": [{"body": "use netscape", "score": 1, "replies": []}]}]}
{"title": "Did anyone get a PM from a woman a week or two ago asking if you trade off of President Trump's tweets?", "selftext": "[removed]", "id": "5vikwf", "created_utc": 1487769133.0, "score": 12, "upvote_ratio": 0.8, "num_comments": 11, "comments": [{"body": "I told her he tweets off of my trades.", "score": 41, "replies": [{"body": "Marvelous. ", "score": 14, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "If you're actually serious here's an Imgur link to the message. It's not a rick toll or Peyton Manning or any meme. Lemme know if you get it. https://imgur.com/a/HpDen", "score": 1, "replies": [{"body": "I checked her account... no posts to gone wild. meh.\n\nshe posted about bitcoin and drone racing so very  mildly interested", "score": 8, "replies": [{"body": "She only sends nudes through pm's in trade for insider stock tips ", "score": 3, "replies": []}]}, {"body": "Time to stop reading MW", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I've never posted a trade LOL. Just a couple suggestions back when trump was tweeting $BA and $LMT", "score": 1, "replies": [{"body": "she's cyber stalking your ass", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "PM from a woman? Yeah, thats a no from me dawg...", "score": 12, "replies": []}, {"body": "They developed an algorithm or something that trades off his tweets someone posted the link when \"American steel\" was the phrase of the day ", "score": 3, "replies": []}, {"body": "Ask her for nudes.", "score": 2, "replies": []}]}
{"title": "How to Make Easy Money", "selftext": "[deleted]", "id": "5vixv7", "created_utc": 1487773656.0, "score": 1, "upvote_ratio": 0.53, "num_comments": 10, "comments": [{"body": "i wasn't convinced until step 4", "score": 5, "replies": []}, {"body": "You forgot the step where you limit your trading exclusively to Faggots Delight strategy.  That is key.", "score": 2, "replies": [{"body": "you are wise. ive been doing 2 week out expirys, will switch now \n\n/bow", "score": 1, "replies": []}]}, {"body": "Get a job. Works for me. ", "score": 1, "replies": [{"body": "dang. i forgot to add quit your job. good idea", "score": 1, "replies": []}]}, {"body": "yeah you're down because of all the commissions and fees you have to pay. Imagine being down in one of the greatest runs in recent memory. You must be an idiot to be down in this market.", "score": 1, "replies": [{"body": "lol FWIW this post is facetious garbage. I don't really know what point OP is trying to make.", "score": 6, "replies": [{"body": "You must be an idiot in this market", "score": 1, "replies": []}]}, {"body": "how could JNUG do me wrong!", "score": 1, "replies": []}]}]}
{"title": "Time for AMD puts?", "selftext": "This looks like it's gone as high it can get before earnings, should hover around $14 mark now that the big news and rumours are out of the way.", "id": "5vjj8m", "created_utc": 1487779898.0, "score": 11, "upvote_ratio": 0.76, "num_comments": 18, "comments": [{"body": "On the other hand inverse WSB?", "score": 14, "replies": []}, {"body": "ryzen release, could be rip puts or moon \n", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "And then you look at intels pipeline and listen to investor meetings to realize their next big iteration will be 7nm chips which are not projected to come out until 2018. While this is a big day for amd april is bigger because thats when they launch naples their server cpus and my guess is they pick up another big company with those. 2017 outlook for amd seems like nothing but up assuming all goes as planned.", "score": 3, "replies": []}]}, {"body": "buy the rumour, sell the news mate ", "score": 1, "replies": [{"body": "not true if ryzen is good you are gonna see amd in mars before musk, lets see I'm not holding amd best of luck op", "score": 8, "replies": []}]}]}, {"body": "Wow I made so much money shorting AMD!\n\nSaid no one ever.***\n\n***Except a few people. Namely, those who shorted right before market crashes. And in the 2010s prior to Lisa Su's arrival.", "score": 5, "replies": []}, {"body": "No way man, AMD is going to the moon on a rocketship named Ryzen 🚀🚀🚀", "score": 5, "replies": []}, {"body": "They seem overbought, as another poster just pointed out to me. I don't think I'm gonna touch it, personally, but there's definitely money to be made, as always.", "score": 2, "replies": [{"body": "I've been hearing people say this for the past year. Look where we are now", "score": 13, "replies": [{"body": "this", "score": 1, "replies": []}, {"body": "I mean, I bought them at $1.68, sold at $8.66, so don't listen to me - I didn't think they were worth $9.", "score": 1, "replies": []}]}]}, {"body": "How are they making money at the prices? Say they capture a significant market share. Are their profit margins decent enough to actually see a return?", "score": 1, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "They are not making money.", "score": 1, "replies": []}]}, {"body": "I feel like the stock is so expensive because all of the leaks are priced into the stock.  If anything from the leaks aren't true, I think the stock is going to go down pretty hard", "score": 1, "replies": [{"body": "I'm not sure about pretty hard. Most of the major investors don't put money in on speculation of rumors. Sure it might fluctuate but the general consensus has been this is the new current value on the company.  ", "score": 1, "replies": [{"body": "You're right, but after the momentum this stock has seen, even falling to $12 would seem massive", "score": 3, "replies": [{"body": "The response to AMD falling to $12 in my opinion would probably be a lot of people buying again; however, it would show the large level of speculation this stock is under at the moment. \n\nIt's worth mentioning that the stock was $10.60 on on the 31st of January. ", "score": 1, "replies": []}]}]}]}]}
{"title": "PC World: AMD's Ryzen launches March 2, outperforming Intel's Core i7 at a fraction of the price", "selftext": "", "id": "5vju5v", "created_utc": 1487782871.0, "score": 137, "upvote_ratio": 0.95, "num_comments": 15, "comments": [{"body": "Hahaha I sold my $4 AMD when it hit $6.50 kill me fam", "score": 41, "replies": [{"body": "Get back in :p  Still money to be made here", "score": 21, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "I kept/keep telling myself there's a bubble", "score": 6, "replies": [{"body": "The company is doing a 100% turnaround.  if you looked at 10 year prices, you were fine until about $9", "score": 3, "replies": []}]}]}, {"body": "My buy order didn't go throught @13.13 for reasons unknown fuck me sideways faggots", "score": 3, "replies": []}, {"body": "Too bad once you sell you can never buy again. Ever.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "AMD is well positioned to compete with both NVDA and INTC. Competing profitably and successfully isn't necessarily the same as taking over the market, though.", "score": 9, "replies": []}, {"body": "soxl", "score": 5, "replies": []}, {"body": "I bought some soxx yesterday, don't fuck me world. ", "score": 2, "replies": []}, {"body": "Intel can't even get 10nm working properly. \n\nIt'll probably be a clusterfuck.", "score": 2, "replies": []}, {"body": "going to be a looong time between starting work on a 7 nm plant and getting a consumer product out the door", "score": 1, "replies": []}]}, {"body": "To 80$$$!!! <3 ", "score": 2, "replies": []}, {"body": "This stock should have a rally tomorrow", "score": 2, "replies": []}, {"body": "I'M SITTING ON MY FX-8350 AND READY TO UPGRADE.  LET ME PUT MY COCK IN IT.", "score": 1, "replies": []}]}
{"title": "So how 'bout a $FIT straddle?", "selftext": "Tough competition from $AAPL. And $GPRO tanked, too. But then again ...", "id": "5vku3c", "created_utc": 1487792109.0, "score": 4, "upvote_ratio": 0.83, "num_comments": 10, "comments": [{"body": "How bout FIT puts since it's a totally garbage company?", "score": 13, "replies": [{"body": "Or sell calls.", "score": 1, "replies": []}]}, {"body": "I just got my strangle today on both $FIT and $GPRO; they are both $FCKD !", "score": 2, "replies": [{"body": "It's moved 1%... you are $FCKD my friend", "score": 0, "replies": []}]}, {"body": "Bag holder, signing in. Can't do anything but ride it out.\n\nEdit: Trading higher in afterhours, between 2%-5% gainz", "score": 2, "replies": []}, {"body": "Piece of shit misses earnings, revenue declines, zero fucking innovation, zero fucking reason to buy them out, basically just a company that sets cash on fire, and of course it goes up", "score": 1, "replies": [{"body": "I mean the stock is down 17% this month because people knew earnings would miss, so the stock was already fairly valued by that point. ", "score": 3, "replies": [{"body": "This.", "score": 2, "replies": []}]}, {"body": "It's basically flat, up 2% after 22 minutes.", "score": 1, "replies": []}]}]}
{"title": "AMD.... I get the hype but... ?", "selftext": "I bought about $30,000 worth of shares a week ago and made a happy return. \n\nAs someone who works in the computer industry... its very obvious that intel and Nvidia have a response to AMD's upcoming RYZEN and VEGA... easily will be undercut and outperformed...\n\nSo why is everyone expecting AMD to shoot up to the moon? I just don't see it happening... $14 is already pushing it and thats with leaked benchmarks and pricing now announced.", "id": "5vkwhj", "created_utc": 1487792753.0, "score": 5, "upvote_ratio": 0.63, "num_comments": 17, "comments": [{"body": "As someone also in the business its obvious you have done little research on AMD.", "score": 19, "replies": [{"body": "", "score": 1, "replies": [{"body": "This is wsb. Take that fundamentals shit to r/investing. \n\nThe DD here consists of circle jerking and investing in the initials of whoever busts last. ", "score": 11, "replies": [{"body": "Today I made money because of a ski jump doodle technical.", "score": 14, "replies": [{"body": "Ah, yes FB was a good jump doodle today.", "score": -1, "replies": []}]}]}]}, {"body": "As someone not in the industry I think you're both neglecting the fact that over the short term, the markets are irrational.", "score": 1, "replies": []}]}, {"body": "It's all pure speculation right now.\n\nThe money isn't made on client desktops despite the hype there from some gamers and consumers. \n\nThe money to be made for AMD is in the server space, a space that they have been shut out of for years now because of Bulldozer. \n\nIf Ryzen trounces Intel on performance per watt, then expect the stock to move even higher. If in two quarters time, they announce that they have returned to profitability thanks to Naples, then the stock will only go up from there. \n\nIt's speculative, yes. But in the background of a bull market and the fact that AMD might finally grab market share from Intel on the server side, I can easily see this hitting over $20 a share by the end of the year. ", "score": 12, "replies": [{"body": "$20 by end of year? In the last month alone it's gone up $4.50. I can see $50+ easily", "score": 1, "replies": [{"body": "You do know about diminishing returns right?", "score": 11, "replies": [{"body": "Diminishing returns? You were probably one of the people saying AMD won't go over $4.00 last year", "score": -3, "replies": []}]}]}, {"body": "the whole trump bull train is out of speculation", "score": -1, "replies": []}]}, {"body": "this convo makes me wanna jack off", "score": 3, "replies": []}, {"body": "Of course they will have a response, but it's not like they can just develop a whole new competitive architecture overnight. ", "score": 2, "replies": [{"body": "Yep, this is it. The last time AMD beat Intel was in 2006 and the price hit 40 before Intel announced something better ", "score": 2, "replies": []}]}, {"body": "I completely agree with you, I've been looking into some puts on AMD pretty far out ", "score": 0, "replies": []}, {"body": "the entire sector is still bullish, so i think the competition isn't the main driver behind any of the companies' gains", "score": 0, "replies": []}]}
{"title": "Look at how similar the AMD chart was before its last major run to today.", "selftext": "", "id": "5vl8fe", "created_utc": 1487795935.0, "score": 27, "upvote_ratio": 0.85, "num_comments": 14, "comments": [{"body": "good DD, all in", "score": 12, "replies": []}, {"body": "So this means it's gonna go up? All in.", "score": 9, "replies": []}, {"body": "AMD is hyped by everyone and their mom, I expect a dip coming in tomorrow and possibly friday. Gonna load my boat with more of the gud shit.", "score": 5, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "Automatic Masturbation Device", "score": 18, "replies": [{"body": "Also w/ ryzen. ", "score": 4, "replies": []}]}, {"body": "I'm all in on the AMD bull train. What I meant is that I don't expect the stock to make much progress tomorrow, and it could possibly be in for a dip from people selling the news.", "score": 3, "replies": []}]}, {"body": "Friday is a bull day.  Monday should be your bear day.  ", "score": 1, "replies": [{"body": "Maybe true in most cases but amd is doing a vega announcement on Tuesday so I'm pretty bullish on Monday. ", "score": 2, "replies": [{"body": "Sorry, misread your comment and thought you were shorting.  Now I get it.  ", "score": 1, "replies": []}]}]}]}, {"body": "How can there be a dip if fucking everyone is buy this shit guys...oh yea I forgot 200 plus P/E ratio. But that is what makes everyones cock hard. We are all looking for that under 20 dollar play.", "score": 2, "replies": []}, {"body": "What software is this? ", "score": 2, "replies": [{"body": "Thinkorswim", "score": 3, "replies": []}]}, {"body": "buying Long OTM calls\n", "score": 1, "replies": []}, {"body": "You know you don't have to use red for the arrows in SnagIt, right", "score": 1, "replies": []}]}
{"title": "Possible Explanation for $NVDA After-Hours Dip?($TSLA Earnings Call)", "selftext": "Just spit-balling here, but could NVDA's after-hours drop be related to Musk's passing comments on the Tesla earnings call regarding the NVDA hardware integration:\n\nWhen asked what delayed the Tesla software update, Musk \"admits transition from Mobileye system to Tesla software running on Nvidia hardware was not as easy as expected.\"\n\nSeems like a minor passing comment to me, but I am just throwing it out there for discussion.  It's obviously unusual for NVDA to drop after-hours especially on high volume, so I am grasping here.\n\n\n\n", "id": "5vm6ng", "created_utc": 1487805084.0, "score": 1, "upvote_ratio": 0.54, "num_comments": 18, "comments": [{"body": "Depends on how the overall market is tomorrow. If it opens red, expect NVDA to open even more red than this. ", "score": 4, "replies": []}, {"body": "Why NVDA is down:\n\n\"Nomura downgraded NVIDIA two notches to Reduce from Buy and lowered its price target to $90 from $100 saying consensus underappreciates the slowdown in gaming and the potential impact on the multiple.\"\nRead more at: http://thefly.com/landingPageNews.php?id=2509495\n\nhttps://twitter.com/QuantTrader/status/834517391295946752\n\n", "score": 3, "replies": [{"body": "Yeah, I know.  But I am not at all convinced that this drop is attributable to the Nomura downgrade.  Also - just FYI, I posted this on another NVDA thread a minute ago:\n\nOkay, so in case you missed it, here is a quick recap of where Wall Street currently stands, vis-a-vis NVDA (I can''t make this shit up):\n\n**7 Days Ago: Nomura Says NVDA a BUY - Raises NVDA Target from $80 to $100**\n\nhttps://www.thecerbatgem.com/2017/02/17/nomura-reiterates-buy-rating-for-nvidia-corporation-nvda.html\n\n**4 Hours Ago: Nomura Says NVDA a SELL; Advised Investors to Sell NVDA and Buy INTC Instead -  Lowers NVDA Target from $100.00 to $90.00**\n\nhttp://seekingalpha.com/news/3245534-nvidia-minus-2_4-percent-hours-downgraded-buy-reduce-instinet\n\n**4 Hours Ago: Rosenblatt Says INTC a SELL; Advised Investors to Sell INTC and Replace with NVDA - Initiates NVDA Target at $140.00**\n\nhttp://www.investors.com/news/technology/buy-amd-broadcom-nvidia-sell-intel-chip-analyst-says/?yptr=yahoo", "score": 1, "replies": [{"body": "People are looking for a reason to sell given the high valuation.\n\nI plan to close my short puts at a loss tomorrow. Premarket tells me they are very close to hitting my strike of $106.", "score": 1, "replies": []}]}]}, {"body": "Situation is under control.  Just sent a quick email to the Nomura analyst asking him WTF the deal was, and whether he was bagholding some piece of devastating news that the rest of the market doesn't have. This whole downgrade mistake will be fixed tomorrow.\n\nIf you have any questions, comments, or thoughts on this matter, I would most definitely urge you to shoot Mr. Shah a note:\n\nRomit.Shah -at- Instinet.com", "score": 1, "replies": [{"body": "Because why consider the information when instead you can attack the messenger", "score": 3, "replies": [{"body": "Jesus. Not this fucking guy again.", "score": 1, "replies": []}]}, {"body": "?? downgrade was a mistake? How does that even happen", "score": 1, "replies": [{"body": "Joke. Kidding. I am not actually going to \"fix\" the downgrade.  That was also a joke. ", "score": 1, "replies": []}]}, {"body": "Dude you are taking this way too personally. I told you that long-dated calls were not the best idea, shares are better because they do not expire. Especially if you are playing with $100,000.\n\nOptions can increase gains yes, but they also expose you to a lot of risk in exchange for those theoretical gains.", "score": 1, "replies": [{"body": "I hear you, and I obviously considered the difference between owning shares and buying calls.  Given that my one NVDA trade turned $7K into $100K in just over a year makes it sort of hard to make the case that I would have been better off buying the shares straight-up.", "score": 1, "replies": [{"body": "Well, take the gains, buy shares if you want, but I think the bull run for NVDA is over. It's time to find other opportunities lol. ", "score": 1, "replies": [{"body": "Too early to close the book on NVDA.  How can the bullish run be over for a company that is posting 100% year-over-year growth, and operating in one of the most high-demand industry sectors in the world?", "score": 1, "replies": [{"body": "You are too fixated on this. The point of you doing all this is to make money, not to be a fan of some stock or company. Moment something starts to falter is when you take money off the table. Taxes suck, yes, but at least the wealth is now in cash, not options. You've made a ton of money already. Why not take some of it off the table before losing it all or watching those gains erode?\n\nI rode NVDA from $89 to $111 and I think that was still pretty damned good. ", "score": 1, "replies": [{"body": "My gains are tax free, so that's not even the issue (bought this in my Roth IRA).  We just have differing trading strategies. If I walked away at every falter like this I would have been out of this NVDA trade 3 weeks after I opened it, when the position was down 35%.  I am just more of a long-term guy, and I focus mostly on LEAPS.  Your strategy is certainly good too.  And look - if the market weren't so extended right now, I probably would think about taking this $100K off the table, and use it to write deep ITM index puts like crazy over the next 12 months.  But just not the right market for that, in my opinion.  But right now, I don't see a better way to deploy this capital.  That said, I have a stop order in with my broker, and if NVDA breaches $100, I'm out.", "score": 1, "replies": [{"body": "Fair enough. At least you have a stop loss in place. You are practicing some risk management. That is what's important. \n\nYou have a greater risk appetite than I do, that's for sure!", "score": 1, "replies": [{"body": "Yeah - and my stop is only $7-8K south of where I am now.  That would suck a little bit, but certainly not catastrophic.  Once I sell, I then I can look forward to accessing this money in like 30 fucking years . . . ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Settle down guys, the email thing was a joke.  ", "score": 1, "replies": []}]}]}
