{"title": "DIS BIG Put Option Flow", "selftext": "Today I saw DIS, they had aggressive option put orders\n\n&#x200B;\n\nHere - [https://ibb.co/qDRppTp](https://ibb.co/qDRppTp)\n\n&#x200B;\n\nThe orders volume of the contracts exceeded the open  interest  in   multiple trades so it's  most likely not closing  positions.   Either    buy     to  open orders  or sell to open orders and  based on   the    aggressiveness  of the  orders one can infer its buy to  open.  Some  of     these may be     hedges  and some most likely not.\n\n&#x200B;\n\nThe repeating orders for april 100/90 puts are aggressive as well as the may/june way OTM 90/85/80 puts.\n\n&#x200B;\n\nDon't  just enter YOLO's in positions  based on this data alone in most cases.  Use   technicals/fundamentals/options data/market feelings all combined instead of just 1 of these.   Use protection like  spreads if you worry about losing what u put in and be smart,  understand the risks of putting $ into weekly  expiry's, consider a longer expiry.\n\nAlso with the market going lower use technical's/fundamentals/options data-flow/market  sediment all combined.\n\n&#x200B;\n\nAlso, someone said ibb has ads so use an adblocker we are in 2020.\n\nEDIT - Wanted to add, puts are expensive so know that the premium is high and a move would need to be huge to make good $.\n\n&#x200B;\n\nEDIT #2 - When the market is having extreme volatility it's harder for short term options to have good success rates, consider spreads", "id": "fg6p83", "created_utc": 1583807202.0, "score": 47, "upvote_ratio": 0.9, "num_comments": 89, "comments": [{"body": "Someone knows something we don’t know yet.... :)", "score": 39, "replies": [{"body": "Many people know things we don't know yet.   \n    \nE: that's a weird flare, and I don't get it. Someone get me in the loop. Is it an Epstein joke?    \n    \nE2: exited my DIS downies this morning. Not getting back in unless there is a super big 🌈pump to cheapen things back up. Feel dumb, but also okay about it.", "score": 16, "replies": [{"body": "I'm still holding my 4/17 110p that I got last week for 3.85.\n\nEdit: Am not just holding one contract. I have lots of them.", "score": 6, "replies": [{"body": "I can dig it 👌", "score": 2, "replies": []}, {"body": "They printed today", "score": 2, "replies": []}]}, {"body": "Feds pumping that shit tomorrow. Futures looking real fucking green. I know futures don't matter unless they are in the 500's then it's a sure thing.", "score": 3, "replies": [{"body": "Down 8%, up 2%     \n    \n☝️ all month.     \n     \nIt's how MMs fleece dumb bulls.", "score": 7, "replies": []}]}]}, {"body": "It's that retard who said he was going g to catch the WuFlu and visit the park.", "score": 6, "replies": []}]}, {"body": "Look at those premiums. \n\nJust got out of CCL looking for my next play.. feel like I'm to late to the DIS party.\n\nGotta find that next industry!", "score": 27, "replies": [{"body": "i agree.  Maybe movie chains? I worry to go to the movies as so many ppl are confined into a small space and can get sick from 1 sick person coughing behind me", "score": 7, "replies": [{"body": "Movies, theme parks, and cruise ships. Name one sane person going to any of those right now.", "score": 7, "replies": [{"body": "and Churches", "score": 2, "replies": [{"body": "Churches makes tendies. We still need those.\n\n[tendies](https://www.churchs.com)", "score": 5, "replies": [{"body": "hahahaaa", "score": 2, "replies": []}]}]}, {"body": "I get that movie theatres will get hit hard (and have already), but surely they can't actually all go bankrupt. Where will people go for this huge venue with upgraded audio/visuals to see a premiere after this is all over?", "score": 1, "replies": [{"body": "Kids watch movies on iPads with their AirPods in. Plus the theaters have tried to cram every gimmick down our throats to boost ticket prices to no avail. \n\nDisney will pivot hard to plus they’ll acquire TiVo and rename it to secure their distribution but Apple will still rule them and take a cut of the monthly subscription.", "score": 2, "replies": []}]}]}, {"body": "Yup puts on movie chains, calls on nflx on the dips", "score": 2, "replies": []}, {"body": "Amc 3/13 $5.5p", "score": 2, "replies": [{"body": "TF?!? AMC is a $3.95 stock??", "score": 2, "replies": [{"body": "Just a position Ive been holding, I'm riding amc down about to fold over tomorrow or Wednesday", "score": 1, "replies": []}, {"body": "It was 8$ last week, worth 400m right now and they plan to buy back 200m worth of shares.\n\nTon of debt tho, but 5b in revenue", "score": 1, "replies": [{"body": "I don’t care about any of that. Never have I seen someone recommend a deep in the money put on a penny stock.", "score": 4, "replies": []}]}]}]}, {"body": "LYV puts", "score": 1, "replies": []}]}, {"body": "$GIS 3/20 60c. Surge in spending on consumer staples lately and ER on 3/18. Expecting a pop on guidance.", "score": 7, "replies": [{"body": "You again! I also have some 3/20 57.5c. You holding until after ER?", "score": 2, "replies": [{"body": "Planning on it. Unless we get a decent run up this week on the back of Trump/central bank intervention. Will be watching this one closely though", "score": 2, "replies": [{"body": "Same. Good luck!", "score": 1, "replies": []}]}]}, {"body": "I'm in on this too. Let's go lucky charms! 💓 🌟 ☘️", "score": 1, "replies": []}, {"body": "Im on this one too.", "score": 1, "replies": []}, {"body": "This makes me very happy about my 4/17 60c’s I got last week.", "score": 1, "replies": []}, {"body": "what a creative name, i give u props", "score": 1, "replies": []}, {"body": "I bought 2 3/20c GIS at 0.06 each and im up to 433.33%....lol", "score": 1, "replies": []}, {"body": "My GIS calls are down a lot :( you're not worried about IV crush when ER comes out?", "score": 1, "replies": []}]}, {"body": "Private prisons, GEO,  no significant outbreaks in US. \n\nMeanwhile, Italy has riots.", "score": 2, "replies": []}, {"body": "You think ccl is at a bottom?", "score": 1, "replies": [{"body": "I wouldn't say it's at bottom but I would say it's maybe $3-4 off.\n\nI could of risked holding another week for an extra $4-6k or I could realize my $14k so for me it was time to sell. I also wanted to ride this bull run tomorrow morning.", "score": 3, "replies": [{"body": "agree with this, but if we go into a recession it will get bad for ccl", "score": 3, "replies": []}]}, {"body": "Not even close.  A lot of people are thinking 20 will give some resistance though and don’t want to prolong the gains.", "score": 2, "replies": [{"body": "How could it get any worse for CCL? The US just basically said, “don’t go on cruises what ever you do” \nThat’s priced in now, what’s next?\nI have 3 positions in CCL but now seeing as people are pulling out I’m worried about my positions", "score": 2, "replies": [{"body": "Bankruptcy isn’t fully priced in yet", "score": 2, "replies": []}]}]}]}, {"body": "$FUN? $PLAY? Volumes tend to be a bit low tho.", "score": 1, "replies": []}, {"body": "GoPro if travel is down no ones buying action cams.", "score": 1, "replies": []}]}, {"body": "Has anyone used this data to actually inverse trades? I’ve been holding dis puts for a while and have made some money but it’s not going down forever. Does aggressive put buying actually suggest the average investor aka dumb money is now going short, at which point it’s probably better to go long?", "score": 15, "replies": [{"body": "Depends on industry. If parks close it's not hard to imagine DIS falling a bit more, but I don't think it's 4/17 $75 like some people are saying.\n\nHonestly I'm jumping on oil leaps while they are dirt cheap.\n\nBut I do want to grab a few puts", "score": 5, "replies": [{"body": "What ticker for oil leaps?", "score": 1, "replies": [{"body": "UCO & USO", "score": 1, "replies": []}]}]}, {"body": "Off topic but nice name.", "score": 3, "replies": []}, {"body": "No offense at all my man, but you’re dumb money. Unless you are superior to the average investor, by your logic, I mean.\n\nEdit: I mean, I’m dumb money, too, right?", "score": 2, "replies": []}, {"body": "Nah. Smart money doesn't inverse this. Too risky, no real chance of reward. Best okay is to move on. Oil or volatility are still good, imo. Or, if you really want to play DIS, join Theta gang selling OTM FDs.", "score": 2, "replies": []}]}, {"body": "This is my next play after this call flip in the morning. I'm buying the spike on DIS, 4/17 75p. Park closures coming, I can feel it in my bones.", "score": 7, "replies": [{"body": "Im waiting for weds fed pump.", "score": 5, "replies": [{"body": "Might be Tuesday that you see it reflected in the market. It's not like an emergency meeting and short notice press conference are going to be anything other than announcing a stimulus.\nPeople know that tonight, let alone tomorrow.", "score": 4, "replies": [{"body": "Has there been any news on an emergency fed meeting other than the one on the 17th/18th?", "score": 2, "replies": []}]}]}]}, {"body": "Great, I just sold some long dated call spreads. Can't wait to collect some th8a\n\n🐌🐌🐌", "score": 7, "replies": []}, {"body": "You just made me feel so much better about my puts. I'm going to sleep well tonight. Thank you, comrade.", "score": 5, "replies": []}, {"body": "I was going to dis put tommrow. Sooooo closing of parks not going to turn shit up?  and if the market goes overall red wont Dis drop more any add those 2 factors. Dosent seem that bad of an idea", "score": 3, "replies": [{"body": "I feel like DIS is crazy pricey for the potential", "score": 6, "replies": []}, {"body": "I was just at Epcot and Disney Studios today that shit was packed and Purell stands everywhere. They’re not closing unless the shit really, really, really hits the fan.", "score": 1, "replies": [{"body": "Of course not. Like 35% of parks revenue comes from Walt Disney World. If they close WDW, it's dropping to $70", "score": 1, "replies": []}, {"body": "Look man if this retard still went to the park during the virus season, no way Dis gonna close down parks.   (Unless this guy has puts and is doing what we all wanted him to do.)", "score": 1, "replies": []}]}, {"body": "This is my thought. We get a bounce tomorrow, possibly into Wednesday, then we continue the downward trend. If parks close, we're fucking rich. It doesn't even matter if they're not super important for revenue, its the namesake of the company.", "score": 1, "replies": [{"body": "Parks are around 40% of revenue.", "score": 4, "replies": [{"body": "Even better.", "score": 1, "replies": []}, {"body": "Sauce?\n\nI mean Disney is a media mogul. They own aboslutely everything entertainment. Closing the parks would for sure hurt there stock price but to drop it another $30? I just don't see it.", "score": 1, "replies": [{"body": "[Looks like it was 36% last year, it was 40% back in 2017.](https://www.statista.com/statistics/193140/revenue-of-the-walt-disney-company-by-operating-segment/)", "score": 1, "replies": []}, {"body": "https://i.imgur.com/RpsJvjJ.jpg", "score": 1, "replies": []}]}]}]}]}, {"body": "The mouse has small pp", "score": 3, "replies": [{"body": "u would know....", "score": 1, "replies": []}]}, {"body": "[Help me I’m in danger](https://www.reddit.com/user/Not_FaZe_Worthy/comments/fg1u15/20_minutes_before_market_closed/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "score": 2, "replies": [{"body": "Danger? Consider using a spread by adding on another leg if you get cold feet about it.", "score": 3, "replies": [{"body": "Last time I followed one of your post I profited, I’m thinking of going more into 4/17 100p", "score": 2, "replies": [{"body": "Dis needs news to come out about closings of parks, not sure if it will happen. Lots of the dis move is done already so personally i would wait for something better to come along that isn't priced so high, maybe consider a spread", "score": 1, "replies": []}]}]}]}, {"body": "Friendly reminder that selling a put is a limit buy order that you get paid to make.", "score": 2, "replies": []}, {"body": "/u/bobbythebich what’s the dates?", "score": 1, "replies": [{"body": "April/May/June/July", "score": 2, "replies": [{"body": "Thank you", "score": 1, "replies": []}, {"body": "!remindme 8 hours", "score": 1, "replies": [{"body": "There is a 20.0 minute delay fetching comments.\n\nI will be messaging you in 7 hours on [**2020-03-10 12:05:03 UTC**](http://www.wolframalpha.com/input/?i=2020-03-10%2012:05:03%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/fg6p83/dis_big_put_option_flow/fk2zi2c/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffg6p83%2Fdis_big_put_option_flow%2Ffk2zi2c%2F%5D%0A%0ARemindMe%21%202020-03-10%2012%3A05%3A03%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fg6p83)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "FD’s. 3/13 or 3/20 don’t waste time or money on anything further out.", "score": 1, "replies": []}]}, {"body": "Fuck it I'll buy one.", "score": 1, "replies": []}, {"body": "Call Spreads right now all day every day.", "score": 1, "replies": []}, {"body": "Just a heads up I think six flags is massively over sold. It’s down 50% in one month. That’s insane this virus might effect one year of revenue but it shouldn’t be down this much", "score": 1, "replies": []}, {"body": "Just people selling calls", "score": 1, "replies": []}, {"body": "they're probably selling these puts as credit spreads", "score": 1, "replies": []}, {"body": "Those are sell to close. Will eat a hotdog if I’m wrong", "score": 1, "replies": []}, {"body": "I hope your right because im spooked for my 13 puts", "score": 1, "replies": [{"body": "13 puts? god dammmmmn - What is the time frame?", "score": 1, "replies": [{"body": "Doesnt really matter im going to the ferrari dealer now", "score": 2, "replies": []}]}]}]}
{"title": "What kind of stuff will we be eating during this recession?", "selftext": "[removed]", "id": "fg8mv3", "created_utc": 1583816364.0, "score": 28, "upvote_ratio": 0.82, "num_comments": 80, "comments": [{"body": "Dog food", "score": 48, "replies": [{"body": "I’m down.", "score": 9, "replies": []}, {"body": "Andrew Cunanan style", "score": 2, "replies": []}, {"body": "So calls on Taco Bell?", "score": 1, "replies": []}, {"body": "Pretty nutritious tbh, dogs aren't too different in their needs from humans", "score": 1, "replies": []}]}, {"body": "Tendies idiot.", "score": 28, "replies": [{"body": "Ranch or BBQ?", "score": 4, "replies": [{"body": "Honey mustard.", "score": 13, "replies": [{"body": "I see that you’re a man with a refined palette.", "score": 12, "replies": [{"body": "Gotta get the Ken’s steakhouse salad dressing kind.", "score": 1, "replies": []}]}]}]}]}, {"body": "I am farming house flies.", "score": 21, "replies": [{"body": "This the kind of innovative shit I was trying to learn here thx", "score": 14, "replies": [{"body": "In the future insects will be our main source of protein. Didn't you see Snowpiercer? Great movie.", "score": 8, "replies": [{"body": "I actually wanted to get involved in this industry at one point. I believe when people finally come around to consuming insect protein, those companies that produce cricket or larva meal will fucking blow up. BYND is overhyped and unhealthy. Insects are the future.", "score": 1, "replies": [{"body": "Who the fucks wants to eat bugs though? Tofu and protein powder is way better.", "score": 3, "replies": [{"body": "That’s what they said about sushiiiiiie!", "score": 2, "replies": [{"body": "Lol but half the people who “like” sushi eat California rolls.", "score": 4, "replies": [{"body": "Hey fuck you for being right.", "score": 1, "replies": []}]}]}, {"body": "People already eating bats and shit were already there!", "score": 2, "replies": []}, {"body": "Whey better", "score": 1, "replies": []}]}]}]}]}, {"body": "In Snow Piercer people ate cockroaches who were fed humans.", "score": 2, "replies": [{"body": "This guy gets it : https://youtu.be/0TptADISb2g?t=9", "score": 1, "replies": [{"body": "so 3.25$ to 11$ ... uhm, sounds like the perfect YOLO", "score": 2, "replies": [{"body": "this guy also claims they cure cancer, hepatitus B, and stomach infection... maybe also covid-19??? This was back in 2013 wonder where he is today.", "score": 1, "replies": [{"body": "probably trying to patent a vaccine and save the world", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Walmart will do well 3-9 months out. Always does good during recession. Has Warehouses of shit to sell while Amazon doesn't.", "score": 14, "replies": [{"body": "Z", "score": 3, "replies": [{"body": "Yeah I had a hard time believing that’s what he’s saying", "score": 2, "replies": []}, {"body": "they do but they are more China heavy and don't have as much shit hoarded and ready for sale.", "score": 1, "replies": []}]}]}, {"body": "I already eat like I'm poor, because I am poor.", "score": 13, "replies": []}, {"body": "Some ice with a side of water", "score": 10, "replies": []}, {"body": "Bat soup", "score": 8, "replies": [{"body": "Time is a flat circle.", "score": 3, "replies": [{"body": "Time in an abstract concept used by carbon based life forms to measure their ongoing decay.", "score": 2, "replies": []}]}]}, {"body": "Alexa, can u eat tree bark", "score": 5, "replies": []}, {"body": "I bought enough cans of soup for about a month, if it goes longer I could eat my neighbours. They are old and probably won’t put up much of a fight. Time will tell", "score": 6, "replies": [{"body": "What the actual fuck", "score": 3, "replies": [{"body": "Crunchy", "score": 1, "replies": []}]}]}, {"body": "Ramen", "score": 5, "replies": [{"body": "Chicken flavor, tho.", "score": 1, "replies": [{"body": "Maybe on Sunday", "score": 1, "replies": [{"body": "Closed on Sunday", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "Damn beat me to it", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Touché", "score": 2, "replies": []}]}]}, {"body": "My wife's boyfriend cums in her ass all the time. \n\nHahahaha you fucking cuck!", "score": 0, "replies": []}, {"body": "You’ll have some extra protein from eating her ass because I cum inside it after barebacking it.", "score": 0, "replies": []}]}, {"body": "Hopefully tendies", "score": 3, "replies": []}, {"body": "Pressure cooker - Bean, rice, protein", "score": 3, "replies": [{"body": "This is the way", "score": 1, "replies": [{"body": "That's what I'm doing!", "score": 1, "replies": []}]}]}, {"body": "Buy a whole prosciutto ham and a $150 meat slicer. You make up for the price of the slicer after one ham, which can last for 3-6 months just sitting on a shelf before you open it up. After that, it lasts about a month. The first half was amazing, the 3rd quarter was tiring, and by the last 1/4 I got so sick of eating prosciutto that I ended up freezing the last 3-4 lbs and using in stews months later (don't oversalt, damn prosciutto is salty). Finally, various SKF puts ITM for apr 17 is what I chose to stave off the coming winter blahs.", "score": 3, "replies": []}, {"body": "Steak and lobster queer", "score": 8, "replies": [{"body": "What is lobster queer?", "score": 6, "replies": [{"body": "its a millennial with noodle arms and hiv that likes to suck his boyfriends dads dick", "score": 1, "replies": [{"body": "And you eat that? Noodle arms. I like you. But if rather not be Friendly.", "score": 1, "replies": []}]}]}]}, {"body": "Ass and lots of it, tongue punchin fartboxes 3 times a day baby", "score": 2, "replies": []}, {"body": "Ants. Lots of em.", "score": 2, "replies": []}, {"body": "Eachother", "score": 2, "replies": []}, {"body": "Squirrel.... Numb nuts... Them mufuckas iz everywhere...", "score": 2, "replies": []}, {"body": "if youre white the answer is cheese", "score": 2, "replies": []}, {"body": "Looks like KY out of my wife's boyfriend's ass isn't the only jelly I'll be eating.\n\nLong $SJM, Uncrustables are CARONA PROOF, CANT CUCK THE SMUCK BABY 😩😩", "score": 2, "replies": []}, {"body": "Anal beads", "score": 1, "replies": []}, {"body": "There will be no recession", "score": 1, "replies": []}, {"body": "Don’t worry about your mom, I’ll make sure she swallows so she’ll have some protein...joking aside, probably ramen, pasta, rice, beans, eggs. Simple stuff really. If I lose my job because of a recession I might just end it tbh.", "score": 1, "replies": []}, {"body": "Soylent. It’s on 10% off right now and includes the vitamin H2O as well!!", "score": 1, "replies": []}, {"body": "Welcome to Ramenistan", "score": 1, "replies": []}, {"body": "Boomer glutes.", "score": 1, "replies": []}, {"body": "the peanuts off of Halle Beerys turds", "score": 1, "replies": []}, {"body": "I’ll be eating a bullet", "score": 1, "replies": []}, {"body": "McDonald’s I’ll have the free peanuts and I think they have $1 ice cream soon so we will be good", "score": 1, "replies": []}, {"body": "If you bought puts, then ass.", "score": 1, "replies": []}, {"body": "Ranch Beans for Gay Bears", "score": 1, "replies": []}, {"body": "Mcdoubles", "score": 1, "replies": []}, {"body": "Ass", "score": 1, "replies": []}, {"body": "Bears will eat good bulls will eat shit.", "score": 1, "replies": []}, {"body": "Tendies tendies and more tendies", "score": 1, "replies": []}]}
