{"title": "Is Cash Really King At This Time?", "selftext": "For those with cash sitting in the bank and like to play it safe. The purpose is not profit but rather to preserve value through this time of uncertainty, so 12-14 months maybe?\n\nIs gold, physical or not, a safe bet?  \nI saw it fall when the Dow fell due to selling to cover losses, then rise again after the 50 point interest cut.", "id": "fff83g", "created_utc": 1583686343.0, "score": 86, "upvote_ratio": 0.92, "num_comments": 77, "comments": [{"body": "[deleted]", "score": 108, "replies": [{"body": "This. You can’t time the bottom but if you’re able to buy on the way to the bottom 💰💰", "score": 8, "replies": []}, {"body": "until cash gives you covid19", "score": 3, "replies": []}, {"body": "King has cashflow", "score": 1, "replies": []}]}, {"body": "Yes, I need cash in order to invest. 😂", "score": 66, "replies": [{"body": "Hahahha", "score": 3, "replies": []}]}, {"body": "I’ve hedged my stock portfolio with enough TVIX that if the market goes down, then the TVIX I have should go up enough to offset my losses.", "score": 24, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "TVIX (like some other ETFs) constantly lose value if held long term. They are primarily meant to be traded short term. A little gets sucked out of the fund each day so their value constantly decreases, causing them to eventually do a reverse split and repeat the game. \n\nBasically don't hold this stuff for long term. They lose value over time.", "score": 21, "replies": []}, {"body": "Nothing. That’s the result of yahoo finance accounting for TVIX’s reverse stock splits that they had to do to keep the price from going to 0.", "score": 19, "replies": []}]}, {"body": "Yup i had triggers setup so when my TNA crashed it sold and for the same amount bought TVIX. TNA lees dropping so I will probably start adding again soon since it is much cheaper than what I sold. \n\nOther than that I have a reverse strat going for when the market starts taking off again.", "score": 4, "replies": [{"body": "You look smart today. ;)", "score": 1, "replies": [{"body": "Still in the red, but at least I’m up over 100% today alone on my bear stocks.", "score": 2, "replies": []}]}]}, {"body": "For this to work you’d have to sell, no? Otherwise it will your balance your account when we go back up.", "score": 2, "replies": [{"body": "Yep. If things start calming down I’ll sell the TVIX and UVXY.\n\nEdit:UVXY", "score": 1, "replies": []}]}]}, {"body": "I'm taking the losses with pleasure because then I can go shopping for cheap stocks and capture the upside that will come when this is over.", "score": 29, "replies": [{"body": "When do you suspect this will “be over” and you’ll be able to go shopping?", "score": 3, "replies": [{"body": "It's over when it's over. Whether that's tomorrow, next month, 3 months or a year from now, it'll end sometime.", "score": 17, "replies": [{"body": "Great mindset.", "score": 4, "replies": [{"body": "Appreciate it :)", "score": 3, "replies": [{"body": "I mean it will end eventually he isn’t wrong lol", "score": 2, "replies": []}]}]}]}]}, {"body": "Unless it down 40%, you will be panic. In long terme view, you lost years of investment and we both know, we don't live forever.", "score": 2, "replies": [{"body": "I'm in my mid teens. I got plenty of time to live. There is no reason to panic over losses, when markets always go back up. Plus, I'm still making money from dividend payments, so it's not like it's the end of the world", "score": 2, "replies": []}]}]}, {"body": "I think with preservation in mind, yes cash is King.\n\nThere are just too many variables in play right now. The movement in stocks is obvious. But also consider the fed's involvement and the things that can be affected by that. Just look at this last Friday's market movement the s&p was down over 3.5% percent and in the last half hour closed down just 1.7%. \n\nWith all that said I hope that the other part of your money you are taking advantage of this volatility!", "score": 12, "replies": [{"body": "Rumors are that the reason it rallied so hard at EOD is because a market maker blew up their account. They were lacking enough volatility hedge, and as the market dropped, they had to buy more volatility / VIX, which of course led to the market dropping more, until finally the MM blew up their account and had all their positions liquidated.", "score": 11, "replies": [{"body": "What does blowing up an account mean? Margin call?", "score": 4, "replies": [{"body": "Yeah.  So they couldnt purchase enough VIX hedges with the market about to break through support. They got margin called. All their vix longs were liquidated (thus driving VIX down). I assume their other positions were short (if someone buys a put from you, you short the stock. This way if you are forced to buy it back when the put expires, your purchase and the short will cancel out the forced purchase).  So after their VIX position was liquidated, their shorts were covered. The combination of this huge short covering and crushed VIX drove the market up at EOD.", "score": 7, "replies": [{"body": "There's no individual market maker driving the entire DOW up nearly 2% in thirty minutes.", "score": 5, "replies": []}, {"body": "The VIX seems like a really fucky instrument when I read stuff like this.", "score": 1, "replies": []}]}]}, {"body": "That would be crazy to move the market like that... So where do you hear this stuff, seriously? I would love to find alternate sources of news, this is something you don't read on the mainstream media as far as I know.", "score": 1, "replies": [{"body": "This was a zerohedge article. They're often full of shit, with an overly pessimistic view on the market, world affairs, etc. They're often cited as a possible Russian propaganda outlet, always seeming to back up Russia's point of view on world events. \n\nHowever, the owners have built a following in the financial services industry and so often get legitimate tips from people in those circles. That's why I indicated this is a rumor.", "score": 3, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}]}]}]}, {"body": "I’m opting real estate.  These rates are nuts.", "score": 39, "replies": [{"body": "As people buy houses based on the mortgage payments they can afford, low rates mean high house prices.", "score": 13, "replies": [{"body": "Exactly.\n\nTake advantage of the rate on a place, get a good deal, park money in equity.   If you’re lucky, have yourself ready to snag a foreclosure and rent it out.", "score": 9, "replies": []}, {"body": "Given interest rates are already lower though, the higher prices are already here. So you have to believe the rates are going down even more.", "score": 4, "replies": []}, {"body": "Already SKY HIGH out here in SoCal.", "score": 1, "replies": []}]}, {"body": "This is one dimensional thinking. \n\nCurrent thesis: The world is at a standstill, debt is at an all time high and defaults are expected and job losses of b2c are also on the way.\n\nLeveraged assets with this fragile of a global economic downturn seems unwise with the house of cards we are playing with.", "score": 23, "replies": [{"body": "If I weren’t putting a fuckton down, fundamentally deleveraging it, you’d be right.", "score": 6, "replies": []}]}, {"body": "Until quarantines interrupt work, which interrupts mortgage payments", "score": 6, "replies": [{"body": "I don’t know many who work in a different metropolitan area that than where they live.", "score": 1, "replies": [{"body": "The widgets they work with may come from or go to another metro. If the market is cut off the work is cut off.", "score": 1, "replies": []}]}, {"body": "Which means we get to buy some sweet real estate at cheap prices, at least if we work in careers not subject to market performance (i.e. keep our jobs).", "score": 1, "replies": []}]}, {"body": "Mixed feelings. These rates are nuts, but they are also driving the prices higher.\n\nA 6% $180k house and a 4% $250k house might have the same monthly payment and the same profit margin, but isn’t any better.\n\nThe people really winning are people who already bought and can refinance to the lower rates.  The lower rates are going to push up the cost of acquiring houses now.", "score": 5, "replies": []}, {"body": "Thanks and just to let you know I did not downvovte your advice. For those who did, I would have much appreciated a counterargument.   \n\n\nReal estate-wise, some are saying this is just the beginning and rates will go even lower.", "score": 14, "replies": [{"body": "It’s a pretty popular idea that you get a larger mortgage with more in the markets since you can get a greater return there than you can on your house, especially with rates where they are.\n\nIt’s got some caveats, though...I happen to be in an area where house prices don’t really tank, I’m getting a great deal on the house, and the current market is a bit of an anomaly where treasuries have a real return in the negatives.\n\nI’m angling for capital preservation with the option to pull cash out of the  house at a later date if/when things turn around....and if they *dont* turn around, I’m putting so much down that I won’t be ultimately paying 2-3 times the house price...nor will I suffer terribly due to a job loss.\n\nIt’s normally a very expensive lesson, but I’m talking about the difference between a 60% down payment and an 80% down...leaving me a solid six figures that I can make work for me in the meantime.\n\nI’m also talking about a house with a guest house that has its own garage that can be rented out for a little more passive income to augment two other modest sources of passive income.\n\n**So...the question was *preservation*.  Not *growth*.  My *growth* investments are elsewhere.**", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "Doubt it.\n\nOld people live with family, at assisted living, in smaller condos after downsizing, and in rentals they don’t have to maintain themselves. The only time they’re in a house is when there’s two of them and they’re relatively healthy.\n\nThat’s who I’m buying from *now*.", "score": 5, "replies": []}]}, {"body": "hopefully we see lower real estate prices as the economy slows down. cash should be ready to buy something attractive.", "score": 1, "replies": []}]}, {"body": "I heard gold is going to 0", "score": 4, "replies": [{"body": "What!", "score": 1, "replies": []}]}, {"body": "Diversity with a little Bitcoin.", "score": 12, "replies": []}, {"body": "Short positions are king", "score": 4, "replies": []}, {"body": "Anyone got bitcoin for cash Indiana area", "score": 2, "replies": []}, {"body": "\"cash is trash\" - Ray Dalio", "score": 2, "replies": []}, {"body": "puts are king", "score": 2, "replies": []}, {"body": "I used to love gold. Then realized it was just sitting there, 20/40% down from ATH while Target, Coca Cola and MMM been growing their dividend for 50+ years.\n\nGold is fun, gold is a terrible investment... the scenario people have that we’ll use it to barter is bs...", "score": 2, "replies": [{"body": "Gold is not an investment, Gold is an insurance. -Warren Buffett", "score": 1, "replies": [{"body": "But has it in recent times?", "score": 1, "replies": []}]}]}, {"body": "Yes. freshly pressed, read: Stock Market Futures Point to One of the Worst Opening [https://cannabis-investment-group.com/2020/03/08/stock-market-futures-point-to-one-of-the-worst-opening/](https://cannabis-investment-group.com/2020/03/08/stock-market-futures-point-to-one-of-the-worst-opening/)", "score": 2, "replies": []}, {"body": "I'm going to invest in pharma stocks. It seems obvious to me. Millions will die and market will crash, but pharma stocks will likely rise.", "score": 2, "replies": [{"body": "I own a company called Service Corp International - Ticker SCI.  It owns 15% of the US death care industry.  Only off about 2-3% from all time highs.", "score": 2, "replies": []}]}, {"body": "Why not just invest in a properly diversified portfolio that produces decent returns no matter the economic climate? (http://www.lazyportfolioetf.com/allocation/ray-dalio-all-weather/)", "score": 2, "replies": [{"body": "Thanks, that's something I can understand.", "score": 1, "replies": []}]}, {"body": "in this market losing zero percent for your average investor is doing pretty good.", "score": 2, "replies": [{"body": "That's not good news.", "score": 1, "replies": []}]}, {"body": "Cash is always king, until bitcoin takes over", "score": 5, "replies": [{"body": "lol this is what my brother said when I was telling him to sell his bitcoin holdings when it was at $19k a coin.", "score": 6, "replies": []}]}, {"body": "19 year old investor here. I made a trade on AXSM therapeutics and gained around 17 k. I have that diversified in multiple companies  for a very long position 48 -82 months and am currently working 2 jobs to gain cash capital for short term trading. Just telling you my strategy in these uncertain times.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "This translates into movie-level chaos.", "score": 1, "replies": []}]}, {"body": "Cash is king.  If you have cash you can invest in bargain stocks.  If you have cash you're not forced to sell assets to pay unexpected expenses.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "> are there many reasons to be long here?\n\nI didn't understand that.", "score": 1, "replies": []}]}, {"body": "If you sit on cash thinking you're safe right now then you will miss out on the rise in the market as it happens. Keep investing in fundamentally sound stocks if you're here to grow your wealth\n\n\n. If you want to feel good then pay off your 4% debts and miss out on the 7%+ stock market growth+dividends. Do what you think is right.", "score": 1, "replies": [{"body": "I'll preface this by saying nobody really knows. I've been saying for months we are due for 10% loss and we got it. That says we're due for standard gains. However, people are freaking the fuck out man. Everyone. And it hasn't maxed out yet or really hit the real economy. I now think it's quite possible we see another 40% loss and at least 10% this week. So miss out on potential 7% gains but also miss out on potential 40% loss. You're pick. Nice name.", "score": 3, "replies": [{"body": "All will be well. \n\nNice name too, friend.", "score": 1, "replies": []}]}]}, {"body": "Canned dog food, shoot gun shells, and guzzolene will be king. One man enter, one man leave.! You should always have some emergency cash on hand and make sure before you start liquidating your positions you understand the tax ramifications.", "score": -6, "replies": [{"body": "Thanks and just to let you know I did not downvovte your advice. For those who did, I would have much appreciated a counterargument.", "score": -2, "replies": [{"body": ">For those who did, I would have much appreciated a counterargument.\n\nHe's an idiot.", "score": 8, "replies": [{"body": "So what's the right answer?", "score": 2, "replies": [{"body": "You don't need to go so far as to kill somebody to survive this virus. That's way too far, and frankly unnecessary. We're not gonna turn into zombies. And as for liquidating positions, those trigger tax ramifications.", "score": 3, "replies": []}]}]}]}]}]}
{"title": "Oil is going to crash", "selftext": "Saudis Plan Big Oil Output Hike, Beginning All-Out Price War  \n\nhttps://www.bloomberg.com/news/articles/2020-03-07/saudis-plan-big-oil-output-hike-beginning-all-out-price-war\n\nTLDR: Buy COP 3/20 $44 puts", "id": "ff4t2l", "created_utc": 1583629201.0, "score": 55, "upvote_ratio": 0.85, "num_comments": 82, "comments": [{"body": "The problem is it might go into freefall before we can get our puts Monday morning😡", "score": 60, "replies": [{"body": "Damn, what a tragedy. Oh well, let's see about profiting off of the death and suffering of Coronavirus.", "score": 36, "replies": [{"body": "If we don't do it who will🤷", "score": 32, "replies": [{"body": "Somebody's gotta!", "score": 6, "replies": []}]}, {"body": "Profits don't cause corona virus deaths. Not the same as selling guns to kids in Africa.", "score": 9, "replies": [{"body": "Na it's like betting that the guns that guy sold will kill some kids.", "score": 3, "replies": [{"body": "Right, not contributing to the problem, just a morbid thing to do. Not really problematic morally, just socially.", "score": 4, "replies": [{"body": "Unless you exclusively socialize with other degenerates. Then you're good.", "score": 3, "replies": []}]}]}]}, {"body": "Me making money off this isn’t gonna change anything. It sucks that it’s happening but I don’t see the issue with making bank off of hoping some shitty hotel companies tank.", "score": 5, "replies": []}, {"body": "At least we are converting our gains into, Tendies for Tots.", "score": 3, "replies": [{"body": "Yeah that's pretty cute", "score": 0, "replies": []}]}, {"body": "Hehehe", "score": 0, "replies": []}]}, {"body": "Especially after robinhood crashes again", "score": 3, "replies": []}, {"body": "Might?", "score": 3, "replies": []}, {"body": "It wont freefall yet....it all depends on the weekly inventory reports...in 2 to 3 weeks or so, when there is a large inventory build, then it will drop", "score": 1, "replies": [{"body": "They're literally already selling oil for a lower price.", "score": 2, "replies": [{"body": "Some predict oil's gap to be wider than OPs mom's teeth", "score": 1, "replies": []}]}]}]}, {"body": "COP = cost of petroleum?", "score": 14, "replies": [{"body": "Could also buy puts on USO if you just want to bet against oil price", "score": 7, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "💎✋🏻", "score": 1, "replies": []}, {"body": "I have puts ordered up for MRO monday. Let's hope it clears, theyll print.", "score": 1, "replies": []}]}, {"body": "I’m in", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "Hang on to your butt!", "score": 7, "replies": []}, {"body": "And i thought I was ballin with 1000 and 25000 of wtid", "score": 2, "replies": []}]}, {"body": "Any experienced oil traders here?", "score": 11, "replies": [{"body": "I buy gas for my car, does that count?", "score": 55, "replies": [{"body": "Yup", "score": 4, "replies": [{"body": "No you dumb elf oil is a water and gas is air.", "score": 3, "replies": []}]}]}, {"body": "Nope, I’m too retarded", "score": 16, "replies": [{"body": "You're hired", "score": 15, "replies": [{"body": "Perfect! I need a new job anyway", "score": 6, "replies": []}]}]}, {"body": "Oil usually makes long bull runs up, or long down.  I don’t think the bottom is done yet, maybe $35. but then when the virus dies off, OPEC and Russia reach an agreement in April and China is back online, it’ll spike hard back up to $50+\n\nI like EXXON here!", "score": 10, "replies": []}, {"body": "Define “experienced”", "score": 3, "replies": []}, {"body": "If you only count this year, I’m a genius.", "score": 3, "replies": []}, {"body": "See this other thread here: https://www.reddit.com/r/wallstreetbets/comments/ff1zjn/heres_some_actual_dd_for_you_idiots/\n\nEssential reading", "score": 0, "replies": []}]}, {"body": "Honestly puts on US shale companies are gonna print. Look for the ones with the highest cost basis and lowest credit rating.", "score": 9, "replies": [{"body": "Which ones we talkin", "score": 6, "replies": [{"body": "CHK.", "score": 3, "replies": [{"body": "Already priced for bankruptcy", "score": 1, "replies": [{"body": "Buy $-5 puts", "score": 3, "replies": []}]}]}]}, {"body": "Totally agree. Some of the lower quality shale players are already near death and may not fall much more", "score": 2, "replies": []}]}, {"body": "So puts on Halliburton? Been fucking waiting for this day.", "score": 4, "replies": [{"body": "Should have bought puts on them awhile ago. They down to 13$ now but I won’t be surprised if single digits by next week. Then Halliburton Schaumburg merger", "score": 5, "replies": []}]}, {"body": "All the most junior engineers are getting cut last 2 weeks.", "score": 13, "replies": [{"body": "Damn. You work in the industry?", "score": 8, "replies": [{"body": "Few friends have already been fired. Most I know are pretty sure they're on the block", "score": 6, "replies": [{"body": "Sounds like HAL and SLB", "score": 1, "replies": []}]}, {"body": "I do and this is bullshit. Saudi can’t afford to do this. Their economy is all oil AND Saudi Aramco just launched their IPO... if they did this they would crash their own stock.", "score": 6, "replies": [{"body": "They know Russia can’t last long at this price either.", "score": 11, "replies": [{"body": "Definitely SA is in a better position to ride this out.", "score": 7, "replies": [{"body": "SA already tries this with the US... and guess what, now we are a booming oil exporter. We serviced the last one and if they tried again they know the US would be the only ones standing", "score": 4, "replies": [{"body": "US cost of production is so high the Saudi's can keep it below that indefinitely if they want to. \n\nIts going to be a bloodbath in US oil", "score": 4, "replies": []}]}]}, {"body": "russia can cause their costs is at 38$", "score": 2, "replies": []}, {"body": "Hurting yourself to hurt someone bigger than you is a dumb way to get attention.", "score": 2, "replies": []}]}]}]}]}, {"body": "DTO", "score": 5, "replies": []}, {"body": "Oil is fuk", "score": 4, "replies": [{"body": "Master Elon don’t need no oil anymore", "score": 2, "replies": []}]}, {"body": "Bloomberg has to charge for free news to make back the $500MM from his Prez  run", "score": 6, "replies": [{"body": "That's an insane amount of money. He wasn't even close to winning.\n\nI am wondering if he is doing that to run again and build name recognition, but he should already be well known.", "score": 3, "replies": [{"body": "I actually think it was even higher. I couldn’t believe he dropped out the day after he said “I’m in it to win it”", "score": 4, "replies": [{"body": "IIRC, the number was closer to $600 mil...", "score": 2, "replies": []}]}, {"body": "To think that's only 0.8% of his net worth...", "score": 1, "replies": [{"body": "Literally all in a day’s work for him.", "score": 3, "replies": []}]}]}]}, {"body": "Lmao quite a prediction holmes.", "score": 2, "replies": []}, {"body": "I hope so. \nI have Chevron 3/20 $80 puts.", "score": 2, "replies": []}, {"body": "Seems like good news for my 3/20 $42 exxon put?", "score": 1, "replies": []}, {"body": "Calls for sure then", "score": 1, "replies": []}, {"body": "https://imgur.com/a/E99uXhZ", "score": 1, "replies": []}, {"body": "BULL SHIT. I work in this industry and know this is not going to happen. Plus Saudi Aramco just had their IPO... if they did this they would crash their own stock.", "score": 0, "replies": [{"body": "Do you work at a gas station? Lol why did I fill up for 1.96 a gallon if opec isn’t cutting prices...", "score": 13, "replies": [{"body": "Lol it takes like a month for your gas prices to change", "score": 1, "replies": []}, {"body": "Learn about futures contracts mike", "score": 1, "replies": []}]}, {"body": "They don’t care about the stock. They had to lock all the rich people in the Ritz Carlton and wouldn’t let them leave until they agreed to buy the IPO", "score": 9, "replies": [{"body": "I think I saw that on Succession.", "score": 5, "replies": []}]}, {"body": "I'm skeptical too. But Saudi Prince is pissed that Russia won't cut, they could be sending a message that peeps need to play ball. We'll see come Monday.", "score": 1, "replies": []}, {"body": "Less than 5% of their stock is in the market. It doesn’t matter.", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "ffgczu", "created_utc": 1583690895.0, "score": 87, "upvote_ratio": 0.91, "num_comments": 78, "comments": [{"body": "Link: ☑️\nTable:☑️\n🌈🐻:☑️\n\nYou son of a bitch, I’m in.", "score": 91, "replies": [{"body": "This is the way", "score": 16, "replies": []}]}, {"body": "My $SPY puts hope you're correct.", "score": 38, "replies": [{"body": "And my spy puts", "score": 19, "replies": [{"body": "and my Axe!", "score": 9, "replies": [{"body": "And my bow!", "score": 3, "replies": [{"body": "And my axe!", "score": 2, "replies": []}]}]}]}, {"body": "My SPY puts have me actually looking forward to a Monday morning 🙏 💎", "score": 11, "replies": [{"body": "Sp 500 futures down 4%. Prepare for tendies\n\nEdit: Futures hit -5%. You are going to be a rich man", "score": 5, "replies": [{"body": "[_excellent_](https://i.pinimg.com/originals/4e/6c/14/4e6c14cb945754074a58efef007d9bad.jpg)", "score": 2, "replies": []}]}, {"body": "Right?", "score": 2, "replies": []}]}]}, {"body": "What positions lol i need to pay rent next week", "score": 30, "replies": [{"body": "I'm holding/buying $SQQQ and $SH  and puts on $F, $TA, and $FCAU. It's a cheaper game then the spy puts and is basically betting on Armageddon", "score": 11, "replies": [{"body": "Thanks!", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "F 3/13 $7 put\nF 3/13 $6.5 put\nF 1/22/22 $7 call (Free 💰 it will go up)\nFCAU 4/17 $10 put\nBunch of $SH, $SQQQ, and $UVXY which have been funding my stupid bets on Bio tech stocks with mixed results", "score": 3, "replies": [{"body": "When did you buy your 3/13 puts? Also, what's your game plan on the 1/22 call? Just wait for volatility and sell?", "score": 1, "replies": [{"body": "I bought them a month ago, before the dip. the lonnnng calls -yes hold and try to time it", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You retards are missing the fucking point. A drop in oil price will destroy 40 percent of all junk bonds in the US. ( shale is approximately 40 percent of junk bonds in the US, a collapse of oil price will bankrupt them)", "score": 63, "replies": [{"body": "We all saw the point:\n\n> 🌈 🐻", "score": 9, "replies": [{"body": "Highly doubt that. Most of these post are post asking for direction or un detailed trade info.", "score": 2, "replies": [{"body": "shell is a company that tries to make money form oil. The amount of money people want to give for oil is lowering as OP discussed.\nTherefore:\n\nputs on shell, march 20, (€18 or €17). \n\nMarch 20 cause this maybe a short term thing. Don't know how deep this goes, shell already dropped much in the last couple of weeks. (they're part of index funds).", "score": 2, "replies": []}]}]}, {"body": "HYG JNK SHYG", "score": 16, "replies": [{"body": "Puts on JNK, got it.", "score": 4, "replies": []}, {"body": "RemindMe! 7 Days", "score": 3, "replies": [{"body": "I will be messaging you in 7 days on [**2020-03-15 18:28:30 UTC**](http://www.wolframalpha.com/input/?i=2020-03-15%2018:28:30%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/ffgczu/red_monday_dd/fjy8w2f/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fffgczu%2Fred_monday_dd%2Ffjy8w2f%2F%5D%0A%0ARemindMe%21%202020-03-15%2018%3A28%3A30%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ffgczu)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Hell yes to those PDFs please", "score": 3, "replies": []}]}]}, {"body": "Good thing I went with the gubmint bond indexes when I rejiggered my 401k and IRA accounts last week. Junk just looked too volatile after looking at the major holdings.", "score": 7, "replies": []}, {"body": "So what happens when junk bonds crash?  Will it cause a credit crunch?", "score": 8, "replies": [{"body": "Research that and get back to me", "score": 6, "replies": [{"body": "This person seems to think so: http://archive.is/ZZii4", "score": 3, "replies": []}]}]}, {"body": "where are you getting the 40% from?", "score": 3, "replies": [{"body": "From the brochure at the holiday in express.... I do this for a living.", "score": 3, "replies": [{"body": "Distribute brochures? I used to do that on college campuses.", "score": 4, "replies": []}]}]}, {"body": "Good thing I sold all by JNK", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "40 percent, look it up my scientist.", "score": 2, "replies": []}]}, {"body": "Buy the dip!", "score": 3, "replies": [{"body": "Ok retard do it, I need someone on the other side of my trade.", "score": 5, "replies": [{"body": "Hell no! I don't want your dirty contracts.", "score": 4, "replies": []}]}]}, {"body": "The US is totally dependent on shale now.  These companies will find a way to get funding to weather the storm.  Same thing happened years ago when OPEC ran the price down to the 30s trying to put shale producers out of business.  Didn't work.\n\nTL/DR The Fed will backstop shale producers if necessary.", "score": 2, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "only two places that can profit really are aramco and resnoft. Aramco can pull out barrels under 3 dollars. but if they are seen profiting maybe iran might bomb them again", "score": 3, "replies": [{"body": "Aramco will be like JFK.\n\nNobody  will know who wiped the refinery out and nobody will ask.", "score": 2, "replies": []}]}, {"body": "&#x200B;\n\nTariffs baby, Tariffs.\n\n&#x200B;\n\nTake the ride.", "score": 2, "replies": []}]}]}, {"body": "Not my problem, am I right?", "score": 1, "replies": []}]}, {"body": "THE MARKET CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT", "score": 27, "replies": [{"body": "so trade fds whats your point", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "Thatd be nice, im tired of going to pump gas and getting my ass pumped too.", "score": 28, "replies": []}, {"body": "Lmao here in Wisconsin it’s already $2 per gallon.\n\nRoads are fucking shit tho", "score": 3, "replies": [{"body": "1.90 in Louisiana.  Please 1.25 gas.", "score": 5, "replies": []}]}, {"body": "I’m getting near that at ARCO.  Saw 3.09 today", "score": 1, "replies": []}, {"body": "Already sub $3 in the valley", "score": 1, "replies": []}, {"body": "Usually takes about a month for it to trickle through", "score": 1, "replies": []}, {"body": "Tesla  :)", "score": 1, "replies": [{"body": "You’re about to regret it at this rate of oil dropping", "score": 3, "replies": []}]}]}, {"body": "Ehh idk if it's safe to buy oil puts at often after premarket", "score": 13, "replies": []}, {"body": "It turns out that 366 have died from the virus in Italy. Seems like virus strain in Italy is the deadliest.", "score": 9, "replies": [{"body": "COVID-19 officially fueled by spaghet and pizza", "score": 3, "replies": []}]}, {"body": "Remember when everyone said it would be red last Monday. Yea how’d that go. I’m out. Waiting for another bounce to get more puts", "score": 20, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "UFFF my puts on oil etfs gonna moon\n\nway better than puts on spy the fed cant pump it", "score": 9, "replies": []}, {"body": "Lower oil prices could be seen as stimulating to the global economy though, since oil is an input to production. Market could definitely open green.", "score": 1, "replies": [{"body": "No one wants to go anywhere. People are everywhere. Those people might have Corona virus", "score": 1, "replies": []}]}]}, {"body": "I bought on Monday and sold for profit on Friday", "score": 3, "replies": []}]}, {"body": "Got puts on spy and /cl at 30 strike April 20th cheap!", "score": 3, "replies": []}, {"body": "Nice", "score": 2, "replies": []}, {"body": "BTFD on oil stocks after the initial selloff. Russia and OPEC will come to an agreement and shit will rip!", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Wonder if Putin will come out and agree to opec, or negotiate something before the open tomorrow... it looks like he has them over a barrel atm.\n\nHe at least has had a big say in the global economic swing of things these past two weeks", "score": 1, "replies": [{"body": "Russia can produce cheap oil", "score": 2, "replies": []}, {"body": "I thought it was the opposite, Saudi has thrown down the gauntlet, and Russia is in the shitter if they don't come to some kind of agreement.", "score": 1, "replies": []}, {"body": "He has three weeks if the Aramco pricing is for April not immediate.", "score": 1, "replies": []}]}, {"body": "I see put, I upvote.", "score": 1, "replies": []}, {"body": "Nice", "score": 1, "replies": []}, {"body": "So is Gold going down the well now?\n\n&#x200B;\n\n(Asking for a friend)", "score": 0, "replies": []}, {"body": "Definitely getting some Exxon puts tomorrow", "score": -1, "replies": []}]}
