{"title": "WAFFLE HOUSE CLOSES 365 LOCATIONS DRILL TEAM 6 ASSEMBLE", "selftext": "[deleted]", "id": "fokd6w", "created_utc": 1585111611.0, "score": 608, "upvote_ratio": 0.97, "num_comments": 71, "comments": [{"body": "[deleted]", "score": 291, "replies": [{"body": "Reporting for duty sir.", "score": 67, "replies": [{"body": "This is my rifle, this is my gun...", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 32, "replies": [{"body": "And my penis.", "score": 20, "replies": [{"body": "And my ass", "score": 17, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "And my girlfriends boyfriends penis", "score": 12, "replies": [{"body": "And my mangina", "score": 5, "replies": []}]}]}]}]}]}, {"body": "I'm here for the beargang.", "score": 9, "replies": []}, {"body": "Don't lie. You're at most Drill Team 4.", "score": 3, "replies": []}, {"body": "present", "score": 1, "replies": []}, {"body": "Is she a MILF", "score": 0, "replies": [{"body": "Does she have a vagina.....that’s all I need.", "score": 1, "replies": []}]}]}, {"body": "Dude this is SPY 150p level news.\n\nIf Cookout closes, sell everything and buy assault rifles and ammo.", "score": 106, "replies": [{"body": "Cookout can't close, WTF am I going to eat?", "score": 26, "replies": [{"body": "Is Cookout comparable to In-n-Out?", "score": 2, "replies": [{"body": "Cookout is gooder than hell", "score": 8, "replies": []}, {"body": "Do highschool kids hang out in the parking lot on friday nights in there trucks that daddy bought?\n\n&#x200B;\n\nif so, yes.", "score": 15, "replies": []}, {"body": "Nah, In-n-Out is better, but Cookout is the best we have in the SouthEast.  Actually, the only positive for the 7 years I spent in Cali was In-n-Out.", "score": 4, "replies": []}]}]}, {"body": "All Puts are half off after Tuesday pump \n\nSPY 195 P Apr 17", "score": 4, "replies": []}, {"body": "We are past buying assault rifles.  If you wait until you think you need to buy one to buy one, they are going to be sold out.", "score": 1, "replies": []}, {"body": "They never ever close, even during hurricanes.  Just like Disney never does either.", "score": 1, "replies": []}]}, {"body": "Yes! Waffle House Threat Index is real\n\n[https://en.wikipedia.org/wiki/Waffle\\_House\\_Index](https://en.wikipedia.org/wiki/Waffle_House_Index)", "score": 48, "replies": [{"body": "**Waffle House Index**\n\nThe Waffle House Index is an informal metric named after the Waffle House restaurant chain and is used by the Federal Emergency Management Agency (FEMA) to determine the effect of a storm and the likely scale of assistance required for disaster recovery.\n\nIf you get there and the Waffle House is closed? That's really bad... \n\nThe measure is based on the reputation of Waffle House for having good disaster preparedness and staying open during extreme weather, or reopening quickly afterwards.\n\n***\n\n^([ )[^(PM)](https://www.reddit.com/message/compose?to=kittens_from_space)^( | )[^(Exclude me)](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme)^( | )[^(Exclude from subreddit)](https://np.reddit.com/r/wallstreetbets/about/banned)^( | )[^(FAQ / Information)](https://np.reddit.com/r/WikiTextBot/wiki/index)^( | )[^(Source)](https://github.com/kittenswolf/WikiTextBot)^( ] Downvote to remove | v0.28)", "score": 28, "replies": [{"body": "So Waffle House purposely closes so they can get Bailout money", "score": 15, "replies": []}]}]}, {"body": "NOW we’re fucked. Even the bulls recognize", "score": 42, "replies": [{"body": "There's a difference between a hurricane and a virus...", "score": 3, "replies": []}]}, {"body": "If spy closes below 200 EOW I'll fuck my wife.", "score": 38, "replies": [{"body": "I'll fuck your wife too", "score": 13, "replies": [{"body": "@Mods\n\n/u/NSA_Official_Account", "score": 5, "replies": []}]}, {"body": "Is she hot?", "score": 3, "replies": []}, {"body": "/u/NSA_Official_Account", "score": 3, "replies": []}]}, {"body": "Dan Brown’s next novel, *The Waffle House Covenant,* will lay bare some of the occult roots of this waffle-finance-illuminati conspiracy.", "score": 25, "replies": []}, {"body": "So not only is a recession coming but we may have so little support from the private sector that conditions will be worse than in a natural disaster. That's fun.", "score": 14, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Lucky for him he's too incompetent to fully understand the situation.", "score": 8, "replies": [{"body": "It’s going to be great.  Some people are saying it’s going to be the greatest.  Very smart—very—genius people—good genes—my uncle was one of them you know.  And we’re sending that ship.  That big beautiful white ship.  It’s a tremendous ship.  With tremendous people. We’re going to fix it.", "score": 12, "replies": [{"body": "Trump says a lot of nothing (a lot like this forum) but what he says has a lot of impact to dumb people... saying words like Great, very good, excellent, very smart... etc.. \n\nDumb people eat this shit up.. and he’s confident even when an intelligent individual raises an issue or tries to trap him Trump throws his question out like a tissue.", "score": 10, "replies": []}, {"body": "My grandpa squandered a two million dollar bankroll on bad real estate investments and travel in the eighties. He had bipolar disorder so bad he thought he was still riding high even when it all dried up. He talked just like Trump every day.", "score": 3, "replies": []}]}, {"body": "Lol you will never accomplish 1% of what trump has jackass.", "score": -3, "replies": [{"body": "You don't know Trump there Sonny. I been alive more than a minute. You tell me where I can buy one of those juicy \"Trump steaks\".\n\nAlso tell me how many other \"billionaires\" you see making clowns of themselves on reality television talking about their ratings. You been conned the whole way. LoL", "score": 7, "replies": []}]}]}, {"body": "Big water, big ocean water, they say its the biggest folks.", "score": 3, "replies": []}]}]}, {"body": "Shit got real", "score": 13, "replies": [{"body": "Whatever helps my puts", "score": 6, "replies": []}]}, {"body": "But those beautiful PACKED churches on Easter morning.", "score": 22, "replies": [{"body": "🥇", "score": 2, "replies": []}]}, {"body": "Bitch this was posted a zillion times", "score": 27, "replies": []}, {"body": "Smothered covered and chunked bitch", "score": 6, "replies": []}, {"body": "From the same article:\n\nA FOIA request response in 2017 included emails saying that the Waffle House Index was a personal project of Craig Fugate, denying a connection between the Waffle House Index and FEMA's National Business Emergency Operations Center.", "score": 9, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "We just hit rock bottom", "score": 3, "replies": [{"body": "Wait til the job loss in the millions and hospitals collapsing all over America from full ICU beds.  Thanks to spring breakers.", "score": 1, "replies": []}]}, {"body": "SIR YES SIR! READY FOR DRILLING SIR!", "score": 3, "replies": []}, {"body": "I am actually terrified to hear this, we went to Waffle House during a hurricane here in NC.", "score": 3, "replies": []}, {"body": "yolo $SPY 0p 3/27", "score": 8, "replies": []}, {"body": "Sir, this is a waffle house", "score": 2, "replies": []}, {"body": "bottom is in", "score": 1, "replies": []}, {"body": "Wow. Learning more than I am at college that's for damn sure", "score": 1, "replies": []}, {"body": "Waffle house index says sell", "score": 1, "replies": []}, {"body": "Now I’m debating buying a put or two for shits and giggles because if it drills I can really say “I bought them because Waffle House closed.”", "score": 1, "replies": []}, {"body": "Finally some delicious dd 😋", "score": 1, "replies": []}, {"body": "Bulls wanna weigh in?", "score": 1, "replies": []}, {"body": "So the Waffle House index just shows how bad the situation is. If it’s open, economy is still moving, if it’s closed your fucked.\n\nAs the Waffle House index shows many chains closing we can only assume the worst is yet to come. Markets will drop more...", "score": 1, "replies": []}, {"body": "Buy calls, because the market is retarded", "score": 1, "replies": []}, {"body": "I’m ready to be cucked by your moms boyfriends dog", "score": 1, "replies": []}, {"body": "I have the gift. I ate at WH last Friday. I knew it would be my last hurrah.", "score": 1, "replies": []}, {"body": "FED passes 2 trillion stimulus. Sorry but as usual Bulls win.", "score": 0, "replies": []}]}
{"title": "I won money on a retarded play and i'm still not happy", "selftext": "Last week during the witching bullshit, I loaded up on DIS $110 and UBER $30 03/27 calls thinking that shit was going to moon EOD no questions about it.\n\nMonday comes around and my shit is worthless. Whatever, we can still have a short squeeze between now and expiry.\n\nToday I sold for a 3.8k profit, which is like 50% gain. and NOW I see UBER is touching $29 premarket and Disney $105 and i'm thinking I should have been more autistic and held. Anyone else?", "id": "fonj8v", "created_utc": 1585129239.0, "score": 152, "upvote_ratio": 0.89, "num_comments": 78, "comments": [{"body": "You absolutely did the right thing by locking in those profits. Look at everyone with \"diamond hands\" who is losing all their money on puts right now. That's what happens when you don't lock in profits. You don't need to capture every dollar exchanged in the market. You just need to make more money than you lose.", "score": 585, "replies": [{"body": "Make MORE.. money.. than.. what you lose.. . Slow down there, Susan, I'm writing this down, this shit is GOLD.", "score": 229, "replies": [{"body": "I wish I didn't skip this class last semester.", "score": 36, "replies": []}, {"body": "Ok calls on GLD", "score": 6, "replies": []}, {"body": "Puts on GLD?", "score": 1, "replies": []}, {"body": "This comment is GOLD", "score": 1, "replies": []}]}, {"body": "💎✊ is still better than your shriveled up raisin dick\n\nBeer flu is still floating around this world no amount of money can stop it", "score": 80, "replies": []}, {"body": "Yep, diamond hands can maximize gains, but it can also make your account go -80% in less than a week. \n\nLooking at you, my account.", "score": 9, "replies": []}, {"body": "I’m losing quite a lot right now but good thing they are shares and not options\n\nExpecting SDOW to go up sometimes soon", "score": 4, "replies": []}, {"body": "Makes me feel a lot better about how I keep getting out of positions to early. Good call", "score": 3, "replies": []}, {"body": "This. Take solid profits and put into your next move. Don’t worry about getting in at the very bottom/top and out at the very top/bottom, just try to grab a slice of the movement.", "score": 3, "replies": []}, {"body": "This comment is like oasis in a desert of autism", "score": 3, "replies": []}, {"body": "Not enough retard. Buy moar poots", "score": 2, "replies": []}, {"body": "More to the point, you'll never capture every dollar. You'll always sell just below the highest and buy above the lowest. It's impossible not to. So long as you're in profit, smile.", "score": 2, "replies": []}, {"body": "Is this gay shit is /r/investing?", "score": 2, "replies": []}, {"body": "Could've had 40k and cheap puts before feds decided to fk me with a 10% in a day green dildo. Got Greedy.", "score": 1, "replies": []}, {"body": "Yeah contrary to most of this sub, having a firm exit strategy (up or down) is the best way to have success trading options", "score": 1, "replies": []}, {"body": "GTFO and go back to /r/investing\n\nHere is WSB, go big or go broke!", "score": 1, "replies": [{"body": "Happy cake day!", "score": 1, "replies": [{"body": "Thank you! :-)", "score": 1, "replies": []}]}]}, {"body": "thanks, locking in profit is a pro move", "score": 1, "replies": []}, {"body": "I'm currently in a bind right now.  I'm holding shares of LULU that are up ($200) from when I bought them ($145) but down from their peaks ($260).  The last week has been a massive rollercoaster because it dipped below my cost basis.\n\nThey've got their ER in a day or two and I'm not sure if I just take the profit now (long term capital gains) or ride it through ER and whatever else the Fed does.\n\nI'll definitely buy it if/once it dips hard again since I like the company but things have just been so volatile", "score": 1, "replies": [{"body": "I would sell if I were you.  I'm losing on DIS and I'm so annoyed with myself, it's not worth the disappointment.  Make the profit, then when stocks drop again, pick up some calls.", "score": 1, "replies": []}]}]}, {"body": "No, a +50% win is always good. You arent a respectable wsb autist with this mindset, but a reasonable one istead.", "score": 96, "replies": [{"body": "Is it more or less autistic that I was disappointed in my 400% trade yesterday because I sold my AAL calls when she nibbled at 14...and now its at 16.65?", "score": 4, "replies": []}, {"body": "10 baggers only 😤", "score": 4, "replies": []}]}, {"body": "Thinking 'I should've sold' is worse than 'I should've held'\n\nYou got a profit. Be happy.", "score": 78, "replies": []}, {"body": "nobody ever went broke taking profits\n\nthat being said you have charmin ultra soft hands", "score": 93, "replies": []}, {"body": "Same, lost 80% on Uber puts so I said fuck it and got an Uber cal yesterday, ended 330% up EOD and will be around 500-600% open, plan to sell and then lose it all with a SPY 4/1 $230 put cause I don’t deserve Money\nEdit: UPDATE, went from 1k to $100 back to 1k off of the Uber call with all I had left, dumped it all into Uber puts and spy puts 4/9", "score": 26, "replies": [{"body": "SPY is tanking right now", "score": 5, "replies": [{"body": "Nah it will only tank once I buy a call", "score": 9, "replies": [{"body": "Are you me?", "score": 2, "replies": [{"body": "We all are", "score": 2, "replies": []}]}]}, {"body": "ummm.... nope, its not", "score": 0, "replies": []}]}]}, {"body": "I bought uber 15$ puts you reversed me asshole.", "score": 11, "replies": [{"body": "I done did the same fuckup", "score": 4, "replies": [{"body": "Tomorrow could give us a little hope. But I know they ain't gonna be worth shit this morning.", "score": 2, "replies": []}]}, {"body": "If yours expire in April or later, they'll still print.\n\nAt least that's what I keep telling myself with my UBER 15p 4/17 I'm holding on to.", "score": 3, "replies": []}]}, {"body": "For no reason yesterday I bought 2.8k in calls and I sold them at open for 5.1k or 3.3k profit. Later that day they are worth 11k. Today probably 14k. So yes I should have been more autistic and held and I am no longer happy with my 110% gains.", "score": 10, "replies": [{"body": "Cheer up buttercup at least you caught part of the pump. I made $68 yesterday. Eat some chikin tendies for lunch and dont cry about a 110% gain.", "score": 6, "replies": [{"body": "Ily stranger", "score": 2, "replies": []}]}]}, {"body": "Play a game with yourself and dont cheat. Pretend you have them decide when youd sell them. see if youd have actually made more or gotten too greedy and ended up with less when this shitshow tanks again. Perfect plays always seem obvious in hindsight. It's a lot better to lock in profits then hold too long and watch them turn into losses. Whoops what meant to say was maybe your not happy because your girlfriends boyfriend didnt let you watch tonight you beta bitch yolo 4/17 spy 200", "score": 13, "replies": []}, {"body": "90% of the comments in this thread are wrong. Should have held those calls with your tiny little tissue paper hands.", "score": 7, "replies": []}, {"body": "If you had of held and it cratered you'd make a post about how you felt retarded holding and not taking a profit\n\nThen you'd have a bunch of baboons in the comments screeching about how retarded you are and flinging shit everywhere. Take the gains and run with them in this fucked market", "score": 5, "replies": [{"body": "This happened to me with $GILD.  President Pumped it to 86, i expected it to go to 90+.  It didnt.  I lost bigly on this because i didnt cash out when i should have", "score": 1, "replies": [{"body": "Happens to the best of us my man unfortunately", "score": 1, "replies": []}]}]}, {"body": "Congratulations you have an addiction problem", "score": 6, "replies": []}, {"body": "Don't start thinking like this or else your gonna end up fucking yourself over holding when you should sell and revenge trading. A win is a win can't be mad about that, once you close the trade its over.\n\nEdit\n\nBought SPY 250c 3/30s on Monday EOD sold yesterday at open for a cool +98%...the same options at EOD yesterday were like +425%. I had bought plenty of time to wait, i couldve dumped half and let the other half ride, but I sold it for a good profit and here we are.\n\n\n\nYou made a good trade, don't fuck yourself up thinking +50% or +100% isn't good enough or you'll end up like the brain dead people in this sub.", "score": 4, "replies": []}, {"body": "Scared money don’t make money.", "score": 5, "replies": [{"body": "It did make money.  He made a very decent profit.  But he got lucky.", "score": 2, "replies": []}]}, {"body": "Bought spy calls yesterday market open and sold for 60% profit. would've been 300% if I held", "score": 3, "replies": [{"body": "I bought them night before.  I think i made about that as well.  Could have held, but there was NO reason it should have gone up, so i was going to cash in my luck while i had it.", "score": 2, "replies": [{"body": "the stimulus is what made it go up, we all knew that but too much gay bear energy around here. Will probably load up on puts again Friday to average my cost if it stays around this level", "score": 1, "replies": []}]}]}, {"body": "I have a theory that even if casinos had no house edge they would still make almost as much money.  Because winners feel exactly like you do so they keep going until they've lost it all, but losers have to stop when they're out of money.", "score": 3, "replies": []}, {"body": "I sold AAPL 250c 3/27 and 250c 4/17 I would be 15k up at least, sold yday for 2k profit...", "score": 2, "replies": []}, {"body": "Market may go to shit again tomorrow, you made the right call.", "score": 2, "replies": []}, {"body": "You made the right call. Profit is profit.", "score": 2, "replies": []}, {"body": "You made 3.8k and you're still sad enough you decided to create a new topic to tell everyone about it?\n\n\nThis place is becoming fucking ridiculous.", "score": 2, "replies": []}, {"body": "Cause you were hoping to be an instant millionaire like these 🌈🐻💎👐🏻", "score": 2, "replies": []}, {"body": "Yup, sold by 260 aapl calls Monday for a 75% loss.   As of eod yesterday I would have been green if I held", "score": 2, "replies": []}, {"body": "I mean expiry is at 3/ 27 and those calls wouldn't have been cheap. With volatility the way it is, we aren't going to see those 10x gains we saw early March.", "score": 1, "replies": []}, {"body": "I had almost 100 SPY calls — don’t beat yourself up. I sold most on Monday for a loss but — like you — still walked away with some profit (miraculously).", "score": 1, "replies": []}, {"body": "I had Macy’s puts that went double money but I had so much time left and they announced they were closing all their stores so I held. They imploded and I kept thinking “this won’t last, they won’t sit at $5 forever. I was right, they went up to $6.\n\nGet out with profits before QE.", "score": 1, "replies": []}, {"body": "At least you held til then I had SPY 255c 3/27 and sold Monday like the weak piece of shit I am for a 70% loss and if I held one more day I would've at least have broken even. 3rd time in 2 weeks I have made a play like that. Oh well life goes on and I always have $ROPE to fall back on.", "score": 1, "replies": []}, {"body": "In this market, I think quick profits are the way to go. It's done. Over. Onto the next setup..shoulda coulda woulda is a pointless game.", "score": 1, "replies": []}, {"body": "I bought a 4/27 35.5 Uber call and ive been tryna dump it for $1... but now its probably gonna work? LMAOOOOOOOOIIOIIIOIILOKO", "score": 1, "replies": []}, {"body": "I had MMM  $135C expiring 3/27 that I bought Monday just to see if I could capitalize on a pop. I paid $50, there were no buyers on Tuesday morning i was pretty convinced this thing was going to expire worthless. 3M starts at 5% up moves to 6% up and then starts closing in on 7%. Suddenly there are buyers and now my call has doubled in value and I sell for $100. If I had held I could have sold it for $300+. I am happy that I doubled my money, however it sucks to know I could have really cashed out.", "score": 1, "replies": []}, {"body": "Well the drill team 6 has made this post invalid. Next", "score": 1, "replies": []}, {"body": "I'm definitely worse. Last Thursday, I meant to buy AAPL puts right before the dip. My dumbass accidentally bought calls. 10 minutes in I was down 55% ended up selling yesterday at that 55% loss. After I sold it skyrocketted and I actually could've profitted from my illiteracy.", "score": 1, "replies": []}, {"body": "Wow you sold for less than 100% gain? Ban.", "score": 1, "replies": []}, {"body": "Premarket doesn’t mean dick", "score": 1, "replies": []}, {"body": "no. take profits. if u held market would have opened very red. thanks for selling.\n\nalso, be aware that you didnt have to sell it all at once. u could have sold ur cost.\n\ngl.", "score": 1, "replies": []}, {"body": "It only took the greatest rise in the DOW ever to save you. A messiah among us.", "score": 1, "replies": []}, {"body": "This is life in the market.  There is no winning brother, there is only surviving and tendies", "score": 1, "replies": []}, {"body": "Can we ban this guy for not being autistic?", "score": 1, "replies": []}]}
