{"title": "Where are all the boomers in this subreddit?", "selftext": "[deleted]", "id": "feonae", "created_utc": 1583547997.0, "score": 21, "upvote_ratio": 0.75, "num_comments": 84, "comments": [{"body": "[deleted]", "score": 54, "replies": [{"body": "If that were true, I’d be rich", "score": 2, "replies": [{"body": "riced in!", "score": 2, "replies": []}]}]}, {"body": "I am not a boomer, but the last recession put my house in foreclosure and I moved back in with my Dad with my girlfriend and new puppy.  We lived there for 5 years while we ate Taco Bell every night and the puppy lived in the closet while shitting all over it.", "score": 44, "replies": [{"body": "What a beautiful story", "score": 30, "replies": [{"body": "It has an amazing ending, but happy endings isn’t as grabby.", "score": 10, "replies": []}]}, {"body": "Sounds like a chihuahua", "score": 6, "replies": [{"body": "It was a chihuahua.  Thing was mean as hell to strangers.", "score": 3, "replies": []}, {"body": "Aren’t those things horrifying little turd factories? Like there’s no way an animal that small can crap so much", "score": 1, "replies": []}]}, {"body": "So eloquently written. Do you work for Hallmark?", "score": 3, "replies": [{"body": "Who’s Hallmark?", "score": 1, "replies": []}]}, {"body": "Doesn't sound that bad", "score": 2, "replies": [{"body": "It was actually some of the best years of my life.  I got to collect unemployment checks, live with my Dad in a stress free environment, and I got to go back to school on the governments dime.\n\nThis was the beginning of my epic bull run that has set me up forever.", "score": 5, "replies": []}]}, {"body": "a 5 focking year old puppy at that", "score": 1, "replies": []}, {"body": "Taco Bell every night. That’s a good way to short yourself.", "score": 1, "replies": []}, {"body": "So you weren’t trading? Making or Losing tendies?", "score": 1, "replies": [{"body": "No, I took my 401K and cashed it out and paid the penalty and put it in an actual physical cash safe.  I left very little in my checking account and took unemployment checks and kept cashing them out.  I was setting up for what they call a “Deed in Lieu”.  Prior to the “Deed in Leiu” I financed a 2 year old sports car so my credit would have a chance to recover.  This was in 2008-2009.  I am now in a situation where that can never happen again.", "score": 3, "replies": []}]}]}, {"body": "Not a boomer. But your last question is easy:\n\n* Be born in a well to do family\n* Become a high stakes gambler knowing no matter what happens, you’ll be financially OK\n* Make massive high risk plays in a super mega bull market on super mega hype stocks.", "score": 26, "replies": [{"body": "Well I’m fucked.\n\n- No family since 18\n\n- Tried my hand at poker for a few years - fuck that ever again\n\n- This is the only potential option.", "score": 8, "replies": [{"body": "just set ur time machine -11 years and u good to go", "score": 5, "replies": [{"body": "I only 25 and make 100k+ since 19 so I’m banking on having enough fun money eventually to make it big. Rags or Riches baby.\n\nEdit: Not sure why this got downvoted. I grew up in poverty. I payed for my education and work extremely hard for the money I make. I may not be the smartest person financially but live and learn.", "score": -13, "replies": [{"body": "If you’re 25 making $100k (since 19) you already made it. No need to make stupid bets. I presume you’re single. Max your 401k and post tax roth. You will retire _rich_ at 50.", "score": 3, "replies": [{"body": ">at 50\n\nFuck that. He should YOLO all of his money and retire in a year or go broke", "score": 4, "replies": [{"body": "This is my plan. I pay my bills and cover what I need to. But the rest is for options.", "score": 1, "replies": []}]}, {"body": "To be completely honest, I have a wife that is just finishing university and will be working full time soon(part time now) with a very good education.\n\nI have been torn between the “being smart and save a little bit” every month and slowly build my net worth.\n\nBut I deal with health conditions that could/will deteriorate my quality of life around retirment age. So I feel a need to dry and do this sooner. Realistically this is a way, other than starting my own business etc etc.", "score": 1, "replies": [{"body": "You could do both. Max 401k and post tax roth. Have, say, 10k/year stock gamble budget. If you hit it, $10k could multiply 10 fold. If you lose it, it’s fine and within budget. Wait till next year. It seems nuts to gamble your acorns which could leave you upstream and w/o a paddle.", "score": 1, "replies": [{"body": "I am in Canada by the way. I’m working on maxing out RRSP contributions and so forth just starting this year.\n\nI’ve had a bumpy road the last few years so financially you could compare me to the kid that serves coffee at Tim Hortons. It’s changing quick due to almost having zero debt now but it’s been rough.\n\nI see your point though and appreciate the advice. I’m still young and naive so I’m trying to learn along the way.", "score": 1, "replies": [{"body": "My larger point, though, is. For every WSBgod there are 100s in this sub alone who lose it all. If you're looking for a true north, someone to aspire to be, he's not it. Luck isn't universal. Niether is timing or having a comfortable economic cushion if you do lose it all.", "score": 1, "replies": [{"body": "I completely understand that. When I’m not being greedy, I’ve enjoyed scalping easy 30% gains on average lately and have had a lot of fun doing it. \n\nAlso, I enjoy humour and sarcasm on this sub but I have real idols that I’d emulate, not some internet millionaire. Envy is a factor though. I’d love to quit my job tomorrow and buy a villa on the ocean to live the rest of my days in.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I identify as a boomer that thinks he is still cool because drives a fast car.", "score": 12, "replies": [{"body": "I only used boomer because I am in this sub and it’s easy way to generalize a group I was targeting for this.\n\nWhat kind of car?", "score": 0, "replies": [{"body": "He couldn’t wait for you to ask", "score": 8, "replies": [{"body": "i couldn't.", "score": 3, "replies": []}]}, {"body": "For the meme, a camero.\n\nReality, A BMW touring.", "score": 6, "replies": [{"body": "Ah, a Touring. Super cool bro.......", "score": 1, "replies": []}]}]}]}, {"body": "Here’s my recession story - I saw the 2008 recession unfold in college.  I bought Bank of America stock, knowing there was no way it would disappear, at around $5 and watched it double and nearly triple (before I sold). I remember ford being at $2 around that time, insane.  Bought my wife’s engagement ring/diamond with a portion of the proceeds. Felt like a god damn genius.  To this day, I still tell this story to make people think I’m smart.", "score": 10, "replies": [{"body": "Nice.", "score": 3, "replies": []}, {"body": "Dang ford used to be $2? Should have gone with a lower put", "score": 2, "replies": []}, {"body": "The only dumb thing was wasting a ton of money on a diamond ring.\n\nJust get a cheap cubic zirconia", "score": 1, "replies": [{"body": "I know, I learned a few years after I bought it how manipulated the diamond market was/is.  Moissanite is a good option too now.  Gems are what hold their value due to true rarity, from what I understand. \n\nI did buy it direct from Leo Schacter in NYC though, at roughly 30% discount.  It’s crazy, they create an actual identification card when going in there.  Security measures were nuts.", "score": 1, "replies": []}, {"body": "Or lab created diamonds. I paid $50 a carat....", "score": 1, "replies": []}]}]}, {"body": "I was trading OTC US rate vol during the financial crisis. There was about 2 minutes after Bear Sterns where the white pack went no bid / no offer. That’s the trading equivalent of the sun not coming up tomorrow. \n\nMy boss called his wife & said “get the gun, get as much cash as you can & go to your moms”. We slept at work for 3 days. \n\nGotta say I missed it this week.", "score": 10, "replies": []}, {"body": "They can’t type fast enough to respond to this thread", "score": 6, "replies": []}, {"body": "I’m 32.  Am I considered a boomer to the WSB demographic? Seriously interested in the age spread here.  How many of you drink zelko and chief juuls, and how many of you drink glenlivet 15 and smoke Romeo y julietas?", "score": 6, "replies": [{"body": "37 here. Call me Methuselah.", "score": 3, "replies": []}, {"body": "Romeo y julietas what are you poor get a fucking padron 26", "score": 1, "replies": []}, {"body": "I slightly regret using boomer in my post, I am 25. \nI enjoy fine scotch, have/used to have a nice humidor id keep full of high grade Cubans. Spend to much money in real 5 star stays etc.\n\nNot some 10-request Starbucks ordering, vegan loving, fake plaid wearing, skinny jean fuck of a hipster.\n\nI hate avocados.\n\nEdit: I grew up poor. Not family money.", "score": -3, "replies": [{"body": "I’m 35 and I enjoy Costco Irish Whiskey?", "score": 3, "replies": [{"body": "I haven’t tried the whiskey. The vodka is top notch though. Can’t say the same for the rum, thought that was garbage.", "score": 1, "replies": [{"body": "The Kirkland Blended Scotch (@ $18/1.75L) isn’t the WORST thing in the world when you are broke, but the $28 1.75L Irish Whiskey is hella value. Smoother than Jameson, and better (IMO, some agree, some disagree). If you can swing the extra $10 while broke, Irish Whiskey all the way.", "score": 2, "replies": []}]}]}]}]}, {"body": "Well, not a boomer, but barely a millennial, I was getting outta the army during the last recession, and had a baby on the way. I didn’t have testicles too, so when the now ex-wife (then wife) wouldn’t let me drop $10k on $2/share AMD, I just went with it. Now I am divorced and trying to learn how to yolo all my money so I can only afford $18 blended scotch from Costco...", "score": 6, "replies": [{"body": "If I make 150k this year in trading and you see my post, remind me and I’ll buy you the finest bottle of whiskey over 1k\n\nEdit: make it 50k and I gotchu bb. 150 was greedy.", "score": 6, "replies": [{"body": "Hey man, I ain’t that fancy, I’d settle for a bottle of Irishman 12 year which is about 1/10th of that price!\n\nI can afford nicer whiskey, but why spend $400/month when I can spend $60 and still be happy? Well... $60 if the girlfriend and I aren’t taking pulls off the handle in the parking lot of Vail... got so many dirty looks from all the upper-crust skiers!", "score": 3, "replies": [{"body": "Haha I love it. I’ll still be looking for this comment once it hits 50 though.", "score": 3, "replies": []}, {"body": "This is absolutely the way.", "score": 2, "replies": []}]}]}]}, {"body": "Not a boomer but graduated with a Finance degree in 2008. That was fun.\n\nTo this day I have worked in about every job category but finance. Best advice for the 18ish folks in the recession to come is to stay flexible and take what work you can get.\n\nAlso you aren't Michael Fucking Burry so don't be a dong and play the market too hard since it doesn't always make sense during panic mode.", "score": 3, "replies": [{"body": "I have a fairly stable job and pull I low 6 fig figures so I’m hoping I can ride this out another 5-10 years. The industry I’m in is what worries me.\n\nNot taking food from the table to bet, but don’t have everything in world to have fun with either. Being smart about the money I’m using , but can’t say the same for some of my plays.", "score": 1, "replies": [{"body": ">I have a fairly stable job   \n>  \n>......  \n>  \n>The industry I’m in is what worries me.\n\nNever be worried to shop around. Should shit hit the fan during a recession even slightly troubled industries that seem stable can go straight to mass layoffs and downsizing overnight......\n\nFinance seemed like an obvious choice of major for a great paying stable job in 2004, but by 2008 absolutely nobody was hiring. When Lehman went under later that year it was obvious to stop trying and move on to whatever was available.", "score": 1, "replies": [{"body": "I get what your saying and my oxymoron of a statement. I “feel” I have a stable job. I work in oil and gas but not some shitty average rig job. If you work in a plant that sustains the fuel for a large amount of people that cant be replaced. Then I can’t see much changing.\n\nI’m also making moves. There is much more stable\njobs in the industry and I’m working towards them. \n\nHope for the best expect the worst.", "score": 1, "replies": [{"body": ">Hope for the best expect the worst.\n\nAmen.\n\nAlso if by chance you work in nuclear that is another horror story on a bright future gone to hell. Not even the operating plant people were safe, atleast a few years ago when I last paid attention.", "score": 2, "replies": [{"body": "Nope not nuclear, just natural gas and NGLS/LPGs and emulsion.\n\nInteresting to hear, I was always curious about getting into nuclear if I ever went east. Let that idea go though.", "score": 1, "replies": [{"body": "Obviously, you should be capturing the helium and selling it out the back door?", "score": 1, "replies": [{"body": "Not dealing with helium, but if you need propane, butane. Or condensate you could easily turn into diesel, Hit me up", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I'm not a boomer, I'm a 34 year old millennial, but I bought thousands of shares of Citi at 50 cents because I knew at that point in time that the market couldn't go any lower. When a recession hits like it did us in 2008, you will know when the bottom has hit.", "score": 4, "replies": [{"body": "Hope you made a shit ton of money. And obviously your saying we haven’t seen that bottom this time around yet?", "score": 3, "replies": []}, {"body": "How did you know that Citi wouldn’t go bankrupt at that point? That seems so close to the abyss, what information lead you to buying", "score": 3, "replies": [{"body": "The bank failing stopped. At that point I said to myself literally out loud in a call center I was working at while in college \"all these banks collapsed, there's no way they can all collapse and the government definitely wont let them. If they did we'd be the end of society and everyone would lose\". Citi seemed big enough to maintain and nobody was really talking about it so I emptied my bank on it. Also, nobody was even talking about the recession. It was literally 9k dow in 2008 whatever and people LITERALLY WERENT EVEN PHASED.", "score": 2, "replies": [{"body": "Congrats on dropping your gigantic diamond balls on a fantastic iron gut instinct.  It was like shooting fish in a barrel, looking back, but not during that time.", "score": 3, "replies": [{"body": "You will know when the bottom has hit. It will be more clear than your little dick knowing that it wants to be inside that girl at the bar.", "score": 2, "replies": []}]}]}]}]}, {"body": "Not a boomer but was just old enough to trade at the height of the GFC. I started day trading CFDs and was making bank on the daily on wild volatility swings for several months. I got in on anticipated moves and out pretty quickly and when I got in and was wrong, I didn't let my losses max out. Just got out and moved on to the next one. \n\nTrade with the market, not against it and wait for confirmation of a moves direction before entering the trade.", "score": 1, "replies": [{"body": "Thanks for the comment. I have been mainly scalping daily swings with options within 5-10 mins - pulling 30% profit, at least in most trades.\n\nBut the last few weeks, I’ve been doing a lot of panic selling, and my old broker was taking 3+ minutes to process my market sell orders... so I got raped pretty good.", "score": 1, "replies": [{"body": "I must be using the wrong signals. I scalp with a goal of 20%. Sometimes it works quickly. But sometimes I’m stuck in the trade for an hour.", "score": 1, "replies": [{"body": "I have been fairly lucky these past couple weeks with the volatility, before that I was strictly playing Tesla calls and it was working out well. \n\nNow my last few trades I keep buying at the bottom. Win some you lose some.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Hope she made you money.", "score": 1, "replies": []}]}, {"body": "Moved the cash to bonds right before the recession you bitch. Bank acct stayed the same", "score": 1, "replies": []}, {"body": "*cough*", "score": 1, "replies": [{"body": "If your feeling sick, can you please go visit a Disney park? Thank you.", "score": 3, "replies": []}]}, {"body": "they either shot themselves with their 1911s after todays close or are experiencing resp fails from playing corona drinking games\n\n&#x200B;\n\nyou choose", "score": 1, "replies": []}]}
