{"title": "r/Stocks Daily Discussion Monday - Mar 02, 2020", "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing\n  * [Corporate News](https://www.streetinsider.com/Corporate+News)\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n  * [Economic data](https://www.streetinsider.com/Economic+Data)\n  * [FED](https://www.streetinsider.com/Fed) - Federal Reserve news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&t=all&restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.", "id": "fc8x7x", "created_utc": 1583136556.0, "score": 5, "upvote_ratio": 0.7, "num_comments": 85, "comments": [{"body": "Robinhood down for anyone else? Mine won’t load.", "score": 10, "replies": [{"body": "Mine either. Hasn't updated since 9:35", "score": 4, "replies": [{"body": "Hmmmm", "score": 1, "replies": []}]}, {"body": "Yup. I’m expecting my first purchases to go through today. Hope this doesn’t affect that.", "score": 3, "replies": [{"body": "Maybe they don’t want everyone selling lol", "score": 2, "replies": [{"body": "But I want to buy dammit", "score": 5, "replies": []}]}]}, {"body": "They tweeted there’s a server issue", "score": 3, "replies": []}, {"body": "Yep", "score": 2, "replies": []}]}, {"body": "Fuck me, its opening at green and my puts are down 50%", "score": 9, "replies": [{"body": "Hoping on the market being pumped rn so they can buy puts on the low and then dumping. Too much bad news for this to be natural.", "score": 3, "replies": [{"body": "Yep. Surely theres no way apple is +5% after people have started dying in washington", "score": 5, "replies": []}]}, {"body": "Fuck. Are these retarded central bankers working together to pump the market?", "score": 4, "replies": [{"body": "GOV pumping and dumping confirmed?", "score": 1, "replies": [{"body": "GOV dump?\n\nGov pump.", "score": 1, "replies": []}]}, {"body": "Of course? Its what they get paid to do.", "score": 1, "replies": []}]}]}, {"body": "Robinhood crashing for anyone else??", "score": 8, "replies": [{"body": "Appears to be a system wide outage. That is what has been reported on CNBC.", "score": 4, "replies": [{"body": "This sure seems intentional.", "score": 5, "replies": []}]}]}, {"body": "No volume. Fed is manipulating the market.", "score": 7, "replies": [{"body": "Not necessarily, just lots of buying action at open today. Futures up, good news pouring out from some chipmakers, things looking like Coronavirus nonsense was way overhyped. Once again, money does not care about people, unfortunately.", "score": 3, "replies": []}, {"body": "Where are you looking to see overall volume in the market?", "score": 1, "replies": []}]}, {"body": "Feels like I’m pulling a pump and dump on $IBIO again today", "score": 5, "replies": []}, {"body": "You guys still think IBIO is gonna rally today?", "score": 5, "replies": [{"body": "Its doing well in Pre Market", "score": 4, "replies": []}, {"body": "Narrator: It did not", "score": 2, "replies": []}]}, {"body": "Why is Disney down so much? Thoughts?", "score": 6, "replies": [{"body": "1) Iger leaving as CEO early,\n\n2) Coronavirus impacting travel, which will have an effect on park revenue\n\n3) The new CEO is known as a staunch penny pincher, so there's going to be some hesitancy jumping in until we know what his plan is moving forward. Bob Iger has gone big a lot with Disney, and spent a lot of money doing it. So, there could be a slowdown in big launches under Bob Chapek if his behavior as head of Disney's park is any indication.", "score": 5, "replies": []}, {"body": "At least one quarter if Disney is dependent on travel/leisure, which is currently in crisis.  \n\nTheir 2 most anticipated film releases for this year were supposed to release this month, but they're both looking to be adversely affected.  Compare that to last year when they had a string of blockbusters in the pipeline (frozen, marvel, Star Wars, Aladdin, Lion King)\n\nAnalysts may soon start asking questions about how they plan to turn their money-losing Disney+ subs into profit.  The assumption was that Bib Iger knew what the trick would be, but now he's gone.\n\nConcerns will start to rise about how they plan to replace all the legacy revenue they threw away (licenses, Disney channel, PPV, DVD and Blu-Ray)", "score": 3, "replies": []}]}, {"body": "Not sure if I can / should create a thread for this, but:\n\nAfter Robinhood's failure today, I want to switch to another free trading brokerage service. What are my options? I've heard TD Ameritrade will pay the Robinhood cancellation fee. What do you guys recommend?", "score": 6, "replies": [{"body": "I’ve used every single US broker and Fidelity is the best by far in my opinion. The fact that they automatically invest any unused cash into a money market fund instead of some bank account earning .03% is what separates them from every other broker I’ve used. Only other major US broker that offers something comparable that I’ve used is Interactive Brokers. With IB though you need at least $100k to get access to preferred rates on your idle cash (last I had checked this could have changed) and the first $10k earns pitiful interest like TD/Robinhood etc. Access to Fidelity zero fee funds is also a plus and while nothing to really do with their brokerage their 2% cash back on anything credit card is second to none in terms of raw cash back. Having it linked to your account to auto deposit is like getting a $50-$100 dividend every month. Their customer service is also top notch, almost on par with TD. Their cash transfers between bank account and brokerage are near instantaneous as well. While they don’t have as much sophisticated charting or as clean to use mobile platform as TD it’s pretty much on par. If you have $10k or more in idle cash on any day you’re  going to want to be earning close to market rate interest on it vs having it sitting in your checking account like you would at TD.", "score": 4, "replies": [{"body": "This is really helpful insight, thank you!", "score": 2, "replies": []}, {"body": "How about schwab?", "score": 1, "replies": [{"body": "Very similar to fidelity but they sweep cash balances into their bank accounts like TD does earning a lot less interest than something like SPAXX which fidelity automatically holds your idle cash in.", "score": 2, "replies": [{"body": "I did not know that before. Thank you!", "score": 1, "replies": []}]}]}]}]}, {"body": "I know you are never supposed to \"time the market\" but what do you guys think about this coronavirus business, asian markets slowing down while people are home sick, etc? Will the markets keep going down?\n\nI have some cash I want to invest, should I keep sitting on it hoping the markets keep falling over the next few weeks, or should I just take this relative low spot as a small win and just buy stocks now?", "score": 5, "replies": [{"body": "Actually, every individual and institutions who pushes \"don't time the market\" actually does time the market for themselves. \n\nBanks have thiusands of employees dedicated to trying to time markets.  Everyone in this sub is trying to.  There's nothing wrong with it.", "score": 3, "replies": []}, {"body": "While You can’t truly time the market, it could be wise to wait a week and see how the virus plays out.  I think that’s totally reasonable.  Personally, I did buy today like I had planned but ymmv", "score": 2, "replies": []}, {"body": "You cant time the market. This morning (gmt+1), I was sure that $APPL and $MU will go down. I was almost about to sell, when I changed my mind. Now both are up. If I had cash right now, I would just buy a bit every other day and try to average the cost.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "It's almost like the stock market is grossly manipulated, or something!", "score": 4, "replies": [{"body": "It is they are trying as hard as possible to fix it but it will drop again", "score": 3, "replies": [{"body": "Of course it is, shit is gonna hit the fan hard once a crash happens. With likely much worse ramifications than 2008 if you ask me.", "score": 1, "replies": []}]}]}, {"body": "Not really. Stocks go up, stocks go down, they don't move in a straight line. I view this as a dead cat bounce and got short around mid-day.", "score": 3, "replies": []}]}, {"body": "Would investing in QQQ and VTI index funds be a good idea or should I wait? Thanks", "score": 3, "replies": [{"body": "Nah. Buy Calls in MSFT, AMD, GLUU.", "score": 3, "replies": []}]}, {"body": "I dont think this green market is gonna last too long, I would like to make some short plays this week but I'm not sure what I should invest in.", "score": 3, "replies": []}, {"body": "Why did market was positive today? I thought it would be bearish given the new corona virus cases in New York.", "score": 3, "replies": []}, {"body": "Should i buy VIX (the volatility index) because of what is going on right now? or is that a big risk?", "score": 2, "replies": [{"body": "Too late", "score": 2, "replies": [{"body": "ty, do you think theres an opportunity in the future?", "score": 1, "replies": []}]}]}, {"body": "I put a limit order on apple for 275 so if the prices rocket upwards on monday I can buy them shares cheap. But I just checked and apples is at 282 an dmy linit order didnt kick in? Does it not work like this when the market opens? \nWhen i put the limit apple was at 273.", "score": 2, "replies": [{"body": "You may not have gotten priority on your order. You may have missed the bid for that price depending on outstanding shares available at that price. It sucks :( happened to me a few times. Just buy at open next time.", "score": 1, "replies": []}, {"body": "The spread could have been too large, ask could have opened more than 275.", "score": 1, "replies": []}]}, {"body": "I sold 5 puts in boeing a few months back expiring in may at $300 that will be on margin if executed.  \nShould i get out today while the markets are up?", "score": 2, "replies": [{"body": "I would say so. You could end up losing a lot since a lot of businesses have reported positive news and outlook after March. Though travel has been restricted as of now, this doesn’t stop Boeing from selling more planes or stop their work in defence. Especially with how Kimmy John Oong is acting lately.", "score": 1, "replies": [{"body": "So you are saying i should close out my positions or i should not?", "score": 1, "replies": [{"body": "Close, my friend :)", "score": 1, "replies": []}]}]}]}, {"body": "Buy Ibio today or?", "score": 2, "replies": [{"body": "I bought, got caught up in RH shenanigans, lost my out point. Down 25% now trying to decide whether to cut losses or wait out the rest the week. Anyone else run into this?", "score": 1, "replies": [{"body": "I bought in this morning at 3.10. gonna wait until the ASM Thursday.", "score": 2, "replies": [{"body": "Exactly to the money, same for me.", "score": 1, "replies": []}]}]}]}, {"body": "Thoughts on SPCE? I have a neighbor who’s swears by it. Bought a while back and made a TON of money. I’m tempted to buy while the price has dropped a bit, but a little worried the sudden spike was just hype and shares won’t hold their value.", "score": 2, "replies": [{"body": "The spike was a hype and shares won't hold their value.\n\nIn my opinion, SPCE has no underlying value. Their business model is bad, and their airplane thingy is crap. (But hey, let's blame the pilots)\nNo way millionaires will pay tons of money to most likeley die instead of going to space.", "score": 5, "replies": []}]}, {"body": "I’ve got $1200 I plan to use on FXAIX. Should I buy today or will it drop later in the week?", "score": 2, "replies": []}, {"body": "\n\nI think what may potentially trigger a even worse blow up would be the rebalancing by huge retirement/mutual funds when the bad earning reports come in. The reports will automatically trigger trades to rebalance funds holding. The bad reports, which are expected, to breaks the parameters used in the funds defining formulas, will force a huge rebalance of their holdings. I can’t imagine how huge of a impact this avalanche and the snowball effect will have on the stock market.   I imagine it would be a great buying opportunity, if I manage to survive and preserver through it.", "score": 2, "replies": [{"body": "Interesting.  Like if, e.g., AAPL announces bad earnings, then a tech fund would have to dump some MSFT too to avoid being overloaded on MSFT in relation to AAPL?", "score": 1, "replies": [{"body": "Possible, but a usual bad earning report should not exceed the parameter because, after all, these retirement/mutual funds are supposed to be long term, but I believe the virus outbreak will cause a level of disruption, while temporary, that will exceed the those parameters.", "score": 1, "replies": []}]}]}, {"body": "Thoughts on Zoom (ZM)? I think more people are going to be on remote calls", "score": 2, "replies": [{"body": "I like it!", "score": 1, "replies": []}]}, {"body": "I understand Costco being up 10%, due to people panic buying... but why is Apple up 10%? Is it because they're re-opening stores in China? BuyBacks?", "score": 2, "replies": []}, {"body": "What are best dividend stocks that'll also grow in value in the next 10 to 20 years?", "score": 2, "replies": []}, {"body": "God dam", "score": 1, "replies": []}, {"body": "Thoughts on INTC going forward? They claimed that business has not been impacted as much due to the virus nonsense. Are they bluffing or is this just market manipulation?", "score": 1, "replies": [{"body": "Intel wouldn't be \"bluffing\" or \"market manipulating\".\n\nIt's worth pointing out that when INTC was at $65 they had an ER that was surprisingly stronger than expected.  They popped to $69 for a millisecond but larger market fears ever since have driven the price way down.  I would have sold them at $69 if I was quick enough, and in my opinion low 50's is a steal.", "score": 2, "replies": []}]}, {"body": "Thoughts on Qualcomm for the long term", "score": 1, "replies": []}, {"body": "What you all think about $ZM - Apparently face 2 face alternative being used more often now with the virus spread. I know the software for work and b2b industry, curious how well it will do next 5 days. Interesting 120day chart. \n\nThoughts?", "score": 1, "replies": []}, {"body": "So I’m brand new to investing and I have a question. I recently transferred 30k to TD Ameritrade. Right now, I have about half of that invested in stocks so I should have the remaining 15k or so available to trade right? But the buying power, the money available to invest is around 8k. What am I missing here?", "score": 1, "replies": []}, {"body": "Out of the pharmaceutical companies (GLD, XLRN, NVAX, TGTX, BMY, etc.) which company would be a 'safe-haven' and possibly a good place to put my money?", "score": 0, "replies": [{"body": "Have you heard of MDGL?", "score": 1, "replies": []}, {"body": "GLD is not a pharma company.\n\nBMY is a safe bet, I think.", "score": 1, "replies": [{"body": "Sorry I mean GILD", "score": 1, "replies": []}]}]}, {"body": "$CGC", "score": -2, "replies": []}]}
{"title": "Let’s talk airplanes", "selftext": "I’m pretty sure everyone who held airplane puts got completely fucked by today’s market and I was sort of expecting a similar pattern as last week with much of the marker (mid morning surge and dip in the afternoon). But everything just kept going up. I mean the DOW went up about 5% today but I don’t get why airplane stocks went up as much as they did. They did tank premarket and in the early hours but came from way behind and now most of them are green for the day (or very close to it). Does all the flight cancellations and travel bans do anything to the stock? Unless today was some dead cat bounce (which I’m hoping it is), what is the strategy for the next couple weeks?", "id": "fcj8gd", "created_utc": 1583184106.0, "score": 40, "upvote_ratio": 0.95, "num_comments": 76, "comments": [{"body": "Fed pumped too hard today. They'll need viagra to keep pumpin tomorrow.\n\nCalls on Viagra", "score": 74, "replies": [{"body": "Nice DD. I'm in.", "score": 15, "replies": [{"body": "Oh wait... I use RH...", "score": 13, "replies": []}]}, {"body": "Long PFE", "score": 2, "replies": []}]}, {"body": ">travel restrictions\n\n>DAL goes up\n\nsure", "score": 82, "replies": [{"body": "Same here. I got dunked on today", "score": 23, "replies": [{"body": "Let me introduce you to my friend, \"priced in\".", "score": 3, "replies": [{"body": "No I don’t think so", "score": 9, "replies": []}]}]}, {"body": "| coronavirus spreading rapidly\n\n| SPY goes up\n\nokay", "score": 16, "replies": []}, {"body": "I said DOW lmao", "score": 3, "replies": [{"body": "dal went up today", "score": 9, "replies": [{"body": "Oh I’m an autist. Yeah it went wayyy up", "score": 8, "replies": []}]}]}]}, {"body": "My asshole hurts from the pounding I took today", "score": 38, "replies": [{"body": "Same, your wife’s boyfriend had his way with me today.", "score": 5, "replies": [{"body": "Same, your boyfriend’s wife had his way with me today.", "score": 3, "replies": [{"body": "We are at a 3rd degree cuckception here", "score": 9, "replies": []}, {"body": "Same, my boyfriend's wife had his way with me today.", "score": 3, "replies": []}]}]}, {"body": "I was bearish the last two weeks, then went bullish. Not sure if I'm a genius or autistic and lucky.", "score": 3, "replies": [{"body": "I lost all my money being a bull the last 2 weeks, switched to bear on Friday. Not sure if Autistic or unlucky", "score": 7, "replies": [{"body": "No you are just retarded", "score": 1, "replies": []}]}, {"body": "Yes.", "score": 1, "replies": []}, {"body": "What are you planning on doing next o wise one", "score": 1, "replies": [{"body": "Probably lock these profits on wednesday, because I'm not confident the uptrend will continue, and if it doesn't, Friday will start the selloff with people not wanting weekend risk. I'll see how Friday goes and choose my direction then. \n\nBut don't listen to me, I'm a random dude on the internet. And in this gains-forsaken sub, too.\n\nEDIT: Ended up exiting while it was green today, didn't like the news. Will probably be bearish for the foreseeable future, along with everyone else. lol", "score": 1, "replies": []}]}]}, {"body": "Calls on $Lube heard.", "score": 1, "replies": []}]}, {"body": "Forget airplanes. Let’s talk about WSB’s collective loss on SPY puts today.", "score": 52, "replies": [{"body": "Ha! Speak for yourself! I pulled out at 9:15 this morning before my order was processed/Robinhood went down and it saved me nearly 5k. I have the confirmation emails they were canceled so if Robinhood wants to try and fuck me, I’ve got the receipts", "score": 12, "replies": []}, {"body": "Can't lose money if I can't see my fucking positions", "score": 9, "replies": []}, {"body": "Down 6K", "score": 0, "replies": []}]}, {"body": "I'm at the airport now and its fucking packed as usual.  Like nothing is wrong.  Don't know if I'm sick or not, but I'll start coughing on old people so your puts will print.", "score": 26, "replies": [{"body": "Thank you for your service", "score": 14, "replies": []}, {"body": "double time it soldier!", "score": 5, "replies": []}, {"body": "I would not expect to see even the slightest hint of an issue right not unless you are in Washington.", "score": 1, "replies": []}]}, {"body": "Airplanes go up. Stocks go up. Airplanes go down. Stocks go down. Easy.", "score": 21, "replies": [{"body": "But when penis?", "score": 6, "replies": [{"body": "Soon", "score": 1, "replies": []}]}]}, {"body": "I think the severity of the situation is not well understood due to the under reporting of numbers. Wait a while for more people to die before they take actions.", "score": 19, "replies": []}, {"body": "Some mf saying \"market is irrational\". Bruh this is a dead cat bounce, bull trap at it's finest.", "score": 14, "replies": [{"body": "Lmao, more like a dead cat rocket", "score": 16, "replies": [{"body": "Hard down, hard up. With the extreme volatility the 301-304 range most of the day was strange with no volume (f for rh gang). Question is if we have finished the slide or maintained when we didn't go below 300", "score": 4, "replies": []}]}]}, {"body": "Short covering, they were too heavily shorted and too many puts.", "score": 10, "replies": [{"body": "Savage that this took place while a lot of people couldnt cut losses because RH has garbage infrastructure", "score": 15, "replies": []}]}, {"body": "same here. im no expert, but im expecting things to get muchworse for the airlines. the may start seeing domestic travel decrease significantly here shortly.\n\nive pulled out of my index fund pending the correction. once thats down, YOLO on AAL, DAL, & UAL.\n\n\nedit: my national labor union just sent out an email about major flight delays nationwide.", "score": 7, "replies": []}, {"body": "Airports in America still doing well. But probably will change in the next few weeks. Also airport workers haven’t prep for this", "score": 7, "replies": [{"body": "There's some people commenting that TSA officers are being told shutdowns may occur if their city is affected", "score": 2, "replies": []}]}, {"body": "Hawaiian airlines puts on the cheap. No one gonna be flying halfway to China just to get stuck on an island with empty costco's.", "score": 7, "replies": []}, {"body": "[removed]", "score": 6, "replies": [{"body": "I submitted my sale at the low of the day.  Was so happy then it failed.  Then RH stopped loading.  I was so mad but its 3/20 and honestly i think they will go back down as the virus spreads more.  I would have been happy with my gains today but i think we might do better.  Several times i watched the market go up and AAL still go down.", "score": 3, "replies": []}]}, {"body": "Alex jones here. Anyone really surprised the government has turned our bulls gay?\n\nI've been telling you all about Chem trails for years.\n\nAlso, interest cuts to melt bear steam.", "score": 5, "replies": []}, {"body": "My mommy likes to make airplanes with my mushy peas so I eat my vegetables.", "score": 10, "replies": []}, {"body": "Finished the day almost exactly where my AAL put was Friday", "score": 3, "replies": []}, {"body": "Literally no positive headlines besides some priced in bullshit from fed and pence and the market kept going up, for no reason. If this isn’t a dead cat bounce I’m not on the spectrum", "score": 3, "replies": []}, {"body": "Holy duck it’s all green puts szn", "score": 2, "replies": []}, {"body": "Hope you autists enjoy the puts I sold you for  giant premiums\n\nTell your wife I'll swing by later", "score": 2, "replies": [{"body": "please take her to outback steakhouse and shut her up, make sure she wears her mask", "score": 3, "replies": []}]}, {"body": "Is anyone keeping up with the numbers out of Italy and South Korea? What governments can we even trust on the numbers at this point?", "score": 1, "replies": []}, {"body": "https://imgur.com/a/cUxKM9K", "score": 1, "replies": []}, {"body": "i was telling all the autists in the discord that they've been oversold and to look for things that haven't been heavily sold off yet, but oh well keep chasing history without even CONSIDERING the present and future", "score": 1, "replies": []}, {"body": "Spirit airlines puts.", "score": 1, "replies": []}, {"body": "Give it some more time.", "score": 1, "replies": []}, {"body": "Lol airlines go up because interest rates makes buying more airplanes  .25% cheaper...", "score": 1, "replies": []}, {"body": "wtf is a DOW, why the fuck are boomers obsessed with the DOW", "score": 1, "replies": []}, {"body": "Let's talk about sex bay-bee. \nLet's talk about you and me.", "score": 1, "replies": []}, {"body": "Dead cat bounce? Lol", "score": 1, "replies": []}, {"body": "::grumble grumble grumble:: ...I tried to cancel some puts in Robinhood so many times today, but they went thru.  Hoping for tragedy by Friday now!", "score": 1, "replies": []}, {"body": "Fuel price drops and the main cost of running an airline also drops.", "score": 1, "replies": []}, {"body": "Dow went up because confidence in 1) corona not being so bad, 2) containment of corona, 3) china getting back to making shit. \n\nIf confidence that corona ain't shit, then obviously airplane stocks go up to, because they think more people will fly/continue to fly.", "score": 1, "replies": []}]}
