{"title": "Financial Times - China’s internet giants order $5bn of Nvidia chips to power AI ambitions", "selftext": "[removed]", "id": "15n33xy", "created_utc": 1691645157.0, "score": 83, "upvote_ratio": 0.94, "num_comments": 26, "comments": [{"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Ooh boy. Earnings are going to be nuts. I mean guidance.", "score": 37, "replies": [{"body": "Didn't congress just pass a bill prohibiting technology sales to China tho", "score": 11, "replies": [{"body": "They can’t tell Nvidia what to do, so no", "score": -27, "replies": [{"body": "Yes they can and have done so", "score": 23, "replies": [{"body": "Exactly .. tariffs and restrictions have both hit NVDA in the past and their tech will continue to be targeted by  whatever political back and forth happens between US and China.", "score": 1, "replies": []}]}]}]}]}, {"body": "What will happen to this rushed revenue in Q4 2023 when these chips get restricted?", "score": 9, "replies": [{"body": "[removed]", "score": 6, "replies": [{"body": "I can easily see the H800 being restricted. \n\nA800 only sells for around $10k. \n\nThe H800 & H100 are what Nvidia prints on. Those make $25k each.", "score": 3, "replies": []}, {"body": "It seems like the usgov is doing exactly that. It's the main bear case for nvidia-that they won't be able to sell their leading edge to china (or to companies that rent servers to china). A situation similar to ASML's euv lith machines.", "score": 3, "replies": [{"body": "National security officials want to do it while business officials don’t. What happens depends on who has the better hand on any given day. US policy is not that consistent.", "score": 1, "replies": [{"body": "The winds have changed and security will take precedence over every other consideration until the day the fears around China becoming a peer competitor to the US on the world stage are gone. We're not in the 2000s anymore.", "score": 4, "replies": []}]}]}]}]}, {"body": "[removed]", "score": 9, "replies": [{"body": "Madness", "score": 8, "replies": []}, {"body": "Not really if you suppress a large buyer and it’s political", "score": -10, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}]}, {"body": "Maybe this is why they’ve been driving the price down lately.", "score": 2, "replies": []}, {"body": "As if the US government is going to allow that. Dream on.", "score": 4, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "If these AI chips have dual use potential (which I'm guessing they do), then if they haven't been banned for export already it's only a matter of time. I wouldn't get my hopes up.", "score": 3, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "I think it's clearly a new form of containment, and really when we talk about the emergence of such sweeping policy changes and new doctrines, what business leaders think - from my understand of politics - becomes secondary to the new foreign policy and security imperatives. This new containment policy is more targeted at this stage compared to what we know when we think of the term, because there was never the same level of economic exchange between the US and the Soviet Union back then than there is with China today, but it's still the same kind of game that's being played.\n\nImo it's not about decoupling for now, but it doesn't have to be for this to happen. Europe is in an even worse position in that sense relative to China than the US (in terms of economic interdependence), but are every bit as uncomfortable about that, considering the war in Ukraine as well as so on. The European Commission recently came up with a a \"de-risking\" approach instead which is more selective than decoupling, and that kind of language and concept is being [increasingly accepted by the US, the G7](https://www.reuters.com/world/g7-pledge-de-risk-china-reflects-concerns-europe-japan-2023-05-22/) and so on, because as you say no one wants to suddenly decouple. But with this kind of dynamic at play, more serious decoupling is never that far away either I think.", "score": 2, "replies": []}]}]}]}]}]}
