{"title": "Nvidia’s Next-Generation AI Chip Rollout Slowed by Engineering Snags", "selftext": "Uh oh more fear food for the fearful", "id": "1el4d9a", "created_utc": 1722905350.0, "score": 0, "upvote_ratio": 0.31, "num_comments": 18, "comments": [{"body": "This article is literally just the “3 month Blackwell delay” that’s already been published. Funny how Bloomberg releases this article after palanatir beats earnings (which will help NVDA stock). It’s quite obvious they have a position that benefits for NVDA stock to go down or they want to buy in as low as possible before earnings.", "score": 10, "replies": [{"body": "Yaya", "score": -2, "replies": [{"body": "It’s so dumb how the entire media rn is just fear mongering- like with how Iran is going to attack Israel. When have you ever seen a country tell another country “I plan on attacking you soon btw” and actually do it? China did it with Taiwan, NK did it with SK/USA. Like what??", "score": 1, "replies": []}]}]}, {"body": "Some people expect perfection. This is the same thing we’ve been hearing all weekend and this article comes after we here great news from Palantir and Japan stock market roars back\n\nI get it delays aren’t good but we’re human - delays happen, things go wrong, we make errors/mistakes all the time. Can we for a moment enjoy the recovery and be positive tomorrow? \n\nI get it everyone is different but life is too short to be not enjoy it and have fun along the way", "score": 3, "replies": [{"body": "I mean if this was INTC, I'd be concerned...\n\nThis is NVDA who is already ahead of the curve in time line for a new product. A small delay just brings them back in line with a normal release cycle. 🤷🏽‍♂️\n\nI am not concerned one bit since each and every piece of hardware that can be made... is already presold. No one cares what it is, they just want it... and they wanted it yesterday.\n\n\"The grabbing hands, grab all they can...\"\n\n-DM", "score": 2, "replies": []}]}, {"body": "whats wrong with delaying to improve the product?", "score": 2, "replies": [{"body": "Are you seriously asking why delays are bad? Investors want products to be done on time or ahead of schedule, giving excuses doesn't change the fact that delays are objectively bad.", "score": 1, "replies": [{"body": "It’s literally the same thing everyone has posted about for the last 24 hours - analysts all agree that current GH200 and H200 are in such high demand that moving B200 production one quarter isn’t going to change anything, _ESPECIALLY_ if it’s improving the quality of the chip.\n\nEdit - Let’s not forget Nvidia said “ramp up production in 2H 2024” in April after their developer conference, and already addressing the concerns saying “They’re still on track for ramp up in 2H 2024”.", "score": 2, "replies": [{"body": "Delaying a long awaited product is not a good look regardless of why it's done, and such things matter when the stock is in the media (and investor) spotlight 24/7.", "score": 0, "replies": [{"body": "Apple does it with every phone they release … they squeeze every penny out of the market on the old version before they release the new … Wouldnt surprise me if this “mistake” wasnt actually a mistake, but an intentional delay to get more money on their older model before releasing the new.", "score": 2, "replies": []}, {"body": "Yeah, IF you’re a short term investor, sure. Hopefully most of the people in this sub aren’t. I’m not, so I don’t give a shit if it’s delayed by a quarter or even a year. Nvidia isn’t going away anytime soon, and we’re investing in a company right before it’s remaining 5-10 year 5 year super cycle, assuming no innovation is made (which of course it will).", "score": 2, "replies": []}]}]}, {"body": "And I get that but we’re all human - or at least supposedly we are - there’s going to be delays, things are going to go wrong sometimes. It’s not the end of the world", "score": 1, "replies": [{"body": "It’s not, that’s why the price adjust. When a stock is priced for perfection, anything that spoils that perfections will have to be reflected in the price.", "score": 1, "replies": []}, {"body": "Wherever there are human beings things can go wrong, but a delay is still a bad thing. It's cultish behavior to try to relativize and give excuses for everything even remotely bad that happens to Nvidia, sometimes it's important to call things out for what they are.", "score": 0, "replies": []}]}, {"body": "And with any delay, they have to execute perfectly to meet the expected eta. Any more snags and it’ll keep dragging…hence more revenues lost and more time for competitors to catch up.", "score": 0, "replies": []}]}, {"body": "Lost of revenue.\n\nWhat’s wrong with you getting this week’s paycheck 5 months from now? And all other paychecks follows that one", "score": 0, "replies": []}, {"body": "It isn’t.  But that isn’t the problem.  NVIDIA stock has made all their core engineers rich and they have fuck you money.   A lot of them had said fuck you and quit or are phoning it in.", "score": 0, "replies": [{"body": "I know I would", "score": 1, "replies": []}]}]}]}
{"title": "NVDA How many of my friends bought in below the 100 price? Target 120? Downward bounce or reversal?", "selftext": "[removed]", "id": "1elbsv2", "created_utc": 1722930177.0, "score": 6, "upvote_ratio": 0.8, "num_comments": 16, "comments": [{"body": "Grabbed at 95. Its prob gonna go down again or hover around 100 till rate cuts.", "score": 3, "replies": [{"body": "nvda There will be a small bounce move.Short term target 110\n\nThis is a community of master traders sharing strong stocks daily, join if you like!https://lihi.cc/DGzom", "score": 1, "replies": []}]}, {"body": "A few executions of commons, calls and NVDL at $94.", "score": 2, "replies": [{"body": "Sell at 110 and realize the profit.\n\nThis is a community of master traders sharing strong stocks daily, join if you like!https://lihi.cc/DGzom", "score": 0, "replies": [{"body": "Jog on. I've been in since 2018. The road is long.", "score": 2, "replies": []}]}]}, {"body": "Small amount at 95. Feel I did well because was only at that price start of the day.", "score": 1, "replies": [{"body": "Target 110.", "score": 1, "replies": []}]}, {"body": "I think it will go down again. Aug-Oct are typically red.", "score": 1, "replies": [{"body": "Bruh, why didn’t you tell me? I would have sold.", "score": 1, "replies": [{"body": "Past performance does not guarantee future results. It can still go up.", "score": 1, "replies": [{"body": "You telling me he’ll stop punching me one day and give me flowers instead?", "score": 2, "replies": []}]}, {"body": "Target 110.", "score": 1, "replies": []}]}]}, {"body": "Bought at 97 but I think it will go down more this week/next week", "score": 1, "replies": [{"body": "Short-term target 110 Sell", "score": 1, "replies": []}]}]}
{"title": "The Wyckoff Method and Wall Street Pushing You Out", "selftext": "[The Wyckoff Method](https://www.investopedia.com/articles/active-trading/070715/making-money-wyckoff-way.asp) Is what I like to call Wall Street Pushing you out of positions making people fall into margin calls and selling, stocks. Who are you selling them to? Who is buying the shares at a discount? Funds that didn't have NVDA at 6.15% of their portfolio. They need to accumulate the stock. Hedge funds that didn't get in or shorted it down.  Wyckoff describes the accumulation and distribution phases of a stock, everyone that is holding NVDA should read and understand this method because that is what is happening. Seek out other links on the Wyckoff Method. ", "id": "1elgb6p", "created_utc": 1722946846.0, "score": 47, "upvote_ratio": 0.98, "num_comments": 17, "comments": [{"body": "It often amazes me to see so many individual retail investors try to engage in technical analysis and short term trading when it's increasingly harder for individuals to successfully trade short term and increasingly easier to invest long term.  Whatever edge or technical analysis you think you discovered, \"smart money\" already knows, knows a lot more, and have the means and ability to execute it with far greater speed, discipline, and precision than you.  On the contrary, smart money do not have the benefit of allowing static boring winning portfolio to continue growing unmolested.  People are out there crawling through broken glass in search of a 20 dollar bill when there's a 10 dollar bill waiting on a table next to them.  It's mind boggling.", "score": 27, "replies": [{"body": "Well put…thx.", "score": 2, "replies": []}, {"body": "Damn that's wise. Open a private fund with me.", "score": 1, "replies": []}]}, {"body": "100% true but very few people are aware of these phases. It’s all driven by institutional volume", "score": 19, "replies": []}, {"body": "If you trade with margin you should have a lot of cash on your broker account that would prevent a margin call, based on the range like somewhere between -10 to -15%", "score": 3, "replies": [{"body": "I use margin on my trading account, yesterday if Schwab wasn't so busy with their other problems, I wonder if I would have been called.   \n  \nI made some money ready to move in if I needed to, but just sat tight for the day waiting. \n\nToday is a much different story, selling calls to generate cash is much more preferred.", "score": 5, "replies": [{"body": "Luckily I have NVDA on NQ and TDG it saved me from margin call. But I am derisking towards QQQ a bit, still risky but no 15% movement. Yes they Are probably understaffed for these events.", "score": 2, "replies": []}]}]}, {"body": "good post, solid content. thanks.", "score": 2, "replies": []}, {"body": "Welp the method worked on me.. I panic sold shortly after the dip begin, I did actually, for a split second think: wait who’s buying this?? Now makes sense", "score": 1, "replies": []}, {"body": "Funny post… Moral of the story is don’t be a greedy fuck and trade on a leverage account if you don’t know how to manage your portfolio for unexpected risks or keep enough capital to cover a margin call. Folks need to pull up their tighty whities and act like an adult who responsible for THEIR decisions. Also most stocks/NVDA have a maintenance requirement of only 30% unless you over leverage on a stock so simple answer, don’t lose more than 20% of your portfolio. \n\nAlso it’s not hard to trade on a cash account either… Do that, problem solved!", "score": 1, "replies": []}, {"body": "I asked my broker about Wyckoff\n\nHe said he prefers assistance to rub one out", "score": 1, "replies": []}, {"body": "So basically Markdown period is here!  Yay!", "score": 1, "replies": [{"body": "Or over....", "score": 3, "replies": []}, {"body": "More like correction period", "score": -1, "replies": []}]}, {"body": "When you start seeing posts \"should I sell now and wait?\" That's when you know to buy.", "score": 1, "replies": []}]}
{"title": "Pricing NVDA LEAPS", "selftext": "My brokerage (Fidelity) doesn't have a good pricing chart for current options. It has a P/L chart, but only for newly purchased options.  I wanted to get an idea of how far I was in my LEAPS from break even and eventually making money on them.  What I learned was that the P/L curve (line actually, it's a linear function) isn't appreciably different from a new option priced the same way for LEAPS, presumbably because theta decay is not material until about 4 months prior to expiration.  Here's the results for four of my LEAPS.  Python code is attached if you want to use it to price options.  It uses Black Scholes and you can look up the risk free interest rate and volatility (notably, the 100th percentile right now.  Embrace the roller coaster :).\n\nThe only one I'm even remotely concerned about is the lower right expiring in Dec 2025.  I'm not 100% confident we'll get to $138 before next July when theta decay starts to impact the function.\n\nhttps://preview.redd.it/p4cvc06ti1hd1.png?width=1253&format=png&auto=webp&s=4f546ac1ab102e646c38878f8248a36d520923a7\n\n    import numpy as np\n    import matplotlib.pyplot as plt\n    from scipy.stats import norm\n    \n    # Black-Scholes formula for call option price\n    def black_scholes_call(S, K, T, r, sigma):\n        d1 = (np.log(S / K) + (r + 0.5 * sigma ** 2) * T) / (sigma * np.sqrt(T))\n        d2 = d1 - sigma * np.sqrt(T)\n        call_price = S * norm.cdf(d1) - K * np.exp(-r * T) * norm.cdf(d2)\n        return call_price\n    \n    # Option parameters\n    S = 100.45  # Current price of NVDA\n    r = 0.03786  # Risk-free interest rate (3.786%)\n    sigma = 0.88  # Implied Volatility (88%)\n    \n    # Option details\n    options = [\n        {'strike': 90, 'price': 41.70, 'T': 2.37, 'label': 'NVDA 90 - Dec 18, 2026'},\n        {'strike': 97, 'price': 38.90, 'T': 2.37, 'label': 'NVDA 97 - Dec 18, 2026'},\n        {'strike': 110, 'price': 34.12, 'T': 2.37, 'label': 'NVDA 110 - Dec 18, 2026'},\n        {'strike': 113, 'price': 24.75, 'T': 1.37, 'label': 'NVDA 113 - Dec 19, 2025'}\n    ]\n    \n    # Generate a range of underlying prices to plot the profit/loss curve\n    S_range = np.linspace(50, 250, 100)\n    \n    # Plot the profit/loss curves\n    plt.figure(figsize=(15, 10))\n    for i, option in enumerate(options):\n        call_prices = [black_scholes_call(S, option['strike'], option['T'], r, sigma) for S in S_range]\n        profits = [(max(0, S - option['strike']) - option['price']) / option['price'] * 100 for S in S_range]\n        break_even_price = option['strike'] + option['price']\n        \n        plt.subplot(2, 2, i + 1)\n        plt.plot(S_range, profits, label=option['label'])\n        plt.axhline(0, color='black', linestyle='--', linewidth=1)\n        plt.axvline(break_even_price, color='red', linestyle='--', linewidth=1, label=f'Break-Even Price: ${break_even_price:.2f}')\n        plt.xlabel('$NVDA Price at Expiration')\n        plt.ylabel('Profit/Loss (%)')\n        plt.title(option['label'])\n        plt.legend()\n        plt.grid(True)\n    \n    plt.tight_layout()\n    plt.show()", "id": "1elgxte", "created_utc": 1722948643.0, "score": 8, "upvote_ratio": 0.9, "num_comments": 23, "comments": [{"body": "If you're not confident, buy shares", "score": 5, "replies": [{"body": "To clarify, I'm confident enough in the stock to buy LEAPS > 2 years to expiration.  I'll admit...I f'd up and bought expiring in Dec 2025, not Dec 2026 like the others I showed.", "score": 2, "replies": [{"body": "I bought Jan 2026 $60 when we were $60 [split adjusted] made big money. Then rolled to June 2026 $100C when we were in the $140s", "score": 1, "replies": [{"body": "Ive never rolled one. What is the difference between simply closing the position and rolling to a new strike price?", "score": 2, "replies": [{"body": "Closing is simply that. Sell and you take profit or loss. \n\nRolling takes your cash and applies it to a new position \n\nSay you bought a $Dec 90C for $10. It's now $20\n\nYou close you get $20\n\nYou want to close your Dec 90C and buy a Jan $100.\n\nJanuary 100 is out of the money and costs $10. \n\nYou can roll 1 Dec 90 - -> 2 Jan $100. Your account will show 2 Jan 100C. Whatever cash if any in the account doesn't change. It will count as a $10 capital gain for tax purposes, if applicable", "score": 2, "replies": []}]}]}]}]}, {"body": "I also use fidelity to trade. Hit me up if you want a trading buddy.", "score": 1, "replies": []}, {"body": "My key is to go way further out. I've got 2000 shares, in the form of leaps, with a 1/2026 and 12/2026 expiration. Can't wait for the new leaps in September so I can buy the 2027's", "score": 1, "replies": [{"body": "Yeah, 3/4 on this chart are for Dec 2026.", "score": 1, "replies": []}]}, {"body": "You don’t think we’ll see 138 by July 2025? Lol it’s not going to take that long to at least touch and give you an opportunity to roll out in my opinion. Are you selling 45 DTE calls against these to reduce cost basis?", "score": 1, "replies": [{"body": "I think we will, but I don’t know. I think we’re going to languish for a while.", "score": 1, "replies": [{"body": "I am honestly hoping for that over massive run ups and crashes. I’ve sold 150 calls 45 DTE for around 17k premium so far. Sold those when we were at $125. Going to sell in the 160-70 range when IV ramps up around earnings, as long as we don’t crap the bed before then.", "score": 1, "replies": []}]}, {"body": "What is 45 DTE?", "score": 1, "replies": [{"body": "45 Days to Expriation", "score": 1, "replies": [{"body": "I realized after I asked 🙆but thank you. If I am understanding your comment correctly, you asked whether that person was selling covered calls against the leap position? I routinely sell covered calls against stock positions in my portfolio and I do have December 2025 leaps but I wasn't aware you could sell a covered call against the leap, thanks for any help, I really appreciate it", "score": 1, "replies": [{"body": "Check out poor man covered call strategy. You can build a diagonal by selling a call that is far above your calls strike price. For example I have $120 and $130 calls, and when NVDA was in 120-130 range, I was selling $150 calls against those calls for premium.\n\nThe reason for this is that as your call is in the money approaching 1 delta, for all practical purposes you do have exposure to 100 shares.", "score": 1, "replies": [{"body": "Soooo, assuming it ever got exercised, you, as the seller, would have to supply the shares, correct?", "score": 1, "replies": [{"body": "No reason to let it get exercised. The in the money call provides exposure to the movement of 100 shares per call. If the price approaches the strike you can just roll out or cover that leg and still profit", "score": 1, "replies": [{"body": "For example. Right now if NVDA suddenly rallied to $150, I would make approximately between 100-135,000 on 45 calls that I’ve sold 150 calls against. If I didn’t want to be assigned on the sold calls I would cover or roll out with a higher strike by buying those back and selling 165 or 170 calls. Might lose some premium from the PMCC that way but not a substantial loss in comparison to gain from the ITM calls", "score": 1, "replies": [{"body": "I think it's time for me to advance my options trading education. I will have to do some research to locate the person who was my favorite video educator for options trading, which I will do. Any chance you have any recommendations for learning more advanced strategies? Thanks very much for your help - I really do appreciate it- because those aren't pennies you were talking about", "score": 1, "replies": [{"body": "honestly join and learn from r/thetagang and you can YouTube theta strategies as well as poor man covered call strategy. You can also check out “wheeling” strategy. Theta and wheeling go hand in hand and are meant for stocks that may trade sideways for extended periods. Poor man covered call is a bullish strategy. Selling cash secured puts is a bearish strategy.", "score": 2, "replies": [{"body": "👍👍👍👍", "score": 1, "replies": [{"body": "Joined, thank you!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "THANK YOU!", "score": 1, "replies": []}]}
{"title": "NVDA dropping a lot lately, anyone know why? ", "selftext": "", "id": "1elrfwq", "created_utc": 1722974129.0, "score": 0, "upvote_ratio": 0.14, "num_comments": 16, "comments": [{"body": "because i bought it today at $107", "score": 10, "replies": [{"body": "Why didn’t you buy at $92 yesterday? 🤣", "score": -2, "replies": [{"body": "My idea was that it would go down to 93 again and then go up to 110 at closing time, it went down to 100 ish and up to 107 instead, the week isnt over tho", "score": -1, "replies": []}]}]}, {"body": "Smci ER today post mkt", "score": 5, "replies": []}, {"body": "Wait stocks drop? 😬", "score": 3, "replies": []}, {"body": "What?!!", "score": 2, "replies": []}, {"body": "Um, shit happens…", "score": 2, "replies": [{"body": "True! Lol", "score": 1, "replies": []}]}, {"body": "It needs to drop so it can go up again", "score": 3, "replies": []}, {"body": "VIX is rebounding. It went from 22 to 25🙄", "score": 1, "replies": []}, {"body": "Mb, I had to sell some shares.", "score": 1, "replies": []}, {"body": "It’s the same reason for why it has gone up a lot this year. Nvidia’s valuation is based on revenue from future AI growth, which is speculative and higher risk in nature. This translates to volatility, both up and down.", "score": 1, "replies": []}, {"body": "Yeah I know why. Subscribe to my website or you can’t get past my paywall", "score": 0, "replies": []}]}
{"title": "AMD & Samsung might benefit from Blackwell delays", "selftext": "Thoughts?", "id": "1elwm3e", "created_utc": 1722986861.0, "score": 5, "upvote_ratio": 0.58, "num_comments": 13, "comments": [{"body": "lol no. Even with delays for a full year you can’t beat 30X performance.", "score": 15, "replies": [{"body": "They'll still benefit but Nvidia will still be dominant. I bought amd last week. Even though Nvidia will have a majority of the market share. Big companies are going to diversify and still buy some other chips just to keep their options open. And give them some leverage when negotiating with Nvidia on price.", "score": 1, "replies": [{"body": "Hey man I get it, AMD AI is there to fill the gap, so more gap means more filler. 😇", "score": 1, "replies": []}]}, {"body": "Its about sales, if this was ever only about performance AMD would be sky rocketing this year, it isn’t, cause of sales.", "score": 0, "replies": [{"body": "Except it is about performance, you have to use AMDs GPU optimization stack in order to efficiently utilize the datacenter, and their software is dogshit compared to Nvidia. \n\nThey’re doing what, 7.5x less in datacenter revenue this quarter alone compared to Nvidia? The performance leads to the sales, not the other way around.", "score": 0, "replies": []}, {"body": "lol yeah sales…. Which NVDA has most of it. Gaming is down brother, a good Ryzen can only go so far.", "score": 0, "replies": []}]}]}, {"body": "Whoever wrote this is completely clueless", "score": 3, "replies": []}, {"body": "Total bullshit, NVDA is already sold out, this will only be a slight delay in shipments.", "score": 3, "replies": []}, {"body": "If you are in the industry as I am, you know how far behind other players are. When I say behind I mean like 2-3 years behind. \n\nCan AMD sell to small guys? Sure. They may not need hopper or Blackwell performance. But if you are a mega cap or big player, are you going to buy chips that have half the performance when your competitors are buying the premier chips? \n\nSorry but the performance is not a gap that can be closed in a few months. And it’s not like NVDA is going to sit on their hands while others catch up. The acceleration continues as they launch chips every year.", "score": 3, "replies": []}, {"body": "Why are people still posting these bullshit rumors? NVDA stated they were on track with releasing their new chip by end of the year and that was it. They never gave a date nor stated how many units will be in the first shipments. Until they make a statement during their next ER forecast or an actual credible publication (NOT trendforce.com) reports something different, its a nothing burger to me… \n\nAlso who gives a shit if they don’t ship in Dec vs Jan/Feb? Not like any Big Tech company is going to start any major projects while folks are on holiday and Dec is just keep the lights on for pretty much most IT departments.  Things wont ramp up until people return to work around end of Jan.", "score": 1, "replies": []}, {"body": "“they might” based on a rumor", "score": 1, "replies": []}]}
{"title": "Yesterday was the biggest change from the previous days close to the days high in the history of the VIX.", "selftext": "", "id": "1ellwtx", "created_utc": 1722960906.0, "score": 65, "upvote_ratio": 0.93, "num_comments": 20, "comments": [{"body": "Nothing to see here people, everything is back to normal. Move along!", "score": 10, "replies": []}, {"body": "The only other day that compares is january 27th, 2021, and we all know what happened after that.", "score": 21, "replies": [{"body": "> january 27th, 2021\n\nWhat happened?", "score": 13, "replies": [{"body": "GME 🚀", "score": 16, "replies": [{"body": "This time it is $MAXN", "score": -7, "replies": [{"body": "No, it’s down 99% all time, it’s already dead", "score": 1, "replies": []}, {"body": "How come?", "score": 0, "replies": []}]}]}]}, {"body": "January 28th 2021?", "score": 3, "replies": []}]}, {"body": "Read that RBC said in a note that 1Y forward returns for S&P 500 are positive when the VIX is above 35.\n\nIt will be interesting to see what unfolds if it climbs higher. Looks like we're at 24ish right now.", "score": 8, "replies": []}, {"body": "Bought puts on it as soon as the market opened, looks like easy 200% gain.", "score": 4, "replies": []}, {"body": "Are you sure? What about XIVmageddon? \n\nThat day the $VIX (actually the first and second month $VIX futures) got popped so high that it triggered the 75% loss rule in the inverse-$VIX ETF XIV, which made the ETF automatically shut down. And it was apparently all done just to wipe out one guy who had a long XIV position.", "score": 3, "replies": [{"body": "I mean a change and not % change so that it’s essentially the biggest change in future volatility expectations from previous day close to the high of the day. I ran a program in Java which tested it and yesterday came up as the highest ever.", "score": 1, "replies": []}]}, {"body": "What was the right trade in hindsight on this?", "score": 1, "replies": [{"body": "The right trade is to sell at the highest and buy at the lowest.\n\nBut you can't possibly know when and where is the highest or lowest, so best not to guess and stick to your strategy.", "score": 2, "replies": []}, {"body": "UVIX calls did well. ", "score": 1, "replies": []}, {"body": "Do nothing.", "score": 1, "replies": []}]}, {"body": "A natural reaction to the fear mongering we are all bombarded with on a minute by minute basis via the media?\n\nTerrorism: \"An act to create fear with the sole purpose of controlling by fear.\"\n\nThe biggest terrorist organization in the world is the Media.", "score": 1, "replies": []}, {"body": "Somebody pleasece0lain the cables bars ... each candle is one transaction? Or many? Takes part over time constantly so in that frame of tome goes up or down in that proportion but are made of many transactions or only one????", "score": 0, "replies": [{"body": "The candle is representative of a period of time. In this case, each candle probably represents 1 day. The \"wick\" is the line that comes from the top and bottom. This \"wick\" shows the high and low prices of the candle. The middle square shows the open and the close. If the candle is green, the closing price was above the opening price. Vice versa for red. These rules stay the same no matter what timeframe each candle represents.", "score": 3, "replies": [{"body": "Crystal Water ... i really appreciate thank you for your time 🙂", "score": 2, "replies": []}]}]}]}
{"title": "Nvidia’s Next-Generation AI Chip Rollout Slowed by Engineering Snags", "selftext": "\n\n> Nvidia Corp. hit engineering snags in the development of two new advanced chips, slowing the release of some products designed to extend its lead in the market for artificial intelligence computing.\n\n> The delays affected the company’s highly anticipated Blackwell lineup, which Nvidia announced in March.\n\n> A version of the chip — known as an AI accelerator — is being reworked to better work with data center infrastructure designed for an earlier chip, the Hopper H100. \n\n> Separately, a product that combines a processor with a graphics chip won’t be available in large numbers as quickly as hoped because of problems with supporting technology.\n\n\nsource: https://www.bloomberg.com/news/articles/2024-08-06/nvidia-nvda-blackwell-ai-chip-rollout-slowed-by-engineering-snags", "id": "1el4crm", "created_utc": 1722905313.0, "score": 49, "upvote_ratio": 0.76, "num_comments": 20, "comments": [{"body": "This tells me the initial report by the information was true", "score": 26, "replies": []}, {"body": "What does it say behind the paywall? \nIs Bloomberg reporting this independently with confirmation from the company ot does it just say \"according to reports.\"", "score": 9, "replies": [{"body": "[archive.ph](http://archive.ph) is your friend", "score": 9, "replies": []}]}, {"body": "They should be rewarded for this diligence. Intel would have ignored flaws and allowed the underlying process that enabled it to propagate.", "score": 35, "replies": [{"body": "For the younger crowd, this is like how Metroid Prime 4 got delayed. At the end of the day it means they're focused on quality and the guarantee of providing a good product, rather than their public perception being spotless. It's a good thing.", "score": 1, "replies": [{"body": "Not guaranteed. Cyberpunk also got delayed 3 times in the year it came out. We all know the rest.", "score": 4, "replies": [{"body": "In a way, I both dread and am morbidly curious of a world where the delays didn't happen. Almost intrigued by just how bad it must have been like to ship it without delays. 😅", "score": 2, "replies": []}, {"body": "Cyberpunk was actually delayed until the DLC released.", "score": 1, "replies": []}, {"body": "It just turned out to be one of the master pieces of story telling that people have a chip on their shoulder about.", "score": 1, "replies": []}]}]}, {"body": "Nice meme", "score": -5, "replies": []}]}, {"body": "Did Bloomberg update their article or something? Because according to this link there's an important sentence missing:\n\n\n>The delays affected the company’s highly anticipated Blackwell lineup, which Nvidia announced in March, according to people familiar with the situation. A version of the chip — known as an AI accelerator — is being reworked to better work with data center infrastructure designed for an earlier chip, the Hopper H100.\n\n> **That’s a relatively small segment of the market**, though, said the people, who asked not to be identified because the matter is private. Separately, a product that combines a processor with a graphics chip won’t be available in large numbers as quickly as hoped because of problems with supporting technology, they said. (Source: [Archive](https://archive.ph/rkV78))\n\nThe article didn't give any indication that it had information beyond the other article we already know about:\n\n>The snags — first reported by the Information website — reflect the challenges of speeding up the pace of innovation at Nvidia", "score": 3, "replies": []}, {"body": "Will just create a bigger, longer demand … extends profits even longer … These companies are on backorder for 6 months on their current version … Apple has made a killing over the years delaying release of new versions … getting every penny out of their older version before releasing the new one.", "score": 9, "replies": [{"body": "Until customers realise their huge capex investment in ai is far too much and not producing the roic needed, they then scale back and Nvidias demand drops off", "score": 7, "replies": [{"body": "yeah. Buy puts, but with at least 2 years expiration date. They will go down, back to healthy levels, pretty spectacularly, but it can take time", "score": -1, "replies": []}]}]}, {"body": "With people like https://www.thenationalliteracyinstitute.com/post/literacy-statistics-2024-2025-where-we-are-now#:~:text=On%20average%2C%2079%25%20of%20U.S.,below%205th%2Dgrade%20level). good luck", "score": 2, "replies": []}, {"body": "are you sure it wasnt marketing snugs?", "score": 2, "replies": []}, {"body": "Even tough NVDA trading at high premiums, there are traders buying with hope it will again rise another 100% by end of the year.", "score": 2, "replies": []}, {"body": "Not surprised. As design complexity doubles, verification scope quadruples. Every company is finding that it's getting harder and harder to have first pass success", "score": 1, "replies": []}, {"body": "NVDA employees are now super rich, not surprising they lose a little bit of focus to execute", "score": 1, "replies": []}]}
{"title": "These are the stocks on my watchlist (8/6)", "selftext": "Hi! I am an ex-prop shop equity trader.\n\nThis is a daily watchlist for trading: I might trade all/none of the stocks listed, and even stocks not listed! I only hold MAG7/market indices long-term. If you use Old Reddit, click “Show Images” at the top to expand the charts. Any positions stated aren’t recommendations, I’m following subreddit rules to disclose positions.\n\nSome stocks I post may be <$500M market cap. These are potentially good candidates to day trade; I have no opinion on them as investments. PLEASE ask specific questions. Questions like “Thoughts on \\_\\_\\_\\_\\_?” or “Is \\_\\_\\_ a good investment?” will be ignored or I’ll troll you unless you add detail and your own opinion. I will block you if you are a troll.\n\nNews: [$6.4 Trillion Stock Wipeout Has Traders Fearing ‘Great Unwind’ Is Just Starting](https://www.bloomberg.com/news/articles/2024-08-05/-6-4-trillion-wipeout-sows-fear-great-unwind-is-just-starting)\n\n* [**NVDA**](https://finviz.com/quote.ashx?t=NVDA&p=d) - Lot of excellent movers, my favorite one yesterday was NVDA. Long from $96 cost basis (original was 93). Was very confident in a bounce yesterday, but not sure if I’m confident that we’ll surge off the open like yesterday. Other semi-related stocks/ETFs I’m watching: **AMD**, **ARM**, **MU**, **SOXL**, **NVDL**\n* [**UBER**](https://finviz.com/quote.ashx?t=UBER&p=d) - Reports 0.47 vs 0.31 expected EPS, revenue of 10.7B vs 10.6B expected. Guidance is fairly in line with future expectations, and cited strong demand for services.\n* [**INTC**](https://finviz.com/quote.ashx?t=INTC&p=d) - We saw a move in this at the open yesterday that had a pretty huge selloff (close to 5% when the other semi-stocks were pretty resilient and recovered some of their move, will likely be looking at this off the open to see if this sells off again.\n* [**PLTR**](https://finviz.com/quote.ashx?t=PLTR&p=d) - Revenue guidance raised to $2.74B and adjusted operating income raised by $80M more than expected. This earnings was significant due to CFO alluding to possible inclusion in SP500. EPS of 0.06.\n* [**EWJ**](https://finviz.com/quote.ashx?t=EWJ&p=d) - Japan ETF. Solely worth watching because so much of the current move is happening overnight in Asian markets.\n\nEarnings I’m watching: **ABNB**, **RIVN**, **RDDT**", "id": "1elhgxp", "created_utc": 1722950021.0, "score": 32, "upvote_ratio": 0.73, "num_comments": 16, "comments": [{"body": "PLTR seems to be the ever growing \"next best thing\" people are looking for. Now with the middle east AND south china sea being hotspots and its software used by DoD.\n\nBeen a good year. Bought in at 12$ sold at 17. Bought in again at 21. Holding long.", "score": 20, "replies": [{"body": "Nice job! I remember looking at it at like $10 and not buying, how I regret it lol. Peter Thiel is pretty controversial but everything he touches turns to gold", "score": 6, "replies": []}]}, {"body": "Are you expecting a INTC rebound eventually?", "score": 6, "replies": [{"body": "Not anymore after seeing the open- I expected a sharp selloff, but it looks like it's just bleeding slowly and stuck the landing- I chose to go long NVDA instead.", "score": 4, "replies": []}, {"body": "Yea I’d cut my losses (hopefully not more than the 35%) and throw that into nvda if you’re still bullish on chips.  It will take years before a real recovery and/or a catastrophic event in Taiwan to change the dynamic.  To cut the dividend is pretty serious, they should have done it a long time ago tbh, but we will see.  The selling will continue with ETF’s and certain hedge and retirement funds due to dividend cut.  I wouldn’t ride it out if it’s over 5% of your portfolio(or used to be).  FYI I’m invested in them too but very little, 20 shares now only worth 400.", "score": 2, "replies": []}]}, {"body": "INTC may not recover anytime soon with the whole defective processor fiasco going on right now. I would wait until this whole situation is just about sorted out", "score": 8, "replies": [{"body": "Yep. Definitely a wait and see situation for me right now", "score": 3, "replies": []}]}, {"body": "Just get a ETF", "score": 3, "replies": [{"body": "Just quit smoking", "score": 3, "replies": [{"body": "I thought the standard was to get ETF", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "No problem. It seems to be the way around here, lol. \n\nr/smoking is where I hang more.", "score": 0, "replies": [{"body": "I'm loving the meat on there lol, I subbed", "score": 2, "replies": [{"body": "lol, They have some good meat over there.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "RDDT price action is interesting, to say the least. Any overall thoughts on what we are seeing? Do you think the reaction is just the capricious nature of after hours movement or something more significant?", "score": 1, "replies": [{"body": "On Reddit? Seems like they reported less of a loss than analysts expected but it's nothing out of the ordinary (to me). Personally I think it's ridiculously overvalued.", "score": 1, "replies": []}]}]}
{"title": "What are some Good stocks to buy now the crash has started", "selftext": "[removed]", "id": "1eloj3l", "created_utc": 1722967167.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 15, "comments": [{"body": "Sorry -- we removed your message on /r/stocks because generic posts like \"I have $XXX to invest, what should I do,\" etc. because they are low-effort and asked on a daily basis in /r/stocks. Please do some basic research first and feel free to come back with any specific questions about a stock, company or market environment afterwards.\n\nIf you're just getting started, please check out our New Investor wiki: https://www.reddit.com/r/stocks/wiki/index\n\nThings you can do:\n\n1. Read the wiki which has tons of information, including reputable learning resources, broker information, and links to useful reddit posts (including old posts similar to yours)\n\n2. Search the subreddit history for similar information\n\n3. You can post questions like this as a comment on our [daily discussion stickied thread](https://www.reddit.com/r/stocks/search?q=%22r%2FStocks+Daily+Discussion%22&restrict_sr=on&include_over_18=on&sort=new&t=week)\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}, {"body": "50…thousand?", "score": 8, "replies": [{"body": "No as in £50, it isnt much but I dont have much cash to spare and im just trying to build up something over time", "score": -1, "replies": [{"body": "Mate, just stick it in savings, or premium bonds. It's great to invest, but, it's such a small amount that I'd recommend either averaging into an ETF over time, or, just sticking it in a savings account.", "score": 6, "replies": []}]}]}, {"body": "What crash?", "score": 9, "replies": [{"body": "Came to say the same thing , what crash? \nPeople needed to know this is nothing to what is to come , YouTubers will use a 1 % drop to just pull in more views to get them pockets heavy.", "score": 2, "replies": []}]}, {"body": "If you’re not knowledgeable about stocks it’s best to stick to broad index funds", "score": 2, "replies": [{"body": "I have a decent understanding of the stock market I just havent had a chance to look at the crash too much thanks to other obligations, I'm ignoring FOMO and only being willing to put the small amount in I can afford without getting too caught up in things", "score": 0, "replies": [{"body": "If you’re calling this a crash, you don’t have a decent understanding of the stock market. \n\nMy current best stock under £50 is MAT which had a big jump on news of a buy offer. I’ve sold 2/3 of my stake following that news, and I wouldn’t advise buying it. Happy hunting", "score": 5, "replies": []}]}]}, {"body": "Crash ended hold the line", "score": 2, "replies": []}, {"body": "My guy, if you are worried about a bubble with your $50 maybe you should focus on something else besides stocks. I hate to sound like a dick but that is practically nothing. If you just don't want the headache buy $50 worth of S&P, add to it when you can and relax.\n\nAlso this is a correction, it is far from a crash. If it did this every day for a month or several months, that would be a crash. Just consider this a small dip to buy a stock you like. I bought some more NVDA yesterday because they are my favorite stock.", "score": 1, "replies": []}, {"body": "buy yourself a nice dinner", "score": 1, "replies": []}, {"body": "Vanguard's total world stock etf (VT) might be a nice core position to start building. Not trying to be rude, but it might be worth focusing/learning more about personal finance if you are thinking about £20. You should probably get to a point where you can invest that much every day, if not more.", "score": 1, "replies": []}, {"body": "Baba", "score": 0, "replies": []}, {"body": "I mean, with that level of investment whatever. Personally I'm more bullish on AMD than Nvidia, but, whatever; it's 50 quid.", "score": -1, "replies": []}]}
{"title": "Recession won't happen", "selftext": "[deleted]", "id": "1elqabc", "created_utc": 1722971287.0, "score": 0, "upvote_ratio": 0.23, "num_comments": 20, "comments": [{"body": ">I'm new to trading, but I know what the FED is gonna do next!", "score": 40, "replies": [{"body": "*Watches Jim Cramer once*\n\n\"OK SO IT'S GONNA BE A SOFT LANDING\"", "score": 4, "replies": []}]}, {"body": "The conclusion that the panic selling was due to unemployment number or Fed reluctance to cut rates is not necessarily correct.\n\nThe Bank of Japan move to raise interest rates had a lot more to do with the recent selling than anything else, forcing liquidation of many positions purchased with cheap Yen.\n\nAlso note, history suggests just prior to the first rate cut, and during the initial phase of the cutting cycle, the stock market generally underperforms.", "score": 12, "replies": [{"body": "I agree, OP is being simplistic. They're all correlated -- the Bank of Japan, unemployment data, interest rates, Warren Buffet, potential wars, general panic, and an AI bubble that's leading to overpriced stocks, with recent earnings reports that don't prove its valuation. See [here](https://borncrisis.com/blog/nikkei-index-downturn-and-the-american-stock-market/). \n\n\nMaybe the market will continue to outperform; hell, the market is irrational most of the times. However, zooming out -- after a monthly downward trend, does everyone think it's just overall bouncing back immediately after hearing news about the unwinding of the carry trade and getting some disappointing earnings reports? I call a bull trap today, but I could be wrong. ", "score": 4, "replies": []}, {"body": "I may be wrong then\n\nWasn't the unemployment rate what cause panic selling to begin and then the BOJ rate increase further increase the selling", "score": -5, "replies": [{"body": "The rate cut came Wednesday, the selling ensued Thursday and continued Friday after the unemployment number came out.\n\nThe Yen carry trade has been a very popular strategy for professionals to borrow money at near zero interest rates and put that money to work in equities. The historic drop in the Japanese stock market was clearly triggered by this, and then spread to the world.\n\nThat said nobody can no for sure what went through people's minds when they hit the sell button. I agree with you that fear of a recession is overblown. Nevertheless, the damage has been done, and the stock market needs time to heal, if not further price declines, to get back on solid footing.\n\nI believe it is highly likely the market will remain unsettled for many weeks as this bout of selling is digested. Despite what happened, the market has simply experienced a 10% correction and did not test or undercut the most recent lows in April. While the fireworks show is spectacular, the result is quite ordinary and expected.", "score": 1, "replies": []}]}]}, {"body": "Anyone who can accurately predict whether and when recessions occur can become unfathomably wealthy. Best of luck to you on this potential outcome.", "score": 4, "replies": []}, {"body": "first time in the trading game?", "score": 3, "replies": []}, {"body": "Lol starts with new. But knows all the answers", "score": 2, "replies": []}, {"body": "dead cat bounce", "score": 2, "replies": []}, {"body": "RemindMe! 3 Months", "score": 1, "replies": [{"body": "I will be messaging you in 3 months on [**2024-11-06 19:44:33 UTC**](http://www.wolframalpha.com/input/?i=2024-11-06%2019:44:33%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1elqabc/recession_wont_happen/lgtnsea/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1elqabc%2Frecession_wont_happen%2Flgtnsea%2F%5D%0A%0ARemindMe%21%202024-11-06%2019%3A44%3A33%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201elqabc)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": ">Im new to trading\n\nAnd you still made the post ? Lol", "score": 1, "replies": [{"body": "Just a theory. I wanted to see if it had some foundation to it. mb :(", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Trolling, insults, or harassment, especially in posts requesting advice, is not tolerated.  Please try to keep discussions on /r/stocks civil by providing straightforward responses without including any insults or harassment.\n\nContinual abuse of /r/stocks rule #5 regarding trolling, insulting and harassment will result in your account being banned.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 0, "replies": []}]}]}]}, {"body": "https://fred.stlouisfed.org/graph/?g=hgMc \nGrey area is recession, is only one chart but it seems likely to me", "score": 0, "replies": []}, {"body": "Thanks for stating you are new to trading in the first sentence. Saved me a read.", "score": 0, "replies": []}, {"body": "My opinion is a recession won't happen because the acting president/presidential party would not be re-elected if that is the case. A recession would not be allowed at this time.", "score": -1, "replies": [{"body": "If recessions could be prevented with certainty, its likely we'd never have one.", "score": 1, "replies": []}]}]}
{"title": "What is the ideal transaction fee for me", "selftext": "[removed]", "id": "1elqja4", "created_utc": 1722971899.0, "score": 3, "upvote_ratio": 0.67, "num_comments": 12, "comments": [{"body": "Sorry -- we removed your message on /r/stocks because you are asking for the type of information we try to address in our wiki: https://www.reddit.com/r/stocks/wiki/index\n\nGeneric posts like \"how do I get started with stocks,\" \"how do I find a broker,\" \"where can I learn more about investing,\" \"I have $XXX to invest, what should I do,\" etc. are removed because they are low-effort and asked on a daily basis in /r/stocks.\n\nThings you can do:\n\n1. Read the wiki which has tons of information, including reputable learning resources, broker information, and links to useful reddit posts (including old posts similar to yours)\n\n2. Search the subreddit history for similar information", "score": 1, "replies": []}, {"body": "I live in a third world country too. Cant you save your money in USDT until you archieve the necessary money to make the fee very little?", "score": 3, "replies": []}, {"body": "This seems way too expensive given your situation I would avoid until circumstances changes and just save the money until you can increase your income.", "score": 2, "replies": [{"body": "He is in a third world country with 70% inflation. What do you want him to do exactly", "score": 2, "replies": [{"body": "I told him exactly what to do, are you able to read usually ?", "score": -3, "replies": [{"body": "You suggest saving in cash while inflation eats it away? Solid advice.", "score": 3, "replies": [{"body": "Like 30% in fees every trade is better ? LOL dumbass", "score": 1, "replies": []}]}]}]}]}, {"body": "I would convert your currency to USD and save and maybe invest what you save once per year.", "score": 1, "replies": []}, {"body": "On revolut you get 1 free trade a day.\nOn IBKR I get comms at around $1", "score": 1, "replies": []}, {"body": "Yeah that's rough. Can you just convert it to other Fiat currency instead of investing? Is that cheaper? \n\nUsually I would say don't bother trying to invest money like that as there's risk involved. However, your country inflation rate really takes the risk out of that..... It will be hard to loose 70% on some safe index funds or bonds. \n\nTo actually answer your question, there is no optimal number. How does inflation impact your ability to transfer to investments though? For instance, you're saying it's $1.50 right now to transact? In a year will it be 70% higher? If that's the case, it could make sense to actually buy every month as the inflation rate is higher than the transaction cost. Generally though if you get to $150 that's a 1% fee which sucks, but isn't world ending in your situation.", "score": 1, "replies": []}, {"body": "How about providers like etoro ?", "score": 1, "replies": []}]}
{"title": "The wake of the August 2024 Market Crash", "selftext": "[removed]", "id": "1elupk9", "created_utc": 1722981973.0, "score": 0, "upvote_ratio": 0.14, "num_comments": 13, "comments": [{"body": "Sorry, we're removing this post because it's a duplicate, or extremely similar, to another that was already posted.\n\nWe appreciate the effort but we don't need multiple posts that cover the same topic.", "score": 1, "replies": []}, {"body": "lol what market crash", "score": 26, "replies": []}, {"body": "2% drop in 2 days is only a crash to people who are used to seeing green every day for 9 months.", "score": 18, "replies": [{"body": "Good point and perspective", "score": 1, "replies": []}, {"body": "Yup, that's also true for inexperienced and scared money. It's a normal reaction in the beginning but takes time to understand that 2-5% drops in a day aren't unusual, good investors look for the dips and opportunities to get in for the long haul.", "score": 1, "replies": []}]}, {"body": "Not trying to be too harsh cause I agree with your overall sentiment, but it isn’t a market crash when everything starts to recover by noon and this reads like you’ve been investing for maybe 12 months.", "score": 4, "replies": []}, {"body": "This is where the ‘zoom out’ cliche comes into play. In all seriousness this major downturn WAS not only overdue but widely expected, as crappy as it is it was still to be expected at SOME point.", "score": 3, "replies": []}, {"body": "Until we pass 15%, this is just a standard correction. We’ve been due for one for quite a while, and it was expected. I’m not incredibly worried", "score": 2, "replies": []}, {"body": ">The crash was triggered by fears of a recession in the US, fueled by disappointing jobs data and a significant drop in manufacturing activity​\n\nThis is doubtful, or at least only a small part of the picture. \n\nThere were likely several huge trades, notably the yen carry and the short volatility trades, that blew up forcing massive amounts of covering.\n\nYou don't get a day like that off of a moderately poor economic print. \n\nThat's also why so many real wanted to buy that dip, forced selling generally yields the best opportunities.", "score": 2, "replies": []}, {"body": "I wonder what your reaction will be when there is a real crash!", "score": 1, "replies": []}, {"body": "Tech got hit so hard! I bought QQQ on Monday and I am only 2% up. This is going to ruin me!", "score": 1, "replies": []}, {"body": "Did you not look at the market today? Most things are already recovered.", "score": 1, "replies": []}, {"body": "This was not a crash.  Actually, it would’ve been a great opportunity if the brokerages would’ve had their platforms working correctly.", "score": 1, "replies": []}]}
{"title": "Mercedes approved for L4 driving tests in Beijing, ahead of Tesla’s robotaxi | The German company said over the weekend that the road tests [...] will cover maneuvers such as parking, U-turns, entering and exiting roundabouts, passing through toll booths, as well as changing lanes", "selftext": "", "id": "1el66st", "created_utc": 1722910545.0, "score": 24, "upvote_ratio": 0.72, "num_comments": 30, "comments": [{"body": "[From CNN video 9 months ago](https://m.youtube.com/watch?v=aWSs2n1NQVY&pp=ygURTWVyY2VkZXogYmVueiBmc2Q%3D) this system does only major highways, 40 mph or under. So even with some feature expansion this is going to be a narrow test for regulatory approval, to ultimately just boost sales in the region.", "score": 11, "replies": [{"body": "This is a totally different system.", "score": 10, "replies": [{"body": "Perhaps bought locally?", "score": 2, "replies": [{"body": "Likely based partially or wholly on Momenta tech. Mercedes has been an investor in Momenta since 2017. \n\nCould also be their in-house NVDA stack, but for L4 in China I think a more Momenta-heavy base is the likely choice.", "score": 4, "replies": [{"body": "I googled for it, seems yet another hd map, path recording fancy demo company. Same shit as many others.", "score": 0, "replies": [{"body": "You have a habit of Googling just deep enough to justify dismissiveness, I've noticed. Might help to go beyond that from time to time.", "score": 6, "replies": [{"body": "You’re not disputing that being dismissive is justified then? That’s about how deep I research.\n\nWhat’s Mercedes plan to roll this out everywhere? Any company that isn’t Tesla seems to be lacking in actually having a plan for how they scale up to produce millions of robotaxis per year.", "score": 2, "replies": [{"body": ">You’re not disputing that being dismissive is justified then?\n\nI'm explicitly doing so. \n\n> That’s about how deep I research.\n\nYou should do better DD, then. \n\n>What’s Mercedes plan to roll this out everywhere? \n\nUnknown. It's likely NA, EU, and CN markets all get different stacks or partially-different stacks with shared modules and foundations. Mercedes seems to essentially building an all-star 'team' of players in different disciplines and regions they can lean on for a global stack, or cross-pollinate towards market-specific or level-specific stacks. \n\nToyota is doing the same thing, as is Hyundai.", "score": 4, "replies": [{"body": "When I asked about scaling, I meant more about the hardware.", "score": -2, "replies": [{"body": "You'll need to elaborate on that concern. Which hardware do you believe Mercedes incapable of scaling?", "score": 5, "replies": [{"body": "The robotaxi vehicle. To make a viable network, they need to build millions of them. How many have they built so far? What factory(ies) will these millions of vehicles be built at? Are suppliers ready to give them everything they need? How are they planning on paying the tens of billions of dollars they’ll need to build all these vehicles every year? Will it just immediately be profitable (doubtful) or what’s the plan for financing it all? How many years will it take to turn a profit?\n\nI think you’re vastly underestimating the scale of the hardware problem. Few companies are large enough to tackle it at all. Even fewer are willing to accept the risk involved.", "score": -1, "replies": [{"body": ">The robotaxi vehicle. To make a viable network, they need to build millions of them. \n\nThis is a consumer vehicle, not a robotaxi. But even if/when it becomes a robotaxi, Mercedes is an automaker already capable of building millions of vehicles per year. No reason they wouldn't be able to continue doing so. \n\n>How many have they built so far?\n\nVehicles? I dunno man, like hundred million or so maybe? Probably more, tbh. It's a big company. \n\n>What factory(ies) will these millions of vehicles be built at?\n\nProbably the ones in Beijing first, I would guess. Sindelfingen is also a pretty good bet. \n\n>Are suppliers ready to give them everything they need?\n\nYeah probably. They tend to be pretty good at that, they've been doing it for like a hundred years or so. \n\n>How are they planning on paying the tens of billions of dollars they’ll need to build all these vehicles every year?\n\nProbably the same way they always have. I'm not sure why you're talking about the one of the world's oldest and richest automakers like it's some sort of fresh faced startup.\n\n>Will it just immediately be profitable (doubtful) or what’s the plan for financing it all? How many years will it take to turn a profit?\n\nFeels like you're getting pretty deep into the sealioning here. Pretty clearly, this is a company capable of financing technology programs same as it always has. Again, treating Mercedes of all companies like it's a YC prospect is... just odd. \n\n>I think you’re vastly underestimating the scale of the hardware problem\n\nI think you're dramatically overestimating how hard it is for an automobile manufacturer to build automobiles..?", "score": 3, "replies": [{"body": "I didn’t ask how many vehicles they’ve built. I’m well aware Mercedes is a century old and has built millions of vehicles per year. I asked how many robotaxis they’ve built.\n\nThey’ll need sensors and expensive processing units to build their robotaxis. Who will be supplying those? Do they have contracts in place to receive millions of them every year?\n\nAnd once they’re building these robotaxis, what will happen to them? Who will be buying them? If the answer is they’re not selling them, then who’s paying for them to be built?\n\nEvery company in this space that isn’t Tesla (perhaps barring Chinese companies) lacks an actual plan for how they’re going to go from having a prototype to having a profitable robotaxi network.", "score": -1, "replies": [{"body": ">I didn’t ask how many vehicles they’ve built. I’m well aware Mercedes is a century old and has built millions of vehicles per year.\n\nSure, it seems pretty obvious. We're in agreement there. It's a weird question to ask, as you've asked it. \n\nIf you're well aware Mercedes is a century old and has built millions of vehicles per year, then you shouldn't be fegining concern over whether they can build a few million more. \n\n>I asked how many robotaxis they’ve built.\n\nAgain, it's a weird question to ask. The only companies which have built any robotaxis at all are Stellantis-Waymo, Jaguar-Waymo, General Motors, Toyota, and I think.. BAIC, maybe? I think FAW has some operational via Apollo? \n\nBut like half of those robotaxis are just... regular vehicles with computers added to them. Waymo's Jaguar robotaxis are arguably the best in the world and also just old D7 vehicles with some TPUs in the trunk and a sensor package glued to the roof. \n\nI dunno. Again, the way you're asking the question is very weird. It's clear you're trying to form some sort of badly thought-out gotcha. \n\n>They’ll need sensors and expensive processing units to build their robotaxis. Who will be supplying those?\n\nUh, probably NVDA in abstract, like anyone else. Packages built by TSMC or Samsung Foundry, like anyone else. Then any number of board manufacturers, again like anyone else. Renesas, Bosch, Valeo, Forvia... whomever. \n\nAgain, the question you're asking here is really weird. There's a well-established supply chain for chip fabrication and packaging, it's basically just ARM-NVDA-TSMC or similar. I think Thor is TSMC 3N but I can't recall if that's confirmed. \n\n>Do they have contracts in place to receive millions of them every year?\n\nSure? I'm really not sure what your concern here is, do you doubt the ability of TSMC to make...chips? Or Mercedes to... intake automotive parts?\n\n>And once they’re building these robotaxis, what will happen to them?\n\nThey'll probably go into service, I would assume. That's theoretically the objective. \n\n> Who will be buying them?\n\nCustomers.. looking for robotaxi rides? \n\nOr are you asking who would be holding the ownership documents of these vehicles? Presumably Mercedes' financing arm or another similar entity. \n\n>If the answer is they’re not selling them, then who’s paying for them to be built?\n\nHonestly, I'm not sure why you think this is a novel question. Who pays to get anything built? Capital is generally financed, but there are dozens of different financial structures for building things. \n\nAgain, a very weird question to ask. \n\n>Every company in this space that isn’t Tesla (perhaps barring Chinese companies) lacks an actual plan for how they’re going to go from having a prototype to having a profitable robotaxi network.\n\nHow are you aware of the financial plans of every company in this space which isn't Tesla? \n\nBy which mechanism have you acquired this proprietary insider information? Should we be calling the SEC?", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "You seem to have internal knowledge, please disclose. Do you work for them? In China?", "score": -1, "replies": [{"body": "Someone in an investor subreddit suggests you aren't actually doing proper DD on competitors with a huge amount of public information available on them, and your first instinct is to accuse them of being a shill? We're really off to a great start here. \n\n[Momenta is a regular participant at CVPR, try this. ](https://www.youtube.com/watch?v=tNpEeIyuiJs)", "score": 11, "replies": []}]}]}]}]}]}]}, {"body": "Pretty huge leap to get from that traffic jam assist straight to legit level 4. Curious to see what the reality is.", "score": 7, "replies": []}]}, {"body": "It is just another marketing move from Mercedes.", "score": 2, "replies": [{"body": "As if they'd go the legal oversight route if they didn't have anything to show. There is easier ways to market", "score": 0, "replies": [{"body": "Look at their L3 marketing stun. How many people actually used it?\nThis L4 is not any difference.", "score": 2, "replies": [{"body": "[https://electrek.co/2024/08/06/mercedes-benz-gets-the-ok-to-begin-testing-its-level-4-autonomous-driving-tech-in-china/](https://electrek.co/2024/08/06/mercedes-benz-gets-the-ok-to-begin-testing-its-level-4-autonomous-driving-tech-in-china/)\n\n>We’ve tested the Level 3 version of Drive Pilot in the US as it is the only non-robotaxi company certified to offer the technology in the country (sorry, Tesla), and it is pretty impressive.", "score": 0, "replies": [{"body": "Again, who actually used it? Their Lv3 is 35mph on freeway, seriously?", "score": 2, "replies": [{"body": "What kind of benchmark is this? They just have a different approach to releasing unrefined features. You won't find Apple putting a front camera under the screen before it's refined technology either, there is multiple Chinese smartphone brands who do though. The facts are that Tesla isn't certified for L3 while Mercedes is, and that Tesla doesn't have a permit for testing autonomous systems in China while Mercedes does, for L4. ", "score": 0, "replies": [{"body": "I don't know. You tell me.\nA system that no one actually uses has no meaning. They can call it L10, and it still brings zero value.\nTell me where on earth people would drive at 35mph on freeway? Who is using Mercedes Lv3 now in the US?\nTesla doesn't have L4 certification, but it is actually driving me to work and back.", "score": 3, "replies": [{"body": ">Tell me where on earth people would drive at 35mph on freeway?\n\nHave you ever heard of gridlock?", "score": 2, "replies": []}, {"body": "> They can call it L10\n\n\nNo, they can't. These labels are regulated. Which is also why Tesla cannot use them. It's not a trust-me-bro assessment, unlike Elon's predictions for FSD maturity", "score": 1, "replies": []}, {"body": "Like I get how some people who don't keep up to date with self driving tech could be fooled by marketing. But people like electrek who really should know better? It's so blatant and ridiculous it's not even funny.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I think massive data centers, big enough to reported in the news, are a pre-requisite for self driving. Classical coding just doesn't work.", "score": 2, "replies": []}, {"body": "Sounds like everything XPeng's XNGP can already do (not test) for the whole of China, but even they are not calling it L3, much less L4.", "score": -3, "replies": []}, {"body": "And how did they train their model, on the CEO's MacBook?", "score": -1, "replies": []}]}
{"title": "How Terrifying is the Start of August?", "selftext": "Just over the past three trading days, the Dow Jones, Nasdaq, and S&P 500 indices have all recorded their largest three-day cumulative decline since June 2022! Last night, the Nasdaq plummeted by over 6% at one point, and the S&P 500 dropped by more than 4%, with both indices returning to their early May levels by the close of trading.\n\nAlthough the major U.S. indices and individual stocks still closed with significant losses, the intraday declines were somewhat moderated. The primary reason for this was the release of the U.S. July ISM Non-Manufacturing Index, which rebounded from a four-year low in June to 51.4, exceeding market expectations and returning to the expansion zone above 50!\n\nSub-indices, including the New Orders Index and Employment Index, also showed growth. Notably, the Employment Index reached 51.1, marking the largest increase since September of last year and the first time this year that it has entered the expansion zone above 50. This data slightly alleviated fears from last week's significant non-farm payroll decline, making the market believe that the drop in new jobs was primarily due to Hurricane Barry hitting Texas.\n\n👉 As discussed previously, the sharp decline in U.S. stocks at the start of August stemmed from worries about the U.S. economy falling into recession. Therefore, when the ISM Non-Manufacturing number showed growth yesterday, it somewhat restored market confidence in the economy, helping to narrow the intraday losses of U.S. stocks. The U.S. stock market now needs to see positive economic growth news to recover, unlike before when everyone was hoping for bad news, anticipating a Federal Reserve interest rate cut!\n\nHence, it is crucial to continue monitoring other economic data. If strong and robust growth numbers do not consistently appear, investors will remain concerned about an economic recession, and the trend of selling stocks for cash will not end. The VIX Fear Index is a crucial indicator to observe market sentiment calming down. It surged above 55 in early trading, a level not seen since the onset of the COVID-19 pandemic in 2020!\n\nhttps://preview.redd.it/sg4274tnvxgd1.jpg?width=1471&format=pjpg&auto=webp&s=567f2381222aa22bc63542527bab39f99fa94ba5\n\n", "id": "1el42sg", "created_utc": 1722904543.0, "score": 19, "upvote_ratio": 0.75, "num_comments": 11, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 24 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1el42sg/how_terrifying_is_the_start_of_august/) \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "I didn't read your text but that picture is glorious.", "score": 23, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "I like that in the sea of red, AMD and CRWD is green of all stocks ", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "This. \n\nThe market isn't even at a 3 month low. \n\nThe \"crash\" is bullshit.\n\nNow maybe it'll actually crash, but it hasn't at this point.", "score": 2, "replies": []}]}, {"body": "The only thing terrifying is that I didn't YOLO my entire account on SPY puts on the 1st. I had one measly 545P on Aug 1. Watched it bounce off of .10 and laughed. The it hit 5.00. Smiled and made some money. Then SPY did it again on Friday. And again today. 3 in row. Successive strikes at 535P then 525P each passing day turn a few grand into a million in 3 days. 😢 ", "score": 3, "replies": [{"body": "You are still better than 95% of the regards. Don't be a greedy.", "score": 6, "replies": []}]}, {"body": "The terrifying part is that 3 brokers went offline for a position of customers and many people from interactive and now Schwab are having trades reversed they made in premarket", "score": 3, "replies": [{"body": "This just shows that in an actual crash, the big boys are selling the bags first", "score": 3, "replies": []}]}, {"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "can i get a recipe for bundt cakes?", "score": 1, "replies": []}]}]}
{"title": "Am I cooked? 96$ put on Nvidia ", "selftext": "[removed]", "id": "1el48b5", "created_utc": 1722904973.0, "score": 1, "upvote_ratio": 1.0, "num_comments": 19, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Thesis is not wrong. Theta will kill you before then though", "score": 3, "replies": []}, {"body": "Poised for success.", "score": 2, "replies": []}, {"body": "Rip", "score": 1, "replies": []}, {"body": "If SMCI shits the bed, you might not be. Whether or not that's a smart action to take is an entirely different question.\n\nTheta's going to bite at your heels regardless.", "score": 1, "replies": [{"body": "🤧", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "👀⏰", "score": 1, "replies": []}]}, {"body": "Oh shit a 1 lot! Youre cooked man", "score": 1, "replies": []}, {"body": "why would you buy puts on a money printing machine already down 12% pre market knowing there are buyers waiting?", "score": 1, "replies": [{"body": "Idek what this means brother!", "score": 1, "replies": [{"body": "That’s why you shouldn’t be playing with options", "score": 1, "replies": [{"body": "You’re right train me🧍🏽‍♂️", "score": 1, "replies": []}]}]}]}, {"body": "44 whole dollars? What are you going to do?", "score": 1, "replies": [{"body": "Who’s gonna tell him", "score": 3, "replies": [{"body": "Tell me what😭", "score": 1, "replies": [{"body": "You lost 44 dollars man, there’s no recovery from this.", "score": 1, "replies": [{"body": "Didn’t have a stop loss🫠", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Japan activates circuit breaker for top side ", "selftext": "[removed]", "id": "1el4onb", "created_utc": 1722906235.0, "score": 10, "upvote_ratio": 0.99, "num_comments": 10, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 7 | **First Seen In WSB** | 8 months ago\n**Total Comments** | 155 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "doomers btfo", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "On puts right", "score": 1, "replies": [{"body": "On puts….right?!", "score": 1, "replies": [{"body": "I’m like 2-28 at this point so if I’m doing puts u should go for calls brother. I’m trynna get you some money", "score": 1, "replies": []}]}]}]}, {"body": "The hell? i never heard of a limit breaker for green days. i always felt like it was patriotic for stonks to go up", "score": 1, "replies": []}, {"body": "Calls will clean up tomorrow", "score": 1, "replies": []}, {"body": "Didn't get filled on a put as a hedge on Friday close. Bought a put today at close. If anyone needs more investing tips please reach out.", "score": 1, "replies": []}, {"body": "Fake news", "score": -3, "replies": []}]}
{"title": "$TSLA Upside (Potential)", "selftext": "[removed]", "id": "1el51dz", "created_utc": 1722907250.0, "score": 2, "upvote_ratio": 0.56, "num_comments": 17, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 weeks ago\n**Total Comments** | 14 | **Previous Best DD** | \n**Account Age** | 3 weeks | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Only upside Tesla has is Elmo promising more bs", "score": 6, "replies": [{"body": "Bruh I had water in my month when I read your comment. Lmfao. ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "You laugh now, but his robots will take all our jobs behind the Wendy’s dumpster.", "score": 1, "replies": []}]}, {"body": "bro, neither of those blue lines are anywhere close to where they’d be drawn if you were honest. but of course i don’t carry crayons around so what do i know.", "score": 6, "replies": [{"body": "We chart differently. IMO there is a psychology deployed to the market via these algos. FOMO is the biggest tool MM's use to get us to make moves. Those outliars are bear and bull traps. That's why those lines are drawn the way I did. Charting is just as much art as it is science. Best of luck.", "score": 0, "replies": [{"body": "Yeah I had the same discussion with my haruspex. He is still reading the sheep liver right to left, and I’m like, this is Rome. We conquered you and your people, learn to read from left to right. Smh.", "score": 1, "replies": [{"body": "Great contribution", "score": 1, "replies": []}]}]}]}, {"body": "By the end of week i hope", "score": 2, "replies": []}, {"body": "Trump just endorsed, so maybe elon can use shitter to shit it put", "score": 1, "replies": []}, {"body": "Base case intrinsic value is $57.25 like I posted here. [Base Case](https://www.reddit.com/r/wallstreetbets/comments/1efyx1d/comment/lg0myep/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nI also called this decline weeks ago and posted my positions but the overlords said my account was too new and I didn't have enough likes in the circle jerk.\n\nhttps://preview.redd.it/65xecvcxmygd1.png?width=820&format=png&auto=webp&s=3da14f6d69a2497b46caaab640bc99b5b1c01e12", "score": 1, "replies": []}, {"body": "https://preview.redd.it/y72vx591nygd1.png?width=775&format=png&auto=webp&s=01065eda7fbcd971af7a7c2a884f0cbd1715adea", "score": 1, "replies": []}, {"body": "Tesla is going to Mars", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "and 150 if robo taxi is legit.", "score": 1, "replies": [{"body": "If the Robi taxi is legit, the stock goes up way past 150. \n\nBut let's be honest, elmo promises the world and delivers a shit on a stick.", "score": 2, "replies": [{"body": "I was able to buy some option calls expire 10/18 at 300 for a low a amount. and its already up. I hope elmo does deliver.", "score": 1, "replies": [{"body": "Gl. I don't recommend holding those much longer, but who knows? I've seen dumber shit happen.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Intel Bounce Back?", "selftext": "[removed]", "id": "1el52v8", "created_utc": 1722907367.0, "score": 1, "upvote_ratio": 1.0, "num_comments": 10, "comments": [{"body": "Thanks for your submission! \n\nr/WallStreetBets is known for making absurd but sometimes profitable trades that no one ever considered possible.\n\nTo keep making that possible, we need your help in keeping the feed of threads interesting and exciting.\n\nWe try to move all the short and basic questions, analysis, or jokes to the daily thread so that the best quality content can stick around and be more visible. \n\nThis is definitely a bit subjective, and there are no hard and fast rules, but a few indicators that your post should have really been a comment in the daily thread include:\n\n* Asking a question that is easily googleable or has likely been asked before. E.g. \"What app should I use?\", \"What should I invest in?\". \n\n* Beating a meme to death, like the 10 millionth, \"inverse cramer\" joke again. \n\n* Reposting jokes from the front page but slightly altered to be related to trading. \n\n---\n\nAll that being said, we are here to help. We want to make it as easy as possible for you to post to our community. We have to balance this with making the subreddit interesting for our readers. \n\nIf you need some guidance, don't hesitate to [reach out to modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets) and we'll give you some pointers!", "score": 1, "replies": []}, {"body": "It will go up only if grandmas guy sells", "score": 3, "replies": [{"body": "Who’s that?", "score": 1, "replies": []}]}, {"body": "Absolutely.  I know this goes against everything this sub believes in, but buy and hold long term.  Intel will fix it's issues and it will bounce back.  It's the tech version of \"too big to fail\".", "score": 2, "replies": []}, {"body": "Not sure what there production looks like but I think they do a lot of it in the US? That’s really good if things in china/taiwan go to shit\n\nBut don’t know enough about it", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 12 minutes ago\n**Total Comments** | 2 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Intel is a shitty company that sucks so I would not be buying their stock.", "score": 1, "replies": [{"body": "Can you expand? Just curious why you think they’re so bad", "score": 1, "replies": [{"body": "They were very competitive thirty years ago and are not today.  They have been massively cost-cutting and restructuring because their business is very uncompetitive and doesn't bode well for long-term growth at current operations.  They are getting their ass cleaved in two by AMD, Nvidia, and Taiwan Semiconductor.", "score": 1, "replies": [{"body": "They could have some *heavy* leverage if some of those supply chain constraints (i.e. china invades Taiwan) materializes. They can do end-to-end chip production in the US. Companies like nvda can not.\n\nDoesn’t necessarily mean intel is good company. But they could *really* dominate the market if Taiwan/china were cut out", "score": 1, "replies": []}]}]}]}]}
{"title": "Bear Markets have strong volatility- Bull Markets are slow gains over longer periods", "selftext": "[deleted]", "id": "1el699n", "created_utc": 1722910750.0, "score": 15, "upvote_ratio": 0.76, "num_comments": 18, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 7 months ago\n**Total Comments** | 20 | **Previous Best DD** | \n**Account Age** | 10 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "When every HF manager knows we are running on government liquidity, they are ready at the drop of a hat to bail. If people thought this market was legit, AAPL, MSFT,  etc. never would have dropped 10%.\n\nThese are the same people that are on TV every day saying now is a great time to buy or that Apple intelligence will take the stock to $250. So, wtf happened overnight to change that thesis? Nothing.\n\nBut when you know a market is being propped up by government intervention, you are on the lookout for the unwind. People thought it might be starting, and that's why markets tanked.", "score": 22, "replies": []}, {"body": "Escalator up Elevator down", "score": 11, "replies": [{"body": "When you buy Intel with nanas 700k life savings it’s kind of like falling down a 3rd story garbage chute.", "score": 6, "replies": []}, {"body": "This is 💯", "score": 2, "replies": []}]}, {"body": "Everything that goes up must go down", "score": 2, "replies": []}, {"body": "Bro, \"long periods of time\" US has been bull market since fiat\n\nIf you want bear market, go to Venezuela", "score": 4, "replies": [{"body": "horrible what happened in Venezuela. \n\nBut to the contrary, I love bull markets, unfortunately seeing this so called “black Monday” makes you wonder. I have only really seen that type of volatility during bear markets… not bull markets. And I’m not talking about earnings , where there’s an actual reason for such moves. \n\nPeople seem to have forgotten the 35 trillion in debt, the treasury yield inversion . \n\nTypically bear markets have followed 18-24month following the inversion.  We are approaching that limit. Let’s see what happens following the elections.", "score": 2, "replies": []}]}, {"body": "Heard that shit ten times in the last 3 years and guess what, it was no bear market u regard", "score": 3, "replies": [{"body": "So it doesn't exist? Stock only go up? Average regard", "score": 5, "replies": [{"body": "Well long term yes, they can only go up unless it's a shit company and it goes bankrupt anyway :)\n\nBear markets definitely exist but they are always limited periods of time. Overall chart going up never changes, simply because economies keep expanding, not shrinking (most of the time). Entropy... \n\nOne can simply guarantee that if you buy the SPY index today, you will be in profit in 10, 5, 2, even 1 years. But can't guarantee that you will be in profit in 3 days, 3 weeks, 3 months...", "score": 2, "replies": []}]}]}, {"body": "Unrest in the world. Potential war, Japanese market panic, and now more market manipulation……", "score": 1, "replies": [{"body": "I agree with this. Civil unrest could be a major catalyst. You see what’s going on in the UK, not many major news outlet are talking about it. \n\nX seems to be the only social media company actually showing what’s happening in Manchester, Birmingham, Rome and other high tourist areas in the world. \n\nSurprise no one has mentioned the 35 trillion in debt, could we print more money, sure but then what happens with inflation? Vicious cycle. 🔁", "score": 1, "replies": [{"body": "can you describe more please? thank you!", "score": 1, "replies": [{"body": "Hey! This is just 1 video of many happening in the [UK](https://x.com/stillgray/status/1820557833953505383?s=46&t=WyCVDwYZfZL4EwBYyd8Z9Q) 🇬🇧", "score": 2, "replies": [{"body": "😱   woah", "score": 1, "replies": []}]}]}]}]}, {"body": "Ohmygosh. Everyone has lost their minds! Like, collectively!", "score": -5, "replies": []}]}
{"title": "Concerns About the Current State of the Stock Market", "selftext": "[removed]", "id": "1el69ni", "created_utc": 1722910785.0, "score": 0, "upvote_ratio": 0.31, "num_comments": 13, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "thanks ChatGPT", "score": 18, "replies": [{"body": "You really don’t need a computer to identify something written by ChatGPT. It immediately feels autogenerated.", "score": 3, "replies": []}, {"body": "Hi ChatGPT, can you summarize it in two sentence?", "score": 3, "replies": []}]}, {"body": "/r/investing is that way -->", "score": 6, "replies": []}, {"body": "https://preview.redd.it/9mlpyxigiygd1.jpeg?width=1201&format=pjpg&auto=webp&s=e29f552aa8ce4a5cc4361f58648b2e1300fb8b0f", "score": 2, "replies": []}, {"body": "Too much text for my span of concentration of less than 5 seconds", "score": 2, "replies": [{"body": "No tits, no ass - how am I supposed to get through this text thing?", "score": 1, "replies": []}]}, {"body": "Dear ChatGPT:  I couldn't get through this whole thing, but suffice to say you don't really understand how this all works.  Your history entirely skips mutual funds.  The point of ETFs is diversification with very low expenses/fees and better tax efficiency than comparable mutual funds. ETFs come in every shape and flavor, not just big cap.  If big caps go up, it's because buyers drove it up, not because of ETF managers.  Outside of ETFs, the so called feedback loop is the opposite, as people sell or even short stocks that went up a bunch. As for demographics, there are a ton of non Americans investing, which you ignore.  I couldn't read past that", "score": 3, "replies": [{"body": "There are also tons of people not investing at all, and not having any 401k, we are just so in an info bubble", "score": 1, "replies": []}]}, {"body": "Oh my gosh. Everyone has lost their minds.", "score": 1, "replies": []}]}
{"title": "Fundamentals of NVDA", "selftext": "[deleted]", "id": "1el6d35", "created_utc": 1722911076.0, "score": 12, "upvote_ratio": 0.68, "num_comments": 14, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 30 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1el6d35/fundamentals_of_nvda/) \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "53.33% sales growth for the next 3 years is not very possible to achieve.", "score": 10, "replies": []}, {"body": "Can you use more crayons next time? All I took away from this was NVDA Fun, needs more smiley faces and stars.", "score": 13, "replies": [{"body": "I’m actually screaming, I don’t care how much money I lose, I’m here for the humor", "score": 2, "replies": []}]}, {"body": "as with any ANALysis garbage in, garbage out.....   yolo 700k of grandmas money and tell us how it goes", "score": 7, "replies": []}, {"body": "Are you practicing for a stock pitch to give as part of a job interview? Please don’t seriously pitch Nvidia unless you want to get laughed out of the room", "score": 3, "replies": []}, {"body": "You keep taking three month operating cash flow and making it the be-all end-all of your \"analysis\".", "score": 2, "replies": []}, {"body": "A company that makes $15B a year is worth $2.5T.", "score": 2, "replies": [{"body": "Nvidia made $15B last quarter, if it had no growth it would mean annual earnings of $60B.", "score": 9, "replies": []}]}, {"body": "All baked in but not Biden Harris using DOJ to go after them and their chips were junk had big recall. Also tech stocks have to prove it now spent billions collectively made nothing.", "score": 0, "replies": [{"body": "Biden doesn’t even know what a chip is. All he knows is that ice cream tastes good.", "score": 3, "replies": []}, {"body": "Nancy is in it. That investigation is going nowhere, it was just announced to give her and her cronies and opportunity to buy in lower", "score": 2, "replies": []}]}]}
{"title": "Prepare to Exit Your Shorts - It's Going to Be Hell For the Bears Tomorrow", "selftext": "[removed]", "id": "1el7gmw", "created_utc": 1722914418.0, "score": 38, "upvote_ratio": 0.86, "num_comments": 18, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 10 months ago\n**Total Comments** | 3117 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Nope, i'll keep my high leverage shorts. Thank you", "score": 7, "replies": []}, {"body": "Let’s fucking go asts!", "score": 12, "replies": [{"body": "ASTS $25 tomorrow", "score": 3, "replies": [{"body": "Why what happened? what is it. Never hear of it.", "score": 1, "replies": [{"body": "Google and search for DDs or do your own, there is a subreddit as well.", "score": 0, "replies": [{"body": "Obviously you don't own it.", "score": 1, "replies": [{"body": "Cult stock", "score": 0, "replies": []}, {"body": "You're smart /s", "score": 1, "replies": [{"body": "If I owned a stock, and somebody asked me \"hey what is that I never heard about it.\" I would sell them that shit in a minute. You want to hear about ARM? lol Just sell it bro.", "score": 1, "replies": []}]}]}, {"body": "Don't promote it if you aren't willing to tell people WHY they should.", "score": -1, "replies": [{"body": "I didn't promote anything, plus I told him what to do, dumbass", "score": 0, "replies": [{"body": "You told him to buy ASTS.\n\nThat's \"promoting.\"\n\nTell him why he should. \n\nYou are dumb as fuck.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Is that Mike Oxlong?", "score": 6, "replies": [{"body": "Paul Bunyan", "score": 3, "replies": []}]}, {"body": "![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4276)", "score": 2, "replies": []}, {"body": "The VIX Snap Back Will Be Lethal", "score": 1, "replies": []}]}
{"title": "Pro tip: Inverse me", "selftext": "[deleted]", "id": "1eljzld", "created_utc": 1722956359.0, "score": 55, "upvote_ratio": 0.97, "num_comments": 13, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 2 months ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "brave teeny alleged skirt dazzling trees impolite heavy squash nutty", "score": 26, "replies": [{"body": "OP username checks out", "score": 1, "replies": []}]}, {"body": "What’s your next play", "score": 6, "replies": []}, {"body": "You had the option to exercise to it Nvidia put yesterday and you didn't lol\nNever get greedy!", "score": 3, "replies": [{"body": "I sold a single put today #thetagang", "score": 4, "replies": []}]}, {"body": "Trying to scare the competition away from the Wendy's dumpster?", "score": 3, "replies": []}, {"body": "Avoiding Alpha", "score": 2, "replies": []}, {"body": "That you, Cramer?", "score": 1, "replies": []}, {"body": "Refract the graph over line y=x", "score": 1, "replies": []}, {"body": "Mine looks similar\n\nhttps://preview.redd.it/lud5i8i0n4hd1.jpeg?width=1440&format=pjpg&auto=webp&s=db7dac829b96e12e14a5e328ae0de84eabc92e19", "score": 1, "replies": []}, {"body": "I think following the advice from people on Wallstreetbets will do more damage to your bank account. I suggest consulting with your financial advisor.", "score": 1, "replies": []}, {"body": "Thanks for buying my options", "score": 0, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1elljyv", "created_utc": 1722960068.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 14, "comments": [{"body": "Please. Which company's meeting lead to productive outcome? Have you worked in office or not?", "score": 5, "replies": [{"body": "A company meeting with a positive outcome? Doesn’t that only happen in porn?", "score": 5, "replies": [{"body": "Meeting is all about some idiot trying to prove he has working mouth", "score": 2, "replies": [{"body": "In porn, in real-life or both?", "score": 2, "replies": []}]}]}, {"body": "Can confirm, have experienced office meetings often (boss does one with the team every two weeks!). Total waste of time.", "score": 2, "replies": []}]}, {"body": ">Microsoft Dynamics 365, HubSpot, Insightly, and Zoho CRM, which continuously evolve, Salesforce’s technology feels outdated, reminiscent of 1990s tech.\n\nPlease speak to anyone that uses these specific CRMs. Our company tried and failed Dynamics cause it was dogshit and the general consensus is that as well. Salesforce is the market leader and switching CRMs and migrating data is incredibly difficult.\n\nCalls.", "score": 1, "replies": [{"body": "Fr, idiotic thought process on puts for this", "score": 2, "replies": []}, {"body": "Exactly this, I was confused when I read the post, Salesforce is really good and easier to use than the other CRMs listed.", "score": 1, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 992 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1elljyv/puts_on_crm_salesforce/) \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Maybe I should I inverse on you!!\n\nI read 3 post one from shorting Meta, one shorting carvana and grandson 700K intel. \n\nLoad up call !", "score": 1, "replies": []}, {"body": "Post positions", "score": 1, "replies": []}, {"body": "My company is switching to sales force after years of these other providers. \n\nWe all agree that sales force is far ahead of the competition and they have the market segment cornered in a way. \n\nThis is a terrible post", "score": 1, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "I mean yea, most corporations would agree with my statement \n\nSounds like someone thought they were smarter then they really are lmao", "score": 1, "replies": []}]}]}, {"body": "“…friend who works at Salesforce in a high up position…” Hey so that’s actually called insider trading and little known fact it’s very frowned upon", "score": -1, "replies": []}]}
{"title": "Inflation looks great", "selftext": "Inflation is a lagging indicator. Monthly inflation is looking fantastic and nobody is talking about it. Two months of near zero inflation already, and Wednesday next week we will probably see US monthly inflation near zero or even below.\n\nThat's a huge potential for interest rate cuts.\n\nIn fact the inflation target is 2% because the goal is to avoid hard to control deflation. So monthly inflation is currently too low.\n\nYes, there are economic risks and the whole Yen thing demonstrates the complexity, and there are other indicators like core inflation. But nonetheless, huge potential for interest rate cuts.\n\n[https://tradingeconomics.com/united-states/inflation-rate-mom](https://tradingeconomics.com/united-states/inflation-rate-mom)\n\n[https://tradingeconomics.com/euro-area/inflation-rate-mom](https://tradingeconomics.com/euro-area/inflation-rate-mom)\n\nAnnualized USA GDP growth was still at 2.8% in Q2. EU GDP growth has been improving to 1.3% in Q1 and Q2.\n\n[https://tradingeconomics.com/united-states/gdp-growth](https://tradingeconomics.com/united-states/gdp-growth)\n\n[https://tradingeconomics.com/euro-area/gdp-growth](https://tradingeconomics.com/euro-area/gdp-growth)\n\n[https://tradingeconomics.com/euro-area/gdp-growth-annualized](https://tradingeconomics.com/euro-area/gdp-growth-annualized)\n\n", "id": "1eltorx", "created_utc": 1722979470.0, "score": 5, "upvote_ratio": 0.61, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 9 months ago\n**Total Comments** | 7 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1dp8afy/bird_flu_vaccination_recommendation_tomorrow/) \n**Account Age** | 10 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "A jar of Mayo is 7 bucks. The feds tell us 20% since Biden took over. I see 50% and up. The folks in the middle are not stupid and aren't buying the nonsense.", "score": 4, "replies": [{"body": "Theres a difference between National inflation and inflation in your locality.\n\nAlso its probably just price gouging. Retaulers see a 20% price increase, but then increase their prices by far more, to increase profits, meanwhile claiming that its all just inflation", "score": 2, "replies": []}]}, {"body": "No one cares about inflation anymore. Rate cuts are already guaranteed. If anything, inflation being under control is a negative factor to the market, because the fed will be conservative in intervention to protect their work", "score": 7, "replies": [{"body": "Inflation steals money from the middle to lower classes. Why do you think people are working more than 2 jobs and doing side gigs. Steal from these people by jacking up the cost of living by printing more money and keeping the interest rates low. Bail out the asset classes.", "score": 3, "replies": [{"body": "You’re taking about moral principles. I’m talking about market factors. In market valuation, no one cares about inflation anymore", "score": 1, "replies": [{"body": "You need to factor the inflation hidden data correctly to match your trades. It's relevant in many industries. Each inflation factor is different independently.", "score": 1, "replies": []}]}]}, {"body": "Consumers expect more inflation. I often see the sentiment that inflation is still high or could bounce back. Half of the population has no idea what's going on.\n\n[https://www.theguardian.com/us-news/article/2024/may/22/poll-economy-recession-biden](https://www.theguardian.com/us-news/article/2024/may/22/poll-economy-recession-biden)  \n[https://www.reuters.com/markets/us/us-consumer-confidence-rises-july-inflation-expectations-steady-2024-07-30/](https://www.reuters.com/markets/us/us-consumer-confidence-rises-july-inflation-expectations-steady-2024-07-30/)\n\nWe could see some monthly deflation, that would accelerate interest rate cuts. Shifting expectations could increase the deflationary pressure, people are angry about price gouging. We don't have much data, but essentially monthly annualized inflation dropped from 3% to 0%. It might be under control, or deflation could become an issue, next week we get more data.", "score": 1, "replies": []}]}, {"body": "I know you have these articles saying inflation was low, but I’m sure not seeing it, grocery store near me just increased milk by 14% and eggs by about 37% recently.", "score": 6, "replies": [{"body": "That’s just price gouging. Nothing to do with inflation. We saw similar in my town and debunked it being inflation by seeing lower prices one city over.", "score": 3, "replies": [{"body": "Im afraid you are correct. Im seriously considering driving an additional 2 miles to get to next closest store.", "score": 3, "replies": []}]}, {"body": "Milk production is down 0.8% from last year, egg production 2%. There may be increased biosecurity expenses, but not to that extent. It's even less significant on a monthly basis.\n\n[https://nebraskapublicmedia.org/en/news/news-articles/bird-flu-hasnt-affected-overall-milk-production-or-prices-but-that-could-change/](https://nebraskapublicmedia.org/en/news/news-articles/bird-flu-hasnt-affected-overall-milk-production-or-prices-but-that-could-change/)\n\n[https://usda.library.cornell.edu/concern/publications/fb494842n?locale=en](https://usda.library.cornell.edu/concern/publications/fb494842n?locale=en)\n\n[https://usda.library.cornell.edu/concern/publications/h989r321c?locale=en](https://usda.library.cornell.edu/concern/publications/h989r321c?locale=en)", "score": 1, "replies": [{"body": "I have a feeling the local Harris teeter overprices everything. I’m not exaggerating though. I buy milk a few times a week and it went from 3.49 to 3.99 maybe 2 weeks ago. 12 eggs went from around 2.18 to almost 3.00. Shit is insane. I’m thinking of changing to a steady diet of ramen, but even that has gone up. Ramen used to be maybe a quarter a pack, but now it’s up to about .38 cents (when buying a 6 pack).", "score": 3, "replies": [{"body": "That’s why I only eat Arizona teas….. Can’t beat that 99 cent deal…..", "score": 2, "replies": []}]}]}, {"body": "I'm pretty sure that federal inflation indicators just use RNG.\n\nRent quintuples month over month? Ramen $500/brick? That's a 2.1% inflation, just barely over target, stocks can be happy", "score": -1, "replies": [{"body": "They do, just like when they tell you half of Americans feel this way or that with zero proof or indication of how they got these numbers, I know I never got survey or asked about it.   After covid they kept coming out and saying oh the economy is so strong. Bidenomics is working.   Job growth is up and Biden has created 100000 more jobs.   Never told us what jobs or what economy they were talking about but in my world what I see daily had zero comparison to what the government was trying to tell/reassure me", "score": 1, "replies": []}]}]}, {"body": "Inflation is sticky like my pp", "score": 2, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Inflation being flat after an unnecessary near-double digit 2 year run leaves me less than thrilled.   \n\nIt's like taking credit for plunging unemployment numbers when you finally lift covid restrictions and people are finally able to go back to work.  \n\nI get it.  Every administration wants to take credit for good news, but unlike the 1800s, people aren't stupid enough to fall for the false rhetoric.", "score": 1, "replies": [{"body": "You sure about that? 😂", "score": 1, "replies": []}]}]}
{"title": "Summary Analysis of Market Sell-Off in August 2024", "selftext": "[removed]", "id": "1elv1u1", "created_utc": 1722982822.0, "score": 5, "upvote_ratio": 0.65, "num_comments": 11, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "The Japan situation and impact is far from over. In fact, red flags went out when one Japan's biggest banks liquidated more bonds than they did in the 2008 crisis. \n\nMy understanding is there is still a long-tail on the interest rate hike impact on investments since so much investment was funded through borrowing through Japan.", "score": 3, "replies": [{"body": "Yup,. BOJ is stuck, their banks are gonna really be hurting if they keep rates steady or even raise, but if they backtrack they'll lose all confidence and God help us all.", "score": 2, "replies": []}]}, {"body": "Excellent analysis, except: if the Federal Reserve intervenes in the next 2 weeks with anything more than talk (like a surprise rate cut), we might get a pump for a day or even less but volatility will skyrocket when people realize they're as scared as everyone else.", "score": 3, "replies": [{"body": "It's chatgpt", "score": 2, "replies": [{"body": "lol I feel better about not reading the whole thing then", "score": 2, "replies": []}]}]}, {"body": "What is the most likely reaction from the market once the money printer starts going brrrrrr again?", "score": 2, "replies": [{"body": "A crash. An emergency cut would signal panic and the return of inflation. \n\nThe best move is a larger than anticipated scheduled cut. 50 instead of 25 at the September meeting", "score": 5, "replies": [{"body": "This take is way too reasonable", "score": 2, "replies": []}]}, {"body": "market loves money printers, as do the fools who think it has no consequences. election year, better fire up the printer. the more you devalue your currency, the more assets cost, so keep printing money, stocks will keep \"going up\"", "score": 1, "replies": []}, {"body": "Even if it does it’ll take a week or 2 to recover", "score": 0, "replies": []}]}]}
{"title": "$NVDA fuck your calls ", "selftext": "[deleted]", "id": "1elwki5", "created_utc": 1722986744.0, "score": 8, "upvote_ratio": 0.64, "num_comments": 14, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 188 | **Previous Best DD** | \n**Account Age** | 9 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Before earnings?! You crazy.", "score": 14, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Sucky sucky 5$", "score": 1, "replies": []}]}]}, {"body": "Brother just accept bankruptcy ", "score": 3, "replies": []}, {"body": "This is a wild decision right before earnings on one of the most profitable companies in the world", "score": 3, "replies": []}, {"body": "Shit I bought svix, volatility usually falls pretty fast when it gets that high, unless the market stays this volatile the next couple weeks.", "score": 2, "replies": []}, {"body": "...or $NVDA calls fuck your account...", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "I sold mine today...might re enter tomorrow...we will see if I have any monies", "score": 1, "replies": []}, {"body": "A lot of this makes sense, amd short seems like a strange price to do so at, why not arm short instead? Wayy higher pe", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "AMD has more Than 1 revenue stream, they are taking share from intel which has 3/4 of retail today, and amd only needs a small share of ai accelarators market to double or triple current total revenue, it does have a much higher total potential while not being dependent on forever growth and 90%+ market share in their markets like nvidia.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Amd moves randomly, less of a beta Than others, why not just short The soxx? Or long soxs?", "score": 1, "replies": []}]}]}]}]}, {"body": "your still alive?", "score": 1, "replies": []}]}
