{"title": "NVIDIA's $10 Trillion Vision: Blackwell Chip Set to Ignite Stock Surge, Analyst Predicts\n", "selftext": "[deleted]", "id": "1f5r2j5", "created_utc": 1725121153.0, "score": 37, "upvote_ratio": 0.82, "num_comments": 18, "comments": [{"body": "I plan on going to the bottom whether you like it or not", "score": 5, "replies": []}, {"body": "😂", "score": 3, "replies": []}, {"body": "As long as people keep buying BILLIONS in options, the stock is going to keep going sideways...Hedge funds don't sell options to lose money. It is why the stock fell even though they posted billions in gains.   \nI have about $60K between NVDA and NVDL. But quite frankly I am getting annoyed with this. I think I will sell at least half of my stock and invest into something else once it reaches $136 to $142...", "score": 8, "replies": [{"body": "NVDA is so volatile that it's a dream for options traders. They usually trade the premiums, and exercises are rare since most people can't afford them. Everyone had the same idea about the price, which is why it dropped and probably won't bounce back. You said yourself that you were going to sell, so others likely sold before you. No need to be upset about it. Also, you shouldn't hold NVDL... It decays fast. It's meant for day trading. Youre going to need NVDA to end up higher than your entry price to break even the longer you hold it.", "score": 3, "replies": [{"body": "The only reason I have NVDL is because it pays huge premiums. I sell covered calls with my 400 plus shares I have. I stopped selling covered calls these past 2 weeks though because I thought the stock was going to go up - (as most people did)  \nHowever, on Tuesday, I will begin selling CCs again. I make about $500 a week sometimes so it makes all the nonsense with the stock more sufferable.  \n\\*\\* I actually still have 2 covered calls I rolled with an EXP date of 9/6 and a strike price of $80.   \nThose look like they will expire worthless for whomever bought them from me.", "score": 2, "replies": [{"body": "What strike price and how far out??", "score": 1, "replies": []}, {"body": "I don’t understand options much, if the price right now is $120 and your strike price is $80, why would it expire worthless?", "score": 1, "replies": [{"body": "I was referring to **NVDL.... not NVDA.**... 2 totally different stocks... but the former moves according to the latter.   \nIf you do NOT understand options, I suggest you watch Youtube videos on beginners guide to options. I did and I am the better for it.", "score": 2, "replies": []}]}]}, {"body": "NVDL rebalances daily.", "score": 1, "replies": [{"body": "It does not, that's the price you pay for holding leveraged assets. NVDL decayed 12% or more during the huge selloff \n\n\"For example, if the underlying index goes up by 1%, we might expect a leveraged ETF that seeks to deliver two times the daily return to go up by 2%. However, due to the effects of decay, the actual return might be less than 2%.\" \n\n\nhttps://www.etf.com/sections/etf-basics/why-do-leveraged-etfs-decay", "score": 2, "replies": []}]}, {"body": "NVDL was $40 when NVDA dropped to 100$. You could have got 2 shares of that instead of NVDA and be up 36 dollars right now instead of 20. NVDL is fine for more than day trading.", "score": 1, "replies": []}]}, {"body": "Sell it all to me. Cheers.", "score": 1, "replies": [{"body": "If you buy them at $136, then sold!", "score": 1, "replies": []}]}]}, {"body": "Ah, the hype begins again so the MMs can sell the news again before the next event", "score": 2, "replies": [{"body": "Honestly feel like the big market makers piled in when rumor of Blackwell was coming years ago  (probably when Nvidia had in pipeline notified the big buyers) and hence why stock has rocketed last 1.5 years.. now retail is hearing news, fomo’ing and market makers are selling bags to retail", "score": 1, "replies": []}]}, {"body": "yea.......uh, right.", "score": 2, "replies": []}, {"body": "😂😂… why stop there? Why not 100 trillion? Or 1 quintillion?", "score": 3, "replies": [{"body": "I mean with the way the us government is printing money that’s likely.", "score": 1, "replies": []}]}]}
{"title": "19 yo, how is my portfolio looking? ", "selftext": "[deleted]", "id": "1f5inze", "created_utc": 1725093477.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 14, "comments": [{"body": "People who try the strategy of \"buying companies that could 10x in 5-10 years\" always do worse than the market and usually make negative gains because you're buying hope and hype not a good company with good fundamentals", "score": 8, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Exactly, thats the point why it shouldnt be the biggest position", "score": 3, "replies": [{"body": "you can add ASTS and similar stocks, but manage your risk.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Do you know who Cathie Wood is?", "score": 1, "replies": []}]}]}]}]}, {"body": "It's nice, I like the white background and the lines between stocks 9/10", "score": 4, "replies": []}, {"body": "Opinion: You need to add more ETfs. Look for one you like. QQQ, VOO are some of my favorite. You need to be in more of the magnificent 7. My favorite are Apple and Microsoft.", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Thats not true", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "There are several options for Europe. For example iShares Core S&P 500 UCITS ETF (Acc)", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The one I said is following the same index. It is a fine alternative to VOO", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Took me a long time to realize if I put my money in spy and didn't fucking look at it I'd be sitting on probably close to a mill. Last year I dumped everything and put it all in spy. Best move that took 10+ years to accept. Maybe learn from me", "score": 2, "replies": []}, {"body": "Buy MELI", "score": 1, "replies": []}, {"body": "How can you be down with constellation software if they are close to ATH. Did you buy the wrong stock ( constellation brands)?", "score": 1, "replies": []}, {"body": "Very bad...", "score": 1, "replies": []}, {"body": "it seems to be only really speculative stuff, which isn't necessarily bad at 19 yo, but I hope it's not money you can't afford to lose.", "score": 1, "replies": []}]}
{"title": "Question on what do to", "selftext": "Started a stock portfolio about 3 years ago. tried to spread out across many sectors. made some stupid choices of course. unfortunately not an extraordinary amount of money on the bad picks, I'm up 4k on 15k invested total 19k. but as you can see trying to pick some of them myself and also based on some advice some turned out bad. most of them went up very nicely but have since crashed, wish i just put all in msft or spy etc.  my question is on all of the stocks that you can see I have lost a lot (percentage wise)on should I hold on to them until they possibly recover? or cut my losses, sell and put what little I do get out of them into one of my better performing pics?\n", "id": "1f5wmma", "created_utc": 1725135934.0, "score": 8, "upvote_ratio": 0.72, "num_comments": 17, "comments": [{"body": "First observation is that you have too many stocks which is called closet indexing. It’s tough to do your due diligence on so many stocks with a continually changing market. Try to weed out your losers and put the proceeds into a S&P 500 index fund (full disclosure, I’m biased towards index funds).  If history is any indicator, you’ll be able to double your money every seven years in an ETF like VOO if you reinvest the dividends.", "score": 7, "replies": [{"body": "Yes I agree with you but I did not pick all of these all at once I probably built this portfolio over the course of a year and only bought one or two at a time and then it's probably been 3 years that I've been holding everything so you think I should cut my losses now? The reason I made the post is because I've seen a lot of experts say that you should never sell just to cut your losses and hold on to it for as long as possible and it should turn back but just gauging where other people might think about just cutting the losses", "score": 1, "replies": [{"body": "Some say to let your winners run and cut your losers. 85% of stocks are losers or underperform the market. Value investors tend to hang onto their shares much longer in hopes that the price of the equity will catch up to the valuation but value investing hasn’t panned out in recent years. If you do own individual stocks, you need to allocate a good chunk of time keeping up with the research on them as market conditions continually change.", "score": 3, "replies": []}]}, {"body": "I also like the funds that I have in my portfolio they have definitely been good to me except for the silver trust LOL but I really like the Schwab dividend one and the Spy", "score": 1, "replies": [{"body": "Schwab dividend fund and SPY are excellent investments.", "score": 2, "replies": []}]}]}, {"body": "Good question", "score": 2, "replies": []}, {"body": "really odd seeing that list, SBLK I have owned took profits a little over month ago.  ADM entered its a decent recession hedge and was/is at value.   BTG its always cheap for a reason.   I would recommend going more ETF with your core 80% then use the other 20% for individual stock plays.", "score": 2, "replies": [{"body": "So you would recommend selling the ones I am down on overall at least ? without waiting for any kind of comeback before selling that was the main question of my post I am trying to get info and input on if I should sell everything now at least everything that I have lost on and put it into my ETF funds", "score": 2, "replies": [{"body": "Yeah streamline sell this month, but ETFs in October.  You can keep dividend payers if you want for now.  SCHD is a good fund so is SPY/VOO slap the money there.   Keep ADM nice recession hedge, MSFT AAPL ABBV.  SBLK is fine but be ready to sell always, guess BTG if you really want a gold mine.  I don't really know/am neutral/no opinion on the other stuff. \n\nDon't try to do too much SCHD and SPY will do very well and beat most everything for the long haul.", "score": 2, "replies": []}]}]}, {"body": "Sorry, that should say, fortunately, not unfortunately that it isn't a lot of money..cannot edit the post?", "score": 1, "replies": []}, {"body": "Backtest your future portfolios   \n[https://www.lazyportfolioetf.com/portfolio-backtest-and-simulation/](https://www.lazyportfolioetf.com/portfolio-backtest-and-simulation/)", "score": 1, "replies": []}, {"body": "Take a look at some stocks or ETFs which start with E through L.   How can it be a balanced portfolio when are missing a large part of the alphabet?", "score": 1, "replies": []}, {"body": "Too many stocks dude", "score": 1, "replies": []}, {"body": "dump them all and invest 70% VOO 30% QQQM", "score": 1, "replies": []}]}
{"title": "Thoughts on INTC... keep the dip? Is it good that INTC is not deep in AI?", "selftext": "[removed]", "id": "1f5h7sg", "created_utc": 1725087170.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 15, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 week ago\n**Total Comments** | 23 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Problem is they don’t only suck because of AI. They lost their huge advantage they had with processors.", "score": 6, "replies": [{"body": "I know the structural problems...  but also the processor stocks frequently fall and rise with the \"China ban\" fears... China might ban US chips, US might ban the export but not on the short term as they cant do small structures right now and still spying/stealing the technoloby without really applying it into the broad scale.\n\nThen fears calm... occurs every 4 weeks. Options market balance at 22.50 between puts and call for INTC, if they dont move then \"they lost momentum\".\n\nTechnically Intel and AMD's Intel compaitbles are on the wrong way, RISC is the future but noone honors ARM right now although ARM gains market share", "score": 1, "replies": [{"body": "Listen to me. \n\nDO. NOT. BUY. INTEL. You want to know how bad it is? The Apple M1 processor wiped the floor with Intel when it was released. \n\nThey have a long ways to fall. Lithography is EXTREMELY expensive and they’re the only ones left doing their own FAB. Go read the story of AMD and their FAB struggles. Intel is behind, and they’re cranking up the power they shove through their chips. The 13th and 14th Gen processors have a hardware issue in them. \n\nTheir XE GPUs aren’t worth it unless so heavily discounted you can get them in an arcade machine. \n\nJust don’t.", "score": 1, "replies": [{"body": "I worked   on EUV lithography research in my last job, I know process designers... opticians... physicians, mathematicians. I am completely aware what is going on. Intel is a dip for me, and for sure they will fall again.\n\nAs far as I can see the US stock market will tear INTC up this week, many people are optimistic about US labour market, the USD gains ground against other currencies and the three big indices might reach their years heights.\n\nThis week is  most likely the end of the autumn rally, many people say.\n\nTechnically RISC will resume there where CISC (Intels X86/X64 and AMD X64) comes to an end. However ARM is licensed to many makers, e.g. Appple (Apple was RISC orifinally, Motorolla 68000, then IBM PowerPC, then Apple made a \"wrong turn\" to Intel Xeon CPUs, later making the M1 and the A1 cpu, both ARM / RISC based again...\n\nARM is also available to Microsoft OS, currently Windows 11 but there are servers planned to come. And on one of the ARM server CPU you can run around 100 Windows 11 VM, compared to 20 on the biggest Intel server X86 CPU.", "score": 1, "replies": []}]}]}]}, {"body": "There is NV and AMD, no need to buy the losers", "score": 2, "replies": []}, {"body": "Go for copper.  It’s the new intel.", "score": 2, "replies": []}, {"body": "I bought and I'm gonna hold it. It's a mix of US-based chips, especially with growing fears around Taiwan. If the AI bubble bursts this won't affect intel as much or at all. And since a teenager I've been keeping an eye on CPUs because I've played a lot of games in the past. Sometimes AMD would be ahead, sometimes Intel would be ahead. I think they are one leap away of becoming really good again. But this could take years or never happen. Too big to fail also plays a role here, someone could buy it (Nvidia, TSMC, etc)...\n\n\nTL;DR: I'll hold, but my position is pretty small (83 shares)", "score": 2, "replies": [{"body": "The USA will not let intel fail.\n\nUsa needs their own chips champion and theres no one domestically thay can produce near top end chips at that scale.\n\nTI can make good chips, but not at big scale. Glo Fo is not at the cutting edge anymore. Remains to be seen if new made in america tsmc and samsung fabs will turn out, but they wont be american owned.\n\nSo yea i agree. Too big to fail.", "score": 0, "replies": []}]}, {"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "WSB hivemind would have downvoted to oblivion any INTC post ad of 2 weeks ago, now is slowly changing opinion it looks.  \nIf you want some real circlejerk and top of the like echo chamber you can join:  \n[r/IntelsNanaClub](https://www.reddit.com/r/IntelsNanaClub/)", "score": 1, "replies": []}, {"body": "oh yeah its absolutely bullish that intc makes no money on AI  because that means in the futurer they cant lose money on AI   taps head  \n\nthinking about that fact makes me want to invest in everything thats not tech since they also dont make money in AI\n\nthanks op", "score": 1, "replies": []}, {"body": "compared to INTC competitor in AI Chips, INTC is falling. earning was super bad everything was falling apart. even AMD is struggling which is supposed to be better than INTC.", "score": 1, "replies": []}, {"body": "They’re invested in AI. They are releasing the AI PC, Gaudi 3, and Falcon Shores.", "score": 1, "replies": []}, {"body": "The big selling point for me was there new foundries/forges for semi conductors and processors. Now there considering not only reducing them but also separating them entirely..  \n\n\nthe u.s. goverment basically invested billions into the Intel foundries. Something like almost 20 billion. Part of which is an 11 billion loan.  \n\n\nAlso getting rid of 15,000 employees most of which bau, wanted to be mainly useless middle managers that hinder rather then grow the company. Instead there offering it to all employees. \n\n\nWhich is why bau left.   So I'm starting to feel there heading for bankruptcy. ", "score": 0, "replies": []}]}
{"title": "After he summer slowdown,next 8 months are historically most exciting in market", "selftext": "[deleted]", "id": "1f5it06", "created_utc": 1725094103.0, "score": 51, "upvote_ratio": 0.88, "num_comments": 17, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 140 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Too bad that I already lost everything", "score": 72, "replies": [{"body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 8, "replies": []}]}, {"body": "Priced in", "score": 22, "replies": []}, {"body": "This was the lull? Everyone here has been wetting themselves over carry trade, semiconductors, AI and Nana’s INTC bet.", "score": 33, "replies": []}, {"body": "What Summer slowdown???", "score": 12, "replies": [{"body": "Bloody August!", "score": 6, "replies": [{"body": "That ended in another ath", "score": -4, "replies": []}]}]}, {"body": "Spy $600 calls exp 12/31 yolo?", "score": 8, "replies": [{"body": "My VIX calls vs your SPY - FIGHT!", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Oh I think they’ll print because we have 2 major events - interest rates dropping and presidential election. My bet is Kamala wins and trump supporters go even more wild than Jan 6.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Hop on those Nov 20 calls", "score": 3, "replies": []}]}]}]}]}]}, {"body": "##**SUMMER SLAM '89!**", "score": 3, "replies": []}, {"body": "Plus it’s an election year!!", "score": 1, "replies": []}, {"body": "Yeah, it's not out of question that Bitcoin could go below $5000 within a year. Though at that point I'm not sure people will be willing to go back on board.", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|29637)", "score": 1, "replies": []}]}, {"body": "Si n bro", "score": 0, "replies": []}]}
{"title": "Joined the Casino", "selftext": "[removed]", "id": "1f5jb19", "created_utc": 1725096255.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 17, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 6 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "\"Wealth\" ![img](emote|t5_2th52|4271)", "score": 10, "replies": [{"body": "Yes I started little, the “big part” of my 18s heritage is on more standard financial instruments", "score": -1, "replies": [{"body": "What? Steroids?", "score": 1, "replies": [{"body": "Yes Italian steroid( LDO, FNC and etfs)", "score": 1, "replies": []}]}]}]}, {"body": "This is a loss for ants even for italian standards![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 3, "replies": [{"body": "😔I know I want to improve to be a proud member of WSB💪", "score": 1, "replies": []}]}, {"body": "guys I think there's a glitch in Reddit assets, I'm only seeing one 0 next to € sign", "score": 1, "replies": []}, {"body": "You could have lost more than that forgetting groceries in your car on a hot day...Just saying.", "score": 1, "replies": [{"body": "😔", "score": 1, "replies": []}]}, {"body": "I recognize a trade republic account when I see it", "score": 1, "replies": [{"body": "So do u have better options in Italy for a broker with options? It seems to me that I  can’t use Robinhood", "score": 1, "replies": [{"body": "If you truly want options you can use tastyworks, it’s the only one in Europe I recon", "score": 2, "replies": []}, {"body": "No, I trade turbos currently, if you want products similar to options check the warrants on trade republic by societe generale, they are very similar", "score": 1, "replies": [{"body": "Yea ATM I trade the warrants by SG but I don’t know anyone that has the possibility to trade options like in USA", "score": 1, "replies": [{"body": "Tastyworks", "score": 1, "replies": []}]}]}, {"body": "InreractiveBrokers", "score": 1, "replies": []}]}]}]}
{"title": "Keep calm and short the VIX brohons", "selftext": "[removed]", "id": "1f5ri9a", "created_utc": 1725122296.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 11, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 8 minutes ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "This guy is looking for bagholders", "score": 12, "replies": [{"body": "Eat my ass![img](emote|t5_2th52|4259)", "score": -9, "replies": [{"body": "Just put my fries in the bag.", "score": 6, "replies": [{"body": "Animal style", "score": -4, "replies": []}]}]}]}, {"body": "gtfo of here with your shitty self promotion.", "score": 10, "replies": [{"body": "[removed]", "score": -10, "replies": [{"body": "jfc chris, your insults are just as fucking terrible as your stupid fucking smile.", "score": 3, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "Be less of an asshole", "score": 1, "replies": []}]}]}, {"body": "Be less of an asshole", "score": 1, "replies": []}]}]}]}
{"title": " Is Generative AI Hype Overpricing NVIDIA? 🤔💸", "selftext": "[removed]", "id": "1f5skc0", "created_utc": 1725125046.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 7 minutes ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 9 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Have you done any research at all on the company..?", "score": 2, "replies": [{"body": "The flood of these posts is getting stale quickly.", "score": 2, "replies": []}]}, {"body": "capable wild jellyfish jobless fretful edge ask sulky wine deer", "score": 1, "replies": [{"body": "That’s what they keep saying but neither Google nor Amazon will need Nvidia’s chips if their in-house or AMD’s chips can do the work their clients need. It’s just a matter of time.", "score": 1, "replies": [{"body": "hobbies roof foolish hunt desert uppity rain juggle butter ink", "score": 1, "replies": [{"body": "They don’t need to catch up, my guy. All they need is to provide GPUs that can do the tasks their clients need. Far from everyone will need GPUs worth of $40k per rack.", "score": 1, "replies": [{"body": "attraction license slim resolute marble impolite sense narrow busy unused", "score": 1, "replies": [{"body": "You actually think their Hopper-series will continue to sell just as much with Blackwell coming out? You’re funny.\n\nTo give you an example: Amazon now offers AMD’s GPUs for some of their AWS. It’s just a matter of time before Nvidia can’t sell their GPUs to a 70 % margin. That will cause Nvidia’s growth to kick back and their share price to no longer being justified.", "score": 1, "replies": [{"body": "sophisticated voiceless caption gullible pathetic profit decide makeshift whole automatic", "score": 1, "replies": [{"body": "Yes, they will as the competition will get better but is much cheaper. Wait and see what happens when Amazon and Google has developed their in-house GPUs well enough for them to being able to do the tasks their clients need. Amazon now offers AMD’s solutions for their AWS.", "score": 1, "replies": [{"body": "serious toothbrush vase telephone attempt outgoing cagey racial imagine marvelous", "score": 1, "replies": [{"body": "Dude, the competition doesn’t need to catch up. If they take market share, if Nvidia’s margins drop, and if Google and Amazon developes their own solutions, Nvidia’s revenue growth and margins will drop quickly and their valution will be far from justifiable. It’s only a matter of time before the valuation crumbles.", "score": 1, "replies": [{"body": "sheet coordinated dam languid crowd boast saw merciful psychotic support", "score": 1, "replies": [{"body": "Dude, if Nvidia’s margins and revenue growth continues to drop, so will the valuation. Nvidia’s share price is based on a valuation based on insane growth for more yesrs to come. If the growth slows or stops, the sell-out will begin. Just see what happened this earnings report when they reported a drop from a revenue growth of 260 % in Q1 to 122 % in Q2. Their guidance even hints further slowing of revenue growth with 80 % in Q3 and 60 % in Q4.", "score": 1, "replies": [{"body": "sulky icky marry outgoing run act wrong decide joke fine", "score": 1, "replies": [{"body": "AMD and Intel are not valued at 3T and based on a revenue growth and margin they can’t maintain. Nvidia has to maintain perfection to not drop like a rock.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "If Hopper really continues to sell this well, then how come Nvidia’s revenue growth is projected to drop to 80 % in Q3 and 60 % in Q4?", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "No way! Priced at over 50 times earnings? Completely normal.", "score": 1, "replies": []}, {"body": "There is much more to AI than just generative AI.", "score": 1, "replies": []}]}
{"title": " 🚀 Bitcoin DD: The Rocket Fuel You’ve Been Waiting For 🚀 ", "selftext": "[removed]", "id": "1f5zshz", "created_utc": 1725144688.0, "score": 0, "upvote_ratio": 0.22, "num_comments": 13, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 3 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Another ChatGPT post. Just write a poem instead next time", "score": 9, "replies": [{"body": "now that you said it, I see it. \n\nI see it.", "score": 1, "replies": []}]}, {"body": "I’ll keep using bitcoin to buy my steroids and gh, not to hold cya", "score": 3, "replies": []}, {"body": "Someone tells me why crypto, NOT BLOCKCHAIN, worth anything? Who cares about the network (e.g ether, solana, doge, etc...) if you can still trade currency? If it's about the trust of an old history and high # of users that a network brings, why does that matter? Afterall, **CODE IS LAW**. Once a set of strong governance is codified, any new network can just use that code template and instantly guarentee trust in the system. Someone explains otherwise please?", "score": 2, "replies": []}, {"body": "Bitcoin (all crypto) is a Ponzi scheme", "score": 2, "replies": [{"body": "No, its actually a greater fools dilemmma", "score": 0, "replies": [{"body": "This is the most obvious ChatGPT reply I have ever seen.", "score": 1, "replies": []}]}]}, {"body": "Fuck bitcoin stocks are better", "score": 2, "replies": []}, {"body": "And why should I trust you??", "score": 1, "replies": []}, {"body": "Buy the dip, short the VIX, fuck bitcoin.", "score": 1, "replies": []}, {"body": "That price targets are fun", "score": 1, "replies": []}]}
