{"title": "How SVB got wrecked by a concept that all first-year economics students are taught — bond yields and seasonal cash flow patterns", "selftext": "Bonds 101: investors expect higher rates on longer term bonds due to higher risk exposure and effects of inflation. \n  \nInversion: when the market expects interest rates to rise in the near future, long term return ls can be lower than shorter term bonds. \n\nFrom [investopedia](https://www.investopedia.com/terms/i/invertedyieldcurve.asp): As of Dec. 2, 2022, Treasury yields were as follows, the most recent flip to an inverted curve:\n\nThree-month Treasury yield: 4.22%\nTwo-year Treasury yield: 4.28%\n10-year Treasury yield: 3.51%\n30-year Treasury yield: 3.56%\n\nSo, since at least early December last year, the market has been on alert that interest rates would likely be rising. The Fed has been clear with its plan to hike rates since at least early 2022. \n  \nAnd yet, here was SVB, apparently sitting on a massive number of treasury securities with low rates originating from the insane quantitative easing of post-covid Fed policy with no plans on how to hedge knowing full well their bonds would lose significant value. \n  \nBut why did this happen now if the rest of the world has known about rate hikes since early/mid 2022? Surely the professionals and seasoned finance executives are well attuned to market risks and fluctuations. \n  \nSeasonal liquidity crunches. It was the nail in the coffin for SVB. And they are not a new phenomena. Consider that talk of rate hikes and recession began towards the end of Q3 2022, and SVBs collapse occurred in corresponding the two-week period before the end of Q1. What other notable crises happened around these periods?\n  \n- [March 16th, 2008](https://www.thebalancemoney.com/bearn-stearns-collapse-and-bailout-3305613): Bear Sterns announces sale to Chase\n  \n- [September 15th, 2008](https://en.m.wikipedia.org/wiki/Bankruptcy_of_Lehman_Brothers): Lehman brothers declares bankruptcy\n  \n-[September 16, 2008](https://www.thebalancemoney.com/aig-bailout-cost-timeline-bonuses-causes-effects-3305693): AIG received $85bn bailout by the Fed. We all know how that went. \n  \n- [Black Monday](https://en.m.wikipedia.org/wiki/2020_stock_market_crash), March 9-22, 2020: when the market saw its worst days during the beginning of the Covid crisis. \n  \nThese quarter closes are not perfect indicators, there is nothing magical about the weeks leading up to quarter close that indicates a crisis will occur, but they suggest something about our global monetary system that in inherently unstable leading up to these periods, and has been since at least 2007-08.\n\nBut, this was a black swan event, you say, bank runs are impossible to predict and we had no way of knowing this would happen. Let me give you an idea of who led SVB into this crisis:\n  \n1.\t⁠CEO: Director at San Francisco Fed\n2.\t⁠CFO: Former analyst at Freddie Mac\n3.\t⁠Chief Admin Officer: Former CFO of Lehman Brothers\n4.\t⁠Chief Risk Officer: Led credit ratings in 2007\n5.\t⁠Chief Legal Officer: General Counsel at Citibank in 2008\n\nThese are the same people who oversaw the 2008 recession. I don’t want to pretend like all of these individuals arent criminals, they are. They just also happen to be incompetent. \n  \nThe warning signs were there in 2022 but just like in 07-08, those in charge refused to do anything that would jeopardize corporate profits. \n  \nBut they did see something. The SVB c-suite [sold large portions of stock in the run up](https://www.sec.gov/edgar/browse/?CIK=719739&owner=exclude), this is not a coincidence: \n  \n- Gregory Becker, CEO, sold 11% on Feb 27, 2023.\n- Michael Zucker, General Counsel, 19% on Feb 5.\n- Daniel Beck, CFO, sold 32% on Feb 27.\n- Michelle Draper, CMO, sold 25% on Feb 1.\n  \nThe bottom line: CEOs and their firms treat the monetary system like a casino. But the system is sick. It can’t sustain the level of greed and growth that those at the top demand of it. It’s unsustainable and everyone knows it now. We could see more collapse in six months, or we could continue to limp along for another decade or so like after 2008. Regardless of the result, I guarantee nothing will change.", "id": "11qgq49", "created_utc": 1678730598.0, "score": 666, "upvote_ratio": 0.89, "num_comments": 92, "comments": [{"body": "Almost everyone with a financial or banking background knew the interest rates were being held at an all time historically low number. \nRumors were floating around for months, last year, the Fed were going to starting increasing interest rates over several period/times over the following year\n\nWhy would anyone buy 10 year treasury notes at 1% with that type of information.", "score": 79, "replies": [{"body": "Also, they knew they were heavily reliant on deposits from VC funded startups, which are also very sensitive to interest rates. So all this shit was amplified and then it hit the fan. \n\nSeriously these people haven’t learned anything from 2008.", "score": 16, "replies": []}, {"body": "There were (non-Fed) buyers of 10years at that yield. A lot were idiots. But most were just liability matching. If you borrowed money for a 10 year term at 0.5%, what is the safest way to insure a profit? Buy 10y Treas at 1.0%. That is rock solid business/investment strategy. Of course then you have morons like the guys who ran SVB/ are running FRC and they funded with demand deposits (effectively a lagging floating rate bond with flexible maturity) and bought 3-4 year Treasuries. That didn't work out so good, yeah? Lesson here: assets are important but it is the assets PLUS the liabilities that tell the whole story.", "score": 2, "replies": [{"body": "Very true. If you an an individual can buy with a better yield than your loan amount rate it would be a win-win.", "score": 1, "replies": []}]}, {"body": "Yields were shit and we’ve been in a rate environment since 2008 that made everyone think high rates were unlikely to last long, if we ever saw them", "score": 4, "replies": []}, {"body": "Yes, knowing the future makes everything seem so obvious, you're right", "score": 2, "replies": [{"body": "Treasury yields have been increasing since last year. They must’ve been asleep", "score": 10, "replies": [{"body": "The bond price by itself isn't relevant, it's the combination of a bank run and the bond price that caught them.", "score": 0, "replies": []}]}, {"body": "Back in March 2022   Financial analysts and bank officials as were anyone who paid attention to financial reports \nThe Fed approved a 0.25 percentage point rate hike, the first increase since December 2018.    The Officials indicated an aggressive path ahead, with rate rises coming at each of the remaining six meetings in 2022.\nMembers also pared expectations for economic growth this year and sharply raised their outlook for inflation which in turn would require increased in the interest rates.\n\nYet this bank even afterward this information bought 10 year treasury notes at 1%. Idiots Imo", "score": 2, "replies": [{"body": "Where did you get the bond purchase date? \n\nLet's say you're correct and they acquired these bonds all in the last year. That would still be fine. These bonds are supposed to be sold only in the future. It was only the bank run that forced them to sell them now.", "score": 0, "replies": [{"body": "Plus the huge sale off of their stock in those last 2 days almost 1 million shares of stock sold brought value down to just over $100 share.  Now it is down to about $85 share", "score": 1, "replies": []}]}]}, {"body": "Yields were basically zero. It was pretty obvious they couldn't go lower so it wasn't a matter of if they would increase but when. Doesn't exactly take a crystal ball to figure that out in this case.", "score": 1, "replies": []}]}]}, {"body": "This is another hot take full of errors. Per accounting standards, banks cannot hedge HTM securities. So SVB ran them unhedged as required, which was only a problem due to the depleting startup cash balances which culminated in the bank run once the credit rating agencies downgraded them last week. This caused them to sell the securities, which required them to switch to mark-to-market.", "score": 200, "replies": [{"body": "They didn't actually mark to market HTM (well, at least not before they got shut down). They sold 80% of AFS to boost reserves but at the time of shut down had not yet touched HTM. \n\nIs it actually *required* not to hedge HTM? I know it's not expected, but what if they just wanted to bet on rising interest rates as a trade?", "score": 38, "replies": [{"body": "Apparently there’s something called interest rate swaps that hedges against rising inflation.", "score": 8, "replies": []}, {"body": "We’re saying the same thing. I said they only moved to MTM when they sold them last week. \n\nYes you can’t hedge HTM because you’ll receive par value is that’s the case, so if you hedge them you don’t actually plan to HTM.", "score": 16, "replies": [{"body": " Don’t think this is correct", "score": 6, "replies": [{"body": "I provided my source which is PWC in another comment down below. What’s your source?", "score": 2, "replies": [{"body": "Your source specifically states that hedging of htm is permitted and provides guidance on how it woul, or would not,be reported. So running unhedged is not a requirement at all.", "score": 7, "replies": [{"body": "No it doesn’t: “ASC 815-20-25-43(c)(2) indicates that interest rate risk may not be the hedged risk in a fair value hedge of held-to-maturity debt securities.”", "score": 7, "replies": [{"body": "Ahh that’s your confusion. You’re confusing “allowed to hedge” with how the hedges are accounted for on your balance sheet.", "score": 1, "replies": []}, {"body": "May not means they can right? It gives them option to not hedge that’s all.", "score": -11, "replies": [{"body": "Pretty sure I’m being trolled but they said it more concretely: “The notion of hedging the interest rate risk in a security classified as held to maturity is inconsistent with the held-to-maturity classification under ASC 320, which requires the reporting entity to hold the security until maturity regardless of changes in market interest rates.”", "score": 8, "replies": [{"body": "You can hedge held to maturity securities. You just cant use hedge accounting per ASC 815. Accountants would call this an economic hedge. \n\nASC 815, or hedge accounting, allows you to manage your P&L by allowing special accounting rules for hedging instruments and hedge items that meet certain criteria. This is just saying you can’t identify interest rate risk as the risk that’s being hedge but you can identify credit risk. It’s dumb.", "score": 12, "replies": []}, {"body": "lmao! props to you for sticking with all these armchair scientist replies", "score": 4, "replies": [{"body": "For real", "score": 2, "replies": []}, {"body": "Except he’s still wrong. Hedging is a risk management measure and would never be “disallowed” as a rule", "score": 1, "replies": []}]}, {"body": "You’re not correct. You are absolutely allowed to hedge HTM securities, it’s just unusual because you intend to hold to maturity so what are you hedging? \n\nBeyond that, it’s still unacceptable risk management to mismatch the duration of your assets and liabilities, which like the OP said is truly a very basic economic concept.\n\nNo idea where you got this nonsense", "score": 2, "replies": [{"body": "You’re not correct. You’re only allowed to hedge credit risk, not interest rate risk.", "score": 0, "replies": [{"body": "I mean no that’s just simply not true. You can’t account for the hedge and htm security in one line on your balance sheet, but you can absolutely hedge the interest rate risk at a bank. You’re confused by the nature of how this is reported in financials.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "They knew well the risk from Fed rising rates but expected crypto and startups to keep growing which in turn would allow deposits to grow exponentially.", "score": 8, "replies": []}, {"body": "I've heard from credible sources that KPMG lost a load of big clients today because of this fiasco.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Yes completely agree.", "score": 2, "replies": []}]}, {"body": "Jim Cramer promoted SVB\nhttps://youtu.be/2N-741AaUyw", "score": 2, "replies": []}, {"body": "Weird pretty sure in australia the banks are required/forced to hedge", "score": 1, "replies": []}, {"body": "I’m not sure that really matters. FASB provides an option to switch classifications. If they didn’t run their bank like degenerates they wouldn’t have had to sell their treasuries", "score": -8, "replies": [{"body": "Why would they switch classification if they intended to hold to maturity? Then they’d have to run the securities in their hedged portfolio, which has carrying costs. I’m not defending SVB, they miscalculated the temporary growth in deposits and over invested in long-dated assets. But this isn’t as simple as finance 101. \n\nSource: https://viewpoint.pwc.com/dt/us/en/pwc/accounting_guides/derivatives_and_hedg/derivatives_and_hedg_US/chapter_6_hedges_of__US/64_hedging_fixedrate_US.html#:~:text=The%20notion%20of%20hedging%20the,changes%20in%20market%20interest%20rates.", "score": 20, "replies": [{"body": "Because they have been hemorrhaging money for months, the Fed has been hawkish since last year and they are in an extremely high risk industry with their loans.", "score": -3, "replies": [{"body": "you are completely right. SVB did no risk management. And it's not elemental at all weather or not they could have or couldn't have hedged. After all they used long term obligations to cover cash deposits that in their nature of being used in start ups are always expected to deplete as soon as an economic cycle changes. Other banks didn't do things that way. And just like other banks they could have chosen short term obligations, diversification and obligations that allowed hedging. What they did is the equivalent of me putting all my money into one single stock and then not even hedging with options AND depleting most of my daytoday spendings account knowing full and well that inflation risk depleting my account below the threshold i need to pay daytoday expenses.", "score": 16, "replies": []}]}]}]}]}, {"body": ">The bottom line: CEOs and their firms treat the monetary system like a casino. But the system is sick. It can’t sustain the level of greed and growth that those at the top demand of it. It’s unsustainable and everyone knows it now. We could see more collapse in six months, or we could continue to limp along for another decade or so like after 2008. Regardless of the result, I guarantee nothing will change.\n\nYou were doing great until you got to this part. This is just nihlist complaining but does not add to any sort of constructive discussion. Also keep in mind that the \"evil, greedy capitalists who always win\" are the ones losing here in that they will see significant investment losses.\n\n&#x200B;\n\n>The warning signs were there in 2022 but just like in 07-08, those in charge refused to do anything that would jeopardize corporate profits.\n\nGo look for yourself at the SIVB chart going back to early 2022. You can see the stock at \\~600/share and then steadily declines. This is an example of the market properly pricing in the higher interest rate risk relative to SVB's specific bond holdings. \n\nThe blame for this collapse rests not just with SVB but with everyone across the board. It rests with all the shareholders, the hedge funds, regular investors in tech stocks, all of which could have started to demand better fiscal responsibility the minute the first rate hike was announced, but that would mean shares prices going lower earlier.", "score": 57, "replies": [{"body": "It's easy to sympathize with your argumentation, however i remember my business law college classes and how responsibility and accountability for mistakes were handled. I also want to point out that many have demanded better fiscal responsibility even before the first rate hikes, the low rates were heavily criticized by many.\nAnyway the core of it is that environmental circumstances and third parties (outsiders) who are not formally responsible for the bank have zero responsibility for the banks mistakes. For example how should a tech stock investor in say Denmark who buys US stocks in any shape way or form be expected to know about SVBs existence , understand the fragilities of the bank, use his non existant influence to influence US policy and the bank? He wouldn't even qualify as a stakeholder. Stakeholders would be investors, the employees, the board, the management, and the customers. Responsible can be only stakeholders and the government. Nobody else could possibly qualify for blame. Generally it's not reasonable and completely against all law practice to put any responsibility at all upon the customer, which leaves only the others. If you want to view it from a non law perspective and purely morally then you could reasonably argue that experts of finance who hold sway and power in the US share some blame as they could be expected to have the necessary insight to identify the issues and the necessary reach to make themselves heard. But there are thousands of banks and very little accessible information transparency, it would require serious effort to dig up everything that has now come to light so easily due to global attention.", "score": 12, "replies": []}, {"body": "You were doing great until you got to this part.\n\n&#x200B;\n\n>Also keep in mind that the \"evil, greedy capitalists who always win\" are the ones losing here in that they will see significant investment losses.\n\nThe same industry that advocated for the \"Economic Growth, Regulatory Relief, and Consumer Protection Act of 2018\" which changed the definition of \"systemically important banks\" and therefore stress test requirements from banks with $50 billion in assets to $250 billion in assests (SVB was $209b, Signature was around $100b) are the same banks being backstopped by the Federal Reserve. They advocate for deregulation, and then get saved afterwards.\n\n&#x200B;\n\n>Go look for yourself at the SIVB chart going back to early 2022. You can see the stock at \\~600/share and then steadily declines. This is an example of the market properly pricing in the higher interest rate risk relative to SVB's specific bond holdings.\n\nMost stocks are down since the Fed started raising interest rates. You're drawing a lot of specific conclusions from a common trend - look at Meta or Shopify stock.\n\n&#x200B;\n\n>The blame for this collapse rests not just with SVB but with everyone across the board.\n\nThis is great....\n\n&#x200B;\n\n>It rests with all the shareholders, the hedge funds, regular investors in tech stocks, all of which could have started to demand better fiscal responsibility\n\nGold. However the financial sector runs on confidence and group think. Just make sure to distinguish between these guys and the depositors.\n\n&#x200B;\n\n>the first rate hike was announced, but that would mean shares prices going lower earlier.\n\nIt's understated how reliant the U.S. economy is on zero perecent interest rates (i.e. free money). We often think of those in banking as the smartest people in the room (of the economy) but we haven't had normalized interest rates in almost two decades. Many have written about the zero lower bound and the secular downward term in interest rates, so you are correct here but also giving them too much credit.\n\nThe \"constructive conversation\" revolves around better regulation. OP is obviously an idiot just looking to individualize and moralize the issue to prevent systemic critiques. Just dumb it down, distract and confuse. \n\n&#x200B;\n\n>The bottom line: CEOs and their firms treat the monetary system like a casino.\n\nThese guys are irrelevant. Its the system and its regulation.", "score": 5, "replies": []}]}, {"body": "> no plans on how to hedge\n\nNot exactly true. You can argue that maybe they should've been more hedged (I'd agree), but you're forgetting that as a mostly corporate bank they stood to benefit from increased rates by increasing their loan rates. They also never stood to lose money on their bonds as long as they could hold to maturity. \n\nAt the point where capital ratios were getting hit, they sold their AFS to boost reserves. At the end of 2022 their AFS was at -9% which wasn't that big a deal. They sold 80% of it, took a ~2 bil loss, and probably would've held more cash and tbills from there on if they didn't get run and shut down within 48 hours. They kept the unrealized losses in HTM but that was okay.\n\nMost banks were caught off guard by how fast interest rates rose and took advantage of the HTM loophole. JPM transferred $342 billion of securities from AFS to HTM in 2021 so they wouldn't have to report losses on the securities they transferred. Most banks did the same.", "score": 20, "replies": [{"body": "I have no idea why these professionals were still holding long term bonds back in 2021 when rates were so low and we all knew the upside is limited but downside is huge. I mean 25 year UST has lost 45%(TLT) and that risk was kind of well known.\n\nI myself was sitting on cash most of the 2021 since I had no idea why I would invest in something which yields like 1.5% but the risk can be 15% loss if rates go up 2-3 higher.\n\nI am very curious to know what were the holdings of SVB and what was their thought process to not get rid of those in 2021 when FED was still buying bonds.", "score": 8, "replies": [{"body": "You have to dance till the music stops.", "score": 3, "replies": []}, {"body": "It's because they have such a huge surge of deposits, so they went on to buy the safest asset in the world, UST.\n\nDon't forget the FED at the time heavily emphasized inflation is transitory and at one point I recall they even said rate hike is not needed.\n\nAnd honestly it's all unrealized book loss, they just need to hold till maturity which would return their principle and the distribution. \n\nI doubt they would have survived even if they hedged it somehow.", "score": 1, "replies": [{"body": ">so they went on to buy the safest asset in the world, UST\n\nA 30 year UST bond maybe safest but not lower risk. Why would anyone buy a 30 year UST at 2.3% rate, that is just crazy. \n\nUnrealized loss means nothing when you are playing with margin. A bank like SVB cannot just take depositors money and play in the market without managing risk. They have to be diligent about liquidity crisis.\n\nYeah FED said inflation is transitory, does not means I am stupid enough to go buy 30 year UST at 2%. I would put the money in short end of the UST, something like 5 years. But that will mean I will be making less money but my capital will be not locked for 30 years.", "score": 1, "replies": [{"body": "They don't lose as much liquidity as you think, it is common to use Treasuries as collateral. Although I am not entirely sure how it works other than its the safest most liquid collateral in the repo market.", "score": 1, "replies": []}]}]}]}, {"body": "The only way they could have held to maturity was if yields had remained below 3% or less as anything higher would have caused their customers to withdraw money to get higher interest payments somewhere else. Sure, if they could have held to maturity it would have been alright. But that's a big uncertainty and a gamble. And you shouldn't gamble the existence of your bank on something you can't control and can't predict accurately.", "score": 2, "replies": []}, {"body": "Agree. The Fed did not do them any favors and yes all the larger banks are able to “hide” those losses.", "score": 6, "replies": []}]}, {"body": "“The SVB c-suite sold large portions of stock in the run up, this is not a coincidence:”\n\n1. C-level has very little control on how much shares they can sell, their stock is usually on a plan managed by a third party. Those 3rd party always sell shares regularly over time, as they should.\n2. If they knew the ship was about to sink, inside trading at that level would be the most moronic thing to do, and a good path to jail.", "score": 3, "replies": []}, {"body": "Huh, I'm being told it was actually because of wokeism.", "score": 18, "replies": [{"body": "I was told it was eating too many avocados and buying lattes that sank them", "score": 13, "replies": [{"body": "> it was eating too many avocados \n\nShit", "score": 0, "replies": []}]}, {"body": "Sorry my fault . I didn’t pull myself up the bootstraps.", "score": 3, "replies": []}, {"body": "Gay guy Peter Thiel telling LGBT groups to remove their money from this bank was exactly the opposite. He caused the bank run.", "score": -5, "replies": [{"body": "What is it with *conspiracy theorists* and other hate groups to *always blame fringe minorities*? LBTQ people now, the Jews yesterday.\n\n\n\n\nNewsflash dude, it wasn't due to them withdrawing cash. LBTQ people are all unique individuals and don't act as a cult, most don't even share political or religious ideals or know who Pete is. The problems happened because *the bank fucked up* and nothign else. They invested poorly, for a year, and eventually a straw broke the camels back.", "score": 5, "replies": [{"body": "You're really underestimating the billionaire Peter Thiel that was one of the founders of Founders Fund that recommended using SVB and then last week recommended removing all money from it.", "score": -2, "replies": [{"body": "Its not a gay conspiracy, you absolute donkey. It is a billionaire technofascist manipulating the markets again. He didn't tell LGBTQ groups to withdraw money, he told tech shitheads to.", "score": 1, "replies": []}]}, {"body": "He's worth over $4 billion. I don't get why you insult him by claiming he is fringe.", "score": 1, "replies": []}]}]}]}, {"body": "Greed", "score": 2, "replies": []}, {"body": "Can't wrap my head around the fact it's not conflict of interest to be a CEO in private bank and some sort of regional head of Fed at the same time, anyone...?", "score": 2, "replies": []}, {"body": "Wow! Thank you for the reminder that many of us have seen this before. I'm so sick of this!", "score": 5, "replies": []}, {"body": "This belongs in r/conspiracy", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "The bank run itself was not seasonal. There was an existing liquidity crunch, which I am suggesting was caused in part by seasonal factors and interest rates, that triggered a bank run.", "score": 9, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "It’s not fully fleshed out, but there are things that happen during quarter closes that could contribute. All public companies have to submit their audited 10-Q as of quarter close. That means they have to disclose things like loses. One of the issues with SVB was that they had a lot of unrealized losses in their treasury securities. Or it could be a common time when various securities mature. It’s also a time when money lenders are actively seeking to close positions in preparation for their own reporting requirements and calling in their loans. The main point is that issues can arise any time of year, throughout the year, BUT they only come to light when they have to be disclosed at these reporting dates or a company suddenly has its hand forced and finally collapses.", "score": 4, "replies": [{"body": "10-Qs are not audited. They’re reviewed. Only 10-Ks are audited. They don’t get any formal letter from an audit firm like they do in a 10K, and the level of scrutiny is far less in a review. So if they didn’t catch it in an audit, they’re not catching in a review. \n\nI also saw you quote pwc guidance improperly. You come off as an authority figure, but you’re out of your lane on a few different things. You still have a few things to learn. \n\nMy credentials: CPA who specializes in financial reporting.", "score": 2, "replies": [{"body": "They most certainly do furnish a signed letter by the audit firm and it’s the same audit firm that does their annual audit, so they would and in fact did discuss this very issue if you actually bothered to read their 10-q. Don’t ever mention pwc again. Just gross", "score": -4, "replies": [{"body": "You’re doubling down. Lmao. Everything you just said is wrong. Yikes. Show me the audit report they filed on their 10-Q. Even then I haven’t looked but I sincerely doubt they filed a 10-q. Most American banks are 12/31 filers. So you won’t get a Q till at least 4/20. Given it’s a bank it’ll most likely be pushing closer to its 40 day limits.", "score": 1, "replies": [{"body": "Use your brain pls. Also feel free to post you license # so I can report you to your state board", "score": 1, "replies": []}]}]}]}]}, {"body": "I think you're really overthinking that one aspect of the post lol", "score": 0, "replies": []}]}]}]}, {"body": "Type of people that forget to sell their pumpkin futures before Halloween.", "score": 0, "replies": [{"body": "Best explanation I’ve seen so far tbh", "score": 1, "replies": []}]}, {"body": "Basically what you are saying is these guys can count very well", "score": -1, "replies": [{"body": "Counting is hard, to be fair", "score": 1, "replies": []}]}, {"body": "Three banks have failed since March 8 2023.  Like the Savings and Loans in late 1980’s.  Taxpayers paid the majority of that bailout.  Could is this a start of another trend.   \n It is said Fed are going to bail out SVB! FDIC has a bit over 1 billion to bail our banks. \n\nWhat if we see one small and midsized bank failing every week… FDIC does not have enough funds to bail them all. Imo", "score": -2, "replies": [{"body": "First, you can't bailout a ship that has already sunk. Second, SVB doesn't need a bailout because the assets will cover the deposits. Investors are the ones that will lose.", "score": 3, "replies": []}, {"body": "Signature and SVB. Who’s the third? Silvergate? That was weeks ago.", "score": 1, "replies": []}]}, {"body": "Could the speed at which they took over it be because they knew who was in charge? They knew whatever was happening wasn't an accident?", "score": 1, "replies": []}, {"body": "Those assets should never have been classified as held to maturity.  They only did that to avoid marking them to market.  Saw the CEO of 5/3 bank on CNBC and he said that 99% of their securities are classified as available for same while laughing at HTM as ‘hide to maturity.’", "score": 1, "replies": []}, {"body": "|  Inversion: when the market expects interest rates to rise in the nearfuture, long term return ls can be lower than shorter term bonds.\n\nSounds backward to me, maybe I'm the dummy though. Bond prices are inversely related to yields. Prices go up when there is higher demand for those bonds. So a yield inversion means more people are buying longer-term bonds (lower yield than shorter term) to lock in the yield because they expect rates to *fall* not rise. This is why yield inversion is a \"indicator\" of a recession. Because the fed will have to lower rates to relieve financial stress.", "score": 1, "replies": []}, {"body": "The earth is sick!", "score": 1, "replies": []}, {"body": "One would think….", "score": 1, "replies": []}, {"body": "Obvious answer:  SVB wasn't run by a first-year economics student.", "score": 1, "replies": []}, {"body": "I think a lot of these chairman and executives didn’t pay attention in class. They even teach ARMs, SIV, MBS, and many other things that they all say “I don’t know” about when called to testify under oath.", "score": 1, "replies": []}, {"body": "And Jim Cramer is the gift that keeps on giving. He was promoting it.  SVB.  Watch the next stock he promotes and go short on it.\nhttps://youtu.be/2N-741AaUyw", "score": 1, "replies": []}, {"body": "Yeah but, at least they were really ahead when it comes to diversity, equity and inclusion", "score": 1, "replies": []}, {"body": "They got wrecked by not understanding something four year olds can understand. When you loan money to someone you don't have that money anymore until they pay it back to you.", "score": 1, "replies": [{"body": "When you owe the bank a thousand dollars it’s your problem. When you owe the bank a billion dollars it’s the banks problem.", "score": 1, "replies": []}]}]}
