{"title": "[deleted by user]", "selftext": "[removed]", "id": "11ywekq", "created_utc": 1679518657.0, "score": 0, "upvote_ratio": 0.49, "num_comments": 92, "comments": [{"body": "Lol this exact post is coming up in a bunch of different subs with different accounts posting the same thing.", "score": 43, "replies": [{"body": "Yea, fuck this guy.", "score": 17, "replies": []}]}, {"body": "…Did you intentionally misspell Chick-fil-A to prove how classy you are?", "score": 48, "replies": [{"body": "This guy filets.", "score": 24, "replies": []}, {"body": "I always have thought it was Chic-fil-A", "score": 5, "replies": [{"body": "It looks as though you may have spelled \"Chick-fil-A\" incorrectly. No worries, it happens to the best of us!", "score": 6, "replies": []}, {"body": "Haha “Chic” — I see what you did there", "score": 2, "replies": []}, {"body": "That’s the Mandela effect my guy. Welcome to your new reality!", "score": 1, "replies": []}]}, {"body": "This guy posted the same shit on Wallstreetbets and changed it to Starbucks", "score": 2, "replies": []}, {"body": "Lol yes. \n\nMy Chick fila has no less than 50 cars in its drive thrus at all times. I live in a suburb that isn’t that densely populated and there are many options to eat elsewhere. \n\nThe funny thing is the lobby is open and there is always a small line.\n\nI think people wait almost an hour for it. I remember before they made the second drive through the cars were wrapped in a circle in the parking lot and blocking off parking spaces and traffic in the plaza for the other businesses. They complained and the lot was expanded and a second drive thru was made.\n\nI can’t imagine sitting in a drive thru for an hr for any food.", "score": 2, "replies": [{"body": "30 cars in line, and I get through in 10 minutes or less.", "score": 1, "replies": []}]}, {"body": "Sorry I really did not mean to", "score": -6, "replies": []}]}, {"body": "Due to inflation I had to reduce my chick fil a meals to twice a day from the usual three times a day.", "score": 21, "replies": [{"body": "Popeyes chicken is charging $4 for French fries. And $3 for a drink while the sandwiches are still $5. 4 bucks for fries!", "score": 3, "replies": [{"body": "They get monw of my cash now.", "score": 1, "replies": [{"body": "Typo none!", "score": 1, "replies": []}]}]}, {"body": "Maybe I need a meal a day", "score": -8, "replies": [{"body": "Bet you do Karen.", "score": 2, "replies": []}]}]}, {"body": "I can’t tell if this is supposed to be satire or OP is just a sad c^unt", "score": 18, "replies": [{"body": "Seriously this", "score": 5, "replies": []}, {"body": "C to the power unt", "score": 6, "replies": []}]}, {"body": "Ohh piss off you karma whore this was already posted on wsb.", "score": 9, "replies": []}, {"body": " Same thing posted in WSB.....different users....interesting", "score": 5, "replies": [{"body": "Shell accounts. I need to start a few. Just lazy AF.", "score": 1, "replies": []}]}, {"body": "Mr. Powell.. is that you?", "score": 6, "replies": []}, {"body": "Man blames umbrella owners for rain. More at 10", "score": 4, "replies": []}, {"body": "So what about Fed printing 80% of entire USD supply in history since 2020", "score": 3, "replies": []}, {"body": "WTF is this post ?", "score": 3, "replies": []}, {"body": "Okay Mr. SVB CEO I’ll stop eating at Chick-Filet!  Also, I’ll go out and get a job so you can enjoy your iced caramel latte!  Enjoy the caviar as well a$$ clown!", "score": 3, "replies": []}, {"body": "Greatest post ever.... and guilty :)", "score": 9, "replies": [{"body": "Thank you, friend. You are so handsome looking.", "score": -8, "replies": []}]}, {"body": "Is this a serious post?\n\nIf it is, the cause of inflation is much more complicated than that on a global scale.", "score": 2, "replies": [{"body": "I think its supposed to be irony? Like blaming consumer demand instead of the obvious and vast increase in the money supply.", "score": 7, "replies": [{"body": "Uh, not just the increase in money supply either. Doesn't help. Again, it's more complicated.\n\nExample 1.   When oil companies can't find the needed material and skilled workers to work in the oilfield, production doesn't ramp up as fast to meet demand. That's if they want to ramp up production that fast.  Several CEOs (interviews and Dallas Fed survey) have said they aren't interested in doing so to make shareholders happy.  Anyway, slowed production increases the price of oil. Increase in oil prices ends up being higher prices at the pump.  Higher prices at the pump (across the board) means higher cost for travel and delivery of goods. So on and so forth.\n\nExample 2:  Avian flu infects farms.  Farmers have to slaughter millions of chickens.  Guess what happens to the price of eggs and poultry.\n\n[https://www.theguardian.com/science/2022/apr/28/egg-factory-avian-flu-chickens-culled-workers-fired-iowa](https://www.theguardian.com/science/2022/apr/28/egg-factory-avian-flu-chickens-culled-workers-fired-iowa)\n\nExample 3: Mississippi dries up, preventing the transportation of goods along a major hub for shipment.  Guess what happens to the prices of those goods.\n\n[https://www.youtube.com/watch?v=MM-menv6EJA](https://www.youtube.com/watch?v=MM-menv6EJA)\n\nI can list almost half a dozen other factors that affect the prices of good in not only the US, but the world.  Inflation is a much more complicated subject than many people want to understand.  Seems to be this desire to find the \"easy\" target to blame.\n\nAs far as demand goes, the economy ran hot for years with low interest rates.  Covid hit the globe and shut things down. People became anxious to go out and spend after being cooped up in their homes while saving money.  There were economists that were predicting a spike in inflation for awhile.", "score": 1, "replies": []}]}]}, {"body": "Was this copy and pasted I seen this same shit from like 2 different people", "score": 2, "replies": []}, {"body": "Is this some sort of poor joke I'm too rich to understand?", "score": 2, "replies": [{"body": "It’s some rich joke I’m too poor to understand", "score": 1, "replies": []}]}, {"body": "I saw this dumb ass post in WSB earlier today.  🙄", "score": 2, "replies": []}, {"body": "LOL, this rant reminds me of posts on local subs complaining about traffic and lines.\n\nIf you are in traffic, and complaining about traffic, you are literally part of the problem and have nothing to complain about.\n\nAlso, consider parking your car and walking your fat ass into Starbucks or Chik-fil-a to order inside. Save the whales by not letting your car idle for 25 minutes.", "score": 5, "replies": []}, {"body": "The biggest contributor to inflation is government & corporate spending. The people you're ranting about are a tiny drop of what the real problem is. They are just trying to live their lives and survive dude. We are the ones who have to deal with the consequences of the greed and recklessness of our government/corporations. We get stuck with the consequences of their actions and get left behind while they get a slap on the wrist. It's absurd.\n\nEdit - It's not even a slap on the wrist. The whole entire rulebook just got re-written for the rich.", "score": 4, "replies": [{"body": "You were diagnosed with cancer? Have you tried eating organic and have different genes?   \nNo?   \nYou deserve to die then", "score": 1, "replies": []}, {"body": "Quit complaining and start thinking about how you’re gonna make yourself rich.", "score": 1, "replies": []}, {"body": "Oh boy I got the wrong sub.", "score": 1, "replies": []}, {"body": "Nonsense. wtf are government and corporates spending on so much?", "score": 1, "replies": []}]}, {"body": "While absolutely hilarious, this is so wrong. We have the Fed to thank for it. And don't worry, eventually everyone without a job will run out of money and you'll be able to get your latte in 5 minutes.", "score": 3, "replies": [{"body": "Run out of money? I thought we were all still living like royalty from the stimulus checks? 🤣🤣🤣", "score": 2, "replies": [{"body": "Yes seriously , that tiny bit of money stretched out for years at 10 cents a day", "score": 2, "replies": []}]}]}, {"body": "You sir are a gentleman and a scholar.", "score": 2, "replies": [{"body": "And an athletic supporter.", "score": 0, "replies": []}]}, {"body": "This is the greatest!", "score": 0, "replies": [{"body": "Such a great gesture!", "score": 3, "replies": []}]}, {"body": "Interest rate to the moon, job cuts will reduce your chick fil a spending to Taco Bell", "score": 1, "replies": []}, {"body": "I wish Jpowell would be the hero he needs to be and drop these slack jod no good nik layabouts  with a 100 basis point hike.", "score": 0, "replies": []}, {"body": "There are 5 trillion reasons for the inflation we are seeing. The Kung Flu of 2020 and the worlds Central Banks response to it, are to blame. Nothing else. Idiotic Americans got used to handouts for a couple years and now need to get their fix by going deeper into debt. This won't end well. The real culprits are the CDC, WHO, China and the Central Banks of the World.  Never ever forget that.\n\nThis is all because of a Pandemic created in China, partly using American tax payer money for gain of function research. We paid for this......", "score": -8, "replies": []}, {"body": "I say this to my retired wife all of the time. Why aren't these people at work? Waves at the throngs in the drive throughs and stores.", "score": -2, "replies": [{"body": "Why aren’t you at work?", "score": 2, "replies": [{"body": "Because I'm retired after working for 40 years?", "score": 0, "replies": [{"body": "Sucks you didn’t have a job that afforded you the ability to step away during the day to run small errands, get food, etc. I guess.", "score": 0, "replies": [{"body": "I didn't need a job. I'm retired. I have enough to survive until I die.", "score": 0, "replies": [{"body": "You’re clearly confused. Many of us have jobs that let us leave work during the day to get food, run errands, etc. That answers your question of “why aren’t these people at work.” If you had a flexible job for your 40 years of working you’d not be asking such weird questions. \n\nI’m both employed making a few hundred thousand a year, and run errands during the day. It’s possible to do both.", "score": 0, "replies": []}]}]}]}, {"body": "adjoining illegal aloof correct compare rustic sense vase coherent physical\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -4, "replies": [{"body": "What did my post have to do with GameStop?\n\nPS: they lost over $300m in 2022.", "score": -2, "replies": []}]}]}]}, {"body": "Do you realize how much the population has grown in the last 20 years? Way more people about", "score": 0, "replies": []}, {"body": "Some here really like to jerks off to jpowell.", "score": 0, "replies": []}, {"body": "I agree. I said it over 2 years ago in here. “We have a demand problem. Not a supply problem”. Everyone just consumes no matter what. The good news is that others are starting to see it as well. Soon the realization will turn into action. Hopefully lol", "score": 0, "replies": []}, {"body": "The man has a point. We are not blameless in this. Although I think we all subliminally know the system is fucked and might as well let it rain", "score": 0, "replies": []}, {"body": "I prefer Wendies, sir.", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "Take my Karen Downvote and shut up.", "score": 1, "replies": []}, {"body": "Your first mistake was spending any longer then 5 minutes at any given Starbucks", "score": 1, "replies": []}, {"body": "The inflation excuse has been the biggest con job this side of Bernie. And that's saying something", "score": 1, "replies": []}, {"body": "You know own you are going to all those places too right?\n\nHow are you different than everyone else in line?", "score": 1, "replies": []}, {"body": "Sweet copypasta", "score": 1, "replies": []}, {"body": "Did you not get your coffee!!! Geez..", "score": 1, "replies": []}, {"body": "I know what you mean, I skipped by your moms place the other day cuz the line was so long", "score": 1, "replies": []}, {"body": "😂", "score": 1, "replies": []}, {"body": "LOL, now I do not know what pissed this guy off more, whether waiting in line for his caramel coffee or losses in his account as JP raises rates and his stocks go down...", "score": 1, "replies": [{"body": "Because my stock plummeted!", "score": 1, "replies": []}]}, {"body": "Someone needs a Snickers", "score": 1, "replies": []}, {"body": "It's posts like these that are why I only lurk here anymore.\n\nWhat exactly does this contribute to stock market talk? Think OP would be more at home on Facebook.", "score": 1, "replies": []}, {"body": "I get what you're saying but inflation has been brought by Berkshire Hathaway this time. Waeeen Buffet said in 2020 of course we are gking to inflate we lost so much money from the pandemic we have to recoup our loss. They own so many companies that once started the ones they dont own were forced to inflate from his moves. Want it stopped? Start with Marie Calendars and Mrs.See's candies. Then find the rest. Seriously. All this other mess is after the real fact.", "score": 1, "replies": [{"body": "Looked like weenie buffet. Warren Buffet.", "score": 1, "replies": []}]}, {"body": "Filet those wannabes. But your point is true soooo many have ridiculous car payments making near nothing in their shitty rented apartment with loads of debt and complain about people better than them.", "score": 1, "replies": []}, {"body": "Did you copy this from the same exact post on WSB?", "score": 1, "replies": []}, {"body": "who? me?", "score": 1, "replies": []}, {"body": "Is this real? I thought they kept all the regards over on WSB? \n\nIf this Karen is serious, it’s just kinda pathetic.  There are quadrillions of derivatives on their books. 10s of trillions that have been spent to bail out the banks over the last decade or so. F*cking Pentagon has lost like 10 trillion and said *opsies*. That’s not even getting to trillions in debt on the feds books. \n\nLet’s all shed tears for the guy who can’t get a reservation at a restaurant when there are single parents out there working two full time jobs to stay afloat. Money can’t buy you class, not even with inflation.", "score": 1, "replies": []}, {"body": "Put it in a remarkably cunty way but it is somewhat correct that Western consumer culture has contributed to inflation.", "score": 1, "replies": [{"body": "I agree with you very much", "score": 1, "replies": []}]}, {"body": "This country is going wherever it’s headed. Your 1-100,000 opinions and modifications to life don’t mean shit when we have 330,000,000 people in the USA. We will have 500,000,000 by 2040 unless we get an actual pandemic. Bunch o softies whining about lines, imagine waiting in a line to go on a train to an internment camp. Could be worse bruh, enjoy your Carmel Frappe and stop yo bichhhiiiinnn! With all due respect!", "score": 1, "replies": []}, {"body": "So classy you shit on other people just getting by but think anything caramel from Starbucks and a lunch at Chick-Fil-A is classy. And you’re complaining about it on reddit?! You must be from the upper echelon! \n\nWe’re not worthy!!! Please go to [rich.reddit.com](https://youtu.be/dQw4w9WgXcQ) (Unlike u/Agreeable_Ad4307, brokies beware you need $100MM AUM to access).", "score": 1, "replies": []}, {"body": "So much hate for no reason", "score": 1, "replies": []}]}
{"title": "Where will the stock market go after tomorrow's Fed meeting?", "selftext": "023-03-21 Stock Market Diary\n\n&#x200B;\n\nUS Stocks.\n\nIn fact, yesterday there was news that JPM they may have to convert the 30 billion saved to FRC into stocks or bonds, today's news is that FRC is going to slim down and save itself, the market seems to further think that FRC should have dodged a bullet, FRC surged 40% +, the tight situation of the banking system seems to be eased, so the stock market strengthened further before the Fed meeting, today the three major indices rose again by about 1%. While the market is still expecting a 25 bps rate hike tomorrow (current FEDWATCH probability is over 80%), the market is also expecting a possible dovish tone from the Fed at the same time.\n\n&#x200B;\n\nI think the current financial market region is stable, the FED also emergency bailout of SVB depositors as well as to facilitate the merger of Credit Suisse UBS, and in order to alleviate market concerns, but also joint other five major central banks to provide liquidity to enterprises in need of U.S. dollars, do so much, the U.S. stock index also rose above the price of SVB before the bankruptcy, the financial market is basically stable, the Fed should be in line with the 80% of market participants expected to go 25 basis points, while they may slow down the pace of tapering, and the financial markets to make a commitment to market stability, last year when the British pension crisis, the United Kingdom had temporary QE, the Fed may follow the practice.\n\n&#x200B;\n\nIf the United States really raise interest rates by 25 basis points, indeed short-term to maintain the credit of the Fed, but to the already overburdened financial markets and press a heavy burden, perhaps before their meeting in May, the financial markets will have thunder to burst, and U.S. stocks on the Fed's easing expectations have been speculating for 2-3 weeks, from another point of view, the Fed's round of table expansion is also real, the market The liquidity is more, and it makes sense for the stock market to rise. From the technical graphics, QQQ broke through the upper edge of the downward trend channel near 308 today, closing on the strong resistance level of 310, which is a strong signal, but the volume of the stock market in the past two days are very small, whether it is an effective breakthrough is still difficult to say, or wait for the Fed meeting and then judge the direction of the market for a period of time after it.\n\nUS Dollar.\n\n&#x200B;\n\nU.S. stocks are strong but the dollar index is still down slightly, on the one hand, no matter how the Fed's rate hike cycle to the end, even if the 25 basis point rate hike this time does not mean that the FED can maintain interest rates at high levels for a long time, on the other hand, the market believes that the risk of the financial system is decreasing, so must sentiment is receding, which is the main reason for the decline in safe-haven assets today.\n\n&#x200B;\n\nThat's all for today's analysis. Your attention is the biggest motivation for my daily progress. If you have any questions or questions about the stock market, please add a friend to my private message to ask, I am Amy, thank you for your support.", "id": "11yizkl", "created_utc": 1679491333.0, "score": 28, "upvote_ratio": 0.62, "num_comments": 87, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|2 weeks ago\n**Total Comments**|78|**Previous Best DD**|\n**Account Age**|2 weeks|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": ">What a load of bullshit. You're just a poor person pretending to be rich and successful.", "score": 183, "replies": [{"body": "We actually agree for once.", "score": 41, "replies": [{"body": "Yup. Op is a worthless poor.", "score": 3, "replies": [{"body": "Long live the jeans", "score": 1, "replies": []}]}, {"body": "why", "score": -27, "replies": []}]}, {"body": "Someone adjusted his settings to violence today", "score": 21, "replies": []}, {"body": "Now now let’s be civil bot.", "score": 12, "replies": [{"body": "Another abominable robot.", "score": -24, "replies": []}]}, {"body": "Oh, you beautiful machine.", "score": 4, "replies": []}, {"body": "Yes indeed. No bet or screenshot", "score": 1, "replies": []}, {"body": "VM didn’t even bother to give us the tldr went straight savage![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Literally market crashed today wtf", "score": 1, "replies": []}, {"body": "Oh your ass is broke soon bitch. Sux that 4% nipple. ![img](emote|t5_2th52|4267)", "score": 1, "replies": []}]}, {"body": "It'll go to the right.", "score": 23, "replies": []}, {"body": "Into my ass", "score": 19, "replies": [{"body": ">Into my ass\n\n I'm sure you're a pervert.", "score": -34, "replies": []}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "no", "score": -3, "replies": []}]}, {"body": "I’m not going to read all that but my prediction is the market will most likely go up or maybe even down. It’ll probably also go to the right.", "score": 16, "replies": [{"body": "All of these will be somehow simultaneously wrong.", "score": 1, "replies": []}]}, {"body": "This is unreadable", "score": 13, "replies": [{"body": "\"the markets will have thunder to burst\" lol", "score": 13, "replies": []}]}, {"body": "Hey, do you have a source? Please add a link in the post or as a reply to this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}, {"body": "Yolo’d calls on AMC with the last $50 in my brokerage account. So it’s most likely going to tank.", "score": 7, "replies": [{"body": "This is fucking weird, OP\n\nhttps://preview.redd.it/pf6w9glxedpa1.png?width=750&format=png&auto=webp&s=f12bba7df2d8267a114e5437bf284766f909b938", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "https://preview.redd.it/bsnee6o3cjpa1.png?width=750&format=png&auto=webp&s=a7563a8ad110a854e0afc4a2a19028d7ac19e833\n\nAI is getting scary. This isn’t the sexbot we dreamed of in our teens", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Infinite fly was clearly turned on by you throwing your last $50 in the market down…you thirst trap you", "score": 3, "replies": []}]}]}, {"body": "Stonks only go up", "score": 9, "replies": [{"body": "I'm sure that's true.", "score": -12, "replies": []}]}, {"body": "Fomc is today though.", "score": 6, "replies": [{"body": "you actually think they bothered to look at a calendar lol", "score": 2, "replies": []}, {"body": "Yeah I almost closed my 0DTE calls wtf is this shit", "score": 0, "replies": [{"body": "Bet you’re regretting that now.", "score": 1, "replies": [{"body": "Sold half to recoup cost; 0 feelings about it; not a reguard lmao", "score": 1, "replies": []}]}]}]}, {"body": "Highly regarded", "score": 4, "replies": []}, {"body": "What is OP's long term goal here? \n\nThis just working on being an influencer? Also given all this what are your credentials v. any other SM persona?", "score": 5, "replies": []}, {"body": "My guess is that we finish the week well off of todays highs. Powell’s rhetoric was what I expected, “Yes, we have to take bank failure into account but we are not seeing any rate decreases”. The market has about a point decrease priced in.\n\nI think we assess his comments and head lower. No reason to rally right now, but we all know this market rarely makes sense.", "score": 2, "replies": []}, {"body": "Stock market go brrr", "score": 4, "replies": []}, {"body": "brrrrrr brrrr brrrrrrrr", "score": 3, "replies": [{"body": "brrrr？", "score": -17, "replies": [{"body": "That’s the sound of WallSTREETbets white noise machine. It helps us go to sleep at night", "score": 1, "replies": [{"body": "I sleep well.", "score": -5, "replies": [{"body": "Ahh you must be a BOT or new AI", "score": 3, "replies": []}]}]}, {"body": "More like pew pew pewww", "score": 0, "replies": []}]}]}, {"body": "Isn't the fed meeting today?", "score": 2, "replies": []}, {"body": "Stock market go brrr brrr brrr", "score": 1, "replies": []}, {"body": "I read a paper somewhere (think I was only a podcast maybe), that markets already anticipated a fat 100bp rate cut by the FED.\nPersonally, I think it's not gonna happen. Have you heard that somewhere? In case this is true, we will expect a huge downfall of the markets later in the day.", "score": 0, "replies": []}, {"body": "Market volume speaks otherwise. 🤔", "score": 1, "replies": []}, {"body": "Positions??", "score": 1, "replies": [{"body": "[deleted]", "score": -10, "replies": [{"body": "Post your position. This is WSB and not WSJ.", "score": 10, "replies": []}]}, {"body": "Pulled out, took the loss of 700$ every market is almost symmetrical ![gif](emote|free_emotes_pack|facepalm)", "score": 1, "replies": []}]}, {"body": "Tits up! ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Calling it now, the whole market will go tits up and we won't see green numbers again until 2030", "score": 1, "replies": [{"body": "Till after the great War to end all wars part III", "score": 1, "replies": []}]}, {"body": "Mods really need to let us report AI, however dumb it may be, because this is absolute trash. It says a whole lot without actually saying anything, and of course it has upvotes, because der ta derrr.", "score": 1, "replies": []}, {"body": "To the right. \n\nBet me!", "score": 0, "replies": []}, {"body": "Right", "score": 0, "replies": []}, {"body": "to hell", "score": 0, "replies": []}, {"body": "Generally Up then down", "score": 0, "replies": []}, {"body": "You”re welcome, but the support port is empty from my bank to give it to you at the moment. Apologize for that sir.", "score": 0, "replies": []}, {"body": "Papa Powell will come out and fook both bull and bear alike. End of story.", "score": 0, "replies": []}, {"body": "Accounts brand new......", "score": 0, "replies": []}, {"body": "Soft landing", "score": 0, "replies": []}, {"body": "Aruba", "score": 0, "replies": []}, {"body": "Up and up", "score": 0, "replies": []}, {"body": "Thanks Amy", "score": -1, "replies": []}, {"body": "If its 0.25% to the moon.  If its 0.50% to Hades.", "score": 0, "replies": []}, {"body": "Up or down", "score": 0, "replies": []}, {"body": "We’ll find out in 10 mins", "score": 0, "replies": []}, {"body": "just read the headline, but I bet it goes up or down.  Be sure to look at historical graphs for shapes like cups, shark teeth or a perfect silhouette of Mt Washington at dusk for more in depth analysis.", "score": 1, "replies": []}, {"body": "“Broke through the upper edge of the downward trend channel” “closing on the strong resistance level of 310, which is a strong signal”\n\nYou’re an idiot for buying into this trend channel/resistance level crap that someone sold to you.", "score": 1, "replies": []}, {"body": "I've got a garbage bin out back they can borrow.", "score": 1, "replies": []}, {"body": "This post looks like AI generated garbage", "score": 1, "replies": []}, {"body": "Maybe this is an opportunity", "score": 1, "replies": []}, {"body": "Inflation and the banking problem are two different dimensions, and they do not contradict each other.\n\nFirst, the ostensible course is to hold off on raising interest rates, then straighten out the banking problem, and then come back to the inflation problem. In all likelihood, that is the route to take.", "score": 1, "replies": []}, {"body": "actually, the rate is hiking, and we are fell to the hell.", "score": 1, "replies": []}, {"body": "Let me polish my brand-new crystal ball...", "score": 1, "replies": []}, {"body": "It may go up, or it may go down. Trust me", "score": 1, "replies": []}, {"body": "So many words, undergrad.", "score": 1, "replies": []}, {"body": "TLDR", "score": 1, "replies": []}, {"body": "Yes , I understood some words here", "score": 1, "replies": []}]}
