{"title": "[deleted by user]", "selftext": "[removed]", "id": "ungcsm", "created_utc": 1652293306.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 26, "comments": [{"body": "Check options profit calculator.", "score": 6, "replies": [{"body": "Do you have a link?", "score": 1, "replies": [{"body": "https://www.optionsprofitcalculator.com/calculator/long-call.html", "score": 1, "replies": []}]}]}, {"body": "Terrible idea. Keep the shares till this volatility is sorted. Leaps are best ITM anyways.", "score": 6, "replies": []}, {"body": "It works if the stock comes back in a timely manner so you don’t lose all your time value. I bought some long term options when I thought we were headed back up after the dip the end of April and now I’m sitting here like shit, hope things turn around. If I were you I’d keep your stock unless you are totally comfortable with losing it all if things take an even worse turn like some people are expecting.", "score": 3, "replies": []}, {"body": "I wouldn’t do it. Last year i sold off my FB shares for leaps and now my leaps are almost worthless. If i kept the shares i would have been down less. Leverage is a double edged sword.", "score": 2, "replies": [{"body": "Same here but replace FB with F", "score": 2, "replies": []}]}, {"body": "What’s with people selling shares for leaps? \n\nI swear someone posted this same post about COIN like a week ago.. where are you guys crowdsourcing this idea from?", "score": 4, "replies": [{"body": "Dunno, but I can almost guarantee that they are not considering the fact that leverage cuts both ways...", "score": 8, "replies": []}, {"body": "Rip coin leaps lmao", "score": 2, "replies": [{"body": "!", "score": 1, "replies": []}]}, {"body": "Too much margin. My thinking was cut loses and sell some shares to bring my account back under control. And then with some of my free cash purchase a LEAP at between $1,200 - $1,600\n\nUp to now I’ve just been selling a few shares here and there waiting or should I say hoping for a pick up", "score": 0, "replies": [{"body": "Ok, now I’m convinced you’re the other poster.. they also said margin was an issue.. margin has nothing to do with anything here..", "score": 1, "replies": [{"body": "If I’m going to get a margin call then I need to do one of two things.\n\nPut more money in my account or liquidate some of my shares.\n\nBy selling shares I lose my position, but stop my account blowing up.\n\nBut then with some of what was left after bringing my account under control I was considering buying a LEAP\n\nSo how had margin got nothing to do with anything here?!", "score": 1, "replies": [{"body": "Why would you get a margin call? \n\nThe word margin isn’t in your post one time.\n\nOr are you just hiding the fact that you’ve already been margin called and are now panicking trying to get out of your position?", "score": 1, "replies": [{"body": "With all due respect what is your problem?", "score": 1, "replies": [{"body": "So you did get margin called and are panic closing positions?\n\nOr are you going to keep dancing around that so nobody can really help you?\n\nSeems like *you* have the problem", "score": 1, "replies": [{"body": "No I’ve not been margin called ( yet ) again what is your problem?", "score": 1, "replies": [{"body": "OK, so you are trading on margin? \n\nStill looking for a clear answer to **help you** , which is the whole reason you posted.\n\nSo either it's time to put your ego away and tell us the full story or just keep handling it on your own.. I'm sure that will go just fine.", "score": 2, "replies": [{"body": "No ego involved just resent the way you’ve accused / implied I’m some other poster.\n\nI have an account with IBKR which has around 80k of my own money that if I closed all my positions ( Tesla , Nvidia, Google ) I would walk away with, down from $160k\n\nThis last months hammering with what’s being going on in the market has got me close to being margin called.\n\nSo far I have just been selling a few shares here and there with the mindset of a recovery which obviously hasn’t happened. \n\nSo I was looking at closing a percentage of my shares to give enough breathing space and also look at the possibility of a leap to keep a position of sorts.", "score": 1, "replies": [{"body": "What margin amount and rate are you trading with?\n\nYou're down 50% which sucks but if this is a long-term account I don't see why you can't DCA into shares to lower your basis.\n\nThe issue of buying leaps is you're paying crazy high premiums for something that may turn to 0.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "It's just buying the dip when they don't have the buying power for more shares.", "score": 1, "replies": [{"body": "Crazy how people get caught up in these oversized positions with no cash on the side and just think everything will be fine.", "score": 1, "replies": []}]}]}, {"body": "go to optionstrat(dot)com ; put in your inputs", "score": 1, "replies": []}, {"body": "I might sell LEAPs to finance the purchase of shares but idk that I'd ever sell shares to buy LEAPs", "score": 1, "replies": []}, {"body": "Terrible decision to be honest. I bought GOOGL leaps after they announced their split and that was a huge blunder. Down over 90% on a Leap expiry more than a year later. Stocks wont lose so much value in a short period, its much safer to hold.", "score": 1, "replies": []}]}
{"title": "Unpopular Opinion: Economy is going to slow considerably", "selftext": "High inflation and gas prices are hurting low and middle income earners. High mortgage rates are hurting home buyers and home builders. Massive, rapid decline in stocks is hurting the wealthier savers. \n\nPeople are not going to go out to eat, take vacations, drive to attractions or buy new homes. Economic activity will slow considerably. \n\nI am not sure what that means for the future. Guesses:\n\n1- Inflation: maybe it will decline more rapidly than most expect\n\n2- Demand for oil will decline\n\n3- Wages will stop rising\n\n4- Stocks: up or down, I don’t know \n\nCombined, this will likely stop the rate hikes. \n\nWhat do you think?", "id": "unniid", "created_utc": 1652313218.0, "score": 18, "upvote_ratio": 0.77, "num_comments": 23, "comments": [{"body": "Wages will stop rising...but inflation will continue and there will be less personal liquidity.  Then the stock market will decrease.", "score": 9, "replies": [{"body": "Where do you people work. The wage at my establishment is far below cost of living so why would or should it stop rising? The financial give backs from the 2009 crash are still giving the corporate greedy windfall record quarter after quarter! We never received the thanks and were never made whole again for participating in the most patriotic act of saving our economy after the same greedy tyrants destroyed it! We are do for another disaster accept this save will not be on the average American alone because they never gave the money back to the American workers so that we could give it up again! If we had the proper pay the economy would be better simply due to the fact that most poor and Middle class people spend not hoard like the rich and glutinous! SMH Where are all the decent thinking human beings at? My God we are in too deep! Government should not be FOR SALE!", "score": 2, "replies": [{"body": "I work in education.  I understand.  I agree.", "score": 1, "replies": []}]}]}, {"body": "People need to stop saying unpopular opinion when they state very popular opinions", "score": 8, "replies": [{"body": "The other one is…After review, i am revising my estimate for the SP500 down from 5,000.", "score": 1, "replies": []}]}, {"body": "Unpopular opinion? Those are straight facts", "score": 3, "replies": []}, {"body": "Wages are rising? Maybe for certain positions. Entire sectors are stagnant, however.", "score": 7, "replies": [{"body": "Wages, in aggregate, are definitely rising. There is data for this", "score": 4, "replies": [{"body": "Real world outlook, wages in relation to inflation are flat or declining", "score": 10, "replies": [{"body": "Yes but that’s always been the case, the point is that the discrepancy is getting smaller", "score": 1, "replies": []}]}]}]}, {"body": "The key here is oil prices. I agree with your statement BUT I believe travel will find a much higher demand then in the past 2 years which will in turn push oil prices to remain high. Combine this with china coming out of their COVID wave which will in also increase production and exports and push oil up …. If this is the case then we’re not at the end of the tunnel and inflation will remain high for some time", "score": 2, "replies": []}, {"body": "The problem with your end times vision:\n\nAs the economy slows:\n- inflation is immediately reversed.\n- fed stops raising its mild rate increase \n- people start buying homes again \n- builders start hiring again \n- people start entertainment (actually the economy will not ever go through this part)\n\nThe market will watch the news and then stocks increase before the reversal on Main Street.", "score": 2, "replies": [{"body": "This….supply and demand will balance out.", "score": 1, "replies": []}]}, {"body": "Literary the belief of half the country. OP: unpopular opinion.", "score": 3, "replies": []}, {"body": "Lol you're being optimistic. America has been running on fairy tales and speculation for decades. Hedge funds were losing money left and right and now they have to punish the working class for thinking we could have a piece of the pie.", "score": 1, "replies": []}, {"body": "Just wait until private credit expansion grows and then contracts....that's when you know the game is over.  The real panic hasn't happened yet.  Give it 18 months.", "score": 0, "replies": []}, {"body": "The lower and Middle class are simply under too much pressure. Extensive measures have to be taken to alleviate and social-economically progress these 2 classes.", "score": 1, "replies": []}, {"body": "Duh.", "score": 1, "replies": []}, {"body": "When the economy slowing is actually on the news, that will be the best time to buy stocks. The market is always forward looking.", "score": 1, "replies": []}, {"body": "RemindMe! 3 months", "score": 1, "replies": []}]}
{"title": "Facebook's new hiring freeze and stock slump has some insiders concerned that layoffs are coming", "selftext": "With a broad hiring freeze in place, some workers at Facebook are growing concerned that layoffs may be next.\n\nThe company told employees last week in memos seen by Insider it was enacting a hiring pause that would first affect many levels of engineers and would expand to impact \"almost every team across the company.\" \n\n\"My guess is there are layoffs coming,\" one employee told Insider. Some high-level managers are already \"talking about re-prioritizing things,\" the person added, leading them to expect the cancellation of projects and people being let go.\n\nCertain elements of last week's memos on the freeze also have people worried and trying to read between the lines, three employees said. Facebook's chief financial officer, David Wehner, wrote that the company needs to hit \"lower expense guidance,\" which it recently reduced by some $3 billion. Other vague phrases, such as \"re-prioritize work,\" \"reviewing head count allocation,\" and calling the recent stock market downturn \"a valuable forcing function,\" also struck an ominous note with some staffers.\n\nWehner noted that he would share more details with employees \"as we have them,\" while Miranda Kalinowski, Facebook's recruiting head, wrote that she was sharing \"what we know so far\" in her own note. That gave the impression to some employees that the freeze was sudden and the strategy for head count was still being developed.  \n\nAll of this, along with Facebook's recent hiring spree and the continued slump in the company's market value, has several staff bracing for layoffs. The social-media giant increased head count by 60% from the end of 2019 through 2021, according to an Insider analysis of regulatory filings. Since mid-November, the shares have plunged more than 40%. \n\n\"The 'hiring freeze' is likely just to stem the tide of spending growth on new hires as they figure out priorities,\" one of the employees said. The two other current employees expressed similar concerns, while noting that the company has said nothing about the prospect of layoffs thus far. The people who spoke with Insider asked not to be identified discussing sensitive topics. \n\nA spokesperson for Facebook, now called Meta, referred Insider to a statement given last week about the hiring freeze: \"We regularly re-evaluate our talent pipeline according to our business needs and in light of the expense guidance given for this earnings period, we are slowing its growth accordingly. However, we will continue to grow our workforce to ensure we focus on long term impact.\"\n\nNo plans for layoffs 'at this time'\n\nThe spokesperson declined to comment further, but the company told the Wall Street Journal last week that it has not plans for layoffs \"at this time.\" \n\nFacebook remains highly profitable but spending has increased and growth has slowed, worrying investors. A run on hiring in what was a very competitive tech-job market has cost the company. It's also spending billions of dollars to create the metaverse, an immersive digital world that will take at least a decade to emerge.\n\nOne manager-level employee who recently left the company said Facebook often reorganizes at the team level, and occasionally eliminates some roles. More actions like this are possible, even in the range of 1,000 people, but this person said a bigger layoff — something like a 10% reduction in its workforce — is \"deeply unlikely.\"\n\nAnother current employee agreed, citing how cash-rich Facebook is. This person sees new efforts to reduce spending, like the hiring freeze, and trimmed spending on Facebook's Reality Labs division, responsible for metaverse projects, as a good sign. \n\nHowever, an advisor to major tech companies said he would not be surprised if Facebook went the route of layoffs in the coming months. Even the most historically successful and seemingly untouchable companies are unlikely to remain immune from the current downturn. And when companies enact layoffs, they \"want it to have an impact,\" he said, typically looking in the range of a 7% to 10% reduction in force, also known as a RIF.\n\n\"You do not want to undercut and then have to do it again,\" the advisor said.", "id": "umxwi3", "created_utc": 1652231672.0, "score": 50, "upvote_ratio": 0.85, "num_comments": 23, "comments": [{"body": "They are hiring new positions in the metaverse.  You can work from home, but need to travel to the meta office for meta paperwork.", "score": 24, "replies": []}, {"body": "Didnt they just grow their workforce like 28% or something? Sounds like they hit their caps quickly. I doubt they need to lay off people anytime soon while sitting on $50B in cash and pulling in $40B in FCF a year", "score": 32, "replies": [{"body": "Exactly.  And it's also been noted that with tech-companies being hit hard since Nov. there are now more skilled/advanced engineers on the market.  So you can reduce headcount via a more experienced labor force.", "score": 5, "replies": []}, {"body": "More like market just did a 180 from the easiest money of your life (yay free money everywhere) to probably the hardest one of the hardest in the 21st century.\n\nI don’t think they would layoff pretty soon, they would probably start by reducing compensations, especially the variable ones.", "score": 2, "replies": [{"body": "Yeah but FB doesnt really nees to borrow any money anyways. Their cash reserves and cash inflows alone are bigger than most companies. Their gross margins are some of the best if not the best even in FAANG", "score": 2, "replies": [{"body": "The cash can be earmarked for something already. Also they need to show investors how are they going to make a profit without touching their liquidity.", "score": 2, "replies": [{"body": "Its probably earmarked for a large buyback or acquisition. And they pull in over $40B in FCF a year. Thats insanely profitable. Im guessing this hiring \"freeze\" is just them hitting their yearly low level engineer caps", "score": 2, "replies": []}]}]}]}]}, {"body": "They'll pivot to contractors instead. Total cost is less if it's a short term to medium term engagement and they are easily firable compared to employees. Been a contractor my whole life until recently. I've worked in companies with a global workforce where 1/5th were employees and the rest were contractors.", "score": 11, "replies": []}, {"body": "zuck is definitely doing the math regarding how to conserve his billions", "score": 6, "replies": []}, {"body": "Yup this is going to start happening to a lot of tech companies. Layoffs are going to happen which will play a big role in the housing market starting to come down, especially on the west coast.", "score": 6, "replies": []}, {"body": "They hired like 2000 engineers in december. Maybe employee churn has not been as much as they are used to?\n\nIt's good regardless for Meta to cut costs, this environment will be challenging to keep usual growth in.", "score": 3, "replies": []}, {"body": "I lived with a FB employee during the pandemic. The amount of work they did was actually shocking. I would estimate about 5 hours a week. The rest of time was spent watching TV or outside the house shopping etc. I've heard of several people who say they work FT at FB and also have another FT job which isn't a surprise once you find out how little work they do.\n\nYes I know all departments are different but I've known other people who work there who said they didn't have much to do. The fact that they increased headcount 60% during the pandemic when they already had so much fluff and redundancies is insane. Most people don't realize how badly managed the company is. Even if they laid off 10% of the company they still have 50% more than they had in 2019 when they were already overstaffed. Just amazing incompetence in leadership.", "score": 3, "replies": []}, {"body": "Anytime there is a hiring freeze layoffs are coming. Trying to hold as many open jobs to offset layoffs.", "score": 4, "replies": []}, {"body": "I was halfway through the interview process and got dumped. It’s crazy they went from daily emails to “thanks, no thanks” I don’t know anyone on the inside anymore but I’d imagine things are bad.", "score": 5, "replies": []}, {"body": "So was it a good thing that I turned down their interview 2 months ago?", "score": 1, "replies": []}, {"body": "They have ghost me out after all interviews. I'm feeling sad.", "score": 1, "replies": []}, {"body": "Who’s not surprised at all?! I’m not! A couple earning ago…I wanna say q3 of 2021 they were posting something like 32% growth YoY. How tf can a company like FB, at the size it was in 2020, scale 35% in one year? There’s no freakin way \n\nBut the market lapped it up like a bunch of kittens over a saucer of milk.\n\nI mean come to think of it, sounds kinda like a preemptive pump and dump. They’re getting beat up by data privacy measures now so maybe investors teamed up on the looting knowing that fbs core business model was about to take a blow \n\nWho wants to bet Goldman was doing something illegal in relation to that? Not that they’ll face any consequences, just that they did illegal shit", "score": 1, "replies": [{"body": "With easy money policy everyone are spending their money and probably since the money was more than enough to actually save the company they threw it on probably unnecessary stuffs like advertising (Not saying ads are unnecessary, but they could hiked their budget just because they could because there is money on the table)", "score": 1, "replies": []}]}, {"body": "Won't be surprised if they layoff. The company is in the dumps and they're gonna take a long time to recover", "score": -1, "replies": []}, {"body": "I see ads all the time to apply to meta I think they are churning the employee pool", "score": 1, "replies": []}, {"body": "I'm sure there are other companies that will happily snatch them up. Maybe not at their previous compensations, but doubt they won't find work with the labor shortage especially in a skilled field", "score": 1, "replies": []}, {"body": "I've seen layoffs pump stocks before, bullish.", "score": 1, "replies": []}, {"body": "Good move I like it. Automating machines > people", "score": 1, "replies": []}]}
{"title": "Here’s the case for buying Netflix’s stock now", "selftext": "Netflix Inc. has become a value stock — a bargain, according to Charles Lemonides, chief investment officer at ValueWorks in New York.vDuring a year that has featured a re-rating for so many rapidly growing companies that had been trading at lofty valuations to earnings, Netflix Inc. has fallen enough to make its stock compelling, Lemonides said in an interview.\n\n“The extended part of the market is extended no more,” he said, calling Netflix an even better buy at $173.10 a share (where it closed on May 9) than when he bought the stock at $225 “on the way down” in April. The stock hit its intraday high of $700.99 on Nov. 19.\n\nThe idea of buying shares of Netflix following a decline of 71% so far this year (and 75% from its high) may seem radical, but Lemonides, whose team manages about $250 million for private clients, makes a strong argument. “It seems really easy for them to manage 10% revenue growth and have margins improve,” he said.\n\nMany investors and traders describe themselves as “contrarians.” If you are really a contrarian investor who aims to take advantage of low prices when making long-term investments, such a dramatic pullback warrants a closer look.\n\nAt the close on May 9, Netflix traded for 15.3 times the consensus earnings-per-share estimate among analysts polled by FactSet. The S&P 500 traded at a weighted forward price-to-earnings ratio of 17.6. Looking back, you can see that over the past five years, Netflix has traded at much higher valuations to expected earnings, with an average forward P/E of 69.2.\n\nWhat has turned investors against Netflix is the perception that its best years of growth are behind it. When reporting its results on April 19, Netflix said its paid user base had declined by 200,000 accounts during the first quarter and estimated it would lose 2 million paid subscribers during the second quarter. This shocked investors and pushed the stock down 35% in one trading session on April 20. To put that 2 million number in perspective, Netflix said it had about 220 million “paying households.”\n\n**But what about revenue, earnings and profit margins?**\n\n* Netflix’s first-quarter revenue totaled $7.87 billion, up 2% from the fourth quarter (despite the decline in paid accounts) and up 10% from the first quarter of 2021.\n* Earnings per share for the first quarter were $3.53, compared with $1.33 the previous quarter (when spending on content was much higher) and $3.75 a year earlier.\n* Netflix’s operating margin (essentially, earnings before interest, taxes, depreciation and amortization, divided by sales) during the “terrible” first quarter was 66.25%, according to FactSet. This measure of profitability isn’t available for most companies in the financial and real estate sectors. But among the 445 companies in the S&P 500 for which FactSet calculates quarterly operating margins, Netflix ranked 16th (or in the top 4%). For the S&P 500 (which, again, trades at a higher P/E than Netflix), FactSet estimates the weighted first-quarter operating margin was 15.93%. Over the past five quarters, Netflix’s operating margin has ranged from 57.55% to 66.25%.\n* The company’s net income margin (net income divided by revenue) for the first quarter was 20.30%, which ranks at 133 among the S&P 500 per the most recent quarterly numbers available. By this measure, Netflix ranks within the top third.\n\nNetflix is a solidly profitable company, even though its entire business model has been based on subscription fees, with no advertising revenue.\n\nLemonides said Netflix will have an easy time growing revenue and earnings in part because of the potential to convert some shared accounts to paying accounts. In its first-quarter earnings press release, the company said that in addition to the 220 million households paying monthly subscription fees, an estimated 100 million more households were using the service for free through account sharing.\n\n[https://www.marketwatch.com/story/heres-the-case-for-buying-netflixs-stock-now-11652186180?mod=home-page](https://www.marketwatch.com/story/heres-the-case-for-buying-netflixs-stock-now-11652186180?mod=home-page)", "id": "un3g2y", "created_utc": 1652251044.0, "score": 0, "upvote_ratio": 0.27, "num_comments": 24, "comments": [{"body": "What annoys me most about posts like this, is that they constantly fail to compare it to other competitors. Okay, it's great Netflix has all those facts and figures your mention. Now, how do they compare to Disney+ or HBO Max or Paramount+ or AppleTV or YouTube or SlingTV or PlutoTV or....\n\nPeople constantly look at firms in isolation and claim 'This is a great company!' You know, it might be a successful company - but as an investor what matters most is where I can gain the most return on my investment. \n\nSo, the better question is: Why should I buy Netflix over any of its competitors?", "score": 9, "replies": [{"body": "Maybe, just maybe because there is no HBO in all countries despite the US, and maybe because Disney+ has ZERO Tv shows despite their marvel/tattooine eh star wars cow they are milking. I have both services and literally use Disney+ ONCE a month if they release a new marvell film or get a show like „only murders in the building“ out of luck. I do not have the time to watch 10 superhero tv shows and some boba fett running around without any backstory. Meanwhile my whole family/friends ranging from age 30 to 70 is watching netflix at least 20 evenings a month. Are most of the shows they are watching trashy women shows with love, sex, and some drama? In my eyes they are. But it is what is is.\n\nSo i ask you:  what does Disney do better than Netflix? When does HBO finall roll out worldwide and who despite us Tv show nerds (i love every hbo series - but i have to watch them on sky germany) gives a fuck about HBO in Europe/Asia? Nobody knows it. The world is not reddit.", "score": 3, "replies": [{"body": "What are you talking about.... I was commenting on comparing fundamentals of companies more than anything else. It was supposed to be a rhetorical question >.<", "score": 1, "replies": [{"body": "Ah okay. Sorry i misinterpreted it. However: 300 milion people using netflix is enough funademental i have to know that now COULD be the time to nipple netflix. If i would not have bought already in 240$ i would definetly start building a small position now. Obv we do not know if market is tanking but risk reward ratio is way better than other stocks.", "score": 3, "replies": []}]}, {"body": "HBO is not US-only? It's available in 60 countries. And Disney+ is not as diverse in content but it has a single tier which costs a quarter of the price as the comparable Netflix tier", "score": 1, "replies": []}, {"body": "At the end of the day, Netflix only has its streaming platform. No other cash-flow machines. In comparison, AT&T and Disney have other large cash flow machines. Honestly, even at $100, I'd rather buy Disney over Netflix.", "score": 1, "replies": []}]}, {"body": "Honestly. There is no reason..", "score": 1, "replies": []}, {"body": "You have the report. Use it to compare it with their competitors and if you think it's good, buy it, else forget it", "score": 0, "replies": [{"body": "I mean, yeah - but if people are going to put the time and effort into posts like this, at least put the effort to compare it to a competitor. These posts come across as people with vested interests pushing an agenda. Not saying you, but I've seen these posts a few time and they just come across as something the Netflix CEO would say on Cramer.\n\nI really do appreciate you putting the time and effort into the post, but adding at least one competitor would make it much more useful.", "score": 2, "replies": [{"body": "When I read a post like this and if it interests me, I go into the details like the ones you mentioned and do my own research before I decide if it's good to buy or leave it alone. I don't buy just because some analyst suggests buying it and I don't think there are too many posts with comparisons to their peers. For me, posts like these are a starting point...you may disagree, but each one is different", "score": 2, "replies": []}]}]}, {"body": "One reason may be PE considerations. Disney is 63 and Netflix is 15. That's quite a difference.", "score": 1, "replies": []}]}, {"body": "There are competitors. Some smaller, some growing faster. Netflix faces the law of large numbers. It ain't good to see a drop in subs when you ain't growing revenue that much either. Where's the growth gonna come from? Is it a growth or boomer stock now? Can't tell.", "score": 2, "replies": [{"body": "If subscribers aren't increasing the only way to get more revenue is from existing customers. I think we had a subscription increase recently and the other will be to crack down on password sharing in hopes existing users start paying.\n\nI take ads + password crackdown + price increases as a bad sign.", "score": 1, "replies": []}]}, {"body": "If you're cracking down on shared accounts, you're not generating revenue, you're hoping to replace lost revenue. That will be hard to do when the general consumer sentiment on limiting shared accounts is negative. This article completely brushes off investors being in tune with consumer sentiment.", "score": 2, "replies": []}, {"body": "Sounds like a bag holder wrote this. Besides, when they start with the ads people are gonna ditch for other streaming services.", "score": 2, "replies": [{"body": "The ads are a separate tier. No one will see ads that didn't specifically sign up for them.\n\nAt least that's my understanding of what Netflix plans.", "score": 1, "replies": []}]}, {"body": "Quite frankly earnings don’t matter. They are merely an accounting manipulation. The true metric is cash flow and for a company as mature as Netflix is now to struggle with consistently positive cash flow is the real reason for their crash as well as the reason I am not invested in Netflix. If Netflix was trading for 15x cash flow instead of 15x I would put a massive amt of $$ into it, but it is not. Don’t be fooled by earnings, track the cash and the reason for its valuation becomes much more apparent.", "score": 2, "replies": []}, {"body": "Are you high? Netflix is dead", "score": 1, "replies": [{"body": "Whatever you say, genius", "score": 1, "replies": []}]}, {"body": "i personally wouldn't invest in streaming companies at all, but if I was going to, mouse stock all the way", "score": 1, "replies": []}, {"body": "I wouldn't touch NFLX with 10' pole until the FED begins reversing their policy.", "score": 1, "replies": []}, {"body": "Netflix is dead they said bunch of 🤡", "score": 1, "replies": []}, {"body": "We should have listened to the OP and marketwatch. Oops!", "score": 1, "replies": [{"body": "Never too late...it could go to 600+after a brief correction", "score": 1, "replies": []}]}]}
{"title": "Thinking of capitulating to some extent and start DCAing into VTI and VOO every day/week till I run out of cash...", "selftext": "[deleted]", "id": "unfc6j", "created_utc": 1652290555.0, "score": 15, "upvote_ratio": 0.81, "num_comments": 25, "comments": [{"body": "Getting rid of margin and getting out of companies you no longer believe in is a solid approach imo.", "score": 18, "replies": []}, {"body": "If your mental health is on the line do it!\n\nEverything else is not important.", "score": 13, "replies": []}, {"body": "Why do you buy such a narrow type of stock?    \n\n\nI think your plan is good.  Drop the losers and index.  The fact that the losers have lost lately doesn't mean they are more likely to rise in the near future.", "score": 6, "replies": [{"body": "\\>Why do you buy such a narrow type of stock?\n\nlet's not dwell on past mistakes. I am just trying to minimize damage and also have some peace of mind", "score": 8, "replies": []}]}, {"body": "1) Get out of margin\n\n2) Dump companies you believe will no longer be profitable\n\n3) Delete the app\n\nI know this sounds oversimplified and quite possibly stupid, but it’ll really help prevent any mental health concerns you’ll be having in the coming months.", "score": 5, "replies": [{"body": "Thanks.\n\nI am almost done in getting rid of the margin. Only 12K left. Will take care of that tomorrow and Friday.\n\nBeginning of the week, I was deep in 120K margin and was even margin called a couple of times. Just the fact that I don't have to worry about that is a big peace of mind.", "score": 1, "replies": []}]}, {"body": "This is a good plan. VTI and VOO track very closely return-wise (the former is down \\`1-2% more right now) but I use VTI for diversification's sake. Think about it this way, being hopeful that the market \\*someday\\* recovers to January's highs, buying a share of VTI today would net you over a 20% return.", "score": 3, "replies": []}, {"body": "If this give your some relief, I also have some of your holdings:\n\nTDOC: -79% stopped dca after 92$\n\nBABA: -36% was aroud -60% down but reduced it with DCA after recent fall\n\nAMZN: -20% was very happy that my avg was 2600 but it came down big\n\nAAPL: +3% very close to getting negative\n\nMSFT: -2.5%\n\nPYPL: -9% DCAed heavily after recent results to bring the avg loss down.\n\nI am planning to move some money to TDOC. just a couple of thousand $s. I am ok to sell it at 50% loss also, but not at 92%.. what do you suggest here?", "score": 3, "replies": [{"body": "Sorry to hear that. But I don't know what to day about TDOC. I mean, we both have been burned so far. What makes you think it will perform better soon? I don't know about you, but it is DCAing constantly that make me lose so much in it. When it went down from 300 to 150, I thought wow, 50% discount, then it felt to 100, another 33% discount, then from 100 to 75, 25% discount... and here I am sitting at -73% loss...", "score": 2, "replies": [{"body": "Just to gamble on Cathie's buys.. I hope she continues to buy TDOC so that I can reduce my loss and get out.", "score": 1, "replies": [{"body": "haha\n\nI still have 300 shares left of that POS, worth around 9k. Funny to think it would have been worth 90K in Feb 2021. Maybe I should just leave around 5K of it for the sake of history as well...", "score": 1, "replies": []}]}]}]}, {"body": "I think holding MSFT, and AApL makes sense. The remainder, who knows.", "score": 2, "replies": []}, {"body": "keep americans. dump chinese.", "score": 2, "replies": []}, {"body": "Remember just selling stocks because they're down is basically buy high sell low philosophy. It will not work in the long run.\n\nYou have to ask yourself why did I buy those stocks to begin with and are those reasons still there?\n\nIf those reasons are still there and you can't mentally take the downturn then it means your risk tolerance is lower than you think it is.  You're too much into stocks and not enough Into Cash.", "score": 2, "replies": [{"body": "\\> You have to ask yourself why did I buy those stocks to begin with and are those reasons still there?\n\nMostly it was impulse, reddit schilling, no real research. I was impulsive with my hard earned money. Lesson learned.\n\n\\> If those reasons are still there and you can't mentally take the downturn then it means your risk tolerance is lower than you think it is.\n\nI wish my risk tolerance was lower, otherwise, I would have gone out when I was only 10% down. I had like 3 chances just this year to do that. What did I do instead? I used margin to buy more\n\nSo stocks are not for me. Maybe I can have max 20% of my portfolio in them, but not much more...", "score": 2, "replies": [{"body": "I hear you man, this downtown has definitely got me thinking I was way off in this stock thing. Got caught like you in many stupid stocks in the same exact way, smaller scale but if we're talking percentages here, isn't all the same??\n\nDefinitely need to get and do more of the simplified etf route moving forward. Just have to get my total position into the green first :(((", "score": 2, "replies": []}]}]}, {"body": "Daily dca is a great strategy if your broker allows. Several do. Voo, VTI, qqqm, etc", "score": 2, "replies": [{"body": "Yes. and the fees are like 0.5 dollars per transaction.", "score": 1, "replies": [{"body": "Which broker?", "score": 1, "replies": [{"body": "Degiro", "score": 1, "replies": [{"body": "Sofi is free", "score": 1, "replies": []}]}]}]}]}, {"body": "This is the right thing to do. When I realized that all my buying and selling of many of the same tickers you had couldn’t even beat the S&P over 2020-2021, I sold nearly everything and bought VOO. So much less stress.", "score": 2, "replies": [{"body": "Glad you discovered that earlier!\n\nHopefully, 5 or so years down the road all this will be forgotten", "score": 1, "replies": []}]}, {"body": "Personally, I did the same thing earlier this year, but am going with VTI and QQQ as I’m a strong bull for tech.", "score": 1, "replies": []}]}
{"title": "A question about inflation..", "selftext": "How does rising prices and interest rates fight inflation? The argument I hear is that if prices or rates are higher, money is removed from circulation. \n\nHow is that money removed from circulation? Isn't the cash just being transferred to the corporations selling products or the Banks who are lending?\n\nIs deflation occuring or is money consolidating to the .01%?", "id": "unfg7a", "created_utc": 1652290858.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 18, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": ">How does rising prices and interest rates fight inflation? \n\nRising prices don't fight inflation.  Rising prices *are* inflation.\n\nAre you more likely to take out a loan at 2% or 5%?  Are you more likely to go buy a house, car, boat, business, etc. at 2% or 5%?    \n\n\nHigher rates put the brakes on the economy.  That lowers prices through demand destruction.\n\nThere's no great conspiracy here.", "score": 9, "replies": []}, {"body": "The Fed funds rate ultimately determines the cost of borrowing in the economy.\n\nIn an economy where interest rates are very low you might decide instead of buying a $10,000 car with savings it makes more sense to borrow the $10,000 at 1% for 5 years. The total repayment amount on this loan over its 5 year lifetime would be $10,256. This means at a 1% interest rate you'll be able to borrow $10,000 over 5 years for just $256.\n\nBut think about it, where does that $10,000 you borrowed actually come from? Well the answer is no where - it's created out of thin. By taking out that loan you're in effect injecting $10,000 of new money into the economy. And why did you do it? Because borrowing rates were permissibly low.\n\nNow let's say in 5 years time you're looking to buy a new car... Like last time you decide you want to borrow the $10,000 and repay it over 5 years. However since your last purchase the fed has raised interest rates and you must now pay a 5% interest rate. Over the life time of the loan this would mean your repayments would now come to a total of $11,323. So you're now paying $1,323 to borrow that $10,000 over 5 years as opposed to just $256 to take out the same loan 5 years ago.\n\nAt this point you might decide that's too expensive you want to borrow less, or perhaps not borrow anything at all... You may even decide not to upgrade your car because another effect of the higher rates is that you're now able to get 3% on your savings so you figure it might be better to leave that compounding in the bank rather than spending it on a car you don't really need.\n\nBy raising interest rates the Fed has made it less attractive for you to borrow money and has effectively prevented new money entering the economy by reducing the amount of borrowing. In addition to this they're also encouraging saving over spending (and investing) because now you're getting a risk-free return on your money which you didn't have when interest rates were low.\n\nIt's also worth mentioning that in some cases loan repayments are not fixed. You might take out a loan at 2%, but because interest rates increases your 2% loan becomes a 3% loan, then a 4% loan, and so on. In this case borrowers might decide to pay down their loans to reduce repayments and in doing that money that was created when the loan was created now leaves the economy.\n\nI'm sure other people will be able to explain it far better than me, but hopefully that gives you a rough idea of how to think about the impact of raising rates from the perspective of the average consumer.", "score": 4, "replies": []}, {"body": "It’s really simple if you think about it this way. If interest rates are higher, you are more likely to save your money instead of spending. That removes money in circulation.", "score": 3, "replies": [{"body": "But if money is in savings accounts, the actual money supply has not reduced.", "score": 1, "replies": [{"body": "Depends on what money supply measurement you are looking.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "That’s not how it works. You are confusing it with having more income. Sure having more income means you are more inclined to spend, but if we are assuming income stays the same, more saving just leads to less spending, so companies will be forced to sell their stuff for less.", "score": 3, "replies": []}]}]}, {"body": "It's all about a supply - demand.\nHigher interests rates make future money more expensive, therefore people don't spend as much. As other posts said, they diminish demand of goods/services.\nCentral Banks retrieve money in circulation by Quantitative Tightening, they sell existing bonds or stop purchasing new ones. Here they diminish supply of money.\nBoth lower inflation.", "score": 2, "replies": []}, {"body": "Read the information on the Feds web page.\n\nThe purpose of increasing interest rates is to force consumers to budget better.\n\nThis is complete bullshit of course but that's their story and they're sticking to it.\n\nIn theory, yes raising interest rates is supposed to remove money from circulation.  However, that thinking is over 50 years old and governments and nations no longer follow old monetary theories.\n\nIn the current environment raising interest rates is actually far more inflationary than deflationary as nations have taken on far more debt and that debt is held by private institutions.\n\nThe reality is that the science of economics has been replaced by uneducated opinion and ignorant politics.  Moreover, monetary policy has been completely removed from government control.", "score": 1, "replies": [{"body": ">In the current environment raising interest rates is actually far more inflationary than deflationary\n\nAbsolute nonsense.  I hear some crackpot stuff on this sub, but this takes the cake.", "score": 3, "replies": []}]}, {"body": "Holy smokes man the way this question is worded is actually causing me concern for your financial well-being. In all sincerity I think you gotta spend less time making memes for meme stocks and invest a little time in reading an economics textbook or other beginner finance books.", "score": -3, "replies": [{"body": "I'm just asking a question.", "score": 6, "replies": [{"body": "Which is good and I’m all for people seeking knowledge but you literally asked “how does rising prices fight inflation?”", "score": 0, "replies": []}]}]}, {"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "shaggy oil squealing frighten bright strong subtract versed correct snails\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": []}, {"body": "How is money removed from circulation? By the Fed. When the Fed sells one of the Treasury bonds they are holding on their balance sheet, they (a) give the bond to the buyer and (b) receive cash from the buyer. That cash is now held by the Fed, ie it is out of circulation.", "score": 1, "replies": []}, {"body": "Powell said the President also has the power to help with inflation. Too bad Trump's supply side economics policies are gone.", "score": 1, "replies": []}]}
{"title": "One of my favorite indicators....", "selftext": "One of my favorite indicators is the % of nasdaq companies trading above their 200 day moving average. Historically this starts to bottom out around 10% aside form 2008/2008 when it was <1%. Since 2009 the lowest readings were during \"taper tantrum\" in 2019 at 7%  and the \"covid Crash\" in 2020 at 10%. As of yesterday's close we are at 15%. You'll have to copy paste the link [https://stockcharts.com/c-sc/sc?s=%24NDXA200R&p=W&st=2008-05-11&i=t3004279311c&r=1652294601255](https://stockcharts.com/c-sc/sc?s=%24NDXA200R&p=W&st=2008-05-11&i=t3004279311c&r=1652294601255)", "id": "unh218", "created_utc": 1652295247.0, "score": 36, "upvote_ratio": 0.92, "num_comments": 28, "comments": [{"body": "Username checks out.", "score": 20, "replies": []}, {"body": "So how do I get rich?\n\nScratch that. How do I keep from getting more poor?", "score": 11, "replies": [{"body": "How I can stop to be more poor..", "score": 12, "replies": []}, {"body": "I'd say to put everything into bonds/CDs, but I think with inflation, you're still becoming more poor that way too.\n\nNew plan: marry someone rich", "score": 7, "replies": []}, {"body": "Puts on Spy and Qqq. Long commodities futures. Bullish on the US dollar. \n\nAt least for the time being.", "score": 1, "replies": []}]}, {"body": "In other words, things don't get that bad except in cases where they get that bad.", "score": 10, "replies": [{"body": "Ya but it’s helpful for me too see how widespread the pain is. Is it just my portfolio/list that getting hit or is it everything.", "score": 5, "replies": [{"body": "Sure, but I'm not sure I'd call that an indicator.", "score": 2, "replies": [{"body": "When it gets below 10 there is usually a rally somewhere. Not always but it’s a great oversold and over bought indicator nonetheless. Cheers", "score": 5, "replies": [{"body": "But that's what I'm saying.....big crashes are outlier events.  So it works until it doesn't is sort of prescient in this case.", "score": 0, "replies": [{"body": "They are outlier events in bull markets for sure but I suspect there will be more sub 10 weeks in our future. Probably starting this week if things keep going.", "score": 3, "replies": []}, {"body": "Except you will ALWAYS rather buy below the 200ma than over it because that will always get you more money. \n\nOr, in this case, buy as close to the low as possible.", "score": 1, "replies": [{"body": "What is the empirical evidence for your first line?", "score": 1, "replies": [{"body": "Logic. If you need numbers to back up simple logic, open up a chart and do some simple math.\n\nHaving a cost basis below the 200ma means you’re in profit in the long run a whole lot more than having your cost basis above it.\n\nThe exact same premise as day traders trying to enter below VWAP. \n\nIf they bought above, that would mean they didn’t get best possible price.", "score": 1, "replies": [{"body": "But pure logic isn't enough with regards to empirical questions.  In this case, it needs to be true that future prices are more likely to be above the current 200 DMA than below.  What's the evidence for that?  \n\n\n90% of day traders lose money, so that's not a strong argument.", "score": 1, "replies": [{"body": "Yes but market makers run the markets and it’s a fact the VWAP is a common metric of success. \n\nAs far as everything else, you just want to argue. Sounds like by your logic prices will never be above 200ma again. \n\nYou know the only way that’s possible? Going to 0 and delisting, or going flat to the penny forever. \n\nSo while you try to sound smart by saying indexes are either going to 0 or staying flat forever at the 200ma, I’ll just be the dumb one averaging down into sector indexes and VTI and working my average cost below the 200ma every chance I can. \n\nYou’re welcome to wait until the market is already above it to start buying. Many do.", "score": 1, "replies": [{"body": "1. \"The market makers run the markets\" has nothing to do with anything we are discussing.  It couldn't be more irrelevant.  The market makers don't decide if the market is going up or down.  They only match buyers and sellers.\n2. I never said or implied that things won't go up.  I simply asked you for evidence that the 200 day moving average has predictive power.  You've yet to provide it.", "score": 1, "replies": [{"body": "90% if day traders lose money…\n\nNot all day traders are retail. Market makers are essentially institutional day traders. They use VWAP. It’s relevant to my point about buying at the lowest possible value. \n\nThe 200 day moving average doesn’t need to have predicative power to know that you’re more wealthy if your average cost is below it rather than above it. \n\nIt doesn’t require a strong mind to know that having an average cost of $20 on a $200 stock is better than having an average cost of $100 on a $200 stock. \n\nIf you cannot wrap your head around that, then please, by all means, keep asking Reddit for empirical evidence while I continue to pour cash into the market.", "score": 1, "replies": [{"body": "You are conflating two things here.  Of course it's better to buy stocks for less than to buy them for more.  But the question is whether there is evidence that shows buying them when they are below the 200 DMA (which is rearward-facing) is better than buying them when they are above the 200 DMA. This isn't an obvious point, and I'm not being pedantic.  It's very possible that stocks that are below the 200 DMA are below it for a reason and are trending downard.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Good indicator for both bulls and bears, T2108 or percent of stocks below 40 day moving average works great as well", "score": 8, "replies": [{"body": "Agree. They provide such a great overview.", "score": 2, "replies": []}]}, {"body": "The Covid drop was so brief", "score": 6, "replies": [{"body": "Ya but it was thorough and spiked almost everything. I was watching this indicator and figured we’d have another 2008 but instead we have the worlds shortest bear market. Lol", "score": 3, "replies": []}]}, {"body": "Man I hope you're right", "score": 3, "replies": []}, {"body": "nice indicator", "score": 2, "replies": []}, {"body": "Thank you for sharing! Im always interested in learning different indicators", "score": 2, "replies": []}, {"body": "looks like we got that rally. at least for now.... BTW yesterday's sell off only increase the number of nas stocks under the 200 ma by 1% which is interesting.", "score": 1, "replies": []}, {"body": "Don’t do this. Don’t give me hope…", "score": 1, "replies": []}]}
{"title": "More Short-term pain ahead for stocks, here's why:", "selftext": " More Short-term pain ahead for stocks, here's why:\n\n&#x200B;\n\n* The “inflation shock\" is worsening, the \"rates shock\" is just beginning, and the \"recession shock\" is coming. We are experiencing the start of a global recession. Rising inflation, interest rates, supply shortages, war & a pandemic are all combining to create a perfect storm.\n* Markets are also down because many hedge funds & money managers are being forced to sell in order to meet margin requirements\n* Investor sentiment has been affect by (1) Inflation fears, (2) worries about big interest rate hikes from the Federal Reserve and (3) fears about a possible economic slowdown  (4) Russia’s war in Ukraine is ongoing, which could fuel inflation, supply chain issues, oil price fluctuations and contribute to an overall sense of unrest, (5) Slowed growth in China and concerns about the impact of Covid outbreaks there are contributing to anxieties\n* Exponential Moving Average is bearish for the 5, 13, 20 and 50 day. MACD is bearish. RSI is bearish. Three Day Displaced Moving Average is bearish. 38.2% Fibonacci is bearish. Stochastic is bearish.\n* Charts have a bunch of bearish indicators: Stochastic Sell Signal, Shooting Star Candlestick, MACD Bearish Signal Line Cross, Death Cross", "id": "unly13", "created_utc": 1652308546.0, "score": 6, "upvote_ratio": 0.67, "num_comments": 24, "comments": [{"body": "I’ve settled into a blissful numbness at this point. Just time to wait, be patient and buy when possible", "score": 19, "replies": [{"body": "Nice, what’s your DOC?", "score": 5, "replies": [{"body": "Doc?", "score": 1, "replies": [{"body": "Drug of choice (for the numbness) ![gif](emote|free_emotes_pack|trollface)", "score": 2, "replies": [{"body": "Ahh never heard that before. Weed and booze naturally", "score": 7, "replies": []}]}]}]}, {"body": "I was just listening to \"comfortably numb\" this morning.", "score": 2, "replies": []}]}, {"body": "so if it's so obvious, it should be guaranteed money to short the market", "score": 7, "replies": [{"body": "It's guaranteed except for if FED pulls some statement like only 25 basis point raise.", "score": 4, "replies": []}]}, {"body": "So sell my house and buy BABA?", "score": 7, "replies": [{"body": "U mean u haven’t already ?", "score": 4, "replies": [{"body": "My refrigerator box is dry I am happy and waiting", "score": 2, "replies": []}]}]}, {"body": "This isnt just short term pain from temporary shocks. This is a full blown regime change and end of the Fed put. Once the dust settles I expect a new normal that is more focused on fundamentals and value than we've seen since before dot com bubble burst. We all need to recalibrate our expectations around alpha and timelines", "score": 7, "replies": [{"body": "I hope for that time but we have a max 2% gdp per year and that involves borrowing 20% of government debt which is like 30T on a 23T economy. They will keep trying to inflate the bubble, I hope to god we can deflate, pay down our debt like Japan.", "score": 5, "replies": []}]}, {"body": "Wait, stop everything!!!   Did you say MACD is bearish?   ShIt JuSt GoT rEaL", "score": 3, "replies": []}, {"body": "This awful mess is not over yet.  Cracks will be appearing in the nice orderly structure of the market.  They may already be there but they aren’t yet public.  I expect a massive selloff and margin calls this Friday which is May 13, then more selling into next week which is stock options expiration.  If we get a bottom they are frequently Wednesday or Thursday of options expiration week.  If we just keep going down in an orderly fashion everyone will start to crack up.  There is some selective institutional buying but there is also forced buying because of shorts.  There have been few massive downgrades, the first one I have seen was today Wells Fargo downgraded Ford and GM.  \n\nExpect more institutional downgrades to hit in the next couple of weeks.  When the emotions of the market cracks, expect the consumer to suddenly follow suit, like cancelled vacations, car orders, escrows, etc.  That will cause more analyst downgrades.  I am afraid this market is playing out worse than I had hoped myself.  There are still too many bullish analysts on CNBC saying S&P500 to 5000 by the end of the year.  I just hope it will get back there in 2-4 years.  \n\nThis is still a correction acting bearish because of the tech rout.  There are still stocks and ETFs doing very well.  They are the last dominoes.  When they go and there are some bust-ups it is time to buy.  The market though could make an upturn next week without all the bearish drama.  If the VIX drops to about 25 it is safe to buy for a summer rally.  There are actually far less rumors and market manipulation in this correction than I have seen in the past.  It was really brutal in 2000.", "score": 4, "replies": []}, {"body": "Funny thing is market is falling and VIX is falling… like either people are well hedged or maybe it’s all very expected", "score": 5, "replies": [{"body": "Vix is down like 1% today dude. It has not fallen.", "score": 6, "replies": [{"body": "Not off a cliff but it fell as the market hit new lows so you know, orderly sell-off today", "score": 3, "replies": []}]}]}, {"body": "Everything has to be priced in by now…", "score": 2, "replies": []}, {"body": "Inflation won't get better with Biden's economic policy so I assume this bear market is very long.", "score": -4, "replies": [{"body": "Take the political nonsense outside.", "score": 11, "replies": [{"body": "Political nonsense? Biden has been absolutely terrible on every meaningful front, including fiscally. I don't think that's debatable.\n\nUnless what you're saying is that politics in any form doesn't belong here.", "score": -2, "replies": [{"body": "Can you not read? Take the political nonsense outside.\n\nHopefully you understand that this started with Trump juicing the economy while he has president, leaving us with extremely few options in the event of an emergency. I won't defend Biden but we had two choices: underreact and the economy doesn't recover. Overreact and we get some inflation and maybe we can avoid a recession. \n\nWe learned our lesson from 2008. I'd take a short term \"recession\" over the underperforming stimulus from that era any day.", "score": 2, "replies": [{"body": ">Can you not read? Take the political nonsense outside.\n\nAre you the boss around here or what? Damn dude, I was just trying to understand your post. You call someone's opinion 'political nonsense' despite being more or less accurate. Biden hasn't been very good on the economic front, and it isn't simply macro factors. Policy decisions are part of the problem here.\n\nNow, to get to your REAL issue: yes, I understand that Trump caused problems as well. It isn't an obligatory \"this dude loves Trump\" just because I have critique of Biden. Yet I've learned over the last year or two that while criticizing Trump for four years was not only on the table but actively encouraged and cheered on (and I did criticize him plenty), the same cannot be done to Biden. Wherever that insecurity comes from, you aren't the only one holding it.\n\nFor the record. Not a fan of Biden. Not a fan of Trump.\n\nAnyway, the big boss man told me to 'take the political nonsense outside'. I better keep my lips sealed from here on out. In the meantime maybe you should calm down and learn how to communicate with people instead of demanding things and reducing yourself to insults. Sorry if I misunderstood anything, you know I have trouble reading.", "score": 0, "replies": []}]}]}]}]}]}
{"title": "Rivian lost $1.59 billion and delivered 1,227 electric trucks in the first quarter of 2022", "selftext": "Rivian, the buzzy electric vehicle company backed by Ford and Amazon, reported a net loss of $1.59 billion in the first quarter of 2021 based on $95 million in revenue. The company said it delivered 1,227 vehicles to customers during the past three months, bringing its total number of deliveries to 2,148.\n\nRivian said it now has over 90,000 reservations for its R1T and R1S electric vehicles, up from 83,000 as of its last update in March.\n\nThe company released its first-quarter earnings after a particularly bad week, with its stock dropping to all-time lows on the news that one of its prominent investors, Ford, was selling about 8 percent of its shares in Rivian. The company’s stock price was down over 78 percent since the start of the year.\n\nhttps://www.theverge.com/2022/5/11/23067212/rivian-earnings-q1-2022-electric-truck-deliveries-stock", "id": "unm5qj", "created_utc": 1652309167.0, "score": 45, "upvote_ratio": 0.91, "num_comments": 23, "comments": [{"body": "Thanks to whoever suggested I get a put on them yesterday", "score": 19, "replies": [{"body": "They didn’t press the buy button, that’s all you, bucko", "score": 12, "replies": []}, {"body": "Lol", "score": 1, "replies": [{"body": "This did not age well lol but I’ll still hold", "score": 2, "replies": [{"body": "Good luck, there’s no winning with these stocks sometimes", "score": 3, "replies": []}, {"body": "WTF? Apple smashed its last quarter and is in the shitter because of supply issues. Rivian looks absolutely terrible but their stock is up because they said \"they'll do something about their supply issue.\" Okay....ha", "score": 1, "replies": []}]}]}]}, {"body": "Dead cat bounce", "score": 7, "replies": []}, {"body": "Most of this was expected and none if it is considered \"good\" news, so i'm curious why the stock is up AH? Did people expect a bigger net loss?", "score": 12, "replies": [{"body": "You said it yourself most was expected… stock is down 45% in five trading days", "score": 14, "replies": []}, {"body": "$17B cash meaning holding all things the same at this loss rate without they'll survive another 2.5 years so maybe the market thinks that's plenty of time for them to ramp up and reach scale.", "score": 5, "replies": []}, {"body": "Because it was priced-in and now is being digested. Or some other mambo-jumbo shit.", "score": 3, "replies": []}, {"body": "Yes. Plus they’re getting better at getting cars out (any progress is notable at this point)", "score": 1, "replies": []}, {"body": "Nah, probably some shorts covering AH. Will continue to go down.", "score": 1, "replies": []}]}, {"body": "The true test for these starter EV companies will be how much $ they can continue pumping into the business until they reach scale and mass produce. That's the biggest challenge Tesla went through. If Tesla took many years to achieve that despite the competitive advantages they gained the entire decade, it will be many years before a startup EV company can ever be profitable. Since Amazon+Ford own about 30% of Rivian, until those two giants decide to bail on Rivian, I would hold this out. $17 billion cash-on-hand is worthy of note here. They can easily last a few years and eat those losses if they believe it is enough to reach scaling. Considering they raised over $12 billion when they IPO'd and sold shares at around $80, that actually may save Rivian here. Current market cap $18 billion. Yes, they will lose billions for the next few years but it's not like they are burning cash they don't have. Again, until Amazon/Ford jumps ship, Rivian still has legs to stand on.", "score": 3, "replies": []}, {"body": "Tesla will go on to be a successful and major EV car maker. The rest is just too small too late and will likely end up taken over by legacy car makers who already solved the scaling problem and don't need to figure out how to go from 1,000 cars to 1,000,000.", "score": 10, "replies": []}, {"body": "Buy the dip", "score": 6, "replies": []}, {"body": "Wait profitability matters again all of a sudden?\n\nOh this isn't good.", "score": 4, "replies": []}, {"body": "Ill never make my money back on this one lol.\nMaybe something crazy will happen in the future??", "score": 1, "replies": [{"body": "Maybe the company ramps up production as time goes on and projections become more rosy. I'm starting to grow bullish at these prices", "score": 1, "replies": []}]}, {"body": "Now that’s a headline", "score": 1, "replies": []}, {"body": "So they doubled the number of car sold /s", "score": 1, "replies": []}, {"body": "I love new disruptive companies. I think Rivian has a tremendous truck product. \n\nI do not think any company losing over a billion a quarter is worth touching.", "score": 1, "replies": []}]}
{"title": "Metaverse stocks", "selftext": "What is your metaverse play? They are on sale. I am torn between Meta(Facebook), Roblox, and Apple. Anyone have an opinion?\n\nI think Roblox has potential but also have a big suspicion Apple and Facebook have something up their sleeve that could blow us all away. I don’t think Robolox has the technology and man power to compete with a company like Meta or Apple but I could be wrong. Opinions?", "id": "unmmo2", "created_utc": 1652310522.0, "score": 10, "upvote_ratio": 0.76, "num_comments": 19, "comments": [{"body": "Unity, FB, Apple, and surprisingly Google. But don't take my word for it, read Zuckerberg's original take from a 2015 email on the pros and cons of acquiring Unity, and the need to rush to new XR technology. https://www.scribd.com/document/399594551/2015-06-22-MARK-S-VISION\n\nApple and Google own the latest and current wave of personal compute (mobile) by being the gatekeepers. They own the hardware platforms (Android and iOS) and can kneecap anyone they please at the snap of their fingers. Zuck foresaw this as early 7 years ago in the email above, and last year, this vision came true as Apple cut off FB's ability to monetize iOS users significantly. \n\nHe outlines that the current winners, Apple and Google, will drag their feet to the next generation of computing because they are still reaping the rewards from this one. He then explains why achieving a metaverse platform isn't a side play for Facebook, it's the entire future of the company. And because of this, they themselves must accelerate progress to the next wave of compute and solidify themselves as a platform. Whether on not you believe Meta can do this, I think it's pretty clear that this is their ultimate long term strategy.\n\nGoogle and Apple will swoop in from the wings with their devices and offer comfortable synergies to pull in existing ecosystem customers. They know what value comes from being the gatekeepers, and if Meta can truly accelerate this, they will not go down without a fight imo.\n\nThe case for Unity is clear in Zuck's email so I'll leave it at that.", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "You bring up fair points about Unity as having more risk. They are under fire for lowering guidance, and have promptly reiterated that they will achieve profitability by q4 this year to reassure investors. It remains to be seen if they can stick true to this promise.\n\nThis extra risk is definitely felt in the last weeks with Unity cratering -40% from their initial IPO price, and much further from speculative ATHs. Meta did not end up acquiring Unity in 2015, but that does not reflect a loss of importance to the strategy. The investment in XR technology by Facebook was incredibly fresh, they only had acquired Oculus 1 year prior from that email in March 2014. It remained to be seen if this direction would hold fruits, and it's possible that FB did not have confidence to splurge on a company without first seeing some traction from Oculus. Now some time has certainly passed, slow progress ensued on the XR front for years, and finally a breakthrough. Quest 2 has sold over 10m, Facebook has changed their name, and Zuck stated they will spend 100B+ within 10 years on advancing XR. (I don't doubt this pivot was forced early by Apple accelerating their data lockout). \n\nUnity reflects an odd piece in the puzzle for any prospective metaverse companies. They account for a staggeringly large portion of 3d content creation today, at ~60% of VR apps and ~50% of mobile apps. It's possible to recreate the engines and tools needed to create and monetize 3d content, especially by giant companies. However, this will increase the time horizon for creation of new 3d content. New developers will need to learn and be funded to pivot to another engine tool. Regardless of an acquisition, Unity holds asymmetric value to the metaverse. If Unity slowed progress of its tools and engine or collapsed, it would certainly reduce 3D content creation rates, and thus potentially negatively impact adoption rates for new XR devices. This is not something that can coexist with a high-growth adoption curve of XR devices in the later half of this decade that companies like Meta are betting big on.\n\nThey are still losing money, and made aggressive investments (Acquisitions within last 1 year: SyncSketch, Weta, Zika, Parsec, and more) that will take a while to return value on. That is a scary thing if the market is reducing forward looking cash. However, in terms of your original question, the metaverse is part of a future computing platform. This is not here today, and likely will not be in any large scale adoption for multiple years at minimum. If Unity cannot limp to the finish line, someone will drag their body over it. I can't see them failing IF the metaverse takes off.", "score": 1, "replies": []}]}]}, {"body": "NVDA. They're my favorite for a lot of reasons, metaverse just being one.", "score": 11, "replies": [{"body": "If metaverse depends on mobile chips, NVDA won’t profit.", "score": 5, "replies": [{"body": "Metaverse requires a bunch of AI computing and datacenters to support it, which use a lot of nvdia tech. They also develop the omniverse software, which is a 3d design collobaration tool", "score": 8, "replies": [{"body": "In that case, a company like Amazon would be closer.\n\nI doubt NVDA's software holds a candle from those from Unreal / Unity / Autodesk.\n\nNVDA definitely has a lot of strengths, but I really don't think it's a metaverse play unless desktop class graphics hardware becomes important for XR.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I thought you just meant stocks that will profit from metaverse, otherwise you're right. To answer your question more correctly, i like FB and U", "score": 1, "replies": []}]}, {"body": "And AMD", "score": 1, "replies": []}]}, {"body": "Microsoft. \n\nThey have the cloud. They have the software. They have gaming (console+Activision). And, they own the workplace. Remember how Zuckerberg touted meetings and collaborations in the Metaverse, well, he may be sitting on 2 billion combined users chatting and sharing pictures on his platforms, but no one talks about the billions using MSFT products every day for work and fun.", "score": 7, "replies": [{"body": "Love that stock.  It’s like a value/growth hybrid.", "score": 2, "replies": []}]}, {"body": "I'd just stick with Apple and Facebook.", "score": 5, "replies": []}, {"body": "FB, RBLX, U", "score": 6, "replies": []}, {"body": "AMZN", "score": 2, "replies": []}, {"body": "U", "score": 2, "replies": []}, {"body": "Google", "score": 2, "replies": []}, {"body": "Roblox.  It's pretty much a metaverse already.", "score": 2, "replies": []}, {"body": "not FB", "score": 1, "replies": []}]}
{"title": "Tesla wants Panasonic to ramp the development of its 4680 cells: CFO", "selftext": "", "id": "unbbbx", "created_utc": 1652279845.0, "score": 86, "upvote_ratio": 0.96, "num_comments": 21, "comments": [{"body": "We still don’t know, can/will Panasonic be able to do the dry electrode part? How much will be a literal copy of the Tesla line? Is there a license fee? Etc.", "score": 11, "replies": [{"body": "Don’t think it has to be made exactly the same. Just needs to meet the standards of cooling and power.", "score": 7, "replies": []}, {"body": "The dry electrode part is only for Tesla manufacturing. The cells can be made with either process.", "score": 5, "replies": [{"body": "Thx to maxwell", "score": 3, "replies": []}, {"body": "Tesla could license it to Panasonic.", "score": 1, "replies": [{"body": "They could, but don't really need to. It is better that they have their own process that saves them money and gives them better bargaining power in negotiating price.", "score": 0, "replies": []}]}, {"body": "I'm not sure if that's true, based on Maxwell's statements prior to the acquisition, there did seem to be significant energy density gains from DBE.", "score": 1, "replies": [{"body": "That has not been realised yet. There seems to be no real density increase.", "score": 1, "replies": []}]}]}]}, {"body": "Hasn't this always been the plan.  They invented the new type of cell, stood up a pilot line to prove its scalable and planned on Panasonic or others to mass produce them for EVs in addition to their factory in Austin.", "score": 20, "replies": [{"body": "Tesla wants them to cut corners so they can get it quickly.", "score": -14, "replies": [{"body": "Ha, no. Tesla has always cared about the quality of their batteries.", "score": 7, "replies": []}, {"body": "What corners are you talking about?  Putting batteries that aren’t quality would destroy their business overnight.  Just don’t see that happening.", "score": 3, "replies": [{"body": "Tesla’s number priority is safety. They would never do this. And the line sounds cliché but it’s true.", "score": 1, "replies": []}]}]}, {"body": "Right but the costs of the battery have gone up is another factor to consider. These battery companies aren’t eager to make more batteries on a loss because they can’t pass on the costs to Tesla. Same comment I made on another post in this group today & some guy was lost in what I was talking about & thought he “countered” me lmao 🤦🏻", "score": 1, "replies": [{"body": "Haha I saw the other comment", "score": 2, "replies": [{"body": "ppl on here sometimes lol", "score": 1, "replies": [{"body": "I’ll consider myself “countered” LOL", "score": 2, "replies": [{"body": "🤣💀💀", "score": 1, "replies": []}]}]}]}]}]}, {"body": "its just as easy to wrap a big battery as it is to wrap a smaller one... its not about production... its about cost and material availability. sounds like elon is betting on people paying whatever they can to get a tesla cause the market is showing that... with people buying used tesla's with 30k plus on them for more than brand new ones... if tesla dont secure enough batteries  to make a good profit on the cyber truck... the stock surge that we were all looking for cause of cybertruck sells might be a bit less cause of the profit margins and people backing out of their preorders cause of higher prices... and him having to refund 10s of thousands of people $100.... and thats likely going to come out of the tesla stocks itself.... further cause a dip... this is going to be a strange market.... i can only hope that he gets the materials and final product at a reasonable price... right now thats just not the case.... there is no magic thats going to happen here... there is a huge demand and the supply is low for these batteries.", "score": -3, "replies": [{"body": "“Lithium has been abundant” until recently he added oh yeah but mining/ refining is the problem.", "score": 1, "replies": []}, {"body": "They are different processes due to the tables design.", "score": 1, "replies": []}]}]}
{"title": "Tesla might buy a mining company, but not another automaker - Electrek", "selftext": "", "id": "unj8lo", "created_utc": 1652301150.0, "score": 29, "upvote_ratio": 0.83, "num_comments": 20, "comments": [{"body": "Buying an automaker doesn't benefit you as it increases your material supply problem. Buying a mining company helps you solve your own material supply problem. It's such a stupid question to ask.", "score": 11, "replies": []}, {"body": "Why would they waste money on another automaker that doesn't own any tech? \n\nWell.... actually I'd love to see them buy apteria. Would fit into their line well,", "score": 12, "replies": [{"body": "Aptera and/or Arrival.\n\nArrival's low volume manufacturing approach would allow a whole range of specific models to suit niche markets..", "score": 3, "replies": [{"body": "Yeah especially because they don't have a van yet. Issue is tweeking to match Tesla's style. Apetera allready fits. Or atleast older ones did. All you would need to do is maybe adjust some headlights and use mode 3 seats and wheel ECT and it would blends in well. \n\nI am really hoping they make a cybertruck style van but use modular boddy parts for different heights, lengths, doors and windows ECT. Haha. Also make it work for van life. So 1kw of solar on the roof and enough flexibility in the floor to put a shower drain.", "score": 1, "replies": [{"body": "Cybervan would be awesome for europe. Vans vastly outnumber pickups here.", "score": 2, "replies": []}, {"body": "Which Tesla style? Model S/X and 3/Y are somewhat different, and Cybertruck is off on it's own.", "score": 1, "replies": [{"body": "Well. I'd prefer cyber truck style but that's a lot more than just tweeking \n\nI mean more standard model 3 styling like with the semi. Headlights, handles, panel shapes etc.", "score": 1, "replies": []}]}]}]}, {"body": "Been a long while since I looked at Aptera. My recollection is it is a bad and expensive design.\n\nJust look at the description of being built with ultra-lightweight composites that are stronger than steel and then contemplate if that sounds like something that can be mass produced economically. If yes, why does Tesla not do that for their current cars?\n\nIn any case if I am correct about the skin making this endeavor questionable then perhaps you would think a steel or aluminum skin would make more sense. But that is not simple, since the composites are stronger you would need more structural materials to achieve the needed strength which would drive up weight, which would require larger batteries, tires, etc until you find the proper balance. By the time you are done with this exercise you just have the Tesla Model 2 (or whatever they will call the small car one day) which Tesla is not ready to build yet as the economics don't add up yet.\n\nOr of course you can build a very lightweight car with expensive materials and investors will find out soon enough that the retail price is way too low and it is not a car that will appeal to the masses.\n\nBut maybe I am wrong... But I think not.", "score": 2, "replies": [{"body": "Yeah I kinda think they are pushing things. Like the design is amazing but I think that was enough. The development time and cost is out of hand at this point. That had the over all design more or less finalised like 15 years ago or something back when it used a motorbike or something as propulsion.\n\nBut assuming the development time and cost wasn't an issue. And that they built it in a more traditional way. It could be a practical cheap car (though 2 seater is ouch) just for the fact of how little batteries it needs. Especially now with how expensive lithium is. \n\nOne thing I haven't looked into is its footprint for a 2 seater. Sure it's not going to be a smart car in terms of road space savings but is it at least better than a model 3? \n\n(Also why did no one think it would be called the model U? U as in you as in personal. Also U R(oadster) S3XY)", "score": 2, "replies": []}]}, {"body": "Wish Elon can buy back Tesla share to not waste any money and his precious time on Twitter 💩", "score": 3, "replies": [{"body": "You can't have Elon's brain without his freewill.", "score": 2, "replies": [{"body": "His free will only manifest where he is powerful to change the game. In China Elon is complement everything and nothing bad.", "score": 1, "replies": []}]}]}, {"body": "If they want Aptera they could just design something similar, the hard part is manufacturing at scale, Aptera has nothing to bring to the table.", "score": 0, "replies": [{"body": "Um. I am pretty sure Aptera has some legal hold over the design.", "score": 1, "replies": [{"body": "I mean something similar", "score": 1, "replies": []}]}]}]}, {"body": "Buying another automaker would literally just be to remove them at future competition otherwise they are just inheriting all the problems they already solved themselves.", "score": 4, "replies": []}, {"body": "He didn’t shoot down 100% not buying another automaker, but definitely wasn’t all about it.  He also didn’t say they would definitely buy a mining company…\n\nBut Fred takes liberties for clicks.", "score": 3, "replies": []}, {"body": "Teslas only reasonable acquisition at this point is Panasonic or CATL (though I know the latter is highly improbable)", "score": 2, "replies": []}, {"body": "Or Boston dynamics?..", "score": 2, "replies": []}, {"body": "If only they knew how to dig holes in the ground with really powerful electric boring machines", "score": 1, "replies": []}]}
{"title": "Will my puts get assigned?", "selftext": "I just sold some Tesla puts at $700, I’m wondering if I will get assigned them. I want to get assigned them but I’m curious what are the odds.", "id": "ungjuc", "created_utc": 1652293851.0, "score": 0, "upvote_ratio": 0.07, "num_comments": 22, "comments": [{"body": "You provided no expiration, so who the fuck knows", "score": 22, "replies": [{"body": "Just answer the question!!!", "score": 5, "replies": []}, {"body": "Sorry, June something. I’m on my phone now.", "score": -9, "replies": [{"body": "With customer support or a fortune reader ?", "score": 18, "replies": []}]}]}, {"body": "Yes, I just got a notification on my phone that OP will get a sign.", "score": 14, "replies": []}, {"body": "You know TSLA is above $700, so the odds are near zero.\n\nIf the stock drops below $700 then the odds start to go up, and if it is DITM as the exp date gets closer the odds go up even more.\n\nIf <$700 on expiration day the odds are near 100% . . .", "score": 7, "replies": []}, {"body": "yes", "score": 5, "replies": []}, {"body": "Reply hazy, try again.", "score": 3, "replies": []}, {"body": "Early assignment benefits you.\n\nYou could only hope that they DO get assigned", "score": 3, "replies": []}, {"body": "the odd is roughly the delta value", "score": 2, "replies": [{"body": "Delta is -.37", "score": -1, "replies": [{"body": "The delta will change as the market goes up,or down. So your odds currently 3.7% chance changes.", "score": -3, "replies": [{"body": "wouldn't 0.37 delta be 37%?", "score": 3, "replies": [{"body": "Just checking someone is awake!", "score": 7, "replies": []}]}]}]}]}, {"body": "You'll get assigned if they're in the money at expiration and you don't buy to close.", "score": 2, "replies": []}, {"body": "Are you not able to open the option chain on Tesla?", "score": 1, "replies": []}, {"body": "Look at your delta .", "score": 1, "replies": []}, {"body": "Who is your broker?", "score": 1, "replies": []}, {"body": "Sure or no", "score": 1, "replies": []}, {"body": "Yes and no", "score": 1, "replies": []}, {"body": "If it has more than .10 of extrinisyc value then probably not. Because someone would have to pay $10 to exercise it.  It has to be itm also", "score": 1, "replies": []}, {"body": "There's some interesting work on this question I saw in a MIT lecture video posted to YouTube: [https://www.youtube.com/watch?v=eG\\_aRPy1KVE](https://www.youtube.com/watch?v=eG_aRPy1KVE)\n\nTL;DR is that the option contract prices determine the asset price probability distribution at expiration and the construction is quite elegant from a probabilists point of view. But, the catch is that you need all contract prices for all strikes to determine the probability distribution. So, for your question, I'm afraid the answer is not practical.\n\nIt may be possible for you to use an option price model like Black Scholes, and 'fit' its parameters such that it matches the real-world contract prices. Then, use the model to find all contract prices for all strikes as a continuous curve and go that route. But, as the video presenter says in the lecture, the result of this is just a log-normal distribution which you could construct with the estimated Black Scholes parameters by themselves without the extra work.", "score": 1, "replies": []}]}
{"title": "Where's the bottom for TSLA?", "selftext": "\n\n[View Poll](https://www.reddit.com/poll/unfllc)", "id": "unfllc", "created_utc": 1652291261.0, "score": 7, "upvote_ratio": 0.9, "num_comments": 24, "comments": [{"body": "I'm seeing more bottoms than a San Francisco nightclub.", "score": 15, "replies": [{"body": "🏳️‍🌈🥵", "score": 4, "replies": []}]}, {"body": "$2", "score": 7, "replies": [{"body": "&#x200B;\n\n![gif](giphy|PmeKGXWQCPCWiVP6j3)", "score": 6, "replies": []}, {"body": "Adam Jonas, is that you?", "score": 4, "replies": []}]}, {"body": "300\n\nLike the 300 Spartans", "score": 5, "replies": [{"body": "can't argue with that", "score": 2, "replies": []}]}, {"body": "It depends on the bottom for the market.  And the bottom for the market is - no one knows.", "score": 5, "replies": []}, {"body": "$695", "score": 4, "replies": [{"body": "Why so imprecise: $694.20", "score": 6, "replies": []}]}, {"body": "$420.69", "score": 4, "replies": [{"body": "Noice", "score": 2, "replies": []}]}, {"body": "Entirely depends if marco is going -40% like 2000 and 2008, or -20%\n\nEdit: macro", "score": 5, "replies": [{"body": "All my homies hate Marco", "score": 15, "replies": [{"body": "Lol", "score": 2, "replies": []}]}, {"body": "Not really a fair comparison though, need to consider inflation.\n\nBefore Covid hit the Nasdaq was at $9,700. In the 2 years since then inflation has been 4.7 and 8.3 percent. So if you hold growth completely flat and simply adjust the market for inflation the Nasdaq would be at \\`$11,000 today! Just $350 below where we are right now. That means that the current pricing accounts for less than 4% actual growth/value creation over that 2 year time period which still leaves market growth at less than GDP growth over the same time frame.\n\nNow of course I'm aware this ignores the market bubble that may have already been forming in 2019/early 2020 due to low interest rates but I still think its tough to directly compare the percentage drops in the market because inflation is so historically high right now.", "score": 6, "replies": []}, {"body": "Spy 2000: -50%, 2008: -58%\n\nNasdaq 2000: -83%, 2008: -55%\n\nJust FYI", "score": 2, "replies": []}]}, {"body": "$679", "score": 2, "replies": []}, {"body": "690s", "score": 1, "replies": []}, {"body": "Yes.", "score": 1, "replies": []}, {"body": "I don't want to say anything because the Gods will see my number and smack it down way below my number for my hubris.", "score": 1, "replies": []}, {"body": "$420.69", "score": 1, "replies": []}]}
{"title": "Woes to TSLA politically.", "selftext": "Woes to TSLA. Musk is fighting against some big guys politically. It may go toward 500ish.", "id": "unkyvd", "created_utc": 1652305823.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 20, "comments": [{"body": "The stock may go toward $500ish, but it has nothing to do with the company, Musk, or any \"big guys politically\". \n\nThe market is in freefall and the old market wisdom is not to catch a falling knife.\n\n- There are not enough people buying stock PERIOD because they either already bought all they could at the start of the crash or are holding off until a bottom is found.\n- There are people with margin calls selling to cover because we're getting to that point in the crash that even the most conservative option trader is going to hit expiry before any kind of recovery.\n- Idiots are panic-selling because that's what they do.\n\nAll the TSLA bears are patting themselves on the back but none of this is indicative of the company, which is still doing great and we'll see it rocket to Mars in the recovery. It is absolutely insane to me that this is happening and it's been my wildest dream since it first ran up to $900. There has never been a deeper discount and if you aren't retired or otherwise reliant on your stock account for expenses, this is just an amazing opportunity.\n\nUnfortunately, I think this is an 18 month recession at least. It's possible TSLA breaks with the pack and recovers early as it becomes clear they continue to sell every car they make and dodge the worst of supply chain issues, but there is no way to know when the crazy stops and the sanity starts.", "score": 8, "replies": [{"body": "Based on the current market, I am with you.  But Musk bought TWTR where Dem has been trying to control the “speech”, and Gates has been shorting TSLA. Gates won’t lose money this way. Who does Gates side with politically? It is just the start.  They are taking advantage of this opportunity of downtrend market to teach Musk a lesson.  They use the recession as their excuse to cover their intention.", "score": -1, "replies": []}]}, {"body": "That makes me bullish. There are a lot of big political guys that should be fought", "score": 12, "replies": [{"body": "Good luck", "score": 0, "replies": []}, {"body": "How does Musk fighting them make TSLA earnings go up though?", "score": 1, "replies": [{"body": "It might not have a direct or immediate effect, but it makes Tesla a better company in terms of values. For instance, I’m much more likely to buy a car from Tesla than I am any other car manufacturer, one of the reasons being I like that the company isn’t bending over for politics and whatever control other industries and groups/parties of interest may have.\n\nI don’t think I’ve ever heard anyone talk about how he or she loves the dealership experience, and how it would be so much worse if the whole process of buying a vehicle was simplified. I think down the road this will give Tesla quite an advantage over competitors.", "score": 1, "replies": [{"body": "For every person like you who thinks Musk is fighting the good fight, there are 4 or 5 who disagree or wish he would stay out of politics. A CEO needs to keep out of politics. He's the face and voice of Tesla and he looks and sounds like an idiot these days.", "score": 2, "replies": [{"body": "In an ideal world, I would agree. But unfortunately politics is like a virus that spreads itself into every corner of the modern world. With that, I’m happy that Elon Musk is fighting it back. I want it to go away so that the automotive industry (and industry as a whole) can finally direct its focus towards innovation, maximizing efficiency, and minimizing affects on the environment - something I imagine we all wish for.", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}, {"body": "What I have learned through all this is that very few \"liberals\" or \"progressives\" give a shit about global warming or getting rid of fossil fuels. It was all just window dressing for being against success.", "score": 5, "replies": [{"body": "They’re just pro war", "score": 2, "replies": [{"body": "That's a factually inaccurate statement.", "score": 0, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Why would fighting big guys drop the price to 500? Naked shorts? Intense put action? Sentiment? Derailed from mission?", "score": 4, "replies": []}, {"body": "He knows what he's doing. Sit back and watch... imo. #long", "score": 3, "replies": []}, {"body": "Good, I'll load s'more at $500", "score": 4, "replies": [{"body": "Lot easier for me to add here then add at 1200. I need to dca though", "score": 1, "replies": []}]}, {"body": "I'm new to this sub, what do you think is a good entry point for TSLA stock?", "score": 1, "replies": []}]}
{"title": "\"Inflation decelerates slightly from 40-year high as CPI rises 8.3% in April\".....So this is the best spin they can put on this.", "selftext": "[Source article](https://finance.yahoo.com/news/inflation-consumer-price-index-cpi-usa-april-2022-123135066.html)\n\n> The Bureau of Labor Statistics' April Consumer Price Index (CPI) rose 8.3% in April over last year, coming down from March's 8.5% advance. That rise had marked the fastest rate since 1981. Consensus economists were expecting an 8.1% increase in April, according to Bloomberg.\n\n> “The pace of price increases moderated, but not as much as expected. Excluding a decline in energy prices – which appears outdated by this point – the increases remain widespread,\" Greg McBride, chief financial analyst at Bankrate, said in an email Wednesday morning.\n\nInflation is still increasing but the best spin they can put on it is that it is slowing a little bit.  Sounds like things are still bad.  But hey, at least the rise has slowed a bit....you're being priced out of things a little bit slower than before.  Good times!", "id": "unbvsq", "created_utc": 1652281397.0, "score": 93, "upvote_ratio": 0.93, "num_comments": 29, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|18|**First Seen In WSB**|1 year ago\n**Total Comments**|1292|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=unbvsq)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=unbvsq)", "score": 1, "replies": []}, {"body": "That’s probably why stocks are just going up and down today. Maybe around 2pm everything will crash", "score": 25, "replies": [{"body": "Hate to say it, but I hope so.  I have some crazy puts out there, around 20k worth I need to print.", "score": 14, "replies": [{"body": "I think everyone thought market was gonna tank today and spent all their buying power on puts", "score": 7, "replies": [{"body": "I should have straddled calls and puts today in spy.  Would have been less stressful.", "score": 5, "replies": []}, {"body": "Well, I told my wife my goal was to walk away with 20k profit today. Normally, I only try for 500 or so.   Today, I wanted to be a dancing bear though", "score": 1, "replies": [{"body": "Hopefully you kept your puts", "score": 1, "replies": [{"body": "lol I did. \n\nI sold some about 5 min ago.  I’m bag holding 403 spy calls right now, only 3k worth though.  I also have 390puts.  If it rips either direction, ill be ok.", "score": 1, "replies": [{"body": "How about now?😂", "score": 1, "replies": []}]}]}]}, {"body": "Friday", "score": 1, "replies": []}]}]}]}, {"body": "0.2% is well within the margin of error, says the engineer…\n\nEffectively the same number. Nothing materially changed. \n\nGoing to hear all sorts of spooging today on the financial channels about a tiny fraction of a percent — like it’s Jesus himself riding down from on high to save the economy. \n\nLol lol lol. \n\n(Idiots will believe it for a little while too.)\n\n“The number was better! The number was better!”\n\nBy how much, numbnuts? 0.2%? Go fuck off over there and go sit in the dunce corner. Here’s your hat. \n\nThe basket of bullshit changed price by 0.2%. BFD.", "score": 15, "replies": [{"body": "Not changing is not rising either which is still positive", "score": 3, "replies": [{"body": "Not really. The consumer just keeps losing purchasing power at the same rate, continuously multiplying…\n\nHave to pay attention to what the math means. Raising a multiple at a 0.2% smaller rate isn’t that much of a difference. It’s the multiple itself that’s painful.", "score": 4, "replies": [{"body": "When the fed stuck with the 0.5 rate hike and guidence I was initially shocked (I expected 0.75 or 1 considering how far behind curve they appeared to be). Looking back thats generally how the fed would control inflation in the past.\n\nNow im starting to think that they only want to slowly reduce inflation over the next 1-2 years. We wont see the effects of the 0.5 hike immediately but if next CPI comes in at lets say 7-7.5% then its very likely we seen the top of inflation already", "score": 2, "replies": [{"body": "Agree that they’re slow rolling it. \n\nDragging poor people through the gutter for two years seems to only be a play to help beat down the folks who can’t afford it — to make sure they’re obedient little workers again. \n\nThat’s a tad tin foil hattish and I’m not into that, but you know when food is 200% higher you tend to go get a job. \n\nI think they know some percentage of the so called “worker shortage” is really families who decided to drop to a single breadwinner during the pandemic. They want those folks back in, to raise revenues across the board. \n\nWe know a number of families who cut back to one worker and maybe one and a half with the second adult doing something easy to do on their schedule during the pandemic and they’re all looking at their budgets differently now wondering if they can keep the better lifestyle they chose. \n\nWe are oldish people with no debt and both of us never had to quit working throughout and my company doesn’t care if I ever come back in, really. We have been relatively great honestly. \n\nBut I don’t see our friends who are younger with families taking the brood out for dinner out much and any trips they have scheduled were booked a few months ago and then they’re tapped out. \n\nMany also aren’t finance nerds so they got snookered by this whole “reopening fixes everything” BS and they’re confused when I chat with them about inflation. But I try to warn them to get ready for at least a long expensive summer if not a long expensive two years… can’t predict length but the Fed isn’t hitting it hard enough. \n\nOne of my brighter friends literally asked “Who’s Jerome Powell?” when I posted a funny meme elsewhere months ago. \n\nThe general population just doesn’t follow this stuff. \n\nHe’s the guy beating the holy crap out of your retirement savings, man… have you looked this year?", "score": 2, "replies": [{"body": "The lowest wage quintil is the only cohort making real gains. That makes it tricky to shock rates down because the bottom 40% are smashed by unemployment jumps. I think housing deceleration will drag cpi down significantly through the next quarter.", "score": 1, "replies": []}]}, {"body": "They've been doing a lot more speech tightening. I think that Michael Woodford has been influential over the current Fed.", "score": 1, "replies": []}]}]}, {"body": "It did rise, just at a slightly lower pace.", "score": 1, "replies": []}]}]}, {"body": "These numbers get adjusted all the time by a huge margin a 0.2% decrease is basically noise. Meaningless.", "score": 3, "replies": []}, {"body": "Inflation is a bitch. Rise up the rates too much and you go into recession in an heartbeat. Raise them too low anx/or too late and you don't to anything.\n\nNow, I imagine that the last 0.5% actually will do a lot.\nProbably it will take inflation to 6-7% in the long term.\nBut the FED don't want to wait a couple of months, so they'll probably go \"full steam ahead\" and do another 0.25% each couple of months until you get around 3-4%.\nBy end 2022 you'll have 1,25% higher rates.\nThis means the US has at least until early 2023 before they should be able to take inflation to a manageable level. \n\nOf course this implies that no other external problem will arise in the meantime. Considering that there is a fucking war going on, I expect everything that I wrote to be fucking garbage by tomorrow morning.", "score": 2, "replies": [{"body": "They need to go full volkler on it 5% rate hike tomorrow.", "score": 1, "replies": [{"body": "I'm no finance PhD but if they did a 5% rate hike in a single time you would get a bad recession.\nAnd I'm not talking about a -2% gdp one. I'm talking about a \"hope your sons like stale bread and onions, cause that's all they're gonna eat for this year\" bad.\nWill it actually work? Yes, it would send inflation back to 1% in an heartbeat.", "score": 1, "replies": []}]}]}, {"body": "Seems less like a spin and more like a factual statement to relay the most information with the fewest words.", "score": 2, "replies": []}, {"body": "Actually it doesnt, because its Y over Y so its Bigger than last months", "score": 3, "replies": []}, {"body": "It's useful for seeing monetary momentum. Decelerating core cpi and nominal wage growth hint at more stable monetary policy. Energy and food include too much real information.", "score": 1, "replies": []}, {"body": "CPI in March: 8.3000001\nCPI in April: 8.30000000\n\n“Everything’s great we’re saved!”", "score": 1, "replies": []}]}
{"title": "The Bulls Aren't Going Anywhere", "selftext": "In 2022 the national debt payment is projected to be 305B on 26.265T of national debt at a rate of 1.4%, which is the 10-yr treasury bond yield.\n\n(source; [https://www.thebalance.com/interest-on-the-national-debt-4119024](https://www.thebalance.com/interest-on-the-national-debt-4119024))\n\n10-yr notes just hit 2.925% which means that the interest-only payment on national debt is about to balloon to 768B. (26,265,000,000,000 \\* .02925 = 768,251,250,000.)\n\n[https://www.cnbc.com/quotes/US10Y](https://www.cnbc.com/quotes/US10Y)\n\nThat's just interest alone.\n\nJPOW and the WH are using fear to try to drive down inflation - not fundamentals. They CAN'T raise rates prohibitively without bankrupting the country.\n\nTLDR;\n\nQE is coming back by 2023 and/OR interest rate hikes are going to stop because we can't actually pay the interest-only on our own national debt if we hike it too far and we're sure not going into national default.\n\n&#x200B;\n\nIpso Facso Oreo;\n\nSell puts to your advantage and buy in to your favorite stocks cheaply!\n\n  \nEdited for second source on 10-yr notes.", "id": "unfpxc", "created_utc": 1652291601.0, "score": 53, "upvote_ratio": 0.84, "num_comments": 27, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|2 months ago\n**Total Comments**|2|**Previous DD**|\n**Account Age**|2 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=unfpxc)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=unfpxc)", "score": 1, "replies": []}, {"body": "I think what you mean to say is we are screwed with any choice we make with rates", "score": 19, "replies": []}, {"body": "Your wrong thats exactly why we are so fucked", "score": 41, "replies": []}, {"body": "Your bullish thesis is dependent on more national debt and low interest rates ? Lol. You dumb son of a bitch. Japanification is bearish fool.", "score": 23, "replies": [{"body": "There is no other way out . Japanificaton is coming for the US and China at the same time ironically. Two super powers economies becoming geriatric might be what prevents a Third World War lol", "score": 1, "replies": [{"body": "Dying creatures often lash out in desperation", "score": 2, "replies": [{"body": "Not when both dying creatures have their kneecaps blown off and are in the nursing home.", "score": 2, "replies": []}]}]}]}, {"body": "Damn you dumb", "score": 8, "replies": []}, {"body": "If you’re actually interested in this topic, you need to check out the long term budget projections on cbo.gov.", "score": 6, "replies": []}, {"body": "Bulls are going back to Wendy’s ![img](emote|t5_2th52|4641)", "score": 5, "replies": []}, {"body": "I agree with you.  By 2023 we see mass QE again.", "score": 3, "replies": []}, {"body": "You know there's a thing called staying flat? At this rate we might end up with a flat market for 20 years", "score": 3, "replies": []}, {"body": "Yes yes yes, so much this. Everyone forgets that the Fed literally can’t raise rates high enough to fight inflation and it is going to eat everyone alive. When the makers realize the only option for the Fed going forward will be eventually back to BRRRRr, that’s when shit will get interesting. Possible currency crisis….gold? Cans of tuna?", "score": 4, "replies": [{"body": "Yep.\n\nI think most posters missed the point I was making.\n\nNot Japanification.\n\nRun away inflation :D", "score": 2, "replies": []}]}, {"body": "God damnit.  Cramer get the fuck off reddit.", "score": 9, "replies": []}, {"body": "Bulls been gored.", "score": 2, "replies": []}, {"body": "Why do these posts consistently ignore that both tax hikes (congress boosts income) and austerity (spending cuts) exist?\n\nThe Federal reserve controls monetary policy, not fiscal policy. They don't control the taxation lever or the spending lever.\n\nEverybody is in the same boat. As as stupid as the crew running the ship can be from time to time, the entire crew isn't going to vote for suicide.\n\nNeither are the billionaires who own them.", "score": 2, "replies": [{"body": "Betting that the US would go to austerity is like saying a terminal meth user can go cold Turkey. We both know that ain’t happening. The only way out on a fiscal side is to print print print or tax tax tax.", "score": 1, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Brilliant post, even for wallstbets", "score": 3, "replies": []}, {"body": "The bulls are going broke. That's where", "score": 2, "replies": []}, {"body": "We print more money, we'll never default - Donald J Trump", "score": 1, "replies": []}, {"body": "I can see why this would constrain rate hikes, but why would QE be on the table?", "score": 1, "replies": [{"body": "They have to reduce those bond yields back to 1.4% or we're stuck paying 1T+ on debt-servicing.", "score": 3, "replies": []}]}, {"body": "Short Etsy", "score": 1, "replies": []}]}
{"title": "BofA: ‘More buying of the dip’ seen among retail and institutional investors", "selftext": "https://finance.yahoo.com/amphtml/news/bof-a-more-buying-of-the-dip-seen-among-retail-and-institutional-investors-152147423.html\n\n“Private clients have been the biggest net buyers of U.S. equities YTD (where they have been more aggressive buyers of the dip this year after missing out on what has generally been a successful strategy for much of the post-GFC (Global Financial Crisis) period).”\n\nInstitutional clients have also been net buyers of equities year-to-date, while **hedge funds** have been net sellers.\n\nHedge funds unloading as retail\nand institutions are **STILL** buying the dip. It’s a long way until retail and institutional investors are convinced the dip doesn’t really exist anymore, big names (AAPL, TSLA, MSFT, …) are just beginning to roll over, we will see S&P below 3000 before the end of the year.", "id": "unj37w", "created_utc": 1652300749.0, "score": 52, "upvote_ratio": 0.86, "num_comments": 27, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|2 years ago\n**Total Comments**|254|**Previous DD**|\n**Account Age**|9 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=unj37w)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=unj37w)", "score": 1, "replies": []}, {"body": "What is Cramer writing this tripe?", "score": 12, "replies": []}, {"body": "They say the same shit after every bubble pops. You'll know when the market is ripe for buying the dip when you see many articles like these. Hedge funds pay people to spin out BS to create opportunities to BUY or SELL.", "score": 23, "replies": [{"body": "Yep they’ve been saying the same since 16000", "score": 3, "replies": []}]}, {"body": "So, this take assumes that hedge funds are currently right to be selling plus short selling and puts and whatever else. That institutions and retail are wrong for holding, and buying over time. Assuming that this time “buy the dip” is wrong. Assumptions are assumptions. Only time will tell.", "score": 7, "replies": []}, {"body": "It looks like OP posted an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://finance.yahoo.com/news/bof-a-more-buying-of-the-dip-seen-among-retail-and-institutional-investors-152147423.html](https://finance.yahoo.com/news/bof-a-more-buying-of-the-dip-seen-among-retail-and-institutional-investors-152147423.html)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)", "score": 5, "replies": []}, {"body": "I don't believe that. After the raping retail is getting in 2022, the vast majority will never come back.", "score": 13, "replies": [{"body": "American households are sitting on record savings according to Powell.", "score": 10, "replies": [{"body": "Well thank heavens for that thought I was broke", "score": 22, "replies": []}]}, {"body": "What? \n\nMy dude, just because you are bitter, doesn’t mean that “the *vast* majority will Never come back” to the market. \n\nI know your fee-fees are hurt by the mean red candles, but everything is fine. Let it fall through the floor. More discounts for us young folks. \n\nLet the boomers accounts all Implode right as they hit retirement, while we all buy the all time lows on our favorite companies. \n\nTo the *CORE* of the earth!\n\nThe wheel weaves as the wheel wills or some shit.", "score": 11, "replies": [{"body": "After 08, a lot of retail investors were burnt so much that they never returned to the stock market. I wouldn’t underestimate the trust damage that is currently done to the market.", "score": 5, "replies": [{"body": "Thank you. I went through dot com bust and all of the others since. I saw many at my place of employment close out their 401k's in 2008 and never come back. I was not one of those people!", "score": 3, "replies": []}, {"body": "If they didn't come back, they missed out on many 10x gain stocks (literally just buy FAANG). Then they probably complain why it's \"impossible to be rich\" despite not trying", "score": 3, "replies": []}]}, {"body": "They’ll always be back lol I’ve lost so much money and come back after months hell even years", "score": -1, "replies": []}, {"body": "I underestimated the stupidity of your generation. I stand corrected! You're in it to lose it and I sure won't stand in your way. I retired in my 50's but you'll be working until the day you die because of your attitude.", "score": -2, "replies": [{"body": "Lol, pragmatic attitude going to cause them to live in poverty for the rest of his life?\n\nI don't think so.\n\nIt's the damned economy.  Minum wage has not kept up with inflation and there just aren't enough seats around the table of American Dreams.\n\nThe youth are impoverished because of Reaganomics and corporate greed.", "score": 4, "replies": []}]}, {"body": "We must break the wheel!", "score": 1, "replies": []}]}, {"body": "Retail is in far better shape in 2022 then the dot com and housing crashes. With each generation comes more younger investors. Retail will be fine.", "score": 4, "replies": [{"body": "Depends how much further it goes down.  If SPY goes under covid drop of $250 I think a lot of people will be re-thinking the market.", "score": 1, "replies": []}]}]}, {"body": "I fear you’re right", "score": 5, "replies": []}, {"body": "Hedge funds performance is lower than retain", "score": 2, "replies": []}, {"body": "Be greedy when others are fearfulz", "score": 2, "replies": []}, {"body": "This is what I call transfer of wealth.", "score": 2, "replies": []}, {"body": "Read:  Wealth management is palming off market losses on the affluent and institutions are rebalancing their dog shit mutual funds to look like they had better returns.  The 1% have taken profits and left the burning 🔥 😳 building. After telling you \"cash is trash\",  the usd is globally kicking butt.", "score": 3, "replies": []}, {"body": "Lies I tell you.", "score": 2, "replies": []}, {"body": "!remindme 7 months", "score": 1, "replies": []}, {"body": "Probably by end of this Friday", "score": 1, "replies": []}]}
