{"title": "Long SPY calls before April CPI release tomorrow", "selftext": "------------\nLong SPY calls before April CPI release tomorrow.  Use a modest size and keep a short leash on a speculative trade\n\n•\tOdds favor a significant rally at the April CPI release, but it is unclear how long the rally will last\n\nOur trade\n\n•\tLong SPY calls before close today. Exit the position near close tomorrow\n\n------------\n\nSituation\n\nExtreme market volatility, major technical damage, investors question FOMC credibility\n\n•\tFOMC met on May 4 to hike rate by 50 bps, starting QT in June of $47.5bn/month for 3 months, followed by QT of $95bn/month from September. Powell ruled out possibility of a 75 bps rate hike (50 bps hikes still baked in)\n\n•\tMarket exploded for the day. S&P500 close up 3% on Fed’s surprisingly dovish stand relative to market expectation\n\n•\tMarket then nosedived on May 5, erased all May 4 gains.  Continued selling in subsequent days pushed SPY closing below its Feb 24 intraday low. Sentiment deteriorated further but not at a panic extreme yet\n\n•\tCommentators, and a few big-name fund managers, attribute the extreme reversal to “unforced error of FOMC and Chair Powell,” believing that Fed is way behind the curve in fighting inflation \n\nAnalysis\n\nSoft April CPI likely, Fed got this one right likely, a significant rally at April CPI release likely but sustainability uncertain\n\n•\tWe stand by our analysis in the May 3 Reddit post, but inflation debate obliges us to share more details:\n\n\tHistorical charts of CPI and its factors suggest that CPI response to massive spikes of an individual driver (crude, metal, etc.) is often muted. Concerted rise or fall of the factor prices drive the rise or fall of CPI\n\n\tIt is the combined rise of lumber, metal, freight, labor, crude and other prices that drives current inflation\n\n\tCPI often has a lag in its response to the rise and fall of factor prices. But sharp price declines in major drivers (crude, lumber, et al) from their extreme levels produce immediate declines in CPI from time to time\n\n\tRelative stability of core CPI components  (rent, unit labor, et al.), the extreme price levels of metals and lumber and their subsequent sharp declines, and the gradual ease of chip shortages and other supply constraints suggest that current CPI could be on the verge of a gradual decline\n\n\tCurrent levels of crude and wheat price historically produced far less inflation than current CPI.  While it certainly has an impact, the effect of Russia/Ukraine war on inflation appears to be exaggerated\n\n\tOur observation is not an analytic framework and cannot predict the exact lead/leg b/w CPI and its factors.  There are also major risks (China lockdown, supply disruption, war uncertainty).  However, we are confident directionally, and the CPI base effect provided the necessary margin for our May 3 call\n\n\tThe surprisingly dovish FOMC decision added to our comfort.  It won’t be a surprise if we learn that Fed likely saw preliminary data pointing to April CPI moderating before May 3 FOMC meeting\n\n•\tMarket reversal reflects investors’ disapproval of FOMC. It may also reflect concerns about potential mistakes of tightening into a recession, and the public admission that US provides intel to sink Russian ships and kill its generals\n\n•\tGiven that a sizable number of investors believe Fed is being too dovish and is behind the curve in fighting inflation, and the excessive bearish sentiment, a soft April CPI reading tomorrow will likely produce a strong rally\n\n•\tHowever, durability of the bounce is uncertain. It could last for days, but it could also be short lived - inflation likely to remain high for a while, tightening has just begun and will continue, and the economy likely to further slowdown\n\nConclusion\n\n•\tOdds favor a significant rally at April CPI release on May 11, but please tread with caution\n\nNote\n\n•\tUnless stated explicitly otherwise, our trades bet on specific events not market directions, and we exit our bets at the event completions. These trades intend to produce alpha. If you have a strong directional view, consider expressing it via a beta exposure instead\n\nDisclaimer\n\n•\tFor information sharing only. See www.traderoryan.com/disclaimer for details. Macro bets are highly speculative, much more so than stock bets. There will be wrong analyses and losing trades.  Investors should conduct their own analysis and be sure to manage risks and use a proper position size", "id": "umlboo", "created_utc": 1652196494.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 23, "comments": [{"body": "i love your enthusiasm and positivity, so cute", "score": 8, "replies": [{"body": "Always nice when Jimmy Cramer shows up on this sub", "score": 2, "replies": []}, {"body": "?\n\nbut thanks for check in :-)", "score": 1, "replies": []}]}, {"body": "Yeah I’ve had puts for a couple weeks and I definitely opened 406 SPY calls yesterday afternoon and added to them this morning on the same premise. I feel like CPI has to be 9% or higher for the market to not have already priced it in and find it to be favorable.", "score": 5, "replies": [{"body": "Thanks for checking in, and glad to hear that you share our view!  Although I welcome others to take our thesis apart - so we can all get better in what we do.  \n\nI am much more cautious than you are though.  The price action really does not look good (the sharp reversal of FOMC rally and today). But I believe if CPI comes in at or below the expected 8.1%, we will see fireworks tomorrow (confirmation that CPI peaked and Fed is having this under control is a much big deal than FOMC decision itself, or a manager covered its shorts).  Longer term, I have no clear view and do not want to bet on market direction with our alpha trades. \n\nHappy trading!", "score": 3, "replies": []}, {"body": "oops, just notice that market actually turning sharply higher now...", "score": 1, "replies": [{"body": "Yea they’re profitable, my VIX puts also opened yesterday around market close are doing even better", "score": 1, "replies": [{"body": "good for you!", "score": 1, "replies": []}]}]}]}, {"body": "Biden on CNBC, talking about inflation", "score": 1, "replies": []}, {"body": "Sorry guys this trade did not work out – CPI did cool down, but not enough to sustain a rally into close (April 8.3% vs March 8.5% vs consensus 8.1%).\n\nI eked out a tiny gain - CPI higher than consensus and I had May 11 calls, so I used a stop on the way up, I was cautious to begin with anyways - hope you two (u/ZeusThunder369, u/NobleMotary) are doing okay.  If you have long dated calls, you will likely be okay – inflation begin to gradually cool down from here, tightening is doing its job (to slow things down), war likely to be a frozen conflict soon, the worst of china lockdown will be over soon, and market valuation is very reasonable at current level (did I mention that the credit market held up well and 10-yr yield actually down today?). There may be another day or two of heavy selling, but a short-term bounce is likely still in the cards within a week or two. \n\nFor other Redditors, this is not a market direction call nor a short-term trade call – I have no clear view longer term, and I have not done any homework. Just my gut feeling to cheer up my fellow traders who had a rough day. \n\nWell, it's the real life of a trader – you win some and you lose some. It helps we don’t take any single trade seriously. \n\nHappy trading!", "score": 1, "replies": [{"body": "All good here. Sold around 7:30 PDT after not seeing any signs of a big daily upward trend. Obviously wasn't what I was hoping for, but came away with a very small gain.", "score": 1, "replies": [{"body": "congrats! only the ones who actually doing it know how good it is not to lose with a bad draw!", "score": 1, "replies": [{"body": "Yeah, looking back the last 10 years or so I don't remember many specific trading days. But the ones I do remember are when I gained a very small amount or only lost a few percent when I could have lost a lot more if I tried to be greedy and/or hopeful.", "score": 1, "replies": []}]}]}]}, {"body": "RemindMe!1Day", "score": 1, "replies": [{"body": "Sorry, I rushed this as quickly as I can. Given the volatility and the extreme poor price action, I sat on this post for a day just so that I can step away and ask myself what could possibly go wrong with our analysis.   \n\nThere is no guarantee that this trade will be a win, so you may not miss much after all! We take our analysis very seriously but do not put much weight on any single trade. \n\nthanks for checking in, and till next trade :-)", "score": 2, "replies": [{"body": "How did it go?", "score": 1, "replies": [{"body": "Not sure if you can see my earlier comment.  I copied it here for you.\nthanks again for checking in. \n----\nSorry guys this trade did not work out – CPI did cool down, but not enough to sustain a rally into close (April 8.3% vs March 8.5% vs consensus 8.1%).\n\nI eked out a tiny gain - CPI higher than consensus and I had May 11 calls, so I used a stop on the way up, I was cautious to begin with anyways - hope you two (u/ZeusThunder369, u/NobleMotary) are doing okay. If you have long dated calls, you will likely be okay – inflation begin to gradually cool down from here, tightening is doing its job (to slow things down), war likely to be a frozen conflict soon, the worst of china lockdown will be over soon, and market valuation is very reasonable at current level (did I mention that the credit market held up well and 10-yr yield actually down today?). There may be another day or two of heavy selling, but a short-term bounce is likely still in the cards within a week or two.\n\nFor other Redditors, this is not a market direction call nor a short-term trade call – I have no clear view longer term, and I have not done any homework. Just my gut feeling to cheer up my fellow traders who had a rough day.\n\nWell, it's the real life of a trader – you win some and you lose some. It helps we don’t take any single trade seriously.\n\nHappy trading!", "score": 1, "replies": [{"body": "I sold my calls about an hour and a half into the trading day, they were profitable, but not by much. I flipped to puts and they went just fine. Did both with SPY around 402.7X. It was pretty obvious the market wasn’t going to rip after an hour of watching. I agreed with the concept! This level of inflation must have been mostly priced in.", "score": 1, "replies": [{"body": "cool, glad to hear that!", "score": 1, "replies": []}]}]}]}]}, {"body": "I will be messaging you in 1 day on [**2022-05-11 20:36:16 UTC**](http://www.wolframalpha.com/input/?i=2022-05-11%2020:36:16%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/StockMarket/comments/umlboo/long_spy_calls_before_april_cpi_release_tomorrow/i83igt2/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2Fumlboo%2Flong_spy_calls_before_april_cpi_release_tomorrow%2Fi83igt2%2F%5D%0A%0ARemindMe%21%202022-05-11%2020%3A36%3A16%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20umlboo)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Same view here. Dropped puts on Monday and got calls. Market has cash on hand and is just waiting to confirm CPI isn't crazy high.", "score": 1, "replies": [{"body": "thanks for sharing!", "score": 1, "replies": []}]}, {"body": "!RemindMe 1 day", "score": 1, "replies": []}]}
{"title": "Here’s why inflation should not be a big issue", "selftext": "[deleted]", "id": "um5grf", "created_utc": 1652142039.0, "score": 0, "upvote_ratio": 0.26, "num_comments": 25, "comments": [{"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Yes, understanding the cause makes it just fine.  \n\nSort of like cancer.", "score": 25, "replies": [{"body": "That's unfair to cancer. If we know the cause of cancer, new treatments to target these specific causes can be studied.\n\nWhen's the Fed going to publish their data on improving the survival outcomes of the economy, huh?", "score": 2, "replies": []}, {"body": "Exactly.\n\nIf you get cancer from smoking, the goal is that you get cured and you (hopefully) don’t do it again. \n\nTranslating that to inflation, the gov’t inverses it and then (hopefully) improves policies to help prevent it from happening again in the future", "score": -3, "replies": [{"body": "Yes but you still have cancer.  And cancer fucking sucks.", "score": 5, "replies": [{"body": "Your analogy isn’t really working though. You have cancer, you go to the hospital to get it cured. In inflation terms, the “hospital” is the government following protocol to alleviate it, which is what’s currently happening", "score": -3, "replies": [{"body": "Yes.  And cancer kills millions of people every year.  And if you survive, you still have problems.  Maybe it comes back because cancer doesn’t give a fuck about you.  Either way, you aren’t the same person before you had cancer.  You’re never “all better” afterward.", "score": 3, "replies": [{"body": "Stop comparing inflation to cancer man, not really a good comparison at all.", "score": 1, "replies": [{"body": "😂", "score": 1, "replies": []}]}]}]}, {"body": "And chemo and radio treatment can kill you.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Obviously lol", "score": 1, "replies": []}]}]}, {"body": "Not to mention he got the cause wrong.", "score": 1, "replies": []}]}, {"body": "I disagree completely.  The cause of it is not nearly as important as the solution.  And the only real tool the Fed has at its disposal is to raise rates.  That comes with real economic consequences, so yes, we should be concerned.", "score": 4, "replies": [{"body": "Understanding the cause of something is way more important than scrambling for a solution afterwards. \n\nIf you are driving through a road with a million potholes, is it better to change your tire every 5 minutes, or is it better to understand that the road your on has an issue and take another road? \n\nThis example is not just about inflation, you can apply it to any situation. It’s simple cause & effect", "score": 0, "replies": [{"body": "That's how government works.", "score": 1, "replies": []}, {"body": "That isn't analogous.  Knowing that QE, low rates and government spending in response to a once-in-a-century pandemic is the cause of the situation doesn't tell us anything about the solution.  \n\n\nSimilarly, knowing that exposure to asbestos caused your cancer doesn't tell you what to do about the cancer.", "score": 1, "replies": []}]}]}, {"body": "Holy shit, that’s brilliant. Have you called JPow and explained the situation?", "score": 5, "replies": []}, {"body": "Tell that to my portfolio…", "score": 2, "replies": []}, {"body": "Just imagine how much STUFF isn’t getting made or shipped because the people in China are being held prisoner in their apartments, and then just imagine what happens when Walmart and Target and Costco run out of that STUFF and their shelves get really empty.  Then imagine how much that STUFF is going to cost if you can even find it for sale.", "score": 2, "replies": []}, {"body": "You, me and everyone with a brain understand it. But as our unfortunate elected officials put it \"we have to spend more to stop it\" so inflation is a big issue and will continue to be an issue for many months to come.", "score": 0, "replies": []}, {"body": "The stimulus money, PPP, and QE will drain out of the system by 3789 AD.", "score": 1, "replies": []}, {"body": "Because once wages go up because of inflation people will voluntarily give up those raises when the appointed time comes for prices to return to the old normal.", "score": 1, "replies": [{"body": "No, but as people cycle out of jobs the entry wage will be lower the next go around.", "score": 1, "replies": [{"body": "When you say people cycle out of jobs they usually look for higher paying jobs. Unfortunately companies take control to reduce payroll by cycling employees to severance package.", "score": 1, "replies": []}]}]}, {"body": "I don’t care about inflation, I care about how the fed is reacting to inflation", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "umaxyv", "created_utc": 1652159392.0, "score": 6, "upvote_ratio": 0.69, "num_comments": 23, "comments": [{"body": "Why those? Just because some stocks crashed harder than others don’t make them attractive buys. Look for where they are headed and not where they have been.", "score": 10, "replies": [{"body": "That’s a good point. I like their business. I have avoided some of them mostly Shopify because I sort of felt that I missed the train. But know that prices are low I am revisiting.", "score": 0, "replies": [{"body": "Do you think Chiptole is capable of 20% growth over the next 10 years?\n\nBecause that's what I need to see in order to get a 12% return assuming a PE of 22.\n\nFYI they've only averaged 12% growth over the last 10 years", "score": 0, "replies": []}, {"body": "Do you think carvana will ever be profitable and can you trust those Family who is running it?", "score": 1, "replies": []}]}]}, {"body": "Honestly I'm not even bullish on anything but I'm buying\n\n* AMD\n* GOOG\n* U\n* BRK.B\n* VTI \n* AAPL\n* PYPL\n\nI sold out of my largest position (RTX) on the runup and looking to buy TGT/CROX or UPS", "score": 5, "replies": [{"body": "I was looking at crox and I am really considering starting a position, especially with their acquisition of Hey dudes, I think it is very undervalued!", "score": 1, "replies": []}, {"body": "Yes, I agree. \nEspecially PYPL and GOOG", "score": 1, "replies": []}]}, {"body": "JP Morgan, Meta, Paypal and T Rowe Price. Strong cash flow for all", "score": 5, "replies": []}, {"body": "Most of those stocks are still very expensive given what growth multiples go in a normal market. Carvana will probably go bankrupt - they need to pay close to 400m debt repayments a year and have no operating profits. \n\nPlease research them more.", "score": 5, "replies": []}, {"body": "I think Cloudflare is at a respectable level to start a DCA into. I started researching them a few weeks ago, and will probably take a position soon in them. They have a high valuation, but I think they will grow into it.", "score": 7, "replies": []}, {"body": "MELI, GOOG", "score": 2, "replies": []}, {"body": "Stocks Im bullish on? Lol. World War 3, inflation, a potential global recession… the list goes on. I don’t see the selling pressure stopping here. \n\nThen again, what the hell do I know 🤷\n\nBut the oil/gas sector has been a great performer for me for the past year. Will probably continue to do so for the time being.", "score": -3, "replies": []}, {"body": "TGT, UPS, PEP", "score": 0, "replies": []}, {"body": "Simon Property Group.  SPG.  REIT that is a Dividend machine.  CEO David Simon is as good a corporate leader as you will find.  On sale for $120 right now.  Great cornerstone to any portfolio.  Fantastic earnings just reported, consistently profitable even during Covid, dividend increase just announced as well as a $2 billion stock buyback.  Pandemic reinforce that we are social animals and going to the mall is a cultural fixture in our society.", "score": 0, "replies": []}, {"body": "The ones that will be going up", "score": -2, "replies": []}, {"body": "Amazon, FB and BABA .", "score": 0, "replies": []}, {"body": "Genprex", "score": -4, "replies": []}, {"body": "SPCE", "score": -7, "replies": []}, {"body": "Amazon", "score": 1, "replies": []}, {"body": "CRWD \nNVDA", "score": 1, "replies": []}, {"body": "Just started buying BWA, MU, INTC, GOOG, DIS, GLW, U\n\n\nWill add Ford if it drops under 10 and SoFi if it drops under 5 (very speculative) \n\nAlso interested in DE and CAT. and maybe RIVN if I can get it under 7 a share.\n\nI DCA in small amounts on BWA, MU, INTC, GOOG, DIS, GLW, and U cause I'm not sure we've even come close to a bottom but I also cant forecast the future!!", "score": 1, "replies": [{"body": "*can't", "score": 1, "replies": []}]}, {"body": "Carvana eh?", "score": 1, "replies": []}]}
{"title": "‘Buy the Dip’ Believers Are Tested by Market’s Downward Slide", "selftext": "https://www.wsj.com/articles/buy-the-dip-believers-are-tested-by-markets-downward-slide-11652197077\n\nSmall investors continue to pour money into stocks despite the grimmest outlook in years for interest rates and a possible recession; ‘When the market zigs, I zag’\n\nThis year’s stock market volatility has turbocharged a favorite strategy among individual investors: buying the dip. The dramatic plunge in major indexes will test their resolve.\n\nOn Thursday, when the stock market had one of its worst days of the year, individuals rushed in, setting a one-day buying record. In March, they invested the largest ever monthly sum, according to Vanda Research data beginning in 2014, and continued to pour money into the markets in April.\n\nIndividuals’ willingness to backstop markets throughout this year’s selloff demonstrates that the group—for now—has been more resilient than analysts and trading professionals anticipated. Few were surprised when individual investors pounced on small dips as the market churned higher last year, helping the S&P 500 cruise to 70 records and rewarding those who waded in.\n\nThis year, the S&P 500 has fallen 16%, its worst start to a year in nearly a century, and the Nasdaq Composite has dropped 26%. Inflation is at a 40-year high, and the Federal Reserve has embarked on an aggressive monetary tightening cycle, enacting this month its biggest rate increase since 2000. That has fanned worries about a recession—periods when stocks have on average fallen as much as 29%, according to Dow Jones Market Data.\n\nSome of the wildly popular trades of the past two years have already crumbled. Many investors have soured on richly valued technology stocks. Newly minted public companies, which soared last year, have come back down to earth. Highly speculative corners of the market, such as Cathie Wood’s flagship ARK Innovation exchange-traded fund, have plummeted.\n\nDespite the turning tides, many individual investors said they have relished the chance to buy stocks at a discount. Many said the calculation is simple: History has shown that stocks eventually go up.\n\nSmall investors plowed $114 billion into U.S. stock funds through March as the S&P 500 tumbled into a correction, falling at least 10% from its high, according to Goldman Sachs Group. That marks a sharp shift in the group’s strategy for much of the past two decades. Typically, individual investors have sold about $10 billion in the 12 weeks after a market peak when the S&P 500 has tumbled that much.\n\nIn the month of March alone, individual investors bought about $28 billion of U.S.-listed stocks and exchange-traded funds on a net basis—the total amount after subtracting the amount sold—the largest monthly sum on record, according to Vanda, and another net $24.4 billion in April. On Thursday, when the S&P 500 tumbled 3.6%, individual investors bought a net total of nearly $2.6 billion of stocks and ETFs, a one day record, according to Vanda.\n\nJohn Case, a 71-year-old retired engineer in Las Vegas, said he has tried to follow famed investor Warren Buffett’s advice to be “greedy only when others are fearful” and to hold stocks for long periods of time.\n\nHe said he has often stepped into the market during times of volatility and learned this lesson the hard way when he sold some of his shares during the 2008 financial crisis. That plunge was followed by an 11-year bull market during which the S&P 500 surged roughly 400%. Now, he said he is more confident in his strategy.\n\n“When the market zigs, I zag,” Mr. Case said.\n\nUnlike the crash of early 2020, which lasted just 23 trading days, investors are weathering a more prolonged selloff that could worsen as recession risks grow. The Fed’s move to raise rates and shrink its $9 trillion asset portfolio has already triggered a selloff in the government-bond market, sending the yield on the benchmark 10-year U.S. Treasury note jumping past 3% to its highest level since 2018. Higher yields typically chip away at the stock market’s allure by giving investors another attractive place to park their cash.\n\nIndividual investors’ appetite for stocks diverges from the behavior of professional investors, who have collectively sold stocks during the turbulence. JPMorgan Chase & Co. estimates that institutional investors have pulled $199 billion out of the stock market this year, according to an analysis of public order flow data through Friday. Meanwhile, pros keep ramping up bearish bets against major U.S. equity indexes through the futures market, analysis from Citi Research shows.\n\nThat hasn’t stopped many individual investors from wading in. Their allocation of stocks in their portfolios crept up to nearly 70% last month, hovering around the highest levels since early 2018, according to a survey by the American Association of Individual Investors. Many individual investors whittled their exposure to bonds, sending fixed-income allocations to a 14-year low.\n\nThe strategy of picking up stocks and other investments on sale has grown so popular that the term “buy the dip” has mushroomed into an online sensation, garnering millions of mentions on social-media platforms. The growing entanglement of investing and social media means that even sharp plunges can bring on calls of FOMO—fear of missing out.\n\nIn January, when stocks suffered their worst month since the early days of the Covid-19 pandemic, and prices of assets including stocks, bonds and bitcoin slid, many investors turned to platforms such as Twitter and Reddit to tout the strategy, leading to more than 200,000 mentions across social media, according to social-media management company Hootsuite. That’s more than 30 times the figure three years ago.\n\nSome strategists say buying the dip is a risky way to invest because it is so difficult to gauge whether the market is going to keep falling. Vanda estimates the average individual investor portfolio peaked late last year and has since tumbled, giving the average individual a paper loss of about 28%.\n\nOnline brokerages including Robinhood Markets Inc. have reported a slowdown in customer trading activity in recent weeks.\n\nChief Executive Vlad Tenev said on the firm’s April earnings call that it faced a “challenging macro environment, one most of our customers have never experienced in their lifetimes,” noting that for most of its history, “Robinhood has operated in a period of low interest rates, low inflation and rising markets.” He said that while larger customers are still remaining active, many other customers have become more cautious with their portfolios and are trading less frequently.\n\n---\n\nJust to be clear, this article is not critiquing a passive strategy of consistently buying index funds via DCA.  They are instead referring to retail investors testing active strategies in a perceived downturn.", "id": "ummmp3", "created_utc": 1652199992.0, "score": 10, "upvote_ratio": 0.73, "num_comments": 28, "comments": [{"body": "[deleted]", "score": 34, "replies": [{"body": ">this market has to reverse at some point\n\n“It ain’t what you don’t know that gets you into trouble. It’s what you know for sure that just ain’t so.”", "score": 8, "replies": []}, {"body": "The market doesnt have to do anything.  However it's very likely", "score": 7, "replies": [{"body": "If it doesnt reverse then we got bigger issues than a retirement account tbh.", "score": 6, "replies": []}, {"body": "But it better.", "score": 2, "replies": []}]}]}, {"body": "No it’s only ok to buy stocks at all time highs! How else you think we can turn retail into bag holders!", "score": 22, "replies": []}, {"body": "I am completely new to this but maybe buying dividend focus stock like Verizon might be a better play through all this turbulence.", "score": 8, "replies": [{"body": "I threw you an upvote to counter whatever idiot downvoted you.\n\nI was stuffing $VZ into my bag like I was on Super Market Sweep when it dropped to $45 after earnings. \n\nCheap dividend stocks are definitely the smart play right now!", "score": 4, "replies": [{"body": "Thanks.", "score": 2, "replies": []}]}]}, {"body": "It's worrying to me that institutions are selling off but not retail.  I'm not sure if the \"stocks go up\" mentality is genuine wisdom or just wishful thinking.", "score": 3, "replies": [{"body": "I think in the long run the *market* goes up (at least in the US & based on long term history).\n\nIndividual stocks might or might not go up; they might stagnate or even go to zero (not safe blue chip stocks like Worldcom, Enron, Kmart, or Toys-R-Us but, you know, other risky stocks).", "score": 5, "replies": [{"body": "Yes, generally speaking it seems like we can assume that the market will continue to go up, but it's concerning to me that people buy based off that assumption alone rather than paying attention to valuation or historical means.", "score": 1, "replies": []}]}, {"body": "In the long run, stocks do go up...but in the short and medium term anything can happen.  Sometimes the medium term can last over a decade...", "score": 2, "replies": [{"body": "Not in Japan.  It's scary that people will just look at the chart and say \"hey it always goes up!\" / \"hey it went down a bit!\" and buy based on that rather than paying attention to any sort of valuation.", "score": 0, "replies": []}]}]}, {"body": "\"Some strategists say buying the dip is a risky way to invest because it is so difficult to gauge whether the market is going to keep falling.\"\n\nThis has always been a strange viewpoint to me.   Buying stocks at any time is risky because you don't know when the market is going to fall.    It doesn't matter if it is up or down the day you buy, it could go up or down the next day.  But if you buy the dip, at least you know you didn't buy the peak.", "score": 3, "replies": []}, {"body": "I don't think we're answering the same question. \n\nThe only people being compelled to move into t bills should be doing so because they already maxed out their I bonds for the year.\n\nWould I leave money in I bonds for the next 10 years? No\n\nAre they smarter than t bills for at least the next year? Yes\n\nAre they equivalent to cash? Never, they'll always be better than holding cash unless there's prolonged deflation. That's the whole point.", "score": 2, "replies": [{"body": "> Are they equivalent to cash? Never, they'll always be better than holding cash unless there's prolonged deflation.\n\nThis is the point of disagreement, because \"cash\" pre-2008 included money markets which matched inflation.  I bonds are a cash equivalent in this sense.  \n\nRight now, cash equivalents outside of i bonds are not matching inflation.\n\nThe distinction between pre-2008 reality and post-2008 reality is significant, because the Fed for years has been trying to put this chapter behind us and return to normalcy.", "score": 1, "replies": [{"body": "Money Markets are not and have never been cash. \n\nThey are very low risk but still an investment.\n\nWhether they both are cash equivalents is debatable, as i bonds lack short term liquidity.\n\nIn the current short term environment where cash and money markets are yielding 0% and <1% and i bonds are at 9.62%, considering them equivalent seems strange.\n\nI too would like to return to a world where money market deposits can at least match inflation, so there is less incentive to pour everything into stocks, but I don't see it happening any time soon.  \n\nIt would require increasing interest rates to the point of serious pain for homeowners and anyone with a 401k, and if 2008 taught us anything it's that the Fed's answer to a bubble bursting is to blow another bubble with QE, making holding cash seem a lot like holding the bag.", "score": 1, "replies": [{"body": "> Whether they both are cash equivalents is debatable\n\nThen let's just leave it at that, because 5-6 comments in and we're both still saying the same thing.", "score": 1, "replies": []}]}]}]}, {"body": "Depends what dips they're buying.\n\nBuying solid names with low P/Es and increasing dividend yields that are being dragged down with the rest of the market is a smart move right now, unless you want to sit on cash and hope for a lower entry.\n\nBuying \"growth stock\" dips seems unwise.\n\nThe article talks about the 10 year T-bill being alluring, but the real allure is i bonds paying out a guaranteed 9.62% for at least 6 months.\n\nHard to imagine why anyone with the means wouldn't be reallocating at least some money there.\n\nNot mentioning this makes me question the subject knowledge of the writer and their editor, but that's the case with almost all market coverage.", "score": 4, "replies": [{"body": "I've seen a lot of discussion about I bonds on /r/personalfinance, and the growing consensus there seems to be that I Bonds are not quite investments, rather they are cash equivalents.  I Bonds are only meant to match inflation, and even at that they fall short because the interest is taxed.\n\nTreasuries on the other hand are typically seen as safe haven investments, something that generally one can expect to get a real rate of return.  Not exactly happening now, but anyway...", "score": 2, "replies": [{"body": "I wouldn't consider something paying 9.62% interest as equivalent to cash which pays nothing.\n\nYou pay taxes (only federal) on interest from both t bills and I bonds.\n\nIn periods of low inflation the T Bill makes more sense, but even if inflation dropped to 0% tomorrow, the I bill still will pay out better over the required holding period since the 9.62% is guaranteed for at least 6 months.", "score": 4, "replies": [{"body": "> I wouldn't consider something paying 9.62% interest as equivalent to cash which pays nothing.\n\nIt's zero real return.  Before 2008, you could put cash into a money market account and match inflation.\n\n>You pay taxes (only federal) on interest from both t bills and I bonds.\n\nYes, but t bills are designed to provide an actual real return.  I Bonds are structurally designed to match inflation.", "score": 1, "replies": [{"body": "Instead of designed, say loop hole in congressional law.  Guaranteed 10% when you can borrow at 4% is awesome.", "score": 1, "replies": []}]}]}]}]}, {"body": "if you don't discuss which actual stocks people are buying this is an entirely pointless article.", "score": 1, "replies": []}, {"body": "They never learned the concept of \"don't try to catch a falling knife\".", "score": 1, "replies": []}, {"body": "I accumulate shares. I’m not really looking at stock prices anymore as an asset that gains or loses. I instead sell the option to buy the stock. Therefore I’m not chasing the price of the stock. I just need 100 of them.", "score": 1, "replies": []}, {"body": "Sell the rip is the new norm.", "score": 1, "replies": []}, {"body": "Every Wall Street goon who says buying this deep is bad only convinces me further to double down my all in strategy. The Oracle is buying and so am I.", "score": 1, "replies": []}]}
{"title": "where is the money going?", "selftext": "As far as I know about 70% of the S&P500 is owned by institutional investors (Hedge funds, banks ...)\n\nThose institutes usually have very well defined places where they're allowed to invest in.\n\nAny kind of selloff that triggers such reduction in market cap is lead by such institutional investors because they're the one who can offer significant shares to sell.\n\n\nmy question is, is there a way to see what percentage of the daily trading is done by institutional investors. and if it's high, then why are they cashing out? especially since inflation is so high", "id": "umn9va", "created_utc": 1652201734.0, "score": 19, "upvote_ratio": 0.81, "num_comments": 23, "comments": [{"body": "I’m surprised you didn’t ask who are funding those institutions, the real institutional investors. \n\nStateStreet Vanguard Schwab Fidelity BlackRock hold tens of trillions and obviously the money doesn’t belong to them.", "score": 19, "replies": []}, {"body": "How much is owned by Blackrock and Vanguard, through their ETFs? This would give us a better idea of retail investment.", "score": 7, "replies": []}, {"body": "[removed]", "score": 8, "replies": [{"body": "yeah that make sense .. finally an answer that make sense", "score": 1, "replies": []}]}, {"body": "It's retirement season", "score": 2, "replies": []}, {"body": "People have a hard time understanding how a fiat debt money system works.  All major currencies are debt based system that are not backed by any assets such as Gold.  If prices of assets go down than that money or cash simply disappears.  If I own $100k  in US dollars and buy $PYPL shares when it was $300 and now it's $100 my wealth is now $33k dollars. That $66K simply vanished since there were no new buyers with debt to buy what I had to sell. At the same time the people that sold to you at $300 a share didn't ask for Gold as a payment.  They asked for debt or US Dollars which the Fed is now destroying or removing from the financial system with their monetary policy.", "score": 5, "replies": [{"body": "I do not agree. Although there is some money that vanishes, there is also a dude that bought PYPL at $100, sold at $300, cashed 66k and bought whatever he could at the time taking inflation into account.", "score": 1, "replies": []}]}, {"body": "I have no idea in general, but I just bought a big CD with Marcus(Goldman Sachs bank) for ten months at 1.1%. I know I'll lose money relative to inflation, but I'm near retirement so I need safe instead of gains.", "score": 2, "replies": [{"body": "I'm guessing you've already maxed out the 10k you can put in I bonds?", "score": 2, "replies": [{"body": "I certainly did last year and on Jan 1 this year.", "score": 2, "replies": [{"body": "Cool beans, enjoy your retirement!", "score": 2, "replies": []}]}]}]}, {"body": "The money doesn’t have to go anywhere. All these institutions need to do is Not Buy. Then the stock price just what is set by everyone else.", "score": 2, "replies": []}, {"body": "People have been selling since January. The party is over for this last run.\n\nThe issue is people are still using margin to buy stocks in dips then using any other liquidity to play options.\n\nThis creates the bear market rallies, bigger downtrends and continues to squeeze people out of the market. \n\nSo the money is going to brokers, loans, all cash. Then one day a bottom will happen and people will pile back in for it to rally... then just as fast BAM. Free fall.\n\nThe best part is that cash is used to pay for inflated prices of goods and services. So everyone ends up poorer except the people who sold in November, December and the beginning of January.", "score": 1, "replies": []}, {"body": "Look at dark pool data, it's not retail unless it's packages up by robin the hood through pfof", "score": 1, "replies": []}, {"body": "These guys are on very long time horizons so even with the market sell off, a lot of these positions are being sold for a massive profit. \n\nMoney is going into alternatives—real estate, private equity, private credit.", "score": 1, "replies": []}, {"body": "I was wondering the same thing!! I'm glad you asked, too bad there's no way to track it, like tagging a fish or a condor. I just hope it trickles down to people working for tips.", "score": 1, "replies": []}, {"body": "You can find institutional investor ownership at an individual company level online. The nasdaq website shows the largest institutional shareholder of apple being Vanguard.", "score": 1, "replies": [{"body": "The thing is that most of that money is actually ETF money so it can be retail money not institution money.  Vanguard and Blackrock are top on almost everything because of things like IVV and VOO and others.", "score": 1, "replies": []}]}, {"body": "This is a mystery to me as well. *Everything* is down, including all the countercyclical assets like gold, crypto, bonds etc.\n\nThe only assets still going up are ETFs for commodities.", "score": 1, "replies": []}, {"body": "There wasn't any in the first place. You can sell to reduce your leverage and still have no cash to yourself because you need to pay back what you borrowed for margin.", "score": 1, "replies": [{"body": "I honestly think this is big part of it... everyone was borrowing because of 0 interest rates, and now they want to de-leverage because of both inflation and increase in fed rates.", "score": 1, "replies": []}]}, {"body": "What Rough\\_Opportunity\\_30 said. A lot of leverage is just going back to the creditors. \n\nBut also, lots of money will go into bonds and lots of money wasn't there in the first place. Paper gains only.", "score": 1, "replies": []}, {"body": "90 percent of this is margin", "score": 1, "replies": []}]}
{"title": "Should I buy more AMD, or just an S&P index fund (for my Roth IRA)", "selftext": "Hello.\n\nI happen to have some extra cash now, and am looking to start putting money into my Roth IRA again. I currently have around 3.2ish shares of AMD, and another $1,400 in the S&P 500. Though I hope to someday leave America, that might not happen, so I plan to access this money in 40+ years when I retire.\n\nI like AMD. I'm a computer person, I like their graphics cards, and I think that the stock is discounted right now. During the previous little [growth spurt](https://finviz.com/quote.ashx?t=AMD&p=d&tas=0), it grew at a much faster rate than the greater market, and I feel that it certainly has the potential to continue outperforming. Granted, I am no Warren Buffet.\n\nSo, r/stocks, what's the smarter option? Should I be putting my eggs in the AMD basket? Or am I better off throwing more money into the market as a whole? Thank you in advance :)", "id": "ump5uw", "created_utc": 1652206879.0, "score": 17, "upvote_ratio": 0.72, "num_comments": 26, "comments": [{"body": "I love AMD. It's at a much better valuation now than six months ago. It's basically where it was in late 2020.\n\nIf I had to own a risky tech stock I'd go with that one. And I have.", "score": 14, "replies": [{"body": "Same. I went with Unity too at 60 bucks. But that was a mistake..", "score": 6, "replies": []}]}, {"body": "What’s your timeline? Do you need this money anytime soon?\n\nI don’t like the idea of dumping everything in AMD, just AMD, but why don’t you choose say… 4-5 names, your highest conviction biggest names, and spread amongst them?\n\nFor me, I’d stay away from meta and Netflix, but taking that money and spreading it relatively equally amongst Google Msft amazon AMD (and or NVDA), and if apple falls to $140s, add them …\n\nI’m younger so I don’t need to see immediate returns, and for that reason I don’t buy broad indexes", "score": 11, "replies": [{"body": "Long term. Minimum of 10 years. I'm not sure what would happen if I were to, say, move to Germany while still having money in an account here, that's a question for a different subreddit.\n\nI don't have everything in AMD, currently it's around \\~$320 in that and \\~$1400 in the S&P 500", "score": 2, "replies": [{"body": "For my money, on a 10 year timeline, money you don’t need and won’t have any necessity to withdraw out of the market, then I would rather buy individual names than an ETF\n\nBut I just got shat on for saying the same thing in a similar post on r/investing… \n\nThere’s always a subset of the population that believes investing in individual names is inherently risky and that you “can’t beat the market” so you may as well just buy the SPY and stfu.\n\nI don’t subscribe to that theory, but wtf do I know. \n\nAll I know is, I made a boatload at the bottom of the market in Spring 2020, and all I did was buy Google apple msft and some high dividend REITs (as well as some airlines but I don’t suggest that).\n\nPoint is, if you bought SPY in spring 2020, you’d make probably 50% return if you held it up to or past the new ATH. You’d have made 200-300% if you’d taken that same money and just bought Google apple Msft Amazon \n\nFor me, I don’t see a plausible scenario where the spy rebounds to at or near ATH, call it a 15% gain from here, where you wouldn’t have necessarily also seen at the minimum 25%+ in Amazon Google msft etc.\n\nUnless we enter a new era where the 5 biggest companies in the world by market cap somehow are irrelevant in the future, or have a downturning future, whilst somehow the market goes up… you’re gonna make more money in individual names.\n\nI said it once and I’ll say it again: buying broad indexes is a warm blanket to make you feel better. \n\nAnd I’m not against all etfs. You want semi exposure? Ok get an etf. Rare earth metals? Etf. Renewables? Etf.\n\nBut just the whole market? I mean… ok I guess but that’s incredibly risk averse for someone younger in age who doesn’t need that money anytime soon.\n\nJust my 2 cents", "score": 0, "replies": [{"body": "I certainly subscribe to the theory of \"index funds or bust\", the data just doesn't lie. But you're right, we don't live in the 1970's anymore, money is fake and liberty is a lie.", "score": 2, "replies": [{"body": "What data? \n\nI mean… I just gave you data, go look at those charts.\n\nI mean, obviously I get it if you’re gonna dump your life savings and delete the app forever and check back in 49 years, ok maybe just go with an etf. I guess.\n\nAnd as far as the fed, ya I mean … we’re never gonna see the interests rates if the 70s or 80s.\n\nSo, any data or assumptions as to what the market will or should do, which rests upon a pre-QE environment… just dunno how applicable that is…\n\nAnd I would go do far as to say, why should it? \n\nThe biggest company in the world in the 1970s were auto manufacturers. US Steel was no. 12\n\nhttps://money.cnn.com/magazines/fortune/fortune500_archive/full/1970/\n\nWe live in an age post information revolution, the biggest companies in the world don’t make things, the margins of the biggest companies in the world are absurd, they generate crazy cash flow, they’re apples to oranges comparisons to fuckin GM.\n\nAnd unless you think the internet in 50 years isn’t going to involve Microsoft or Google, eg, then… well, they seem fairly safe bets for me. \n\nI also think it doesn’t make sense to compare historic companies to current day:\n\nTake Amazon, or tesla, or Google, or any number of massive tech companies, they have expanded their business so far beyond what their core business once was, in turn allowing them gain greater market share, to generate more revenue and at better margins… that wasn’t happening in 1970, or 1950. \n\nCorporate theory has changed. \n\nAgain, unless you see the internet in some other way than I do, or unless you see some massive incoming anti trust regulation (I don’t), then it’s a no brainer to me. \n\nI just fundamentally see the historic comparison from what the market did 50 years ago today, devoid of context, in terms of corporate theory, in terms of federal anti trust regulation, in terms of fed policy.\n\nThere’s just very little to assume suddenly the fed is going to back track on 2 decades of (successful) QE, or that the USA is going to break up the biggest tech companies in the world, which just so happen to be American and are a great asset in terms of the American economy.\n\nBut again, what do I know…", "score": 1, "replies": [{"body": "Books [number one](https://www.amazon.com/Common-Sense-Mutual-Funds-Bogle-ebook/dp/B00338060K) and [two](https://www.amazon.com/Little-Book-Common-Sense-Investing/dp/B077VYLVGP)", "score": 1, "replies": [{"body": "TY", "score": 1, "replies": []}]}]}]}, {"body": "Amzn has fallen 38% while vti has fallen only 18%\n\nAlso you could be like me and invest in pypl and lose 66% of your portfolio (I have aapl and msft still doesn't help the pain on pypl)", "score": 1, "replies": [{"body": "Right, so if you think any index ETF is going to get back to ATH, I’d say it’s safe to assume that the 3-4 biggest names in that index are also going to have to recover substantially. If Amazon trades sideways, not likely to see substantial recovery in the indices.", "score": 3, "replies": []}]}]}]}]}, {"body": "Are you confident that AMD will be around in 40 years and making more money than they are today?", "score": 3, "replies": [{"body": "You realize you can sell stocks inside of a roth.", "score": 3, "replies": [{"body": "Obviously", "score": 1, "replies": []}]}, {"body": "I mean, for AMD specifically, yes, because they are one of a very small number of people who make computer chips, but you make a good point.\n\nWhat's the logistics of selling one stock and then buying another within a Roth IRA?", "score": 2, "replies": []}]}, {"body": "AMD", "score": 2, "replies": [{"body": "AMD is a best growth semi stock. AVGO is best value semi stock. I think AVGO outperformed most of Semi stocks in 2022.", "score": 2, "replies": []}]}, {"body": "Let market go down more nasdaq buy sqqq", "score": 0, "replies": []}, {"body": "Neither. Wait. I sold out of a ton of SPY $385 today because we are about to hit a death cross and go way under that. My average on AMD is $33 and I’ll look to buy more around $40-50. You’re trying to catch a falling knife right now.", "score": -1, "replies": [{"body": "I just found this post but I’m curious. Did you ever buy back in?", "score": 1, "replies": []}]}, {"body": "Buy SIMO stock.. it was bought for 113 and it is currently trading at 92.. Easy, safe, certain 20% return in a year", "score": 0, "replies": []}, {"body": "SOXL >", "score": 1, "replies": [{"body": "Not until the market stabilizes. That thing is taking 10% average daily swings with a big bias to the downside.", "score": 2, "replies": []}]}, {"body": "Just curious why AMD over Nvidia?", "score": 1, "replies": [{"body": "[I like the stock](https://en.wikisource.org/wiki/I_Like_the_Stock)\n\nYes, Nvidia generally has better GPUs and has some exciting ML stuff, but AMD is catching up with the ML and more importantly, they are rapidly gaining market share in the server space. Only with Intel's latest generation of chips can they compete in a price/performance aspect, and they're still stuck on 14nm while AMD is refining their 7nm for Zen3+ (and of course going smaller moving forward).\n\nI've been a fan of AMD as a company since Zen+ (Ryzen 2000 series). I think they will continue to hold value as a company, and they have ample opportunity for growth as they have virtually no debt (no long term debt, very little short-term debt)", "score": 5, "replies": [{"body": "\n>AMD is catching up with the ML\n\n...", "score": 1, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "umu190", "created_utc": 1652220167.0, "score": 6, "upvote_ratio": 0.61, "num_comments": 25, "comments": [{"body": "I owned a Palm Pilot. There’s no guarantee that any company lasts. Many variables that need to come to fruition for an individual company to succeed. That’s why I invest most of my assets in S&P 500 index funds. Even Apple was given up for dead until the introduction of the iPod.", "score": 11, "replies": [{"body": "I didn’t own a Palm Pilot but I owned a Handspring back in the day.  I felt like a badass when I gave a presentation in college then took notes/feedback from the class by jotting it down in my Handspring device.", "score": 3, "replies": []}, {"body": "Yeah nobody can choose winners consistently it’s impossible…best way to go is just S&P 500. Is that enough NASDAQ exposure for you or do you invest separately in that?", "score": 1, "replies": [{"body": "I primarily invest 80% of my assets in the S&P and 20% in individual stocks, mostly technology stocks. With the current sell off, I would’ve been better off investing the 20% in QQQ.", "score": 6, "replies": [{"body": "I’m about 80/20 myself, just started doing that in 2019. Prior it was around 95-5. Comfortable riding out my paper losses for a couple years (down 50%+ on TDOC and SPCE, but those are a small portion of the 20% fortunately).", "score": 1, "replies": []}]}]}]}, {"body": "I'd say the same about Apple but if they keep making competitive products a cult can keep going and going.\n\nPalm was on the money with the Palm Pilot. It's just a handheld computer like an mobile phone or tablet. The cult for that type of device was warranted.", "score": 7, "replies": []}, {"body": "When the GME cult falls, you know the market has bottomed", "score": 3, "replies": [{"body": "How the hell did I forget GME/AMC…good call.", "score": 1, "replies": []}]}, {"body": "You missed by far the largest cult out there….the index fund cult.  Index funds are like a car without brakes going up a mountain.  Everyone is a happy rider until the car starts going downhill.", "score": 5, "replies": [{"body": "that cult is mind bogleing", "score": 12, "replies": [{"body": "Awesome 😊", "score": 1, "replies": []}]}, {"body": "\"Everyone is a happy rider until the car starts going downhill.\"\n\nHow is that any different than anyone with an investment in any company? Seems like you just described every investment and, quite frankly, anything that ever happens to anyone in life.", "score": 3, "replies": []}, {"body": "It's not like that at all.", "score": 1, "replies": []}, {"body": "This is nearly everyone BUT passive indexers. The S&P is only down 4% from a year ago.", "score": 1, "replies": []}]}, {"body": "Tesla is far from a cult, though. If you pay attention to their financials, you will realize how lucrative the business can and will be. What Tesla has going for them is every modern government is fully or largely invested in the EV movement. That's undeniable and is driven by China as well. Take Elon out and forget about him. Take a look at their financials and projectory. If that doesn't interest you, then by all means, keep regurgitating the 'cult' nonsense.", "score": -3, "replies": [{"body": "Wuling make a similar number of EV cars per year and have strong backing from the Chinese government. They get have a PE ratio of 11 on the same fundementals as Tesla so you should buy them right?\n\nMy point is that - a lot of companies have the same thesis you just said, and arguably have more experience at manufacturing or self driving AI or batteries or whatever. Telsa is a great company that will do very well but that doesn't mean the P/E ratio is investable. To justify the price it needs to dominate, and there is no reason to believe it is going to do that.\n\nTesla needs to come down at least 80% to be at fair value, but for those of us not in the stock, imagine what the market is going to look like while that's happening.", "score": 5, "replies": [{"body": "The fact that you are comparing what is essentially a $5,000 car to Tesla vehicles shows how little you actually know. I don't really care to get into specifics. Would just be me spending my time educating someone who doesn't know the first bit of the EV industry or the business Tesla is involved in who BTW, is currently the only profitable EV manufacturer operating in mass EV sales.\n\n&#x200B;\n\n\"needs to come down to at least 80% to be FV.\"\n\nAnd this is based on what? The fact that you are....? Which investments have you made can you show me to prove you are the least bit reputable?", "score": 0, "replies": [{"body": "\"needs to come down to at least 80% to be FV.\"\n\nIt's based on what it would take to match the forward P/E of Tesla to the rest of the NASDAQ.  You can do the math yourself or pay someone \"reputable\" to do it.\n\nThe claim that Tesla is the only company making a profit on EVs is just silly. Most other major car manufacturers are making EVs at large scale now and turning a profit on them.\n\nI don't want to have a personal argument about this. You do what you want with your money. Many people advise against emotional investing. If you agree with them maybe take a look at your posts.", "score": 3, "replies": [{"body": "So you're comparing the P/E of the broader market, including energy companies which historically have lower P/E's, to a company that is vastly growing in one of the most lucrative industries with many modern and advanced economies all encouraging EV production and sales target? That doesn't even register.\n\nName the major car manufacturers producing mass EV's turning a profit. I'll wait....\n\n\"Emotional investing.\" Been investing in Tesla since early 10's. Heard every concern people like you have had and continue to have.\n\nJust read your analysis. If I told you to present to me why Tesla is 80% above FV and all you did was recite this nonsense, you'd be laughed out of the room. Your analysis is pure gibberish.\n\nJust like mentioning WULING-GM vehicles saying they have similar financials to Tesla and 'sell' just as many vehicles when their vehicle margins are incredibly low and the real reason they only sell it is to qualify for carbon credits to offset their ICE sales. Do some research on the industry and then get back to me. I'll be waiting for the major car manufacturers making EV's at a mass scale turning a profit on them in the meantime.", "score": 3, "replies": [{"body": "Time will tell, best of luck", "score": 1, "replies": []}]}]}]}]}]}, {"body": "How could you not mention Reddit cult?", "score": 1, "replies": []}, {"body": "Dot com has some obvious similarities. If you had gone along with just all the hype companies, not checked their stock comp, debt, and do they actually make money…you’d have lost big time. If you could filter through the dot com companies and require decent valuations, and low or negative dilution you’d have done fine. Many if not all stocks that are down 75% today have huge stock comp and make no money…never ever invest in that regardless of what excuse is made for it.", "score": 1, "replies": [{"body": "Makes me think of PLTR, SOFI, etc. I’m just waiting for GOOGL @ $2,000 to open a position.", "score": 1, "replies": []}]}, {"body": ">Remember 3com/Palm Pilot? Probably not. They’re defunct now, but had a huge cult following in the 90s and were believed to be the future. The dot com bubble really shaked things out.\n\n>What makes Tesla (Elon cult), Coinbase (corn cult) or ARKK favorites (Cathie cult) any different than all these companies with crazy followings that are no longer around?\n\n>Why should Tesla be trading at such a valuation that makes Google look like a value stock?\n\n>Want to know what your thoughts are on this. Most investors here have only experienced the last 12 years of euphoria and the fed being very generous.\n\nWas Tesla just a cult? Or did they make about $22B in earnings in 2023?\n\n!RemindMe 2 years", "score": 1, "replies": [{"body": "I will be messaging you in 2 years on [**2024-05-12 01:15:45 UTC**](http://www.wolframalpha.com/input/?i=2024-05-12%2001:15:45%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/umu190/are_we_going_to_witness_the_shakeout_of_cults/i89f3vw/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fumu190%2Fare_we_going_to_witness_the_shakeout_of_cults%2Fi89f3vw%2F%5D%0A%0ARemindMe%21%202024-05-12%2001%3A15%3A45%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20umu190)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}
{"title": "SOFI down bad after earnings, but is the 80% crash a huge overreaction?", "selftext": "SOFI fell 12% today after a leaked earnings report which showed slightly better-than-expected top and bottom lines, but slightly worse-than-expected guidance. It's now down 79% from its ATH and is trading at a 1.35 price/book ratio - meaning that for every share you own, you almost own the equivalent value in assets as opposed to only betting on projected future cash flows. That's not unusual for a big bank's stock, as loan assets only generate a few cents on the dollar. For reference, JPM is currently trading at 1.41 P/B, and TD bank is trading at 1.73. There's a huge disconnect here, as SOFI is a young, high-growth company which could justify much higher multiples. \n\nMany of the concerns related to student loans are, IMO, just \"seeing ghosts\" - Biden's plan for student loan forgiveness would not take away any existing loans from SOFI, as they have been refinanced as private loans, and the gov can only forgive federal loans. While this *could* decrease TAM for SOFI, it also allows more breathing room for people with >10k in student debt, reducing their risk of default and making them more attractive customers for SOFI. Furthermore, while the student loan moratorium has stunted SOFI's growth in taking on new loans, this will not last forever, and we can expect SOFI's already high revenue growth rate to explode. \n\nI'm quite bullish on SOFI during this crash, so I'm wondering about your opinions on the bear case, or just your thoughts in general. It's been quite quiet regarding this stock lately.", "id": "umvb0j", "created_utc": 1652223680.0, "score": 19, "upvote_ratio": 0.81, "num_comments": 30, "comments": [{"body": "Recommend you read Uber CEO's recent email to employees.\n\nEverything you said is true, but the problem is that the current market values cashflow, which is something SOFI doesn't have.\n\nThey would be doing well if the market is back to valuing growth again.", "score": 15, "replies": []}, {"body": "No rush.  If the company has a worthy product we'll know in a year or so.", "score": 9, "replies": []}, {"body": "Didn't it fell before earnings were released?", "score": 5, "replies": [{"body": "It fell because of UPST. Then rebounded from high $4 back into $5 territory after people realized that SOFIs' ER was actually good. Drop had nothing to do with ER. Picked up 100 shares during that whole mess and hoping CPI is good tomorrow. For all of our sakes.", "score": 5, "replies": [{"body": "Kk yeah its what I thought too. Wasnt following closely but I thought its rebounded because of ER.", "score": 1, "replies": [{"body": "Your suspicion is correct. I was in the live chat on the r/sofistock sub when it all happened. Everything was insane. Weak hands got scared and capitulated thinking something catastrophic happened. The rest of us dropped our average prices down an insane amount.", "score": 1, "replies": [{"body": "Yeah its reallt wasnt a bad earning at all especially considering how low sofi is since its last earning.", "score": 2, "replies": []}]}]}]}]}, {"body": "It is even though I'm pretty aggressive I'm a little afraid to buy more of it.", "score": 3, "replies": [{"body": "emotion doesn't have a place in investing, except as a gut-feeling guide to areas you should dig deeper into. if you're afraid to buy more, why? you're right that the market can stay irrational for a long time, but if you have the patience to slowly enter your positions, such irrationality presents a tremendous opportunity", "score": -1, "replies": [{"body": "But mean reversion is a thing. It works more often than not.", "score": 1, "replies": []}]}]}, {"body": "My biggest problem with SoFi is that the app's UI is horrible. I got it to churn some of the bonuses but after that I was gone. I still use the 2% credit card but there's no way I'd use any of their other products/services.", "score": 9, "replies": [{"body": "What bank/lender has a good UI in your opinion? I am looking around now and Sofi’s 1.25% APY offer is above other industry peers.", "score": 2, "replies": [{"body": "UI is user interface. Not the rates they’re offering.", "score": 2, "replies": [{"body": "Right, I know. Which ones have the best user interface? My banks app I use now is embarrassing for top 20 bank. Its so bad. Sofi is much better relatively speaking.", "score": 4, "replies": [{"body": "personally love BoA online/app interface. Which is the only reason I haven't switched banks in the last couple years.", "score": 1, "replies": []}, {"body": "navy federal credit union app is great", "score": 1, "replies": []}]}]}, {"body": "USAA works well and is user friendly. Everything else they do is hot garbage though", "score": 1, "replies": []}]}, {"body": "Agreed. And for that, I’m out.", "score": 3, "replies": []}, {"body": "seems like a temporary headwind - they pay so many developers it shouldn't take particularly long to figure it out. the potential bearish implication here is whether or not middle/upper management is involved and savvy enough to identify this problem", "score": -1, "replies": [{"body": "Especially considering they’re going after the young demographic, you gotta have a good mobile app. Merrill Lynch or whatever boomers have can probably get by with some shit app but when you’re trying to attract 16-30 year olds you gotta have a good UI.", "score": 3, "replies": []}]}]}, {"body": "yes. Upst is down 60% just today. Id say that was a massacre and an extreme reaction.", "score": 3, "replies": []}, {"body": "Anyone holding UPST is asking themselves the same question. Without getting into any basics or deep dives, just know that plenty of people are feeling pain. This isn’t unique", "score": 4, "replies": []}, {"body": "would you loan a guy money who has just been stabbed repeatedly and is bleeding all over? \n\nthat's what your doing when buying big losers, best case scenario you get your money back", "score": 0, "replies": []}, {"body": "There’s nothing to be bullish about", "score": -3, "replies": []}, {"body": "It’s a pump n dump", "score": -3, "replies": []}, {"body": "Bigger issue with sofi is the stupid liberal govt that keeps promising to forgive student debt and further exasperate inflation.  The memorandums for suspending student loan payments till aug hurt its cashflow. \n\nThis is a hold till that stupidity is over", "score": -1, "replies": [{"body": "The government can forgive all it wants of fed, but I don't think they can touch the the private loan I owe to SoFi unless they literally hand SoFi the money on my behalf. And I don't expect that will happen.", "score": 2, "replies": []}]}, {"body": "the market is punishing all loan providers because defaults are about to go thru the roof and sofi is mostly giving out uncollateralize loans", "score": 1, "replies": []}, {"body": "Higher interest rate, a worse economy outlook. Those affect attractiveness of loan a lot. And less loan = less growth.", "score": 1, "replies": []}]}
{"title": "Apple patents an automated EV charging station", "selftext": "", "id": "umqbd8", "created_utc": 1652210087.0, "score": 39, "upvote_ratio": 0.95, "num_comments": 27, "comments": [{"body": "Seems like driving into the plug could be problematic, but if I guess if my roomba can do it than so can I.", "score": 19, "replies": [{"body": "My $1000 s9 still sometimes misses the contacts completely so I don’t have confidence in this lol", "score": 6, "replies": []}]}, {"body": "This is the competition?", "score": 6, "replies": []}, {"body": "Roomba has been doing this for more than a decade. How can they patent this kind of simple ideas is beyond me.", "score": 15, "replies": [{"body": "Different application, vacuum vs automobile.", "score": 8, "replies": [{"body": "Then Roomba patent lawyer didn't write it well to cover every type of applications.", "score": 11, "replies": [{"body": "Not gonna go over it but they likely did. Apple tends to steal ideas and IP, good luck fighting them.", "score": 1, "replies": [{"body": "Agreed.", "score": 1, "replies": []}, {"body": "There may be a few other trillion dollar companies keen to fight them. Not just Tesla, Google might fancy some automated charging stations for their robotaxis.", "score": 1, "replies": []}]}]}]}]}, {"body": "Might be a long long wait for apple to bring out that product.\n\nI am still waiting for tesla’s version\n\n[tesla prototype.](https://youtu.be/uMM0lRfX6YI)", "score": 3, "replies": [{"body": "That was quick.", "score": 1, "replies": []}, {"body": "Don’t drop your pants in front of it", "score": 1, "replies": []}]}, {"body": "Apple will name it ‘Lightening EV Connector’", "score": 3, "replies": [{"body": "$6,999", "score": 2, "replies": [{"body": "7K is very reasonable for an automated wall charger.", "score": 1, "replies": []}]}]}, {"body": "automated charging is the least important problem of self driving. As if having one employee charging 200 cars per day is expensive?", "score": 3, "replies": []}, {"body": "I wonder what a car dongle will look like?", "score": 2, "replies": []}, {"body": "Much like everything else Apple designs. This is designed to break every 12 seconds so you have to buy a new one...", "score": -6, "replies": []}, {"body": "Seems like a 6 year old could have figured this out.  Why would you ever do this instead of wireless charging?   It definitely wouldn’t would for current cars as almost all have chargers on the side.", "score": -8, "replies": [{"body": "Instead of wireless charging? Because that’s incredibly inefficient….", "score": 7, "replies": [{"body": "Not at all true.   It’s nearly as efficient as a plug.  Big misconception.\n\n2016 90% efficient\nhttps://eandt.theiet.org/content/articles/2016/04/electric-vehicle-wireless-charging-hits-90-per-cent-efficiency/\n\n2022 95% efficient \nhttps://www.greencars.com/post/wireless-charging-for-electric-cars", "score": -5, "replies": [{"body": "For a phone with complete contact on the mat...\n\nHow are to going to do that on a car with tires holding it several feet off the ground?\n\nAlso have you felt the heat these things generate? Scaling it up to vehicle size would probably melt the car", "score": 10, "replies": [{"body": "Not sure what you are arguing for.  I sent you links to back it up.  Are you just being stubborn for the sake of being stubborn?", "score": -2, "replies": [{"body": "Wasn’t really arguing… just posing some questions which neither of those articles answer lol. Also, those aren’t even scientific articles, so doesn’t necessarily prove the point other than a private company has claimed they hit this efficiency once and can do a press release to impress investors\n\nIt sounds like there are a few companies that have it as a one off r&d project, but are no where close to scale. It doesn’t look like these are near being ready for consumers", "score": 5, "replies": []}]}]}]}]}]}, {"body": "That low down I’d imagine it would be hard for anyone with a disability to connect any non Apple CCS unless they build it up higher.", "score": 1, "replies": [{"body": "You can have a second one higher up.", "score": 1, "replies": []}]}, {"body": "OK, can we agree that's the ugliest car ever? C'mon Apple!", "score": 1, "replies": []}]}
{"title": "Does TSLA really deserve more than half of the automotive industry value? Probably even put at this point, (now the P/E ratio is 97)", "selftext": "", "id": "um8t0t", "created_utc": 1652152137.0, "score": 6, "upvote_ratio": 0.72, "num_comments": 30, "comments": [{"body": "1. They have basically no debt. Ford and GM have literally a generation of profit worth of debt.\n\n2. The profit on their cars is over 30%. It's not about sales, it's about profit.\n\n3. In less than 8 years nearly every car will be an EV. Not just because of all the requirements for the end of ICE, but also because of the economics of it. No western car company has produced any EV at scale for a profit.\n\n4. FSD, if successful, will be worth more than all car companies put together, by itself.\n\n5. If TeslaBot is successful, it's worth more than Apple.\n\n6. If robotaxi is successful, it has the ability to end Uber, Lyft, and every single taxi on Earth.\n\n7. If Tesla Semi is successful, it has the ability to replace all semis and semi drivers on Earth.\n\nComparing Tesla to legacy auto is like complaining that Ford or GM was worth more than all horse breeders put together.", "score": 21, "replies": [{"body": "Good pipe dreams", "score": 0, "replies": [{"body": "So, 1 and 2 are factually true.\n\n3 is law is most of the developed world.\n\n4-7 might be pipe dreams, but 4 is on the road now, which makes 6 and 7 almost inevitable.\n\nBut, hey, keep investing in Ford, GM and Toyota. See if you can get to zero.", "score": 2, "replies": [{"body": "Keep holding tsla and buy every dip and good luck to you", "score": 1, "replies": [{"body": "Currently up 1653%, after this last dip.", "score": 2, "replies": [{"body": "Hope you go to 16000 soon", "score": 1, "replies": [{"body": "Me too, friend.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Now I get it, you compare Tesla with American losers, I drove an EV from Mercedes yesterday, that's when you understand that competition is coming (and low cost Asians are  not that bad either).\n\nAnd, BTW, gross margin of 30% is more average than one might think.", "score": 0, "replies": [{"body": "Cite me all the car companies making 30% on their EVs.", "score": 1, "replies": [{"body": "Any automotive company with net profit of 10% on turnover after tax will have a gross margin of 30-50%.", "score": 0, "replies": [{"body": "Again: Show me all the companies making 30% on EVs.", "score": 1, "replies": [{"body": "They don’t give data on individual models, but for company value it’s the bottom line that counts.", "score": 1, "replies": [{"body": "Again: show me any company making 30% on EVs. None are except Tesla. Every other company loses billions on EVs. They aren't capable of making money on EVs. They lose money. They are going to go bankrupt because they don't have the ability to make money on the only product that will sell.\n\nHow is Compaq doing? What about Circuit City? How about Barnes and Noble? Or Kodak?\n\nJust because you're in an industry doesn't mean you can pivot. Not a single legacy car company has shown they can pivot to EVs and make money.", "score": 1, "replies": [{"body": "It’s actually the other way around, EV is extremely profitable when looking at gross margin, this is why Tesla can exist.", "score": 1, "replies": [{"body": "But not a single other car company is making a profit on EV because they've got no factories and no battery supply.\n\nGM, Ford, VW, Nissan all lose money on their EV divisions.", "score": 2, "replies": [{"body": "Interesting, do you really have a BOM and assembly cost on a VW product, if so please share with this forum", "score": 1, "replies": [{"body": "https://www.reuters.com/business/autos-transportation/volkswagens-ev-business-profitable-combustion-engines-sooner-than-planned-ceo-2022-05-12/", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Considering Tesla is one of the few (if not only) automotive companies/company that does not use the dealership model, does not bend over for unions, is spending much more on the development of FSD, and much more, I’d say it deserves more than half of the automotive industry value.\n\nNow the real question is: Is the value of the entire automotive industry deserved? That I wouldn’t be so sure of.", "score": 3, "replies": [{"body": "Well, FSD spending is a weird metric", "score": 2, "replies": []}]}, {"body": "No", "score": 2, "replies": []}, {"body": "This is the part where it starts it’s 50%decline haircut", "score": 2, "replies": []}, {"body": "If the robots actually work it's the most undervalued company of all time.", "score": 1, "replies": []}, {"body": "The short answer is yes. \n\nNo one in their right mind will want to buy an ICE car in 10 years (and anyone that owns a home and thinks about it for a minute right now wouldn't buy a new ICE either). Those companies are woefully far behind Tesla at making EVs; Tesla isn't the new kid, it's the established player in EV land. \n\nEveryone else is trying to make it afresh in the automotive world while also trying to spin down their ICE business. The Osborne effect will bankrupt a few of them when they cross the tipping point where they still have factories, workers, and inventory dedicated to creating cars no one wants to buy. They will have engineers designing V8 engines that don't know the first thing about reluctance motors that are getting paid engineer money to make 100 overpriced muscle cars or trucks.", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Unless fast charging is solved, evs are too much of a hassle for most people", "score": 1, "replies": [{"body": "I'm not sure what you mean. A model 3 is rated at 240Wh/mi and there are 250kW charging stations everywhere. That is, you add more than 1000mi/hr to your car while plugged in you can fully charge a LR M3 in 25 minutes. Since you can charge your car at home, you only ever wait on charging while on a road trip, so you can spend that time using the bathroom, buying a snack, stretching your legs, etc. as opposed to standing next your car pumping gas.\n\nEDIT: I have spent less time waiting on my M3 to charge than I did standing next to my old car pumping gas by orders of magnitude.", "score": 1, "replies": [{"body": "Not everyone has a garage", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}
{"title": "Tesla halts production again at Shanghai plant due to supply issues", "selftext": "Reuters is confirming that Giga Shanghai production has stopped. The factory has already closed for a total of 22 days this quarter and counting. \n\nWall Street is expecting sales to be flat this quarter, and with the largest factory idled, and Giga Texas delivering a few cars only to employees, a miss is all but guaranteed. \n\nSource: https://www.reuters.com/business/autos-transportation/exclusive-tesla-halts-production-shanghai-plant-due-supply-issues-sources-2022-05-10/\n\nHolding a single $750p", "id": "um8q2m", "created_utc": 1652151889.0, "score": 21, "upvote_ratio": 0.63, "num_comments": 24, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|14|**First Seen In WSB**|1 year ago\n**Total Comments**|4046|**Previous DD**|\n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=um8q2m)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=um8q2m)", "score": 1, "replies": []}, {"body": "Discovery in 2000, we'll have flying cars by 2020, and here we are looking for chips lol.", "score": 16, "replies": []}, {"body": "Wait, isn’t that tesla have no media team? How they can responding to their negative news this quick? Sounds guilty of something almost.", "score": 5, "replies": [{"body": "Tesla China has a PR team. I don’t know why, but they do. They’re probably required to.", "score": 2, "replies": []}]}, {"body": "You missed the part where Tesla China was asked and already confirmed this isn’t true.", "score": 22, "replies": [{"body": "[#Tesla responds to the suspension of Shanghai factories again#: No notice has been received for the time being] In this regard, Tesla China told Caijingxia that it has not received any notice of the suspension of Shanghai factories for the time being. Production has been in succession since the resumption of work on April 19, and it may be a little lagging behind in logistics.] translated from: https://baijiahao.baidu.com/s?id=1732404117649586196&wfr=spider&for=pc", "score": 9, "replies": [{"body": "I’m going to go with the Reuters report. It’s also what everyone will see on their Bloomberg terminal in the morning.", "score": -12, "replies": [{"body": "They’ll see the Bloomberg headline on their Bloomberg terminal that begins with:\n\nMarkets\n\nTesla Says China Plant Continues to Make Cars; No Halt Notice\nU.S. automaker received no notice of Shanghai production halt\nPlant shut for three weeks in April due to Covid lockdowns\n…\n\nBloomberg News\nMay 9, 2022, 10:03 PM EDT\nUpdated onMay 9, 2022, 11:12 PM EDT\nTesla Inc. hasn’t halted output at its Shanghai factory, though it is experiencing some disruption to logistics amid the city’s long-running Covid-19 lockdown, a spokesperson for the U.S. carmaker said Tuesday.\n\nReuters reported earlier that output had halted, prompting Tesla to issue a statement saying it had received no notice of any Shanghai plant cessation and pointing out that some vehicles are still being made. \n…", "score": 14, "replies": [{"body": "Do you trust Musk & Co. to tell you the truth, or do you trust Bloomberg. \n\nOr do you just say fuck it and walk away because deep down you know you're not getting a lick of real information from the lot.", "score": 0, "replies": []}]}]}]}]}, {"body": "So, puts on $TWTR as well, since Elon gon’ get a call from Marge?", "score": 5, "replies": [{"body": "You cant margin call the richest man..", "score": -1, "replies": [{"body": "Morgan Stanley says otherwise, n00b.", "score": 2, "replies": []}]}]}, {"body": "Not a supply issue. A communist issue.  They shut down the city for one covid positive.", "score": 1, "replies": []}, {"body": "The cars are aids for the environment. The internet skylink is their only chance. Puts", "score": 1, "replies": []}, {"body": "Posting bs news man! There’s no halt. It’s confirmed. Delete this crap for the sake of my calls lol", "score": 0, "replies": []}, {"body": "We all know next earnings the stock will skyrocket and they will probably outsell Toyota", "score": -3, "replies": [{"body": "Lmao out sell WHO !!!!\nTOYOTA !!! LOL\n\nYOU THINK DEVELOPING COUNTRIES IN AFRICA ASUA AND SOUTH AMERICA  GOING TO START BUYING TESLA INSTEAD OF TOYOTA HILUX OR LANDCRUISER !\nNOT GONNA HAPPEN.", "score": 3, "replies": [{"body": "Don’t know why your getting down voted but Toyota even gets free adverts from isis", "score": 6, "replies": [{"body": "isis on cybertrucks, that would be hilarious", "score": 3, "replies": []}, {"body": "Yea I remember that photo of long line of new landcruisers driven by isis fighters . Must have been saudi shiekhs funded", "score": 2, "replies": []}]}]}]}, {"body": "![img](emote|t5_2th52|4276)", "score": 0, "replies": []}, {"body": "bullish on zim and other shipping companies?", "score": 0, "replies": []}, {"body": "Running out of lithium already common ganfeng produce more lithium.", "score": 1, "replies": []}]}
{"title": "Shoving your portfolio into TWNK is a great way to ride out this 🌈🐻 market", "selftext": "It's official, SPY and QQQ are in a downtrend now that JPow has turned off the money printer. We are in the midst of an inflationary macroenvironment where equities and especially growth stocks in general are suffering, but consumer goods stocks continue to remain a good safe haven for your money. They're probably the best place to park cash in the current inflationary environment which has showed no signs of abating thus far.\n\nSo if you're worried about a recession, the Consumer Foods sector will never fail. People always need to eat, irrespective of market conditions, so these stocks will always be in demand. On the other hand, non-essentials and industries like tech and entertainment are more speculative and much more vulnerable to crashing during downturns.\n\nIn 2022, you get can safe, consistent gains and protection against inflation with CF stocks, even as the value of cash dwindles over time.\n\nHere's why in particular, I like TWNK\n\n### 1. The obvious reason.\n\nyou know\n\n### 2. Very strong financials\n\nHostess is a strongly profitable company. TWNK has been smashing revenue and earnings targets quarter after quarter with no signs of slowing down. From the latest investor presentation, they've had 9 Consecutive Quarters of 9%+ Net Revenue Growth.\n\nTake a look at growth in the revenue chart. At the very least I would say it is a hold for the next year or so, or until earnings/revenue growth begins to slow.\n\n&#x200B;\n\n[https:\\/\\/www.macrotrends.net\\/stocks\\/charts\\/TWNK\\/hostess-brands\\/revenue](https://preview.redd.it/hobsi6m9nky81.png?width=780&format=png&auto=webp&s=8243fa69637247431701b3652c4311c88afd5fb6)\n\nRight now the market cap is only 3 Billion, but I believe that will grow substantially once the market fully catches up to TWNK's true value based on its future growth plans. Which brings me to:\n\n### 3. Innovation and Expansion Plans\n\nBelieve it or not, Hostess out of all companies is legitimately an innovative and growing company. They're using all sorts of data science, AI, and advanced marketing techniques to figure out which channels are the best to target customers. In the past two quarters alone, these efforts have had over a 150% increase in ROI. I'll omit most of the details because if you've made it this far, I can trust you to also read the [2022 Hostess Brands Investor Day Presentation](https://www.hostessbrands.com/events-and-presentations/presentations) and learn more.\n\nAdditionally, Hostess is in acquisition mode, have purchased Cloverhill, Voortman, and multiple new bakeries in recent years (2018, 2019, 2020). Basically, they're breaking out of the Sweet Baked goods market ($7 Billion) that contains Twinkies/Ho Hos/Donettes etc and are targeting the cookie market ($8 Billion) as well as the Focused Snacking market ($50+ Billion). Kelloggs and Nabisco better watch out from behind because TWNK is going after Poptarts, Oreos, and Snickers too\n\n### 4. Technical analysis\n\nI'm not a believer in technical analysis voodoo, but what I will do is drop on your lap a chart of TWNK's gains compared to over investments you probably made (a meme stock, SPY, QQQ, and fake internet money)\n\n[TWNK is a gayner](https://preview.redd.it/8flnwv0enky81.png?width=816&format=png&auto=webp&s=7ba9db9be1c5d1f980a8d0f8d19e6f85f1fa0065)\n\nI think the charts speak for themselves here- in a 🌈🐻 market the TWNK always wins.\n\nSo if you're looking for a place to park some cash during a bear market, my recommendation is to put it deep inside TWNK.\n\n&#x200B;\n\n**Tl;dr** Lots of retards here are getting fucked hard in the ass by their trash stocks, and meanwhile I'm balls deep in TWNK and it's carrying my portfolio. A twinkie a day keeps the margin call away ;)\n\nPositions: reverse cowboy + 500 shares of TWNK", "id": "um9pbl", "created_utc": 1652155077.0, "score": 61, "upvote_ratio": 0.91, "num_comments": 27, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|4 months ago\n**Total Comments**|22|**Previous DD**|\n**Account Age**|4 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=um9pbl)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=um9pbl)", "score": 1, "replies": []}, {"body": "As long as there's white creamy stuff, I'm in.", "score": 28, "replies": [{"body": "Lots of white creamy stuff to go around", "score": 3, "replies": []}]}, {"body": "I seriously thought that was Grindr’s ticker name 😂", "score": 14, "replies": []}, {"body": "What I'm gathering from this DD is... you like the cock?", "score": 10, "replies": [{"body": "the stock too, but yeah", "score": 3, "replies": []}]}, {"body": "I was fresh out of a divorce & ended up working at a convenience store during the great recession. Nobody could afford to do any real crazy grocery shopping so they were buying the fuck outta TWNK on the regular to drown their sorrows & because it was cheap. Then when they went into Chapter 11 there was a run on their products by idiots thinking they'd be gone forever. Since they got bought out & reorganized they've been growing ever since. I think you've legit got a winner here.  \n\n\nTL;DR: When times are tough poor people who can't afford real groceries go to gas stations for snacks to drown their sorrows. Bet on TWNK & gas stations.", "score": 9, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}, {"body": "Is this the ticker for Grindr?", "score": 3, "replies": []}, {"body": "Cheap fuckin snacks for the win!!!", "score": 3, "replies": []}, {"body": "Wait.  This is a seriously good 👍 idea.  Twinkies.  Taste good and shelf life is like 30 years and still fresh.  Better than MRE's and nutrious if taken with a multivitamin chewable. Stock up now.  Ride out the food shortage to come.", "score": 3, "replies": []}, {"body": "Where lil Debbie at", "score": 5, "replies": []}, {"body": "TGT is where I’m sheltering. Best of luck.", "score": 2, "replies": []}, {"body": "Does this has Jim Cramer approval?", "score": 2, "replies": []}, {"body": "Opened my eyes. Great DD 👍", "score": 2, "replies": []}, {"body": "You sound like someone who's out of the money call options are getting ready to expire and you're in deep red praying praying to the twinkle God's.. if I wasn't down a shit ton of money plus trying to put in amazon and Google as much as I can on these down days since they're doing a 20-1 split so they're both going to be around $100 so I'm getting my hands on some now plus more for after they split Good Luck sir", "score": -1, "replies": []}, {"body": "That would involve selling at a loss to buy back on?.  Nah.  I’ll Jist ride it out.", "score": 1, "replies": []}, {"body": "you know whats safe heaven? cash", "score": 1, "replies": []}, {"body": "Bears luv TWNK…", "score": 1, "replies": []}, {"body": "Good breakdown, but you need more oil’s and natural gas exposure; can’t keep up with demand and dividends are huge", "score": 1, "replies": []}, {"body": "Kinda near 52 Week high rn and on a run for ATH that looks like it just recently peaked.\n\nDig the DD but the price isn't right for me yet.", "score": 1, "replies": []}, {"body": "Giddy up ![img](emote|t5_2th52|8881)", "score": 1, "replies": []}, {"body": "I was thinking lipton has some great new products", "score": 1, "replies": []}, {"body": "It's all because of this: https://www.reddit.com/r/wallstreetbets/comments/um0uyn/markets_and_now_its_a_hat/", "score": 1, "replies": []}, {"body": "I thought TWNK was the ticker for Grindr for a second", "score": 1, "replies": []}, {"body": "I'm in for 30c 1/20 and 4/21, I do have the contrariarian fweling like it's about to just switch directions now that I'm paying attention to it.", "score": 1, "replies": []}]}
{"title": "Boeing - A Bear Raid in the making", "selftext": "[removed]", "id": "umqgs8", "created_utc": 1652210504.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 26, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|12 seconds ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=umqgs8)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=umqgs8)", "score": 1, "replies": []}, {"body": "I bought low in 2020 and I’m eating it hard right now. I’ll buy again when it bottoms. It will rebound. I take a very long approach to buying and selling. I’ll keep it for years.", "score": 2, "replies": [{"body": "I think it will rebound too but in a much longer time frame than what management is currently peddling. Fortunately, Boeing has just too fundamentally good of a product to drive the company all the way into the ground like the money men did to SunEdison. Nobody mentions the fact that the same Vivint deal that was the \"straw that broke the camel's back\" on SunEdison would actually would have been a fairly attractive deal had it gone through. Sunrun picked up Vivint in 2020 for $3.2Billion....the SunEdison deal was at $2.2Billion in 2015. Interesting how that straw was positioned so negatively in the finance media to help drive a massive bear raid on SunEdison. What's really interesting though is how the Fail to Deliver chart was cleaned up for the first time in close to two years in the 8 weeks before the huge price slide in SunEdison (kind of like someone didn't want any fingerprints around). But that's a horse of a different color. Sent that chart to the SEC but of course no reply. I just feel that there is a \"Vivint\" event on the near term horizon for Boeing.", "score": 2, "replies": [{"body": "I look at it as there is Boeing and there is Airbus. There’s just no other competition   \n\nI own both. Boeing should never go the route of something like GE.", "score": 1, "replies": []}]}, {"body": "What was your investment thesis? “Airplane company that makes faulty business decisions to rush airplanes out the door untested so that they crash and kill people deserves my money?”", "score": -2, "replies": [{"body": "My investment thesis was that fundamentally Boeing is a good company. But like any reasonable long investor I do set sell stops on investments that I do not have the time or inclination to manage on a daily basis.  And yes, good companies with amazing people and good products fail all the time because they have crap leadership. Boeing has crap leadership in my opinion, unfortunately my due diligence did not account for just how bad they were.", "score": 1, "replies": []}, {"body": "\"Airplane company that is a national icon and defense contractor will get bailed out\" perhaps?", "score": 0, "replies": [{"body": "If I were to invest in an individual stock, I’d want to see that it’s the next Microsoft or Amazon. Not just something that’s going to at best track with the rest of the SP500.\n\nIs Boeing establishing a new market with minimal competition? What makes you think they could beat the index?", "score": 1, "replies": [{"body": "Nothing made me think they could beat the index over the long haul (10-20 years). I did expect that their return over the next two years would be much stronger than the index........it looks like it may take more like 3-5 years now......with this year looking particularly ugly.", "score": 1, "replies": []}, {"body": "I wouldn't buy them as a growth stock; I'd wait until they hit choppy waters, then buy calls on the speculation of a bailout.", "score": 1, "replies": [{"body": "I bought as a medium-term recovery stock.....guess I missed that boat", "score": 1, "replies": []}]}]}]}, {"body": "It was more like “this company will continue to make money no matter what some dipshit thinks”", "score": 1, "replies": [{"body": "Nope, but thanks for the comment. Hey wait, was I the dipsh\\*\\* in that retort ? If I was smarter I guess I would know.", "score": 1, "replies": [{"body": "I was not responding to you.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "My comment is that when executives report financials they are at times less than forthcoming in their statements. When a company pushes its overtime to hit sales numbers the cost shows up if you dig in the reported quarter, but the sales impact isn't seen until the next quarter when those sales that were pulled forward are missing from the next quarter. It's not surprising to me that April production was a bit low given the probable big push to come in strong in the first quarter. The problem Boeing has is the cost to scale up will be higher than the cost savings it realized when scaling back. Scale back was with less FAA oversite (read that as cost) and scale up will be in the face of FAA oversite and the limits that you can push people to in regards to overtime. I suspect that in the coming months we will see more cost \"surprises\" in the form of margin erosion that are in fact not a surprise at all. Having worked for a very large company I have seen some of the shenanigans that leaders of large corporations employ on a rather unfortunate regular basis.", "score": 1, "replies": []}]}, {"body": "Boeing values money over safety. Fuck them. Watch the documentary on Netflix", "score": 1, "replies": [{"body": "Saw it. Boeing leadership is the issue.....only takes a handful of incompetent senior executives and a crappy board of directors to decimate a company.", "score": 2, "replies": []}]}, {"body": "Boeing is in a mess of their own making. They put profit over safety too many times and the atonement will continue to brutalize them. 737 Max was a nightmare, 787 recalls for incorrect panel fitment that uncovered huge QC fails, and the still nonworking money pit called Starliner are all killers. \nI no longer have a position in Boeing.", "score": 1, "replies": [{"body": "I agree. I would say though that Boeing is defined as all of the thousands of people there that work there the majority of whom work pretty damn hard every day. The few at the top (the ones with all the power to make decisions) set the culture and screwed the many.", "score": 2, "replies": []}]}, {"body": "Airplanes falling from the sky because the management wanted to cut corners is a red flag for any investor.", "score": 1, "replies": []}, {"body": "BA has the most incompetent managers in the business.  How do you fuck up a duopoly with only one main competitor that is run by 4 different governments in Airbus?\n\nThey sat on their ass with their duopoly and now reap the consequences.  Instead of reinvesting into the business; they used the FCF to bouy up their stock during the good times.\n\nYeah, no way Boeing will go under but it’s dead money for the foreseeable future.  Same as other once large players like intel, IBM, GE, etc", "score": 1, "replies": []}, {"body": "Remains to be seen, goodluck OP", "score": 1, "replies": []}, {"body": "I think Boeing is slowly going towards the \"straight trash\" category. They are simply not focusing on products, instead focusing on maximum short term profit. It is not the same company it once was. It's holding steady for now because no real other competitors in the market but I am not hopeful long term. If not for the government contracts and duopoly products, Boeing is like Sears.", "score": 1, "replies": []}, {"body": "I am a bot. This Discussion does not look like it has generated enough approval to stay on /r/wallstreetbets.                                            We algorithmically cull certain submission flairs whose response is not above a certain threshold to try and keep the page clean.", "score": 1, "replies": [{"body": "Thanks bot.....you are particularly brilliant.", "score": 1, "replies": []}]}]}
