{"title": "Chipotle stock tumbles after New York City sues the restaurant chain, alleging labor law violations", "selftext": "https://www.cnbc.com/2019/09/10/chipotle-stock-tumbles-after-new-york-city-sues-for-violating-labor-law.html\n\nNew York City Mayor Bill de Blasio's administration is suing Chipotle Mexican Grill, alleging violations of the city's Fair Workweek Law.\n\nMore than 30 employees from five different Brooklyn locations of Chipotle filed complaints with the Department of Consumer and Worker Protection.\n\nThe department is seeking at least $1 million in restitution for workers plus civil penalties and future compliance with the requirements of the law.", "id": "d2a9dp", "created_utc": 1568133621.0, "score": 472, "upvote_ratio": 0.97, "num_comments": 68, "comments": [{"body": "Losing a billion in market cap over reports of a million in fines really looks like panic selling creating an opportunity to buy on the dip.", "score": 211, "replies": [{"body": "This could be the tip of the iceberg if more places file suit.\n\nI worked at a Chipotle in NC like 2 or 3 years ago and the conditions were exactly the same as what these workers are alleging. I think everyone just knows Chipotle cuts corners with paying their employees what they are owed and it'll come back to bite them if more places file suit.", "score": 65, "replies": [{"body": "Is this a thing for all Chipotles or just in the north?", "score": 5, "replies": [{"body": "Well North Carolina is the South. I'd wager the problem is root deep at this point \n\nBut y'know anecdotal evidence and all that.", "score": 4, "replies": []}]}, {"body": "Not really. This will get settled nationwide for a tiny fraction of what they saved by cheating their employees.  NYC and some other left leaning cities and states might charge them a bit more than a tiny fraction but it will still be a fraction. None of the three branches of government in this country has a problem with such practices.  \n\nAlso a 6% move is not unusual for this stock.", "score": 15, "replies": []}, {"body": ">iceberg\n\nDid someone say my name? And yes, the lettuce will give you the shits.", "score": 1, "replies": []}]}, {"body": "The stock is up over 80% this year and trades at a P/E over 88. Sure sounds like an undervalued opportunity.", "score": 23, "replies": [{"body": "I remember considering a buy at 390 after the health scares :/", "score": 8, "replies": []}, {"body": "P/E is irrelevent with this stock because they own all their own restaurants, and therefore eat a lot of depreciation (a non-cash expense)\n\nIt's like a REIT that sells burritos.", "score": 7, "replies": [{"body": "You got a source for that? I highly doubt they own any of their Manhattan locations.", "score": 3, "replies": [{"body": "No source, because it isn’t true.  I’m a real estate appraiser and I don’t know any locations they do own, and that’s in Indiana, where they are usually stand-alone or other small buildings.  It certainly isn’t true in Chicago or Manhattan.", "score": 1, "replies": [{"body": "Maybe he meant that they aren’t franchises? Only thing I could understand more what his point was.", "score": 1, "replies": []}, {"body": "They mostly lease, but you depreciate capital leases. So my point is the same. I was trying too keep my above explanation simple.", "score": 1, "replies": []}]}, {"body": "No they mostly lease, but it's a capital lease, which you depreciate. Was trying to keep my explanation simple.", "score": 1, "replies": [{"body": "how does it make any difference?", "score": 1, "replies": [{"body": "Because they eat a shitload of depreciation, it makes net income an inaccurate representation of their financial situation. Dont value them on p/e, but on fcf", "score": 1, "replies": []}]}]}]}]}, {"body": "Take your logic somewhere else.", "score": 2, "replies": []}]}, {"body": "yea,.....but wasn't it like $350  earlier this year? it's more than doubled.", "score": 3, "replies": []}, {"body": "Dip? Did you see the 1y and 5y charts?", "score": 6, "replies": []}, {"body": "Yeah this looks like a chance to buy the dip. \n\nBut I don’t get Chipotle’s deal. No idea why their price is what it is, I just know I eat there sometimes.", "score": 5, "replies": [{"body": "Same but I sold a few weeks ago, made a heafty profit on it too", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "NYC \"anti business\" ...this is NYC you're talking about..", "score": 0, "replies": [{"body": "Have you seen the new administration??", "score": 1, "replies": []}]}]}]}, {"body": "Fuck my portfolio", "score": 64, "replies": [{"body": "Just buy more? What’s the problem?   Asking for 1 million from a multi billion dollar organization? Lol.\n\nPlus the regulations aren’t going to hamper them, and might actually prevent a problem that reduces the stocks price in the future.", "score": 43, "replies": []}, {"body": "You’re still up as long as you bought before the end of July. I feel like it’s just a hick-up. It’s not e-coli bad.", "score": 14, "replies": [{"body": "Let's hope so 🙏", "score": 3, "replies": []}]}, {"body": "Is your portofolio 18+ and consenting?", "score": 2, "replies": []}]}, {"body": "I always love these lawsuits. Blue state/city sues [insert big publicly traded company] for [insert grievance], a settlement of millions is inevitably arrived at, and those that were actually hurt receive “aid” and not cash.  Just like it was with the housing crisis.  Wonder where all those billions big banks were forced to pay went?  That’s an interesting research topic for those willing to go down the rabbit hole.", "score": 11, "replies": []}, {"body": "I Quickly go to RH to get some chipotle stock “cheap” and realize I’m ten years from being able to afford to buy a significant amount of it.", "score": 21, "replies": [{"body": "Let me introduce you to my friend r/options", "score": 18, "replies": [{"body": "And allow *me* to introduce you to /r/bankruptcy", "score": 35, "replies": []}, {"body": "Can you provide a basic example of how one can use options in this specific scenario?", "score": 6, "replies": [{"body": "First of all  DO NOT BUY OPTIONS before you do some research yourself.  \n\n\nA chipotle stock costs 784 and to make significant money you would need a lot more than 2 buy a single stock or the price needs to go up a loooot higher.  \n\n\nBut you can buy a call with 400 buy 2 of them. And if the price does go up by even 3% you are looking at a 150% return.   \n\n\nBTW That was a very simplified answer", "score": 11, "replies": [{"body": "Don’t do options it’s gambling", "score": 13, "replies": [{"body": "Idk I've seen some pretty successful bankruptcies on wsb", "score": 5, "replies": []}, {"body": "All stock trading is gambling unless you buy a controlling share.", "score": 2, "replies": []}]}]}]}]}, {"body": "Share price is irrelevant. If you buy 1 share at $780, or 10 shares at $78, if it goes up by 10% you've made the same amount of money. Assuming you can afford at least a share lol.", "score": -1, "replies": []}]}, {"body": "They were almost on pace to double the stock just this year, this is a minor set back.", "score": 10, "replies": []}, {"body": "Ah yes. The annual Chipotle gets kicked in the nuts news. \n\nWonder how Under Armour is doing.", "score": 10, "replies": [{"body": "their last earnings kicked them in the nuts", "score": 4, "replies": []}]}, {"body": "How does chipotle has such high P/E at over 88 times even with the drop... it’s literally sells burritos. It’s almost worth as much as McDonald..\n\nEven Costco has a PE of mid 40s with the recent news in China", "score": 9, "replies": [{"body": "Because of depreciation. That's a non cash expense. Value it like a REIT.", "score": 0, "replies": [{"body": "Chipotle as REIT depreciation? Please elaborate...", "score": 2, "replies": [{"body": "They dont franchise their restaurant locations. So they either own or lease the property. This means they depreciate it. This is a non cash expense that has the effect of increasing the p/e. \n\nLook at a REIT like $O. Realty Income Corp. They have a P/E of about 57x. To the beginner's eye, that's a crazy multiple to pay for a company growing sales at single digits. But they depreciate because they're a REIT. \n\nAll this to say you should ignore p/e when valuing these stocks.", "score": 0, "replies": [{"body": "Thank you, appreciate the explanation.", "score": 1, "replies": []}]}]}]}]}, {"body": "Man New York be suing everybody.", "score": 11, "replies": []}, {"body": "The share price looks dumb overpriced. Am I retarded?", "score": 6, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "Let me introduce you to something called market cap. \n\nChipotle market cap: 21.85 Billion\n\nMicrosoft market cap: 1.04 TRILLION\n\nThis means that Microsoft is actually worth ~50x more than Chipotle.", "score": 10, "replies": []}, {"body": "I mean only the share price not the company.", "score": 5, "replies": []}, {"body": "white people, millenials, and Starbucks retards although I want a position in starbucks when the price is right", "score": -3, "replies": []}]}]}, {"body": "What had happened between 1 year ago and 5 years ago? I see stock was in 700+ range in 2015, then down the following years until 2019.", "score": 2, "replies": [{"body": "E. coli? I’m thinking lots of E. coli.", "score": 5, "replies": []}, {"body": "The chicken scare and food borne illness due to poor sanitary conditions.", "score": 3, "replies": []}]}, {"body": "Bet the workers who filed these complaints won’t see a single cent out of that million dollars, and will instead be given extremely reduced work hours and possibly fired instead. But at least the mayors office found a way to make their bucks off of it.", "score": 2, "replies": []}, {"body": "I worked at a Chipotle in North Carolina. I gotta say I am 100% NOT surprised about this and I hope Chipotle gets the book handed to them.\n\nIt seems to be corporate culture to just screw over your workers and wring them for every last minute you can.\n\nHere's an example of a shit for me. \n\nGet in at 5PM and we are supposed to work until 11PM or Midnight depending on how long it took to close. Well sometimes it would take HOURS to close the shop. We would be there until 2am cleaning the kitchen. Now normally this wasn't an issue since it was expected that we would receive some overtime for working the ridiculous hours. \n\nOur manager comes and tells us that not only are we not getting overtime but the machine we use to keep our time automatically \"clocks you out\" at midnight. \n\nNo one had told any of us this and we had been working for at least 3 weeks (this was a new location) \n\nSo I ask \"So how are we getting paid for working until 2am\" My manager said she would \"put it in herself\"\n\nI quit about 2 or 3 days after that. \n\nI don't know if the manager actually put the time in or not since I didn't go back to do the math on what was my final paycheck. Even if she had gone by and manually put in everyone's time herself I doubt she knew exactly what time everyone actually finished working and I doubt she could keep track of everyone who worked that night. \n\nIdk I left Chipotle hating the shit out of the place. Haven't eaten there since I quit. It felt like slave conditions for the closing crew. \n\nEverything else about it was alright though.", "score": 4, "replies": [{"body": "I mean that isn't how overtime works man.", "score": 3, "replies": [{"body": "No I know that now. This was years ago and I was just telling the situation as it happened. I indeed did not know how overtime worked back then. Regardless my point was that from 12am to 2am we were technically working off the clock and yeah the manager said she would adjust the time accordingly later but whats the point of a system that keeps time if it isn't accurately accounting for the time I worked. I left literally immediately after this because I got hired at a new job so I wasn't around to see if conditions have improved.", "score": 1, "replies": [{"body": "Doesn't really seem all that bad to me tbh. The clock not working happens more often than you think but as long as the accounting office fixes it you should be good. It is on you to make sure your paycheck is good. If not then complain to the company and if that doesnt work complain to the state labor department.", "score": 2, "replies": [{"body": "Yeah wage theft is basically the workers fault for trusting their employers /s", "score": 1, "replies": []}]}]}]}]}, {"body": "1 million? Thet spend more on napkins per day. Lol. Joke", "score": 1, "replies": []}, {"body": "Why do these messages appear after the party is over?", "score": 1, "replies": []}, {"body": "It is Quant based selling for most of the momentum stocks across the sectors\n\nCheck Dow jones momentum index (the biggest one day drop since 2009)", "score": 1, "replies": []}, {"body": "And chipotle sucks now too. There is so much competition these days that are so much better. Even Qdoba is better.", "score": -2, "replies": [{"body": "Qdoba is expensive garbage", "score": -4, "replies": [{"body": "And chipotle is worse. What’s new?", "score": -2, "replies": [{"body": "No it’s not. I like it.", "score": -1, "replies": []}]}]}]}]}
{"title": "Apple announcing the acquisition of Snapchat today?", "selftext": "[deleted]", "id": "d2a2oc", "created_utc": 1568132908.0, "score": 97, "upvote_ratio": 0.87, "num_comments": 67, "comments": [{"body": "For some reason I really want to believe this shit", "score": 59, "replies": [{"body": "Ya you know what somebody else said it but just because you took the time to write all this and because I likes good  conspiracy I’m in for 20 calls 15.5 strike price 9/20 expiration", "score": 16, "replies": [{"body": "My man.", "score": 6, "replies": [{"body": "Can we talk about how apple’s quick video feature literally ripped off snapchats", "score": 4, "replies": [{"body": "lol i cant wait for all these bet to evaporate. i bought a handful of ITM calls anyways so if this doesnt work out i can at least salvage a few bucks.\n\ndoesnt even need to be cuz of this DD, SNAP can moon back for whatever reason it wants as well.", "score": 5, "replies": [{"body": "I’m out this afternoon. But you’re right it could moon for sure", "score": 3, "replies": []}]}]}]}, {"body": "I bought 14.5 puts around the same time\n\nMy wife’s boyfriend told me to", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 20, "replies": []}]}, {"body": "Ok buying Puts", "score": 77, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "I have $14 and $13 puts October 18 expiration. Still down 50% because I bought them late June lol", "score": 8, "replies": []}, {"body": "There's a zero percent chance of this happening.  I bought calls.", "score": 0, "replies": []}]}]}, {"body": "Didn’t even read the DD, purchased 5 calls , let’s see", "score": 38, "replies": [{"body": "WTH, I read the tldr, buy puts you mean? \nStop this bullshitting inverse wsb", "score": 11, "replies": [{"body": "yes stop this bullshitting inverse WSB, OP explicitly said buy puts.", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 22, "replies": [{"body": "It went down 3%today.", "score": 9, "replies": [{"body": "Yeah but since he bought it's done nothing but go up.", "score": 6, "replies": []}]}, {"body": "What are these shares you speak of?", "score": 3, "replies": [{"body": "Shares are a feminine hygiene product, I think.", "score": 3, "replies": []}]}]}, {"body": "Can someone refute this already so I don't put it all on $SNAP?", "score": 15, "replies": [{"body": "Definitely don’t do that please don’t do that", "score": 7, "replies": [{"body": "I didn't haha. I'm watching the keynote and it looks like the logo was referencing to the new iPhone colors :)", "score": 5, "replies": []}]}]}, {"body": "This was fun as hell to read and I hope you end up being right.", "score": 13, "replies": []}, {"body": "What the hell,  couple of $18 for a buck this week only because you took the time to write all that stuff", "score": 8, "replies": []}, {"body": "So buy puts?\n\nwouldnt apple squiring snap just make its stock rise?", "score": 8, "replies": [{"body": "Snap would be the one to rise", "score": 8, "replies": [{"body": "Apple would drop", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "That’s good info thank you", "score": 1, "replies": []}]}]}, {"body": "Sir, this is a Portapotty.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 18, "replies": []}, {"body": "Fuck them kids I went for it", "score": 6, "replies": []}, {"body": "This is so autistic it can't go wrong.\n\nI might buy a January call it 2 in snap just because if you are right it could moon but if wrong I can just sell tomorrow and probably not lose much\nEarnings are in October for snap so any time after that will have enough iv to not lose too much.", "score": 10, "replies": []}, {"body": "Interesting I was going to say [it looks like their old logo](https://www.macobserver.com/wp-content/uploads/2018/02/apple-rainbow-logo-768x403.jpg) but colours don't line up and orange disappeared.\n\nYou might be on to something OP ^^^^^^^kappa", "score": 5, "replies": []}, {"body": "Now this is what the sub is all about!  I'm in for some 9/20's at 15 for shits and giggles.\n\nBREAKING:  APPLE TO BUY SNAPCHAT!!!  ^^not ^^likely", "score": 4, "replies": []}, {"body": "Oh well, nice try op.", "score": 4, "replies": []}, {"body": "I would nut, thank you for letting me dream, even if for only a moment", "score": 3, "replies": []}, {"body": "I went in 🤷‍♂️", "score": 3, "replies": []}, {"body": "Ok I bought calls", "score": 2, "replies": []}, {"body": "Anyone know how long these events usually last?\n\nNevermind \\~2 hours", "score": 2, "replies": []}, {"body": "10/10 insights", "score": 2, "replies": []}, {"body": "So any chance someone else is going to acquire it?", "score": 2, "replies": []}, {"body": "Calls or puts on $SNAP? Instructions not clear enough.", "score": 7, "replies": [{"body": "Yes.", "score": 4, "replies": []}]}, {"body": "just want to mention on the part regarding [spectacles.com](https://spectacles.com), if you open that page and right click (in chrome) and view source, then ctrl+f and search apple, you'll find 2 instances both of which refer to the icon in the tab as \"apple-touch\"...\n\n&#x200B;\n\nedit: this touch icon is commonly used for apple to display the page icon in their browser when you bookmark a page, so this could mean nothing...just interesting", "score": 5, "replies": [{"body": "lol this is some retard shit", "score": 17, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Solid DD 420 calls confirmed.", "score": 1, "replies": []}, {"body": "Followed the unusual options gang with snap $20 10/18 a month ago. Been going down the entire time and there's still a month left in these calls.", "score": 1, "replies": []}, {"body": "Have the colors been used yet in the presentation so far???", "score": 1, "replies": [{"body": "Looks like the colors of the iPhone 11", "score": 2, "replies": [{"body": "gg, op", "score": 1, "replies": [{"body": "Nvm missing green or blue", "score": 1, "replies": []}]}]}]}, {"body": "This is giving me hope for my dying October calls", "score": 1, "replies": []}, {"body": "Let’s go bought snap calls 😂😂😂", "score": 1, "replies": [{"body": "Lmfao event is over", "score": 1, "replies": [{"body": "Really just wasted $21 for no reason 😂", "score": 2, "replies": []}]}]}, {"body": "nice call bro, glad you didn't read into the details too much.", "score": 1, "replies": [{"body": "bro 😎💪", "score": 2, "replies": [{"body": "bruh", "score": 1, "replies": []}]}]}, {"body": "fuck all you snap chat assholes. I listed to you and sold long term calls I bought when the stock price was 5 bucks cause everyone thought this shit was collapsing into nothing. I'm buying calls.", "score": 1, "replies": []}, {"body": "Welp, there goes $5 on OTM calls at strike $21.", "score": 1, "replies": []}, {"body": "Pretty sure everyone assumed the colors were for the XR phone colors... but okay?", "score": 1, "replies": []}, {"body": "Gonna trust in this one", "score": 1, "replies": []}, {"body": "Yeah.. i'm going with \"bought as a hedge\" for 500, Alex.", "score": 1, "replies": []}, {"body": "I still think this is right", "score": 1, "replies": []}, {"body": "A partnership is more likely than acquisition IMO.", "score": 1, "replies": []}, {"body": "Bigly if true. \n\nI can totally see TimApple buying up Snap to pump Apple since iphone sales slow down and Mr. Mango's tariffs, buying SnapChat to pump up Apple stock seem possible.", "score": 1, "replies": []}, {"body": "Colors are for the new phone colors, but I went ahead and bought some oct 15 calls", "score": 0, "replies": []}, {"body": "snapchat logo was just on the screen", "score": 0, "replies": []}, {"body": "With all the Monopoly concerns today, I highly doubt apple would consider buying SNAP", "score": 0, "replies": []}]}
