{"title": "With my AAPL position losing me money everyday ROKU put a smile on my face", "selftext": "[deleted]", "id": "d7h5a9", "created_utc": 1569103615.0, "score": 40, "upvote_ratio": 0.91, "num_comments": 72, "comments": [{"body": "Not robinhood, don’t understand", "score": 42, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Questrade isn’t so bad as a platform, but the damn fees!\n\nI just opened an IB account and have to fund it next week. FDs on the cheap that way.", "score": 2, "replies": [{"body": "I have accounts with IB and Qtrade as well. \n\nThose are more long term holdings though. I don't actively manage them. \n\nQuestrade platform is just much more user-friendly when compared to IB and Qtrade.", "score": 1, "replies": [{"body": "Dont listen to this tard. Get wealthsimple trade. Trust me", "score": 1, "replies": [{"body": "Will look into it. \n\n\nI make such few trades as it is that I'd rather just stick to what I'm comfortable with rather than use a different platform to save a few hundred dollars a year.", "score": 1, "replies": []}, {"body": "Pretty sure WealthSimple takes a % of your USD gains , that’s how they make their money instead of commissions. It’s almost worse in a way , if you get a huge gain, they’re getting a nice chunk", "score": 1, "replies": []}, {"body": "No options bud. Can only go be a bagholder on wealthsimple.", "score": 1, "replies": []}]}]}]}, {"body": "So... Fake money. Got it.", "score": 1, "replies": [{"body": "I mean the prices are still USD lol", "score": 2, "replies": [{"body": "My TDA paper trading account was USD. ¯\\\\\\_(ツ)_/¯    \n     \nI'm just meming, but seriously, we should get married so we can both get dual-citizenship to pull the [dual-country-yolo](https://www.reddit.com/r/wallstreetbets/comments/d760wz/dual_citizen_with_mildly_functioning_autism_and_i/?utm_source=share&utm_medium=ios_app&utm_name=iossmf).", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "This may be hard to believe but we have brokers in Canada too", "score": 1, "replies": []}]}]}]}, {"body": "Incredible work, but since you’re Canadian, you should be on r/canadianstreetbetseh", "score": 20, "replies": [{"body": "Bay street bets", "score": 1, "replies": []}]}, {"body": "what's the PROFIT???", "score": 5, "replies": [{"body": "Not all positions have been closed yet but around 250k", "score": 13, "replies": [{"body": "ahh that's those numbers. Are you full time trader?", "score": 4, "replies": [{"body": "In a way...\n\nI work at a hedgefund.", "score": 7, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Nice. So that means you can borrow the hedge fund's money if you fuck up next time.", "score": 3, "replies": [{"body": "I just always make the opposite plays that I do at work so I either get a nice bonus or cash money baby", "score": 42, "replies": [{"body": "Working the system, or buy calls and use HF money to boost SP", "score": 4, "replies": [{"body": "how they know OP is canadian", "score": 1, "replies": []}]}, {"body": "Smart move. I follow the experienced here losing 80% of time. Now I make my own call doing opposite losing 15-20% of bets.", "score": 2, "replies": [{"body": "lmao just in case it wasn't clear I was making a joke. I don't actually do that. I do occasionally make similar moves to what I do at work though. Also have my own money invested in the fund.", "score": 6, "replies": []}]}, {"body": "What the fuck, that's cheating.", "score": 2, "replies": [{"body": "It's also illegal and I don't actually do that.", "score": 3, "replies": [{"body": "you are doing that; i'm certain of it. Should I report you to the SEC? xD", "score": 1, "replies": [{"body": "No jurisdiction in TSE hahaha", "score": 2, "replies": [{"body": "just joking bro, no need to worry. I don't know anything about these sheets anyway. \n\nAnd I don't think it's illegal though, since it's 2 different accounts, unless the hedge fund is 100%/ or partly owned by you. \n\nBy the wya, good luck with your next trade.", "score": 1, "replies": [{"body": "Lol yeah I know, no worries\n\nIt's still a conflict of interest. I can't be managing other people's money while actively making bets against myself. I do have money invested in the fund as well but it's pennies compared to what other people have in it. \n\nHaha thanks appreciate it :)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Yeah honestly fuck Apple. I’ve only lost Money trying to trade their shitty contracts. Everything else has been seamless.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Just this week. \n\nIt was a last minute decision I had to run by my girlfriend.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Bit of both I guess? \n\nI had a strange with weeklies as well that paid around 90k that was more of a gamble but only cost me 5k to set up. \n\nI expected a drop but not one as significant as it ended up being. That's why I loaded up the short position instead of just a ton of puts and why the expiry is a bit date on the options.", "score": 2, "replies": []}]}, {"body": "Now since even the panhandler on my corner knows apple lines are long and demand is crazy for iPhone 11s. Are earnings beat priced in already?", "score": 1, "replies": [{"body": "How can something that just happened be priced in?", "score": 1, "replies": [{"body": "[dates ](https://imgur.com/gallery/UofHSBF) \n\n\nI mean the delivery dates for online backlog orders kept getting pushed back. It doesn’t take a genius to make the assumption that demand is beating last year by an order of magnitude. Also apple will record most of this revenue by end of quarter and raise guidance. Since they lowered their guidance on Q1 call.", "score": 1, "replies": [{"body": "Okay so the thing is this is only a reflection on US consumers. Also I don't think it's correct to use the term \"priced in\" for cases like this. The term is just thrown around so casually. Regardless I personally do think that AAPL has a lot of room to grow over the next several months. Although I'm obviously bias since I have a 7 figure position lmao. That being said the fund I work for also has a huge position in AAPL so 🤷‍♂️ take what you will from that. \n\nIf you do buy calls though I'd say buy them far out. They're extremely reasonably priced right now.", "score": 1, "replies": [{"body": "Very true. I’m starting to realize how useless the term “priced in” is to construct a strong argument explaining market movement. \n\nBut yea October event and earnings will be great fuel for the next move.", "score": 1, "replies": [{"body": "Buy calls now if you want to play earnings then. Sell after* the run up before earnings then buy a strangle/straddle.*", "score": 2, "replies": [{"body": "I’ll add some VIX calls in case", "score": 2, "replies": [{"body": "Not sure what that's going to accomplish but sure.", "score": 3, "replies": [{"body": "tariff insurance ?", "score": 0, "replies": [{"body": "Waste of money in my opinion but do whatever you want. \n\nI personally don't play VIX.", "score": 1, "replies": [{"body": "I see", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "People bought on the rumor of the new iPhone release, as in “ buy on the rumor, sell on the news”.\n\nNew iPhone rumors are always hot in August in anticipation of September release.\n\nNow that they are selling, time to short the stock, per the theory.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "This particular thread is dealing with iPhone sales.  Thus the comment.", "score": 0, "replies": [{"body": "You're still interpreting the quote incorrectly", "score": 1, "replies": [{"body": "Actually no.\n\nYou’re basing your argument on facts not even in the discussion which bolsters your credentials as an autist.\n\nAs a result, I would like to see how you think.\n\nSo tell me why you feel I’m interpreting the quote incorrectly.", "score": 1, "replies": [{"body": "I told you... \n\nIt doesn't literally mean buy and sell. It just means to trade leading up to the news and not based on the news. \n\nRegardless I'm going to be holding my position.", "score": 1, "replies": [{"body": "OIC.\n\nDo you use stops?\n\nConsidering using a stop loss order to avoid what could be an upcoming short sale of the tech sector between now and the middle of October.\n\nAnd just for the fun of it take a look at a long-term chart of Apple. September’s are typically not good months for it", "score": 1, "replies": [{"body": "I'm holding this for 2+ years most likely.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "It’s looking like a major hit on tech is coming up here for end of September, early October.", "score": 2, "replies": [{"body": "Chance to average down then", "score": 2, "replies": [{"body": "Sell puts?  Buy them ahead of time?", "score": 1, "replies": [{"body": "What? \n\nI don't think there's a huge tech drop imminent. Even if there is most of my holdings are long term so I will just average down my portfolio. \n\nThis is why you keep cash on hand kiddies.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Hot damn! Nice.", "score": 1, "replies": []}, {"body": "I think you lucked out on ROKU recently.\n\nOn AAPL I expect you make tons by making CALLs that far advance.", "score": 1, "replies": [{"body": "I think I lucked out too in terms of the return but I think everyone expected a drop. Just not as much as it did", "score": 2, "replies": []}, {"body": "what about the theta tho", "score": 1, "replies": [{"body": "If it keeps dropping then theta doesn't really matter.", "score": 1, "replies": []}, {"body": "Look at the expiry. \n\nAlso no theta on straight shorts", "score": 1, "replies": []}]}]}, {"body": "Everyday is an adjective that means common.", "score": 1, "replies": [{"body": "Thanks so would I be correct in saying \"/u/VaramyrSixchins mother was an everyday whore, today's celebration warranted an escort\"", "score": 4, "replies": []}]}, {"body": "Ugh Questrade kills me with fees", "score": 1, "replies": [{"body": "To be honest they're pretty reasonably priced.", "score": 1, "replies": [{"body": "I guess you can say that when you’re making $40k. But when I make 10% of $1000 and get back $50 I’m pissed", "score": 1, "replies": [{"body": "Well for options it's basically charging you an extra cent per contract. So unless you're trading otm weeklies it's nothing. \n\nPlus max $10 on stock", "score": 1, "replies": [{"body": "See I don’t have that. I have $4.95 + 0.75/option", "score": 1, "replies": [{"body": "Yeah so 0.75 cents per contract it's .75 cents on the price of a contract. \n\n\nIf a contract is 1.13 it becomes 1.14 for the purpose of your trade is what I mean.", "score": 1, "replies": []}]}]}]}]}, {"body": "TD is $10. It rapes my pocket change stock and option plays.", "score": 1, "replies": [{"body": "Ask for lower fees", "score": 1, "replies": []}]}]}, {"body": "Get out with queeftrade", "score": 1, "replies": []}, {"body": "I just went long", "score": 1, "replies": []}]}
