{"title": "[First Purchase] - KODK 10 PUT 4/20/2018", "selftext": "In at 4.20 to try to take advantage of the huge bubble they created with their announcement.  \n\nAdvice / critisism would be welcome.  First time I've purchased an option so I'm curious if others would have done something different.", "id": "7pgccn", "created_utc": 1515598715.0, "score": 33, "upvote_ratio": 0.93, "num_comments": 67, "comments": [{"body": "I'm a contrarian investor, so look for opportunities where the news creates a temporary situation to profit.  From that perspective I like this trade and think your logic is sound.\n\nWhat concerns me is the low liquidity, meaning that you may not be able to close the position when you want and at the price you expect.\n\nAlso, since you paid $4.20 to open, this means your break even is around $5.80, so with the price around $11 now it needs to move quite a bit for you to hit profitability.  \n\nIt will be nice for you to share your plan.  \n- What is your profit target when you will close this position?  \n- What is your max loss amount before you close or roll?   ", "score": 14, "replies": [{"body": "* KODK was trading at just over $3\n* At this announcement, and only that, they spiked to $12 overnight\n* I had a price target for them of 4.50 within 3 months\n* Max loss before I type in the towel is about 25%\n\nThanks for the questions.  What usual level of liquidity should I be looking for?  I assumed, perhaps incorrectly, that once April approached it would be closer to 5K instead of the 500 now.", "score": 11, "replies": [{"body": "Thanks for sharing your plan.  Typically I use 50% gain as a trigger point to close out, but will use stop orders to lock in those gains to allow it time to run lower without upside risk.  Also, 75% to 100% on the max loss is my usual numbers, however this is based on recent measures of range of movement.\n\nI can't say I have a specific number for liquid as I tend to trade only highly liquid instruments.  There are a couple of quick checks I do to determine liquidity.  \n\nFirst is Bid/Ask Spread, if it is between $.01 and $.03 then there is good liquidity and I can expect a fill quickly whether buying or selling.\n\nNext is the underlying volume with generally more is better.  KODK is over 62M share volume today, but the 90 day average is only 940K which is pretty low in the grand scheme of things.\n\nStock price vol and open interest are two others that I seldom look at.  Bid/Ask spread is generally the best and easiest way to determine liquidity.\n\nThe stock price very well may drop after this news event fades from memory, however once that excitement is gone I suggest that many of the traders will also go meaning there will be fewer to close your position out with.\n\nLast thing is that at $4.50 your profit will only be about $130, and your max profit is $580 if KODK goes to zero, so you are risking $420 to potentially earn those amounts.  Just for discussion, as you are bearish, you might want to look at a bear call spread as another approach.  ", "score": 12, "replies": [{"body": "Thanks very much for the feedback.  Bear call spread would be writing a call and buying a call further out?", "score": 4, "replies": [{"body": "Please look it up so you can see the mechanics and understand the risks!  Yes, you Sell a call and then Buy another call further out.  There is a net credit and you have defined risk.\n\nModeling this just now I see the Feb 12.5/15 BCS would be a credit of $70 and a max risk of $180.  The breakeven where it starts to lose money, would be $13.20, so if it stays below there the trade can be closed or let to expire in a positive position.", "score": 10, "replies": [{"body": "Absolutely will do more reading.  I thought I would start with something simple but your suggestion is more elegant.  Thanks again and good luck to you going forward.", "score": 3, "replies": [{"body": "You are very welcome!\n\nCheck out the free training on CBOE and OIC as they do a great job on options training.  All my best to you!", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "IVR is max at 100, those otm puts are expensive or 2x-3x in premium. Reason why the premium is expensive is because extrinsic value is juiced up from the excessive high IV. When generally we buy options, we want low iv, when selling options we want iv from high to low. With an high iv for your pt, your breakeven is now higher, my advice is scalp the down move, collect 20% profit and run. ", "score": 9, "replies": [{"body": "Starting to see that now.  Probably a good call.", "score": 2, "replies": []}]}, {"body": "I would’ve sold a call instead. You paid an absurd amount of premium ", "score": 4, "replies": [{"body": "A monthly bear call would be a lot safer. ", "score": 1, "replies": [{"body": "Well i meant as the primary leg. Id never go naked on Kodak haha", "score": 3, "replies": []}]}, {"body": "calls were cheap. options priced in reversion, not continued growth", "score": 1, "replies": []}]}, {"body": "I would say that there is some precedent for this.\n\n\"[A Rose by Another Name](http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.197.9894&rep=rep1&type=pdf)\"\n\n>We document a striking positive stock price reaction to the announcement of corporate name changes to Internet-related dotcom names. **This “dotcom” effect produces cumulative abnormal returns on the order of 74 percent for the 10 days\nsurrounding the announcement day. The effect does not appear to be transitory;**\nthere is no evidence of a post-announcement negative drift. *The announcement day effect is also similar across all firms, regardless of the firm’s level of involvement with the Internet.* \n\n>***A mere association with the Internet seems enough to provide a firm with a large and permanent value increase.***\n\nTHE JOURNAL OF FINANCE; DEC. 2001\n\nDon't get burned because you **feel** like it should drop.", "score": 6, "replies": [{"body": "Interesting, thanks.", "score": 2, "replies": [{"body": "Funny thing is before the .com bust your strategy would have been correct but it didn’t matter until the bubble burst. You can be right about the profitability being crap but buyers keep buying and options keep expiring in the money. Like in the big short they are so right about the housing bubble, nobody was believing them and they finally hit it big. But had they gone broke before their rightness paid off they woulda been broke. Better to be rich and lucky than poor and right I guess. ", "score": 1, "replies": []}]}]}, {"body": "I have no comment on the trade per se, you're *probably* correct that it's a bubble; keyword there being *probably*.\n\nIf this is your one and only trade (you said this is your first option trade), I hope that you're well diversified, or that this is an amount of money that - if you lose it all - you're fine with it.\n\nDiversification mitigates risk, no diversification increases risk by orders of magnitude.\n\nGood luck with this trade and with your financial future as well.", "score": 3, "replies": [{"body": "Sorry, should clarify.  I'm heavily invested and diversified, this is my first option purchase with my \"gambling\" money.", "score": 3, "replies": []}]}, {"body": "I did the same thing for the 7.50 july strike. Honestly, I got a bit caught up in the moment, not realizing that I paid quite a bit for it. I am hoping for a quick-ish drop back to more reasonable levels and then can sell with some IV value for a profit. \n\nWe will see, I would take this trade back if I could...", "score": 2, "replies": []}, {"body": "Might not work out for you, they have zero downside right now. They’re just reselling antminers, already have 2Mil investment from a blockchain company BLKCF I’ll take the other side of this bet and we shall see :)", "score": 2, "replies": [{"body": "Leasing time on Antminers, doing an ICO, and hopefully in the future some DRM.  You're right, these are just plans and no big downside.  But these announcements don't add $300 million in value to the company.", "score": 1, "replies": []}]}, {"body": " Don't trade like that. The old adage is \"The market can stay irrational longer than you can stay solvent.\"\n\nAs market takers rather than market makers, you need to wait for the move to confirm your opinion. In other words, you don't just jump against a move but wait for it to start breaking down. Momentum is tough to fight. ", "score": 2, "replies": [{"body": "I think my determination about the entry point was correct, however as others have pointed out my strategy was not.", "score": 1, "replies": []}]}, {"body": "I sold a FEB 12.5 naked call for 2.15 credit  the IV is 266% ($465 buying power) ", "score": 1, "replies": [{"body": "Risky move but best of luck!  ", "score": 2, "replies": [{"body": "if you say so...  ", "score": 0, "replies": [{"body": "Not being critical, but as this has infinite loss potential it is risky no matter how you look at it.  ", "score": 2, "replies": [{"body": "even it it shot up to $24 you realize how silly that sounds?", "score": 1, "replies": [{"body": "I've been around long enough to know that silly things can and do happen.  I'm hoping you are right and make a nice profit!", "score": 3, "replies": [{"body": "a (then) $11.75 underlying that paid 2.15 in rich premium at a 0.60 delta...and that's riskier than buying a put at 4.20 lol?? I don't mean to pick on you superficially, my comment is more towards the subreddit as a whole, but there is a criminally incorrect misconception that selling calls is a game of russian roulette. \"infinite\" for instance. Like I'm going to wake up and owe a million dollars or something.  ", "score": 1, "replies": [{"body": "Yeah, I get it and I mean no disrespect to you.  I'm sure you know what you're doing, and if it goes against you will close for a minor loss or roll up and out to safety.  \n\nI do understand that there is a stigma on naked calls since they can have unlimited losses, versus defined risk strategies like spreads.\n\nBottom line is know what you're getting into and how to get out, then any and all option strategies are fair game.  I just keep thinking of all the people who have said, \"I lost it all in the market\" and wonder how in the world that could have happened, but naked options in are one way it can . . .", "score": 4, "replies": []}, {"body": "Hey, that sounds familiar.....", "score": 1, "replies": []}]}]}, {"body": "yea but what if the price shoots up to infinity? You should buy the infinity - 1.00 call just to define the infinite risk", "score": 1, "replies": []}]}]}]}]}]}, {"body": "My personal opinion is that you overpaid for the put option given the expiration and took on quite a bit of a gamble with not much of an upside.\n\nI agree with your stance that current block chain mania is in the bubble, but I'd go a bit differently in structuring this trade.\n\nI think a better trade in terms of risk to payoff is to sell short dated ATM call options expiring next Friday and collect the premium. It is unlikely that Kodak will keep rising(another example is Long Blockchain Corp). At the same time, tickers have tendency to be irrational longer than you can stay liquid, and the price may see relative retreat but not enough to break even by 4/20.\n\n", "score": 1, "replies": []}, {"body": "Bought the same thing this morning, best of luck!", "score": 1, "replies": []}, {"body": "OK, I made a paper trade as I am curious what will happen here, but not confident enough in the movement of the underlying to put real money in.  Call me chicken.  :)\n\nTrade is qty 10 of an Apr 10/15 BCS for a credit of $1.45, or $1,450 max profit.  Max risk is $3,550 and BE is at $11.45.  \n\nI've set a stop order for $2.18 ($1.45 + $.73 or 50% more than current price) in case it goes the wrong way, and a limit order of $.75 to capture at least a 50% profit.  I will keep an eye on both orders and lower them if the price drops to let it run as well as lower the stop to both ensure it doesn't run up and to lock in a profit once it drops to about $1.00.  \n\nI'll post updates as this plays out.", "score": 1, "replies": [{"body": "For BCS, did you mean Bear Call Spread?  Because Bull Call Spread has the same initials.  \n\nGot confused for a second.", "score": 1, "replies": [{"body": "Yes sorry, Bear Call Spread.  Since I have never used Bull Call Spreads, which are debits, I always use BCS for Bear Call and BPS for Bull Put spread which are credits.\n\nThanks for pointing this out and I'll be more careful to spell these out in the future.  ", "score": 2, "replies": [{"body": "It's cool, mostly just thought it was funny.  I was quite confused.", "score": 2, "replies": []}]}, {"body": "Bull call spread would be a debit though.", "score": 2, "replies": [{"body": "You're absolutely right.  For some reason when I read it, BCS meant bull call spread, and I was super confused on how he got a credit for it.", "score": 1, "replies": []}]}]}, {"body": "Sorry for all the questions.  Credit = diff of the sale of the 10 and the purchase of the 15 correct?  And the risk is the difference between the strikes - the credit?\n\nCheers", "score": 1, "replies": [{"body": "Credit is the premium you collect when selling credit options.  Yes, you have it correct, it is the difference you collect between the sale of the closer to ITM option minus what you pay for the \"hedge\" or protective farther OTM option.  \n\nYour risk statement is also true, and moving the OTM strike out can collect more premium, but also increases risk.  Moving it closer can lower risk and also premium.  Finding the balance of risk vs reward is your job as a trader.", "score": 1, "replies": [{"body": "Thanks. BTW, looks like your paper trade is in the money.", "score": 1, "replies": []}]}]}, {"body": "Just a quick update on this paper trade.\n\nThis morning the stock is at ~$9.3x and market price on the spread has been hovering around $1.14 or a $.31 ($310) profit, which if closed now would be a pretty good return for an overnight position.  \n\nI'm leaving my stop and limit orders in place, and will be watching this position to manage accordingly.  I'll update this tomorrow or if something should change.  Scot", "score": 1, "replies": [{"body": "UPDATE:  Since the underlying has moved down to $8.6x the trade is now at .83 (~$620 profit) so I am adjusting my stop & limit orders.\n\nTo lock in a profit, but let it continue to run for more, I changed my stop order to $1.05 for at least a $.40 ($400) profit should the price spike back up, and the limit order to $.45 for a $1,000 profit if it closes out there.  \n\nMy plan calls for me to readjust again if the price drops below the 50% mark of about $.73 where I will move the stop down below $1 and the limit down to somewhere around $.35.  The exact order amounts may vary based on where the price is at the time.  That is provided it does not close out by going above or below my thresholds in the meantime.\n\nMore updates as they develop!", "score": 1, "replies": [{"body": "FINAL UPDATE:  OK, KODK moved around a bit more than I expected, so the position closed out at $1.00.  Once a stop order triggers it become a market order, so it triggered at $1.05, but when it filled at market is was $1.00.\n\nThis means the position is closed and I made a paper profit of $450 (minus commissions) in less than 24 hours.  \n\nSorry for so many updates and I hope this example was helpful!  Scot ", "score": 1, "replies": []}]}]}]}, {"body": "I purchased a \"Bear Call Spread\" by buying a call @ 10 and selling a call at 2.5. See the chart for my exposure, breakeven points, etc. Anyone else taking the leap? https://i.imgur.com/qjyGFfF.jpg", "score": 1, "replies": [{"body": "Very cool trade! Can I ask what software/interface this screenshot was from? Sorry, I'm new and still trying to get my feet wet in options. Thanks!", "score": 2, "replies": [{"body": "It's trade finder in TD Ameritrade...it's pretty helpful!", "score": 2, "replies": []}]}, {"body": "Very nice trade!  BE is low at about $8, but once it drops that ~$3 you will be golden.  ", "score": 1, "replies": [{"body": "Thanks! You seem to know a ton, I'm still reading up on the CBOE training you suggested. \n\nBut I had something interesting happen when I checked my account this morning. Instead of having 4 contracts for the 10 strike call and -4 for the 2.5 strike call, I had:\n\n4 contracts for the 10 strike call \n-1 contract for the 2.5 strike call and\n-300 shares of KODK.\n\nHave you seen this before? It's like they auto-converted the short 2.5 strike to shorting the shares. Odd, no?\n\nEdit: Some more info https://i.imgur.com/RyeW3nl.jpg", "score": 1, "replies": [{"body": "Your short 2.5 calls were exercised by the long holder (likely there was little extrensic value left since they were so deep in the money). That left you with a short position.\n\nYour risk profile is the same but your margin requirements have changed since you're now short stock.", "score": 1, "replies": [{"body": "Thanks for that. And the long holder is just anyone with a bullish outlook?\n\nAlso, I assume you're saying my risk profile is the same because I still have the long protection with the 4 long calls in case the stock skyrockets while I'm short 300 shares (and short 1 call @ 2.5)?", "score": 1, "replies": [{"body": "Agree with the above comments and what happened, although surprised that someone would go through the exercise process that quickly.  Goes to show that American style options can be exercised at any time, and the risk increases when ITM, which your 2.5 strikes definitely are.  As noted, your risk profile is the same, you just took a hit to your buying power with the short stock.  Don't be surprised if the other short option is exercised as well, although you can close it early to avoid that if you want.", "score": 1, "replies": [{"body": "Interesting--and understood on the American style options. \n\nI just got a call from TD Ameritrade saying I can't borrow the 300 shares. I have until 1pm today to decide what to do. Am I going to lose money on this trade even though it went in the right direction...crazy! These Bear Call spreads might be too complicated for me! Any advice with the inability to borrow is appreciated...thanks!", "score": 1, "replies": [{"body": "HTB, or Hard to Borrow stocks are those where the demand for shares outstrips the available supply.  It comes back to liquidity and the amount of shares outstanding, plus how many options are being traded since they are in effect unlimited.\n\nI've never had this happen before so can't offer anything, sorry.  Keep in mind to net everything out with the credit and whatever it takes to close this out, any loss may be smaller than you think.\n\nKeeping your options portfolio from getting in the money (ITM) is a key learning here, anytime an option goes ITM it is susceptible to being exercised.  Best of luck and let us know how it turns out.", "score": 1, "replies": [{"body": "Ok, as you warned with your reply at the top of this thread, the moral of the story here is to be wary of illiquid instruments.\n\nAfter reading your responses and speaking with TD Ameritrade, the 2.5 calls were assigned as they were so deep in the money. I believe that in order to keep my strategy active, TD automatically sold short 300 shares to cover the 3 contracts that were assigned. \n\nThe illiquidity problem came up again in that TD didn't have any shares to borrow, so I had to get out of this short position.\n\nWhat we did was this:\n\nBought 300 shares @ $9.3619 to cover the short and\nSold 3 of the 10 Calls @ $1.6\n\nAll in all, I came out pretty much even. I believe this is due to the credit offsetting the loss with covering the shares and selling the long 10 calls. We'll see though-- I still am short 1 2.5 call and long 1 10 call. \n\nThanks again for all your insight--really interesting stuff. \n\n", "score": 1, "replies": [{"body": "Good to hear it wasn't too painful, and the high premium you received initially being a help to offset larger losses.  ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I will be messaging you on [**2018-05-11 05:56:17 UTC**](http://www.wolframalpha.com/input/?i=2018-05-11 05:56:17 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/options/comments/7pgccn/first_purchase_kodk_10_put_4202018/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/options/comments/7pgccn/first_purchase_kodk_10_put_4202018/]%0A%0ARemindMe!  4 months) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! dsiai0k)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "i stocked up on KODK puts, much lower strike. gl", "score": 1, "replies": []}, {"body": "KODK spiked above $12 this morning, anyone have an idea why?", "score": 1, "replies": [{"body": "It did?  I don't see that on the one minute candles.  Late order?", "score": 1, "replies": [{"body": "Must have been a chart glitch as I don't see it now.  My bad for the inaccurate info.", "score": 1, "replies": []}]}]}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/wallstreetbets] [Someone tell him it’s not going to end well](https://www.reddit.com/r/wallstreetbets/comments/7qe4aa/someone_tell_him_its_not_going_to_end_well/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "score": 1, "replies": []}, {"body": "you paid 4.20$ for a 10$ put? that's like 42% of the stock price is in premiums. You got ripped off. Is there a chance you that you might win? Sure...but you paid a high price tho.", "score": 1, "replies": [{"body": "Yep,  was a mistake.  Got a lot of guidance from the responses here.", "score": 1, "replies": []}]}]}
