{"title": "Feb 1 is where the Earnings Action is going to be! AMZN, AAPL, GOOG, BABA, MA, V", "selftext": "", "id": "7sjrgd", "created_utc": 1516759263.0, "score": 88, "upvote_ratio": 0.97, "num_comments": 60, "comments": [{"body": "This whole market is just an earning runup to Feb 1st.", "score": 67, "replies": [{"body": "[deleted]", "score": 31, "replies": [{"body": "As is tradition", "score": 9, "replies": []}]}]}, {"body": "I've bought AAPL, FB, GOOGL, and MSFT calls ahead of this and plan to sell the day before earnings, at peak volatility. So far it's worked out great.", "score": 33, "replies": [{"body": "Reported for not sharing a legit strategy.", "score": 30, "replies": []}, {"body": "I own all but MSFT. I think Googl will score big.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Good call. If I remember correctly I think volatility affects out of the money options more. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I'm not sure, probably not. QQQ tracks 100 stocks on Nasdaq right? You're not going to have as big of a volatility spike there. \n\nAs long as you think the bull market is going to persist, I'd keep it.", "score": 1, "replies": []}]}, {"body": "I’ve got some Feb 9 187.50 FB calls I bought for $3.8. Looking good at the moment. You’re saying I shouldn’t gamble earnings? 🤔", "score": 2, "replies": [{"body": "It's hard to say. I thought for sure that Netflix already had that beat priced in, but look at what happened there. \n\n", "score": 3, "replies": []}]}]}, {"body": "Buy SPY Calls and /ES Futures.", "score": 12, "replies": [{"body": "I'm loading up on more tomorrow. Already up like 10k this week bruh, shit is 🔥", "score": 6, "replies": [{"body": "what expires u go for ", "score": 7, "replies": [{"body": "Feb16/Mar16", "score": 2, "replies": [{"body": "Feb16 290/291 SPY Call Spread.", "score": 2, "replies": []}]}]}, {"body": "Every day I'm just looking at SPY going up and up...  I feel like I'm stealing money or doing something wrong.  When I look at yesterday and I'm bummed thinking \"that was a shit day\" then I pause and realize I'm up $4k on the day.  ", "score": 3, "replies": []}]}, {"body": "This guy fucks ", "score": 3, "replies": []}, {"body": "I've already got my 300 calls ready. ", "score": 2, "replies": []}]}, {"body": "$AMZN to 1400 EDIT: i really need to start taking my own advice. fml", "score": 13, "replies": [{"body": "14,000* FTFY", "score": 6, "replies": [{"body": "140,000* FTFY ", "score": 3, "replies": []}, {"body": "there will be several splits leading up to that. but yes. easily that. ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "I'll bring the cups you make the coolaid", "score": 7, "replies": []}]}, {"body": "So buy FD’s on QQQ that week?", "score": 7, "replies": [{"body": "Buy FDs on QQQ every week", "score": 11, "replies": []}, {"body": "Buy FD's on TQQQ", "score": 3, "replies": []}, {"body": "The real money buys faggot delights 2 weeks ahead. Less decay.", "score": 2, "replies": []}, {"body": "What is FD?", "score": 2, "replies": [{"body": "Its Faggot Delights, aka weekly options.", "score": 28, "replies": [{"body": "Don't forget the part about them being OTM!", "score": 11, "replies": [{"body": "DEEP otm", "score": 11, "replies": []}]}, {"body": "Gonna be balls deep in TQQQ weeklies", "score": 8, "replies": []}]}]}]}, {"body": "Buy rumor, sell the news.\n\nI think loading off on Feb 1 may be the right play here.", "score": 6, "replies": [{"body": "dfadfsafdsadfsa", "score": 14, "replies": [{"body": "You do it after the earnings dummy.", "score": 4, "replies": [{"body": "They still went up tho dummy.", "score": 4, "replies": []}]}]}]}, {"body": "Can we talked about how insanely straight MA and V stock chart is.", "score": 5, "replies": [{"body": "Less talking, more buying calls on both", "score": 6, "replies": [{"body": "Be careful doing a earning play. I've seen people get burned by the iv crush as these companies don't move a lot on earnings.", "score": 2, "replies": [{"body": "Thanks for the advice, I never tend to play earnings though. I buy calls out 6 months and 1 year for both these stocks and roll them over eventually; always works (until it doesn't)", "score": 3, "replies": []}]}]}, {"body": "Some people have been saying we're living in a credit bubble right now. Makes sense when you consider the historic era of incredibly-low interest rates for a decade+ for the 2000s. Credit crunches have happened before, a credit collapse in 1772 was the catalyst for the Boston Tea Party. \n", "score": -1, "replies": [{"body": "Except Visa and Mastercard don't give out credit... ", "score": 2, "replies": [{"body": "So if they don't give out credit than I guess there's no relation between V and credit use, eh there buds? Top notch.", "score": 1, "replies": [{"body": "Correct. Their main revenue driver is number of transactions and the %of purchases done through cards vs cash.\n\n \nMe taking out credit to buy a over price house or start a shitty business doesn't help. ", "score": 1, "replies": [{"body": "So... your number of transactions and the amount you can spend on it is based off the consumer credit available to you, and if you had that taken away, the companies that benefit from your credit would suffer, correct? Possibly enough to hinder their business? So the 1772 credit bubble worked in the same way, the small banks that honored the promissory notes/bills of credit went defunct because people stopped spending their credit/generating revenues for the bank.", "score": 1, "replies": [{"body": "You know Visa and Mastercards are not banks?", "score": 1, "replies": [{"body": "Yeah, you know we've invented a lot of financial instruments and businesses since 1772, right? Your money isn't a handwritten paper receipt anymore, is it?", "score": 1, "replies": [{"body": "Yeah. They are transferred through a payment network. Which is what Visa is. They don't issue credit. So ass long as you are buying your gay porn and anal lube, visa profits.", "score": 1, "replies": [{"body": "I don't have to worry about buying that lude paraphernalia anymore, I get a subscription through Butt Busters Magazine under your mom's name. She wanted the Air Miles, so I figured hey why not, eh? I'm still rearranging her guts every Tuesday and Thursday evening, so why shouldn't I let her have that win.", "score": 1, "replies": [{"body": "Jokes on you. That's just me in a wig", "score": 1, "replies": [{"body": "That explains the extra dick.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "When will that ETF be on RH? The FNGU or D or whatever", "score": 10, "replies": [{"body": "Showing price today but still not supported ", "score": 3, "replies": []}]}, {"body": "New years for earnings ", "score": 2, "replies": []}, {"body": "DIA 270 .17 expiring feb 2 \nQQQ 174 .28 expiring feb 2 \nAll in ", "score": 2, "replies": []}, {"body": "Fire up your TQQQs", "score": 1, "replies": []}, {"body": "Qqq calls", "score": 1, "replies": []}, {"body": "5 shares of Google baby at $940.", "score": 1, "replies": []}, {"body": "5 shares of Google baby at $940.", "score": 1, "replies": []}, {"body": "Expect there to be a dip a day or 2 before this date.", "score": 0, "replies": [{"body": "samee", "score": 2, "replies": []}]}]}
