{"title": "Exclusive: Tesla output forecast shows jump in Q4, growth through 2023 -sources", "selftext": "", "id": "xs4b5k", "created_utc": 1664551816.0, "score": 87, "upvote_ratio": 0.95, "num_comments": 30, "comments": [{"body": "If true and we assume the rest of the finances weigh out the same ad previously, what type of earnings could we be looking at?  Would this get forward P/E to say 50?  30?\n\nEdit: were are already at forward P/E of 45.  Would this get it to 25?", "score": 6, "replies": [{"body": "Forward pe will look amazing. I’m just worried about the Strong dollar and the slightly lower earnings as a result. Otherwise forward pe would be even lower.", "score": 3, "replies": [{"body": "Tesla's localized supply chains help to protect against foreign currency challenges a little bit I think. Not an expert by any means.", "score": 1, "replies": [{"body": "No, they convert to US dollars for earnings. There should be a noticeable impairment.", "score": 1, "replies": [{"body": "ah, I see your point, in regard to earnings. \n\nI was thinking in terms of hurting demand due to American products becoming more expensive in other countries.", "score": 1, "replies": []}]}]}]}]}, {"body": "Not gonna happen. This article says 495k of just Model 3 and Y. China can account for half of that(~250k). Fremont could do half of what's left (~125k). \n\nBut Berlin and Texas can't put out over 4k a week EACH. \n\nTake all news from Reuters with a grain of salt. They were the ones saying that the Shanghai factory is going to run below capacity. Which Rob Maurer immediately pointed out could be explained that the factory has 6.5 days worth of shifts every 7 days.\n\nEdit:\nUnless Fremont has a decent jump which could happen but I think everyone would be surprised by that and I don't think anyone here would complain.", "score": 12, "replies": [{"body": ">Not gonna happen.\n\nInternal targets are always hard to reach but 495k not impossible. There are risks and challenges but I won't completely rule that out. Here's an optimistic (everything goes as planned) scenario:\n\n* Shanghai: [going from 22k/week now to 30k/week in Q4.](https://insideevs.com/news/611267/tesla-china-factory-production-capacity-updates-complete/) That's 3600/day to 5000/day. If we assume 4000/day average, total production could be **310k+**.\n* Fremont: **135k** with steady improvements in S&X production. Troy has the same estimate.\n* Berlin was 1000/week in June and  [aiming for 2000/week this month.](https://www.teslarati.com/tesla-giga-berlin-2k-model-y-per-week-september-report/) Add another 1000/week from Austin. That's 3000/week combined at the beginning of Q4. [Tesla is targeting for 5000/week by the end of Q4.](https://www.fool.com/earnings/call-transcripts/2022/07/21/tesla-tsla-q2-2022-earnings-call-transcript/) If you take the mid point for average, it will be 4k/week Austin+Berlin = **52k**.\n* Total =  **497k**\n\nNot saying that we should expect it but 495k production number is not out of reach based on available information.", "score": 13, "replies": [{"body": "22.5k a week is the upgraded amount. \n\nShanghai isn't going to 5k a day any time soon.", "score": 2, "replies": [{"body": ">Shanghai isn't going to 5k a day any time soon.\n\nI'm not married to it but that's what the rumor suggests.\n\n>China can account for half of that(\\~250k).\n\nThat will likely be the quarterized weekly rate at the end of Q3. They started upgrading lines on Sep19. It will be disappointing if they stay at the same weekly production rate through the entire Q4.", "score": 2, "replies": [{"body": "> I'm not married to it but that's what the rumor suggests.\n\nWhat rumor?\n\n> They started upgrading lines on Sep19.\n\nWhere did you get that from?", "score": 2, "replies": [{"body": "Posted the link in the previous comment", "score": 1, "replies": [{"body": "That's not what that link says though. It says the upgrades were *completed* on September 19th for 22,000 per week, and then later it just randomly said they're working on getting to 5,000 per day without saying where that info came from.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I give it a low probability … we’ll see", "score": 2, "replies": [{"body": "I don't trust Reuters, but this 495k 3+Y matches with my 500k prediction (3YSX).\n\nThe 1.59M 3+Y in first 3 quarters of 2023 matches with my 2.4M 2023 prediction (1.6M 3+Y for Q1\\~Q3, 0.7M 3+Y for Q4, 0.1M S+X full year 2023).\n\nSo I think the leak is real.", "score": 3, "replies": [{"body": "SX production will be at 20-25k, so this report would be 515-520k whichis a reasponably big difference at an already upper end goal.\n\nAlso 495k of Model 3 and Y and 1.59M for the following three quarters also makes no sense. Will Berlin and Texas just stop ramping?", "score": 2, "replies": []}]}]}, {"body": ">Half that China can do. Fremont could do half of what's remaining.\n\nI can't understand what you are saying.", "score": 1, "replies": [{"body": "Updated with example numbers.", "score": 1, "replies": [{"body": "I see.\n\nGiga Shanghai could do 290k in 90 days at full capacity. Fremont has been working on adding capacity 50%. If they made some progress, 150k 3+y in Q4 is possible, maybe more. Austin and Berlin are hard to predict. Ramp happens in a staircase fashion. I think we will get very close to the 495k number for 3+Y in Q4, plus 20k S+X.\n\nFor long term investors the quarterly numbers are not important. I don't understand why Wall Street gives them so much weight.", "score": 2, "replies": [{"body": "WS has to figure out a way to give value to a company. Quarterly production gives them about the only thing they can value in the company. That's why they care. Almost every step of the way most of WS has doubted Tesla, even many of the bulls. This is why Tesla is such a great opportunity for retail investors.", "score": 4, "replies": []}, {"body": "Fremonts next goal is 14k per week, which includes S and X. \n\nLike I said, those number may be possible but they'd include some unexpected ramps across the board.\n\nAnd ramping quickly is important to long term investors. It shows their capability to ramp and execute.", "score": 2, "replies": []}]}]}]}, {"body": "Would be nice to look at China for comparison, but Berlin or Texas hit a run rate of 1000/week a little bit ago, so 4000/week run rate by end of Q4 doesn't sound crazy aspirational.", "score": 1, "replies": [{"body": "Right but this would be averaging 4000 a week for the whole quarter.\n\nIf this were to happen it would be a combined huge spike in production across Fremont, Berlin, and Austin.\n\nCould be possible but would be very surprising.", "score": 5, "replies": []}]}, {"body": ">Musk and Tesla have a record of pointing to stretch targets the company has not always met.\n\nI don't think they'll get to that figure either, but I do think they'll make a better improvement that the market expects. Probably over 400,000, possibly as high as 410,000.\n\nDon't aim for the moon, aim for the stars. You'll almost certainly hit at least the moon.", "score": 1, "replies": [{"body": "Anything less than 425k Model 3 and Y would be a disappointment.", "score": 3, "replies": []}]}, {"body": "The end of Q3 has seen a lot of shipments instead of local deliveries, I could see this as Tesla pushing everything that they don’t need in Q3 to Q4 in order to have a bit of a surprise to wrap up the year. If they are already hitting their Q3 goals, why not just ship everything else so that Q4 is the best it can be?", "score": 1, "replies": [{"body": "This article is about production.", "score": 2, "replies": [{"body": "Well then yeah, 500k production for Q4 is highly unlikely.", "score": 2, "replies": []}]}]}, {"body": "Just wanna throw this in here. Dave Lee has included all the disclaimers and whatnot inside, but he was talking to Tesla IR while reading the article.\n\n[Straight from the horse's mouth](https://youtu.be/aRs615-8Tck)", "score": 1, "replies": [{"body": "He says Tesla IR said they couldn't comment on the article, and referred him to their public guidance of 50% growth YoY.\n\nTesla produced 930.4k in 2021. 50% growth is 1,395k in 2022.\n\nTesla produced 564k in Q1+Q2 2022. If we credit them with 360k in Q3, that sums to 924k for the year. They'd need 471k in Q4 to hit 50% growth as Tesla has guided.\n\nThe article predicts 495k production **of Model 3/Y alone** in Q4, which would mean total production including S/X of well over 500k, which far exceeds 50% growth.\n\nSo Tesla IR certainly did not confirm this by any means. Rather, they reiterated guidance of a Q4 number likely far lower than the article's prediction (which is all they can do as they can't disclose information privately).", "score": 1, "replies": []}]}, {"body": "Dave Lee just spoke with Tesla IR today, and they reiterated a 250k/yr run-rate from Austin and Berlin, each.  Which would be 4,800/wk each.  So what Reuters is reporting agrees with what Dave Lee is sharing from IR.", "score": 1, "replies": []}]}]}
{"title": "New car sales increasing in a recession ???", "selftext": "According to this Reuters article, the sales of new cars has only been going in one direction, up up up. \n\nhttps://www.reuters.com/business/autos-transportation/us-new-vehicle-sales-increase-strong-demand-report-2022-09-28/\n\n\nBut that goes against **everything** that has been said around the auto industry lately. \n\nBetween the dire warnings of FedEx, Nike and Apple, who are warning of a big overall slowdown in sales due to inflation and supply chain issues, how the hell the Auto industry, the most textbook definition of a discretionary spending, going to survive this ? \nFord and GM sure as fuck hasn't, but i think they still have some room to fall given that recently, in an interview with Yahoo Finance the CEO has said that he expects supply chain + hiring problems to continue into 2024.  \n\nThen there's Tesla. Insane valuation, still very very expensive cars in an inflationary context where people would rather buy food than cars.\n\nThere is a likely scenario that those Pre-orders of model 3s and Ys, start getting canceled, and we get a Netflix 2.0. \nThe way I see it, Tesla and in particular Elon have built up a lot of expectation heading into what seems like the toughest monetary policy in the last decade. They have no room for error. If there is just a hint that the number of cars are going to miss the mark due to some issues, investors will most likely be rushing for the exit. \n\n\nWhat am I missing here ? I'd the automotive industry just fucked right now and puts are sure to print ?", "id": "xry3vs", "created_utc": 1664534876.0, "score": 3, "upvote_ratio": 0.59, "num_comments": 30, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|18|**First Seen In WSB**|9 months ago\n**Total Comments**|347|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/xpew0a/the_rate_hikes_do_nothing_and_its_not_as_bad_as/) \n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xry3vs)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xry3vs)", "score": 1, "replies": []}, {"body": "New cars (factory ordered and not dealership mark ups) are still a better deal than used cars if you have the time to wait for delivery. \n\nUsed car market about to be hit hard since no one is buying at auction and the auction cars keep piling up due to repos. A lot of dealerships will finally get the knife they've been giving to consumers and I couldn't be happier.", "score": 21, "replies": [{"body": "I myself couldn't be happier. I'm in the market for a used SUV for the growing family and I can't wait to buy this dip.", "score": 8, "replies": []}, {"body": "Most of humanity will be happy to see dealers getting what they deserve.", "score": 4, "replies": []}, {"body": "Cox automotive, find out what they own and where all the used cars are...seems crazy you can own most of the auction cars in the US and Kelly blue book.", "score": 1, "replies": []}, {"body": "Used market already falling past in many markets.  That’s why I sold both my cars and not just 1 when my new car arrived. Carvana was locked in at 20k for one of my cars and Tesla was locked at 12.5k for trade in on another. \n\nBoth cars were calued by others at 40% less for each after jsut a few weeks. Soon as I saw that I sold the fuck out of them. They each dropped another few k in the last 3 weeks. Glad i jumped when I did.  \n\nThe used bubble pop will be what fucks the rest quite a bit.", "score": 1, "replies": []}]}, {"body": "I think this report is looking back. Summer was a strong season for sales. But car sales will fall off  a cliff in October (see Carmax) and even EV sales will tank (gas prices headed lower) and supplies of new cars increasing.", "score": 7, "replies": [{"body": "Yeah exactly. That's why this report that came out just w days ago makes no fucking sense to me. It's definitely looking on some old data. Maybe YoY", "score": 3, "replies": []}]}, {"body": "There is more no sales in auction houses now more than ever. look at your used car lots theyre starting to get full again. the gig is up. youll see a massive fall off in sales first quarter next year. if youre looking to sell do it now, if your looking to buy do it next year.", "score": 4, "replies": [{"body": "This is what I'm thinking. Just can't wrap my head around this report painting such a rosy picture.", "score": 3, "replies": []}]}, {"body": "Used cars cost just as much as new.", "score": 8, "replies": [{"body": "No.", "score": 1, "replies": []}]}, {"body": "May the cars be sold and dicks be hard![img](emote|t5_2th52|4276)", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "What I am saying is : we are at a period of transition between what you've described, to a period where everyone has bought their cars, but only now are the automakers able to sell the cars that have been sitting in the lot for months. So they have excess inventory that they have a hard or harder time selling, because people opted for a used rather than new car", "score": 0, "replies": []}]}, {"body": "Inventory catching up with demand.  Sales were artificially low because there wasn't enough supply.", "score": 2, "replies": []}, {"body": "Looks like manufacturers are starting to overcome the covid lockdown induced supply chain issue which is increasing inventory again.  Those $10k covid mark ups are starting to lessen.", "score": 1, "replies": []}, {"body": "If you can find one. Looking at Lincoln suv. They had two on a lot just off the truck. The lot is normally full. No deals. You pay sticker price or move on. Nice thing about it. Got good money for a high mileage ten year old trade in.", "score": 1, "replies": []}, {"body": "credit?", "score": 1, "replies": []}, {"body": "Most manufacturers are booked well through next year. When covid hit and stopped most markets This was equivalent to putting a damn in a river…. \n\nIt created a back log of orders. As well as typical new orders of the manufacture had a normal rate of 100k cars a year covid shut downs and suppliers shortages have made that look more like 150k units a year. It will take a long time to work down that back order with continued supplier issues.  And this is all manufacturing. \n\nAs they now get closer to normal production rate they are obviously selling more units than last year and the year before, if new orders slow down it’s ok because there is still a back log to work through so the numbers/ slow down will not be immediately seen.", "score": 1, "replies": []}, {"body": "Also there is pentup demand due to chip shortage and increasing cost of used cars driving the sales.", "score": 1, "replies": []}, {"body": "Inventory will not catch up to demand unless markets crash. Markets crash - inventory stabilized because nobody buying. What goes up must come down. Auto industry since I was 20. Let’s see what happens.", "score": 1, "replies": [{"body": "JPow doing his part...need about 10 more hikes and used car loans to reach 20%\n\nThat will put a damper on it![img](emote|t5_2th52|4641)", "score": 1, "replies": []}]}, {"body": ">But that goes against everything that has been said around the auto industry lately.\r  \n\r\n\nin a world where used cars are as expensive if not more so then new this isn't actually all that surprising. Its likely that the new market is just gobbling up market share from the secondary market rather then consumers pockets being so fat they are shelling out for new vehicles", "score": 1, "replies": []}, {"body": "I bought a new car 3 weeks ago.  Gonna buy another in a couple months.  Nbd there’s always car sales. Doubly so since there are so many new orders in back order. Took me 80 days to get mine.\n\nEdit to me clear: model y performance w/ all upgrades.  I qualify for tax credit next year.  But fuck waiting.  Gonna spend my gains now not later lol", "score": 1, "replies": []}, {"body": "I think it makes sense. In high inflation and hot printed economy, you need to run so fast to make money, the most obvious need is a car", "score": 1, "replies": []}, {"body": "The Media does not exist to inform *you.*", "score": 1, "replies": []}, {"body": "Buy a new car or a used car for the same price....hmmmm let me think about it", "score": 1, "replies": []}, {"body": "Tesla continuing to crush it.", "score": 1, "replies": []}, {"body": "It’s the manipulative wording.\n\nNew car sales are increasing!*\n\n*because used cars are ridiculously overpriced and 2017s are selling for the same price as 2022s. Consumers aren’t completely brain dead and are buying new cars for a marginally higher price with significantly less miles and added features.", "score": 1, "replies": []}]}
{"title": "Cheniere LNG 🚀🚀🚀", "selftext": "Ok regards. Stop playing with your primate balls for a minute and lookup ticker LNG. This company is about to explode to the upside because of your favorite psychopath, Vladdy Putin. Ukraine petitioned to join NATO today because he took over and “annexed” 4 parts of Ukraine and now claims they’re part of Russia. He promised to protect Russia by any means necessary while they invade neighboring innocent countries unprovoked. Europe is beyond fucked. Inflation and fuel costs are nuts and their liberal regarded governments and central banks can’t stop shit. So companies like LNG based in Texas, constantly delivering gas as the weather cools down will profit big time. Revenues and EBITDA will continue to get pumped up faster than R.Kelley taking Viagra Heading to an elementary school playground. We like….no…..WE LOVE THE STOCK!!! 🦍🚀", "id": "xs7bpy", "created_utc": 1664559196.0, "score": 13, "upvote_ratio": 0.85, "num_comments": 30, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|1 month ago\n**Total Comments**|11|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/xs7bpy/cheniere_lng/) [x](https://www.reddit.com/r/wallstreetbets/comments/xrfkj5/cheniere_energy_lng/) \n**Account Age**|6 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xs7bpy)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xs7bpy)\n    \nHey /u/SammyTheBull2022, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "Sh....should we give you guys some privacy?", "score": 2, "replies": []}, {"body": "YUP.", "score": 2, "replies": []}, {"body": "100% agree LNG is the place to be for the next few months. Also take a look at NextDecade Corp they are a up and coming LNG exporter. They stock is much cheaper than cheniere and just had a huge pullback. $NEXT is preparing for their FID and if they pull that off this stock could rocket. $NEXT", "score": 2, "replies": []}, {"body": "I've been investing since many years ago. The point is to put your money where the money is going at the moment, and now, energy and exactly, LNG is where the money is going. Put it there!", "score": 2, "replies": []}, {"body": "This is the second account I’ve seen like this within the last half hour. Under a year old and has only posted about one company, LNG. Keep your bananas peeled and your eyes split everyone.", "score": 1, "replies": [{"body": "So with the bombing of the two pipelines, EU is in essence reliant on US gas moving forward. Shipping plus LNG companies might actually be the future. The accounts are sus tho.", "score": 6, "replies": [{"body": "Fair enough. Thanks for sharing!", "score": 1, "replies": []}]}, {"body": ">within the last half hour. Under a year old and has only posted about one company, LNG. Keep y\n\nAt one point when WSB was all over the media, and attracting all sorts of normies, I remember the mods asking an about 10k karmas for new joiners. What happened?", "score": 2, "replies": []}, {"body": "Fellow apes. Here you have someone who is scared of the sky falling. Suppressing free speech and attacking someone’s frequency of posting rather than reading and actually formulating an opinion on the content. GFY", "score": -2, "replies": [{"body": "Lol stfu. I didn’t suppress shit and didn’t attack anything. Just pointing out facts. But go ahead and cry about it. No one here cares about your feelings.", "score": 6, "replies": [{"body": "I’ll reiterate. GFY.", "score": 0, "replies": [{"body": "But you can’t reiterate anything else you said because you know it’s all bologna :)", "score": 1, "replies": [{"body": "Boh Log Nah", "score": 2, "replies": [{"body": "That’s right boiiiii", "score": 2, "replies": []}]}, {"body": "You don’t have to buy the stock. You don’t have to profit. Just do yourself a favor and do some research before doubting anyone else’s. Do you have a counter argument. Do you even have an opinion? If not gtfoh", "score": 0, "replies": [{"body": "Just curious why you created an account to only post about this stock…or so it seems.", "score": 1, "replies": [{"body": "Created my account after scoring on bbby and GME. Why is that relevant? LNG is a new stock I like. What stocks do you like and why? (Or do you not have an opinion on any stocks either?)", "score": 1, "replies": [{"body": "It’s relevant because I said your account was suspicious and asked for some info to see if I was in the right direction. GME is the only stock that matters in the market at the moment.", "score": 1, "replies": []}, {"body": "Hey kids I like GME and BBBY just like all of you", "score": 1, "replies": []}]}]}]}]}, {"body": "I’ll reiterate. Go cry about it:)", "score": 1, "replies": []}]}]}]}]}, {"body": "Do you think we should be worried about the negatives EPS it has had for the 3 consecutive quaters that preceeded the last one?", "score": 0, "replies": [{"body": "No, if you look its FCF since 5 years ago, you can see that they earning money. Imagine what amount, now, with NG at this level", "score": 1, "replies": []}]}, {"body": "Isn't Russia part of the permanent security conseil? How would that work out for Ukraine, when Russia has a permanent veto right? I remember when other countries wanted Bengladesh to join the security board and China systematically used their veto to vote no, every single times.", "score": 1, "replies": []}, {"body": "I got me some #GLOP and #LPG months ago.   Neither have survived this weeks bath though.    Look at the volume on #HMLP today....", "score": 1, "replies": []}, {"body": "Man you must be the luckiest trader. The second you posted this it started going down!", "score": 1, "replies": []}, {"body": "Um, not that I'm a knowledge base of DD's, except mammalian ones, but this DD sounds more like an advert.", "score": 1, "replies": [{"body": "Sure is", "score": 1, "replies": []}]}]}
{"title": "Cramer just said \"DO NOT TOUCH ALIBABA\" Why you should do the opposite.", "selftext": "1. It's CRAMER. Just inverse him and make money. \n2. If you hate CHINA's regime, you should invest in ALIBABA. It's CEO, Jack Ma, hates China's current regime  and spoke out AGAINST them, which started an unprecedented tech crack down and is one  reason why it's currently so cheap.\n3. Now for the technicals. $BABA has $70 BILLION dollars in cash which represents over 30% of it's current market cap. That is BONKERS. For comparison, Amazon is at 5%, Apple is at 2%, and Tesla is at 2%\n4. $BABA makes over 20 billion a year in operating cash flow. That means in 2 years, with the cash in hand, buy HALF of it's entire shares back. They are a cash MACHINE, making more money / year than amazon and many other companies with higher valuations.\n5. BABA is dirt cheap. Trading at 50 cents on the dollar when considering all of it's assets, including ANT.\n6. It is trading near the same price at it's IPO, yet it has grown considerably. At IPO it had 200 million users, now it has over 1.2 BILLION.  \n7. Alibaba, as a brand, ranks in the top 10 list globally, surpassing the likes of McDonald's, Tesla and Coca-Cola.\n8.  Alibaba has essentially given up all of its gains since its IPO in 2014. In other words, Alibaba has been 'dead money' for almost a decade. However, unlike its share price, fundamentally, Alibaba has made remarkable progress on multiple fronts. Most notably, Alibaba has turned into a cash flow machine, with cash from operations increasing tenfold since its IPO, which in turn has led to a soaring cash balance, making the company cash rich. \n9. China is having their 2009 crisis. Real estate market in shambles, political turmoil, have pushed the HSI indexes to their lowest level in decades. China is currently EASING while the entire world tightens. They are enacting fiscal stimulus, lowering rates, and telling banks to buy their own markets. This depressed last will not last forever. Investors with 10 year horizon will stand to make a fortune.\n10. Just do your own research on how much money BABA makes compared to their market cap and compare it to other stocks and you will see that BABA truly is the cheapest stock on the market. \n\n&#x200B;\n\nIn conclusion, political turmoil, china's zero covid policy, and other global factors have wreaked havoc on the share price of $BABA, but has been pushed far below fair value\n\nIt seems to me that, based on today's valuation, that the market believes that Alibaba will start shrinking over time. This doesn't really make sense and, unlike others, I see the sell-off over the past couple of years as an opportunity. Alibaba itself is also taking advantage of the sell-off by going as far as to authorize the largest share repurchase program in its history. In short, I feel extremely comfortable with Alibaba's massive operating cash flow, which, over time, translates into an ever-increasing cash position, thus further strengthening the balance sheet. This will no doubt help the company, not just weather the storm, but also to thrive.", "id": "xsbtdf", "created_utc": 1664570072.0, "score": 18, "upvote_ratio": 0.68, "num_comments": 33, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|20|**First Seen In WSB**|1 year ago\n**Total Comments**|92|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/nwz1bv/hedge_funds_now_short_32_of_sens_oh_and_i_have/) [x](https://www.reddit.com/r/wallstreetbets/comments/l2klao/invest_in_a_company_that_will_help_cure_all/) [x](https://www.reddit.com/r/wallstreetbets/comments/nw0hif/huya_possibly_70_short_and_half_value_in_cash/) [x](https://www.reddit.com/r/baba/comments/pc4g26/the_best_bargain_in_the_entire_market_its_not_in/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) [x](https://www.reddit.com/r/wallstreetbets/comments/nwzmjz/sens_32_shorted_can_be_a_10x_candidate_from_here/) [x](https://www.reddit.com/r/wallstreetbets/comments/o5n5vx/surface_oncology_the_cheapest_biotech_around/) [x](https://www.reddit.com/r/wallstreetbets/comments/nqphot/bet_on_life_bet_on_surface_oncology/) \n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xsbtdf)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xsbtdf)", "score": 1, "replies": []}, {"body": "Pretty crazy how regarded you are.\nJack Ma NOT the CEO. He left years ago\n\nCPC don’t like Baba\n\nAlthough the cramer thing is pretty bullish…", "score": 24, "replies": [{"body": "Its CCP", "score": 1, "replies": [{"body": "It’s PCP", "score": 3, "replies": [{"body": "A whole gallon of it.", "score": 2, "replies": []}]}]}]}, {"body": "After losing money on GETY and BBBY, I might as well follow this advice too", "score": 12, "replies": []}, {"body": "Jim Cramer is the type of guy who would say something racist and then follow it up by saying it's okay because he's got a friend who's that race.", "score": 7, "replies": []}, {"body": "I love that you tell people about the financial performance of a Chinese company as if you have any clue how legitimate a single number of theirs is, then you have the audacity to demand others do their own research just showing how ignorant you are to the impossibility of researching Chinese companies yourself without traveling to China and inspecting their operations yourself.", "score": 7, "replies": []}, {"body": "You forgot one small risk. What happens when china attacks taiwan and gets sanctioned by the entire western hemisphere.", "score": 8, "replies": [{"body": "IF China attacks Taiwan we got bigger things to worry about than BABA’s share price.", "score": 5, "replies": [{"body": "That's what I thought about some russian company bonds... Not my best decision to keep those (already had them for multiple years)", "score": 5, "replies": [{"body": "The US hasn’t promised to defend Ukraine against incursion for the last several decades. China Invasion of Taiwan would have much more global ramifications", "score": 1, "replies": [{"body": "Both countries have nuclear weapons. It should be assumed that it will be an economic war rather than a hot war.. We'll be entering the cold war 2.0 and the new Cuba will be Taiwan..", "score": 2, "replies": [{"body": "Very likely what ends up happening. Hopefully no Tonkin Gulf incidents", "score": 1, "replies": []}]}]}]}, {"body": "You mean BBBY, right?", "score": 1, "replies": []}]}, {"body": "This.", "score": 2, "replies": []}, {"body": "If that happens, we won't be able to retire anyways.", "score": 1, "replies": []}]}, {"body": "Finally, some logic around BABA.  It’s a buy buy buy", "score": 1, "replies": []}, {"body": "Munger invested in BABA for long term", "score": 1, "replies": [{"body": "Except he dumped almost all of it for a MASSIVE loss.", "score": 7, "replies": []}, {"body": "You forgot to mention that Munger also paperhanded the majority of the position", "score": 3, "replies": [{"body": "Munger doubled down with margin and tax loss harvested.", "score": 2, "replies": []}]}]}, {"body": "Literally everything you just said expect number one is complete bullshit. Even IF any of it remotely true it doesn’t matter because\n\n1 You don’t own an actual share so you have ZERO rights.\n\n2 A middle level Chinese bureaucrat can wake up one morning and just simply decide to completely fuck over Baba or it’s shareholders or just the foreign investors.\n\n3 It’s just a crapshoot if American regulators delist it.", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "pretty sure ccp forced him to sell ownership of the company to...the ccp", "score": 0, "replies": [{"body": "Plenty of things to bash the OP and BABA about we don’t need to make shit up 🤡", "score": 1, "replies": []}]}, {"body": "I actually think this isn’t a half bad idea. Lol. 2024 leaps?", "score": -1, "replies": []}, {"body": "Fasho I’ll make sure to buy some long dated call leaps when the market find its bottom.", "score": 1, "replies": []}, {"body": "Just bought ah lol", "score": 1, "replies": []}, {"body": "Me too.", "score": 1, "replies": []}, {"body": "Open up from zero covid daddy xi. I’m stuck at home", "score": 1, "replies": []}, {"body": "Been waiting for him to say this\nEnd 4th Qtr 120 next year 200 now!!", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "xsc9xc", "created_utc": 1664571179.0, "score": 1, "upvote_ratio": 0.51, "num_comments": 37, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xsc9xc)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xsc9xc)", "score": 1, "replies": []}, {"body": "Oh my fucking God I'm sick of this post", "score": 38, "replies": [{"body": "So do you think it will?", "score": -14, "replies": [{"body": "Yes", "score": 5, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Nice.. how much do you make?", "score": -3, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}]}]}]}, {"body": "Crashing like your wife's boyfriend's Maserati into your garage door.   A show of dominance", "score": 10, "replies": []}, {"body": "Reading is not this subs strong suit.", "score": 5, "replies": [{"body": "Yes indumpsterdidly", "score": 1, "replies": []}, {"body": "If they could read this comment they’d be very upset", "score": 1, "replies": []}]}, {"body": "Probably not like 2008 banks were on the brink of collapse, but prices will be down low in the next 6 months. Inverse ETF's and Puts are good plays.\n\n5 Year IPO stock bubble pop appears to be happening, COVID stock reversals, higher interest rates are dropping prices in strong companies, lower demand, poor Q3 /Q4 earnings, and the wait to see which company will survive is on the horizon.\n\nBest to stay out of stocks with extreme debt to equity ratios, or have no way of alternative funding.\n\nIt will be a circus of watching to see who collapses first. Get some popcorn and butter ready.", "score": 18, "replies": [{"body": "Undrated comment⬆️⬆️⬆️", "score": -4, "replies": [{"body": "Andre", "score": 1, "replies": []}, {"body": "Highly overrated comment", "score": -1, "replies": []}]}]}, {"body": "As long as it isn't the 2000 bust nasdaq down 83 percent", "score": 3, "replies": []}, {"body": "This has been asked like 500000 times in the past day bruh", "score": 5, "replies": []}, {"body": "No.", "score": 5, "replies": []}, {"body": "![img](emote|t5_2th52|4886)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4259)", "score": 2, "replies": []}, {"body": "That seems to be the consensus. Gotta hold out till the stimulus checks come out", "score": 2, "replies": []}, {"body": "No. Not like 2008. Worse than 2008.", "score": 3, "replies": [{"body": "Nice", "score": 1, "replies": []}]}, {"body": "Thanks", "score": 1, "replies": []}, {"body": "Crash and burn 🔥", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "Fuck sake, no.", "score": 1, "replies": []}, {"body": "If we say yes, will that affect your moves?", "score": 1, "replies": [{"body": "Yes sell everything.", "score": -2, "replies": [{"body": "Market will crash.", "score": 1, "replies": [{"body": "Sold. Thanks", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Ja hallo?", "score": 1, "replies": []}]}, {"body": "Even world of warcraft released again", "score": 1, "replies": []}, {"body": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4641)", "score": 1, "replies": []}, {"body": "I think is posible:\n\nhttps://www.sharecafe.com.au/2022/09/29/unprecedented-bank-of-england-intervention-avoids-lehman-style-event/", "score": 1, "replies": []}, {"body": "Shtupid (said exactly as spelled)", "score": 1, "replies": [{"body": "Toxic", "score": 1, "replies": []}]}]}
