{"title": "Elon Musk’s most recent email to Tesla employees", "selftext": "", "id": "va8gev", "created_utc": 1654987444.0, "score": 445, "upvote_ratio": 0.96, "num_comments": 69, "comments": [{"body": "Now we have a base for Berlin (1000 per week), excited to see the next increase in production.", "score": 54, "replies": []}, {"body": "This is the sort of Elon i like and would like to see more off. Not the \"if you are working from home you can get fucked despite it happening during corona and it didn't stop Tesla from setting new records\" Elon.", "score": 80, "replies": [{"body": "Building cars has never been done from home. Designing and development may be something that's difficult to complete off-site, which would explain delays in CT, semi, Roadster, and the 4680 ramp. I don't know that for certain, but it would make sense to me.", "score": 47, "replies": [{"body": "yeah my work can be done anywhere since I just need MS Teams and Github connections. But anything with real-world inputs and outputs needs to be onsite no doubt.\n\nManagerial is a bit of a gray zone since managers can manage remotely, but Elon wisely doesn't want that.", "score": 34, "replies": [{"body": "Elons email was only to management only, and was, like usual, applied out of context by people with an axe to grind.\n\nI'm in management myself and my company has a complete freedom WFH policy at the moment. It's definitely not nirvana. Personally I think its fine for very task orientated roles to work from home, though I still think 1-2 days in office is very important for team bonding/morale. But that's very different to senior management, where a large portion of your role is communication and collaboration.\n\nElon is mostly right, if you're in a leadership position, you need to be visible and you need to lead by example. We have a couple of ineffective leaders that hide at home at the moment and their departments are absolutely falling apart. It just doesn't work. A bit of flexibility is nice but in general, exec leadership should be in a minimum of 2-3 days or they will struggle to perform.\n\nHe should have said it with a bit more diplomacy. Though at the same time, at the leadership level, things are a bit more brutal, we don't need to be mollycoddled, we are paid well enough that if you don't like it you can go back to a lower level where there's less conflict.", "score": 28, "replies": [{"body": ">Elons email was only to management only, and was, like usual, applied out of context by people with an axe to grind.\n\nYou missed the followup e-mail?", "score": 9, "replies": []}, {"body": "Email was not only for managers. I love how people make things up with absolute confidence. Another sheep in the echo chamber.", "score": 1, "replies": []}]}, {"body": "Which is better? MS Teams or Zoom or Slack?", "score": 1, "replies": [{"body": "only use Teams so don't know . . .", "score": 1, "replies": []}, {"body": "Zoom....", "score": 1, "replies": []}]}]}, {"body": "That's the dumbest take I've heard in a while. If a AI engineer wants to do some complicated math and can't do it well in a noisy 50 people open space where he gets interrupted by stupid question and Bobs microwaved fish, let the man work from home ffs. No one ever said to build the cars in your living room.", "score": 4, "replies": []}, {"body": "I doubt any of the people involved in the design or production of those are work-from-home on a daily basis... Hell the Semi and Roadster were announced in 2017 and haven't been brought to production, they're having a hard time ramping 4680 is my guess. Maybe elon just needs to work and sleep in the office again and yell at people to make it happen. Instead of playing video games and tweeting.", "score": 2, "replies": [{"body": "New products were wisely delayed, because Tesla is production constrained. New products would’ve merely stolen sales from model three and model Y.", "score": 2, "replies": [{"body": "The Cybertruck, yeah. That pricing was great and will likely be much higher now. But the roadster and Semi aren't competitors to the 3/Y", "score": 1, "replies": [{"body": "It’s not about competitors.  Tesla is growing production > 50% year.  This is historically unprecedented.  Never in history has a large manufacturer achieved this. Tesla cannot start growing production even faster than they’re already doing by by ADDING on Semi or Roadster.  They CANNOT grow faster.  So producing Semis and Roadsters would by necessity steal volume from producing 3&Y.\n\nYes I’d love for Tesla to keep all model production the same and just add more production of more models, but they’re already achieving the impossible.  They CANNOT do more.", "score": 1, "replies": []}]}]}]}, {"body": "Of course. But plenty of jobs absolutely can, and maybe should, be from home. This blanket ban solves absolutely nothing and just makes the lives of the workers needlessly wasteful and ineffective.", "score": -4, "replies": [{"body": "Exactly.\nAs a software dev I'd drive an hour into work each day, only to join MS Teams meetings with people in various parts of the country also in their offices.\n\nWhat's the point in that?", "score": 3, "replies": [{"body": "I’ve seen Office Space, it’s so your boss can smugly announce your working this weekend.", "score": 1, "replies": [{"body": "Office Space is a 20 year old fictional movie.\n\nIt's a different world now.\n\nSometimes weekend work is needed, but you can either get credit for that time or get OT for an already high salary.\n\nPlus it's an employee market in tech, there's more work than people to do it", "score": 0, "replies": [{"body": "“Yaaa…..Have you seen the memo?….I’ll send you a copy.”", "score": 1, "replies": []}]}]}]}, {"body": "Absolutely true. No reason to down vote a logical comment. \n\nIt's obvious manufacturing can't be done from home... but writing software can.. as for real world input for software....its all mocked/stubbed/simulated up until a rw test. Admin staff... managers... all from home. Productivity does not go down when wfh... infact in some cases it goes up!", "score": 2, "replies": []}, {"body": "Or most of their jobs are hands-on whether it's building, designing, or implementing.", "score": 2, "replies": [{"body": "the biggest advantage of Tesla is that there is very little distance between the designers and the assembly line.  This includes SW developers that finally saw what are the effects of their work in the real life, and not just in a video game.\n\nThis is not a blank endorsement of Tesla policies, just an observation. The company I work for an myself are struggling to find ways to redesign the product cycle around remote presence. It is not easy, and we had to re-tool and we still do not know if it will work. Also, strangely enough, low performers popped up to \"my attention\" easier from remote than when they were in presence, while we did not see any difference in the output of the high performer, besides that we all need to learn that remote does not means tasking.\n\nJust a consideration.", "score": 10, "replies": []}]}]}, {"body": "Mate, most things had never been done from home up until the pandemic. That’s not an argument.", "score": 0, "replies": []}, {"body": "Sure but denying reality during Covid and supporting the trucker convoy is some inexcusable shit.\n\nElon has a reputation for being woke. He has lived his life rejecting the status quo, and wanting to bring us into the future. \n\nTurning around and speaking against “wokism” and then repeating right-wing propaganda makes it seem like his brain has cracked. It would be like if Bernie Sanders, out of nowhere, started loudly voicing that we should all stand during the national anthem at sports events. It’s just out of character behavior that makes it seem that everything up this point was a facade.", "score": -2, "replies": []}, {"body": "Delays in new products were based on the EXTREMELY WISE decision that since Tesla is production constrained, those new products would have only stolen sales from existing products and resulted in fewer profits since they would have been adding complexity.\n\nThe only time they should introduce new products is when it is necessary to maintain their growth rate.\n\n4680 delays are likely because of struggles, but Drew pointed out that chip supply shortages resulted in a 2170 glut, and they were thus able to take more time with the 4680 ramp (to dial in more improvements or greater yield).", "score": 1, "replies": []}, {"body": "Haven't the delays in CT and Semi been mostly about being cell constrained? It always seems Tesla is cell constrained but they only build enough cells for the production needs of cars at that moment, not scaling cell production faster than car production, which you'd need for cell hungry models like CT and Semi and energy storage products.", "score": 1, "replies": []}]}, {"body": "Elon’s always said what’s on his mind without a filter.  I think he could benefit from a PR person, but then it wouldn’t be authentic Elon.", "score": 9, "replies": [{"body": "At least you know he’s means it when he says “great stuff”", "score": 3, "replies": []}]}, {"body": "Stop pushing this fairy tale narrative. NO you cannot build cars or create world-changing work from home. it is not going to happen. \n\nThe workers had to come back to work, there is no other way around it. And thank god Elon dared pushing this. I am an investor in TSLA, the faster Tesla moves the better.", "score": 4, "replies": [{"body": "> NO you cannot build cars\n\nI never said one could.\n\n>The workers had to come back to work, there is no other way around it. And thank god Elon dared pushing this. I am an investor in TSLA, the faster Tesla moves the better.\n\nAgain, Tesla, and TSLA, set records during covid so clearly there is a way around it. It is not either or. Plenty of jobs can be done from home just as efficiently if not more so.\n\nIt is not a \"fairy tale\" to have some working from home some days of the week when it has clearly been demonstrated by Tesla during covid and plenty of companies are sticking to it post covid.", "score": -2, "replies": [{"body": "You seriously don't get it mate. Of course they will move MUCH faster if they come in to the office. There is no other way around it: that goes for the factory workers and it goes for the designers, the programmers, engineers etc. \n\nEverything else is.... a fairy tale story. ohhhh soooo sad for the employees to be demanded back to their workplace.", "score": 2, "replies": [{"body": "It's definitely not true for programmers.", "score": 1, "replies": []}]}]}]}, {"body": "What corona are you talking about?", "score": 0, "replies": []}, {"body": "The success in 2020-2022 was from the engineering work in the years leading up to that. There’s always a delay in engineering to implementation.", "score": 1, "replies": []}, {"body": "Damage control is what it is", "score": 1, "replies": []}]}, {"body": "Source : https://twitter.com/heydave7/status/1535749119968325632?s=21&t=tDCLzVX2-wpV8U64alEJGw", "score": 11, "replies": [{"body": "This cheers me up quite a bit.", "score": 4, "replies": [{"body": "nah this basicly means the earnings Will go below expected", "score": 2, "replies": [{"body": "Buying opportunity", "score": 1, "replies": []}]}]}]}, {"body": "As a Tesla investor... I just want a happy workplace. Because I am a human being...", "score": 12, "replies": [{"body": "Honestly, I don't think it's a very healthy place to work in.", "score": 0, "replies": []}]}, {"body": "What is spooling up?", "score": 10, "replies": [{"body": "A common phrase meaning starting from nothing and increasing in velocity.\n\nProbably comes from watching thread being wound on spools.  because the diameter of the starting spool is small, the amount of thread being wound upon it is small.  As the thread is wound upon the spool, the diameter gets bigger, and therefore the amount of thread per revolution is greater.....\n\nSo the more thread that is wound upon the spool, the faster it goes even though the spool is turning at the same speed.", "score": 29, "replies": [{"body": "Along the same lines as exponential growth... I think. \n \nHmmmmm is the spooling example exponential? Or linear with a slope of 2 x thread thickness. \n\nI think the new diameter is linear as a function of # of rev. But total thread in spool must be exponential as a function of revs?\n\nEdit: rope to thread", "score": 4, "replies": [{"body": "Rate of spool increases linearly\n\nAmount spooled increases quadratically", "score": 10, "replies": [{"body": "Right! Thanks for humouring me.", "score": 2, "replies": []}]}]}]}, {"body": "It’s used in aviation where the thrust response from a jet engine lags throttle input as it “spools up” (the turbine speeds up)", "score": 2, "replies": []}, {"body": "Spool up the FTL drives and be prepared to jump to hyperspace on my markn", "score": 1, "replies": []}, {"body": "Think of the time it takes for an old hard drive to really get spinning. That's spooling up.", "score": -1, "replies": []}]}, {"body": "If there’s one thing I love, it’s Elon’s open communication. This gets my respect no matter what.", "score": 4, "replies": []}, {"body": "This Elon is so much more enjoyable than the pretend free speech warrior; the guy miring himself in tweet fights and politics. He’s so brilliant and can spend his time perfecting and commercializing these emerging technologies instead of becoming a partisan hack.", "score": 2, "replies": []}, {"body": "So Berlin was much faster than Texas in the end?", "score": 1, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "Good point", "score": 1, "replies": []}]}]}, {"body": "Need to vent.\n\nScrew you Elon, crowing about record production while favoring some customers and screwing over others. Telling customers, you want your car, buy the fsd option etc. Ordered my LRMY in the US on August 1 of 2021. Originally had a delivery date of “November.” It kept being pushed back. Eventually (by about late January), they changed it one last time to “June.” Stayed as June until today when they changed estimated delivery to September. I talk to a sales rep every month or so to confirm nothing is wrong on our end, they always say no, it’s the “chip shortage, you don’t need to do anything but wait, we cannot promise anything.” Sales reps blaming chip shortage implies that the decline in Fremont production due to chip shortage is equal to 10 months production. Which is absurd. \n\nI ordered when I did due to a lease ending January 28, 2022.\n\nEdit: fyi in reference to the obnoxious messages sent me, I’m not a troll, I’m a mod here.", "score": -52, "replies": [{"body": "🧀🍷?", "score": 7, "replies": [{"body": "Yeah. Funnily enough, the only viable option imo (which I don’t want to do because I actually love my job) is to just use my Tesla investment to retire now and move to Italy where there is plenty of wine and cheese. Where we are planning to move to when that happens, we would not need to own a car. 😀\n\nWithout retirement, I want an EV and currently no other product option I consider a reasonable alternative on the market.", "score": 0, "replies": []}]}, {"body": "Pony up for a higher margin car or sit at the back of the line, that is how it works when things are supply constrained.\n\nNot sure why you're bitching about this in an investor sub?", "score": 7, "replies": []}, {"body": "I ordered in June 26th 2021 and just now scheduled to get my car next Sunday. I was just as frustrated as you were but I guess there are people that have been waiting even longer than you.", "score": 5, "replies": [{"body": "April of last year\n\n\nOh well, raise prices 🤷‍♂️", "score": 2, "replies": [{"body": "For me it’s not the wait. The number one reason I HATE car dealerships is that the people who work at them are usually trained to lie to their customers.\n\nWith Tesla, my reaction has been “just tell me the truth so I can make the proper plans.” Just tell me low option purchases will be continuously bumped to the back of the delivery line. I probably would have paid for FSD if I had known it would have gotten me the car 10 months earlier.", "score": -2, "replies": []}]}]}, {"body": "If you need it that badly cancel it and buy used", "score": 3, "replies": [{"body": "I already bought another car (2018 Honda Accord Touring with 32k miles for $16,000; I am in a small market where most people just slap a “for sale” sign on their car outside their house, being in a small market is one reason I suspect being a low priority customer for Tesla). \n\nHad to, the wife needs a car. Eventually, I’ll probably sell the Y if Tesla ever agrees to deliver a car to me before my Cybertruck delivery is ready.", "score": 1, "replies": []}]}, {"body": "Was your LRMY specced with the standard rims?", "score": 1, "replies": [{"body": "Yes. Everything standard except choosing black as color.\n\nEdit: wow, even my wife’s choice of color is being downvoted. She thought it worth the extra $1000, she hates white cars. At least saved $500 from ordering now because is now $1500 option.", "score": -1, "replies": [{"body": "What seems obvious but no one seems to be talking about is when you ordered your car the wait was likely 18 months, they promised less because most wouldn’t place an order if they knew they had to wait that long.   Maybe Tesla should be honest, but some percentage of customers cancel and the longer the wait the more cancellations they’ll get so …\n\nAdditionally in order to maximize profits they are prioritizing Performance and additional options as you mentioned.  My wife is in the same boat, it sucks, but it is what it is.  It’s very popular product which is also being affected by supply chain issues.\n\nBy the way, these customer rants don’t attract nearly as much sympathy here as they do in the TeslaMotors sub.", "score": 6, "replies": [{"body": "Yeah. I was not looking for sympathy, since I knew I wouldn’t get any from the hordes of new folks on this sub. Even if the company was honest with customers and they would get order cancellations, I feel that demand would still overwhelm supply for now.\n\nDespite being motivated mainly by the need to vent, I felt it relevant to this sub because:\n\nThis sub’s membership argument: Tesla’s best marketing is the customer experience. (See satisfaction ratings.)\n\nAnother of this sub’s argument: Absurdly bad customer experience doesn’t matter because too much demand. (Demand is infinite and forever.)\n\nMy investment returns are obscene, but I would never tell a friend to order a Tesla at this point. (And my order has several interested. Heck, one friend was REALLY looking forward to a road trip with my wife in July to try out the Tesla, which is now going to happen in a Honda.) I would advise to buy a used Honda Civic and wait 3-5 years to see if you can actually buy a Tesla or what other EVs are available for actual purchase by then.", "score": 2, "replies": []}]}, {"body": "Hmm black with standard rims maybe whats delaying your order. \nWhite with induction wheels may have shipped by now. \n\nThey are optimizing deliveries for gross margin, which sadly results in a experience like yours.", "score": 1, "replies": []}]}]}]}, {"body": "So as we all know there is a shortage in chips and production parts which is why there is such a shortage… but if daddy elon is worth $260,000,000,000 can’t he just open his own plants and make chips? He’s got the money", "score": 1, "replies": []}]}
{"title": "The market will hit new highs eventually.", "selftext": "The elite/billionaire/politicians need the market as much as the plebs, how else will billionaires continue to get richer? how can they borrow against their stock while avoiding capital gains taxes? \n\nElon musk is valued at 222billion right now. He has 175mil shares in tsla at say $700 which comes to 122.5b in value, market goes to 0 and he loses 122.5b and his company will not survive with supply chain issues and the fact that the average person struggling cant afford an expensive car.\n\n\nHow can the rich get richer without the market? you all screaming like the market will never go on a bull run again and if that is the case than the rich will become as poor as us eventually because not only does the value of the stocks they hold go down but the very company that they own is destroyed by lack of customers (unless its essential goods and services)\n\nWe want it to be worse than 2008. We want to buy the shares for piss poor price for our future. In 2008 people lost everything cause they sold. The other people who lost houses and shit shouldnt even have had them in the first place because regardless of what was happening in 2008 you should of been able to afford to pay your mortgage regardless, no body told you to cough up 2x, 3x of the mortgage per month, you just couldnt afford the mortgage because of the shady shit the banks were doing with vetting people when they applied for mortgages.", "id": "v9vhpy", "created_utc": 1654946427.0, "score": 6, "upvote_ratio": 0.53, "num_comments": 78, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|53|**First Seen In WSB**|1 year ago\n**Total Comments**|928|**Previous DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=v9vhpy)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=v9vhpy)", "score": 1, "replies": []}, {"body": "Eventually can mean 10 years from now", "score": 53, "replies": [{"body": "Since 1922 the longest bear market was 600 days. \n\nlol 3650 days bear market? ok..", "score": -31, "replies": [{"body": "Dow jones closed 1928 to 300 points. Next time DJ closed to over 300 points was in early fifties.", "score": 30, "replies": [{"body": "It was going to be significantly less than that without WWII. \n\nSure, we may have WWIII but no way it’ll take 30 years to recover without a full out world war. And… if we have a world war… well… I guess your puts won’t matter either.", "score": -1, "replies": [{"body": "Look to Japan for inspiration.\n\nhttps://www.afrugaldoctor.com/home/japans-lost-decades-30-years-of-negative-returns-from-the-nikkei-225", "score": 6, "replies": [{"body": "US economy is distinctly different from Japan tho", "score": 2, "replies": []}, {"body": "Ohhh the good old moving the goalposts.", "score": -2, "replies": [{"body": "How is it moving the goal posts? Post is about markets eventually hitting new highs. Well if you were a buyer in Japan 30Yrs ago you might still be waiting.", "score": 1, "replies": [{"body": "My response is too the example of the DJIA post-1928. You are now adding a completely different comparison trying to invalidate my previous response.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You need to look at how long it takes a company, that survives delisting, to get back to the same, adjusted for time, price levels.", "score": 12, "replies": []}, {"body": "Yeah but it took 25 years for the markets to recover back to where they were after the 1929 crash. Just bc the market stops bottoming and slowly starts to recover doesn't mean it's back to where it was in 600 days lol. It can take 25 years.", "score": 10, "replies": []}, {"body": "You're so retarded even for this sub. Just look at the spy and zoom out. Took nearly 6 years for it to recover to highs after the dot com and 08 crisis.", "score": 6, "replies": []}, {"body": "Look up 2000-2008![img](emote|t5_2th52|4271)", "score": 5, "replies": []}, {"body": "LMAO sure buddy. Buy the dip 😂", "score": 9, "replies": [{"body": "I will. Continue being scared of losing your 5 bucks", "score": -15, "replies": [{"body": "I’ve seen your post history. A fat bald guy who takes steroids talking shit online LMAOOOO. You can’t make this shit up. Beta cuck 😂", "score": 14, "replies": [{"body": "As a fellow bald woman, i take offense", "score": 4, "replies": [{"body": "As a fellow man who likes bald woman, I also take offense.", "score": 1, "replies": [{"body": "As a fellow husband, I love my wife", "score": 1, "replies": []}]}]}]}, {"body": "LMAO, projecting much?! I’m sure I have more on an Amazon gift card balance than you have in your entire portfolio/savings account", "score": 2, "replies": [{"body": "Can I have some Amazon gift card?", "score": 5, "replies": []}]}]}]}, {"body": "You're so retarded even for this sub. Just look at the spy and zoom out. Took nearly 6 years for it to recover to highs after the dot com and 08 crisis.", "score": 3, "replies": []}, {"body": "Rofl, hope to see your lose porn", "score": 2, "replies": []}, {"body": "A bear market not lasting ten years doesn't mean it can't take ten years to return to previous highs.  Have you seen the S&P chart for the oughts?", "score": 2, "replies": []}, {"body": "Peep the S&P 500 from 1970 to 1985, that’s what we could be about to go through", "score": 1, "replies": []}, {"body": "It's like you're willfully ignoring 1999 to 2008 or something.", "score": 1, "replies": []}]}, {"body": "Not wrong if you say some day and not what day", "score": 1, "replies": []}]}, {"body": "Visionary statement. And eventually every baby will die.", "score": 23, "replies": [{"body": "But someone think of the children!!!!", "score": 7, "replies": []}]}, {"body": "People need to look up the definition of Opportunity Costs.", "score": 16, "replies": [{"body": "And what are the other opportunities?", "score": 1, "replies": [{"body": "The amount of sheer laziness in one sentence encapsulates everything about bubbles. Stop eating your crayons and dyor.", "score": 1, "replies": []}]}]}, {"body": "It’s wallstreetbets. Either provide quality DD or show us your positions.  \n\nOtherwise, just shut the fuck up already.", "score": 23, "replies": []}, {"body": "I don’t retire for another 25 years, what do I care about gains/loses in the market over the next 5-10 years", "score": 10, "replies": [{"body": "40 years for me lol. DCA’ing $100+ into my 401 weekly during this shit show", "score": 6, "replies": []}]}, {"body": "If they knew it was coming and bought inverse ETFs or shorted the stocks of companies in decline - they can make massive gains every day as the stock market drops.", "score": 8, "replies": [{"body": "This post is the reality.  They make money as the market goes up and down.\n\nYou don't think Elon has some hedges in place on his huge Tsla position?", "score": 5, "replies": []}]}, {"body": "The rich never stop getting rich off the stock market, that’s how it works.\n\nEdit: also rich people have no problem taking other rich peoples wealth.", "score": 8, "replies": []}, {"body": "In 15 years, sure thing, can't go wrong.", "score": 4, "replies": []}, {"body": "TLDR.   Eat more crayons?", "score": 5, "replies": []}, {"body": "Japan's never did", "score": 4, "replies": [{"body": "But since they have been deflationary, it's not like people in that market have lost money.\n\nFlat market when deflation happens = your investments are worth more when you pull out.\n\nOn the other hand, a lot of s&p gains are just inflation alone.", "score": 3, "replies": []}]}, {"body": "This guy acts like there wasn’t a recession in 2008 and people didn’t lose their jobs…. Newsflash, a recession/higher unemployment rate make it hard to pay a mortgage. It also makes it hard to sit on financial assets rather than turning them into cash, Ie selling.", "score": 5, "replies": []}, {"body": "Agree … eventually it will.", "score": 5, "replies": []}, {"body": "I just want to see Pelosi’s picks live. Somehow always times the market perfectly. No way is she getting insider info from HFs though…", "score": 5, "replies": []}, {"body": "Do you when the stock market bottomed in 2008-2009? It was right after oil crashed. We can all wish the elites want to keep their stocks up. Look at history. Buy stocks after oil crashes which results in the Fed being dovish.", "score": 4, "replies": []}, {"body": "“How can the rich get richer without the market?”\n\nAre you seriously asking this question?\n\nThe really rich:\n- Have many investment opportunities beyond just the market/stonks.\n- Are patient investors…don’t tend to fall for head-fakes…can go bottom fishing after a market crash.\n- Most important…they have access to data/information we just don’t have…insider trading with no chance of getting caught.", "score": 4, "replies": []}, {"body": "Wow what a wizard…eventually you say?!", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|8881)![img](emote|t5_2th52|4641)", "score": 2, "replies": []}]}, {"body": "Eventually famine... then what...", "score": 3, "replies": []}, {"body": "Stocks is not the company, and yes eventually it will go up but this is a critical 4 months right now… QT, Inflation, Recession, MM kept spy above -20% for 6 months and waiting for recession conformation to dump, but the worse is stagflation which is recession and inflation and with the last CPI data it can happen, Goldman give SPY 3,400 on recession and stagflation could be total crash… the confusion investors has is that there is many oversold individual stocks but indices are still high and will push them down when they drop…. If you trying to catch the bottom before next short covering rally just remember that in bear market every bottom go lower, we had March low and than May low, after the high CPI data the Feds will start to talk about 0.75 hike next week, MM pumping the indices and then drop it, don’t let them take your money, when you buying dips always edge yourself,", "score": 3, "replies": []}, {"body": "This is dumb, even for wsb.", "score": 3, "replies": []}, {"body": "That’s like saying we all gonna die eventually, duhhhh but how long?", "score": 3, "replies": []}, {"body": "It’s okay man, can you just stop reproducing more of you ?", "score": 4, "replies": []}, {"body": "You do realize in order for inflation to go down, consumer spending needs to go down. In other words unemployment needs to rise. The fed has made it's goal clear that wages are too high and unemployment may need to rise to tame inflation. Retail investors need to sell their stocks this stocks need to go down as well. Nothing brings inflation down like unemployment rising. Will the market recover? Yes, in 10 years but won't be to all time highs but it'll be trending upward.", "score": 4, "replies": [{"body": "How does a company grow if it doesnt hit ath's? you speak of 10 years is like nothing that is more than 1billion extra people on earth all consuming shit", "score": -10, "replies": [{"body": "What kind of logic is that, so if a company doesn't hit all times high constantly, it isn't growing? Companies don't need to even be a public traded company to continue to growth. The fact that you think a company needs to consistently hit new highs or it isn't growing and disregard private companies as non profitable is shameful.", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Holy shit does OP belong here, truly regarded", "score": 6, "replies": []}]}]}]}]}, {"body": "Spy too 100 first", "score": 0, "replies": []}, {"body": "Seems most of the negative sentiment about the market is being driven by inflation.. not much else. \n\nHypothetically, if the Ukraine War ends and supply chains improve we could see inflation decelerate substantially. Then we are left with consumers who are sitting on more cash and more financially stable than 2008 who are ready to buy the dip.\n\nSeems like theres risk of people defaulting on home loans or other debt obligations because of that as well. \n\nWe might crash but the hopeful part of me feels like it won't be long and drawn out because of that. But no one can tell us exactly what's going to happen.", "score": 0, "replies": [{"body": "I think inflation, and the feds required response, which is to increase the value of the dollar, is the key to all of it. I think even if the economy avoids big problems, interest rates need to come up, which pulls down real stock valuations.\n\nEven if the Ukraine war ended tomorrow, the market would go nuts, but it will take years for trade relations to normalize.  Russia made a choice that will affect them for 20 years, and their oil won't freely flow to the west without tariffs and restrictions for many years.\n\nThe only reason the market kept going up is qe and stimulus. A normal year should only see 10% gains. We are still below normal interest rates.", "score": 2, "replies": []}]}, {"body": "People couldn't afford their mortgage because they lost their job.  Home prices had collapsed and they were under water.", "score": 1, "replies": []}, {"body": "This pull back is transitory", "score": 1, "replies": []}, {"body": "They dont have much control of recession given how fragile their political status is. But please buy my covered calls, they will get assigned one day, but not within the expiration.", "score": 1, "replies": []}, {"body": "In the long term yes it will as it always has but thats not gonna happen for a few years", "score": 1, "replies": [{"body": "Well just keep buying every month and when the market eventually rebounds and makes ATHs you'll be happy you did. Only people who will get fucked are the ones who lump-summed at the beginning of 2022 and then didn't buy again.", "score": 1, "replies": [{"body": "Its a valid strategy averaging down through recession so in the recovery years you make bank no doubt", "score": 1, "replies": []}]}]}, {"body": "eventually ’the market’ will be owned 100%by the proles, pick up your marx and put down your playboy", "score": 1, "replies": []}, {"body": "synonyms for eventually-finally, one day, sooner or later, after all, in the course of time, someday and ultimately. This is a clear indication of some sort of sorcery or insider information.", "score": 1, "replies": []}, {"body": "The Nikkei hit its peak late 1989 or early 1990. It has not reached the peak but isn't too far away. If we get a big decline, are you willing or able to wait 32 years to get back to breakeven?", "score": 1, "replies": [{"body": "There is nothing to suggest the US would exactly follow the path Japan took since 1990, other than total speculation. Another raging 10-year bull market is equally plausible if we are just making random guesses and throwing shit out there.", "score": 1, "replies": [{"body": "The longest time to get back to breakeven in the United States was in the period of 1929 - 1955 or 25 years. So there is a precedent for secular bear markets in the United States. Nobody is saying that history perfectly repeats. But a look through the indexes shows you that it can take a long time to recover from a bear market.", "score": 1, "replies": []}]}]}]}
{"title": "With Higher Inflation, Wouldn't Stock Prices Go Up Or Soften A Crash?", "selftext": "If the value of the dollar drops, wouldn't the value of a company go up in $ value if they raise their product or service with rising inflation?\n\nTake AAPL for example. In theory, if they were to raise the prices of their products and services by 10% to match inflation, wouldn't that justify a higher stock price?\n\nI understand why there would be an initial dump on bad CPI numbers, especially with FOMC coming up this week, but wouldn't the longer term mean a higher stock price?", "id": "va51vm", "created_utc": 1654976820.0, "score": 25, "upvote_ratio": 0.8, "num_comments": 70, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|1 year ago\n**Total Comments**|144|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=va51vm)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=va51vm)", "score": 1, "replies": []}, {"body": "It’s gonna be tough when their prices go up but revenue stalls because of consumers’ diminishing buying power", "score": 41, "replies": [{"body": "No no no! The price of stocks could go up … or they could go down…. That’s it!", "score": 10, "replies": [{"body": "Sir, it's way more complicated than that. Stocks can go sideways too", "score": 5, "replies": [{"body": "Oh shit! I didn’t factor in topwise movement as well….. do you think there’s still time to panic see everything for a loss tomorrow??", "score": 1, "replies": []}]}, {"body": "No truer words", "score": 2, "replies": [{"body": "😆 I love you man. ‘Pours himself another brandy while drinking from the empty beer bottle that is strong ale, like the kind of ale that each time he drinks from it’s the few drops that have accumulated at the bottom feel like a drink to his drunken ass…..’", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|8881)", "score": 3, "replies": []}, {"body": "CC's maxed out again", "score": 2, "replies": []}]}, {"body": "Demand destruction. Higher prices reduce the amount consumers can spend because wages aren’t keeping up with costs. To slow inflation the fed has to create even more demand destruction so that companies don’t have much pricing power at all. Since inflation is high everywhere demand destruction has to happen all over the world so even international companies can’t maintain volume or earnings.\n\nThe fed needs to drive down companies pricing power and number of units they sell. This is not a good environment for profits or growth, hence lower multiples and valuations", "score": 14, "replies": [{"body": "I've never heard the term \"demand destruction\" before but that actually makes sense. By the fed pulling liquidity through QE and raising rates, their goal is to controlled crash the market and limit companies growth, ultimately for the greater good of the stability of the economy.", "score": 5, "replies": [{"body": "Yes. Central banks all over the world are doing this because there is inflation all over the world", "score": 2, "replies": [{"body": "Not in China.", "score": 1, "replies": []}]}, {"body": "The parent comment is spot on. The fed can't control supply at all for any real products it can only control consumer demand.  Most of the inflation is caused by supply being insufficient to meet demand. Therefore they will attempt reduce demand WITHOUT crashing the market (in particular without causing people to lose jobs).  The problem is no one believes they can do that. What has happened so far is not a controlled crash, it's an expectation of a crash going up, but one that hasn't yet happened.", "score": 2, "replies": []}]}]}, {"body": "Inflation often raises top lines and lowers bottom lines.  This means there's less profit despite higher sales.  This makes companies worth less.  And if inflation leads us to a recession, both the top and bottom lines are hit, often hard.", "score": 25, "replies": [{"body": "Thanks. This makes sense. I think I'm looking at it from a consumer standpoint and not factoring in diminished consumer buying power (demand) or higher cost. If the price of meat goes up 20%, ranchers would be raising their top line revenue. But, in the event sales drop 15% and cost to produce the meat climbs 15%, overall, it would justify a substantial decline in the ranchers value.", "score": 4, "replies": [{"body": "People still gotta eat.", "score": 1, "replies": []}]}, {"body": "Still worth billions", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "Like GameStop, right?", "score": 9, "replies": []}]}, {"body": "I think theoretically yes,,, until people realize that those stocks pay out in those same useless dollars.\n\nBut this isn't really inflation in my opinion. This is stagflation. My wages sure as heck are not inflating at anywhere near the same pace of my costs. This will force me as a consumer to spend less on some things and more on others.\n\nSo i think some stocks like oil companies (we still need oil to survive) will do well, but other companies that make flashy gadgets or whatever crap that we can live without will not do so well.", "score": 8, "replies": [{"body": "That makes sense. In this case, what would be the way to find stability or limit a crash? Higher wages and lower taxes? More money in consumers' hands?", "score": 1, "replies": [{"body": "I think they have done so much fucking up for the last 10???? years that there is no getting this plane out of its tailspin. This whole idea that money grows on trees so print print print is completely illogical to me and can only ever lead to the shit show we are watching unfold imo.", "score": 0, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "You’re not wrong.\n\nSource: Econ PhD", "score": 14, "replies": [{"body": "But wouldn't this only be true if bottom lines held up, not just top lines?  I certainly see the mechanism for how revenue rises, but it seems likely that bottom lines get pinched, particularly as the economy slows and consumption decreases.  And in many sectors, prices are rising in response to increased costs, particularly labor.", "score": 7, "replies": [{"body": "Yeah I think hasty is an understatement when an individual assumes mentioning their doctoral credentials automatically untangles an extremely complex question...", "score": 4, "replies": [{"body": "I mention it because people like to know where their information comes from. Especially here. \n\nThe basic story is that inflation raises asset prices, and stocks are an asset. \n\nThe medium story is that stocks are priced by expected future profits, and inflation raises the nominal values of those prices. \n\nOf course, the *real* story depends on the actual impacts of the inflation. Inflation never happens in a vacuum (i.e., we don't wake up one day and find the dollar is exactly 8% lower.) It hits different sectors with different magnitudes at different times, and that affects real profits as consumers adjust.\n\nBut in a stylized, Econ 101 world, he's not wrong.", "score": 1, "replies": []}]}, {"body": "Dude he's messing with you. Econ 101 would go against OPs post.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "In a perfect world. In a perfect world, if wages kept up with inflation, the market would also be up right now and inflation would never be a problem.\n\nBut this isn't a perfect world, this is the real world where principles of economics applies.", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "His scenario only comes true during a recession. So right now he is wrong because economics wouldn't apply to what he is saying, it applies to what I was saying. He'll get his turn to be right AFTER ME ![img](emote|t5_2th52|8880)", "score": 0, "replies": []}]}]}]}]}]}, {"body": "He is technically correct, but this only works for companies valued at a low valuation to earnings or cashflow and with strong pricing power. Apple has strong pricing power, however it is not at a low P/E and therefore a 10% potential growth of earnings does not offset the paralel increase in the discount rate, which results in a price decrease. Most companies in the current environment are more like Apple, as a result the whole market moves down on aggregate if inflation moves up.\n\nBasically: Companies cash flows go up, but discounted values go down.", "score": 2, "replies": []}]}, {"body": "Not when valuations were already maxed and interest rates rose… long term, they will. First there must be a mean reversion and valuation reset.", "score": 8, "replies": [{"body": "Interesting. That makes sense. So, in theory, sectors and tickers that are not considered overvalued may remain stable or even climb while growth is probably gonna dump.", "score": 0, "replies": []}]}, {"body": "Long term.  Shirt term crash becayse people stop spending.  No people spending then no sales then people get fired then bad earnings then stock crash then slow recovery.  If inflatiin is permenent, stocks will adjust to new level.", "score": 3, "replies": [{"body": "These next few earnings seasons are gonna be brutal", "score": 5, "replies": []}, {"body": "Inflation can't be permanent, the stay on rents, utilies, and college debt be looming, inflation is just a shortage with price gouging ontop done by corporate monopolies because of course their greedy.", "score": 1, "replies": []}]}, {"body": "You have a point but don’t forget how companies are valued. Sum of discounted future cashflows. It’s purely technical that higher rates result in lower valuations. Especially if the projected cashflows are far in the future or reliant on high growth expectations. That explains why growth stocks suffer so much more than eg utilities or other „boring“ industries.\n\nAs for your example, it’s all about pricing power that means the ability of a company to pass on a increasing input costs. In your example, Apple may be able to increase prices but their input costs, parts, labor, shipping, energy, also have gone up. So it will be important to watch company margins. That will tell you who can pass inflation on and who can’t.", "score": 5, "replies": [{"body": "…and one more thing. You are right that in an inflationary environment common knowledge would be to buy stocks simply because equity performs better than fixed income assets like bonds due to the fixed nominal.", "score": 2, "replies": []}, {"body": "It’s insane how far down this comment is", "score": 1, "replies": []}, {"body": "Companies like Apple have pricing power on both consumers and suppliers due to economy of scale they will be profitable for a very long time", "score": 0, "replies": []}]}, {"body": "Lol", "score": 4, "replies": [{"body": "This was the correct response.", "score": 2, "replies": []}]}, {"body": "Depends how bad inflation gets. Inflation can be bad enough where it takes bites out of profit.\n\nOne thing needs to be remembered though. The indexes are evaluated on the volume of dollars in the index. So, if we hit hyper inflation like Germany did 100 years ago everything will go up in price. especially stocks.", "score": 2, "replies": []}, {"body": "But the people apple buy the materials from also increased their prices by 10%, and consumers have 10% less to spend. And apples cash on hand is losing value. Right? I dunno I have 0.08p in my bank", "score": 2, "replies": []}, {"body": "Record profits", "score": 1, "replies": []}, {"body": "Somebody get this guy a helmet", "score": 0, "replies": [{"body": "I hope its sronger than a hard hat", "score": 0, "replies": []}]}, {"body": "What kind of logic is this? Lol. The only way you could be right is if wages kept in pace with inflation.\n\nBut in the real world, wages are stagnant, so inflation is bad for consumers and so consumer spending goes down.", "score": -1, "replies": [{"body": "This is WSB, isn't it?\n\nNa. Just tryna learn from folks more knowledgeable than me.", "score": 3, "replies": [{"body": "I'll explain further, USA GDP is 70% based on consumer spending. So if consumer spending goes down due to inflation then GDP goes down as well.\n\nNow you know. You owe me a Wendy's frosty 🤤", "score": 6, "replies": []}]}]}, {"body": "Who cares?", "score": 0, "replies": []}, {"body": "Yes in nominal terms you can be correct. Depends on company too (pricing power, labor demands). In theory a company with the ability for dynamic pricing and low headcount should be a big winner relatively speaking. The body shop companies in competitor environments with sticky pricing models are in trouble. Of course if we see demand destruction due to extreme inflation then most are screwed.", "score": 1, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "Idk what inflation is, but my mom always have to blow up my floaty wings before I take a bath if that helps?![img](emote|t5_2th52|8883)", "score": 1, "replies": []}, {"body": "Stocks only go up", "score": 1, "replies": []}, {"body": "So investors lose twice:\n\nLess $ value, and each $ itself has less value", "score": 1, "replies": []}, {"body": "Inflation is only one factor cost of production and wages along with interest rates impact profits and stock prices , if interest rates stay high the dollar will remain strong currency stay invested also there is massive liquidity in the system so money will go back into stocks any way sooner or later", "score": 1, "replies": []}, {"body": "Logically yes but in reality while APPL can sell everything for 10% more, consumers are likely to spend less thus making the amount of products sold less. This leads to lower overall revenue which commands a lower multiple and market cap for any stock.", "score": 1, "replies": []}, {"body": "Unchecked inflation would cause the stock market to go up.  But the markets are currently pricing in what the fed is going to do to fight inflation.", "score": 1, "replies": []}, {"body": "You are confusing the dollars relative value to physical assets, like real estate gold, gas and even food with the dollars relative value to other countries.   The US dollar will remain strong compared to other countries of world currency's because as bad as it will be here, it will be worse there.  It's a relative value of the dollar to other countries that will also make it more expensive for companies to sell their good abroad.  As global demand slows, revenues decrease, companies lay off....rinse, repeat and rinse, repeat....\n\nUp until now, the Fed could step in and print money to get us out of any problems we had.  Inflation now makes that impossible.  Real estate may hold it's value fairly well in the long run but it could also drop in the short to intermediate term.  Physical assets like precious metals may do better than cash but it long since lost it's power as an inflation hedge but that could change in the drop of a hat.  \n\nDiversification really is your best bet.  I have half my money in scratch-offs and the other half in the Power Ball.", "score": 1, "replies": []}, {"body": "What if the Fed was just like...ok, we're just going to reset all prices back to what they were in 2018", "score": 1, "replies": []}, {"body": "I think long term, yes inflation would increase the price of a stock. The concern is in the short term, does the company survive the cost of borrowing? Pick wisely.", "score": 1, "replies": []}, {"body": "I'm too stupid to be here, but I'm smarter than when I arrived. Good question and some great answers", "score": 1, "replies": []}, {"body": "Sure until:\n1. People stop buying new iPhone because they can't afford it\n2. I phones become more expensive to make because the materials needed go up in price\n3. All of this is reflected in earnings\n\nAnything else?", "score": 1, "replies": []}, {"body": "Yes inflation results in overall stock market value going up. That is why keeping your money in bank vs investing it is basically just throwing money away.", "score": 1, "replies": []}, {"body": "Some stocks will benefit most will not and take a hit on bottom line. Stock market will tilt towards those who are the beneficiary. So your statement is right as well as wrong.", "score": 1, "replies": []}, {"body": "When inflation goes nuts, consumer spending decreases hence lower earnings.. what does lower earnings mean to you?", "score": 1, "replies": []}, {"body": "Slow inflation increases stock values, but when inflation rises too quickly that customers cannot afford the higher prices, demand is lowered, so it actually can hurt the value as profits stall or plummet.", "score": 1, "replies": []}, {"body": "Customers will be buying much less.", "score": 1, "replies": []}]}
{"title": "I know nothing about stocks , but stock market crash 2022?", "selftext": "", "id": "va5mfr", "created_utc": 1654978561.0, "score": 49, "upvote_ratio": 0.68, "num_comments": 78, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|1 year ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=va5mfr)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=va5mfr)", "score": 1, "replies": []}, {"body": "Congrats…you’re hired.\n=\n\nPosition: Managing Partner, US Analyst\n\nCompany: Bear Stearns*\n\n*Bear Stearns is fine", "score": 114, "replies": [{"body": "I’m Ken Griffin and I approve of this message ![img](emote|t5_2th52|4270)", "score": 21, "replies": [{"body": "This is your wife. I need more money", "score": 7, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "I'm Ken Griffey Jr and I approve this message ![img](emote|t5_2th52|4270)", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|8881)![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}]}]}, {"body": "Go look at the 1973-1975 chart.", "score": 30, "replies": [{"body": "Ight", "score": 13, "replies": []}, {"body": "Google doesn’t show that far back ![img](emote|t5_2th52|4260)", "score": 5, "replies": [{"body": "Yahoo finance. 100000000000% better site.", "score": 13, "replies": []}]}, {"body": "“The United States didn't see the same level in real terms until August 1993, over twenty years after the 1973–74 crash began.” Wikipedia", "score": 9, "replies": [{"body": "I’m not saying it’s a photocopy, but it’s got a lot of the same flavors.", "score": 3, "replies": []}]}, {"body": "Oh gosh I hope not", "score": 3, "replies": [{"body": "Oil prices, inflation, rising FFR. I got my puts.", "score": 3, "replies": []}]}]}, {"body": "Gme", "score": 19, "replies": []}, {"body": "If you are a boomer with 10% of your assets in stocks, it doesn't concern you much.\n\nIf you are a young adult, less than 10 years into the work force, got tens of thousands gradually saved up and invested looking for a brighter future buying your own place, getting married and have children, yeah.... the crash along with inflation is fucking you in the ass right now.", "score": 16, "replies": [{"body": "Wrong. Best thing to happen to young people is a crash so long as they keep buying in. When the market recovers, and it always does, they will be in far better shape than if the market just stayed high", "score": 11, "replies": [{"body": "Only if they're buying index ETFs, individual stocks often never recover", "score": 5, "replies": [{"body": "True dat", "score": 3, "replies": []}]}]}, {"body": "Reporting for getting fucked in the ass 🫡", "score": 7, "replies": []}]}, {"body": "MarketWatch is right for once", "score": 5, "replies": []}, {"body": "Need to use log scale… oh shit didn’t realize where I was. Nvm", "score": 6, "replies": []}, {"body": "Stock market crashed..get your tense right..Warren buys I buy.", "score": 15, "replies": [{"body": "Please don't post copium like that without a link I would love to read it", "score": 5, "replies": []}, {"body": "QQQ is down about 30% in the last 6 months, S&P500 about 20%.\n\nInflation sucks, interest rates suck.\n\nBut people have to put their money somewhere,  and holding cash is a guaranteed slow burn.  Housing is leveling off and supply is increasing. Stocks will always be where the best chances of long term gains are. \n\nPriced in, bottom is close.  Buffet is buying, everything is so doom and gloom.  Bullish 🐂", "score": 11, "replies": [{"body": "Friday was another example that nothing is priced in until the numbers come out.", "score": 11, "replies": [{"body": "Actually I laughed at what happened on Friday.\n\nSo often I hear that the market is 'forward looking' and indexes generally head towards levels before the 'events' happen, whatever those events happen to be.\n\nWell, everyone knows that inflation is bad, energy prices are too high, CPI data will be unfavourable, and the Fed is raising rates, etc.  Then, when one of these items gets reported, it's a total shit storm and the market overreacts.  Or, should I say the algos overreact since ~80% of daily volume is algorithmic.\n\nFor a forward looking market, the market is really shitty at looking forward. Every time.", "score": 13, "replies": [{"body": "Anyone who says the market knows what it’s doing is just talking out of their ass.  Companies hire thousands of analysts and still underperform the market every year. There is a reason the big investment companies are banks and make the majority of their money from loans.", "score": 4, "replies": []}, {"body": "The market is forward looking like an emotional toddler is forward looking. Lots of temper tantrums and irrational behavior. It isn't forward looking like an AI supercomputer as most of the market is based on emotion.\nLike Buffett says, be greedy when others are afraid and afraid when others are greedy.", "score": 2, "replies": []}]}]}, {"body": "!remindme 1 week", "score": 1, "replies": [{"body": "I will be messaging you in 7 days on [**2022-06-19 19:21:25 UTC**](http://www.wolframalpha.com/input/?i=2022-06-19%2019:21:25%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/va5mfr/i_know_nothing_about_stocks_but_stock_market/ic4bmy6/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fva5mfr%2Fi_know_nothing_about_stocks_but_stock_market%2Fic4bmy6%2F%5D%0A%0ARemindMe%21%202022-06-19%2019%3A21%3A25%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20va5mfr)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "What’s your stance now?", "score": 1, "replies": [{"body": "👎 lol\n\nMy feelings are the same though.", "score": 1, "replies": [{"body": "You are bearish now? lol", "score": 1, "replies": []}]}]}]}, {"body": "how do you know when and what warren buys?", "score": 1, "replies": []}]}, {"body": "Yes , but I need it to crash even HARDER", "score": 5, "replies": []}, {"body": "What an original post", "score": 9, "replies": []}, {"body": "Always has been. Just delayed..", "score": 5, "replies": []}, {"body": "Edgies pull money off stock markets to get government bonds as the interest rate has risen and there is no stock that can guarantee the return like a government bond does, unless yea you are Venezuela Congo and trash nations like that \nI am not funny at parties", "score": 2, "replies": []}, {"body": "This is bear signal from general population.", "score": 2, "replies": []}, {"body": "Market movement has nothing to do with options. Success in options are purely based on the correctness of your speculation. You can lose money on a stock that doubles if you thought it would triple.\n*****\n\n\n*[wut?](https://www.reddit.com/r/WutbotPosts/)* | *[source](https://reddit.com/r/wallstreetbets/comments/mtbth7/markets_are_at_all_time_highs_and_i_still_managed/guypl3p/)*", "score": 2, "replies": []}, {"body": "2 circles & 1/2 a sentence, this guys onto something.", "score": 2, "replies": []}, {"body": "Another TA savant. Yay", "score": 5, "replies": [{"body": "I think you’re avoiding the question…", "score": 8, "replies": []}]}, {"body": "Side note , should I sell my stocks Monday ? Or should I hold on", "score": 3, "replies": [{"body": "Yeah definitely lock in those losses, that's the way to get wealthy. Then make sure to buy at the top again. Rinse and repeat.", "score": 32, "replies": []}, {"body": "After the last couple of months laying out a bear market followed by a couple of weeks of bull market fake-outs, this is the big question. Depending on the status of your positions, exiting may be the most practical risk management; however, if you cared about risk management, you likely wouldn't be asking for advice from this sub.", "score": 10, "replies": []}, {"body": "Panic sell now and buy back in at all time highs. Rinse and repeat.", "score": 3, "replies": []}, {"body": "Buy high and sell low, right?\n\nRealistically I don't know what stocks you own but if you are in good high quality investments you want to keep buying. If you have Amazon, NVIDIA, AMD, Microsoft and lots of other guaranteed high quality companies, I would just keep buying and use cost averaging techniques to average out your buy-in price.", "score": 1, "replies": [{"body": "I question 3/4 of your list as high quality.", "score": 1, "replies": []}]}, {"body": "You should sell asap", "score": 1, "replies": []}]}, {"body": "Why not just [build a forecast](https://www.hypocast.com/PortfolioForecast) and see what happens?", "score": 1, "replies": []}, {"body": "You better not try invest or anything if you are not understand the current situation.", "score": 1, "replies": []}, {"body": "It’s priced in", "score": 1, "replies": []}, {"body": "Look you’re unlikely to see a sudden crash. What you’re more likely going to see is a slow decline over the next year or so back towards a mean of around 3,200 - 3,600 (s and p) with lots of small rallies along the way. There’s money to be made, but it’s not though long term investing at the moment. Best to keep your cash building on the side and wait it out. If you think you can pick the rips and drops then do short term trading using volatile stocks like Tesla or if you’re not into options you can use ETFs like TQQQ and SQQQ to profit from the rallys and dips. But that’s quite risky and hard to pick.", "score": -1, "replies": [{"body": "Time the dips bro trust me", "score": 1, "replies": []}]}, {"body": "One more dum dum who doesn’t understand a linear vs logarithmic scale. 🙄", "score": 0, "replies": []}, {"body": "This is the just the beginning of a ride down for a while", "score": 1, "replies": []}, {"body": "Look at those years tho. I wanna get a lambo nao.", "score": 1, "replies": []}, {"body": "Probably in September. Lol", "score": 1, "replies": []}, {"body": "Yup, now you know something about stocks", "score": 1, "replies": []}, {"body": "Hard is trying to figure out where the dip stops so you buy.", "score": 1, "replies": []}, {"body": "Fuck. You’re good.", "score": 1, "replies": []}, {"body": "You're not going to learn anything about stocks here.", "score": 1, "replies": []}, {"body": "Apparently you know more than 99 percent of the forum", "score": 1, "replies": []}, {"body": "Yeah, we already knew you knew nothing about stocks.", "score": 1, "replies": []}, {"body": "So bottom is 2025. Gotcha ![img](emote|t5_2th52|4267)", "score": 1, "replies": []}, {"body": "Holy shit what the fuck how were you able to spot this pattern!!1?1!!1?1?1?1?????????? \n\nUmmm Goldman BallSachs is on the line and they said you got a free scholarship", "score": 1, "replies": []}, {"body": "Small Dip = 50% retrace from the top. So buy when NASDAQ is 8000", "score": 1, "replies": []}, {"body": "sqqq", "score": 1, "replies": []}, {"body": "SQQQ. This is the way", "score": 1, "replies": []}, {"body": "Nasdaq will be down close to 50% this year", "score": 1, "replies": []}, {"body": "DIAMOND HANDS!", "score": 1, "replies": []}]}
