{"title": "My entire account was assigned", "selftext": "I sold CCs on my AAPL and MSFT at the beginning of the week. All I had was that and cash. Then I got super busy at work on Thursday and Friday and didn't check my stuff. Checked it just now and my entire account is just cash. \n\nI am scared to look at where they closed.", "id": "vksn75", "created_utc": 1656204253.0, "score": 86, "upvote_ratio": 0.77, "num_comments": 78, "comments": [{"body": "If you sold CCs above your CB then you’ve made money", "score": 262, "replies": []}, {"body": "Damn, you hit max profit. Way to go!", "score": 180, "replies": [{"body": "It all depends on what his underlying cost was for those stocks- if he bought apple last month at 155 and sold the 140 call early this week when apple was stuck in the 130’s then he lost.", "score": 9, "replies": [{"body": "When he sold the CC, he agreed to allow them to be taken away at the price he agreed to (Strike + premium). He got that full amount, hitting max profit.\n\nTo be fair, I was being a little cheeky with my reply to the OP.", "score": 11, "replies": []}]}]}, {"body": "It's a good news in this shitty bear market.", "score": 82, "replies": [{"body": "Yeah so gald my AAPL got called away", "score": 19, "replies": []}]}, {"body": "CSP right back in", "score": 62, "replies": [{"body": "Maybe not 100% due to uncertainties, but getting paid to enter below sale price would be awesome.", "score": 17, "replies": [{"body": "Nope to much thinking wheel it up baby", "score": 13, "replies": [{"body": "Wheel more, think less. 👍", "score": 4, "replies": [{"body": "This reminds me of the pennys in front of a steamroller episode of thetagang podcast", "score": 0, "replies": [{"body": "Really hard to say that selling puts on apple is pennies in front of a steam roller but ok", "score": 3, "replies": [{"body": "And then they have a bad earnings release due to supply chain issues and are down 20%", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "It doesn’t matter where they closed, what matters is the strike price that you decided on the CCs.\nBy selling them, you accepted that they would be taken away for that price and that happened. Transaction closed.\nMove on and now sell CSP (on the same or other tickers) until you get those assigned.", "score": 43, "replies": [{"body": "CSP at the strike that OP purchased stock at originally?", "score": 1, "replies": []}]}, {"body": "Congratulations on hitting max profit for the trades 😉", "score": 10, "replies": []}, {"body": "What was the positions? Cost basis and strike prices.", "score": 10, "replies": [{"body": "100 MSFT shares assigned at 265, 100 AAPL assigned at 141. \n\nI don't remember the cost bases because I've been holding them for years.", "score": 7, "replies": [{"body": "So then why are you upsetty spaghetti", "score": 56, "replies": [{"body": "Well it looks like I missed out on $270 on the MSFT and $61 on the AAPL, all because I sold CCs for a grand total of about $24, so I guess I'm upset that I didn't get on in time to roll and avoid being assigned for less than they were worth", "score": -46, "replies": [{"body": "If you wanna sell CC you cannot think like this bro.\n\nI assume it's not the 1st time you sell CC? If you have been selling it for sometime the premium adds up.\n\nJust sell OTM puts again or change to SPY/QQQ if you're into ETFs and still wanna trade options.", "score": 49, "replies": []}, {"body": "Don't get why you're complaining.  You received the premiums on long option calls, and then the stock hit your strike price.", "score": 12, "replies": []}, {"body": "$24….wtf you risking your shares for $24?", "score": 3, "replies": []}]}]}, {"body": "I hope this is in a tax advantage account.", "score": 2, "replies": []}]}]}, {"body": "What is done is done.  Actually the timing may not be bad. Those with cash is king right now. Can buy later for less.  Market is likely to be lower viewed from most sources.", "score": 37, "replies": [{"body": "Key word here is “might.”", "score": 17, "replies": [{"body": "Once the fed comes out and confirms recession it will go back down", "score": 11, "replies": [{"body": "lol but they don't announce a recession unless it's already over", "score": 10, "replies": [{"body": "That’s a little too close to the truth", "score": 4, "replies": []}, {"body": "relevant\n\nhttps://www.reddit.com/r/StandUpComedy/comments/vl6qhg/luke_null_america_rn/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 2, "replies": [{"body": "Plugging your stand up?", "score": -1, "replies": [{"body": "it’s not mine, he just talks about how everybody, including relatively rich folks, are about to get pigfucked by economic downturn, but all with a clever simile", "score": 1, "replies": []}]}]}, {"body": "Best of luck to you all!", "score": 0, "replies": []}]}]}]}]}, {"body": "You will either have a nice tax loss or gain the IRS will like.", "score": 14, "replies": []}, {"body": "Now you can learn how to diversify.", "score": 20, "replies": []}, {"body": "I sold CC on my AAPL holdings on this bounce as well. Getting assigned would result in a nice profit over my cost basis. If that occurs, I’ll probably sell puts on the next down trend.", "score": 6, "replies": [{"body": "What next down trend? Didn’t you hear the bear got slaughtered… lollipop 😂 🤙", "score": 1, "replies": []}]}, {"body": "Buy back in slowly, don’t incur wash sales on those tickers", "score": 11, "replies": [{"body": "I think when I buy back in it will be SPY instead. Thoughts?", "score": 14, "replies": [{"body": "Fantastic idea. I would recommend VOO or VTI, but that’s up to you and it sounds like you like CCs.", "score": 8, "replies": [{"body": "Voo for buy and hold, spy for cc cause lots of expirations", "score": 12, "replies": []}, {"body": "VOO has shitty premiums, I’d you’re wanting to sell CC’s. I’d go with SPY, if it’s mainly for CC’s. VOO is for long term, and shitty premiums.", "score": 6, "replies": []}, {"body": "Why VOO or VTI over SPY? Price?", "score": 3, "replies": [{"body": "Lower expense ratio too.", "score": 2, "replies": [{"body": "Expense ratio?", "score": 1, "replies": []}]}, {"body": "Yes! And diversification, in the case of VTI.", "score": -2, "replies": []}]}]}, {"body": "You could do the xlk spdr etf it’s more tech concentrated you will have more aapl and msft exposer", "score": 2, "replies": [{"body": "And a buncha Tsla exposure. I found xlk has shit volume tho", "score": 0, "replies": [{"body": "No Tesla is in the xly along with Amazon", "score": 1, "replies": []}]}]}, {"body": "If you're wheeling, UPRO.  3x premiums per dollar invested... or just put 33% of the cash in to get the same effect and leave the other 66% for other purposes.", "score": 0, "replies": []}, {"body": "/mes", "score": 1, "replies": []}, {"body": "Since you had AAPL and Msft then maybe better to go for QQQ as has more exposure to those two than SPY…", "score": 1, "replies": []}]}, {"body": "Wait, why would buying rhe stock again after selling the covered call for a profit count as a wash sale?", "score": 3, "replies": [{"body": "I assumed it was a loss based on the phrasing, but I could definitely be wrong", "score": 6, "replies": [{"body": "Ahh fair enough.  I worried I was doing it wrong haha", "score": 2, "replies": []}]}]}, {"body": "Wash sale doesn't apply when u sell for profit", "score": 2, "replies": [{"body": "What is profit? Not familiar with that", "score": 3, "replies": [{"body": "Its a mythical financial term for retail investors", "score": 2, "replies": []}]}]}]}, {"body": "Why did you sell CCs if you weren’t willing to see your shares go at that price? That’s wheel 101 right there", "score": 3, "replies": []}, {"body": "Well I hope you covered your cost basis and cash right now is good just get in or not with a cash secured put", "score": 2, "replies": [{"body": "What do you mean \"covered your cost basis?\"", "score": 1, "replies": []}]}, {"body": "at least with apple you closed with the call exercised. It spent monday in the toilet and climbed uphill to where it started this week. Like the prior week never really happened.", "score": 2, "replies": []}, {"body": "Sorry to hear! I haven't sold any CC because the low delta calls are worth nothing compared to what you can lose if you're underwater.", "score": 3, "replies": []}, {"body": "Can't go broke taking profits! \n\n&#x200B;\n\nOh wait shit sorry OP, I forgot there will never be another red day. And they banned put selling too :P", "score": 4, "replies": []}, {"body": "Or just run the wheel and buy cash backed puts? Then if you get assigned you have your shares back at less than what you sold them for", "score": 1, "replies": [{"body": "you mean sell?", "score": 1, "replies": [{"body": "Yes lol my bad I was tired", "score": 1, "replies": []}]}]}, {"body": "Now you have buying power. Sell some puts and get it working for you. Maybe diversify a bit too. Congrats on the W", "score": 1, "replies": []}, {"body": "The fundamental question is why would you sell CCs after 3 straight weeks of red? You’re supposed to sell CCs after lots of green to protect your profits if you don’t want to let go of the shares.", "score": 1, "replies": [{"body": "Only really works if you do a CCS with shares to back the short leg. Ask me how I know.\n\nSame on CSP. Always buy a lower leg, even on weeklies.", "score": 1, "replies": []}]}, {"body": "F", "score": 1, "replies": []}, {"body": "Congrats. Now that your inventory of stock is depleted you should look to reaccumulate by selling naked puts. Great strategy.", "score": 1, "replies": []}, {"body": "Time to write puts now at the exercised/assigned price!", "score": 1, "replies": []}, {"body": "What was your cost basis (buy price ) and the strike for you CCs?\n\nYou should be happy if the strike price for CC was above your buy price.", "score": 1, "replies": []}, {"body": "You made max profit on your trades this week? I'm jealous...", "score": 1, "replies": []}, {"body": "being all cash right now is not a bad thing by any means.", "score": 1, "replies": []}, {"body": "It sounds to me like you won. Two weeks ago the market was a shit show, and you persevered. Now start doing some puts and do the whole thing again.", "score": 1, "replies": []}, {"body": "If you sold your cc at CB then you made nothing but profit . Unless you were being a wall streets bets degenerate and chasing premium", "score": 1, "replies": []}]}
