{"title": "TSLA seems to be priced fairly right now", "selftext": "Apologies for making yet another tesla post but I feel like this is worth discussing.\n\nAt the time of writing this post TSLA is worth $685.47 with a market cap of $710B. I don't own any shares of Tesla at all. \n\nMy claim is that at this price and point in time the stock seems to be priced fairly and arguably is a pretty decent buy.  \n\nMy reasoning: \n\n1. Extreme growth: They have a 51% revenue CAGR starting with the realease of the model s in 2013 up until last year. This year they will probably have another 50% growth and <<probably>> another 50% in 2023. The point is that so far over the long run TSLA has grown extremely quickly and consistently. They will also have new models such as Semi, cybertruck and roadster arriving <<probably>> next year. AND they sell their cars with excellent margins. So their growth is very sustainable. \n2. Diverse and unique side businesses: As of this moment tesla gets the vast majority of its revenue and profit from selling cars, thats undeniable. But they have a lot of aspirations. Firstly, energy storage is going to be cruicial in transitioning the world to sustainable energy and tesla is at the forefront of this industry and are therefore in a prime position to capitalize on that. Secondly tesla is dabbling with insurance and juding by their lates report that business unit seems to be breaking even and soon will become profitable. It has only launched in a few states so far and there is a lot of room to grow. Solar shignles and solar in general is also another potential area for growth although tesla doesn't seem to be prioritizing it.  \n3. Autonomy: Elon has many times over estimated his own timelines so this point is a little weak BUT if tesla does indeed manage to actually get FSD working properly (im guessing 2025 is the year where they start driving tens of thousands of kilometers without any issues) then tesla is poised to make a ridiculous amount of money. Since the vast majority of teslas by that time will have the hardware necessary to become autonomous, teslas will turn from depreciating cars to profit producing assets. This will have a massive effect on the whole auto industry and no doubt make tesla a lot of money. This is of course very risky but even if they have a 10% chance of pulling it off, id say its worth it. \n4. With all the infrastructure tesla is developing for AI, they could conceivably rent it out to other companies such as AWS but for AI training. Tesla hasn't spoken about this to my knowledge but once FSD is fully trained and has incredibly low failure rates, this would be a great use for all that hardware. \n5. Tesla bot? Similar to point 3 but 1% chance of succeeding. But again if they do succeed, trillions of dollars could be made. \n\nPotential issues: \n\n1. they need to fix vehicle quality and service. It doesn't seem to be a problem right now since demand is so much higher than supply but in the future it could become a problem. \n2. Elon should probably tweet less. \n3. There seems to be a massive minerals shortage (lithium) coming. Not sure how tesla will handle this but even if they do secure all the materials they need, their price will be extremely high. \n\nGeneral thoughts:\n\nWith all of this being said tesla right now has a PE ratio of about 90. To give some context back in 2017-18 amazon had a similar PE while growing slower. They were already maxing out all their business lines. Tesla on the other hand is just getting started. They seems to have all the core technologies nailed and with a very solid roadmap ahead. So all in all, at this point in time, tesla seems to be a solid buy, just like amazon was 5 years ago, probably even better.  \n\nIm curious to hear counter arguments to this. I keep seeing posts about how tesla is incredibly overpriced and that was true a year or two ago but imo not anymore.", "id": "vnxe9o", "created_utc": 1656556752.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 69, "comments": [{"body": "Nope", "score": 33, "replies": []}, {"body": "Wow the tesla fanbois and bag holders are out in force this week.\n\nStock was under $70 just 30 months ago.  Please tell exactly what has improved in 30 months to justify a 10-15x price increase.  A 30 month time frame where most of the world was shutdown...", "score": 13, "replies": [{"body": "They are panicking because they are probably holding bags at this point and daddy hasn't tweeted in nine days.", "score": 2, "replies": []}, {"body": "> Stock was under $70 just 30 months ago. Please tell exactly what has improved in 30 months to justify a 10-15x price increase.\n\nWhat exactly: they are now profitable, without relying on ZEV credits.\n\n3 years ago: net income: negative\n\n2021: net income: 5 billion\n\nhmmm... bUt wHAt hAs cHaNgED?  I just can't figure it out!!!\n\n3 years ago they had one factory... now they have 4, 2 of which are ramping and not yet productive/profitable, but that will change in 3-6 months.\n\nTesla will sell every car they can make in the next decade, and at a profit margin the rest of the industry would kill for.  \n\nElon is a clown, so a causal observe may think it was his tweets/fan boys that got it to $1200... but the truth was he was quiet last summer/fall, and skipped the earnings call... the market saw the actual results and listened to the facts from people not-named-Elon and the stock zoomed 50% (800-1243) in weeks.  Much of Elon's idiocy since then has been to kill the stock when it stays above $1k ('selling 10%', 'buying twitter').  It's a hostage situation - he needs to hire more tech talent and slap golden handcuffs on them (4 year vesting options) before letting the price run high again.\n\nQ2 results probably suck... this summer could be a mess for market in-general, but TSLA below 600 (if it gets pushed that low in 1-8 weeks) could be the deal of the decade.", "score": 1, "replies": []}, {"body": "Well I could say that Tesla was underpriced before and then it shot up and overshot it's real value but now it's returning to something reasonable", "score": -2, "replies": [{"body": "Put the pipe down", "score": 2, "replies": [{"body": "very articulate and informative response, thanks", "score": 2, "replies": [{"body": "Anytime bro", "score": 2, "replies": []}]}]}]}]}, {"body": "Not even close.", "score": 8, "replies": []}, {"body": "One problem - Elon is losing his mind too much coke.  I’m out.", "score": 18, "replies": [{"body": "Coke head for sureeee. Dude is progressively losing his mind on the big screen for all of us.", "score": 4, "replies": [{"body": "Doesn't he have ass-burgers syndrome? Maybe that is hindering his tweets and not coke?", "score": -2, "replies": []}]}, {"body": "To be fair the man is congenitally incapable of simply shutting the fuck up. As soon as he is done burying the internet in shit posts he will get back to running the company probably maybe.", "score": 0, "replies": [{"body": "I would agree if he didn’t have a god complex at this point he’s surrounded by people who would kill their parents to touch his nuts", "score": 5, "replies": []}, {"body": "he suspended shit posting a week ago, after SpaceX employees protested/got fired, and his daughter disowned him.\n\nhe'll be back, but now that he is no longer trying to murder TSLA when it gets above $1k, he might be slightly less stupid on twitter.", "score": 1, "replies": [{"body": "Just give it time. He’ll get back to it.", "score": 2, "replies": []}]}]}]}, {"body": "Hahahahaha", "score": 3, "replies": []}, {"body": "No. I like Tesla, I want shares of Tesla, but not at the current prices. If that means I miss my chance, so be it. Not the first time sticking to my value investment strategy has caused me to miss a boat, won't be the last, I'm sure.", "score": 7, "replies": [{"body": "fair enough", "score": 2, "replies": []}]}, {"body": "> Extreme growth: They have a 51% revenue CAGR starting with the realease of the model s in 2013 up until last year. This year they will probably have another 50% growth and <<probably>> another 50% in 2023. The point is that so far over the long run TSLA has grown extremely quickly and consistently. They will also have new models such as Semi, cybertruck and roadster arriving <<probably>> next year. AND they sell their cars with excellent margins. So their growth is very sustainable.\n\nThey will not grow 50% this year. Inflation forces people to lower their luxury choices. With the cheapest Model 3 now being over 46k, the market is smaller. \n\nRegarding the growth, you seem to miss that competition is already there with the Hyundai Ioniq 5 and the Porsche Taycan. VW is also pushing hard. The Semi, Cybertruck and Roadster 2 have been announced years (Roadster 2 in 2017) and we have not seen any progress. \n\nThe high margins are worrying, not a positive. Car companies generally have terrible margins as it is a high capex business. EVs don't change that. So if you have high margins, that means you have a technology advantage - which Tesla did have for years. But that is changing. Nearly all car companies work together with the same batteries suppliers as well.\nI would say that that growth is not sustainable. If the growth is just 20% (which would still be huge in a recession/inflationary environment), the stock would go down 60%+. \n\n\n> Diverse and unique side businesses: As of this moment tesla gets the vast majority of its revenue and profit from selling cars, thats undeniable. But they have a lot of aspirations. Firstly, energy storage is going to be cruicial in transitioning the world to sustainable energy and tesla is at the forefront of this industry and are therefore in a prime position to capitalize on that. \n\nAspirations are cool, but results matter. Tesla is not at the forefront of battery storage and they don't have a technology advantage here. It will also be a low margin business.\n\n\n> Secondly tesla is dabbling with insurance and juding by their lates report that business unit seems to be breaking even and soon will become profitable. It has only launched in a few states so far and there is a lot of room to grow. \n\nInsurance is a highly regulated area and just 1 year of Tesla insurance does not mean, that they can become profitable. Insurance go through good and bad times and those often come unexpetec. \n\n\n> Solar shignles and solar in general is also another potential area for growth although tesla doesn't seem to be prioritizing it.\n\nThe solar shingles where Elon did not represent a working unit at the presentation, very trustworthy. \n\n\n> Autonomy: Elon has many times over estimated his own timelines so this point is a little weak BUT if tesla does indeed manage to actually get FSD working properly (im guessing 2025 is the year where they start driving tens of thousands of kilometers without any issues) then tesla is poised to make a ridiculous amount of money. \n\nAnd if my grandmother has wheels, she would be a bike. THere is no indication that Tesla is any closer to true FSD than back in 2017. Mercedes was the first to get L3 regulatory approval. \n\n\n> Since the vast majority of teslas by that time will have the hardware necessary to become autonomous, teslas will turn from depreciating cars to profit producing assets. This will have a massive effect on the whole auto industry and no doubt make tesla a lot of money. This is of course very risky but even if they have a 10% chance of pulling it off, id say its worth it.\n\nI would say they have 0% of pulling it off. Any how many people will really share their cars with strangers?\n\n\n> With all the infrastructure tesla is developing for AI, they could conceivably rent it out to other companies such as AWS but for AI training. Tesla hasn't spoken about this to my knowledge but once FSD is fully trained and has incredibly low failure rates, this would be a great use for all that hardware.\n\nAgain where is the proof that they have anything tangible? I see Waymo driving driverless, I don't see Tesla. \n\n\n> Tesla bot? Similar to point 3 but 1% chance of succeeding. But again if they do succeed, trillions of dollars could be made.\n\n0% chance that they pull it off. Boston Dynamics is the leader here. Look at the R&D Budget of Tesla and with letting people go - how should that be accomplished?\n\n\n> they need to fix vehicle quality and service. It doesn't seem to be a problem right now since demand is so much higher than supply but in the future it could become a problem.\n\nIt is already a problem in Germany, in that they probably fail the TÜV after 3 years. I guess there might be potential lawsuits.\n\n\n\n> There seems to be a massive minerals shortage (lithium) coming. Not sure how tesla will handle this but even if they do secure all the materials they need, their price will be extremely high.\n\nAnd margins will compress, thus reducing the implied valuation.\n\n\n> With all of this being said tesla right now has a PE ratio of about 90. To give some context back in 2017-18 amazon had a similar PE while growing slower. They were already maxing out all their business lines. Tesla on the other hand is just getting started. They seems to have all the core technologies nailed and with a very solid roadmap ahead. So all in all, at this point in time, tesla seems to be a solid buy, just like amazon was 5 years ago, probably even better.\n\nAmazon is mostly a tech company, while Tesla is a car company with huge capex. Tesla is valued as though they would sell 10m cars, have twice the margin of Toyota with twice the Average Selling Price and twice the valuation. One misstep and they fall 80%+\n\n\n> Im curious to hear counter arguments to this. I keep seeing posts about how tesla is incredibly overpriced and that was true a year or two ago but imo not anymore.\n\nStill true and even more so given the high inflation of materials. Lithium was around 77k in 2019, it is now at 477k. Tesla is the Cisco of our era. Look at the stock price of Cisco and news from the dotcom time. Very similar.", "score": 4, "replies": [{"body": "thank you for actually reading and responding to my post in a meaningful way. I'd like to push back on a few points though: \n\n&#x200B;\n\n>They will not grow 50% this year. Inflation forces people to lower their luxury choices. With the cheapest Model 3 now being over 46k, the market is smaller.\n\nTesla has already fully sold out their entire production for the rest of this year and for the first half of 2023. This point only stands for the second half of 2023. But after that you could be right. This could be a nasty recession. Thankfully tesla has got excellent margins and can always lower prices. \n\n&#x200B;\n\n>Tesla is not at the forefront of battery storage and they don't have a technology advantage here.\n\nThey are pretty close to starting mass manufacturing their new cells. They are also building a 40 GWH / year megapack manufacturing facility which will increase their storage output by at least 5X. That all depends on the battery supply though. \n\n&#x200B;\n\n>THere is no indication that Tesla is any closer to true FSD than back in 2017.\n\nThere definity is. You can watch the latest FSD beta on youtube. Its very inconsistent and sometimes makes incredibly stupid mistakes but progress is happening for sure. Again I don't think this is factoring in too much into my post. This is too high risk / high reward. Their car business is much more solid right now. \n\n&#x200B;\n\n>Tesla is valued as though they would sell 10m cars, have twice the margin of Toyota with twice the Average Selling Price and twice the valuation. One misstep and they fall 80%+\n\nWell they ARE growing really quickly right now. So far they are on track to accomplish this goal. The stock reflects that.", "score": 3, "replies": [{"body": "> thank you for actually reading and responding to my post in a meaningful way. I'd like to push back on a few points though: \n\nThank you for a good response.\n\n \n> Tesla has already fully sold out their entire production for the rest of this year and for the first half of 2023. This point only stands for the second half of 2023. But after that you could be right. This could be a nasty recession. Thankfully tesla has got excellent margins and can always lower prices.  \n\nBut so is nearly every car maker at the moment, due to supply chains. I also don't think that Tesla could actually lower their prices. As they are in hyper growth mode, they are ramping two factories at the same time. That takes loads of capital. \n\n\n> They are pretty close to starting mass manufacturing their new cells. They are also building a 40 GWH / year megapack manufacturing facility which will increase their storage output by at least 5X. That all depends on the battery supply though.  \n\nI know of their plans, but that battery facility should have been finished end of 2019.\n\n\n\n> There definity is. You can watch the latest FSD beta on youtube. Its very inconsistent and sometimes makes incredibly stupid mistakes but progress is happening for sure. Again I don't think this is factoring in too much into my post. This is too high risk / high reward. Their car business is much more solid right now.  \n\nMy mistake, I did not make myself clear. There is no indication that FSD from now is ahead of the competition (looking at driverless Waymo and Mercedes that got regulatory approval for L3 auto driving and will also pay insurance if the car crashes). \n\n\n\n> Well they ARE growing really quickly right now. So far they are on track to accomplish this goal. The stock reflects that.\n\nI know they grow really quickly, the problem is that just a small hurdle will derail that valuation. I think Tesla in 10 years will be a tremendous company, but I am not sure if the return of the next 10 years can reflect that -  as so much is backed into the price already.", "score": 2, "replies": []}]}, {"body": "Toyota just released their first full EV too. Toyota doesn’t need to knock it out of the park in order to sell truckloads of EVs. It just needs good warranty and Toyota reliability for it to sell in huge numbers. Not everyone cares about 0-60 times or how big your LCD dashboard is.", "score": 1, "replies": []}]}, {"body": "Didn’t he state that Tesla is not his priority this year? His priority is that humanoid robot project he’s working on. Seems to me that the captain has abandoned ship, and has moved onto sinking the next one", "score": 6, "replies": [{"body": "The robot is 100% a Tesla project.\n\n(it won't be profitable for years, but it is tech-candy to recruit the best AI and robotics people they can... and SpaceX will probably buy a ton of them (for space missions))", "score": 1, "replies": []}]}, {"body": "$150 is fair value\n\nthere's really nothing super special about these ev's compared to other brands.", "score": 9, "replies": [{"body": "That would mean a PE of about 30, for a company growing 40% yoy and expanding in like 4 different industries?", "score": 1, "replies": [{"body": "Seems about right.", "score": 1, "replies": [{"body": "doesn't seem right to me. Every growth company SHOULD have a high PE ratio as investors look forward to the future. PE of about 20 should be considered good once the growth stage is over. See facebook, google, apple, intel. AMD, amazon nvidia, and AMD are like tesla in this case.", "score": 1, "replies": []}]}, {"body": "At $150 it’s actually a P/E of 20 and earnings are growing a lot faster than 40%. Don’t listen to the fools in r/stocks who think you should only buy a stock if it has a P/E <10 regardless of earnings growth", "score": 1, "replies": []}]}, {"body": "The stock price is for the company, not the cars.  What's special about these EVs: no one can make a comparable EV in mass quantities.  In 2-5 years they may catch up, BUT when they do they will be doing it at a loss / slight profit... TSLA will be doing it as a massive profit.", "score": 0, "replies": []}]}, {"body": "The issue with Tesla is the same issue that Netflix is now realizing: COMPETITION.\n\nYou have all the major brands that are going to be building electric vehicles. They have the know how, they have the scale and they have the money (just like Tesla). I would argue, more so for the major brand companies, they also have far better quality control!\n\nFundamentally, when comparing Tesla to its competitors, it is 100% overvalued.\n\nI would argue, especially if we are heading into any type of recession, that the company is, in fact, a short position candidate, not a buy.\n\nI think that when BMW, Mercedes, GM, Ford, VW all start to roll out their product, we are going to see that Tesla's stock is going to come back down to earth.\n\nI love Musk but every stock has its run and Tesla has had one hell of a run but now the competition is coming.\n\nNo, it's not fairly valued. It is overvalued in my opinion.", "score": 2, "replies": [{"body": "> They have the know how\n\nEh, not so much, but they are catching up there.\n\n> they have the scale \n\nThey do not.  They have large ICE factories to assemble sub-assemblies their ICE supply chain (developed over decades) supply them with.  There is not a similar EV supply chain, which is why Tesla is so vertically integrated.  They are ramping up their ability to make EVs, but they can't out-produce TSLA today or in 3 years.\n\n\n> and they have the money\n\nMost are indebt and will need another bailout in 2-5 years.  Tesla is sitting on a pile of cash.", "score": 1, "replies": [{"body": "\"Eh, not so much, but they are catching up there\". \n\nThe big four automakers have been making cars for years. They have the quality controls. They have the infrastructure and now, literally, they have the batteries. \n\n\"Most are indebt and will need another bailout in 2-5 years. Tesla is sitting on a pile of cash\". \n\nHere are the facts as it relates to the big automakers, including Tesla, and their cash on hand:\n\nTesla: $18 billion of cash on hand\n\nGM:  $26 billion of cash on hand. \n\nFord: $41 billion of cash on hand. \n\nBMW: $27 billion of cash on hand. \n\nSo, yes, Tesla certainly has cash on hand but the other automakers have MORE cash on hand. \n\nThe reality is that when you take an objective look at the situation, Tesla could see significant downtrends due to quality competition coming along.", "score": 2, "replies": []}]}]}, {"body": "Not when Google is stuck with a 20 PE and is an actual tech company lol. Come on down to our PE range.", "score": 2, "replies": []}, {"body": "All of this talk and almost no discussion about how a $700B+ valuation is justified.  PE is currently 92.  They warrant a high PE no doubt, but the question is whether \"high\" should mean 40 or 70 or 90 or 110.  That's the discussion I'd like to see.\n\nI don't think Tesla will continue 50% growth for long.  Yes, they've averaged that and probably still have some of that left.  But it's not clear to me that the timeline on that is indefinite.\n\nThe big question is when Tesla's sales will become demand-ristricted rather than supply-restricted.  With competition increasing, that might not be too far into the future.  A lot of people erroneously think the question is whether Tesla can make more money than Ford or VW.  That's not the question.  It's how much market share VW and Ford (and others) end up with and where that leaves Tesla.  Also, will Tesla's margins survive increased competition and a demand-restricted environment?  My guess is no.\n\nTo pre-empt the same arguments I see everytime this stock comes up: Yes, I get the whole \"The EV pie is getting bigger, so even reduced market share is still more EVs sold\" thing.  I also get that Tesla is currently supply-restricted rather than demand-restricted.  And I get that many legacy automakers have a capital and debt weight around their necks.\n\n&#x200B;\n\nEdit to add: Also, why is the Cybertruck also \"about to come out\"?  I've been hearing this for years.\n\nEdit to add #2: The future telling of Tesla folks reminds me of Enron's accounting.  Let's take all the future profit we expect to make from an idea we had today and count it as revenue right now!", "score": 2, "replies": [{"body": "> Let's take all the future profit we expect to make from an idea we had today and count it as revenue right now!\n\nTesla sells access to Full Self Driving beta right now but doesn't even count that as revenue right now ... as of a few months ago 50% was in the 'deferred revenue' bucket.  Doesn't sound very Enron-y to me.\n\nWhen everyone else ran an EV ad for the superbowl Tesla got a boost in sales: they are beating the competition in desirability (what consumers actually want to pay for), and in production (making EVs, at scale, is harder than most assume).  TSLA is doing the hard work of figuring out how to make them faster and cheaper than everyone else - if they need to drop the price a few thousand in 1-10 years because the order backlog has dropped it won't destroy their profit margin.  Lack of dealer network will also keep them more profitable than everyone else.", "score": 1, "replies": [{"body": "I didn't say Tesla was doing Enron-like accounting.  I said Tesla fans are exhibiting thinking that reminds me of Enron accounting.  \n\n\nI have no idea what the second paragraph has to do with my comment.", "score": 2, "replies": []}]}]}, {"body": "I'm new, but I think we're going to a new (old) era that many aren't familiar with. It seems like anything with high PE will eventually get crushed.  No one seems interested in hopes and dreams, and I think we're just getting started on that path.\n\ni.e. General Mills is destroying Tesla right now", "score": 2, "replies": [{"body": "You have to find a happy medium.  Growth At A Reasonable Price (GAARP) has become the common term.\n\nI will take a long term hold of AAPL, GOOG/L, MSFT, etc... every single day of the week over General Mills.  Twice on Sunday.", "score": 3, "replies": [{"body": "Likewise. I like all of those better than GIS too.\n\nConversely, I would take GIS over TSLA. But neither TSLA or GIS are on my list anyways.", "score": 2, "replies": []}]}]}, {"body": "Everyone tries to justify the price/p/e because there is \" extreme growth \" potential. The only advantage they have is a first foot in the door and the fact the CEO has a cult like following. Wait until every other major car company has EV's pumping out left and right. You think Apple won't have an EV coming? Shit google will probably have an EV. The point is Tesla's run will only last so long so that \"extreme growth\" reasoning doesn't really resonate. \n\nWhat MOAT does Tesla have honestly? Other than brand loyalty, there really is none.", "score": 1, "replies": [{"body": "Were investors in apple worried that apple would not grow in the future around 2010 ish when samsung, lg, htc and sony were starting to pump out good smartphones aswell? \n\nApple clearly managed to survive and thrive with the competition.", "score": 1, "replies": []}]}, {"body": "Pretty much agree.\n\nPersonally I don't count FSD or Tesla bot in my projections (if either pans out then hold on to your hats!). However, the potential in the energy sector alone is enormous (storage. Particularly in the context of virtual powerplants). Can't wait till they expand Tesla insurance to Europe. Insta-buy.\n\nThen there's the opening up of the supercharger network. With how reliable it is and how many more stalls per location are present compared to other charging networks it could very well become the go-to charging location for people. Globally(!). That could very well become massively lucrative.", "score": 1, "replies": []}, {"body": "Ok, against my better judgement I am going to bite.  If I look at the charts, Tesla is below it's 20/50/100/200 DMA's on the 3 month charts.  If I look at the 2 year charts Tesla is below the 20/50/100 DMA's.  It has support on the 200 DMA at $411.99.  So If I am a technical investor that's where I consider BTD. \n\nNow that's before the cost of capital has risen from Zero to 1.5-1.7% in 3 months with the Fed raising interest rates.  That cost will likely raise to 2%-2.25% after the next Fed meeting.\n\nBe Careful.", "score": -2, "replies": [{"body": "You are trying to determine the future value based on how the stock was valued three months ago..? That means absolutely nothing at all.", "score": 5, "replies": []}]}, {"body": "Bag holder identified", "score": 0, "replies": []}, {"body": "You’re wrong OP. It’s not fairly priced. It’s incredibly undervalued based on internal growth targets.", "score": -7, "replies": []}, {"body": "I don't agree that it's priced fairly.  \n\nI've been holding shares for a while but don't plan on adding until we get a better idea of where things are heading economically. I won't get into that because you're only talking about the valuation... and you also think aspirations and future products are going to matter anytime soon.\n\nComparing it to Amazon doesn't mean add anything to your argument. We were at a different phase of the market cycle. \n\nYou think it's a \"pretty decent buy\" but haven't bought any shares.", "score": 1, "replies": []}, {"body": "If you're argument for buying tesla is based on it being \"fairly priced\" you are way off the mark.\n\nas you stated its current market cap is $710B. its current market cap is pricing it as if its already achieved alot of its Revenue streams. its literally in the top 10 biggest company based on market cap (probably top 5 i think?)\n\nlook at all the other companies that are in the top 10. they literally had to fight tooth and nail and actually cement themselves into the world to get to where they are", "score": 1, "replies": [{"body": "Okay but this doesn't really refute any of the points I made. Yes their market cap is huge. But they are also very profitable and are growing very quickly....as expected from such a valuable company.", "score": -4, "replies": [{"body": "But that growth is priced in. As soon as that growth wavers, and it will, bye bye", "score": 3, "replies": []}, {"body": ">Okay but this doesn't really refute any of the points I made.\n\nif thats how you see what im saying, i dont think you really know what you're talking about. im not even talking about anything crazy here. literally fundamentals that even I understand", "score": 2, "replies": [{"body": "The fundamental analysis is that tesla is growing very quickly and very sustainably/profitably? That supports the high market cap. \n\nYou just said that since the market cap is higher than say toyota and volkswagen combined, then it must obviously be overpriced without actually looking at tesla itself.", "score": 1, "replies": []}]}]}]}, {"body": "wait until after earnings next month. nobody knows their delivery numbers for Q2 because of the supply chain issues and Shanghai covid lockdowns", "score": 1, "replies": [{"body": "Why would you make the decision on a long term hold based on one Q report? That doesn't seem like a sound approach to investment.", "score": 2, "replies": []}, {"body": "If you think you can get it at a lower price, why not?", "score": 1, "replies": []}]}, {"body": "It is interesting how Tesla is tied to Musk's personality.\n\nHe's now a Texas Republican, and liberals hate him. \n\nTesla might be around for a long time, but how is it worth more than Ford?", "score": 1, "replies": []}, {"body": "With a P/E of 92? Far from fair.", "score": 1, "replies": []}, {"body": "Tell me you don’t know how to value businesses without telling me you don’t know how to value businesses", "score": 1, "replies": [{"body": "What did I miss? Enlighten me", "score": 1, "replies": []}]}, {"body": "Pump that price so I can dump my bag.", "score": 1, "replies": []}, {"body": "Long Tesla in this market? I don’t even think Elon would do that tbh", "score": 1, "replies": []}, {"body": "Hahaha", "score": 1, "replies": []}, {"body": "I could be wrong but I don't see the hype around FSD. As a convenience feature, sure, but your car still depreciates. And if there's a million folks dumping their tesla's on the market as taxis that drives the price of taxi service down.", "score": 1, "replies": []}, {"body": "Tesla is not going to see \"extreme growth\" this year. I suppose anything could happen, but all while GDP is negative, that's not when these discretionary companies do well. Tesla still doesn't have a car that an average person can afford. When consumers are squeezed, this is what's cut.", "score": 1, "replies": []}]}
{"title": "Meta girds for 'fierce' headwinds, slower growth in second half -memo", "selftext": "June 30 (Reuters) - Facebook-owner Meta Platforms Inc (META.O) is bracing for a leaner second half of the year, as it copes with macroeconomic pressures and data privacy hits to its ads business, according to an internal memo seen by Reuters on Thursday.\n\nThe company must \"prioritize more ruthlessly\" and \"operate leaner, meaner, better executing teams,\" Chief Product Officer Chris Cox wrote in the memo, which appeared on the company's internal discussion forum Workplace.\n\n\"I have to underscore that we are in serious times here and the headwinds are fierce. We need to execute flawlessly in an environment of slower growth, where teams should not expect vast influxes of new engineers and budgets,\" Cox wrote.\n\nMeta did not immediately respond to a request for comment.\n\nThe memo is the latest rough forecast to come from Meta executives, who already moved to trim costs and pause hiring across much of the company this year in the face of slowing ad sales and user growth.\n\nTech companies across the board have scaled back their ambitions in anticipation of a possible U.S. recession, although the slide in stock price at Meta has been more severe than at competitors Apple (AAPL.O) and Google (GOOGL.O).\n\nThe world's biggest social media company lost about half its market value this year, after Meta reported that daily active users on its flagship Facebook app had experienced a quarterly decline for the first time. \n\nIts austerity drive comes at a tricky time, coinciding with two major strategic pivots: one aimed at re-fashioning its social media products around \"discovery\" to beat back competition from short-video app TikTok, the other an expensive long-term bet on augmented and virtual reality technology.\n\nIn his memo, Cox said Meta would need to increase fivefold the number of graphic processing units (GPUs) in its data centers by the end of the year to support the \"discovery\" push, which requires extra computing power for artificial intelligence to surface popular posts from across Facebook and Instagram in users' feeds.\n\nInterest in Meta's TikTok-style short video product Reels was growing quickly, said Cox, with users doubling the amount of time they were spending on Reels year over year, both in the United States and globally.\n\nSome 80% of the growth since March came from Facebook, he added.\n\nThat user engagement with Reels could provide a key route to bolster the bottom line, making it important to boost ads in Reels \"as quickly as possible,\" he added.\n\nChief Executive Mark Zuckerberg told investors in April that executives viewed Reels as \"a major part of the discovery engine vision,\" but at the time described the short video shift as a \"short-term headwind\" that would increase revenue gradually as advertisers became more comfortable with the format.\n\nCox said Meta also saw possibilities for revenue growth in business messaging and in-app shopping tools, the latter of which, he added, could \"mitigate signal loss\" created by Apple-led privacy changes.\n\nHe said the company's hardware division was \"laser-focused\" on successfully launching its mixed-reality headset, code-named \"Cambria,\" in the second half of the year. Meta was also focused on linking accounts across its virtual reality products and traditional social media apps, he said.\n\nZuckerberg will share more on the company's priorities and outlook at the company's next Q&A, he said. The weekly session is set to take place on Thursday.\n\nhttps://www.reuters.com/technology/exclusive-meta-girds-fierce-headwinds-slower-growth-second-half-memo-2022-06-30/", "id": "vol6bl", "created_utc": 1656629174.0, "score": 75, "upvote_ratio": 0.9, "num_comments": 71, "comments": [{"body": "Tbh this is probably bullish. There's nothing new here apart from the fact they're going to be operating leaner going forward. The data privacy and economic headwinds are already known and should be priced, but if they're seriously cutting back then their margins could see unexpected improvements.", "score": 33, "replies": [{"body": "Also this little factoid: \n\n>Interest in Meta's TikTok-style short video product Reels was growing quickly... users doubling the amount of time they were spending on Reels year over year, both in the United States and globally.\n\nWow!", "score": 9, "replies": [{"body": "Doubling for 2 to 4 users is hardly impressive /s", "score": -4, "replies": []}]}, {"body": "> Tbh this is probably bullish. There's nothing new here apart from the fact they're going to be operating leaner going forward.\n\nI would agree if Zuck wasn't losing his main profit maker, Sheryl Sandberg, while also diving headfirst into a potential moneypit boondoggle with The Metaverse™. I'm not saying they're definitely a bad investment, I'm probably wrong in the near term, but I'm going to stay away.", "score": 7, "replies": [{"body": "yeah dude, when i heard the news that Sherly Sandberg quit, i instantly stop using Facebook and Instagram ads.\n\ni get less order nowadays, not sure why, but Sandberg is so pivotal for my marketing.\n\n/s", "score": 29, "replies": [{"body": "LOL. People out here thinking Sheryl codes the thing and does the ads business by herself.", "score": 5, "replies": []}]}, {"body": "with what FB pays people i'm not unconvinced that they can't find a new Sheryl Sandberg lol", "score": 1, "replies": [{"body": "Sheryl left GOogle 14 years ago. And i think Google is doing fine", "score": 6, "replies": []}]}, {"body": "I wouldn't disagree with that. It seems reasonably valued near-term, but longer-term it's hard to feel confident. I worry it's going to be the next INTC and the market will continue to punish the stock regardless of earnings until their future ambitions for the metaverse are validated.\n\nThat said, I think it's worth a small position here. I think FB is far more innovative than people give them credit for and although FB's best days are probably behind them I don't see any direct competition to FB. Tiktok is more of an entertainment app imo and we've seen FB coexist with other social media services for years. This mass exoduses of users that investors keep predicting doesn't seem very likely to me.\n\nI wouldn't bet against them just yet and near-term downside risk seems limited given the valuation. They also have the cashflows to support the stock with buybacks at this valuation so my guess is that's what will happen if it continues to go lower.", "score": 1, "replies": [{"body": "To be fair, the stock price only dropped so much this year due to macroeconomic condotions and fear. In a normalish economy, they wouldnt be down 60% from their all time peak while only making more FCF than their all time peak", "score": 3, "replies": []}]}]}, {"body": "Sounds like coping hard and a big dose of misguided hopium. Even Mets themselves are warning for slolw growth, the privacy laws will more or less kill their monetization...and they got *no alternative revenue stream*.\n\n\n\n\nAdd to this no one, litterary no one under 30 uses Facebook. Heck, Reddit is starting to have as many unique users as Facebook ffs. Meta is dying, it'll not die over night but I'll slowly fade into nothingness unless they managed to diversify hard and quickly. TikTok was just the first blow, Facebooks decline started when they failed to grow organically", "score": -6, "replies": []}]}, {"body": "Maybe they should have decided not to kill Instagram with their new, insanely terrible app update", "score": 27, "replies": [{"body": "what did they do?", "score": 4, "replies": [{"body": "They changed the layout while scrolling, made it damn near impossible to view anything but ads and videos. They attempted to make it like tiktok but it’s horrible", "score": 25, "replies": [{"body": "Hmm I just updated but it looks the exact same to me. Maybe they rolled it back", "score": 15, "replies": [{"body": "Maybe A/B testing. Roll out \"updated UI\" to relativelly small number of users and see how they react. \"Relativelly small\" can be as much as 10% orbas small as 0.1%, which in case of Instagram would probably still be millions.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "All platforms have ads tho. can't get away from it", "score": 1, "replies": []}]}, {"body": "It's literally the exact same. What are you talking about?", "score": 2, "replies": [{"body": "Have you updated it in the past few days? It’s noticeably different on the home page at least", "score": 1, "replies": []}]}]}]}, {"body": "What was the update", "score": 1, "replies": [{"body": "See my other reply but basically they tried to make it TikTok but instead alienated everyone from their followers and now all it is is crappy videos and ads", "score": 3, "replies": [{"body": "well that's just the direction things have been going. Videos are much better for engagement then pictures, obviously.\n\nThey have been pushing many of their content creators to make / switch to reels for a while now.", "score": 1, "replies": []}, {"body": "Do you have a software version number?", "score": 1, "replies": [{"body": "How would I find that?", "score": 1, "replies": [{"body": "Might be in the app settings under \"About\"", "score": 1, "replies": [{"body": "Version 241.0", "score": 2, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 18, "replies": [{"body": "> \"operate leaner, meaner, better executing teams\" is some shit my boss would say before they start layoffs.\n\nlol yep, I've been around the block a few times and this language sounds (sadly) familiar.  Only a matter of time...", "score": 6, "replies": [{"body": "Like is it days.  Or do you think hours?", "score": 1, "replies": [{"body": "Minutes", "score": 2, "replies": []}]}]}, {"body": "sir, this is r/stocks \n\nr/technology is this way", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "It depends. If cost of keeping an unneeded employee for a few months is less than cost of hiring one when they are needed again, then they should just wait. It’s super expensive to hire talent, and every new hire comes at peak market rate.", "score": 2, "replies": []}]}]}, {"body": "This is a shitshow of communications. \n\nWhat is this supposed to be? A motivational speech? “We need to execute flawlessly and so no fuckups, or else! And there’s no help coming—if there’s someone good out there to do the job… nope! Let Google hire them!”\n\nReally this is like Zuck nerdraging with power shouting at his underlings to row the oars faster while he turns everything into an obtrusive advertisement or sleazy political ad.", "score": 15, "replies": [{"body": "Exactly, it’s expectation management and this is the wrong way to do it. Classic mistake.", "score": 2, "replies": []}, {"body": "It actually sounds like the same whip Musk uses on Tesla and SpaceX employees. Hes already claimed that employees needed to work harder because bankruptcy was in the horizon", "score": 1, "replies": []}]}, {"body": "Well, yeah, no shit.", "score": 5, "replies": []}, {"body": "Oh god.  Another honey pot for 'META GOING TO ZERO.  HAS BEEN.  DOOMED, I SAY!!!\n\nI added when it was in the $150s last week.  If it drops more, I'll add more.", "score": 4, "replies": [{"body": "Noones saying its going to zero but this memo is fairly alarming which is probably why we saw a dip this past week on meta. I’m long meta with a price avg of 182 but i won’t be jumping in just yet to avg down.", "score": 4, "replies": [{"body": "> which is probably why we saw a dip this past week on meta\n\nlet me know what you didn't see a dip on this past week", "score": 5, "replies": []}, {"body": "Then you're new to this sub.  Every Meta post devolves into name calling, rhetoric... pretty much anything except actually stock talk.", "score": 17, "replies": [{"body": "To be fair, I think Meta's a terrible company mainly because they created such a terrible reputation, so the name calling/rhetoric is not entirely irrelevant to the stock. People buy crappy products from companies with a good reputation, and they'll skip great products from companies with a bad reputation. Facebook has crappy products and a bad reputation. All they have going from them is their ads business.", "score": 0, "replies": [{"body": "\"they're total shit. All of their products suck except for their ads business\" - man said in review of advertisement business", "score": 4, "replies": []}]}]}, {"body": "Is this memo really that alrming though? I feel like Musks rhetoric about Tesla was far more ominous and yet was far more favorably received", "score": 1, "replies": [{"body": "Price drives narative. I'm 50% long on Meta", "score": 2, "replies": [{"body": "Probably will pay off", "score": 1, "replies": []}]}]}, {"body": "What new information did you gather from this memo exacly? Only that they will operate leaner now", "score": 1, "replies": []}]}, {"body": "Are you the guy who bought $400k of Meta the day it tapped down?", "score": 1, "replies": []}]}, {"body": "Fuck Facebook, let them go down.\n\nTraitors to the American people.", "score": 2, "replies": [{"body": "Jesus so dramatic", "score": 7, "replies": []}]}, {"body": "GIRD YOUR LOINS, BOYS, GONNA GET ROUGH!", "score": 1, "replies": []}, {"body": ">Interest in Meta's TikTok-style short video product Reels was growing quickly, said Cox, with users doubling the amount of time they were spending on Reels year over year, both in the United States and globally.\n\nWhen your only mission objective is to glue people's eyes on screens. I wonder how long they can keep attracting talent for their rotten business.", "score": -6, "replies": [{"body": "People chose how they spend their time. Don't blame the company blame the users", "score": 15, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well i think parents are generally to blame because they can't raise their children in a way that would make them understand not to use these platforms", "score": 1, "replies": []}]}, {"body": "That's like saying, \"Don't blame the illicit drug producers who pour a lot of resources into making their product as addictive as possible, blame the addicts for choosing to use it.\"", "score": 0, "replies": [{"body": "No one makes you try the drug and let's be honest millions of people don't use fb. This is the easiest way for anyone to avoid personal accountability which is the easy thing to do. Always blame someone else its never your personal fault", "score": 2, "replies": [{"body": "So, don't put any blame on the producers who work really hard to make it as addictive as possible?", "score": 0, "replies": [{"body": "No one is forcing you to use it so if you think you're not capable enough to resist it you shouldn't. It's not hard. You don't die if you don't have fb or Instagram last i checked?", "score": -1, "replies": [{"body": "I don't have FB or Instagram.\n\nI think there's predators out there that take advantage of other people's weakness, and some accountability goes to them for their actions.\n\nI don't think one should fully blame addicts, and divert zero blame to the people who carefully craft and refine the product specifically to be addictive.", "score": 1, "replies": [{"body": "Do you also blame the drugealer for getting you hooked to crack?\n\nOr do you blame the company that came up with fentanyl for each addiction? And I'm not talking here for people that were put on fentanyl and got addicted due to a medical procedure.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Rethink this.", "score": 1, "replies": [{"body": "The same way you and I don't spend hours on fb and Instagram the same others shouldnt. America has a long history of defecting the blame on corporations and everyone is afraid of taking personal responsability. It's always someone else's fault. This also shows with the new proposed carifornia bills where companies are meant to limits kids time and not parents. Whos at fault there the parents who can't raise their children?", "score": 1, "replies": [{"body": "I agree with you, but I do think companies are partially, to blame/responsible for mitigating misuse.", "score": 1, "replies": []}]}]}]}, {"body": "can u at least try to make rational discussion regardless of how much you hate the company? lmao", "score": 4, "replies": []}, {"body": "You really must hate social media. And streaming services. And TV. And phone manufacturers. And every business that has to do with computers.", "score": 2, "replies": []}]}, {"body": "TikTok is seriously destroying META right now in short length content. A ban on Tiktok would be a boon for them, but I doubt it happens because America rarely does something like that.", "score": -1, "replies": [{"body": "Reels seems to be making a counterattack", "score": 7, "replies": []}, {"body": "Reels is up 80% in 3 months.", "score": 3, "replies": []}]}, {"body": "I did my part by deleting my profile.\n\n\nWOULD YOU LIKE TO KNOW MORE?\n\n\n[YES] NO", "score": 0, "replies": []}, {"body": "Let's see how low META can go then. I wonder if we'll see 140 within the next weeks.", "score": 1, "replies": []}]}
