{"title": "Everyone thinks that there is a market crash coming, but the preplanned market crash had already happened. Meme and high PE/no profit stocks that are/were widely held by retailers had been obliterated except for a few champions.", "selftext": "Corporations (buyback), institutions, highly talented portfolio managers who has a side gig as our elected officials and boomers owned most of the stocks, and they have the money and mean to own everything.  While they were buying stocks, we were playing option lotteries.\n\nI was bearish for a while, and after this week, I am turning bullish.  The election is upon us and recession tends to not come when two of the country biggest spenders are fighting for their political careers.\n\nI am calling the bottom!  Bers r >!$@#\\*!<!\n\nedit: Upvote rate showed how we are equally divided on the market direction.", "id": "vexnyu", "created_utc": 1655524204.0, "score": 4, "upvote_ratio": 0.52, "num_comments": 75, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|1 month ago\n**Total Comments**|240|**Previous DD**|\n**Account Age**|4 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vexnyu)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vexnyu)", "score": 1, "replies": []}, {"body": "Make a ban bet and show positions so we can all laugh at just how fucking stupid you are.", "score": 89, "replies": []}, {"body": "I’m inversing your calls", "score": 26, "replies": []}, {"body": "But I will go down with this ship. And I won't put my hands up and surrender. There will be no white flag above my door. I'm in love and always will be.", "score": 36, "replies": [{"body": "Upvote Dido", "score": 8, "replies": []}, {"body": "Username checks out.", "score": 4, "replies": []}, {"body": "That was so good", "score": 1, "replies": []}]}, {"body": "Catch this falling knife 🔪", "score": 48, "replies": [{"body": "What falling knife, you mean the one that has already fallen 20+%? And it's gonna fall 40% more after this right. Just wait till it hits 0 bro. Then all in. Sometimes I think bears just be altering their own realities lmao", "score": 1, "replies": [{"body": "If you think that the longest bull market in the history of the equities is ending with just a 22% pullback, you will be sorely mistaken. Use common sense.", "score": 32, "replies": [{"body": "If you think either one of us can predict what's about to happen with this cluster fuck of a market then you're lacking the sense bro.\n\nIt could go sideways for years before plummeting. Or just shoot the fuck up cause why not. Who are we to predict what's about to happen and when (especially when)", "score": -18, "replies": [{"body": "But you can make assumptions based on the information given from the economy. huge amounts of money pumped into the market because of the GFC and Covid, now the rates to pay back that debt is going up, hmmmmmmm what ever could happen?", "score": 11, "replies": [{"body": "Yeah. Except one could make an assumption that we have already crashed and that it's only uphill from here. There are so many assumptions that can be made and only one of them will turn out to be right. I'm just saying these are literally unprecedented times. You might be right. Or not.", "score": -6, "replies": [{"body": "Yeah we all understand we could be right or not… no need to state that. What upside do you currently see? Keen to hear from\nthe other side", "score": 1, "replies": []}]}]}, {"body": "We’ll you can make an informed decision about whether the supply-side issues are going away, and whether inflation is going to vanish overnight. The answer is no. This is going to have continued impacts on the real economy, businesses will underperform and you’ll soon start to see job losses in the banks which will spread to corporates as well, under pressure to reduce costs in the face of increasingly high interest rates on their debt mountains. All of that will further terrify the consumer, stifle spending but not fix the supply-side issues that are ramping up costs. This is going to get ugly and people are going to sell because they will need the liquidity or because they are terrified of not having it. Other asset classes will follow, in particular watches and wine and cars.", "score": 2, "replies": []}]}]}]}]}, {"body": "Would you be so kind to tell me which stocks you are buying, so I can short the shit out of them?  Thanks Mini Jim Cramer.", "score": 32, "replies": []}, {"body": "Here lies Tomi48. RIP at tender age/IQ of 48.\nDied doing what he/she/they/it loves best: Fighting bears", "score": 34, "replies": [{"body": "RIP (Retard in peace)", "score": 8, "replies": []}]}, {"body": "There is A LOT of negative sentiment around, and a lot of selling to go with it ever since November. However no capitulation, there is always capitulation. I’m waiting for that.", "score": 9, "replies": []}, {"body": "Some people don't remember inflation and interest in the +15% range. As far as I'm concerned we haven't gotten all that bad yet.", "score": 14, "replies": [{"body": "I don't think we'll get there. Stores have an excess of inventory right now. There should be some downward pressure on the cost of goods.", "score": 2, "replies": []}]}, {"body": "Who let Cramer’s coke mule on here?", "score": 14, "replies": [{"body": "![img](emote|t5_2th52|4886)", "score": 1, "replies": []}]}, {"body": "You sound like you actually follow Jim Cramer’s advice", "score": 9, "replies": []}, {"body": "Lol…. Already happened? You wish. It’s happening. Literally 2 days ago the DOW hit its lowest point, under 29000… \nAnd you think it’s over? Lol.. Buy calls then…\nSee you after the next inflation hike when the housing market crashes.. You ain’t seen nothin yet.", "score": 11, "replies": []}, {"body": "I’m buying puts on your bullish portfolio", "score": 5, "replies": []}, {"body": "Can you tell us your positions so we can take the opposite side of your trade", "score": 6, "replies": []}, {"body": "Yes, thank you wallstreetbets for showing the way \nMaybe when $gme and $amc collapse people will realize it", "score": 3, "replies": []}, {"body": "Black Tuesday confirmed ![img](emote|t5_2th52|4887)", "score": 3, "replies": []}, {"body": "Market is not healthy but he’s right. The stocks that got obliterated in end of 2021 are going to see upward momentum now.", "score": 3, "replies": []}, {"body": "I think your 100% correct", "score": 3, "replies": []}, {"body": "fUndeMentALs r rbitchary we jus compare this PE to that PE show me 20%+ FCF and share buybacks (fuck dividends), with management that aren’t try to scam you like the ARKK w/ Roku.", "score": 2, "replies": []}, {"body": "Ya… this isn’t it. This sort of thinking involves the belief in human causes determinism. This implies both a solid plan which we would have to remain unaware of, a slim possibility, and the planners/underlings to be nearly perfectly competent in executing their will, another near impossibility. Together they form a ridiculously low likelihood of your statement being true.", "score": 2, "replies": []}, {"body": "Not until September when the Fed pivots and starts printing again", "score": 2, "replies": [{"body": "You think the fed is going to reverse in September?? 😂😂😂 try september 2024", "score": 3, "replies": []}]}, {"body": "Show your fucking positions pussy or GTFO", "score": 3, "replies": []}, {"body": "I bought AMD.  It was a buy/strong buy on seeking alpha and interactive brokers.  It’s PE ratio is 26, which is relatively low.  Relatively.  Airlines were bargain rate this week.  Almost as low as when air travel shut down.", "score": 2, "replies": [{"body": "Oh well if seeking alpha said it then just go all in bro", "score": 4, "replies": []}, {"body": ">Airlines were bargain rate this week\n\nJust in time for canceled vacations when people start worrying", "score": 3, "replies": []}]}, {"body": "Jim Cramer fan?", "score": 2, "replies": []}, {"body": "I read this in Jim Cramer's voice.", "score": 2, "replies": []}, {"body": "Don't fight the Fed", "score": 2, "replies": []}, {"body": "Let me guess, you’re young and this is your first crash?", "score": 2, "replies": []}, {"body": "There's only so many knives I can catch though.", "score": 1, "replies": []}, {"body": "Come on, man. Sleep on it, bet ya feel different in the morning", "score": 1, "replies": []}, {"body": "Another post in my feed telling me to keep buying stocks all the way down. I am utterly shocked, just like I was last Friday.", "score": 1, "replies": []}, {"body": "Cool", "score": 1, "replies": []}, {"body": "The condition of the market wont play as big a role as u think for voters. Not that many people r directly involved in it, and close to retirement 401ks might even still be a little up from precovid. Theyd be wise to trade all that immediately for bonds.", "score": 0, "replies": []}, {"body": "🍁🍂🔪, 🖼️4️⃣🤦‍♂️", "score": 0, "replies": []}, {"body": "Y’all think the exchange issue this morning where they glitched all the bid ask spreads was the plunge protection team hacking into the exchange.  Someone asked tastyworks ceo today and he brushed it off real quick like ohh. That’s just the exchange, technology can be glitchy. Thoughts?", "score": 0, "replies": [{"body": "#&#128065;&#8420; *Illuminerdy confirmed* &#128065;&#8420;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 1, "replies": []}]}, {"body": "Bid ask spreads on what?", "score": 2, "replies": []}]}, {"body": "I would prefer total collapse and depression so I can buy a house without getting into an all cash bidding war with a hundred people.", "score": 0, "replies": []}, {"body": "It’s all priced in - remember that", "score": 1, "replies": []}, {"body": "The recession is not likely to come around elections.  Lol the last 2 happened right around election time file this under another person talking out of their ass", "score": 1, "replies": []}, {"body": "Not any different than any other market crash.  The big names were the last to fall.", "score": 1, "replies": []}, {"body": "Believing that things are looking up doesn’t make it so. Look around..", "score": 1, "replies": []}, {"body": "Meme and high PE had been obliterated? LMAO what about gme and tesla? They are still overvalueted", "score": 1, "replies": []}, {"body": "!remindme 30 days", "score": 1, "replies": [{"body": "I will be messaging you in 1 month on [**2022-07-18 13:52:55 UTC**](http://www.wolframalpha.com/input/?i=2022-07-18%2013:52:55%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/vexnyu/everyone_thinks_that_there_is_a_market_crash/ictyzd3/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fvexnyu%2Feveryone_thinks_that_there_is_a_market_crash%2Fictyzd3%2F%5D%0A%0ARemindMe%21%202022-07-18%2013%3A52%3A55%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20vexnyu)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Another 20% and we float back slow", "score": 1, "replies": []}, {"body": "I don’t think you’ve been paying attention if you think this is as low as we go.", "score": 1, "replies": []}, {"body": "Only scalping work. Short/long 1 min chart.", "score": 1, "replies": []}, {"body": "Ban bet, you cunt.", "score": 1, "replies": []}, {"body": "My bet is the S&P needs to get below 3000.  Then these stocks will be cheap.  The VIX hasn’t even hit 40 yet this year.  There has been no capitulation and there is almost no positive news coming.  People need to learn that you can’t fight the fed when you are investing.  The fed will win every time.  QT and massive  interest rate hikes coupled with high inflation is terrible for companies  performances.", "score": 1, "replies": [{"body": "Of course you do not fight the feds, but at the same time, you have to look at ownership and liquidity.  Fiscal policies are going to inject $trillions more into the economy, and feds raising interest rates or ending QE would not effect earnings for those companies.\n\nLet's look at ownership, who own what - meme stocks, no profit/high pe stocks were obliterated: PLTR $35 ->$8, COIN $340 -> $50, RBLX $130 -> $28, UPST $400 -> $25.  This is how a market crash looks like.  \n\nNow let's look at stocks that have corrected and will not crash: $AAPL, $AVGO, $XOM, $CL.  These stocks have buyers and buying back their own stocks.  If they stop their buyback, I will begin to worry.  Also look at 13F filings.\n\nFinal thoughts, if you track higher interest rate, it doesn't cause market crashes.", "score": 1, "replies": [{"body": "I’ve been trading in and out of oil stocks including XOM.  I’ve also made some great returns.  The reality of the matter is that inflation is acting just like a huge tax increase on everything we buy. Eventually people have to cut back.  With the fed increasing interest rates simultaneously, people cannot afford to borrow the same amount.  The fed is going to have to increase rates at a much faster and much higher pace to get inflation under control.  It’s going to cause a recession and I believe we are already in it.  Next months GDP print should confirm it started 1 Jan 22.  When the average person hears we are in a recession they will cut back spending.  This will cause stocks to crash.  Companies will need their cash to ride out the recession and not for buybacks.  We are at the beginning of an economic downturn right now, not the end.", "score": 1, "replies": [{"body": "I am going to make another bold call - there is no recession!  The only serious threat is out of control inflation, but it is policies that are mainly driving the inflation problem which has been bad for a while now.  \n\nDNC is very aware and worry about inflation leading up into the mid-term, but they can't collapse the market which will make their chances of winning worst.  There may be a GOP super majority.", "score": 1, "replies": [{"body": "I hope you are right that there is no recession but we will find out shortly.  Recessions are normal economic cycles,  we will have one sooner or later,", "score": 1, "replies": []}]}]}]}]}, {"body": "yeah - this is not just a crash / but I guess by sept u know this", "score": 1, "replies": []}]}
{"title": "WAYS TO REALLY FIGHT INFLATION", "selftext": "[removed]", "id": "vfduo1", "created_utc": 1655581856.0, "score": 16, "upvote_ratio": 0.74, "num_comments": 79, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|1 month ago\n**Total Comments**|33|**Previous DD**|\n**Account Age**|1 month|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vfduo1)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vfduo1)", "score": 1, "replies": []}, {"body": "1. Wont happen\n2. Must be out of your mind if you think we are going over 5% in this lifetime.\n3. HAHA nancy pelosi and the other insider traders would have a fit\n4. **This is the plan. Inflate the currency to shit and then collect more tax revenues to pay it down.**", "score": 16, "replies": [{"body": "Or collapse the government through insolvency, destroying/eliminating democracy, and make a new system, one without rights and freedoms\n\nSome might even call it a Reset", "score": 16, "replies": [{"body": "You'll own nothing and like it", "score": 11, "replies": [{"body": "I'm going to poop in a bag and put it on the feds doorstep and light it on fire, ring the door bell and run, so they know their actions have consequences", "score": 3, "replies": [{"body": "and then they will own you and your steaming hot pile of  shit.", "score": 2, "replies": []}]}]}, {"body": "Sad but True", "score": 1, "replies": [{"body": "Power of the people could win, imagine people stopped using money, or took back the land, its just too bad we are all brainwashed and incapable of working together\n\nSupport ukraine... putin bad, military industrial complex good.", "score": 2, "replies": []}]}]}, {"body": "What's the numbers after trillions?", "score": 2, "replies": [{"body": "Ask Zimbabwe", "score": 8, "replies": []}, {"body": "Gorillion", "score": 4, "replies": []}, {"body": "Quadrillion", "score": 2, "replies": []}, {"body": "Brazillion", "score": 2, "replies": [{"body": "Game over", "score": 2, "replies": []}, {"body": "Whoa whoa, why you dragging Brazil into this!", "score": 1, "replies": []}]}]}]}, {"body": "The heart of the problem unfortunately is popularity politics.", "score": 5, "replies": []}, {"body": "If they just trade inflation in darkpools then it will never go up.", "score": 6, "replies": []}, {"body": "That debt will never be paid back lmao. It wasn’t designed to be paid back. The US is essentially in debt to itself. If you owe to yourself money you never need to pay it back. \nBesides the situation you’re calling would 100% result in civil war. Likely world war", "score": 6, "replies": [{"body": "All the debt has interest, owed to central banks.\nUs government spends 14% of its income on just the interest, not even the debt.\n\nCentral banks  need to be liquidated/erased with military intervention.\n\nProblem solved.\n\nWe the people go hungry, while the oligarchs bellies are full...insurgency time", "score": 4, "replies": []}, {"body": "They owe money to foreign entities that embezzle the funds in and out the country", "score": 2, "replies": []}, {"body": "The Cost to service that debt is a lot, it would only make sense to pay it down w/o borrowing to cement the dollar as world reserve currency for decades to come", "score": 0, "replies": [{"body": "I’m no economist but there are benefits and drawbacks to a stronger dollar. Most of which relate to international trade and purchase power abroad.", "score": 1, "replies": [{"body": "Well a weaker dollar means inflation and people not bieng able to afford a normal cost of living. Also ppl seeing the purchasing power of their savings vanish away.\n\n I dont believe this is the answer", "score": 1, "replies": [{"body": "It's moments like these I fully appreciate the whole WSB / Idiocrasy / autist vibe.  You all almost seem innocent, it's so pure.", "score": 1, "replies": []}]}]}]}]}, {"body": "Also it would result in more than a slight up tick in unemployment. The number of cash flow positive companies would decrease dramatically as demand for everything that isn’t essential to support life is diminished to next to nothing. I can promise you that people will loot and kill before they go hungry in this country", "score": 2, "replies": [{"body": "The jobs that stay are the real jobs b/c they work for a profitable business, not a business that needs loose monetary policy to survive", "score": -4, "replies": []}]}, {"body": "I fight inflation by getting free dinner on Grindr", "score": 2, "replies": []}, {"body": "You’re not wrong. But none of that will address supply shocks. Government needs to shitcan climate rhetoric and ESG until we can unwind as above.", "score": 3, "replies": []}, {"body": "Step 1. \nDon't elect Democrats.\n\nStep 2.\n(See Step 1)\n\nStep 3.\nWait for the floor and buy in.", "score": 0, "replies": [{"body": "What is a floor", "score": 3, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "Spending money you print and growing the govt with that money is easy", "score": 1, "replies": [{"body": "Rampant money printing (Quantitive Easing) is a relatively new issue that has been perpetuated by both parties. In fact irrc it was begun by an appointee appointed by a R. So thats total bubkus. Furthermore, how do you account for all the history before the 21st century? We have market data and GDP data from more than just the last 20 years, progressive/leftist administration’s are statistically synonymous with economic growth and income equity for 200 years. How can you conveniently explain that away with quantitive easing, which has been rampant regardless of party affiliation. In fact Jerome Powell was appointed by Trump and began his throttling up of QE under Trump. You have less than no argument here so far. Maybe the funniest thing about your post is that you’re describing a very direct and far reaching Federal intervention in the economy, thats not very conservative of you eh? And if you were “sleepy joe” im sure you could convince congress to support your ideas.", "score": 0, "replies": [{"body": "I didnt agree with QE1 forget about QE4. I am for abolishing the Federal Reserve and to go back to the way it was before 1913. The Fed was created under Woodrow Wilson another Demonrat.  I am against spending money from the goverment more than they accumulate in taxes", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "What the goverment has done with medicare/medicaid is waste money because the U.S is among the most unhealthiest countries in the world. IF they didn have these things than there would still be health insurance but free market would take effect. And over time free market and capitalism makes things cheaper and more accessible.\n\nWith Education the biggest mistake the goverement ever made was to get into financing education if a private bank is not willing to give a student loan on gender/diversity studies than why the fuck should the goverment. The reason tuition is so high is because the universities know they can charge whatever they want and FAFSA will write a check to cover that. The person at the end of the day on the hook is the student. \n\nSocial security is the biggest scam going, because it forces you to put 6.25% of your income and makes your employer match 6.25% into treasury bills. Why, its my money I should have the power to invest it where I want to not the goverment. And even the Social Security administration has said it will run out of money by 2033. Treasury bills grow at 2-3% but if that money was given a real chance it could have grown at a much faster rate.\n\nThe New deal should have had a sunset clause built in because it is doing more harm than good.", "score": 0, "replies": [{"body": "SS give that to self directed investors, cool 12.5% in my account added every pay day.  Ya I'll never touch that tell I retire. My daughter gets married. Remodel the house. HVAC system. Solar it will pay for its self if I buy the panels  we really need a car. Dog has ruined the furniture and carpet it still smells like dog.", "score": 1, "replies": [{"body": "you retard the Social security administration is going bankrupt and it grew at 2-3%. Imagine if you invested that money in realestate or precious metal or started a company or just a basic S&P fund you would have more money than you will get from social security. And the goverment would have less leaches working at the social security office.", "score": 1, "replies": [{"body": "The 40k a year income earners would spend it long before it had a chance to compound it's growth. Was my point. I saved for retirement myself, and doing very well but other people I've worked with find reasons to withdraw, or borrowed against and contribution goes towards a low interest loan payment. For a couple of years. Not everyone can make it work.", "score": 1, "replies": [{"body": "Than thats their fault. they should have thought about that when they were being reckless with money. But if the govt was to take away social security than ppl would be more cautious b/c they are their own safety net", "score": 1, "replies": [{"body": "I would love to Believe that, idea it would have to be untouchable no matter what. No way you could withdrawal from the account tell 60?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Checks the Iraq / Afghanistan war.  Nope, not started by a D.", "score": 1, "replies": [{"body": "If someone attacks us on our land we have the full right to go there and fuck them up.  Wars do end but medicare/medicaid and social security are forever.", "score": -2, "replies": [{"body": "Wars end, but the military indutrial complex hasnt slowed down since 9/11. Yes medicaid and social security are forever… because that money is going towards people. Do you want people to stop existing? Or just the poors?", "score": 1, "replies": []}, {"body": "It took 20 years for that war to end. Bombed them back to the Stone Age, wasn’t enough.", "score": 0, "replies": []}]}]}]}]}, {"body": "It is a statistical fact that in this country economic growth and surpluses tend to increase under leftists while the opposite is true of conservatives. The same trend is evident in state budgets. With much more frequency than any statistics anomaly can account for, Red states run red, blue states contribute to the Federal budget and bail them out. Both parties are cancer but conservative policies are far more often completely reactionary, often to “own the libs” or simply not supported by science or empirical evidence. Add to that the GOP is openly corporate bootlickers and will defend that position till they die. At least the dems are somewhat ashamed and hide their corporate owners. Republicans will be the first ones calling for welfare for the rich when their shell game finally goes bust and if the dems are smart (they aren’t) theyll push to finally fix this broken oligarchic casino. Fuck anyone who pushes otherwise ![img](emote|t5_2th52|4271)", "score": -1, "replies": [{"body": "You are so brain washed you can't even do simple math. We are so fucked.\n\nDebts and deficits  increase mostly under demonrats", "score": 2, "replies": []}, {"body": "Also if you're going to talk about statistical facts, post them otherwise stfu. \nUnder Trump the United States economy was so good that it took a plandemic, unconstitutional lockdowns and mandates  to bring it DOWN to where Obama had it in his peak...\nUnemployment across minorities and the American public in general was at the lowest it has ever been in the history of the country. \n\nToday there's about 12 million job openings across the US.. Almost very business, and I mean damn near every business up to an including taxidermy services have now hiring signs in their window, zero filled out applicants for employment... Democrats did that.\n\n\n\nThank you for coming to my TED talk", "score": 1, "replies": []}]}]}, {"body": "A blueberry pie is cut into 8 pieces. A big blue can of Fosters costs a half a pie.\n\nYou servant get 1 piece of pie per hour.\n\nIt will take you 4 hours to drink one can of Fosters.\n\nBut if they introduce 80% more money into the system now it is like they cut the pie into 14 pieces.\n\nNow you have to work 7 hours to get your big can of Fosters.\n\nEconomics is simple. Its all the market manipulation stuff thats complicated. A cold beer equals a piece of silver the size of a dime. 2022 AD or 2022 BC", "score": -1, "replies": []}, {"body": "Total us debt = $91 trillion \n\nhttps://www.usdebtclock.org/\n\nFun!", "score": 0, "replies": []}, {"body": "I wouldn't say that both parties are cancerous. I would equate them both more to tumors. Only one is malignant and one is benign. The GOP is relatively benign in that they don't really do or haven't done shit for the ppl or party when they are in charge. But... We've seen what happens in less than 2 years when the Democrats have absolute power in the 2020s and beyond. We had such a chance with Bernie Sanders but the Democrats did their thing... \n🤣😂 Sry but you lost me at corporate boot lickers and bail outs. As if we didn't just send $40 billion to Ukraine on top of the billions we've already sent (but we're not getting involved 😉). $12 million to Pakistan for gender studies... The trillions of dollars that were printed out of thin air to pay people not to work..\nBetween the NBA, Disney, the NFL, and every other woke ass corporation in America cow towing to the regressive woke angry mob,  there's nothing but shoe polish and dog shit on the tongue of every regressive leftist that voted for the pedophile. The kind of mfs that scream to \"abolish the police\" while trying to burn someones house down. But gets shot by the homeowner and the first thing they do is call the cops on the homeowner. Ironically who is later arrested because the police department might get burned down by a woke mob of rainbow haired antifa. Because glorifying and immortalizing career violent criminals seems to be the MO of the regressive left.\n\nNotice I keep using the term \"regressive left\". The Overton window has shifted so far to the left and such a short time, regular ass Democrats and liberals  are considered far right white supremacists if they no longer agree that a man can be a woman and a cat can be a dog...\nFor fux sake, the lefts politics have now dictated that Obama is a right winger🤦‍♂️\n\nThe markets aren't falling just because of uncertainty. They're crashing because people have to liquidate their portfolios to buy gas and feed their damn families.. Biden and his shit policies initiated that fall of domino's.\n\nBut Trump said mean shit to Rosie O'Donnell's fat ass, so my gas has to be $7+ a gallon and cost of feeding my children has risen over 30% in get this, a  far left Democrat ran state. Not just any Democrats. The kind that wear rainbow hair as a badge instead of a fashion statement or uniqueness.\nI bet the rest of the portfolio I haven't cashed out to feed my family that you don't have the nuts to walk downtown Portland by yourself unarmed rn.. But keep bumping your gums like the GOP is responsible for every small business getting shut down while amazon, costco, netflix, Hulu and all these other giant corporate fuck sticks that were allowed to operate during the plandemic (yeah I spelled that right) and post record breaking profits in less than a year... An attempt at forcing unconstitutional medical procedures on the entire country was enough to throw us in the second civil war.. Was that the GOP as well?", "score": 0, "replies": [{"body": "Holy shit. Calm down Chad Dickens.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": [{"body": "Eat s*** China.", "score": 1, "replies": []}]}]}, {"body": "There’s a reason you wouldn’t be allowed to run a hot dog stand. And this post is it. You know literally nothing and what you suggest would turn the US into a 3rd world country overnight", "score": 0, "replies": [{"body": "And the ppl running the country now can run a hot dog stand. What a fucking joke!!!!\n\nAnybody can run a country into debt and have deficits every year. Have artificially low interest rates and Fed Printing money to buy shit to prop up the market. But that is not creating real value that is FAKE Value like crypto", "score": 0, "replies": [{"body": "Yes. They can. They are aware that debt isn’t some magical evil force and is a monetary tool.", "score": 0, "replies": [{"body": "hahahahaha. They are so aware of debt that no one wants to buy U.S Treausries except for the FED. US debt/GDP is through the roof. And they know what they are doing man I would love to see someone that doesn't know. THis is not even funny its sad b/c ppl like you don't understand simple math", "score": 0, "replies": [{"body": "Dude you’re a fucking moron. Hate to break this to you. Thank god no one lets you anywhere near anything important", "score": 0, "replies": [{"body": "Love the logical argument. The points you made were so compelling ![img](emote|t5_2th52|4271).\n\nI bet you also owned Crypto. FUcking Clown", "score": 0, "replies": [{"body": "Dude, you’re legitimately the stupidest person I’ve interacted with on here. I would not waste a moment of my time trying to explain to you why abandoning debt as a financial tool and crashing every sector of the economy would put the US in the dark ages because you’re too god damned stupid to comprehend it.", "score": 0, "replies": [{"body": "You are the kind of person who couldn't pass basic math. if debt was at 50% or 70% of GDP, you could make an argument but the Debt to GDP ratio is around 130%. And just wait for it the GDP contracted last quarter and will definetly contract again this quarter already putting us in a recession. And the DEBT/GDP ratio will get even larger.\n\nOn top of that inflation is gonna run white hot giving us not a recessin but a stagflation. So I guess its the smart ppl like you at the Fed and US Treasury . Just learn math fucking idiot, Just learn retard learn.", "score": 0, "replies": [{"body": "Debt to gdp has been demonstrated to mean absolutely fucking nothing you fucking moron. Do you still believe in the so called debt cliff that was based off a fucking spread sheet errror. Morons like you barely passed high school algebra and seem to think that a governments debt to gdp is at all similar to a persons debt to income or a business’s leverage. It’s fucking not. I’m probably giving you too much credit and you don’t even know what these words mean, more likely you just took your marching orders from news max or a Facebook meme and are regurgitating like the food dumb fuck sheep you are\n\nProve to me you don’t work in a warehouse in a non supervisory role", "score": 0, "replies": [{"body": "Prove to me that a fiat currency with inflation like this can survive\n\nYOu would be the one when the dollar is worth the same as a toilet paper to have all your money in treasuries", "score": 0, "replies": [{"body": "Yes. So you are in fact an Amazon employee. Best of luck in your “career” and tell q I say hi at your next meeting. Fucking idiot", "score": 0, "replies": [{"body": "I know you probably work behind the wendy's giving every one a handy so you can invest in crypto. What is the Foreign reserve currency percentage made up by the dollar over the years has it been declining. Has putting the sanctions on russia have a opposite effect and fuck the dollar more. You probably still believe the Fed can tame inflation, or that its transitory. INflation is here for at least 5-7 years the way the Fed is moving and that is going to fuck the dollar out of reserve currency status.", "score": 0, "replies": [{"body": "People like you are too fucking much. Y’all legit know nothing but read some batshit conspiracy theory and have such a need to believe you’re more than mediocre that you fool yourself into thinking you can see things others can’t, just so you can sleep at night. Really you’re just making even more of an idiot of yourself by parroting moronic bullshit that only has one requirement to believe, that you’re a fucking idiot. You are less than mediocre. You are not secretly special. Your insecurities are right. Your fantasies are not. You are being manipulated by people taking advantage of your stupidity.\n\nInflation will be back on target by mid 2023 the latest as the fed dampens demand while the supply chain recovers. Recession in all sectors will have bottomed out and begun recovery by then as well. There will no financial crisis. Just some lean times. But morons like you will still be moaning about the big one coming up soon.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Step 1: END THE FED\n\nStep 2: that's it .. end the fed", "score": -1, "replies": [{"body": "AGREED. BUT FIRST LET THEM REDUCE THEIR BALANCE SHEET", "score": -1, "replies": []}]}, {"body": "what r u smoking? \\~ this should be called a shitpost \\~ WTF!", "score": 1, "replies": []}, {"body": "I agree but who would have the balls to implement this plan?", "score": 1, "replies": []}, {"body": "You are making the assumption the government will ever be fiscally responsible lol", "score": 1, "replies": []}, {"body": "no more deficit spending lmao, so the usual 1T a year just has to go and instead we pay off everything with taxes? not a single country can function without renewing debt. i mean they can if they just decide to not spend money on defence, education, infrastructure etc anymore. these points only tackle the money flow part of inflation. industrial output and employment are also factors.", "score": 1, "replies": [{"body": "we can still spend on those things - JUST LESS", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "only if you decrease the income tax. That way I only pay tax on what I buy", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The very defintion of Inflation is the increase in the money supply. \n\nMaking things more expensive now on top of inflation w/o cutting income tax is not smart", "score": 1, "replies": []}]}]}]}]}
{"title": "AAPL investors may feel some pain in the short term, but in the longer term, should be fine.", "selftext": "", "id": "vfgi4j", "created_utc": 1655589861.0, "score": 32, "upvote_ratio": 0.73, "num_comments": 78, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|44|**First Seen In WSB**|3 months ago\n**Total Comments**|55|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/vas0sp/why_i_simply_dont_ever_want_to_touch_netflix_stock/) [x](https://i.redd.it/r7gqtrjv79591.png) \n**Account Age**|3 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vfgi4j)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vfgi4j)", "score": 1, "replies": []}, {"body": "Poor people will always try to flex. Apple with its over price products will not go tits anytime soon", "score": 15, "replies": [{"body": "Apple products are more expensive but last a lot longer than their competitors.  I bought a macbook 10 years ago, and still can use it.  In that 10 years, I bought 5 laptops: HP, Dell, Asus, Chromebook and Sony, that all went into the trash.", "score": 16, "replies": [{"body": "I still use my 2014 MacBook Pro. I’ve had it for 8 years. I’ve had 2 PC laptops that are both now shit and they didn’t last nearly as long.", "score": 9, "replies": []}, {"body": "Lol, bullshit.", "score": 5, "replies": []}, {"body": "If that true, Apple would not getting sue over its battery. The company program its products to get worse over time.", "score": 1, "replies": [{"body": "What a shit take. If apple didn’t have you coming back to buy iPhones every few years what would be the point of being in the business, and if any company made a product with the intention on it lasting a decade it will be priced as a product that would last a decade.", "score": 4, "replies": [{"body": "In short, only idiots would buy a over price products that guarantee to be broken in a few years", "score": 1, "replies": []}]}]}, {"body": "This is because Apple has recognised that SSDs are vital for everything even at the cost of lower capacity. I use 7 year old ThinkPad laptop and NVMe SSD made it boot in 3 seconds.   \nRest of the industry caught up and today I fail to see any advantage to macbook over windows laptop. Aside from M1 efficiency.", "score": 1, "replies": [{"body": "My ASUS of 2 years just went into my part box.", "score": 1, "replies": [{"body": "Never had a laptop die that fast other than dirt cheap toshibas and even those were fixable lol. Desktops are indistinguishable with good hardware. People do often compare low-midrange windows models to Macs, which have no true low end models", "score": 1, "replies": [{"body": "I used my laptops to create projects for clients and students who access them remotely.", "score": 1, "replies": []}]}]}]}, {"body": "This is what I tell people I have a 2012 MacBook and it still works like I bought it yesterday. I recently just bought the New m1 model I didn't mind paying over 2K for it. Because I know.. I know", "score": 1, "replies": []}]}]}, {"body": "Never go short against white girls and their iPhones , if they cant afford it and they run out of dudes who will buy it for them on 36 month financing we are probably in the middle of nuclear war and economic collapse", "score": 25, "replies": [{"body": "They'll never run out of white dudes to give them money if they start an OnlyFans account.", "score": 3, "replies": [{"body": "Yea , 100%, if we could just harvest simps energy we wouldn’t need oil or gas anymore", "score": 2, "replies": []}]}, {"body": "Bullish on SBUX", "score": 1, "replies": [{"body": "Starbucks does well in a recession. People love to indulge and $6 cups of coffee when you don’t have much money is a small luxury that makes people feel better/brings comfort.", "score": 2, "replies": []}]}]}, {"body": "If aapl gets to 100 spy will be at prob 260. Don’t see it happening. Perhaps we hit 110 at full capitulation, bringing spy to around 290", "score": 7, "replies": []}, {"body": "i am expecting aapl to go under 100 over the summer.", "score": 11, "replies": [{"body": "Hey. That is not off the table by any measure,.just running out of dry powder Is my only gripe. And no...not cause it's going up my nose.", "score": 2, "replies": []}, {"body": "I sure hope so, I have more puts to cash in on", "score": 4, "replies": []}]}, {"body": "AAPL is currently trading at roughly 10x cash on hand, which is a massive discount. Between that and their massive share repurchase plans it's gonna go brrr in the near future.  \n\n\ncurrently short 165 September puts, and short 170 july 15 calls. It's the biggest position in my portfolio at about 100k.", "score": 7, "replies": [{"body": "So you are going to get assigned apple at 165 plus premium received. And you will collect the premiums on the calls. Good luck sir. You going to have to hold at least 5 years to get back to those prices", "score": 4, "replies": [{"body": "I can close the contracts at a profit if aapl goes up at all…\n\nLike, it’s already a profitable position for me\n\nOr oh no, I buy AAPL at like $130/share. Boo hoo.", "score": 7, "replies": [{"body": "How is it profitable. You sold the 165 puts. Please give us the premium you sold at", "score": 3, "replies": [{"body": "Sold when aapl was ~130", "score": 2, "replies": []}]}]}, {"body": "Never put a time frame my friend. This market is crazy.", "score": 1, "replies": [{"body": "Okay buddy.", "score": 2, "replies": [{"body": "Balls out. I salute thee.", "score": 1, "replies": []}]}]}]}, {"body": "Whoa. Yo granpa here..must have been napping.. When did did cash on hand become a more vsluable metric than yoy earnings growth?", "score": 0, "replies": []}]}, {"body": "As of their most recent quarter, they authorized an additional 90 billion to share repurchasing and currently have about 107b to repurchase shares. If aapl stock falls lower, they will be able to buy more shares. At the current pace, they have been repurchasing with around 20 billion per quarter. This should bring down outstanding shares significantly and increase eps over time. Keep in mind that there are other factors at hand like stock based compensation, but aapl stock buybacks severely outpace any dilution they have.", "score": 6, "replies": [{"body": "That's how they maintained beats prior to pandemic. All their growth prior was due to buy backs. They will return to that and in turn go back to 15 pe.", "score": 2, "replies": []}]}, {"body": "I don’t think any substantial amount of investors or even traders look at that tiny micropenis of a gap from 2 years ago as to have any meaning whatsoever; also your lines on it are completely wrong.\n\nAs for AAPL:  I believe $100 might be the price the market will say enough’s enough and start scooping it up en mass, aka the bottom.  It’s such a nice round number psychologically, and a 30% contraction in its bloated P/E that makes sense from this level, in this market.", "score": 5, "replies": []}, {"body": "Yea, no shit…", "score": 2, "replies": []}, {"body": "Don’t know. AAPL used to be an amazing hardware company and now is a services + hardware company. \n\nI’m not sure they are going to be able to invent something like the iPod or the iPhone again to be able to come out of the recession thriving. \n\nIf there isn’t a recession, you might be right. If there is one they may not come out winning.", "score": 2, "replies": [{"body": "AAPL bears have been saying this exact thing for 10+ years", "score": 10, "replies": [{"body": "I don’t know what made them say that 10 years ago. That would be 2012, when they created an entire new market with the iPhone. \n\nI’m saying that it’s going to be very hard to replicate such a product, which honestly is a truism because market-defining products are few and far in between.", "score": 0, "replies": [{"body": "The iPhone was 5 years old in 2012", "score": 4, "replies": []}, {"body": "Their vr system and car will probably be pretty solid……and their customer loyalty is pretty cultlike…", "score": 3, "replies": []}, {"body": "83 billion quarter revenue record. It’s time to move past iPhones and understand that apple is taking on every angle possible in tech.", "score": 1, "replies": []}]}]}, {"body": "They can’t invent another iPod or iPhone, but they are making their own processors with built in GPU cores, effectively allowing them to engineer their way to the top of the computer world once again, this time they are taking on Every major player, including Nvidia.\n\nThey are done integrating 3rd party hardware into their macs, m1/m2 is only the beginning of what’s to come.", "score": 14, "replies": [{"body": "I thought their highest growth driver was services?", "score": 1, "replies": []}]}, {"body": "hence pain short term. Even if they revert to prior levels of revenue and bottom line, their shares outstanding has decreased significantly in the last two years and should continue to fall. Aapl constantly repurchasing shares even if they see less growth is bullish on its own.", "score": 1, "replies": [{"body": "their numbers will constantly be compared to strong strong numbers in 2021-2022 so it's very likely that if we go into a recession, YOY comparisons for 2023 will look very weak", "score": 1, "replies": []}]}]}, {"body": "AAPL will see $80 before it sees $170 again", "score": 3, "replies": [{"body": "Lmaoo what", "score": 6, "replies": []}, {"body": "$100 maybe. $80, no.", "score": 2, "replies": []}, {"body": "Positions or ban.", "score": -1, "replies": [{"body": "LetsStartASexCult has challenged someone to post their positions! \n\nLetsStartASexCult, if someone has made a claim that they bought / sold something and fail to prove it within 24 hours, message the mods to have them banned.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "I bought 600 AAPL at ipo for $25. Sold at $27 for rent, crack, and hookers. \nReally. Wheres my cookie?", "score": 2, "replies": []}]}, {"body": "Mister I don’t think I ever claimed that I bought or sold anything in AAPL", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I will be messaging you in 6 months on [**2022-12-19 02:07:04 UTC**](http://www.wolframalpha.com/input/?i=2022-12-19%2002:07:04%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/vfgi4j/aapl_investors_may_feel_some_pain_in_the_short/icwexjk/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fvfgi4j%2Faapl_investors_may_feel_some_pain_in_the_short%2Ficwexjk%2F%5D%0A%0ARemindMe%21%202022-12-19%2002%3A07%3A04%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20vfgi4j)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "If you think apple will drop by that much and haven’t shorted it than you sir are an idiot and definitely belong here.", "score": 1, "replies": [{"body": "Maybe I have, maybe I haven’t… either way I’ll see you in 6 months where I can share how much money I have or haven’t made… !RemindMe 6 months", "score": 0, "replies": []}]}]}]}]}, {"body": "If apple falls 33% we are literally all fcked, ark would be around 10$ and bankrupt", "score": 1, "replies": [{"body": "Ark doesn’t hold it in their top ten, is there other exposure?", "score": 1, "replies": [{"body": "No I’m saying if apple goes down 33% so will the market making etfs and stocks like  arkk most likely go bankrupt", "score": 1, "replies": []}]}]}, {"body": "{ it’s pretty dumb, and pretty common, to hold a losing position in any time frame account… ok 401k aside I get that..  but once spy went red on the year (2nd day of the year?), or took out January lows, or took out 1st quarter lows, or took out last year lows… maybe you should make adjustments…buy put protection, sell calls, do something! }\n\nI mean I agree with the title of your post, but it’s kind of like so what?  Is there really any question if aapl is a good buy long term? I’d be interested to hear a case as to why not. Something more than just the fact there’s a gap down there, idk..\n\nThe real question with any ticker in the market has always been when to buy and when to sell.\n\nSo are you holding puts or planning to buy puts or short selling or waiting on more information or what? \n\nDo you have a position? \n\notherwise this kind of post just appeals to bias of both sides…  diluting the power of this sub and 12million autists with more indecisive “maybe” stuff .  It doesn’t really say much of anything other than telling investors hold your long position.  Why would you hold if you think there’s a gap good ways down that’s gonna get filled ?", "score": 0, "replies": [{"body": "The market runs in cycles. It just so happens to be that we're in a down cycle. Eventually we will go into an up cycle. This type of information is to let people know where potential max pain could be and that the future outlook is not all bad. The true hodlers double down on companies who's life expectancy cannot be measured. Many of the recent IPO companies have a measurable life expectancy. We simply need to look at their balance sheet and their cash burn rate and it becomes clear. That is not the case with AAPL.", "score": 1, "replies": [{"body": "So what is the post’s message? \n\nHodl aapl even though you think it’s going down to fill a gap?\n\nIt’s only another 25% down", "score": 1, "replies": []}]}]}, {"body": "Lmfao obsessed with gaps", "score": 0, "replies": []}, {"body": "That was an ER break not split.", "score": 1, "replies": [{"body": "Yes, you're right. but in that q3 2020 earnings report was when they announced the 4-1 split that got people hyped.", "score": 2, "replies": []}, {"body": "[4-1 stock split](https://www.cnbc.com/2020/07/30/apple-stock-split-announced.html)", "score": 1, "replies": []}]}, {"body": "I just want to buy in at under to $100!!", "score": 1, "replies": []}, {"body": "AAPL will moon when their car comes out, meanwhile I'm buying puts 🤑🤑🤑", "score": 1, "replies": []}, {"body": "when they release that car lol. \nI don’t think they are doing a Samsung and doing the whole cow anymore. More of a sega play and owning the platform now. TVs been kind of a bust. I see the chess game they’re doing in the ad game and if they can get that flywheel going, they may be on to something - I just don’t see anymore full hardware software plays in the near to mid term.", "score": 1, "replies": []}, {"body": "The dumbest thing I've read all day", "score": 1, "replies": []}, {"body": "Boy, thats a helluva gap. My ex-gf had a gap like that...\n\nThat's why she's my ex-gf.", "score": 1, "replies": []}, {"body": "I like your charting man, but I’d say that what you found is a momentum gap, which is less likely to get filled. Gaps that fill are usually top and bottom reversal gaps, like island gaps. Momentum gaps are pretty common and most of the time don’t fill. That being said there does seem to be some resistance at that level, which could turn into a support so we could see the price get there", "score": 1, "replies": []}, {"body": "The gap fill thing is really the stupidest of all set ups.  It’s like people don’t realize there is pre market and post market trading.  There were plenty of prints inside that gap.", "score": 1, "replies": []}, {"body": "Run away gaps do get filled", "score": 1, "replies": []}, {"body": "What is pain????", "score": 1, "replies": []}, {"body": "This is the kind of outrageously stupid logic I expect from you guys. Keep up the great work!", "score": 1, "replies": []}, {"body": "Look at an AAPL all time, if it isn’t obvious that this isn’t a bubble then this sorta thing may not be for you. Even with the current drop, the return to shareholders (not even accounting for dividends) is 219,000%. This gal has a long way to go down, and I’m not saying it has to happen all at once.", "score": 1, "replies": [{"body": "It went up a lot over a long period of time so It can go down really fast. Weird logic, I prefer fundamentals and reading their earnings reports.", "score": 1, "replies": []}]}, {"body": "Uh muh gaw.  If I hear one more replay of this tired Grampian aapl statement I’m gonna sell another share. \n\nThere, I just did.  Feels goooood\n\nDon’t let fomo keep you from realizing profit \n\nThere will always be another great entry point to make double digit % gains on this stock", "score": 1, "replies": []}]}
