{"title": "Would you buy $AMZN right now?", "selftext": "Why or why not?\n\nThey hit 1 Trillion; the highest they have ever been, and are one of the most valuable companies on earth. \n\nMy concern is they are at the very top, how much room is there to grow from where they are?\n\nFeels like a bubble.", "id": "9cxgbx", "created_utc": 1536079872.0, "score": 5, "upvote_ratio": 0.7, "num_comments": 41, "comments": [{"body": "AAPL hit 1 Trillion and moved up another 10%. Short term, I would buy AMZN right now because the market favors momentum stocks. Long term, it's based on your valuation. People have been calling the top in AMZN for years and it still keeps going up.", "score": 23, "replies": [{"body": "This is true. ", "score": 3, "replies": []}]}, {"body": "\"how much room is there to grow from where they are?\"\n\nLots. The advertising business is going to be considerable. Healthcare is going to be considerable. Logistics is going to be considerable. A careful roll-out of physical stores (Amazon Go) will benefit. Whole Foods will pay off not only from the core business perspective, but will also act as superbly located last-mile warehouses. Amazon has already discussed looking at larger whole foods locations with dedicated delivery vehicle spaces for the eventuality of more non-food items being delivered from Whole Foods. As for online grocery, look at Kroger investing in Ocado; the eventuality is that more and more people will shop for groceries online - Shop from home (Amazon), watch media (Netflix), doctor talk from home (Teladoc) and order food from home (Grubhub.)\n\nI already own it. Would I buy more at this point? No.  I'm not selling anything, but looking around there's not a whole lot I'm interested in buying.\n\nEdit: I said I would not buy more at this point. Not sure why people so eager to argue. Do I think that Amazon has further runway for growth when looking at the longer-term? Yes, I do. Sorry.", "score": 9, "replies": [{"body": "You didn't even mention AWS, which accounts for 50% of their profit due to high margins. I believe it's also the fastest growing unit. AWS also has a roughly 50% market share. I believe this is very early days for AWS and Microsoft Azure. There are still many medium to small businesses that are moving operations to the cloud. AWS will be able to fund Amazon Go and their other new ventures.\n", "score": 3, "replies": [{"body": "True - while AWS certainly has competition, it continues to have a significant growth runway still ahead of it. I didn't mention Twitch (which now will cost for ad-free; https://www.theverge.com/2018/8/20/17761760/twitch-prime-turbo-ad-free-benefit-end-over-september-14) either. Or a lotta stuff, really. ", "score": 2, "replies": []}]}, {"body": "I’ll take the contrarian side: What makes you certain Amazon will be better than Google or Facebook in the advertising space? Why would Amazon be more successful than United Health Group or Cardinal Health in the healthcare realm? Why will Amazon be better than UPS or FedEx? AmazonGo seems cool, but same question over Costco, Target, Aldi, Walmart, Etc. ? \n\nI am not saying Amazon isn’t a behemoth, or won’t be huge and around forever. But it’s important to take a step back and really question things. ", "score": 1, "replies": [{"body": "> What makes you certain Amazon will be better than Google or Facebook in the advertising space?\n\nI'm not sure where I said better, or mentioned Google or Facebook. I don't think that Amazon will overtake either, certainly at least any time soon. That doesn't mean that advertising can't be a significant business for Amazon.\n\n\"But the bigger surprise is the increase in advertising on Amazon by companies, like Verizon, AT&T and the insurer Geico, that don’t directly sell any product or service on the site. In the first half of 2018, Geico ran six times as many display ads as it did during the same period last year, according to Oweise Khazi, associate director of Amazon IQ research at Gartner L2. (Geico declined to comment.)\n\nVerizon said the reason for its increased advertising spending on Amazon was simple: It’s where the shoppers are.\"\n\n\"“With Amazon’s platform now being a leader in many elements of advertising — including, for many categories, search — it makes sense for part of those ad dollars to be allocated there,” said Monica McGurk, Kellogg’s chief revenue and e-commerce officer, in an emailed response to questions.\n\nBut for Kellogg’s, what sets advertising on Amazon’s platform apart from others, like Google or Twitter, is the online retailer’s data.\" (https://www.nytimes.com/2018/09/03/business/media/amazon-digital-ads.html)\n\n\"But that is how Amazon watchers evaluate the company’s ad business. Morgan Stanley analysts, for example, estimate Amazon’s ad business is worth about $125 billion, based in part on multiples of Google’s ad sales. Amazon definitely has the potential to join the Google and Facebook ad big leagues, but what Amazon is doing today isn’t conventional advertising and shouldn’t be valued that way. \" (https://www.bloomberg.com/view/articles/2018-09-04/amazon-at-1-trillion-is-more-dream-than-reality)\n\nAmazon doesn't break out advertising sales but loops it under the \"other\" category, which grew 139 percent year-over-year.\nEMarketer predicts Amazon will become the third largest digital ad seller in the U.S. by 2020, behind Google and Facebook. (https://www.cnbc.com/2018/04/26/amazon-advertising-is-now-a-multibillion-dollar-business.html)\n\n\"Why would Amazon be more successful than United Health Group or Cardinal Health in the healthcare realm?\"\n\nAmazon can ultimately be successful for the same reason that Alphabet's Verily has shown interest in insurance.\n\n\"The population health market is large and growing, but crowded. To enter this space, a vendor like Verily would put forward a proposal to a payor — like the government, an employer or a private insurance company — detailing how it can bring down costs. If a company like Verily can deliver on that, the payor would share some portion of the amount saved. If costs don't come down, it might make no money from that contract. (This is a simplification, and the details vary by contract.)\n\nA classic intervention might involve analyzing health data to figure out which patients would benefit most from having a nurse visit them at home so they don't end up in the emergency room, or figuring out whether patients are filling their medication scripts after getting discharged from the hospital.\n\n**This opportunity represents about $20 billion to $25 billion in annual spending today with huge potential upside of up to $1 trillion** as more insurers move to these kind of risk-based agreements, said Ari Gottlieb, a director at the research group PwC.\" (https://www.cnbc.com/2018/02/27/alphabet-verily-health-insurance-care-management.html)\n\nThe ability to use data in order to bring down healthcare costs is a potentially significant opportunity and likely a core behind Amazon's healthcare venture with Berkshire and JPM. Pillpack gives Amazon pharmacy licenses in every state.\n\nThe concern that I have more than anything in regards to healthcare is CVS and Walgreens, whose ability to charge a fortune for everyday items is being encroached on by Amazon, Teladoc and a number of other companies who are offering similar things for less or much less. That's not to say that Walgreens or CVS will go away, but Amazon now, Target Reship, Kroger's new program, Pillpack and Teladoc among others are gradually giving people less and less reason to go to Walgreens and CVS. \n\n\"Data analytics. By simplifying data capture, Amazon frees up resources to analyze that information for purposes of business intelligence. What are consumers purchasing and in what combinations? Which purchase decisions do consumers appear to labor over and which do they seem to make quite quickly? Turning that lens to health care data could be powerful, a point that has not been lost on the many companies already building analytic tools in health care.\n\nAs with retail clinics, the question again arises as to what Amazon could add over these existing firms. One potential answer is a wealth of integrated data that links an individual’s medical record with their overall purchasing patterns, genetic information (particularly if Amazon eventually does blood draws in convenient settings), and activity patterns. This type of data integration is increasingly sought after by health care delivery systems that are trying to target care based on a patient’s specific preferences or genomic information.\" (https://hbr.org/2018/02/what-could-amazons-approach-to-health-care-look-like)\n\n\"Why will Amazon be better than UPS or FedEx?\"\n\nAgain, it doesn't need to be better than UPS or Fedex to build a significant business of its own. They already have announced Shipping With Amazon (https://www.marketwatch.com/story/amazon-has-a-multibillion-dollar-reason-to-build-its-own-shipping-business-2018-02-09), have already launched Prime Air, have their own delivery trucks in many cities and has Amazon Key and Ring. If Amazon Key is adopted further in the years ahead, Amazon owns the door. Amazon already has 75 distribution and 25 sort centers across the US. Amazon now has warehouses within 20 miles of half the population of the United States, making them a considerable presence in the very valuable last mile. The eventuality is that Amazon can fill unused space in its delivery system with packages from other businesses. You ask if Amazon is going to be \"better\" than UPS or Fedex. I ask how UPS and Fedex will feel if eventually Amazon is no longer reliant upon them and they lose that business. Home Depot was rumored to consider bidding on XPO logistics last year to keep it out of Amazon's hands. I still think that there is a possibility that Amazon or someone else will go after XPO and if that occurs, then there is going to be real concern at Fedex and UPS. There's also Amazon hiring people to start their own delivery businesses with the company, not to mention Amazon has already discussed larger Whole Foods locations with dedicated spots for delivery vehicles - the idea being that Whole Foods can be used more and more for the last mile, bringing items even closer to the consumer.\n\n\"AmazonGo seems cool, but same question over Costco, Target, Aldi, Walmart, Etc. ?\"\n\nAgain, not sure why you're comparing or saying \"better than\", as if the only validation is comparison to businesses that aren't comparable. Amazon Go from a technology standpoint is fascinating in regards to the ability to track the consumer's every action throughout the store. Given the ability to connect with the consumer via the Amazon app, there's the potential to understand the thousands upon thousands of consumer decisions every day. If Amazon Go sees you pick up Cheerios and then put it down and pick up Kashi, how hard would it to offer you a small discount if you answer a survey why. Google pays for surveys about places you've visited, Amazon Go's ability to track the consumer throughout the store and potentially offer insights into decision making could be a highly lucrative data mine for manufacturers. Not to mention the eventuality of Amazon likely licensing the technology to other stores, similar to what JD has stated it will do in China. Similar to what BABA is doing in China in its attempts to push its technology as the operating system of mom and pop retailers. Additionally, Prime creates a stickier customer and it's doing that at Whole Foods with improved metrics already (https://www.eater.com/2018/8/27/17785942/whole-foods-amazon-prime-deals-trader-joes-grocery-store-rivalries, https://www.fooddive.com/news/grocery--whole-foods-traffic-spiked-186-on-independence-day/527847/)\n\n\n\n\n\n\n", "score": 5, "replies": [{"body": "(continued)\n\nCostco is just fine. Walmart is just fine. Target is....well, Target. Kroger was smart to invest in Ocado. I don't see it as a \"winner take all\", but I do see a market where local and regional (or smaller - Fresh Market is struggling - http://fortune.com/2018/07/10/the-fresh-market-closing-list/) are going to be increasingly cry uncle over the next few years as majors that can compete on price and (increasingly) on technology win. In terms of the grocery market, the consumer IMO benefits from everyone trying to compete on price in the short-term; in the long-term there's going to be less competition and a consumer that will be ordering increasingly online (and Kroger has stated that their investment in Ocado is a preparation for that eventuality) \n\n\"The strong economy is likely to give the growing retailer mix more time to run than otherwise. However, with Northeast Ohio's lack of population growth, the question will be how soon larger players start giving up some profits to retain market share.\n\n\"There's going to be some road kill,\" Cerankosky said, pointing to supermarket chains closing in other regions. \"There is no obvious weak competitor in Northeast Ohio. Keep in mind that Walmart sells a lot more than food. And you can walk in to Costco for groceries and walk out with a trampoline, which I've done.\" (http://www.crainscleveland.com/food-and-dining/northeast-ohios-crowded-market-has-grocers-doing-all-they-can-stand-out)\n\nLucky's has closed some stores (https://www.kentucky.com/news/business/article210017439.html), but they have an investment from Kroger. Kroger saved Roundy's when that was basically a mess a few years ago. It would not surprise me if they bought Lucky's at some point. You have a grocer that could easily continue to consolidate. Kroger has the technology, has the data; perhaps at some point a membership is next.\n\nAdditionally, and I'll add it here because I couldn't fit anymore into the first part - the US prescription drug market is $450B. The advertising market is enormous. The logistics market is enormous. Amazon is going into things where the end result can move the needle and if successfully done, be significant businesses. Pillpack is tiny right now, but if Amazon (who stole it from Walmart, who was interested) can scale that business rapidly (and perhaps somehow integrated as Prime benefit) that's going to put the hurt on Walgreens and CVS stores. \n\nI've talked about Walgreens and CVS multiple times in the past, including the fact that generic OTC meds from Walgreens are massively more expensive at Walgreens than via Amazon. 90 Walitin (genetic Claritin) is $29.99 at Walgreens. 300 of Amazon's generic Claritin is $13. Walgreens and CVS were able to charge a ton because of convenience and when Amazon Prime Now can offer something in 2 hours for less and deliver it, the power of convenience that your local Walgreens or CVS had erodes considerably. And it's not only Amazon, but Target restock and others. That's not saying that CVS and Walgreens are going away but there's a lot of services that are eroding a main advantage that both chains had.\n\n\n", "score": 4, "replies": [{"body": "You sir, are a beast! ", "score": 2, "replies": []}, {"body": "This was so well researched. Thanks for sharing.", "score": 2, "replies": []}, {"body": "Added note: as for Amazon and logistics, they just ordered 20,000 delivery vans.\n\nhttps://www.wsj.com/articles/amazon-orders-20-000-mercedes-benz-vans-for-new-delivery-service-1536157804", "score": 1, "replies": []}]}, {"body": "Very well researched, good job. \n\nThe reason for using the words “better than” is pretty obvious, actually. Amazons stock is up something like 77% YTD. They have announced a lot of aggressive moves, most of which were mentioned above. You don’t gain that kind of hype unless investors believe you can do something “better than” your competitors. \n", "score": 1, "replies": []}, {"body": ">A classic intervention might involve analyzing health data to figure out which patients would benefit most from having a nurse visit them at home so they don't end up in the emergency room, or figuring out whether patients are filling their medication scripts after getting discharged from the hospital.\n\nfollowing this  tread", "score": 1, "replies": []}]}, {"body": "New metrics ", "score": 1, "replies": []}]}, {"body": "tl;dr the stock price will continue to climb but I wouldn't buy more because I don't like making money", "score": 0, "replies": []}, {"body": "Good Sir, please look at the P/E. All things you are saying are correct, but are very likely already priced in ;)\n", "score": -10, "replies": []}]}, {"body": "I think someone asked the same question when I bought at $1,724, and now here we are...\n\nPersonally? I'd buy still. ", "score": 8, "replies": []}, {"body": "I would if it were't already 30% of my stocks investments ", "score": 5, "replies": []}, {"body": "AMZN has been a bubble since like $400\n\n&#x200B;\n\nThat's why i bought in at $800 :)", "score": 7, "replies": [{"body": "LOL\n\n&#x200B;", "score": 1, "replies": []}]}, {"body": "Its been in bubble-land for a while. I would not buy it right now.\n\n[https://www.forbes.com/sites/panosmourdoukoutas/2018/09/04/3-things-that-could-burst-amazons-trillion-dollar-bubble/#14bce97466e7](https://www.forbes.com/sites/panosmourdoukoutas/2018/09/04/3-things-that-could-burst-amazons-trillion-dollar-bubble/#14bce97466e7)", "score": 4, "replies": []}, {"body": "Honestly, look at their historical price chart. Pick a random day. They were most likely at their top then as well. ", "score": 1, "replies": []}, {"body": "Long on $AMZN. $2500 target by EOY very realistic.", "score": 1, "replies": []}, {"body": "Sure, why not?  Sky's the limit for AMZN.", "score": 1, "replies": []}, {"body": "I wouldn't. It's too over valued (for my taste). That doesn't mean other people won't want it at this price and every price above it. It could very well go to $3000 before this time next year, but that doesn't mean I want it. \n\nRight now, it is the equivalent of buying a company that makes 300 grand a year for $100 million dollars. No way jose.  ", "score": 0, "replies": [{"body": "Why would you look at current earnings when the stock price reflects future earnings? This seems like such a naive mistake that happens so often on reddit.", "score": 1, "replies": [{"body": "I didn't say don't look at future earnings. When you buy a $100 million dollar company for making 300k you also look at future earnings. I'm just saying it's an identical situation.", "score": 1, "replies": [{"body": "Then why did you leave that relevant info out of your hypothetical example? Seems like a very dumb thought experiment.", "score": 1, "replies": [{"body": "Because when numbers get big, people can't really imagine it. I thought it was interesting to phrase it in those terms. No need to guillotine me lol", "score": 1, "replies": []}]}]}]}]}, {"body": "Let 3 tril settle its no hype but ppl will sell jusy my opinion ", "score": -1, "replies": []}, {"body": "Buy at all times highest price sell low best strategy i ever heard ;) ", "score": -1, "replies": []}, {"body": "They could double the price of prime and not lose any customers. It’s called a monopoly. Even the govt can’t stop them. ", "score": -3, "replies": [{"body": "Lets not go that far.....I love prime, but $200+ a year....Not sure on that one.", "score": 5, "replies": []}, {"body": "hell no.\n\nI've been a prime member for 5+ years and would cancel if it increased to $200\n", "score": 2, "replies": [{"body": "When the time comes I bet u won’t. And if u did u would be back in a month. $200 is still a bargain. ", "score": 2, "replies": [{"body": "I will.  There are so many legit alternatives now.  \n\nAnd I'm also tired of getting fake goods from Amazon.\n\nHardly anything I buy I need in 2 days. Besides half the time Amazon doesn't even get it to me in 2 days.\n\nPrices also have gone up alot.  I can get better prices buy at other places or locally.  \n\nNo way am I spending $200 for 2-day shipping that are hardly even need.", "score": 0, "replies": [{"body": "Ok but u will likely find the alternatives are not that great. You will need to order from 5 places to get the stuff u want. U will pay sales tax and likely shipping. You will get fake or damaged goods or things I just didn’t like and the return will be a pain in the arse. Amazon returns are smooth and hassle free. They even let u keep some stuff without having to return it. You get automatic shipping labels. \n\nAmazon is not perfect but It’s the best solution by a long shot even at $200. For me at least. ", "score": 2, "replies": [{"body": "Walmart and Costco online have me covered.  Amazon is no longer tax free for me.\n\n$200 is way too much for 2 day shipping.\n\nI could still buy from Amazon without Prime but it would just take longer to ship.  Maybe once or twice a year I order something from Amazon that I need in 2 days. Most of the time I'm not in any rush so the free non-prime shipping is fine.", "score": 0, "replies": [{"body": "cool.  hope it works out.  maybe go monthly during xmas time and then cancel after xmas.  nowhere else to get toys anymore.", "score": 1, "replies": []}]}]}]}]}, {"body": "We'll get you there bit by bit\n$19 at a time ", "score": 0, "replies": []}]}]}]}
{"title": "Biotech write up: $AVMXY DD inside", "selftext": "Posting what I wrote in another sub:\n\nLads, I've benefited quite a bit from multiple subs and wanted to give my two cents about a stock I see immense potential in(will put this elsewhere as well)\n\nAVMXY is Avita medical. It's an Australian company listed as an OTC. Their claim to fame is a product called RECELL. \n\nWhat RECELL basically does is use a RES system which is regenerative epithelial suspension for burn victims. It is an autologous suspension that contains cells necessary to regenerate epidermis and provides a way to above closure if burn wounds. We all know burns aren't going away anytime soon and be seen in anyone from combat victims to fire victims or car accidents. Their product mainly comes into play for third degree burns and sometimes in second degree burns where skin grafting may be needed(taking skin from one part of the body and placing it on another). They did a multi centered randomized  controlled trial which was published which showed that patients who got their product RECELL essentially :\n- required 97% less skin graft than those who did not\n- had possible faster wound healing\n- had less pain during recovery (burns are obv painful)\n\nThis is huge and potentially transformative for the burns industry. It is not currently approved but it's PMA application is currently being reviewed by the FDA and a decision is likely in Q3. The company is very confident that this will be approved and has already started production. Earlier in the year the FDA approved an increase in the number of patients who could be treated with RECELL under its compassionate use of investigational decide exemption program(basically allowing experimental therapy in extreme cases). They thus used it on 108 patients.this and its study results almost guarantees approval of the product which will be huge.\n\nImagine every burn center carrying Recell if it is approved. That's big.\n\nI see one of a few possibilities:\n-it gets listed on NASDAQ\n- it gets bought out by another company\n- nothing happens and it loses steam\n\nI think the third is very unlikely given how this product can change management of burns. The first two possibilities are likely. It is currently $1.47/share which is still cheap. I can't predict how high it'll go but I do see an upward trajectory.\n\nConstraints:\nIt is an OTC stock and these entail more risk than other stocks since they aren't as \"vetted.\" That being said, they have already started in Europe and china so that's a good sign.\nAlso, interestingly it's been very quiet. Other than a couple of people mentioning it before, I haven't really seen it \"take off\" on Reddit. I believe mainly coz it's an OTC.\n\nI see big things for AVMXY and I just bought quite a bit over the last week. FYI I am not trying to shamelessly promote this. I'm trying to give my two cents as DD and if you guys like please research the stock, company and the medical evidence. DONT  buy just coz I said so. DO YOUR OWN RESEARCH.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/29800234/\n\nIf you guys have other thoughts, let me know.  I don't claim to know all.", "id": "9cxc4b", "created_utc": 1536079178.0, "score": 21, "upvote_ratio": 0.93, "num_comments": 43, "comments": [{"body": "Is this $TTPH Part 2: $AVMXY Boogaloo?", "score": 6, "replies": []}, {"body": "Sorry chief, no OTC penny stocks. ", "score": 8, "replies": []}, {"body": "Hey /u/FelisinGos your post is now on the [WSB DD list. Click here to read more DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3ADD).\n\nIt's important that anything marked DD is useful information for other traders. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD, mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "can't buy on RH, worthless", "score": 3, "replies": [{"body": "Lol yeah, I used fidelity.", "score": 1, "replies": []}]}, {"body": "Real DD. Thanks friendo 👌🏼", "score": 1, "replies": []}, {"body": "Am student organic chemist. Will maybe offer evaluation of (possible) mechanisms and look through the literature about similar compounds. If this doesn't turn out to be a dud, I'll check in later with what I've found.\n\n[u/FelisinGos](https://www.reddit.com/user/FelisinGos)  Can you at least tell me why this is different than other drugs that attempt the same thing, you touched on it in your post can you be a \\*bit\\* more thorough.", "score": 1, "replies": [{"body": "Exactly. What other drugs??", "score": 1, "replies": []}]}, {"body": "Thanks. Bought 300 shares. ", "score": 1, "replies": []}, {"body": "This seems really tempting. It’s been going up quite a bit ever since June, so I’m assuming that’s when they got approved to do more testing? If it actually gets clearance from the FDA this quarter that could be a big win.\n\nHow long have you been watching this?", "score": 1, "replies": []}, {"body": "A couple of months. But they got some press earlier in August for their new facility and compassionate program via FDA so finally decided to do risk it. I also went big in terms of shares but that's coz I think it creates and fulfills a need in a market when one wasn't there. Anything that can have a change of practice effect in medicine, I see potential in that.\nGood luck. Waiting for the FDA.", "score": 1, "replies": []}, {"body": "Already in for 45k shares. Firmly believe it will 3x after approval, and then jump again when it’s listed on NASDAQ. I guarantee you some firm will probably buy out soon afterwards. This is the first fully viable solution that is proven in human trials. Could easily become new standard of care.", "score": 1, "replies": [{"body": "65K? That's 10x what I put in. Wow.\nYeah I'm very hopeful too. I think it could be the standard of care. Any word on when the FDA approval is happening exactly?", "score": 2, "replies": [{"body": "Bought in at 1.12, so about 50ish. Already loving the gains, and can't wait for the spike.", "score": 1, "replies": [{"body": "I bought in @ 96¢. I kinda wish I heard about the stock a few  weeks later when the stock dropped to 80¢.", "score": 2, "replies": [{"body": "Grass is always greener. Would have loved to get my shares 15% cheaper like you did.", "score": 1, "replies": [{"body": "Hypothetically, let's say Avita Medical gets their FDA approval and a big company wants to buy the company. What would you guess the stock would reach? Five bucks a share...ten? Higher? I don't have a point a reference with these penny stocks.", "score": 1, "replies": [{"body": "I have no clue. At least 7-8, if the buy is quick. If they list on NASDAQ and show 1-2 quarters of rapidly growing sales... anywhere in the universe from 10-30 is feasible.\n\nBut we’re talking a lot of “what-if”s at that point. Short term targets: Approval and jump to 4 dollars.", "score": 2, "replies": [{"body": "  \n[Cantor Fitzgerald maintained a Buy rating on Avita Medical](https://www.smarteranalyst.com/brief/cantor-fitzgerald-remains-a-buy-on-avita-medical-avmxy/) with a price target of $65. The company’s shares opened today at $1.37.", "score": 1, "replies": [{"body": "you know that article references avita and then talks about a completely different company, right?", "score": 1, "replies": [{"body": "Lol...just reread that. It's pretty weird, did he copy the wrong paragraph in there?", "score": 1, "replies": [{"body": "no clue... but i'm all about the $65 PT too! lol", "score": 1, "replies": []}]}]}]}, {"body": "[https://www.nbcnews.com/health/health-news/fda-approves-first-spray-skin-product-n911976](https://www.nbcnews.com/health/health-news/fda-approves-first-spray-skin-product-n911976)\n\n&#x200B;\n\n*\"It’s the first spray-on skin product to win approval for the U.S. market.\"*\n\n&#x200B;\n\n*“If your whole back was burned, all you would need is a piece of skin the size of a credit card to replace that damage...”*\n\n&#x200B;\n\n*\"Perry said Avita has not settled on a price for the ReCell system, but it will most likely be between $5,000 and $10,000 per unit, which can treat about 10 percent of a patient’s body surface area. Someone with burns over 50 percent of the body would require five units for treatment — more for deeper burns.\"*", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "When can we expect to see the FDA approval...this month, next month?", "score": 1, "replies": [{"body": "This month. Could literally be any day now.", "score": 1, "replies": []}]}]}, {"body": "Avita Medical just got FDA approval in the U.S. for their product RECELL.\n\n&#x200B;\n\n[https://www.marketwatch.com/press-release/avita-medical-announces-fda-approval-of-the-recell-system-for-the-treatment-of-severe-burns-in-the-us-2018-09-20](https://www.marketwatch.com/press-release/avita-medical-announces-fda-approval-of-the-recell-system-for-the-treatment-of-severe-burns-in-the-us-2018-09-20)", "score": 1, "replies": [{"body": "Oh wow, thanks for letting me know. I wonder if I'll have a chance to buy a little bit extra early when the market opens before folks realize it's been FDA approved.\nI wonder how high it'll go...", "score": 1, "replies": [{"body": "I put in an order for an additional 995 shares when the market opens @ 8:30 central time. Hopefully, my order won't get rejected. [My dream is that the Cantor Fitzgerald price point of $65](https://www.smarteranalyst.com/brief/cantor-fitzgerald-remains-a-buy-on-avita-medical-avmxy/) comes true. ", "score": 1, "replies": []}, {"body": "It has shot up to $2.15 so far.", "score": 1, "replies": []}, {"body": "whats your play with this? hold long term? sell on the pop?", "score": 1, "replies": []}]}]}, {"body": "The stock was @ $1.35 at the bell and has shot up to $2.15 so far since the market opened.", "score": 1, "replies": [{"body": "Hate to say this as someone who sold all of his Micron shares but \"Muuuun bound\"", "score": 1, "replies": []}]}, {"body": "Don't sell on the pop... they are ready for market launch. First year will def bring them increased sales, profit and name recognition. It's still always a risk but seems like a good risk to take. For an ADR to get FDA approval is big.\n\nMainstream media is catching on:\n\nhttps://www.nbcnews.com/health/health-news/fda-approves-first-spray-skin-product-n911976", "score": 1, "replies": []}, {"body": "The stock closed @ **$1.94** today. Up **13.45%.**", "score": 1, "replies": [{"body": "Let's see where it goes from here..", "score": 1, "replies": [{"body": "Do you think they’ll get bought out? I’m holding a little, but it jumped down so much yesterday so I’m not sure if I should keep holding ", "score": 1, "replies": []}]}]}, {"body": "[AVITA Medical Announces Receipt of $1 Million Research and Development Tax Credit.](https://www.marketwatch.com/press-release/avita-medical-announces-receipt-of-1-million-research-and-development-tax-credit-2018-09-25)", "score": 1, "replies": []}, {"body": "Everyone's asking the same question. I guess a couple of things:\n-wait for quarterly call and guidance\n- there is potential and an untapped market so there is a need.\n\nI'm holding for now.\n5k shares", "score": 1, "replies": []}, {"body": "[AVITA Medical Announces First U.S. Sales of RECELL® System and Commencement of Commercial Shipping.](https://www.marketwatch.com/press-release/avita-medical-announces-first-us-sales-of-recell-system-and-commencement-of-commercial-shipping-2018-10-17)", "score": 1, "replies": []}, {"body": "Where do you think it could go if/when it gets on nasdaq?", "score": 1, "replies": [{"body": "I can't say. No real way to know and that's the risk that comes with an OTC. But just seeing as how the FDA has bended over so much for this product, tells me that whether it's listed on Nasdaq or if it's bought out, it'll make money just because of the demand. It creates a need for a product where we didn't have one before but now that we do, burn centers and hospitals would want it.\nOne more thing I didn't add: I think they are also testing this on wound healing. And that's going to be an even bigger market that burns given how the older population has so many wounds(bed sores). I'm looking for more data to come out on that.", "score": 2, "replies": []}]}]}
{"title": "How I look at $AMD call holders today", "selftext": "", "id": "9cy1ka", "created_utc": 1536083587.0, "score": 593, "upvote_ratio": 0.97, "num_comments": 44, "comments": [{"body": "STILL ROOM ON OUR BAE TRAIN. ", "score": 121, "replies": [{"body": "CHOO CHOO MOTHERFUCKERSSSS", "score": 31, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "WELCOME ABOARD OUR TRAIN. ONLY PRAISE TO BAE, NO BITCH NIGGA SHIT ", "score": 3, "replies": []}]}]}]}, {"body": "I threw in 20$ into an amd 28.5 9/07 call last week and forgot about it, remember today and it was trading at 80. Having tendies for lunch today for sure", "score": 61, "replies": [{"body": "I really can't be salty about ~80% gains but wow I could have a triple bagger at 25 9/07s", "score": 20, "replies": [{"body": "Yea that’s true, never complain about gains. Move onto the next one and don’t let what could have happen cloud your judgement ", "score": 8, "replies": []}]}]}, {"body": "AMDEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEZ NUTS!!!!!!!!", "score": 25, "replies": []}, {"body": "Fuck this fucking bullshit. AMD and weed stocks up 1000%. All else red. I mean come on.", "score": 49, "replies": [{"body": "Rotation into weed and gaming cards it’s just part of the market cycle.", "score": 7, "replies": []}, {"body": "Sold my CGC early for AMD stocks ... the good kind of problem ", "score": 4, "replies": []}]}, {"body": "Yolo’d a $26 9/21 call a couple weeks ago. Up 4633%...", "score": 43, "replies": []}, {"body": "I’m almost at $ROPE. ", "score": 17, "replies": []}, {"body": "It's only the beginning of the week, you could join them.", "score": 13, "replies": []}, {"body": "Running around all happy like the stupid bastards they are. Seriously such a risky play. Could've easily gone south. ", "score": 29, "replies": [{"body": "I'm just pissy and bitter okay. I had puts.", "score": 29, "replies": [{"body": "Using this opportunity to buy more puts. Found some buried DD involving 22mil shares locked up with credit sussie that gets unlocked on sept 30. oct 5 puts all the way my friend", "score": 9, "replies": [{"body": "It'll be $35 by sept 30 ", "score": 5, "replies": [{"body": "And 25 well before then ", "score": 8, "replies": []}]}]}]}, {"body": "it didn't tho.\nCrazy run up and then cooled flat. If it was gonna dump, it woulda dump when it stalled. \nez gains ez life\n", "score": 3, "replies": []}]}, {"body": "MFW I had 22c 9/21 and sold early ", "score": 5, "replies": [{"body": "I'm worse. I had $21.", "score": 3, "replies": [{"body": "Rip tendies ", "score": 2, "replies": []}]}]}, {"body": "Lol you could have made money all day today. I bought 3 $30 calls around 10:00 AM and sold for 150% gainzzz after lunch. ", "score": 6, "replies": []}, {"body": "Yolo'd at 23 dollars. Sold at 28. Feels fucking good to finally win for once.", "score": 9, "replies": [{"body": "First ones free ", "score": 15, "replies": []}]}, {"body": "Yeah I had it since it was $18, sold the day before it jumped to 27 at 23 and finally caved in and bought MU.  I was so sure it was gonna drop back down to 23, so my pride stopped me from buying again at 24...  I feel like I jumped off the polar express", "score": 4, "replies": []}, {"body": "Why is my autism being rewarded I FOMO'd right before the drop last week and now I'm ITM ", "score": 3, "replies": []}, {"body": "Every penny amd goes up is a dollar for me.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Got 100 shares when it was $10.", "score": 4, "replies": []}]}]}, {"body": "/u/titletoimagebot", "score": 3, "replies": [{"body": "[Image with added title](https://i.imgur.com/OP4I8md.png)\n\n---\n\nsummon me with /u/titletoimagebot | [feedback](https://reddit.com/message/compose/?to=TitleToImageBot&subject=feedback%209cy1ka) | [source](https://github.com/gerenook/titletoimagebot/blob/master/titletoimagebot.py)\n\n**NEW** custom title! usage: /u/titletoimagebot \"your title here\"", "score": 3, "replies": []}]}, {"body": "I'm new to all this stuff.  Here's how my weekend went:\n\nGot 3 contracts of 8/31 25 C last week.  Lost money on the contracts, but they were ITM so I executed.  Was already sitting on \\~400 shares.\n\nHeard murmurs that selling covered contracts is a better bet than buying them... Okay, cool, I'll just sell seven 9/14 28 C for \\~300 bucks when the stock has already risen to like 26.30 today.  It has to go back down, right?\n\nHad I bought the contracts that I sold, I would have been up like 600%...\n\nNow I don't even know how to feel.  I made money...  that's good, right?\n\nI have a bit of cash and I kind of want to start selling 26 or 27 puts... Someone tell me why I'm an idiot.\n\n&#x200B;\n\nEdit: today is not Monday", "score": 2, "replies": [{"body": "Sell 18 puts, I bought 20 puts and sold 25 calls both oct. last week these motherfuckers are trippin.  NVDA ppl.  Fuck this semi rally.", "score": 2, "replies": []}]}, {"body": "Fucking $AMD... 09/7 23$ puts probably gonna die in a fucking $1000 fire. \n\nBut I don’t learn easy! I doubled down 9/21s $26 and $28. Fucking chill AMD and let us puts just put for a bit ", "score": 2, "replies": [{"body": "I got 9/21 $26 puts.. a little bit more time than yours... this motherfucker needs to go down..", "score": 1, "replies": [{"body": "I’m here with you at $26 and $28s. I got 5k on 30 puts 9/21s at $28 strikes. AMD just give me +10% I’m not greedy ", "score": 2, "replies": []}]}]}, {"body": "I had $25 calls exp sept 21, bought at $1.41 and I sold them at $2.04 this morning. I want fucking end it bois.  ", "score": 2, "replies": []}, {"body": "I got lucky with five 9/28 $29 calls. Made a solid 150% and got out. ", "score": 1, "replies": []}, {"body": "My 1/18/19 $25c liked today. I think Going to let them expire and see where they go.", "score": 1, "replies": [{"body": "My $17 1/18/19 liked today too.\n\nMight let it expire like you. ", "score": 2, "replies": []}]}, {"body": "Got in and got out with some calls. 40+% gain for a late train. Not too shabby. \n", "score": 1, "replies": []}, {"body": "Just in friend. Let run the train higher. ", "score": 1, "replies": []}, {"body": "I was about to buy AMD puts this morning. Good this I slept in ", "score": 1, "replies": []}, {"body": "I was all in on amd and cronos this past week so tendies fo sho", "score": 1, "replies": []}]}
