{"title": "AMD 64 core CPU benchmark leaks, strap in boys", "selftext": "[deleted]", "id": "9g87iq", "created_utc": 1537075186.0, "score": 85, "upvote_ratio": 0.93, "num_comments": 44, "comments": [{"body": "So $40 by next week? I need to make back my money after the 10% crash.", "score": 36, "replies": [{"body": "I will legit cash out and get a mortgage if AMD hits $40. ", "score": 23, "replies": []}, {"body": "Probably higher. You see, in that article, Intel's best chip only scored 1279 while the AMD chip scored 12587 which is roughly 10x Intel's score. Intel's share price closed at $45.54 on Friday. Ten times that value is what AMD's share price should be.\n\nSo AMD at around $450 on Monday.", "score": 62, "replies": [{"body": "Great analysis. I wouldn’t say $450 though, $420 sounds more reasonable.", "score": 41, "replies": [{"body": "Funding Secure ", "score": 19, "replies": [{"body": "SECured", "score": 9, "replies": []}]}]}, {"body": "🤔", "score": 3, "replies": []}, {"body": "Solid DD mate.", "score": 3, "replies": []}, {"body": ">Intel's best chip\n\n>X5650 and 3930k are from 2010 & 2011\n\n[hmm](https://i.imgur.com/NzWtLRb.png)", "score": 2, "replies": []}, {"body": "Solid DD. I'm all in.", "score": 1, "replies": []}]}]}, {"body": "Buying calls at open ", "score": 15, "replies": [{"body": "So these won’t be released until 2019 and announced maybe later this year? Long calls? ", "score": 1, "replies": [{"body": "FDs", "score": 5, "replies": []}]}]}, {"body": "This is huge. ", "score": 15, "replies": [{"body": "Big if true. ", "score": 6, "replies": [{"body": "Ginormous if correct", "score": 5, "replies": [{"body": "So glad I bought AMD on Friday.", "score": 3, "replies": []}]}]}, {"body": "But is it bad for MU?", "score": 1, "replies": []}]}, {"body": "Those bench marks are against CPUs that are like 4 years old. Author is master market manipulator.", "score": 24, "replies": [{"body": "Therefore OP is an autist masturbator ", "score": 9, "replies": [{"body": "aren't we all", "score": 2, "replies": []}]}, {"body": "Even intel's \"5Ghz\" water chilled 28 core that drew 2000 watts only got 6000 in this benchmark. That means this processor is more than 2x faster than 28 core 5Ghz intel 2000+ ice-water chilled Intel CPUs.\n\n\nIt's totally insane. Nothing like it exists, not even close.", "score": 1, "replies": [{"body": "It also has more than 2x the cores.\n\nThe intel 28 core was said to be an enthusiast chip for workstations and powerusers. The Epyc chip is a server CPU. The 28 core is competing with the threadrippers, not server chips. They are different markeds.\n\nAnd the Epyc is kinda like multiple CPUs in a single package from what I've seen. It's only a matter of time before Intel hits back.", "score": 0, "replies": [{"body": "Right now, Intel is kind of a joke.", "score": 3, "replies": []}]}]}]}, {"body": "Here I was trying to get out of the weekly game and then they just pull me right back in", "score": 4, "replies": []}, {"body": "AMD will go up because of CPU benchmarks or Data center information?\n\nHow do we benchmark the data center compared to nvidia and other data centers?", "score": 8, "replies": []}, {"body": "ITT: people who don't understand computers", "score": 3, "replies": []}, {"body": "I need to double my short position on Intel.  ", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Amd 8 cores lost to Intel quad cores from like 2008 to 2016.", "score": 4, "replies": []}]}, {"body": "My puts going to make me a lot of money on Monday. \n\nThis is a fake article. ", "score": 2, "replies": [{"body": "I hope you're homeless by Tuesday. No offense", "score": 34, "replies": [{"body": "Stylin on you breh ", "score": -2, "replies": []}, {"body": "@airmanoops funny thing is youll be the broke autist chasing a parabolic stock that had its tailwind taken away. I'm going to rofl so hard when you lose everything next earnings because theyll be back to losing money ", "score": -6, "replies": [{"body": "Spicy", "score": 5, "replies": []}, {"body": "What's the tailwind it lost?", "score": 2, "replies": []}]}]}]}, {"body": "102 p/e lol", "score": 0, "replies": [{"body": "The denominator is that equation is going to change a lot. I think AMD is on track to earn 20B in 2019, from 6B in 2017. ", "score": 4, "replies": []}]}, {"body": "What you dumbass AMD bulls don't know (and fuck you guys I bought at 10.20) is x86 architecture and ARM can both do servers , plus AMD is nearing the end of the lifecycle of x86 (uses a lot more power than arm) and you can only decrease size so much, sure AMD will do fine in next couple of years, but past that they don't have shit to offer. Nvidia will kill them in VR and ARM will kill x86", "score": -4, "replies": [{"body": "ARM will never kill X86. Some consortium RISC solution may one day do it though.", "score": 4, "replies": []}]}, {"body": "No one needs a 64 core processor.", "score": -14, "replies": [{"body": "Do you even Sys Admin bro?", "score": 6, "replies": []}, {"body": "ppl use processors for more than fortnite and buying drugs ya know?!", "score": 1, "replies": []}]}]}
{"title": "I am 25 years old. Made total of $3.9k this week in NIO and AMD calls and put that money in to Wells Fargo savings today. playing with remaining 5k house money I got. Any suggestions for next week play? I am currently living in my car but planning to rent a place starting next month.", "selftext": "[deleted]", "id": "9g889u", "created_utc": 1537075457.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 38, "comments": [{"body": "What’s with these depressing ass posts recently. If you are homeless or close to it then you’re an idiot gambling your money away like this. GTFO with this shit", "score": 39, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "when these posts start reaching a critical mass that's gonna be the top of the market ", "score": 2, "replies": [{"body": "Hopefully.\n\nBut i get the feeling most of them mimic the most basic memes here and blend in to some people. I think they are the first ones making ‘one of us’ posts.\n\nI like the vote bot idea. That could help. ", "score": 2, "replies": []}]}]}]}, {"body": "why are you trading stocks in a car? How about go get a job ", "score": 15, "replies": [{"body": "I am ok to live in a car. Don’t want to spend $ on rent.", "score": -11, "replies": [{"body": "Not sure why you're getting downvoted. It is a legitimate, reasonable position to take. Living in a car, you pay zero dollars in rent where it can cost as much as $2,000 in a high COL location. It's far better to pay for a gym membership and live in a van that costs less than a month's worth of rent (you can get a Chrysler Town & Country for $1,500). Granted, this works if you're single, unless you find another like-minded spouse or carmate. But of course, you'd hope to eventually get out of that situation and live in an actual four-walled space.", "score": -5, "replies": [{"body": "^ /u/chronicherpes\n\nHere is an example of what I was just talking about. Click on the guys account who is coddling OP. No previous activity here really. Two new /r/all’ers circlejerking with each other\n\n", "score": 2, "replies": [{"body": "I appreciate your theory but I’ve always lurked here for some good DD for over a year. Can’t speak for others though.", "score": 1, "replies": [{"body": "I have too. \n\nThat’s why ideally, these complete novices stop posting and get some basic knowledge somewhere else first\n\nHere is another example from a few mins ago https://www.reddit.com/r/wallstreetbets/comments/9gbtg8/professor_offering_extra_credit_if_we_pick_a/?st=JM5438EY&sh=937cb814\n\nAnyways, a good rest of your weekend!", "score": 1, "replies": [{"body": "I’ve noticed the same. This sub is leaking a bit. :)\n\nYou too!", "score": 2, "replies": []}]}]}]}, {"body": "Thanks you for the suggestion bro!", "score": 1, "replies": []}]}]}]}, {"body": "Not sure why the age is relevant. ", "score": 18, "replies": [{"body": "I’m 14", "score": 12, "replies": []}, {"body": "I’m 15 and still making retarded options trades ", "score": 4, "replies": []}]}, {"body": "Sell the car buy a yacht", "score": 8, "replies": [{"body": "I smell house boat.....", "score": 3, "replies": []}]}, {"body": "Keep swinging, you’ll never miss", "score": 7, "replies": []}, {"body": "I like your autistic frugality.\n\nIf you have a pimped out van, got a gym membership, live somewhere cool like by the beach in SoCal then hell yeah I could do that too. But that shit doesn’t really fly anywhere else in the country.\n\nMy suggestion for next week’s play is driving to Venice Beach.\n", "score": 6, "replies": []}, {"body": "I stopped reading when i saw Wells Fargo savings account..", "score": 11, "replies": [{"body": "Whats up? Too good for 0.10% interest rate? ", "score": 3, "replies": [{"body": "If you're gonna get a savings account, why wouldn't you get the one that pays 1.85%?", "score": 1, "replies": []}]}]}, {"body": "AMZN after 3/4 red days has been a good bounce play\n\ni'm in SQ calls. the tariff news on Monday will probably decide where the week starts off", "score": 4, "replies": []}, {"body": "nikka get a job first", "score": 5, "replies": []}, {"body": "wtf wells fargo? ally savings for max returns fool!", "score": 6, "replies": [{"body": "Word up ", "score": 2, "replies": []}]}, {"body": "$TEAM $100 calls", "score": 3, "replies": []}, {"body": "So much bad advice ITT.\n\nJust go all in with some leverage on something.  You'll probably win.", "score": 3, "replies": [{"body": "Triple the leverage. Go in on some vix calls!", "score": 1, "replies": []}]}, {"body": "Play the $MU earnings and YOLO 10/19 $55 calls. Open Interest is at 92k and has only a $0.51  premium.\n\nDefinitely wait till after Trump dabs on China and after the market dips to see if it is still worth it.", "score": 2, "replies": []}, {"body": "If you're that poor don't gamble. You just got lucky. Amd is one Intel CEO announcement from crashing. Apple from one tariff tweet from crashing. Your fd's are just like playing the casino.\n\nPut that money towards finding a place to live. Or toss it in vanguard growth mutual fund and enjoy the low risk gains.\n", "score": 2, "replies": []}, {"body": "MU $90’s of course ", "score": 3, "replies": []}, {"body": "Take it out of savings and put it in a muni bond. Better returns ", "score": 1, "replies": [{"body": "Thanks. Will look in to it.", "score": 1, "replies": []}, {"body": "What's the return on municipal bonds? Where do you recommend?", "score": 1, "replies": []}]}, {"body": "Cash out boi", "score": 1, "replies": []}, {"body": "Keep 40% of net profits for taxes in a separate account.", "score": -2, "replies": [{"body": "Dont ruin the surprise for him. ", "score": 9, "replies": []}]}]}
