{"title": "Five Below (FIVE) Options Play", "selftext": "&#x200B;\n\nFive below is taking a hit this morning trading below $100 per share pre-market for the first time since Dec 2018.  The stock has not seen the rise since phase 1 China trade deal announcements mid-December, more-than-partly due to investors in this expanding discount store awaited Q4 sales numbers.  Below is a link to a quick explanation that helps explain the drop.\n\n[https://www.marketwatch.com/story/five-belows-stock-tumbles-after-profit-sales-warning-as-holiday-sales-disappoint-2020-01-13?mod=mw\\_latestnews](https://www.marketwatch.com/story/five-belows-stock-tumbles-after-profit-sales-warning-as-holiday-sales-disappoint-2020-01-13?mod=mw_latestnews)\n\nWhile there is some truth that the less amount of days between Thanksgiving and Christmas hurt sales, we certainly still see the $42MM miss is for other reasons.  Even at 1,000 stores (which they plan to have by Thanksgiving 2020), there would need to have been 4,200 $5-units of sales per store per day to make up for the difference.\n\nEven so, we have been tracking this stock since the $30 pop of Q2 2018 earnings when the stock made a move from $71 to $101 and awaiting an opportunity, and see this as a great chance to get into the discount store game.  There is much other reading on the matter, but when a company is expanding and has an innate protection from recession by being a known discount store (such as Dollar Tree and Dollar General), there is great long-term potential to buying the stock.  But beyond that, we believe that continued expansion for a company with generlly impressive Q2 earnings reports could provide a nice early 2020 opportunity for profits.\n\n&#x200B;\n\nStocks:  Buy FIVE @ $97.00 or better and remember to set a 75% stop loss to protect your position.\n\nor\n\nOptions:  Buy-to-Open:  August 21 $115 Calls @ $6.00\n\nCurrent bid-to-ask as of 8:40am Central is $5.50 to $6.50, so go as low as you can get.  \n\n\nEdit: To indicate \"Buy-to-Open:\" for the Options Play", "id": "eo4y02", "created_utc": 1578926395.0, "score": 7, "upvote_ratio": 0.89, "num_comments": 10, "comments": [{"body": "The only thing you need to be aware of is the implied volatility. If it's still double what it is normally, you'll lose money when the volatility drops back down to normal, even if the price of the stock goes up.\n\nI think it's a good play, definitely take advantage of an overreaction, just don't get screwed by the implied volatility :)", "score": 3, "replies": []}, {"body": "Thanks for comments u/stockstronghold and u/OptionMoption.\n\nI want to follow-up with a discussion that would hopefully be useful for the community to consider regarding the above Option suggestion.\n\nSo you act on a situation like this that you have researched and tracked for years, and seemingly you have beat the implied volatility (for now) with a strong recoil from the over-reaction.\n\nWhat should be some top considerations for exiting an option position that is +50-75% in one day with an expiration that is 7 months out?", "score": 2, "replies": [{"body": "Well my first question is if you bought an option for 7 months out, are you trying to do more than capitalize on an overreaction? \n\nIf you want it to be an overreaction play, usually sticking with options that are ~4 weeks from expiration seems to be the best bang for your buck. \n\nI personally don't like options in the 6-9 month time frame just because I feel like there are better options (ha jokes) for different kinds of plays. \n\nOne great example of a long term lower risk play (if that's what you're looking for) would be when Apple fell and hit ~$160 around the end of 2018. With Apple being the powerhouse it is, there was a great chance that this drop in price wouldn't last long (and clearly it didn't). \n\nIn the situation with a company that has as much market share and history as Apple (MasterCard, Visa, Microsoft, ect) a big drop is a perfect time to buy leap calls (1 year out and given the company isn't going bankrupt) either right at the money (less risk but more initial capital) or out fairly far out of the money (more risk of expiring worthless, but much less initial capital). \n\nEither of those plays would've given you a substantial gain (someone I know bought the $240 calls in 2018 that expire on 17 Jan 2020 for $2.00 now worth over $72.00, 3600% return) and the best part is that a great company like Apple has the power/potential to come back from a bearish trend. \n\nAs in all trades, doing your research is the most important thing you can do. You can do short term overreaction plays on any sort of sub par company because their long term success isn't what you're making money on. When it comes to overreaction leap plays, it's best to stick with well known companies, blue chips usually, as they have the greatest likelihood of continuing to increase in value as time goes by. \n\nIf any of that didn't make sense feel free to let me know and I'll try better to explain/give more detail.", "score": 2, "replies": []}, {"body": "Sell to close. Is there really a discussion to have?", "score": 1, "replies": []}]}, {"body": "Are you selling the call against the stock or are you suggesting buying the call as an alternative to buying shares?", "score": 1, "replies": [{"body": ">Five\n\nThanks, doougle!  Was suggesting either/or depending on personal preference.  I edited the post to be more clear.", "score": 2, "replies": []}]}, {"body": "Good call, the stocks almost up 10% off its low.\n\nGreat learning opportunity here for a newbie like me, definitely can see the over reaction and the slow trek up for people realizing that.", "score": 1, "replies": []}, {"body": "We are posting the MW trash. Did we really fall that low?\n\nBut I give it to you, there's some actionable discussion of option plays, I'll let it through this time.", "score": 1, "replies": []}, {"body": " Saw the huge vol coming in at $100. Jumped in, and sold at $106, which was around a 2ATR move. Out for a 142% gain on call options.\n\n&#x200B;\n\nHad no idea this was a discount store. Though it was FIVE networks.  😂", "score": 1, "replies": []}, {"body": "Option Action:\n\nSelling to Close: August 21 $115 Calls @ $11.00 or better\n\nCurrent bid-to-ask is $11.20 to $11.70\n\nNice 1-day profit!", "score": 1, "replies": []}]}
{"title": "TSLA amd AMD calls have me shooketh", "selftext": "", "id": "eo5awm", "created_utc": 1578928117.0, "score": 14, "upvote_ratio": 1.0, "num_comments": 20, "comments": [{"body": "Congrats! I would sell that TSLA call but I'm a dumb bear so what do I know", "score": 4, "replies": [{"body": "I thought about it... might hold a lil longer... then again, we're all retarded bull and bear sooooo", "score": 1, "replies": []}]}, {"body": "600c lol how high are you? Oh well, bull gang to the max", "score": 3, "replies": [{"body": "Gang gang. as high as Oppenheimer apparently", "score": 4, "replies": [{"body": "I don’t think Oppenheimer was setting a $600 price target for the end of January lol. But crazier things have happened. Personally I’m bearish and think $500 is a top but Elon can go ahead and prove me wrong.", "score": 2, "replies": []}, {"body": "Get that hitter.", "score": 1, "replies": []}]}, {"body": "Lol I said the same thing about $420 a few weeks ago. Nobody knows at this point just wait amazon or google will buy Tesla, and they will announce their first flying car, and it will be 5k a share chicken nuggies for everyone", "score": 2, "replies": []}]}, {"body": "Welcome to the team, only buy calls on apple, tesla, and semis (amd, mu, tsm, nvda). The trend is your friend", "score": 3, "replies": [{"body": "Agree but also very cautious. Seems super inflated atm but hype is a powerful thing that will continue to drive these puppies up. But at any sign of a slowdown I’ll be the first one to buy puts.", "score": 2, "replies": []}]}, {"body": "Keep the $600 tesla call. With this kind of momentum i think $600 is possible, not to mention about the ER call on the 29th of this month. Good luck !", "score": 2, "replies": [{"body": "I sold. I'll look into buying again tomorrow morning.", "score": 1, "replies": []}]}, {"body": "So shook, you spelt AMD x2", "score": 2, "replies": [{"body": "shooketh", "score": 1, "replies": []}]}, {"body": "Am I the only dumbass on this subreddit that's managed to lose money on AMD these months??", "score": 1, "replies": [{"body": "maybe. I thought stonks only go up? what'd u do", "score": 2, "replies": [{"body": "Get greedy and expect premium to continue rising before theta decay Rams me up the ass. Atleast that's what it looks like in retrospect..", "score": 1, "replies": []}]}, {"body": "I am also losing AMD tendies", "score": 1, "replies": []}]}, {"body": "Is this the $100 account you started this year sir? If so, this is crazy gainz.", "score": 1, "replies": [{"body": "Haha I wish. I haven't done much with the $100 accnt. Ngl, still tryna learn TOS UI. But I'm gonna work on it soon. This is just my main accnt that i fk around with. I started with around $500 ish tho.", "score": 2, "replies": [{"body": "Still pretty nice. Better than what I could do I'm sure", "score": 2, "replies": []}]}]}]}
{"title": "$TSLA and $BYND are changing my life", "selftext": "", "id": "eociy1", "created_utc": 1578958675.0, "score": 21, "upvote_ratio": 0.97, "num_comments": 13, "comments": [{"body": "Wow! Congrats!", "score": 3, "replies": [{"body": "Thanks, man. It’s been a fucking whirlwind.\n\nIf both open higher from after hours or pre market trading, I’ll likely have $25k to start the day. Infinite day trading, here I come!", "score": 6, "replies": [{"body": "Why not just not use margin and then you can say trade all you want.", "score": 4, "replies": [{"body": "I’m not interested in margin.", "score": 2, "replies": [{"body": "So why can’t you say trade all you want? Do you trade on RH? Cause my understanding is that if you have a cash account, the federal PDT rule doesn’t apply. I’m on TDA and while my account was over $25k for the past couple years, it hasn’t been for the past month and I’ve only day and swing traded. No issues for me.", "score": 1, "replies": [{"body": "So PDT rules apply to cash accounts with a value of 25k or less. Until tomorrow when it hits 25k at open, I can’t day trade however much I want. Just 3 times a week.", "score": 2, "replies": [{"body": "So I wonder why I haven’t gotten restricted. I hardly think I’m getting any sort of a free pass on TDA. \nWhat do you trade on?", "score": 2, "replies": [{"body": "I trade on RH. I have a Fidelity acct but don’t use it.", "score": 2, "replies": []}]}, {"body": "This is only true with RH. You can make as many trades as you want with a cash account, and with settled cash.", "score": 2, "replies": [{"body": "Wow, that’s so dumb. Also shows what I know about other platforms. 🤡", "score": 1, "replies": [{"body": "Yeah, RH is weird. I have about 16k in Fidelity and make about 1-2 trades a day on settled cash and I haven't gotten flagged or anything.", "score": 1, "replies": []}]}]}, {"body": "This explains it well. The FINRA page is a little confusing, but touches on it as well, but both clearly outline that PDT is in regard to margin accounts only. The issue you may be having is with the free rider rule, wherein you can’t trade with funds that have not yet settled. That will not change with you meeting the $25k minimum for PDT. I would guess that some brokerages lump all of this together, but they are different.\n\nhttps://www.investopedia.com/terms/p/patterndaytrader.asp", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Nice job!", "score": 2, "replies": []}]}
{"title": "Amd vs Msft vs Enph", "selftext": "[deleted]", "id": "enwiwr", "created_utc": 1578876615.0, "score": 3, "upvote_ratio": 0.71, "num_comments": 11, "comments": [{"body": "MSFT is safest. I just bought $800 of it last wk.", "score": 5, "replies": [{"body": "That’s like 5 shares.", "score": 4, "replies": [{"body": "Yup. All my cash is in biotech currently. Bought MSFT on a dip", "score": 3, "replies": []}]}, {"body": "Ty", "score": 2, "replies": []}]}, {"body": "Of the ones you listed, I am personally most bullish on MSFT primarily because of continual growth in Azure. Many companies are beginning to be wary of giving Amazon their data especially if Amazon competes directly with their products. Further, companies that are starting to move to the cloud have long-standing partnerships with MSFT and will likely continue to use their services. \n\nGood article on the subject: [https://www.wsj.com/articles/amazon-has-long-ruled-the-cloud-now-it-must-fend-off-rivals-11578114008](https://www.wsj.com/articles/amazon-has-long-ruled-the-cloud-now-it-must-fend-off-rivals-11578114008)", "score": 4, "replies": [{"body": "Thanks!", "score": 0, "replies": []}]}, {"body": "Looking for high growth or safe reliable growth? Either way I wouldn't pick AMD, extremely overvalued. Both MSFT and ENPH are good choices.", "score": 2, "replies": [{"body": "Thanks, just bought MSFT this morning! My first buy outside of penny stocks.", "score": 1, "replies": [{"body": "Gratz mate! Welcome to investing.", "score": 2, "replies": [{"body": ":)", "score": 1, "replies": []}]}]}]}, {"body": "$ENPH FOR THE WIN!", "score": 1, "replies": []}]}
{"title": "These stocks soared even as the companies lost money — here’s why that’s not as crazy as it sounds", "selftext": "**Forty-five money-losing companies have at least matched the S&P 1500’s 28% gain over the past year** \n\nThe monetary forces that have helped feed the bull market are so strong that scores of stocks have risen significantly over the past year even as the companies themselves have been losing money.\n\nA list of some of the best performers among the money losers is below.\n\nIn a [**Wall Street Journal article**](https://www.wsj.com/articles/money-losing-companies-mushroom-even-as-stocks-hit-new-highs-11578608209), James Mackintosh called Tesla [**TSLA,** **-0.07%**](https://www.marketwatch.com/investing/stock/tsla?mod=MW_story_quote)  and General Electric [**GE,** **+3.73%**](https://www.marketwatch.com/investing/stock/ge?mod=MW_story_quote)  “the two most valuable loss-making companies,” after Tesla’s shares had doubled in three months and GE’s stock had risen 44%.\n\n**“The proportion of U.S.-listed companies losing money for three years reached its highest last year in data stretching back to the late 1990s,”** Mackintosh wrote, citing data compiled by Andrew Lapthorne, global head of quantitative research at Société Générale.\n\nWith negative interest rates in Europe and Japan, and increasing stimulus by the U.S. Federal Reserve, maybe investors shouldn’t be surprised that the S&P 500 Index [**SPX,** **+0.70%**](https://www.marketwatch.com/investing/index/spx?mod=MW_story_quote)  has returned 26% over the past year. Investors see the U.S. stock market as a haven.\n\n&#x200B;\n\n[https://www.marketwatch.com/story/these-stocks-soared-even-as-the-companies-lost-money-heres-why-thats-not-as-crazy-as-it-sounds-2020-01-13](https://www.marketwatch.com/story/these-stocks-soared-even-as-the-companies-lost-money-heres-why-thats-not-as-crazy-as-it-sounds-2020-01-13)", "id": "eoagfx", "created_utc": 1578950026.0, "score": 18, "upvote_ratio": 0.81, "num_comments": 7, "comments": [{"body": "[deleted]", "score": 7, "replies": [{"body": "TIL: $CRO^X CS", "score": 2, "replies": []}, {"body": "It’s not KO", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That list isn’t KO Coca Cola it’s a distributor not the same company. KO (the Coca Cola everyone things about) makes plenty of money. The ticker in that article is for COKE.", "score": 1, "replies": []}]}]}]}, {"body": "Ge may rise a little but they have too much to overcome.", "score": 4, "replies": [{"body": "GE is cheap when looking at the sum of all its parts.", "score": 3, "replies": []}, {"body": "Eh", "score": 0, "replies": []}]}, {"body": "Basically, structural price support. Capital has nowhere else to go.", "score": 2, "replies": []}]}
{"title": "r/Stocks Daily Discussion Monday - Jan 13, 2020", "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing\n  * [Corporate News](https://www.streetinsider.com/Corporate+News)\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n  * [Economic data](https://www.streetinsider.com/Economic+Data)\n  * [FED](https://www.streetinsider.com/Fed) - Federal Reserve news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&t=all&restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.", "id": "eo1a1u", "created_utc": 1578902929.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 20, "comments": [{"body": "Microsoft or Apple?", "score": 2, "replies": [{"body": "Both.", "score": 3, "replies": [{"body": "I just put in for both. Very different markets.", "score": 2, "replies": []}]}]}, {"body": "Looking for any Debt Consolidation recommendations to invest in, with the possible correction thought might be a good idea, if possible on the TSX", "score": 1, "replies": []}, {"body": "With the U.S. - China trade deal to be signed soon, which stocks do you think stand to gain the most from it?", "score": 1, "replies": [{"body": ">If you go through the 86 pg documents it is no different from what has been said all along. I suspect low end nickel and dime, clothing will gain most stock price and earnings.  For me it is Dollar General, Dollar Store etc.", "score": 1, "replies": []}, {"body": "Bruh it’s not gonna get signed, Trump is just pumping the market. It’s his 7th time saying this shit.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Tencent is great. The one bright side of two years of China stocks getting hammered is that they have room to grow realistically in ways that lots of top American stocks do not. Tencent is among the best of that group.", "score": 1, "replies": []}, {"body": "Tencent (TCEHY) still got more momentum. Its social media platform is better than anything I hav e seen. Since 2018 I started seen their Wechat pay available at US high end shopping (west coast), more common than Apple Pay.  900M users.  Analysts recommend strong buy.\n\nIt got messed up because of the Trade War.", "score": 1, "replies": []}]}, {"body": "[Check out this link and write down the industries.](https://www.barrons.com/articles/china-trade-deal-signed-tech-investors-tariffs-exports-imports-huawei-51578927657)", "score": 1, "replies": []}, {"body": "Will salesforce (CRM) keep climbing?", "score": 1, "replies": [{"body": "I'm a future reader. I can only see CRM falling far enough to trigger my buy signal, then launch to the moon.", "score": 1, "replies": []}]}, {"body": "How do you guys feel about NIO inc today? With Tesla doing so well do you think NIO will keep climbing?", "score": 1, "replies": [{"body": "I have put some money in it. It is definitely a risky stock, but it is cheap enough to take a risk in my opinion.", "score": 1, "replies": []}]}, {"body": "Thoughts on Albertsons going public?", "score": 1, "replies": []}, {"body": "Should I be concerned about this fed repo thing tomorrow?", "score": 1, "replies": []}, {"body": "Considering getting stocks for the first time.\nMy plan would be to buy the S&P500 but is it the right time?\nIm uncertain between buying now or waiting for a possible correction.\nWhat are your thoughts about that guys?", "score": 1, "replies": [{"body": "Time in the market is way more important than timing.", "score": 1, "replies": []}]}, {"body": "Thoughts on Roku?", "score": 1, "replies": []}, {"body": "Uhm kinda off topic but I'm just starting out and I don't still get the difference between UITF and Mutual Funds. I watched and researched it all appears to be the same thing, is their something I'm missing out?", "score": 1, "replies": []}]}
{"title": "Does anyone see $tsla going down drastically?", "selftext": "I don’t know if I do personally what are your guys thoughts?", "id": "eocg1f", "created_utc": 1578958315.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 12, "comments": [{"body": "It might have a slight pullback. No one knows how much that will be exactly or when it’ll happen. With analysts and good news pumping it it’ll likely see 600. I doubt it pulls back anywhere under 400 unless they have a terrible ER or shit goes south for them. Which at the moment with how much innovation and growth is going on over there I doubt it.", "score": 5, "replies": []}, {"body": "1500 eoy", "score": 5, "replies": []}, {"body": "I fully expect Elon to announce a secondary (third?) offering soon. Take advantage of this sky high PPS and put 5-10 billion in their coffers. \n\nThat will tank the stock but it will bounce back on some other tweet.  This is the momo stock of the 2020s.", "score": 2, "replies": [{"body": "Not really, havn't tanked on previous dilutions have it ?", "score": 1, "replies": []}]}, {"body": "Lol, probably", "score": 1, "replies": []}, {"body": "no doubt there were be some pullbacks along the way, but my guess is that the momentum will continue carrying the stock upwards.\n\nKeep in mind that today the tesla website estimates 8-11 weeks for delivery of a car, while the estimate last year was less than half that.  Demand is obviously strong, and this demand story will make its way to the news headlines in due time.", "score": 1, "replies": []}, {"body": "Of course, it’s actually quite hilarious, because you damn well know people buying Tesla shares aren’t going to sell. They’ll ride this baby down. \nNo matter how poor they do financially, they’ll market something they won’t be able to manufacture to get a news headline. Whether it’s those fake solar panels, the semi truck, the cyber truck, or the roadster; we’re never going to see these things come to the market. \n\nThe roadster was announced 2017, and reservations were allowed to be made. It’s now 2020. This is where it gets really funny (he did the same shit with the cyber truck btw). To reserve your Tesla roadster it requires an initial $5000 payment through credit card, and then a $45,000 wire transfer in 10 days max; and that’s just for the regular edition. The founders edition, whatever the fuck that means, requires the same initial 5’s up front. Then a $245,000 payment in 10 days. \n\nSo let’s say you get either one. The Founders edition must mean you’re a total dumb fuck, because you’re basically loaning Elon $250,000 for 3+ years now. With NO INTEREST. How he tricks retards into giving him capital is beyond me. \n\nHe does this with smaller dollar amounts also, but this is just one of many examples where Tesla takes your money with no product in sight. \n\nTesla has never posted an annual profit. Never will. They’ll muster up their financial numbers for one quarter every year and post some small profit; which is why most of their finance team quit a long time ago btw. Those multi billion dollar losses every year might be able to last due to the current stock market bubble. But when we enter recession in a year, you better believe this stock is coming down with the rest. Of course it sounds absurd to someone who hasn’t witnessed a stock market mania before, but this can be viewed as a learning experience. \n\nTesla has one thing that other multi billion dollar losing companies don’t have. Convincing easily manipulated people that it is more than just a car company. That’s their biggest selling point, and it’s all based off of false marketing. It’s exactly what’s keeping their stock alive. But I’m not a fool to short a stock that has so many millennials tricked. Let them throw money at it, I’ll laugh when it’s tanking during the recession.", "score": -5, "replies": [{"body": "It will come down but they have such a key placement ahead of the other manufacturers that they deserve a  strong market cap compared. Their future is bright even if they are valued high to today.  They will grow into it.\n\nI wouldn't be surprised if tsla goes up to 750 before crashing down to 4-300s but if people think it'll be down to 180 like last year... That's ignoring too much that has happened.", "score": 1, "replies": []}, {"body": "Tbh no, is that something you damn well know? My shares are secured by a stop loss so I'm just riding the profits machine", "score": 1, "replies": []}, {"body": "Short then", "score": 1, "replies": []}]}, {"body": "Mean reversion baby! As hard as it goes up, it will pull down. Gravity at its finest!", "score": 0, "replies": []}]}
{"title": "Should I buy Apple or Disney?", "selftext": "Looking to get my first share in stock. \n\nI would just buy a share and then probably sit on it for a couple years. Possibly invest more with time or use earned money to reinvest. \n\nWhat would be better to buy?\n\n1 share of Apple \n(Apple seems enticing for me because they are likely dropping a new iPhone in a few months, as well as the new 5G iPhones at the end of this year. It seems like no matter what happens Apple stock goes up and if anything this year and next would likely be good years for Apple.)\n\nOr\n\n1 share of Disney and 1 share of AMD?\n(Disney is having a great year, with Disney+, new parks, movies, etc. there’s clearly a lot of love for Disney that’s not going away any time soon. Also AMD is just showing a lot of motivation to do something!) \n\nThanks.", "id": "eocmoa", "created_utc": 1578959132.0, "score": 1, "upvote_ratio": 0.54, "num_comments": 15, "comments": [{"body": "Apple definitely! I mean both are great long term companies but Apple still has a lot to provide in terms of innovation. Their balance sheet is amazing. Tons of cash on hand and their vision is excellent. I only see them dramatically increasing in value for the next decade and beyond!", "score": 13, "replies": []}, {"body": "Apple, always Apple.", "score": 10, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "congrats with your 10-bagger", "score": 1, "replies": []}]}, {"body": "I own Apple but would suggest buying both for the long run.", "score": 3, "replies": []}, {"body": "I think they're all pretty good bets, but since it's either/or, I vote Apple solely because they're pretty much considered the most stable stock of 2020. And they give dividends.", "score": 3, "replies": []}, {"body": "DIS. Disney+ numbers will blow by estimates and the company will be re-priced based on this \"services\" revenue, similar to AAPL.", "score": 4, "replies": []}, {"body": "Apple without any hesitation", "score": 2, "replies": []}, {"body": "Apple", "score": 3, "replies": []}, {"body": " Buy ASME", "score": 1, "replies": []}, {"body": "Depends on how long you’re holding it. I sold my Disney shares yesterday. They’ve been kinda dead the last few weeks tbh.", "score": 1, "replies": []}, {"body": "Both have huge reach globally. Tough call. Right now I'd go with Disney, only because it's cheaper(!) and I like the upside of Disney's streaming service.", "score": 1, "replies": []}, {"body": "Wait for a 10% pullback.  Way to overbought", "score": 0, "replies": [{"body": "RemindMe! 1 year", "score": 0, "replies": [{"body": "There is a 4.9 hour delay fetching comments.\n\nI will be messaging you in 1 year on [**2021-01-14 00:55:47 UTC**](http://www.wolframalpha.com/input/?i=2021-01-14%2000:55:47%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/eocmoa/should_i_buy_apple_or_disney/febvu5i/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Feocmoa%2Fshould_i_buy_apple_or_disney%2Ffebvu5i%2F%5D%0A%0ARemindMe%21%202021-01-14%2000%3A55%3A47%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20eocmoa)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "You should have bought both a year ago. Now? Tough call.", "score": 0, "replies": []}]}
{"title": "Tesla: Self-Supervised Learning, Dojo, And Full Self-Driving", "selftext": "", "id": "eo60ko", "created_utc": 1578931354.0, "score": 36, "upvote_ratio": 0.9, "num_comments": 20, "comments": [{"body": "Very detailed and informed (in my opinion) article with good examples (videos).  \nIf you believe Tesla can do this in 2020, today's jump for the stock to over 515$ is cheap.\nI am really excited about \"Project Vacation\" and Dojo.", "score": 5, "replies": []}, {"body": "What's your stock price estimate if Tesla won't pull out robotaxis?", "score": 2, "replies": [{"body": "$750", "score": 4, "replies": []}, {"body": "I don't specialize in that, so I would defer to analysts who have looked at this question carefully. I think Wall Street analysts do a better job modelling the electric vehicle opportunity than I could ever do. But most tend to ignore the autonomy opportunity or at least not factor it into their price targets (with the noteable exception of Adam Jonas at Morgan Stanley).", "score": 3, "replies": [{"body": "The $10-$500 guy?", "score": 4, "replies": [{"body": "Lol yes", "score": 4, "replies": [{"body": "They all actually just hated on Tesla till 3 weeks ago when then decided to push this stock from 390-510", "score": 1, "replies": []}]}]}]}, {"body": "Are you saying no fsd or no robotaxis?\n\nAlso are you still including the energy business?", "score": 1, "replies": [{"body": "No robotaxis and no level-5 FSD. \n\nI'm very bullish on TSLA but I'm considering all the FAD edge cases and legislation needed in place for robotaxis.", "score": 2, "replies": [{"body": "Hard to say with energy revenue. But from a pure car play no more then 500 a share if that.", "score": 1, "replies": [{"body": "I'd easily say higher than that for automotive. They can still sell the living crap out of their existing software capabilities plus i expect margins to be way better on EVs right from the getgo compared to ICE. 25% margin right out the door is like 5 times more than on ICE vehicles, but no service revenue sadly. However on SUVs you could fish an even bigger margin and if EVs prove to last a million miles, they could even become more expensive relative to ongoing costreductions of manufacturing.", "score": 1, "replies": [{"body": "Margins are good now but they will drop once the lower models pick up and they have to scaling support teams to real levels.\n\nMillion miles is actually bad for Tesla, they want to sell cars as they have no saas model right now. \n\nEven at 500 share price that is with 25% margin and close to vw gross numbers. People need to be a little more realistic with the car aspect of the business. I keep seeing everyone saying fsd and solar aren't priced into the stock and that is all to come but purely from a car play, Tesla is only worth around 30-40B.", "score": 0, "replies": [{"body": "It depends on where you see teslas car sale numbers in 10 years from now. If you donr believe in solid numbers now then i get where you are coming from. But like i said, there is still a shitton of revenue waiting to be made on their infotainment system. Premium connectivities, apps, performance boosts, you name it.", "score": 1, "replies": [{"body": "The margin will drop once they invest in actual build quality and luxury. Infotainment revenue will most likely be negligible and performance boost and things like that are just leading to bundling like the legacy automakers. \n\nI'm counting it at Volkswagen sales numbers. It's absurd to think they'll sell more then that unless they do robotaxis.", "score": 0, "replies": [{"body": "Selling at VW numbers would have tesla at a 100 fold value compared to VW value. If tesla still doesnt spend billions on adverts, no dealerships and keep their costs in check and not spend billions in unnecessary glashouses for show and idiotic salaries to management which does nothing but drink coffee all day then i am pretty sure they are ruling the planet at that point.", "score": 1, "replies": [{"body": "You really think Tesla will be valued at over 10T selling just cars?\n\nYes VW is bloated but they still maintain better net profit then Tesla. Just having those extra pieces doesn't mean they are all mismanaged. Dealerships help vw financials and serve as a way to deal with demand curves and S&OP planning. Honestly Tesla doesn't have these issues today because they are still catching up production to demand but they'll have to cope with it eventually.", "score": 1, "replies": []}]}]}]}, {"body": "AAPL is worth 1.4 trillion essentially because it put a full computer into a phone.\n\nLikewise Tesla could do the same or better just based on that.", "score": 1, "replies": [{"body": "Apple makes a product that has 60+% gross margin lol, established infrastructure, strong corporate governance, they offer services and advertising revenue, have huge levels of human capital they are sitting on and have an ecosystem built on trapping users into their suite. Not to mention ~300 B of cash sitting around. \n\nJust to touch the pl numbers Tesla would have to generate over 1.2T a year....that's an excess of 20 million cars a year or 68x their current rate.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "The big edge cases are going to be lighting and weather conditions. Camera based systems are going to have the same vulnerabilities as human drivers when it comes to driving into the sun (lens flares) and in very bad weather (Heavy fog, snow). I doubt forward radar alone is enough of a hedge for this. So the vehicle will either need to pull over and refuse to drive (or drive very slowly) until conditions improve, or it will have to proceed at speed with low confidence. This is no different than a human driver, and indeed everyone just drives on even if their vision is impaired by weather, but the implication is different if a manufacturer has chosen to allow the vehicles to operate with incomplete data. On the other hand, passengers will be irate if their taxi pulls over on the highway and refuses to proceed. I just hope this has been well thought through and that we don’t see high profile accidents due to these vulnerabilities that put more regulatory resistance in the way.", "score": 2, "replies": [{"body": "100% true. Boeing has had a ton of problems (go figure) with a camera vision system for the Air Force's KC-46 tanker....the kicker is that it isn't even automated....it's just broadcast to a TV screen for a guy to control the refueling equipment.", "score": 2, "replies": []}]}]}
{"title": "Jim Cramer on Twitter: China backing off from ending subsidies for electric cars-- Huge for Tesla", "selftext": "", "id": "eo86s2", "created_utc": 1578940657.0, "score": 76, "upvote_ratio": 0.96, "num_comments": 10, "comments": [{"body": "Did u buy TSLA? Jim..\nU got to put ur cash where ur mouth is..", "score": 14, "replies": [{"body": "He’s not allowed to, at least openly.", "score": 7, "replies": [{"body": "He can; he has a portfolio hes been actively trading for 20years and lets all his Action Alert plus subscribers have access too. All the dividends and distributions are given to charity.", "score": 1, "replies": []}]}, {"body": "His daughter and wife love the car so much, maybe they will buy a few share 😉", "score": 6, "replies": [{"body": "It's Jim Cramer. He was buying shares when he was talking shit about them. Now he's just cashing in.", "score": 7, "replies": []}]}, {"body": "Is there a way to check", "score": 1, "replies": []}]}, {"body": "Wow, so news.", "score": 5, "replies": []}, {"body": "But BEV demand in China is dropping!\n\nYea, because everyone's putting in orders for Teslas!", "score": 3, "replies": []}, {"body": "Usually if you want to make any money you fade whatever Cramer does.", "score": 2, "replies": []}, {"body": "I think bulls and bears can agree this guy is a charlatan.", "score": 1, "replies": []}]}
{"title": "Is splitting the stock a thing that Tesla should consider to lower the price?", "selftext": "Now with the stock @ 517$ and possibly soon approaching 1.000$ in a few years I have been thinking about the need for a stock split.  \n\nThe price of over 500$ is quite a steep entrance fee for many \"normal people\" to buy into the stock.  \nWatching Amazon at 1.890$ is even worse.  \n\nSo is splitting the stock to lower the price something that could benefit Tesla?\n\nWhat do you think?", "id": "eo9htr", "created_utc": 1578946180.0, "score": 13, "upvote_ratio": 0.78, "num_comments": 19, "comments": [{"body": "[deleted]", "score": 61, "replies": []}, {"body": "1,000 by EOY\n\nNo stock split", "score": 17, "replies": [{"body": "1000 by EOY *with* stock split 😉", "score": 10, "replies": []}, {"body": "Haha I wish", "score": 4, "replies": []}, {"body": "next week maybe?", "score": 1, "replies": [{"body": "Today actually", "score": 1, "replies": []}]}]}, {"body": "Splitting makes no sense to me.  All it does is give better access to low net worth investors who may only have a few hundred dollars to invest.  Now people can just buy fractional shares on Robinhood, so let’s just do this BRK.A style.", "score": 12, "replies": [{"body": "Robinhood only works in US, in Europe there's no way to do that. I have been investing for 3 years now and a lower share price would be apreciated, since I'm a student with low income", "score": 2, "replies": [{"body": "Revolut allows for fractional stock buying", "score": 5, "replies": [{"body": "And trading 212 just started offering it.", "score": 1, "replies": []}]}, {"body": "Trading212 allows you to buy fractional shares in the UK at least. Not sure if it’s allowed but I can DM you a referral for a free share on sign up if you want? Don’t really like to plug shit but I’ve had a good experience with it so far.", "score": 5, "replies": []}]}]}, {"body": "I don't think so really. I think a low price may just encourage volatility.", "score": 1, "replies": []}, {"body": "Millennials are a significant portion of TSLA investors so keeping the stonk more accessible seems like a decent strategy for continued growth. I believe a split may be in our future, but I also have no idea what I am talking about.", "score": 1, "replies": []}, {"body": "brokers are gonna find a way for fractional shares where price wont matter.", "score": 1, "replies": []}, {"body": "I think its better if they don't, but I will say I regret not buying last summer. When it was at 200, I KNEW it would rebound, I figured it would settle at 320-350.  I had $20,000 ready to go, but I chickened out! Now, I feel like its too high to buy in, but Im not surprised if it goes to 650 and settles down until the Y comes out.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "He might have hesitated because of greed like I did.  \n> Holy s..t, I wait until it goes lower.  \n  \nThen find myself waiting so long it went up and I lost my taste for more.", "score": 1, "replies": []}]}, {"body": "this didnt age well", "score": 1, "replies": [{"body": "No. But Im happy to say I got in at 515 so Im very happy.", "score": 1, "replies": []}]}]}, {"body": "Don't you worry. The price will be lower soon enough.", "score": -1, "replies": [{"body": "Lol, you posted a bearish comment in this sub! XD I LOVE IT", "score": 0, "replies": []}]}]}
{"title": "Tesla's biggest bull explains why his price target is $612", "selftext": "[https://www.youtube.com/watch?v=Rj4pREMSHg8](https://www.youtube.com/watch?v=Rj4pREMSHg8)\n\nWe almost did +10% today, which is very impressive. Even more impressive is the fact TSLA share price accelerated at the end of today' session, rather than decreasing (for profit taking).\n\nI think Oppenheimer's Colin Rusch is in part responsible of end of session's price Rush.\n\nPS. As we know he's not TSLA biggest bull btw.", "id": "eoaiw6", "created_utc": 1578950310.0, "score": 18, "upvote_ratio": 0.89, "num_comments": 10, "comments": [{"body": "The push near closing hours looks like short covering.", "score": 14, "replies": []}, {"body": "I really 24/hr news networks of all kinds.   Totally uninformed talking heads ranting about whatever headline they read last.   Who brings up coal and oil when talking about EV competition in general.   Guys answer was perfect.", "score": 6, "replies": []}, {"body": "I closed my positions too early today, missed a lot. I only have access to 1/15 options. Is it wise to buy in again tomorrow even though it expires a day later?", "score": 4, "replies": [{"body": "I can only buy 1/15 options too.\n\nI think it's too risky now. I'd rather wait for the next round of options and buy some of those.", "score": 1, "replies": [{"body": "Okay thanks! I'll definitely do that. 😊 are you based in EU too as well?", "score": 1, "replies": [{"body": "Yes!\n\nI use Plus 500, and you?", "score": 1, "replies": [{"body": "Yes, the same :) Wish you luck", "score": 2, "replies": []}]}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Appreciate the content, don't appreciate the ad hominem attacks. Would approve this comment if edited (if I remain awake)", "score": 2, "replies": []}]}, {"body": "it’s funny how people think these kind of things matter", "score": 0, "replies": []}]}
{"title": "Article calls for a 90% drop in TSLA valuation. Thoughts?", "selftext": "", "id": "eoaqwd", "created_utc": 1578951194.0, "score": 0, "upvote_ratio": 0.27, "num_comments": 10, "comments": [{"body": "Very good comedy.", "score": 18, "replies": []}, {"body": "PLEASE drop the price so I can buy way more shares!!!!!!!!! Upvote plz K?!", "score": 11, "replies": []}, {"body": "I love when they use year over year USA deliveries to try to indicate low demand when there is exactly zero inventory available. They expanded to new markets and sold every single vehicle they made. If you want a Model 3 in the US, 2+ month wait currently. But somehow they think there is a US demand problem... \n\nTo use the lower US deliveries as a demand indication, there needs to be unsold product waiting around.", "score": 10, "replies": []}, {"body": "Definitely going to happen immediately.  I would believe everything you read as long as you only choose one source and only read one thing and then form your hypothesis.", "score": 7, "replies": []}, {"body": "I wish, then I could load up on more shares as it comes back up to it’s true value.", "score": 8, "replies": []}, {"body": "Fucking L O L.", "score": 6, "replies": []}, {"body": "Amateur investors still don't understand Telsa is not a car company.\n\nIt's an energy company.", "score": 11, "replies": [{"body": "It’s not just that it’s that market cap as a function of share price is a future focused indicator. People are investing in Tesla because of what they will think it will do in the future, not what’s been done in the past.\n\nSo comparisons with other autos just shows how much the market has no faith in the traditional companies.", "score": 6, "replies": []}]}, {"body": "OP, it feels like you have bought this account...", "score": 2, "replies": []}, {"body": "Rule 6 violation: link posts must use original title", "score": 1, "replies": []}]}
{"title": "TSLA going to the Moon", "selftext": "[removed]", "id": "eo5p5x", "created_utc": 1578929953.0, "score": 13, "upvote_ratio": 0.81, "num_comments": 9, "comments": [{"body": "Where’s the shitpost tag when you need it", "score": 11, "replies": [{"body": "Or the automod, trash this shit", "score": 3, "replies": []}]}, {"body": "Funny thing is this might not be so retarded", "score": 16, "replies": []}, {"body": "Calm the fuck down, lol.", "score": 4, "replies": []}, {"body": "Remember when you could actually afford TSLA options?", "score": 4, "replies": []}, {"body": "OP is soon to be BK", "score": 3, "replies": []}, {"body": "no thats spacex's job", "score": 2, "replies": []}, {"body": "Ban this fool if not $800 by  31Jan", "score": 2, "replies": []}, {"body": "Breaking - Tesla stock plummets due to massive recalls in China 🐻", "score": 1, "replies": []}]}
{"title": "PTON available shares and Short Interest Update", "selftext": "Sorry PTON hasn't been a rocket ship like TSLA or BYND. I thought it would have ridden the wave of high PE \"disruptor\" stocks up by now... Oh well. Here is today's data.\n\n&#x200B;\n\nFidelity: 0 shares available to short with a 13.5% borrow rate, up from 12.5% on Friday\n\nIB: 0 shares to lend (that's new...) with a 23.83% borrow rate as of 11am, up from 22% on Friday\n\nIntramonth short estimate is that 73.2% of the float is currently short\n\nGodspeed to all\n\n\nEdit: 33.9% rate as of 2pm\nEdit 2: 43.8% rate as of 2:55pm!", "id": "eo658g", "created_utc": 1578931894.0, "score": 18, "upvote_ratio": 0.89, "num_comments": 20, "comments": [{"body": "So what you’re saying is buy shares and lend them?", "score": 13, "replies": []}, {"body": "I’m in PTON til Feb 21st myself and no doubt it’s been a heartbreak since I got in, but I have a feeling the earnings report is gonna be YUGE.", "score": 6, "replies": [{"body": "Wait till earnings for puts?", "score": 1, "replies": []}]}, {"body": "u know u need good news to start a short squeeze right? i dont see pton coming out with shit anytime soon", "score": 8, "replies": [{"body": "With a float this low right now, not really. Funds are not just sitting back and watching their long positions evaporate. I would actively trade to protect it, if I had a large position in lock up or was short a few thousand puts, wouldn't you?", "score": 5, "replies": [{"body": "long funds wouldnt sell puts on a shit meme stock like this. and ur talking about the sunk cost fallacy of \"averaging down\". its shit. no ur ideas are garbage dont talk to me again", "score": -6, "replies": [{"body": "You must have lost alot of money on this, getting all butthurt. Unfortunately posting on Reditt won't help you there", "score": 6, "replies": [{"body": "ok dud bet u bought in at the top at 36", "score": 1, "replies": [{"body": "No I sell theta and Vol at least on this stock. I am not shorting it till near lockup expy after earnings.\n\nYea I dubble in an occasional FD in it too and lost a few bucks", "score": 3, "replies": []}]}]}]}]}, {"body": "Uh, earnings are due in a month.", "score": 1, "replies": [{"body": "yeah so itll bleed harder than a womans period for a month. theres better places to throw capital than in a slowly bleeding stock", "score": 1, "replies": [{"body": "Yeah I should have bought TSLA calls last week.  Or the week before.  Or the week before that", "score": 1, "replies": []}]}]}]}, {"body": "Calls it is", "score": 3, "replies": []}, {"body": "PTON isn’t a fucking disruptor\n\nPTON isn’t a $BECKY \n\nPTON is what every other exercise bike and overpriced tech stock that has nothing to offer, GARBAGE. \n\nYour squeeze happened months ago, it’s bear country now and if you’re smart you’d unload call contracts at whatever price you can get to stave off the bleeding before you literally have nothing", "score": 7, "replies": [{"body": "Chill, Winston", "score": 11, "replies": []}]}, {"body": "Any updates? Are you gonna do a new post?", "score": 2, "replies": []}, {"body": "Had nothing but pain trying to play this with small $. Gonna wait for an initial big move before trying it again. When a real squeeze takes hold, you have plenty of time to get on. No reason to bleed out while you wait for some news to kickstart it", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Funny how fast dudes have to cover", "score": 1, "replies": []}]}
{"title": "Supreme Court orders a seizure of local JPM assets", "selftext": "JPM puts lol https://in.reuters.com/article/india-court-jpmorgan/supreme-court-asks-enforcement-directorate-to-seize-local-assets-of-jpmorgan-report-idINKBN1ZC1RM", "id": "eo725w", "created_utc": 1578935787.0, "score": 17, "upvote_ratio": 0.8, "num_comments": 18, "comments": [{"body": "Its INDIA no one cares...", "score": 26, "replies": [{"body": "it’s funny how crazy India’s population is yet how meaningless they are to the rest of the world no racism", "score": 31, "replies": [{"body": "They've even got nukes and no one takes them serious", "score": 3, "replies": []}]}, {"body": "No one fucks with a super power and gets away with it", "score": 3, "replies": []}, {"body": "i think something bigger is going on... betting against JPM this year", "score": -7, "replies": [{"body": "It's local corruption bro... Sad to say it's commonplace in India.", "score": 11, "replies": []}, {"body": "I was just watching some CNBC \"expert\" talking about earnings and he said... I shit you negatory \"We're pretty positive on financial earnings, but our bar is pretty low.\" I got a laugh out of my morning crowd \"We're basically hoping for no indictments this earning season.\" \n\nI guess they'll miss. 😘", "score": 0, "replies": []}]}]}, {"body": "JPM's Indian Market is a rounding error compared to the work they do in Europe and the Americas I'd buy a put that isn't too far OTM unless you like getting raped by Theta Gang", "score": 12, "replies": [{"body": "forgot that everyone here likes to YOLO shit, i'm looking at a profit if JPM would just drop $5 in the next month. fingers crossed", "score": -10, "replies": []}]}, {"body": "I‘m buying calls", "score": 13, "replies": [{"body": "JPM only goes up", "score": 2, "replies": []}]}, {"body": "Very small percentage of their business. Citi basically owns asia", "score": 7, "replies": []}, {"body": "You're an idiot.", "score": 6, "replies": []}, {"body": "Damn this shit reads like BUY \nwhich upsets me really", "score": 6, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "oh fuck me", "score": 4, "replies": []}]}, {"body": "JPM has ad space on all three major networks. The silver scandal went unabated. Please don’t be this retarded.", "score": 1, "replies": [{"body": "bet", "score": 1, "replies": []}]}, {"body": "Buffet has shares!!", "score": 1, "replies": []}]}
{"title": "LEN, BAC, WFC to the moon this week", "selftext": "[removed]", "id": "eo76as", "created_utc": 1578936262.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 16, "comments": [{"body": "I dunno about that scooby. Might just watch from the sidelines.", "score": 3, "replies": [{"body": "Get in while it's cheap. This post will age well.", "score": 1, "replies": []}]}, {"body": "This play is too retarded for my taste. Like, if I really needed the money this week for meth maybe.", "score": 2, "replies": [{"body": "Think of all the meth you can buy after you bought calls on 37 1/17 BAC for .05.", "score": 1, "replies": []}]}, {"body": "So you think jpm going up to then?", "score": 2, "replies": [{"body": "Nope.", "score": 1, "replies": [{"body": "Rip", "score": 2, "replies": [{"body": "Just wait.", "score": 1, "replies": [{"body": "Sold at 7am est today for profit", "score": 1, "replies": [{"body": "Let’s go", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I got BAC Jan 31 $37 for .21 already up a little", "score": 1, "replies": [{"body": "Sell 5 minutes after open.", "score": 1, "replies": [{"body": "On the 15th?", "score": 1, "replies": [{"body": "Yes", "score": 1, "replies": []}]}]}]}, {"body": "You son of a bitch I’m in, BAC to the moon", "score": 1, "replies": [{"body": "Let's gooooo", "score": 1, "replies": []}]}]}
{"title": "50 dollar call AMD 02/28", "selftext": "[removed]", "id": "eo7f3e", "created_utc": 1578937297.0, "score": 9, "upvote_ratio": 0.8, "num_comments": 9, "comments": [{"body": "stonks only up, so yolo everything", "score": 13, "replies": []}, {"body": "Reasonable bet. You should do fine. Check the stock once a day or more in case there are any massive swings in the price. \n\nAMD is releasing there earnings end of this month, if they have high earnings, then the stock should rise. If that happens, you'll be well above $50 and you could sell, or hold for potentially high gains closer to your expiration date.", "score": 6, "replies": [{"body": "So, if I buy say 55 dollar calls on the same day, I'll make more money if amd hits 55 by then ?", "score": 3, "replies": [{"body": "it will actually have to go a bit above 55 because you need to also cover the price (premium) of the option", "score": 6, "replies": []}, {"body": "Check the options as you read this.\n\nA higher price of AMD costs less because there is a lesser chance of the stock reaching that price.\n\nA $50 call is more likely to be worth something, so it costs more. This extra cost has to be accounted for. It's called a premium. \n\nA $55 call is less likely, so the premium is smaller. You could buy more $55 calls with the same amount of money, and then, if it did hit $55 (or, in reality, a little bit more than $55 to cover the premium).\n\nIt's all about risk. How much risk do you want?", "score": 1, "replies": []}]}]}, {"body": "You'll do better than me. I have way too many 54 2/24 calls", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "This.  I had a $95 BLUE that was up bigly that I lost track of and let get theta raped", "score": 5, "replies": [{"body": "Theta Gang Raped", "score": 4, "replies": []}]}]}, {"body": "You can buy one Tesla share and make money faster than the amd", "score": 2, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "eo7h5m", "created_utc": 1578937541.0, "score": 31, "upvote_ratio": 0.92, "num_comments": 15, "comments": [{"body": "Just hire [this guy](https://keyassets.timeincuk.net/inspirewp/live/wp-content/uploads/sites/2/2013/01/rev_jan5_2013_Forstermann_3.jpg) as the spokesman and we're good to go", "score": 18, "replies": [{"body": "Shaved legs that’s gay. Who’s the chick?", "score": 3, "replies": [{"body": "Becky", "score": 7, "replies": [{"body": "Got her number?", "score": 2, "replies": []}]}]}]}, {"body": "TSLA will buy America\n\nUnited States of Tesla", "score": 13, "replies": []}, {"body": "Just when you think this place can't get any lower...", "score": 5, "replies": []}, {"body": "kWh is a term for overall energy and not instantaneous energy as you imply.", "score": 5, "replies": [{"body": "go away voice of reason", "score": 9, "replies": []}]}, {"body": "lol i'm starting to realize i'm a retard for getting in on the PTON short squeeze ride with all you retarded fucks", "score": 5, "replies": []}, {"body": "Peloton puts bruh", "score": 4, "replies": []}, {"body": "Fuck. Power your Tsla charging station with your PTON.", "score": 3, "replies": []}, {"body": "Have you seen their fitness models though?", "score": 1, "replies": []}, {"body": "What about FB?\n\nThey lost out on Fitbit and want your data.", "score": 1, "replies": []}, {"body": "Haha I almost shit myself having bought both Tesla and pton puts today. I mean I’m currently shitting myself but I almost started vomiting and burping at the same time too", "score": 1, "replies": [{"body": "multitasking is the spirit of this post", "score": 1, "replies": []}]}]}
{"title": "new short candidate: T", "selftext": "I am still invested in NFLX, PFE, and USO.  USO isn't looking too hot now, but I think it is at a very important area that will determine its trajectory for the medium term.\n\nIf you want to look at a stock that is very sensitive to rate rises, look at T.  It has a chart that was strong vs other stocks and major indicies BUT is now weak and getting weaker vs these same stocks.  T even got overbought against precious metals and both those assets are rate sensitive.  I plan to be looking to add to my short position in T in the coming weeks.  I posted about T possibly being a short candidate a few weeks ago, but now I see confirmation of the short trade.", "id": "eo81gm", "created_utc": 1578940025.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 16, "comments": [{"body": "Short? T is a stonk. I don't understand.", "score": 9, "replies": [{"body": "OP is too scared to play options?", "score": 2, "replies": [{"body": "Playing options means I have to incorporate time decay into my calculations for potential profit.", "score": 3, "replies": [{"body": "Theta is your friend.", "score": 1, "replies": [{"body": "Please explain", "score": 1, "replies": [{"body": "The value of an option is made of two parts, the intrinsic value of the underlying security and the extrinsic value of volatility and time. When you write a call option you get to watch that time value drop into your pocket. OP is complaining about having to calculate his getting free money.", "score": 2, "replies": [{"body": "I’m used to buying calls not writing covered ones. So you’re saying that when you write covered calls theta works the other way and makes you money?", "score": 1, "replies": [{"body": "Yes. Hence theta gang. They just write options, collect premium, and work in a cycle.", "score": 2, "replies": [{"body": "Is it possible to do that with like $800?", "score": 1, "replies": [{"body": "Not really. You need to be able to risk assignment and have the capital to soak 100 shares of a stock.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "BAC is a good long candidate right here.  Bank of America looks like it is benefitting from the rate rise.", "score": 2, "replies": []}, {"body": "Is your whole short thesis just \"What if rates rise lol\"??? Which, by the way, would fuck the entire market not just $T.   \n\n\nIn case you want to read an actual investment thesis and stop loosing money for once.  \n\n\n[https://activatingatt.com/wp-content/uploads/2019/09/Elliotts-Letter-to-ATT\\_09092019.pdf](https://activatingatt.com/wp-content/uploads/2019/09/Elliotts-Letter-to-ATT_09092019.pdf)", "score": 2, "replies": []}, {"body": "Lol this is going to age like fine wine in a matter of one week", "score": 1, "replies": []}, {"body": "Did you factor in that only $T and $VZ have the only real domestic 5G networks and, don’t @ me but, $T’s network is the most fleshed out? \n\n^nohomo", "score": 1, "replies": [{"body": "Did you know that 15 minutes could save you 15% on your car insurance?\n\nYou sound like that gecko", "score": 1, "replies": [{"body": "Weird flex, but ok... \n\nᕦ(ò_óˇ)ᕤ", "score": 1, "replies": []}]}]}]}
{"title": "Success by selling volatility?", "selftext": "Has anyone had success by selling volatility. Essentially buying calls for a popular stock 3 weeks before earnings and then just selling the calls at a massive premium just before earnings? Because right now I bought some SBUX calls and they have gained 250% over the last month, despite only a $2 move up in that time.", "id": "eo8717", "created_utc": 1578940689.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 11, "comments": [{"body": "[deleted]", "score": 28, "replies": [{"body": "I get the joke but Theta Gang stays out of high IV because theta gets fucked by delta. They don't want to play earnings. They just keep churning premium on either side.", "score": 5, "replies": [{"body": "It's not that you're buying options with high IV in this case. You're buying regular options, and holding them as the IV increases moving towards a catalyst event, which pumps up their value even if the underlying stays the same.", "score": 3, "replies": [{"body": "Yeah. Theta gang rides theta selling options. You can’t ride theta if delta is making the price go back up.", "score": 1, "replies": []}]}]}, {"body": "THETA GANG!!!! 🐌🐌🐌", "score": 4, "replies": []}]}, {"body": "Make sure to sell before earnings don't just YOLO it back down the volatlity curve afterwards because it will lose money. You can also sell a short butterfly 7-10 DTE and ride it as it swings out of the strike. Less profit than buying  YOLO calls but risk can be managed and you can find positive EV in there somewhere.", "score": 3, "replies": []}, {"body": "Vega gang.", "score": 2, "replies": [{"body": "you'd need a shit ton of money to delta/gamma hedge and minimize theta while you're at it with options", "score": 1, "replies": []}]}, {"body": "It's also easy to lose a shit load of money doing that...", "score": 2, "replies": [{"body": "Okay. So what’s the chance of winning and losing? Because if you don’t know, you’re not ready to sell.", "score": 1, "replies": [{"body": "Not sure what you are trying to say but my issue always seems to be holding a little too long, just accept the 20-50% and don't ask for more. \n\nOr jumping in too late that's fun too.....", "score": 1, "replies": []}]}]}]}
{"title": "AMZN is ripe for a rally", "selftext": "[removed]", "id": "eo9896", "created_utc": 1578945129.0, "score": 9, "upvote_ratio": 1.0, "num_comments": 14, "comments": [{"body": "[deleted]", "score": 14, "replies": [{"body": "What more so you need? He said calls!", "score": 1, "replies": []}, {"body": "If you want to see for yourself, track the ratio of AMZN:SPY.  It's basically AMZN vs the S&P 500.  The ratio is fixing to turn up.  This is very bullish for any stock because this means smart money is accumulating this stock and selling S&P 500 futures or etfs as a hedge.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Check out T if you want something that is fixing to go down.  Not everything goes up.  We are looking at an economic boom in 2020 that will bring rates way up.  XLU is about to go down too.  T has a ton a debt and is a big dividend payer, so any rate rise disproportionately affects T more than any other telecom stock.", "score": 1, "replies": []}]}, {"body": "I received an Amazon package today, and so did my neighbor. Calls", "score": 3, "replies": []}, {"body": "Got fucked last week by Amazon, not falling for the same bullshit again", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I was the one who sold puts though 😂", "score": 1, "replies": []}]}]}, {"body": "fake news. all i have to say", "score": 1, "replies": []}, {"body": "It hasn’t been participating in this latest rally, may need a killer earnings to get out of the mud. Anything less it’ll either sell of or stay sideways.", "score": 1, "replies": []}, {"body": "My 1/24 call is praying. Was up over a K on it at one point, and now I'm negative. :')", "score": 1, "replies": [{"body": "Earnings are on the 30th.  I think you might need to extend those calls out if you want to play this trade.  This is why I don't play options.  I used to, but it just got too stressful thinking about time decay.", "score": 1, "replies": [{"body": "Agreed. Theta just kicked my ass. I was hoping for an ER runup a week or two prior, but alas. I might buy an April 2100 call but the premium is a lot for me, but yolo fr I think I’m gonna do it", "score": 1, "replies": []}]}]}, {"body": "Literally everyone in my Christmas gift exchange got amazon gift cards this year. Calls.", "score": 1, "replies": []}, {"body": "I just looked at AMZN more closely.  It's on the verge of a spike.  I just established a small position today.  I will add in the coming days on any mini dips.", "score": 1, "replies": []}, {"body": "Isn't AMZN owned by theta gang?", "score": 1, "replies": []}]}
{"title": "So... where the hell does Tesla stop??", "selftext": "[removed]", "id": "eo9qrf", "created_utc": 1578947185.0, "score": 13, "upvote_ratio": 0.93, "num_comments": 14, "comments": [{"body": "It doesn’t stop.", "score": 12, "replies": []}, {"body": "Mars", "score": 11, "replies": []}, {"body": "Tesla is space", "score": 2, "replies": []}, {"body": "When Elon calls some random dude a pedo.", "score": 2, "replies": []}, {"body": "$690 by 4/20", "score": 2, "replies": []}, {"body": "When we run out of electricity. Or adopt hydrogen technology.", "score": 1, "replies": []}, {"body": "Bears are out of energy", "score": 1, "replies": []}, {"body": "Looks like institutional investors are really jumping on board now. They must know something", "score": 1, "replies": [{"body": "That they are going to post profit q4 and get added to the S&P by feb. $600 eom", "score": 1, "replies": []}]}, {"body": "7000", "score": 1, "replies": []}, {"body": "Tesla 1000.00", "score": 1, "replies": []}, {"body": "When those stubborn gamblers like Chanos and Einhorn capitulate\n\nDamn fools", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Pls hold out for the rest of us 🙏", "score": 1, "replies": []}]}, {"body": "I feel so stupid buying put credit spreads instead of calls but I feel like me not doing that makes it run higher", "score": 1, "replies": []}]}
{"title": "Why Do People Make Movies?", "selftext": "I saw this post ( [https://www.reddit.com/r/movies/comments/eo00jp/dolittle\\_seems\\_destined\\_to\\_flop/](https://www.reddit.com/r/movies/comments/eo00jp/dolittle_seems_destined_to_flop/) ) say something like Dolittle the new movie needs $438 million to not lose money. Ultimately, the financiers of these movies are looking for a solid ROI and 9/10 times that's their highest priority (I say 9/10 times bc I remember Bladerunner 2049 was more of a passion project).\n\nThey could have just bought TSLA and even if they timed the market like shit they'd have $600 million already, and $1b by next month before the movie is even done in theaters. What a joke lol\n\nThe movie market is going to crash when these dudes and gals figure this out", "id": "eoa5ni", "created_utc": 1578948826.0, "score": 27, "upvote_ratio": 0.92, "num_comments": 14, "comments": [{"body": "you fund movies so you can rail out famous people", "score": 22, "replies": [{"body": "Hardy har Harvey over here", "score": 4, "replies": []}]}, {"body": "Yeh but paranormal activity cost like $500k to make and returned 88million.", "score": 13, "replies": [{"body": "Not a huge fan of scary movies personally", "score": 4, "replies": [{"body": "I’ll upvote you cuz some penis downvoted you", "score": -8, "replies": [{"body": "sorry bro ty for taking the loss here", "score": 6, "replies": []}]}]}]}, {"body": "Because when it comes to art there’s more than profit involved u autist", "score": 11, "replies": [{"body": "Thank you for saying this. Art for fucks sake.", "score": 1, "replies": []}, {"body": "That's why I brought up Bladerunner 2049 idiot", "score": -2, "replies": [{"body": "What’s the difference,? If anything, Dolittle is far more masterful and easily worth doing as a passion project over blade runner.", "score": -8, "replies": []}]}]}, {"body": "You can't look at movies in isolation. Firms who produce movies look at movies as a portfolio. They don't know which ones will do well and which ones will tank (although they can guess), so they have a bunch of them and overall they expect an acceptable ROI.", "score": 2, "replies": []}, {"body": "it's for money laundering", "score": 2, "replies": []}, {"body": "Cause a movie can make much money in the long run, only first copy costs and you can sell it till the end of all time", "score": 1, "replies": [{"body": "Stocks always go up too", "score": 2, "replies": []}]}]}
{"title": "SPY 4,000, no recession until atleast 2020", "selftext": "[http://dennisgartman.blogspot.com/2019/08/there-will-be-recession-probably.html?utm\\_source=dlvr&utm\\_medium=twitter](http://dennisgartman.blogspot.com/2019/08/there-will-be-recession-probably.html?utm_source=dlvr&utm_medium=twitter)\n\nRIP bears\n\n&#x200B;\n\n\\*edit\\* after 2020.", "id": "eobja0", "created_utc": 1578954378.0, "score": 36, "upvote_ratio": 0.81, "num_comments": 18, "comments": [{"body": "This is not the stupidest thing posted in this sub today", "score": 63, "replies": []}, {"body": "bro it is 2020", "score": 44, "replies": [{"body": "RIP", "score": 10, "replies": []}, {"body": "yes but is it atleast 2020? *taps on head*", "score": 9, "replies": []}, {"body": "Shocked pikachu", "score": 2, "replies": []}]}, {"body": "Shit. I held overnight.", "score": 13, "replies": [{"body": "The Flash recession is gonna getchu", "score": 8, "replies": []}]}, {"body": "Late 2020?", "score": 3, "replies": []}, {"body": "this guy says no recession this year.\nhttps://am.jpmorgan.com/us/en/asset-management/gim/adv/insights/guide-to-the-markets", "score": 3, "replies": []}, {"body": "I bet there will be a recession some time in the near to late future. You can @ me", "score": 3, "replies": [{"body": "50% chance.", "score": 5, "replies": []}]}, {"body": "No recession (probably).\n\nRecession in 2022 (maybe).\n\nRecession someday.", "score": 2, "replies": []}, {"body": "Some dude has a blog so he must be right!!!!", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Logic right there", "score": 2, "replies": []}, {"body": "How you have money left over? I'm always wondering this.", "score": 1, "replies": []}]}, {"body": "Gartman is the ultimate contrarian indicator.", "score": 2, "replies": []}, {"body": "There’s a recession in this guys brain matter", "score": 1, "replies": []}, {"body": "2022 or later when the autonomous tech takes out a lot of the jobs right now.", "score": 1, "replies": []}]}
{"title": "masturbating to arab porn", "selftext": "you know that one with the refugee chick and the dude with the huge dick. Ive got it on repeat and im on the 14th one and I just keep getting harder but thats because  Im edging while jelqing and working out my kegles and I have the volume on 100% and just connected to my neighbors bluetooth speaker.  It helps me to escape from the fact that I bought all those spy and tesla puts today.  like 50% of my account. which is like fuck.\n\n&#x200B;\n\nEDIT: [Total account value](https://imgur.com/LhlLETN)\n\n[SPY puts](https://imgur.com/nxdfIxR)\n\n[TSLA PUTS](https://imgur.com/p1lmgnW)\n\n[The day I discovered wallstreet bets](https://imgur.com/BuNkKrd)", "id": "eocn7j", "created_utc": 1578959199.0, "score": 7, "upvote_ratio": 0.64, "num_comments": 15, "comments": [{"body": "Why the hell are people still buying Tesla puts", "score": 16, "replies": [{"body": "[deleted]", "score": 11, "replies": []}, {"body": "Same reason they buying AAPL puts. LOL", "score": 3, "replies": [{"body": "Lmao I have my entire portfolio in aapl puts", "score": 5, "replies": []}]}]}, {"body": "okay.... post your position.... and the link.", "score": 12, "replies": [{"body": "added in an edit", "score": 3, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Link on imgur or similar site.", "score": 1, "replies": []}]}]}, {"body": "Why would you be puts WHEN IT'S EARNINGS MONTH", "score": 7, "replies": [{"body": "🤷🏼‍♂️", "score": 6, "replies": [{"body": "Good answer!!! Good answer!", "score": 3, "replies": []}]}]}, {"body": "Weak, come back when you’ve lost more than 10k", "score": 3, "replies": [{"body": "K brb", "score": 3, "replies": []}]}, {"body": "You should’ve hedged your Tesla bet buy buying more Tesla. Lol", "score": 3, "replies": [{"body": "Correct", "score": 4, "replies": []}]}, {"body": "TSLA bulls unite", "score": 1, "replies": []}]}
{"title": "$NK", "selftext": "Massive potential with this stock, also, it has the initials of North Korea. Coincidence? I'll let you be the judge of that.\n\nThis biotech stock doubled in less than a day. Question is: will it rise tomorrow or crash? \n\nThoughts?", "id": "eocqfg", "created_utc": 1578959583.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 9, "comments": [{"body": "Yes.", "score": 12, "replies": [{"body": "Counterpoint: No.", "score": 9, "replies": [{"body": "Valid point", "score": 6, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Time to buy a strangle", "score": 3, "replies": [{"body": "I've been legging into strangles recently. Moves are extreme and it's not difficult to find BIG winners.", "score": 3, "replies": [{"body": "Especially biotech. Those stocks haul ass (for better or for worse)", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Yes.", "score": 6, "replies": []}, {"body": "I'm getting mid 2020 calls and then forget about it.", "score": 3, "replies": []}, {"body": "short it?", "score": 1, "replies": []}]}
