{"title": "Can NIO inc. growth like Tesla?", "selftext": "What is the feeling about NIO Inc.? The Chinese EV maker, can be a good investment like Tesla?", "id": "173xogp", "created_utc": 1696872654.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 118, "comments": [{"body": "No.", "score": 104, "replies": [{"body": "NiO", "score": 25, "replies": []}, {"body": "At 8 dollars USD is still a good buy for long term, this risk is definitely worth taking compared to its peers", "score": 1, "replies": []}]}, {"body": "I lost my shirt waiting 3 years- took the loss. So it prob will", "score": 12, "replies": []}, {"body": "Aren’t they backed by the Chinese Government? That fact creates lots of uncertainty for investors", "score": 22, "replies": [{"body": "Thats what has been going around. I have no idea but its chinese and I stay far away from that ❤️", "score": 14, "replies": [{"body": "I agree. Well said.", "score": 2, "replies": []}, {"body": "Idk how backed they are but they were given 1b around 2020 by the Chinese gvt", "score": 1, "replies": []}]}]}, {"body": "Yes but it can never reach the insane valuations.", "score": 14, "replies": []}, {"body": "I think it can but in the longggg longgg term, like years from now.", "score": 5, "replies": [{"body": "Yes, same feeling. But now the price is very attractive", "score": 1, "replies": [{"body": "Let it go below the 8, that will be a interesting price, it always was.\nA lot of insider sold their position since the 13$/14$, With that situation in China they would catch the cheapest price to come back. I’m holding a 10.2.\nI will buy again at least at 7.7$\n\n(You already know I’m losing money on this so please don’t take this as advice, but as a living room brainstorming)", "score": 6, "replies": [{"body": "I think that some rebound can happen, i hope the title can reaches again 13/14$", "score": 3, "replies": [{"body": "I do too actually, not only cause of the money but I do really think their swap batteries, stations and stuff are actually a good idea for the progress…\nAt least, for the information that we have, it’s always China, never forget.\n🤷🏽‍♂️", "score": 4, "replies": []}]}]}, {"body": "Yes, but it seems stuck there for a long time so I don't know what to think...", "score": 7, "replies": [{"body": "Too many troubles in china market I guess", "score": 4, "replies": [{"body": "Yeah..", "score": 2, "replies": []}]}]}]}]}, {"body": "As an owner of this stuck the Nio idea was good. What isn’t good is China. I believe if they were not a Chinese company they would do well but I learnt to be extra careful with Chinese companies", "score": 5, "replies": [{"body": "Thanks very useful insight", "score": 2, "replies": []}]}, {"body": "The fact everyone is saying no, my experience has been the majority is always wrong so looking like a yes lmao", "score": 16, "replies": [{"body": "Good motivation", "score": 6, "replies": []}, {"body": "Being a contrarian doesn’t work 100% the time. Buy it under $5 but tbh Chinese companies are not trust at all no matter who good they seem. I bought at $18 rode it to $55 and try swing trading it and was burnt on a contrarian take like yourself. Cut the BS outlook and just avoid it till it’s pretty low", "score": 3, "replies": [{"body": "I’m in since $4 I’m good thanks tho", "score": 2, "replies": [{"body": "Congratulations on the round trip 🥳", "score": 1, "replies": [{"body": "LETS GO ONE MORE ROUND BOYYYYS", "score": 2, "replies": []}]}]}]}]}, {"body": "It would take a radical shift in Chinese policy, so much so as to be unrealistic even in these crazy times. That said, NIO seems to be positioned for a period of rapid growth, especially if China consolidates/further subsidizes the EV market in NIO's favor. \n\n\nCould it match Tesla? That's a pipe dream. Could it replicate 1/5th of Tesla's success and still be one of the best opportunities out there currently? Still unlikely, but at least plausible. \n\n\nI used to sell covered calls on my shares. I think the potential for sudden growth is better than the meager premiums collected. I remain neutral to slightly bullish if for no other reason than there seems to be more upside potential than downside risk left. It would be too much an embarrassment for the National Party to let NIO fail, and it isn't like there is much else in China that seems particularly attractive for growth investors currently.", "score": 4, "replies": []}, {"body": "Rivian$", "score": 3, "replies": []}, {"body": "Grow their business like Tesla? Nobody can. \n\nTesla isn’t just a car company, they have the biggest TAM on the stock market.", "score": 13, "replies": []}, {"body": "Idk if they may grow like Tesla. But currently China is facing domestic issue, youth unemployment rates, slowdown in economy etc. Moreover, there are a lot of other great EV automaker in China such as XPENG.  So I don't think they may be able to grow like Tesla.", "score": 11, "replies": [{"body": "But NIO is the only EV manufacturer that builds it's EVs fully rechargeable AND swappable. Seen some videos of people fighting over charging stations during the Chinese holiday over the weekend. I think NIO can make lots of money by just allowing other companies to use their tech.", "score": 5, "replies": []}, {"body": "After Byd and xpeng, with the last one can be acquired by VW, in my view nio can be the 2 Chinese carmakers", "score": -2, "replies": [{"body": "Xpeng can be acquired VW? Not sure where you get your information, but they just have a Strategic cooperation where VW invested 750M for a 5% stake in the company.. no merger or acquisition plans there…(yet)…", "score": 4, "replies": [{"body": "Xpeng can be acquired by Vw, just possible speculation, Vw is having the worst sells period in china and if china increase an isolationist policy, this kind of merge can be the only way to maintain sells inside china", "score": -2, "replies": [{"body": "We get it you watched the CNBC video on YouTube", "score": 3, "replies": [{"body": "Could you share?", "score": 2, "replies": []}]}, {"body": "Possible speculation???? Can u give me one instance in history that a Chinese company (I.e 50% state owned) merged with another non Chinese company?  If u can find one, China still would have wanted 50% of the company.  So r u speculating that VW will offer to buy majority of the open market shares and some from the managers?", "score": 3, "replies": [{"body": "So why investing without any possible future opps?", "score": -4, "replies": [{"body": "They gain by:\n- having a strategic partner on the Chinese market, to sell cars\n- access to Chinese tech on autonome driving, which is in a further stage the EU tech\n- they will build at least 2 car models together, which gives both parties certain know how advantages etc. \n-…\n\nGot to do more reading and learning mate", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Can they? Yes. Will they? Outlook negative.", "score": 3, "replies": [{"body": "I mean not in short term", "score": 2, "replies": []}]}, {"body": "Is BRCC a good investment? Compared against peer BROS, BRCC should be 4x from where it is trading today.", "score": 3, "replies": []}, {"body": "Man I hope so.", "score": 3, "replies": []}, {"body": "You are 3 years too late. Nio ran up like crazy during the 2020 bubble.\n\nAfter the Chinese tech crackdown, investors are staying away from Chinese stocks in general regardless of their individual performance.", "score": 3, "replies": []}, {"body": "In my NIO BagHolders dreams.", "score": 3, "replies": []}, {"body": "They will never add NIO to the S&P 500 ….. so mostly no", "score": 3, "replies": []}, {"body": "Highly unlikely.  If I buy any I can tell you definitely not", "score": 3, "replies": []}, {"body": "Nio makes really really good cars. But as a new company they have been hit very hard by COVID and the war in Ukraine. Inflation absolutely devastated their margins. But I believe during these harsh economic conditions they can weather the storm and do well. In my opinion other ev companies going to zero except Tesla, nio and xpeng. I think rivian can survive but lucid is gonna have an extremely tough time. We all know Nikola, lordstown motors going out of business. I'm not sure if Honda Toyota nissan will survive. I'm not sure even ford and GM can't survive. I think Volkswagen, BMW, and Benz will survive.", "score": 3, "replies": []}, {"body": "No.\n\nSource: I live in China and work in the auto industry. \n\nLook at BYD, Li Auto, or Geely", "score": 3, "replies": []}, {"body": "The way they want to recharge their vehicles alone sets them back too much to consider this. Take the profits off this quick pop and watch it Melt to a dollar", "score": 3, "replies": []}, {"body": "NIO just reached their 30 million battery swap. There is definitely a moat there. Nobody can grow like Tesla because Tesla has a CEO that has a cult following and knows how to hype up their products.", "score": 2, "replies": []}, {"body": "The question you are asking is not related to the picture, unfortunately😂. You would have to perform a fundamental analysis of the company in order to determine if it is significantly undervalued or not. (In my opinion) You maybe should also remember that stocks are actual companies.", "score": 2, "replies": []}, {"body": "Yess lets gooo", "score": 3, "replies": []}, {"body": "Hahahaha, ur serious?", "score": 5, "replies": [{"body": "The reference to Tesla it’s just an example, to get the idea, which is your target price?", "score": -2, "replies": [{"body": "I think it has a decent chance. I like their cars better than Tesla. Their body shop is 97% automated cutting down on expenses.", "score": 6, "replies": [{"body": "My doubts are related to China situation. China is plenty of Ev makers, byd for sure is the market leader, but Nio can become a market giant or will disappear", "score": 0, "replies": []}]}]}]}, {"body": "Fuck no", "score": 3, "replies": [{"body": "Why not?", "score": 0, "replies": [{"body": "Because I hold it", "score": 8, "replies": [{"body": "🥲 same", "score": 5, "replies": []}]}]}]}, {"body": "Resistance is building even in Europe against Chinese ev - its a bad bet", "score": 2, "replies": []}, {"body": "The post make me Bearish on NIO, the comments make me Bullish", "score": 3, "replies": [{"body": "Big confusion, i’ll say bullish can be an opportunity", "score": 1, "replies": []}]}, {"body": "There are more than 90 brands of EV in China.  Even Tesla might not survive the competition.", "score": 1, "replies": []}, {"body": "No, never trust chinese companies", "score": 1, "replies": []}, {"body": "As a recommendation. If you want something like Tesla, better invest on Tesla directly. Most of ev companies are not worth the risk", "score": 1, "replies": []}, {"body": "[I read a article that told me to sell](https://www.vectorvest.com/blog/hot-stocks/nio-falls-3percent-despite-75percent-increase-in-3q-deliveries/)", "score": 1, "replies": []}, {"body": "Not remotely close due to too many reasons I will not list, as I am not looking to write a full book right now.", "score": 1, "replies": []}, {"body": "I read an article recently stating they had 600m in revenue and the CEO gets paid 325m - no thanks.", "score": 1, "replies": [{"body": "actually their revenue last QUARTER alone, was $1.21 billion. maybe you're mistaking for lucid?", "score": 3, "replies": [{"body": "Maybe so. Does what I said make sense for Lucid lol", "score": 1, "replies": [{"body": "lol not sure about their revs, but CEO pay checks out. I think Elon called him out for it recently", "score": 1, "replies": []}]}]}]}, {"body": "No way in hell. I'm not even sure how this is an honest question. \n\nYou need research before you put your money in anything, period.", "score": 0, "replies": [{"body": "I did some research and reading analysts comments but I’m still doubtful about the future of nio", "score": 4, "replies": [{"body": "As you should be. Tesla makes more profit in China sales than all other Chinese EV makers combined, literally. Including BYD", "score": 1, "replies": [{"body": "Not anymore, byd is surpassing tesla", "score": 0, "replies": [{"body": "Not sure where that falsehood came from, but if you are going to claim BYD \"surpassing\" Tesla in any way, you need to be clear that they will make more cars in China than Tesla does, because its literally their own market and they are not sold in places like the US were Tesla has 60% of the market share etc. or in Europe where Tesla again is crushing everyone.  \n\nSo yes, in China they will put more EVs into the market, but they still are not even close to matching Tesla's profits in China.\n\nAs I pointed out, ALL Chinese makers combined still do not make as much profit in China as Tesla makes in China, alone. \n\nBYD will turn out to be fine, and there is more than enough market share to go around globally. EVs are the future", "score": 1, "replies": []}]}]}]}]}, {"body": "It already is better. At the moment the stock price is being manipulated for a foreign company.", "score": 0, "replies": []}, {"body": "NiHao to NO", "score": 0, "replies": []}, {"body": "No, you fucking idiot.", "score": 0, "replies": []}, {"body": "Can dumbass poster grammar like idiot?", "score": -2, "replies": []}, {"body": "If they stop to lose 30k for each car they sell: YES", "score": 1, "replies": [{"body": "They should focus on Gross margin", "score": 2, "replies": []}]}, {"body": "Nope. Buy leap puts", "score": 1, "replies": []}, {"body": "Perhaps, but first they actually have to make a profit lmao", "score": 1, "replies": []}, {"body": "Not to hate bust is 5 posts about nio really necessary? How much money did you put in", "score": 1, "replies": [{"body": "Honestly, I don’t have any open position on it", "score": 1, "replies": []}]}, {"body": "They grow like RadioShack and circuit city", "score": 1, "replies": []}, {"body": "Name says itself...N O", "score": 1, "replies": []}, {"body": "No. They’re a car maker. Tesla is much more.", "score": 1, "replies": []}, {"body": "Nihao", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "Is this a joke?", "score": 1, "replies": []}, {"body": "Chinese government can make it look like a good investment anytime they want", "score": 1, "replies": []}, {"body": "Money is leaving china like there is a genocide about to happen idk man", "score": 1, "replies": []}, {"body": "I bought nio at like 7 sold at 30s then bought fisker now down like 50% 💀 nio flew days after I bought it because Chinese gvt gave 1b to nio a long time ago", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "hella no… everyone is delusional if they still think the EV market has any potential… Tesla has it’s valuations of its hype and overall units sold per quarter unlike other EV brands\n\nI’m not a fan of Elon but if we’re being realistic there’s no car company like Tesla… it just differentiates in so many manors to other regural brand cars", "score": 1, "replies": []}, {"body": "Had it at $5 and after 1 year of waiting sold it back for $5. Two weeks after it went up to $65! Fml! Could have had 180k", "score": 1, "replies": [{"body": "Oh my god 😱", "score": 1, "replies": []}]}, {"body": "No", "score": 1, "replies": []}, {"body": "Nio. I lucked out back when I had it at $3 and sold them at $15, then they climbed to $60s. Oh well I bought back in at $30 and now regretting it.", "score": 1, "replies": [{"body": "Good move for the first sell…30$ is very high price", "score": 1, "replies": []}]}, {"body": "Never in life", "score": 1, "replies": []}, {"body": "Unlikely", "score": 1, "replies": []}]}
{"title": "Tesla Cybertruck Off-road Capabilities", "selftext": "I saw this video showing Cybertrucks going off-road on the Baja 1000 rally route. I don't know much about off-roading, but a quick search says that the Baja 1000 rally is one of the most prestigious off-road races in the world. It seems quite impressive for Tesla's first truck. As a side note and correct me if I'm wrong, if Cybertruck is used as a work truck for business, wouldn't a business owner be able to write it off 100% as an expense as long as it met a specific weight requirement?\n\n\nhttps://www.foxbusiness.com/markets/elon-musk-teslas-offroad-cybertruck-test-live-baja", "id": "1740hqd", "created_utc": 1696879351.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 95, "comments": [{"body": "If you want to write off the truck 100%, then you can only use it for work. If you use it for your business AND for personal use, you can only deduct the percentage used for business. There are a lot of people getting tax advice from TikTok who will be in deep shit if the IRS ever gets the capacity to actually do audits.", "score": 160, "replies": [{"body": "Actually to qualify for section 179 (the tax rule that allows the full deduction in a single tax year rather than depreciation over multiple years) you must use the vehicle for work 51% of the time or more. There are some weight requirements though, that we wont know for sure about until launch,  it seems likely the Cyber Truck should qualify.", "score": 13, "replies": [{"body": "The Section 179 tax loophole is one of many reasons I despise Ford, GM, Chrysler, the UAW, and politicians in both parties.", "score": 4, "replies": []}]}, {"body": "I’m always working so this works 🤣", "score": 2, "replies": []}, {"body": "Don’t worry our politicians will make sure IRS never gets properly funded", "score": -1, "replies": []}, {"body": "Republicans will make sure they never do", "score": -8, "replies": []}]}, {"body": "What is impressive about finishing the race to you? People routinely enter and finish in Volkswagen beetles and all types of cars/trucks/buggies/vehicles. Iirc, people have done it in things like stock Lexus RX350s.", "score": 168, "replies": [{"body": "Just another fanboy pushing their agenda 💼", "score": 71, "replies": [{"body": "It's like the jeeps that were winched through the Rubicon...", "score": 2, "replies": []}]}, {"body": "You have to be joking right? Class 11 (vw) have to be some of the baddest mother fuckers out there… they raced for 40hrs at the last 1000 and come out pissing blood… there is no way this cybercuck is getting through 5-10% of this course without dying. And fyi - those class 11 have the best shocks the class allows within the rules..", "score": 3, "replies": [{"body": "There are 7 whole minutes of Cybertruck at Baja. It apparently annihilated Baja 1000.", "score": 4, "replies": []}]}]}, {"body": "Impressive? Come on, people did in in VW beetles", "score": 107, "replies": [{"body": "Yea that's a gravel road. Not off road...", "score": 18, "replies": [{"body": "Literally the road to our favorite hiking spot is bumpier than this", "score": 6, "replies": []}]}, {"body": "As an owner to an early 60s beetle, I take offense to this comment.", "score": 10, "replies": []}]}, {"body": "For a $100k truck, I sure hope it can handle some off-road driving.", "score": 29, "replies": [{"body": "They are not 100k. Even the top of the line Tri motor is expected to be around 80k.", "score": -23, "replies": [{"body": "\"expected to be\"... just like it was expected to be released 3 years ago", "score": 19, "replies": [{"body": "Well nobody knows the price then.", "score": -4, "replies": []}]}, {"body": "I believe that was the price they were projecting 3-4 years ago. Likely a lot higher given the price of vehicles today.", "score": 1, "replies": [{"body": "You sir need to take a look at the pricing data of Tesla’s. https://docs.google.com/spreadsheets/u/0/d/1F5IQOynIawoXiJPVarLDgPQDJAdzY8b5Vamw-Vf3eSY/htmlview#", "score": -2, "replies": []}]}]}, {"body": "it's like 50k. not sure where you got $100k", "score": 1, "replies": []}]}, {"body": "So a video of them doing like 15-20mph to show how good it is? Show me the time it took to do the baja course or it doing something other then driving on a relatively flat dirt road. Nothing other then standard vehicle ability is shown here.", "score": 7, "replies": []}, {"body": " Was it a stock truck or a modded one with a team of engineers monitoring its every sensor round the clock?\n\nDatsun runs Baja1000 as well. No one is raving about them.", "score": 24, "replies": [{"body": "Stock except the 4 point seatbelts.", "score": 0, "replies": []}]}, {"body": "LMFAO", "score": 6, "replies": []}, {"body": "At first I thought the tag said “Comedy Discussion,” which would honestly be more appropriate for anything related to Cybercuck.", "score": 34, "replies": []}, {"body": "there was nothing impressive, they were just driving on a dirt road. \n\n\nThis comes from an offroad enthusiast with a cybertruck pre-order. \n\nDriving on dirt tells us nothing and its not impressive for a truck.", "score": 17, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "The video did not show the trucks \"driving fast\".\n\nI was responding about the video being impressive. It's just a normal day on a dirt road in the video.", "score": 5, "replies": []}]}]}, {"body": "Musk has these kids drooling over this garbage enough that they are debating doing tax fraud to get one 😂", "score": 10, "replies": []}, {"body": "Hate to break it to you, but that appears to be a road in the video.", "score": 5, "replies": []}, {"body": "You are not likely able to write off the whole truck. You can write off the depreciation every year. Not quite the same thing.", "score": 2, "replies": []}, {"body": "You could do that with any crossover! Pick it Q7, GLE 53, Evoque, CX-9, XC60", "score": 2, "replies": []}, {"body": "Trucks don't go off-road, especially not these and I've never seen a Supercharger when I was out rock crawling lol.\n\nAs long as these can jump a curb at Costco they'll be good.", "score": 2, "replies": [{"body": "Mall crawler", "score": 2, "replies": []}]}, {"body": "I don’t doubt that they took the cyber truck down the Baja peninsula, but the route they’re driving in the video is pretty damn tame. It may be the Baja *track*, but the track isn’t what’s so demanding. It’s the track plus the actual racing part of it. A 65 year old VW beetle can do the Baja 1000.", "score": 2, "replies": []}, {"body": "If you think this truck got within 10% of the actual Baja 1000 (outside of the highway speed zones) i have some beach front property in Arizona I’d love to sell you…", "score": 2, "replies": []}, {"body": "I drove the length of the baja there and back in my 1992 Chevrolet corsica. In 2017. It's not exactly crazy terrain. \n\nIt's essentially a race on two lane roads with the occasional bit of gravel road.", "score": 2, "replies": []}, {"body": "> As a side note and correct me if I'm wrong, if Cybertruck is used as a work truck for business, wouldn't a business owner be able to write it off 100% as an expense as long as it met a specific weight requirement?\n\nI don't think the weight/etc. matter if you're going to use a vehicle for business purposes. I think all that matters is that you're really using it primarily for business purposes, and not just lying on your tax forms that it's a business expense when it's primarily used for personal use, which can get you in big trouble with the IRS.\n\nThat said, the vast majority of businesses use a van to carry their tools/etc. around, and not a pickup truck.", "score": 6, "replies": [{"body": "I don't get that far left lie either. A business expense is a business expense.", "score": -16, "replies": [{"body": ">I don't get that far left lie either\n\nHoly shit bud Tax Code is now far left lies? Like its available on the IRS website, and its the a regulation, Laws are usually not lies. Is all verifiable information and recorded documentation far left lies?", "score": 3, "replies": []}]}]}, {"body": "I remember Lordstown motors offload much touted adventure. A toyota with a jury rigged battery relay DIY ev did better.", "score": 2, "replies": []}, {"body": "I find it hilarious that any person would think that Fox News is informative. Fox sells bullshit to peasants who worship the wealth of billionaires and that truck is laughable. Absurdly laughable, like a Hummer with a lift kit - lame AF", "score": 2, "replies": []}, {"body": "People in here hate Tesla and their success so you're not going to get any positive feedback.\n\nHowever, I live near Tijuana and have friends with fully build Baja trucks that take on damages from the 1000. \n\nSure, you can add 10\" of travel to a VW suspension and slow send it over a couple weeks, but to race a truck at decent speed across the whole thing is going to absolutely put parts to the test.  \n\nThose trucks blew out 2 of the knobby tires they had on it. Those don't just blow out driving slow and other \"stock cars\" that are being claimed would be totally fucked taking on the same terrain that's going to blow out knobby truck tires like that.\n\nPeople are going to have to get over the fact that these trucks can truck. And honestly, if they don't, that's fine too it won't affect the ability to sell them because the proof is in the pudding, not the media.", "score": -2, "replies": [{"body": "I am never going to trust anyone on engineering issues who thinks that \"positive feedback\" means \"people saying nice stuff.\"", "score": 9, "replies": [{"body": "I'm never going to trust people aren't aren't engineers or can't prove anything about what they say, period.", "score": -13, "replies": [{"body": "As you don't know what positive feedback means, your chances of knowing who is and isn't an engineer are zero.", "score": 10, "replies": [{"body": "What are you even talking about?", "score": -12, "replies": []}]}, {"body": "You haven’t proven anything? When? Where? And what specialization of engineering degree do you have?\n\nI’m genuinely curious. I’m an engineer lol", "score": 2, "replies": [{"body": "Is that fist sentence a question? \n\nThis week\n\nBaja 1000 goes from TJ to Cabo\n\nI'm not an engineer, I'm a supply chain director. I said i wouldn't listen to anyone who's not an engineer. \n\nThats cool though, I was in college to become an Architectural Engineer but turned out to not be what I wanted. This was decided 25 years ago haha. I'm, getting old. \n\nWhat type of engineer are you?", "score": -1, "replies": [{"body": "Who are you to say that “you’re clearly not an engineer if you think teslas are regular”. Teslas are regular as fuck and tend to have shit build quality as well. A truck that has yet to hit production that was promised to be released in 2021 is hardly an engineering marvel. Musk has built multiple businesses on over promising and under delivering  on the backs of fanboys. We’re still waiting for his $25,000 EV he promised in three years back in 2018 lol. Shit Tesla said a mid 2024 release for the cybertuck at the beginning of the year if I’m not mistaken. Musk said nah it will be end of Q3 2023 and he just missed that headline too. \n\nI am a chemical engineer with an oil and gas specialization. And have an MBA.", "score": 7, "replies": [{"body": "Hey, common now. Teslas are special. Elon said so.\n\nIt's got 4 wheels,  a chasis, steering and batteries. No other production electric car has that.", "score": 1, "replies": []}, {"body": "Sandy Munroe has nothing on you! Good job not investing when I did all those years ago. You really saw the writing on the wall and dodged a bullet.\n\nI don't give a fuck about Elon. I saw a disruptive product and researched it, then invested.\n\nMaybe your chemical engineering degree can help explain to yourself why Tesla has the best selling car in the world right now. Or maybe why CT is the most anticipated vehicle in literal history. Or maybe why everyone has to use Tesla's chargers now. Or maybe why all makers have to go to a direct sales model to survive (BMW just announced they are), or maybe how every car maker is going to over the air updates etc. Can literally go on and on about how Tesla reshaped the industry because I'm a supply chain director and not a chem engineer who has no clue what makes a good business, manufacturer or product.\n\nIt's going to get so much worse for the blind hate as Tesla continues to pull away from legacy", "score": -1, "replies": []}, {"body": "Software engineer here, that tesla doesn’t look regular to me, it looks like a roblox car got out of the metaverse.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "They should be trucking. That's the bare expectation of a truck. So can F150s and the lot. The point is Tesla cars seems to always be called special when they are, in fact, regular.\n\nAll Baja 1000 cars are modded. The last stock cars to properly compete were in the 70s", "score": 8, "replies": [{"body": "You are clearly are not an engineer if you think Teslas are \"regular\"\n\nAnd considering no one has ANY idea what these trucks will feature, calling them regular makes you look like you're guessing at best, which you are.\n\nAll we know is that they didn't break as a stock car over the Baja 1000. That's impressive whether people like it or not, and I know it eats some people up inside who know about cars because stock cars don't go thru the 1000.", "score": -18, "replies": [{"body": "Neither would a regular Toyota Tundra or a Ford F150 or a VW Amarok. Did the Cybertruck even went fullspeed or just finished the regular rally track? I wouldn‘t call it impressive, pretty much what I expect from a truck.", "score": 3, "replies": [{"body": "Maybe you can show us where completely stock anything right off the production floor has made it through the 1000 then. \n\nThere was a modded 2017 Raptor that did it and some other cars, but all had mods for the undercarriages, wheels and tires, suspension etc. \n\nOpen to learn what I don't know, but I've looked into all this.", "score": -4, "replies": [{"body": "There are entire stock classes in the Baja 1000, plenty have finished. Here’s the rules for [Stock Full](https://score-international.com/raceinfo/rule-book/truck-classes/stock-full/) (full-sized 2 or 4 wheel drive truck or SUV).", "score": 3, "replies": [{"body": "I know about the Baja, I literally live here.\n\nWhat you just posted proves they are NOT stock cars. The Cybertrucks were completely stock production cars. The fact that ppl upvote your comment and downvotes fact, proves how little people know about this stuff. Also proves how Tesla hate thrives in here\n\nAgain, if you want to prove a point, show a \"stock\" car that has done it. No wheel upgrades, no suspension upgrades.\n\nOr, people cant just continue to blindly downvote whatever makes them feel better on a stock forum.", "score": -1, "replies": [{"body": "🤣", "score": 4, "replies": [{"body": "Googles for 10 seconds, acts like a know-it-all, then gets ripped and laughs it off. \n\nClassic response from someone who's never been to a Baja 1000 in his life. \n\nStick to whatever it is you actually know about.", "score": -1, "replies": [{"body": "They took over a week to travel it, that’s not exactly “running the Baja 1000”. They’re doing off-road testing in a harsh environment which is to be expected for a vehicle making off-road claims, what they didn’t do is race the course or do anything impressive. Get that time down and maybe it’ll mean something.", "score": 4, "replies": [{"body": "Now you're making sense. I'll take that much and agree with you! \n\nI will tell you that no matter what you do, its going to fuck your vehicle up going over the terrain from start to finish. \n\nYou aren't going to blow out 2 tires by driving slowly and in the video they are literally drifting around turns. i have my doubts they were driving that fast the whole time but if they were color me amazed. \n\nAlso, a week is not as long as you think. If you drove 8 hours a day thats 56 hours of driving over the entire thing which is not ridiculously far off from an all out send, depending on the vehicle. \n\nObviously, as you said, this was a test, not a race", "score": 1, "replies": [{"body": "I knew we could find some common ground.\n\nI don’t think it’s an impressive feat but I also don’t think it’s unimpressive - it’s table stakes for the claims made about the vehicle’s capabilities.\n\nBut I’m also personally not a fan… the bed looks too difficult to be usable as a real pickup (access to toolbox and such) and not just a toy carrier, and that wheelbase and approach/departure angles would leave me stranded in the places I like to off-road.", "score": 1, "replies": [{"body": "The OP did say he was looking at it from the perspective of this being Tesla's first truck, and an eletric one at that. Maybe it's not impressive in comparison to the top of the line trucks, but their testing is also obviously not a stress test to see the limits of the vehicle. It makes sense to remind people not to be too excited, but it makes no sense to downplay it. Tesla has a good history of delivering on their promises when it comes to specs. Their only major promise mistake was self driving.\nI wouldn't just blindly believe them, but I have the impression that the entire point of the strange design is to market their new tech while trying to break into a VERY stiff market. If you assume their truck will be better than the established brands, it still leaves the matter of convincing people to take the risk. Those who hate tesla won't buy it even if it is a normal looking truck, tesla enjoyers will be inclined to buy. That leaves the undecided, and for the undecided to pick something new and risky you can use trends and popularity to do the trick.", "score": 0, "replies": []}, {"body": "I'd never buy a CT but I knew their cars would be extremely disruptive and have been invested for a long time.\n\nWe don't even know the true features of CT but 16\" of clearance at the highest setting is an industry best and 1000 hp and 0-60 in around 3 secs wont hurt to literally embarrass almost every truck on the road.\n\nPeople love to hate Elon and I dont care about him, but he came up with a car 4 years ago that is now literally the best selling car on the globe. I seriously would not bet against the guy to reshape the truck game.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "So which factory is the Cybertruck produced in?\n\nThe truck does not have NHTSA certificate yet. It's as stock production as anything else running the 1000.\n\nJust because Tesla said it was a stock model does  not make it so.", "score": 1, "replies": [{"body": "They are literally the same production models they've been testing. Name 1 production car that ran it with un-modded wheels and suspension, please. \n\nThey had starlink and lights added. Tats it", "score": 1, "replies": []}]}]}]}, {"body": "A Saab made it in 1969. And 1970.", "score": 0, "replies": [{"body": "With modifying the cars... why is this so hard for people to grasp?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Typical I had to scroll this far down for some actual insight, but at least I found some.", "score": 1, "replies": []}, {"body": "Hey, this was what I was looking for. I appreciate your insight.", "score": -4, "replies": [{"body": "Don't worry it'll get downvoted by the same bears that have been getting their faces ripped off over and over for the last 5 years in here, claiming Tesla's aren't special in any way and they are just a car company.", "score": -3, "replies": [{"body": "They aren't a car company. They are a tech company. That's where the valuation is coming from - their IP.\n\nIt's a shit car company. It's a fairly good tech company.", "score": 1, "replies": [{"body": "Then why do they have the best selling model car on earth right now if their cars are so shit? \n\nHave you driven one?", "score": 1, "replies": [{"body": "I don't think you get others point and you definitely don't stocks. So this discussion is pretty futile.", "score": 1, "replies": [{"body": "Don't stocks? I've held TSLA since this page was upvoting that they were going out of business in 2017\n\nThe only \"point\" I care about is what the stock was worth when i bought it vs what it will be in 2030. I saw the disruption from a mile away and have not been surprised one bit at the current landscape. Everyone else saw \"Elon bad man, EVs bad\".\n\nAnyone saying it's a \"shit car company\" either makes them blindly opinionated or bias based on their originally incorrect hunch.\n\nAll legacy auto maker's CEOs disagree with Tesla being a shit car company. Hence all of them piling onto the charging network, they're all striving for the OTA updates that Tesla has already been doing for over 10 years now, BMW just announced they are going direct sales model starting with Mini in order to compete with Tesla's business model (all makers will have to take over their dealerships and sell direct to survive). Ford and GM had to pull back their EV plans because they cannot scale on current trash margins and well, no one wants to buy their EVS... the list goes on and on and there are people like you who think \"shit car company\" as if you're literally blind. UAW is going to crush legacy auto while Tesla happily gives out stock options that grow with the performance of the business. Its ugly out there for legacy. Downright scary to be honest. I'm not sure how Ford and GM survive. Toyota may be the only big maker left in 10 years.\n\nMaybe being a supply chain director helps me see things better but wow eyes closed tight around here.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "> if Cybertruck is used as a work truck for business, wouldn't a business owner be able to write it off 100% as an expense as long as it met a specific weight requirement?\n\nI'm not sure I understand what you are trying to say here.", "score": 1, "replies": []}, {"body": "”Offroad” what, that was road…", "score": 1, "replies": []}, {"body": "Tesla is finally ramping up the production. Let’s see how it goes.\nI think it’s great they try bold new designs. I hate the guy but imo Elon seems more of a figurehead instead of a ceo. \n\nLet’s see all those preorders get fulfilled and the level of issues and recalls. It’s such a new design and type of vehicle for Tesla that I’m sure there’ll be tons of issues.", "score": 0, "replies": []}, {"body": "Unless they fix the trunk limited people will get that POS for work. \n\nNot to mention the price is still unknown and pre orders were only 100$ and can be cancelled.", "score": -6, "replies": []}, {"body": "There's no way that truck is being sold in most the world, it's a complete death trap", "score": -7, "replies": [{"body": "If this is anything other than the safest truck ever built, it will be a deviation from any recent car Tesla has ever made.", "score": 5, "replies": []}, {"body": "Tesla doesn't make cars that are anything but the safest cars in the world. This truck is likely going to be even safer than the Model Y, which is the safest car on the planet.", "score": 4, "replies": [{"body": "Safety alone doesn‘t matter. EU has strict rules - especially when it comes to the safety of other drivers and pedestrians.", "score": 2, "replies": []}, {"body": "You think a truck with those angles will be sold in the EU as is? Gurl", "score": -2, "replies": [{"body": "Regardless of what I think, you said death trap, which clearly insinuates dangerous to the occupants, not pedestrians.", "score": 2, "replies": [{"body": "OK, death trap for pedestrians if that makes you feel better and clarifies things", "score": 3, "replies": []}]}]}]}]}, {"body": "It's probably a lot more capable of what's shown in the video. I mean it's got oodles of power and torque. But does the suspension articulate enough can it withstand the immense weight of a stainless steel EV? Is it geared properly for off road? Can it take a beating on a trail? Still lots of questions.", "score": 1, "replies": []}, {"body": "I can't wait to but TSLA shares about a year after the cybertruck comes out, when they cancel it and the share price drops a ton.", "score": 1, "replies": []}]}
