{"title": "Space Industry Portfolio", "selftext": "I compiled a small space industry portfolio for myself. I'd love to start a discussion if someone shares my interest (edited 2020-02-03; thanks for your contributions down in the comments!).\n\nSpaceflight stocks:\n\n\\- Airbus (aerospace giant)\n\n\\- Boeing (aerospace giant)\n\n\\- Virgin Galactic (risky, but must-have as it's the pure play first mover)\n\nMilitary stocks:\n\n\\- Lockheed Martin (giant defense contractor; space force)\n\n\\- Northrop Grumman (giant defense contractor; space force)\n\n\\- Raytheon Technologies (once merged)\n\nThe stocks above are a must. From here on, different paths can be taken, adding companies from different sub-sectors (suppliers of different components and materials, satellite manufacturers, smaller defense contractors, etc.). Given that my funds for the space portfolio are limited, I chose the following additional stocks, trying to diversify as much as possible with only a few more stocks:\n\nLarge cap suppliers:\n\n\\- Honeywell (different stuff)\n\n\\- L3 Harris Technologies (different stuff)\n\nSmall-cap & mid-cap picks:\n\n\\- Ball (materials)\n\n\\- Hexcel (materials)\n\n\\- Aerojet Rocketdyne (rockets)\n\n\\- Kratos (drones)\n\n\\- OHB (data)\n\n\\- Maxar Technologies (data)\n\nIf someone has the time and interest to compile a better portfolio, please dissect this list, see the other suggestions in the comments and build a more profound one ([this article](https://web.archive.org/web/20200104021638/https://www.cnbc.com/2019/11/09/how-to-invest-in-space-companies-complete-guide-to-rockets-satellites-and-more.html) could be helpful, too). I didn't include OTC stocks as I can't buy them at this point in time.\n\nThere seems to be a growing interest in this topic and maybe this discussion can be continued over the years to come (on and hopefully one day off earth) :-)", "id": "ev64dq", "created_utc": 1580220945.0, "score": 182, "upvote_ratio": 0.94, "num_comments": 78, "comments": [{"body": "Out of all these, I have LMT, jumped today after results. Holding it for nice dividends and growth. I had some BA, but sold it and staying away from it until it settles with all issues.", "score": 48, "replies": [{"body": "BA is going to be a weird story. The 777X is a phenomenal platform. And the 737MAX *will* get green lit. But I don’t know how you convince the flying public a new BA product is safe without having it fly for years now.", "score": 24, "replies": [{"body": ">convince the flying public\n\nI don't see consumers cancelling their ticket because they need to fly a 737MAX. It's the airlines that need convincing that they trust the airplane with their customers and reliability/safety of their service. Malaysia Airlines also had two incidents, they're still the pride of Malaysia and people love flying with them.", "score": 20, "replies": [{"body": "This is true to some degree I guess. Although both MH crashes were outlier accidents. I’m an Airbus pilot, and after the Ethiopian crash, people would ask me or our FAs, “this isn’t the 737 thing, right?” Even though we were in an entirely different platform. I think airlines will respond to that in some way, obviously not as much as platform safety. I can see an airline not wanting the headline “XAir buys 120 737MAX” to circulate unless they’re getting a smoking deal. Especially when it may end up requiring a new type rating for the crews after all. At that point, the A321NEO is looking pretty good.", "score": 6, "replies": [{"body": "At this point, this is pure speculation but I can see various travel website giving a filter for the kind of aircraft the flight would be in.", "score": 4, "replies": []}, {"body": "Exactly. Your run of the mill consumer (even people who are knowledgeable about aircraft at a basic level) aren't going to be able to tell the difference. However, that doesn't mean Boeing is free from a shit storm of criticism for their internal behavior.\n\nStem out the asshats at Boeing leftover from the MD merger (which was where shit became criminally dysfunctional from a management and R&D direction point of view). They've become a key point of the company's rot.\n\nAs for the plane itself, prioritize a set of permanent solutions for the 737 MAXX's flaws that they felt was acceptable to work around with software mods --> And STICK TO THEM UNTIL THEY ARE DONE, or just design an airframe from scratch that will compete with AirBus performance wise, like the 737 MAXX was intended to. There's no shortcut for Boeing anymore.", "score": 1, "replies": []}, {"body": "Just on the point of aircraft reputation, my brother works in the aviation industry, and says once a plane is blacklisted, like the Max, people won't trust it ever.", "score": 1, "replies": []}]}, {"body": "Agreed. The average person has no idea what kind of plane they're boarding on - I'm pretty sure I only know when I look at the seating map out of curiosity.\n\nPersonally, I'm more apt to associate Malaysia Airlines with crashes than Boeing's planes crashing. Neither is a particularly fair association.", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Find a platform that offers Fractional Shares. Hit me up if you need one.", "score": 5, "replies": []}, {"body": "This is a good question I asked myself when I was looking into Lockeed, I hope to invest in them at some point in the near future, but they do look like they're at a point where a stock split would be reasonable. I would love to jump in, but if news of a split arose, I definitely would jump in at the split, just for the sake of dollar amount allocation in my portfolio.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 21, "replies": [{"body": "Lot of debt too, but at least they're not ignoring it. It has been fun run riding MAXR lately.", "score": 7, "replies": []}]}, {"body": "You might be interested in IEHC. Tiny company that specializes and has a natural monopoly in hyperboloid connectors, which are the most reliable form of power/data transmission in the aerospace industry. They have a significant amount of aerospace/defense exposure. Located in the USA.\n\nAnd they're cheap.", "score": 32, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "I got another small one for you hexcel  HXL.  supplier for aerospace.", "score": 5, "replies": []}]}, {"body": "I don't see this one on Robinhood :(", "score": 0, "replies": [{"body": "They're an [OTC](https://smartasset.com/investing/otc-stocks) stock, not registered on the exchanges. RH doesn't have all of these. Mature brokerage platforms like Schwab and Fidelity do.", "score": 2, "replies": [{"body": "Ameritrade as well", "score": 1, "replies": []}]}, {"body": "The first problem you have is that you're on robinhood", "score": 0, "replies": [{"body": "What’s wrong with that?", "score": 3, "replies": [{"body": "[Robinhood sells your order so you can get scalped on the bid ask spread](https://www.cnbc.com/2019/04/18/a-controversial-part-of-robinhoods-business-tripled-in-sales-thanks-to-high-frequency-trading-firms.html)  \n\n\nAnd then obviously they don't provide access to OTC stocks like IEHC", "score": 2, "replies": [{"body": "The bid/ask spread is tiny compared to the trade fees.  Plus I just place limit orders and get the price I want regardless.  Idc if Robinhood makes a penny or two. \n\nThe OTC thing sucks tho.", "score": 6, "replies": [{"body": "[What trade fees?](https://www.cnbc.com/2019/10/07/charles-schwab-says-brokers-move-to-zero-commissions-was-an-ultimate-goal-for-the-firm.html)", "score": 2, "replies": []}]}]}, {"body": "Robinhood is the Honda Element of brokers.", "score": 1, "replies": []}]}]}]}]}, {"body": "MAXR and SPCE for myself. I think Boeing can keep falling for now so staying away.", "score": 8, "replies": []}, {"body": "You might be interested in [this article](https://web.archive.org/web/20200104021638/https://www.cnbc.com/2019/11/09/how-to-invest-in-space-companies-complete-guide-to-rockets-satellites-and-more.html) about space investing.\n\nI want to learn more about space stuff for sure and need to do a lot more research. I don't know if anyone wants to start a space investing discord or subreddit or something, I'd be into that I think.\n\nPersonally I would never buy a long term spaceflight stock that isn't based on a fully reusable architecture. Disposable rockets are like horses in 1905. The only ones I know working on it are SpaceX, Blue Origin and Rocket Lab and the first two are private which is frustrating.\n\nYou can buy SpaceX if you are a US accredited investor through EquityZen or Space Angels, you can buy Alphabet which has some and also [this fund](https://www.bailliegifford.com/en/uk/individual-investors/funds/baillie-gifford-us-growth-trust/portfolio/) has it but only 1.5% so you're mostly buying other trash to get at it.", "score": 7, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "r/SpaceInvestments", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": ">Rocket Lab\n\nYeah I hadn't looked before but [Wikipedia](https://en.wikipedia.org/wiki/Rocket_Lab) says it is private.", "score": 1, "replies": [{"body": "**Rocket Lab**\n\nRocket Lab is a private American aerospace manufacturer and smallsat launch service provider with a wholly owned New Zealand subsidiary. It developed a sub-orbital sounding rocket named Ātea and currently operates a lightweight orbital rocket known as Electron, which provides dedicated launches for smallsats and CubeSats. The company was founded in New Zealand in 2006 by Peter Beck and established headquarters in California in the United States in 2013.The Electron test program began in May 2017, with commercial flights announced by the company to occur at a price listed in early 2018 as US$5.7 million. Launching from Mahia Peninsula, New Zealand, the rocket's test flights took place on 25 May 2017 and 21 January 2018, while its first commercial flight took place on 11 November 2018.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/stocks/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28", "score": 2, "replies": []}]}]}, {"body": "> EquityZen\n\nHow trustworthy is this site?  Seems confusing and sketchy.", "score": 2, "replies": [{"body": "I have no idea. I'm not accredited.", "score": 1, "replies": [{"body": "You can 'get accredited' if you just make up all the inputs on their survey - got an account and access. The space options seem very limited right now. SpaceX is listed, but not available for purchase ATM.", "score": 1, "replies": [{"body": "Ah ok thanks, that's helpful. I guess the shares are in high demand. Does it have any spaceX financial reports?", "score": 1, "replies": []}]}]}]}]}, {"body": "LDOS is another great space option. Supports NASA and other major government contracts.", "score": 8, "replies": []}, {"body": "I own SPCE so far, but a very small amount because I consider it extremely high risk. If there are civilian deaths early on, it is done.\n\nWould rather invest in SpaceX, but I guess I will have to own Google to get a piece of it (Google does have a lot of other great things going for it anyways...). I may get into LMT or Raytheon as well. I will have to do more research on those other riskier ones, but I'm not going to put a whole lot of money in them if I buy 1.\n\nWish we could get an ETF going, but DFEN might be the closest one we have.", "score": 7, "replies": []}, {"body": "Are you forgetting aerotyne international?", "score": 5, "replies": []}, {"body": "You could consider some Alphabet stocks as they hold a 30% stake in SpaceX and they're a generally good stock anyways.", "score": 13, "replies": [{"body": "They own like 10% not more, but still a good stock anyway.", "score": 15, "replies": [{"body": "Ah my bad. Still the easiest way to invest in SpaceX though, right?", "score": 8, "replies": [{"body": "Yes it's 10%, it's a nice cherry on top but don't buy GOOGL as a proxy for SpaceX, it's not. SpaceX would have to reach $10T to derive a doubling of Google's current share price. You can buy directly if you're an accredited investor but I think you're not.", "score": 3, "replies": []}, {"body": "Yep. Definitely one of my reasons for holding them.", "score": 4, "replies": []}]}]}]}, {"body": "Aerojet is classified as \"riskier\" than Virgin Galactic... that's ridiculous", "score": 6, "replies": []}, {"body": "Alphabet owns a portion of SpaceX if you desperately want a piece of the pie.", "score": 3, "replies": []}, {"body": "Just so you know, there was an article specifically about this a couple of months ago. I don't remember if it was MF or some other rag, but even if you don't take their advice it is a reasonable starting point for company research. After my follow up I bought Virgin Galactic, Maxar and Aerodyne, not with a lot of conviction or a lot of money--just a fun place to stick a very small sum of cash. These were the most \"pure plays\" in terms of space.", "score": 3, "replies": []}, {"body": "Very interesting. Military no buy for me. Boeing nope. Airbus chas crazy debts like wtf how haven't they go bankrupt yet. I have OHB. They show net income but have negative cash flow. I don't understand how and therefore think it stinks and will likely sell.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Agreed but I don't kill people, don't take money for killing people. Maybe that is also what you mean with the emoji tho.", "score": 3, "replies": []}]}]}, {"body": "Would love to see updates since you mentioned this is just a first draft", "score": 3, "replies": []}, {"body": "FYI - Owning space/military stocks is ballsy during an election year.", "score": 3, "replies": []}, {"body": "If you're focusing on Space, NOC will end up being the biggest space player out of the military stocks. It bought Orbital ATK a few years ago and it will pay off big time", "score": 3, "replies": [{"body": "Orbital ATK company was purchased and absorbed into Northrop Grumann...?", "score": 1, "replies": [{"body": "Yes. Look it up, it's going to do big things for Northrop Grumman.", "score": 1, "replies": [{"body": "Sorry, I misread your original comment. I thought you said you bought OATK stock. \n\nAren't you worried about James Webb Space Telescope fucking up and destroying NG's $20 billion jobs program?", "score": 1, "replies": [{"body": "Not really. Things will work themselves out.", "score": 1, "replies": []}]}]}]}]}, {"body": "Passengers don’t have a choice what to fly. Had Raytheon and Boeing, sold it and took profits. Waiting on the sidelines and looking for a good time to pick up again", "score": 2, "replies": []}, {"body": "Virgin Galactic should be in your risky section. The company at the moment has absolutely no cash flow.", "score": 3, "replies": []}, {"body": "Spce is all you need. Up 100%", "score": 4, "replies": [{"body": "Suprised with rise since Dec '19 to now.  Any news?", "score": 1, "replies": [{"body": "It's the only space stock on the market. The news is, they just built a second ship and will begin commercial flights to space this year. This is a massive buy for anyone", "score": 4, "replies": [{"body": "First Mover advantage always helpful.", "score": 2, "replies": []}, {"body": "\"only space stock on the market\"? Well, it *is* the only stock with ticker SPCE.", "score": 1, "replies": [{"body": "I mean you can count satellite companies and Boeing to an extent. \n\nBut spce is truly a different beast and separates itself from the pack.", "score": 2, "replies": []}]}]}]}]}, {"body": "no Meggitt (MGGT) stocks?", "score": 1, "replies": []}, {"body": "Is there a defense ETF?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "What is it?", "score": 1, "replies": [{"body": "XAR is an aerospace/defense etf", "score": 2, "replies": []}]}]}, {"body": "XAR, PPA, ITA, DFEN... your choice", "score": 1, "replies": []}]}, {"body": "Is there a good resource linking DARPA ‘patent’ (sorry, don’t know what else to call it) winners to stocks / equity market?", "score": 1, "replies": []}, {"body": "I have virgin Galactic. It increases in value a little almost daily. \nI also bought Mynaric its a German company that makes the lasers for low orbit satellites. \nI was up 1200 in a week. After 2 weeks im still up 750. I dont think thats bad", "score": 1, "replies": []}, {"body": "Google has a little part of spacex.", "score": 1, "replies": []}, {"body": "Following ...", "score": 1, "replies": []}, {"body": "*aerospace* industry portfolio. Gotta make sure you account for that.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Any DD on this?? 5 year looks phenomenal", "score": 1, "replies": []}]}, {"body": "Are there space stocks that don't contribute to military and wars?", "score": 1, "replies": []}, {"body": "Hi! I’m interested in investing in a space industry portfolio and just found this post! Do you all think these are still good investments? I’m starting my research now. Thanks!", "score": 1, "replies": [{"body": "Sure, why would the outlook change? Space industry is a long term play.", "score": 1, "replies": []}]}, {"body": "Alright I'll share with you the Space Industry Portfolio that I am considering this weekend...\n\n$AJRD (Aerojet Rocketdyne) rocket engines\n\n$NOC (Northrop) bought Orbital ATK\n\n$BLL (Ball) satellites\n\n$RTX (Raytheon) sensors, KVs\n\n$SAFRY + $EADSY (Safran, Airbus) Ariane\n\n$FINMY + $THLLY (Leonardo, Thales) satellites", "score": 1, "replies": []}, {"body": "You need to add some drone manufacturers.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "KTOS", "score": 1, "replies": []}]}]}, {"body": "Fuck Boeing", "score": 0, "replies": []}, {"body": "Bookmarked/s", "score": -1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": []}]}
{"title": "AMD Long DD", "selftext": "Both PS5 and Xbox Series One X will be using AMD processors. Both come out this year. I think PS5 will be using AMD GPU as well. Nothing new but this will be included in guidance. \n\nNot to mention the absolute smash they had against Intel during CES. \n\nR/PCMasterrace has entirely switched fan boydom from Intel to AMD this prior year. Ryzen and retard start with the same letter... no wonder it has such an appeal. \n\nAMD has like 10 billion new laptops coming out with every manufacturer because they now make the smallest most powerful and energy efficient laptop processor in the game. \n\n\nHere is one random link for creditability: \nhttps://www.google.com/amp/s/wccftech.com/new-amd-unknown-apu-could-be-the-xbox-series-s-lockhart-apu-could-be-more-powerful-than-expected-rumor/amp/", "id": "ev6ja8", "created_utc": 1580223045.0, "score": 61, "upvote_ratio": 0.83, "num_comments": 86, "comments": [{"body": "[deleted]", "score": 55, "replies": [{"body": "i'd just shorten it to \"stonks go up\"", "score": 15, "replies": [{"body": "Y more words less do fine", "score": 5, "replies": []}, {"body": "We don’t short here man", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 67, "replies": [{"body": "This is the way", "score": 16, "replies": [{"body": "This is the way", "score": 6, "replies": []}]}, {"body": "I come here to learn what I shouldn't do, it's been working well\n\nedit: it worked again", "score": 2, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "both /u/yumipark456 and /u/AnxietyCanFuckOff are the same person just instigating drama for upvotes.\n\nmeth\n\nnot\n\neven\n\nonce", "score": 7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "https://media.giphy.com/media/EldfH1VJdbrwY/giphy.gif", "score": 1, "replies": []}]}, {"body": "How do you know his accounts used the same MAC and IP?", "score": 5, "replies": [{"body": "This is actually hilarious, [this is a small snippet of our PMs where he literally admits to everything I've been pointing out.](https://imgur.com/s4M8mxD) Imagine how pathetic this guy is still trying to lie his way out of this after deleting everything!", "score": -4, "replies": [{"body": "I don't think you know what the word \"literally\" means...", "score": 3, "replies": [{"body": "Weird, thought I used the drag down screen shot to get more of it! Let me know if you wanna see the rest and I can upload it!", "score": 0, "replies": []}]}, {"body": "I don't think you know what the word \"literally\" means...", "score": 0, "replies": []}, {"body": "I don't think you know what the word \"literally\" means...", "score": 0, "replies": []}]}, {"body": "it's all made up. Hes insane. He was doing this to someone else and I called him out and then he started doing it to me. I'd stay out of it. Hes been stalking me for 5 days now His other account is kamjanamja and he has many more (it's how hes upvoting himself) Guy shits on peoples dead relatives and just breathes negativity into the world 24/7", "score": -6, "replies": [{"body": "Cute, lying to yourself and others! You know you love the attention, that's why you came back to ride my dick after all of this blew over! And honestly you should follow everyones advice and do what you said you were gonna do and just block me. I might lose interest if you stop engaging me!\n\nAnd c'mon you know upvotes from the same IP dont affect scores, you've tried it a bunch of times! Atleast own up to all of this instead of being so delusional!", "score": 1, "replies": []}]}]}, {"body": "How do you know his accounts used the same MAC and IP?", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Guy has been following me with multiple alts claiming to have doxxed me. Hes doing what he says I am, mentally unstable. Report him, will help my case. Gonna try to bring him to court, whether I lose or not doesn't matter. Dude is obviously unemployed and can't afford representation.", "score": -2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Oh yeah for sure! Difference is I'm not in denial about it and I don't harass random strangers on here, just the random strangers who are massive twats like this guy!", "score": 1, "replies": []}, {"body": "ok boomer", "score": 1, "replies": [{"body": "Oh god, you two guys again lol. Don't know about the others but I'm definitely not one of his alts, I think you just thought that because I made the same comment he did to someone else. You guys can feud or whatever if you want, just leave me out of it lol.", "score": 1, "replies": []}, {"body": "Just the first one, come on bro you know you deleted your comments against the other two because you realized they weren't a part of any of this!\n\nMan you really are upset, don't let it affect how you think!", "score": 0, "replies": [{"body": "Don't you have better things to do with your life?", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "You’re a tard lmao", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "ew it talks \n\ngo away tard", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "oh I do, i just dont like talking to retards. last time one bit my hand. I'm sure mommy is looking for her \"God's little gift\" now run home and lick some windows for me, sport", "score": 1, "replies": [{"body": "Hes my stalker stop trying to take him away from me", "score": 1, "replies": [{"body": "Mine now ;)", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Dude, if you’re going to mention my name you better get shit straight. Mods deleted your post last time you said I was this guy, I guess you want to be reported again. I remember you calling me a mental alcoholic with nothing to base it on. You’re legit a piece of shit dude. \n\nI don’t drink, at all (liver problem from jumping off a shed playing power rangers as a 10 yo, hit my side on a dog house and punctured my liver, but sure I made that story up just for you) I work hard to take care of me and my daughter, I don’t have time for little fucks like you calling me a alcoholic with a mental problem. That shit legit pisses me the fuck off. \n\nGo ahead, show me exactly where you figured I was an alt account. I’ll wait... a long fucking time because it will not happen. I have one account, everywhere, because I don’t pull no dumb shit like this. \n\nAgain, seriously, fuck off bitch. You are a fucking loser.\n\nAnd hi to u/alexfromromania it seems this dick brought us together again.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Show me where I replied on a different account. I have one you fucking idiot. And look at you having the nerve to talk about others being a complete piece of shit. The amount of unjustified accusations you’ve thrown my way based on absolutely nothing shows the real truth. The first time you jumped on my back was from me calling out an obvious troll for being a dick about someone’s death, yet I’m the asshole? Fuck off dude, and keep my fucking name out of your mouth. Yeah, I can be a dick, but it’s always towards people like you who act like they know others based on nothing.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You’re legit a child. And you can’t show where I replied on a different account because it didn’t happen. I have a few reasons to believe you use alts though. Pretty much everything about you is projecting bullshit. Get your shit together dude, you’re a mess.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I downvoted your first “ok boomer” comment and now it’s back at one. Not for a second do I believe someone read this far and upvoted you saying that in a thread from yesterday. I simply can’t believe that. \n\nYou actually upvoted yourself with your (possibly one of many?) alt... holy fucking shit man. Can’t even take one downvote. Lmfao. So damn pathetic. Without a doubt you’re the saddest person I’ve seen on Reddit in a while and that says so damn much about you. \n\nI just downvoted you again for this post, let’s see if you do it again (not that it matters, my opinion of you is set in stone now). You are transparent as fuck and fooling nobody.\n\nNow lets have a man to man for a second, despite really disliking you and despite what you think of me, I care a lot about people. I have anxiety too, which based on your name I imagine you have a big problem with it too. This simply is not a good way to go about your life if you want to fix it. Stop being a piece of shit to people who did nothing to deserve it, take that shit out in better ways that are more healthy, because this ain’t it bud. Thinking everyone’s some boogieman out to get you is only gonna make it worse. You have zero proof of me being someone else, and I never responded on a different account (there’s a reason you keep deflecting with the ok boomer dumb shit, because you know you’re wrong). \n\nAnd now I tried being decent with you (while calling you on your shit because you absolutely deserve it), I’m sure I gave you the attention you want because you’re probably some dumbass troll. So follow this up with another “ok boomer” because again, you’re transparent as fuck.\n\nEdit: Holy shit, it was upvoted back to 1 almost right away. Lmao, obvious as fuck dude, Jesus Christ.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Lol, you signed between accounts quick bud. Right around the same time your post magically went back to 1 karma. I must have been on your mind. That’s adorable. But we are done now. I don’t want to associate with someone as fucking pathetic as you. What a mess you must be, I almost feel for you.", "score": 0, "replies": [{"body": "Ok boomer\n\n(Beat ya to it :-D)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Man... I really wanted to be done, but morbid curiosity is a son of a bitch. You, without question, are signing into an alt to upvote your own posts. That is legit fucking madness. Again, I truly feel for you man, something is off in your head. \n\nAnd (hopefully, you are weirdly entertaining) for real this time because you are fucking crazy, bye. And get some fucking help man. A little digging and you obviously have a strong need for others attention. You made a post on an alt account about yourself after all. That’s so damn weird dude.\n\nI know, I know... say it again now you predictable, needy motherfucker. Lol, your ass legitimately check your replies every few minutes. Live that Reddit life!", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "lol, 6 minutes. Impressive. Can I get a 5 minute response time with this one?", "score": -1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "How can I short this entire fucking convo", "score": 1, "replies": []}, {"body": "I like people like you, we’d def get along", "score": 1, "replies": []}]}]}]}, {"body": "Priced in", "score": 70, "replies": [{"body": "Consoles have used AMD forever. AMD will move based on their market share in data centers.", "score": 36, "replies": [{"body": "I also bet that the profit margin is really slim at those volumes.", "score": 6, "replies": []}, {"body": "People have called prices in on everything since the stock was 6$.. I just keep holding and so far I'm up over 300%", "score": 4, "replies": [{"body": "Reverse FOMO", "score": 1, "replies": []}]}, {"body": "And when the new consoles release people will buy them. That’s like saying Apple’s been making phones forever so they won’t make any money on their new generation of iPhones. \n\nYou’re definitely correct that the market to watch for AMD is in the data center sector though. \n\nWith that said, AMD has a lot of hype behind it atm but it’s for reason.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "They extrapolate console sales based on growth rates. Those expectations are priced in as assumptions for stock price.", "score": 12, "replies": []}, {"body": "Because the stock gained 30x price in 4 years", "score": 2, "replies": []}, {"body": "its priced in cause estimations, same as tesla\n\nexpectations are everything", "score": 1, "replies": []}, {"body": "It's priced in because next gen console using AMD is not news.  Would anyone be surprised if sony and MSFT sold a shit ton of consoles in the coming years?  No, it is expected.  Really no news at CES for people like me who closely follow AMD news.  The exact specs were news, but not really surprising.", "score": 1, "replies": []}]}]}, {"body": "all that stuff is old af news. check out the climb over the past few months\n\nu need good financials at this point", "score": 15, "replies": []}, {"body": "They only need to increase their earnings by like 10x to have a reasonable P/E.", "score": 16, "replies": [{"body": "Intc PE is 14. AMD is over 50. Lol. This wanker better beat the meat by triple digit percentage points. And show higher growth in data server chips than intc , which was 19% yoy", "score": 7, "replies": [{"body": "AMD PE is at 261 lol", "score": 10, "replies": []}]}]}, {"body": "Bought amd cpu and gpu  a month ago. It makes me hard", "score": 5, "replies": []}, {"body": "AMD 90C 21/22", "score": 2, "replies": [{"body": "Don't cross the beams", "score": 1, "replies": []}]}, {"body": "if it aint long, it aint strong", "score": 2, "replies": []}, {"body": "AMD Console profit margins are razor thin, that's why AMD always won the CPU/gpu contracts with PlayStation and Xbox cause Nvidia doesn't go after pennies", "score": 2, "replies": []}, {"body": "really nigga", "score": 4, "replies": []}, {"body": "I find it hard to believe that this isn't currently reflected in its price.", "score": 5, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Why are you following this guy around posting essays", "score": 6, "replies": [{"body": "Read the post to find out!", "score": -2, "replies": []}]}, {"body": "bro chill.", "score": 3, "replies": [{"body": "But this is how I chill...", "score": -3, "replies": []}]}, {"body": "Unless you work for Reddit or the NSA, how do you know?", "score": 2, "replies": []}, {"body": "Unless you work for Reddit or the NSA, how do you know?", "score": 2, "replies": []}, {"body": "Why are you following this guy around posting essays", "score": 1, "replies": []}, {"body": "Why are you following this guy around posting essays", "score": 1, "replies": []}]}]}, {"body": "PRICED IN", "score": 1, "replies": []}, {"body": "all OP said is already priced in, so nothing new", "score": 1, "replies": []}, {"body": "all OP said is already priced in, so nothing new", "score": 1, "replies": []}, {"body": "Thoughts on AMD Earnings today?", "score": 1, "replies": [{"body": "Puts. Inversing this post fuck all y’all lmaoooo", "score": 4, "replies": []}]}, {"body": "Partially basing your argument on r/PCMR", "score": 1, "replies": []}, {"body": "Shitty dd. I need hard number projections, not anecdotal evidence.", "score": 1, "replies": []}, {"body": "Wow, super obscure data you got there, are you an insider or something?", "score": 1, "replies": []}, {"body": "Don't stop.... I'm almost there.", "score": 1, "replies": []}, {"body": "So puts? Got it", "score": 1, "replies": [{"body": "How does it feel to lose money week after week", "score": 2, "replies": []}]}, {"body": "PC master race is blue and green team.  AMD is still for peasant plebs.", "score": -1, "replies": []}, {"body": "PC master race is blue and green team.  AMD is still for peasant plebs.", "score": -1, "replies": []}, {"body": "Su Bae is leaving to join Cisco.", "score": -1, "replies": [{"body": "She just got a seat on their board, she isn't leaving...", "score": 4, "replies": []}, {"body": "never blaspheme Su Bae", "score": 2, "replies": []}]}, {"body": "When I was a wee lad I would play those Total War games on my PC. During the opening credit things that you always skip, I remember one of them said AMD and the logo looked pretty cool.  I think it was red and black which I thought was sick af. Cool logo -> Cool Ranch Doritos which is what you eat while waiting for mommy to bring you your tendies..", "score": -1, "replies": []}]}
