{"title": "Tesla!", "selftext": "[deleted]", "id": "eo5obv", "created_utc": 1578929847.0, "score": 21, "upvote_ratio": 0.8, "num_comments": 49, "comments": [{"body": "Brah it's had all the good news in the world in a run away bull market while the fed is fully committed to pumping everything until the wheels fall off\n\nJust buy now and take profits as you go, this train is not stopping for your entry point\n\nWhen this bubble pops, it's gonna pop so either be ready to exit or just take profits. We're undoubtedly going to see this thing skyrocket some more, take a big hit, bounce and then just fucking shit the bed.", "score": 25, "replies": [{"body": "Probably some of best advice I’ve herd here.", "score": 8, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Both comments are the epitome of fomo 🤦🏼‍♂️", "score": 1, "replies": []}, {"body": "That's not what I was saying. I'm saying it's a bubble and it's going to pop with the rest of the market. Get in now while everyone spams Tesla threads with \"stonks only go up\" and take profits as you go. You can't time the market so just get in, go for a ride and don't get greedy - cut quick when we get some turbulence because this bubble isn't going last \"another ten years\" like I've seen morons on here and WSB claim. If you don't get greedy you can make solid gains, you might miss the high point of the bubble but who cares - if you don't be greedy you'll make money.*\n\nI wouldn't buy Tesla for a long term prospect, but that's a separate argument entirely.\n\n*Ok in retrospect this is totally bullshit advice, only do this if you literally could not give a fuck. Just stick to index funds and stay away from speculative shit like Tesla if you want to be responsible.", "score": 0, "replies": []}]}, {"body": "Terrible advice, people should be dollar cost averaging out. Buying now is pure greed and FOMO", "score": 0, "replies": []}]}, {"body": "I waited for a pull back to +- 320 before getting in, now we're at 500. . . \n\nSo the saying of time in the market is better than timing the market comes to mind.", "score": 7, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Yep", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}]}]}]}, {"body": "Yeah man this is happening pre earnings\n\nSo one of two things happen\n\n1.  You hold out and get lucky as earnings are not as good(there is nothing to suggest this is the case) \n\n2. Earnings are as expected- stock may dip a touch, but its going to climb until that day \n\n3.  Earnings are through the roof... Stocks climb 15% at least after close, and you never see this type of deal again. \n\nIm leaning on 3, and spent, what is for me a lot of moeny(Moved half my position in AAPL to TESLA in November and another 5K last week) and if I had more, Id go in again.  I don't think waiting patiently is the smart move.   Even when the AAPL 'bubble' popped in 2013, it was due to less earnings, or in 2011 when Steve died, the shares never got to that low.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I mean, I am not saying its not possible, but I was gonna 'wait for another dip' \n\nI joked with my buddy 'I just need Elon to do something and smoke weed and get drunk with Joe Rogan again' \n\nI didn't bought another 5k at 440  and damn am I glad I did.   I think its safe enough to say, that the company wont be worth less than 70bn again until Elon is dead and in the ground, or something catastrophic happens.  But I know enough to know, this guy is literally at the Smartphone point in automotive: \n\n1.  He looked at the gas powered automobile- Compare it to Land Lines- and saw that it is predicated on a limited resource. \n\n2. Companies have tried for 20 plus years to make a hybrid model  like a Cell Phone, and they just have come short. \n\n3. Musk drops the 'iPhone' of Electric Vehicles, and is at that point where they are getting into the hands of the masses.  It took until the 3g and 3gs phones for AAPL to skyrocket. \n\nI think, in my opinion, you are acting like you want the dip in AAPL before iPhone earnings.  Remember, AAPL grew during some of the worst economic times most of us have every lived through. TSLA has a few things going- people won't stop needing cars, countries are making gas cars illegal without serious luxury tax, and renewable energy is the future.  I look at it like this. You waiting for what a 100 dollar dip? I just don't know if that's feasible in the next couple weeks, and then you have the call everyone is waiting for... that it would appear is going to be big.  Start looking around, we are no longer in a 'oooooo look a TSLA' they are everywhere now", "score": 2, "replies": []}, {"body": "My man, I am sorry bro.  This one backfired on ya", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah im sure when you were debating at 500, that you still should have bought. Its not gonna fall that far again", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I guess we shall see.  But yeah, I am pretty sure earnings was enough to keep it above a 100Bn valuation.  I mean, who would have expected the factory in China that is supposed to be pumping out cars would be closed since 1/25 but, I think it will rally in the next couple weeks once the factory opens, and once model Y's start hitting the road. \n\nBut hey, myabe you are right.   Wait it out, I love that you are trying to come at me when your 'wait' for a drop is still 200+ dollars above the share price you could have bought at", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Lol... you were saying something? Lets see where we are a month from now", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They are still at over a 100Bn valuation, and the original post was at 450-500 a share.  I think the earnings is enough to still say its not dipping that low so the long term wait would still have been beneficial to buy at the time of this post", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "We shall see. Im in at 200-440 a share. And I am holding long for the Semi and such so Im not looking for short term gains on it. \n\nBest of luck", "score": 1, "replies": []}, {"body": "Im so lost on TSLA now, all I know is, whenever you or I does a 'I told you so' like message, it does exactly the opposite of what we expect :)", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well it was at 610 and plemmeting then got to 660 and stopped around 648. So it still did better today than I think we both expected", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah. I dont think we forsaw worldwide pandemic. \n\nIf that had been the ‘dip’ parameter I would have sided with you! And yeah loaded up more", "score": 1, "replies": []}, {"body": "Well I guess your 'world wide pandemic' ace up your sleeve panned out.  Time to load up", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Don’t chase", "score": 2, "replies": [{"body": "Chase? It’s only at its halfway point for 20 times future earnings. Plenty more to go.", "score": 1, "replies": []}]}, {"body": "I also think that prices will be corrected within next 6 months, hence I pulled almost everything out at this point. Don't know, I am a noob, just a gut feeling when I am looking at the charts. Nobody knows, but it should have a limit - it (prices) should be proportional to worls economy, and I don't think economy is growing this muchm hence the conclusion that stocks are overvalued and are expected to go down. Again - this is just my opinion, I am not an expert.", "score": 2, "replies": []}, {"body": "Make sure to buy high and sell low brah!", "score": 5, "replies": []}, {"body": "After last quarter’s report I did think “maybe Tesla could be a good buy anyway” \nBut after the recent run that feeling is gone. I think the ROI of anyone buying now is going to be incredibly low. At least for those that intends to hold long term.", "score": 1, "replies": [{"body": "And I'd love to know where you get that assumption.  TSLA is at 96Bn valuation.  At peak Ford and GM were almost double that.  Combine that with EV's being barely in the market, and TSLA is like the airpods of EV\"s.  They have the best product, a supply issue, and could essentially have 25% of a 10 TRILLION dollar industry before long.  And that is not the only area Tesla is making moves.  They are not just a car company, they are an energy resource company.  Id hardly call a realistic 2-5x ROI low but that is just me.  Did you also think that about AAPL when they hit 700... pre split. Everyone said how bad of an investment that was... well, they have only seen an ROI of triple in the last 5-6 years. \n\n\n\nHell even if they cap out at a 500M valuation, you make 5x profit buying right now.", "score": 2, "replies": [{"body": "Yes. That could happen to tesla, but just because it could happen does not mean that it ought to happen.  \nRight now. Even if analysts incredibly optimistic estimates holds true we are looking at an earnings yield of less then 1% (forward PE is 107). Even if they somehow manage to get to 25% market share you are looking at a PE of 15 looking at the profit margin estimated by analysts.  \nAnd how long is that going to take?  \nEven if they got there in just 10 years, which would be unheard of you are still looking at a time horizon of 25+ years, and tesla is diluting shares at a rate of 10% per year. If they are going to expand so fast they will have to keep doing that, or even ramp it up. So after those 10 years, you will only own 1/3 of the earnings you used to. So now you are sitting on a 10 year forward PE, assuming that tesla has 25% of the market share of just under 24.  \nBased on those numbers most of your return will come from people that are willing to pay even more for those earnings then you are.  \nAnd I just considered the best-case scenario.\n\nDon't get me wrong. The high Forward PE is not the problem. It is the earnings potential. I was willing to pay 766 times earnings for scatec solar, but they produce sales of 175million USD a year, in a market that is set to double in size in the next 10 years, and based on factors I won't get into here I think they could see eps growth of 40X (they had a few things lowering earnings these past quarters)  \nTeslas problem is even if everything goes right it still not that great of an investment. It's okay, but it is not going to make its shareholders rich.", "score": 2, "replies": [{"body": "Your last sentence is where we disagree. I think TSLA could easily be with 5x its current valuation in less than 5 years. Could be 20x. Fail to see how thats just okay. The valuation of it right now is nothing. But I guess we will se 1/29. Im predicting a big number indicating a lot of cash. I went all in on AAPL at 27$ pre split, and I see a similar growth trajectory here even at 1/3 the success its a 5x profit", "score": 2, "replies": [{"body": "Maybe you are right. It will be interesting to see what happens, but I am staying out of it, buying into hype is just not my style.", "score": 2, "replies": []}]}, {"body": ">Teslas problem is even if everything goes right it still not that great of an investment. It's okay, but it is not going to make its shareholders rich.  \n\nIf you invested any money when you made this comment, you have earned ~300 a share.   So Id say your assessment was a little misguided", "score": 0, "replies": [{"body": "If you had invested in AMD in 1999 you would have made 500% in one year. Then promptly lost everything again. I think Tesla at 300 was a better investment then AMD was back in 1999, but my point stands. Tesla has gone up, not because the business got better (it did get better, but not 100%, but because the stock is all the hype right now. If I could see the future for Teslas stock I would have called it a great investment, but I can’t see the future, and Tesla looks like a high risk low reward investment. \nSo I stand by what I said about Tesla back at 300.", "score": 2, "replies": []}]}]}, {"body": "And to answer your question regarding pre split apple. No, I wouldn't have called you crazy then. At the time they had a PE ratio of 14.5 and they had a history of consistent growth profitability, wasn't selling shares, had a much stronger business model, in a growing industry, with a stronger balance sheet.  \nIn 2014 apple was in every way a better company to buy then tesla is now, and it shows since their Diluted EPS has grown from 6.5 to almost 11.8.", "score": 1, "replies": []}]}]}, {"body": "A better reentry? That implies that you know where the price is going.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Sure, the price fluctuates daily though. It's lower than what it was except when it isn't. It may NEVER go back under today's price and we have no way of knowing. If you think it's a good buy then get in. Timing the market is just gambling and you don't need anyone's help to do that.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "How much would it have to drop for you to buy in?", "score": 1, "replies": []}, {"body": "\"May\" was the keyword. It's a gamble either way, but I'd just say don't take for granted that it will fall. Go back a few years in these subs and look for any tech stock discussion.", "score": 1, "replies": []}]}]}]}]}, {"body": "The short squeeze is far from over. It's why it burst through 500 the way it did...short sellers had stops in at 500 and when it broke that the buying got triggered...I'd imagine 550, 600, 700 will prolly play out the same....it was rangeboumd between 180-400 for like 4 years. Once a stock breaks out of that range, the longer it was rangebound the bigger the move in the direction of the breakout. \n\n800-1000 easy. With short covering, good news and fomo...I don't see much downside...not to mention cash stockpiles being near all time highs and the measly 10 year", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I agree...but I do believe the breakout will be huge", "score": 1, "replies": []}, {"body": "Any questions? Lol. \n\nIn the past 5 years Tesla’s revenues have went from 5 billion to over 40billion. Ron Barron was just on squak box explaining this. So while the stock price went sideways the last 4-5 years the revenue increased 8 fold. \n\n3000$ would be a target price if you just expected for the stock price to reflect the growth the company has achieved. \n\nI sold half my position when it hit 600 and totally regret it now. I won’t sell again until I retire. The price now only reflects the car business and musk has stated a bunch that in the future other parts of the company could be just as big or bigger (batteries, AI, fleets, solar roofs, etc)", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Bad news and it dropped 100$ lol. \n\nI think buying the dips is even hard at this level. I’ll keep what I own and watch what happens. There’s plenty of places to make money in this market.", "score": 1, "replies": []}]}]}]}]}, {"body": "In twenty years you'll wish you bought yesterday today and tomorro....buy and hold this ducker for your kids sake", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I changed my position on tsla. Sold everything today.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm a fairly passive investor so I haven't been paying attention to the EV market too much. \n\nI've now noticed more SUV EVs coming to the market. Once manufactures from Ford to Mercedes rolls out their SUVs I can see less demand for Teslas sedan.\n\nI've also seen that Toyota is rolling out their line of new EVs and will be available in China this year, and they're already a popular carry manufacturer in China. China, who also has a big SUV market.\n\nI might just move this money into Toyota Motor.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Someone punch me in the face so I can feel better.\n\nBtw, still waiting on the dip?", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm with you on this one. Don't buy now after this bill run that happened so quick. I'm sure a lot of investors will take profits now and then it'll be a good entry point with a fair value. Buying this stock right now after it hit multiple ATH is a no brainer.", "score": 1, "replies": []}, {"body": "You don’t time markets, if you believe in it then slowly add to your position over time. You gotta look at your time horizon", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You still waiting on this one?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I guess. People told you that a week ago that you would never see the gains... they were wrong.  Earnings call next Wed, while a risk, could be suicide to wait...", "score": 1, "replies": []}]}]}, {"body": "You’ll get your chance.  I’m predicting Summer of this year they’ll start missing deadlines as they shift gears to fulfilling Semi (NOT Cybertruck) deliveries.", "score": -1, "replies": [{"body": "Jim Cramer is this you?", "score": 2, "replies": []}]}]}
{"title": "AMD Earnings 29th January 2020", "selftext": "[deleted]", "id": "enw8vl", "created_utc": 1578875287.0, "score": 55, "upvote_ratio": 0.86, "num_comments": 76, "comments": [{"body": "Sounds like you know what you are doing", "score": 50, "replies": [{"body": "[deleted]", "score": -18, "replies": [{"body": "The P/E ratio is only 252, cant see how gearing into this could go wrong", "score": 12, "replies": [{"body": "It’s gone up 60% in 3 months and this guy wants to yolo on earnings 😂😂😂", "score": 8, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Me and my 14 $AMD calls will be watching 😉  \n\nThe only thing I'm worried about, is Q4 earnings might be premature for when it takes off.  \nWhat's the time frame for CFDs, similar to options with a chosen date or?", "score": 1, "replies": [{"body": "No it's basically a pure derivatives long or short with margin you hold as long as you like", "score": 2, "replies": [{"body": "Well you should be golden then!", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -5, "replies": [{"body": "You've already dropped your bet by $150K... screenshot tomorrow or ban!", "score": 10, "replies": [{"body": "I will buy just before earnings chill lol.", "score": 3, "replies": [{"body": "IV crush is a real thing", "score": 2, "replies": [{"body": "Shhh no one tell him", "score": 7, "replies": [{"body": "I remember the first time I got pegged by IV", "score": 3, "replies": []}]}, {"body": "I'm trading CFDs boi", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Riced in", "score": 34, "replies": [{"body": "House fried riced in", "score": 10, "replies": [{"body": "It's fly lice gweilo!", "score": 5, "replies": []}]}]}, {"body": "AMD up to $55 by EOM", "score": 9, "replies": [{"body": "Intel in shambles, drunkenly mutters ‘those bastards’ when interviewed", "score": 12, "replies": [{"body": "They boomed us.", "score": 8, "replies": []}]}]}, {"body": "Not even making a joke bro, don’t do this. Nike beat earnings by sooooo much last earnings report but because of there high PE ratio, the stock fell anyways. I’m sure it will be the exact same scenario for AMD. Don’t listen to the trolls saying you’re doing this for attention. If you think it’s a good bet play the game but my advice is to not become a massive gambler like this. Like Warren Buffet says, “only invest what you can lose!” If this amount of money is insignificant to you, just YOLO it and it might pay off. I just think it’s a smart choice to not YOLO all your money. If you want a good YOLO play though that will probably pay off, buy AIMT. This Friday is their PDUFA date and there most likely going to get FDA approved. The money you make off of AIMT then will be good enough to also YOLO $250K into AMD. Take my advice and you’ll be freaking rich with tendies all over!", "score": 26, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Trust me AIMT is going to the freaking moon. I have my whole account YOLOd which isn’t very much but it’s a bet!", "score": 6, "replies": [{"body": "I'm actually curious about this. Just did a little looking into them and is something driving their 10% drop since the start of the year?", "score": 3, "replies": []}, {"body": "when is this happening? ive been holding calls for like a month now", "score": 3, "replies": []}, {"body": "tell me more", "score": 2, "replies": []}]}, {"body": "Did you take my advice? If you did you should be on the freaking moon today!", "score": 2, "replies": [{"body": "Lol i don't take advice from wsb lol", "score": 1, "replies": []}, {"body": "Wait i don't at all if i don't know the logic or strategy you use and understand it I won't wager real money 💰", "score": 1, "replies": []}]}]}, {"body": "Already priced in broski", "score": 4, "replies": []}, {"body": "Warren Buffet to WSB is Neil Degrass Tyson to Flat Earthers", "score": 2, "replies": []}, {"body": "Thanks for the DD. Up 5% already.", "score": 2, "replies": [{"body": "Oh my gosh you have no idea how much I’m up", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "To late. I already sold my position.", "score": 1, "replies": []}]}, {"body": "What's the next YOLO move? 😁", "score": 2, "replies": [{"body": "AAPL calls and debit spreads. Literally cannot go tits up. It’s just free money.", "score": 1, "replies": []}]}, {"body": "12% for me now", "score": 1, "replies": []}]}]}]}, {"body": "Just look at historical data. AMD normally tank at ER and then bounces right back. Just buy calls after the dip.", "score": 5, "replies": [{"body": "I'm using cfds not options", "score": 2, "replies": [{"body": "Are you not in the US? CFDs are illegal here.", "score": 2, "replies": [{"body": "Not illegal in the UK, hell I'm primarily trading CFDs, half decent returns if you're not fucking retarded", "score": 3, "replies": []}, {"body": "In the UK", "score": 3, "replies": []}]}]}]}, {"body": "Are you lonely and need attention?", "score": 4, "replies": [{"body": "Should've kept the flair set to shitpost", "score": 5, "replies": []}]}, {"body": "lol, I'll be selling 5% OTM puts on AMD each week this month.", "score": 5, "replies": [{"body": "WCGW", "score": 5, "replies": [{"body": "They get shares to sell call against wooo", "score": 4, "replies": []}]}]}, {"body": "Do not do this.", "score": 4, "replies": []}, {"body": "Apple and AMD announce on the same day.  I think something is up.", "score": 3, "replies": []}, {"body": "**This is just the estimated day they will release earnings**. Don't count on it. AMD will likely announce the exact day this week.", "score": 3, "replies": []}, {"body": "GUH.", "score": 2, "replies": [{"body": "YUH", "score": 3, "replies": []}]}, {"body": "You gonna yolo on a stock during it's ER while it is at ATH with a PE of 250? Jaysus man, just Venmo me your money instead", "score": 2, "replies": [{"body": "Nah the 20:1 margin on cfds is looking too sweet man all i want is a 4%+ movement", "score": 3, "replies": []}]}, {"body": "lets hope its puts otherwise good luck", "score": 2, "replies": []}, {"body": "Is this announced or the estimated date?", "score": 3, "replies": [{"body": "Announced i'm not sure what time but it's 27/28th for the uk it 3pm EST 27th", "score": 3, "replies": [{"body": "I can't find this info.\n\ncan you link please?", "score": 3, "replies": [{"body": "https://finance.yahoo.com/calendar/earnings?symbol=AMD", "score": 1, "replies": [{"body": "I'm pretty sure thats still the estimate date.\n\nAMD still didnt announce it.", "score": 3, "replies": [{"body": "Ok", "score": 1, "replies": []}]}]}]}]}, {"body": "January 35th at 27:30PM Central", "score": 4, "replies": []}]}, {"body": "Deviced in", "score": 1, "replies": []}, {"body": "I thought CFDs were illegal in the US?", "score": 1, "replies": [{"body": "I'm in the uk", "score": 1, "replies": [{"body": "My bad I miss read the part about robinhood", "score": 1, "replies": []}]}]}, {"body": "AMD earnings are now more Holy than Christmas", "score": 1, "replies": []}, {"body": "What platform are you using OP?", "score": 1, "replies": [{"body": "Metatrader 5", "score": 1, "replies": []}]}, {"body": "bro i'm serious when I say this: the price for $AMD is going to drop after this earning report, basically no matter what. \n\n&#x200B;\n\nThe price of the stock is way past it's actual value, and the bulls just keep charging in with FOMO. At earnings, which Mama Sue Bae said herself would \\[paraphrasing\\], \"be a great quarter, with record setting earnings... but guidance for the 2nd half of 2020 is going to be lower. \n\n&#x200B;\n\nI don't know a lot, but I do know that the dumb asses buying stocks aren't smart enough to look 3 quarters in advance. The price could hold at $40, go to $60, or remain at $50. stonks go up and down, you cant splain that.", "score": 1, "replies": []}, {"body": "great way to become a mod", "score": 1, "replies": []}, {"body": "[deleted]", "score": -12, "replies": [{"body": "I'm a PC", "score": 3, "replies": []}, {"body": "AMD was being explored as chips for Apple as well. They’ve used their gpus in the past. MSFT and Sony are also coming out with new consoles that will use AMD gpus. Google Stadia and MSFT also want to use their products for cloud computing.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I think he comes off a little hard on amd, but the sentiment is right for business users.\nEnthusiasts are invested enough, because it's what they LOVE, to learn about every single new development in computing. \nSo amd is the obvious choice. \n\nBusiness users. I applied for a sales job of servers as short term gig and found out that my knowledge of servers and pcs was USELESS for selling them. That was a huge reality shock. \nThat was not part of the sales process of knowing the specs, benchmarks, etc. \nIt's an uphill climb for amd. Just because the specs are highly in their favor, doesn't mean the Joe (or actually at the company I applied for it's 70% women or so. Turns out it purchasing people like to buy what women are selling... And will call just to chat.) will be selling it, and that the types buying are also enthusiasts with their own home servers.\nLast computer scientist I talked to doesn't even own a pc, never built one, and believes himself to be a complete expert in everything pc related and told me that he can't tell me anything about the servers he uses, but insisted his knowledge about servers was top notch, because he works with them in the room. That's the person that will then be making the purchasing decision.  They have zero incentive to keep up with server level computing...\nMan couldn't even name supermicro....", "score": 2, "replies": []}]}]}, {"body": "Too bad you’re getting downvoted, but I agree with you.\nAMD is still very niche, everyone is still on Intel with Nvidia GPU.", "score": 0, "replies": []}]}]}
{"title": "$AMZN earnings - expect 🚀 to 🌕", "selftext": "If we look at other FAANG stocks, their growth has been incredible other the past 2 quarters, and for some reason Amazon is falling way behind. It has stalled, but for no good reason. \n\nFacebook: $182 -> $220 (~23%)\n\nApple: $224 -> $311 (~45%)\n\nAmazon: $1,777 -> $1,890 (~7%)\n\nNetflix: $266 -> $339 (~30%)\n\nGoogle: $1,209 -> $1,435 (~20%)\n\nExpect $AMZN to catch up on their earnings (estimated 30th Jan).", "id": "eo684w", "created_utc": 1578932246.0, "score": 99, "upvote_ratio": 0.95, "num_comments": 83, "comments": [{"body": "[removed]", "score": 192, "replies": [{"body": "Solid DD by WSB standards tho. I rate 4/20.", "score": 61, "replies": [{"body": "Or if you reduce said fraction to its lowest denominator 6/9", "score": 21, "replies": [{"body": "Math is easy", "score": 6, "replies": []}]}]}, {"body": "Great analysis Booger McFarland", "score": 20, "replies": [{"body": "[removed]", "score": 11, "replies": []}]}, {"body": "funny.  no reason given other than he thinks amzn should catch up...", "score": 3, "replies": [{"body": "https://www.reddit.com/r/wallstreetbets/comments/ewcax2/amzn_up_10_in_aftermarket_crushes_earnings/", "score": 3, "replies": [{"body": "My fucking dude", "score": 1, "replies": []}]}]}, {"body": "https://www.reddit.com/r/wallstreetbets/comments/ewcax2/amzn_up_10_in_aftermarket_crushes_earnings/", "score": 3, "replies": []}, {"body": "dont put me on blast but what is DD?", "score": -6, "replies": [{"body": "Darkest Dungeon is a role-playing video game developed by Red Hook Studios and published by Merge Games. It also tells you which stonks will go up and which go down", "score": 15, "replies": [{"body": "So ALL of the stonks? Since stonks only go up.", "score": 1, "replies": []}]}, {"body": "Double derivatives", "score": 12, "replies": [{"body": "thank you!", "score": 8, "replies": [{"body": "Not one person has told you the real answer.", "score": -4, "replies": [{"body": "Nerd", "score": 12, "replies": [{"body": "you mean autist", "score": 1, "replies": []}]}, {"body": "pretty sure dd means due diligence when speaking of stocks.. not sure if it's the same with options", "score": -5, "replies": []}]}]}]}, {"body": "Nobody tell him", "score": 7, "replies": []}, {"body": "Diligent dick.", "score": 12, "replies": [{"body": "Dangerous dickin'", "score": 5, "replies": []}, {"body": "hahahah well I would sarcastically be a DD", "score": -1, "replies": []}]}, {"body": "Donkey Dong  \n\n\nConsider yourself put on blast", "score": 4, "replies": []}, {"body": "Daily discussion\n\nMods will hit me with the Hammer of Ban™ for teaching you the truth so keep it lowkey asf", "score": 2, "replies": [{"body": "THANK YOU!", "score": 0, "replies": []}]}, {"body": "Due Diligence. Ie. actually looking at a companies fundamentals to determine over/undervaluation.", "score": -7, "replies": []}, {"body": "Due diligence", "score": -7, "replies": []}]}]}, {"body": "Maybe people are finally filled to the brim with junk. I know I was using amazon much more in the past than I do now. I just have everything. All I buy now are futanari horse milfs.", "score": 86, "replies": [{"body": "Thought you were trolling till I saw the end. Puts it is", "score": 28, "replies": [{"body": "> futanari horse milfs   \n>  \n> Puts  \n\nLmao idiot doesn't know how expensive those niche sex toys are, **calls all the way**", "score": 17, "replies": []}]}, {"body": "Fuck I just googled that on my work computer", "score": 12, "replies": [{"body": "IT guy goin' be 'bating", "score": 18, "replies": []}]}, {"body": ">  I just have everything.\n\nI don't. And I've just started buying!", "score": 1, "replies": []}]}, {"body": "I bought 144 cup o noodles today for $55 from amazon. To the moon.", "score": 38, "replies": [{"body": "Is this insider trading", "score": 48, "replies": [{"body": "Yes. You are going to jail now.", "score": 27, "replies": []}]}]}, {"body": "Amazon moons when fractional shares become mainstream. All the autistic retards will flock to these high value stocks for no reason other than they can afford to buy it now.", "score": 47, "replies": [{"body": "Fractional shares have been mainstream for like 20 years or am I missing something", "score": 25, "replies": [{"body": "They are in the sense that most platforms now offer them without getting them from a DRIP. But it's still relatively new and a lot of people probably still aren't aware you can buy them.", "score": 8, "replies": []}, {"body": "I thought so. I ‘owned’ a fractional share of disney when I was younger and would receive a few cent check every year in the mail.", "score": 3, "replies": [{"body": "*opens RobinHood account*\n\n\"Aaaaaand it's gone.\"", "score": 7, "replies": []}]}]}, {"body": "Why don't people just buy the whole shares? I just picked up 5 last week.", "score": 0, "replies": []}]}, {"body": "It hasn’t grown since Microsoft azure is taking some of aws ‘s business", "score": 17, "replies": [{"body": "This is the real answer. This and wallstreet always shits itself when amazon is doing CapEx. Currently it’s their 1-day in house delivery network. Last time they did something like this (building all those local warehouses and giving up on Sales Tax avoidance) Wall Street was similarly cool on amzn. \n\nGive them another 2 quarters to slow down the cash burn and let AWS make more money and it’ll rocket right back up.", "score": 11, "replies": [{"body": "no one actually needs 1 day delivery", "score": -6, "replies": [{"body": "I’m sure people said that about 2-day...", "score": 9, "replies": [{"body": "If it wasnt free shipping, i bet you most people wouldnt chose the 2 day option, because most times they dont actually need it delivered in 2 days.", "score": -2, "replies": [{"body": "Literally their entire business model for the last 5 years and billions of growth proves otherwise.\n\nThis has to be one of the worst takes ever, considering how their is data people enjoy 2 day and 1 day. You’re 100% wrong and you are trusting your gut.", "score": 7, "replies": [{"body": "For real man. You think Walmart invested hundreds of millions to catch up with Amazon on 2-day shipping because they thought it would be cool? What a bad take.", "score": 6, "replies": [{"body": "He bet that if Amazon Prime took away 1 or 2 day shipping no one could care.\n\nI would pay like $100 to see the eternal shit storm that would occur with Bezos announcing that.\n\nHe should be banned for how idiotic that take is.", "score": 1, "replies": []}]}]}]}]}, {"body": "“Need” and “want” are different things.  People will pay for both.", "score": 1, "replies": []}]}]}]}, {"body": "!remindme 22 hours", "score": 5, "replies": [{"body": "What are you a fucking goldfish?", "score": 21, "replies": [{"body": "yes", "score": 4, "replies": []}]}, {"body": "https://www.reddit.com/r/wallstreetbets/comments/ewcax2/amzn_up_10_in_aftermarket_crushes_earnings/", "score": 1, "replies": [{"body": "thank you", "score": 1, "replies": []}]}]}, {"body": "Picked up some spreads last week r/r= 2000/34000. So far I'm down but a moon ride will be nice. Speaking of moon check out $spce", "score": 4, "replies": [{"body": "What's your position? Aside from missionary with your Amazon Basics© blow-up wife.", "score": 9, "replies": [{"body": "3@ 14 Feb, 1880/1870c\n4@ 21 Feb, 2130/2090c\n4@ 20 mar, 2130/2090c\nThe way otm are crazy r/r. \nAccording to my ta the mar one might pay off. If there is a earnings/trade deal run up my Feb 21 might pay out. Any gain would be nice.", "score": 3, "replies": [{"body": "Thanks! I like to see how people approach spreads, especially on higher priced underlyings. Good luck!", "score": 1, "replies": [{"body": "I also trade amzn naked. Though it's cold and I'm in my PJ's still lol. Amzn was my bitch for awhile tell I started searching for patterns to spot breakouts. Chasing trends is nice but I like to find head and shoulders. Pcg,nok, cgc are a few I'm bullish on.", "score": 3, "replies": []}, {"body": "If you copied my trade you just made a bunch! I hope you did! Good luck", "score": 2, "replies": [{"body": "Fuuuuck. No. I didn't even if pay attention to AMZN's earnings. Got that delayed FOMO. But congrats on the wins! Fuckin crazy move.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I couldn't find this, link?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That doesn't say anything about buybacks. Bezos doesn't like them and hasn't done it for 7 years...", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Since when has Bezos ever been concerned with returning value to shareholders? He isn't some CEO whose compensation is dependent upon the share price.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes, and he doesn't give a fuck about share price.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Your logic is flawless so I bought 2 which is my entire live savings.", "score": 2, "replies": []}, {"body": "When are they announcing earnings?", "score": 2, "replies": []}, {"body": "Doesn’t amazon traditionally never beat in Q4? I think every single year they’ve just met the middle of the guidance window.", "score": 2, "replies": [{"body": "Amazon to $5k bc I read this", "score": 1, "replies": []}]}, {"body": "Amzn spends more than they earn so theyve been missing. Spending like it's 2006\n\nThursday. After hours. Nopee", "score": 1, "replies": []}, {"body": "I don't have a car and literally live off amazon prime and amazon fresh. Amazon to the moon confirmed.", "score": 1, "replies": []}, {"body": "Why the Drop today?", "score": 1, "replies": []}, {"body": "Its too \"expensive\", it'll be flat on every earnings, and slowly go up or down based on the market", "score": -2, "replies": [{"body": "Sell calls then", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "AntiTrust is priced in", "score": 1, "replies": []}]}, {"body": "AMZN is too expensive of a stock. Stonks are <1,000 a pop", "score": 0, "replies": []}]}
{"title": "TSLA anal-yst clownery?", "selftext": "A few days ago: \"Ben Kallo, a Robert W. Baird & Co. analyst...raised his [TSLA] price target to $525, from $355.\"\n\nToday: \"Tesla stock price target raised to $612 from 385 at Oppenheimer\"\n\nSupposing one didn't think so already, how strong evidence should raising PTs by 48% and 59% respectively in one jump be taken to be that analysts are herd-following ass clowns?", "id": "eo6oyf", "created_utc": 1578934281.0, "score": 92, "upvote_ratio": 0.93, "num_comments": 80, "comments": [{"body": "When will people realize these analysts are nothing more than financial bloggers.", "score": 156, "replies": [{"body": "It's not the analysts per se. It's the idea that anyone can predict this shit consistently and accurately enough to get paid a salary just for their opinions. It's just not the case. \nHonestly I think analysts only exist to put upward pressure on the market in general. They're part of a self-reinforcing bull cycle, assuming anyone listens to them and trades on their targets.", "score": 41, "replies": [{"body": "Yep. If anyone could consistently outperform the market they wouldn't be providing their recommendations for free on TV. It's like my mom used to say: \"Never trust anyone who went to business school.\" They're salesman masquerading as scientists. They provide nothing of value to the world. Only extract from the stupid and ignorant. I think the only person who has demonstrated a true ability to outperform the market over the long term is Warren Buffett and he's able to do a lot of stuff ordinary schmoes like us can't. Plus his predictions are basically self fulfilling prophecies at this point. Just the mere fact that Buffet is interested in a stock is enough to make it go up.", "score": 14, "replies": [{"body": "More than just Buffet. Michael Burry did it for 6 years, Jim Simons has done it for over 30. Buffet is just the longest running.\n\nStill, these people are one in a million. And they're not professional analysts, they run companies/funds.", "score": 12, "replies": [{"body": "if you have 1,000,000 people running investment funds, 1 (plus or minus your normal-variance) of them will end up looking with your 1/1MM world-beater candidate every time. And that man, who won by chance, would also be convinced he had the skill. Any you could never convince him otherwise.", "score": 5, "replies": [{"body": "I hate the word \"skill\" used to describe investors.\n\nIt's not skill. It's not something you learned or trained for, like fixing an engine. It's not a scientific, repeatable, consistent process like that. If it could be taught like that, the way you have standardized teaching for fixing an engine, any school that taught it would be absurdly expensive and have an endless stream of applicants.\n\nIf anything, strategy is a more accurate term. Or instinct.", "score": 2, "replies": [{"body": "Gambling. It's gambling.", "score": 1, "replies": [{"body": "Well according to Google there are two definitions of gambling\n\n1. play games of chance for money; bet.\n\n2. take risky action in the hope of a desired result.\n\nIt's not #1 unless you're receiving a premium or paying one, ie. Zero sum game. It's #2, but that's such a broad definition that going to college is gambling, asking for a promotion is gambling, having a child or getting married is gambling.. basically any major life decision would be gambling. I don't think that's consistent with the moral ideas we have about gambling as a behavior.", "score": 1, "replies": [{"body": "Huh almost like one word encompasses a range of similar things.", "score": 1, "replies": [{"body": "Sloppy language molds sloppy thinking.\n\nA definition should be broad enough to be meaningful/applicable, yet narrow enough to be.. well, meaningful/applicable.\n\nIdk I think \"anything that involves risk with an expected reward\" is too broad for the same word used to describe playing a rigged casino game, since it would then include... basically everything humans do.", "score": 1, "replies": [{"body": "the word you were looking for is \"moulds\" you pedantic retard", "score": 1, "replies": [{"body": "This might be the most ironic comment I've ever seen lmao. Corrected my spelling on one word, completely ignoring my point, and calls me pedantic. Holy hell hahahahahahaha\n\nNothing I said was pedantic. I'm just going Socratic on your hyperbolic bullcrap and you don't like it, either because I'm trying to make you think, or because of ego or whatever.", "score": 1, "replies": [{"body": "you can say bullshit, no one will put you in timeout", "score": 1, "replies": [{"body": "I swear like a damn sailor, I actually have no idea why I went all altar boy there.\n\nAnyway, read my argument and give an actual response, the spelling error is really not that significant.", "score": 1, "replies": [{"body": "I gave that response cuz I didn't find the point particularly salient or interesting.", "score": 1, "replies": [{"body": "Here's something salient: investing isn't gambling, not if the word gambling is to have any distinct meaning separated from normal risk-reward optimized behavior, the above comments of mine are my argument as to why.", "score": 1, "replies": [{"body": "options are gambling change my mind", "score": 1, "replies": [{"body": "Options 100% are gambling. It's not even debatable. Of course most options buying, in terms of volume if not per capita (institutions dominate the market), are hedging a larger equity position. They treat it like.. insurance. So I don't consider that gambling. But people who are making \"bets\" with options, yeah, it's gambling.\n\nBut I also don't consider leveraged speculation through options to be investing. I see them as two very different risk-reward scenarios, motivated by different psychology.", "score": 1, "replies": [{"body": "See what I meant about these not being interesting takes?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "There is no skill. Just insider information", "score": 1, "replies": []}, {"body": "My above comment notwithstanding, I don't believe in the efficient market hypothesis, or at least not in strong-form. There definitely are people who have managed, and it wasn't by luck alone. Nobody has 30 straight years of 30%+ gains like Renaissance has had, by pure luck. If skill isn't the right word for it, I don't know what is, and if it was just insider info, they would've been busted by now.", "score": 1, "replies": []}]}]}, {"body": "I went to business school and feel attacked.", "score": 3, "replies": [{"body": "100+k later. Reputable degree. Gets bullied online.", "score": 15, "replies": [{"body": "\"arguments that karma is real for 100 bob\"", "score": 1, "replies": []}]}, {"body": "The Virgin business school vs the Chad economics degree", "score": 1, "replies": []}]}, {"body": "Tipranks.com rates analysts based on all their predictions.", "score": 1, "replies": []}]}]}, {"body": "Seriously, going from 355 to 525 is a pretty clear indicator you have no idea what you're talking about. It's like a weatherman revising his prediction from blizzard to sunny and 70.", "score": 16, "replies": [{"body": "And I forgot to note that almost nothing materially changed since late October (Q3 results & conf call). I mean, freak things can happen to weathers and companies, but the TSLA news since then has been at, or even slightly below, Tesla's plans/guidance", "score": 3, "replies": [{"body": "Yeah, literally nothing unexpected has happened. We thought it was priced in, but then, whaddaya know, it wasn't. But now is it all priced in? It seems like it. But maybe only the past and the present is priced in, and since Tesla is the future, we have to price that in too. My new price target is $690, best of luck.", "score": 1, "replies": []}]}]}, {"body": "They should try double tasking as analysts and therapists. Could call themselves anal-rapists", "score": 2, "replies": [{"body": "[Analrapist](https://gifer.com/en/LgK)", "score": 2, "replies": []}]}, {"body": "Don't people just read the reports to understand what the company actually does and get some insight. Probably every one knows price targets are dog shit", "score": 1, "replies": []}]}, {"body": "I'm surprised people are still surprised\n\nHere's how it works\n\nStock rises > first analyst raises price target so he's not too wrong > stock rises more > other analysts follow > etc\n\nworks both ways", "score": 47, "replies": [{"body": "If you watch the behavior of analysts you'll also notice that as soon as a well-respected/well known analyst issues a revision, the others covering the same stock will anchor their new view very closely to his, +-5% or so.\n\nThere is heavy reputational and job security pressure to hang with the crowd. Your boss is less likely to single you out if you're wrong when everyone else was also wrong. It discourages independent research, which is the whole reason analysts supposedly exist.", "score": 13, "replies": [{"body": "Yeah I agree\n\nThe only analysts I respect are the ones considered nuts by everybody like the ones at ARK. At least they try and think out of the box\n\nBut what I'd say is that 90% of people on wall st are useless: traders, analysts, CNBC, etc. Noone is providing any kind of value or insight into anything. It's just about spending time doing something it seems.", "score": 7, "replies": [{"body": "I wouldn't go that far. They provide a lot of convoluted value, and it's a pretty meritocratic field honestly.\n\nIt's just.. if I had to connect all the dots to how they provide value to society, it'd be like 5 steps removed and difficult to follow if you don't understand the economic impacts of banking.\n\nTo save time, name a job in finance and I'll tell you what it provides", "score": 1, "replies": [{"body": "> It's just.. if I had to connect all the dots to how they provide value to society, it'd be like 5 steps removed and difficult to follow if you don't understand the economic impacts of banking.\n\nNot taking about banking, just talking about Wall St and the public markets\n\nLet's face it if everyone was investing rationally and that was it, it would be the most boring place on earth and rightfully so", "score": 1, "replies": [{"body": "Wall Street and public markets are technically still banking. Your investments aren't bank deposits, but wall street does a lot more than just speculate. They launch companies to the public financing markets. In fact the bond market is much larger than equity, and that's all credit. Equity though, is still financing for companies.\n\nSo technically, they're helping companies grow.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Morgan Stanley has massive iron balls too but they got them at a pawn shop in exchange for their brain", "score": 1, "replies": []}]}]}]}, {"body": "As long as the tendies roll in I don’t care.", "score": 23, "replies": []}, {"body": "[deleted]", "score": 17, "replies": [{"body": "But it wouldn’t be until q1 end. They already released deliveries for 2019. So if they made less marginal profit it could be bad. Or other bad news. But they probably wouldn’t wait for earnings to announce it.", "score": 2, "replies": []}, {"body": "nah .. ill bail it out with my life's savings.", "score": 1, "replies": []}]}, {"body": "Analysts are in the business of getting their IB branches $$$$ not giving honest opinions", "score": 13, "replies": [{"body": "And yet, analysts' PT changes move markets in the immediate/short term.\nAre IB positions public record (even if below the \"major investor\" % threshold public companies disclose)? Because if so, that should be very interesting to contrast with the respective IB's analyst's price target.", "score": 1, "replies": [{"body": "IDK man I'm a layman, I just know from recently reading Random Walk down Wall St that, while it's gotten better as of late, most analyst ratings are heavily weighted bullish, either due to some soft conflict of interest with wanting to secure IB business or just the simple psychological fact that errbody likes good news and high stock prices, dance while the music is playing and such", "score": 2, "replies": []}, {"body": "This is why I love this sub. You are so confident in your criticism even though you clearly have no idea what an investment bank does. There are no “IB positions”. Google Volcker Rule then go take a few more vaccines.", "score": 1, "replies": [{"body": "Thanks for citing the Volcker Rule. I've always been highly skeptical of that kind of direct conflict of interest claim that one sometimes sees, but didn't know the name of the thing to cite.\n\nFWIW I think you meant to have, or should have, made that a reply to TF_Sally's comment, not mine, because my claim in the O.P. was only \"herd-following\" and my follow up to TF_Sally wasn't an endorsement of his/her IB conflicts of interest criticism (which, to be fair to TF_Sally, he/she seemed to soften subsequently).", "score": 1, "replies": []}, {"body": "There *are* \"IB positions.\" It is called \"proprietary trading\" and the Volcker Rule added restrictions to it, but didn't eliminate it did it?\n\nI can't afford any more vaccines without selling more shares, which I don't want to do because, as you may have heard, stocks only go up.\n\nIn the meantime, maybe you can expand on your \"Volcker\" comment?:  **the Volcker rule is a very recent invention so can't be more than a small part of the explanation** for what we (or at least I) are talking about, i.e. limits on IB \"proprietary\" trading that could otherwise make their public stock picks plainly self-serving. It was not nearly \"anything goes\" for prop trading before the Volcker Rule, so what's the real story?", "score": 1, "replies": [{"body": "Volcker rule isn't recent at all, it's been a decade. Banks have gotten rid of all prop arms that take on any significant amount of risk (i.e. positions) due to it. A well known example is PDT Partners which was spun off from Morgan Stanley", "score": 1, "replies": []}, {"body": "There are a ton of restrictions on how the different departments of an investment bank are allowed to interact (sales & trading, research, and advisory). It’s a mix between FINRA rules (FINRA is a SRO not a government org) and actual government laws. Most rules were passed after the dot comm bubble (equity research analysts were sketchy as hell and actually played a huge role in the bubble) and a few more were passed after 08 (not research fault). \n\nOne of the rules that actually gets followed is research is not allowed to share any non-public info with S&T or Advisory. In this case non-public info is basically when we decide to upgrade/downgrade something which tends to move the market depending on who the analyst is. Prior to Volcker analysts probably broke this rule a lot because their were incentives to do so. Volcker rule removed those incentives. \n\nThe Volcker Rule was passed as part of Dodd-Frank in 2010 and basically made it illegal for banks to trade risky positions. As you may know, in finance, no risk = no reward. Basically banks are no longer allowed to speculate (enter positions with the purpose of making money). \n\nBanks obviously still have trades who most function as market makers who hold inventory and look to get paid based on spreads or commission. These traders basically try to live a net neutral life. They do not give a fuck if a stock goes up or down. All they care about is volatility. That goes for all brokerages in a Volcker world. Read the transcript from the earnings call of any IB and they will talk about volatility and volume nonstop. \n\nThere are a ton of conflicts that still permeate research but the one you mentioned ain’t one of em.", "score": 1, "replies": []}]}]}]}, {"body": "Ehh, it's more that they are about getting the trading desk $$$, while not jeopardizing the relationship the bankers have. The more a bank trades a stock the more likely the company is to issue equity through them, because they know who the buyers and sellers are in the market and how to appropriately price the issuance.", "score": 1, "replies": []}]}, {"body": "TSLA just hit 500 I’m dying", "score": 7, "replies": []}, {"body": "[From last month 😂😂😂](https://i.imgur.com/sGKRMUo.jpg)", "score": 13, "replies": [{"body": "That man is a legit retard", "score": 7, "replies": [{"body": "Not wrong though!", "score": 2, "replies": [{"body": "Ugh. Yeah he is....", "score": 6, "replies": []}]}]}, {"body": "Standard chart.  Pick any stock on your broker site.", "score": 1, "replies": []}]}, {"body": "wow you just figured out something most people have known forever.", "score": 5, "replies": [{"body": "If you mean about analysts being bullshitters, the thing I'm interested in is that **obviously, on the face of it, most (at least retail) investors DON'T know it**, because it routinely (just not entirely reliably) moves stonks for, say, at least a day. I.e \"**It's not priced in!**\" Which could be a chance for me to profit and not just congratulate myself on my superior wisdom. (I'll admit I did think they'd ratchet up their PTs in smaller steps or at leas wait for some *actual significant material fucking change* to rationalize a big jump.)", "score": 2, "replies": []}]}, {"body": "Are you the last person who follows this shit to realize that analysts engage in herd behavior/anchoring?", "score": 4, "replies": [{"body": "I didn't *only just now* realize they do this, no. I *did* think they'd be a little more subtle about it, e.g. ratchet up their PTs in smaller steps or *wait for something to actually materially fucking change*, rel to Corp guidance/forecasts, to rationalize a big jump.\n\nAs for whether every other schmoe investor already knows all of this: the fact that these analyst clowns' pronouncements move stock prices should tell you they don't.\n\nEDIT: BTW I was long to 400 but been eating popcorn on the sidelines since. Maybe shoulda tried to daytrade on the PT revision today but was ~~hungover~~ sleeping.", "score": 2, "replies": []}]}, {"body": "This like telling your girl you gonna hit da pussay and then a minute later you hit da bunghole.", "score": 6, "replies": []}, {"body": "You know these analysts don’t have positions personally.\n\nIf they say PT $10000 or $100, as long as everyone else in NY thinks the same, they won’t get fired.", "score": 2, "replies": []}, {"body": "Did you not realizes this in college during first semester when you were in the intermediate econ class after cuz you skipped the 100-level econ classes with your \"Mr. Big AP Scores Chest\" numbers with the retarded chads, half of whom are now associates at neauveau investment firms, who wanted to do finance, the other half of whom now post self-motivational cryptic messages as LinkedIn statuses, prior to switching to engineering so you couldn't be told by a boomer why your answer is wrong without it actually being wrong?", "score": 2, "replies": []}, {"body": "analysts dont care about u. theyre there to make money. this is the classic example of a fake dump and pump where they scare retail to dump it so they can buy it for cheap and then pump it. analysts dont make money off u, they make money from funds who pay them to write good shit", "score": 2, "replies": [{"body": "Most analysts are not bearish by nature.", "score": 2, "replies": []}]}, {"body": "Haha I said Tesla 530 before earnings.  Tesla 560 before earnings.", "score": 1, "replies": []}, {"body": "It’s me, the TSLA anal yst84", "score": 1, "replies": []}, {"body": "This is classic pump - and - dump.", "score": 1, "replies": [{"body": "On a company with 80B+ cap?", "score": 3, "replies": []}]}, {"body": "They’ll keep making predictions as long as fucksticks like you keep repeating them (even now when you’re making fun of them, you’re still spreading their names and ideas). RESEARCH ANALYSTS ARE PART OF THE MARKETING DEPARTMENT.", "score": 1, "replies": []}, {"body": "hey, they are just trying to safe face because how wrong they were. TSLA $___$", "score": 1, "replies": []}, {"body": "Stock analysts present no tangible value to society.", "score": 1, "replies": []}, {"body": "Analysts are herd-clowning by default. When a stock price gets beaten down they just lower their “peice targets” and vice-versa. If anything I would rather do the opposite of what they say.", "score": 1, "replies": []}, {"body": "Listen.  Thats the game.  ER are coming up, and this will fall lol.  I am not touching it until like the day before ER Though lol.", "score": 1, "replies": []}, {"body": "100% Ass Clowns", "score": 1, "replies": []}, {"body": "This same thing happened to QCOM just before the 2000 crash.  In QCOMs case the villagers would drive the stock to the analysts price in a day or two.  It was insane.  We are getting there...", "score": 0, "replies": [{"body": "wrong TSLA is going to build gigafactory 4 2020 .. stonks", "score": 1, "replies": []}]}, {"body": "They all have puts. They’re propping up TLSA to rack in 100-baggers on the drop post earnings.", "score": 0, "replies": []}]}
{"title": "MSFT the big toddy goth gf", "selftext": "Everyone is talking about battery toy cars or funky wannabe meat. And to be fair theyre the highest market performance right now so it's gonna be constantly spammed on CNBC.\n\nShit like Tesla or beyond meat is equivalent to that hot blonde that in the club that everybody is trying to bang. All the while there's this goth chick with a big sweater hiding them big tits (MSFT) in the corner silently drinking her bloody Mary.", "id": "eoa9xe", "created_utc": 1578949306.0, "score": 305, "upvote_ratio": 0.97, "num_comments": 84, "comments": [{"body": "MSFT is literally free money, just buy the stock and it will give you more consistent gains than any index fund. \n\nYou always always always buy the dip with MSFT and I promise it will never let you down\n\nI've literally been buying MSFT for 6 years, the gains from that alone beats my 401k\n\nMSFT is to Millenials what GE was to boomers", "score": 242, "replies": [{"body": "and a fat div", "score": 78, "replies": [{"body": "Mmmm...  big tiddy dividends...", "score": 30, "replies": [{"body": "Big ass divvies!!!!", "score": 1, "replies": []}]}, {"body": "Billie boy and nutella both have big swinging divs", "score": 17, "replies": []}]}, {"body": "Everyone is a gangasta in a bull market.", "score": 53, "replies": [{"body": "Except pussies who dont invest 🤷‍♂️", "score": 35, "replies": [{"body": "“We are at all time highs I’m just gonna hold cash now” (people been saying that since 2016)", "score": 24, "replies": [{"body": "*Since 2013", "score": 3, "replies": []}]}, {"body": "Bitches", "score": 2, "replies": []}]}, {"body": "\"Errbody got a plan til their 401k gets punched in the mouf\"\n-- Mike Tyson-brand Frozen Tendies", "score": 16, "replies": [{"body": "The plan is to buy more if that happens", "score": 4, "replies": [{"body": "Buy the dip. I’m excited.", "score": 3, "replies": []}]}]}]}, {"body": "Can confirm.", "score": 12, "replies": []}, {"body": "Look at you for having a 401k", "score": 9, "replies": [{"body": "Fucking do it, guaranteed returns* if you work for a company that matches, and it can help your taxes.", "score": 13, "replies": [{"body": "This is WSB, get out of here with that pussy shit", "score": 6, "replies": []}]}]}, {"body": "I'm investing in GE because I think they have good fundamentals...\n\nI just wanna grill for God's sake!", "score": 9, "replies": []}, {"body": "Wow no way bro you made money in a bull market?? Send tips pls", "score": 4, "replies": [{"body": "Everybody can make money in a bull market, but some of us can make MORE money than others \n\nAlso\n\nSend dick pics 😘", "score": 6, "replies": []}]}, {"body": "wait, didnt GE die", "score": 2, "replies": []}]}, {"body": "Bro I have made so much money on MFST it’s a meme at this point. I always say it’s the tiger tank of stocks... it’s slow but nothin gonna stop it.", "score": 96, "replies": [{"body": "Also, in this analogy... AMZN is the slut who is now a born again Christian. She teases but never puts out. But all this repression is making her horny and all the boys are noticing.", "score": 83, "replies": [{"body": "So she's down for anal? Is that a call or put on AMZN??", "score": 40, "replies": [{"body": "Whichever causes you to lose your shorts. She's down, but what she's not telling you is that she got a new harness and wants to top.", "score": 22, "replies": [{"body": "You lost me", "score": 7, "replies": [{"body": "https://en.m.wikipedia.org/wiki/Pegging_(sexual_practice)", "score": 13, "replies": [{"body": "You lost me even more.", "score": 8, "replies": [{"body": "Amazon's finna fuck you in the ass", "score": 35, "replies": []}]}]}]}]}, {"body": "😂😂😂\nI sure hope so\n\nEdit: I realized the first question is vague but the answer to the second question determines who is going on the receiving side.", "score": 10, "replies": []}]}]}, {"body": "How long have you been shorting Medifirst Solutions", "score": 1, "replies": []}]}, {"body": "TSLA and BYND are the hot stripper you DTF but you gonna get crotch burn eventually.\n\nMSFT is the big tiddy goth girl.\n\nAAPL is unicorn.", "score": 49, "replies": [{"body": "I don't follow the unicorn analogy", "score": 7, "replies": [{"body": "A unicorn is a girl you can take home to your girl if your girl down for some group fun. Better situation let your girl find the unicorn always goes better.", "score": 21, "replies": [{"body": "So threesome with AAPL and AMD gotcha", "score": 17, "replies": [{"body": "Na man gotta split it up you dont bring home a blonde if you dating a blonde think outside the box AAPL banging tesla. tessapp cars kinda shit is what you want.", "score": 8, "replies": [{"body": "So who is the redhead in the corner over there?", "score": 4, "replies": [{"body": "Facebook", "score": 8, "replies": [{"body": "Nahh Roku.  She crazy as fuck and you love her for it", "score": 6, "replies": []}]}]}]}]}]}]}]}, {"body": "That girl almost always fucks very well 👏👏", "score": 40, "replies": [{"body": "Made me go lesbian", "score": 5, "replies": []}]}, {"body": "Microsoft makes my micro hard", "score": 29, "replies": [{"body": "Too good 😂", "score": 4, "replies": []}]}, {"body": "It's priced in. \n\n\n\nWhy can't you fuck em all tho?", "score": 17, "replies": [{"body": "Cause you only have one dick (limited capital)", "score": 37, "replies": [{"body": "Leverage the shit out of it.", "score": 46, "replies": [{"body": "This is why I come to WSB.", "score": 11, "replies": []}, {"body": "FNGU makes it grow 3x", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Just posted the same play last week for MSFT LEAPS - this is the only way.", "score": 3, "replies": []}]}]}, {"body": "Imagine thinking MSFT is priced in", "score": 10, "replies": []}]}, {"body": "Your analogy really connects with me. I wouldn't touch Tesla or Beyond with a ten foot poll. Microsoft is my second largest position and has been doing great. I also married a woman who used to be goth, and she has enormous tits. And I can't stand normie bitches, even if they are hot. You are onto something here.👍👏", "score": 13, "replies": []}, {"body": "so youre saying long bloody mary", "score": 10, "replies": [{"body": "That's right long Tampax", "score": 12, "replies": []}]}, {"body": "Shh stop telling people about her.  Keep her safe from the autists.", "score": 9, "replies": []}, {"body": "I didn't go to the club for the goth chick though...", "score": 26, "replies": [{"body": "Nah you went for BECKY girls like AAPL, SBUX or PTON", "score": 25, "replies": [{"body": "But you are so horny and won’t leave empty handed", "score": 9, "replies": []}]}]}, {"body": "[removed]", "score": 7, "replies": [{"body": "Hell yeah to actual stonk.\n\nAMD that cute pixie cut geeky girl who occasionally puts out.", "score": 19, "replies": [{"body": "But only for nerds and when I, a chad, come knocking, she runs into a brick wall", "score": 8, "replies": []}]}]}, {"body": "Powerful and insightful DD.\n\nThank you sir", "score": 4, "replies": []}, {"body": "Bought calls this am. Up 22% on the day", "score": 5, "replies": []}, {"body": "I just noticed Reddit moved the mobile comment bar and upvote buttons from right at the conclusion of someone’s post, to the bottom of the screen, and I’m straight up not having a good time", "score": 12, "replies": []}, {"body": " *my boy MFST be making that cash money, hustling erry day*", "score": 5, "replies": []}, {"body": "Yall are forgetting about AYX\n\nbasically the leader in Big Data and Visualization, have been buying since $50 and that shit is still going to the moon", "score": 4, "replies": []}, {"body": "Msft to 200 OR a split by October", "score": 3, "replies": []}, {"body": ">All the while there's this goth chick with a big sweater hiding them big tits (MSFT) in the corner silently drinking her bloody Mary\n\nu have me at goth chick with big tits.", "score": 3, "replies": []}, {"body": "75% of my money is long msft. Never sell, buy any dip. Don't even have to think about it", "score": 3, "replies": []}, {"body": "don't forget the dividends.  I get $800 from them every quarter and DRIP that shit.", "score": 4, "replies": []}, {"body": "calls when?", "score": 2, "replies": [{"body": "any red day above 1%. Or just get 2 months out.  March Calls are printing", "score": 3, "replies": []}, {"body": "All day everyday", "score": 1, "replies": []}]}, {"body": "Dressed conservatively?  Ain't no Latina...", "score": 2, "replies": [{"body": "I don't get it, are we shorting chitpole?", "score": 3, "replies": []}]}, {"body": "We just gonna sit here and ignore apple?", "score": 2, "replies": [{"body": "Yes she's about to hit the ugly wall with Tim Apple but the question is when", "score": 2, "replies": []}]}, {"body": "Long $GOTH", "score": 2, "replies": []}, {"body": "Microsoft is permabull. Any company that can create a shitheap like teams and convince upper management of every company in the US to love it isn't going anywhere but up.", "score": 3, "replies": [{"body": "Lol\n\nHere's the Teams slogan: at least it's better than Skype for Business", "score": 2, "replies": []}]}, {"body": "Short MSFT, massive bug in all windows versions getting patched later today, because the NSA screwed up and the Iranians got hold of their backdoor.\n\nInb4 \"priced in\"", "score": 1, "replies": [{"body": ">Na man gotta split it up you dont bring home a blonde if you dating a blonde think outside the box AAPL banging tesla. tessapp cars kinda shit is what you want.\n\nIf it's getting patched then why should we care?", "score": 2, "replies": []}, {"body": "Lol windows and bugs are synonymous", "score": 1, "replies": []}]}]}
