{"title": "Boeing’s fired CEO Muilenburg walks away with more than $60 million", "selftext": "", "id": "en3sup", "created_utc": 1578722971.0, "score": 148, "upvote_ratio": 0.98, "num_comments": 78, "comments": [{"body": "Title should read “Boeing CEO ejects from 737 max fiasco with $60 million dollar golden parachute”", "score": 44, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "either way , he ejaculated", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "oh you , you poor empathetic sheep, psychopaths are \"happy\" with 60mio", "score": 4, "replies": []}]}]}, {"body": "Why is his pension so high? Like wtf does he actually do to make this much?", "score": 62, "replies": [{"body": "You try going to smith & wollenskys every night. Having to pick out the perfect wines to pair with surf and turf that will impress the consultants you just hired to do another round of layoffs....then fly to Switzerland 2 days later for a two hour conference with only 6 days of vacation before hand to prepare. It's fucking exhausting. Not to mention managing all his real estate holdings. The car collection. Have you ever dealt with a classic car insurance company? It's fucking challenging and requires the highest skill level.", "score": 178, "replies": [{"body": "That kind of stress would surely take 30 years of my life", "score": 16, "replies": []}, {"body": "😂😂", "score": 21, "replies": []}, {"body": "And all of the meetings. Meeting with your car curator, meeting at the golf course, meeting to pick out the color of your yacht. It’s hard work. I’d hate to roll in those circles. Better left to the professional ken dolls.", "score": 3, "replies": []}, {"body": "I am willing to give the ol’ college try. \n\nI will pm my bank details.", "score": 1, "replies": []}]}, {"body": ">wtf does he actually do to make this much?\n\nShit. He literally does shit", "score": 31, "replies": [{"body": "He must be a fellow investor.", "score": 2, "replies": []}]}, {"body": "He was a top career engineer and manager at Boeing for over 30 years.", "score": 38, "replies": [{"body": "Not too good at managing. His team made a shitty plane killing hundreds.", "score": 1, "replies": [{"body": "You realize it was the team before, right?", "score": 13, "replies": []}]}, {"body": "If that experience is so valuable, why aren't 'top career engineers' paid that much? 🤔\n\nThey certainly are not, maybe they make 0.5% of that 60m at absolute max.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Irrelevant.. when you pay your dues with a company, some lucky people find themselves in positions where they get better pay and don’t really have to do anything. I know a few of these people", "score": 13, "replies": [{"body": "\"pay your dues\"  like the 28 year old kid who was only recently fired as CFO of fucking Heinz. I still try and wrap my head around how that came to be in the first place.", "score": 6, "replies": [{"body": "Nepotism", "score": 5, "replies": []}, {"body": "The Ex Boeing CEO started as an intern for the company, I would say he paid his dues started from the bottom and working his way up", "score": 3, "replies": []}]}, {"body": "Then you have young CEOs who do this same shit. People don't see it or realize it until they are selling the company or leaving. It's something to look for when you work for big companies like this.", "score": 2, "replies": []}, {"body": "It happens. More and more of a rarity. Especially with the whole \"talent crunch\" small pool of candidates theory  board of directors have been lead to believe can handle the job of CEO.  \n\n\n\n\nThe days of working at a place +20 years and winding up CEO are gone. This example and any others are a fluke.", "score": 1, "replies": [{"body": "I’m not necessarily implying CEO. There’s plenty of jobs where you, as a coworker, have no idea what the fuck they even do. Just that they get paid more than you.", "score": 2, "replies": [{"body": "Ooooo yeah. Totally. My 2nd gig outta college had one of them. Dude was in the office about 4x a month. If that. Was NOT a traveling salesman.  But was always in exec team photos & company emails. Like. Wtf man. Tell me your job. So I can plan an attack strategy to steal that shit from you.       \n\n\n\n\n\nEdit: and before anyway says some \"oh. You gotta earn that or read 24/7 hustle emails to deserve that job\" bullshit. This is WSB. Go fuck your self. I'd gut that old bastard with a rusty spoon, burn his house down and piss out the flames with my company kool aid filled bladder for .02% raise.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "When one bad tweet can tank the stock by $1 billion, giving him $60 million just so he plays nice seems like a good deal.", "score": 3, "replies": []}]}, {"body": "inflated CEO pay, brought to you by the shills at Harvard Business School", "score": 56, "replies": [{"body": "No it's brought to you by the government who passed a law saying all CEO's pay must be made public.", "score": 24, "replies": [{"body": "What law is that? Never heard that before", "score": 3, "replies": [{"body": "I don't know the name. It was put in place in 1993, the exact year executive pay started to sky rocket.\n\nhttps://works.bepress.com/paolocioppa/1/", "score": 6, "replies": [{"body": "Oh man. Thanks, I’m just so used to seeing pay in the corporate filing I didnt even think it was a thing. In my mind I imagined disclosure like they do public employees, print it in a newspaper. Thanks!", "score": 2, "replies": []}, {"body": "That's funny that you think there's a connection.", "score": -2, "replies": []}]}]}, {"body": "How so?", "score": 1, "replies": [{"body": "That's what caused the huge spike in CEO prices. When all the wages went public the CEOs realized their worth and could bargain hard for a higher wage with the companies owners. \n\nThere is a reason a lot of companies threaten to fire their workers if they discuss wages.", "score": 35, "replies": [{"body": "Well that and companies started paying CEOs in stock and didn't realize how much money they were paying them. \n\n[Chart is outdated but that's okay]( https://imgur.com/2MsTncV.jpg)", "score": 10, "replies": []}, {"body": "Except the CEO-pay ratio was rising all through the 80's.", "score": 2, "replies": []}]}]}]}]}, {"body": "That is the price to make morally unacceptable decisions.\n\nHey all they want to still compete with Airbus.", "score": 13, "replies": []}, {"body": "Its hush money", "score": 16, "replies": [{"body": "Nobody tell him", "score": 8, "replies": []}]}, {"body": "Corporate America... i want to say this is whats wrong with this country but it also drives my stock gains so i can't really say that..", "score": 12, "replies": []}, {"body": "Ah yes, only 11 times the amount they're being fined for the deaths of all those people", "score": 8, "replies": []}, {"body": "Sooo... Did he sell his position?", "score": 3, "replies": []}, {"body": "That’s not enough to be tarnished for life in the Fortune 500 c lvl world, bad negotiations on his part", "score": 2, "replies": [{"body": "Anyone who can't live off 60m for the rest of their life is truly fucked.", "score": 23, "replies": [{"body": "By the time his children finish high school it will pay for only a half of  tution costs in an Ivy.", "score": 1, "replies": []}]}]}, {"body": "I just don't get it. I'd be pissed as a shareholder", "score": 3, "replies": [{"body": "Why? The stock has done amazing the past few years", "score": 7, "replies": [{"body": "Great point. From a purely shareholder perspective that dude took the stock to amazing highs.", "score": 4, "replies": []}, {"body": "And it has plunged because of mismanagement. That was totally avoidable", "score": -2, "replies": []}]}, {"body": "No, shareholders gladly take it up the ass. How many have complained about high CEO salaries?", "score": 7, "replies": [{"body": "CEO pay is a drop in the bucked for multi billion dollar companies.", "score": 20, "replies": []}]}]}, {"body": "Standard procedure.If you get fired ,they will offer you million also.", "score": 2, "replies": []}, {"body": "But don't worry, they aren't offering him severance pay because they are really mad at him", "score": 2, "replies": []}, {"body": "$60 million seems a bit unacceptable for that level of incompetence.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Not without murdering innocents. And that “value” is propped up by taxpayers and government corruption. \n\n\nDiminishing the Average quality of life and national average cost of living per printed dollar is not a “quality” contribution. \n\nAnd that’s what severely bad decisions result in. \n\nMore $$$ doesn’t mean anything if it’s not backed by appropriate and measured results. \n\nThe Federal Reserve can multiply the money supply by three trillion in the next hour. \n\nYou still won’t be able to buy anything you can right now. \n\nThe value generated is illusory. \n\nHis decisions were bad.  Those decisions caused harm. It was remarkably EASY to avoid that mistake. \n\nHe is getting paid $60 million for murdering poor africans but I guess your fine with that.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Right. Systematic political, economic, and business failures aside... that $60 million would have been better invested into making airplanes actually fly. \n\nThing is, the issues Boeing has to be experiencing reveal a necessity for deeply entrenched issues that can’t be fixed. \n\nBoeing made mistakes on such a scale, it’s horrendous. The value it produces is negative at this point. \n\nThe share value rise is equal to less than the relative buying power per dollar raised. \n\nIf Boeing doubles it’s value, it’s going to make decisions bad enough to make sure somehow somewhere, total system wide costs equal the same. \n\nEventually the government will allow Boeing to reap the bad consequences of its bad decisions because government can only support corruption for so long.  \n\nAs for whether it’s worth a taking advantage of government corruption that is burning taxpayer funds to support incompetent management... that is a tough one. \n\nTaking financial advantage of incompetence and corruption has a chance to grant profits. \n\nJust because the issues in competence Boeing has are so entrenched that it will likely make even MORE bad mistakes comfortably negating any value it added to the economy., the value it destroys is government taxes. While everyone else is loosing value you can gain value if invested into Boeing. \n\nThat said, BOEING isn’t... elite enough to do that. \n\nConsequences will follow. $60 million in compensation shows that errors will continue. If he CEO would have invested $60 million into the company and left, and the board members (each) contributed by letting go at least 30% earned with restructuring of the regulatory authorities and dealing with the incompetence and corruption that allowed mistakes to happen, then it could be presumed logical that a degree of competence was being worked on. \n\nBut this... this shows mistakes will continue. Boeing is the largest employer in Washington state and Washington isn’t the top 1 percentile in average citizen intelligence. Every other state (mostly)  has Walmart as its main employer. \n\nBoeing is just hiring hoards of incompetent individuals and placing them at all levels of operation. Even upper management it seems. \n\nThing is Washington state doesn’t have the most savvy political expertise. I don’t think Boeing will be able to exploit corruption enough to survive making mistakes and mistakes will come as the proper actions for removing those mistakes aren’t present. $60 million to a fired CEO shows that. \n\nIt is going to lose value. Significantly. As for when, that needs analysis. But the engrained patterns are there for value loss.", "score": 1, "replies": [{"body": "tl;dr", "score": 0, "replies": [{"body": "Dumb bitch.\n\nTry to utilize a little intelligence.  Your mentally ill thoughts aren’t a quality contribution.", "score": 1, "replies": [{"body": "Well my fuck then.", "score": 0, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "No. They even removed bonuses that year for all\nemployees and middle management. \n\nAnd it’s not just two crashes but the corruption involved. \n\nBad plane design. Engine is too large for the Wing.\n\nFlight Software developed at $8.50\nper hour to programmers in America. Did they use fiber lol? \n\nRemoving necessary instructions in the manual on how to turn off automatic flight control systems that point the plane down. \n\nBoeing has made mistakes. Proper actions to correct mistakes aren’t present. Relying on government corruption isn’t value added.", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Small changes not foreseen? What about those text messages where employees stated this company is  managed idiots who are in turn supervisors by monkeys? (Don’t know exactly quote) \n\nThey knew it had problems. They avoided the FAA guidelines because they knew it wouldn’t pass. \n\nThe laws of physics don’t change\nAnd the processes for assurance are quite... in depth. \n\nThey avoided testing because they knew it was bad not because they thought it was safe enough to warrant violating the law to save on testing costs. \n\nIt was straight up unethical behavior.", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Players make the game. \n\nHow do you think the USA went from wagons to moon landings and touch screens in less than 400 years but the Roman Empire, which also started with wagons, and significant advantages in manpower, didn’t achieve the same quality advancements in more than 1,000 years? \n\nBecause the place where the washing machine, drier, elevator, refrigerator, motorized vehicle began valued the art of making life better by making everyone else’s life better. \n\nThis conduct isn’t “business.” It’s not commerce for profit.  \n\nIts incompetence and bureaucratic corruption that’s rewarding mental illness and punishing intelligence to stay afloat. \n\nBoeing is in a deep debt and the people at the very top over there have clear responsibility for that debt. \n\nBoeing has gone against acceptable conduct. They have destroyed the federal governments total influence and continuity capabilities more than September 11th times 10. Because corruption and incompetence in levels of leadership carry far more harm than just incompetence. \n\nThe CivilWar had 400,000 dead Americans, all arising out of defiance, desire for free labor, and a degree of incompetence and corruption. \n\nCorruption and incompetence only has bad results and it’s 100% a guarantee  that Boeing has done more to harm America than September 11th times ten.  It’s a pile of shit and the people at the top are in a deep debt. Actively propagating corruption and incompetence is disgusting. It’s rewarding mental illness and punishing intelligence. \n\nI think I know what kind of game Boeing’s management might like.  But that’s not the kid of game we play in a civilized society.\n\nSerious statement. Boeing has done more harm to the United States than every foreign attack including 9/11 combined. The soviets would be proud. But they fell to the same disease. Propagation of incompetence and corruption while rewarding mental illness. \n\nBoeing has a debt to pay for all their mistakes.", "score": 2, "replies": []}]}, {"body": "\"murdering innocents...\"\nLol. Ok keep drinking that Kool aid.", "score": -1, "replies": [{"body": "Go kill yourself. \n\nJust because someone is born in Africa doesn’t mean you can kill them. \n\nBeing born in Africa doesn’t erase innocence. Stupid bitch.", "score": 0, "replies": [{"body": "Lol. Masking your ignorance by making false ad hominem attacks. I made no statements about any ethnic or racial qualities. Way to stick to the extremist script.", "score": 0, "replies": []}]}]}]}, {"body": "Nah that was Mama Yellen and Papa Jerome sitting on the big green \"money printing\" button while touching themselves, and then, some luck that a huge bull rally of a blue chip company happened to coincide with his tenure as CEO", "score": 1, "replies": []}]}]}, {"body": "Puts on $BA lmao", "score": 1, "replies": []}, {"body": "Capitalism at its finest..... Do a shit job?, ruin companies reputation? kill 350 people? Here’s $60 million for your troubles", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No company would put a clause that encourages perverse incentives for the board of directors to compromise the CEO.", "score": 1, "replies": []}, {"body": "Definitely not supporting communism in any fashion, but there needs to be some kind of cap on CEO pay", "score": -2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Apparently you missed the part where most CEOs are on each others boards so that they can collude to raise each others pay. Shareholders have little say.", "score": 1, "replies": [{"body": "That is true. And no doubt there is a wealth grab at the top.", "score": 3, "replies": []}]}]}, {"body": "Capping pay? Let’s just create a shortage of capable leaders in America. I’m sure other countries would be glad to pay for it when we stop!", "score": 0, "replies": [{"body": "Capable leaders like Dennis Mullenblunder? Only thing he is capable of is lying through his teeth", "score": 2, "replies": [{"body": "Lol keep up that loser attitude", "score": 0, "replies": [{"body": "You would probably blow Dennis for a chance to ride on his 737 Magnum", "score": 2, "replies": [{"body": "Gladly", "score": -1, "replies": []}]}]}]}]}]}]}]}, {"body": "Meanwhile, Spirit in Wichita, KS, is laying off 2.8K people due to the 737 MAX grounding. Give that $60M to those workers and they each walk away with ~$21.5K.", "score": 1, "replies": []}]}
