{"title": "Buyers remorse", "selftext": "Purchased first ever leap call today and am questioning my decision. Curious to know your thoughts.\n\nThe plan: wait for dip and purchase AAPL ITM call with a delta of ~.6 with expiration of Jan 2023\n\nThe execution: \n\n$23.60 AAPL Jan 2023 @135c \n\nImplied volatility- 29.84\n\nTime value- 15.41\n\nDelta- .63\n\nVega- .62\n\nHow’d I do?", "id": "psa8ue", "created_utc": 1632193966.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 21, "comments": [{"body": "In general, not really anything wrong.  The only thing is buying options on a major down day can be sub-optimal.  You are paying extra extrinsic for, what is imo, an easy bet on AAPL, so that first mover's advantage isn't really doing much for you.  Normally, i'd wait for a little but of easing of volatility before making a long-term play like that.  You may miss out on some early deltas, but you have the extra extrinsic to make up for in your case.  It's a small critique, and it's hard to avoid if you're waiting for that down move, but something to keep in mind.  If you want to take the opportunity at first chance, take the delta to .8 or .9 where there is very little extrinsic and therefore less extra cost.  It will be more up-front, but you will be spending more wisely imo.  It's really hard to mess up leaps on blue-chips if you check for liquidity and don't risk the farm.", "score": 8, "replies": [{"body": "Great points, the implied volatility and timing extrinsic value is where I feel least informed. Definitely learning more each day but I honestly assumed catching a dip would offset/benefit me on premium for a lower strike price", "score": 4, "replies": []}]}, {"body": "U will do just fine.\nYour Leaps have enough time inbuilt for the counter to move in your favour.\n\nSide note, greed is what u should worry about once u are in the green. \n\nI have a tendency of chasing 200% profits once I pass the 120%-150% profit mark ....never ends well for me.\n\nTrying to discipline myself to sell between the 80% and 150% profit mark.", "score": 7, "replies": [{"body": "Thanks for the advice! My long term plan is to roll it into another leap once the option is about 4-6 months from expiration.", "score": 3, "replies": []}]}, {"body": "Slightly ITM on aapl with 487 days to go? You will be fine.  Stop caring about the waves, you are waiting on the tide.  In 3-6 months from now when you are up, roll this up and out for another 400+ DTE and .60 delta, pocket the profits.\n\nedit: I forgot to add, if you are going to be buying leaps, make sure you know how much 1 day costs.  In this instance, worst case scenario this will cost you $4.84 = $2360/487 per day. I like to check the 2 closest monthlies, sometimes you can find a nice sale.", "score": 3, "replies": []}, {"body": "Sell way OTM weeklies against it and it will pay for itself", "score": 3, "replies": [{"body": "This!", "score": 1, "replies": []}, {"body": "Hi! QQ: You have to own 100 shares to sell calls correct?", "score": 1, "replies": [{"body": "No the LEAP is used as collateral as long as the short strike is further OTM than the long strike", "score": 3, "replies": [{"body": "got it! ty!", "score": 1, "replies": []}]}]}]}, {"body": "Why did you pick delta .6?", "score": 2, "replies": [{"body": "YouTuber I follow mentioned that as a strategy", "score": 1, "replies": [{"body": "0.5 delta is a good medium gauge.", "score": 1, "replies": []}]}]}, {"body": "Near the money and at the money options have the highest extrinsic value. That’s why I always sell them and rarely buy them.", "score": 2, "replies": [{"body": "So your saying to buy deeper ITM or OTM leap calls?", "score": 1, "replies": []}]}, {"body": "You’ll be fine for sure. 2023? And the fact that AAPL moves couple dollars a day on Green Day’s means that it should def hit ur break even by then", "score": 2, "replies": [{"body": "Yeah 2023 because I wanted the entire year of 2022 to work with", "score": 2, "replies": []}]}, {"body": "Generally, as a rule of thumb, if I feel unease about a position, I exit and reassess. But like others said, it is a good LEAP. In a blue chip company that survives many corrections and crashes before. So just hold on for dear life and watch it grow.", "score": 2, "replies": []}, {"body": "The key word is ‘wait for dip’ lol", "score": 1, "replies": []}, {"body": "Perfect expiration date, was thinking of doing the same but OTM, at least 170", "score": 1, "replies": []}, {"body": "Until I see we have definately passed the trough point I am not into options.  Buy a few shares of Fanng stocks while they dropped -10%.....", "score": 1, "replies": []}]}
{"title": "Apple’s Massive Debt", "selftext": "As investors should we be concerned that AAPL’s current ratio is only 1.06? For a multi-trillion dollar company, I feel this # should be higher and the firm should run mostly on equity instead of debt.\n\nFor comparison, MSFT has a current ratio of 2.08 and D/E is 57.\n\nThoughts?", "id": "psboz5", "created_utc": 1632199569.0, "score": 1, "upvote_ratio": 0.51, "num_comments": 26, "comments": [{"body": "Not at all. They have over 60B in cash and their cash flows from operations are over 100B. Pretty sure they have the best credit rating on the planet “safer” than most countries debt", "score": 59, "replies": [{"body": "Very helpful, thanks", "score": 6, "replies": []}]}, {"body": "Why use its own money if Apple can borrow at 2% interest. The interest does not even cover the inflation rate... No debt concerns with credit ratings of AA1.", "score": 26, "replies": []}, {"body": "MSFT credit rating AAA top grade.  AAPL AA+ 2nd grade from the top.  (data from Fastgraphs).\n\nIf you want to nitpick...", "score": 18, "replies": []}, {"body": "Low interest rates make debt cheap.", "score": 10, "replies": []}, {"body": "Debt is super cheap right now, what’s more important than the ratio is their ability to pay it off within x amount of years if the rates go to shit", "score": 9, "replies": []}, {"body": "Most likely a tax play. Borrowing money is cheap for companies like Apple with exceptional ratings. Their $14bn raise earlier this year was 0.7% for 5 year bonds and went up to 2.8% for the 40 year.", "score": 5, "replies": []}, {"body": "More debt —> lower cost of capital —> more profit on invested capital.", "score": 6, "replies": []}, {"body": "Companies like aapl or googl have a huge advantage in times of low interest rates. They can essentially borrow free money and due to the amount they borrow they can negotiate very nice repayment terms with banks.\n\nWith huge companies they can put this capital to good use. Why would they spend their own cash when the bank is prepared to lend them money for less than inflation. \n\nYou can find when their debts are due to be paid in the financial statements so its worth looking into it for your own sake to learn what to look for in general.", "score": 3, "replies": []}, {"body": "Literally the best consumer electronics company in the world nothing to worry about", "score": 5, "replies": []}, {"body": "Tim Apple don’t take advice from redditors", "score": 2, "replies": []}, {"body": "I remember when apple wasn’t a trillion dollar company because of too much cash and not enough debt.", "score": 2, "replies": []}, {"body": "They hold so much cash reserves, it's not even a concern..", "score": 2, "replies": []}, {"body": "They have so much cash , they don’t know what to do with it", "score": 2, "replies": []}, {"body": "It’s all about the WACC optimization bro. Makes more sense to borrow at these rates than issuing equity. At a 100b a quarter in revs, they can borrow at the lowest rates possible, and earn more way more by investing that into the business. They are increasing shareholder value this way.", "score": 2, "replies": [{"body": "This make a ton of sense, thank you NoPie", "score": 1, "replies": []}]}, {"body": "Might be because they cant bring their huge fortune made in Ireland home without getting taxed. That’s why they are taking on debt - to pay out the earnings without actually having to transfer them to US.", "score": 5, "replies": [{"body": "They did bring it home I thought:\n\nhttps://www.irishtimes.com/business/technology/apple-to-incur-38bn-us-tax-bill-as-it-repatriates-irish-cash-pile-1.3359240", "score": 3, "replies": []}, {"body": "explain", "score": -1, "replies": []}]}, {"body": "Dude just load up", "score": 2, "replies": []}, {"body": "Interest on debt: 3%\nInflation: 5%\n\nYou’re essentially getting paid to borrow money right now, everyone should be loading up on debt and putting the cash to work. Even just tossing that money in the S&P would yield 7%, so even after servicing the loan there’s 4% profit. \n\nNow imagine the returns an organization can get out of that capital. Research and development on a new hit product can yield 1,000,000%+ \n\nDebt doesn’t bother me at all right now if there’s cash on the balance sheet and good solvency.", "score": 2, "replies": []}, {"body": "Disappointing new iPhone. The new iPhone is 10 percent faster than the last one, and the photos are slightly better. In a word: Huh.(New York Times).\n\nLow current ratio: not good . But since it's AAPL I would say hold a not so big position", "score": 0, "replies": []}, {"body": "Interest expense", "score": -1, "replies": []}, {"body": "No. \n\nIt's all a shell game to minimize tax impact. \n\nAccounting gimmickery.", "score": 1, "replies": []}, {"body": "Debt is not a bad thing right now being its super cheap due to the interest rates being so low. It would be stupid for a company to not take advantage of this interest rate free environment.", "score": 1, "replies": []}]}
{"title": "Wall Street will learn to love Evergrande's crash", "selftext": "* Via [https://www.reuters.com/breakingviews/wall-street-will-learn-love-evergrandes-crash-2021-09-21/](https://www.reuters.com/breakingviews/wall-street-will-learn-love-evergrandes-crash-2021-09-21/?taid=6149d2a7a5c42200013c638f&utm_campaign=trueAnthem:+Trending+Content&utm_medium=trueAnthem&utm_source=twitter)\n   * Non-paywall link: [https://archive.is/L9dsp](https://archive.is/L9dsp)\n   * Main article quote:\n\n>HONG KONG, Sept 21 (Reuters Breakingviews) - Foreign investors have finally heard the alarm bells ringing around China Evergrande **(3333.HK)**, an enormous developer with a $300 billion debt pile roughly equivalent to the annual economic output of Finland. On Monday, European and U.S. benchmark stock indexes sold off on fears of financial contagion, while credit default swaps, the costs of insuring against Chinese sovereign default, surged. It’s about time.  \n>  \n>  \n>  \n>An Evergrande bankruptcy and correction in the local real estate sector will be painful, and not only for commodity suppliers. If a full-bore housing crisis ensues, it could cause an unprecedented contraction in the world’s second-largest economy, with implications for every company that invests in or exports things to China.  \n>  \n>  \n>  \n>Short of that, the risk of financial contagion seems limited. Evergrande dollar bonds were downgraded to junk long ago; high-yield issues by Chinese developers are mostly traded by speculators. Evergrande’s biggest lenders are domestic banks like China Minsheng Banking **(600016.SS)** and Agricultural Bank of China **(601288.SS)**, **(1288.HK)**. Much of its recent credit was raised by paying suppliers commercial paper instead of cash. During the U.S. subprime mortgage crash in 2008, the difficulty in establishing who held how much junk prompted banks to stop lending. Yet a similar liquidity crisis is next to impossible in China, where the financial system is controlled by the state.  \n>  \n>  \n>  \n>Some foreign trading desks will take a hit. Fund manager Amundi said it still has $25 million of exposure to Evergrande. Investment bankers who sold the developer’s bonds to clients may have uncomfortable conversations with lawyers coming up. It’s possible too that overseas institutions have been taking on default risk without knowing it, given founder Hui Ka Yan and peers’ fondness for exotic and opaque funding channels like wealth management products.  \n>  \n>  \n>  \n>There may be some silver linings. The historical outperformance of property compared to every other Chinese asset class has overheated demand for mortgages and shadow loans. It has warped Chinese consumption and investment, cannibalising capital from the securities markets, mutual funds and insurance. That has played poorly to the strengths of overseas wealth managers trying to lure China’s retail investors. If this is really the beginning of the end of the real estate boom in the People’s Republic, Wall Street financiers watching Evergrande crash would be wiser to reach for the popcorn, not the tissues.", "id": "psjnev", "created_utc": 1632233899.0, "score": 6, "upvote_ratio": 0.65, "num_comments": 27, "comments": [{"body": "TL;DR?", "score": 7, "replies": []}, {"body": "I personally don’t really care about any paper losses that occur because of the imminent collapse of Xi’s Chinese system.    I embrace these losses.  After hearing for years from all my nativist friends about how China demonstrated how free trade doesn’t work as a liberalizing force this gives me some smug joy.  \n\nI kept telling them to wait.  It would take a long time for the Chinese construction boom to collapse which I theorized would create unrest among the newly minted middle class.  They didn’t listen.  They ran around espousing that the only way out of this was to “get tough” on China and wanted tariffs and other mercantilist measures of balancing trade deficits that would clearly be counterproductive.\n\nWell who’s laughing now?  Trump didn’t bring down China with his blowhard, randomly generated tariffs.  China is collapsing on itself because they put a leader in power who does not understand the Chinese economy (after years of adept management).  It was bound to happen.  And the world will end up being a better, kinder, freer place for it.\n\nI’m sure many on Wall Street feel vindicated in the same way.  Because, make no mistake, what we’re seeing here is the unraveling of the “mixed” economy.", "score": 6, "replies": [{"body": "You're nuts if you think China is collapsing.", "score": 23, "replies": [{"body": "Agreed, it's going to be everywhere.", "score": 5, "replies": []}, {"body": "You’re nuts if you think their economic system isn’t.  The whole Chinese economy was built on real estate development.  They’ve poured more concrete in the last 3 years than the US did in the entire 20th century.  Real estate development is 30% of their economy.  Evergrande has 200B of unfinished apartment complexes on their books that they can’t complete or sell.  That is ~1.4% of their GDP in unfinished apartment complexes on one company’s books.  That’s staggering.  The other big part of their economy is tech which they are cracking down on.  \n\nThey’re going to really struggle with this.  Saying otherwise is a delusion.  This is Japan in 1989.  Lots of similarities.", "score": 7, "replies": [{"body": "That's not a collapse though, collapse implies dissolution. .", "score": 3, "replies": [{"body": "The Nikkei is still below its 1989 peak.  If you don’t consider that an economic collapse, what is?  It’s the worst peacetime economic destruction since WW2 at least.  I can’t think of a worse one…even the Soviet Union to Russia revolution recovered faster.", "score": 0, "replies": [{"body": "Your comment implied their entire political system would collapse, not that it would merely suffer (but withstand) some years of economic stagnation.", "score": 3, "replies": []}]}]}, {"body": "Then put your whole life savings on puts for chinese stocks.", "score": 2, "replies": [{"body": "If he had done that last week he'd be able to retire today", "score": 1, "replies": []}]}, {"body": "Lol no", "score": 1, "replies": []}]}, {"body": "He is from the US they don’t understand a GOV that provide public healthcare, fight high housing prices and makes Companys invest in the country without cutting taxes....", "score": -7, "replies": [{"body": "I'm from the US myself but can see America's sinophobia is completely irrational. We are buddies with Saudi Arabia but their human rights record, personal liberties etc. are all exponentially worse than China's yet these folks focus all their hate on China. I do not believe China is perfect but I think they are doing a reasonable job of managing a diverse population of well over a billion people", "score": 3, "replies": []}, {"body": "Show me where the ccp provides public healthcare lol", "score": 3, "replies": [{"body": "It’s quiet simply only two countries in the world don’t have universal healthcare...even in China 90% have access and cost is after legislation change only 20% of the bill...", "score": 0, "replies": [{"body": "Show me the proof", "score": 0, "replies": [{"body": "https://www.worldatlas.com/articles/10-notable-countries-that-are-still-without-universal-healthcare.html", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">China is collapsing on itself because they put a leader in power who does not understand the Chinese economy (after years of adept management\n\nCan I have some of what you are smoking please? This is just one company and the SSE is up 4% over the last month and we have known about evergrande for the last 2 weeks.", "score": 5, "replies": [{"body": "People here hate china quite a bit", "score": 1, "replies": []}]}, {"body": "RemindMe! 1 year “china collapse”", "score": 1, "replies": [{"body": "I will be messaging you in 1 year on [**2022-09-22 07:25:58 UTC**](http://www.wolframalpha.com/input/?i=2022-09-22%2007:25:58%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/psjnev/wall_street_will_learn_to_love_evergrandes_crash/hdthwsr/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fpsjnev%2Fwall_street_will_learn_to_love_evergrandes_crash%2Fhdthwsr%2F%5D%0A%0ARemindMe%21%202022-09-22%2007%3A25%3A58%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20psjnev)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Saying it's dumb to invest in China is like the most American thing in the planet what the f*** are you talking about", "score": 1, "replies": []}]}, {"body": "Not sure why there is so much focus on a single chinese company when the US is a SOVEREIGN NATION, with a RESERVE CURRENCY thats on the brink of disaster. If the US defaults... its game over. Buy gold and puts on anything and everything if you dont think they will raise the debt ceiling.", "score": -2, "replies": [{"body": "They’ll raise the debt ceiling. Why wouldn’t they?", "score": 5, "replies": [{"body": "Because Republicans", "score": -1, "replies": [{"body": "Lol come on man. It's all a show", "score": 5, "replies": []}, {"body": "they'll raise the ceiling for war spending", "score": 3, "replies": []}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "pslsma", "created_utc": 1632240232.0, "score": 2, "upvote_ratio": 0.63, "num_comments": 24, "comments": [{"body": "VOO or VTI. Pick one, hold forever and enjoy the earnings growth and dividend yield that the companies produce.", "score": 11, "replies": [{"body": "Yes sir! My wife has a boglehead Roth with these included. She is doing great!", "score": 4, "replies": [{"body": "I love bobble heads", "score": 2, "replies": []}]}]}, {"body": "One popular way of investing is Dollar Cost Averaging (DCA). Find the investment you like, and determine how much to invest in it. Then split that investment into equal parts, investing one part every so often (like once/month for 6 months). This is what people do when they contribute to their 401k every paycheck, a little at a time for a long period of time.\n\n&#x200B;\n\nThe advantage of doing this is that as the stock fluctuates, you will buy more of it when the price is lower and less when the price is higher. The math works in your favor.\n\n&#x200B;\n\nI'm not saying this is the best way to go; I'm saying this is an option to consider if you really are looking for longer term.", "score": 5, "replies": []}, {"body": "Small amounts of money can still be put to work well!\n\nSTOR. MSFT. V. PINS. are afew.", "score": 4, "replies": []}, {"body": "Water: PIO, FIW, GWRS, CWT, AWK etc", "score": 3, "replies": []}, {"body": "SPY and ride. Recurring investments.", "score": 6, "replies": [{"body": "Oh yeah! I am buying the dip this week.", "score": 2, "replies": []}]}, {"body": "Intel", "score": 2, "replies": []}, {"body": "I think SoFi is pretty solid longterm, I think it will be nearly double this time next year. I was In the same boat at the beginning, you have limited money and it’s not all that exciting to have one or two shares of these blue chip stocks when you could have tons of small caps. Buy what you use and eat and you will do pretty good. Also! Gambling stocks are going to be huge. It’s like weed stock hype from a few years ago. Lots of catalysts as states legalize", "score": 2, "replies": [{"body": "I think SoFI is not a bad idea, but it's a midcap (12B market cap), not small. I feel uneasy when I see stuff like this in case people think the 'cheapness' of the share price has anything to do with the company size.", "score": 2, "replies": []}]}, {"body": "DKNG", "score": 2, "replies": []}, {"body": "Buy MasterCard or Visa, they’re down quite a bit from their highs but are still very solid growth companies that pay small dividends and should do well this decade. Apple and amazon are solid choices too as you suggested. If you do choose to buy risky high price to earnings type of stocks make sure they make up less than 10-20% of your portfolio. Chargepoint Holdings has a lot of potential upside and is near the bottom of its channel and support.", "score": 2, "replies": []}, {"body": "I'm also new to the stock market and don't want to put a lot of money into it. So far I have only bought a few small cap technology stocks whose shares are under $10. Next payday I will buy a few shares of a stock that pays a dividend to see how that is paid out. I think it just goes into my brokerage account. I may also buy a few shares of a REIT and ETF just as an excuse to learn more about these kinds of stocks.", "score": 1, "replies": [{"body": "Dividends are paid depending on how you set it up, and when the companies pay. Some companies pay once a year while others pay 4x a year.\n\nYou can have it set so that the money from the dividends get reinvested into the company automatically or you can have it go to your bank/brokerage account.\n\nIn either case, be sure to remember about taxes! Dividends is still income, even if it is instantly and automatically used to reinvest. Your brokerage *should* have all the forms for you for tax season.", "score": 1, "replies": []}]}, {"body": "EV: LCID **+ FUV + LEV + ZEV \nMETAVERSE: RBLX**\nSTREAMING : FUBO**\nGAMING/GAMBLING: DKNG** + OTGLY **\nTech: PLTR**\n\n** means I own some shares", "score": 1, "replies": []}, {"body": "Stay away from pharma.  Very unpredictable and extremely volatile", "score": 1, "replies": []}, {"body": "It’s like the same post every day. Sheesh", "score": 1, "replies": []}, {"body": "Berkshire Hathaway", "score": 1, "replies": []}, {"body": "IIPR MSFT & DIS\n\nI own these three stocks so this isn’t financial advice. They’ve been the kindest to me thus far. I’d also sprinkle a little risk in there and go with CHPT or STEM (which I also own, not advice). And throw in VTI for diversification and safety", "score": 1, "replies": []}, {"body": "Some of these are really high to DCA into. Look into m1 finance for investing a custom portfolio you make buy dollar amount instead of shares. Itll work in your case as you are doing this for long term.", "score": 1, "replies": []}]}
{"title": "LCID DD!! YOLO!!", "selftext": "Lucid is on momentum lately after the lock up expiration. I think a lot of people waiting for this lock up to expire before loading up. They want to see whether there is any insiders selling huge after lock up date. Since that date is over, investors are loading up! Stock has been going up almost 5 percent each days even during the 2 red market days on last Friday and Monday! So it is very bulllish!!!! Lucid is having their first Full Tour of AMP-1, Lucid's First Factory in Casa Grande, Arizona next Monday 9/27. Lucid has been asking their preorder customers to order their cars since Monday. They are planning to start delivering the cars by end of this month. Lucid also has 10k VIN numbers registered last week. I think it is just about time where Lucid will be delivering their first car soon! Rumors said that Lucid has been producing car already\n\nThe Chief Technology Officer is the former chief engineer of Tesla and worked on Tesla model S. Company has mass experience in building efficient drive train and battery. Lucid was founded in 2007 under the name Atieva and originally focused on building electric vehicle batteries and powertrains for other vehicle manufacturers. \"Lucid has designed, developed, manufactured and supplied battery packs for all race teams in the 2018–19 Formula E season,\\[38\\] and will continue to do so for the 2019–20 season,\\[3\\] in collaboration with McLaren Applied Technologies and Sony\". Lucid definitely has a lot of experience in this field to create great drive train and batteries that are more efficient than Tesla. Lucid has 500+ miles EPA registered car. This is the highest miles compared to the other EV cars in the industry. As the matter of fact, TOP 5 EPA highest mileage registered cars are from Lucid. This isnt just about putting the biggest battery but building the most efficient drive train and batteries. Their MPGe is a lot higher compare to Tesla.[https://insideevs.com/news/533665/lucid-air-tesla-models-compared/](https://insideevs.com/news/533665/lucid-air-tesla-models-compared/)\n\nLucid is starting to build their own energy storage business. Seem to be a strong competitors to Tesla out of all the EV companies out there[https://www.dailylucid.com/post/energy-storage-business-could-net-22-8-billion-for-lucid-motors-by-2030](https://www.dailylucid.com/post/energy-storage-business-could-net-22-8-billion-for-lucid-motors-by-2030)\n\nRivian is valued at 80B on their upcoming IPO and Lucid has only 42B market cap. I believe this stock will be going to 50+ after the factory event day on September 27 (next Monday). Short interest is high as well. I am a retard so I bought 115 of 25 strike price cal expiring this week yesterday and will continue to buy more this week! If we break 28 hard resistance, lucid will be going to 40+ very quickly. YOLO!\n\nhttps://preview.redd.it/hxm2pvlemvo71.png?width=1125&format=png&auto=webp&s=2663edeb1777c86dec5a976591039d22459749fa", "id": "pslb0u", "created_utc": 1632238795.0, "score": 77, "upvote_ratio": 0.81, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|22 minutes ago\n**Total Comments**|0|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/pslb0u/lcid_dd_yolo/) \n**Account Age**|6 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=pslb0u)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=pslb0u)\n    \nHey /u/MasterpieceFlat6082, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "Yes! I got in at $20.18 buying shares. I have never bought calls but I’ve almost reached full retardation status so daddy’s gonna gamble bb", "score": 11, "replies": [{"body": "I'm holding 1500 at 20.86 so I'm all in", "score": 7, "replies": [{"body": "Yeah I’m 540 at 20.46", "score": 5, "replies": [{"body": "Fuck yeah.. let's get rich. My exit point is 500k💪🤘🚀💎🌙", "score": 8, "replies": []}]}]}]}, {"body": "26000 shares deep. Buying more every paycheck and not selling for 5+ years..", "score": 11, "replies": []}, {"body": "WSB is hilarious. If you're reading this post to get in now you're wayyyy too late.", "score": 23, "replies": [{"body": "Not at all. Catch it next time it swings down it’s gotta be due for a cool off here pretty soon. As usual I’m mentally retarded and incapable of giving financial advice", "score": 6, "replies": []}, {"body": "No way lol. It hasnt even broke channel resistance. This is in no way any different than before. Its still too early to tell. This could swing back down so very easily.", "score": 4, "replies": [{"body": "When it does I’m buying", "score": 0, "replies": []}]}]}, {"body": "Having been on the LCID rollercoaster before from the pre SPAC merger days (and TSLA before that), I would suggest waiting to buy for a day with bad news. You may miss this present run-up, but if this is a long-term success, there will be better entry points to come. \n\nI'm a fan of LCID long term but the future is fundamentally unpredictable. Currently holding 90 @ 22", "score": 7, "replies": []}, {"body": "https://youtu.be/tEHiMYAa6yk", "score": 1, "replies": []}, {"body": "This rips. Thanks bra", "score": 1, "replies": []}]}
{"title": "$UPST Imminent Pullback, Fck Your Squeeze Plays", "selftext": "UPST has had an incredible run, and I am happy to see so many people capitalize on this. Don't know the user's name, but I gotta give credit to the dude who was following the big money into this one.\n\nWith that said, this thing is primed for another pullback. \\~+20% this past week, making a new ATH, in the past for its run ups it usually pulls back around $20-$60, and I am anticipating the start of a sell off in the next week or so.\n\nHopefully the attached image can better illustrate my thinking. This is complete degenetard thinking here, but given its history, September/October's track record, this one is gonna pay out decent by mid October I'd guess.\n\nhttps://preview.redd.it/1l6fv9zvsvo71.png?width=1477&format=png&auto=webp&s=d9ad44ea0ec76744267f845d10c26ab7463acbca", "id": "psm1fe", "created_utc": 1632240938.0, "score": 4, "upvote_ratio": 0.58, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|9 months ago\n**Total Comments**|415|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=psm1fe)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=psm1fe)", "score": 1, "replies": [{"body": "The gains to flow into SOFI?", "score": 2, "replies": []}]}, {"body": "Sell off could be as soon as this Thurs or Fri before it goes off again. People will take profit but I hate put contracts where premium sucks", "score": 5, "replies": []}, {"body": "Learned my lesson to not short the most obvious momo plays. They dont follow TA as much as I want them to. I expect a pullback but no idea when or where it will be by the time it pulls back. Good luck!", "score": 5, "replies": []}, {"body": "just buy the pullback and keep what you have, this is a great investment and could end up shooting yourself in the foot", "score": 1, "replies": []}, {"body": "Still undervalued", "score": -7, "replies": []}, {"body": "I bought $180 puts 9/17 lol dumbest move ever …..this stock is going to surpass Amazon stock price with no pullbacks", "score": -2, "replies": [{"body": "No chance this has only been public for 9 months give it time it will drop back into the 200s without a doubt", "score": 2, "replies": []}]}, {"body": "maybe, but if that's the case, there's no money to be made in puts", "score": 1, "replies": [{"body": "Scalping premium, not to actually exercise", "score": 1, "replies": [{"body": "if you mean selling calls, then yeah, but not worth the risk.  if you mean buying puts, then doubtful.  if there's an expectation of a fall, the premium will be jacked up beforehand, and drop as the price falls.  sounds counterintuitive, but it's how it works.  some ppl like to call it \"IV crush\"", "score": 2, "replies": [{"body": "Okay interesting, I've been successful doing this on tsla after big runs, chalk that up to luck I got out in time. Usually only held for 1-3 days", "score": 1, "replies": [{"body": "I've done similar with TSLA, but based on news, which I acted upon within seconds.  TSLA also dumps hard and fast, or it used to.  I haven't looked at it in a long time.  Put plays like what you're talking about *usually* takes a faster-than-expected dump to outpace what's already reflected in the options premium.  I've had plays go ITM and *still* be a loss.  \n\nI think the last play I tried, based on an analysis similar to yours, was PINS.  I saw the pattern, loaded up, and... nothing.  I did it because some *other* dude posted a play on MRNA that was basically the exact same analysis, which he made a fuck-ton of $ on.  So I was like, \"huh.. yeah, let's go find something else that does the same shit\".  *wrong* lol\n\nYou might be correct, so don't let me/us dissuade you.", "score": 0, "replies": [{"body": "No I really appreciate the input - helps hearing that I very well was fortunate to exit my tsla plays after only a couple days and do okay (5-10%).  \n\n\nI need to get a better understand of IV crush.\n\n&#x200B;\n\nI think I am still going to wait until close to see how it shakes out today and see if I can find somewhere to jump in even for a small play. On things like this, I've only ever targeted small jumps, kinda why I thought with half a pullback as UPST has had in the past, premiums should make 5-10% within a day or two if I get in at the start of the sell off....Too many ifs to consider lol", "score": 1, "replies": [{"body": "IV crush: Basically, an option has two things it draws value from, the actual value of the contract and the theoretical value of a contract.\n\nWhen you're playing OTM, if you don't land ITM you're banking on getting value from the theoretical value of a contract. This is influenced by theta decay. This is when implied volatility crush goes into effect. I'll explain this in a second.\n\nWhen you're ITM, the value of the contract comes from the actual transfer value of the contract if exercised. So if you're +10 ITM, your contract value is going to be in the ballpark of around $1,000.\n\nWhen you buy a contract, basically the price is determined based on the probability that the contract will hit the expected price. If you buy that call (or put) OTM, but the stock is trading flat, volatility is low. If the time on the contract is long, then theta is high and the number of branching probabilistic realities where that contract ends up ITM is still pretty high, but lower than it would be with high volatility.\n\nWhat high volatility does is drive up the price because it increases the chance that the contract will move ITM. So if you buy at high volatility and you're OTM, then volatility drops down because people stop trading in and out of a stock because it's now a known quantity, then the volatility of the stock will reduce and the number of probability of the stock moving into the money is less variable.\n\nThis is IV crush. If you're ITM, volatility has less of an impact. If you have volatility and are ITM and still have theta (time) to play out on the contract, then the contract may be worth more than the actual value if exercised then because there are more probabilistic realities where it can go higher. If you buy in high IV, it reduces, and/or you have low theta, it will get much closer to the exercise value of the contract.\n\nIf you're OTM, IV crush can destroy the value of your contract outright.\n\nSo how much you're betting on IV depends on how much you're betting on being OTM and/or getting extra value. If you buy a put ATM and it does a $6k drop and the IV drops, you're still going to make a good profit. People overestimate the impact of IV crush on all contracts. It's mostly a factor for OTM plays.", "score": 2, "replies": [{"body": "Thanks for a great write up. \nSo originally I was thinking of playing the 300p for January, but now I think if I am going to make a move, I'm going to look for it draw down below 320 at this point, and go for an ITM put on a quick swing trying to catch the momentum and put my limits in for 10%", "score": 2, "replies": [{"body": "It has a lot to do with how the options chain matches up, how much you expect it to move, and your penchant for risk.\n\nPlaying ITM or ATM is your best bet if you want to guarantee return in a high IV situation, but it also increases your risk if you fail at the directionality of the play. Because the premium is higher it also cuts, to some degree, potential for profit if it doesn't move as much as you expect.\n\nMeanwhile, if it move at or more than your expections, sometimes you get better return on cash spent if you're a little OTM at buy but land ITM. I made a 10 bagger once on betting against ZM on last earnings by buying a far OTM $310 put thinking it'd move to $300, but it moved lower, so my $1k gain became a $2k gain on $200. I would have made more ITM, but as a function of risk return, I landed an almost perfect play. IV was sucked completely out of the play, pretty much... but it didn't matter much. \n\nIt makes sense to work the chain and hedge when you're thinking of buying.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}
