{"title": "Anyone notice trading SPY is getting tougher?", "selftext": "Back in the day, trading SPY was paramount because the liquidity, tight spreads and fill spreads. SPY had very tight bid ask, penny wide on most expiration dates. You used to trade monthlys with only .01-.03 now it its about .03-05 Or nickel wide. \n\nThis only happened if VIX was over 30 or if the market took a huge 1-2 sigma move when the market maker had to widen the spread to recover some losses on their books. \n\nFill spreads were nearly instant without taking much of a “haircut.” You could trade a four leg - iron condor or butterfly and it’ll give you .35 - .40 and you couldve filled at bid if you waited <1 minutes, or .38 2 mins or .39/.40 if you wanted to wait 3-5 minutes. Now you wait 5-10 minutes limit at mid with a bid ask of quarter wide and you have to market order it and itll be random premium fill at <.35 less.", "id": "pl6jdj", "created_utc": 1631221221.0, "score": 44, "upvote_ratio": 0.86, "num_comments": 27, "comments": [{"body": "Friendly reminder long term average of VIX is 15.", "score": 16, "replies": [{"body": "Source? I recently saw in a trading video that 18 was the VIX avg.", "score": 4, "replies": [{"body": "Source is primary, I download the data and do the math. And forgive me, average is closer to 18, it would’ve been more appropriate to say the median is 15, which I feel is the more important number. As a trader who trades the SPX routinely it’s more important to know that half my trades will be while Vix is under 15 as opposed to knowing the average which is inflated because of some outlier data points where Vix is over 80.", "score": 13, "replies": [{"body": "Where did you get the data? Was it just a simple cvs file?", "score": 3, "replies": [{"body": "Yeah just go to yahoo finance or bar chart or whoever. You can download the daily open, close, high, low into excel. Then just start running formulas. If you know how to work excel you can learn a lot about an underlying about it’s ranges, average moves, etc without having to rely on some YouTube guru to tell you.", "score": 3, "replies": []}]}]}]}]}, {"body": "I noticed that a few months ago when I was daytrading SPY with long calls/puts only.  Fills were getting worse and worse and mega spready.  This is my own fault of course, but I found the volatility to be almost untradeable.  You would have the smallest move on the chart and it was magnified 10x on the option where I haven't seen that on other option charts since I stopped and moved to a different strategy.\n\nI do want to get back into the ETF world, particularly SPY because the money to be made can be ridiculous on trending days.  The chop days suck, though.", "score": 9, "replies": [{"body": "Would you only trade 0 DTE SPY?", "score": 2, "replies": [{"body": "Initially yes.  I was 0 or 1DTE.  Recently within the past 30-40 days I tried it again on 5-7DTE and it was still a chop show.  I am interested in trying it again but I might down play my risk a lot.  I was throwing an arbitrary 10% SL on the plays.  I know it was my own fault, but might look to OTM instead of ATM plays and then instead of getting 10-12 contracts with a 10% stop get 3-4 and just let them expire worthless.  If the move goes against me I can always try and buy them back for less than max loss with the same risk profile at the start of the trade.", "score": 3, "replies": [{"body": "0-1 DTE is significantly better for fills, but of course you're seriously at the whim of micromovements that can blow you out with no exit opportunity. i'm finding that it's easier to wait for bigger moves and lever up rather than constantly open positions", "score": 3, "replies": [{"body": "I am thinking that as well.  Instead of screen watching all day for these .50-.75 moves that can lead to 10-20% on an option, maybe wait for a longer time frame set up bounce or indicator signal and take it more as a short term swing vs. day trade scalp.", "score": 2, "replies": []}]}]}]}]}, {"body": "What’s a sigma move?", "score": 7, "replies": [{"body": "OP may be referring to standard deviation, denoted by sigma.", "score": 12, "replies": []}, {"body": "https://www.quora.com/How-does-one-use-sigma-to-trade-options   \n\nI do not how how accurate this is I’m only posting what I googled. \nI’m referencing the answer by McCabe Hurley", "score": 1, "replies": []}]}, {"body": "Just when I started playing spy, too. Should have warned everyone.", "score": 11, "replies": [{"body": "Samsies....", "score": 4, "replies": []}]}, {"body": "You are right.  Treading SPY does not bring food on the table these days.", "score": 3, "replies": []}, {"body": "I placed and order for 25 put credit spreads, only 4 got filled in 30 min, I canceled the rest. Thats sucked", "score": 5, "replies": []}, {"body": "I trade Spy daily for Scalps, consistently make profits easily. It’s my go to", "score": 2, "replies": [{"body": "What’s your strategy", "score": 1, "replies": [{"body": "Price Action trading bro", "score": 3, "replies": []}, {"body": "https://www.reddit.com/r/options/comments/pln76c/small_account_scalping_trader_weekly_update_2/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nThat post is the exact same thing I do", "score": 1, "replies": []}]}]}, {"body": "Yeah. The low VIX forces you to take on a lot more risk. \nI had been selling call spread at the top of the RUT nowadays. It has a slightly higher IV rank than SPX and I can't fathom anything that would break the RUT out of it's range bound to the upside. We would need negative interest rate and eradication of COVID. On the other hand, I can see many thing that would make it break down.", "score": 3, "replies": [{"body": "RUT?", "score": 2, "replies": [{"body": "Russell 2000", "score": 3, "replies": [{"body": "My bad- thanks", "score": 1, "replies": []}]}]}]}, {"body": "Haha I don’t understand half of what you’re saying but I GET it.", "score": 2, "replies": []}, {"body": "What’s your strategy", "score": 1, "replies": []}]}
{"title": "CNBC Signs Jim Cramer to New Multiplatform Deal", "selftext": "CNBC is locking in one of its star hosts to a new deal.\n\nThe business news channel has signed a new deal with Jim Cramer, the host of Mad Money and Squawk on the Street regular.\n\nOne key new aspect: The deal also includes a multiplatform element, with Cramer set to write articles and create web videos for CNBC’s website. The company will also launch a new subscription product, the CNBC Investor Club with Jim Cramer, and will work with Cramer to create and launch new live events and conferences.\n\nCramer had previously founded TheStreet.com, which he sold to TheMaven in 2019. TheStreet had been the exclusive home for Cramer’s digital commentary and subscription stock tips. Now, Cramer will bring those products to CNBC through Cramer Digital. Margaret de Luna, who was previously president and COO of TheStreet, recently joined CNBC as GM and senior vp of its direct-to-consumer businesses.\n\nThe company is betting that Cramer’s infectious personality and established digital and TV bona fides will help it turbocharge its direct-to-consumer offerings.\n\n“Jim Cramer is truly one of a kind. He has the unique ability to masterfully break down complex topics and make them digestible for everyday investors,” said CNBC chairman Mark Hoffman in a statement. “And now, for the first time, CNBC will be the home for all of Jim’s media creating a virtuous cycle for his devoted viewers and loyal members to easily engage with exclusive content across all platforms and serve as a one-stop shop for sponsors and advertisers looking to interact with Jim’s comprehensive suite of products on a deeper level.”\n\nhttps://www.hollywoodreporter.com/tv/tv-news/cnbc-jim-cramer-new-deal-1235010604/#recipient_hashed=4c4261429d0b9dd09afa314e5a8c16a34b433a3f1a34214cdd002de90dd3f4e7", "id": "pl3v72", "created_utc": 1631213008.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 24, "comments": [{"body": "[deleted]", "score": 16, "replies": [{"body": "\"He has the unique ability to masterfully break down complex topics and make them digestible for everyday investors\"\n\nThis is the dude that said he didn't like SPACs because he didn't understand them.", "score": 5, "replies": []}]}, {"body": "This guy is a moron and CNBC is totally out of touch with their audience. Or they know he can be bought/paid to say anything they want\n\nCould also be they aren’t interested in developing a younger more aware audience.", "score": 11, "replies": [{"body": "Go to literally any stock sub and they bring him up fairly often. Do you think that Christine Romans, Andrew Sorkin, Becky Quick and others have NEARLY that type of ability to raise controversey and draw interest? I'd wager that many people here haven't heard of at least one of them. \n\nCNBC knows exactly who their audience is and they know that Jim Cramer knows exactly how to interest them, even if it's as simple as saying controversial things about popular stocks.", "score": 4, "replies": []}, {"body": "This guy is a moron and CNBC knows its audience perfectly. He's an eyeball-capture machine.\n\nIf they want younger people they'll hire somebody they like from WSB or StockTwits to try out. I think though they understand that young people don't even have basic cable.\n\nAnd there is only One True Clown Prince of Pump.", "score": 2, "replies": [{"body": "Maybe not such a moron. Just goes along with the money. I’m sure he gets paid well. We all know there’s very little truth in the MSM.", "score": 1, "replies": [{"body": "\n>We all know there’s very little truth in the MSM.\n\nThere's no truth on the channel that trains people to hate the \"MSM.\"", "score": 2, "replies": []}]}]}, {"body": "He is not a moron. That's what he wants you to think. That's how he thinks he can make himself relatable.\n\nHe is one hundred percent above average intelligence and certainly very good market and stock knowledge.", "score": 2, "replies": [{"body": "Yeah I notice in videos of him at VIP parties and conventions some of the people seem to be laughing at him. After reading your post now I think that may be his intention.\n\nI don't mean they're in on it with him. They are genuinely laughing at his sometimes goofy manner. He's getting them to do that I think.", "score": 0, "replies": [{"body": "Exactly. I guess he started doing those mannerisms when he was still a hedge fund manager, and people would underestimate him, and that's how he got around.", "score": 1, "replies": []}]}]}, {"body": "You obviously have not watched CNBC or Mad Money enough (good for you honestly), but the amount of boomers that call in to his lightning round thanking him for changing their lives with his stocks is just astronomically high. They swear by him and as long as he's on air he will have an audience.", "score": 1, "replies": []}, {"body": "Please tell me who the audience of CNBC is and why you care", "score": 1, "replies": []}]}, {"body": "I never understood these people a stock market is supposed to be a place to grow your wealth but why continue working forever?.\n\nThe narcissism of these people is f****** off the charts", "score": 2, "replies": []}, {"body": "Cramer is like professional wrestling. It's partly real, but  mostly theatrics. Woe to anyone who follows his advice blindly.", "score": 2, "replies": [{"body": "Well back in 2007 I did and lost a couple pairs of shirts before I stopped listening", "score": 1, "replies": []}]}, {"body": "I HATE THIS CLOWN", "score": 1, "replies": []}, {"body": "Can't stand him. Mockery.", "score": 1, "replies": []}, {"body": "Great, more delta variant fear mongering and pumping of LULU.", "score": 0, "replies": []}, {"body": "Are they trying to lose viewers?", "score": 0, "replies": []}, {"body": "FUCK CRAMER", "score": 0, "replies": []}, {"body": "Cramer is more of a colorful media personality. he gets paid big bucks for viewership. \n\nspeaking of which, Stephen A Smith from espn is one of highest paid media \"analysts\" on TV. i bet this guy's contract size dwarfs that of most other tv show hosts.", "score": 1, "replies": []}, {"body": "Anyone upset at Cramer finding success in cable TV infotainment need only look at some of the hilariously absurd people on other networks that find success. He’s not the first jagaloon to make millions by being bombastic and irreverent.\n\nCramer helps people both make and lose money. It’s actually less unnerving when you realize how many people exist solely to help people lose money.", "score": 1, "replies": [{"body": "Anyone that says to match your Roth and your company's match before investing in individual stocks is fine by me.   He simply there to fill the 24-hour news cycle and if you can't handle that f****** change the channel", "score": 1, "replies": []}]}, {"body": "Jesus Christ. What is it with keeping these old hags in front of the camera for so long. This guy has enough money to retire on an island. Get this shit out of here and find some new, young talent.", "score": 1, "replies": []}]}
{"title": "Psycho Market Recap - Thur Sept 9", "selftext": "**Summary**\n\nStocks opened higher in the morning before turning lower as market participants continue to balance a hot jobs market against a dent in economic momentum caused by surging coronavirus Delta variant cases in the US. The three major indexes are having one of the worst-performing streaks this year, while the Russell 2000 (IWM), which tracks the performance of small-caps, fared slightly better.\n\nAccording to a report released yesterday by the Bureau of Labor Statistics, the number of job openings in August was 10.9 million, higher than estimates of 9.9 million and the 10.18 million last month. The rate of job openings measured against the total labor force swelled to 6.9% in July, up from 6.5% the previous month and 4.6% a year ago. From an industry standpoint, the rate jumped to 10.7% from 10.2% in the critical leisure and hospitality field, which has suffered the most during the Covid-19 pandemic. Openings rose to 1.82 million, a total gain of 134,000 last month. There are enough job openings to cover the roughly 8.4 million unemployed Americans. \n\nCoinciding with an increase in job openings, in its latest Beige Book, which is basically a report by the Federal Reserve on current economic conditions, members said the economy downshifted slightly due to Delta variant concerns. The report stated, “The deceleration in economic activity was largely attributable to a pullback in dining out, travel, and tourism in most Districts, reflecting safety concerns due to the rise of the Delta variant, and, in many cases, international travel restrictions.” \n\nMembers of the Fed have consistently signaled they will be looking especially closely at labor market data to determine when to start tapering the pandemic-era quantitative easing program. Federal Reserve Governor Christopher Waller said the August Jobs Report could be his signal to hit the “substantial further progress mark” the Fed stipulated in December and begin tapering. He said, “I think that one more good job report if it’s in the 850,000 to 1 million range will be sufficient to claim substantial further progress in employment for tapering.” August was not the report they were looking for. \n\nUnfortunately, a summer that began with plunging coronavirus cases nationwide and real hope that the worst of the pandemic was behind us as the effective vaccination drive began is instead drawing to a close with the US firmly in throes of the pandemic once again, due to the highly contagious Delta variant. \n\nThis weekend, hospitalizations were roughly 300% higher than Labor Day weekend in 2020, according to data from Johns Hopkins University. The surge in patients comes as the highly contagious Delta variant continues to spread across the US, and coincided with a weekend that saw a spike in travel. According to the Transportation Security Administration, more than 3.5 million people traveled across the country on Friday and Saturday for the Labor Day holiday, despite the Centers for Disease Control and Prevention’s recommendation for unvaccinated people to refrain from traveling.\n\n**Highlights**\n\n* The crackdown in China continues… This time, regulators of video game companies execs to focus less on profits and implement controls to prevent video game addiction. Companies were “urged to break from the solitary focus of pursuing profit or attracting players and fans.\n* Russian Cybersecurity firm Yandex (YNDX) said it successfully repelled the biggest distributed denial-of-service (DDoS) attack in history. This comes just after American company Cloudflare (NET) repelled the previously largest DDoS attack on Aug 19. The Yandex attack was 22 million requests per second, while Cloudflare’s was 17.2 million requests per second. Cybersecurity is becoming ever more important as attacks become more complex and powerful.\n* Weekly first-time unemployment claims came in at 310,000, a pandemic-era low, well below estimates of 335,000\n* JP Morgan (JPM) announced it was acquiring Infatuation, a company that owns different websites and apps that guide diners to restaurants in cities around the world from Alphabet (GOOG, GOOGL). Could be to make a new dining credit card reward program or something\n* Ray-Ban and Facebook (FB) have teamed up to release new smart glasses that have a camera, mic and speakers, and a voice assistant to let you do things hands-free, similar to Snapchat’s (SNAP) glasses. Honestly, I don’t know what these would be useful for right now\n* With the NFL kicking off today, sports betting analysis firm PlayUSA says it expects over $20 billion to be wagered, nearly tripling the $7.5 billion wagered in 2020. I’m a huge sports fan and sports betting stock bull. My fav currently is PENN\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Costco (COST) target raised by Morgan Stanley from $425 to $500 at Overweight. Stock currently around $466\n* Cisco Systems (CSCO) target raised by Wells Fargo from $65 to $70 at Overweight. Stock currently around $58\n* Global Payments (GPN) target raised by BMO Capital Markets from $206 to $217 at Outperform\n* Lululemon (LULU) with a host of target raises after smashing earnings and raising guidance. Average price target of $475 at Buy. Stock currently around $420\n* NetApp (NTAP) target raised by Morgan Stanley from $96 to $102 at Overweight. Stock currently around $92\n* Restoration Hardware (RH) with a host of target raises after smashing earnings and raising guidance. Average price target $775 t Buy. Stock currently around $725\n* Sherwin Williams (SHW) target raised by JP Morgan from $310 to $330 at Overweight. Stock currently around $299\n\n**“The way to get started is quit talking and start doing.” - Walt Disney**", "id": "pl5mt1", "created_utc": 1631218401.0, "score": 81, "upvote_ratio": 0.88, "num_comments": 29, "comments": [{"body": "Also, $MRNA is on fire. Up almost 8% just today, developing four vaccines against COVID variants.\nPrice was just below $400 a few days ago.", "score": 15, "replies": [{"body": "Yea it has!! Very exciting for MRNA holders", "score": 2, "replies": []}]}, {"body": "How you gonna quote Walt Disney right after talking about a bunch of pt upgrades and not mention dis just got a 265 PT today!", "score": 10, "replies": [{"body": "Must've missed it, my apologies", "score": 3, "replies": []}]}, {"body": "Thanks as always for this.\n\nCould you share a specific as to why you lean toward PENN? I've been wanting to land on a GAMING stock, but it feels like whack-a-mole;- so many moves happening I can't build a good opinion...", "score": 6, "replies": [{"body": "Sure, few very basic reasons why\n\n1. Compared to say DKNG, I think PENN is more fairly valued and has a longer track record\n\n2. I think the acquisition of Barstool Sports and The Score Media were very nice, vastly expanding the company's reach\n\n3. Not a pure sports gambling play like DKNG so slightly more diversified. PENN also operates brick and mortar casinos and stuff", "score": 9, "replies": [{"body": "I sure appreciate that. Your #3 is what I was thinking as well. I work in streaming tech, but I still prefer to have the brick and mortar grounding. Why I can’t get behind some of these pure tech plays. I’m  from East coast so I’ve been to a few of their places.\nThanks for whittling down the recent acquisition news. \nDoesn’t seem outlandishly prices like Tesla and, I’m sorry, I just don’t get Restoration Hardware!\nI might try getting in on this through using options as intended.\nCheers!", "score": 2, "replies": [{"body": "Cheers!!", "score": 1, "replies": []}]}]}]}, {"body": "Excellent writeup. I look forward to reading this everyday. Also like the analysts upgrades summary. Keep up the great work !", "score": 7, "replies": [{"body": "Thank you my friend, really appreciate the compliment", "score": 2, "replies": []}]}, {"body": "I went all in, calls 9/10 451 @ spy today.. 4600 dollars worth.. my entire bank account............", "score": 6, "replies": []}, {"body": "SQ has been taking a beating recently. Hopefully tech bounces back to more ATH when they delay the tapering (again)", "score": 3, "replies": [{"body": "It gets smacked with crypto", "score": 1, "replies": []}]}, {"body": "Thanks for the recap! It's awesome as always", "score": 6, "replies": [{"body": "Appreciate the compliment!! Thanks", "score": 2, "replies": []}]}, {"body": "Fantastic read thank you and have an awesome rest of the day, cheers.", "score": 2, "replies": []}, {"body": "I use to work at Oakley sunglasses. They tried the smart glasses years ago and it completely failed. Luxottica owns Oakley and Ray-Ban and almost every other major brand. The only people I can see wanting these glasses are streamers who do IRL stuff. I personally don't get it but it's huge on Twitch.", "score": 2, "replies": [{"body": "I agree! Apart from streaming or other pretty niche uses, IDK what Facebook's new glasses really bring\n\nJust my opinion but Id never buy them, dont do anything my phone already cant", "score": 1, "replies": []}]}, {"body": "Thanks for the write up! Solid info. The market is stalling with the new round 5 of Covid fears a little it seems", "score": 3, "replies": [{"body": "Yea unfortunately it has with Delta variant surging, hopefully it makes more people get the vaccine!", "score": 4, "replies": [{"body": "Amen", "score": 4, "replies": []}]}]}, {"body": "ATER has a amazing rally not too late to get in at $10.", "score": 0, "replies": [{"body": "Is there any news on the stock? Why is it rising?", "score": 2, "replies": [{"body": "There has been a influx of investors the 3 Month average volume was 2M last week today it was 70M. There seems to be alot of investors that seem to have found the bottom of a dip that will go back up. It's hit top US stock gainers several times in a week.", "score": 2, "replies": []}, {"body": "Call me out if this stock doesn't out perform every stock mentioned in this sub in the next 7 days.", "score": 1, "replies": []}]}]}]}
{"title": "Best growth stocks (tech) currently 10 percent or more below their ATH?", "selftext": "First of all, is there an easy way to look this up? I'd like to know what percent a company is away from their ATH, I can of course do some maths to find out, but who wants to do maths?\n\nAnyways, two that spring to mind for me are **AMD** and **QCOM**. AMD's ATH is $122.49. It closed today at $106.15. It's a bit over 13 percent below it's ATH. QCOM's ATH is $167.94. It closed today at $141.58  It's about 15.7 percent below it's ATH.\n\nSo, if you imagine that AMD or Qualcomm will hit a new ATH in the next six months, it might be worth it to jump in there for a quick 13 or 16 percent, respectively.\n\nDo you know of any other solid tech stocks that have real products, real management and a proven track record that are similar to these two?\n\nNote: I don't own any shares in AMD or QCOM at this time", "id": "pl8lty", "created_utc": 1631227931.0, "score": 4, "upvote_ratio": 0.61, "num_comments": 30, "comments": [{"body": "AMD only touched 120+ very briefly, I still feel like it’s ATH. I don’t think there’s an\nEasy 15% in its price", "score": 11, "replies": [{"body": ">  I don’t think there’s an Easy 15% in its price\n\nIf this stuff was easy, we'd already be rich", "score": 2, "replies": []}]}, {"body": "Not sure if AMZN is considered tech or not but it’s about 9% from its ATH.", "score": 15, "replies": []}, {"body": "Pretty sure AMD is going down to meet the eventual merger price with Xilinx. Xilinx is still at a discount at $154 when AMD is at $106, since Xilinx shareholders will get 1.7234 shares. This is assuming the merger is approved.", "score": 6, "replies": [{"body": "any link or source for reading more on this?", "score": 1, "replies": [{"body": "https://www.amd.com/en/corporate/xilinx-acquisition  \nhttps://www.barrons.com/articles/xilinx-could-be-a-cheap-way-to-play-amd-thanks-to-the-merger-arbitrage-spread-51628188820", "score": 2, "replies": []}]}]}, {"body": "ROKU, ZILLOW, ENPHASE", "score": 6, "replies": []}, {"body": "ADSK.", "score": 3, "replies": []}, {"body": "TTD.", "score": 3, "replies": []}, {"body": "Uber", "score": 3, "replies": []}, {"body": "V and MA", "score": 3, "replies": []}, {"body": "Baba", "score": 7, "replies": [{"body": "Who?", "score": 1, "replies": [{"body": "Sofi", "score": 1, "replies": [{"body": "Who?!", "score": 1, "replies": []}]}]}]}, {"body": "PINS FVRR ZM ABNB SOFI ETSY", "score": 5, "replies": []}, {"body": "Most stock screeners have % off 52 week high, would that work?  I know fidelity has that option", "score": 2, "replies": []}, {"body": "Check out the tradingview stock scanner", "score": 2, "replies": []}, {"body": "CRM might get there, 5% off its ATH.  PYPL is also 7-8% off its ATH.", "score": 2, "replies": []}, {"body": "Sea Ltd", "score": 2, "replies": []}, {"body": "Global Payments Inc $GPN its payments/tech company tho. Pretty underpriced at the moment", "score": 2, "replies": []}, {"body": "SHOP", "score": 1, "replies": []}, {"body": "pins, tdoc, fvrr.", "score": 1, "replies": []}, {"body": "TDOC", "score": 1, "replies": []}, {"body": "LMND", "score": 1, "replies": []}]}
{"title": "I'm hard for $HIMS", "selftext": "Hey everyone. Fellow retard here that wants to help someone potentially make some tendies. Today I will be discussing $HIMS and why YOU TOO should ~~get hard~~ buy it and hold it for a while/**Disclosure (I currently hold shares):**\n\n[My position](https://preview.redd.it/sfc11h2xghm71.png?width=344&format=png&auto=webp&s=a4c9882205f6f56ae2271c536a53f9b147f06063)\n\nThe reason i'm not heavy in options is: **1.) the IV is too high**  • **2.) the stock is under $10  • 3.) I'm retarded**\n\n# Synopsis:\n\nI usually think of getting into a position based on where I think the company can disrupt inside of current culture. Now I don't know about you, but in today's world of free porn, the ability to swipe on hundreds of potential matches (bumble/tinder) has put a lot of pressure on guys/girls to look and feel their best. But who wants to walk into a doctors office and tell the 75 year old man that he is having a hard time getting it up? Or that his hair is going away? Or that she wants to clear those dots off her skin. It's 2021. Can't we text you?\n\n***$HIMS takes away the pressure of going to a doctor to try and explain why you want some blue bombers. If you could save yourself the embarrassment of telling another soul that you want to rock your girl's world without saying it face to face - wouldn't you?***\n\n# Technicals (here comes the crayons):\n\n[If anyone believes in voodoo magic, that is a breakout of a loooonnng wedge. ](https://preview.redd.it/xrrtjernihm71.png?width=1278&format=png&auto=webp&s=2283c05f94c4e49e58f67d9f89a3dd0d8daa3fbc)\n\nAlso, it's trading underneath it's IPO price... in a growing field... that will... only get bigger..... If you don't like that chart, just flip it upside down.\n\n[Recent Insider Buying. Why would the director load up 1.8million dollars on a cost over the price of the stock? Does he hate money? Is he retarded? That's for you to decide.](https://preview.redd.it/reqzifugjhm71.jpg?width=2048&format=pjpg&auto=webp&s=fc57dc7b6a9efd30efae914723a5d923519d601d)\n\n\\*\\*\\*From some random twitters that I get my bias from:\\*\\*\\*$HIMS likely to be on a run-rate of more than $300 million by Q4 2021, to just be burning through $15 million per quarter isn't much at all, considering the amount of investment that's required to grow consumer awareness of its brand. Management holds nearly 40% of the stock.  Stock is near all time lows.\n\n$HIMS originally guided for 2021 revenue of $179 million *before* going public. Now guiding for $255 in 2021, ahead of the 2022 revenue projections.\n\n# The Sector:\n\nTelemedicine has exploded since the COVID plandemic has hit. People are realizing not only can you work from home, but you can get most of your basic health needs done from the tap of a few buttons rather than in a waiting room. Sure, if you have a rash on your junk, you should probably see a doctor. But hey, if you want to kick it up a notch with the ladies... Hydrate your skin or just consider getting some more of your hair back.. Why would you walk into an office? This sector is growing at such a rapid pace, it's going to become more normal than a specialty. Kind of like.. you know calling someone versus texting someone.\n\n# The looks of the company:\n\nIf you look at the marketing and branding, they feel young and fresh. Partnering with people like Gronk (Bucs player) / Miley Cyrus (singer) and the look/appeal of the website reminds me a lot of what brought a lot of success to companies like Lululemon, or hell even Apple if you want to go that far. Keep it clean, keep it simple. They are focused on a target that uses phones as part of their daily ritual. A target that uses TikTok/IG for advice versus listening to the boomers at the dinner table.\n\n# End thoughts:\n\nWhile I don't know if the stock will ultimately go up, i do believe at this price... the risk is well worth the reward. It won't rocket like $GME/$AMC on some meme dream, but if you hold it for a while we could see a similar pattern to what happened with $TDOC. I have no gay bear thesis here, because we all know stonks only go up.\n\nGL out there traders. $HIMS is still at an incredible price.", "id": "pkywqh", "created_utc": 1631197747.0, "score": 37, "upvote_ratio": 0.87, "num_comments": 24, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|2 years ago\n**Total Comments**|9|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/cu5dqc/more_on_lulu/) \n**Account Age**|8 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Hell, under $10 with potential, I’m in.", "score": 12, "replies": []}, {"body": "you had me at retarded", "score": 11, "replies": []}, {"body": "Aped in because I think the name is funny.", "score": 9, "replies": []}, {"body": "I just got hard.", "score": 9, "replies": []}, {"body": "Multiple paragraphs with charts and titles? I’m in.", "score": 6, "replies": []}, {"body": "Is it OK if I already bought $SHIMS and $HERS matching socks with the profits?", "score": 5, "replies": []}, {"body": "7100 shares at a sub $8 price average. Long term hold", "score": 3, "replies": [{"body": "my dude.", "score": 2, "replies": []}]}, {"body": "Fucking guy had to buy those shares because his stock options expired, fucker. And your wedge is based on 3 points, not enough to say it’s well defined at all. It’s trading below IPO price because it was overvalued in the first place. Ur gay, ur friends r gay, ur dads gay.", "score": 4, "replies": [{"body": "Anyone who says anything is overvalued, probably holds $TSLA and can't explain that one either. Thanks dad.", "score": 5, "replies": [{"body": "TSLA isn’t overvalued. Their tech development is unparalleled and their market extends beyond automotive. Also, I don’t own any TSLA. I only own shares of your moms ass. You’re welcome, son.", "score": -7, "replies": [{"body": "My mom's ass is overvalued", "score": 13, "replies": [{"body": "My moms ass is extremely undervalued. Maybe we can help you. 😉", "score": 1, "replies": []}, {"body": "It ain’t nothing like it was before you were born, that’s for sure.", "score": -5, "replies": [{"body": "wtf did I just read", "score": 6, "replies": [{"body": "Quality content on WSB.", "score": 7, "replies": []}]}]}]}]}]}]}, {"body": "No idea about this company other than their ads a literally the worst. You have to be a retard to buy this", "score": 0, "replies": [{"body": "Won't lie, Gronk is a terrible actor and a sellout when it comes to advertising... but he's a top known player in the NFL, so that will garner attention anyways.  I think the Miley stuff is pretty cool though.", "score": 3, "replies": []}]}, {"body": "They are selling the same generic Viagra that many other online companies are. There is nothing proprietary at all here. Pretty sure their products aren't covered by insurance so the people who use them are just afraid to go to the doctor for a prescription. The advertising is horrible. I don't see any value here.", "score": 1, "replies": [{"body": "Macys sells clothes just like Lululemon\n\nReebok sells shoes just like Nike\n\nBing searches just like google\n\nIn other words, someone has to lead a sector - my bet is HIMS. Also, you are wrong about the prescription but i'll table that for another discussion. \n\nSee ya at $15+ by EOY", "score": 3, "replies": []}]}]}
