{"title": "AAPL Stock falling", "selftext": "So.... Why is it falling? The lawsuit did seem that bad and in fact apple kinda won right? Also after the showcase it falls as usual but.... why is it keep going down?", "id": "ppiejb", "created_utc": 1631814966.0, "score": 9, "upvote_ratio": 0.8, "num_comments": 23, "comments": [{"body": "Whole market is dumping, nothing AAPL only", "score": 17, "replies": [{"body": "pretty typical of sny doldrums period. lots of caution\nand 147seems to be holding. relac if upu sre holding. aapl will ho higher fairly soon. tje whole market is cautious", "score": 5, "replies": []}]}, {"body": "Just buy.", "score": 7, "replies": [{"body": "i will", "score": 2, "replies": []}]}, {"body": "So you can buy it………", "score": 5, "replies": []}, {"body": "Bears", "score": 5, "replies": []}, {"body": "inhale, exhale. ignore and just buy more.", "score": 4, "replies": []}, {"body": "Lol it’s not “falling” it was a small correction in the market after a 25% run! Relax", "score": 2, "replies": []}, {"body": "I’m betting my aapl holdings go up or down today.", "score": 2, "replies": []}, {"body": "Too high expectations from a cell phone, it’s not made to transport you into outer space and back like in Star Trek. Apple is victim to its own success and people are weary about the high valuation of the stock. Basically sitting on the fence and waiting for another blockbuster quarterly and yearly results to decide to jump in.", "score": 0, "replies": []}, {"body": "R.I.p. aapl been nice knowing you", "score": -4, "replies": []}, {"body": "Because stocks don’t only go up. There are fewer buyers at higher prices.", "score": 1, "replies": []}, {"body": "Wait for 10/28 the earnings will make it rise a week or so after the post", "score": 1, "replies": []}, {"body": "Apple 14 (the rumor is) will be something revolutionary, an all new design. That will 100% reflect in stock price. Hold the line man", "score": 1, "replies": []}, {"body": "Personally, Ima looking at this as a fine buying opportunity", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Omg haha this made me laugh bro :) I bought £5k Apple @ 147 but I'm thats my safe bet\n\nCheck wish out, I got in that @ $7 around 700 shares but looking to grab more on payday (holding until atleast 2023) i believe this WILL deffo 2/3x & CAN 4/5x from current price by mid 2023 🚀 👩‍🚀 👨‍🚀 \n\nFingers crossed 🤞", "score": 1, "replies": []}, {"body": "I YOLO'ed @ $155 and it started tanking a day after I got in.\n\nI sleep fine because I know I will get dividends and in 7 years from now it will probably be 3x of where it is now. See ya when this company is a $10T and then first to $100T company. 🤷🏽‍♂️", "score": 1, "replies": []}]}, {"body": "AAPL stock technical adjustment will also pull up", "score": 1, "replies": []}, {"body": "Buying on the cheap is a good opportunity", "score": 1, "replies": []}]}
{"title": "Why do people keep referencing 2000-level valuations as a basis for a possible crash?", "selftext": "If we assume the stock market will go up long term, shouldn’t we assume that the market will far exceed the values seen during the internet bubble? \n\nFrom my view, “internet” companies are entirely different now, with literally the largest balances sheets in the entire world. I am curious to know other thoughts or opinions on this. Thanks!", "id": "ppn7pl", "created_utc": 1631829845.0, "score": 2, "upvote_ratio": 0.58, "num_comments": 22, "comments": [{"body": "The whole assume the stock market will go up long term is based on the assumption that earnings will continue to grow long term (as has always happened).  If you look at market cap the market is way above 2000 which is where the market will go up long term comes in.  When people talk about valuations on the other other hand they are talking about how expensive a company is relative to earnings.  The fact that valuations are getting so high relative to earnings is what may be a cause of concern for some.", "score": 14, "replies": [{"body": "Not even close to the valuations in 2000, but hey, let’s ignore facts", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Good point!", "score": 1, "replies": []}]}, {"body": "because the same principles apply regardless of the year. valuations in US stocks got higher than average in the late 1920s, the late 1960s, and the late 1990s measured by P/E or the Schiller P/E or the price to sales ratio or whatever. Japanese stocks got overvalued in the late 1980s, then they crashed and needed decades to recover. the same thing has happened many times in many different nations. \n\nhttps://www.thewpi.org/images/other.pe.ratio.chart.jpg\n\n\nhttps://d1yoaun8syyxxt.cloudfront.net/wr211-82e499c9-2537-49c7-afeb-6f5943419588-v2\n\nhttps://i.insider.com/4d81f3594bd7c82d1f0a0000", "score": 3, "replies": [{"body": "This is extremely helpful. Thank you!", "score": 1, "replies": []}]}, {"body": "As others have pointed out, you are confusing market capitalization with market valuation. Market capitalization is determined by multiplying the number of shares outstanding by the price of the stock. One would expect this to increase over the years due to growing earnings and inflation. Market valuation is determined by dividing the market capitalization of the stock by the earnings of the stock. This metric allows for a fair comparison between companies of different market caps and different industries and is a better indicator of the value of a company. It's also the inverse of the earnings yield. This metric peaked in 1999 at about 25 times forward earnings estimates of the S&P 500, which are the expected earnings for the next 12 months. Today it stands at about 21 times forward earnings estimates and it is at its highest levels since then. It has averaged about 15 times since 1928. \n\nHistorical price earnings ratios, which are based on the most recent 12 months of earnings, average about 16-17 times. Since 1990, the historical PE ratio has averaged between 21-25 times, depending on how one accounts for periods with depressed earnings. Given the depressed earnings of the last 12 months, it is difficult to value the index based on historical PE ratios. But if you shift to future earnings, you can see that the S&P 500 is at a value now that you'd expect it to be at this time next year, that is 21 times.", "score": 3, "replies": []}, {"body": "People like to pretend they can find patterns and time the market. The truth is the past can only really be looked at as something to learn from and how the giants that are still here weathered the storm. I think it because people look back at what they can pull up data on and make some what educated guesses.", "score": 2, "replies": [{"body": "1: “That pizza just came out of the oven.”\n\n2: “I’m going to eat it….. It burned the roof of my mouth!”\n\n<10 years go by>\n\n1: “That pizza just came out of the oven.”\n\n2: “We know nothing about that pizza, I’m going to eat it.”\n\nGuess what happens next?\n\nCrashes happen every 10 years or so because it takes 10 years for the next batch of suckers to accumulate enough wealth to wipe out. People that remember the last crash are about to steal Millennials’ life savings. And in another 10 years, the Millennials will do it to the next generation. Don’t be fooled twice. Good luck!", "score": -1, "replies": []}, {"body": "Agreed.\n\nAll creatures, especially humans, try to identify patterns (and benefit from the knowledge).\n\nSince the stock leaders of this current market are tech stocks, the closest comparison would be tech companies and their movement throughout history.\n\nIf you expect a crash, then your brain will try to draw parallels between today and 2000.\n\nIf you expect explosive growth, you will draw comparisons with a different time.\n\nConfirmation bias plays a big part. We see what we expect to see, somehow.", "score": 1, "replies": []}]}, {"body": "Anti-tech and anti-Internet Clinton is no longer our ruler so I don't think tech stocks will ever go down that much again.  Biden appointed the anti-Internet Lina Khan to head the FCC, but she is an idiot so I don't think she'll be able to do much to hurt tech or the Internet.", "score": 0, "replies": []}, {"body": "not how it works", "score": -4, "replies": [{"body": "You are probably right, how would you say it works?", "score": 2, "replies": [{"body": "it’s complicated", "score": -5, "replies": [{"body": "Such smart", "score": 0, "replies": [{"body": "i know i bailed on it. I really just didn’t feel like explaining how valuations work. Seemed like it’s something he should have googled before asking me to do it for him - was too much work", "score": -2, "replies": [{"body": "Lmao", "score": 1, "replies": []}, {"body": "“tHIs tIME iS DIffERenT I SweaR!” - Likely the same people who bought into tech in 2000 and FinServ in 2007.", "score": 1, "replies": [{"body": "The government has been goosing this for a long time. It feels like we are running out of magic bullets \n\nI put a lot of money into cash last week - i’ll wait it out a minute, I still have quite a bit invested but i’m nowhere near “all-in” but i’m old and it’s not like i can wait 20 years to recover", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Why do people piss in each others mouth and enjoy it? :)", "score": 1, "replies": [{"body": "Baha", "score": 1, "replies": []}]}]}
{"title": "Heading into the final quarter of the year, what is your realized gain/loss income for the year?", "selftext": "I'm currently about $8,000 down heading into the last quarter. I intend to probably sell $8,000-$12,000 of my gains to balance out for the year. But otherwise I'm holding most of my winners going into the next year. While I am concerned about potential tax issues ahead, I still feel confident in this years bull market. \n\nWhere are you at going into the final quarter?", "id": "ppnri0", "created_utc": 1631831763.0, "score": 10, "upvote_ratio": 0.85, "num_comments": 23, "comments": [{"body": "I’m up 1000% in that game store company", "score": 18, "replies": [{"body": "Can’t store\n\nWon’t store\n\n*That* store", "score": 3, "replies": []}]}, {"body": "No sales.... ~8k in dividends.", "score": 9, "replies": []}, {"body": "I am currently up 32% (my daughters account) and 34% in my fun trading account. That's after already withdrawing $30k for 2021 short term taxes", "score": 7, "replies": [{"body": "And leveraging up during the current correction.", "score": 2, "replies": []}]}, {"body": "No realized gain/loss as I’m not selling anything.", "score": 2, "replies": []}, {"body": "I'm down 42%.\n\nGrowth stocks can be risky, moreso they're the first ones to die when the market flips.\n\nSo I'm holding. Meh. Made some dividends along the way, still down $2200.", "score": 2, "replies": []}, {"body": "That means you didn’t make any money. What a bummer. Glta!!!", "score": 2, "replies": [{"body": "No I just held a lot of my winners", "score": 1, "replies": [{"body": "A gain is not a gain until it is realized. GLTA!!!", "score": 0, "replies": []}]}, {"body": "I’m glad to pay taxes. That means I made money!!! GLTA!!!", "score": 0, "replies": []}, {"body": "I'm about to cash in on LWLG. Got lucky and stumbled on the stock at 4 pps.", "score": 1, "replies": [{"body": "Honest question.  Why are you selling now?  It looks to be in a good position to continue an uptrend.", "score": 1, "replies": [{"body": "Oh I'm not \"cash in\" meaning the price is going to run. I see what your saying, bad choice of words", "score": 1, "replies": [{"body": "Maybe I read it wrong. I guess cash out would indicate selling.", "score": 1, "replies": [{"body": "You read it write, I wrote it wrong.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I'm holding tight. Why are you going to take your profits this year? I foolishly reduced my position in Tesla in Dec and ended up with a $20,000 tax bill. If I had been patient and waited until January, I could have held on to my money 16 months. Still have to pay the tax eventually but put it off as long as you can.", "score": 1, "replies": [{"body": "I'm taking profits since I'm down $7,000.. once I balance that out I'll be holding everything till the end of the year unless I sell some losers again.", "score": 1, "replies": []}]}, {"body": "Could sell enough to get to around 3k loss then hold rest", "score": 1, "replies": []}, {"body": "Realized about 33k so far, currently in a play with 8k unrealized, but I can see it ending up probably triple that by years end making me good for year on bills.  I actively trade on a 25-30k account, and only take out my living expenses along with side account to hoard for tax", "score": 1, "replies": []}]}
{"title": "J.D. Power APEAL Study says Tesla owners love their cars the most", "selftext": "", "id": "ppcb42", "created_utc": 1631795164.0, "score": 212, "upvote_ratio": 0.99, "num_comments": 22, "comments": [{"body": "Next up, study shows water is wet and tacos are tasty.", "score": 50, "replies": [{"body": "Water is actually not wet; It makes other materials/objects wet. Wetness is the state of a non-liquid when a liquid adheres to, and/or permeates its substance while maintaining chemically distinct structures. So if we say something is wet we mean the liquid is sticking to the object.", "score": 30, "replies": [{"body": "Good bot.", "score": 7, "replies": []}, {"body": "Bad bot", "score": 3, "replies": []}, {"body": "Dumb bot, water sticks to itself, and thus is wet.", "score": 7, "replies": [{"body": "not really - the interface creates surface tension, beyond the interface layer its just liquid.  The opposite case kinda lends more perspective. https://en.wikipedia.org/wiki/Hydrophobe\n[video](https://upload.wikimedia.org/wikipedia/commons/f/f8/Cutting_a_water_droplet_using_a_superhydrophobic_knife_on_superhydrophobic_surfaces.ogv)\n\npoor bot - it has a long road a head.", "score": 3, "replies": [{"body": "Good bot", "score": 11, "replies": []}]}]}, {"body": "Bad bot", "score": 3, "replies": []}]}]}, {"body": "Can confirm", "score": 13, "replies": []}, {"body": "We're a cult because life is *so damn good* with cult membership.", "score": 14, "replies": [{"body": "After being subjected to my years of ownership, my old man bought a Y and has not stopped talking about it. Very happy for him.", "score": 4, "replies": []}]}, {"body": "I have a 3 and an X. The X has some annoying problems that you shouldn’t get for a car worth 100k…but the pros far outweigh the cons and I’ll buy another one if I can afford it", "score": 7, "replies": [{"body": "What are some of the cons?", "score": 2, "replies": [{"body": "big baby seats sometimes make you have to hit the door close button a second time.\n\nits like those walking away from an explosion memes but you have to turn around and check that the explosion happened, then click the key fob again and keep walking.", "score": 4, "replies": [{"body": "Lol 👌comparison", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Definitely when it comes to those rewards that Chevy “wins” lmao", "score": 3, "replies": []}]}, {"body": "I own a long range model 3 and can attest to this. I've had it for 2 years, driven down to Florida twice from Ontario and in the last month took on a 3.5 week road trip across Canada to Vancouver Island with the help of Autopilot, Camp Mode (Yup - camped in my car lol) and the rapidly evolving supercharger network. \n\nBottom line: I f'ing love my Tesla to this day.", "score": 4, "replies": []}, {"body": "It has to drive JD Power crazy when they have to publish results like this that show what actual customers think about the products and not their own agenda.  Although they did make their expected plug at the end to somehow spin in a neg at Tesla:\n\n\"The results are in contrast to other findings by J.D. Power. Last month they ranked Tesla third last in their 2021 Initial Quality Study (IQS) which measures the number of problems experienced per 100 vehicles (PP100) in the first 90 days of ownership.\"\n\nSo what is the lesson here?  When you make freaking awesome products people love, they'll make exceptions on minor nit picky quality issues... especially when your warranty is better then most the alternatives anyways.  Carry on Tesla.... and rock it!", "score": 5, "replies": [{"body": "Well said, the useful data is what product do people like the best, everything else is just partial pieces of a much bigger picture", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "That’s amazing to hear! I really hope to get me a M3 if we end up getting a really good EV incentive bill for Tesla passed", "score": 3, "replies": []}]}, {"body": "Don’t put any weight to JD powah polls. They are dumb.", "score": 3, "replies": []}, {"body": "The best water is \"wet\" video ever: https://www.youtube.com/watch?v=ugyqOSUlR2A", "score": 1, "replies": []}]}
{"title": "Blackstone the King of Unfettered Capitalism", "selftext": "&#x200B;\n\n[Oxford dictionary picture of chad](https://preview.redd.it/zz1u3labbsn71.jpg?width=1600&format=pjpg&auto=webp&s=89a17dcd1e9a4bca192abddbd54643e1e2882f7b)\n\nHow I found $BX\n\nI am almost reluctant to post this DD because I imagine that if this post actually gains traction it'd ruin the stock in some sort of stupid way. But that is beside the point because I can't resist I have to reveal Wall Street's best kept secret. I Stumbled upon Blackstone way back in 2018 when it was trading at around $45 a share I had a very simple reasoning for wanting this stock, I needed something with a fat divi Yield and that could be realied on to make consistent growth so I wouldn't have to worry about dollar cost averaging to capture the juicey yield. This criteria was met with the introduction of Stevei into the equation I believe what happened to turn me on to this stock was that I learned that steve here had received $800 million worth of stock and stock options as a form of compensation that year which seemed like an apsurd amount for someone who was already a partner and co-founder of the world's largest PE firm. Usually CEOs take stock as comp when they genuinely believe that the company is undervalued or will grow in the future. Now I had no doubt that Stevie would want to grow his baby but $800 million worth is a ton of conviction so right there I decided to pickup some $BX in my longterm portfolio. Fast forward 3.5 years and you arrive here today and holy shit I understasnd the conviction now.\n\n&#x200B;\n\n[1 day 3 year doesn't it make you wet](https://preview.redd.it/1akpfnudbsn71.png?width=1982&format=png&auto=webp&s=f7b0035de2242e0fd2d69950b6088df4b609aca4)\n\n$BX Lore\n\nSo backstory over what is the lore behind this firm what do they do, well they are a classic private equity firm in the sense that everything you think private equity does they do expect they are the best at it. Like they are the amzn of the PE business. Ok great well what is private equity, its pretty self explantory but they take private money from pensions, trusts and high net worth individuals, consolidate it into a fund and then LEVER IT TO THE TITS and I do mean to the tits. You see the whole stick of private equity is kinda like this weird companation of the hedge fund business and the investment banking business. So they do deals that you would see in the investment banking sector like buyouts and real estate investment, which is a massive money maker. But they also act like a hedge fund with these funds by not only investing in hedge fund solutions but also actively investing in companies through credit lines and purchases of equities. The private equity firm in its simplist descripition is a hedge fund that wanted to grow up but didn't want to be regulated like a bank. So what is the reason for its meteoric rise well its because they have actually been devesting from investments made in years prior. The problem with going long a private equity firm when you hear about a big purchase by them is that the invest takes years to mature. So what I imagine is happening in this scenario is that Blackstone is devesting from the big investments they've been making the last decade or so and just dumping all these profitable businesses onto an inflated market thus raking in the dough. And as a nice result pumping the stock price.\n\n&#x200B;\n\n[quaterly earnings](https://preview.redd.it/397pgsngbsn71.png?width=339&format=png&auto=webp&s=7406e31b05aa1d3a34d2654017952dab3c9f716e)\n\n&#x200B;\n\n[yearly earnings](https://preview.redd.it/mzekxbyibsn71.png?width=340&format=png&auto=webp&s=639acd2bd4aafd5e19684b3f93ecbd52c927199f)\n\nThe Trade\n\nSo as you can see this year has been very good for $BX they have been making a consistant effort to devest from their most profitable businesses that are soaring during the market boom. I beleive this is going to continue to happen through the end of the year. I really don't think they are going to enter into to many deals simply because the market is so frothy which is a great thing for the stock as it will encourage steve to buyback or increase the divi so barring some economic jolt $BX does not have any forseeable headwinds. That being said right now all indicators are sayings its overbought as shit which is completely true it has been invincible these last couple of weeks. Personally I have some $120 dec. calls that I picked up about a week or so ago and have been holding on ever since taking profit as it runs but I plan on buying the next sign of weakness. As for the strategy its really very straight forward I own shares because I like the company and I going to buy calls during these long bull runs. Since the stock isn't glamourious I usually chose ATM or ITM options just so I don't have to worry about theta or IV to much if the stock decides to trade sideways for a while\n\nMisc.\n\nObviously I am not a financial advisor I do this for fun do your own research. Also if you want I do sometimes stream myself working on DD as high\\_yield on Twitch so if you want to stop by see the sausage get made feel free I dont have a schedule or anything but I'll probably do some DD tonight if your reading this in new\n\nTL:DR Blackstone super greedy make lot of money you can to simple as that\n\npositions +20 $BX avg. 116.83 +40 $BX 45.00\n\n\\+5 Dec 15 120 calls @ 5.64 (took 3 of them off the table over the last couple of weeks)", "id": "pp5ie2", "created_utc": 1631763038.0, "score": 12, "upvote_ratio": 0.76, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|28|**First Seen In WSB**|3 years ago\n**Total Comments**|53|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/oz1w1v/ocgn_has_a_lot_of_room_to_run/) [x](https://www.reddit.com/r/wallstreetbets/comments/pp5bno/blackstone_the_daddy_of_unfettered_capitalism/) [x](https://www.reddit.com/r/wallstreetbets/comments/pp5ie2/blackstone_the_king_of_unfettered_capitalism/) [x](https://www.reddit.com/r/wallstreetbets/comments/p14xn5/why_mvst_has_the_poteintal_for_an_incredible/) \n**Account Age**|6 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Rumor is they have a lot of exposure to evergrand, I’d wait to see how that shakes out", "score": 12, "replies": [{"body": "Yea this is true they do have some real estate exposure in china (for example their HK SoHo building deal just fell through)  but I don't feel like that will have a tremedous effect on the stock because of a few reasons. First even though the real estate itself will be marked down in value, blackstone will have the resources to whether the storm. Second is Steve himself even though I used the words \"levered to the tits\" Steve is a noturiously risk averse guy that uses leverage but never too much that he'll be put against the wall. A lot of the reason I like this stock is because of Steve's investment style and prowess and I think that the set of circumstances for the rest of the year boud well for the assets maturing this year that were purchased way back when.", "score": 4, "replies": []}]}, {"body": "Well, never going to get that time back, am I?", "score": 6, "replies": []}, {"body": "Ok I'm gonna buy some $BX puts tomorrow", "score": 9, "replies": []}, {"body": "Tyson foods the King of Unfeathered Capitalism.", "score": 4, "replies": [{"body": "Lmao", "score": 1, "replies": []}]}, {"body": "I would be selling covered calls at spikes as well. Private equity has been real kind to us. Fortress-Carlyle-Apollo", "score": 2, "replies": [{"body": "def thought about doing something like that but I dont have enough money for a true covered call :/", "score": 2, "replies": [{"body": "Totally understandable. I just have enough for 1 of each. I sell single covered put as well on dips. Glad I see another investor on wsb into these operator/active investor firms instead of meme tickers all day long.", "score": 2, "replies": [{"body": "Yea I think there is a ton of value to be gained by looking into some these funds you mentioned $CG, and Apollo and I've been looking into those as well haven't had the same return on equity as $BX but its the same story that is really intriguing. tbh blackstone fell into my lap a bit because at the time I was really obbessed with billionaires and reserched them as a hobby suddenly I stumbled across some forbes article and next thing I know I'm buying bx  lol", "score": 2, "replies": []}]}]}]}, {"body": "Great so I’ll buy tommorow and the streak will end", "score": 2, "replies": [{"body": "It did go down almost immediately after this lol", "score": 1, "replies": []}]}, {"body": "Ruin the stock? It's BX. WSB won't move the stonk.", "score": 2, "replies": []}, {"body": "TY for this. Found BX and I’m a new retard at this but man it looks very for the hold and gains.", "score": 2, "replies": []}, {"body": "did they short GME in 2020? whys the earnings near 0  \n\n\nbet the next earnings report is a loss", "score": 0, "replies": [{"body": "You’re incorrect and I actually laughed out loud “bet the next earnings report is a loss” haha", "score": 2, "replies": []}, {"body": "smooth brain take right there", "score": 5, "replies": []}]}, {"body": "Nice. Steady. Gains. LEAPS are reliably increasing in value.", "score": 1, "replies": []}]}
{"title": "$INTC Intel CEO spoke of wanting to “be active in his leadership” when appointed this year. The first earnings report under his leadership is scheduled for October 21st. Here is some news for now", "selftext": "", "id": "pp5n2e", "created_utc": 1631763545.0, "score": 8, "upvote_ratio": 0.72, "num_comments": 23, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|6 days ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Love my $INTC 10/22 $65c's. Cheap last week and if earnings go right, this could boom.", "score": 4, "replies": [{"body": "this is a very stable stock, and always DROPS on earnings. get rid of those calls or you'll be a victim of IV crush", "score": 4, "replies": [{"body": "Yeah, I never hold \"through\" earnings. I hold for the hype.", "score": 2, "replies": []}]}, {"body": "Thats bold man. Good luck.\n\nI got shares so $65 would be sweeeeet.", "score": 1, "replies": []}]}, {"body": "AMD been stealing INTC market share for 16 years apparently.  \nbut it's still like 80% marketshare for intel....  \n\n\nNew ceo hasn't been there long enough to really make a difference, but the huge investment in fabs is nice", "score": 2, "replies": [{"body": "Not really.  Its really only been the last 4 years.\n\nFrom 2006 to 2017, INTC was increasing market share.\n\nhttps://images.app.goo.gl/jALuER55XeGGh2ew9", "score": 12, "replies": []}, {"body": "We are in the year 2021 and there is this thing called a google search", "score": 3, "replies": []}, {"body": "Whatch some video about rumored capabilities of new processors. \n\nIn short Intel's new CPUs will be around 10-11% faster than comparable AMD CPUs and cheaper. \n\nTop tier GPU will be comparable to 3070 and there will also be an entry level GPU comparable to 1650 (And it will sell like hot cookies because market is hungry for entry level GPUs).", "score": 2, "replies": []}, {"body": "Why is AMD revenue not catching up to the hype?", "score": 1, "replies": [{"body": "Because AMD is shit. Until they can properly compete with INTC and NVDA theyll always just be niche. Nobody wants AMD shit except a select group of fanboys.", "score": 0, "replies": [{"body": "I get the hype with NVDA and even Tesla revenue has been impressive. I’m not impressed with AMD’s revenue when compared with the hype stories about taking intel’s market. Intel is currently like Microsoft under balmer. Could the new ceo be our nadela?", "score": 1, "replies": [{"body": "From a consumer standpoint I just dont see any reason to ever buy AMD stuff. They have a long established record of being second rate. I dont know enough about their market on the corporate side, (chips for electronics, cars, phones, etc.) But they need to do more than produce a processor/gpu thats on par with the competition to break their reputation. They need to release a product that truly is best in class before theyre going to move hearts and minds. Otherwise people are always just going to buy the tried and true brands that have been the kings of innovation for decades.", "score": 1, "replies": [{"body": "that's not exactly true I've been a PC gamer since around 1998.\n\nin the home PC market AMD have been the bang for buck CPU on ocassion, sometimes had the performance crown.\n\nevery few generations it switches hands.\n\nintel has a better reputation overall, AMD were always known for their CPU's and GPUs running hotter than intel/nvidia and being the more budget option even if they were better.\n\namongst the new generations maybe they see AMD as better than and don't realise just how much bigger Intel really is.\n\nIntels yearly revenue is like 6-6.5years revenue for AMD, they absolutely dominate them.\n\nall the actual gamers I know will buy AMD or INTC it just depends who has the best price to performance ratio at the point when they need to build a PC.\n\nit's not like either are considered bad.\n\nAMD were close to bankruptcy atleast 2-3x in my life time, I think around 2004, 2008 and 2014.  \n\n\nIntel should have been the ones to buy ATI though, big mistake letting AMD buy them", "score": 2, "replies": [{"body": "AMD has been absolutely dominated ever since the core 2 came out in like 2005. The ryzen line is flashy and is the first time theyve even come close to being competetive in well over a decade, but all intel had to do is roll out shit theyve had sitting on the shelf for 5 years to beat them. Intel needs real competition. I want to see their best chips hit the market. Without any real competition all they do is respond to AMDs best by pulling a chip thats 5 years old out of the junk drawer clocking it 5% faster than AMD and calling it a day. \n\nBehind closed doors theyre probably just tweaking their 0.1nm milluple core cpu for the 20th time that they will never release until someone gives them a reason to. \n\nTheyve just been on autopliot for years playing the planned obsolescence game. They dont want to drop their real tech on the market because their chips are so fucking donkey tits fast no'one would need to replace them for ten years, and then they wouldnt be able to make all that money selling you a new one thats slightly faster every 8 months. It pisses me off every time I give them my money, but i keep doing it because they keep making the best shit. \n\nYou have a solid point about ATI. My dick gets hard just thinking about intel making GPUs.", "score": 2, "replies": []}]}, {"body": "Gotta blame intel for overlooking the competition when it comes to smartphone / low energy - high performance chip design. Why they never worked exclusively with ARM is beyond logic.\nAMD is not setting trend like apple / Tesla did …..just catching up but handicapped by reliance on TSMC.", "score": 1, "replies": [{"body": "They chose RISC-V over ARM... this was actually a good long road approach. RISC-V is opensource architecture, everything you try to build on ARM has to be paid to China (who was just in the news about stealing ARM IP: Google it) This set off huge flags with ARM manufacturers, and will likely push development of RISC-V code faster than ARM.  \nRISC-V is what everyone will likely start moving too, once chip manufacturers start building more and more chips of it. (it saves everyone money) the pandemic slowed this move down. ARM is great dont get me wrong, but RISC-V has a lot of the same benefits of the ARM architecture but costs a shitload less because its opensource.  \n\n\nAlso, Intel is kicking ass scaling up their Automotive chips and ASIC chips. They have invested a sizable chunk in both in the last 2 years. Expect intel to take over IoT devices globally and automotive chip production too. Less competition in both from other chip manufacturers. I'm happy they haven't really pushed in to the mobile device space, there is so much competition there and it would take a lot more investment to get less benefit.. the best approach for them is to push hard into the RISC-V, Automotive, and ASIC productions.", "score": 2, "replies": [{"body": "Great stuff just not seeing the performance. Apple just ran away from us intel. Come on, a chip maker must impress customers.\nMobile eye should be great if it works!", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Earnings aren't important. \n\nThe rumors about capabilities of new processors and GPUs are what's behind Intel's growth.", "score": 1, "replies": []}, {"body": "I guess you guys aren’t tech enthusiast, Intel will get out done in the long run even with that financial horsepower they won’t can’t catch up for years. Even if they create chips that are competitive they will be sucking tons of power from the wall.", "score": 1, "replies": []}]}
{"title": "Best way to bet against U.S money in China?", "selftext": "Anyone somehow not familiar with the Evergrande situation should google it, or this article breaks it down to its basics https://www.aljazeera.com/economy/2021/9/15/what-could-an-evergrande-debt-default-mean-for-china-and-beyond\n\nNow i've already got my own ideas how to take this one on. Spurred on Soros negative outlook on U.S money in China, we now get this clusterfuck, which, no question, will not just be limited to Evergrande. It's not pretty. The very best that can happen is to avoid implosion. Xi will absolutely not want to oversee a disaster, but how he handles it will dictate how much pain the likes of blackrock and vanguard feel.\n\nTo add fuel to the fire, this new western pact against China. Nice. So how will Xi react? Reveal how corrupt the entire chinese economy is, or, villify individualism, capitalism. And outsiders.\n\nSo, i'm shorting china. The whole fucking country of china.\n\nIdeas how to proceed?", "id": "ppb6b6", "created_utc": 1631790460.0, "score": 38, "upvote_ratio": 0.79, "num_comments": 23, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|8 months ago\n**Total Comments**|232|**Previous DD**|\n**Account Age**|6 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": [{"body": "How do u know the whole Chinese economy is corrupt?\n\nProbably good idea to hedge this bet cause you are probably wrong.", "score": 1, "replies": []}]}, {"body": "Calls on $YANG a 3x leveraged Chinese bear ETF", "score": 38, "replies": [{"body": "You mean a Winnie the Pooh ETF right?", "score": 11, "replies": [{"body": "Pooh is a bear, so yes...", "score": 1, "replies": []}]}, {"body": "I am surprised that China allows a bear ETF. A country so obsessed with the appearance of strength even allowing the thought of bearish sentiment.", "score": 6, "replies": [{"body": "China doesn’t have jurisdiction over the US exchanges", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Don’t worry, “The Big Guy” is paving that road for a mere 10%.", "score": 1, "replies": []}]}]}]}]}, {"body": "Evergrande is not even top 20 of EM / China ETFs. Xi is enjoying the show, he wants Chinese ownership and the sell offs are working perfectly.", "score": 11, "replies": [{"body": "He sold everything right before this nonsense. All of his BABA stocks too. Probably some salty CPC political heads, giving XI crusty looks becuase XI didnt’t tell em before hand. But you cant look too crusty, you know? XI will disappear you like Jack Ma", "score": 5, "replies": [{"body": "I think Chinese ownership is increasing…..ETF flows to EM has been up. Blackrock is raising billions from Chinese citizens to buy Chinese stocks.", "score": 5, "replies": []}]}]}, {"body": "[this] (https://old.reddit.com/r/wallstreetbets/comments/pp1obi/beke_yang_noah_big_profits_off_the_collapse_of/) is a much better post on the subject", "score": 7, "replies": []}, {"body": "FXI puts and YANG calls", "score": 3, "replies": []}, {"body": "Does this mean I can buy a house in my local city now?", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|4269)", "score": 2, "replies": []}, {"body": "I have some other perspectives. How about trying to long those who would profit from the decline and/or collapse of the Chinese economy? \n\n\r  \nThe country appeared to be actively limiting foreign investments and building this “internal cycle” thing that basically tries to keep production, consumption, and capital within a closed loop within China. Still, the West needs some places to build factories, produce cheap goods, and park the money for those projects. Vietnam has taken up quite some manufacturers and factories leaving China, and Singapore has been quietly absorbing money leaving Hong Kong after China screwed up what used to be the financial capital of Asia. Taiwan is another interesting choice; given the Sino-Taiwan rivalry, any Chinese loss could become Taiwan’s gain. \n\n\r  \nAlso, my take is that Wall Street fatheads won’t give up on China soon. They would be actively seeking channels to get their shares of China’s internal market, even if it means flirting with Xi the Big Brother. China knows it too. The government has been flashing financial operation and mutual funds permits to big Wall Street banks. In addition to BlackRock and Blackstone, Goldman, JP Morgan, Bridgewater, etc. have been granted entry. Chinese with some money to invest have also been looking forward to having access to foreign investment firms (whether they would actually benefit from it is another matter). I won’t recommend gaining direct exposure on Chinese equities, as BlackRock’s CEO advocated, but if these firms managed to take up wealthy clients in China and produce profits (even if it means those profits have to stay within China and cannot be easily remitted out, as China is also cracking down on foreign exchange flights), they could twist the rhetoric and boast about themselves being some alternative financial bridges between US and China, whatever. Doesn’t matter if it is true; it’s just a way of saying “we have rare access to Chinese money”. Personally, I’ve been taking up positions in Blackstone stocks gradually throughout the past few months.", "score": 2, "replies": [{"body": "And I have to say, the Chinese government is quite adept at handling/suppressing financial market implosion. Two years back the P2P (Peer-to-Peer) loan financing scheme imploded. The debt scale was at least as huge as the Evergrande crisis, and it affected way more population than Evergrande did. Still, after some initial fuss, the whole thing quieted down in a few months and most loans either got paid back only a small portion or cancelled entirely. Most investors got only bits and pieces back. This is not to underestimate the crisis, only trying to say that the government is willing to wield an iron fist to crash any social disturbance caused by financial turmoil.", "score": 1, "replies": []}]}, {"body": "Winnie the Pooh will just buy the dip for all the China stocks so the Chinese gov can keep control. But Winnie will also make it hard for these to get bigger so I would just stay away from China stocks", "score": 3, "replies": []}, {"body": "Nio puts. Still has a long way to fall.", "score": 1, "replies": []}, {"body": "Fuck Chyna", "score": -1, "replies": []}, {"body": "From what I understand, the problem is that Evergrande owes money and houses to a looooot of Chinese citizens.  And the due date on their bills is upon us.  But they can’t make good on their promises.  So now tons of Chinese citizens and other companies are left holding bags, which will send economic ripples throughout China.  But can’t President Xi just send all the bag-holders to forced-labor camps?  Isn’t this covered in chapter 2.3 of Communism for Dummies?", "score": 1, "replies": []}]}
