{"title": "NVDA🚀: Now that CPI is out of the way", "selftext": "[removed]", "id": "1bd089e", "created_utc": 1710257896.0, "score": 119, "upvote_ratio": 0.89, "num_comments": 165, "comments": [{"body": "Congrats brotha!!  I got 95% of my life savings in nvidia but I’m in it for the long run and although I was pissed Friday it’s looking great today", "score": 32, "replies": [{"body": "I have considered investing a greater portion of my assets into NVDA, should the opportunity arise. However, seeing as how the price can change dramatically in a few hours doing so concerns me, especially with after hours and pre-market trading. Would a stop-loss order be executed during these off hours trading periods? I assume it would.", "score": 4, "replies": [{"body": "Nope, they wouldn’t. That’s the problem with stop loss. With such a highly fluctuated stock, most of the action happens before the market opens - and by the time it does, the stock might be way below your stop loss trigger price and it will end up sold on open but for much less than you’d want it to.", "score": 2, "replies": [{"body": "That's some unfair bullshit then.", "score": 1, "replies": []}]}]}, {"body": "Likewise👍I’m long on NVDA shares but I also do 2-3 option trades in NVDA, SMCI and META depending on how market is going. So far so good 😊", "score": 7, "replies": []}, {"body": "Same man I put just about everything in. And shit myself on Friday. Learned a lot about nvidia and know that this will be the best decision I ever made. We’re going to the 🌙 on this stock!", "score": 4, "replies": []}, {"body": "I hope you are 22 with 10K…. Pls diversify.", "score": 1, "replies": []}]}, {"body": "I think we gonna see $1100 by Monday next week after GTC 😭 maybe I’m too optimistic aswell", "score": 25, "replies": [{"body": "I'd say 980 to 1000", "score": 8, "replies": []}, {"body": "Maybe like 930 950", "score": 4, "replies": [{"body": "We already hit 930 tonight.", "score": 5, "replies": [{"body": "Ayeee so perhaps a push to 1050 most likely most likely with gtc event and gpu their releasing on monday", "score": 2, "replies": []}]}]}, {"body": "Wayyy too optimistic", "score": 7, "replies": [{"body": "If you think so, you should be selling 11/22 1100 calls then.", "score": 3, "replies": []}]}, {"body": "Too optimistic", "score": 0, "replies": []}]}, {"body": "To anyone who doesnt know, AI is like inventing irrigation and tampons this will change the entire world. Our survivability will go up. Our efficiency will skyrocket. NVDA and other companies are going way way way up. Get the picture. Get the vision.", "score": 18, "replies": [{"body": "get rich before it decides to terminate us humans.", "score": 10, "replies": [{"body": "Lol that wont happen", "score": 1, "replies": []}]}, {"body": "True, but just because agriculture was invented doesn't mean being an ox dealer is is hyper lucrative.  Literally everybody wants in this game and the final solution might not be a GPU related technology.", "score": 1, "replies": [{"body": "Do you mind elaborating your thoughts?", "score": 1, "replies": [{"body": "Atari “invented” the videogame industry. It also destroyed it. Nvidia could well be just the first big AI player, but you can’t be sure if this is still the case in 5-10 years.", "score": 1, "replies": [{"body": "We definitely have to keep our eyes open for competition and changes! AI is not video games mind you. But yes, AMD, QCOM, INTC, ARM, IBM, even MSFT could challenge the chip makers! Companies want to make their own chips. TSM might get competition. So, for sure keep a look out!", "score": 1, "replies": []}, {"body": "I think what's different here is even if other big players come into the game, they (NVIDIA) has largely laid the groundwork and already have several large customers both within and outside of tech.   \n\n\nIn my field (Aerospace) in an attempt to keep up (we're notoriously slow) NVIDIA has already found some customers with DEEP POCKETS that are building their next gen devices around their technology.   \n\n\nThis kind of thing is something a late comer likely won't be able to turn around or change.", "score": 1, "replies": []}]}]}]}, {"body": "Everyone said the same thing about NFTs and Web 3 and that kinda fizzled out over time", "score": 1, "replies": [{"body": "Lol. This is not the same. Also Web3 does have potential. So does crypto.", "score": 1, "replies": []}]}]}, {"body": "Nvidia will be over 1k by Friday. And the following week over 1150", "score": 23, "replies": [{"body": "Will be 3,000 by summer. And that low balling it.", "score": 8, "replies": [{"body": "Is this the AMC subreddit?", "score": 5, "replies": [{"body": "Honestly this is what it’s become. I wonder what this sub will become if nvidia does come back to earth", "score": 1, "replies": [{"body": "Its gonna land on the moon and restart from there.  I sip the kool-aid but not gonna chug it 🤭", "score": 1, "replies": []}]}]}, {"body": "If we're just making up numbers now, why not go with 10,000 by fall?  And that's after a 4-1 split.", "score": 9, "replies": [{"body": "Very well possible.", "score": 1, "replies": []}]}, {"body": "Idk maybe 1.5-1.8k depending on earnings", "score": 1, "replies": []}]}, {"body": "If that happen you are the MAN for that call but I got a penny that says it will be slightly under but long term heck yes", "score": 4, "replies": []}, {"body": "No it won't", "score": 1, "replies": [{"body": "You’re a 🏳️‍🌈🐻 you don’t understand todays market", "score": 1, "replies": [{"body": "Don't get me wrong, it will go to 1k. But there's no way it will go smoothly and that fast.", "score": 3, "replies": []}]}]}]}, {"body": "I have 0.04118437 shares. I’m set !", "score": 10, "replies": [{"body": "Go get em tiger 🐅", "score": 4, "replies": []}]}, {"body": "I think during the GTC the price is likely to be in the range of $950-$1000. After the GTC it is hard to judge where the price will be. Long term of course the only way is up.", "score": 21, "replies": [{"body": "What is the GTC?", "score": 9, "replies": [{"body": "It's a [conference ](https://www.nvidia.com/gtc/)held by nVidia this month on the 18th to 21st.", "score": 5, "replies": []}, {"body": "GPU technology conference. It's 17-21 march", "score": 2, "replies": []}, {"body": "GPU Technology Conference, name is self explanatory.", "score": 2, "replies": []}]}, {"body": "I think there will be a dip after GTC after hitting a new all time high, then a run up into TSM earnings and another pop", "score": 8, "replies": []}, {"body": "19-20 march FOMC meeting…", "score": 1, "replies": []}]}, {"body": "Oracle announced  a multi year partnership with NVDA in 2022, interesting to  see what these new developments are. HPE is also making some sort of announcement with NVDA. \nWe also have the Fed meeting during GTC and PCE on the 29th. Rate cuts will cause a rotation out of tech into some of the beaten down parts of the market so that is something to keep in mind. In general if the Fed is dovish and GTC is positive this could be an excellent catalyst. At this point NVDA needs to break through 1000 to keep a rally going, otherwise we will be in a trading range until we get closer to earnings.", "score": 14, "replies": [{"body": "Very short term sight in your comment.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "So I mean its going way past 1K", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It is tho. You said needs to break 1000 to keep rally going. I disagree. Gotta think bigger longer. AI is changing the world.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "You keep saying ur not discussinh xyz then proceed to discuss xyz. Lol. Whatever dude. You should realize you can discuss both short and longer term.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This a low effort comment that adds nothing to the discussion. At least offer your views on what would increase the forward multiple to obtain this, and stay on topic.", "score": 0, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "You could stop commenting at anytime instead of going on about your personal feelings. Your reason for NVDA going up is rambling and incoherent, and also Low Effort.", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "appeal to emotion\n\nget on the train AI is changing everything", "score": 0, "replies": [{"body": "Low effort", "score": 0, "replies": [{"body": "arbitrary.", "score": 0, "replies": [{"body": "Stay on topic", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Someone is triggered", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "This is a sub about NVDA not about your emotions.", "score": 1, "replies": [{"body": "Again. This is the direction of the world. No emotions in that. Dont know what you arent understanding.", "score": 1, "replies": [{"body": "Low effort", "score": 1, "replies": [{"body": "Arbitrary", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Did some selling and then buying on the big dip the other day and ended up with 50 more shares than the day before. That's cool. Who needs cash these days.", "score": 6, "replies": [{"body": "Congrats, mate!! 50 NVDA is good profit!", "score": 3, "replies": [{"body": "Have 2200 shares now. It's a good day. It's a good 2023 and 2024. Thanks.", "score": 5, "replies": [{"body": "holy fuck bro fuck you", "score": 3, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}, {"body": "Congratulations!!!", "score": 3, "replies": [{"body": "Thanks my friend. Been in NVDA for years.", "score": 1, "replies": []}]}]}]}]}, {"body": "Wow, this pup is still going strong in after hours!  $70 up today! At this rate, folks we can see $1,000 this week or next week 🤪and, while we bulls make money, enjoy laughing at these so called CNBC experts like Adami whining about “ Oh NVDA is too high”, “wait for pullback”, “can’t justify valuation”, “bubble”.. blah blah blah🤣🤣🤣", "score": 7, "replies": [{"body": "Well the pullback did happen", "score": 3, "replies": [{"body": "IMO, 1-2 days drop is profit taking, pullback is sustained drop in value.", "score": 4, "replies": [{"body": "A pullback can be the result of profit taking but sure whatever definition you want to use\n\nAnd by their very nature, pullbacks are temporary, not sustained. What you're thinking of is a reversal.", "score": 4, "replies": []}]}, {"body": "And lasted all of two days.", "score": 1, "replies": [{"body": "And they still didn’t buy the dip 😂", "score": 1, "replies": []}, {"body": "Yes, it was temporary. That is exactly what pullbacks are.", "score": 1, "replies": []}]}]}]}, {"body": "If berkshire A is trading for 600K, there's no reason we can't hit that too. AI is the future.", "score": 3, "replies": [{"body": "Like it or not, AI is already current and future🤣", "score": 1, "replies": []}, {"body": "Warren Buffet doesnt believe in splitting shares but we get your point.  \nNvidia could be at $7k a share in 5 years", "score": 1, "replies": [{"body": "No man. 600K. Think BIG :)", "score": 2, "replies": [{"body": "Im with you on that...", "score": 1, "replies": []}]}]}]}, {"body": "can i get a dolla", "score": 3, "replies": []}, {"body": "I picked up some june 900 dollar calls while the stock was getting kicked in the teeth yesterday.  I feel like it was a good decision lol", "score": 3, "replies": [{"body": "Happy for you! I guess, this and next week will be great for NVDA bulls!!! \n\nI just feel sorry those value conscious folks on NVDA forums who keeps waiting and wishing for NVDA to pull back, especially now after CPI is gone and Nvidia’s GPU Tech conference is about to start😝", "score": 2, "replies": [{"body": "if 860 was too high to buy in at this point, they are never buying in.", "score": 3, "replies": [{"body": "Very true.. poor valuation guys😂", "score": 2, "replies": []}, {"body": "Until the stock splits 😉", "score": 2, "replies": []}]}]}]}, {"body": "Woohoo!!!! What a day for us NVDA bulls! \n\nReminds me of last minute dashes at F1 races!", "score": 3, "replies": []}, {"body": "Wow congrats!", "score": 2, "replies": []}, {"body": "Isn’t the deal with Oracle already priced in?", "score": 2, "replies": [{"body": "Nome of these are priced in. AI will be big. (Longer term I mean)", "score": 2, "replies": []}, {"body": ">Isn’t the deal with Oracle already priced in?\n\nOracle doing well hasn't been totally priced in", "score": 1, "replies": []}]}, {"body": "Post your positions", "score": 2, "replies": [{"body": "☝️", "score": 1, "replies": []}]}, {"body": "Congress is almost certain to vote a ban on TikTok tomorrow, that should benefit META and NVDA.", "score": 4, "replies": [{"body": "Why?", "score": 7, "replies": [{"body": "China vs US i would imagine", "score": 4, "replies": []}]}, {"body": "I for one will be absolutely gobsmacked if Congress does anything. At this point they couldn't agree on an official national cookie.", "score": 5, "replies": [{"body": "Congress is the worst office!", "score": 1, "replies": []}]}, {"body": "I highly doubt TikTok will be banned, they can try but it won't happen.", "score": 5, "replies": []}]}, {"body": "Nobody who uses the word “coz” owns $3.6M of stock in anything, plus more in options. Similarly, nobody with several millions of dollars in stock is sweating what is or is not going to happen to a share price in the next 4-6 weeks because of a CPI report. Those short term moves don’t matter to them. Let’s take this type of post over to WSB, shall we?", "score": 4, "replies": [{"body": "What can I say 😂🤣😂 Laughter is good for health😛\n\nIf you’re a day-trader like me, every single news matters.. and if you don’t know impact of CPI, you shouldn’t be in the stock market.. just an honest advice.", "score": 4, "replies": [{"body": "Does PPI affect the market as much as the CPI?", "score": 1, "replies": []}]}, {"body": "Was part of that group and any good news we want and losing money 💰 no matter how much sucks and is nerve wrecking especially when you have Millions and especially if it is your life savings… PS when you have millions you can do and say what you want ask the ultra rich \nSemper Fi \nRemembering Pohang 89", "score": 0, "replies": []}]}, {"body": "NVDA $6K is my prediction from here. We are seeing major pushback and resistance to NVDA overtaking AAPL. Pretty sure it's a culture thing but rest assured there is a major financial implication to Apple going from #2 to #3. Can't wait.", "score": 4, "replies": [{"body": "😎", "score": 0, "replies": []}, {"body": "No $6000 LEAPS available yet. 🙂 But soon.", "score": 0, "replies": []}]}, {"body": "$975 - $990 during GTC", "score": 2, "replies": [{"body": "I think more.", "score": 7, "replies": []}, {"body": "Think higher…4 digit number.", "score": 1, "replies": []}]}, {"body": "Wish I could have traded today I knew this was coming, but some error with my brokerage had me settling margin tmw on the 13th", "score": 1, "replies": [{"body": "Take the L and hop back on.", "score": 5, "replies": []}]}, {"body": "I wish I could think this aggressive, I was pessimistic about today’s data that I didn’t get in on any action. But good for you!", "score": 1, "replies": []}, {"body": "Wow some serious positions! At what point do you scale back?", "score": 1, "replies": [{"body": "Well, no specific timetable or plan.. probably take some profits & put it in the bank 🏦 between tomorrow morning and by end of Nvidia’s GTC around 3/22… and rebalance my portfolio before going to vacation for Spring break!", "score": 2, "replies": [{"body": "You guys are awesome the way you buy huge lots. I gotta get involved more.", "score": 1, "replies": []}, {"body": "After your run EAC, bank some. Go on vacation and recalibrate. 5% interest on 3 mil is $150k.", "score": 1, "replies": []}]}]}, {"body": "975 by 3/22 is realistic", "score": 1, "replies": []}, {"body": "Nvidia? \n\nyou better go all in because you will either be RICH by investing in NVIDIA or you will be getting a universal basic income check because most jobs will be obselete.  \nITs coming and there isnt anything we can do about it.  \nI got 95% of my retirement on NVIDIA and I sleep good at night.", "score": 1, "replies": [{"body": "Wow, folks, who do we have here🤪 This is hilarious!\n\nIf you don’t even know that NVDA is the stock ticker of NVIDIA Corporation, you really don’t belong to this post 🤣 it’s like AAPL to Apple or INTC to Intel..  Enjoy🍺", "score": -2, "replies": [{"body": "um ...\n\nOKAY!! smh", "score": 1, "replies": []}, {"body": "He wasn’t correcting you.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I don’t think you or I have any obligation to show our portfolios. If you don’t believe, I’ve no problem with that😎. I usually trust folks here because I don’t see any reason why someone would lie.", "score": 1, "replies": []}]}, {"body": "Well congrats the the new change of generational wealth. You have saved the economy for the long run! Hope your lambos and nice lives don't make you look down on people and mess up the world again.", "score": 1, "replies": []}, {"body": "Tomorrow could easily pullback markets with jobless claims and PPI. Good luck sir this is a casino and no one knows what will happen. Asking if others think it will go up or down is trying to confirm your own bias and make yourself feel better. Best thing to do is not trade such high volume obviously on a guess", "score": 1, "replies": []}, {"body": "Omg post your portfolio you have over 5 million and post here?  No. People have financial advisors at that level. I don’t believe you at all. If you have that much and no management you deserve to lose it.", "score": 1, "replies": [{"body": "🤣🤣🤣 you always make me  smile😊\nIf you hate my posts so much, just don’t read my posts and get some life man😀", "score": 1, "replies": []}]}, {"body": "Post real pics not paper trades.", "score": 1, "replies": []}, {"body": "When your young, risk tolerance can be high but as you get older like me, I can’t see putting more than 5% net worth into any one stock even nvda. Anything can happen. It can drop 50% from here quite easily if government poses new sales restrictions. You just never know", "score": 1, "replies": [{"body": "I agree, risk tolerance depends on age, job, kids, finances etc etc.. having said that, I don’t think govt would put any draconian policies to kill semiconductor industry at risk when so much competition is coming from China. They’ve already restricted NVDA sales to China and that is already built into the stock.\n\nI got out of NVDA options yesterday & mostly went into AAPL and META. But since today NVDA went down -$30 and I’ve some cash to play, so I bought back 3/15 and 3/22 options again! Let’s see how it goes today.😃\n\nI may be wrong, but with WTC next week, I don’t see much risk in getting back into NVDA down -$30 at $878.. let’s see🤞", "score": 2, "replies": []}]}, {"body": "oof", "score": 1, "replies": []}, {"body": "I traded on dips with technicals on NVDU not a long-term by and hold that's for sure but great opportunity to take it vantage of the volatility and if you get on the right side of it watch out", "score": 1, "replies": [{"body": "Very true.. I usually buy if NVDA drops more than $25-$30 and sell if it goes up by same margin..  most of the times I make money but not always🤣.  Like you said if you get on the right side!", "score": 1, "replies": [{"body": "Start learning the patterns on in NVDU bigger risk leverage 1.5 times against Nvidia but the same patterns you just gotta watch it more carefully I typically nibble in three different times if I miss the first bottom and with the momentum play of Nvidia, I haven't been on the wrong side of things much. I'm a good risk manager where most people when they trade are  not so I got in Nvidia in the 300 and 400 range so I'm short term trading with house money but still hold the paper gains", "score": 2, "replies": []}]}]}, {"body": "\"I’m excited to see what APPL does with AI after ditching the car project!\"\n\nWhat if it's to design their own AI chips so they aren't dependent on NVDA, like they designed their own Mac chips to eliminate their dependence on Intel?  What would that do to NVDA share price?", "score": 1, "replies": [{"body": "I'm more curious about how many thousands of H100s they have on order from nVidia.  Large-scale AI isn't going to be done on any devices that Apple makes.  They don't even sell proper data center servers.", "score": 3, "replies": [{"body": "True, they don't sell data center servers today but they're one of the few companies with the cash to become a serious threat if they choose to go that route.  Not saying they will, not saying they won't, and even if they do they have a LOT of catching up to do.  But following Microsoft's playbook from back in the day, merely announcing that they're working on something could freeze the market (Microsoft's famous vaporware strategy) and give them time to bring something to market.  Maybe they hire away some Nvidia talent, who knows.  I honestly don't think Apple will go that route but who knows, they have to do something to stay relevant.", "score": 1, "replies": [{"body": "That won't happen and if they tried, even with all the serious cash, they'd likely fail.  Let me give you a few examples.\n\n* The x86\\_64 server market is entirely dominated by Intel/AMD and Apple tried it's best to play in that space.  They released [Mac Pros](https://www.apple.com/mac-pro/) that were overpriced desktops and[ cylinder-like garbage](http://www.applenewsnet.com/blog/2013/12/24/the-new-mac-pro-why-i-just-cant-make-myself-care) that you can't rack-mount in a data center.  They also tried with their rack-mountable XServes but they discontinued that over a decade ago.  Data center owners and devops hate having to deal with Apple hardware.  This is where nVidia has a chance to put its foot in the door with Grace Hopper and disrupt x86\\_64 data centers.  Not just for AI, but CPU-based processing as well.  Apple FAIL\n* Apple gave up their [server OS](https://support.apple.com/en-us/101601) two years ago.  That means they want out and likely won't come back.  They're going to stay focused on consumer-electronics.  Apple FAIL\n* Apple had billions of cash and yet they still [failed to get into the car market even after deploying \\~$10 billion on it](https://arstechnica.com/cars/2024/03/apple-blew-10-billion-on-failed-car-project-considered-buying-tesla/).  They totally under-estimated the capital requirements to get there, the tight margins, as well as the difficulty in making an autonomous vehicle.  They're no longer a \"serious threat\" to automotive companies that they hoped to be.  Apple FAIL\n\nHaving tons of cash doesn't necessarily make you successful in markets you want to invest in and try to penetrate.", "score": 5, "replies": []}]}]}, {"body": "Apple typically pilot on other architectures and then implement own, so they not part of the game yet", "score": 1, "replies": []}]}, {"body": "Are you our Roaring Kitty aka Deep Fucking Value?", "score": 1, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "lol", "score": 1, "replies": []}]}, {"body": "Wait for the hype to fizzle, that's coming soon.  The whole market is inflated.  Take profits now.  Buy back in later.", "score": -6, "replies": []}]}
{"title": "Short Sell Boeing", "selftext": "Everyone needs to start shorting and selling boeing stock to drive their price down. They compromise their passengers for the benefit of their stock holders. Enough is enough this company is crooked af and nearly has a monopoly on their industry. \n\nhttps://www.fox2detroit.com/news/boeing-whistleblower-john-barnett-found-dead-days-after-testifying-against-company-report?utm_campaign=trueanthem&utm_medium=trueanthem&utm_source=facebook&fbclid=IwAR2CjkNCZB8YP8ztflBbXowogQ2_hAjKOUAwwnaM8aDVxYbj_kMSzNKNUa4\n", "id": "1bd7qqc", "created_utc": 1710275576.0, "score": 1122, "upvote_ratio": 0.82, "num_comments": 319, "comments": [{"body": "Don’t forget they also suicide their whistleblowers", "score": 1462, "replies": [{"body": "Or as the new generation calls it. Epsteined their whistleblowers", "score": 358, "replies": [{"body": "Let’s not violate John Barnett’s name by linking him to Epstein, because he wasn’t a “whistleblower”.", "score": 177, "replies": []}, {"body": "Used to be Vince Foster’d their whistleblowers. Kids these days", "score": 24, "replies": [{"body": "Foster was Killary'd, aka Clintoncided.", "score": 18, "replies": []}]}, {"body": "I thought it was the Putin window drop", "score": 14, "replies": []}, {"body": "Epstein their childblowers", "score": 2, "replies": []}, {"body": "The new generation knows about Epstein?", "score": 5, "replies": []}, {"body": "Nobody calls it that", "score": 6, "replies": []}, {"body": "I thought it was clintoned", "score": -2, "replies": [{"body": "You're right", "score": 0, "replies": []}, {"body": "Me too", "score": -1, "replies": []}]}]}, {"body": "Didn’t he whistle blow like 7 years ago?", "score": 18, "replies": [{"body": "He was currently suing Boeing, they realised something was wrong when he didn't show up for the court", "score": 56, "replies": []}, {"body": "Yeah. He was being deposed in an ongoing civil case and was found dead after not showing up to court one day. Despite the conspiracy theories about Boeing putting a hit out on him, there’s no evidence that they did so.\n\nThe execs of Boeing, which makes up one half of a massive duopoly, aren’t risking prison or the extinction of the company to put out a hit on a man that has been on the record about their issues for seven years. Something this absurd is essentially the only risk to the company’s existence and it’s ridiculous that people are so quickly assuming they had him killed, but that’s Reddit for you.\n\nNeither the risk or the reward are even remotely worth it. Their reputation is already awful and they’re not going to have someone killed for reinforcing it with info from nearly ten years ago. Whatever the result of the civil case ends up being, Boeing will have no issues financially covering it either.\n\nBoeing is responsible for what happened to him, as his career and life were essentially ruined because he told the truth about them, but there’s virtually no shot they had him killed. I get that the timing appears/may be convenient for them, but this was a man that has likely been under intense pressure for years now. It’s not inconceivable that he hit his breaking point.", "score": 24, "replies": [{"body": "Depos can be super stressful and get really nasty because attorneys get more leeway, in the questions that they’re allowed to ask. I’m sure it was draining for him. To say the least. Poor guy.", "score": 20, "replies": [{"body": "Yeah I’m sure it was brutal. Unsurprisingly, [his niece also said](https://www.seattletimes.com/business/boeing-787-whistleblower-found-dead-in-apparent-suicide/) he was depressed and very stressed because of the case and the door plug incident", "score": 13, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "If the company is willing to murder people, they're definitely willing to just hide damning evidence in discovery.\n\nMy point being, they aren't doing either.", "score": 6, "replies": []}]}, {"body": "Perhaps Boeing didn’t outright killed him. But even you seem to agreed that the death was attributed to (at least partially) constant mental stress over the last several years dealing with Boeing after the whistleblow.", "score": 21, "replies": [{"body": "That’s a long ways from “they put a hit out on him”", "score": 20, "replies": [{"body": "> That’s a long ways from “they put a hit out on him”\n\nNo, it's right next door. There's more than one way to eliminate someone. End result is the same.", "score": -5, "replies": [{"body": "Well you not wrong about that…", "score": 11, "replies": []}, {"body": "Right next Boeing door maybe, in other words, the plane is 30k feet in the sky and the door is on the ground.", "score": 5, "replies": [{"body": ":D", "score": 1, "replies": []}]}]}]}, {"body": "I feel like this is a scenario no one on the board “directly” killed them, but I could also see them being around the right people and saying something like, “What I wouldn’t give to get rid of this guy. I mean I’d pay out enough for someone to retire no matter the age for them to get rid of him. Won’t even ask questions on how.”", "score": -1, "replies": [{"body": "Who will rid me of this meddlesome priest?", "score": 8, "replies": []}, {"body": "Yeah, because the board of Boeing hangs out around pipe hitting criminals. \n\nThese guys don't hang out in dimly lit rooms tenting their fingers and twirling their mustaches while stroking white Persian cats and discussing evil plots. They're old crusty men in suits who waste their time at endless meetings and cocktail parties. They're the robber baron type of fucked up, not Tony Soprano.", "score": 10, "replies": [{"body": "What a weird comment and take. It doesn't have to be just that one way to put out a hit on someone. And what are you basing this on, anyway?\n\nNot implicating him in this or anything else, but Trump himself claims to be the rich and polished, but that doesn't stop him from using his lawyers as henchmen and stooping low enough to mock the disabled very publicly. That's just a random example of pettiness. \n\nMy larger point is that I wouldn't put *anyone* past being capable of murder in order to get rich or preserve themselves. If you defend someone on the basis \"they are not the type...\" ... You're just being incredibly naive.", "score": -1, "replies": [{"body": ">What a weird comment and take. It doesn't have to be just that one way to put out a hit on someone. And what are you basing this on, anyway?\n\nClearly, that was a hyperbolic description of the notion board room types are actually out there putting hits on people. They can be all sorts of things, but they're not putting hits on witnesses in *civil* cases who have already been testifying for years. That's fucking dumb.\n\n>Not implicating him in this or anything else, but Trump himself claims to be the rich and polished, but that doesn't stop him from using his lawyers as henchmen and stooping low enough to mock the disabled very publicly. That's just a random example of pettiness.\n\nWhich has what to do with wackjob conspiracy theories of murdering witnesses?\n\n>My larger point is that I wouldn't put anyone past being capable of murder in order to get rich or preserve themselves. If you defend someone on the basis \"they are not the type...\" ... You're just being incredibly naive.\n\nIf you don't understand that sort of shit is a bad b-movie plot...you're just being dense.", "score": 1, "replies": [{"body": "Again using false equivalence. Just because \"this sort of shit is a bad b-movie plot\" isn't the reason it's not true. This is the most ludicrous argument.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Fuckoff Boeing shill. Anyone with half a brain knows that you don't shoot yourself in the head a day before you get to testify against the company that put people life in danger which you sacrificed your livelihood to whistleblow.\n\nIf you think murder and cover up is beyond Boeing exec then I think you probably forgot that getting people killed and endangering people lives in the name of profit is literally what get them here in the first place.", "score": 5, "replies": [{"body": ">Fuckoff Boeing shill. \n\nYou don't have  to be a Boeing shill to understand (unlike some people) that we don't live in a tv show.\n\n>Anyone with half a brain\n\nI guess you shouldn't listen to people who only have \"half a brain\" as much then?", "score": 0, "replies": [{"body": "Either Boeing shill or idiot then.\n\nRealize that dumbass like you is what enabled powerful bastards like this to do what they do.", "score": 0, "replies": [{"body": "Can't be fun being this paranoid.. Not everything is a conspiracy.\n\n>dumbass like you\n\n>idiot \n\nAstounding self-awareness..", "score": 2, "replies": [{"body": "Not everything unconfirmed is a conspiracy.\n\nDo you always need authority to confirm everything first before you believe it like a student in a school?\n\nHow about using common sense to think of what's the most likely possibilities?\n\nThe mind of some people...", "score": -1, "replies": [{"body": ">How about using common sense to think of what's the most likely possibilities?\n\nLmao. Look in the mirror, bud.", "score": 1, "replies": []}]}]}]}]}, {"body": "You’re entirely detached from reality. It’s incredible that your standard for “Boeing shill” is pointing out the low probability of company leadership paying to have a man executed.\n\nEdit: also, it wasn’t the day before starting his deposition… The deposition started in the [week ahead](https://www.bbc.com/news/business-68534703.amp) and he was simply asked to show up for additional questioning on Saturday. Pretty clear that he was almost done with the process. Get your facts straight.", "score": -1, "replies": []}]}, {"body": "Found the Boeing hitman hiding in plain sight. Right here officer.", "score": 5, "replies": []}, {"body": "Same explanation for Epstein’s “suicide” too, right?", "score": 1, "replies": [{"body": "Get a grip. The two situations aren’t comparable beyond the fact that both were reported as suicides.\n\nYou’re straight up out of your mind if you think they’re sitting in a board room planning assassination type shit. They would gain essentially nothing and risk everything. I’ve yet to see any rationale for a hit on this man other than the fact that the timing looks convenient. If convenience is your threshold for buying into a huge conspiracy, you need to take a good, long look in the mirror.\n\nNobody wants to consider even for a moment the plausibility of the idea. I’ll gladly take the downvotes on this one… Anyone that leaps to this conclusion is completely out of touch with reality.", "score": -5, "replies": [{"body": "All it needs is one guy that was in the chain of custody at the time to pay someone 50k to fix the problem.\n\nCorporate manslaughter / gross negligence and directors personal liability are very real.\n\nSure the company won't die from whatever the guy had to say but it's certainly enough for someone to go to prison or at the very least ruin their career for good. \n\nNo conspiracy needed, just one guy with a bit of cash.", "score": 3, "replies": [{"body": "> No conspiracy needed, just one guy with a bit of cash.\n\nActually, it does need a conspiracy because what you just described involves at least *two* people, which is also true of a conspiracy. \n\nWhen you don't even understand the crime you're purporting is so fathomable or even likely, you probably shouldn't be saying it is either of those things.", "score": 3, "replies": []}, {"body": "Ignoring the fact that you’re moving the goal posts by shifting the culprit from Boeing to a single rogue actor, this is a civil case. It’s not a criminal inquiry... So nobody is getting charged with manslaughter as a result of his testimony. \n\nEven if you’re convinced that this 7+ year old info from the civil case leads to serious implications, why did they wait all these years since he started talking? Why did they wait until his deposition was already ongoing for at least a couple of days? It’s not like Boeing was unaware that this case was going on.\n\nJust because it’s technically possible, doesn’t mean it’s a reasonable assumption. People are fixated on the convenience of the timing, but fail to scrutinize their own theories even though they all include a boatload of assumptions tied together with conveniently clean execution. \n\n>No conspiracy needed\n\nYou just outlined a conspiracy. Not because it isn’t possible, but because it’s a ridiculous baseline assumption when there’s no actual evidence.", "score": -1, "replies": []}]}, {"body": "Never said anything about a discussion or plan being developed in a boardroom. That’s your imagination talking. To your other comment, the two situations are actually very comparable. In both situations a key witness who had the potential to provide testimony against executives/elites in business/government, who have been grossly unethical and harming civilians, mysteriously “commit suicides”.", "score": 1, "replies": [{"body": "Gangsters backing unions killed people all the time in the golden era.\n\nWho knows, this could be a little favor to speed up currently stalled negotiations.\n\nAt the end of the day, there's no proof so I'm not going to assume anything.  \n\nThat said, also equally silly to brush this off as \"oops guy suicides himself right before potentially critical testimony when all lights are shining bright on BA about their clusterfuck of an organization\" or \"no chance of foul play whatsoever!\"", "score": 1, "replies": []}, {"body": "No, one provided information about about a civil case for the past 5 years over multiple testimonies and interviews and the other was already convicted and knew who knows what. And neither suicide was mysterious, that's *your* imagination. Nothing mysterious about one of the most hated people in the world not wanting to spend the rest of his life in prison for fucking children.", "score": 0, "replies": []}]}, {"body": "You are correct - a board wouldn't discuss it.\n\nYou are incorrect in assuming a small group, perhaps even a person or group not directly working for Boeing, would not plan and pay for a convenient suicide.  Merely looking at the Boeing board of directors is pretty small-brained, but the murkiness of money or politics - whichever it may be - hurts the brain to contemplate since we almost never get answers.", "score": 1, "replies": [{"body": "The nerve to call me small brained here is fucking hilarious. When people talk about Boeing putting out a hit, they don’t mean a rogue actor in middle management.\n\nFrankly, you are way out of your depth. I really hope that username of yours is an attempt at trolling.", "score": 1, "replies": [{"body": "It was given to me when I signed up for Reddit, but thank you.", "score": 0, "replies": []}]}]}]}]}, {"body": "Add to that the Charleston County coroner's office said it was a self-inflicted wound. Add to this moronic conspiracy theory that Boeing has its hooks in some local county coroner's office and you've got yourself a straight to streaming Netflix political action thriller with a 0% on Rotten Tomatoes.", "score": 0, "replies": [{"body": "Not saying the conspiracy is true, or not true, but people have been murdered and the murderer covered up, or attempted to cover up the murder by making it look like a suicide or an accident. If they, the murderer, did a good enough job they wouldn't have to have the coroner or the police on their side because, again it would appear to be a suicide or accident. ", "score": 1, "replies": [{"body": "There's a problem, you only know a coverup exists because someone got caught, i.e. the coverup failed. \n\nWhere are all of these C-Suite execs and board directors killing people? In the real world that is? Anything can happen if you have the imagination to believe it, hence why we have these movies.", "score": -1, "replies": []}]}]}, {"body": "seriously? there's no shot they had him killed? you realize that the average hit costs anywhere from 300k to 10 million, this is chump change to boeing.", "score": 0, "replies": [{"body": "Not even remotely worth the risk. Sure, it’s technically possible, but there’s presently no evidence indicating they did. Use your brain.", "score": 0, "replies": [{"body": "i am using my brain. what if there are 10 more whistleblowers waiting in the wings to come out, and boeing knows this? spending 10m on a cleanly executed hit could go a long way towards dissuading further whistleblowers and save the company billions in legal fees and lost business.", "score": 0, "replies": [{"body": "Boeing already destroyed that man’s career and life before he was found dead. Is that not enough to dissuade people?\n\n>i am using my brain.\n\nNo… you really aren’t.", "score": 1, "replies": []}]}]}]}, {"body": "Shill", "score": 0, "replies": [{"body": "Buddy, you’re straight up brain dead if you think anything I said makes me a shill. You won’t catch me standing up for Boeing’s disregard for safety. I’m just not stupid enough to believe they’re assassinating people.", "score": 1, "replies": []}]}]}, {"body": "He was suing for back pay,  as I understand it", "score": 1, "replies": []}]}, {"body": "They 100% whacked him", "score": 3, "replies": []}, {"body": "OP was never seen again.", "score": 1, "replies": []}, {"body": "Unalive them", "score": 1, "replies": []}, {"body": "this is all just conspiracy theory things like that don't happend obviously.", "score": 1, "replies": []}, {"body": "The kids call it being “unalived”", "score": 1, "replies": []}, {"body": "Well this aged expectedly", "score": 1, "replies": []}, {"body": "Bullish!", "score": 1, "replies": []}, {"body": "bullish", "score": 0, "replies": []}, {"body": "Came here to say that, that was suss", "score": 0, "replies": []}, {"body": "It's absolutely insane they'll literally get away with murdering him", "score": -1, "replies": []}]}, {"body": "It's not benefiting their shareholders much at the moment.", "score": 262, "replies": [{"body": "It doesn’t have to, it benefitted the executive.\n\nBoards have 1 fucking job. Craft an executive compensation package that limits his return on value destroying activity as they grow their returns.\n\nThe board needs to be fired because they allowed the executive to destroy value (gutting quality) to meet his incentive. They could have put hundreds of stipulations and protections in the package to protect against this. \n\nManagers do what they’re incentivized to do.", "score": 4, "replies": []}, {"body": "Maybe shareholders should take their gains/losses now?", "score": 14, "replies": []}]}, {"body": "Alright boss getting right on it.", "score": 293, "replies": [{"body": "\"They're one half of a global duopoly on commercial flight manufacturing, so surely we'll be successful in shorting their stock into bankruptcy (which is possible, btw, I think...)\"", "score": 14, "replies": [{"body": "Yes, lets all short a company that the US government deems too critical too fail and the US Defense Department is dependent on.", "score": 17, "replies": []}]}, {"body": "🤣", "score": 5, "replies": []}]}, {"body": "You first. Post a position or fuck right off.", "score": 311, "replies": [{"body": "Op is cute for trying to manufacture hate and get people to short the stock because he wrote a paragraph about it.\n\nA plane fucking crashed years ago and KILLED HUNDREDS. the stock recovered since that low.\n\nThis is a lot less severe and people will simply forget and move on once time passes. As does all stocks when they're under fire in the media.\n\nRemember wells Fargo when they tried signing people up unwillingly? Yeah they're near all time highs.\n\nBA is a fucked up company but don't lose other people's money with your fake virtue signaling.", "score": 78, "replies": [{"body": "Wells Fargo “tried” to sign people up unwillingly?! They created 3 million fake accounts, they did sign people up. Crooked bastards.", "score": 24, "replies": [{"body": "I had a WF checking account only. Then suddenly I saw a savings account appear. It’s what I needed anyway so I kept it all these years.\n\nI guess they did me a favor by saving me the hassle of opening one myself.", "score": 4, "replies": [{"body": "LOL for real? what the hell was that.... weren't you concerned depositing any money into that auto-created savings account? I would go full panic wondering if this account actually belongs to someone else but WF's IT team fucked up so much that it appears on my online banking. You've got balls to keep that savings account for years without no issue. haha", "score": 1, "replies": [{"body": "It showed up right under my checking account inside the Wells Fargo app, so I figured it was legit.\n\nAt that time, I thought I might’ve somehow authorized the opening of the account by signing somewhere when I still did in-person banking.", "score": 1, "replies": []}]}]}, {"body": "Yeah you're right. The distinction is important because 3 million is a fuck ton lol", "score": 1, "replies": []}]}, {"body": ">A plane fucking crashed years ago and KILLED HUNDREDS. the stock recovered since that low.\n\nBoeing's stock did recover back then but after further news came out about how badly they've handled the 737's the stock has pretty much been a dumpster fire.", "score": 15, "replies": []}, {"body": "Boeing is up 7% percent since March 2020 while Airbus is up 114%. So the stock hasn't been great. That said, Boeing isn't going anywhere so it may be time to buy.", "score": 4, "replies": []}, {"body": "I forgot all about Wells Fargo omg!", "score": 2, "replies": []}, {"body": "The company killed hundreds of people and all you can think of is the stock recovered?\nThat incident was debatable as most thought it was an accident. But with what the whistleblower has revealed and the fact that this whistleblower turns up dead right when he was gonna testify….sorry I don’t blame OP at all. Do you really want to associate either a company who may have murdered a whistleblower? Some things are about more than money.", "score": 1, "replies": []}, {"body": "The wheels fell off a plane a couple days ago, and now there is news of a window cracking at 10,000 feet. I’m gonna place a 165 put for 395 Tomorrow morning. See what happens. It’s at 172 right now.", "score": 1, "replies": []}, {"body": "Had not much to do with the crashes and a lot to do with COVID stock market tank", "score": -2, "replies": []}]}, {"body": "Up up up you go", "score": -3, "replies": []}, {"body": "He would get backlash for trying to push his puts ITM, I’m not saying he’s right or wrong with his post/belief. I’m just pointing out how that would go…", "score": -30, "replies": [{"body": "What do you think he’s doing now?", "score": 18, "replies": []}]}]}, {"body": "> Everyone needs to start shorting and selling boeing stock to drive their price down.\n\nlol! Maybe you'll have better luck in wsb sub", "score": 177, "replies": [{"body": "Right? Sounds like OP bought a Put", "score": 57, "replies": [{"body": "> Sounds like OP bought a Put\n\nyeap! :)", "score": 10, "replies": []}]}]}, {"body": "I've questioned for years why BA and SPR are so high despite negative book value, negative earnings, and no end in sight to the bleeding, let alone the terrible quality they offer customers. The response is always a nonsensical one about being a government subsidized duopoly, since this really only validates their bonds not equity investments.", "score": 109, "replies": [{"body": "Have you actually looked at Boeings financials? They’re reporting negative earnings because of massive non cash expenses…", "score": 43, "replies": [{"body": "Can you explain like I am 5", "score": 21, "replies": [{"body": "Their net income is not negative because they are actually losing money. There are non-cash expenses like depreciation and amortization (most likely from their huge capital expenditures in acquiring planes or leasing them) that make it seem like they are negative. They are non-cash because the cost of the equipment they buy is spread out through its useful life, but the expense doesnt constitute a cash transaction since it has already been paid for.", "score": 51, "replies": []}, {"body": "I’m not an accountant but as I understand it, in accrual accounting, businesses measure net income by including non-cash expenses such as depreciation and amortization, stock-based compensation, or provisions for future losses. The reason they do this is varied, but usually has to do with the “matching principle” of accrual accounting. For example, the cost of an asset that is paid in cash might be spread out or “depreciated” over time so that its cost is tied with the benefits the owner gets from the asset.\n\nAccrual accounting can be contrasted with cash accounting. Cash accounting is an accounting method in which revenue is only recorded when cash is received, and expenses are recorded after cash payments are made.", "score": 18, "replies": [{"body": "now explain like im 4", "score": 41, "replies": [{"body": "Sometimes accountants play pretend and list expenses that aren’t actually expenses paid with money", "score": 41, "replies": [{"body": "OH i see like depreciation of an asset.. thanks (:", "score": 13, "replies": []}]}]}, {"body": "Not an accountant either but I am almost positive cash vs accrual isn’t the reason. You can still report non cash expenses on a cash basis.", "score": 3, "replies": [{"body": "Last I remember, GAAP has standards on how you need to expense certain things like depreciation, etc on the income statement? Since GAAP is generally more rigid than IFRS I didn’t think it offered a lot of wiggle room on those types of things", "score": 1, "replies": [{"body": "You encouraged me to do at least a little googling.. I am thinking of *modified* cash basis reporting. I think you’re right on the classic cash basis i.e. whole thing should be expensed immediately.", "score": 1, "replies": []}]}]}]}]}, {"body": "I look at their financials at least twice per quarter. Operating cash flow for the 2023 year was $5960M, debt expense $2561M, which gives a cash flow of $3399M without any deprecation or write-downs. If we took this number as their net income, this would give BA a P/E of 33 as of today's $184 per share closing, and 46 at year-end 2023 price of $260. Plus their cash came down and debt went up.\n\nSo even if we chopped the non cash expenses, their numbers are still ridiculous.", "score": 4, "replies": [{"body": "How is that valuation ridiculous?", "score": 2, "replies": []}, {"body": "Eadsy trades at 32 PE right now so it's not completely out of line", "score": 1, "replies": []}]}]}, {"body": "Boeing produces military aircraft and technology.  Along with their commercial aviation interests.  They are co-dependent with the DOJ and DOD on a national security basis.  Boeing is a public company.  However, there are aspects to their financials that are in fact classified for National Security.  So long as Boeing is under contract for military aircraft.  They will not collapse regardless of the known and unknown financials.", "score": 41, "replies": [{"body": "This is exactly the kind of comment I was referring to. You're saying a company is publicly privileged such that it won't go bankrupt, therefore it makes a good equity investment. They have no equity! Their book value is negative $28 per share! They pay their debt by taking on more debt! I know the government won't let them go caput, which is why their bonds are probably worthwhile. But their common shares are an equity investment, which makes no sense.\n\nI also get what you're saying in terms of aspects of secret contracts likely being quite positive relative to their knowns financials. I simply doubt it changes the picture meaningfully.", "score": 12, "replies": [{"body": "I agree it is negative.  I'm not in at $28 share.  Although I have an ETF that holds Boeing.  I'm not interested regardless.  Aeronautics is a very interesting industry.  My degree is in Aeronautics Management.   You don't buy aviation for the short-term it is a very long-term investment.  An Aeronautics company will spend billions of dollars I R&D often over the course of many years designing a new aircraft.  When they are done they will have explosive profits for purchases over a couple quarters.  Then they spend the next decade delivering those orders.  Boeing will rebound and look the greatest company on the planet for a quarter.  Then go back to lookin like shit.  That next aircraft will likely be the MQ-28 an AI operated unmanned military recon plane.  Ours and approved allies governments will pay.  At that point the stock will fly the roof like Pfizer making the  announcement for the covid vaccine.  These are cyclical companies. You really need to look at 10 year earnings not quarterly when evaluating companies like this.  Now is a good time to buy Boeing.  Once they make the announcement of of a $1 trillion sale, that will all fall on a single quarters earnings report.  It will already be too late to invest at a value to make the sale at its high.", "score": 4, "replies": []}, {"body": "the higher-than-it-should-be stock price may have to do with the perception of stability that the person you're replying to believes exists.", "score": 2, "replies": []}]}, {"body": "This is quite wrong, and the fact it's upvoted just goes to show bagholders are plenty here. Yes, Boeing is \"vital\" to the US military for obvious reasons.\n\n\n\nThat does not in *any way, shape or form protect shareholders*. Quite the contrary, wiping out shareholders is common to save \"vital\" businesses. After all shareholders are nobodies and \"to big to fail\" tends to mean just that, sheepish shareholders get slaughtered and the company survives.", "score": 10, "replies": [{"body": "Indeed. GM comes to mind.\n\nAir Canada.", "score": 3, "replies": []}, {"body": "I didn't say it is a good investment.  I said, \"Now is the time to buy if you're buying.  1 hope you don't hold the bag for 10 years. 2 the new aircraft are.in fact profitable.  There are no guarantees.  Selling at a prime time is where you can profit.  Personally I won't do this because risk is to high for me.  The company isn't going bankrupt.", "score": 4, "replies": []}]}]}, {"body": "the government contracts alone will keep them around indefinitely.", "score": 5, "replies": []}, {"body": "Honestly, the way the US works, wars are cyclical and it’s been awhile since we really engaged in one in force. They’ve probably got good tailwinds just from that. We’re fucking bullies, if we haven’t kicked someone in the head in awhile you can bet it’s coming. Despite how it sounds, I’m serious.", "score": 4, "replies": []}, {"body": "> I've questioned for years why BA and SPR are so high despite negative book value, negative earnings, and no end in sight to the bleeding, let alone the terrible quality they offer customers. \n\nWelp, negative earnings and negative book value come from GAAP-related accounting conventions - looking at their historical financials, they generated ~$3.4bn in OCF in Q4 2023A alone, so I'd say that's a pretty good financial reason that 1/2 of a global duopoly hasn't seen it's share price drop to $0", "score": 1, "replies": []}]}, {"body": "Translation - “I’m shorting Boeing. This is my weak and super transparent attempt to try to get people to follow my trade. \n\n\nEnough of this shit", "score": 67, "replies": [{"body": "They deserve to dump", "score": 10, "replies": []}]}, {"body": "Ah yes, because retail certainly has the power to crush a company's stock and drive them out of business.\n\nThis post is dumber than a plane that randomly has doors blow out mid-flight.", "score": 132, "replies": [{"body": "I shorted them last night and I woke up to find out that Boeing didn't disappear? Why? I thought this meant that I was deleting them from everyone's stock market? Is this a short ladder attack or are they maybe hacking our stocks app?", "score": 5, "replies": [{"body": "It's those goddamn long hedge funds attic boxing the stock.", "score": 2, "replies": [{"body": "I'm staring at some charts rn. I think I'm starting to see a box cutter pattern forming. We might have a chance here.", "score": 3, "replies": []}]}]}, {"body": "I see the next gme lol", "score": 12, "replies": [{"body": "\"I just don't like the stock\"", "score": 30, "replies": []}, {"body": "You might have to expand on this comment… it doesn’t make much sense at face value", "score": -13, "replies": [{"body": "Some people mistakenly believe that retail will still be able to pump meme stocks like GME, much like OP here thinks retail has the ability to short BA into the ground. The meme stock crowd and OP also mistakenly think that shorting a stock can drive it out of business. Not even hedge funds can drive BA out of business by heavily shorting the stock.\n\nBA will go out of business if they continue having all these safety issues, if people protest, and if BA's problems kill their profits. Anyone short on BA will profit from this, but their short position won't have any impact on BA failing as a company.\n\nIt's the same thing as thinking that hedge funds caused Bed Bath and Beyond to go out of business when in reality it was a dying brick and mortar retailer that failed to evolve or pivot and was heavily mismanaged at the top levels.", "score": 9, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Well that is on me for missing that, but it also explains everything lol! Hilarious. It seemed like I was talking to an ape of some kind.", "score": 8, "replies": []}]}]}, {"body": "A meme / hype stock where everyone looses money", "score": 2, "replies": [{"body": "And to expand even more, because government entities are too involved financially to let certain bad actors fail….  ie. GME and the funds that were shorting them to oblivion, saved by regulators even tho they were using illegal tactics to destroy them… now inversely BA being saved by regulators to protect the money invested in them by these funds and the government them selves…", "score": -7, "replies": [{"body": "Not a single complete sentence in there. Actually impressive.", "score": 7, "replies": [{"body": "You expect him to be calm? You'd also be fucking panicking if you knew what he does. \n\nThe government is pulling off an illegal finance move known as an inverse GME, and you're unable to see this? Even as the regulators move in to protect the money? \n\nYou should've realised the regulators were doing this the moment they stood in front of the money to protect it from hedge fund attacks (because their opaque bodies block your view so you can no longer see the money, proving they're protecting it from us) \n\nIf the regulators move in to protect the money and the bad actors don't fail... well... you do the math", "score": 1, "replies": []}]}, {"body": "Please expand a little further. You're so close to figuring everything out. Drop me your full DD on this. I need to read it.", "score": 1, "replies": []}]}]}]}]}, {"body": "Are you under some kind of delusion that a company has to go out of business for shorting them to be profitable?", "score": -9, "replies": [{"body": "No. Read OP's post. He is not suggesting shorting BA is a good chance to profit, he's asking everyone to band together and short them so they go out of business, which is delusional.\n\nWhat part of my comment made you think I believe that shorting is only profitable if a company goes bankrupt?", "score": 21, "replies": [{"body": "Maybe you should read the post. He’s not “suggesting” anything. He specifically you said should short it to drive the price down. Which is exactly what will happen if people short it. He made no mention of driving them out of business.\n\n> What part of my comment made you think I believe that shorting is only profitable if a company goes bankrupt?\n\nThe part where you made fun of him and (incorrectly) implied it was a zero sum game to drive them out of business or bust.", "score": -8, "replies": [{"body": "If you think retail shorting BA will make the price go down, you're exactly why I was mocking OP. Retail ain't moving the needle on this thing. You are correct that he did not say anything about driving them out of business, although I think it's pretty easy to infer that given his comment about the company being crooked and dangerous.\n\nThat is beside the point though and again, I never said anything about shorting being a zero sum game.", "score": 5, "replies": [{"body": "Don’t worry, they’re down 12% the last 6 months. It’s not just the retailer shorting them 😉\n\nIn any case, shorting BA has been more than profit recently, so whatever you think you see in your crystal ball is deeply flawed.", "score": 1, "replies": [{"body": "Boeing has shown itself to be a really bad company. They're endangering people. They've been getting worse. They need to get their shit together or get shut down. \n\nI don't like the company or their stock. Their stock falling is well deserved. Congrats to everyone who managed to profit from that. I think BA is a good stock to short. Fuck Boeing. I want to see them go down just like OP does because they're getting people killed.\n\nMy point is that OP seems to think that the best way to put Boeing out of business is to have everyone in this sub short them, but that is not how any of this works.\n\nI'm not using a crystal ball, I'm using facts. Retail can't put a company like Boeing out of business by driving their stock price down. Giant hedge funds like Citadel can't put Boeing out of business by driving their stock down.\n\nIf you want to make money, short BA. I think that's a good bet. If you want Boeing to shut down because they're a shitty and dangerous company then raise awareness of their issues, go out and protest against them, write your congressman, etc. Nothing you or anyone else does in the stock market will factor into that though.\n\nChrist, my fucking head hurts.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Agreed", "score": 30, "replies": []}, {"body": "Would this also happen to help you start printing on your puts?", "score": 30, "replies": [{"body": "Nah, I haven't done anything yet. I'm just trying to get an angry mob going because they are unbelievable and grossly negligent.", "score": -42, "replies": [{"body": "i'm not sure if that's better or worse", "score": 20, "replies": [{"body": "Sure buddy. Where real activism is done in the work, stock trading subreddits. Fuck off", "score": -3, "replies": [{"body": "what has you so butthurt, friend? did i offend you in some way? i apologize if i did, it wasn't my intention", "score": 5, "replies": [{"body": "Oops. I was trying to reply to OPs comment above you. I fucking hate the Reddit app and badly miss my Apollo.", "score": 4, "replies": [{"body": "lol it's coo", "score": 1, "replies": []}]}]}]}]}, {"body": "You realize that if you do have a position in BA, any position, and you’re publicly telling people to short it while claiming not to have a position, you’re committing securities fraud. \n\nIn other words - you’re committing securities fraud, chief.", "score": 9, "replies": [{"body": "I dont have a position, chief. But I appreciate the warning.", "score": -10, "replies": [{"body": "Sure, chief.", "score": 3, "replies": []}]}]}, {"body": "Why? You had the chance, lol.", "score": 1, "replies": []}, {"body": "How very Trumpian of you", "score": -4, "replies": [{"body": "He is not wrong.\n\nBA should be facing a lot more repercussions than they have been.", "score": 3, "replies": []}]}, {"body": "Oh so adorable, you actually think reddit can drive a mega cap stock down...", "score": -1, "replies": []}]}]}, {"body": "Short Boeing if you think their sales are going to drop.  But remember this, there are only two companies that sell airliners, AirBus and Boeing.  Boeing is a strategic industry not only for our economy but as a defense contractor.  \n\nThey may get beat up but they are not going away, short them at your own risk.\n\nGood Luck", "score": 7, "replies": [{"body": "Actually there are more than two. But they don’t sell wide bodies.", "score": 2, "replies": []}]}, {"body": "Two large companies dominating a market is a Duopoly, not a Monopoly...\n\nNonsense detected. Opinion rejected...", "score": 10, "replies": []}, {"body": "[deleted]", "score": 25, "replies": [{"body": "Haha right on spot", "score": 1, "replies": []}, {"body": "Nobody's grumpy, I just don't smoke crack is all", "score": -35, "replies": [{"body": "I would have lost that bet.", "score": 12, "replies": [{"body": "I heard that", "score": -5, "replies": []}]}]}]}, {"body": "dumb af, the government isn't going to let 170k jobs blow up", "score": 5, "replies": []}, {"body": "SEC, this guy right here", "score": 12, "replies": []}, {"body": "Investors will just bail. No need to short.", "score": 5, "replies": []}, {"body": "Yeah go ahead and do that while the stock is down 30% YTD. I’m going long. Separate emotion from trading", "score": 7, "replies": []}, {"body": "Alright OP, will manipulate the markets for you in a moment", "score": 7, "replies": []}, {"body": "Lol. Ok Mr. Activist investor.", "score": 21, "replies": []}, {"body": "Corrupt defense contracts. \n\nBoeing isn’t going away. \n\nFun fact when I was in the Air Force they were upgrading the E3, you know the AWACS plane with the big spinning radar dome, at the same time we were also preparing to decommission them… that’s Boeing and how it’s in bed with the DOD for ya.", "score": 9, "replies": [{"body": "Ya, I figured as much, but I would like to hope one day live in a world where shit like this or that doesn't happen", "score": -6, "replies": []}, {"body": ">Boeing isn’t going away.\n\nDoesn't have to", "score": -2, "replies": [{"body": "I mean sure. Short it to $150 at most.", "score": 2, "replies": []}]}]}, {"body": "this is the biggest buy signal", "score": 3, "replies": []}, {"body": "This piece of shit company killed hundreds of passengers for profit. The stock deserves to be bullied in the market. Short these fucks. Sell your shares.", "score": 7, "replies": [{"body": "deaths per marketcap should be a metric.", "score": 1, "replies": []}]}, {"body": "Market manipulation?", "score": 7, "replies": []}, {"body": "Post your positions.", "score": 2, "replies": []}, {"body": "New York Post has a Statement of his attorneys. Crazy Story: \n\nhttps://nypost.com/2024/03/12/us-news/lawyers-for-boeing-whistleblower-john-barnett-question-suicide/amp/", "score": 2, "replies": []}, {"body": "Yeah get ready for a boening. This company hasn’t been trading on fundies for a minute now.", "score": 2, "replies": []}, {"body": "If Boeing goes bankrupt, Airbus would have a definite monopoly on passenger planes\n\nYou sure you're okay with that?", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Passenger planes would get waaayyyy more expensive, and airliners would have to cut routes or fly older planes longer. Both are bad for consumers.", "score": 1, "replies": []}]}]}, {"body": "Nearly a monopoly?!  \nAirbus and Embraer would like a word.", "score": 2, "replies": []}, {"body": "This kind of activism seems dumb to me. Do what you want, but there’s a plane duopoly. The stock price is taking a beating. But eventually, this will be history and they will still make planes.", "score": 2, "replies": []}, {"body": "I will be buying leaps. Anyone else?", "score": 2, "replies": []}, {"body": "Not just shorting, but when I fly it will specifically be on an airbus. Not just to stick it to the man, but I don't want to be part of an exploding airplane.", "score": 2, "replies": []}, {"body": "Y'all are ridiculous to actually believe this was a hit job.\n\nDude retired years ago and was blowing the whistle way back then. In fact the FAA required Boeing to make corrective actions as a result. If they'd wanted to put a hit on him that was the time to do it. Classic Reddit fashion though...see headline, make assumption, don't think critically.", "score": 2, "replies": [{"body": "Either it was a hit job or boeing drove him to commit suicide, either way.", "score": 1, "replies": []}]}, {"body": "I just posted #shortboeing on wallstreetbets. It was stupid I know. I got banned. Dagogo released a video  about Boeing. I knew it's bad, I didn't knew people are dead and severely injured. Boeing must go #shortboeing", "score": 2, "replies": []}, {"body": "You’re not real smart are you?  You really think the shareholders have benefited by all of these fuck ups?", "score": 5, "replies": []}, {"body": "Would you rather fly a Chinese made plane?", "score": 4, "replies": [{"body": "At this point? Possibly. 10/15 Boeing engineers wouldn't fly on the planes they build, so that's that", "score": 4, "replies": [{"body": "If it's Boeing I ain't going", "score": 6, "replies": []}, {"body": "Engineers complaining.... name a more iconic duo.", "score": 1, "replies": []}, {"body": "Airbus sure, but after that I would nenver fly China made.", "score": 1, "replies": []}]}, {"body": "In 2024? Absolutely", "score": -2, "replies": [{"body": "Enjoy the even worse issues then.", "score": 1, "replies": [{"body": "In what world is China not leading in building shit? American profit motive is perverse and Boeing is a clear example of that.", "score": 1, "replies": [{"body": "Building shit sure, build shit that work and works well is a different story. Also Taiwan isn't China when we discuss manufacturing here.", "score": 0, "replies": []}]}]}]}, {"body": "I’d like to see what space x can do… bet they’d put Boeing to shame in the first year, look how easy they outdid them at rockets😅", "score": -3, "replies": [{"body": "I agree, and while the safety standards at SpaceX are seemingly quite different than they are at Tesla (thankfully), I still don't feel confident placing investments on something that Elon can tank with an ill-advised tweet.", "score": 3, "replies": []}]}]}, {"body": "Bottom. Ill be loading up.", "score": 2, "replies": [{"body": "tf you call me", "score": 0, "replies": []}]}, {"body": "I went to buy puts after John Olivers bit about them but the puts were so expensive….still should have done it.", "score": 2, "replies": []}, {"body": "And if you fly ask what kind of plane it is. Can I get an Airbus Bombardier instead?", "score": 1, "replies": []}, {"body": "Hopefully DOD realizes this and takes them out of the running for NGAD", "score": 1, "replies": []}, {"body": "I like the idea of making money shorting. Tried on the beginning with no luck. I might try some puts in the morning. Seems like a no brainer, but that’s what I thought when the door blew off", "score": 1, "replies": []}, {"body": "What's the opposite of a pump and dump? Whatever it is, that is this post.", "score": 1, "replies": []}, {"body": "go long on boeing, got it", "score": 1, "replies": []}, {"body": "Finally! Something I can kinda agree on but it’s going up tmr though then we short or maybe up for 2 days then short ye?", "score": 1, "replies": []}, {"body": "Can I just dump all my money into Airbus instead?", "score": 1, "replies": []}, {"body": "Sounds like someone's got some puts that they want to print.", "score": 1, "replies": []}, {"body": "What will make this stock go up? Really hard to imagine anything right now. \n\nIf the market goes down, so will Boeing as investors sell losers. \n\nBoeing was a lot cheaper back when the MAX issues were plaguing the company that they are today.", "score": 1, "replies": []}, {"body": "I made ~300% return off of puts I bought the day the door blew off. I sold about a week later when a report came out about them finding more bolts missing. \n\nI wish I would have doubled down and bought more.", "score": 1, "replies": []}, {"body": "I've been shorting the stock since the first incident came to light. Keep it up.", "score": 1, "replies": []}, {"body": "Already doing it", "score": 1, "replies": []}, {"body": "I agree!!!", "score": 1, "replies": []}, {"body": "Reddit gonna Reddit, I suppose. Meh.", "score": 1, "replies": []}, {"body": "Now that whistleblower is gone would it be a good buy soon? \n\nJust asking how this will play out irl?", "score": 1, "replies": []}, {"body": "I’m with you guys in spirit. Boeing needs a reckoning, heck the entire market needs one.", "score": 1, "replies": []}, {"body": "I’m thinking it might be good to short the airlines as well", "score": 1, "replies": []}, {"body": "Who tf can afford those options lol not me", "score": 1, "replies": []}, {"body": "Feels like it could be buying time in a few months. Get her low. Boeing will be around after we are all long gone", "score": 1, "replies": []}, {"body": "Agreed. I may short a bit tomorrow honestly. Totally shit company and I fly often for a living with my life in their hands.", "score": 1, "replies": []}, {"body": "This posts should be banned, there is WSB for this.  \n But he is not posting position, so not even WSB will allow this", "score": 1, "replies": []}, {"body": "I’m in the stock market to make money and not an activist at all but man idk if I can get with companies killing their own people like that.", "score": 1, "replies": []}, {"body": "Calls it is", "score": 1, "replies": []}, {"body": "Unalive the stock price ", "score": 1, "replies": []}, {"body": "That does it, I'm putting down a call today", "score": 1, "replies": []}, {"body": "oh drive price down .. lol like nose dive. wooo that could be a turbulent investment.", "score": 1, "replies": []}, {"body": "How much $$$ did you short it ???", "score": 1, "replies": []}, {"body": "Well the US gvt is gonna cover for Boeing anyways.", "score": 1, "replies": []}, {"body": "did you do that when the max went down in kenya?", "score": 1, "replies": []}, {"body": "Sorry, but i'm here to make money, not for activism.", "score": 1, "replies": []}, {"body": "\\> nearly has a monopoly on their industry.\n\nnope. Airbus exists.", "score": 1, "replies": []}, {"body": "OP just put evidence of attempt to commit conspiracy out there on social media.", "score": 1, "replies": []}, {"body": "Yes, please sell them.. so I can buy them.\n\nSrsly Boeing is a, if not THE most important critical company the US has. No Boeing means the US would have no company able to build passenger planes. They will never let them go bancrupt.", "score": 1, "replies": []}, {"body": "Get that hive mind garbage out of this sub", "score": 1, "replies": []}, {"body": "Shorting is risky here.  Boeing is too critical to fail, and will be supported by the government if need be.\n\nTBH, i'm thinking of picking up some shares if it retests the 52 week low.", "score": 1, "replies": []}, {"body": "$180 then sideways.  Your Theta will crush you.", "score": 1, "replies": []}, {"body": "Another incident. Not going to fly Boeings anytime soon \n\n\nhttps://www.dailymail.co.uk/news/article-13190091/amp/United-Boeing-jet-bound-San-Francisco-forced-landing.html", "score": 1, "replies": []}, {"body": "Bought 1666  3/15 195 put options yesterday and sold 1000 of them for ~80% profit.\nI let the rest of 666 (the number of the beast 👹)  ride.", "score": 1, "replies": []}, {"body": "Too big to fail", "score": 1, "replies": []}, {"body": "We just need to ask “\nWho stands to gain from his death”..", "score": 1, "replies": []}, {"body": "Boeing murders whistleblowers.", "score": 1, "replies": []}, {"body": "But muh diversity!!!", "score": 1, "replies": []}, {"body": "This is investing and the stock market. When has anyone cared about morals, it's about profits...\n\nBring morals into investing is idiotic IMO.", "score": 1, "replies": []}, {"body": "Lol my teacher had a GTC order a while ago and he forgot about it, mid class got a notification that he bought Boeing which is kinda funny seeing this afterwards", "score": 1, "replies": []}, {"body": "This isn't news to people though. Boeing's share price hasn't recovered to pre-pandemic prices, whereas Airbus and other competitors have, so you could argue all the negative sentiment you mentioned is already priced in.\nIf you think it isn't priced in, what share price do you think it needs to fall to?", "score": 1, "replies": []}, {"body": "Boeing not going anywhere.  I just bought another 25k in BA stock.  Suck on an egg :)", "score": 1, "replies": []}, {"body": "If their price goes down enough, maybe the DOJ will get a pair and jail the entire C-suite", "score": 1, "replies": []}, {"body": "Tough to make money shorting a monopoly.", "score": 1, "replies": []}, {"body": "Yeah!!! *shuffles my $120 put under the table*", "score": 1, "replies": []}, {"body": "Seems a bit late now. You should have jumped on the train when the door plug blew out", "score": 1, "replies": []}, {"body": "Nah I’m not gonna do that have fun though.", "score": 1, "replies": []}, {"body": "lol the government will never let them fail! \nRemember that one part in the capitalist handbook about “too big to fail” lol", "score": 1, "replies": []}, {"body": "He can’t keep getting away with this!", "score": 1, "replies": []}, {"body": "They are just the fact that Airbus exists away from a monopoly", "score": 1, "replies": []}, {"body": "Short selling doesn't lower a stocks price", "score": 1, "replies": []}, {"body": "Already did", "score": 1, "replies": []}, {"body": "Why not just buy embraer stock\n\nOr tell the pilots union to stop with the regional limitations that keep the duopoly in place", "score": 1, "replies": []}, {"body": "> Everyone needs to start shorting and selling boeing stock to drive their price down. They compromise their passengers for the benefit of their stock holders.\n\nThis is the sole purpose of a firm.", "score": 1, "replies": []}, {"body": "It’s almost time to go long and make tons of monies", "score": 1, "replies": []}, {"body": "lol. You think this is bad look into what blackrock, Pfizer, or all other defense stocks.", "score": 1, "replies": []}, {"body": "This doesn’t make much sense …tank Boeing stock so they have even less money for manufacturing. Seems to me a lot of there cost cutting measures make flying less safe.", "score": 1, "replies": [{"body": "I just saw a news article saying the same thing. How increased scrutiny against boeing would make them lie more. It's almost laughable.", "score": 1, "replies": []}]}, {"body": "Been doing that since the incident with the door going missing. Made me quite a bit of money.", "score": 1, "replies": []}, {"body": "Pretty sure shorting doesn’t necessarily do anything bc their revenue streams are the same, if anything I’d assume this would increase cash flow?", "score": 1, "replies": []}, {"body": "Let's short a defense contractor as if we have any real power to screw with the MIC... Not very smart.", "score": 1, "replies": []}, {"body": "Let’s go team! Based shorts", "score": 1, "replies": []}, {"body": "Boeing stock said hold my beer", "score": 1, "replies": []}, {"body": "i shorted at 177 and losing now. lesson learned. dont fuck with companies that are in bed with the government and have shady dealings", "score": 1, "replies": []}, {"body": "Idk how people think airlines are ever a good investment", "score": 2, "replies": [{"body": "airlines?", "score": 3, "replies": []}]}, {"body": "I hope you have friends with deep pockets. You realize this $112b company controls a major portion of the market share? BA isn’t going anywhere anytime soon. Even if their planes are death traps.", "score": 1, "replies": []}, {"body": "Lols, nothing like trying to put 10,000 plus people out of work because the leadership needs replaced. Betting agains Boeing is silly. Not saying they’re too big to fail, but they are one of the largest aerospace corporations out there.", "score": 1, "replies": []}, {"body": "tub shrill direful aloof chubby humor pause fragile pet deliver\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": []}, {"body": "I feel more angry about \"suicide\" witness. That's a huge threat to anyone in this society. Yes, short!", "score": 1, "replies": []}, {"body": "Boeing has been going down the drain since the merger with McDonnell Douglas who had a less than stellar track-record for safety. They allowed the monkeys into the cage and then wonder why there is shit flying everywhere.", "score": 1, "replies": []}, {"body": "It’s just common sense. Don’t short after the first big fuck up. Wait for the second plane to fall out of the sky. More than likely a 3rd will and more bad fallout and negative PR.", "score": 1, "replies": []}, {"body": "As an airbus enjoyer I agree with this idea", "score": 1, "replies": []}, {"body": "Actually did today for moral purposes and I also hope it tanks.", "score": 1, "replies": []}, {"body": "They Epsteined their whistleblower", "score": 0, "replies": []}, {"body": "The Federal Government will prop them, they cannot lose them as a contractor. Boeing is unstoppable.  Bullish", "score": 0, "replies": []}, {"body": "Guys I bought the dip, dont short boeing.\n\nOr you going to boeing island.", "score": -1, "replies": []}, {"body": "Please do, I’ll just pick up more shares for cheap", "score": -1, "replies": []}, {"body": "I hope Boeing stock goes to 0", "score": -2, "replies": []}]}
{"title": "Tesla is the worst performing stock in the S&P 500 year-to-date", "selftext": "Ranked number #503 in YTD performance, with -28.5%, worse than even Boeing.", "id": "1bcw3an", "created_utc": 1710246622.0, "score": 616, "upvote_ratio": 0.94, "num_comments": 326, "comments": [{"body": "Yes, the performance is pathetic.", "score": 96, "replies": [{"body": "if Elon keeps up his political speech it will get worse", "score": 58, "replies": [{"body": "Agreed.", "score": 25, "replies": []}, {"body": "I've literally never seen any person tank a stock by themselves by things that they say before this\n\nI totally feel like this will go down in history as an example of how to sink a company by opening your stupid mouth\n\nI can't believe the board doesn't get rid of him", "score": 14, "replies": [{"body": "Lets not all blame on Elmo. Its not like Tesla is blowing away the earnings.", "score": 2, "replies": [{"body": "Part of the role of the CEO is to expand the company, so even on that front he deserves some blame. He’s either spreading himself with among his other pursuits or outright goofing off on X / twitter and planning pointless political stunts", "score": 2, "replies": []}]}, {"body": "See \"Gerald Ratner\".  Wonder how long before we have one of those moments....", "score": 1, "replies": []}]}, {"body": "It's hard to tell the exact point where he became his own company's worst liability but the ex-Twitter lurch in his political speech is certainly not helping.", "score": 11, "replies": [{"body": "So bizarre... He was viewed as a visionary by most and now just some rich edgelord.\n\nMaybe he got caught in the alt-right propaganda wave and isn't aware of it.", "score": 5, "replies": [{"body": "He first took some criticism from the \"legacy media\" when he called that guy a pedophile who was trying to save the kids trapped in a Thailand cave.\n\n\nHe's been doubling down ever since.", "score": 7, "replies": [{"body": "Yea that did seem like a turning point.\n\nDa fuq Elon gain out of publicly calling a rescuer a pedo?\n\nI watched a documentary on this rescue and it was obvious a sub would not have worked. Elon musk be a pedo\n\nhttps://youtu.be/-mzqQ_vNiKg[https://youtu.be/-mzqQ_vNiKg](https://youtu.be/-mzqQ_vNiKg)", "score": 5, "replies": []}]}]}]}]}]}, {"body": "I just want to feel good about my largest investment (by far) and its CEO. I haven't felt that since atleast 2021.", "score": 20, "replies": [{"body": "Diversify", "score": 5, "replies": []}, {"body": "What is your time horizon? Are you planning to sell in the next 5 years? Do you think robotaxi will significantly increase the company's value in before you are planning to sell? \nI feel totally fine with the stock price in the last few years since i plan to hold it to at least next decade", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}, {"body": "The part-time CEO is such a huge disappointment. He's not focused, he's in disarray, and right at the time that Tesla is attempting to cross the proverbial market chasm, and it needs a fully-focused, fully-executing, full-time CEO, and it doesn't have it.\n\nI've been an investor since 2012. And I've completely had it with Musk and Tesla's board. We need new leadership and governance.\n\n[And now, assuming this place is like the TMC investor forum, I'll sit back and watch the QElons go apeshit and attack my heresy with all the usual froth and dudgeon :-) ]", "score": 1, "replies": []}]}, {"body": "It will likely go lower after 1st quarter P&D miss estimates, I’d imagine that will be the ultimate entry point.", "score": 65, "replies": [{"body": "Ever heard of priced in... Predicting stock movements off known information is really hard.", "score": 43, "replies": [{"body": "People thought the same before Q1", "score": 6, "replies": [{"body": "You cannot know to what extent people changed their expectations already. It can always be less, more, or just right. When I say \"priced in\" I just mean that this is known info and trying to trade off it is guessing really. If there is info you figure out that is less obvious, very likely that is not priced in and you can trade off of that. I just think the expectation for a miss is already well known and should be considered priced in.", "score": 5, "replies": []}]}, {"body": "I've been thinking that for the past year. I thought everyone knew we'd be in this slowdown a year ago, investor day made that extremely clear, as did everything leading up to CT.\n\nQuarter after quarter, it's been proven to me that the obvious isn't priced in.", "score": 5, "replies": []}, {"body": "the 1st quarter miss is already known information?  i wish.", "score": 0, "replies": [{"body": "Adam Jonas and Gary Black both well known Tesla bulls have already expressed this. Deutsch Bank's Emmanuel Rosner also has said this.\n\nSo yeah... I think this is already pretty well-known. Maybe why the stock is down over 10% since the beginning of the month.", "score": 7, "replies": [{"body": "That’s not known.  That’s informed speculation. It can affect the price, but not to the degree that the same information will if explicitly confirmed. \n\nA predicted miss is never “priced in” until it becomes an actual miss.", "score": 8, "replies": [{"body": "It depends on the size of the predicted miss. If the current sentiment is expecting a huge miss but only a small miss occurs, the stock would go up.", "score": 4, "replies": [{"body": "Very true.  But nothing is priced in right now with any certainty, I suspect we’ll see significant movement one way or another once we get the numbers.", "score": 3, "replies": []}]}]}, {"body": "its a speculation right now. Once an official earnings report states new information is available and SP will adjust, either way.", "score": 1, "replies": []}, {"body": "Gary is not a bull lol.", "score": 1, "replies": [{"body": "Yea he is. He is not a brainwashed fanboy though.", "score": 1, "replies": [{"body": "Gary is a rivian bull lol. He has less than 2000 TSLA shares.", "score": 1, "replies": []}]}]}, {"body": "Clearly, the logical explanation is FUD.", "score": 0, "replies": []}]}]}, {"body": "Yeah, you have to have inside knowledge like our senators!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "If China is about to collapse then Tesla’s only real competitor (BYD) collapses too.", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Nah I don’t think the market is pricing in China collapsing as you suggest.", "score": 3, "replies": []}]}]}, {"body": "Everyone’s been saying every economy is about to collapse since… forever. \n\nHow was the Cybertruck release underwhelming? The specs vs price? Shouldn’t that be good for investors?\n\nWhat are you referring to incorporation?", "score": 12, "replies": [{"body": "German economy is not at risk of collapsing", "score": 11, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Inflation isn't rising in germany", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I would be surprised if Cybertruck is not profitable with the margins they have on the foundation series.", "score": 1, "replies": []}, {"body": "That 4 wheel steer and steer by wire seems to be super expensive (redundancy)", "score": 1, "replies": []}]}]}, {"body": "Considering CT is backordered 4 years I would not say that is underwelming. German and chinese economies being in trouble mean US tesla factories is a plus.", "score": 4, "replies": []}, {"body": "Nobody is interested in \"winning\" uneducated doomers back.", "score": 2, "replies": []}, {"body": "Would localized economic issues actually have a negative impact on Tesla’s factories, though? Wouldn’t it increase the demand for jobs and allow them to have cheaper labor? Suppliers would also receive cheaper labor, so this would mean parts get cheaper. Ultimately that gives Tesla room to either price the cars lower or it lets them spend more on shipping them to other territories where demand is higher?\n\nAs others have already asked, what’s bad with the Cybertruck rollout? Higher prices means higher margins - maybe it’ll become profitable earlier than expected.\n\nAnd “no breakthroughs on FSD”? They just started rolling out a new build of v12. Assuming nothing comes up, it’s expected to have reached everyone who currently has v11 by this weekend. Everyone who has it so far is suggesting it’s a very big deal - it’s not the holy grail, but it’s within line of sight to the holy grail, with just a few remaining nits to be picked before we car start seriously discussing letting them operate with nobody monitoring.", "score": 2, "replies": []}, {"body": "China was a smart move, Germany was absolute insanity. From day 1 I knew they would have exactly the problems that they have and that the government would be ineffective at supporting them. The same government that shut down all the nuclear power plants and became energy dependent on Russia because of “environmental concerns” and is now in a recession.", "score": 5, "replies": [{"body": "Do we know what were the other locations that were open for consideration?", "score": 1, "replies": []}, {"body": "Also the country supporting Israel's genocide.  SMH.  You would think they would have learned by now.", "score": 1, "replies": []}]}]}, {"body": "Buy on the rumor. Sell on the fact. \n\nIt's priced in.", "score": 1, "replies": []}, {"body": "when is this out? cant find a date", "score": 1, "replies": [{"body": "April 2", "score": 1, "replies": []}]}, {"body": "Meh priced in", "score": 1, "replies": []}, {"body": "lmao, you were so damn wrong.", "score": 1, "replies": [{"body": "lol indeed, I was pleasantly surprised by this quarter", "score": 1, "replies": []}]}]}, {"body": "Huge buying opportunity for the company that sold 2 million EV’s last year. Model Y was the most sold CAR, not EV in the world. The performance of the company is unbeatable. Stock does not correlate to value, although they eventually do synchronize, see Meta, Nvidia and Netflix, all saw drastic lows before booms. The fud is high with articles like this, buy buy buy!!!", "score": 59, "replies": [{"body": "> Huge buying opportunity for the company that sold 2 million EV’s last year.\n\nTesla didn't sell 2 million EV's last year.  They may not sell 2 million EV's this year either.  BYD almost certainly will sell 2 million EV's though, and you can buy shares in that company for much, much less.", "score": 14, "replies": [{"body": "However the ASP of BYD cars are much much lower than Tesla's, lower profit per unit, BYD is not invading Europe like many suspected they would, and BYD sales in the US seem very far out if ever. BYD's TAM is starting to find its limits as Tesla's compact will directly compete with BYD next year.", "score": 13, "replies": [{"body": ">  BYD is not invading Europe like many suspected they would, \n\nYour evaluation was made when they are just starting now. These things don't happen overnight. I believe they will destroy many competitors in Europe.", "score": 5, "replies": []}, {"body": "All true, but I'd still rather buy the company with a forward P/E ratio of 15x rather than the one with a forward P/E of 65x.", "score": 6, "replies": [{"body": "Remind me! 6 months “BYD or Tesla?”", "score": 1, "replies": []}]}, {"body": "Tesla’s compact?", "score": 1, "replies": [{"body": "$25k model, which I thought would be a compact platform, but who knows, they may bet the farm on robotaxi, we’ll find out 8/8!", "score": 1, "replies": [{"body": "Okay. I’d heard about a compact but thought that was not going ahead.", "score": 1, "replies": [{"body": "There was a rumor perpetuated by Reuters last week saying that it was cancelled but Musk came out pretty quick saying the report was wrong, but with how quickly he changes his mind on things who knows. \n\nIf robotaxis improve as quickly as he thinks, Tesla will probably sell less cars to individuals and focus on robo taxi platform as there’s much more money to be made on it, and better for accelerating sustainable transport. I’d also think they would acquire the boring company and ramp up that business because it reduces road noise, tire pollution, and is better for land use which are the only remaining cons to ev’s over public transit. The robotaxis should also be accessible to the disabled which I’m sure is a tough engineering challenge.", "score": 1, "replies": [{"body": "Okay. Thanks for the info. 🙏🏼", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Tesla was at 2 million annualized sales in Q4.\n\nBYD also suffered losses in Q1 2024. These are macro factors and not exclusive to Tesla.", "score": 6, "replies": [{"body": "> Tesla was at 2 million annualized sales in Q4.\n\nNo, they sold 484,507 cars in Q4, less than 25% of 2 million.  Q4 is also the quarter with their highest sales.  In Q1 they aren't going to sell 500k.\n\n> BYD also suffered losses in Q1 2024. These are macro factors and not exclusive to Tesla.\n\nI agree with this, but BYD sold 526,409 BEVs in Q4, and their growth trajectory has been much better than Tesla's.", "score": 7, "replies": [{"body": ">**annualized sales**", "score": -4, "replies": [{"body": "Yes, if you __annualize__ Tesla's Q4 sales it is less than 2 million.  Math is fun!", "score": 5, "replies": []}]}]}, {"body": "You doesn’t appear to be quite good at math. 484k *4 <2m", "score": -1, "replies": [{"body": "I just choose not to be pedantic of a 3% difference I'm happy to round up.", "score": 2, "replies": []}]}]}, {"body": "The difference is BYD makes much less profit, will struggle to expand beyond China, and is not a major player in the energy storage business nor autonomy.", "score": 1, "replies": [{"body": "They sell  the battery used for storage.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "I'm not investing in any Chinese company. \nMy hope for tesla is that it doesn't tank the S&P 500 when it's price reflects reality.  I'll take this slow bleed, all the way to $25-$30 where it belongs.", "score": 1, "replies": []}]}, {"body": "BYD: Bonke Your Dolphin…..🐬", "score": -3, "replies": []}, {"body": "Go back to the \"real\" sub!", "score": 0, "replies": []}]}, {"body": "Except Nvidia sold state of the art, high quality GPUs.\n\nWhile conman Musk is selling zero quality control pieces of shit.", "score": 1, "replies": []}, {"body": "I hope your bags are small or you’re just getting paid to shill.", "score": 1, "replies": [{"body": "‘Shills’ got it up to half a trillion. You think they’re holding bags? Bhahahaha, okay pal 😂", "score": 1, "replies": [{"body": "Yep, a lot of people made good money, me included.  But Im talking about you, let me guess you bought in last year around 185 thought you were a genius, and now you’re watching your magic gains disappear like FSD, Tesla taxis, and Elon’s reputation.", "score": 2, "replies": [{"body": "Oh you totally made money 🤣. Bahahhahahaah. \n\nPoor guess too!", "score": 1, "replies": [{"body": "So just a shill, got it.", "score": 0, "replies": [{"body": "Got nothing again. 😂", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Self reported numbers put 3 + Y worldwide sales at 1.7m, so a lot less than 2m. That will assuredly drop in 2024. BYD will outperform. Ford still sells 800k F-150s every year, so take the numbers with salt.", "score": -1, "replies": [{"body": "BYD is a CCCP shill, you keep hearing great things untill they collapse like evergrande out of nowhere. Before BYD there was NIO, bankrupt..  being big in China never equates to being big worldwide. Only so far to spread!", "score": 7, "replies": [{"body": "Comparing a real estate company with car manufacturers is o ridiculous. It is like saying Tesla will be failing because Boeing just shit the bed. Actually the later companion make much more sense as they are both manufactures.", "score": 1, "replies": [{"body": "Do they both use money and banks? Not so ridiculous when that’s the same now is it?", "score": 1, "replies": [{"body": "Every company use money and banks.", "score": 2, "replies": []}]}]}]}]}, {"body": "Massively slowing growth. Massively contracting margins. The performance of the company can't be looked at in a vacuum. What you pay for earnings and earnings growth matters.", "score": -2, "replies": [{"body": "Are we referring to the entire market as a whole? Ah, tell me you don’t know what a Bull vs Bear market is, without saying it. Macroeconomics too for that matter!", "score": 0, "replies": [{"body": "the entire market is not in a bear market though", "score": 2, "replies": []}, {"body": "We are talking about Tesla stock.", "score": 2, "replies": [{"body": "Quite myopic.", "score": -1, "replies": [{"body": "I think it's hilarious you are trying to blame Tesla's performance on macro economics.", "score": 0, "replies": [{"body": "Yep.", "score": 0, "replies": [{"body": "Pull up a graph and see how much nasdaq rise ytd", "score": 0, "replies": [{"body": "Are you alive 1 year? Or dead in 1 year? Why look at a year? It’s an arbitrary time frame. Your thinking is self limiting, because you feel comfortable limiting your thinking.", "score": 1, "replies": [{"body": "The title says “worst stock year-to-date”. Are you blind ?", "score": 0, "replies": []}, {"body": "Initially I thought you are just bad at math by calculating 484k * 4 > 2million cars. Now I see your are bad at reading too", "score": 0, "replies": [{"body": "Yup", "score": 1, "replies": [{"body": "hows your port today?", "score": 1, "replies": [{"body": "Not sure, but made a solid 144k last year. Not bad eh? Gotta stick with your convictions kiddo, and don’t forget to live life 🤗. The port and the numbers will always be there. Also, Elon Elon Elon!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "1. Tesla is doing way better than any other car company as they can actually make EVs profitably. It's a tough year for us and it's worse for ford and GM. \n\n2. Everything hangs on fsd and bot. If they work it's trillions and if they don't were going nowhere.", "score": 41, "replies": [{"body": "Couldn't agree more.  Hold until 2030 and re-evaluate then.  Everything else is short term noise.", "score": 3, "replies": []}, {"body": "The bot was a cool project to attract AI talent.  Now it isn't clear he'd prefer to have AI talent at x.ai instead (until Tesla replenishes/gives him more shares to get him back to 25% voting rights).  Once the bot 'works' it's unclear how many they can make and at what profit margin, and how many paying customers there will actually be (and at what price), and where the competition (Figure/OpenAI, etc) will be at that point.", "score": 7, "replies": [{"body": "If there's a humanoid robot that can actually do useful work imo that's a hugely valuable thing.\n\nI also think in terms of competitors I can buy that they will make a good brain and a prototype ... however Tesla is proven in mass manufacturing whereas these other startups aren't and I think that might be a pretty big barrier for them.", "score": 6, "replies": [{"body": "Same with FSD. Even if Waymo gets a big head start, Tesla’s robotaxi’s will be cheaper than waymo because they don’t have to retrofit a huge, expensive sensor suite onto a jaguar. Nor can they leverage a huge network of service centers.\n\nHow many people check Lyft AND Uber at the same time, then go with which ever is cheaper? Tesla will be cheaper\n\nBot can do the same. None of these humanoid robot startups are going to be able to compete with Tesla at manufacturing and thus price.", "score": 4, "replies": [{"body": "Teslas end product will be garbage justl ikr with all their vehicles though.", "score": 3, "replies": [{"body": "Damn, you’re right! I should have thought of that…", "score": 2, "replies": []}]}, {"body": "If you think Tesla is going to win the robotaxi game then, I'm sorry, but you are out of touch. They may very well end up making the most widely used consumer FSD product, but they are absurdly far behind Waymo in the robotaxi game.\n\nThere's A LOT that goes in to a robotaxi service besides pure self driving. How do you manage pick ups on the side of the road? What if they are in a shopping mall and there isn't a clear pick up spot? How about customer support? Etc, etc.\n\nWaymo has been iterating on these problems for years and has had operational robotaxis for paying customers for years. Tesla is maybe 4-5 years away from providing a robotaxi ride to a paying customer.\n\nI'm a shareholder, not a Tesla bear, just speaking the truth that robotaxis aren't happening for Tesla. Not this decade at least.", "score": 1, "replies": [{"body": "My point is - Waymo’s lead, however big or small - doesn’t matter. \n\nOne day Tesla will have a fully functioning robotaxi service, with a structurally better cost. (Explained above) \n\nToday, most people shop Lyft and Uber and then pick whoever is cheaper. Fast-forward and swap out the two apps with Waymo and Tesla… no one is paying premium to Waymo or anyone else for a Robotaxi, so Tesla will eat their lunch. \n\n Unless you believe that Waymo can become a vertically integrated EV manufacturer before Tesla can solve FSD, there’s no way they can charge less than Tesla for a robotaxi. (Even then Waymo’s at a cost disadvantage because  of their sensor suite)\n\n I’m a M3P owner, canceled my FSD subscription last month because v11 was garbage, Tesla stock holder. \n\n Edit- also, who’s out of touch? Hahah, the guy who thinks building a customer support function is beyond Tesla’s capabilities? Hahaha, oh no, Tesla will never be able to solve the “meet your driver @ pin” feature!!! They should just throw in the towel!!! It’s hopeless!!!", "score": 2, "replies": [{"body": "This theory is foundationally based on Tesla's taxi service being equivalent to Waymo akin to Lyft and Ubers equivalency. The current reality is that there is no equivalency. Waymo R&D spending is probably close to $10 Billion, Cruise close to $15 Billion. Tesla total R&D since starting this FSD talk is about $15 Billion for the entire company. Most of which has nothing to do with self driving. Tesla will have to pour a lot more money into FSD to be where Waymo is when it comes to edge cases.", "score": 2, "replies": [{"body": "R&D dollars do not equal value to the customer.\n\nCurrent reality has been acknowledged as Waymo is ahead. I’m talking future-state, which is all that matters as investors.\n\nIn the self-driving sub there are threads questioning the scalability of waymo’s model and quoting $200k per taxi.\n\nAssuming $200k true, waymo’s taxi’s (or more specifically cost of hardware to be amortized over the expected lifetime miles of vehicle) is going to cost ~4X as much as Tesla’s.\n\nAnd that’s assuming Tesla can’t optimize for vehicle longevity.\n\nIf your argument is- Waymo will be so much safer that people will pay ~4x the price… you might be right for the next few years. But eventually Tesla will catch up and eat their lunch.", "score": 1, "replies": [{"body": "Isn't it strange that he promised 1 million tesla robotaxis on the road by 2020, and currently, 0 robotaxi is in service.\nThey are not gonna pull this out of the hat and crush uber this is beyond reality. Teslas don't have adequate hardware to become SAFE and reliable taxis, I understand if you hover over the steering wheel and brake pedal its relatively safe and only makes mistakes once every 35mins then FSD is okay but that is far from a fully autonomous taxi service.", "score": 2, "replies": [{"body": "It’s an 100% fair argument that the sensor suite Tesla is using won’t get them to FSD, even if I don’t personally agree. \n\nYou have 8 cameras with a constant 360 view of the car, that doesn’t stop paying attention, like humans do. \n\nYou just need to make it smart. \n\nChatGPT just needed better training approaches/architecture to get smarter, Tesla FSD just needs to do the same.", "score": 1, "replies": [{"body": ">\tYou have 8 cameras with a constant 360 view of the car, that doesn’t stop paying attention, like humans do.\n\nNot when the cameras get dirty, are occluded, or in bad lighting conditions.\n\n>\tYou just need to make it smart.\n\nWhich they’ve not been able to demonstrate despite claiming it is nearly solved for about a decade.\n\nAside from the sensors there are numerous hardware features that Waymo have incorporated to facilitate a robotaxi service, such as redundancy in all safety critical systems.", "score": 1, "replies": []}]}]}]}]}, {"body": "This theory is foundationally based on Tesla's taxi service being equivalent to Waymo akin to Lyft and Ubers equivalency. The current reality is that there is no equivalency. Waymo R&D spending is probably close to $10 Billion, Cruise close to $15 Billion. Tesla total R&D since starting this FSD talk is about $15 Billion for the entire company. Most of which has nothing to do with self driving. Tesla will have to pour a lot more money into FSD to be where Waymo is when it comes to edge cases.", "score": 2, "replies": []}, {"body": ">Tesla will never be able to solve the “meet your driver @ pin” feature!!! They should just throw in the towel!!! It’s hopeless!!!\n\nOh no, I don't think those things are unsolvable, just that they take additional time. Just saying that if Tesla magically solves self-driving tomorrow, there is still additional time before they have robotaxis.", "score": 1, "replies": []}]}, {"body": "Tesla has substantially more data than Waymo across the globe from all of their cars on the road collecting data every day. And as we've all seen with FSD v12.3 (and the upcoming update to auto park that just rolled out to employees), we really aren't that far off from Robotaxi. \n\n&#x200B;\n\nI'm not saying we are super close, I'm just explaining that the 'gap' with Waymo and Tesla is non-existent.", "score": 1, "replies": [{"body": ">\tI’m not saying we are super close, I’m just explaining that the ‘gap’ with Waymo and Tesla is non-existent.\n\nHow do you square this with the fact that Waymo have been operating a commercial robotaxi service for several years now while Tesla has yet to achieve a single driverless mile?\n\nNot to mention that no Tesla vehicle has redundancy for all safety critical systems like Waymo do?", "score": 2, "replies": [{"body": "It's a regulatory hurdle. You can say Tesla doesn't have a single driverless mile, but I can tell you from using 12.3 that I could have been sleeping in the trunk and the drive would have been the same result. And this is traveling from one densely populated neighborhood in Boston to another, including back roads and highways. If you've been to Boston, you'd understand how wild that is.", "score": 1, "replies": [{"body": "Waymo somehow managed to overcome this “regulatory hurdle” years ago, why can’t Tesla do it if their tech is as safe and reliable as you imagine?\n\nOne anecdote is meaningless. At any point in that drive you could easily have needed to intervene. Judging by other videos by FSD proponents online, chances are you probably should have.", "score": 1, "replies": [{"body": "One anecdote on Waymo is also meaningless. They are only in a few specific locations with a grid system, minimal room for error when everything is laid out in a grid. I don't see people sitting in the back of Waymos getting transported all around the US. Because they haven't gotten through regulatory hurdles yet either.", "score": 1, "replies": [{"body": ">\tOne anecdote on Waymo is also meaningless. \n\nI’m not providing any anecdotes. They have completed tens of millions of driverless miles.\n\n>\tThey are only in a few specific locations with a grid system\n\nAgain, Tesla has not been able to achieve a single driverless mile anywhere at all.\n\n>\tBecause they haven’t gotten through regulatory hurdles yet either.\n\nThey routinely conduct driverless journeys as a commercial robotaxi service in 4 large cities now. So why can’t Tesla do the same at the very least?\n\nYou said the gap between Tesla and Waymo was “non-existent” remember?", "score": 1, "replies": [{"body": "It is non existent. Regulatory approval and actual ability and safety are two entirely different things. But I'm gonna play your little game. You win and you're right. \n\nGo sell your shares of Tesla. Better yet, I suggest shorting the stock. You can invest in Waymo by purchasing shares of Alphabet. I'm not going to explain my thesis and why you're wrong, I'm tired of arguing with kids on Reddit.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": ">Tesla is proven in mass manufacturing\n\nAnd not ford, GM or Hyundai who happen to own Boston Dynamics? and makes 5x cars compared to Tesla", "score": 1, "replies": [{"body": "Well Ford and GM are struggling with the computers in their cars as is so I can't imagine them springing into action with a robot project.\n\nAnd yeah Boston Dynamics if they're owned by Hyundai could be a competitor, however I think one thing holding them back is their success, in that they used classical path planning AI to do those cool demos and they'll be loathe to throw all that out for a purely learned approach which I think might be the way forward.\n\nAnd yeah they could do something.\n\nI mostly mean that figure + openAI doesn't have mass manufacturing experience.", "score": 2, "replies": []}]}]}, {"body": ">  Once the bot 'works' it's unclear how many they can make and at what profit margin, and how many paying customers there will actually be\n\nA product is not a product if there is no clear indication of what and where it will be used for just like CT.", "score": 1, "replies": []}, {"body": "So you’re saying, Elon will only turn Tesla around if you give him 25% of the equity? Is that in addition to a $50+ billion payday and moving to a more Elon-friendly/investor-hostile jurisdiction? ", "score": 0, "replies": []}]}, {"body": "This is the best comment. 100% agree.", "score": 9, "replies": []}, {"body": "FSD is a pipe dream without major infrastructure changes, every car FSD, every car communicating with each other.  \n\nThere are way to many variables to account for right now, safe FSD is science fiction for the foreseeable future.", "score": 2, "replies": [{"body": "Word. I can barely stay on AP for a full ride because the roads aren’t built for it yet. Getting there, but still 5-10yrs for them to be AP ready, IMO.", "score": 1, "replies": []}]}, {"body": "\"Everything hanging on fsd and bot\" -- I could not disagree more. This kind of thinking, which I admit is the norm among the die-hard HODLers of TSLA, is why I'm the unhappiest I've ever been in the 12 years of HODL-style investing in TSLA. FSD is BS imho, always has been, and the bot has zero to do with the core mission of the company and everything to do with bored billionaire syndrome, imho.\n\nTesla made a huge mistake with the \"we dug our own grave with the Cybertruck\" Cybertruck: another $100K vehicle is not what the market needs, and a vehicle so weird, ugly, and off-putting to so much of the market (at a time that the part-time CEO of the company has completely gone off the deep end in his Xitter and political distractions) is not what the market or Tesla needs this year. They should be out with the nextgen cheap EV in 2024 and it's not going to be here. I see zero hope for Tesla to achieve 20MM cars in 2030. There's only one person to blame, and these days he's busy being a right-wing conspiracy nut on Xitter most of the time, and Tesla's wimpy board does nothing and sits on its hands while Robyn cashes in her stock. What an ugly year for TSLA so far.", "score": 2, "replies": []}, {"body": "😂", "score": 1, "replies": []}, {"body": "Adam Jonas (Morgan Stanley analyst and biggest Tesla bull) has just put out a note making Ford his top pick for the year and upgrading the sector to attractive.", "score": 1, "replies": []}, {"body": "Just curious, why do you think FSD has everything hanging on it? The cars don't need to drive themselves to be good cars.", "score": 1, "replies": [{"body": "So yeah it's really a question of margins.\n\nThe raw auto business is brutal with a lot of manufacturers (especially in china) producing cars for very low margins and there's not really room to make a lot of money there with so much competition.\n\nFSD is a super high margin software product, if they can get it working then every additional unit of it they sell is basically free as they only have to download it to the car.\n\nSo the base car might sell for $50k and be 10% profit which is like $5k, whereas a working robotaxi FSD would be worth $100-200k per car at 95% profit, which is much much more.\n\nEventually there would be competition in the FSD space which would drive down margins on the software, however Tesla has a massive data advantage and it's hard to see other companies catching up quickly.\n\nMy guess would be that if Tesla cracked FSD then it would take at least 5 years for a bit auto to retool and partner with a big tech firm to create a similar system and train up a comeptitor.", "score": 2, "replies": [{"body": "That doesn’t feel like their strategy at all to me. Even if FSD is near-perfect, it’s still not close to being good enough for a robo taxi. Not enough people are spending the $12k for FSD, and I’m not sure they would even if it worked better. The $200/mo. is a much better alternative to paying it all up front.\n\nThey’re turning a profit as it is, so anything else they can do is great, but I don’t really see FSD working being the gamechanger for them. Even if it worked flawlessly, the media would still shit on them for it and publish every little mishap, whether it was FSD’s fault or not.", "score": 1, "replies": [{"body": ">Even if it worked flawlessly, the media would still shit on them for it and publish every little mishap, whether it was FSD’s fault or not.\n\nI think the thing with the media is they like new stories. So sure the first few robo crashes have been covered a lot whereas once it's a normal technology which is everywhere then it'll just become boring, like normal road crashes where people don't don't make the news because they are common.\n\n>Even if FSD is near-perfect, it’s still not close to being good enough for a robo taxi.\n\nI mean yeah then it's not near perfect if it's not good enough for a robotaxi, by definition of \"self\" driving?\n\nI agree with you it might not be possible for 20 more years or something, and if that's the the case the stockprice isn't going to move much either.", "score": 2, "replies": [{"body": "You should ask Waymo how their PR is going with the relative few mishaps they’ve had", "score": 1, "replies": []}]}]}]}]}, {"body": "doing rough numbers of optimus bot potential, should make bears bulls, but most people refuse to think", "score": -1, "replies": []}]}, {"body": "The more they cry, the more I buy. I got time and my cost basis of over 2.5k shares is still below 100$.\n\nDon't FOMO in at the top next time...", "score": 23, "replies": [{"body": "The time to buy is when this sub is a ghost town.  As long as some people here are complaining and others are bragging about getting bargains, the bottom isn't in. \n\nWait until there are 2, 1, or even zero comments in the daily thread here.  That's the bottom. \n\nWorked for me on PLTR", "score": 19, "replies": [{"body": "Same here for r/NVDA_Stock.", "score": 2, "replies": []}]}, {"body": "True statement\n\nI remember Bitcoin being in the same situation", "score": 1, "replies": []}]}, {"body": "Just imagine where we’d be had Elon not completely destroyed the Tesla brand…so many unforced errors", "score": 49, "replies": [{"body": "Probably hovering around $250.", "score": 14, "replies": []}, {"body": "https://www.spglobal.com/mobility/en/research-analysis/sp-global-mobility-28th-annual-automotive-loyalty-awards.html\n\n> Tesla's popularity in the BEV sector helped the brand to success in both the loyalty and conquest space. For 2023, the Tesla brand scored repeat wins for 'Overall Loyalty to Make', 'Highest Conquest Percentage', \"Alternative Powertrain Loyalty to Make' and 'Ethnic Market Loyalty to Make.' The popularity of both the Model 3 and Model Y among current owners, along with the brand's ability to attract many ICE customers to the BEV space, contributed to Tesla's multiple awards for the second year in a row.\n> \n> **The S&P Global Mobility Loyalty Awards are the industry's only fact-based awards and reflect an analysis of 12.6 million new retail vehicle registrations in the US during the 2023 calendar year.** Loyalty is determined when a household that owns a new vehicle returns to market and acquires another new vehicle of the same make, model or manufacturer. \n\n...we'd be in the same place because they're still leading in brand loyalty?", "score": 2, "replies": [{"body": "It’s hilarious. I have no idea who the CEOs are for most products I buy and use but people are so fixated on Elon. I used to own VWs and Audis and a whole whack of people still working there were responsible for Dieselgate and intentionally poisoning hundreds of millions of people. But no, let’s hate on the guy writing things people don’t like on a website.", "score": 2, "replies": [{"body": "People don't like him because he actively works against the middle and lower class and union busts but keep pretending lol ", "score": 4, "replies": [{"body": "Sure, so again, he says things you don’t like. \n\nJust to be clear - you do campaign even more heavily against VW right? Literally and intentionally poisoned hundreds of millions of people, for profit. If not, I’m sure it will jump to top of your list. Would love to see the whole list of your ethical campaigns please.", "score": 2, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "Aaaand your brain cell count becomes painfully obvious….", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Username checks out. You clearly got a thing about cocks and Elon….  If you’re attracted to the guy maybe just come out?", "score": 0, "replies": [{"body": "Do you need a friend?", "score": 2, "replies": [{"body": "There you go again.", "score": 0, "replies": [{"body": "I can't help it, I find your clear lack of common sense and tact strangely alluring.", "score": 1, "replies": [{"body": "Why you getting all polite now? Sober? Bring back all the childish penis stuff and Elon envy. It’s funny.", "score": 1, "replies": [{"body": "Na, I just told you that you were an insufferable piece of shit in the nicest way possible. Go touch some grass.", "score": 1, "replies": [{"body": "There we go. Truth hits home.", "score": 1, "replies": [{"body": "At least you seem aware of your deficiencies.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "lol yeah he destroyed the brand. Which is why they still had a record year. And it’s his fault EVs aren’t succeeding from other OEMs. \n\nIt’s like people who blame Biden for the economy since he somehow controls worldwide inflation and oil prices.", "score": 1, "replies": []}, {"body": "Sell, this isn’t for you.", "score": -13, "replies": [{"body": "I have been, still have a little left. Started selling when my mom told me I couldn't even give her my Model X for free, she doesn't want to be seen in it.", "score": 12, "replies": [{"body": "Sell the rest.", "score": -7, "replies": [{"body": "Waiting for other realized gains to offset", "score": 7, "replies": []}]}, {"body": "[removed]", "score": -3, "replies": [{"body": "Her money is just as green as anyone else's though. She went from definitely  getting a Tesla after her Lexus lease was up, to not even wanting one for free, in a matter of 2 years thanks to Elon. She's not the only one.\n\nWhat about people on the right boycotting Budweiser? Do they have right wing derangement syndrome? People are allowed to vote with their dollars, and they do it all the time.", "score": 8, "replies": [{"body": "Not taking a perfectly great car that is worth close to $80k for free, built in America by American hands, paying hundreds of thousands of high wages jobs, made by one of the companies with the best environmental records out there just because \"Elon=bad\" is deranged.\n\nNot buying beer from a specific company is not the same.", "score": 1, "replies": [{"body": "Just goes to show how far he's damaged the brand. It's not like he's making up for that damage with more sales to people on the right. They aren't touching electric cars with a 10 foot pole anyway.", "score": 3, "replies": [{"body": "Or it shows how effective brain washing is. How has Elon impacted anything related to politics other than doing more for the environment than the next 499 companies in the fortune 500 list. I understand people are looking for shit to get triggered with but I rather root for the crazy, hard working, autistic guy that has put his money and effort behind building electric cars and rockets than some politician that talks a lot and does nothing.", "score": 1, "replies": [{"body": "Yea, he says the world needs to move away from fossil fuels, then fund raises for Vivek Ramaswamy and co-hosts Ron DeSantis's presidential campaign launch, both of whom say climate change is a hoax and a scam.\n\n[https://www.reuters.com/world/us/us-republican-presidential-candidate-ramaswamy-confirms-musk-attended-fundraiser-2023-10-28/](https://www.reuters.com/world/us/us-republican-presidential-candidate-ramaswamy-confirms-musk-attended-fundraiser-2023-10-28/)\n\nAlso my mom doesn't really care about any of that, as a child of holocaust survivors she was mainly offended by his association with known antisemites and some of the things he posted on twitter on that issue. She actually usually votes Republican except this cycle because she hates Trump. So he's managed to offend multiple groups in lots of different ways.", "score": 1, "replies": []}]}]}]}, {"body": "Whataboutism", "score": -3, "replies": []}]}]}]}]}]}, {"body": "I’d buy more TSLA if I wasn’t trying a CT", "score": 9, "replies": []}, {"body": "Sure glad I’m holding 200 shares at $247", "score": 3, "replies": []}, {"body": "October to November 2021, TSLA stock rose 55%.   \nNovember to December 2020 it gained 70%.   \nJanuary to February 2023 70%.  \nMay to June 2023 40%  \nThink about what Tesla as a company over the next 12 months that could trigger massive TSLA gains:  \n\\- \\~100k cumulative Cybertruck deliveries with higher than expected asp  \n\\- Shanghai Megapactory pumping out GWH worth of stationary batteries  \n\\- Model 3 re-qualifying for federal tax rebate  \n\\- Compact car announcement  \n\\- Giga mexico breaking ground  \n\\- FSD 12 going to wide release, possibly a big jump in FSD capability.  \n\\- Interest rate cuts  \n\\- 10's of thousands of used Model 3's and Y's hitting the market driving new and used ICE sales lower, Further slow death spiral of legacy auto. Jaguar seems to be going out of business as we speak.   \n\\- More Optimus developements  \nI'm not going to sit on the sidelines trying to time it.", "score": 18, "replies": [{"body": "This. When TSLA decides to break out, it comes out of nowhere and takes all bears by suprise.", "score": 12, "replies": []}, {"body": "bUt eLoN bAd", "score": -6, "replies": [{"body": "Yes he's not a good person. The company is a great company, but Elon has gone off to the political deep end and it has clearly impacted the company's reputation, and likely the stock price, sales from who don't like his attitude and hate/fear mongering over xitter", "score": 9, "replies": [{"body": "Was being sarcastic \n\nElon is a God and he will save us all", "score": -5, "replies": [{"body": "Touch grass", "score": 2, "replies": [{"body": "Username checks out", "score": -1, "replies": []}]}]}]}]}]}, {"body": "Disney's up 24.25% YTD\n\nSo anyone who sold Tesla and bought Disney at the start of the year would be 53% up YTD\n\nEDIT: I should have clarified: if someone had sold their Tesla stock at the start of the year and bought Disney, they'd be up 53% compared to not selling and still holding Tesla", "score": 15, "replies": [{"body": "and Disney is down 50% on three years ago. Timing the market is easy in hindsight.", "score": 28, "replies": [{"body": "Tesla is down more than 50% on three years ago", "score": 3, "replies": [{"body": "No it’s not. March 12, 2021 it was $196.63", "score": 11, "replies": [{"body": "My mistake. The all time high wasn't until $409 in November, 2021, so down 56%  on \\~2.5 years ago, not three years ago", "score": -1, "replies": [{"body": "What about 4 or 5 years ago?", "score": 0, "replies": [{"body": "If invested 5 years ago in NVDA, today it will be up 2100% while TSLA would only have been up 640%.", "score": 1, "replies": [{"body": "Or if you invested in tsla in 2019, sold in late 2021, put it all in NVDA, then you’d be up even more! We could do this all day lol", "score": 2, "replies": []}]}, {"body": "A lot lower, of course, so anyone who bought then has seen huge gains, but then they've seen a 56% fall in the value of their Tesla holdings since November 2021, with a 28% fall YTD\n\nHindsight is 20/20, but they should have sold some stock back in late 2021, like Elon and Kimbal Musk, to secure those gains\n\nHave you noticed any insiders buying back in at these bargain prices?\n\n[According to the records, it's all been sales](https://www.nasdaq.com/market-activity/stocks/tsla/insider-activity)\n\nThis suggests they don't see a lot of upside in the near future\n\nEDIT: to be specific, 399,062 shares sold by insiders in the last 12 months, and **zero** bought, with 147,053 of those in the last three months", "score": 0, "replies": [{"body": "Yeah that was my point. You can pick any time frame to suit whatever point you wanna prove. Would have been better to just ignore both Disney and Tesla and invest in NVDA 3 years ago ;)", "score": 2, "replies": [{"body": "Sure, but I chose Disney because of Musk's animus towards Iger, which makes it amusing", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "So much for go woke go broke.  Elon has destroyed more wealth with his politics than anyone in human history.", "score": 9, "replies": [{"body": "With regard to TSLA it's not so much the politics as the wild claims that were baked into that $409 price\n\nAnd to some extent I admire his commitment to turning Twitter into a full freeze peach platform like 4chan, giving free reign to the bots and hate posts and disdaining anything as vulgar as advertising dollars. But the real heroes are Twitter's lawyers, forcing Musk into vastly overpaying for a company that barely ever made a profit, and get paid $90 million for it", "score": 4, "replies": []}]}, {"body": "That’s not how math works, you would be up 24.25% YTD if you bought Disney and not -28% YTD down. That’s not the same as +53% YRD", "score": 6, "replies": [{"body": "Sorry, I should have clarified: if someone had sold their Tesla stock at the start of the year and bought Disney, they'd be up 53% compared to not selling and still holding Tesla", "score": 2, "replies": []}, {"body": "He works for Congress. Give him a break ok?", "score": 2, "replies": []}]}, {"body": "And 5 years back if people had invested in NVDA rather than TSLA, they would have been up 1700% compared to 650% in tesla", "score": 1, "replies": [{"body": "Yeah, hindsight is 20/20 - I just made the comparison for the LOLs because of Musk's \"fuck you\" to Bob Iger. A better pair for that would be Twitter vs Disney, but there's no longer public data on the former.\n\nTSLA is down another 3.72% so far today, so the LOLs keep coming\n\nStill, it's a huge bargain if 100% FSD comes online this year, early next - nothing but upside", "score": 1, "replies": []}]}, {"body": "GOI WOKE GO BROKE!!!!!!!", "score": -1, "replies": []}]}, {"body": "In the end, Twitter killed Tesla", "score": 4, "replies": [{"body": "Elon Musk*", "score": 3, "replies": []}]}, {"body": "And which it recover losses in a two week span", "score": 11, "replies": [{"body": "The stock would have to rise 40% to jump from $177 to $248", "score": 18, "replies": []}, {"body": "When was the last time the stock went up 40% in a 2 week span?", "score": 4, "replies": [{"body": "People has short term memory.  Try one week.  There are also at least 2 times in the last 3 years, it went up 30+ % in less than 2 weeks.\n\nhttps://money.cnn.com/2013/05/10/investing/tesla-stock/index.html", "score": 17, "replies": []}, {"body": "Last feb", "score": 14, "replies": [{"body": "Close - January 2023. This was because Tesla was in a record drawdown from the high and record levels of oversold after Elon had sold billions of stock over the previous 6 months", "score": 7, "replies": [{"body": "Close - it was because Elon had been dumping billions in $ just in case he needed more to close the twitter deal, then he dumped billions more after the twitter deal closed (i.e. it was a lie), and then he dumped billions more via his charitable foundation (which doesn't have a 3 day reporting rule).\n\nIt went up in January because he promised not to dump more for a year.\n\nNow 2023 is over and he could dump billions more next week.", "score": 1, "replies": [{"body": "He could dump more, but then he will take himself further from his goal of 25% voting share control", "score": 2, "replies": []}]}]}]}, {"body": "November 2023", "score": 4, "replies": [{"body": "> November 2023\n\nUm, no. It went up 20% in 2 weeks and 22% for the whole month of November.\n\nThe actual answer is January 2023, which was because Tesla was in a record drawdown from the high and record levels of oversold after Elon had sold billions of stock over the previous 6 months", "score": 5, "replies": []}]}, {"body": "Bruh", "score": 1, "replies": []}]}, {"body": "Two weeks or two years?", "score": 1, "replies": []}]}, {"body": "Cost basis of $18. Sold 1/4 @ $200. Will buy back at $100 or below, or not at all. We all know TSLA is going higher, but we don't have to be heroes or martyrs about it. Everything about Cybertruck was implying it was going to be a letdown in the short term, even if we didn't see it right away. Make your money when the opportunity comes.", "score": 2, "replies": [{"body": "I'm in a similar boat. Next time it bounces up to $200, I'm cashing out entirely. Will start looking at it again, around 150 and would certainly buy back in at 100.\n\nIdeal situation would be Musk quitting, resulting in Musk's fanbase dumps their shares, driving the price down in the short term. I would love to buy back in at that point.", "score": 7, "replies": [{"body": "Do you think it'll bounce up to $200 before next ER...? I'd like to hope for that, too, but I don't think it's going to happen.", "score": 1, "replies": [{"body": "I'm pretty confident there will be some bounces back up over the next 3-4 months. If it doesn't, I'll be holding awhile. I took some gains previously, way more than my initial investment, so I don't need to get out. Only going to do it if it makes sense.", "score": 1, "replies": []}]}, {"body": "I disagree with Musk quitting. If he left, I would probably exit more of my position tbh. I’m not a fanboy by any means, but it’s good to have someone in charge who is willing to take the big risks for the sake of a future they are trying to shape. That aside, I do agree with finding a plan you are comfortable with and sticking to it. I think long term $TSLA will do extremely well.", "score": 0, "replies": [{"body": ">  If he left, I would probably exit more of my position tbh. I’m not a fanboy by any means\n\nYou aren't alone, and as you say, you aren't even one of the fanboys. That's why I feel it would be a good opportunity. It would no doubt crash the stock short term, but the reality is that TSLA's been trading relatively sideways for 4 years. I don't see any huge % gain that is going to have this stock rocket up again like we got during Covid, but it can be a solid long term value, from certain entry points. I don't think 175-225 is a very good entry point, but sub 100 is.", "score": 1, "replies": [{"body": "For sure. Sub $100 is a fantastic entry simply for the AI and FSD potential alone. When the money printer gets turned back on, it’s all going up anyway.", "score": 1, "replies": []}]}]}, {"body": "Bye! Timing the market... Something something... Time in the market.", "score": -2, "replies": [{"body": "I got a 10x in my investment and still have 75% of my stack left that I can ride free into the future. It’s okay to time and exit. People don’t have to stay in 100% forever. It can go to $5 and I’ll be fine. It can go to $500 and I’ll be set. Either way I’m covered. Don’t shame people for feeling they need an exit.", "score": 3, "replies": []}, {"body": "I have had time in the market.  I'm perfectly happy with my investment if I get out of TSLA at 200 and will only get back in, if it goes sub 150 after that. \n\nTime in the market is great, but you should also look at taking profits along the way, diversifying and getting out of investments that aren't working.", "score": 2, "replies": []}, {"body": "My cost basis is $50ish and I do not want to pay capital gains. I would have to pick a company that goes up at least 20% before Tesla goes up any percent. No thank you I'll stay put", "score": 1, "replies": []}]}]}, {"body": "Cybertruck actually does not concern me at all.  \n\nPeople who have taken delivery of their Cybertrucks are overwhelmingly happy with the vehicle.  The production ramp appears to be far less problematic than the previous introduction of a new platform in 2017, in terms of production volume and quality.", "score": 0, "replies": [{"body": "I’m not worried about Cybertruck either. I think it will do great. I just felt like it was a let down in the sense that all the things promised were missed. The range is bad. The price is totally fair, but still far from what was promised. The interior is bland for a vehicle that expensive (I love it in M3/Y though). Just feels like it needs a year and some revisions to really make it what it could be then. That’s when I’ll grab one. Still have my Day 1 reservation. 👍", "score": 0, "replies": []}]}]}, {"body": "When will they become like tucker.", "score": 2, "replies": []}, {"body": "😩", "score": 2, "replies": []}, {"body": "Careful, people get triggered when you point out inconvenient truths. And I will add that there are many companies that are negatively impacted by interest rates but they don’t have a part time ceo.", "score": 7, "replies": []}, {"body": "sure would be a perfect justification to fire a ceo", "score": 13, "replies": [{"body": "You would have to be a short term thinking fool to want something like this.\n\nI’m up nearly 500% on my shares (over 1000% on most of them) and I will be up 5000% on them by the end of the decade all thanks to Elon.\n\nIf you suck at timing the market, don’t blame Elon.", "score": 2, "replies": [{"body": "Elon has nothing to do with Tesla this past half decade. He’s done nothing to help.", "score": -5, "replies": [{"body": "That's not entirely true.  Past 5 years would be back to early 2019.  Musk was still engaged back then.  \n\nFrom my reading of the Walter Isaacson biography of Musk, Mr. Musk was focused on Tesla until the beginning of 2022.  Remember that Musk campaigned very heavily for factory re-openings during the pandemic, and also focused on the Model Y ramp at a time when chip shortages were wrecking the auto industry.  \n\n2022 and Twitter was when all that changed.  By the end of 2022, Isaacson wrote that Musk was so checked out of Tesla, that Musk's brother, Kimbal Musk (who is a member of Tesla's board of directors) asked Elon to consider stepping down as CEO of Tesla.  This is on page 586 of Isaacson's biography of Musk.", "score": 2, "replies": []}, {"body": "Elon hurt your bum bad I see, much butthurt you seem about it, terrible to invest with emotions, often wrong you are!", "score": 1, "replies": []}, {"body": "So I guess any fool would have brought TSLA to 2, 3 trillion or even higher?", "score": 1, "replies": [{"body": "he’s actively the reason why it’s not at 1T anymore. \n\nYa he used to be great for it back in the earlier days during ramp up. When he was a real engineer that was driven and focused. \n\nNow he’s shitposting on a toxic platform 24/7, doesn’t care about anything Tesla wise besides his massive pay package that he’s fighting for instead of fighting for other important things like improving Tesla. He’s got multiple other companies he’s trying to manage on top of ignoring his 10 children he fathered.\n\nHe is objectively bad for Tesla today because he’s not helping", "score": 8, "replies": [{"body": ">  Now he’s shitposting on a toxic platform 24/7, doesn’t care about anything Tesla wise besides his massive pay package that he’s fighting for instead of fighting for other important things like improving Tesla\n\nIt's insane. The man keeps positing all night long about politics. I think he deeply believes his mission now  is being an internet social warrior.", "score": 1, "replies": []}]}]}, {"body": "Investors on this sub were not that clueless even back at the lows in 2019. 🤦🏼‍♂️", "score": 0, "replies": [{"body": "Tell Me one thing elon has done for Tesla in the last few years.", "score": 7, "replies": [{"body": "WTF are you even asking, every pivot has to be approved by Elon you fool. \nPush for bot to keep the AI team invested. \nMade the final decision to move to end to end approach to FSD, made the final decision to pull the 25k vehicle Forward. \nMe the decision to build in Mexico", "score": -1, "replies": []}]}]}]}]}, {"body": "Sounds like a fickle and shortsighted way to run a business.", "score": -1, "replies": [{"body": "Firing would be too much but some punishment should be in order", "score": 2, "replies": []}]}]}, {"body": "I sold 500 shares last week and moved it to NVDA yesterday. Up 4k in a day. I still believe  in TSLA Long term and have 200 shares now but I just don’t think it’s going to move much 160~225 in the next four months.  So if you are looking for short term gains this isn’t it, this is the long game.", "score": 4, "replies": [{"body": "I sold 20 shares of NVDA and bought more TSLA.\n\nSome people really just FOMO everything", "score": -2, "replies": []}]}, {"body": "It's worse than worst.", "score": 4, "replies": []}, {"body": "I'm sure having a fascist manchild in charge has helped the stocks performance.", "score": 2, "replies": []}, {"body": "Wait- you mean when the face of the company joins a klan of white supremacist insurrectionists it’s bad for the company?  How could anyone have predicted this?", "score": 3, "replies": []}, {"body": "Worst ceo too", "score": 4, "replies": [{"body": "🤦🏼‍♂️", "score": 2, "replies": [{"body": "There were years where he probably deserved best ceo but for two years straight now the guy is an absolute turd muncher. ", "score": 4, "replies": [{"body": "Did you even take a look at what the company is doing? \n\nI can’t believe comments like that, you’re so unappreciative of everything Tesla is accomplishing.", "score": -2, "replies": []}]}]}]}, {"body": "Are Tesla puts priced in for earnings?", "score": 1, "replies": []}, {"body": "Boeing has overtaken them since you've posted this!", "score": 1, "replies": [{"body": "WOOHOO! LFG", "score": 2, "replies": []}, {"body": "…And it’s back to being the worst", "score": 2, "replies": [{"body": "Lmao!", "score": 2, "replies": []}]}]}, {"body": "And what do we expect.", "score": 1, "replies": []}, {"body": "Good time to buy some calls", "score": 1, "replies": []}, {"body": "ElMu loves superlatives", "score": 1, "replies": []}, {"body": "Be greedy when everyone else is fearful.", "score": 1, "replies": []}, {"body": "It was like 153 a year ago then by end of June like 275 it’s crazy ride 👍🏼", "score": 1, "replies": []}, {"body": "My calls expire next week so expect the moon in 2 weeks", "score": 1, "replies": []}, {"body": "I have most of my money in Tesla and Boeing, sadge", "score": 1, "replies": []}, {"body": "Burn baby burn.", "score": 1, "replies": []}, {"body": "But I heard “go woke go broke” lmao", "score": 1, "replies": []}, {"body": "If you short it, it is quite performing.", "score": 1, "replies": []}, {"body": "Ya, Kathy Woods just bought millions. I bought 10.", "score": 1, "replies": []}, {"body": "Nice", "score": 1, "replies": [{"body": "Time to mooon 🙂😀😃😄🫠🙃😶😭😭", "score": -2, "replies": [{"body": "As someone who bought Tesla in 2018, I was born in a cacophony of bearish comments and I love the noise.\n\nThank to this dip I have more shares than ever.\n\nPeople complaining don’t have a good exit strategy on $TSLA. It has never been a stock someone should sell before some key master plan(s) factors play out, therefore short-term movements are irrelevant unless you use them to your advantage.", "score": 3, "replies": [{"body": "Love it 💪", "score": -2, "replies": []}]}]}]}, {"body": "The spark has gone out of the EV market and Tesla has almost complete exposure to it. They need to release a revolutionary car which puts to bed all of the practical issues of EV motoring and fast.", "score": 1, "replies": []}, {"body": "There isn’t anything on the horizon stopping the slow drop, he was too slow on AI to get a bump there.  Short of him suddenly showing us all a secret AI lab, Tesla stock is going down towards every other auto stock.", "score": -1, "replies": []}, {"body": "More stock for me then! Love the dip!", "score": 1, "replies": []}, {"body": "Part time CEO is priced in.", "score": 1, "replies": []}, {"body": "I'm pretty happy with their vision of car manufacturing, self driving and robotics. If nothing else I support them in their journey. I'm happy to support a  company that innovates significant change.\n\nAn future with humanoid robots, self driving cars and electric vehicles is indeed one I'm looking forward to. I like the transparency they provide with their yearly updates. vs say Apple saying they are working on a car and just show nothing and then abandon it.  \n\n\nYes their timelines are terrible but technological breakthroughs are important.", "score": 1, "replies": []}, {"body": "That’s okay. We knew there’s headwinds and at the end of the day, it is a premium product. As long as R&D remains strong, and they keep their eye on new tech, I am fine adding the dips. This slump is truly a good opportunity to bolster your portfolio if you believe in the company.", "score": 1, "replies": []}, {"body": "All stocks go up and down in cycles. Tesla will go up when al the others come down.\n\nWhy is Tesla doing poorly? Tesla gives no guidance and it is a bad macro environment for auto makers. \n\nTesla has slowed down Giga Mexico, but Tesla has only increased investing into growth. This hurts profits in the short term, this is why we hear a lot of news of legacy auto pulling back investments into EVs, so that in the short term, profits will be higher so their CEOs can get their bonus. \n\nThings I am watching for 2024. \n\n1. Energy growth. Tesla will report Megapack production/revenue this quarter. Analysts have started to talk about megapack over the last 2 weeks and they are unable to price the growth in until Tesla report the numbers. (Energy is what pushes Tesla up this year)\n2. FSD beta is rumored to expand to China this summer and possible in Q4 in EU. (more likely Q1 2025). This opens up millions of Tesla owners to buy FSD and help margins.\n3. Finish FSD in USA. (may not happen this year, but is possible)\n4. Interest rates come down, dollar strength falls which increases international margins\n5. Continued Optimus updates. Though I don't expect it to move the stock unless we get details on pricing or timeline of production. \n\nQ1-Q2 will be the bottom.", "score": 1, "replies": [{"body": "> All stocks go up and down in cycles. Tesla will go up when all the others come down.\n\nWhat? This is an insane statement.", "score": 7, "replies": []}, {"body": "For people praying for a 10x gain in TSLA (of which I see many in this sub), AI/FSD is the only thing that matters.  \n\nMy calculations for Tesla delivering 20+ million vehicles/year @ ASP of 35k and operating margin of 10%, plus an equal $ value of energy products, only support a valuation of 1.75 Trillion by the early 2030s.  \n\nIf FSD doesn't happen, folks here will have waited 8-10 years for a 2-bagger, and likely wasted the opportunity for much better growth elsewhere, like PLTR.  People need to be realistic about the risks, which from my observation they clearly are not", "score": 0, "replies": [{"body": "20 million isn’t going to happen unless they solve FSD or sell $15k cars worldwide. So your ASP is too high. Also the market for energy products is not as big as auto.", "score": 3, "replies": []}]}]}, {"body": "I am going to buy calls on TSDD and roll over my current ones out.  Tesla going to be sub $100 by year end.", "score": 0, "replies": [{"body": "I've been buying puts 2-6 months out since last summer. A few misses in there but lots of 3-5X gains too. Basically any time this sub says to buy the dip and that it's a good price to buy, I get more puts.\n\nLatest play is $140 and $120 puts for Sept and Oct. Up on them quite a bit already.", "score": -2, "replies": []}]}, {"body": "That’s why I am slowly buying on down days while it’s below 180. A few shares a day", "score": 0, "replies": []}, {"body": "Long term.", "score": 0, "replies": []}, {"body": "Lol I sold a log time ago. So glad I saw though the permabulls on YouTube. I’ll get back in around 100", "score": 0, "replies": []}, {"body": "My friend was an early investor in TSLA. Been a millionaire for a minute so naturally I ask him his opinion. Again, just an opinion, do your own DD, but he repeats what he has always said. Buy and stop looking at the daily’s", "score": 0, "replies": []}, {"body": "That's what you get for putting your faith in a junkie", "score": 0, "replies": []}, {"body": "TSLQ aka RealTesla has infested this page. A real shame. We have bottomed and are going flat in a way we haven't since around April 2022. Anyone who sells stock right now is an absolute moron. Most the profiles jacking eachother off right now are from RealTesla or are obvious fake accounts.", "score": -1, "replies": []}, {"body": "Usually a buy signal. I know I loaded the boat at 179. Haven’t bought in almost 3 years.", "score": -1, "replies": []}, {"body": "When they come out with a next gen vehicle that’s less than $20k sticker and still turns a profit, no car company will be able to compete with that. I’m up 300% on Tesla after this drop and buying more here while sentiment is low", "score": -1, "replies": []}, {"body": "And TSLA is the stock I put most of my Roth IRA into. Funny how God smiles down upon us sometimes. He works in mysterious ways. \n\nIf I had made money I might be dead facedown in a ditch ODd on tits and cocaine. \n\nBut here we are.", "score": -1, "replies": []}, {"body": "Yep and it won't change as long as I'm a Tesla investor. I will sell all my Tesla if I receive a total of 10 million USD from other investors, and then perhaps the good times will return to Tesla once I've sold :)", "score": 0, "replies": []}, {"body": "If you are buying Tesla for reliable YOY %  increase, you're in the wrong stock. This is a rollercoaster ride without seatbelts. Also, watching the car business is the wrong place to expect improvement in the stock. JPOW and his rates dictate that for now. FSD is the holy grail that will unlock the next step up in value and allow for Teslabot to live to it's potential. Look forward.", "score": 0, "replies": [{"body": "''Rollercoaster ride without the seatbelts''... So true and funny 🤣", "score": 2, "replies": []}]}, {"body": "That’s what they want us to think", "score": 0, "replies": []}, {"body": "This has been my best stock in 2024, my puts just keep paying, I have a feeling the rest of you are doing it wrong.", "score": 0, "replies": []}, {"body": "Have fun staying poor bros. Tesla was one of my first investments back in college (2016) held it thru the best and the worst and am so glad I sold this Feb", "score": 0, "replies": []}, {"body": "It’s almost like without Elon hyping fake or exaggerated products every year it’s getting valued like any other company with slowing growth and profit margins.", "score": 0, "replies": []}, {"body": "No wonder guys, Have you seen the earnings and heavy decrease in growth? TSLA is a 50 dollar stock at best.", "score": 0, "replies": []}, {"body": "Y’all buying Tesla instead of rivian . When u buy a company u buy the ceo . I love rj hate elon", "score": 0, "replies": []}, {"body": "Currently up 843% in the last five years at the time of me posting this.\n\n“Oh no, I see red in my account since last year.” Go ahead and sell. I’ll continue buying the dips.\n\nRemindMe! 5 years\n\nCurrent stock price - 178.18", "score": -2, "replies": [{"body": "Stock has gone nowhere for >3 years. All major gains from the current valuation rely heavily on FSD/Optimus because the car business got decimated by price cuts. The energy business will eventually see that too in order to achieve growth targets.", "score": 3, "replies": []}, {"body": "I will be messaging you in 5 years on [**2029-03-12 15:38:02 UTC**](http://www.wolframalpha.com/input/?i=2029-03-12%2015:38:02%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/teslainvestorsclub/comments/1bcw3an/tesla_is_the_worst_performing_stock_in_the_sp_500/kuj8yfz/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fteslainvestorsclub%2Fcomments%2F1bcw3an%2Ftesla_is_the_worst_performing_stock_in_the_sp_500%2Fkuj8yfz%2F%5D%0A%0ARemindMe%21%202029-03-12%2015%3A38%3A02%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201bcw3an)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Demand is dead. Cars are built like shit. Govt mandates are relaxing for pure evs. \n\nFuture is hybrid in America. \n\nTesla can't compete in China. \n\nDon't bag hold.\n\nShorts are printing", "score": -3, "replies": []}, {"body": "Then it’s a buy.", "score": -1, "replies": []}, {"body": "I dumped my Tesla positions several months ago and went all in on NVDA. No regrets.", "score": -1, "replies": []}, {"body": "Is it really a surprise, considering that (1) the CEO spending his day on jerking off on his own social media that he put billions and (2) the efforts put in productionizing unsellable truck?", "score": -1, "replies": []}, {"body": "its being passed \"technologically\" by everyone else. Ps. im not talking about vehicles thats already priced in, but in ai. Tesla still doesn't have a single ai product that makes them money. Meanwhile NVDA has 70% gross margins. MSFT essentially owns openai which is working with other start ups like figure ai (which has a much better robot than tesla, as far as we know now).\n\nps. last of all Elon is extremely distracted and seems to be more focused on getting shares and suing competitors.", "score": -1, "replies": []}, {"body": "Absolute hit job", "score": -9, "replies": [{"body": "This \"us vs them\" victim complex cringe is the most insufferable part of the Tesla fanclub.", "score": 3, "replies": []}]}]}
{"title": "$TSLA Daily Thread - March 12, 2024", "selftext": " Fun chat. No comments constitute financial or investment advice. 🌮", "id": "1bclga9", "created_utc": 1710208812.0, "score": 28, "upvote_ratio": 0.97, "num_comments": 454, "comments": [{"body": "Lmao guys, I didn't own a penny in TSLA stock in February 2021. All options. Was worth $4 million (peaked at 8 million). Now I have $700k left.\n\nNo Cybertruck for me...", "score": 31, "replies": [{"body": "But u saved humanity, thank you.", "score": 15, "replies": []}, {"body": "In all seriousness, I appreciate you sharing this. It helps some of us inexperienced investors see the other side of options. Other people just delete their account and never give an update. ( anono )", "score": 8, "replies": []}, {"body": "This is an investing sub? I am here for the frens.", "score": 7, "replies": []}, {"body": "Got damn. I can't imagine peaking at 8 then watching it drop to 7 then to 6, then to 5, then 4, and not thinking maybe it's time to sell", "score": 7, "replies": [{"body": "All the simps told us everything was going to be fine though 😢", "score": 13, "replies": []}, {"body": "That’s the downside of an echo chamber and downvoting opinions that people don’t agree with. Everyone kept saying buy the dip, it’s going to bounce back.", "score": 7, "replies": []}, {"body": "Faith.  \n\nAnyone who says its a virtue needs their head examined.", "score": 7, "replies": [{"body": "People acting like FSD is already in the bag:\n\n[https://www.reddit.com/r/teslainvestorsclub/comments/1bcw3an/comment/kuiplql/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/teslainvestorsclub/comments/1bcw3an/comment/kuiplql/?utm_source=share&utm_medium=web2x&context=3)\n\n>I’m up nearly 500% on my shares (over 1000% on most of them) and I will be up 5000% on them by the end of the decade all thanks to Elon.\n\n&#x200B;\n\nI see a lot of similar stuff from people at TMC.  I don't know if many of the newer TMC members genuinely believe what they write, or if their increasingly absurd levels of bravado (and conspiracy theory thinking) is a cover for their fear that they might be wrong this time.", "score": 2, "replies": [{"body": "On a scale from sure thing to a lottery ticket we have definitely been moving in the wrong direction.", "score": 1, "replies": []}]}]}]}]}, {"body": "Pro athlete on his rookie contract of $27 million DMd me asking how much for my Cybertruck… fuck lmao\n\nEdit: He has one on order but knows he’s gonna be waiting for a while. Maybe I’ll see if he wants to rent it off Turo for months at a time.", "score": 14, "replies": [{"body": "1 mil", "score": 6, "replies": []}, {"body": "Tell Tyree Wilson to wait his turn", "score": 2, "replies": []}, {"body": "Send him your referral for a model X instead", "score": 2, "replies": []}]}, {"body": "im still banking on some kind of scrooge situation where various ghosts visit elon and then he wakes up and is cool again", "score": 13, "replies": [{"body": "![gif](giphy|xUOxeUa5Kh7ao6VqJq)\n\nThe Ghosts of Andrew Carnegie, Hearst, and Howard Hughes visit him over night... and he awakens a changed man!", "score": 5, "replies": []}, {"body": "Most entertaining outcome is the most likely or something", "score": 5, "replies": []}, {"body": "ghost of transexual past will get through", "score": 3, "replies": []}, {"body": "That would be awesome!", "score": 5, "replies": []}]}, {"body": "Did we talk already about the Boeing Whistleblower being found dead in apparent suicide?\n\n![gif](giphy|ANbD1CCdA3iI8)", "score": 14, "replies": [{"body": "(≖_≖ )", "score": 5, "replies": []}, {"body": "![gif](giphy|3gNotAoIRZsb9UHPnj)", "score": 3, "replies": []}, {"body": "Obviously it's smart to keep your mouth shut.", "score": 3, "replies": []}, {"body": " Clinton’d", "score": 4, "replies": [{"body": "I mean, I knew this trend was running rampant in Russia right now, but here too?", "score": 4, "replies": [{"body": "You think this is a recent thing? Epstein a joke to you?", "score": 2, "replies": [{"body": "![gif](giphy|kqJt1cSSN0DrwwMmY5|downsized)", "score": 1, "replies": []}]}]}]}]}, {"body": "Rohan with another W https://x.com/rohanspatel/status/1767618866341929340?s=46&t=WyhsS8WzmgKtgEuHZzFOrA", "score": 12, "replies": [{"body": "White CEO discriminating against himself by not tweeting.", "score": 5, "replies": [{"body": "The greatest threat to society is the trans illegal immigrant", "score": 6, "replies": []}]}]}, {"body": "Wow my wife sold her a good chuck of her Coinbase (100 shares) at 270 yesterday!", "score": 12, "replies": [{"body": "pleas ask her about her next move and share with the club", "score": 7, "replies": [{"body": "She still has 400 in her Roth so not like she was perfect", "score": 6, "replies": [{"body": "what shes gonna do with the money now is the question, btc bounces back up soon and coin goes with it\n\naka every trade is both good and bad depending on various factors", "score": 3, "replies": []}]}]}]}, {"body": "How many years do we have our lives controlled by fucking sandwich prices", "score": 11, "replies": [{"body": "I bought egg mcmuffins and hash browns for my team last week. Close to 40 bucks to feed 4 🤡", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "She does more than I expected given what they said in the biography", "score": 8, "replies": [{"body": "That's really the best glimpse we've had, cause otherwise all we hear is her shaky year in review speech at the annual meeting", "score": 3, "replies": []}]}, {"body": "hold elon in check 🤭", "score": 7, "replies": []}, {"body": ">What does this lady even do?\n\neverything Elon tells her to.", "score": 5, "replies": []}, {"body": ">What does this lady even do?\n\nWhenever I hear Robyn Denholm's name I think \"Reynholm's dead.\"\n\n\"I had to go up the mother fudging stairs because the lifts are broken again.\"\n\n\"Oh yes.  And Reynholm's dead.\"", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Guy paying. 50k+ for Mach e … “not interested “ in model Y \n\nhttps://www.reddit.com/r/MustangMachE/s/JSnLDHnEmn", "score": 11, "replies": [{"body": "Ridiculous situations like that are indicators of brand damage. \n\nThat's money that Tesla could be getting, which is instead going to Ford and a Ford dealership for a subpar product.    \n\nThere are people on Reddit and TMC who stubbornly refuse to acknowledge the reality that a car purchase is more than $ and cents.  Consumers will often make bad product purchase decisions for emotional reasons, including Elon being a dipshit on Twitter.  Tesla's leadership, especially Elon Musk, should not be giving potential customers extra reason to avoid Tesla products.", "score": 11, "replies": [{"body": "Two biggest reasons for margin dropping more than it should have, brand damage by the CEO and the CEO blocking real advertising campaigns leaving a lot of people uninformed and believing FUD lies.\n\nBoth are on Elon.\n\nBiggest reasons for stock slump:\n\n1. The CEO selling billions worth of stock.\n2. CEO creating uncertainty by (1) and losing a lawsuit because he refused to do DD, brand damage by extremely political, public outbursts and basically threatening to hurt FSD and optimus if he doesn't get more shares, proving the CEO and biggest shareholder is unhinged and not afraid to dump TSLA on a whim. All while proving he doesn't give a shit about TSLA or his fiduciary duties.\n3. The margins dropping, as stated above, because of the CEO.\n4. Last reason, no more growth to be seen for years, who would have sandbagged giga Mexico? Listen to earnings calls from 2023 and it's clear who was holding things back, refusing to expand.\n\nIn 2022 they promised at least two new giga's announced, then Musk is all doom and gloom for a full year and giga Mexico isn't even worked on, while stating they'll do advertising, but a year later, what have they really done?\n\nI'm convinced Tesla would be better of without Musk from now on, how is he helping? They had to convince him to let them make the next gen vehicle with a steering wheel... HOW INSANE IS THAT?", "score": 6, "replies": []}, {"body": "I agree.", "score": 3, "replies": []}, {"body": "🎯", "score": 3, "replies": []}, {"body": "oh no, not drain bamage!!!", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Full regard", "score": 3, "replies": []}]}, {"body": "What a fucking retard", "score": 6, "replies": [{"body": "Feel free to drop in and tell him", "score": 7, "replies": []}]}, {"body": "Is he white tho?", "score": 5, "replies": [{"body": "What about the border", "score": 2, "replies": []}]}]}, {"body": "What comes first, Robotaxi or Elon pissing in bottles?", "score": 8, "replies": [{"body": "I'm not taking that bet.", "score": 7, "replies": []}]}, {"body": "Just sold all my Google. Sorry sack! \n\nHave plenty of exposure in my index funds. Will buy again if it goes back to 133 or lower. Also don’t have enough cash to snag 100 shares so no real point", "score": 8, "replies": [{"body": "😮\n\nHaha makes sense!", "score": 2, "replies": [{"body": "Yea if tesla shoots up ever (lol wishful thinking) I’ll probably sell 50 shares for 100 of goggle then to diversify then. Sitting on 3k shares of Tesla is shit in this market", "score": 4, "replies": []}]}, {"body": "oh wow! i hope you made at least 1,000% on your chairs. and just remember, uncle sam is waiting for his share.", "score": 1, "replies": [{"body": "lol I bought it like a week ago. \n\nAnd you’re out of touch with reality. Not everyone has 30 stocks they bought decades ago with 1000% gains. And 100k to throw into Rivian …", "score": 2, "replies": [{"body": "I don't think I'm out of touch with reality too much. I share what I do as I know the whales of this sub are doing similar. I'm here to compare notes - I'm always learning!", "score": 1, "replies": []}]}]}]}, {"body": "one of those days where we start deep red and go green and all the people that got upset act like recently adopted strays, slowly developing trust and venturing to the food bowl", "score": 8, "replies": [{"body": "Please adopt me", "score": 5, "replies": [{"body": "ok :)", "score": 4, "replies": [{"body": "❤️ Wuff", "score": 3, "replies": []}]}]}, {"body": "TSLA still tastes terrible", "score": 3, "replies": [{"body": "Tastes like musk shitting directly into all of our collective mouths.", "score": 3, "replies": []}, {"body": "shhh it’s ok, it’s ok little guy\n\n![gif](giphy|fqst7AVqF6AVLlYklE|downsized)", "score": 4, "replies": [{"body": "damn thats a cute puppy", "score": 5, "replies": []}]}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Was there cybertruck in centre as well?", "score": 4, "replies": []}]}, {"body": " .　　　　　　　　　　 ✦ 　　　　   　 　　　˚　　　　　　　　　　　　　　*　　　　　　   　　　　　　　　　　　　　　　.　　　　　　　　　　　　　　. 　　 　　　　　　　 ✦ 　　　　　　　　　　 　 ‍ ‍ ‍ ‍ 　　　　 　　　　　　　　　　　　,　　   　 .　　　　　　　　　　　　　.　　　ﾟ　  　　　.　　　　　　　　　　　　　. 　　　　　　　　　　　　.　　　　　　    　　　　 　　 🌑　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　    　      　　　　　　　        　　　　　　　　　　　　　. 　　 　　　　　　.　　　　　　　　　　　　　. 　　　　　　　　　　　　　　　　       　   　　　　 　　　　　　　　　　　　　　　　       　   　　　　　　　　　　　　　　　　       　    ✦ 　   　　　,　　　　　　　　TSLA,　　　    🚀 　　　　 　　,　　　 ‍ ‍ ‍ ‍ 　 　　　　　　　　　　　　.　　　　　 　　 　　　.　　　　　　　　　　　　　 　           　　　　　　　　　　　　　　　　　　　˚　　　 　   　　　　,　　　　　　　　　　　       　    　　　　　　　　　　　　　　　　.　　　  　　    　　　　　 　　　　　.　　　　　　　　　　　　　.　　　　　　　　　　　　　　　* 　　   　　　　　 ✦ 　　　　　　　         　        　　　　 　　 　　　　　　　 　　　　　.　　　　　　　　　　　　　　　　　　.　　　　　    　　. 　 　　　　　.　　　 　🌎　　   　　　　　.　　　　　　　　　　　.　　　　　　　　　　   　 　˚　　　　　　　　　　　　　　　　　　　　　ﾟ　　　　　.　　　　　　　　　　　　　　　. 　　 　 ‍ ‍ ‍ ‍ ‍ ‍ ‍ ‍ ‍ ‍ ,　 　　　　　　　　　　　　　　* .　　　　　 　　　　　　　　　　　　　　.　　　　　　　　　　 ✦ 　　　　   　 ", "score": 9, "replies": [{"body": "![gif](giphy|3oFzm5hPFYgljhXyyA|downsized)", "score": 4, "replies": [{"body": "🤜🏻💥🤛🏻 ", "score": 2, "replies": []}]}]}, {"body": "The stocks w cancer ba tsla", "score": 8, "replies": [{"body": "yup, give me a chance to unload at 300 again.", "score": 4, "replies": []}]}, {"body": "&#x200B;\n\nhttps://preview.redd.it/oodgcmgw7xnc1.png?width=1200&format=png&auto=webp&s=a572703a428151e6e376a4b941a16838e5ab9d86\n\nIn 2 days\n\n[https://twitter.com/johnkrausphotos/status/1767564595994988949](https://twitter.com/johnkrausphotos/status/1767564595994988949)", "score": 8, "replies": [{"body": "Pic goes hard", "score": 3, "replies": []}, {"body": "Is the date fixed?", "score": 2, "replies": [{"body": "Planned launch is Thursday, 14 March with backup dates (15, 16, 17 & 18 March)\n\nhttps://x.com/SpaceX/status/1765437449717841991?s=20", "score": 4, "replies": [{"body": "Awesome", "score": 2, "replies": []}]}]}]}, {"body": "How can this stock be so bad?  Let me count the ways.\n\nI'm actually thinking about re-un-diversifying and buying more.  Talk me out of it.\n\nThe stock is the same value it was in late 2020.", "score": 8, "replies": [{"body": "Green", "score": 5, "replies": []}, {"body": "Not bad cuz ceo wasn't nearly this retarded in 2020.", "score": 8, "replies": [{"body": "Do we think he’d be less retarded with a new comp plan? Will a new plan even be approved with the recent performance?", "score": 5, "replies": [{"body": "No, Elon not financially motivated. Politically motivated now.", "score": 7, "replies": [{"body": "Do you think he’s under the gun to show progress with FSD and Optimus or will he be able to get a new plan approved regardless? I guess that probably depends on the plan but sentiment is extremely low", "score": 3, "replies": [{"body": "He's not under the gun for anything", "score": 4, "replies": [{"body": "That’s the concern then. Not operating with any urgency and is making life way harder for the missions", "score": 3, "replies": [{"body": "Yup", "score": 2, "replies": []}, {"body": ">Not operating with any urgency and is making life way harder for the missions\n\nYep.  I remember the whole \"sleeping at the factory\" thing and initial optimus enthusiasm, but didn't think this would be push-forward for the next 4 years.\n\nWhile Highland looks great (just saw one) the refresh and innovation needs to continue.", "score": 2, "replies": [{"body": "Cybertruck looks awesome too but with all the new tech it’s going to took time to get to market and will take time to scale and impact the business. \n\nMy key as an investor is figuring out their AI monetization strategy and timelines. They’re investing tons of money and resources into these projects. V12 looks awesome and Optimus looks to be progressing well. We need to see take rates improve with V12 and an actual effort put into educating and building awareness on why people should subscribe and why people should buy Teslas because of the AI (there’s no reason this can’t drive demand significantly if they get aggressive)", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "2020 was a bubble", "score": 4, "replies": []}]}, {"body": "QQQ is gonna hit $500 this year, and we will go up a buck to firmly hold $180, I can see it now.\n\n![gif](giphy|l49FvM5VWIPnyiyVW)", "score": 7, "replies": []}, {"body": "Whats your '24 eps prediction?", "score": 8, "replies": [{"body": "![gif](giphy|piJDvfPb8SwZ4hwsPp)", "score": 6, "replies": []}, {"body": "Not good. Hopefully, will become less relevant the more progress is made on NGV and FSD/Optimus. Investors want to see how Tesla will monetize AI investments and a big part of that is FSD and take rates. Will they get aggressive with awareness and can they drive up take rates", "score": 4, "replies": []}, {"body": "Bad due to brand damage and retard level price cuts", "score": 5, "replies": []}, {"body": "![gif](giphy|l3q2wnlw48fuf1l3a)", "score": 5, "replies": []}, {"body": "Lisan al-Gaib will save us", "score": 3, "replies": []}]}, {"body": "https://twitter.com/elonmusk/status/1767708736414507314?t=LFuqcYvNuUlzk_hzKyUrMQ&s=19\n\nHehe yep", "score": 9, "replies": [{"body": "this is not well known", "score": 5, "replies": []}, {"body": "Oh people don’t realize? You don’t say. Prob no way to fix that so might as well do nothing", "score": 7, "replies": [{"body": "Let's talk immigrants", "score": 8, "replies": []}]}, {"body": "Asshole alert", "score": 5, "replies": []}]}, {"body": "A friend was taking about he was buying a house because the stock market basically has gone straight up the past year. I didn't tell him I was retarded.  Pretty much everything went up except of course for tesla.  Tesla is the worst performer on the entire s and p.", "score": 16, "replies": [{"body": "He may have a house but he didn't save humanity.", "score": 6, "replies": [{"body": "Elon is a lying piece of shit.  He said that demand was the highest its ever been then not even a month later they start reducing prices and they are still reducing them.  He said there would be a share buyback in 2023.  He said that we would have a higher market cap in 5 years then aapl and amcro combined.  There's like 3 years left on this lie.  He said fsd wound be solved in 2023. He posts bat shit far right stuff on Twitter all day long I don't even think he does any work for tesla.", "score": 14, "replies": [{"body": "We know", "score": 13, "replies": []}, {"body": "and yet after saying this kinda stuff for like a year or two (feels like forever) and selling, you for some reason decided to buy back in", "score": 7, "replies": []}]}]}]}, {"body": "Twatter is better now that I've unfollowed and muted Elon lol", "score": 15, "replies": []}, {"body": "https://preview.redd.it/tsafrxdkhtnc1.jpeg?width=1079&format=pjpg&auto=webp&s=19cd86e5368d0b27758b776247078229b1358d63", "score": 8, "replies": [{"body": "May I have the attention of the class pleas", "score": 4, "replies": [{"body": "present", "score": 5, "replies": []}]}, {"body": "So hot", "score": 2, "replies": []}]}, {"body": "V12.3 will save us🚀", "score": 8, "replies": []}, {"body": "What's the new Tesla daily?", "score": 7, "replies": [{"body": "Electrified", "score": 4, "replies": []}]}, {"body": "oh great, lower lows for the year, fuck 2024 so far.", "score": 7, "replies": []}, {"body": "Pro athlete who DMd me about my Cybertruck last night was messaging me during halftime. 🤣\n\nHe’s gonna talk to his money manager about possibly renting it from me on Turo for a month at a time. \n\nHoping to charge like $700 a day. Do it for 1-2 months, then pull it off Turo forever. \n\nMaybe ask for some signed memorabilia as part of the deal. 🤣", "score": 6, "replies": [{"body": "![gif](giphy|3o85xr9ZKY1wbbJXDW)", "score": 1, "replies": [{"body": "/u/thebiglebowskiisfine you could maybe do this with the dealership folks", "score": 2, "replies": [{"body": "imminent close fade cooing dime thought zephyr theory attractive observation\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": []}]}]}, {"body": "Pro athlete who DMd me about my booty last night was messaging me during halftime. 🤣\n\nHe’s gonna talk to his boyfriend about possibly getting it from me on grinder for a month at a time.\n\nHoping to charge like $700 a day. Do it for 1-2 months, then go straight forever.\n\nMaybe ask for some drinks and foreplay as part of the deal. 🤣", "score": 0, "replies": [{"body": "![gif](giphy|67skGz7YlLW9C229Yf)", "score": 0, "replies": []}]}]}, {"body": "[Whats stronger, 🌈🐻 autism or Elon lol](https://twitter.com/unusual_whales/status/1767619603147231658?t=lNYpccSzmgIQ39Jv7Tuulg&s=19)", "score": 8, "replies": [{"body": "One causes the other", "score": 7, "replies": []}, {"body": "![gif](giphy|4WF4XZtGgo1YgGGk1Z|downsized)", "score": 3, "replies": []}]}, {"body": "Nvda swings are nuts, 5 day chart is retarded", "score": 7, "replies": [{"body": "that money inflow must be coming from somewhere... is it... not possible....", "score": 3, "replies": [{"body": "Stock is worth what next person will pay for it, inflows and outflows do not matter", "score": 4, "replies": [{"body": "So if only huge outflows, price is equally liable to go up?", "score": 3, "replies": [{"body": "If someone willing to pay a higher prices yes.", "score": 4, "replies": []}]}]}]}]}, {"body": "Elon needs to down 5 Celsius drinks then fight wokeness in hand to hand combat 😅", "score": 6, "replies": [{"body": "had a distant fam member die from energy drinks. i wish he had known the dangers.", "score": 4, "replies": [{"body": "Literal wings. 😞", "score": 8, "replies": [{"body": "i see what you did there. didnt mean to post that as a downer. he was distant and a gang banger per my understanding...", "score": 3, "replies": []}]}]}, {"body": "no his heart would explode, if we cannot have him as an active CE0, we at least need him alive, to not tank the stock even further.", "score": 2, "replies": [{"body": "End game. Gotta keep him because we suck, he has too many shares and our non auto business isn’t feature complete  💀", "score": 3, "replies": []}]}]}, {"body": "The illegal immigrants are taking Optimus's jobs, do something Elon!", "score": 5, "replies": []}, {"body": "few facts about me:  im a strong independent TSLA investor, my career means a lot to me, i don’t use tampons i air dry, some of my pet peeves are when people don’t say what they mean or repeat themselves", "score": 8, "replies": [{"body": "Fun facts about me.  I'm gonna be living in my car soon because I was dumb enough to buy tesla stock", "score": 9, "replies": [{"body": "You should sue elon for all your problems", "score": 5, "replies": [{"body": "He would be getting in a long line for that because there's a decade worth of lawsuits already lined up for what he did in 2022", "score": 7, "replies": [{"body": "Are any of them going forward?", "score": 3, "replies": []}]}]}, {"body": "\"I was dumb enough to buy tesla stock.\" \n\nTwice apparently.", "score": 5, "replies": []}]}, {"body": "we need to see the full dating profile to see if this adds or detracts from your appeal", "score": 2, "replies": [{"body": "my primary means of getting girls is to rub my hands along my sides and say “does mama like what she sees?!” works every time so the profile is just a formality", "score": 2, "replies": [{"body": "![gif](giphy|MkZRLZwPT0ZPy)", "score": 3, "replies": [{"body": "apps working? days looking up", "score": 3, "replies": [{"body": "It took 14 days but my Android gifs are now fully operational!", "score": 2, "replies": []}]}]}, {"body": "![gif](giphy|3oKIPfYg487xkXJgOs)", "score": 3, "replies": []}]}]}, {"body": "Maxi pad with wings?", "score": 1, "replies": []}]}, {"body": "https://x.com/deitaone/status/1767509027867472314?s=46&t=FJnwUzmO93DGxmO6Ihn37g", "score": 6, "replies": [{"body": "🐦🤡", "score": 6, "replies": []}]}, {"body": "Penny stock levels of 🐎 💩", "score": 7, "replies": []}, {"body": "Cpi may be up a bit but the gpu price index is through the roof", "score": 5, "replies": [{"body": "macro doesn't seem to hate cpi yet....\n\nprobably saving d0om for tomorrow", "score": 5, "replies": [{"body": "Market doesn’t care about data anymore. It’s mechanical buy the dip. People have learned that if you keep selling puts and buying calls, market just keeps going up.\n\nIt works until something breaks and is going to hurt bad if it does.", "score": 4, "replies": []}, {"body": "I think we’ve all accepted that rates ain’t coming down this year - or at least not till Q4", "score": 2, "replies": []}]}]}, {"body": "How green does nasdaq have to go to drag TSLA out of the red?", "score": 7, "replies": [{"body": "At this point, Tesla could solve world hunger and we'd still be ded", "score": 5, "replies": [{"body": "And to think Elon could have solved world hunger with a mere Billion dollar donation!", "score": 6, "replies": [{"body": "44 Twitters or 1 world hunger", "score": 5, "replies": []}]}]}]}, {"body": "[I like Rohan](https://twitter.com/rohanspatel/status/1767551416808398907?t=WSsrepamdo_pgCJAhzE-xg&s=19)", "score": 7, "replies": [{"body": "What are his opinions on border security and trans rights for pre-schoolers tho?", "score": 10, "replies": []}, {"body": "our satya!", "score": 7, "replies": []}, {"body": "Rohan for CEO", "score": 7, "replies": []}, {"body": "Asian CEO gang", "score": 4, "replies": [{"body": "Gujju gang!", "score": 3, "replies": [{"body": "We gotta start the Rohan for CEO twatter club", "score": 4, "replies": []}]}]}]}, {"body": "bookface is the future", "score": 6, "replies": [{"body": "Fuckerberg", "score": 5, "replies": [{"body": "$uckerberg", "score": 3, "replies": []}]}]}, {"body": "had a dinner party the other day and there is a bunch of thin sliced iberico and my favorite cheeses (aged gouda, a soft goat cheese called humboldt fog, and a triple cream brie) and these fancy olive&fig crackers\n\nhaving pretty much the best lunch of my LIFE. I have this very unusual reaction to cheeses that are high in casomorphins where my face gets warm and I get oddly euphoric. I looked it up and there’s nothing documented on it, but other people have mentioned having it happen. only has positive effects so it’s not considered an allergy of any kind, something like the antithesis of one \n\nok I gotta gooo", "score": 7, "replies": [{"body": "![gif](giphy|l1L2UkgpuiE4U)\n\nCasomorphins is the new-to-me-word of the day. I feel bad for those people that can't eat cheese, good stuff is divine", "score": 6, "replies": [{"body": "cheese was my first word.  my theory is that it’s because of my unusual reaction to it\n\nand yeah I feel bad for people who can’t eat cheese that would suck", "score": 6, "replies": []}]}, {"body": "Humboldt Fog is damn good.  I can't remember where I tried it but remember it being special.  I should go find some...", "score": 3, "replies": [{"body": "you gotta remember to let it sit out for an hour or two, then the edges melt at room temp and you know it’s ready", "score": 4, "replies": []}]}, {"body": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4487594/\n\n\nOpioid like effects? Maybe getting some cheese euphoria.  As a Wisconsinite, this checks out", "score": 2, "replies": []}, {"body": "One way I bond with my mother in law is we both enjoy eating cheese. Whenever we see each other (once or twice a year, she lives in another country) we partake in some cheese eating.", "score": 2, "replies": []}]}, {"body": "It looks like I'll potentially be able to buy up to ~1,000 Reddit shares through the DSP program, plus 1,000 on my wife’s DSP, plus I signed up for Fidelity’s allocation. \n\nI'd likely buy and resell within the first month. \n\nAny reason not to do this?", "score": 6, "replies": [{"body": "Haven't lost enough money on social media companies?", "score": 5, "replies": [{"body": "X has caused pain. \n\nBut my Meta shares are now 7 figures and number 2 to Tesla.", "score": 5, "replies": []}]}, {"body": "![gif](giphy|z4AG8WynSJHA4)", "score": 3, "replies": []}, {"body": "Yes, Wall Street Bets", "score": 2, "replies": []}, {"body": "Did you verify there is no lockup period?", "score": 2, "replies": [{"body": "No haven't read the terms yet", "score": 1, "replies": [{"body": "LMK when u do, then I won't have to reply to this email or create an E-trade account lmao", "score": 1, "replies": [{"body": "I read the Reddit terms. No mention of a hold period. I’m going to talk to E*trade and read the S1", "score": 1, "replies": []}]}]}]}, {"body": "What’s DSP? \n\nUsually you can’t sell (Sofi or Robinhood at least) within 120 days without paying a fee.", "score": 1, "replies": [{"body": "Direct Share Purchase for the top 75,000 Reddit accounts. \n\nWith the Airbnb ipo, fidelity rules said don't sell within 14 days or you'll be blacklisted from future IPO’s. But there was no financial penalty for selling early. I didn't get an allocation so it didn't matter.", "score": 2, "replies": [{"body": "The fee was $50.", "score": 1, "replies": []}]}]}]}, {"body": "🌏🤡 is a manchild", "score": 10, "replies": []}, {"body": "I've officially begun my \"safe\" investing.  Moving forward it's 50% SPY 50% SSO so in total 150% leveraged sp500, assuming I'm doing basic math right.\n\nI have 600 shares of TSLA and at least $35,000 in TSLY I'll eventually trade for more TSLA,  good for another 100 shares at least, depending when I move it over.", "score": 10, "replies": [{"body": "Wise for sure. Lessons learned from 🐦apocalypse", "score": 5, "replies": [{"body": "the world's longest and most expensive stonk investing master class is carving us all into solid blocks of wood, only the strongest and most regarded bulls remain alive.", "score": 5, "replies": [{"body": "![gif](giphy|c2fYirOcbOLDO)\n\nBullish that we are the most regarded left!", "score": 5, "replies": []}]}]}]}, {"body": "That YouTube tv trip planner ad that Tesla made is trash", "score": 4, "replies": []}, {"body": "just saw someone cosplaying as batman on the border", "score": 5, "replies": [{"body": "if elon went full border batman we in trouble\n\nprobably using some cool spacex tech though, like heat shield tiles to protect against their hot sauces", "score": 5, "replies": []}]}, {"body": "Ducking trash stock.", "score": 5, "replies": []}, {"body": "Where is the ce nooo", "score": 4, "replies": [{"body": "Anyone check the border?", "score": 3, "replies": []}]}, {"body": "We are down because I bought more yesterday. Very simple logic.", "score": 5, "replies": [{"body": "Yer but I’ve sold almost all my stock and it’s still going down. Damn I’m good at timing the market.", "score": 4, "replies": []}, {"body": "Lmao that's what u get", "score": 3, "replies": [{"body": "The longer the slide the longer the bag holding.", "score": 3, "replies": []}]}]}, {"body": "this is a pretty good website ngl\n\n[https://www.muskfoundation.org/](https://www.muskfoundation.org/)", "score": 5, "replies": [{"body": "Ah worst foundation in the world", "score": 3, "replies": []}, {"body": "Holy shit.  lol\n\nZero fucks given", "score": 4, "replies": []}]}, {"body": "Wen V13\n\nhttps://x.com/elonmusk/status/1767430314924847579?s=46", "score": 4, "replies": [{"body": "nobody cares what it's called. Can it drive?", "score": 10, "replies": [{"body": "![gif](giphy|3o7TKwmnDgQb5jemjK)", "score": 5, "replies": []}, {"body": "Who cares if it can drive, can we commercialize it and bring in 100bn a year?", "score": 3, "replies": [{"body": "Has to drive first", "score": 5, "replies": []}]}]}, {"body": "When is it coming to CT?", "score": 5, "replies": [{"body": "When’s it coming to my car? Still no V12", "score": 4, "replies": []}, {"body": "Prob summer", "score": 2, "replies": []}]}]}, {"body": "Ooo got $110 in target dividends today. I’m rich", "score": 5, "replies": []}, {"body": "ARM insider share lockup expiring today, lets see if the execs and/or softbank hodl or dump the shit outta it...\n\n![gif](giphy|njxkENt8FXreAt5TIT)", "score": 6, "replies": [{"body": "Will pump. Then dump in a month", "score": 3, "replies": []}]}, {"body": "Does V12 not have autopark? Autopark has always sucked so I was curious if v12 improved it. But I don’t see the autopark option where I usually see it.", "score": 5, "replies": [{"body": "Did you get V12?", "score": 3, "replies": [{"body": "I have V12. A lot better than V11 in a lot of places, still not ready for mainstream though, I think.", "score": 2, "replies": [{"body": "In what ways is it worse than V11?  I've heard a lot of people express similar views and I'm always wondering, how could it be worse that V11.4.9?  It's borderline unusable for anything other than long highway stretches in a lot of the country.", "score": 2, "replies": [{"body": "There’s this one spot that has a road repair that is horizontal and thin. To v12 it looks like a speed bump so it always erroneously slows down there. V11 didn’t do that.\n\nWeirdly, some lane changes are like super slow, where the car literally drives over the lane line for quite a while. It’s not in heavy traffic so I don’t know what it sees but it’s weird.", "score": 2, "replies": [{"body": "Yeah if slowing for caution is among the worst V12 behaviour, I can give you 10 examples where V11 slows frustratingly so for no reason.  I'm sure the errors stick out like a sore thumb when so much is done right, but I'd be curious how V12 testers would deal with going back to V11.  Lane drift alone is enough of a safety issue that V12 is at least more ready for primetime than V11.\n\nThanks for your insight, BTW!  It's nice to have someone in the lounge with some real-world V12 perspective.", "score": 2, "replies": []}]}]}]}]}, {"body": "Sounds like they’re working on all of that with actual smart summon release", "score": 2, "replies": []}, {"body": "Nope", "score": 2, "replies": []}]}, {"body": "Tsla 1y -3%, nasdaq +45% 🤡", "score": 5, "replies": [{"body": "Omar:  But TSLA is up twenty billion percent since 2008!!!", "score": 5, "replies": [{"body": "Omar's nose has a bit of brown stain", "score": 3, "replies": []}]}, {"body": "![gif](giphy|COYGe9rZvfiaQ)", "score": 2, "replies": []}]}, {"body": "tomorrow is going to be really nice guys just wait and see :)", "score": 9, "replies": [{"body": "I prefer to see and wait.", "score": 4, "replies": []}]}, {"body": "I am of the opinion that Elons actions over the last few years can be categorized under ‘what zero pussy does to a mf’", "score": 16, "replies": [{"body": "What's insane about this is he is the one who broke up with Grimes, what the fuck is that man doing", "score": 9, "replies": []}, {"body": "This is one of those classic sci fi paradoxes, hear me out\n\nThe only woman who could give him action, and stimulate him mentally, AND rein in his borders & genitals agenda =\n\nCyborg Super Hot Cat Girl\n\nThe paradox being of course, that she will never be invented in the first place,  unless hes chilled, laid, and focused on business.\n\n\nSo what we need is a time-traveling, Super Hot Cyborg Catwoman of Christmas' Past to go back in time and create the situations leading to her own creation.", "score": 6, "replies": [{"body": "![gif](giphy|xCBE0RPfYsyWI)", "score": 3, "replies": []}]}, {"body": "![gif](giphy|R6gvnAxj2ISzJdbA63|downsized)", "score": 3, "replies": []}, {"body": "Ya wow - I mean if he’s not getting laid - he’s not doing this while wealth-power thing right 😅", "score": 7, "replies": []}, {"body": "Yah incel behavior", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "If Elon wasn't ceo dude he would be a candidate for someone who shoots up a grocery store.", "score": 5, "replies": []}]}]}]}, {"body": "A hundred thousand kids die of respiratory disease due to air pollution. Eh whatever. \n\nOne kid attends a trans book reading at the library nobody forced parents to bring him to. Omg. Stop the presses.", "score": 16, "replies": []}, {"body": "Lol gary black\n\nBefore selling down his stake, when tesla was doing 10-12k a week\n\n“Tesla reporting strong numbers.”\n\nAfter selling down his stake \n\nhttps://x.com/garyblack00/status/1767462934152692044?s=46&t=dMBkdSo0_o29UzzDVhe2IA", "score": 8, "replies": [{"body": "Only reason he does this buying and selling is to give his investors the feeling they aren't paying him an above market expense ratio for doing nothing. \n\nWould like to see him spend as much time on his other holdings, but he knows those don't generate social media attention", "score": 5, "replies": []}, {"body": "The best week of the year…. Oh ya that’s modest", "score": 6, "replies": []}]}, {"body": "Sux cuz I want Gary black to get fucked so badly for selling.", "score": 8, "replies": []}, {"body": "&#x200B;\n\nhttps://preview.redd.it/6hpa7hwavwnc1.png?width=970&format=png&auto=webp&s=2c66419d64950a3a7879b86692db3e313e45fd48\n\nStay on target...", "score": 8, "replies": [{"body": "Picking up pennies in front of a steamroller driven by a distracted retard.", "score": 7, "replies": [{"body": "My pennies!\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/40rp4pga4xnc1.png?width=962&format=png&auto=webp&s=17edb4f0e006fb46e21a724f4045d0428642ce1b", "score": 2, "replies": []}]}, {"body": "Why don’t you just close 1 or 2 and roll another one to next week?", "score": 2, "replies": []}, {"body": "Could roll those way out to like Aug for credit to 270s", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Rohan is really the best. Need to see more of this guy", "score": 7, "replies": []}, {"body": "Palm Beach is barely South Florida. More like rich part of central Florida, Florida man country.", "score": 2, "replies": []}]}, {"body": "https://x.com/teslaaigirl/status/1767597990762746093", "score": 7, "replies": [{"body": "she's uploaded the video  https://x.com/TeslaAiGirl/status/1767601955298578636?s=20", "score": 8, "replies": [{"body": "Omg mind blowing?", "score": 0, "replies": [{"body": "lol no wtf decides to drive highway whole video", "score": 6, "replies": [{"body": "https://twitter.com/SandraEdwa52877/status/1767603442951004207?t=mk5FK--wJ2d7bzCMPdfn0A&s=19\n\nBots solved", "score": 7, "replies": [{"body": "😂", "score": 5, "replies": []}]}]}, {"body": "zero disengagements , it was very good", "score": 8, "replies": []}]}]}, {"body": "Def one of us https://x.com/teslaaigirl/status/1767333112307175822", "score": 5, "replies": []}]}, {"body": "NVDA going up, TSLA going down, everything is back to normal now, wow.", "score": 8, "replies": [{"body": "![gif](giphy|Ry1MOAeAYXvRVQLPw3)", "score": 5, "replies": []}]}, {"body": "Fresh thread", "score": 4, "replies": [{"body": "fresh AF", "score": 1, "replies": [{"body": "![gif](giphy|7A7iNCHhPpqwaNRgV1)", "score": 3, "replies": []}]}]}, {"body": "Starlight star bright", "score": 4, "replies": []}, {"body": "dongle my dingle", "score": 5, "replies": [{"body": "![gif](giphy|26gsgWH4lnurglMWY)", "score": 2, "replies": []}]}, {"body": "https://x.com/teslascope/status/1767472267477582164 imminently imminent, unreliable", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "impressively rad", "score": 1, "replies": []}]}, {"body": "wut", "score": 5, "replies": [{"body": "![gif](giphy|xTiTnDAP0RiCo9k85W|downsized)", "score": 2, "replies": []}]}, {"body": "Nvda and Smci inflation proof?", "score": 4, "replies": [{"body": "Well yer because their biggest customers are corporate and they won’t stop buying because if they stop their competitors will take the hardware.", "score": 5, "replies": []}]}, {"body": "good morning!", "score": 3, "replies": [{"body": "![gif](giphy|3o7budjt6UTWuFSdYA|downsized)", "score": 1, "replies": []}]}, {"body": "Germany uses Guerilla tech\n\nhttps://preview.redd.it/yd0hz95lkxnc1.jpeg?width=1170&format=pjpg&auto=webp&s=8d57397e86ff146ebbb7494567af428f59229fc7", "score": 4, "replies": [{"body": "when you used to be really good at something and now you are not anymore : tsla and german military\n\n![gif](giphy|pHb82xtBPfqEg)", "score": 3, "replies": [{"body": "🤣🤣🤣", "score": 2, "replies": []}]}]}, {"body": "Anyone else use the fold card here?", "score": 4, "replies": [{"body": "we aren't good at folding, thats why we are still here", "score": 4, "replies": []}]}, {"body": "Sold all my TSLY.  Will nibble at TSLA as the dagger falls.", "score": 3, "replies": []}, {"body": "Any updates on the border?", "score": 7, "replies": [{"body": "Military age men from North Korea with six packs should be arguably called v13 illegals.", "score": 1, "replies": []}]}, {"body": "Michael Saylor should challenge Jamie Dimon to a steel-cage deathmatch and settle the BTC legitimacy issue once and for all....\n\n...oh wait thats totally ridiculous and two adult business leaders wouldn't even joke about that.", "score": 7, "replies": []}, {"body": "Bought another 100 shares of NVDA today at 900 and sold a 950 CC. TAKE THOSE SHARES JENSEN!", "score": 7, "replies": [{"body": "We don’t need a play by play lol", "score": 3, "replies": [{"body": "Yes we do, my 1000C demands it", "score": 3, "replies": []}]}, {"body": "uncle sam thanks you for your business", "score": 3, "replies": []}, {"body": "Nice. $5000 payday come Friday", "score": 3, "replies": [{"body": "6 if you count the CC premium 💰", "score": 2, "replies": [{"body": "Nice", "score": 2, "replies": []}]}]}]}, {"body": "[https://x.com/TeslaAiGirl/status/1767601955298578636?s=20](https://x.com/TeslaAiGirl/status/1767601955298578636?s=20)\n\nits happenin, 12.3", "score": 8, "replies": [{"body": "Boy who cried wolf and all that… but FSD is incredibly impressive and if you zoom out a bit the progress has actually been pretty amazing. Obviously hasn’t met the impossible bar set by the hype man but if someone rational had given realistic guidance on progress this would probably be hailed as an amazing achievement. \n\nI’m still convinced tesla will reach true FSD before anyone else, just might be another few years before that happens.", "score": 7, "replies": []}, {"body": "Is the highway stack still V11?", "score": 2, "replies": [{"body": "It supposedly was on previous v12 builds but we don't know what this one is doing yet", "score": 2, "replies": [{"body": "Thought the highway stack was V11 still and V12 for city", "score": 1, "replies": [{"body": "Yes that what I said...", "score": 1, "replies": []}]}]}]}, {"body": "Lol Stockton", "score": 2, "replies": []}, {"body": "\"This post is from an account that no longer exists\"", "score": 1, "replies": [{"body": "Well that’s kinda interesting… \n\nI watched the video before the account was taken down and it was excellent. 25 min drive to Costco, mostly highway but starts with 2 perfectly executed rotaries and ends in the Costco parking no. No disengagements. \n\nGuess she violated some sort of no video rule?", "score": 3, "replies": [{"body": "Maybe was getting too many comments and just suspended their account?", "score": 1, "replies": [{"body": "Doubt it… FSD videos aren’t really lighting the world on fire these days", "score": 2, "replies": []}]}]}]}]}, {"body": "Gary trimming TSLA position and bearish tweets is a bottom indicator", "score": 8, "replies": []}, {"body": "What is Elon's end goal anyways? There's no solutions, its just manic posting. Someone needs to fucking call him out at an event lmao its the only way", "score": 10, "replies": [{"body": "That's what baffles me. We all thought Elon was a calculated guy but this descent into madness proves otherwise, it's a gigantic waste of his time.", "score": 11, "replies": []}, {"body": "If he can wake up just a few to the illegal immigrant transsexual illuminati that has all the power, he has done more than most.", "score": 7, "replies": []}, {"body": "He doesn't have an end goal, he just has a personality disorder", "score": 11, "replies": []}, {"body": "I miss the days when I was annoyed by his Doge obsession", "score": 8, "replies": []}, {"body": "his brother, his Mom, his financial mentors, and his various ladies have all tried to get him to stfu and hes only grown more emboldened, almost like he bought a social media company purely to be his own forum for shitposting, basically the only way he is gonna change is in the scenario Glib described earlier, he needs to have some kind of Scrooge revelation/Come to Jesus/ Alcoholics Moment of Clarity, or this is just never gonna stop.\n\n&#x200B;\n\nand yeah, right now the best goal = No Goal", "score": 7, "replies": []}, {"body": "Challenging him publically is effectively pushing him to go 2x harder in the undesired direction.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "The datas has spoken", "score": 5, "replies": [{"body": "The trans want their lumber back musk!", "score": 2, "replies": []}]}, {"body": "Must devote 75% of daily thoughts into .3% of the population", "score": 9, "replies": [{"body": "You missed a few 0s after the decimal place", "score": 7, "replies": []}, {"body": "And who is the real problem, the .3% who want the freedom to be who they want or the 50% who are snowflakes and can't control their own thoughts and emotions and deal with the fact that some people are different", "score": -2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Number of kids affected by this is completely immaterial to society yet because ceo has personal burn its top priority", "score": 2, "replies": []}, {"body": "I think the issue of how many kids are actually sexually abused by members of churches or even just regular anti-drag pedophiles should be more concerning\nr/notadragqueen", "score": -2, "replies": []}]}]}]}, {"body": "Or because people that are different are likely\nTo be bullied and harassed. Prob a bit of both.", "score": 2, "replies": []}]}, {"body": "When can we talk about ditching Elon. Can I please invest in a sane publicly traded company run by someone who at least pretends to act in shareholder interests? How much you think we go up if literally anyone takes over beside Elon? 100%? A carved wooden horse would send us up at least 50%\n\nIt is hard to remember days when I was stan’ing for this guy", "score": 14, "replies": [{"body": "Yeah time for him to fuck off", "score": 11, "replies": []}, {"body": "We been talking about it for years. If his passion is now borders and genitals, he should follow his heart.", "score": 13, "replies": [{"body": "Okay, \"borders and genitals\" did make me lmao for real", "score": 7, "replies": [{"body": "What’s your political platform? Borders and genitals. lol ", "score": 6, "replies": []}]}]}, {"body": ">Can I please invest in a sane publicly traded company run by someone who at least pretends to act in shareholder interests?\n\nYes, you can give your shares away to a buyer during trading hours at the current market price, and then exchange that currency for shares of a company that you would like to be invested in instead.", "score": 5, "replies": [{"body": "If Elon doesn't like illegal immigrants coming to the US, he should stop whining about it and move to some other country w secure borders.", "score": 8, "replies": [{"body": "Unlike pitiful retail he can actually influence things. He can't be both responsible for \"brand destruction\" and unable to make the difference.", "score": 3, "replies": [{"body": "Haha yes he can. Yes he can.", "score": 2, "replies": []}]}]}]}]}, {"body": "heh fp", "score": 6, "replies": [{"body": "Hehehehehehe fp ", "score": 3, "replies": [{"body": "huehuehuehuehuehuehuehue fp", "score": 3, "replies": []}]}]}, {"body": "🚀", "score": 7, "replies": [{"body": "🚀🚀", "score": 2, "replies": []}]}, {"body": "Cpi exactly in line.", "score": 6, "replies": [{"body": "Didn't cpi tick higher?", "score": 4, "replies": [{"body": "It was in line with market expectations. +0.4", "score": 4, "replies": []}]}, {"body": "Guess again", "score": 3, "replies": []}, {"body": "I like ur flair 🥰", "score": 2, "replies": [{"body": "Goog simp", "score": 7, "replies": [{"body": "![gif](giphy|l41K5A3p1FD9HZrvG)", "score": 3, "replies": []}]}]}]}, {"body": "https://preview.redd.it/znh07zadaxnc1.jpeg?width=1179&format=pjpg&auto=webp&s=8bfef9bc14c7ab6e22e1ffa329ea99e8b36a417c\n\n🚀🚀🚀", "score": 6, "replies": [{"body": "are we still part of the mag 6 🤣", "score": 5, "replies": [{"body": "We only in 1 MAGA, the MAGA CEO club baby", "score": 3, "replies": []}]}]}, {"body": "https://preview.redd.it/uah1hd4wsync1.jpeg?width=1179&format=pjpg&auto=webp&s=dd3564f11cbd490b5ff9bf0ad63b6e09deaebe58\n\nWould be funny if FED one day said 2-3% rather than just 2%\n\nOnly real way to fight ur money being worth less each year is investing 🥰", "score": 6, "replies": [{"body": "In Bitcoin. \n\nInvesting in Tesla and your money is worth less, daily", "score": 6, "replies": [{"body": "Ya Bitcoin seems to be the inflation hedge.\n\nSeems that people are pricing in seasonality into Jan/Feb prints - and hopefully it trends down.\n\nUltimately, economy is chugging along, and I think people expecting another 20-50% drop off the top like in 2022 are gonna be 💀\n\nUp and to the right for the indexes 🚀", "score": 0, "replies": [{"body": "I own btc and am a believer in general, especially in the long run, but the inflationary hedge/safe haven concept to me, took a wee bit of a hit at the end of '21 when btc got gobsmacked along with everything else and no big money was fleeing to it to escape inflation.\n\nNow, whether that was a one off, or totally unrelated, or btc moves with tech stocks, etc. etc. i don't know. Just saying the recent rise may have nothing to do with inflation.", "score": 2, "replies": [{"body": "It’s too early to know if it’s an inflation hedge or not. There’s just way too much speculation in the ecosystem to know.", "score": 3, "replies": [{"body": "15 years not enough, it definitely outpaces inflation, just don't delude yourself about the volatility, if you get in too high you might need to bag hold for 2 years", "score": 3, "replies": []}, {"body": "indeed, i was trying to drive at that but you said it better, its still speculated and gamed so much now its hard to say in the future what it will be.", "score": 2, "replies": []}]}, {"body": "I think smart money still knows and divests out into cash before shit hits the fan. So hedge is being smart money aka sources!", "score": 3, "replies": []}]}]}]}]}, {"body": "https://x.com/elonmusk/status/1767430314924847579?s=46&t=mG-wx8ewMg03AyZIsmD4-g\n\n🤡🙃", "score": 9, "replies": [{"body": "Why does it even matter? 11, 12, 13 are just numbers. Launch supervised robotaxi in atleast one region and then we are talking. We’ve seen enough from Elon to not get hyped on all these anymore.", "score": 7, "replies": []}, {"body": "Mind blowing!!! Since v10!", "score": 8, "replies": [{"body": "To be fair, I've worked in deep learning for many years and my mind was blown by v10 already. It was not at all clear that pure vision could perceive the world that well, let's say 4 years ago. People over at my favorite self driving subreddit kept claiming that the environment FSD predicted was based on HD maps. Now they claim V12 is not really end-to-end, not really just trained on videos of human drivers.", "score": 3, "replies": []}, {"body": "Arguably should have been called v11", "score": 3, "replies": []}]}, {"body": "No one trust this type of comments anymore… but at a certain point, he will be right I guess 🤣", "score": 5, "replies": [{"body": "v12 was actually a big step from v11 so", "score": 8, "replies": [{"body": "Will be\n\n![gif](giphy|m8WzRSb4xDcMx2WbkV)", "score": 2, "replies": [{"body": "🤣", "score": 0, "replies": [{"body": "Glib (rhs) and Nate (lhs) are pictured in the gif", "score": 2, "replies": []}]}]}]}]}, {"body": "the boy who cried mind blowing", "score": 1, "replies": []}]}, {"body": "https://x.com/sawyermerritt/status/1767429216021430495?s=46\n\n13k China, holy", "score": 9, "replies": [{"body": "Anyone knows what was tesla china highest weekly ever?\n\nI miss rob.", "score": 4, "replies": [{"body": "He has a table.\n\n19k it was I think", "score": 6, "replies": []}]}]}, {"body": "Martin Luther Musk fighting for the underrepresented white demographic in society.", "score": 8, "replies": [{"body": "Must stop the evil transsexual illegal immigrant illuminati that controls every part of the government and media.", "score": 8, "replies": [{"body": "Pro-Humanity Aliens watching this play out as we reach the crossroads between choosing space exploration and joining the Galactic Community, or choose to melt down via never ending war, squabbles, and politics :\n\n![gif](giphy|XsUtdIeJ0MWMo|downsized)", "score": 5, "replies": [{"body": "![gif](giphy|TpcYckW3Lt8gMeDgPR|downsized)", "score": 1, "replies": []}]}]}]}, {"body": "2nd", "score": 3, "replies": [{"body": "Thirth ", "score": 1, "replies": []}]}, {"body": "☠️☠️☠️", "score": 3, "replies": []}, {"body": "![gif](giphy|PqcIFm93VxA8o|downsized)\n\nElon is talking about TikTok now  https://x.com/elonmusk/status/1767540775762411525?s=20", "score": 3, "replies": [{"body": "He should buy TikTok", "score": 1, "replies": []}]}, {"body": "so anyone else besides this ai chick that got v12.3?", "score": 3, "replies": []}, {"body": "Is it too early to start guessing when Fisker will announce bankruptcy? (God bless their hearts). Or will they try to raise money and stock split etc.", "score": 3, "replies": []}, {"body": "Sigh", "score": 3, "replies": []}, {"body": "Stock buybacks when?", "score": 3, "replies": [{"body": "50,000 lies by 2024", "score": 6, "replies": []}, {"body": "you just gave them an idea, it's been a while since we did a cap raise...", "score": 6, "replies": []}]}, {"body": "Pro athlete on his rookie contract of $27 million DMd me asking how much for my stockpile of thousands of TSLA shares.\n\nI said wait a few months you can buy them from me for a 100 bucks a share 😎", "score": 6, "replies": [{"body": "![gif](giphy|3ohfFC5mKlWU2L1KUg)", "score": 5, "replies": []}, {"body": "🤣🤣🤣", "score": 5, "replies": []}]}, {"body": "TSLA bout as gay as the day is long.", "score": 7, "replies": [{"body": "Cmon anyday we are just slightly red is a good day!", "score": 1, "replies": []}]}, {"body": "![gif](giphy|l3V0H7bYv5Ml5TOfu|downsized)", "score": 5, "replies": []}, {"body": "Serious question, what do you think the value of TSLA stock would have to be such that when Elon Musk is fired the value goes UP, not DOWN?\n\nI think if stock is at 150, board announces Musk is stepping down as CEO, stock remains flat.\n\nIf right now, Musk departs, stock drops to 150 and volatility through roof, depending on successor.\n\nGetting the right person to run the company would be difficult.  I don't think they need a Tim Apple type implementation leader, but still a visionary...\n\nI still believe FSD can be done, but I'd like to see them get it true solid Level 4 on the highway and then get a good relationship with regulators and finally level 4/5 everywhere.\n\nMusk used to be an asset, and now he is a liability.  Companies should jettison liabilities.", "score": 9, "replies": [{"body": "the only way he is leaving is if he takes himself out, the shareholder votes show he has a freakin lock on power and he is the puppetmaster of the board, so i cannot allow myself this fantasy", "score": 6, "replies": []}, {"body": "I like your idea of getting level 3 or 4 on highways only first. I haven’t heard that one. They could even get approval for only certain highways. Need to take it slow as a death caused by fsd will bring the hammer down ", "score": 5, "replies": []}, {"body": "You're allowed to sell", "score": -7, "replies": [{"body": "I'm always curious why people parrot this \"if you don't like it, sell!\" line. Is it unreasonable to have constructive criticism about the way a company is being run?  You can still believe in the core principles of a business while disagreeing with leadership about some issues.\n\nIt's just a trolling, dismissive, intellectually lazy way to provide a non-response.  \n\nHere's one for you, \"if you don't like someone's opinion, don't reply\"", "score": 7, "replies": [{"body": "Sure have criticism, just don't expect anything to change. Vote your shares if you want but unlike democracies you're allowed to not participate if the result isn't to your liking. Institutions will just vote board recommendation so it's pointless to vote anyways, therefor if you don't like it either accept it and stop whining or sell.\n\nOr keep holding on to something you really don't like holding and focus your every day attention on it, choice is yours.", "score": 0, "replies": [{"body": ">Sure have criticism, just don't expect anything to change\n\nAgain, this resigned attitude is so unhelpful.  The only way we can affect change (including within ourselves) is to voice our opinions and entertain discussion.\n\n>Or keep holding on to something you really don't like holding and focus your every day attention on it, choice is yours.\n\n*sigh*. How does one live in a world with so little nuance?  There's a lot of room between, \"I support Elon 100%\" and \"I think Elon is entirely wrong\".  Believe it or not, it may be possible to support Tesla and be critical of Elon.  Mind-blowing, I know.", "score": 2, "replies": [{"body": ">Believe it or not, it may be possible to support Tesla and be critical of Elon. Mind-blowing, I know.\n\nYeah I wasn't going to respond to the dumb replies but I think it is mainly people who are very young / childish or perhaps have not had any real exposure to business.\n\nIn my field I use very high cost equipment, and occasionally have gripes which I communicate to the manufacturer, and often the suggestions are incorporated to the next models.  Corporations are just run by people, who aren't often capable of seeing what they are doing wrong.\n\nYeah sure some of the whining here we do isn't helpful, but formulating helpful criticism of a company is a very good thing, these ideas can coalesce and be passed along more effectively than you would think.", "score": 2, "replies": [{"body": "Well-said", "score": 3, "replies": []}]}, {"body": "Call it a resigned attitude, it's the truth", "score": 1, "replies": []}]}]}]}]}]}, {"body": "v12 rollout weird as hell, are they spinning a wheel and one lucky winner gets the next rollout + employees?", "score": 6, "replies": [{"body": "100% data driven. \n\nThey have more real time info than anyone on the whole globe.", "score": 3, "replies": []}, {"body": "Moment of truth to see how many issues 12.3 fixes", "score": 3, "replies": [{"body": "There are only like 2 people who actively post their experiences with V12 - Omar and AIDriver.  Honestly, we need it in the hands of more objective people and in places outside of California.  If they need data, then get it out there.  It's still beta so wide release risk isn't present yet.", "score": 2, "replies": [{"body": "Bradford with his Rebellionaire thing has posted a ton and he’s typically fairly objective. The random feedback I’ve seen has been extremely positive compared to 11. But we have to see how many issues they’re able to fix with each dot update and how fast they’re able to ship those improvements\n\nNo one trusts Elon anymore. Market wants to see these AI investments monetized and providing a decent ROI", "score": 3, "replies": [{"body": "Would be easier if they gave it to the OG testers who have standardized routes/tests.  I enjoy Omar's videos but he generally just goes random places with no real basis for comparison.  Dirty Tesla, Chuck and Black Tesla would be great for providing a baseline to watch progress.", "score": 1, "replies": [{"body": "There have been a few other testers like Edge Case that have provided really good example videos. 12.2 makes a fair amount of mistakes but overall is much smoother. Key is how fast they can fix the issues so 12.3 will be extremely important to track as an example", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Closed my COIN CC for +700. Waiting on a move before deciding on opening a new one or selling the shares.", "score": 4, "replies": []}, {"body": "BTC died", "score": 4, "replies": [{"body": "![gif](giphy|D3y1KbfTrSuha)", "score": 5, "replies": []}, {"body": " 😂 people are so mad about btc run it’s amazing", "score": 5, "replies": []}, {"body": "Omg now it’s dead for real?!?!", "score": 3, "replies": [{"body": "Lets ride it to zero", "score": 2, "replies": []}]}, {"body": "For the 69th time this year lol", "score": 2, "replies": []}]}, {"body": "🐕💩 stock & ceo", "score": 8, "replies": [{"body": "🎯🎯🎯", "score": 5, "replies": [{"body": "‼️‼️‼️", "score": 1, "replies": []}]}]}, {"body": "Goog first to go red premarket. Tsla gunning for second", "score": 5, "replies": [{"body": "![gif](giphy|xThuWuNzTZK9o0qzVS|downsized)", "score": 3, "replies": []}]}, {"body": "oh damn another nail biter first post day\n\nmaybe my new thing is perfectly flat days hmmm", "score": 2, "replies": []}, {"body": "😂 did ai girl get banned?? mindblowing v12.3 should arguably be v13 but nobody can see it!", "score": 2, "replies": [{"body": "I watched it and it was actually a very good performance. Not a super challenging drive but very well executed.", "score": 3, "replies": [{"body": "i did too, highway like 90% of the video and 2 roundabouts 😴 wen stress test", "score": 2, "replies": []}]}]}, {"body": "Pro athlete on his rookie contract of $2700 million DMd me asking how much for my stockpile of 1,000 Nvidia H100... lmao\n\nEdit: He is an investor in a startup which has several thousand H100 on order but knows he’s gonna be waiting for a while. Maybe I’ll see if he wants to rent my GPU cluster as a cloud ML/inference service for months at a time.", "score": 4, "replies": [{"body": "Ok", "score": 1, "replies": []}]}, {"body": "Get ready to fund the next mission to save humanity. GFY Elon.\n\nhttps://x.com/krassenstein/status/1767529649716752488\n\nThe fact that this is even in the conversation is insane", "score": 4, "replies": [{"body": "i wouldnt even be surprised if elon bought it just so trump ends up on X 🙅‍♂️ lets make a X", "score": 5, "replies": []}, {"body": "This was before he got twitter right? Woulda been less painful", "score": 5, "replies": []}, {"body": "Elon isn’t that regarded", "score": 5, "replies": [{"body": "Don’t doubt him he’s said", "score": 3, "replies": []}, {"body": "He's a max retard when it comes to politics", "score": 5, "replies": [{"body": "Agreed.", "score": 3, "replies": []}]}]}, {"body": "Probably less  headaches and cheaper than the bird. More likes for posts about illegal immigrants committing crimes.", "score": 2, "replies": []}]}, {"body": "https://x.com/rohanspatel/status/1767529253992636435?s=46\n\nOnly facts\n\nEdit: link update: https://x.com/rohanspatel/status/1767539975921242144?s=20", "score": 3, "replies": [{"body": "Deleted - what did he say?", "score": 2, "replies": [{"body": "https://x.com/rohanspatel/status/1767539975921242144?s=20", "score": 3, "replies": []}]}, {"body": "☠️☠️\n\nDo nit criticize the right. We beed you Rohan.", "score": 1, "replies": []}]}, {"body": "https://whitney.org/collection/works/6081", "score": 3, "replies": [{"body": "Lol, move over \"Nighthawks\" , the far more appropriate lounge Hopper piece has revealed itself!", "score": 5, "replies": []}, {"body": "Connects with me for some reason", "score": 3, "replies": []}]}, {"body": "Anyone buying SNOW at these levels?\n\nSeems oversold - and still a good company - despite the CEO selling all year then retiring 🤣\n\nThen again PLTR up 235% for the 1Yr", "score": 2, "replies": [{"body": "Snow revenue to market cap is apparently low", "score": 7, "replies": []}, {"body": "snow is good but also check out CRWD. I have a decent position in it for the last few years.", "score": 1, "replies": []}]}, {"body": "Sigh", "score": 1, "replies": []}, {"body": "Pro athlete on his rookie contract of $270 million DMd me asking how much for me to turn gay for one night... lmao\n\nEdit: He has a twink on side but not good enough for him wants my big dong.  Maybe I'll see if I can gigolo off onlyfans for months at time.\n\nTrue story bros, yeah man", "score": 0, "replies": [{"body": "Lmao. You think I’m frauding?", "score": 5, "replies": [{"body": "No. We appreciate you.", "score": 3, "replies": []}, {"body": ">You think I'm frauding?\n\n[https://www.youtube.com/watch?v=OoTbXu1qnbc](https://www.youtube.com/watch?v=OoTbXu1qnbc)\n\nSituation is weird, just having fun.", "score": 1, "replies": []}]}]}, {"body": "LoL CsP bULLs 🤭🤭🤡", "score": 0, "replies": [{"body": "Better than buying calls lol", "score": 4, "replies": [{"body": "Can't even sell them with this IV right now", "score": 1, "replies": [{"body": "Iv is 44%ile so not terrible", "score": 5, "replies": []}]}]}]}, {"body": "If tsla goes bankrupt does anyone know what musk rats network would be? I’m just curious.", "score": 0, "replies": []}]}
