{"title": "Can someone explain this to me - Pelosi's Strike Price on Nvidia", "selftext": "Saw this earlier on X by QuiverQuant. How could she buy call options at a strike price of $120 when the market price was $487?\n\nhttps://preview.redd.it/omlggm3sremc1.png?width=1649&format=png&auto=webp&s=8aaa003976b599ebae74bba6d34a24acf31d460f", "id": "1b6qvm6", "created_utc": 1709597685.0, "score": 164, "upvote_ratio": 0.8, "num_comments": 188, "comments": [{"body": "Some people have a wild idea that options can be a strategic investment and not just 0dte out of the money scratch tickets", "score": 636, "replies": [{"body": "Lol.", "score": 52, "replies": [{"body": "It's called hedging but the kids these days only know about edging 🫤", "score": 40, "replies": [{"body": "Go on....", "score": 6, "replies": [{"body": "Underrated comment right here.", "score": 2, "replies": []}]}, {"body": "Ah yes the original reason options were created", "score": 6, "replies": []}, {"body": "you have no idea what you are talking about lol , hedging indeed lol", "score": 1, "replies": []}]}]}, {"body": "Investment? Never heard of her", "score": 32, "replies": [{"body": "Come on man, \"investor\" was right there lol", "score": 5, "replies": [{"body": "There? Never heard of her", "score": 6, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "Yuuup, that's what I'm using with NVDA right now, I have a single 760 call that I bought when NVDA was 599/share. It expires December of this year.", "score": 7, "replies": [{"body": "no  Pelosi bought deep ITM , you are buying OTM , totally diff strategy", "score": 1, "replies": []}]}, {"body": "😂", "score": 2, "replies": []}, {"body": "She obviously knew this was gunna happen yeah?", "score": 1, "replies": []}]}, {"body": "You too can buy in the money options", "score": 333, "replies": [{"body": "What?! You mean to tell me I’ve been buying options out of the money on purpose?", "score": 82, "replies": [{"body": "No. Porpoise u daft idiot.", "score": 18, "replies": []}, {"body": "[deleted]", "score": -5, "replies": [{"body": "It’s cheaper to buy outright than to buy option and exercise it, but you get more leverage with the calls even when bought deep in the money.", "score": 5, "replies": [{"body": "Not necessarily. If you go deep enough the options will equalize with the current market price.", "score": 1, "replies": []}]}]}]}, {"body": "And then sell OTM calls", "score": 6, "replies": []}, {"body": "Pretty sure it was just her kid trading on her phone without her permission. \n\nOnly 10 year olds buy in the money options.", "score": 5, "replies": [{"body": "Can we get a Pelosi's Kid ETF?", "score": 3, "replies": []}]}, {"body": "Nonsense", "score": 1, "replies": []}]}, {"body": "Cheaper to buy deep ITM options than shares, saves on margin interest as well", "score": 122, "replies": [{"body": "Could you elaborate on margin interest", "score": 5, "replies": [{"body": "It’s interest you have to pay for equities bought on margin (with money you borrow from your broker)", "score": 20, "replies": [{"body": "But if you buy ITM vs OTM on margin is the interest different?", "score": 0, "replies": [{"body": "Takes less cash to buy ITM options than shares", "score": 31, "replies": []}, {"body": "What the guy is saying is that you don't normally have margin interest on options. Depending on your institution/plan, you may only have fees when you open and/or close your option positions.\n\nBuying on margin means you're borrowing money (to buy securities) and doing so incurs interest.\n\nSo, the answer to your question is no.", "score": 6, "replies": [{"body": "You are also getting less \"power\" as well since you are not using said margin... the difference is just that you are not using margin vs using it, you can just also not use margin when buying shares too lol.\n\n\nHOWEVER, the idea of using options over shares for an investment (vs risk lotto ticket) is that it's cheaper to \"control\" 100 shares of that vs buying 100 shares of it.", "score": 2, "replies": []}]}, {"body": "They're saying buying ITM saves on margin interest compared to buying shares on margin. Not comparing to OTM", "score": 3, "replies": []}, {"body": "No cause it’s the right to buy or sell 100 shares, not actually 100 shares", "score": 2, "replies": [{"body": "Jesus, bro u control 100 shares per contract, deeper in the money = higher delta, deltas of 80-90 trade nearly dollar to dollar, so buying 10 contracts equals 1000 shares of pacw for instance, she would spend a fractional amount and pay no margin interest and control the same amount of stock for less money", "score": 1, "replies": [{"body": "That’s what I’m saying my brutha, you control 100 shares of stock as an option buyer but you don’t actually have those 100 shares", "score": 1, "replies": [{"body": "Incorrect controlling the shares and owning the rights to them are the same thing the only differences they tradable on contract as a derivative. It doesn’t mean that they don’t exist They definitely have value, and you do own them.", "score": 1, "replies": [{"body": "No dude what?? If you actually want the shares you have to exercise the contract, they don’t exist until you pay up money. Beyond that it’s a contract to buy or sell at a given price and it holds value because we’re  assuming someone will have the money to make that deal given it’s valuable enough", "score": 1, "replies": [{"body": "Ok go sell an uncovered call  expiring Friday and tell me there’s not any value in it, ur account will tell u other wise", "score": 1, "replies": [{"body": "That’s not what I’m saying 🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️", "score": 1, "replies": []}]}, {"body": "I write cash secured puts monthly collecting premiums and buying shares if they fall under the strikes, I assure u, controlling the shares with option Greeks and volatility is the value applied", "score": 1, "replies": [{"body": "You’re an idiot dude. Yeah the value is in CONTROLLING the 100 shares. IF you have the money you can actually obtain those 100 shares but if you don’t at the end of the day you sell that contract to someone who does who then actually makes that share transaction. The whole point is you don’t OWN those shares which will give different rules for lending because you’re leveraged from the behest", "score": 1, "replies": []}]}, {"body": "I understand what you’re saying though with the interest on stocks vs option but is irrelevant bc if u have a margin account and trade over ur cash it’s gonna be charged margin interest on whatever stock is held in there as almost anyone who day trades has a margin account", "score": 1, "replies": []}]}]}, {"body": "The point is they have value as shares. Otherwise you wouldn’t be able to do spreads with the value of a call option and being able to sell calls against it short creating spreads", "score": 1, "replies": []}, {"body": "If you didn’t own the calls options you would not be able to sell shares short as well because then you would be taking out a naked position that is not covered by cash that is invested in the initial call option", "score": 1, "replies": []}]}]}]}, {"body": "No the point being made is you can effectively buy leverage for extrinsic value on the option which is often cheaper than the same leverage as margin.", "score": 1, "replies": []}]}, {"body": "interest expense  miniscule  when the stock  goes up  several 100 dollars compared to the ROI", "score": 0, "replies": []}]}]}, {"body": "Why do you think it saves margin interest? You think the call seller doesn’t know what the interest rate is and use it to price the option?\n\nIt definitely saves you some of the spread over fair rates that brokers charge for margin.", "score": 2, "replies": [{"body": "buying shares on margin (margin interest) versus buying options (implied interest)", "score": 3, "replies": []}]}]}, {"body": "When you’re bullish on a stock you can buy deep itm for little extrinsic value and at an upfront discount \n\n\nI think in this case they got stock at a 20% discount over buying shares while realizing 100% of the gains", "score": 57, "replies": [{"body": "*Intrinsic value... Deep ITM will have nearly zero extrinsic value", "score": 13, "replies": [{"body": "It’s supposed to say “low extrinsic”", "score": 13, "replies": []}]}, {"body": "Can you elaborate?? You wouldn't get it at a discount correct. You would pay higher to account for the uncertainty? What I mean is strike price+ premium will be greater than the current price. How does that help? Is it leverage? She gets more share control for the same amount so if it rises she gets a better return?", "score": 2, "replies": [{"body": "Such deep ITM calls are basically guaranteed to be exercisable upon expiration, so their delta is very close to 1. Right now, the 200c expiring in a year has a delta of 0.9763, so basically you get 98% of the move while paying roughly just 75% of the sum you'd have to pay to own the shares. It's capital efficiency basically.\n\nThe 420c has a delta of 0.9186, so you get 92% of the move while paying just half of what you would if you were to buy 100 shares.\n\nBetter comparison: that option gives you the power of 92 shares for 46000 dollars. Buying 92 shares would cost you 78200. Now you (or Mrs. Pelosi) can spend that 32k elsewhere while getting the same return.", "score": 117, "replies": [{"body": "Wow.  I need to learn some more finance.", "score": 25, "replies": []}, {"body": "Thank you for this thoughtful and detailed explanation. Very helpful.", "score": 9, "replies": []}, {"body": "The delta for the 12/20/24 120c is 1.0016\n\nAs of today, I believe she is up $1.8 million on her purchase, so she is at 100% profit, and we're still 9 months out from expiry.", "score": 2, "replies": []}, {"body": "Why don’t more people just buy deep itm options if they are bullish on a stock. Why buy shares then? If it’s really deep, you would remove the risk of stock price falling below the strike price, no?", "score": 3, "replies": [{"body": "What u/MarkVarga forgot to mention is in the black swan event NVDA goes below the strike price, you essentially own nothing in this case but if you had shares outright, you atleast own something of future value. \n\nOptions have an expiration date, shares do not. Capital efficiency comes at the expense of time. That black swan event may eventually recover to the original stock price, but the once deep ITM  option you originally bought might expire before said recovery leaving you with a total loss.", "score": 15, "replies": [{"body": "This volatility behavior is a known feature, though.  Many investors are happy to have a floor on their losses if the spot price falls below the strike.  So 100 shares fall 180 points and lose $18k but the option loses $10k or whatever.  Then you have the \\*option\\* to reestablish long deltas by buying in the spot market, selling a put, rolling the call, etc.", "score": 3, "replies": []}]}, {"body": "Because option is got expiration date.\n\nIf you're buying deep itm, you need to be right enough to offset the premium you're paying within the time frame you chose.", "score": 1, "replies": [{"body": "So let’s assume you had inside knowledge,not tha Mrs.pelosi would have that,but assuming one did.And that knowledge told you NVDA was set to increase triple digits over the next 2 years.Would it make sense to then buy shares for the full cost or some deep ITM 2 year options for a discount? Both choices have the same upside potential.", "score": 1, "replies": [{"body": "Assuming you have reliable insider info you would just leverage up as much as possible to have maximum delta without getting locked up in jail.", "score": 1, "replies": [{"body": "Exactly ,that means deep ITM calls.", "score": 1, "replies": []}]}, {"body": "simple answer is NO cuz , the latter  require less capital and more roi", "score": 1, "replies": []}, {"body": "IMO  any idiot would have known NVDA was going to go up no insider trading is needed  to figure that out", "score": 1, "replies": [{"body": "So naturally you bought 3 year $10 calls on NVDA when it was $30/share right? Mortgaged your house and maxed out all your credit cards to buy a few thousand of those right?? Because any idiot would know that NVDA would rise from $30/share to $900 in 3 years right??? Just LOL at you.", "score": 1, "replies": [{"body": "Hey  idiot here, no one  is their right mind uses all their  networth to  take trade on 1 stock for example all the idiots putting everything they have  into bitcoin. Its not a binary thing.  That how amateur's like you  think , amateurs' only think about  possibility, and gamble based on that , That is  why they buy lotto tickets. Professionals idiots like myself think  \"Probability\". We apportion a small percentage of our trading account to  a high probability trades and scale out  making moderate profits. We then look for the next high probability trade, rinse and repeat . When (not if) the trades don't work, we stop out for  minimal loss. That's the cost of doing business. But  over the long term we make income and build wealth.", "score": 1, "replies": [{"body": "Unless you have inside information, then you don’t care about “probability “ as the trade is essentially a lock.In a case such as this,you leverage up as much as possible.In that case deep ITM calls it is.If you are such a “professional “ you should be able to understand this concept.But OFC when NVDA was $30/share , you already knew it was going parabolic right? I’m hoping at some point you actually have a point,instead of just commenting on a post you didn’t even bother to comprehend.", "score": 1, "replies": [{"body": "Probability  does n require inside information. You are exhibiting amateur's traits . Ie you think every tarde is binary win or lose.\n\nIn once sense yes the tarde either makes a profit or doesn't but you again miss the point.\n\nThat point being if I do 100 trades and on average 70 work out and 30 don't. I use that probability (data)  to  give me an edge I only trade those candidates that have 70% chance of winning. I don't put my entire net worth into  the first tarde , because it has 30% chance of losing  and I'm no longer in the game if the first one goes wrong .  Thus I am not  present to  do another trade because I'm wiped out\n\nBecause I'm still in the game I can now benefit from one of the successful trades making a profit .\n\nBeginner/amateur traders are essentially playing Russian roulette . They have 100% chance of making their account go to zero. They might  have three winners but the first time it goes wrong they  zero out their account\n\nThis is the simplistic difference been amateur's and Professionals\n\nand the reason why  I will be around still trading years later  and you won't be.\n\nHow many times have you zeroed out an account?", "score": 1, "replies": [{"body": "And you are exhibiting traits of someone with very poor reading comprehension,possible dyslexia or perhaps just plain dumb.I’m going to go with just dumb.Who cares what YOU use for data.This discussion was not about how YOU trade.You continue to post about how trading is all about probabilities…no shit Sherlock.My post was not pertaining to regular trading,Instead it was a simple question.How would you trade if probability WASNT A FACTOR.If one could somehow assure that a trade was a winner,how would that change your plan?\n\nAre you just too dumb to comprehend this concept? Or are you going to continue to post nonsense that has nothing to do with the post I made that you replied to,without even understanding the content?", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "We do", "score": 1, "replies": []}]}, {"body": "So you can leverage up your trade without margin.", "score": 1, "replies": []}]}]}, {"body": "Not so true,\nIf you buy deep ITM you mainly do it because of the high intrinsic value and low extrinsic value. Also you don’t realize 100% of the gains like buying the actual 100 shares. The amount you gain depends on the delta of the option and just in some cases it almost approaches 1 which would mean you realize the same gains as owning 100 shares of the underlying whenever the price moves up", "score": 2, "replies": []}]}, {"body": "My understanding is that her husband has been using deep ITM calls as a replacement for shares for many years. I recall an article about it a few years ago.\n\nThe idea that they'd coincidentally know what to buy shortly before it doubles just shows what great stock traders they are.", "score": 96, "replies": [{"body": "Or insider trading", "score": 13, "replies": [{"body": "What?!?! \n\nNo way.", "score": 41, "replies": []}, {"body": "Not defending them in any way, but Paul Pelosi is a successful VC in his own right. If you are in tech and see the trends and have the capital, why wouldn’t you invest in something that you see as having a huge upside?", "score": 10, "replies": [{"body": "I used to work in corporate events in SF. Getting insider information on local companies was just perks of the job. People would get drunk and say something they probably weren’t supposed to or a CEO would say something in a closed door meeting that hadn’t been released to the public yet. \n\nI am not a lawyer or privy to how the SEC pinpoints insider trading but I feel like in a setting like this it would be very hard to figure out. Mr pelosi could have just overheard a sales guy bragging at dinner about blowing his quota out of the water or maybe he heard it from a friend of a friend. \n\nWhen I was working events I was pretty broke but I definitely got some huge tips that would have made me a ton of money if I had the money to invest. Like onetime I found out that a company had exactly 1 year to raise earnings by 10% by any means necessary or it would lose its top 3 investors. Based on the conversation it was clear that it wasn’t a bluff and they made it very clear their intention was to tank the stock. \n\nI set an alert and a year later the stock went from ATH down 40% in one quarter, then damn near ATL within one year. It’s not even a bad company either it’s crept up slow and steady since.", "score": 6, "replies": []}, {"body": "But conspiracy theories are fun.", "score": 7, "replies": [{"body": "When congress people routinely smash the s&p its not a conspiracy theory", "score": 6, "replies": [{"body": "Evidence says otherwise. \n\nhttps://www.sciencedirect.com/science/article/abs/pii/S0047272722000044", "score": 7, "replies": [{"body": "Yeah, people rail about the margins but the median is pretty meh.", "score": 6, "replies": []}]}, {"body": "They dont...this was just studied. They do as poorly as everyone else trying to pick winners. See the science direct study linked below", "score": 1, "replies": []}]}]}, {"body": "Is he the world's greatest investor? The returns sure look that way...", "score": 1, "replies": []}, {"body": "that's fine... however his wife oversees the tech committee", "score": -3, "replies": [{"body": "When Pelosi's husband buys stocks, it's basically her, right? But when supreme court justice Thomas' wife has insane political bias, it's totally separate.", "score": 1, "replies": [{"body": "It’s impossible that he’s totally clueless as to what he’s doing.", "score": 1, "replies": []}]}]}]}, {"body": "Slander, gtfo you regard. /s", "score": 1, "replies": []}]}, {"body": "Her husband is a fool w a hammer. Come on.", "score": 1, "replies": []}]}, {"body": "Pretty standard Deep ITM call.  This is essentially stock replacement strategy.  \n\n\nEach itm call imitates nearly 100 shares to the upside and has some protection to the far down side.\n\n\nThis will cost a little bit of premium but you can hold 100 delta for much less than what 100 shares of NVDA would cost.", "score": 18, "replies": []}, {"body": "Very deep in the money options will act similarly to purchasing stock, but requires less capital", "score": 15, "replies": []}, {"body": "She paid a premium to have the option to buy it for 120$ a share. She had to pay between 1-5mil for the option contracts.", "score": 29, "replies": [{"body": "She did not do anything.\n\nPaul Pelosi was a successful trader decades ago before she was ever elected.\n\nShe has to report his trades since they are still married.\n\nHis previous trades of MSFT, TSLA, RBLX were also deep ITM leaps.\n\nBut correct on the rest of it.", "score": 47, "replies": [{"body": "But this doesn't fit the reddit narrative on the Pelosis?!?!?!", "score": 5, "replies": [{"body": "On behalf of all reddit I will express our opinion: Nancy Pelosi should resign and take responsibility for just the appearance of corruption because of her husband's actions, just like Clarence Thomas should resign from the supreme court because of his wife's obviously corrupt and traitorous actions.", "score": 0, "replies": []}]}]}, {"body": "Ah, I see. $1.85 million in premium, and $600k for the options (if I understand correctly, based on this nasdaq article [https://www.nasdaq.com/articles/nancy-pelosi-husband-$1-million-richer-thanks-to-nvidia-options-but-missed-out-on-earlier-#:\\~:text=Nancy%20Pelosi%20(D%2DCA),20%2C%202024](https://www.nasdaq.com/articles/nancy-pelosi-husband-$1-million-richer-thanks-to-nvidia-options-but-missed-out-on-earlier-#:~:text=Nancy%20Pelosi%20(D%2DCA),20%2C%202024) ).", "score": 4, "replies": [{"body": "Buying options like this is always possible, and the advantage here is because with a call option that is so deep \"in the money\", one of the variables used to calculate it's value, delta, becomes son overwhelmingly dominant on the calculation that the value of the contract increases as a near 1-1 ratio.\n\nMeaning, all other things remaining constant (doesn't happen in practice, but for the sake of this explanation let's roll with it) if you have  a contract with .5 delta, it may increase in value by $50 for every $1 movement in the stock price. However if you are at .99 delta, you gain $99 for every $1 dollar move in the stock price.", "score": 20, "replies": [{"body": "Thank you for this detailed explanation. Its a good thing I don't trade options I guess, I have a lot to learn!", "score": 3, "replies": [{"body": "If I ever think I can’t learn any more about options it’s time to stop trading them because there’s always more to learn", "score": 1, "replies": []}]}, {"body": "You mean 1 to 1.", "score": 4, "replies": [{"body": "I don't think Delta ever reaches 1.0", "score": 1, "replies": [{"body": "It did for me. For msft it was 1 but there was no IV had to sell it off.", "score": 0, "replies": [{"body": "Okay well even if that's true, in my example I make sure to use .99. I don't see a point in squabbling over .01 it doesn't have a material affect on anything. But sure, I guess it can hit 1.0", "score": 3, "replies": [{"body": "Yeah, it won’t make much difference between .99 and 1.0. I just asserted that delta can reach 1", "score": -3, "replies": []}]}, {"body": "I thought delta is only 1 when you literally own the share.", "score": 3, "replies": [{"body": "I read somewhere if option is so deep ITM, it might behave like you own the shares. Not sure where I read it.", "score": 3, "replies": [{"body": "I'm reading the Passarelli book now and he definitely mentions that in a few places. In detailing one of the trading examples for long calls: \"If this were a deeper ITM call, the delta would start out even higher, closer to 1.00, and the other relevant greeks would be closer to zero. The deeper ITM a call, the more it acts like the stock and the less its option characteristics (greeks) come into play.\"", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Why would it be an advantage to remove all leverage? Why not just buy the stock at that point?", "score": 1, "replies": [{"body": "It requires less cash and you get the full benefit of the move, plus protection if things go against you in the short term", "score": 3, "replies": [{"body": "Mathing here, she paid 1.2M for a strike at 120. Simply buying the stock would only cost 80k at 800. It definitely isn't a cash saver. Is this a play looking for a stock drop, with a hedge of being able to buy at 120 if delta doesn't go up?", "score": -6, "replies": [{"body": "Yeah but she bought 50 contracts so actually woulda been $4 million to buy outright.", "score": 11, "replies": [{"body": "Numbers matter.", "score": 5, "replies": []}]}, {"body": "She bought 50 contracts for 1.2 million. That's like having 50*100 shares, or 5000.\n\nIf you did theath and it would have cost her 80k to buy 100 shares at 800 (btw, the stock was in the 600s when she bought), that would be 80k x 50, or $4 million. So she reaps the benefit of a 4mil position while only deploying 1.2 mil of capital.\n\nShe's not a dummy. Trust me, she didn't make a mistake lol", "score": 7, "replies": [{"body": "Nobody said she did. I was trying to figure out what the purpose was of the ITM option, and make sense of what people are saying.", "score": 1, "replies": [{"body": "Sorry, I confused \"is this\" with **\"this is\"**. Reading top fast and that's on me. Sorry about that.\n\nSo the purpose of buying deep itm in this case isnto deploy only about 30% of the capital you would originally need to purchase 5000 shares of NVDA, but capture 95+% of benefit of owning shares.\n\nThe deeper ITM the option goes, the higher the delta becomes. You can think of Delta as a flat rate of change in the option premium. So all else being equal (impossible, but let's just say), a .5 delta call option gains $50 for every one dollar move in the underlying (you get HALF the benefit of owning 100 shares). As the option goes deeper in the money, delta rises. At a .9 delta youale $90 per dollar of gain in the underlying, or $90.\n\nTo bring this all home, basically she spent 1.2 mil for the right (but not the obligation) to live as if she has a 4mil position until January of 2025, with the obvious benefit of being able to cash out whenever she wants if she thinks it prudent and sell those contracts to someone else.", "score": 2, "replies": [{"body": "Thank you! I appreciate it!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Because delta can change, especially when volatility increases ", "score": 4, "replies": [{"body": "So you're basically just waiting for some sort of drastic move at that point?", "score": 1, "replies": [{"body": "Deep in the money options tend to behave similar to stock movements, with the caveat that there could be much higher expected returns (or less) if changes to expected volatility. \n\nAt the expense of paying some premiums over just owning stocks.", "score": 3, "replies": []}]}]}, {"body": "She's not removing the leverage. She's capturing as much of it as possible.\n\nSay you're racing in a car that has five knobs on your dash that controlled speed, and the higher they went the faster the car would go, and you had no control over the knobs movements. Well, if you had the ability to max one of the knobs out, that by default maximizes one of the variables, this causing an absolute gain in average speed.\n\nHow much is irrelevant, I'm just stating it's an advantage for sure, any increases to gamma or IV benefit her more than you because her \"delta\" knob is maxed at all times.\n\nPlus, the position in shares would have cost 4 mil dollars, but she only had to deploy 1.2 million. So your car needs to stop every 10 laps for fuel, and hers weighs the same as yours, has a higher average speed, and she only needs to stop every 38 laps. She's got a tactical, unilateral advantage on 99% of the other racers.", "score": 4, "replies": []}, {"body": "you don't remove all the leverage.  a deep ITM option, you remove about half the leverage.  \n\nyou \"get to buy the stock\", for about a 50% discount.", "score": 3, "replies": [{"body": "it's not a discount.  You are paying interest to the options market instead of to a broker.  That's like saying buying a house with a mortgage is \"getting a discount\"", "score": 3, "replies": []}]}, {"body": "It makes more sense if you graph it with a tool like options profit calculator. If the stock moves 10% by December, it is probably about equivalent to owning the stock. However, if the stock goes up 100% the call may have more like a 150% return. \nThe deeper in the money the call when you buy it, the more comparable to just owning the stock the return is. But the call should always have a higher upside for positive movement. If your stance is bullish, calls r bettah", "score": 1, "replies": []}, {"body": "Nancy’s PANW deep in the money call for next January went down 2.48% today when the underlying stock went down 0.98%.    Options let you get access to more of a stock’s movement for less upfront money than buying 100 shares.  So had it gone up today 1% she could have made 3% gains.  With far less money at risk than 100 shares worth.    \n\nHowever the down side is it expires next January so if the stock isn’t over $330 ($200 strike with $130 premium) she loses all her money (unless she sells early) where holding shares can go on forever.", "score": 1, "replies": [{"body": "She doesnt lose all her money if it’s not 330.\nShe loses all her money if it’s below 200.", "score": 1, "replies": [{"body": "True. I was typing fast.  She will lose money under $330. Because she paid so much for the option.  But it will still have some value down to the strike price.", "score": 2, "replies": []}]}]}]}]}, {"body": "> $1.85 million in premium, and **$600k for the options**\n\nWhere are you getting $600k from?", "score": 1, "replies": []}]}]}, {"body": "You can even buy. $5 strike if you wish", "score": 9, "replies": [{"body": "Unlikely there’s any volume 🤣 unless your friend sells to open that contract, not a chance anyone is selling it", "score": 0, "replies": [{"body": "The best  ITM to buy is a delta of about .90  of course has to be at least a year  til exp", "score": 2, "replies": [{"body": "I agree - I did that before COVID was 90 % down on all of them … by the time their expiry came, I was somehow up 500 % at least… \n\nMastercard \nMicrosoft \nTesla \nCostco \nAMD", "score": 1, "replies": []}]}, {"body": "Would you sell a $20 bill for $21 dollars?\n\nWhat you’re really telling people is that there’s not a chance anyone would be willing to sell a $20 bill for $21.", "score": 1, "replies": []}]}]}, {"body": "hey dude when you check out the greeks, you'll see how options can be there for you to enhance strategies. she probably had a very high delta which meant from the start, she was going to get better gains as the stock rose.\n\nis that her only trade for this part of her strategy? im not going to look it up, but were there any other stock or options trade on or around that time? i don't really trade options alone unless it's 2018 and im repeating spy calls with vix hedges lol.\n\nread up about the greeks", "score": 7, "replies": [{"body": "\"she\" is Mr Pelosi btw", "score": 1, "replies": []}]}, {"body": "70 comments so far, but nobody has provided any math, so here it is.  Using TOS OnDemand, on Nov 22, 2023 NVDA high was 503, L 476.  The volume for this option went from 0 to 45 between 12:30-12:45.  So, assuming that was part of his trade, here's some numbers.\n\nAT Nov 22, 2023, 12:45, NVDA=$489: for the Dec 2024 $120C, extrinsic= $8.76, mark=$376.2  bid/ask $373.75/$378.55.  Delta = 1.00.\n\nYou can buy a stock and own it or your can buy a DITM call and \"rent\" it.  The cost of that rent is the extrinsic $8.76.  There's roughly 13 months to extrinsic, so the monthly rent is approx $8.76/13 = $0.67 per month.  \n\nIf  you bought the stock directly at $489 and NVDA goes up $100, then you're gain is $100/$489 = \\~+20%.  Buying the option $100/$376= \\~+26% - so a little bit of leverage, but not too crazy.  \n\nAt any time, can sell the call to cash out, or wait until expiration.  At expiration, rent comes due.   The call buyer needs to make a decision, sell & cash out or exercise and take ownership of the stock by ponying up $120.\n\nIf NVDA stays at \\~$850, exercising means this: $120+$376=$496 with an unrealized  gain of $355.  Selling the call should also yield a profit close to $355 because at expiration, extrinsic (ie time value should be cloe to zero).\n\nLet me know if I've made any mistakes, just an amateur at this.", "score": 12, "replies": []}, {"body": "It’s called leverage", "score": 5, "replies": []}, {"body": "Stop performance chasing, senators like Nancy Pelosi only have to report their trades 45 days after they made them. For all we know she could've sold out for a tidy profit a long time ago and we won't know until 45 days AFTER she sold.", "score": 4, "replies": []}, {"body": "why are you confused? or are you trolling?\n\ntheres no rule saying you can only buy OTM call options ...", "score": 3, "replies": []}, {"body": "Any time you're wondering what to do about a trade just ask yourself, What would Nancy do? Works every time.", "score": 3, "replies": []}, {"body": "Investopedia is your friend.", "score": 2, "replies": []}, {"body": "This is the gist of it. \n\nBuying deep ITM calls gives him more shares than if he were to buy the shares at the current stock price. Provided there is not much movement in the stock price to the downside, he is pretty much guaranteed the stocks at the strike price. He can then sell covered covered calls to make money on the premiums.", "score": 2, "replies": [{"body": "How do you sell covered calls if you don’t own the shares? And wouldn’t volume be really low on those calls?", "score": 1, "replies": [{"body": "Research option DIAGONALS for your answer on how to sell CC of shares you don't own.  Good strategy to use if you buy ITM calls.", "score": 1, "replies": []}, {"body": "You can sell calls at any time if you have margin in your account", "score": 1, "replies": []}]}]}, {"body": "I do this often. Right now I have a number of AAL 11C for Aug 16. When they hit 50% profit (cash on cash), I bought ATM puts a few weeks out, which makes these a no lose play at this point. Neutral strangle of sorts.\n\nI try to buy these about 6-8 months out and not spend more than 20-25% of the stock price on the options, unless I feel really strongly it’s way oversold or has a move up coming. \n\nI always set a stop loss of -30%. The options can be worthless if you don’t get a move or wait too long.", "score": 2, "replies": []}, {"body": "She buy deep ITM call options with high delta fro selling them for an higher premium in the short term when she knows inside informations. In this way she has more liquidity to buy other calls when other better insider opportunities occur to her", "score": 2, "replies": []}, {"body": "Options have built in leverage. A good estimate of that leverage is using the delta as a “stock replacement” ie an .85 delta call is approximately the same as buying 85 shares. See how the price of the call compares to the price of the share equivalent and that is your approximate leverage. \n\nIf you buy at a time when the stock has a low IVR (volatility ranking against it’s own 1 year history) then anytime vol increases you get that kicker as well. \n\nThe gotcha is theta. On long dated calls however this isn’t much concern.", "score": 2, "replies": []}, {"body": "Cheaper and more leveraged also Downside protection, there called leaps very good thing to buy if you know the stock will keep on its path.", "score": 2, "replies": []}, {"body": "OP have you never heard of DITM? Jesus this place is ducking regarded.", "score": 2, "replies": [{"body": "90% of the posters here  have nil  clue how options  work its hilarious", "score": 1, "replies": []}]}, {"body": "I think you belong on WSB with the other regards.", "score": 4, "replies": []}, {"body": "Follow", "score": 1, "replies": []}, {"body": "OP, have you seen an option chain before? Hell, you can buy a $5 strike at open tomorrow if you want to...you're going to have to pay for it but you can if you want to.", "score": 1, "replies": []}, {"body": "Simple. You don't know what short position she may have had in addition to the long call. People assume they know what her trade was but they don't. There is no way to know exactly the trade or trade thesis.", "score": 1, "replies": [{"body": "true but its unlikely  they have another position on NVDA and they would have to disclose  another position as well , might have to go back and see all their trades over the years and figure that out though", "score": 1, "replies": [{"body": "I don't think you need to disclose short option positions so if it was part of a spread you would not know it.", "score": 1, "replies": [{"body": "I dunno, does anyone really know? and even so, its not important . We can only control ourselves", "score": 1, "replies": [{"body": "It would be important in that if it's part of a spread the trade thesis could be totally different. Maybe it's not even a bullish trade.", "score": 1, "replies": []}]}]}]}]}, {"body": "Selling PMCCs", "score": 1, "replies": []}, {"body": "You can buy them today you just have to pay the premium.   I want to know how she knew to invest in NVDA", "score": 1, "replies": []}, {"body": "Doing this simply creates a small amount of leverage. \n\nInstead of owning 5000 shares at 487 -> $ 2,430,000\nShe'll invest 50 * 100 *  350 -> $ 1,810,000\n\nThe option position has a delta close to 1. Probably 0.9. this means that for every euro the price goes up. She'll make 0.90 per share. But because she's lowered her costprice, the return in percentages has actually gone up.\n\nLet's say the stock rises to 700.\n\n5000*700 -> 3,500,000 a return of 41%\n\n5000* (700 - 125) -> 3,375,000 a return of 75% (approximation)", "score": 1, "replies": []}, {"body": "If the option is more than a year off doesn't that save on the tax bill?", "score": 1, "replies": [{"body": "no , it depend how soon he takes profit after the original trade (the wash rule is 30- 60 days ) I doubt that  is in play  , we also don't know it was done in tax free acct  like a ROTH IRA  or not", "score": 1, "replies": []}]}, {"body": "Cheating the system", "score": 1, "replies": []}, {"body": "You pay a bigger premium for a stock option that's deep in the money.    Look at an option chain.", "score": 1, "replies": [{"body": "yes you do  but the intent is to  cash the profit after a few months , so it is a wash", "score": 1, "replies": []}]}, {"body": "BDITM: Balls Deep in the Money???", "score": 1, "replies": []}, {"body": "Long dated ITM options are more expensive that OTM options but they have much less Theta decay, meaning that they don't decline in value from the simple passage of time, as OTM or ATM options tend to do. All options decline in value simply from the passing of time if nothing else changes, but long dated, deep ITM options do so at a much slower pace, which makes them ideal for a longer term directional position.", "score": 1, "replies": [{"body": "finally someone who actually understands the diff between ITM ATM and OTM", "score": 1, "replies": []}]}, {"body": "You got the year wrong. She bought it back in 2022 Nov, when NVDA was around 150. She bought 2 years LEAPs, 120 strike for 60 bucks. It went over 700 yesterday.\n\nThat was an 12 times bagger for her.", "score": 1, "replies": []}, {"body": "It’s a leveraged way to buy the stock. Why pay for margin costs in these interest rate environments when u can buy deep itm options that are essentially the same things as shares with no margin? Its not really an options trade at that point it’s just buying levered shares", "score": 1, "replies": []}, {"body": "optiones financerase llamas  .pasa igual con las otras companias .etf y comodity", "score": 1, "replies": []}, {"body": "ITM options cost more. A lot more sometimes. I did 19p on rivn before it fell 25 pct… when it was 14 a share… went to 10. I paid a lot more than a 12p would have cost, but profit is profit.", "score": 1, "replies": []}, {"body": "This is a Johnny play to own stock cheaper.  Options that far in the money act like 100 shares, but cost less to control.", "score": 1, "replies": []}, {"body": "No one here even suggests that maybe she doesn't want to lose all those millions if it should fall OTM", "score": 1, "replies": []}, {"body": "I heard she is stacking palo alto calls or smng … someone published a sec filing here on reddit", "score": 1, "replies": []}, {"body": "It's almost like people who actually make money off options invest in them, and those who just gamble lose.", "score": 1, "replies": []}, {"body": "If you think a stock is going to go up with high probablility in the money option contracts can be better and allow you to own the same say 100 shares exposure but require you to spend a lot less right now to buy those.", "score": 1, "replies": []}, {"body": "The real question is what AI engine lets you generate stock charts on pols", "score": 1, "replies": []}, {"body": "She clicked on the ASK then confirmed the trade.", "score": 1, "replies": []}, {"body": "Deep ITM usually means less extrinsic value, I do this often as an alternative to shelling out the full stock price, and obtain myself some downward cushion while I’m at it. And then there’s liquidity, spreads, hedging of course. \n\n…or, she’s acting on the latest memo from the Jews (they meet on Tuesdays in CBOE’s old open-outcry floor to exchange gentile children and trading ideas)", "score": 1, "replies": []}, {"body": "Its called buying deep iTM calls , its like owning the stock on the cheap , because the option move almost $1 for  each  $1 rise  of  the stock. It a way of owning the stock but for much less money. You must buy them with at least 6 months  until exp so that any decay is reduced. Generally they buy them with a year to exp. You then sell them at a profit a long time before they expire", "score": 1, "replies": []}, {"body": "How? you go to the option chain select  120 Calls a year out and buy them , its easy\n\nthen when the price of NVDA goes up a  few 100 points  sell them back to the market a month or 3 or 5 later for  a huge ROI", "score": 1, "replies": []}, {"body": "She wasn’t hedging you fucking idiot she’s buying and the money lose less value overtime she doesn’t care about making more. She wanted to capture the move instead of using cash she used options.", "score": 1, "replies": []}, {"body": "She got a stock tip from a guy with a hammer", "score": 1, "replies": []}, {"body": "Easily done. It’s almost the same as buying the stock outright. You buy the options deep in the money and pay extra for the intrinsic value part of the premium.", "score": 1, "replies": []}, {"body": "Anyone with the money can buy a $1 strike price on any stock", "score": 0, "replies": []}, {"body": "Everyone accepts that Nancy is basically on the same page with Paul's actions. But if we apply the same standard to Clarence Thomas and his wife's insane political donations and bias, all of a sudden, conservative traitors are like, oh no, they are just married, they keep it separate!", "score": 0, "replies": []}]}
{"title": "Another week in the green and it will be S&P longest run since 1964. Anyone else nervous about all the optimism built in?", "selftext": "I have seen this environment before. Reminds me of February 2020. Everything was perfect, record low unemployment, booming, overextended market...then we all know what happened next. December 2021...booming market, best year since 1995, cheap money sloshing around...then we all know what happened next.\n\nEverything just seems incredibly bullish and everyone wants to get in. That's a worrying sign. Usually big pullbacks come when you don't expect them. I definitely think we're due pullback.", "id": "1b6xk8v", "created_utc": 1709616633.0, "score": 372, "upvote_ratio": 0.87, "num_comments": 231, "comments": [{"body": ">Usually big pullbacks come when you don't expect them. I definitely think we're due pullback.\n\n\"Pullbacks come when you don't expect them\" says man who expects pullback.", "score": 703, "replies": [{"body": "[deleted]", "score": 269, "replies": [{"body": "That’s the secret I’m always expecting a pullback lol. But I’m just a dumb dca guy I’ll nibble on the highs and the lows", "score": 25, "replies": [{"body": "Yup. Im not usually an optimistic person but during a pullback I buy buy buy well sometimes i buy too much too quickly before the pullback hits near the bottom. But i get your point to just nibble away. Im a boring investor after all 🤣", "score": 9, "replies": [{"body": "lol you’re describing me perfectly. I bought during the dip which later became a small initial part of a deep cliff. When I sell it out of panic, the stock rocketed back to ATH. 😂", "score": 2, "replies": [{"body": "I'm pretty good at not selling, it's the timing of the buying im not always great at, however.", "score": 3, "replies": [{"body": "Good for you. Pretty sure you have made a lot of money if you have the courage to hold.", "score": 1, "replies": []}]}]}]}]}, {"body": "Happy Cake Day Dard!", "score": 1, "replies": []}]}, {"body": "Y u not predict covid? R u stoopid?", "score": 24, "replies": [{"body": "Didn’t have to predict COVID, just that COVID lockdowns would spread from China to USA\nAnd down the market, and I guess predict the bailout from the fed would come with no remorse since it was a health crisis so no retracing the bottom just straight up", "score": 1, "replies": []}]}, {"body": "Bullish", "score": 2, "replies": []}, {"body": "well, he was right. lol", "score": 1, "replies": []}, {"body": "Also applies to uncircumcised men.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "People were making posts like this for the entire bull run from like 2012 to 2020, convinced that everyone was in a mania and a crash must be coming. Missed out on years of gains.\n\nI'm not saying there definitely won't be a crash, but in the now cliche but true words of Peter Lynch, Far more money has been lost by investors in preparing for corrections, or anticipating corrections, than has been lost in the corrections themselves", "score": 13, "replies": []}]}]}, {"body": "A correction is just a buying opportunity", "score": 151, "replies": [{"body": "“But the dip, pussy” - Warren Buffet", "score": 34, "replies": [{"body": "*You* but the dip.", "score": 4, "replies": []}]}, {"body": "Fax", "score": -3, "replies": []}]}, {"body": "Just look at 1998-1999.  Everyone is expecting the feds to cut rates which will lead to the same exact parabolic rise and decline.", "score": 56, "replies": [{"body": "I agree, and my belief is on market sentiment not patient enough for the business cycle.  If interest rate changes take 12-18 months to fully integrate into the economy we are only seeing the effects of rates between 2.75 and 4.75%.   \n\n\nThe current market psychology was a 2022 sell off in anticipation of economic slowing, and now we are rallying because things are still good but we aren't even close to being out of the woods yet. My guess is previous hiking cycles were probably similar based on the charts without having lived through them. It's likely 5.5% rates won't impact the economy fully until Q4 of this year but at that point we will be in a cutting cycle so who knows how the market will react by then", "score": 19, "replies": [{"body": "Yea i think so too. No matter how many times people say past performances dont affect future performances, its crazy how cyclical stock market is. \nIf we look at interest rate vs general stock market correlation, we’re still lagging behind.", "score": 5, "replies": [{"body": "Interesting could you elaborate this point bit more", "score": 1, "replies": []}]}, {"body": "Rental foreclosures are going up, even on multi-family units. I think right now, we are in early 2007, pretty soon, we will hit 2008 levels.", "score": 11, "replies": [{"body": "Record amount of retail investors.  Raised interest rate.  High inflation.  Institutions going bankrupt forcing feds to cut rates even when inflation was still running hot. \n\nWhen this happened in 1998 there was 120% upside followed by 80% downside and years of stagnation.\n\nWill it happen again?\n\nIf they prematurely lower rates it is almost a guarantee.\n\nIt is almost a guarantee they will prematurely lower rates.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Commercial real estate is already collapsing.", "score": 6, "replies": [{"body": "CRE isn't really collapsing, it's a handful of overleveraged/vacant office properties that are struggling. But the majority of CRE is doing very well. The Collapse of CRE is mostly just in the media.", "score": 4, "replies": [{"body": "I don't think the CRE card has played out yet. Office is definitely showing signs of trouble. Lots of Multi family projects bought at compressed cap rates no longer pencil. Industrial in my area is way overbuilt, and developers are starting to pump the brakes.", "score": 1, "replies": [{"body": "I can't speak for the private market because the data isn't public, but looking at publicly traded REITs, almost all of them have very strong cash flows, even office REITs.", "score": 1, "replies": []}]}]}]}, {"body": "I just don’t see how it happens this time around. Too many people waiting for it with cash on the sidelines and limited supply. Too many people with 3% mortgages where a monthly payment is cheaper than comparable rent. Even if it gets bad, there is such an imbalance of supply and demand I don’t see a crash in any desirable markets.", "score": 5, "replies": []}, {"body": "Maybe not 2008 levels but maybe close. There is so much money going into wall street and pretty soon the increased interest rates will finally start to hit the economy.", "score": 3, "replies": []}, {"body": "No, there isn't enough inventory for it to happen.", "score": 2, "replies": []}]}, {"body": "Based on what data?", "score": 1, "replies": []}]}]}]}, {"body": "Election year --> to the moon (unless the mainstream media REALLY wants Biden to lose)\n\nMainstream media controls the narrative. Do you really think they will want to spread recession fears just before the election? That's like helping Trump win if the economy is in bad shape.", "score": 18, "replies": []}, {"body": "I agree. I'm not saying it can't and shouldn't go higher, but the RATE at which it climbed over the last few months, is faster than any other consecutive months I can find elsewhere in S&P's history.\n\n\n If you look at the graphs, that inclination is absolutely bonkers, it's gone more vertical than the COVID recovery, and the months that followed when money was flowing for free leftt and right.\n\n\nI think a correction is coming because this steep climb needs to be flushed out if it wants to continue.", "score": 162, "replies": [{"body": "Really?  I'd have thought that was 2020.  Or 1999\n\nEDIT:\n\nWinner winner!  Going off SPY data (so 1993ish)\n\n1. March 2020 - August 2020, 35.5%\n2. February 2009 - July 2009, 33.7%\n3. August 1998 - January 1999, 33.0%\n4. March 2009 - August 2009, 28.9%\n5. **October 2023 - March 2024, 22.5%**\n6. August 2010 - January 2011, 22.2%\n\nSo, definitely fast but not remotely close to fastest.", "score": 161, "replies": [{"body": "Something else to consider is that we recently broke ATH from 3 years ago.  We haven’t gone 25% over the ATH, just caught up to where we were previously.", "score": 43, "replies": [{"body": "People always take price movements out of context. Of course it’s the longest climb since 1964, when the market suffered a huge fall following the worst pandemic since 1917…", "score": 19, "replies": [{"body": "Not to mention huge inflation during recent times, which would reduce the dollar value of the stocks' sticker prices.", "score": 5, "replies": [{"body": "Ok, but what about on the other side - namely discounting and time value of money, which would move share prices ***down***…..?", "score": 1, "replies": [{"body": "The way I understand the time value of money is more philosophical than financial. Like, I'd rather have the same sum of money (even accounting for inflation) 15 years ago because it can be invested and earn money during that time. But that has more to do with the individual investor than larger scale items like a stock price.\n\nNot sure what you mean about discounting.", "score": 1, "replies": []}]}]}]}, {"body": "The ATHs from 3 years ago weren't healthy highs though.  It was peak mania, not a slow 10 year climb supported by rising fundamentals.  Not really a good bar.", "score": 7, "replies": []}, {"body": "We break ATH all the time. That’s how compounding works my dude.", "score": 6, "replies": []}, {"body": "TO be fair, \\#3 on their list is the only other example that wasn't a recovery, and it was followed by one of the largest crashes in stock market history.", "score": 1, "replies": []}]}, {"body": "Outside of the 1998 and 2010, the rests were from bear market bottoms (from dropping 36% to 55%). Also you double counted 2 and 4.\n\nAug 2010 was when Fed started doing 2nd round QE I believe. Aug 1998 I'm not sure but probably recover from some overseas econ collapse. These were all recovery from bear markets. Our 2023 run up recovered from a mere 10% correction.", "score": 25, "replies": []}, {"body": "To be fair we aren’t coming off a bear market low.", "score": 3, "replies": []}, {"body": "5th in the recorded history is definitely close to the top.", "score": 19, "replies": [{"body": "No one disagrees with that, but OP was claiming this period was the fastest, which it objectively is not.", "score": 38, "replies": []}, {"body": "5th since 1993.", "score": 7, "replies": []}, {"body": "> recorded history\n\nSince 1993...", "score": 6, "replies": [{"body": "Oops. Didn't catch that, thought he was looking at the historical S&P500 data.", "score": 1, "replies": []}]}]}, {"body": "Did the GFC that started in 2008 only last a year?", "score": 1, "replies": [{"body": "No. It’s just that the 35% rise came after a 57% crash. So after that you were still down 40% from the previous high.", "score": 3, "replies": []}, {"body": "To me, I view that period more as the 2nd, and finishing bear market within a longer term secular bear market that started with .com. \n\nAlthough I suppose you can probably say that bear market was about 17-18 months or so.", "score": 3, "replies": []}]}, {"body": "So you say not remotely and then it is number 5 on the list. I don’t think you know what the word remotely means", "score": -2, "replies": [{"body": "Remotely 13% from the fastest", "score": 7, "replies": [{"body": "In percentage that’s right but the way it is ordered it is the 5th steepest run", "score": -2, "replies": [{"body": "The steepest run is 58% steeper.  So... yeah, not remotely close.  If #1 was 25% rather than over 35%, then close.", "score": 3, "replies": [{"body": "I think I have learned my lesson not to argue semantics in this sub.\n\nIt is not the top run but it is also not remote from the top run.. map out towards all runs and you will see that it is in a top percentile of run series.\n\nIn absolutely terms, the performance might be 58% away from the top run. But considering all, that is not a light year away", "score": 1, "replies": [{"body": ">I have learned my lesson not to argue semantics in this sub.\n\n*Proceeds to argue semantics harder", "score": 5, "replies": [{"body": "He learned the lesson.  And then quickly unlearned the lesson, just in time to type a new paragraph.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "We barely are back at levels from 3 years ago.", "score": 10, "replies": []}, {"body": "lmao you do realize that the inclination is completely scewed, right? You can't look at a linear chart and draw conclusions from it across longer time frames. Look at a log graph.", "score": 3, "replies": []}, {"body": "We broke out of a 2 decade resistance on the S&P. Look at the S&P adjusted for m2.", "score": 1, "replies": []}, {"body": "It is going up too fast so people should stop buying? It needs to flush out because…you think it does? Much much higher than you could even imagine.", "score": 2, "replies": []}, {"body": "110% agree", "score": -2, "replies": []}]}, {"body": "if this is 2020 all over again, a short dip with an insane bullrun is what’s ahead of us.       \nI‘m not overly bullish but if 2020 is the worst case i should load up big time lol", "score": 67, "replies": [{"body": "There’s no macroeconomic reason for a 2020 bull run, rates aren’t cheap and the Fed isn’t printing. It’s AI mania still but that hype will run out eventually, mabye soon.", "score": 67, "replies": [{"body": ">It’s AI mania still but that hype will run out eventually, mabye soon.\n\nThe number of people talking like they're AI experts and are completely sure AI will change the way they work in the short term (<1 year) makes me concerned.\n\nDoes it become a bubble? Maybe, but it's impossible to tell.\n\nCompanies like NVDA do have strong earnings but they need to continue insane growth (without competition) to justify it. Semiconductors are highly cyclical, so I don't think continued strength is guaranteed.", "score": 44, "replies": [{"body": "NVDAs forward PE is under 30.  That's not cheap but they'd have to flatline growth for that to be unreasonable", "score": 30, "replies": [{"body": "The concern I have is that semiconductors, as an industry, are notoriously cyclical. If NVDA starts having an earning decrease in a few years, that could be very painful for a lot of people.", "score": 13, "replies": [{"body": "Semiconductors aren’t cyclical anymore. \n\nhttps://www.forbes.com/sites/greatspeculations/2022/08/25/are-semiconductors-really-that-cyclical/?sh=23b36fc4d747", "score": 8, "replies": []}, {"body": "In a few years, but who knows? NVDA already said in their E.R they have back-orders for 5 years, and will likely be beating, and raising for the next 5 years.", "score": 8, "replies": [{"body": "The bigger issue I see is competitors like AMD stepping in and making the GPU market more competitive.\n\nCUDA is not a big moat.", "score": 4, "replies": [{"body": "Did you listen to nvda ER call?\n\nJensen also said he's diversifying nvda. Not only to sell chips, but softwares, service, hardware as well. In gist he's trying to copy appl eco system and make it hard to leave.\n\nYes, their is competition but AMD is playing catch up. According to people working on AI, say Cuda is a huge moat", "score": 9, "replies": []}]}]}]}, {"body": "> they'd have to flatline growth for that to be unreasonable\n\nNo, their growth just needs to be a bit slow than the estimates.", "score": 4, "replies": []}]}, {"body": "Think people are also tying their carts to AI stock in case it does fuck up the future too, it’s a hedge against job displacement for some…like short term you’re making money but if shit delivers like it could (unlikely) you at least have a piece of the future if you lose your main gig. ", "score": 3, "replies": []}]}, {"body": "Why is it mania when e.g. NVDA's PE is actually in normal range?", "score": 6, "replies": []}, {"body": "There's no reason for a crash either though. Everything is humming along just fine, even at today's interest rates. It means growth prospects are good and even great should rates drop even a little.", "score": 2, "replies": []}, {"body": "You are going to be so rekt and miss out on life changing money because you want your gains…slower?", "score": -1, "replies": [{"body": "So excluding SMCI or NVDA or suff that's already run up 10x, what would you invest in at *current prices*  for life-changing money?", "score": 14, "replies": [{"body": "Still NVDA. Room to run. Check the stock price in 5 years 👍🏽", "score": 2, "replies": []}, {"body": "All in META. You really don’t need anything else. Easy 5X from here", "score": 1, "replies": []}, {"body": "[deleted]", "score": -5, "replies": [{"body": "Possibly Japan", "score": 2, "replies": []}]}]}, {"body": "Top confirmed", "score": 2, "replies": [{"body": "LMFAO this is going to age terribly. RemindMe! 1 year", "score": 2, "replies": [{"body": "I will be messaging you in 1 year on [**2025-03-06 02:40:48 UTC**](http://www.wolframalpha.com/input/?i=2025-03-06%2002:40:48%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1b6xk8v/another_week_in_the_green_and_it_will_be_sp/ktjwjxe/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1b6xk8v%2Fanother_week_in_the_green_and_it_will_be_sp%2Fktjwjxe%2F%5D%0A%0ARemindMe%21%202025-03-06%2002%3A40%3A48%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201b6xk8v)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "Top double confirmed", "score": 0, "replies": [{"body": "RemindMe! 3 months", "score": 1, "replies": []}, {"body": "Still sidelined?", "score": 1, "replies": []}, {"body": "How u feelin bro", "score": 1, "replies": [{"body": "Feeling great, how’s your META pick going?", "score": 1, "replies": [{"body": "Excellent. All buttered up for the next move 🚀", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "If it's 2020 all over again we need a *black swan event* like a global pandemic. And unless OP is nostradamus then using tht year to support his \"predictions\" is plain dumb.\n\n\n\nJust because lines on a chart look similar doesn't mean the *current macro economic trends and world events* line up in a similar manner.", "score": 6, "replies": [{"body": "Yup, 100%. The financial issues we’ve been experiencing over the past 4 years have nearly all been because of Covid or the War. Of course there’s also natural disasters doing some shit, and ships getting stuck in channels, but unless we expect a war or a pandemic again, 2024 is not comparable to dec 21 or february 20", "score": 1, "replies": []}]}, {"body": "The odds that we get another 2020 like crash are not likely unless some bank other than NYCB is lurking post-BTFP expiration. \n\nThings that probably should be looked for is stuff that is semi related to the way we topped out in late 2021 instead, stuff like maybe the Nasdaq drops a bit and then chops around for a while, or AAPL/GOOGL showing signs of having set more perma-tops just for the time being over the next 4-6 weeks (NFLX and AMZN topped early).", "score": 2, "replies": []}, {"body": "That's what I'm saying, there'll likely be a pullback. But not a 2020-qe on-steroids bull run after.", "score": 1, "replies": []}]}, {"body": "And yet from Dec 2021 - Dec 2023 the market went one of the longest spans of time without a new all time high since 1927. Was that not a worrying sign for you? Would you rather we remain flat for another year or just recover and get it over with? \n\nMy theory is for two years everyone thought we would have a recession then with every new month data would come out saying that the market is resilient. Once people realized that there is more money to be made in the market than a money market fund, all the capital came rushing back in. Instead of being a fear-monger why not just celebrate the fact that we aren’t in a flat period anymore?", "score": 13, "replies": []}, {"body": "Inflation arguably means prices of equities should go up since they are measured in dollars. We are also heading into a lower interest rate environment which will pump financials and companies with a higher debt load\n\n\nIs that a guarantee? No. \n\nIs it plausible? Yes", "score": 5, "replies": [{"body": "Ever see the dows performance from ‘68 to ‘82?", "score": 1, "replies": []}]}, {"body": "Banks failing. Layoffs everywhere. US Debt all time record. Yield curve uninverting. Inflation cooled but any rate cut will make it go back up. Wage disparity all time high. CEOs selling stock at 140x higher rate than the previous high in the history of the world. But stock market only goes up so none of it matters", "score": 74, "replies": [{"body": "US debt is ALWAYS at an all-time high.", "score": 70, "replies": [{"body": "Whether they know it or not, most people mean deficit when they say that. $1T every 100 days is nothing to scoff at", "score": 7, "replies": [{"body": "If that's what they meant, it would be wrong, as [2020 & 2021](https://fiscaldata.treasury.gov/americas-finance-guide/national-deficit/) were higher.", "score": 6, "replies": []}]}]}, {"body": "Layoffs aren’t high at all compared to years prior.\n\nStop fear-mongering and find some facts", "score": 75, "replies": [{"body": "Facts are nerds. This is a vibes-based sub.", "score": 24, "replies": [{"body": "They all dream.of a crash so they can invest their 1000 dollars of life savings lol.", "score": 5, "replies": []}]}, {"body": "\"... There’s something wrong with previous U.S. jobs reports.\r  \nThe government quietly erased 439,000 jobs through November 2023, a closer look at the numbers from the Bureau of Labor Statistics shows. \r  \nThat means its initial jobs results were inflated by 439,000 positions, and the job market is not as healthy as the government suggests. \r  \nSince the government wiped out 439,000 jobs after the fact, the total percentage of jobs created by the government last year is even higher. Increased government hiring has been driving the jobs numbers higher...\" (Fox News, 1/7/24)", "score": 4, "replies": [{"body": "Yet there were still millions of jobs added in 2023.", "score": 2, "replies": []}]}, {"body": "But if businesses were as fantastic as the highs, why all the layoffs? Why don't they try new things with new hire?", "score": 2, "replies": [{"body": "Because certain corporations want not to juice profits for shareholders. Not that complicated.", "score": 1, "replies": []}, {"body": "So when there’s a good economy, there should be 0 layoffs? 😂\n\nNo, you need to compare vs. previous years. Layoffs always increases your net margins.", "score": 0, "replies": []}]}]}, {"body": "> Wage disparity all time high. \n\nThis is why stocks are going up. \n\nMost people don’t invest in the stock market. Those that do are getting a larger and larger share of the pie. Therefore more to invest. ", "score": 6, "replies": []}, {"body": "Yeah but.... AI.", "score": 36, "replies": [{"body": "If we succeed in AI and especially building AGI, shouldn’t the stock market actually collapse completely? We won’t have a consumerism economy anymore, we’ll have to re-invent the whole economy. Not saying this will happen soon or overnight, but I’m just sayin’", "score": 13, "replies": [{"body": "Robots need to start buying authentic human made products and software on a large scale, burn and repeat.", "score": 12, "replies": []}, {"body": "yeah, but no.  \nAGI company/companies will see demand much greater than they can provide, so they will have to raise prices until employing AGI no longer makes financial sense for most. Their profit will skyrocket - imagine NVDA times thousand.  \nAs they continue to buy more chips, the price will slowly go down and companies will start to implement AGI to their workflow. As the prices continue to fall, these companies will see more and more profit.  \nThis will start new price wars in every sector, as in every sector there is at least one player who wants to sell more and is willing to sacrifice some margin for it. So those that do not employ AGI will go out of business, goods/services will get cheaper, those who do will wage a price wars, ever decreasing the prices of goods and simultaneously increasing their margins.  \nCompanies that make AGI may try to stop decreasing prices, but that will be temporary, as more competitors develop their own solutions.  \nAs these price reductions happen, we will be at deflation even with zero interest rates. Owning resources, like buildings, minerals, land etc will be the only thing that raises its value. Until AGI develops space stations and space mining, at which point the money will be used just to trade living space and the only way how to earn money is by providing services where humans want to pay humans. Economy will still work, just 95% of people and assets will be useless.  \nAt some point in this journey, more and more people will just not be qualified to do any paid work. Like if you look good, somebody will pay to have you as assistant/waitress/masseur or something. Some people will prefer human psychologist. Below average people will be fucked, unless there is some basic income.  \n  \nSo as you can see, economy is ready for this and won’t fail. Power will most likely concentrate in the hands of few megacorporations. Some people will still have a job (hello, worlds oldest profession!). As unemployment rises, government will be forced to find a solution. Central banks will have a hard time fighting deflation. But even if AGI happens tomorrow, this will take decades", "score": 8, "replies": []}, {"body": "Why won’t we have a consumerist economy after AGI?", "score": 2, "replies": []}, {"body": "brave of you to think every country can afford the price of AI,or that of robots,or it won't simply benefit a select few countries while the others will continue to live on without its existence.\n\nMy grandmother lived long enough to coexist with 30 years worth of personal computers and never used one în her life.", "score": 1, "replies": []}]}]}, {"body": "> Layoffs everywhere\n\nMostly tech, definitely not everywhere.", "score": 9, "replies": [{"body": "After an immense amount of hiring in the prior years ", "score": 3, "replies": [{"body": "Yeah these tech companies still have massively larger workforces than even a year or two ago. Tech layoffs are overblown. It’s just a correction from the massive over hiring.", "score": 3, "replies": []}]}]}, {"body": "Banks are fine, a few small over leveraged ones failed but that's a year ago. Layoffs are in the tech industry, not \"everywhere\". US Debt always goes up over time, that's not a short term problem. Wage disparity has been booming since the 70s just as intended. And yes some CEOs do sell when stocks are at all time high to minimize risk, that's healthy.", "score": 13, "replies": [{"body": ">US Debt always goes up over time, that's not a short term problem\n\n“…On January 4, 2021, the number increased to $6.7 trillion dollars \\[in circulation\\]. Then the Fed went into overdrive. By October 2021, that number climbed to $20.0831 trillion dollars in circulation…” (Tech Startups, 12/18/21)", "score": 2, "replies": []}]}, {"body": "This is all extremely bullish.", "score": 5, "replies": []}, {"body": "Banks aren't failing, at least none that matter. Layoffs are not \"everywhere\". US Debt is high, but that's a problem for another time (5 years or so). Real wages are growing back towards the all time high in 2020. CEOs selling stock is a drop in the bucket and insignificant to the market.", "score": 1, "replies": []}, {"body": "Ceo’s building bunkers at an unprecedented rate too. I read somewhere on reddit today that Rupaul is shilling a new book or something because he needs the money because he is building a doom bunker", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "NYCB seeking cash infusion today  You can say I was early, but not wrong.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "https://imgur.com/6psqmWx\n\nContrary to all the people on this sub sipping hopium. Here's a good image that shows the dominoes", "score": -1, "replies": []}]}]}]}, {"body": "everywhere?", "score": 1, "replies": []}, {"body": "This is inaccruate. Which banks hae failed so  far, Layoffs aren't everywhere, unemployment numbers show that unemployment is low. U.S debt is always hitting record highs.", "score": 1, "replies": [{"body": "NYCB\nPacWest (bought out but let's be real, they collapsed)\nCredit Suisse (same)\nCitizens\nSignature\nSVB\nFirst Republic\n\nThe contagion from last year ain't over and the effects of high interest rates aren't realized for 6-12 months.", "score": 1, "replies": [{"body": "Those bank failures all happened almost a year ago. They are all concentrated in specific, high-risk industries. It isn’t a systemic problem.", "score": 2, "replies": [{"body": "https://imgur.com/6psqmWx\n\nSomehow all of them are on this list, but sure, it's not systemic. What news do you watch? I'd like to know for research purposes", "score": -1, "replies": []}]}]}]}, {"body": "Again the layoffs are more a correction to over hiring last few years. But I do agree with the premise, but the layoffs aren’t the largest concern. Unemployment is still low.", "score": 0, "replies": []}]}, {"body": "Not at all. Feb, March, April is often one of the best stretches in the market. We have a 61% probability of March being positive. April is the best month of the year.", "score": 22, "replies": [{"body": "Feb and March are terrible months. Best months are Nov-Dec.", "score": 9, "replies": [{"body": "Personally I think the best month is the one with my birthday in it", "score": 19, "replies": []}, {"body": "https://www.moneyshow.com/articles/dailyguru-60630/\n\nMatt Carr taught me trendlines and I am forever in his debt.", "score": 1, "replies": [{"body": "why because he took all your trading money too?", "score": 1, "replies": []}]}]}, {"body": "Not really true.\n\nIt hasn’t hit yet because NVDA being absurd has held it off, but mid-Feb through part of March is generally weaker seasonality.\n\nIt is true that this timeframe is generally one of the best timeframes, but you’re talking October through April, not these three months.", "score": 2, "replies": []}]}, {"body": "Following a monster year like 2023, it's likely we'll have a correction with magnitudes around 15%, especially in an election year. 2010 is an example. Even worse is it's been around 15 months after the 3 month/10 year yield curve inverted in Nov 2022, and that's around the prime time when recessions start happening. The longest was the 2008 recession when it happened about 16-18 months after 3 month/10 year inverted. And just about time when everyone just moved to the soft landing camp.\n\nIf the rate hike lag is longer than in the past due to homeowners refinancing their mortgage and businesses refinancing their debt, then maybe there's a rock somewhere waiting to fall on us in the 2nd half of this year when the refinancing cycle begins, also when the election heats up too. Also, it gets pretty nervous when the Fed starts cutting rates, because that means the economy is weaker and prone to tip into recession. People think the soft landing is guaranteed, but the Fed still needs to cut rates early enough before it gets too restrictive and tip the economy into a recession. That's why I never understood why market was so concerned about recession when Fed was raising rates. They were raising rates cause they knew the economy was strong.", "score": 18, "replies": [{"body": "I don’t disagree with most of your post, but the Fed will cut their rate at some point to subsidize housing and commercial real estate (and banks). There is more that goes into rate setting than just good/bad economy.", "score": 7, "replies": [{"body": "so the Fed already made the mistake of letting inflation get out of control and lose their credibility. They had to fight very hard to win back that credibility in 2022, and that credibility helped anchor inflation expectation, which they think is crucial to their fight against inflation.\n\nThey can absolutely cut pre-emptively even if growth is not weak. However, they run into the risk of cutting too early, and then inflation gets stuck around 3%, and then having to raise rates again in the future. Cutting and raising rates again is almost guaranteed to create a recession. That will destroy any credibility they have left, and lead to a deep recession like the one required by Volcker to win back credibility. New homeowners are waiting for the Fed cut to refinance. Businesses are retaining surplus workers, holding out, and waiting for the Fed cut to reinvest, expand, and do capex again. That's all gonna get upended if the Fed reverse course. Then who's going to trust what the Fed says anymore.\n\nRemember the Fed is betting the farm, once again, on \"this time is different\". They are ignoring their economic model/theory, ignoring history. Growth is strong, unemployment rate is low, financial condition is loose. But they don't care, as long as inflation keeps going down. So they essentially have no framework, no forward forecasting. They think there's no playbook for pandemics, so they are just going month by month, observe the data, ask their business contacts, see if inflation keeps going down. If it shows any hint of not going down, like in Feb 2023, Sept 2023, and Mar 2024 if we get one more hot CPI, they are gonna panic and change their tone. Because inflation going down is the only excuse they have to justify letting strong GDP and low unemployment continue.\n\nNow what is the cost if they wait too long? We might slip into a recession perhaps. But likely not a deep one, because consumer leverages isn't that high yet. But at least now they have a \"justification\" to lower rates without losing credibility. Also, they have a playbook for dealing with recession. They've done it plenty of times. They don't have a playbook for high inflation. People like to shit on Arthur Burns for letting inflation get out of control, but the guy only started lowering rates 3 months after the recession started, and inflation still came back. Things are different now, but because the Fed already made a mistake once, they cannot repeat the same mistake again. They'd rather make a different mistake instead: letting the economy go into a recession.", "score": 9, "replies": [{"body": "Yesh, \"mistake\"", "score": 1, "replies": []}]}]}, {"body": "> Following a monster year like 2023, it's likely we'll have a correction with magnitudes around 15%\n\nThis is not at all true, I did the math on S&P returns in years following a year with a 20% or more return and found that they have the same typical return as both the years that did not have 20% or more returns and the typical return of the S&P 500 in general.\n\nIn other words, a year with a high return tells you nothing about what the next year's return will be", "score": 9, "replies": [{"body": "you go back in the past and following a year with around 25% return, you see either a negative year, or if positive, around 8-12% return. YTD we are up almost 8%. Even if assuming the optimistic scenario, how do you envision the path to that last 4%, with 10 months to go? Surely market's not gonna stay flat the whole time, especially during an election year. It's likely to have 1-2 corrections of at least 10%, followed by some rally, especially post-election.\n\nBtw, I'm not saying 2024 return will be -15%. I'm saying 2024 will likely have a -15% correction.", "score": 2, "replies": [{"body": "Since 1940 there have been 16 years with a 25% return or more. Of the years following those, only 4 had a negative return. The most common 3 percentage point return range was 19%-22% with 3 years, followed by 7%-10% with 2 years, and 25-28% with 2 years.\n\nSo the most probable scenario based on history is a 19%-22% year which would mean plenty of room to run, but even that is a bad prediction because the sample size is only 16, there's not enough data to even try to make a meaningful prediction about this year's S&P performance based on last year's performance. We very well might have a 15% correction intrayear because that's relatively common, but making that prediction because last year had a high return is not supported by data.", "score": 1, "replies": [{"body": "Excluding the double counting from tech bubble run ups, the only other periods with strong year back to back are 1955, 1976, 2020. 1954, Eisenhower lifted price controls. 1975 was a recovery from a bad recession that caused stocks to drop 50%. 2020 was of course accompanied by Powell record QE.\n\nOtherwise, the mediocre returns are 2013, 2010, 2004, 1992, 1990, 1986, 1981, 1962, 1959, 1946. So I guess you got 10 other scenarios here (and probably a lot more if you include the ones around 20% as opposed to 25%) VS 4 strong back to back scenarios.\n\nWe're gonna have a correction not just because it's common, but because 2 months in we are already up 8%, the typical return for the whole year.", "score": 1, "replies": []}]}]}]}, {"body": "I hope rate stays high for longer. And i hope market corrects a healthy amount. Too many people bullish about this economy. Blindly bullish", "score": 2, "replies": []}, {"body": "Wrong. Much higher", "score": -4, "replies": [{"body": "Because you want it to? Or because of any particular reasons?", "score": 3, "replies": [{"body": "You’ll see. Just be patient instead of being a sidelined bear for made up reasons.", "score": 1, "replies": []}]}, {"body": "if you're suggesting we have a bear market of 20% correction or more this year, it likely depends on whether we slip into a recession or not. Maybe if big tech fails to monetize AI after all that heavy investment, that could also be another catalyst. Or maybe Trump wins presidency and decide to implement a 60% or something tariff on China. Outside of those 3 I don't see any other catalyst, and I'm not bold enough to make a call on those 3 things yet.\n\nHowever, a correction of at least 10% is almost guaranteed at this point. Even in 2023 when SP500 was up 25%, it had 2 corrections of 10%. This year, we are basically up 7% in just 2 months, and SP500 is unlikely to have 25% annual gain back to back. It's also unlikely to just stay flat for 6 months, so the most likely scenario is around 2 corrections, one between now and summer, and one around Sept, followed by strong rally post election like we observed last year, and 2020.", "score": 0, "replies": [{"body": ">Or maybe Trump wins presidency and decide\n\n...s to lower government spending from insanely bloated handouts under Biden to typical overspending on defense, etc., causing inflation to moderate and allowing interest rates to deflate to a level where homeownership and entrepreneurship are once again possible - to wit:\n\n“…On January 4, 2021, the number increased to $6.7 trillion dollars \\[in circulation\\]. Then the Fed went into overdrive. **By October 2021, that number climbed to $20.0831 trillion dollars in circulation**…” (Tech Startups, 12/18/21)", "score": -2, "replies": [{"body": "it does Trump no good to reduce gov spending. No president wants to reduce spending until they're forced to, likely by the financial market. Fed balance sheet went up about 5 trillions, gov stimulus was also roughly 6 trillions, 4 trillions by Trump. No one's safe from blame here.\n\nBiden's stimulus is arguably what prevented the market from going into a recession in 2023. Seth Carpenter, who was one of the candidates to become Fed vice chair last year, said that the big argument for his soft landing forecast was fiscal stimulus by Biden. We could see that from construction job always in demand despite housing market in limbo.\n\nIf Trump was to reduce spending by any non trivial level in the span of 1-2 years (which is the only relevant timeline for reducing inflation for the Fed), the economy would likely tip into a recession.", "score": 1, "replies": []}]}]}]}]}, {"body": "Can someone explain why the market is bullish? Things are really expensive and everyone I know isn't happy, thinks times are tight.", "score": 15, "replies": [{"body": "Bullish for the future, not now. Market always looks ahead.", "score": 17, "replies": []}, {"body": "Earnings have been great due to price gouging hiding behind inflation. Employment is super low and wages have been rising at the bottom. Middle class is fucked but hey, record profits.", "score": 8, "replies": [{"body": ">Earnings have been great due to price gouging hiding behind inflation.\n\n...it's \"bad corporations price gouging,\" and not Biden handing out $13 TRILLION in 2021? - to wit:\n\n&#x200B;\n\n“…On January 4, 2021, the number increased to $6.7 trillion dollars \\[in circulation\\]. Then the Fed went into overdrive. By October 2021, that number climbed to $20.0831 trillion dollars in circulation…” (Tech Startups, 12/18/21)", "score": 1, "replies": []}]}, {"body": "But they keep spending for now. And big corps are spending.", "score": 1, "replies": []}, {"body": "The CEOs are happy. Isn't that what matters?", "score": -2, "replies": []}, {"body": "Most economic metrics look solid despite rapid rate hikes along with AI hype. That’s pretty much why.", "score": 0, "replies": []}]}, {"body": "I own Apple so I’m already hurt", "score": 3, "replies": []}, {"body": "Nervous. Especially since it's tax time. I am expecting a return in April, and I typically invest it in my retirement account. But it's also my single largest annual deposit / etf purchase. So it looks like I'll be DCA'ing this year.\n\nAlternatively, maybe I need to investing something other that VFV/VOO for the first half of the year. Maybe just a GIC or HISA.", "score": 4, "replies": []}, {"body": "What definition of \"run\" are you using here?", "score": 2, "replies": [{"body": "Consecutive weekly gains.", "score": 2, "replies": [{"body": "S&P 500:  \nClosed Friday, 2/16 at 5,005. \nClosed Friday,   2/9 at 5,026.  \n\n\nI see a drop of 21.  \nWhere is the weekly gain?", "score": 0, "replies": []}]}]}, {"body": "Adjusted for inflation, the indices aren’t at aths. I’m about to lump sum more into a couple of indices. I’m adherent to “time in the market”", "score": 2, "replies": []}, {"body": "Shits guna dump soon enough lol", "score": 2, "replies": [{"body": "What do you consider dump? I remember not long ago the market went down 2% and people were crying", "score": 2, "replies": [{"body": "Ive watched crypto go down 70-80% quickly, so a 30%- 50% drop would be a dump to me id say lol in the stock market. 🤷‍♂️", "score": 1, "replies": []}]}]}, {"body": "There are too many bears. There's a ton of fear out there. We aren't really that far above December 2021. The price of everything has inflated right. Doesn't make sense that stocks magically just don't inflate? That's earnings and multiple aside. So long as the Fed preemptively cuts before the data softens to the point that it's obvious to everyone, things should go reasonably well. These layoffs and where the California unemployment rate is should lead the rest of the nation over the next 6 months.. there's definitely a setup for a correction but it's one to be bought unless some systemic black swan takes place that we can't see right now", "score": 2, "replies": [{"body": "Yes, but the 12/21 valuations were irrational…there’s just too much irrationality creeping into the market again. A frog-themed crypto token jumping 40% in 2 days? \n\nAnd the put call ratio just tied the lowest ratio since December 2021….there are very few bears right now", "score": 1, "replies": []}]}, {"body": "Stop predicting and stay invested. Time in the market beats timing the market.", "score": 2, "replies": []}, {"body": "Don't worry, it's different this time", "score": 3, "replies": []}, {"body": "My take is that high US dept creates private and corporate excess wealth which is then invested to the stock market.\nThus, I think no major correction is coming unless US  government fails to pay said debt.", "score": 2, "replies": []}, {"body": "Not really. We are barely making new highs from a peak multiple years ago. The underlying economy has experienced a lot of inflation which ultimately falls through to corporate revenues and profits.\n\nThe interest rate hiking cycle seems completely over and we are just debating when the cuts come. The bear case there is dead.", "score": 2, "replies": []}, {"body": "We just came out of a one year dip and retested ATH on sp500 a month ago. If you held anything from the start of that dip til now, you would have broke even. I don’t count anything past January a bullrun because we were recovering from a crash. The bullrun started end of Jan 2024. Why would we be nervous??? It wouldn’t make sense for stock market to fall 25% again from this point…\n\nMarket recovers 100% of the time historically… so why would we be nervous lmao", "score": 3, "replies": []}, {"body": "Pessimists get reputation, optimists get money", "score": 2, "replies": []}, {"body": "optimism?\nmy QQQ calls were sooo optimistic yesterday lol", "score": 1, "replies": []}, {"body": "How to know to be nervous or not, draw a representative straight line from like 1980 to today, if it's above the line a lot be worried. If not, any crash that isn't apocalyptic will be recovered quickly.\n\nAnd if it is apocalyptic money is worthless now anyway", "score": 1, "replies": []}, {"body": "Bull markets are like that. Don't bother trying to time it, just invest when you have cash.", "score": 1, "replies": []}, {"body": "Ride the trend \n\nMarty Zweig", "score": 1, "replies": []}, {"body": "After the pessimism for almost 4 straight years? No. Not worried at all.", "score": 1, "replies": []}, {"body": "A pullback will eventually happen. I don't plan on selling before or when it does.  I do plan to invest more once prices drop again.  I invest for the future.  Generally avoid short-term.  Although I do some short-term investing.  Currently invested in  a T-Bill ETF while interest rates are high.  I will sell when interest rates drop.", "score": 1, "replies": []}, {"body": "Looks at my biotech portfolio*", "score": 1, "replies": []}, {"body": "I wouldn't take anything for granted in the extreme mania era.", "score": 1, "replies": []}, {"body": "Doesn't mean a thing they keep adding winners and taking away the losers. Will always be manipulated to go up.  It gives the average retailer false hope.", "score": 1, "replies": []}, {"body": "Way to go jinxy", "score": 1, "replies": []}, {"body": "This post is the reason we go higher", "score": 1, "replies": []}, {"body": "Watch S&P.  It has to hold 5048 on consecutive days to indicate one final swoon up to the 5348 region. We are talking months not days for this final move up  unless the S&P support breaks below 5048.  If it breaks below 5048 on consecutive days I take my profit (don’t think it will break yet). .", "score": 1, "replies": []}, {"body": "I'm buying this news cause y'all are trying write the narrative", "score": 1, "replies": []}, {"body": "Expect a pull back of 2-3 % and then sideways for a few months. Unless we see the Fed cut rates aggressive and that won’t happen. The market  already has 2-3 Fed cuts placed in the market at this time …if nothing happens expect a pullback of about 8% and then we hit the election", "score": 1, "replies": []}, {"body": "Yup, bought puts today", "score": 1, "replies": []}, {"body": "I'm not, because I actively manage my portfolio and avoid the most blatantly overvalued stocks. Will fairly valued stocks pull back along with everything else? Probably. But I'm confident my portfolio will generate solid long term returns. I can't say the same about the whole S&P500 at current prices.", "score": 1, "replies": []}, {"body": "Take some gains, put in stop losses.  All we need is a catalyst, the Fed showing sigs of rate cuts started all of this.  I think if they back fully away from that we could see a response.\n\nIf we are lucky this holds till the election, but I could see that also being a ‘sell the decision’ moment.", "score": 1, "replies": []}, {"body": "It’s a new world bro, everyone and their mom has Robinhood now so they can all buy stocks and most of them just hold. This market isn’t even as irrational as 2021 was with all the SPACs and shit. I tried waiting for a pullback since January", "score": 1, "replies": []}, {"body": "I had a boss in 2016 who refused to buy into anything until a pullback happened. Man missed out a historic run that would have outdone any potential losses thereafter.", "score": 1, "replies": []}, {"body": "Has sp500 averaged 10 percent last 36 months yet", "score": 1, "replies": []}, {"body": "Too many bears here for us to be near the top. We’re 10-20% away if not more", "score": 1, "replies": []}, {"body": "You can compare this to the 2021 craze, sure. But early 2020? The market didn't drop due to over-extending then. Do you predict a worldwide pandemic now?!", "score": 1, "replies": [{"body": "Nope. I'm saying when things start looking too good to be true, there's always something round the corner. When they are as overextended as now it doesn't take much for a sharp correction.", "score": 2, "replies": []}]}, {"body": "Not worried in the slightest we have yet to see the real pump to 8,500+ but most people will be sidelined and screaming at everyone to sell while they get steam rolled by the AI and inflation bubble making constant new all time highs for the next 1-2 years straight.", "score": 1, "replies": []}, {"body": "I’m expecting a large pullback (and secretly hoping for one). I’ve got a good stash in the MMF I’m ready to buy a couple things.", "score": 1, "replies": []}, {"body": "already took profits and bought on positions that have already bottomed or got hit a little and keeping some cash just in case.", "score": 1, "replies": []}, {"body": "Yes I’m nervous and expect a down month in March. \n\nThe market is heavily underestimating inflation. \n\n2 year breakevens rate is 1.9% right now. Based on TIPS. That’s CPI, not even PCE inflation which runs lower.", "score": 1, "replies": [{"body": "Not disagreeing, but what data points in the future causes you to worry about inflation?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Typical sidelined cope.", "score": 0, "replies": []}]}, {"body": "Just for reference, 83% of the time in election years, the markets been up and 100% of the time the markets been up if January was positive in an election year they manipulate day to hide what they don't like put out what they do like the best they can to control information and if you look at the rest of the market is pretty flat comparatively to the big gainers, I think money starts rotating slowly out of the bigger names, and will conceit continue to see a bull run. Somebody said it's a buying opportunity. Yeah if you're 30 40,20 but if you're sitting on a couple mill at 60 a big dip is hard to recover potentially.", "score": -1, "replies": []}, {"body": "Very very nervous.  Couldn’t be much more nervous.", "score": 0, "replies": []}, {"body": "I don't care, I am not selling. I am comfortable with my holdings, ASO, MICROSOFT, AMD, GOOGLE, CVS, VOW3 and then 70% SP500 ETF.", "score": -1, "replies": []}, {"body": "If biden is reelected, everything will tank. I hate trump, but he was good for the economy.", "score": -1, "replies": [{"body": "Nope, it won’t tank. The market likes stability, and Biden is about as status quo as it gets. \n\nWould markets rally if Trump got elected? Yeah probably, in anticipation of tax cuts — doesn’t mean a Biden victory would cause a downturn, though.", "score": 2, "replies": []}]}, {"body": "Trump must hate it. What will he blame Democrats for now?", "score": -4, "replies": [{"body": "“…On January 4, 2021, the number increased to $6.7 trillion dollars \\[in circulation\\]. Then the Fed went into overdrive. By October 2021, that number climbed to $20.0831 trillion dollars in circulation…” (Tech Startups, 12/18/21)", "score": 1, "replies": []}]}, {"body": "Valuations looks fine but analysts are delusional.", "score": 0, "replies": []}, {"body": "Bank failures worry me, but even inflation can’t stop bull run , economy says full speed ahead . The greed factor worries me too. Seems like a frenzy. Thank god for stop loss on my brokerage account lol", "score": 0, "replies": []}, {"body": "No I think we're just spinning up, especially if interest rates are lowered per expectations", "score": 0, "replies": []}]}
{"title": "What’s the future of Apple?", "selftext": "The world is going into the AI era, and I just don’t see Apple in it.\n\nIt seems iPhone is close to its fullest potential, they are throwing the same phone out for many years now, and people are much less hyped about it. While back then, it was worth it to get the new one every year for the upgrades, now new iPhones are just A(n+1) processor, new colors, and a bit better camera. They look the same too, so it has lost its “status symbol” attribute too.\nI don’t see it changing soon. Pretty much same with iPads.\nApple Watch is like.. it’s a watch, they can improve on it, but I don’t see people sitting on needles waiting when the new one will come out. They can improve battery life, make it brighter every year as the sun, make it do something with every sort of sign language hand movements (why though?) but that’s it.\nMacs aren’t going to save them either, they are faster for sure, but there’s not a huge market for them, or in other words, no massive growth is expected.\nThere’s potential in VR, but in my opinion VR is very very far from being able to be an everyday wearable, and it’s for sure they won’t be the ones developing VR to that point.\nWhy? Well, that’s my main point. Apple has never been an innovator, they were always the last to adapt something, and only when they were able to “perfect it” (even though they have massively failed many times).\nI’m just afraid they aren’t good positioned for either promising areas: AI, and VR.\nMy theory is they will be afraid of AI, because it’s something that’s much harder to control, and perfect. I don’t see how Apple, being a control freak, would be able to live with something that’s not predictable.\nFor VR, I think they will wait until they will be way late from the game. They will come out with something that’s 5 years behind, but I’m not sure they will be able to get away with it (as they were able to do with iPhones - which I cannot understand how they did till this day).\nThey also don’t have a shovel in the AI gold rush as Google, Microsoft, Amazon, Nvidia do.\nI’m genuinely worried about the future of Apple, and seems like they can be the next Nokia.\nJust to clarify, I’m not anti Apple, I’m the one who buys all the crap they throw out (iPhone, watch, beats, Mac, iPad), that’s why I see they are getting less and less exciting.\nWhat do you think?", "id": "1b7d0v8", "created_utc": 1709664410.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 121, "comments": [{"body": "You should short Apple", "score": 123, "replies": [{"body": "Yeah do it OP.  Grow a pair and see where that takes you since you “don’t see it”", "score": 32, "replies": []}]}, {"body": "I’ve old enough to have seen Apple counted out at least 3 times.  Every time, their stock has been - in hindsight - the most brilliant buy.  Do you really think the guys who re-invented desktops, then laptops, then the PDA / blackberry, now sitting on close to 200 Billion in cash, won’t have other tricks up their sleeves over the next five years?   OK, then, sell me your shares", "score": 79, "replies": [{"body": "In addition people are just mental with regard to this AI hype, becomes almost religious at this point. They completely lost relation in this regard. But most people are stupid, they read something all over the news and just repeat it like a parrot.\n\nI do not even doubt the disruptive nature of AI on our society, yes it will change our economy and jobs fundamentally. But as with computers in the 80s or the internet hype in early 20s (dotcom bubble) we are just in the earliest steps, we have no clue how this will all play out. We are in the first months of a decade long process and people are going mad if whatever company has not already implemented some kind of (useless) complete disruptive AI product.\n\nSorry but if you sell coconuts, t shirts or even hardware you don’t need to have a ruled out AI plan. \n\nLittle bit different for software companies such as Microsoft, of course they should try to be part of the movement.\n\nFor years to come, people will use the product range of Apple. When AI disrupts Microsoft office you can just load it on your iPhone.\n\nI dont even own Apple, but no, a company such as Apple does not need to leader on AI and throw endless money down the drain to join the hype. They can just monitor the process and adapt it to their products. On the other hand 50% of those AI companies valued at Quattrizilion dollars while losing money will note make it (in 5-10 years you will see big consolidation) and go to shit. And once again many people will lose loads of money now hopping on the hype train. Of course those investing in the few future market leaders in AI will earn tons of money as well.", "score": 20, "replies": [{"body": "I doubt the disruptive nature 100 percent, I saw an expert say were decades away from AI having the disruption some claim", "score": 6, "replies": [{"body": "In 2017 or so, I tried to dissuade a VC from dumping money into self-driving cars because, imo, we're still 30 years away, but they were like, \"Self driving cars will be here in two or three years, and this company I want to invest in is on the cutting edge!\" That company folded two years ago, and the investor took a real bath\n\nWe're so much further away from actual world-changing AI than anyone wants to admit. I was on another post about quantum computing a couple days ago, and, now that I'm thinking about it, quantum computing will likely be here before the type of AI everyone's expecting will be", "score": 3, "replies": [{"body": "self driving cars are fantastic comparison. I remember arguing with people to who claimed it's a couple years away. At the end of the day i find it fascinating how easily the media is able to manipulate people. Like on tik tok 80 percent of the younger generation is convinced AI it taking all the jobs away, its insanity", "score": 2, "replies": [{"body": "And it's funny because my company actually does AI with nueral nets and what have you, and my boss wants to brand those products as AI powered. I had a visceral reaction before I was like, \"Oh wait... no this actually does qualify, and I guess ride the marketing hype?\" Idk... personally, I struggle with that because people think AI is this perfect solution to every problem. If they knew how many parameter tuning iterations we went through and then realized we were using the wrong training set so we had to redo a month worth of work, they'd realize that AI is only as good as your weakest link, which I guess is me. Thank God I have the luxury of not needing to release products on xyz date, but the second management steps in to get to market faster, AI products are going to take an absolute nose dive in quality", "score": 2, "replies": []}, {"body": "Yup, I knew self driving cars was bullshit the minute Musk came on stage and said we would be able to take a nap riding in a self driving car from NYC to LA in 2020.  \n\nThat being said; investors would have many a lot of money with Tesla if they were to buy in at that time.  Sometimes; you have to go with the flow.  You can make money during hype bubbles; the hardest thing to do is to walk away when you are profitable and not be too greedy.", "score": 1, "replies": []}]}, {"body": "Self driving cars are already driving people around", "score": 1, "replies": [{"body": "In very limited ways, yes. In any way that is making money and not just throwing billions of dollar bills into a large fire, no", "score": 2, "replies": []}]}, {"body": "That's why the companies to bet on are the ones providing the shovels:  Nvidia, AMD, Intel, AVGO, TSM, etc.  As long as companies are willing to spend money on the shovels, they will make money.", "score": 0, "replies": []}]}]}, {"body": "The best way to use AI right now is either memes or going to Google and taking the first choice.\n\nMaybe in a few years AI will provide value. By then they will be monetizing the answers.\n\n$2 = answer\n\n$5 = good answer", "score": 5, "replies": [{"body": "AI is pretty good at going to StackOverflow for me and applying a college student's homework to my application.\n\nWell, not good, but fair.", "score": 2, "replies": []}]}]}, {"body": "Yepp worst thing I’ve ever done was sell most my Apple shares for 100% gain in 2018. FML", "score": 20, "replies": [{"body": "Same. I’m not listening to clowns like OP anymore.", "score": 2, "replies": []}, {"body": "Ouchies! Did you buy back in?", "score": 1, "replies": [{"body": "Nope I held on to a small amount. That amount is worth a little under 20K now. I should be 150-200K richer 😀", "score": 3, "replies": []}]}]}, {"body": "Many of us are waiting on the sidelines.\n\nTrue, there are headwinds here for Apple.  They are going to roar back and go past this ATH no problem.  \n\nStocks swing, let this one swing down.  It will become juicy in the weeks ahead.", "score": 7, "replies": []}, {"body": "Were those 3 times while Steve Jobs was alive or after though? Many of the people who designed those products you mentioned are not there anymore.", "score": 2, "replies": [{"body": "Those people have been gone for a decade. How have shareholders fared in that period?", "score": 1, "replies": [{"body": "Inertia. Pretty much anyone competent would have succeeded with the iPhone. Tim Cook is still there. But slowly more and more people from the original Apple will be gone.", "score": -1, "replies": [{"body": "Sure, just like that Motorola inertia. Destined for success.", "score": 2, "replies": [{"body": "More like IBM probably.", "score": 1, "replies": [{"body": "Except with enough cash to buy IBM.", "score": 1, "replies": [{"body": "Alright, whatever dude. I'm actually long Apple. There have to be better stocks at this point though.", "score": 2, "replies": [{"body": "Like?", "score": 1, "replies": [{"body": "Idk, that's what I'm looking for. Maybe NVDA or something like that.", "score": 1, "replies": [{"body": "Lol, ok", "score": 2, "replies": [{"body": "Certainly would have been the better investment over the last couple years. Apple is not a rocket ship anymore. Buffett is selling. You are in denial if you think Apple is the best stock to own now.", "score": 1, "replies": [{"body": "To own for what, the next 48 hours?", "score": 2, "replies": []}]}]}, {"body": "NVDA? LOL!!!  The hilarity that ensues from watching all the 🤡 suckered in by all the “AI” bullshit really is tragic. True AI will be important and disruptive but it’s yet to be proven, refined, or even accurate yet stock valuations are astronomical because of band wagoning and pathological parroting.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "That was when Steve Jobs was around. Very different times. There's no Steve Jobs with an amazing product like the ipod or iphone to revolutionize things for Apple. Who's going to lead them forward and with what products?\n\nServices and iphones make up most of their revenue. Their services model is under intense scrutiny from the EU and every major developer. Iphone sales are declining. People aren't buying a new phone every year. So what's going to drive growth in the future? Wall Street wants earnings growth. That's the bottom line.", "score": 2, "replies": [{"body": "This is the thing, and people calling those who don’t just blindly trust Apple clowns are in the real denial. I’m not anti Apple, 4% of my portfolio is Apple, have been holding it for years, I have many Apple products, and I talk with people. They don’t want the new products as much as they did a few years ago. Apple=iphone, not very well diversified. If iPhone sales decline (and they will if they don’t come up with something, and as explained in the original post, they seem like they maxed it out), then Apple is in big trouble.", "score": 1, "replies": []}]}, {"body": "The problem now is scale though. Apple at nearly 3T market cap needs to come up insanely profitable new business to move the needle on a 3T market cap. They were able to do it most recently (last 5-10 years) by scaling up services business (Apple Pay, Apple Card, Apple TV+, iCloud, App Store). But that was going from 1T to 3T. Now they need to find and grow a new business that's worth 6T to get a similar return from 3T to 9T. Or at least a big chunk of that 6T if you assume existing product revenues continue to grow at some meaningful rate.\n\nThis isn't to say Apple won't go up from here. But it's hard to make a case to buy Apple over the tech index QQQ.", "score": 1, "replies": [{"body": "Yet you’re buying Nvidia at 2 trillion dollars right? Lol", "score": 4, "replies": [{"body": "Lol no. How did you get that from post? I only talked about the tech index QQQ.", "score": -1, "replies": [{"body": "Cause I guarantee you most people who are talking about Apple not growing anymore cause they’re a 2.6 trillion dollar company (not 3 trillion btw) are still buying similar overvalued tech stocks with a similar market cap.\n\nAlso your comment is still flat out wrong cause you have no idea how buybacks work. Apple can grow its share price through buybacks which they do a lot of without moving the market cap. So they don’t need to grow from 3 trillion to 6 trillion to get a similar return.", "score": 1, "replies": [{"body": "Apple is one of the overvalued tech stocks. A PE multiple of 26x with no revenue growth. Incredibly expensive compared to how it’s historically traded when they were actually growing. \n\nAnd my discussion was about revenue and product growth not manipulating share price with stock buy backs. The 77B is stock buy backs in 2023 is canceled out by 27B in stock based compensation to employees. So they really only bought back 50B in 2023 on a 3T market cap. Thats a drop in the bucket for such a massive company. Only 1.6% buy back on a 3T market cap.", "score": 2, "replies": [{"body": "Who says they’re done growing? You have a crystal ball that says Apple isn’t going to grow anymore from here? Using the word “manipulation” on share repurchases really shows what you know too. Regardless if you think its manipulation or not its still going to affect your total return on your investment whether you think its right or not. Also Apple never had even close to 27 billion in stock based compensation in 2023. More like 10 billion you goober. Then again I guess it’s my fault for expecting someone who calls stock buybacks “manipulation” to know how to read financial statements. \n\nI don’t think I have ever encountered someone on here who has been more blatantly wrong about information but talks from a high place like they know what they’re talking about.", "score": 1, "replies": [{"body": "They have to prove they aren't done growing. They haven't done that. They have had essentially no revenue growth this past year. 2% in the latest quarter which is less than inflation. Are you going to argue this?\n\nYou're right on stock based compensation. I checked the latest 10-Q. The website I was using was wrong. Really doesn't change the point I was making at all. The 67B in buy backs in 2023 on a 3T market cap was just 2.2%.", "score": 0, "replies": [{"body": "Ah yes it does actually make a big difference. 10.8 billion is very much different from the 27 billion especially on 77 billion of stock buybacks. Buddy you’re just assuming they bought back all those shares at a 3 trillion dollar market cap (btw they didn’t). Apple has had periods in the past where their revenue didn’t grow year over year. No good investor invests based off of 1 year of data but I have to keep reminding myself that I am talking to a person who can’t read financial statements and thinks stock buybacks are manipulation. \n\nEverything you have been saying is just wrong and I am kind of tired of going back in forth with you. Are you actually going to bring up a meaningful and correct point for once or are you going to continue to troll and spout garbage? If it’s the latter then I am not going to waste any more of my time responding to you after this.", "score": 1, "replies": [{"body": "If they continue to do buy backs at 2.2% annually for the next 5 years then that's an 11% return from buy backs. Nothing to write home about. Use some common sense here.\n\nI'm sorry but if you want returns that beat QQQ you have to show revenue and product growth. Stock buy backs won't get you those kind of returns.\n\nCan you come up with a sound argument for investing in Apple over QQQ? If so, I'd like to hear it. Otherwise you're just talking out of your rear with hand wavy statements and talks about buy backs.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Nvidia has the potential to double, triple, or 10x their revenue in the coming years. Apple doesn’t. Yes, it’s overvalued if you only see current earnings, but the expected growth is priced in.", "score": -2, "replies": []}]}, {"body": "A little exaggeration there. Apple is at 2.6T market capitalization, not 3T.", "score": 1, "replies": [{"body": "It was 3T at the end of January. My arguments are that the ongoing correction makes sense.", "score": 3, "replies": []}]}]}, {"body": "We said this 5 years and apple still hasn’t shown any new tricks. That’s why it’s going back to 2020 valuations. \n\nSo much is already priced in. It’s valued over 2.5T still. Tell me how it’s going to values over 4T if they still have nothing new to showcase and surprise us with???\n\nVision Pro is not it.", "score": -5, "replies": [{"body": "Any new tricks? Is Apple a discarded magician?\n\nThey have 400bn of revenues every single year and earn 100bn after cost. Highest valuations of all companies of this planet. Companies exist to make money, and they are number 1 for years.\n\nI stupidly don’t even own this stock, but what you say is insane. Some small AI Startup might need to come up with funny tricks and gimmicks, but not the global market leader.\n\nThey completely optimized their business to generate money, they grew businesses such as Apple Pay. They will be fine without AI which has no impact on their business as they are not predominantly a software firm.", "score": 3, "replies": [{"body": "Buddy-their margins and revenue have been at those levels for years.", "score": -1, "replies": [{"body": "„Buddy“, that’s exactly what I am saying", "score": 1, "replies": [{"body": "Right so how do expect their stock price to double if their revenues and profit barely show any growth at all for years. Nvda more than doubled their profit to ungodly numbers no one expected. Will apple ever do that again?", "score": 1, "replies": []}]}]}]}, {"body": "Short it.", "score": 3, "replies": []}]}, {"body": "You regards are comparing this apple to Steve Jobs Apple. \n\nLet’s recount the second coming of Jobs: iPod, iMac, Macbook, iPhone, iPad, Siri, Apple Watch (in development), Apple Music. \n\nLet’s recount Tim Apple’s product launches: AirPod, Vision Pro. \n\nSee the fucking difference?", "score": -1, "replies": [{"body": "And yet … Apple is making 100B profits. No new product does not mean it’s going down. People are still going to buy iPhones, iPads and what not. Quality, ecosystem, and many other things that would make people stick to Apple.", "score": 1, "replies": []}]}]}, {"body": "stopped reading after “apple has never been an innovator” but thanks for the laugh!", "score": 103, "replies": [{"body": "We're talking about the inventors of the rounded square, here!", "score": 5, "replies": []}]}, {"body": "You forgot 1 very important aspect. There is no REAL ARTIFICIAL INTELLIGENCE out. All you see is just machine learning/deep learning, nothing is an AI right now, not even chat got", "score": 11, "replies": [{"body": "SHHHHH! Don’t wake the rubes. They think AI will change the world next Tuesday.  LOL", "score": 2, "replies": [{"body": "Go watch Travellers on netflix, then u’ll know what happens when a real AI gets live", "score": 3, "replies": []}]}]}, {"body": "Only made 100B profit last year. They fucked", "score": 29, "replies": [{"body": "lmao", "score": 5, "replies": []}]}, {"body": "Apple acquired more AI startups in 2023 than any other company, by FAR.\n\nHonestly, posts this dumb should get the user banned.", "score": 31, "replies": [{"body": "But did AAPL buy valuable and useful startups?\n\n  \nI can also tell you that I bought over 20 stocks. But these stocks could be litereally a piece of shit right?", "score": 2, "replies": []}]}, {"body": "Apple owns the most AI startups in the industry. \n\nDon’t think they aren’t in the game. It just isn’t under their flagship.", "score": 31, "replies": []}, {"body": "Just because iphone sales are so absurdly high, people sleep on the other apple products and growth opportunities. Apple Services brought in 23B last year. Wearables brought in 40B.       \nNvidia was already hot last year - in 2023 they made 27B so all of Nvdia made 4B more than Apple Services made alone. Apple is growing their other revenue streams and nobody sees it because iphone sales made 200B last year and overshadow everything.       \n         \nOne of Apples biggest strengths has always been their ecosystem. Every new product that fits into this ecosystem strengthens it and that’s exactly what apple is doing. My guess is that the‘ll not publish some shity ai that nobody needs but the‘ll find ways to seamlessly integrate ai into their ecosystem and into new hardware that will make consumers even more dependable on their brand", "score": 9, "replies": []}, {"body": "They make the best mobile computers on the planet. Vision Pro and AR will eventually replace mobile phones. Been using AVP since release and it is absolutely mind blowing what this thing can do. Within the next decade, I think these will be huge. \n\nApple can also leverage AI into their tight ecosystem. They have the processing power to make AI do a lot of heavy lifting right on the device and let all your products and services be tied to it. With over a billion devices installed, they can add to services and raise the price.", "score": 8, "replies": []}, {"body": "Is this guy joking?", "score": 9, "replies": []}, {"body": "Apple has lock-in ecosystem and strong brand value. The risks are the new generation of customers and price point. I absolutely do not doubt that their profitability will decline but the problem is lack of innovation and high priced products will just make me wondering how are they going to sustain the moat.\n\nMaybe not much to worry for one more decade but I do worry to hold it as a lifetime stock. Personal use market is so variable that I wonder what’s their next best bet to keep the loyalty.", "score": 7, "replies": [{"body": "Vision Pro. Go try it.", "score": 2, "replies": [{"body": "Arguably their least compelling major new product since the Lisa.", "score": -2, "replies": [{"body": "Nonsense.  I’ve been using it since it came out. It is amazing.  Have you used it for an extended period of time?", "score": 2, "replies": [{"body": "Your personal anecdotes do not matter dude. Anyway, I am long Apple shares. It could be that future VR products are way better, like the Lisa and the Mac again.", "score": 0, "replies": [{"body": "You’re wrong.", "score": 2, "replies": [{"body": "Wow, stunning reply.", "score": 1, "replies": [{"body": "Say vision pro is more compact, more efficient, more cheap, more cool.\n\nThen vision pro print $$$. \n\nBut how vision pro more compact, more efficient more cheap, more cool?\n\n⌚️", "score": 1, "replies": [{"body": "So basically a completely better product. Like the Mac and the Lisa.", "score": 1, "replies": [{"body": "Precisely. However, no one in this space has yet to deliver a practical iteration. Meta and APPL are competing in two similar but different races. Apple: closed source eco system. Meta: open source copying microsoft’s approach to desktop computing.", "score": 1, "replies": [{"body": "So I was right lol.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "They are an awesome brand! They have a following like no other company. \n\nYou would be insane to think that Apple would not have some dealings with AI. It's like saying... Coca-Cola are not going to put an AI chip into my soda so I won't drink it! I can assure you Coca-Cola will survive and will have the same customer base as before if it never engages with AI.\n\nYou need to look at it in a more conservative aspect:\n\n[https://wyominginvestor.com/navigating-stability-with-utility-and-energy-stocks-in-business/](https://wyominginvestor.com/navigating-stability-with-utility-and-energy-stocks-in-business/)\n\n[https://wyominginvestor.com/global-dividend-treasures-revealed-picks-for-the-best-foreign-stocks-outside-the-u-s/](https://wyominginvestor.com/global-dividend-treasures-revealed-picks-for-the-best-foreign-stocks-outside-the-u-s/)", "score": 3, "replies": []}, {"body": "Doesn’t see Apple in AI lol thanks for the laugh. You know they could just buy almost any AI company they wanted right?", "score": 11, "replies": [{"body": "And what would they do with them? Oil companies could buy AI companies too it doesn’t mean they would make use of them. Microsoft didn’t buy it, but has a strong cooperation with OpenAI, implementing it in Bing, etc. What would Apple do with it? Apart from Siri (which is far from a GPT level agent), how do you see Apple using LLMs?", "score": -11, "replies": [{"body": ">What would Apple do with it?\n\n[https://machinelearning.apple.com/research?page=1&type=article](https://machinelearning.apple.com/research?page=1&type=article)", "score": 4, "replies": []}, {"body": "It is all about the ecosystem. They can have an AI servant that you can deploy to do anything you want. If you want a taste of this check out the Rabbit.y guess is that Apple will release something this year at WWDC.", "score": 3, "replies": []}]}, {"body": "Apple should buy Microsoft or Alphabet?", "score": -7, "replies": [{"body": "Yeah those are the only two companies working on AI", "score": 7, "replies": [{"body": "The only two that really matter", "score": -4, "replies": []}]}]}]}, {"body": "Apple brings a product to market when they are sure it serves a purpose, and when they are sure it serves that purpose better than their competitors do.", "score": 4, "replies": []}, {"body": "Sell/short do whatever you want.  \nI just don't bet against the magnificent 7.", "score": 2, "replies": []}, {"body": "Here is a perspective $AAPL is down 3% today because investors are voting they have limited confidence in their AI strategy.\n\nBy now it's become clear that this June we will see their first foundation model, something that will compete with GPT, Gemini, xAI, Anthropic.\n\nThe part that is not known is what does a foundation model mean for Apple’s business?\n\nAI can move the earnings needle. \n\nApple has. 2.2B active devices, which I estimate are owned by 1.4B active users.\n\nIf 20% of Apple's active base subscribe to an AI product (personalized AI) at $10 a month, that’s $33B a year in 80% margin revenue, which would increase operating income by 16%. ($155B in operating income in CY23). \n\nAAPL stock action this year reminds me alittle of when in the fall of 2022 investor concern that Meta would lose share to TikTok pressured the stock to $100. In the end, these products (Meta,  Google Search, Microsoft Office and Apple Services) are sticky in the long-term", "score": 2, "replies": [{"body": "META is a different story. AAPL does not fire employees. META could grow thanks to Chinese enterprises deployed their ads through Instagram. \n\n  \nAAPL is rotten.", "score": 1, "replies": [{"body": "Not my view on Apple what I posted. Just something I read. You feel Google has similar issues? I believe they can do alot of OPEX cleaning", "score": 1, "replies": [{"body": "Google needs to fire people for sure. Google could be THE Meta-effect.", "score": 1, "replies": [{"body": "I believe so. About Apple I can imagine it can happen what I posted but don’t own any apple", "score": 1, "replies": []}]}]}]}]}, {"body": "Honest and Brave OP. You said the quiet part out loud. Apple only innovated during the Steve Jobs era. Now it just keeps changing the version number.", "score": 2, "replies": []}, {"body": "Paragraphs for the love of God!\n\nAlso it's obvious you have a disdain for Apple and are very biased against them.  Glad you think they are going to fail.  I think this might be the billion time somebody has counted them out.  Eventually they will be right but I see no reason why it would be now.\n\nAt the end of the day the Apple Ecosystem is very sticky.  While sure other companies can make individual items better than individual Apple products or features, I don't see anybody else anywhere near competing with them across the board.  So for that very reason I don't think they are going anywhere.  They are the premier luxury tech brand and I don't see that changing even with AI.  You still will need human interfaces and Apple wins there because of their dedication to iterating until it's relatively perfect.", "score": 4, "replies": []}, {"body": "It's a guess, but mine is that Apple will astound us where we least expect it. And when they do everyone will scratch their head and jump on the bandwagon.\n\nWhen Jobs himself announced the new iPad I immediately thought of a doggie pee absorbent flop, but it was so well designed that it made Apple billions. Same for their watch, when no one would be seen dead with a watch. \n\nAdmittedly their financial picture is on the downs right now, but I guess we'll just wait and see.", "score": 3, "replies": []}, {"body": " Buy tech from others that work.", "score": 1, "replies": []}, {"body": "Well, until AI appears out of nowhere, having an Apple watch (which I don't own, but I've bought two of them as gifts) might be that AI access for the coming years until AI takes over and kills all humans.", "score": 1, "replies": []}, {"body": "It's not like you buy Nvidia phones, apple can buy Ai chips just like other companies.", "score": 1, "replies": []}, {"body": "Apple will be around years to come or get bought by another.", "score": 1, "replies": []}, {"body": "lol I’m not bullish on the stock but I wasn’t even when it was pumping. So funny how a drawdown in a stock brings out so many RIP posts 😂", "score": 1, "replies": []}, {"body": "Apple’s corporate culture indeed is perfection over first to market, and they’ve survived as a status symbol to compensate for the areas of innovation where they lag. For example I wouldn’t be surprised if they do eventually release a foldable phone, you can be sure it is something they have looked into. But foldable smartphones are now 6 years old, I do imagine they’ll time release one for interest. All this is to say that even though they are slow to innovate, rather trying to perfect a tech first, they have something like 70 billion dollars in cash reserves and tech talent from Ivy League schools. They can afford to be late to the party, they can afford to take a hit as they reposition to a new market reality. I have 8 shares, frustrated but not panicking.", "score": 1, "replies": []}, {"body": "I do think there is a world where Apple loses market share or its view of being \"premium\", which causes a tailspin into a IBM tier. Now I wouldn't bet my money on that anytime soon. \n\nI do think they have a lot of mature products and nothing really \"fresh\" outside of over priced VR. In addition, VR is way more niche than their revolutionary products. Everyone had a cd player or crappy mp3 player when the iPod came out. Everyone had cell phones when the iPhone came out. Screens were becoming a thing with massive Wi-Fi adoption with the iPad. I just don’t see the vr market", "score": 1, "replies": []}, {"body": "See IBM. Growth, but slower.", "score": 1, "replies": []}, {"body": "Better short apple now.. wish me luck 🤞", "score": 1, "replies": []}, {"body": "Post ur positions or ban.", "score": 1, "replies": []}, {"body": "First of all, Apple invented the smartphones.\n\nSecondly, I agree these days android is just much ahead in terms of features, and tech but Apple is not like them. If they do something, they’ll do it right. So I don’t personally mind waiting another 5 years for a feature that is already prevalent in the market.\n\nYou say Apple isn’t focusing on VR? What about Spatial Computing? They recently released Apple Vision Pro which is the best in the industry although highly expensive as well. But they did it. So eventually prices will fall. It’s only a matter of time. Even when the first iPhone came out, or the first phone, it was also highly expensive, eventually prices would become more affordable as they find ways to cut down costs or make cheaper alternatives without compromising the quality.\n\nI don’t know what reality you live in bro. Apple is always a status symbol. Even though many don’t admit it and it has become common, people still keep spending buttload of money on upgrading the phone, and getting the accessories.\n\nThey are trying to build that ecosystem. Once you have all your devices connected together, you should know how easy your life becomes. \n\nApple’s latest iOS update is also all about AI. Even Elon Musk made a statement regarding that recently. It’s just that they will take it in their own pace.\n\nThey are also highly profitable with strong fundamentals.\n\nEveryone has phones. It’s either going to be iOS or android. Within the android bracket you have 100’s of options. With iOS, you only got Apple. That’s the kind of hold Apple has in the industry.\n\nThey have created a monopoly. That’s why DOJ sued them recently.\n\nAtleast for the next 10 years, Apple’s gonna stick on and keep booming. Easily.", "score": 1, "replies": []}, {"body": "you can’t be serious… 😭", "score": 1, "replies": []}, {"body": "Out of all the significant technology companies, Apple's the closest to making sci-fi, full IoT homes a reality. Moreso than Amazon or Google.", "score": 1, "replies": []}, {"body": "Apple will struggle to offer an AI product in their closed loop system. That's the big issue I see. Also there's no innovation right now. The Vision Pro is a joke for the average person and crazy expensive. \n\nPeople forget because most here are too young to know but Apple was a DEAD company before Steve Jobs came back to Apple. I mean it was literally dying. When he passed away I knew they would EVENTUALLY struggle again. Why? Because he was the true visionary behind their products. Tim Cook is an administrator at best.", "score": 1, "replies": [{"body": "Theres only so much you can do with a smart phone and limitations with hardware. Tim cook and apple meticulously designed a now seamless experience for the smart phone. They were criticized for being patient and late innovators, but in all honesty, their advantage comes in the form of customer first experiences. The iPhone improved upon almost all aspects of the user experience. From the first iPhone to today’s, the software has upgraded tremendously along with their proprietary chip. And now, the possibility for AI integrated with mobile phones is a catalyst for tremendous growth.", "score": 1, "replies": []}]}, {"body": "They will do AI more in the new iOS and phones. But I am not sure I expect much freedom for the AI, I guess they will sprinkle a bunch of small functions accross the OS and call it \"all new\"", "score": 0, "replies": []}, {"body": "Oh you are a bold one coming to this sub and not holding AAPL in high regard...  \n\n\nI'll just say that I think people here are pretty blind and sycophantic when it comes to this company. Too many people consider it an ultra high yield savings account, blanketly dismiss any risks or bearish notions, and over-allocate. Not a healthy approach to investing in any company. ", "score": 0, "replies": [{"body": "There are a lot of people even on this sub too that don’t hold Apple in a high regard at all. There has always been people who are bearish on Apple and has been like that for many years. Your comment can also be applied more so to any company not just Apple. It just seems that you do not have a lot of social awareness.", "score": -3, "replies": []}]}, {"body": "Tbh i keep fate in the 🍎🍏\nThey know what happened to Nokia & Tesla, \nIt's unlikely Apple will be left in the dust\nThey dont have to bootlïck wanna-be investors with moonshine announcements every week, they have their long term investors which are probably having more sleep at night than redditors shorting it", "score": -1, "replies": []}, {"body": "more discounted shares for meee", "score": 0, "replies": []}, {"body": "I’ve got 91 shares at 194 and I’m holding long term. I’m planning on buying plenty more in the $160s and load the truck at 128 if we get back there again", "score": 0, "replies": []}]}
{"title": "$TSLA Daily Thread - March 05, 2024", "selftext": " Fun chat. No comments constitute financial or investment advice. 🌮", "id": "1b6ukjc", "created_utc": 1709607612.0, "score": 24, "upvote_ratio": 0.94, "num_comments": 548, "comments": [{"body": "Cybertruck delivery tomorrow!", "score": 25, "replies": [{"body": "Congrats and fuck you!", "score": 8, "replies": [{"body": "😀", "score": 3, "replies": []}]}, {"body": "send nudes", "score": 3, "replies": [{"body": "Only if you promise to upvote it", "score": 5, "replies": [{"body": "ok", "score": 3, "replies": []}]}]}, {"body": "Just don't crash it.", "score": 2, "replies": [{"body": "I will try my hardest.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 19, "replies": [{"body": "Yes. Now I understand the power of just investing in SP500. I seem to like pain.", "score": 12, "replies": []}, {"body": "Yup. It’s so bad. Like really so bad. Not even “ I should have grabbed NVDA “ it’s … the index massively killing us here.", "score": 3, "replies": []}]}, {"body": "In recent interviews Elon has reiterated that the next gen vehicle will be manufactured with robotaxi/autonomy in mind. If that's still scheduled to be end of 2025, we could have an upside opportunity not seen since 2019.\n\nIt seems like he could care less how much money or profit Tesla's automotive unit makes until this comes to fruition.\n\nI know most of us here are done accumulating. For those who aren't, keep an eye on good and better entry points over the next 12 months.", "score": 14, "replies": [{"body": "If autonomy is that close then everyone should be loading up asap. Of course, no one really knows and we’ll have to see how quickly V12 improves. Looks pretty damn good so far though and a lot better than 11\n\nSeparately, the dumb money guy, Chris Camillo, is convinced the market recognizes the Optimus opportunity within a 2-18 month window. He’s allocating 25% of his portfolio to Tesla and has been buying", "score": 9, "replies": []}, {"body": "Rule number 1.", "score": 6, "replies": [{"body": "![gif](giphy|HJXsW9ZQxZkWY)", "score": 8, "replies": [{"body": "![gif](giphy|l0NwFNMhfqejfqDcY)", "score": 5, "replies": [{"body": "sidebar: i had a friend who made a point of taking off his jacket exactly like this every single time, I could never do it as awesomely and with so much panache, and I was always a bit jealous of his ability . Oddly enough, no women ever found this as funny as I did....", "score": 3, "replies": []}]}]}]}, {"body": "Agree. Everybody’s talking about all the stocks at ATHs (Microsoft, NVIDIA,..) I‘ve started accumulating again.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "It’s a harsh reality but 90%+ of active investors underperform the market. Most people are better off index investing", "score": 11, "replies": []}, {"body": "Ya I was like damn I should check out this boggle head stuff after Pokémon posted about it lmao", "score": 3, "replies": [{"body": "I love how we all know him as Pokemon Guy", "score": 3, "replies": []}]}, {"body": "lol rings so true", "score": 3, "replies": []}, {"body": "you can't just switch generations, stop identifying as a boomer", "score": 3, "replies": [{"body": "If men can identify as women and vice versa, I can fucking identify as a boomer if I feel like it", "score": 7, "replies": []}]}]}, {"body": "OpenAI's response to Elon Musk's accusations: [https://openai.com/blog/openai-elon-musk](https://openai.com/blog/openai-elon-musk)\n\nThe post is long and also contains copies of email correspondence between Musk and other OpenAI team members as proof.  The emails are blacked out in some portions to cover email addresses and names that the OpenAI team wanted to keep confidential. \n\n&#x200B;\n\nThe most important points in OpenAI's statement:\n\n&#x200B;\n\n>In early 2017, we came to the realization that building AGI will require vast quantities of compute.    \n>  \n>We all understood we were going to need a lot more capital to succeed at our mission—billions of dollars per year, which was far more than any of us, especially Elon, thought we’d be able to raise as the non-profit.  \n>  \n>In late 2017, we and Elon decided the next step for the mission was to create a for-profit entity. Elon wanted majority equity, initial board control, and to be CEO. In the middle of these discussions, he withheld funding.  \n>  \n>We couldn’t agree to terms on a for-profit with Elon because we felt it was against the mission for any individual to have absolute control over OpenAI. He then suggested instead merging OpenAI into Tesla. In early February 2018, Elon forwarded us an email suggesting that OpenAI should “attach to Tesla as its cash cow”  \n>  \n>Elon soon chose to leave OpenAI, saying that our probability of success was 0, and that he planned to build an AGI competitor within Tesla. When he left in late February 2018, he told our team he was supportive of us finding our own path to raising billions of dollars. \n\n&#x200B;\n\nIf what OpenAI states is accurate, Elon Musk is accusing Microsoft of doing exactly what Musk wanted to do with OpenAI via Tesla: take de facto control and provide most of the funding for compute.", "score": 14, "replies": [{"body": "Ah back when he cared about tesla.", "score": 8, "replies": []}, {"body": "quickly, Elon simps unite!!!!!", "score": 6, "replies": []}, {"body": "Surprise, surprise, Elon’s a hypocrite.", "score": 8, "replies": [{"body": "Yes yes we know all about the TSLA piggy back pipeline. Carry on Elon.", "score": 8, "replies": []}]}]}, {"body": "He’s seriously using dailymail as reputable source now? 😳\n\nhttps://x.com/elonmusk/status/1764885292199063590?s=46", "score": 11, "replies": [{"body": "brainwashed", "score": 8, "replies": []}, {"body": "Ceo of the border hard at work", "score": 8, "replies": []}, {"body": "ALL MEDIA LIES TRUST ME!\n\nLOOK AT THIS ARTICLE FROM THE MEDIA THAT CONFIRMS MY VIEWING POINT!\n\nHe's a pos, he's now posting on twitter that you either support MAGA (the republicans he's talking about aren't the moderate ones) or you are responsible for nuclear war and the end of humanity...", "score": 6, "replies": []}]}, {"body": "Casual -10% in 2 days", "score": 12, "replies": [{"body": "That’s how we do it. Grind up 1% for two weeks, dump it in 1 day", "score": 11, "replies": []}, {"body": "Just a casual Monday", "score": 4, "replies": []}]}, {"body": "wen Rohan Patel CEO? Guy is perfect face for Tesla. Indian, lib heritage with Obama, knows how to talk in complete sentences.", "score": 24, "replies": [{"body": "I'd like a Redwood Materials acquisition and JB as CEO whenever Tesla is looking to transition. Could be a while.", "score": 16, "replies": [{"body": "> JB as CEO whenever Tesla is looking to transition\n\nBe still my beating heart.\n\nA true-blue, honest to goodness engineer that understands the nitty gritty details, has c-suite experience, and not a showman.", "score": 14, "replies": [{"body": "JB is fantastic and everyone loves him. He's perfect in my opinion", "score": 11, "replies": [{"body": ">JB is fantastic and everyone loves him\n\nYes, he's fantastic. I would think that the people that know him love him, but most people have no idea who he is.\n\nIMO what's most important when compared to Elon is that no one *hates* him.", "score": 9, "replies": []}]}]}, {"body": "Don’t say the T-word in front of Elon.", "score": 11, "replies": [{"body": "is it bad that I'm not sure if \"transition\" or \"Tesla\" triggers him more?", "score": 6, "replies": []}]}]}, {"body": "❤️❤️❤️", "score": 11, "replies": []}, {"body": "Is that your new bro crush?", "score": 6, "replies": [{"body": "I love all tesla executives that do their damn job and prioritize tesla. Rohan, franz, lars et al.", "score": 14, "replies": [{"body": "Yes absolutely!  Not to be too glib on that.  I’m tuned into what you’re saying.", "score": 3, "replies": []}]}]}, {"body": "What Caste?\n\nAlso, his tweeting is prolly part of a modern Odysseús challenge.", "score": 7, "replies": [{"body": "all the indians in america are high caste.", "score": 8, "replies": [{"body": "It makes sense considering the cost to move, but many people think it’s Indian poor with a suit-case of dreams.\n\nI don’t even think Indian poor (a truly unique level of poverty and oppression) are even allowed to own suit-cases.", "score": 7, "replies": [{"body": "yup, where i work the poorer the country a person is from, the richer that person is.", "score": 7, "replies": [{"body": "I studied with someone from Simbabwe and upon return he scored a 10k USD/month job. Genius .", "score": 1, "replies": []}]}]}]}]}]}, {"body": "![gif](giphy|4EF5LwiRfpBKQUOsoF|downsized)", "score": 11, "replies": []}, {"body": "Howard Hughes timeline more in play than ever", "score": 12, "replies": []}, {"body": "[https://www.youtube.com/watch?v=EKmVUeqla8Q](https://www.youtube.com/watch?v=EKmVUeqla8Q)\n\nJames Douma praising v12 as it navigates a beautiful cali urban setting", "score": 10, "replies": [{"body": "Looks really good. Would love an update on when we can expect this to go wide release", "score": 6, "replies": []}]}, {"body": "![gif](giphy|132pnhRx4EM7ni|downsized)", "score": 11, "replies": []}, {"body": "God damn fremen attacking our spice", "score": 11, "replies": []}, {"body": "Lars/Franz vid on M3 is cool", "score": 10, "replies": []}, {"body": "Take rate and margins would be a lot better if fsd was 6,000 not 12,000", "score": 10, "replies": [{"body": "![gif](giphy|3tEFVAbfzzcwo|downsized)\n\nFound our crack shot CEO using an abacus instead of an  xy plot to figure out pricing", "score": 2, "replies": []}, {"body": "Guess it's a way to prevent people from fucking with the beta, people would be less likely to fuck with the system paying 12K as opposed to 6K, it's my only justification for the current price, otherwise, I agree 6K would be great", "score": 2, "replies": []}, {"body": "What about 6k non transferable, 12k transferable?", "score": 3, "replies": [{"body": "Anything is better than the price it at 12k because some day you can put your car in teslas robotaxi network.", "score": 2, "replies": [{"body": "Of Tesla's current offerings and vehicles in the Tesla fleet, I believe that only Model X will ever be viable for use in a robotaxi network.\n\nNone of the other vehicles have the capability to self-close a door that is left ajar.\n\nThe Isaacson biography discusses how Tesla's design team confronted this issue around mid-2022, when they were developing the NGV/Robotaxi products.  \n\nTesla will have to modify the designs of the other vehicles, or provide retrofit automatic doors, if they are to be used as robotaxis.", "score": 1, "replies": [{"body": "How does Waymo handle a door left ajar and has it been a big issue for them?", "score": 5, "replies": [{"body": "In the past, Waymo has had a safety driver in the front to deal with unexpected situations. \n\nThey did away with safety drivers recently, but the vehicles are still monitored and a support team can monitor cars and dispatch help if the situation requires. \n\nI don't know how scalable this approach is: of having people stationed everywhere to continuously monitor the system and intervene when necessary.  \n\nThe Tesla Bot could provide a hack around this problem.  Dispatching a bot to deal with a simple issue like an open door or flat tire, should be much more economical than using an employee", "score": 2, "replies": [{"body": "When a bot can do that we won't need robotaxis", "score": 3, "replies": [{"body": "It is true that a sufficiently advanced bot could simply be the taxi driver.  This would also provide a feature advantage in terms of being able to help load/unload luggage or assist a person entering/exiting the vehicle.\n\nA disadvantage is that the bot takes up 1 seat in a vehicle.", "score": 2, "replies": [{"body": ">A disadvantage is that the bot takes up 1 seat in a vehicle.\n\nAnd costs an extra $20k, lets assume. And has less cameras/spatial awareness compared to the vehicle. And carries the opportunity cost of something productive it could be doing instead of sitting in a seat on the drive.\n\nI can see multiple bots in a Semi truck for deliveries, but not for ubers.", "score": 3, "replies": []}]}]}]}]}, {"body": "Just keep the meter running on the customer until the car is put away correctly. Rider has to tap end ride or continue being charged ", "score": 7, "replies": [{"body": "Bingo. Include chimes and alarms and voice instructions. This isn't that hard.", "score": 3, "replies": []}, {"body": "![gif](giphy|d3mlE7uhX8KFgEmY)", "score": 1, "replies": []}, {"body": "That assumes the customer is able to do so. \n\nI can think of edge cases where someone stepping out of a robotaxi gets mugged and knocked unconscious, or has a heart attack and falls onto the sidewalk before they can close the door.  \n\nThe robotaxi itself, and the robotaxi system, need to be able to handle edge cases to prevent vehicles from getting stuck, and handle those cases in a cost effective manner.", "score": 0, "replies": []}]}, {"body": "Model x falcon doors far too finicky for robotaxi. 1/3 time they don't open properly.", "score": 3, "replies": []}]}, {"body": "It’s also odd to charge 12k with take rates not improving when they can charge 6k and then just do a different rev split in event the network is created", "score": 1, "replies": [{"body": "The truth is there's never going to be a network for current cars", "score": 6, "replies": []}]}]}]}]}, {"body": "Told you so.\n\nBuilding the Tesla factory in Germany was a bad idea.\n\nThe majority of my fellow germans are collectivists who now feel the reality they have created for themselves.\n\nDeindustrialization is occurring in real time,  while the government recorded record tax revenue. Argentina was once a prosperous and great nation as well.\n\nThere wasn't even a statement from our Interior Minister about the attack on Tesla. Extremism is tolerated when it is directed against evil capitalism. What kind of signal does this send to other global companies that want to open a location in Germany?\n\nCollectivism leads to ruin, regardless of whether it's from left or right. Germany deserves it.", "score": 18, "replies": [{"body": "I used to work for a German company 10 years ago. It was a great engineering culture. Enjoyed my time there too. Hope it’s not lost.", "score": 3, "replies": [{"body": "We still have a lot of talent in germany. I hope we can turn the ship around in the next years.", "score": 2, "replies": []}]}, {"body": "The reality check that has been due for Europe is finally arriving.  Germany seems to be the epicenter of it.  There will be political revolutions.  I feel for the German people who seem to have arrived at this conclusion years ago, but the government is still dragging them further into the abyss", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "What does my post have to do with putin?", "score": 2, "replies": [{"body": "It's strange that they are more vocal about not upsetting Russia than domestic acts of terrorism.", "score": 3, "replies": [{"body": "I also don't like Putin, but I still don't see the connection between the attack on Tesla and Putin. Did the warlord himself write something about the attack?", "score": 1, "replies": []}]}]}]}]}, {"body": "NEWS: Tesla China insured units  \n\n<Mar 2024> \n(25)-3 : 12,500", "score": 17, "replies": [{"body": "Its good actually", "score": 8, "replies": []}, {"body": "I guess we drop more today", "score": 4, "replies": []}, {"body": "🚀🚀", "score": 3, "replies": []}]}, {"body": "Well, at least crypto isn't disappointing me yet", "score": 7, "replies": [{"body": "Making me bipolar", "score": 2, "replies": [{"body": "ElonMuskWario.gif", "score": 3, "replies": []}]}]}, {"body": "The cool thing about percents is we can have -5% every day forever!", "score": 9, "replies": []}, {"body": "A lot of pumping GOOG on these parts lately. I’m not sold on it. To be fair, I’m not buying TSLA at this time either, but am holding.\n\nConsider Mike Solana’s take on Google:\n\nhttps://www.piratewires.com/p/google-culture-of-fear\n\nThen consider Clayton Christensen’s classic “The Innovator’s Dilemma” and where in that paradigm does Google fit.\n\nSearch is a giant cash cow and the money will still flow for the foreseeable future but is Google more likely to disrupt or be disrupted? Is there massive growth in Google’s near future (5-8 years—no one can see farther out than that)?\n\nIf they change structure and leadership they may be able to dominate for another generation. But in current form they are calcified and bloated and at risk for even search disruption by one or more of the AI agents lining up at the starting line of the next big race.", "score": 8, "replies": [{"body": "GOOG needs to fire 80% of work force", "score": 5, "replies": []}, {"body": "vast majority of search doesnt need an AI GPT butler curating it for me. Different industries IMO. ChatGPT mainly disrupts wikipedia.", "score": 6, "replies": [{"body": "Left wing woke google does not mention the border when you search for summer vacations.", "score": 3, "replies": []}, {"body": " Very possible although I suspect search will morph to a new AI-centric variant. Like I say, the cash will continue to flow, but is there growth there for GOOG? This is to generate discussion as there are some smart thinkers here.", "score": 3, "replies": [{"body": "its a matter of what growth is priced in. Goog is significantly lower PE than MSFT, TSLA, AAPL, so it doesnt need to grow as much.", "score": 5, "replies": [{"body": "Sure but earnings do need to grow for stock to appreciate. Unless the investment thesis is a safe harbor with some future dividends and some smaller hope of future growth. If that’s the play, then I get it.", "score": 2, "replies": [{"body": "its a 20 PE stock with massive buy backs, with the most history in AI if poor execution thus far, i think valuation is reasonable. And its AI problems are mostly political issues and not technologic.", "score": 3, "replies": [{"body": "Fair. If they restructure and get new leadership and cut workforce, I’m in. Will be an interesting decade.", "score": 1, "replies": [{"body": "by then itll be priced as such. Now you can gamble on that happening.", "score": 3, "replies": [{"body": "Good point. Although an aircraft carrier doesn’t turn on a dime so the astute will see it happening.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "It’s just me pumping it 🤣\n\nAll noise. Most of planet doesn’t give a shit about woke etc. search, ai, cloud, YouTube, etc\n\nPEG 1.26 + forward Pe 20", "score": 5, "replies": [{"body": "1.) Macro expert\n\n2.) GOOGsplainer", "score": 3, "replies": [{"body": "Sure.", "score": 1, "replies": []}]}, {"body": "And NVDA PEG is 1.3. Which is more likely to be a disruptive innovator over next 5-8 years? Again, just stimulating discussion.", "score": 2, "replies": [{"body": "I will offer one I’m buying on dips: Mercado Libre ($MELI) PEG 1.06. It’s like Amazon + PayPal in Latin America. Terrific management team, still growing. Has run up a lot but I think there’s still room to grow. NFA &etc.", "score": 2, "replies": []}, {"body": "Ya I mean i made my bet. I’ll see how it pays off over next year 🥳", "score": 1, "replies": [{"body": "🍻", "score": 1, "replies": []}]}]}]}]}, {"body": " [@Tesla](https://twitter.com/Tesla) Join Franz [@woodhaus2](https://twitter.com/woodhaus2) (Chief Designer) & Lars [@larsmoravy](https://twitter.com/larsmoravy) (VP Vehicle Engineering) for a chat about the new Model 3  Streaming live on March 7 at 2pm PT  Submit questions below 📷\n\n https://x.com/Tesla/status/1765060707874206171?s=20", "score": 7, "replies": [{"body": "Tweeting to the choir isn’t working. Maybe live-streaming to the choir will???", "score": 4, "replies": []}, {"body": "They must be on a tour of somekind.  They both showed up on Jay Leno’s again.  I think I’ll call them Lars and Franz, I hope they’ll pump us up!", "score": 3, "replies": [{"body": "They are great together. Different and the same", "score": 2, "replies": []}]}, {"body": "unsubscribe", "score": 1, "replies": []}]}, {"body": "https://x.com/sawyermerritt/status/1765130709813915928", "score": 8, "replies": [{"body": "”patience is required” bitch please", "score": 5, "replies": [{"body": "Patience w ceo", "score": 1, "replies": []}]}, {"body": "I’d kill for 234", "score": 2, "replies": [{"body": "lol it’s only been two months", "score": 1, "replies": [{"body": "Seems so far", "score": 3, "replies": []}]}]}]}, {"body": "First.  Sigh", "score": 7, "replies": [{"body": "Can't be worse than Glib's -7% today,  right?...💀", "score": 5, "replies": [{"body": "I don’t know what you’re talking about you’re a crazy person", "score": -2, "replies": [{"body": "If you're gonna take credit when it goes up on days you're first you're also gonna take responsibility when it craters", "score": 4, "replies": [{"body": "ive never done either of those things", "score": 0, "replies": []}]}]}]}, {"body": "![gif](giphy|3o6MbcHn9LVhXAT2cE)", "score": 3, "replies": []}]}, {"body": "Anyone wanna ride a big worm", "score": 7, "replies": [{"body": "aren't we already?", "score": 4, "replies": [{"body": "Worms riding us", "score": 3, "replies": []}]}, {"body": "Loomis probably has a few we could get ahold of", "score": 1, "replies": [{"body": "Not that kind of worm", "score": 1, "replies": []}]}]}, {"body": "$nvda never red for long lol", "score": 7, "replies": []}, {"body": "Even target can beat earnings. They are so woke tho.", "score": 7, "replies": []}, {"body": "How is everybody today?", "score": 7, "replies": [{"body": "Elon having a great day. Twitter servers up, Facebook servers down TSLA stock down.  All in a days work.", "score": 13, "replies": []}, {"body": "Good. Sold tsla for 200 a couple days ago and just bought APPL at $179.😊", "score": 6, "replies": [{"body": "Move your money where it's happiest over the next 10 years. 👌", "score": 1, "replies": []}]}, {"body": "Doing alright. In a margin call, but I don’t really care anymore. I can deal with it tomorrow. I might need to close a stinky pile of Jan. 2025 $100 puts 💩. \n\nBut I’ll write way more Jan. 2026 $70 puts and go even more long, with even more premium in my pocket.", "score": 2, "replies": []}]}, {"body": "When will Nate sell all his TSLA and go full margin into NVDA? That will be the bottom.", "score": 6, "replies": [{"body": "Today is Natepleb's fault", "score": 5, "replies": []}, {"body": "I think Nate will sell if we go bellow 150", "score": 2, "replies": [{"body": "He sold at 212 which was in hindsight smart", "score": 3, "replies": []}, {"body": "![gif](giphy|6ZzMaTHNKPy0g)", "score": 1, "replies": []}]}]}, {"body": "Google goin green", "score": 7, "replies": [{"body": "🙌🏼", "score": 4, "replies": []}]}, {"body": "BTC going to zero", "score": 8, "replies": [{"body": "hyperbole is killing the lounge", "score": 8, "replies": []}, {"body": "Remindme! 1 year", "score": 4, "replies": [{"body": "I will be messaging you in 1 year on [**2025-03-05 19:24:36 UTC**](http://www.wolframalpha.com/input/?i=2025-03-05%2019:24:36%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/TSLALounge/comments/1b6ukjc/tsla_daily_thread_march_05_2024/kthv8oa/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FTSLALounge%2Fcomments%2F1b6ukjc%2Ftsla_daily_thread_march_05_2024%2Fkthv8oa%2F%5D%0A%0ARemindMe%21%202025-03-05%2019%3A24%3A36%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201b6ukjc)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "its dead again for the 9303rd time!", "score": 4, "replies": [{"body": "1,000,000 or bust", "score": 3, "replies": []}]}, {"body": "Lolol", "score": 3, "replies": []}]}, {"body": "Been avoiding the market today and just peaked. @&$\\^!#$@\\^@$#!", "score": 7, "replies": []}, {"body": "Super Mega Cock Inc. and Nvda will not be denied! Hope springs eternal!\n\n&#x200B;\n\n![gif](giphy|HAx8k1165YkWQ)", "score": 7, "replies": []}, {"body": "Can’t deny that everything is at all time highs and we are headed to death it’s sad", "score": 13, "replies": []}, {"body": "Gordon would now rather talk about bitcoin and inflation\n\nhttps://x.com/gordonjohnson19/status/1764719180207489168?s=46", "score": 5, "replies": [{"body": "Shit. How far we’ve fallen. We are too shit for Gojo.", "score": 11, "replies": []}, {"body": "I thought the same yesterday. He needs TSLA to moon to thrive 🤣", "score": 5, "replies": []}, {"body": "How far have we fallen ", "score": 2, "replies": []}]}, {"body": "10 yr yield collapsing. On seemingly no news as far as i can tell thus far?", "score": 6, "replies": [{"body": "If stocks down and bonds down thats market anticipating recession.\n\nStocks up bonds down is soft landing.\n\n Bonds up stocks up is economy too strong", "score": 3, "replies": []}, {"body": "Some economic data was released today  \nhttps://www.marketwatch.com/economy-politics/calendar", "score": 3, "replies": []}, {"body": "Could be related to China’s deflation and issues", "score": 2, "replies": [{"body": "That wouldnt have caused it to drop that fast and sharply at this timing.", "score": 2, "replies": [{"body": "It’s definitely a little odd. Haven’t seen any US economic data this week to warrant", "score": 2, "replies": []}]}]}]}, {"body": "we need to build a wall around giga berlin, number one priority", "score": 6, "replies": [{"body": "first ask if the german public is aware of this, wow, concerning !!!", "score": 4, "replies": []}, {"body": "I'm sure a wall in Berlin would be great for optics lmfaoo", "score": 4, "replies": [{"body": "![gif](giphy|kc06qPieCwc4rZQ3Te|downsized)", "score": 1, "replies": []}]}]}, {"body": "Master Trader Update- yeah...probably should have sold those smci calls yesterday after making a good bit of money on the pop. Currently cucked and fucked on those, but they expire April so there still a chance I get out alive.", "score": 5, "replies": [{"body": "Being long tesla is all you had to say. Definition of bad investors right here", "score": 7, "replies": [{"body": "![gif](giphy|VG2OzjYkBLK9vGf3UH)", "score": 3, "replies": []}]}, {"body": "always sell calls when they’re up more than 50% ive learned", "score": 4, "replies": []}]}, {"body": "Sorry to bother everyone as this only applies to my office building, but please clean the bathroom on floor 7!", "score": 7, "replies": [{"body": "Someone just opened Schrodinger's Portfolio on floor 7!", "score": 2, "replies": []}]}, {"body": "u/Magikarp_to_Gyarados \\-- are you now selling [this swag](https://karpproshops.com/) ? ;)", "score": 6, "replies": [{"body": "we need him to come in here and type out a long and thoughtful essay about why hes still long tesla and this is just a temporary storm soon to pass.", "score": 4, "replies": [{"body": "hahaahahaha that reply is incoming im certain. dude is super sharp, would love to have him on my team at work ;)", "score": 3, "replies": [{"body": "Yes indeed", "score": 3, "replies": []}]}]}, {"body": "Not my shop, but they are very nice!", "score": 3, "replies": []}, {"body": "Too bad we can't send one to him for his birthday.  He's too smart to dox himself", "score": 2, "replies": [{"body": "would absolutely send something nice his way. maybe during our yacht party i can get him a hat or something", "score": 1, "replies": []}]}]}, {"body": "https://x.com/live_munro/status/1765056064003744138?s=46&t=mG-wx8ewMg03AyZIsmD4-g\n\nGood", "score": 6, "replies": [{"body": "/u/growawaybro pull in your favor ask to help break it down", "score": 7, "replies": [{"body": "Damn didn’t he have all leaps. He’s prob wiped out now", "score": 3, "replies": [{"body": "can't speak to his tsla positions, but I have a feeling he's doing fine", "score": 4, "replies": []}, {"body": "He did haave a lot of leaps but also makes 1M annually iirc.\n\nHe’s fine.", "score": 4, "replies": [{"body": "Didn’t know that.", "score": 1, "replies": []}]}]}, {"body": "Hey sorry just saw this. Haven’t been spending much time on Reddit but all is well. \n\nWill call Sandy on Monday and see what’s up, glad to see them get a CT", "score": 1, "replies": []}]}]}, {"body": "![gif](giphy|8cdfoJuYuz2u27DAAO|downsized)", "score": 7, "replies": []}, {"body": "Crypto shedding bigly", "score": 6, "replies": [{"body": "healthy pullback, right?", "score": 3, "replies": [{"body": "Possibly, bear trap, bull trap, we all trapped", "score": 6, "replies": [{"body": "![gif](giphy|Z1LYiyIPhnG9O)", "score": 5, "replies": []}]}]}, {"body": "I had like 0.02 in Coinbase I almost sold at ATH lol. Should have", "score": 3, "replies": []}]}, {"body": "2026 $420 calls actually pretty cheap 🧐", "score": 6, "replies": [{"body": "No calls while bird lives", "score": 10, "replies": [{"body": "if twitter goes down in flames we are taking that ride with it...maybe it should be no calls while elon is still ceo of both companies ?", "score": 5, "replies": [{"body": "He can take us down as ceo or not", "score": 4, "replies": [{"body": "damn it you're right, I forgot Chief Influencer/Twatter Maximus/ Ambassador of the Planet/ Border CE0 powers of cuckery", "score": 2, "replies": []}]}]}]}, {"body": "I dunno.... that's alot of theta. I'd rather buy in the money.", "score": 1, "replies": []}]}, {"body": "Supercharge credit is up to 10k for new purchases. Was 5k 3 days ago", "score": 5, "replies": [{"body": "Fuckers will try anything besides ads", "score": 4, "replies": []}, {"body": "weak", "score": 2, "replies": [{"body": "Two years tho much better than 6 months", "score": 2, "replies": [{"body": "Hey buddy, he’s working for free. Fucker is not concerned with you, gfy 😈", "score": 1, "replies": []}]}]}]}, {"body": "Explains a lot\n\n\nhttps://www.dailymail.co.uk/news/article-13161915/Elon-Musk-meets-Donald-Trump-campaign-funding.html", "score": 6, "replies": [{"body": "Not really. Nothing new.\n\n\"He personally has provided funding to politicians including Hillary Clinton, Barack Obama, Marco Rubio, George W. Bush and John Kerry.\"", "score": 4, "replies": [{"body": "This explains it\n\nThose close to Musk also confirmed he believes Biden needs to be removed from office in November, according to the NYT. \n\nHe's willing to push any issue that can fuck with biden. I don't think he cares at all about the border, because it was never a thing to him before, but now it's bidens vulnerability so Elon tweets border fud every hour.", "score": 7, "replies": [{"body": "I see it as he cares about the border a lot, as well as getting the government off his ass targeting him. And that's why he believes Biden needs to be removed from office. \n\nDon't see how that's new or surprising.", "score": 2, "replies": [{"body": "Government targeting him w massive ev subsidies. The elon persecution paranoia is total self induced bs", "score": 3, "replies": [{"body": "Yeah that's why he donated to dems before.\n\nNews at 11: Rich guy lobbies shady politicians to get what he wants", "score": 2, "replies": []}]}]}, {"body": "Looks like a win for Biden then if he’s backing trump", "score": 3, "replies": [{"body": "Yah Elon touch of death", "score": 2, "replies": []}]}]}]}, {"body": " but is it enough to get the trumptards to buy EVs?", "score": 1, "replies": []}]}, {"body": "Germany really is the sick man of Europe these days\n\nConsidering parts of the city of Berlin were left without power, this is an act of terrorism. Let's see if anyone will be prosecuted for doing this or not", "score": 13, "replies": [{"body": "While German authorities are often turn a blind eye on right wing terrorism, they usually also go very heavy against left wing terrorism. It's sad that with German history there is this kind of disproportional behavior but you can think of police being one of the favorite repressive tools of the right and a natural enemy of the left (left in Germany means anarchist). So right-wing minded people tend more to become policemen rather than left-wing people. In any case, expect there to be action.", "score": 4, "replies": []}, {"body": "Is there anywhere in Europe that isnt sick anymore?", "score": 4, "replies": [{"body": "The entire West I would say.", "score": 3, "replies": []}, {"body": "Demographics unfortunately points it will get worse.", "score": 3, "replies": []}]}]}, {"body": "I miss when I felt like Elon was a hero", "score": 21, "replies": [{"body": "Me too", "score": 4, "replies": []}, {"body": "He never was", "score": 0, "replies": [{"body": "he said \"felt like\"", "score": 10, "replies": []}]}]}, {"body": "SpaceX needs to launch a counter attack on the Brandenburg terrorists. 🚀💥💥", "score": 10, "replies": []}, {"body": "Now u know what happens when you limp dick at macro ath and macro pulls back even a bit", "score": 11, "replies": [{"body": "we are limp and micro penii at same time", "score": 3, "replies": []}]}, {"body": "bruh... even Nvda is red! DOOM! SELL EVERYTHING!\n\nRate cut fears/doubts/concerning/inflation/   back on the menu boys!", "score": 5, "replies": []}, {"body": "voting day, facebook down? cui bono", "score": 5, "replies": []}, {"body": "Why are they being called “activists”, that is straight up terrorist behavior.", "score": 6, "replies": [{"body": "And why not activist a diesel truck plant or coal powerplant or something?!?  Argh", "score": 5, "replies": []}]}, {"body": "NVDA green in 3....2....", "score": 5, "replies": [{"body": "im gonna sell a little bit of nvda at 900's.", "score": 6, "replies": [{"body": "Open a CC then. Make it exciting and stressful at the same time!", "score": 2, "replies": [{"body": "these are in some sort of deferred tax ira account that no options allowed", "score": 2, "replies": []}]}]}]}, {"body": "10yr pulling back a decent amount and tech and risk on assets selling off", "score": 6, "replies": [{"body": "Make it make sense", "score": 3, "replies": [{"body": "A little recessh coming our way", "score": 1, "replies": []}]}, {"body": "Recession play", "score": 2, "replies": [{"body": "That’s what I was thinking. Are you seeing any data other than what’s come out of China that might explain it?", "score": 1, "replies": [{"body": "I don't think u need any new data, sometimes market prices in too much not recession, and has to unprice some of it even if there's still no recession. Market is a positive feedback stretched to the limit in an inherently unstable balance.", "score": 2, "replies": [{"body": "True", "score": 1, "replies": []}]}]}]}]}, {"body": "Good news! I'm no longer bipolar.  Both balls are red now!", "score": 4, "replies": [{"body": "Should get that checked", "score": 3, "replies": []}]}, {"body": "Instead of fighting open borders in Murica, maybe Elon should focus on fighting open borders on your own factory 🎤", "score": 9, "replies": []}, {"body": "Can we write a letter to the Tesla board to do their job? Those 29million shares should come out of their pockets and Elons! “It’s the right thing to do” for not doing ur jobs", "score": 9, "replies": [{"body": "I agree that any penalties that the Delaware court assesses against Tesla, should be paid entirely and exclusively by the Tesla board members who caused this disaster back in March 2018.\n\n&#x200B;\n\nOn page 152 of the 2017 10-K, are listed Tesla's board members as of February 22, 2018:\n\n[https://www.sec.gov/Archives/edgar/data/1318605/000156459018002956/tsla-10k\\_20171231.htm](https://www.sec.gov/Archives/edgar/data/1318605/000156459018002956/tsla-10k_20171231.htm)\n\n>Elon Musk  \n>  \n>Brad W. Buss  \n>  \n>Robyn Denholm  \n>  \n>Ira Ehrenpreis  \n>  \n>Antonio J. Gracias  \n>  \n>James Murdoch    \n>  \n>Kimbal Musk  \n>  \n>Linda Johnson Rice\n\nNote that Steve Jurvetson was listed as a Tesla board member, but took a leave of absence from Tesla in November 2017 amid allegations that he had sexually harassed people at his venture capital firm.  I believe Jurvetson continued to be absent from Tesla throughout 2018, as his signature does not appear on the company's 2018 10-K form ([https://www.sec.gov/Archives/edgar/data/1318605/000156459019003165/tsla-10k\\_20181231.htm#Item\\_10](https://www.sec.gov/Archives/edgar/data/1318605/000156459019003165/tsla-10k_20181231.htm#Item_10))\n\n&#x200B;\n\nFrom the 2019 Proxy Statement, of the non-Elon directors:\n\n[https://www.sec.gov/Archives/edgar/data/1318605/000156459019014268/tsla-def14a\\_20190611.htm#OWNERSHIP\\_SECURITIES](https://www.sec.gov/Archives/edgar/data/1318605/000156459019014268/tsla-def14a_20190611.htm#OWNERSHIP_SECURITIES)\n\nBrad Buss owned 165,790 TSLA \n\nRobyn Denholm owned 130,776 TSLA\n\nIra Ehrenpreis owned 114,207 TSLA\n\nAntonio J. Gracias owned 500,826 TSLA\n\nJames Murdoch owned 41,596 TSLA\n\nKimbal Musk owned 209,444 TSLA\n\nLinda Johnson Rice owned 26,779 TSLA \n\n&#x200B;\n\nMultiply by 15 to account for the 5-for-1 and 3-for-1 splits.  \n\nThat's 17,841,270 in today's TSLA shares.  \n\n&#x200B;\n\nNote that some of these were options on shares, some of which have been exercised and some of the shares sold. \n\nIf Elon Musk were to pay some of the penalty himself, and the rest of the 2018 board cover the remainder, it is possible. \n\nHowever, I fully expect that Tesla's board would refuse to do the right thing, and leave all of us holding the bag for their negligence and incompetence", "score": 8, "replies": [{"body": "I agree. The least they could do is a stock buyback to be completed before/during the settlement.", "score": 3, "replies": [{"body": "Stock buy back is still investors money", "score": 6, "replies": [{"body": "At least reduces share float for investors. It would also signal future buybacks.", "score": 2, "replies": []}]}]}]}, {"body": "They could at least announce a 29 million share buyback. Given the stock price it would be good timing anyway.", "score": 1, "replies": []}, {"body": "did i miss something", "score": 1, "replies": []}]}, {"body": "Nate Dawg is clearly one of the Four Horsemen of the Stonk Apocalypse, if him and Eternal Knight show up on the same day we are going to beg for death!", "score": 10, "replies": [{"body": "Eternal will not return.", "score": 3, "replies": [{"body": "Sir Not-So Eternal Knight", "score": 5, "replies": []}]}]}, {"body": "This sub becomes more bearish the better fsd gets", "score": 12, "replies": [{"body": "If it's so good, why is it still not being pushed to all the FSD beta testers?", "score": 3, "replies": [{"body": "My guess is geography. Most training data is in CA. V12 is solely reliant on training data.", "score": 3, "replies": []}]}, {"body": "It's mindblowing that FSD isn't followed closer here, since without it, we're all screwed and stock going sub 100.", "score": 7, "replies": [{"body": "I regularly watch a group of FSD YouTubers (Chuck Cook, Dirty Tesla, and Black Tesla), and also keep an eye out for interesting FSD content outside of those 3.\n\nInitial Beta 12 demos show promise in terms of the software behaving more naturally.  This is important not just for passenger comfort, but for being more predictable to vehicles still manually driven by people rather than AIs.\n\nThe important thing with FSD 12 is not where it is today, but the rate of improvement as Tesla scales up its training compute capacity.  Sustained, and then rapid improvement would be proof that Tesla's end-to-end Neural Net approach is viable.\n\nHowever, if Beta 12 stalls out like Beta 11 did, that is going to be a big problem.  I don't know if Tesla has any alternative machine learning methodologies they could try if the Beta 12 path doesn't work.  There is no way to know in advance if the current or any prospective architecture would result in a viable robotaxi product.\n\nTesla's valuation also depends on energy and non-vehicle robotics.  The energy side of the business should result in higher and higher cash flows over time, from what I've seen disclosed in the SEC filings.  Tesla is paid for deployment and maintenance of Megapack deployments over time, so projects completed today will generate revenue streams for years.  The more Megapacks they deploy, the more and more those cash flow streams stack up", "score": 7, "replies": [{"body": "I'm also excited about energy.\n\nHowever, non-vehicle robotics and their applications will depend on FSD and AI training too.\n\nSoftware scales faster than hardware, at much better margins.", "score": 4, "replies": []}]}, {"body": "Totally. Also mindblowing since this sub talks nonstop about Nvidia and AI. Nvidia’s demand and value will come from companies building cool AI shit", "score": 3, "replies": [{"body": "The problem is the overpromise and underdeliver thats been a hallmark of fsd since it was called fsd. How many times has mindblowing, human level by end of year, come and gone?", "score": 9, "replies": [{"body": "We’re going on like 5+ years of that. V12 looks like a leap but I understand rate of improvement is super important. Either way it looks more monetizable and a path towards end goals", "score": 5, "replies": []}, {"body": "It's already human level for 99% of situations. Now it's all about ramping up compute and training data to get to 10x, 100x better than humans. That will happen quickly based on Tesla’s compute projections. Tesla (not Elon) has forecasted 100 exaflops of AI training capacity by year end.\n\nhttps://preview.redd.it/lns6mew05mmc1.jpeg?width=2048&format=pjpg&auto=webp&s=cb54351e165e487111f1ecdc735cbc00cd7ec7a0", "score": 5, "replies": [{"body": "Those are optimistic assumptions you are making. Nobody knows how compute correlates with human level performance. Nobody knows how long it will take or if it will ever be possible to make a robotaxi safer than humans.", "score": 2, "replies": [{"body": "That's fair, but I'm optimistic because I see FSD 12 as the start. Not as the 12th version of something that first started in 2016.", "score": 5, "replies": []}, {"body": "Tesla isn’t only ones making that bet on compute. Karpathy as well as the OpenAI guys are betting on it, too. Karpathy calls it “free intelligence”", "score": 3, "replies": [{"body": "It's not a bet", "score": 1, "replies": [{"body": "https://operator.blog/tag/neural-networks/\n\n“We can expect “more intelligence for free” by scaling.”\n\nWhether it’s enough for robotaxis is tbd but I’ve seen some speculation the $7T OpenAI is after is to try to brute force AGI", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Fsd is OK, its certainly not mind blowing yet", "score": 2, "replies": [{"body": "What is your idea of mind blowing? F1 racing? Costco parking lots on a Sunday?\n\nV12 is basically V1 of end to end nueral nets. And it's 100x better than V11.", "score": 9, "replies": [{"body": "Exactly. Here is James Douma’s post saying it’s 100x improvement after he tried V12 https://x.com/jamesdouma/status/1765165241451909374?s=46&t=WyhsS8WzmgKtgEuHZzFOrA", "score": 4, "replies": []}, {"body": "able to complete trips in a moderately crowded suburban environment without intervention 99% of the time.", "score": 1, "replies": []}, {"body": "Not hitting parked cars in parking lots for a start. Parking properly in a parking spot and not all crooked / half out of the spot.", "score": 1, "replies": [{"body": "Also tries to drive into oncoming lane", "score": -2, "replies": []}]}]}, {"body": "V12 looks way better from what I’ve seen\n\nExamples like this are a huge improvement - https://x.com/rebellionair3/status/1765157526876967342?s=46&t=WyhsS8WzmgKtgEuHZzFOrA\n\nMaybe it isn’t robotaxi ready yet, maybe it’s close, either way it certainly looks more monetizable", "score": 4, "replies": [{"body": "Could be still be equally far from robotaxi as v11.", "score": 2, "replies": [{"body": "V12 looks like a pretty big leap from what I’ve seen. Shared an example above of more human like behavior. Bradford also took James Douma on a drive and Douma pointed out each improvement and there were many. He also shared this post where he’s predicting V12 will be over a 100x improvement in interventions - \n\nhttps://x.com/jamesdouma/status/1765165241451909374?s=46&t=WyhsS8WzmgKtgEuHZzFOrA", "score": 4, "replies": []}, {"body": "im just glad elon isn’t making any enemies in the government what with all the regulatory hurdles robotaxi has to deal with", "score": 7, "replies": []}, {"body": "Ya it would need to drive me for an hour straight without an intervention, stop changing lanes abruptly, and not do weird shit to be Robotaxi ready.\n\nMaybe 3-5yrs.\n\nBut it’ll probably be more useable on the day to day!", "score": -1, "replies": []}]}]}]}]}, {"body": "+5 @184", "score": 10, "replies": [{"body": "+5 goog at 133", "score": 2, "replies": [{"body": "Hm bought at 134 yesterday. Will look and see.", "score": 1, "replies": [{"body": "Sackler got me with his eloquent musings of the goog", "score": 6, "replies": [{"body": "🥰🥰🥰", "score": 0, "replies": [{"body": "I've used their products since 2005 and now pay for the suite. Must be doing something right cause I loath subscription based software.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Pay package should be fully clawed back now that market cap req is not met", "score": 10, "replies": [{"body": "He's never going to see that pay package with stock in the shitter.", "score": 13, "replies": [{"body": "GOOD", "score": 7, "replies": []}, {"body": "Yup", "score": 6, "replies": []}]}, {"body": "I’m not voting for it.", "score": 6, "replies": []}]}, {"body": "Make supercharger miles transferable on a blockchain\n\nTesla continues to pay referrals in supercharger miles \n\nLeave it to TikTok influencers to do all the free ads you can imagine.  Tesla gets more sales, influencers get miles that they sell\n\nEventually the supercharger crypto becomes a proxy for electricity", "score": 7, "replies": []}, {"body": "Woke mind virus\n\nPolitics virus\n\nThe hero no one asked for virus\n\nSocial media virus\n\nEcho chamber virus\n\nDont care about money virus\n\n= Elon virus", "score": 8, "replies": [{"body": "many deadly strains of elon virus indeed", "score": 5, "replies": [{"body": "He’s working for free y’all, what do you expect!", "score": 7, "replies": [{"body": "just like elon, tesla investors also used to making no money for many years!", "score": 6, "replies": [{"body": "Used to making negative money", "score": 9, "replies": []}]}]}]}, {"body": "I disagree.\n\nElon virus is coming to the Lounge every day and complain about Elon doing bad stuff. This is not good for mental health. Vote, accept the result, or vote with your money.\n\nDon't stay in a toxic marriage.\n\nIf you think Tesla will outperform QQQ over the next 10 years, buy Tesla. If you don't, sell and buy QQQ. You are not married to the stock or its CEO.\n\nEdit: In the end it's all about making more money. Nothing else.", "score": 1, "replies": [{"body": "If elon didnt do bad stuff, we wouldnt have to call him out on doing bad stuff. CEO isnt the company, investing isnt a marriage. We love tesla, we love clean energy, we love sustainable transport. Tesla is the one that shouldn't stay in a toxic marriage with its toxic ceo thats hindering its mission. Lounge will never lie down and SEC. If you want that you can go to the tesla charts phantom zone.", "score": 11, "replies": [{"body": "true", "score": 4, "replies": []}, {"body": "![gif](giphy|ytwDCEAXOBSjqvCABW)\n\nXillix and crew thinking of the next unreadable stacked column excel chart", "score": 4, "replies": [{"body": "nobody cares", "score": 2, "replies": []}]}, {"body": "You can't call him out on reddit.\n\nHe will never read any of your posts. He only reads his twitter echo chamber. He doesn't care about you, he doesn't care about your opinion or any of your posts.\n\nI also don't like Elon's actions, but that doesn't mean that 90% of the Lounge content should be a crying orgy on how bad Elon performs as a CEO.\n\nIt won't change a thing and will only make the community worse.", "score": 0, "replies": [{"body": "like i said, theres a place if you want that filtered white washed tesla content.", "score": 8, "replies": [{"body": "Good point.", "score": 2, "replies": []}]}, {"body": "I’m exercising my free speech like our holy CEO wants", "score": 7, "replies": []}]}]}, {"body": "You're right. Just like TDS, many here have Elon Derangement Syndrome. I wouldn't get along with either of those guys, but I wouldn't let them live rent free in my head either.", "score": 3, "replies": []}, {"body": "Some people want to vent and thats ok", "score": 4, "replies": []}, {"body": ">Vote, accept the result, or vote with your money.\n\nI strongly encourage you to look at Tesla's SEC 10-K filing for 2023 and note the litigation Tesla is facing today for events around 2018. \n\nTSLA shareholders far, far wealthier than most of us on Reddit, are unlikely to let the events of 2022-present slide or accept things as they are.\n\nI fully expect vindictive TSLA shareholder lawsuits to plague Elon Musk and the Tesla board of directors to the end of this decade and beyond.  There's a certain subset of people who will accept nothing less than vengeance after they've lost 10s of millions, even if they still have 10s of millions in other assets.", "score": 1, "replies": []}]}]}, {"body": "Jesus what is up with this stock man", "score": 8, "replies": [{"body": "Brain cancer.", "score": 7, "replies": []}]}, {"body": "https://x.com/deitaone/status/1764972436078907457?s=46&t=FJnwUzmO93DGxmO6Ihn37g", "score": 3, "replies": [{"body": "I read that the power was restored", "score": 6, "replies": [{"body": "They won’t report that!", "score": 5, "replies": []}]}, {"body": "inside job", "score": 2, "replies": []}]}, {"body": "we ded", "score": 4, "replies": []}, {"body": "This is depressing", "score": 3, "replies": []}, {"body": "![gif](giphy|QRFBilZtdMstq)", "score": 4, "replies": [{"body": "ya mon", "score": 2, "replies": [{"body": "The market woke up and said, “ Feel the rhythm! Feel the rhyme! Get on up, it’s stock selling time!”", "score": 2, "replies": [{"body": "![gif](giphy|ToMjGpxuOWpx6s0Au0E|downsized)", "score": 2, "replies": [{"body": "Us in the long run 👏🏻", "score": 2, "replies": []}]}]}]}]}, {"body": "Selll everything! Buy soon to be bankrupt nycb!", "score": 4, "replies": []}, {"body": "any apple investors commit suicide yet?", "score": 4, "replies": [{"body": "no but Im sure we will have in our TSLA community", "score": 2, "replies": [{"body": "i think tsla community is immunized against that", "score": 2, "replies": [{"body": "After 100 this is fine.", "score": 2, "replies": [{"body": "yah all the vulnerable already died.", "score": 3, "replies": []}]}, {"body": "good point", "score": 1, "replies": []}]}]}]}, {"body": "Tgt recovering from politics mind virus. Someday it'll be us!", "score": 4, "replies": [{"body": "Except.... I have no idea who the CEO of Target is, and what groups they don't like it or what the latest thought was they had, whilst on the crapper.", "score": 3, "replies": []}]}, {"body": "Crwd 🤑", "score": 4, "replies": []}, {"body": "https://twitter.com/elonmusk/status/1765192628935557528?t=oGAL-DkzQ0ExcrOw9wRAwg&s=19", "score": 5, "replies": [{"body": "Rule number 1", "score": 2, "replies": []}]}, {"body": "If Elon starts actively campaigning for trump what should the Tesla board do?", "score": 4, "replies": [{"body": "Like attending RNC conventions or what? Lol \n\nElon was openly Democrat and openly supported dems not that long ago. You're free to choose who you want to support and promote in America.\n\nRemember Elon stepped down from Trump's advisory council in 2017. Trump bashes EVs. But Trump likes space innovation. This is just another political lobbying attempt by a rich guy.", "score": 7, "replies": [{"body": "He's really good with the rockets, just tremendous.", "score": 3, "replies": []}]}, {"body": "Probably just vote for him. Elon probably end up being science advisor.", "score": 4, "replies": []}]}, {"body": "gaping special agonizing physical cable longing sable hard-to-find beneficial dime\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 10, "replies": [{"body": "2.6b market cap.\n\nGAY", "score": 4, "replies": []}, {"body": "Worms finally coming for Apple?", "score": 3, "replies": []}, {"body": "Q4 2022 apple factories shut down from the virus. Lots of orders bumped to q1 2023. Now it's normalizing yoy and panic mongers w the no demand horseshit come out of wood work. Zero fucking dd from the fintwits", "score": 5, "replies": []}]}, {"body": "Nuland resigned. Is there a pivot coming with Ukraine situation?", "score": 7, "replies": [{"body": "Better late than never.  It was inevitable", "score": 4, "replies": [{"body": "Do you think we'll start to see a push for more diplomacy soon? Is that $100B bill dead?", "score": 2, "replies": [{"body": "Tough to say.  Most of the pundits I've seen think that the bill will go through and that it will buy enough time to get to the elections, which is the only real goal at this point.  The west has blown almost all of their negotiating power and terms aren't favorable for us.  Doubtful they will want to take the L now when they can push it back til elections and not suffer political ramifications of an unfavorable settlement.", "score": 3, "replies": [{"body": "Negotiating power?\n\nAre you at all aware of Russian history with treaties/cease fires/gurantees?\n\nThe several wars including Georgia and Chechnya, both of whom they had many cease fires and agreements, BROKE EVERY SINGLE ONE.\n\n[https://en.wikipedia.org/wiki/List\\_of\\_battles\\_involving\\_the\\_Russian\\_Federation](https://en.wikipedia.org/wiki/List_of_battles_involving_the_Russian_Federation)\n\nRussia had agreements with Ukraine, they can't be trusted there's no negotiating, they regroup and come back.\n\nPls stop supporting genocide (THIS IS WHAT HAPPENS IN OCCUPIED TERRITORIES WHERE THEY KIDNAP CHILDREN AND SEND ADULTS TO WORK CAMPS/JAIL/TORTURE/KILL).\n\nI don't get how anybody in their right man can parrot Russian propaganda, when you have access to history.\n\nIt's not because Musk is repeating Russian propaganda, that you have to believe him.\n\nUkraine has lived under Russian occupation, not to long ago. Millions were starved to death, now Russia is banning Ukrainian and trying to wipe them out.\n\nI'm European, the generations (including my grandparents) that lived through WWII always said the Russians were just as bad as the Nazi's. Germany changed, Russia didn't.\n\nThe USA and UK convinced them to give their nuclear weapons, leaving them vulnerable, anybody with any sense of right would want the USA to stand by them.", "score": 1, "replies": [{"body": "How did I know my comment would trigger a response from you?  🙄  My friend you are far too delusional about the reality of this situation to converse with.  You still think Ukraine will win back Crimea and join NATO and you constantly misrepresent my factual analysis of the harsh reality of the war with support for Russia.  If you and the other deranged had listened to what I and much more relevant and powerful people have been saying all along then Ukraine would still hold far more territory and you could have prevented the death of hundreds of thousands.\n\n I don't even bother.", "score": 3, "replies": [{"body": "Factual analysis?\n\nHow about you analyse every deal Russia has made under Putin, concerning similar situations, looking at Georgia and Chechnya.\n\nHow about analysing the cities that were taken back from Russia, you know, the ones with torture chambers, mass graves?\n\nHow about looking at all the children abducted and what happens to the adults, looking at Georgia and Chechnya.\n\nYou're the one repeating Russian propaganda as if it's factual, typical for people like you to call everyone else brainwashed and delusional. Putin and his cronies were making fun of the West when they were assembling troops on the Ukrainian border.\n\nPUTIN MADE FUN OF PEOPLE CALLING RUSSIA A THREAT TO UKRAINE IN FEBRUARY 2022, SAYING AN INVASION WAS FEAR MONGERING AND WESTERN MEDIA LIES.\n\nIt's not up to you to decide what Ukraine will do, with or without US help, Ukraine will not surrender. The USA breaking promises and showing themselves to be unreliable partner is bad for the USA and the world. What message do you think it sends?", "score": -1, "replies": []}]}]}]}]}, {"body": "NATO will be involved just enough to have Russia on the slowest possible offensive for as long as possible to burn through their troops, but has no intention of defeating Russia or capture back territory let alone Crimea. Ukraine shouldn't count on the west to end this war.", "score": 1, "replies": [{"body": "Does Ukraine have the manpower to continue the war indefinitely?", "score": 3, "replies": [{"body": "Not unless on the defense having favourable kill ratios and at the cost of countless lives", "score": 3, "replies": []}]}]}]}]}, {"body": "Berlin attack undoubtedly perpetrated by eu brown illegals. Ceo of the border must redouble his efforts.", "score": 10, "replies": [{"body": "I didn't know he was CEO of the U.S. border AND Europe! Impressive", "score": 3, "replies": [{"body": "Ceo of every border if the other side is dark skinned.", "score": 4, "replies": []}]}]}, {"body": "So of course I sold puts right before some German stooges of Putin* burn down the electrical lines. Sigh.\n\n*Assertion without evidence in this particular case, but with a long history of similar proven cases.", "score": 5, "replies": []}, {"body": "Which one first, BTC 70k or TSLA 170s? Feels like we will find out today.", "score": 6, "replies": []}, {"body": "https://twitter.com/elonmusk/status/1765032973693288610?t=jsO5i8gSpETT9P4SGmlXSA&s=19", "score": 6, "replies": [{"body": "I've seen people devolve into conspiracy theorist xenophobes over long periods of time but since Elon bought Twitter, his brain melted at a record pace.  His cognitive dissonance is astounding. Radicalized by his own supply.", "score": 15, "replies": [{"body": "There was no net positive of Elon owning an echo chamber that already is full of simps that worship him, lol", "score": 14, "replies": [{"body": "💯", "score": 6, "replies": []}]}]}, {"body": "I truly wonder if the aoc and bernie 🐎 💩 kickstarted this shitshow lol", "score": 4, "replies": []}]}, {"body": "They made Elon buy Twitter bc they knew it would destroy him", "score": 5, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "No. Not every stink is elons cunt.", "score": 5, "replies": [{"body": "wen hat bets?", "score": 2, "replies": []}]}]}, {"body": "So these are all the flats and diagonals I'm considering. I want 2 things. Cash in my pocket via credit, and also to raise my strike price.\n\n&#x200B;\n\nhttps://preview.redd.it/9x0y1w4yxkmc1.png?width=888&format=png&auto=webp&s=e7b18e09f582fa20a0efd65ab4526eb17fb0a34c", "score": 6, "replies": [{"body": "CC Avenger's Part VXI : Basement End Game\n\n![gif](giphy|3oxHQpJKupQXsmU1JS|downsized)", "score": 6, "replies": [{"body": "![gif](giphy|MqnizcAAYRtEP1aKCF|downsized)", "score": 4, "replies": [{"body": "![gif](giphy|l41YkxvU8c7J7Bba0)\n\nI hope you can escape the jail, imagine the feeling of freedom as you emerge from the 100 yard sewage tunnel you've been crawling through! Imagine it , and it will be so", "score": 6, "replies": [{"body": "These positions were originally opened 1-4-23.\n\nIt's been a lot longer than 100 yards. I've crawled further than  Andy Dufresne.", "score": 6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "If my track record is to be trusted, some time within the next 2 weeks.", "score": 6, "replies": []}]}, {"body": "![gif](giphy|4GAUIfDrn0HFm)", "score": 3, "replies": []}]}]}]}]}, {"body": "I don’t know how many of each you have but one option is to roll the 3/15 180s to 1/2025 250c for credit. Use that credit on the 6/21 165s to roll those for a debit to 1/2025 220c. Would get both strikes much higher at the cost of time.\n\nIf we dump under 165 in June, you waste a lot of theta decay potential. But if we recover, this would get you higher than rolling month to month.", "score": 3, "replies": [{"body": "Can't intertwine the options and cash. You're seeing the combined view of Traditional and Roth IRA's.\n\n\nI haven't run the numbers on a 9+ LEAP yet, I'll do later.", "score": 2, "replies": []}]}]}, {"body": "https://preview.redd.it/1bfdhrk0olmc1.jpeg?width=1179&format=pjpg&auto=webp&s=68c03ff743c000a82d2ac844be17e6e767059b45\n\nDamn that would suck.", "score": 6, "replies": [{"body": "Takes us back to the good ole days of 2022 I told myself I can’t do that again and here we are", "score": 4, "replies": []}, {"body": "Jonas becoming more negative is bullish", "score": 3, "replies": [{"body": "A good time to buy is when bulls become more bearish, although that's not the best indicator tbh lol", "score": 4, "replies": [{"body": "Jonas is a good contra indicator but nothing is perfect. The note is also pretty dumb. If Tesla is an AI leader and their AI projects succeed, current stabilization of auto earnings becomes less important the better the AI becomes.\n\nV12 looks really good. Not saying it’s robotaxi ready but it does look more monetizable", "score": 2, "replies": []}]}]}, {"body": "Will convert a lot of my tax sheltered shares to ITM call options if that happens.", "score": 2, "replies": []}]}, {"body": "Sigh Elon", "score": 8, "replies": []}, {"body": "See this is what happens when you open the border.", "score": 9, "replies": []}, {"body": "Fook", "score": 3, "replies": []}, {"body": "Foook", "score": 3, "replies": []}, {"body": "fookedddd", "score": 3, "replies": []}, {"body": "I bought a lot of PFE over last 6 months. Started at $30, finish up yesterday. Average is like 26.50. Not gonna moon but I think the 6% dividend is safe, and the stock will recover eventually. Hopefully I get a 25-30% return in next 13-24 months (plus dividends) and can trim it out.\n\nAlso thank god we started. A”boomer/dividend portfolio “…. JPM, TGT, SCHD, WSM, LVMH, and DIS all doing well vs tesla.", "score": 3, "replies": []}, {"body": "what now? germany back up, china evs recovering. we just suck big time", "score": 3, "replies": []}, {"body": "https://x.com/deitaone/status/1765024929303421363 oh nvm 💀", "score": 3, "replies": []}, {"body": "![gif](giphy|Oc5Nz2NNkPqbC)", "score": 3, "replies": []}, {"body": "![gif](giphy|Ean7ZFQEvUTeg|downsized)", "score": 3, "replies": []}, {"body": "[https://x.com/lindayaX/status/1765050037300511027?s=20](https://x.com/lindayaX/status/1765050037300511027?s=20)\n\nx reports", "score": 3, "replies": []}, {"body": "![gif](giphy|xThuW0uZfF3rwVan4I)\n\nPull up you sonsofbitches!", "score": 3, "replies": [{"body": "Was really hoping on 240 by April.\n\nBUT, we just learned worst china deliveries since 2022, and increased awareness that the fed may not cut this year at all.\n\nIt’s adjusting to the new reality sinking in, which is that      deliveries and margins will further contract.\n\nAnd it’s adjusting a lot quicker and sooner than I think anyone could have imagined.\n\nDon’t be surprised to see 150 by April.\n\nDepending on the actual numbers posted, we could be back to 110 by May.", "score": 2, "replies": [{"body": "![gif](giphy|WxDZ77xhPXf3i|downsized)\n\nwhat you say makes sense but i hope you are wrong", "score": 2, "replies": []}, {"body": "There’s a small minority of us here that’s been saying bearish/not bullish stuff on TSLA/macro for a while but a lot of times get downvoted because it’s not 🚀 emojis lol.\n\nWith that said, crayons say things are kinda oversold and deserves some relief/bounce or at least stabilization here.\n\nOptions suggest 170-220 is possible until there’s a significant shift in sentiment/fundamentals.\n\nWith fundamentals, even if there’s an ev price war going on leading to less evs/margins, Tesla is still making and buying lots of batteries and those will go somewhere. If not evs then storage or stockpiling/securing supply for future growth.\n\nIf deliveries/earnings/macro disappoint then 120-170 opens up and will need a lot to bring it back to the dark days of 100 since there’s way less margin/leverage/no tax loss harvesting.\n\nOf course anything is possible and if the thought of 100 is unacceptable, then protect yourself with buying some puts. Small price to pay for some insurance. If you don’t want to lose/waste money on puts, sell calls at where you’re ok selling at to fund buying the puts.", "score": 2, "replies": [{"body": "I was hedged. I am just shocked it didn’t finish the gap fill to 212. But screwing around here for an hour I think I have a better understanding of why.\n\nYou see I play both directions.\n\n![gif](giphy|v9jXUKLZyF3JWxZTZ2)", "score": 2, "replies": []}]}]}]}, {"body": "NVDA can't keep mooning forever to prop me up on days TSLA crashes like this. I really need to seriously think about trimming my TSLA to reduce my risk exposure", "score": 7, "replies": [{"body": "You have this backwards. NVIDIA can't moon forever so you should think about NVIDIA exit point. Companies are beginning to invest in specialized chips for specific functions. As an example Groq's LPUs offer higher speed for lower cost when creating LLMs compared to NVIDIAs GPUs.", "score": 7, "replies": [{"body": "I don't think about NVDA exit point because I already roughly know where that is for me", "score": 7, "replies": [{"body": "I think therefore I am", "score": 3, "replies": []}, {"body": "The investor knows where his exit point is at all times. It knows this because it knows where the SP isn't.", "score": 4, "replies": []}]}, {"body": "That's the joke", "score": 3, "replies": []}]}, {"body": "We are approaching capitulation", "score": 5, "replies": [{"body": "I've held TSLA since 2017, how long have you held it?", "score": 6, "replies": [{"body": "Somebody sounds sensitive about their waning conviction", "score": 2, "replies": [{"body": "I lost all my conviction in 2022 after Elon pivoted to Twatter and mind viruses and forgot about transitioning the world to sustainable energy and putting humanity on Mars. I've just been hanging on hoping that maybe he might come to his senses someday", "score": 5, "replies": []}]}]}, {"body": "I think so, too, but we’re not there yet, atrocious though the investor sentiment be.\n\nThink we’re going to shake out some frustrated bag holders soon.", "score": 2, "replies": [{"body": "Investor sentiment isn't nearly dec 2022", "score": 2, "replies": [{"body": "ah yes those days\n\nReally, it ain’t even April 2013", "score": 2, "replies": []}, {"body": "Is that true? Or are there just far less so it’s quieter? I felt worse then but there was lots more margin back then for me and the majority of people", "score": 2, "replies": []}]}]}]}]}, {"body": "Confirmed:\n\nhttps://kontrapolis.info/12465/\n\nLiteral lunatics. Where is this world going. Like honestly. I don’t want to live here anymore.", "score": 6, "replies": [{"body": "assholes", "score": 2, "replies": []}, {"body": "WTF", "score": 2, "replies": []}]}, {"body": "mars canceled", "score": 4, "replies": [{"body": "Mars was never on the table.  Just a delusion that a douchebag sold his worshipers so they could justify giving him tons of money.", "score": 0, "replies": []}]}, {"body": "10 more at open - Doing my part. ", "score": 5, "replies": [{"body": "![gif](giphy|YYfEjWVqZ6NDG)", "score": 4, "replies": []}]}, {"body": "https://x.com/viggo_frb/status/1764930426701816012?s=46&t=mG-wx8ewMg03AyZIsmD4-g\n\n\nMorgenthau at work.", "score": 6, "replies": [{"body": "- The town of Erkner and parts of Berlin are experiencing power outages.\n\nAwesome. Soon everyone who lives there will turn against these terrorists.", "score": 5, "replies": []}, {"body": "They've worked out the only way to get rich off TSLA. Short it then go and destroy a factory", "score": 6, "replies": []}, {"body": "well that is just perfect..", "score": 2, "replies": []}, {"body": "How easy was it to make money in the warren buffet era? You invest in a good company and people will buy their products because they are better. THIS is what we have to deal with now. You can't even tell if they are payed by interest groups to harass Tesla or if they are just lunatics. Most likely just lunatics like the vast majority of people these days.", "score": 2, "replies": [{"body": "I do miss the old days when people seemed more logical. TSLA should be soaring and the company should be expanding but the CEO of Tesla supports a vast section of the population that believes EVs are a threat to humanity and they will do anything to keep burning coal and oil because switching to clean energy means you support science and “Wokism”, whatever that is. When the leader of a company is fighting against the success of his own company, it’s hard to gain new investors let alone keep the old ones. What has the world come to?", "score": 3, "replies": []}]}, {"body": "sloppy languid makeshift door close resolute pause theory snobbish drab\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 3, "replies": []}, {"body": "Not important, illegals are the real problem", "score": 4, "replies": []}, {"body": "it was a inside job", "score": 1, "replies": []}]}, {"body": "Optimus is priority number one.\n\nHe will be the best, mass produced security guard ever.", "score": 8, "replies": [{"body": "I propose a new model\n\nhttps://preview.redd.it/1gc6gk0r2jmc1.jpeg?width=678&format=pjpg&auto=webp&s=9a0e6ef7c54288ab2ba14321c04f96ee5905864e", "score": 3, "replies": []}, {"body": "It's designed to be easily overpowered/outrun by an adult.  It's not meant to be a soldier, it's designed to do repetitive, menial tasks in order to free up human capital/potential.", "score": 3, "replies": [{"body": "It was a joke (unless Optimus learns to handle a M4).", "score": 5, "replies": []}, {"body": "We will give it a gun", "score": 5, "replies": []}]}]}, {"body": "The stock is so cooked. Not even Mr. Jinx is around to tell us to buy the dip.", "score": 4, "replies": [{"body": "If he posts that gif again he's going back on my block list", "score": 7, "replies": []}]}, {"body": "Save us Cathie", "score": 5, "replies": [{"body": "She's busy mailing in letters at the request of BoomerMama", "score": 7, "replies": []}]}, {"body": "Today is difficult, tomorrow is much more difficult, but the day after tomorrow is beautiful. Most people die tomorrow evening", "score": 4, "replies": [{"body": "No, no, I saw the day after tomorrow.  It's actually Elon's master plan as it forces everyone to migrate to Mexico.", "score": 2, "replies": [{"body": "If you can't beat 'the illegals', become 'the illegals'.", "score": 3, "replies": []}]}]}, {"body": "If Elon selling I am done until they offer a share buy back", "score": 5, "replies": [{"body": "lol someone knew about germany yesterday, factory to be down several days 😂", "score": 5, "replies": [{"body": "You’d think 7% would be enough. Plus no more risks of price cuts lol", "score": 1, "replies": [{"body": "yesterday also china suck, ev down bigly", "score": 1, "replies": []}]}, {"body": "Sell the rumor, sell the news!", "score": 1, "replies": []}]}, {"body": "Is he also selling Apple? We just suck lol", "score": 5, "replies": []}]}, {"body": "Chief Border Officer not mentioning H&S on the Berlin sabotage first (Patel then had to jump in) is kinda sad.", "score": 4, "replies": []}, {"body": "Dodge Daytona EV gonna be a hit for the girls. It has a vibrator option. Innovation!\n\n[https://x.com/sawyermerritt/status/1765051701340389561?s=46&t=_15JQ0jaFGRxP2NA7gBqEA](https://x.com/sawyermerritt/status/1765051701340389561?s=46&t=_15JQ0jaFGRxP2NA7gBqEA)", "score": 4, "replies": [{"body": "“Fake exhaust sound that can get up to 126 decibels, same as a Hellcat's exhaust.”\n😂😂", "score": 4, "replies": []}, {"body": "moves like it weighs 6000 lbs... oh wai", "score": 4, "replies": []}]}, {"body": "Wonder if this was MM dumping before great Jobs data (which I’m sure it is). Then market 🚀 cuz jobs are good cuz no recession. POW talks about higher for longer + “data driven” and the march goes on 🚀\n\nThis is for everything but TSLA 🤣 for that we have to deal with Elon, terrorists, woke media, etc.\n\nMacro Econ Professor Sackler 👌🏼", "score": 3, "replies": []}, {"body": "I think dune resonates here because the conditions are similar. the stock market is like the desert and there’s a nateleb burrowing through it that could grab you at any moment and suck the life force out of you and upvotemeok is like princess irulan with her cute outfits", "score": 4, "replies": [{"body": "Don't forget the retard voice from the outer world.", "score": 6, "replies": [{"body": "messiah seemed cool at first and then he went and started a holy war", "score": 6, "replies": [{"body": "Dude was all about saving the world, then drank the water of maga life and decided trans and border was more impt.", "score": 9, "replies": [{"body": "his feydakin simps spurring him on", "score": 3, "replies": []}]}]}]}, {"body": "We’re like an arid wasteland surrounded by the oasis of the market at ATH.", "score": 4, "replies": []}, {"body": "🤣🤣🤣🤣", "score": 4, "replies": []}]}, {"body": "nahhh that's it. I'm waiting for a strong moment to unfollow Elon.\n\nThis guy has become pure filth. Noting interesting is coming from him anymore.", "score": 9, "replies": [{"body": "Only way to follow up on border updates is his truth", "score": 8, "replies": []}, {"body": "You still use Twatter?", "score": 7, "replies": [{"body": "I left when he fucked it up.", "score": 3, "replies": []}]}, {"body": "But how would you keep up to date with the latest news on woke ai and transgenderism?", "score": 7, "replies": [{"body": "Well shit, you got a point, can't miss out on that", "score": 3, "replies": []}]}]}, {"body": "He doesn’t stop throwing rocks in a glass house.\n\nGoogle is going to \\*\\*\\*\\*\\* destroy whatever nonsense Grok xAi thing he has going.\n\nNo one cares about Caitlyn Jenner - why are you asking it stupid questions. I need it to code, answer questions, plan travel, look shit up etc etc.\n\nAnyways - it’s amusing 🤣\n\nhttps://preview.redd.it/zej433a59gmc1.jpeg?width=1179&format=pjpg&auto=webp&s=403b2504a009749c8d3e474777f0d46ba06b9c94", "score": 7, "replies": [{"body": "Of all the things ai can do, the politics mind virus crew gets caught up in their usual dumb issues.", "score": 10, "replies": []}]}, {"body": "![gif](giphy|y2i2oqWgzh5ioRp4Qa|downsized)\n\nInb4 the actual first half...  /s", "score": 2, "replies": []}, {"body": "anybody got any spare spice melange I can ingest? I suddenly really need to be able to foresee the future", "score": 2, "replies": []}, {"body": "![gif](giphy|KDbi6mOb2O73HHs0xg|downsized)", "score": 2, "replies": []}, {"body": "Glib- finally hunted down the new Coca Cola Spiced per your intel, and I gotta say I dig it quite a bit actually. So far no prescience nor worms have appeared yet, so that will effect my final score, but the flavors are there.", "score": 2, "replies": [{"body": "oh cool I gotta try that\n\nI don’t know why sand worms would appear though. spice is made when the fungal excretions of sandtrout mix with water to form a pre-spice mass, and worms don’t eat spice they eat sand plankton which are microscopic creatures that eat spice", "score": 2, "replies": [{"body": "Well I could argue the presence of the spice and worm activity are correlated!", "score": 1, "replies": []}]}]}, {"body": "[https://x.com/elonmusk/status/1764976308977594418?s=20](https://x.com/elonmusk/status/1764976308977594418?s=20)\n\nbullish", "score": 6, "replies": []}, {"body": "time  to move on and sell tsla heh", "score": 5, "replies": [{"body": "Suck my TSLA! Never! 🤪", "score": 7, "replies": [{"body": "Gfy", "score": 1, "replies": []}]}]}, {"body": "So glad to have gotten off this roller coaster lmao. Elon seems right on track to be a conservative podcast host.", "score": 5, "replies": [{"body": "Nah that requires social skills. He's on the road to pissing in jars in the penthouse.", "score": 16, "replies": [{"body": "Yikes, Howard Hughes.\n\nBut to be fair, Howard actually revolutionized travel.\n\nSeem more like Jim Carey from the movie 23 would be a better reference.\n\n![gif](giphy|rSnRCtzCGUCcw)\n\nIt began with a great concept sold to the audience, only to wimper out with its horrible ending and let-down.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "[Glares in History Teacher]", "score": 4, "replies": []}]}, {"body": "We’re going no where, one step forward two steps back. The v12 excitement is wearing off can’t wait for v13 news.", "score": 5, "replies": [{"body": "Q5 will save us", "score": 0, "replies": []}]}, {"body": "I set some low bids for $SAVE calls over the last month. Thankfully none of them hit.", "score": 2, "replies": [{"body": "Bankwupt", "score": 3, "replies": []}]}, {"body": "Disney continues road to recovery", "score": 4, "replies": []}, {"body": "Listing my car for sale soon, pray for me.", "score": 2, "replies": [{"body": "All I can afford rn is a  pagan Skål", "score": 5, "replies": []}]}, {"body": "https://twitter.com/stekkerauto/status/1764976756111343803?t=G3bGlBn4qBNz5QtHl2iZKg&s=19\n\nThe mental state of the world is concerning", "score": 3, "replies": [{"body": "Have you seen this sub?", "score": 6, "replies": []}]}, {"body": "Bought back some apple (5 shares) I’d trimmed at 195. Bought 5 more Google.", "score": 5, "replies": [{"body": "Nice!", "score": 1, "replies": [{"body": "Slowly turning into the not tesla lounge", "score": 9, "replies": [{"body": "I see this more of an investing forum + TSLA\n\nGoal is to make money 🫡", "score": 2, "replies": [{"body": "I see this place more as a therapy group 😂", "score": 1, "replies": []}]}]}]}]}, {"body": "$150, by Friday", "score": 5, "replies": []}, {"body": "*dune*", "score": 3, "replies": []}, {"body": "&#x200B;\n\nhttps://preview.redd.it/mvni6r63okmc1.png?width=1060&format=png&auto=webp&s=dcf0c9af70f849a23fa482ab2afb03add0a800ac\n\nOk... roll my Mar 180CC forward to an April 12 180CC and collect \\~1,680 in credit. With that added to my Roth cash stack I can buy another 16 shares @ 180. That brings my Roth share count to an even 400 and I'll be able to sell another CC.\n\nWhat could go wrong? Infinite money glitch is back, baby!", "score": 3, "replies": [{"body": "Should have rolled up and out. Not sure I would have done this trade.", "score": 1, "replies": [{"body": "I haven't, I still can. I can move diagonally or flat, really just targeting enough credit to buy up the other 16 shares. 84 shares sitting there uselessly bugs me.", "score": 1, "replies": []}]}]}, {"body": "Ladies and gentlemen,\n\nI stand before you today with a heavy heart and a deep sense of responsibility. Recent events have come to light, revealing that I have fallen short in upholding my fiduciary duties as the CEO of Tesla. I want to address this matter directly and take full responsibility for my actions.\n\nFirst and foremost, I owe an apology to the shareholders, employees, and stakeholders who have placed their trust in me to lead Tesla. I understand the gravity of the situation and the implications it has for the company and its reputation. I want to assure you that I am committed to rectifying the situation and learning from this experience.\n\nI acknowledge that as a leader, my foremost duty is to act in the best interests of Tesla and its shareholders. Unfortunately, recent decisions and actions on my part have deviated from these principles, and for that, I am truly sorry.\n\nIn response to these allegations, I am committed to cooperating fully with any investigations and regulatory authorities to ensure transparency and accountability. I understand the importance of adherence to fiduciary responsibilities, and I am determined to take the necessary steps to rectify this situation.\n\nEffective immediately, I will be working closely with Tesla's board of directors to implement corrective measures and improve corporate governance within the company. This includes a comprehensive review of internal processes and the introduction of safeguards to prevent such lapses in the future.\n\nI am fully aware of the impact this may have on the reputation of Tesla, and I want to reassure you all that I remain deeply dedicated to the mission and vision that drive this company. My commitment to innovation, sustainability, and advancing the greater good remains unwavering.\n\nIn the coming weeks and months, I will be actively engaging with Tesla's stakeholders to address concerns, answer questions, and rebuild trust. I understand that actions speak louder than words, and I am fully prepared to demonstrate through deeds my commitment to restoring the integrity of Tesla's leadership.\n\nI thank you for your understanding, and I am determined to emerge from this challenging period with a renewed focus on the values that define Tesla and its role in shaping a better future.\n\nElon Musk\n\n/u/Magikarp_to_Gyarados", "score": 3, "replies": [{"body": "😂", "score": 7, "replies": []}, {"body": "Kidnapped", "score": 3, "replies": []}, {"body": "Ladies and gentlemen,\n\nLook, I don't usually waste time on the nonsense that circulates, but I've heard some talk about me supposedly breaking fiduciary duties at Tesla. Let me be crystal clear – that's just not how I roll.\n\nI've built this company from the ground up, taken risks that most wouldn't even dream of, and all for what? To be accused of not playing by the rules? Please.\n\nTesla's success speaks for itself. If anyone thinks I'd jeopardize that for some fiduciary whatever, they clearly don't understand my priorities. I'm all about pushing boundaries, and sometimes people don't like that.\n\nSo, let's not get bogged down in these baseless claims. I'm here to lead Tesla, innovate, and make history. If you're looking for someone to point fingers at, look elsewhere. I've got a company to run.\n\nElon Musk", "score": 4, "replies": []}, {"body": "Is this the real life? Is this just fantasy? Caught in a landslide, no escape from reality.", "score": 2, "replies": []}]}, {"body": "I for one welcome bankruptcy.", "score": 2, "replies": []}, {"body": "Li auto got robbed today.", "score": 2, "replies": []}, {"body": "Pretty normal beta", "score": 2, "replies": [{"body": "Doesn’t apply anymore because we don’t go up with a normal beta", "score": 2, "replies": []}]}, {"body": "What will Elon ask for in return when Trump seeks donation\n\n- Prioritize border, anti-trans and anti-woke agenda\n\nOr\n\n- Retain EV point of sale credits\n\n\nhttps://x.com/marionawfal/status/1765176633504260103", "score": 2, "replies": [{"body": "Ladies and gentlemen, let me tell you, we've got some incredible folks in this country, and Elon Musk, he's done some tremendous things. You know, I've always said, we need that kind of business mindset in our government.\n\nNow, I've heard Elon's got some demands, wants to make some deals. Well, that's what we do, folks – we're dealmakers. But let me be clear, I always play by the rules. The best deals are the ones that benefit everyone.\n\nElon, he's a smart guy, very smart. We might not agree on everything, but that's okay. I'm here to work for the American people. Now, if Elon's got ideas, we'll sit down, have a talk, negotiate – that's how business is done.\n\nBut let me make one thing crystal clear, we're not cutting any corners, we're not doing anything that's not right for the American people. This country is about integrity, it's about doing things the right way.\n\nSo, Elon, if you want to be a part of making America great again, let's talk. But it's got to be a win-win, and it's got to be within the bounds of what's right and legal. We're not doing anything less than the best for this great nation. Thank you, God bless you, and God bless the United States of America.", "score": 2, "replies": [{"body": "![gif](giphy|VSoRPmlMaKR8xCmq7F|downsized)", "score": 2, "replies": []}]}]}, {"body": "🚀", "score": 2, "replies": []}, {"body": "I couldn't imagine being in my 30's,40's 50's etc and holding this stock right now. The older folks in here have some big huevos", "score": 2, "replies": [{"body": "Or just a masochistic fetish", "score": 1, "replies": []}]}, {"body": "+5", "score": 1, "replies": []}, {"body": "Picked up 10........NVDA.", "score": 1, "replies": [{"body": "![gif](giphy|MYJT0jtwsBA9aGj0lQ)", "score": 5, "replies": [{"body": "150 is where I'll buy TSLA again. Otherwise it's just a falling knife", "score": 8, "replies": [{"body": "Me too. Although I wonder what I’ll say when we’re down there 🤣", "score": 4, "replies": [{"body": "Find out Friday", "score": 4, "replies": []}, {"body": "Feel free to gloat then, it's earned!", "score": 3, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Encouraging people to vote is not censorship. It's actually more democratic than what the left is today.", "score": 1, "replies": []}]}, {"body": "thanks a lot for the first post u/dankroughly you big dumb idiot what have you done", "score": 0, "replies": [{"body": "Glass houses, glibgloby.  I don't think I can forgive you for yesterday.", "score": 7, "replies": [{"body": "I wasn’t even *here* yesterday I was watching dune!  \n\nhow dare you talk to your NAU superiors like this", "score": 0, "replies": [{"body": "Lies", "score": 6, "replies": []}]}]}, {"body": "Here I am taking a bullet for you and this is how you treat me?\n\nDid you really want first post today?", "score": 3, "replies": [{"body": "only kidding, [thank you for your service](https://youtu.be/qhxlZC8BZJ4?si=G60CZD7muusp5KZE)", "score": 0, "replies": []}]}]}, {"body": "20M cars at $40k and 10% op margin on the hardware at 12x terminal EBIT, $960b market cap\n\nFriendly reminder/advice to know what business you are in if you buy this stock and also that the cars above current volume are sort of irrelevant for the valuation \n\nIf they solve any AI project like FSD or Optimus then these hardware numbers are totally irrelevant, if not you'll breakeven in 8 years", "score": 0, "replies": [{"body": "Does anyone really think they're gonna be doing 20m units in 8 years?", "score": 9, "replies": [{"body": "Not at the rate they are opening factories", "score": 3, "replies": []}, {"body": "That just strengthens my point", "score": -1, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "😑", "score": 2, "replies": []}]}]}
{"title": "Massive Tesla Lot in my backyard - puts? calls?", "selftext": "Soo over the last year there's been trucks delivering these bad boys. The lot's been anywhere from like 20-50% full but nowwww - shiet it's damn near full.\n\nAs an actual idiot, idk if this is good or bad. Wts does this mean!? Are these orders or extra inventory?\n\nEDIT: This is North Jersey for what it's worth. This conundrum puzzles me every morning \n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/pysvmz0v9imc1.jpg?width=3024&format=pjpg&auto=webp&s=94fcc9971d10d72d019eda4557de5dce32fbf738\n\nhttps://preview.redd.it/qdkw621v9imc1.jpg?width=3024&format=pjpg&auto=webp&s=df1fe9c28b80cf5f6747c1bf583ae6b5bde979d3", "id": "1b73k25", "created_utc": 1709640058.0, "score": 613, "upvote_ratio": 0.91, "num_comments": 258, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 7 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "Well in comparison when covod stopped all work I panicked. I got a random job at the airport loading cargo planes. Saw pallet after pallet of kitchen aid mixers that are 600ish a pop. Bought call options in WHR still the best pick I've ever done. Tax man destroyed me at the end of the year for that one hahaha", "score": 1, "replies": []}]}, {"body": "Are you near a port?\nAll car companies do this before mass shipping to other countries.", "score": 309, "replies": [{"body": "[deleted]", "score": 177, "replies": [{"body": "Thats why it smells there", "score": 30, "replies": [{"body": "The port smells because it is in New Jersey, or New Jersey smells because of the port?\n\nI think it's #1.", "score": 47, "replies": [{"body": "Positive feedback loop.", "score": 16, "replies": []}]}]}, {"body": "Wrong, only a small section.", "score": 0, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Yep. Its not unusual at all to see countless Teslas sitting in the parking lot near Paramus Park Mall.", "score": 4, "replies": []}]}]}]}, {"body": "probably going out of port newark elizabeth.", "score": 24, "replies": []}, {"body": "They wouldn't do it over weeks, it would happen over a day or two. Time is money in the shipping business.", "score": 17, "replies": [{"body": "Wonder if there are any issues that may be causing shipping delays going on in the world. Maybe I should look into that.", "score": 13, "replies": [{"body": "Weather…", "score": 3, "replies": []}, {"body": "Pew Pew!", "score": 3, "replies": []}]}, {"body": "I guarantee that lot is filled up and emptied constantly as shipments go out.", "score": -2, "replies": []}]}, {"body": "Tesla doesn’t really ship cars out from NA anymore. Just model a & x, and they don’t really sell those. ", "score": 10, "replies": []}, {"body": "Load on a vessel, sail via Red Sea, sink, collect the insurance. That's the only way to make money from Teslas now.", "score": 1, "replies": []}, {"body": "This doesn’t even look that unusual.  Have you see the back of a dealership?  In any given metro area there’s 3-5 ford dealerships that combined have far more vehicles that this lot.  Same for Toyota, Honda, etc.", "score": -4, "replies": [{"body": "I don't know about Toyota thus lots are pretty empty", "score": 1, "replies": []}]}]}, {"body": "90% chance an army of self-driving cars are about to start mowing people in your town down, with Elon Musk standing astride the Cybertruck at the head of the pack.", "score": 1096, "replies": [{"body": "shit. this was in my dream.", "score": 240, "replies": [{"body": "Yup, I believe Tesla enabled a new software feature called Maximum Overdrive. Shhh, it hasn't hit the press yet, though.", "score": 100, "replies": [{"body": "Honey? Come on over here sugar buns. \nThis machine just called me an asshole.", "score": 13, "replies": [{"body": "Curtis are you dead?!?", "score": 3, "replies": []}]}, {"body": "Already priced in", "score": 22, "replies": []}, {"body": "Command line Deleteus", "score": 8, "replies": [{"body": "White_rabbit.obj", "score": -3, "replies": []}]}, {"body": "Doesn't that let them drive through objects via the 8th dimension?\n\nNevermind, that's the Oscillation Overthruster. My bad.", "score": 3, "replies": []}, {"body": "I got that reference.\n\nDamn I'm old", "score": 1, "replies": [{"body": "I don't know what's going on... but John Lithgow looks gaunt, and pissed!", "score": 2, "replies": []}]}, {"body": "Maximun \"drive over\"", "score": 0, "replies": []}]}, {"body": "Muad'Dib! 🫢", "score": 20, "replies": []}, {"body": "I just woke up from a dream where the National guard shut down a whole highway because they had a quarter mile long trailer truck hauling burnt teslas somewhere.", "score": 5, "replies": []}, {"body": "https://www.youtube.com/watch?v=4Ox72XdY2Zo", "score": 4, "replies": [{"body": "This was just foreshadowing", "score": 1, "replies": []}]}, {"body": "Dreams are messages from the deep", "score": 2, "replies": []}, {"body": "https://i.imgur.com/8nfIe85.jpg", "score": 1, "replies": []}]}, {"body": "I saw this in Leave The World Behind. Can confirm.", "score": 18, "replies": [{"body": "Omg me too it was freaky!!!!", "score": 3, "replies": []}]}, {"body": "OP, can you jump the fence and see if they are new or used?", "score": 16, "replies": [{"body": "Lol", "score": 2, "replies": []}]}, {"body": "Mad Musk: Fury Road", "score": 8, "replies": []}, {"body": "Maximum overdrive!", "score": 4, "replies": []}, {"body": "Calls it is!", "score": 7, "replies": []}, {"body": "So, calls?", "score": 6, "replies": []}, {"body": "Once they hear “execute order 66” it’s over for all of us", "score": 4, "replies": []}, {"body": "He’s the crumple zone.", "score": 2, "replies": []}, {"body": "just like Important Joe", "score": 2, "replies": []}, {"body": "You mean they finally got the FSD working? I dont know what's harder to believe!", "score": 2, "replies": []}, {"body": "Daemon is a fantastic book!", "score": 2, "replies": []}, {"body": "They removed the LiDAR hardware. And haven’t been able to make up its loss in software.\n\nRemember the concierge mode?", "score": 3, "replies": [{"body": "Tesla never had lidar. They had radar.", "score": 3, "replies": [{"body": "Damn, last time I looked at it it was headed to production, but I guess [not](https://electrek.co/2023/02/17/tesla-semi-cybertruck-prototypes-spotted-lidar-sensor/)", "score": 2, "replies": []}]}]}, {"body": "Thank u for my first laugh of morning! 😭😭😭😭😭😭", "score": 1, "replies": []}, {"body": "Lol I've seen that play out in movies", "score": 1, "replies": []}, {"body": "It is almost like it is a maximum overdrive.", "score": 1, "replies": []}, {"body": "\"Leave The World Behind\"", "score": 1, "replies": []}]}, {"body": "Calls on Greyish automotive paint.", "score": 407, "replies": [{"body": "Shit I bought Grayish, how fucked am I", "score": 113, "replies": [{"body": "Gray should rise with Grey but I would get out as soon as you can because once the big boys get in profit they’re going to dump", "score": 31, "replies": [{"body": "GREY is the ADR of GRAY. They’re 1:1 correlated.", "score": 7, "replies": [{"body": "GREY is actually a warrant with a conversion price dependent on how GRAY performs, they seem correlated for now, but the convexity", "score": 1, "replies": []}, {"body": "GOOG vs ⅂⅁00⅁??", "score": 1, "replies": []}]}]}, {"body": "If it's gayish, you're ok.", "score": 5, "replies": [{"body": "Just a touch of chartreuse", "score": 7, "replies": []}]}]}, {"body": "Thanks for spelling it correctly", "score": 6, "replies": [{"body": "Gayish?", "score": 1, "replies": []}]}]}, {"body": "Guess people aren't flipping them to carvanna for a profit anymore lol", "score": 256, "replies": [{"body": "Carvana offers are embarrassingly low now, they’ve finally realized they have to actually make money.", "score": 124, "replies": [{"body": "\"Wait, offering $25k for a 2008 Corolla isn't a good business model?\"", "score": 80, "replies": [{"body": "i had a buddy that handled purchases for a carvana competitor. once he became disgruntled with work he started offering absurd prices to buy people's shitty cars, until he quit in a blaze of glory. a modern robinhood.", "score": 46, "replies": [{"body": "And now vroom is gone", "score": 3, "replies": []}, {"body": "Robyn Hood stole back taxes from the government and returned them to the people. \n\nHe did not steal from companies. ", "score": -20, "replies": [{"body": "Thanks, tips.", "score": 8, "replies": []}, {"body": "Corporations are people.", "score": 4, "replies": [{"body": "He did not steal from people, he stole tax money back from the government.\n\nYou probably think Ali Baba is the bad guy in the classic tale. ", "score": -2, "replies": [{"body": "Corporations are legally people. They are the ones influencing the politicians in your government with donations, bribes, kickbacks and blackmail. The government exists in it's current form to better the economy by generating conditions ideal for corporate profit generation. The government has allowed corporations the method for extracting wealth from the populace on it's behalf in the name of \"growth\". I don't live in stories and fairy tales. I see the actual work happening before my eyes, just with some twists so it seems different than the past. It's not. It's the same rich vs poor. Poor people aren't CEO's.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "You are so correct.  Sold an old van to carvana last spring for 12k after buying it at a dealer for 18k and having it for 10 years.  Best vehicle sale I have ever done. Just checked one of our other cars a few weeks ago and the offer was for peanuts.", "score": 28, "replies": [{"body": "Sold them a Honda ridgeline back in 2021 that I’d bought like 3 months prior for msrp and they paid 3k over what I paid. \n\nHated that truck.", "score": 24, "replies": [{"body": "Lol, I sold them a 2018 dodge journey last year. They paid me 21k for it and it was a 4 cylinder piece of junk. It was maybe worth 12k two years ago", "score": 15, "replies": [{"body": "Yeah the van was worth *maybe* 5k. Happy to take their money though.", "score": 7, "replies": []}, {"body": "Oh god a 5 year old Dodge Journey?! \n\nHow did you manage to keep it together and actually extract 21k from it? Sawdust in the transmission?\n\n5 years really is the limit for those horrible POS’s. You must have been very gentle on it. Did you not drive it in the rain?\n\n$21k would mean they’d need to profit somehow, so I’m guessing some absolute fool paid about $23,500\n\nPress ‘F’ to pay respect. They’re probably already looking for a new car.", "score": 3, "replies": [{"body": "It was a small miracle. I had been wanting to get rid of it since my wife and I were moving later that year. Can't believe they paid so much for it. It was junk when I bought it brand new, and I think I paid less for it then", "score": 2, "replies": [{"body": "You actually made a profit selling one of the shittiest used cars one can get. Amazing.", "score": 2, "replies": []}]}]}]}, {"body": "This is the ultimate win", "score": 3, "replies": []}]}]}, {"body": "Just sold a 2010 Ford Edge with a fucked transmission, multiple accidents prior to my ownership, lots of miles and plenty of wear to them for well above what it should have been worth. Couldn't sign the papers and run fast enough. I couldn't believe it.", "score": 4, "replies": []}]}, {"body": "Since the new price keeps going down, resale values suck", "score": 5, "replies": []}]}, {"body": "Those are inventory cars. Gray is the new standard factory color. Most of them are probably rear wheel drive base model y.", "score": 29, "replies": [{"body": "Some of them are model x", "score": 3, "replies": []}]}, {"body": "finally catching up with demand right as demand is slipping....    probably should load up on calls always inverse", "score": 118, "replies": [{"body": "Just bought 240 CALL JAN26", "score": 18, "replies": [{"body": "I'd sell them now unless you know you can hold after shit earnings and Elon ranting on the call about DEI and black pilots while his co-hosts try to polish a turd of a company.", "score": 2, "replies": [{"body": "Lol you're stupid", "score": 1, "replies": [{"body": "How are your calls doing? Are you in fact the one who is stupid?", "score": 1, "replies": [{"body": "LMAOOOOO I say I'm buying calls expiring in TWENTY TWENTY SIX and this fucking moron asks me how they're doing a day later ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 0, "replies": [{"body": "You lost at least 4% in a single day. It was more of a rhetorical question. 2024 EPS just lowered to $1 by Jonas. That's a forward multiple of 177x.\n\nI wish you all the best, but calling me an idiot when you are investing in a growth stock that will announce a 12% QoQ delivery drop. 484k -> \\~430k", "score": 1, "replies": [{"body": "Short it then?", "score": 1, "replies": [{"body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "Already short and loving it. [Short from $221](https://i.imgur.com/Z3pTSf2.png)\n\nSold 1x 160P so I can get a burger for lunch 😂🍔\n\nThis doesn't show the $276P I bought when $TSLA was around that price and the 2 puts I bought and sold for earnings. Made ~$6500 on those. Bought my Chevy Bolt with $TSLA short bux $250-->$204 almost 2 years ago now (26k gain). \n\nLosing money on other tickers, but crushing it on Tesla!\n\nI'm up 50k lifetime betting against Tesla, but I am an idiot for shorting $COIN. So I got that going for me.", "score": 1, "replies": [{"body": "Good for you\n\nStill stupid for buying a Chevy bolt ![img](emote|t5_2th52|4271)", "score": 1, "replies": [{"body": "Hands free self driving on freeway with no phantom braking, seat heaters in the front+back, automatic wipers work. I'm happy with it.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Uh. 2025?", "score": -1, "replies": [{"body": "2026", "score": 1, "replies": []}, {"body": "Clearly !", "score": 1, "replies": []}]}]}, {"body": "Reminder you can also inverse by selling cash covered far-OTM TSLA puts that likely won't get assigned. That's what I did after TSLA earnings.", "score": 2, "replies": []}]}, {"body": "Model S and Y [deliveries are on hold](https://www.reddit.com/r/teslamotors/comments/1arn2wb/tesla_delays_model_s_and_model_y_deliveries_over/) due to a dispute with the EPA over range estimations. But it looks like Tesla is [starting to sell](https://www.reddit.com/r/TeslaModelY/comments/1b6mjwt/update_tesla_model_y_performance_delays_epa/) these.", "score": 74, "replies": [{"body": "The model Y hold is only on the performance version, which is a very small minority of all model Ys I believe.", "score": 16, "replies": [{"body": "The Model Y is Tesla’s best-selling vehicle. The performance variant qualifies for the federal tax credit which brings it down to ~$45k vs ~$42k for the long range variant. I wouldn’t be surprised if the performance variant pushes quite a few units. Definitely enough to fill a lot like this if they are pausing deliveries.", "score": 5, "replies": []}]}, {"body": "This is false as I just took delivery of a model y last week", "score": -2, "replies": [{"body": "Looks like it’s just the Model Y Performance and Model S Long Range that were on hold, it seems like the issue was resolved recently, but it still takes time to deliver a backlog of orders.", "score": 5, "replies": []}]}]}, {"body": "I wouldn't make decisions based on 1 car storage lot being full.  This is an every day changing event around Detroit.  One day overflow lots are full, next day they are gone.", "score": 11, "replies": []}, {"body": "Those are to be delivered unless you live directly next to a gigafactory.", "score": 20, "replies": []}, {"body": "Automotive factories die when they don't produce. Stock of finished goods on lots is a sign that production ramped up, sales fell, or a combination. Usually the combination.\n\nThey could lower production, but then they'd increase the cost price and would have to raise prices. \n\nA third option is, and this is also common, that parts are still missing, and they need to be reworked. Normally, you wouldn't put incomplete cars on the production line until all parts are available on time. Usually under the guise of pleasing management, production continues. If parts are missing from once car, they are missing from most cars. This could be finished stock ir work in progress.\n\nAny way you look at it, it's not a sign everything is going great.\n\nSigned\nSupply chain consultant.", "score": 18, "replies": []}, {"body": "The prices of used Teslas have plummeted, making Teslas the fastest-depreciating cars of all time.\n\nYet Elon had suggested that used Teslas would eventually **go up** because of the prospect of updating software to FSD.", "score": 16, "replies": [{"body": "Maserati has entered the chat", "score": 4, "replies": [{"body": "Strange bedfellows lol", "score": 1, "replies": []}]}]}, {"body": "They keep dropping prices and the lot is filling up?\n\nPuts.\n\nIf they had buyers they could just FSD themselves to the customer.", "score": 48, "replies": [{"body": "\n\"If they had buyers they could just FSD themselves to the customer.\" FSD barely works with drivers in the car man", "score": 4, "replies": []}, {"body": "Prices are up since December.", "score": 4, "replies": [{"body": "Probably the reason why it's filling up?", "score": 5, "replies": []}]}]}, {"body": "Those look like grey Model Ys, which are the free paint color now instead of white. I drove by my local Tesla dealer the other day and saw a bunch of new Teslas on the lot, almost all of them grey. Some of them could have been deliveries but it's hard to tell.\n\nMy guess is Tesla is pumping out cars but deliveries are going down for various reasons, a big contributor is high interest rates. Tbf, I pass a lot of dealerships on my commute and most of them have lots full of new cars, so this problem is not exclusive to Tesla.\n\nIt's not rocket science, cars are more expensive than ever and high interest rates make them even more expensive. Dealerships got greedy the past couple of years, and now the chickens are coming home to roost. People are also cutting back on spending and no one wants to drop $40k+ on a Model Y when layoffs are around the corner and McDonald's is charging Panera prices lol.", "score": 7, "replies": []}, {"body": "My guess is it’s unsold inventory. If the lots full when it’s normally not, that might not be a good sign.\n\nIt also could be that since January and February are bad months for car sales, they’re just stocking up for the rest of the year letting supply dwindle down. \n\nTLDR I don’t know what the fuck it means.", "score": 40, "replies": [{"body": "&#x200B;\n\nhttps://preview.redd.it/gtvj8dgc5jmc1.png?width=1281&format=png&auto=webp&s=51600c5798680a0cf6fc637ebd72a1068f592e94\n\ninventory counts, by model\n\nEdit: [source](https://tesla-info.com/blog/inventory-stats-regional/Global)", "score": 10, "replies": [{"body": "Source?", "score": 2, "replies": [{"body": "Whoops, I had the link in my clipboard and somehow neglected to paste it. Added via edit.", "score": 3, "replies": []}]}, {"body": "Those all look like Model Ys in the pic", "score": 1, "replies": [{"body": "Agreed", "score": 1, "replies": []}]}, {"body": "Given the amazing price on model y and the fact it still qualities for the credit, while the 3 does not, I’d expect these to sell like hotcakes. \n\nLikely they are just gearing up to sell these y.\n\nI’d be more concerned if model 3 was building up inventory, since after the loss of the tax credit they cost as much as model y and I struggle to see who would buy them.", "score": 1, "replies": [{"body": "It was the highest selling car model worldwide in 2023 with 15% more sold than the 2nd place car (Toyota RAV4).", "score": 2, "replies": []}]}]}, {"body": "my thoughts exactly. my brains a noodle", "score": 1, "replies": []}]}, {"body": "NJ is their east coast hub I think. I live in Maine and the only place I can buy from is NJ. (MA won’t let you buy a car for out of state registration. And Tesla has no presence in Maine)", "score": 6, "replies": []}, {"body": "That’s all of the inventory Hertz dumped.", "score": 49, "replies": [{"body": "Why would they be in Tesla’s possession?", "score": 3, "replies": [{"body": "Two responses. \n1. Who says these are in Tesla’s possession? \n2. If they are in teslas possession it wouldn’t be such a bad idea so they can control number and quality of release into the market.", "score": -2, "replies": [{"body": "OP writes he knows the history of the lot. And while I’m assuming here, sounds like it’s a longer history than before Hertz dumping.\n\nAnd Tesla is not buying their inventory. Hertz is selling them D2C.", "score": 3, "replies": []}]}]}, {"body": "My guess as well... Possibly as they take them out of service they put them in a yard pending sale.", "score": 1, "replies": [{"body": "I doubt it, Hertz bought the white ones because white was the free color. Grey recently became the free color. These are new.", "score": 5, "replies": [{"body": "I’ve rented 3 teslas from hertz and none of them were white", "score": 4, "replies": [{"body": "That's interesting, I've only ever seen the white ones for rent. Well, at least I can say that most people bought the white ones.", "score": 3, "replies": []}]}]}]}]}, {"body": "Local (closed) mall parking lot acts as staging for them, looks exactly the same as this.", "score": 14, "replies": [{"body": "nahh this is like hidden down a big dead end, hmmm", "score": 9, "replies": [{"body": "“Staging” in the sense that these are ready for pickup but the Storefront where the customers will pick them up does not have the capacity to park these. As the customers are notified, these will trickle out.", "score": 6, "replies": [{"body": "Several weeks of trickling in this picture though.", "score": 8, "replies": []}]}, {"body": "Staging doesn’t always mean display. It can mean “sets up to”", "score": 1, "replies": []}]}, {"body": "I see you Chesterfield", "score": 1, "replies": [{"body": "Fellow nimby regard.", "score": 1, "replies": []}]}]}, {"body": "North Jersey?\n\n\"Ay Tone, you want one a dese new Teslas? We just had a few Cybertrucks fall off a truck, hehe\"", "score": 4, "replies": []}, {"body": "There’s a shitty car dealer close to me and the guy somehow has 10+ brand new teslas, I was like wtf??  Definitely something going on", "score": 9, "replies": []}, {"body": "“Vehicles sold, not yet purchased”…", "score": 3, "replies": []}, {"body": "To me it means Tesla puts - excess inventory means incentives and discounts - lower profit margins and I am long Tesla.", "score": 3, "replies": [{"body": "Higher sales", "score": 1, "replies": []}]}, {"body": "Colours are not my friend, are they all the same colour??", "score": 7, "replies": [{"body": "ehh I'd say 70% black - 20% & some white/reds hiding", "score": 16, "replies": [{"body": "Can you put a camera on that with a time lapse?  Be interested to see how many come/go within a 2 week period", "score": 13, "replies": []}, {"body": "Where in north jersey?", "score": 1, "replies": []}]}, {"body": "Grey is the free color.", "score": 4, "replies": []}]}, {"body": "would be a shame for a natural event to cause those to be written off rather than sold at deep discounts (losses)", "score": 2, "replies": []}, {"body": "Looks cold.. puts it is", "score": 2, "replies": []}, {"body": "Fuck it’s an AI army amassing.  Save yourself.", "score": 2, "replies": []}, {"body": "“What’s your level of certainty?”\n\n“I am not uncertain..”", "score": 2, "replies": []}, {"body": "That’s a junkyard", "score": 2, "replies": []}, {"body": "Tesla reports deliveries each quarter. Since they deliver to end customers and not dealerships, these should not be included in their quarterly deliveries. This is overstock generated for some reason... Build ahead for a new model launch or factory rework, or more likely, due to lagging demand which they've outlined on investor calls. That's why we're seeing Tesla discounts/incentives. If these were for an OEM who uses dealerships, this could be a dealership lot and would be considered delivered in that OEMs quarterly numbers.", "score": 2, "replies": []}, {"body": "waiting on a tropical storm to flood them all and write them off", "score": 2, "replies": []}, {"body": "Outsider trading", "score": 2, "replies": []}, {"body": "Every Indian in NJ already has a Tesla now.  So they ran out of customers. ![img](emote|t5_2th52|4259)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|31226)", "score": 6, "replies": [{"body": "That's a lot of Teslas", "score": 2, "replies": [{"body": "It's almost every other car in NJ", "score": 1, "replies": [{"body": "It's ironic because all the Indians from NJ I know own gas stations and/or motels lol", "score": 2, "replies": []}]}]}]}, {"body": "This is pretty interesting. I’d be trying to figure out what these cars are there for. Definitely a glimpse in to Tesla that almost no one else has. These kinds of observations beat an infinite amount research if you can actually figure out why they’re sitting there.", "score": 2, "replies": []}, {"body": "Calls def no demand problem", "score": 1, "replies": []}, {"body": "Throw a Molotov in there", "score": 1, "replies": []}, {"body": "Anyone know whether they’re still backed up in orders? Or how fast can you order a new Tesla?", "score": 1, "replies": []}, {"body": "Lies. Jersey doesn’t look that nice", "score": 1, "replies": []}, {"body": "Seen the same thing in China and their economy is doing fine. Calls it is regards!", "score": 1, "replies": []}, {"body": "That looks like a weeks worth of sales at the most.", "score": 1, "replies": []}, {"body": "Hoping for a fire to sell them fast", "score": 1, "replies": []}, {"body": "End of quarter ramp up. They always flood the delivery centers with cars the last month of the quarter.", "score": 1, "replies": []}, {"body": "Priced in. Hedge funds watch these lots with satellites", "score": 1, "replies": []}, {"body": "OP are they USED OR NEW?? Come on man", "score": 1, "replies": []}, {"body": "Do you live near a sea port or a rail yard?", "score": 1, "replies": []}, {"body": "Can you please count them every day and let us know what the quantity? Or maybe how many trucks pick up these vehicles per day? 😂😂😂", "score": 1, "replies": []}, {"body": "Everyone is bearish on Tesla as of late. Buy as much as you can", "score": 1, "replies": []}, {"body": "The lot by my work was like this. In 2 days they were gone. Probably overflow waiting for the car haulers to get them.", "score": 1, "replies": []}, {"body": "Looks like a large fleet order. Note the rear window tint.  Maybe for Hertz etc.", "score": 1, "replies": []}, {"body": "U can make this into a put by cracking every single window  and a hole in every panel..", "score": 1, "replies": []}, {"body": "puts", "score": 1, "replies": []}, {"body": "Hopefully they don't catch fire spontaneously. \n\nI'd buy fire insurance if I was you.", "score": 1, "replies": []}, {"body": "Priced in the JP Morgan satellite already has photos of this and is shorting accordingly", "score": 1, "replies": []}, {"body": "These are probably new cars fresh from the factory . Based on how the my are almost all the same.", "score": 1, "replies": []}, {"body": "Are these in the delivered numbers? lol", "score": 1, "replies": []}, {"body": "Better hope none of those catch on fire…", "score": 1, "replies": []}, {"body": "Tesla makes money on charging stations so probably calls.", "score": 1, "replies": []}, {"body": "DOA?", "score": 1, "replies": []}, {"body": "They still have pretty big wait times so I imagine it’s just stocking up before transport or something.", "score": 1, "replies": []}, {"body": "The world is gonna end now because AI is angry and Tesla’s gonna do Carmageddon.\n\n\nThat day m will be called Telsageddon.", "score": 1, "replies": []}, {"body": "Is the plastic still on the seats and interior areas? There is a few “misfit lots” in NJ and the cars look new from a distance but the majority have defects which I think were turned away and are refurbished and offloaded to customers after a second round of touch ups.", "score": 1, "replies": []}, {"body": "Set up a webcam on your balcony, you can make big $ from YouTube... All those Tesla market watchers keeping an eye on inventory levels will love your \"fresh content\".", "score": 1, "replies": [{"body": "lol brilliant", "score": 1, "replies": []}]}, {"body": "I’d guess they’re being stored for export and the lot being fuller than normal is a result of constraints in the shipping market.   If that’s the case it will likely increase cost to Tesla as they’ll have to expand pre-export storage space and have less inventory overseas, or they’ll have to up their shipping bids in order to move more cargo overseas faster.   Almost definitely not enough enough of an effect for calls tho", "score": 1, "replies": []}, {"body": "I wonder if these cars ever self-drive in the middle of the night. Keep an eye out OP", "score": 1, "replies": []}, {"body": "Thanks, doubling on my puts tomorrow.", "score": 1, "replies": [{"body": "this is the way, I think. maybe?", "score": 1, "replies": []}]}, {"body": "Is this how new cars are stored usually? Do you get hails there?", "score": 1, "replies": [{"body": "38.653045454501736, -90.14175004172809", "score": 2, "replies": []}, {"body": "nah it only snowed once but I thought the same", "score": 1, "replies": []}, {"body": "Yes google saint louis and look by the river.", "score": 1, "replies": []}]}, {"body": "More Price cuts coming soon", "score": 1, "replies": []}, {"body": "Puts!", "score": 1, "replies": []}, {"body": "There's a Tesla service center that I drive by on the way to work and I check on it every day. Some days it looks like this packed to brim, while other days it's half empty. The cars look new so they've got to be sold going somewhere.", "score": 1, "replies": []}, {"body": "I see over a million dollars worth of unsupervised rims 😮‍💨", "score": 1, "replies": []}, {"body": "Same in Fayettteville, they had to buy some where to stack inventory.", "score": 1, "replies": []}, {"body": "Inventory piling up is a sign that sales are slowing, this has been known for a while and is already priced in", "score": 1, "replies": []}, {"body": "It's probably just a jersey thing", "score": 1, "replies": []}, {"body": "Yo I’m in north jersey and they have many of these lots around. By me they have a fat BMW AND VALVO lot packed to the teeth I don’t think they going out of business. Also recently they started adding a ton of sprinter vans in the lot. This is common in north jersey lots of rich people up here", "score": 1, "replies": []}, {"body": "Is this Paramus NJ? There’s another lot outside an office building before you get on the Parkway that has a ton of Tesla’s as well.", "score": 1, "replies": []}, {"body": "I think it depends on how many cars they can park on the lot, and how many you can damage per night year round for a period of time. \n\nLet us know.", "score": 1, "replies": []}, {"body": "I feel as though I’m getting a glimpse into what some firms might investigate to determine upcoming stock movement. \n‘Shady character stands outside chain link fence observing full lot while chain smoking cigarettes . \n“That’s a lot of Tesla’s”. \nBuys Puts.", "score": 1, "replies": []}, {"body": "Magnificent, aren’t they?", "score": 1, "replies": []}, {"body": "That's not good.", "score": 1, "replies": []}, {"body": "Full self-immolation convention. I’d move before the whole shit house goes up in flames.", "score": 2, "replies": []}, {"body": "losers were posting this stuff in 2018 when the model 3 first came out", "score": 1, "replies": []}, {"body": "Looks like all previous generation Model 3s.   Not sure what data can be extracted from that.", "score": 1, "replies": [{"body": "Maybe Hertz selling off their inventory", "score": 1, "replies": []}]}, {"body": "It got cold and now none of the batteries in them work anymore, once it warms up and they get new cells in them they should start working again.", "score": 1, "replies": [{"body": "this is where they go to hibernate", "score": 3, "replies": [{"body": "Who the fuck would willingly go to new jersey?", "score": 1, "replies": []}]}]}, {"body": "Every vehicle dealership lot in the country is full of inventory right now because folks buy cars with their tax returns.", "score": 1, "replies": []}, {"body": "Bullish. Tesla only produces what people order. Most of these are already sold.", "score": 1, "replies": []}, {"body": "Actual Answer. \n\nThese are fleet cars for TLC cars (Uber/Lyfts/Car Service) for the NYC area. There's huge demand for EVs to do Uber in NYC. Some leasing company is buying big fleets of Teslas. There's another lot of black Teslas in Queens.", "score": 1, "replies": []}, {"body": "Simple, it's an Enron style pyramid scheme.\n\n\nSomeone has purchased those Teslas on paper, possibly a subsidiary of Tesla, but no actual money has exchanged hands, allowing Tesla to claim massive paper revenue and profits.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}, {"body": "There’s a lot like this near my house that regularly fills up with hundreds of cars and then is randomly almost completely empty a few weeks later. I own a Model 3 and I swear Model 3/Y is the most common car that I see in my area. Easily 50+ a day.", "score": 0, "replies": []}, {"body": "Teslas are made to order. They don’t have dealerships with inventory of new cars.  The ones I’ve been to have some used inventory from trades and loaner/ test drive vehicles.  Now,  there might be a few new ones that go unclaimed and the person that ordered it walked away from the deposit.  But that’s not a lot.", "score": 0, "replies": [{"body": "No longer made to order. They make based on demand projections and match with orders as they get shipped to various localities.", "score": 3, "replies": []}]}, {"body": "E Lonbot", "score": 0, "replies": []}, {"body": "Long calls", "score": 0, "replies": []}, {"body": "Does your insurance cover loss due to fire?", "score": 0, "replies": []}, {"body": "This represents 0.03% of cars sold by Tesla in a given year.", "score": 0, "replies": []}, {"body": "The model 3 just released a redesign as well as the model x. I would imagine some of the inventory is related to the new design and back log of orders. Not uncommon to pause production because of a redesign and then have a catch up/rebound of stock.", "score": 0, "replies": []}, {"body": "Tesla manufacturers a model 3 something like every 45 seconds. This is probably just pending deliveries for your neighborhood", "score": 0, "replies": []}, {"body": "They do deliver \\~17,000 model Y per week in the US so seeing this many in one place is not crazy", "score": 0, "replies": []}, {"body": "tesla is desperate, they are giving 1K to uber drivers,  buy a tesla through uber, and do 200 rides and get 1K.  that tells me tesla is desperate if they're resorting to uber", "score": 0, "replies": [{"body": "dem guna b sum rekd carz", "score": 1, "replies": []}]}, {"body": "I mean Tesla is recalling like 2.5 million cars cause the icons in the dash are too small\n\nNot sure it's a good buy", "score": 0, "replies": [{"body": "Aren't the icons digital though? They can probably patch this over the network.", "score": 1, "replies": [{"body": "No idea? Either way 2.5 million recalls is no joke.\n\nI would bet the cars need to visit the garage", "score": 0, "replies": [{"body": "Ota software update", "score": 1, "replies": []}]}]}]}, {"body": "Reminds me of the General Motors EV1 failure in the 90s", "score": -4, "replies": [{"body": "Yeah, total [failure](https://www.carexpert.com.au/car-news/tesla-model-y-was-the-worlds-best-selling-car-in-2023-dethrones-toyota).", "score": 3, "replies": []}]}, {"body": "There are all the ones the steering wheel fell off. They just there getting them reattached", "score": -1, "replies": []}, {"body": "Shiba inu and doge 🪙 gone crazy📈 last night let's see if we can double it today", "score": -1, "replies": []}, {"body": "I heard “Elon and his Musketeers” today on a podcast and it made me laugh \n\nThe new Jake and Amir podcast “Segments” if anyone cares", "score": -1, "replies": []}, {"body": "The product is no longer competitive and I bet at least 20-30% of those have water entering the cab because of shoddy manufacturing and qa", "score": -1, "replies": []}]}
