{"title": "Tell me I’m wrong about this so called “inflation”.", "selftext": "The only real way to stop or kill inflation is to remove money from the economy and the easiest and quickest way is for the stock market to collapse (which normally bleeds into housing and other speculative asset classes).  So if the market is on a 4 week tear to the upside aren’t we just stoking the inflation fires as peeps look at their investments and feel richer and therefore continue to spend?  FYI I’m a big ol gay bear 🌈 🐻", "id": "wfaegm", "created_utc": 1659542582.0, "score": 10, "upvote_ratio": 0.7, "num_comments": 51, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|44|**First Seen In WSB**|6 months ago\n**Total Comments**|611|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wfaegm)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wfaegm)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "Exactly and we’re doing the exact opposite right now by kicking the can down the road.", "score": 4, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Well the smart money is saying otherwise they really think we can have a swift landing and avoid a recession.", "score": 2, "replies": [{"body": "The smart money tells u sunshine and unicorns while they move their money strategically to minimize loss.", "score": 8, "replies": []}, {"body": "Yet they have to change the definition of what a recession is", "score": 3, "replies": [{"body": "Yeah that’s some fucking sleezy shit right there.  Apparently you can’t even edit what dictates a recession on Wikipedia anymore. 😒", "score": 3, "replies": [{"body": "That's part of the trap.  Get more cash into the markets before deflating it again.  And your favorite companies are enthusiastic participants, stepping up the share buy backs and raising dividends.  Anything to get you to pay more for their shares before they let the air out.", "score": 3, "replies": []}]}, {"body": "You realize that definition is older than you right? People were claiming this same bullshit in 2008 and it was wrong then too.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "https://twitter.com/dylanleclair_/status/1554861503077142528?s=21&t=Ij-JeQIwSjPHLLrYlfqkpA. Daly SF fed president. This is how far out of touch these fed presidents are!!\n\n\nFor those who don’t have Bose headphones “I don't feel the pain of inflation anymore. I see prices rising but I have enough... I sometimes balk at the price of things, but I don't find myself in a space where I have to make tradeoffs because I have enough, and many Americans have enough.\" - SF Fed President Mary Daly", "score": 6, "replies": [{"body": "🤦🏻‍♂️", "score": 2, "replies": []}, {"body": "Wow. All I can say to this is wow.\n\nParaphrased: “I’ve gotten so rich that this little blip, which is devastating to ~70% of the people I’m supposed to serve, isn’t really impacting me”", "score": 1, "replies": [{"body": "Btw, her salary is 400K+ and trades in millions.", "score": 1, "replies": []}]}]}, {"body": "We we imported deflation for two decades by moving manufacturing to low cost countries. This kept prices stable and let us print more dollars without inflation.\n\nNow wages are increasing worldwide and the cheaper labor options are drying up. Workers in what used to be low cost locales are demanding higher wages. First we went to China, then when that got expensive we went to Vietnam, Cambodia, Indonesia, Malaysia, Philippines, &c. Now there is no where left to go. So the trade is gone and we are going to start importing inflation. There is nothing that can be done about this.\n\nThe growing government deficit and increased cost of servicing the existing government debt isn’t going to help with the money printing. It has to be printed to avoid default. We aren’t too out of whack from a debt/GDP perspective right now (call it 150%) but that can quickly reach over 200% in two years by running a 10% deficit and a 3% GDP decline in a recession.\n\nInteresting times to come.\n\nEdit: Typo", "score": 3, "replies": [{"body": "I’ll never understand why we go to the East when we could make a deal with Mexico.  They have some of the hardest working people in the world and we wouldn’t have to worry about bullshit dry shipping freight issues.", "score": 1, "replies": [{"body": "Mexico is rough. I worked with a multinational industrial manufacturing business with operations both there and in China and Indonesia and the Mexican operations just couldn’t get their shit together. I dunno why. \n\nMy conclusion was that this business just needed to automate and produce in its domestic facilities. The savings from sourcing from Asia and Mexico didn’t offset the error, theft/fraud, and headache of managing the overseas manufacturing.\n\nI witnessed the above work out at a manufacturer that had a more complicated product. They were automating as quickly as possible and ran a pretty tight ship. Sourced very little from Mexico or overseas and never put a building down anywhere outside the US.", "score": 2, "replies": [{"body": "Funny you say that because I’m proposed the same idea to a colleague and he basically said the same thing that Mexico might work harder but China works must smarter.", "score": 1, "replies": []}]}]}]}, {"body": "![img](emote|t5_2th52|4258)", "score": 2, "replies": []}, {"body": "Yes\n\nThe other way to bring down inflation is raise taxes.\n\nBut yes the markets can be strong driver of inflation.", "score": 2, "replies": [{"body": "So I should dump all my money into my 401k to buy the dip and avoid taxes?", "score": 1, "replies": []}]}, {"body": "The smart money understands the fed has no choice and will reverse course and reduce rates and print more", "score": 2, "replies": [{"body": "Yes but only until after the market really collapses", "score": 1, "replies": []}]}, {"body": "If the stock market collapses there are winners and losers. Money doesn’t disappear. The way to take it out of circulation is to reduce the fed balance sheet.", "score": 2, "replies": []}, {"body": "I think you are on to something", "score": 2, "replies": []}, {"body": "Yup but ever bear market has its rally’s.", "score": 4, "replies": [{"body": "I understand that in fact I told peeps on here to go long back on 7/5.  My point is how could people remain bullish knowing what’s coming around the corner aka more rate hikes and not a neutral stance due to these big moves to the upside.", "score": 0, "replies": [{"body": "It's not that people are bullish, it's that it's impossible to forward predict the stock market reliably, so you wait and do what the market does. If it's going up, you keep buying even though you know it's going to reverse sooner rather than later. When it moves down, then you sell. When the bartender yells last call, do you pack up and leave right then or do you order one last drink? Basically that.", "score": 5, "replies": [{"body": "I leave..i don't want to be in there when they turn the lights on.", "score": 3, "replies": []}]}]}]}, {"body": "It's a new wave of investors' mentality; YOLO.", "score": 4, "replies": [{"body": "Yeah well this isn’t going to end well.  And AMTD is a great indicator of the fuckery to come.", "score": 4, "replies": [{"body": "[Bear Market Rally](https://i.imgur.com/6hYcLcc.png)", "score": 1, "replies": [{"body": "Um...3/13/20 was a bear market rally...that was the end of the bear market.\n\nAm I confused with your terminology? It sounds like you're saying things will fall off further (which could certainly happen) but your link is showing a different thing", "score": 1, "replies": []}]}]}]}, {"body": "Lol. The only way to stop inflation is to stop printing money. But the government is insolvent, the Federal Reserve was nationalized in April 2020, and now the US Treasury has control of the pringer. Which is to say, the government is going to print the US dollar into oblivion, there is absolutely no way around it. They will lie for as long as possible, don’t believe an effin word they say.", "score": 3, "replies": [{"body": "Why doesn’t the dollar collapse then?  Because it’s best of (shit) breed?", "score": 1, "replies": [{"body": "The dollar \\*is collapsing.  The purchasing power has fallen 15 or 20% a year for the last 2, and this will accelerate.  It’s only in comparison to other currencies which are also collapsing that the USD appears to be holding up.  USD has been the global reserve currency for decades, its like a thousand ton ship that takes time to turn—but it Is turning as we speak.  The whole thing is happening like a slow motion train wreck.  The fact that the BRICS nations have begun implementing their own international payments system is the definition of USD losing its global hegemony.", "score": 2, "replies": [{"body": "Are you also implying that the euro is collapsing? Just trying to reconcile recent dollar strength to other currencies with your statement", "score": 1, "replies": [{"body": "Lol, yes absolutely the Euro is collapsing!  \n\nThink of it like this: currency is a symbol of value.  A dollar or euro will buy x amount of fuel, or x amount of food, or x amount of lumber, or whatever real thing.  You can't eat currency, it has zero intrinsic value.  So if today your dollar or euro buys 1/2 the food it bought a couple years ago, both have collapsed in value by 50%.  The fact that the Euro collapsed by 55% whereas the Dollar was only 49% is irrelevant.\n\nThink of money in terms of Value.  The number of dollars are irrelevant, whether it takes 20 or 200 dollars to buy lunch, the food is what you're after, thats the value.  Or fuel, or lumber, or cars, houses, or whatever.", "score": 1, "replies": []}]}]}]}]}, {"body": "Inflation peaked, Rate Hikes peaked\n\nQE-Q1.. Rates will will remain stagnant for now, possible easing Q4. Unfortunately too much damage will be done from the Hikes. Leading into undeniable recession Q1-Q3 2023. Q4 2023 onwards, buckle up. \n\nSomething like this granted no crazy black Swan event like china war etc…\n\nPrediction- 2022 Q3 Bullish- 2022 Q4- 2023 Q2 bearish. 2023 Q3 onward bullish", "score": 1, "replies": [{"body": "No way the Fed eases anytime soon", "score": 3, "replies": [{"body": "I think you’ll be surprised and people are underestimating how much keeping these rates as is damages the economy. \n\nWith likely 2 prints of lower inflation before next fed, it’s almost a certainty it’s stagnate at worse.", "score": 1, "replies": [{"body": "They dont care about inflation, they care about WAGE inflation.  Thats why they started to act so slow.", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "You can me a retard or a big gay homo whatever but I’m not an idiot understand sweetie?", "score": 1, "replies": []}]}, {"body": "The amateur simplicity in your suggestion is akin to saying “let’s stop inflation by killing 40% of the population”\n\nIt would work, but there are less destructive ways to do it. \n\nArmchair economists remind me a lot of Reddit armchair gm’s", "score": 0, "replies": [{"body": "You’re saying that stocks crashing and people losing money is akin to murdering 40% of the world’s population?   Ok now who’s the retard here?", "score": 1, "replies": []}]}, {"body": ">The only real way to stop or kill inflation is to remove money from the economy and the easiest and quickest way is for the stock market to collapse\n\nyou are wrong. Though it is A way. The best and least painful one would be to just fix the freaking supply chain crisis, get China to stop 0 COVID, and return to a world where supply >> demand. Lock downs led to supply chain issues which led to demand >>> supply for the first time in many people lives.", "score": -2, "replies": [{"body": "I said easiest and quickest.  You talking about making China do shit?  They  ain’t listening to yo ass bruh come on now 🤦🏻‍♂️", "score": 2, "replies": [{"body": "you quite literally said the only way. Its literally the first 4 words of your post.\n\nRemoving money isn't the only way. Increasing supply works as well.", "score": 5, "replies": [{"body": "By real I meant “realistic”", "score": 2, "replies": []}]}]}]}, {"body": "The only way is to stop corporate price gouging", "score": -4, "replies": []}, {"body": "Don’t worry, we don’t discriminate genders of spices 🌈🧸", "score": 1, "replies": []}, {"body": "Retail is bearish so stocks go up", "score": 1, "replies": []}, {"body": "Retail is bearish so stocks go up", "score": 1, "replies": []}]}
{"title": "None of y’all cock raisers are protective of their investments. Calls on Nvidia and AMD", "selftext": "", "id": "wfhrx6", "created_utc": 1659560096.0, "score": 1503, "upvote_ratio": 0.94, "num_comments": 52, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|39|**First Seen In WSB**|2 years ago\n**Total Comments**|57|**Previous DD**|[x](https://www.bloomberg.com/news/articles/2021-11-30/powell-says-appopriate-to-weigh-earlier-end-to-bond-buy-tapering) \n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wfhrx6)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wfhrx6)", "score": 1, "replies": []}, {"body": "Buy TSM? It will take a month before we know what Pelosi trades are today.", "score": 30, "replies": [{"body": "TSM get your moon boots boys", "score": 6, "replies": []}, {"body": "China blockading the strait right now. Don’t think that’ll help", "score": 1, "replies": [{"body": "They are bluffing, China loves microchips.", "score": 2, "replies": []}]}]}, {"body": "Cock raiser? Am I appealing to the gays now?", "score": 14, "replies": [{"body": "Let me see dem toes boi", "score": 12, "replies": []}]}, {"body": "[deleted]", "score": 20, "replies": [{"body": "Unlike Russia which has less to lose, war between Taiwan and China means trillions in trades will halt, not even the mighty Pooh wants to lose on all that trade money.", "score": 7, "replies": []}]}, {"body": "WSB most days: Fuck China!\n\nWSB when Pelosi is mean to China: why u do this?", "score": 45, "replies": [{"body": "surely there's video somewhere of pelosi dogging trump for being hard on china", "score": 4, "replies": [{"body": "So just whataboutism?", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 18, "replies": [{"body": "Exactly, the political divide is clear, people can't even get financial news without a spin now.", "score": 3, "replies": [{"body": "Yeah it's pretty upsetting. Care to fill me in on what's going on here?", "score": 1, "replies": []}]}]}, {"body": "Spoke to someone who knows more about world economics than most US people. AKA: Someone outside USA.\n\n&#x200B;\n\nShe did it to empower the USA in general. If China doesn't attack Taiwan, then they become the paper tiger with false threats. If they DO attack Taiwan, then USA can become the heroes as China is attacking a smaller country, much like Russia is doing to Ukraine.\n\n&#x200B;\n\nStill willing to bet she shorted the market for the day she knew she was going to arrive.", "score": 19, "replies": [{"body": "She actually has 50 calls on Nvidia as of now with expiration date of September 2022. she sold majority of her calls prior to the visit tho. source: Pelosi Stock Tracker on Twitter", "score": 6, "replies": []}, {"body": "[ Removed by Reddit ]", "score": -12, "replies": [{"body": "If China ends up attacking Taiwan, the US could always simply claim that China is simply copying or even collaborating with Russia. It's not a hard stretch. Remind me out of every country in the world who is one of the superpowers still trading with Russia?\n\nThe US would gain more support from the rest of Europe while China's economy inevitably weakens as a whole. They then send aid to Taiwan, as they have been to Ukraine.\n\n&#x200B;\n\nSo yes, USA would be made out to be the hero. We'd inevitably be a step closer to plunging into WW3, but USA would be made out to be the good guys compared to the other global superpowers.", "score": 4, "replies": [{"body": "At what point did people start thinking connecting the dots between their 6 sparsely spread out brain cells constituted a meaningful opinion.\n\nStop wasting your time writing this absolute fucking dog shit out when you plainly don't know even the basic recent history of the situation.", "score": 0, "replies": []}, {"body": "wait so attacking Taiwan would be fine if Russia wasn't attacking Ukraine? you're retarded plain and simple.", "score": -6, "replies": []}]}, {"body": "China is weak as fuck when it comes to carrying out their thinly veiled threats. They know the only power they have is the uncertainty of actually taking action, which they rarely do.", "score": 4, "replies": [{"body": "non sequitur but let's go with it. who is powerful then? Look at what Russia is doing and they have nowhere near the economy that china has. Even your own logic doesn't agree with it's self. They're weak but appear strong because they don't do anything? So is Tanzania also scary because they're weak but they don't attack Taiwan? again, non sequitur.", "score": -3, "replies": [{"body": "Russia is weak because their equipment and military is poorly maintained. They can still do a lot of damage and still are a threat. China is weak because they’re all talk. Power is in having, using, and backing up talk with action. Pull out any one of those three and the entity is weak.", "score": 2, "replies": []}]}]}]}]}, {"body": "No shit. Why do you think Pelosi bought all that NVidia, pass billions to help US chip makers, then went directly to Taiwan to piss off the Chinese??", "score": 6, "replies": [{"body": "Nvidia doesn't make their chips here dipshit, they don't have their own fab.  People on here used to joke about being retarded, now they just are.", "score": 10, "replies": [{"body": "$12B factory being built in AZ as we speak.", "score": -3, "replies": [{"body": "Not by Nvidia.", "score": 3, "replies": [{"body": "https://graphicscardsadvisor.com/who-makes-nvidia-gpu-chips/#:~:text=world's%20leading%20chipmakers%20NVidia%20Corporation,supplier%20for%20creating%20NVIDIA's%20chips.", "score": -5, "replies": [{"body": "You literally don't comprehend what you're posting.  I'm not wasting my time spoonfeeding you either.", "score": 5, "replies": [{"body": "Wait just so I’m not crazy, if TSM is blown up or blockaded it means AMD will go straight down right? Also I think apple makes their M1 chip at TSM?", "score": 1, "replies": [{"body": "AMD and Nvidia will both be fucked.  The majority of TSMC fabs are in Taiwan.  AFAIK 4000 series and all new AMD products are based on set to be made by TSMC and I'm not sure if they could simply move to GloFo or Samsung even if those Fabs had capacity which is highly unlikely.", "score": 2, "replies": [{"body": "Ok cool for real idk what anyone is thinking in this market, it was on the news before that if something happens to TSM our supply chain is never going to recover, and yet we go super green staring the risks in the face lol they’re nothing", "score": 1, "replies": [{"body": "The risk has been there for years.  The entire West would go after China, they are just acting tough right now they are in no position to start a war when their citizens are rising up against the government at this point in time.", "score": 1, "replies": [{"body": "Hopefully 🤞", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "…right in the “face hole”!!  Hahahahah!!  Good one!  I’m going to start using that now.", "score": 1, "replies": []}]}, {"body": "If war had broken out... it would be China's fault not Pelosi's.  Taiwan is its own country... not a part of China.", "score": 3, "replies": []}, {"body": "War is good for the economy. They don’t give a shit either way.", "score": 3, "replies": [{"body": "Not if it's over a piece of land responsible for creating a majority of the computer chips used worldwide.\n\nAnd I say that purely as a massive semi bagholder.", "score": 5, "replies": []}]}, {"body": "Why are people suddenly supporting the CCP? Tiwan needs global recognition and more importantly American recognition. The CCP is the worst gov in the world right now and reddit is nose diving deep inside it's ass for some reason", "score": 0, "replies": []}, {"body": "An autist homosexual with an egg shaped head and a scarf told me to buy Nvidia in a coffeeshop (he was telling everyone he saw to make small talk, like a PSA).. he bought in at $70 pre-split.", "score": 1, "replies": []}, {"body": "Nope", "score": 1, "replies": []}, {"body": "Well we know who voted for Dems on here there triggered right now.", "score": 1, "replies": []}, {"body": "This lady stinks", "score": 1, "replies": []}, {"body": "Backing Taiwan is the right move. If you think otherwise, you're a beta that would bend the knee to any oppressor.", "score": 1, "replies": []}, {"body": "Calls on critical minerals stocks.", "score": 1, "replies": []}, {"body": "Pelosi is scum, needs arrested and tried for treason along with all the extorting politicians manipulating the market and banking millions", "score": 1, "replies": []}, {"body": "How would causing WW3 and having Taiwan attacked and taken over by China protect her investment?  I am confused.  Sounds like it would be doing just the opposite", "score": 1, "replies": []}]}
