{"title": "U.S. economy slows again, S&P finds, due to high inflation and rising interest rates", "selftext": "U.S. businesses grew more slowly in August as high inflation and rising interest rates spurred customers to curb spending, a pair of surveys showed on Tuesday. The S&P Global U.S. services sector index dropped to 44.1 from 47.3, based on “flash” survey. It was the fifth decline in a row and weakest reading since May 2020, shortly after the U.S. outbreak of the coronavirus pandemic. The U.S. manufacturing sector index, meanwhile, slipped to 51.3 from 52.2 and registered the lowest reading in just over two years. Readings above 50 signifies expansion; below that, contraction.\n\nA pair of similar surveys by the Institute for Supply Management, however, show the economy is somewhat stronger than the S&P indexes indicate. The ISM surveys have been around a lot longer and arguably have a better track record. \n\n**Big picture:** There’s no doubt about it though: The U.S. economy has slowed due to rising interest rates as the Federal Reserve tries to stamp out high inflation, but the economy is still growing. The big question is, how much will the economy slow and will it slip into recession? Many economists think a recession is likely by year end or in 2023 if the Fed keeps raising interest rates. Higher rates slow the economy by raising the cost of borrowing for consumers and businesses, making it harder to buy a house or car or take out a loan. \n\n**Key details:** Both manufacturers and service-oriented companies such as retailers reported waning sales in August and the lowest demand in more than two years. They’ve scaled back hiring efforts in response. In a bit of good news, the cost of supplies eased for the third month in a row. That’s a sign inflation pressures are relaxing after a big runup earlier in the year. Rising wages, on the other hand, have partly offset the decelerating rise in the cost of supplies.\n\nIn any event, with their own costs leveling off, businesses raised the prices they charge customers at the slowest pace in 18 months. They also holding the line on prices to entice customers to spend more. If inflation continues to ease, the Fed might not have to raise interest rates so high that the economy tips into recession. Looking ahead: “Gathering clouds spread across the private sector as services new orders returned to contractionary territory, mirroring the subdued demand conditions seen at their manufacturing counterparts,” said Sian Jones, senior economist at S&P Global Market Intelligence. “The historical data for the services index only go back to late 2009, so we would be wary of attaching too much importance to this reading, particularly at a time when the ISM services index, which started in 1997, was at a relatively strong 56.7 in July,” said U.S. economist Paul Ashworth of capital Economics.\n\n[https://www.marketwatch.com/story/u-s-economy-slows-again-in-august-s-p-finds-11661262692?mod=economy-politics](https://www.marketwatch.com/story/u-s-economy-slows-again-in-august-s-p-finds-11661262692?mod=economy-politics)", "id": "wvr7ae", "created_utc": 1661267156.0, "score": 302, "upvote_ratio": 0.93, "num_comments": 60, "comments": [{"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "yes sir", "score": 3, "replies": []}]}, {"body": "No shit Sherlock. High inflation and rising interest rates will do that", "score": 161, "replies": [{"body": "That was literally the goal. Thanks S&P", "score": 61, "replies": []}, {"body": "Seriously. Prices and cost of capital go up, demand goes down. This is Economics 101.", "score": 4, "replies": []}, {"body": "Dont worry. Market will rally just to burn OPs puts", "score": 7, "replies": []}]}, {"body": "So we all dumping VOO until we get 50% off?", "score": 13, "replies": [{"body": "Y'all fucking hate compounding interest\n\n\n\nIt's hilarious", "score": 1, "replies": [{"body": "VOO compounding interest is 1.49% per year currently.", "score": 1, "replies": [{"body": "And Ally savings at 1.75%", "score": 2, "replies": []}]}]}]}, {"body": "Don't worry, this is transitory.\n\nAlso don't worry, coal is a renewable. You just have to wait for the next generation of dinosaurs to be squished under incredibly high force for an incredibly long time.", "score": 30, "replies": [{"body": "Yeah sometime we‘ll all be oil", "score": 2, "replies": []}]}, {"body": "If we need to go into a recession to get inflation under control I’m all for it. All things considered we are in a much better position than our friends overseas", "score": 93, "replies": [{"body": "I think everyone would agree with this... until they lose their own jobs.", "score": 118, "replies": [{"body": "Like increasing taxes, I'm all for a recession to tame down inflation as long as I don't lose my job", "score": 45, "replies": [{"body": "Yeah, we're in a tough spot rn. Seems as if some people are gonna get hurt no matter what the Fed does. If inflation hasnt peaked and they pause, lower income is gonna get screwed (even more than now), but if they keep tightening hard the markets are toast and the lower wealth effect hits demand.", "score": 6, "replies": []}, {"body": "The rich don’t lose their jobs or it doesn’t matter they have $… u kno who these things hurt.", "score": 4, "replies": []}]}, {"body": "Or those whose businesses are tanked and looking hard at having to access investments to survive.", "score": 5, "replies": []}, {"body": "The way to fix that is to own your own company.\n\nThen government can just shut down your business because \"germs\".", "score": -5, "replies": []}]}, {"body": "Prefer having a job with 9% inflation than having no job with 1,5% inflation.", "score": 32, "replies": [{"body": "I still think unemployment will be relatively low this recession due to the shortage of the labor force, people will have jobs, just not the ones they want. Now if they open the borders again,  Rip jobs.", "score": 2, "replies": [{"body": "Reopen? Which borders are supposed to be closed right now? Def not in the USA, Because I know tons of people who moved here from Latin America South Asia and Europe for work. All in the last month or so.", "score": 2, "replies": []}]}, {"body": "This is insanely short-sighted.  Continued 9% inflation means eventually jobs disappear AND guess what inflation will still be here.\n\nThis is how you have a decade of stagnation.  Rip the band-aid off and create long-term sustainable job growth.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "What do you think happens with 3 or even 5 more years of inflation to all these paycheck to paycheck Americans?", "score": -2, "replies": []}]}, {"body": "It's almost like we built an economy based on self-interest 😮", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Or WW3? Or aliens?\n\n\n\nLet's keep it factual, shall we? Inflation isn't even at 10% and last month it didn't increase at all, om the contrary. Now we may not be out of the woods yet but shouldn't fall victim to bear hysteria", "score": 9, "replies": []}, {"body": "It’s not close", "score": 2, "replies": []}]}, {"body": "Does it make a difference if you can’t make ends meet either way?", "score": 1, "replies": []}, {"body": "Right. We can simply not buy certain things. Inflation will take care of itself.", "score": -1, "replies": []}]}, {"body": "Here's the thing, even if we enter a recession to curtail inflation, we aren't talking 5 years. I would expect a 6-12 month recovery. Look at 2008. That was an absolute shit show where the entire mortgage backed investing market crumbled...which is what banks use to invest. Even that shit show only took 18 months to pull out of.", "score": 5, "replies": [{"body": "Recession ending means growth resumes. It doesn't mean the closed businesses and lost jobs immediately spring back to life. It isn't and shouldn't be that way. Recessions tend to eliminate inefficient uses of capital. By eliminating unproductive jobs and inefficient companies. \n\nIt can still take many years for full economic recovery.", "score": 2, "replies": []}, {"body": "Equities pulled back in 18 months due to QE. Dot com crash didn’t have such aggressive rate cuts and didn’t that take much longer to recover? On my phone can’t check exact dates soz", "score": 1, "replies": []}]}]}, {"body": "What's funny is that the rate hikes are not even showing up in the numbers just yet. Based on everything I've read, it takes 6-18 months for rate hikes to work their way through the system... which means that we are going to start seeing those numbers really drop in Q4-early '23. That's when the fun really begins.", "score": 18, "replies": []}, {"body": "Is that what they been saying all this time????", "score": 7, "replies": []}, {"body": "[removed]", "score": 19, "replies": [{"body": "[removed]", "score": -14, "replies": [{"body": "Oh midterms are going to be fun for the delusional, CNN zombies 🧟‍♂️", "score": 0, "replies": []}]}]}, {"body": "It’s what they want. Great, just great. Sure SLOW the economy & make us pay more in interest rates so we don’t pay more for products that r in shortage due to China Covid shelter & shipping problems. Thnx a lot!", "score": 4, "replies": []}, {"body": "Tiiiiiggghhhht", "score": 2, "replies": []}, {"body": "Hard to believe considering we’re in the strongest economy of all time but okay /s", "score": 1, "replies": [{"body": "All time? Did you adjust for PPP?", "score": 1, "replies": [{"body": "Yes. And Ukraine aide pkgs.", "score": 1, "replies": []}]}]}, {"body": "YA DON’T SAY.", "score": 1, "replies": []}, {"body": "US manufacturing index is still over 50. This means expansion.  Institute of Supply Management shows signs of a somewhat stronger economy. \n\nSo the title of your post/article is misleading", "score": -9, "replies": [{"body": "For now but it looks like a downwards trend", "score": 12, "replies": [{"body": "That's what everyone has been saying last 4-5 months", "score": -12, "replies": [{"body": "Generally how trends work", "score": 15, "replies": []}, {"body": "I mean...they've been right....", "score": 9, "replies": [{"body": "The news has confirmed a soft landing so far", "score": -6, "replies": [{"body": "Two consecutive quarters of economic contraction is not a soft landing...", "score": 2, "replies": [{"body": "Inflation itself does not a contraction make, we haven’t hit a textbook contraction yet. Spending is still up and unemployment still low.", "score": 2, "replies": []}, {"body": "Recession is defined as a negative labor cycle (Morgan Stanley)", "score": 2, "replies": [{"body": "AND spending is technically still up. People keep jumping the gun because of the stock market. Says a lot about the general understanding of economics in this group.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "I still see a-lot of people out eating Walmart always has a lot of people in the store gas is under 3.50 I think things are better than they think", "score": 0, "replies": []}, {"body": "🎶🎵 It's starting to look a lot like stagflation 🎵🎶", "score": 1, "replies": []}, {"body": "What you describe in your intro are signs that inflation is finally slowing down. \n\nLower manufacturing and service indexes is exactly what we need at this point. \n\nIf the economy continues contracting through fed tightening then we’re getting closer to our goal of bringing down inflation to a reasonable rate. \n\nEntering a \"recession” wouldn’t be a long lived event. I’d consider it to be an artificial recession because as soon as the fed starts lowering rates or maintaining low rates we would come out of the recession. \n\nThe economy is strong at core.\n\nWe might experience a couple of months towards EOY or early 2023 of “recession” like you say but I think it wouldn’t last any longer than that. \n\nAll this to say we’re on the right track except if gaz/oil prices are on the rise again and supply chain shortages stop decreasing.", "score": 1, "replies": []}]}
