{"title": "Sen. Warren Worried Fed Will ‘Tip This Economy Into Recession’", "selftext": "Sen. Elizabeth Warren said on Sunday she’s worried the Federal Reserve will “tip this economy into recession” after Chair Jerome Powell vowed to hike up interest rates in an effort to combat inflation.\n\nOn Friday, Powell gave a speech at the Fed’s annual economic symposium about his plan to fight the runaway price increases that have impacted Americans despite unemployment falling to a half-century low. The chairman said that additional sharp interest rate hikes will likely cause pain for Americans, but that these are the “unfortunate costs” of reducing inflation.\n\n“I just want to translate what Jerome Powell just said,” Warren told Dana Bash on CNN’s “State of the Union.” “What he calls ‘some pain’ means putting people out of work, shutting down small businesses, because the cost of money goes up because the interest rates go up.”\n\nSince March, the Fed has implemented its fastest pace of rate increases in decades to try and curb inflation, which has resulted in soaring costs for food, gas, rent and other necessities. The rate hikes have led to higher costs for mortgages, car loans and other borrowing ― leading to plunging home sales.\n\nThe soaring inflation has also made the economy a risky topic for Democrats to campaign on ahead of the November elections, with Republicans denouncing President Joe Biden’s $1.9 trillion financial support package as having fueled inflation.\n\nPowell said that the size of the Fed’s next rate increase ― which will occur at its next meeting in late September ― will depend on inflation and jobs data. The increase could be between one-half or three-quarters of a percentage point, either of which would exceed the Fed’s traditional quarter-point hike.\n\nWarren said that there is “nothing in raising the interest rates, nothing in Jerome Powell’s tool bag that deals directly with” the actual causes of inflation, of which she pointed to COVID-19, supply chain issues, the war between Russia and Ukraine, and price-gouging by large corporations.\n\nFull article: [https://news.yahoo.com/sen-warren-worried-fed-tip-225519269.html](https://news.yahoo.com/sen-warren-worried-fed-tip-225519269.html)\n\nElizabeth Warren says she is \"very worried\" that the Fed will \"tip this economy into a recession.\" The US has already experienced 2 consecutive quarters of negative GDP. Do you agree that the Fed’s interest rate hikes will push the US into a recession?", "id": "x0orlx", "created_utc": 1661779644.0, "score": 33, "upvote_ratio": 0.74, "num_comments": 55, "comments": [{"body": "They have to…no other way. You would be foolish to think the FED will successfully curb inflation via a soft landing. More pain will come. Strap in!", "score": 29, "replies": [{"body": "Europe and China are both in recessions. The US is already in a recession. Question is how much worse will it get.", "score": 5, "replies": [{"body": "3.5%unemployment is a recession? What planet do you uneducated ill informed people come from!?", "score": -9, "replies": [{"body": "The Great Resignation has a huge part in that number lol\n\nA lot of people just don't want to work anymore and therefore do not count towards unemployment numbers.", "score": 2, "replies": [{"body": "also people forget the sheer number of boomers who retired/died. We can have a recession while also having low un-employment.   \n\n\nRecession just means the economy is contracting.", "score": 1, "replies": [{"body": "Forgot about the boomers, I don't know if I can believe anything you wrote though considering we are \"uneducated and ill informed\" lol", "score": 1, "replies": []}, {"body": "Also don’t forget how the survey is done. Basically the census form they use to calculate unemployment is sent to households so if you don’t have a place to stay your not likely to receive the census form. So homeless people aren’t likely being counted in the survey as they don’t have a way to get the form to them.", "score": 1, "replies": []}]}, {"body": "A lot of people RETIRED - Boomers…you want workers, allow more immigration.", "score": 1, "replies": []}]}]}]}, {"body": "I think the fed is going to have to 10 or higher", "score": 3, "replies": []}]}, {"body": "WE ARE IN RECESSION !", "score": 36, "replies": [{"body": "That is apparently a matter of opinion.  Hard facts and figures say that we are **technically** in a recession, but if you are in a position of power you can choose a different outcome.  \"This is not the recession you're looking for...\" (waves hand in Alec Guinness fashion)", "score": 12, "replies": [{"body": "You have no idea what the fuck I’m looking for . Just the facts ! 2 consecutive quarters of negative growth!", "score": 6, "replies": [{"body": "/s in case it wasn't obvious.  Clearly this is a recession.", "score": 6, "replies": []}]}, {"body": "Well, technically we are not in a recession. That is decided by committee and it's a big deal decision - so sometimes they don't even decide there's a recession until after it's over. That's the technical side.\n\nIf you want to argue that we're *effectively* in a recession that's tough ground because unemployment is under 4%, wages are not stagnant, trade is up, and so far consumer spending is still strong. It might go south in the near future but from here it doesn't look like a recession.", "score": 3, "replies": [{"body": "Where’s the unemployment?? Did you graduate high school?", "score": 2, "replies": [{"body": "You're looking at the big picture with a magnifying glass and missing everything else.", "score": 2, "replies": []}]}]}]}]}, {"body": "I stopped reading at “Elizabeth Warren.”", "score": 66, "replies": [{"body": "This is the best response!", "score": 18, "replies": []}]}, {"body": "Imagine thinking Elizabeth warren understands economics in any way", "score": 11, "replies": []}, {"body": "Its funny they talk about price gouging by large corporations as they try to shut down small business. Working to take out large companies competition.", "score": 12, "replies": []}, {"body": "Oh we have some politician pretending to care", "score": 18, "replies": [{"body": "We don't want Powell to eventually go Volcker on the economy by continuing to raise rates by .5-1 BP every couple of months.", "score": -1, "replies": [{"body": "If we could figure out which sectors and stocks get hit the hardest by these rate hikes (you would think the banking / mortgage / real estate sector but so far I am unsure if it is trickling down) we could trade accordingly?", "score": 2, "replies": [{"body": "Growth tech.", "score": 3, "replies": []}]}, {"body": "Yea sure this politician will stop him. This is simply a smoke screen", "score": 3, "replies": []}]}]}, {"body": "In this labor shortage, people have finally started to have some tiny amount of leverage over their employers.  For the first time in my lifetime at least. The fed (and by extension rich people) HATES that. They will literally put the entire country into a depression to prevent that from happening. The inflation is supply chain related, raising rates doesn’t fix that. It’s like cutting your leg off because you broke a toe", "score": 4, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Omg, not our “productivity”!", "score": -3, "replies": []}]}, {"body": "\"2022 inflation has nothing to do with fed rates at 0% or massive quantitative easing, corpo price gouging tho\"\n\nLet me guess, this person is \"fiscally progressive\"?", "score": 11, "replies": []}, {"body": "Almost every day she releases a new plan that would destroy our economy if implemented. No one should pay attention to anything she says.", "score": 12, "replies": []}, {"body": "How do you tip qn economy into a recession if it's already in one. I guess a recession within a recession sounds better than a depression.", "score": 8, "replies": []}, {"body": "We are already in a recession.", "score": 3, "replies": []}, {"body": "Blah blah blah. Biden will send us over. Trillion after trillion after trillion. We wont run out of money for awhile, when we do its going to be horrific.", "score": 3, "replies": []}, {"body": "She’s the biggest joke of a politician ever.", "score": 3, "replies": []}, {"body": "If they are worried about recession, can’t they just change the definition again? Problem solved/s", "score": 3, "replies": []}, {"body": "We were promised unicorns and rainbows if we just give up fossil fuels new carbon neutral technology will be discovered and so many high paying union jobs instead people will freeze to death or die of lab created virus while we eat bugs while they fly in private jets or rocket ships", "score": 6, "replies": []}, {"body": "Considering we are already in a recession by every standard set before 2022, no.", "score": 12, "replies": []}, {"body": "Coming off the Covid pandemic, where people have become more in touch with their own mortality, it truly is a good point and should be taken into consideration the collective well being of the populace as a measurement.   Rooting and wishing for pain are just the bears wishing for a payday.", "score": 2, "replies": []}, {"body": "Hahahahahaahahahahahahahaha\n\n\n\n\nWhat is it are we in now?", "score": 2, "replies": [{"body": "President Biden will tell you. Biden's decision is final.", "score": 2, "replies": []}]}, {"body": "We’re all worried but Warren is not a banker, nor the background, nor the information the Fed has to determine the proper course of action. We’re at 3.5% unemployment and inflation has a firm grip on the economy, it will take 5% + to cool things off", "score": 2, "replies": []}, {"body": "In the 1970s inflation was raging but the Federal Reserve did not have the political will to keep raising interest rates so inflation got worse and finally up to 12% a year.\n\nA new Federal Reserve Chair pushed up interest rates in the early 1980s and caused a bad recession.   The politicians wanted his head and the public and media hated him.   But eventually, inflation dropped and stayed low until last year.  The short term recession was the payment for 40 years of low inflation.", "score": 2, "replies": []}, {"body": "Is every single politician brain dead? How do these people get in these positions???", "score": 5, "replies": []}, {"body": "Government doing government ish trying to debate of the inevitable. We had a recession in 2020 and 2021 but we delayed the feeling with stimulus.\n\nThe entire world is in for a whiplash.", "score": 3, "replies": []}, {"body": "Forgiving loan debt adds inflationary pressure.", "score": 2, "replies": []}, {"body": "Interesting how Warren argues that the fed can’t address “actual causes of inflation”… yet proceeds to describe all sorts of ‘causes’ not one of which being the fastest expansion of the money supply in human history", "score": 4, "replies": []}, {"body": "She makes a good point, will the cure be worse than the disease?  The massive 22% interest rates in the early 80’s happened because government didn’t want to deal with inflation through the 60’s and 70’s, then it got out of control. \n\nI’m old school recession, you need widespread unemployment and mortgage defaults, neither of which we’re seeing. A lot of assholes crying recession for political reasons don’t make it so.", "score": 4, "replies": [{"body": "Mortgage defaults usually happen at the tail end of a recession.\n\nMost of the people claiming we are in one, never said it was over.  So, same with employment, it might be more of a lagging indicator due to labour/demographic forces changed so suddenly with Covid.  Productivity has slowed down, and is slowing down to negative growth.  \n\nThat’s a recession.  That negative growth will echo back through the market a few times before it starts to grow again.", "score": 2, "replies": []}, {"body": "Won’t layoffs and mortgage defaults follow as earning decrease?\n\nMany of the US companies are global and the state of the European and Chinese markets are not the best.\n\nEurope due to high energy costs and China due to repeat shutdowns.\n\nAdditionally big retailers like Walmart are saying that people are spending roughly the same amount but on necessities like foodstuffs and less on other items like electronics.\n\nThese factors are likely to lead to lower earnings and demand which will in turn likely lead to layoffs.\n\nLayoffs lead to mortgage defaults. I think we are in a recession, we just haven’t seen the effects yet.", "score": 2, "replies": [{"body": "https://fred.stlouisfed.org/graph/?g=SyN4\n\nWe are getting there Q2 2022 last update ...", "score": 3, "replies": []}]}]}, {"body": "But has nothing to do with overlevaraged greedy hedge funds, banks, market makers and let's not forget corrupt politicians", "score": 2, "replies": []}, {"body": "We have been in a recession you can't change the definition then blame the fed 6 months later for the dumb choices you made.", "score": 3, "replies": []}, {"body": "The economy will go into recession either way. Pointless.", "score": 1, "replies": []}, {"body": "is she fucking stupid? we literally need this or else we are more fucked. The rates aren’t even hardly restrictive at the moment", "score": 1, "replies": []}, {"body": "As I usually say when reading a comment from her… she’s such a fucking clown", "score": 1, "replies": []}, {"body": "Duh! that dic* head Powell wants to cement his legacy like that of Volcker’s.. he’s going to f everything up!", "score": 0, "replies": []}]}
{"title": "Tesla Sues to Sell Cars Directly to Consumers in Louisiana", "selftext": "", "id": "x11hdv", "created_utc": 1661811095.0, "score": 310, "upvote_ratio": 0.98, "num_comments": 66, "comments": [{"body": " I never understood the legality of dealership only states.  I mean, do they really think the consumer needs dealership to educate on car operations and safety?    Of that dealership is looking out for consumers against car manufacturers?", "score": 57, "replies": [{"body": "Dealerships are the ones trying to normalize $1000 a month car payments…", "score": 29, "replies": []}, {"body": "it keeps more money in the state\n\nrather than all the money from a sale going straight to the manufacturer, the dealer captures some of that and keeps it in the state\n\nthe inefficiency of the dealer model is a feature, not a bug", "score": 29, "replies": [{"body": "Or you know… you can get rid of the dealer and let the car buyer keep more of their money in their pocket to spend at other local store, restaurants, and groceries.", "score": 21, "replies": [{"body": "would car manufacturers:\n\na) decrease the price to help the consumer out\n\nb) keep the price the same and pocket the difference\n\nprice is set by demand (ie it's calculated to extract the maximum out a consumer they can get away with in usual circumstances)", "score": 5, "replies": [{"body": "A+B) manufacturers would lower their price to what they can if they want to keep market share. This isn’t the 60s where ford and GM combine owns 80-85% of the market and you don’t really have another choice for manufacturer.  Today no one manufacturer have more than 15% of the market. If Toyota overcharges you, you can go get a Hyundai, Honda, Chevy, Ford, FCA, VW… and so on; it’s the way capitalism works. Dealership protecting the consumer is an anachronism from a different era that didn’t die because of equally anachronistic dealership laws.", "score": 10, "replies": [{"body": "1. good luck with that\n\n2. dealerships were never about 'protecting the consumer'", "score": 3, "replies": [{"body": "1) it’s not luck, it’s capitalism. If someone else can offer the same goods and services at a lower cost then you are going to lose business to them.\n\n2) dealerships and politicians in their pockets makes that claim all the time.", "score": 6, "replies": [{"body": "1. nice theory, in the real world companies try to avoid competing on price because a race to the bottom benefits no one. Call it collusion, call it 'market differentiation', call it trying to sell luxury and exclusivity, call it artificial scarcity, whatever you call it, no one sells at the lowest possible price (except ford and gm EVs strangely enough)\n\n2. and dealerships lie, always have, always will", "score": 2, "replies": [{"body": "1.   No.   The lowest selling price is whatever the consumer is willing to pay.   That’s why in a dealership model, you can walk-in on the same day, same model and config but pay a different price just because the guy next to you could negotiate better or is willing to walk out for a different car.", "score": 1, "replies": []}, {"body": "You guys can both be right about #1, that's why we have antitrust laws. Business owners are smart enough to avoid a race to the bottom but if they collude to avoid that and harm consumers it is against the law. Whether or not they get caught/the law gets enforced is a different story.", "score": 1, "replies": [{"body": "How do you detect non cooperative collusion? All a company has to do is not rock the boat. You don't need inter company communication for that.", "score": 1, "replies": []}]}]}]}]}, {"body": "These are ideals of perfect competition, but the market for cars is not so. Cars don't fit the definition, and are either monopolistic competition or oligopolistic competition. And the Prices are definitely upward rigid in these market structures.", "score": 1, "replies": []}]}]}]}, {"body": "Make no sense.  Just make manufacturer’s setup a in state company and charge and tax them.", "score": 3, "replies": [{"body": "they tax the sale transaction, but after that all the money flees to where the factory is and to the shareholders\n\nwith a dealer the state double dips because they still get the sale tax but they also get whatever the dealer can claw out of it", "score": 1, "replies": [{"body": "Flees to Mexico where all the cars are made.", "score": 2, "replies": [{"body": "That’s not how it works but ok.", "score": 1, "replies": []}]}]}, {"body": "Not profitable given the opportunity cost.", "score": 1, "replies": []}]}, {"body": "Without a dealership the markup they charge would still stay in the state.  It just doesn't leave the consumer's hands.", "score": 2, "replies": [{"body": "price is set by consumer demand, the price would be the same whether there was a dealer or not (barring exceptional circumstances where dealers can charge over msrp....)\n\nif dealer profit was removed, would manufacturers reduce the price of cars? heck no! they would keep the price the same and pocket the difference\n\n(i am not arguing for dealers, they are inherently anti-consumer, but just explaining why states aren't eager for them to disappear)", "score": 3, "replies": [{"body": "I rather give profits to car manufacturers who actually design and produce a product than a sleazy  dealer who’s always out to get you.", "score": 5, "replies": []}, {"body": "No I get it.  A lot of dealers are also political donors.    But that doesn’t make it right.   Remember, Tesla isn’t looking to ban dealerships.   They just want to sell direct for their own cars.    What’s wrong with that?   Name other consumer product that has law against direct sale to consumers", "score": 5, "replies": [{"body": ">  A lot of dealers are also political donors\n\nthat is another (major) factor\n\n> But that doesn’t make it right\n\nnever said it was\n\n> Tesla isn’t looking to ban dealerships. They just want to sell direct for their own cars\n\neffectively it will end dealerships. if manufacturers can skip the middlemen and capture all that profit for themselves, they'd do it in a heartbeat\n\nyou already see that with ford trying to have a new division that does away with dealers\n\n> What’s wrong with that?\n\nfrom the consumer's PoV, absolutely nothing\n\nfrom the greedy politician's view, absolutely everything\n\n> Name other consumer product that has law against direct sale to consumers\n\nalcohol\n\nbeer has a whole system required by law, supposedly to keep the breweries from having too much power", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> If you are right, then states that have direct sales (California and New York for example) would already have dealerships ran out of business. That didn’t happen.\n\nbecause only new car companies can go direct to consumer. If you have an existing dealer network, you can't bypass them\n\nyet\n\nbut you see the moves ford is making to try to get around this by standing up a new division and pretending it's a new company and thus doesn't have any existing dealers", "score": 1, "replies": [{"body": "I still don’t see the argument for dealership to exist.   How many of us actually enjoys dealing with car dealers?   \n\nThat’s actually one of the pleasant thing about buying a Tesla.", "score": 1, "replies": []}]}, {"body": "No it won’t.   Not many manufacturers can do direct to consumer.    There is an industry to reseller model where manufacturer can project production in mass quantity knowing that bulk purchases are made. \n\n\nIf you are right, then states that have direct sales (California and New York for example) would already have dealerships ran out of business.    That didn’t happen.\n\nAlcohol?   I can order wine from winery directly from California in New York.   Micro brewery can serve and sell.    Anything larger requires licenses.  Yes, beer is another relic from the past.", "score": 1, "replies": []}]}, {"body": "Oddly, most manufacturers seem hesitant to do this, even with Tesla paving the way for them. The dealer model has so much inertia that it could last longer than you think.", "score": 1, "replies": []}]}]}, {"body": "Well no, price is not set only by demand. Demand is one component in price.\n\nIn the U.S. every car is effectively sold twice. Once from manufacturer to dealer and once from dealer to consumer. The price of a car would definitely be less without a middle man. Ideas like “dealer markup” are bad for the brand long term and manufacturers actually hate that dealers are charging excessively.", "score": 3, "replies": []}]}]}, {"body": "Dealerships increase the cost of calls by $1300 on average if I recall Adam ruins everything correctly. They therefore keep no additional money in the state since the money they keep would have stayed in the buyers’ pocket had the dealership been bypassed.", "score": 1, "replies": []}, {"body": "Well state sales tax should be enough for state governments. Perhaps it is extra taxes cities charge that is the issue.  Still, not allowing American companies selling products online doesn’t sound legal. I think this is one law that will go down the drain eventually", "score": 1, "replies": [{"body": "> Well state sales tax should be enough for state governments.\n\nwith current dealers, they capture x% tax + y% from dealer\n\nwhy settle for x when you have x+y?\n\nmaybe if they introduce a special tax surcharge z for direct sales to makeup for the 'unfairness' of not having to compete with dealers . . .", "score": 1, "replies": [{"body": "Understand. Our local government is tax money eater. We pay property tax in everything including vehicles. It is almost sin to buy an expensive car since you may end up paying $4K a year to the county   All the county buildings are like corporate centers and employees are getting paid handsomely. Stupid citizens just voted to issue bonds for $350 million to improve library system no one uses.", "score": 1, "replies": []}]}]}]}, {"body": "to protect the dealers by keeping the manufacturer from underselling them", "score": 2, "replies": []}, {"body": "It's a holdover from the mid 1900s.  \n\nWhen horses were a primary mode of transportation and cars were just coming on the scene, there were a lot of shady car companies that sold cars and kit cars by traveling salesmen and the like.  These were generally of poor quality, and when they inevitably broke or required servicing the company was nowhere to be found so owners had no support.  \n\nFranchise laws were the solution.  Rather than let a manufacturer (who could be on the other side of the country) sell direct, you require a local business person who has 'skin in the game' to represent the brand.  This ensures that only reputable brands will be in the market (as a businessperson who's investing will do a lot more research than someone talking to a salesperson), and ensures that someone local will be around to service the vehicle afterwards.  \n\nOf course the auto market has changed somewhat in the last 100 years.  The Internet is now a thing, so a company that mistreats consumers will quickly lose its reputation.  And we don't have fly by night 'here today gone tomorrow' automaker startups because car regulations require a billion dollars of development and engineering to get a car to the point where it's safe and legal for sale.  \n\nNonetheless, the same justifications apply- having a local business involved ensures consumers aren't ripped off.  And having a local company involved means there's more local motivation to deliver good service.  Of course these days it's more likely to be the local business ripping off the consumers, but that's a separate issue.", "score": 2, "replies": [{"body": "Having a local company involved let’s the local company rip people off.", "score": 2, "replies": []}]}, {"body": "Why doesn't Tesla set up a dealership in Louisiana?", "score": 0, "replies": [{"body": "because it's a stupid idea. also dealerships are separate companies idk if they could do that even if they wanted to", "score": 3, "replies": [{"body": "They could legally via subsidy or holding company.    they just don’t want to pay state tax where they don’t operate in.  .   The point is they really don’t need to. Customers are already paying sales tax \n\nImagine Amazon having to file and pay corp taxes in all 50 states they deliver to.    That’s insane.", "score": 1, "replies": []}]}]}, {"body": "It's because we need the dealers to \"protect\" us", "score": 1, "replies": []}, {"body": "It’s not legal at all it violates the clause of the ucc that says companies cannot be discriminated against. I think it’s a solid case imo.", "score": 1, "replies": [{"body": "Absolutely but unfortunately this is driven by politics and state lawmakers.   I've not heard any single compelling reason why car must be sold via a dealership.    Yes, I get that car manufacturer might choose to do so and that's fine for business model but why restrict them from doing so except to keep the dealership owner rich?\n\nThe dealership argues that they provide education, safety, and fair value to consumers.\n\nJobs?   Showroom and service center will keep ordinary people employed.    \n\nWe don't need more slick hair, conniving sales people whose sole goal is to lure people with all sorts of financing, upselling, and scamming so they can get their quarterly bonus.", "score": 1, "replies": [{"body": "The main motivation behind side stepping the dealership is that the deal ship doesn’t make the profit margins off ev that they can off a large gas fueled vehicle. The deal ship steers people away from ev cars and to the ones they profit the most off. Tesla has a compelling argument that they are being financially injured by being force to sell their cars through dealerships since the dealership won’t showcase their products. I think Tesla in the meantime would be wise to use an internet sales model to provide sales services at a physical location. They can always just say they are selling cars at a kiosk with people there to assist the customers, then just make the internet sale and let la sue Tesla for selling cars over the internet in their showrooms", "score": 1, "replies": []}]}]}]}, {"body": "Nice to see the legal team get to work", "score": 49, "replies": [{"body": "Agreed, especially as I recently moved to the state.", "score": 13, "replies": []}, {"body": "yes, are these the new hotshot lawyers tesla hired? i forgot to apply. any link to the complaint? i wonder what their grounds are.", "score": 2, "replies": []}]}, {"body": "It's so dumb that companies can't sell direct.\n\nFucking grubby little dealers and their grubby little fat hands", "score": 13, "replies": []}, {"body": "[https://www.marketwatch.com/story/tesla-sues-to-sell-its-vehicles-directly-to-consumers-in-louisiana-11661808842?mod=mw\\_latestnews](https://www.marketwatch.com/story/tesla-sues-to-sell-its-vehicles-directly-to-consumers-in-louisiana-11661808842?mod=mw_latestnews)", "score": 22, "replies": [{"body": "You're doing the Lord's work", "score": 2, "replies": []}, {"body": "![img](emote|t5_n9evv|3836)", "score": 0, "replies": []}]}, {"body": "i get some sort of satisfaction from this", "score": 6, "replies": []}, {"body": "Why not do it in Texas?", "score": 3, "replies": [{"body": "If the court rules in favor of Tesla, a precedent would be set for other states.", "score": 5, "replies": [{"body": "Not necessarily. Louisiana is a civil law state, which basically means that it’s weird.", "score": 3, "replies": []}]}, {"body": "This past year, I bought my wife’s model Y, while living in Texas.\n\nPicked up the car at their service center on Research Blvd, Austin.  \n\nThe only thing that was different from a typical dealership was that I had to register the car myself with the DMV / Tax office.  (Texas does their license plates through the tax office, not the DMV).  I also had to pay the sales tax directly to The tax office.\n\nIf I understand correctly, a Toyota purchased in Texas (as an example), the dealership can include the tax payment and work out the registration at time of purchase.\n\nWhich is all to say that Texans can freely purchase a Tesla.", "score": 5, "replies": [{"body": "Absolutely!   Unless Texas bans Tesla registrations.   But in states where direct model works, all that is taken care for you by Tesla, just like a regular dealership", "score": 2, "replies": []}]}, {"body": "Probably waiting for a less corrupt administration and Attorney General...", "score": 2, "replies": []}]}, {"body": "The USA is the most backwards country in the world.", "score": 10, "replies": [{"body": "Lmao I love how you were downvoted when you're absolutely correct. \n\nThe country where a simple medical procedure can absolutely ruin you financially", "score": 4, "replies": [{"body": "Probably could have avoided the hate by just adding a \"first world\" to the descriptor lol.\n\nLike Captain Picard said in Game of Thrones - \"Only the Sith deal in absolutes.\"", "score": 6, "replies": [{"body": "I thought it was “only the Sith deal in absolutes, Harry.”", "score": 6, "replies": [{"body": "Sorry, it's been a while since I saw Space Jam", "score": 2, "replies": []}]}]}, {"body": "Pretty sure there are countries where honor killings are a thing. Same sex marriage is illegal, or you will be denied life saving medical treatment because of who you voted for. Some places don't even allow you to leave!!! But yeah, requiring people to have health insurance to avoid large medical expenses that some other countries can't even offer, that makes it THE MOST BACKWARDS COUNTRY IN THE WORLD 🤦🤦🤦", "score": 4, "replies": [{"body": "People yelling from the penthouse about how badly they have it because they don’t even know what it’s like on the street below.\n\nDumb.", "score": 5, "replies": []}]}]}, {"body": "Move to North Korea then...", "score": 0, "replies": []}]}, {"body": "Let people buy cars directly.", "score": 1, "replies": []}, {"body": "yea that needs to be done anyways... and i think everyone seeing dealerships jacking up prices well over double msrp is plenty of reason to see why... even ford is tired of it and dont know how to get out of it...", "score": 1, "replies": []}]}
