{"title": "Tesla Job Cuts Include Workers Who Joined the Company Weeks Earlier", "selftext": "", "id": "vl96gi", "created_utc": 1656262805.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 52, "comments": [{"body": "Oof the toxicity in that thread. How quickly opinion turns in WSB...", "score": 22, "replies": [{"body": "It’s funny to watch how reddit gets absolutely obliterated by  different groups of activists over time.  The first ones to do it were the Ron Paul people.  Then the occupy people.  Then the Bernie bros.  Then the COVID fear porn crowd.  Today’s flavor is antiwork.\n\nAny big thread on literally ANY sub will get just taken behind the woodshed by these complete pillocks.  But it’s just the way a karma-based content sorting system works.  The victor is always the most motivated with the most time on their hands with the biggest axe to grind.\n\nReddit should change its motto from “front page of the internet” to “come see what kids who live in moms basement are talking about!”", "score": 53, "replies": [{"body": ">come see what kids who live in moms basement are talking about!\n\nIt's pros who are paid to spread propaganda, not kids\n\nKids are just easy scapegoats\n\nlol", "score": 4, "replies": [{"body": "They're useful idiots who get caught up in the propaganda. I've met people in real life who hate Elon, when prompted why? I get nonsensical arguments that he only \"bought\" Tesla to make money, and all he cares about is money.\n\nAside from the fact that Tesla existed on paper only before Elon, already wealthy people don't start electric car companies to make more money, especially not in 2003.\n\nThey're either stupid, or brainwashed.", "score": 5, "replies": []}]}, {"body": "WSB is not an antiwork sub.  They tend to love the right-wing and trolls with populist pretensions.  The issue is last year they got $$$ on Tesla.  In the past 6 months Musk has obliterated them multiple times ('selling 10%', 'i'm buying twitter').", "score": 0, "replies": [{"body": "That’s not really how reddit works.  Once a post goes onto the front page or a sub crosses a certain popularity threshold, the political trolls start brigading it.  It doesn’t matter what WSB used to be or says it currently is, once you get into popular threads they get overwhelmed by activist losers looking for somewhere to grind their axe.\n\nIf you really think the same group of people who squeezed Melvin capital are the same people who are now complaining about Elon laying people off you’re crazy.  It’s not the way this site works any more.  Opinions on popular threads masquerade as “community consensus” when they’re nothing but brigaded trolling.\n\nYou end up with hilarious results like investing subreddits extolling communist ideas.  Or tesla subreddits being anti Elon musk.", "score": 20, "replies": []}]}, {"body": "Excellent writeup", "score": 1, "replies": []}]}, {"body": "wsb is woke reddit cancer ever since the justice workers party of reddit took on the fat cat hedge funds. Brave.", "score": 1, "replies": []}]}, {"body": "Last hired first fired?", "score": 13, "replies": [{"body": "Layoffs don't work like that unless it's a union shop? :-)", "score": 1, "replies": []}]}, {"body": "yeah that's how layoffs work...", "score": 14, "replies": [{"body": "That's not fitting with the \"getting rid of the cruft\" explanation we generally see. That'd be under the n month trial period companies have, not layoffs. There's also been hourly workers getting dropped.", "score": 10, "replies": [{"body": "You know what your previous employees can do. If the new hires were never deemed up to the other's standards and then then the layoffs were decided on, that still agrees with the reasoning given.", "score": 3, "replies": [{"body": "I get that. It just seems like one more case that we're being told one thing and then there are other things happening.\n\nThis was a company where the goals were clear, the actions were explained, and the motivations were reasonable even if the media didn't get that or care to relay that. I miss that.", "score": 3, "replies": [{"body": "Three corrections to your comments in this thread:\n\n(1) Neither Tesla nor Elon \"told\" or announced the layoffs to the public. It was internal communications that were leaked, in some cases without the context being provided. The first message was never even published as far as I am aware - a Reuters writer said they had seen the email, but we don't know what the rest of the email said.\n\n(2) It wasn't Twitter - it was internal emails. Elon later made short comments on Twitter but didn't discuss the reasons for the layoffs on Twitter.\n\n(3) In the email, Elon didn't say anything about getting rid of sub-par employees - it was other people who speculated that this could be a reason, and it doesn't make sense to attribute that reason to Elon. The email that was published:\n\n\"To: Everybody\nSubject: Headcount Reduction\nDate: Friday, June 3, 2022\n\n\"Tesla will be reducing salaried headcount by 10% as we have become overstaffed in many areas. Note this does not apply to anyone actually building cars, battery packs or installing solar. Hourly headcount will increase.\n\nElon\"\n\nSo in the context Elon described, where they realize that they have too many people with a particular position, it's not surprising that they might lay off people who have just been hired, or rescind job offers. If there's a person who shouldn't have been hired in the first place, it wouldn't make sense to put them through an n-month trial period, and then immediately after that lay them off because they're not needed - they already know that they don't need that person.\n\nAs to why too many people were hired for certain positions, it could be because team leaders overestimated the number of people they would need, or perhaps wanted to keep a certain number of \"positions\" under their leadership.\n\nAssuming Elon's explanation is accurate, it would not be surprising if the company would also take the opportunity to lay off some individuals they were unhappy with for a variety of reasons. But that was not explicitly stated by Elon or the company, nor to my recollection did they state that during previous layoffs. And there is less stigma for employees laid off reportedly due to changes in staffing needs than fired for cause.", "score": 2, "replies": [{"body": "Fair points, but either way you'd have to agree that the messaging on everything is a mess, right? Hourly people are still also being laid off, and clarification emails being needed in the first place is just an indicator of it all being a mess.\n\n> But that was not explicitly stated by Elon or the company, nor to my recollection did they state that during previous layoffs.\n\nSure, If you check again I've been wording my comments throughout this that this is the explanation people here have been putting forward, not that it came from Tesla, or at least trying to. I don't expect Tesla to say that, because that's probably not smart from a HR/legal point of view.\n\nSpeaking of which, on top of that there's now a court case about them being laid off against state laws which should never ever be happening. What's going on?", "score": 1, "replies": [{"body": "I would agree that the public didn't get the information very efficiently, but I would hesitate to blame Tesla since in this case they were apparently not intending to inform the public at all. Tesla may from time to time use leaked emails to deliberately get information to the public, but this doesn't seem to have been one of those cases, and I don't think Tesla is obligated to get more efficient leaks.\n\n> Speaking of which, on top of that there's now a court case about them being laid off against state laws which should never ever be happening. What's going on?\n\nI saw one mention (not from Tesla) that there's a law that if a company has a very large layoff (I believe it was 10% or more), then the company is required to provide advance notice, maybe retraining opportunities, etc. but that it doesn't apply if the total count is less than 10% which seems to be the case here. No guarantee that I remember it correctly or that the sources provided full detail, but Tesla doesn't seem too concerned about it.", "score": 2, "replies": []}, {"body": "You are bang on, and it frustrates me that the tesla crowd is the one doing mental gymnastics on this given it is always the other way around. This whole thing doesn't sit right. There is no lense through which this isn't a fck up. Same with how Elon approached twitter deal. Unfortunately, even someone as clever as Elon makes mistakes.", "score": 2, "replies": []}]}]}, {"body": "A company of 100k people going through some lay-offs are gonna have all sorts of people in all sorts of situations being let go. There's not one \"rule\".", "score": 3, "replies": [{"body": "There's never been one rule, but there has been clarity possible. We've lost some of that. You can't deny there's mixed messages now, right? So often now I'm asking myself \"wtf is he doing?\" and saying \"don't do that ffs, that's shooting yourself in the foot\". \n\nThere's always been a little of that but you could dig and find and explanation, now? No explanation for a lot of it.", "score": -1, "replies": [{"body": "They said there would be layoffs with roughly 10% of salaried staff being affected.\n\nWhat additional clarity are they supposed to give? A bunch of pie charts breaking it down by position, heat maps with layoffs by location? No company would do that. It honestly doesn't matter exactly what it is.", "score": 5, "replies": [{"body": "It's not just the messaging around this, it's a whole thing. \n\nFor a start, on that, it's not just salaried staff being laid off like was suggested. Remember the first tweet didn't even say that, that only came later, and it's not just cruft like people took it to mean and tried to explain it as, it's hourly, and it's new people. The messaging on all this was a mess, and that really really matters. Tesla layoffs of thousands of people are big events from a PR point of view and an investment point of view, and we shouldn't discount that.\n\nA lot of positions require more than just a few weeks to get into the groove of things. Obviously you can tell some people will never be able to fit into a role, but that's a different thing to what's suggested here. It's not a layoff, that's just a probationary cut and I bet those are happening all the time even before this round of layoffs.\n\nThis is really part of a wider problem though. How that announcement was handled was a mess but speaking more generally Twitter comments have become a liability. There were always going to be people who hate Tesla/Musk because he's rich, and really, fuck those guys, they're not operating on all cylinders (sorry for the ICE analogy) so we don't need to address those but a lot of what's been said on twitter now is straight up divisive. They can sell to everyone without him needing to pick a political side. He used to be so good at saying nothing on that topic. The vehicles speak for themselves, they will sell on their own qualities. Eventually everyone will come round.\n\nThe messaging used to be something aspirational, now what gets widespread notice is stuff that's poisoning the well, and it's only gotten worse when there's absolutely no reason for it.\n\nHe needs to take stock of what he's doing on twitter, maybe quit it like he quit facebook, not buy it. We've been saying twitter's a problem for years but nothing's changed for the better, only for the worse.", "score": 0, "replies": [{"body": "Each manager probably had to let 10% go. You will get all sorts of people let go in that 10%. \n\nThere is no “perfect” way to communicate or rationalize this.  \n\nScience and logic look at the overall results. You are letting a anecdotal evidence drive your thought and rationality. That’s bad.  It’s like 1 kid got diagnosed with autism after a vaccine shot.  So vaccines cause autism.  Correlation is not causation.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Yawn. Did you read the article? One recruiter posted on Linkedin that they were let go soon after being hired. That's it. That's where Bloomberg derived its \"includes workers who joined the company weeks earlier.\"\n\nDo you people not realize that essentially every news article is written in 5 minutes based on a complete lack of research and anecdotes scraped from twitter? Is it fun to sit back and moralize about how the company culture has shifted, how Tesla is in trouble?\n\nIt's all so stupid.", "score": 1, "replies": []}]}]}, {"body": "this is just a low-effort hit piece but I do wonder if Elon ran afoul of SEC rules by giving significant material information to a third party without disclosing it in follow-on 8-K filings.\n\nApple did this all the time when I was following the stock.", "score": 4, "replies": [{"body": "What info did he give to a third party?", "score": 6, "replies": []}]}, {"body": "I was told the stories about job cuts were just the MSM pushing an anti-Elon narrative ![img](emote|t5_n9evv|3990)", "score": 5, "replies": [{"body": "They are, this is non news if it were any other company", "score": 9, "replies": [{"body": "Every tech companies layoffs get reported in the press. \n\nEspecially when it involves taking back offer letters.", "score": 7, "replies": []}]}, {"body": "By who? No one has said the news was fake. \n\nThis is being done by the whole industry who want to lower their number of employees. Whether underperforming or just trying to tighten and/or redirect focus. \n\nAlso, we have no idea the scale of this.", "score": 5, "replies": []}, {"body": "Q: will this decrease a) Tesla’s production; b) sales; or c) margins?\n\nNo? Then what’s bad about it?", "score": 2, "replies": [{"body": "People associate tesla with the mission of doing good on the environment and somehow tangle that with good for the individual workers as well.   If it will probably increase margins I don’t know if it will decrease production… and we’ll maybe some sales depending on how many people feel like this was a violation of their principles", "score": 4, "replies": []}, {"body": "whether it's good or bad is for us as investors to decide. my point was simply that the reports were correct.", "score": -4, "replies": [{"body": "No one was arguing that Tesla wasn’t firing people…only that the cuts were 10% of salaried employees and that ultimately, Tesla would *grow* their hourly headcount.\n\nTwo things which the MSM obfuscated.", "score": 4, "replies": []}, {"body": "Which no one denied. 10% of salaried are leaving. Not 10% of all people which the media was pushing. No one manufacturing is being cut, and other hourly positions weren't mentioned so it was up in the air. None of this changed.", "score": 4, "replies": []}]}]}]}, {"body": "I guess better to let go the new people than to train new ppl. That seems pointless", "score": 1, "replies": [{"body": "No no... the job cuts are to weed out the non-productive.  Like the new not-fully-ramped up new people you just invested alot of $ in hiring.", "score": 1, "replies": [{"body": "This article is based on a linkedin profile change of one Tesla \\*recruiter\\*. That's how dumb it is. That's how dumb it is. That's how dumb it is.", "score": 2, "replies": []}]}]}, {"body": "Ok but how many did they hire compared to laying off the top-heavy people?  Notice that these news outlets don't report the real news. They are cutting people who are behind the scenes, not the real work force that's actually expanding.", "score": 1, "replies": [{"body": "Anecdotal evidence is not evidence. \n\nCorrelation is not causation. \n\n\nPeople that believe in sensationalism need to be educated.", "score": 0, "replies": [{"body": "Bro what are you even talking about. A fact is a fact, it's literally what he said.", "score": 1, "replies": [{"body": "Anecdotal doesn’t mean it’s not fact. But have a few people getting let go this way has little implication when 3000+ other people are let go other ways.", "score": 1, "replies": [{"body": "You seem like you replied to the wrong comment. Tesla is letting go of top heavy people, workforce is increasing, not shrinking.", "score": 1, "replies": []}]}]}]}]}, {"body": "This is sorta normal business operations though this and others tidbits do indicate that Tesla perhaps does not see the same rosy forecast for their business out into the future that they had during the last couple years", "score": 0, "replies": [{"body": "Howso? They have huge demand and are rapidly expanding on the production and manufacturing front.", "score": 3, "replies": [{"body": "I struggle with “feelers” at work and the internet. \n\nTSLAQ is still feeling the company is going bankrupt without any evidence.", "score": 1, "replies": []}, {"body": "Demand isn’t infinite and during an economic slowdown there is less demand for $50k plus cars. There have been hints by Elon musk and common sense fills in the gaps. Auto companies in the past really get hit hard in recessions, I think GM went bankrupt last time", "score": 0, "replies": [{"body": "Yet Tesla still had year long waits just further increased prices. \n\nI'm confused what common sense you're using and what gaps you're filling.", "score": 4, "replies": [{"body": "We’ll see how much of the year long waits and price increases are supply chain delays and inflation.", "score": 0, "replies": [{"body": "Well if the cost to Tesla of an EV has increased minimum $10,000 over the last year and a half and that hasn't happened to other automakers, they're probably all about to go bankrupted.\n\nAnd seeing as Tesla factories are having record production, their supply chains also seems fine.", "score": 4, "replies": []}]}]}]}]}]}, {"body": "Damn when did WSB become a bunch of unfunny intellectuals ...", "score": 1, "replies": []}]}
{"title": "Any suggestions on some new investments?", "selftext": "Hi All  \nFirst time posting here, hopefully it is allowed and not removed!\n\nI have been buying the dips and averaging down on my current positions for as long as I have been investing.  \nI only started at the end of Jan 2021, possibly the highest the market has ever been. So I am still quite new to this.  \nI am not too scared about whats to come, and I am looking at taking the opportunity to buy some new stocks at these discounted prices. I am 30, if that makes any difference. I like the high growth, high risk plays. \n\nAny suggestions on some stocks to buy that are over sold and heavily discounted?  \nCurrently looking at :\n\nShopify, Square, Amazon, AMD. \n\nHappy to YOLO in to something too. \n\n  \nTIA", "id": "vlf2ng", "created_utc": 1656279329.0, "score": 12, "upvote_ratio": 0.7, "num_comments": 57, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 month ago\n**Total Comments**|2|**Previous DD**|\n**Account Age**|1 month|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vlf2ng)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vlf2ng)", "score": 1, "replies": []}, {"body": "Cigarette companies have insane FCF yields and give a lot of it in dividends. MO, PM, BTI. Under armor isn't bad either. Some oil companies even with higher oil price still make sense (XOM, SU, BP).", "score": 7, "replies": [{"body": "Been building position in MO, rumor is they'll be getting into the weed industry if it ever gets fully legalized", "score": 3, "replies": [{"body": "That sounds like a great option.  \nHopefully they do get into weed and it takes off. But it is only down 8% in the last year.  \n\n\nLooking for something with more upside potential", "score": 1, "replies": [{"body": "They give a pretty good dividend. A somewhat linear fluctuation of price action is good for building a position. Cause if it does happen it'll most likely near double", "score": 1, "replies": []}]}, {"body": "Their choice of cronos was... Creative", "score": 1, "replies": []}]}, {"body": "Thank you!   \nWill check those out.", "score": 1, "replies": []}]}, {"body": "Inverse Cramer - you’ll be a millionaire in 24 months.", "score": 12, "replies": [{"body": "Maybe less...ehehehe", "score": 2, "replies": []}, {"body": "lol", "score": 2, "replies": []}, {"body": "Can't believe I had to get this far for the best comment.", "score": 1, "replies": []}]}, {"body": "I know you said you like growth stocks but adding some core/dividend growth type stocks might not be a bad thing to add to your portfolio.  That being said, I'm going to be looking at Intuit and SPGI this week to see if they may be worth adding.  Sold some puts on LRCX, HD and AVGO as well so may be adding those if they get down to my strike price.", "score": 4, "replies": [{"body": "Thank you for your reply.  \nI am actually quite heavy in 4 canadian dividend growth companies. Enbridge being one of them. They are all in different sectors and combine pay me around 5.5% yield.   \nThey are all still green for me and I have been adding to them lately. \n\n  \nJust looking for some other new investments", "score": 2, "replies": []}, {"body": "LRCX gang! This is probably the best semiconductor play imo. <$450 is a steal.", "score": 1, "replies": []}]}, {"body": "High risk high reward is shift technologies. \nOther good ones pretty undervalued are matterport, tesla, facebook, and Palantir to name a few. Good luck 👍🍀", "score": 5, "replies": [{"body": "I am in Tesla and Palantir already.  \nWill consider Facebook too, they are down 52% YTD!", "score": 2, "replies": []}]}, {"body": "If you wanna be attentive with the market all four except shopify. Look what's be going on years from now. SMR's are going to eventually be a mainstream thing but probably not until 2030. Maybe venture into disruptive tech that are still in early stages.", "score": 3, "replies": [{"body": "sorry what is SMR?", "score": 1, "replies": [{"body": "Small modular reactor. Basically a handheld reactor that can power a neighborhood. The only publicly traded company so far is nuscale, or you can go with fluor who has invested in nuscale and holds a big position. I'm in both", "score": 2, "replies": []}]}]}, {"body": "I didn't know you could ask this sub for investments.....but now that you ask..PLTR", "score": 3, "replies": [{"body": "I am heavy in PLTR already.", "score": 2, "replies": []}]}, {"body": "Graphene is the future", "score": 3, "replies": []}, {"body": "Hookers and coke is what I'm most bullish on\n\nEspecially if you can get them around Wall Street", "score": 3, "replies": []}, {"body": "You want to see all bags in one spot,\nCheck all the comments below 😂😂😂", "score": 5, "replies": []}, {"body": "EVs", "score": 2, "replies": [{"body": "I am in NIO and Tesla.  \nAnything else you suggest?", "score": 2, "replies": [{"body": "Full disclosure I am no oracle. I do think EV tech is disruptive and the industry/market will grow dramatically. Consumers are just getting acquainted with the products. I also think Tesla and NIO are good choices. Tesla is well established and way ahead in the US. NIO is in a big market and I believe battery swap is an important discriminator. Seems like I’m enough timber they should pay off.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Thank you for your reply.    \n\n\nWhat are you recommending :) ?   \nI am in Canada, and the first stock I would recommend to others would be Enbridge.", "score": 1, "replies": []}]}, {"body": "just look at the earnings release calendar gamble accordingly.", "score": 2, "replies": []}, {"body": "Theres this really good investment called cash. Cash is out performing the market by more than 20% ytd!", "score": 1, "replies": []}, {"body": "Alibaba", "score": 0, "replies": []}, {"body": "Boston Beer\nSAM\nI think it’s terrific\nSuper low float\nHuge upside more than 100%", "score": 0, "replies": [{"body": "Why?", "score": 1, "replies": [{"body": "Big gaps at 490\n800\nChart looks great\nIt’s already breaking out, up 12% from the low.\nNext stop 390\nThen retrace back", "score": -1, "replies": []}]}]}, {"body": "Invest in lead, copper and sulfer.  Not financial advice.", "score": 0, "replies": [{"body": "PUT YOUR HANDS UP GREVTHEFAITHFUL!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 7, "replies": []}]}, {"body": "DIS, IEP", "score": 1, "replies": [{"body": "DIS can't get out of their own way. New light-year movie is tanking. Out of tune with the market.", "score": 1, "replies": []}]}, {"body": "$SMR\n$ASTS\n$SLDP", "score": 1, "replies": []}, {"body": "Bear Stearns is fine…\n=", "score": 1, "replies": []}, {"body": "Czr, did we all forget they bought el dorado resorts", "score": 1, "replies": []}, {"body": "Intel is a solid pick. It’s been beaten down, has a decent side for continued growth, and also tosses in a dividend too.", "score": 1, "replies": []}, {"body": "I like the uranium sector myself.", "score": 1, "replies": []}, {"body": "URANIUM", "score": 1, "replies": []}, {"body": "in my opinion solar is the future, solaredge and enphase can't go tits up in the long term", "score": 1, "replies": [{"body": "It is decidedly so", "score": 1, "replies": []}]}, {"body": "I am interested in RIO and have TOL and INTC. RIO has low PE, good dividend, manageable debt, but could be tough going into recession. TOL, also problems in a recession but low PE, lumber is cheaper and there is supposedly a shortage of homes in the USA, INTC good dividend and low PE but they are starting to build new chip foundry which may be costly over next two years. Will start buying more INTC at 29.\n\nAlso pltr at $5 for speculative play. Selling csp.", "score": 1, "replies": []}, {"body": "GLBE - not a bad e-commerce play that will shoot up in price as global trading starts to recover in 12 years\n\nCRSPR - the OG crispr-focused company. All biotech companies are big gambles but Crispr as a technology is still very promising. They're doing some Phase I studies for treating diabetes (Phase I means jackshit) but if they can find a way to bring about insulin production while shielding from autoimmune attacks, their share price would jump infinitely", "score": 1, "replies": []}]}
{"title": "Discussion on the Overall Uranium Sector", "selftext": " \n\nWelcome to Rad's breakdown of the uranium sector. In this discussion I will be exploring the uranium sector as a whole, where things currently stand, what uranium is , what it's used for, why uranium has a good setup for the future and how you can get into uranium should you choose to. I've been looking into this sector for over a year now and have done more hours of research than I could count. Before I get into anything I want to emphasize THIS IS A LONG TERM PLAY. This is not about buying weekly calls, this is not a squeeze. This is an investment in a growing sector that should provide significant returns in the next few years. I'm not bothering with short dated calls because right now the market is more or less whatever SPY does. SPY green, market green. SPY red, market red. If you want to do calls just play SPY for now since everything follows it. But if you want a good sector to put some cash that will pay off, then welcome to the discussion.\n\n**Uranium, what is it and why should I care?**\n\nMany of you have probably heard of uranium. It's that green glowing rock that kills you if you go near it and makes a Godzilla right? Nope. First, it's brown not green. Second, it's actually not very radioactive out of the ground. It needs a bunch of stuff done to it before it becomes that glowing stick thing you see on The Simpsons. But what's actually important about uranium is its use as a fuel source. Uranium is used to power nuclear powerplants. Plain and simple, that's its use. And before you go \"Pfft nuclear is dead, waste of time.\" understand nuclear is actually more important than you think. As of today, the USA gets 20% of its baseload (24/7 consistent power generation.) power from nuclear. Yes 20%. That's not a small amount at all. And globally nuclear accounts for 10% of global baseload power. So the idea that nuclear is dead isn't correct. It's too important right now to be dead. Unless you think the world is going to just go into full brownout and blackouts, nuclear globally isn't being shut down in the next decade. It's just too complicated for the USA to replace 20% of its entire baseload energy generation no matter how much wind and solar is built (I actually like wind and solar mind you.).\n\nOn top of being a major energy source nuclear is carbon neutral. A nuclear powerplant with a 40 year operational life will generate as much carbon over its lifetime as a coal powerplant will produce in just 2 hours of operation. That's it. Not only is it carbon neutral, it's highly energy efficient. One uranium fuel pellet will generate as much energy as one ton of coal, 149 gallons of oil or 1700 cubic feet of natural gas. What this means, you can store a ton of energy in a small space using nuclear. For the USA that might not matter, but for nations like Japan that don't have as much space, being able to store years of energy in just a few warehouses is significant.\n\nPast the efficiency, nuclear is a baseload energy source unlike wind and solar. This means it generates consistent amounts of reliable electricity 24/7. Wind and solar can't do this. Sometimes it's not as windy. Sometimes it's not as sunny. This matters because if you're building an electrical grid, you need a certain amount of it to be providing a consistent predictable amount of energy. Otherwise, you risk blackouts at certain periods. Electrical grids NEED baseload energy in order to ensure the lights stay on. Right now the carbon free options are nuclear or hydroelectric. But while you can build a nuclear powerplant anywhere, hydroelectric is limited to areas with flowing water. Sure it works in the USA, but good luck providing electricity in the African desert with hydroelectric. I'm not saying wind, solar or hydroelectric are bad. I'm saying they can't be your only energy generation either due to geographic limitations or having too much fluctuation in energy production. They're great as PART of an energy grid, just not as 100% of it.\n\n**Downsides of nuclear.**\n\nWhile nuclear has many upsides there are of course downsides. Let's start with the giant radioactive elephant in the room. NUCLEAR MELTDOWNS!!! OMG so scary right? They happen and then millions of people die and stuff. Except that's not exactly true. People are familiar with 3 major meltdowns, Chernobyl, Fukushima and 3 mile island. Let's do the easy one first. 3 mile island had a grand total of 0 deaths. I'll say that again. 0 people died from 3 mile island. Nobody. That doesn't mean it didn't have some negative things, but there were no deaths. Not just that but they got the leak under control quickly. Now onto Chernobyl. Yes people died, and the nearby land was ruined. However, this was a very special case. See, the USSR really didn't give a damn about the people of Ukraine when they build Chernobyl. Like at all. They wanted energy generation and skipped pretty much ALL safety regulations. Yes it was bad, but nobody will ever be allowed to build a powerplant that unsafe and unregulated ever again because of it. This was less nuclear bad and more neglecting any form of safety measures for any powerplant bad. Finally we have Fukushima. Yes a big scary disaster. But like 3 mile island nobody died from the meltdown. Now people died from the tsunami. But there were no recorded deaths from radiation exposure. Add in it took a historically large earthquake AND the powerplant regulators ignoring a key safety measure, moving the generators off the bottom floor, which they had been told to do for years. I don't want to downplay these events but they're not the world ending disasters the news likes to pretend they were. In fact, nuclear has the lowest death per KWh of any energy source wind and solar included. Add in new nuclear powerplants being much safer and having many fail safes. (Fun fact, Fukushima was actually OLDER than Chernobyl). Take the Zaporizhzhia nuclear powerplant in Ukraine. Russia recently bombed this powerplant during an assault. Everyone was freaking out. Know what happened? Nothing. Why? Because nuclear powerplant reactors are build with a protective core designed to take a DIRECT impact from a full 747. They're a lot safer than people realize.\n\nNext downside, the cost. Nuclear powerplants are EXPENSIVE to build and a lot of companies don't want to build them. It takes 10 years of operating for a powerplant to just break even. That's a scary investment and a lot of companies won't do it. But there are new powerplants being built. The US recently has 2 new powerplants finish in Georgia and is working on extending the lifetime of current powerplants including Diablo Canyon, the last powerplant in California which the governor has requested a 20 year life extension for and it looks like he's going to get it. That's right, even super green California is now changing their tune about nuclear. But it's not just the USA. Germany has started talking about delaying the shutdown of their remaining powerplants (They probably won't, but the fact Germany is even willing to discuss the idea shows a huge sentiment shift.) Japan's new ruling party has made restarting their nuclear fleet (shut down since Fukushima) a top priority with plans for several reactors to come back online this year. India, South Korea, Romania, France all have plans for new reactors. Even Bill Gates is working in Wyoming on creating new safer small modular reactors (SMRs). Then there's China. China has committed to building 150 new reactors over the next decade. Yes 150 reactors or 15 reactors a year. Simply put, nuclear isn't going away and even seems to be growing now. Even Gretta Thunberg has come out in favor of nuclear.\n\n**Ok so nuclear will exist, who cares.**\n\nSo we've established two things, nuclear currently exists at a level too large to shut down anytime soon AND places aren't just not shutting it down, they're adding even more. Now we get to the money part. See that uranium used to power a nuclear powerplant, it has a problem. It's too cheap. How cheap? Today uranium sells for $49/pound. But it costs a mining company $65-$70/ pound to mine it. Yes, companies currently lose $16-$20/pound mining uranium. But why would they mine it if they're losing money is probably your question. Well, for most companies, they're not. They have shut down all mining and are waiting for prices to go higher. This has created a major deficit in supply. Currently, 180 million pounds of uranium are used per year globally while only 120 million pounds are mined. That's a 33% yearly supply deficit that has been going on for 3 years now. Now you might ask how is that possible. Well in 2011, when Fukushima happened, Japan shut down all their nuclear reactors. But, they had a bunch of nuclear fuel already in warehouses. Powerplants will have between 2-3 years of supply on hand at any given time. So what did these Japanese powerplants do? They sold all that uranium and flooded the market. Look below at the graph of the price of uranium starting in 2011.\n\n&#x200B;\n\nhttps://preview.redd.it/yjy82kf6m1891.png?width=624&format=png&auto=webp&s=2c78a3ef97d1f49e6a575907faea73923e5b0646\n\nSee that giant price drop from $50 down to a low of under $20? That's all that Japanese supply flooding the market. Well that supply is running out. Not only is it starting to run out, Japan is restarting their reactors as stated above, meaning they're going from a net seller to a buyer of uranium. All that cheap supply utilities could buy up is disappearing, and when supply goes away prices go up. Let's see another graph. from 2007. \n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/89ny4xtlm1891.png?width=624&format=png&auto=webp&s=b1514f8cfc1aa37153ec2cd574cf08ea6c43185e\n\nSee that giant price spike? That's from supply going away. Specifically, from the USA ending their program of decommissioning nuclear weapons which gave a cheap supply of uranium for powerplants to buy. That same thing is about to happen in the uranium sector. All the cheap Japanese uranium has been bought and they're done selling. This is going to cause another price spike and the mining companies are going to thrive. See, as stated earlier, most of these companies are not mining. What this means is they're sitting waiting for the price to get to a level worth mining and then they'll start selling. Now, in the uranium sector selling is done through a contract with utilities. Usually these contracts are signed for 10 years with a price range. A bottom price so the mines don't get screwed and a top price so utilities don't get screwed. As of today, most companies don't have any contracts, but as the supply runs out utilities are going to be forced to talk to the miners and sign these long term contracts. And this isn't just theoretical. Cameco (CCJ) the 2nd largest uranium mining company in the world announced in January they had signed 40 million USD in new contracting that month which was more than they did for the entire year of 2021. Other mines are also announcing the beginning of some early contracts as utilities are finally showing signs of realizing their nice cheap supply of Japanese uranium is going to run out. And when these contracts come it won't be one or two at a time. It's going to be a rush of utilities scrambling to get  contract signed with whoever they can. Because the uranium sector has one other key thing. It's small. Tiny. How small? The entire uranium sector has a market cap less than that of Tesla. That's it. Not only is the sector tiny, you can count on two hands ALL the companies currently able to mine uranium. And as for the ones trying to build a mine? The fastest ones expect to be running in 2024 AT BEST. Here's another chart for you.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/mplfck24o1891.png?width=719&format=png&auto=webp&s=a3cb58c6e2b1ceed55eb1cfcd7175d2534633685\n\nThis chart shows the total projected uranium mining compared to the demand out to 2040. See that red space above? That's a deficit where demand beats out supply. Here's the thing about this chart. It assumes a full restart of ALL existing mines AND ALL planned uranium mines. Yes. Even if every single mine and planned mine came online on time with full production there would still be a huge deficit. And uranium mines do not have near a 100% start rate. More like a 10% chance for a company to go from discovering uranium to actually getting a functioning mine. And understand something about uranium, it is an inelastic fuel. You can't substitute anything for uranium. Either you have it OR you can't run your power plant. And not running isn't an option. Utilities can and will pay huge amounts to get their fuel supply. This is because uranium is a fraction of the cost of a powerplant. It accounts for just 5% of their operational costs. That's it, so a powerplant can have the price of uranium shoot up and see minimal impact. The analogy I like to use, think of a steak dinner. The steak is what's expensive. Now do you put salt on the steak? Sure. But do you care what the salt costs? If tomorrow salt did a 10X on price would you stop eating steak? No, because salt is dirt cheap so who cares what it costs. The same holds for uranium. And even if the price goes through the roof, governments will subsidize before they allow blackouts. Because that's what the entire uranium sector really boils down to. Uranium sells for too little to the point where one of two things must happen. Either the price of uranium will go up to at least $65-$70/pound OR when you flick a light switch in the USA in 5 years, the lights will not work. That's the bet you're making, which one do you think is more likely to happen.\n\n&#x200B;\n\n**Sprott and uranium.**\n\nI'm going to take a quick second to talk about one other factor in the uranium sector. Sprott. For those of you unfamiliar, Sprott is a resource investment fund run by a man named Eric Sprott. He runs large physical funds that let investors buy shares which he then uses to buy physical gold or silver. Very simple system. You buy some shares, he buys some gold. You can sell your shares or ask for payment of gold in an amount equal to your shares. Well, he's doing this exact same thing for uranium (minus the delivery part, sorry guys you can't get uranium sent to your home.) The system is the same, you buy shares his company uses that money to buy physical uranium which they store in a warehouse. But here's the thing, this is not a resell system. Sprott gets paid per transaction, they buy an amount and keep 1% of the purchasing fee for themselves. That's how they make money. They DO NOT resell this uranium, in fact, there currently is no system to resell the uranium in place. What this means, there is a system in place currently taking in millions of pounds of uranium off the market that will not resell. This takes a deficit and adds even MORE pressure since now Sprott is buying up supply from utilities.\n\n&#x200B;\n\n**So what do I do?**\n\nAh the big question, what do you do with this information. Well, you find uranium miners you like and buy shares or LEAPs (at least 1 year out though ideally 2). Why? Because this is a very simple play, the price of uranium will go up. That's not the question. The question is WHEN will the price go up. So you play the miners and wait because at some point we will see utilities rushing to secure supply and when that happens these miners are going to rocket with it. Now a couple of things to understand. Because this sector is so small it can rocket but those rockets go both ways. When money is flowing in stocks can jump quick. But, when money flows out when, oh I don't know, the entire stock market is selling off, money flows out quickly too. And that's exactly what happened to uranium over the last 7 weeks. It's been selling off hard. Add in the summer being a historically bad time for uranium and more selling won't be a shock at all. So you're probably saying why should you buy something that's selling off and could sell off more? Well here's why, because that's when it's cheap. Money is made in bear markets and realized in bull markets. You buy companies with a good long term outlook when they're down because that gives you the best chance to make money.  And right now uranium miners are down at a very cheap level. Now this doesn't mean throw every penny you have into it. Add over time, maybe do some cash secured puts, down cost average on dips. You've got all summer since uranium usually does poor until September or so. But now is a great time to position yourself in a sector looking good in the long run. Especially in a market where everything is being beat up. \n\n&#x200B;\n\n**Quick notes.**\n\nJust a quick addressing of some things I tend to hear asked. Throium reactors are a thing being worked on, but they aren't ready yet and won't be for years. Even when done they can't do a 100% uranium replacement overnight it'll take years. I like them but it's future tech. Fission is also being worked on but that's even further out future tech. It's been \"20 years away\" for 50 years now. Yes, storage of spent nuclear material is an issue but they have some storage methods, even if not ideal and more importantly when given the choice of where do I store this fuel after 500 years or blackouts, governments will choose to deal with the storage later and avoid the blackouts. Yes wind and solar exist. I like them. I think they're great. But as of today, they are energy that needs to exist with nuclear not replace it. The tech again just isn't there yet. Yes new companies can build a uranium mine and uranium isn't that rare. However, building a mine is a long and difficult process, especially to get permits. Most nations are very strict about allowing a company to mine uranium because of what it is. As such, you need to show not just you know how to mine it, you can do it safely and without impacting the environment. That can take near 10 years and often takes that long if not longer. So year, when prices spike new companies will pop up, but they'll be a decade or more out from actually mining anything and this assumes they can even find staff who know how to run a uranium mine, which is not easy to find and get permits.\n\nSo that's the gist of the uranium sector and why I feel it's a good place to park some money for the next few years. It's got a good future to it, it's not going anywhere and in fact, shows strong signs of growing and it's needed.\n\n&#x200B;\n\nTLDR: Uranium is a needed irreplaceable fuel source that currently sells for too little. Either the price is going to go up over the next few years or the lights will go out. If you think the lights will work when you walk into a room you think uranium will go up. That simple. \n\n&#x200B;\n\n**Positions:** Note, for any company listed as \"under market cap\" just message me and I'll tell you what it is. Sadly, like I said small sector so most companies I own I can't list within WSB rules. \n\n&#x200B;\n\nCCJ: 283 shares.\n\nBelow Market Cap Stock 1: 1,200 shares\n\nBelow Market Cap Stock 2: 1,800 shares, 10 2024 $1C's, 17 2024 $1.50C's\n\nBelow Market Cap Stock 3: 2,000 shares", "id": "vlhk7k", "created_utc": 1656286771.0, "score": 112, "upvote_ratio": 0.93, "num_comments": 59, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|1 year ago\n**Total Comments**|341|**Previous DD**|\n**Account Age**|7 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vlhk7k)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vlhk7k)", "score": 1, "replies": []}, {"body": "Now this is a solid DD! We need more of these on WSB. Thanks op.", "score": 34, "replies": []}, {"body": "I can’t imagine that uranium becomes cheaper with the threat of ww3 being much higher than ever before. Bullish af", "score": 14, "replies": [{"body": "I didn’t even get into the impacts a ban of Russian uranium can have because that’s a whole other post and a bit speculative.", "score": 10, "replies": [{"body": "Ummm it’s all speculative, that’s why we are here", "score": 5, "replies": [{"body": "I know but the Russian uranium ban is something that is both not needed and too hard to predict. I find it’s better to just treat it as not existing and if it happens one day then cool moon time. But I wouldn’t invest on it.", "score": 4, "replies": [{"body": "Only 5% of yearly uranium consumption worldwide is provided by Russian mining.", "score": 3, "replies": [{"body": "Yes but they do 20% of global enrichment. That’s where it gets tricky. It’s why UF6 prices have spiked recently. Also Kazakhstan who produce 40% of global uranium use St Petersburg as their shipping port. Again it gets complicated and very speculative.", "score": 9, "replies": [{"body": "Ok. More variables to consider. Your response makes sense", "score": 7, "replies": []}, {"body": "You da man Rad", "score": 1, "replies": []}]}]}]}]}, {"body": "Well not only this but who is looking to get rid of nuclear materials when you might need that stuff too. We get a ban on that and disruption in that space you’ll see the same thing oil did here", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "There's already a uranium investment sub r/Uraniumsqueeze", "score": 7, "replies": []}, {"body": "I’m not going anywhere bro.", "score": 9, "replies": [{"body": "But new splinter! Plus I really like the sound of reptards", "score": 2, "replies": [{"body": "That’s cause you’re a credentialed snake handler ![img](emote|t5_2th52|4271)", "score": 2, "replies": [{"body": "The markets keep doing this 2022 bullshit and I'll have to start getting real good at handling trouser snakes 😔", "score": 1, "replies": []}]}]}]}, {"body": "There is already a radtards sub but the creator is gone lol", "score": 2, "replies": []}]}, {"body": "Nice write up!\n\n$UUUU is the US player. Potential federal funds will go to US players first to encourage domestic strength. Just another to consider.", "score": 7, "replies": []}, {"body": "would be nice to have some sources for all those statements you did, I will assume it as a cool home work to verify all that info. I enjoyed reading this. thanks for sharing.", "score": 6, "replies": []}, {"body": "I’m balls deep in uranium", "score": 5, "replies": []}, {"body": "Great write up! This is the stuff I originally came here for years ago. I wish we had more of this type of DD.", "score": 3, "replies": []}, {"body": "What do you think of URA? I’ve had it on my watchlist for a while", "score": 2, "replies": [{"body": "I’d go with the other ETF myself (market cap so can’t name sorry). URA is only 70% uranium holding while the other one has 100% uranium exposure.", "score": 4, "replies": []}]}, {"body": "Already hold. 🥳🥳", "score": 2, "replies": []}, {"body": "Sprott School of Business Carleton University wut wut", "score": 2, "replies": []}, {"body": ">Fission is also being worked on but that's even further out future tech\n\nFission is what we have now, fusion is the future tech.", "score": 2, "replies": [{"body": "Yeah I always flip those for some reason.", "score": 3, "replies": []}]}, {"body": "Great DD. Kitco News on YouTube has a lot of these miners CEOs on for interviews and them + many investors (Rick Rule one) love uranium set up.\n\nAlso, with electrification of cars, energy demand from the grid will go up and put more pressure on making reliable electricity.", "score": 2, "replies": []}, {"body": "SMR for life. Nuclear will be far more tolerant without that big, scary cooling tower", "score": 2, "replies": []}, {"body": "Thank you for taking the time and effort, amazing", "score": 2, "replies": []}, {"body": "[deleted]", "score": -11, "replies": [{"body": "Nothing wrong with Geothermal. But I think anyone who presents it as \"This one energy source can do it for everywhere.\" is mistaken. The reality is places need a mixture of sources and nuclear is one.", "score": 16, "replies": []}, {"body": "how u getting energy from africa and iceland to you and how much the going to charge u", "score": 6, "replies": [{"body": "He clearly plans to move to Africa, but he's also clearly stupid so he's definitely going to move to one of the two largest deserts in Africa - the two with no actual geothermal potential", "score": 3, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "https://en.m.wikipedia.org/wiki/Cost_of_electricity_by_source\n\nGo to global data and look. Nuclear is not the most expensive not even close.", "score": 4, "replies": [{"body": "Desktop version of /u/Radthereptile's link: <https://en.wikipedia.org/wiki/Cost_of_electricity_by_source>\n\n --- \n\n ^([)[^(opt out)](https://reddit.com/message/compose?to=WikiMobileLinkBot&message=OptOut&subject=OptOut)^(]) ^(Beep Boop.  Downvote to delete)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "So the Wiki page last updated 14 days ago is out of date but your article from 2020 is good? Also, no the article doesn't say that. There's literally charts under  the global data section showing it's not the most expensive. It's not the cheapest, but it's also not the most expensive.", "score": 3, "replies": []}, {"body": "guess what you have to back up solar and wind with? gas peaking plants", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "true", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "if you are going to ask a question like that I am just going to say its bc you touch yourself at night", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "what do you think europe used last winter when “record levels of low wind” occurred? More wind?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Ok, what are the below market cap positions please? Thanks for the write up", "score": 1, "replies": []}, {"body": "thanks op for the great dd\n\nsmarter countries are going for standardized design for regulatory processes (like france)\n\nmodular options will also increase demand\n\nuranium has been on the radar for almost a decade, but things just move slowly in that industry\n\nhopefully faster now that energy and power prices are so high", "score": 1, "replies": []}, {"body": "A friend of mine started talking about Uranium ETFs 4 years ago, I've never listened to him\n\nsuch a wrong choice", "score": 1, "replies": []}, {"body": "Ok, I have some URA, is CCJ better?", "score": 1, "replies": [{"body": "Both are fine.", "score": 2, "replies": []}]}, {"body": "kuppy is the uranium queen", "score": 1, "replies": []}, {"body": "You son of a bitch I’m in !", "score": 1, "replies": []}, {"body": "I'll take those tickets please 🤠", "score": 1, "replies": []}, {"body": "Well Russia will eventually be blocked completely. I´m pretty sure of that. They are already partially.  \nWorlds Nuclear power plants only have 1-2 years of U308 supply left.   \nMines aren´t running yet, as stated.  \n400+ power plants in scope to be build world wide within 2030, if I recall.  \nSPROTT is holding alot of liquidity.  \nEU taxonomy just recoqnized nuclear as green power.\n\nThese are just some of the bullish bullets.", "score": 1, "replies": []}, {"body": "Great post, can you message me small market cap companies", "score": 1, "replies": []}, {"body": "Skyharbour resources is a good cheap undervalued stock. Check it out for yourself. Wallet investor meter went from bearish to bullish yesterday.", "score": 1, "replies": []}, {"body": "Im very interested in getting this list of uranium stocks. 2nd, im pretty sure we developed thorium reactors in the 70's and scraped it because we couldnt make weapons grade anything from thorium. Now china took our thorium designs and have been implementing them for a few years now. So ita not new tech, its old tech now being used.", "score": 1, "replies": [{"body": "Have a look at this guy's portfolio who some might consider one of the most knowledgeable people in the space. Also check his profile. [https://twitter.com/quakes99/status/1551991498039668736/photo/1](https://twitter.com/quakes99/status/1551991498039668736/photo/1)", "score": 2, "replies": [{"body": "Thanks, awesome link.", "score": 1, "replies": []}]}]}, {"body": "https://www.smallcapinvestor.ca/post/this-new-uranium-discovery-is-a-10-20-bagger-in-the-making", "score": 1, "replies": []}]}
