{"title": "[deleted by user]", "selftext": "[removed]", "id": "165b5kv", "created_utc": 1693392090.0, "score": 0, "upvote_ratio": 0.17, "num_comments": 17, "comments": [{"body": "Donate to some charity god will bless u", "score": 7, "replies": []}, {"body": "If you think it’s gonna happen in December, save some money by buying your put in late November. Also, I think your crazy.", "score": 7, "replies": []}, {"body": "If you want to throw away your money you can do that, yes.", "score": 11, "replies": []}, {"body": "People have been trading for the big crash for the last 15 years.  We've had ups and downs, but even if you bought at the high point in 2007 and had to endure the entire crash of 2008, you've now tripled your money.\n\nTrying to time the next crash is a losing proposition.", "score": 7, "replies": []}, {"body": "Can't trade for black swan events. I have a bearish bias on broad market indexes, and I would love a slow correction to SPY300. It will happen one day, but to trade as if that would be just around the corner is going to bleed a person dry.", "score": 3, "replies": []}, {"body": "If you want to just throw away money, you can send it to me instead or better yet donate it to charity. The 52-week low is just under $350, nowhere close to 300. An extremely bad day for SPY is a 3% drop; SPY will need to drop 33% from where it is now to hit 300.\n\nIf you insist, and you think it will happen in December, why buy now? You will just lose to theta decay. Wait until you're a bit closer to when you think it may happen, then buy your deep OTM contracts. Ideally you want them to go ITM to rake in the big gains, so somewhere between the current price and the target. Just don't expect to make any profit on this; it's a silly & ridiculous gamble IMO.\n\nEdit: oh yea and don't forget to post your loss p*rn on r/wallstreetbets!", "score": 3, "replies": []}, {"body": "Market events like Black Swan crashes are impossible to accurately predict as other posts indicate, so this is a low probability trade at best.\n\nAs a thought experiment and looking at the mechanics of how this might be traded would be to give a confidence level and timeframe for when this event might occur.  \n\nIf the confidence level is high then more capital might be put at risk.  A DITM long Put option can be purchased and which at the .80 or .90 Delta level would move around .80 to .90 for each $1 the ticker price dropped.  This could start to profit sooner and for a substantial dollar return based on how big the drop and when it was closed.   If the confident level is lower then buying an OTM Put would allow you to participate with less capital, but with less total dollar return.  \n\nThe timeframe is the other aspect as it will help determine when to open the long Put.  \n\nAs there is no empirical data to analyze, and no way to tell the future, this is more a gamble than a good options trade.", "score": 2, "replies": []}, {"body": " if you can’t calculate the chance and scale profitability v cost of an option, how in THAFUQ do you feel qualified to predict a market crash?", "score": 2, "replies": []}, {"body": "You already answered your own question. It’s the 350 spy put for end of December. \n\nYou’re going to lose all of your money here. They’re not going to capitulate and waste a profitable year on the books. If there’s a big dump coming, it needs a big catalyst for it.", "score": 2, "replies": []}, {"body": "2025 or 2026 is mt bet", "score": 0, "replies": []}, {"body": "I also believe there will be a large correction in Q4-23 or Q1-24, but it'll be real hard to do well with 200$, I think your best bet is doing the opposite of a LEAPS, buy a deep ITM put for January 19th, but with that kind of money needed, id rather just sit on the sidelines and buy the dip", "score": 1, "replies": []}, {"body": "Can you explain why this is going to happen? And why in December?", "score": 1, "replies": [{"body": "It will happen! I don’t know about 300 and I don’t know about December but there will be a good correction soon. Unwinding of money supply. Rates at 6%. I find it very hard to believe we are at all time highs right now. GDP and ADP are poor today and the market rallies. You can’t be buying this multiple and thinking you can make decent returns on it.", "score": 1, "replies": []}]}, {"body": "the big short was all about a crash that people saw coming but didn't know when and we're confused by why it didn't happen yet. they go concerned they were wrong and some started to look to give up.... but held out. that was with massive funds and big jewels.\n\nIf you feel that it will crash... 3 things.\n\n1. I'm happy to sell puts to you on things I am comfortable owning at a particular price.\n\n2. be prepared to have serious stop losses protection in play\n\n3. review you data and make sure you are sure about what you are thinking. markets are volitale. even by little bits every day. some days more than others. you need to be sure of that direction or don't do it.", "score": 1, "replies": []}, {"body": "You do realize how much liquidity is sloshing around thanks to QE post 2008 then continued printing during covid. \n\nThe only thing that could get SPY to 300 is a nuclear bomb, an actual fatal virus pandemic (Covid won’t have same punch as march 2020), or Marshall Law going live.  \n\nYou’re better off putting any black-swan hedge money into a high yield savings or donating it to charity of choice as someone else mentioned. \n\nGood luck.", "score": 1, "replies": []}, {"body": "If you think it’s December the play would be to buy a Nov/Dec put spread. The Dec 350 put alone is trading $1.00. You can buy the Nov/Dec 400 put spread for $1.00. If you think the move will happen in Dec, then the Nov put will go to zero and you now own the 400 put for $1 instead of the 350 put.", "score": 1, "replies": []}]}
{"title": "Options on inverse leveraged instruments", "selftext": "I feel like I'm missing something. In the event of a sudden market correction in which volatility feeds on itself, instruments such as VIX, FAZ, TZA, UVXY, etc. trade at exponentially higher prices. For example, UVXY traded above $11000 for three 4H candles on the 18th and 19th of March, 2020. It currently trades at $15. \n\n\nIf one were to purchase calls on this product, would there be bids in the orderbook to buy them back at such high prices in the event of a similar correction? Is this a viable hedging strategy, or does the \"fed put\" on volatility result in this strategy hemorrhaging money?", "id": "165m99g", "created_utc": 1693419313.0, "score": 4, "upvote_ratio": 0.83, "num_comments": 12, "comments": [{"body": ">For example, UVXY traded above $11000 for three 4H candles on the 18th and 19th of March, 2020.\n\nNo, it didn't.  You are looking at a split-adjusted chart.  It has reverse split 1 for 10 twice since then.  11000 on the chart means it actually traded in the \\~110 range.\n\nThere will always be a bid on any ITM option.", "score": 11, "replies": [{"body": "Why the downvote? No cake for you.", "score": 2, "replies": []}, {"body": ">11000 on the chart means it actually traded in the \\~110 range\n\nAnd the price today would be around $0.15, the then/now price ratio would be the same and OP's point would be preserved.\n\n&#x200B;\n\n>There will always be a bid on any ITM option.\n\nWe should never assume that under abnormal market conditions everything will run smoothly.", "score": 2, "replies": [{"body": ">And the price today would be around $0.15, the then/now price ratio would be the same and OP's point would be preserved.\n\nNo, it wouldn't.  OP is comparing the split-adjusted (i.e., non-actual) price of \\~11000, to today's *actual* price of \\~15, assuming \\~15 is the \"baseline\" price and it was temporarily elevated to around 11000.  But it wasn't.  The split-adjusted \"baseline\" price in early 2020 was in the 1000 to 3000 range.", "score": 1, "replies": []}]}, {"body": "Thanks for pointing that out\n\n\nHappy cakeday!", "score": 1, "replies": []}]}, {"body": "When you think there is an opportunity that seems too good to be true, it's probably priced into the options. IDK about this specific case, but keep that in mind.", "score": 3, "replies": [{"body": "True. The most obvious here being the unlikelihood and rarity of a crash", "score": 1, "replies": [{"body": "Since the VIX rarely spikes like this, but when it does it tends to do so especially fast with high volatility, VIX options or options on any instrument such as UVXY that is based on VIX futures will have this priced in. It's priced in by the farther OTM calls having higher IV and the farther ITM calls having lower IV. The VIX is based on the IV of SPX options and you can see how this is a similar trend in SPX options by the fact that SPX puts have higher IV than calls, and the farther OTM they are the more IV. In general this whole concept is the market pricing in the fact that when SPX goes down it does so with more volatility than when it goes up. You could achieve what you're looking for more efficiently by simply buying OTM SPX puts but any way you do it that has significant upside potential during a market crash will bleed money as the market goes up or even stays flat over time.", "score": 2, "replies": []}]}]}, {"body": "It's priced into the options. Also keep in mind the VIX is a statistic derived from SPX options, it doesn't matter what happens in the VIX option chain. That has no influence on the price. It's not like a heavily shorted stock where short covering behavior would force buys which then drive the price higher.", "score": 1, "replies": []}, {"body": "Some of these have had a reverse split, so it’s hard to lol at past prices.\nI stick to SQQQ myself … & i pretty much always have a TQQQ put leap.", "score": 1, "replies": []}, {"body": "UVXY is in a constant state of decay. I buy PUTS on Thursday or Friday for the following week.  Only if there is a spike in this week.", "score": 1, "replies": []}, {"body": "UVXY is so low because of its [leverage decay](https://www.etf.com/etf-education-center/etf-basics/why-do-leveraged-etfs-decay). Compare to VIXY.", "score": 1, "replies": []}]}
