{"title": "Nvidia makes an estimated 10X cost on every H100", "selftext": "That's a very health 90% in gross margin terms.\n\n[https://twitter.com/firstadopter/status/1691877797487165443?s=20](https://twitter.com/firstadopter/status/1691877797487165443?s=20)\n\n&#x200B;", "id": "15u25af", "created_utc": 1692311813.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 21, "comments": [{"body": "If it's true. So far its just some rando's tweet claiming that this is some bank's estimation.", "score": 1, "replies": [{"body": ">If it's true. So far its just some rando's tweet claiming that this is some bank's estimation.\n\na) Tae Kim (tweeter) is a business reporter at Barrons who covers the high tech space\n\nb) he was quoting from a Raymond James semiconductor analyst note.  Most folks who invest in stocks know who Raymond James is.\n\nSo I guess that points back to you as just another rando opinion on the internet commenting on something you may not know too much about.  But thanks for offering your view.", "score": 0, "replies": [{"body": "You stated it as a fact, while Raymond James reported is as an estimation.", "score": 1, "replies": [{"body": ">You stated it as a fact\n\nCan't read too well can you?  lol   4th word in the headline. duh", "score": 1, "replies": [{"body": "Mic drop", "score": 2, "replies": []}]}]}, {"body": "How does the RJ analyst know?  What are his claims as to how ascertained?\n\nCan tell you, NVDA doesn't share this information with the public.", "score": 1, "replies": [{"body": "I don't have direct knowledge to support the claim.  But having followed these type of guys for years and reading some of the research notes I have access to they have industry contacts:  Competitors, up and down stream suppliers, customers, other analysts, resellers, tangential relationships.  At times you see similar reports called \"channel checks\" which is a level of data about sell-thru or lack thereof.  They're just doing what they do, trying to create some value for those who pay them for early access to information.\n\nI no longer work in the semiconductor industry but did for decades.  His numbers probably aren't dead on.   No body asked, but in my opinion they are within a viable area.     Even if one added or subtracted a thousand or two, the profit and margin numbers don't change much.", "score": 3, "replies": []}]}]}]}, {"body": "I told you this like 2 months ago.", "score": 1, "replies": [{"body": "Show the numbers you shared.", "score": 1, "replies": [{"body": "https://www.reddit.com/r/NVDA_Stock/comments/13uu0jn/bullish_on_jensen_gives_steve_jobs_vibes_and/jmwi7p0/", "score": 3, "replies": [{"body": "credit for your memory, but the \"probably\" disclaimer sullied it.\n\nBesides, it's not new information and wasn't new 2 months ago.  I've got old investor presentations talking about high 80s GMs in some of the DC product line.  All this post was doing was pointing at a recent analyst note confirming that.  It's known data to those who understand their business.  But it may be to most new investors, and I that's why I posted it.", "score": 2, "replies": [{"body": "Fair enough, it seemed to me like you were underrating nvidia GMs but maybe I misunderstood.", "score": 1, "replies": [{"body": "I expect them to report close to 70% GMs this Q for the entire business - which is pretty much unheard of outside software companies.", "score": 1, "replies": [{"body": "Yeah that would be great.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Not news, known info", "score": 0, "replies": []}, {"body": "And they are now also renting out their DGX chips on the cloud themselves   \n[https://www.nvidia.com/en-us/data-center/dgx-cloud/?ncid=pa-srch-goog-406223#cid=dl34\\_pa-srch-goog\\_en-us](https://www.nvidia.com/en-us/data-center/dgx-cloud/?ncid=pa-srch-goog-406223#cid=dl34_pa-srch-goog_en-us)  \n\n\nWhich means they bypass the major cloud companies = more $$$   \nAnd,  \nEach H100 requires the buyer to buy a software package that is good for 5 years (its originally included in the price, after that they need to pay a yearly software fee. So after a few years the software license fee alone will make up for the manufacturing costs.", "score": 1, "replies": [{"body": ">Each H100 requires the buyer to buy a software package that is good for 5 years (its originally included in the price, after that they need to pay a yearly software fee. So after a few years the software license fee alone will make up for the manufacturing costs.\n\nIsn't that limited to DXG only?  (Just clarifying that not all H100s require license)\n\nBut to your point, yes, a money printing machine they are.", "score": 1, "replies": [{"body": "I read yesterday that it's for A100 and H100 and DGX but I can't find it now.", "score": 2, "replies": [{"body": "Pretty sure it's just the DGX systems, and yes, there are both A100 and H100 versions.   This is like the package you buy when you want everything certified and guaranteed to run and 24/7/365 support from Nvidia.   Not DIY, if that system has an issue, tech support staff actually answers the phone.", "score": 2, "replies": [{"body": "You can still probably use it but won’t get the driver updates.", "score": 3, "replies": []}]}]}]}, {"body": "I bet a lot of those H100s will get replaced with the next gen hardware before that 5 years is up though.", "score": 1, "replies": []}]}]}
{"title": "Disney or PayPal leaps call options 2025", "selftext": "[removed]", "id": "15tlrx4", "created_utc": 1692274562.0, "score": 3, "upvote_ratio": 0.62, "num_comments": 15, "comments": [{"body": "**Removed for RULE: No low effort posts. For positions or strategies, provide details.**\n\nThere is not enough detail to have a conversation about options.\n\n**This is the level of detail expected for an options conversation.**     \n- Example: /r/options/wiki/faq/pages/trade_details  \n- trading strategy and why you have it,  \n- why the underlying was chosen,  \n- the position rationale and trade details (ticker, call/put, long/short, strikes, expiration, cost, date)  \n- underlying price before (and after) the trade  \n- intended gain & maximum loss exit thresholds  \n- the dates / times of entry and exit  \n- images fail to state your point of view", "score": 1, "replies": []}, {"body": "I think there is a tad more short term weakness ahead for DIS but overall a fairly solid looking play going out to 2025. Nothing wrong with a bull call spread at this point though.", "score": 6, "replies": [{"body": "Yes I agree that’s why I’m a bit hesitant to pull the trigger. I think we have one more leg down and I believe we’ll see a sell off in the overall market that will bring Disney down", "score": 2, "replies": [{"body": "Definitely plausible. I think around $84-$85 has been solid support for Disney, so anything below that should be good to go. Bull call spread with breakeven around $70 or so sounds like a great play.", "score": 1, "replies": []}, {"body": "I'd wait, looks like more negative press inbound for the antics of this actress in the new snow white movie. Probably going to last a month or two while shares continue to fall. But if that writers strike gets cleared up there could be a small lift. Anyways in the same boat waiting for the right entry on dis.", "score": 1, "replies": []}]}, {"body": "Glad to hear you also think so. I just bought Puts…lol", "score": 1, "replies": []}]}, {"body": "Disney. PayPal has an identity crisis and is losing the war against its competitors. Only a strategic acquisition can save PayPal and that means spending more money.", "score": 2, "replies": [{"body": "Definitely favor Disney more in this situation.", "score": 1, "replies": []}]}, {"body": "Why Paypal? They are a garbage company who is outclassed by their non public competitor.\n\n\nPaypal is one of the worst providers from a merchant viewpoint, higher rates than Stripe and higher per transaction fee than Stripe....who in their right mind would use paypal as a merchant over Stripe?\n\n\nSeriously, Paypal isn't even the top 2 in an overbloated industry and the margins will only get worst for me as competition ramps up and as they need to lower their fees to compete with Stripe.\n\n\nDIS i dont feel great about either, their parks will thrive but D+ will bleed subscribers and I don't think any of their movies outside of Avengers will do all that well in comparison to DIS 5+ years ago.", "score": 1, "replies": []}, {"body": "Neither. PayPal has a hard road ahead. Disney will most likely be okay in the long run but I wouldn't enter right now.", "score": 1, "replies": []}, {"body": "I am in the same mindset as well . It is getting attractive i think a lot of big money will flow into it soon.", "score": 1, "replies": []}, {"body": "Disney. Initiate at $85", "score": 1, "replies": []}, {"body": "DIS 100%. The mouse will never die but PayPal has steep competition and very unclear they come out on too long run", "score": 1, "replies": []}, {"body": "I have multiple LEAPS for both into 2025", "score": 1, "replies": []}, {"body": "Here is a guide to effective and productive options pist as:  \n\nhttps://www.reddit.com/r/options/wiki/faq/pages/trade_details", "score": 1, "replies": []}]}
{"title": "This options profit calculator is a real eye-opener", "selftext": "[deleted]", "id": "15u1vhh", "created_utc": 1692311176.0, "score": 15, "upvote_ratio": 0.79, "num_comments": 13, "comments": [{"body": "Here's another way to visualize this AAPL call's P&L at expiration.\n\n[https://imgur.com/a/a8srlhu](https://imgur.com/a/a8srlhu)\n\nIf you spend $26 on an (edit: at the money) call, the stock will need to move upward by $26 in order for you to break even (edit: at expiration).\n\nYou can see the effect of theta both in your matrix and in the chart I linked at-the-money. At $170, bi-weekly theta starts at -2% and ends at -14%. Theta is most dramatic at the money; when your option is $26 in the money, delta is the primary driver of option price changes and not volatility (and thus ~~theta~~ time value).", "score": 5, "replies": []}, {"body": "Your link is an extremely common, annoying mistake: it's to the blank long call form.  To share an actual position you've created in OPC, you need to use the \"Get short-link to share\" link.\n\nIn terms of the chart, I wonder if you really understand what you're looking at.  According to it, AAPL only needs to go up to 175 by 8/26 to turn a profit.", "score": 7, "replies": [{"body": "I think they're only looking at price at expiration", "score": 3, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}, {"body": "trading NVDA, TSLA, and NFLX are much better than AAPL / MSFT / AMZN / GOOGL - just more volatility in em.", "score": 3, "replies": []}, {"body": "It's not a bad profit calculator, especially since its free and requires no account from a broker. But, if you really want to see a cool options analyzer, try Etrade's option analyzer. After you pick the option strategy you want to use along with the strikes, you can scroll along the x-axis (stock price) and it'll show how the expected profit or loss from your trade at expiration and at a date that you can choose before expiration.", "score": 1, "replies": []}, {"body": "Profitability on an option that expensive is going to have to move at least as much as the option costs if you're buying atm. Keep that in mind.", "score": 1, "replies": []}, {"body": "OP name checks out", "score": 1, "replies": []}, {"body": "Don’t hold until expiration", "score": -1, "replies": []}, {"body": "now try it combined with selling a $200 strike option for the same expiration", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "I'm suggesting you compare the long call to a \"debit spread\" that uses the same long call but adds a short call at a higher strike price.", "score": 2, "replies": []}]}]}, {"body": "I mean its appl there are certain expectations", "score": 1, "replies": []}, {"body": "You're plotting the wrong thing. Plot one row (ATM) in this table in a graph to see your theoretical theta decay should the price stay constant.", "score": 1, "replies": []}, {"body": "Bruh, I studied the hell out of this before trading my first paper option", "score": 1, "replies": []}]}
{"title": "Best options to sell expiring 36 days from now", "selftext": "\n## Expensive Calls\n\nThese call options offer the highest ratio of bullish premium paid (IV) relative to historical volatility (HV). These options are priced expecting the underlying to move up significantly more than it has moved up in the past. Sell these calls.\n\n| Stock/C/P | Direction | Put $ | Call $ | Put Premium | Call Premium | E.R. | Beta | Efficiency |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n| VXX/27/23 | 1.47 | $1.42 | $1.98 | 1.4 | 1.62 | 0.0 | -2.14 | 93.6 | \n| BURL/185/160 | -0.51 | $5.85 | $6.55 | 1.67 | 1.58 | 7.0 | 1.31 | 85.4 | \n| ORCL/122/110 | -0.51 | $2.67 | $3.15 | 1.65 | 1.56 | 29.0 | 0.9 | 91.6 | \n| ROST/122/109 | -1.01 | $1.83 | $2.0 | 1.67 | 1.52 | 0.5 | 1.12 | 72.0 | \n| FIVE/205/180 | -0.88 | $4.05 | $5.95 | 1.49 | 1.38 | 18.0 | 1.49 | 82.9 | \n| TOL/85/76 | -0.72 | $1.9 | $2.05 | 1.48 | 1.36 | 5.0 | 1.23 | 74.8 | \n| ZM/69/62 | -0.36 | $2.86 | $3.32 | 1.38 | 1.33 | 4.0 | 1.79 | 86.2 | \n| BBWI/39/35 | -0.08 | $1.23 | $1.65 | 1.3 | 1.3 | 6.0 | 1.53 | 87.8 | \n| WSM/139/125 | 0.14 | $3.7 | $4.6 | 1.28 | 1.28 | 6.0 | 1.44 | 83.2 | \n| ULTA/485/435 | -0.47 | $10.55 | $10.4 | 1.3 | 1.27 | 7.0 | 1.04 | 87.1 | \n\n## Expensive Puts\n\nThese put options offer the highest ratio of bearish premium paid (IV) relative to historical volatility (HV). These options are priced expecting the underlying to move down significantly more than it has moved down in the past. Sell these puts.\n\n| Stock/C/P | Direction | Put $ | Call $ | Put Premium | Call Premium | E.R. | Beta | Efficiency |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n| BURL/185/160 | -0.51 | $5.85 | $6.55 | 1.67 | 1.58 | 7.0 | 1.31 | 85.4 | \n| ROST/122/109 | -1.01 | $1.83 | $2.0 | 1.67 | 1.52 | 0.5 | 1.12 | 72.0 | \n| ORCL/122/110 | -0.51 | $2.67 | $3.15 | 1.65 | 1.56 | 29.0 | 0.9 | 91.6 | \n| FIVE/205/180 | -0.88 | $4.05 | $5.95 | 1.49 | 1.38 | 18.0 | 1.49 | 82.9 | \n| TOL/85/76 | -0.72 | $1.9 | $2.05 | 1.48 | 1.36 | 5.0 | 1.23 | 74.8 | \n| WMT/170/150 | -2.29 | $0.64 | $0.59 | 1.42 | 1.14 | 0.5 | 0.45 | 84.3 | \n| DKS/157/140 | -2.8 | $4.5 | $3.42 | 1.42 | 1.08 | 5.0 | 1.44 | 72.8 | \n| VXX/27/23 | 1.47 | $1.42 | $1.98 | 1.4 | 1.62 | 0.0 | -2.14 | 93.6 | \n| ZM/69/62 | -0.36 | $2.86 | $3.32 | 1.38 | 1.33 | 4.0 | 1.79 | 86.2 | \n| DLTR/155/137 | -4.37 | $3.38 | $2.83 | 1.38 | 1.2 | 7.0 | 0.82 | 85.0 | \n\n## Highest Premium\n\nThese options offer the highest ratio of implied volatility (IV) relative to historical volatility (HV). These options are priced to move significantly more than they have moved in the past. Sell iron condors on these as they may be over priced.\n\n| Stock/C/P | Direction | Put $ | Call $ | Put Premium | Call Premium | E.R. | Beta | Efficiency |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n| BURL/185/160 | -0.51 | $5.85 | $6.55 | 1.67 | 1.58 | 7.0 | 1.31 | 85.4 | \n| ORCL/122/110 | -0.51 | $2.67 | $3.15 | 1.65 | 1.56 | 29.0 | 0.9 | 91.6 | \n| ROST/122/109 | -1.01 | $1.83 | $2.0 | 1.67 | 1.52 | 0.5 | 1.12 | 72.0 | \n| VXX/27/23 | 1.47 | $1.42 | $1.98 | 1.4 | 1.62 | 0.0 | -2.14 | 93.6 | \n| FIVE/205/180 | -0.88 | $4.05 | $5.95 | 1.49 | 1.38 | 18.0 | 1.49 | 82.9 | \n| TOL/85/76 | -0.72 | $1.9 | $2.05 | 1.48 | 1.36 | 5.0 | 1.23 | 74.8 | \n| ZM/69/62 | -0.36 | $2.86 | $3.32 | 1.38 | 1.33 | 4.0 | 1.79 | 86.2 | \n| AVGO/880/790 | -0.77 | $22.4 | $24.35 | 1.36 | 1.27 | 14.0 | 1.27 | 92.1 | \n| BBWI/39/35 | -0.08 | $1.23 | $1.65 | 1.3 | 1.3 | 6.0 | 1.53 | 87.8 | \n| DLTR/155/137 | -4.37 | $3.38 | $2.83 | 1.38 | 1.2 | 7.0 | 0.82 | 85.0 | \n\n\n- **Historical Move v Implied Move:** We determine the historical volatility (log variance of daily gains) of the underlying asset and compare that to the current implied volatitlity (IV) of the option price. This is used to determine the Call or Put Premium associated with the pricing of options (implied volatility).\n    \n- **Directional Bias:** Ranges from -100 (bearish) to +100 (bullish) and accounts for RSI, price trend, moving averages, and put/call skew over the past 6 weeks.\n\n- **Priced Move:** given the current option prices, how much in dollar amounts will the underlying have to move to make the call/put break even. This is how much vol the option is pricing in. The expected move.\n\n- **Expiration:** 2023-09-22.\n\n- **Call/Put Premium:** How much extra you are paying for the implied move relative to the historic move. Low numbers mean options are \"cheaper.\" High numbers mean options are \"expensive.\"\n\n- **Efficiency:** This factor represents the bid/ask spreads and the depth of the order book relative to the price of the option. It represents how much traders will pay in slippage with a round trip trade. Lower numbers are less efficient than higher numbers.\n\n- **E.R.:** Days unitl the next Earnings Release. This feature is still in beta as we work on a more complete list of earnings dates.\n\n- **Why isn't my stock on this list?** It doesn't have \"weeklies\", the underlying is \"too cheap\", or the options markets are too illiquid (open interest) to qualify for this strategy. 480 underlyings are used in this report and only the top results end up passing the criteria for each filter.", "id": "15tomc7", "created_utc": 1692281145.0, "score": 29, "upvote_ratio": 0.89, "num_comments": 15, "comments": [{"body": "Cool stuff...  \n\nJust grabbed a few random ones though and the spread sucks. The BURL 160 P spread is at 20%. Quick check of other strikes are the same. At a 20% difference between bid and ask you are risking a lot of slippage and not filling where you want. Especially when trying to close.\n\nComparing the 22DTE (since thats when the monthly sellers are going to close) The spread is a bit more favorable at around 10%.\n\nThe 160P though is still $4.50 or so, so you won't have collected all that great premium in the two weeks. These plays would be much better as weeklies as its premium is $3.50 ! (compared to the $1 or so you get from holding the monthly for 2 weeks).", "score": 10, "replies": [{"body": "All valid points... I actually put that BURL trade on. Yes the spread is terrible but I use the \"efficiency\" column to showcase that to traders in advance. It combines spread, volume, OI etc and tries to net out how efficient it is to trade.   \n\n\nPersonally, I am expecting the trade to expire worthless so I don't count that second trade to close it, but I know many traders do manage/close at 21 days etc   \n\n\nYou could always just use this as a guide/ideas and then convert the ideas to weeklies. I also post a 5DTE report, but not to thetagang   \n\n\nThanks for the feedback and you are 100% correct", "score": 6, "replies": [{"body": "Thank you! \nWhere can I see 5dte? Thanx again.", "score": 1, "replies": [{"body": "Gotta kinda look for it but it’s close by here on Reddit. Wish I could be more specific", "score": 0, "replies": []}]}, {"body": "Right on.\n\nInteresting point about expire to close. I would as well but that doesn't seem to be the common idea on theta gang at least.", "score": 1, "replies": [{"body": "Say you give up 3 percent opening and 3 percent closing. Plus another x percent for fees on both trades \n\nAnd your average winner is 20 percent and average loser is 15 percent. \n\nThen realize you give away 6 percent on winners and your losers just to trade it.\n\nAvoiding that second trade, or say the 3 percent, is the easiest win to improve gains. \n\nRough example but you get the picture", "score": 1, "replies": []}]}]}]}, {"body": "VERY NICE", "score": 3, "replies": [{"body": "Thats brother! Glad you found it valuable", "score": 2, "replies": []}]}, {"body": "thanks for this!!", "score": 2, "replies": [{"body": "Np more coming tomorrow", "score": 2, "replies": []}]}, {"body": "Do you mind sharing the scripts you use to generate this? Wanna play around with the variables to generate a custom list.", "score": 2, "replies": [{"body": "I built this already. Many variables, custom output.\nEven with the scripts you need the real time reliable data source.", "score": 2, "replies": [{"body": "Yes, I gather - would you mind sharing the scripts anyway? I can engineer my way through them. If you don't wanna share your script, do you mind briefly describing your workflow and data sources? I'd appreciate it!\n\nOn a related note, have you automated your trades to diversify your portolio as well? Or do you manually pick stocks from this list? How have they performed?", "score": 1, "replies": []}]}]}, {"body": "Great info", "score": 1, "replies": [{"body": "Gracias", "score": 1, "replies": []}]}]}
