{"title": "[deleted by user]", "selftext": "[removed]", "id": "q9465r", "created_utc": 1634355758.0, "score": 96, "upvote_ratio": 0.91, "num_comments": 68, "comments": [{"body": "More like wage correction, a long overdue correction.", "score": 143, "replies": [{"body": "They are so used to wages not going up they are surprised.", "score": 72, "replies": [{"body": "No, they are use to wages going up, just not *ours*.", "score": 70, "replies": []}]}, {"body": "It better be transitory! /s", "score": 1, "replies": []}]}, {"body": "The CEO wage is the one that s been over inflated.", "score": 181, "replies": [{"body": "Inflate this", "score": 8, "replies": [{"body": "--!--\n\nHow's that for inflated for a CEO?", "score": 4, "replies": []}, {"body": "Inflate deez", "score": 2, "replies": []}]}]}, {"body": "“Wage inflation” \nGotta tie that spooky inflation word to wage increases", "score": 98, "replies": [{"body": "In the same article that literally points out a supply and demand issue with labor itself.", "score": 7, "replies": [{"body": "Yea we’re at 2016 levels of unemployment and no one ever mentions that 6 million baby boomers retired for good between October 2020 and March 2021 helping fuel the labor shortage", "score": 10, "replies": [{"body": "And the hundreds of thousands of excess deaths due to the pandemic. Obviously older (not working) people are more likely to die but plenty of working people have died too.", "score": 5, "replies": []}]}]}]}, {"body": "They can call it whatever they want.  The companies that choose to continue to disrespect the front line employees are the companies that will be shutting down.", "score": 71, "replies": []}, {"body": "A little wage push sounds okay.", "score": 25, "replies": []}, {"body": "Wages for his position have been inflating exponentially since Reagan.\n\nWhy is he complaining about it now?\n\nOh.\n\nI see.", "score": 33, "replies": []}, {"body": "What people don’t realize is unlike lumber or commodities. Wages will never come back down. Inflation is here to stay.", "score": 47, "replies": [{"body": "Inflation is the movement, not the higher price level. If inflation is here to stay, prices will keep rising.\n\nDo you mean inflation is here to stay, or do you mean, elevated prices caused by recent inflation are here to stay?", "score": 16, "replies": [{"body": "Yes", "score": -2, "replies": []}]}, {"body": "It doesn't actually work that way. This is something that people with an agenda repeat on CNBC. In reality, wages in industries go down all of the time as supply and demand flex just like any other industry. Attrition and RIFs become the mechanism for relative gradual reduction in wage buying power when there's an increase in labor supply (which eventually will happen once the demand spike subsides).", "score": 3, "replies": [{"body": "So you’re telling me grocery stores and fast food chains are going to lower wages in the future? 0 chance. I walked by a Target the other day in Colorado starting salary at $17. 7 years ago Target was starting at $8.50. Thats almost a 10% pay increase a year with majority of that happening this year. Once minimum wage jobs set that as the new floor there’s no going back.", "score": 0, "replies": [{"body": "I'm saying that the labor market operates like any other market and flexes with supply and demand and that the established mechanism for that, which has proven out in multiple industries over the years that have seen heavy demand periods contract, is through attrition and market labor acquisition over time. \n\nI'm also saying that you can't take a 10 year period where unemployment consistently contracted and compare it to a short term period of high demand. That prices didn't decline in a 10 year booming market isn't really unsurprising, nor does it say anything about pricing (real or hard) during high volatility periods with short term demand spikes.", "score": 2, "replies": []}]}]}]}, {"body": "Employees forced their hand this time around. Fuck those corporate pigs", "score": 7, "replies": []}, {"body": "They committed a whole ten sentences to this subject matter.", "score": 7, "replies": []}, {"body": "Shoot.  When my boss reads this they’re going to refuse to give me a raise to help fight inflation.", "score": 8, "replies": []}, {"body": "I own a restaurant in Montréal. Just to give you some insight on product inflation. \n20 pound bag of frozen French fries was 18 \nNow it’s 24 \nTwo gallon of Canola oil was 19 and now 28\nChicken wings and beef are up 20% as well. \nSo this will be passed on and labor cost will increase. \nEventually if people don’t want to pay 12.50 for a burger fry and coke they will stop coming and we will reduce some staff or renegotiate rent.", "score": 5, "replies": [{"body": "Shit I’m used to paying $18+ for a decent burger so that’s a steal", "score": 1, "replies": []}, {"body": "Yeah, $12 is a steal. A nice burger meal in Seattle is $20+ at an upscale fast casual.", "score": 1, "replies": []}]}, {"body": "how much higher are we talking about? heaven forbid the average retard can get an afford the order of tendies a day when mcdonalds raises prices.", "score": 4, "replies": [{"body": "I work in IT, I'm getting recruiters offering my same position now for 20% more base salary", "score": 3, "replies": [{"body": "wow, that's quite a jump. I had a friend who signed up for work early, and new hires a year down started off with a higher salary than he had at the time. Hopefully your salary's at least matching theirs, if not higher.", "score": 1, "replies": [{"body": "Yep, that happened to me too, but a few years before Covid happened", "score": 2, "replies": []}, {"body": "Yes, I’m in IT as well and I get recruiters calling nonstop. Some are still lowballing (like they always do), but I’ve had some offer 15% increases from my current rate. They send emails saying Urgent in the subject line all the time.", "score": 1, "replies": []}]}]}]}, {"body": "I'll care when wages overtake rise in productivity", "score": 6, "replies": []}, {"body": "everything  is transitory, if you wait long enough.", "score": 5, "replies": []}, {"body": "Oh what a terrible thing...the workers and builders of the nation getting increased wages.", "score": 7, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 week ago\n**Total Comments**|1|**Previous DD**|\n**Account Age**|2 weeks|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=q9465r)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=q9465r)", "score": 2, "replies": []}, {"body": "Literally fuck Solomon. Obfuscating wage growth and calling it “inflation”, and encouraging GS’s younger workers to return back into the office (with, of course, an exception for exceptionally high-performing workers, who are granted increased flexibility). Talk about distrusting and treating your employees like fucking bank robots.", "score": 5, "replies": []}, {"body": "And you get a raise . . .", "score": 3, "replies": []}, {"body": "Young employees: get your ass back in this empty building we own. High performers: We know your ass is leaving us for a better gig and remote work if we try and get you back in the office.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I think goldmans security would stop me if i tried...", "score": 3, "replies": []}]}]}, {"body": "This is just…terrible?", "score": 3, "replies": []}, {"body": "Parasites run society.", "score": 4, "replies": [{"body": "How do we remove the parasites?", "score": 2, "replies": [{"body": "Let's start with just recognizing the issue.", "score": 1, "replies": []}]}]}, {"body": "Oh no.\n\nWage inflation is more contagious than COV-2.", "score": 2, "replies": []}, {"body": "Well now your hamburger will cost $10. You want fries and a drink? $15. It’s all relative.", "score": 2, "replies": [{"body": "Are you not willing to pay an extra 5% on your disgusting fastfood if it means the people making it can actually afford food and healthcare?", "score": 3, "replies": [{"body": "Nope. Because it’s never ending.", "score": -3, "replies": []}]}]}, {"body": "Nothing compared to rent inflation", "score": 1, "replies": []}, {"body": "Well if wage/salary goes up by 10% then rent, home prices, mortgages go up by 50%. A house in my area went from $100000 about 20 years ago to $900000-$1.8 million, pop about the same, amenities, schools, libraries etc all are same but now the house is worth 18x as much and the salary for a white collar worker may have moved from $30000 to at the max $60000 at the higher end. Artificial scarcity bla bla bla, but young people looking to start a life can fck off, no mercy.", "score": 1, "replies": []}, {"body": "Before \"wage\" inflation becomes a thing, it is just inflation. Inflation affects all prices, which wage is also just a price. You can put anything that has a price in front of inflation. Food, real estate, cars, rent, toilet paper, etc. All this inflation comes from the fed and the gov. No one else.", "score": 0, "replies": [{"body": "Much like me you were down voted because apparently most people here don’t understand how inflation works. Congratulations everyone, you are being paid more, and ultimately making less.", "score": 1, "replies": []}]}, {"body": "Just remember kids, if price inflation moves up at a higher rate than your wages, you will have less overall wealth. Higher wages are great, but what’s causing them right now is not your friend, it’s not making you more wealthy, and it’s not a good thing.", "score": -2, "replies": [{"body": "High prices aren't causing wage inflation, high demand for goods and services creating a 10 million job deficit when there was only a 1 million person gap in the participation rate from the start of the pandemic (adjusted for baby boomer retirements at the standard rate) is.", "score": 2, "replies": [{"body": "The pandemic didn’t cause this, the governments response to the pandemic did. And regardless of how you feel about it, these wage increases are largely brought about artificially as is the inflation. Presently the inflation is out pacing the wage increases. Feel free to cheer all you want, but the governments meddling has yet again made a huge mess and while you are so dickjolly about the wage increase you are ultimately being robbed by the overall inflation because prices of goods and services are inflating faster than the wages.", "score": 1, "replies": [{"body": "For that to be true, then inflation would have tracked with release of M2 money, not the demand curve, and it's matching the demand curve.\n\nFor that to be true, then that inflation would match the consumer spending arc, it doesn't.\n\nFor that to be true, and for it to be just monetary policy response, then you'd see increased inflation across the board in all sectors of the economy because then it'd just be more cash competing for goods and services... but it's not, it's only certain sectors of the economy and those happen to be the ones for which there is a significant demand arc and where there is a commensurate supply constraint.\n\nBut here's the thing: by and large those constraints are logistical or due to pandemic disruption in the supply chain or in the buying patterns of consumers.\n\nIf you don't think the pandemic changed buying patterns and supply chains and that those things, not just monetary policy, are responsible for inflationary forces, then my only suggestion to you is to stop getting your economic information from reddit and actually take an econ 101 course so you can understand how price discovery on the open market actually happens.\n\nMonetary policy isn't all that matters. The supply and demand arc actually matter more when it comes to price discovery, and that has almost nothing to do with the government. And we saw this in our economic data where I work in February of 2020, so it definitely wasn't just the monetary policy response that had an impact... that was long before that response kicked in. Consumer spending was disrupted before it was even a pandemic and that disruption is likely to be filled once the blocking condition is resolved as long as demand exists, and it exists.\n\nSo saying that it's just monetary policy is just repeating the inane BS that people spout on here. That's not how this actually works. Money has to actually be competing in the economy for goods and services to be inflationary, and that would show up in the spending curve.  Instead, it's largely sitting in the banks anchoring their toxic assets.\n\nAnd you're talking to somebody who's been advocating for raising the minimum wage to match buying power from the 1980s since 2000. Wage increases have been lagging inflation for basically \\*60 fucking years.\\*\n\nThis is not a new problem.... but the reason I find it bullish is that expanding wages in the midst of expanding capital is a mechanism for expanded revenue centers for companies once the pandemic starts to loosen up more. Current inflation is not historically high for the country, just high compared to the artificially low inflation of the 2010s which were largely an artifact of the 2008 market crash and its impact on labor, wages, asset valuation, and spending power. We're actually going \\*down\\* in most sectors from an inflationary perspective MoM... people just focus on the YoY and go \"oh that's high\" without considering historical patterns and the directionality of the trend.\n\nThe simple fact of the matter is that while the current wage growth doesn't solve a multi-generation long problem, it does result in a situation where capital velocity can increase and the solvency of the people can more likely be maintained during the price discovery period.\n\nWhat you call \"dickjolly\" is actually me just understanding how the economy works. LOL\n\nBut look, I get it... you've made a profound mistake that a lot of people with very limited understandings of macroeconomics often make. Somebody once told you that inflation is a function of the amount of money in the market and then stopped right there and didn't explain how inflation actually works and that it's a function of supply and demand and that the money actually has to compete for goods and services for it to be the cause and that would reflect in the total spending numbers. It's OK, I get it... you're in over your head and you're scared. But, rest assured, the economy is quite a bit more complex than you think it is and directionality of trends matters when it comes to outcomes, and right now the dynamics are pro-wage growth and pro-growth in general coming out of the pandemic. To say it's just the money is just wrong.\n\nAnd yep, just read some of your other comments and your position is ideological, not economic... my advice is to stay out of economics discussions until you get some kind of real education in economics.", "score": 1, "replies": []}]}]}]}, {"body": "GS has a reason to spread as much FUD as possible, they have been shorting down growth stocks since March.", "score": 0, "replies": []}, {"body": "My bad spending habits are spreading throughout our economy...", "score": -1, "replies": []}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}, {"body": "See, I told you", "score": -1, "replies": []}, {"body": "This is good, it’s been a long time coming", "score": -1, "replies": []}, {"body": "Like hell it is.", "score": -1, "replies": []}, {"body": "Interesting I have yet to see it nor has anyone I know.", "score": -2, "replies": []}, {"body": "Where’s it at then?", "score": -2, "replies": []}, {"body": "\"Wage inflation\" comes with capital velocity increases. Bullish.", "score": 1, "replies": []}]}
