{"title": "Not too late folks! $TSLA🚀🚀🚀", "selftext": "", "id": "q7jr7t", "created_utc": 1634156387.0, "score": 119, "upvote_ratio": 0.84, "num_comments": 74, "comments": [{"body": "How to make $600k: have $500k", "score": 39, "replies": [{"body": "How to make $6 million…", "score": 12, "replies": [{"body": "Have 10 million.", "score": 27, "replies": []}]}]}, {"body": "Micheal Burry ripping his hair out rn", "score": 35, "replies": [{"body": "When Burry closes his short position TSLA is gonna go parabolic", "score": 8, "replies": [{"body": "Burry only shorted a few 100k worth...", "score": 2, "replies": [{"body": "Oh no he added way more lol", "score": 1, "replies": [{"body": "[https://twitter.com/Drtotalbabe/status/1447332410023161856](https://twitter.com/Drtotalbabe/status/1447332410023161856?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1447332410023161856%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.redditmedia.com%2Fmediaembed%2Fq5jja9%3Fresponsive%3Dtrueis_nightmode%3Dfalse)\n\n[https://twitter.com/garyblack00/status/1447338934577553415](https://twitter.com/garyblack00/status/1447338934577553415)", "score": 1, "replies": []}]}]}]}, {"body": "More likely that he is doubling down. His bet on the housing market went against him for quite awhile and he stuck with it and made crazy money.", "score": 0, "replies": [{"body": "On his last F13, it was 35.11% of his fund's holdings.  He could go full Colin Huang on us, but I think he already doubled down in Q2, so I don't see a triple down.  It's hard to justify that sort of thing when you are gambling with other people's money.", "score": 13, "replies": [{"body": "Probably true but his thesis seems reasonable but hard to go against TSLA at this point.", "score": 4, "replies": [{"body": "Tesla's rise and GM/Ford's stock drops could be the same strategy hedge funds used to pump up Amazon and take out competetors.\n\nIf Burry is expecting a Hedge Fund margin call, then Tesla would go down. If we're expecting the new investing waifu Cathie Wood to fail (because grill investor) then TESLA gonna go down.", "score": 1, "replies": []}, {"body": "He only bought a few 100k worth of puts... (and lost it all)", "score": 1, "replies": []}]}]}]}]}, {"body": "TSLA continues to make money for me like it always has and always will.", "score": 22, "replies": []}, {"body": "Congrats on becoming a millionaire in 2024!", "score": 9, "replies": [{"body": "More like late 2022 early 2023", "score": 6, "replies": []}]}, {"body": "Sitting on 100 shares here. TSLA gonna buy me a house.", "score": 21, "replies": [{"body": "… with a solar roof and power wall", "score": 19, "replies": [{"body": "And a model Y and roadster in the garage", "score": 13, "replies": []}]}]}, {"body": "Buying some calls for earnings tmrw fuggggit", "score": 6, "replies": [{"body": "Most of my ~4% that’s not in shares is in calls… \nOverly aggressive mix of FD’s, OTM calls/leaps", "score": 6, "replies": [{"body": "Very nice I’m thinking some $850s should print really well even with just the run up to earnings", "score": 6, "replies": [{"body": "850s for when", "score": -1, "replies": []}]}]}]}, {"body": "🚀🚀🚀🚀🚀 1000$ by the end of the year 🚀🚀🚀🚀🚀", "score": 18, "replies": []}, {"body": "Not gonna lie, it's out of my league. I'm watching Lucid instead for a strong buy point.", "score": 4, "replies": [{"body": "TSLA is the next TSLA\n\nHow many cars will Lucid deliver this year and next year? Lucid has no moat..", "score": 2, "replies": [{"body": "It's a good question. Another good question is how many luxury vehicles are going to be sold at all next year?", "score": 2, "replies": []}]}, {"body": "Lucid is WAY more expensive than TSLA\n\nhttps://twitter.com/wr4nygov/status/1448610593775267842?s=21", "score": 1, "replies": []}, {"body": "Today lcid had a great entry right at support...", "score": 1, "replies": []}]}, {"body": "I never trust anyone that uses the word “folks”", "score": 12, "replies": [{"body": "Porky pig in shambles", "score": 3, "replies": []}]}, {"body": "I’ve done 176% on tesla but I’m just more broke than you", "score": 2, "replies": []}, {"body": "70% of my portfolio is June 2023 $1000C's and 20% is in January 2024 $1500C's\n\nTSLA is the next TSLA", "score": 2, "replies": [{"body": "Solid positions!", "score": 1, "replies": []}]}, {"body": "Up ~54% on *shares* . Let Elon work for you and sit back", "score": 2, "replies": [{"body": "Precisely!", "score": 1, "replies": []}]}, {"body": "TSLA's parabolic move last year funded my diversified portfolio with disappointing gains this year.   Nice to see the trend the last three months on the shares I kept.", "score": 2, "replies": [{"body": "🍻To more upward parabolic movement🍻", "score": 2, "replies": []}]}, {"body": "I bought at $380 and only regret is that I also bought apple and Disney . Should have gone all Tesla", "score": 3, "replies": [{"body": "Same… I made a pretty big move into TSLA at the $500 range (pre-split last March), but got scared and sold at a ~10% gain.  Should have been all in", "score": 1, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|21|**First Seen In WSB**|8 months ago\n**Total Comments**|74|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=q7jr7t)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=q7jr7t)", "score": 1, "replies": []}, {"body": "Michael Burry not agreeing !", "score": 1, "replies": []}, {"body": "Well definitely not too late for puts", "score": 1, "replies": []}, {"body": "Yeah about 2 years too late \"folks\".", "score": -1, "replies": [{"body": "Yup, just like people were 2 years to late on AAPL in 2012 or AMZN in 2014.", "score": 24, "replies": [{"body": "Idk why ppl bet against tsla lol. First mover advantage, a cemented brand, they are essentially to the EV world what Apple is to smartphones & AMZN is to shipping & delivery. TSLA is a literal no-brainer AS A LONG TERM Investment. And the country hasn't even actually forayed into electrification yet. It's just \"in the talks.\" You made an intelligent decision, I just hope your remark opens people's eyes up. It's definitely not too late. If anything I can see a stock split a couple years into the future. Strong Play. Strong Play. Also Check out $PAYA while you're at it. I believe it too is a no-brainer play. If you like it, get the word out to fellow WSBers. Thanks.\n\n[PAYA HOLDINGS INC](https://www.reddit.com/r/Shortsqueeze/comments/q42pnv/paya_due_diligence_paya_holdings_inc_a_gift/?utm_source=share&utm_medium=web2x&context=3)", "score": 12, "replies": [{"body": "At this point tech in their vehicles is almost irrelevant for Tesla because they have brand recognition market share. Only thing that could catch up to them is if other existing manufacturers catch up at scale and cost before they operate at scale or bring costs down.", "score": 4, "replies": [{"body": "I don’t agree with that. Their tech and build tech is way ahead of everyone else. \n\n\nIsnt that amazing ? You have these entrenched massive vehicle companies and Tesla comes in and just dick slaps them all in technology and in actual manufacturing.", "score": 6, "replies": [{"body": "Oh sorry, I didn’t mean to say that their tech isn’t good, but more that it doesn’t matter if the tech advancement starts to lag or stay flat relative to their production ramp ups. \n\nThe risk comes in if the large behemoths get their heads out of their asses with tech, but most of them lag enough that Tesla will still have huge lead time even if they chose to let tech development stay flat in the short term to focus on volume.", "score": 4, "replies": [{"body": "They won’t though. They could barely make good ICE cars. \n\n\nWhere is Nissan Toyota and Honda in this? They aren’t even pivoting strongly to EV quite yet. We only see the domestics which had poor quality to begin with, and VW which has over complicated vehicles.", "score": 2, "replies": []}]}, {"body": "Their tech advantage is purely on their charging network imho, I feel their cars are overpriced and their autonomous driving tech isn't any better than Hyundai, BMW, Audi, etc currently but could be in the future. \n\nTSLA shareholders are betting on Elon, not anything else. Without Elon, share price would drop dramatically. Let's hope he doesn't have any skeletons in his closet.\n\nPlus I wonder how EV owners are going to feel when their batteries need to be replaced and they can't afford to do so in the next few years for early adopters.", "score": 2, "replies": []}]}]}, {"body": "Because they’re dumb", "score": 1, "replies": []}]}]}, {"body": "I bought more like 1mo ago and I’m already up 30% because I’m not an idiot. You should give thinking a try. It’s worked wonders for me.", "score": 1, "replies": []}]}, {"body": "Why such a hype about this brand? Only the model S is a beauty. The other cars are ugly as f*** . Only wallstreetmoney keeps this brand alive. \nGerman car manufacturers will come...come huge and TSLA will shrink like a nipple. I am going to shorten TSLA.", "score": 0, "replies": []}, {"body": "Yeah, give me 500k to work with. \n\nNot hating but money makes money, more then no money makes", "score": 0, "replies": [{"body": "I didn’t start with $500k… took ~13yrs to get to $300k.  Thanks to WSB & largely to GME, BB, AMC, and CLOV, I turned that $300k into ~$550k in a few months.  \nI’ve been in and out of TSLA for years.  I’m convinced it’s time to be all-in.  I went nearly all-in before the last split, but got scared and backed out with ~15% gains.  \n\nWill be holding my current shares for 8 years minimum.\n\nPretty sure you can turn each dollar into $10 (minimum) in that timeframe.", "score": 6, "replies": []}]}, {"body": "Preety late waiting for it to go to 200$", "score": -5, "replies": [{"body": "Ha. \n\nI was waiting for it to dip back to 500-600 couple months ago. That’s in the rear view window now.", "score": 5, "replies": []}]}, {"body": "Easy for you to say", "score": -1, "replies": [{"body": "Yeah, wasn’t too difficult to say", "score": 3, "replies": [{"body": "Really? Was hard af for me", "score": 0, "replies": []}]}]}, {"body": "TSLA will pop and many of you will lose your money.", "score": -10, "replies": [{"body": "Looks like it’s about to pop… showing lots of weakness. \n\nhttps://twitter.com/icannot_enough/status/1448474823303344131?s=21", "score": 5, "replies": []}, {"body": "Tesla would have to Go to like $4/share for me to lose initial capital.", "score": 2, "replies": [{"body": "I got in at the same price but had the good sense to sell and take profits. FSD will never happen. I also bought BTC at $35. Good luck!", "score": 0, "replies": [{"body": "Yes I’ve sold some as well but not all and have added. \n\n\nWith high cost of premiums, debit spreads are a good way to enter in. I’ve leap frogged into those and made more. Not sure how much but the ones I currently have are at 30k profit position expiry Jan. \n\n\nIt’s too dangerous to not to have one foot in Tesla at all times.", "score": 1, "replies": [{"body": "Fair play. If it's working for you keep going. I rotated into battery materials....more room for growth IMO.", "score": 1, "replies": [{"body": "But then you get miner valuations not tech valuations, and you have to pick the right one.", "score": 1, "replies": [{"body": "Ah ha but some miners also do tech!....Anode... Let's hope I've chosen well.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": []}]}
{"title": "$AAWW SHIIIIIT DD Part 3: Atlas Air Saves Christmas", "selftext": "About a month ago I [posted](https://www.reddit.com/r/wallstreetbets/comments/pottj2/dd_atlas_air_aaww_is_laughably_undervalued_and/) about how $AAWW is an incredibly undervalued stock with several upcoming catalysts for a revaluation.\n\nA brief recap:\n\n>AAWW is critically undervalued. COVID has all but annihilated international air travel volumes, driving up the price of air freight. Short term shipping disruptions have caused prices to soar, spilling over in to the air freight market. Analysts are expecting this disruption to resolve quickly, but are missing the shifts that airlines are making to narrow body jets and the impact on air freight. AAWW will have high earnings for years, and its current P/E of 4 is a joke. 13.6% of the float is shorted, and Atlas Air is free to reinitiate buybacks at the end of this month. AAWW's market cap could double and it still would trade at the rock bottom P/E of 8. Bullish AF.\n\n\\--------------------\n\n**SHORT TERM UPDATES**\n\nSince then, we've seen more and more fantastic news for AAWW come out. You may have seen on the news how fucked up the ports are... with dozens of ships waiting in line, a lack of port employees to unload them, and a lack of containers making their way back to Asia, there's absolute chaos in the ocean freight market. Prices for trips from Asia to the US have skyrocketed. Early last week, we saw those rates crash as (a) speculators who were flipping shipping slots for profits rushed to sell before they actually had to use the slots, and (b) the delays now meant that the goods would not be here in time for Black Friday or Christmas. So what happened to air freight rates? Spoiler: [They flew higher.](https://www.freightwaves.com/news/superhot-airfreight-market-leaves-shippers-in-the-cold) (If you only read one article from this post, this is a good one, and it is from today!)\n\nTake the following excerpt from [this article](https://www.supplychaindive.com/news/bare-shelves-retail-plans-holiday-supply-chain-delays/607677/) on the dire supply chain situation retail is facing and how they are mitigating it:\n\n>Others have spent what would in past years have been unthinkable amounts of money to fly product in by air freight, usually a transportation mode of last resort for many companies. [Executives](https://www.retaildive.com/news/what-retail-executives-are-saying-about-widespread-supply-chain-bottlenecks/605431/) at Nordstrom, Gap Inc., Tapestry and others have all told analysts they were taking on air freight costs to bypass bottlenecks in ocean freight.\n\nEven Levi's, who sells the most non-perishable, who-the-fuck-cares-when-you-get-it, item imaginable is [using airfreight this quarter](https://www.supplychaindive.com/news/Levis-diverts-airfreight-port-congestion-Long-Beach/603147/).\n\nAnd it's not just them. Atlas Air announced an agreement with HP earlier this year - this is not a traditional company who would typically source a dedicated freighter. They did it because they can use that aircraft to minimize supply chain disruptions. On the earnings call, CEO  John Dietrich discussed that they're \"creating a new customer base ... with the likes of HP and others, where they typically had not committed to dedicated freighters.\" I bet we'll have lots of good news on the next earnings call given the situation right now.\n\nIn fact, check out this article fresh from today: [**Air cargo rates skyrocket again as forwarders scramble for capacity**](https://theloadstar.com/air-cargo-rates-skyrocket-again-as-forwarders-scramble-for-capacity/)\n\n>“We are already seeing charter prices rise to record levels,” he explained. “As more aircraft are booked up, we are having to find aircraft from increasingly large distances to service key routes. This is a particular problem in Asia at the moment, with transpacific prices hitting $2m for a charter on a Boeing 777 for the first time, compared with around $750,000, at its best, pre-pandemic levels.”  \n>  \n>Mr Morgan-Evans said ACS had received calls from retailers that “normally wouldn’t dream of chartering”, since there’s no ad-hoc scheduled capacity left in the market.\n\n🤤**🤑**🤤**🤑**🤤**🤑**🤤**🤑**🤤**🤑**🤤**🤑**🤤**🤑**\n\n&#x200B;\n\n**LONG TERM PROSPECTS**\n\nNow, I know what you are thinking. This is a short term disruption, and after that, Atlas Air is going to plummet from its current shitty valuation back to its pre-pandemic super shit valuation. Decent theory... its the one that those who are shorting 14% of the float believe. But it's flat out wrong.\n\nIATA (gold standard for all things air) [recently published](https://www.freightwaves.com/news/iata-forecasts-2021-air-cargo-revenues-to-hit-record-175b) their full year 2021 and forward 2022 projections for air cargo. They see... YOY ***GROWTH*** in 2022 amounting to \\~5% greater cargo next year than in 2021. This does not fit the narrative that AAWW is on its last hoorah.\n\n[Note the +5&#37; YOY growth projected for air cargo in 2022.](https://preview.redd.it/bk5y0nmkhat71.png?width=1570&format=png&auto=webp&s=2e7f92f8385509c61bb578b21998b583f14cf2f4)\n\nAtlas air is not the only one noticing this... we've seen [so](https://theloadstar.com/air-canada-grows-transit-flows-as-it-prepares-for-arrival-of-freighter-conversions/) [many](https://www.aircargonews.net/airlines/freighter-operator/21-air-looks-to-expand-its-fleet-for-peak-demand/) [airlines](https://www.aircargonews.net/airlines/amazon-air-continues-to-expand-us-freighter-network/) attempting to buy cargo planes or convert passenger aircraft. Yet there are multi-year waitlists for conversion programs and new planes. So clearly those in the industry expect this to last a while. Check out [this article](https://www.bizjournals.com/seattle/news/2021/09/14/demand-high-for-freight-planes-and-conversions.html) which summarizes it quite well.\n\nWhy will it last a while? Well, online shopping and 2-day shipping relies heavily on airfreight. I'll point out that Atlas Air has strategically focused on becoming a critical part of the e-commerce supply chain. I have my doubts that people will stop buying stupid shit online.\n\nIn short, this is not simply a short term ordeal. AAWW is a value-add desperately needed by all industries at the moment, and inflation is helping them get their fair share of the pie going forward.\n\nI cannot wait for the Q3 earnings release and call.\n\n&#x200B;\n\n**POSITIONS**\n\nI bought the dip, again.\n\n[YOLO](https://preview.redd.it/4kwnudy0iat71.png?width=1812&format=png&auto=webp&s=f198b529378bc9ca17afdca664a4287aa7524107)", "id": "q7looo", "created_utc": 1634162335.0, "score": 88, "upvote_ratio": 0.92, "num_comments": 79, "comments": [{"body": "I actually just bought some more today, and more earlier after the dip.\n\nYou mention lots of cargo planes coming into the skies; won't that additional capacity unfavorably effect prices?", "score": 10, "replies": []}, {"body": "I’m also in similar size as you. Saw some news earlier too about Amazon wanting to buy more used cargo planes that can reach Asia. Good luck to them sourcing those. AAWW YEA BABY.", "score": 11, "replies": []}, {"body": "Quarterly Revenue Exceeded $1.0 Billion\r  \nReported Net Income Increased to $119.5 Million\r  \nAdjusted EBITDA Grew to $280.5 Million\r  \nAdjusted Net Income Increased to $145.4 Million\r  \nExpect Record Fourth Quarter", "score": 10, "replies": [{"body": "u/WSBGuhMan how you feel about them being “barely afloat “ now? Lol.", "score": 4, "replies": []}]}, {"body": "Just wanted to come back and say what an amazing play this was/is (I’m still in). \nPlease let us know when you find your next gem 😊", "score": 9, "replies": [{"body": "Thanks!! Will do. Atlas made me a millionaire! Will post an update soon", "score": 17, "replies": [{"body": "Congrats! You deserve it.", "score": 8, "replies": []}, {"body": "The AAWW calls are the only thing keeping my portfolio green.  thanks for the great DD.   Literally saved Christmas.", "score": 2, "replies": []}, {"body": "Congrats. Great play!", "score": 2, "replies": []}]}]}, {"body": "Is that a twin engine 747?!! I am more interested in that than this company", "score": 7, "replies": [{"body": "Had the same thought hahaha but if you look at the shadow on the ground, I think it’s just a matter of perspective and cropping", "score": 1, "replies": []}]}, {"body": "You should post another update with your thoughts on  Q3 earnings! Needs more volume.", "score": 6, "replies": []}, {"body": "Thanks for the continued engagement on the play. I sold out of my October positions for a decent profit. I didn’t manage to sell the top but did at least get out before last week’s dip. I still have February positions.\n\nTo what degree do you see increasing fuel costs prices affecting their profitability? Delta for instance today warned that rising fuel costs may significantly impact whether they turn a fourth quarter profit. I’m assuming this is the cause of AAWW’s price dip over the past week.", "score": 5, "replies": []}, {"body": "Bought 100 shares today. Earnings release next Wednesday. This is going to be interesting", "score": 6, "replies": []}, {"body": "What would happen if they announce share buyback would it push like bbby did today?\nI'm just looking for a nice guidance tomorrow that would rocket us too lfg aawwwwww gangs🚀🚀🚀 yall have a lovely night bois gl", "score": 4, "replies": []}, {"body": "just getting destroyed on januarys right now\n\nno announced dividend/buyback really hurting", "score": 4, "replies": [{"body": "Yeah I just bought more calls. These are calls you hold until near-expiry and sell at face market value.\n\nSelling these is always bitch.", "score": 6, "replies": [{"body": "still January's or longer term? stock is crazy undervalued to not have a buyback plan in motion", "score": 4, "replies": []}, {"body": "Just wondering....why are you buying more? Apparently no one on the Earnings Call mentioned buybacks/dividends.", "score": 3, "replies": []}, {"body": "Which calls did you get?", "score": 2, "replies": []}]}, {"body": "same here. Once volume drops it can't hold any gains.", "score": 5, "replies": []}]}, {"body": "Context: Atlas Air currently operates 19 Boeing 767-300ER aircraft for Amazon (Prime) Air.", "score": 3, "replies": []}, {"body": "It sure does seem that aaww is pinned under 80 for opex.", "score": 3, "replies": []}, {"body": "Anyone follow Air Transport Services Group (ATSG)? Obv most here are expecting stellar earnings tomorrow for AAWW (btw ty for the well thought out DD Thereian), but wondering if this could be a potential sympathy play if AAWW moves. Calls are cheap, 50% IV for Nov 19.  Pretty big gaps in the strikes though. Their er is on the 4th.", "score": 3, "replies": []}, {"body": "/u/Thereian I’m with you buddy.\n\n500 stock deep and ready to see the earnings tomorrow.  If they release positive earning info tomorrow I’m expecting to see a nice push.\n\nUnless they show a massive loss I’m doubting the stock will drop much lower.\n\nGod speed and good luck", "score": 3, "replies": [{"body": "Thanks!!! Good luck to us both.", "score": 6, "replies": [{"body": "Been in since $73 all thanks to Thereian! Just wanted to thank you a lot for really great posts on this play. Was very tempting to take profits today but I’m still holding! I don’t expect it to fly, I expect it to simply keep climbing as the market realizes the demand for airfreight is not going away!", "score": 7, "replies": []}, {"body": "Trying to get filled on calls as we speak. The spread is insane.", "score": 2, "replies": [{"body": "Monday was the day to put your bets in. The spreads were stupid today.  I tired to close out a CSP and the ask went from .5 to 1.5 to 5 my bid was .4 lol.", "score": 2, "replies": []}]}]}, {"body": "Are earnings going to be announced tommorow morning or afternoon?", "score": 1, "replies": [{"body": "10 AM CST", "score": 1, "replies": []}]}]}, {"body": "The bid/ask spread is crazy!", "score": 3, "replies": [{"body": "True. These options are ones worth holding until close when it converges on its FMV.", "score": 4, "replies": [{"body": "You planning to hold until 30-45 days before expiry? Think I’m going to let it go until end of the month.", "score": 2, "replies": []}]}]}, {"body": "Great find and callout u/Thereian. Swung the september runup, sold in the mid 80s and bought back when it dipped back into the 70s in october. Sold 20% of my 85cs this morning to cover my capital and riding the rest from here. Cheers.", "score": 3, "replies": []}, {"body": "heavy sell volume at the end of the day", "score": 3, "replies": [{"body": "$1 from all time high? I’m not concerned. We’re still $30-50 from fair value.", "score": 6, "replies": [{"body": "I'm not concerned, haven't sold short or long term calls yet. But, just thought it was a bit of a peculiar trading day today", "score": 5, "replies": [{"body": "I am confused about it also. the stock averages 500k volume so it makes no sense to trade it. It also doesn't have a huge OI for mm's to worry about. So who is always selling into eod? It's super common and weird.", "score": 3, "replies": [{"body": "yeah this looks like a concerted effort to push price down but idk", "score": 3, "replies": []}]}]}]}]}, {"body": "I trimmed and swung from AAWW to ATSG after each ER.\nWill re-enter before Q4'21 earning.\n\nIt has been great so far.\n\n\nFedex and UPS aside.\nAre there similar companies you noticed that provides the same services that could be entered before ER?", "score": 3, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|15|**First Seen In WSB**|9 months ago\n**Total Comments**|75|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/pottj2/dd_atlas_air_aaww_is_laughably_undervalued_and/) [x](https://www.reddit.com/r/wallstreetbets/comments/lheq8x/wkhs_dd_zero_chance_of_winning_a_significant/) [x](https://www.reddit.com/r/wallstreetbets/comments/j6tv06/entg_the_printer_behind_your_memes/) [x](https://www.reddit.com/r/wallstreetbets/comments/q7looo/aaww_shiiiiit_dd_part_3_atlas_air_saves_christmas/) [x](https://www.reddit.com/r/wallstreetbets/comments/pt06jp/atlas_air_aaww_dd_part_2_fedex_earnings_were/) [x](https://www.reddit.com/r/wallstreetbets/comments/pt7419/atlas_air_aaww_dd_part_2_fedex_earnings_were/) \n**Account Age**|10 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=q7looo)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=q7looo)", "score": 1, "replies": []}, {"body": "Solid thesis m8", "score": 2, "replies": []}, {"body": "My calls are up 128% so far. Can't wait for earnings, need cash for the rivian ipo.", "score": 2, "replies": []}, {"body": "Press conference is the 🚀🔑 pls 🙏", "score": 2, "replies": [{"body": "Liquidity is a bitch here….bids are so low", "score": 1, "replies": []}]}, {"body": "Anyone listening to the conference call?", "score": 2, "replies": [{"body": "No. What’s the outlook?", "score": 2, "replies": [{"body": "Lmao...Im not listening to the ER. I was wondering if someone else is.", "score": 3, "replies": []}]}, {"body": "I put it on while I'm working", "score": 2, "replies": []}]}, {"body": "Where is the volume. Blowout earnings and most 1 min candles have less than 1k volume.", "score": 2, "replies": [{"body": "needs a wsb write up lol, no one is acknowledging it in the wsb threads or on the street apparently", "score": 4, "replies": [{"body": "You're right. This is a gold mine for the next month, this price action is making me angry.", "score": 3, "replies": [{"body": "if I didnt have an irresponsible amount in already, I'd be doubling down", "score": 5, "replies": [{"body": "I'm in the same boat. Over 50% in it.", "score": 4, "replies": [{"body": "I'm like 20% but I have a fairly strict never over 10% rule lol", "score": 3, "replies": [{"body": "That's more responsible. I like to go almost all in on a really high conviction play.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "why do you think aaww started declining right when the pilots shortage came in the news last week?\n\nnot trying to be witty, just curious if you think thats impactful for earnings", "score": 4, "replies": []}, {"body": "Guys their current ratio is 0.87 and the industry PE is lower than 4.97 so for the love of God do more research before betting on a company barely afloat", "score": 1, "replies": [{"body": "What ratio? :) there are couple…", "score": 3, "replies": []}]}, {"body": "Hey I kinda new to both investing (1.5yrs) and Reddit and I have like 5k I can put into with the most  potential  for strong gains, and I don’t know anything about options etc…- I have a few shares of TSLA, but thought I should consider a couple other companies…(?)\nSorry edit: forgot the question lol- kush😎\nShould this be company be a good investment, especially short term?", "score": -14, "replies": [{"body": "/r/investing no joke dude this isn’t for good investments.  Look at the front page most people lose money", "score": 8, "replies": []}]}]}
{"title": "The Bubble's Going to Pop Soon", "selftext": "The real question is which one first:\n\n1) Supply Chain Bubble making production of goods near impossible and getting dire.  Lack of chips, energy and materials, transportation delays, worker shortage all coming to a head.  \n\n2) Global financial deleveraging initiated by China's real estate debt crisis.  This isn't one or two companies.  This was policy and business strategy across the country.  Repercussions will be massive.\n\n3) Money printing bubble...inflation and supply chain issues will weigh heavy on equity earnings.  Are assets overvalued beyond reason due to the money printing?  Will inflation reach hyperinflation or possibly a deflationary spiral at any taming of the printing presses.\n\n\nWhich bubble do you pick or do you have another idea?", "id": "q7nm3o", "created_utc": 1634168550.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 79, "comments": [{"body": "If it pops... buy the dip", "score": 34, "replies": [{"body": "All fun and games until it doesn't stop dipping... for potentially years.", "score": 6, "replies": []}, {"body": "The only good answer here! I usually roll with wtf ever happens happens, but god damn OP kinda has a point. Seeing how backed up the ports are and how fragile society is (pandemic had people going crazy) makes me a little concerned. Tip the scales a little more and it’s full out anarchy. I’m fine,  I live on a farm and can feed my family it’s the city dwellers that will fucking eat each other alive.  Granted things will balance out and the ones who bought the dip will come out on top like always. What a weird fucking time to be alive.", "score": 2, "replies": []}]}, {"body": "I feel like they’ve been saying this for a while now", "score": 56, "replies": [{"body": "They've been saying this every year in last 100 years", "score": 40, "replies": [{"body": "How do you figure, OPs account is only a year old?", "score": 10, "replies": [{"body": "He makes a new account every year the last 100 years", "score": 16, "replies": []}, {"body": "I’m just new to the Reddit game 😏🤪", "score": 3, "replies": []}, {"body": "Astounding lack of comprehension", "score": 4, "replies": [{"body": "ha ha, you said ass", "score": 0, "replies": []}]}]}]}]}, {"body": "we are in earning season. bull market is back.", "score": 48, "replies": [{"body": "are we still doing covid excluded \"GAAP\"?\n\n'cause when that gets removed, all hell is going to break loose right in the middle of earnings season.", "score": 5, "replies": [{"body": "That’s a thing?", "score": 1, "replies": [{"body": "Very much so... \n\nHere's a Wall St. Journal article from a year ago:\n\nhttps://www.wsj.com/articles/companies-adjust-earnings-for-covid-19-costs-but-are-they-still-a-one-time-expense-11600939813", "score": 2, "replies": []}]}]}]}, {"body": "Instructions unclear. I don’t see a ticker, strike, or date. 0/10 wouldn’t read again.", "score": 21, "replies": []}, {"body": "Deeez nuts gonna pop", "score": 22, "replies": []}, {"body": "Calls on $PEP & $UTZ.   Store today had whole aisle full of their chips ready to go.", "score": 16, "replies": []}, {"body": "🏳️‍🌈🐻", "score": 25, "replies": []}, {"body": "Bro I went to the store today and they ain't no shortages on chips\n\n\nFrito lay be killing it", "score": 19, "replies": [{"body": "Stacks on stacks of toilet paper available - we can shit in peace", "score": 10, "replies": []}]}, {"body": "just waiting for shit to go sideways so i can get some discounts", "score": 6, "replies": []}, {"body": "Life as we know it will pop, then the new matrix will come out", "score": 5, "replies": []}, {"body": "53% of retail Investors have Cash ready for an upcoming crash. Do you really think the market crashes if everyone expects one?", "score": 16, "replies": [{"body": "...where did you get that statistic from?", "score": 7, "replies": [{"body": "Fun Fact: 69% of all statistics are made up.", "score": 24, "replies": [{"body": "I thought it was 69.7%!?!?![gif](emote|free_emotes_pack|facepalm)", "score": 3, "replies": [{"body": "It's actually 420.69%", "score": 7, "replies": []}]}]}, {"body": "It was part of the German equivalent to Mad money", "score": 3, "replies": [{"body": "German Cramer doesn't sound trustworthy", "score": 7, "replies": [{"body": "It is a well known stock magazine in Germany.\nNever ever would they fake their statistics.", "score": 4, "replies": [{"body": "Lidl doesn’t count", "score": 2, "replies": []}]}]}]}, {"body": "His asshole.", "score": 2, "replies": []}]}, {"body": "I know i am 1/3 cash right now.", "score": 3, "replies": []}]}, {"body": "There is always a bubble somewhere and you will try to find it for us?", "score": 10, "replies": []}, {"body": "#your wife's bubble butt when I'm done with her", "score": 7, "replies": [{"body": "His paperhanded GME shares paid for that bubble butt so use it with care!", "score": 2, "replies": []}]}, {"body": "FUUUUUUUUUD", "score": 4, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|22|**First Seen In WSB**|9 months ago\n**Total Comments**|84|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/l5v7ci/hold_gme_this_is_in_an_infinite_spiral_that_will/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=q7nm3o)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=q7nm3o)", "score": 1, "replies": []}, {"body": "Non of those are speculative bubbles", "score": 2, "replies": []}, {"body": "Deleveraging is what your wife's boyfriend does to her when he is holding off her ankles", "score": 2, "replies": []}, {"body": "Everything is going to be ok.", "score": 2, "replies": []}, {"body": "Ah good. What we really needed in this sub was post number 62849264585725 about how the bubble is going to burst", "score": 2, "replies": []}, {"body": "Supply chain ain’t popping anytime soon. \n\nI work in the industry and this is only the beginning of freight costs.", "score": 3, "replies": [{"body": "Freight costs have got to be horrendous now, no way it isn’t garbo now.", "score": 1, "replies": [{"body": "I mean it’s great for me. For consumers? Not at all", "score": 3, "replies": []}]}]}, {"body": "It's very simple actually. Porn will easily solve all of these.\n\n1. People want to watch porn and therefore will find a way to make chips and harvest other materials for devices to watch porn. \n2. People need homes to watch porn so they'll find a way. \n3. Something something porn.", "score": 4, "replies": [{"body": "there's never been a shortage", "score": 1, "replies": []}]}, {"body": "Japan spent a decade unwinding their printing problems...\nWe have the luxury of the world be Dollar denominated  and for these creepy pols it's a shell game...", "score": 2, "replies": [{"body": "Not so fast…russia’s selling europe gas for euros. Chinas trading yuan to iran for oil.", "score": 2, "replies": [{"body": "Yeah its only a few more years before countries stop trading using the USD.", "score": 2, "replies": []}]}]}, {"body": "I think if the bubble doesn't pop this week or next, we most likely just see a slowly bleeding market for the next few years. They've gotten very good at preventing pops.", "score": 2, "replies": [{"body": "Not really...Fed only reacts after it pops by printing more.", "score": 3, "replies": [{"body": "Op you a gay bear. Go to r/gaybears where you belong", "score": 2, "replies": [{"body": "I'm a mod there....", "score": 5, "replies": []}]}]}]}, {"body": "Supply chain bubble is not production based, heavily transport based as cause. Yes vendors are experiencing longer production times due to labor and material shortages, but shipping especially internationally a huge struggle. Source: work in the industry", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4735)![img](emote|t5_2th52|4735)![img](emote|t5_2th52|4735)", "score": 0, "replies": []}, {"body": "![gif](emote|free_emotes_pack|poop)", "score": 1, "replies": []}, {"body": "She's made of iron, I assure you she'll sink.", "score": 1, "replies": []}, {"body": "Only goes up. Well only anything I dont own.", "score": 1, "replies": []}, {"body": "Again?", "score": 1, "replies": []}, {"body": "It’s the 3 for me", "score": 1, "replies": []}, {"body": "How is a supply chain bottle neck a bubble? That doesn't even make sense.", "score": 1, "replies": [{"body": "On the verge of supply chains collapsing in a lot of industry.  It's never happened.  Mass walkouts/strikes or a natural disaster could wreck havoc. No room for any incidents.", "score": 1, "replies": []}]}, {"body": "Let's see what happens Monday with the ISAE union", "score": 1, "replies": []}, {"body": "My stocks bubbles popped in February and now it’s only a thin skin on the stock!😂 someone should blow it to get bubble again!👁‍🗨👁‍🗨👁‍🗨👁‍🗨😪😪😪😪", "score": 1, "replies": []}, {"body": "Uh oh, looks like WSB is going full 🌈🐻. Time to buy the FUCK outta those calls", "score": 1, "replies": []}, {"body": "The bubble surely has to pop by how did anyone know when that'll be? How do you go about protecting your investments. I've been trimming back and settling a lot of stuff. I'm the most brochures investor and pessimistic in general. Anyone tempted to get out entirely and buy back in once the collapse happens?", "score": 1, "replies": []}, {"body": "Electric self-driving trucking industry. Get going.", "score": 1, "replies": []}, {"body": "Another GameStop expert gaybear hybrid.", "score": 1, "replies": []}, {"body": "Where's `I'm not a financial advisor` disclaimer? You're a scam ser.", "score": 1, "replies": []}]}
