{"title": "What’s y’alls thoughts on TSLA", "selftext": "[deleted]", "id": "eu2k8k", "created_utc": 1580015645.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 24, "comments": [{"body": "Buy some on next dip - if there is one ever", "score": 14, "replies": [{"body": "I was thinking that same thing lol.. may never be a dip again ):", "score": 1, "replies": [{"body": "Yes. Based on the 3 year price chart it is clear that TSLA is a unicorn stock with no dips. I would expect based on the enormous profits it is making that it will probably touch a trillion dollars in market cap before it plateaus.", "score": 6, "replies": [{"body": "Dude I’m gonna go for it", "score": -5, "replies": [{"body": "I think your scarcasm detector is down", "score": 12, "replies": []}]}]}, {"body": "if anything, you will get a chance to buy around 400 on next 6 months. it was just 400 at the last day of the last year", "score": 1, "replies": [{"body": "432 today. And only 54 days of your 180 used up.", "score": 1, "replies": [{"body": "it was 350 yesterday", "score": 1, "replies": [{"body": "Damn. To bad it will never dip again.", "score": 1, "replies": []}]}]}]}]}, {"body": "What’s your definition of it dipping", "score": 1, "replies": [{"body": "For me it would be like dropping from $570 to $530. So I guess like 5-3% dip at a minimum.", "score": 2, "replies": [{"body": "If you’re investing in the long term that dip is pretty insignificant to you overall return", "score": 2, "replies": []}, {"body": "it was 493 just 5 trading days ago. Seriously.", "score": 1, "replies": []}]}]}]}, {"body": "TSLA is just super volatile. The stock scares me because I play options. You can make good money and lose good money on this craziness. But yeah great company. Love Elon.", "score": 7, "replies": []}, {"body": "TSLA is a scary stock right now, it really is gambling atm - do I think TSLA will be a couple thousand stock one day? Yes, but the chances of it also crashing back to $150 is a possibility, but it also could keep rising all the way up.\n\nI would say TSLA is safe bet for long term, but you gonna be able to stomach that crash when/if it has one and ignore it.", "score": 5, "replies": [{"body": "I agree apart from the $150 part. With production rising like it will, I don't believe it will fall back to where it was in 2013 selling just a fraction it does now. Also, there's strong $175 resistance. If it goes below $350 again I would be shocked.", "score": 1, "replies": [{"body": "Production is rising but the rate of growth for demand is slowing", "score": 0, "replies": []}]}, {"body": "if anything, tesla is doomed in the long term. Short term, it could go up  but eventually, it will crash pretty hard.", "score": 0, "replies": [{"body": "Reasoning behind this?", "score": 1, "replies": []}]}]}, {"body": "I think in 10 years it will be a well known cautionary tale....", "score": 5, "replies": []}, {"body": "The old buy high sell low. I'd struggle to think of other companies that are as hyped (and inflated) as tesla at the moment.\n\nWhat's a better company to invest in? One that is overvalued, hyped, and gets more media attention than just about any other company with a following that feels like a cult..... Or a stable company that is undervalued and gets little media attention? You decide.", "score": 3, "replies": [{"body": "Great point", "score": 1, "replies": []}]}, {"body": "He does good at rockets too", "score": 1, "replies": [{"body": "But not publicly traded yet", "score": 1, "replies": []}]}]}
{"title": "TSLA like companies that analysts hate but have promising tech?", "selftext": "I think I have found the key to making 10x, invest in companies that have promising tech but not great fundamentals(yet). Most analysts don't seem to get them and when they do the price goes parabolic. I understand there is a risk involved here and sometimes having great tech is not enough but that is what drives the high reward on good execution.\n\nAny other companies which are like TSLA in this regard?", "id": "eu2nno", "created_utc": 1580016252.0, "score": 11, "upvote_ratio": 0.67, "num_comments": 19, "comments": [{"body": "I think that's called speculating.", "score": 30, "replies": [{"body": "Or gambling", "score": 22, "replies": [{"body": "Yes, like putting money on a horse or a boxer whom you have studied a lot as opposed to 100% chance based gambling.\n\nI am comfortable having a percentage of my net worth in speculative trading like these.", "score": 3, "replies": []}]}]}, {"body": "Uber, Virgin Galactic, NIO and Luckin Coffee. Basically my whole portfolio is tech based real-world companies operating in a massive negative.\n\nI am young and have time ahead of me. My speculation will hopefully pay off.\n\nInvested in stocks with all and playing options on SPCE & NIO because they are the only ones that are affordable for me at the moment.", "score": 9, "replies": [{"body": "How’s LK tech?", "score": 1, "replies": [{"body": "They push all sales, most marketing, delivery and whatnot through their app. It's all centered around digital acquisition and retention.\n\nEdit: Similar to the way Dominos is now considered a tech company except moreso because payments in China are much more centered on digital payment methods.", "score": 0, "replies": []}]}, {"body": "Agreed. Uber, however, I think may not survive if they don't get to full self driving before Tesla.", "score": 1, "replies": [{"body": "Sure, it's a bit of a gambit, but they are octopussing themselves into as many businesses as possible to be unstoppable. \n\nFor instance, they will be rolling out a type of Uber medical transportation at some point, something Tesla will never get into.\n\nThey're also focused on air transportation. \n\nTime will tell. It is of all the listed, my least prospective I think. I have much more faith in LK, Virgin Galactic and NIO.", "score": 1, "replies": []}]}]}, {"body": "SPCE?", "score": 4, "replies": []}, {"body": "You’re just looking for stocks that are overly hated by big money for whatever reason. Not necessarily analysts. \n\nSee Bloom Energy. Great tech. But hated and shorted by big money.  Although in this case, loved by at least one Credit Susie analyst who is the expert in the alternative energy field.", "score": 2, "replies": []}, {"body": "Time to double down on NIO?", "score": 3, "replies": [{"body": "Yes, I think they will stay in the game. I am not sure if they are the Huawei/Samsung of the EV world or just OPPO/Xiaomi.", "score": 3, "replies": [{"body": "Just bought 400 shares after yesterday’s dip. With a share costing around $4.5, it’s a steal right now. \nThe reason I’m optimistic is because they make a good product (good looking and functional car), they are operating in the negatives but are predicting a profit year in 2020, and they are backed by the Chinese government. \n\nI don’t see the stock tanking more than what it is now and hope to hold for the next 3 years until I reassess.", "score": 1, "replies": []}]}]}, {"body": "You could also have found the key to losing all your money in a downturn", "score": 1, "replies": []}, {"body": "Bynd", "score": 1, "replies": []}, {"body": "NIO", "score": 0, "replies": []}]}
{"title": "Apple , Google, Dell, Microsoft and Tesla named in US lawsuit over Congolese child cobalt mining deaths.", "selftext": "", "id": "eubnpy", "created_utc": 1580067986.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 27, "comments": [{"body": "For Decades nobody cared that Cobalt was used extensively in Oil Refining.\n\nhttps://www.cobaltinstitute.org/desulphurisation.html \n\n*Cobalt plays a vital role in catalysing the removal of sulphur from oil, contributing to a more sustainable society.* *The use of cobalt in desulphurisation reactions represents the highest tonnage of cobalt use in the catalyst* *sector. All crude oils contain between 0.1% and 2.5% of sulphur dependant on their source of origin.*\n\nEDIT1: To be clear this is a real problem hope Tesla ends up sourcing Cobalt sustainably\n\n\nEDIT2: Why not sue the Oil Companies as well ? and  should have started the lawsuit 10-20-30 Years ago ?\n\nEDIT3: Oil is a consumable, Batteries last almost 10 Years (In Cars) - so if you ask me using Cobalt in Oil is way worse", "score": 22, "replies": [{"body": "[removed]", "score": -9, "replies": [{"body": "No. People should just direct a fair share of their ire towards oil.", "score": 6, "replies": [{"body": "[First Google result for cobalt use. Cobalt isn't used nearly as much for desulphurisation as for batteries.](https://batteryuniversity.com/learn/article/bu_310_cobalt).\n\nRegarding your EDIT 3, fair point but I doubt it is this simple, you have to account for energy density, environmental impact, amont of cobalt used for the same amont of energy...", "score": -3, "replies": [{"body": "Fair Point, I added a little edit to my EDIT-3 \"(In Cars)\"\n\nConsumer Electronics Batteries to be fair probably only last 2-5 Years", "score": 0, "replies": []}]}]}]}]}, {"body": "Such a FUD stretch: Tesla isn’t even named \n\n>\they worked at mines owned by Zhejiang Huayou Cobalt, a major Chinese cobalt firm, which the lawsuit claims supplies Apple, Dell, and Microsoft and is likely to supply the other defendants.", "score": 13, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "[Yes it is named. I’ll let you see for yourself in the docket file linked in the article.](http://iradvocates.org/sites/iradvocates.org/files/stamped%20-Complaint.pdf?utm_source=share&utm_medium=ios_app&utm_name=iossmf) /u/strontal\n\nThe article was never posted here before.", "score": -12, "replies": [{"body": "How underwater is your short? You realise what I quoted right?", "score": 5, "replies": [{"body": "I don’t believe I disclosed any position on the stock. Not that I have to. Funny that you keep labeling me short.\n\nYou quoted the article and implied that Tesla was not named, which proved untrue.", "score": -2, "replies": [{"body": "Mods: post history reveals karma farming for the past two months", "score": 3, "replies": [{"body": "Is this against the rules ?", "score": -2, "replies": [{"body": "Yes", "score": 3, "replies": [{"body": "Which one ? Is just impossible to get karma nowadays with all the Tesla communities except the lounge requires karma.", "score": 0, "replies": [{"body": "Two month old account trying to farm karma. Which account did you get banned from?", "score": 3, "replies": []}]}]}]}]}, {"body": ">\tFunny that you keep labeling me short.\n\nSince this is the first time I brought it up funny how you can’t read.\n\n>\tYou quoted the article and implied that Tesla was not named, which proved untrue.\n\nCorrect, I quoted the article where it didn’t name Tesla. I didn’t reference the lawsuit. Is your reading as bad as your comprehension?\n\nThink of it this way, why would a credible lawsuit:\n\nA. Detail Musk’s net worth as if it was relavent to the case\nB. Not be against the actual buyers and suppliers of cobalt instead of making unfounded accusations against end users.\n\nYou already know cobalt also comes from many parts of the world including Australia where Glencore obtains it as a result from copper mining.\n\nYou’ve already had pointed out to you that there are many other users of cobalt in industry just this lawsuit names big American companies... it’s almost like a cash grab\n\nBut anyway, just be honest and let people know your short position", "score": 2, "replies": []}, {"body": "Your accounts posting /comments make.you look sketchy.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Maybe Corona virus caught at Tesla Cobalt Mine would be a good one? Lol 🩳", "score": 1, "replies": []}, {"body": "Why does every single piece of slightly negative press has to be disregarded as FUD ?\n\nEdit : why are you presuming what position I hold ?\n2nd : the title of the article changed since it was posted. I’ll let you see the « in other discussions tabs » of reddit. Either way, even if, the title still needed to show relevancy to Tesla and that would have been a fair edit. It is bot like I deleted the name of every other company just to let Tesla alone in the headline.", "score": -7, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "First you call the article FUD then you make an ad hominem attack on the guy. Congrats.", "score": -8, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I am a frequent commenter and poster on this sub.", "score": -5, "replies": []}]}]}]}]}]}, {"body": "I thought Tesla (Panasonic) was one of the few companies that didn't source their cobalt from the Congo? They sourced it from North America, Europe, and Cuba until US Sanctions prevented them from utilizing Cuba's resources", "score": 5, "replies": []}, {"body": "Tesla only uses cobalt from areas that treat their employees well.", "score": 4, "replies": [{"body": "Citation needed.", "score": -2, "replies": [{"body": "https://insideevs.com/news/336482/tesla-has-found-yet-another-safe-haven-for-cobalt/\n\nAlso:\n\nhttps://www.teslarati.com/tesla-glencore-cobalt-supplier-lithium-battery-cell-production/", "score": 5, "replies": []}]}]}, {"body": "I saw this exactly headline months ago. Coincidence it's being brought up again around earnings report?\n\nI think not.", "score": 1, "replies": []}]}
