{"title": "$SQ Earnings Thread", "selftext": "**Estimated EPS:** $0.16\n\n**Actual EPS:** $0.21\n\n**Conference Call:** 5 PM EST [**link**](http://mmm.wallstreethorizon.com/u.asp?u=274075)", "id": "cktkx5", "created_utc": 1564690100.0, "score": 36, "upvote_ratio": 0.89, "num_comments": 75, "comments": [{"body": "[deleted]", "score": 27, "replies": [{"body": "Always inverse those GS fucks, WSB does better DD than those galaxy brains", "score": 12, "replies": []}, {"body": "How u think they make billions in trading rev? By playing retail idiots", "score": 4, "replies": []}, {"body": "Right? Maybe tomorrow PM will save us.", "score": 2, "replies": []}, {"body": "I'm 2/3 following their shit so far -- TWTR and ABC paid huge, SQ is losing huge off of something they couldn't predict (damn Door Dash sale). I'll give them another chance or two cause at least it's better DD than the shit around here", "score": 2, "replies": [{"body": "It's not down on the door dash sale. It's down on the Q3 estimates. This happens every single quarter with SQ. It goes up into earnings, then crashes, then goes back up afterwards. I don't know why people keep buying it ahead of earnings.", "score": 5, "replies": []}]}]}, {"body": "I had put spreads, sold them at 15% profit after president mango tweet and loaded up on calls. Now its time to take a big step back and literally fuck my own face", "score": 19, "replies": [{"body": "My minds telling me nooooo", "score": 1, "replies": []}]}, {"body": "Christ... I sold 75Ps and they might go in the money now...\n\nE: kill me", "score": 14, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I’ll probably buy them back. Got like $.90 per contract so I got a little bit of leeway.\n\nE: $.75ish actually 🤮", "score": 2, "replies": []}]}, {"body": "Why would you sell that? SQ's been performing really bad recently", "score": 2, "replies": [{"body": "I try to sell options 5-10% out for some earnings to get premium. Why SQ specifically? I’m dumb.", "score": 2, "replies": [{"body": "I did the same", "score": 1, "replies": [{"body": "Me too.  Had 100 shares and if I could make $50 selling a covered call on Thursday for the next day, I was happy.  Got greedy and took a $200 payday on a $65 atm call.  Call was exercised and I lost my shares.  Been waiting until today to buy back in since $SQ typically shits the bed on earning day.  Picked up 25 shares and will see what happens tomorrow.", "score": 1, "replies": []}]}]}]}]}, {"body": "well shit looks like I own 100 shares of sq now :/", "score": 14, "replies": [{"body": "Good premiums hopefully?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "[They're evolving](https://i.imgur.com/vq4jvJE.gif).", "score": 3, "replies": []}]}, {"body": "SQ put squad checking in!", "score": 10, "replies": [{"body": "😘", "score": 4, "replies": []}]}, {"body": "I made the most retarded play on $SQ. \n\nFs to everybody", "score": 9, "replies": []}, {"body": "SQ beat plus offloading Caviar to door dash and my portfolio is drilling why!!!!!!!!!!do I suck at this?", "score": 10, "replies": []}, {"body": "ABORT", "score": 7, "replies": [{"body": "WHY IS IT DROPPING", "score": 3, "replies": [{"body": "F", "score": 4, "replies": [{"body": "U", "score": 1, "replies": [{"body": "C", "score": 1, "replies": []}]}]}, {"body": "Cuz it’s a shit stock", "score": -3, "replies": []}, {"body": "Hahahaha you got rekt like a little bitch", "score": 0, "replies": []}]}]}, {"body": "CNBC:  Square plunges 6% after earnings, which includes announcement of sale of Caviar service to DoorDash", "score": 9, "replies": []}, {"body": "God. Fucking. Dammit.", "score": 7, "replies": []}, {"body": "Why is guidance more important than actual EPS beat?", "score": 7, "replies": [{"body": "if you think the next quarter is going to be worse than the previous one(which is at the moment priced in) then you would sell since the price cannot get any better. Remember that EPS is for the previous quarter", "score": 7, "replies": []}, {"body": "growth stock", "score": 3, "replies": []}, {"body": "In this market, yes.  It's a buy in the low 70s IMO if it gets there after hours or tomorrow.", "score": 1, "replies": []}]}, {"body": "That \"beat and dip\" though.  Hopefully it recovers to flat since I'm theta gang.", "score": 5, "replies": []}, {"body": "8/9 $75p hoping this bitch drills to lower 70’s", "score": 4, "replies": []}, {"body": "100 shares, 2020 80 call, september 80 call, rip", "score": 4, "replies": [{"body": "Rip dude, but the 2020s will be okay hopefully. I got Jan 2020 95 calls, they were up 100% today. I only sold off a third of my position.", "score": 1, "replies": []}, {"body": "U be iight", "score": 1, "replies": []}]}, {"body": "Meh might as well just hold the shares if I get assigned", "score": 4, "replies": []}, {"body": "it dropped 7% on eps beat what the hell", "score": 7, "replies": [{"body": "What's the actual eps?", "score": 3, "replies": [{"body": "0,21 per share", "score": 4, "replies": [{"body": "?????\nAgain why is it dropping lol. Is it cause of revenue?", "score": 5, "replies": [{"body": "who gives a fuck about revenue when you beat eps??????", "score": 1, "replies": [{"body": "Because it's a growth stock. Investors wanna see rev growth. They ain't worried about profits right now.", "score": 2, "replies": []}]}]}, {"body": "Where are you seeing that?", "score": 1, "replies": [{"body": "earningswhisperer", "score": 2, "replies": [{"body": ":[", "score": 1, "replies": []}]}]}]}]}, {"body": "Probably has something to do with SQ's Caviar being bought out by Doordash, and SQ receiving $400M in cash + some bullshit worhtless equity in Doordash.", "score": 2, "replies": [{"body": "Imo, any equity in Doordash is worth more than Caviar was ever going to be worth. But, I'm 🐻 on SQ for ER, so... ¯\\\\\\_(ツ)_/¯ ...got lucky this time.", "score": 1, "replies": []}]}]}, {"body": "Wow - this is a really confusing response to what looks like a solid beat on EPS. Eh?", "score": 8, "replies": [{"body": "News is saying they sold their food delivery service to Door Dash, seems the market doesn't like that", "score": 0, "replies": [{"body": "Its not that, its the Q3 estimates. They have been trying to sell Caviar for years and got a pretty good price for it.", "score": 3, "replies": []}, {"body": "Balls...meh, I guess I'll just hold this longer than expected; they always seem to bounce back. Aside from that sale (I guess it's bad news for a growth stock?) they really did crush it this past quarter.", "score": 2, "replies": []}, {"body": "I didn't even know they had a food delivery service.  Why did they have that?", "score": 1, "replies": [{"body": "We used it when it came out at a restaurant I worked at in college. Kinda sucked ass then and has continued to maintain that reputation in a lot of circles. Gives restaurant staff more agency than delivery services like GrubHub and DoorDash but those fucks come anyways whether you request to be listed or not so all Caviar ever really did was make folks' jobs even harder. The fact that people are using this as a reason to sell means they had no idea what they were buying in the first place.", "score": 3, "replies": [{"body": "I've barely even heard of Caviar.  Postmates, GrubHub, DoorDash and UberEats saturate the market here, so it seems like a good idea to unload the smell fish egg app.", "score": 5, "replies": []}]}]}]}]}, {"body": "Fuck SQ", "score": 7, "replies": []}, {"body": "FFS", "score": 2, "replies": []}, {"body": "ive had iron condor on SQ 75.5-84 since last week as my learning options first trade. expiring tomorrow wish me luck", "score": 2, "replies": [{"body": "In the future, give yourself more time to be right when buying iron condors. The average days to expiration is usually 45. Also, playing iron condors for earnings is usually not the best strategy as there can be drastic price swings like the one that just happened. Strangles or straddles would be better as they make more money based on if the underlying is more volatile. Also I don’t really trust robinhoods execution on assignment. Hopefully they exercise your long against your short position on the put spread correctly, but idk. If it gets dicey tomorrow I’d just leg out of your put spread.", "score": 4, "replies": [{"body": "Agree with you about giving yourself more time on plays, but iron condors are totally a valid strategy to play earnings if you believe IV is overstated.", "score": 1, "replies": []}, {"body": "yeah I didn't realize it was reporting earnings just before expiration I was kinda random gambling to get a feel for the game. what exactly does it mean to leg out? I don't have a lot of buying power or collateral so I can only do certain strategies.", "score": 1, "replies": [{"body": "Legging out just means that you’re closing one leg, or one side of your iron condor (either the call or put credit spread).", "score": 1, "replies": []}]}]}]}, {"body": "All in on BBY puts through ER if these tariffs are on", "score": 2, "replies": []}, {"body": "Bruh", "score": 2, "replies": []}, {"body": "5 PM EDT happens when this comment is 51 minutes old.\n\nYou can find the live countdown here: https://countle.com/aHemrrDWg\n\n---\n\nI'm a bot, if you want to send feedback, please comment below or send a PM.", "score": 1, "replies": []}, {"body": "I'm too scared too look but I sure hope it goes uppsies and not downsies.", "score": 1, "replies": [{"body": "It dropped like crazy no news yet tho lol I'm sweating", "score": 5, "replies": [{"body": "F, hope the actual call helps it lol.", "score": 1, "replies": []}]}, {"body": "it's dead", "score": 4, "replies": []}]}, {"body": "mfw didn't know SQ earnings is today", "score": 1, "replies": []}, {"body": "Glad I sold right at close. Although I did but some credit spreads which are fucked but rather lose 73$ then 220", "score": 1, "replies": []}]}
