{"title": "Being in the stock market right now is like slowly watching a family member die. You just want the crash to happen - - for it to be over. So the pain can end, and the storm above can dissipate, and the after relief can begin - - the time of no fear, for the worst has already happened.", "selftext": "Honestly, if the economy is going to drop, I'd rather it happened tomorrow than in two years time, thanks.", "id": "cr66zp", "created_utc": 1565961240.0, "score": 310, "upvote_ratio": 0.92, "num_comments": 81, "comments": [{"body": "I feel the same but mainly because I want to take advantage of a recession and I'm impatient.", "score": 159, "replies": [{"body": "\nA lot of people doing this don’t realize that liquidity will dry up quickly in a bad recession and it’ll be hard to get credit. Everyone wanting to buy a house after a big crash better have a lot of cash or a credit score of 9,000,000", "score": 38, "replies": [{"body": "Oh no I can't get a 300 year mortgage anymore? Honestly I hope the housing prices drop like a rock so I can use my cash to buy my next house cheap. Also, fuck you boomers who worked a summer job and bought a house for 10k about 30 years ago and now want to sell it for 500k or a mil. Boomers are basically trying to cash in on the housing pyramid scheme. Fuck. That.", "score": 54, "replies": [{"body": "I was talking to a friend recently and his grandmother was selling her 2 bedroom shack right outside SF for a mil she bought in the 70’s on the cheap. Talk about the real autists.", "score": 19, "replies": []}, {"body": "Houses are cheaper per square foot today than they were in 1980.\n\nAlso, mortgages today are what. 3.5%? \n\nThey were 15% back then", "score": 6, "replies": [{"body": "I can’t sleep without two empty bedrooms with full closets.", "score": 19, "replies": []}]}]}, {"body": "And the drop in demand will cause foreign investors to dump their US real estate holdings driving home prices down overall and making homes affordable again.", "score": 10, "replies": []}, {"body": "I'm just trying to go all in on leaps fuck a house", "score": 4, "replies": []}, {"body": "What does the scouter say about his credit rating?\n\nWHAT 9,000?!", "score": 9, "replies": []}, {"body": ">a lot of cash or a credit score of 9,000,000\n\nNow imagine if you have both.", "score": 1, "replies": []}]}, {"body": "The last recession was the second best thing to ever happen to me after 9/11. I had an army enlistment bonus I stuck into index fu-I mean sick YOLO plays and made out like a bandit.", "score": 30, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "oh no the economy's crashing aND I'M RICH!!!!", "score": 7, "replies": []}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Seriously. Only like 1/3 of my account is invested rn cause I’m waiting to go balls deep on a dip, but I could also see us running up 10% on hopes and dreams, everybody forgetting about a potential recession, and then there’s a huge drop.", "score": 10, "replies": [{"body": "That'll exactly happen, probably. Trump shuts up for a month, China occupied with Hong Kong for a short while, stock lifts briefly, then BAM. S&P 500 down 8% overnight, then 15%, then 30% over the course of a few weeks. Then the aftermath: stock prices rebounding, slapping our ass cheeks like a hookers bullwhip.", "score": 15, "replies": []}]}]}, {"body": ">mainly because I want to take advantage of a recession and I'm impatient.\n\nWhich is code for \"My balls are turning blue and I want to masturbate to the losses now\"", "score": 2, "replies": [{"body": "TBH I have a moderate level of hatred towards the boomer population and it might be interesting see their retirement accounts get wiped out (shout out to GE)", "score": 5, "replies": [{"body": "You just made me realize why the fed won’t let that happen even if they have to do a bunch of QE.", "score": 1, "replies": []}]}]}]}, {"body": "It’s not that fucking bad. I work at an investment shop and the losses we’re seeing are nothing. I was sorting through some old docs left behind in my office and found some old 08 statements. When you see an account start with 10MM and end up with 6MM from balanced investing- that’s when shit’s bad.", "score": 22, "replies": [{"body": "That’s nothing compare to our -99% loss here at WSB. 40% loss is Rookie level", "score": 17, "replies": [{"body": "40% from 60/40 spy investing is what makes it impressively bad. WSB style you’d be short puts and well over 100% in the red", "score": 6, "replies": []}, {"body": "40% loss \n\n>from balanced investing\n\nwsb has the advantage of never doing balanced investing.", "score": 4, "replies": [{"body": "I do no in my retirement account, but not in my fun money", "score": 1, "replies": []}]}]}, {"body": "The losses we're going through right now, aren't so bad, I agree. But the inevitable recession hasn't hit yet, so... This is a windy day, the day before the storm.", "score": 1, "replies": [{"body": "> But the inevitable recession hasn't hit yet\n\nSame claim different month/year", "score": 6, "replies": []}, {"body": "This recession is likely going to be a lot more mild. You have no idea what you’re talking about", "score": 5, "replies": [{"body": "I think ‘08 had a crazy impact on how reactionary/ scared people are of the next ‘recession.’ Especially if you were a kid then and it seemed like the world was falling apart.", "score": 2, "replies": [{"body": "I was a teenager and my life didn’t change much at all.", "score": 2, "replies": []}]}]}]}]}, {"body": "If the current market is like watching family die. I'm making a small killing", "score": 17, "replies": []}, {"body": "Exactly and you're making side bets with your cousins about when grandma is going to die.", "score": 30, "replies": [{"body": "Short Grandma.\n\nEdit: thank you for the silver! 🤗", "score": 20, "replies": []}, {"body": "And when grandma coughs you celebrate", "score": 3, "replies": []}]}, {"body": "Money is just paper. Family members are not paper. I don’t think it’s the same", "score": 95, "replies": [{"body": "If money is just paper, then my pet pig Spam is just a porkchop", "score": 54, "replies": [{"body": "A walking porkchop", "score": 28, "replies": []}, {"body": "Pepa? What are you doing in my stock portfolio?", "score": 13, "replies": [{"body": "Short $PEPA", "score": 2, "replies": []}]}, {"body": "With that logic, money is just spam?", "score": 1, "replies": []}]}, {"body": "I’ll paraphrase the philosopher, Jaden Smith, and ask you: how can paper family members be real if our eyes aren’t real?", "score": 16, "replies": [{"body": "The very cryptic philosopher would say the same way a mirror cannot be real", "score": 4, "replies": []}]}, {"body": "Money is a simulation. People are simulations. YOU are a simulation.", "score": 5, "replies": [{"body": "I wish my simulator programed me to make more simulated money.", "score": 9, "replies": [{"body": "Simulation stimulation?\n\n\nNice.", "score": 4, "replies": []}, {"body": "Lmao", "score": 1, "replies": []}]}, {"body": "ALERT. ALERT. CRITICAL INFORMATION BREACH DETECTED. ERASING SYSTEM ONLINE.", "score": 2, "replies": []}]}, {"body": "You’re right, it’s much easier to manipulate one than the other.", "score": 3, "replies": []}, {"body": "I wanted to write \"You're right, money is much more important\", but I'm just not enough of an asshole to do it. So, instead, I wrote this meta post so I could still get credit for the joke.", "score": 6, "replies": [{"body": "Everyone writes way worse stuff. You can’t be sensitive and offended by internet posts lmao", "score": 6, "replies": [{"body": "It's not an original thought, but I do think that that mindset (brought on by the internet's anonymity, particularly back in the day) has led to some of the more public toxicity we see nowadays.", "score": 2, "replies": []}]}]}, {"body": "That’s why he said it’s “like”, not “is”, jerk", "score": 2, "replies": [{"body": "Hahaha lmao", "score": 1, "replies": []}]}, {"body": "> Money is just paper \n\nCorrect.\n\n> Family members are not paper \n\nAlso correct.\n\n> I don’t think it’s the same \n\nIncorrect. They're both the same because they are both made of atoms. \n\nAlso, on the contrary, money can buy happiness, where as a dying family member may cause sadness.", "score": 3, "replies": []}]}, {"body": "$SPY to 350 confirmed. It’s like the family member just woke up from their coma and got a new heart and started tap dancing all over your depressing post.", "score": 34, "replies": []}, {"body": "Get your margins ready!", "score": 13, "replies": []}, {"body": "Great, you guys want a recession we will probably end up with a depression.", "score": 11, "replies": [{"body": "just buy the fuckeen dip man", "score": 5, "replies": []}]}, {"body": "I'd rather a crash happen now so my parents would be back to even in 5-ish years when they retire.\n\nIt's going to happen eventually, and calling up banks to inject liquidity while we're not even 5% from ATH is going to make it worse when it inevitably comes down.", "score": 8, "replies": [{"body": "My parents are pretty much in the same boat. It's crazy that a whole generation of people may have to work an extra 5 to 10 years, to have the same amount of money as they do right now, because Trump started a trade war and Europe is politically a mess right now.", "score": 5, "replies": []}]}, {"body": "The news has been begging the economy for a recession for months now.", "score": 11, "replies": [{"body": "You mean years", "score": 9, "replies": []}]}, {"body": "Can’t wait to buy some stocks cheap", "score": 6, "replies": []}, {"body": "Too bad it probably won’t happen till late 2020-early 2021.", "score": 6, "replies": []}, {"body": "There's posts like this bi monthly. Every 7 years or so someone is right though.", "score": 10, "replies": []}, {"body": "It's like waiting for a family member to die so you can cash out on their life insurance you yoloed on before it runs out", "score": 3, "replies": []}, {"body": "Autistic DD, I'm buying calls\n\nhttps://twitter.com/CitronResearch/status/1162374567135834113", "score": 3, "replies": []}, {"body": "A little, except I would never bet money on a family members death, whereas Imma load up on inverse ETFs soon.", "score": 3, "replies": []}, {"body": "Dude just flip your monitor and buy in short and it's like the exact same.", "score": 2, "replies": []}, {"body": "Yeah except i can't buy puts on my uncle dying, so your post is officially gay as all fuck.", "score": 2, "replies": []}, {"body": "This is going to be a long painful drawn-out death.  It's going to be something like this: \n\nhttps://www.youtube.com/watch?v=rxZXptGpXng", "score": 2, "replies": []}, {"body": "“We knew it was coming. We started preparing for it early and we are just happy it’s over”", "score": 1, "replies": []}, {"body": "It's never that easy", "score": 1, "replies": []}, {"body": "and maybe you'll get some inheritance at the end? Tendies in every situation.", "score": 1, "replies": []}, {"body": "In this economy, what goes up stays up.", "score": 1, "replies": []}, {"body": "All these armchair economists lol.  I hope this is the bottom and it just continues up from here.", "score": 1, "replies": []}, {"body": "I hope it happens before jan 17.", "score": 1, "replies": []}, {"body": "Overreacting", "score": 1, "replies": []}, {"body": "Why are you sad?  Puts on cash bonfire companies are priced like they'll all become the next IBM right now.", "score": 1, "replies": []}, {"body": "How old were you in 2008?", "score": 1, "replies": []}, {"body": "What will be YOUR actions when the recession actually happens?", "score": 1, "replies": [{"body": "I've already slowed down what I'm investing in preparation. When it hits, whatever money I lose, I lose. While keeping my stocks I already have, I won't invest new money for a quarter, because prices are going to consistently drop for a few months, up to a year, depending how bad the recession is. When I believe the market is not too far away from rising again, I'll begin buying new stock on the cheap, even if they lose more money. When stocks do rise, I'll hopefully recover most of my losses, maybe even make more money than I would've if they didn't fall in the first place.", "score": 1, "replies": []}]}]}
