{"title": "$DIS Oct/18/2019 $155 call", "selftext": "So the other day I bought 18 calls at a $2.06 premium. Currently the premium is around $0.69. Im just worried that the premium has dropped so much that the chance of recovering is small. So should I cut my losses or hold out?", "id": "cn8iam", "created_utc": 1565197626.0, "score": 69, "upvote_ratio": 0.87, "num_comments": 81, "comments": [{"body": "Wallstreetbets would love you", "score": 227, "replies": [{"body": "Indeed we would! Come over an chat OP.", "score": 44, "replies": []}, {"body": "We'll take him- keep your candy ass over here", "score": 24, "replies": []}, {"body": "It’s only a loss if you sell.", "score": 20, "replies": []}, {"body": "Ha\n\nHaha\n\nHahaha", "score": 25, "replies": []}, {"body": "No. Option is too far out. We prefer weeklies and zero days.", "score": 13, "replies": []}, {"body": "Isn't it a bit early for fall rush?", "score": 6, "replies": []}, {"body": "Bring those sexy screenshots so I can nut", "score": 5, "replies": []}, {"body": "Seems like he as enough autism for us, send him right over.", "score": 6, "replies": []}]}, {"body": "Would you purchase this option right now for $.69? If yes then hold, if not then sell. Your loss is a sunk cost so no reason to think about it.", "score": 51, "replies": [{"body": "Great perspective.", "score": 18, "replies": []}]}, {"body": "You could turn it into a calendar/diagonal play and start selling calls against it to reduce the cost basis of your position.  \n\nLike most here have said you should have had an exit strategy going into the trade.  You should also see now why directional earnings trades are very tough to pull off.  You also bought insanely inflated premium so you would have needed a significant beat, any bad news or neutral movement is a loss.", "score": 22, "replies": [{"body": "not enough premium,  my guy. $0.33 for 155C sep 27 expiry. He can wait until next friday to see if the stock moves up, then he can get additional premium for either calendar  or credit spreads. \n\nto recover premium, he has to sell like 145C or 150C, which kind of puts him at additional risk. My suggestion, hold till 45DTE (like end of August) and see where the stock is and cut the losses then. \n\nRight now Theta is low, vega is low due to ER.", "score": 4, "replies": [{"body": "He's currently holding .69c worth of risk on a 6 delta long while market vol is relatively high.  Odds are he loses it all barring some insane buy pressure, which I would say is unlikely given current market conditions.  He could sell the sept 13th for .22 or .24 and take around a 3rd of the risk off the table.  His only additional risk would be a spike up past his strikes so that he couldnt let his short expire and still recover value from the long.  Given .06 delta at a 21 vix, my money is on the hedge instead of hoping for a 2 std dev move.\n\nOr he should just sell, its not really a good place to be.  Hoping for a large move in your favor isnt exactly trading.", "score": 2, "replies": []}, {"body": "This guy gets it.", "score": 2, "replies": [{"body": "> not enough premium, my guy. $0.33 for 155C sep 27 expiry. He can wait until next friday to see if the stock moves up, then he can get additional premium for either calendar or credit spreads.\n> \n> to recover premium, he has to sell like 145C or 150C, which kind of puts him at additional risk. My suggestion, hold till 45DTE (like end of August) and see where the stock is and cut the losses then.\n> \n> Right now Theta is low, vega is low due to ER.\n\nbeen there, done that..*looks at several bad trades*", "score": 1, "replies": []}]}]}]}, {"body": "Wait it out, you got 2+ months for it to go up. Won't make any money if you sell at a loss.", "score": 38, "replies": [{"body": "Wont lose any less if he doesnt protect his remaining capital, though. Opportunity cost also should be considered, he could use the proceeds from the recovery sale to fund profitable trades in the 2 months instead of carrying significant neg theta", "score": 19, "replies": [{"body": "Ya maybe I’ll give it a week and see if it recovers some. Theta over a week shouldn’t be to bad.", "score": 3, "replies": [{"body": "Never buy right after a major run-up, or sell after a major dip. \n\nI got caught out in that to, on Oct 18 145 calls. The macro picture could work against us and the slow integration of Fox is vexing. But the fundamentals of Disney are no worse than last month and there will likely be a rush to get in ahead of the November Disney+ launch.\n\nWall Street is just too short-term focused and had been heaping unrealistic expectations on Disney, which they - in turn - didn't live up to. \n\nDisney doesn't give guidance. So Wall St ballparks it.\n\nPersonally, I'm holding my January calls and looking to get out of the Sept calls when the premium rebounds a bit.", "score": 11, "replies": []}, {"body": "Yeah, but Vega is gonna be a bitch", "score": 2, "replies": []}]}]}]}, {"body": "I’m holding mine. 9/20 $145 call. Today sucked. Last night sucked. Purchased for 3.44 average. Now they’re 1.17", "score": 10, "replies": [{"body": "Ya the most annoying part is that I was up 35% before close yesterday and I normally would sell. I held off thinking I was going to make some easy money. 😂😂", "score": 3, "replies": [{"body": "Yeah man! I was up like $400 at close because it sky rocketed. I contemplated selling.. but was damn sure Disney was going to kill it. Guess not :/ rip my 5 calls. But hopefully we get a turn around.", "score": 3, "replies": []}, {"body": "Up $200 at close, and closed... then bought bidu calls", "score": 1, "replies": []}]}, {"body": "I have those too.. Had done a calendar spread before earnings yesterday.", "score": 1, "replies": []}]}, {"body": "It's important to set levels before trading with options.  It is very possible to lose 100% if you run your trade like a deer in the headlights.", "score": 7, "replies": []}, {"body": "Yeah you should sell", "score": 6, "replies": []}, {"body": "In other words you bought a 155 call before Disney's earnings and since then DIS has plunged to 135.\n\nYou made a directional bet against earnings and lost. Time decay will now just eat your 70 cents away so sell and ponder.", "score": 8, "replies": [{"body": "So you don’t think it’s worth waiting a week for it to potentially bounce back 30-40%? Theta burn shouldn’t be that bad over a week.", "score": 2, "replies": [{"body": "Why do you expect it to bounce back that much?", "score": 4, "replies": [{"body": "Because it’s oversold, there’s more good news than bad. The issue is the macro situation. If China hadn’t dumped it’s currency this would all look very different.", "score": 3, "replies": [{"body": "What does China’s currency manipulation have to do with a huge earnings miss?", "score": 6, "replies": [{"body": "It wasn’t a “huge” earnings miss, but in an environment with a better macro outlook you would see Disney recover pretty quickly I think, add in the hype coming for Disney + and OP’s position probably looks much better in the next week or two.", "score": -1, "replies": []}]}, {"body": "didn't disney miss estimates? that's not a macro situation", "score": 2, "replies": []}]}]}, {"body": "No, because it is just as likely to lose another 30 or 40%, and maybe more likely given Disney's earnings report. \n\nIt doesn't really matter much, but generally, if I have a concrete reason for making a trade, and that passes with no results, I get out of the trade and get closure. Staying in is just making a new bet that is based more on hope than analysis. Take your loss, reload, and find a new opportunity.", "score": 3, "replies": []}]}]}, {"body": "Never buy options into earnings.\n\n**By buying options, you're betting on the price to move in a certain direction, by a certain magnitude, by a certain timeframe. That's 3 different dimensions that have to line up for your options to be worth more than what you paid.**\n\nIf you get the direction wrong, then they become worthless. If you get the timeframe wrong, they decay and are worthless. If you get the magnitude wrong, the volatility contracts and they become worthless.\n\nNever buy options into earnings.\n\nOptions are derivatives. They're tools to manage risk and hedge positions. They are not primary trading vehicles. That's why they have so many factors leading to large price swings. You *can* trade them and make money but you really need to understand how they work before you get involved.\n\nUnfortunately you were wrong about the direction here, and combined with the volatility decrease they lost a lot of value. With 2 months left, even if the price rebounds wildly, you're unlikely to make up the extrinsic premium you paid for and they will keep decaying every day.\n\nNever buy options into earnings, unless you *absolutely* know what you're doing.", "score": 6, "replies": [{"body": "Oh c'mon. This advice is way too strong. Do you really have to yell at OP (in bold) to make your point.\n\nA lot of traders, including me, do strangles on earnings (I have done them for more than 10 years) and that involves buying two options, not just one.\n\nAnd options are primary trading vehicles for a small army of traders and institutional investors. To actually work for hedging there has to be speculator on the other side of the trade.\n\nUltimately you drop the \"never\" advice and give better advice ... it helps to know what you are doing. That's certainly true. But never? In bold?", "score": 0, "replies": [{"body": "CAPS is usually yelling on the internet, bold is just to make an emphasis. \n\nAnd emphasis is the point of the comment. I focused on being simple and informative because most new traders lose 99% time when they buy options into earnings. The \"if you know what you're doing\" part applies to anything in life, but in this case the OP clearly isn't as experienced so I saved that until the end.\n\nIf you have different advice then go ahead, although I wouldn't recommend strangles either.", "score": 1, "replies": []}]}]}, {"body": "Buy more to average down.", "score": 3, "replies": []}, {"body": "LOL", "score": 5, "replies": []}, {"body": "If you’re wanting to hold it at least sell some 160s against it and collect that premium", "score": 2, "replies": []}, {"body": "Sell them and buy November calls with the money.\n\nWhat's happening before October that you think it goes up?", "score": 2, "replies": [{"body": "I just think it’s oversold and it will pop back up to $140-145 over the next week.", "score": 1, "replies": []}]}, {"body": "wait until next friday to see if the stock moves up, then he can get additional premium for either cal or credit spreads.\n\nto recover premium, he has to sell like 145C or 150C, which kind of puts him at additional risk. My suggestion, hold till 45DTE (like end of August) and see where the stock is and cut the losses then.\n\nRight now Theta is low, vega is low due to ER.", "score": 2, "replies": []}, {"body": "You’re down over 50% rn. Idk how much you are willing to lose on the trade. But 50% down is a decent amount of red", "score": 3, "replies": []}, {"body": "I approach options like I approach a casino.  I go in there knowing the amount of money I am bringing with me will be lost.  I need to be comfortable with that.  How much that money is really depends on your own personal risk tolerance.\n\nIf you feel like you have a low risk tolerance, take the loss and go.  If you are worried about losing this amount of money already, your risk tolerance is a bit lower than the investment you’ve made.", "score": 4, "replies": []}, {"body": "157 is a lofty target now.", "score": 2, "replies": [{"body": "Ya I agree, I’m just trying to decide if it will go up to $140 over the next week or so and I can pull out with most my money back.", "score": 0, "replies": [{"body": "You will probably not get most of your money back. even if it goes to 140. Only part of the lost money is due to price movement. most was due to anticipation of earnings.\n\nAt two months out, that price will start dropping with regularity as we get closer to expiration.\n\nPeople sell things like this because they generally expire worthless.\n\nIMHO, you should do one of these:\n\n1. sell, take your loss, rejoice in having a capital loss tax deduction, invest in something else, but with more research about the risks.\n\n2. Gird your loins, pray that something magical and unexpected happens in DIS within the next two months, and prepare yourself for a total loss if it doesn’t work out. It’s not impossible, just not probable.", "score": 5, "replies": [{"body": "Love the help. Ya this is probably my last option buy going into earnings.", "score": 1, "replies": [{"body": "You don’t need to quit, you just need to realize that it’s essentially gambling. \n\nGambling can be fun, but the house tends to win.\n\nI’ve found that options are more likely to profit for you when you do things like sell cash secured puts or covered calls on stocks you intend to buy or sell anyway.  This is essentially making you “the house” \n\nfor example, let’s take your opinion that Disney was going to rocket up in value. You could have sold a put at the same date and you would end up with one of the following:\n\n1. Disney drops and stays down and you end up owning disney at a discount to the price you wanted to pay to own it.(A win, even if you’re technically underwater)\n\n2. Disney rockets up and you get to keep the premium.\n\nThe downside is that to sell puts, you’ll need real money in your account to actually buy the DIS you are selling the put against OR you’ll need to also buy puts below your price, which BTW is still just gambling - just slightly more complicated gambling.\n\n FYI, FWIW... I also believe Disney will rise, just not that quickly, and global economic issues may also interfere", "score": 5, "replies": []}]}]}]}]}, {"body": "Hold hold hold!!!!", "score": 1, "replies": []}, {"body": "Still a good amount of time on them. DIs streaming positive catalyst coming. You could avg down when it holds reversal and then sell them later. But that is more risk to a busted trade.", "score": 1, "replies": []}, {"body": "$0.69??? Sell me your calls right now.", "score": 1, "replies": []}, {"body": "If you hadn't bought it already would you buy it right now for 0.69 and think it was a great trade setup? If the answer is no, get out.", "score": 1, "replies": []}, {"body": "looks like IV crush got you. :\\*", "score": 1, "replies": []}, {"body": "You lost your bet. The $0.69 is just a rebate for playing. There is almost ZERO chance $DIS will > $157.06 on October 18, 2019. So, what's they play? Sell it now and if you still love the mouse then open a new bet around $140.", "score": 1, "replies": []}, {"body": "Maybe think about selling the 160s or 165s against it and protecting yourself a little in the future? Especially with premiums that high?\n\nIf you are sweating your position this much, that tells me something. Vertical spreads might help calm your mind in the future.", "score": 1, "replies": []}, {"body": "If the s&p recovers, you should be fine. If it doesnt, then you have zero chance.", "score": 1, "replies": []}, {"body": "Hold it man. They are strong. Coming out with online streaming. New movies in pipeline. And i think this bs trade war will end. Patience", "score": 1, "replies": []}, {"body": "You could sell a shorter dated $155 call to mitigate the theta damage but yeah it’s not looking pretty.", "score": 1, "replies": []}, {"body": "I just bought 70 calls today of Disney. $22,000 total. 136$ strike price though. $2.30 each. I sure hope it goes up to your strike price!", "score": 1, "replies": [{"body": "You sold me, buying those in the morning", "score": 1, "replies": [{"body": "Just sold. Made $6k", "score": 2, "replies": [{"body": "Ya I didn’t buy in time. It had already doubled.", "score": 1, "replies": [{"body": "I didn’t sell in time. Was up $9k at one point", "score": 1, "replies": []}]}]}]}]}, {"body": "I'd cut my losses and just move onto another trade\n\n&#x200B;\n\nbut maybe some crazy D23 announcement can save you a bit?", "score": 1, "replies": [{"body": "or maybe Iger will push his retirement to 2023\n\nbut hopes and dreams is not a plan", "score": 1, "replies": []}]}, {"body": "IV crush nigga. Hope you learned your lesson buying a huge premium right before earnings. You gambled and lost now time to deal with it like a man and learn from your mistakes.", "score": 1, "replies": []}, {"body": "Average down by buying more calls.", "score": 1, "replies": []}, {"body": "Sell. Lucky DIS is liquid...", "score": 1, "replies": []}, {"body": "Some solid autist advice here - hold the dang option, you probably won’t get itm but still end up with only a 20% loss. \n\nOr you might loose all, but that’s just the option lifestyle.\n\nStart posting in wsb, that’s where the real autists live.", "score": 1, "replies": []}, {"body": "Double down...I mean average down. It’s what the pros do.", "score": -2, "replies": []}, {"body": "Double down. \n\nAt least that's what I would do.", "score": -2, "replies": []}, {"body": "Implied volatility crush is why you should never be long options through a binary event. Sell them instead to collect the premium from the crush", "score": 0, "replies": []}, {"body": "What does your trading plan dictate you do?", "score": -6, "replies": []}, {"body": "Why buy a call when you can just hold stock?", "score": -6, "replies": [{"body": "[removed]", "score": 7, "replies": [{"body": "Well it was 1,800 shares which would cost me $243,000. Which I could do if I wanted to sell a bunch of stock and replace it with DIS. But I don’t want to. I like buying $3-5k worth of options and making 20-30%. This one didn’t really work out.", "score": 2, "replies": []}]}]}]}
{"title": "Tug of War between china and us -who’s going to be the one who break?", "selftext": " Will this time (be the third in number) remember as the  Bears winning number?  [Flash Crash Moves is about to come again to the markets](https://www.daytrade-profit.com/2019/08/tug-of-war-between-china-and-us-whos.html)", "id": "cn2vju", "created_utc": 1565164421.0, "score": 38, "upvote_ratio": 0.88, "num_comments": 88, "comments": [{"body": "I mean, that depends right? China has to stay alive for another year, if Trump fails to get re-elected then there's a clear winner. But if Trump wins the re-election then I without a doubt expects China to agree to a deal the next day.", "score": 43, "replies": [{"body": "I believe Trump wants to keep these negotiations because it could make people vote for him next elections.", "score": 15, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.0510  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/62868)", "score": 2, "replies": [{"body": "We're talking about the economy - it's all net interests and money\nMy friend", "score": 2, "replies": []}]}, {"body": "Such a strategy", "score": 1, "replies": []}]}, {"body": "We all know Russia is going to meddle in our elections, now would China counter their meddling? Is democracy still alive?!", "score": 15, "replies": [{"body": "Since when has the US been a true democracy? Only 60% of the eligible population even votes, 40% during midterms(!). You can’t kill something that didn’t actually exist in the first place.", "score": 6, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.8912  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/01969)", "score": 3, "replies": []}, {"body": "> between lobbying and low vote turn out, idk if it ever existed.\n> Well I suppose our \"enemies\" have figured a good way to get who they want elected\n\nDemocracy under the guise of a tyrannical rule\nThat's the way it is almost all over the world\nEverything is as if possible and seems open and accessible, but it's not like that", "score": 1, "replies": []}, {"body": "Chinese meddling is a bigger deal than Russian meddling but the previous poster chugged the kool aid.", "score": 0, "replies": [{"body": "Edit: Reddit is nothing without its mods and user content!  Be mindful you make it work and are the product.", "score": 3, "replies": []}]}]}, {"body": "The supreme court has made it clear foreign meddling is acceptable.", "score": 1, "replies": []}, {"body": "Humans need to be controlled by another level they tend to do nonsense lol", "score": 1, "replies": []}]}, {"body": "Some say that no agreement will be signed until the election... lest see what will happen in September", "score": 1, "replies": []}, {"body": "I think you are right. China just needs to stay alive 1 more year. They are going to try to keep things under control as much as possible until then. Trump will try to put  pressure on the Chinese financial markets to get them to break. I think Trump is going max pressure into the end of the year due to capital flight being a major concern for China. Capital flight becomes less problematic after the year end because of the deadline for citizens to cash out their yuan is December 31st. After January 1st, Trump is going to lay off China and take off all tariffs.", "score": -5, "replies": []}]}, {"body": "No one. \n\nNeither side can be seen as the one who \"breaks\", so this will continue until they can reach an agreement where both sides can appear to their home audience as having come out on top.\n\nBut then, absurdly, even after an agreement has been made, Trump will take to Twitter to resume the war if Fox News puts someone on who claims Trump didn't win.\n\n I don't expect this to end until he's out of office.", "score": 21, "replies": [{"body": "Both sides will lose and both sides will claim victory.", "score": 13, "replies": []}]}, {"body": "China. The US economy is built on more than just building real estate. If they lose their biggest client they lose everything.  Expect concession soon, their move to ban purchases of agricultural products was designed to hurt “Trump voters” not the US economy, and it reeked of desperation.", "score": 23, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "> I don't agree that it reeks of desperation, but it is definitely a direct \"fuck you\" to Trump. Getting other countries to buy US agricultural products has been a major point in all of the various trade war negotiations up til now. It was one of the only beneficial parts of renegotiating NAFTA, and I'm sure it will be part of EU negotiations should those ever actually happen.\n\nTake advantage and throw away, it doesn't work that way anymore\nThe Chinese Dwarf is no longer a Dwarf, so removing the cap is not enough", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That's pretty simple friend\nWill this time be like the previous 2 times that the metrics came back up and created new highs or this time it won't hold water and markets will come back down", "score": 1, "replies": []}]}]}]}, {"body": "\\> Expect concession soon\n\nThis is what Navarro said the day the first tariffs were put in place, lol.  Nobody has been that wrong since Cheney thought we would be greeted as liberators.  The monetary costs of this trade war will eventually be in the trillions.\n\n[https://video.foxbusiness.com/v/5743778657001/](https://video.foxbusiness.com/v/5743778657001/)\n\nThe other main issue, having worked and traveled in China quite a bit, saving face is very important to Chinese culture.  Resisting the USA has become a patriotic duty for Chinese citizens.", "score": 2, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.7061  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/68427)", "score": 2, "replies": [{"body": "I agree.  I mean, it goes on here too. Just look at how Americans can be propagandized to not only suffer but to cheer the suffering of others in the health care debate.  The general population can always be brought in line with the governments goals, even if people do have a voice.  Make up an enemy and accuse them of the crimes you're guilty of. It's a tried and true technique.\n\n\\> We've heard about a few riots in China mainland a few times already. I\n\nIt's crazy that really since Vietnam, the USA has killed hundreds of thousands of people, displaced millions more, and caused trillions in property damage to push Democracy, only to stand quiet while riots are happening in Hong Kong. I guess all those people died for nothing.", "score": 1, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.2975  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/35652)", "score": 2, "replies": [{"body": "\\>I’d like to point out that it’s language and talk like this that divides us\n\nYeah , but don't you think that putting words in peoples mouth like \"you merely accuse half the country as being merely deluded by propaganda\", also divides us?  I didn't actually say that. (nice technique though)\n\nI said we are propagandized to accept our own suffering (for the good of the country, capitalism, etc), and cheer the suffering of others.  (immigrants, or liberals cheering suffering farmers).\n\nThat doesn't mean we all do it, or that 1/2 the county is deluded by propaganda.  50% being deluded by propaganda would be an authoritarian dream that has probably never been achieved.  It actually takes way less.  \n\nSow confusion with lies,  it creates doubt which causes inaction or disbelief by enough good people, they'll just go about their life and keep doing what their doing to pay their bills and get by.  This is why calling everything a \"hoax\", \"fake news\", is so important for conservatives, along with all the conspiracy theories like Q, it sows enough confusion in the regular populace they just throw up their hands and forget the USA is holding filthy toddlers in cages because \"How can we be so sure about this?  Isn't this cortez lady a lying socialist?  I heard she took a10 million from netflix. \"", "score": 1, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.4156  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/02479)", "score": 1, "replies": [{"body": "So funny it's sad that it's true", "score": 1, "replies": []}, {"body": "\\> SHE IS. Her campaign manager came out and said it was about socialism not the environment. What a joke.\n\nLol, well, thanks for proving my point at least.  That is hilarious. I know Cortez is the conservative incel heart throb right now but wow, you even follow her campaign manager. That is dedication my friend!\n\n\\>\"no only some of you are deluded retards, the rest of you are just retards who follow along\".\n\nSo, typically, you use quotation marks to quote something someone said verbatim.  I didn't actually say that, so, no need to use quotes.  Do you deny that media, corporations, government lie to people to sway public opinion and that it works really well? I mean, if you're that naive I can't help you man. Good luck with.", "score": 0, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.2809  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/19839)", "score": 2, "replies": []}]}]}, {"body": "> ’d like to point out that it’s language and talk like this that divides us\n> Yeah , but don't you think that putting words in peoples mouth like \"you merely accuse half the country as being merely deluded by propaganda\", also divides us?  I didn't actually say that. (nice technique though)\n> I said we are propagandized to accept our own suffering (for the good of the country, capitalism, etc), and cheer the suffering of others.  (immigrants, or liberals cheering suffering farmers).\n> That doesn't mean we all do it, or that 1/2 the county is deluded by propaganda.  50% being deluded by propaganda would be an authoritarian dream that has probably never been achieved.  It actually takes way less.\n> Sow confusion with lies,  it creates doubt which causes inaction or disbelief by enough good people, they'll just go about their life and keep doing what their doing to pay their bills and get by.  This is why calling everything a \"hoax\", \"fake news\", is so important for conservatives, along with all the conspiracy theories like Q, it sows enough confusion in the regular populace they just throw up their hands and forget the USA is holding filthy toddlers in cages because \"How can we be so sure about this?  Isn't this cortez lady a lying socialist?  I heard she took a10 million from netflix. \"\n\nThey are capitalists who are looking to take their grains and gluttony insatiable", "score": 1, "replies": []}]}]}, {"body": "> The Chinese are not considered \"nice\" to say the least Human rights in them is not something to tell friends about\n\nThe Chinese are not considered \"nice\" to say the least Human rights in them is not something to tell friends about", "score": 1, "replies": []}]}, {"body": "> I think people underestimate the willingness of the Chinese to let their own people suffer to accomplish an over arching goal.\n\nThe Chinese are not considered \"nice\" to say the least\nHuman rights in them is not something to tell friends about", "score": 1, "replies": []}, {"body": "China goes into great depression, citizens back the government and patriotic.  US flat screen TVs tick up slightly, temporarily.  \"We lost the tariff war, worst idea ever!\"", "score": 1, "replies": []}]}]}, {"body": "Trump just needs to siphon the tariff revenue to the farmers. China definitely needs US consumer to buy trash.", "score": 3, "replies": [{"body": "China is doing this perfectly the u.s not so much at the ccurrent time", "score": -7, "replies": []}]}, {"body": "> China. The US economy is built on more than just building real estate. If they lose their biggest client they lose everything.  Expect concession soon, their move to ban purchases of agricultural products was designed to hurt “Trump voters” not the US economy, and it reeked of desperation.\n\nTake advantage and throw away, it doesn't work that way anymore\nThe Chinese Dwarf is no longer a Dwarf, so removing the cap is not enough", "score": 1, "replies": [{"body": "What Chinese adage are you referencing?  Because taking advantage and throwing someone away is how it’s always been done and how it always will be done. China is experiencing that painful reality now.", "score": 1, "replies": [{"body": "> What Chinese adage are you referencing? Because taking advantage and throwing someone away is how it’s always been done and how it always will be done. China is experiencing that painful reality now.\n\nThe American giant raised a Chinese dwarf to build it cheaply but the cocoon rose to create what I meant\n but on the other hand  us  debt is  hold by china  so the situation is not simple", "score": 1, "replies": []}]}]}, {"body": "You know they could either dump fed bonds or, worse, settle oil contracts in Yuan and doing either would be enough to severely damage / sink your economy / currency, right?\n\nThey aren't reacting at the moment because they don't have to. The US tax payer is paying for most of these tariffs.", "score": 0, "replies": [{"body": "All the USA would have to do is slap sanctions on the Chinese big 4 banks. All business men in China do their business in USD, restricting the flow of dollars into China would weaken their currency significantly and probably cause a recession in Asia.", "score": 10, "replies": [{"body": "You mean the 4 big banks transacting the monthly US debt purchases?\n\nYeah...ok. It’s clear you don’t really have any understanding of the causal relationships these things have.", "score": 4, "replies": []}]}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.3178  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/08832)", "score": 1, "replies": []}, {"body": "> You know they could either dump fed bonds or, worse, settle oil contracts in Yuan and doing either would be enough to severely damage / sink your economy / currency, right?\n\nAnd then it will hurt, too, where no one comes out clean of the story in my opinion", "score": 1, "replies": []}, {"body": "Dumping the fed bonds is not a card they can play. It will have no effect. The US balance sheet is strong enough to easily absorb all the Fed Bonds China has. They have purchased more US Treasurys than China currently owns during QE phases in the past.", "score": 1, "replies": []}]}]}, {"body": "I think that Americans, in general, have a very inflated opinion on how much this is effecting the Chinese economy.  I’m an American living in China and I see cities full of building cranes every day on my way to work.  China is not starving. There is very little pressure for them to act right now. The most important fact, though, is that they stand to lose way more by giving in to US trade demands. They know they have 5 years, at the most, to hold out.  The party does not have to answer to it’s citizens in the same way that the US does.  \n\nI don’t see any scenario where China capitulates to Trump’s demands. He is using all stick and no carrot. They would have to get some type of “win”  for any of this to move forward. Trump doesn’t seem willing to give anything at all.", "score": 15, "replies": [{"body": "Ohh you see building cranes. Case closed.", "score": 13, "replies": []}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.2233  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/71048)", "score": 1, "replies": [{"body": "I think that major manufacturers were already looking to exit and I don’t think that a trade deal is going to save that.  Wages have skyrocketed in China over the last 20 years. They need to figure out a way to transition away from the cheap labor that they were once known for.  South Korea is a great example of the direction that China needs to go. A trade deal that handcuffs their “innovation” could kill that move before it really gets started.", "score": 1, "replies": []}]}, {"body": ">I think that Americans, in general, have a very inflated opinion on how much this is effecting the Chinese economy.\n\nThis is nationalist propaganda being spread by a few sources.", "score": 1, "replies": [{"body": "Just to clarify.... my statement was the propaganda, or American opinions on the Chinese economy is the propaganda?", "score": 1, "replies": []}]}, {"body": "> I think that Americans, in general, have a very inflated opinion on how much this is effecting the Chinese economy.  I’m an American living in China and I see cities full of building cranes every day on my way to work.  China is not starving. There is very little pressure for them to act right now. The most important fact, though, is that they stand to lose way more by giving in to US trade demands. They know they have 5 years, at the most, to hold out.  The party does not have to answer to it’s citizens in the same way that the US does.I don’t see any scenario where China capitulates to Trump’s demands. He is using all stick and no carrot. They would have to get some type of “win”  for any of this to move forward. Trump doesn’t seem willing to give anything at all.\n> ReplyGive AwardsharereportSave\n\nTake advantage and throw away, it doesn't work that way anymore\nThe Chinese Dwarf is no longer a Dwarf, so removing the cap is not enough\n\nAlso, the Chinese are not considered \"nice\" to say the least\nHuman rights in them is not something to tell friends about", "score": 1, "replies": []}]}, {"body": "This will all be over before the next election. Trump will say \"We made a good deal\", media will say it was a bad deal (cause it probably will be) and then he will get reelected cause everyone is going to be happy to the the stockmarket fly up again. !remind me.", "score": 16, "replies": [{"body": "There is a situation that you are right and that will be the scenario", "score": 2, "replies": []}, {"body": "Perfect synopsis", "score": 3, "replies": [{"body": "Inb4 market crash cause i think this...", "score": 1, "replies": []}]}]}, {"body": "As long as Trump in not re-elected - which seems unlikely given his consistently terrible polling numbers - China will \"Win.\" However, a trade war is just straight bad policy and hurts everyone. The requests from the Trump administration are not something China is likely to cave to - they are basically requiring international oversight of China's  internal economic policy and trade policy. Would the U.S. ever agree to something similar? If your answer is no, then why do you think China would agree? I just don't understand why fiscal conservatives fail to understand that \"Free Market\" means you are free to cheat - China cheats better than we do and we want to punish them for it? Illogical. We can out compete China in 100 different ways (design, engineering, energy, green tech, financial tech, automotive, precision manufacturing) - but cheap labor and manufacturing capacity are not one of those ways. Honestly - Americans don't want to be paid $3.00 a day to make widgets by hand. The U.S. economy has outgrown that model and now we have to grapple with the fact that we didn't bother to invest in proper workforce education and new technology to replace those jobs. This is a all just evidence of a massive failure of government policy in the U.S.. China will have to deal with the same issues, albeit they are still probably 25 years away from transitioning their economy away from manufacturing.", "score": 2, "replies": [{"body": "> As long as Trump in not re-elected - which seems unlikely given his consistently terrible polling numbers - China will \"Win.\" However, a trade war is just straight bad policy and hurts everyone. The requests from the Trump administration are not something China is likely to cave to - they are basically requiring international oversight of China's  internal economic policy and trade policy. Would the U.S. ever agree to something similar? If your answer is no, then why do you think China would agree? I just don't understand why fiscal conservatives fail to understand that \"Free Market\" means you are free to cheat - China cheats better than we do and we want to punish them for it? Illogical. We can out compete China in 100 different ways (design, engineering, energy, green tech, financial tech, automotive, precision manufacturing) - but cheap labor and manufacturing capacity are not one of those ways. Honestly - Americans don't want to be paid $3.00 a day to make widgets by hand. The U.S. economy has outgrown that model and now we have to grapple with the fact that we didn't bother to invest in proper workforce education and new technology to replace those jobs. This is a all just evidence of a massive failure of government policy in the U.S.. China will have to deal with the same issues, albeit they are still probably 25 years away from transitioning their economy away from manufacturing.\n\nTake advantage and throw away, it doesn't work that way anymore\nThe Chinese Dwarf is no longer a Dwarf, so removing the cap is not enough", "score": 1, "replies": []}]}, {"body": "You need to remember that Trump is a bonafide retard who can barely read. \n\nHe will say literally anything that crosses his mind, rather than using strategy. Additionally, his promise to bring back billions to the US is extremely illogical and it's only effect will be the hindrance of US companies. It's strictly a ego play.\n\nTrump's agenda makes no sense.", "score": 1, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.9420  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/58729)", "score": 2, "replies": [{"body": "What jobs?  Manufacturing jobs?  Hate to break the news to you man, it's not going to happen.  Have you ever been on a modern factory floor?  It's 2 guys that know how to repair and service robots and a bunch of robots.\n\nPlus I think Americans prefer high property values to not being able to see 20 feet in front of them due to all the smoke put out by factories in China.", "score": 1, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.6810  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/35662)", "score": 1, "replies": [{"body": "\\>I've said this before. Its not just the jobs on the factory floor, its the sales/service/shipping/IT jobs\n\nGenerally all those jobs are in the USA.  All that is done on the mainland, and then you have China or whoever do circuit boards because they specialize in that.  You end up with the choice of 1. not being able to sell a product at all and going out of business or 2. staying in business.  Even you made the boards in the USA, your margins would have to be insanely high to justify it.\n\nThose are not middle-class jobs in China, those are sub minimum wage jobs that are slowing being automated by ML and AI  anyway.", "score": 1, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.4051  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/06774)", "score": 1, "replies": [{"body": "How are Chinese people going to be answering sales calls or visiting clients in America?  That is quite a commute. How are Chinese people going to do IT jobs for offices in America?  I think you're seriously confused.\n\n\\>if that company relies on underpaid 3rd world labour t\n\nYou were just saying those were middle class jobs. Lol get your story straight here. \n\nThere are cost of living and other cultural differences with China vs America along with supply chain, scale specializations, and location which make producing things in China desirable.  #1 you can ship to the EU, Russia by truck/train.\n\nIt really sounds like you need to pick up a book on basic economics because honestly \"if that company relies on underpaid 3rd world labour that because of tariffs is unable to be profitable. Duck em\" is not an actual strategy that is ever going to work.", "score": 1, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.1558  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/82840)", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Until you get Ma and Pa America to stop shuffling off to Walmart twice a week to demand “low low prices” and fill their carts with cheap ass Chinese made stuff, then China wins. \n\nThe Chinese economy has a lot less to lose. Half the Chinese live without indoor plumbing for God’s sakes, economic “pain” isn’t really a thing for most of them and the Chinese central government has a lot more autonomy to combat any economic or fiscal problems than we do in the US. \n\nEveryone doing the “rah rah , America wins!” chant is either as fundamentally stupid as the President, or too young to know better.", "score": 2, "replies": []}, {"body": "It is going to be interesting for sure. In Asia it is now an extra hot summer which caused the typhoon season to start early and there will probably be more and stronger typhoons this season. Combined heat and typhoons might damage food production. This combined with there choice to not buy US agriculture any more could pose problems for China.\n\nOn the other hand we have the upcoming US elections. If Trump is reelected China will have to cave or start a real war. If Trump is facing defeat by the democrats het might start lashing out which could hurt China even more or he could lash out to the US or even start a war somewhere. \n\nIf Trump is not reelected and does not lash out China will probably win by holding out for the remaining year. If everything starts spiraling out of control China will probably have to cave to the pressure. \n\nChina could start buying there oil else where which would hurt the US oil sector another option is that they restrict the excess to rare earth minerals.", "score": 2, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.5638  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/22214)", "score": 2, "replies": []}]}, {"body": "The US cannot fold. Plus US can get what it imports from China from other countries like India, South Korea and so on. And life goes on.\n\nChina has ZERO leverage. They are posturing aggressively to scare away the US administration. Once we hold tough they know things will only go south for them.", "score": 1, "replies": []}, {"body": "Once dementia Don gets his interest rate cut he will strike a deal before elections.", "score": 1, "replies": []}, {"body": "Did anybody actually read the link. What the hell language was this translated from?", "score": 1, "replies": []}, {"body": "Just get over yourselves and make a deal already. Quit tugging us around. It's not rocket science. How about art of the deal... make one so everybody can shut up about it and move on to the next impossible mountain...", "score": 1, "replies": []}, {"body": "The US will win, China has a 300% debt to GDP ratio, Hong Kong is likely going to be the next tiananmen square which will lead to companies pulling out of China, they have a real estate bubble that is going to burst, central control over large swaths of the economy always leads to inefficiencies and then failure of those section of the economy, China also has a company shares for loan problem, then there are the dark loans that are not listed in the 300% debt to GDP numbers,  etc. etc. All in all that country is a financial accident that is waiting to happen ... plus the worlds odds makers all have Trump winning the next election, so them holding out till 2020 is not going to help them in anyway.", "score": 2, "replies": [{"body": "Out of curiosity, if everything you say is spot on, what motivation does China have to give into demands?  If they are already in such a big bubble, how would a truncated trade deal help their economy?  Their only real option is to wait... even if it takes 4 more years", "score": 3, "replies": [{"body": "The question was, who is going to break. ;-)   \n\n\ncontinuing ...   \nIn a little more than 5 years, robotics, automation, and AI will make manufacturing more local and less global. Shipping cost, time to ship, and the pollution from shipping will start being an issue. As a manufacturing hub China is doomed, Labor cost there are going up, and as we see with McDonald's as that occurs companies are moving towards automation. (When the first voice controlled Kiosk happens, look for cashiers to pretty much disappear at most fast food places)", "score": 1, "replies": [{"body": "Disappearing fast food employees has already happened in China. You scan a QR code, order your food and pay with Alipay or WeChat Pay through your phone.  Interaction is already limited to just picking up your food.", "score": 2, "replies": []}]}]}]}, {"body": "Canada.", "score": 0, "replies": []}, {"body": "America baby! Wooo!!\n\n\n\nHelp me", "score": 0, "replies": []}, {"body": "As a layman, I see China's influence over the US market as something to behold. At the time of this post, the DOW is down another few hundred points, wiping the gains from this year. This, in my view, was a direct result of China's recent economic maneuvering, primarily reports of currency manipulation. Trump's promise of new tarriffs also hurts. So, in my view, regardless of how this impacts China (because that is not my primary concern), the US will \"lose\" no matter what happens, as it's clear that China can certainly impact the US economy and would have no reason *not* to, whether they \"win\" or \"lose\" this trade war.", "score": 0, "replies": []}, {"body": "China\n\nChina has a stronger economy and the US has so much debt in china", "score": 0, "replies": [{"body": "😲\n\nChina needs market to continue growing\n\nUS is the biggest market\n\ndebt is transferrable. if you cant wait until maturity, you have to sell at a discount\n\nchina export to US is $539B\n\nUS export to China is $120B\n\njust look at the numbers and you know who losses if you cant sell that $400B trade imbalance.\n\nand think about these. exporters can move production from china to avoid the tariffs\n\nso who losses? definitely not the US", "score": 2, "replies": [{"body": "that is true, *but* from a macroeconomical sight China could screw up the US Dollar so badly if the like to\nbut that would be the last thing they would do 😅", "score": 1, "replies": [{"body": "currency is about trust\n\nwe all know what the world want to hold as their currency in times of crisis", "score": 2, "replies": [{"body": "yes, gold and silver for example :)\n\nsearch up how much the Usd relys on china.\n\ni would elaborate more, but english is only my 3rd language, so it would be kinda hard 😅", "score": -1, "replies": [{"body": "its the USD", "score": 1, "replies": []}]}]}]}]}]}, {"body": "If the stock market keeps tanking, the rich will dump Trump.\n\nThe rich people are going to break first.", "score": 0, "replies": []}, {"body": "The US over litigates and overtaxed businesses, then crys when China wins because China is playing the game to win not be “fair” or “moral” whatever the hell that means. The we have a tantrum and put tariffs on them, when we should be doing is hacking and slashing regulations for businesses and doing everything we can to clear a path for innovators.\n\nMorons.", "score": -2, "replies": []}]}
