{"title": "Trading strats that yield consistent profits without you being bullish or bearish", "selftext": "[deleted]", "id": "ghcbe4", "created_utc": 1589154005.0, "score": 111, "upvote_ratio": 0.88, "num_comments": 73, "comments": [{"body": "Sell cash covered OTM puts with high theta on solid companies. Boring af but works pretty consistently if you have enough cash and patience. Hedge with VXX calls if you're extra gay as OP.\n\nI like to sell them with 1 to 2 weeks expiry and close them out as soon as they drop into the pennies, so I can unlock the cash for the next batch of puts. Just keep an eye on the theta and close when it gets low.", "score": 20, "replies": []}, {"body": "no u", "score": 28, "replies": [{"body": "no u", "score": 18, "replies": [{"body": "Touché", "score": 18, "replies": [{"body": "I don’t think I’ve seen a more hostile argument on reddit", "score": 6, "replies": []}]}]}, {"body": "No you both", "score": 1, "replies": []}]}, {"body": "A little to r/investing for this sub. Have you tried to yolo everything you have on msft calls? That would be worth reading", "score": 38, "replies": [{"body": "I would normally do that but msft does not present a good risk reward for calls. Instead, I’m doing PCG calls for bankruptcy vote (september 20 strike)", "score": 20, "replies": [{"body": "Hey wait a sec you mean the Californian PCG? Boy I can’t wait to see some good DD on them some day. Been wanting to enter some calls for quite sometime.", "score": 7, "replies": [{"body": "I’ll write some dd soon. It should fly to 17 soon (look at January chart: that’s the leadup to bankruptcy exit). Chart looks exactly the same rn: breakout at 10.20 much like in early jan", "score": 5, "replies": []}]}]}]}, {"body": "Wouldn't the money you spend buying vxx calls just take away all your profits from the spreads?", "score": 13, "replies": [{"body": "Not if u do OTM call debits", "score": 7, "replies": [{"body": "Gotcha. Sounds like an interesting strat. Seems like a small gain strategy though. Can you give an example of some of the gains you've had with it?", "score": 6, "replies": [{"body": "If you go 15 dollars OTM call debit on vxx a month out it would cost around 30-40 dollars (5 point wide). 120-130 for a put credit on msft or qqq then your gain would be around 100 per vxx-msft pair trade, which represents a 20% return on collateral for a monthly. That’s fairly good 5% weekly return", "score": 6, "replies": [{"body": "You are utterly retarded.\n\n- First of all if things stay flat you need to roll the VXX spread well before the end of the month, otherwise theta will ruin its hedging ability.  So you're paying more than $30-40 for the hedge.\n- Secondly, you're basing your returns on the winning case.  There's still a ~20% chance (according to the market) that MSFT drops below the put you bought, and then you're down around $400 in collateral minus whatever you get from the VXX hedge, which is not going to be anywhere near enough to cover.  It'll most likely return about $50, maybe $100.  Let's be generous and say $100.  Then your ACTUAL returns are 0.8*(120 - 40) - 0.2*(400 - 100) = $4, or about 0.8%.  If you pay $0.65 per contract in commissions you made -$1.2.  If you roll the VXX position before the end of the month, even less.  Congratulations!\n- This is WSB, don't be a pussy and drop the short positions.\n\nIf it were actually possible to get anywhere close to 5% weekly return (1264% per year!) with this strategy, a) you'd be a billionaire, b) it would have been arbitraged away in a millisecond by algorithms already, especially given how simple it is.  Anyone who thinks there's that kind of fucking free lunch in the markets is a moron.", "score": 15, "replies": [{"body": "First of all I would not dump my entire portfolio into each spread so I wasn’t saying that I would make 5% on the entire portfolio. And second of all fuck u. 3rd of all: vxx can make intense OTM moves even with relatively smallish price changes like in feb 2018. It has a slow fade but rapid moves onwards. Furthermore, markets tend to slowly go up, so if you write a put credit on the index, chances are that if we have a rapid fall right out of the gate or somewhere in the middle of the opex periods, the vxx options will save you. Overall, I just wanted to say fuck you.", "score": 7, "replies": [{"body": "I did a quick back test of AAPL/VXX pair and didn't find much value.  I had to use some assumptions for the option premiums because I don't have those values so just assumed current option/underlying price ratios held - so overstating historical prices probably.   Almost two and half years of VXX being in existence led to losing at expiration about 1.4 per AAPL spread and only gaining about 0.6 per VXX spread.  The premiums earned/paid worked out to be very close to the average option values at expiration so net you lost about 0.03 on both AAPL and VXX.", "score": 3, "replies": [{"body": "How are you doing the spreads? I find that extremely hard to believe. You are also not providing as to what kind of deltas you’re placing the spreads at. Markets tend to go up and then have sharp sell offs. Vxx calls are typically cheap in low volatility times and the only way you can negate it is with debits for high volatility times. You may be placing the puts way too OTM", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I know what they’re saying, but I would argue that you will lose MUCH LESS if you’re long while hedged against volatility as opposed to just long. If there was a simple strategy that was absolutely profitable then we would all be billionaires by now. It’s not just about making money but making sure u dont lose much money, and hedging against big spikes in volatility WILL ALWAYS protect you in the long run", "score": 1, "replies": []}]}]}]}]}, {"body": "Damn you should star in the Big Short", "score": 1, "replies": []}, {"body": "Way to try and discredit his strategy with made up numbers lol. Using volatility as a hedge to long positions is a common strategy on Wall St. retard.", "score": 1, "replies": []}]}, {"body": "Interesting strategy. Thanks for the post man. I'll look into it once my CSCO calls print and I dump before earnings.", "score": 2, "replies": []}]}]}]}]}, {"body": "Well done but nobody gon listen man.", "score": 6, "replies": [{"body": "Someone will tho I bet", "score": 5, "replies": [{"body": "I did.", "score": 1, "replies": []}, {"body": "People should it’s a good strategy. Put credit spreads with DIS usually work well also. MSFT is my favorite for it though I’m with you there.", "score": 1, "replies": [{"body": "Yeah I think DIS may be good or sbux. I also like MGM for a cyclical stock", "score": 1, "replies": [{"body": "Look into PFE.  It doesn't typically fall into the daily SPY trends, but will follow big moves in VXX.  It's extremely cyclical right now, bouncing between 36.5-40 every 2 weeks.  I just keep legging into great verticals.", "score": 1, "replies": []}]}]}]}]}, {"body": "Great DD, do you ever close out so you can do another spread early? I'm just thinking in case shit starts swinging in the wrong direction it might make sense to close out and move the dates and strikes to not get shafted in an assignment.", "score": 7, "replies": [{"body": "So typically if shit heads south, I just keep writing more put credits and then also buy more vxx call debits that are otm. I typically don’t close early unless I see at least 50% or more profit on the spread. But as the puts go down in value, so would the value of vxx, so if you close out a spread and write a new one, you may need to also open a call debit on vxx that is a bit lower in terms of strikes. \nBut the cool part is that if shit goes super south super quickly, vxx would go through the roof super quick. In that situation, you have all these vxx call debits that you’ve kept accumulating because of the profit taking that you’ve done on the put credit side. You’ll most likely be fine in that situation or may even make more money as a result of the vxx calls", "score": 8, "replies": [{"body": "I gotta say, I love this strategy, I've contemplated many times of doing this shit but wasn't sure it would pan out. Probably gonna do this next week.", "score": 5, "replies": [{"body": "I think monthlies are best since if shit goes truly south you can give vxx some time to crack through ur call debits", "score": 3, "replies": []}]}]}]}, {"body": "solid strats for s/t gains", "score": 3, "replies": [{"body": "Lol thx bro", "score": 1, "replies": []}]}, {"body": "Good Strategy", "score": 2, "replies": []}, {"body": "I like it. Imo using historical month over month range of 0.7 during these current market conditions is tough just given swings are likely to be larger than historical averages suggest.", "score": 2, "replies": []}, {"body": "just play the intense earning moons this earnings season lmfao, you can build exponentially almost like clockwork on all the big stocks just cause people are piling onto them", "score": 2, "replies": []}, {"body": "wait, are you telling me I should use a pricing model and actually trade on theos not random gut feels? \nRidiculous", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I’m currently applying to trading firms and they have my one year chart. If I post my chart online, they’ll find out it’s me lol.", "score": 2, "replies": [{"body": "What's your 1 year return +- 3% (for anonymity)?", "score": 2, "replies": [{"body": "72.5", "score": 1, "replies": [{"body": "Respect", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "My return for the year is 72.5%", "score": 1, "replies": []}]}, {"body": "Can I apply to trading firms? My strategy is buy and hold SPY. Beats almost every investment firm in existence.", "score": 1, "replies": [{"body": "Not renaissance technologies or pdt partners or hudson river", "score": 1, "replies": []}]}]}]}, {"body": "Thank you for the post. You gave me some trading ideas. However, I don't think that VXX can be used as a hedge for GLD. What happened in March is unlikely to repeat. However, VXX could be used as a hedge for MSFT or other big tech names.", "score": 1, "replies": [{"body": "Another one could be way OTM put debits on tqqq for a liquidation type scenario since triple leveraged etf’s perform so badly in a crash (tqqq hasnt recovered yet while qqq is back at ATH levels).", "score": 2, "replies": [{"body": "That has to do with the effects of compounding into losses too.\n\nA 50% loss needs a 100% gain. A 60% loss requires a 150% gain. A 70% requires 233%.", "score": 1, "replies": [{"body": "Yes for sure but also the decay of tqqq is noticeably bad during market meltdowns so that fucks it badly too if the market goes for a lower leg", "score": 1, "replies": []}]}]}]}, {"body": "To confirm - you mean you’re selling put vertical spreads on qqq and buying call vertical spreads on vxx?", "score": 1, "replies": [{"body": "And do you weight each position equally - like 1000 on each side?", "score": 1, "replies": []}, {"body": "Yeah as long as I see a situation where my net credit for the qqq is 2-3 times the amount I’m putting down for the vxx call debits", "score": 1, "replies": []}]}, {"body": "Great Play, I'm tire of the all the TA bullshit. I'm just looking for low risk small gain low income. Is there any other play you should suggest beside the SLV and GLD?", "score": 1, "replies": [{"body": "Weekly call credits on TLT are not so bad in a calm week", "score": 2, "replies": [{"body": "Thank you man. Im going to look into it.", "score": 0, "replies": [{"body": "Another one is wheeling a biotech such as editas or clvs. 6% weekly roi. Good for edit since they wont have any data coming out anytime soon.", "score": 2, "replies": [{"body": "Like the traditional wheel, selling Put cash covered put then if assigned selling covered call?", "score": 1, "replies": [{"body": "Yeah wheeling editas seems like a good idea", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Thank you", "score": 1, "replies": []}, {"body": "When you say call debit what exactly do you mean?", "score": 1, "replies": [{"body": "Buy the lower strike call sell the higher strike call. So buying the 50 vxx and selling the 60 for june and then going put credits on msft and aapl or qqq", "score": 1, "replies": [{"body": "So you're basically counting on the VXX calls hedging your credit spreads in case things actually go south?\n\nThe only thing I can see going wrong with this is if something hits tech much harder than other sectors.", "score": 1, "replies": [{"body": "If there's a leg down it's going to be focused on tech but so is vxx so the hedge will be fine.", "score": 1, "replies": []}]}]}]}, {"body": "How about buying slightly otm vxx puts on any down day minimum 2 weeks out?", "score": 1, "replies": []}, {"body": ">Most people who consistently make money do it without having to predict market direction.\n\nIt's good to be a rich banker I guess. *\"Heads I win, tails you lose\"*", "score": 1, "replies": []}, {"body": "Good stuff, hopped on the gld condor. Also your suggestion to wheel biotechs was super interesting, do u have any other experiences regarding wheeling?", "score": 1, "replies": [{"body": "Wheeling MGM is one of my favs rn. I’m also wheeling sbsw monthly since it tracks commodities", "score": 1, "replies": [{"body": "I like those two, would u say they r solid companies or r u just wheeling because of other reasons", "score": 1, "replies": [{"body": "I'm actually bullish on both. MGM because intrinsic price is above 20 and sbsw because they mine palladium and palladium will face a massive scarcity in 2021-2030", "score": 1, "replies": []}]}]}]}, {"body": "Sounds good. Do you have any info on the general profit/loss percentages from it and the risk involved?", "score": 1, "replies": [{"body": "Gld condor you typically collect around 70-80 for 200 collateral (the one I mentioned). SLV is around 60 for 300 collateral (if you do wide wings). Put credits on msft I typically wanna collect at least 120 for the 500 collateral and then vxx call debits really depend on the market condition", "score": 2, "replies": []}]}, {"body": ">no one fucking knows and your sorry ass won’t be able to time it with puts. Even if there’s the next leg down, consider that your timing would need to be impeccable. \n\nGoogle is your friend.", "score": 1, "replies": [{"body": "Google invented a time machine?", "score": 1, "replies": []}]}]}
