{"title": "You guys liked my TA Analysis of Walmart yesterday, Here it is of Boeing. Tomorrow will be the tell all if BA hits $170 next week or ~$133", "selftext": "", "id": "gsfo1t", "created_utc": 1590702688.0, "score": 25, "upvote_ratio": 0.77, "num_comments": 68, "comments": [{"body": "These are good posts. Fuck the haters.\n\nYa’ll idiots talking about TA being astrology gotta get something through your melons. It’s not about predicting the future and it’s fucking tedious seeing everyone act like that’s what people doing TA think they’re doing.\n\nIt’s about finding 1) a reason to be in a trade and 2) when to get in the trade and 3) when to get out of it and having all those lined up BEFORE you put your $ down\n\nYou do that by finding a pattern and either looking for a continuation of that pattern, or for a sign that pattern has changed. This is the difference between buying the dip and catching the falling knife with your face. \n\nLearn to use it and you WILL make more money. Doesn’t matter if you’re terrible at TA - just having a strategy in place that incorporates price movement instead of just hope or whatever the fuck you guys do will get you better results.", "score": 14, "replies": [{"body": "This right here. I don't get how some people think if you use TA, you only use TA. It's a tool like any other, and it specifically gives you entry and exit suggestions.", "score": 5, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Still missing the point. \n\nSay a stock is at 100 and you buy calls. It immediately dips, as is tradition. At what price do you cut it? You can say ok if it breaks 98 I’m out, or 95, but you should have SOME measurable things that make you admit you’re wrong and take the L. A basic TA-based suggestion might be ‘if it takes out the low from that last dip, I’m out’. \n\nHow you come up with those is almost secondary. Looking at a chart is one way that many find helpful. Just picking a fucking number is another way. Diamond hands to expiration no matter what is another way. The point is you’ll trade better if you have a plan.\n\nAnd that whole 50/50 setup is retarded. If that was a reasonable starting point for simulating some advantage in options trading you’d see a lot more people breaking even here.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah that’s the thing where you don’t control you positions size and eventually get fucked.  Groundbreaking \n\nK keep trading like a moron and blowing up your account over and over. Everyone knows trades are exactly like coin flips. Y’know the only thing worse than someone who doesn’t understand probability....\n\nAnd you are still MILES away from the point\n\n(inhales)\n\nHAVE A SYSTEM IN PLACE BASED ON PRICE LEVELS THAT GIVES YOU BASIC YES/NO AND IF/THEN DECISIONS. YOU ARE BETTER OFF WITH IT THAN WITHOUT\n\nNow get the fuck out of my TED talk", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "So I think looking at trading (especially options) as something that starts from a baseline 50/50 probability is misguided for a few reasons. Classic problems like (variations of) the gambler's ruin assume you're basically betting  $1 to win $1, then $2 to win $2, etc., you can tweak the odds and fraction of bankroll used after a win/loss, but in that setup each outcome is immediately known, it's independent of the last outcome, and you go to the next identical trial.\n\nOptions trading just isn't like that. Think about it how many people here are comfortable holding onto huge losses, just accepting it and hoping it'll turn - but then smash the sell button the moment they see a 10% return. That kind of dynamic doesn't exist in a coin flip. The outcome of each trial has widely varying payoffs over widely varying time horizons and let's be honest - if your trade is going long OTM option premium, your baseline odds are generally nowhere near 50%. A lot fewer people would sell them if that were true.  \n\nIf there were options with instant expiration that cost $1 and paid $1 if you guessed the next $1 of price movement up or down, that'd be much closer to something where you could test strategies properly in the way you're describing.\n\nThankfully, you also don't need your odds to be anywhere near 50% to end up quite profitable IF you pick and manage your trades well. That means cutting losers quickly, and getting exceptional returns from the good ones. Doing THAT means having a solid way to determine what is actually a 'loser', and a way to evaluate just how good 'good' can be since, your profit can be anywhere from 1% to several thousand %. The hardest thing to do when a trade is going your way is to just sit there doing nothing.\n\nHow you do that - picking and managing your trades - is IMO where chart stuff comes in. You're really just trying to answer the questions 'what is the price doing and can I expect it will keep doing that? Charts just make that easier to visualize.", "score": 1, "replies": []}]}]}]}]}, {"body": "This comment is fucking retarded even for WSBs standards", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "New York time lunch yeah\n\naround 10am PST if youre in the 2pac zone", "score": 7, "replies": []}, {"body": "Tomorrow, we dine in 11 Madison Park... or Mickey D's.", "score": 1, "replies": []}]}, {"body": "Where can I get access to this chart?", "score": 3, "replies": [{"body": "Either click the link\n\nOr go on tradingview.com and make your own", "score": 1, "replies": [{"body": "Sweet.  So the link isn't a screenshot, it's a live update? Also, 12pm CST is when to look? And I'll be looking at whatever candle is touching the green arrow you drew?", "score": 1, "replies": [{"body": "Yeah link is a direct live link to the BA chart I made\n\nActually it seems like it already created the new candle\n\nThe 4 hour MACD candle might have been created today at 7am PST meaning that it was 3 hours into its creation when market closed yesterday\n\nSo now you can see that a new lighter green candle was made\n\nWe’re headed down", "score": 1, "replies": []}]}]}]}, {"body": "You're not good at ta.", "score": 3, "replies": []}, {"body": "Does your crayon analysis take into account China and Trump beef?", "score": 4, "replies": [{"body": "with extra bacon and sweet and sour sauce", "score": 4, "replies": []}]}, {"body": "What if the next candle is a whole new color that we’ve never even seen before?!?!", "score": 2, "replies": [{"body": "What if it's a BBC? Big Black Candle. Do we take a loan out and go all in on Boeing?", "score": 3, "replies": [{"body": "im pretty sure this color candle means youre about to get fucked hard and you should sell everything\n\nlike your mom", "score": 3, "replies": [{"body": "I'm not sure it's legal for me to sell my mom. The SEC is on high alert for this kind of shit.", "score": 2, "replies": []}]}]}, {"body": "you mean like gay green?", "score": 2, "replies": []}]}, {"body": "This is fucking halarious.  Keep me updated on the crayon color so I can go all in", "score": 2, "replies": []}, {"body": "Thought this shit was going down...", "score": 2, "replies": []}, {"body": "TA is like fucking horoscopes, except for it's even gayer.", "score": 3, "replies": [{"body": "TA is like your Mom, it works for me a lot but when it doesnt i regret how much time i invested in it", "score": 7, "replies": [{"body": "Oh so you're the guy with the micropenis she's been telling me all about. I can't wait to meet you. Make sure you clean her dentures before she heads to bed.", "score": 1, "replies": [{"body": "Love you", "score": 1, "replies": [{"body": "did you really just reply \"Love you\" to your ***own*** comment?\n\nhahaha", "score": 2, "replies": [{"body": "Yeah but it was meant for you because you're my new step dad remember. My dad wasn't there for me so maybe we can play catch and you can take me out for ice cream and youll be the dad I never had. I'm already so happy just thinking about it.", "score": 0, "replies": [{"body": "That sounds like a lot of time from my part\n\nHow about I just send you money and cigarettes", "score": 1, "replies": []}, {"body": "What if he's that creepy molester stepdad?", "score": 1, "replies": []}]}]}]}, {"body": "will do captain", "score": 1, "replies": []}]}]}]}, {"body": "All I heard was BA $170c", "score": 1, "replies": []}, {"body": "So what’s the determination here? I see dark green", "score": 1, "replies": [{"body": "Not sure where you saw the dark green candle because I’m looking at the chart and it just made a lighter green candle\n\nLooks like we’re going down bois", "score": 2, "replies": [{"body": "Down down or just down", "score": 1, "replies": [{"body": "If you’re asking if it’s gonna tank it’s not\n\nJust down and it’s gonna keep that direction\n\nI expect BA to keep going down as long as MACD keeps creating lighter green candles\n\nOnce it creates its first dark red bearish candle that’s when you might start seeing the big moves\n\nAnyways, BA going down to $133 in a couple days", "score": 3, "replies": [{"body": "Selling calls it is!", "score": 1, "replies": []}, {"body": "I’m so glad I inversed WSB, I’ve made a bit over $1000 buying short calls. Wasn’t in it for the 3000% spike today unfortunately but I still made a ten bagger on my initial $140, and after profits with gap up tomorrow morning I think I’m looking at another $1400 - 1.4 June 5 2020 $180c", "score": 1, "replies": []}]}]}]}]}, {"body": "Robinhood noob here since rh is only 2 colors am I looking for more of a flat trend until 10?", "score": 1, "replies": [{"body": "Just read your comments 3 130p let's go baby", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "First candle after he posted was red so his analysis says BA heading to 130", "score": 1, "replies": []}]}, {"body": "It really didn’t\n\nNews can make or break any TA\n\nTA still works great", "score": 0, "replies": [{"body": "There was no catalyst though. TA was just shit", "score": 1, "replies": [{"body": "12,000 job loss and space x launch\n\nAll bullish news for BA\n\nAt least know what the news is Jesus", "score": 0, "replies": [{"body": "BA effected by space launch the same way  lmt or rtx is. The jobs news came out before your dumbass TA analysis lmfao. Good luck and keep drawing with your crayons.", "score": 1, "replies": [{"body": "Do you wanna compare account growth and see what my full TA account looks like compared to yours?", "score": 0, "replies": [{"body": "Wow no response to the above comment. Explain how I don't know news when your TA was after their jobs news release but you say that catalyst propelled the stock up. Your ta is stock can go up or it can go down. Novel", "score": 1, "replies": [{"body": "My TA said if price did this then this LAST week depends my on one factor\n\nThat factor happened and I became bearish (still am)\n\nThis prop up was because of SpaceX and the news of BA laying people off\n\nAll bullish news\n\nTA is great with no news and even better with news that props it in the consensus direction\n\nTA is not so great when I say BA is going down and BA the next day creates a plane that never needs gas again\n\nCmon learn a little", "score": 1, "replies": [{"body": "Do you realize what you're saying? First of all, the jobs layoff happen BEFORE your analysis. Your analysis is if the next buy is red stock is going down, if its green stock is going up. Aka 50% chance of up, 50% chance of down. Very novel strategy", "score": 1, "replies": [{"body": "It’s not novel\n\nIt’s two completely different scenarios set with very specific actions that I layed out\n\nIf this then this\n\nIf that then this\n\nI’m still bearish all around short term and bullish very long term", "score": 1, "replies": [{"body": "Anyways I didn't mean to get into a long argument about this. I was just trolling typical wsb fashion with my earlier comment. To each his own", "score": 1, "replies": [{"body": "I figured as much\n\nJust trying to explain why TA should not be taken out of the picture\n\nIt works very well and I always recommend learning it", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Check BA", "score": 0, "replies": []}]}, {"body": "Where can I go to learn how to use TA?", "score": 1, "replies": [{"body": "Look up confluence on YouTube\n\nSpecifically either Cue Banks Confluence 1.0 or 2.0", "score": 1, "replies": []}]}, {"body": "177.", "score": 1, "replies": [{"body": "Yep", "score": 1, "replies": []}]}, {"body": "To keep this short and simple, Boeing will move based on the next MACD candle that gets created on the 4 Hour chart\n\nIf the next candle is dark green were going to see BA at $170 by next week\n\nIf the next candle is a lighter green we will begin our decent back to $134, then retest support. If it break support were headed straight down to $121/$120 area\n\ni DO NOT think that we will see Boeing go under $121 again unless we have another Leg down and the SPY collapses again\n\nif we do go down to $121 area again go in BIGLY on Calls or shares whatever juices your orange\n\nthe bearish trend was just broken by the break in price of $134 and again at $146\n\nTL; DR Long BA to $170 if next candle created on 5/28 is a dark green candle indicating BA is still very bullish . Short BA if next MACD candle is a lighter green on the 4 hour chart indicating a short term bearish trend that will go back down to the $134 price\n\nNote: On average, Boeing bearish leg downs are around $20.", "score": 1, "replies": [{"body": "So you're saying that it could go UP or DOWN 🤔", "score": 14, "replies": [{"body": "i literally said that its gonna go up if a new darker green MACD candle gets created and price is gonna touch $170\n\nIf a new lighter green candle on the MACD gets created its going back down to $133\n\nEdit: But yes either up or down, this is the way", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Highest? I think itll hit $153", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "well see, tomorrows gonna let you know if youre fucked or not aha", "score": 2, "replies": []}]}]}]}, {"body": "Bro, great fucking call on 133! You just read a book on MACD chart theory and think you fucking cracked the code?", "score": 1, "replies": [{"body": "Not sure if you’re being sarcastic or not lol", "score": 1, "replies": [{"body": "The lowest it got was like 143, and it's up pre-market.. your interpretation of that being sarcasm explains your interpretation of where you thought BA was headed", "score": 1, "replies": []}, {"body": "Correction. Has touched 150", "score": 1, "replies": []}]}]}]}, {"body": "People spam that on posts like it shows how TA is stupid, when it really just shows how they haven’t even bothered to try and understand what TA is for. It’s just if/then logic via price movement. It doesn’t guarantee anything and it was never supposed to.", "score": 1, "replies": []}]}]}, {"body": "Stonks only go up", "score": 0, "replies": []}]}
