{"title": "Printers Gonna Print: Calls on HP ($HPQ)", "selftext": "Ok Bozos, listen up. Boomers working from home made a run on printers like HP was a bank running out of cash. \n\nCheck HP’s website, half their stock is sold out. Check Twitter, dozens of Karens and Gregs are complaining they can’t print their TPS Reports. \n\nJPow isn’t the only one that prints. The King of Printers ($HPQ) is primed to print tendies at Earnings on 5/27. \n\nOh, and did I mention these Calls are CHEAP? This shit hasn’t popped yet, but it’s about to. \n\nSo buy your ticket and take the ride to Tendie Town, Boiiii\n\nPositions: 16c 5/29, 18.5c 6/5, 17c 7/17, 18c 7/17", "id": "gibjcw", "created_utc": 1589291251.0, "score": 35, "upvote_ratio": 0.85, "num_comments": 73, "comments": [{"body": "Company financials are good... risk/reward of may and june calls is appealing... retard enough to be in my portfolio... I'm all in", "score": 30, "replies": [{"body": "Might do that too", "score": 5, "replies": []}, {"body": "I’m about 25% in. I like the risk reward a lot and I do think HPQ will surprise with earnings.", "score": 2, "replies": []}]}, {"body": "Solid, I’m in dell though, see what I did?", "score": 8, "replies": []}, {"body": "I feel like people will fat finger $HPQ for $HP\n\n&#x200B;\n\nScared of that", "score": 6, "replies": [{"body": "So the play is 5/29 calls on $HP?", "score": 3, "replies": []}, {"body": "Can confirm", "score": 3, "replies": []}, {"body": "Sometimes that can work out. Look at the fake Zoom.", "score": 1, "replies": []}]}, {"body": "These are cheap I did actually pick up some 6/5 calls earlier", "score": 5, "replies": []}, {"body": "What about HPE? you would think all those WFH folks drove up server sales.... \n\nCalls are cheap", "score": 4, "replies": [{"body": "Likely not as much of a boost in Q1. That stuff takes a while to build, ship, setup, deploy. Likely most of the server boost goes straight into AWS utilization and other cloud. The consumer rush is the thing to cash in on right now. Maybe Q2 for server equipment? Other thing is that a lot of HPE equipment is also sold for in building networks so I don't know if they won't gain some in one sector and lose in another.", "score": 2, "replies": []}, {"body": "I like HPE too. Indeed I could see a covid boost to their sales. Calls super cheap too.", "score": 1, "replies": []}]}, {"body": "5/29 16c good price as well as volume. Bought 20 contracts. Holding until end of week.", "score": 5, "replies": []}, {"body": "Their CEO Lores said they had increased demand for PCs which makes up 66% of their revenue.", "score": 5, "replies": [{"body": "TENDIE TOWN!", "score": 3, "replies": [{"body": "And that was at the beginning of March. Probably accelerated as more states locked down.", "score": 2, "replies": [{"body": "TENDIE TOWN 2.0", "score": 3, "replies": []}]}]}]}, {"body": "156% up and holding we going to moonnnn thanks for the solid mate", "score": 4, "replies": [{"body": "Welcome to Tendie Town: Population us 🙌🏻", "score": 3, "replies": [{"body": "Sold 1/3 for 400%. Ill let my wife know youre coming around to fuck her later. Thanks again chief.\n\nEdits: messed up DELL and HP earnings date so removed section of the text that was retarded.", "score": 2, "replies": [{"body": "Boom Baby!", "score": 2, "replies": []}]}]}]}, {"body": "Someone bought 3.6 mil worth of 5/29 18c’s today, saw it on barcharts unusual options scanner", "score": 5, "replies": [{"body": "Nice to see the Pros finally show up 👍", "score": 2, "replies": []}]}, {"body": "😂 imagine buying a stock cause they sold a couple more printers versus their long term position in the market\n\nAlso all these new printers gonna need a lot of ink bro. That’s like double profits. Go all in on these calls !!!", "score": 9, "replies": []}, {"body": "You never go full retard", "score": 3, "replies": [{"body": "Just went full retard", "score": 5, "replies": []}]}, {"body": "Should I be worried about my 16 6/19 calls?", "score": 3, "replies": [{"body": "They’re boutta be worthless.", "score": 1, "replies": []}, {"body": "Honestly, I’m worried about any calls at all right now. That said, we’re not even 24 hours into the Red, so I’m gonna personally hold through to next week and see where this all nets out.", "score": 0, "replies": []}]}, {"body": "SICK day for HPQ - thinking of getting out up 90%. Anyone else holding longer?", "score": 3, "replies": [{"body": "I’m holding, but getting out at +90% is not a bad strategy at all. \n\nI’m just seeing another week and a half to earnings and thinking there might be more juice in this fruit. \n\nBut I’ve diamond hands my way to a loss on more than one occasion, so no shame to getting out on top.", "score": 1, "replies": []}]}, {"body": "Alright man I'm up 200% now, thinking about selling half the position and riding the rest out till next week.  What's the play here.", "score": 3, "replies": [{"body": "I’m in the same boat as you my friend. Up 200%, so I sold half to take profits. Focused on selling my short term expirations (5/29 & 6/5) and holding all my July contracts. \n\nGoing to sit on cash until I can find the next play. Hopefully gonna do some research in the next couple days. \n\nGlad this one paid for y’all!", "score": 5, "replies": []}, {"body": "I'll sell mine if you do, watching it is becoming stressful.", "score": 1, "replies": []}, {"body": "Holding at least until Thursday. $17 is very likely.", "score": 1, "replies": []}]}, {"body": "Amazing stuff man, already up 900% on this!", "score": 3, "replies": [{"body": "Sick!!!! Love it", "score": 3, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "When we buying this dip? The shit is tankin!", "score": 2, "replies": []}, {"body": "I've had my eye on HPE. They have earnings coming up.", "score": 2, "replies": [{"body": "Accidentally bought these.... full send", "score": 2, "replies": []}]}, {"body": "Red close = moon tmr?", "score": 2, "replies": []}, {"body": "I’m in. HPQ monitors and computers should also increase sales due to work from home. Still 35% below the 2020 peak so it still hasn’t even recovered like lots of the popular work at home brands. I could see a run up into earnings maybe $18-$19.", "score": 2, "replies": []}, {"body": "I think they are going to surprise. Check out their website more than half of the printers are out of stock. https://store.hp.com/us/en/vwa/printers/segm=Home-and-home-office,Small-medium-business?jumpid=ma_pr_hero_1_200503", "score": 2, "replies": []}, {"body": "I got into this about two days before the post.  Can confirm it was a good move.  100% up now.", "score": 2, "replies": []}, {"body": "Nice pump today 👌\n\nThanks for the DD.", "score": 2, "replies": [{"body": "Happy to help! I’m +90% and holding 🙌🏻", "score": 2, "replies": []}]}, {"body": "Okay no volume though...I like the play but just don’t know if there’s enough interest", "score": 2, "replies": []}, {"body": "I work in the copier industry and let me tell you, HP is FUCKED on that side of the business right now.  Not sure how much it accounts for but it’s a big no for me, dawg.", "score": 2, "replies": [{"body": "Supply chain problems?", "score": 1, "replies": [{"body": "They’ve been slipping since Carly fuckorina’s worthless ass. That’s more than a whole goddamn decade", "score": 1, "replies": []}, {"body": "No, shit product. Everyone wants a Xerox work centre instead of a dedicated printer in every office.", "score": 1, "replies": []}]}]}, {"body": "The volume is ass on these", "score": 1, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "I hope they wreck earnings cuz you gonna have some dead weight if not.", "score": 2, "replies": [{"body": "Actually IV isn’t too high but ya, if they go down after earnings these will be worthless", "score": 8, "replies": []}]}]}]}, {"body": "I'm a n00b. Still figuring out trading options.. So.....is it a good idea to buy 16c 5/29? When do I sell? Sorry...if this is a stupid question", "score": 1, "replies": [{"body": "Yes, but just buy 1 or 2 contracts to get your feet wet. \n\nMake sure to sell before earnings on 5/27.", "score": 3, "replies": [{"body": "Ok, I bought 1. 🙂", "score": 2, "replies": []}, {"body": "Aren’t options worthless in the week of expiry?", "score": 1, "replies": [{"body": "Only the options that I buy", "score": 8, "replies": []}, {"body": "\"week of expiry\"\n\nNot necessarily, it depends if they are \"In the money (ITM) or Out the Money (OTM)\".\n\nOne tool that helps you learn this is [https://www.optionsprofitcalculator.com/](https://www.optionsprofitcalculator.com/)", "score": 1, "replies": [{"body": "Using that link...16c 5/29 would be worthless in like 3-4 days if the share price doesn’t go above 15.70. Maybe I’m doing something wrong?", "score": 2, "replies": [{"body": "That's the gamble man", "score": 2, "replies": []}, {"body": "nope. embrace the autism.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "schools buying a lot of computers for student's home use. but ink may not be in demand since most work will be submitted online. also there's a ex dividend date ,6/12, that has to be considered for june calls.", "score": 1, "replies": []}, {"body": "They mostly sell the copiers at a loss, or at the very least barely break-even.  The money is in the massive, years-long consumables contracts that you have to sign to get them to set up those devices for you.  \n\nPrint volume was already plummeting, and now it has gone to almost zero with everyone working from home and moving completely away from paper-based processes.  There’s no revenue coming in for them because there are no clicks.  And I don’t see it picking back up after people come back into the office...that ship has sailed.", "score": 1, "replies": []}, {"body": "Printers are sold for a loss. It's the ink that makes money. But why would anyone need a printer at home? They aren't going to hand their TPS reports to anyone.\n\nHP's success is in the server space and maybe because Xerox may buy HP. At that point they can sell all their clients their copiers and close the book on HP commercial printer business.", "score": 1, "replies": []}, {"body": "Maybe they’re sold out because nobody is sending them shit to sell, dillhole", "score": 1, "replies": []}, {"body": "700k volume? That's gonna be a no for me dawg but I'll happily sell you some calls.", "score": -1, "replies": [{"body": "Where else you gonna find cheap calls like this?", "score": 1, "replies": [{"body": "Do what you want but I don’t touch anything with less than 1 million in volume. You might get stuck with the calls and no one to sell them to even if you made the right bet.", "score": 1, "replies": [{"body": "Interesting. Thanks I’ll pay attention to that in the future.", "score": 1, "replies": []}]}]}]}]}
{"title": "Throwback: Martin Shkreli doing IBM Model Valuation, displaying godlike excel skills.", "selftext": "[deleted]", "id": "gibq4f", "created_utc": 1589291935.0, "score": 173, "upvote_ratio": 0.88, "num_comments": 77, "comments": [{"body": "But for real though what the fuck are those excel skills...", "score": 82, "replies": [{"body": "[deleted]", "score": 78, "replies": [{"body": "Well you aren’t in prison so I trust you.", "score": 49, "replies": []}, {"body": ">What about all your cfi? Cff obligations? What about your massive non-cash expenses that are the result of intangibles (that you previously highlighted??). This damages his credibility a great deal in my eyes.\n\nFirst of all, you throwin’ too many big words at me, and because I don’t understand them, I’m gonna take ’em as disrespect. Watch your mouth and help me with the sale.", "score": 11, "replies": []}, {"body": "Username Middle Athlete\n\nSo you’re ex-D2 track and field who got your MBA from Fuqua and now works at a bulge bracket?\n\nJk MBAs don’t know anything. Oh shoot you might actually be A2A?", "score": 9, "replies": [{"body": "This is hilarious bc it's likely too true.", "score": 2, "replies": []}]}]}, {"body": "Shkreli said fuck a mouse\n\ntldr: DIS 90p", "score": 20, "replies": []}, {"body": "Unless they're some technophobe boomer, no way would anyone find these to be 'godlike skills'.", "score": 2, "replies": [{"body": "He's literally using basic Excel skills anyone working in finance would have", "score": 2, "replies": []}]}]}, {"body": "Using the mouse is for dorks", "score": 46, "replies": [{"body": "Old practice in my first job. \n\nTake away the mouse for the first 2 weeks so they get used to short cuts.\n\nBrutal but effective.", "score": 17, "replies": [{"body": "Savage. But I love it.", "score": 6, "replies": []}]}, {"body": "The keyboard is much, much faster when you get used to it.", "score": 8, "replies": []}]}, {"body": "The clickety clack sounds from mechanical keyboard make it sound more impressive than it really is.", "score": 67, "replies": []}, {"body": "If only they would let him out we would have coronavirus cure by now", "score": 56, "replies": [{"body": "And it would only cost an arm and a leg.", "score": 18, "replies": [{"body": "Only to insurance companies, for people he will negotiate down to a finger", "score": 21, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Well boy do I have news for you. He gave the drug out for free to anyone who couldn't afford it and all existing patients so no premium increase", "score": 2, "replies": []}]}, {"body": "And then the insurance companies will pass the arm, leg, and their operating margin onto policyholders", "score": 1, "replies": []}]}, {"body": "Like literally or figuratively?\n\nWhat's the going rate for an arm and a leg on the black market?", "score": 1, "replies": []}]}]}, {"body": "Those were garbage skills, basically how my MD models which is trash...no index match? No subtotal? No lookups, no sumifs...all the guy did was copy and paste with his keyboard...\n\nOnce you learn how to Alt+ navigate, you become a god. Also, Vimuim will make all the girls want you, never use a mouse again. \n\nReal talent is in the structure of model dynamics that can simply be copy and paste down and take into account all changes or data from prepopulated tabs, and then have a sensitivity analysis that can be triggered by changing a parameter in 1 cell that flows the change throughout the file correctly and brings back an updated IRR and MOIC. Then do on of those faggy sensitivity tables and watch ur PMs milk themselves...", "score": 26, "replies": [{"body": "Index matches take forever for my computer to do. I do not like them.", "score": 1, "replies": [{"body": "Learn to database", "score": 4, "replies": []}, {"body": "Gross. Now I do not like you...\n\n\nBut also xlookup is a thing now so yeah, fuck index match", "score": 2, "replies": [{"body": "U cereal? Index match is so all the new fucks in banking have no clue what's going on. \n\nHow am I going to keep my fat ass salary and bonus if everyone can figure out what I'm doing!?", "score": 1, "replies": [{"body": "Don't worry I've floated the term \"XLOOKUP\" to my juniors and they get that fearful look in their eyes all the same. Daily task automation crew can continue their \"40 hour grind\".", "score": 1, "replies": []}]}]}]}]}, {"body": "In Job interviews I always tell people I can do pivot tables. I can't do pivot tables.", "score": 22, "replies": [{"body": "Literally anyone can do pivot tables, but a lot of people treat it like some sort of magic", "score": 7, "replies": []}]}, {"body": "*Laughs in /r/accounting*\n\nThese skills are the average.", "score": 33, "replies": [{"body": "Laughs in r/excel\n\nThese skills are *basic*", "score": 20, "replies": [{"body": "Basically the same sub.", "score": 13, "replies": [{"body": "_how dare you..._", "score": 3, "replies": []}, {"body": "I will have to subscribe then", "score": 2, "replies": []}, {"body": "Not really.  I say that as an /r/excel junkie who subbed /r/accounting for a year because of a couple of good excel bits.  Got tired of all the whinging and career advice freak outs.", "score": 1, "replies": [{"body": "It’s almost as if I’m making a joke", "score": 1, "replies": []}]}]}]}, {"body": "*Laughs in /r/Eve*", "score": 5, "replies": []}, {"body": "CPA gang", "score": 3, "replies": [{"body": "Squad up. *cries in busy season*", "score": 3, "replies": []}, {"body": "Represent 💸🧾", "score": -1, "replies": []}]}, {"body": "This is average?  No wonder there are so many accounting errors.", "score": 1, "replies": []}, {"body": "CPA here, if you think this is godly then I’m a fucking titan", "score": -1, "replies": [{"body": "Gods defeated the titans sooooooo", "score": 8, "replies": [{"body": "Yeah but Titians fucked their mothers", "score": 3, "replies": [{"body": "Clearly the winners then", "score": 1, "replies": []}]}]}]}, {"body": "Laughs in /r/cummingonfigurines", "score": 0, "replies": []}]}, {"body": "hard coding assumptions into formula reference cells?  what could go wrong.", "score": 11, "replies": []}, {"body": "That model was trash and horrifically wrong\n\n2019 revenue on his model was 56B, actual was 76B. Income was actually pretty accurate hence the continued fall in the stock but so much changed since 2016\n\nI did forget they made at least one major acquisition with RH but still he certainly was way overestimating the loss in revenue. That said IBM is still a shit investment and the model was just an example. He had tons of terrible pharma picks too (ALXN was one he touted on those same YTs which is down 30-40% since)", "score": 13, "replies": [{"body": "[deleted]", "score": 39, "replies": [{"body": "I bought DXCM at 190 on March 17th - my DCF analysis shows it at 600 by end of 2021 with accelerating growth due to G7 release", "score": -16, "replies": [{"body": "[deleted]", "score": 28, "replies": [{"body": "Don't get mad i made 120% on the equity in 2 months..", "score": -21, "replies": [{"body": "Proof or ban", "score": 15, "replies": [{"body": "or you can suck me and go read my posts for advice", "score": -21, "replies": [{"body": "i now have you tagged as \"lies about gains\"", "score": 20, "replies": [{"body": "Pay me or bet me and ill show you", "score": -6, "replies": [{"body": "What are you buying today?", "score": 1, "replies": [{"body": "Nothing. Im riding gains and taking profits on longs to rotate into cyclical areas that havent rebounded", "score": -1, "replies": [{"body": "Thanks. Seems like you pick well. I’m trying to recover from fighting the fed lol.", "score": -4, "replies": [{"body": "Try STNE, LRCX, SAIL", "score": 1, "replies": [{"body": "Thanks.", "score": -1, "replies": []}]}]}]}]}, {"body": "Okay I bet you a million dollars.", "score": 1, "replies": [{"body": "Okay send it to a mod, give me their username and i will PM them/you proof to verify", "score": 1, "replies": []}]}]}]}, {"body": "yeah that's what I thought", "score": 12, "replies": [{"body": "I dknt care what you think lol. You can read my posts from march on my many called doubles like crwd etsy cmg ttd or you can buy puts ans shove em up ur tite ass", "score": -5, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Absolute garbage. The kid is nesting hardcodes in formulas and references. Also, I need a mechanical keyboard to get those more satisfying keyboard crunches", "score": 4, "replies": []}, {"body": "bored", "score": 3, "replies": []}, {"body": "lol wtf this is not “god-like” excel skills\n\nGo to r/excel if you really wanna see some shit\n\nHe’s using basic formulas and math lol", "score": 3, "replies": []}, {"body": "he's watching starcraft tournaments lmao", "score": 1, "replies": []}, {"body": "He sounds like Kahn academy. \"Let's look at IBM... Let's look at IBM... I... B... M.... Right?\"", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": " This MFer has got mad excel skills", "score": 1, "replies": []}]}, {"body": "I don’t understand, he is just using excel.  That is how Excel works.  It has formulas and does math for you.  You can cut and paste too...", "score": 1, "replies": []}, {"body": "Doesn't even use VBA... Any knuckle dragger can program in that shit language after a day of practice...", "score": 0, "replies": [{"body": "I mean, you really don’t need to know vba\n\nIt’s like a bleh language", "score": 3, "replies": [{"body": "agreed, its awful.  but id expect it from \"Godlike\" excel skillz", "score": 1, "replies": []}]}, {"body": "if i'm at the point where i'd even consider using VBA i'd rather just use pandas to generate the spreadsheet", "score": 1, "replies": []}]}, {"body": "Not godlike, you just a retard.", "score": 0, "replies": []}, {"body": "I can’t decide if this is sarcasm or not.  I didn’t watch the whole thing but seems to be just basic Excel.  Like high school basic.", "score": -1, "replies": []}, {"body": "Terrible model.", "score": 0, "replies": []}, {"body": "Excel is for fucking morons", "score": -4, "replies": []}, {"body": "Pretty standard skills coming out of any IB analyst program honestly.  Learn how to use The Ribbon, people.", "score": -2, "replies": []}]}
{"title": "Low IV, low premium, high volume call options with June/July expirations", "selftext": "I've used an options screener software to filter some June/July calls and I decided to share my results with the WSB community (because I'm a nice person). I've filtered only for calls (bears can fuck off) with less than 40% IV and decent volume. I also screened for low premium options because I know you poor fucks can't afford expensive ones.\n\nI hand picked a few based on some other criteria (i.e., how much below is it from fair value, is it a nice innovative company etc.). This list doesn't include any meme stocks, because I know you all are looking for things that are not being mentioned on fucking WSB. Here are the results:\n\n* CMCSA 40c 7/17 - 26.64% IV --> $0.3 premium\n* TWNK 12.5c 6/19 - 28.48% IV --> $0.1 premium\n* INTC 70c 7/17 - 31.03% IV --> $0.26 premium\n* INTC 65c 6/19 - 31.47% IV --> $0.45 premium\n* VOD 17c 6/19 - 31.69% IV --> $0.07 premium\n* ALXN 120c 6/19 - 33.9% IV --> $0.25 premium\n* TAK 20c 6/19 - 38.29% IV --> $0.15 premium\n* FDX 140c 6/19 - 38.42% IV --> $0.2 premium\n\nI threw two telcos in there: CMCSA and VOD. Both are undervalued imo. Intel is also heavily overlooked these days, and with today's dip, presents a unique opportunity. ALXN is a parma company that crushed their earnings despite working on non-covid related stuff, which is a strong statement to big investors that company is resilient. Rest of them you can do you own due diligence.\n\nLet's discuss together. Two autists are better than one, so we make semi-autist decisions!", "id": "gindj3", "created_utc": 1589327220.0, "score": 149, "upvote_ratio": 0.95, "num_comments": 70, "comments": [{"body": "Let me be the first to thank you for your service. \n\nSomeone should flair him: \"pays for free things\"", "score": 89, "replies": []}, {"body": "I’ve been getting my ass beat worse than your wife’s on my INTC calls", "score": 22, "replies": [{"body": "Depends on where in time you enter. Now seems like the time. Sorry for your loss", "score": 10, "replies": [{"body": "Thankyou for your condolences, I think it’s time to bring my calls out behind the shed", "score": 10, "replies": []}, {"body": "ENTERS WIFE", "score": 4, "replies": [{"body": "ENTERS NIGHT....", "score": 2, "replies": [{"body": "Take my hand", "score": 2, "replies": []}]}]}, {"body": "We talking about your wife or INTC calls?  Just want to ensure we’re on the same page.", "score": 2, "replies": []}]}]}, {"body": "SPY July 90p are cheap right now", "score": 48, "replies": [{"body": "They are not pricing in alien invasion, quick, buy before IV shoots up!", "score": 6, "replies": []}]}, {"body": "These have low premiums due to upcoming dividends.  Did the screener tell you that?", "score": 43, "replies": [{"body": "Wrong. 4 factors affect options prices: mark, strike, vol, dte. Upcoming dividends is not one of those factors. When dividends are paid out, the share price is sometimes unaffected. When it does drop, it usually drops very temporarily.", "score": 3, "replies": []}, {"body": "Elaborate please", "score": 5, "replies": [{"body": "Are you serious? Lmao share prices drop after dividends by the value of the dividend.", "score": 49, "replies": [{"body": "Which is in June though right? Idea is to ride the IV fluctuations, take the profits and leave before June", "score": 44, "replies": [{"body": "Not everyone gets it OP. Someone has to pay for our ten d’s", "score": 33, "replies": []}]}]}]}]}, {"body": "This guy brought me to the land of tendies with his Csco DD. Respek", "score": 23, "replies": [{"body": "Wish I’d sold mine before the market closed today.", "score": 4, "replies": []}]}, {"body": "That's a lot of calls you're selling. If not, thanks for the share.", "score": 10, "replies": []}, {"body": "Some real gems. Thanks for putting these out there.\n\nTWNK is trading at 1.02 book value with 100m in cash on hand. Food is recession proof and shelf life is a bonus these days. Looks really interesting.", "score": 7, "replies": [{"body": "It's the most interesting one as well. It's below march values and I suspect they haven't seen significant impact to sales. The issue is I'd rather be near their earnings week with an option.", "score": 3, "replies": [{"body": "spread and volume is an issue tho. Bid has been $0.10 and Ask $0.20 for a while now", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "This one gives me lots of filters to play with. I can also download the data in excel and do some additional cuts. It was only $30/mo", "score": 8, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Sure I'll cancel my subscription. Still in my free month :)", "score": 7, "replies": []}]}]}, {"body": "I think it's technically a trial period if you don't open a brokerage account with TDA, but I could be wrong", "score": 2, "replies": []}, {"body": "How? I have tos but dunno how to do that", "score": 2, "replies": []}]}, {"body": "When these make me tendies I'll buy you the best hooker $7.64 can get.", "score": 9, "replies": [{"body": "i thought your wife got out of the game?", "score": 6, "replies": []}]}, {"body": "Be better if you updated these tomorrow as IV could go up due to the crash today (or if it stays same, then price goes down a lot). Not priced in until tomorrow morning", "score": 5, "replies": [{"body": "Only on WSB do you see a 2% drop called a “crash.”", "score": 22, "replies": [{"body": "It has dropped over 3% today including after hours. The drop started at ~3 pm. Not a crash for sure, but a very bad day.", "score": 3, "replies": [{"body": "Fair enough. Certainly a very bad day.", "score": 1, "replies": []}]}, {"body": "\\-.1% is a crash here.", "score": 1, "replies": []}]}]}, {"body": "Anyone know when TAK earnings are? Tmrw after close?", "score": 2, "replies": []}, {"body": "Really like your Intel 65c play.\n\nGood lookin’ out, thanks!", "score": 2, "replies": []}, {"body": "The timing of this post is great!!!", "score": 2, "replies": []}, {"body": "Jumped in on CMCSA, VOD, and INTC today. Thanks for the heads up.\n\nWhat's your exit plan for these?", "score": 2, "replies": [{"body": "Depends on this week. Wasn't expecting this dump tbh but hopefully it recovers tomorrow. Whats your INTC position?", "score": 2, "replies": [{"body": "picked up 30x 65c 6/19 contracts with 0.4467 avg. Up 12% already but I'd like to figure out how long to hold", "score": 1, "replies": [{"body": "In ths same boat", "score": 1, "replies": []}]}]}]}, {"body": "Update on how these are playing out for me:\n\n \n\n* CMCSA 40c 7/17 -- Up bigly, profit of $197 so far, selling before earnings.\n* TWNK 12.5c 6/19 --> sold for a $5 loss\n* INTC 70c 7/17 - 31.03% IV --> Rocky, still up $4 but waiting for earnings to come closer\n* INTC 65c 6/19 - 31.47% IV --> $0.45 premium\n* VOD 17c 6/19 - 31.69% IV --> Sold for $28 profit.\n* ALXN 120c 6/19 - 33.9% IV --> Didn't get filled so didn't buy\n* TAK 20c 6/19 - 38.29% IV --> Didn't get filled so didn't buy\n* FDX 140c 6/19 - 38.42% IV --> Made a killing but sold today for a $360 profit.", "score": 2, "replies": []}, {"body": "This is fantastic", "score": 2, "replies": []}, {"body": "How do you go about finding these options? Are you using a website or some other piece of software.", "score": 1, "replies": []}, {"body": "What constitutes “decent” volume. \n\nNgl haven’t heard of some of these but will be doing more research.", "score": 1, "replies": []}, {"body": "TWNK is an unfortunate ticker, that is all", "score": 1, "replies": []}, {"body": "What software", "score": 1, "replies": []}, {"body": "What platform do you use to scan? Send a screenshot of your filters", "score": 1, "replies": []}, {"body": "Do another one please.", "score": 1, "replies": []}, {"body": "200% on vod thx", "score": 1, "replies": []}, {"body": "Following", "score": 1, "replies": []}, {"body": "What happens if we all buy Tesla calls", "score": 1, "replies": [{"body": "Already did..", "score": 2, "replies": []}]}, {"body": "Nice data for sure, thanks - but u know the recession is back on, right? We’re gonna need this in puts please.", "score": 1, "replies": [{"body": "Recession doesn't start when market drops 3%, you know right?", "score": 8, "replies": [{"body": "Ahhh, thatta boy.", "score": 4, "replies": []}]}, {"body": "OP was speaking in code, you have to SELL the calls to some moron on this sub", "score": 5, "replies": []}]}, {"body": "Looks like a pump n dump", "score": -2, "replies": [{"body": "So we can't discuss non-meme tickers now? What do we have the discussions for then?", "score": 19, "replies": []}]}, {"body": "Can you show me low iv, low premium puts now? Thx", "score": 0, "replies": []}, {"body": "[removed]", "score": -13, "replies": [{"body": "Please stop screaming", "score": 5, "replies": []}, {"body": "I feel old.png cause I don’t get this Tauon meme. Please explain with a TLDR, a ticker and a strike.", "score": 3, "replies": []}]}, {"body": "I am TWNK and need 100% IV drip because of HIV am gay do PORN", "score": -12, "replies": []}, {"body": "I am TWNK and need 100% IV drip because of HIV am gay do PORN", "score": -13, "replies": [{"body": "wtf, please ban this idiot.", "score": 12, "replies": [{"body": "Sick username, Chris. How did yoloing the $6 dollars you saved for your bastard kids go? Mad gains?", "score": -1, "replies": []}]}]}]}
