{"title": "Is anyone worried about holding TSLA stock?", "selftext": "[deleted]", "id": "gca8u9", "created_utc": 1588440376.0, "score": 8, "upvote_ratio": 0.67, "num_comments": 69, "comments": [{"body": "A tanked stock price just means I can buy more shares for cheap. I fully expect the company to be like amazon and hardly ever turn a profit  but continue to slowly leave there competitors in the dust.", "score": 17, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Something doesn't add up... XD", "score": 2, "replies": []}, {"body": "What does shorting it mean?", "score": -1, "replies": [{"body": "This exchange just goes to show the levels to which this sub has deteriorated.", "score": 1, "replies": [{"body": "What does deteriorated mean?", "score": 2, "replies": []}]}]}]}, {"body": "meh, people likes to banter on Musk now. I love the guy, a few tweets wont let me forget that he changed digital payments with paypal, managed to get into the auto industry with EV which was doomed to fail and yet succeeded and also build up a freaking space rocket company. Thats just the main ones. \n\nIm fairly confident in Musk, and his companies are popular a lot due to his personnality, as he doesnt act like a regular ceo and feels more like your average geek.\n\nTweets like this may temporarily bring the stock prices down but it keeps people talking and it keep musk and tesla trending. Long term, those \"misbehaviors\" are good for the company.", "score": 19, "replies": [{"body": "What’s the long term market cap? $143B is absurd for an automatics company.", "score": 3, "replies": [{"body": "yesterday someone here told me it'll be a 5-10 trillion $ company with 2-4 trillion in revenue/year in 10 years\n \nsome people actually expect it to have basically a monopoly on the automotive AND the energy AND various other markets.", "score": 6, "replies": [{"body": "I expect that. Your imagination limits you.", "score": 5, "replies": []}]}, {"body": "They aren’t really just an automotive company though. The value comes from their battery and AI technology. They’re currently world leaders in both and these 2 things are only going to become more valuable as the world shifts to be further technologically focussed.", "score": 5, "replies": [{"body": "Their batteries and AI is used in their cars. So they are still an automative company by and large.", "score": 1, "replies": [{"body": "Right now maybe but that’s the same as saying amazon is a books company. Stocks are forward looking and that’s why their market cap is so high", "score": 2, "replies": []}]}, {"body": "What if Alphabet's AI is more efficient... then is patented sold to all other auto companies, including Trucks and Transport... It could be any AI company that does this... I appreciate Musk, but TSLA might just be an auto company that has a very niche existence, trying to convince all they will be a monopoly...", "score": 1, "replies": []}]}]}]}, {"body": "If you're worried a tweet from the CEO might harm the company's business essentials (spoilers; they won't), I suggest you watch [Chamath Palihapitiya's stance on it](https://www.youtube.com/watch?v=lx6GJADrflk). Very intelligent and elaborate explanation on why you shouldn't worry about these kinds of things as long as he keeps leading the company the way he does.\n\nAnd if you want my personal opinion; I look at this company's long term potential and I see a gold mine. With battery investor day coming up it's very possible Tesla will have their iPhone reveal kind of moment within a few weeks, and even without any breakthrough technology they were poised to change the automotive, solar, energy storage, ride sharing and transport markets. This company has volatile upside potential short term and almost guaranteed upside long term with close to no chance of bankruptcy and a very real potential to 2x if not more within 3-5 years. I don't understand how anyone can still have doubts about this one.\n\nBesides, Musk is incredibly intelligent. He knows the kind of impact this might have on the stock price and the controversy it will cause. I wouldn't be surprised if he had some kind of ulterior motive behind it. Maybe he's trying to reduce the volatility of the stock by scaring away all the short term investors. Maybe he's trying to manipulate the share price back to a level where they can buy back the stocks they diluted in February in a way he can't get caught. Maybe something else. Or maybe it's just a dude working 100 hours a week who was having a shitty day, smoked a joint and tweeted something dumb. Ultimately he's still a brilliant entrepreneur and inventor, and his companies are just as successful as they were a week ago.", "score": 5, "replies": [{"body": "People want the innovation that a genius brings, without the volatility that outside the box thinking requires.", "score": 4, "replies": [{"body": "Well put.", "score": 3, "replies": []}]}, {"body": "IQ =/= EQ.\n\nYou can be smart and have emotional issues that make you unstable.", "score": 2, "replies": [{"body": "You can, but you don't get to Musk's position that way.", "score": 1, "replies": []}]}]}, {"body": "I shorted before earnings.", "score": 3, "replies": [{"body": "How'd that feel when the market closed?", "score": 3, "replies": [{"body": "DIAMOND HANDS.\n\nBut, I go long/short based almost entirely on cash flow.  The earnings was a total shit show on the FCF front, and next quarter is going to be 20x as bad.  Tesla is one failed funding event from a massive selloff.", "score": 6, "replies": []}]}]}, {"body": "What he did was treacherous and blatantly arrogant for the stock directly hurting shareholders in the process. I bet numerous law suits will come out. Anyway, after loving and owning the stock in the 300s I sold. His insane and careless antics make me lose confidence. I’m out!! So many other other great companies out there to invest in. Good luck!", "score": 8, "replies": [{"body": "you gonna short the stock?", "score": 1, "replies": [{"body": "Nope. Luckily I made a ton on the stock and options over the past 6 months. It was a great run! He’s a Grenade waiting to explode.", "score": 5, "replies": [{"body": "im afraid soon my friend. good for you!", "score": 2, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}]}, {"body": "I don't think shorting the stock is a good idea. It rises violently on dips because people still believe it is the car of the future and Musk is a genius. These comments will make the price sink, and more people waiting to get in will buy. You just said yourself it's nearing your target price. If you feel the need to short it, at least make sure to put some tight stop losses on it.", "score": 1, "replies": [{"body": "Yes I agree, if you were going to shirt you should’ve done it Monday and got out early this week if Monday TSLA was red again.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 12, "replies": []}, {"body": "You shouldn’t be worried about his tweets. His similar tweet popped the price instantly but was faded the next week in 2018.\nIt’s the valuation of the firm you need to commit.", "score": 2, "replies": []}, {"body": "As one TSLA long Ron Baron once said in the last year on CNBC, Elon Musk's tweets are just short term noise. The long term fundamentals behind TSLA will ensure that it's a great long term investment.\n\nTesla the company isn't losing billions of dollars or tons of orders whenever Elon Musk tweets erratic things. People buy Tesla's because they love the product.", "score": 2, "replies": [{"body": "Unless it turns out they have been cooking their books.", "score": 2, "replies": []}]}, {"body": "No.", "score": 2, "replies": []}, {"body": "Eccentric, creative mind. Not afraid of anything. Never went to jail. \n\nYou can own a few shares of his stocks making sure you buy it on a dip.", "score": 1, "replies": []}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/stonkfeed] [Is anyone worried about holding TSLA stock?](https://www.reddit.com/r/StonkFeed/comments/gccgod/is_anyone_worried_about_holding_tsla_stock/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "There only problem is cash flow but even that is becoming less of a problem now that they are starting to turn a small profit. Which in return opens more investors willing to open there wallets anyway. They have a decades head start on there battery tech no one is even close.", "score": 2, "replies": []}]}, {"body": "Honestly love the company and what they do (not talking Musk) but everyone was saying it was over valued for ages.  It’s always been pretty volatile, I’ve personally been selling anytime it’s over $700 and buying anytime it’s under $450.  I won’t touch the stock above that.  As for options once it hits the $750-800 range I usually think it’s a safe bet to short but would never short it under that out of fear of it going up for no reason other than people like it.", "score": 1, "replies": [{"body": "This must be one of the smartest moves I've heard with manipulating tesla stock. \n\nDefinitely trying this out. \n\nDo you get options or just stock?", "score": 1, "replies": [{"body": "I haven’t been doing a whole lot of options trading, mainly just day/week long trades sense the Coronavirus started.  I live in Hawaii and still have to work everyday so being up during market hours is more exhausting than it’s worth.   I think I’d treat it basically the same way I said for shorting though, buy puts above about $775.  I usually do covered calls if I think somethings rising but TSLA tends to have spikes and you could lose out on a lot of gains.", "score": 1, "replies": []}]}]}, {"body": "The tweet was legit investors are too optimistic atm with fremont still shut down its going to be an ugly Q. Should make for good buying opportunity soon", "score": 1, "replies": []}, {"body": "It's too unpredictable and he's right, it's too expensive.", "score": 1, "replies": []}, {"body": "I’m sure whatever choice I may make in TSLA would be wrong as more than any other stock it seems to defy logic.  Trading it seems like roulette.  All of the pandemic factors are against them and nobody seems to care.\n\nI do think holding it, as in the next 5-10 years will make an investor outsized returns.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "How is he mentally unstable?", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm not. I don't own any shares or any of Tesla's products. I just don't see how you can call him mentally unstable. Care to elaborate on that?", "score": 3, "replies": [{"body": "No sane person would make a tweet intentionally hurting shareholders of the company they own. Either he's an idiot or mentally unstable.", "score": 1, "replies": [{"body": "And why not? Who says he has to act in the shareholders’ best interest? There is obviously a reason he tweeted that out.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Couldn’t answer my question or further discourse so you had to resort to an insult. Acting like a 12year old.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Gtfo here with that bs denial. Fuck right off sycophant.", "score": -1, "replies": [{"body": "Why are you so angry? All I asked was a question. Calm down.", "score": 1, "replies": []}]}]}, {"body": "is he on drugs  or something? it also worries me that some of his tweets dont seem to be satire...", "score": -3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "wdym by that?", "score": 1, "replies": []}]}]}]}, {"body": "Yup what’s their future growth pass $900 ($143B)? I do not see them growing past that.", "score": 2, "replies": [{"body": "Are you saying that’s too high? Be careful you might be labeled as mentally unstable by reddit", "score": 7, "replies": []}, {"body": "On what sort of timeline?\n\nLook at Tesla's long term growth plans with opening more Gigafactories.\n\nLook at the vehicles Tesla has in the work right now (including the Cybertruck).\n\nLook at the rumors of what Tesla is working on based on what's been disclosed through their recent acquisitions & hiring applications (battery improvements, advancements on self driving, Tesla Model 2).\n\nLook at the long term trends in favor of Tesla's continued growth (the shift to EV's heavily encouraged by governments to combat climate change, self driving cars).\n\nThere's a lot to point to Tesla **eventually** crushing $900 a share, but you'll have to be patient and wait at least a few years while Tesla continues to build up more Gigafactories, release more popular vehicle models, and continue it's rapid growth overtime.", "score": 1, "replies": [{"body": "All you stated was EV vehicles and so you think it’s worth $143B, that’s absurd for an automotive company.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Good time, I don’t know. Is it a stock to short absolutely. I’m playing TSLA as pump and dump.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I wouldn’t advise shorting.  Remember when he was about to be in jail for the take it private comments last year?  That blew over.  This will too.  Maybe as a short term play idk, but long term I’m long TSLA", "score": 2, "replies": [{"body": "If you’re long what’s the market cap value you see them getting to? 142B is absurd for a automotive company.", "score": 2, "replies": [{"body": "It's not just an automotive company, not as a fan boy or whatever for the company, I do not own an electric vehicle/Tesla. \n\nBut in terms of company wise, although over-valued now, they will reach this point eventually. \n\nTheir innovation in terms of their industry is the leader, and I see it only growing in the future.\n\nAnd in terms of CEO, if you notice the leaders in the world, which of them are not eccentric to an extent? How do you think Trump got to where he is now?", "score": 1, "replies": []}]}, {"body": "oh yea of course i mean a really ahort term short, im just hoping to earn a bit of money from whats going on. as a new investor the bear market has treated me so poorly...", "score": 1, "replies": [{"body": "Yes, I bought puts on Friday and if Monday open red I am dumping them for profit. If you were going to short you should’ve on Friday. It still might not be to late but if it open red again on Monday you have already missed out a good amount.", "score": 1, "replies": []}]}]}, {"body": "Don’t short Tesla, especially if you’re a noob. You will lose money", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm holding, but looking to get out as soon as I can at least partially recover some of what I've lost via that tweet", "score": 1, "replies": []}, {"body": "I would never own Tesla for that reason. Musk is an unstable idiot", "score": -1, "replies": [{"body": "Idiot? Hardly!", "score": 1, "replies": []}]}, {"body": "Well the forward P/E is 64.27, which is TRIPLE the average for an american stock. So yeah it's incredibly over-valued and you should be worried. On the other hand it's rapidly approaching too big to fail status given the fact that every democrat believes electric cars are the only way towards a remotely sustainable future and it is consistently profitable. \n\nI'm not going to armchair psychoanalyze Elon Musk, but in my honest opinion Tesla is a personality cult as much as it is a company. If Elon stops sparkling Tesla will too.\n\nI personally think a better option for me personally will be Amazon. Investing in Amazon is investing in Rivian. In my mind Rivian will be the next GM and Tesla will be the next Ford.", "score": 0, "replies": []}, {"body": "I would honestly dump my life savings into Tesla. Nothing better than running the risk of getting randomly wiped out because your CEO had a bad day and throws a temper tantrum", "score": 0, "replies": []}, {"body": "Musk's business empire is probably 10% actual business, if that, and the rest is speculation and inflated stock value based on promises, most of which he won't keep.", "score": 0, "replies": []}, {"body": "I still have 100 shares and will find an opportunity to unload next week.  Elon is a loose cannon and that makes it too risky to invest in TSLA stock.\n\nIn the worst case, the stock drops may cause margins calls for inexperience investors if they go heavy on TSLA.  That's most likely won't happen but the possibility is higher than with other stocks.\n\nFor those who think they can short TSLA.  Please don't.  Statistic works against you.\n\nhttps://www.cnbc.com/2020/01/30/tesla-shorts-lose-more-than-1-billion-as-stock-surges-on-earnings.html\n\nhttps://www.cnbc.com/2020/02/03/telsa-shorts-down-8-billion-in-2020-including-2point5-billion-on-monday.html\n\nhttps://markets.businessinsider.com/news/stocks/tesla-stock-price-short-sellers-down-nearly-billions-total-lost-2020-2-1028924815", "score": -2, "replies": [{"body": "I agree but I think OP means a short term short. If feel if you buy puts Tesla will go down a bit more this week and he can profit.", "score": 1, "replies": []}]}]}
{"title": "Buffet sold his entire stake in airlines", "selftext": "Buffet mentioned Berkshire sold entire stake in four largest airlines $AAL, $DAL, $UAL, $LUV. \nSaying “It’s my mistake”\n\nHow does this change the sentiment in these in next few weeks to months?", "id": "gcfu69", "created_utc": 1588460588.0, "score": 110, "upvote_ratio": 0.95, "num_comments": 75, "comments": [{"body": "[deleted]", "score": 82, "replies": [{"body": "He was very blunt about being wrong as well called himself out in the call.", "score": 47, "replies": []}, {"body": "The people set to take over after buffet dies are highly praised by both buffet and munger.", "score": 4, "replies": []}, {"body": "Yup, I respect him even more. He’s humble, makes mistakes, owns up to it and tries again. He’s successful for a reason.\n\nSometimes diamond hands isn’t the way to go, sometimes you have to admit you were wrong and cut losses.", "score": 5, "replies": []}, {"body": "> the fact he was willing to admit he's wrong and not stubbornly hold them all until they all file chapter 11 shows he's still got it\n\n\nThis is why he's a billionaire... Admitting you're wrong, cutting your losses and moving on is incredibly difficult to do.", "score": 2, "replies": []}, {"body": "Yup he is 90 and Charlie boy is 96", "score": 1, "replies": []}]}, {"body": "Im hoping to hear less about airlines for a while.  I havent invested and only plan on LUV as a far \"maybe\" at some point over the next year.  I dont think airlines will become penny stocks but I do not think that things will be back to normal for a very long time, if ever.  Personally i have invested much more in defence such as LMT, that scratches my itch to invest in aircraft and it has a much better outlook.", "score": 26, "replies": [{"body": "I agree. I had some LMT before, but I acquired much more (bought at $278.11ish) because of it's long term outlook.", "score": 5, "replies": []}, {"body": "Why LMT out of the defense sector?", "score": 5, "replies": [{"body": "In my opinion, and especially after BA having such issues with their commercial planes sales, Lockheed is in the best position as they have billions in backorders for the F35 which is their new flagship fighter.  Those sales will last for decades just as the F16 before it did.  The old viper is beinv uodated and sold to many allied countries meaning Lockheed also supplies entire wings of these aircraft to many countries.  Consider military drones as well, Lockheed is in the game there competing with Northrop. Thats just the aerospace portion but they also produce many other defenses such as patriot missile batteries, etc.\n\nNorthrop and Raytheon are also decent defense stocks but in my opinion do not have quite the profile that Lockheed has built.  Also consider that Lockheed has a highly classified division that is working on future tech.  Defense spending will not be going away and the next generation of fighters after the F35 very well could come from Lockheed skunkworks.  Think not only aircraft but how about aircraft with an escort of drones all run by a single pilot.  Sky is the limit.", "score": 5, "replies": [{"body": "60% of RTX is commercial products too which are vulnerable. LMT is superior without question.", "score": 2, "replies": [{"body": "had limit order on rtx friday didnt trigger, glad it didnt. \n\nalready long heico which itself  I'm in deep red.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "RTX long hold imo", "score": 1, "replies": []}]}]}]}]}, {"body": "Trust me a lot of these airline companies will go BK and turn over. New companies will come in and just slap the new logo on the plane over the old. It happened with Pan American Airlines, Aloha Airlines, etc. if they don’t go bankrupt they just get bought out.", "score": 1, "replies": []}]}, {"body": "How do you unload 10% of AAL, LUV and DAL in a matter of weeks without tanking the stock?", "score": 31, "replies": [{"body": "> without tanking the stock\n\nHave you been watching airlines over the past month? I'm not saying there's a 1:1 relationship, but they've been eating shit since earnings.", "score": 46, "replies": [{"body": "AAL, DAL, LUV look to be flat in April. But I guess I can consider that tanking because even the cruise stocks went up like 30-50%", "score": 10, "replies": [{"body": "Actually you're right; I seem to have mentally blocked out all of the rallies prior to the dips. They dropped quite a bit after earnings, and didn't rally like other companies in April, but it wasn't as bad as I thought.  LUV had a big drop after the first week of April though.", "score": 11, "replies": []}]}]}, {"body": "Because a lot of people were buying thinking the industry had hit bottom? Especially in light of the general market looking good the past month.", "score": 9, "replies": []}, {"body": "I was thinking the same thing. who is  buying huge positions in airlines?", "score": 2, "replies": []}, {"body": "If there's extremely low volume and retail investors told that stonks only ever go up to buy them there shouldn't be much change in price.", "score": 4, "replies": []}, {"body": "have u been sleeping in north korea this past week?", "score": 4, "replies": []}]}, {"body": "a while back it was reported that he sold some of his airline stocks. but most speculated that he wanted to avoid >5% ownership restrictions. turns out he cut loose entirely", "score": 9, "replies": [{"body": "10%*", "score": 4, "replies": []}]}, {"body": "#One thing I learned from this guy - if it’s a bad bet (or think it’s a bad bet) - sell even with a loss and move on\n\nAnd me? When I realize that I made a mistake, I wait for the break even and ended up losing more", "score": 9, "replies": []}, {"body": "His investment strategy has always been the same buy more of your best and sell your worst. So I’m not surprised he sold them. I don’t really think it means the airlines are doomed just that it’s clear there is no money to be made in them for the foreseeable future say 5 years", "score": 7, "replies": []}, {"body": "Buffet buys, announces he bought (past tense) for some stock pump.  Buffet sells in the shadows, then announces he sold 100% (again past tense).  Stock tanks again.  Sure must be nice to move markets after you pull in your monies!...\n\nEdit: spelling", "score": 5, "replies": [{"body": ">Buffet buys, announces he bought (past tense) for some stock pump.  Buffet sells in the shadows, then announces he sold 100% (again past tense).  Stock tanks again.  Sure must be nice to move markets after you lick in your monies!...\n\nCan we really blame him?", "score": 1, "replies": [{"body": "People will eventually know, anyway.  Why I think he came clean after he sold it.", "score": 1, "replies": []}]}]}, {"body": "I’ll buy the LUV dip to the bottom I love being able to change/cancel flights and free bags", "score": 5, "replies": [{"body": "Is that a share holder perk of LUV? And how many do I need haha", "score": 4, "replies": [{"body": "It's an everyone perk", "score": 0, "replies": []}]}]}, {"body": "He was wrong, but people have to remember, a few years back airlines were good investments. AAL went from one of my best investments to one of my worst - and that was before COVID-19.", "score": 4, "replies": []}, {"body": "*cancel order cancel order*", "score": 4, "replies": []}, {"body": "This guy was smart. The unloading of $dal two weeks back was precisely so he could sell all of his airline stocks without raising a brow. Now on Monday these companies are going to get hit pretty badly.", "score": 5, "replies": [{"body": "Agree, I have small portion in AAL and going to seek as soon as premarket opens. Want to unload these as quick as possible. Pretty much broke even so imo it’s not worth the risk.", "score": 1, "replies": []}]}, {"body": "Airports not airlines. Airlines are screwed. Airports will still be there when air travel rebounds regardless of which airlines collapse.\n\nPAC, ASR, ARRPY, FPRUF, ANNSF, SPASF", "score": 7, "replies": [{"body": "Yes! Good advice! I bought PAC - but also some LUV. Both checked out well on gurufocus. Aircraft leasing also looks promising.", "score": 2, "replies": []}, {"body": "How does that make sense. Airports rely on airlines coming in and out to make money. They also rely on traffic inside and ticket sales (which they receive a cut). \n\nWithout airline traffic airports are done.", "score": 1, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Why would air travel rebound yet airlines go out of business? Also many of these infrastructure style businesses are just as levered up", "score": 6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Air travel will go down.  Covid19 will be a problem until a vaccine is made and given to basically all on earth. Which will take probably 2 years. \n\nSo any stock with relations to air travel and tourism will suffer for many years to come.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "UCO.\n\nBuy as much UCO oil stock as you can. It’s never been this cheap and will only go up once the demand curve comes back.", "score": -2, "replies": []}]}]}]}]}, {"body": "Couldn’t you make the same argument about the airport companies though? The infrastructure will always be there, but that isn’t a guarantee that they won’t go bankrupt. The infrastructure could end up being bought by a different company by the time this all is over", "score": 2, "replies": []}, {"body": "It's not a no travel vs. full travel issue. It's how much does travel rebound this year? 70% of flights with 50% of prior capacity? That's no good for airports either.", "score": 1, "replies": []}, {"body": ">People will not stop traveling by air. \n\nAnd yet they have. And numbers will be dismal for months (Lufthansa doesn't see a return to normal before fall)\n\nAnd that's just the acute problem. Then the structural problems will come. You will see basement prices in the first month to entice people to fly, seats will be sold at enormous losses in return for cash flow. After years, prices will double, as the number of operators fail, and the sharks feed on the carcasses.\n\nFlying as we know it, is dead.\n\n> The infrastructure is not rendered useless.\n\nThat first airport terminal is not useless, but that second expansion you just built?! Now completely useless. That third runway? Useless. That second regional airport you built last year just outside of the city? Useless.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "BA has 30% (or around there) of its revenue from the defense sector (U.S. government). Also, they still must maintain their planes in the travel industry such as parts, upgrades, etc. They are and will take a beating for sure, but I believe Buffett is looking long term.", "score": 9, "replies": []}, {"body": "yea I feel like Boeing is more fucked than airlines right now", "score": 2, "replies": [{"body": "The government will never let Boeing or GM go bankrupt.", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "And they got bailed out. And they paid off their debt rather quickly too.", "score": 2, "replies": [{"body": "That's very assuring to hear that the company survived and thrived while stockholders got wiped out.\n\nHow do I get in on this?", "score": 1, "replies": []}]}]}]}, {"body": "The department of defense alone can’t handle life without Boeing. Long term they will end up just fine.", "score": 3, "replies": []}]}, {"body": "Where r u seeing he owns any BA?", "score": 1, "replies": []}]}, {"body": "But who did Berkshire sell their airline stakes to?", "score": 2, "replies": []}, {"body": "It’s great there will be no second shoe. It’s not like he is saying “I’m going to sell all.”", "score": 1, "replies": []}, {"body": "Rogue wave", "score": 1, "replies": []}, {"body": "Am I a fucking idiot for covering my boeing and airline shorts on Thursday ? Has this kind of thing happened to anyone before?", "score": 1, "replies": []}, {"body": "Hmmm.... all my Jets ETF.... that’s not good....", "score": 1, "replies": []}, {"body": " sold all Friday? Has no sense\n\n&#x200B;\n\n[https://i.gyazo.com/5af30ace0531a81e67ed88b8a2b3767f.png](https://i.gyazo.com/5af30ace0531a81e67ed88b8a2b3767f.png)", "score": 1, "replies": [{"body": "Sold all throughout April. That number you are seeing is technically from September 30 2019. The big boys have until 45 days after quarter end to tell you what they did and their positions. Buffett was just telling every way early than he has to. He didn't really have to report his number until August 15th.", "score": 1, "replies": []}]}, {"body": "fuck, I have like 100 shares of Delta....I've already lost hits. Now more???", "score": 1, "replies": []}, {"body": "So will this be a good buying opportunity at low prices after everyone dumps these come next week?", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Also surprised that he kept OXY, considering oil producers heavily depend on airlines. I am planning on keeping BRK since it gives exposure to the “old school” industries (banks, food conglomerate, insurance), things that I don’t actively seek out otherwise.", "score": 1, "replies": [{"body": "I have Oxy too. Glad he didn’t sell lol", "score": 1, "replies": []}, {"body": "[deleted]", "score": -8, "replies": [{"body": "Thank you for the hearty laugh, I sincerely appreciate that", "score": 4, "replies": []}, {"body": "So I take it you’ve never heard of continuous learning? It doesn’t stop at high school, buddy. \n\nAnyways I’d rather listen to a senile Buffet than a random guy on reddit any day.", "score": 1, "replies": []}]}]}]}, {"body": "He always talks about focusing on microeconomics and not macro and shifting american travel tastes after this is over is definitely micro, so can't fault him for that", "score": 1, "replies": []}, {"body": "This was known by everyone so it’s not a secret or anything that he sold and markets have already reacted to the sell. I doubt this will do much to share prices come Monday. And since he’s held such a large position, now that he’s sold, I don’t see another large shareholder dumping.", "score": 0, "replies": [{"body": "Everybody was like \"he only sold to get under 10%!\"\n\nThis is a shocker", "score": 4, "replies": []}]}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/stonkfeed] [Buffet sold his entire stake in airlines](https://www.reddit.com/r/StonkFeed/comments/gcgeek/buffet_sold_his_entire_stake_in_airlines/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "score": 0, "replies": []}, {"body": "[deleted]", "score": -17, "replies": [{"body": "Heard $DAL has really good management and Ed is a great CEO. There are lots of positives but it all depends on how soon travel gets back on track.", "score": 7, "replies": []}, {"body": "What after your 3-6 months?? It’s gonna go back up where it was. Airlines are a necessity.", "score": 11, "replies": [{"body": "[deleted]", "score": 16, "replies": []}]}, {"body": "I’d say him selling already pretty much means it’s near bottom.", "score": 2, "replies": [{"body": "But that would mean he made a mistake in selling as it would have reached bottom. If he thought it had reached bottom than would keeping it and selling it after it recovered or partially recovered not be a better idea?", "score": 2, "replies": [{"body": "He’s sold his stake in April I’d attribute that to why most airline were flat in this bump. He also has obligations to his share holders to be more aggressive. Who honestly knows how it’ll all go. 🤷‍♂️I bought in low 20’s it’s a small position of my portfolio speculative and I’ll write call options with it collect premium and make income that way.\n\nMost likely it’ll trade sideways", "score": 1, "replies": []}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "gbxb8q", "created_utc": 1588384114.0, "score": 35, "upvote_ratio": 0.7, "num_comments": 72, "comments": [{"body": "The answer is drugs. This isn’t hard people he loves psychedelics", "score": 82, "replies": [{"body": "Man took 3 hits of LSD . Realized that corona is some government made fuckery and had enough.", "score": 18, "replies": [{"body": "LSD is thinking too small. Musk is fuck buddies with the DMT machine elves, screaming guidance while he’s balls deep mid-orgy session.", "score": 15, "replies": [{"body": "That’s actually right. No wonder he took the 5 minute break before tweeting the national anthem. Loading the pipe back up.", "score": 9, "replies": []}]}]}, {"body": "All the more reason to believe he’s playing 4D chess.", "score": 5, "replies": []}]}, {"body": "Firstly how are shares physical", "score": 16, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Such a good joke", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "It is a zoolander reference right before they smash the computer because the files are INSIDE.\n\nGood try trying to insult someone for no reason though, guess you got the internet figured out.", "score": 5, "replies": []}]}]}]}, {"body": "If you own a share you own a part of a company. The company is physical to a certain extent. If a company goes tits up and you own the shares of that company, you’ll receive money (if there is any left) from the liquidation, after the debts are paid.", "score": 1, "replies": [{"body": "How is a company physical?", "score": 0, "replies": []}]}, {"body": "They used to be pieces of paper", "score": 1, "replies": []}]}, {"body": "You’d get better answers by asking a magic 8 ball than you’d get asking here.", "score": 17, "replies": [{"body": "Lol, article writing by \"Tyler Durden\".", "score": 10, "replies": []}]}, {"body": "[removed]", "score": 15, "replies": [{"body": "Well first off its zero hedge so it definitely is retarded.\n\nHes claiming it's a ploy to avoid triggering a debt covenant. These covenants typically require the borrower to maintain certain financial or capitalization ratios. Sort of like a safety net. If the covenant agreement can protect lenders by forcing the debtor to declare bankruptcy, change leadership, or convert the debt to equity.\n\nBut its zero hedge so no.", "score": 16, "replies": []}, {"body": "THe zero hedge article doesn't make sense to me either but the twitter thread does", "score": 2, "replies": []}]}, {"body": "Authors call themselves Tyler Durden and don’t use the right abbreviation for million.  Nope.", "score": 3, "replies": [{"body": "Seems to me like his recent spew of tweets is similar to an autistic meltdown. He’s panicking and doesn’t know how to deal with his emotions.", "score": 5, "replies": [{"body": "He's always twitting some dumb shit.  Lost his TS for smoking weed.  Being a founding member of a tech company doesn't absolve you from being a fucking idiot.\n\nHim freaking out is nothing new, nor does it correlate to actual TSLA stock behavior", "score": 1, "replies": []}]}, {"body": "It's not one person. There are a bunch of people writing for that site and every article is posted as Tyler Durden.", "score": 3, "replies": []}, {"body": "My favorite part is the “fascist behavior of the government” in that tweet. How did this dude have enough time to write this up after his protest at the statehouse?", "score": 1, "replies": []}]}, {"body": "No", "score": 7, "replies": []}, {"body": "No, Teslaquilla beta testing.", "score": 3, "replies": []}, {"body": "It's much simpler than any of that... He was upset that people were saying he's ranting about covid to pump up the stock price, so he tanks it to prove them wrong. Proof on Twitter:\nhttps://twitter.com/elonmusk/status/1256669605881208841?s=19", "score": 3, "replies": []}, {"body": "You guys reading into this too much. He was high.", "score": 2, "replies": []}, {"body": "This is good for spacex.\nNow he can stop wasting time on cars.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Pretty sure Enron actually sold some electricity too. Just because Tesla is operational doesn’t mean it can’t also be perpetuating fraud. See Einhorn’s accounts receivable probing. Both can be true", "score": 3, "replies": []}]}, {"body": "You r right he literally said he is selling all his assets\n\n\nTsla stock is about to crash to 300", "score": 3, "replies": [{"body": "I mean, it's mostly speculation as of now. But Tesla follows general market trend, just with exponentially larger daily moves. If market sees another leg-down in the coming weeks/months, I can only assume Tesla moves with it accordingly. \n\nThen again, Tesla investors are almost cult-like and may never sell. A lot of factors at play but will likely take a small position in a long-dated put if we see a relief rally next week.", "score": 5, "replies": [{"body": "Most people didnt want to hear what he said\n\n\nSounds like he is gonna sell all his assets\n\nStocks are his number one asset", "score": 2, "replies": [{"body": "And they shrug it off as shitposting. Something seems like it’s brewing this time. We’ll see how it pans out", "score": 1, "replies": [{"body": "He is insane", "score": 1, "replies": []}]}]}]}]}, {"body": "Ridiculous... [EM gets performance bonuses](https://www.cnet.com/roadshow/news/tesla-ceo-elon-musk-pay-salary-bonus-stock/)", "score": 1, "replies": []}, {"body": "The SEC probably won't approve Elon to exercise any options or sell off Tesla shares in the forseeable future. Be sure that any changes like stock splits or share buybacks will be declined as well. How is this brilliant?", "score": 1, "replies": []}, {"body": "Elon finally capitulated. He was always playing on the edge but the coroneconomy pushed him off the cliff. He gave fair warning, take heed or not.", "score": 1, "replies": []}, {"body": "Zerohedge creating and promoting garbage. 99% of conspiracies they post are flat wrong just so they can say they were right 1% of the time and pump themselves up on it. Brainwash", "score": 1, "replies": []}, {"body": "Lol what a bullshit witch hunt. I’ll say it again, Elon doesn’t care about money.\n\nSecondly Tesla is not even close to bankruptcy, the market cap is 112b. I think there is plenty of room for it to fall down to even 30b and lever how many billion it needs in private equity.\n\nGod I hate twitter.", "score": 1, "replies": [{"body": ">Secondly Tesla is not even close to bankruptcy, the market cap is 112b. I think there is plenty of room for it to fall down to even 30b and lever how many billion it needs in private equity.\n\nThat's not how balance sheets work.", "score": 2, "replies": [{"body": "I know. I’m over simplifying it, if you want to be a Nancy about it;\n\nThey have plenty of cash on hand and assets to survive, they can still Leverage, and also they could have rounds or private equity.\n\nThe market caps reflect all these possibilities.", "score": 1, "replies": [{"body": "What you posted was incorrect, not an oversimplification.", "score": 2, "replies": [{"body": "Move along if you don’t understand.", "score": 0, "replies": [{"body": "No one who understands would have phrased it as you did.", "score": 2, "replies": [{"body": "Except you know, I’m a professional specifically in that space. So yeah, everyone would say the same thing, let me explain.\n\nMarket caps reflect all the possibilities and likeliness of these possibilities happening. It’s an oversimplification to say Tesla won’t go bankrupt because it’s trading at such a high PE and market cap is so high, but it reflects that the investors absolutely do not think bankruptcy is a possibility.\n\nWhich is why companies with high likelihood of bankruptcy have no volatility. It’s a certainty or almost certain they’ll go bankrupt.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I might be way off base but could it be that at this price it would be hard to raise outside investment capital to survive? Aside from the fanboys who the hell wants to put up 1.5 billion dollars for 1% of telsa as an example?", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "> implying WSB is more accurate with their DD", "score": 3, "replies": [{"body": "Implying you sub there and here... ¯\\\\\\_(ツ)_/¯", "score": 1, "replies": [{"body": "Nope, this article was a RT from fintwit. I don’t reject speculation based on a hive-minded negative perception. The more information, the better. Knowing what Cramer or other manipulating investors and investment firms are spewing to the masses is just as important of information as well thought out DD. \n\nConfirmation bias is a bitch.", "score": 2, "replies": [{"body": "Lol. Twere jokes, mate. When I said you sub here and there, I was calling you super dumb, which is a compliment in wsb. Never go full reversed inverse. Cheers.", "score": 2, "replies": [{"body": "I’m honored", "score": 2, "replies": [{"body": "Cheers.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Ban", "score": -4, "replies": [{"body": "Go back to r/stocks", "score": 4, "replies": [{"body": "What the shit are you going on about pussy", "score": -8, "replies": [{"body": "Calm down. Your autism is flaring", "score": 6, "replies": [{"body": "For real though, why do you check sites like the one you posted?", "score": -1, "replies": [{"body": "Diversification of reading sentiments and potential projections. I thought this was an interesting take with some fair points, doesn’t mean I am 100% on-board with it.", "score": 6, "replies": [{"body": "Yeah that's valid. Good luck ma man", "score": 3, "replies": [{"body": "Thanks boss, same to you.", "score": 6, "replies": [{"body": ":)", "score": 6, "replies": [{"body": "now kiss", "score": 3, "replies": []}]}]}, {"body": "nah keep fighting", "score": 3, "replies": [{"body": "Ya mom's a hoe", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Big if true.", "score": -1, "replies": []}]}
{"title": "Key Points of Focus through Mid-May: Bear Market Return to Form", "selftext": "[deleted]", "id": "gceikv", "created_utc": 1588455598.0, "score": 103, "upvote_ratio": 0.91, "num_comments": 70, "comments": [{"body": "The difficulty of a vaccine is a huge factor. Once those trials run into hiccups (v likely), I think worries really kick in \n\nBut who knows, maybe yesterday kicked off the end of the rally already.", "score": 33, "replies": [{"body": "People are very optimistic about a vaccine for no good reason.   We've never successfully deployed a vaccine for a coronavirus.  ADE is a concern if an improperly tested vaccine rolls out.  Basically, people have a higher likelihood of death after getting a vaccine due to the immune system going full retard\n\nAnd there are deadly viruses like AIDS and HepC that have been around for decades that are only recently getting cures/treatments effective enough to make them a chronic condition. \n\nHonestly,  and I say this knowing I sound like a fascist,  we should start taking volunteers from young, people with no preexisting conditions, give them covid-19, and isolate them until they get better.  Herd immunity is the only surefire cure for this.", "score": 25, "replies": [{"body": "Herd immunity is a lie.  When has it ever been acheived without vaccines?  Name an instance.  It’s a pipe dream, it will never happen without mass death and probably still won’t happen.  Even if it does, next year could be a new strain, just like the flu.  We don’t even acheive herd immunity for the flu, and we have a vaccine for that.  It’s the most senseless idea I can think of in this scenario.", "score": 12, "replies": [{"body": "How do you think the old world survived small pox without being devastated every couple of years like happened with the black death?  Sure, there were frequent outbreaks and epidemics, but they were NOTHING compared to what happened to the native Americans after smallpox was introduced when they had no immunity at all which was a Black Death level event.\n\nSecond, the flu IS subject to herd immunity.  While the flu changes over time, it doesn't instantly render your antibodies useless.  Instead, as the virus diverges, they provide less and less protection over time but still provide resistance to similar viruses.   For example, did you know that survivors of the 1918 flu pandemic were found to be resistant to the 2008 H1N1 flu pandemic?  Flu vaccines, while the desirable way to prevent the flu, actually result in fewer antibodies and weaker immunity than actually having the flu.\n\nHerd immunity is a mathematical function. What you have to keep in mind is that herd immunity isn't an on/off function, it's a sliding scale.   Let's say New York had 20% of its population infected in this coronavirus wave.  That means that 1 in 5 transmissions that would happen in the next wave won't happen.  Let's say the natural R0 of coronavirus is 6.  After the first wave, it's only 4.8.  Another 20% get infected in a second wave.  That brings your R0 down to only 3.6.  So on and so on, until we hit 83% total immune when R0 is reduced to 1 and it becomes literally impossible for the number of cases of the virus to rise.\n\nI highly doubt there is the political will to do what I suggest, but if you deliberately infect people highly likely to survive at a controlled rate, I believe the overall death toll and economic impact can be decreased.", "score": 19, "replies": [{"body": "You must both be making different points, because you are ackmowledging here that herd immunity won't stop outbreaks.  They may be pointing out that people believe herd immunity will causw the virus to disappear", "score": 3, "replies": [{"body": "Herd immunity will cause Covid to go from a disease that requires lockdown of society to a disease that will pop up every once in a while and kill a couple thousand people. That is a huge win", "score": 2, "replies": [{"body": "It could kill 10% on the way there.  Don’t even try to tell me the death rate is less than 1% because we are sitting at 65,000 deaths and 2 weeks ago the total case count was about 500,000.  It is likely to become a seasonal flu at this point, with or without herd immunity.", "score": -1, "replies": [{"body": "The death rate is MUCH LESS than that. All the randomised testing studies have shown there are shit loads of people that have been infected and didn't even know it.", "score": 5, "replies": []}, {"body": "The biggest problem with society is we do nothing to stop retards like you from breeding. It’s killing 10% of the people who test positive for it, numb-nuts. Average age of the population is 37, while average age of those dying from the virus is fucking 80. Young healthy people aren’t testing positive because they don’t need to go to the fucking hospital.", "score": 0, "replies": [{"body": "Wow man its still the weekend and you’re angry AF, you might want to find a better way to cope with whatever is up your ass", "score": 1, "replies": [{"body": "Just please, for me, stop being so retarded so I can stop being so frustrated.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "So you prove my point with your first thought there.  Just look at the native americans and small pox.  Did they reach “herd immunity”?  No it was a genocide.", "score": -3, "replies": [{"body": "You belong here more than most 😍", "score": 8, "replies": []}]}]}, {"body": "It’s not a lie. It worked during the bubonic plague after 300 years", "score": 2, "replies": []}]}, {"body": "Wut bout Oxford monkey 🐒", "score": 2, "replies": []}]}]}, {"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 8, "replies": [{"body": "God bot", "score": 0, "replies": [{"body": "Our Lord and savior bot", "score": 1, "replies": []}]}]}, {"body": "Do you think the summer will kill the virus? As you say we might see a surge in cases (I agree with you) but investors may shrug it off because we are going into the summer", "score": 7, "replies": [{"body": "This goes back to the \"pre-virus\" economy we had. We have been expecting a recession for a while, based on the levels of debt, lower growth, and already high level of stimulus. I think real, institutional investors are not looking at this as oh, the virus is gone we are better. They're looking at the crater we just punched into the economy. No, even if the virus is less communicable during the summer, I think there is a horror show from Q2 which will stay with us. Right now, I believe we will have a 5-7 year recession. We're due for it, and we are just way overleverage and need to blow off all the bad debt companies have taken on, and deflate. But, as we get through the Spring, knowing how a bear market typically works, we could see a trend up after a May / June trend down. Good news through the Summer, fighting with bad news from the economy / prep for a worse CV / Flu season in the Fall.", "score": 9, "replies": [{"body": "I agree.  I blame The Trump tax cuts, buybacks and low interest rates for inflating the stock prices to current levels.", "score": 13, "replies": [{"body": "Blame what they started in 08 Trump just followed through. In fact blame what they did in 00 that Obama continued on. And so forth until you realise it's been a Ponzi scheme of shit monetary policy by absolute idiots who only care about re-election regardless of political allignment for the last 100 years when they realised in 1930 you can print away problems until you eventually can't.", "score": 4, "replies": []}]}, {"body": "There's nowhere for money to go tho with bonds all around the world at 0 or near 0% yield\n\nS&P has a ~2% yield\n\nPeople are still going to use pension funds that will buy the market every months no matter the current market conditions\n\nI'm not saying you're wrong, but do you really want to keep most of your money in cash when the fed in injecting trillions in QE and yields are at/near 0 virtually everywhere ?\n\nAnd i'm not talking about next month, i'm talking like you medium/long term 5-7 years out. Not saying we're at spy 400 in 12 months but as long as the stock market (and the US one at that) is the best place to invest your money i don't see us underperforming for years\n\nSpy might visit 150 in the meantime, but i don't see it staying there for long", "score": 3, "replies": []}]}]}, {"body": "even with a vaccine which may take an enormous amount of time, it may take a longer time to produce it and manufacture. then more time to distribute it. then insane busy pharmacies and doctor offices to give the vaccine. then it may take weeks until actually protected from the virus with the vaccine. and still with such a large number of people getting the vaccine it may have even more issues after the fact. there's way too many what ifs", "score": 8, "replies": [{"body": "I think there are many more \"what ifs\" to jump through and lead to a positive, quicker recovery, than there are the more practical \"this is a disaster\" points that underlies the bear case, right now. Of course, if we have a viable vaccine tomorrow, I would shift my positions accordingly.", "score": 2, "replies": []}]}, {"body": "not bad, fundamentally solid argument, a lot of moving variables. I think you’re ahead of the curve", "score": 6, "replies": []}, {"body": "Very underrated post. Sound logic, great points. \n\nSPY 230p 1/15/21\n\nIWM 105p 7/17/20\n\nI may begin to scale more into LEAP SPY puts in the coming weeks. While selling short term puts on companies I'd be comfortable owning during all this.", "score": 3, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Agreed. But you’re not factoring China trade war 2.0, this time with more terrible. \n\nSPY 180 by the fall.", "score": 2, "replies": [{"body": "Donny Pump ain't letting that happen!!", "score": 1, "replies": [{"body": "Daddy trump will lead the charge himself. \n\nTaking China down > market \n\nAnd plays better with his base.", "score": 1, "replies": []}]}]}, {"body": "[What are your thoughts on this?](https://www.reddit.com/r/wallstreetbets/comments/gbzxft/the_bond_market_crash_begins_on_may_12th_and_13th/) Considering you're thinking the rally will end Mid-May.", "score": 1, "replies": []}, {"body": "wait so what do u think is gonna happen to the oil tanker stocks like EURN and NAT", "score": 1, "replies": []}, {"body": "Look into VXX call debit spreads as well. Some great risk/reward there.", "score": 1, "replies": []}, {"body": "Based on what i am seeing this weekend the bull market has only begun", "score": -6, "replies": [{"body": "Based on what I’m seeing this weekend the _bear_ market has only begun.", "score": 15, "replies": []}, {"body": "Elaborate?", "score": 6, "replies": [{"body": "I made a post about it am i being shadowbanned??", "score": -2, "replies": [{"body": "Well, I looked through your profile and all your posts are deleted. Now I’m even more curious what you’ve been writing.", "score": 3, "replies": [{"body": "This is insane\n\nIm being shadowbanned\n\nFuck this shit\nMan", "score": -3, "replies": [{"body": "lmaoooo what", "score": 1, "replies": [{"body": "This board\nIs heavily censored\n\nEvery original post is deleted\nOr\nShadowbanned", "score": 0, "replies": [{"body": "if you were shadowbanned, I wouldn't be able to see you", "score": 3, "replies": [{"body": "My original posts r deleted\n\n\nReplies r not\n\nI Am being censored from op", "score": 1, "replies": [{"body": "That is impossible to do", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "So your got bear philosophy driven by a coronavirus resurgence mid May, am I reading that right? What if there isn't a resurgence and more states open or set time lines for opening. What about hundreds of thousands if not millions of consumer spenders who are now stuck in a unemployment backlog getting a big payout of all the weeks they're due? What if Congress passes a state and local government bail out or an infrastructure bill? What if the weather is nice and sports start coming back and people just feel more optimistic?", "score": -4, "replies": [{"body": "I would never tie myself to a position without continually revising based on new information / data. If we have a vaccine tomorrow? Great, then I'm not looking at Corona anymore, but at the damage the shutdown caused. If there are fewer cases, or we prove we can work safely? Great! There is a lot else to the post though, so I would encourage further review and reading...\n\nThe unemployment backlog comment I would bascially need another post to answer completely, but here's the summary: The people on unemployment were/ are in a situation of non-productivity -> we would have expected them to produce, but due to the virus, they are not. We are taking out debt as a country to finance the spending programs and get through this crisis. The high US debt level has a negative impact on long term GDP growth, which ties in to the overall weak state the US / global economy were in, prior to this pandemic. So, any short term boost their Trump-Bucks bring would be outweighed by the problems the virus has caused to the overall economy... My thoughts.", "score": 13, "replies": []}, {"body": "\"what if all of the bad things just disappeared\"", "score": 13, "replies": [{"body": "*what if Rona makes a comeback?*", "score": -5, "replies": [{"body": "it hasn't left yet you fucking tard", "score": 9, "replies": [{"body": "I never know how harshly to respond to a comment like his, but you got the right tone - thank you.", "score": 10, "replies": [{"body": "I'm always here for you gordon", "score": 7, "replies": []}]}]}]}]}, {"body": "So you're asking if... what if all the bad stuff disappeared overnight because... reasons?\n\nThe virus isnt taking a break bud. The daily cases have been growing steadily over the past week as states open.", "score": 10, "replies": []}, {"body": "Well that's why we put our money where our mouths are", "score": 2, "replies": []}, {"body": "Who cares about virus cAses!\n\nEconomy opening is\nBullish", "score": -3, "replies": [{"body": "if you're wondering why you might be banned it might be because you're posting dumb shit like this", "score": 1, "replies": [{"body": "Its not dumb\n\nAs long as economy is reopening and data shows reversal of a black swan big money will buy assets from here\nNo one cares about cases as virus kills less than a flu with zero\nVaccine", "score": 1, "replies": [{"body": "> and data shows reversal of a black swan \n\ntrue but that's the part you've left out that remains inconclusive", "score": 1, "replies": [{"body": "Dude there are billions of people\nOn planet earth. 60k deaths is meaningless\nIn end And rearview\n\nBlunt but truth", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Dude. More people have had corona than we first expected. A few weeks ago They determined that a lady in washington died from corona 2 months before (what they previously thought) was the official first case in the US.\n24% of new yorkers have antibodies\nBefore we even freaked out we were probably at peak jnfection. That shit will have an impact, but its by and larger OVER those people are just another statistic (sorry), like all those people that die because they get i to a car or eat toomuch shittyfood.\n \nAlso, the world is opening back up. Economy will start again. Yeah we’re going to have some shitty quarters but who the fuck DIDN’T know that?\nAND amerislaves are getting paid MORE fucking money on unemployment than working they’re stupid walmart jobs\n\nThe market tanked Last week because it was run up on earnings. Bozos got summoned and Muskeroni lost his noodle on a perfect legit, and i’m sure, insightful and creative tryptamine inspired elf love festival.\n\nThe oracle from comaha had some bad things to say about airlines, well duh, and we’re going to have a bad year, well duh. But what investors are going to realize is that stocks are going to go up and if they should buy now before the next guy does\n\nTldr; if you bought stocks at any time before during or after the great financial crisis of 2008 you would have made awesome returns. And in ten years the same will be true. And you’re gay", "score": -5, "replies": [{"body": "Also, sorry i need to add, this is a global situation. As such its affecting everyone except apparently some island nations. So who the fuck is the US’s competition? Bar flu central? Doubtful. EU, too comfy in their social net (can confirm its WAY better to live here than the US, but its not risk inspiring)\nWho else? Africastan? South banana republic? \nThere’s no one. Foreign investors are going to dump into US equities ESPECIALLY as their economies falter\n\nDisclaimer i’m selling puts and buying calls", "score": 1, "replies": [{"body": "Great to have a contrarian view, thank you for your posts! I do feel that we have not hit a point where the infections in the US are providing a heard immunity. This is, of course, speculative, because testing in the US is not pervasive enough to give anyone an accurate picture, one way or the other.\n\nAs to who our competition is? This is not a zero-sum game. The economy works through connections - whether within the US or to other countries abroad. Our supply chains and trade are set up globally, and we don't win if others are losing and vice versa. Emerging markets are seeing declines in investment, yes, but when the futures earnings potential of US countries is declining due to the corona virus or other economic conditions, it drags everything down. Whether the Fed and Congress ruin that with reckless monetary policy and spiral us into uncontrolled inflation is irrelevant; further inflows of foreign investment to our markets does not mean the asset prices will expand further or even remain at their current levels. \n\nOne note: too many puns? Amerislaves? Bozos? C'mon man...", "score": 6, "replies": [{"body": "Yeah we know how the economy works, and earnings and all that shit. But stock prices are driven by people trying to get as much out of their money as possibøe. When the connections breakdown, they breakdown for both sides, and when resulting earnings are bad they’re bad for both sides. \nWreckless monetary policy, commited by many sides (not all). So tje question is where will people decide to park their money? US, for alot of reasons. Its got alot of problems and its society is totally fucked but its still an economic and military powerhouse\n\nAnd my puns are great, some people say they’re the greatest", "score": -1, "replies": [{"body": "I mean, even if you are right and by some miracle US continues to outperform, then the massive investor flight to US equities due to these very expectations will bring down the per share return to the global average, so it is possible that your notion turns out to be self-defeating.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "gcfwfi", "created_utc": 1588460820.0, "score": 105, "upvote_ratio": 0.85, "num_comments": 74, "comments": [{"body": "Sell for 10% or let expire worthless?  In one of these situations you still have some money.", "score": 61, "replies": [{"body": "At this point might as well let it ride..", "score": 21, "replies": [{"body": "Why not roll your 500 into something that has a chance? \n\n\nA.) that’s 500 less you’d have to remake later on\n\nB.)You belong here", "score": 62, "replies": [{"body": "This is what I was getting at.  I know mentally it sucks selling down 70-80-90%, but there’s the potential to come back with future trades.\n\nWe need what, like an 18% pop for those calls to move in the money?  And it’s not happening.", "score": 20, "replies": [{"body": "He’s in denial. Let him watch it go to zero", "score": 25, "replies": []}, {"body": "this, can you keep playing or do you need 10 hail marys in a row?", "score": 2, "replies": []}]}, {"body": "This is what I thought about my tesla puts following earnings... Only too watch them go way ITM", "score": 2, "replies": [{"body": "Amazon isn’t going 300 past it’s all time high in a few days.", "score": 3, "replies": []}]}]}, {"body": "Buffett is talking, HOLD!", "score": 4, "replies": []}, {"body": "No sell amazon will not hit 2800 this week and IV is gonna fuck you", "score": 7, "replies": [{"body": "Implied volatility is the least of his problems right now.", "score": 10, "replies": []}]}, {"body": "Then prayers are what you need.  Good luck.", "score": 2, "replies": []}, {"body": "If the market is green Monday amazon will be up", "score": 2, "replies": [{"body": "Not 2700 by Friday up.  He’s gotta sell.", "score": 11, "replies": [{"body": "But he could sell for more if it goes up Monday. Depends on how much", "score": 2, "replies": [{"body": "I feel you, just trying to help prevent another diamond hands loss.", "score": 5, "replies": [{"body": "I feel like somehow this next week is going to be so chaotic both the bulls and the bears loose money", "score": 0, "replies": [{"body": "Without a plan I think you’re completely right.  Don’t dance, or you’re going to find your way into plenty buy high sell low situations.\n\nI’m in MPC and USFD calls, but hedged up with about 50% SBUX puts.  Starbucks is a bit expensive right now and has reacted strongly to market dips.  Initiating that position definitely stopped some bleeding on Friday.\n\nGood luck out there.", "score": 2, "replies": [{"body": "All my money in spy puts right now", "score": 2, "replies": []}]}]}]}]}]}, {"body": "AMZN doesn't limp dick an entire day by falling 7% just to go green Monday. There's a reason it did that...", "score": 1, "replies": []}]}, {"body": "Bet they print", "score": 1, "replies": []}, {"body": "No that's called sunk cost fallacy and entirely stupid - take your losses and reinvest - no magic is going to happen to miraculously turn this into a positive situation for you.", "score": 1, "replies": []}, {"body": "Me anytime my options decrease by literally any amount\n\n(also me when my options increase by literally any amount)", "score": 0, "replies": []}, {"body": "You and Davey Day Trader have something in common: hopes ER would get the price to jump, but it failed miserably", "score": 0, "replies": []}, {"body": "Oh fuck, May will crush your CALLs to $.01", "score": 0, "replies": []}]}]}, {"body": "You're going to need bezos to pull a reverse Elon.", "score": 23, "replies": [{"body": "Amazon stock price is too low imo, coronavirus cure by Amazon prime is close", "score": 21, "replies": []}]}, {"body": "I don’t understand the want to buy at ATH during what appears to be the onset of a recession. Money is a hella of a drug RIP", "score": 13, "replies": [{"body": "So, puts?", "score": 3, "replies": [{"body": "yes its heading back below 2000 (1900)", "score": 1, "replies": []}]}]}, {"body": "Haha 2700 is retarted", "score": 7, "replies": [{"body": "What a retart!", "score": 8, "replies": []}]}, {"body": "This post was flaired as a loss so it's on the loss list. [Find more losses here](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ALoss&restrict_sr=on&t=da)\n\nLoss flair is for losses of $10K in shares or $2.5K in options, or more. \n\nAdditionally, OP ***MUST*** post positions and timeframes of the major trades represented in this screenshot as a reply to this comment within 30 minutes.\n\nIf OP misused the flair or did not post positions, please report the thread and contact the mods via modmail and OP will be banned.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "Just use that 500 and buy puts on amazon make some back!!", "score": 5, "replies": [{"body": "“Ee baught puts? Paump eet.”\n\n- Bezos", "score": -3, "replies": []}]}, {"body": "U got smoked", "score": 2, "replies": []}, {"body": "Stop loss at 10-50% would have saved you 2k or more. Enough to rebuy at the bottom ...and lose another 50% next week", "score": 2, "replies": [{"body": "But would a stop loss set up save you after/pre market when stocks just tank on earnings?", "score": 1, "replies": [{"body": "I guess it depends if you have pre after market access some ppl do. Dont hold over night or dont play earnings otherwise you know the game, stonks casino bro.", "score": 2, "replies": []}]}]}, {"body": "I’ll buy them from you fam", "score": 2, "replies": []}, {"body": "Same position, got a $2660 call, currently down $2000. Decided to hold to see if some magic happens on Monday", "score": 3, "replies": [{"body": "Magic Monday’s here we come", "score": 2, "replies": [{"body": "Monday gonna have to step up the magic pretty quick", "score": 2, "replies": []}]}]}, {"body": ">**Can we have a group prayer for Amazon this week**\n\nYes, let's also speak in tongues and handle snakes.\n\nEdit: In all seriousness though, I don't see how it can go to 2700. If there is a bounce on Monday, I would sell.", "score": 1, "replies": []}, {"body": "Thots and prayers bitch", "score": 1, "replies": []}, {"body": "Same here, bro", "score": 1, "replies": []}, {"body": "Those losses aren’t big enough you rookie", "score": 1, "replies": []}, {"body": "Didn't he say the company isn't profitable during COVID? How long do you think this lasts?", "score": 1, "replies": []}, {"body": "F", "score": 1, "replies": []}, {"body": "F", "score": 1, "replies": []}, {"body": "Oh brother, spy too...amzn hurting.  Lord above help our bull brothers.", "score": 1, "replies": []}, {"body": "Exp 5/8? Do you people even care about money?!", "score": 1, "replies": [{"body": "It was an earnings play", "score": 3, "replies": [{"body": "You should have sold at open yesterday. It went down on earnings so you already lost your bet, the assumption on which you placed your trade was proven invalid. Take the L and use the leftovers for something else.", "score": 1, "replies": []}]}]}, {"body": "Curious to know what was your thought process to buying AMZN calls 2700 5/8?", "score": 1, "replies": []}, {"body": "At a certain point, you gotta cut your losses dude. I sold my 4/20 spy puts at $1200, I bought them at $6000", "score": 1, "replies": []}, {"body": "You bought the top you retard, now eat the shit bag bagheld position", "score": 1, "replies": []}, {"body": "So before today, your gains were at almost 100% before you sold. I don’t feel sorry for anyone who can’t take 90%+ gains and end up losing it all, learn when to take some for yourself man. You could’ve sold one contract at least and be down close to nothing now.", "score": 1, "replies": [{"body": "It’s not that I didn’t want to sell, I had no day trades left, cause I added more into my position at 18$ and it went to 29$. My fault though", "score": 0, "replies": [{"body": "Bruh just take ur pdt violation like a man. It only takes a couple of minutes to open another account.", "score": 0, "replies": []}]}]}, {"body": "And to think you were making around 2k before earings. Well done retard.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Oh for sure. I definitely don’t think it’s gonna get to 2700$ strike price, but at least with that hard dump on Friday, it could bounce back a bit on Monday so I can cut my losses", "score": 3, "replies": []}]}, {"body": "حَيَّ عَلَىٰ ٱلصَّلَوٰةِ", "score": 0, "replies": [{"body": "Gesundheit", "score": 4, "replies": []}]}, {"body": "I hope it burns", "score": 0, "replies": []}, {"body": "Yes, I’ll pray that Amazon drops coming week. Your stupidity deserves that.", "score": -4, "replies": [{"body": "C'mon buddy... You know damn well you've made stupid ass plays just like this. Shit I'd wager you've made dumber ones", "score": 6, "replies": [{"body": "It wasn't a stupid play. It was an educated guess but ran out of luck on this one", "score": 1, "replies": [{"body": "You're right... Maybe this isn't a stupid trade. BUT if we had more info on the actual trade then we could better conclude if it's stupid or not. OP didn't give trade details. Just for us to say a prayer", "score": 1, "replies": []}, {"body": "No it was definitely stupid. \n\nAmazon at ATH's by a lot. Up 30% in a month. Expenses going through the roof. Logistics issues. Massive decrease in spending from consumers released the day before...\n\nYea people are ordering shit online but you forgot 30 mil people aren't spending much money right now. My fiancee and I have super stable high paying jobs and we've cut spending by like 70%. Imagine what actual in-danger people are doing. \n\nAn educated guess would have been puts due to the run up, selling options, or sitting out, not calls. Calls were not \"educated.\"", "score": 1, "replies": []}]}]}]}]}
