{"title": "56% annual return since Jan 2008 (27% since 1928) -- Automated Leveraged Strategy", "selftext": "Hey everyone, I automated this investment strategy after reading some quant papers about it and thought others might appreciate learning about it! Before the \"everyone is a genius in a bull market\" - I know. Besides, this strategy has been backtested to 1928. Here's the original quant paper: [https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=2741701](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2741701)\n\nEdit: the source code\n\nEdit: [Hosted version](https://getquantbase.com/) (how to actually run/invest in it).\n\nFolks the amount of y’all that have messaged me asking for the source code and hosted version is absolutely AMAZING but I can’t keep up! Posting the links here for you guys\n\n&#x200B;\n\n# TL;DR\n\nReturned 56% compounding annually, including \\~45% during 2020. Max drawdown a (nerve-wracking) 55.6%. Automatically trades \\~1x per quarter, for every \"losing trade\", it makes 2.3 \"winning trades\". For comparison with the market, it has a risk-adjusted return (via the Sharpe ratio) of 1.83 vs the S&P \\~0.4. Needless to say: this strategy is high risk.\n\n# How it works\n\nThis strategy utilizes 3x leveraged funds. They track the S&P, but each day they leverage 3x, so in a day you get 3x the return of the S&P (whether it goes up or down). These get a bad wrap because of volatility drag (sideways markets or those with rapid price changes eat the gains as the fund re-leverages each day) and their drawdowns, and are consequently mainly recommended only for day-trading (and not for long-term holds). Recommend you do your own research here to make sure you understand the risks.\n\nBeyond that it's very simple: when the S&P is above its 200 day moving average price, hold UPRO (a 3x leveraged fund). When the S&P is below its 200 day moving average price, rotate to cash.\n\n# Performance\n\n**Quick stats (1928 - 2015):**\n\n\\- Annual return: 26.8%\n\n\\- Sharpe ratio: 0.4 (vs S&P 0.3)\n\n\\- Max drawdown: -92.2% (yikes)\n\n\\- Avg trades per year: 5\n\n**Quick stats (2009 - 2021):**\n\n\\- Annual return: 56.16%\n\n\\- Sharpe ratio: 1.83 (vs S&P 0.4)\n\n\\- Max drawdown: -55.60%\n\n\\- Avg trades per year: 4\n\n# How to use this\n\nDoing it by hand is one way (but perhaps a lot of work and emotional given the riskiness of this strategy).\n\nIf you're looking to get started with this or code it yourself, let me know and I can help you get started, otherwise curious what everyone thinks. Cheers.", "id": "nnw6cf", "created_utc": 1622321923.0, "score": 68, "upvote_ratio": 0.92, "num_comments": 53, "comments": [{"body": "Hello! It looks like you might have submitted a post about getting started, looking for book/YouTube/podcast recommendations, or another commonly asked question on /r/StockMarket. To help new investors and traders with these questions, we created a comprehensive [market toolkit](https://github.com/ckz8780/market-toolkit) which has lots of resources for new and experienced traders alike. Here are some direct links in it that you might find useful:\n\n- [Getting Started](https://github.com/ckz8780/market-toolkit#getting-started)\n- [Books](https://github.com/ckz8780/market-toolkit#books)\n- [YouTube Channels, Talks and Speeches](https://github.com/ckz8780/market-toolkit#youtube)\n\nThe phrase or keyword that triggered this response was \"**get started**\". Here's [a customized link that will search the whole subreddit](https://www.reddit.com/r/StockMarket/search?q=get started&restrict_sr=on&sort=relevance&t=all) for the same topic.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/StockMarket) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I've read this exact paper and have been waiting for the right opportunity. I'd appreciate any guidance on how to automate/use this, rather than doing it manually. How long have you been following this?", "score": 19, "replies": [{"body": "I've been doing this manually for maybe \\~6 years (but it's a lot of effort for sure), but working on automating it too! If you're interested I can PM a link to the hosted version I've been working on.", "score": 14, "replies": [{"body": "I’d like the link too, please.", "score": 3, "replies": []}, {"body": "I’d like a link please! And any instructions would be very helpful as I’m new to this stuff :)", "score": 2, "replies": []}, {"body": "I'd love a link, thank you!", "score": 2, "replies": [{"body": "PMed!", "score": 2, "replies": [{"body": "Me too please", "score": 2, "replies": []}, {"body": "i'd love to take a look at your code!", "score": 1, "replies": []}, {"body": "I'd like a link too plz", "score": 1, "replies": []}]}]}, {"body": "If possible, could you PM me a link to the hosted version you have been working on?", "score": 2, "replies": []}, {"body": "Can I get a link?", "score": 1, "replies": []}, {"body": "Can you send me the link too?", "score": 1, "replies": []}, {"body": "Commenting to hopefully get a link. Thank you in advance.", "score": 1, "replies": []}]}]}, {"body": "For what length of time was that drawdown of 96%? Would be interesting to know what caused such a dismal performance, although if I had to guess, I'm assuming it came from the 2000s/1980s.\n\nAlso, I wonder if you could get a better performance using a 150 day moving average, or even lower (100 day?)", "score": 9, "replies": [{"body": "I’ve heard a 225 day moving average does better with the sharpe ratios in backtests", "score": 6, "replies": [{"body": "Interesting. My hypothesis was that any drop below a 150 day moving average would have a high probability to see the drop continue below the 200 day average.", "score": 3, "replies": []}, {"body": "Source?", "score": 2, "replies": []}]}]}, {"body": "The source code you linked is for some Reddit sentiment trader, not the strategy you outlined here.", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "The hosted version has both it looks like, the WSB strategy under special and this Leveraged strategy under “More Risk, More Reward”", "score": 2, "replies": []}]}]}, {"body": "Yeah I'm real interested in this. But is there a way to automate it? And how important is the timing. Like if I'm a day off do I blow myself up", "score": 4, "replies": [{"body": "I've fully automated it myself! And since this is somewhere in between a \"buy and hold\" index and a day trading algorithm, timing is slightly important in a monthly sense, but no more than that", "score": 4, "replies": [{"body": "Yeah I'm in. I actually had this theory myself and didn't know it was a thing. Even just holding the leveraged funds seem to do ok", "score": 3, "replies": []}, {"body": "Makes sense since a 200 day moving average cannot change too much in 30 days (only 30/200 or 15/100 or 15% of the points will be updated in the last month).", "score": 2, "replies": []}]}]}, {"body": "Please send me the link.  Thank you.", "score": 3, "replies": [{"body": "Done!", "score": 2, "replies": [{"body": "Can you please send me the link as well? Thanks a lot :)", "score": 2, "replies": []}, {"body": "1 link with mustard and ketchup please .", "score": 1, "replies": []}]}]}, {"body": "Send me the link please!!", "score": 2, "replies": [{"body": "PMed!", "score": 2, "replies": [{"body": "Pm me as well please", "score": 2, "replies": []}]}]}, {"body": "DM me the automated way please!", "score": 2, "replies": []}, {"body": "Please DM me ty.", "score": 2, "replies": []}, {"body": "Might be interesting to see this strategy blended with a VXX hold. Would probably smooth out the max dd and improve sharpe. Keep in mind though, anything with this long of a horizon can be made to look good during backtests.", "score": 2, "replies": []}, {"body": ">Max drawdown a (nerve-wracking) 55.6%.\n\n> Max drawdown: -92.2% (yikes)\n\nI don't understand. Which is it?", "score": 2, "replies": [{"body": "Two different time frames. Max of 55.6% since 2008, max of 92.2% from the full backtest", "score": 3, "replies": []}]}, {"body": "I would love to learn more about this.  What platform did you use to automate it?  I have wanted to get into automation for awhile and I have read about this strategy before.  Sounds like a simple enough one to get started.", "score": 1, "replies": [{"body": "Quantconnect is easier, but more expensive than just using Interactive Brokers (which I use). I'm working on my [own self hosted version](https://getquantbase.com) too to make it much easier on myself", "score": 2, "replies": []}]}, {"body": "What happens if you switch to SPRO instead of going to cash?", "score": 1, "replies": [{"body": "Interestingly, the linked paper says that the main purpose of the moving average is to represent volatility.\n\nIn a volatile environment short leverage will not help.", "score": 2, "replies": [{"body": "Ahhh, that makes sense.", "score": 1, "replies": []}]}]}, {"body": "Can I have the link please?", "score": 1, "replies": []}, {"body": "Interestingly, the current S&P sharpe ratio is 2.4, which means better risk-adjusted returns than the historic performance of this strategy.", "score": 1, "replies": []}, {"body": "Please send me a link", "score": 1, "replies": []}, {"body": "Your code is for a WSB sentiment analyser. Do you have the real thing?", "score": 1, "replies": []}, {"body": "Reminder to self. Read later.", "score": 1, "replies": []}, {"body": "I love UPRO, one of my biggest trades. Perhaps you can improve on the drawdown by adding an additional filter or hedging via puts?", "score": 1, "replies": []}, {"body": "So one of the things I hear about buying and holding an index etf, let’s use the SP500 is that you’re dollar cost averaging. That would significantly improve performance especially during down years. Is this something you have looked in? I’m curious to see the impact it would have on LRS.", "score": 1, "replies": []}, {"body": "I wonder what would happen if you bought long dated calls on upro and switched to puts when s and p 500 below 200 ma", "score": 1, "replies": []}, {"body": "Horrible return rate why would you even post this a viable? 27% over 83 years lol gee thanks", "score": 1, "replies": []}, {"body": "Amazing work, i am also using ibkr so a link to your work would be appreciated. :)", "score": 1, "replies": [{"body": "Same, can i get the link too? (:", "score": 1, "replies": []}]}]}
{"title": "2K to invest stocks or ETF", "selftext": "[deleted]", "id": "nnmbko", "created_utc": 1622290777.0, "score": 20, "upvote_ratio": 0.8, "num_comments": 40, "comments": [{"body": "Welcome to r/stocks!\n\nFor stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22Rate+My+Portfolio%22+-+r%2FStocks+Quarterly+Thread&restrict_sr=on&include_over_18=on&sort=new&t=all)\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "[removed]", "score": 12, "replies": [{"body": "Wow someone else on the SCHD train. The dividend is great but lowkey it's been performing very well this year", "score": 8, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "That's great. Yea it's about 25% of mine and growing. Backed by VOO and DIA and balanced with growth stocks (ARKK, ICLN, LIT, etc)", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Yea that's basically what it is to me, a Tsla investment with some mitigated risk", "score": 2, "replies": []}]}]}]}]}]}, {"body": "VT", "score": 7, "replies": []}, {"body": "VTI", "score": 9, "replies": []}, {"body": "VTI", "score": 8, "replies": []}, {"body": "If I had another $2k then I’d throw it into VTI on the next bounce. It’s just such a small amount that it’s not worth procrastinating which individual stocks to put it into.", "score": 7, "replies": [{"body": "Might not bounce for a long time. Better to get in now and start getting dividends.", "score": 3, "replies": [{"body": "Yeah it's the ultimate decision for me. I need to shift another chunk of change into VTI but even a downward momentum of a few bucks per share is enough for me to buy on the downward spiral.\n\nWhat I love about VTI is it always rises. If it suddenly doesn't then we're all in deep trouble.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Post your question here to help others and get their feedback. I don't do DM. Sorry.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Selling will create a tax event in the USA but not sure of your jurisdiction. I hate paying taxes so try to avoid creating tax events as much as possible. In part that's why I eventually just settled on VTI and stopped chasing stocks.\n\nFWIW, I see AMD is on the rise in recent days so if I was planning to exit that position I would on the uptick. AAPL seems to be trading sideways from looking at the chart.\n\nDepends on what you want to do. A few shares here and there felt pointless to me when doing stocks as you're spread so thin. This is the chart that sold me to do VTI for the long term. Zero regrets.\n\nhttps://finviz.com/quote.ashx?t=vti", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Good luck!", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I must confess I've never looked at Google's stock. AMZN I did look at last year and bought 3 shares which were $3200 each LOL. I didn't like such lofty price for single shares so I quickly sold after a few bucks profit.  VWRP is a London stock that trades in GBP or USD? I'm biased against anything in UKP as I think Brexit will totally tank Sterling and I wouldn't want to be holding that bag.\n\nIs VWR an individual company or an FTSE based ETF?", "score": 2, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Are you really seeing a loss from these as they appear at an all time high. PEP has a nice dividend.", "score": 1, "replies": []}]}]}]}]}, {"body": "Put 80% into VTI, VOO, QQQ, or SPY to get solid gains. 10% into blue chip stock like APPL, TSLA, or JPM. Finally, 10% into speculative stock or crypto.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Good luck with your investments! I love seeing all these people interested in investing on Reddit. The more people we have in the market place making money the better!", "score": 2, "replies": []}]}, {"body": "TSLA, blue chip", "score": 5, "replies": []}]}, {"body": "$TRCH and $MMATF  \n\n\nSearch DD by u/Mr_Delmont", "score": 2, "replies": []}, {"body": "AMD joined the chat!", "score": 3, "replies": []}, {"body": "expi, tesla, snap, apple, square", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Expi is a gem most people don’t know of yet. I highly recommend it. I’ve been in it since early 2020... it’s been amazing", "score": 2, "replies": []}]}]}, {"body": "People will probably flip out for me saying this, but AMC looks primed to absolutely explode next week. If the goal is to make money…", "score": -15, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Understood. Good luck and I hope you find something that fits the bill!", "score": 0, "replies": []}]}]}, {"body": "[removed]", "score": -16, "replies": [{"body": "Don't do that. Crypto is a huge bubble right now", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "No use cases, no adoption, 1 Elon tweet let the market crash.\n\nWtf are we talking about", "score": 1, "replies": []}]}]}, {"body": "How do you buy polygon crypto?", "score": -3, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "[removed]", "score": -6, "replies": [{"body": "Thanks. I’ll have to check this out.", "score": -2, "replies": []}]}]}]}]}, {"body": "I like arkk", "score": 1, "replies": []}, {"body": "TMUS - they have been taking market share of VZ and T in telecom. I wouldn’t be surprised if they become #2 in the next few years.", "score": 1, "replies": []}]}
