{"title": "How to deal with stress when your profit is slowly going down from an enjoyable sum to 0?", "selftext": "I made a decent sum this year (30k) by gambling on Gamestop through stupid luck. However, since selling in January my profit has dropped to around 14k, mainly from still holding tech stocks that are all in the red: BB, Corsair, Coinbase, Apple, and CDPR. Thankfully I do have an SP500 ETF, but it's only 1/5 of my entire portfolio.\n\nNow I'm still happy with being up 14k, but I'm watching this number go lower and lower each day and I'm worried that it's eventually going to go down to 0 or into the red. Before I wasn't too concerned with the falling price when my profit was in the 20s, but as it's getting closer to single-digit thousands I'm feeling uneasy that I'll lose everything that I ended up earning with these other stocks. \n\nHow dumb would it be to cash out and just accept the lower profits? Should I just delete the app for a year and throw the rest of my cash into an SP500 ETF?", "id": "n9cgrn", "created_utc": 1620671710.0, "score": 28, "upvote_ratio": 0.73, "num_comments": 49, "comments": [{"body": "U are still +\n\nI am down like -10k today lol \n\nSell of and be happy if u dont wanna take any risks.", "score": 72, "replies": [{"body": "Same here even though I made a few thousand in 2020, with 2021 losses I'm like negative 5k, sucks", "score": 3, "replies": [{"body": "Same rn ....", "score": 1, "replies": []}, {"body": "lol with this pre market I am down another 10k or so.....\n\nholy shet", "score": 1, "replies": []}]}]}, {"body": "You’re still taking a huge profit, don’t feel bad, if you want to cash out that is.", "score": 25, "replies": []}, {"body": "Bitch please\n\nReport back when you're account is negative", "score": 17, "replies": []}, {"body": "I literally don’t understand how CRSR can’t cross $35", "score": 16, "replies": []}, {"body": "If you truly believe in it, you’re not phased when it drops in price", "score": 14, "replies": []}, {"body": "You can lower stress by not buying on margin.", "score": 12, "replies": []}, {"body": "If you are invested in companies that will still be around in the future just ignore it, if you have a diversified portfolio it's kinda better that all your stocks are tanking than just a few, it means they are following the market not the companies own problems. And as such should recover when the market recovers.", "score": 6, "replies": []}, {"body": "Rebalance until you're not stressed about it, if that means all in VT then do it.\n\nBTW I also hold AAPL and CRSR and I'm not really worried about them. They are both mainly being pinned down by the rotation out of tech and once the market goes back in they should do well.", "score": 6, "replies": []}, {"body": "jerk off", "score": 17, "replies": [{"body": "The best advice", "score": 2, "replies": []}]}, {"body": "Think about the long term.", "score": 3, "replies": []}, {"body": "Also remember that you'll need to pay capital gains tax on your 30k profit come April 2022. This will be the case regardless of what happens to your portfolio from here on, so make sure you have the money set aside for that. If you don't, sell enough of your lowest conviction positions to offset your taxable gain with a loss and to get *cash* that you will set aside to make sure you can pay the taxes.", "score": 4, "replies": [{"body": "Good advice, thanks!", "score": 2, "replies": []}]}, {"body": "Always set stop loss and sell before you lose all your money\n\nRemember that it took someone who invested in 2000, 14 years to recover their losses", "score": 5, "replies": [{"body": "If they invested everything into the NASDAQ index.", "score": 2, "replies": []}, {"body": "Or just take profit periodically when the stock is high.\n\nThe problem with stop losses is that you are always selling low.\n\nSo instead of setting a stop loss at $100/share, take profit at $120 and $140. Your wallet will thank you.\n\nYou gotta have an exit strategie. Taking profit and portfolio rebalancing are better than stop lossing. And stop lossing is better than hodling to the bottom.", "score": 1, "replies": [{"body": "Yeah, I also always take profits at +25% no questions asked\n\nBetween -8% / +25% I'm straight up having a good time", "score": 2, "replies": []}]}]}, {"body": "You pick up a book that teaches you how to invest not speculate, take a breather and come back with more knowledge. I did that and that helped.\n\n&#x200B;\n\nAlso please have an exit strategy.", "score": 3, "replies": [{"body": "Not having an exit strategy is defo my #1 mistake. Problem is now that we're so low I'm completely lost on if it's best to exit now before it gets brutal or just hold on and pray.", "score": 1, "replies": [{"body": "You will never do, go check my post about having a plan for your investing, take a breath and revise your strategy", "score": 1, "replies": []}, {"body": "If you think its going down further, cash out and hold cash on the sidelines for a while. It’ll be less stressful for you that way..", "score": 1, "replies": []}]}]}, {"body": "How many of us can still say that their portfolio is net positive YTD? Not many I would imagine. You are one of the lucky ones. There is no shame in taking profits. If the market is making you nervous, just cash out. At least you will have the cash to get back in at a later point. Otherwise you could end up bag-holding for who knows how long.\n\nNot a financial advice.", "score": 3, "replies": []}, {"body": "I started investing on Feb 1st, I think the past two months have easily been the best learning opportunities I will ever have, but at the same time it’s also been two months of trial and error, at one point i was up 120$ (with how much I have total invest that was a good profit) not i’m down like 75$ lmao, this is the most i’ve been down before, but tbh i’m just buying the dip and riding the wave, I am confident everything will rebound and if it does i’ll have bought in at the lowest I have ever had the chance to.", "score": 1, "replies": [{"body": "Wanna know what it feels like to be down 12k?  Let’s swap portfolios", "score": 3, "replies": [{"body": "The amount he / she invested could be a big deal for them. We cannot compare situations like this.", "score": 2, "replies": []}, {"body": "I’m 19 with little disposable income so being down the amount i am is a huge chunk, however i’d much rather be down 120$ then 12k lol, hey bro diamond hands, well make it through and find those tendies", "score": 2, "replies": [{"body": "You’ll be fine…so will I.  Hold or buy more dips when you can!", "score": 2, "replies": []}]}]}, {"body": "I know it hurts. But as long as you're invested in solid companies or ETFs, you'll bounce right back!", "score": 1, "replies": []}]}, {"body": "Go rub one out and take a few shots of whiskey", "score": 1, "replies": []}, {"body": "Been in the game for a couple years. \n\nIt's going to be a rough ride for some of the new traders getting into the market. \n\nDo you beta weight your portfolio to see your exposure? \n\nI to invest in booming sectors and cut losing trades out of down trending sectors. \n\nI try to enter trades during breakouts, as opposed to before they happen. I also use options to give myself exposure to a variety of market conditions and time frames.", "score": 1, "replies": []}, {"body": "I don't believe in BB, I don't know what to think of Coinbase but my gut feeling is saying hold and see. The others are a hold for sure for me. You can take the cash and you are still up 14K. But be clear to remember this feeling and why you did it because if these stocks go up again many people think they where stupid for selling but hindsight is 20/20 and they forget why they sold.", "score": 0, "replies": []}, {"body": "When MOASS happens, can we trust brokers who use payment for order flow?", "score": -7, "replies": [{"body": "Do you really believe the moass will happen?  I'm legitimately asking not being sarcastic.", "score": 9, "replies": [{"body": "No it’s already happened when it hit $400 & robinhood paused users out in my opinion", "score": 12, "replies": []}, {"body": "Many people seem to believe it will happen. The corrupt fuckery is through the roof tho so I dunno, I do hope it does.", "score": -2, "replies": [{"body": "I stopped following it a while back and really can't ask that question on wsb without getting downvoted to hell", "score": 2, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Compromised lol", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Liquor and beer?", "score": 1, "replies": []}, {"body": "Yes.", "score": 1, "replies": []}, {"body": "I hit -3K ytd today on the year so keep at it.", "score": 1, "replies": []}, {"body": "Nothing wrong with taking profits, especially if your stressing.", "score": 1, "replies": []}, {"body": "Handle it the same way I'm handling it-\n\nBy being incredibly happy that you now have the opportunity to buy stock in the same tech companies that you believe in for the next 5-10 years, at a lower price", "score": 1, "replies": []}, {"body": "do you make a difference between trading and investing?\n\nwhile you trade, it is smart to have stop-losses, since you need some safety. It is not easy though, they do cut potential profits, but it is a stop loss that is between you and your bankruptcy.\n\nif you invested your trading wins, then you may not use any stop loss, you thoroughly thought, had some criteria, believe smth and suppose to keep on it, unless smth like a \"black swan\" (covid or any next fuckup) happens to the market.  \n\nIf you went a high risk, you may hope that some of your investments will more than cover losses from others, it just needs to age and some portion of luck. Loss alone is not a real reason to sell, it is your emotions. \n\nOne shouldn't either forget to take some profits when they happen to become clearly beyond one's expectations. Some free cash is always useful since ideas keep coming.", "score": 1, "replies": []}, {"body": "Throw it all into the etf", "score": 1, "replies": []}, {"body": "it’s like playing the shell game but with 1000 different shells and you have a blindfold on.", "score": 1, "replies": []}]}
{"title": "Plays Against Inflation", "selftext": "It seems many are trying to bail on stocks because inflation. (collectibles that we treat as currency, commodities etc). I wanted to explore is if there are certain categories of stocks that are better positioned against Inflation.\n\nSo I came up with a short-list of they type of stocks I might look for in a period with volatile inflation.\n\n1. Established Brand Name. This gives the company pricing power because clients are going to buy their product because of what they are getting is also associated with the brand and not just the product. Think AAPL, MCD, KO.\n2. Commodity selling stocks, industrial sector ([https://etfdb.com/etf/RGI/#holdings](https://etfdb.com/etf/RGI/#holdings)). Think metal mines, lumber, companies that produce commodity byproducts that are used in industry (no discrete product firms, like jewelry makers).\n3. Capitalist Europe. If it goes down in the USA, it all goes down - true, but there is a place where it will go down less relative to others. So, I'm looking at European companies that do not have diversity and inclusion in their 10K. These are actually young companies that are thirsty to grow and will do anything and everything to move up. Alternatively, I look at cultures who are still capitalist, think Russia, Poland, Ireland, Estonia.\n4. Companies with more fixed-rate debt instead of floating rate debt. If the interest is fixed but there is more money in circulation the lenders are in trouble not the borrowers.\n5. Government-backed stocks. Especially those that have defense contracts. I think that bad times create civil unrest with a potential for internal and external escalation. Think Northrop Grumman, Boeing, Lockheed Martin ([https://etfdb.com/etf/DFEN/#holdings](https://etfdb.com/etf/DFEN/#holdings)) \n\nWhat would you do if you were worried about inflation eating your gains?", "id": "n93o6x", "created_utc": 1620651021.0, "score": 33, "upvote_ratio": 0.82, "num_comments": 57, "comments": [{"body": "Oil has proven to be a perfect hedge against inflation. They also have not rebounded the same way tech stocks have since covid struck. Supply is down and demand is roaring back with the vaccine distribution. Market has priced in covid resurgence in India as well so I’m balls deep in oil leaps. \nOil isn’t going anywhere..talks of green energy and divestment needs to be paid for by having higher oil prices. Everything we do revolves around that black carbon rich penguin and shorebird covered sticky liquid. \n\nUS is in no rush to invest in more drilling operations. So the limited supply is gonna get more pricey. \n\nTLDR: EVERYTHING runs off of oil. Commodities like lumber copper and steel are mooning.", "score": 12, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Damn straight. Merica oil", "score": 1, "replies": []}]}, {"body": "Precious metals - gold & silver - the government can't print them.", "score": 10, "replies": [{"body": "💯", "score": 0, "replies": []}]}, {"body": "Just short the dollar. Take out all the Credit and Loans you can get, go to Costco and buy all the Toilet Paper and canned goods you can. Wait for mass/hyper inflation payback entire debt with only selling 1 roll of TP and live the rest of your life like a King.\nLiterally no way it can go tits up.", "score": 25, "replies": [{"body": "I maxed my card on physical silver", "score": 2, "replies": []}]}, {"body": "Look for companies with pricing power within their market. KO has insane price elasticity to demand. WM is really strong because everyone just pays their garbage bill. Nobody shops around to see if a competitor is $1.50/mo cheaper. OSK and URI are great ways to play the construction/improvement trend and rental equipment costs get passed on pretty easily. AMAT and ASML are both serving a high demand industry and as such they have strong pricing power. Probably two dozen other names that fit easily into this (very simplified) strategy.\n\n*Disclosure: This is not a solicitation to buy or sell any security. Do your own damn homework you lazy ass*.", "score": 11, "replies": [{"body": "In many places WM is the only option so there is no shopping around.", "score": 3, "replies": []}, {"body": "ASML stock let's goooo", "score": 1, "replies": []}]}, {"body": "I don't understand why people bail on stocks to hedge against inflation. Stocks ARE the hedge against inflation! Companies adjust for inflation by increasing their prices, thereby increasing their revenue, which results in a higher stock price. Inflation only occurs if regular people have more money, so it's not as if the increased prices will result in lower sales. Furthermore, the underlying value of a companies physical assets increase with inflation. What exactly am I missing here?", "score": 11, "replies": [{"body": "This has been my thought as well. I think there is a false narrative being spun so prices will drop before the big boom.", "score": 3, "replies": []}, {"body": "Look at the stock market during the inflationary 1970s. Lost decade. P/E compression my guy.", "score": 2, "replies": []}, {"body": "True. Hence the first point on the shortlist. Companies with pricing power can adjust, others are less flexible.", "score": 0, "replies": []}, {"body": "It's because they want everyone to sell their stocks so they can buy them up cheap.", "score": 1, "replies": [{"body": "I don’t think it’s true\nSome of mine stocks 60% down \n ( yes, I picked up bad stocks)\nAnd seems like newer end\nWith good news and good report, stock still falling \nWhat is going on with this f market?", "score": 1, "replies": [{"body": "Short term stock movements are not based on fundamentals. Prices move up and down so some people can take money off of others. Earnings reports, news releases are all just part of the poker game. Part of the game is making sure retail never understands the rules, so they make easier marks.", "score": 2, "replies": []}]}]}, {"body": "Agreed. I own a home and have about 60% portfolio in VTI. Would consider both as adequate hedges against inflation. The rest is in tech/growth, currently dying a slow death. Have some in an oil etf just so i can feel happy when gas prices go up.", "score": 1, "replies": []}, {"body": "correct\n\nstocks dont shit because of inflation, they shit because either the fed raises rates to curb inflation or people think they will raise rates\n\nhowever, if you really think inflation is going to rip, stocks are the absolute best place to go along for the ride and preserve your wealth\n\nreal estate will also react similarly\n\nyou may take a hit in the short term as interest rates go up, but it will be short and small compared to the rip in stock and real estate prices if real inflation is here to stay", "score": 1, "replies": []}]}, {"body": "Gold\n\nEnd of story AND end of my DD", "score": 3, "replies": []}, {"body": "XLI XLE", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "buy USPS forever stamps", "score": 3, "replies": []}, {"body": "Digital gold is my hedge", "score": 12, "replies": [{"body": "Here here!", "score": 1, "replies": []}, {"body": "Hard to beat USDC", "score": -2, "replies": []}]}, {"body": "VALE GANG RISE UP", "score": 5, "replies": [{"body": "I own some VALE and I don't remember why I bought it! Thanks for letting me know it was probably an inflation play I forgot!", "score": 2, "replies": [{"body": "Probably battery day?", "score": 2, "replies": [{"body": "I thought it was Monday", "score": 1, "replies": []}]}]}]}, {"body": "I think you've included Ireland in that list by mistake, surely", "score": 2, "replies": [{"body": "Tax reasons only", "score": 1, "replies": [{"body": "Ahh, okay, but that tax only really seems to benefit international companies", "score": 1, "replies": [{"body": "That is true, the benefits aren't as good as I would like them to be", "score": 1, "replies": []}]}]}]}, {"body": "To answer your question, I'm not going to worry about inflation because Murica will always be Murica. We will not stop spending just because prices are higher, we will only accumulate more debt if anything.", "score": 4, "replies": [{"body": "https://imgur.com/gallery/b4PEGlR", "score": 2, "replies": []}, {"body": "1) more debt and more inflation are the same thing in this context\n\n2) no, you wont stop spending under inflation, thats the point. you will always be spending as soon as you get your grubby mitts on liquid assets, which is what murders saving and investment. no investment = no growth = mad max thunderdome", "score": 1, "replies": []}]}, {"body": "$C", "score": 1, "replies": []}, {"body": "BRK.B and Blackrock have been doing very well lately.\nI think their getting large inflows of cash as people get conservative.", "score": 1, "replies": []}, {"body": "SPXL - spy only goes up, 3x up is better \nNUGT - gold is good, leverage is good. \nNYMT - inflation = increased rent = increased revenue \n\nIncreased interest rates would shit on all of this harder then 2 girls 1 cup, So let's just pretend that won't happen.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Spxl is 3x\n\nNugt is 2x", "score": 2, "replies": []}]}]}, {"body": "TBT", "score": 1, "replies": []}, {"body": "$HAS bringing toys back like it's the mid 80s again.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": ">Alternatively, I look at cultures who are still capitalist, think Russia\n\nGod damn it. Spit my coffee on my keyboard ... Now I have to clean it...", "score": 1, "replies": []}, {"body": "Bitcorn", "score": 1, "replies": []}, {"body": "Speculation and inflation are different", "score": 1, "replies": []}, {"body": "MO has great pricing power. Its product is literally addictive.", "score": 1, "replies": []}, {"body": "AG is a squeeze play as well. Heavy short internet and lots of silver exposure.", "score": 1, "replies": []}, {"body": "Xom xom xom xom", "score": 1, "replies": [{"body": "Bagholder Spotted\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}
{"title": "Bearish TSLA?", "selftext": "So we are sliding down since the end of January. There was a \\~61.8% pull back up in April and down again. We are bellow a previous uptrend which was forming since march. We may be going towards 400-500 territory which wasn't in play since September November last year. This could be potentially nasty but looks that way. What would you say about it?\n\n**Update 11th of May 2021 - premarket -** price is 587. Lets see what will happen.\n\n**Update 12th of May 2021** so 600 is still holding. Any pull up will be used for selling.\n\n**Update 13th of May 2021** 573 at the moment of writing and sinking.\n\n[Drop below trend line after initial pull up by \\~61.8&#37;](https://preview.redd.it/6pptsjs5pdy61.png?width=1564&format=png&auto=webp&s=b58f57ee9697d8aeae40f1a00e4da4bf5faf4cdf)\n\n[Price target in to 400ish region.](https://preview.redd.it/26wo2oo5pdy61.png?width=2107&format=png&auto=webp&s=c9510fa26ad672b07355b8ebf8ce8c8e05903d96)", "id": "n9jelg", "created_utc": 1620689786.0, "score": 12, "upvote_ratio": 0.6, "num_comments": 56, "comments": [{"body": "Elon will tweet something stupid and it will shoot up", "score": 39, "replies": [{"body": "I hope for it", "score": 11, "replies": [{"body": "Not that you got your hopes it will never happen lol", "score": 1, "replies": []}]}, {"body": "and he tweets and goes down", "score": 2, "replies": []}, {"body": "So far I am right", "score": 2, "replies": []}]}, {"body": "Imma go ahead and buy calls now", "score": 20, "replies": [{"body": "This", "score": 8, "replies": [{"body": "Guy", "score": 9, "replies": [{"body": "fucks", "score": 9, "replies": [{"body": "Bears", "score": 1, "replies": []}]}]}]}]}, {"body": "Shorting TSLA is one of the worst shorts.  A little  good news and it’ll be up 100 no problem", "score": 18, "replies": [{"body": "Look at the price action now - it works as per my chart", "score": 2, "replies": []}]}, {"body": "I’m hella bummed it broke that trend line today. Market was slaughtered tho. Hoping for some bounce back by EOW.", "score": 6, "replies": []}, {"body": "You know what they say, a tesla bear and his money are soon parted.", "score": 19, "replies": [{"body": "I know it yes. I have just posted how it looks like form the technical point and as a start of the discussion.", "score": 5, "replies": []}, {"body": "What would you say now - chart is working", "score": 1, "replies": []}]}, {"body": "Nah. Daddy’s got us. He will always take care of us.", "score": 5, "replies": []}, {"body": "I have buy orders to 350", "score": 6, "replies": [{"body": "I would probably raise it to 400 for the first and start buying small", "score": 1, "replies": []}]}, {"body": "400 or 500? I might just relocate everything I own into Tesla at that point. You think people are going to sell Tesla down to that, that's crazy!!", "score": 6, "replies": [{"body": "Agreed I bought the last big dip and resold around 700.", "score": 5, "replies": []}, {"body": "In September last year Tesla was below that so why not?", "score": 7, "replies": [{"body": "Because of their growth, projected growth and future everything that they're doing", "score": 3, "replies": [{"body": "But when you look at the valuation it is trading at 630 of its earning. It needs to increase earnings at least 10-15 times to bring it down to some less extraordinary level.", "score": 3, "replies": [{"body": "Tesla itself is just the proxy by which people buy stock into all of Elon's projects.   The actual PE of TSLA doesn't matter", "score": 1, "replies": []}, {"body": "Yer except it was trading at 1100 P/E ratio before Q1. If it drops to a more ordinary level (Lets say $100 a share, 100 P/E ratio). Then that would suggest at it's current growth, every quarter the share price would need to go up about 30-40% to keep it's 100 P/E Ratio.", "score": 1, "replies": []}, {"body": "PE is an indicator. To me it indicates that the company is perceived to grow, but I could be wrong.", "score": 0, "replies": [{"body": "If you buy a business, a company - any company. One of the valuation factors is projection of future earnings. You may do it by comparing to present earnings. So would you buy a shop which earn 1mln p.a. for 20mln?", "score": 2, "replies": [{"body": "If I predicted it would grow to 40mln, yes, I would. TSLA is still in its early stages as a company, it’s not like we are talking about a decaying giant like Facebook or Walmart", "score": 6, "replies": []}]}]}]}, {"body": "So what do you think now about this chart?", "score": 1, "replies": []}, {"body": "Without tax credits\nAnd traders bidding up the stock its  300\nIn a flash", "score": 0, "replies": []}]}]}, {"body": "So do you think 500 is crazy now? :-)", "score": 1, "replies": []}]}, {"body": "I've bought €1000 worth of puts on Tesla.\n\nEven if we agree it's a great company with a great future, it's the most overvalued stock in the S&P500.\n\nRight now, at a P/E ratio of 982, which was calculated from a share price of $700, it's overvalued. Let's find the \"correct\" price assuming a P/E of 25:\n\n982/39.28 = 25, so the \"correct\" price is 700/39.28 = \\~$17.75\n\nOK, let's be optimistic and use the forward P/E ratio of 312.\n\n312/12.48 = 25, so the \"correct\" price is 700/12.48 = $56\n\n&#x200B;\n\nSo let's be super-mega optimistic and pretend that Tesla will quadruple in size in the next couple of years, and allow a multiplier of 4, that still gives us a \"correct\" price of just over $200.\n\n&#x200B;\n\nI think Tesla is a great company with a great future, and that it will grow significantly...\n\nBut the stock price is disconnected from reality. They're not going bankrupt, but there is no rational justification for the share price anymore.\n\n&#x200B;\n\nI'm buying Tesla puts at $200, it's literally free money right now. Even daddy musk himself thinks the share price is too high, he literally said it. Short tesla now and get yourselves some tendies.", "score": 4, "replies": [{"body": "Institutional investors should start selling their shares anytime soon (if they didn't already). Deeply inside we all knew Tesla mooning is a charade, even if tomorrow Elon finds a better way to colonize Mars there wont be much for shareholders unless he finds martians up there and starts selling them gluten free foods.\n\nP/e ratio of 25 is way above average, today the only reason Tsla stock price should be above 100 is if Elon could outperform any competition with his cars in the next years; which back then it was the main reason why Tesla stocks looked so juicy. Its already 2021 and a minimum price of 60k euro for a car that, innovative of course, but finished worse than the cheapest car you can find doesnt really make me want to trust the company.\n\nI will buy puts until it descends below 300 bucks. It may be worth to speculate long intraday when and if he'll produce the saint grail of batteries or if certain successes in neurosciences research will eventually occur", "score": 1, "replies": [{"body": "It looks like chart is working", "score": 1, "replies": []}]}, {"body": "Exp date?", "score": 1, "replies": [{"body": "September 2022.\n\nI have some shorter timed puts at higher strike prices, but $200 is the lowest.\n\n$600 for 21/05/2021 for example, but I only bought €250 worth of those.", "score": 1, "replies": []}]}, {"body": "This aint ageing too well isnt it", "score": 1, "replies": []}]}, {"body": "Have faith in Daddy!", "score": 2, "replies": []}, {"body": "Im bearish because rising metal costs are going to fuck TSLA’s margin. They will probably need to raise prices which will reduce the amount of buyers in the affordability range for their vehicles. Or m, they may follow the lead of other manufacturers and temporarily halt production. Either way, sales and profits will drop. There is nothing they can do unless they have begun mining their own metals.\n\nAny industry with products produced from metals or containing metal components is going to see reduced profits while metal prices remain high. Companies are scrambling to find alternate suppliers for components already.", "score": 3, "replies": []}, {"body": "\\>TSLA\n\n\\>Bearish\n\nI wouldn't do that if I were you. Never bet against the Musket.", "score": 2, "replies": []}, {"body": "Well this might be a good thing, might actually fall to the value its actually worth than being overhyped and overpriced", "score": 4, "replies": [{"body": "That would have to be very big drop as it is valued 630 times its earning when for e.g. VW has 12 and GM has 9. That means TSLA needs to increase earnings like 30 times.", "score": 1, "replies": [{"body": ">VW\n\n>GM\n\nTesla isn’t a car company. You’re not comparing apples to apples.", "score": 0, "replies": [{"body": "Lets compare it with such as MSFT or AMZN.", "score": 4, "replies": []}, {"body": "What are they if not a car company? They're still reliant on Livent for batteries, and they're backpedaling on the autonomous driving features.\n\nThey're not a software company, and they've got a long way to go before we can call them an energy company.", "score": 1, "replies": []}]}]}]}, {"body": "Yep 300\nComing", "score": 3, "replies": []}, {"body": "Elon put 60% of his finances into GME", "score": 1, "replies": []}, {"body": "Tesla will crash so hard. China will find a pretext and take the Teslas out of circulation.\nStock will crash to 50-100 this year", "score": 1, "replies": [{"body": "I am not sure about it but you may see that future earnings are highly China dependent", "score": 1, "replies": []}]}, {"body": "Nokia > Tesla", "score": 0, "replies": []}, {"body": "Repeat after me. Last year was a fluke!", "score": -3, "replies": []}, {"body": "There is a bit lower volume on this drop so maybe it will get back.", "score": 0, "replies": []}, {"body": "Ok so that last candle isn’t ideal, but I think you missed some earlier support levels.  Also, is your whole thesis based on Fibonacci ?", "score": 1, "replies": [{"body": "Almost, yes. I am looking at support level and valuation also like PE and forward PE looking at prognosis of earning growth.", "score": 1, "replies": []}]}]}
