{"title": "House calls to break up large tech firms for being monopolistic: How will this affect share prices?", "selftext": "After a house antitrust investigation, the House of Representatives found that AMZN, FB, AAPL, and GOOGL have “too much power” and should be broken up. How do you think this will affect shareholders? Is it time to sell it all and YOLO our entire net worth into shorts and puts, or do you think it’ll just be a slap on the wrist for these companies and a 2% dip for a day or two before rising back up?", "id": "ktxacr", "created_utc": 1610219701.0, "score": 52, "upvote_ratio": 0.9, "num_comments": 69, "comments": [{"body": "Long term, it likely would be bullish.  Investors would find it easier to price the independent businesses and they probably would garner multiple expansion.\nOne healthcare example is when ABT spun out their pharma into ABBV and the same businesses basically doubled the market cap.", "score": 37, "replies": [{"body": "Short term bearish though?", "score": 0, "replies": [{"body": "I would say very bearish for FB,  bullish for others.", "score": 10, "replies": [{"body": "lock hateful angle marble vast agonizing ask ludicrous arrest zonked\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 10, "replies": [{"body": "Yes, I’d expect most people want a piece of Instagram and WhatsApp.  Core business is an advertising monster,  but it’s portfolio cancer.\nThanks for sharing that info on the Occulus, I didn’t know it was so popular.", "score": 3, "replies": [{"body": "husky full arrest plate lavish forgetful memory gold crowd heavy\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 4, "replies": [{"body": "I like Unity as a development tool, but not as a business to invest in.", "score": 2, "replies": []}]}]}, {"body": "No, it is not a scapegoat. I guess you own FB which is why you say it; however FB has caused endless damage to the social fabric of our society. Even outright destruction. It’s time to go, sorry, but not sorry.", "score": 8, "replies": []}, {"body": "I bought facebook after trying oculus. I think it’s being overlooked by investors. VR will be a huge industry in future and not just for gaming. In a world of remote working the potential is endless and Facebook are investing heavily in this area. Looking forward to the earnings report.", "score": 2, "replies": []}, {"body": "Oculus minus FB would be a blessing and I hope a return to form for the company. I think the Quest 2 is a great product but I was disappointed they pivoted away from premium cutting edge PC VR. They're the catalyst behind the VR movement, they should offer a \"Halo\" product if only for optics and prestige to show what their research is capable of producing. It's why the original CEO Brendan Iribe resigned.", "score": 1, "replies": [{"body": "run spoon squash school toothbrush cobweb obtainable disarm tap marble\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 3, "replies": [{"body": "Wireless is somewhat possible, I've played on a wireless Vive and it was amazing, I'm not sure they can push the newer headsets' resolution over wireless anymore. I'm using the index now and would instabuy an adapter if one ever came out. The added FOV, the 120hz refresh and knuckles controllers make for a pretty amazing experience in HL:A", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "When AT&T was broken up, its parts plus new competition *gained.* \n\nSame.. in the end. Just Musk and Bezos will have to share.. you know, the skill they taught *US* in kindergarten.", "score": 32, "replies": [{"body": "What is Musk going to have to do?  Tesla is nowhere near being broken up.", "score": 13, "replies": [{"body": "Uh, huh...", "score": -14, "replies": [{"body": "Nice comeback. Do you have a reason why you think Tesla will be broken up?", "score": 5, "replies": []}]}]}]}, {"body": "This conversation swayed off and became too political. To answer your question, I don't think this will affect their bottom lines much. The share prices likely won't be affected in the long term. Wouldnt recommend yoIoing your portfolio on this speculation lol!", "score": 6, "replies": []}, {"body": "The anti trust process may take 2-3 years. I personally agree AMZN, GOOG are too dominating and disruptive companies and disrupting style. I just saw a Prime truck passing my rural house 2nd time today as a reminder. There can be a more affordable basic wireless phone company that is priced similar to Huawei/Xiaomi.", "score": 13, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Amazom Web Services makes so much money that it subsidizes everything else Amazon gets into. They built a delivery company in like 3 years from the ground up that delivers all acrossed the country. Think about how much money that took. The amount for sprinters, semis, planes, distribution runs, and everything else that would go out it. They're not just a retail company.", "score": 6, "replies": []}]}, {"body": "AWS is Amazon's real monopoly power, not their retail distribution.", "score": 1, "replies": []}]}, {"body": "Thinking about investing into MSFT. Kinda interesting that it's the only tech giant that the house is okay with.", "score": 3, "replies": [{"body": "They already went though their anti-trust fight in the early 2000s", "score": 3, "replies": []}]}, {"body": "That's why I solely own MSFT out of these mega caps, smart enough to always have a competition to beat instead of outright demolishing or buying them", "score": 3, "replies": []}, {"body": "It doesn’t matter, they’ll go up in the long run.\n\nEvery few years or so the politicians in DC get together and decide to short a few major tech stocks and begin a monopoly investigation. Ultimately it goes nowhere because these companies are too big to fail.\n\nIt’s essentially DC telling these companies “hey guys, just remember we have power to end you”, and it’s a ripe opportunity for insider trading.\n\nNone of this matters, but your calls may be fucked for a few weeks or months.", "score": 5, "replies": []}, {"body": "Breaking up Facebook would be a good example:\nYou would end up with Facebook shares and Instagram shares. But both are separate business now. It shouldn't affect you.", "score": 2, "replies": []}, {"body": "I owned T that got broken up like 12 different companies. Received stock dividends from companies I did not know exist. Consumers benefit tremendously. No long distance surcharge , roaming additional cost etc.", "score": 2, "replies": []}, {"body": "Never going to happen these companies do more good than bad and breaking them up would do nothing", "score": 8, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "Not at all, section 230 helps protect free speech by allowing social media platforms to only prune the users who are obviously breaking the rules and spreading disinformation, like Trump. Right-wing extremism is on the rise in the US because of disinformation networks and people like Trump. Social media companies are doing their best to allow sane people to talk, while banning violent racists. Big tech is the best tool to destroy the uneducated right wing by disenfranchising them and destroying their echo chambers, allowing only correct and factual information to proliferate.", "score": 8, "replies": [{"body": "Amen!", "score": 5, "replies": []}, {"body": "That's your opinion & I respect it. But big tech becomes publishers when they chose to censor information they deem as 'misinformation.' What happens when they decide to take a different stance? They're no longer supporting free speech by suppressing the voices, even if the voices are 'uneducated' as you say. I say let the people make their own decisions.", "score": 0, "replies": [{"body": "They already publicly publish what content they are going to be censoring, it's laid out in their ToS. Social media companies take as hands off an approach as possible, until the content that is being posted is in clear, direct violation of the law. Additionally, they are allowed to recognize the power that their platform provides for their users, and they are allowed to curtail that power if their notable users abuse it.", "score": 6, "replies": [{"body": "They clearly have editorial stances that are not simply removing content that is a \"clear violation of the law\". If that were the case then the correct approach would be to refer violators to law enforcement, not to become private judge, jury and executioners. Posting incorrect information about Covid is wrong but not illegal. When the New York Times and basically every other major media outlet became an arm of government in spreading to disinformation to sell the Iraq War it was both wrong and perhaps illegal, and the same crap continues to happen even if on a less dramatic scale. Think about what would have been removed if Facebook and Twitter had existed in the 50s and 60s and then think about whether you want a handful of large corporations deciding what is fake news and what is dangerous.", "score": 0, "replies": []}]}, {"body": "You can't let these people make their own decisions when they are instigating riots, violence, and causing death and a break in at the Capitol of the United States.", "score": 3, "replies": []}]}, {"body": "[removed]", "score": -9, "replies": [{"body": "Says the sheep.", "score": 3, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "Best to stick with the trusted liberal news\n\nhttps://www.cnn.com/2019/08/01/tech/robot-racism-scn-trnd/index.html\n\nHahah!", "score": -4, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "i mean i was laughing pretty hard at you and your CNN \"Racist's Robots\" you think is news.\n\nI think that warranted the exclamation.   :)", "score": -2, "replies": []}]}]}]}]}]}, {"body": "Facts", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "If they're inciting insurrection and spreading blatant lies? For sure. De-platforming people that are actively trying to destroy democracy is pretty standard.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "No, why should any organization be forced to allow someone to use their platform to spread lies and disinformation? If there is support for these people, they should partner with organizations who want their business. If no active platform wants to, that's too bad.", "score": 3, "replies": []}]}]}, {"body": "Read up on broadcasting laws and who owns the air waves it’s like a utility for the big four and radio since they are licensed by government to use public airwaves and his is a false equivalency", "score": 0, "replies": []}]}]}, {"body": "So the amazon workers on food stamps that don’t make enough money that we effectively all pay the rest of their wage is doing ‘good’?\n\nI agree their technological advances are good, but they are harming their people. They need to do better for their workers.", "score": -7, "replies": [{"body": "Are they breaking up Walmart ? The absolute devastating factor to the loss of “Main Street business” for the last 20 years.. are their employees on food stamps?", "score": 12, "replies": [{"body": "Is this a joke?  Of course they are on food stamps. Amazon and Walmart are the biggest employers of food stamp recipients in America", "score": 2, "replies": [{"body": "Sir I’ve never joked a day in my life.. just making sure you also consider Walmart a monopoly and support their breakup as I see them as basically the same company model at least as it pertains to their workers", "score": 2, "replies": [{"body": "Absolutely I do.  Any company that refuses a living wage to their employees and tells them to seek financial aid from the tax payer while they ALSO seek financial aid from the tax payer needs to have their shit straightened out.", "score": 5, "replies": [{"body": "We are in agreement what’s with the argument that if fast food workers made 15$ an hour it would devastate small business? THEY WILL HAVE MONEY TO BUY MORE BIG MACS!! 🤣✌🏼", "score": 1, "replies": [{"body": "A fraction of the money that has been given to giant corporations and monopolies should be rerouted as incentives to small business owners that can’t pay the new minimum wage to help them grow.   It’s kinda stupid that we keep giving giant monopolies tax breaks to keep small mom and pop stores from competing.  I have a small business and I pay a higher percentage than amazon does of my profits. It’s all stupid.", "score": 1, "replies": [{"body": "My own thoughts are if we have a minimum wage why not have a maximum wage?\n\nIt can be sliding like if your top 10 percent of earners make more than 40x the bottom 10 percent of earners then it's taxed at 91 percent.\n\nInclude all compensation such as options and housing allowance etc.  \n\nThen if they outsource it's tied to the equivalent wage of the country they're producing in.\n\nEveryone except the insanely huge corporations wins without burdening the small and medium sized businesses.\n\nIt's kind of a premise at this point and would need fleshed out, but i haven't heard anyone suggesting what seems like a promising idea.", "score": 1, "replies": []}]}]}, {"body": "They aren't a monopoly though, Walmart.", "score": -1, "replies": []}]}]}]}]}, {"body": "Define higher minimum wage if you want to change that... Tackle the problem at its root, no need to break up a company for that reason", "score": 2, "replies": []}, {"body": "Funny thing, the amazon warehouse near me in Canada actually pays pretty well compared to other warehouses in the area.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "It is great in theory. But they purposely don’t allow workers to work full time and cycle part time employees to save money instead.  When they hire full time employees, they have to pay for health care and a 35-40 hour week.  But they purposely put them down for less hours so that they can hire 2000 part time employees instead of 1000 full time employees to avoid paying them a full salary or any benefits.  I hope that makes sense, if not I can try to explain it in a better way.", "score": 3, "replies": []}]}]}]}, {"body": "Corporations are our government, they will never pass laws to regulate themselves.", "score": 2, "replies": []}, {"body": "Hot air! All lips service! Big techs owns all the Washington politicians! They has so many chances to do it & it's never happen so why now?", "score": 2, "replies": []}, {"body": "There are tons of search engines, social networks, and phone manufacturers none are monopolies in my mind", "score": 3, "replies": [{"body": "Effective competition is the mark of a monopoly, not the existence of alternatives.", "score": 9, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "They're offering advertising services that are not free at all", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I think part of the problem with Apple's app store from their perspective is the monopoly like power they have to do whatever they want with it without consequences from the market.  \n\nIf Apple decided to just double their share of all sales on the app store overnight from 30% to 60% a lot of people would complain. But at the end of the day most of them wouldn't have a choice but to go along with it because of the lack of competition in the space. That makes them look a lot like a monopoly with the power to cause a lot of harm to the rest of the economy if they choose to do so.", "score": 5, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "When a company gets too big it can effectively disregard the fee market, no one can effectively compete. Amazon is known to kill other mom/pop stores, heck they even go to the supplier and private label hardware as \"Amazon original\" then ban the other sellers from selling it (ofc only happens to smaller businesses).\n\n\n\nIf I buy a PC I can run any software from anywhere, no one has a say. If I buy an Android I can migrate all apps and everything between producers (even alternatives stores!), no issues. However if you buy Apple you're forever locked to their rules and their Eco system, switching to another brands means loosing all software licenses and hardware compability. So in the end *even lf Apple sucks you'll lot switch due to the sunken cost. Let anyone sell Mac PCs and iOS phones, and it won't be a problem because then there can be a *competitive free market*", "score": 1, "replies": []}]}]}]}, {"body": "It depend on the deal. Just breaking them is good for current share holders since current investors will get share in the new companies and the return would be huge.", "score": 1, "replies": []}, {"body": "Google and Microsoft being big inaugural donors makes me a bit easy on the Dem vs Tech debate..... For now.", "score": 1, "replies": []}, {"body": "Look at the Standard Oil Company split - the equities that succeeded it made the investors rich\nHigher concentration in different companies can lead to higher returns just like diversified vs concentrated depot", "score": 1, "replies": []}, {"body": "Sounds great, gimme some Instagram and YouTube", "score": 1, "replies": []}]}
{"title": "Does $TSLA ever go down? 2023 puts ($200 to $300 strike) look cheap...🚀🚀🚀🚀", "selftext": "[deleted]", "id": "kthkr7", "created_utc": 1610158157.0, "score": 103, "upvote_ratio": 0.89, "num_comments": 70, "comments": [{"body": "\"Man with a large investment in Tesla says not to sell tesla\"", "score": 83, "replies": [{"body": "Exactly. Costs him money to say otherwise...", "score": 18, "replies": []}, {"body": "Chamath was bullish on TSLA since 7/8 years ago iirc.", "score": 2, "replies": []}, {"body": "\"Man known for making money investing put his money where his mouth is\"", "score": 2, "replies": []}]}, {"body": "Why stop there? Might as well price in Elon’s Mars travel agency. The imaginary prototype for Tesla’s mars rocket can already fly higher than a SPCE ship.", "score": 39, "replies": [{"body": "🚀🚀🚀🚀 I'm about to sell a kidney to buy more $TSLA.  (Heard you only need one in Mars.)", "score": 18, "replies": [{"body": "Sell both, just make sure u trust ur kids will do your work for u", "score": 4, "replies": [{"body": "Sell your kids kidneys for max profit", "score": 3, "replies": [{"body": "Why not just sell the whole kid? Wife's boyfriend can make more.", "score": 4, "replies": [{"body": "Lol.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "TSLA is not a stock it's a stonk. It only goes up.", "score": 54, "replies": [{"body": "Wtf is a stock", "score": 5, "replies": []}]}, {"body": "What he really means is please buy more and dump in your life saving, IRA, 401k, Refi the home and take out a second mortgage, then get the largest personally guaranteed loan you can muster.\n\nThen once TSLA hits that pristine point, where he feels his anus twitch and his gooch tingle, he’s going to dump every share and call he controls and leave a bunch of autistic retards bag holding with a slacked jaw “GuH.”", "score": 36, "replies": []}, {"body": "People always say \"this time it's different.\"\n\nBut this feels like the exact headline you'd see right before a big crash.", "score": 70, "replies": [{"body": "stop it...", "score": 16, "replies": []}, {"body": "Yo TSLA hodlers get your gay bear", "score": 5, "replies": []}]}, {"body": "No.  Next question.", "score": 12, "replies": []}, {"body": "When the green energy bubble finally bursts, a lot of fools will lose their minds... Because they all have been living in their own little bubble for a long time.", "score": 26, "replies": [{"body": "So you're saying 2023 puts will 🚀🚀🚀?", "score": 17, "replies": [{"body": "Who knows when and where all that will happen. And long term puts are expensive with really low break even points. No way to know if you're shorting at the top, so I wait for the opportune moment whilst doing credit spreads.", "score": 9, "replies": [{"body": "I do agree, while we will have more shifts towards better energy usage, etc. There is still a limited supply of lithium on this planet, and high energy/material costs of building these machines. Yes, I do believe we can have more efficient energy, but I think some people think we are magically producing energy now with all things EV. (We just need to harvest/contain a small black hole and then we’d be good on energy! Lol)", "score": 0, "replies": [{"body": "Or, you know, nuclear power. Unlike solar and wind, it actually works on a large scale (sorry, not a fan of rolling blackouts resulting from power generation that depends on the uncontrollable to produce power). Solar is an excellent power source at the individual level with a backstop, but it will likely never be the solution to mass energy production", "score": 1, "replies": [{"body": "Shhh... that actually works and wouldn’t waste all the taxpayers money.. don’t let the public know", "score": 5, "replies": [{"body": "Lmao why are you getting downvoted; honestly though people are actually kinda dumb for going against nuclear. They’re like cHeRyNoBl. I bet far more people die from falling off roofs while installing solar panels.", "score": 3, "replies": [{"body": "There are safe ways of doing it.. there are 3 in my state and no one even notices them quietly operating.. do some research.", "score": 3, "replies": []}, {"body": "Tell that to people anywhere near Fukushima.", "score": -3, "replies": [{"body": "I mean the guy's not wrong. Nuclear is statistically the safest option.\n\n [• Mortality rate globally by energy source 2012 | Statista](https://www.statista.com/statistics/494425/death-rate-worldwide-by-energy-source/) \n\n(Did I make a big bad, and actually post evidence to a WSB thread???)", "score": 2, "replies": []}, {"body": "Yes I understand the accidents are tragic. But Fukushima and the other accidents are usually due to poor management and equipment. Fission reactors have also evolved to be more safe as well. If you are just looking at the cold truth, nuclear reactors beats all other energy sources in almost every way right now. Only problem with them would be the chance for an accident and the production of nuclear waste(which is safely contained so it’s not a big problem). \n\nI think the real solution would be finding and implementing fusion reactors. I don’t get why we’re trying to invest so much in solar panels and wind turbines when they clearly aren’t the long term solutions.\n\nI’m in no position to really criticize, but politicians, media, and even some scientists take  stupidity and misinformation to another level.", "score": 2, "replies": [{"body": "I agree with most of what you're saying in principle, and honestly, at the end of the day, how can we measure a nuclear meltdown once every 50 years versus thr daily contamination (that most people are blissfully unaware of) that results from coal production?  I dont know.  But I do want to counter that nuclear waste from accidents isnt always safely contained forever.  Japan, for instance, wants to dump theirs from Fukushima into the ocean, now - to the ire of ecologists, obviously.", "score": 0, "replies": [{"body": "That’s true but I think with strict regulations and more research into cheaper ways of recycling the waste, it’s not too big of a problem.", "score": 2, "replies": []}, {"body": "Nuclear power under capitalism is a disaster waiting to happen. Externalities like where to dump waste are completely neglected. Profit over everything combined with Nuclear anything doesnt sound like my cup of tea", "score": 1, "replies": [{"body": "This is why I agree with the sentiment of the guy above but completely disagree with the reality of what he's suggesting.  Nothing over the past 200 years has proven that modern society is capable of respecting the safety of the planet.  Greed is destructive and humans are weak and selfish.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I've been pondering this for the past couple of days too.  I do think it will get an eventual haircut.  But when and for how much are the key questions for that I don't have an answer.\n\nI suspect the money printers effectively shutdown (or slow dramatically) by 2023.  And interest rates could possibly slightly increase.   These things could trigger a wobble in the market which could kaboom a lot of stonks.   In theory.\n\nI was pondering 400-500 strike price though... not sure I'm going to do it.  Simply because hype and herd money keep pumping this far beyond what I thought it could do.  So it could have a lot more in the tank, so to speak.", "score": 2, "replies": [{"body": "Yeah, $$400 to $500 is expensive.   I am talking tail end stuff.  ($200 strike lol.)", "score": 1, "replies": []}]}]}]}, {"body": "Any shorting right now will surely be squeezed. Try when it’s $2500. Will be there in 3 months.", "score": 17, "replies": [{"body": "You can feel the pain in burrys tweets", "score": 10, "replies": [{"body": "lol voided", "score": 9, "replies": []}]}, {"body": "But it's a put 😈", "score": 4, "replies": [{"body": "Those 200–300$ puts will be much cheaper then", "score": 6, "replies": []}]}]}, {"body": "It sounds crazy as fuck.   \nIt also sounds like something Elon could do.", "score": 10, "replies": []}, {"body": "This fucking guy chamath is such a fucking retard", "score": 9, "replies": []}, {"body": "the stronkest stonk of stocks!", "score": 3, "replies": []}, {"body": "If you write 1 put March 2023 @ $1,000, it's $451 per contract (bid price right now). So that's a $45k premium paid to you front. That makes your break even price $550 by March 2023 (ignoring potential for split), even though that $45k might seem long gone 2 years from now. Seems like free money though. You could even buy yourself a Tesla with the premium. Not sure if my broker would let me, although I have $100k in equity when counting my OTC stonks so maybe they'd allow it. I doubt the shares would get assigned.", "score": 3, "replies": [{"body": "Lol you doubt shares would get assigned? Hahaha please do this and post positions", "score": 3, "replies": [{"body": "You think Tesla will be less than $1,000 2 years from now? Nah. Unlikely.", "score": 2, "replies": [{"body": "You could make more selling closer dated. Unless you need 45k right away. Wives boyfriends need capital.", "score": 1, "replies": [{"body": ">You could make more selling closer dated.\n\n\nIf it dips soon then yea", "score": 1, "replies": []}]}]}]}]}, {"body": "I figured it out. This stock keeps going up so people make enough to buy a Tesla and rid the world of gas powered cars.  And with gas soon to be $4-5 per gallon, this is a win win. i don’t see it going anywhere but to the moon then mars.  i am usually wrong which is why i’m here but i got in pre-covid lockdown prices and i’m in for long haul. cant back out now until i can afford one of those sweet Teslas.", "score": 5, "replies": [{"body": "They made 500k vehicles last year. The world has nearly 8 billion people.  If you figured perhaps 1 billion drove and needed a tesla, then it would take 2 thousand years to supply them at this rate.", "score": 1, "replies": [{"body": "Are you implying there will be a supply / demand issue? that’s not good.  They are ramping up production i believe.", "score": 3, "replies": [{"body": "I think my point was mainly just to be crass, but it's an amusing fact, and whomever downvoted me is an idiot.", "score": 1, "replies": [{"body": "Yeah i took it that way as well. No need to downvote. maybe someone accidentally clicked the down button scrolling thru, it can happen.  Tesla to the Moon 🚀then Mars 🚀", "score": 2, "replies": [{"body": "I need to hop back onto some OTM tesla calls Monday but as long as it's green the prices are insane.", "score": 2, "replies": []}]}]}]}, {"body": "\"at this rate\".... Why would they continue at this rate? This is the dumbest shit lol. They will build 1M in 2021 and probably 2M in 2022, etc. The plan is to do 20M/year by 2030.", "score": 1, "replies": []}]}]}, {"body": "some people just like to burn money", "score": 2, "replies": []}, {"body": "Fuck you peter.", "score": 2, "replies": []}, {"body": "How cheap? I'll throw a hundred or 2 at it but I'm not doing much more betting against retard strength", "score": 2, "replies": []}, {"body": "did he got late in this rocket?", "score": 2, "replies": []}, {"body": "I never take these articles seriously. Of course he's saying that. These fucking guys always say this shit and then get their cocks stroked in headlines to protect their own books. Which is Why 9/8 \"analysts\" are fucking retarded, and these fund tards can eat shit. Analyst: \"I dont comment on any stocks I own\" yeah so they play ookie cookie together with all the other analysts and the guys that blows all over the cookie last has to eat their jizz and then stroke their buddies stock cock. Fund tard: \"dont sell this stock its gonna go to uranus, plus I'm saying this because I'm heavily invested in it\" And then, when all you autists and all the soccer moms have piled in and made dudes like this billions, theyll pull the rug, and leave you holding your jizz stained cookie and the bags. \n\nI'm a tesla bull but come on", "score": 2, "replies": [{"body": "Do you know who Chamath is?", "score": 3, "replies": []}]}, {"body": "Is this a dare or some sort of strategy like a GoFundMe to get that Khardasian cunt to be a billionaire? \n\nIm in.", "score": 3, "replies": [{"body": "Serious q.  Lol.  The puts are cheap.  What's the worst that can happen 😈", "score": 2, "replies": [{"body": "They're not really that cheap though....", "score": 2, "replies": []}]}]}, {"body": "this lead balloon cant ever drop", "score": 1, "replies": []}, {"body": "He just wants to tell before you", "score": 1, "replies": []}, {"body": "Good luck.", "score": 1, "replies": [{"body": "Namaste 🙏🏿", "score": 1, "replies": []}]}]}
{"title": "Salesforce", "selftext": "No matter what happens with COVID-19 in 2021, cloud spending isn't expected to slow. That makes cloud-based customer relationship management (CRM) software provider **salesforce.com** ([NYSE:CRM](https://www.fool.com/quote/nyse/salesforcecom-inc/crm/)) a solid bet to outperform with Biden in the White House.\n\nIn simple terms, CRM software helps businesses track customer information, log service issues, and manage their marketing campaigns. Although retail is the most logical beneficiary of CRM solutions, it's by no means the end-all. Manufacturing, healthcare, information technology, and service industries all benefit from real-time customer data to better serve their existing clients and make add-on sales.\n\nIn terms of CRM software, [salesforce is the kingpin](https://www.fool.com/investing/2020/12/28/got-1000-3-stocks-to-buy-to-start-2021-with-a-bang/). **Gartner** estimated that it controlled 18.3% of the global CRM market at the end of 2019. That's more than double its next-closest competitor. With the addition of **Slack Technologies**, which salesforce has [agreed to acquire for $27.7 billion in cash and stock](https://www.fool.com/investing/2020/12/01/salesforce-building-the-operating-system-for-the-f/), salesforce will have another way to cross-sell its products on a rapidly growing business-based platform.\n\nConsidering that most [software-as-a-service (SaaS) stocks](https://www.fool.com/investing/stock-market/market-sectors/information-technology/saas-stocks/) are valued at 20 or more times sales, salesforce looks like an absolute bargain at less than 10 times fiscal 2021 sales.\n\nMy Positions: CRM 230C Calls March 19th Expiry", "id": "kttckq", "created_utc": 1610207897.0, "score": 50, "upvote_ratio": 0.83, "num_comments": 72, "comments": [{"body": "Every day I ask myself if today is the day salesforce recovers to pre-slacks values", "score": 64, "replies": [{"body": "I think there will be a run-up before earnings, this should be a bottom cause from a technical analysis the 3 month charts shows a head and shoulders pattern which is a bullish signal", "score": 10, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "Does a head and shoulders form after a merger? A gap up?", "score": 4, "replies": []}]}, {"body": "I took a shit today and there were a couple floaters left in the bowl even after I flushed, seems bearish imo", "score": 16, "replies": []}, {"body": "Head and shoulders is bullish?\n\n[https://www.investopedia.com/terms/h/head-shoulders.asp](https://www.investopedia.com/terms/h/head-shoulders.asp)\n\n In [technical analysis](https://www.investopedia.com/terms/t/technicalanalysis.asp), a head and shoulders pattern describes a specific [chart formation](https://www.investopedia.com/terms/c/chart-formation.asp) that predicts a **bullish-to-bearish trend reversal.** The head and shoulders pattern is believed to be one of the most reliable trend reversal patterns. It is one of several top patterns that signal, with varying degrees of accuracy, that an **upward trend is nearing its end.**", "score": 1, "replies": []}]}, {"body": "I dropped them on that stupid, stupid Acquisition...", "score": 2, "replies": [{"body": "The Slack acquisition looks like a larger play at enterprise. Slack and Tableau are adds that directly compete with Microsoft in Teams and Power BI. They’re working their way upstream on the value chain. CRM has bigger goals than expanding their sales footprint.", "score": 16, "replies": [{"body": "Seriously still Don‘t see Slack helping. Especially since Slack CEO Butterfield and Salesforce COO Taylor are college buddies - they developed the plan together.\nSalesforce: Well revenue growth forecasts have been lowered and analysts see that continuing. EPS estimates have been revised (lower). Consensus Analyst target price lowered as well, leaving salesforce slightly overvalued.\nI wish you the best. I won‘t buy Salesforce again until things change.", "score": 0, "replies": []}]}, {"body": "Piper Sandler downgrades Salesforce and comments on the negative effects of their passt two Acquisitions... \ndon’t shoot the messenger. 🤷🏼‍♂️", "score": 1, "replies": []}]}]}, {"body": "Salesforce is in a consolidation phase. When it breaks out it’s going to fly quick", "score": 22, "replies": [{"body": "Once it breaks the 235 resistance its going to the 🚀🚀", "score": 10, "replies": [{"body": "it at 236 now u rabbit", "score": 3, "replies": []}]}]}, {"body": "In other news, water is wet", "score": 16, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "I read it on a DD last week", "score": 4, "replies": []}, {"body": "Honestly like he thinks he can just come in here and make outlandish claims?!?!", "score": 3, "replies": []}]}]}, {"body": "All they’re missing is Workday and their cloud collection will be complete. Calls on America’s back office.", "score": 7, "replies": [{"body": "Not the craziest thing. Workday would be a bit of a stretch given the price tag, but one of the up and comer HCM platforms that has a similar style to Salesforce would not be crazy. Something like Zenefits which is pre-IPO and around $2B in valuation wouldn’t be far fetched.", "score": 2, "replies": []}]}, {"body": "Dude, this is posted by an obvious shill account. Check his history...", "score": 11, "replies": [{"body": "What does that mean", "score": -2, "replies": [{"body": "Good rule of thumb, if you don't understand a word someone uses, try googling it.\n\nShill:  an accomplice of a hawker, gambler, or swindler who acts as an enthusiastic customer to entice or encourage others.\n\nLiterally acting like a buyer trying to entice us to buy Salesforce on behalf of people who own Salesforce.", "score": 6, "replies": []}]}]}, {"body": "God crm is so fucking clunky, i think ur better off using seperate services for everything u do w crm much faster n intuitive sure u have to log on multiple times but user experience ui n data pulling is so fucking painful", "score": 5, "replies": []}, {"body": "Salesforce is an expensive, tired product. Nobody who uses it loves it. They are an incumbent ripe for displacement as soon as somebody figures out how to eliminate all the non-revenue generating, redundant, wasted, time we all spend in salesforce.\n\nSalesforce sells mgmt on “if it’s not in salesforce, it didn’t happen”\n\nIn practice this looks like an entire sales team spending a day daily/monthly/quarterly entering in fake “no answer - vm left” calls in order to bring their activities up. Most people don’t feel like going through  5-10 clicks for every call that the client didn’t pick up the phone.\n\nI could not think if a worse way for you’re sales team to spend their time.", "score": 16, "replies": [{"body": "I've done the old fake \"no answer, lvm\" soooo many times on fridays to boost weekly call numbers lol. Then I got an outside sales job and didnt have to do that shit anymore", "score": 5, "replies": []}, {"body": "As an engineer, Salesforce has a reputation for high turnover of engineers.", "score": 5, "replies": []}, {"body": "A company will need to pay license + third party IT vendor fees because it's too complicated to be configured. Fucking bloated piece of shit. You'd save more money writing your own CRM application from the ground up rather than maintaining this monstrosity.\n\nSource: used to be a SFDC developer.", "score": 4, "replies": []}, {"body": "Expensive, yes. Tired, hardly. It's much more than a CRM — Pardot is one of the best marketing automation tools you can get. With Slack integration, communication between marketing and sales teams will all live inside Salesforce making it easy to collaborate. If you don't like logging your activities, you're just lazy and likely trying to hide the real way you spend your time — browsing reddit and facebook.", "score": 4, "replies": [{"body": "I could spend my time huffing modelling glue, but if I hit 115-130% of quota, as I do, management should not give a fuckkk.", "score": 4, "replies": [{"body": "Lol this is how it goes lol", "score": 3, "replies": []}, {"body": "Is modeling glue a better alternative to elmers?", "score": 2, "replies": []}, {"body": "It's about more than a quota, it's about data you can give them because you're a dime a dozen.", "score": 2, "replies": [{"body": "How about this one. Use tech... to collect data... (here’s the big one) *WITHOUT* driving your sales team to input fake data and/or inefficiently burn time while doing so. Groundbreaking, I know.", "score": 4, "replies": []}, {"body": "Ummm fake data is useless data. \n\nGod it’s like you didn’t even read my comment, but still decided your opinion is so valuable that we needed to hear it. Even if it’s irrelevant and doesn’t address what I said.\n\n-“They are ripe for displacement b/c it’s inefficient and sf has coached mgmt to incentivize activity over results which leads to employees faking data.”\n\n- “Durrr it’s not about quota it’s about data.”\n\nYou’re going to be a star in this sub, kid. 🤩🚀🚀", "score": 5, "replies": [{"body": "Yes fake data is useless I was a cable tech and they wanted me to collect so much data it was worthless because I’d skew the number because it was tooooo much work on top of the other work", "score": 3, "replies": []}, {"body": "Oh I read your comment, but just because your organization is shitty and your boss pressures you to fake activity doesn’t mean that happens everywhere. Sounds like you work for dickheads.", "score": 0, "replies": [{"body": "Where do you work where they don’t do that lol", "score": 3, "replies": []}]}, {"body": "Does everybody work for dickheads? Maybe 🤔", "score": 1, "replies": []}, {"body": "Just trying to be a retard like everyone else here 🤷‍♀️", "score": 1, "replies": []}]}]}, {"body": "Classic.", "score": 1, "replies": []}]}]}]}, {"body": "I hope u r right... \nCRM 6/19 230c @22.10\nCRM 1/21/2022 300C @ 10.70", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I will sell them its traded sideways past month and the acquisition will take more than a year. I would put that money towards Blue chip stocks (EV and energy stocks)", "score": 4, "replies": [{"body": "“Blue chip stocks (EV and energy stocks)” \nLOL", "score": 10, "replies": []}]}]}, {"body": "Got in on some 220/230 debit spreads for 2/19 earlier this week. It’s gonna have a good run these next few weeks. It’s very much undervalued at 220 right now", "score": 2, "replies": []}, {"body": "My company recently moved to Salesforce after 20 years of using other bullshit software.  They seem to love it for people that use it on a daily basis.  Definitely think Salesforce have something long-term for profit generating goodness.", "score": 2, "replies": []}, {"body": "Salesforce has become industry standard but it won't last long. I used to be a Salesforce developer and the system have become so complex, tedious and infuriating to maintain. All it takes is one competition with an elegant solution to CRM with 1/4 of the cost to take this behemoth down.", "score": 5, "replies": [{"body": "Problem is no one wants to develop something from scratch to take them on 🤷🏼‍♂️", "score": 3, "replies": []}, {"body": "The problem is they like other tech behemoths have a monopoly on CRM. Pretty much all other software in the world is designed to work with or integrate with Salesforce.", "score": 2, "replies": [{"body": "Not sure what you mean but if a software has rest webservices api then it can integrate with any systems in the world.\n\nSalesforce however is partially rest service, and SOAP (which is a fucking retarded outdated way to integrate with other systems).\n\nIf you have some technical expertise, try making a Salesforce sandbox, open up postman and try to create an Account record. You will see what I mean.", "score": 2, "replies": [{"body": "I don't mean merely integrate with but truly designed to work with. Not a technical guy - but an example would be somebody like say Marketo (and thousands of other software suites) - designed to work with Salesforce.", "score": 1, "replies": []}]}]}]}, {"body": "I own about 6k worth of salesforce, but WCLD is better for betting on cloud, which is why I have 1300 shares.", "score": 3, "replies": [{"body": "Having the same opinion but much lower position in WCLD. But little afraid of P/S ratios of these companies included in wcld. \nI also own individual stocks of RNG, pfpt and mime even if they are included in wcld", "score": 3, "replies": []}]}, {"body": "Great play, for March 2020", "score": 3, "replies": [{"body": "Thanks man, I am expecting a huge run-up pre earnings Feb 23", "score": 1, "replies": [{"body": "Does $MSFT report first? It’d sure as hell try to discern if Microsoft CRM took any market share from Salesforce.\n\nAlso scan social media to see if you can find anecdotal stories of people at firms going from Salesforce to MS CRM, or vice versa.", "score": 1, "replies": [{"body": "Salesforce’s market value topped Oracle’s back in 2019, another sign that primacy in software had swapped hands.", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Where’d you get that $35 p/share number?", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Can you explain why it has been in a downtrend ever since it IPOd?", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Do you know what has caused it to go up during the past 3 months? Any fundamental changes in the company?", "score": 2, "replies": []}]}]}]}]}]}, {"body": "150 @ $223 🚀🚀🚀🛸🛸🛸", "score": 1, "replies": [{"body": "🚀🚀🚀", "score": 2, "replies": []}]}, {"body": "MMs value salesforce using ev/ebitda btw. and margins wont improve for awhile look at headcount trends", "score": 1, "replies": []}, {"body": "Sold some for a loss last week because I’m sick of holding onto these mother fuckers but I’m stuck with 3/19 240s that I don’t need to print just recover lol", "score": 1, "replies": []}, {"body": "Fuck crm. Lost 1500 on 12/31 calls", "score": 1, "replies": []}, {"body": "The Slack Addition makes absolutely no Sense at all. Expensive move that will have a long term negative effect on the Company. I dropped salesforce after that move and will Continue investing in their competitors...", "score": 0, "replies": []}, {"body": "TWLO betta", "score": -1, "replies": [{"body": "What do you mean? Love Twilio and I see them going far, just didn’t understand your message lol", "score": 1, "replies": [{"body": "TWLO betta than CRM", "score": 2, "replies": []}]}]}, {"body": "I dont get it. Go on github. CRMs are a dime a dozen.", "score": 0, "replies": []}, {"body": "Saleforce is mediocre. Business people automatically assume that if its cloud saas that its light, easy, and affordable.\n\nFor small business with very basic features of a CRM need its OK. For large organizations that require integration and various features its not intuitive or cost effective. \n\nIve also not been impressed with Salesforce sales teams account managers or support. Their licensing while simple on paper is another issue along woth their non transparent pricing (forget what you see online).", "score": -2, "replies": []}, {"body": "Nah burned me for 600 bucks last month already no thanks shit stain company.", "score": -2, "replies": []}, {"body": "Tableau remains critical in non-sales industries.", "score": 1, "replies": []}, {"body": "Piper Sandler downgrades Salesforce. Negative effects of the past two acquisitions. As stated before... best of luck with your trade.", "score": 1, "replies": []}]}
{"title": "Gasp! TSLA is NOT bigger than top 10 autos by Enterprise Value. Sa-weeet! More room to grow! Video made by u/Radiatin", "selftext": "", "id": "ktv2xm", "created_utc": 1610213130.0, "score": 375, "upvote_ratio": 0.9, "num_comments": 72, "comments": [{"body": "All this video tells me is that my TSLA 3500c will print", "score": 146, "replies": [{"body": "Only if you got it for end of Jan. I’m not 100% sure it will get there by 1/15", "score": 49, "replies": []}, {"body": "I looked in my crystal ball, and you will be rich", "score": 22, "replies": []}]}, {"body": "Not only is this video out of date by the tune of like 200 billion, most websites  are not counting TSLA employee options either with I think some estimates already having it over 1t in market cap.", "score": 83, "replies": [{"body": "Enterprise Value ≠ Market capitalization", "score": 38, "replies": [{"body": "[removed]", "score": 86, "replies": [{"body": "Do one for Hertz", "score": 14, "replies": [{"body": "Zero.\n\nHurts doesn’t it", "score": 11, "replies": [{"body": "Not if you shorted them", "score": 3, "replies": []}]}]}]}]}, {"body": "can't you count employee options for the other automakers too then?", "score": 3, "replies": [{"body": "Sure, but I my gut tells me TSLA likely compensates with options more than the others so I doubt it would offset.", "score": 14, "replies": [{"body": "wait\n\nlike call options?", "score": 0, "replies": [{"body": "They aren't compensating employees with puts, that's for sure", "score": 27, "replies": []}, {"body": "Stock options. Look up Elon’s ceo compensation package", "score": 5, "replies": []}, {"body": "Most big companies gift call options if you sign up where you pay no premium, you just take money out your salary for a few years.\n\nMine does it.", "score": 4, "replies": []}]}]}]}]}, {"body": "Even with the problems with the data in this video (not using Fully diluted share count for TSLA and not being current for the recent rally) \n\nHow is it still being framed as reasonable that TSLA would be 50% of the ENTERPRISE value of the other automakers?", "score": 58, "replies": [{"body": "Because to a Tesla fanboy, Tesla is better than everything, so it ***should*** be a higher enterprise value than the entire auto industry... therefore, room to grow!\n\nThey may be slightly retarded, but we won't hear much about that until the bet stops paying off, then everyone will claim they *always knew* Tesla was overvalued.", "score": 24, "replies": [{"body": "They will laugh at anyone who was long tesla. Meanwhile, if tesla keeps going up, those same people will laugh at anyone who shorts it.", "score": 3, "replies": [{"body": "Yeah a lot of people are sheep - that's why they lose money unless the trend stays the same long term, as it has the last decade or so.", "score": 1, "replies": []}]}, {"body": "i think tesla fanboys think it should be at least 10x the enterprise value of the rest of the industry", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Of course we're invested in Musk you genius. Who would be dumb enough NOT to invest in the guy?! \n\nThe only reason to sell some Tesla stock will be to buy some Starlink stock.", "score": 2, "replies": []}]}]}]}]}, {"body": "It’s priced in that Tesla Will have a monopoly over the car market. Just buy puts on any other car company.", "score": 12, "replies": []}, {"body": "Leaps on Monday, got it.", "score": 9, "replies": []}, {"body": "This is Toyota Propaganda", "score": 11, "replies": []}, {"body": "I have been really enjoying learning about progressively weirder and more esoteric ways of valuing companies to keep trying to justify Tesla share price.\n\nIt's like watching a competitive eater stuff one more hotdog into their stomach when you just didn't believe it was possible.", "score": 9, "replies": [{"body": "Just trying to figure out how to play the inevitable reversal of fortune", "score": 2, "replies": [{"body": "It's hard to know how to fight mania. I mean BeetCorn is going nuts for the same reason: people have money that they want to put into SOMETHING and they're looking for the thing that seems to be going up. And it's a self fulfilling prophecy that will only stop when people run out of money to irrationally invest.", "score": 2, "replies": []}, {"body": "TSLA $300P 2023", "score": 1, "replies": [{"body": "My problem with all the TSLA puts is they’re so expensive. 75% IV on that option is likely to be lower in 2 years, so if it doesn’t crash deep enough you can still lose. I think TSLA will find major support in the “couple hundred dollars” range.\n\nWhat’s a reasonable bear target for 2023 in a crash scenario? $200 share price? $100? This $4000 option would only be worth $10k or $20k intrinsic value at those prices, or 2-5x. Not a big enough return for the risk level of that trade IMO.\n\nA big crash is already priced into the LEAP puts.", "score": 2, "replies": []}]}]}, {"body": "TSLA is the Joey Chestnut of stocks. Unstoppable", "score": 3, "replies": []}, {"body": "dont have to tell you that they can easily press another 15 inside after the point you were shure that theyll puke...", "score": 1, "replies": []}]}, {"body": "Tesla $1000 EOW", "score": 9, "replies": [{"body": "I was thinking Wednesday", "score": 6, "replies": []}, {"body": "Just another 14%, so $880 -> $950 on monday (8%), and then a quick 6% increase on tueseday for $1000.", "score": 3, "replies": []}]}, {"body": "So tired of only seeing Tesla in this sub since months. Gonna celebrate when the bubble finally pops.", "score": 35, "replies": [{"body": "I am in the same boat as you but there is no need to be toxic because we missed (still missing?) the train.", "score": 34, "replies": [{"body": "It's a train with one door but 1000 fat fucks. Not all will make it, and I for sure I'm not getting on!", "score": 1, "replies": [{"body": "The door is only for options holders.\n\nStock holders are very cozy inside this warm \"bubble\" and are not exiting any time soon.", "score": 1, "replies": []}]}]}, {"body": "Why would they stop posting about it then?", "score": 3, "replies": []}, {"body": "U must hate celebrations. Lol find sonething else to get yur hopes up", "score": 7, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Agreee to disagree", "score": 1, "replies": []}]}]}, {"body": "Great opportunity to buy puts. Just don't date them for something like 1/15", "score": 5, "replies": []}, {"body": "Get back to the boomers in r/stocks and r/investing 🌈🐻🤡", "score": 2, "replies": []}, {"body": "Me too me too", "score": 1, "replies": []}, {"body": "Join us", "score": 1, "replies": []}]}, {"body": "Volkswagen market cap is only 80B???? Right???", "score": 2, "replies": [{"body": "they are a buy", "score": 1, "replies": []}]}, {"body": "But stonks only go up, so I dont see a problem here", "score": 2, "replies": []}, {"body": "i will buy 1 long term deep OTM put contract. when this shit explodes, i will make tendies.", "score": 2, "replies": []}, {"body": "Only way TSLA is going down is if Musk leaves.", "score": 2, "replies": [{"body": "Which won't happen.\n\nI really hope he has the best bodyguards money can buy. And that he stays away from any fucking lethal disease.", "score": 1, "replies": [{"body": "He seems to live a fairly safe lifestyle, buy if anything were to happen, my god those puts would print overnight.", "score": 1, "replies": []}]}]}, {"body": "Stop hating, Tesla to the MOON!!!", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Because its market cap is insane.", "score": 1, "replies": []}]}]}]}, {"body": "Just imagine how rich would be the guy who lands on Mars first :)", "score": 1, "replies": []}, {"body": "Yeah buy more and hold forever", "score": 1, "replies": []}, {"body": "Yet.", "score": 1, "replies": []}, {"body": "$1000c 1/15", "score": 1, "replies": []}, {"body": "This is a stupid video. EV adds debt - so Tesla’s equity IS worth more. All this shows is that the competition is full of debt.", "score": 1, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Are you retarded? I mean, we’re all retarded this is WSB, but seriously where did you get those numbers? Tesla has more cash than debt.", "score": 1, "replies": []}]}]}, {"body": "Tesla will never be bigger than the top 10, as it has to be bigger than itself. Infinite room the grow, all in.", "score": 1, "replies": []}, {"body": "Title kind of weird OP 🥶", "score": 1, "replies": [{"body": "Your mom typed it. I’m her boyfriend.", "score": 1, "replies": []}]}, {"body": "bullish, this means that Tesla still has room to grow to 2 trillion", "score": 1, "replies": []}, {"body": "This is so absurd, I just have to laugh really hard. Even the 2nd and 3rd biggest combined is still lower valued than freaking Tesla.", "score": 1, "replies": []}, {"body": "Question... will all these car companies be bullish from 2021 to 2025? if so why not grab shares in them all?", "score": 1, "replies": []}]}
