{"title": "Sell TSLA stock to buy GME", "selftext": "[removed]", "id": "l41zzc", "created_utc": 1611504007.0, "score": 4, "upvote_ratio": 0.55, "num_comments": 74, "comments": [{"body": "100-150 is reasonable imo. I'd buy either buy in now at $61 or wait for a possible dip in the morning. I've got orders in for 400 shares at market open.", "score": 14, "replies": [{"body": "What makes you think 100-150? I haven’t seen someone talk about jt", "score": 6, "replies": []}, {"body": "Would you suggest selling when it gets tk 100-150 or wait it out? \n\nAlso are you expecting a massive dip in morning or just small? I bought in at 65 and I’m down a good amount now from buying so many shares but hopefully am still sitting good", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Maybe. Honestly half is a lot ouf this could go higher. Not a bad idea tho. Do you think we could see much higher than 130? I think this could be a potentially huge squeeze similar to volks wagon before. If so, might be worth holding out to 400 or 700 +.  Thoughts?", "score": 2, "replies": [{"body": "I'm definitely no expert. I don't think anyone really knows how high it could go.", "score": 1, "replies": [{"body": "True, as long as I don't lose much, I will be fine. Definitely a good learning experience and motivation. I know we can't say it's guaranteed, but is it *almost* guaranteed to go up?", "score": 2, "replies": [{"body": "I hope so. Good luck!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I’m definitely buying a few shares when it opens up. I don’t want to sell all of my TSLA stock maybe a couple and some more here there. Like NIO, GM, PLTR", "score": 1, "replies": []}, {"body": "That would give GME a market cap of $7-$10bn, for a struggling company getting phased out by more innovative competitors, that’s way too much.", "score": -8, "replies": [{"body": "It’s not trading on fundamentals right now.", "score": 4, "replies": [{"body": "Neither is a lot of the market lol", "score": 0, "replies": []}]}]}, {"body": "Are you buying pre market or right after market opens? Pre market scares me since it’s so volatile. I’d prob wait until mid morning if I were you but not too long.", "score": 1, "replies": []}]}, {"body": "Tesla earnings this week don’t be a dummy", "score": 7, "replies": [{"body": "Good point that I completely overlooked. I’m not planning on selling all of it anyways but definitely a good point", "score": 3, "replies": [{"body": "Counter point....\n\nTSLA earnings this week is not a reason to hold.  There are other reasons to hold, but this certainly isn't one that should change your mind.\n\nLast earnings, TSLA did not see a spike.  Flat.  \n\nThis earnings has more risk than reward to it with most topics that would come up already being priced in.", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Don't you all know that this price action is almost PURELY related to the short-squeeze?\n\nDon't be a dunce, obviously this growth isn't related to fundamentals", "score": 6, "replies": []}, {"body": "What goes up must go down. Thinking about buying some GME myself but way too risky.", "score": 1, "replies": []}]}, {"body": "oh geez\n\ni’m coming from r/wsb and even I can tell you to not sell TSLA to get GME... unless youre one of us. Chances are, you are here to grow your wealth in a stable, healthy way. Selling TSLA to chase GME isn’t how you wanna go about it. Imagine this strategy translating over into your future trades. But then again, I’m a gambling degenerate, can’t really tell you much at the end of the day. Good luck with your moves brother 🚀", "score": 7, "replies": [{"body": "Fellow PLTR bull - I currently have 40 shares of PLTR (21% gain so far at $1,300 total value). Do you think I should sell tomorrow morning and buy GME? I know it’s their demo day on Tuesday and a lot of people seem to lean towards the stock falling after. Thoughts?", "score": 1, "replies": [{"body": "I’m not selling PLTR for GME, but I do have other exhausted plays I will be selling for GME. I’m not a financial advisor whatsoever, but chasing GME is a gamble. I’m a gambler and that’s what I will be doing lmfaooo. Don’t ever think you’re not gambling if you plan on doing the same", "score": 1, "replies": []}, {"body": "I would also like to add, if that’s your strategy for growing $$$ go for it! Everyone has there own style and I’ve definitely sold out of other plays to chase another, but I’ve also always been down to lose what I put down. Personally, PLTR is more of an investment for me. A “buy the dip” type beat.", "score": 1, "replies": []}]}]}, {"body": ">I’ve made over $3k on those 7 TSLA shares so it won’t hurt too bad if GME fails but at the same time idk if it’s still a good time to buy.\n\nTextbook mental accounting", "score": 2, "replies": []}, {"body": "TSLA is a long term investment, GME is a short term gamble. Selling one for the other doesn't make a lot of sense unless you've recently decided to switch from being an investor to a trader or gambler or vice versa.", "score": 2, "replies": []}, {"body": "Gme is def a once in life time opportunity. But even so, don’t sell Tesla.", "score": 2, "replies": []}, {"body": "Why would you pick GME at projected -19% 2021 revenue growth over TSLA at +48%?", "score": 3, "replies": [{"body": "Because he can make a quick buck off the GME short squeeze and then throw that profit back into Tesla.", "score": 36, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Considering the hedgefunds are still in deep in their shortselling positions, yeah, it really is that easy right now.\n\nNot telling anyone to bet the farm buying GME stock, but if you invest a little bit, you can get off with some easy profit.  Just need to make sure you're not listening to the WSB alts telling you it's going to shoot to $3,000.  Don't just get caught being left a bagholder, assess your own risk tolerance, and know when you personally need to get out.", "score": 6, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "I mean, I literally just explained it to you, but you seem rather butthurt about it.  If you don't want to participate, then don't.  That's your decision.", "score": 6, "replies": []}, {"body": "You could've said the same thing on Friday morning. How could a stock that went from 4 dollars to 40 dollars continue to run? Well, it did. It went up 50% and can go up even more.", "score": 2, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "So a stock that goes from 4 to 40 dollars still has room to run, but a stock that goes from 4 to 60 doesn't? How do you determine this?\n\nIf you don't like any of my posts or comments, feel free to reply to them directly. But no need to derail this conversation.", "score": 1, "replies": [{"body": "I feel like I’m in an echo chamber. You let me know where I said it has room to run after going from 4-40. Dont try and change up what I said to fit YOUR narrative. So like I said again, mr 23YO, go put your money back into VT, unless like 5 days ago, you have literally no idea about trading.", "score": 1, "replies": [{"body": "> You let me know where I said it has room to run after going from 4-40. \n\nSo to be clear: do you believe that a stock that goes from 3 to 40 dollars still has room to run or not? \n\nIf you say it wouldn't have more room to run, what happened on Friday proves you wrong. \n\nIf you say it would have more room to run, then why can't a stock that went from 4 to 60 have room to run also? \n\nI don't know why you're so triggered by a post about VT anyway, but if you want to discuss it, feel free to reply to that post and I will be happy to talk about it. But it is irrelevant to the discussion about GameStop.", "score": 2, "replies": [{"body": "Wow, way to dodge literally every question I threw at you, and again, trying to change to conversation to fit your narrative. \nIt’s pretty apparent, that even through your passive aggressive attempts, that you really don’t have a solid argument here, and you just like to hear yourself talk. \nI hope you make all the monies on the OTM GameStop calls bud. Also, I really hope no one wishes you a happy birthday. And with that, I’ll block you in about 45 seconds after you read this🤷🏻‍♂️", "score": 1, "replies": [{"body": "Looks like GME still had room to run. Sorry you missed out!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Exactly my thoughts. But then there’s always the what if I just lose it 🤷🏻‍♂️", "score": 0, "replies": [{"body": "Because you don't buy what you can't afford to lose.\n\nKnow your own personal risk.  I'm buying 30 shares on the open tomorrow because if it all goes tits up, I'm comfortable with that, but reasonably speaking the stock is still going to go up because the short squeeze still hasn't occurred and hedgefunds are still quite exposed.\n\nAgain, know your own risk tolerance.", "score": 4, "replies": [{"body": "Of course. The money that I put into GME is honestly a gamble and I’m ok with losing it if it comes to that I’m not going to put money I don’t want to lose cause at the end of the day nothing is certain.", "score": 1, "replies": []}]}]}]}]}, {"body": "I have 7 tesla shares and was considering selling all of them to yolo into GME last week, didn't and ended up buying 10 shares for 39.90. Cucked myself lol", "score": 1, "replies": []}, {"body": "There was a thread about this less than 24 hours ago. Utilize the search function instead of making duplicate posts", "score": 1, "replies": []}, {"body": "The short squeeze aside I want to wait and see after the dust settles if Ryan can actually implement his strategy. If he starts making headway I’m debating on opening and building a position in the company long term.", "score": 1, "replies": []}, {"body": "GME is NOT hitting $1000 per share. That would give them a market cap of nearly $70 billion. You really think GameStop is more valuable than FedEx, Sherwin-Williams and Spotify? \n\nDon’t listen to the crap being parroted on this sub about GME.", "score": -3, "replies": [{"body": "The $1000 mark has nothing to do with market evaluation, it has to do with the short-squeeze PT\n\nLong term, I'd say GME PT is closer to anywhere between 60 and 120 for now", "score": 6, "replies": [{"body": "I know that but you really have to take a step back from the echo chamber and ask yourself, is a stock that was $2.80 a year ago going to hit $1000?", "score": 0, "replies": [{"body": "It really has nothing to do with fundamental growth, but with price action. The short-squeeze has not occurred, if it occurs at all, and we know this by short-interest reports and gamma squeeze analysis. For a short-squeeze, historical factors indicate that such a squeeze can push a stock upwards by 300% to 1000%, which is the range of increase that short-squeezes have affected stocks in the past.\n\nGME has a larger short to float ratio (130% ish) than any short-squeeze seen before, and the float is narrowing quickly. I mean, its already small, but its getting smaller. So people are picking the upper limits of the short-squeeze % increase, if not higher than 1000%, to get to the $1000 mark.\n\nIf $65 is the base price, a 1000% increase would make GME reach $650, so no, I don't think 1000 is attainable, but should it all happen, it would definitely be somewhere in the triple digit range before coming back down\n\nIt is completely disconnected from fundamentals, and is rather completely a price-action play that big players know how to manipulate.", "score": 3, "replies": [{"body": "Let’s reconvene in a month to see what happens. Good luck! RemindMe! 30 days", "score": 1, "replies": [{"body": "Sounds good to me", "score": 2, "replies": [{"body": "RemindMe! 1 month", "score": 2, "replies": []}]}, {"body": "I will be messaging you in 30 days on [**2021-02-23 19:27:15 UTC**](http://www.wolframalpha.com/input/?i=2021-02-23%2019:27:15%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/l41zzc/sell_tsla_stock_to_buy_gme/gkmhmm8/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fl41zzc%2Fsell_tsla_stock_to_buy_gme%2Fgkmhmm8%2F%5D%0A%0ARemindMe%21%202021-02-23%2019%3A27%3A15%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20l41zzc)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "I sold GME at $310 for 2000% gains, including gains from options", "score": 1, "replies": [{"body": "Congrats mate!", "score": 2, "replies": [{"body": "Thanks!", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "It not even a $150 a share company. This sub is pumping the stock because a lot of people yeeted their rent money onto a gamble.", "score": 3, "replies": []}, {"body": "I agree. But then you start seeing crazy targets like that all over and you start thinking what if.", "score": 1, "replies": []}, {"body": "No one said it would reach that based on the value. This is about the short squeeze. Do your own research on the short interest, short interest ratios, trading volume on GME to get a better understanding of what's happening now.", "score": 1, "replies": [{"body": "We get it. All we’ve heard on this sub is that Institutions haven’t even covered their positions yet so the short squeeze hasn’t even begun. Everyone from WSB has the same 3 talking points. \n\nAt least keep it on WSB. There are a lot of beginners who are trying to learn about the stock market, not risky “once in a lifetime” short squeezes.", "score": 1, "replies": [{"body": "I'm just refuting your point on GME not being as valuable as the companies you listed.", "score": 1, "replies": [{"body": "GME literally isn’t as valuable as any of the companies I listed by any metric... lmao", "score": 1, "replies": [{"body": "..as being the main reason why people are investing in this stock*", "score": 1, "replies": []}]}]}]}]}, {"body": "The value is irrelevant. Everyone understands the stock price is a result of this short squeeze situation. \n\nVW had an epic short squeeze and at the peak if was worth more than all the other car companies. This obviously wasn’t based in reality but doesn’t matter for those who got out at or near the top. That’s the dream with GME and the idea that it COULD hit $1000 before crashing down (to $200??)", "score": 0, "replies": [{"body": "You think GME should be at $200?", "score": 1, "replies": [{"body": "No of course not but I think Tesla shouldn’t be anywhere near what it is. And I’m\nNot saying GME and Tesla are even on the same planet but the market loves to be irrational", "score": 3, "replies": []}]}, {"body": "You think it could actually get to 1000? And think it could actually stabilize at 200?", "score": 1, "replies": [{"body": "No but that’s what others think which is what is driving the posts", "score": 1, "replies": [{"body": "Yeah I agree. Though the short squeeze for volks wagon had similar numbers. Like a stable value of 72 and all time high of 912 during squeeze\n\nIt’ll be a bish to get right in at the top of the squeeze tho\n\nDo you think it is definitely a squeeze and will go up some at least?", "score": 1, "replies": [{"body": "Everything that’s been prophecized in the DD over at WSB appears to be true. There appears to be over 100% shares shorted and a strong consensus to not sell. And remember even with some retrial investors selling - Ryan Cohen owns like 13% of the company? He’s not selling. Those shares aren’t going anywhere", "score": 1, "replies": [{"body": "Yeah agreed. There is strong incentive to hold or even buy right now. Is there a good way to keep up to date with massive shareholders like Ryan and see if he ends up selling so I know right aaay?\n\nLikewise is there a way to know how the short position is changing?", "score": 1, "replies": [{"body": "Just follow WSB threads is probably your best Bet. Follow Cohen on Twitter for any tweets that might send it to the moon as the kids say", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I agree. But what do you think is a reasonable price per share? Seems like 100 easy. Quite possible 150-200 from dd others", "score": 1, "replies": [{"body": "Honestly? If you value GME the same way people value TSLA then sure $150 PT makes sense. But considering the incredible amount of competition they are facing as well as the lasting effects of a global pandemic, they are $40 per share tops a year from now.", "score": 1, "replies": []}]}]}, {"body": "No you need some reverse thinking.\nyou should short GME then buy TSLA. \nPeople see GME tanking again and will rush back to TSLA.", "score": 0, "replies": []}, {"body": "Is not that the same as going to the casino and play huge amounts of money in roulette? GME may go up or down... who knows but fundamentals seem to indicate that the stock is overvalued and you may end up losing big", "score": -3, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Money chasing", "score": 1, "replies": []}]}, {"body": "The $1000 GME price target is ONLY related to the potential short-squeeze, which is possibly imminent. If you can catch the squeeze, well, it is a good investment, but there's no telling how this will play out just yet\n\nIn general, however, GME has good potential for future market growth, and I could see a price target anywhere from $60 to $120 once this short-squeeze drama either happens and then settles, or once it dilutes (if that is even possible. I'm not so sure it is possible)", "score": 1, "replies": []}]}
{"title": "$170K AMD earnings YOLO. 2/19 $100C", "selftext": "[deleted]", "id": "l3y1tx", "created_utc": 1611488973.0, "score": 371, "upvote_ratio": 0.96, "num_comments": 76, "comments": [{"body": "I just bought 100k in stocks of amd.  Wish I could gamble on calls.  I def see this pushing 100 with them reporting a monster quarter this Tuesday", "score": 35, "replies": [{"body": "Just be careful, I’ve been invested in AMD for years, a majority of the time the stock actually dips after earnings. I do believe this is an exceptional quarter though, especially considering Intels instability, so I hope it takes off.", "score": 22, "replies": [{"body": "What will push them over the limit is all the new playstations and xboxs.  Plus gamers love amd CPUs and gpus.  \n\nBut yeah, I have concerned as well and that is why I bought stocks vs calls", "score": 5, "replies": [{"body": "It’s already priced in, everyone knows this. Margins aren’t that high on Xbox’s and PlayStations but it’s consistent (plus the fact Microsoft and Sony helped with technology). CPU’s make the margin, specifically server. It will still be a good quarter and I believe they will beat earnings but AMD just doesn’t get the post earnings love. \n\nI hope I’m wrong.", "score": 3, "replies": [{"body": "AMD shot up to $95 last week, I’d wager it runs up to high 90s before earnings.", "score": 4, "replies": []}, {"body": "agreed 100%. Been following AMD for years. I've been saying this I across a few previous comments, but AMD doesn't usually increase during earnings even if they beat them. But what typically happens is two or three weeks after their stock will improve about 3-5% slowly but surely over each week. It's hard to time, so buying shares is your best bet", "score": 2, "replies": []}]}, {"body": ">gpus\n\nReally? Ryzen is highly praised but GPUs have been lagging behind Intel's offerings for a solid 2 generations now.", "score": -2, "replies": [{"body": "Intel gpus? You must be talking about nvidia.. \n\nGamers buy amd gpus because they offer a better price to value.\n\nNvidia gpus are bought by gamers that have money to burn", "score": 8, "replies": [{"body": "Yes Sorry I meant nvidia. I fail at multi tasking. \n\nI just googled and nvidia still holds at least 77% market shares in GPUs, which excludes 30 series gpu sales numbers (which to be fair are like 100 globally).", "score": 2, "replies": [{"body": "NVidia and AMD have had roughly equal sales this year. Probably comes down to limited supply but still, that 77% number includes past years. AMD’s current offering are competitive with Nvidia’s", "score": 2, "replies": []}, {"body": "Yes and I didn't need to google for information  :) so maybe accept the fact that I am more knowledge than you", "score": -1, "replies": []}]}]}]}]}, {"body": "No kidding. Did you guys see what happened to intel last week?", "score": 3, "replies": []}]}, {"body": "Ya everyone was sleeping on them so I bought more stock and some $95C monthlies when it dipped down to $87.", "score": 8, "replies": []}]}, {"body": "More like a 112K Yolo, not that I would respect that less.", "score": 58, "replies": [{"body": "Yeh I bought them a few days before last Fri at 112K. Gained in value to $170K on close.", "score": 31, "replies": [{"body": "Congrats man", "score": 10, "replies": []}]}, {"body": "He could sell ‘em now for $170k, so he’s in for $170k.", "score": 8, "replies": [{"body": "this", "score": 2, "replies": []}]}]}, {"body": "Gonna go in 50k Monday, yolo!", "score": 22, "replies": []}, {"body": "this is guaranteed.\n\nso guaranteed it doesn't feel like a yolo. \n\nboomers and shorts are gonna get slapped this week.", "score": 66, "replies": [{"body": "Fm. I was looking at the pics and didnt get how anyone could buy 100C on amc, let alone make profit. \n\nAt least I fit in", "score": 9, "replies": [{"body": "Lol 100C on amc. I'm really betting on that 3200% weekly rise", "score": 7, "replies": []}]}]}, {"body": "[AMD DD here.](https://www.reddit.com/r/wallstreetbets/comments/kxabg1/stop_sleeping_on_amd/)", "score": 31, "replies": [{"body": "No DD needed. I bet Lisa every fucking time.", "score": 34, "replies": []}]}, {"body": "God speed retard. In with 100 shares and some CSPs 😂", "score": 13, "replies": []}, {"body": "This is the wsb stuff i am missing a lot lately in this sub", "score": 11, "replies": []}, {"body": "I'll be there Tuesday partying with you!\n\nNot as big but 8 $93 1/29 c here. Got them when they were cheap during the dip.", "score": 10, "replies": [{"body": "Good call. Under $90 was such a great buying opportunity and somehow only Cramer said it", "score": 9, "replies": [{"body": "I was surprised no one was talking about it. I was selling covered calls up til this week, but stopped with the price down and earnings on the way. Right as I told my PCMR friend to buy the other day it jumped several dollars.", "score": 3, "replies": [{"body": "Ya I guess the good news for intel rotated the money around. Everyone forgot AMD is still years ahead and in most computers right now. Also balls deep in corsair because PCMR", "score": 5, "replies": []}]}]}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**AMD**|**$100**|**BUY CALL**|**2021-02-19**|**$3.62**|**$92.79**|**40350**|**11887**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckkb2xzwp519v0744wqkeoxqe) | [Track Record](https://www.pickmojo.com/user/Whiskerfield/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 13, "replies": [{"body": "Good bot.", "score": 5, "replies": []}]}, {"body": "Change your name to JPOW cos you'll be printing so hard", "score": 4, "replies": []}, {"body": "I grabbed some of these last week as well and was surprised I hadn't seen more people post about it. Seems like a pretty sure thing to me, and the price was right considering where AMD was trading at the time.", "score": 5, "replies": []}, {"body": "Feel you", "score": 5, "replies": []}, {"body": "May God Bless Us Retarded Gamers 😩🙏🏽", "score": 3, "replies": []}, {"body": "I’m in on Monday - seems like a good idea", "score": 4, "replies": []}, {"body": "I've been trying to tell people about AMD for a while. Thank you so much", "score": 4, "replies": []}, {"body": "its not robinhood so i cant read it", "score": 3, "replies": []}, {"body": "In with only 10k. Didn’t have big balls like you.", "score": 3, "replies": []}, {"body": "What’s the move for tomorrow I’m in like 20k on AMD calls", "score": 3, "replies": [{"body": "Wondering same thing. They beat estimates but not much price movement. I'm up about %15 on the calls but don't want to 🧻✋", "score": 2, "replies": []}]}, {"body": "cash out your cost basis, and put your gains on weekly FDs\n\nedit: holding $100c 3/19", "score": 6, "replies": [{"body": "This is the way.. but my fav way to make the same play is a little closer to the money, an extra week out. \n\nThat being said... 🚀 🚀 🚀", "score": 2, "replies": []}, {"body": "FDs?", "score": 0, "replies": []}]}, {"body": "100 shares and 1 1/21/2022 95c", "score": 2, "replies": []}, {"body": "Any worry about the Algos and Darkpool sell-off divergence on Friday?\n\nhttps://i.imgur.com/WGlkowM.png", "score": 2, "replies": []}, {"body": "i saw Lisa in blue dress is buy.", "score": 2, "replies": []}, {"body": "When on Tuesday are earnings going to be released so you know?", "score": 2, "replies": [{"body": "After market close", "score": 1, "replies": []}]}, {"body": "I’m holding 100 calls as well, might load up on more. See my [DD](https://www.reddit.com/r/investing/comments/l0hxe5/amd_undervalued_at_90/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) as well. If this prints I’ll send you a crate of beer buddy😉", "score": 2, "replies": []}, {"body": "This will print.", "score": 2, "replies": []}, {"body": "Makes me feel better about my 4 shares coming into this week (not that I was worried).", "score": 2, "replies": []}, {"body": "Damn.... are you holding?", "score": 2, "replies": []}, {"body": "Fuck we are dying", "score": 2, "replies": []}, {"body": "I hate to see AMD getting good while there is a war with GME. I don’t have enough money for everything.", "score": 4, "replies": [{"body": "Same here, but I'm not touching anything I have in AMD.", "score": 3, "replies": []}]}, {"body": "I bailed on this after watching intel get takin apart. Crsr has a better chance and more runway.", "score": 1, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/Whiskerfield the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "Running a small 95/100 debit spread ☺️", "score": 0, "replies": []}, {"body": "Sell it and buy more GME.", "score": -5, "replies": []}, {"body": "Team red 💎🖐babyy\n\nNow buy GME", "score": -2, "replies": []}, {"body": "Hush please", "score": 1, "replies": []}, {"body": "I loaded up on more shares when she dipped below 90. I feel like this is F 2 weeks ago when it dipped below 9 then rocketed to 11.50", "score": 1, "replies": []}, {"body": "Serious question, do you think we should be watching Xilinx earnings on Monday carefully? How do you think Xilinx news will affect amd earnings this time?", "score": 1, "replies": [{"body": "Their earnings won’t matter much, the stock is pinned to AMD’s, it has no basis on Xilinx.\n\nIn theory a good Earnings is good for AMD but that’s going to be overshadowed by how 🔥AMDs earnings will be.", "score": 2, "replies": [{"body": "Is Xilinx earnings incorporated into amd earnings since acquired?", "score": 1, "replies": [{"body": "Actually yeah. That’s what happened last time around", "score": 1, "replies": []}]}]}]}, {"body": "Mama sue will bless us with tendies.  But don’t forget to diversify to TSM.", "score": 1, "replies": []}, {"body": "I have 94c 2/19 but I’ll probably sell before earnings because I’m a profit taker... I have a 100% win rate on the year, maybe I don’t belong in wsb", "score": 1, "replies": []}, {"body": "ALMOST THAT TIME LETS GOOOOOO $AMD", "score": 1, "replies": []}, {"body": "😢", "score": 1, "replies": []}, {"body": "I am also in pain on and AMD call of $95 on 1/29. Also a $97 call ending on 2/12, let’s see the yolo come through!", "score": 1, "replies": []}]}
