{"title": "The Art of the DD: For Beginners", "selftext": "WSB was full of the best people - simply the greatest people, anyone will tell you that, we used to be the best.  But after an influx of unvetted new users, we've fallen into disrepair.  Due to a recent margin call after a sequence of poor trades, our sub can no longer afford to ban all Canadians or build a wall.  However, fear not - I believe that we can solve this crisis with a little bit of education.  It's time to make this sub great again.  \n\n**Chapter 1:** \n\n*“What the fuck does ‘justify your trades’ mean?”*\n\nIt’s a question that anyone here who posts on /r/investing will sprint back asking in a matter of nanoseconds.  “Why do I have to give reasons?  Why can’t we all just fly by the giant throbbing dick in my pants?”  \n\nWhen normal people gamble their money, they like to limit the risk involved, and draw a basis for their expectations of potential gain or loss.  Due to this, investors have invented the DD – a versatile tool that both acts as a high-quality plastic upgrade for their wives, and an excellent way to convince others to follow or allow (if they’re an institutional investor) their trades.  \n\n**A Due Diligence is about like a high school book report, but on a stock.** It involves some basic preliminary research – most of which can be done with websites not dissimilar to CliffNotes.  After choosing a stock, you can pretty much go get condensed data from some website that actually bothered to read the SEC filings and calculate the basic TA algorithms.   These are what you will stich and glue together to make your very first DD collage.    \n\n**Chapter 2:**\n\n*“How do I not be retarded?”*\n\nThis chapter will be my extremely over-simplified, probably-inadequate answer to that question. \nFirst and foremost, I believe that there are four key elements to any good trade, listed here in order of importance (top to bottom) and implied penis length when used to justify your trade (bottom to top): \n\n* 1.  Climate\n* 2.  Fundamentals\n* 3.  Technicals\n* 4.  Story\n\n**1: Climate (The Obvious Shit)**\n\nLet’s start from the top. \nFirst and foremost, you’re going to want to look at the climate that surrounds the stock.  This is crucial for short term trades – if the market is in the middle of a slide, correction, or crash, it’s probably best to wait and get in at a later date.  If the market sector is facing significant challenges (i.e. oil with rapidly expanding production and growing inventory) that are likely to weigh on the sector’s stocks, it’s probably a good time to wait or move sideways.  If all is well and good – or if the market is experiencing a surge – perhaps a more aggressive than usual stance can be taken, due to a theoretically lower risk.\n\n**2: Fundamentals (Aka /r/investing)**\n\nNext, you want to look at the fundamentals of your stock.  Even for the autistic orangutans here in WSB, this is pretty damn easy – but it’s usually missing from DD posts anyways, so let’s break out the crayons.  Yahoo Finance has pretty much all the information you could want under its Statistics and Financials tabs.  Advanced autists can also search for 10-k’s, 10-q’s, 8-k’s, and, well, literally every type of SEC filing, with SEC.gov’s edgar search tool.  Using this data to predict future cash flows, you can come up with a valuation for a company’s stock price.  Or you can just look up analyst estimates and hope for the best.\n\n**How To Use Fundamentals in WSB:**\n\nFundamentals are not the essence of a good trade – the market is inefficient, irrational, and rarely ever trades shares at a fair market value.  You will rarely, if ever, buy a yacht with gains from fundamental analysis.  **However,** (this is the important part) **a stock’s price will trend towards its ever-changing fair market valuation over time.**  This makes fundamentals very useful as a safety net or a measure of risk for short term trades.  For example, someone who’s betting on a binary event to cause share value to go up is taking on less risk if the fundamentals suggest the price should continue moving upwards over time (whereas if fundamentals suggest the stock is overvalued, the trader will be completely reliant on the outcome of the binary to make a profit).  They’re there, they’re useful, so use them.  \n\n**3: Technicals**\n\nIf the climate is appropriate and the fundamentals are comfortable, you’re in the clear to make an investment.  However, we’re not investors here.  Traders operate on a much shorter timeframe, which I could yap on about but I’m sure you’ve all already stopped reading at this point.  \nAfter using the market climate and fundamental analysis to predict long-term price trends, a trader should investigate the technicals.  Technicals are the key to predicting short term movement.  Where should we start?  If you’re actually still here reading and taking this seriously, and don’t know the basics already, do yourself a favor and go binge-read Investopedia like it’s your favorite type of porn.  Go educate yourself on SMA’s, EMA’s, RSI, Stochastic Oscillators, MACD, Bollinger Bands (use responsibly), candlestick charting and patterns, Fibonacci Retracements, and anything else you can find.  Learn how to calculate them, and what they mean.  Then, find a website or write a program to do the math for you (but again, make sure you know what factors they consider and what they mean, otherwise you’re probably just going to fuck yourself over by using them improperly).  \n\n**How to use Technicals in WSB:**\n\nIs the stock trending up or down?  Is that trend likely to continue?  How strong is the current price?  Is the stock overbought or oversold?  Etc etc.  Technicals are the key to timing your entries and exits.  Using them properly will make you a more successful trader, and referencing them in a DD will make your e-peen bigger when you post to WSB.  \n\n**4: Story (In Brief)**\n\nFinally, we arrive at what’s probably the most inexplicable item – and rightly so – the story.  This gets real self-explanatory real quick: What the hell is making TSLA shoot up every time I sell it?  It’s not the climate – auto makers are getting slaughtered.  It’s sure as hell not the fundamentals – these guys aren’t making a profit, and their future cash flow is difficult to estimate.  Technicals have no bearing here.  But what does?  Elon does, mother(musker?)fucker.  The market is retarded and irrational enough that we can’t put a price on a Horatio-Algers story and some batteries.\n\n**Chapter 3:**  \n\n*”That was long as fuck and I hate you for it”*\n\nIndeed.  \n\n**TL;DR:**\n\nIf you’re going to make a DD post, actually do your due diligence. Tell us: \n\n* About the market sector\n* About the company’s performance\n* About the stock’s performance\n* About the retarded delusions you have of where this company will go in the future\n\nUse resources like: \n\n* [Yahoo Finance]( https://finance.yahoo.com/quote/WCN/key-statistics?p=WCN) and its many tabs\n* [sec.gov’s Edgar Search]( https://www.sec.gov/edgar/searchedgar/companysearch.html)\n* [StockTA.com]( http://www.stockta.com/)\n* [MarketWatch]( http://www.marketwatch.com/)\n* [SimplyWall.St](https://simplywall.st/) (for those of you who don’t like research)\n* [Investopedia](http://www.investopedia.com/) if you actually want to be a decent investor and know your shit\n* [Pornhub’s vast collection of investor materials](https://www.google.com/search?q=pornhub+cuckold&ie=utf-8&oe=utf-8) (NSFW)\n* Literally anything besides your gut feeling or a shitty meme\n\nEdit: and as per /u/spawrks comment, give us proof of your fucking trade.  \n\nI hope that, with effort, we at WSB can come together once more.  We can revive our legacy - relive the glory days of rainbow dicks and real-life meetups that inevitably ended in massive homosexual orgies.  But we will have to work together to reach that goal.  It's time to make WSB great again.\n", "id": "6j6gri", "created_utc": 1498281326.0, "score": 2320, "upvote_ratio": 0.96, "num_comments": 217, "comments": [{"body": "I sticky this thread from time to time to highlight two things:\n\n1. Even 4 years ago people were complaining about an influx of new users. It is a tale as old as time.\n\n2. We have a huge number of DD threads, but they get buried. ***It is up to you to upvote high effort threads to give them the attention they deserve***.\n\nYou can find DD here (won't work on the official Reddit app): https://old.reddit.com/r/wallstreetbets/search/?q=flair%3ADD\n\nHere are some from the past 3 days:\n\n1. https://old.reddit.com/r/wallstreetbets/comments/tzhxt7/dd_financial_services_and_how_sofi_fits_in/\n\n2. https://old.reddit.com/r/wallstreetbets/comments/tzsleq/i_analyzed_2000_stock_splits_over_the_last_3/\n\n3. https://old.reddit.com/r/wallstreetbets/comments/u26d5z/where_one_falls_another_rises_dwac_to_the_future/", "score": 1, "replies": [{"body": "Tbf this could be a useful resource for all the Retards coming in to make a quick buck with GME saga.", "score": 2, "replies": []}, {"body": "Which app will work with your flair filter link?", "score": 1, "replies": [{"body": "Desktop, mobile browser, or any third party app should work. I use rif!", "score": 2, "replies": []}]}]}, {"body": "Doing the Lords work", "score": 275, "replies": [{"body": "There are no gods in WSB", "score": 28, "replies": []}, {"body": "Hello from the past! It’s the future!", "score": 8, "replies": [{"body": "actually, no. You're the present, written form. \n\nThe Past wrote it and posted it. \n\nSomeone in the future will read it, in the present.", "score": 11, "replies": [{"body": "Yes yes, but will then...be now?", "score": 1, "replies": [{"body": "Or....  now?", "score": 1, "replies": [{"body": "it was.", "score": 1, "replies": []}]}]}]}]}, {"body": "OP was the valedictorian of WSB class 21", "score": 3, "replies": []}]}, {"body": "wow finally a post that is not garbage. been a while. thanks OP", "score": 217, "replies": [{"body": "First bit of DD I started to read.", "score": 5, "replies": []}, {"body": "except that one line\n\n>How do I not be retarded?\n\n\\*How do I be more retarded\n\n![img](emote|t5_2th52|8883)\n\nFTFY", "score": 3, "replies": []}, {"body": "Hello from the future, Mr. Fuckboy Defender. How's your portfolio doing?", "score": 3, "replies": []}]}, {"body": "> *3: Technicals*\n\nBe aware that anyone with an actual education in stats and probability will laugh their ass off when you post about \"technicals\".  This stuff is right up there with astrology and chicken entrails.\n\n", "score": 79, "replies": [{"body": "With the abundance of 'technicals traders,' many technical indicators become self-fulfilling prophecies, as so many people trade based solely on them. ", "score": 31, "replies": [{"body": "I would argue that technicals can be pretty useful when there aren't any catalysts to change the company's perceived value.  But I'm also retarded.  ", "score": 25, "replies": []}, {"body": "Great!  Show us the stats.", "score": 10, "replies": []}, {"body": "This is called the greater fool thesis. I'm buying this because some other idiot will want it more in the future. TA lets you pretend that you are  smarter than the other guy, but in the end of you are relying on greater fools (who are slower at reading chicken entrails or something).\n\nMy point is that if the herd mentality of TA actually forced it to be true, then TA is already priced in because everyone is looking at the same data. There is therefore no edge (and a computer would be better at this anyways), so TA is just guessing.\n\nThe way around this argument is always, those fools are doing it wrong. But if they are doing it wrong then your method isn't a self fulfilling prophecy because they are doing it differently, so your method won't predict their behavior. You still end up back at guessing.", "score": 8, "replies": [{"body": "Look at the big wrinkles on Brad, here.", "score": 1, "replies": []}]}]}, {"body": "My understanding was that technicals show human emotion and human behaviour. Since stocks are all trading completely irrationally (see: TSLA, et al) and fundamentals are absolutely and completely out the window, technical analysis works because you are looking at human emotion when it comes to trading. But yes, it might also be a self self-fulfilling prophecy.\n\nAt least that's what I heard somewhere.\n\nIn any case, it has ZERO to do with statistics. That's what option selling, the tasty trade method, black scholes model, and all that shit is about. Those guys absolutely _do not_ use technical analysis (or fundamental analysis.) They use pure statistical probabilities when it comes to trading. Using that edge to your advantage, and raking in the $$ slowly over time.", "score": 7, "replies": [{"body": "> In any case, it has ZERO to do with statistics. \n\nStatistics is how you evaluate the success of the theory you proposed.\nAnd EVERY statistical test of technicals has failed.\n\nBut please, don't let actual mathematics get in the way of the upside-down head-and-shoulders frobulator indicator to buy or sell.", "score": 16, "replies": []}, {"body": "Bro...Black-Scholes is technical analysis. It's TA that is useful and meaningful and requires statistics, but it's TA. The fact that I've never seen a TA post that used Black-Scholes tells me that you guys just like drawing colored lines on graphs and don't really care about making money.", "score": -2, "replies": [{"body": "Dude I've never seen anything more retarded than this. Not that I agree with \"diskiller\" but the very basis of the BSM stems back down to the Brownian Motion and that implies that historical stock price do not matter when it comes to pricing options.\n\nAnd yea, the BSM is used to price options not for your shitty technical analysis.", "score": 0, "replies": [{"body": "First of all, I'm not in favor of technical analysis. My point is that TA idiots don't even understand the statistics behind their magic.\n\nWhile BSM is a theoretical model, in practice the volatility and trend that are used for the Brownian motion come from the stocks historical behavior. You can of course pick whatever volatility and trend you'd like and then run BSM (and then come up with whatever answer you like, making the model useless for predicting option price if you really want to get nitty-gritty ), but that's not really how it's used. \n\nMost models that use BSM use volatility and trend based on some historical period of the stocks behavior. One of the stated assumptions of BSM is that volatility is random and is essentially a number (there is some set amount of volatility). You then get that number from the stock's historical behavior. If you are using historical prices to predict future behavior, you are by definition doing TA.\n\nYou don't have to take my word for it. Buffet has been saying this for decades and the academic research on BSM specifically refers to it as a type of technical analysis: \n\nhttps://youtu.be/Fd4lfVNJljk", "score": 1, "replies": []}]}]}]}, {"body": "Shhh, if enough people believe it, it might actually work... Like Santa, or the tooth fairy.", "score": 15, "replies": [{"body": "That's actually how the market works.", "score": 5, "replies": []}]}, {"body": "I saw the word fibonacci in there and immediately knew it was bullshit", "score": 7, "replies": [{"body": "fibonacci extensions and retracements are a thing. I don't use it, but yeah, it's actually a thing and supposedly isn't bullshit.", "score": 4, "replies": []}]}, {"body": "Ya", "score": 3, "replies": []}, {"body": "if TA is so right, then i shd be able to trade solely on TA and be fcking rich , however, that's not been my experience, so i say need to trade on TA and fundamental analysis and other stuff like magic 8 ball \n\nNFA im retarded and i eat crayons", "score": 1, "replies": []}, {"body": "I guess you've never heard of Jim Simmons", "score": -1, "replies": []}, {"body": "So you just going to blindly buy a stock and not look at a chart at all? Technicals are stats; fib retracements, standard deviations, pivot points etc. Buy side and sell side alike use charts everyday in their strategy.\n\nI agree It won’t predict where price is going but it’ll help you determine the risk:reward on a trade; when to take profit, when to cut loss. Technicals are literally a thermometer for the sentiment on an asset.\n\nGood luck pinning the tail on the donkey otherwise.", "score": 1, "replies": [{"body": ">I agree It won’t predict where price is going\n\nAnd that's the key point: Technical analysis has no predictive ability.\n\n>but it’ll help you determine the risk:reward on a trade; when to take profit, when to cut loss.\n\nThe end of your sentence disagrees with the beginning of your sentence.", "score": 1, "replies": [{"body": "Misspoke on \"when to take profit, when to cut loss\".-->\n\nMore like \"where to put a profit limit order\" \" Where to put a stop loss order\" usually using a form of moving average or std. fib ret. \n\nI feel like we're in an agree to disagree situation. But I have had some relative success (and failure) using techs. It's a decent risk management tool rather than predicting tool. Even for long term buy and hold on stocks you're in from fundamental analysis it's decent to have a trailing stop on the 50dma or 200dma. That's not dogmatic at all but just using techs as an RM tool.\n\nEnjoy the weekend my dude", "score": 1, "replies": []}]}]}]}, {"body": "Can we just go to r/tittydrop for some DD?  It's easier and more fun to look at....", "score": 95, "replies": [{"body": "i needed some new material", "score": 15, "replies": []}, {"body": "I just got side tracked for 20 mins. What were we talking about again?", "score": 12, "replies": []}, {"body": "Will this sub ruin my life? Maybe!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 39, "replies": [{"body": "when its started busting your balls and hasn't stopped yet", "score": 10, "replies": []}, {"body": "plus, its probably better to sell the market in that case.", "score": 2, "replies": []}]}, {"body": "since you already know what to do, you should just do all the DD. ", "score": 17, "replies": []}, {"body": "I will now copy, paste, and send this to my friends (and family duh) who ask me about stocks. Thank you", "score": 30, "replies": [{"body": "Make sure to leave the porn hub link in there", "score": 55, "replies": [{"body": "It's very important ", "score": 28, "replies": [{"body": "For the kenjataimu", "score": 5, "replies": []}]}]}]}, {"body": "Let me check my list, \n\nGot YouTube open watching Live Trading by TraderTV live, watch them make trades, watch people in the chat there say some stock is moving up, check said stock, verify its flying upward, hurry and invest 5k dollars in calls in a company you know nothing about and never heard of before, wait 60 seconds , sell the calls, rake in hundreds of dollars, call it a day, go out for pizza.  Oh and wish I had the Russian chick on there as my wife. \n\nLife seems to simple :D", "score": 15, "replies": [{"body": "Jesus, talk about a necro post.", "score": 12, "replies": [{"body": "LOL I didnt even pay attention to how long ago this was. It was near the beginning of all the other posts.  Maybe someone else posted in here before I did and it brought the post to the top? I dunno if that is how it works.  Had i seen this was 5 years old, I would have never posted.", "score": 5, "replies": [{"body": "No worries man lol, I'm glad something I wrote when I was 19 has had such longevity.", "score": 12, "replies": [{"body": "If you wrote that when you were 19 , I am 49 and I have to say I am impressed. Most people of that age (19 ) go around clueless about life. It looks like you were already full of some sense.  Wish you the best of luck in your life.", "score": 11, "replies": [{"body": "Lol sometimes I feel like I was smarter at 19 than I am now at 24. Thanks for the encouragement, it was nice to hear that today.", "score": 10, "replies": [{"body": "Ah shit, you were 19? And you're now 24? My self-loathing is strong.", "score": 5, "replies": [{"body": "dont worry I just got a notice that my account is overdrawn", "score": 6, "replies": []}]}]}]}]}]}, {"body": "![img](emote|t5_2th52|8881)", "score": 2, "replies": []}]}, {"body": "Agreed. It's a smart show and a smart chat.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 29, "replies": []}, {"body": ">Advanced autists can also search for 10-k’s, 10-q’s, 8-k’s\n\nThat's basically Martin.", "score": 13, "replies": []}, {"body": "Also www.finviz.com", "score": 15, "replies": []}, {"body": "Quality post, maybe with more of these, and the indiscriminate banning or removing of shit quality submissions, this sub could be great.\n\nTime will tell, but without this it never will be, gj.", "score": 12, "replies": []}, {"body": "Can we get this stickied, gilded or whatever?", "score": 11, "replies": [{"body": "I just want flair thanks ", "score": 16, "replies": [{"body": "Quick, someone get this man a flair!\n\n\n\n\n\n\n(For real though, quality post)", "score": 7, "replies": []}]}]}, {"body": "Nice work faggot", "score": 8, "replies": []}, {"body": "The people who screech and post random stuff with zero DD are the same ones wont wont read the post because its too long", "score": 7, "replies": []}, {"body": "make WSB great again", "score": 9, "replies": []}, {"body": "Regarding #2 ... Websites that claim to intelligently predict future cash flows and other metrics are sometimes way off the mark. Case in point, when $CAT announced EPS of $1.28 versus the street expecting 62 cents! WTF!", "score": 9, "replies": [{"body": "> Websites that claim to intelligently predict future cash flows and other metrics are sometimes way off the mark.\n\nTo be of much use at all, they should show how they do their calculations, so that the reader can form an opinion about how reasonable it is. Do they not do that?", "score": 3, "replies": [{"body": "I find estimize can usually give a good enough picture of what is expected. But of course there is often a huge difference between what is expected and what actually happens.", "score": 2, "replies": []}]}]}, {"body": "Would it make sense to add a few mandatory forms for Analysis posts, incorporating some of the headings above? Might scare off a selection of the pumpers. Or maybe create a separate DD submission process with said forms? With that in place, I think it would be easier to spot well intended content from half-assed fuckery. There is however a statistical probability I am completely wrong.", "score": 6, "replies": []}, {"body": "TLDR; just tell me which ones to buy thanks", "score": 6, "replies": [{"body": "did you buy CVNA BA SHOP and WCN?", "score": 4, "replies": []}, {"body": "CVNA \nBA \nSHOP \nWCN", "score": 5, "replies": [{"body": "But why?", "score": 3, "replies": []}]}]}, {"body": "Good post, but sounds like a lot of \"work\" bullshit tbh. I'll continue to follow my flaccid dong towards the land of red, thank you very much.", "score": 21, "replies": []}, {"body": "so how do i make mony", "score": 20, "replies": [{"body": "RAD", "score": 4, "replies": []}]}, {"body": "This should be stickied", "score": 4, "replies": []}, {"body": "Im gonna sue you if this kind of quality post ends up hurting my inverse wsb account.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I never understood this rule. It's so easy to photoshop a screenshot... these \"proofs\" aren't shit.", "score": 3, "replies": []}]}, {"body": "I stopped looking beyond the daily comment thread almost a year ago, except to look at the insightful seasons of Chad Money. I can't be the only one.", "score": 5, "replies": [{"body": "I think that's part of the challenge, there's plenty of good stuff out there, it's just not getting upvoted enough.", "score": 5, "replies": [{"body": "I remember some great DDs here and they were widely viewed by market makers, too. But after the GME and AMC cash-in, all of that disappeared or was totally wrong.\n\nI read the daily comments for news. It would be nice to see useful DDs again.", "score": 9, "replies": []}, {"body": "Bring back no memes on market days.", "score": 5, "replies": []}, {"body": "filtering by DD shows a dozen or so posts today with like 10 upvotes lol, completely forgot that filter existed since I tend to use phone for reddit. Could be more but still, if those posts got more attention it would certainly help...", "score": 1, "replies": []}]}]}, {"body": "Thank god for this pin.", "score": 6, "replies": []}, {"body": "4y old back from the depths", "score": 5, "replies": []}, {"body": "Ban all Canadians? Ban all Canadians??? That ain't right ![img](emote|t5_2th52|8883)", "score": 5, "replies": [{"body": "Build the wall bby", "score": 3, "replies": []}]}, {"body": "Will this get me a job at the Goldman Sachs? I want a job at the Goldman Sachs ", "score": 17, "replies": [{"body": "Gross. Kys", "score": 5, "replies": []}]}, {"body": "Order of importance vs. justifying your trade is the same list in reverse. I love it!", "score": 4, "replies": []}, {"body": "Fundamentals:\n\ntrade with the broad market, IOW w/the curve. There are 4 conditions: bull flattener, bull steepener, bear flattener, bear steepener as well as QE on/off will alter the behavior of conditions.  Understand risk, and I don't mean how much you're wagering.  Risk on/off, skew, TED & quality spreads.\n\nYour stock might look really good but if you're a day trader and not a buy and hold Vanguard investor your stock pick is not going to go up on risk off and your short is going to get smoked in risk on unless the company does something retarded like drag a fool off an airplane or Amazon just bought your competitor.  That shit is unpredictable. \n\nYields drive everything. The options market is an insurance market and is your go to for pricing risk and seeing where large players are hedged. \n\nTesla is going up because the market is pricing in the end of oil in a decade and they're positioned to be the dominant player in the future, like Amazon is positioned to be the fucking singularity. ", "score": 4, "replies": [{"body": ">  Risk on/off, skew, TED & quality spreads.\n\nRessource for this ?", "score": 2, "replies": [{"body": "Not sure what's available for free, if anything. The TED is 3mo libor spread but you can use the 2's close enough. quality spreads are ratios of something like jnk or hyg over the notes.  SKEW is CBOE and can be found free on investing.com which uses tradingview charts.\n\nTradingview has paid version with a bunch of feeds and spread/ratio charting capabilities.  Most charting packages will have that but not all the feeds included.  TV has some live, some delayed 10 min if you don't have a CQG feed waiver.  \n\nI spend several hundred a month on data and charting, use a mish mash of different shit, not as good as a terminal but close enough.", "score": 2, "replies": [{"body": "Thanks! And what about resources on how to interpret these indicators? Would also be interested in some good option strategy (advanced) tutorials / articles / books if you  happen to know some good ones. ", "score": 1, "replies": [{"body": "TED and quality spreads are risk measures, so TED up is negative equities/risk off and down positive equities and risk on. So negative correlation to risk.\n\nEquities and TED move up together in FED QE on type situations when there is easing in the mkt or like after last FOMC was interpreted dovish.\n\nQuality spread is higher risk over 10 year bond which is just because it's the pivot and direct/positive correlation to risk.\n\nSKEW is pricing of risk, referred to as risk premium. >135 generally considered high w/risk in market but generally you're looking at end of day and comparing vs. previous.  So say market goes up and risk pricing goes down then the move can be considered supported.  \n\nOptions market is insurance so institutions do not play it directionally, at least on the futures and indexes. So OTM volume spikes are hedged levels they'll deal underlying opposite to.  Higher PC ratio is bullish but if it spikes at highs then is long only funds locking in profits and bearish.  But generally higher puts = bullish.\n\n ", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Can I get a TL;DR?", "score": 8, "replies": [{"body": "You gotta eat big to get big.", "score": 15, "replies": []}, {"body": "If you’re going to make a DD post, actually do your due diligence. Tell us:\n\n* About the market sector\n* About the company’s performance\n* About the stock’s performance\n* About the retarded delusions you have of where this company will go in the future\n", "score": 20, "replies": []}, {"body": "Buy RAD", "score": 13, "replies": []}]}, {"body": "Hear, hear!", "score": 3, "replies": []}, {"body": ".", "score": 3, "replies": [{"body": "..", "score": 2, "replies": [{"body": "Fuck you <3", "score": 3, "replies": []}]}]}, {"body": "[removed]", "score": 3, "replies": []}, {"body": "This is one of the better posts i have read here lately. And it's four years old", "score": 3, "replies": [{"body": "Frankly I stopped coming around this place after the GME fiasco. Guess someone is trying to bring it back, I hope for the best", "score": 3, "replies": []}]}, {"body": "I guess WSB was more accepting of TA 4 years ago. These days, it gets shitted on.", "score": 3, "replies": []}, {"body": ">Advanced autists can also search for 10-k’s, 10-q’s, 8-k’s, and, well, literally every type of SEC filing, with SEC.gov’s edgar search tool. Using this data to predict future cash flows, you can come up with a valuation for a company’s stock price.\n\nWho tf trades without even reading SEC filings lmao that is like step numero uno ", "score": 7, "replies": []}, {"body": "![img](emote|t5_2th52|4735)![img](emote|t5_2th52|4735)![img](emote|t5_2th52|4886)![img](emote|t5_2th52|4640)![img](emote|t5_2th52|4640)![img](emote|t5_2th52|4886)![img](emote|t5_2th52|4640)![img](emote|t5_2th52|4641)![img](emote|t5_2th52|4887)![img](emote|t5_2th52|4641)![img](emote|t5_2th52|4641)![img](emote|t5_2th52|4641)![img](emote|t5_2th52|9479)![img](emote|t5_2th52|4640)![img](emote|t5_2th52|4886)![img](emote|t5_2th52|4259)![img](emote|t5_2th52|4258)", "score": 2, "replies": []}, {"body": "Just a heads up for put holders like myself. April is historically a very bullish month. Fund managers might be looking to continued that as we approach the second half of the month", "score": 2, "replies": []}, {"body": "Dow futures +100 should see +250 in an hour", "score": 2, "replies": []}, {"body": ">But after an influx of unvetted new users, we've fallen into disrepair\n\nI feel attacked", "score": 2, "replies": [{"body": "Also it's funny to realize that people 5 years ago were complaining about new users ruining WSB", "score": 4, "replies": []}]}, {"body": "Time for a thread resurrection!", "score": 2, "replies": []}, {"body": "Sir, you imply that we fly by the giant throbbing dick in our pants, and I can tell you that you're clearly wrong. We're flying by the microscopic throbbing dick in our pants.", "score": 2, "replies": []}, {"body": "This is just a smokescreen to keep the ret4rds (you) buying options and thinking you actually know what you’re doing. Thanks OP, needed fresh meat.", "score": 2, "replies": []}, {"body": "Nice, this is far from the first wave of new people, thanks for pinning this post again", "score": 2, "replies": []}, {"body": "Back to the old ways", "score": 2, "replies": []}, {"body": "I have being here over one year and this article is most f’ckin brilliant I have ever read it. Thanks my lord", "score": 2, "replies": []}, {"body": "But wen rich?", "score": 2, "replies": []}, {"body": "ty if I'm not too lazy I'm gonna try to write a DD this weekend instead of sucking my bf's dick", "score": 2, "replies": []}, {"body": "Shit is still relevant haha", "score": 2, "replies": []}, {"body": "I get all my DD in the first 15 minutes of waking up reading the daily discussion whilst taking a dump", "score": 2, "replies": []}, {"body": "Did you seriously just use 'DD' and 'TA' in the same ~~paragraph~~ Universe?", "score": 2, "replies": []}, {"body": "But did u/loveCars get their flair?", "score": 2, "replies": [{"body": "no :(", "score": 1, "replies": []}]}, {"body": "I love how abrasive this post is. I was chuckling the whole way through reading it.", "score": 2, "replies": []}, {"body": "Hopefully this helps keep the <insert RAD here> to the moon faggotry to a minimum", "score": 2, "replies": [{"body": "hope this helps everyone buy RAD", "score": 1, "replies": []}]}, {"body": "I didnt read this 4 years ago and Im certainly not going to read it now", "score": 5, "replies": [{"body": "It's important to be consistent", "score": 5, "replies": []}]}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Spell it with me, S-t-o-c-k-t-w-a-t-s! Now try it again.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Spell it with me, S-t-o-c-k-t-w-a-t-s! Now try it again.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Spell it with me, S-t-o-c-k-t-w-a-t-s! Now try it again.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Any advice for someone that wants to learn as much as possible as efficiently as possible?", "score": 1, "replies": [{"body": "yeah", "score": 2, "replies": [{"body": "I mean, investopedia has a lot of shit. What should I read?", "score": 1, "replies": [{"body": "That depends on what you know now. Google is your friend. Just include the word beginner or something similar and you should find some good links. The hardest part is starting, so just dive in and start reading as much as possible. You'll inevitably start to carve out the lanes you'll need to go down to learn what you don't know.\n\nhttp://www.investopedia.com/university/beginner/ \n\nhttp://www.investopedia.com/university/stocks/", "score": 1, "replies": [{"body": "I may have spent 4 hours on this last night.", "score": 2, "replies": [{"body": "haha good shit. It'll take a good deal of time to wrap your head around it all, but if you just focus on little chunks at a time you'll be surprised how fast you progress. Also, I feel obligated to add that you shouldn't  take r/wallstreetbets too seriously. It's more of a satirical subreddit with rarely useful advice haha. Also, don't trade penny stocks. You will lose in the long run. Good luck!", "score": 1, "replies": []}]}]}]}]}, {"body": "Don't put all your money in your brokerage account when you first start trading.  \n\n", "score": 1, "replies": [{"body": "I inherited securities. I'm only trading the inheritance.", "score": 1, "replies": []}]}]}, {"body": "Thanks op", "score": 1, "replies": []}, {"body": "Awesome post OP.", "score": 1, "replies": []}, {"body": "That sounds like investing, not betting...", "score": 1, "replies": []}, {"body": "Thank you", "score": 1, "replies": []}, {"body": "Speculators hate him! ", "score": 1, "replies": []}, {"body": "This is a shitty attempt at a shitpost.  You must be new here, maybe hang around and see what other shit gets thrown around before offering *actual* advice.", "score": -1, "replies": []}, {"body": "I stopped at fundamentals when I realized that OP is a retard .....fundamentals lol", "score": 0, "replies": []}, {"body": "Literally the exact opposite of DD and 💩 advice for real investment", "score": -1, "replies": []}, {"body": "Pretty funny seeing this. Mods mass ban anyone mentioning GME last year. Now the intelligent discussions happen at the super sub while this place is flooded with dumb memes and 30 people talking shit to each other in the daily thread.\n\nYall don't have 11 million users. Get over it.", "score": -1, "replies": []}, {"body": "Not huge on how Reddit works, is there a way to need to be invited to this sub? Can a sub be made private? ", "score": -8, "replies": [{"body": "[deleted]", "score": 21, "replies": []}]}, {"body": "Holy fuck that is a long tldr can i get a tldr for that tldr??", "score": 1, "replies": []}, {"body": "Where is the chapter on goldfish care?", "score": 1, "replies": []}, {"body": "So can I have my lambo now?\n\nJk I fucking bookmarked this post", "score": 1, "replies": []}, {"body": "this is a casino", "score": 1, "replies": []}, {"body": "You forgot to mention the market is irrationally idiotic currently and fundamentals are almost useless", "score": 1, "replies": []}, {"body": "![gif](emote|free_emotes_pack|poop)", "score": 1, "replies": []}, {"body": "Nice", "score": 1, "replies": []}, {"body": "!positions", "score": 1, "replies": []}, {"body": "Noice", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4263) I left right before the Homosexual Orgies. Probably should of stayed, that must of been where they gave the real stuff out. I am not filthy rich 4 years later, I'm just gambling still today only difference is now I know why I need this emoji. ![img](emote|t5_2th52|4276)", "score": 1, "replies": []}, {"body": "Somebody buy this man a beer. Well done, OP 👏", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4258)", "score": 1, "replies": []}, {"body": "Now this is awesome 👌 👏", "score": 1, "replies": []}, {"body": "Too many words. Got a pictorial?", "score": 1, "replies": []}, {"body": "OP, why are you here among us degenerates?", "score": 1, "replies": []}, {"body": "but i like my retardedness", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "There are too many noobs like me who\ndon't understand that they don't understand", "score": 1, "replies": []}, {"body": "Dis whole time i thought dd meant deep dive", "score": 1, "replies": []}, {"body": "I'm just going to wait for the next gecko or fish after that ACI guy's bullish, pre-ER analysis.", "score": 1, "replies": []}, {"body": ":O\n\nI think its neat to have 'dont be an asshat 101' pinned up here", "score": 1, "replies": []}, {"body": "Commenting for later when I’m not as stoned. Thanks OP.", "score": 1, "replies": []}, {"body": "THANK YOU. The new additions in this sub think that this is a financial meme page exclusively but it’s more than that. I want to see loss porn, gain porn, retarded YOLOs but I also want to see some good DD in here which has been the main casualty lately thank to the memes", "score": 1, "replies": []}, {"body": "I skimmed this and didn't see anything to explain what to do when a crayon is stuck in your nose.", "score": 1, "replies": []}, {"body": "You had me at homosexual orgies, this sub has been real flaccid lately", "score": 1, "replies": []}, {"body": "If you can add daily volumes as a nice cherry on top", "score": 1, "replies": []}, {"body": "I should be a chartered financial analyst after reading this.", "score": 1, "replies": []}, {"body": "All in.  What are we doing again?", "score": 1, "replies": []}, {"body": "Amen", "score": 1, "replies": []}, {"body": "Mad DD👍", "score": 1, "replies": []}, {"body": "👏🤝", "score": 1, "replies": []}]}
