{"title": "NVDA below $96 in pm", "selftext": "", "id": "6559v4", "created_utc": 1492088040.0, "score": 55, "upvote_ratio": 0.9, "num_comments": 66, "comments": [{"body": "Buy the dip", "score": 25, "replies": [{"body": "STFU and just sell already. You are bringing us down. \nEdit: Henry is a nice guy, I'm sorry Henry!", "score": 3, "replies": [{"body": "Rally to $102. EOD? ", "score": 8, "replies": [{"body": "Why stop there?  Let's rally to $250!", "score": 13, "replies": [{"body": "Ain't happening unless tesla mode", "score": 3, "replies": []}]}, {"body": "Holy shit. Delusional.", "score": 0, "replies": [{"body": "Time to buy rope", "score": 1, "replies": []}, {"body": "Who the hell expected trump to do that? Market was green then bam red", "score": 1, "replies": [{"body": "Green? NVDA has been red all day. WTF are you talking about.", "score": 1, "replies": [{"body": "Time to buy rope ", "score": 2, "replies": [{"body": "Or you could have simply looked at the chart. But whatever.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "sacrifice to the bear gods!", "score": 3, "replies": []}, {"body": "You mean keep buying k", "score": 2, "replies": [{"body": "The higher my urges to sell get the more I should be buying. You is right Mr. Henry. ", "score": 1, "replies": []}]}]}]}, {"body": "imo $NVDA still makes a lot of sense as a medium - long term hold.  Data centers w/ AI and self driving cars are going to be huge growth drivers.  Gaming isn't going anywhere either.  We may have a slightly softer quarter than usual due to the recent growth but I don't think anything has  changed about NVDA's outlook, just the macro environment we are in.  ", "score": 11, "replies": [{"body": "I think all of that is entirely true. For stockholders, this is probably a great entry point. For those playing options, calls are very dangerous here.", "score": 5, "replies": []}]}, {"body": "Killing myself if this doesn't go back up next week. Already down 78% and calls expire next Friday lol", "score": 8, "replies": [{"body": "Can I watch? ", "score": 2, "replies": [{"body": "I'll livestream it while wearing a wolf mask", "score": 6, "replies": [{"body": "Not this shit again.", "score": 2, "replies": []}, {"body": "What if you don't kill yourself and make up your losses another way. I'll hire you as my chauffeur. I'll pay you minimum pay with no benefits. At some point you'll make your losses back and maybe even make gains.", "score": 1, "replies": [{"body": "I only lost like $500 CAD it's ok", "score": 1, "replies": []}]}]}]}]}, {"body": "What's happening, please someone stop this...", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Swallow Bandaids. This way they can properly adhere to the inside of your brutally violated, gaping arsehole.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Inverse wsb. Buy at open ", "score": 24, "replies": [{"body": "You don't want to inverse /u/MRPguy", "score": 3, "replies": [{"body": "Anyone desperately clinging to the hope that Trump is some super-genius and going to send the economy to the moon is worth shorting.", "score": 17, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "Trump is the president. The self-proclaimed master of deal making. He's the one who is supposed to be leading. And so far he has done nothing to warrant any faith in his leadership.", "score": 6, "replies": [{"body": "Can't make a deal with people who won't even sit at the table. Not rocket science.", "score": 2, "replies": []}]}]}]}, {"body": "Why", "score": 2, "replies": [{"body": "He's a bad motherfucker who literally outperforms 99% of this sub. I'm not even playing.", "score": -5, "replies": [{"body": "Not trying to discount what you're saying in any way about MRP dude but... I've got an .84c dividend coming tomorrow and I'm pretty sure I'm outperforming 99% of this sub 😎", "score": 22, "replies": [{"body": "^^  This guy fucks", "score": 1, "replies": []}, {"body": "Proof or ban", "score": 1, "replies": []}]}, {"body": "Lmao", "score": 9, "replies": []}]}]}, {"body": "Oh, they can inverse me, I'm human...but look at the NVDA chart. What a shitshow.", "score": 1, "replies": []}, {"body": "Especially not if you want to lose money the last couple of weeks. AMZN and SPY not doing any better. The market sucks right now, puts are our only hope.", "score": 0, "replies": []}]}]}, {"body": "Nope", "score": 3, "replies": [{"body": "Yep. ", "score": 3, "replies": []}]}, {"body": "You weren't right.\n\nIt went to 97 and then down because the whole market went down. Has nothing to do with NVDA specifically. \n\nUnless you're telling me you knew what SPY would do later in the day, this is just a random guess.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">When picking stocks do you simply look at the stock and ignore the market sentiment and climate?\n\nObviously not, since I mentioned it went down due to the whole market going down. \n\nAgain, you're telling me you knew SPY was going down today after midday?\n\n>How do you like that trendline down at a 45 degree angle?\n\n\"The stocks been going down consistently this week. Its going to go down\". Solid logic. Why can't everyone just guess what the stock will do by glancing at the week chart. Dumbasses\n\n\n\n\n\n", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "I think that if you think all it takes to predict what the market will do is look at a one week chart, you're retarded. The smartest people in the world with much more experience and much better technology than you can't do that. Half the mutual funds can't even beat average (this is by definition, almost) returns.\n\nIf it was that easy everyone would have 500% gains. And people wouldn't be trading puts and calls for the same price. You can't beat the market with is super easy common knowledge.\n\nDMA is an indicator of past performance, not future. Backlog test it and you'll see you wont beat the market consistently using that strategy. Or look at analysis of it from people who have actually tested that.\n\nYou can run a simple DMA strategy here.\nhttp://www.etfreplay.com/backtest_ma.aspx", "score": 1, "replies": [{"body": "> DMA is an indicator of past performance, not future\n\nWrong, much more than that. It's an indicator of past BUYING and SELLING. Trading is a psychological game. Hivemind at it's best. There is a reason resistance and support exist.\n\n>If it was that easy everyone would have 500% gains.\n\nNot really, there are enough folks like you that can't understand why NVDA would possibly go down today.", "score": 3, "replies": [{"body": ">Wrong, much more than that. It's an indicator of past BUYING and SELLING. Trading is a psychological game. Hivemind at it's best. There is a reason resistance and support exist.\n\nGo backtest it. \n\n>Not really, there are enough folks like you that can't understand why NVDA would possibly go down today.\n\nOf course it would \"possibly go down\". It could also \"possibly go up\".\n\nYou said \"most people\" know this. Certainly people who are actually trading in the millions, hedge funds, algorithmic traders, etc who actually make up most of the volume know this. So again, why are puts and calls trading for the same price? Why are billions being poured into buying stocks and calls when its so obvious its a losing bet?\n\nDo you seriously think you can beat the market because you looked at the one week chart and made a 5 second analysis?\n\nShit, only if Buffet figured this out.\n", "score": 2, "replies": [{"body": "> Do you seriously think you can beat the market because you looked at the one week chart and made a 5 second analysis?\n\nAbsolutely. I do a great job at it.", "score": 1, "replies": []}, {"body": "> Why are billions being poured into buying stocks and calls when its so obvious its a losing bet?\n\nHedging? A last lifeline YOLO? People saw a meme and are retarded?", "score": 1, "replies": []}]}]}, {"body": "Nvda to $110 next week", "score": 4, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Feb 28 - March 6th, it went from $104.80 to $97.67, so that's not what they want.\n\nBut I get your point. I've made plenty of money off NVDA calls in the past.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It will likely rally at some point, but getting past $104 range will be very tricky. And it certainly won't rally while equities are getting pummeled. Earnings season is important.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Always entertaining. Thanks for the discussion.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "mad man, next support would be 85!?", "score": 0, "replies": [{"body": "No, support at $92...but it hasn't been truly tested in months. Will probably fail if it gets that low, I'm assuming those who bought there have already closed positions.", "score": 1, "replies": [{"body": "thanks, I'm learning, I guess you got that from the bottom downtrend line?", "score": 1, "replies": []}]}]}]}, {"body": "95 P FDs plz lord\n\ndo i sell at open or does this touch 94 93 range today.\n", "score": 2, "replies": [{"body": "How to make money: Just inverse NVDA's pm", "score": 5, "replies": []}]}, {"body": "I should have sold lol yolo", "score": 1, "replies": []}, {"body": "Bought the day low today...95.50\n\nOnly one way to go from here next week", "score": 1, "replies": [{"body": "sideways?", "score": 2, "replies": [{"body": "I was gonna say... down", "score": 2, "replies": [{"body": "that is the general expectation however because everybody expects everything to go down next week, we may get a substantial bounce...  weird things happen when everybody expects one thing, or so I read.", "score": 1, "replies": []}]}]}]}, {"body": "really glad i dumped this bitch on the street yesterday", "score": -8, "replies": [{"body": "Downvoted because you hurt their feelings.", "score": 5, "replies": []}]}]}
