{"title": "AMD Earnings thread (Earnings on May 1)", "selftext": "[deleted]", "id": "68ape4", "created_utc": 1493488714.0, "score": 63, "upvote_ratio": 0.9, "num_comments": 66, "comments": [{"body": "[deleted]", "score": 89, "replies": [{"body": "100% AyyMD on Monday ", "score": 25, "replies": []}, {"body": "Just sell and buy back in at 2 bucks.", "score": 29, "replies": []}, {"body": "Why don't you just set a trailing stop sell before the earnings report?\n\ninb4\n\n>what is trailing stop\n\nrip ur savings", "score": -9, "replies": [{"body": "Why you wouldn't should be obvious if you're tradignoptions. Sure, it works but market makers and movements aren't that simple", "score": 10, "replies": [{"body": "GOOD point", "score": 0, "replies": [{"body": "yes thank you for the wisdom", "score": 2, "replies": []}]}]}]}]}, {"body": "Unfortunately high expectations of a beat does not bode well for SP increase. If there is no surprise in the Beat there might be a sell off. What you have to hope is that shorts have to cover. 14% short interest with 2 days to cover. I trust in Lisa Su and that her guidance will see us through.", "score": 37, "replies": [{"body": "Guidance > Beat or no beat.\nBest play would be to get vertical spreads. Because it's pretty much certain that we see a gap of over 8%. So one would be in the money either way.\n", "score": 1, "replies": []}, {"body": "Is the fact that the decided to release on a Monday instead of a Friday a good sign?  You would think they would release on a Friday after hours before a weekend if it was a bad report wouldn't you?", "score": -1, "replies": [{"body": "You can't release after hours on Friday, only before open ", "score": 15, "replies": [{"body": "Oh right.", "score": 6, "replies": []}]}, {"body": "It really doesn't matter either way.", "score": 5, "replies": []}]}]}, {"body": "Truthfully, I'm terrified lol I exp3ct them to guide higher though", "score": 12, "replies": []}, {"body": "[deleted]", "score": 21, "replies": [{"body": "Fuck this makes the most sense. Fuck I should have sold off Friday. Fuck.  ", "score": 7, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Niqqa you better know in some wood", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Isn't earning premarket? ", "score": 0, "replies": [{"body": "Aftermarket. ", "score": 2, "replies": []}]}]}]}]}]}, {"body": "It all comes down to the outlook for Q2.", "score": 3, "replies": []}]}, {"body": "Hopefully they release good guidance.  \n\nRyzen has only been out for one month of this quarter, and it was only the high end R7s, which won't sell as well.  Next quarter should be much better as at least the mainstream R5s will be out for a whole quarter, and maybe the R3s will be out at some point.", "score": 11, "replies": []}, {"body": "Waiting for the dip after earnings  ", "score": 6, "replies": [{"body": "Seems like a coin-flip.  Need to have disciplined strategic patience until Q3", "score": 1, "replies": []}, {"body": "If they gap up I seriously think about shorting a bit. Even though I got 3k shares. Similar to what happened with Amazon", "score": 1, "replies": []}, {"body": "Tp 11.50", "score": 0, "replies": [{"body": "Shut your dirty whore mouth", "score": 19, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "In at 15. Waiting for 16. ", "score": 2, "replies": []}]}, {"body": "Good luck all! ", "score": 2, "replies": []}, {"body": "Looks like it's a solid no buy until after.", "score": 2, "replies": []}, {"body": "I have about 1900 shares I'd like to dump on a positive earnings, and so I wrote calls on most of them for $14.50.\n\nI wouldn't mind holding as long as the dip isn't more than like 10%. Can still write calls like that.", "score": 3, "replies": [{"body": "If the dip is 10% isn't it smarter to just continue writing the calls and get a steady flow of cash? Or did you mean that you would sell to free up liquidity for other plays?\n\nAlso, what broker are you using for writing options?", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "How bad are we talking? I don't have access to option writing right now", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I feel like it's a solid strategy though. If it gets exercise you still gain regardless. What's the downside beside opportunity cost?", "score": 1, "replies": [{"body": "You're exposed to almost all the downside risk while limiting your upside potential.", "score": 2, "replies": []}, {"body": "maybe capital gains?\nbut yeah, i think its mainly opportunity cost and Having to pay commissions to get a new position in something", "score": 1, "replies": []}]}]}]}]}]}, {"body": "😂😂😂 You got cucked", "score": 2, "replies": [{"body": "Quite a bit, though I started writing calls again already - not for much, but like $10/contract for the mid June $14's. Depending on the price as of then I might switch to $13's as I can get out w/ a profit on those and I do want to free up the equity at this point... though frankly I see the stock continuing to climb for the year, I'm trying to diversify a bit more and that's a good chunk of my cash wrapped up in 1 fairly risky stock. I'd rather own safer stocks, write calls, and play options w/ the profits from that.", "score": 1, "replies": []}]}]}, {"body": "I have puts on AMD. If they dip any further below 13.45 I will make profit, at close on friday I was up about 25%. I might close them out before close on Monday, AMD will be a TWTR type ER. Their expectations are so low that anything positive (-.04 expected) would cause it to go up. It's unlikely a huge beat would happen but it could. I'm suspecting a positive EPS.", "score": 1, "replies": [{"body": "Damn son, how much did u make?", "score": 2, "replies": [{"body": "Guess I'll see tomorrow. TW doesn't update your options during after hours or premarket, sadly.", "score": 1, "replies": []}]}]}, {"body": "Bought 14 calls last week. Prob gonna get rid of them right before earnings.", "score": 1, "replies": []}, {"body": "I mean, they're pretty upfront with the L they're expecting to take. The expected EPS is out there for all y'all to see.", "score": -9, "replies": [{"body": "get a grip", "score": 8, "replies": [{"body": "You were saying??", "score": 2, "replies": []}]}]}, {"body": "Everything is mobile now. Desktop computers are dead. The GS assholes were right.", "score": -23, "replies": [{"body": "Dafuq? You need desktops/laptops if your job is worth a half a shit, or in college.", "score": 16, "replies": [{"body": "Nah man he could just trade off robinhood what does he need a desktop for ", "score": 12, "replies": []}, {"body": "Told you.", "score": 1, "replies": []}]}, {"body": "Mobile sucks. Tiny screens suck. Desktops will never be dead in any form. Do you go to work to work on your fucking phone?", "score": 2, "replies": [{"body": "Told you.", "score": 1, "replies": []}]}]}]}
