{"title": "Delta as a Probability Approximation", "selftext": "Good ol Delta. Options traders use it for everything: from measuring premium movements to notional sizing. We can also use it for a rough probability approximation of being ITM or a touch. This is because of the way delta is calculated in comparison to probability calculations. They are NOT the same but they are similar. What you'll find, is in general, for shorter term options (within a year) the variance between delta's probability approximation and actual probability calculations are fairly similar (<10% difference in most cases). \n\nIn the meantime, if you'd like a deeper dive into this concept, you can check out the video I did on the concept: [https://youtu.be/r9U31d944\\_g](https://youtu.be/r9U31d944_g). Otherwise, you can read on below.\n\nFor example, let's look at AAPL:\n\nhttps://preview.redd.it/dckq1x10vag81.png?width=1615&format=png&auto=webp&s=9f53476d274d3eea87e3d8351d1d5c5b6b75b0f3\n\n* This is the 11Feb expiration (5DTE from the time of writing). We see the -0.35 delta 170P has an approximate probability of being ITM (PITM) at expiration of 35% and a 70% probability of a touch. \n* Actual PITM calculation is 36.02% with a 71.03% probability of a touch \n* This puts us at a 1.02% variance for PITM and 1.03% variance for touch\n\nNow, let's go further out in time:\n\nhttps://preview.redd.it/79twyvxhvag81.png?width=1618&format=png&auto=webp&s=9d0671b3241e6485a7fd07e2fb0af47ccb3519ba\n\n* This is the 20Jan23 expiration (348DTE)\n* The -0.35 delta 160P has a 35% approximated PITM and a 70% probability of a touch\n* Actual PITM is 46.41% with a 83.14% probability of a touch\n* This is a 11.41% variance for PITM and 13.14% variance for touch\n\nUsing delta is a great back of the napkin tool for PITM and touch, but it's important to understand how it behaves. I have a video coming out soon that goes into a deep dive on how different variables affect delta.  In the meantime, to summarize the primary reasons we see this is a mix of the time premium in the options (attributed to volatility).", "id": "smblhc", "created_utc": 1644191810.0, "score": 11, "upvote_ratio": 0.79, "num_comments": 14, "comments": [{"body": "Thanks for your informative video, seeing the math makes the reason for the similarities in probability very straightforward. I see you also reference probability of a touch. Could you shed some light on its derivation and it’s significance vs the straightforward ITM or OTM probability. \n\nRegards", "score": 2, "replies": [{"body": "Glad it was helpful. I have a video coming out on delta that dives into this a bit further in detail, however, it follows similar logic that you see here. We can infer the probability of a touch by multiplying our delta by 2.", "score": 0, "replies": []}]}, {"body": "Good post. I feel like the idea of delta approximating prob. ITM has become controversial for some reason, despite this being a pretty well established idea for quite some time. \n\nI'm still waiting for an explanation on how you calculate expectancy on undefined risk trades. Specifically, the max loss variable.", "score": 2, "replies": [{"body": ">I'm still waiting for an explanation on how you calculate expectancy on undefined risk trades. Specifically, the max loss variable.\n\nThis is pretty straight forward. You can just define where you will manage the loss and the corresponding details.", "score": 0, "replies": [{"body": "Sure. I was interested in how you specifically calculate it. If it’s a percentage, if so what?", "score": 1, "replies": [{"body": "For me, it varies based on the underlying and strategy being deployed. For example, if I'm scalping and long or short futures, I'll use up to 8% typically closer to 3% of the portfolio for the trade. I'll cap the trade at that figure.", "score": 0, "replies": [{"body": "You often cite Russell index options and IWM. If you were calculating expectancy on a short put position, how would you define that risk variable? I’m just curious because the formula for expectancy requires a definite variable. If this is inconsistent, or nebulously defined, it’s basically a meaningless calculation.", "score": 1, "replies": [{"body": ">If you were calculating expectancy on a short put position, how would you define that risk variable?\n\nDepends on if it's a naked short put or a cash secured put. It also varies by the % of trade allocation the initial outlay is or if the trade has been scaled into for a while. The short answer to your question for naked short puts, I have a sliding scale based on IVP and HV - it wouldn't exceed 4.5x credit received. \n\n>I’m just curious because the formula for expectancy requires a definite variable. If this is inconsistent, or nebulously defined, it’s basically a meaningless calculation.\n\nIndeed. We as traders must endeavor to remove as much variability in our approach as possible. Only possible way to truly optimize performance.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Do you explain the formula for how you're getting probability of a touch in the video? I can't watch right now, but I'll definitely watch it a bit later if you touched on that. If not, what formula are you using to get that?", "score": 1, "replies": [{"body": "When referencing delta, we just take 2x that figure. There are specific formulas we can use to calculate the actual PITM and prob of a touch for an option. I use both BSM and a binomial tree for modeling - BSM works well enough but I like the comparison.", "score": 1, "replies": [{"body": "Interesting, appreciate it.", "score": 1, "replies": []}]}]}, {"body": "So the main difference in the prob ITM calculation vs delta is the logNormal vs normal dist that accounts for tails?", "score": 1, "replies": []}, {"body": "Does anyone actually use delta as a probability? Delta supposedly representing an option having a 43% chance of ending ITM seemed far fetched to me.", "score": 1, "replies": [{"body": "It’s a very common practice. The results are quite similar for nearer term expirations", "score": 1, "replies": []}]}]}
{"title": "Am I missing where Apple was removed from FAANG?", "selftext": "Either I'm a complete idiot and living under a rock or [this](https://ca.finance.yahoo.com/news/bof-a-why-amazon-will-be-top-fang-for-2022-172613587.html) analyst for Bank of America is a complete clown (big surprise). \n\nShort snippet: \n\n>We continue to rate Amazon as our top FANG and large-cap Internet stock for 2022,” Bank of America analyst Justin Post wrote in his report. \n\n>Amazon pushed markets up on Friday, and was the best performing FANG (an acronym of four of the biggest tech stocks, Meta (FB) (formerly Facebook), Amazon (AMZN), Netflix (NFLX), and Alphabet (GOOG)) stock of the week\n\nI'm sorry, an acronym for FOUR of the biggest tech stocks? Are we just going to ignore the world's MOST VALUABLE COMPANY with a 2.8T market cap? I'm not a holder but I find it blatant disrespect to just ignore Apple when talking about FANG. It leaves me with only 2 conclusions, either there's a specific reason they're omitting Apple, or this analyst actually has 0 idea wtf he's talking about which destroys any credibility he had in the first place. \n\nSomeone tell me I'm completely off here", "id": "slmxwm", "created_utc": 1644112419.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 17, "comments": [{"body": "You’re not wrong but you are unusually worked up about it.", "score": 27, "replies": [{"body": "That's fair lmao", "score": 3, "replies": []}]}, {"body": "Click on his picture, he’s just a student. Not with BOA not sure why this is published", "score": 8, "replies": [{"body": "Read the quote I posted, the yahoo analyst is simply quoting the BoA analyst", "score": -8, "replies": []}]}, {"body": "I mean you’re a complete idiot for associating him with Bank of America.  He’s a contributor to yahoo finance and merely included a quote from a Bank of America report.  He defined FANG after the quote.  Again he’s not associated with Bank of America.", "score": 4, "replies": []}, {"body": "Now it’s TAAG", "score": 2, "replies": [{"body": "What's the T, Tesla?", "score": -3, "replies": [{"body": "Tmobile", "score": 2, "replies": [{"body": "At&t", "score": 1, "replies": []}]}]}]}, {"body": "You both are misinterpreted what FAANG was. At some point everyone thought it mean the biggest Tech companies in the world. If that were the case, where is Microsoft? \n\nFAANG, or FANG, its original acronym didn't include Apple, was a term used by Jim Cramer to group the best tech stocks at that time. Its an obsolete term altogether, where is Tesla? Nvidia? Should Netflix and Meta still be included? Its outdated.", "score": 2, "replies": []}, {"body": "Apple is a fashion brand like LV, Dior or Gucci. No matter how crappy or shitty a product they made, they can still sell it at an unreal profit margin. And people are still willing to pay because they're fashionable and trending.\n\nThat said, their products are always ranged from decent to really good. Even their tech and innovation has surprised many people in recent years. So yeah, I don't see Apple will go out of the top any time soon.", "score": 0, "replies": []}, {"body": "Do you really care what an analyst thinks?", "score": 1, "replies": []}, {"body": "You are correct, the writer is a flipping idiot.\n\nMore importantly, it illustrates that we get what we pay for.", "score": 1, "replies": []}, {"body": "As coined and revised by Jim Cramer:\nFANG: 2013: FB, AMZN, Netflix, Google\nFAANG: 2017: +AAPL\nFAAMG/GAFAM: 2017?: Goldman-Sachs adds Microsoft\nI’ve seen contemporary acronyms which actually reflect the current big players or accurate current company names. FANG is almost like the S&P: new money moves in, old money moves out, but it’s still called the “S&P500.”", "score": 1, "replies": []}]}
{"title": "Using regression analysis to forecast sales in a SAaS firm?", "selftext": "I recently got hired at a small SAaS company as an FP&A analyst. The girl I’m backfilling was a genius who went to an IVY league school with a heavy comp sci/data analytics background. However, she made her way into Finance at my company and created this crazy model in R to essentially do regression analysis on our historical bookings and use it to project future order intake. She’s pretty much using actuals and I think she has some slices on both products and segments/verticals. But I also think there is a component where she layers on pipeline data.\n\nI’m in the process of learning how her model works but I started trying to do some of my own analysis. Basically, I wanted to see if some of the bookings in our verticals which house our customers from different industries (healthcare, telecom, energy) could match up against different stock price indices (SPDR S&P 500, Russell 3000, healthcare, telco, tickers etc.) as an example, I compared our ACV closes the past 2 years in our healthcare segment to the XLV healthcare ETF performance for the same period of time and did the regression in Excel. My R^2 was basically 0, which essentially means that there is no correlation between the 2. I would’ve figured if our healthcare customers are doing well and growing revenues, that would be reflected in increases in the XLV healthcare etf price.\n\nI did a separate regression on UPS and looked at their stock price and revenue for the last 15 years and the R^2 came out to 0.9 which means there is a decent amount of correlation. So if growing revenue typically leads to higher company stock price, why were my results basically inconclusive?", "id": "slqfck", "created_utc": 1644130546.0, "score": 15, "upvote_ratio": 0.74, "num_comments": 19, "comments": [{"body": "Two words\n\nSample\n\nPopulation", "score": 10, "replies": []}, {"body": "Hi, I would love to help you with your problem, but didn’t quite get which model structure (I think a linear regression model yes?) you used and which variables were input and output to your model. \n\nJust in general: correlation is a measure for linear relations between to variables. R^2 measures how much of the variance in the data is explained by your model. It can happen, that when the relation between to variables is highly nonlinear and you picked a linear model, then your R^2 can become zero even if there is a relation between them.", "score": 3, "replies": [{"body": "https://www.excel-easy.com/examples/regression.html ok so I was going off this, I thought R^2 was essentially the correlation coefficient? Where -1 means perfectly negatively correlated, 1 is perfect positive correlation, and 0 means no correlation. \n\nMy model was essentially this. I was looking at our historical sales data for respective customer verticals such as healthcare (dependent variable) and trying to do regression against prices of stock indices/ETFs such as the XLV for healthcare companies. My hypothesis was that maybe the performance of healthcare companies stock prices could have some affect on our sales in our healthcare vertical, since we serve some of those companies listed on those indices/ETFs\n\nI (incorrectly) surmised that since UPS stock price moves pretty well with the UPS revenue growth over the last 15 years (R^2 was like 0.9), I figured that if a company’s revenues are growing that means its stock price must be going up and that in turns means more dollars for my company. \n\nNow that I write all this down I realize it probably makes no sense 😭😭😭", "score": 1, "replies": [{"body": "Ah I see. Well predicting a stock price depending on a regression model is really really difficult if not impossible I think. In order to sufficiently explain your depending variable (stock price) you need to know all relevant explaining variables and give them as input to your model. You chose revenue of the company as an input and that certainly can explain the stock price to a certain extent. But the stock market and economy are so complicated and also irrational that it might be impossible to even know let alone measure all variables that can influence the stock price. \n\nLook at how the revenue of some companies has recently grown but their stock price has plummeted. A model that has only the revenue as an input would not be able to explain this drop, hence the R^2 is zero.", "score": 5, "replies": []}]}]}, {"body": "\"So if growing revenue typically leads to higher company stock price, why were my results basically inconclusive.\"\n\nIt doesn't, for many reasons. Suppose a company is growing 50% a year... but the market expects 100%. The share price will probably go down as the company is disappointing. \n\nThat 0.9 is pretty spurious. Correlation doesnt prove causality.\n\nBuild a neural network and see if it does better than her model. It probably will.", "score": 3, "replies": [{"body": "I have no idea how to build a neural network lol, this girl is a super genius (she’s like only 24 and got promoted to Senior Finance Manager of a division at our company) and they kept telling me that in the interviews. I guess I should’ve picked it up that I was punching above my weight and maybe a little too much of a noob for this role.\n\nThe company wants to take a data driven approach to bookings/sales projections. I guess you can call me an old school/traditional dude where in my previous jobs we forecasted sales using pipeline data/sales rep feedback since they touch the customer the most.\n\nDo you have any suggestions on other data I could be looking at? Maybe doing some exponential smoothing on growth rates for particular verticals?", "score": 1, "replies": [{"body": "Hard to say exactly without knowing what data you have. The first thing I would do if I was you is some proper feature exploration.\n\nYou can't create a model without having a rough idea what might work.\n\nI would plot lots of scatter charts between \n\n1) bookings today v bookings previous time periods.\n2) revenue today vs previous time periods.\n3) revenue today vs bookings in previous time periods.\n4) bookings today vs. any historical measures of pipeline activity\n5) Bookings growth vs industry growth.\n\nI suspect the best indicator for future revenue is historical revenue and bookings pipeline... you are a Saas company... growth should be stable.\n\nI would run a autoregression or a vector autoregression. Google some articles. Basically u are just predicting future variables based on past values or the same variables.", "score": 2, "replies": [{"body": "Fair enough, thanks for your help. I think my predecessor already has done that sort of regression analysis in her model so not really too much more I think I can do from that front.", "score": 1, "replies": []}, {"body": "Also... when you make predictions... give a range. Have a look up how to do this also. Cover your back a bit", "score": 1, "replies": []}]}]}]}, {"body": "Regression or time series?\n\nShe’s just using multiple regression to find beta values for each input variable. Thus a model is created and you can use it to predict an outcome based on the weightings of each input variable. Simple.", "score": 1, "replies": []}, {"body": "Re stocks:\nInterest rates are a huge driver of asset prices, philosophically free cash flow matters more than revenue, and only future cash flows matter. Revenue is probably not a great predictor of future free cash flows discounted at the appropriate rate.\n\nRe your job:\nIf you don’t get how a model works, certainly don’t use it. Make a model you understand.", "score": 1, "replies": []}, {"body": "Are you familiar with R at all? \n\nThere is a package for R called Rattle that simplifies creating linear regression models, neural networks, etc. Essentially, it puts a gui over the code and makes it way easier for the average person. You just need to load the data in.", "score": 1, "replies": [{"body": "I will check this out, thanks!", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "sm8po8", "created_utc": 1644184398.0, "score": 23, "upvote_ratio": 0.85, "num_comments": 12, "comments": [{"body": "Good stuff man! When playing Earnings, when do you typically get in? Right before Market Close?", "score": 4, "replies": [{"body": "Before earnings close might be kind of risky because that’s when IV is going to be highest. I’d recommend just grabbing calls on a red day", "score": 1, "replies": []}]}, {"body": "$CLF back to $24 🙏🏽", "score": 4, "replies": []}, {"body": "Look at all the free money :)", "score": 2, "replies": []}, {"body": "Great analysis", "score": 1, "replies": []}, {"body": "Very interesting ideas, thanks for posting!", "score": 1, "replies": []}, {"body": "More of a tribal knowledge thing, but now that CLF has broken the 20 dollar barrier it does not like to stay below it. The last few times everything dropped CLF would always get pretty beat up, settle in the teens, then claw right back up to the 20's. No guarantees but the stock does not like being in the teens these days and steel companies in general will be posting healthy profits for some time to come. I bought a bunch of CLF on the last dip to add to my current position.", "score": 1, "replies": []}, {"body": "/u/westernresorts983", "score": 1, "replies": []}, {"body": "Hoping CLF tells us more about debt reduction and maybe a future buyback.", "score": 1, "replies": []}, {"body": "You forgot FB. best time to be selling Puts", "score": 1, "replies": []}, {"body": "Dude such quality. I'll track these to see what happens but either way, great job. We need more guys like you!!", "score": 1, "replies": []}, {"body": "Nice. I bought CHGG at Monday's market open... Outstanding!", "score": 1, "replies": []}]}
