{"title": "Looking to invest $2,000 long-term (15-20 years) Newbie... no current investments", "selftext": "[deleted]", "id": "7a44mm", "created_utc": 1509548643.0, "score": 22, "upvote_ratio": 0.77, "num_comments": 71, "comments": [{"body": "Index funds. Buy and forget about it for 10 years.", "score": 32, "replies": [{"body": "He's 26, I think he can afford to play it a bit less safe than putting it all in an index fund for 10 years. Don't you think?", "score": 3, "replies": [{"body": "Of course! just depends on OPs risk aversion. I’m around the same age and just invested my 401k into an index fund only because I have the peace of mind that it can handle the ups and downs of the market in the next 15 years without accruing a ton of fees like a lot of the mutual funds.  Obviously OP can do whatever he wants with his money, but is asking for options.\n\nWhat did you have in mind? I’m sure OP would appreciate the recommendation!\n\n", "score": 2, "replies": [{"body": "You're absolutely correct and investing your 401k in an index fund isn't a bad idea at all, but here we're talking about two grand from grandma so it's a bit different imo. I generally don't recommend people stocks but encourage people to get involved in a sector they find interesting instead, unless they find economics and the stock market in general interesting. That way you can do your own research AND possibly enjoy it as well.\n\nIf OP isn't too worried about losing the money and is looking for high risk / high reward, then btc (after the upcoming fork if you want to play it a bit safer) could be an option for a ten year hold. Personally, I haven't invested in cryptocurrencies at all (but might), but it's interesting and there's a lot of potential. The Canadian MJ sector is another option.\n\nLike you said, depends on how much risk he can tolerate so more info from OP would be beneficial. Index funds are pretty much a sure bet though, and as such the opposite to the above-mentioned examples, but I wouldn't invest \"spare\" cash in them.\n\nIf you can stomach it, I'd go with the high risk / high reward route and forget about it, if we're only talking about a one time investment of $2000.\n\nOther than that, I'm a strong believer in AR, automation, AI and OLED. Ironically enough, I'm not invested in any of those either at the moment (except for a small position in LPL that I'm currently trying to evaluate whether to step out entirely (temporarily) or increase).\n\nBut like I said in the first paragraph, I recommend OP to research stocks in a sector s/he finds interesting. Who knows, s/he might just find it fun!", "score": 1, "replies": [{"body": "Yeah I dumped a bit into BTC, its doing well so far but I'm apprehensive about putting any more into it because I honestly don't understand the intricate details of crypto in general. I guess we'll see where we're at after the fork!\n\nYou've certainly got a point that its only 2K. I guess my assumption is that OP was looking for something to add to, but the program setup by his employer might already do that.\n\nI'm also super interested in AI and automation. I love my BOTZ and continue to add to it every chance I get. Any other suggestions for AI / Automation besides ROBO?\n\n", "score": 1, "replies": [{"body": "Just like the average cryptoinvestor then ;) There's a project called Nexus Earth that I stumbled upon some while ago, pretty interesting stuff and their vision is worth checking out. Been thinking about putting in a small amount a month just to support the project. I might get into btc prefork as well depending on how it behaves next week. \n\nYeah, the information is lacking but I suppose that's ultimately in OPs best interest since it would generate a bigger variety of answers.\n\nNvidia for sure, but you already got it as the biggest holding in BOTZ but might be worth investing in the stock itself as well. I'm a bit torn about a good entry point though. It's the one that got away for me... Was going to buy it the day before the massive leap above 100 but lost track of time and missed getting my order in.. Haven't been able to pull the trigger since, but rest assured that it will tank once I get over the psychological barrier and manage to buy it! Other than that, I believe BOTZ and ROBO complement eachother well and together, they cover most if not all bases. I will probably start saving monthly in both of them come next year. I find it hard to pick specific stocks in that sector, since it's still pretty juvenile. How about you?\n\n", "score": 1, "replies": [{"body": "Ah man same story with NVIDIA. Was doing my DD and the day I decided to buy it at 160 it skyrocketed and hasn't come down since. Its too hard for me to justify the price right now, hoping it drops a bit but with my luck its going to reach 250 by next year without slowing down.\n\nI was looking into ROBO but it looks like its a little more diversified than BOTZ, which I feel like I don't really need because most of my money is in the vanguard index fund. My actual stock portfolio (non index fund - less than 5k) is currently BOTZ, MU, and XXII (which is killing me). My plan is to keep buying BOTZ, maybe throw a little at MU depending on the stock price, and hold my small position in XXII to see if it goes anywhere.", "score": 1, "replies": [{"body": "Same same.. Lets hope a decent entry opens up in the near future for both of us :) \n\nThing is that you capture more of the American sector that way. BOTZ is almost 50% Japanese and around 30% American, while ROBO is the other way around (50% American, around 25% Japanese). But each to their own :)\n\nI'm entirely out of ETFs for now. MU is a fine choice imo, been looking for an entry now and then but the timing has never been right for me. I've either had better opportunities or not liquid enough. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "any in particular? Obviously some tech?", "score": 4, "replies": [{"body": "Personally I like VFIAX through vanguard but there’s a bunch of them out there, just be sure to compare the fees.\n\nIf you’re looking for tech check out BOTZ. It’s an ETF but focused on AI and robotics. ROBO is another popular ETF.\n\nThese are just my personal holdings that I have found works for me though! Do your own research and don’t put money into something because someone on the internet suggested it.", "score": 1, "replies": []}]}]}, {"body": "VOO", "score": 14, "replies": [{"body": "Or VOOG? ", "score": 1, "replies": [{"body": "> VOOG\n\ninteresting... it's beating VOO this year, but over 2+ years they are similar.\n\nI'd go QQQ", "score": 1, "replies": []}]}]}, {"body": "MSFT. dividends + its going in a very special place with cloud", "score": 7, "replies": [{"body": "Thank you, I don't know why people are suggestion index funds when this is r/stocks not r/investing ", "score": 0, "replies": [{"body": "Because OP doesn't know shit about stocks and index funds are the easy AND appropriate answer. ", "score": 12, "replies": [{"body": "And maybe OP came to this subreddit to learn about stocks.", "score": 4, "replies": [{"body": "Which is great, but he's not learning anything in this thread, it's just listing stocks and randomly picking an assortment, maybe. He doesn't have questions about financials, he doesn't have questions about the efficient frontier, appropriate diversification, he doesn't have questions about literature he should read. He's come here because the subreddit has the word stocks and he thinks that's where people invest, right? He's better off in/r/personfinance but he didn't go there, so we should give him the appropriate advice for his situation anyways, which is fire and forget index funds that he can safely ignore for twenty years without worry. If he decides to learn more, he can always sell later.", "score": 9, "replies": [{"body": "r/investing would be a good place as well. ", "score": 2, "replies": []}]}]}]}]}]}, {"body": "V, MSFT, GOOGL, BRK.B", "score": 5, "replies": []}, {"body": "BABA", "score": 6, "replies": []}, {"body": "If you want to sit on it for the long haul, get some BRK.B.", "score": 13, "replies": [{"body": "Just hope Buffett never dies. ", "score": 4, "replies": [{"body": "It's already priced in ", "score": 23, "replies": [{"body": "lmfao, savage. ", "score": 2, "replies": []}]}, {"body": "Do you think it's going to crash and burn after Buffet passes? ", "score": 1, "replies": [{"body": "I just think when the boss dies some companies strategy changes in the wrong direction. Although Apple is still profitable, I think they have been going downwards since Jobs died. I already have the opinion that Playboy will start to decline as well, but that’s another story. ", "score": 1, "replies": []}]}]}]}, {"body": "V", "score": 8, "replies": []}, {"body": "Depends how risky you're willing to be. If you have a pension setup and know that you're contribution plan is a steady source of growth then maybe look into something that is relatively safe but has more of an aggressive upside than amazon or google. Can't go wrong with amazon but if I had anther 2,000 to put in right now I'd consider LIT it's the lithium etf and it could bring you insane growth in ten years. I'm sure people will downvote me for advising that but I'd definitely do your own DD regardless of what you pick.", "score": 8, "replies": []}, {"body": "Are you fascinated by the market?  Love reading financial reports?  Then a few shares in AMZN or AAPL is great.\n\nWant to set it and forget it?  Index funds.  \n\nEither way, keep putting money in the market!!", "score": 4, "replies": []}, {"body": "VTI", "score": 3, "replies": []}, {"body": "1. Stay away from penny stocks.\n\n2. Invest in index funds. If you really want to be easy about it, you can use a service like Betterment (which repackages Vanguard funds and offers you fractional shares). Be aware of the management fees and fund fees.", "score": 3, "replies": []}, {"body": "S&P500 Index ETF.", "score": 3, "replies": [{"body": "I second this!", "score": 1, "replies": []}]}, {"body": "Forget stocks if you have absolutely no current investments.\n\n401k - It's tax deferred and lowers your taxable income if you contribute from your paycheck.\n\nMax out your 401k contributions first, then look into index funds.", "score": 6, "replies": [{"body": "401k to company match if it's available. That's free money. Then an IRA to max because 99% of the time it's going to be better than what you can get in a 401k. Roth or Traditional is going to depend on income and expected retirement tax rates. Then 401k to max, or HSA, etc.", "score": 1, "replies": [{"body": "> Then an IRA to max because 99% of the time it's going to be better than what you can get in a 401k.\n\nBecause you have more investment options/better fees?\n\nWhat if your income level is too high for Roth IRA or IRA tax benefits? Max out 401K and HSA.  Then what?", "score": 1, "replies": [{"body": "Exactly. My lowest fee option is 1.15%, my highest in my IRA is .06%. \n\nIf you're making that much money you start taxable investments, 529 plans, Backdoor Roth options, etc.", "score": 1, "replies": [{"body": "> If you're making that much money you start taxable investments, 529 plans, Backdoor Roth options, etc.\n\nYeah...  I've yet to have company a 401k plan that would actually support a backdoor Roth, but I'm sure many of them do.\n\n529 is a bit of a scam since you have to choose a state sponsored plan to get the state benefits and only the growth is tax free with the feds.\n\nI guess low cost taxable investments with dividends and long term capital gains goals seem like the best option.  Also converting HSA into investment account and delaying distributions (either by submitting late or waiting until I have more health care costs.)", "score": 1, "replies": []}]}]}]}]}, {"body": "Just buy an Index fund. It's owning a piece of the 500 top companies in America. Expect 8% a year over time. Sometimes it will go down 50%. Keep adding to it and you will do great. If you hold the 2k in until your 66 and make 8%, you will have a little less than $64,000 when you are 66. Doing this while adding 5k a year will will get you to 1.4 million dollars. ", "score": 2, "replies": []}, {"body": "Honestly, SQ is a great stock with a great entry point. ", "score": 2, "replies": []}, {"body": "Thank you all for the advice! ", "score": 2, "replies": []}, {"body": "ijr", "score": 1, "replies": []}, {"body": "GLNNF is on the rise and that tech market has an incredibly promising future. Get in soon, or keep an eye on it and buy when you feel it’s a good price for you, but don’t be surprised if it keeps raising.\n\nJust watch for talks if a big company decides to buy up its business model.", "score": 1, "replies": []}, {"body": "Nike, Broadcom, American Airlines, Texas Instruments, Mastercard, Visa, all pretty solid, long term investments. \n\nMaybe AMD, Alibaba if you want something that might not pay off well really long term but could have some decent returns.\n\nI'd say stay on the safer end of the pool until you do your research though.", "score": 1, "replies": [{"body": "Airlines are never a sound long term investment.", "score": 1, "replies": [{"body": "Hmmm the big reason you pick really any American airline company is because they all are monopolies on specific markets in the US a lot of the time. There are risks sure but I would say the risk level is pretty low, just don't sell when a dip happens overnight, keep an eye on it and sell after a year+ and you usually are safe enough. ", "score": 3, "replies": []}]}]}, {"body": "PYPL, V, BA, MU \n\n\nThese are a few that’ll do well long term. ", "score": 1, "replies": []}, {"body": "If you want less risk go for a global type etf such as vxc.to (not sure if your Canadian or American). Of you want a little more risk invest in a sector with etfs such as US banks or technology. If you want over  further risk invest in a stock you believe will do well over the long haul such as fb, Google or BAC. You're pretty much putting 100% of your portfolio into one position which adds risk to playing the individual stoke game. I hope that helps out. When I was your age I invested in stocks and didn't have the patience to let them sit. In hindsight I wish I just bought some etfs until I had enough equity That would allow to me purchase a bunch of stocks with diversification   ", "score": 1, "replies": []}, {"body": "MSFT\n\n\n", "score": 1, "replies": []}, {"body": "If you can, that is the perfect amount for something like prosper / lending club (p2p lending). You need to pick and choose things, but it generally has a net positive return, and I find it fun because you can log in every so often and invest more. Or you can automate it. \n\nIt isn't stocks, it is loans, but the smallest loan is 25 dollars and you can add to it whenever. ", "score": 1, "replies": []}, {"body": "VGF. The ETF did 29% returns so far this year. With your 2000. That's like earning 50$ a month. Maybe pay your cell phone bill. ", "score": 1, "replies": []}, {"body": "I do not recommend buying anything individual if you have no other investments. If i was to pick one stock to buy i would say microsoft. If I were you I would stash the money into a Roth IRA through vanguard or a similar company. I'm not too familiar with all of their options and am by no means an investment guru (I'm actually just a non-business major college student), but I'd think to look through their target retirement mutual funds. Would also look into ETFs. Hope this helps.", "score": 1, "replies": []}, {"body": "I’d check out r/personalfinance also. Over 12 million users. It’ll probably catch more traffic. ", "score": 1, "replies": []}, {"body": "Look at BetterInvesting.org They are a non-profit trying to teach people with no financial experience ", "score": 1, "replies": []}, {"body": "man, buy a plane ticket and travel through a couple of countries. There is enough time to think about investments and money later on.", "score": 1, "replies": []}, {"body": "Get in on the Cannabis train and buy WEED.  Wait until it comes back from the moon though.", "score": 1, "replies": []}, {"body": "try: Facebook, Amazon, Netflix and Google. the FANG!", "score": 1, "replies": []}, {"body": "If you have some balls you could go big on Freddie Mac. About $3/share right now but once its privatized again (someday) itll be worth some real money. ", "score": 1, "replies": [{"body": "Im in on FNMA. Got 5k shares hoping for a hailmary!", "score": 3, "replies": [{"body": "Im there with ya man. The way I see it even if it takes a decade eventually theyll be allowed to keep their profits again and the attitude about them will change. Some day theyll be back up in the 20-25/share range and Ill have a new house. ", "score": 2, "replies": [{"body": "With Mnuchin already saying that they are going to get that done in 2018, its already on the radar. Its a $3 stock so there is very little downside and huge upside. It was a $50 stock before the crisis so even its half that we will both have new houses! Im willing to wait 10+ years.", "score": 1, "replies": [{"body": "My thoughts exactly. Though as much as I hope they can, I doubt they will be able to actually get that done in 2018 tbh. But whenever it does happen Ill have you over for a bbq at my new house. I expect the same offer from you", "score": 1, "replies": []}]}]}]}]}, {"body": "Get on the bi(t)coi(n) train. In 10 years it could be worth 6 figures. High risk investment since you are young and you’re not going to miss $2k since it was given to you. ", "score": -1, "replies": []}, {"body": "Amd\n\nIt’s down right now. It is both a day traders dream and a good long term hold.", "score": -4, "replies": [{"body": "No", "score": 3, "replies": [{"body": "You know nothing.", "score": 2, "replies": [{"body": "John snow  ", "score": 2, "replies": []}]}]}]}, {"body": "Everyone right now is looking for a way to make a buck fast. With a declining financial system, high unemployment, rampant foreclosures and worthless retirements People are turning to alternate strategies of investments. Especially these that will not take some large cash out of their pockets. \nA friend in US told me to invest in this and was marvel to see it works. just $50 to kick start with it.\n check it out here on my site\nhttp://healthflunt.com/legit-penny-stocks/\nYou can give this a try to see how it works before adding another money into it.", "score": -1, "replies": []}]}
