{"title": "AI chip Fab Stock watchlist", "selftext": "Here is my watchlist so far for those involved in AI chip fabrication and design, and distribution, and a few involved in the end user software or etc side, some of which are working on their own chips (ie MSFT and IBM).\n\n Feel free to discuss or add. Not in any particular order. \n\nSome involved not listed here are in fact not publicly listed!\n\n*I understand there are more, such as more with automotive, robotics, aerospace. I am kind of focusing here on the fab while including some other after the fact but there not extensively. The ecosystem of the actual (high end) fab/design is smaller, in a definitive sense.*\n\nI will do another post that is more organized with some descriptions for those interested.\n\n-\n\nNVDA\n\nAMD\n\nARM\n\nQCOM\n\nINTC\n\nPLTR\n\n-\n\nTSM\n\nCDNS\n\nSNPS\n\nASML\n\nAMAT\n\nANSS\n\nCEVA\n\nENTG\n\nKEYS\n\nKLAC\n\nLRCX\n\nPDFS\n\nRMBS\n\nTEL\n\nTER\n\nMU\n\n-\n\nSMCI\n\nDELL\n\nHPE\n\n-\n\nORCL\n\nMSFT\n\nIBM\n\nGOOG\n\nGOOGL\n\nAMZN\n\nTSLA\n\nAAPL\n\nMETA\n\nSOUN\n\nBBAI\n\n-\n\nHonorable ETF mentions:\n\nNVDX\n\nNVDL", "id": "1bxlj4f", "created_utc": 1712435725.0, "score": 12, "upvote_ratio": 0.93, "num_comments": 9, "comments": [{"body": " IBM. Now that’s a name I haven’t heard in a long time. A long time.", "score": 7, "replies": [{"body": "They are working on their own chip, and they already have AI stuff and LLMs. I'm not an expert on them yet tho.", "score": 1, "replies": []}, {"body": "They down 20% this year lmao", "score": 1, "replies": [{"body": "You mean up 20% this year?", "score": 1, "replies": [{"body": "Oops I thought it was Intel not IBM lol", "score": 2, "replies": []}]}]}]}, {"body": "STM. ST Microelectronics:edge AI", "score": 3, "replies": []}, {"body": "*There may be others not listed that are on foreign exchanges.*", "score": 1, "replies": []}, {"body": "If y’all are into crypto look into near protocol and render", "score": 1, "replies": []}, {"body": "*Companies like INTC and QCOM may not be considered high end chip manuf. but they are relevant, and so then are their fabs &c.*", "score": 0, "replies": []}]}
{"title": "Buy, or sideline SPOT?", "selftext": "I do not currently own any Spotify Tech, but I'm very interested in this company. I'm a little cautious in the urge to want to purchase with the earnings report set to come out on 4/23. Going back to Q1 2022 SPOT has estimated earnings all in the negatives and granted the last 2 quarters did report positive earnings of +.55 & +.58, the estimates for this next report is .72. I understand they are just now increasing some pricing, but how does this at the end of the quarter fit in to increase the estimates from last quarter of -.21 to a +.72? Not saying this isn't possible but to go from consistently giving estimates in the negatives to give guidance that is drastically different into positive territory just seems a little to far stretched. I mean am I wrong? I do personally use Spotify and enjoy what they offer, I also feel like Spotify is to streaming music/ podcasts/audio books like Netflix is to visual streaming and see the potential of a massive break out to this SPOT stock. With indicators I'm looking at SPOT has strong buys for short term (2-6 weeks), neutral ratings for mid- term (6 weeks - 9 months) and strong buy for long term (9 months - 2 years).\n\nLooking for some other input either from current shareholders, or people sitting on the sidelines watching this stock just keep ripping into positive and soon to be ATH. Does SPOT come crashing down or do we have the next big winner? ", "id": "1bx9kfe", "created_utc": 1712403902.0, "score": 4, "upvote_ratio": 0.64, "num_comments": 18, "comments": [{"body": "I own spot.  I’ll prob sell some of my profit because I don’t know what they have left in the quiver.  Ad revenue, becoming a fanatics for musicians, partnership with live nation.  Their podcast investment didn’t exactly work out basically copying Netflix with exclusive content.  If the price increases and subcriber growth  continues the stock will go up but not sure.  Also a $60bn market cap feels good considering Lulu is at 50", "score": 4, "replies": [{"body": "I think your right especially on the \"what they have left\" statement. I'm curious to see what they can pull off and if they can bring something new to the table! For sure going to be a fun one to watch. I'm really concerned with this earnings report coming up the EPS is just such a huge difference from where everything has been forecasted in the past. Going to be exciting though.", "score": 1, "replies": [{"body": "Missed the part of forecasted profitability.  If that is true might have to buy some call options", "score": 2, "replies": []}, {"body": "OP looking like a seer.  Lucky I didn’t sell. Finally made a profit", "score": 1, "replies": []}]}, {"body": "I’m long on Spotify because of the untapped potential in developing markets. \n\nTake India for example. Their market share is up 15% in the past 4 years (sits around 25% last I checked) and it’s literally like 70 cents (USD) for a monthly plan there. \n\nAs Spotify gets a better market share and the economy develops they’ll start to raise prices sending revenue through the roof.\n\nGranted, my CB is like $270 so probably I’m a little more bullish than someone who got in earlier", "score": 1, "replies": []}]}, {"body": "I'm pretty tired of sitting on the sidelines with this one not gonna lie.", "score": 4, "replies": [{"body": "Are you going to buy into the stock? And what price are you looking to get in at? \n\nI think I'm looking at what Monday brings pre- market and if I can get in at $300 that's going to be my entry point.", "score": 2, "replies": [{"body": "Hopefully it's down on Monday but I'm buying it either way. I have seen more up than down days lately", "score": 2, "replies": []}]}]}, {"body": "Saw this at 140ish and didn’t buy like an idiot.", "score": 5, "replies": [{"body": "That would have been amazing! Now just imagine in a few weeks if you don't buy around 300 and it goes to 400 or 500.\n\nWith what you've seen though if it went back to 140ish would you still buy?", "score": 1, "replies": [{"body": "Haha I'm really glad I stuck with my gut on this one and bought a ton while it was down. Been buying it fairly regularly since IPO whenever it dropped a good amount. Current buying average of 155 and it's by far my biggest holding. Not planning on selling for a few years; starting this year they're going to be pretty wildly profitable and should stay that way moving forward. They have a lot of pricing power and a fantastic product imo\n\nIf it drops back down to 140, I'll probably double my stack unless it's something massive that really changes their core business. If it's just a broad market sell-off like the one from a couple years back though, I'm loading up like crazy again just like last time. Love the product, the developments over the years and the CEO/management team\n\nImo Daniel Eck single handedly changed the music business forever. He literally killed music piracy forever with this app and all the other companies basically copied them because they saw that's where the future of music was", "score": 2, "replies": []}]}]}, {"body": "I own some Spotify 16 shares I have been dollar cost averaging buying $50 a month for some time and I’m up over $1600. I like their platform and leadership - plan on continuing to buy $50 a month for the next ten years", "score": 3, "replies": []}, {"body": "I'm in. It's overvalued. But not that much. They have pricing power and the apple thing will help now. ", "score": 3, "replies": []}, {"body": "Streaming growth has been insane YOY, especially in Latam/SE Asia", "score": 2, "replies": []}, {"body": "Overvalued", "score": 0, "replies": [{"body": "Incredibly inaccurate.", "score": 1, "replies": []}]}]}
{"title": "Are these Global X ETFs worth it? Or which of these themes are worth holding?", "selftext": "I really got into thematic investing back in 2021 when it was popular, and the ETFs offered by Global X were interesting at the time \n\nI bought a bunch in my Roth IRA, and haven’t broke even on most of them. The BOTZ robotics and artificial intelligence ETF has done done well because AI has been a buzzword or bullish trend the last 18 months. \n\nIt seems like only the top companies in the indexes have performed well the past 18 months along with AI companies, but I’m wondering if we can expect this bull market to broaden into other sectors, technologies, and trends? \n\nWould you personally hold any of these themes or which would you sell? \n\nLIT (Lithium and Battery ETF)\nCOPX (Copper Miners ETF) \nBOTZ (Robotics and Artificial Intelligence ETF)\nBUG (Cybersecurity ETF) \nDRIV ( Autonomous & Electric Vehicles ETF) \nHERO ( Videogames & Esports ETF) \nGNOM ( Genomics & Biotechnology ETF) \nEBIZ ( E-commerce ETF) \nHYDR (Hydrogen ETF ) \nRAYS ( Solar ETF) \nAQWA ( Clean Water ETF) \nCTEC (Clean Tech ETF) \nNDIA ( India Active ETF) \nGXTG (Thematic Growth ETF- A basket of the best performing Global X ETFs) \n\nThanks ", "id": "1bxgdkj", "created_utc": 1712422725.0, "score": 11, "upvote_ratio": 0.71, "num_comments": 19, "comments": [{"body": "For metals, anything run by Sprott is 100x better than the selection by globalx. but that’s just my opinion", "score": 8, "replies": [{"body": "Would you mind elaborating on why? I'm looking to buy $COPP potentially but it's super top heavy with the #1 holding (FCX) at 22%", "score": 1, "replies": [{"body": "ohhhhh that is high. I believe Sprott knows what they are doing much more than globalx, esp after what ive seen with globalx and their uranium etf vs what sprott has done in the space. it’s just a matter of trust for me. personally I am thinking that high exposure to FCX may not be a bad thing bc US investors don’t know any names of copper miners besides FCX, so what else will generalists buy?", "score": 3, "replies": []}]}, {"body": "I agree", "score": 1, "replies": []}]}, {"body": "Statistically speaking, thematic ETFs shouldn't outperform the stock market as a whole over long time periods. I hold a little GXTG which I bought during Covid, but wouldn't invest in any of these now unless you're somehow compensating for sectors that are underweight in your index ETFs of choice or you have personal knowledge that others aren't aware of yet.", "score": 5, "replies": []}, {"body": "Those are all highly cyclical, don't try to play specific industries, just buy a boring diverse index with a bit of everything that includes those industries. \n\n\nAvoid fees, buy VOE, VWO, VEA, VOO.", "score": 3, "replies": []}, {"body": "I have nothing against thematic - it's something that I greatly enjoy - but imo it's often difficult to find a good etf that matches a desired thematic play and/or one that is a pure play on something, especially when the theme is more specific.  \n\nBOTZ has done well recently because of the AI theme, but it's still a ways from the prior highs likely because the robotics/automation side continues to lag; you'd have been better off in the QQQ over the last 1 and 5 years instead of that etf.\n\nIf I'm really interested in a particular theme, the other issue becomes - do I want what is essentially an index with a lot of mid/junky stuff and some good/great or do I want to try and focus on what I think is the good/great? So many thematic ETFs are not actively managed, they just follow some random index (BOTZ is the \"Indxx Global Robotics & Artificial Intelligence Thematic Index.\", for example)  \n\nIt's not thematic, but the GQG Quality US/Global funds have done an excellent job being nimble in recent years - Rajiv Jain sold off a lot of tech exposure in 2021, fared better than most in 2022 having piled into energy, then gradually built back tech in 2023 and has had a fantastic 2024 so far. While past performance is no guarantee of future results, there's an example of someone who protected the downside in 2022 while managing to participate pretty decently in 2023 and exceptionally well in 2024 so far. \n\nI also wouldn't go into that many themes. I would focus on a handful of the most compelling themes if you want to focus on themes - having that many ETFs starts to become a \"collect em all\" of anything even mildly talked up.\n\nSo these aren't something that would be of interest to me and I'd say if you're going to look at themes, focus on a handful that you feel strongest about.", "score": 3, "replies": []}, {"body": "Following. Also in botz, driv, and bug", "score": 5, "replies": []}, {"body": "Themes lol", "score": 2, "replies": []}, {"body": "Check out their international. GXG and ARGT have been a ride since last year. NDIA good for India exposure, just started last summer. I don't hold it as I've been holding EPI and INDA beginning of last year.", "score": 1, "replies": []}, {"body": "I own COPX as a compliment to a more targeted mining portfolio. Given that copper prices will nearly double by the end of the decade, it's a good catch all for some of the majors.\n\nI wouldn't waste my time in the gimmicky stuff like hydrogen or solar. Water is fine, but boring and unlikely to really outperform. Wouldn't touch lithium at all.\n\nBut that's coming from me, who strictly invests in commodities and adjacent industries, so I couldn't speak on the tech-y stuff.", "score": 1, "replies": [{"body": "What’s your opinion on silver prices generally or SIL (Silver Miners ETF)?", "score": 1, "replies": [{"body": "SIL, SILJ, GDXJ, and GDX have a ton of overlap. I would choose SILJ though. tun a chart on tradingview of XAU/gold and you will see that we have the beginning of a breakout of a long consolidation. Never have miners been this cheap compared to gold. So there is a long runway and PMs tend to run suddenly, hard, and fast with very quick pullbacks until they suddenly go into long consolidation mode again. Unless we repeat the 70s", "score": 2, "replies": []}, {"body": " The market is so irrational on PMs. It's absurd that gold:silver is 1:87. It \"should\" be somewhere in the ballpark of 1:35, but realistically 1:60 would make sense. So I would pound the table that silver is due for significantly higher prices. But I have to reconcile that with the fact that we're just not seeing it. So yeah, very bullish higher silver, like in the $50-60 oz realm, but the market disagrees thus far.\n\nI hold an amount of physical silver (I would never advocate for $SLV), and some junior developmental miners that have high torque if silver were to re-rate substantially higher. If I were to own majors, I'd stick with gold and $GDX.\n\n$SIL is fine. If you're a sane, generalist investor unwilling to throw your life away reading NI 43-101s, and just want some exposure, it'd be alright. I personally would prefer a more targeted approach. Like, just buy Wheaton. I love me some Pan America, but really I'd only own them if I thought Navidad could be developed, which I don't. The rest is meh. I'm not big on First Majestic until they can clean up Jerritt Canyon. Hecla and Fortuna are fine, but whatever. \n\nThe reality silver miners are facing is rising costs from the last few years of super hot inflation, but silver prices haven't adjusted to reflect that. So the margins aren't what they should be, and it just makes the sector unattractive, even if I personally think it *shouldn't* be. And being such a small percentage of a \"normal\" portfolio, I'm not sure if it's even worth the hassle.\n\nBut yeah, I'd just buy Wheaton and call it a day. If you really think silver is going to re-rate, you should be in the juniors. And not SILJ, which is just a reshuffled SIL, unlike COPJ vs COPX", "score": 2, "replies": [{"body": "Jerritt Canyon will be economic very soon the way things are going imo.\n\nBut I actually add that SBSW and IMPUY are worth a look bc platinum and palladium are cheap rn. Usually platinum exposure in miners is partially cancelled out with downside potential in palladium and vice versa.\n\nglad to see another mining investor on here.\n\nYou got any views on iron ore btw? VALE looks tasty here", "score": 1, "replies": [{"body": "I'm sure that Jerritt Canyon will get sorted, it's just a matter of whether one wants to buy in now, or wait. I'm not desperate for more silver exposure, so I'm watching from the sidelines, but I wouldn't begrudge anyone for owning it. Probably a lot of upside from here if they get it profitable.\n\nSBSW seems to be the trendy name right now. I've seen a dozen different people talking about it over the past quarter.\n\nWho knows on iron ore, man. Prices are not great, which is unfortunate given the strength in a lot of the other metals. It's wild just how much China drives that market, and you can definitely feel it when they don't bring the demand. I'm not sure where price upside is going to come from in the near term. I'd envision more pain the rest of the year.\n\nBut I do love Vale. I've owned it for years, and have been adding a bunch lately. Just couldn't resist sub $13. Them and Glencore make up the majority of what I've been buying this year. I like them mostly for the nickel exposure, but obviously they're the top of the iron game. If the market is going to give shares away at such a low value, I'll happily take them. If iron rebounds, they'll be printing cash.", "score": 1, "replies": [{"body": "i think SBSW is hated except for a few hardcore guys and degens and a few people who follow Calvin Froege", "score": 2, "replies": [{"body": "Lol, I was going to mention Calvin. He definitely started it in my circles.", "score": 2, "replies": []}]}]}]}]}]}]}]}
{"title": "Tesla has released a FSD (Supervised) tutorial.", "selftext": "", "id": "1bx8eh9", "created_utc": 1712399468.0, "score": 39, "upvote_ratio": 0.92, "num_comments": 14, "comments": [{"body": "Really wish they would have mentioned that you can use the accelerator pedal to nudge FSD as appropriate. It's such a quality of life feature that isn't obvious.", "score": 31, "replies": [{"body": "It’s taken my minimal intervention drives to zero interventions as I can tell the computer when it’s actually safe to go. Well, that and not annoying every person behind me. Doing this and I’d say the experience is pretty fantastic.", "score": 8, "replies": []}, {"body": "Not sure if this is still the case, but I was able to just use the volume scroll wheel up and down for autopilot.", "score": 0, "replies": [{"body": "What I meant was for situations like it being too shy at 4-way stops. You can push FSD to go ahead and go by pressing the accelerator. Or if it's driving too slow for the conditions you can do the same.\n\nI don't mean using it to dismiss the 'hands on the wheel' nag which is what you're referring to I think.", "score": 3, "replies": []}]}]}, {"body": "Shouldn’t you just drive if you have to leave your hands that close to the steering wheel?", "score": 6, "replies": [{"body": "In some cases, maybe not. It does a pretty good job with driving in traffic and with traffic lights. \n\nBut at stop signs and parking stops with significant traffic? Yeah, it isn't worth it. You have to look for traffic but also with the added surprise of whether the car will decide to go or not. It can go, will it? It can't go, will it try anyway?\n\nThat part is much higher load than just doing it yourself.", "score": 4, "replies": []}]}, {"body": "Supervised = we blame you if something bad happens.", "score": 13, "replies": [{"body": "Agree, but it’s necessary right now. There are too many yahoos out there falling asleep and being ridiculous with what is clearly (awesome but) not yet ready for TRUE FSD. These big steps have me bullish AF. I don’t own a Tesla but I’m an investor. I love the potential!", "score": 6, "replies": []}]}, {"body": "I’m feeling incredibly mixed about replacing the word beta with supervised.\n\nBeta made it clear that it wasn’t a finished product and that I was entitled to continued free updates until it was finished.\n\nThis isn’t at all the finished product I paid for though. I was told my car would passively make money for me when I didn’t need it. I was told I’d be able to sleep while it drove me hundreds of miles overnight.\n\nWithout the beta label, it now seems like Tesla is trying to say this supervised thing is all I paid for. I didn’t. FSD as it was advertised is worth $10-100K - maybe more. Supervised it’s only worth ~$1000. Supervised it’s just a small improvement to Basic Autopilot, which is free.\n\nHonestly, I expected basic autopilot to be replaced with something like this as the free offering. I’m fine with Tesla doing that. But they better give me the actual advertised features of FSD that I paid ~$10K for between two vehicles or else a class action lawsuit is coming their way, and I’ll be joining it. (I’ll accept 1K shares of Tesla stock as payment, since I literally sold Tesla stock years ago for FSD, with the understanding the car would be generating ~$10-20K per year within a few years.)", "score": 5, "replies": [{"body": "Elon is the finest scam master of our times![img](emote|t5_n9evv|3836)", "score": 4, "replies": []}, {"body": "I'm not sure what you are talking about.  Tesla's were able to drive across the entire country without any interventions in 2018.  What more do you want?", "score": 1, "replies": [{"body": "You meant the video footage made by Elmo or Omar? Completely legit I believe", "score": 1, "replies": []}]}]}, {"body": "I have not gotten the auto park to trigger yet. I also noticed that it doesn’t seem to want to park in a driveway for a home. I used it a ton yesterday and was extremely impressed. Hopefully they add ability for reverse over the summer. That was the biggest missing piece for me.", "score": 1, "replies": []}, {"body": "I wonder how having the yoke effects this lol.", "score": 1, "replies": []}]}
{"title": "Tesla Robotaxi is HERE... huge opportunity ahead?", "selftext": "[removed]", "id": "1bxclxj", "created_utc": 1712412931.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 21, "comments": [{"body": "You picked a tough time to initiate coverage of Tesla. :(", "score": 12, "replies": []}, {"body": "It isn't here.", "score": 22, "replies": []}, {"body": "A beta ride sharing app integrated into the Tesla app available to all Tesla owners & a concept unveiling of the new platform is my expectation.\n\nTesla owners can supervise FSD while earning riseshare $ as they transition to a full robot taxi setup in the years to come.", "score": 5, "replies": [{"body": "So people can chose to be cab drivers 😂! Big news!", "score": 3, "replies": [{"body": "Yes it is. It shows a huge step. \n\nIt’s not immediately game changing that day but it means a lot. \n\nThat’s like downplaying steer by wire or higher voltage architectures by simply saying “they removed 5 pounds from the car, big news”.", "score": 1, "replies": [{"body": "People are already cab drivers. This is only cool No humans are needed. And that scenario is 20-30 years away.", "score": 2, "replies": []}]}]}, {"body": "I think a rental option would be better.  Then turn the rental fleet into a taxi fleet over time.  I find that I rent cars much more frequently than I take a rideshare and there’s near zero government approval needed to offer car rentals.\n\nSeems like being able to offer both benefits many more.", "score": 1, "replies": []}]}, {"body": "Someone dressing in Robotaxi costume maybe", "score": 2, "replies": [{"body": "That would be hilarious.", "score": 3, "replies": []}]}, {"body": "Nothing is here. Why are people raging? All we have is a tweet from a known grifter 🤡", "score": 0, "replies": [{"body": "if you put people in a line from 'people who are more a grifter' to 'people who are less a grifter'\n\nI think the dude that started the first new major auto company in the US in 100 yrs that caused the #1 selling car on Earth to be an EV, and also made the space rocket company that sends more than half of all payload to space is probably in the 98-99th percentile 'not a grifter'\n\nI'm not sure you could mis allocate your thoughts and energy more if you tried.", "score": 3, "replies": []}]}, {"body": "It’s not here at all. It’s not going live 8/8 lol\n\nIt’s literally just another marketing gimmick reveal for the stock pump that’s show casing something coming later in life who knows when.\n\nRobotaxis are not ready at all. You are a naive blind investor if you think Tesla is confidently ready to solely take responsibility of any damages/accidents that occur from a robotaxi that has no human driver behind the wheel. Lvl 5 is not happening anytime soon. That’s what’s needed for an actual robo taxi launch", "score": -10, "replies": [{"body": "Where did he say it’s going live? Some people are just too full of hate", "score": 10, "replies": []}, {"body": "He's unveiling the concept/prototype, not launching a fully ready robotaxi on 8/8", "score": 10, "replies": [{"body": "Ah so like the roadster, pump up the stock by unveiling a prototype and doing nothing with it for years? Amazing.", "score": -8, "replies": [{"body": "or like model Y which became the best selling vehicle in the world.", "score": 7, "replies": [{"body": "The model Y was an obvious easy bet because the whole industry had already proven SUVs sell very well, this is not the same as a robotaxi prototype, not even comparable.", "score": -4, "replies": [{"body": "Oh, so more like the Model S or 3. That makes sense.", "score": 8, "replies": []}]}]}]}, {"body": "Let’s hope he doesn’t throw a baseball at the taxis window then.", "score": -8, "replies": [{"body": "Metal ball", "score": 1, "replies": []}]}]}, {"body": "Reminds me of the article I read from an AI “expert” one month before the release of ChatGPT saying that AI progress had stalled and we can’t expect any useful applications of AI for another 2 decades.", "score": 2, "replies": []}]}]}
{"title": "Week 14 $634 in premium", "selftext": "I will add a comment with a link to a spreadsheet with the detail for each option sold this week.\n\nAfter week 14 the average premium is $706 with a projected annual premium of $36,731.\n\nThe portfolio is comprised of 88 unique tickers with a value of $154k. I also have 105 open options with a value of $58k. The total of the two is $212k. \n\nI’m currently utilizing $31,050 in cash secured put collateral.\n\nI sell options on a weekly basis. I prefer cash secured puts and covered calls. Sometimes I’m ahead of the indexes and sometimes I’m behind. My goal is to keep generating a solid income. \n\nLast year I sold 964 options and I’m at 357 year to date.\n\n2022 $8,551 in premium.\n2023 $22,908 in premium.\n2024 $9,889YTD.\n\nI just hit $50k in total options premium, since 2021. I average $22.63 per option sold. I have sold 2,265 options.\n\nPremium by month\nJanuary $1,858\nFebruary $3,670\nMarch $3,727\nApril $634 MTD\n\nTop 3 premium gainers for the year:\n\nHOOD $829\nGOOGL $696\nAFRM $599\n\nPremium by year\nApril 2022 $115\nApril 2023 $1,221\nApril 2024 $634 (first week)\n\nThe premiums have increased as my experience has developed. \n\nHope you all had a productive and successful week. Make sure to post your wins. I look forward to reading about them!", "id": "1bx0pf8", "created_utc": 1712371393.0, "score": 29, "upvote_ratio": 0.87, "num_comments": 24, "comments": [{"body": "Wasn’t your account at $230,000 a month ago?", "score": 4, "replies": [{"body": "Hey there. Nice observation. I made a $17k withdrawal for taxes, property taxes, and some fun things.", "score": 10, "replies": [{"body": "Ah ok 😅", "score": 2, "replies": []}]}]}, {"body": "[detailed list of each option sold this week](https://imgur.com/a/xExmRIQ)", "score": 3, "replies": []}, {"body": "Congrats on another solid week!  I collected enough net premiums to purchase 7 shares of TLT.  Slow and steady progress toward 100.  This morning brought news that I was assigned 300 shares of ULTA on a put spread that blew up when ULTA took a dive this week.  I'll be selling those shares at the opening bell on Monday!\n\nQuestion about your options portfolio.  The total value includes long and shorts combined, right?  With all your CC's and CSP's, I'm assuming your total value is positive (and not negative) because you're holding a fair number of LEAPs, right?", "score": 3, "replies": [{"body": "Hi Lintsowner. Thank you. TLT is the 20+ year treasury bond ETF. I have some of those shares too. \n\nTo answer your question, the total value includes long and shorts combined. All CCs and CSPs are included. I am holding a fair number of LEAPS if you go to r/ExpiredOptions you will see that I update my LEAPS and display them weekly. And yes, the total value is positive and not negative. \n\nThanks for the questions.", "score": 2, "replies": []}]}, {"body": "Slow and steady!\n\nDo you keep track of how much pnl from stocks? I remember we talked before and you consider collected premiums as realized so I'm wondering if you have a separate tracking for stocks.", "score": 2, "replies": [{"body": "Hi foresttrader. I do track the profit and loss from stocks alone. \n\nStocks only:\n1.93% YTD\n41.68% over the last year", "score": 2, "replies": []}]}, {"body": "Great numbers again Expired\\_Options. April 2024 looks like it's on track to double April 2023.\n\nI collected $105.65 this week.\n\nStill working towards my $300,000 5 year plan for my travel account.Balance rose this week to $59,491 and looks reasonably on track to hit by July 2028. Another $775 cash was added this week.\n\nI have $11,684 in covered calls and using $21,886 in cash/sgov as collateral for puts. Looking for about 1% income per month on the $33,570\n\nThis is a side portfolio, main portfolio is in about 160 individual stocks and a few ETF's", "score": 2, "replies": [{"body": "Nice. Another hundred for you in the books! Don't want to jinx anything but it looks like you will be reporting $60k next week! Keep sticking with the plan and that $300k will be there in no time.", "score": 2, "replies": [{"body": "Thanks :) Here's hoping for another decent week for everyone", "score": 2, "replies": []}]}]}, {"body": "Would you say that ITM CC's are the same as CSP's ? if so why not\n\nI'm from Canada and they do not allow CSP's in Cash accounts, only in margin accounts, with Level 4 permissions I believe, essentially writing a naked put? im assuming.\n\nI'm tryin to understand why CSP are better for wheeling  vs ITM CC's as ITM CC's have been suggested by a lot of people as an alternative work around for this. \n\nThank you.", "score": 2, "replies": [{"body": "Hi Sam0077d,\n\nI'll use AMZN as an example of the difference.\n\n**ITM CC**\n\nAn in the money covered call for AMZN with a strike of $182.50 will earn $405 in premium. This would require owning the shares prior to this play. If the current share price does not go below the strike by the expiration of the covered call, you will lose your shares.\n\n**CSP**\n\nA CSP at the same strike as the ITM CC above of $182.5 will earn $139 in premium. You do not need to own the shares to sell this CSP. If the current price dips below your strike you now own the shares at $182.50.\n\nSo, to start the ITM CC process, you would need about $18.5k. As stated above, you need to own the shares before you can sell the covered call. Since the current price is $185 ($185 \\* 100 = $18.5K), for the CSP, you would need to have $18.2K as collateral, less the premium of $139.\n\nTake a look at this table as an example of how this will play out:\n\n||Cash needed|Premium|Total|\n|:-|:-|:-|:-|\n|ITM CC|$18,500 to buy shares upfront|$405|$18,095|\n|CSP|$18,200 collateral|$139|$18,111|\n|difference|$300 less for CSP|$266 more for ITM CC|$16 more for CSP|\n\nThe only issue I see is how to get the shares in the first place. You will need to pay for the shares upfront at market value. I like getting into plays using CSPs as I am getting into the position at a discount. How? I am selling the CSP at a lower strike value than the current value of the shares. I am also collecting a premium in the process.\n\nAnother alternative is buying a LEAPS. A LEAPS with a strike of $185 is selling for $5K with an expiration of 12/18/26. This is less than a 3rd of the price of both plays above. After you own the LEAPS, you can use it as collateral to sell covered calls against.\n\nIf AMZN tanks, you can only lose a maximum amount of $5K. If it increases you can ride the unrealized gains and sell covered calls against it, to maximize returns.\n\nHope this helps and thanks for the question.", "score": 3, "replies": [{"body": "Well, is your collateral for writing the CSP not locked ?  \nwhat if the stock for your csp ,keeps falling mid way or at any point during the csp timeline..\n\nalso the premium for csps seems to be lower then CC ?", "score": 2, "replies": [{"body": "The collateral for the CSP is locked for the duration of the option. If the underlying for the CSP goes below the strike that you set, then you are at risk of being assigned. If the underlying stays above the strike, your unrealized G/L may change, but the premium gained and the collateral do not. \n\nThe premium for the in the money CC is higher than the CSP in this example. The reason is because the CC is in the money and the CSP is not in the money. In the money will always carry a higher premium than out of the money options.", "score": 2, "replies": []}]}, {"body": "looks like your first column is a little off. Should be 18,250 for the CSP collateral (and therefore 250 difference from CC instead of 300), then the math for the totals actually works out.", "score": 2, "replies": [{"body": "Thank you. I was doing math in my head which is always a bad idea. You are correct in changing the first column, however, the first two columns are correct and therefore the last column was incorrect. The end result is still leads to the conclusion that both result in a similar outcome financially. The take away is how you get into the position for the covered call in the first place. \n\nThanks again for catching the math error.", "score": 1, "replies": []}]}]}]}, {"body": "Great work this week  OP!!\n\n\nThis week $1550 from pypl shares getting called away for 62c CC (1000 premium + 550 shares) : YTD $9500\n\nHolding\n\n Twlo CSP 10 cons (60p - 4/12)\n\n Roku CSP 10 cons (59p -4/19)\n\n\nGood luck and best wishes. Will try to update next week. Thanks for documenting your journey", "score": 2, "replies": []}, {"body": "When you say \"Top 3 premium gainers for the year\", what does this mean? I started trading options last month and could use some know how insight. I was +$2K profit and since then have settled some losses and now I'm only +$346.", "score": 2, "replies": [{"body": "Hi Tjeckster, when I refer to the top 3 premium gainers for the year, I am referring to the tickers who have made the most premium from selling options such as covered calls and CSPs. \n\nThe amount I make from selling options should never decrease as the premium for the transaction is a set amount. What happens after the sale of covered calls and CSPs can definitely change your profit and loss, but you can not lose your premium once it is made. \n\nI am making some assumptions here, but when you say that you are trading options, I think you may be buying and selling calls and puts? or possibly buying/selling spreads? I rarely buy options. The two scenarios where I buy options is when I buy a LEAPS to sell covered calls against and when I am rolling an already sold option. Rolling by definition is buying the position and entering a new contract by selling another option in the same action. \n\nHope this answered your question. Best of luck to you in your investment career.", "score": 2, "replies": [{"body": "You’re correct. Buying and selling calls/puts is the extent of my options trading. I’d like to learn better/more strategies but just need to find time to do it.", "score": 2, "replies": [{"body": "Right on. I guess I was just making the point that I stay on the selling side, rather than the buying side. I would search for the \"wheel\" strategy. I use a modified wheel. My number one strategy is buy and hold. I then layer on the wheel strategy and the reason it is modified is because I don't like to let the covered calls get assigned. I usually roll if the strike is getting tested. \n\nThanks again for questions/comments.", "score": 2, "replies": []}]}]}]}, {"body": "If you’re selling and gaining these premiums, why does it look like your overall performance is going down? Is that from the stocks you own as collateral moving down? You being assigned? I saw in another response that you withdrew some money for taxes, but from my understanding Robinhood doesn’t take that into account when I see your down 6k in the last week..? Maybe I’m missing something and looking at it the wrong way. Just curious what your response is!", "score": 1, "replies": [{"body": "Hey the\\_stupid\\_investor, thanks for the comments and questions. I believe you are looking at the left hand side of the screen shot, in the portfolio section? If so, you are looking at a single week. This is the ebb and flow of the market. As you probably know, they are unrealized gains/losses on the shares I own. Unrealized, meaning that without a sell, there is not a real loss. I maintain a buy and hold mentality that is supplemented by selling covered calls and cash secured puts. Buy and hold is the best strategy out there. It always will be and has been time-tested. I believe that selling options enhances that strategy as long as you are conservative and understand the positions you are taking. Although $6k may seem like a lot (and it is), it is 2.75%. When the months and years start to go into the red, then there is a problem. I don't think you are looking at it in the wrong way. For me, I am looking at the long game. A year is short-term with regards to investing. Over the last year the portfolio has increased $58k, even after last weeks $6k drop. My portfolio and experience continue to grow year after year. If that trend ever reverses, I will reevaluate my strategy and make the appropriate adjustments. \n\nAnd you are correct, adding or subtracting from your portfolio does not affect the profit/loss. \n\nThanks again for the comment. Hopefully I addressed your questions. Best of luck in your investment journey.", "score": 1, "replies": []}]}]}
{"title": "Significance of 8/8", "selftext": "[removed]", "id": "1bx2588", "created_utc": 1712375945.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 19, "comments": [{"body": "So many weird ppl around here on reddit", "score": 18, "replies": []}, {"body": "8/8 is just a deflector for the investors. Which isn’t working that well.", "score": 1, "replies": []}, {"body": "It's just a nice date which works with their time-frame.  \n\n\nI was born on 6/6, doesn't mean I associate with numerology or devil worship.", "score": 1, "replies": []}, {"body": "It’s just going to be a reveal of the car, with some lip service to a future robotaxi service. \n\nThis even will all be about the vehicle. It’s also the same vehicle base as the 25k car. \n\nFSD is still cooking. Don’t get ahead of yourself.", "score": 1, "replies": []}, {"body": "[removed]", "score": -1, "replies": [{"body": "Just for anyone that doesn’t understand how Nazis work. They love to do little stuff like this so they can point at all the rightfully outraged people and say “they’re just getting worked up over nothing tee hee, gosh it’s just some numbers”.  8/8 is a random ass Thursday. No reason to pick that date unless you’re signaling Nazis.", "score": 4, "replies": [{"body": "That’s the most pathetic part about these assholes. They can’t even own their shit. They have to tap dance around it.", "score": 2, "replies": []}]}, {"body": "Unfortunately, this seems more likely these days.", "score": 2, "replies": []}, {"body": "Looking at your history, you are a legit TSLA Fudder. All your history is to bash TSLA. \n\nBanned.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Looking at your history, it’s all bashing the TSLA sub as well.", "score": 2, "replies": []}]}]}, {"body": "Damn that’s possible. He loves doubling down on his stances.", "score": -1, "replies": []}]}, {"body": "[removed]", "score": -3, "replies": [{"body": "What are you talking about??", "score": 1, "replies": []}]}, {"body": "88 is a Nazi symbol for Heil Hiltler\n\nElon self explained this is as Chinese lucky number 8\n\nNo matter which reason is it, it just shows how randomly picked this date is for technical and business purposes \n\nThis is nothing but to respond to todays Reuters article to try to save the stock. There is absolutely no reason to dig more into this date. It won’t save the stock and there won’t be any robotaxi just like all his other broken promises", "score": 0, "replies": [{"body": "lol what!? \n\n88 is patty kanes number, not Hitler's.", "score": 1, "replies": [{"body": "https://www.adl.org/resources/hate-symbol/88", "score": 2, "replies": [{"body": "https://images.axios.com/-yGmDKupWV0Pelib96wJEKY0480=/748x0:3046x2298/1600x1600/2023/03/01/1677701351947.jpg", "score": -1, "replies": [{"body": "I sincerely don’t know what you are getting at. Do you want your say Elon Musk is a Patty Kanes fan and he honors him this way?", "score": 3, "replies": [{"body": "It's very much possible..after all why did Elon build a factory in Buffalo, NY ... Patrick Kane's hometown?", "score": -3, "replies": []}]}]}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1bx0xwl", "created_utc": 1712372127.0, "score": 8, "upvote_ratio": 0.78, "num_comments": 15, "comments": [{"body": "Can someone get Chat GPT to write a summary of this post?", "score": 5, "replies": [{"body": "OP is very regarded.", "score": 3, "replies": [{"body": "...but I read at a 3rd grade level and have the attention span of a", "score": 1, "replies": [{"body": "Gnat", "score": 2, "replies": []}]}]}, {"body": "Here is my best try: \n\nCertainly, here's the expanded summary:\n\nETFs (Exchange-Traded Funds) face concerns of being a potential bubble due to arbitrage opportunities with the NAV (Net Asset Value) price. Traders exploit price discrepancies between the ETF's market price and its NAV through arbitrage activities, which can lead to manipulation and unjust enrichment. This creates risks for investors, as their investments may be impacted by market distortions caused by arbitrage activities. Additionally, America's heavy reliance on ETFs for passive investing amplifies these concerns. The significant inflow of funds into ETFs exposes the market to greater vulnerability, as any disruptions or instability in ETF pricing could have widespread ramifications for investors. While regulatory oversight aims to mitigate these risks, the dependence on daily NAV reporting leaves room for exploitation, contributing to uncertainties about the long-term sustainability of ETFs as a primary investment vehicle.", "score": 3, "replies": [{"body": "My investment guy says \"ETF good\" and he has a 1980's mullet and a car phone.", "score": 4, "replies": []}]}, {"body": "Claude 3 response:\n\nThank you for sharing this article. Here's a summary and evaluation:\n\nSummary:\nThe author presents the idea that Exchange Traded Funds (ETFs) could be the next financial bubble. They highlight two main points: 1) ETFs can sell unlimited shares, and 2) ETFs report their Net Asset Value (NAV) only once at the end of each trading day. The author suggests that this leaves room for arbitrage by Wall Street traders who can exploit price discrepancies between the ETF's market price and its NAV throughout the day. They argue that Americans are passively investing billions into ETFs, trusting the daily NAV reported by the \"greed den filled with MIT and Harvard geniuses.\"\n\nEvaluation:\nWhile the author raises some valid concerns about potential exploitation and manipulation in the ETF market, the article lacks depth and evidence to fully support the claims made.\n\n1. The author's casual writing style, with phrases like \"TikTok riddled Americans\" and \"yummy daddy,\" detracts from the seriousness of the topic and may undermine their credibility.\n\n2. The article does not provide concrete examples or data to illustrate the extent of the alleged arbitrage activities or their impact on investors.\n\n3. The author acknowledges that regulatory bodies monitor ETF trading activities to ensure fairness and integrity, and that there are mechanisms in place to minimize price disparities. However, they do not explore these safeguards in detail.\n\n4. The conclusions drawn are more speculative than substantive. The author suggests that passive investing is \"dumb\" and that there is room for fraud without providing a solid foundation for these claims.\n\n5. The article does not discuss the benefits of ETFs, such as diversification and lower costs compared to actively managed funds, which have contributed to their popularity among investors.\n\nIn summary, while the author raises some interesting points about potential vulnerabilities in the ETF market, the article falls short of providing a comprehensive and well-supported argument. More research, data, and expert insights would be needed to fully evaluate the validity of the concerns raised.", "score": 2, "replies": []}]}, {"body": "Not likely. An ETF can not trade its own shares, Authorized Participants do it for the fund, they are external partners, brokerages, large banks that use this arbitrage opportunity: they can buy shares on the market and redeem them for the assets the fund holds or can buy the underlying assets and redeem them for shares of the ETF. As usually every fund has several APs, they capture arbitrage opportunities fairly early, I doubt there are much left. And the ETF does not have the opportunity to trade outside of its rebalancing every quarter.", "score": 5, "replies": [{"body": "Thank you. \n\nCertainly, here are some potential fraudulent activities that could occur between NAV prices and market prices in ETF trading:\n\n1. False Reporting of NAV: ETF issuers are responsible for calculating and reporting the NAV of their funds. There is a risk that an issuer could manipulate or falsify NAV calculations to deceive investors about the true value of the ETF's underlying assets. This could involve overstating the value of assets or understating liabilities to inflate the NAV and attract investors.\n\n2. Front-Running: Front-running occurs when a trader or market participant executes trades based on advance knowledge of pending orders that will influence market prices. In the context of ETFs, this could involve traders exploiting knowledge of upcoming NAV calculations to buy or sell ETF shares ahead of changes in the market price, thereby profiting from the anticipated price movement.\n\n3. Spoofing: Spoofing involves placing large, non-genuine orders to create a false impression of market demand or supply. In the case of ETFs, a trader could place fake buy or sell orders to manipulate the market price and create artificial price disparities between the ETF's market price and its NAV. This can deceive other market participants and potentially lead to unfair trading advantages.\n\n4. Insider Trading: Insider trading involves trading securities based on material, non-public information. In the context of ETFs, insiders with access to confidential information about changes in the ETF's underlying assets or NAV calculations could exploit this information to profit from trading activities before the information becomes public knowledge.\n\n5. NAV Manipulation: Traders could attempt to manipulate the NAV of an ETF by engaging in fraudulent trading activities in the underlying securities. For example, they could artificially inflate or deflate the value of specific assets held by the ETF to influence the NAV calculation and create price disparities between the NAV and market price.\n\nThese are just a few examples of potential fraudulent activities that could occur between NAV prices and market prices in ETF trading. Regulatory bodies and market surveillance mechanisms play a crucial role in detecting and preventing such activities to maintain the integrity and fairness of the ETF market.", "score": -1, "replies": [{"body": "Why not just chat with ChatGPT about this if you’re just going to copy and paste its responses?", "score": 3, "replies": [{"body": "Hey look at me providing info instead of my own bullshit. Let me just do what you typically do. SHIT I THINK I KNOW ABOUT. BLABBING ON SHIT I THINK I KNOW.  LOOK AT ME TALKING.    \n\n\nis that better?", "score": 2, "replies": []}]}]}]}, {"body": "ETF arbitrage is old news. People do this all day long.  If the ingredients cost less than the sandwich, they buy the ingredients and sell the sandwich. If the sandwich costs more than the ingredients, they buy the sandwich and sell the ingredients. Thanks Michael Lewis.", "score": 4, "replies": [{"body": "You said this is decades old scheme!   I am not trying to spread misinformation. It’s honestly wild that it’s just widely accepted.", "score": 2, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 weeks ago\n**Total Comments** | 50 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}]}
{"title": "New info discovered on Satoshi Nakamoto", "selftext": "[removed]", "id": "1bxc1rd", "created_utc": 1712411421.0, "score": 23, "upvote_ratio": 0.82, "num_comments": 12, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 14 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Bro take this to the bitcoin sub. This is place is for fomoing options after watching a YouTube tutorial", "score": 10, "replies": [{"body": "I’m not watching the videos", "score": 3, "replies": []}, {"body": "Wait, you watch tutorials beforehand?", "score": 2, "replies": []}]}, {"body": "Bake ‘em’ away toys", "score": 7, "replies": []}, {"body": "👍🏼", "score": 3, "replies": []}, {"body": "Nice shit chatgpt written story pal, now get back to working behind wendys", "score": 4, "replies": []}, {"body": "Combination of 3 people? So basically, God?", "score": 1, "replies": [{"body": "Praise Talos!", "score": 1, "replies": []}, {"body": "2 men fused at the urethra and Mary", "score": 1, "replies": []}, {"body": "The holy Buttcorn trinity.", "score": 1, "replies": []}]}, {"body": "Sir this is a wendys", "score": 1, "replies": []}]}
{"title": "I’m thinking of getting 10 165 AAPL calls for July 19th exp", "selftext": "[removed]", "id": "1bxfdyv", "created_utc": 1712420194.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 13, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 months ago\n**Total Comments** | 42 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "Bro if you have that amount to yolo then you need to just do MSTR 0DTE", "score": 1, "replies": []}]}, {"body": "Maybe.", "score": 4, "replies": []}, {"body": "Probably a good play but I would hedge them with SPY puts of the same exp", "score": 1, "replies": []}, {"body": "Honestly I’ve never been more bearish on this market in my life.  However I’m wrong 90 percent of the time so you should be fine 👌🏻", "score": 1, "replies": []}, {"body": "Get DJT PUTS and TESLA PUTS instead", "score": -3, "replies": [{"body": "Idk those don’t feel as sure, like with WWDC coming up, Apple is going to brag about their AI incorporation in software, they have developed better AI language models then OpenAi and Gemini, and Microsoft. They actually run circles around the competition according to leaks, and I’ve been in the Apple leaks space for 10 years, and they are usually pretty accurate. Maybe I’m just hoping but it feels primed for ignition", "score": 0, "replies": [{"body": "May I ask where you are getting those leaks. Also I’m not saying Apple is a bad call. I believe you are right. Apple has been In a downtrend this year and they are due for an increase", "score": 1, "replies": [{"body": "There’s a ton of them, this guy is one of my favorites though: https://youtu.be/YgU1MWNPiH4?si=XZB9brupbgCeyqLt\n\nEdit: if you wanna skip start at 2:30", "score": 4, "replies": []}]}, {"body": "I’m also bullish on AAPL.", "score": 1, "replies": []}]}]}, {"body": "Sorry, to add to my question, how does theta decay work on long dated calls? Is the P/E graph in Robinhood accurate?", "score": -2, "replies": [{"body": "Hey bro, theta just decays at the value over time since theres less time for the stock to move up or down. That's why If I want to make a play on a specific day, like earnings, I wait for that day to buy my options. Much lower premiums. But, for a play like yours where you think the stock will just go up generally over a long period of time, the only option you really have is to buy those LEAPS, so yeah I think your play is actually pretty good. So long as the market doesnt crash between now and when you sell.\n\nAlso, theta decay is more noticeable when the option expires within a couple months or so in my opinion, but when it's a very far out expiration, the decay is much less noticeable IMO", "score": 3, "replies": []}, {"body": "Use option call calculator. It will visualise the decay over time.", "score": 1, "replies": []}]}]}
