{"title": "Disney bloated in expectations of big releases?", "selftext": "In your opinion is DIS is overvalued at all or that it will continue on it's upward trend? Tomorrowland's big flop hasn't really had an impact, helped by big expectations from their releases later this year I'm sure. \nLooking for a steady long-term stock and have always wanted to get into Disney. ", "id": "3a9k6b", "created_utc": 1434616845.0, "score": 10, "upvote_ratio": 0.92, "num_comments": 22, "comments": [{"body": "Id love to hear people's thoughts on ESPN, since it likely makes up 30% of Disney's value.", "score": 6, "replies": [{"body": "College Football Playoffs seemed to do well this year. ESPN is probably the best place to go to for anything sport-related. They arent afraid of adapting either, airing eSports on ESPN2 and having a pretty big article about the rise of eSports in their latest magazine issue.\n\nI think its definitely a strong performer in the company, and I think they are making the right decisions with it. I would say 30% is a little high, but its a huge asset for sure.", "score": 2, "replies": []}]}, {"body": "I'm not a big time trader. I am a Disney Cast Member that is not in any position to have sper-classified information. I own some DIS, and that is it (other than my 401k)\n\nI would say that it's probably never a bad time to buy DIS for the long-haul. People on this sub, and pretty much anywhere you look, will always tell you that.  \nIf you are looking for a year like Frozen-a-thon.... probably not happening this year. Here are some things that might happen differently than expected:  \n\n*Inside Out** is probably expected to do well. Its Pixar, and looks great. We'll find out soon, but with the reviews that are coming out for it, this movie might outperform expectations.  \n**Ant-Man** I am really excited for this film because I am a Marvel Movie Fanboy. I think that this is probably expected to do about as well as the first Thor/Captain America movies ($350-450 globally). If people take to the humor in this film and it hits GotG levels, I think that would positively impact stock prices.  \n**The Good Dinosaur** is a wild card. Its still Pixar though.  \n**Star Wars Episode 7** I am betting that this is speculated to do very, very well. A lot of this is probably rolled into the price already. However, if we see this movie break the $2bil mark globally... who knows.\n\nThere is also expected to be news on expansion in the **US Based Theme Parks.** In Disneyland, we already have some news, however over in FL there havent been any announcements. The big thing is here is that people know *something* is coming, attractions in Hollywood Studios are closing and such, but no one knows *how big* Disney will go with this.  \n\nThe park in **Shanghai** is opening in **December** this year. China loves us, so this should go well. Theme Park openings are very rare though, so I am not sure if people know what to expect enough that this is rolled into the price already.\n\n**TL;DR: There is a lot of stuff that is probably already rolled into the price, however there is room for surprise with: The Good Dinosaur, Domestic Park Expansions, Star Wars Episode 7 (could go both ways), and Shanghai Disneyland**\n\nAlso relevant is [this.](http://thewaltdisneycompany.com/investors/disney-stock) Disney last split 3-1 in 1998 at a stock price of $111. Before that was 4-1 @ $152 and 4-1 @ $142 in 1992 and 1986.  I'm not sure what happens when a stock announces that it is going to split, but people have talked about it being a possibility.", "score": 5, "replies": [{"body": "billy ray cyrus confirmed", "score": 2, "replies": [{"body": "It's all connected.", "score": 1, "replies": []}]}]}, {"body": "I'm not sure I'd call it overvalued but a lot is baked in. I have no interest in media stocks but Disney is certainly doing well. Tomorrowland didn't do as well as hoped but wasn't a huge flop and got pretty good reviews. May do well on video.", "score": 2, "replies": []}, {"body": "I'm long DIS in my IRA and day trade it frequently in another account...My advice? Buy the dips.", "score": 2, "replies": []}, {"body": "Movies aren't as important for Disney as people tend to think they are.\n\n\nQ2 Revenues (in millions):\n\n* Media Networks $ 5,810 \n\n* Parks and Resorts $ 3,760 \n\n* **Studio Entertainment $ 1,685** \n\n* Consumer Products $ 971 \n\n* Interactive $ 235", "score": 3, "replies": [{"body": "Yes - but a studio hit can have a lot of flow through for Parks and Resorts, Consumer Products, and Interactive.\n\nA single blockbuster hit and give a 2-5% overall to revenue and much more to profit. The key for Disney's pipeline is the bankability - superhero action films and animation are in (for the time being). Disney has more of these than any other studio. Inside Out is already considered one of the better Pixar films in a while and it has tons of flow through potential on all the above.\n\nLong term, I'm incredibly bullish on DIS as investor and consumer. Yes, it's trading at a premium, but rightfully so. \n\nNBA finals generated a lot more revenue for ABC than expected. Further, ESPN has the best contracts with NBA/NFL/NHL than any other studios. Sports is one of the few areas in media that is not getting eroded by YouTube or Netflix.\n\n", "score": 4, "replies": [{"body": "Certainly. Without successful blockbuster movies, there are no new rides, no TV specials, no mobile games. People often overstate how important a flop like Tomorrowland is.\n\nSpeaking of YouTube, Disney's involved here too (Maker Studios). Also, they still own a third of Hulu. There's often talk about their reliance on 'traditional' TV, but it's calming to see efforts to diversify.", "score": 1, "replies": [{"body": "Thanks for the call out on Makers Studio - I think it's a supremely under-appreciated acquisition. A lot of people lamented the ~$1B price tag. \n\nShort-form, user-generated video are a big part for the upcoming generation, and DIS has always been good at grooming next generation of consumers. The potential synergies are super compelling... \n\nImagine if a very popular YouTube star (with 50 million followers) started promoting the next Marvel super-hero or those new IoT toys. That is probably even more effective than any promo tour movies currently go on or TV ads, especially for younger consumers. Makers Studio is pretty much like the Mickey Mouse Club + CAA on crack. Standalone revenue generation might not be stellar, but the star power and potential revenue uplift for DIS are amazing. Great buy..\n\nAgain, the tie-ins aren't necessarily for only Studios, but for potentially any of their business lines.", "score": 2, "replies": []}, {"body": "FYI - I'm not really disagreeing with you. I agree that a few flops won't break the bank. In fact, I think films are asymmetrically beneficial for DIS. They already have the best collection of entertainment assets they can monetize through Parks, Consumer Products, Interactive. ", "score": 2, "replies": []}]}]}, {"body": "Didn't realize media was that high. I knew parks generated more than films though.", "score": 2, "replies": [{"body": "See. Makes my comment about 30% of DIS's value being ESPN seem more reasonable, doesnt it.", "score": 0, "replies": []}]}, {"body": "Yea but that says a lot considering how many of those movie neared the Billion mark", "score": 1, "replies": []}, {"body": "Your reasoning is superficial.  Add Parks & Recs and Consumer Products into Studio entertainment because they are both driven by Studio releases.  A lot less so for Media Networks which is mostly ESPN/ABC (i.e., not studio release driven).  \n\nIn addition, CP is an extremely high margin business compared to any of their other products.  ", "score": 0, "replies": []}]}, {"body": "Buy when it dips", "score": 1, "replies": []}, {"body": "DIS is one of the companies positioned to continue dominance in all its core markets.\n\nMarvel will expand their brandpower with boys to the same level they already own the girls.\n\nThey will DEFINITELY have a Star Wars or Marvel theme park at some point, or phase an entire land into another park.\n\nESPN is absolutely the king of live sports.   They will continue to be.   If commercials alone can be used to judge the power of a network, and I'd argue they can be to an extent, then SportsCenter is the strongest show on TV.  People will watch SportsCenter commercials on youtube.   \n\nAs things go a-la-carte ESPN is wholesale master of live sports and you'd be kidding yourself if you think they don't get the first streaming sports service to match HBO Now.\n\nDisney is boring as fuck as a stock, but the company itself is beyond sound.  If anyone is too big to fail it's Disney.  ", "score": 1, "replies": [{"body": ">Disney is boring as fuck as a stock, but the company itself is beyond sound. If anyone is too big to fail it's Disney.\n\nWhat does this mean?", "score": 1, "replies": []}]}, {"body": "Disney investor here.  The following are my opinions and why I own Disney long-term.\n\nDisney has a lot going on.  On top of the name brand and parks.  They own many successful franchises: ESPN (owns Longhorn, SEC Networks, etc), Pixar, Marvel, Star Wars, and so on.  \n\nThe biggest win being Marvel (IMO).  Which has proven able to turn even the most obscure comic book series into successful franchises (re: Guardians of the Galaxy). \n\nWould I buy it right now?  Not sure.  I think it's a great long term stock so probably, but it's hard to guess what I would do if I didn't already own it.  I bought in at $80/share after doing very little financial research.  Actually, I previously didn't know they owned Marvel, and the day I found out was the day I purchased.  \n\nThey have a lot of things going for them, and they are continuously growing.  A pullback could always occur, but you can't always count on that happening.\n\nEDIT: BTN not opened by ESPN. Thanks", "score": 1, "replies": [{"body": "Agree with all you said but just wanted to clarify, BTN isn't owned by ESPN.", "score": 3, "replies": [{"body": "Thanks", "score": 0, "replies": []}]}]}]}
{"title": "Explain the AMD circlejerk", "selftext": "Why should I yolo with you?", "id": "3a8erv", "created_utc": 1434590204.0, "score": 8, "upvote_ratio": 0.8, "num_comments": 27, "comments": [{"body": "do you want a spaceyacht? AMD gets you a spaceyacht.", "score": 16, "replies": [{"body": ">not using AMD proceeds to buy a time machine", "score": 2, "replies": []}]}, {"body": "We're bored.", "score": 9, "replies": []}, {"body": "Amd is gonna get bought out by intel or overtake them TO THE MOON BOIS", "score": 3, "replies": []}, {"body": "It's severely undervalued. Should be at least an 8$ stock.", "score": 5, "replies": [{"body": "wait what?!?!?!?!?!?!\n\ntheir selling graphics cards to consoles at **cost** (they make no money).\n\ntheir product line is either getting raped by intel or Nvidia.\n\nHow exactly are they worth $8?!", "score": 4, "replies": [{"body": "They are a well recognized brand. While Intel and nvidia both hold major shares in both industries amd is really the only competition that people recognize and buy. So with nvidia being at 22$ and Intel being 32$ i figured it is worth less than half of nvidia and almost 1/3 of Intel.", "score": 0, "replies": [{"body": "This is the way I look at AMD, their niche graphics cards have historically stunk compared to NVDA. AMD used to be able to overcome this by selling lower prices (not anymore). \n\nIn a niche market consumers generally always go to the better product.\n\nAMD has tanked in total assets, they're are operating off debt (not because they want to, but because they have to). Their old CEO jumped boat right before missing an earnings last year.\n\nAnd they're not creating or have announced anything new that will meaningfully crush NVDA.", "score": 3, "replies": [{"body": "That's a completely fair assessment ", "score": 2, "replies": []}]}, {"body": "lol please tell me you're trolling", "score": 2, "replies": [{"body": "It's my opinion. I don't have to convince you.", "score": 1, "replies": [{"body": "It's fucking genius. Ignore the haters.", "score": 3, "replies": []}]}]}, {"body": "If you're going with a valuation based on nVidia and Intel, you should at least base the your relative price target off of market cap, not stock price.  Jesus.", "score": 2, "replies": []}]}]}, {"body": "LOLLLLLLLLLLLLLLLLLLLLLLLLLLL", "score": 1, "replies": []}]}, {"body": "I think I recall the AMD circlejerk started when apple announced that they would start using AMD chips in some of the Macbooks.", "score": 2, "replies": [{"body": "It started when I joined this sub.", "score": 1, "replies": [{"body": "A circlejerk has neither a beginning nor an end. ", "score": 5, "replies": [{"body": "just some sticky floors", "score": 1, "replies": []}]}]}]}, {"body": "Something about the new Zen chips next year, agreement for Dell to include an option to use AMD chips once again, and a new deal with Samsung to supply SoCs for their new monitors (I think, AMD has good potential to expand their SoC IMHO).", "score": 2, "replies": []}, {"body": "They also just partnered with Samsung", "score": 2, "replies": [{"body": "I believe that was mentioned. ", "score": 3, "replies": []}]}, {"body": "Swing trade baby!", "score": 1, "replies": []}, {"body": "It ain't yolo if you have to ask.", "score": 1, "replies": []}, {"body": "Armenian Drams, son.", "score": 1, "replies": []}, {"body": "probably more nostalgia than anything. I used to picture intel more like apple and amd the android.", "score": 1, "replies": []}, {"body": "AMD delivers sick alpha yo. End of story.\n\n\\#yologainz", "score": 1, "replies": []}, {"body": "because it is cheap and they now have leadership that can turn the ship. Why not toss $500, $1,000, $2500 at it. The graphics cards have a chance to push it up. Procs, will stay the same. They also have some solid semiconductor research going on that leads to selling technology to other OEMs. ", "score": 1, "replies": []}]}
