{"title": "Is AAPL still considered a good long-term investment?", "selftext": "I'm talking about 5+ years.  ", "id": "39hsbz", "created_utc": 1434054101.0, "score": 2, "upvote_ratio": 0.63, "num_comments": 23, "comments": [{"body": "Short Answer = Yes\n\nDisclosure: I can't be 100% sure since I don't have a ... http://i.imgur.com/jJrcVK4.jpg", "score": 6, "replies": [{"body": "I would certainly be your friend if you did.  \n\nI'll still be your friend without it.", "score": 2, "replies": [{"body": "I would be your friend if you were friends with him who had it.", "score": 2, "replies": [{"body": "If he who had it was your friend I'd certainly consider facebooking the both of yas", "score": 1, "replies": [{"body": "I don't have fb :/", "score": 1, "replies": []}]}]}]}]}, {"body": "The company has a lot of money and a lot of assets, but they have stopped innovating and heavily rely on the sale of iphones. When people stop buying iphones, all of their other products will take a huge hit too with the exception of the Beats brand they bought.\n\nApple wont be going anywhere in 5 years, but the question is when will sales take a hit and when that happens will they have a new product that is independent and can keep their numbers as healthy as the iphone can.\n\n", "score": 5, "replies": [{"body": "> but they have stopped innovating \n\nYou are beating the same drum clueless people do. Apple with Steve Jobs created 4 innovative products their entire life (Apple II, MacIntosh, iPhone and iPod). During the other decades with Steve Jobs, Apple did little innovations. Those little innovations is what leads to big innovations. You don't expect any company to innovate every month. It can't be done. Not even Steve Jobs did that and Steve Jobs the genius of innovation could not help his own company NeXT to succeed. So, the presence of Steve Jobs were not enough to guarantee the success of a company. His death is a loss to Apple? Yes. But Apple is still flying high. \n", "score": 5, "replies": [{"body": "And what happens when the smartphone market is fully saturated and people dont want to pay hundreds for minor upgrades? We've already reached good enough status on screens, size and weight, battery density is a wider issue than smartphones, storage isnt a big deal because we have enough local and in the cloud, network speed isnt controlled by smartphone manufacturers, etc, etc. The only clear cut path they have is processing power/efficiency, but anyone who knows semi-conductors knows those are usually an incremental upgrade.\n\nLook what they just did with the ipad mini line, literally a single upgrade from 2 to 3 and the sales of that device are terrible in comparison. Im not expecting them to pull something radically new out every year, but there one chance to show analysts that they can do something different, they gave up on, an Apple TV.\n\nRemember RIM/BBRY? They were ahead of apple, samsung, basically everyone. Then they pissed it away by making the same product over and over again expecting consumers to remain loyal. And no, I'm not pissing on just Apple, everyone has to innovate and start looking for other products to sell.\n\nMy point is, people look at apple like they are untouchable, but in reality selling 4 products (ios devices, mac devices, content and speakers) which heavily rely on each other wont keep them on top forever. When ios falls content falls too, and when those two fall they lose their ecosystem and mac falls.  It's not a question of IF but when, and when it does happen will Apple have a new hit to replace them?", "score": 4, "replies": [{"body": "Apple Cars", "score": 1, "replies": []}, {"body": "car play? apple pay?", "score": 1, "replies": [{"body": "As a reason to buy one more year of the iphone? Yes. As a major source of revenue, no. I imagine the money apple actually makes from licensing is going to be piss poor for carplay, and Apple pay is .15% whether that is good or bad obviously depends on usage, but NFC based payment has terrible real world adoption and usage so far.\n\nAlso those both are part of the iphone ecosystem, which again will be problematic in the long run (decade+) ", "score": 1, "replies": []}]}, {"body": "You cannot analyze Apple using logic. Apple customers are not regular customers, they are fans. It is like saying Dodger fans will not pay to see their teams if they play 3 times a week. A fan will always be there.\n\n> Look what they just did with the ipad mini line, literally a single upgrade from 2 to 3 and the sales of that device are terrible in comparison. \n\nIf we use this phrase with another context, lets say how it goes: \"Look what Chevrolet did with Silverado from one year to another, literally changing almost nothing\". Mention one car that changed radically from one year to another. BTW, mention any known product that changed from one day to another. Cocacola is the same for 100 years and is still selling like hell. People don't expect changes, people expecting the same. Wall street expect changes, not consumers who like a product. They expect new skins for the same thing they know and love, this is Apple is doing with upgrades of known products and from times to times they add something new, AS TECHNOLOGY EVOLVES and costs drop.\n\nThis tactic of creating iPad Mini, huge iPhones, simply demolished Samsung.", "score": 1, "replies": []}]}, {"body": "I think you're missing a larger point. \n\nLets look at other tech giants ( AAPL is still a tech company right?) Google, microsoft, etc. They're pushing into new markets and expanding. Do some of them flop? Sure. Apple pushing into the cellphone market is what saved them as a company. Now their afraid to leave it. Apple watch? hardly a departure from their normal, and in the long run *that* is their downfall. ", "score": 1, "replies": [{"body": "Sorry but you don't know what you are talking about.\n\nGoogle is pushing on other markets? Where exactly? All google does is to open new fronts for Ads, that is their only business. All other Google businesses are flops. \n\nMicrosoft is pushing on other markets? Where? Their only profitable products are Windows and Office. Profits from other sources are irrelevant for the company.\n\nApple watch is the same of mobile phones? Nope. Apple watch is a fashion design, is a medical design (and that medical facet is about to be opened). Another completely different market. Apple associated with IBM to enter enterprise customers (isn't that opening new fronts? and IBM will bring Apple a mountain of customers). \n\nDon't forget Apple TV and the car coming in 2020.\n\nDownfall for Apple? I don't think so. IBM had everything to go bankrupt when Microsoft took over and here they are, strong as ever. Even when MS disrupted their business their stock grew.\n\nApple afraid to change paths? You don't know the history of Apple. Apple is the only company that have changed paths drastically over their history. Just look at their products, constantly changing paths.\n", "score": 2, "replies": []}]}]}]}, {"body": "I am relatively new to stocks but I had a few shares I had been holding on to from a graduation gift and I just sold them. I don't see them garnering a larger portion of the market with these smaller companies seeing such improvement such as HTC. \n\nEdit: Apparently this is going on though [HTC One M9 Disaster](https://bgr.com/2015/06/11/htc-one-m9-sales-share-price/)", "score": 1, "replies": [{"body": "How many did you have and at what price \n", "score": 1, "replies": [{"body": "I only had 7 shares at $127.35. They were a graduation gift back in 2007 but if I remember correctly, it was $300 worth of shares.", "score": 1, "replies": []}]}]}, {"body": "Yes. As are many of the others mentioned in this thread.  It's products are still popular, their products have good margins, and they have lots of smart people working for them.  It is fair to say their innovating isn't as red hot as few years ago, but this is still one of the best companies of all time.  It also is not likely log the same stock gains it did a few years ago but most professional fund managers would say this is still a strong stock.  If you are looking for a long term investment I would say this is easily in the top 100 of the 3000+ stocks you could pick.", "score": 1, "replies": [{"body": "If I'm investing long term does it matter if I buy at the current price?  Or do I try to time a drop?", "score": 1, "replies": []}]}, {"body": "I bought it a couple of weeks ago.  This will be the 4th or 5th time I've owned AAPL.  They have more cash than most companies are worth.  They have an iconic brand and they have hordes of people willing to overpay for the products they make. \n\nAnd despite the noise from the shorters AAPL spends millions on research and development, who knows what the magicians have up their sleeves.  ", "score": 1, "replies": []}, {"body": "My opinion? No....on their current path. \n\nThey aren't innovating in an area of the market which *demands* it. Lets just look at similar companies:\n\nGoogle is the obvious contrast in tech, from getting into self driving automation, to google glass, to hardware utilities with fiber.\n\nMicrosoft is looking to expand, Hololens has the ability to be a big boon for them, not to mention their recent gains with the Surface.\n\nSamsung being apple's \"truest\" form of a competitor is not just in phone either. TVs, hard drives, appliances, etc. \n\nApple's sales ride on their iPhone sales. iPod and mac computer sales are small fry. The watch was their \"next big thing\" and honestly it's not that great. It's not innovative, it's just a polished version of what almost all cellphone companies saw as a tepid market at best. \n\nJust my two cents though, you never know.   ", "score": 1, "replies": [{"body": "I agree about the Apple Watch being just ok.  But don't you think at some point it will function as a stand-alone iPhone on your wrist?  1st gen iPods were not pretty, then they evolved into the iPhones we know today.  These iPhones taught people how they would use the iPad (designed with the same iOS - very smart).  Get where I'm going with that?  \n\nThey do need to expand into other areas.  ", "score": 1, "replies": []}]}, {"body": "Yes", "score": 0, "replies": []}]}
{"title": "Hello everyone. My grandpa passed away today, and he was an avid collector of $AAPL 130 calls. It warms my heart to know that he'll be remembered here. His name? E-Z money", "selftext": "", "id": "39eoip", "created_utc": 1434001783.0, "score": 37, "upvote_ratio": 0.86, "num_comments": 19, "comments": [{"body": "F", "score": 14, "replies": [{"body": "S", "score": 7, "replies": [{"body": "Y", "score": 6, "replies": [{"body": "O", "score": 6, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "", "score": 6, "replies": []}]}]}]}]}, {"body": "What's F?", "score": 2, "replies": [{"body": "http://i.imgur.com/9RYKFHb.jpg", "score": 5, "replies": [{"body": "So that's where that comes from.", "score": 2, "replies": []}]}, {"body": "F", "score": 1, "replies": []}, {"body": "It's a letter, \n\n\nF", "score": 1, "replies": []}]}]}, {"body": "FFFFFFFFFFFFFFFFFFFFFFFFFFFFF\n\nFFFFFFFFFFFFFFFFFFFFFFFFFFFFF\n\nFFFFFFFFFFFFFFFFFFFFFFFFFFFFF\n\nFFFFFFFFF\n\nFFFFFFFFF\n\nFFFFFFFFF\n\nFFFFFFFFF\n\nFFFFFFFFFFFFFFFFFFFFFFFFFFFFF\n\nFFFFFFFFFFFFFFFFFFFFFFFFFFFFF\n\nFFFFFFFFFFFFFFFFFFFFFFFFFFFFF\n\nFFFFFFFFF\n\nFFFFFFFFF\n\nFFFFFFFFF\n\nFFFFFFFFF\n\nFFFFFFFFF\n\nFFFFFFFFF", "score": 7, "replies": []}, {"body": "Oh this joke isn't dead yet?  shame", "score": 5, "replies": [{"body": "", "score": 3, "replies": []}, {"body": "A joke being dead isn't enough, reddit is only satisfied when it has been beaten into dust and scattered on the winds.", "score": 3, "replies": [{"body": "Short F, long Fat People Hate.", "score": 2, "replies": []}]}]}, {"body": "F", "score": 5, "replies": []}, {"body": "F", "score": 2, "replies": []}, {"body": "F", "score": 2, "replies": []}, {"body": "F", "score": 1, "replies": []}]}
