{"title": "Gabriel banned from Surgetraders for going full autism.", "selftext": "[removed]", "id": "411hyx", "created_utc": 1452832117.0, "score": 9, "upvote_ratio": 0.63, "num_comments": 63, "comments": [{"body": "Yeah you fuckers laugh all you want. I sent him a cashiers check for $20k and he's going to send me back my share of his winnings. I won't even need this shitty sub anymore.", "score": 38, "replies": []}, {"body": ">Most of us have 7 figure accounts \n\nwat", "score": 11, "replies": [{"body": "Bro gotta get that 100X margin account ", "score": 5, "replies": []}]}, {"body": "Who the fuck here has 9 figures? Anyways, I really enjoyed his graphs saying oil was gonna shoot up. Made me feel good inside when I bought and made bank on muh SPY puts. The dude was asking for people to give him props on surge - literal karma whore in an online chat group lol", "score": 16, "replies": [{"body": "My account does. $0.000000005 ", "score": 23, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "lol", "score": 4, "replies": []}]}]}]}, {"body": "7 figures in Chinese Yuan maybe.", "score": 4, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "You say Zimbabwean dollars like they were cheap.\n\nNot the same currency as the 2 billion dollars for a loaf of stale bread one.\n\nIt's beating the South Korean Won to death(*ding* that's racist).\n", "score": -1, "replies": []}]}]}, {"body": "It would be really motivational if there was someone in this forum lurking with 9 figures. I know a while back there was a 23-24 year old who had 7 figures(sold software of some sort, came here for advice)That being said I have yet to see someone with 8 or 9.", "score": 5, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "That is pretty much what happened.  We had some people who were verified (by looking at their brokerage statements) as making a killing trading 7-9 figure accounts.  They would always get talked down to by paper-trading derpwads, so they generally stopped posting.", "score": 3, "replies": [{"body": "awwww that actually sucks.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Mostly the just pointed out when people were making incorrect assumptions and doing dumb things, and gave some rather basic advice.  They didn't actually give away any edge.\n\nIt really comes down to just getting tired of correcting the same bullshit over and over only to have your e-rep called out.  Sitting on your hands is just easier; if you're making a killing in the market why bother.", "score": 3, "replies": []}]}]}, {"body": "We know you trade crazy amounts. I want to learn ", "score": 2, "replies": [{"body": "Seriously. Please post more\n", "score": 1, "replies": []}]}]}, {"body": ":)", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I'm still here, trolling stupidity. ", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Quite the cesspool these days. Even fscomeau is back", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "woah, forgot about that dude. He still doing drunk youtube videos?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Jesus", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "http://i.imgur.com/viu9KIL.jpg\n\nBest I can do, need to yolo it some and we'll get there.", "score": 3, "replies": [{"body": "......... bruh..... Thats intense, mad respect man. *Motivation confirmed. *", "score": 1, "replies": []}]}]}, {"body": ">Most of us have 7 figure accounts \n\nVery subtle.\n\n", "score": 4, "replies": []}, {"body": ">  That was Gabriel's personality. It got to the point where most people that would discuss oil and other trading styles etc would purposely not post in the channels because Gabriel would belittle or cut their confidence with phrases like: \"today is rough only a professional trader can figure this out today\" or \"you're just a newbie it's okay I'll teach you I trade millions a day\"\n\nTHAT IS COMPLETE FUCKING HORSESHIT.  Fucking Nick is the one going around with the mantra that you *always* short oil, always short SUNE, etc.  Gabriel ALWAYS offered a rational approach, said not to take position before oil reports, etc.  Everyone there were a bunch of cunts to him because they bought into Nick's \"oil will always go down forever\" bullshit and Gabriel was trying to be like 'hey, that's not really a rational approach.'  Gabriel was offering to make charts for people, offering to teach people, something NO ONE else there was willing to do.  \n\n", "score": 13, "replies": [{"body": "Its funny, I never remember him saying any of the stuff that the surge admins were saying he said. All I remember is him drawing graphs with correct support/resistance, and saying go \"go long when its at this support, and go short if it breaks it\". Which is absolutely the correct thing to do.", "score": 11, "replies": [{"body": "That's all I remember as well.  I think the problem is there are alot of people in this sub and elsewhere that are looking for straight \"do this\" advice and not willing to do their own analysis.  I don't remember him ever doing much other than posting resistence lines.  ", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "> He claimed to be a professional trader and literally none of what he said made any sense from a professional standpoint. \n\nWait wait wait...you're saying the guy who made cautious statements about taking short positions isn't professional, so then what the fuck is Nick who is always promoting leveraged ETFs?  \n\n> I didn't have to hear Gabriel say how he's never made a wrong trade  \n\nWhat the fuck are you talking about?  He said more than once that he's made bad trades but that he had stops to limit losses.  And more than that, he said he's been short oil from like $50/bbl.  \n\n> Plus he was doing it all to literally gain a following..   \n\nAND WHAT THE FUCK DO YOU THINK THE GUYS RUNNING IT ARE DOING IT FOR?  THAT WARM FUZZY FEELING YOU GET FROM HELPING OTHERS?!", "score": 1, "replies": []}]}, {"body": "> Gabriel was trying to be like 'hey, that's not really a rational approach.'\n\nEcon 101: Supply and demand.\n\nOil supply? MASSIVE and growing. \nDemand? Dropping. \n\nLonging Oil based on the numbers of S&D is beyond a rational approach...its fucking Insane. ", "score": 4, "replies": [{"body": "He said he had shorted oil from $50/bbl down.  All he ever fucking did was say to be cautious which you would've realized if you got Nick's cock out of your ear. ", "score": 2, "replies": [{"body": "If he did short from $50/bbl doubtful but sure I will allow. Then he sure as all hell would not saying go long oil. If he had the read at $50bbl to short then he sure has hell would also know that the data is worst then ever. So the rational approach to oil is to not be long.", "score": 2, "replies": [{"body": "> So the rational approach to oil is to not be long.  \n\nLots of analysts have talked about average oil prices for 2016 being in the $40s/bbl.  That means at some point they're expecting prices to rebound, which is the position he was taking...be cautious because it will correct, and can do so quickly.  If you weren't so fucking blind, maybe you could see that. ", "score": 1, "replies": [{"body": "Perhaps you can explain to us...at a basic level since we clearly don't have the understand that you do, on how you expect the supply of oil to come down substantially? What is coming that perhaps we have missed on what is going to drive the demand up and the supply down? After you mumble some useless information I will give you the FACTS backed with more FACTS on how you are delusional. ", "score": 1, "replies": [{"body": "> Perhaps you can explain to us...at a basic level since we clearly don't have the understand that you do, on how you expect the supply of oil to come down substantially?   \n\nFucking first of all, I don't trade oil so I have no position on it directly, but the fact you think I'm delusional for repeating things analysts much more experienced than myself have said is both sad and hilarious.  \n\nAll I fucking know is that just fucking the other day [Merrill said they were cutting their forecast to $45](http://www.marketwatch.com/story/bofa-merrill-lynch-cuts-2016-average-oil-forecast-to-45-a-barrel-2016-01-11).  Now, I would assume the people there had done maybe just a little more research on it than you have.  I and if they didn't take into account supply and demand, then kudos to you for being so diligent to take into account econ 101 shit when fucking Merrill didn't.  \n\n>  What is coming that perhaps we have missed on what is going to drive the demand up and the supply down?  \n\nYou know you only fucking have to change one of those more than the other for the price to go up right?  I mean, I'm sure you know that since you're on the lookout for econ 101 shit Merrill didn't take into account, but then again it's also kind of weird you think only a decrease in demand and increase supply would cause prices to increase.\n\n> What is coming that perhaps we have missed on what is going to drive the demand up and the supply down?  \n\n\nNow, I'm just spitballing here, but, you know, gun to my head, if I had to say how supply might drop, I guess I'd say that companies probably have ways of reducing the amount they produce...maybe they can reduce their workforce.  Maybe all wells everywhere in the world aren't equally productive and there's a distribution of profitability and a level of oil prices at which it makes sense to produce it and a level below which it does not.  Maybe at or close to the prices we are at now, or maybe a few more dollars in the lower or maybe a few more dollars higher, fucking maybe it just isn't profitable for these wells to be operated at these prices.  Maybe some companies are smart enough to realize this and they lay people off...maybe like BP has already done?  Like I said man, I'm spitballing here.  But, I mean, if you've got statistical data to show that all wells fucking everywhere in the world cost equal amount to produce and to refine and get to market, I would honestly be fucking fascinated with reading that.  ", "score": 0, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "If you want to be fully transparent, just fucking go ahead and post the chat logs so everyone can judge.  \n\n> Earlier he refused to prove any trades and refused to say entries/exits in the chat for people to see. \n\nI don't recall fucking anyone else posting proof of the trades they've made either.  ", "score": 2, "replies": []}]}, {"body": "[OK](http://i.imgur.com/GqA9PNt.jpg)", "score": 1, "replies": [{"body": "Favorite mod", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "He manufactured so much drama he's the one making posts about it on a sub he doesn't even use.  Only a total cunt would do that right?  But, oh wait, that's your fucking bitch ass.  ", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I saw it.  But I also think you're fucking full of shit.  \n\nAnd also, I see that you're not denying you're a fucking total cunt, so I'm glad we got that straightened out.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> I don't want to hear any complaining when he gets you into a losing trade or peddles a subscription service on you.\n\nYou say that as if there aren't a sad and hilarious amount of bagholders in surge chat every day.  What's it been lately?  LABU/D?  And you know what else, fuck man, it'd be really goddamn ironic if surge ever became a subscription thing now wouldn't it?", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "First off, I never said you were, so it's a little weird that you're so defensive about it.  \n\nBut if you're not part of it, how the fuck do you know about Gabrie87whatever enough to know who he is AND that the was banned from surge?", "score": 2, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "> Lol, you're obviously inferring that I am part of surge with the comments you made.  \n\nI'm actually not but it's kind of weird you're so goddamn insistent and defensive about something I've never even said.  \n\nAlso, go fuck yourself with a canoe.  I'd say go fuck yourself with yacht but we both know that will never happen, and I thought I'd recommend an vessel more suited to your price range.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Did you guys fuck yet or what?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "That whole give/take thing. ", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "That dude was far from rational. Maybe you should real DD and research before you think his thoughts and Nazi ideology I'm 100% right 100% of the time is rational .", "score": 0, "replies": [{"body": "> Nazi ideology I'm 100% right 100% of the time is rational .\n\nHe fucking never said that, and you're a fucking cunt for calling him a Nazi.  All he ever did was offer a voice of reason for the fucking completely irrational \"Always short X\" bullshit.  ", "score": 1, "replies": []}]}, {"body": "So Long, and Thanks for All the Fish  ^^^^^^^^^^^^^^^^0.7433  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/80376)", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "I don't even know how much 9 figures would be.", "score": 3, "replies": [{"body": "1 billion", "score": -8, "replies": []}]}]}, {"body": "[OK](http://i.imgur.com/GqA9PNt.jpg)", "score": 3, "replies": []}, {"body": "Can we ban nickglav next? He's an annoying faggot who has like 500 dollars in his robinhood acc. Asking retarded questions and talks about working out in the daytrade channel during market hours", "score": 4, "replies": []}, {"body": "But when u/blackdowney said shit to him I was the fucking wrong one huh? \n\n", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "meh, just venting when he criticized one of my trades because he was a pro and I was a fucking idiot. I dont tell people how to lose their money", "score": 1, "replies": []}]}]}, {"body": "I wish my account was 9 figures...", "score": 2, "replies": [{"body": "I have 9 fingers", "score": 3, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "The real question is, how much did you start with?", "score": 1, "replies": []}]}]}, {"body": ">Most of us have 7 figure accounts \n\nLOL, how about you start a r/surgetraders and keep your pump 'n dump slack off of here? I joined for 20 minutes and it was like 400 fscomeau chihuahuas nipping at my heels.", "score": 4, "replies": [{"body": "\\>on wsb\n\n\\>accusing surge of being a p&d chat\n\nK.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I'm saying instead of using r/wallstreetbets as lead gen for the slack channel, do it somewhere else", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "oh whoops haha (seriously, i don't hate ST but it'd be cool if they made public and built up their own subreddit)", "score": 0, "replies": []}]}]}]}]}, {"body": "How many decimal places we counting here?", "score": 1, "replies": []}, {"body": "I've learned to keep the trades (gains and losses) to myself. No screenshots, nothing. Because it creates biases towards my ideas.\n\nI just suggest my idea on trades on the internet is all because I enjoy bouncing them around people to see what they think. After my analysis and opinions from casual traders, prof traders, and plebs, then I make my trade decision. \n\nThat's what I use WSB and any internet form. I like to give back, not by screenies, but research I feel I should share with everyone when I'm emailed them.\n\nEvery man for himself, I don't see what Gabe was trying to do. Does has an internet ego he likes to stroke? Because I understand he was trying to have conversations and discussion. But autistic lying has no purpose but ego stroking.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "That's why I also do a disclaimer. This is not my idea this is just research. Take it with a grain of salt.\n\nEdit: Your comment gave me a moment of clarity. Here's your reward, because I rarely get moments of clarity online.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Someone gave it to me too. I don't know either, but it makes it easier seeing new comments in a thread you were in previously as they are highlighted. \n\nAnd I guess you can browser /r/lounge but its shittier than this sub.", "score": 2, "replies": []}]}]}]}]}]}
