{"title": "Saudi Arabia is struggling to boost oil prices, raising possibility of supply war with U.S.", "selftext": "OPEC is facing growing challenges in its efforts to boost oil prices amid record output outside the alliance, particularly in the U.S., raising questions about how long the alliance can maintain its deep production cuts. OPEC and its allies, OPEC+, failed to reach a unanimous agreement Thursday on cuts, even after delaying the meeting by five days in an effort to shore up unity within the alliance. Instead, seven members announced voluntary, unilateral cuts to the tune of 2.2 million barrels per day for the first quarter of 2024. \n\nThe outcome is a “bittersweet victory” for OPEC kingpin Saudi Arabia, wrote Jorge Leon, senior vice president of Rystad Energy, in a note Thursday. Riyadh convinced members to share some of the burden in cutting. But the failure to secure a formal agreement “does not bode well for the group’s unity and cohesion and limits the group’s ability to balance the market,” Leon wrote. \n\nWith oil prices down more than 14% since September highs, traders were hoping that OPEC could provide a boost. So far, however, the cuts are not having the intended effect on oil prices. U.S. crude fell more than 2% Thursday, while Brent dropped 0.3%. Oil futures were down more than 2% on Friday. Traders are disappointed that the cuts are short term, just one quarter, and worried that OPEC+ will not be able to hold itself together, Leon wrote in a note Thursday. \n\nOPEC+ is increasingly struggling to coordinate large reductions given the size of cuts already in place and the limited impact they are having on prices, JPMorgan analyst Natasha Kaneva wrote in a note Friday. In the end, Saudi Arabia may have only one option — launch a supply war by flooding the market with oil. “They could just add two and a half million barrels into the market for six months and just flush it,” Paul Sankey, a top oil market analyst and president at Sankey Research, said on CNBC’s ” Fast Money ” Thursday. \n\nOil below $60 on supply war? The Saudis face two problems — restlessness within the OPEC+ ranks on the cuts and record production outside the alliance, particularly in the U.S. Oil producers outside OPEC+ are pumping oil at record levels and can now cover global demand, which which has forced the Saudi-led alliance to cut to keep the market balanced in their favor, according to Kaneva. John Kilduff, founder of Again Capital, thinks the Saudis are fighting a losing battle with the U.S. Riyadh is currently producing 9 million bpd compared to 13 million bpd in the U.S. And record production outside OPEC comes at a time when demand growth is faltering in China, Kilduff said. “They have a big problem on their hands,” Kilduff said of Saudi Arabia. “They have their hands full and to me it’s not going to prove to be a winning strategy for them,” he said of the output cuts. \n\nSankey said the Saudis would need to dramatically slash prices to keep production from growing in the U.S and regain market share. This would require pushing crude below $60 per barrel because that is the price U.S. producers are planning for right now, Sankey said. The Saudis already came close to “burning the house down” this week as they struggled to get OPEC+ members in line, Kilduff said. Given the challenges facing OPEC+, the group’s exit strategy from the current cuts is now in sharp focus, Kaneva wrote in a November note. If Saudi Arabia and Russia return 1.3 million bpd to the market in April, the price of Brent would average $77 per barrel in 2024 and $57 per barrel in 2025, according to Kaneva. This would trigger a slowdown in drilling and fracking activity in the second half of 2024, shaving off about 170,000 bpd of U.S. production growth, she wrote.  In 2025, U.S. liquids production would be flat compared to JPMorgan’s baseline of 740,000 bpd of growth. \n\nCompliance under scrutiny. For now, the focus is on whether OPEC+ will actually come through with the cuts promised Thursday. The 2.2 million bpd in voluntary cuts from the coalition of the willing is somewhat deceiving. Saudi Arabia, for example, simply rolled over its current 1 million bpd cut, while Russia increased its export curbs – not production – by 200,000 bpd to 500,000 bpd total. In reality, the new cuts to production for the first quarter total about 700,000 bpd total from Iraq, the United Arab Emirates, Kuwait, Kazakhstan, Algeria and Oman. \n\nGoldman Sachs, for its part, declined to change its oil price forecast on the OPEC decision as the investment bank waits for “clarity on compliance with cuts and additional inventories data.” Goldman still expects OPEC to keep Brent in a range of $80 to $100 a barrel in 2024. But compliance with voluntary cuts is a “stress test” of whether Brent will maintain an $80 floor, analyst Daan Struyven wrote. A slowdown in U.S. supply growth in 2024 is another major assumption supporting that price floor. One downside risk to the $80 floor would be persistent upside surprises in crude inventories particularly in the U.S., according to Goldman. Global inventories rose by 300,000 bpd on average in October and November, while Goldman had forecast a decline of 700,000 bpd. And then there is the problem of OPEC unity — or lack thereof. “The further rise in spare capacity and the voluntary nature of today’s cut imply that additional large OPEC+ cuts in response to any additional inventory beats become increasingly difficult to implement,” Struyven wrote.\n\nhttps://www.cnbc.com/2023/12/01/saudi-arabia-is-struggling-to-boost-oil-prices-raising-possibility-of-supply-war-with-us-.html", "id": "18a09bh", "created_utc": 1701629523.0, "score": 494, "upvote_ratio": 0.96, "num_comments": 98, "comments": [{"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "High relevance to oil prices which impacts all energy sector stocks, price of virtually everything, inflation and lots of energy intensive stocks.\n\nA dramatic move in oil prices could easily move individual and broader stocks by itself.", "score": 1, "replies": []}]}, {"body": "Looking forward to it. It was entertaining to watch it last time when price went negative, supercontango and all that stuff", "score": 233, "replies": [{"body": "Physically settled furures contracts (i.e. /CL) went negative. Spot prices and cash-settled futures contracts (e.g. /BZ) did not go negative.", "score": 48, "replies": [{"body": "Wouldn't make any sense for cash settled futures to go negative. The reason /CL went negative was storage was getting full and it was getting difficult to take assignment of the physical oil. A game of musical chairs for the contract holders without the ability to fulfill the promise to take ownership of the delivery.", "score": 22, "replies": [{"body": "Those were good times", "score": 5, "replies": [{"body": "Yep, some brokers messed up so badly that day. They had infinite money glitches, basically allowing the trades to go through without margin checks. Quoting their customers a price of 0.01 for /CL although it already went negative. Some retail traders amassed positions that there at multi million dollars unrealized losses, since the price kept going more and more into negative territory. But the account P/L wouldn't reflect it lol.", "score": 11, "replies": []}]}]}]}, {"body": "[deleted]", "score": -7, "replies": []}, {"body": "You realize what happens when supply is constrained rather than demand....right....?", "score": 0, "replies": []}]}, {"body": "> Oil producers outside OPEC+ are pumping oil at record levels and can now cover global demand, which which has forced the Saudi-led alliance to cut to keep the market balanced in their favor, according to Kaneva. \n\nThe two-part problem for the OPEC+ cartel is going to be difficult for them to navigate:\n\n* Member nations need a certain level of oil revenue/profits to balance their own national budgets. Russia is close to trying to fund a total war off of oil revenue, and Nigeria/Angola can't afford to hold back production. Saudi Arabia can voluntarily cut revenue enough to keep prices high, but then they don't get the benefit of high prices when they're not selling enough volume. All the other OPEC and OPEC+ countries need that combination of price and volume to balance their budgets, so they're all hoping that other nations' voluntary cuts support the prices necessary, without having to sacrifice their own volume.\n* Producers in non-member nations (and member nations that don't obey the quotas) can free-ride off of OPEC+'s price manipulation to get high volume at high prices. The United States, Canada, Mexico, China, Brazil, Norway, and Kazakhstan are producing a bunch of oil, and its producers love when the Saudis push prices up. (And even though Brazil and Kazakhstan are sometimes geopolitically aligned with OPEC+, that's offset by the fact that OPEC member nation Iraq ignores quotas).\n\nAs long as non-OPEC+ production capacity remains high, the OPEC+ nations can't effectively manipulate prices, which will cause dissent within its own ranks.", "score": 66, "replies": [{"body": "The US oil producers certainly like high prices, but the government themselves would prefer lower prices to calm inflation and to lower fuel prices close to election season.", "score": 33, "replies": [{"body": "What?!  Oil prices are going *down* in an election year?  \nI'm shocked!  \n/s", "score": 8, "replies": [{"body": "They’ve actually been going down the year before the election year as well.  At some point one realizes, it has little at all to do with US elections.", "score": 14, "replies": [{"body": "The \"oil prices in an election year\" claim relies on one of two things to be true: \n\n1) The President can control oil prices and Biden chose to spike gas prices during a midterm election year.  \n\n2) Oil companies would collude with a Democratic president to lower prices and increase Biden's chance of winning.", "score": 8, "replies": []}, {"body": "It's Almost like one side uses it as a bullshit talking point to manipulate a dumb constituency that drives exclusively lifted trucks that burn through mass amounts of oil🤔", "score": 3, "replies": []}]}]}, {"body": "Thanks Perd", "score": 0, "replies": [{"body": "Eh?", "score": 1, "replies": []}]}]}, {"body": "Good. Fuck them.", "score": 11, "replies": []}]}, {"body": "US set a new monthly record for oil production. US will continue to grow as OPEC cuts.", "score": 53, "replies": [{"body": "THe US produces 43% more oil that Saudi Arabia, which is amazing.", "score": 15, "replies": []}, {"body": "US can’t just supply infinitely either though. They can supply more at lower prices than during the shale boom, but they too have break even prices/margin requirements they have to meet.", "score": 14, "replies": [{"body": "That's true, but we've seemingly got some room to run there. According to the Dallas Fed's 3Q energy survey, the WTI breakeven point for the major US firms is in the high 50's-low 60's for new wells.\n\n\nhttps://www.dallasfed.org/-/media/Documents/research/energy/energycharts.pdf", "score": 14, "replies": []}, {"body": "Agreed. Producers in the US also have high interest rates to contend with. This wasn't the case during the last price war with SA.", "score": 0, "replies": []}]}, {"body": "US can't refine, not sure if pumping more crude will help U.S.", "score": -12, "replies": [{"body": "Wut", "score": 5, "replies": []}]}]}, {"body": "Good", "score": 80, "replies": []}, {"body": "This is why I don’t buy oil stocks. The market is completely manipulated", "score": 121, "replies": [{"body": "I just can't resist the cash flow.", "score": 6, "replies": []}, {"body": "I’m heavy in oil stocks. Some are okay but at least half are in the red the last couple months.", "score": 20, "replies": [{"body": "Over the years I have found the only time to buy oil stocks is during a massive bear market in oil and shares plummett 80-90%. Then sell on the cycle back up . If you go long term trend 10yrs plus you will see many oil stocks are merely flat at best . Compare that to something like the FANG names which are the future and are growing massively every year no matter what the price of oil is", "score": 30, "replies": [{"body": "It's almost like commodities are not growth companies.", "score": 2, "replies": []}, {"body": "I I’m 50 percent on a couple and down 30 percent on a couple. Dividend are great though. Just a bit nervous with my exposure. Thanks", "score": 1, "replies": [{"body": "I yolo'd back into cvx after the acquisition dip.. They're more exposed to oil price fluctuations now but they're planning on increasing buy backs and up dividends even more so.. Thinking I'll be alright!", "score": 1, "replies": []}]}]}, {"body": "Last 11 months….", "score": 1, "replies": []}]}, {"body": "Agreed, the biggest reason I don't like oil stocks is that they're all dependent on the price of oil, but none of them have any control over that price.\n\nAnd if you don't have control of your prices then what kind of a moat do you really have?", "score": 4, "replies": []}, {"body": "The volatility though is so damn predictable and it makes for great short term plays. Buy the Dips and sell when it goes up 20%. Rinse and repeat", "score": 3, "replies": []}, {"body": "Every market that matters is manipulated. ![gif](emote|free_emotes_pack|joy)", "score": 3, "replies": []}, {"body": "As opposed to the rest of the market?", "score": -3, "replies": [{"body": "Yes.", "score": 5, "replies": []}]}, {"body": "Manipulated in favor of the oil stocks tho, but yeah you become dependent on those manipulations at current valuations", "score": 1, "replies": []}, {"body": "Bro the stock market is heavily and completely manipulated. It’s all smoke and mirrors and games played against the average human to take advantage of human emotion and behavior", "score": 1, "replies": []}]}, {"body": "Ahhh the free market at work. Beautiful.", "score": 68, "replies": []}, {"body": "Good fuck OPEC and all their bootlickers.", "score": 83, "replies": [{"body": "Saudis Arabia is, and has been, the enemy of the American people.", "score": 67, "replies": [{"body": "[removed]", "score": 13, "replies": [{"body": "Off topic:  Not bringing up stocks or the stockmarket.\n\nAlmost any post related to stocks and investment is welcome on r/Stocks, including pre IPO news, futures & forex related to stocks, and geopolitical or corporate events indicating risks; outside this is offtopic and can be removed.\n\nPosts & comments that are purely political, religious (dealing with morality), or focusing on other types of investments not related to stocks such as real estate, crypto, designing websites, or even selling sneakers will be removed.  An example of what wouldn't get removed:  Discussing real estate when related to the ETF VNQ or real estate bubble affecting the stock market.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 0, "replies": []}]}]}]}, {"body": "I wonder if those Joe Biden “I did that” stickers will pop up all over the place again if the price craters. /s", "score": 23, "replies": [{"body": "True. Although within the presidential debates Biden did say “no more oil” I’m not complaining, as that statement is just not realistic. But why say it in the first place. Then you got people like me questioning what to believe and people that think that “no more oil” is a realistic thing questioning what they voted for", "score": 9, "replies": [{"body": "Because we are burning ourselves alive. \n\nDead dinosaurs are no longer scientifically viable. We do need to leave the carbon in the ground. \n\nI say this as the guy that rode OXY from $28 to $49 and XOM from $40 to $99.", "score": 5, "replies": [{"body": "Yes. But how does lying about decreasing oil consumption/production solve any of that?", "score": 3, "replies": []}, {"body": "Oil is actually dead plankton..", "score": 2, "replies": []}]}]}, {"body": "I'm sure SA will do everything they can to avoid a trade war (flooding the market) until after the election, regardless of who wins.", "score": 1, "replies": []}]}, {"body": "This time they go up against the deep pockets of big oil. US will use the opportunity to fill up SPR.", "score": 7, "replies": []}, {"body": "He did that", "score": 27, "replies": []}, {"body": "Free market lol. Just trying to rug pull people", "score": 7, "replies": []}, {"body": "[deleted]", "score": 42, "replies": [{"body": "They're not the only monarch, UAE, Qatar, Oman are all monarchs/ royal families as well. In fact the majority of GCC is either monarch or monarch adjacent", "score": 48, "replies": [{"body": "[deleted]", "score": -12, "replies": [{"body": "I'm assuming you're either not from MENA or have never visited any GCC country. Not a single rich GCC country is at risk of falling. In fact the royal families are so deeply entrenched into the country that removing the royal family would destroy the country in the process. Any family that is at risk will have the US come and support it.\n\nAlso, and i say this because I used to consult with a B4 in MENA, theres absolutely no way those countries are falling without bringing down the entire world with them. PIF / Mubadala basically funded Silicon Valley and have controlling ownership stakes inultiple large companies across the world. Hell the largest refinery on the US is Saudi owned via Aramco. DP world, UAE GRE, has a controlling share in many important western and eastern ports. These are only a slice of control the GCC have.\n\nAlso, Iran's power is limited due to how important of a strategic ally the GCC is for the US / NATO / Europe. There's alot of anti-GCC stuff on reddit but it'd be foolish to think that the GCC does not have a chokehold on the global economy and the world will protect the GCC to maintain status quo. There's a reason that the US has the largest military base in ME in Qatar. It has alot to do with how important the GCC is to maintain economic stability. E.g. Should the GCC depeg its currency from the USD, the consequences will be disastrous.\n\nEdit: wanted to add ome thing. Whats far more concerning is that the US went uo and said \"War on terror is over\". It's not. ISIS is trying to take over Afghanistan currently. This decade started off weird and is getter weirder", "score": 35, "replies": []}]}]}, {"body": "Electric cars surging sales, especially in Europe and China are going make a big dent in oil demand over the coming years. China is already on track for 1/3rd EV market share this year. Changes are coming.", "score": 32, "replies": [{"body": "Yep. China is going big into EV, as is Europe, USA also have lots of time frames to full convert within the next 10 years.", "score": 3, "replies": [{"body": "In my country (UK) the limit is 3500kg, but that applies to the weight of the vehicle plus the maximum weight it is rated to carry when full. \n\nThe cybertruck would be way over the limit.", "score": 2, "replies": []}]}, {"body": "Lol, what short-sighted dimwit downvoted you?", "score": 9, "replies": [{"body": "No idea, it’s going to happen though, right? Sales will increase every year and demand will start to reduce year on year.", "score": 11, "replies": [{"body": "Not just EVs. Everything will electrify. Heat pump installations surging across Europe since the Ukraine invasion. UK is still 95% gas heated, and heat pumps have just reached cost parity (TCOO advantage) with boilers. No wonder the Emirates are hijacking COP and the Saudis are secretly planning on flooding and the developing world with ICE cars. They're terrified.", "score": 5, "replies": [{"body": "Indeed. I am in the UK and had a heat pump installed recently. \n\nSome of the news coming out of China is truly mind-blowing. \n\nFor instance. A 43GW wind farm. \n\n[https://www.euronews.com/green/2022/10/25/china-is-building-the-worlds-largest-wind-farm-and-it-could-power-13m-homes](https://www.euronews.com/green/2022/10/25/china-is-building-the-worlds-largest-wind-farm-and-it-could-power-13m-homes)\n\n450GW solar and wind project. \n\n[https://renewablesnow.com/news/china-plans-450-gw-of-solar-wind-in-desert-regions-775963/](https://renewablesnow.com/news/china-plans-450-gw-of-solar-wind-in-desert-regions-775963/)\n\nChina is, of course, the number one consumer of fossil fuels, these enormous renewables projects are going to make a dent in usage.", "score": 6, "replies": []}]}]}]}]}]}, {"body": "From my limited understanding after reading this article:\n\n\nOPEC and friends can’t make an unilateral agreement to cut production on OIL to boost prices. Apparently US is producing a nice chunk, which is one cause for the limited impact from OPEC.\n\n\nWhy is people here talking about oil 90+? What did I miss", "score": 4, "replies": [{"body": "Things that could push brent crude above $90:\n- An Iran war or kinetic war with China, or even as simple as a few Tankers get blown up.\n- US shale oil rolls over. There are murmurs of this happening, for eample US production has yet to go above 2019 levels. Also, interestjngly, US light sweet needs to be blended with imported heavy crude to be refined, especially into Diesel.\n- Do the Saudis have the oil production capacity they say they have over the next 5 years? \n- There has been minimal to no investment in developing new production or refining capacity (worldwide) over the last ~10 years, and no statistical evidence for a decline in worldwide oil or gas use. If this trend continues, there will need to be higher oil prices for companies to invest and increase production.\n- A cold northern hemisphere winter.\n\nBrazilian or Venezuelan production won't ramp up fast enough to have much of an effect in the short term.", "score": 10, "replies": []}]}, {"body": "It's weird as they cut production back in April and prices only went up for a few months.", "score": 2, "replies": []}, {"body": "They aren’t trying to raise prices, they just see what’s coming, their price target is 80-85.  Which with the expansion of the money supply makes sense since before COVID it was 60-65", "score": 9, "replies": [{"body": "Nope. Saudi Arabia needs it to be at $85 minimum. Ideally, $90-100. According to the IMF, $81-88 is the price point at which Saudi Arabia can balance its budget.\n\nObviously, they’ll need a little more cash to continue their extravagant trillion dollar projects that are meant to transition the country into a post-war economy.", "score": 40, "replies": [{"body": "Lol like you or anyone knows Saudis actually finances.  Cmon dude.  \n\nThe reality is they know what’s coming and if their balance sheet is bad, so is the rest of the worlds.  This recession is going to be interesting times.", "score": -45, "replies": [{"body": "Erm… it’s really straightforward.\n\nSaudi Arabia gets almost all of its revenue from oil, so calculating revenues will simply be a matter of finding out the number of barrels exported and the price of oil. In addition, we know Saudi Arabia is running a deficit and we know how much that deficit is… considering it just announced it will go on a borrowing spree and take on billions of dollars in new loans.", "score": 35, "replies": [{"body": "Saudi Arabia doesn’t get almost all of its revenue from oil.   It doesn’t even get a majority of it. And that doesn’t count all the private money not even accounted for and they have the richest people on the planet that are also intertwined with the government there.  \n\nSaudi running a deficit okay lol who doesn’t? \n\nIf that’s the case the country in trouble is the US.  And yeh we are in trouble and there is zero political will to do anything about it.  \n\nReserve currencies don’t last forever.  In fact we are on the tail end of what’s normal.  Empires don’t last forever, and it’s clear to anyone that understands history and pays attention, we are a collapsing empire.", "score": -48, "replies": [{"body": "Omg. Such drivel. I don’t even know why you’re talking about the United States, empires, and reserve currencies. Calm down and stick to the topic.", "score": 27, "replies": [{"body": "Because you are the one talking about deficits lol.  You want to talk about unsustainable deficits…America is prime example of an advanced economy with unsustainable deficits.  I’m taking a wild guess you hate Saudi for some reason or another and just being an ideologue.", "score": -36, "replies": [{"body": "Ok continue making assumptions.", "score": 20, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Jobs and markets since 2020.  That’s what you are basing this on?\n\nRemindMe! 1 year “state of us markets and deficits”", "score": -7, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I’m talking about much longer timeframes.  But since you are talking shorter timeframes, give it a year.\n\nTake it easy on the Zeihan, good info, terrible prognosticators and it will turn you into an ideologue.", "score": -1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It’s a decades long process my man. It doesn’t happen overnight.  It’s really clear what’s happening and the fact you are so obsessed with the short term shows your ignorance.  \n\nPeople are looking at our long term bonds for first time in my life and like…no thanks.  Not that there won’t be a blow up in the dollar because of all this dollar denominated debt as other countries look elsewhere in the short term, but after that will be ugly if they don’t want it anymore, and we continue this path this will be the case, it’s not even arguable except by neolibs who think tomorrow will always look like yesterday because they don’t know their history and they don’t want to believe the facts.  All this happens so slow that they just keep convincing themselves otherwise.  \n\nWealth inequality and deficit spending will be the end of America, just line many empires before it.  It takes some real American exceptionalism brain to believe otherwise", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "https://finance.yahoo.com/news/nobody-wants-u-treasury-bonds-165407118.html\n\nToo much supply.  Wake up dude, now I’m just going to block you because I don’t want to spend my Sunday watching football getting into it with ridiculous ideologues that live in alternative realities they want to be true for one reason or another", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I will be messaging you in 1 year on [**2024-12-03 19:35:48 UTC**](http://www.wolframalpha.com/input/?i=2024-12-03%2019:35:48%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/18a09bh/saudi_arabia_is_struggling_to_boost_oil_prices/kbuq4ow/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F18a09bh%2Fsaudi_arabia_is_struggling_to_boost_oil_prices%2Fkbuq4ow%2F%5D%0A%0ARemindMe%21%202024-12-03%2019%3A35%3A48%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2018a09bh)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "How much are they paying you?", "score": 4, "replies": []}]}]}]}]}]}, {"body": "They want the GOP, Trump in particular, to win Presidency.", "score": 5, "replies": [{"body": "If they want that, then it is almost guaranteed that there will be no supply flood. \n\nLow gas prices are a huge domestic political boost.", "score": 1, "replies": []}]}, {"body": "Thats the news I can sleep well with.", "score": 1, "replies": []}, {"body": "Cracks have been forming and funny thing is when oil war erupts generally they pump more to recoup losses.  \n\nYou have to have big balls to trade in oil, equally you need bigger ones to short it.  Saudi does not like people who short oil and frequently take them to the woodshed with no remorse at all.", "score": 0, "replies": []}, {"body": "I'm +80% on XOM as of this week. Crazy to think that could be wiped out in a week. \n\nSuch is the vagaries of commodities. At least it will continue paying a sweet divi.", "score": 1, "replies": []}, {"body": "Opening up Venezuela who has huge oil reserves would naturally decrease oil prices. Now imagine opening up both Iran and Venezuela, oil would be dirt cheap, but we can’t do that because of Freedom and most importantly American oil companies need to survive.", "score": 1, "replies": []}, {"body": "In an alternative timeline if Obama went hardcore on EV adoption and America was at 66% EV, we could tell the Saudis to go fuck themselves at whatever prices they set on oil.", "score": -7, "replies": []}, {"body": "Welcome to the U.S controlling prices instead of market supply and demand which should set the price....", "score": -17, "replies": []}, {"body": "Wouldn't cutting production and rising prices just incentivize higher production outside of opec? Wouldn't it be smarter to flood the market and make it where it's not profitable to produce oil for the competition and price them out?", "score": 1, "replies": [{"body": "Correct. USA oil production in September set a new all time high.\n\nUS producers make good money if oil is over $70.", "score": 5, "replies": []}]}, {"body": "why is brent oil so relevant as a benchmark? I mean europe isnt exactly a major player in oil production", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "How has that anything to do with a type of cruide oil found in the North Sea?", "score": 1, "replies": []}]}]}, {"body": "When oil prices go down, are more stocks bought or sold?", "score": 1, "replies": []}, {"body": "The point I take home from this is that the ***US*** is the leading producer of crude oil in the world?  IS that right?  \nWhere are these oil fields?", "score": 1, "replies": [{"body": "Thirty-two states in the US produce oil.  Texas alone is the fourth largest producer in the world.", "score": 2, "replies": []}]}, {"body": "I love when a family owns an entire country still.", "score": 1, "replies": []}, {"body": "If oil prices drop it should mean more gas in the tank and more money saved right? Why do people make it out to be bad thing?", "score": 1, "replies": []}]}
