{"title": "$TSLA Daily Investor Discussion - July 28, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "citt3h", "created_utc": 1564305440.0, "score": 13, "upvote_ratio": 0.93, "num_comments": 60, "comments": [{"body": "If a dem gets elected I feel like any movement toward green policies would be a massive Tesla boost. Batteries, solar, EVs.", "score": 12, "replies": [{"body": "If Tesla gets price of batteries down just a little bit then it's just a matter of time before they win over ICE by having an absolute price advantage, non-subsidized.  That would be huge.  If they can only do it through subsidies then it's less compelling.  As an investor I also worry the subsidies will favor the late entrants and reward inefficiencies.\n\nI think the best thing that can happen regulation wise isn't any sort of subsidy but just level the playing field.  All those anti solar laws, and EV taxes non proportional to lost gas tax are just ludicrous.  Not wanting to subsidize solar is one thing, trying to prevent private parties from buying it and building it is just nuts.", "score": 6, "replies": [{"body": "If only US consumers paid for gas what it’s actually worth it would be a game changer...", "score": 5, "replies": [{"body": "Yep.  Carbon pricing with a direct dividend to citizens.  Most pollution is done by a few and there's no real existing market mechanism to have polluters price in their externalities that we still pay the cost for....", "score": 1, "replies": []}]}]}, {"body": "If only the dems had a candidate with a chance...", "score": -1, "replies": [{"body": "They have plenty", "score": 5, "replies": [{"body": "Like?", "score": 2, "replies": [{"body": "You’re in the wrong sub for a political debate", "score": 18, "replies": [{"body": "I'm not trying to debate lol, the sub is clearly dead today, you brought up a point about dems helping Tesla. I want this to be true, I'm on your side here. Unfortunately, I don't see how that happens, and I'm asking you for your opinion.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Lol I said people with a chance not the person you want. (I want him too btw) :(", "score": 6, "replies": []}]}]}]}, {"body": "Your first comment I agree with 100%. \n\nBased on current DNC line up, Trump is likely to waltz right to a second term unfortunately.", "score": 4, "replies": [{"body": "Not exactly sure why I'm being downvoted for my comments here. I think Trump is terrible just like the next guy, doesn't mean he's not the front-runner to win. Either people here misunderstood me or we have some Trump-loving lurkers.", "score": 3, "replies": [{"body": "Nah I think people just haven’t looked at the head to heads in polls/betting markets and assume that because Trump is a buffoon anyone could beat him. Doesn’t look like it’ll be that easy.\n\nAlso I think like half this sub is younger than 30 and lives on the west coast US/Canada.", "score": 5, "replies": [{"body": ">Also I think like half this sub is younger than 30 and lives on the west coast US/Canada.\n\nLol if only more of this demographic lived in states that could make a difference. The electoral college is joke but it's the joke we have to understand and work with.", "score": 3, "replies": []}, {"body": "> Also I think like half this sub is younger than 30 and lives on the west coast US/Canada.\n\n*checks pantry*\n\n*finds maple syrup*\n\nYep, you got me!", "score": 1, "replies": []}]}]}]}]}, {"body": "Trump is a Tesla fan and actually owns two", "score": 1, "replies": [{"body": "That may well be, Trumps climate change disbelief will not further any green policies though.", "score": 3, "replies": []}]}]}, {"body": "So anyone expecting a drop tomorrow due to the SEC limit on shorting now have been expired?", "score": 11, "replies": [{"body": "Wild swings during pre-hours, one or two % drop 1 hour after opening, closing the day green, no change during after-hours.", "score": 8, "replies": [{"body": " That’s very Suspiciously Specific", "score": 7, "replies": [{"body": "Looks like we've got a market maker over here...", "score": 1, "replies": []}, {"body": "Close. The bottom was less than 1% down and the $5 swing during pre-hours wasn't that wild.", "score": 1, "replies": []}]}]}, {"body": "Could be possible. However, I decided to buy a bulk at $227 at friday, which I am happy about. Still prepared to DCA additional accumulation if the price continues down.", "score": 4, "replies": []}, {"body": "As I said in another post, Closed on Friday in overbought territory based on RSI. Tomorrow will be interesting to say the least.", "score": 5, "replies": []}, {"body": "Bought puts counting on it. Shorts covered 2-4M shares before earnings, they’ll be looking to re-open their positions now that the bear case is stronger.\n\nWouldn’t be surprised to see a flood of CNBC hit pieces this week or another Consumer Reports article either.", "score": 2, "replies": []}, {"body": "Definately, the stock dropped in one massive whallop. I feel as though the news hasn't been absorbed; could well see it hit 210 or so.", "score": 4, "replies": [{"body": "The report is arguably better than the headlines. Cashflow, GM and cash position put Tesla in a comfortable place.", "score": 5, "replies": [{"body": "True. That said, if the past is anything to go by the stock doesn't respond to reason, it responds to headlines. Perhaps the lesson has been learnt, but it not it will probably drop.", "score": 4, "replies": [{"body": "> ...doesn't respond to reason, it responds to headlines. Perhaps the lesson has been learnt...\n\nDon't forget tweets!", "score": 1, "replies": []}]}, {"body": "And that CapEx/research spend being down sequentially, wow! Everyone knows that startups do best when choking off those expenses. No reason to think that the finances were engineered to give at least one good metric.", "score": 4, "replies": [{"body": "That’s quite the pivot now that your argument has failed.  Tesla is doing more with less, exactly what shareholders want to see.  What project do you think is being checked off by Tesla?", "score": 4, "replies": [{"body": "Do you actually think the current level of R&D and capital expenditures is enough to:\n\n1. Maintain their existing factory and build out the China factory\n2. Update/refresh the S&X in a meaningful way\n3. Start production of the Y \n4. Actually introduce Solar Roof \n\nRoadster and Semi were once 2020 projects but I think those have been delayed indefinitely.\n\nEdit: Forgot about the elephant in the room: FSD also has to fit in that R&D budget.", "score": 8, "replies": [{"body": "Why do you assume that R&D and CapEx will stay at the current level?  Tesla raised 2 Billion $US, and secured another 2 Billion Euro (about 2.3 Billion $US) over the next few years in its deal with FCA for carbon credit pooling, according to Financial Times.\n\nI don't think Tesla intends to let that cash sit in a Money Market account.", "score": 7, "replies": [{"body": "I don’t think it will. I think if Tesla wants to deliver on all its promises, capex and R&D spend will have to go up in a big way. \n\nThe FCA money is likely overstated by the FT. Sure didn’t show up this quarter... \n\nThe quote about 2 billion euro in credits was from Fiat’s conference call. It referred to all their credit spending, not just what they’re buying from Tesla. You don’t have to go to the FT. Just check out their transcripts.", "score": 1, "replies": []}]}, {"body": "1. GF3 is happening bc China is going to make it happen, period.\n2. S & X are overblown.  As Musk said in the call over time they will make a lower lower percentage of total sales (he mentioned 4% of the total sales once Y has ramped up). 3, Y, and the pickup are the future.\n3. Y is going to benefit from being 75% the same as M3.\n4. Who cares about the solar roof.  Powerwall and Powerpack sales were up huge.  If solar gets better great, if it does not, who cares...\n\nMy guess is that roadster and semi are waiting for maxwell battery improvements\n\nEdit: Musk said during autonomy day something like that FSD was basically everything, so yeah money will clearly be earmarked for FSD, or rather prioritized, FSD would never be put on the back burner bc FSD plays a crucial part in masterplan part 2.", "score": 4, "replies": [{"body": "1. I never doubted that it is going to happen, it was just in the list of things that have to be paid for/things that are included in capex.\n\n2. K. You can pretend that S/X are overblown because Musk said so. Do you not think that the decline in S/X sales and the return to losses are at least partially related?\n\n3. K. Setting up the lines still costs money, and again, just another thing that has to fit in the ~$250MM capex budget this quarter.\n\n4. Again, just another thing that has to fit in the R&D budget (down 16% from same quarter last year). I responded to someone who asked \"What project do you think is being checked off by Tesla?\" Who knows, but I really doubt all this stuff is fitting perfectly in their declining budget. \n\n>My guess is that roadster and semi are waiting for maxwell battery improvements\n\nMy hunch is that Roadster and Semi are just marketing at this point because bringing them to market would cost too much and yield too little. ROI on the Y has to be muuuuuuch higher.", "score": 1, "replies": [{"body": "1) sure yeah it has to be included\n\n2) S/X do not matter in grand scheme.  Cash flow is king at this point in time.  I do not expect Tesla to be profitable for the next 4 quarters.  I do expect them to be cash flow positive however.\n\n3) I do not think they will be doing much with setting up the Y lines this quarter, that strain will come in Q1 and Q2 in 2020\n\n4) Solar roof if I had to guess is way back on the back burner. \n\nRoadster is basically marketing yeah, marketing that electric is superior to gas.  Semi will have a legitimate role to play at some point but the batteries need to get better first, so I do not expect too much capex thrown into the semi or the roadster.\n\nGF3, FSD, Improving the batteries -- those are the priorities and where I would guess the majority of Q3 capex will be deployed.", "score": 3, "replies": []}, {"body": "The answer is they will spend what they need to, when they need to, with China and Model Y being the priority..\n\nCapex has to happen to build new production facilities.... in a timely fashion...\n\nFor R&D there are always different budgets and different priorities, Model Y, FSD and Cell production are the priorities. Budgets are not just limited by money also the availability of quality talent,  sometimes it is better to have a narrow focus. \n\nSo less critical R&D can happen when resources permit, and closer to when a new  or updated product can actually be produced. Nothing the competition is currently doing suggests an urgent need for more R&D.", "score": 1, "replies": []}, {"body": "Yep. Y is much more important and gives them plenty to do with a likely doubling or more of their sales volume. It's also super exciting that they have semi and roadster and other products in the pipeline. Great time to be a Tesla shareholder.", "score": 1, "replies": []}]}]}, {"body": "Yes to all, when they need to spend more they will. Roadster and Semi will come once be battery production comes online from maxwell. Until then they are constraint by battery supply.   \n\nCan you cite any reason to doubt that the China GF is impacted at all?  All evidence points to it being the fastest made car factory in history.", "score": 2, "replies": [{"body": "No I don’t think the China factory has been impacted. It’s in their capex number. But I do think Tesla likely has some deferred maintenance building up at its other facilities given how much capex has dropped (and it remains well under D&A expense).", "score": 5, "replies": [{"body": "I’m sure capex will pick up when they start tooling for Y.  But capex was specifically called out by the CFO as this being the new normal. Must be frustrating when you’re short and the company becomes more efficient.", "score": 2, "replies": [{"body": ">But capex was specifically called out by the CFO as this being the new normal. Must be frustrating when you’re short and the company becomes more efficient.\n\nI mean, okay, this is kind of what the CFO of every good short has ever said about declining capex.\n\nCompanies will always describe doing less with less as doing the same (or more) with less.", "score": 4, "replies": []}]}]}]}, {"body": "I for one welcome the new goalpost... it keeps the discussions fresh", "score": 2, "replies": [{"body": "Same. I got tired of talking about GAAP net income so I’m glad Tesla decided that it wasn’t going to really try to be profitable in all quarters going forward any more.\n\nTesla picked a few new goal posts including “continuous volume growth, capacity expansion and cash generation.”", "score": 6, "replies": []}]}]}]}]}]}]}, {"body": "It’s a possibility", "score": 1, "replies": []}]}, {"body": "Anyone have a clue what margin Panasonic might be making on their cell supply to Tesla? If say Tesla had somehow acquired the Panasonic manufacturing at GF1 in Q1, I wonder whether the additional margin would have made a break-even or profit within Q2?", "score": 2, "replies": [{"body": "I think Panasonic stated in their Q1 update letter that they are losing money on their Gigafactory investment.", "score": 4, "replies": [{"body": "I imagine their pricing was based on them running near 35 GWh/yr. At that time they were in the low 20s. Being near 28 as they said on the conference call may mean they are doing better now.", "score": 2, "replies": []}, {"body": "Right makes sense why no one's really talking about then if the answer is it would have put Tesla even more in the red. Wonder how much if any participation Panasonic will have with battery investor day.", "score": 1, "replies": []}, {"body": "If they’re losing money they should give it over to tesla for free", "score": -13, "replies": []}]}]}, {"body": "*crickets*", "score": 1, "replies": [{"body": "_croak_", "score": 2, "replies": []}]}, {"body": "Looking at last 2 years when they had as big or bigger losses the stock went to 350+ as it seems every time for 2 years, 2019 is first time the stock stopped behaving this way, because model 3 doesn't excite and doesnt seem to show any promise of heaven on earth anymore?  \nWonder if model Y or other models will affect the stock the same way looming model 3 launch + production hell had.", "score": 0, "replies": [{"body": "The promises were:\n\n* 10,000/week Model 3s\n\n* Sold at $35,000\n\n* With a $7,500 tax credit\n\n* That were capable of FSD\n\n* Produced in a highly autonomated \"alien dreadnaught.\"\n\n* And highly integrated with Solar City\n\nI believe those were the promises that kept the stock high.\n\nNow the promises are:\n\n* 10,000/week Model 3s (edit - and Model Ys)\n\n* Sold at ?\n\n* Without tax credits\n\n* Creating a robotaxi fleet\n\n* Produced in China\n\n* Taking advantage of Maxwell's technology\n\n* And the Boring company integration\n\nI think those are the main differences?\n\nEdit - 10,000/week, not month", "score": 7, "replies": [{"body": "Pretty much.\nI see Model Y, china factory and pickup as major stock movers in the near future. Last years were M3 hype for sure that is now dead.", "score": 5, "replies": [{"body": "Even if they arrive at those numbers now what hurt them is that reaching those numbers was delayed by almost a year. If people value Tesla as a growth company then that is a big deal. It's still solid growth, but not at the pace that was anticipated back when the stock was at $360+.", "score": 1, "replies": [{"body": "I suppose nobody saw any hurdles with Elons promises, now they're smarter ;). We will all get to see how fast Model Y ramps up and it should be a lot faster. Lets see how much demand M3 & MY will share.", "score": 2, "replies": [{"body": "The main issue is that there's neither time nor money to rebuild Fremont from scratch with all they've learned. The dude in [this post](https://old.reddit.com/r/teslainvestorsclub/comments/chqa2x/why_this_tesla_analyst_remains_bullish_despite/) pointed this out as well.\n\nGF3 is a clean slate which should help out substantially.  \nHow they're going to realize Y in Fremont is anybody's guess. There was that new machine that they got but without being a manufacturing expert or seeing the complete lines that doesn't really tell us much.", "score": 1, "replies": [{"body": "It'd be stupid to do model Y if you could just get 1-2 lines total? I mean, is it possible they could do that for freemont and then make some lines in GF3? New Tent? ^^ I'm excited all the same, M3 hype have been dead since around start of winter last year(for me), new things cooking now.", "score": 2, "replies": []}]}]}]}]}]}]}]}
