{"title": "Just a reminder, WMT beats the S&P index during recessions.", "selftext": "We see articles and comments from WMT management that wealthier families are showing up at WMT. This is a pattern we have heard before: 2001 and 2008. WMT outperformed massively 2001-2003, then underperformed through early 2008. Then exploded on a relative basis (fell a lot less) through mid-2009. \n\nIf you want to stay in the market, WMT is a safe bet to beat the index for the next year or two.", "id": "z7zzvp", "created_utc": 1669742361.0, "score": 2, "upvote_ratio": 0.53, "num_comments": 39, "comments": [{"body": "It does until it doesn’t.", "score": 13, "replies": []}, {"body": "Just a reminder, past performance does not always equal future. It works until it doesn’t.", "score": 11, "replies": []}, {"body": "WMT is ridiculously overvalued.\nWhat justifies its multiple of 47?", "score": 22, "replies": [{"body": "That’s a terrible P/E ratio, wow", "score": 5, "replies": []}, {"body": "Customers", "score": 3, "replies": [{"body": "That’s factored into their income statement, which I repeat, is 1/47th of their valuation.", "score": 6, "replies": []}]}]}, {"body": "I just checked the chart and thought “wow this looks like an amazing set up for a put” thanks OP", "score": 6, "replies": [{"body": "Everyone that don’t know anything about finance and stocks just look at the graph and think about a mean reverting scenario. Welcome to the club!", "score": 3, "replies": []}]}, {"body": "Isn’t it before online shopping boom?", "score": 3, "replies": [{"body": "And prime delivery.", "score": 2, "replies": []}]}, {"body": "WalMart is a blue-chip value & consumer staples, and blue-chip value/ consumer staples tends to hold up better in recessions. \n\nit's nothing special about WalMart per se, it's just that type of stock will lag during bull markets but perform Ok during downturns.", "score": 3, "replies": [{"body": "Yea, but with that P/E there no value.", "score": 1, "replies": []}]}, {"body": "Just a reminder: you’re posting this after money has poured in. If you’re trying to swing trade, that’s not a great way to do it.", "score": 3, "replies": []}, {"body": "I mean in certain cases cash beats the index too. Doesn’t mean it’s the best investment. WMT is a solid recession holding, but I would be cautious being to confident that it will perform the same as it did in the early and mid 2000s", "score": 9, "replies": [{"body": "I agree cash could be better, which is why I had the caveat \"...if you want to stay in the market...\"", "score": -5, "replies": [{"body": "My point is that it’s facetious. You know the timeframe so it’s easy to say something outperformed in this window. In reality it’s much more difficult to enter and exit position timed with a recession and there is no guarantee Walmart will perform as well as it has previously in a recession. It is not a safe bet if you want to stay in the market. It is a recession idea and not one the average investor should be organizing their portfolio around just to try and time a recession", "score": 7, "replies": []}, {"body": "You should always stay in the market and dollar cost average .....", "score": 1, "replies": []}]}]}, {"body": "In 09 they sold for $50 and earned about $3.50/sh, for an earnings yield of 7%. Paid a 2% dividend.\n\nIn 22 (TTM) they currently sell for $150 and earned $3.25/sh, for an earnings yield of 2.1%. Paid a 1.5% dividend.\n\nRevenue has grown 2.8% annually since 2009. After inflation this is negative growth. Net income is flat between 2009 and 2022, and down 33% against 2022 TTM. After inflation this is *very* negative growth.\n\nRemember the 1980's? Kmart, Sears Roebuck and JC Penney used to be wonderful companies, too.", "score": 3, "replies": [{"body": "What were the earnings yields and dividends on all the tech stocks people in this subreddit bought in 2021?", "score": 0, "replies": [{"body": "All the tech stocks is too vague to answer.  If your point is they were generally terrible prices to pay, I wouldn't disagree.\n\nThat doesn't say anything about Walmart's value vs price. Lots of companies are trading far too dear lately. I don't want \"less awful\". I want a great bargain.", "score": 1, "replies": []}]}]}, {"body": "How is this different than timing the market?\n\nHow do you know when to sell current stuff and buy WMT? How do you know when to no longer buy WMT and hold? How do you know when to sell WMT so you avoid post recession under performance?\n\nJust buy your regular stuff and carry on. You won’t know when the recession starts or ends", "score": 1, "replies": []}, {"body": "Specific sectors outperform general market during recessions; that is well known (and proven). WMT belongs to consumer staples, however other companies in the sector are also an option in that case and I’d argue that there are currently much better buys than WMT.", "score": 1, "replies": [{"body": "What’s a better buy than WMT at the moment ?", "score": 2, "replies": [{"body": "Home Depot for instance", "score": 1, "replies": [{"body": "I’m not a big fan of WMT to be honest but I question HDs earnings during a prolonged economic downturn", "score": 2, "replies": []}, {"body": "Home Depot is categorized as consumer discretionary. It’s sensitive to home building and home repair activities, each of which are associated with macro conditions. It’s -22% YTD, vs the S&P 500 being -17% YTD. \n\nI’m saying this to correct the thinking about how it should be expected to perform relative to the market in set conditions, rather than to say that I think it’s a bad investment. Point of fact: I don’t chase momentum. I prefer to establish long positions in profitable, high margin businesses while they’re down. I would rather buy HD than WMT right now.", "score": 2, "replies": [{"body": "Take a look at UNH. I'm up 56% in 1.8 years.", "score": 1, "replies": [{"body": "We know.", "score": 1, "replies": [{"body": "Ok. Just trying to help.", "score": 1, "replies": [{"body": "I believe that you are. You seem like a kind person, based on the many posts and comments I’ve seen from you. \n\nHere’s the thing: there’s no guarantee that a stock will continue to perform as it has been. Stocks go on runs, trade sideways, dip, dive, etc. UNH has had relatively consistent revenue growth and net income over the past 3 quarters. If they continued to post the same level of earnings, the stock could trade flat for a bit, or dip. \n\nThough I appreciate your intent, it’s not a value point for others that you’re up X over Y timeframe.", "score": 1, "replies": [{"body": "My point is that a lot of younger people put most of their portfolio in DDOG or CVNA or whatever.\n\nPeople don't realize that the old tried and true blue chips, especially in these times, is where you should put more weight, rather than only tech.\n\nMy portfolio is down 25% from ath and I've heard of people that are down 50% to 80%.\n\nActually for a long term portfolio 95% of people here should just be buying VTI..... myself included of course.\n\nHopefully those people have small portfolios.\n\nThe most important thing in investing is RISK management and asset allocation.\n\nIf you want to fool with individual securities, keep it under 20% or so and keep under 20 positions. At least that's how I'm comfortable after 3 years of investing now.", "score": 1, "replies": []}]}]}]}]}, {"body": "Which other profitable, high margin businesses do you currently own/looking to acquire if possible?", "score": 1, "replies": [{"body": "I sold out of all picked stocks to move everything into VTI (which had already been about 75% of my portfolio) before the downturn. I bought JPM on the way down at $120/share, and built a large GOOG position at $102. \n\nMy only other current pick doesn’t fit that model. I added a small PLTR position because I appreciate their participation in the Ukraine and some other efforts, and I believe in the product. I’m in it at $8/share, and have no expectation or care around returns from that one. If anything, I expect it to stay range bound for a few years. \n\nThere are others I would add at the right prices.", "score": 2, "replies": []}]}]}]}, {"body": ">What’s a better buy than WMT at the moment ?\n\n6 month or 1 year Treasuries...\n\nCreeping up on a What-Me-Worry 5%.", "score": 1, "replies": []}]}]}, {"body": "whats WMT", "score": -4, "replies": [{"body": "A self-interested company.", "score": 6, "replies": []}]}, {"body": "There likely won't be a recession.  Media is loving to suggest that for clicks, but the data says otherwise.", "score": -5, "replies": []}, {"body": "So doesn't UNH COST .....", "score": 1, "replies": []}, {"body": ">\"WMT beats the S&P index during recessions\"\n\nFixed that for you.\n\nWMT has in the past beat the S&P during recessions.", "score": 1, "replies": []}]}
{"title": "Tesla China delivered 16,121 domestic vehicles in the 4th week of November — for a total sum of 55,612 local deliveries over the past 4 weeks. To illustrate how impressive this number is — I've charted ('21-22) 🇨🇳 domestic sales for the 2nd month of the quarter - Mathias Føns on Twitter", "selftext": "", "id": "z7t41h", "created_utc": 1669725993.0, "score": 119, "upvote_ratio": 0.95, "num_comments": 42, "comments": [{"body": "Just wait until the \"China Car\" that goes for <$30,000USD.", "score": 29, "replies": [{"body": "Those launches are happening right now:\n\n* BYD Seal\n* Leap C01\n* Neta S\n* Changan SL03\n* Aion S Plus\n* Geometry G6\n\nMost of these start at around $28,000. The [Geometry G6](https://www.youtube.com/watch?v=bkeBgj6FO-Y) starts closer to $20K. All of 'em are quite formidable, and will be putting considerable pricing pressure on Tesla.", "score": 12, "replies": [{"body": "Those prices are after subsidies, careful.", "score": 13, "replies": [{"body": "The subsidies are mostly immaterial within the context (<$30k) of this conversation. They're around $1,500, so most models ballparking $28K base would still be at or under $30k even without the subsidy. Offerings like the Geometry G6 [definitely would be](https://cnevpost.com/2022/11/08/geometry-two-new-models-with-huawei-harmonyos/).", "score": 4, "replies": []}]}, {"body": "Are these all BEV?", "score": 3, "replies": [{"body": "Yes.", "score": 3, "replies": []}]}, {"body": "Given these prices, they are irrelevant to Tesla. The Chinese who buy Teslas are luxury car buyers. They won’t even think of buying a cheaper model instead.", "score": 5, "replies": [{"body": "Not if they can no longer afford it. More and more middle class are undergoing financial difficulties as the Covid restrictions persisits", "score": 3, "replies": [{"body": "Most of them rather be dead than be seen in a cheap Chinese made car. If they have cashflow issues, they will just not buy a car, will keep the old Mercedes for now.", "score": 1, "replies": [{"body": "Clearly you don’t live in China and knows nothing about their middle class.", "score": 1, "replies": [{"body": "Clearly that.", "score": 1, "replies": []}, {"body": "That is actually a thing per Serpentza on YouTube. Chinese autos have a bad reputation in China.", "score": 1, "replies": [{"body": "Not necessarily based on byd sale number and the fact that they are raising prices", "score": 2, "replies": []}, {"body": "To be honest the YouTuber you mentioned are referring to a situation 10 years ago.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Amazing news!", "score": 8, "replies": []}, {"body": "But, but....Someone told me the demand had disappeared in China?\n\nYou mean someone ***lied?***", "score": 32, "replies": [{"body": "This is after the huge price cut", "score": 3, "replies": []}, {"body": "Come on now. They wouldn't have dropped the price if it wasn't for demand being lighter.", "score": 10, "replies": [{"body": "Wasn’t there also a price ceiling they were trying to get under so rebates would apply?", "score": 9, "replies": []}, {"body": "Yes, but the general tenor of the comments was that the price drop hadn't worked and they'd need more.", "score": 16, "replies": [{"body": "Gotcha. I didn't notice that as much myself.", "score": 1, "replies": []}]}, {"body": "Not necessarily demand being lighter, just demand being less than supply. They had a big supply increase with the factory upgrades this summer, so even if demand stayed the same or moderately increased, they'd need to drop prices to match supply.", "score": 1, "replies": [{"body": "I agree but we're pretty close to discussing semantics here.", "score": 2, "replies": [{"body": "I think it's important to understand that demand hasn't necessarily decreased in China.", "score": 3, "replies": [{"body": "From memory, it did seem like sale numbers were heading down unrelated to production but I'd have to check. In any case I get your point and I agree with that the difference is relevant, just not sure if that was exactly the case here. Cheers!", "score": 2, "replies": [{"body": "The price drop happened at the beginning of Q4, and Q3 was the highest number of deliveries in China ever, so I don't think so.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Stock says “meh”", "score": 8, "replies": [{"body": "Stock often doesn’t respond until weeks-years later.", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "One weeks worth of domestic China sales isn't some big insider secret that people could leak and make moves on.", "score": 2, "replies": []}]}]}]}, {"body": "Now it will be nice to see the split between exported and domestic, I have a feeling that we might be in for a surprise (95k production for November)", "score": 7, "replies": [{"body": "> Now it will be nice to see the split between exported and domestic\n\n- **All** of these are domestic deliveries: these are Chinese new Tesla auto insurance registrations, which only happen for local deliveries, not exports.\n- Tesla stopped loading ships in Shanghai more than a week ago, they are doing Chinese local production for much of the rest of the quarter.", "score": 18, "replies": [{"body": "37 ships (record by 12 ships - 2 if which where from Fremont S/X to EU.", "score": 10, "replies": []}, {"body": "Will be interesting to see when they start loading the next batch of ships for Q1 2023 deliveries. Does it begin in the end of December (which would indicate they’re continuing to unwind the wave)? \n\nMaybe with strong China demand they will be able to deliver many vehicles domestically. We’ll see", "score": 2, "replies": []}]}, {"body": "They will be probably sending less cars to Europe now that Berlin is ramping up. This frees up some more for domestic sales.", "score": 3, "replies": []}]}, {"body": "NoDeMaND riiiiiiiiiiiiiiiiiiiiiiiiiui", "score": 5, "replies": []}, {"body": "if i was troyteslike, i'd be buying puts, then lowballing and after a while buy calls and post big gains!", "score": 2, "replies": []}, {"body": "[deleted]", "score": -15, "replies": [{"body": "These *are* sales - 16.1k deliveries last week which is tremendous! :)\n\nThat’s an annual rate of 832k sales *in China alone*", "score": 15, "replies": []}, {"body": "Well they didn’t give them away", "score": 5, "replies": []}, {"body": "What tax rebate in January? The one in the US?", "score": 5, "replies": [{"body": "Yes", "score": -5, "replies": [{"body": "The Shanghai cars do not ship to the US.", "score": 3, "replies": []}]}]}, {"body": "These are vehicles delivered which means they are sold to the customer.", "score": 4, "replies": []}]}]}
{"title": "An idiot's attempt at Gamma Scalping - help me understand why this isn't sustainable.", "selftext": "After reading a bit about the strategy of gamma scalping to curtail losses on option positions, I decided I would just do some hands-on learning with a ToS Paper Account.  \nFrom my understanding, Gamma Scalping limits the max potential gain of a position, with a trade-off of also limiting the downside.  This concept makes sense to me, as we short/long the underlying depending on how gamma is moving against us.  \n  \nTo test this, I opened various positions, listed below:  \n* Short Strangle - DIS  \n* Short Strangle - SQ  \n* Short Strangle - TSLA  \n* Long Straddle - COIN  \n* Short Straddle - WYNN  \n* Short Straddle - AAPL  \n  \nI managed the positions every 24 hours by neutralizing Gamma back to 0 from a short/long position of the underlying.  \nMy initial Capital Requirement was $12,800.  \nMy ending Capital Requirement was $29,600.  \nMy profit after 17 days is $4,738.  \n  \nAt the end, 5 of the 6 positions closed for a win. WYNN (short straddle) is currently my only loss, though that position has not yet closed and I am still managing it to see how it plays out.  \n  \nHere is a link to a screenshot of the opening positions and positions as of today: [https://imgur.com/a/GDl3vaL](https://imgur.com/a/GDl3vaL)  \n  \nMy question here is, though in theory gamma scalping every day should've whittled down my overall net gain per position, in practice is at least appears to have put me ahead of where I would've been otherwise?  Is my understanding here correct, and when would this strategy go against me, in comparison to simply managing the straddle/strangle in the *usual* fashion of inverting or closing for a loss?", "id": "z85ukr", "created_utc": 1669755284.0, "score": 89, "upvote_ratio": 0.94, "num_comments": 41, "comments": [{"body": "For what it's worth, be careful with TOS paper trading accounts on scalping or short duration trades. My experience with it gave me very generous fills that usually wouldn't happen with my actual broker. This made it so I was getting in a great prices and very quickly being able to get out at great prices. It definitely skewed my results by essentially winning on both sides of the trade.", "score": 95, "replies": [{"body": "This right here. I've had quite a few options strategies that did great on their paper trading but crashed and burned with live trading.\n\nThe TOS paper trading fills for options are not an accurate representation of reality, especially with scalping.", "score": 35, "replies": [{"body": "Thanks for the heads up, I'm going to do a run in my real account and will report back with that as well.", "score": 26, "replies": [{"body": "Please do. It looks like an interesting plan and I'm tired of reading a dozen posts a week about cash secured puts and the wheel", "score": 47, "replies": [{"body": "I mean, I like the wheel, but I also like to learn about other strategies.", "score": 3, "replies": [{"body": "~~Hey, Kid. Can I interest you in the STAG WHEEL?~~", "score": 2, "replies": [{"body": "I'm interested in learning, but if it's naked selling, I'm only ever going to be curious about it.", "score": 1, "replies": [{"body": "It was merely a jest. A year or two ago u/racefapery ENTHUSIASTICALLY posted on this sub. No idea what he's been up to since.", "score": 2, "replies": [{"body": "Never forget the STAG WHEEL. It’s my PROPRIETARY wheel strategy that guarantees SERIOUSLY TREASONOUS AMOUNTS OF GAINS.\n\nSince my last update I’ve been absolutely DESTROYING it at STAG wheeling, not much to post about since I’m just kind of accumulating shares right now, but expect a pretty epic update when the market turns around, maybe even a little sooner since I’ve more than doubled my position with the help of the STAG wheel", "score": 6, "replies": []}]}]}]}]}]}]}]}, {"body": "You are absolutely correct....TOS paper is terrible at giving accurate results as it doesnt use to the second live data and it gives extremely generous fills...at prices unlikely in the actual market....IKBR is a bit more complicated but gives you to the second data (which means your options prices are current to the market) and your fills are much more accurate....IKBR is perfect for paper trading!", "score": 10, "replies": []}, {"body": "One hundred percent agree. Paper trading is not like the real deal. The market makers will not fill at your price. Only theirs.😉🍷", "score": 9, "replies": []}, {"body": "Yes, I have also noticed that the ToS papermoney side is very weird on options pricing and you absolutely should not test things like options scalping with it.", "score": 0, "replies": []}]}, {"body": "You basically have it right. The strat goes against you when RV > IV. For the short premium positions when you neutralize, you're buying high and selling low. If the stock moves around a lot up and down it's possible you lose more money by neutralizing than what you made from option decay. Opposite is true for the long premium. You're buying low and selling high and hoping you can beat out theta. \n\nI think its also important to note that neutralizing isn't without cost. Although most brokers have no commissions on stock trades, you're still paying for the neutralization via the bid-ask spread. Paper trading doesn't reflect this well. \n\nTLDR: You're right. Neutralizing makes the trade basically entirely dependent on volatility as opposed to direction.", "score": 25, "replies": [{"body": "It would be awesome if we could see a breakdown of profit potential between delta gamma theta.", "score": 5, "replies": [{"body": "I mean it's pretty much impossible because of the unknown. There's a lot of path dependence on stock movements. You could sell a strangle that gives you a 5% range to profit. But if the stock moves up and down by 1% constantly and you're trying to neutralize your directional exposure you can lose money if it jumps up and down enough. You were right on your strangle assumption that the stock would be range bound but still lost money.", "score": 3, "replies": [{"body": "OP screenshot shows some. Haven’t looked into it further. \n\n\nGoal just to see if you’re profiting vega or gamma", "score": 1, "replies": []}]}, {"body": "In theory, Gamma theta P&L IS delta P&L (I.e. 0 initial delta p&l) if you hedge the initial deltas and then hedge continuously (no friction).\n\nIn practice, it depends on your hedging strategy.  In FullMetal373 example, if the stock is moving between up 1% and down 1% let’s say like a sine wave, your hedging interval could coincidentally be always when the stock is unchanged and your P&L from hedges is 0. But it could also coincidentally be when the high and low occur and you be losing a lot from buying when it is up 1% and selling when it is down 1%.\n\nThis is pretty much also why retail is generally better off selling vol than buying because they are almost always underutilizing gamma potential if they hold for a significant period of time. Of course, with an unexpected explosive move this doesn’t hold.", "score": 2, "replies": []}]}, {"body": "I think the biggest surprise to me was that the Long Straddle performed the best.  Up until this point, I've never employed a Long Straddle (even in my real option account).  The strategy itself seems too risky (hoping the stock moves outside your loss range is counterintuitive for me), but the gamma scalping really seemed to pay dividends here while the position waited for a big move.", "score": 3, "replies": [{"body": "I think at a high level buying or selling options amounts to a \"battle\" between gamma and theta. With the long straddle the gamma scalping is an attempt to offset or overcome the decay. \n\nGenerally though, long vol positions are negative expectancy. Also in an ideal world, you'd be able to do the scalping continuously with little to no transaction cost. If you're only neutralizing at the end of the day, there is some timing dependency.", "score": 1, "replies": []}]}]}, {"body": "It's good that you're experimenting and such, couple of comments:\n\nActual gamma scalping is something different than what you mostly show here.  For the most part you seem to be doing static delta hedging of theta trades which is sort of reverse gamma scalping.  In theory, delta hedging tightens the spread of returns and should lead to more consistency over time.  It's normally used on more commission and slippage friendly trades like SPX with /ES or such.  Cheaper underlyings are normally just left to run their course and the portfolio is \"hedged\" by skewing new position deltas to keep the overall delta flat.  That is, if your straddle goes -delta, your next trade might be a jade lizard.\n\nThe long COIN straddle would bring in positive gamma.  If you're trying to eliminate gamma then you're kind of creating a gamma \"pairs trade\" here where you hope COIN has a bigger than expected move and that bet is hedging the typical less-than-expected-move options selling trades.  This isn't something I've seen other traders do.\n\nNothing you are doing is really capping your risk.  The static delta hedge does \"lock in losses\" from one point of view.  But it also does eliminate delta risk.  That is, your P&L looks like a hill at T+0.  If price rolls down the left side of the hill, you have some negative P&L.  If you delta hedge, you are basically repositioning the hill with the top right below you.  So you would no longer benefit from a move back up to where you started.  On the other hand, if price continues to go down, you'll lose less in the hedged position than the unhedged.\n\nIt might be best to set aside these things until you are trading bigger products like futures options or index options.  Even then, there are other ways to cut gamma like ratio spreads or going further out in DTE.  Delta hedging can also be done by moving legs around or adding to the position, which is more viable on something like SPX vs something like SQ.  Edit: it is somewhat viable in lower priced strangles where you can roll in the untested side to cut delta.", "score": 12, "replies": [{"body": "Thank you, this was a very helpful comment to read.  I trade iCondors on SPX, /ES, /NQ etc, and strangles on smaller notional plays.  I've been doing the standard 20Δ short strangle for about 2 years with great results.  I just go a little stircrazy doing the same thing over and over.  This \"gamma scalping\" and \"reverse gamma scalping\" struck me as interesting and a way to be more \"hands on\" with my positions, which keeps the boredom at bay.  \nThe info I was going off of for these positions was based off of the videos in the following tastytrade post: [https://www.tastytrade.com/news-insights/the-dish-on-gamma-scalping](https://www.tastytrade.com/news-insights/the-dish-on-gamma-scalping).  \nPrior to this, I generally managed my overall delta position for my portfolio by simply opening a spread on SPY to bring delta back close to neutral if I was getting too bearish/bullish.", "score": 3, "replies": [{"body": "Oh, if you're in the indexes already you might look at some of the hedged broken wing butterfly strategies out there (M3, Rhino, Road Trip).  They're delta neutral, but in a BWB that pushes the tent to the downside (like work up a 60/40/20 delta all PUT BWB - delta neutral but tent is to the left).  Over time you get that -delta tilt on the T+0 and they hedge off with spreads too.  There's also a trade called the \"Jeep\" or \"Weirdor\" that's like a broken-wing condor with a kink in it to make the T+0 more symmetric.\n\nNothing wrong with iCondors though and if it's working maybe just keep doing it.", "score": 1, "replies": []}]}]}, {"body": "A couple of things. \n\nBroker greeks typically are not accurate, especially ToS. The reason for this is they don’t account for carry costs in calculating the price of the option, this results in a bad IV leading to bad Delta and Gamma. Don’t believe me? The IV for a single strike is the same for a call and a put, does it show that on your broker interface? \n\nSecond thing, you will need to do very careful PnL attribution to understand where the $ came from. Was it really gamma? Or overpriced vega? delta?\n\nIt’s a lot of work.", "score": 6, "replies": [{"body": "> Second thing, you will need to do very careful PnL attribution to understand where the $ came from. Was it really gamma? Or overpriced vega? delta?  \n  \nThis has been the hardest part for me to piece together.  For the first few days I was doing good logging each greek and number for each position.  However, after a week I admittedly stopped doing this and just adjusted my short/longs for gamma and moved along.", "score": 3, "replies": [{"body": "Exactly how did you adjust for gamma? Looks like if anything you brought delta down to zero. AFAIK your strategy here is effectively delta hedging to a T.\n\nHow are you adjusting for gamma exactly?", "score": 3, "replies": [{"body": "You are correct, I was managing delta back to zero.  This was my understanding of how Gamma Scalping (and Reverse Gamma Scalping) worked, based off of this blogpost on tastytrade: [https://www.tastytrade.com/news-insights/the-dish-on-gamma-scalping](https://www.tastytrade.com/news-insights/the-dish-on-gamma-scalping).  I am always open to learning new & interesting tactics, if you have any for gamma scalping that aren't simply long/shorting the underlying.", "score": 1, "replies": [{"body": "No idea tbh. Gamma is basically just the second-order derivative of price - i.e., a direct derivative of delta. If delta is velocity, then gamma is acceleration. \n\nIn that case, I'm not sure how one would directly invest in \"gamma\" unless using delta hedging with some sort of linear regression model that changes how much it hedges(instead of returning delta to 0) based on market signals and gamma (I.e., overhedging - instead of going from net delta of -20 to 0, it might go from -20 to +10, depending on the level of gamma).\n\nIdk if there's any feasibility to that", "score": 1, "replies": []}]}]}]}, {"body": ">\tBroker greeks typically are not accurate, especially ToS. The reason for this is they don’t account for carry costs in calculating the price of the option, this results in a bad IV leading to bad Delta and Gamma. Don’t believe me? The IV for a single strike is the same for a call and a put, does it show that on your broker interface?\n\nJust took a look in tos mobile at SPX since that’s what I trade. Calls have more extrinsic than puts as I would expect with higher interest rates, and it matches pretty closely with putting the numbers, including interest rate, in a BS calculator.", "score": 1, "replies": [{"body": "spx will be the closest to accurate. this is because you can’t trade in the underlying, carry costs besides interest rates are borrow and dividends, spx has neither", "score": 1, "replies": []}, {"body": "Also keep in mind that BSM is not model free, a better tool for this exercise is to use put-call parity, and use the forward to expiry as the underlying instead of spot.", "score": 1, "replies": []}]}]}, {"body": "From the images, you did the opposite of gamma scalping.  You sold options and delta hedged them.  Gamma scalping is taking the opposite side of that.  The whole point is that the fair value of an option is the cost to hedge.  So you have to have an opinion on where volatility will go.  Theoretically, if your opinion is correct you will make money.  In your example you were short options during a period that was relatively stable.  Also, your screenshots don't really show what you made or lost on the shares.", "score": 6, "replies": []}, {"body": "This looks like reverse gamma scalping, in which case your statement that your downside is limited is not true and you’re taking huge risk. I mean if gamma scalping has limited downside then the reverse gamma scalping that you’re doing must have unlimited downside. So first get your terminology right, and understand your risk. For example if TSLA starts going up fast, you’ll be short the call that can cost you a lot. Or if you’re selling strangles on a company that may be acquired the next day, or has earnings or other announcement that takes it up by 50%+, you’ll lose a lot without being able to hedge.\nBut otherwise this is a viable strategy, maybe just more profitable on paper than it would’ve been live.", "score": 3, "replies": []}, {"body": "Based on those positions, it seems like you’re immediately short gamma after any movement, so large movements (that didn’t happen) would have cost you.  My guess is the market was flatter than the options were priced for and you benefited from theta decay.", "score": 3, "replies": []}, {"body": "You have the general concept correct. The key bit you are glossing over is vega, and how vega is related to gamma (and theta, all the greeks are somewhat interrelated actually).\n\nWhen you sell options, or two options for strangles/straddles, you will always pick up some negative gamma and negative vega along with your positive theta.  That negative gamma means if the UL price increases, your delta decreases; you need to buy shares to hedge when the price rises. And vice versa. Buy high sell low means your hedges on the shares are guaranteed to loose. The amount the hedge looses depends on how frequently and violently the UL swings and how hard you need to hedge (i.e. volatility).\n\nSay you sell that straddle for $1.00. The market (through black sholes) is saying that it expects the losses from those hedges to be equal to that $1.00 in premium. If implied volatility turns out to be more than the realized volatility, the part that was short vega (the option seller) will profit, and vice versa. If realized volatility is higher than implied, you will loose money overall from the delta hedging.  The whole situation is flipped for the counterparty buying the options.\n\nSo again, you core concept is totally valid, but this is not free money. You are still just selling premium to take on short vega risk like any strangle; you are reducing the delta risk but this comes at the cost of lower overall returns (but also a more steady return).", "score": 2, "replies": []}, {"body": "Not aquatinted enough to provide anything of value. Sorry. Was curious if you had an easily shareable list of your balancing trades over the course of the open position that I could review.", "score": 1, "replies": [{"body": "I'll go back through ToS and see if I can put together some screenshots.  Mainly, a few hours before closing I would either buy/short the underlying to bring gamma back to 0 for that position.  Most of the time it was only 5-10 shares, while once or twice it required a bigger hedge.", "score": 2, "replies": []}]}, {"body": "I've done these reverse gamma scalping but the vol conditions got to be in favor", "score": 1, "replies": []}, {"body": "Can you point me to some keywords or detailed vids on how to? I don’t know if I’ll use it but I love learning", "score": 1, "replies": []}, {"body": "I hope you follow up with further reports. I would caution you that 6 trades does not make a long term pattern.", "score": 1, "replies": []}, {"body": "Even putting aside the paper fills, a simple way to understanding gamma scalping is that you will make more money (compared to unhedged positions) when your hedges are making money. \n\nWhen you are long vol (straddles), your hedges will be buying low and selling high, locking in money. When short you will be buying high and selling low, adding negative P&L. I can’t tell what your hedges are from your image, but they should be creating negative P&L if you are short the straddle.", "score": 1, "replies": []}, {"body": "Hahahahaha", "score": 1, "replies": []}]}
{"title": "Puts on Tim Apple", "selftext": "Reasons:\n\n-Buy and pay later model from Apple is a ticking time bomb for a future MBS styled implosion\n\n-30% monopoly on the ENTIRE appstore purchases\n\n-En route on a possible removal for Twitter from the appstore.Possibly threatening freedom of speech\n\n\nIt's time bois", "id": "z7hh64", "created_utc": 1669690969.0, "score": 0, "upvote_ratio": 0.35, "num_comments": 40, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 year ago\n**Total Comments**|2|**Previous Best DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=z7hh64)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=z7hh64)\n\n^^WSB ^^[Stats](https://www.twitch.tv/wsbzjz/) ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)\nHey /u/fernandeztahi, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "30% on app purchases, is in Android too, but Elon pointed out apple, so it got attention?", "score": 15, "replies": [{"body": "Everything space dady says is gospel and must not be questioned by regarded things like context.", "score": 3, "replies": []}]}, {"body": "This is all regarded. Calls.", "score": 25, "replies": []}, {"body": "[removed]", "score": 25, "replies": [{"body": "Also the second point\n\nAnd the first", "score": 16, "replies": [{"body": "[removed]", "score": 18, "replies": [{"body": "lol", "score": 2, "replies": []}]}]}, {"body": "Cuz free speech means other people can tell you what you do and don’t allow on your own App Store", "score": 3, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "I think op lives in a delusional, world, where all of the musk fanboys are going to boycott, Apple, and Tim Apple is going to call musk crying, and beg on his knees to come back to his App Store “Pwetty Pwease”", "score": 7, "replies": []}]}]}, {"body": "last point can get apple and even the US gov into trouble. When under Supreme Court they’ll get shut down for 2nd amendment violations. heavy fees. The US gov loves cash n last I checked apple has like 40 bln left after blowing like 200bln propping up share price through buy backs", "score": 0, "replies": [{"body": "[removed]", "score": 6, "replies": [{"body": "he is but the censorship part is a deep rabbit hole. He’s throwing it as a threat cuz apple knows they’d lose and the gov wouldn’t want the publicity", "score": -2, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "It’s not even like they won’t put it on the App Store. They just charge for doing so. It costs 30%. And muskrat doesn’t want to pay so rather than say “we are taking it off” he is making it sound like Apple are taking it off…", "score": 2, "replies": []}]}]}]}]}]}, {"body": ">These are valid concerns, and I'm sure Apple will take them into account. However, it's important to remember that as a company they have the right to decide which services appear in their app store based on what is best for their business model. As long as freedom of speech remains intact and all other parties involved adhere to legal requirements then there shouldn't be any major issues with how things stand now.", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "apple is the most recognized brand in the world with some of the best engineered tech to date.", "score": 0, "replies": [{"body": "Most recognized, but less than 30% marketshare, and behind the curve in engineering for years.", "score": 1, "replies": [{"body": "\\> ...and behind the curve in engineering for years\n\nhighly regarded statement.", "score": 1, "replies": []}]}]}]}]}, {"body": "I’ve printed 50 copies of this post and plan to use it as TP", "score": 6, "replies": [{"body": "Only 50? Better refrain from taco bell for some time!", "score": 3, "replies": []}]}, {"body": "Lmao Elon has really brainwashed people thinking that an app is stopping freedom of speech 🥱😂", "score": 6, "replies": []}, {"body": "Puts on OP’s single brain cell.", "score": 8, "replies": []}, {"body": "Apple limiting the air drop ability of Chinese protesters is the real bullshit", "score": 6, "replies": []}, {"body": "Calls on Tim Apple it is", "score": 3, "replies": []}, {"body": "why can't people just use twitter from their browser if the app is delisted? inconvenience?", "score": 3, "replies": []}, {"body": "“Monopoly” doesn’t mean what you seem to think it means.\n\n Neither does “freedom of speech.”", "score": 2, "replies": []}, {"body": "Pretty sure you don't understand the concept of free speech, nor does Elon.  The first amendment ONLY applies to the government limiting free speech.\n\nYou're free to say anything, even as dumb or as firebrand as you like.  A privately held entity is free to exercise their own freedom of speech to not let you do so on their platform.\n\nIf I go to a pro-Trump subreddit and post even a well-reasoned rational but liberal-leaning argument, know what's gonna happen?  I'm going to get banned.  And then when I write a snarky reply to the mod who did so?  He's going to use his petty \"power\" to suspend my entire reddit account.  Where's your \"outrage\" at that, homeslice?!", "score": 2, "replies": []}, {"body": "you sound gay. freedom of speech is a clown argument by a little goverment subsidized silver spoon boy with electric toy cars ..dare you to buy puts on aapl.", "score": 2, "replies": []}, {"body": "Naw, puts on Elon.", "score": 2, "replies": []}, {"body": "Warren \"Cash Money\" Buffett is gonna get stuck holding the $AAPL bag", "score": 2, "replies": [{"body": "He’s going to have to call for back up to carry all that cash.", "score": 3, "replies": []}]}, {"body": "The next twenty years is already priced in.  Shares.  For a long time.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Show us the puts you actually buy. I don’t think you’ll actually spend even 5k on AAPL puts.", "score": 1, "replies": []}, {"body": "1 and 2 are hands down bullish what are you smoking.\n\n3 is meh. It’s their App Store they can do whatever they want, just like Elon can do whatever he wants at Twitter.", "score": 1, "replies": []}, {"body": "Elon better stay in his lane before Tim Cook makes him his bitch.  I love the entitled people who bitch about having to pay 30% on the App Store.  The App Store is like a digital mall that offers apps.  It is a class A mall with security, and plenty of shoppers.  If you don't want to pay the rent then open a store in a strip shopping center where the rent is lower and the shoppers are less affluent and there is less traffic.", "score": 1, "replies": []}, {"body": "those all all reasons to buy apple though...", "score": 1, "replies": []}, {"body": "Apples margins are still insanely high. \nThey can cut costs and still sell the next five iPhone models to everyone. \nThe question will be what the big whales might do if they start disliking the margin play Apple has done for 10+ years now. \nThe other point to consider is constant share buybacks that Apple does without much noise. \nThere is not much that can push this stock down below 120 or 100 in my opinion. \nPersonally I’m not invested. \nI don’t see any major upside considering the current economy / inflation / energy prices / …", "score": 1, "replies": []}]}
{"title": "iPhone maker Foxconn entices angry workers in China to return as Apple faces supply crunch", "selftext": "[deleted]", "id": "z7ztvj", "created_utc": 1669741984.0, "score": 192, "upvote_ratio": 0.92, "num_comments": 42, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|1 year ago\n**Total Comments**|17|**Previous Best DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=z7ztvj)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=z7ztvj)\n\n^^WSB ^^[Stats](https://www.twitch.tv/wsbzjz/) ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "Screw you, I'll make my own factory. With blackjack! And Hookers! In fact, forget the factory...", "score": 66, "replies": [{"body": "Classic Bender", "score": 12, "replies": []}, {"body": "screw the whole thing 😭", "score": 2, "replies": []}]}, {"body": "iPhone labor camps. Rolls off the tongue nicely", "score": 50, "replies": []}, {"body": "[deleted]", "score": 35, "replies": [{"body": "[deleted]", "score": 61, "replies": [{"body": "Or they could have avoided this altogether if manufacturing was never given to China in the first place", "score": 3, "replies": []}]}, {"body": "They removed the window nets", "score": 19, "replies": [{"body": "I Phone workers: \"We're not coming back unless you remove the suicide nets!\"\n\nSoon to become the Chinese Oliver Twist: \"Please Sir, may I jump to my death?\"", "score": 10, "replies": []}]}]}, {"body": "Apple has been looking for ways to diversify their manufacturing operations for years. \n\nThey already have plants in Vietnam and India. \n\nIf the CCP can’t get this under control, Apple will push those plans even quicker. \n\nLong term apple will be fine. They’ll do whatever is necessary to get their production back up. \n\nShort term Apple might be affected.", "score": 25, "replies": [{"body": "Ccp will ban iphones in China if that happens.", "score": 20, "replies": [{"body": "The biggest market BTW.", "score": 8, "replies": [{"body": "Oh boo hoo apple isn't valued correctly then, if only there was a way to make money on a stock as the company was going DOWN 👇.\n\nHmm who will invent such a security?", "score": 2, "replies": [{"body": "The market can remain irrational far longer than  you can remain solvent.\n\nShorting cult stocks is financial suicide.", "score": 2, "replies": [{"body": "What in tarnation is this post in my gambling subreddit?", "score": 2, "replies": []}]}]}]}, {"body": "Then knock them off", "score": 2, "replies": []}]}, {"body": "The Indian and Vietnamese plants are a stunt. eg India makes 5% of iPhones. It is estimated that it will take 10-20 years to replace the *hundreds* of Chinese suppliers and thousands of highly skilled Chinese engineers.", "score": 8, "replies": [{"body": "10-20 years is not an especially long time", "score": 2, "replies": [{"body": "It's roughly the time it takes a tech corporation to go from being he market leader to (near) bankruptcy. eg Commodore, Sun, Nokia and Blackberry all failed within 10-20 years of peak MC,", "score": 3, "replies": []}]}, {"body": "\"highly skilled Chinese engineers\" 😂😂", "score": 0, "replies": [{"body": "LOL. It' the reason why AAPL moved to China in the first place.\n\n \"Apple's executives had estimated that about 8,700 industrial engineers were   \nneeded to oversee and guide the 200,000 assembly-line workers eventually  \n involved in manufacturing iPhones. The company's analysts had forecast  \n it would take as long as nine months to find that many qualified   \nengineers in the United States.  In China, it took 15 days.\" \n\nhttps://www.theatlantic.com/business/archive/2012/01/why-the-united-states-will-never-ever-build-the-iphone/251837/", "score": 2, "replies": []}]}]}, {"body": "The Indian and Vietnamese factories are little more than publicity stunts eg The Indian plant *assembles* **5%** of iPhone 14 model using parts from the 200+ Tier One Chinese suppliers.", "score": 2, "replies": []}]}, {"body": "Apple hates free speech", "score": 28, "replies": [{"body": "Exactly. Apple wants to charge 4.99 monthly for speech.", "score": 6, "replies": [{"body": "How do i get a blue tick?", "score": 2, "replies": []}, {"body": "They already do.", "score": 1, "replies": [{"body": "They also banned apps that compete with their features. I remember when the added the flashlight feature, they banned all flashlight apps.  ( Don't know if they allowed them back, but that wasn't the first time that happened)", "score": 3, "replies": [{"body": "Lots of free apps have trackers and other programs consumers don't want. Making an in house version that doesn't have those features is good.", "score": 4, "replies": [{"body": "Apple has trackers and other programs consumers don't want either. The risk isn't gone, it's just authorized.", "score": 4, "replies": []}]}]}]}]}, {"body": "They are a private platform, they can exercise their rights to their free speech and allow or disallow whatever content they want.\n\nStupid fuck.", "score": 0, "replies": []}]}, {"body": "Sucks to suck. Foxconn can fuck their hat", "score": 5, "replies": []}, {"body": "Basically i want blackberry for xmas", "score": 4, "replies": []}, {"body": "Using a baton?", "score": 9, "replies": [{"body": "And tanks and bullets", "score": 5, "replies": [{"body": "Steel in the morning keeps the covid away!", "score": 5, "replies": []}]}]}, {"body": "Damn $70 to return to slave labor, can’t say no to that", "score": 7, "replies": []}, {"body": "Lots of production is moving to Vietnam now.", "score": 2, "replies": []}, {"body": "70 bucks doing better than me. How do I get to the China?", "score": 2, "replies": []}, {"body": "Send in Hookers & Blow.", "score": 2, "replies": []}, {"body": "Fuck Apple and fuck Foxconn.", "score": 2, "replies": []}, {"body": "Entices them with the american dream !", "score": 2, "replies": []}, {"body": "When you treat your workers as slave and think they machines not humans", "score": 3, "replies": []}]}
{"title": "$TSLA short", "selftext": "I’ve never posted on here but haven’t seen a chart so clean in my view. \n\nPlay: Tsla puts for potential break of 179.\nCompanies that show strength for no reason when the rest of the market is weak often lead to a volatile drop. \n\nConsidering Tsla missed out on the mid day bounce at about 2 o’clock, giving me the sign it is ready to break support and fall to at least 174 in the short term and complete the h and s pattern. \nTight stop at 182.8 \nThis one is tendies", "id": "z83rws", "created_utc": 1669750798.0, "score": 23, "upvote_ratio": 0.75, "num_comments": 40, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 year ago\n**Total Comments**|463|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=z83rws)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=z83rws)\n\n^^WSB ^^[Stats](https://www.twitch.tv/wsbzjz/) ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)\nHey /u/Big_dadd_BD, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": [{"body": "[https://photos.app.goo.gl/p35CzrNf9PCDFDdE9](https://photos.app.goo.gl/p35CzrNf9PCDFDdE9)", "score": 1, "replies": []}]}, {"body": "Ballsy with semis", "score": 11, "replies": [{"body": "You remember the cyber truck unveiling? \n\nI think the semi deliveries are gonna be even more fuel for the puts.", "score": 3, "replies": []}]}, {"body": "Calls it is", "score": 3, "replies": []}, {"body": "Buying TSLA shares .", "score": 8, "replies": []}, {"body": "Buying calls now", "score": 6, "replies": []}, {"body": "Elon has to sell more Tesla with every double down he does on Twitter. \n\nSo buy puts and let Elon do the selling for you so he can bankroll his social media dumpster fire.", "score": 7, "replies": []}, {"body": "Mid December Tsla low 150.", "score": 2, "replies": []}, {"body": ">I agree with your analysis. Tsla looks ready to break support and fall below 179 in the short term, so puts at this level could be a good option for potential profits. However, it's important to keep an eye on news and market sentiment surrounding the stock before making any decisions as they can drastically affect price movements. Good luck!", "score": 6, "replies": [{"body": "The market never goes the way you expect it to, if it did we'd all be rich. Wait for the fuckery then it'll go down.", "score": 7, "replies": []}, {"body": "Can someone explain visual mod to me like im 5", "score": 2, "replies": [{"body": "Visual mod = God. There.", "score": 7, "replies": []}]}, {"body": "Always visual. That is why we always use stops.", "score": 1, "replies": []}]}, {"body": "I'm watching the march 17 $160 Puts. They went to a low of $13 today and closed at $14.4\n\njust watch list I didn't buy them. Playing it just a bit safer with TSLQ instead\n\nMy target is $150 but just not sure about what kind of the usual TSLA whipsaw fuckery will occur before it makes the move down.", "score": 2, "replies": [{"body": "My measured move brings Tesla right around 150 as well", "score": 2, "replies": []}]}, {"body": "Im happy that I have seen a zillion random posts about shorting Tsla. Calls will print", "score": 1, "replies": []}, {"body": "Which time frame do you see a H&S", "score": 1, "replies": [{"body": "1h has a sort of h and s for this short term play. I dont think a major drop is coming quite yet.", "score": 1, "replies": [{"body": "Yeah I’m asking cuz I’m looking at the 1 hr and there’s no H&S. Not saying your puts won’t print, but there’s no H&S..", "score": 1, "replies": [{"body": "Definitely a triple top, nearly a H&S", "score": 1, "replies": [{"body": "Could be a double top (not triple), but chart patterns only materialize upon confirmation, which would be a break below the neckline of the double top at 178.", "score": 1, "replies": [{"body": "Hmm, I see what you’re saying. Looking at it now from a further out timescale I’d say it may even be potentially reversing? Could that be a inverse h&s forming on the daily?", "score": 1, "replies": [{"body": "It’s funny I was thinking the same thing this morning. I guess we’ll have to see how it plays out. I have no short term biases", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "so buy more shares ?", "score": 1, "replies": []}, {"body": "\"Strength when rest of market is weak\"\n\nYou ... realize TSLA is down 55% this year?", "score": 1, "replies": [{"body": "Yes John bot i do realize that. If you actively trade markets you realize some days stocks aren’t moving with the rest of the market. Commonly that means something is up. Tsla first major drop came after it held the 300 range for a week or two as spy saw major decreases. Monday stocks were down largely as Tsla was pumping to 186. So Tsla was out of line with the markets SHORT term.", "score": 4, "replies": [{"body": "Netflix up 60% in the last 6 months lol\n\nSometimes things get oversold then bought back\n\nXD", "score": 1, "replies": [{"body": "That’s a way different situation John bot and not that day to day price action I’m talking about. It’s ok you don’t get what I’m talking about we will see if the play works or not.", "score": 2, "replies": [{"body": "\"not that day to day price action i'm talking about\"\n\nYou're saying \"NASDAQ went down 2% and TSLA was flat!? How dare it! It should go down!\"\n\nNasdaq has been down the past 6 months and NFLX is up 60% :)", "score": 1, "replies": []}, {"body": "How's the short?", "score": 1, "replies": []}]}]}]}]}, {"body": "$41.82 Inevitable", "score": 1, "replies": []}, {"body": "Tesla puts or tslq calls?", "score": 1, "replies": []}, {"body": "Fresh take bro you must be an OG", "score": 1, "replies": []}, {"body": "I’m investing:)", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}]}
