{"title": "Nvidia Blackwell B100/B200 deliveries imminent, air cooling remains dominant", "selftext": "", "id": "1dw10y3", "created_utc": 1720194261.0, "score": 80, "upvote_ratio": 0.95, "num_comments": 16, "comments": [{"body": "According to sources in the server supply chain, Nvidia will soon begin shipping its new B100 and B200 chips. Mass production of servers equipped with these Blackwell architecture chips is set to commence in the mid to late third quarter of 2024. . . .   ( subscription required )", "score": 33, "replies": [{"body": "Do we have an estimation of the date? Once the official shipment announcement goes out then we’re mooning!", "score": 7, "replies": [{"body": "In the interest of decorum and good taste, please don't moon in public.", "score": 12, "replies": []}, {"body": "No date but hoping there might be a date during earnings.", "score": 3, "replies": []}]}, {"body": "B200 is 2025 according to Nvidia's own roadmap.", "score": 3, "replies": []}, {"body": "Subscription required*to the moon", "score": 1, "replies": []}]}, {"body": "to the moon baby yeahhhhh!!!!! trust in uncle huang, he undertalks and overdelivers ALWAYS", "score": 45, "replies": []}, {"body": "PLEASE BUY BUY BUY NVIDIA STOCKS. NO BRAINER. LETS HELP US AND NVIDIA GROWS EXPONENTIALLY", "score": 4, "replies": []}, {"body": "Cha ching cha ching", "score": 2, "replies": []}, {"body": "Moon", "score": 2, "replies": []}, {"body": "If cooling system are effective, can it install on my shirt. The fucking temperature is killing me. But still this news make me happy to be a nvdia holder.", "score": 3, "replies": [{"body": "The amount of energy it takes to evaporate 1 gram of water is the same amount of energy it takes to raise 1g of water like 1000 degrees. Latent heat of vaporization is amazing.\n\nIf you get a cup of water and just use your hand to rub water on your limbs and dampen your shirt repeatedly and have a breeze on you, you can give yourself hypothermia in the summer.", "score": 2, "replies": []}]}, {"body": "Paywall. OP please post an archive link.", "score": 3, "replies": []}, {"body": "Paywall", "score": 1, "replies": []}, {"body": "Its main drawback lies in its high power consumption and thermal output, requiring robust cooling solutions and potentially limiting its adoption in mobile or compact form factors.", "score": 1, "replies": []}, {"body": "thought strong imminent hurry spark instinctive sip nutty friendly fertile\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": []}]}
{"title": "Nvidia's Plans To Take Over 2024 SHOCK The Entire Industry!", "selftext": "All politicians must follow Nancy Pelosi strategy and buy more. Nvidia only Nvidia . I just wanna hear everything good about my baby Nvidia .", "id": "1dvq810", "created_utc": 1720156452.0, "score": 14, "upvote_ratio": 0.74, "num_comments": 13, "comments": [{"body": "Leather jacket disclosed his plans !", "score": 6, "replies": [{"body": "So higher demand?", "score": 2, "replies": []}, {"body": "When it says that Jensen Han disclosed his plans, it means he has publicly shared or revealed his intentions and juicy strategies. This could be related to business, projects, or any other plans he had previously kept private. Nvidia #1 company leading AI", "score": 2, "replies": []}]}, {"body": "Nancy knows !", "score": 4, "replies": [{"body": "Thanks for bn so kind \nMan!", "score": 3, "replies": []}, {"body": "Yes knows that Nvidia needs a push and just because she is an amazing hero and genuine individual trying to buy more of Nvidia and help everyone else who is sinking right now", "score": 0, "replies": [{"body": "Relax, its doing its normal thing.", "score": 5, "replies": [{"body": "Ok", "score": 1, "replies": []}]}]}]}, {"body": "Fomo I’m a victim of Fomo\nI don’t want to be alive anymore", "score": 2, "replies": []}, {"body": "It’s on its way to blue chip status and we haven’t even got to the higher yield dividend package that will eventually transpire, plus possible split in the next 5 years", "score": 2, "replies": []}, {"body": "Mr Jensen still proves his willingness to dominate its market and distance itself from the competition! No wonder why this company returned 320,000% to its shareholders since 1999 ! Haters will hate !", "score": 2, "replies": [{"body": "He’s done very well for his shareholders, however the markets are forward looking and the bar and expectations might be set too high. the company must now consistently dominate and produce now almost impossible goals from now on just to maintain their status quo. Any slip in revenues, earnings or growth will decimate the SP. people are extrapolating impossible numbers and exuberance may fade as the realities of business and competition sets in", "score": 3, "replies": [{"body": "The thing is with all IT products, they become faster and more efficient with every iteration. All tech companies release new products in a constant cycle, you name it: CPUs, iPhones, GPUs, hard drives; the list is endless and the constant upgrade cycle is required as the software or technology demands ever greater tech to work on. Therefore, it stands to reason that AI will require better tech as it evolves and you will see a constant demand for Nvidia products.\n\nThe idea that once these data centres are built there will be no need to upgrade the underlying technology is quite frankly, nonsense. I’ve been buying Nvidia graphics cards every few years since I was 16, big business will be cycling their Nvidia AI GPUs until general AI takes over from humans", "score": 2, "replies": []}]}]}]}
{"title": "How do you guys feel about these?", "selftext": "NVDA calls bought at lunch… ", "id": "1dw8ngm", "created_utc": 1720213999.0, "score": 8, "upvote_ratio": 0.75, "num_comments": 15, "comments": [{"body": "Personally, I think the correct strategy for Nvidia now is to be writing OTM puts with cash backing, I'd be going for $100 or other key prices and taking advantage of the higher IV leading towards earnings. \n\nIf the option goes ITM, congratulations you earned the premium and you get locked in at a great discount to current market price alongside buying into a key psychological demand area.\n\nI saw Nancy buying more. I see the probe into anti-trust violations and circumvention of state sanctions on exporting to China, I see a market that is already hyper-inflated and euphoric whilst the reality for most people is rather grim due to the after-effects of the pandemic, inflation, several key proxy wars, and the list goes on.\n\nHonestly, bugger, who knows? Best guess is that with how much rate cuts have been priced into the market already, as soon as they happen I wouldn't be surprised to see the market go through a severe correction.\n\nEither that or the next time NVidia fails to hit earnings expectations... Either way, was this a good trade? Well maybe if you expect NVIDIA to rise by more than the premium you just paid in your 2 month window but, honestly, nahh I don't really like it.\n\nSorry.", "score": 4, "replies": [{"body": "Should caveat this by saying you should go for $100 and such prices ONCE they've actually got some value, believe the current options chain prices these very low.", "score": 1, "replies": []}]}, {"body": "Your giving NVDA 2 months and earnings to go to boom town ? I guess I would only do this if I thought they would drop after earnings .", "score": 2, "replies": []}, {"body": "Why ITM? Are you wanting to only capture income? What if NVDA earnings were to double (BIG IF) now you missed out on the gains and will wait weeks to get out of the trade. Unless, you anticipate your shares to be called away any day? Please elaborate what were you thinking before placing this trade, what was your initial plan/goals?", "score": 1, "replies": []}, {"body": "“I wonder if anybody'd think I'd flipped\nIf I went to LA via Omaha!”", "score": 1, "replies": []}, {"body": "Yeah don’t pay that much for premiums. It doesn’t matter if it stays above 125. It matters if it stays above the price where you bought it at, whatever that was.", "score": 1, "replies": [{"body": "Where’s the premium?", "score": 1, "replies": [{"body": "Trade price 14.07", "score": 2, "replies": []}, {"body": "I believe in dollars it’s $1407", "score": 1, "replies": []}]}]}, {"body": "Good job", "score": 1, "replies": []}, {"body": "Dumbest trade I’ve ever seen", "score": 0, "replies": [{"body": "Educate me", "score": 0, "replies": [{"body": "It’s pretty dumb as this hit 140 like a week ago . You going to give the stock 2 months grow . They only makes sense if you think it’s going to drop . You also have an earnings report between now and then likely why premium was so high", "score": 2, "replies": [{"body": "I wouldnt say it's dumb. It's not like 0dte.\n\nEarnings this could be 180 or 90 lol a bit of a gamble I'd say. 50 50", "score": 2, "replies": [{"body": "Agree .", "score": 1, "replies": []}]}]}]}]}]}
{"title": "INTC $40 Call 1/17/2025", "selftext": "I have been holding onto 11 contracts, started with 1 on 4/19, averaged down a couple times to $1.39 avg. cost. \n\nThey have been up and down, today they are up to $1.41 per contract give or take a few cents. \n\nNot a huge gain but it’s better than a loss. I’m contemplating selling them, but I’m also considering holding them.\n\nAny opinions?", "id": "1dw2bdm", "created_utc": 1720197649.0, "score": 14, "upvote_ratio": 0.87, "num_comments": 19, "comments": [{"body": "What does your trading plan tell you to do?\n\nWhat is your analysis of what the stock will do between now and 1/17/25? You opened at such a long duration for a reason, what was it?\n\nBased on your analysis that prompted you to open, what has changed?\n\nNot sure if $1.41 will cover your fees, but it is seldom wrong to take a profit, especially if your sentiment and forward projection may have changed . . .", "score": 9, "replies": []}, {"body": "If you bought them to average down, then mission accomplished.  Trim your position to a number of contracts you feel comfortable holding.  You can re-open them later on a dip if you want to average down further.\n\n\nIf you bought them because you were trying to build a bigger leveraged position, then it sounds like you aren't confident in your thesis any longer and should probably exit the position entirely.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "What are your thoughts now?", "score": 1, "replies": []}]}, {"body": "I like the chart. I actually got some  Sept 35 calls today. Looks ready, but it's Intel, it has burned me before.", "score": 3, "replies": []}, {"body": "Bought 5 for 8/16 2 weeks ago. Holding strong for that upcoming ER rebound!", "score": 3, "replies": []}, {"body": "I picked up 18 dec 26 $25C for 11.4 before yesterday’s little rally. Intel is a long term hold at these levels", "score": 2, "replies": []}, {"body": "I have quite a few calls at 35 for 1.22 on 9/20/24. Careful what broker you use I have seen a huge difference just between webull and Robinhood on option calls for intc. Good luck", "score": 2, "replies": []}, {"body": "Hold on to earning, you will be rewarded", "score": 2, "replies": [{"body": "🙏", "score": 1, "replies": []}]}, {"body": "sell some calls above the strike if u still bullish, at least you'll make something back if the sp ends up below your strike", "score": 1, "replies": []}, {"body": "You need to determine your outlook. Cut risk by adding short delta.  If your outlook is bearish, exit and redeploy your money elsewhere.", "score": 1, "replies": []}, {"body": "These are up nicely today 🤑", "score": 1, "replies": []}, {"body": "What do you guys prefer to do, options every other day with a new contract that last to the end of the week. Or do you guys like to hold onto options for a long period of time? Can you please tell me and why you choose either or.", "score": 1, "replies": [{"body": "I’ve done both, longer dated options have more time on them, so for me fluctuations in prices aren’t as scary as weeklies.", "score": 1, "replies": [{"body": "Oh ok that sounds better honestly. I like weeklies because of the quick profits though😂", "score": 1, "replies": []}]}]}, {"body": "I own INTC, I hope it's $40 then... The numbers tell me it'll hold for the next week or so if not fall.", "score": 1, "replies": []}, {"body": "Dredging up an older post on purpose here. Any comments regarding everyone's thesis with current hindsight? What would you say today? No shame here, just to help folks learn.", "score": 1, "replies": [{"body": "Don’t say “just go up a little more and sell”.\n\nI put a limit order in for $3.00 when it spiked, it hit $2.95. I will say I have been averaging down with the hopes that it will have a spike and I can get out from under it.", "score": 1, "replies": []}]}, {"body": "Next time you want to “average down” buy a closer strike.", "score": 0, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1dw12t7", "created_utc": 1720194400.0, "score": 4, "upvote_ratio": 0.58, "num_comments": 10, "comments": [{"body": "Wow, he bought $70k worth of shares. Indeed must be something huge cooking.", "score": 27, "replies": [{"body": "The CEO bought $1.4 million in shares back in May, followed by the executives in june, followed by the directors on July 2. \n\nEveryone in management is positioning themselves for some good news in the market.\n\nI know it's trendy to hate on Intel but this company has a bright future (over the long term).", "score": 7, "replies": [{"body": "I truly hope so, I picked up some shares few weeks ago myself as I also think so, but a director buying $70k is not news (or reddit-post) worthy.", "score": 9, "replies": [{"body": "I should have dug deeper before posting. Their entire management staff (officers, executives, and directors) are buying up stock since May.\n\nTo me that means they know something and recognize the buying opportunity we are in at the moment.", "score": -1, "replies": []}]}, {"body": "It was trendy to hate on AMD back in 2016 yet look at where they are at now. \n\n12 -> ~140\n\nSuffice to say, what’s trendy isn’t always great.", "score": 3, "replies": []}]}, {"body": "The amount is less interesting in that a director is buying shares 3 weeks before an earnings call, but thanks for the sarcasm.", "score": -2, "replies": []}]}, {"body": "It warms my heart whenever I see a fellow Intel bag holder here grasping for straws.", "score": 16, "replies": [{"body": "I'm a bag holder who is actually ahead and could sell now for a profit.\n\nHaters be jelly.", "score": -5, "replies": []}]}, {"body": "A tragedy for all PYPL management that bought stock and leaps in 2022, NVDA founder selling some equity around 500 Q3 2023, and so many other examples", "score": 2, "replies": []}, {"body": "Intel is the new NVidia", "score": 1, "replies": []}]}
{"title": "YOLO long $TSLA update #4", "selftext": "", "id": "1dvo8wz", "created_utc": 1720149209.0, "score": 37, "upvote_ratio": 0.88, "num_comments": 13, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 7 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 70 | **Previous Best DD** | \n**Account Age** | 9 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "https://preview.redd.it/j25lb092lmad1.jpeg?width=1290&format=pjpg&auto=webp&s=2f53182f08d64a43bd4f9c3831099fe5340efc88\n\nIts like we are the same but not.", "score": 7, "replies": [{"body": "Holy fuck", "score": 3, "replies": []}, {"body": "This guy fucks hard", "score": 2, "replies": []}]}, {"body": "So many retail bulls... Queen Pelosi sold...\n\nThis shit about to rug pull hard.", "score": 9, "replies": [{"body": "Doesnt matter. At 8/8 its going up 100% by Elmo showing a toaster on a stage.", "score": 9, "replies": []}, {"body": "Nancy likey NVDA, Elmo (r/TeslaLounge trigger word)  likey NVDA...", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Wtf why is this 1:1 gains", "score": 5, "replies": []}]}, {"body": "YouTube FSD 12.4 Footage, you will be shocked.", "score": 5, "replies": []}, {"body": "Imagine if u had calls. Where are your balls?", "score": 3, "replies": []}, {"body": "lol we the same. I have 297 shares and the same cost basis", "score": 2, "replies": []}, {"body": "YOLO with just shares?", "score": 1, "replies": []}]}
{"title": "Nvidia", "selftext": "[removed]", "id": "1dvptsc", "created_utc": 1720154985.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 13, "comments": [{"body": "Nancy posloskiy said buy so I buy", "score": 3, "replies": []}, {"body": "Calls", "score": 3, "replies": []}, {"body": "Lost momentum at the end of the day, I won't be taking anything on it, but if I was forced to, puts.", "score": 3, "replies": [{"body": "Calls in the morning it is😉", "score": 3, "replies": [{"body": "Fair enough 😭😭", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}
{"title": "TSLA short sellers in Q3", "selftext": "", "id": "1dvr86q", "created_utc": 1720160368.0, "score": 184, "upvote_ratio": 0.96, "num_comments": 18, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 10 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Bachelor level: wife leaves and takes her stuff and all that's left is camping equipment.", "score": 38, "replies": []}, {"body": "His wife’s boyfriend must hate camping", "score": 27, "replies": []}, {"body": "https://preview.redd.it/tphvbqpginad1.jpeg?width=1099&format=pjpg&auto=webp&s=72352784aa91cb84817686eac64a32e8579dd568", "score": 34, "replies": [{"body": "Wait till Elmo, r/TeslaLounge rage word, gets a pay package... oy... that will put a dent in a market cap!", "score": 6, "replies": [{"body": "He already had that for years.", "score": 2, "replies": [{"body": "not collected yet", "score": 1, "replies": []}]}]}]}, {"body": "He still has the house. Big W on his part", "score": 8, "replies": [{"body": "It's just a rental near the airport strip club where he met her..", "score": 8, "replies": []}]}, {"body": "My wife left the camping gear too", "score": 4, "replies": []}, {"body": ".. why?\n\nim sure that setup costs more than a cheap bed", "score": 2, "replies": [{"body": "Cause his wife left him", "score": 2, "replies": []}, {"body": "Its an IKEA hammock", "score": 1, "replies": []}]}, {"body": "I am one of them", "score": 2, "replies": []}, {"body": "My realtor would package this as downsizing and minimalist lifestyle... This is B+ grade in NYC", "score": 1, "replies": []}, {"body": "I", "score": 1, "replies": []}]}
{"title": "Is Tesla the next meme stock, first check list ", "selftext": "[removed]", "id": "1dvs6zg", "created_utc": 1720164268.0, "score": 0, "upvote_ratio": 0.26, "num_comments": 19, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 128 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "You're about 4 years late bud", "score": 26, "replies": [{"body": "Isn’t it crazy? When you think it’s the top but a new sucker comes in and your like damm that was me… ohhh the world it only turns and burns, it’s the 4th 🇺🇸", "score": 1, "replies": []}]}, {"body": "NVDA enters the chat.... anyone wanna buy a video card?", "score": 7, "replies": []}, {"body": "Bro, it was the first meme stock years ago ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 6, "replies": []}, {"body": "Elon as a good guy ![img](emote|t5_2th52|4271)", "score": 5, "replies": []}, {"body": "I thought bill was the good guy and Elon the evil genius ![img](emote|t5_2th52|31225)", "score": 5, "replies": [{"body": "how to say you work for a hedge fund without telling us you work for a hedge fund LOL", "score": -10, "replies": [{"body": "If I would work for hedgis I would drop all the sweet insider infos in this sub ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}]}, {"body": "Is there a good guy : Yes ( Elon )\n\nlmao", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "Ya meme,\n\n but with all your networth X100000 you still can't move 0.001% of the stock, how could you pump n dump?", "score": 1, "replies": []}, {"body": "The next? It's one of the first", "score": 1, "replies": []}, {"body": "- You confused the good and the bad guy\n- Fundamentals: No, unless you discover a Market for empty promises.", "score": 0, "replies": []}, {"body": "bro don't gamble w options and hold tesla shares thru, within 5 yrs could go above 500ish. With declining margin and shitty delivery numbers tesla likely to be bleeding on EV aspect, but AI def it wil slay in long term. Im more inclined to tink elons gonna work his ass off since the compensation was done. Dude is aweful but quite responsible accountabl workholic look up what he had done to save tesla in 2010.", "score": 0, "replies": []}]}
{"title": "🚨$BA plea deal decision day - ☄️ or 💩? ", "selftext": "Today’s the day! Boeing has until the end of the day to accept or reject the DOJ's plea deal over the 737 Max crashes. Here's what we're looking at:\n\n- DOJ Deal: $200M fine, 3 years probation, and an independent monitor.\n- Victims' Families: Calling it a \"sweetheart deal\" and pushing for a trial.\n\nHere’s the lowdown:\n\n- Reputation: Can Boeing shake off this PR disaster, or is their brand forever tainted? Are we talking Titanic-level sinking, or can they pull a Houdini?\n- Financials: Will the fine and potential legal battles sink their ship, or do they have the cash reserves to weather this storm?\n- Stock Price: Will accepting the deal bring stability and investor confidence, or will the backlash make $BA nosedive? If they reject it, are we looking at courtroom drama that could send the stock into freefall?\n\nLet’s dissect this, meme it up, and predict the future of $BA. Drop your hot takes, memes, and DD below. Are we strapping in for a moonshot or preparing for a crash landing? 🚀📉\n\nReady, set, speculate! 🧠", "id": "1dvzd9h", "created_utc": 1720189893.0, "score": 15, "upvote_ratio": 0.83, "num_comments": 14, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 2 days ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "boeing, as a monopoly, is unlikely to be negatively impacted in the long run from anything the USG is willing to throw at it.", "score": 12, "replies": [{"body": "Yeah, it's all been priced in. I saw the news the other week about the charges when they were announced and more issues with planes. Not to mention the astronauts being stranded... I bought a bunch of 7/5 puts to 172.50 and felt like a genius since I bought a 2DTE 6/21 5c on RKLB that hit.\n\nSo I put several thousand into puts and thank God I did it after hours because I canceled same night lmao. I would have lost several thousand because I was still high off making several hundred a couple days before on my first options order. Be careful regards\n\nhttps://preview.redd.it/6roo958vdvad1.jpeg?width=1439&format=pjpg&auto=webp&s=44b97b241de5ce413432acc06408e886659c9b62", "score": 3, "replies": []}]}, {"body": "[removed]", "score": 6, "replies": [{"body": "I dare one of you regards to try to make the plane related plotline of Casino Royale a reality", "score": 2, "replies": []}]}, {"body": "It is a good deal for Boeing. Take it and move on.", "score": 4, "replies": []}, {"body": "Just gonna leave this here for you OP. I put in an order after the DOJ news was announced. Short of the astronauts returning and their vessel blowing up on reentry, with the wreckage landing on Jesus Christ as he came to take us all to Heaven, Boeing will not go down. It's all been priced in. So thankful I ordered after hours and canceled.\n\nhttps://preview.redd.it/685tmpqfevad1.jpeg?width=1439&format=pjpg&auto=webp&s=0ab3f42b366b9e329c6d6f0fe865425f8cafd465", "score": 3, "replies": [{"body": "Absolutely. No amount of bad news seems to move the stock price down. I bought shares at $180 and was down for a few weeks before it started trending up and I grabbed some June 2025 240 strike calls for $7 that are up 25% already.", "score": 1, "replies": []}]}, {"body": "Boeing might be a monopoly in the US but it’s not one worldwide. If hit with a probation I think they are fucked on the short term. No government contracts for 3 years is a tough. Private companies won’t help either as they will make purchases from overseas, if anything they care about public perception the most. It’s gotten to a point where regular people check if it’s a boeing plane or not when buying tickets. \n\nI think long term boeing will recover but short term I’m bearish. Plus as investigations continue and (if plea is accepted) the oversight comes chances are they are going to find more messed up practices that were previously unknown. \n\nI think many investors want to see this whole saga as a “buy the dip” situation but I don’t think the sales are going to be there for a while. The increases in the stock are mostly speculation.\n\nThem buying spirit was smart though, also makes the blast radius of government action bigger which I think the government might like to avoid. So they might go easier on them.", "score": 2, "replies": []}, {"body": "They got away with murder, I don’t think anything against them will stick. Buy buy buy.", "score": 1, "replies": []}, {"body": "> Stock Price: Will accepting the deal bring stability and investor confidence, or will the backlash make $BA nosedive? \n\n$BA has already been trending up because the extend of the government's sanctions are so low", "score": 1, "replies": []}, {"body": "Doesn’t matter. if they’re the only large manufacturer they’ll still get the corrupt deals", "score": 1, "replies": []}]}
{"title": "Peloton got done bad CMV", "selftext": "[removed]", "id": "1dvzgaj", "created_utc": 1720190116.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 212 | **Previous Best DD** | [x](https://i.redd.it/p9bylok0ae3d1.jpeg) \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "[removed]", "score": 8, "replies": [{"body": "Peloton used to be cool cause of the small community.  Then it blew up cause of COVID, they sold out, and they lost their coolness and community.", "score": 3, "replies": []}, {"body": "My all-time favorite DD here was a two-sentence rebuttal to a discussion when Peleton was a pandemic darling:\n\n\"Sells fitness equipment to Americans. Bearish.\"", "score": 3, "replies": []}, {"body": "Why would they be bankrupt?", "score": 0, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "The gym has endless ig wannabe models for me to look at.", "score": 4, "replies": []}, {"body": "Gyms and treadmills have both existed for a while, far before the pandemic. Gyms have never cannibalized the treadmill or at-home gym market.", "score": -1, "replies": []}]}]}]}, {"body": "The model of expensive hardware + expensive monthly software subscription just isn't worth it for the average consumer. It had big covid interest with everyone getting free gov relief checks to use coupled with massive in-home gym demand. But they were not able to capitalize and scale well enough to make their bikes reasonable. Covid also didn't last as long as the market feared so in-home became less important", "score": 1, "replies": [{"body": "Thank you for being the only actual response. \n\nI can see that, but at-home equipment has been a business for a while. It's hard to equate an entire business which was doing well, happened to have some scrutiny of safety and then dropped is all due to it being a purely covid stock. \n\nGyms aren't as popular as people are making them out to be. Plenty of people hate going to the gym not because of the workout but because of the whole concept of what it is and would much rather enjoy exercising at home.", "score": 1, "replies": [{"body": "Yes that's definitely not the only factor, mainly I believe it was mismanagement with failure to scale into all aspects of home health coupled with high supply chain costs at the time. Expensive bikes and most ppl won't justify", "score": 1, "replies": []}]}]}, {"body": "Peloton should be delisted or bankrupt. They're not an investible company. They should just go private or sell themselves.", "score": 1, "replies": [{"body": "Why is no one giving me a substantive response?", "score": -1, "replies": [{"body": "Because this post isn't real DD at all. It's just commentary on accidents on threadmills.", "score": 2, "replies": []}]}]}, {"body": "welcome to 2021", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Kids/pets getting pulled and stuck underneath", "score": 0, "replies": []}]}]}
{"title": "Update on TSLA $50k YOLO", "selftext": "Hi fellow Regards,\n\nUpdate on [the previous post](https://www.reddit.com/r/wallstreetbets/comments/1cbkn2j/update_on_my_previous_50k_yolo_tsla_call/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nI finally locked in some profit on the calls today.\n\nEvery single dollar from driving Uber at night went into more calls in TSLA.\n\nWill take a really good rest this weekend.\n\nProbably get back to the game next week or even before market-close today.\n\nthanks\n\ncurrent position:\n\nhttps://preview.redd.it/rptdq3skppad1.png?width=1149&format=png&auto=webp&s=383e882de4a853b800655e6cc3689c7835021e89\n\nps. I finally understand, Elon is such a big troll if you know you know.", "id": "1dvzn2r", "created_utc": 1720190630.0, "score": 39, "upvote_ratio": 0.88, "num_comments": 16, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 53 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "When did you buy these?", "score": 7, "replies": [{"body": "Can't remember the exact date l, but based on my [Original YOLO Post](https://www.reddit.com/r/wallstreetbets/s/VkI8F7grXX) should be 3 months ago", "score": 6, "replies": []}]}, {"body": "Good for you OP! Using “bonus” money is the only smart way to use options like this. Otherwise it’s very risky", "score": 5, "replies": [{"body": "Thanks", "score": 2, "replies": []}]}, {"body": "So what's the benefit of debit spreads? Couldn't you just have gotten cheaper longs and even do less money for bigger bang?", "score": 2, "replies": [{"body": "No. This is a great play. Basically paid nothing for the options and so was able to buy many more of them for the same $. Splitting it up into two spreads with different strikes and expirations is also very smart.", "score": 3, "replies": [{"body": "How is this play different from just closing the calls and locking in the gains? If the stock goes down, it doesn’t matter anymore as the cover call secures the profits. If the stock keeps going up, the sell call locks up any further upside.\n\nI can see this play makes sense if the sell call leg has a different expiration date from the buy call leg.", "score": 2, "replies": [{"body": "Here’s my understanding. it means that the price paid for buying the 300 call for instance is partially covered by selling the 305 call. So capital efficiency for this play itself. The calls were so far OTM that it doesn’t really make a difference how high the stock goes. And hence having the two spreads also. You’d want to get out when you can anyways, not hold it forever looking for additional gains.", "score": 2, "replies": []}, {"body": "yeah exactly. Probably make sense if he only like sold 75% of the calls but he already like sold 100% of it. Closing the long call is just better.", "score": 1, "replies": [{"body": "Brought back the short side on Friday with 20k profit", "score": 2, "replies": []}]}]}]}, {"body": "Look at the cost basis ![img](emote|t5_2th52|4275)", "score": 3, "replies": [{"body": "> :4275:\n\nidk I still don't get it. So are those just the opens and closes? Or do you have short premium positions open too. Broker looks like shit tbh", "score": 2, "replies": [{"body": "I bought the long leg 3 month ago, today I sold the short leg at a higher strike, by doing so, it gives me the optionally to reenter if I want to with a small cost", "score": 2, "replies": []}]}]}]}]}
{"title": "Tsla/AAPL gains", "selftext": "", "id": "1dw02kr", "created_utc": 1720191756.0, "score": 31, "upvote_ratio": 0.87, "num_comments": 16, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 522 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "As a Robinhood user I have no idea what this means", "score": 6, "replies": [{"body": "lol open p/l 25,500 and 13,000", "score": 2, "replies": [{"body": "Congrats. Must be nice 🥹", "score": 4, "replies": [{"body": "Thanks :)", "score": 2, "replies": [{"body": "Gonna go buy a corvette now lol", "score": 4, "replies": [{"body": "Make sure to get a z06", "score": 4, "replies": [{"body": "That’s what I’m getting a 2024 C8 z06 going to pick it up in Tampa", "score": 3, "replies": [{"body": "Big W, I have a 2023 z06, loving it", "score": 2, "replies": []}]}]}, {"body": "Put on wallstreettoys", "score": 3, "replies": [{"body": "I will", "score": 2, "replies": [{"body": "You will be first", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "https://www.reddit.com/r/WallStreetToys/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1", "score": 1, "replies": []}, {"body": "https://preview.redd.it/nxa50lpf9ibd1.jpeg?width=1242&format=pjpg&auto=webp&s=6fde633050fc56a498587dabc7a677028fd4bc82", "score": 1, "replies": [{"body": "Got it :)", "score": 1, "replies": []}]}]}
{"title": "TSLA", "selftext": "[removed]", "id": "1dw50au", "created_utc": 1720204519.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 11, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 20 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Tsla Earnings is 7/23", "score": 21, "replies": [{"body": "I truly am regarded", "score": 15, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 7, "replies": []}]}]}, {"body": "Looking at the discounts for Tesla vehicles I wonder what the earnings report will show", "score": 5, "replies": [{"body": "Shorting TSLA 🐻🌈", "score": 3, "replies": [{"body": "You usually would but since Tesla is not a corporation but a cult, I just don’t touch the stock", "score": 3, "replies": []}]}]}, {"body": "Edit: Elon says “Bill Gates will be Obliterated” on shorts ![img](emote|t5_2th52|4276)", "score": 1, "replies": [{"body": "He said “Obliterated “ 😄", "score": 2, "replies": []}, {"body": "What? Is that a real quote?", "score": 2, "replies": [{"body": "It is, and I sold my freakin position up 10$ because I was afraid to hold over the weekend. I was up 50$ at one point I should’ve sold then. remind me when that position is up 200% :(", "score": 2, "replies": []}]}]}]}
{"title": "$META $AVGO $NVDA are making waves and I came to collect. Up $29k!", "selftext": "", "id": "1dw768l", "created_utc": 1720210098.0, "score": 22, "upvote_ratio": 0.75, "num_comments": 10, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 195 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "https://preview.redd.it/4cq4lj1vbrad1.jpeg?width=1290&format=pjpg&auto=webp&s=19c823b1d3d612d0dde7a82a3fb2261db1380568", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/2qn97rb9drad1.jpeg?width=1033&format=pjpg&auto=webp&s=60d0f2b3a8a4bcbab9e1c73700ab2513499badaa", "score": 6, "replies": [{"body": "Happy Guh Day", "score": 2, "replies": []}]}, {"body": "Hmmm...I hope you closed them?\n\nWouldn't they both have expired worthless if you didn't this morning?", "score": 5, "replies": [{"body": "I did.", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|4258)", "score": 3, "replies": []}]}, {"body": "I literally said “I came to collect.” as I sold into the strength of the morning movement knowing the Wendy’s workers buying the contracts I was selling would have nothing at the end of the day.", "score": 3, "replies": []}]}, {"body": "Mr Chase over here", "score": 3, "replies": []}]}
{"title": "Is this a glitch or did some lucky asshole get to buy TSLA @ $153.85?", "selftext": "", "id": "1dw8akz", "created_utc": 1720213062.0, "score": 3, "upvote_ratio": 0.58, "num_comments": 10, "comments": [{"body": "Thanks for your submission!\n\nWe love new and original content here on WSB.\n\nWe have no tolerance for basic templated memes, reposts from the front page, or boomer memes.\n\nYes, this can be a little subjective at times, but we want to show you the best WSB has to offer!\n\nIf you need some guidance, don't hesitate to reach out to modmail and we'll give you some pointers!\n\nA few tips though!\n\n• Don't just submit a chart of the current price. Come on. Google only costs $5 per search. (wait, you guys are searching for free?)\n\n• Reaction gifs are fucking lame. Put that shit in a comment, no one wants to look at your face in real life anyways so why are you making a thread about it.\n\n• Don't repost stuff. All of us are terminally online, how dare you try and make us laugh with an image posted somewhere else. Jokes aside, we don't want to beat a joke to death, so give us some fresh OC and we'll be a lot cheerier.", "score": 1, "replies": []}, {"body": "Every single time!!", "score": 3, "replies": []}, {"body": "Glitch, typical for google chart after hours", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 132 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Looks like someone pulled all their shares  and rebought them", "score": 1, "replies": []}, {"body": "Hi", "score": -4, "replies": [{"body": "Bitch", "score": 0, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Bussy", "score": -1, "replies": []}]}]}]}]}
