{"title": "If 99% of traders can't beat the market, why waste my time learning stock analysis when I can just buy the S&P 500?", "selftext": "[deleted]", "id": "dg6dlh", "created_utc": 1570749847.0, "score": 681, "upvote_ratio": 0.95, "num_comments": 321, "comments": [{"body": "Because index funds aren’t sexy.  At the end of the day it’s true, most of us probably won’t beat the s&p500 long-term, but it’s at least fun to try.  Some of us enjoy researching stocks and feeling more in control of our portfolio. The enjoyment and sense of hope I get from picking my own stocks is worth missing out on the higher returns  I’d get from boring index funds.  \n\nBut if anyone ever asks me for investment advice, I’d still tell them to just put it in the s&p500.", "score": 587, "replies": [{"body": "Exactly how I look at it too. I knew that I wanted to get into equity research around junior year of college so at that point I started \"stock picking\" with the overarching goal of 1. Learning and 2. Hopefully keeping up with the S&P500. To do this and make sure I don't stray too far from the S&P I always made sure at least half if my portfolio was in larger, broader ETFs like VUG and VTV so that a couple bad individual picks wouldnt screw my whole portfolio. \n\nThe way I look at it is if you want to make money and nothing but that, stock picking isn't a good way to start. But if it can teach you about markets and then offer some hope of good returns then it can't hurt if individual investors start with a good and realistic strategy.", "score": 11, "replies": []}, {"body": "This may seem stupid but I've always wanted to ask so I will. When you say \"invest in the s&p500\" are you saying as long as you invest in one of the companies within the s&p500, or is there a specific ticker I invest in? Is there an s&p500 ETF?", "score": 94, "replies": [{"body": "Yes, SPY and VOO are a couple of them.", "score": 189, "replies": [{"body": "Thank you.", "score": 65, "replies": [{"body": "I love how this many people upvoted you  just for saying thank you", "score": 17, "replies": [{"body": "Politeness goes a long way sometimes.", "score": 15, "replies": []}]}]}, {"body": "Go for the gusto! UPRO! And when it tanks, switch over to SPXU and ride that puppy down.\n\nPersonally I love 3x ETFs. I play a lot of different markets and short with the inverse.\n\nTQQQ/SQQQ, UDOW/SDOW, DUST/NUGT, USLV/DLSV, YINN/YANG, etc. I'm just waiting with baited breath for it to crap the bed like last November and December. Yoiks and away.", "score": 4, "replies": []}, {"body": "Out of interest given the likelihood of a recession, is it worth investing in a tracker etf now? Or best to wait, having money ready?", "score": 9, "replies": [{"body": "The common saying everyone loves is “time in the market is better than timing the market.” Usually you should always invest when you have the money unless you know of a major imminent issue.", "score": 48, "replies": [{"body": "if you know of that eminent moment then it's already priced in", "score": 33, "replies": [{"body": "> if you know of that eminent moment then it's already priced in\n\nThis just isn't true. It can price itself into option prices (volatility, and bias in call vs put costs), but there's still always a % surprise.\n\nA good example is earnings reports. Every quarter. If you have a high confidence that a stock is going to do really well and volatility isn't so high, you can definitely make money with a biased bet.\n\nBut there is a difference between investing and trading. Eminent moments are more for trading.", "score": 9, "replies": [{"body": "if you can guess earnings better than the market dominators sure, but you can't", "score": 2, "replies": [{"body": "Speak for yourself. I do. Plenty of people do.", "score": 1, "replies": [{"body": "Betting on something that's 80% likely to happen, can indeed cause the illusion of being smart. Also easy to discount the \"unlucky\" 20% when the stock really plummets as bad luck", "score": 2, "replies": [{"body": "It's the inverse for me. I bet on 10x positions when no one else does. I get about 1 - 3 of these a year and have an 80% win ratio.\n\nThat means 5x+ gains on average. I could lose 4/5 times (which I don't) and still break even.\n\nSome people just got alpha, yo.\n\nLast one was $BYND's q1 earnings, which I sadly missed. Would have been my biggest trade yet :(", "score": 1, "replies": [{"body": "I guess I lost my gamble then    \n\nMaybe you should share your predictions somewhere. Might open up some opportunities as you build a reputation or help push the price up when people copy you after you already bought in", "score": 1, "replies": [{"body": "Hey no worries.\n\nI have actually posted my predictions here on Reddit before with a pretty radical success rate. Opportunities are infrequent, and I'm too much of a low-baller for anyone to care apparently, but I have gotten some thanks for my posts.\n\nI actually think our stock market (although not the economy as a whole) is likely to stagnate for a bit.\n\nI could be wrong, but other than $BYND, it's been a solid six months of the market being pretty much at a standstill. (Look at $SPY's YTD. Peaked around end of March, then wobbling around 290 since.) The US-China relationship is a big deal to us, and that's just so... iffy right now. If only India would finally come through...\n\nOnly other company I can see breaking out right now is $TSLA, but gone are the days where you could catch 30 points up or down overnight.\n\nNo one seems to care about either Trump's or Elon's tweets anymore, so $SPY or $TSLA options are both less profitable (less volatile) and more risky (less likely to make large enough moves to be worth trying).\n\n$TWLO, $COST, $FB and many others have all come to pass. I think there were a lot of good opportunities in $NVDA and $ALGN also (mostly, shorting them, as they were the most overpriced stocks before the market fell in Feb/Mar).\n\nThe biggest problem I see right now is that the biggest economic players aren't doing anything surprising. Meanwhile, stocks like $TLRY and $BYND have valuations that don't even make sense end up in the Fortune 500 overnight because of investor hype.\n\nI don't have enough capital to invest in the long-term, but more traditional stocks are doing really well right now. If you want to keep and possibly earn money, stick it in $MSFT, $AMZN, $GOOG, etc. or just $SPY and forget about it. Something like $TSLA (stock, not options) might be a riskier, more profitable play.\n\nIf I have any good option predictions, I'll post them, but there is literally NOTHING on my radar currently. First time I've been able to say that in 3 years. It's as relaxing as it is frustrating. It honestly feels like the stock market is driven by popularity currently. I think the failed WeWork IPO was a good lesson about how investor trends might be changing and recognizing that volatility over the past couple years has probably been too high.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Even if you  dont know which direction something is going you can sell high iv rank strangles.  And bet on market retraction.  Guys I follow say historically fear is overblown into sell side high iv prices.", "score": 1, "replies": []}]}, {"body": "I don’t think that’s the correct application of the EMH, but okay.", "score": 0, "replies": []}]}, {"body": "People love that saying because it's an excuse to give into greed and impatience. They see others doing well and think, \"Gee, I should have *all* of my money in the market.\" But look at the late 90s before the tech bubble burst. Even stocks like Coca-Cola were bid up to ridiculously high P/E ratios. Timing the market would have been a very prudent course of action. Would have required patience and contrarianism though. Not too common.", "score": 2, "replies": [{"body": "The average market return is positive. Dollars invested now will, on average, have positive return between now and whenever they would have been invested otherwise. \n\nVanguard did a study on this comparing lump sum investing now and dollar cost averaging the same sum over 12 months. Lump sum won like 2/3rds of the time. Can’t find the study now...\n\nIf someone subscribes to the notion that they can time the market (part of OPs original question), then it makes sense that they could keep cash on the side in attempt to beat these stats. \n\nPersonally, I don’t both trying, and I invest what I can right away.", "score": 2, "replies": [{"body": "Statistically, lump sum wins most of the time because most of the time, stocks are going up. Now compare lump sum vs. dollar cost averaging following a significant yield curve inversion and surge of crappy IPOs. The results will be quite different. That said, I don't think buying the S&P 500 at today's levels is a mistake if you're in it for the long term. It's far better than buying ridiculously overpriced bonds. I would just err on the side of caution in light of financial history, and recommend dollar cost averaging.", "score": 2, "replies": []}]}, {"body": "This is mostly true if you are talking about individual stocks but with an index fund there are numerous studies that have shown just getting in whenever you can is more beneficial than trying to time it. Timing isn’t easy if it was everyone would do it. I’m not saying put all of your money in either but to just invest what you can now instead of trying to wait a year or so.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "You lose money to inflation, and you lose opportunity cost.\n\nIf you do nothing and the market goes up 20%, then you just lost out on 20% you could've made.\n\nVolatility is always there, there is is pretty much always something happening in the world. At any given time, you can probably always find a reason to be scared.", "score": 44, "replies": [{"body": "The only time there isnt something to be afraid of is at the top\n\nThe bottom is when everyone is scared\n\nThis sounds counter intuitive but it summed up in all of warren buffet’s best quotes about stocks being most expensive when fear is low and the best time to buy is when fear is highest. \n\nSentiment from active investors (the people who try to outperform by timing the market) are near their all time low in optimism which is usually when the markets turn around. \n\nI’m marginal between building exposure now and keeping money in defensive stocks, gold and REITs (real estate)", "score": 3, "replies": [{"body": "Stocks are at all time highs (ATH) all the time because its generally trending up. You can't really use that, it's at all time highs as justification for being defensive (but you should always invest in your comfort level).\n\n**SP500 is at ATH 7% of all days, within 5% of ATHs 45% of the time.** During bull markets (which you can't really predict ahead of time), its within 5% of ATH 80% of days.\n\nSource: http://rpgplanner.com/all-time-high/", "score": 3, "replies": [{"body": "This is pretty insightful but doesn’t seem relevant to what I meant which was bad news and scary headlines is when you get to “buy low”\n\nWhen Everythint is rosey is the worst time. when things “can’t get much better” is almost by definition when you’re approaching a market peak \n\nIm just rewording what the best value investors have already said. It works because it’s the opposite of what people expect", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Potentially there is, opportunity cost.\n\nI'm not saying there isn't risk, so I understand if you want to play it safe, but there is a cost. \n\nI can't remember the numbers, but only a few days within a year typically define the majority of gains of the year, so waiting a few months might be the equivalent of missing out.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "-$1,000 later...", "score": 1, "replies": []}, {"body": "Markets are always volatile. Just eyeballing VIX, right now isn't really more or less volatile than usual despite the headlines.", "score": 1, "replies": []}]}, {"body": "Meh: i put a quarter of my portfolio in a 2.8% savings account. I’m happy with it", "score": 0, "replies": []}]}, {"body": "The average market return is positive. Dollars invested now will, on average, have positive return between now and whenever they would have been invested otherwise. \n\nVanguard did a study on this comparing lump sum investing now and dollar cost averaging the same sum over 12 months. Lump sum won like 2/3rds of the time. Can’t find the study now...\n\nIf someone subscribes to the notion that they can time the market (part of OPs original question), then it makes sense that they could keep cash on the side in attempt to beat these stats. \n\nPersonally, I don’t both trying, and I invest what I can right away.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes, we are mostly on the same page then. I would like to add that some passive investors know quite a bit about the stock market, and they simply choose to not try to beat the market. This is because the time and energy required to do so reliably is higher than what they would like to spend. I like to think I’m in this category, but maybe I don’t know as much after all. \n\nI also agree that if you are actively managing a portfolio, then you will hold some cash positions quite often.\n\nI’m not sure about using any sound bytes.", "score": 1, "replies": []}]}]}]}]}, {"body": "Of the last 500 recessions predicted, zero have happened.", "score": 5, "replies": []}, {"body": "Sure, but with inflation cash loses value and you lose out on potential returns if the next recession is far out or not so bad", "score": 2, "replies": [{"body": "Inflation is uncomfortably below the Fed’s target rate. We’re talking <2%, and the fear of missing out on gains is a dangerous way to look at investing. Besides, a recession is coming soon, most economists agree within a year, year and a half. I think avoiding market volatility and not worrying about the recession coming, which we know is coming, is worth a <2% inflation.", "score": 2, "replies": []}]}, {"body": "If Trump gets impeached and removed from office, the stock markets will fall, mark my word. It's already starting to happen. This should be good news to many of the young people in this sub, since day in and day out, all they can think of is that this market is too high to invest! I think they'll be surprised when they realize just how long these upturns and downturns can be.", "score": 0, "replies": [{"body": "Lol. Wall St doesn't like uncertainty. \n\nTrump is causing that uncertainty and has single-handedly trashed the market on numerous occasions already being the idiot that he is tweeting 1st grade level economic policies. \n\nYou dont think world markets want the moron who doesn't understand economics 101 out of office?\nGive me a break..\"stock markets will fall, mark my word\". What a joke of a statement.", "score": 5, "replies": []}, {"body": "That’s a load of bullshit.\n\nThe market has been flat under trump for 2 years.", "score": 1, "replies": []}, {"body": "If the democrats do really well in Virginia this year, and democrats poll we'll, and pick a good leader this time, it'll come down and probably there will be a recession.\n\nThe sad thing is some people will blame democrats for the recession when most should realize Trump caused it", "score": -4, "replies": [{"body": "\n>The sad thing is some people will blame democrats for the recession when most should realize Trump caused it\n\nThe democrats are literally campaigning on going after wall street...\nWarren wants to break up the big banks and financial sector, a sector that's 7% of gdp at 1.5 trillion.  Sanders and others want insurance companies to go out of business.  Health care is 17% of gdp.  \nThe left is demonizing big corporations like amazon that employ hundreds of thousands of people directly, millions more indirectly.  The green new deal wants to get rid of fossil fuels.  The big evil Oil and gas drilling sector is 7.6% of GDP and 5% of employment in the us.   I think coal is already on it's way out in the us (too expensive to transport, too dirty etc), but switching all of the world's coal power plants to natural gas could **lower global emissions by 80%**, yet that isnt even on the table because oil=evil.  \n\nRight now, unemployment is at an all time low.   Taxes are low, interest rates are low.  The real estate market is good, the stock market has been great.  The democrats are actually saying out loud they're going to get rid of all of that and start pushing a progressive and socialist ideology.  \n\nYou dont have to like the guy, but how the hell is trump going to be to blame if the democrats win and the economy tanks?  Do you honestly believe the media will blame democrats instead of Trump? I think it's a lot more likely the socialist policies of the next administration (whether in 2020 or 2024) will be the major catalyst for an economic downturn.  The problem will be if it starts looking like trump is going to lose the election, the markets will price that in and the markets will tank while hes still in office.", "score": 3, "replies": [{"body": "That’s the same thing people said about Obama and the Dow Jones doubled under Obama.", "score": 1, "replies": [{"body": "Obama took over when the housing bubble burst and caused the banking crisis. \n\nIs there any news agencies other than fox that dont give him enough credit?\n\nProgressive policies are great when the economy is in the tank.  \n\n Implementing them when the economy is strong will absolutely slow the economy.   \n\nAll of the 2020 democrats are pushing the \"liveable wage\" agenda and using tons of emotion to make you feel bad.  The reality is, .3% of the adult workforce (over the age of 25) makes minimum wage.   Unemployment is so low, employers are struggling to find workers, which in turn, raises wages. \n\n\nBernie and warren are literally saying they're going to go after wall street.  How do you think the dow will react if they get elected?  What's even worse, wall street will price in that decline if their election seems likely.   It's the exact same reason the market went on a 300 point surge the day after trump was elected.  The market had already priced in what they (and everybody else) thought was the probable outcome.   \n\n\nThe democrats are actively campaigning on crashing the stock market, going after banks and the financial sectors, bankrupting the insurance companies, promising free shit to everyone with no way to pay for it, demonizing job creators for creating too much wealth.   \nThey have fucking idiots like AOC that gives herself a pat on the back for \"saving NY $3 billion\" (think of all the good things we can do with that money!!!) but doesnt have the common sense to realize if they dont move there, the state cant give them a goddamn rebate on a portion of taxes they dont pay.   They say things like amazon didnt pay any taxes cuz the system is rigged, without explaining VERY basic business accounting practices that all companies use.", "score": 1, "replies": [{"body": "Dude, Obama wasn’t president during the financial crisis. \n\nCrashing the stock market? Are you on meds?", "score": 1, "replies": [{"body": "Yeah, the collapse happened 2 months before the election,  but we were in a recession when he took office.   \nDo you think Warren or Sanders or any other candidate will be good for the stock market?  If so, you might need meds", "score": 1, "replies": [{"body": "Wait first correct yourself and admit you were wrong, son.\n\nSecondly, if you don’t even know simple history, don’t lecture someone on what would happen. Makes you look ignorant and simple.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It really doesn't matter to me who caused it. All I care about is what actually will happen. One thing I know for sure is that the markets will tumble if he is ousted.", "score": 1, "replies": [{"body": "That’s bullshit and only more myths so you fools can keep worshipping that dogshit criminal.", "score": 1, "replies": []}]}]}]}]}, {"body": "Invest but keep cash on the side to take advantage of drops", "score": 1, "replies": [{"body": "The average market return is positive. Dollars invested now will, on average, have positive return between now and whenever they would have been invested otherwise. \n\nVanguard did a study on this comparing lump sum investing now and dollar cost averaging the same sum over 12 months. Lump sum won like 2/3rds of the time. Can’t find the study now...\n\nIf someone subscribes to the notion that they can time the market (part of OPs original question), then it makes sense that they could keep cash on the side in attempt to beat these stats. \n\nPersonally, I don’t both trying, and I invest what I can right away.", "score": 1, "replies": [{"body": "Keeping cash is part of a diversified portfolio.", "score": 1, "replies": []}]}]}]}, {"body": "Since people have already provided you an answer about timing the market, I'll provide the same answer in another way. About 4 years ago, in 2015ish I believe, people asked the same question. Now, look up the returns over that time period that you would have missed if you had followed the advice to wait.", "score": 6, "replies": []}, {"body": "I’ll go against what everyone else is saying to you right now, and tell you that I’d personally wait until the market tanks. Most economists think a moderate recession is looming within the next year or so. And we’ve already seen slowdowns in manufacturing and job creation is increasing at a decreasing rate. We’re also in the longest bull market in history so we’re near the peak. \n\nPeople are telling you not to wait because you might miss out on gains but if you decide to wait I think you’ll miss out on large losses. The markets are so irrational right now and the only movement we’re seeing is due to this bullshit trade deal with China that never pans out, then gets played up. The markets don’t know what they’re doing, and we’re at an insane height of irrationality and fear. Nobody knows what they’re doing, so take the advice in the comments with a grain of salt from all the armchair financial advisors who like to throw around financial buzzwords. Sure, you’re losing 1-2% of your cash value to inflation, but putting all your money into an index fund at the near peak of a bull market is risky. When the market does tank, you’re gonna have double digit losses. So I would wait and accept the 1% inflation and other opportunity costs and buy the dip once the recession does hit.", "score": 12, "replies": [{"body": "Assuming your time horizon is long term - waiting is the worst thing you can do. The longer you wait, the deeper the decline you need to make up for missed growth. At some point you need a decline that has never been seen before to make up for your lost growth.\n\nWhat people don't realize is how important dividends are for growth. Total return of a portfolio on average is made up of 40% from dividends. When you wait, you guarantee that you don't accumulate dividends.\n\nWhen you are invested and accumulate dividends and the market goes down you are dollar cost averaging reinvestment and buying the market on the cheap. You are accumulating more shares and when the market returns you now have more shares that are now worth more. \n\nDon't wait. Invest now.", "score": 11, "replies": [{"body": "Great explanation 👍", "score": 4, "replies": []}]}, {"body": "People were preaching this same thing in 2012, 2013, 2014, 2015, 2016, 2017, and....................\n\nTiming the market is folly", "score": 7, "replies": [{"body": "If Hillary wins in 2016, or if the Democrats were able to win the house and/or senate in 2016, there would be no massive tax cuts to let companies buy back their stock in 2018 at the levels that they did. We had a sugar rush in 2017 and 2018 that wouldn't have happened if the elections weren't overwhelmingly in favor of Republicans. Not that I think either party has great economic policies, but the tax cut was a major boost to the stock market.", "score": 1, "replies": []}]}, {"body": "Lets assume you can invest 500$ a month, but you feel the stocks are overpriced currently and recession is on the horizon, you want to find a better entry point. Lets say recession does happen 12-15 months from now. Thats close to 6-7k invested tracking losses. In your theory, you want to invest the 7k when the markets are down, possibly suffering from a severe recession. There are job losses everywhere, people feel insecure and there are lots of negativity everywhere. Would you want to keep the 7k at hand to feel safe or would you put that entire amount on stocks that are tanking?", "score": 1, "replies": []}, {"body": "Besides, inflation will likely slow down further in the recession. People here are nuts to suggest putting money in now..", "score": 0, "replies": [{"body": "Yeah we should all just wait it out. Forever. Because that way the market can never take our money. pshhh not. It's earnings season in the era of volatility. FD some options and in the wise words of our saviors over at r/wallstreetbets either drive north to the yacht store or south to the welfare office.", "score": 3, "replies": []}]}]}, {"body": "Put it this way, I was asking this question 18 months ago when things were turbulent and Trump was saying Trump things. The market has been up 12% since then.\n\nIf I didn't keep investing like I do, I would have missed out on gains that are greater than the average yearly gain. Not to mention missing out on dividends.", "score": 2, "replies": []}, {"body": "Just invest regularly while you can, very hard to predict the market. Invest regularly what you can afford and don’t let the short term ups or downs change your approach or scare you", "score": 1, "replies": []}, {"body": "time in the market beats timing the market. And if we get a crash? Jack Bogle would advise you to keep investing, on a frequent basis. Bogle said this during the 2008 crisis.", "score": 1, "replies": []}, {"body": "No one can predict the future. Trying to time the market is basically just gambling even if you think you have solid information, which you probably don't. Even the FED can't be sure their data is all totally accurate, complete, and relevant at any particular point in time. \n\nIf you buy a little every time you get paid or get some extra cash, the odds are good that you'll come out ahead in the long run even if you hit some ups and downs in the short term. If prices drop, just buy more. If a total economic collapse happens, then you'll have bigger things to worry about anyway, but the odds of that are probably pretty low.", "score": 1, "replies": []}]}, {"body": "...and IVV", "score": 2, "replies": []}, {"body": "SPY and VOO also don't beat the S&P500", "score": 1, "replies": []}, {"body": "I thought we were doing couch potato?\n\nlike the Canadian Couch Potato portfolio. I'll look into those. thanks", "score": 1, "replies": []}, {"body": "Are IVV and SSO also?", "score": 1, "replies": []}]}, {"body": "It means investing in an ETF that tracks the broader index (SPY, IVV, VOO), that way you have exposure to the overall (US) market while limiting the downside risks that come with only using single stock selection to build out a portfolio.", "score": 22, "replies": [{"body": "Thank you. I appreciate you taking the time to respond.", "score": 15, "replies": []}, {"body": "If you still want to diversify, invest in indexes across the world. My pension is linked to US, UK, Europe and Emerging Markets.", "score": 3, "replies": []}]}, {"body": "VTSAX all day!!", "score": 3, "replies": []}, {"body": "No he's referring to investing in literally all of them through an index fund.", "score": 2, "replies": []}, {"body": "It's not actually buying a share of the S&P 500 like you hear on the news. You'll need to buy a mutual fund/ETF that's been packaged with the same companies as the S&P. The S&P is the benchmark -look for a low net expense ratio fund.", "score": 1, "replies": []}, {"body": "SPY, VOO, IVV to name a couple...", "score": 1, "replies": []}, {"body": "UPRO if you want leverage.", "score": 1, "replies": []}, {"body": "People are referring to S&P500 index funds like VOO. They aren't traditional stocks.", "score": 1, "replies": []}]}, {"body": "Yep I second this. Most of us arent doing it because we think we can beat the S&P. \n\nHeck most of us probably have money in index funds aside from what we use to trade stocks. \n\nBut we do it cos it's fun and stimulating and it's good to always be learning things.", "score": 8, "replies": []}, {"body": "I agree with this.  Most of my money is in index funds. But I do have a little in individual stocks.  \n\nTechnically those stocks performed better but much more risk taken. I consider that luck. It’s a nice win, but I’d have an ulcer if all my money was in those stocks.", "score": 7, "replies": []}, {"body": "Also, the more people who just passively invest in the S&P 500, the more inefficient the market becomes and the easier it is finding overvalued or undervalued stocks.", "score": 3, "replies": []}, {"body": "This\n\nOptions, forex,  and picking stocks is exciting. SPY is a safe bet, but nothing here is risk free, just risk averse. I like control and being able to pick my stocks is fun.", "score": 2, "replies": []}, {"body": "Entertainment value is worth at least 2% of your potential gain lol", "score": 2, "replies": []}, {"body": "I think the \"fun\" part is underrated. I was gun guy before I crunched down on finances. Now for fun I play with my money. I dont have a lot because Im early in my career, but the amount of research you can do is infinite. Now I have 2500 split between SPHD, DHS, SPHQ, SCHD, RHS, and DON. In the long run its going to be a lot more valuable than range time and ammo. Ive lost access to the same amount of money in the same amount of time, but I havent really lost my market money. Its just not in my checking account. Its just as fun to play with and I dont need to drive anywhere or worry about any licenses.", "score": 1, "replies": []}, {"body": ">I’d still tell them to just put it in the s&p500.\n\nThis is terrible advice. \n\nIndex funds, yes, absolutely. But simply buying the S&P500 index is not a good idea. Where is international exposure? Small caps? Real estate? Bonds? \n\nIf you want just *literally one* fund, pick a target date retirement fund. \n\nDo not have 100% of your portfolio in VOO, etc.", "score": -1, "replies": [{"body": "The money warren buffet is leaving behind for his wife and kids is 100% going in to the s&p 500 when he dies.  But warren what about international exposure!?!? I could listen to your advice....or listen to warren buffets advice.....hm.", "score": 0, "replies": [{"body": "Not only are appeals to authority logical fallacies, but Buffett and his kids are billionaires and don't invest like the rest of us. There is a difference between growing wealth and maintaining wealth.\n\nRather, explain to me why I should be 100% in only the 500 largest American companies?\n\nAdditionally, why aren't any of Vanguard's retirement date funds 100% VOO?\n\nBecause it's a **terrible** idea.", "score": 1, "replies": [{"body": "1.) Warren Buffetts kids aren’t billionaires.  He’s made it very clear he’s leaving them barely anything and donating the rest to charity.  \n\n2.) If he was only concerned about maintaining wealth as opposed to growing it, bonds would make much more sense.  \n\n3.) Warren Buffet has recommended going ALL IN on the s&p 500 to retail investors, not just his heirs.  \n\n4.) Why are none of Vanguards target date retirement funds 100% in the S&P500? Because retirement funds are risk-averse by nature.  They are not picking out investments that they think can yield high returns, they are picking out ones they feel are very safe while ideally producing moderate returns.  And you better believe that all of these retirement date funds will almost definitely underperform the s&p 500 long-term unless there is some catastrophic economic meltdown immediately before the retirement date.  But that’s a risk that retirement fund managers can’t take.  \n\n5.) Why should you invest 100% only in America’s 500 largest companies? Because if you don’t you WILL underperform them (long-term).  There is conclusive evidence that the vast majority of retail investors and even most professional money managers can’t beat the s&p over any ten year period.  So you’re saying investing in the gold standard of market returns that almost no one will have any chance of beating is a TERRIBLE idea?   \n\nI disagree and so does the greatest investor of all time.", "score": 0, "replies": [{"body": ">Because if you don’t you WILL underperform them (long-term).\n\nLol. Not only is there is literally no evidence whatsoever that this is true, at total American market index fund is mostly S&P. The reason you diversify away from S&P is because American large cap companies don't always outperform.\n\nInvesting in **only** the S&P500 is a terrible idea.", "score": 1, "replies": [{"body": "If you think I’m blindly making all this up please just do a google search on “what are my chances of beating the s&p500.”  Again, I’m talking long-term (10+ years).  \n\nAnd again, Warren Buffet has recommended retail investors to go ALL IN on the s&p500.  \n\nAll I’m saying is the chances of you outperforming it long term are slim.  Statistics and the greatest investor of all time are on my side and to dismiss that is just ignorant.", "score": 0, "replies": [{"body": "> If you think I’m blindly making all this up please just do a google search on “what are my chances of beating the s&p500.” Again, I’m talking long-term (10+ years).\n\nIfyou think I'm blindly making all this up please just do a google search on \"S&P 500 returns vs. MSCI Global Index returns.\" Again, S&P regularly under performs the total American and total world indices. \n\n> And again, Warren Buffet has recommended retail investors to go ALL IN on the s&p500.\n\nAnd again, appeals to authority are logical fallacies. \n\n> All I’m saying is the chances of you outperforming it long term are slim. Statistics and the greatest investor of all time are on my side and to dismiss that is just ignorant.\n\nOutperforming the S&P is not hard. It happens all the time. Look up annual returns for VTI compared to VOO. Statistics and more of the greatest investors of all time are on my side. \n\nOr IDK, maybe go talk to any local financial advisor, and none of them will tell you to buy just VOO and sit on it. However, they'd probably be okay with you just buying a target date retirement fund and sitting on it.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "So basically you're not an investor but a gambler. The lesson of investing is don't do it based on emotion, as above, but ruthlessly go for returns. That's why investors who want to make money  will choose index funds and traders who want to play the stock roulette for personal enjoyment will miss out.", "score": -5, "replies": [{"body": "Well Warren Buffet invests into individual stocks, yet he beats the market by twice as much on average. \n\nObviously he’s an outlier but your comment is unnecessarily pessimistic.", "score": 5, "replies": [{"body": "Sorry to break it to you pal, but you ain't no Warren Buffet.", "score": -5, "replies": [{"body": "Obviously I’m no Warren Buffet. The point is the most efficient way to beat the market is value investing into individual stocks. For you to call it gambling is false. There’s plenty of investors who have consistently beaten the market over decades by investing into individual stocks.\n\nThere’s nothing wrong with buying Indexes/ETF’s, it’s a perfectly fine strategy, no one is denying that. Even Buffet knows it outperforms some hedge-funds. You’re just acting like an egotistical twit who’s bashing on everyone else’s strategy.\n\nEdit: Turns out you’re posting about shorting stocks on r/wallstreetbets and you’re here criticising other people’s strategy. Go back to WSB, thanks.", "score": 1, "replies": []}, {"body": "Head back to personalfinance and do some paper trades you mong", "score": 0, "replies": [{"body": "You are a wit.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I learned decades ago, most people arn’t in it to win it. They just want some casino action from home.", "score": 90, "replies": [{"body": "It's gambling, but people don't look at you as a gambler when you say you're invested.", "score": 12, "replies": [{"body": "That’s not what he means. Investing can be a gamble but that doesn’t mean every investor is a gambler. There is a risk yes but my favorite quote about beating the stock market? \n\n“All it takes to beat the market is time.”", "score": 4, "replies": [{"body": "Yea, I'm speaking to what the other person said about people just wanting some casino action at home, that's your typical trader that like gambling, and telling people \"I invest\" doesn't get the dirty looks that \"I play slots for a living\" gets.", "score": 1, "replies": []}]}]}, {"body": "I enjoy the action with some money I’m okay with losing, but my retirement money is in a very sensibility distributed basket of index funds.", "score": 1, "replies": []}]}, {"body": "Warren Buffet would say just to put it in the SP 500", "score": 294, "replies": [{"body": "Do what this person says.\n\nMost investors do not have the time, patience and discipline to dedicate to the knowledge and wisdom of beating the S&P 500. \n\nI beat it last year and I'm beating it this year (see https://www.reddit.com/r/stocks/comments/dee7uc/folks_who_have_been_investing_in_individual/f2uv1b5/) but in my retirement account I'm holding all ETF's in international funds, S&P 500, my local country, bonds, etc because I know how insanely difficult it is to beat the S&P 500 year in and out over 30 years. \n\nI may change my opinion if I beat the S&P 500 over a decade or more but until now, it's ETFs for my retirement and being a stock picker in my taxable account.", "score": 127, "replies": [{"body": "From a tax prospective, wouldn't it make more sense to trade (buy and sell) stocks from an IRA roth account ? I slowly shifted my index efforts into a regular account and do my trading through an IRA roth. That way I don't get taxed on stocks I sell for a profit.", "score": 13, "replies": [{"body": "Yes. You shouldn't be putting any money into any taxable accounts (other than emergency fund) unless you've already maxed all tax-advantaged accounts available to you.", "score": 7, "replies": [{"body": "This is not true for everyone. What if they are saving to open a business or buy a home?", "score": 1, "replies": []}]}, {"body": "Where I live the government does not offer a Roth IRA. I have registered accounts with the government which allow for tax free and tax deferred treatment. However, I can only contribute a maximum amount each year which I do. \n\nThe rest of investable cash goes into my taxable account to earn more than inflation.", "score": 3, "replies": []}, {"body": "Yes, assuming you qualify.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 42, "replies": [{"body": "Right, but that doesn't make his advice bad. If a bunch of fat people keep hurting themselves trying to do MMA at home, it's not bad advice for the world champ to tell them it might be better to just watch on TV.\n\nPeople hound him for advice, but he knows the statistics and odds. He knows 95% or more of people are going to lose money. Hence his advice.", "score": 58, "replies": [{"body": "[deleted]", "score": -15, "replies": [{"body": "Aren't downvotes suppose to work that way, I don't agree so I downvote, just saying", "score": 8, "replies": [{"body": "Lol.\n\nIt's not how it's supposed to work, but that's how everyone uses it. It's the same reason why Facebook only has a like button and why posts encouraging genocide often have tens of thousands of likes", "score": 3, "replies": []}, {"body": "[deleted]", "score": -7, "replies": [{"body": "I'm just gonna come out and say it's because you're acting like a total asshole.", "score": 5, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "\n>Honestly frustrated that there are so many etf pushing comments on a stocks sub. Goal is to talk about stocks not to make r/investing 2.0\n\nWhen a total noobie comes in wondering if they should go stocks or etfs, prudent advice is etfs. If someone said which is better goog or amzn, you probably wouldn't get many people recommending to just buy an index.\n\nIf I went to an advanced forex trading forum and said, I'm completely new to investing, should I go forex for my ira or s&p500, I think most people would say just stick with the s&p500.", "score": 2, "replies": []}]}, {"body": "Nice to see someone admit their shortcomings as a biased and overly sensitive individual. Have an upvote", "score": -3, "replies": [{"body": "Not sure what he expected. People just generally don't like other people acting like jerks, especially when it's unnecessary to the discussion", "score": 2, "replies": [{"body": "I was talking about you", "score": -1, "replies": [{"body": "Yeah I get that", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "That’s a bad analogy...\n\nSomeone needs to go get food at a far away grocery store through a dangerous road, they have 4 options \n\n1. Walk, it’ll take the longest and may not get there by the time you want to but it’s very safe\n\n2. Drive yourself, it’s a dangerous road and unless you’re a skilled driver you have a high chance of crashing \n\n3 . Hop on a bus that goes to grocery store frequently, you still run the risk of crashing but the bus has been doing this for decades with only a few problems \n\n4. Hire a race car driver, he’ll either get you to the store right away but there’s a higher chance of crashing horribly if you choose the wrong driver \n\nNow replace the store with retirement, walking with fixed income, driving yourself with trading, the bus with passive broad market etfs, and the race car driver with various fund managers.", "score": 3, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "You do realize that etfs have managers right?", "score": 1, "replies": []}, {"body": "Edit: people don’t agree with me so they show that disagreement through the proper system but I don’t like people disagreeing with me so this is an echo chamber", "score": 0, "replies": []}]}]}]}]}, {"body": "Yeah because buffett is an experienced, sophisticated investor with a hundred billion in capital on hand. The average person is not sophisticated and is better served buying an index fund. \n\nBuffett isn't being deceptive here.", "score": 18, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "buffet started out running what was essentially a hedge fund.", "score": 3, "replies": []}]}]}, {"body": "Brk.b then", "score": 10, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "haha thats great", "score": 3, "replies": []}]}]}, {"body": "I agree with that, but it was also his job to invest and research stocks.  The common investor probably can't reliably beat the Sp500", "score": 6, "replies": []}, {"body": "Sure. Buffet also knows the stuff he is doing. The average dumb money doesn't.", "score": 5, "replies": []}]}, {"body": "But he doesn't do it, not even a bit. People quote him like hes the Bible of investing. He had a glorious record but lately he's overrated.", "score": 1, "replies": []}, {"body": "He says buy S&P, but then he goes and loses billions on ketchup. So take it all with a grain of salt...", "score": -8, "replies": [{"body": "there's plenty of salt in ketchup!", "score": 10, "replies": [{"body": "Hadn’t thought about it like that...", "score": 3, "replies": []}]}, {"body": "If you buy the S&P you also buy a bunch of losers (literally you’ll buy the worst out of 500 companies!). It’s OK if all your positions aren’t winners.", "score": 3, "replies": []}, {"body": "Well, he hasn't sold those shares at a loss, so I'm pretty sure he hasn't lost anything yet.", "score": 3, "replies": []}]}]}, {"body": "I feel this is similar to asking why should one have their kid dedicate lots of time to play a high school sport if the chances of going pro are very slim.\n\nI won't lie, the chances of trading and coming out on top are very, very small... yet not 0.  I think it just takes a lot of time and dedication but eventually some can figure out a strategy that works for them.\n\nI researched lots of theories and strategies, realized that there are inefficiencies, where people struggle is where we're human.  I mean, in theory you should at the very least break even? If you are dead wrong all the time, why not just do the opposite of what you do? etc.\n\nIt all came down to a lot of statistics.", "score": 31, "replies": [{"body": "90% of entrepreneurs fail, but yet ppl start new businesses. \n\nMarkets are hard to beat but that doesnt make them efficient. \n\nThe more money that goes passive the dumber the markets are.", "score": 17, "replies": [{"body": "exactly, that's why I find it a silly argument (not OPs question but ppl that say that) \n\nas long as you're aware you're not going to be making millions starting out I think its fine.", "score": 4, "replies": [{"body": "Agreed. The whole thought process seems very millennial.  No offense to anyone but just bc its hard doesn't mean no one can succeed.", "score": 1, "replies": [{"body": "I can agree on that.  To be fair though, some people actually can't \"work harder\" - for example, if you're going to college and working a lot, that leaves almost no time to also focus on learning markets.  Its just a fact of life.  With that said though, its certainly not impossible.  I feel that 99% of traders lose money stuff is inflated when you have several people just throwing in their half baked \"try\" ... its also something you can't really master in just a year.  Lots of people don't stick with it.", "score": 1, "replies": []}]}]}]}, {"body": "ive tried so many different strategies even complicated international arbitrade with equities/fx across the world and having to pay a backoffice staff to essentially find counterparties to unwind these trades for various costs, which is another game in and of itself. all these strategies go away over time with algo's getting into it, stuff like that was one of the last things to go due to the complicated nature of it, but now those 'spreads' are gone. making 1%-3% from 4pm and selling at 8pm in japan are gone.\n\nive found my real strength and strategy the past few years in trading futures and just trying to make 1-3k a day by slowly making 200-500$ a trade and booking the profits. do that 4-6 times a day you got a nice life, but it took years of trading and honing my discipline to achieve this. i also try to make a few hundred bucks in penny stocks and longer term swing trades i trade around to grind out another few hundred bucks a day.\n\n&#x200B;\n\nsometimes im wrong and lose more than 3k and i turn everything off for the day. ive noticed i rarely go down more than 2k and end up positive again on the day. gotta know yourself.", "score": 6, "replies": [{"body": "yep, exactly.\n\nI love how people say its impossible or whatever and its true that its very, very difficult but you do have people that are able to do it time and time again.", "score": 1, "replies": []}]}]}, {"body": "Remember:\n\nTrading =/= Investing\n\nLearn companies, analyze whether it's good to enter now, make adjustments as needed based on current and expected conditions. You should only sell when you have somewhere else you can put that money to use, like another stock you've analyzed that now has more favorable conditions.", "score": 98, "replies": [{"body": "What is your Annual return rate ?", "score": 24, "replies": [{"body": "trading = gambling\n\nyou are working with incomplete data, against a market that can make irrational moves.\n\ndiversify and leave your self a stop to get out.", "score": -13, "replies": [{"body": "It is gambling, but the odds of winning can be substantially higher than 47%(casino) because of the incomplete data you're given. In casinos, you're given no data, it's completely random.", "score": 9, "replies": []}, {"body": "No it’s not gambling. Gambling is spinning the wheel and hope it lands where you want it to. \n\nTrading without thinking is gambling, but trading with research is not.", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Thanks for the advice, Mr. Buffett.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "They’d say the opposite...", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It’s been legally distinguished from gambling, and if you did one unbiased google search you’d have found the same along with countless pros agreeing with the ruling. Try a tiny bit harder if you’re saying something like “I’ve NEVER heard a pro say anything BUT this”.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I know you are talking about individual investors but I can give you my perspective from the professional's point of view having both invested in managers trying to identify those that would outperform the market on behalf of clients and being the manager trying to do so for clients. \n\n90% or so of equity investors benchmarked to the s&p 500 fail to outperform the benchmark but that fact changes as you go down market cap levels. Closer to 50% of professionals benchmarked to the Russell 2000 (small caps) are able to outperform. Those numbers change year to year depending on how concentrated the performance of the index is.\n\nProfessional managers also use a trick to take advantage of the distribution of random returns by \"incubating\" multiple strategies. So a manager will will start say 12 strategies with internal money which they are not marketing outside the firm. After about 5 or 7 years maybe 1 to 3 will have outperformed with a solid return profile. The manager will then begin marketing the strategy using the incubated returns which they can do legally because they were real returns that were generated. They can then say yes we have outperformed over x years.\n\nIn some ways individual investors have an advantage over pros because you don't have to rely on client dollars that can get pulled if you don't perform short term, even if LT performance and strategy is sound. Also we typically have to fill some strategy niche that clients want. If you are a value manager and you like a bunch of \"growth\" companies, you can't buy them. Same goes for non dividends and cap size. Some managers have strategies with few restrictions but it is hard to find institutional clients because they want to do the asset allocating and they don't know what you will be in ahead of time. \n\nThe problem individual investors have is the vast majority have no idea what they are doing, which is the best way to explain it. They do no valuation work or terrible valuation work. They get emotional, they buy for dividends disregarding everything else or avoid/sell companies going down on bad news without doing any math, have no risk management strategy, or simply just don't dedicate enough hours to what they are doing. Plus we have expensive software that most can't afford which just helps do things faster but not necessarily better. If you are not going to dedicate at least 20+ hrs per week to it and learn some valuation techniques and risk management discipline you should absolutely be in an s&p 500 etf.", "score": 61, "replies": [{"body": ">If you are not going to dedicate at least 20+ hrs per week to it and learn some valuation techniques and risk management discipline you should absolutely be in an s&p 500 etf.\n\nMandatory for individual investors. One of my mentors initially informed me to spend daily 1-2 hours and do some analysis during weekends. He is my eye-opener.\n\nThis is the best answer !  Being retail investor, I learnt the trick after some experience with few volatile market.", "score": 13, "replies": []}, {"body": "The note on the fact managers underperform because of clients pulling out, is very insightful", "score": 3, "replies": [{"body": "I don't think the manager will underperform purely because investors pull out but remember these people are in the business of performance so when performance is bad clients leave, other clients don't like that because they don't want to be seen as the suckers who stayed plus somebody somewhere is doing well while you aren't, maybe you lower your fees to keep clients, bonuses start going down maybe a few talented analysts get recruited away now remaining analysts have to cover companies they don't know very well. It's constant pressure on everyone both individually and as a firm that retail investors don't have.", "score": 4, "replies": []}]}, {"body": "Any recommend books on valuations techniques and stock picking strategies?", "score": 1, "replies": [{"body": "For valuation I think Aswath Damodaran does as good a job as anyone in explaining best practices. I also like some of Bruce Greenwald's work but have not read his entire book. For strategies I think conceptually Morningstar's moat concept is helpful but the best book I think I ever read on investing was Seth Klarman's Margin of Safety so if you can track down that pdf it's worth a read but the actual book goes for something crazy on Amazon so maybe not one to buy.", "score": 1, "replies": []}]}, {"body": "> If you are not going to dedicate at least 20+ hrs per week to it and learn some valuation techniques and risk management discipline you should absolutely be in an s&p 500 etf. \n\nWhich s&p 500 etfs?", "score": 1, "replies": []}]}, {"body": "Results above and below the averages is a zero-sum game.  If you can't beat the average, stick to the average.\n\nNow whether the S&P500 represents the \"average\" is a whole different topic.  But the first point is true.  If you can't beat the average, you can achieve the average for very low cost.", "score": 45, "replies": [{"body": "What percentage is average to you?", "score": 4, "replies": [{"body": "Global stock market at market weight.", "score": 5, "replies": []}, {"body": ">the\n\nThat figure is never static and continuously moving, no?", "score": 8, "replies": []}]}, {"body": "> Results above and below the averages is a zero-sum game. If you can't beat the average, stick to the average.\n\nhow is that relevant. the point of the post is about benchmarked to the sp500", "score": 2, "replies": []}, {"body": "You can also beat the average for a very low cost. Simply invest in an equal-weight ETF like RSP instead. It rebalances quarterly, selling stocks which have gone up and adding to those that have gone down.\nThe equal weighted S&P 500 ETF has significantly outperformed the market cap weighted index over the long term.", "score": 1, "replies": []}]}, {"body": "I haven’t seen this mentioned yet, so I will put it out there. \n\nBuying a stock is like supporting a company and all they do. Buying an index is buying each of those stocks, and supporting each of those companies. \n\nThis includes your cigarette companies, oil companies, firearms manufacturers, walmarts, etc. Some people are okay owning these companies, some are not. \n\nNot a huge fan of Disney? Well, if you own VTSAX you support Disney. Don’t like cigarettes? If you own VTSAX you support companies that sell cigarettes. \n\nBy investing in individual stocks, you can invest your values.\n\nEdit - next time you see someone say “fuck facebook” on r/investing or a similar sub, check out their posting history. Many of the same people also advocate investing in the S&P 500 or similar broad market index.", "score": 8, "replies": [{"body": "Investing is about making money. It's not about your personal values. Besides, you buying the company's stock does benefit them, per se. It's just your conciousness telling you that investing in something is morally wrong, when in reality you don't affect the demand for Disney products, oil, cigarettes, etc. with your share purchases and in most cases you have no effect on the decisions the people who control these companies make by simply owning their shares.", "score": 2, "replies": [{"body": "We differ here. Investing is deeply personal to me. For me, it is absolutely a practice in following my own personal values. For others it may not be, and thats okay. If my original post made it seem like “there is only one correct way to invest”, then I apologize. \n\nI agree with your second point. In most cases, my retail stock signals have very little impact on what a company does. But I see it like election voting - I vote my values, and if enough people agree with my values, that becomes quite powerful.", "score": 1, "replies": [{"body": "Always welcome a civil discussion, it seems pretty rare here on Reddit these days... Anyway, I can see your point. And you're likely not missing out on too much gains by eliminating certain companies from your portfolio. Probably a small price to pay for saving out planet and civilization :) \n\nHowever, the additional hassle of assembling my own portfolio instead of simply investing in index funds is something that I can only see myself doing when I retire, or at least, have enough stability in my life to worry about such things. I would argue that your consumer behavior is going to affect certain companies in a much more direct and effective way. Stop buying their products and services, advocate for others to stop buying them - and see whole industries collapse. Of course, you wouldn't want to be invested in these corporations when they go bankrupt - so in a sense you are smart by staying away from them in the first place. I will have to try to time the moment when oil or cigarettes finally go out of fashion, which could prove difficult.\n\nCome to think of it, the best option would probably be to still invest in these companies and try to collectively aquire a stake that will allow to convert them to industries than you like more. Make oil companies invest in green energy generation, cigarette companies invest in vaping or marijuana... and so on. What do you think?", "score": 1, "replies": []}]}]}]}, {"body": "It’s an exaggeration with some truth to it. Lots of people shoot for a lotto ticket trade instead of actually treating it like a long term investment. Yes, even trading can be a long term investment! \n\nIt’s an investment that takes some serious commitment. Most people can’t or won’t do that. Is it 99% who try fail? Probably not. \n\nSo if you don’t find messing with your money fun or interesting, get an ETF and ignore it. Nothing wrong with that either. You’ll have time to pursue something else.", "score": 13, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You can beat the market in any given year.  What they mean is you WONT beat it over a longer period of time.  Even the top professionals in the world rarely beat it over a ten year period.", "score": 12, "replies": []}, {"body": "I enjoy trading. So as long as I’m happy with my performance, I’m going to keep at it.", "score": 4, "replies": []}, {"body": "Many managers don’t beat it because you have to net the costs of trading and taxes. Just food for thought.", "score": 2, "replies": []}]}]}, {"body": "The S&P500 is just a basket of stocks sorted by market cap. It says nothing about valuation or if these businesses  meet your goals and risk tolerance. Therefore, many investors prefer to tailor their portfolio according to their goals, which includes buying companies that are not part of the index (SP500). \n\nBuying or selling a stock is easy, but that alone is not investing. Investing is a partnership with the business. You are buying a piece of a business. Therefore, the serious investor should think like a business owner, read their financial reports, understand what that business does, what valuation metrics are relevant to that company and industry, and identify if it meets their quality criteria. That takes care of \"what\" to buy. \n\nThen you need to calculate how much that business is estimated to grow and how that aligns with the intrinsic value of the business. If you buy a company when fairly valued, your performance will be a function of the business performance. That takes care of \"when\" to buy. \n\nMy goals when investing are oriented towards safety, income, and consistency. Many companies from the index fail to meet this criteria.  Therefore, I don't do index investing, because I don't want to be invested in these companies.\n\nThe other factor is valuation - when purchasing the index, I cannot choose to buy a company at or below its intrinsic value.  I need to buy the whole package with all companies, which will contain overvalued companies too. Buying any business when overvalued drags return.\n\nThe advantage of holding individual stocks is that the better performing stocks can be harvested (sell high) rather than having to sell a piece of everything (selling low) - besides buying them with a higher margin of safety. \n\nThe financial theory is just part of the puzzle. Discipline to stick with the plan and separating emotions is the other part that is hard to implement, and it's more of a soft skill (temperament) than hard skill. Many also mix up trading techniques (market timing, price movement) with investing techniques, which should be geared towards the business and its valuation.\n\nAnyone can tag along the business performance of the companies that they choose to partner with. That's why Buffett likes to call the stock market as a supermarket of stocks. You can buy a pre-packaged product with no effort (indexing), at the cost of not choosing quality and valuation. Or you can build your own portfolio, one company at the time, at the cost of higher time and effort to understand what that business is about, and how to evaluate quality and valuation.", "score": 22, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I understand what you are saying, however this criteria is not enough to determine quality - take for example Macy's or DXC technology, they have been shrinking earnings and cash flow, despite positive profit - that drags stock price down. The index doesn't account for future earnings growth, just past recent profit. Also, the index says nothing about valuation because not every company is fairly valued at all times. The index is a valid way to invest, but that doesn't mean that the individual investor can't tailor a portfolio to their goals and risk tolerance, a company at a time.", "score": 0, "replies": []}]}]}, {"body": "Most people on this sub aren’t old enough to remember the 38% drop in the s&p in 2008. The question isn’t if you can deal with consistent returns we’ve seen on the s&p during one of the longest bull markets in history, that’s easy, the question is how much of a loss are you willing to psychologically endure before you sell out and accept the losses. A diversified portfolio won’t eliminate your losses, but you wouldn’t end up losing 38% in one year most likely. If there’s any chance you might need the money you plan to invest if there’s an economic downturn, I would highly advise more diversified investments than just a basket of the largest companies. If you don’t need the money for 20 to 40 years then go right ahead and you’ll likely average about 6% annually", "score": 6, "replies": []}, {"body": "You shouldn't.  But I do, I've managed to beat the market since 2011 by quite a bit.  But ask me how I do after the next recession - I have a strategy, a thesis leading up to it, but this is where the rubber meets the road. I think many people (certainly > 1%) could beat S&P in a bull market by weeding out the under performers from those 500, and focusing on fundamentals:\n\n* Invest in companies you understand (and perhaps know better than the average investor)  \n* Invest in profitable, well-run companies\n* Have an investment thesis - buy when it's true, hold when it's uncertain, sell when it's false\n* Diversify among 25-30 stocks / ETFs in multiple sectors\n* Don't get scared, don't get greedy, dollar cost average to ease in/out of individual positions\n* Factor in your risk tolerance using tools like trailing stop loss sales\n\nAll that said.... unless your portfolio is 6+ figures, **there's a really poor ROI on your time** needed to do all of this well.  Consider a portfolio of $35,000 performing at a sturdy VOO 8.5% annual return vs 13% return.  It's a difference of $1575.  And you might have done 100+ hours of research, to do DD, time buys, stare at your phone during lunch, rebalance throughout the year, and you've taken on significantly more risk (higher beta, higher losses in a downturn, perhaps more exposure to certain industry turns).   That might be worth your time and stress for a $80,000+ portfolio, but most people asking this question aren't there yet.  So yeah, buy an index fund, and when you get bored, diversify.  And if you lose big in a downturn, go back to index funds a wiser, chastened investor.", "score": 16, "replies": [{"body": "Here is a strategy to beat the market since 2011: buy MSFT", "score": 2, "replies": [{"body": "Haha, my biggest holding since that time.  Meets all my criteria above.  Yup!", "score": 2, "replies": [{"body": "What are your thoughts on AAPL and GOOGL", "score": 1, "replies": [{"body": "AAPL is a fine bet as a consumer goods company rather than a big tech innovator, I have some, used to have more.  GOOGL gives me real concern around federal and state regulation.  Frankly it's needed, not something I want to hold right now.  Plus, I don't support a censored search in China.", "score": 1, "replies": []}]}]}]}, {"body": ">That might be worth your time and stress for a $80,000+ portfolio, but most people asking this question aren't there yet.\n\nWouldn't it be a good idea to have practised your investing skills by that time? I'd much rather start my learning period with 30.000 (and even less) than 80.000+", "score": 1, "replies": [{"body": "Depends how you value your time and money.  When I didn't make very much, my time was spent developing myself, my career, put into my work and generally enjoying life, particularly when you're in your 20's and early 30's.  Time you spend learning stocks has an opportunity cost.  Why not learn a skill related to your job, get a promotion, or move within your field to earn better pay?  That's a much more reliable ROI when you're young.  And then later in life, money comes easier, and you have a true sense of the value of your time.  You could, in a year or two, go from making 40k to making 80k.  You'd have to be Nostradamus to do that in stocks compared to a low cost index fund.\n\nThe point of my post above is you shouldn't take on a 15hr-a-week part time job to achieve a thousand dollars above market, unless that's really your idea of fun.", "score": 1, "replies": []}]}]}, {"body": ">So what am I missing here?\n\nInvesting and trading are two different things. This is the critical thing you've misunderstood here.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Investing is a long game, you are buying to gain over time, by getting the company growth in share price and dividends etc. -im 50% this\n\nTrading is more daily/frequent with the goal of buying lower and selling higher quickly. You want to make your gain and get out asap so you can spend the money buying yourself a fancy lunch or whatever. \n\nLastly theres yoloing where you just do dumb shit in the hopes of cashing out, mostly focused on options these days - im 50% this. \n\nFor someone new i would suggest you learn to invest. If you cant make money in the first one, you'll likely lose even more in the other two progressively more imo.", "score": 2, "replies": []}]}]}, {"body": "So how do you buy the S &P", "score": 3, "replies": [{"body": "Buy SPY shares", "score": 3, "replies": [{"body": "VOO is the same thing and cheaper. VOO is the better choice if you're buying now to invest and hold long-term. SPY is the better option if you're trading because of the volume.", "score": 5, "replies": [{"body": "What's the difference between VOO, VOOG, and VOOV? I know nothing about these matters.", "score": 1, "replies": [{"body": "VOOG  is comprised of the S&P 500 growth stocks and VOOV the value stocks.", "score": 2, "replies": [{"body": "Yes, but what does that *mean*? What are growth stocks? What are value stocks? How are they different from each other? How are they different from VOO? I repeat: I know nothing....", "score": 1, "replies": [{"body": "Growth are simply companies that are growing faster than similar companies in their sector. They typically reinvest income into the business rather than issue dividends to investors. Value are companies that are thought to be overall undervalued in the current market, usually established companies where growth is slow or has halted. The most simplistic (not foolproof) comparison to figure a value stock is the price to earnings ratio (P/E) being less than similar companies the their sector.\n\nVOO is comprised of all 500 companies in the S&P 500. It's weighted based on each companies market cap (share price x outstanding shares) divided by the total market cap of all 500 companies. I think there are 508 total stocks for those companies (some companies issue more than one share class). VOOG wouldn't be comprised of all 500 companies in the S&P 500. It is the companies in the S&P 500 that the funds managers deem to qualify as \"growth\" companies. Same for value.", "score": 2, "replies": [{"body": "Thank you for that", "score": 1, "replies": []}]}]}]}]}]}, {"body": "> SPY \nhow about VTI?", "score": 3, "replies": [{"body": "VTI is better dividend, too? Great choice", "score": 3, "replies": [{"body": "Yes", "score": 1, "replies": []}, {"body": "No, VOO yield is 1.99% while VTI yield is 1.81%.", "score": 1, "replies": []}]}, {"body": "Just so you know, 75% of VTI is the S&P 500. You just get a small bit of exposure to mid and small caps in it.", "score": 3, "replies": []}]}]}]}, {"body": "It’s more true that it’s difficult to beat the market on a risk adjusted basis, than to beat it at all.", "score": 5, "replies": []}, {"body": "Yeah I read things about how you should read the quarterly earnings report of every stock you own, sure...  the price of the stock will already be factored in by the time I read the first sentence.", "score": 5, "replies": []}, {"body": "Analfarmer2", "score": 5, "replies": []}, {"body": "Because you can buy SPXL", "score": 3, "replies": []}, {"body": "People seek crazy gains, not gradual gains.", "score": 3, "replies": []}, {"body": "You just summarized like 80% of all the books available about investing", "score": 2, "replies": []}, {"body": "SnP performance has been driven by a handful of stocks actually. This can be understood both empirically and conceptually. \n\nEmpirically: A Principal Component Analysis can help you see that most of the snp moves are driven by a happy few, removing those, perf is negative. It's well documented in general press.\n\nConceptually: the US growth is driven by companies that maneuvered the digital revolution and globalization exceptionally well (>50% of snp revs are overseas). A small number of them outplayed local stakeholders developing strong networking effects and economies of scale across the globe, pricing out small gamers. \n\nSome believe in rotations across sectors, but in the end of the day, there is a fundamental change in the means of production and in the way humans address their environment, and only certain sectors are exposed to that. Some companies monetized that and are exceptionally well managed. \n\nObviously if you do day trading, you will never catch the global trend and you will be part of the 99% that lose money, even if you pick the right stocks. However, dont throw the baby with the water bath, there's definitely value in identifying strategic stocks, and holding onto them.", "score": 2, "replies": []}, {"body": "Downside protection. We've been in a bull market for the past decade. Index funds are great when the market doesn't do anything except go up. However, that's not normal. What do you do when we hit a bear market? Or a severe pullback like 08? Are you okay with a sudden market drop of 10%, 20%, 30%, etc.? You can mitigate risk and mimic the market, while severely limiting your downside risk if you choose the right mutual funds and allocate properly given your time horizon.", "score": 2, "replies": []}, {"body": "The world is full of naive emotional people. They heard you can make lots of money on stocks, yolo on whatever stocks they like, it goes down a bit right after they bought, they panic and sell.\n\nSo, most people lose money on the market simply because they don't bother to learn how to analyze and they lack emotional control.\n\nSame thing with people starting businesses. They yolo into their first business, make stupid mistakes and bankrupt. If they're particularly dense they yolo again and fail another time.\n\nSuccessful entrepreneurs are the few who take the time to think things through, do the math and have the fortitude to stick it out through the first few years. The statistics are skewed by lazy naive fools.\n\nYou can easily beat the market, but to do so you have to be smart and not think you're smart.", "score": 2, "replies": []}, {"body": "Most smart people are better off spending your learning high level portfolio theory, fee minimization, and tax optimisation. Only if you work full time within financial services, or you have a particular knowledge set within an industry or sphere of politics, it can be worthwhile to complement these skills with learning financial accounting, valuation, and potentially economics.", "score": 2, "replies": []}, {"body": "Easy question, not always an easy answer. I will say, it depends.\n\nlong-term you will do just fine investing in the S&P (SPY, VOO etc) over the long-term (years / decades) - the value of what you invested will go up.  However, if your investing goal includes income, then the answer changes a bit. If you are looking at your portfolio to generate income, in the form of dividends, then your strategy may lead you towards stable yields in the 2.5 - 5% range vs. the 1.87% paid by the SPY. In this case income from stocks would be more important than the growth/apreciation of the underlying stock. Blue chip dividend stocks pay a great dividend and have generally low(er) volatility and growth than say a FANNG stock. Also, you are getting income without 'spending' the principal. To generate income from a growth stock you have to 'sell' the principal and the tax liability will likely be higher due to difference in the purchase price vs selling price  Both are good and support different investing strategies / goals.", "score": 2, "replies": []}, {"body": "It’s not that hard to beat the S&P. The S&P is just a bundle of big companies. One example, if you add a hedge when the 50d crosses down on the 200d to your S&P tracking, you’re already setting yourself up for better gains (or reduced losses).", "score": 2, "replies": []}, {"body": "Going passive may work with s&p500 but i doesnt work as well internationally or in credit. Those are asset classes that at times have beterr risk reward vs US stocks. \n\n\nPassive investing is fine but do remember that it doesnt always work. Japanese stocks are still down from thier highs in 1990s.  The sp went no where for over 10 years after 1999. \n\nIf your 100% passive i doubt youll ever understand why.", "score": 2, "replies": []}, {"body": "Honestly the S&P is just a market cap tracker. No real messure of company value here, just $ changing hands.", "score": 2, "replies": []}, {"body": "It's a challenge. A life without challenges is a boring life.", "score": 2, "replies": []}, {"body": "Why wasting time swimming towards the ova?", "score": 2, "replies": []}, {"body": "That whole rational you just explained...is the reason so many market commentators have said there is somewhat of an index fund bubble in the $SPY. Most people believe that logic.\n\nMy personal take on it: Yeah you won't beat the S&P every year, but you can beat it most years, or \"Many\". \n\nSince 2016 I beat it every year... this year i'm not.\n\n If making 3 years of straight gains means giving some back every year or two I have no problem with that.", "score": 2, "replies": [{"body": "I'd agree with that.  I think 99% is too high, and if you'll stay away from day trading, and invest long term on good companies, you'll do pretty good.  Plus there are innovative companies that come along, that help spur on the gains:  think when cell phones came along, the tech companies, etc.", "score": 1, "replies": []}]}, {"body": "because then what would you do on your phone all day? Reddit?", "score": 2, "replies": []}, {"body": "Trading isn't investing. And not everyone has the same goal of investing for long term, in which case yes index fund is the way to go", "score": 2, "replies": []}, {"body": "Gambling addiction.", "score": 2, "replies": []}, {"body": "I think a lot of new investors are looking at the last 10 years and going, wow everyone was making money and basing the performance to the S&P 500.\n\nWhere hedge funds and talented investors truly shine are during recessions and stagnant markets. It is very possible that the market will stay stagnant and not achieve the returns after the 2008 recession.", "score": 2, "replies": []}, {"body": "Buy the S&P 500 unless you are genuinely interested in learning about individual companies/ tickers. Otherwise you won’t do your due diligence and be better off buying index funds.", "score": 2, "replies": []}, {"body": "The s&p 500 is a solid index, however it is a lot more tech heavy than people realize, and therefore more volatile than an overall portfolio should be. You can still stay 100% in indexes for safety and diversity, however covering other aspects of the market is important to a stable portfolio when the market future is uncertain.\n\nIt’s also important to understand. Outperforming the market is not the only metric for which portfolios are graded. Some individuals would prefer a safer portfolio if it means slightly underperforming the market. What a lot of people don’t realize is that the main reason people opt for hedge funds, is not to beat the market, but to hedge against risk.", "score": 2, "replies": []}, {"body": "99% of people won't put in the grueling amount of time, dedication and effort required to succeed at something like trading. It's absolutely possible. Buy the S&P and learn to trade. You can do both.", "score": 2, "replies": []}, {"body": "Yeah no, unless you want to spend hundreds of hours on analysis, or trust your intuitions more than someone like Buffet. Just buy some mid cap S&P from vanguard and coast. It isnt worth the effort for 99% of us. Everyone wants to believe they can beat the market, they have some strategy or formula. But the cold hard facts are that most everyone will not. Why waste money time and effort to be lucky to end up where someone with a mutual fund ends up unless it's your hobby? Find a better hobby and dont fuck with your future.", "score": 3, "replies": [{"body": "This is such a load of horseshit. I figured I’d let you know how beta you sound", "score": 1, "replies": [{"body": "Lol your commenting on a 6mo old thread.", "score": 1, "replies": [{"body": "Good I hope your portfolio is crashing just like the rest of the market", "score": 1, "replies": [{"body": "Yeah so what? I am buying in more and I have no plans to sell for 40 years, why do I give a shit about day to day fluctuations? I can watch multiple 10 year market cycles go by and never be concerned. What’s your problem and why do you care about my investment strategy? Is your life really that sad?", "score": 1, "replies": []}]}]}]}]}, {"body": "The SPY has beaten most investors over a long period of time but that’s partly because of factors that are unlikely to repeat. All the money pouring into into S&P index funds have inflated  the component stocks way above the Russell 2000. Someday there will be a bear market and that money will flow out again. \n\nYou can get pretty good alpha with less risk than the index by choosing stocks carefully.", "score": 2, "replies": []}, {"body": "Actually that is pretty good idea.", "score": 1, "replies": []}, {"body": "that's why I buy SPY and sit on it. Many try, few succeed", "score": 1, "replies": []}, {"body": "This was actually most of my MSF.", "score": 1, "replies": []}, {"body": "I think you just answered your own question.", "score": 1, "replies": []}, {"body": "Hypothetically you are exactly right. Realistically, you won’t be able to resist tinkering with it at the bottom of a bear market unless you are EXTREMELY disciplined.", "score": 1, "replies": []}, {"body": "[https://thereformedbroker.com/2019/10/10/how-i-invest-my-own-money-2/](https://thereformedbroker.com/2019/10/10/how-i-invest-my-own-money-2/)\n\n&#x200B;\n\nGood read.", "score": 1, "replies": []}, {"body": "My retirement stays with index funds. But I invest in moin shots. Companies I feel will be making the future. I don't beat the S&P with those. But I do believe that one day they will pay off and I will have found the next amazon. But that day is 20 years out. \n\nWhich is why I never risk anything I can't afford to lose.", "score": 1, "replies": []}, {"body": "I would always suggest to go for spy as the etf! Unless you have some knowledge which the market is not aware off ( in terms it is not already factored in the price ) just buy the market ! Having said that there are always companies which outperform spy and if you  are willing to take the risk your returns can be higher !\nIt always comes down to the risk you are ready to take and the effort you are ready to put in.\nMichael burry ( not sure if I am spelling it correctly) the guy who predicted the housing bubble ha recently said that ETF and passive investment are the next bubble!\nSo always do you are own research as much as possible and always gauge your own risk appetite", "score": 1, "replies": []}, {"body": "Can anyone tell me if I've done something stupid by buying the Vanguard S&P 500 UCITS ETF (USD)? There are several S&P500 options and I'm not really sure what the differences are between them other than being sold in europe and america.", "score": 1, "replies": []}, {"body": "Many clients have financial goals or psychological fears that require traders to manage risk while still keeping the money invested.", "score": 1, "replies": []}, {"body": "If your first instinct when hearing that not everyone wins is to assume you'll be one of the ones to lose, then yeah go ahead buy the s&p. If your first instinct when hearing that not everyone wins is to ask yourself, how can so many people fail in the stock market and what does it take to at least not get ruined in the market, then you'll probably do better in the long run.\n\nI mean dont get me wrong, not \"wasting\" your time with research would be nice, but if you think researching is a waste of time, then just go ahead and buy the s&p anyway.", "score": 1, "replies": []}, {"body": "First off, you have the complete right mindset. However, its not impossible to beat the market. I cant comment one way or another about your 99% statistic. For instance, you could have simply beat the market by buying voog or qqq or owning a few top dogs in addition to voo or spy. The other obvious issue besides people not monitoring their emotions is simply taxes. Individual stocks will usually get people more into trading than investing and they will pay taxes as they do this as opposed to owing a fund/index which the average person feels more confident holding long term. Regardless, some type of index fund should make up the bulk of your investment.", "score": 1, "replies": []}, {"body": "Biggest issue is wildly unrealistic expectations.\n\n99% of people also can’t perform a brain surgery without killing the patient. But a few people can, and it takes many years of hard work before someone is capable of navigating something as complex as a brain surgery.\n\nYou can learn to trade and beat the market, but it’s more like a career change that will require, say, 30 hours per week of hard work for the next 5 years. If that’s not your level of interest, then yes you should just dollar cost average index funds.", "score": 1, "replies": []}, {"body": "Draw down protection?", "score": 1, "replies": []}, {"body": "You have a strong argument.  Tire mon chapeau devant eux", "score": 1, "replies": []}, {"body": "Trading is different from Buy&Hold.", "score": 1, "replies": []}, {"body": "1) It's fun.\n\n2) It's possible. I'm ahead over the past decade, and any higher % makes a big difference.\n\n3) The diversity of outcomes is much greater, which may or may not appeal. If the S&P returns 7%, you could just pick a few favourite stocks and have a chance of vastly beating the S&P 500 (and a chance of doing terribly) -- concentrated positions in one business/stock (or a couple) tends to be how fortunes are made.", "score": 1, "replies": []}, {"body": "99% of my saved money is in safe long term accounts\n\nThe other 1% I gamble on robinhood. I've gotten damn lucky and I'm up about 60% ($2,300) compared to one year ago. It's been as high at 78% up when looking at the yearly chart. I should really sell if it pops again.", "score": 1, "replies": []}, {"body": "I ask myself this question at least once a month... I think I just enjoy investing too much, even if I get slightly lower returns :)  I am still investing and greating good returns, but when I just ETF it I get bored and stop investing. I know, stupid, but that's me.", "score": 1, "replies": []}, {"body": "I haven't read everyone's answers yet, looking forward to it. \n\nIMO, indexing is fine, it's great, but if you need to actively invest to sleep at night, do it. Probably best to split the two.", "score": 1, "replies": []}, {"body": "Yeah if you’re just reading financials and looking at charts..... chances are not good.   Especially when you consider that most (all) analysts compare themselves to the S&P500 index and not the S&P500 Total Return.  My wealth management guy infuriates me when he says he beat the market S&P500 by 0.5% last year (net of fees) when he really didn’t.\n\nThe S&P500 is a tally of stock values.  That means if you bought $1m worth of stocks in the index and the index goes up 20% that year then you’d have $1.2m (because all the stocks in the index went up by an average of 20%) PLUS the dividends those stocks threw off that year.  You’d be making MORE then 20% that year (say $1.25m or 25%).  The managers compare their total gains with the S&P500 index.  Their number includes the dividend reinvested.  When they say they made 22% and beat the S&P500’s 20% net of fees they mean you have $1.22m at the end of the year.  If you had just put it all directly into the index then you’d have $1.25m in this example.\n\nIn 2017, the S&P was up 18.7% in 2017 but including dividends it was up 21.1% for instance.  How many money managers compared themselves to 21.1%?  Only the honest ones.... so very very few.\n\nS&P started the day 10/11 at 2963 or up about 18% for the year.  S&P500 Total Return is up almost 21%.", "score": 1, "replies": []}, {"body": "99% of people didnt study finance at an ivy league school", "score": 1, "replies": []}, {"body": "Because... you are the 1%!", "score": 1, "replies": []}, {"body": "To learn to accept suffering of illusory loss i.e. money is a waste of time. \nOf course abundance is good though.\n\nThis seeming contradiction is what we need to grasp", "score": 1, "replies": []}, {"body": "The thrill of victory... The agony of defeat.", "score": 1, "replies": []}, {"body": "End of year selloff coming....", "score": 1, "replies": []}, {"body": "Investor doesn't mean trader, however a trader is an investor. If the statistic is about traders, then it doesn't affect you if you're not opening and closing positions on the regular.", "score": 1, "replies": []}, {"body": "I see everyone commenting do research and study the markets - besides the Wall Street journal what literature/websites do you recommend reading to sharpen your market / stock analysis. \n\n4 years of a finance degree and I still know jack shit about investing in funds and stocks", "score": 1, "replies": [{"body": ">what literature/websites do you recommend reading to sharpen your market / stock analysis\n\nYou can study the market, but it's inaccurate.   Study a company, and decide on if it's worth investing in.   This should be the case no mater what the market does.   This is of coarse assuming long term investing.\n\nIf you are planing on investing for less then a year or two, A pair of dice would work.", "score": 1, "replies": []}]}, {"body": "I call bullshit on that stat.  Let's just take a quick poll on this subreddit - how many of you are beating the earnings of the snp 500 index fund, raise your hand?\n\n\\*raises hand\\*", "score": 1, "replies": [{"body": "I do", "score": 2, "replies": []}, {"body": "ya I call BS too.  It ain't hard to beat the index", "score": 2, "replies": []}]}, {"body": "mmmm... 99%? really? where's that stat from?\n\n&#x200B;\n\nI'm up 200% on AMD shares since 2017... z\n\nUp 30% on YETI shares this year... \n\nAnd up \\~22.5% on ELY shares... \n\nI did lose about 40% of my portfolio on $MU options somewhere in there... so maybe the problem is hubris?", "score": 1, "replies": []}, {"body": "Everyone can beat the market. It's just doing it consistently that's difficult.", "score": 1, "replies": []}, {"body": "Most traders won’t beat the market, but I recommend taking a look at the Japanese stock market. Sometimes entire markets can suffer for decades, index funds have been solid in the past but the future isn’t guaranteed.", "score": 1, "replies": []}, {"body": "1. Trading isn’t investing. \n2. If you think 99% of traders can’t beat the market, then just put money in your IRAs and let Fidelity or whoever manage it as that is basically what you’re suggesting. \n3. Like number 2, if the return you’re going for is only to slightly beat the market, you’ll want to diversify a little rather than just 100% S&P. Again, might as well just do a 401k and a Roth IRA and let the broker manage it. \n\nAs far as trading goes, I’d say 80% aren’t successful not 99%, and you have to think how absolutely stupid the average person is. Most people don’t know jack shit about finances or the markets. Now take those people and set them on stock trading...how many fail immediately and stop? How many never had even close to the right tools or knowledge or training? This is why “9/10 traders fail”...not because “the market is so hard to beat”. \n\nI’m 19/20 on my last 20 trades. I’ve traded for two years. I’ve absolutely destroyed the market both years and watched many traders do the same.", "score": 1, "replies": []}, {"body": "Because o don’t want to own companies that do t share my values. I really wish I could buy an index and blacklist companies vs. building my own basket of funds.", "score": 1, "replies": []}, {"body": "There is price discovery that is a potential for profits beyond what the S&P 500 can offer, in the short term you can beat the S&P 500 just look at all the commenters at the bottom.  You learn stock analysis for your fuck around money that you can gamble with once you've got your goals for retirement taken care of.", "score": 1, "replies": []}, {"body": "Because learning something new is never a waste of time.", "score": 1, "replies": []}, {"body": "For me my investments are not only about making money, although I do like to make money. I like to invest in companies that from what I can tell are trying to change our world for the better, and will avoid companies willing to do anything to make a buck.", "score": 1, "replies": []}, {"body": "90% not 99%", "score": 1, "replies": []}, {"body": "Where do you get this 99% number from?  That seems absurd and made up.  Literally, put 80% of your money into S&P500 and 20% into high performers and you'll likely beat the index given a bull market (which is the case for the past 10 years).  \n\nOr invest in Nasdaq 100 and you'll likely beat the index.  From 2009 to 2019, Nasdaq100 has out performed the S&P500.  Obviously, there is more risk associated but you have to take risks if you want to out perform.  The question is...is the risk worth taking?  Most of the time, you'll win.\n\nhttps://fourpillarfreedom.com/sp-500-vs-nasdaq-100-which-index-is-better/", "score": 1, "replies": []}, {"body": "Don't shoot me.\n\nhttps://mymoneywizard.com/should-you-trade-individual-stocks/#comments", "score": 1, "replies": []}, {"body": "See I actually like to split my common stock investments. Half of it is put into safe companies and the other half I put into the more riskier companies that might take off.", "score": 1, "replies": []}, {"body": "Take me for example \n\n22 years old, I don't work a job. I just trade/invest.\n\nThe S&P just doesn't have enough volatility. Sure at the end of the year you might gurantee 8% w s&p\n\nBut I like volatility there's more potential upside. There's downside too but that is what patience/discipline are for.", "score": 1, "replies": []}, {"body": "Traders don't do sensible analysis. Value investors do. There are patterns of human behavior that consistently lead to inefficiencies in the market. Those who are aware of them and know how to properly value businesses outperform. The rest don't.", "score": 1, "replies": []}, {"body": "Well, because you can be the 1%", "score": 1, "replies": []}, {"body": "Read The Warren Buffett Way and The Warren Buffett Portfolio by Robert Hagstrom to get a thorough debunking of the nonsense idea that folks can’t/won’t beat the S&P 500. Lazy way: follow 13F filings from top hedge fund managers that hold concentrated portfolios (<10 stocks at a time) and mimic their highest conviction buys, and then hold those stocks for dear life.", "score": 1, "replies": []}, {"body": "Are you trying to beat the market or make the best return over time. I think the only one massaging his own ego here is the guy who thinks he's a trader. And why would I go back to WSB? I'll post where I like, thanks.", "score": 1, "replies": []}, {"body": "If you're not dedicated --> S&P 500\n\n&#x200B;\n\nIf you dare -->  [https://www.oaktreecapital.com/docs/default-source/memos/2014-04-08-dare-to-be-great-ii.pdf?sfvrsn=2](https://www.oaktreecapital.com/docs/default-source/memos/2014-04-08-dare-to-be-great-ii.pdf?sfvrsn=2)", "score": 1, "replies": []}, {"body": "99% of people give up before mastering ANYTHING. That's why.", "score": 1, "replies": []}, {"body": "There’s a difference in return vs. risk adjusted return.  Also, annualized returns can be misleading.  Volatility should be factored into the equation.  A return of 7% with a low standard deviation and beta may actually make more money over a 10 year period than an index fund that returns 10% per year with high volatility.  Example; $100,000 portfolio loses 50%, now it’s worth $50,000.  Then it recovers over the next two years with a 50% total return.  The portfolio would only be worth $75,000.  It takes a 100% return to recover the portfolio from a 50% loss.  Average annualized returns being the sole factor in portfolio selection is a lie that Wall Street wants us to believe.", "score": 1, "replies": []}, {"body": "I'm not sure I believe this anymore.  Index's beat mutual funds for sure due to expense drag, but my stock picks and even options trades which are pretty conservative have beat my indices.  (Vangaurd)  sector rotation seems viable.  Selling covered calls, selling strangles, buying out of favor dividend payers... especially on market overreactions.  I do listen to stuff every day, and my vocation is accounting which is heavy in financial analysis so perhaps that helps, but I think the 99% sounds too high.", "score": 1, "replies": []}, {"body": "Because its boring", "score": 1, "replies": []}, {"body": "Because you get what the market gives. If you’re ok with having 8% annualized returns and letting the market decide your future....do you", "score": 1, "replies": [{"body": "So that’s rediculous. The chances of beating the market for the long term is very unlikely.\n\nLets take a 20 year outlook. You beat the market by a couple percent 8 of those years. Is it worth it for the amount of risk taken on the other 12 yrs?", "score": 0, "replies": [{"body": "If you keep winning 4 out of 5 trades, then its worth it.", "score": 0, "replies": [{"body": "You make it sound so easy", "score": 9, "replies": [{"body": "Its not easy but as a small investor you have opportunities that larger institutions don't have, ie. Investing in small to mid caps. Read Joel Greenblatts The Big Secret for the Small Investor. He makes some very good points regarding the potential weaknesses of market cap weighted index funds and then explores other strategies.", "score": 2, "replies": []}]}]}, {"body": "Look. I can give you the books. Plenty of styles and the way people did it.\n\nBut at the end of the day, if you’re comfortable with 8% annualized return and relying on others...that’s cool. \n\nIt’s just not for me", "score": -3, "replies": [{"body": "Give me a break with that bullshit.", "score": 0, "replies": [{"body": "Funny, exactly what I was thinking as I read that.", "score": 1, "replies": [{"body": "You ever come across those people promote forex trading on social media? \n\n“Why work a 9-5 when you can trade forex and make millions straight from your phone!”\n\nThat’s what I was thinking lol", "score": 0, "replies": []}]}]}]}]}]}, {"body": "I read somewhere that in order to determine that someone is truly capable of beating the marketing, they need to do so over a 36 year period. The longest winning streak was like 15 years (not even half of 36 years) and this was \"smart money\" aka institutional buy side traders with a ton of capital and quantitative research on their side . Many retail traders say that they have a \"system that works\", net of losses incurred over the course of their often short (no pun intended) trading careers.  The truth of the matter is, most speculative retail traders have champagne desires, but talents and skills worthy of only tap water. Looking for the easy win, the big break, the lucky windfall....to finally hit the jackpot and cruise down the street in their lambo with a hot blond with big tits. Wont happen for the overwhelming majority of traders.\n\nPast performance, with few exceptions, does not reliably predict future performance. This goes for blue chips stocks (such as Disney, coke and etc) as well as the entire US stock market. And please remember that a few big market cap giants have a significant influence on the direction on the us total stock market performance, and especially over the sp 500 index. The best way to invest over the long haul is with a total \\*\\*world\\*\\* index fund, that includes emerging as well as developed market equities. IMHO, you'll have a better a ROI by starting your own business, or investing in PE funds and other pre-IPO equities.  But you cant even entertain the latter unless you become an accredited investor, so get lucky with a lucrative talent or get busy developing a lucrative skillset so you can get there one day. Max out your Roth-IRA with $VTWAX and the use the rest of your \"investable\" funds to start a side hustle/small business.", "score": 1, "replies": []}, {"body": "There’s so much bias with this because of what the market has done for the past 40 years. It’s very easy to forget that there are many periods where the market did very badly over the long term. If you bought a hypothetical DJIA index fund in 1966, you wouldn’t have broken even after inflation until 1996. If you bought in 1929, it would have taken you until the mid 50s to break even without inflation. Yet there were good individual stocks to buy.", "score": 1, "replies": []}, {"body": "I mean I'm at around a 63% YoY return the last 3.5 years...buy and hold good stocks and you'll be alright. Otherwise, if you don't want to read and analyze and spend time learning just invest in the S&P500 as mentioned.", "score": 0, "replies": [{"body": "63% year on year lol. Did you buy leveraged semiconductor index funds or amd lol. \n\n\nBro I'm sure you know when to pull out but you're definitely due for a correction. The market has also been doing stupid good for the past 10 years so this isn't all that significant. Shit my portfolio doubled in the past 5 years just from being in s&p. \n\n\nIt's easy to pick winners in a bull run .", "score": 1, "replies": [{"body": "I'm in SHOP at 30, TSLA at 180, MELI at 90, SMAR at 18, EXEL at 3.50, NFLX at 120, MDB at 40.\n\nI do agree with you so I exited Tesla and MELI recently thinking I'd get back in but they have gone up too much for me to get another position. I have always watched the dips like when SHOP went from 400 back down to 300 and just held on. I finally sell a position intending to get back in and it didn't work out too great. I exited Netflix around 310 as I definitely am not as interested in the stock and I'm uncertain on the streaming space. Probably 50% of my current portfolio is Shopify with the 10x return I've gotten there. I see another 5x opportunity there before I'd really consider selling.", "score": 1, "replies": []}]}, {"body": "Do it consistently for at least 15 years and we can talk again.", "score": 0, "replies": [{"body": "15 years isn’t long enough. Wait until the heat death of the universe and then we can talk.", "score": 1, "replies": []}]}]}, {"body": "The strong market hypothesis is the only market hypothesis imo.", "score": 0, "replies": []}, {"body": "Buy some $SPY calls kid and quit your whining already", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Loosen up bro lol", "score": 1, "replies": []}]}]}, {"body": "No one can predict the future, therefore no one can beat the market long term barring some wild guess or getting one amazing return and cashing out. If you’re in it for the thrill then what you are doing is more gambling than investing. Don’t get me wrong gambling is extremely fun and can sometimes be very successful, it’s just not how you invest for your kids’ future.", "score": -1, "replies": []}, {"body": "People \"invest\" in slot machines. Now *that's* a terrible return! If you think you'd enjoy the thrill of getting it right over the agony of getting it wrong, then trade individual companies. Otherwise yes, just buy index funds, especially right after a market correction.", "score": 0, "replies": []}, {"body": "I've made out like a bandit on some of my plays, less so on others; but it helped to learn from them. I just allocate a majority of funds to what I deem \"safe\\_havens\" ie: SPY, loans, dividend assets. Then with the rest tech plays and penny stocks.  \n\n\nJust remember it's really difficult to make money in this market because it's trading sideways...no ones making money right now. As for \"trading\", anything under 30 minutes and you are fighting against algorithms that prey on other algo's that prey on other algos which prey on other algo's which all execute 100,000's of orders before anyone can push a button....so on...so forth. It's a fool's errand. I could be wrong, someone here may have an edge...but the amount of time spent looking for that edge is better suited working a better job.", "score": 0, "replies": [{"body": " the market is trading sideways. What the fuck are you saying this is the biggest bull run ever.", "score": 1, "replies": []}]}, {"body": "It’s gambling. 99% of casinogoers won’t make cash, but it’s addicting and appeals to human nature. It’s fun! Just don’t listen to those graphs everyone likes making. That’s all bs", "score": 0, "replies": []}, {"body": "You're missing human nature. People think they can beat the market. There's no evidence that they can over sustained periods. But they'll keep trying.", "score": 0, "replies": []}, {"body": "If you think you are able to make smarter investment decisions than the average of the top 500 companies in the USA, go for it.", "score": -1, "replies": []}, {"body": "You're right. Only arrogant idiots try to beat the market, especially when that arrogant idiot is unprofessional. Go and invest in index funds and focus more on portfolio allocation than stock allocation.", "score": -1, "replies": []}, {"body": "That's exactly right. Even hedge funds don't beat the index.", "score": -4, "replies": [{"body": "I didn’t know all hedge fund returns are public", "score": 3, "replies": []}, {"body": "Hardly any hesge funds have thier benchmark as the s&p", "score": 1, "replies": []}]}]}
{"title": "$TSLA Daily Investor Discussion - October 10, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "dfvcfk", "created_utc": 1570698731.0, "score": 16, "upvote_ratio": 0.94, "num_comments": 121, "comments": [{"body": "\"I think there is a major disruption looming there. Not only for self-driving cars but also the electrification piece. If you've driven an all electric car, it's actually a marvelous experience. And it's marvelous experience not to stop at the gas station. Plus, you have ride-sharing on top of this. So you have three vectors of change happening generally in the same time-frame.\" \n\n\\- Tim Cook, Jun 2017", "score": 18, "replies": [{"body": "Such a great idea he decided to toss his hat into being the 10th netflix clone.", "score": 3, "replies": []}, {"body": "How is the news now?", "score": 0, "replies": []}]}, {"body": "Live right now: Elon and NASA updating press on SpaceX's Crew Dragon \n\n[https://www.youtube.com/watch?v=DaJ0n0j-UB8](https://www.youtube.com/watch?v=DaJ0n0j-UB8)", "score": 11, "replies": [{"body": "And Tim Dodd gets the first (and provides the best) question...\n\nMakes all the following questions from the Post, CNBC, etc about “what date can we tell our readers?” and “how did that make you feel?” all the more banal.", "score": 9, "replies": [{"body": "You mean someone who gives a shit about what they're doing produces better conversation than career \"journalists\"? Color me shocked ;)", "score": 7, "replies": []}]}]}, {"body": "Fool’s errand to short before GF3 starts production. Really picking up pennies in front of a steamroller here. Can see a large Chinese investor accumulating", "score": 9, "replies": [{"body": "GF3 will catch up with those who think they are money making shorting machines, and especially those who continue to write otm calls for limited gains.", "score": 3, "replies": [{"body": "It will be very good to see written out the solid plan for consistently making a profit. GF3 is a huge part of that. Make $100M/quarter even. Just do it all the time. That will be game changing", "score": 2, "replies": []}, {"body": "Why though? What about this factory is so special?", "score": 0, "replies": [{"body": "Faster production, higher demand, greater margins.", "score": 2, "replies": []}]}]}, {"body": "Honest question, I know I am about to get downvoted, but I'll ask anyways.\n\nWhy are you so certain that the GF3 will be a success?", "score": -1, "replies": [{"body": "Will increase revenue and it isn’t a shitty solar product\n\nTo answer your next question, no it won’t be profitable because they will reinvest into the plant and I don’t care", "score": 4, "replies": [{"body": "Why do you assume demand in China is so high that this factory will be able to produce cars at close to the current Fremont factory’s rates?", "score": -1, "replies": []}, {"body": "What are your thoughts on the EV market structure in China?", "score": -1, "replies": []}]}, {"body": "It will be a money factory. But not until they start ramping up production to decent numbers. I'm expecting the share price to go up before earnings then come way bk down.", "score": 4, "replies": [{"body": "It requires an important assumption to be satisfied, people are going to buy everything that comes out of the factory.", "score": 0, "replies": []}, {"body": "Why do you assume it will be a money factory?", "score": 0, "replies": []}]}, {"body": "If you understand how China works, you know GF3 will be 1000% success", "score": 1, "replies": [{"body": "My firm actually operates in China through a manufacturing JV with a development bank. I think I have a solid understanding on foreigners doing business in China.\n\nThat being said, that is not a direct answer to the question I asked.", "score": 1, "replies": [{"body": "If your company operates in China, then you probably know that in China, 99.9% of foreign companies require local Chinese investment around 49% to set up shop.  And Tesla is the ONLY foreign automaker that has been granted the privilege to be 100% owned by Tesla.  That is a significant indicator that shows how much Chinese government want Tesla’s technologies.  \nSecondly, you can tell when China really wants a certain industry to develop quickly, it usually throws in tax-deduction, infrastructures, and just in general a full red carpet treatment that helps the targeted industry accelerate in the quickest way possible.  Tesla enjoys major tax exemptions in China, not sure how much they paid for land lease, but it’s evident that China wants Tesla to succeed in the short term (3-5yrs).  Beyond that I don’t know, because Chinese government loves to send spies to steal tech from companies operating in China, so whether Tesla will lose their lead in 5 yrs cannot be predicted at this point.  But in the next few years, you can expect China to continually back Tesla at every expansion, giving Tesla the ability to develop at insane rate and at lowest cost possible.  To me, that’s pretty much guaranteed success.  What do you think?", "score": 1, "replies": [{"body": "General rule of thumb, if it is too good to be true in China, that is because it is. Putting my own opinion aside that China wants that as a gateway to steal technology, post production, Tesla still needs to sell their vehicle at an alarming rate that I find it unfeasible. \n\nTesla needs \\~40% of the market share in a Country that has 20+ competitors that all sell to a different customer segment.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "The fact that this is the 4th trading session in the green with a comeback like we had today is bullish as hell. If we finish green tomorrow I’m holding onto my shares through earnings 🤑", "score": 8, "replies": [{"body": "When is earnings? Is it next week?", "score": 2, "replies": [{"body": "October 23rd", "score": 5, "replies": [{"body": "Pre or after-market?", "score": 2, "replies": [{"body": "Almost certainly aftermarket.  Can’t remember Tesla ever releasing their earnings per-market.  The market opens at 6:30 AM Pacific time lol", "score": 2, "replies": []}, {"body": "Don’t know. Guessing after hours, last deliveries and earnings all came out after hours recently.", "score": 1, "replies": []}]}, {"body": "Thanks", "score": 1, "replies": []}]}, {"body": "Two weeks from yesterday", "score": 1, "replies": []}]}, {"body": ">If we finish green tomorrow I’m holding onto my shares through earnings\n\nHow do you know if the buyers have critical information that you don't or if it's speculators pumping the price before earnings?", "score": 1, "replies": [{"body": "I don’t, just like everyone else I’m speculating.", "score": 2, "replies": [{"body": "I have some shares to sell you :)", "score": -2, "replies": []}]}]}]}, {"body": "I just bought more shares 🤪\n\nAlmost reached my goal.\n\nEdit: I’m long, but also bullish about the earnings, specially for the news that will come out of it about GF3, model Y, the Semi and following truck reveal as well as acquisitions.", "score": 7, "replies": [{"body": "News about model Y in earnings??", "score": 3, "replies": [{"body": "SMALL chance they comment on MY production beginning earlier in 2020 than previously guided to. Personally, I don't think any commentary like this will come until Q4 earnings.", "score": 4, "replies": [{"body": "Production lines for automobiles usually need to be created a full year or more in advance. Since they haven’t started yet, it would be shocking for any significant production to occur in early 2020", "score": 1, "replies": [{"body": "There’s lots of reporting / data on the possibility of TSLA sandbagging the Q3/4 MY guidance. I’m not saying it’s true, just that it’s a (small) possibility.", "score": 1, "replies": []}]}]}, {"body": "I hope so. At the very least a journalist will ask about it.", "score": 1, "replies": []}, {"body": "[https://cleantechnica.com/2019/10/15/breaking-tesla-model-y-production-to-start-in-q1-2020-unofficial-leak/](https://cleantechnica.com/2019/10/15/breaking-tesla-model-y-production-to-start-in-q1-2020-unofficial-leak/)", "score": 1, "replies": []}]}]}, {"body": "[Man sues Tesla after son dies in 116mph car crash](https://www.marketwatch.com/story/father-sues-tesla-after-son-killed-in-flaming-crash-2019-10-10?mod=mw_quote_news)\n\nThanks for the article MarketWatch, very cool. Keep trying to manipulate those algos.", "score": 12, "replies": [{"body": "So the son died while committing a felony. Tragic, but going for a lawsuit and drawing financial and media attention to your failure as a parent and your son's mistake is just a disgusting to way to cope.", "score": 17, "replies": [{"body": "Didn't I read elsewhere that the speed limit was 30mph?", "score": 1, "replies": [{"body": "That makes it 2 felonies and just way dumber in general. I'm not heartless and I understand people make mistakes but darwinism is a very real part of life.", "score": 1, "replies": []}]}]}, {"body": ">Riley lost control of his father’s car at 116 mph (187 kph) in May 2018.\n\nWhy even mention the fact that it was a Tesla? No vehicle is going to withstand an accident at those speeds. Also, it happened in May of *last year*. Desperate times call for desperate measures 🤷‍♂️", "score": 14, "replies": [{"body": "It's insane how people or media so often just blame the car and absolve the driver or owner of any mistakes or wrongdoing. I don't know any other cars but Teslas that get this treatment. L5 autonomy is the goal but that's a long ways off, at least a couple years at best. Teslas are still L2/3 cars, but it's like the public thinks they are already supposed to be L5 and touted as such when it's not. Tesla is extremely good at L2 driving, but it's nowhere near perfect at all times and isn't guaranteed to save you if you're driving recklessly. I was showing my TM3 to a lady during Natl Drive Electric Week and she actually asked me if the car had pedals or not. I'm like, yeah it's basically a normal car with advanced assistance features, lol.", "score": 2, "replies": []}]}]}, {"body": "How high will we go before earnings?", "score": 3, "replies": [{"body": "252", "score": 3, "replies": []}, {"body": "When is earnings? (Sorry, I must have missed something.)", "score": 2, "replies": [{"body": "Oct 23", "score": 3, "replies": []}]}, {"body": "Around 255 looking at the option prices (not that it means much in this macro environment).", "score": 2, "replies": [{"body": "I think options market is pointing to $250, but that is easily trumped by a run-up to $255 from irrational exuberance. There is hard resistance at the 200-day MA of $256. Q3 earnings will be pivotal. Does the stock crash back to $225 or does it rocket to $280?", "score": 5, "replies": [{"body": "Ok thanks. I just looked at the 10/18 prices and then added a few points until the 23rd. 10/25 implied move doesn’t answer the run-up question obviously.", "score": 1, "replies": []}, {"body": "So is it rocket or crash?", "score": 1, "replies": [{"body": "In my opinion... I don't think TSLA's conditions have improved enough to warrant breaking the 200-day MA. Based purely on results, I think the stock's fair value will be somewhere around $235-$245, so I expect a drop after Q3 on results. I'm just pointing out that a lot of longs may go into this earnings expecting too much... sort of like Q2 but I don't expect such a negative reaction because Q2 was also hit with the departure of the right-hand-man. But is there a bull case? Absolutely. Often stocks trade down on mediocre results but the stock then explodes as management revises guidance or provides tailwinds. There's still some catalysts which could push the stock higher. Margins should tick up *slightly* without one-time charges we saw in Q2. Booking some of the FSD revenue could generate a profit. Updates like \"GF3 is ahead of schedule and we're gonna produce 1k per week in Nov\".... stock will skyrocket. With this much uncertainty I probably won't be betting on earnings, but will play *around* earnings.\n\nThis isn't investment advice, but I definitely caution putting all your eggs in one basket on Q3 earnings.", "score": 1, "replies": [{"body": "> I'm just pointing out that a lot of longs may go into this earnings expecting too much...\n\nthis literally happens _every_ quarter, unfortunately", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Why the recent surge.\nTypical pre earning run up? Then the usual 5% drop afterwards?", "score": 3, "replies": [{"body": "anything less than 2% for tsla is basically flat.", "score": 10, "replies": []}, {"body": "Feels like some short covering.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Confusing thing is this surge is quite early compared to the earnings date", "score": 1, "replies": []}]}]}, {"body": "TSLA manipulation machine in full force today. Stock is not trading off off news- it's trading off of options action. Stock capped at $249 on day 4 of the bull run, but as I noted below we probably wouldn't have a 4th bull day without a pullback. Afterwards, stock was manipulated back down to $242, but [propped up by a huge buyer (manipulator).](https://imgur.com/a/HzxDFlX) After spotting this I fortunately I added to my call position when it hit 241.75. If a buyer is firing 100,000 lots they've got a big war chest and are telling the market, \"Don't fuck with me\"", "score": 9, "replies": [{"body": "I’m not likely to ever desire to become a capable day trader / options trader but I am consistently grateful for your detailed posts like this! It’s an interesting world you are reporting from and I like the “journalistic financial hobbyist” voice you employ. \n\nI consider most purely numerical “technical analysis” to be scarcely better than tea-leaves at predicting the future of this stock or the market in general.  What you do feels a lot more like experienced understanding of institutions and systems while never attempting to claim omniscient abilities. \n\nSo, thanks, u/BaunDorn !", "score": 4, "replies": []}, {"body": "really hilarious how your tell it! So ... a single big order changes the momentum?\n\nI guess we wouldn't see much movement today and Friday due to option expiry. Next week will be GF3 start and initial wave of Q3 earnings, so more ups or downs are likely next week.\n\nIf we happen to enter Tsla's earning day below 250, I may add a little more stock then.", "score": 3, "replies": [{"body": "Stock was selling off on lower volumes of 30k-90k over 5-minute intervals over a couple hours. Near 242 the downward momentum was slowing down with sellers letting off and volume dropping to 5k-15k. But the sellers punched through the $242 barrier on low volume and the moment that happened is when the algos went crazy and the 100,000 order came in. Just think about that, it's $25m in a single trade when TSLA has *thousands* of trades in a day. That single trade is 1.5% of TSLA average daily volume. Also, we know that it's a buyer coming in because the bid was above ask to push the stock back up above $242 and it also reversed the trend. It's like saying, \"okay kids, that's enough selling for now.\" There's no news today and macro is fairly quiet, so we know this is just pure trading dynamics from a few big fish. You don't fuck with someone who can fire $25m per trade like its nothing. You won't win that battle.", "score": 1, "replies": [{"body": "Same dude probably shorted at $249 lol", "score": 1, "replies": []}]}]}, {"body": "When it is manipulation and when is it fluctuation?", "score": 3, "replies": [{"body": "Manipulation does not occur all the time; it's impossible because of the complexity of the market (can't control thousands of buyers and sellers all the time). However, under the right conditions and for a brief period it can happen: 1) you need low volume 2) options market drives a lot of the manipulation from option writers selling premium; you see this on Thursdays/Fridays 3) market makers who are forced to transact on the underlying because of risk exposure (this is probably the most *legitimate* form of manipulation; but they aren't necessarily doing it to profit from price changes but just to reduce risk so whether to define it as manipulation is up for debate) 4) manipulation is common in the short selling game to spread panic 5) what drives the stock market? News does. Therefore, manipulate the news, manipulate the market.", "score": 2, "replies": [{"body": "Thanks for the response.\n\n> market makers who are forced to transact on the underlying because of risk exposure \n\nMarket makers who are forced to transact on the underlying what?", "score": 1, "replies": [{"body": "Option market makers who have to buy/sell the underlying asset: the stock.", "score": 1, "replies": []}]}]}]}, {"body": "Apparently that big buyer moved the entire market because the indexes also moved upward in the same minute. I don't buy these 'just so' stories for a second. The market is far more complicated than a casual analysis implying a handful of actors.", "score": 4, "replies": [{"body": "The stock traded off the [capital allocation line (CAL)](https://www.investopedia.com/terms/c/cal.asp) and larger market participants are pushing the stock back to its equilibrium.\n\n>Apparently that big buyer moved the entire market because the indexes  also moved upward in the same minute. I don't buy these 'just so'  stories for a second. The market is far more complicated than a casual  analysis implying a handful of actors.\n\nYou've added nothing of value here, only discarded my comments.", "score": 1, "replies": [{"body": "The argument I made was that the bounce in Tesla was non-specific to Tesla because the entire market bounced. That's not an empty dismissal.\n\nedit: My opinion on this stuff is generally not going to be changeable in a quick comment and neither is yours so let's skip it. Was just an impulse to toss out my first response.", "score": 1, "replies": []}]}, {"body": "TSLA moved 3% in a couple hours. How much did the whole market move? TSLA's beta is not high. If the market moves 0.3% TSLA does not normally move 3%. Sure it moved in the same direction, but with a hell of a lot more momentum than usual.", "score": 0, "replies": [{"body": "In the timeframe immediately preceding that bounce both the market and TSLA were moving in the same direciton with TSLA outpacing it substantially. 'Beta' like most windowed metrics has multiple scales presumably.", "score": 0, "replies": [{"body": ">In the timeframe immediately preceding that bounce both the market and  TSLA were moving in the same direciton with TSLA outpacing it  substantially. 'Beta' like most windowed metrics has multiple scales  presumably.\n\nDirection doesn't imply TSLA has to move with abnormal magnitude. Direction of the market doesn't even imply that TSLA *has* to move with the market. What about earlier this week when TSLA was trading up while the market was trading down? Sure you can argue there are different ways to calculate beta but it's very relevant because many pricing models rely on it and these models drive day-to-day trading. I agree with you on the direction, but not the magnitude... a factor of 8x-9x.", "score": 1, "replies": []}]}]}]}, {"body": "Market makers want to take our day traders stops around $240.00. We will see $239 before it actually bounces", "score": 1, "replies": []}, {"body": "The big buyer was u/Xillllix", "score": 1, "replies": []}, {"body": "Why is options action not a form of news? If someone is placing a big bet in one direction, that is definitely something that should be taken into account.", "score": 1, "replies": [{"body": "Because you don't know *why* that participant is placing that bet. You don't know *if/what information* that participant has. You don't know *what the bet is* because you can only see part of the trade. Is it a bet? Is it an options strategy? Is it a hedge? Is it part of an arbitrage opportunity?\n\nFurther, options action is not permeated in the media. It's only monitored by a minority of active trader & institutions. Public information doesn't necessarily mean it's news", "score": 3, "replies": [{"body": "Sure, you don’t have certainty as to why someone is placing a bet, but almost all trading strategies don’t require certainty. You just need to know tendencies toward future price movement based on the given options movement, and if you can act first, then you can profit off the information. Even if you’re only correct 55% of the time, if you make enough of these bets it can be a profitable strategy.", "score": 1, "replies": [{"body": "Aboslutely, but what does that have to do with defining price action as news? Usually news refers to headlines on the terminal, published articles, reports, release of company data/financials/events etc.", "score": 1, "replies": [{"body": "I’m referring to news in the more “efficient market” sense I guess. In that sense, price action is news.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Probably gonna trim position today if we get another up day, purely because stock would become overbought. Four consecutive up days is very rare on TSLA and momentum indicators suggest stock is becoming overbought on a weekly basis. Would re-enter on a pullback and set up an earnings play.", "score": 5, "replies": [{"body": "That is right on Tsla generally. Especially if there are two days of significant rise >5%, a drop almost always follows. \n\nHowever, when there are pending news or significant sentiment change, Tsla tends to rise non-stop on daily basis, anywhere near 0-2% per day, last time we see it from Q2 delivery to earning. This time we also just see short position trimming, GF3 online in a week, earnings in two weeks, pickup in November, almost certain Q4 delivery record, and SPY is at a reasonable low level now. \n\nIf no significant change, I plan to not do anything in these two weeks, as Tsla price is still very reasonable to hold. The main thing that may change my plan: if early earning results from other companies are very indicative of a recession, or Tsla rises too fast in the next few days.", "score": 2, "replies": [{"body": "I absolutely would hold stock. In my case I bought calls when the stock was below $230 after the delivery dump. Up about 80% so in my case wise to trim on a run-up.", "score": 2, "replies": []}, {"body": "Baggholder420 and BaunDorn, I agree with all of this. What are you doing up to the Earnings call? Do you think there will be a major drop after the call again?", "score": 1, "replies": [{"body": "No set strategy as market changes everyday, and I will be adaptive whenever situation changes....\n\nA major drop is possible if Macro sours, which is a good chance to load some. So is a major rise if every other tech beats their guidance prior to Tsla, which may be time to trim position before earning. \n\nAt current rate I am just holding and watching.", "score": 1, "replies": []}]}]}, {"body": "I'm definitely kicking myself for selling at $239, trying to resist the fomo and wait for a pullback.", "score": 1, "replies": [{"body": "$239 is a bit rough because it's below intermediate support lines of $240 and $245. Fair value going into earnings is about $245. I expect a bit of a run-up to $250+ so earnings better be decent. Taking profits on option positions at say... $250 with higher IV prior to earnings is a good idea.\n\nTaking profits on stock? Not *as important* (but still advised) when trading stock unless you have hundreds or thousands of shares because you don't suffer from time decay and IV crush like options do.", "score": 3, "replies": []}]}, {"body": "This comment right here is what made me sell at 247.8 today... pretty much dropped 4 points an hour later.\n\nBless you 😍", "score": 1, "replies": []}]}, {"body": "What happened?", "score": 2, "replies": [{"body": "[Xillllix](https://www.reddit.com/user/Xillllix/)  bought [more shares](https://www.reddit.com/r/teslainvestorsclub/comments/dfvcfk/tsla_daily_investor_discussion_october_10_2019/f36se48?utm_source=share&utm_medium=web2x) this morning and tanked the stock", "score": 9, "replies": [{"body": "Lol indeed", "score": 1, "replies": []}, {"body": "I think it was u/ajdude101 and his end of year [price prediction of 419.99](https://www.reddit.com/r/teslainvestorsclub/comments/dfvcfk/comment/f36qp79).\n\nIf you find some torches, I'll go look for some pitchforks.", "score": 0, "replies": []}]}, {"body": "Wow. I’ll never learn", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "1. Still in watch & no-opinion mode for Waymo.\n2. It is almost certain the delivery will be higher for Q4, due to US tax phase-out spurs the demand & GF3 in China. So I am expecting Q4 > Q3 > Q2 in revenue and profit and cash, with Q4 being much better. Any reason you think Q4 may be worse?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Why would Tesla could not recognize any deferred FSD revenue in Q4? You have to rememeber some people buy FSD right from the configurator cheaper - especially now with Smart Summon released in USA. If there is any recognition in Q3 so there will be in the next quarters just not that big (because of accumulated backlog), but if Enchanced Summon gets to Europe / China than that should be again pulled from the backlog.", "score": 1, "replies": []}, {"body": "I don't think they will recognize that much for FSD in Q3. You can check out my post on Q3 deferred revenue history and expectation -- anywhere 100-300M this Quarter is possible.", "score": 1, "replies": []}]}]}]}, {"body": "What do you all expect the stock price to be by the end of the year?", "score": 1, "replies": [{"body": "it is hard to give a single number. \n\nI feel anything within 210-350 is possible, because Macro, Tsla current operation, and future prospect can change significantly from now to year-end. \n\nMy average guess is trading around 260-300 at December.", "score": 7, "replies": []}, {"body": "419.99", "score": 10, "replies": []}, {"body": "265", "score": 5, "replies": []}, {"body": "Flat. I doubt we see any change for the next half year. Investors want to see results nowadays and dont buy into musks dreams anymore.", "score": 3, "replies": []}, {"body": "300", "score": 5, "replies": []}, {"body": "End of 2019? I'm guessing similar to now.\n\nHoping for a bump in January on GF3 prod/sales numbers and later on January earnings.", "score": 2, "replies": []}, {"body": "270", "score": 2, "replies": []}, {"body": "247", "score": 2, "replies": []}, {"body": "$3.50", "score": 1, "replies": []}, {"body": "$243.53\n\n(Bring on the downvotes from the bulls and the bears)", "score": 1, "replies": []}]}, {"body": "Closing at exactly the same price as it opens.. again? Is this normal? What kind of thoughts or financial mechanism leads to this?", "score": 1, "replies": [{"body": "Because it's Thursday and the swings from 249 to 242 drives option activity at the 240, **245**, and 250 price levels. Most of those options, together with options sold in the past couple weeks, will expire worthless tomorrow and the option writers keep their premium without exchanging shares. Let's say broader market is up slighty or down slightly tomorrow... options market still pegs TSLA at $245. Ofc, if there's high volume and 2% swing in the macro tomorrow then option writers can't peg TSLA to $245.", "score": 3, "replies": [{"body": "Your answer will keep me busy for a while until I actually understand it. But it sounds pretty legit!  Thanks!", "score": 4, "replies": []}]}]}, {"body": "TIL that despite their entire comment and post history being negative and destructive, some frequents here claim to be \"long TSLA\".\n\nIf you can't beat them, join them I suppose.", "score": 0, "replies": [{"body": "It's probably not a case of join them.  It's probably just a lie to give the illusion of impartiality.", "score": 2, "replies": [{"body": "My thoughts were that after spending months of spreading ridiculous claims, the sentiment is starting to look up and they don't want to look like a fool. Just my .02.", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "I agree with you but, \" Maybe you should also learn\" is best left unsaid.", "score": 3, "replies": [{"body": "Yeah, I agree with you.  There was a recent history, but I should have left that out.", "score": 0, "replies": []}]}, {"body": "Agreed. IMO it should be totally fine to be bullish or bearish at a given time and still be considered a “Tesla Investor”.", "score": 1, "replies": []}, {"body": "First of all, it's down nearly 8% YTD, not 30%. And secondly, it's hard to believe that somebody who constantly publically trashes the stock and points out the flaws and poor financials wants to see it succeed in order to aid their position. That seems awfully counter-productive.", "score": 0, "replies": [{"body": "> First of all, it's down nearly 8% YTD, not 30%. \n\nAccording to Yahoo finance, TSLA was trading at 334 at the beginning of the year and is now at 244.  27%.  What is the source for you saying it is 8% down YTD?  Do you trade based on that source?\n\n> wants to see it succeed in order to aid their position.\n\nYou are missing the point about investing. This has nothing to do with whether I want something to succeed or fail. This isn't an emotional thing or an I love or hate TSLA or the CEO or the Roadster 2.0.  I am just determining whether or not it makes sense to invest in a stock or to sell a stock based on how I evaluate the market.  I thought Tesla would do 102k deliveries last quarter (wrong on that) and I think that the company will have much better financials than expected (we will see if I am right on that) so I invested. But I still think it is a joke that that guy can't get that gap on the glovebox fixed, but that doesn't change the fact that I think there is money to be made short term. \n\nAs I said before, I don't think for a second that my posts will aid or hurt my position in any way at all. This is a company with a 40B market cap and major institutional investors, it isn't some penny stock.", "score": -1, "replies": []}]}]}]}]}
