{"title": "California’s Governor Wants Berkshire to Bid for Bankrupt PG&E", "selftext": "https://finance.yahoo.com/news/california-governor-wants-berkshire-bid-235301474.html\n\n(Bloomberg) -- California Governor Gavin Newsom wants Warren Buffett’s Berkshire Hathaway to make a takeover bid for bankrupt utility giant PG&E Corp.\n\nIf Berkshire is interested in buying the San Francisco-based power and natural gas company, now is the time to make an offer, Newsom said Saturday.\n\n“We would love to see that interest materialize, and in a more proactive, public effort,” he said in an interview. “That would be encouraging to see. They are one of the few that are in a position to make a significant run at this.”", "id": "dnt87l", "created_utc": 1572182976.0, "score": 209, "upvote_ratio": 0.93, "num_comments": 221, "comments": [{"body": "Why would Berkshire want to buy a failing company whose failure was due in part by state regulations and mindset?", "score": 339, "replies": [{"body": "why would any company...let alone the conservative BRK", "score": 75, "replies": [{"body": "#BECAUSE WE ASKED NICELY!", "score": 83, "replies": [{"body": "Oh ok, carry on then.", "score": 11, "replies": []}]}]}, {"body": "This, this, this. What part of PG&E looks good to them or the current political climate of Cali. Calling for Buffet must of been his Hail Mary play lol", "score": 88, "replies": [{"body": "Cuz they charge whatever they want. How does a business like that fail ? Paying all their money to corporate bonuses is how https://www.nbcbayarea.com/news/local/PGE-Bankruptcy-Judge-Shoots-Down-16-Million-Bonus-Plan-558880041.html", "score": -11, "replies": [{"body": "Lol...their rates are regulated by the state. They certainly cannot charge whatever they want...", "score": 15, "replies": []}, {"body": "Those bonuses are pennies. Doesn’t make even a tiny bit of difference to their budgets", "score": 5, "replies": []}, {"body": "Wrong...they are given a rate that is charged.", "score": 2, "replies": []}]}, {"body": "Wrong, wrong, wrong. BH buys value and they have experience in the industry. \n\nAlso, wtf do politics have to do with this?", "score": -10, "replies": [{"body": "Is that a serious question? Utilities, especially power generation are heavily regulated.", "score": 20, "replies": []}, {"body": "This is the same governing body who asks why gasoline prices are so high...and is blaming price gouging....not their unique blend requirements.", "score": 5, "replies": [{"body": "Reddit is full of libs.  Careful not to hurt their feelings.", "score": -2, "replies": []}]}, {"body": "Utilities are heavily controlled by the legislature and regulatory boards.\n\nCali is the worst in that regard. Not only is there massive anger at utilities due to wildfires, they have all sorts of renewable mandates with no clear funding or plans.", "score": 1, "replies": []}]}]}, {"body": "They wouldn’t. Goes against everything that W Buffet looks for in an investment. This is just what a politician wants from the politician’s perspective.", "score": 26, "replies": [{"body": "I don’t know; they have one hell of a moat.", "score": -10, "replies": [{"body": "Moats typically guard something someone wants, such as a positive free cash flow.", "score": 8, "replies": [{"body": "LOL...a moat around a sinking ship.", "score": 5, "replies": []}]}, {"body": "The reason for that is they are taking their time looking for the right acquisition. This is not the right acquisition", "score": 5, "replies": [{"body": "I don’t think you got my reference. WB has stated he looks for companies with moats; essentially companies with a layer of protection against competition. A utility company has the ultimate moat.", "score": 6, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Who is going to come in and take over providing their services? How is that not a moat? \n\nYou can have a moat and still be over valued.", "score": 1, "replies": [{"body": "What your describing is a monopoly not a moat. A moat is a unique thing that others cannot do or only you have the patent on. PG&E is the only game in town so they are a monopoly and to change that you need to change the political climate of the area/state imo.", "score": 1, "replies": [{"body": "Sure sounds like a moat.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Berkshire already owns Pacificorp, which conducts business as Pacific Power in Northern California and has no problem in maintaining profitablity. \n\nThe state regulations contributed to PG&E's problems, but they weren't the sole cause. \n\nBH already has massive experience dealing with CA Public Utilities Commission so that should not be a concern here.", "score": 26, "replies": []}, {"body": "Buffett will do what he always does - buy the distressed assets cheap if he thinks the trouble is fixable, and be touted as the genius once the trouble is fixed, or pass if be thinks this is not fixable. That's what he did in 2008.\n\nThe time to buy is when the company is on its knees - if you can separate the good companies from the bad companies. There's nothing more to \"value investing\" than that.", "score": 6, "replies": []}, {"body": "It's a utility.. they print money if you run them tight.", "score": 22, "replies": [{"body": "In most sane places, yes. Not in California.", "score": 42, "replies": [{"body": "What are the regulations that make CA insane?", "score": 1, "replies": [{"body": "If you burn someone's house down you have to pay for it even if you followed the rules, it's called reverse indemnity and pge spends all their lobbying money on it every year", "score": 2, "replies": []}]}, {"body": "Yeah we actually hold them to a standard. When people die. And are dead. They’re dead. But you sane people keep going", "score": -9, "replies": [{"body": "How’s your electric car gonna go with no electricity?", "score": 18, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "No but you can drive to another gas station that can pretty easy", "score": 15, "replies": [{"body": "But if you don't have any gas to drive to the next station?", "score": 2, "replies": []}, {"body": "And so can you with an electric car. Just how you at least attempt to fill up before a disasterous events, you'd charge up before hand. The larger the blackout the larger the distance you have to drive for gas.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Ok. Well try dealing with it for a week and report back.", "score": 2, "replies": []}]}]}, {"body": "You can with a gas powered generator. Pretty much the law to be equipped in most eastern states for Hurricanes.", "score": 1, "replies": [{"body": "Not 100% true buddy.\n\n[Most gas stations have generators ready to go](https://www.sun-sentinel.com/news/fl-xpm-2007-06-02-0706011065-story.html)\n\nFirst point. Most if all of those stations are **prewired for generators** they don't have them installed or insight.\n\nSecond point\n**Last year, legislators passed the law in response to the devastating hurricane seasons of 2004 and 2005, which left many gas stations with fuel but no power to provide gas to consumers.**\n\nThis article is from 2007. So you're giving electric cars shit for the same problem that plagued gasoline vehicles long before this point.\n\nIt isn't that gasoline stations have a solid power source and naturally an advantage, as you're trying to insinuate. Gasoline stations have the same disadvantage. And it sounds like its only patched on the east coast. And that's only on evacuation routes.\n\nIt's a fact that if you don't live in an area that gets hurricanes and not along a major evacuation route, if you don't have power you're not going to be able to get gas.", "score": 3, "replies": []}, {"body": "Which law is that?", "score": 1, "replies": []}]}]}, {"body": "Solar energy", "score": 0, "replies": []}]}, {"body": "Yeah, keep enjoying those brown/blackouts. Keep that shit out there.  Don’t come crawling out looking to ruin other people’s state after you get done ruining that place.", "score": 4, "replies": []}, {"body": "Its not just the wildfire issues. \n\nThe strict renewable mandates without clear funding are also a huge uncertainty for utilities.", "score": 1, "replies": []}]}, {"body": "Sane places that don’t care as much if you destroy the environment.", "score": -16, "replies": [{"body": "Would you say, under CA regulations and enforcement, PG&E has been destroying the environment, or no?", "score": 10, "replies": [{"body": "What specific regulation caused pge to operate hardware prone to failure that result in fires?", "score": 4, "replies": [{"body": "Making it really hard to get permitting to replace the structures. \n\nAlso not letting them charge enough to afford maintenance probably. (Yes I know they could have if they just didn't pay their CEO but that's never an option)", "score": 3, "replies": [{"body": "Are we talking about the same PG&E that pumped out dividends for decades? Give me a break with this.", "score": 0, "replies": []}]}, {"body": "California regulations make controlled burns difficult. Also letting people build in wildfire prone areas.", "score": 1, "replies": []}]}, {"body": "Hah, they sure have my friend. They really have. The people and the politicians want them not to and spend millions and millions of extra dollars so that it isn’t so, but unfortunately the CPUC and PG&E have ultimately failed them and we’ve paid dearly for it with our own loss of life and much destruction. It’s quite sad and it needs to improve.\n\nMore shut downs soon for hundreds of thousands of people will be another reminder of this terrible failure as well and it will continue for a long time as these things (organizationally and the actual equipment) takes time to fix.", "score": 0, "replies": []}, {"body": "How far back are you looking? \n\nBecause they certainly HAVE, but under current regulations it has been more restrictive. \n\nDon't forget, PG&E is the literal reason for a lot of the increased regulations in CA.", "score": -4, "replies": []}]}]}]}, {"body": "No, they print money if the government that controls the rates allows you to.", "score": 13, "replies": [{"body": "Yeah that's how a regulated monopoly works. You run it well and you have a stable / profitable business. Utilities as a sector.. traditionally a place for safe dividends.", "score": 16, "replies": [{"body": "Which somehow in Ca is bankrupt....", "score": 0, "replies": [{"body": "\"somehow\"... \n\nI don't get it. What's your point? You arguing they operated without flaw?", "score": 1, "replies": []}, {"body": "I honestly think the government in california wants all the people to be relient on the govenrmnet.", "score": -1, "replies": []}]}]}]}, {"body": "Give it to u/Potato_Octopi,  they’ll know what to do,  it’s easy.", "score": 15, "replies": [{"body": "I'll take if you're giving!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Bingo. You could say “progressive” or that people actually respect science and the earth’s destruction if we keep polluting it.", "score": 6, "replies": []}]}, {"body": "And it’s bankrupt......", "score": 1, "replies": []}]}, {"body": "Because the sum of the parts is higher than current valuation?", "score": 2, "replies": [{"body": "How’s that?", "score": 1, "replies": [{"body": "Their market cap is now less than what SanFran offered for just their lines there.", "score": 2, "replies": [{"body": "Better figure in the liability issues as well. There’s a reason they went bankrupt.", "score": 7, "replies": []}]}]}]}, {"body": "They had money to run millionaire campaigns to outlaw municipal power. For that there’s money. To update their crumbing ancient infrastructure? LOL, no. They are expensive, and they suck. Other private companies in the state are not having this issues. They are the Sears of utilities.", "score": 1, "replies": [{"body": "Seriously, people here complaining about California.\n\nThey're natural monopoly. It's a thing with a wikipedia page dedicated to it and ultilities are often regulated.\n\nSouthern California Edison is doing fucking well.", "score": 3, "replies": []}]}, {"body": "That's called biz in Cali", "score": 1, "replies": []}, {"body": "Buy low, sell high. You know how fast CA Democrats fold to corporate entities run by powerful liberals?\n\nThere, I gave you a real answer. Now, go pay attention to one of the other masturbatory responses. I know it's in your nature", "score": -14, "replies": [{"body": "Don’t be a dick.", "score": 5, "replies": [{"body": "I'm telling you the truth while everyone else is telling you lies, and you tell me not to be a dick.\n\nAgain, I know it's in your nature. You prioritize feelies over reality", "score": -14, "replies": [{"body": "You don’t know me. Haha. Nice try tho.", "score": 7, "replies": [{"body": "I know everything I need to know about you within the scope of this thread. You're the type to make statements in the form of a question, and you're the type to call people dicks for giving you the right answer. You're dead weight. I'm going to guess your GPA was at around 3.1, and that's with grade inflation", "score": -4, "replies": [{"body": "Funny. But entirely incorrect. Again, nice try. And, don’t be a dick.", "score": 7, "replies": []}, {"body": "No you’re just a dick. Be nice to people and stop acting like a know it all.", "score": 6, "replies": [{"body": "Is it California tag team time?\n\nYou just disrespected this user more than I did", "score": 1, "replies": [{"body": "How’s that?", "score": 4, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Why they went bankrupt? It is a utility. Should be the \"safest\" investment in stock market.", "score": 38, "replies": [{"body": "Not really they went bankrupt because of bad management of their own facilities which lead to some fires and they got sued badly for their negligence.      \nEdit:  https://www.latimes.com/business/la-fi-pge-bankruptcy-filing-20190129-story.html", "score": 55, "replies": [{"body": "Exactly this. People in here are placing the blame on the CA government, but that’s not the case at all. Poor management made poor decisions to put profit over safety, started over a dozen wildfires due to their shitty equipment standards, then got sued for tens of billions of dollars due to their short sightedness.\n\nThis was entirely avoidable.", "score": 44, "replies": [{"body": "People are so fucking daft.\n\nBerkshire owns Pacificorp, they already do business in CA as Pacific Power. Somehow this has not caused them to go bankrupt.\n\nAlmost as if PG&E is to blame for their financial mismanagement.", "score": 17, "replies": []}, {"body": "In 3rd world countries they also blame “bad company management” on rolling blackouts.  I’m not buying any of it. California is getting worse not better.", "score": -16, "replies": [{"body": "California is making absurd amounts of money and has billions of dollars in surplus. I’d rather do business there than Mississippi. Just like I’d rather live in Norway than Somalia.", "score": 11, "replies": [{"body": "Government fat cats get rich while the people suffer. Sounds like the 3rd world.", "score": -19, "replies": [{"body": "Yes we are all suffering here in Cali. It's a horrible wasteland! You're better off trying your luck in prosperous areas like Mississippi and Alabama!", "score": 5, "replies": [{"body": "Overconfident self absorbed Californian. Thinks anyone criticism their heaven on earth must be a backwards hick from such Lowely places as Alabama.  \n\nNever been to either of those places but you’d know that if you bothered to check. But you are Californian you wouldn’t be smart enough to do that.", "score": -4, "replies": []}]}]}]}, {"body": "Are you really comparing California to a third world country?\nPray tell me the utopia you live in. Please, enlighten me.", "score": 9, "replies": [{"body": "I live in a utopia with no rolling blackouts.", "score": -10, "replies": [{"body": "Wow. Ashamed to even say where that is. Nice.", "score": 10, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "Ok. I’d rather live in CA than 95% of the rest of this country.\nAlso, of note, I do not live in CA.\n\nAlso, way to go on stooping to name calling. I clearly struck a nerve.", "score": 8, "replies": [{"body": "Be careful, I think you hurt his feelings", "score": 3, "replies": []}, {"body": "Enjoy your blackouts.   California is sooooooo great", "score": -4, "replies": [{"body": "[removed]", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": -6, "replies": [{"body": "First of all, I said I don’t live there. Present tense.\nNot that I haven’t lived there.\n\nSecond of all, not living there right now does not make me unqualified to have an opinion on it.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It’s not like I lived there 100 fucking years ago. I lived there less than a year ago. I never at any point claimed my opinion was more valid than anyone else’s–you claimed that my opinion wasn’t valid at all because I don’t live there and I disputed that.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I left because everything closed too early and I hate having to drive everywhere all the time. The quality of life out there was actually pretty good. I just missed having a subway system and restaurants open past 9pm.\n\nI’m also fine paying more in taxes to help those less well off than myself, but I guess you wouldn’t know about caring about others, huh? (Also, my taxes didn’t go down when I moved, AND they actually increased under this current shit show of a political administration. You’re welcome.)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Keep it civil or you’ll be banned. Thanks.", "score": 2, "replies": []}, {"body": "Glad you don’t live there. Everyone in CA is happier than you. Fucking idiot.", "score": -4, "replies": [{"body": "I highly doubt that. I have a cold refrigerator and my lights turn on.", "score": 5, "replies": [{"body": "So does mine. Never had a blackout. Just glad I don’t have curmudgeons around.", "score": 2, "replies": [{"body": "So “You got yours”. Who cares about the hundreds of thousands without power right?  Classic 3rd world mentality.", "score": 3, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "It’s complicated. Look up reverse indemnification. This coupled with high winds, low moisture and poor maintenance and supervision of their equipment all created many fires. Much of the same thing is going around with utilities all over the country but when a fuse blows over green grass it’s a much different outcome than thousands of acres of tinder dry grass.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -14, "replies": [{"body": "explain this", "score": 7, "replies": [{"body": "AB1054 makes utility companies liable for wind related fires even when there’s no negligence on the utility’s part.", "score": 2, "replies": []}, {"body": "Negligent companies can't survive in California for long. Maybe that's what he meant.", "score": 1, "replies": []}]}]}, {"body": "Power companies are being disrupted by solar. Look at Germany for the best example. All utilities all over the world have been hilariously bad at predicting the penetration of solar[1]. There is no way that solar will decrease. Every capacity graph is a hockey stick for solar and the price/watt continues to drop. In Germany almost 100% of the coal and gas capacity won't be used to generate energy anymore [2]. These plants cost billions and are now effectively approaching worthless because solar is generating most of the capacity that they used to provide.\n\n[1] https://zenmo.com/en/photovoltaic-growth-reality-versus-projections-of-the-international-energy-agency-with-2018-update-2/\n\n[2] https://ieefa.org/ieefa-germany-rwes-coal-phaseout-compensation-demands-defy-market-prices/european-union-generation-mix-through-2040/", "score": -6, "replies": [{"body": "Solar is great but not scalable as of yet. In time, but not this time.", "score": 1, "replies": []}, {"body": "You really need to take any hockey stick graphs with a grain of salt.  They normally indicate a run away model.  Nothing goes to the moon -yada, yada, yada...", "score": 0, "replies": []}, {"body": "Also this is not true Germany is burning more natural gas then they ever have previously and the cost of energy has only gone up with the addition of more solar https://www.bloomberg.com/news/articles/2019-02-28/germany-natural-gas-demand-set-to-soar-as-coal-plants-close\n\nFrance on the other hand didn't go the crazy leftest way and went full nuclear with 100% clean cheap energy. \n\nhttps://www.ted.com/talks/michael_shellenberger_how_fear_of_nuclear_power_is_hurting_the_environment?utm_campaign=tedspread&utm_medium=referral&utm_source=tedcomshare", "score": 0, "replies": [{"body": "Your first article calls out that a risk for gas usage is that renewables are competitive. I'm making an argument that solar is still under estimated and growing.", "score": 1, "replies": []}]}]}]}, {"body": "Gavin Newsome is a cuck and Daddy Buffet is an alpha chad. Short PG&E", "score": 24, "replies": [{"body": "Pcg was at 3.80 when you made this comment. Now it’s at 10.87 and looking to go to $15", "score": 1, "replies": []}]}, {"body": "ITT a shitload of people thinking they know how BRK feels about CA, what caused PGE bankruptcy and being wrong about both.", "score": 16, "replies": []}, {"body": "I would think the fact that the California Governor is Gavin Newsom would be a big deterrent to such an idea.", "score": 5, "replies": []}, {"body": "Just and FYI since multiple people in this thread are claiming BH would never touch a company in CA.\n\nBerkshire already owns a power company that operates in California.\n\nPacific Power services Northern California", "score": 19, "replies": [{"body": "> Pacific Power services\n\nIt would seem that people ITT are unaware of [Berkshire Hathaway Energy](https://www.brkenergy.com/)", "score": 4, "replies": []}]}, {"body": "Damn this is so similar to 2008, Bear Stern and Lehman guys were faxing Warren pleas to buy out. Warren didn't budge then and not going to do it now.", "score": 9, "replies": [{"body": "PG&E isn’t going to bring down the entire American economy like they did though.", "score": 1, "replies": [{"body": "u never know, we would hope so.", "score": 1, "replies": []}]}]}, {"body": "So what happens to stock?", "score": 8, "replies": [{"body": "In bankruptcy, stockholders are the last in line. If debts exceed assents, they get nothing.", "score": 28, "replies": [{"body": "unless you have those sweet sweet preferred shares!", "score": 0, "replies": [{"body": "even then you wait behind any secured debt holders (bonds)", "score": 1, "replies": [{"body": "right, but then at least you beat out those pesky common shareholders", "score": 1, "replies": []}]}, {"body": "They are only ahead of common stock. They will also get wiped out if the debt is too high. I assume you've knew this though.", "score": 1, "replies": []}]}]}]}, {"body": "PG&E has always had shity safety the company poised the town of Hinkley CA and the surrounding water table. It was their gas line that exploded due to no mantanance killing ppl. The latest paradise fire killing 85 ppl. \n\nThe company history of disregarding for the safety of the people and communities PG&E operates in and around.", "score": 3, "replies": []}, {"body": "Governor: Ok we need to trick a super rich company into taking the fall and paying for all of these wildfires that basically can’t be prevented unless we spend a trillion dollars and bury all the wire.\n\nAide: How about Birkshire?", "score": 5, "replies": []}, {"body": "Everytime when shit hits the fan somebody wants to sell Buffett something and just like 99% of the times he'll pass because it's not good investment.", "score": 3, "replies": []}, {"body": "I wouldn't give you a fucking penny for it. Between the needed upgrades and the regulations it has no value.", "score": 7, "replies": [{"body": "Greg Abel and the Gang might have a different opinion...", "score": 2, "replies": []}]}, {"body": "Warren Buffett: Yeah, so now I can get blamed for fires? LOL!", "score": 9, "replies": []}, {"body": "Why dont Cali take over???", "score": 2, "replies": []}, {"body": "“ Please will someone with lots of money step foot in our state so we can ambush them?”", "score": 2, "replies": []}, {"body": "How about California buys them out and we have a state sponsored system, pay taxes to run it but still be lower than PG&E’s cost because they’re not concerned about profit just breaking even. And then we could actually have some reliability and a system that is representative of the needs of the people of California\n\nEdit: lol I didn’t even realize what sub I was on I thought this was UCSC PG&E cut our power again.", "score": 3, "replies": [{"body": "That's what any other sane country would do. But not here in America.  You gotta beg an uber rich guy to save your power grid.", "score": 2, "replies": [{"body": "That's because we have Uber rich people to beg.\nWhat do you have.", "score": -1, "replies": []}]}, {"body": "because the liabilities are fking huge and its going to cost alot of money, and it will cost alot of money to maintain.", "score": 1, "replies": [{"body": "Sovereign immunity", "score": 0, "replies": []}]}]}, {"body": "What a shit show of a state.", "score": 0, "replies": [{"body": "Seriously...it’s only the 5th largest economy in the world.", "score": 26, "replies": [{"body": "Toaster303 is almost certainly talking about them civically and gubernatorially.. CA has an insanely productive economy DESPITE their horrible state and local governments/agencies, NOT because of them.", "score": 2, "replies": []}, {"body": "The sheer size helps there.  It’s massive and on the coast.", "score": 2, "replies": []}, {"body": "it's the 5th biggest economy cuz of china and the universities bro.", "score": 1, "replies": []}, {"body": "With massive natural advantages and a lot of luck (Hollywood, silicon valley, etc)\n\nI wonder where it would be if it were properly governed.", "score": -7, "replies": []}, {"body": "Also the only state to tax carbon emissions, also the state with the largest debt, also has the highest tax on gasoline, also the state with the highest homeless rate, the unemployment is ranked the highest, highest “move-out” rate in the US, highest income tax rate in the US. \n\nYeah sounds great!", "score": -2, "replies": [{"body": "Jesus fucking Christ, please stop spewing bullshit. It does not have the highest unemployment rate (https://www.bls.gov/web/laus/laumstrk.htm) and it does not have the largest debt. It also does not have the highest homeless rate (https://www.statista.com/statistics/727847/homelessness-rate-in-the-us-by-state/). \n\nWhere do you get these stats from? I’m too lazy to verify the rest of your claims there but at least 3 of them are false. And what is wrong with carbon tax? Should we be paying a carbon incentive instead?", "score": 0, "replies": [{"body": "Highest income tax rate- https://turbotax.intuit.com/tax-tips/fun-facts/states-with-the-highest-and-lowest-taxes/L6HPAVqSF\n\nHomeless - https://www.usich.gov/tools-for-action/map/#fn[]=1400&fn[]=2900&fn[]=6000&fn[]=9900&fn[]=13500\n\nState with the most debt- https://smartasset.com/credit-cards/states-with-the-most-debt\n\nHigh unemployment rate (6 highest, not the highest but one of the highest so you are correct there) - https://money.cnn.com/interactive/economy/state-unemployment-rates", "score": 1, "replies": []}]}]}, {"body": "Only because it is attached to the US. If California became an independent nation, it would become a third world country very quickly due to dependence on water from the Colorado River.", "score": -5, "replies": []}, {"body": "[deleted]", "score": -8, "replies": [{"body": "lol none of those places other than Japan is top 5. I can tell you’ve never been to Japan, because it’s an awesome place. You’ve probably never been to Cali either", "score": 4, "replies": []}]}]}, {"body": "Eh California way has their shit together in a lot of other ways compared to all states. Oh yeah it’s also one of the main reason for the entire country’s economic prowess that most fly over states love to tout.", "score": 19, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "HAHAHAHAHA", "score": 1, "replies": []}]}, {"body": "I’m a Texan. Cali is a shit hole that is almost completely bankrupt. Please explain to me what shit you have together there?", "score": -16, "replies": [{"body": "Even in Australia we see the cancer that is liberal California spreading to other states, they'll bankrupt you too if they get power. Speaking of which, tax fuel enough to make electric cars viable, then turn off the power grid. LOLAFORNIA. Retards still can't work out why they lost.", "score": 2, "replies": [{"body": "Yep lol", "score": 1, "replies": []}]}, {"body": "You know what you’re right. Thank god for Texas’ amazing grace to humanity for its existence as California looks up to it so highly. I’m just so glad you took the time out of your glorious day to tell me that because otherwise we wouldn’t have been able to figure that out for ourselves.", "score": 5, "replies": []}, {"body": "The weather???", "score": 1, "replies": []}, {"body": "Bankrupt? We literally have a $21B budget surplus, amazing how you just causally throw around bullshit like it’s real", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": -8, "replies": [{"body": "Yeahhh, this just shows that you don’t know what you’re talking about.", "score": -1, "replies": []}]}]}, {"body": "What state are you from?", "score": 15, "replies": [{"body": "He apparently has been living in Germany for the past 5 years, but don't know before that.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -11, "replies": [{"body": "PGE gave all their money to their board. Rewarded themselves for being selfish and holding a monopoly on the state. They don’t care about the service they provide. \n\nApple cares about the service they provide and they thrive. PGE doesn’t care about their customers and fail.", "score": 9, "replies": []}]}]}, {"body": "The state should buy it and turn it into a co-operative", "score": 2, "replies": [{"body": "Yeah...Ca state has done so well managing things. Please.", "score": 33, "replies": [{"body": "Nebraska runs a co-op for power. We sell our surplus to many states.", "score": 16, "replies": [{"body": "And Berkshire dunks on Nebraska’s utility prices during every annual shareholder meeting.  Comparing them to what they do in Iowa and laughing about it.", "score": 3, "replies": [{"body": "Lmao, that's 100% true too. Every year, Abel/Warren/Charlie each make multiple jokes about NE Public Power when they're going through the Berkshire Energy results.", "score": 2, "replies": []}, {"body": "Also berkshire can’t in anyway profit off our power, so thats an issue for him.", "score": 1, "replies": []}, {"body": "Sure, i mean Iowa is half the size, so far less infrastructure to maintain. I mean it makes sense to make that comparison, it’s not like warren buffett is a hypocritical asshole anyways. I mean he never did anything like “fight for keystone” and then made massive profits on shipping that oil with his railroad. Which by the way, is a shipping method MANY TIMES more prone to accidents than pipelines are.\n\nNo, he’s not a blight on our country at all.", "score": 1, "replies": [{"body": "Lol you mad.  Can’t wait to hear warren buffet dunk on your crappy power prices again in 6 months.", "score": -2, "replies": [{"body": "Warren buffet is a pompus, greedy asshole and why the left hates billionaires and worships him so much is confounding as hell.", "score": 3, "replies": [{"body": "Care to explain more?", "score": 1, "replies": [{"body": "Google man", "score": 1, "replies": [{"body": "I did.  Please explain, still", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "So it's a good idea in the right hands. I don't know if California qualifies as the right hands. They like to shoot themselves in the foot a lot. They somehow bungled legalizing weed by over-regulating it, [which actually ended up strengthening the black market here](https://www.latimes.com/opinion/story/2019-08-30/prop-64-illegal-marijuana-growers).", "score": 1, "replies": []}, {"body": "Nebraska is not California......", "score": 1, "replies": []}, {"body": "How's the Omaha Public School Teacher's pension fund doing? Good thing Buffett isn't running that either!   /s^2", "score": 1, "replies": []}, {"body": "Nebraska is not the Peoples Republic of Commiefornia.", "score": -4, "replies": []}]}, {"body": "The municipal owned electric utilities consistently beat the for-profits on price in [California ](https://www.sandiegoreader.com/news/2018/jan/18/ticker-sempra-hasnt-paid-corporate-taxes-2008/)", "score": 10, "replies": [{"body": "Governments are better at losing money?\nFor real? Wow", "score": 2, "replies": [{"body": "All of the muni’s are solvent, for profit PG&E is... well. Not so much.", "score": 4, "replies": []}]}]}, {"body": "I think it would be pretty great, next time just sue the state for all those damages. It's one step closer to sueing yourself. Also less likely to actually work.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "I said the state, not the fed.\n\nNebraska runs a co-op for power. We sell our surplus to many states.", "score": 10, "replies": []}, {"body": "> That being said, the federal government should be under no obligation to bail California out ~~if~~ things go south.\n\n*when", "score": -2, "replies": []}, {"body": "If the state takes over they will also get all the pending liabilities that pge has that bankruptcy has protected them for now. They have a lot of pepper whose homes got burned because of the fires their equipment caused.", "score": -2, "replies": []}]}, {"body": "And waste tax payers money.", "score": -6, "replies": [{"body": "Nebraska runs a co-op for power. We sell our surplus to many states.", "score": 9, "replies": [{"body": "Nebraska also probably doesn't have shit ton of regulations and stupid laws to abide by.", "score": -3, "replies": [{"body": "California is thriving. They have billions of dollars in surplus. The state is making way more money than any red state. Companies would much rather do business in California and New York even than Indiana, Mississippi, Louisiana, Arkansas, Montana, Kentucky, etc. Uber innovated in CA, just like AirBnb, Salesforce, Square, Oracle, Apple, Tesla, Bird, Amazon in Washington. No one is being stifled by regulations. The regulations attract smart valuable educated employees. \n\nEven the cities like San Francisco, LA, Santa Barbara, San Diego are way better places to do business than slackjaw cities like Stockton or Fresno. The “coastal elite” complaint kind of implies some level of financial success and aspiration.", "score": -1, "replies": [{"body": "California almost gets 60% of their electricity from neighbouring States. Own house production is very low and even then they are having these problems.", "score": 7, "replies": []}]}]}]}]}]}, {"body": "California should have considered this before they destroyed the company.", "score": 2, "replies": []}, {"body": "Won’t happen unless CA changes it’s liability laws.", "score": 1, "replies": []}, {"body": "Call the Koch Bros. This is their wheelhouse", "score": 1, "replies": []}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/neoliberal] [California: Heavily regulates a company until they declare bankruptcy, then calls on Berkshire to bid for it.](https://www.reddit.com/r/neoliberal/comments/do1fu9/california_heavily_regulates_a_company_until_they/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "score": 1, "replies": []}, {"body": "How is this actually a thing?", "score": 1, "replies": []}, {"body": "This comes across like Kanye asking Zuck for a billion dollars", "score": 1, "replies": []}, {"body": "fuck that shit, nationalize it. \n\nwhy would the  governor of a state, in charge of protecting the citizens, invite financial parasites to profit off his state's misery?\n\nPG&E's greed started the fires in the first place.\n\nDoes the governor think that wall street creeps are going to be less greedy than the current CEOs???\n\nfuck all of this shit and thanks for reading", "score": 1, "replies": [{"body": "Nationalize a bankrupt company?  This isnt the USSR.  \n\nLet them fail.  Socialize the transmission infrastructure in a buy out post bankruptcy at 1/10th the valuation.  And let renewables and net metering drive the electric production market independently and via free market.", "score": 2, "replies": []}, {"body": "Because the utility companies Berkshire owns are some of the cheapest/cleanest/safest/most reliable in the nation... Newsom wants Buffett to buy it out because he knows it'll get run very well.", "score": 2, "replies": []}]}, {"body": "Buy us so we can sue you. Lol.", "score": 1, "replies": []}, {"body": "Our governor is an idiot. Berkshire won't touch anything on California.", "score": -4, "replies": [{"body": "Pacific Power.", "score": 15, "replies": [{"body": "This thread is too funny...", "score": 3, "replies": []}, {"body": "Correct 4 communities along the border with Oregon. Less than 10k customers... No one wants to deal with the idiots in Sacramento. But you are correct.", "score": -1, "replies": []}]}]}, {"body": "California might be heading to a no power supplier situation.  Too much risk in being the power company.  BRK would never take on that kind of risk.  Not a chance in the world of this happening.  Power cost to my house in the Midwest 7 cents per KWH delivered fixed rate for 36 months.  Power in CA something like 35 cents per KWH and in bankruptcy.", "score": -2, "replies": [{"body": "BH already owns a power company that is in CA.\n\nPacific Power.", "score": 8, "replies": [{"body": "What makes you think they won’t divest?\n\nBecause it’d be very Berkshire to drop Pacific power now.", "score": 0, "replies": [{"body": "Because theyve been working very hard since they acquired it in 2006 to make it more profitable and consistently lobby the PUC to increase rates. \n\nWhy would you sell a company that has finally acheived profitability?", "score": 4, "replies": [{"body": "Because the government is going to attack it if they screw up, and hit it hard.", "score": 0, "replies": [{"body": "Screw up in what way? \n\n\nDo you have any precedents with the California Public Utility Commission that you're referring to?", "score": 2, "replies": [{"body": "I’m talking the state forestry service.\n\nWhich is the worst in the country.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "And be trapped in CA regulations?\n\nHell no he won't.\n\nHey, CA, you buy it and give away the electricity for \"free.\"", "score": -4, "replies": []}, {"body": "neoliberalism", "score": -6, "replies": []}, {"body": "Buffet should tell them to fuck off.  Cal regulations and nasty government is what killed that company.", "score": -4, "replies": [{"body": "Lol, like people already said in this thread, Buffet already owns a power company that does business in Cali. Your meme point is incorrect and vacuous.", "score": 2, "replies": []}]}, {"body": "Typical socialist thinking by Gruesome Newsome. Over-regulate, reduce competition, bail out incompetence and then want well off people and institutions to give money. Berkshire acquires well run organizations with strong managers, a solid business and a competitive moat. PGE is run amok failed managers that sets fires and has no moat just a pile of liabilities. Since Bershire has tons of experience in the insurance business, why would they want this mess.\n\nThe Goofy Gov is probably floating this so Berkshire will refuse and the Socialist State of California can move to taking ownership of PGE. Once that happens \"the ownership of all means of production\" will slide into Marxist hands.", "score": -1, "replies": []}, {"body": "The communist dictator of California asking a billionaire to buy their shit energy company is the socialism republicans fear,", "score": -2, "replies": []}, {"body": "It's not like they're going away anytime soon. There might be energy retailers / CCAs that start selling energy but the utility will always be delivering energy. Berkshire owns and operates a few utilities I think in the Midwest. Might not be a bad buy if they can recoop their assets and consider them capex and get them at a bargain.", "score": 0, "replies": []}, {"body": "Sorry California, you are the absolute worst state to own a corporation in. Why dont you have the workers own the means of production?", "score": 0, "replies": []}, {"body": "Save me Tom Cruise, save me Warren Buffet!", "score": -7, "replies": [{"body": "Scientologists might buy the power company in CA and take over the state?", "score": 5, "replies": []}]}]}
