{"title": "Input on my weekly strategy buying deep ITM TSLA call debit spreads", "selftext": "Hey All! I have been playing around with different strategies and want your input on it!\n\nFor the past 4 weeks I have been able to earn 8.4-9.5% weekly buying deep ITM call debit spreads on Tesla.\n\nEssentially the bet is that, on a weekly basis, Tesla will not lose over 11% Share Price Value from M-F. Breakeven is roughly around $100 per share less then the current share price. I attached a picture showing the play for next week.\n\nThoughts?\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/4ik7k6elq2s71.jpg?width=1141&format=pjpg&auto=webp&s=96e620cb07dd8d5ac9098c0074cb858e41603a45", "id": "q3fqbt", "created_utc": 1633632340.0, "score": 58, "upvote_ratio": 0.93, "num_comments": 89, "comments": [{"body": "It's a high probability trade... So it will be successful more times than not. But the one time it's not, it will wipe out many weeks' gains. So maybe stop if you see tsla losing momentum.", "score": 70, "replies": [{"body": "Works till it wipes you out. Pennies in front of a something something", "score": 36, "replies": [{"body": "It is a spread, will not wipe you out unless u go all in.", "score": 4, "replies": [{"body": "I think they mean wipe out the gains from the previous winners not blow up the account. Max loss is $1800 to make $155 so 1 loss can wipe out roughly 11.5 wins.", "score": 3, "replies": []}]}]}]}, {"body": "Make sure you stay strong to your conviction and don't bail because TSLA does often drop 7-10% intra-weekly.\n\nAs for this strategy, if you're all in, there are a few times (namely around March) where you'd have blown up your account doing this. So you're in a bit of a catch-22 because if you bail early, you'll lock in losses more often than not and erase weeks of gains, but if you stay strong to your conviction, you can be wrong and blow up your account.\n\nTrading's fun, isn't it?", "score": 41, "replies": [{"body": "nonlinear returns are a bitch.\n\nif you lose 50%, you need to make 200% to come back.\nso if you have a trade that makes 10% 90% of the time and loses 50% 10% of the time (.9 * .1 + .1 *  -.5 = +0.04 EV), if you trade at >10% of your porfolio, it's still a net loss because of these nonlinear returns.\n\nedit: 200% of \"current value\" or +100%.", "score": 25, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Correct. A 50% loss necessitates a 100% return to recover. https://finance.zacks.com/returns-needed-recover-stock-market-loss-6705.html", "score": 13, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "I know, was just providing one to be helpful in case someone couldn't figure it out. ;)", "score": 5, "replies": []}]}, {"body": "Why is this something worth noting though? If I own a stock and it goes down to $50 from $100, it's just offset by $50. It needs to raise $50 in price to return to where it was at. It's not like it has to raise $100 to break even.", "score": 2, "replies": [{"body": "I'm assuming because if you lose money in a spread that's a realized loss and it can't rebound after it expires,  but regarding holding shares I agree", "score": 1, "replies": []}]}]}, {"body": "ah, sorry. incorrect axes. I meant 200% of \"current value\", or +100%, to return from 50% (or -50%)", "score": 2, "replies": [{"body": "That doesn’t make sense. You just need 100% of your current money to get where you were. I don’t understand what 200% you’re talking about", "score": 1, "replies": []}]}]}, {"body": "So you think moving the stop loss to 5% on the spread is the wise way to go? This would protect against a sharp 5% downturn in the stock price on Monday after purchasing the spread (stock price tumbles $45/share) and up to a 10% downturn in the stock (minutes before expiration)????????????", "score": 1, "replies": [{"body": "not a stop loss. trade less. make sure the max loss is small compared to \"all your money\"\n\nmy max loss is about 15% of all my money, and i'm making 3 - 10% a month, and that's already WAY MORE risk than I should be taking. 10% a WEEK is absolutely absurd. it might pay your mortgage now, but one day it's gonna go poof", "score": 1, "replies": [{"body": "Wow! How do you consistently make 3-10% a month? What do you do?", "score": 1, "replies": [{"body": "first of all, 10% a month is wildly irresponsible. an appropriate risk level would probably be half of that.\n\nmy main positions are to opportunistically short VXX near term vol. During \"quiet\" times, I'll use as little as 20% of my total margin, but during \"tense\" times, you can jump in and short implied vol. my rough guidelines are: 50% of margin at 120VVIX, and all-in at 140 VVIX\n\nNormally, a 15% strike will be at maybe 80-90vol, like the 29 strike is today. However, during a spike, if the VXX hits 30, for example, that call will be at like 130 vol. So if you short at the top, you'll make money on the delta and the vega (or theta)\n\nYou can hedge your bets a bit by also selling a downside put. The beauty is they'll be at really high vol too, so you won't lose much even if the underlyer drops. for example, if we had that spike up to 30, a 26put might be at 80vol, but when the VXX relaxes down to 27, that same strike might relax from 80 vol down to 60vol like it is right now. So you'll be hurt on the delta, but compensate on the vega.\n\nnow how do you \"sell at the top\"? That's just me getting lucky, I guess. What I need to happen is: \n\n1. the market throw a temper tantrum once in a while. VXX goes up like 10 - 30%\n\n2. the temper tantrum doesn't get too bad, as in it doesn't blast past you and spike up to +50% or more\n\n3. the dip relaxes, then you de-lever and wait for the next spike.\n\nAnd that exact thing has been happening all year:\n\n1. Jan 6 riots. Spike in vol, drop it back\n\n2. GME in March threw the markets into chaos\n\n3. May, COVID delta\n\n4. July ... something happened?\n\n5. Sep -- debt \"crisis\", Evergrande \"crisis\"\n\nAnd in the quiet months, just take a small, relaxed position on short VXX and you'll make a little money.", "score": 6, "replies": [{"body": "Sounds incredible! Thanks for sharing! 👏🏻👏🏻👏🏻", "score": 1, "replies": [{"body": "Don’t enter volatility trades willy nilly. It’s a fools game. Going all in shorting volatility even if it’s at 45 is so risky it’s dumb. I’ve blown up an account trying that. Listen to experts, they all avoid volatility without intense risk management.", "score": 3, "replies": [{"body": "Don't worry, I ain't touching VIX 😂. But I admire what you do.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "How can you blow up your account on a debit spread? \n\nRisk is limited by the spread?", "score": 6, "replies": [{"body": "He won't blow it up per say.. but it's a $2000 trade. I'm guessing somewhere around $120 profit or $1880 loss. If he does lose it will take him 16 successful trades to make up the loss.", "score": 13, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "The virgin actually using spreads for appropriate position sizing versus the Chad using them for MOAR FUCKING LEVERAGE", "score": 1, "replies": []}]}, {"body": "Just depends on position sizing. Many people choose debit spreads to lower the cost compared to a single leg spread. Then because it has a lower cost basis they buy more debit spreads than they would have if they were single leg. So if the spreads bust and go for max loss it can still take a massive chunk of people's portfolios.", "score": 1, "replies": []}, {"body": "sizing", "score": 1, "replies": []}]}, {"body": ">I set a 20% stop loss on each spread. Even on Day 1-4 a 20% stop loss covers a 10% downward movement in TSLA (next week would be $80 drop in share price in a day)\n\nShould have mentioned the stop loss portion!", "score": 2, "replies": [{"body": "Stop loss orders are terrible at what they are designed to do and great at screwing you in whole new ways.\n\nI would find better ways to protect yourself.", "score": 4, "replies": [{"body": "Can you elaborate?! What would you suggest?", "score": 1, "replies": [{"body": "I would size your position at max % of account value you’re willing to lose. If that’s 5%, only buy number of contracts where max loss is 5% of your account.", "score": 3, "replies": []}, {"body": "Getting out of a single option position can be a challenge, getting out of two at the same time can be prohibitively expensive. Algorithm can't pull the trigger and now you're hosed", "score": 3, "replies": []}, {"body": "I was hoping to inspire you to do some self based research.", "score": -1, "replies": [{"body": "haha ok. Care to throw a little bone?", "score": 3, "replies": []}]}]}]}]}]}, {"body": "You can sell the OTM put credit spread at the same strikes to replicate this P/L diagram.\n\nAdvantage of selling the OTM PCS vs. the ITM CDS is that the liquidity on OTM options is better than ITM ones. Otherwise you can pick the one with the more advantageous put/call skew (calls are in this case slightly better).\n\nPCS on 15Oct: STO 700$ put for 5.9$ credit, BTO 680$ put for 4.425$; max profit of 147.5$ with TSLA > 700$. Average bid-ask is 0.125$ \n\nCDS on 15Oct: BTO 680$ call for 117.675$ debit, STO 700$ call for 99.175$; max profit of 150$ with TSLA >700$. Average bid-ask is 0.55$.", "score": 19, "replies": [{"body": "Great insight! thank you.", "score": 2, "replies": []}, {"body": "Plus you'd have theta working in your favor instead of against you", "score": 3, "replies": [{"body": "Nope! Both of the positions described above generate the exact same profit/loss vs. time and share price. The only thing that differentiates them is the put/call skew and options liquidity.\n\nBoth legs ITM: put/call debit spreads benefit from theta decay.\n\nBoth legs OTM: put/call credit spreads benefit from theta decay.\n\nGetting a credit to open a trade does not mean that theta is on your side!", "score": 15, "replies": [{"body": "This guy spreads", "score": 7, "replies": []}, {"body": "Silly me. Thanks for the correction", "score": 2, "replies": []}]}]}]}, {"body": "what software is that?", "score": 6, "replies": [{"body": "[www.optionstrat.com](https://www.optionstrat.com)", "score": 8, "replies": [{"body": "Wow! My first Award! Thank you!", "score": -1, "replies": [{"body": "happy to, appreciated your post on strategy and link to this great software!", "score": 3, "replies": []}]}]}]}, {"body": "Have you ever considered doing ITM Bull Put Spreads instead? Why do you prefer call debit spreads?\n\nDo you start your trade every Monday or do you roll it forward every Friday?\n\nWhat percentage of your portfolio are you risking on a single trade?\n\nWhat's your backup plan if TSLA moves against your position?", "score": 4, "replies": [{"body": "This is just for fun and not a part of my retirement account. After a few weeks of doing this I am able to pull enough to pay my mortgage which is pretty fun haha.\n\nSo far-I start the trade on Monday morning and let expire Friday.\n\nI set a 20% stop loss on each spread. Even on Day 1-4 a 20% stop loss covers a 10% downward movement in TSLA (next week would be $80 drop in share price in a day)", "score": 4, "replies": [{"body": "I’ve been doing similarly well with TSLA weekly iron condors. My wings are very wide (this week 910/920 and 610/600) but still making a decent amount of premium. I’ve been closing around $500 profit and this strategy has been paying my mortgage payments as well.", "score": 7, "replies": [{"body": "Cheers to the mortgage/funny money!   How far out are you purchasing your condors?", "score": 2, "replies": [{"body": "The way it has been working recently, I’ve been closing the current ones around Wed/Thurs once I reach my profit target and then I open the next weeks right after.", "score": 2, "replies": [{"body": "What’s the profit target, a percentage? 80?", "score": 1, "replies": []}]}]}, {"body": "How many contracts do you do? And the credit is pretty bad? It like $38 for a $1000 risk.", "score": 2, "replies": []}, {"body": "you're selling otm weeklies ?", "score": 1, "replies": []}, {"body": "How are you managing those Condors? 2-3X (credit received) stop loss on the whole thing?", "score": 1, "replies": []}]}]}, {"body": "What would be the benefit? I am seeing roughly the same returns as the call debit spread given the breakeven being -11% of TSLA share price?", "score": 2, "replies": [{"body": "In theory, buying Calls would be more profitable when volatility is low, and selling Puts would be more profitable when volatility is high. I guess you could use both, alternating between them depending on the IV percentile when you start the trade, over 50 would benefit puts and lower than 50 would benefit calls. But the difference is probably is very small.", "score": 3, "replies": [{"body": "Interesting! Thank you!", "score": 2, "replies": []}]}]}]}, {"body": "Imma try this on SPX. I’ve been doing 1-0DTE condors and getting some hot premium. I also like that I can let the contracts expire either in or out of the money and it just settles for cash. \n\nHow do you close out this trade? Just wait until exp. day or?", "score": 3, "replies": []}, {"body": "It will need to work 12 times for it to fail once and wipe out all your gains, if you think it’s gonna work more times in a row than that, keep doing it, I don’t think it’s horrible, just know what you’re in for", "score": 3, "replies": []}, {"body": "This is what I have been doing since May and it is a very reliable trade. I've further reduced my risk by laddering my spreads and pushing out the expiration. so I'll open them 4 weeks out and opening a new set every monday. this way I have 4 expirations rolling with one expiring each friday.\n\nI can't decide if I prefer $10 widths with a GTC close order at 9.8/share net or $20 width a 19.5/share net.\n\nFinally, I've been using a position size of an even $1000 (or $2000 for your example) and the difference between $1000 and my opening debit I hold onto for buying additional spreads on big red days. So far this has been very successful for me.", "score": 5, "replies": []}, {"body": "I’d do weekly put credit spreads", "score": 2, "replies": []}, {"body": "Can someone explain how this works to me?  I'm familiar with bull put spreads, and I've done those before, but for whatever reason, I can't wrap my head around the max loss and profit here.  I assume the goal that TSLA stays above the 700 strike point by expiration, but I'm not clear on the max profit and max loss.", "score": 2, "replies": [{"body": "The max loss is the premium payed to open the spread. In the picture he pays a debit of 1855$. The max value of the spread at expiration is 2000$. So his max loss is the premium paid (1845) and max profit is difference between the max value of spread (2000) and premium paid. So max profit is 155$.", "score": 2, "replies": [{"body": "Ah, that makes sense. It really does seem similar to a bull put spread, but you just pay the potential loss upfront. Thanks for clearing that up.", "score": 2, "replies": [{"body": "Exactly !! It's the exact same risk/reward profile", "score": 2, "replies": []}]}]}, {"body": "your max profit is defined by the width of the spread, the max loss is what you pay (debit) for the spread", "score": 1, "replies": []}]}, {"body": "Why not sell a deep OTM put spread (aka credit spread, bull pit spread) and just roll down and out if the price gets to close to short put?\n\nI was looking at one for next week with the short put at 30 Delta. It was paying me $90 for a max loss of $500.", "score": 2, "replies": []}, {"body": "The driver of the steamroller wont be able to see you down there.", "score": 2, "replies": []}, {"body": "Hi ,\nI congratulate with the profit you are making,  I can't endorse or prevent you from doing the trade but I have a suggestion to improve it. Your call spread strategy is equal to selling put spread. For example,  you sell 700strike put and buy lower strike. At current prices selling put spread is better as it has lower slippagr and you can sell it easier if you want.", "score": 2, "replies": []}, {"body": "Wrong sub? This is a debit spread right", "score": 1, "replies": []}, {"body": "works until it doesn't", "score": 0, "replies": [{"body": "bad bot", "score": 2, "replies": [{"body": "Are you sure about that? Because I am 100.0% sure that itsPebbs is not a bot.\n\n---\n\n^(I am a neural network being trained to detect spammers | Summon me with !isbot <username> |) ^(/r/spambotdetector |) [^(Optout)](https://www.reddit.com/message/compose?to=whynotcollegeboard&subject=!optout&message=!optout) ^(|) [^(Original Github)](https://github.com/SM-Wistful/BotDetection-Algorithm)", "score": 2, "replies": [{"body": ">bad bot", "score": 2, "replies": []}, {"body": "Yes", "score": 1, "replies": []}]}]}, {"body": "Doesn't work until it does", "score": 1, "replies": []}]}, {"body": "tesla about to break $805 resistance as it runs into earnings in 2 weeks. back to $900", "score": 0, "replies": [{"body": "Lol", "score": 0, "replies": [{"body": "and i was right.", "score": 1, "replies": [{"body": "So far. 900 tho? Nah. Dump after earnings.", "score": 1, "replies": [{"body": "it peaked 1240 before coming back down to 1000.", "score": 1, "replies": []}]}]}]}]}, {"body": "Tesla's way overvalued the cause you're buying are essentially worthless even if they're way in the money\n\nuse a good stock like Visa or something", "score": -3, "replies": [{"body": "indeed I could! Looking into it- Visa has had quite a few swings of 10% downturns per week in the last year.", "score": 1, "replies": [{"body": "dont buy calls with such short expiration", "score": 3, "replies": []}]}, {"body": "This comment has aged horribly in just 3 weeks", "score": 1, "replies": []}]}, {"body": "very interesting strategy, I learn something new today!", "score": 1, "replies": []}, {"body": "Looks good. I prefer ITM spreads that could realistically become OTM. The reason being that the spread loses money very fast when one of the legs moves out of the money.", "score": 1, "replies": []}, {"body": "Like others have said this is basically a picking up pennies in front of a steamroller strategy, that being said you just have to know when the steamroller is coming so you can get out of the road and then know when it’s gone by so you can get back in the road. So I would use some kind of indicator or combination of indicators that could help tell you when Tesla is due for a reversal or losing momentum.", "score": 1, "replies": []}, {"body": "Can you explain why do you prefer the call debit spread over a put credit spread?", "score": 1, "replies": []}, {"body": "why not just sell the equivalent put spread?", "score": 1, "replies": []}, {"body": "I’m interested in this strategy. So you’re risking $1850 to make $150 per contract it seems with a %98 probability of success. Seems good to do a few here and there but definitely wouldn’t go all in on this type of trade.", "score": 1, "replies": []}, {"body": "You inspired me I opened the same trade right before close but the put credit spread version (basically the exact same risk-reward profile)", "score": 1, "replies": []}]}
{"title": "Pfizer asks FDA to authorize Covid vaccine for kids ages 5 to 11", "selftext": "", "id": "q3d1kp", "created_utc": 1633624754.0, "score": 0, "upvote_ratio": 0.41, "num_comments": 99, "comments": [{"body": "The FDA is crooked AF", "score": 49, "replies": []}, {"body": "Inject it into the fetus of pregnant women…actually, inject it into our nuts so we can get one step ahead of it!", "score": 40, "replies": []}, {"body": "Project Veritas 👍🏾", "score": 30, "replies": [{"body": "Indeed. Pfuck Pfizer, right into the ground. \n\nThe 0-19 year old age group has a 99.997% survival rate, so obviously it's critical that they be subjected to an experimental gene therapy with completely unknown longterm side effects ASAP.", "score": 14, "replies": [{"body": "Gene therapy??? Lol you are a true retard. These vaccines are not gene therapy", "score": 0, "replies": [{"body": "These vaccines aren’t vaccines. They are suppressants. Be honest", "score": 0, "replies": [{"body": "Wow this sub has really gone downhill", "score": 2, "replies": []}]}]}, {"body": "You seem really intelligent. Maybe take off your Tin foil hat and speak with a doctor.", "score": -5, "replies": [{"body": "How does stating the exact survival rate of that age group put a tinfoil hat on my head?\n\nIt's hard data, it's truth, there's nothing conspiratorial about it.", "score": 3, "replies": [{"body": "Listen up dumbass. did you ever think that there are a lot of 0-19 people and that maybe if you just allow the virus to spread uncontrollably in that group it will never go away? Vaccinating young people is part of ending the pandemic. Retard", "score": -3, "replies": [{"body": "That's absurd. We know now that the vaccine doesn't stop infection or transmission, so vaccinating kids won't stop them from getting it or spreading it. \n\nThe disease itself has a close to 0% chance of killing under 19's, so the waning benefits in avoiding a severe case provided by the vaccine are pointless. \n\nStudy after study is now finding that natural immunity is \\*far\\* superior to and longer lasting than vaccine effects. \n\nThe absolute best thing we could possibly do in the case of kids is \\*nothing\\*. The more of them that get it, and acquire strong, lasting natural immunity (at little to no risk to the kids themselves), the better for everyone.", "score": 5, "replies": []}]}]}, {"body": "You seems like one of those who thought the crowd was chanting “Let’s go Brandon” 🤣🤣🖕🏾🖕🏾", "score": 3, "replies": []}]}]}]}, {"body": "You know what else is FDA approved? Botox", "score": 20, "replies": [{"body": "and chantix\n\nWhat’s that? Pfizer issued a voluntary recall? Say it ain’t so, Pfizer! Say it ain’t so!!\n\nhttps://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/pfizer-expands-voluntary-nationwide-recall-include-all-lots-chantixr-varenicline-tablets-due-n", "score": 12, "replies": []}, {"body": "Don’t forget fentanyl is FDA approved", "score": 11, "replies": [{"body": "Fentanyl has plenty of medical uses.", "score": 8, "replies": []}, {"body": "Lol so what? If you had an idea how much fentanyl is used in medicine it would make sense", "score": 2, "replies": []}]}, {"body": "what does that information have to do with this or anything?", "score": 2, "replies": [{"body": "I see you’re not very good at putting two and two together", "score": 3, "replies": [{"body": "Are you implying that Botox shouldnt be FDA approved? why? id love to hear your reasoning", "score": 1, "replies": [{"body": "What’s it like being this dense?  Does someone tie your shoes for you?", "score": 2, "replies": [{"body": "Explain to me the grand point that im missing. Botox=bad therefore fda=bad therefore pfizer vaccine=bad? This sub is full of goddamn morons", "score": 7, "replies": [{"body": "It sure is, and I’m responding to one of them.", "score": -8, "replies": [{"body": "Can’t answer his question?", "score": 4, "replies": [{"body": "I can, but you’re not even the same guy 😂. There are several of you too stupid to follow a simple premise?  He was right about the thread being full of morons.", "score": 1, "replies": [{"body": "Try being more succinct. That’s a lot of words for “I’m retarded. I actually don’t know”", "score": -1, "replies": [{"body": "Based on your illiteracy, I sure hope you don't actually have a self-managed portfolio.    Essentially, you're too stupid to follow a premise without desperately screeching for someone to hold your hand through it... and someone else is retarded?  \n\nGod bless whoever helps you brush your underbite.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Thoughts on fentanyl?", "score": 2, "replies": [{"body": "It is used all the time. If you broke your arm you’d probably get it in the ambulance and in the OR. The only reason fentanyl has a negative connotation is because drug dealers lace shit with it irresponsibly.", "score": 4, "replies": []}, {"body": "What about it? its had FDA approval for 25 years and is approved for use under very limited conditions.", "score": 3, "replies": []}]}]}, {"body": "Isn't that twenty-two", "score": 1, "replies": []}]}]}]}, {"body": "Reading the comments on the post just dropped my IQ drastically.", "score": 9, "replies": []}, {"body": "They need to stop. Rona ain’t gonna leave anytime and they haven’t had enough time for long term trials", "score": 19, "replies": [{"body": "More Americans have died from Rona in 2021 than 2020 now. We’ve been vaxxing since November/December last year\n\nhttps://www.forbes.com/sites/marisadellatto/2021/10/06/us-covid-19-deaths-for-2021-surpass-toll-from-2020/?sh=6b88c4a76cc2", "score": 1, "replies": [{"body": "Which proves the vaccine doesn’t work and may make things worse", "score": 4, "replies": [{"body": "inb4 “it’s the unvaxxed dying”\n\nYou are considered unvaxxed until 14 days after the second shot or until 14 days after J&J\n\nSo if someone dies in that window, they’re considered unvaxxed", "score": 8, "replies": [{"body": "It is primarily the unvaxxed dying.\n\nYep, more people died in 2021 than in 2020.  Many of those people died before the vaccine was rolled out en masse.  And the one's currently dying are predominantly unvaxxed.  Right now the number of people in that window is very small as vaccinations are going at a snail's pace currently. \n\nNo, we haven't been vaccinating since November. That's a complete lie. [The first vaccine outside of trials was given on Dev 15th](https://www.washingtonpost.com/nation/2020/12/14/first-covid-vaccines-new-york/)  So where did you get November from?  If you want to claim you were talking about trials those started long before November so that's also not true.\n\nAnd even when we started rolling out the vaccine, it was slow to begin with.  There was good 200k deaths between Jan 1 and Mar 31st and the vaccine was incredibly hard to get well past that March 31st date.", "score": 4, "replies": [{"body": "Are you counting the 15,000+ people already killed by the vaccine itself (and that's according to VAERS, which typically accounts for at best 10% of actual events), and accounting for the fact mentioned above that for 14 days after the second shot deaths and cases are still counted as UNvaccinated? \n\nPublic health agencies have now openly stated that the experimental gene therapies don't prevent infection or transmission. 76% of covid deaths have been people over 65. A grand total of 478 kids under 17 have died this entire time. \n\nThere is NO excuse for vaccinating children with something we won't know the longterm effects of for years, to 'protect' them from a disease they have a 99.997% chance of surviving (if they're under 19 years old). \n\nWell, there's one excuse: Profit.", "score": -1, "replies": [{"body": "> Are you counting the 15,000+ people already killed by the vaccine itself\n\nYou mean 15k people died within X time frame of getting the vaccine, which ya know isn't that much because people die quite frequently.  VAERS isn't a death certificate.\n\n>accounting for the fact mentioned above that for 14 days after the second shot deaths and cases are still counted as UNvaccinated?\n\nYep, already discussed:\n\n>Right now the number of people in that window is very small as vaccinations are going at a snail's pace currently.\n\n> don't prevent infection or transmission.\n\nName a vaccine with 100% efficacy.  Your claim is nowhere near as strong as you think it is.\n\n>something we won't know the longterm effects of for years\n\nYou're talking about COVID, the disease, here right?  Oh, no, just something that is far far safer than actually contracting the disease.  Got it.", "score": 2, "replies": [{"body": "No, I'm referring to the 15,937 people the vaccine has outright killed, directly (through 10-1).  \n\nHow about the 71,036 hospitalizations from vaccine side effects?\n\nOr the 22,342 permanent disabilities? \n\nAnd again, this is from VAERS, which has been shown historically to account for only a fraction of actual events. \n\nAnd we now know, thanks to the recent HHS whistleblower that came forward on Veritas, that hospital staff are knowingly failing in their duty to report adverse events and vaccine deaths. \n\nAn no, I'm not talking about covid re: longterm effects. I'm talking about the experimental gene therapy that governments, schools, and business are MANDATING people inject themselves with. \n\nThere is no way we know what they'll do to people in 5 years. The  multi-year testing phases typically required were tossed aside. \n\nAll over a disease with a survival rate well over 99% for just about every demographic. \n\nAt lease Pfizer has made 15 billion on it so far though.", "score": -2, "replies": [{"body": "> No, I'm referring to the 15,937 people the vaccine has outright killed, directly\n\nVAERS has no ability to tell you that:\n\n>VAERS is not designed to determine if a vaccine caused a health problem\n\n>When evaluating data from VAERS, it is important to note that for any reported event, no cause-and-effect relationship has been established. \n\nSo like I was saying, 15k deaths within close proximity to vaccination.  Done being willfully ignorant?\n\n>that came forward on Veritas\n\nA far right group being anti-vax?  Wow.  Not holding my breath on the credibility of the whistle-blower.\n\n> All over a disease with a survival rate well over 99% for just about every demographic.\n\nDeath is the only negative of disease?  Because earlier you were whining about long term side effects but now you're completely ignoring them when talking about the disease?\n\nCould you like at least come up with a consistent standard here?  If you only care about confirmed deaths due to the disease than let's only care about confirmed deaths due to the vaccine.\n\nIf you want to talk about long term side effects (that won't happen because long term side effects don't come out of the blue) of the vaccine then we have to talk about long term side effects of the disease.", "score": 1, "replies": []}]}]}]}]}, {"body": "And how many people are dieing in they window?", "score": 1, "replies": [{"body": "not reported or tracked so there’s no way to know", "score": 7, "replies": []}]}, {"body": "Ok but it’s the unvaxxed who are dying\n\nNobody is laying in the hospital whining how they got the vaccine, whys it not working\n\nIt’s you buncha jabronis saying you wished you got it", "score": -5, "replies": [{"body": "This is comoletely false. While the vax does offer some protection it isnt like other vaccines and is no miracle protection. In some areas hospitalizations are as much as 70-80% vaccinated people (in areas with high vaccination rates) and I believe the average is like 47% or some such. Plenty of vaccinated people are getting very sick from the Rona and even dying. It just improves your odds is all.", "score": 1, "replies": [{"body": "Got a source? Haven’t seen vaccinated people being admitted to hospitals for coronavirus", "score": 1, "replies": [{"body": "Fair question, I'd have to google it though and I'm lazy and not overly concerned with convincing anyone of anything. And I do think most should get it.", "score": 0, "replies": [{"body": "That’s a strong waffle after saying my comment was “completely false”\n\nI did some googling and the hospitalization rate of unvaxxed vs vaxxed is like at least 20 times higher and the deaths are 10-20times higher.\n\nSo people are still dying with the vaccine but at much lower rates", "score": 2, "replies": [{"body": "You're more correct than I was for sure. I did find a few articles about hospitalization rates of 60% or so being vaxxed, in Israel and a couple other small countries. Even so the explanations for it were pretty convincing. I stand corrected.", "score": 3, "replies": [{"body": "Thanks for being fair and reasonable, I feel like we don't see much harder of that anymore", "score": 1, "replies": []}]}]}]}]}]}, {"body": "https://www.fox19.com/2021/10/06/mother-2-dies-blood-clots-after-getting-covid-19-vaccine/", "score": 0, "replies": [{"body": "\"only 3 other cases have been confirmed nationally\"\n\nMeanwhile, over 700k dead in the US alone from COVID\n\nI don't think your exceptions really defeat the fact that the COVID vaccines prevent the most dire impacts of the virus", "score": 2, "replies": []}]}, {"body": "I did get it", "score": 1, "replies": []}]}]}]}]}]}, {"body": "These comments make me feel sane. Living in CA where the vaccine is mandated to go indoors now in LA for all 12 and up and everyone seems ok with that.", "score": 16, "replies": [{"body": "Best thing to do is just don’t go to businesses that ask. They can’t enforce them all. Or move lol", "score": 6, "replies": [{"body": "Ontario canada. you’ll get your liqour license revoked and bussiness will get slammed with fines if you allow an unvaxxed to dine at a restaurant. its fine if the server is unvaxxed and has covid, or if vaxxed patrons have covid. its just dangerous to have unvaxxed people with out covid.", "score": 7, "replies": []}, {"body": "They all do in LA County or they receive a $1k fine with the new law.", "score": 3, "replies": [{"body": "As of right now I’m not sure havent been asked thankfully. Stay up out there", "score": 2, "replies": []}]}]}, {"body": "Sad reality for most of the USA", "score": 6, "replies": []}, {"body": "I don't live there, but have joined a number of school board/committee meetings in districts around LA recently, where vaccine mandates were being voted on. Not to participate, just to get a feel for the general consensus or parents/staff/citizens. \n\nFor what it's worth, the vast majority of public comment from locals is firmly \\*against\\*, but the boards inevitably just vote to approve regardless. \n\nSo there seems to be a lot of kickback at least in that arena, but it's being ignored.", "score": 2, "replies": []}, {"body": "You live in the most overpriced and superficial state and you think you’re sane! HA! Thanks for the laugh!", "score": 1, "replies": [{"body": "Yeah, not from here and not staying here by choice but work is here :/ Gotta make enough money in options to leave.", "score": 7, "replies": [{"body": "That was very contradictory to your initial comment", "score": -1, "replies": [{"body": "You must sniff glue, or ate lead paint chips as a kid. Because oh fuck you're dumb.", "score": 3, "replies": []}, {"body": "No it isn’t. Dumbass.", "score": 1, "replies": []}]}]}]}, {"body": "id like to see anyone try to kick me out lol. and considering the lapds stance on the vaccine i doubt theyll even bother responding to any calls.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -5, "replies": []}, {"body": "That doesn't go live till Nov. 4 of this year so in a month", "score": 1, "replies": []}]}, {"body": "Gotta get the kids jabbed!  499 kids have already died of COVID since 1/2020.  With all the propaganda, you would think the CDC would make the number higher.  $$", "score": 7, "replies": []}, {"body": "This comment section just verified how dumb the users of this sub are holy shit", "score": 15, "replies": [{"body": "I thought the sub being retarded part was a joke, guess not lmao definitely full of crayon eaters", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "Bruh right", "score": 0, "replies": []}, {"body": "Stay off our roads and stop cheering for our team.", "score": 1, "replies": []}]}, {"body": "More American children have been shot in Chicago than died of the rona this year… Pfizer is greedily chasing more government purchasing their product for even more profit….", "score": 2, "replies": []}, {"body": "Considering that the gene therapies are now proven to \\*not\\* prevent infection or transmission, and that the 0-19 year old age group has a 99.9997% survival rate, it makes perfect sense that Pfizer would want to pump their product into kids. \n\nThey'll probably get away with it too, so this is likely bullish news. \n\nPfuck Pfizer though.", "score": 6, "replies": []}, {"body": "Vax is bullshit.   20% efficacy after 5 months.  Lmao. \n\nIt’s worse then the flu shot", "score": 6, "replies": []}, {"body": "Never ever I’ll put this in my child", "score": 5, "replies": []}, {"body": "These criminals...\n\nThey are lucky we are not living in France of 18th century. \nThey would lose their head over their greed...", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|46|**First Seen In WSB**|8 months ago\n**Total Comments**|747|**Previous DD**|\n**Account Age**|8 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=q3d1kp)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=q3d1kp)", "score": 1, "replies": []}, {"body": "Check out GKOS and thank me later. ![img](emote|t5_2th52|4270)", "score": 1, "replies": []}, {"body": "Why do they need emergency use auth for 5 year old children? Seems more about the $$ than real health science as 5 year olds aren’t dropping dead in large numbers from covid.", "score": 1, "replies": []}, {"body": "They will approve it as long as they are making money from it", "score": 1, "replies": []}]}
