{"title": "[deleted by user]", "selftext": "[removed]", "id": "wq2ut2", "created_utc": 1660677234.0, "score": 57, "upvote_ratio": 0.82, "num_comments": 78, "comments": [{"body": "If you already sold and recognized 10k in losses, then you don’t pay GAIN taxes.  3k can be used to deduct from your income - the rest 7k carry over to future years.\n\nEdit:  this scenario only applies if your net loss at the end of the year is -10k.\n\n\nAlso it’s a bit early in the year to consider tax loss harvesting?", "score": 85, "replies": [{"body": "It's always a good time to be strategizing for tax loss harvesting.  If I have short term gains, I prefer to sell some of my short term losses before they change into long term losses - otherwise I'll need to pay the government more.\nBesides, OP is probably better off selling AMZN then immediately buying AAPL. Wait 30+ days until the wash sale rule passes, then sell some AAPL, buy back AMZN.  \nIf a stock drops 20% then it needs to gain 25% in order to just break even, and OP could be underwater for years with dead money. Heh. I have 10 shares of Ford that are still underwater that I bought as a teenager - I keep them as a reminder.  \n*Edit* I periodically review my TDA account for short term losses. The Gain/Loss tab has a column that says \"Long\" or \"Short.\"  Why let my short term losses convert into long term losses?  If I have short term gains, I want to offset those with short term losses. Not doing so wastes the opportunity to capture the maximum tax benefit from a short term loss.", "score": 8, "replies": [{"body": "Can you explain why long term losses are worse than short term losses? Is it only for this specific scenario that you have short term gains, and short term losses can cancel it out but long term losses will only cancel out long term gains, but normally a long term loss is better for us than short term loss? Thanks.", "score": 2, "replies": [{"body": "A longer-term loss indicates you've held the loss for over a year. True, you could've held the stock for a year and it was a gain, then it plummets.  \nThe overall point was: if you have short-term gains, those are taxed at a higher rate, so just off-set with short term losses (if you have them.)  \nBrokerages are now required to split out short term gains and short term losses. In general, it is best to get your gains to be as little as possible, otherwise you're going to need to write a check to the government. If you can push that check back for 1 more year, then you essentially have a higher net worth for 1 more year and more money to invest.", "score": 2, "replies": []}]}]}, {"body": "Ahhh ... That's not true.  If you have $10k in losses and $10k in short-term gains in the same year they cancel our and there would be zero tax liability.", "score": 3, "replies": [{"body": "I felt it was obvious my post was explaining why he didn’t need to sell.   Yes, capital gains tax applies to your NET gain/less at the end of the year. I edited for clarification.", "score": 9, "replies": []}, {"body": "OP wasn't clear on whether his losses were long term or short term.  Short term losses can offset short term gains or ordinary income, assuming OP has a job.  But long term capital losses come with the $3,000 limitation for offset against current year income.  The other $7K would carry forward indefinitely.", "score": 2, "replies": [{"body": "Hmmm ... I would think a loss is a loss.  Your comment has triggered me to understand more.  I'll be speaking with Dr Google today.", "score": 2, "replies": [{"body": "Otherwise people would simply hang on to losing capital assets indefinitely to offset ordinary income.  Dry oil wells used to be a popular tax dodge.", "score": 1, "replies": []}, {"body": "What JMLobo83 said:\nOP wasn't clear on whether his losses were long term or short term. Short term losses can offset short term gains or ordinary income, assuming OP has a job. But long term capital losses come with the $3,000 limitation for offset against current year income. The other $7K would carry forward indefinitely.\n\n----\n\nWhat he said is dead wrong.  If you have 100k long-term capital gain and 100k short-term capital loss then your tax liability is zero.\n\nShort term capital loss also has a 3k limit against ordinary (W2) income.", "score": 1, "replies": []}]}, {"body": "This article seems to say different.  Would like your thoughts.\n\n\"According to the tax code, short- and long-term losses must be used first to offset gains of the same type. But if your losses of one type exceed your gains of the same type, then you can apply the excess to the other type. For example, if you were to sell a long-term investment at a $15,000 loss but had only $5,000 in long-term gains for the year, you could apply the remaining $10,000 excess to any short-term gains.\"\n\n\n\nhttps://www.fidelity.com/viewpoints/personal-finance/tax-loss-harvesting", "score": 1, "replies": [{"body": "Google IRS capital loss deduction limits.  The correct answer pops up.\n\nAgain, we need to distinguish between long term and short term loss.  Long term loss deduction (for assets held longer than one year) is limited to capital gains recognized plus $3,000 deduction against ordinary income.  Ordinary income can be income from employment, rents, short term capital gains, etc.\n\nShort term capital loss (i.e. losses realized and recognized on assets held less than a year) can be deducted against ordinary income without limitation, other than the amount of ordinary income.\n\nFor example, I've foolishly bagheld TDOC for more than a year.  If I come to my senses and sell now, I will book greater than $3,000 loss for tax purposes.  Since I can only deduct $3,000 against ordinary income (my job), I can either sell some MSFT which I've also held for more than a year to zero out the capital loss deduction, or I can carry forward the TDOC capital loss to next year.", "score": 1, "replies": []}, {"body": "See also IRS publication Topic No. 409, Capital Gains and Losses", "score": 1, "replies": []}]}]}]}, {"body": "> the rest 7k carry over to future years.\n\nDoes that only applied to earned income or can it be carry over for next yr realized capital gain too?", "score": 1, "replies": [{"body": "Also,  do the losses automatically get carried over? Or is that optional when doing taxes, and if I didn't specify it last year, did it not carry over?", "score": 1, "replies": []}]}]}, {"body": "You can also rollover your losses to next year.", "score": 11, "replies": []}, {"body": "Sell stock, book $10k gains, rebuy stock, pay no taxes", "score": 27, "replies": [{"body": "Wouldn’t this get you no actual gains but also cost you a tax deduction?", "score": 13, "replies": [{"body": "Yes. It would eliminate taxes on $10k of future capital gains, however. Personally, I wouldn't sell as I'd rather have the income tax deduction from the losses, even if spread over multiple years, than the capital gains tax reduction. But the OP's scenario was what to do if he sold.", "score": 5, "replies": [{"body": "Selling would be not smart", "score": 1, "replies": []}]}]}, {"body": "Be mindful of the wash sale rule", "score": 15, "replies": [{"body": "Wash sale only applies when you sell for a loss and then re-buy within 30 days. No problem in selling for a profit and then buying it again the next trading session.", "score": 19, "replies": [{"body": "Selling gains is never a wash sales.", "score": 0, "replies": []}]}]}, {"body": "That rule is crazy lol", "score": -5, "replies": [{"body": "What rule?", "score": 1, "replies": []}, {"body": "I mean the rule makes sense", "score": 1, "replies": []}]}]}, {"body": "Do you want to exit those positions? What is your motivation to realize gains now? \n\nWhat’s the motivation to pull $X out, only to reinvest $X in the same stock?", "score": 5, "replies": [{"body": "I think he's thinking, \n\nBe has losses now,  why not cash out the gains and use the gains against the losses so he won't have to pay tax on the gains later. \n\nBut you can just roll your losses every year so this really isn't needed", "score": 1, "replies": []}]}, {"body": "Can't you sell and then re-buy again? The only thing you'd be losing is a fraction of the cost, but you'd be rid of your tax liability.", "score": 7, "replies": [{"body": "The topic creater would have to wait 31 days.  A lot can happen in 31 days and thats a big risk that he/she is gonna have to rebuy higher then sold.", "score": -10, "replies": [{"body": "He’s selling gains, so he doesn’t have to wait 31 days for the wash rule.", "score": 19, "replies": []}]}]}, {"body": "Hold", "score": 4, "replies": []}, {"body": "You can roll loses over to next year and I’m no expert but I thought only 3k were deductible a year anyway?", "score": 3, "replies": [{"body": "3k loss. 10k gain - 10k loss = $0 as outcome.", "score": 1, "replies": []}]}, {"body": "Take the tax lose at 3K for the next 3 years. Don’t sell your gains to finish even.", "score": 3, "replies": []}, {"body": "You are being poorly advised, and I would be very careful who you take advice from with the IRS ramping up big time.", "score": 7, "replies": []}, {"body": "sad pika face, i had to sell bunch at losses this year to pay gains for last year tax... overall suck.  good idea asking for advice.", "score": 2, "replies": []}, {"body": "Your family member gives bad advice.  You can carry your losses indefinitely and deduct 3k per year.  Generally, you want to avoid taxable events, and realize as few gains as you possibly can.", "score": 2, "replies": []}, {"body": "You really think selling your biggest winners is the best idea?", "score": 2, "replies": []}, {"body": "You can’t sell winners that won’t last to break even \n\nOr\n\nYou can hold winners expecting them to run more and carry over $7k in losses to the future while claiming the max or $3k this year \n\nOnly you know which is better, but don’t forget Sept is a Bitch & Biden lied about the economy last week when he said it’s awesome", "score": 1, "replies": []}, {"body": "Tax harvest/adjust in December, not in August when the markets are still down 10%", "score": 1, "replies": [{"body": "good point", "score": 2, "replies": [{"body": "It's not a good point. $10,000 in gains now are no different than $10,000 gains in December (assuming the gains are both long term or short term)", "score": 2, "replies": [{"body": "It’s worse than that. If you sell now and rebuy your taxes are zero, and you start accumulating gains in August instead of December. So when you cash out in October 2023 it will be long term gains at 15% instead of normal income tax rate. \nOnce you go under 3k of losses it always makes sense to sell for short term gains and rebuy.", "score": 3, "replies": []}, {"body": "Unless they are 20k in gains", "score": 1, "replies": [{"body": "Your comment makes no sense. If I sell enough stock in one or more companies to net $10,000 now or some other combination of stock later in the year to net $10,000 gain it's the same amount of money gained either way.", "score": 1, "replies": [{"body": "If you have 20k worth of tesla and sell 10k now, you now have 10k tesla. If tesla doubles by year end u now have 20k....instead of 40k. You missed out", "score": 1, "replies": [{"body": "There is no missing out. None. You sell enough stock to net $10k gains and then promptly rebuy it. Count the gain against your losses and pay no taxes.", "score": 3, "replies": [{"body": "Capital losses carry over in full if used against capital gains - no 3k limit. So it doesn’t matter. What can play a role is the holding period, but without any portfolio left to make short term call gains to make the most of the 10k losses…pretty much all strategies OP does, including nothing, are equivalent", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Why not just sell or hedge with covered calls? If you have the shares and want to keep them, then just sells calls. The other thing you should realize is that being breakeven and freeing up cash is never ever a bad thing. In that case, start selling puts. Basically wheel the stocks", "score": 0, "replies": []}, {"body": "Sell stocks, buy etf", "score": 0, "replies": []}, {"body": "You don’t sell for tax purposes. Only if you want to sell, wait 31 days and repurchase the stock you sold. Here are the rules for offsetting losses. It’s called the wash sale rules. Take a quick look at this in Google. \n\nNet all long term gains and losses. \nNet all short term gains and losses. \nIf one is a gain and the other is a loss, net again\n\nIf they are the same, (Both gains or both are losses) the retain their own character.", "score": -2, "replies": []}, {"body": "What about the reverse situation, you want to sell but have 100k in gains? You sell and now have a cap gains issue..", "score": 1, "replies": [{"body": "Then the gov't is gonna be getting a nice, fat check on tax day..", "score": 3, "replies": [{"body": "May sell other stock at loss to offset the gain?", "score": 1, "replies": []}]}]}, {"body": "I am down $40k on a stock. So theoretically I can go trade and make $40k in gainz, sell my loser stock which is down $40k, and not pay any taxes? Or is the max you can write off is $3,000? So I would be getting $3000 off my taxes for the next 13 years?", "score": 1, "replies": [{"body": "You can deduct capital losses up to the amount if capital gains.  If your losses exceed the gains you can use up to $3000 to deduct against income.  If you have lost more than the gains + $3k income deduction, the rest if the amount rolls to the following year.  Same ruies.\n\nExample: $50k gain in APPL, $20k loss in AMZN, $100k w-2 income\nDeduct losses from gain $50k -$20k, pay tax on $30k gain.\n\nExample: $50k LOSS in APPL, $20k gain in AMZN, $100k w-2 income\nDeduct $20k from $50k loss (zero tax liability) deduct $3k from regular income.  Next year, deduction Ny losses +$30k rollover (up to the amount of gains) +$3k for regular income.  Keep rolling forward what’s left of the withdrawal until it’s exhausted.", "score": 2, "replies": []}]}, {"body": "Your ordinary marginal interest rate is surely higher than the long term capital gains rate (15%). It would be smarter to deduct the $3k against that for a few years than waste the privileged cap gain rate for nothing.", "score": 1, "replies": []}, {"body": "I would just realize 3k every every year until you get it back.", "score": 1, "replies": [{"body": "what if I just keep losing money next year too then?", "score": 0, "replies": [{"body": "We’ll time in market beats timing the market. So like many have said, pick a good fund like vti or schd and make it 60-70% of your portfolio and never touch it. The rest you can bet on individual long term stuff if you want. \n\nFor me I like SCHD and I’m riding Amazon, Tesla, and Google. Power house companies that are going nowhere but up over time.", "score": 2, "replies": []}]}]}, {"body": "Slowly increase 75$ a paycheck makes a small difference . Many stocks good price .", "score": 1, "replies": []}, {"body": "Hold! Epic rally leading into October here", "score": 1, "replies": []}, {"body": "You are being way too dramatic.  You act like this move is the de facto end of your entire investing career.\n\nBuy it back in one month, just don't do it sooner due to wash sale rule.\n\nOr, park it in index funds for now.", "score": 1, "replies": []}, {"body": "Sell tomorrow, buy $BBBY and use the tax loss to offset your future gain.", "score": 1, "replies": []}, {"body": "That is a terrifying predicament to be in\n\nBest of luck to you either way", "score": 1, "replies": []}, {"body": "Cash is a position", "score": 1, "replies": []}, {"body": "I have $13k loss on crypto, the market will go up again for sure, maybe not tomorrow, maybe not next month but within some months YES. \nDon’t sell, and don’t tell the IRS about you holding stocks lmao.", "score": 1, "replies": []}, {"body": "That seems like bad advise to me.  You can carry losses over, nothing says you have to sell winners that could potentially continue to win just to zero out your losses.    \nMaybe I'm misunderstanding, I did read it fast.  lol.", "score": 1, "replies": []}, {"body": "Let’s just be honest your family member is clueless", "score": 1, "replies": []}, {"body": "I am holding on to my AMZN. I think it is going to be much higher after October earnings.", "score": 1, "replies": []}]}
