{"title": "Fed minutes show more rate hikes coming, but pace could slow", "selftext": " \n\nWASHINGTON (Reuters) - Federal Reserve officials saw \"little evidence\" late last month that U.S. inflation pressures were easing, and steeled themselves to force the economy to slow down as much as needed to control the surge in prices, according to the minutes of their July 26-27 policy meeting.\n\nWhile not explicitly hinting at a particular pace of coming rate increases, beginning with the Sept. 20-21 meeting, the minutes released on Wednesday showed policymakers committed to raising rates as high as necessary to bring inflation under control, and acknowledging that they would have to engineer less spending and lower overall growth for that to happen.\n\nAs of the July meeting, Fed officials noted that while some parts of the economy, notably housing, had begun to slow under the weight of tighter credit conditions, the labor market remained strong and unemployment was at a near-record low.\n\nOn the metric that mattered most, however, Fed officials at least as of late July had registered little progress.\n\n\"Participants agreed that there was little evidence to date that inflation pressures were subsiding,\" the minutes said. Though some inflation reduction might come through improving global supply chains or drops in the prices of fuel and other commodities, some of the heavy lifting would also have to come by imposing higher borrowing costs on households and businesses.\n\n\"Participants emphasized that a slowing in aggregate demand would play an important role in reducing inflation pressures,\" the minutes said.\n\nThe pace of future hikes would depend, the minutes said, on incoming economic data, as well as Fed assessments of how the economy was adapting to the higher rates already approved.\n\nSome participants said they felt rates would have to reach a \"sufficiently restrictive level\" and remain there for \"some time\" in order to control inflation, which is running at a four-decade high.\n\nIn a glimpse of the emerging debate at the central bank, \"many\" participants also noted a risk that the Fed \"could tighten the stance of policy by more than necessary to restore price stability,\" a fact that they said made sensitivity to incoming data all the more important. \\[nL1N2ZS1FQ\\]\n\nAfter the release of the minutes, traders of futures tied to the Fed's policy rate saw a half-percentage-point rate hike as more likely in September, with fed funds futures prices reflecting just a 40% chance of a 75-basis-point increase.\n\nINCOMING DATA\n\nThe Fed has lifted its benchmark overnight interest rate by 225 points this year to a target range of 2.25% to 2.50%. The central bank is widely expected to hike rates next month https://graphics.reuters.com/USA-ECONOMY/FED/lgpdwawwzvo/index.html by either 50 or 75 basis points.\n\nFor the Fed to scale back its rate hikes, inflation reports due to be released before the next meeting would likely need to confirm that the pace of price increases was declining.\n\nData since the Fed's July policy meeting showed annual consumer inflation eased that month to 8.5% from 9.1% in June, a fact that would argue for the smaller 50-basis-point rate increase next month.\n\nBut other data released on Wednesday showed why that remains an open question.\n\nCore U.S. retail sales, which correspond most closely with the consumer spending component of gross domestic product, were stronger than expected in July. That data, along with the shock-value headline that inflation had passed the 10% mark in the United Kingdom, seemed to prompt investors in futures tied to the Fed's target policy interest rate to shift bets in favor of a 75-basis-point rate hike next month.\n\nMeanwhile, a Chicago Fed index of credit, leverage and risk metrics showed continued easing. That poses a dilemma for policymakers who feel that tighter financial conditions are needed to curb inflation.\n\nJob and wage growth in July exceeded expectations, and a recent stock market rally may show an economy still too \"hot\" for the Fed's comfort.\n\n(Reporting by Howard Schneider; Editing by Paul Simao)", "id": "wqy7c5", "created_utc": 1660765601.0, "score": 236, "upvote_ratio": 0.92, "num_comments": 73, "comments": [{"body": "Did anyone expect anything different? It was obvious the Fed was not going to pivot after one month of slowing inflation. We're still at 8.5% annual inflation.", "score": 137, "replies": [{"body": "This sub has been throwing a parade the last couple of weeks that we beat inflation", "score": 9, "replies": [{"body": "We haven't beaten inflation, but we seem to be trending in the right direction. We are still going to see rate hikes, but it is possible the next one may be the last 75bps hike.", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 60, "replies": [{"body": "I think the dot plot doesn't show a pivot until mid 2023. So yeah... people are absolutely delusional.", "score": 21, "replies": [{"body": "They also spent 2021 promising no hikes until 2023 at the earliest.\n\nThey've never felt a particularly strong attachment to previous statements. So I wouldn't bank on much if it's more than a few months ahead.", "score": 8, "replies": [{"body": "Which makes sense, because you'd have to be an idiot to stick to prior indications even when the facts have changed.", "score": 3, "replies": [{"body": "For sure but that works both ways people shouldnt take their guidance as gospel.", "score": 3, "replies": []}]}]}]}, {"body": "I got lambasted when the S&P was at 4700 to suggest it had entered a technical downtrend. Nobody likes to hear their party is over.", "score": 3, "replies": []}, {"body": "Fed can pump rates and still have SPY 5,000.\n\nIt's not mutually exclusive.", "score": 15, "replies": [{"body": "I guess market can be in denial longer than some people think. I think we're looking at a shoulder phase of head&shoulder, but what do I know. I thought it was gonna tank during covid.", "score": 4, "replies": [{"body": "Isn’t healthily digesting rate increases the sign of a strong economy?", "score": 6, "replies": []}, {"body": "curious, which chart and where do you see another head and shoulders at? i can see the head and shoulders that took us down initially but now what would happen if anything would be more a giant double top near all time highs I would think or just a continuation of the original head and shoulders, at least that’s what I can see on any S&P ETF chart SPY / VOO or even just looking at Apple.", "score": 0, "replies": []}, {"body": "I can see a rhino. Is that bearish or bullish?", "score": 1, "replies": []}]}, {"body": "I don't see how it's not mutually exclusive.", "score": 2, "replies": [{"body": "Federal Reserve has been doing that since 1913. \n\nBut... it's your birthday 🎂 party bro🥳", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -7, "replies": [{"body": "The market Crashed 2 years ago. \n\nThis is the 19 month consecutive job growth streak to catch a bid.  Without the extraordinary leverage. \n\nNo idea where all these wild eyed bear ideas come from. \n\nLol.  World War 3? Bro? You need a therapist.", "score": 10, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "Da Bears Da Bears Da Bears!\n\nI'm totally market neutral. Just for the record. \n\nI literally don't give a shit about the price. \n\nWhy would it even matter?", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "No. Investors really shouldn't care about the price of the market.  Low prices are good for investors.  \n\nI probably stopped caring about the prices years before you started caring about the prices.  Don't take that the wrong way.  Not trying to dunk on you.  I have like 150 page tax returns.  Sometimes I make like 10,000 options trades in a quarter.  You can have all your opinions and stuff. That's great. You're learning to express yourself. \n\nI hope you do great buddy. Not gonna lie - hope it works out for ya.", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Buddy i still love ya.  I'm not playing.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "The bulls really come out when they get those sweet hits of dopamine for a few weeks. Personally I am hoping for more lows so I can accumulate. As nice as it has been to see my portfolio up.", "score": 5, "replies": []}, {"body": "No, you made a post about people being overconfident in the market (which no one really seems to be) and most of the top comments are, in fact, pretty reasonable.\n\nWhat about the following top comments suggest that you received \"hate\" based on the idea that you thought the fed wasn't going to pivot: \n\n\"Omg so tired of reading this drivel\"\n\"Imagine trying to time the market\"\n\"It will take a lot to get aapl back to 130\"\n\nNone of the \"hate\" you received was about your position on the fed. The hate you received was because you posted the same thing that gets posted about once a day and it's dressed up as another \"timing the market\" post.", "score": 2, "replies": []}, {"body": "Good thing ppl didnt listen to another bear and cost themselves gains", "score": 1, "replies": []}]}, {"body": "Interest cuts barely worked their way through the system! As I keep saying, it’s crazy that the housing bubble is not front page news every day. At this point, even the rich people around me can’t afford rent at the new asking prices, and the same houses have been sitting since maybe April? It’s hard to say because they take down listings and then re-post them every couple of months so they look new. But it’s almost like nothing is selling. And I’m in a huge area\n\nI feel like I can’t be fully bullish on anything until the housing question is solved. And it’s not a supply issue like the media likes to pretend, the supply shortage is a fake statistic comparing two unrelated things. Whenever they build new houses, they ask ridiculous amounts, so just building more isn’t gonna solve the ridiculously high prices", "score": 5, "replies": [{"body": "Your anecdotal stories isn't evidence, dude. The housing market is alive and well, houses are sold *every hour every day* at higher and higher prices.\n\n\n\n\nNobody said *you* should be able to afford one, Blackrock or a multitude of Chinese entities will but them, leverage them, and buy more. You'll rent, and if you can't afford you'll either be homeless or rely on welfare (where everyone else pays your rent). Single person home ownage died with the boomers, heck, two person ownage died in 08", "score": -9, "replies": [{"body": "Lol. I have anecdotes but you’re pulling out the old Black rock fear mongering. OK then", "score": 7, "replies": []}]}, {"body": "Prices are beginning to fall where I live and the sales numbers have really plummeted as of late. But the prices are still too high. Sellers are going to soon learn this isn't 2020-2021 anymore where they can ask $500k for a 1,000 sqft house that needs everything done to it.", "score": 1, "replies": []}]}, {"body": "No? The market is *forward looking* which all bears seem to forget. 0,5% price increase is *priced in* and we know it'll continue. Now of we saw *rampant inflation and 0,75-1,0%* rate hikes bear market would be a fact. But it isn't, cry me a river...timimg the market failed y'all once again.", "score": -8, "replies": [{"body": "I'm hardly a bear and I have remained fully invested through all of this. My point was while we are trending in the right direction with inflation, we haven't defeated it. The Fed will keep hiking until it comes back to a normal range. \n\n\nThe market wants to see inflation tamped down too. Companies' profits are hurting because of rising costs.", "score": 1, "replies": []}]}, {"body": "They are going .75 in sept for sure. DONE DEAL.", "score": 1, "replies": [{"body": "Well, based off what I read in the July meeting minutes a few minutes ago...that idea is news to the FOMC outside of Bullard and maybe Waller at least as of a few weeks ago.\n\nNow I recognize things are different since then, like we've seen the memes pop off, which I know folks get aggravated by (heck, I do too), but that doesn't get fixed with a 75, that gets fixed by liquidity being taken out of the system (and the SEC addressing what the options market can do to stocks but that...seems doubtful).\n\nQT will double in September.\n\nEdit: I know Bullard only made those comments today, but since he’s hawkish, my assumption is that he thought this back around FOMC too.", "score": 2, "replies": [{"body": "I mean I agree with you that doesn’t get fixed. \n\nBut when you need to slow down demand, the FED has to use their tools and it’s looking like they really like the interest rate tool. \n\nI would be seriously shocked if they go higher or lower than .75.", "score": 1, "replies": []}]}]}]}, {"body": "whether youre a bear or bull, you have to admit it was comical how the indexes pumped for 45 minutes after the release and then corrected to the day's opening price.  People trying to make trade decisions based on little snippets of text that were retweeted by someone, just hoping it meant what they thought it did", "score": 59, "replies": [{"body": "It's pathetic and insane and concerning. The market doesn't operate on fundamentals. Simply the God Powell Pump", "score": 15, "replies": [{"body": "To be honest, it feels a little more like a real market this year. Last year was worse when some stocks would have ridiculous PE ratios and people would just be throwing out random crazy earnings growth numbers. This market does feel a little more sane", "score": 18, "replies": [{"body": "*BBBY* slaps its infinite PE cock down", "score": -3, "replies": []}]}, {"body": "Because of how sensitive we are to interest rates. Tech comprises huge share of s&p and everything else has elevated leverage", "score": 2, "replies": []}, {"body": "I can understand it in the short term (like 45 minutes). Those are people just looking to day trade. Over the course of weeks and months the market is more understandable.", "score": 1, "replies": []}]}, {"body": "Oil price is down so that should help lower inflation.", "score": 4, "replies": [{"body": "Oh wow so simple how did no one think of this.", "score": 12, "replies": []}, {"body": "Won't it be absorbed into something else? Now that gas is lower I'm more inclined to spend more money on hotels and food/drinks instead of staying home. It's a catch 22 when oil lowers", "score": 1, "replies": [{"body": "It's been estimated 80% of the inflationary pressure was due to the oil price surging and increasing the cost to deliver things at every point along the supply chain. The remaining 20% comes down to non oil industry greed. \n\nOf course, that oil price going up was due to oil industry greed, and literally nothing else.", "score": 5, "replies": [{"body": "whats the source for that estimate?", "score": 4, "replies": [{"body": "Between his left and right cheek", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Nothing new \n\nJust wait and see what happens", "score": 10, "replies": []}, {"body": "All I know is that the fear is coming back and the sellers will come out in full force if only because there’ll be a rush to secure profits from this rally.\n\nI’ve been waiting for this, glad it’s here because that rally was nuts (and it gives me a second shot to get some of these stocks at a steep discount)", "score": 11, "replies": []}, {"body": "I don't think hike or no hike was even the question in the first place with September. The question is within the dot plot...if one is released because after all, they claim to have suspended guidance.\n\nIf a tougher dot plot is not released (5-6% in 2023) then frankly, June might have been it. The reason why it has a shot has more to do with the first half of July action then June...the March 2021 local lows just refused to let go with every shot for them to go. That's a very big spot now...not a double bottom (3860/3900 is likely also a very big spot).\n\nBut if a tougher dot plot is released...then all bets are off, and the following is probably likely...\n\n- SPX 3200-3400 minimum\n\n- A tech stock secular bear market (Nasdaq likely bottoms between 8-9k, then is rangebound for a very long time)\n\n- DXY 120...which likely leads to intervention because this is incredibly dangerous for the rest of the world", "score": 8, "replies": []}, {"body": "Different day, same plan.,,\n\nInflation is also tied into the global economy,  just announced, England is at 10% inflation.\n\nGood indicator on where this is going is to keep an eye on the bigger picture, ,,, the countries all around us.\n\n\nLooks like where not even close to getting a handle on inflation.", "score": 11, "replies": [{"body": "England is more at the mercy of Europe's gas prices though. Our annual energy bills are expected to hit 5k next year. Up from 1.2k", "score": 13, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Hopefully the gov bail out the low to middle class people. Either by direct handouts or by freezing the price cap. They need to do something and quick", "score": 2, "replies": [{"body": "Handouts would massively increase inflation. Haven’t we learned this yet?", "score": 2, "replies": [{"body": "Our likely new PM is planning to undergo a plan of at least £30bn tax cuts and doesn’t think it’ll have any effect on inflation. It’s weird seeing something so obviously dumb and voters just ignoring it", "score": 3, "replies": []}, {"body": "A middle class that pays all of its income to hear its home craters demand.\n\nAnd “handouts” that go immediately back into commodities pricing are subsidies.", "score": 2, "replies": []}]}, {"body": "They created the problems, they don't care about anyone but helping the rich get richer, so they can be rich too.", "score": 2, "replies": []}]}]}, {"body": "i think in the uk we are also very vulnerable to spiking food prices.  We import so much and harvests have been so poor.\n\nUnless we accept a root based diet this winter food inflation will be nuts", "score": 2, "replies": []}]}, {"body": "I just don't think governments and their central banks will care about inflation until the people do.  But if anything I think people have proven they will accept a reduced quality of life and making sacrifices.  \n\nIf and when people do get so upset by inflation it can then be used as a justification for more control and central bank digital currencies.  Inflation is a win win for policy makers.", "score": 2, "replies": [{"body": ",,, I hate to brake the bad news but this hasn't really started, this is foreplay before the bad times come. The world economy is in serious trouble.\n\nSo there isn't anything like , people proving they will except a reduced quality of life. Because they haven't reduced there quality of life yet.", "score": 5, "replies": [{"body": "I just don't know about that, I don't share the pessimism.  I think they will keep the money printers going and rates low enough (like during Covid) to prevent real melt down, of course inflation will increase though like we're seeing.    \n\nIf the bad times were going to happen they certainly would have when the entire world was forced to shut down.  A majority of people accepted it.  \n\nI think their answer is to just keep printing more money.", "score": 1, "replies": [{"body": ",,, 👍", "score": 1, "replies": []}]}]}]}]}, {"body": "Does anyone really think that this Fed has acted anything but dovish?  It was their lack of action and prolonged low rates which caused this situation to begin with.  \n\nI just don't think now - after how they've acted for the past 18 months of historic inflation (and 10 years of modern monetary policy) - that they won't continue to find reasons to do as little as possible.  \n\nSome are saying that the fraction of point inflation decrease wasn't enough for them to turn the printers back on, regardless they've proven (and said) that they are inclined towards and looking for reasons to be dovish.", "score": 6, "replies": []}, {"body": "What I take from that is just to hold.", "score": 2, "replies": []}, {"body": "\"Pace could slow\" doesn't really mean anything.", "score": 1, "replies": []}, {"body": "Quick! Sell everything and wait for 50% crash!", "score": 1, "replies": []}, {"body": "I hate this world", "score": 1, "replies": []}, {"body": "Stop it! The sooner this market completely crashes the sooner we can start a new beginning.", "score": 0, "replies": []}, {"body": "I think the disconnect here is the FED keeps talking about how they expect the rate to be x% by the end of the year. People wrongly assume this means there will be some kind of reset or change in the decision making parameters at that point simply because that is the time frame they are choosing to speak about.\n\nBut if you really listen to them they are saying they will raise rates until the trajectory of inflation looks like it will come back around 2%. This could take an undefined amount of time.\n\nAlso, to add if this happens this means the inflation we already had is permanent and will never go back. The *increase* in inflation will stop only", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "wr0p1z", "created_utc": 1660771670.0, "score": 169, "upvote_ratio": 0.95, "num_comments": 81, "comments": [{"body": "I have no idea how given the amount my wife spends there", "score": 127, "replies": []}, {"body": "This is just anecdotal but what is the state of your local Target store?\n\nLocated in Philly and the local Targets are all dumpster fires. Stuff is out of stock that other stores have no problems keeping in stock, like Coke Zero, cough medicine, sinus medicine, granola bars, socks, etc. Walgreens, CVS, and other grocery stores have no problem stocking most items, even with the shipping problems from the pandemic.\n\nHas anyone else been noticing a change in how stocked, clean, and organized your local Target is?", "score": 85, "replies": [{"body": "No issues at the ... three targets I visit regularly in SoCal. We never even got those deep discounts that were supposed to come around....", "score": 59, "replies": [{"body": "Last year I lived in Houston and the local Target I went to was perfectly fine. Not sure if it's just the Philly Targets that are mismanaged shitholes or if the whole chain is experiencing issues.", "score": 22, "replies": [{"body": "It probably depends on the location. I was at city center Philly last year, and Target there serves highly populated area between campuses and residential, so it was expected to see inventory lagging", "score": 7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That’s actually my local store, as well. We do most of our shopping there and haven’t had trouble with availability of things we’re looking for. It certainly hasn’t looked like a dying K-Mart to me. The last few times I’ve been in, traffic has been high and grocery and beauty areas in particular have had a lot of active shoppers in them.", "score": 2, "replies": []}]}]}]}, {"body": "Yea I’ve been to at least 5-6 of them in SoCal in the last year and never saw an issue. Maybe better regional staff, or prioritized?\n\nOnly ever saw empty shelves in the newborn/baby sections during the formula frenzy", "score": 3, "replies": []}, {"body": "The 7 socal targets I went to had constant problems…", "score": 0, "replies": []}]}, {"body": "Haven’t been in about a month or so but here in Austin it’s been fine. It’s like a Walmart that doesn’t suck. Reasonably clean, etc.", "score": 24, "replies": [{"body": "Target is Walmart without butt cracks", "score": 29, "replies": [{"body": "Walmart is spending a TON of money on remodeling their stores.  I think they do a better job at brick and mortar retail, but Walmart can’t get the online platform right if their life depended on it.", "score": 1, "replies": []}]}]}, {"body": "I was raised in a Target family and have been going there for 20+ years all over southern CA and I have never seen shelves this empty before, its wild", "score": 10, "replies": [{"body": "If you go over to the target sub you'll see a widespread issue with having enough hours on payroll just to get all of the trucks thrown.", "score": 5, "replies": [{"body": "Thats awful, I think they are gonna struggle bigtime this holiday season", "score": 3, "replies": [{"body": "Lol only if people have enough money to actually buy gifts.", "score": 3, "replies": [{"body": "People go into deep credit card debt to pay for Christmas in America. Though I do think they will spend less than last year which is what wall street hates. \n\nI think the coming spring is when dealing with the higher interest rates on that gets rough. Especially if we see job losses rise and inflation expectations become more entrenched.", "score": 4, "replies": [{"body": "If the market is as forward-looking as everyone thinks, can we infer the market will start tanking in Jan, if not earlier? We could very well be witnessing a coriographed attempt to keep markets from tanking going into an election.", "score": 1, "replies": [{"body": "I think it will depend on if/when Target and other retailers guide for weaker Christmas revenues or if they let the cards fall as they may. Keep in mind that these businesses are cyclical and get a large part of their yearly revenue in Q4. If they do surprisingly terrible in the holiday season compared to what they guided, then yeah, January is fucked.\n\nI won’t go into conspiracy theory stuff. I do feel that the market is sometimes manipulated but it is beyond any reasoning I might be able to accurately predict.", "score": 2, "replies": [{"body": "Yeah I'm not a big conspiracy theorist either, just seems suspicious that the market is running based on hopium that the Fed will lower rates in 2023. Seems that there's something more to this occurring behind the scenes. And despite AAPL laying off 100 contract recruiters, implying that its business is slowing even more than the paltry 2% y/y growth, the stock is nearly at ATH and now 7.5% of the SPX. This is a dangerous situation, cuz if AAPL falters, the markets are in trouble.", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">just to get all of the trucks thrown.\n\nWow, maybe they need to get She-Hulk in there. She can lift a literal ton.", "score": 1, "replies": []}, {"body": "Even when I worked there a decade ago, it was pretty clear that corporate would run the company into the ground despite being the wal mart alternative. \n\nAccording to corporate it takes only a minute to open, unpack, take all the plastic off, and put onto shelves and racks, an entire box of clothes. \n\nI imagine their unrealistic bullshit and cutting back of hours has only gotten way worse since and if they don’t change course they’ll just be another ignored example of running a company into the ground by constantly trying to cut labor costs.", "score": 1, "replies": []}]}]}, {"body": "Funny you said that, I was at target yesterday on the road for work to pick up few items, and the line was too long that I left. It was Tuesday around 3:30pm. \n\nInventory wise, shelves were empty to half empty. Even basic stuff like melatonin?\n\nThere is huge traffic, but its not correlated to sales. In general, target always been a hanging out browsing spot for teens-college students", "score": 10, "replies": [{"body": "Do you live in a college town? What you might be experiencing is that students are moving back into dorms. That has a tendency to wreak havoc on nearby Target stores.", "score": 1, "replies": []}]}, {"body": "That sounds exactly like Target when they moved into Canada. We had empty shelves and anything that was actually on the shelf was at an outrageous price compared to the Targets in the States. They lost billions expanding into Canada with no inventory", "score": 3, "replies": []}, {"body": "No offense- Philly is Philly.", "score": 2, "replies": []}, {"body": "Busy and well kept as usual. I'm not selling my TGT position anytime soon and TBH I wouldn't mind more of a dip so that I could add more.", "score": 1, "replies": []}, {"body": "I get depressed inside Targets. They smell stale, the fluorescent lighting, white floors, products on the wrong shelves. Rather buy stuff on Amazon, at Walmart because it’s more spacious/cheaper, or better yet, Costco. Never understood the appeal of Target.", "score": -9, "replies": [{"body": "That’s basically how I feel in a Walmart. Walmart is so fucking huge I feel overwhelmed trying to find anything. By the time I’m done I’m exhausted from walking a half mile in each direction. Every section the shelves seem massive and overloaded with crap. \n\nIn clothing sections people just throw clothes on the ground and everywhere else, and no one in a blue shirt seems to be doing anything to tidy the place. \n\nNo amount of savings could get me to step foot in a Walmart. But I know for a lot of rural Americans it is the one big box store even remotely close to them.", "score": 6, "replies": []}]}, {"body": "My local Targets (suburban areas) have all been very well-maintained, and I rarely have ever seen empty shelves. In more dense, urban locations I still see well-maintained stores, it's actually CVS/Walgreens that tend to be a lot shittier.", "score": 1, "replies": []}, {"body": "Went to one near me to buy a new vacuum cleaner.  Section was a mess.  And every price tag was labelled \"display $0.01\"  I couldn't tell what anything cost, and the vacuums were just strewn all over the place.  Couldn't wait to get out of there.    \n\nWent to a different location, and it was little better.  Still not too impressed with how Target stores are kept up.", "score": 1, "replies": []}, {"body": "Bay Area here. Last few times lines have been quite long at two targets in two different targets in different region of the metro area. My sibling applied for a job and got rejected but they have a we’re hiring sign outside.", "score": 1, "replies": []}, {"body": "Our local target has inventory overflowing on all the sections. The center of all the main aisles have new, large displays again with overflowing inventory. The sections of the store have been redesigned to maximize how much they can fit inside the store, and the half the parking lot is now dedicated to Miller me trailers. We’re definitely still seeing the inventory glut", "score": 1, "replies": []}, {"body": "Targets in Baltimore, MD area are in good shape: Filled with Stock, People, Good service.\n\nIts was a little touch and go the last few years but they are \"ON TARGET\" now.![gif](emote|free_emotes_pack|stuck_out_tongue)", "score": 1, "replies": []}, {"body": "Located in SoCal, my local target always runs out of particular things like cat litter, like 80% of the time I show up it's out of stock. I learned to either schedule a pickup or just go down the block to PetCo for cat litter.", "score": 1, "replies": []}]}, {"body": "They warned about this a little while ago. Will be interesting to see if they revise next quarter expectations, and if they think it will be better news or not.", "score": 30, "replies": [{"body": "Agree, and I edited that on the post. That being said, I didn’t expect the numbers to be that bad. I was hoping for a walmart-ish report.\n\nUnless the economy magically adjust in the next 2 months, I am struggling to see the retail industry flourishing specifically Target", "score": 8, "replies": [{"body": "Yeah. I think we are all kinda shocked it was that far off the mark, even with the fair warning they gave.\n\nJust as surprising is that Walmart did so well, despite being in practically the same business, and having to deal with the same ordering and shipment problems.", "score": 3, "replies": [{"body": "Thinking about it, it kinda follows Lowes massaging regarding the consumer spending. Walmart might be a little different since huge part of their revenues comes from their great value/groceries, or Home Depot, which is deeply into construction projects and long contracts. \n\nThese companies are telling us what the stock market is hiding with the past rally", "score": 1, "replies": []}]}]}]}, {"body": "weary file chunky sink tap stupendous license march makeshift stocking\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 24, "replies": [{"body": "This is exactly correct. I work in Supply Chain and promise you they wont be the only ones. Demand hit new all time highs and not only were ppl not prepared, they anticipated a major recession in 2020. Not only did target likely buy too much inventory, they probably paid a premium purchase price in addition to expedite fees. \n\nIts been an extreme, unprecedented few years in supply chain.", "score": 19, "replies": []}, {"body": "Walmart is also spread out more - rural areas where it’s just Walmart. They’ve also gutted their labor hours to the extreme minimum while flooding stores with freight and pushing big on roll backs and clearance.", "score": 8, "replies": []}, {"body": "Weren't Walmart earnings \"good\" only in comparison to drastically lowered expectations?", "score": 7, "replies": []}, {"body": "More like the woke stuff", "score": -14, "replies": []}]}, {"body": "Man..  What a disaster..", "score": 8, "replies": []}, {"body": "Retail in general are flubbing their numbers. The only reason any of them made any kind of profit this quarter is because they gutted their labor hours. They’ve all been running skeleton crews all the while flooding their stores with freight and expecting skeleton crew to get everything on the shelf.", "score": 7, "replies": [{"body": "The covid months really screwed the expectations and growth numbers. Target was growing their top line at 3-4% a year, then 2021 happened, and we had 22% growth. I don't think it is a matter of revenue growth as much as poor management throughout COVID when they ignored the decline of consumer purchasing power, and ended up with more inventory than they can move.\n\nI have an experience when I tried to return something online at Target for ($65) few months ago, and they just told me to keep it and refunded me. This is how bad it is with their inventory management", "score": 7, "replies": [{"body": "Yeah I’m waiting to see what next year looks like once people finish burning through their savings and loading up their credit cards/lines of credit. It’s what kept us afloat so far and the market doesn’t seem to care - all they care about is the here and now. There’s little foresight or perspective happening.", "score": 5, "replies": []}]}, {"body": "Yep. Take for example Best Buy. Had mass layoffs and a cut in labor they’re fucked", "score": 1, "replies": []}]}, {"body": "Cornell plays the long game. He went on CNBC at last earnings and was pretty clear that there were challenges to work through, and that it would take time. He spoke to specifics, and has an evident understanding of what needs to happen going forward.", "score": 12, "replies": [{"body": "He missed earnings 3 out 4 Qs. Do you expect him to go on TV and rattle around? \n\nNothings against him, but it doesn’t take a genius to understand the problem facing the consumer sector.\n\nThe overall results were bad. The messaging is consistent, which isn’t comforting to investors", "score": 5, "replies": [{"body": "He has been the CEO since 2014. Missing earnings in 3Qs, given circumstances and his track record, aren’t a long term concern to me. You’re certainly free to disagree. \n\nFull disclosure: My only exposure to Target is via broad market index funds.", "score": 12, "replies": []}, {"body": "No you don’t understand. The bad news isn’t bad news because they told us that bad news was coming. That cancels out the bad news since we were expecting it.", "score": -3, "replies": [{"body": "How about, “bad things happen, and sometimes take time to work through. When that happens, you want leadership to be honest and demonstrate understanding of what needs to be done going forward” -?", "score": 7, "replies": []}]}]}]}, {"body": "That means Walmart “great” results must be taken with a pinch of salt since target and Walmart are basically substitutes", "score": 18, "replies": [{"body": "Target is significantly more expensive. People undergoing any kind of economic hardship are much more likely to shop at Walmart. Normally they are substitutes more or less but as soon as people feel the need to save money, Walmart will see a boost over target.", "score": 27, "replies": [{"body": "Agreed. What this means is the economy is really tanking as people are making decisions based on prices instead of convenience.  People are changing their spending behaviors and pattens substantially to save Money.  This is exactly what happens in every recession known to man.", "score": 5, "replies": []}, {"body": "I would say target sells both cheapshit and more expensive stuff whereas Walmart only sells the former", "score": 2, "replies": []}]}]}, {"body": "How is this garbage only down 3% ?", "score": 13, "replies": [{"body": "Because it's the treasure of others who disagree...", "score": 10, "replies": []}, {"body": "They are busy with BBBY circus.", "score": -4, "replies": []}]}, {"body": "Target is a good company.  But if inflation persists longer than the market is pricing in than I think Walmart & Costco will eat there lunch.  I make a decent salary.  But I've noticed I'm doing most of my shopping at Walmart cause it's cheaper.  I'm also just buying food & necessities.  These are low margin purchases for the retailers.", "score": 2, "replies": [{"body": "Market pricing in is arbitrary. We all saw this coming months ago, and yet the market kept rallying up.\n\nNot all retailers created equally. As you said, Target is a luxury, Walmart/Coscto is necessity.\n\nThat being said, from valuation perspective, I think Target is actually trading around FV more than the other two. I sold out Costco recently despite how much I love the company because my margin was low, and there is absolutely no reasoning for it to trade at 40x their earnings.", "score": 3, "replies": [{"body": "I just wonder about buying retailers.  I'm thinking whether you are Target or Walmart you are going to have to take price cuts and lower your margins to get customers into the store.\n\nThat's why I am more bullish on the brands.  Like Levi, or Guess, or whatever. I do not see a bullish argument to buy Target or Walmart rn.  I rather buy Hanesbrand which is a stock I'm looking at over Walmart.  I'm more bullish on the suppliers than the retailers.", "score": 1, "replies": []}]}]}, {"body": "If this earnings season is telling us anything, it separates the winners from losers. Well run businesses are not hurting in this environment.", "score": 2, "replies": []}, {"body": "I'd stay far away from Target.. I wouldn't be surprised if they followed in the unfortunate footsteps of Sears, Radio Shack, and Pigly Wiggly..", "score": -2, "replies": [{"body": "Honestly, I really only see them headed that direction if they don’t pull their head out of their ass with regards to the actual amount of labor they need to run their stores.", "score": 2, "replies": []}, {"body": "Target is a brand. If we actually hit a recession, I don’t think Target going to fall as much as Walmart or Costco", "score": 0, "replies": [{"body": "This is wrong.\n\nCostco and Walmart thrive in recessions. Target will be the loser in the recession of these three", "score": 11, "replies": [{"body": "Costco is not trading at 40 P/E in a recession lol", "score": 5, "replies": []}]}, {"body": "Costco has world class management and they have far less skus to worry about than Walmart and Target. \n\nPlus who doesn't love their cheap hotdogs and pizza..", "score": 0, "replies": [{"body": "I am not sure where you are going with this because Costco is trading at higher premium than Apple and Google.\n\nWhatever you are talking about is emotional surface level nonsense. If a recession happens, Costco is more likely trade at normal level, which is half the current value. Target is trading at 14 Forward PE, which is a normalized level of value from ATH. \n\nCostco is trading at 100x FCF with 43 forward PE that is more likely to be close to 50 P/E by earning call.\n\nFundamentals win. It has nothing to do with management. Costco is stupidly overvalued", "score": 2, "replies": [{"body": "Costco could change their membership prices to generate whatever FCF number you desire. They're always packed. I've been to Costcos in Canada, Taiwan, USA, East coast, west coast, etc. We love our Costcos. \n\n&#x200B;\n\nI own Costco stock and also am a Costco Executive (member). Costco4Life.", "score": 2, "replies": []}, {"body": "ok", "score": 0, "replies": []}]}]}]}]}, {"body": "TBH, I've been in Target twice in the last six months, and both times they seemed to have very few items (very common items that would be a staple for Target), and what they did have was spread around.\n\nI do believe that they are having supply chain issues.", "score": 0, "replies": []}, {"body": "It looks to me like Target was more concerned about choking the competition vs just buying and selling their goods.", "score": 1, "replies": []}]}
{"title": "Tesla Launches Supercharger Membership for Non-Tesla Vehicles at $0.99/month", "selftext": "", "id": "wqca1p", "created_utc": 1660701289.0, "score": 221, "upvote_ratio": 0.96, "num_comments": 80, "comments": [{"body": "So cheap", "score": 65, "replies": [{"body": "The article has been amended. It appears that the so cheap $0.99/month membership (which didn't make a lot of sense to me) is perhaps not real.", "score": 21, "replies": [{"body": "Maybe is just an accidental leak, but they have been preparing the system for sure, the $0.99 could be just a placeholder for the actual price.", "score": 13, "replies": []}, {"body": "\"Update August 16, 9:56pm PT: the Membership option has disappeared from the Tesla mobile app. Looks like it was launched by accident.\"", "score": 4, "replies": []}, {"body": "The charge is just there to make sure payment is through before the charging session.", "score": 2, "replies": []}]}]}, {"body": "This right here reveals the biggest difference between r/teslamotors & r/teslainvestorclub - over there they’re like “NOOO” and here it’s all 🤑🤑🤑🤑", "score": 43, "replies": [{"body": "Yeah, some people see the value. Whether you follow the numbers or common sense. They all lead to Tesla becoming a behemoth of a company like the world hasn't seen in a while. It's about their process, vertical implementations, framework of looking at ideas and executing them time and time again.", "score": 18, "replies": [{"body": "Superchargers are going to be *the* chargers for cars. I don't see anybody else able to compete. Tesla's the only company that properly feels that a fast charging network is make-or-break. If Tesla doesn't build it they die.\n\nVW was forced into it by dieselgate and the rest of the industry is in la-la-land thinking \"chargers would be nice.\" The sense or urgency is simply not there. The only businesses that will feel a sense of urgency are the ones that own parking lots along high-traffic corridors feeling FOMO if they don't have EV chargers. No EV chargers means no access to EV wallets. And more and more they're going to come to Tesla to assuage their FOMO.", "score": 7, "replies": []}, {"body": "one brand value I see is Tesla chargers only serving the median $$ & above buyer. \n\nIME the average CCS driver is a lot less conscientious than the average Tesla driver.\n\nTesla doesn't need the money and keeping charger availability up and the hoi polloi over on the Walmart side of the lot would work better longterm maybe.", "score": 1, "replies": []}]}, {"body": "Can't easily get gov incentives to build a walled garden. Opening the best network allows it to grow faster. Tesla are market leaders anyway so downside isn't that big.", "score": 8, "replies": []}, {"body": "Yeah see the thing is I’m totally cool with this *if* they use this money to build out their network even faster. Because if this just causes the superchargers to be more full then it would negatively impact those who have teslas and rely on these chargers. \n\nThere’s still several spots in my region (TX and surrounding areas) where I still want to see some chargers that I have been waiting for ages on so if this makes these additions quicker then I’m all for it", "score": 7, "replies": []}]}, {"body": "start cheap, hook them to superior experience", "score": 43, "replies": [{"body": "also makes the competition relaxed and lazy. they stop any idea of building out their own network. literally handing tesla all the gas stations.", "score": 9, "replies": []}, {"body": "Is it really a superior experience for non Tesla's?", "score": 3, "replies": [{"body": "YouTube electrified America charging stations reviews. \n\nAt least in the US. It’s superior.", "score": 11, "replies": [{"body": "Ah right I always forget that the us for some reason has much worse charging networks.  \nIn Europe charging a non Tesla ev on a supercharger is not the great experience some think. There are often times broken stalls that you only see when opening the app, the cable is way too short to be useable with many EVs and if you drive an egmp car (ioniq 5, ev6...) Or a bmw you'll have to hope that it's a V2 supercharger because V3 for some reason doesn't work with them. In addition to that it's slower to use since you cant use Autocharge or your rfid card which also means that you won't be able to use your existing contracts and therefore pay more.  \n\nOh and since it's not connected to hubject you can't check the charger status through the car like you can do with most other networks.", "score": 4, "replies": [{"body": "It’s mostly because creating Electrify America was VW’s punishment for diesel-gate (when they got caught lying about their diesel cars’ emissions). They hardly have an incentive to make it amazing.", "score": 2, "replies": [{"body": "I think that excuse is a bit to easy to be true. If I remember correctly they went way further than what the settlement required", "score": 2, "replies": [{"body": "I guess they could just be inept and really bad at running a charging network, too.", "score": 1, "replies": [{"body": "In Europe it’s called Ionity. \n\n1) Europe is more densely populated. \n\n2) Europe has more EVs\n\n3) Europe is home of VW\n\n4) Tesla is from the US. NA is spread out. More sparsely populated. Less nonTesla EVs. \n\n5) some of it is defending market share and one turf.  Some of it geographical understanding issues.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I'm a frequent EA user with my Leaf and for the past year-plus the experience has been pretty hit & miss. Charger contention is bad on weekends and people take the one Chademo spot even if there are all the others open and DGAF. Had my account not start a charge session twice now, out of ~20 total uses.", "score": 1, "replies": [{"body": "Yeah I honestly am sometimes surprised how hit and miss EA or public charging in the US is in general.  \n\nI used public chargers in germany and austria a lot. I drive a short range EV araound 30k km per year and all of that is on longer trips. I had exactly two cases of a close call in the last 3 years in over 100k km. And both of them are more than 2 years in the past and public fast chargers multiplied like crazy. And the most sigificant thing is they got reliable. I can nowadays drive to a charger without checking on plugshare / chargemap and know that it works. And especially in Germany larger charging hubs with 20-50 plugs are spawning on a lot of places.  \n\nI installed the Tesla app just in case but even though I've been to a lot of places that have public superchargers I have never used it because it a way bigger hustle to use them not to mention significantly more expensive.", "score": 1, "replies": []}]}]}]}, {"body": "PLUS charging fees (which are lower). This is kewl as the dollar is just a red herring. Its paying for nothing and a great way to get people in", "score": 12, "replies": [{"body": "That's how all of these subscriptions work. \n\nThat's like saying Amazon prime used to pay for nothing except get you cheaper shipping.", "score": 7, "replies": [{"body": "yep. great model", "score": 2, "replies": [{"body": "What does \"paying for nothing\" mean?", "score": 1, "replies": [{"body": "Meaning it not paying for anything of much value compared with what is actually being consumed. Its a way to have a pseudo \"loss-leader\" product that gets people in the door", "score": 1, "replies": [{"body": "Except it's not a loss leader. That subscription fee is pure profit.", "score": 1, "replies": [{"body": "Yeah true, not an loss leader in the classical sense, but its not looking like it's attached to anything. I guess it could go toward server fees?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "This could eventually yield like a billion dollars a year in the US alone while also making everyone a customer of Tesla's.", "score": 39, "replies": [{"body": "At $12 a year, I don’t think so", "score": 4, "replies": [{"body": "They also have to pay for the electricity.", "score": 28, "replies": [{"body": "Tesla/Elon claims they don’t make profit from superchargers.", "score": 1, "replies": []}]}, {"body": "You are getting people to pay you $12/year to checkout the awesome cars you make and the seamless charging network that goes with it", "score": 5, "replies": [{"body": "And download your app so you have all their data? Best EV database in the world?", "score": 1, "replies": []}]}, {"body": "If a third of the country wants to use the best supercharging network available, that's a hundred million dollars per month. The math is pretty simple.", "score": 9, "replies": [{"body": "And that's before they consume any electricity", "score": 10, "replies": []}, {"body": "If a third of the country was using the super charging network we are all screwed. There would be no where to charge. This doesn’t even mention that the share of the US population that has an EV is actually like 4% brining you nowhere near a billion a year", "score": -5, "replies": [{"body": "\"Eventually\" was the third word in my comment.", "score": 11, "replies": [{"body": "That’s just pure speculation. At this price as it is right now I don’t think it’s for making money but rather to get government contracts", "score": -2, "replies": [{"body": "Of course it's speculation. That's why my second word was \"could\".", "score": 5, "replies": []}, {"body": "Think 20 years from now, who’s not gonna pay $0.99 to have access to the super chargers? Well Tesla owners I guess.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "But Tesla owners will suffer. The lines are so long already at popular locations in California.", "score": 2, "replies": [{"body": "How long do you usually wait?", "score": 1, "replies": [{"body": "Sometimes up to half an hour to get an available spot. Total charging time then becomes about one hour.", "score": 2, "replies": []}]}]}]}, {"body": "It’s not $0.99 all you can eat plan. $0.99 is just for the access, electricity is extra I guess.", "score": 7, "replies": []}, {"body": "genius", "score": 8, "replies": []}, {"body": "This is genius. $1 a month will get so much data from non tesla users, their driving patterns and maximize supercharger utilization. As a long term stock holder I love the bold move.", "score": 11, "replies": [{"body": "I wish I had more to put in. People still don't see it and in my opinion we're about 25% of the way to peak. For this calculation we would need to know how many drivers in the United States are capable of using the network and multiplying it times 12 to find out fixed sales per year. Then we need a variable say x for the mean amount of miles driven by them and then building standard deviation around it so that we can come up with yearly amount of electricity consumed. I'm about to call it a night but if someone could do the math let me know how much that is? If not I might do this in my free time on friday.i might go in more than expected a little earlier. Could crash but i sense probability of that is less than 3 or 4 % given three leadership. Sometimes it's great and sometimes the stock takes a hit because of what Musk says. I think I'll break the piggy bank.", "score": 2, "replies": [{"body": "15M units sold a year.  Total US cars estimated to be 20x = 300M cars total. \n\nTesla sold 300k last year in the US. Let’s assume Near term tesla has a 50% market share of EVs. Let’s assume current fleet size = 3x. And a growth rate of 80% through 2030 up to 8M cars a year.  \n\n2021 300k, 900k fleet, $11M\n\n2022 540k, 1.44M fleet, $18M\n\n2023 870k, 2.3M fleet, $28M\n\n2024 1.6M, 3.9M, $47M\n\n2025 2.9M, 6.8M, $82M\n\n2026 5.3M, 11.1M, $132M\n\n2027 8M, 19M, $228M\n\n2028 8M, 27M, $324M\n\n2029 8M, 35M, $420M\n\n2030 8M, 43M, $516M\n\n2035 8M, 83M, $996M\n\nIt’s going to take a while to ramp. But once you get to 100M+ EVs on the roads the numbers start getting to 50% take rate 500M just in fees. and the revenue from electricity too.", "score": 3, "replies": []}]}, {"body": "Hrmmm I wonder what the app will track (not the supercharger itself)", "score": 1, "replies": [{"body": "The app will request GPS access to find the supercharger locations. Once it can access the GPS it can periodically check where are you and send that info to Tesla. Over time this data can be used for building more supercharger locations and track efficiency of your competitors cars. \n\nThink about this, tesla will have information about their competitor's customers that even Ford or GM cant get their hands on.", "score": 1, "replies": []}]}]}, {"body": "Do they receive the same charging rates as Tesla drivers?", "score": 6, "replies": [{"body": "If its the same as Europe , yes.\n\n&#x200B;\n\nTho Europe is like 10-15 euro's or something", "score": 4, "replies": []}]}, {"body": "It will take a some time for some normalization of traffic to superchargers. Hopefully Tesla can build more chargers faster.", "score": 2, "replies": []}, {"body": "UPDATE: they removed this from the app already. https://twitter.com/sawyermerritt/status/1559751308667666432?s=21&t=vvEKB1jXb2DRdjlymEtJRw", "score": 2, "replies": []}, {"body": "Is this going to cause too much traffic at supercharger stations? I live on the rural east coast so I’ve never had a problem, but I can imagine this causing issues in more populated areas.", "score": 1, "replies": [{"body": "Being a non-locked network means that it will be easier for Tesla to permit and build in more locations.", "score": 9, "replies": []}, {"body": "Short term and in certain areas, yes. Long term, the higher utilization will support more charger build out including installing superchargers in areas which otherwise wouldnt have enough Tesla traffic to justify one. In the long term this makes more money for Tesla and is \"the right thing to do\" politically as well as it creates goodwill with the public and politicians and heads off antitrust concerns.", "score": 4, "replies": []}, {"body": "There aren't enough non-Tesla EVs on the road yet to matter in the short term, and Tesla is constantly and aggressively expanding their supercharger network. They have done the math and strategic forecasting and concluded that this won't be a ruinous move. I don't think you need to worry.", "score": 2, "replies": [{"body": "Wrong. There are plenty of non-Tesla EVs in California cramming some charging locations already.  This will just make the situation worse for Tesla owners. Plus all the charging port locations are different. It is going to be a total chaos.", "score": 1, "replies": [{"body": "Well that’s just California being California , state is  about as dumb as a football bat.", "score": -2, "replies": [{"body": "Lol at least I can laugh at that. You do know that Tesla was born out of California brain pool. Same with Apple, Google, and almost every other tech company that changed your life.", "score": 1, "replies": [{"body": "VW was born from Nazi Germany. What’s that have to do with the price of tea in China\n\nAnalogies aside . Idc where the “idea” was born the brain pool might be useful but , cali is… something else", "score": 1, "replies": []}]}]}]}]}, {"body": "Yes. They’re busy enough it’s going to become a disaster.", "score": 1, "replies": [{"body": "We have no idea which chargers will open up to non Teslas.", "score": 1, "replies": [{"body": "That’d be interesting if they enabled tesla only during certain peak times it would really encourage people to switch over", "score": 1, "replies": []}]}]}]}, {"body": "I hope those rates aren’t real. I want/expect to have more of a premium from buying a Tesla than just any e-vehicle", "score": -2, "replies": [{"body": "You do have a premium , you got a damn Tesla lol", "score": 27, "replies": [{"body": "OP:\npremium == exclusive", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Until they are demand-limited, who cares?", "score": 1, "replies": [{"body": "people at overcrowded superchargers care", "score": 3, "replies": [{"body": "Fair enough. What did Elon say at the AGM, they plan to keep doubling every year? This should make it easier to get permits", "score": 6, "replies": []}]}]}, {"body": "Why help the competition who’s trying to destroy you at every turn?  The media that is constantly printing hit pieces on your products. It is definitely making buying a Tesla less attractive than before.", "score": 1, "replies": [{"body": "He’s not helping them, all EV gotta charge. Might as well make money off of them too.", "score": 1, "replies": []}]}]}]}, {"body": "Oi", "score": 1, "replies": []}, {"body": "There is only one station on the map for the US, Lincoln Ave, Santa Monica, CA", "score": 1, "replies": []}, {"body": "why so cheap?!", "score": 1, "replies": []}, {"body": "Gotta be a typo. Probably 9.99", "score": 1, "replies": []}]}
