{"title": "why is the target 2%?", "selftext": "I keep seeing the 2% mark being spoken of, to tame inflation. Why isn't 0% the target? Is this what the feds do? Create chaotic conditions in the world, which leads to the markets plunging while simultaneously increasing the prices dramatically of everything, then act like they are saving the simpletons by bringing everything back to normal but not exactly how it was prior to said events? Rinse repeat, and here we are with basic wages not meeting living standards?", "id": "x0lm1w", "created_utc": 1661770077.0, "score": 8, "upvote_ratio": 0.59, "num_comments": 86, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|1 year ago\n**Total Comments**|552|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x0lm1w)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x0lm1w)", "score": 1, "replies": []}, {"body": "In an economy based on interest, you have to slowly increase the money supply in order for the economy on a whole to exist.   If the entire world was just two people with one dollar, and one dollar was loaned to other at interest, there would be no way to pay back the debt without increasing the money supply.", "score": 68, "replies": [{"body": "Great explanation", "score": 7, "replies": []}, {"body": "And if the entire world were just two people with one thousand dollars evenly split and one dollar was loaned with interest increasing the money supply would be unnecessary.", "score": 5, "replies": [{"body": "How do you repay the interest without increasing the money supply?", "score": 1, "replies": []}]}, {"body": "Or you know, we could do like Abraham Lincoln, and create intrest and debt free money (aka greenbacks). \n\nYou think the man was shot because of slavery? Pfft. No. He was shot because he wanted to get rid of the central bank and the debt salve system of money...\n\nThe more you know 🌈", "score": 8, "replies": []}, {"body": "This is not a good analogy at all. Money can't be a fixed unit, money is whatever is available and best qualifies for the intended purposes (store of wealth). In reality, commodities were used as money in a free market, because It made sense. And a pay of interest  was always a mirror for the value an investment brought, because there was more money in the market than before the investment, satisfying customer needs that were urgent and thus bringing a return of investment.\nCentral banking is just a very sophisticated bottom to top wealth redistribution. Yes it might be a little less complicated in terms of public financing, but to the price of an inevitable slow down fall and one day once again, war and death", "score": 4, "replies": [{"body": "All models are wrong.  Some are useful.", "score": 1, "replies": []}]}, {"body": "If it was just two of us, why would I need to loan out the dollar with interest?", "score": -2, "replies": [{"body": "Yeah what would that dollar even be used for in a two person economy?", "score": 2, "replies": [{"body": "So you could buy a coconut from Friday.", "score": 1, "replies": []}]}]}]}, {"body": "The major reason they target a positive (small) inflation rate is what's known as ***technology deflation,*** which is a slow but persistent force that causes goods and services to become both better and cheaper over time.\n\nThink about television. In 1975, it was a 200 lb piece of furniture with a 23 inch screen and a shitty picture. If you wanted to change the channel without getting up, you had to birth a small child to assume the role of knob turner. Also, for most people (like me) who grew up in the sticks, there were between 1 and 3 channels, depending on whether nature was cooperating at the moment. If you missed something on TV, that was it. You just missed it. There was no \"on-demand\". No Youtube. No reruns. Channel scarcity was real, so lots of events happened once and that was it. Missed that potato quality Cubs game because work kept you long? Better luck next time. Unless you were rich and had money for a beta player and expensive tapes, that's how it worked.\n\nThe price for this monstrosity? In today's dollars, they started around maybe $600-700.\n\nToday, you can see the nose-hairs on a pitcher fluttering in the wind as he winds up. The quality is that good. On-demand means you can watch anything, anywhere, anytime. What's today's TV cost? Eh, maybe $200-300 for a 40 inch wall-hanging flat screen. Oh and they're all smart-enabled, so you can re-watch virtually anything, anywhere, anytime. Youtube, Netflix, Amazon, Disney, etc.\n\nHow many channels do you get today? My $8 antenna TV gets *around 30-40 high definition channels*, including the major networks and a bunch of random movie channels, all the PBS offerings, plenty of good old bible beating religion channels, and some other random stuff like QVC.\n\nIf new money was not created, people would be less incentivized to invest dollars in productive enterprise. More people would store dollars under mattresses. This slows down the technology flywheel. A second effect is no money printing means the government cannot engage in expensive foreign policy, like waging war. If a foreign nation knows *you cannot afford a war -* and they can, it's a very bad bargaining position. Bit like nuclear deterrent. We know even despots are incredibly unlikely to commit mutual suicide via nukes, but all the same we steer clear from direct engagement in nuclear nations. Gaddafi was a monster, no question - but how did his giving up the countries nuclear arsenal turn out for him?", "score": 4, "replies": [{"body": "Yep, life is more efficient. So there are some deflationary forces out there. Waste, like malinvestment or actual garbage, also grows and that is inflationary.", "score": 1, "replies": []}]}, {"body": "Who downvotes this ![img](emote|t5_2th52|4271), I was legitimately curious as to why", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|4640)", "score": 5, "replies": []}, {"body": "Ah i see, you are absolutely unfamiliar with monetary policy. Before investing in stocks I suggest you invest in financial literacy first. But I guess it's always the same, nobody wants to get rich slowly because your wife's boyfriend told you magical stories about the realm of wsb, melons, gain porn and shit. Have you even tried to google that kind of information or is your first go to a bunch of strangers lurking in peace for loss porn. For once show some decency and get a book first. Sorry for the rant, here is your answer in short sentences: \n\nA 2% inflation target is just enough to keep economy (companies, households, consumers like you & me) spending money rather than saving which fuels economic growth. Also it incentivices investments over saving. Overshotting this 2% target is bad because prices are rising too fast and create too much pressure for companies, consumers etc. A significantly lower inflation than 2% is bad as well because money is rather saved than spend / invested and therefor this will drain the economy from the stuff that keeps it running: money / liquidity", "score": 3, "replies": [{"body": "I just needed a simple definition. There's evidently an infinite supply of material in regards to economics. Even the so called governors of this country can't get it right. Basically, what I got from this, is they don't want us saving money, while simultaneously not having to spend too much money for basic needs. Sounds like a scheme. Keep us happy enough not not riot but not comfortable enough to enjoy life.", "score": 1, "replies": [{"body": "Reasons given from my money and banking class and pretty much any article you google as to why a low level of inflation is good or better than zero:\n1. If deflation is expected consumers will defer purchases to when products are cheaper, reducing economic output. Related to #5\n2. Debt financing is an important part of the capital system, deflation discourages borrowing\n3. Stuff gets better over time, and is made cheaper over time, so it should cost more.\n4. Equity financing is important because you want capital “invested” not stuffed in a mattress.\n5. Deflation results in a downward spiral,  people spend less,  business produce less and hire less, suppressing demand,  making people spend less, making business produce less,  etc. the upward spiral of increased demand is better.\n6. The government needs to be able to spend money it doesn’t have in times of war, etc.\n \n\nI have thought a lot about this and I’ve decided this is what I think of each of those reasons (my armchair opinion and sorry for the novel): \n\n1.  This is only true for discretionary spending,  if I knew my dollars would be worth more tomorrow, I’d still have to eat, pay rent, drive to work, etc. today.  Deflation harms borrowers and spenders, and vice versa. Inflation harms savers and lenders. And vice versa.\n2.  Debt financing includes a reasonable expectation of inflation or deflation.  You may be willing to lend at 1% if you expect 3% deflation,  or lend at 6% if you expect 2% inflation.  Same real return to you. Either way, debt markets would be capable of addressing this; they assign a premium to the debt when the stated rate is too high relative to deflation or lack of inflation or risk. In this way, you can still issue debt in a negative interest rate environment.\n3.  If stuff gets better and cheaper over time,  why shouldn’t the consumer have that benefit? I see no reason why the government should devalue currency for this?  Also,  chicken, flour, and gasoline, have not improved since 1957, but cost 10x as much?  Why are TVs always trotted out as the sole example?  Cars are better, sure, but 10x better?  Absolutely not. \n4.  In a defLationary environment,  the expected return on equity would likewise adjust as debt does.  If the risk of your business means I should earn a 10% return,  then I should get 8% if I expect 2% deflation and a full cash return of capital.  If instead, as many investments do these days, return only in capital gain and appreciation of the business, then the value of the business should increase by 12% per annum. If Hence why the markets PE ratio is so high during periods of high inflation,  investors are willing to take a lower return since holding cash is a negative return.\n5. I find this completely idiotic as an explanation, though it’s probably the most common given.  The idea that business will produce less because nominal prices are falling is as ridiculous as saying they are producing more when prices are rising,  no!  The value expressed in monetary terms changes,  but the actual inflation/deflation adjusted production remains the same.  Also, even if they do “and hire less workers” non discretionary spending is quite inelastic.  Also, if prices are falling consumers will demand a higher quantity, pushing prices back up.  The downward deflation spiral is a dumb argument, and has only happened once in the US due to the Great Depression, the causes of which were multiple and mostly due to government interference.\n6.  Government can always borrow money like the rest of us.  Inflation is just a wealth tax except it’s regressive as all hell, since the wealthy have the means to allocate their wealth to investments and us poors keep a lot of our wealth in cash (proportionately) to survive our paycheck to paycheck lives.  Also,  investment values move with inflation, mostly, so it floats the wealthy boat.  Salaries are sticky and do not move well with inflation, so it swamps the poors canoes. \n\nIn my opinion the 2% inflation target is nothing more than the government saying it’s going to reduce the debt on its balance sheet by 2% per annum, and also the cash in your pocket. It might do that at 10% per annum when it’s politically expedient, like it has been for the last 2 years or so.", "score": 1, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Watermelon flavored?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Because when your money is fake, you print more every year, and not backed with anything of value, 0% is unachievable.", "score": 8, "replies": [{"body": "You know there was still such thing as inflation before the gold standard was dropped, right?", "score": 2, "replies": []}]}, {"body": "Because Deflation is way worse than Inflation. The 2% are something like a \"safe space\". Furthermore a mild form of inflation is often seen as a good indicator of a growing and well-running economy.", "score": 5, "replies": [{"body": "It's just scary and sad how many people have been simply brainwashed by this fucked up system", "score": 3, "replies": []}, {"body": "Deflation worse than inflation? Lmao", "score": -3, "replies": [{"body": "Lol Japan and the lost decade says hi", "score": 10, "replies": [{"body": "🤫 that would mean that some people need to learn from other countries", "score": 2, "replies": []}, {"body": "And… can you ellaborate on how that impacted the lives of Japan’s citizens? Because the country was functioning perfectly during the deflationary period.", "score": -1, "replies": [{"body": "Lol are you for real? Go and Google and see for yourself what was the impact you regard. You gotta pay me if you want me to teach you econs.", "score": 5, "replies": [{"body": "Oh… I’m shocked… you are unable to articulate an answer. What a surprise.", "score": 0, "replies": [{"body": "This is a Wendys regarded idiot", "score": 1, "replies": []}]}]}]}]}, {"body": "As soon as deflation hits, it’s a psychological problem and not a monetary problem anymore. Way worse to get hold on.", "score": 2, "replies": [{"body": "Sorry but people these days are not going to wait 6 months to buy a new “widget”. Deflation will mean lower prices for a period of time.", "score": -1, "replies": []}]}, {"body": "Yes. When people start hoarding money the economy declines. Deflation leads directly to money hoarding. \n\nIt also devalues all produced items, which reduces creation of wealth. Deflation is bad.", "score": 2, "replies": [{"body": "Not sure about you but I would love to have hoard cash to buy lower priced assets/widgets", "score": 0, "replies": [{"body": "Those assets would lose money in a deflationary economy. Widget makers would make fewer widgets to create false scarcity.\n\nEvery other part of the economy and supply chains react to deflation. \n\nFurther, the wealthy just get to sit on their hoard to become more wealthy. They would have no reason to invest in assets or widget makers, resulting in you having more wealth and no way to use it. In short it kills all economic congress.", "score": 5, "replies": [{"body": "If you bought those assets at an elevated level. Yes. For those savvy investors it’s a huge opportunity. But I forgot this is wsb, nuttin but regards here", "score": -4, "replies": [{"body": "All assets would decline. \n\nSimple hypothetical. \n\nYou make $10 @ the widget factory. 5% deflation. The factory owner is going to reduce your pay to 9.50, so he keeps the additional .50. You make less, he makes more. While your money goes further, overall wealth become concentrated because why would the widget factory owner pay more? Over the long haul, wealth becomes concentrated and stops flowing, resulting in a dying economy.", "score": 2, "replies": [{"body": "Trouble is that he doesn't make more because he has to lower his prices to keep selling the item and demand wanes as people wait for lower prices he has to sell them even cheaper to stay in the same place.\n\nDeflation is a bad cycle and one of the only places that can step-in is the govt to increase their spending but pretty much every country in the world is carrying a substantial debt load and has been increasing their debt even in times of plenty.", "score": 3, "replies": [{"body": "If it's a luxury widget, you're correct. If it's a basic necessity, then multiple other factors can come in to play. Overall, deflation cools the economy and hurts everyone except the very top.", "score": 2, "replies": [{"body": "It hurts everyone because the people at the top own substantial all of the means of production and if those means are losing money then they feel it too.\n\nBut deflation/inflation are complicated subjects that even all the money in the world have difficulty modeling and predicting.", "score": 2, "replies": []}]}]}, {"body": "Wages don’t reduce, you may get fired. If you can’t be profitable making a product then your competitor will", "score": -1, "replies": []}]}]}]}]}, {"body": "There will be a point where people will deploy that cash so just like market tops it would be good to have another bottom. The housing crash was great to buy assets at deeply discounted prices.", "score": 1, "replies": [{"body": "Why? Deflation means their costs continually decrease. What is their incentive to deploy an ever increasing cash hoard?", "score": 2, "replies": []}, {"body": "The argument “prices go down so businesses produce less”, as stated several times by others, ignores the fact that lower prices spur more demand.  It’s a ridiculous argument, but like you,  I can’t get anyone to see it.", "score": 1, "replies": [{"body": "It’s not. There’s no urgency for anybody to buy something unless they absolutely need it because price is expected to fall. \n\nIf you can wait you will want to wait, which is why it’s a deflation cycle that is extremely detriment to consumer spending. \n\nWhy buy a iPhone 13 for 1k now when you can buy iPhone14 1 year later for 900?\n\nI mean, if you are regarded enough to think somehow you saw the light and understand economics more than global central bankers….", "score": 0, "replies": [{"body": "You think global central bankers know what they are doing? Lmfao. If destroying the dollar and creating inflation is understanding economics they know it all. Other than that they have never called a recession in their existence because they create them. Transitory inflation? Lmfao. There is no housing bubble. Lmfao", "score": 0, "replies": [{"body": "Honestly, I trust them to do what they are paid to do more than a regarded person like you. \n\nImagine thinking your broke ass with subpar education knows better than central bankers lol.", "score": 0, "replies": [{"body": "You trust the federal reserve and central bankers?! Lmfao. You are the biggest regard here.", "score": 0, "replies": [{"body": "Alternative is to trust you? Go fuck yourself you dumb regard.", "score": 1, "replies": [{"body": "You’re already getting ass fucked by Powell and you aren’t even trying to clinch your butt hole. Haha. Fuck you douche bag.", "score": 1, "replies": [{"body": "Lol speak for yourself. Volatility is good for business. ![img](emote|t5_2th52|4641)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You can’t explain it to regards…", "score": 1, "replies": []}]}]}]}]}, {"body": "Wow, this sounds like you were barely listening in macro101. Furthermore you write like you’re 12 LOOOOOOOOOL.", "score": -3, "replies": []}, {"body": "Only if the population remains ratively stable / doesn't massively inflate with the dollar and the dollar remains local. If the population declines or the population exports more money overseas than it produces (imports) from overseas inflation is horrible as there's less currency in circulation, thus the printing begins and the inflation goes up and...", "score": 1, "replies": []}]}, {"body": "In order for them to control us, they must control the currency.  All recessions are man made results from money printing.", "score": 4, "replies": [{"body": "Once they control your money, think social security and our healthcare think Obama care and Medicare for all and when they control the food, think  Green Farming or farming without fertilizer then they control us.", "score": 1, "replies": []}]}, {"body": "Because if you have deflation your incentive to spend is zero and save is 100%\n\nThat is no bueno for growth and our jobs", "score": 2, "replies": []}, {"body": "They need to destroy the money printer and go back to the GOLD std. \n\nOtherwise you are spot on....they print and blow bubbles and then they stop and pop bubbles.", "score": 0, "replies": [{"body": "Need to declare the federal reserve as a criminal organisation and forgive the dollar debt so $1 goes back to $1\n\nOr put a massovely lowered ceiling on tax deductible donations to charities so the big money doesn't just pass it around to their friends who employ their friends...\n\nBut that will never happen, why hamstring your scam\n\nOr you know, abolish income tax as it was intended to be a short term thing to support the war.", "score": 1, "replies": []}]}, {"body": "A low inflation devalues your money and gives you an incentive to spend it instead of hoarding. This in turn drives economic growth and innovation. Think about it that way. A rich af person wouldn't invest in the stock market or anything if they could just keep their money forever and it wouldn't lose value. With 2% inflation money loses 25% of it's value in 15 years. So a multi millionaire cannot just sit on their money for 30 years.", "score": 1, "replies": [{"body": "This is correct until you realise most of the money leaves the country (hi global econony) and doesn't actually feed back into the local community or government so nothing really improves.\n\nIt's great for countries where the money goes to though.", "score": -1, "replies": [{"body": "It doesn't actually change anything at all. Dollars in a tax haven still lose the same value to inflation. I don't know what point you're trying to make besides \"government/corporations bad\" which I agree with but it has nothing to do with the topic at hand.", "score": 2, "replies": [{"body": "Depends what currency those dollars are stored in friend.\n\nThe point been removing money from an inflating economy leads to reduced overall average wealth.\n\nLets say you and I have all the money. We both have $50.\n\nWe print another $50 and give it to a third person. (Cough Stumulus check cough)\n\nWe've devalued our dollar massively. That person exchanges it into another currency removing it from our local inflated economy. The currency it is exchanged into benefits from our inflation as it just recieved income. Our currency remains devalued from inflation and our economy massively reduced because inflation failed to retain the printed money.\n\nThe FUN part is if this exchange happens before the report of money been printed and related adjustment (Cough Venezuela cough) the person exchanging currencies can buy back in post adjustment and make sooooo much free money.", "score": -1, "replies": [{"body": "This is a ridiculously wrong view of inflation lmao. Inflation is not \"total amount of money in an economy.\" It's not even just velocity of money, which you failed to mention. Inflation is an increase in prices relative to period of time prior. Inflation indices weigh different items at different amounts, ie rent, gas, electricity, food, etc. to create a composite value that is used as the general inflation amount.\n\nJust saying an economy with $100 gets $50 more is not a 50% inflation. It could be 0 inflation if the guy puts it under a rock or, you know, swaps it into another currency and those people don't spend it. Adding $0 to the economy could lead to massive inflation if political turmoil or supply crunch occurs, as sellers raise prices to account for uncertainty and/or limited goods availability. This is why inflation is so high in the US right now, not because some poor people got an extra $1200.", "score": 2, "replies": []}, {"body": "Like is this a theory you developed or I don't understand? Do you have an actual example to explain what you mean because I don't like talking about concepts if they actually aren't concepts. If you want to make an argument about stimulus checks it really doesn't matter in the conversation about why a 2% inflation rate is desirable. You think super rich people and companies gambling massively on FX moves. You know that you can do the same even with massive leverage. It's not that easy to move money in and out of a country without triggering massive taxes if you didn't know that. How companies do that is quite a complex structure and leaves them with funds that are not easily accessible.", "score": 1, "replies": []}]}]}]}]}, {"body": "Would you save money in the bank for 0%, and would you be happy to work a job that gives you a 0 payrise each year.\n\nWe all need a little incentive and that's the 2%.", "score": 0, "replies": [{"body": "But wages aren't keeping up with inflation since the 70s", "score": 4, "replies": []}]}, {"body": "Crime. Do the math.", "score": 0, "replies": [{"body": "Mind blown", "score": 1, "replies": []}]}, {"body": "It’s all part of the Great Reset.", "score": 0, "replies": []}, {"body": "Because economists are Keynesian cucks.", "score": 1, "replies": []}, {"body": "Fed pops the bubble it creates after Powell took out his millions", "score": 1, "replies": []}, {"body": "0% honestly is not a good thing for the poor and middle class. Becuse the super wealthy can get 0% loans while the rest pay interest making a larger gap between the working class and elite. Also higher interest rates give the dollar more value. But the upside to 0% interest rates is it allows American corporations to grow. Like Tesla for example.", "score": 1, "replies": []}, {"body": "That's why: https://www.nytimes.com/2014/12/21/upshot/of-kiwis-and-currencies-how-a-2-inflation-target-became-global-economic-gospel.html", "score": 1, "replies": []}, {"body": "If there is 0 inflation, there wouldnt be as much upside to putting money into venture, stock market, etc etc, cuz you wouldnt have people trying to beat inflation, which leads to a less competitive environment", "score": 1, "replies": []}, {"body": "The target should be 4% because it encourages spending which helps keep unemployment low.", "score": 1, "replies": []}, {"body": "They want some inflation cushion against the absolute worst thing for the economy, deflation.  Our economy is 70% based on consumer spending.  Imagine if a vast majority of people stopped spending money on most things besides staples, waiting for a lower price…….  That would crash the economy faster that anything else!!!", "score": 1, "replies": []}, {"body": "Them tryna avoid lowering prices deflation cuz tryna avoid Great Depression. 2% is a buffer, target was 0-2%. Them changed to target 2% prolly cuz inflation is very high and 2% is a nice round number", "score": 1, "replies": []}, {"body": "Economic major here - Slight inflation encourages spending, and a healthy economy of spending. Your cash money will become slightly worth less, so this encourages you to use the cash for spending.\n\nHaving a zero inflation is problematic because it puts you in a \"Zero Nominal Lower Bound\" and cause problems and impact effectiveness of one of Fed's key toolset. This is exactly what happened in Japan. Having a healthy inflation rate gives the fed a little wiggle room to lower interest rate when economy needs.", "score": 1, "replies": [{"body": "I’m no expert, but wasn’t the lost Japanese decade precipitated by the bursting of an asset bubble that was caused by expansionary monetary policy?  It’s my understanding that a large part of that lost decade was due to the time it took for the banks to unwind toxic assets without total collapse after said bubble?  Maybe that took long enough that their generational shift in demographics took hold and they could no longer depend on population growth as a means of expanding real gdp?  Also,  I believe nominal GDP in Japan rose slightly faster than real GDP over the lost decade, so wouldn’t that mean that they did in fact have mild inflation subsequent to the bubble burst?  Not trying to be argumentative but the anti deflation arguments seem to be centered around two main examples,  the Great Depression and Japans lost decade; both or which were immediately preceded by both massive and rapid asset appreciation and also government intervention in the market.", "score": 1, "replies": [{"body": "You may be right. I’ll have to look into this a bit more. Never really studied Japanese economy other than the zero bound. I’ll look into it for my weekend reading! Thanks for the insight!", "score": 1, "replies": [{"body": "Let me know what you find out, I’m curious.  I’m in finance but not an economist except in the armchair sense.", "score": 1, "replies": []}]}]}]}, {"body": "![img](emote|t5_2th52|4258)", "score": 1, "replies": []}, {"body": "🥝🥝", "score": 1, "replies": []}]}
