{"title": "Coinbase shares soar 26% in boost from meme traders, BlackRock crypto deal", "selftext": "", "id": "wg1qhq", "created_utc": 1659620920.0, "score": 430, "upvote_ratio": 0.81, "num_comments": 87, "comments": [{"body": "Lol didn't Cathie wood sell like millions of shares like, last week too ahaha", "score": 160, "replies": [{"body": "Up 75% since then.... damn", "score": 99, "replies": [{"body": "That's a big rip LOL", "score": 32, "replies": [{"body": "Not when it's the people's money fed thru ETf", "score": 3, "replies": []}, {"body": "That Bruce Jenner look alike", "score": 3, "replies": []}, {"body": "One of us", "score": 1, "replies": []}]}]}, {"body": "Inverse Cathie, Inverse Cramer. Launch the ETF!", "score": 19, "replies": [{"body": "Fortunately SARK already exists!", "score": 6, "replies": [{"body": "Sark is going to get wrecked though.  Ark still owns Coin so it is getting some of this upside.\n\nSome of the companies are good companies that will come back.", "score": 4, "replies": [{"body": "But enough to carry all the bad ones?  Doubt", "score": 1, "replies": [{"body": "ARKK was up today while market is down.", "score": 1, "replies": []}]}]}]}]}, {"body": "hhahahahahahaha", "score": 2, "replies": []}]}, {"body": "From meme traders? What a shit headline", "score": 327, "replies": [{"body": "Everything what is happening are Meme Traders. Yea we Meme Traders Pump companies to Billion Dollar Market Caps.\n\nSure retail has absolutly that Money and the coodination to do so /s", "score": 110, "replies": [{"body": "I find joy in reading a good book.", "score": 42, "replies": [{"body": "You still have meme money, I used my on our last pump", "score": 6, "replies": []}]}, {"body": "Pretty sure meme trader is just now code for we doing some illegal shit don’t look though because it’s just a dumb meme stock. $HKD was apparently meme traders too, except the same meme trader haven’t been able to do jack shit with AMC and GME with over year of continuous buying … honestly, fuck finance media and fuck the assholes that pay them to pump out this non sense.", "score": 15, "replies": [{"body": "Makes too much sense fr", "score": 2, "replies": []}]}, {"body": "In a recession no less.\n\nOh wait THERE IS NO RECESSION", "score": 4, "replies": []}, {"body": "Probably Kenny trying to blend in.  “Hello fellow retail investors” 😒", "score": 2, "replies": []}]}, {"body": "It's literally what people just call stocks they personally don't like. \n\nHad a dude at work tell me memers were investing in Rivian because they want it to be Tesla.", "score": 42, "replies": []}, {"body": "Lol I was gunna say the exactly same thing. Meme traders are not pushing massive pre Market volume. What idiot wrote this?", "score": 6, "replies": []}]}, {"body": "Media outlets now have reddit subs to forever blame any sort of anomaly that occurs in the market for the rest of time, amazing", "score": 83, "replies": []}, {"body": "Bullshit, Retail don't want none of Coinbase, Stop spreading Lies!", "score": 180, "replies": [{"body": "Coinbase - aside from being a poor value proposition - is a vile company with shitty management.", "score": 52, "replies": [{"body": "Basically the corrupt institutions trying to do the same with crypto with what they are doing with shares, fucking leeches", "score": 28, "replies": []}]}, {"body": "Dogs from Wall Street must be punish. $COIN is a rubbish. I lost 25% of my money because this junk jumps on news about bigblackrock. 10$ per share is a fair value", "score": 7, "replies": [{"body": "Blackrock jumped the stock on news about Blackrock...all 3 Vanguard,  Citadel are the 1s running the spoof programming to steal from us.", "score": 3, "replies": []}]}, {"body": "But they need retail to buy or they can't make money. 🙄", "score": 2, "replies": []}]}, {"body": "Boost from Meme traders? You must be entirely *redacted* to think retail can compete with high frequency hedgefunds in effecting the short term market AT ALL.", "score": 42, "replies": [{"body": "Great point", "score": 2, "replies": []}]}, {"body": "How convenience, just relate every stock that jumped xx% to meme traders", "score": 75, "replies": [{"body": "Meme Traders have billions of Dollars, of cause they coordinate Pumps \n\n/s", "score": 9, "replies": []}]}, {"body": "msm seems to be getting too much hang on their bullshit blaming memestocks again. Fools", "score": 17, "replies": []}, {"body": "Is anybody else sick of the SEC and financial media belittling the retail investor by calling it a meme stock and then also affixing the meme label to anything suspect they just want to hand wave away by blaming redditors?", "score": 50, "replies": [{"body": "If I’m a company with a stock I’m pissed regulators are calling my company shares “meme” and possibly looking into legal action. \n\nThe governing regulators are basically saying your business/stock isn’t serious.", "score": 14, "replies": [{"body": "Yeah, sue em! That’ll teach them!", "score": 1, "replies": []}]}]}, {"body": "Down 14% today so far... $106 to $90", "score": 25, "replies": [{"body": "Still up ~16% from yesterday's close.", "score": 5, "replies": [{"body": "Still down 62% YTD and down 72% all time. Not saying I won't buy at some point", "score": 14, "replies": [{"body": "Oh, I'm by no means a COIN booster. I doubt I'll buy at any point. Just offering a different way to look at today's activity.", "score": 3, "replies": []}]}]}, {"body": "Headline came out at 8:00, PA didn’t hit til 8:50 after the cnbc pump. One of the more logical shorts.", "score": 1, "replies": []}]}, {"body": "Whole market is a meme now", "score": 6, "replies": []}, {"body": "Inverse Cramer excels once again", "score": 3, "replies": []}, {"body": "I’m officially broken even in Coinbase. Bought my first shares at $230; bought the “dip” at $130; then bought the next dip, heavier at $60s… \n\nWe’ll see if it can stay around these levels", "score": 3, "replies": [{"body": "There’s a ton of hate on the stock in this thread but I thought it was a decent business model honestly. They make money regardless of which new hype coin is running. I don’t know much about management though but on the surface they look like an industry leader in a young space", "score": 3, "replies": []}]}, {"body": "Speculation is back on the menu boys!", "score": 3, "replies": []}, {"body": "Why does it always have to be “meme traders?”", "score": 3, "replies": []}, {"body": "I'm convinced you can make a bogus stock move claim with no correlation and people would eat it up.\n*Dogecoin SOARS 2% on news of Biden shitting the bed!*", "score": 3, "replies": []}, {"body": "In this context meme seems to mean Black rock manipulation, so, its true, I guess?", "score": 3, "replies": []}, {"body": "They’re blaming us for AMTD, HKD, and now this?\n\nIs this the best you have to smokescreen your illegal pumping?\n\n#LMAYO", "score": 3, "replies": []}, {"body": "“Meme media” thats what it is.", "score": 10, "replies": [{"body": "Memedia for short", "score": 5, "replies": []}]}, {"body": "Smooth market function", "score": 4, "replies": []}, {"body": "Not your keys, not your crypto.   Be your own bank", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Proof?", "score": 1, "replies": []}, {"body": "Actually she sold most of her COIN", "score": 1, "replies": []}]}, {"body": "That and the cathy woods haters know that she sold so it's time to pump it =p", "score": 2, "replies": []}, {"body": "Waiting for this hype to die and will be picking up some shares. Crypto will be back and therefore this stock will do well.", "score": 2, "replies": []}, {"body": "If anyone needed to know or be reminded that the dream of crypto is dead this is all you need. Blackrock is a predator, you don’t allow them inside at any cost.", "score": -3, "replies": []}, {"body": "https://blog.coinbase.com/coinbase-selected-by-blackrock-provide-aladdin-clients-access-to-crypto-trading-and-custody-via-b9e7144f313d", "score": 1, "replies": []}, {"body": "I’m guessing that every stupid move is going to be credited to meme traders and retail investors", "score": 1, "replies": []}, {"body": "Anytime the institutions need cover for stock manipulation now they just label it as a meme stock", "score": 1, "replies": []}, {"body": "WHATS UP WITH ALL THIS MEME TRADER BULLSHIT", "score": 1, "replies": []}, {"body": "Take a look at $BRAH tiny float and new IPO yesterday, shorted on first day. This stock will pop to the moon any minute now!", "score": 1, "replies": []}, {"body": "Wallstreet Bets *chat room*?\n\nFucking geezers don't know what the fuck they're talking about", "score": 1, "replies": []}, {"body": "Thought meme traders were in that bullshit HKA stock or whatever the fuck", "score": 1, "replies": []}, {"body": "Wait, so COIN is a meme stock now?\n\nThe stock price shows no reflection from the company performance or actions or market?\n\nIs high volume the only metric used to determine a meme stock or not?\n\nI bought some COIN after the dip from the SEC announcement.  Does that make me a meme trader?\n\nBut the headline got the click from me that it intended to bait me with.  Just surprised it's from CNBC.", "score": 1, "replies": []}, {"body": "Fellow meme friends can you please tell me what our next coordinated purchase is please? I lost the paper with my notes on it…… /s for those that need help", "score": 1, "replies": []}, {"body": "The real reason is that Cathy wood dumped her holdings in COIN", "score": 1, "replies": []}, {"body": "Lmao “meme traders” cant move markets stop lying🤣🤣", "score": 1, "replies": []}, {"body": "Any good stocks to buy under 50 dollars", "score": 1, "replies": []}, {"body": "*stock goes up more than usual*\n\nStock news: meme traders boost stock \n\nNot everything is ‘meme traders’", "score": 1, "replies": []}, {"body": "So any big move in the market is just a meme trade now? Lazy.", "score": 1, "replies": []}, {"body": "A thought occurred to me. Could it be that those that ran up HKD cashed out and then pumped Coinbase?\n\nEdit: To clarify, I don't mean meme traders (bullshit). I mean whale fuckery.", "score": 1, "replies": []}, {"body": "This makes meme so mad", "score": 1, "replies": []}, {"body": "How come every time a stock gets gains it’s blamed on “meme traders”.", "score": 1, "replies": []}, {"body": "Oh I thought it was because of Lex Friedman’s Brian Armstrong interview lol", "score": 1, "replies": []}, {"body": "Why you posting this lying news network?", "score": 1, "replies": []}, {"body": "Lol. I never saw one fucking meme about cOiNbAsE. Fuck off media. This is sus af", "score": 1, "replies": []}, {"body": "She's getting both ways", "score": 1, "replies": []}, {"body": "Lost a lot of money because i fomoed and bought at the top. An advice to myself and people like me never chase a stock.", "score": 1, "replies": []}, {"body": "Can Coinbase be the new meme stock?", "score": 1, "replies": []}, {"body": "The power that these subs are having over the market is pretty incredible and hard to ignore how it is changing the ways of investing.  When do companies realize this and employ it as a service?", "score": 1, "replies": []}, {"body": "26% is a lot, but let's see how it goes in the near future. The market hasn't recover yet, even if some great layers 1 like Avalanche, Fantom, or even Kadena are performing well. We never know what will happen the market is unstable.", "score": 1, "replies": []}, {"body": "the buyers are total fucking suckers.  Coinbase is an absolutely horrible company.  Zero customer service.  Can't  keep crypto accounts safe from hacking.  Will be bankrupt within two years.", "score": 1, "replies": []}]}
