{"title": "$VXX is heavily shorted in last 2 months", "selftext": "$VXX is highly shorted by Barclays in last 2 months  When $VIX increased 17% last Friday, VXX Only increased 3%. It will be a huge shot-squeezed when VIX is over 27. Let's see", "id": "x0g6yk", "created_utc": 1661749647.0, "score": 0, "upvote_ratio": 0.22, "num_comments": 13, "comments": [{"body": "Yeah I don't think you know how the fund works my dude", "score": 14, "replies": []}, {"body": "You probably shouldn’t be trading this ticker", "score": 9, "replies": [{"body": "Check and compare the daily chart of VXX and VIX. You will found your great chance", "score": -1, "replies": [{"body": "You need to read about the current state of vxx. Barclays not allowing creations. Vxx is trading without regard to its holdings", "score": 3, "replies": [{"body": "They try to shot it to decrease it's price and buyback for its oversold stocks. However  VIX will bump above 30 in the next 7 days. It will be a great chance to shot squeezed. Let's see", "score": 0, "replies": [{"body": "What are you even trying to say? You’re unintelligible.", "score": 1, "replies": []}]}]}]}]}, {"body": "I somehow shit in my coffee while reading this post.", "score": 3, "replies": [{"body": "If you were OP you would have shot-squeezed into your coffee", "score": 2, "replies": []}]}, {"body": "what the fuck?", "score": 2, "replies": []}, {"body": "Vxx is a dead duck. Has been for six months now.", "score": 2, "replies": []}, {"body": "Please read this article about VXX. [https://www.bloomberg.com/news/articles/2022-08-15/-broken-barclays-etn-soars-to-33-premium-with-issuance-halted#xj4y7vzkg](https://www.bloomberg.com/news/articles/2022-08-15/-broken-barclays-etn-soars-to-33-premium-with-issuance-halted#xj4y7vzkg)", "score": 1, "replies": []}, {"body": "Some w.s.b shiii right here 😂", "score": 1, "replies": []}, {"body": "personally waiting for the spy short squeeze since they just had bad earnings", "score": 1, "replies": []}]}
{"title": "Advice: Sell BAC for VTI?", "selftext": "Serious ask - this seems like an obvious choice but want to make sure there aren’t things I’m not thinking about.\n\nI have 250 shares of BAC (all vested RSUs).\nQuarterly dividend: $54\n\nI have 150 VTI. Quarterly dividend: $114\n\nI am technically at a $600 unrealized loss with BAC and I don’t anticipate it ever climbing much more - historical high is ~$50.\n\nShouldn’t I sell all BAC and buy VTI?\n\nI have BBBY and other silly investments - this is more for long term growth.\n\nThank you!", "id": "x0wbbs", "created_utc": 1661798423.0, "score": 5, "upvote_ratio": 0.73, "num_comments": 13, "comments": [{"body": "I hate the financial sector at all times regardless of market conditions. Sell.", "score": 3, "replies": []}, {"body": "Banks don’t do well in recessions", "score": 3, "replies": []}, {"body": "Definitely.", "score": 2, "replies": []}, {"body": "I would try to \"bag hold\" BAC. It is a solid long term hold.", "score": 1, "replies": [{"body": "That’s what I’ve been doing but some of these shares are from 2014 and half of the amount vested at $46 so … that’s exactly why I’m on the fence.", "score": 1, "replies": [{"body": "can you continue to DCA your BAC shares?", "score": 2, "replies": [{"body": "I am not buying them, I’m getting grants annually. So I’d rather turn them onto something that’s going to have long term growth and pay better dividends.", "score": 3, "replies": []}]}]}]}, {"body": "I think BAC is going to outperform VTI, but if your goal is diversification, then selling BAC is the right move.", "score": 1, "replies": [{"body": "But BAC hasn’t every gotten past $50 in 16 years. VTI is a low end SPY $180.\n\nNot doubting what you’re saying - trying to be sure.", "score": 1, "replies": [{"body": "IMO, It hasn't outperformed in the last 10 because interest rates were mostly less than 1% the whole time.  That is no longer the case.\n\nEdit - I think the entire financial sector is going to outperform in the next 10.", "score": 1, "replies": [{"body": "Ok cool - thank you for that insight!", "score": 1, "replies": []}]}]}]}]}
{"title": "GLJ Research - The $TSLA bear case GordonJohnson details why he has a $22 price target (From $24)", "selftext": "", "id": "x1187p", "created_utc": 1661810450.0, "score": 0, "upvote_ratio": 0.3, "num_comments": 16, "comments": [{"body": "Gojo used to be funny, now he's just sad.", "score": 13, "replies": []}, {"body": "I don’t understand why everyone keeps giving this guy so much attention", "score": 11, "replies": [{"body": "I know, I'm sick of it.  It's like beating a dead horse, OK we get it, the guy is an idiot and just wants attention, let's stop giving it to him please", "score": 4, "replies": []}, {"body": "It’s like a car wreck.  Everyone needs to stare.", "score": 3, "replies": []}]}, {"body": "The only possible explanation is that this GJ is from a parallel universe where Tesla is failing/failed and this GJ's brain is still tether to his universe.\n\nMeanwhile our actual GJ is in the other universe with Tesla's valuations in the $$$$...", "score": 5, "replies": [{"body": "I love Tesla in every universe.", "score": 1, "replies": []}]}, {"body": "We're all fascinated by this buffoon.  Is he for real?  Does he actually believe what he's saying?  Or is this the only way he can make a living, getting paid to be the clown on those highly informative TV shows?", "score": 5, "replies": [{"body": "We’re getting free admission to the zoo/circus, don’t complain! He’s also buying time for us to load up more shares 😂", "score": 2, "replies": []}]}, {"body": "It’s a busted growth story.   Once you exclude al the sales they’ve had in the last year, it’s obviously that they aren’t actually selling cars.  \n\nBlah blah blah.", "score": 6, "replies": []}, {"body": "🤣🤣🤣", "score": 3, "replies": []}, {"body": "So I guess he’s borrowing billions to short the stock since he is so confident?\n\nOh wait.", "score": 3, "replies": []}, {"body": "lol\n\nAfter the next split it will be like 3.50\n\nHis price target makes sense in 2010", "score": 4, "replies": []}, {"body": "🤡", "score": 3, "replies": []}, {"body": "Thanks GJ, you make all tesla haters look like clowns.", "score": 2, "replies": []}, {"body": "![gif](emote|free_emotes_pack|facepalm)", "score": 2, "replies": []}, {"body": "Stop linking this clown", "score": 1, "replies": []}]}
{"title": "So, buying VIX Calls is also a way to-", "selftext": "[deleted]", "id": "x0rhh3", "created_utc": 1661786612.0, "score": 4, "upvote_ratio": 0.83, "num_comments": 10, "comments": [{"body": "Been using vix calls to hedge for about a year now.  A few thoughts:\n\n1. The extra margin only applies to PM margin.  If you have reg T you won't get that effect\n\n2. As a hedging trade your goal is for your vix calls to expire worthless. At best it's going to remove downside but the amount you are spending on the calls is guaranteed drag.  For that reason you probably want far otm and cheap.  I usually sell around $40 but I've seen other go even higher around $50.\n\n3.  The greeks of your vix calls make them seem less helpful for hedging then they really are.  They are positive gamma positions and as vix rallies closer to your strike the become more and more impactful.  So if you try to buy and just cancel out the Greeks from ur other trades you will end up over-hedged.\n\n4. There have been several days where VIX has moved in the same direction as SPX.  Vix is not the perfect 1:1 SPX hedge it usually has been in the past. Not a huge difference but sometime to look out for\n\n5. The main goal is to prevent your account from blowing up and u will probably still endure big losses if the market tanks.  The goal is generally just to avoid liquidation.  It's like wearing a bull-proof vest. If you get shot you will still be in immense pain and break a bunch of ribs but you will be happy to be alive", "score": 8, "replies": [{"body": "i have yet to see any real proof this hedging method is actually working. Many base their modeling on the 2020 drop which is a big mistake because that was a flash drop which is super rare.", "score": 6, "replies": [{"body": "I think hedging can mean a lot of things to different people but in my view its primary purpose is to save you in black swan events like 2020 or the 2010 flash crash.  \n\nIf the market is falling but it's more of a slow burn like 2008 or 2022 hedging with vix calls can help but it's not the best. You are long calls and if the market doesn't fall fast enough theta will fuck you.  The market may not fall fast enough for the vix calls. Additionally there will be plenty of time to manage trades and having an \"insurance policy\" is less necessary.\n\nThe place vix hedging really shine is during black swan events. If you're short naked options and aren't really careful a black swan can result in a margin call or even complete liquidation especially in a PM account.   Historically speaking the market always recovers but it doesn't matter if you got forced out of the trade at the bottom.\n\nGoing back to the bullet-proof vest analogy the goal is not really to avoid injury. The goal is to do enough to prevent death and live to fight another day.", "score": 2, "replies": [{"body": "fair point\n\nhave you done any modeling on 2020?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Imo selling SPX calls is a very different way to hedge with a totally different objective.  They are going to bring in some extra premium and help on the downside but the protection provided is limited to the premium.\n\nIf the goal is to cut down on losses, absolutely selling calls can help.  However in the event of a black swan otm vix calls or spy puts can save your account whereas the calls are going to do much.  You'd need to be really aggressive about rolling down your call as the market drops and that could expose you to getting whipsawed hard if the market recovers.\n\nOne thing to keep in mind here are the Greeks for your overall portfolio. Say you have an account where you just run theta strats.  That will almost certainly mean you have significant negative gamma and vega exposure.  \n\nIf you bought vix calls or spy puts and the market drops those long options are going to provide significant positive gamma and vega exposure which will help balance out your portfolio and hedge all of the Greeks.  If you're selling SPX calls that is just additional negative gamma and vega no matter what. You'll be hedging delta but not the other Greeks.  \n\nIn the event of a black swan delta is still important but the importance of volatility expanse matters a lot as well.  Vix calls will print more and more as volatility expands to counter the increases in CSP requirements.  Short calls will only make that problem worse", "score": 3, "replies": []}]}]}, {"body": "One danger is that VIX calls correspond to the same dated /VX futures contract.\n\nEven when VIX spikes from 22 to 34$, the longer dated options may only pop 1-2$ so you won't be getting the hedge you want.\n\nThis can be alleviated by buying closer to expiration calls.", "score": 3, "replies": []}, {"body": "Also curious and looking into this at the moment - not because of the recent down move (although it did outline the need!) but because my Wheel strategy is inherently bullish and it's something I've had on my todo list for a while.\n\nI bought calls in SPXS which didn't really do what I was looking for, even in the down move, everything else gets crushed and the hedge didn't really come through like I was hoping.\n\nI've also thought about just using less buying power over all (to free up capital to average down or make other opportunistic moves in a large correction) or potentially buying deep OTM puts when I'm selling the put for the Wheel as a \"cheap\" almost lottery ticket that could pay me if things go haywire and would be partially paid for when I sell the original put.", "score": 3, "replies": []}, {"body": "could hedge your portfolio with /ES shorts, weighted so your overall portfolio is \"beta neutral\". then you're \"protected\" from up and down moves, but only earning theta (which might be good enough for high volatility times).\n\nkind of a pain to do correctly, personally i'd just hold SPYC or some ETF that best matches the strategy i would be doing anyway.", "score": 1, "replies": []}, {"body": "VIX calls work great when there is a violent drop in the market. There hasn't been a bottom in a bear market where VIX hasn't hit 45. The reality is it may be really hard to time that so you buy when VIX is low (under 20) and sell when over 25-30.", "score": 1, "replies": []}, {"body": "We must join the European Hedge and Pension funds in the mass shorting of UVXY and UVIX etfs. Short UVIX shares and sell UVXY calls. Stay bullish and prosper (not financial advice)", "score": 1, "replies": []}]}
{"title": "Bloomberg on meme stocks", "selftext": "(Bloomberg) --Wall Street says the meme stock is here to stay.\n\nBorn of lockdown boredom, no-fee brokers and social-media chatrooms, the phenomenon drew in a new generation of traders, who fueled massive rallies by banding together to pump up the stock prices of companies Wall Street was betting against. \n\nIt had all the elements of a flash-in-the-pan trend, especially with the speculative excesses giving way to a bear-market beating. Yet Wall Street professionals and individual investors think it will become a permanent part of the market landscape: Nearly two-thirds of the 522 respondents in the latest MLIV Pulse survey expect some version of the meme stock mania to stick around. \n\nThe meme movement has added volatility into corners of a market already contending with rising interest rates, recession risks and a steep drop from the record highs. That was on display this month with Bed Bath & Beyond Inc. and AMC Entertainment Holdings Inc., two meme favorites, both surging, only to give back the gains just as quickly.\n\n\n“We see community aspects within meme stocks, so as long as investors create community and access, they’ll find their way into meme stocks,” said Callie Cox, US investment analyst at eToro. “Meme stocks are just another way that retail investors are getting engaged with the market.”\n\nSpeculating in meme stocks has been painful this year. Even the coordinated efforts have been no match for a rout that’s battered individual-investor picks like high-growth technology stocks and cryptocurrencies. A basket of 37 retail-trader favorites tracked by Bloomberg is down nearly 40% in the past year.\n\nWall Street professionals are split on whether the market won’t hit a bottom until individual investors withdraw their support by becoming net sellers of stocks. The group has recently pushed $1.2 billion per day into US-listed securities, according to Vanda Research, below its expectations for a $1.3 billion to $1.4 billion influx. With the S&P 500 off its mid-month highs, that signals a potentially diminished appetite for buying such dips. \n\nThe retail trading crowd faces “a crucial inflection point as summer draws to a close,” according to Vanda analysts. \n\nThe MLIV Pulse survey found that while the meme-stock phenomenon is likely to stick around, 69% said it’s unlikely to see the trading volumes it did during its January 2021 height. Nor are such stocks seen as a good bet for the remainder of the year.\n\nWhen asked whether [investment type not permitted on this sub], meme stocks or so-called blank check companies known as SPACs would provide the best value over the next six months, 51% of respondents chose [that one] and 32% SPACs. Only 17% favored meme stocks. \n\n\nNevertheless, the run-ups in some meme stocks have provided a financial lifeline to certain companies, allowing them to raise funds by selling shares or tapping lines of credit. Bed Bath & Beyond is in talks with Sixth Street Partners for a new line of credit, Bloomberg reported, citing people with knowledge of the private discussions. \n\nThe stock advanced from $4.5 to $23 in a rally that ended on Aug. 17, but since then, the shares lost more than half of the value. The retailer will host a conference call on Wednesday to address plans to drive growth and strengthen its balance sheet.\n\n“Memes come and go quickly, same thing goes with these prices,\" Jaime Rogozinski, founder of the popular online stock-market chat forum WallStreetBets, told Bloomberg TV. \n\nWhile the presence of meme stocks is something investors will keep an eye on, they were mixed on whether its volatility poses a risk to the broader market. Fifty-seven percent said it doesn’t, with 43% saying the opposite. \n\n“Meme stock trading won’t have enough money backing long substantial moves that dictate longer-term trends, but become more of a pump and dump trade,” said Ed Moya, senior market analyst at Oanda. \n\nIn a gauge of broader market sentiment, more than half of the respondents said they expect US Treasuries to have a better volatility-adjusted return over the next month than US stocks.", "id": "x0aluo", "created_utc": 1661732894.0, "score": 17, "upvote_ratio": 0.74, "num_comments": 18, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|21|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x0aluo)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x0aluo)", "score": 1, "replies": []}, {"body": "Market won't bottom until we meme stock traders sell.... wtf lol..", "score": 19, "replies": []}, {"body": "So meme stock = pump and dump… I see…\n\nExcept, I am still holding GME.", "score": 12, "replies": []}, {"body": "lol 3 \"once in a lifetime\" economic meltdowns in just over two decades.. Yea, BOREDOM is why we're here gambling. 🤡", "score": 19, "replies": []}, {"body": "More like a bowel movement you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}, {"body": "Why are they still quoting that loser?", "score": 8, "replies": [{"body": "It’s on Bloomberg, not Michael Bloomberg himself", "score": 3, "replies": []}]}, {"body": "Lol it’s born from short sellers selling more stock of a company they do not own than is available to buy, not “lockdown boredom, no-fee brokers and social-media chatrooms.”\n\nMeme stocks have been around since the invention of short selling.", "score": 8, "replies": []}, {"body": "Chat rooms ?!? Lol tell me you cater to boomers without telling me to cater to boomers", "score": 2, "replies": []}, {"body": "I hope there will be more rallies!!! Please let there be more rallies! I need there to be more rallies.", "score": 4, "replies": []}, {"body": "This ain't no movement you fuckin mouthbreather. Trading is not a team support.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "thou protest too much, bot", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 1, "replies": []}]}]}, {"body": "Typically misleading take.  A better term is probably viral than meme anyways.   There have always been stocks that rapidly captured retail investors interest and speculation for  a wide variety of reasons.", "score": 0, "replies": []}, {"body": "Hey, do you have a source? Please add a link in the post or as a reply to this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "fuckin tards cut out a corner of the market that is an idiot check for unfettered greed.   \nThat's fuckin hilarious.", "score": 1, "replies": []}, {"body": "If meme stock mania means we'll buy stuff retardedly then yes it will never end until every single child in our lineage has expired.", "score": 1, "replies": []}]}
{"title": "How to go broke this coming September", "selftext": "Every move I've made in the last few weeks has failed. Here's my play for September. Follow me if you want to go broke:\n\n1) Load up on oil/energy stocks tomorrow\n\n2) Sell those stocks end of September and go all in on TSLA", "id": "x0c6i5", "created_utc": 1661737441.0, "score": 29, "upvote_ratio": 0.86, "num_comments": 13, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 week ago\n**Total Comments**|20|**Previous DD**|\n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x0c6i5)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x0c6i5)", "score": 1, "replies": []}, {"body": "Cramer, is that you...", "score": 8, "replies": [{"body": "Son of Cramer™", "score": 5, "replies": []}]}, {"body": "Let's inverse!", "score": 12, "replies": []}, {"body": "i guess even if I inverse you I would still end up losing. that being said, I would follow your advice ![img](emote|t5_2th52|8883)", "score": 3, "replies": []}, {"body": "Jesus Christ, no wonder you lose. It’s like you hate money.", "score": 3, "replies": []}, {"body": "Sir I follow your financial advice", "score": 2, "replies": []}, {"body": "Can I has loss porn? ![img](emote|t5_2th52|12787)", "score": 1, "replies": [{"body": "$3,000 up today. Will probably lose it tomorrow.", "score": 2, "replies": [{"body": "Great. I also like it when my fellow regards make money 🤌", "score": 1, "replies": []}]}]}, {"body": "Another fun way is to ask how to get 100x leverage and then buying 0dte spy calls. NFA", "score": 1, "replies": []}, {"body": "Why would you go all in on TSLA at the end of September?", "score": 1, "replies": [{"body": "Because TSLA is the future and OIL is not", "score": 1, "replies": []}]}]}
{"title": "Expectations and inflation", "selftext": "[deleted]", "id": "x0digl", "created_utc": 1661741286.0, "score": 8, "upvote_ratio": 0.78, "num_comments": 11, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|1 week ago\n**Total Comments**|30|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x0digl)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x0digl)", "score": 1, "replies": []}, {"body": "Apparently drought in China is causing problems with hydro generation and even causing some momentary factory shutdowns. I'm not sure we've seen the end of supply chain issues though they're certainly less worse than they were.\n\nFed balance sheet is starting to roll off for reals too.\n\nI agree sentiment around midterms but market may not have a choice.", "score": 5, "replies": []}, {"body": "Inflation was not caused by too much spending..... Yeah Ok.", "score": 3, "replies": [{"body": "Record savings check the data\n\nhttps://www.washingtonpost.com/business/2022/02/23/savings-bank-accounts-covid/\n\n Before the pull back and Biden fucked oil\n\nEdit: Now if you mean federal.. okay can see both sides", "score": 1, "replies": []}]}, {"body": "I don’t see us crashing now. Not before midterms. I think we’ll see a correction for the last 2 months of super vertical price action, then a return to green. My thoughts are this week being flat/red. Next week being flat/red. Then a return to green.", "score": 3, "replies": [{"body": "Yep, red September as usual. I actually just edited to include the elections. I see that as well", "score": 1, "replies": []}, {"body": "Yup that’s what I’m reading also…..Sept CPI print will confirm August wasn’t an outlier and market will rally! Elizabeth Warren putting a shot across Powells bow means Fed will soften the language. I think we are still over valued but market could go quite bullish for second half of Sept!", "score": 0, "replies": []}]}, {"body": "Probably a pullback tomorrow/Tuesday and another leg down then new lows until we finally trade sideways into the new year.", "score": 1, "replies": [{"body": "Really new lows? I see it holding not breaking", "score": 0, "replies": []}, {"body": "time to turn up the dip buying funds in the boomer 401k, already all in the gambling \\*ahem\\* trading account on GME and BBBY calls lol", "score": 1, "replies": []}]}, {"body": "Good DD I'm unemployed and on this sub until I learn stock market skills because noone wants to hire the world is a lie OP is right I wish I could buy into wat funded stocks why can't I buy China or Russia?? Can I settle for eastern Europe?", "score": 1, "replies": []}]}
{"title": "GSAT is next up | Apple and Globalstar is about to announce a partnership soon", "selftext": "[removed]", "id": "x0g3ba", "created_utc": 1661749303.0, "score": 6, "upvote_ratio": 0.61, "num_comments": 15, "comments": [{"body": "Thanks for your submission! \n\nTo keep things interesting, we want to see big gains and big losses! \n\nSo we've set the following thresholds for Gain, Loss, and YOLO flaired posts:\n\n* YOLO posts must be a minimum of $10,000 of options or $25,000 of shares and recently opened.\n\n* Gain / Loss posts must show realized gains or losses of more than $2,500 for options or $5,000 for shares. \n\nWe want to see the actual trade. What you got in at, what you sold at. Then tell us why you did it. Give us the story of why you're a fucking genius (or idiot).\n\nThis is what a great post looks like:\n\n[$17.2K Gain on AMZN](https://www.reddit.com/r/wallstreetbets/comments/wb5m4o/not_too_shabby_172k_gain_amzn/) - OP described his gain in the title, has a clear screenshot showing both the entry and exit, meaning his gains were locked in, and they explained their reasoning in the comments and what they learned. All around a great post!\n\nHere are examples of what could get your post removed:\n\n* [$300,000 SDC Loss. Still not selling](https://www.reddit.com/r/wallstreetbets/comments/wpm9am/over_300000_unrealized_loss_sdc_not_selling/) - Even though this is a tremendous loss and something worth posting about, **the position hasn't been closed yet**.\n\n\nHere are examples of amazing posts which could have been even better:\n\n* [$75,000 DDOG Loss.](https://www.reddit.com/r/wallstreetbets/comments/unsrey/loss_porn_ddog_call/) - This is a great post and one that won't get removed. However, the OP could have talked about *why* they entered the position in the first place, what their target price was, and what went wrong. OP didn't stick around in the comments to answer any questions.\n\n* [$1.1MM Loss, No details](https://www.reddit.com/r/wallstreetbets/comments/lxm6wt/hold_me_1100000_loss/) - OP simply posted a screenshot of their overall portfolio balance. It's definitely a big loss, but it's not that interesting without OP talking about what trades they were in and why. OP didn't answer most questions in the comments which left many readers speculating on what happened.\n\n---\n\nAll that being said, we are here to help. We want to make it as easy as possible for you to post to our community. We have to balance this with making the subreddit interesting for our readers. \n\nIf you need some guidance, don't hesitate to [reach out to modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets) and we'll give you some pointers!", "score": 1, "replies": []}, {"body": "So there's this company called Enron you're going to absolutely love.", "score": 7, "replies": []}, {"body": "Been holding GSAT since last time they were supposed to partner. Is silver next?", "score": 5, "replies": [{"body": " This is from the actual 9/11 documentary. https://www.youtube.com/watch?v=GwGUYf9HZRs  \n 5:50", "score": 1, "replies": []}, {"body": "Can confirm, Silver is next.", "score": 1, "replies": []}]}, {"body": "Fuck off", "score": 3, "replies": []}, {"body": "Hmm pretty cheap too", "score": 1, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|19|**First Seen In WSB**|1 year ago\n**Total Comments**|17|**Previous DD**|[x](https://i.redd.it/6ti030dl3lk91.gif) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x0g3ba)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x0g3ba)", "score": 1, "replies": []}, {"body": "Love the in-depth DD. Any reason why you think this?", "score": 1, "replies": [{"body": "Did you try Googling \"Apple and Globalstar\" partnership?", "score": 2, "replies": [{"body": "I did, but it was the same rumors that have been going on for a while. OP made it sound like there was some new info...", "score": 3, "replies": [{"body": "Got it. Probably the biggest thing I read is that they're looking to compete with Starlink's and T-Mobile's similar scheme, so they're likely wanting to push it out ASAP.", "score": 1, "replies": []}]}]}]}, {"body": "This is a Europoor rocket. It’ll never reach the Moon.", "score": 1, "replies": []}]}
{"title": "Circuit breakers and things you need to know if we happen to have a day similar to Black Monday. 8/29/22 Premarket outlook and Technical Analysis for day trading the SPY.", "selftext": " \n\nGoodmorning traders, if you have been following my premarket videos the last two weeks you would know that I am expecting a bigger repeat of last Friday and Monday. A bigger repeat means a bigger down day Friday (We got) and a bigger gap down Monday (coming). I couldn’t sleep last night I was like a kid waiting on Christmas, but instead of looking for Santa I was checking the spy. Now for those that don’t remember Black Monday happened October 19, 1987, it's when the Dow Jones crashed 22% in a single day. Some may not believe that history repeats itself but it sure does rhyme. In case we have a similar situation, the market has built in circuit breakers to try (emphasis on try) to prevent such things. “Market-wide circuit breakers provide for cross-market trading halts during a severe market decline as measured by a single-day decrease in the S&P 500 Index.  A cross-market trading halt can be triggered at three circuit breaker thresholds—7% (Level 1), 13% (Level 2), and 20% (Level 3).  These triggers are set by the markets at point levels that are calculated daily based on the prior day’s closing price of the S&P 500 Index” as quoted from Investor.gov. Another thing to remember if any of this happens in the last 30minutes of the market day then the circuit breakers are double these amounts. Oh, and if you are curious the first circuit breaker would happen around the 377 level for today if needed.  \n\nNow normally after the last couple of days like I have had I would be preaching turtle mode (take it easy or no to low trading), but if this plays out the way I have been saying this is still coming into one of the best trading periods that you only see a few times in a lifetime thanks to the over induced fed policy. Now if we have a sizable gap down normally following my rules, I would be thinking Trend Day down however, there will be nothing typical about the market for a while. Fridays decline was maybe more than 3.50% and the Vix barely yarned.  When we were climbing and all the talking heads were trying to convince you that the new bull market was here, I placed a myriad of $10 wide Vix bull call spreads starting above 26 so for me this is just the beginning. For the panicked or untrained there will be a temptation to throw caution to the wind and buy a crap load of puts at the open...**DON’T. NEVER SHORT IN THE HOLE.** Whether we hit a circuit breaker or not there will be some short covering that will lead to a pull back or rally, this is your chance to get short (oddly enough, I put on a few extra short atm puts on Friday just in case we gap). Now my weekly Outlook is bullish biased closing above 405.31 with a possible retracement of around 413. Now whether you believe this outcome or not it tells us to look out for pops or failed rallies possibly leading to or ending around the previous close or at the most 413. Trading days this week will seem abnormally long so if we have a trend day don’t be surprised if it feels like a trend day one way for part or ¾ of a day then the other direction the next ¾ or part of the day. Keep an eye on volume, Friday was the first day in a while we did above the volume average. Look for this to continue going up on the bear side to confirm everything I have been saying. \n\nKey levels to watch for ... Resistance (jack)402-403, (queen)405-406 and (king)407-413 area. Support (jack)400-399(queen)397-395and (King)387-370. The main thesis is Bullish bias closing above 405.31 with a projected target/high of between 406-413. Alt thesis is Bearish bias closing below 405.31 with a projected target/low of between 400-374. All week you better be prepared for a more explosive alt thesis. The current major channel we are in is 416-397, the major channel below is 397 down to 379. I know these numbers seem extreme but don’t put anything pass this market right now.   Scenarios for the day: \n\n1) Trend day down we open gap down and start with a rally back toward the previous close. We find resistance on or before the previous close then begin the downtrend for the day. We find midday chop around either possible queen or king support.  **35% probability** \n\n2) Rounded reversal day type structure. We could get a continued push higher toward jack or queen resistance area and find midday chop around either queen or king resistance before spending the same energy we used going up to come back down the second half of the day or vice versa.  **33% probability** \n\n3)     Expansive Range Day structure. We could look to have what seems to be a powerful move up and start to give it all back and then some late in the day or after hours.    Or vice versa **32% probability**", "id": "x0nk75", "created_utc": 1661776249.0, "score": 15, "upvote_ratio": 0.71, "num_comments": 10, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|42|**First Seen In WSB**|1 year ago\n**Total Comments**|49|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x0nk75)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x0nk75)", "score": 1, "replies": []}, {"body": "lol 😂\n\nNothing's going to happen", "score": 11, "replies": []}, {"body": "For a circuit breaker to happen a true black swan event has to happen, like the recent 2020 COVID crash. If everyone is expecting a crash soon, then it’s no longer an unexpected event. \n\nAs of right now looks like spy found support at the $401 level premarket. I see a bullish day trend today, before any more downtrend, but I could actually be wrong too. Who knows!", "score": 3, "replies": [{"body": "I'm looking at China right now with their disastrous situations. If any black swan event exists, China is it.", "score": 1, "replies": []}]}, {"body": "So we either close up or down, got it.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I will be messaging you in 1 day on [**2022-08-30 12:35:47 UTC**](http://www.wolframalpha.com/input/?i=2022-08-30%2012:35:47%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/x0nk75/circuit_breakers_and_things_you_need_to_know_if/im8ysu2/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fx0nk75%2Fcircuit_breakers_and_things_you_need_to_know_if%2Fim8ysu2%2F%5D%0A%0ARemindMe%21%202022-08-30%2012%3A35%3A47%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20x0nk75)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "So what you're saying is...the market is 100% moving to the right", "score": 2, "replies": []}, {"body": "Lol", "score": 2, "replies": []}, {"body": "Lol stupid bitch", "score": 1, "replies": []}, {"body": "Sir that’s too many words", "score": 1, "replies": []}]}
{"title": "Apple/Amazon", "selftext": "[removed]", "id": "x0nyfo", "created_utc": 1661777401.0, "score": 4, "upvote_ratio": 0.69, "num_comments": 10, "comments": [{"body": "Thanks for your submission! \n\nr/WallStreetBets is known for making absurd but sometimes profitable trades that no one ever considered possible.\n\nTo keep making that possible, we need your help in keeping the feed of threads interesting and exciting.\n\nWe try to move all the short and basic questions, analysis, or jokes to the daily thread so that the best quality content can stick around and be more visible. \n\nThis is definitely a bit subjective, and there are no hard and fast rules, but a few indicators that your post should have really been a comment in the daily thread include:\n\n* Asking a question that is easily googleable or has likely been asked before. E.g. \"What app should I use?\", \"What should I invest in?\". \n\n* Beating a meme to death, like the 10 millionth, \"inverse cramer\" joke again. \n\n* Reposting jokes from the front page but slightly altered to be related to trading. \n\n---\n\nAll that being said, we are here to help. We want to make it as easy as possible for you to post to our community. We have to balance this with making the subreddit interesting for our readers. \n\nIf you need some guidance, don't hesitate to [reach out to modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets) and we'll give you some pointers!", "score": 1, "replies": []}, {"body": "You bought at the top man, sorry", "score": 11, "replies": []}, {"body": "in my expertise, they are going as low as Ms. Chokesondick's b00bs", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "Sir, this is a casino.\n\nHowever, yes, both.", "score": 2, "replies": []}, {"body": "Those are solid averages. If anything, avg down.", "score": 2, "replies": []}, {"body": "They wont go to the moon they will go to the core of earth", "score": 2, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Penny stocks to the moon and back haha", "score": 1, "replies": []}]}, {"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|1 year ago\n**Total Comments**|253|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x0nyfo)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x0nyfo)", "score": 1, "replies": []}, {"body": "To me those are long term (actual) investment so unless your planing on pulling out of the market for good or retiring I wouldn’t worry how low they go. If you can just keep buying as they go down.", "score": 1, "replies": []}]}
{"title": "Is VXX a great chance for short-squeezing?", "selftext": " Obviously, that spike in VIX was a disaster for pure short volatility positions—especially in shot position of VXX.   See the followed facts, Obviously Barclays want to buyback its overissued VXX in lower price. In last 2 months, the price of VXX is significantly lower than its real value by its short. For example, VIX was increased 17% last Friday, VXX only increased 2%. However, the VIX is on the way to 30-35%, VXX will be faced the huge pressure of shot-squeezing as it is manipulated.  Let's see what will be happened.\n\nhttps://preview.redd.it/8k3i96n0aok91.png?width=1169&format=png&auto=webp&s=b75e0a74c3aa90fa344ffc8528de3960f6a868a4\n\n  \n\n# Barclays Suspends Until Further Notice Further Sales and Issuances of Two Series of iPath® ETNs (the “ETNs”)\n\nMarch 14, 2022 09:13 AM Eastern Daylight Time \n\nThis suspension is being imposed because Barclays does not currently have sufficient issuance capacity to support further sales from inventory and any further issuances of the ETNs. \n\nBarclays expects to reopen sales and issuances of the ETNs as soon as it can accommodate additional capacity for future issuances.", "id": "x0rvc8", "created_utc": 1661787561.0, "score": 0, "upvote_ratio": 0.31, "num_comments": 12, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|2 hours ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|6 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x0rvc8)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x0rvc8)", "score": 1, "replies": []}, {"body": "I hope so.  I am stuck in it", "score": 3, "replies": []}, {"body": "You can’t squeeze a derivative and you definitely can’t squeeze a derivative of a derivative. 🤦🏻‍♂️", "score": 2, "replies": []}, {"body": "no, buy bbby we’re green since friday and going up, it will explode this week", "score": 2, "replies": []}, {"body": "I think you're regarded. You can't squeeze a volatility-derived etf.", "score": 5, "replies": [{"body": "Wrong", "score": 2, "replies": []}]}, {"body": "0.78 with vol of 4.6% differ, theoretically possible![img](emote|t5_2th52|4258) IMO", "score": 1, "replies": []}, {"body": "You want a short squeeze on volatility? What are you going to to do, give it stability?", "score": 1, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Good bot", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4259)", "score": 1, "replies": []}]}
{"title": "Electronic Arts vende ad Amazon? I videogiocatori sognano", "selftext": "Electronic Arts, l’azienda produttrice di videogiochi famosa per aver sviluppato FIFA, potrebbe essere in vendita e il candidato principale, dopo Apple e Disney, sembra Amazon di Jeff Bezos. L’azienda vorrebbe entrare prepotentemente in questo mercato, sviluppando una sinergia in grado di diventare una delle più importanti del settore nei prossimi anni. L’obiettivo è quello di creare un nuovo team di sviluppo con la produzione di vari giochi, i quali potrebbero diventare gli assoluti protagonisti nelle console di nuova generazione.", "id": "x0wqfw", "created_utc": 1661799460.0, "score": 0, "upvote_ratio": 0.25, "num_comments": 15, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|1 year ago\n**Total Comments**|4|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x0wqfw)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x0wqfw)", "score": 1, "replies": []}, {"body": "Spaghetti, spaghetti, spaghetti", "score": 15, "replies": []}, {"body": "Ich kann kein Englisch du spast", "score": 5, "replies": []}, {"body": "EA SPORTS IN THE GAME", "score": 5, "replies": []}, {"body": "Pizza Spaghetti", "score": 4, "replies": []}, {"body": "Ahhhh sie sie. Ciao Bella!", "score": 3, "replies": []}, {"body": "Non so se mi state prendendo in giro, comunque viva l'Italia la pizza e i spaghetti 😂😂😂\nE soprattutto viva i Gain", "score": 3, "replies": []}, {"body": "È un rumor che sta circolando, il silenzio delle società a mio parere lascia ben sperare", "score": 1, "replies": []}, {"body": "Calla, perra", "score": 1, "replies": []}, {"body": "Dalla padella alla brace", "score": 1, "replies": []}, {"body": "[I can't understand your accent.](https://www.youtube.com/watch?v=LkNuo1P7M0s)", "score": 1, "replies": [{"body": "È italiano", "score": 1, "replies": []}]}, {"body": "Ciao bambino!!", "score": 1, "replies": [{"body": "Ciao Bambola", "score": 1, "replies": []}]}]}
{"title": "What I learned from trading and how you can become a better trader. (3/4)", "selftext": "  **Reason #5:** You don’t know math or don’t take advantage of it.  \nThis one is not on the radar for most of you. What is the probability of a person who buys options at any time of expiration to be profitable? Well, it depends on the IV. Now let’s assume that IV is around 100% which is normal, the MMs don’t expect crazy volatility so if you’re right with the direction you’ll be in profit. The chances of you being right are 33.33% How do I know that? Because the market only moves in 3 directions, **Up, Down, and sideways/flat.** That is why the only 3 ways you’ll profit are through buying calls, puts, or through theta. So 33.33%. The only difference between 0DTE and long expiration dates is you have more time to **POTENTIALLY** recover if the stock price went into the other 2 directions. But nonetheless, just because you have 3 months till expiration calls **DOESN’T** mean that your contracts will recover. For all we know, the stock price will tank and go flat line for a very long time and the price will recover only 6 months later if ever. Let’s take it up a notch and go beyond 1-day movement. So if on the first day of buying a contract or a share you have 33.33% of being right, the chances of the same direction price movement are less and less each day goes by since there are other 2 directions the price can move. \n\n  \nSo **lesson #5**: Use math to your advantage. As a rule of thumb for me, if I want to buy a call and already see that the stock price went up by $3+ I take it as a loss, or missed boat, and move on to a different play.   \n **Reason #6**: You think the whole world is against you and believe in every conspiracy theory.  \nThe stock market is a dog-eat-dog world, even though anyone would love to sell you a piece of trash stock for an overvalued price, everyone is on the same boat just on the other side. There are bulls and bears who are actively making the same bet as you, you’re not the only one who is rooting for a stock. You buy a stock, and so do many others. And let me break down the stigma behind the Technical Analysis aka TA. People love bashing it, saying it is all nonsense, horoscope signs, leaf reading, etc. Truth be told, they are wrong...well not entirely right. There is a reason why we can spot clear and obvious resistance or support levels because that is where many people either buy in or sell out. It is not to say that T.A is always accurate, but it is worth looking into because it just might increase your chances of being profitable. The patterns can fall through or “predict” the next movement, which leaves you with around a 50% chance, it is just up to you to figure out when to pull out. Also a warning, there could be fake breakouts or falls so keep that in your consideration.\n\n **Lesson #6:** T.A can be helpful but go in with an exit strategy in case you’re wrong and expect the pattern to fail. It is much better to lose 10%-20% of your contract, take a step back and change your strategy than just hoping that stock will either recover or dip… It can, but the chances to have the exact movement that you need to recoup your losses are very small.\n\nPositions:  2cts RIOT 7 CALLs Jun 16 2023 (-12.56%)\n\n**Sold** 1ct AAPL 165 PUT Sep 02, 2022, for 105% profit because I was happy with gains and did not want to risk it.  \n**Sold** 2cts ASO 44 PUTs Sep 30, 2022 (for a $6 loss because I'm looking for a better entry)", "id": "x0z441", "created_utc": 1661805304.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 12, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|32|**First Seen In WSB**|1 year ago\n**Total Comments**|435|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x0z441)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x0z441)", "score": 1, "replies": []}, {"body": "Final lesson: ignore everything you learn from wsb", "score": 10, "replies": [{"body": "But OPs lessons are here on WSB so are we ignoring these too?", "score": 1, "replies": [{"body": "Yes", "score": 3, "replies": []}]}]}, {"body": "Lesson #7: Calls on pictures of Spider-Man.", "score": 3, "replies": []}, {"body": "Lesson 8: Flip a coin", "score": 2, "replies": [{"body": "Flipping a coin is 50/50 chance much better than stocks", "score": 1, "replies": []}]}, {"body": "Lesson 9 listen to J Pow speech backwards so stocks go back up", "score": 2, "replies": []}, {"body": "wtf is the 3 dollar rule 3 dollar on a 5 usd stock isn't the same as 3 dollars on 700 usd", "score": 2, "replies": [{"body": "That’s just my rule that I stick to. I usually trade options that are AAPL, AMD, BA, the ones that cost few hundred dollars for few weeks expiration. I should have clarified that rule is for options only. The idea behind is what goes up must come down, and these stocks swing around that price range, obviously the momentum can push it further. But on the conservative side to keep me from FOMO, if I see swing around that price, I assume that momentum is going to be over soon and rather than going straight gamble mode, I take a step back.", "score": 1, "replies": []}]}, {"body": "Thanks for the lessons.", "score": 1, "replies": []}]}
{"title": "Should I buy higher priced calls/puts or just a lot of lower priced ones.", "selftext": "Simply put I got a couple bucks now so if I want to go in on something like aapl puts or something should I be looking to get one or two deep in the money puts or get a couple outta the money ones?", "id": "x11390", "created_utc": 1661810112.0, "score": 3, "upvote_ratio": 0.61, "num_comments": 16, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|1 year ago\n**Total Comments**|8|**Previous DD**|\n**Account Age**|6 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x11390)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x11390)", "score": 1, "replies": []}, {"body": "Do you want a low chance of a tiny profit, or a tiny chance of a small profit?", "score": 13, "replies": []}, {"body": "Figure out your hypothesis, get calls or puts a few weeks or months after the target date. Diamond hand to zero as your theory was absolute dog shit.\n\nI primarily trade in options for my meme portfolio now, and I was down 80% YTD Friday morning. I'm at 50% now with a decent chance to go green.", "score": 5, "replies": []}, {"body": "FD’s the only way to go \n\n-Not financial advice", "score": 3, "replies": [{"body": "PUT YOUR HANDS UP oldmanwrigley!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "I always go far out of money, earliest expiration", "score": 4, "replies": [{"body": "Haha", "score": 2, "replies": [{"body": "Day of expiry, regards", "score": 1, "replies": []}]}]}, {"body": "There's no right answer, they all decay as expiry approaches. ITM options are more likely to still be ITM by expiry usually but that doesn't mean they'll be worth as much as you pay for them. \n\nTaking profits is underrated. If you're up by 20%, 50%, 100%, sometimes it's best to sell to live another day than to risk it all hoping for the elusive 1000% gain on one bet. Also don't overdo it until you figure out what you're doing. Win some, lose some, don't yolo it all on your first bet before you see how price action & momentum affect these.", "score": 2, "replies": []}, {"body": "If the contract is expensive then that’s because a lot of other people think that it might go to that strike by the expiration date. So maybe you’ll make a little money. If it’s cheap, then not a lot of people think it’ll get that far. So if it DOES go there, you’ll make good money but there’s a reason smart money doesn’t think it’ll go that far. \n\nEverything is priced in. To make money trading options you not only have to bet if it’ll go up or down, but that it’ll go up or down further than everyone else thinks it’ll go.", "score": 1, "replies": [{"body": "I just ..um... no.", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|12787)", "score": 1, "replies": []}]}, {"body": "First, you have to identify when the run will happen. Once you have this date, buy contracts that expire the week before that. /s", "score": 1, "replies": []}, {"body": "r/options", "score": 1, "replies": []}, {"body": "You must be truly desperate to come here for help. \n\nI'll help you though.  Keep that money in your bank account and buy yourself lunch.  You'll be happier.", "score": 1, "replies": []}, {"body": "You make more money with the cheaper ones but they have a higher chance of going to zero. You choose how much you are willing to risk for your desired return", "score": 1, "replies": []}]}
{"title": "Thoughts on $Intel ?", "selftext": "What is your opinion of intel? Is it a buy at its current price of $32.92?\nInsiders are buying.\n\nOn Aug. 24, Gelsinger purchased 14,800 shares at an average price of $33.86 per share. After the purchase, he directly owns 77,216 shares, while his trust owns 266,530 shares. The CEO’s purchase seems to be a stamp of approval for Intel’s recent investment.\n\nIn addition, Gelsinger, along with other industry officials, expects annual semiconductor sales to almost double by 2030 to over $1 trillion. Semiconductors are used in a multitude of everyday products, ranging from cell phones to vehicles.\n\nThe recently approved CHIPS Act also marks a positive catalyst for Intel. The act will provide $52.7 billion of subsidies for U.S. semiconductor research and development.", "id": "x129g7", "created_utc": 1661813077.0, "score": 11, "upvote_ratio": 1.0, "num_comments": 15, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|42|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x129g7)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x129g7)", "score": 1, "replies": []}, {"body": "It's the fact that they also pay a decent dividend that's making it attractive. Expect it to move side ways or even down for the next couple of years though. I'm thinking about selling some puts on it to start accumulating shares this week.", "score": 6, "replies": []}, {"body": "It's a good buy.  The problem is that Intel never moves enough to really be enticing to an ape.  Even during the pandemic they moved very small increments versus amd, nvidia, or basicslly any other major chip company. But I do assume they'll be back up to 45 or so within a year or two and they have a decent dividend.   Just not really a WSB kinda stock, in my opinion.", "score": 6, "replies": []}, {"body": "I rhink its a good deal.Companies like Intel will never go under so its not much of a risk.", "score": 2, "replies": []}, {"body": "I’ve been averaging down. It’s gonna be a long term hold item.", "score": 2, "replies": []}, {"body": "i bought INTC back in the 2nd quarter and held until Biden gave them Billions. I pulled out because they dont need my money anymore", "score": 2, "replies": [{"body": "They never had your money you ding dong", "score": 2, "replies": [{"body": "my pronoun is REGARD", "score": 5, "replies": []}]}]}, {"body": "i like INTC and it's at a 7year low.  They definitely don't move a whole lot, but 10% seems achievable in the next year.", "score": 2, "replies": []}, {"body": "Ask Cramer and reverse", "score": 0, "replies": []}, {"body": "Intel gonna be an amazing investment in 5+ years. They've lost footing in the industry to amd and nvidias better tech. Intel as a brand has been around and will not let themselves willingly stay at #3. They will spend loads to try and take the top spot. I bet they will be at nvidias price after 3-4 years.", "score": 1, "replies": []}, {"body": "the next quarter earnings should be good.  I expect it to bounce", "score": 1, "replies": []}, {"body": "Intel is like a 20 year hold. In the short term, it will probably return to the mid 40’s perhaps.", "score": 1, "replies": []}, {"body": "INTC is a dumpster fire of a company with horrendous management and a multitude of better competitors.\n\nThe trade off is they’re strategically one of the most important companies for the United States.\n\nMy opinion is that they’re burning money and if they continue paying that dividend they will be facing breakup in a few years to save whatever the board of the day thinks is their core business.  If they reduce or cancel the dividend and actually invest in their business then maybe they can turn it around.  But the stock price will drop another 50%.\n\nMy opinion is they’re the worst major semi company to invest in.", "score": 1, "replies": []}]}
