{"title": "Apple Call option", "selftext": "[deleted]", "id": "mv4ttv", "created_utc": 1618966547.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 43, "comments": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Does that mean i am good for now? I was a little worried after i went negative on my option today.", "score": 0, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "^^^options aren’t like shares of a stock.  You’re not holding shares, you’re taking a bet that has a ticking clock that can run you down to zero.", "score": 5, "replies": []}]}, {"body": "You’re good, I have calls for this July and I went a bit red today, but should be good", "score": 3, "replies": [{"body": "My breakeven is $165.75? Wth?", "score": -2, "replies": [{"body": "If you don't know how to calculate your breakeven point you shouldn't be trading options right now.  There are a lot of really good beginner courses out there that you really should check out because small mistakes can wipe out months of gains.", "score": 6, "replies": [{"body": "what do you recommend", "score": 1, "replies": [{"body": "TD Ameritrade has an options course. Tastytrade and option alpha are both great as well. Each has a slightly different teaching style so check them out and find which one works best for you. The InTheMoney YouTube channel is great as well. I watched a few of his very basic beginner videos to get started before I did anything else", "score": 2, "replies": [{"body": "Thanks, will check those out - which would you start with?", "score": 1, "replies": [{"body": "I personally think you should start with the video by InTheMoney that talks about calls and puts. I can't remember the exact name of the video but it was something about trading options on Webull. The video is relevant regardless of what brokerage you use though.\n\nEdit: After that then it's up to you whether you prefer tastytrade or optionalpha. I think both are solid but I know people who prefer one over the other just because of their learning style", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "So you understand nothing about options, and threw $600 in then ask questions later? It might be a good trade since its 8 months long and you can still profit, but you need to hit youtube or read some option books before getting into option trading. You can and most people have easily lost their entire accounts to option trading.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Haha, i do understand a bit about options. Did now know there was so much to it. I am pretty sure they’ll reach around $160 but wanted to learn more.\nAnd no it is my money and i knew that Leaps would be better in this case.", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm guessing you meant 2022? or 23?", "score": 5, "replies": [{"body": "Yes, i am sorry. I meant 2022.", "score": 3, "replies": [{"body": "Who much did you for that Call", "score": 2, "replies": [{"body": "I bought this call for about close to $600.", "score": 1, "replies": [{"body": "Now it’s worth $555 ..is that what you see", "score": 1, "replies": [{"body": "I see $565 yes, but how? Could you teach me master? 😳", "score": -1, "replies": [{"body": "If the share price is falling further away from $160 then the premium will fall..... putting your option at risk to be worthless.   when the share price increases...those premiums will increase and you can try and sell out . There is still a lot of time but be careful making plays like this if you have never done this.   As a beginner, I recommend you try covered calls or covered puts if you want to try options.   Long calls are very risky", "score": 1, "replies": [{"body": "why covered calls?", "score": 1, "replies": [{"body": "less risk.  You already own the shares..your getting paid to sell at X price.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Click this link. http://opcalc.com/tzM\nThat assumes you paid $600. If you really paid 575 then change the 6.00 price in the link to 5.75 and click calculate.  \n\nThat graph will show you what your profit or loss will be based on AAPL's price in the coming months.  \n\nI would encourage you to watch some YouTube videos.  Sky view trading is easy to understand.", "score": 3, "replies": []}, {"body": "It amazes me that people get into options, knowing nothing and without money to burn.", "score": 3, "replies": [{"body": "Imagine buying options and not knowing how they are priced or if you can sell them 🤯", "score": 2, "replies": []}]}, {"body": "Oh wow, that was good! It made it easy for me to understand. Could you please tell me where I can learn more about options?\nAlso, how does it show my average as $5.75?", "score": 1, "replies": [{"body": "Google\n\nEdit to add: glad to see new people getting interested in the market, and im glad that this trade went well, but please take time to read and research how FDs work...you risked a lot of money (a lot to most ppl anyways) and clearly had no idea how options work. That is a setup for failure, im not bashing or trying to discourage you, just please please please do a lil more research b4 the next trade. Congrats buddy!", "score": 5, "replies": [{"body": "I haven’t been able to really understand how it works, I understand roughly when shown by example like the other guy did with house loan.\nI have been doing stocks but have been trying to learn options and haven’t been able to.", "score": 3, "replies": [{"body": "YouTube Kamikaze Cash and/or InTheMoney. Two great YouTube channels that will absolutely connect the dots for you. Options trading is an unbelievably fascinating trading strategy, but there’s so much to learn. \n\nPlease take the time, this weekend, to read/watch up. Consume the knowledge. It’ll put your concerns at ease.", "score": 3, "replies": []}, {"body": "If it was easy everyone would do it (and be rich). There are quite a few variables. The greeks, the IV, and most importantly the case behind why you feel the underlying stock is goin up, down, or sideways. I am by no means an expert, not even close. After that, look into multi leg trades...\n\nWhile i do option trade, my risk tolerance is soooo much lower than any other investment, and its because while i grasp all the variables, i still feel like im clueless. Best thing i did personally was use Think or swim tied to a TDA account to have access to paper trading and the ondemand feature (again, google is your friend on this).", "score": 2, "replies": []}, {"body": "I got my knowledge base on options from InTheMoney on Youtube. He does an incredible job of breaking complex concepts down into small, much simpler pieces. I would highly recommend watching one of his beginners guides", "score": 2, "replies": []}, {"body": "Same here. I studied options for 3 months. Applied few strategies but honestly not my cup of tea as j found it too expensive with lots of risks. People don’t realize that they feed brokers pockets with all of those high fees before getting anything. So you are the one who take all risks, pay high fees and pay big bucks for minimum return unless you re able to take high risks and lose amount of money. I did iron confit, sold covered calls, did vertical put and calls, bull credit and bear spread and not closed to what I made in   3 days with stocks. I guess it’s not for everybody.", "score": 2, "replies": []}]}, {"body": "👍👍👍👍👍🖖", "score": 1, "replies": []}]}, {"body": "If you only have one option or stock, then your Cost Basis is what you paid.\n\nCB = $$/shares\n\nSay first week, you bought one option for $100, then next week, you bought another option for $120. So, your CB = 220/2 or 110 average/basis\n\nNow, week 3, you buy another option (And these all have to be the same option, otherwise they are not the 'same', as they have different expiration date), this time $90\n\nCB = (100+120+90)/3 or 103.333333", "score": 2, "replies": []}]}, {"body": "This is super super basic. You shouldn't have traded any options without understanding the basics. You basically entered into a bike race the day after getting your first bike. You will get crushed unless you're incredibly lucky. And LEAPs on top of that God damn", "score": 0, "replies": []}, {"body": "If you only have one option, then you cost basis is what you paid. And yes, you can sell it before expiration date.", "score": 1, "replies": [{"body": "I can sell before expiration even if it doesn’t reach $160? It was at $135 it was showing me $82 profit, Can i sell and get that $82 profit and my invested money?", "score": -4, "replies": [{"body": "Options are a little bit like a house loan, you have a 30-year or 20-year home loan, does it mean you have stay 30 years before you can sell/move? No.\n\nYou just find someone else to buy the house (in this case option) and you move on to the next house (or option)", "score": 6, "replies": []}, {"body": "You can sell it for whatever the premium is at anytime before expiration. That's what most people buying options do to make money. \n\nHonestly, if you can make $82 rn, selling wouldn't be a bad idea. You might miss out on potential future profits if apple skyrockets, but that's a big *if*. You've got 82 extra bucks right now, if you're aren't cool with risking everything you spent then just put that +82 in your pocket. No one ever when broke taking profits.", "score": 2, "replies": [{"body": "Love it, i am negative now after today’s downfall but will definitely secure profits when i see them.\nThank you!", "score": 1, "replies": [{"body": "My apple calls dropped a ton today too, but I'd bet they run up a bit before earnings on the 28th. I'm gonna hold for another week and sell on the 26th-ish. Good luck to you and don't hold past that earrings date.", "score": 3, "replies": []}]}]}, {"body": "yes", "score": 2, "replies": [{"body": "Thank you! I thought that I will have to wait till the expiration to get any profit.", "score": 2, "replies": [{"body": "Absolutely! You should definitely watch a few how-to beginners videos on options. Typically you don't want to let your options go all the way to expiration. Unless you intend to exercise it, or if it is OTM and expiring worthless. You typically want sell at a profit, at a margin that you would personally set for yourself based on you own risk tolerances, for each specific options scenario. they're all different.", "score": 3, "replies": [{"body": "Yes sir, i am trying to still learn all of these. ITM, OTM, lol these terms sound like rocket science to me now. I know the abbreviation but not the meaning to it.\nTrying to learn tho 🙌🏼", "score": 2, "replies": []}]}]}]}]}]}]}
{"title": "2 years options experience. Read several articles. Still confused about Wash Sale rules", "selftext": "\\*Disclaimer\\* The primary goal of this post is to determine what the limitations are in regards to credit spreads & avoiding a Wash Sale situation. This strategy is not for everyone and \"just don't use credit spreads\" is not helpful feedback. With that out of the way..  \n\n\nLets talk about why there are exceptions to the 30 day Wash sale rule.  \nThe basics are that, if you buy a stock or option, and sell it for a loss within 30 days of that purchases, the loss will be disallowed as a Wash Sale.  \nWhen selling short options, buying it back within 30 days at a loss also constitutes a Wash Sale.\n\nHowever, there are instances with both stocks and options where that hasn't been the case.   \nMost recently, I bought 100 shares of KMI on 04/09 and sold 99 of them 11 days later for a loss and didn't trigger a Wash sale.\n\nOn the option side.. I bought CCI long puts on 2/16 and sold them on 3/19 and the entire thing was a wash sale (I forgot February was a shortened month =/)  \nBut then that same month I bought NVDA calls on 3/05 and sold them on 3/12 for a loss and didn't trigger a wash sale.\n\n\\*\\*Why this is important\\*\\* In regards to credit spreads, both legs experience time decay out of the money, constituting a gain on the short option and a loss on the long option.  \nAfter a move in the underlying security representing an 80% decay, I'd like to close the position and move on. However, realizing a gain on the short leg but having a wash sale on the long leg completely invalidates an otherwise profitable strategy.\n\nI want to understand why this only occurs some of the time. Whether it is possible to trade short dated spreads without triggering a Wash Sale. Or if because of the ambiguity, one should always aim to allow for 30 days between opening and closing.  \n\n\n\\--Currently what I am doing is realizing a gain on the short leg, since that can be done at any time, and holding the long leg either 30 days or into expiration.   \nThere is a subsection of Wash Sale that says the disallowed loss can be added to the cost basis of a remaining position. Which means in theory.. I could do a partial sale of the long option earlier & realize the full loss selling after 30/expiring the remaining ones. Without full understanding though, risking running afoul of Wash sale would mean thousands in taxable gains I never actually had. So, worst case.  \n\n\nThank you for reading, and I greatly value any insights or experience on this.", "id": "mvqzp8", "created_utc": 1619043683.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 40, "comments": [{"body": "Looking at KMI, as an example. \n\nBuy, then sell = loss\nBuy less than 30 days after loss = wash \n\nIf you didn’t re-purchase the shares within 30 days of selling them, then you can claim the loss this year \n\nIf you bought them within 30 days of the sale, then the cost basis of the new lot is adjusted by the loss that you would have taken previously. \n\nIt will only matter when you carry those new shares into subsequent years, where it will take until the time of sale to claim those losses.", "score": 5, "replies": [{"body": "This \\^", "score": 1, "replies": []}, {"body": "If I buy 1 option x for $100 and sell it for $50. If I rebuy same option 10 calls again for $500 and it expires otm, will I be able to claim loss??", "score": 1, "replies": [{"body": "All a wash does is turn your Realized loss back into unrealized", "score": 2, "replies": [{"body": "So after all positions are closed, losses are still eligible for tax deduction?", "score": 1, "replies": [{"body": "My understanding of that part of Wash Sale was the amount disallowed is added to the cost basis of any remaining positions. So if you sold out 100% of your position & triggered the wash sale, you'd have nowhere to add the higher basis to and couldn't get the deduction", "score": 1, "replies": [{"body": "Once youve sold, then the losses become realized...it doeant really have to do with selling. Only selling and rebuying. Again, thats what i underatand it as. Im not narcissistic enough to think im always right so hopefully someone else can make it more cut and clear.", "score": 2, "replies": [{"body": "Where it gets complex is when you've bought in multiple lots. Lets say you bought 5 shares of AMD at $100, bought 5 more 10 days later at $90 and then sold 5 shares at a loss. It would be disallowed if was within 30 days of either purchase.\n\nIf you bought 10 shares at the same time and sold at a loss inside the 30 day window (but with no other purchases) you could take the loss.\n\nBut if you bought 5 shares at 100 and 5 shares at 98 on the same day, and tried to sell at a loss within 30 days. THAT I think is when it bites you. If you sold only part of the position, the disallowed amount may get added to the other shares. But if you sold out completely, You'd eat the wash sale completely.  \nAt least, I think that's what I've learned today", "score": 1, "replies": []}]}]}, {"body": "Yes, but if you close on the last day if december, and then rebuy within 30 days, that will trigger the wash. Ho estly wash sales r not a worry to me, because when thwy can screw you, then you probably meet the reqs to file as a trader and it changes all of this. The story on RH about the dude getting screwed was juat clickbait. Litterally all he nneded to do (and im sure he did) was file as a trader and all would/did work out. All in all, just talk to an qccountantb4 the end of the year if your worried", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "This is probably the best response here. The wash-sale rule is really not a thing to worry about especially if your trading options frequently. It’s not going to burn you come tax season, it’s only meant to prevent people from exploiting a very specific loophole when it comes to deductions.", "score": 3, "replies": []}, {"body": ">I've been trading options for 10 years.  I have never once given a damn about the wash rule.  I have had plenty of losing years.  Plenty of wash sales.  You can only claim up to $3,000 in losses anyway...and I never give a damn about carrying my excess losses to the next year.  I simply pay my taxes and focus on having winning years....which means I focus on trading successfully.\n\nThe problem with this answer is you'll pay more taxes than necessary.  Example:\n\nYou make $20k trading this year ($60k of gains and $40k of losses).  However, you have a wash sale carryover loss of $30k so you have to pay taxes on $50k.  You can only deduct $3k a year so if you have no gains the following year, you carry forward a $27k loss into the following year, and so on.\n\nClose your wash sale positions by the end of the year and stay out for 30 days (shorts need to be closed 2 days before the end of the year).  No hassles, no headaches.\n\nThe exception would be if you have Trader Tax Status and elect MTM accounting.  Then, wash sales do not apply to you.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": ">I'm not advocating being stupid with taxes...just don't be overly concerned about it.  Focus on trading successfully and it is a non-issue.  That's all I'm saying\n\nYou've missed the point.  You could trade successfully but still rack up tens of thousands of dollars of wash sale violations.  I don't have the link but there's a story on the net where an active trader made money trading he had to pay unnecessary taxes on hundreds of thousands of dollars because he ignored the wash sale rules.  \n\nAnother thing to be aware of is that if you trigger a wash sale violation in an IRA account, the loss is permanently disallowed in your taxable account.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">I don't believe the story of the guy you are mentioning.  If it is true, he simply didn't do his taxes correctly or his broker has no clue how to properly discern what a wash sale is.\n\nYou're free to believe whatever you want.  \n\nTwo years ago I had $69k worth of wash sale violations and I didn't even trade that heavily that year. Had I not paid attention and allowed them to become carryover violations, I would have had to pay taxes on an extra $69k of income. \n\nAnd FWIW, I use a tax trader accounting program to double check my broker's numbers so it wasn't an issue of the broker having 'no clue'.  \n\nThis is a real issue for traders and it needs proper attention.", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm not trying to carry over a loss on the year.. It's vital to my credit spread (puts) strategy because.. specific  example.\n\nI sold a ten 430 AVGO puts for -$8,838.51 and bought ten 420 puts for $6,827.37 for a net credit of $2,011.14  \nMy max gain is therefore $2,011 but I'm showing a simultaneous 9k gain and a 7k loss (rounded). If for some reason I trigger wash sale, I'll instead post a straight 9k gain but only ever have made 2k, in which case the IRS gets all of it and then some", "score": 1, "replies": [{"body": "This will not happen. I can assure you of that.", "score": 1, "replies": []}]}, {"body": "You got it. Anyone worried about a $3k write off probably shouldn’t be trading options or stock for that matter (building a stock portfolio is good). However, on TDA wash sale seems to calculate weird and messes with the cost basis displayed. I’ve seen my cost on a position change throughout the week of the wash sale without additional trades at all which throws me off.", "score": 1, "replies": []}]}, {"body": "It’s my understanding that the wash sale is only triggered if you re-buy into that same stock or security within 30 days of selling it. It’s not about selling your position, it’s about buying back into it too soon.", "score": 3, "replies": [{"body": "For some reason comments are invisible on the thread.. anyway. So when taking a loss, the key thing is whether there are 2 buys within 30 days of the loss?  \nFor example, If I bought 3 options on 3/16, 3 more on 4/02 and tried to take a loss on 4/22, the 4/02 purchase makes it a wash sale?  \nPerhaps that was the source of my confusion. I was careful not to buy anything back, but it'd always post immediately as a wash sale. I probably just looked at my oldest lots and forgot to look at all of them. Thank you for the feedback", "score": 1, "replies": [{"body": "Here’s the thing it’s not actually just 30 days it’s a 61 day window. The rule is as follows: ‘The tax loss will be disallowed if you buy the same security, a contract or option to buy the security, or a \"substantially identical\" security, within 30 days before or after the date you sold the loss-generating investment’ (that’s the 61-day window). So yes, in your case you triggered the wash sale because you purchased the second leg of your spread within the 30 day period PRIOR to selling your position. Hope that helps clear it up.", "score": 2, "replies": [{"body": "I think I'm getting there. Not sure if you've seen the other threads, but what about entering positions in batches? In our previous example, the purchases were on different days. But what if.. I had bought all 6 options on 3/16?  \nIs it possible I could realize a loss at less than 30 days if I bought them in one transaction BUT triggered wash sale if I bought them 3 at the time on the same day? If so, that sounds exactly like what I'm having happen", "score": 1, "replies": [{"body": "I do believe that if you do your purchase order as a spread and buy both legs at the same time you will avoid this, yes. I can’t say for sure though I don’t do credit spreads, other than a few times with paper money, so I don’t have experience in that exact case. \nEdit: by the way, just to clarify, buying into a position and then simply selling for a loss within 30 days does NOT constitute a wash sale and you can claim that loss. Only if you re enter that position within the next 30 would you trigger the wash sale rule.", "score": 1, "replies": [{"body": "Apologies for not specifying the trade execution; yes I will always enter both legs of the spread at the same time. So the question is whether entering a spread with 6/6 contracts long/short is treated differently than two batches of 3/3 on the same day for a total of 6/6  credit spreads.  \n\n\nEach leg is of course, independent of the other; but after taking a nibble on a spread, if I see the net credit rise during the same day, I usually double or triple down on it.   \nNormally it's prudent to split up entering a position so you can capitalize on these fluctuations. But if that is actually the cause of my wash sales, it may not be advisable for trading spreads if it's treating those subsequent buys as grounds to disallow losses", "score": 1, "replies": [{"body": "Ok. Let me try and simplify this as much as I can. At the end of the year when you do your taxes. You will be taxed on your net gain/loss which is your realized gain/loss on a security. The rule is to prevent you from having a net gain on a security throughout the year but then deducting each individual unrealized loss along the way.", "score": 2, "replies": []}]}]}, {"body": "Honestly, my feeling is that your looking at the wash sale rule a little too intently. At the end of day, this isn’t going to really have much of an impact on your taxes. Especially, because it sounds like you are trading options at a fairly frequent pace so your losses and gains are fluctuating all the time. You aren’t going to be over-taxed due to the wash sale rule. All it does is prevent people from dodging taxes by deductions losses from positions they immediately bought back into.", "score": 1, "replies": [{"body": "It's honestly what I think keeps me afloat. Credit spreads create a lot of paper gains/losses.I have 82k in gains and 72k in losses just for this year. It would be catastrophic if I didn't have those offsetting losses from the long leg. I'm simply trying to understand why it happens on occasion and how to refine my strategy", "score": 1, "replies": [{"body": "But that is still a realized gain not a loss. So it’s different. You’ll be taxed on you ur net gain of 10k not on your gross of 82k.", "score": 2, "replies": [{"body": "Each leg's gain/loss is calculated separately. Depending on how I've entered/exited the spread, sometimes the long leg loss doesn't hold and my reported 'net' gain is higher than it actually is.  \nI've been successful enough to absorb this error thus far, but it could burn me if I don't know why it occurs. That's all I'm trying to say.. again thank you for the feedback", "score": 1, "replies": [{"body": "If say, you have a big net loss on a wash sale then yes that can burn you. If you close that position with a net gain tho you have nothing to worry about.", "score": 1, "replies": [{"body": "That's the catch though to credit spreads. There is always a loss component.  \nI have left various brokers because this gain/loss dynamic was not readily apparent until year end statement, I usually know by the next day, but for tax purposes a spread is always considered 2 separate positions & unless it expires out-of-the-money, both legs are closed individually; IE You must buy back the short leg first before you're allowed to sell the long leg.  \n\n\nIf its a net gain overall, buying back the short leg creates the 'gross gain' as you put it. But you cannot deduct the theta decay from the sale of the long leg if it violates wash sale because they are individually calculated.  \nBeing short another option doesn't change this even if they were entered together, so sometimes when closing out a spread early, it's less risky just to let it expire worthless than try to sell it and risk a wash sale. At least if it expires you can deduct the whole thing", "score": 1, "replies": [{"body": "[take a look at this ](https://greentradertax.com/tax-treatment-for-trading-options/)", "score": 1, "replies": [{"body": "Hmm.. A couple really interesting takeaways, notably:\n\n\"Brokers don’t comply with *taxpayer* wash sale rules or  straddle loss deferral rules on Form 1099Bs or profit and loss reports.  Few local tax preparers and CPAs understand these rules, let alone know  how to spot them on client trading records.\"\n\n\"The IRS probably enforces wash sale and straddle loss deferral rules  during audits of large taxpayers who are obviously avoiding taxes with  offsetting positions. They make a lot of money, but it’s always deferred  to the next tax year. The IRS doesn’t seem to be questioning wash sales  and straddles during exams for the average Joe Trader.\"\n\nI would be unable to 'defer' taxes in this way because with only Level 3 permissions, I cannot own naked short options or frontload losses.  \nSince I was never attempting to, I'm fine in that regard. Secondly:\n\n\"Brokers report wash sales based on *identical positions*, not  substantially identical positions. Investors who trade equities and  equity options cannot solely rely on Form 1099Bs and they should use  their own trade accounting software to generate Form 8949\"  \nIf I were to do that, I'd be creating **more** wash sales than the broker reports to the IRS. If they only flag 'identical' sales as wash sales, but I'm still triggering them. I have every reason to be cautious.\n\nNow, it's possible I could recover an errant wash sale by doing the calculations for 8949 manually, instead of using my broker's numbers. But I would then be obligated to do ALL calculations that way, not just the ones that work in my favor.", "score": 1, "replies": []}, {"body": "Short version: I'm probably best served either finding out how to have disallowed losses added to the new basis on 'identical' securities (maybe by keeping at least one contract thru 30 days) or preventing wash sale from kicking in entirely by strictly monitoring how/when I buy.  \n(No more batch buying, waiting 30 days)\n\nI suppose it sucks that the only way to know for sure is try it with real money & see what happens. -\\_-", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I think a wash sale is triggered when you sell for a loss and the buy that same asset again within 30 days. Not if you sell within 30 days.", "score": 4, "replies": [{"body": "^ correct", "score": 3, "replies": []}, {"body": "The tricky thing it seems is its a 30 day window before or after taking the loss. So what I think is happening is I enter my positions in batches, 5-10 at a time on the same day, and that's getting flagged as Wash Sale when I start to close out positions", "score": 1, "replies": []}]}, {"body": "Thank you for the feedback thus far. One other thing that crossed my mind is I tend to enter into put credit spreads in batches. about 5 or 10 contracts at a time. Even if its on the same day; it could be that closing those positions within 30 days is triggering wash sale because the threshold of multiple buys within 30 days of the loss is being met", "score": 1, "replies": []}, {"body": "If someone is day trading and brokerage have flagged the account as day trading account. Will this rule still apply?\n\nIt is easy to get into this if someone is trading weekly options.", "score": 0, "replies": [{"body": "Wash sale is not something to worry about.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, looking it through the \"substantially identical\" lens, any kind of spread is a walking wash sale =/ The only way it works is through an opaque \"net gain/loss\" or treating different options as totally separate securities, as my broker does.\n\nPersonally, if my broker reports my activity to the IRS a certain way, I'm neither inclined nor qualified to differ.\n\nAt best, I need to at least stay clear of triggering individual security wash sales so they aren't flagged by my broker, even if that means not doing batch buys, dollar cost averaging or selling inside the 30/30 window.  \nSuffice to say, that's really difficult with complex options like spreads.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That's quite a contrast from me. 90% of the time I'm in credit spreads using puts, and its usually a stock I've been long awhile, so I've already got a feel for when it's oversold. When that occurs, I can make a spread and use the proceeds to buy additional shares.\n\nI'll look at the charts for past support, but generally I'm going in 10% out of the money with 30-45 days to expiration(at least 20% credit/max loss ratio) , I always enter on in the red days, and add to positions if the underlying falls within the next 3-5 days. I then hold until expiration unless it decays 80% or more with more than half the time left.\n\nI'd certainly love to hear your methods. I was self taught.. I didn't read about spreads or even know their name. I got the idea while trying to figure out how to sell puts on margin (the broker denied my request for Level 4, naked puts)  \nWhen I got the idea, I plugged in an example off-hours and the preview pane said \"Credit $1,200, Option Reqs. $5000 - Creates credit spread\"  \nSuddenly the consolation prize of being granted Level 3 options wasn't so bad.  \nIt had just gone over my head up until I'd put together the use case on my own.", "score": 1, "replies": []}]}]}]}]}
{"title": "AFTER GME/AMC BECOME A BILLIONAIRE!!!", "selftext": "AFTER GME/AMC BECOME A BILLIONAIRE!!!\n\nThe stock market as a whole will crash when gmc/amc pop, people with no clue will just bail. And when the market takes a nose dive it always OVER CORRECTS on the down,  then bounces back, before it's back to business as usual. \nOver the history of the stock market EVERYONE that bought the dip of a big market drop came out of it WEALTHY.\n\nNow your saying, who the fuck cares, I have money 🤑💰. \n\nBut everyone loves more money, and this could be your one chance in a lifetime to buy quality stock at FIRE-SALE prices. And turn you into a person that could buy a house cash, to the person that can buy there own private island and private jet.\n\nDO THIS: make a list of quality stocks you would buy if only you had a chance to buy them on sale. Put this list aside for launch day. Don't wait to o this because when it's launch day your brain will be scrambled with emotions. At the right time, pull out your list and buy up these stocks with some of your winnings.\n\nSee you on the other side.", "id": "mvshrm", "created_utc": 1619048409.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 42, "comments": [{"body": "And if my grandmother had wheels, she would have been a bike!", "score": 11, "replies": [{"body": "Definitely in keeping with op’s style of reasoning", "score": 3, "replies": []}]}, {"body": ">The stock market as a whole will crash when gmc/amc pop, people with no clue will just bail. \n\nYes, I'm also looking forward to less of these posts", "score": 10, "replies": []}, {"body": "Just to be clear, the goal of the side supposedly on the moral high ground in the stand off is to crash the market, screwing over millions of citizens who did absolutely nothing wrong and needed that money for their retirement? Crippling hedge funds probably isn’t worth it if you’re also dumping granny on the street", "score": 6, "replies": [{"body": "In 2008 they crippled it themselves with no help from anyone....they would do it again with or without retail.", "score": -3, "replies": [{"body": "2008 was far from just an institutional investors problem. Much, much more. Also, that still doesn’t address the point. If you saw a kid in the street with a car coming down it would you whip out a pistol and shoot the kid since he may have ended up getting pancaked by a car anyway?", "score": 1, "replies": [{"body": "I would not, but me buying a stock should not cause collapse.  If it does then where is the issue? With me the buyer or the people making the rules?", "score": 1, "replies": [{"body": "But nobody is buying the stock purely for fundamental reasons at this point. If it was isolated to individuals, you buying a stock wouldn’t hurt anything. But we both know you’re misrepresenting the situation, because a large group is all functioning together to hold as much of the float as possible. The only way to prevent price manipulation by any group, no matter how large, would be to get rid of the free market. I’m not saying I feel bad for the institutions or anything, but the fact that part of the strategy involves fucking over senior citizens as you wreck their retirements while you hope to pick the bones for your own riches and it’s being celebrated and lauded, not even viewed as an unfortunate casualty that causes some guilt, means you aren’t the good guys in this story. You’re just more entropy and chaos, not the unifying force of good destined to rid the world of hedge funds or whatever the mission statement is", "score": -1, "replies": []}, {"body": "Why these people want to blame retail investors and not the hedge funds/ MMs that set it all up for this to happen is bewildering.", "score": 0, "replies": [{"body": "I don’t blame retail investors for the situation, I blame anyone who plans to revel in a market crash that can wipe out retirement accounts of people that have worked for 30 years to build them. Moreso when those same people talk about how evil hedge funds are for manipulating prices and screwing innocent people so they can profit off said screwed people, just to turn around and do the same thing they say hedge funds are evil for doing. Also, at the end of it all, either the market will rebound and everything will return to how it already is or institutions will get burned so badly that a huge portion of money currently in the market won’t return any time soon, leaving prices in the toilet. We don’t really win either way", "score": 3, "replies": [{"body": "I don’t see it as reveling. The post came off as excited I’m not one of the ones dancing. I want awareness brought to how shady the system was set up and that the sec and dtc are trying to unscramble it without collapsing it all.\n\nThis is money that can set up my children with a good safety net. I’m happy for that but I didn’t set up the house of cards like this", "score": 1, "replies": [{"body": "Excited vs reveling is essentially splitting hairs in this scenario though. The excitement was still about the market crashing, which hurts normal people way more than it hurts institutional investors. At the end of the day, those people can go get another job. They’re primarily just getting fired. Sure, a bunch of the company money goes up in smoke, but only so much of that is even theirs to begin with. Like, I get wanting to make a bunch of money as the little guys, especially when we watch the big guys swing their weight around just to inflate their accounts more while we just want some crumbs to support our families’ futures. We have to be honest with ourselves about who it is that is actually getting hurt in the situation. It’s primarily other regular people if the market crashes, which is the opposite of the goal. Being excited about that, no matter whose fault it is, means it’s not really about sticking it to the big guys so much as just wanting to be able to make money off innocent people getting screwed", "score": 3, "replies": [{"body": "I wasn’t disputing that and went on the clarify that I wasn’t sharing the same perspective on it as him.\n\nAt the end of the day the institutional investors set up the market on a fragile base. Whether GME or AMC tips it over or not I feel is besides the point. It was inevitable the way it was built up the same way the 2008 crash was built on a house of cards.\n\n\nThe market needs a reset and way more accountability and transparency. That’s the benefit that comes from all of this. Setting my family up through the open market? Not the main goal but can’t deny its assistance in my life", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Not the goal, but the results from abusive naked short selling", "score": -1, "replies": [{"body": "So how are you better than the hedge funds if both sides end up screwing over innocent people? Y’all sound like Batman villains, pretending you’re fighting some good fight while doing just as much damage as the evils you’re supposedly fighting", "score": 1, "replies": [{"body": "Our financial system is built on a house of cards, IOUs are used to pay IOUs which are used to pay IOUs, when someone can’t pay their IOU all of the dominos come tumbling down. This isn’t GME holders fucking over the entire working class, its market makers doing it themselves, and retail investors taking advantage of the inevitable tumbling of the house of cards. We are going to witness 2008 all over again, and GME holders are not the ones to blame. This has to happen eventually whether we are the ones to do it or not.", "score": 2, "replies": [{"body": "But to be clear, if you are with OP and are speaking for their side, y’all are celebrating the crash if it happens and taking a decent amount of credit for it. That was made abundantly clear in the post. Don’t twist OPs words. They said “when GME and AMC pop, the markets will crash” then went on to talk about how rich people can get off of said crash. You aren’t the good guys at that point. Full stop. You lose your right to complain about the evils and wrongdoings committed by hedge funds when you yourself plan to both help precipitate and then revel in a market crash, because you’re then doing the same thing hedge funds do: profiting off other peoples’ losses. You can say you have whatever motivations you want, but if you’re going to defend OP’s stance you have to acknowledge that they are reveling in a potential crash", "score": -1, "replies": [{"body": "That’s bullshit. No matter what you do in the market to gain profit means someone else loses. This game is zero sum and always will be. So, the next time you sell your shares for 10% gain know that someone lost that 10%.", "score": 1, "replies": [{"body": "Not necessarily. They lose opportunity cost, but not necessarily money. If I bought a share of AAPL from someone in 2015 after they bought that share from someone in 2010, we both did pretty well. Even if they did lose on that one trade, neither of us had any impact on the other. Claiming that the squeeze you’re helping force would cause the crash means that you wanted the crash to happen. And honestly? That’s an ok stance to take, if a little murky morally. The problem comes when someone claims hedge funds are evil for manipulating prices so they can profit when other people lose money via your manipulation, then turning around and hoping to do the same yourself. A market crash that plunges everyones’ stocks so far that people with a decent cash holding could become billionaires, as the OP suggests, means people are getting absolutely annihilated across the board, which is generally worse than what we see from a hedge fund shorting a stock", "score": 1, "replies": []}]}, {"body": "You’re missing the point, this crash is inevitable. The system is totally UNSUSTAINABLE. Regardless of GME, AMC, or the like this is going to happen some day. You would prefer that the government bailout hedge-funds again like in 2008 and average Joes are once again left holding the bag and with less purchasing power? We might as well rebel at that point. Wealth gaps are widening drastically in the US especially since 2008 and even more so since the pandemic. Someone will profit off of the inevitable crash and it will most likely (99%) be hedgies, GME is their black swan and a chance for retail to get their just desserts. Why let the rich stay rich, when they are unfairly trying to keep us all poor? This whole financial system is a concerted effort against the working class of people. Just because someone is profiting off of something does not make it inherently bad. I guess you are also against people buying SPY put options then??", "score": 0, "replies": [{"body": "Profiting off of it doesn’t make someone inherently bad. Being excited for innocent people to get screwed over does. Huge difference there. Also, the hedge funds aren’t going anywhere. When the ones now get busted, new ones will rise from the profits from taking the opposite positions that current hedge funds are taking. The average person won’t have that same benefit. They will have years of growth wiped out. If they’re near/in retirement, that’s brutal and life-changing", "score": 0, "replies": [{"body": "This situation is once again, not caused by GME but by malpractice within hedge-funds. You are avoiding the fact that this coming crash is inevitable, not solely caused by GME. Whether it happens today or tomorrow, someones retirement is getting wiped out as a result of naked shorting, and other malpractices within the industry. Hopefully, GME serves as a catalyst for market reform and forces the government to crack down on our broken, corrupt system. It sucks that people might get hurt as a result of a market crash but that harsh reality is out of our control regardless of GME.", "score": 1, "replies": [{"body": "I’m talking directly in reference to the post, where OP’s situation is caused by the GME/AMC squeeze", "score": 1, "replies": []}]}]}, {"body": "Also, you didn’t answer the question: are you excited about the market crashing, despite the damage it will do to the average person and their savings?", "score": 1, "replies": [{"body": "No, I’m not a psychopath, and I’m not defending the OPs comments. Your takes are just missing the entire point of the situation.", "score": 1, "replies": [{"body": "They aren’t though. I’m not arguing that people shouldn’t be sticking it to hedge funds, that retail investors are the cause of a hypothetical future crash, or that the system doesn’t have glaring flaws. I’m saying the OP starts out by saying that the AMC/GME squeeze will cause the crash, then going on about the excitement of being able to buy cheap shares. THAT is what I’m arguing against. You can even have that position and it’s iffy ethically, but it’s consistent. But to be excited to get cheap shares during a crash that you believe you/your movement helped materialize while also claiming to be fighting against the evils that hedge funds perpetuate? At that point OP is basically doing (or hoping to be able to do) the same thing hedge funds do and are called out for. The same things the whole squeeze is supposedly fighting against. I personally don’t believe the squeeze will result in any crash, or that it’s going to hit 5 or 6 digits, or even $1,000 for GME, so I don’t think the hypothetical scenario plays out. The post itself, however, is presenting a scenario where the squeeze causes the crash then encouraging people to be excited because they can now buy cheap shares", "score": 1, "replies": [{"body": "I agree the OP is a bit psychopathic and his take is at least insensitive. However if this does play out the way the OP thinks it will, lets not blame WSB for the inevitable crash of unsustainable, corrupt practices from Wall Street vultures. It’s not the their fault, GME is just a catalyst not a cause.", "score": 1, "replies": [{"body": "I wouldn’t be blaming them, per se, but I would call out the hypocrisy if they were essentially taking credit for the crash instead of pointing to the underlying system that was unable to prevent it from happening", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Who has the retirement funds? And why are they investing so recklessly? In 2008 who bailed out the same people that screwed the system? I understand what you are saying but retail investors should not take the brunt of this....Tesla is not running on fundamentals.....people still buy.  Plus what group do you mean, people can buy and sell on their own accord. The system needs to change, like most things there are casualties to change a system.  Institutions could have changed this in 2008, they chose not too and here we are again and the wheels will keep turning until there is change.", "score": 0, "replies": [{"body": "Lol, investing in broad index funds would be reckless investing? Come on, man. You’re stretching here. We aren’t talking about a speculative bubble burst. OP bluntly said market crash. Not sector crash or speculation crash, but a full bore market crash. \nWhat do you mean what group am I referring to? People investing in the GME/AMC situation right now aren’t thousands of people who individually came across the short interest numbers and the potential for squeezes etc. The vast majority are people who exchanged/gathered ideas and information with others about the situation. To go back to the point though, flat out, yes or no, will you be happy if the market crashes, people living off retirement accounts lose 75% of their savings they needed to live off of, but you are able to buy cheaply? If the answer is no, you are in a different camp than OP appears to be", "score": 2, "replies": [{"body": "Flat out? No, I will not be happy if the market crashes.  But I must not be understanding your point fully.  Do you think GME/AMC would be the sole reason the market crashes? I think I'm missing something here...I am assuming that you are saying GME/AMC investors will cause a crash and because of this crash people living off retirement will lose a chunk of their savings.  If that is what you are assuming, I disagree fully.  If you are strictly speaking about OP and the choice to buy stocks at a lower price once/if a crash occurs...I agree that it sucks people lose savings but I do not understand how that is different from any previous crash (basically I'm wondering why you are making your point in that case?)", "score": 1, "replies": [{"body": "I personally don’t think they will, but that is what the OP states. “The stock market will crash when GME/AMC pop.” That’s the part that bothers me. Make all the money you can from the institutions. Do it! I could care less about that part. What bothers me is the narrative that somehow the squeeze WILL crash the market and that we should be excited for that because it’s a cheap buying opportunity, which is what OP is touting. THAT is different. If the goal is to ultimately result in a crash so cheap shares can be obtained, then that’s a problem and blurs the lines between the good fight that is supposedly being fought and the hedge funds that retail is supposedly fighting against. I don’t think we’ll ever see GME hit $1,000, let alone the 5 or 6 figures some people seem to be setting as a goal, so I don’t think anything even close to a crash will come off it. Since the post starts off by implying the squeeze on GME and AMC will result in a market crash, the OP seems to disagree with my belief, which is where the discrepancy is. Make money off hedge funds? Great. Get excited for a market crash because it hurts some big guys (and a ton of little guys)? Eh, that’s iffy. Do that while also complaining about the evils of hedge funds? Now we’re bordering hypocrisy", "score": 2, "replies": [{"body": "Thank you for clarifying.  I fully understand and agree with your point.  There should be no joy in a market crash (that just replaces us as the sharks instead of them), though GME/AMC will only be one trigger of a significantly wider and systematic issue.  I also don't believe in the crazy gains, not because they are not achievable but greed will not allow the price to rise that high no matter how 'coordinated' the effort.  My point was a little different than yours, I agree with your point, however fundamental changes must be made to the system or grandmas gonna lose her savings every 10 years anyways and if it is a cycle....at what point does one l keep feeling bad?", "score": 1, "replies": [{"body": "Very true about changes being needed. On one hand, I do wonder if the market crashing again would lead to those changes though, since we’ve seen institutions and hedge funds get scorched in other crashes and the problem remains. On the other, the phenomenon that this entire situation has become may be enough to make risk management departments in these firms truly tighten down their protocols, crash or no crash", "score": 2, "replies": [{"body": "Greed rules, alas I think nothing will change...and if it does change, they will find ways around it....and people will lose, even many GME will lose despite of a squeeze.  The game is not played fair.  I did not understand your point fully earlier.  I was going to provide a different analogy to your child on the street.\n\nImagine Germany in WWII just steamrolling around Europe.  Now this could have went on for a quite a while..any casualties.  Or do the allies step in?  Many will lose if the allies step in, but maybe it's worth doing for change.  Grandma is going to die no matter what, but maybe change will stop future Grandmas from dying....poor analogy but you get the gist of it :)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Your right we should just let abusive short selling continue to drive companies into bankruptcy. Would be horrible if retail tried to stop this and got blamed for screwing over innocent people. Because you know they were the ones that tried to stop  corrupt system. Best let that corrupt naked short selling continue right?", "score": 1, "replies": [{"body": "Read through my replies to others that replied here. You’re putting words in my mouth (on my keyboard?)\n\nI have no problem with making some money by sticking it to the hedge funds when they get caught with their pants down. Go get your money, make yourself rich man. Good on you. I have a problem with the OP implying the goal is to create a market crash so people can get cheap shares. That’s an entirely different take", "score": 0, "replies": []}]}]}]}]}, {"body": "You are truly retarded", "score": 2, "replies": [{"body": "After the pop,, come back and tell me I was wrong about the marking diving.. think of all the satisfaction you will feel. I dare you,,", "score": 1, "replies": [{"body": "Why don't you also short SPY so you can make a killing on the way down, pull that huge sum of money out and use it buy the dip?", "score": 2, "replies": []}]}]}, {"body": "Where am I? This isn’t where I parked my car. It should on r/wallstreetbets. Looks like ape writing.", "score": 2, "replies": []}, {"body": "markets bounce back. maybe this will actually change the way the game is played. dare I say.. even benefiting future investors.", "score": 1, "replies": []}]}
{"title": "$AMD Fair Value of $101 per Morningstar recent Analyses, up from $77", "selftext": "Morningstar Analyst, Abhinav Davuluri, raised his Fair Value price of $AMD to $101 recently on April 14th \\[[https://www.morningstar.com/stocks/xnas/amd/quote](https://www.morningstar.com/stocks/xnas/amd/quote)\\], from the $77 that he had set back in Jan 27th, when the stock was at $89, made a run for $94 two weeks later, before plunging down the depth of hades shortly thereafter...  I hate that the guy was right, but he was right...  So, maybe he's right about his new target, as well.  Also, AMD has tons of price targets in the $100+ range, and all the rumors and news points to a gangbusters Q1 earnings ($WDC, $MU, $IBM, and $TSM, all major players in the PC and data center space has had huge revenue beats), it's crazy that the stock is still under $80 just a week before earnings!\n\nPersonally, from my own attempts at TA \\[[https://i.imgur.com/rpDaio0.png](https://i.imgur.com/rpDaio0.png)\\], I believe $AMD is at the bottom of it's current price channel, and the stock is going to start recovering towards Q1 earnings; my hope is that AMD will experience a Parabolic jump like it did on July of last year, the situations are similar, where it spent long periods of trading sideways, while the rest of the tech sector was booming, AMD being flat then didn't make any sense, nor does it now.  Full disclosure, I have a ton of 5/7 Call options riding on a Monster Q1 earnings beat and guidance.", "id": "mv7gs5", "created_utc": 1618976335.0, "score": 57, "upvote_ratio": 0.91, "num_comments": 41, "comments": [{"body": "I’m considering a position at this point but it is more of a long term vote of confidence in Lisa Su. Reviewed all the technicals and know this industry pretty well since worked for Intel for 5+ years. I think Lisa will go down as one of the best semi industry CEOs in history, up there with Andy Grove and Morris Chang.", "score": 37, "replies": [{"body": "You definitely want to buy into $AMD for Su and the rest of the management team, they've managed to innovate like a Start up, and execute on their road map like a well oiled machine; Visionary and competent Management is one of those intangibles you can't quite put a price on, till you get an Intel that stagnated for years....", "score": 12, "replies": [{"body": "Yeah it has been really sad watching Intel. I had high hopes for Krzanich but then he had to go off and bang his employee. Really Barrett, Otellini, and Swan have all been underwhelming if not disastrous. I’m a fan of Gelsinger but they’ve dug themselves a massive hole that is going to be tough to get out of. AMD with TSM is just such a formidable competitor when you’re bumbling around with older fabs.", "score": 4, "replies": []}]}]}, {"body": "this charts got more lines than Charlie Sheen's coffee table", "score": 44, "replies": [{"body": "At least his lines serve a purpose", "score": 3, "replies": []}]}, {"body": "Damn I’ve been considering opening a position for some time now and anything under $80 seems like a solid play! \n\nI’ve seen so many reports of AMD Fair value being ~$100 it’s got me confused as to why that isn’t being reflected in the share price. I guess general market shakiness has to do with it.", "score": 7, "replies": [{"body": "The Markets consistently undervalues AMD in favor of their rivals, INTC and NVDA, like I posted above, this situation is similar to last July where the Markets kept AMD flat for Months in the low 50s before shooting them up to $80+ after a stellar Q2 earnings.  AMD is definitely a show me stock, Markets aren't going to budge till earnings, no matter how many good rumors, news, and Price Targets all indicating strong value in AMD.", "score": 5, "replies": [{"body": "Earnings are gonna be through the roof on Tuesday. Ready for my 4/30 83c to start printing money", "score": 2, "replies": [{"body": " Large Print [$AMD](https://twitter.com/search?q=%24AMD&src=cashtag_click) Size: 250000 Price: 81.455 Time: 1334 Amount: $20,363,750.00 \n\n\\- [https://twitter.com/TradeWithAlerts/status/1384923410233536512](https://twitter.com/TradeWithAlerts/status/1384923410233536512)  \n\n\nThe Run up towards Q1 on Tuesday is beginning...", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "\"We are raising our fair value for AMD to $101 per share on a probability-weighted basis as we await AMD’s acquisition of Xilinx. We assess AMD’s standalone fair value estimate at $91 per share, up from $77, as we anticipate excess returns over a longer period of time commensurate with a narrow moat rating. After reflecting on the potential revenue synergies in the data center and annualized cost synergies of $300 million, our fair value estimate for the combined AMD-Xilinx entity would be $104 per share. We assign a 75% probability of the deal closing.\"  \n\n\nFrom the Morningstar analyses, the XLNX merger may have set back AMD stock, but it's ultimately accretive in value, XLNX gets AMD into a ton of industries they weren't already competing in!", "score": 2, "replies": []}, {"body": "yes the XLNX deal is a massive dilution. something like 30billion $$ worth", "score": 1, "replies": []}]}]}]}, {"body": "Wait till earnings. Judging by recent earnings there will be a sell off.", "score": 16, "replies": [{"body": "Earnings will be beat. Guidance is what's going to matter.", "score": 8, "replies": []}, {"body": "What do you mean \"judging by recent earnings\" --- as in, the last few earnings didn't hit so it was sold. You're expecting the same this time?", "score": 2, "replies": []}, {"body": "Unfortunately this is always the case with AMD", "score": 4, "replies": []}]}, {"body": "I sold off at 91. made money. It rose ridiculously fast", "score": 3, "replies": [{"body": "I've loaded up on AMD from $75 to $80 range, the stock is capable of going back to $90+ in a heartbeat.  There was a case to be made they were overvalued at $90 a few months ago, but not anymore, especially with every major Datacenter player recording record sales, I would eat my AMD CPU if they don't get back to $90+ after earnings!", "score": 13, "replies": [{"body": "No doubt about it. I just didn’t want to deal with all the consolidation. I moved it into AAPL when it pulled back to $120", "score": 2, "replies": []}]}]}, {"body": "Good news for th e calls I bought yesterday", "score": 2, "replies": []}, {"body": "It already trades at 10x sales and 123x free cash flow per share", "score": 2, "replies": [{"body": "How does this compare to NVidia?", "score": 1, "replies": []}]}, {"body": "Expect this coming quarter result would be good, but not super because of chip shortage. However expect AMD’s lead over Intel on CPU would last longer, as it would take a while for Intel’s fab to catch up (if it can), or Intel uses TSMC too. Even Intel catches up, it would not be dominating like it used to be.", "score": 0, "replies": [{"body": "There are no chip shortages, just pure demand outstripping supply.  $TSMC shipped 3.36 Million wafers in Q1 '21 vs 2.92 Million wafers in Q1 '20!  - [https://www.anandtech.com/show/16621/tsmc-q1-2021-process-node-revenue-more-7nm-no-more-20nm](https://www.anandtech.com/show/16621/tsmc-q1-2021-process-node-revenue-more-7nm-no-more-20nm)", "score": 6, "replies": [{"body": "That's only a little over a 10% increase.  When everyone is trying to upgrade their home devices.", "score": 7, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Exactly, AMD is focused squarely on growing their Data Center business, and starving retail of supply in favor of those fat margins.  $MU has reported record sales to the Datacenter, and credited new 'CPU launches', which is obviously hinting at EPYC chips, that has 8 channel memory, and a crap ton of PCI-e lanes for SSDs for Micron to sell a bunch of their products with.  Also IBM had sky-high Datacenter sales, and they announced a Partnership with AMD back in June.  \n\nIf you're wondering where are the AMD supply, they're all being swallowed up by the Datacenter!", "score": 1, "replies": []}]}]}]}]}, {"body": "If you're looking to acquire AMD shares, wait till it's in the high 60s to low 70s range, because it will dip.", "score": -1, "replies": []}, {"body": "I feel like AMD made a huge blunder leaving lots of money on the table at their price points.", "score": 0, "replies": [{"body": "$AMD can't charge scalper prices for their GPU's, if that's what you mean... They are selling their products at high ASP, and that should reflect in Q1.", "score": 3, "replies": [{"body": "Across the board, AMD parts are selling above MSRP.  Clearly they misjudged demand.", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "And that's a good thing.", "score": 1, "replies": []}]}]}]}]}, {"body": "Do you have like a 1 year price target? I’d like to buy and sell covered calls while just holding for a while.", "score": 1, "replies": [{"body": "Looks at what the analysts are saying, don't ask for price targets from redditors", "score": 1, "replies": [{"body": "I have I just like to hear as many opinions as possible. And as far as I’m concerned the average analyst isn’t any smarter than someone on Reddit so long as they all have access to the same information. Except of course the “short squeeze imminent 🚀🚀🚀” bunch of redditors", "score": 3, "replies": [{"body": "It's about signal vs noise.  Not to say there isn't useful information in this sub, but what you're hearing in terms of price targets is pure cacophony.   Compared to the average redditor, the analyst has way more information and tools to arrive at this target.", "score": 1, "replies": []}]}, {"body": "analysts do not have same interests as you. I recall when AMD was around 12 bucks and goldman analysts kept saying its 8 bucks and would tank the stock. first off if you knew anything, then youd know that analyst was either an ignorant or was purposefully tanking the stock so that they could buy in.", "score": 2, "replies": []}]}, {"body": "$120-130 would be my best guess, that's the middle range of the Price channel $AMD has been following, and also target price of many Analyst.  $XLNX merger should be complete within a year, and $TSMC is spending $30 Billion this year alone to expand, also with $AAPL moving off of 7nm by EOY, that frees up more capacity for $AMD; $120 should be more than doable.", "score": 2, "replies": []}]}, {"body": "AMD and Intel HQ are basically across the street from each other in Santa Clara.  I drive past them on my way to costco. lol", "score": 1, "replies": [{"body": "I would be yelling 'Booooo...' everytime I drive past Intel HQ, with a 'Team Red' Bumper sticker on my car 😛", "score": 1, "replies": []}]}, {"body": "I’ve got a ton of 7/16 95c that are about 50% down right now and for both of our sakes I hope you’re right. I’m playing the same game as you!", "score": 1, "replies": []}, {"body": "I don’t trust Morningstar’s quantitative model. This is probably an analyst report so it’s fine, but be careful around any quantitative reports that Morningstar publishes. They seem to incorporate current stock price in their model, which means it’s not true fair intrinsic value.", "score": 1, "replies": []}]}
{"title": "Thoughts on IBM?", "selftext": "So I know IBM gets shit on a lot but I was wondering if anyone can tell me why exactly it’s a bad choice for a dividend portfolio? They seem like an ideal company to build around especially since the tech sector itself isn’t as strong in dividend payers as other sectors. Not to mention IBM cloud and quantum computing in general could completely revolutionize the world.", "id": "mvpf24", "created_utc": 1619039072.0, "score": 29, "upvote_ratio": 0.85, "num_comments": 39, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Currently up 20% I am not complaining", "score": 11, "replies": [{"body": "If you bought during the dip youre dividend yields must be INSANE", "score": 1, "replies": []}]}, {"body": "I am one of the biggest IBM downers around but their latest earnings impressed me and I would buy them more as a bet on Krishna - IBM tends to get savior CEOs when they’re near death.\n\nThe bad is their stock price is about where it was 5 years ago and 10 years ago. I’d rather have a growing company. Their earnings have also been on a downward trend over the last few years so you can only get so much dividend out of that. \n\nIn tech IBM cloud is a joke. They will not be able to compete long term against the hyperscale CSPs. I think that’s why Krishna is spinning off their infra business. I do think they have a future as a custom solutions provider that uses cloud.\n\nQuantum is a long ways off, I’m pretty biased but I also don’t see IBM a winner in this category because - riddle me this, what was the last technology IBM grabbed by the horns and took a leading position in? It was mainframes under Lou Gerstner nearly 30 years ago. No way their more agile competitors are going to let quantum go to IBM. Just look at how they did with Watson.\n\nAnyways, I personally don’t touch IBM and that is probably my internal biases working against me because I’m in tech. However, I genuinely have been impressed by Krishna so far. If you buy them it is a bet on him to turn the ship. I am watching to see if there is an exodus of executives and if he starts cleaning house which they sorely need.", "score": 19, "replies": [{"body": "Good analysis, I agree 100%", "score": 2, "replies": []}, {"body": "If they can leverage RedHat properly (they seem to have found a solution to the CentOS debacle they caused), it could change the whole company.\n\nBut, it's IBM. They'll grind it to dust selling the same shit to the same customers for decades.", "score": 1, "replies": []}, {"body": "> their stock price is about where it was 5 years ago and 10 years ago.\n\nMeans good yields. Unless they have cut the dividend which I doubt.", "score": 1, "replies": []}]}, {"body": "I like it solely because of the acquisition of Red Hat and the spin off of the legacy IT consulting business. \n\nCloud revenue was up massive last quarter and that's where they're taking the company. I think they have a competitive advantage over AWS or Azure with their hybrid cloud approach. Honestly, I doubt they ever get to be a real threat to Azure or AWS for market share but that cloud services market is huge. You don't need to directly compete with the giants to be successful.\n\nAt the end of this spinoff, it'll basically be Red Hat rebranded as IBM", "score": 8, "replies": [{"body": "Yeah I think the way Krishna is positioning the company is they’ll de-emphasize their own infrastructure and provide hybrid applications for cloud/on-prem mix. He is already spinning off IBM infra which is smart. It is the only strategy that makes sense, this wasn’t a hard thing to see and can’t believe Rommety didn’t do this years ago.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "Do they get repeat customers if they keep deploying shitty products?  😳", "score": 4, "replies": [{"body": "Yes, I worked there too.  It's often times big companies that trust IBM.  There's a saying, \"No one's ever gotten fired for going with IBM.\"\n\nIBM spends to much time, money, and energy winding down legacy systems with just a few clients on it.  Some of these legacy products and services were once successful.  Others never got too high of the ground.\n\nI looked at IBM's price before earnings and thought it was a great buy then just because it was so cheap.  For years, I was wondering why anyone was buying IBM stock, so I'm certainly no IBM perma bull.  I don't IBM stock though.  My portfolio is completely growth.", "score": 3, "replies": []}]}, {"body": "Holy fuck. Ex-IBMr here and can confirm.", "score": 2, "replies": []}]}, {"body": "It’s hard to beat dividends and the lowest PE for a Large Cap tech company.", "score": 4, "replies": []}, {"body": "I think IBM Quantum Experience is amazing", "score": 3, "replies": [{"body": "That's because you THINK .", "score": 5, "replies": []}]}, {"body": "Solid dividend stock. I look forward to 5K checks every six months", "score": 3, "replies": []}, {"body": "IBM is coming back, or they are trying to with the acquisition of Red Hat.  It's a huge acquisition so they are probably just now getting ldap/ad integrated so everyone can be cc'ed on emails.  Red Hat is king of OSS and they have core linux distros in RHEL plus IBM's enterprise mainframe and various cloud offerings.  Red Hat is very strong in on-prem so this move was supposed to bridge the gap.  \n\nAs anyone who works in the business will tell you, IBM is definitely worth keeping an eye out for now.  Red Hat's board will not allow itself to get acquired by just anybody.  They passed on microsoft and amazon for takeover.", "score": 5, "replies": [{"body": "I've used Red Hat on my personal desktop since think it was in 1996, and it was been great.  The only big problem I had was when they removed software raid so I had to muck with Dracut to create a different initramfs image so I could boot.  That really sucked, but other than that, it's been great.", "score": 2, "replies": [{"body": "Red Hat is a great company.  Just visionary in the software industry", "score": 1, "replies": []}]}]}, {"body": "I don't have the capital right now to open a position but I'm bullish on IBM - computing is going to change a lot in the next 5-10 years and they are poised to benefit with their huge investments in quantum and neuromorphic computing.", "score": 2, "replies": []}, {"body": "IBM Cloud is a joke. I have used it and I still have nightmares. It's so far behind AWS, GCP or Azure that it's not even funny. Worst part is no one is using it so finding any solution to your problems online is impossible.", "score": 2, "replies": []}, {"body": "The company simply cannot compete with most modern tech companies as they did not innovate and keep up with modern tech.  In the past they were able to get away with this since they were printing cash from customers using their older legacy mainframe systems and other contracts.  I know a few people who work there but the company is starting to develop a bad reputation in the software industry because of pay issues, low morale and frequent layoffs, which has been leading to a talent drain.  They are currently spinning off parts of their company into \"newco\" in order to shift their focus toward cloud, AI and Quantum computing but they have a lot of ground to cover up versus their competitors.  I think the company will turn itself around but will probably never be able to compete against the modern tech giants that are way ahead in the space.", "score": 5, "replies": [{"body": "If quantum blows up they are in a great position, but that's years and years from now", "score": 4, "replies": [{"body": "IBM Blockchain is also ahead of the game in creating private blockchains for companies.", "score": 3, "replies": []}, {"body": "IBM Q is being deployed at Cleveland Clinic.\n\n[https://www.youtube.com/watch?v=o-FyH2A7Ed0&t=134s](https://www.youtube.com/watch?v=o-FyH2A7Ed0&t=134s)", "score": 2, "replies": []}]}]}, {"body": "IBM Cloud simply isn’t a player. Nobody really thinks of IBM for cloud ops as they’re too small and expensive, with few people having skills in them. They like Windows Phone OS - irrelevant.\n\nThe rest of the company is lumbered with a dinosaur pension anchor, large dividend and aging workforce.", "score": 3, "replies": [{"body": "Totally agree with this. The only vertical I’ve seen IBM go head to head with the CSPs is government and that is only in very narrow contracts that require on premise that IBM is already servicing. They lose more of these more than they win but it is the *only* area I’ve seen them win contracts over the CSPs.", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "They are working a lot on node JS and hyper ledger. They claim to be putting extra emphasis on open source in the next few years but we will see", "score": 2, "replies": []}]}, {"body": "IBM might have a dead cat bounce, before returning to shit", "score": 2, "replies": []}, {"body": "I wouldn't recommend, their product is garbage", "score": 1, "replies": []}, {"body": "Ibm is a tech company, while other tech pile there hard earned cash into R&D ibm continues to take out additional debt to pay its share holders a dividend.  They carry more debt than Amazon, or Microsoft or google.  IBMs business model is in the wrong century and they can’t compete.  The rate of change of tech is increasing faster and faster and they will be left behind.  Why would you own a stock that pays a 5-6% dividend with little to no growth potential.  There yoy profit and rev have been declining for sometime.  Don’t smoke the Hopium there AI won’t save them, they are very far behind on that front.  You could own a tech company growing at 15-40% yoy and the stock does the same.", "score": 1, "replies": []}, {"body": "Dew it", "score": 1, "replies": []}, {"body": "Interviewed there. Great place to work if you want to be years behind on technological practice and have your career tread water for the next 5 years.", "score": 0, "replies": [{"body": "Sounds like you didn't get the job lol", "score": 10, "replies": []}]}, {"body": "I think they will be around for awhile still,but they are definitely dieing and not the future. Probably not the worst place to park money right now.", "score": 0, "replies": []}, {"body": "Who?", "score": -1, "replies": []}, {"body": "Kill it", "score": -2, "replies": []}]}
{"title": "NIO targets Europe with its smart EVs", "selftext": ">Tesla rival NIO will begin delivering its [smart electric vehicles (EVs)](https://www.scmp.com/business/china-business/article/3130042/huawei-emphasises-suppliers-role-it-steps-smart-car) to European customers as early as next month, taking a first step towards going global amid an [escalation of competition at home](https://www.scmp.com/tech/big-tech/article/3122190/chinese-search-giant-baidu-doubles-down-smart-cars-revenue-stalls).    \n>  \n>He added that NIO had no immediate plan to set up production facilities in Europe.  \n>  \n>Norway looks set to be the first market that NIO will explore outside mainland China, with a showroom in the northern European nation expected to open in September, according to local media outlet Bilbransje24, which cited Marius Hayler, the chief executive of NIO Norway.  \n>  \n>[Shanghai-based NIO](https://www.scmp.com/business/companies/article/3123707/nio-chinas-bellwether-ev-start-sees-sales-slump-teslas-cut-price) is following in the footsteps of its domestic rival Xpeng Motors in tapping the European market as they find themselves largely eclipsed by [global leader Tesla](https://www.scmp.com/topics/tesla) at home.   \n \n\n [Chinese Tesla rival NIO targets Europe with its smart EVs as it takes a first step towards going global | South China Morning Post (scmp.com)](https://www.scmp.com/business/china-business/article/3130351/chinese-tesla-rival-nio-targets-europe-its-smart-evs-it)", "id": "mvqn7a", "created_utc": 1619042648.0, "score": 251, "upvote_ratio": 0.92, "num_comments": 43, "comments": [{"body": "so it's gonna tank more today. Ok got you", "score": 64, "replies": [{"body": "Nah I sold yesterday, this is going up", "score": 8, "replies": [{"body": "lol", "score": 1, "replies": []}]}, {"body": "Yes fam yes", "score": 2, "replies": []}]}, {"body": ">“We want to be part of the business community in Europe,” he said. “Selling some of our vehicles to make some money is not our ultimate goal.”\n\nSo, the goal isn't making money from European operations but rather being a part of the European business community and they'll just open one showroom in one country in September?\n\nThis plan appears to be less a plan to conquer the European market and more of a marketing exercise to boost their image in the Chinese market. \n\nIt's actually a good idea, if so. Europe is 44 countries with different tastes, laws and languages. It's consistently rejected non-European premium brands. Europeans don't want American or Japanese premium brands - Cadillac and Infiniti both gave up and withdrew from Europe a few years ago - so it's doubtful there's much market for a Chinese premium brand. A full scale launch of a Chinese premium brand in Europe would be a costly fool's errand, but selling just a few cars through a minor operation would be good for Nio's image as Europe is well-regarded by middle class Chinese consumers. \n\nAnother Chinese start-up, Qoros, did something similar a few years ago. They hyped a European launch, presented their cars to European regulators which received 5 star safety ratings. Then they opened a single showroom, and that was it. But it allowed them to tell Chinese consumers that European regulators like their cars and Europeans are buying their cars - even if just very small numbers from a single location.", "score": 58, "replies": [{"body": "Ah. That's a way more bearish interpretation of those lines.\n\nI thought they didnt meant \"we eant to do more than just sell some cars\" and be more like a household name.", "score": 15, "replies": []}, {"body": "Toyota and Hyundai are extremely popular brands in Europe as far as I can tell. I know they are Japanese but the EU market just wants quality at the end of the day.", "score": 6, "replies": [{"body": "Minor clarification: Hyundai is South Korean", "score": 6, "replies": [{"body": "Good to know, cheers!", "score": 1, "replies": []}]}]}, {"body": "lolz\n\nNIO is a bit different than the rest of the chinese EVS..even XPEV is like a scion..it's not bad..but NIO will appeal worldwide for sure..this does not mean it's going to dominate or anything..but I don't see why NIO won't succeed in the EU..all though it will take many many years", "score": 2, "replies": []}, {"body": "Totally agree.  NIO has a head start for now on the euro brands when it comes to luxury EV but that won't last long.", "score": 2, "replies": [{"body": "I don't think they have a headstart at all to Porsche & Audi.", "score": 3, "replies": [{"body": "Don’t forget Jaguar IPace. Went on sale in 2018.", "score": 1, "replies": []}]}]}, {"body": "That all makes sense, but that quote seems like an unclear translation issue more than anything. The quote makes little sense by itself, with weird use of the word \"some\"...probably not the exact message that was given in Chinese.", "score": 1, "replies": []}]}, {"body": "Good that they're only opening a single showroom; a continent wide launch would fail horribly", "score": 9, "replies": []}, {"body": "[removed]", "score": 60, "replies": [{"body": "This is the way", "score": 7, "replies": []}, {"body": "God I hope so", "score": 2, "replies": []}, {"body": "Get in here apes 🦍🦍🦍", "score": -20, "replies": []}]}, {"body": "I hope it doesn't explode just yet. I just sold a few cash covered calls and I really don't want to loose those shares.", "score": 11, "replies": [{"body": "This is the risk you take with options", "score": 13, "replies": []}, {"body": "Selling CCs a week before earnings report sounds a bit risky to me", "score": 1, "replies": [{"body": "But the IV was so juicy 🤣", "score": 2, "replies": []}]}, {"body": "Well, hopefully those calls were mid 40s", "score": 1, "replies": []}]}, {"body": "Europe should make then hand over their IP as a condition of entering the market. It’s only fair right?", "score": 12, "replies": [{"body": "It would be funny to see the response from the Chinese government", "score": 6, "replies": []}, {"body": "[deleted]", "score": -19, "replies": [{"body": "He’s referring to China stealing European and American IP which is not a “fox news conspiracy theory”", "score": 25, "replies": []}, {"body": "Making europian countries more capable of self defense, making sure they don't get energy from russia, and making them be more protective of themselves was more a trump thing.", "score": -18, "replies": []}]}]}, {"body": "XPEV (Xpeng) already is in Norway and expanding in Europe.\n\nNews doesn't matter for these stocks. They're being crushed by anti-Chinese sentiment, and are currently part of the pump and dumping of sector movements that HFs have been doing for the past month.\n\nNIO, XPEV, and LI should have 1 or two more days of positive, and then be absolutely crushed again as they cycle money back out and into other sectors that just got crushed. Take a look. two days of 5% up, then days of 7% down, give it a week or so, then a couple days of 5% up, rinse repeat for the last month between 33-41 for NIO, and 30-37 for XPEV.\n\nNews has not mattered one bit. Record sales, expanding markets, new factories and cash influxes, none of it has mattered for these stocks. Fucking Wall St.", "score": 2, "replies": []}, {"body": "Dreams can be buy", "score": 1, "replies": []}, {"body": "Good luck to NIO (snicker).\n\nNIO is *not* the next Tesla.  It isn't trying to compete with Tesla here.  It's trying to compete with the Next Tesla, Volkswagen, Das Auto.", "score": -9, "replies": [{"body": "It’s true though", "score": 2, "replies": []}]}, {"body": "Won’t touch any China stock with a ten foot pole right now. So many have been scams lately and companies defaulting on their bond debt all over after https://www.google.com/amp/s/mobile.reuters.com/article/amp/idUSL1N2M80CJ to me too many announcements like this go unrealized. We will invest x for this sign the contract and 5 years later not one payment or anything has been done", "score": -11, "replies": [{"body": "I watched the China Hustle and totally understand  your concern. Main difference is Nio actually makes cars. I know people who lived in China a couple years ago who saw a few going around", "score": 9, "replies": [{"body": "I’ve lived there I’ve been involved in USITC.gov import injury cases. Which is exactly another reason not to be involved in any Chinese product with a domestic manufacturing presence. Which both the EU and the US has. A case gets brought they will get hit with anti dumping because they do that’s how they grow businesses. For reference the products I imported got a 350% tariff a 225% tariff and  another 200%+ tariff plus the Trump tariffs because that was the level of subsidies they received. It’s all available on USITC.gov. The court cases the individual manufactures and how they were subsidized. Most of those manufactures moved to south east Asia or south east US but the companies they operated under instantly closed shop.", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "I see Pinduoduo ads everywhere when I’m watching Chinese TV shows (official uploads on YouTube), and Mainland Chinese people are continuing to consume like there’s no tomorrow still, so though I don’t own any Pinduoduo shares myself, they seem like a very legit business imo.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Omg, yikes.. I had no idea. I don’t really understand why their government allows companies to get away with shit like this, when they know it hurts China in the long run and spoils things for the good ones.\n\nETA: Im super intrigued by this gossip you provided me with, where can I look up more info on this?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "\"Smart\" EVs. They do know how to market their products, gotta give em that.", "score": 1, "replies": []}]}
{"title": "$VIAC Bananas 🍌🍌🍌", "selftext": "**TL;DR**. \n\n*Even in a declining environment VIAC is still fairly valued at* **$37.83.**  \n*And in a bullish environment VIAC is fairly valued at* **$65.26.**.   \n*And based on the EPV valuation it is a woapping* **$86.23**   \n\n**VIAC offers a unique opportunity to take advantage of a current market in-efficiency.**   \nAs we all know by now a series of events lead to Archegos getting margin called. The Archegos fund was extremely aggressive and was operating under 5x leverage, heavily concentrating on Chinese and Media Stocks, such as BAIDU, BILI, TCEHY, IQ, VIAC, DISCA. There are many articles that explain how this margin call came to be. I won’t be discussing it here, because I want to discuss the opportunity this presents.\n\nWhether you think Paramount + is good or not. I still think there is still an opportunity to cash in on VIAC’s assets. VIAC has a strong balance sheet and many assets that are valuable in the content business regardless if Paramount + takes off or not. Let’s address the elephants in the room. Can Paramount + compete with the top players like NFLX, DIS, or even HBO MAX?\nI don’t think it matters if they can successfully compete or not because they have a huge library of content they can sell licences on and this makes them a valuable target to be acquired by the likes of AAPL or AMZN who are trying to pave their way into the streaming business. Their main revenue driver is cable television and everybody is cutting the cord these days so this is a shrinking segment, this does pose a risk to their recurring revenue. However they have another valuable asset that will help them offset this risk, and that is live sports. Although cable TV is shrinking, sports is definitely not and VIAC has many contracts and rights to stream live sports on their Paramount + service. None of the top 3 streaming services I mentioned does live sports streaming, and I’m sure they would love to add live sports on their library of contents. Their only competitor in the live sports segment FUBO. I do not perceive FUBO as a threat yet as they’re extremely overvalued and the business is losing money and has a lot of catching up to do. Even if FUBO is acquired before VIAC does, the acquisition of FUBO will force the other large streaming service to try and acquire their own to compete.\n\n**The Valuation:**\n\nI will present you with 3 different valuation all of them assume Paramount + is a flop and does not take off so I assume zero growth on their streaming service.   \n\nScenario one: Bullcase, I assume they will grow their total revenue by 3-5% for the next 5 year.  \n[Revenue Estimates](https://imgur.com/78x276u).  \n[DCF Valuation](https://imgur.com/s6TOmhj)\n\nScenario two: Bearcase, I assume their total revenue will be shrinking by  (-) 7-3%.  \n[Revenue Calculations](https://imgur.com/JUWIXuz).  \n[DCF Valuation](https://imgur.com/gra7R5E).  \n\nScenario three: I used an old school valuation method to value the business, Earning Power Value (EPV). In the EPV method it takes away the requirement for trying to predict the future and only takes into account the present business earning power. This method of valuation assumes no growth to the business. This method of valuation is a good valuation metric for valuing mature non growing businesses.   \n[EPV Valuation](https://imgur.com/un2fh7u)\n\n**Conclusion:**\n\nEven in a declining environment VIAC is still fairly valued at **$37.83**.  \nAnd in a bullish environment VIAC is fairly valued at **$65.26**.  \nAnd based on the EPV valuation it is a woapping **$86.23**. \n\nThis is not financial advice. I'm an ape", "id": "mv43dh", "created_utc": 1618963907.0, "score": 93, "upvote_ratio": 0.74, "num_comments": 48, "comments": [{"body": "VIAC is my second largest holding.  Added more today.  It's an insane value play imo right now.  Free money.", "score": 44, "replies": [{"body": "[deleted]", "score": 3, "replies": []}]}, {"body": "I rarely get to tell a investment success story. I bought last summer at 22 per share average. Sold at 49. Closed my eyes as it went to 105. Can't believe it dropped down to where I can get back in. Adding more shares tomorrow", "score": 34, "replies": [{"body": "Happy to see that you made good gains the 1st time around boss. Be careful on your 2nd trip tho. Coming from a dude who is in VIACA.", "score": 9, "replies": [{"body": "That's good generic advice but do you have anything more specific?", "score": 3, "replies": [{"body": "IDK what this dude's on about but I'm in on $VIACA after the whole Archegos debacle. Everyone was hoping for it to rebound like $DISCB did but its been pretty flat since its fall. The DD around here is that $VIACA was the stock that insiders bought and that it should correct faster than the other \"VIACx\" stock and maybe it has already corrected but I'm hoping for it to sit around $50-60/share", "score": 2, "replies": []}, {"body": "Well, I thought we wouldn't see VIAC drop to the mid 30 price range. If I could turn back time, I would have waited a bit longer before jumping in at the price I did. So, maybe hold off until we see some leveling off in price.", "score": 2, "replies": []}]}]}]}, {"body": "I'm betting some nflx money starts moving into viac.", "score": 8, "replies": []}, {"body": "Does your Bull thesis know that viac has issued VIACP shares and have class A shares as well.", "score": 9, "replies": [{"body": "Yeah, but it was at a significantly higher price than the current price", "score": 1, "replies": [{"body": "The preffered shares do change the dcf thou", "score": 2, "replies": []}]}]}, {"body": "I'm adding more as it dips. It's good stuff", "score": 7, "replies": []}, {"body": "HUGE earnings play coming up for $VIAC - send it and collect tendies", "score": 5, "replies": []}, {"body": " \n\n$NFLX disappointed on subs growth.  Market's gonna start looking at comps between $NFLX vs other streamers, including $VIAC, which looks very cheap.\n\nEven for acquisition.\n\n$VIAC 9.3 \n\n$NFLX 92.8\n\nDividend:\n\n$VIAC .96\n\n$NFLX NONE\n\nRevenue:\n\n$VIAC 25.2B\n\n$NFLX 24.9B", "score": 6, "replies": [{"body": "Very well put. Thanks for this.", "score": 3, "replies": []}]}, {"body": "You got a shoutout in an article today: https://cnafinance.com/viacomcbs-viac-stock-is-going-to-pop/", "score": 5, "replies": []}, {"body": "Bought 69 VIAC at 40.20.\n\nCause im retard like hat", "score": 4, "replies": []}, {"body": "EYYYYY we are eating well today!", "score": 3, "replies": []}, {"body": "It finished the day above the 200day SMA. Let see if it can stay above the 200day SMA through out the week. Any chartist care to share your insights? This is the first big green day since the sell off.", "score": 3, "replies": [{"body": "I’m looking to jump in but it is sitting below the 200 ema and the macd and other indicators all seem to hint it might go lower. The rsi is getting close to under 30 again. I might just slowly average into a position rather than trying to time it perfectly.", "score": 2, "replies": []}]}, {"body": "What data are you using for your assumptions on scenario 1 and 2 ? I hope it's the old crayon throwing method.", "score": 3, "replies": [{"body": "in the bull case I assume they would normalized back to their pre-covid levels and continue on a slow growth trend based on the industry average (pre-covid). And the bear case I assumed that they would not recover from Covid and their business just continues on a declining trend (I wanted to project a declining scenario to see what the current share price reflects on a DCF basis).", "score": 9, "replies": []}]}, {"body": "Been sitting on 3K shares for the past 2 weeks", "score": 2, "replies": []}, {"body": "VIAC only rocketed exponentially because Billy H was keep buying it. It's probably around fair value now if Billy didn't mess with it.", "score": -2, "replies": [{"body": "Right now, in some bar or boardroom, there is another Billy H telling his bro they can do this again but have a better exit strategy. \n\nHistory always repeats.", "score": 17, "replies": []}]}, {"body": "Bought at $41 when it seemed to have found a floor at $40. Left at $38 today. This shit is looking to have no bottom at sight...", "score": -5, "replies": [{"body": "you timed the bottom perfectly", "score": 6, "replies": []}, {"body": "Yeah I’m about to do the same this is just dragging", "score": -3, "replies": []}]}, {"body": "I'm out of the loop. Why the drop in price a few weeks ago and why is it going up (revenue isn't the only metric)?", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I would largely agree with what you said but also add “whatever the market would take so that they can make a profit when they sell.” They didn’t buy out of the goodness of their heart to help Bill out. They bought at those prices with the expectation they will be able to make money at that price", "score": 5, "replies": [{"body": "Well yes, but it's very undervalued traditional stock valuation metrics, which do apply here because they post profits and dividends. I bet that next year we see it come back up after the Q4 and 2022-Q1 earnings reports.\n\nDisclaimer: I own some VIAC, bought at $45", "score": 2, "replies": [{"body": "10.8x p/e. That's like a 70's era valuation metric. Like their programming.", "score": 1, "replies": [{"body": "https://www.businesswire.com/news/home/20210318005955/en/ViacomCBS-and-NFL-Reach-New-Long-Term-Multiplatform-Rights-Agreement-Through-the-2033-Season\n\n\nI don't particularly care about the rest of Viacom's programming.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I think people are waiting for the other shoe to drop. It'll go to 35 and then I'll look at it.", "score": 0, "replies": [{"body": "I woke up @ 1400 to see it was on the up-and-up. Almost bought another 100 shares. However, Im experiencing some apprehension after I bought in and watched it drop like a rock. I still have an open CSP @ $40 strike. If it drops 1-2% tomorrow or Friday, I'll prolly commit to 25-50 shares as a mini-mini yolo lol. So, I'm kinda following your sentiment at the moment, but I'm definitely happy to see a SOLID green day.", "score": 1, "replies": []}]}, {"body": "Stocks don't trade like this unless someone is stressed and looking to get out.  Who know how many shares are left to be dumped.  Looks like a better short here, would try a long at $30 maybe.", "score": -7, "replies": [{"body": "I do believe you are wrong. 😉", "score": 5, "replies": []}, {"body": "I bought calls a bit early, but this could be a thing. The price action certainly seems to suggest that people are at least afraid of the possibility of another block dump. Unless you're buying FDs, it'll probably work out anyway. Also could be unfounded fear.", "score": 1, "replies": []}]}, {"body": "I’m buying in purely because almost nobody is doing euro football coverage like Paramount+ in the states. It’s a bold move Cotton let’s see if it pays off for them.", "score": 1, "replies": []}, {"body": "Question is though, does VIAC show growth potential, does it produce great content that will be desired, etc?", "score": 1, "replies": [{"body": "It's not a straight forward answer. Their potential for growth is in Paramount + but is offset by cord cutting from traditional media. I think traditional media will shrink but will not completely disappear not for another decade at least. However, they have an edge when it comes to carving out a piece of the streaming pie. They have long standing contracts with the NFL and many other sports. They own their own studio and have experience producing their own original content. They can fund their growth organically because they generate a significant amount of cash, 29 billion and 18.4 billion in net income in 2020 and 2019 respectively.\n\nTo put it another way, they're showing up to a poker game with a really good hand, but the players on the table is some of the best players there is. How much of the pot they can take depends on how they play their hand.\n\nSo short answer is yes they have some growth potential, but there are caveats as to how much they can grow.", "score": 1, "replies": []}]}, {"body": "Viacom just crushed earnings 80$+ by September", "score": 1, "replies": []}]}
{"title": "Perfect Storm to Short $HD", "selftext": "* HD is up from $250 to $325+ in a month. 26/31 trading days with green candles.\n* Now finally HD was down today and the market is showing some cracks. VIX futures spiking this evening.\n* 1,000+ GA churches are calling on people to boycott HD because they haven't criticized the new GA voting law\n* Oh, and the George Floyd verdict is going to draw even MORE attention to HD's silence\n\nIf this isn't a perfect storm, I don't know what is...\n\nhttps://preview.redd.it/xu4ycvq77fu61.png?width=602&format=png&auto=webp&s=f5a279a9e339dce34d0985d1014ad9e896e8c004", "id": "mv49d9", "created_utc": 1618964484.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 47, "comments": [{"body": "Have u shopped for plywood lately? It’s tripled in price and is going to quadruple after everyone needs to board up their windows for the next round of riots!\n\nJk kind of.... I sold off my Home Depot a couple weeks back. Did well, but I agree it’s probably run out of steam", "score": 15, "replies": [{"body": "Bro WEYERHAEUSER is doing better than home depot because they make the plywood, I'm actually buying calls for their earnings every time I get my paycheck", "score": 4, "replies": [{"body": "Interesting I’ll keep my eye on it . I’m holding canfor which has been doing great for me although everything else I own has tanked horribly these past 2 days", "score": 2, "replies": [{"body": "Yeah I've tried posting about it on DD but it keeps getting removed because it's not GME.", "score": 1, "replies": []}]}, {"body": "What are you expecting the share price to do after earnings?", "score": 1, "replies": [{"body": "The earnings are being released before the market opens, so we see some momentum go up", "score": 1, "replies": []}]}, {"body": "Got in on this last week. Was up 80% on my calls in 3 days! You only doing calls or shares too?", "score": 1, "replies": [{"body": "Just calls", "score": 1, "replies": []}]}, {"body": "There is like no volume on these calls. Want to load up but not seeing any activity.", "score": 1, "replies": [{"body": "Yeah I know it sucks because I've been trying to post on DD but the moderators keep deleting the post for insufficient web links. We all know it's because it's not GME so they won't let me post it", "score": 1, "replies": [{"body": "Keep tryin'", "score": 1, "replies": []}, {"body": "I got my fills but per usual I top-ticked it. We'll see about earnings!", "score": 1, "replies": [{"body": "I hope it's printing now, it's trying to break $40", "score": 2, "replies": [{"body": "Printing reasonably well, resisting the urge to paper hand half the position.", "score": 2, "replies": [{"body": "I'm gonna hold till earnings, best of luck to you buddy. May the gains be with us", "score": 2, "replies": [{"body": "Back atcha. Tendies for breakfast, lunch and dinnah.", "score": 2, "replies": []}, {"body": "[https://www.reddit.com/r/wallstreetbets/comments/n12401/lumber\\_dd\\_week\\_ii\\_wy/](https://www.reddit.com/r/wallstreetbets/comments/n12401/lumber_dd_week_ii_wy/)", "score": 1, "replies": [{"body": "Bru we literally told them last week, I'm glad they finally started to notice the company.", "score": 2, "replies": [{"body": "Welp that sucked.", "score": 1, "replies": [{"body": "I should've sold yesterday, mines expire next week. Hopefully I can at least get my original investment", "score": 1, "replies": [{"body": "Good luck brotha. Do you know why the missed?", "score": 1, "replies": [{"body": "They only missed wallstreet expectations, I think it's too much demand and their  capacity is at it's limit to where it's not enough to go around. I also heard it was being shorted, but look at that volume today, we got most of them gains back.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I have a great Maxojir podcast[podcast](https://youtu.be/1KsExMm_Jus) about that for you friendo!", "score": 2, "replies": [{"body": "stupid question: if lumber demand is going up, and they increase lumber supply, wouldn't that price come down to equilibrium soon?", "score": 1, "replies": [{"body": "Sure. The info people like me are decyphering, is what materials are holding up that process. The bit about Resin and plastics production in Texas totally threw me for a loop and caused me to deeper understand the industry as a whole to see opportunities within it. \nI actually have a feeling Demand is going to outstrip supply for a very very very long time coming depending on things that happen with China. Canada’s gettin back to logging in a big way soon so those supplies are what we are counting on. Still, trucking problems.\nLots of fun stuff to solve young man.", "score": 2, "replies": []}]}]}]}, {"body": "You’re trading based on a social justice movement?", "score": 18, "replies": [{"body": "I have no idea what $HD has to do with churches in Georgia or George Floyd.  All I know is $HD is rockin business, & everyone I see around me has been bored so theyve been doing home renovations, planting flowers 🌷, & other mundane domestic things.\nEdit: Meant this as reply to OP.  oopsie on my part", "score": 10, "replies": [{"body": "OP shorting HD at a time when the housing market is a-boomin', definitely belongs here.", "score": 10, "replies": [{"body": "so, sell naked calls?", "score": 3, "replies": []}]}, {"body": "to be fair, I absolutely HATE going to HD. everything they sell sucks and breaks, and it takes forever to get in and out of there because the aisles are always filled with piles of impulse-buy products that you have to shoulder your way past. but i think both of those are pretty strong indicators that they're drowning in business", "score": 1, "replies": [{"body": "If you think everything breaks at HD, then you haven't shopped at Kitchen Stuff Plus (one of the largest houseware stores in Canada). Dollar store quality at 10x the price. That crap disintegrates the moment you try using it.", "score": 2, "replies": []}]}]}, {"body": "Haha isn’t everyone today. Tomorrow morning is going to be wild. 7% spikes?\n\nThe tech shakedown bad news bombardment also won’t be effective through Friday so.. the small market fish in-the-know will be showing their hands early and buying. \n\nCheers to the jury! Big thx for all reasons.", "score": -3, "replies": []}]}, {"body": "I gave you an upvote because of how fucking stupid this is, and how great the loss porn can be.", "score": 4, "replies": []}, {"body": "take a full screenshot you fake ass bitch. ToS paper accounts can be easily cropped.", "score": 3, "replies": []}, {"body": "What a fucking stupid post", "score": 6, "replies": []}, {"body": "Come to think of it. What a shitty post. Go talk that shit in r/politics or FB or something.", "score": 7, "replies": []}, {"body": "Why should a hardware store have a statement on anything like that?", "score": 2, "replies": []}, {"body": "So because a fucking home improvements retailer isn't getting political, you short it as a social justice movement?  Hot damn, you truly are retarded.", "score": 2, "replies": []}, {"body": "Dear lord, treating people like they're too incompetent to get IDs us the height of white elite racism.  Protecting democracy should be the top priority, it's embarrassing that many in this country voted for an actual segregationist, please with your pseudo-racist rhetoric.  An actual segregationist is in the white house, the fucking VP pointed that out, and they shut her up with a promotion.  The racists are in the whitehouse, buy puts on those evil fucks.", "score": 3, "replies": []}, {"body": "I am in $HD and will be long term.", "score": 2, "replies": []}, {"body": "I'm from a third world country where the poorest fucking people still show up to vote with a government ID.\n\nWhat does Home Depot have to do with having to show your driver's license or state ID to vote?\n\nDid Home Depot pay money to the defense in the Chauvin case or what?", "score": 3, "replies": []}, {"body": "WEYERHAEUSER is a better bet, lumber prices  are up and they have earnings this month and I'm sure it will do better", "score": 1, "replies": []}, {"body": "The gap down on HD is going to be a real gap. I see this continuing to go up as everything eventually does but of course a correction is always needed", "score": 0, "replies": []}, {"body": "/r/politics is leaking, good luck tho dude. got any other companies you have hate in your heart for but that have solid fundamentals and employ a ton of people?", "score": 0, "replies": []}]}
{"title": "TSLA YOLO", "selftext": "", "id": "mvg1tv", "created_utc": 1619012881.0, "score": 37, "upvote_ratio": 0.6, "num_comments": 48, "comments": [{"body": "Papa Elon tends to deliver, good luck to you sir", "score": 6, "replies": []}, {"body": "These are going to print", "score": 11, "replies": [{"body": "Well the 705 is already making me about 1k. Not selling until the 26th though at least", "score": 7, "replies": []}]}, {"body": "Yolo just like that guy trusting the auto pilot", "score": 34, "replies": [{"body": "I know you're just making a joke, but that guy most probably didn't even have autopilot. Tesla FUD in the media is so tiring.", "score": 21, "replies": [{"body": "Once Musk proves that autopilot wasn't engaged, my calls will soar ☺️", "score": 19, "replies": [{"body": "Of course we need to wait for that, but keep in mind that NHTSA has investigated about 30 earlier incidents, many of which reached the press like this case did, and Tesla was cleared in all of them. It's not the first time the press is trying to paint a bad picture of Tesla. I'd the chances these people were not using autopilot or did use it but were still responsible for what happened is at least 99%.", "score": 6, "replies": [{"body": "I only buy TSLA when there's scary stories about it in the news. It's been happening for nearly a decade.", "score": 6, "replies": []}, {"body": "Yeah but who knows if it'll come through before my contracts expire anyway. I'm just hopeful for earnings reports.", "score": 6, "replies": [{"body": "I think you'll be good. Earnings will be good. Also don't think the impact of the crash \"news\" was that big on the stock. Aside from traders that will jump right back in if the trend reverses, only an idiot investor would sell based on unverified news, and these people usually FOMO back in when they find out they were wrong.", "score": 1, "replies": []}]}]}, {"body": "We are talking about a generation of retards who were/are still eating laundry detergent. The crash was just a hit job by the msm.", "score": 1, "replies": []}, {"body": "**our** calls, brother. this is the way", "score": 1, "replies": []}]}]}, {"body": "sorry but FUD will get reported. do ur research first before making jokes", "score": 1, "replies": []}]}, {"body": "YOLO means like 95% of your account. Is that the case?", "score": 3, "replies": [{"body": "Closer to 98%", "score": 12, "replies": [{"body": "Fucking sick, good luck to you", "score": 6, "replies": []}]}]}, {"body": "Betting against market momentum. Part of a balanced diet rich in crayons.", "score": 4, "replies": [{"body": "Instant returns! Green day for Tesla and I'm up 800 today! $60 total because the 730 call obviously isn't in the money yet", "score": 9, "replies": [{"body": "Nice day so far! You just hit $730!", "score": 3, "replies": [{"body": "Hit 731 earlier but I'm hoping tesla has a nice aftermarket", "score": 2, "replies": []}]}, {"body": "Yeah this isn’t a dumb play. You sure you meant to post it here?", "score": 0, "replies": [{"body": "Well the part that makes it dumb is that I'm currently homeless and YOLOing my savings", "score": 8, "replies": [{"body": "Looks like you won’t be homeless for long. Picked up 4k worth of options a bit before close. We could see 800 in the coming weeks", "score": 2, "replies": [{"body": "Actually I'm only homeless because my job pays in a way that apartments won't accept my proof of income, so I'm between jobs right now to go somewhere that pays better and does direct deposit. Glad to hear you're on board!", "score": 3, "replies": []}]}]}, {"body": "Although I've taken my original investment back out", "score": 6, "replies": []}]}]}]}, {"body": "You’re going to do well tomorrow and next day. I have 860,940,1000,1025 4/30 calls that need help 😅", "score": 2, "replies": [{"body": "Oh my. How'd you end up there?", "score": 2, "replies": [{"body": "I rookie bought the 1000s  on the ride up to 780 (bought the 1025 when they hit 116% profit ) then missed my chance to sell. then averaged down on some once it tanked.", "score": 1, "replies": []}, {"body": "The 1000s were up big time when we touched 780 people were buying calls like crazy and I didn’t pull out.", "score": 1, "replies": [{"body": "Well hopefully it takes off to $1000 so you can break even and I can make them tendies", "score": 2, "replies": [{"body": "If we see a sharp run up to 900 territory I should be in the green. The question is do I big dick them over the weekend and sell Monday or unload Friday.", "score": 2, "replies": [{"body": "This. In same boat with my indecisiveness...", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Those should be puts good sir", "score": -8, "replies": [{"body": "Maybe the 730 but not the 705", "score": 8, "replies": []}]}, {"body": "Niiiice", "score": 1, "replies": []}, {"body": "How’s are they looking now? 👀", "score": 1, "replies": [{"body": "When it was at 731 earlier I was up 1.2k total but now I'm only up 200", "score": 7, "replies": [{"body": "Just wanted to know, I seen the earlier jump. I was looking to join you but nether less it’s to late.", "score": 1, "replies": [{"body": "I still think it'll go up on the 26th for earnings", "score": 1, "replies": []}]}]}]}, {"body": "these are gonna print if they aren't already sheeeeesh", "score": 1, "replies": [{"body": "The 705 is up 1.3k but 730 still is down 630", "score": 1, "replies": [{"body": "Last 30 minutes was very good for you!", "score": 1, "replies": []}]}]}]}
