{"title": "Hypothetically, I imagine stocks would gain value during inflation, why don't they?", "selftext": "Since inflation decreases the value of money it generally raises the prices of other things. I would definitely imagine that part ownership in companies (stocks) should gain value in relation to falling currencies. Wouldn't it be better to hold these companies rather than cash?\n\nSo why is it that stock people are often fearful about inflation?", "id": "oqyi2c", "created_utc": 1627161774.0, "score": 189, "upvote_ratio": 0.93, "num_comments": 91, "comments": [{"body": "From a pure discounted cash flow valuation perspective, I would assume interest rate to rise following higher inflation. Thus, all cash flows are discounted at a higher rate, and in turn result in a lower present value.", "score": 142, "replies": [{"body": "It’s this. But to explain this in simpler terms, you could think about it as follows: currently bonds are not a very helpful asset class for investors looking for growth (super low return/rates right now), but as interest rates rise, that gives investors the ability to gain a height return from an asset that is less volatile (less risk) when compared to equities or other assets. So basically it comes down to risk premium and the opportunity sets that are available to investors. As rates rise people will take the opportunity to have predictable gains with less risk than stocks...puts downward pressure on stocks.", "score": 34, "replies": [{"body": "Lol umm no.. bond prices have an inverse relationship with interest rates. So when interest rates, bond prices fall. \n\nYou are looking at it from a basic level point of view rather than a macro economic point of view. \n\nTo explain to OP, higher inflation makes things more expensive when the economy is growing too fast.. simply put all goods and services increase in price and lowers the purchasing power of the dollar.\n\nBanks or the Fed (in the case of America) implement their Monetary policy by increasing interest rates to battle against inflation and slow down economic growth. \n\nRising interest rates slow inflation because when    price of borrowing increases, it discourages spending and encourages consumer saving, leading to a decrease in the overall money supply in that given economy. \n\nThese higher interest rates then get passed on to the prime rate ( the rate banks charge their clients to save, borrow and invest with them). \n\nWhat happens? \n\nWell everyone’s gotta pay there bills, and because of higher rates the large majority of the economy now has to pay more for money borrowed, which means less overall money to spend on goods and services of companies. \n\nThis eventually lowers company revenue and net profits. \n\nSecondly, the suppliers of the companies make less money so they pass these rates on to the companies in the form of higher costs with regard to supplies and raw materials. \n\nConclusion: \n\nBecause the company have less money coming in from investors while also having to pay more for their raw materials, this results in less free cash flow needed to operate, expand their business and pay dividends to shareholders. \n\nThis causes the discounted future cash flows to be reduced which in turn, depreciates the net present value also known as the intrinsic value of the company, which results in the potential decrease of a companies shares. \n\nIf this occurs to multiple companies that make up a large percentage of a certain index, it can also lead to a bear market. \n\nAlthough it’s important to note that higher rates are positive to certain sectors and industries such as the financial services and banks stocks, because they can charge more for lending.", "score": 30, "replies": [{"body": "That is the normal way to look at it however  , Facepalm, our president last week came out and said to battle inflation the country needs to borrow and print  4 trillion dollars and this will stop inflation (scratches head)", "score": 12, "replies": [{"body": "Having a federal budget deficit or a negative balance isn’t necessarily a bad thing as long as the countries uses the debt as an investment to prevent an economic downturn or stimulate the economy. \n\nIf they prevent to do this, then we can call it an un-healthy type of debt. Debt that doesn’t produce future economic benefits. \n\nFor example incurring debt to complete your MBA but with the potential to increase your salary by 200 - 300k working as a banker or at a hedge fund. \n\nYou’ll be able to pay back your debt within a couple of years and then everything else is free cash flow. As such, we can say that the debt was a ‘healthy debt’ as a form of educational and career investment. \n\nDebt also fosters strong international relationships. For example China is one of the biggest purchases of American government bonds.\n\nAmerica returns the favour by providing liquidity in the Chinese market by outsourcing many manufacturing process in China.", "score": 8, "replies": [{"body": "But then the question arises how much do we spend each year to just service the debt", "score": 1, "replies": [{"body": "However long it takes. \n\nAmerica is in a unique position with regard to borrowing debt because they can pay back the debt more easily than other countries because they have a very liquid economy and most trade and debt financing is done with the American dollar. \n\nAlso, debt repayment goes beyond our generation. \n\nThere are many countries that are still paying back their debts owed to America from WWI and WW2, that’s almost a century ago. \n\nUK for example borrowed billions from America after WW2 in order to fund all the damages and recovery caused by the war. I believe their last payment was in 2015, about a 100 years later.", "score": 5, "replies": [{"body": "US does not charge them interest\n\nThink about your credit score let's say that you make a $100000 Per year you are currently one million dollars in debt do you think a bank would loan you another $100000And what would your credit score be?", "score": -1, "replies": [{"body": "Wtf are you trying to say?\n\nSounds like you have very bad understanding of how bonds and national debt works", "score": 6, "replies": []}, {"body": "We also forgave a lot of the debt owed to us. And we pour in a lot of money into military aid for the same countries who now finance their enemy via energy pipelines.", "score": 1, "replies": []}, {"body": "(I remind you, Deutsche bank has done that!)", "score": 1, "replies": [{"body": "This is a USA question and deutch  bank doesnt  have the best rating  either", "score": -1, "replies": [{"body": " Never heard of Trump, then?", "score": 0, "replies": [{"body": "A non responsive answer think of the question and give us an answer", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Bonds and interest rates moved in the same direction in 2008 as default risk spooked investors.  Those Lehman Bonds are still seared in some peoples memory.", "score": 3, "replies": [{"body": "Generally speaking, they have inverse relationship with each other. What your taking about are called ‘black-swan’ events.\n\nThey are rare but they can happen, like the tulip mania, the dot com bubble, and in this case the sub prime crisis of 2008 that cause markets to behave erratically.", "score": 3, "replies": [{"body": "Did bonds do this during the covid drop?  I didn't follow the bond market las year.", "score": 1, "replies": []}]}]}, {"body": ">Because the company have less money coming in from investors while also having to pay more for their raw materials, this results in less free cash flow needed to operate, expand their business and pay dividends to shareholders. \n\nCan you explain how (after the IPO), companies get *any* money from investors, while they attract investors thru dividends which drain money from the company?\n\nWhat I'm saying is you haven't grasped the complexity of corporate finance via stock.\n\nBonds,  Yes.. higher interest rate, lower underlying value... Meaning *do not be a buyer of bonds with rock bottom returns* (like now). Profits generated in the bond market are by professional traders. If you haven't 24/7 availability to monitor the market, you're seriously risking a wipeout.  Maybe an ETF would be a gateway.", "score": 2, "replies": []}]}, {"body": "Bond values will drop as the rates rise simply because new bonds offer higher rates of return while the old stuff won't. The percentage drop will vary - long term bonds will discount significantly more than short term because short term can be cashed out and moved into higher rate bonds while long term is locked up at the lower rate for longer.", "score": 3, "replies": []}]}, {"body": "I think the argument is a bit different: especially for growth stocks which are not yet making money, higher interest rates(which can be a consequence of inflation) reduce their future earnings because the cost of capital takes a larger portion of their earnings.", "score": 3, "replies": []}, {"body": "This.", "score": 3, "replies": []}]}, {"body": "Higher inflation=higher interest rates.\n\nHigher interest rates=debt costs more, it is harder for companies to finance their business. Just like higher interest rates means it will cost more for households to pay off their mortgages. \n\nThis affects growth stocks the most as they rely a lot on debt for fast expansion.\n\n\"Tech growth stocks sell-off amidst inflation fears\" these type of headlines may ring a bell.", "score": 40, "replies": [{"body": "To add on, higher interest rates means that the present value of future cash flows is reduced, which makes companies less valuable.", "score": 12, "replies": []}, {"body": "Higher interest rates = higher inflation\n\nDouble edged sword.\n\nThe detrimental effect of interest rates on the market has more to do with margins.  Otherwise stocks are the best hedge against inflation as the inflation is literally baked in to stock prices.  A key reason that stocks only go up is specifically due to inflation.", "score": -2, "replies": []}, {"body": "and the tech stocks plummet after each such headline... and then they go ath again. really makes you wonder.", "score": 1, "replies": []}]}, {"body": "Look at the markets. Earnings are down and the market is flying. That sounds like a fairly positive reaction to inflation to me. \n\nIn terms of potential futures, many companies are leveraged to the hilt with dirt cheap debt, so any chance of a future rate increase could be bad news. I don't personally believe this is likely, because half the market and every government around the world are all massively in debt. I think low interest rates are here to stay until the currency crisis starts.", "score": 8, "replies": []}, {"body": "They do. Stocks are derivative assets and naturally rise with inflation over time. This is actually one of the reasons stocks tend to go up over time.", "score": 13, "replies": []}, {"body": "More inflow = stock price goes up.\n\nIf people can’t afford to put food on the table, they’re not buying stock.", "score": 38, "replies": [{"body": "But people are buying inflated prices of things, where the money goes to the company, which then goes towards increased wages, incentives, & stock buy backs. So in the end the stock still gets bought.", "score": 10, "replies": [{"body": "That’s only true for certain companies. When inflation hits, people will cut their spending on non-essentials, so while food companies may see their stock prices rise, luxury goods companies won’t likely.", "score": 8, "replies": []}, {"body": "You can't eat stocks.", "score": 3, "replies": [{"body": "speak for yourself", "score": 9, "replies": []}]}]}]}, {"body": "I always thought inflation makes it so people need money. So they start selling off and use that money on other things beside stock investing...which causes sell offs and price drops.", "score": 27, "replies": [{"body": "Yep pretty much. Stock sell offs, stocks not being bought, because people needs that cash, so stocks drop more than usual etc.", "score": 4, "replies": []}]}, {"body": "My thinking is interest rates would rise? Inflation is high which then forces the fed to raise rates. When they raise rates stocks will fall because everything is priced for low interest rate environments. Just how I have thought of it.", "score": 7, "replies": [{"body": "It doesn't \"force\" the fed to raise rates though. \n\nIf they want to reduce inflation, that is what they need to do, yes. But I am getting a stronger and stronger impression that despite what they say JPow actually wants 5%+ inflation for years to dilute the excessive leverage everywhere.", "score": 3, "replies": []}]}, {"body": "Firstly there's the effect on company earnings - with this, you'll have winners and losers. There are 2 sides to inflation - companies will benefit from rising prices, but get hit by rising wages and costs. Headline inflation is just a weighted average and isn't uniform across the economy, so individual company performance will come down to whether they can raise their own prices faster than their costs. Some will, some won't. Generally those with strong pricing power will do well and those with weak pricing power will suffer.\n\nSecondly you have the anticipated policy response - Central Banks react to higher inflation by raising interest rates. Higher interest rates are bad for stocks as it effectively raises your cost of capital. 2-3% dividend yields look great when bank deposits earn 0.1%, but not so much when they're earning 5%.", "score": 3, "replies": []}, {"body": "They do, just not at the rate of inflation because the price of goods are rising due to wage demands.", "score": 2, "replies": []}, {"body": "Stocks generally perform well in inflationary environments. The only exception in the US is the 1970s, and that was because of the nifty 50 bubble bursting. I dont know why inflation scares people out of stocks. Perhaps certain stocks are negatively affected, but as an asset class they do well.", "score": 2, "replies": []}, {"body": "They do. It takes some time.\n\n1 year targets don't tend to work for stocks. And by stocks I mean when analysts talk about stocks and inflation they mean broad market stock baskets.\n\nStocks do fine around 2-4% inflation. Not as well beyond that, but they perform well enough over a multi-year time frame historically.", "score": 2, "replies": []}, {"body": "Inflation absolutely increases the dollar value of all assets, including stocks, and don’t let anyone here tell you differently. \n\nCheck as many sources as you want, and do you own research, but [40% of the dollars in circulation ](https://techstartups.com/2021/05/22/40-us-dollars-existence-printed-last-12-months-america-repeating-mistake-1921-weimar-germany/) were just printed in the last year or so (please note that the term ‘print’ applies to digital as well as actual paper dollars, as 90-95% of all dollars exist only digitally). If you look at the s&p500 one year chart, you will see it’s up about 37% as well. Not a coincidence.\n\nBecause 40% of all dollars were just recently created, we are seeing inflation in the form of rallying from all assets, from real estate, gold, and electronic assets to cars, gas, and other commodities. Most of that stuff is up 40% or so compared to before the pandemic, and before the creating of so much new money.", "score": 2, "replies": []}, {"body": "The real answer is predictability.  In a mildly inflationary environment, its not a big deal for all asset types, including bonds.\n\nThe problem is when it gets to be unpredictable, businesses cant adequately plan for their prices, labor, and raw materials costs and some businesses suffer as a result.  \n\nIf inflation is 15% every year, I can plan around that.  If its 15% in June, 30% in July, 50% in August I cant plan around those price changes adequately if I have staff and inventory.", "score": 2, "replies": []}, {"body": "In the event that wages rise, earnings would expect to keep pace as prices rise.\n\nIf wages don’t increase, people spend the same amount, but get less, so companies suffer (although its not always clear which ones). On a scenario where wages don’t increase, but there is an average inflation of 5%, the consumer is getting about 5% for the same amount spent, but it isn’t across the board. Going to the movies, subscription services, a new car—various purchases might get delayed or scrapped altogether", "score": 1, "replies": []}, {"body": "People say they don't because they haven't before. But that doesn't mean they can't this time.\n\nImo we've already seen significant asset inflation, but thats not part of the cpi", "score": 1, "replies": []}, {"body": "They did gain \"value\". Stocks are the first thing to increase on prices when inflation kicks and this time was no different. Shiller pe ratio is very high right now. Later we will start seeing price increases in everything else. And stocks will start to decrease once people start selling to maintain their quality of life.", "score": 1, "replies": []}, {"body": "As others already mentioned, stock price relative to inflation is generally inverse.  Theory is this inverse relationship does not apply if the company has pricing power. Examples of companies with pricing power are the FAANGM (n here is for nvidia, NOT for the usual netflix).  I don't believe this theory has been proven cause since 2008 (10+ years), inflation concerns have been muted vs high level of concern regarding asset DEFLATION.\n\nFor me, I would just hold QQQ if inflation turns out not to \"transitory\"", "score": 0, "replies": [{"body": "It's just elastic or inelastic goods. Pricing power is important, but mostly here with elastic goods it is based on product or brand stickiness.\n\nI like equity REITs because they usually include inflation escalators and can outdo unlisted competition. Nice compromise between a company's growth and staying power. \n\nTalk like bonds, walk like equities. My kind of share. Inflation and deflation, built right in.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Inflation can be good for debt lol.\n\nLargely that is why the government promotes inflation *and* low interest rates.", "score": 1, "replies": []}]}, {"body": "Because many businesses will only aim to survive. \n\nTo make the example easy to follow we will assume inflation of 100% (doubling of prices). First of all, the business will need to grow earnings by at least 100% to break even against this inflationary environment. To do this, the business can sell double the amount of products or double the price of products and sell the same amount. Even further, the business will need to pay double the capex they usually pay, inventory costs are doubled, wages are higher. If all of this cost say $500M before inflation, they now have to pony up another $500M. Where are they going to find this money all of a sudden? \n\nA business that has the same earnings but lower capex, inventory etc will be better off. For example if their expenses are only $1M, then in that inflationary environment this will only double to $2M, an increase of $1M which is much smaller than $500M.\n\nHence many businesses will struggle to grow and only aim for survival. If there’s no growth, then stock prices will reflect that. Sure stock prices may go up, but they’ll need to return at least the inflation rate for any real returns.", "score": 0, "replies": []}, {"body": "You don’t understand how stocks are valued do you…", "score": -2, "replies": []}, {"body": "Yes, but stock is leading/ahead indicator, it goes up while inflation is about to happen. When inflation numbers are already reported, it might be already high and will be lower with expectation that inflation will be controlled.", "score": 1, "replies": []}, {"body": "Interest rates.", "score": 1, "replies": []}, {"body": "It's very partially correct. If it was simply a change in the value of the currency, you would see an equivalent adjustement.\n\nHowever inflation has broader effects on the economy and on company earnings. Higher interest rates mean it is harder for companies to get credit, so a company which does not have profits yet will have more problems in their balance sheet (think tech). Other companies, such as banks, would find the situation favorable, as they could get better returns on their loans. \n\nThis is just the tip of the iceberg, you can go very in depth on what the consequences of higher inflation are, and there are many.", "score": 1, "replies": []}, {"body": "Because that would just make too much fucking sense", "score": 1, "replies": []}, {"body": "Well inflation has been spiking for months now so..", "score": 1, "replies": []}, {"body": "Because other alternatives are even more inflated. Gold, housing, etc", "score": 1, "replies": [{"body": "Let's hope gold gets some of that housing level inflation. lol", "score": 1, "replies": []}]}, {"body": "Everybody needs to cash out to afford bread.", "score": 1, "replies": []}, {"body": "A galloon of milk is still the same here. So yeah, I'm still holding cash for the upcoming dips.", "score": 1, "replies": []}, {"body": "The government raises interest rates to keep inflation in check, thus bonds become more attractive because of higher yield so people cash out of stocks and opt for bonds.", "score": 1, "replies": []}, {"body": "Inflation is a risk to everything.  There is literally no upside to inflation.\n\nSerious inflation can be extremely unpredictable and dangerous.  In the late 1970s the US had sustained inflation and interest rates at nearly 20% each.", "score": 1, "replies": []}, {"body": "Look into how expectations drive inflation. Once you build an intuition as to why that happens and what the solution is—raging real rates, it’ll start to click. Inflation essentially requires grinding things to a halt or it could spiral out of control. So even though prices are up, real output gets hurt", "score": 1, "replies": []}, {"body": "I’m thinking it’ll be similar to what happened after they turned the money printer on after 2007. Stocks only go up. There’s so much cash out there. Whales will buy everything to prevent a market crash.", "score": 1, "replies": []}, {"body": "Did you forget about what happened in 2020? It's all been priced in.", "score": 1, "replies": [{"body": "A lot people around here probably never knew investing was a thing until the GME incident.\n\nTons of new folks in finance and they're just as clueless as many of us were when we first started...some cases even more stupid than we were.\n\nSometimes it just helps to point out the world existed prior to 2020 though.", "score": 2, "replies": []}]}, {"body": "When you have less money, or your money is worth less than it used to be...you can only spend 179 on a gamestop instead of 205.   \n\n\nfor example", "score": 1, "replies": []}, {"body": "If people have more money, stock prices will go up by having more demand for it.", "score": 1, "replies": []}, {"body": "Inflation in moderation is good for the economy. But when inflation gets too high, businesses need to make an even greater return to essentially make money.\n\nFor example, if a business is making 15% return on capital in a 2% inflation environment, they’re doing great. If they’re getting the same return in an economy with 20% inflation, they’re essentially losing money overtime and will go out of business.", "score": 1, "replies": []}, {"body": "They do, go look at the market from the bottom of March 2020 then zoom out a little bit more. A lot of that steeper than average incline is from money printing and asset price inflation.\n\nMany things haven't actually fundamentally changed with a lot of companies and how they do business from here and where we were at the top of February 2020 or the bottom of March for that matter.", "score": 1, "replies": []}, {"body": "Some do, some don't.\n\nStocks are valuable because they represent ownership in something that generates cashflow. Inflation reduces the value of those cashflows. Some stocks are highly valued because of expected future free cashflows rather than present free cashflows.", "score": 1, "replies": []}, {"body": "Corruption", "score": 1, "replies": []}, {"body": "Actual inflation (costs going up) is generally bad for business. If they have to raise prices, it means their profit margin is probably shrinking. In general it usually means goods and services are scarce. The economy is \"bad.\" But what most people think of inflation is just loose monetary policy, expanding money supply, negative real rates, \"free money\" for businesses / wealthy, more government subsidies, etc. Because that is what we have been familiar with the last few years. That is great for the stock market. So inflation is bad, but loose monetary policy that is probably causing it is good, so its the balance between the two that is important for stocks over all, not inflation or interest rates alone.", "score": 1, "replies": []}, {"body": "Stocks are anti-inflation investments (compared to most bonds). It is classic", "score": 1, "replies": []}, {"body": "They do.\n\nThey don't beat inflation though.", "score": 1, "replies": []}, {"body": "Have you been watching the market? We are so overvalued on ever possible metric. Mostly five stocks are holding us up now. Can wait for the fed to remove eight trillion from their balance sheet. Then the fun begins.", "score": 1, "replies": [{"body": "How does the fed remove 8 trillion from the balance sheet", "score": 1, "replies": []}]}]}
