{"title": "DD on Swedish Stocks, the Norhern \"pearls\"", "selftext": "# Greetings from Sweden!\n\nThis will be my first of (hopefully)many DD posts trying to share some tips about the stock-market I usually operate in. The idea is to provide some short but dense info about a variety of stocks I believe in and later make more in-depth DD-posts, based on whatever you guys catch interest for in the comments.\n\n**Why should anyone invest in the Swedish market you may think?** Well, aside from a stable finanse system, a stable currency/inflation and low geo-political risk the Nordic countries provide for a very large amount of the European IPOs (relative to capita). Of these countries, the Swedish stock market is by far the largest and most popular. Most individuals here also saves monthly in stocks/funds, causing a steady inflow of cash to the market. In fact on the largest European Index, Stoxx Europe 600, 5/10 companies in the top-ten performers for 2021 are registered in Sweden.\n\n**Good to know**\n\n* *Current exchange 1 USD = 8.55 (5 year avarage \\~ 1:9)*\n* *In 2020, due to Covid, the Swedish Government offered funds to any company who needed it. This came with a restriction that the company could not for FY20 give any dividends.*\n* *Due to high vaccination, among other, there are no more Covid-restrictions that affect the market at large.*\n* *I have only included stocks where total market cap surpass 300M USD with current exchange rate and price. In the comments I might share a few smaller companies I believe in, where you can do your own DD.*\n* *Some Swedish stocks are traded with an \"A\" and a \"B\" stock. Always choose the latter. \"A\" stocks are traded almost excklusively by institutions, the government and funds. A-stocks grant less dividends but more votes per share on shareholder meetings. Retail and more aggressive funds trade in \"B\"-stocks.*\n* *When I type* ***'SG'****, this refers to the \"Swedish Government\", and not the Stargate Programme. SG itself owns a lot of stocks in some companies. Mostly because it orginates from a state-owned projects.*\n* *TP = Target Price. I do not know if this is the official acronymn in English. Please do correct me if I am mistaken.*\n\n**Heavy Industry**\n\n* **SSAB B.**  \n\n   * Active within the Steel Industry this is one of the largest heavy-industry companies in Sweden. It specialises in higher tier product and is the leading manufacturer of plating for manufacturing industries. However, the large upside for this company is it's green steel project called \"Hybrit\" which is a co-project with the massive European (owned by SG) energy company Vattenfall and Europes largest iron mine, LKAB (also owned by SG). The aim is that \"Hybrit\" will remove all CO2 emissions in manufacturing steel-sponge by using Hydrogen. Along with heavy investments into Hybrit, the company has also purchased the largest steel plant in The Netherlands.\n   * When the pandemic hit in March 2020 the industry at large took a big hit, and especially SSAB since most factories with steel plating closed in Europe. This also reflected on the stock price. However, the company finances have not been as hurt. As mentioned in the \"good to know\" section the government have bailed out the company, paying for most of it's employees to keep the competency. In return SSAB have not given any dividends in for FY20 - which tanked the stock.\n   * SSAB have now turned a terrible year into it's best year ever (so far), helped by both a rising steel-price and a rising demand in all of it's markets. It is also one of the big winners on the large infrastructure-package that the US Senate just approved. The orderlogs are already filled for the entierty of 2022, according to the CEO, and they estimate they can raise prices with atleast another 150 USD per tonnage of steel sold. The infrastructure-package also fills the US orderlogs for the coming ten years. With all this said SSAB is about to make two record years in a row, but the stock price has been kept low by the Finnish government selling of half of it's shares and retail investors being a bit slow to buy in.\n   * The Stock currently trades at roughly 5$ a share. Morgan Stanley TP is 7.83$. Goldman and Sachs TP is 7.37$. This is on the short term, in the long term SSAB is expected to rise way more with production start of the Hybrit-project. Some estimates say 14-21$ by 2026, depending on competition. This makes for a 47-56% gain. However it is also expected that SSAB will give large dividends for FY21 to compensate for not giving out anything in 2020.\n* **VOLVO B (VOLV B)**  \n\n   * Most of you probably know about Volvo cars. Well did you know there is also a company called Volvo Trucks AB? Originating from the same company, Volvo cars took it's own way and was later sold to Ford and then on to Geely. It's not yet registered on any stock market, but there are rumors that Volvo-owned Polestar will make an entry to compete with Tesla (watch out for that one, Elon).\n   * Volvo Trucks is one of the leading producers of trucks **IN THE WORLD**, the 5th largest in 2020. This company makes for 66% of the total revenue for Volvo AB.\n   * Aside from Volvo Trucks, Volvo AB also makes excavators, busses, boat-engines and forklifts.\n   * Just like SSAB the stock price have not yet reached it's full post-covid potential. The price is barely up 10% since covid hit, but the numbers speak of completely diffrent potential. This has led to a large amount of insider-purchases, which itself is a good signal. The Board/CEO belives the price will shoot up - and so do I.\n   * The markets where Volvo operates is recovring from the pandemic and will reach new heights this fall. Recent numbers say newly registered trucks in the EU increased by 33% during Q2.\n   * Aside from the recovering and expanding market, Volvo have initiated a project together with the german (worlds largest) truck producer, Daimler. The project is called Cellcentric and aims to start industrial scale production of Hydrogen trucks by 2025 - the first in the world.\n   * Goldman and Sachs TP for Volvo AB is a little over avarage with it's 33.4$, which is a little over avarage. Current trading price is 24 USD. While this makes for a \"shy\" 40% short term gain, I expect large dividends for FY21 and then a continued positive trend as we move closer to the Cellcentric production line.\n\n**Military Industry**\n\n* **SAAB AB (SAAB B)**  \n\n   * SAAB, also known for it's no longer existing overly engineered automobiles, is one of the largest high-tech military industries. It is owned by a majority of the SG so they can regulate what they call \"ethical markets\". Basically they do not sell military supplies to any dictatorships, aside from Saudi Arabia and UAE. SAAB profiles itself as a \"defensive\" military industry, however as with all arms - where goes the line of \"defensive\"?\n   * If you are still intrigued, I will shed some light on the most known products they have. Aside from these I know of several others that I am not at liberty to share, since I know of them from my involvment in the Swedish Armed Forces, and these are not all official products yet. Let's just say I am excited for the future.\n   * Weapon / Defensive platforms under SAAB.  \n\n      * JAS 39 Gripen C/D, E, F. For any military enthusiast this is probably one of the systems you have heard of. This is a Swedish multirole-fighter jet. The recent Gripen F is a next generation fighter jet that is making headlines everywhere. Especially because of it's ability to compete with American / Russian / French equivalents, but at a much lower production and flight-cost. Making it a very popular choice for smaller economies. However this lead to three problems. First off, there are a lot of politics in these affairs and few countries end up saying no to US fighters - the perfect countries for this fighter is not within the Swedish \"zone of influence\". Secondly, Sweden is not apart of NATO. Automatically ruling out most NATO-countries currently due to coordination-possibilities with the US - this however might change in the near future. Thirdly, the no-dictator-rule makes for a difficult market. The only large customer is currently Brazil, who have said they are very content and want more. Other than Brazil, Sweden is the main market and a few smaller European countries have a lease-agreement with the SG.\n      * Carl-Gustaf M4. Named after our king, this is the next-generation anti-tank weapon. Originating in 1948 when some engineers sawed of the barrel of a tank and made a shoulder weapon out of it, this weapon system have now transformed into one of the best multirole firesupport systems in the world. Used by almost every western nation in diffrent capacity and purpose this weapon system has thousands of specialised ammunitiontypes. Making it unique, and a very good profit marigin. This weapons platform is also the basis for the AT4 which is a \"one-shot\" Carl-Gustaf, which is very popular within the US forces.\n      * A26 Blekinge-class submarine, an upgrade of the Gotland-Class submarine, is the best non-nuclear submarine that exists in this world. While cheap to produce it is impossible to detect and very sought on the global market. However, as far as I know there are few countries allowed to purchase it due to it's effectiveness and this not being a \"Defensive plattform\". Potential customers are basically all western-european countries. If you want to know more about this submarine, there is plenty of footage how the old version (Gotland-class) managed to remain undetected from the US Navy for **two years** and sink it's largest carrier in the NY Harbour in a war-game.\n      * Missiles and anti-air systems such as NLAW, IRIS-T and SDMS.\n      * Sensors- and radar equipment. Such as the new radar AWACS, GlobalEye. This has become one of it's largest sources of incomes and they have recently started to offer these as a \"bonus\" when making bids with the JAS 39 Gripen.\n      * Simulation Equipment for military exercises such as sensors, lasers and AR-simulations of battlefields.\n   * This got a bit too in-depth. But there is a lot to talk about. To be short the market prospects of SAAB is expanding. However due to ignorance and/or bad communication for the company, retail investors think about only the JAS 39 when they value SAAB. This is very untrue, but fortunate for you as an investor. It has led to a massively under-valued stock as the Gripen has not reaped any benefits. A word of caution though, this might be changing soon. The Finnish government has opened up for a massive order of the Gripen, due to politics between Sweden-Finland. If this goes through, and it looks like it might, the order is worth 11,7 billion USD. About 3x the overall market value of SAAB.\n   * The Gripen-affairs aside Kepler Cheuvreux updated their TP after the Q2 report (showing increased sales), new TP is 43,5 USD. Current trading price is 30,7 USD. An upside of roughly 42%.\n\n**High-tech Industry**\n\n* **Azelio (AZELIO)**  \n\n   * Now this is more of an \"up-comer\" and not established like the old industrial giants mentioned above. However, this might be one of the best plays you will ever make.\n   * Active in \"green-tech\", Azelio offers an energy storage solution that stores the energy as thermal heat in a container kind of similar to a thermos. The technology uses a Swedish historical favourite, the stirling engine. This makes it the most energy efficent energy storage solution for small to medium sized solar / wind parks, but can also be used with any other energy solution. The product is optimized after the solar cycle and their main customer currently is a test project with Morocco where they are building many, and large, solar parks.\n   * The product is early-stage but have managed over 2.000.000 hrs of usage without failiure.\n   * The product is cheap to produce, requires no expensive metals (unlike batteries) and have a much higher efficency than for example Tesla Battery Parks.\n   * In Q3 2020 when they started signing deals, they had requests with a total value of 19,88 billion USD. This led to the company taking in money to ramp up production as they could not nearly meet that demand.\n   * Having purchased Volvo's old industrial complex in Uddevalla they have now started their ramp-up. In Q3 2021 they will begin production, with an initial cap of 4 000 units per year. By 2022 this number will be 6 000, by 2023 they estimate 17 000 and by 2024 they estimate 34 000 units produced. All can be done without investing further in the infrastructure or expanding their factories.\n   * To pay for this ramp-up in capacity an emission was made to raise well enough capital, resulting in a dillution of roughly 14%. Since then the stock is down almost 60% from the ATH, after a magazine called \"Todays Industry\" questioned the CEOs usage of \"production goals\" and \"production target\" which tanked the stock. The CEO made a clarification by PR and the stock recovered a bit, but not nearly as much. As for now, the stock is trading sideways awaiting news that the production target/goal has been met and can begin in Q3.\n   * The company expects revenues of 2B USD by 2025, which by Swedish standards would value the company to 20-40B USD (10-20x sales). This would mean an increase in value of 40 700 - 81 428% compared to todays stock price of 4,2 USD, assuming no further dillution is made. Which, according to the company, is unlikely.\n   * CEO interview can be found by searching *\"Azelio at Pareto Securities Clean Tech Conference\"* on the tube.\n\n**Medicine / Research / Pharmaceutical**\n\n* **AegirBio (AEGIR)**  \n\n   * I won't go into depth here. The company develops and sells tests for diffrent viral infections. They have dussins, if not hundreds, in the pipe but you only really need to know about one.\n   * Covid-19 fast saliva-tests. Yes you heard right, as long as there is Corona somewhere in the world this company will sell like crazy. These tests gives a result in minutes, at minimal discomfort, and have the same reliability as the traditional tests (elegedly) that is being used by trained medical personel. These tests is likely something that will be our everyday life for the next few years whenever you go to an airport, or maybe even a sports event.\n   * The company has already begun recieving orders from Asia, which is the reason of the recent rally. Many more orders are expected in the future and given the delta-variant spreading in many parts of the world, some people calculate sales of this product alone motivates a stock price of 1023 USD. How you may ask? Well the stock hasn't been dilluted and there hasn't (yet) been a stock split. A stock price of 1023 USD is acutally \"just\" 23 148% up from todays price. What I want to point out here is that this is only looking at the Covid-19 tests, which is (hopefully) a short-lived market. Most retail investors in Sweden expect a much lower price but a lot of reinvestment to finish the tests for HIV and \\~70 other viral diseases. Which would create a stable and high priced stock with good dividends.\n   * The Covid-19 tests are awaiting FDA approval, which will be the biggest trigger in the near future and could come any day. AegirBio has already been granted a preliminary approval in June by the EU, but the formal papers are expected in August. As of now, the price is going down at a rate of 1-2% per day while waiting on a press-release. When the news will come is who's guess, but if you are feeling cocky there are probably dips to be bought. Another large trigger will be future large orders.\n(EDIT: Adjusted the above bullet point due to a missunderstanding on my end. Clarification: FDA Approval is not guaranteed by august.)\n   * The Stock is currently being traded at 44,2 USD. It's a high-risk play, if any bad news or no news come the stock will continue to fall. On positive news, however, you can expect 50-200% gain in an instant. This is a very monitored stock amongs local retail investors.\n\n**Gaming Industry**\n\n* **Media and Games Invest (M8G)**  \n\n   * Have you ever played a video game? Well then it's quite probable it was designed in Sweden and you just did not know it. Since the start of the 21th century the gaming industry has boomed in Sweden. Both in popular culture but also as for development. Large gaming conventions started around the Swedish \"Counterstrike\" success and established a community which have made the industry boom. Diffrent Swedish start-ups have launched everything from CandyCrush and MineCraft to Battlefield and the Paradox strategy games.\n   * M8G is a new, aggressive, company within the gaming sector. Deemed to be the next \"success\" they have raised a ton of capital and made several large acquisitions both in and around Sweden. With a 315% increase in value since IPO 9 months ago it's become the \"stock of the year\". However, the stock price has cooled off a bit, falling down about 10% from it's ATH in mid-july.\n   * This train has not yet left the station. The stock going down is merely the result of vacation-periods in Sweden. A 5-week period where no news are communicated. This is why the stock is no longer running, as the retail investors have become used to a steady stream of positive news.\n   * In late august the Q2 report is presented, and another rally is expected before and/or after the report. The stock is also traded on the German market, under the same name, due to a large acqusition. There the stock has gained a lot of attention with TP ranging from 9,59-11,92 USD. Currently the stock is traded at 6,78 USD. Which indicates an upside of atleast 41%. These TP does not take into account future acqusitions that are being talked about but haven't been signed/confirmed. That M8G cash reserve is still very high and they estimate at least two more acqusitions this year.\n\nThank you for taking the time to read this.\n\nI hope you will find some of it to your liking. As commented at the start, please do comment if you wish any further DD and I will try to make a more adequate post about that specific stock. I will also, ofcourse, use sources in that post. Here I left most of it out because it would be way too long.\n\nIn the comments I will put a few stocks with atleast the same potential, but a stock value of below 300M USD.\n\nMODS: I hope I used the proper flair, I'm new to this subreddit.", "id": "ou2ht3", "created_utc": 1627581064.0, "score": 140, "upvote_ratio": 0.93, "num_comments": 87, "comments": [{"body": "Totally cool for you to start this thread.  If others are reading this it would be awesome if others in other equity markets OUTSIDE of U.S. could chime in on interesting stocks from their country as well.\n\nOP, it would be great if you could focus on the stocks that trade OTC, i.e. an F series (ticker ending in F).  These would be the ones most of us U.S. folks would have access to as investing options.\n\nThanks in advance.", "score": 26, "replies": [{"body": "Thank you!\n\nThis is a new concept for me. My stock broker looks a bit diffrent than yours I am sure. I am trying to use Yahoo finance to find the US-tickers which differ.\n\nWould this be the proper ticker? To me, it simply shows as \"AAC\" or \"[AAC.ST](https://AAC.ST)\" when I looke at the Sek version on yahoo.  \nhttps://finance.yahoo.com/quote/ACCMF/news/", "score": 6, "replies": [{"body": "Most of the foreign securities will be traded on OTC markets and usually have 5 letter tickers with an \"F\" at the end signifying \"foreign shares\".  Have also seen some end in \"Y\" as well for \"holdings\".  Of course, well known companies will just be traded on the big boards as well as the native companies equity markets.  \n\n\nIf you see interesting stocks we would be interested to know just google the company name with \"OTC markets\" and it will show up on google if it exists for U.S. investors to easily invest.\n\nThanks in advance.\n\np.s. would be AWESOME to have other folks chip in on their country's \"hidden gems\" as well in a separate appropriately titled thread.  So many GREAT unknown stocks out there!", "score": 2, "replies": [{"body": "Thank you, I will keep this in mind for the next time!\n\nAs for the companies mention above, these should be it. :) \n\nhttps://www.otcmarkets.com/stock/SSAAF/news\n\nhttps://www.bloomberg.com/quote/VOLAF:US\n\nhttps://www.otcmarkets.com/stock/SAABY/profile\n\nhttps://www.otcmarkets.com/stock/AZLOF/profile\n\nhttps://www.bloomberg.com/quote/AEGIR:SS\n\nhttps://www.bloomberg.com/quote/M8G:GR", "score": 1, "replies": [{"body": "Awesome and the DD is much appreciated.  I think there are so many great companies in the world, but for most of us we don't hear about many of them.  Great to hear about a few of them from investors who would know them best.", "score": 2, "replies": [{"body": "I agree, trading outside your own region is always a pain. It's hard to know where to start and what the people that truly know about the company thinks ðŸ™‚", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This is a great write up, though personally I think there are much more interesting Swedish stocks besides those mentioned.\n\nSome of these include Evolution Gaming, Eolus Vind, Swedish Match, Desenio, PowerCell, and Pandox. (Many of these have been in my portfolio, though Pandox is my only current hold)", "score": 10, "replies": [{"body": "Mind doing a short blurb on each of those?  Thanks in advance.", "score": 2, "replies": [{"body": "Evolution Gaming, EVO on the Swedish exchange:\nOffering B2B online gambling solutions\n\nEolus Vind, EOLU:\nDevelopment of wind turbines \n\nSwedish Match, SWMA:\nTobacco company primarily selling pouches (snus)\n\nDesenio, DSNO:\nOnline wall art company \n\nPowerCell, PCELL:\nFuel cell company \n\nPandox, PNDX:\nHotel owner and operator throughout Europe\n\nEolus and Powercell are both ESG related. Evolution and Desenio are more growth companies. Swedish Match and Pandox are more traditional value companies", "score": 5, "replies": [{"body": "Evolution (EVO) has the largest market cap of any online gambling company listed. Quite the remarkable journey since ipo 2016.", "score": 6, "replies": [{"body": "Yepp, they did the right thing and was rewarded for it. While most gamling companies in Europe fled to Malta to avoid taxation and gambling rules, Evolution stayed and developed their finances without tax-cheating. When the legislators in Sweden (and Europe overall) took a harsh stand on the betting industry in early 2018 all but evolution lost position on the market and many even lost their license. Check out Kindred, it shows pretty well.", "score": 5, "replies": []}, {"body": "No doubt, itâ€™s had phenomenal growth. Unfortunately Iâ€™ve only watched this one from the sidelines.", "score": 3, "replies": []}]}, {"body": "What do you think about Desenio at the current levels? Just saw they almost dropped to 0 but can't find much news/articles.", "score": 1, "replies": []}]}]}, {"body": "Thank you!\n\nAnd those are some great picks too. Especially Eolus Vind and PowerCell will likely be winners of the decade. I am well read on all of these companies except Pandox, which I will definetly look into. However one only has so much money haha. I will definetly be investing in Swedish Match once the world realises that smoking cigarettes is bad and Swedish Match has the solution to all those people who can't quit. I'm a user of snus myself, like most Swedes.", "score": 2, "replies": [{"body": "I live in Norway, also a Swedish Match snus user myself :)\n\nPandox isnâ€™t a super exciting stock, but itâ€™s a safe recovery play imo. They serve primarily as a hotel owner (eg they own the asset) which makes them safer to weather a pandemic vs someone like Scandic who manages hotels (eg pays Pandox). Itâ€™s my second largest position.", "score": 3, "replies": [{"body": "That is quite brilliant! Thank you I will most definetly move a position there, even if I am a bit late to the party.\n\nBeing norweigan and all, do you know if Stordalen has any of his hotels listed? I can swear I've heard someone talk about investing related to his hotels but it may have been off-market.", "score": 1, "replies": [{"body": "I donâ€™t think it will be a home run at this point by any means, but I do think it will beat the market for the next year or two.\n\nI believe all of Stordalenâ€™s investments/hotels are private.", "score": 2, "replies": [{"body": "Agreed!\n\nAlright, that's a shame, but duly noted.", "score": 1, "replies": [{"body": "I used to work at a Nordic Choice Hotel in Sweden (Stordalen's  hotel chain) and the premises were rented off Pandox.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "What are your thoughts on Ericsson(ERIC), although they did lose a large portion of their market share in the rapidly growing Chinese market for 5G theyâ€™re increasing sales in other markets like the US, Europe, and Latin America due to huawei being excluded from many of those markets mentioned above. With them increasing both gross and operating margins I see this as a potential long term buying opportunity.", "score": 10, "replies": [{"body": "Okey, now I have the time so i will try to formulate an answer. Mind you that I will be doing some speculating, based on what I've experienced both as a former employee but also in the news overall concerning Ericsson. As for the stock price I assume that the US-listed version trades along with the Ericsson B-stock in sweden, and not too independently.\n\nSince the introduction of the \"smart-phone\" really, Ericsson have had a bit of an identity crisis. The company that invented the phone, no longer produced phones. This was a major blow to their industry, especially when iPhone 3 launched in Sweden and overnight everyone stopped buying the Ericsson phones. Speculating a bit I think they invested a lot of money in trying to catch up, but failed in the end. I remember just before Iphone 3 launched I would see commercials everywhere about the new \"Ericsson Walkman\" etc.\n\nThe core enterprise for Ericsson has always been patents. They research, patent and then earn massive royalities on these patents. But research can only be done to such a degree. In trying to expand the enterprise Ericsson have used it's patent gains to buy or found diffrent industrial or infrastructual companies that are to some degree related to their research. These bransches would grow and then they would sell the deparments off, or shut them down if they proved costly. The phrase \"return to our core values\" would be used and thousands of people would loose their jobs as production was moved outside of Sweden to lower production costs. This would reflect badly on Ericsson, but they would earn their money and then invest in ramping up more research for more patents. This is the \"Ericsson-cycle\" and it continues still.\n\nNow for the problems. Back in 08 when the financial crisis hit, Ericsson along with several other IT giants in Sweden (Telia, for example) employed a savings program. This program said that for every dime a boss saved on their department, they would earn a percentage (simplified) as a bonus. Now aside from firing tons of people and making bad choices these bosses made a mistake that Ericsson still pays for today. They sold all the company owned property, every single building. And then they would make a 1**5** year agreement to rent the building at a low cost. The problem was, these buildings were sold at way below market price and the lease agreements were limited in time. The bosses would fiddle the numbers and oh look their appartment \"saved\" 100 million USD in expenses. The boss would get a fat bonus and then retire, laughing all the way to the bank. (EDIT: was looking for a source, turns out this happened in 02, not 08. Likewise the same. You can directly translate this article, it should show the whole picture. [https://www.aftonbladet.se/minekonomi/a/yv42JJ/bonus-till-varje-pris](https://www.aftonbladet.se/minekonomi/a/yv42JJ/bonus-till-varje-pris))\n\nIn 2018 these agreements expired and all of a sudden the real estate brokers like KlÃ¶ver that bought these buildings wanted to re-negotiate the fee. Well big surprise the buildings sold at 10% of market price in 08 was now worth 10's if not 100 times what they were sold for. And trust me, these aren't any \"cheap\" buildings. Google \"Ericsson Kista HQ\". Well this resulted in massive expenses and a savings programme was introduced in order to raise money to buy back these buildings, or at least renew the lease-agreement. The company then cut off all their \"non-core assets\", including my deparment, and raised enough money to solve their problems. But now they had another issue, dropping patent earnings. Ericsson then decided to go all in on 5G and profile itself almost exclusevly to this.\n\nThe 5G investments still haven't payed off, but when they do Ericsson will start to properly thrive again as a buisness. But 5G roll-out in Europe/US is still in an early stage, hence the stock market is sceptical. I would guess that it will take another 1-2 years before we see the company start rising properly again. But I fear that it will never come near it's ATH, not in the near future anyway. That opportunity was forever lost when those former bosses screwed the company over for personal gain.\n\nIn short, expect that the stock will trade sidewise for another 1-2 years and then maybe make 50-100% increase over time. In the long run Ericsson is a safe investment, it won't drop, but it will likely not outperform the Index before 5G is deployed everywhere.", "score": 10, "replies": []}, {"body": "I actually used to work at Ericsson haha.\n\nI'll formulate a better answer later, when I have all the info, but in general I agree with you. However Ericsson is a bohemoth of a company so you might not get a very high increase in value of your stock, but in return the company at large is quite unlikely to make any major drops (if you buy now) and you will get a constant stream of dividends.\n\nI would say the same can be said for Telia and AstraZeneca. The latter shpuld be avalible on NASDAQ so you don't have to bother with the exchange.\n\nI'll get back to you later when I have the time. ðŸ™‚", "score": 8, "replies": []}]}, {"body": "eftersom jag oftast hÃ¤nger hÃ¤r sÃ¥ kÃ¤nns det lÃ¤ttare att handla pÃ¥ i usa, och det krockar inte med jobbet.\n\ntack fÃ¶r tipsen, ska hÃ¥lla koll pÃ¥ m8g och aegir", "score": 6, "replies": [{"body": "Absolut, jag handlar pÃ¥ bÃ¥da bÃ¶rser men har pÃ¥ senare tid breddat min position i Sverige eftersom jag fÃ¥tt bÃ¤ttre avkastning och dÃ¤rfÃ¶r hittat dessa \"pÃ¤rlor\". \n\nLycka till!", "score": 3, "replies": []}]}, {"body": "As a fellow Nordic I'd just like to say thank you. Ive been big on steel for a while and have been eyeing SSAB for an entry. I support your DD pretty heavily on it and would like to add that steel has the possibility to continue its run, and have HRC prices consolidate further. I'll be taking a position in SSAB with my next paycheck.\n\nAlso found Azelio to be very interesting.\n\nTo try to return the favour, I'll mention two stocks from Norway (who are sort of two in one): VGM and VOW. The first one is a factory for creating biofuel for steel mills that is currently under construction. They have already secured a contract with MT, which is the biggest steel producer and they spun of from VOW. The mother company is a waste management business, that mainly gains revenue from waste system related to cruise and marine ships. They've got an excellent leadership and are securing contracts left and right with big and reputable companies, and as the cruise sector is still very much a reopening play there's plenty of room to grow in my opinion.\n\nBut as the case of VGM shows, Vow continues to look for new markets where they can develop waste management technology and add new value from waste, which is something I'm quite bullish on for the green shift coming up.\n\nThey are obviously growth companies (VGM very much so), but I see a bright future with them thanks to how they're securing contracts with the big boys. I'm typing this out on my phone, so can't really show you the deets and all that, but I'd be happy to provide more concrete information when I have the time and if it is of interest.\n\nThank you again for sharing your DD, thorough and interesting cases!\n\nEDIT: I'm sure there's nothing special except for voting rights and what not, but are there any differences between share class A and B for SSAB? B class seems to be moving ever so slightly slower than A class shares - maybe it is because long forward looking institutions and other types of big buyers will look to acquire A class shares for the voting privilege? I'm such a small timer that I don't really care about voting, and would just prefer to get more shares out of my cash, so if my rational of difference between A and B class is right I guess B-class is the way to go for me?", "score": 4, "replies": [{"body": "Thank you! SSAB and Azelio are in the top 5 of my biggest long-term plays. I agree with you on steel futures, most likely we will see a steady increase in price until the next thing to affect construction and manufacturing. Something I did not mention in the post, because it felt too speculative, is that I believe SSAB will be a large winner on the expanded EU-regulations on carbon emissions. As I've understood it they will scale up import taxes on for example steel by 2% annually up until 2035. This means SSAB, and other European steel manufacturers, will be able to either annually raise their EBIT-marigin or kick the Asian steel plants completely off the market.\n\nI will most definetly be looking into VOW and VGM.   \n\n\nAs for your question on A vs. B stock you want to buy the B-stock. Right now the A-stock is traded higher because funds and institutions are more well informed and have thus increased their position where they can get the largest vote. You as a private retail investor want to get the B-stock as it will usually trade above the A-stock and because the dividends are larger in the B-stock (traditionally) - which will ultimetly affect the stock price. I recall the target price is 44 SEK on the A-stock, while the target price is well above 60 on the B-stock.", "score": 1, "replies": [{"body": "Yes, the interesting thing about the steel play is all the protectionism. I'm trying to play both sides, with shares in CLF, MT and SSAB. CLF is my U.S. play being the biggest american steel producer which is certain to gain from the newly approved infrastructure deal, MT overlaps as it is the global leader of steel production and sells to both EU and U.S. markets, and I see SSAB as a great play for the EU Green Deal drive that is bound to come. Great stuffs.\n\nI have seen varying price estimates for both A and B class stock, but seeing as we are kinda on the same page on what to buy I'll go with my gut and DCA into the B-class. Thanks a lot for the reply and insight!", "score": 2, "replies": [{"body": "No problem!\n\nWhile I haven't considered MT, I did make a move on CLF in early June. However I sold it off at +15% gain on the June 11th peak after I caught it being hyped on WSB and figured it would be traded very heavily. I missed doing my planned re-entry at the 19 mark, thinking it would drop lower. But if it trades down around 20 again I'll take a new position.", "score": 1, "replies": [{"body": "It has been following a pretty awesome scalping channel for the last year or so. I've managed to scalp 5 times for 18-25% gains, and it's starting to feel a little bit to good to be true. I would start looking to re-enter around 21 myself.\n\nI keep like 50% of my position in CLF, and scalp the rest. It's been good!", "score": 2, "replies": []}]}]}]}, {"body": "Have you heard of a Norwegian company called Nordic Nanovector (NANO on the Oslo BÃ¸rs)?\n\nMy partner recently started working for them (in the UK) and I'm keen to know if they're known at all in Norway.  They're a clinical stage Biotech with a radiotherapy candidate.\n\n[https://www.nordicnanovector.com/](https://www.nordicnanovector.com/)\n\nSeems a promising drug.  I've not invested in them yet but I do plan on doing so.", "score": 1, "replies": [{"body": "> NANO\n\nThe name rings a bell, and I believe it is one that is rather often discussed in the retail trading communities related to OSBX that I watch. I don't really do biotech as I have far to little knowledge, and don't really enjoy the wild fluctuations that can come with these stocks. Basically: Volatility combined with lack of knowledge just makes me stay away tbh.\n\nThat says nothing about the quality of the case nor the company, it's just something I have a principle to stay away from lol.", "score": 2, "replies": [{"body": "Thank you very much for taking the time to reply!  \n\nIt's a sensible approach you take.  I have, what I consider, my safe investments and I use biotech as my \"fun\" money.  Though it isn't always fun!\n\nCheers!", "score": 2, "replies": []}]}]}]}, {"body": "A) If I've made any spelling mistakes (I'm sure I have), remember my English is better than your Swedish.  \n\n\nB) List of >300M USD companies  \n\n\n* MilDef (New to the market. Makes military-grade technical equipment like unhackable laptops, servers etc. Expanding aggressively and has large orders coming in).\n* Zordix B (Like M8G, just newer and slightly smaller. Focuses on VR and AR.)\n* Cyxone (high risk play. Buy low entry right now. Might be able to cure Multiple sclerosis.)\n* BEYOND (Beyond frames, gaming company like M8G with the most beautiful rising canal you have ever seen. Check the charts. Target Price is 2-4 times the money by the end of the year according to analysts.)\n* Beowulf Mining PLC (Brittish-Swedish company that wants to open the first carbon-emissions free mine. Has found one of the largest ore deposits and with the highest quality iron ore in Europe. However they have been awaiting concession by the government for years because of reindeer herding and a 40km proximity to a UNESCO world heritage site. If it goes tits up your money is gone, if they get a yes (deemed likely) it's 10-20x the money if someone purchases the company. 400-440x the money if they start the mine without dillution).", "score": 5, "replies": [{"body": ">Beowulf Mining PLC\n\nThat's one is interesting, I checked their \"Admission to trading on AIM\" on London Stock Exchange, on their investor relations, in part 5 paragraph 9 they confirm there is no withholding tax in dividends.", "score": 1, "replies": [{"body": "Well no dividends in the near future on that company. But it might be because it's part british, like you mentioned?", "score": 1, "replies": []}]}]}, {"body": "I've been in on Paradox for a few years now. Their growth has taken a hit this year but they haven't released much these last few quarters. Victoria 3 and Vampire Bloodlines should be coming out soon and CK3 DLC should be a boost as well.", "score": 3, "replies": []}, {"body": "Swedish small caps are a big part of my strategy with Smart Eye and ZignSec currently in my portfolio.", "score": 3, "replies": []}, {"body": "As a swede i love this post but there are definitely more interesting picks in the Swedish market. These are all industrial stocks that already had a huge run up in 2020 and will most likely be pretty flat until 2022. Just my opinion tho", "score": 3, "replies": [{"body": "There are most definetly more picks out there with even a larger upside. I took these from the \"safer\" part of my portfolio. I tried to pick well established companies that are still undervalued and thus provide a great risk/reward ratio. Personally I think all of these stocks will reach +40% within 12 months, some way more. \n\nI did post a comment here with some other companies that are below the 300M dollar market cap. These have a significantly larger upside, but the risk is greater too.   \n\n\nIf you know of any larger companies that can provide a good upside, please do recommend. I'm always open to expanding my portfolio. :)", "score": 2, "replies": []}]}, {"body": "As a Norwegian, I appreciate this! The platform I use to buy shares is focused on nordic companies, but as I have spent a lot of time understanding Norwegian and American companies, I have always wanted to learn more about my Neighbouring countries. So this was well received!", "score": 3, "replies": [{"body": "Just saw you were from Norway and thought I would ask if you had any opinion on Nordic Nanovector (NANO)?\n\nI asked someone else in this same thread: [https://www.reddit.com/r/stocks/comments/ou2ht3/dd\\_on\\_swedish\\_stocks\\_the\\_norhern\\_pearls/h72ki5z?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/stocks/comments/ou2ht3/dd_on_swedish_stocks_the_norhern_pearls/h72ki5z?utm_source=share&utm_medium=web2x&context=3)\n\nKeen to learn more about them and see what sort of sentiment (if any) they attracted within their own country.", "score": 1, "replies": []}]}, {"body": "Another fellow Swede here, thanks for this! Have you followed the swedish real estate companies lately? They've had good bull run recently, do you know what was the reason for this and if they still have any potential? Or do you think they might be in for some setbacks now?", "score": 3, "replies": [{"body": "Hej!\n\nI'm not too well informed about the industry at large, sorry. If you are looking into the rental-industry I believe that is a high-risk play due to the market prospects. As for builders/renovators that sell apartments I believe the Covid-situation may provide a boom for the industry. I've in my current employment (as a project manager in infrastructure) seen that we have a great increase of old offices and hostels being transformed into apartments. This could probably provide for a new market opportunity as I imagine that office-space requirements will never truly recover.\n\nMind you housing-prices are at an ATH. If that were to change, the building industry would be the first to crash.", "score": 1, "replies": []}]}, {"body": "Good old Investor AB is worth a mention.  15.8 CAGR for the past 34 years. They've been on the stock market since 1917", "score": 3, "replies": [{"body": "Definetly! The reason I didn't include it in the post is that it's gained it's first \"sell\" recommendation due to the recent rally. I am divided on it's future hence I can't recommend it. Trust me when I say investing in Investor AB is a heavily debated subject among Swedish retail investors.", "score": 1, "replies": []}]}, {"body": "Fellow Swede investor here. The above analysis is on point with good picks. Nice work!", "score": 2, "replies": [{"body": "Stort tack! (Thank you)\n\nIt's great that you share this as I can imagine a lot of people might question \"why just these picks\". I would think so, too. In my case it's truly just because I think it's the best risk/reward companies on the Swedish Stock exchange.\n\nI'm really heavy on SSAB, I would say that is by far the best risk/reward. Downside is limited, if even it exists one, and the upside is atleast 40%. My personal estimate is 100-150% within 18 months, assuming Hybrit plays out well.", "score": 1, "replies": []}]}, {"body": "What about little known EVVTY?\n\nhttps://finance.yahoo.com/quote/EVVTY?p=EVVTY", "score": 2, "replies": [{"body": "Evolution is a good play, but more in terms of dividends. As for future stock growth I'd say the risk is quite high in regards to the rewars. I'm afraid that unless you already have a position, that ship has sailed.\n\nIf you want to look into something similar I would recommend Kindred. They have struggled more with the 2018 laws regarding online betting and is just now starting to recover. I made a swing trade there but have closed my position to go heavier on industry which I believe is a more reliable market. I'm not so sure betting companies will improve their value post-covid, quite the opposite really.", "score": 2, "replies": []}]}, {"body": "Thank you OP for this amazing source on quite exotic market for most of us!   \n\n\nI was wondering what are your thoughts on SKF? Seems to have an advantage over competition in terms of innovation and incredibly good opinion among professionals in automotive/ wind turbines.", "score": 2, "replies": [{"body": "Thank you for taking the time to read it!\n\nSKF is definetly a \"good-will\" enterprise that will remain among the largest manufacturers within ball-bearing(? Swedish word is \"kullager\"). I'm not too well informed on the stock at large, but just giving it a quick look it seems like a \"safe\" play in terms of risk. Analysts are divided in their estimates but most seem to say that the stock price is stable and that the company have \"underperformed\". This would indicate a large upside as I imagine the wind turbine-market will continue to grow and the production of contstruction veichles are expected to increase. As for short term, I would probably wait with a larger position up until early october as there likely won't be much movement until the Q3 report presented in late October. Ofcourse anything could happen (hence a small position might be wise). But in short I would expect the stock to remain somewhere from -5/+10% from todays value up until the start of October. This could be a risk-spread if you like the Volvo-stock however. SKF supply both Volvo and it's competition. Meaning if Volvo looses competition, SKF will still grow along with the market.  \n\n\nI hope this give some thought on it, but I'm afraid I can't provide any more details on it since it's not a company I have followed too well.  \n\n\nSKF-price: 229 SEK = 26,8 USD\n\nTP: 180-315 SEK = 21-37 USD. Avarage TP is about 30 USD.", "score": 2, "replies": []}]}, {"body": "> Basically they do not sell military supplies to any dictatorships, aside from Saudi Arabia and UAE\n\nlol", "score": 2, "replies": [{"body": "Right? Haha. Anyways they mean that Saudi Arabia and UAE are \"good dictatorships\" bringing stability to the region. So they are allowed to sell radar-equipment etc but not anything that can kill. However one could question if I'm not just as complicit if I sell you the targeting-system to the missile.", "score": 3, "replies": []}]}, {"body": "Evolution gaming is one of my best performing stocks! Love it!", "score": 2, "replies": [{"body": "Definetly a gain to compete with that of Tesla and Amazon. Congratulations!", "score": 1, "replies": []}]}, {"body": "You're definitely making a case for SSAB, can you say anything about their competitors or market share? Thank you!", "score": 2, "replies": [{"body": "Hey! Glad you're interested in SSAB!\n\nTruth be told I don't think SSAB have any major competition issues at the moment in the market at large (I will mention the US market seperately). As for their largest European competitiors they have the following;\n\n\\- High tensile steel; ThyssenKrupp AG, AG der Dillinger HÃ¼ttenwerke och Salzgitter AG.\n\n\r\\- Steel plating; ArcelorMittal S.A., Dillinger HÃ¼tte AG, Salzgitter AG, ThyssenKrupp och Voest Alpine.\n\nSome of these are also along with SSAB the major competitors for exports to South America and Asia. I would however say that the export market outside of the \"western world\" is the smallest market share for European manufacturers as they compete with local steel plants who have very diffrent climate regulations and productions costs. Especially on the Asian market with China having some major companies to produce volume.\n\nNow the reason I don't think any of these pose an issue to SSAB are the following;  \n\\- SSAB deals in quality over quantity. This is highly beneficial on the current market that has a higher demand than supply. Allowing SSAB to sell all of it's more expensive products.\n\nFor example this article (in Swedish, sorry) mentions SSAB as the world leader within High tensile steel. https://news.cision.com/se/jernkontoret/r/tre-stalman-delar-pa-kami-priset-om-en-miljon-kronor,c9523396\n\n\\- SSAB, aside from Hybrit, already have a good climate policy making it very popular among Scandinavian manufacturers. It is also my position that the largest European companies focus on other products such as steel beams for constructions. German plants is an exception here as they have a large car- and truck industry and thus a high domestic demand. \n\nNow as for the US market SSAB itself mentions the following competitors; Nucor Corporation, ArcelorMittal and Evraz plc. In Canada they mention; Essar Steel Limited.\r  \n\\- It is my belief that SSAB, along with other Swedish companies such as ABB, have a very good brand built up making it popular on the US market. While, at the same time competing with US \"nationalism\" that makes American companies choose American products when possible. To compete with this SSAB has started it's own American Enterprise called SSAB Americas. By doing this they have found a way around this barrier and managed to take the largest position on their US market in their section. If you would like to read more about the American market you can find info here [https://www.ssab.com/company/about-ssab/our-business/ssab-americas](https://www.ssab.com/company/about-ssab/our-business/ssab-americas)\n\n&#x200B;\n\nBest of luck!", "score": 2, "replies": [{"body": "Thank you so much for the reply! I live in Sweden so no worries about the swedish article. The company's financials look good as well after taking a look through them. \n\nI was looking for a good value stock to add to my portfolio, especially now that tech stocks, especially in the USA are abit too \"hot\" for my liking, and really the market as a whole.\n\nDoesn't hurt to diversify into the materials industry. I was also looking at Sandvik, but the higher PE ratio put me off. Sandvik is in the same industry as SSAB but they're not direct competitors right? So maybe comparing PE ratios isn't that interesting.\n\nIf you don't mind me asking, what sectors are you heavy in right now?", "score": 2, "replies": [{"body": "Oh haha!\n\nWell Sandvik is also heavy industry, but their products are very diffrent. Sandvik, mainly, sells tools and equipment to process materials like steel. Ergo, SSAB is likely a customer of Sandvik.  \n\n\nAs for Sandvik at large the official data that I can find indicate nothing that makes me want to buy it. They give out way too much of it's profit in dividends to expand and while the company is stable there seems to be little chance of the stock itself increasing in value.  \n\n\nHOWEVER I ran into this lady who claimed to work at Sandvik. She said to look into it because the new CEO is known for having a nose for growing buisnesses. She also threw at me some unofficial ideas that Sandvik would initiate a buy-back program and then go into roll-out mode and start buying up competitors to expand. If this turned out to be true, Sandvik may very well be the best long-term investment one could make - but as of now it's all just rumours. I haven't been able to confirm it. My GFs relative works at Sandvik, next time I meet him I intend to ask if he has heard any of this.  \n\n\nI have the following larger companies in my portfolio, they are listed with my largest possession at the top.  \n\n\nAAC Clyde Space (Long term possession, possibly will be the winner of the decade)\n\nSSAB\n\nBeowulf Mining PLC (High risk play)\n\nVolvo AB\n\nLipidor (Recently Accquired)\n\nMedia and Games Invest\n\nAegirBio\n\nAzelio\n\nSAAB\n\nAstraZeneca (Recently Accquired)\n\nTele2 (Recently Accquired)\n\nEricsson (Recently Accquired)\n\nPEAB (Recently Accquired)\n\nKindered Group (Recently Accquired)\n\nZordix (Reduced possession recently)", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Nice!\n\nWe do have a facebook group called AAC Clyde Space AB. I'll give you a quick recap though. I've been in the stock since 2017 and I'm just waiting for the boom.  \n\n\nAAC Clyde Space, originally Ã…AC Microtec, is an aggressive actor on the NewSpace market for cubesats. Basically they make anything from hardware to software and sell data (SDaaS = Space Data as a Service). They have through mergers and purchases become the worlds largest company on the market. 2021 will be their first year with positive EBITDA, and 2022 is estimated to be their first year with positive EBIT (no loans left). They own enterprises in Sweden, UK, Netherland and the US. Big names within the space industry are owners of the company.   \n\n\nBy June 2021 they had already beaten their estimated revenue for FY21. So I am very bullish on this Q3 report in august. Possibly it could be the last time we see this price level.  \n\n\nThe market that AAC operates on is vital the the future with everything from 5G to IoT. The market at large, however including other NewSpace aspects, is estimated to surpass the entire GDP of Mexico by 2035. And AMC is the largest actor on the market! It's only proper competition is a danish (but swedish based) company called GomSpace who gained a good rep early when they got a large order from the EU. However they are still struggling financially and is a small enterprise compared to AAC, even if the stock market thinks diffrently due to good IR. I expect AAC to purchase them in the future aswell.  \n\n\nAs for price range, anything around 3 SEK is a great purchase. Bear case is 4.6 kr, base case is 5.6 kr and bull case is 17.4kr, according to Edison Invest. This is very low, but they say it will increase when they see proof of profitability.  \n\n\nJust wanna point something out, their revenue this year is almost at the level of their entire stock value. Think about that one ;)  \n\n\nGood luck, hope to see you in the FB-group!", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Awesome, see you there! I use \"Crillex\" as my middle name on facebook.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Thanks for M8G, I bought in a few days ago because it I saw it curving upwards again. They just increased price target to 8.2 today.  Impressive find.", "score": 2, "replies": [{"body": "Glad you joined in! Fingers crossed for tomorrows report :)", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Oh yeah definetly an interesting company, I just don't have it in my growth-portfolio. I think Embracer will keep growing - just not as aggressively as the mentions in the post. Embracer could probably be a good dividend-play.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Embracer is a company that, unlike it's competition, kept their HQ in Sweden and thus followed Swedish Gambling regulations. The competition meanwhile had moved their HQ's to Malta to cheat the gambling rules and tax-legislations. When the tone hardened on this in early 2018 the industry at large took a massive hit but Embracer, already playing by most rules, gained a massive share of the market compared to it's competition. These competing companies have now regained momentum after adapting to the legislation which is why I believe that Embracer will no longer grow as aggressively.\n\nCheck the graph for Kindred Group, who is based in Malta, and you can make a clear comparison.", "score": 3, "replies": []}]}]}]}, {"body": "Under 300mm cap we consider a penny stock and are not allowed here, please dont mention them.", "score": -2, "replies": [{"body": "Yeah I excluded them from my post. I just felt like mentioning them in the comment-section as they have target-prices that would leave them well above 300M USD. If the mods have an issue with that I can delete my comment, no problem.", "score": 1, "replies": [{"body": "Yes please remove any comments with those under that cap or under it in last 6 months per rule #7", "score": -1, "replies": []}]}]}, {"body": "So first for all, what about witholding dividend taxation? It is to apply for relief at source or for refund in accordance to double taxation treaty? Maybe those companies only do buybacks which avoid this problem? Anyway nice post, reposted this to r/EUStock.", "score": 1, "replies": [{"body": "Thanks for the repost!\n\nI'm not sure I follow your question. Are you talking about the company paying taxes on dividends or retail investors paying taxes on their earnings?\n\nIn Sweden we have an account type called \"Investment-savings-account\" or ISK. Using this account type means you pay 0 taxes on your earnings. Instead you pay 0,375 % tax annually on your total possessions on the account. However if I take dividends in the US I do have to pay the US taxes. I doubt that you would be taxed extra as a foreign investor, but your own tax rules will probably apply.", "score": 1, "replies": [{"body": "You guys have it so much better than us Danes, in that aspect! :)", "score": 2, "replies": []}, {"body": "So you have no idea about dividend overtaxation. Sweden dividend paying company have to apparently withhold 30% of dividend, in my case thanks to double tax treaty it should be only 15% but for do it countries have special procedures to avoid it at source or claim refund.", "score": 1, "replies": [{"body": "Oh now I understand what you mean.\n\nAs far as I know this does not affect you as an investor. The taxes for dividens are payed by the company, just as they would a salary. Hence when a company say they are giving out 7 SEK in dividends, it actually cost them 10 SEK. The double taxation you are talking about is simply that the company can not make tax deductions in the coming years for a lowered value in it's balance sheet. Which is very logical.  \n\n\nI have never had to pay or even specify any dividends in my tax declaration towards the Swedish government. However this is because I use an \"ISK\" account and that is one of it's privledges.", "score": 2, "replies": [{"body": "It actually affects me as foreign tax resident. Swedish tax on dividends is 30%, so I get paid 70%. Here rate is 19%, so but our countries made a treaty and Sweden have right to take 15% maximum, and I should declare and pay here a difference - 4%. in result if I do not use \"relief at source\" scheme (send papers earlier and get 15% taxed) or later reclaim a refund from Sweden tax office, I get taxed 30% by Sweden and may get asked by my one for another 4%. That's my interpretation after some researching, investors should always check tax residency of company they own. Fortunately EU noticed this is a pain in neck for crossborder EU investors and is going to mandate for members a simple and consisted relief at source procedure. I once made a post about that.", "score": 2, "replies": [{"body": "Duly noted, thank you. I'll try to mention this in the disclamer the next time I post a dividend stock.\n\nSome of these stocks do have dividends, but most are still growth companies. Do you pay taxes on your gain in stock-value too or is it only dividends?", "score": 1, "replies": [{"body": "As far as I know only dividends. In some countries it works different, for example in UK there is no withholding dividend tax, but there is special tax based on transaction value, 0,5% if I remember correctly. Actually much easier for retail non-residents, that's a reason I will have some UK companies in my pension account.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "[https://finance.yahoo.com/quote/CLNK-B.ST/](https://finance.yahoo.com/quote/CLNK-B.ST/)\n\nCELLINK\n\n3D bio/organ printing\n\nalmost 250% up in 1Y, about 125% up YTD.\n\nOne of my best performing stocks ever. Shame I didn't buy a lot (only 3K), while I put like 50K in BIDU :-(", "score": 1, "replies": [{"body": ">CELLINK\n\nHey, a win is a win!  \n\n\nI don't know much about BIDU, but I stay away from the chineese stock market since they imo does not classify as a \"stable market\". Another con is that all chineese companies can be siezed by the chineese government. This is not very common, but definetly a risk that it will happen if say the overall economy tanks and the chineese government feel like making a bit of money.", "score": 1, "replies": []}]}, {"body": "Been following M8G for a while. Looks like it's been tanking", "score": 1, "replies": [{"body": "Yeah, personally I tripled down yesterday. It's been a bit hesitant following it's expansion. Report is due soon and I expect it to blast way beyond it's ATH when it's released.\n\nOverall the gaming sector have been loosing momentum the past two weeks. A few bad reports within the sector and some Chineese officials calling gaming \"opioid for the soul\". M8G isn't exposed to the Chineese sector however and the pre-released numbers are a big tell that the coning report will be impressive.", "score": 3, "replies": []}]}, {"body": "Any news on Azelio? The stock price looks like it could be worth a buy these days. Do you know if they are stil on track with the development of their business?", "score": 1, "replies": [{"body": "Effectively 0 orders for the entirety of 2022, meaning very little market interest has been shown in their product. Production was supposed to be ramped up during 2022 but that also went to hell. All in all I would stay away.", "score": 1, "replies": []}]}]}
{"title": "Elon Musk on Twitter: Tesla AI Day August 19th", "selftext": "", "id": "otq2hn", "created_utc": 1627531381.0, "score": 298, "upvote_ratio": 0.97, "num_comments": 93, "comments": [{"body": "Get the Tesla AI Day bingo cards ready", "score": 81, "replies": [{"body": "I've got $5 on 'order of magnitude'", "score": 71, "replies": [{"body": "Solving real world problems", "score": 44, "replies": [{"body": "Step change", "score": 33, "replies": [{"body": "What are you doing step change?", "score": 16, "replies": []}, {"body": "â€œFirst principlesâ€", "score": 20, "replies": [{"body": "Tezzla.", "score": 20, "replies": [{"body": "Neural network", "score": 5, "replies": [{"body": "Dojo", "score": 6, "replies": []}]}]}]}]}]}, {"body": "I'll raise you $10 for \"in two weeks, maybe 3\"", "score": 23, "replies": []}, {"body": "I will take a shot every time he says that. I like to live dangerously", "score": 4, "replies": []}, {"body": "Labelling", "score": 2, "replies": []}, {"body": "Should be at least $10 to make it apt.", "score": 1, "replies": []}]}, {"body": "\"I'm very confident\"", "score": 21, "replies": []}, {"body": "99.999..%", "score": 19, "replies": []}, {"body": "Building the machine that builds the machine.", "score": 13, "replies": []}, {"body": "Unknown unknowns\n\nComplete redesign", "score": 10, "replies": []}, {"body": "Level 5 by the end of the year", "score": 19, "replies": []}, {"body": "Â«Â HugeÂ Â»", "score": 8, "replies": []}, {"body": "Solving general AI,\n\nImplications are  huge", "score": 5, "replies": [{"body": "Yeah, real huge! \nSkynet, Cylonsâ€¦. This wonâ€™t end well for us!", "score": 2, "replies": []}]}, {"body": "March of nines.", "score": 4, "replies": []}, {"body": "â€œThis is paramountâ€", "score": 2, "replies": []}, {"body": "This is profound", "score": 2, "replies": []}, {"body": "\"Like, really hard\"", "score": 1, "replies": []}, {"body": "Laughs in Elon: \"Hah ha.\"", "score": 1, "replies": []}]}, {"body": "Alright. What are we expecting here? Is this Autonomy Day 2.0? Pardon my ignorance.", "score": 40, "replies": [{"body": "Basically just Tesla talking about all the cool AI stuff theyâ€™re doing. The purpose is for mostly recruiting. So yeah, similar to Autonomy Day but more general.", "score": 39, "replies": [{"body": "Wild speculation, since they called it AI, not Autonomy, it suggests to me that it might be about general purpose AI. And assuming Elon doesn't want more on his plate in terms of new projects, maybe they're planning some sort of ai platform where they'll sell computing power for machine learning purposes.", "score": 1, "replies": [{"body": "Well they gotta have something to occypy Dojo with post FSD", "score": 1, "replies": [{"body": "There will always be room for improvement, but it could make Tesla some money any time computing power isnt a bottleneck, plus they could sell the fsd computer as a more general purpose vision platform. Change it from processing 8 cameras (or whatever the number is) down to something like 2 or 4 and sell as a vision platform to put on robots.", "score": 1, "replies": []}]}]}]}, {"body": "> What are we expecting here?\n\nIn terms of investing-related impact? Based on the previous investor days I don't expect much change. Most of it goes over the analysts' heads. \n\nIf \"50% reduced battery costs\" didn't do anything for us this is going to wash right over them.\n\nThat said, I hope I'm proved wrong.", "score": 38, "replies": [{"body": "I'm still amazed by the lack of reaction to Battery Day. Autonomy Day, I kinda understand because Tesla was in a bit of trouble at the time. However, I expect little to no reaction from AI day.", "score": 21, "replies": [{"body": "Elon already tried to frame it as a recruiting event, so Iâ€™m expecting a call for super computing help, AI positions, and more.\n\nHopefully theyâ€™ll announce a new office outside the bay, because I think itâ€™ll take a lot more talent to really increase their velocity.", "score": 6, "replies": [{"body": "Exactly similar to Neuralinkâ€™s presentations.", "score": 3, "replies": []}]}, {"body": ">\tI'm still amazed by the lack of reaction to Battery Day.\n\nSame.  When I saw it did absolutely nothing and even dipped a little, I bought an additional 6 figures.  Their loss, my gain, I guess. ðŸ¤·â€â™‚ï¸", "score": 4, "replies": [{"body": "Buying an additional 100k+ shares might not sound like a lot, but be patient, it can add up over time:-)", "score": 6, "replies": [{"body": "Yep!  Even buying 1 share of anything means a lot to me.  The trick is to always be grateful for anything and everything.", "score": 2, "replies": []}]}, {"body": "> I bought an additional 6 figures\n\nDaaaaaaaaammmnn!", "score": 3, "replies": [{"body": "Definitely wasnâ€™t flexing, just saying that I really like the stock. ðŸ¤—", "score": 1, "replies": []}]}]}, {"body": "There was all kind of reaction and hype to the battery day. So much so that many thought by 2021 Tesla would be producing their own battery cells or at least well in their way to mass production.\n\nBattery day was less than expected so the stock dipped. Tesla is not mass producing in house battery cells anytime soon. But when there is news that Tesla have solved the issues and begun building there own battery cells lines. You will see the reaction then.", "score": -1, "replies": [{"body": "Can you define what you mean by â€œanytime soonâ€? \n\nAnd the Kato road facility IS a battery cell line. Pilot production line that is constantly iterating, sure, but still a cell manufacturing plant putting out huge quantities of batteries when compared to many existing battery plants.", "score": 3, "replies": [{"body": "Their Kato line is an experimental/training/development line. It doesn't mean much, mass production however mean much more for Tesla. It seems tesla was planning to use cells from their pilot line in their plaid+, however it seems they were not confident in those cells and simply scraped plaid+. \n\nThey are having issues that they so far haven't solved. When those issues are solved we will se Tesla building in house battery lines in their gigafactories. When news start to come back stock will react. \n\nThe battery business is huge and it will become much bigger in future. There is a big battle upcoming about whom can massproduce the most energy dense batteries. Time is of essence. Their have almost been a year since battery day, what progress have been since? We do not know, but their have been a lot of news about solid state, and this year for the first time solid state really seems on the horizon, I believe that within 5 years we will be having semi solid state batteries being sold.", "score": 3, "replies": [{"body": "I donâ€™t disagree with your comment on stock price reaction, but you are ill informed about the current status of cell production and processes. One reason stock price reaction will be delayed until Austin/Berlin has 4680s being made in 100s of GWHs is because bad understanding is quite widespread.", "score": 0, "replies": []}]}]}, {"body": "people just built up unrealistic insane expectations in their heads and ran wild with their imaginations.. what Tesla presented was huge.. imo", "score": 2, "replies": []}]}]}, {"body": "Well. Most analysts are just tools of manipulation.", "score": 1, "replies": [{"body": "True or not, they still can have an impact on the market in doing nothing.", "score": 1, "replies": [{"body": "Do they though. Iâ€™ve always wondered how manipulation effects a long position on any stock. Past a certain amount of time, it seems possible that correction overturns manipulation. I guess this is an assumption, am I wrong?", "score": 1, "replies": [{"body": "What? \n\nOf course they do. If they see a company that announces something game changing, like a halving of the price of batteries would be, and don't raise valuations, how can you say they don't?\n\nSure, there'll be a correction in time, but it's not their job to wait for that, their job is to provide valuations.", "score": 1, "replies": []}]}]}]}]}, {"body": "Tesla currently have the 5th most powerful supercomputer in the world, that theyâ€™ve been developing for FSD. \nAI day will probably be to announce their DOJO supercomputer (something else entirely to their current one) based on a neural network which will be essential in to training their current supercomputer on vision only driving.. first look at real artificial intelligence operating. \nExciting !!", "score": 23, "replies": [{"body": "I think dojo is a year out", "score": 5, "replies": [{"body": "Is dojo always a year out? When was the year out timeframe most recently reiterated? It might be getting closer.", "score": 8, "replies": []}]}, {"body": "\"real artificial intelligence\" - do you mean AI that is sentient?", "score": 1, "replies": [{"body": "Only a first look.. sentient might just be too generic at this stage, considering we are only considering ai within the parameters of self driving.. \nbut the ability will just grow exponentially with machine learning being  the root of the system (in a way self taught).. just like alphazero took over and kept beating alpha go after learning from it", "score": 3, "replies": []}]}]}, {"body": "It's a wowzers event to attract more talent", "score": 7, "replies": []}, {"body": "A recruiting pitch firmly directed at the smartest graduate students working in the field. Plus a little dumbed down for the rest of us and potential recruits from other fields to make them excited about working at Tesla.", "score": 2, "replies": []}, {"body": "I think they are starting to see synergies with their state-of-the-art vision system for FSD in their factories.\n\nCorrect me if I'm wrong, but back in the day, Elon wanted to automate everything in their factories, have a robot for each and every task, but vision systems for manufacturing robots weren't good enough for scaling it/ humans were cheaper. I think these manufacturing implications from how good their vision system has become, is something that Elon wants to address", "score": 1, "replies": [{"body": "That's an interesting take. Elon did fail at fully automating manufacturing. Haven't thought about it for some time but Elon does seem like the obsessive type that wouldn't let it go. I doubt he would have an AI day to announce manufacturing technique improvements though.", "score": 2, "replies": [{"body": "Maybe the Tesla AI team stumbled upon General AI and are gonna tell us about it.", "score": 2, "replies": []}, {"body": "Sure, maybe not primary. But I think Elon has been pounding the table about manufacturing for some time, like \"it's a field for smart people, it's so hard\". To attract talent to automate manufacturing maybe isn't the easiest thing, everyone wants to be on Karpathy's team solving FSD... AI day could help out though.", "score": 2, "replies": []}]}]}]}, {"body": "In before all of the â€œTwo Weeksâ€ posts", "score": 19, "replies": [{"body": "This is actually 3 weeks away.", "score": 9, "replies": [{"body": "Soon...", "score": 5, "replies": [{"body": "RemindMe! One Week", "score": 1, "replies": [{"body": "I will be messaging you in 7 days on [**2021-08-05 08:49:49 UTC**](http://www.wolframalpha.com/input/?i=2021-08-05%2008:49:49%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/teslainvestorsclub/comments/otq2hn/elon_musk_on_twitter_tesla_ai_day_august_19th/h6xob70/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fteslainvestorsclub%2Fcomments%2Fotq2hn%2Felon_musk_on_twitter_tesla_ai_day_august_19th%2Fh6xob70%2F%5D%0A%0ARemindMe%21%202021-08-05%2008%3A49%3A49%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20otq2hn)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}, {"body": "Fingers crossed that this doesn't go down in history as Singularity Day...", "score": 20, "replies": [{"body": "That's not for another 19 years.", "score": 3, "replies": [{"body": "Pretty sure it will take less than 19 years", "score": 1, "replies": []}]}]}, {"body": "Elon later tweeted \"Convincing the best AI talent to join Tesla is the sole goal\" ([https://twitter.com/elonmusk/status/1420607874762518528](https://twitter.com/elonmusk/status/1420607874762518528), in response to a comment from SMR). So logically, I expect:\n\n- Some news about impressive advances, coupled with new exciting challenges to attract AI talent (similar to the Pong demo at the Neuralink event, with description of next steps)\n\n- More information on Dojo (Elon said we will learn more about Dojo at Tesla AI Day)\n\n- Not much net effect on stock price over the next several days (as SMR noted, few people will understand it)\n\n- A lot of information on direction and progress that will be useful for long-term investors (similar to Battery Day).\n\nThe timing likely indicates that there is something good to report, that means Tesla believes it is time to expand their already-huge effort in AI (as previously noted, it is likely that even their interim supercomputers cost hundreds of millions of dollars), and bring in more people.", "score": 12, "replies": [{"body": "Elon has described Tesla as solving â€œreal-world AI problemsâ€. I wonder if weâ€™ll get any hints about whether there are other problem domains than self driving that they are hiring for.", "score": 7, "replies": []}]}, {"body": "This is so exciting.. SO HYPED!!! ðŸ˜„", "score": 5, "replies": [{"body": "Itâ€™s the day Gordon Johnson will declare he is\nA l l    I n", "score": 2, "replies": []}]}, {"body": "August 19 ---> AI9> AI towards march of 9s", "score": 3, "replies": []}, {"body": "This is good.", "score": 6, "replies": [{"body": "It is absolutely fabuloUs", "score": 1, "replies": []}]}, {"body": "Marked my calendar. Might take a day off. Woo hoo!", "score": 4, "replies": []}, {"body": "Lol going by previous day events, I should basically sell all my Tesla on the 18th and buy back in the 20th", "score": 2, "replies": []}, {"body": "My mind can't handle more breakthroughs!", "score": 1, "replies": []}, {"body": "2 weeks for sure", "score": 1, "replies": []}, {"body": "Prepare to be underwhelmed, or at a minimum a little whelmed.", "score": 1, "replies": []}, {"body": "Whatâ€™s everyoneâ€™s over-under that they announce that Dojo will be the most powerful computer in the world? Iâ€™d give that a 75% chance.\n\nEdit: Why the downvote? Iâ€™m not suggesting they would be lying", "score": 0, "replies": [{"body": "Iâ€™ll give it a 69% chance itâ€™s either over or under.", "score": 5, "replies": []}]}, {"body": "Ok guys itâ€™s happening ðŸ˜±ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯", "score": 0, "replies": []}, {"body": "That's two weeks away", "score": 0, "replies": []}, {"body": "On my birthday ðŸ¥³", "score": 0, "replies": [{"body": "Are....Are you the singularity?", "score": 0, "replies": []}]}, {"body": "What is the significance of this dayp", "score": 0, "replies": []}, {"body": "Dojo time?", "score": 1, "replies": []}, {"body": "Are they going to unveil the Omega yet? We will need it to conquer climate change.", "score": 1, "replies": []}, {"body": "Pro-typing is easy, mass production is way harder. Oh wait I am on the wrong call never mind.", "score": 1, "replies": []}, {"body": "This may be the first time going in to one of these \"X Day\" events that expectations are actually low, given all the delays and half-steps on FSD. I know I don't expect new ground to be broken, other than maybe an update on Dojo progress.\n\nAnd that's my drinking game word: dojo.", "score": 1, "replies": []}, {"body": "Sep. 2nd, 2 weeks later FSD public beta release.", "score": 1, "replies": []}]}
{"title": "AMD 3.2k to 15,400k", "selftext": "[deleted]", "id": "ou8sp6", "created_utc": 1627600754.0, "score": 525, "upvote_ratio": 0.91, "num_comments": 98, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|4 months ago\n**Total Comments**|138|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Did you cash out or what? I didnâ€™t cash out today and Iâ€™m kinda pissed.", "score": 80, "replies": [{"body": "Yes I did I was gonna hold 10 but decided to sell all of it", "score": 91, "replies": [{"body": "Congrats by the way! ThTs a nice penny", "score": 19, "replies": [{"body": "Fuck you by the way", "score": 3, "replies": []}]}, {"body": "Prob the best idea looking at it now", "score": 22, "replies": []}]}]}, {"body": "Did you sell before it tanked?", "score": 42, "replies": [{"body": "Yes lol almost held tho", "score": 48, "replies": [{"body": "Good call. I held my December $105 calls and went from green to red expeditiously.", "score": 31, "replies": []}, {"body": "Good call. Not retarded after all lol..\nCongrats on your gains.", "score": 3, "replies": []}]}, {"body": "It's back up to ath after 15mins of open", "score": 7, "replies": []}]}, {"body": "Woulda been burned on all previous amd earnings . Just won the lotto with this one", "score": 27, "replies": [{"body": "Yes just got lucky tbh", "score": 13, "replies": [{"body": "Thats what we are here for though right?", "score": 3, "replies": []}]}]}, {"body": "3.2k to 15,400k... 3200 to 15400000?", "score": 98, "replies": [{"body": "He's an ape that doesn't have the firmest grasp on numbers", "score": 86, "replies": [{"body": "Didn't even occur to me that something was weird lol", "score": 6, "replies": []}]}, {"body": "i was really impressed for like a second but then i saw the screenshot", "score": 18, "replies": [{"body": "Looked at the screenshot as soon as I saw the title. I will admit, I was half hoping to see it show $15,400,000.00 ... but alas, our friend ðŸ’ðŸ¦ just had his commas in the wrong place in the title.", "score": 8, "replies": []}]}, {"body": "Lmao", "score": 3, "replies": []}]}, {"body": "If only had the capital to do this, I bought few shares @85 only few days ago would have been rich by now", "score": 20, "replies": [{"body": "just keep dinking and dunking shares until you have a good nest egg to play with. any green is good green ðŸ˜‚ (going on 3 days straight red)", "score": 19, "replies": [{"body": "I have been doing this currently my WSB account has grown 400% since last October.  Set goals that feel attainable and stick to them, excessive greed is where loss porn is born", "score": 13, "replies": []}, {"body": "Problem is this is a taxable account so I canâ€™t keep trading the tax man will rape me afterwards lol", "score": 5, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "Exactly so my good trades so far this year outweighs \nMy bad trades. And I havenâ€™t realised any gains yet on +25% positions yet as I donâ€™t want the irs eating my cake", "score": 2, "replies": [{"body": "While it may handicap me I always place 1/3 of my gains into an account.  I figure if at the end of the year I don't owe taxes it will be play money for vacations, if I have to pay taxes that account should cover it easily.", "score": 6, "replies": []}]}]}, {"body": "Ok so don't trade at all?", "score": 1, "replies": [{"body": "Nice!", "score": 0, "replies": []}]}]}]}, {"body": "These are options. My account dropped from $20k to $800 on CLF now I'm at $3.5k from AMD. $300-500 is enough to start", "score": 7, "replies": [{"body": "CLF is cyclic. I've been playing the ups and downs fairly decent with a straddle strategy. No crazy gains here but I've been trading for less than 2 years so its mostly experimentation for me.", "score": 1, "replies": [{"body": "I don't understand how you can play straddles when a 6% move equates to like 50% gain in weeklies never mind the monthly options", "score": 1, "replies": []}]}]}]}, {"body": "my 135 calls expire jan 2023, so i'll hold for a while", "score": 7, "replies": []}, {"body": "Do you people purposefully run down your batteries before you screenshot or something? I never fucking reach 17% ever.", "score": 6, "replies": [{"body": "Itâ€™s an iPhone 7 terrible battery", "score": 2, "replies": [{"body": "at least we have one thing in common.", "score": 2, "replies": []}]}]}, {"body": "How do you guys even find these plays ? Wtf!", "score": 7, "replies": [{"body": "Pure luck or combination of luck and studying the market.", "score": 1, "replies": []}, {"body": "Find these plays?! It's fucking AMD dude.", "score": 1, "replies": []}]}, {"body": "Meanwhile I just spent 3.2k on $BABA calls before close. May god have mercy on my soul.", "score": 3, "replies": []}, {"body": "Hope it keeps running", "score": 8, "replies": [{"body": "Meeeee too.", "score": 3, "replies": []}]}, {"body": "0.73â€¦ oh my ðŸ˜©ðŸ˜©", "score": 3, "replies": []}, {"body": "Congratulations.\n\nDo this 5-8 more times and you'll break a million!", "score": 3, "replies": []}, {"body": "stupidly misleading title...I legit thought you flipped 3.2k to 15.4m", "score": 3, "replies": []}, {"body": "That battery level unsettles me", "score": 2, "replies": []}, {"body": "Sell one contract and buy you a new phone charger", "score": 2, "replies": []}, {"body": "you mean $3200 to  $ 15,400,000?  OMGGGG", "score": 5, "replies": []}, {"body": "Nice!!! Can you order me 1000 rounds of 7.62x39? Just a small donation", "score": 3, "replies": []}, {"body": "*15.4k", "score": 1, "replies": []}, {"body": "> 15,400K\n\n15.4 million?", "score": 1, "replies": [{"body": "Typo lol", "score": 5, "replies": [{"body": "Well we couldnâ€™t trust you if there were no mistakes.", "score": 2, "replies": []}]}]}, {"body": "Su bae always comes through. ðŸ’—\nDon't forget to put some aside for taxes.", "score": 1, "replies": []}, {"body": "I had options at 95 strike that expired worthless on 7/16. I bought them in may. ðŸ˜¢", "score": 1, "replies": []}, {"body": "Awesome ! when did you buy theses ?", "score": 1, "replies": []}, {"body": "15.400 thousand? Lol probably shouldnâ€™t be trading op", "score": 1, "replies": []}, {"body": "Lol nice! I just got into my Charles Schwab my dad opened for me like 15 years ago and it had 4 shares of amd! Time for us to reap the rewards!", "score": 1, "replies": []}, {"body": "Oh so you havent even sold ?", "score": 1, "replies": []}, {"body": "Gratz! AMD! Su really guiding this ship in the right direction", "score": 1, "replies": []}, {"body": "When did you buy this", "score": 1, "replies": []}, {"body": "When did you buy this? How did you know?", "score": 1, "replies": []}, {"body": "well well it appears to me that there is a rare example of the winning ape letâ€™s see how it will progress in the near future", "score": 1, "replies": []}, {"body": "Nice play my man AMD is solid", "score": 1, "replies": []}, {"body": "I really came in here thinking he took 3k and made it into 15 mill lol", "score": 1, "replies": [{"body": "I wish", "score": 1, "replies": []}]}, {"body": "Hate you punkâ€¦Congrats", "score": 1, "replies": []}, {"body": "Apparently I was born retarded. How the hell did you do that do you do that?", "score": 1, "replies": []}, {"body": "At first I was like \"no way!\" And then I remembered ape not number good. \n\nAll the same great work", "score": 1, "replies": []}, {"body": "Jesus u made 15400k ?", "score": 1, "replies": []}, {"body": "Nice gains but where's the $15.4M that you're talking about?", "score": 1, "replies": []}, {"body": "Hey so im new in options, does robinhoods estimated breakeven number, and their weird estimated gain/loss sliding scale have literally any bearing in the reality of how options work.... ive had an option go 1,000% before getting close to the breakeven number, and sold.. and i definitely did more then break even", "score": 1, "replies": []}, {"body": "Hope you held more and sold opening brother", "score": 1, "replies": []}]}
