{"title": "Stock you have the most faith in currently?", "selftext": "With all this market volatility of late, which holdings are you absolutely confident in?\n\nI'm feeling confident about GILD and SBUX in the long run.\n\n*this isn't a thinly-veiled attempt to get free advice.*", "id": "41mpet", "created_utc": 1453174239.0, "score": 18, "upvote_ratio": 0.91, "num_comments": 37, "comments": [{"body": "[removed]", "score": 6, "replies": [{"body": "That's quite interesting stuff about MELI. I must admit that I haven't heard of them. SKWS is also a strong buy in my opinion too. Too bad I only have so much money to get these great deals. :(", "score": 2, "replies": []}, {"body": "SWKS is not something that is on my list, but I will agree that the Apple and China concerns for that stock have become quite overdone and a nearly 50% drop from the 52 wk high certainly makes for an appealing entry point for those with a mid-to-long-term view. Company has no debt and actually pays a dividend.  MELI is an interesting idea; I think it's just being obliterated because of anything associated with Latin America, but if you believe that Latin America will turnaround, then this is certainly one of the things that will do well in that situation.\n\nAlso agree on CELG. ", "score": 2, "replies": []}]}, {"body": "TPIV, because I'm going with the 2nd definition of faith:\n\n\"strong belief in God or in the doctrines of a religion, based on spiritual apprehension rather than proof.\"", "score": 3, "replies": []}, {"body": "I really like the gilead idea long term, as this normally growth stock has become very low price in terms of its historical P/E ranges, and I'm looking at picking it up personally as soon as we hit some stable support in the markets.  Not so hot on starbucks, the the price is fairly high (30x earnings, 35x FCF), as well as I feel starbucks could possibly be a target for a redbox-like coffee machine.  Have an engineer invent a coffee machine that can do a limited number of the most popular drinks (lattes, cappuccinos, steamers, etc.), allow people to pay for it using cards or app payments, and compete on cost, as you don't have to pay for a barista or a tip.  \n\nThe stock that looks the most appealing to me is Wadell and Reed (WDR).  W&R and their sister company Ivy Funds have both been ranked as top 5 mutual funds according to Barrons for the last 5 years, and the company has been growing revenues and income consistently over the past 5 years. However, they had a poor year in 2015, and their quarterly revenue declined 8% from Q3 2014 to Q3 2015, while revenues fell 35% during the same period.  As a result, the stock fell from $50 dollars a share at the start of 2015 to 24 and change today.  Given the firm's 7% dividend, strong cash flows, and reputation of being a top mutual fund, I feel the 50% drop in 2015 and 70% drop in price from all time highs in early 2014 has created a strong opportunity to get in on a solid company that is very inexpensive (8x earnings, 7x FCF).", "score": 3, "replies": [{"body": "You make WDR sound pretty appealing. But I'm a firm believer in investing in what you know, and frankly, I don't know much about that sector. The numbers sound great though.\n\nAs for Starbucks, I can swallow the PE ratio.\nThere's still so much growth for them. I think they're opening 2000+ stores in Asia, and from what I'm hearing, it's becoming embedded in their culture as a status symbol, kind of like how it is here. And as ridiculous as it sounds, as long as Schultz is around, I think investors will be content.", "score": 1, "replies": [{"body": "Yeah, I'm a bit of a value investor, so the majority of the stock that I like/own are never mentioned on here, as the younger community tends to favor stocks that have valuations based more upon their growth potential than their intrinsic value. There is some overlap, as I really like GILD & SWKS, which I consider to be more growth names, but more often than not I'm in disagreement with the community.", "score": 1, "replies": []}]}, {"body": "Re: SBUX - interesting point about the vending machines but I don't think that could replace coffee shops. Coffee shops have so much more to offer like meeting places and work spaces. Sure, vending can cut into sales but I'm sure this is something SBUX would get into as well with their own machines.", "score": 1, "replies": [{"body": "No, and I don't disagree with that at all.  Coffee shops have been around since the renaissance, and no vending machine will cause them to go out of existence. However, with there being talks of an increase in the minimum wage in the US, I suspect that wage pressures could cause Starbucks to raise the price of their drinks so they don't have to eat the costs themselves.  With the US having stagnant wages after inflation adjustments for the past 15 years, your average soccer mom who has become addicted to the chocomoolate expresso with creme may not be able to afford to get that every day if the price were to increase by 25%.  Thus, the opportunity for the daily drink to be provided by a machine is possible if, and only if, a successful franchise was able to be set up before SBUX entered the fray, as name recognition would lead them to dominate if certain barriers were not created.  I think that Starbucks would win out in the end, but an automated undercutter is a threat to Starbucks going forward that I feel is not reflected by the market.\n\nTLDR: Someone make an automated coffee machine so I can get my drink cheaper plz...", "score": 2, "replies": [{"body": "Very valid point. The rising wages is probably my main concern. I have faith that they'll figure it out.", "score": 1, "replies": []}]}]}]}, {"body": "GOOG/GOOGL for me hands down.\n\nI believe technology is poorly understood by many in the investment community.   This creates an opportunity.\n\n", "score": 3, "replies": []}, {"body": "I believe in GE, the stock was pretty stable during the selloff and now it should rebound very soon. ", "score": 2, "replies": [{"body": "Ive been hearing that for 14 years!!", "score": 1, "replies": [{"body": "Lol, they have a lot of business in Iran. ", "score": 1, "replies": []}]}]}, {"body": "ATVI ", "score": 4, "replies": []}, {"body": "AAPL", "score": 2, "replies": [{"body": "I'll buy some 50 shares of it if it drops below 85. Currently at 95 it's sort of a deal although there are better ones.", "score": 2, "replies": [{"body": "Yep, 85 is my target for adding to my long position (held since 2011 or so, added a good amount in the 2013 dip)", "score": 1, "replies": []}]}, {"body": "I'm with you there. Although I think things will be stagnant in the short term with China fears and investors hungry for a new product line.", "score": 1, "replies": []}]}, {"body": "MACYS \n\nsymbol: M", "score": 1, "replies": [{"body": "Trump will put them out of business if he becomes president!!", "score": 1, "replies": []}]}, {"body": "O and LTC", "score": 1, "replies": []}, {"body": "WM, Waste Management. A solid cornerstone of any portfolio, with a steady growing dividend that beats any bond I'd consider.\n\nhttp://seekingalpha.com/article/1922361-embracing-waste-management\n\n\n", "score": 1, "replies": []}, {"body": "Actually, Square (SQ)", "score": 1, "replies": []}, {"body": "Altria", "score": 1, "replies": []}, {"body": "PTLA - speculative but a very important drug will be released this year.\n\nAnd GILD.  Just bought more.  The new version of Tenofovir with less ADE will be released plus all the other specialty meds.", "score": 1, "replies": []}, {"body": "CMG", "score": 1, "replies": [{"body": "Not sure why you are being downvoted now is an excellent time to get in. I'm waiting to see if now is the best opportunity or if they're going to sink any lower.\n\nNow is a good time for Amazon as well.", "score": 2, "replies": [{"body": "I agree.  I bought in @430.  If it dipped to 390, I was going to go in more. Sucks it didnt.\n\nAmazon is another good one.  But I just don't feel it will grow as quickly as Chipotle will.", "score": 1, "replies": []}]}, {"body": "CMG is a great bet. Just ask yourself if you can see a world without Chipotle? They will get through this and then start expanding just like many other fast food chains have. I think the people bad mouthing this stock are extremely naive of the long term potential.", "score": 2, "replies": [{"body": "Spot. On.", "score": 1, "replies": []}]}]}, {"body": "My money is on Amazon.  They are changing the way people shop.  All the box stores are feeling that pressure and Wal Mart is even closing a bunch of locations. ", "score": 0, "replies": [{"body": "YOU LITERALLY HAVE NO IDEA WHAT YOU ARE TALKING ABOUT!!! The Walmart closures had NOTHING to do with Amazon!!!", "score": 0, "replies": [{"body": "[Well you can yell in caps or you can learn something.](http://time.com/4040160/amazon-walmart/)\n\n[Hang in there slugger.](https://s-media-cache-ak0.pinimg.com/736x/83/01/c2/8301c2ebcbd6d40d78082b0254fee71a.jpg)", "score": 1, "replies": []}]}]}, {"body": "Tesla :)", "score": -1, "replies": [{"body": "TSLA is a coin flip. It's either gonna do extremely well say in 5-10 years OR it will fail miserably. ", "score": 1, "replies": [{"body": "I got in before it was above 20$. I also got into Bitcoin in 2010. I early adopt.", "score": 1, "replies": []}]}]}]}
{"title": "Rebound tomorrow?", "selftext": "[removed]", "id": "41ms9i", "created_utc": 1453175424.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 36, "comments": [{"body": "I hope USO rebounds hard as hell tomorrow and I'll scoop up 20 put contracts for Feb 5.", "score": 1, "replies": []}, {"body": "hope the market in general rebounds! just dropped 15k! but if it doesn't i'll be dollar cost averaging FB until 1/26 (day before their earnings release). maybe another 10-20k depending on how yolo'y i feel", "score": 1, "replies": []}, {"body": "yes plz rebound my XIV position needs it\n", "score": 1, "replies": []}, {"body": "Oil", "score": 1, "replies": [{"body": "Prices", "score": 1, "replies": [{"body": "Destined", "score": 1, "replies": [{"body": "To fall", "score": 1, "replies": [{"body": "Below", "score": 1, "replies": [{"body": "$25 ", "score": 1, "replies": [{"body": "This week", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "wow another self proclaimed oil expert", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "RemindMe! 4 days \"Tell this smartass who apparently knows how shit works when oil isn't below $25 by end of this week\"", "score": 2, "replies": [{"body": "> No true rebound other then early market. Oil prices fell to $28.33, so @PerfectNemisis, suck it when oil is below $25 a barrel Friday or Saterday. ~ Scriph\n\nI was brought here by RemindMeBot. /u/PerfectNemesis wins the battle.\n\n> \"Tell this smartass who apparently knows how shit works when oil isn't below $25 by end of this week\" ~ PerfectNemesis\n\nRef: [WTI Crude oil at $32.25 EOD 1/22/2016](http://www.marketwatch.com/story/oil-prices-rip-higher-after-ecb-stimulus-promise-echoes-2016-01-22)", "score": 2, "replies": [{"body": "Dam right", "score": 2, "replies": []}]}, {"body": "Messaging you on [**2016-01-23 05:29:18 UTC**](http://www.wolframalpha.com/input/?i=2016-01-23 05:29:18 UTC To Local Time) to remind you of [**this.**](https://www.reddit.com/r/wallstreetbets/comments/41ms9i/rebound_tomorrow/cz3n2be)\n\n[**CLICK THIS LINK**](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/wallstreetbets/comments/41ms9i/rebound_tomorrow/cz3n2be]%0A%0ARemindMe!  4 days ) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! cz3n2h5)\n\n_____\n\n|[^([FAQs])](http://www.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^([Custom])](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^([Your Reminders])](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^([Feedback])](http://www.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^([Code])](https://github.com/SIlver--/remindmebot-reddit)\n|-|-|-|-|-|", "score": 1, "replies": []}, {"body": "[removed]", "score": -1, "replies": [{"body": "\"oil prices are destined to fall below $25 a barrel this week\" not sure if you can't read your own words or too fucking stupid to write?", "score": 1, "replies": [{"body": "[removed]", "score": -3, "replies": [{"body": "Holy shit! You must be destined to be autistic and retarded then! Congratz!", "score": 4, "replies": [{"body": "[removed]", "score": -4, "replies": [{"body": "Why do I bother talking to an autistic middle school kid...", "score": -1, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "go fuck yourself", "score": -1, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "This is like a wrestling match in the special olympics. Both of you are fucking retards. And I would know.\n\nGTFO", "score": 5, "replies": [{"body": "The only way to settle this one is to post screen shots of returns in a week. WSB cage match. ", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Not saying oil will be sub $25, but at least add something to the conversation...", "score": 1, "replies": [{"body": "lol what subreddit do you think you are on?", "score": -4, "replies": [{"body": "wow another self proclaimed meta expert.\n\nStop trying to be edgy. The guy was asking a question. You're free to call it a stupid question, but literally whining about how he thinks he's an expert when no such claims were made just add absolutely fucking nothing to the conversation. It's spam. You're spam.", "score": 4, "replies": [{"body": "HOLY SHIT WHAT KIND OF STUPID FUCKING RETARD ARE YOU? IF ANYONE KNOWS WHAT THE MARKET IS HEADING TOMORROW, THEY BE SHIT RICH BY NOW. USE SOME FUCKING COMMON SENSE BEFORE YOU TALK AND THINK DUMB SHIT LIKE \"OIL WILL BE $25 BY END OF WEEK\" IS \"ASKING A QUESTION\" NOW GO FUCK YOURSELF", "score": -5, "replies": [{"body": "Uh lol.\n\nIt's a thread asking about people's thoughts on a possible rebound tomorrow. He has reasons to believe there will be one, and is trying to start a discussion surrounding those points. \n\nPlease continue to rage quit you fucking potato.\n", "score": 5, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": "go fuck yourself", "score": -2, "replies": []}]}]}]}]}]}]}]}
