{"title": "Do you think this is a bull trap?", "selftext": "This market rally is insane this week. Even hedge fund managers and billionaire investors can’t understand it. I understand that the feds are helping but don’t investors realized that they’re devaluing the dollar and also there’s not gonna be a v shaped recovery. \n\nThere has to be a pull back before we go up another rally. Would you agree this is a bull trap?", "id": "fxwglv", "created_utc": 1586452765.0, "score": 16, "upvote_ratio": 0.79, "num_comments": 73, "comments": [{"body": "all i know is i shorted 1000 shares of CNK, a movie theater that is completely closed, and seems to be a dying business  model anyway, and it's up 50 percent.\n\nI also shorted  500 REM due to the supposed \"mortgage crisis\"  It's up about 50%\n\n&#x200B;\n\nI purchased 100 shares of \"safe\" MSFT as a kind of a hedge, and it's down about 5%.\n\nI also sold a bunch of TSLA when it hit $515 for a small profit at the start of the week as their factories were closing and gas prices have tanked, and now it's at $570 lol.\n\n&#x200B;\n\ni tried to use logic on each of these trades, and they all cost me $.\n\nI can't do anything right this week\n\n&#x200B;\n\nOh, and I'm also now in a margin call with Schwab", "score": 55, "replies": [{"body": "$Rope is calling for you to take a position", "score": 11, "replies": []}, {"body": "The problem with your short is you were too late for the easy gains, and too early for the potential bankruptcy/crisis\n\nREM was way oversold, the mREITs released statements that their book value was still 50%+ above the share prices. people were panic selling. only way they get nuked again is if we see mass defaults\n\nCNK, not sure about the company's finances as I dont own it, but again, at one point it was down 80% from it's pre-corona high", "score": 5, "replies": [{"body": "yea im still holding on.  ive basically been shorting 90 % of my trades since mid-Jan and was doing really well, until this week.  Actually, i don't think I lost a single penny on any of my shorts until now.  (TSLA, W, WORK, CCL, RCL, BA, SHOP, GME, F, and a few others) If only I can figure out what is going on with my -2600 halted shares of ZOOM.", "score": 1, "replies": [{"body": "glad to hear its working for you. thats the trouble with shorting. sometimes your thesis can be perfectly right, but if you have bad timing, you get burnt all the same", "score": 3, "replies": []}, {"body": "SEC halted ZOOM until I believe this week because everybody was too fucking stupid to do their research first about ZOOM vs. ZM", "score": 1, "replies": [{"body": "I know. And thats why i was shorting it. Was supposed to start trading again today is just what has me worried as they locked up my 2600 short shares and started charging me over 50 percent interest and i cant close out my position now.", "score": 1, "replies": [{"body": "Oh what the fuck? Yeah just checked, should have been today. Good luck figuring that out, hopefully it gets reversed to what it should be", "score": 1, "replies": []}]}]}, {"body": "It would be hilarious if people mistakenly shorted ZM.", "score": 1, "replies": []}]}]}, {"body": "By the looks at their financial position they could take out a little more debt and they could survive a year without opening their doors.\n\nInvestors are looking at the future when they hopefully open their doors again in July.", "score": 1, "replies": []}, {"body": "Margin call?", "score": 1, "replies": []}, {"body": "I bought in CNK when it was $12 a share a couple weeks ago, thinking that I'd missed the bottom but I was still getting a discount. Yesterday I sold at a slight profit, but I fully expect a drop down to around $10.", "score": 1, "replies": []}]}, {"body": "I don't think we go back to 3/23 levels again, but there are better days to buy than right after a 12% run in 4 days. The curve is flattening, which is great news, but there is still a lot of uncertainty about when we re-open and what the re-open entails. I don't think we go back to large congregations at sports stadiums or restaurants/bars any time soon.", "score": 11, "replies": []}, {"body": "This is just a bull trap within an even bigger bear trap.", "score": 9, "replies": []}, {"body": "Nope,  I think it's a slow bull for at least another 2 month.  I don't think we'll see another crash in the near future for another 2 months.\n\nAfter that, the market may level or slowly recover.  May not get back to the pre-crisis level. No more major 10-15% crash", "score": 8, "replies": []}, {"body": "As we all know, none of us knows. \n\nI’m at 90% cash as of today, however.", "score": 15, "replies": [{"body": "Yeah I'm all cash right now.  The volatility and unpredictability are off-the-charts to me right now.  Don't see any logical plays until things change/settle at some point.", "score": 2, "replies": []}]}, {"body": "Just buy in small amounts. If you spent 30% today and it went up from here on generally, you got good prices. If it goes down, Dca down. Just don’t go all at once imo", "score": 7, "replies": []}, {"body": "You can call it whatever you like, but the unlimited QE and interest rates set forth are causing an inflow into the stock market, because it's still the best place to park large sums of money.\n\nEventually they will have to raise rates, or lower the QE and the market will probably start going down.  Logically speaking it \"should\" come down given everything that is happening, but QE/interest rate policy can keep up this game quite a bit.\n\nThe Fed purchasing schedule is on their website.  It's keeping over 500 billion during the summer months.  So... this 'floating market' can be sustained longer than you'd normally assume.\n\nLastly, why are they doing this?  No conspiracy theories about Trump insisting they keep the stock market up for me; they simply hope that this makes the incoming recession easier to handle for the majority of players involved.", "score": 3, "replies": []}, {"body": "Have you guys thought of the possibility that we are past the bottom.  Too much fomo and should have got in last week", "score": 3, "replies": []}, {"body": "Totally scared to buy. Stocks had stopped plummeting. The only reason for this FED squeeze is to let some of the bigger players unload.\n\nCaution is the better part of valor.", "score": 4, "replies": [{"body": "Well I have SPY puts for April 22 so I’m hoping it fucking dumps", "score": 3, "replies": []}]}, {"body": "It was just announced that virus deaths might not even hit 60k thats down from Fauci saying last week 100-200k Americans will die. That’s huge positive news that the pandemic has been overplayed.\n\nhttps://www.bloomberg.com/news/articles/2020-04-09/fauci-says-u-s-virus-deaths-may-be-60-000-halving-projections\n\nWony be surprised if it ends up being half that when it’s all over", "score": 3, "replies": [{"body": "We have 16k deaths and only around 10%( 40k out of 450k) of cases are resolved. If we continue to gain 30k cases and even if it declines we will probably have near 1m confirmed cases in usa, easily. \n\n100k-200k seems very likely, if not under what will happen.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "For confirmed cases possibly. I don't believe all actual cases will be tested to provide the data that mortality rate is in the 2-3% range.", "score": 2, "replies": []}]}, {"body": "Lmao 😂 okay so you know more then the CDC and Fauci who just announced lower numbers? Keep being delusional", "score": 1, "replies": [{"body": "Given that they have no clue how many have had it and were asymptomatic, or how many had it got the sniffles and recovered, because the government utterly shit the bed on the testing, this is entirely plausible. MILLIONS, literally, could have had it already and gotten over it already having thought they just had a cold.   \n\n\nThat will be something that is found out only when basically everyone gets tested. Literally, everyone for the antibodies.", "score": 6, "replies": [{"body": "Once again you know more then CDC? Okay big boy they should hire you instead of Ivy League doctors.", "score": -8, "replies": [{"body": "Seems you don't know everything about the CDC either. It was them saying that.\n\n&#x200B;\n\n[https://www.vox.com/science-and-health/2020/4/5/21208630/coronavirus-cdc-blood-test-immunity-serological-cellex](https://www.vox.com/science-and-health/2020/4/5/21208630/coronavirus-cdc-blood-test-immunity-serological-cellex)", "score": 6, "replies": [{"body": "That link is 5 days old, this is from today. Seems you haven’t read their current estimates of 60k deaths:\n\nhttps://www.bloomberg.com/news/articles/2020-04-09/fauci-says-u-s-virus-deaths-may-be-60-000-halving-projections", "score": -7, "replies": [{"body": "I was not talking about their death estimates, I was talking about how much this has spread with only minor / no symptoms. That pushes down the overall leathality estimate. \n\nIf it turns out at the start of the outbreak we thought (using simple numbers here for discussion) 1 in 10 would die based off of a known number of carriers being 100,000, giving an estimated 10k deaths, but it later turns out 1,000,000 had it, that means your mortality rate comes down an order of magnitude. \n\nMeans you now know, oh, maybe less people are being killed by this than we thought. \n\nSo it seems you've not thought about this in much depth.", "score": 2, "replies": [{"body": "Okay bud", "score": -2, "replies": [{"body": "It is. If you had paid attention to both who was talking to you and what was being said, you'd have realised my first reply to you was actually agreeing with you.   \n\n\nYou shorted yourself haha", "score": 2, "replies": []}, {"body": "Just admit you got schooled by the person you were trying to school and go fuck off somewhere else.", "score": 2, "replies": [{"body": "Lol sure ill reply to this comment again in a few weeks when the final numbers are out and you look like a fool", "score": -1, "replies": [{"body": "Final numbers 😂", "score": 1, "replies": [{"body": "Don’t you know, we’re going to beat covid by May bro", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Why are you blindly trusting government agencies? They have lied before. Although optimism is good, don't be optimistic on account of a government agency. That's just naive.", "score": 1, "replies": [{"body": "I rather trust CDC then random fear mongerer on internet who claims the world is ending and 200k people are going to die without any facts.", "score": 2, "replies": []}, {"body": "Instead of trying to use common sense this virus has been an opportunity for losers who care more about political theatre than their own and other people’s health. \n\nIt’s so compounded now because of the internet and international health organisations and experts that truly were neutral being another politically influenced tool.", "score": 1, "replies": []}]}, {"body": "Ivy league doctors don’t know everything, we’re still learning about COVID-19 too.", "score": 0, "replies": []}]}]}, {"body": "Dude CDC has missed the mark a handful of times since this pandemic has started. I'm just looking at the numbers provided and making an assumption based on that.", "score": 1, "replies": []}]}]}]}, {"body": "The drop has been mostly speculation once the data comes out and the real impact is dealt it will probably drop again. \n\nThat being said with all the stimulus happening the dollar may be being devalue d at the same rate the market is going up... this is 100% armchair point of view tho.", "score": 2, "replies": [{"body": "Gold was up bigly today.", "score": 1, "replies": []}]}, {"body": "I put money into bayer and att", "score": 2, "replies": []}, {"body": "There is No such thing as a bull trap. How long have you been trading?", "score": 2, "replies": []}, {"body": "I’ve had this same thought. Are all the big players letting the little guys buy in, drive up prices, so they can short or do a big sell off? \n\nIf it looks like a duck and quacks like a duck, it’s probably a cat.", "score": 3, "replies": []}, {"body": "I would not be buying here. But logic doesn't apply to this market", "score": 3, "replies": [{"body": "Don’t listen to this guy waiting for the bottom. It’s like trying to catch a falling knife.", "score": -7, "replies": [{"body": "Of course, let's go all in on market uncertainty!", "score": 1, "replies": []}]}]}, {"body": "Maybe, maybe not. Nobody knows, so just stick to your stop worrying about it.", "score": 1, "replies": []}, {"body": "https://brrr.money", "score": 1, "replies": [{"body": "To euro beat", "score": 2, "replies": []}]}, {"body": "No", "score": 1, "replies": []}, {"body": "History say's yes. If previous bear markets mean anything, we should see another leg down after this bump. \n\nAnd, this feels like a government pump. Give out terrible news, come back a week later with the real numbers and they seem upbeat. Momentary euphoria ensues, likely to evaporate when the optimism dies and the real economic impact settles in.\n\nFor now, I've stopped DCA'ing. Been at it for about six weeks, but pausing to see what happens next. Experience tells me there will be better deals in the coming months than there are today.  Having said that, our market history is based on the trading habits of human beings. We don't have much history for algo trading. The machines, comfortable in their vast, cool server farms, are probably laughing at me as I write this. *Stupid human!*", "score": 1, "replies": []}, {"body": "I thought so a week ago. Now I think the markets are just going to begin going up again.", "score": 1, "replies": []}, {"body": "Aren’t there reports of less people dieing?", "score": 1, "replies": []}, {"body": "i would get mad too if my shorts were bad", "score": 1, "replies": []}, {"body": "Im investing 500 a month into my Roth, and 15% of my check into my 401k. That wont be changing. All my extra money is sitting side lines though - it just doesnt feel right to go in yet. \n\nI did buy Home depot during their low and Im up 20% on them. One of my rare good choices", "score": 1, "replies": []}, {"body": "doesn't matter what you call it lol, ive been buying, and I still have more cash, have a plan and be prepared to act on what happens. I personally think i will trade side ways for a month or two.", "score": 1, "replies": []}, {"body": "Yes it’s a bull trap. Bulls are trading on virus numbers and stimulus hopes and underestimating the economic damage that’s been done. At current valuations, we are on the low end of a bull market still, which everyone would agree is nonsense. Rally may go higher but it will face a reckoning", "score": 1, "replies": []}, {"body": "No, I think this is a bear market rally, before it begins finding new lows. The bull market is over.", "score": 1, "replies": []}, {"body": "Its not a bull trap. It is fairly priced based on the current info. However, if a second wave comes in countries lifting the lockdowns them we are going to see lows that are lower than in March.", "score": 1, "replies": [{"body": "Markets haven’t been fairly priced since like 2016.", "score": 2, "replies": []}, {"body": "Fairly priced? Valuations have been crazy for awhile...and oh yea, incoming depression", "score": 3, "replies": []}, {"body": "You say that as if it’s fact. Can you provide sources that aren’t opinion?", "score": -1, "replies": [{"body": "The OP asked for opinions.", "score": 4, "replies": [{"body": "Gotcha", "score": 1, "replies": []}]}, {"body": "You want a factual source on the future?", "score": 1, "replies": [{"body": "You just proved my point.", "score": 1, "replies": []}]}]}]}, {"body": "It’s a bull trap if the S&P can’t break a resistance level of 2850. If we break 2850 in the next week we are going back up.", "score": 1, "replies": []}, {"body": " \n\n# Do you think this is a bull trap?\n\nYes. Run. Run quickly with the money.", "score": 0, "replies": []}]}
{"title": "This is what is actually going on.", "selftext": "If you look at where SPY is currently trading, we're 6% away from where the market was trading on October 9, 2019, months before this all went to shit and Pokimane killed the market in the dark Jartek days, which makes no god damn sense so I figured, let's see what's going on.  Now, we're looking at shit earnings for at least for the next 2-3 quarters, around 10-20% of the S&P 500 becoming insolvent, depression level unemployment, possible lockdown cycle for the next year or two, a huge supply and demand shock, etc..., but apparently JPow printed the recession away.  At this point, even JPow has to be looking at the Nasdaq, which is now trading at a \"CNBC once in a decade\" buying opportunity last seen since...December of 2019...and thinking, \"fuck, maybe I did print too much money?\"\n\nBulls are already to type \"Markets are forward looking.\"  The Nasdaq lost about 75% of if it's value from 2000 to 2001, if the market was perfect we wouldn't be going up and down like a penny stock.  The market is breathing a sigh of relief that there's no liquidity crisis, and the fed can buy all the shitty bonds and do all the QE it wants, but it can't solve a solvency crisis where tons of these companies are essentially going to go broke.  It doesn't take all that much to start a recession, your wife's boyfriend loses some hours at work, you don't get a raise, all of a sudden everyone tighten's their belt and a recession is here, and we have that on absolute steroids right now.  The checks and PPP don't help if there's no where to spend it and no one comfortable with spending money, just look at Japan.  So what explains the recent price action?\n\nI'm gonna steal this from Nomura's quant desk as to the recent price action:\n\n\"The steep rally in global equities looks to us like a “bear squeeze” rally, powered by exits from bearish positions that investors accumulated during the downturn. Investor sentiment does seem to be finding support in signs that the virus’s spread in Europe and the US is on course to peak and start slowing, but this was already set to be a week in which CTAs were likely to back out of short positions in US equity futures, so we think it is best to assume that the rally is largely technically driven. It is not clear yet whether the market gains will hold up once the bear squeeze has run its course. We think that projecting scenarios based on longerterm fundamentals onto the present market is something best avoided. The squeeze on CTAs’ short positions has been led by speculative investors recently making contrarian trades, and here we would single out absolute return funds and eventdriven funds, both of which favor short-term trades with a strong element of seizing on opportunities. It appears to us that a powerful wave of contrarian trades by quickmoving investors such as these has left trend-chasing CTAs without an incentive to stick with their short-term bear trades.\n\nIt may help here to look in detail at CTAs’ positions in US equity futures markets. We estimate that CTAs’ net short position as in S&P 500 futures is now about 20% smaller than it was at its 3 April peak. We think that the S&P 500 could rise to around 2,700 if CTAs were to exit their short position in its entirety. Similarly, we estimate that CTAs’ net short position in DJIA futures has shrunk by about 11%. Should CTAs continue being squeezed out of their short positions, we think the DJIA could rise to around 24,000. The pace of CTAs’ exits from short positions in Russell 2000 futures (RTY) has been especially swift. We estimate that their aggregate net short position here is already about 45% smaller than it was at the 31 March peak. Meanwhile, CTAs are still leaning long on NASDAQ 100 futures, as before.\n\nIt looks as though CTAs are being forced into unwinding short positions in equity futures markets across Europe. We estimate that CTAs’ net short position in the especially important DAX futures market is about 40% smaller now than at the latest peak. At the risk of repeating ourselves, however, the short-covering by CTAs that we are seeing has a strongly technical flavor. Given that the bottom is falling out of Germany’s real economy, we do not see much happening besides speculative players being ejected from bearish positions. It looks unlikely to us that the momentum behind CTAs’ exits from short positions will actually carry them into turning bullish. We also estimate that CTAs are in the process of covering short positions in most major agricultural commodity futures markets. They have already swung net long on CBT wheat futures and CBT soybean meal futures\"\n\nSo that's a lot of words and half of you have no clue what the hell that means.  There's no fancy crayon lines, it's just a simple bull trap due to shorts covering.  Ackman was actually right with his CNBC bullshit, hell is actually still coming.  \n\nSPY 5/15 260p", "id": "fxkud3", "created_utc": 1586402288.0, "score": 104, "upvote_ratio": 0.89, "num_comments": 68, "comments": [{"body": "It is a bull trap, we get it.  Fuck, why did you use so may words?", "score": 183, "replies": [{"body": "Strong check box of agreement", "score": 38, "replies": []}, {"body": "I seriously don’t think I’m going to be able to recover from this mentally. My brain used all of its power and I’m really worried, I don’t think I’ll make it through the night", "score": 9, "replies": []}, {"body": "Bull trap house.  Them contrarian's ran the house so hard the neighborhood thought the sky turned green LMAO.  12.", "score": 4, "replies": []}, {"body": "It’s a bull trap + (adderall) = long thesis", "score": 3, "replies": [{"body": "Forgot about the addies", "score": 1, "replies": []}]}, {"body": "Is it though?  I think the market doesn’t reeeeeelly care about people since not enough died and the virus is “perceived defeated”.  Or on the ropes.  Maybe this is the NE Super Bowl down 28 to 3 and like a killer unknown virus made in a lab, comes back to destroy us all.  But I don’t get that sense.  Not w/o the demand for stocks falling a metric fuckton.", "score": 1, "replies": []}, {"body": "to be Brutely HONEST, the OP is crazy if he thinks world is going on\n\n> possible lockdown cycle for the next year or two \n\nfor something that is mostly killing people with pre-existing conditions and majority may be a net-  rather than a net+  to economy.  This is killing people with diabetes, heart and respiratory issues, etc.  Vast majority of healthy younger work force aged people are NOT dying from it.  Numerous drugs are also being found to have beneficial affect of reducing cases from going to the extreme of going on ventilators. \n\n[https://www.foxnews.com/media/california-doctor-develops-process-for-identifying-extreme-covid-19-cases-and-how-to-treat-them](https://www.foxnews.com/media/california-doctor-develops-process-for-identifying-extreme-covid-19-cases-and-how-to-treat-them)\n\nI hate to burst your \"sky is falling\" and \"I'll be swimming in tendies with my puts\", but I see many more signs that doctors will be able to mitigate the extremes of this virus  with treatments and a vaccine will be developed probably for use by this Fall.  That's how I see this playing out.  NYC is a sh!tshow right now, but even there the system hasn't collapsed and the worst may be past, we'll see in week or two.  I won't be surprised to see the market retest the lows, but I just don't the \"Big Sploosh\" from a virus with 1-2% (most likely a lot less) fatality rate, maybe if this was SARS or MERS than yeah, head for the hills.\n\nJust my worthless two cents.", "score": -1, "replies": [{"body": "No coronavirus has ever had a vaccine commercialized successfully.  They have spent more than 7 years in trying to do so for MERS.  Even with tons of cash, the bottleneck is that it takes time to do trials, there is no chance of a vaccine by fall. Unlike other treatments, because it will be deployed en masse to otherwise healthy people that likely wouldn't be substantially harmed by Covid, it has to have essentially no side effects.  Given all that, even 18 months is very optimistic, as the average vaccine takes 10 years to develop.  I think we are gonna spend a ton of money and with dozens of companies on it, this will shatter records in vaccine commercialization time but that still puts it at about  12 months if stars align but realistically 18 or more.  See: https://www.cnn.com/2020/03/31/us/coronavirus-vaccine-timetable-concerns-experts-invs/index.html\n\nThere's a similar argument made in the National Review as well. I completely agree that this mostly kills folks that are older, obese etc... who generally do not contribute as much to GDP.  Here's the thing, no modern day politician in the US can say \"I am fine with 1 million+ of you old or obese people dying, we aren't going to murder the economy.\"  I agree with you, the death rate is likely overstated, its a fair bit worse than even the bad 2018 flu year, but its not MERS, not by a long shot.  None of that matters if policy makers don't give a shit, Cuomo basically said that they shutdown and if it saves one life, it's worth it.  Everyone loves him, even though that's a batshit insane thing to say.  You can save 20,000 lives by dropping the speed limit 20 mph, but no one would ever do that.\n\nJust like with the flu, there's limited possible treatments just by the nature of the disease, otherwise we wouldn't lose 60k to the flu some years.  As long as policy makers are unwilling to herd immunity this out like Sweden, and given that a vaccine won't be ready for at least 12 and more likely 18 months, it is what it is.  I don't love that millions of small business owners are going to lose everything they worked for due to government policy, but the states have clearly decided that's what they are going to do because no politician has any other choice for political survival.", "score": 11, "replies": []}, {"body": "Virus is not a cause for an economic crash. If the economy is stable, that literally means that it goes back to normal after receive an external shock.   \n\n\nTo paraphrase u/stormwillpass : HOWEVER  \n\n\nIf you think that economy is somewhat unstable. If you have reason to believe it has been propped up by smoke, curtains and meme stocks. Then you might see a global pandemic not as the cause of a crash, but the gay nail that pops the bubble.", "score": 3, "replies": []}, {"body": "I certainly can see where you're coming from and even agree that the overwhelmingly doom and gloom prognosis in this sub (and elsewhere on Reddit) is probably unwarranted. But that Fox news article is kinda garbage and has zero useful information. Dr. Fauci along with countless other experts and medical practitioners have been trying to warn the public of the dangers of believing in some sort of \"miracle cure\" for weeks now. You can easily find explanations regarding how drugs become established therapy for a certain disease (i.e. the existence of a drug does not automatically lead to therapy) and why it takes billions of dollars and sometimes decades to develop a single drug. Clinical trials exist for a reason and one would ignore good science to his own peril. Again, I don't think the sky's gonna fall out anytime soon but it is also highly unlikely that we will emerge out of Coronavirus economically unscathed. That said, I wouldn't YOLO in either direction.", "score": 1, "replies": []}]}, {"body": "I gave you the 69th vote :)", "score": -1, "replies": [{"body": "Nice.", "score": -1, "replies": [{"body": "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/RepliesNice` at **5137 nices**\n\n**2.** `u/Cxmputerize` at **3988 nices**\n\n**3.** `u/DOCTORDICK8` at **2529 nices**\n\n**...**\n\n**38272.** `u/Kapper-WA` at **3 nices**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)", "score": 2, "replies": []}]}]}]}, {"body": "I think this is good DD because it confirms my bias", "score": 19, "replies": []}, {"body": "You seriously think people are going to read your term paper?", "score": 66, "replies": [{"body": "I did, and I am half drunk on wine cause my girlfriend is over.", "score": 7, "replies": [{"body": "[deleted]", "score": 35, "replies": [{"body": "Rofl...", "score": -9, "replies": []}]}, {"body": "what are you doing here reading this shit....", "score": 3, "replies": [{"body": "Being a retard mostly... don’t worry, we enjoyed each other’s company.", "score": 1, "replies": []}]}]}, {"body": "Strong check box of agreement", "score": -1, "replies": []}]}, {"body": "I just got the spins lookin at your text", "score": 12, "replies": []}, {"body": "先生，這是一種Luckin咖啡.", "score": 12, "replies": []}, {"body": "What’s a CTA?", "score": 12, "replies": [{"body": "Commodity trading advisor, think of it as a mutual fund manager, but for options, futures etc...", "score": 9, "replies": []}, {"body": "I fucking second this question. I've seen it like 30 times and have no clue what it is and context doesn't help. I'm going to assume it's a commodities trading adviser aka hedge funds.", "score": 6, "replies": []}]}, {"body": "JPow doesn't give a shit about inflation or the economy anymore. He's firmly on the Trump bandwagon and this charade will continue until November.", "score": 5, "replies": []}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 13, "replies": [{"body": "Good bot", "score": 6, "replies": []}]}, {"body": "I just played Doom and deleted Hell. I’m selling puts to you tomorrow.", "score": 7, "replies": []}, {"body": "TLDR", "score": 3, "replies": [{"body": "There is literally a position at the bottom", "score": 9, "replies": []}]}, {"body": "too long didn't read this shit", "score": 3, "replies": []}, {"body": "Pokimane saved me 10k swear. shes BLESSED.  Legit read my history. She spooked me to pull for meme losses but it was shady Corona losses she was shielding me from. thanks ethot!", "score": 5, "replies": []}, {"body": "Long on soyboy futures? Lol ok beta", "score": 4, "replies": []}, {"body": "good read", "score": 3, "replies": []}, {"body": "If hell is coming then why is 260p? Hell will be 200p. At least tell me that so my puts feel better.", "score": 3, "replies": [{"body": "The problem is that a liquidity crisis involves quick drops due to deleveraging.  A solvency crisis is more predictable but slower, think more Sears/JCPenny which are inevitably going to zero but it takes a while.  You end up at the same place but not at the same pace.", "score": 6, "replies": []}]}, {"body": "At this point I've been wrong for like a week expecting this down turn, so I'm gonna yolo my entire account into XOM for the opec call at 10am, sell it at noon and fuck off forever until monday when I load up on puts and wait for SPY to hit -5 in August.", "score": 2, "replies": []}, {"body": "Don't worry, JPOW got his printer ready.", "score": 1, "replies": []}, {"body": "Ah skew it, nvm. I'll just clap for your dd.", "score": 1, "replies": [{"body": "I mean you say you're rich. But your government, corporate and personal debt would strongly disagree.", "score": 1, "replies": [{"body": "Our GDP say otherwise. Debt is not always a bad thing. Of course, if we can do it without debt that would be awesome too.", "score": 1, "replies": [{"body": "Very few economists, if any, think GDP is a useful measure. US is probably in the top 15 though, but certainly not richest.", "score": 1, "replies": [{"body": "I actually made that same argument in a term paper in regards of GPD. I'm going to guess you're going to say Singapore as #1?", "score": 1, "replies": []}]}]}]}]}, {"body": "I’m not approved for wheat futures. Any way to play wheat-rice with stonks?", "score": 1, "replies": []}, {"body": "Where did you find this Nomura report?", "score": 1, "replies": [{"body": "Following", "score": 1, "replies": []}]}, {"body": "This is sooooooooooo long. Snooooozzzeee😴", "score": 1, "replies": []}, {"body": "Why would you send a Harvard thesis to an insane asylum? Us autists need a tldr", "score": 1, "replies": []}, {"body": "The only other times stocks have been this highly valued were in 1929 and 2000.", "score": 1, "replies": []}, {"body": "wait until companies start doing buybacks again", "score": 1, "replies": []}, {"body": "If US stocks get cheap, China buys them.\nWe have to bbbrrrrrr for national security.", "score": 1, "replies": []}, {"body": "Hi! For this post (and future DD), feel free to join r/WallStreetResearch in order to easily cross-post. This isn't a competing server, but instead a digital archive for DD posts across subreddits so that research can be easily organized and referenced backed to. A financial research library of sorts.", "score": 1, "replies": []}, {"body": "Soo.. are we talking june puts or...  \n\nyou seemed to have forgotten to include a position and for that reason, ban.\n\nNice read though.", "score": 1, "replies": []}, {"body": "...jesus Harmonie christ. it is too late at night for this wall of text. My eyes are bleeding and my anus is itching...", "score": 1, "replies": []}, {"body": "Were da titties ?", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "Bro, shut the fuck up man. You want to write out a thesis paper, go to r/investing. \n\nNobody over here needs your obnoxiously long DD to tell us that the market is irrational.", "score": -9, "replies": [{"body": "Nobody forced you to read it. Go jerk off in the daily thread if you're not looking to read.", "score": 12, "replies": [{"body": "Bro I went to public school, I can't read.", "score": 1, "replies": []}]}, {"body": "stop", "score": 1, "replies": []}]}]}
{"title": "A Rant, frustrated at myself", "selftext": "Not really sure why I’m typing all this but just feel ashamed to tell anyone else and needed to get this off my chest.  \n  \n25yrs old, 35K in 401K, 15K in Roth IRA.  \n  \nHave a personal account that I tries to trade and what not... loss over 13K during this drop because I was in full margin on shares prior to the drop in solar power. Then trying to play options to protect my long position but timings all fucked.  Yeah I know not to time the market or whatever but it’s very tempting looking at the movements we have.  \n\nStarted investing around 3 years ago and probably loss over 30K in my personal account.  \nMean while my Roth and 401K barely took a hit during this time. Roth(MSFT@107, LULU@167).  \n  \nJust loss another 1K this morning in 10 mins trying to ride the wave up.  \nFinally closed all my positions and just transferred all the money out of my personal investment.  \n\nJust don’t think I’m cut out for this and seeing how safer investments is definitely the way to go I think I’ll just start from scratch again and put in $500 every pay check now and buy quality stocks and just let it grow.  \n\nKept using the excuse of having retirement accounts set up to trade very risky in my personal account.  Looks like I won’t even be able to contribute to Roth IRA this year because I’m running low on cash now.  \n  \nI know I’m still young but I feel like losing 30K+ over the years just kept me in the same place as where I started where if I had safely invested those I would’ve been in a way better place.  \n  \nTo anyone else still playing in this market. Props to you but I don’t think I can handle this anymore. \n  \nPlease don’t post suicide hotline number or whatever, I’m not having negative thoughts. Just frustrated at myself for being so stupid trying to understand the market.  \n  \nOrdered a kindle couple days ago and should arrive today. Think I’m just gonna take some time off and read or something.  \n  \nLet me know if u have any good finance related book or anything.  \n  \nThanks", "id": "fxtpby", "created_utc": 1586443685.0, "score": 35, "upvote_ratio": 0.79, "num_comments": 69, "comments": [{"body": "Where did the Options touch you sir", "score": 54, "replies": [{"body": "💀💀🤣🤣", "score": -6, "replies": []}]}, {"body": "bro Im 19 and lost 10k ... feel you", "score": 21, "replies": [{"body": "21 and lost 25k", "score": 8, "replies": []}, {"body": "19 and lost 4k", "score": 5, "replies": [{"body": "10 and lost 17k", "score": 15, "replies": [{"body": "[deleted]", "score": 36, "replies": [{"body": "damn u got my respect.\n\nI hope I can achieve the same as you... one day", "score": 2, "replies": [{"body": "20 and even right now with a whole basket of ks on USO $6c LEAPs, pray for my tits I don't want them to go up", "score": 1, "replies": []}]}]}]}]}, {"body": "20 and down 8k. Diamonds hand brother, roll puts over to august and forget they exist", "score": 5, "replies": []}, {"body": "25 and down 100... dollars and it hurts", "score": 5, "replies": []}, {"body": "18 and 25k fuck you", "score": 5, "replies": [{"body": "Did Barstool make you do it? Did Dave tell you? Love that guy but hes a fuckin idiot.", "score": 2, "replies": []}]}]}, {"body": "Sir this is a Dunkin Donuts", "score": 27, "replies": [{"body": "Can I get a crunch wrap supreme", "score": 5, "replies": [{"body": "No. You can have a sausage gowrap", "score": 2, "replies": [{"body": "Thank you! Very Cool!", "score": 3, "replies": []}]}]}]}, {"body": "Dude, buy some stocks from reputable companies and don't look back.  You'll grt rich, just slower.", "score": 36, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Honestly I’m fully against that market sentiment. Apple and Microsoft are so fucking overvalued at the moment  it hurts me on a very physical level. Not saying I would short/buy puts on them but holy fucking shit I would not dare to buy shares at those levels. Yea sure they got piles of cash, which is the reason investors are flocking to it to get any yield as it’s seen as a safe bet, but at least personally I’m staying 10 feet away from any and all tech stocks at the moment.", "score": 8, "replies": [{"body": "People have been saying that for almost 10 years, yet tech stocks keep going up", "score": 8, "replies": []}, {"body": "So, which sector(s) are you bullish on?", "score": 1, "replies": [{"body": "none really. cash is king for me at the moment. only sector I was kinda interested in at the lows were banks and airlines, but those are out of their buyrange for me.", "score": 1, "replies": []}, {"body": "Well the market is bearish, so in the short run none. But Tech, Municipal Bonds, and Commodities are all good places to start looking for opportunities down the line. The next crisis will be real estate, so steer clear of REITs and the Financial Sector unil at least October.", "score": 1, "replies": []}]}]}]}]}, {"body": "You need to do a final yolo.", "score": 8, "replies": []}, {"body": "I wiped my ass and blood came back", "score": 6, "replies": []}, {"body": "Peace out pussy. See you next week when the economy tanks", "score": 6, "replies": []}, {"body": "Thinking as “oh if I would have done this, if I would have done that” I would be way better off, if it were that easy and everyone could get a retry we’d all be rich as fuck, it sucks, and I understand the stress, if you’re planning on putting back in 500 every pay check, you’ll make that $30k back in no time everything is on sale right now and in 5+ years you’ll have much more than that bruh", "score": 3, "replies": [{"body": "Thanks man, I know it’s not healthy to think the what if but it’s hard not to reflect on my mistakes and feel fucking stupid.  \nGonna try to do some things that make me happy or study up to prepare for my next job.  \nKeep telling myself the biggest investment I can do if getting a higher paying job.  \nAm a software engineer making around 85 hoping next one could be over 6 rig.", "score": 5, "replies": [{"body": "You should figure out why your trades were bad. You need emotional control and stick with a trade plan. Many times we freak out and start trading impulsively. This will lead to your downfall", "score": 2, "replies": []}]}]}, {"body": "first you lost a grand in 10 min so you immediately sold? You gotta hold at least for a day or two. Start small and increase with more profit. I’d start with a grand and move the rest of that money into your roth ira", "score": 3, "replies": []}, {"body": "Actually you really should go to r/investing and try to recover from this there. \nNot everybody is cut out for roulette right?", "score": 3, "replies": []}, {"body": "im 20 lost $30k plus as well in in a span of 12 months. just lost an additional $2k today. it was all my savings. i now only have $400 to my name. ill be deleting my brokerage account after next week when my final trade expires worthless. never touching the market again. ill never financially recover from this. im officially scarred for life and scared to ever invest (gamble) again", "score": 3, "replies": [{"body": "Huddled in the corner buying ETFs", "score": 1, "replies": []}, {"body": "Jesus, what the hell were you buying? Start putting 500/month into a Roth Ira and buy VOO, QQQ, SPYG or some other etf. When you are 59.5 and can pull it out (all tax free) you will have $1.275m if the market averages 7% growth overall. Put the same amount into your regular brokerage account and do the same thing with other etfs, since you can't contribute more than 6k/yr to Roth Ira. You will be rolling in loot.", "score": 1, "replies": [{"body": "got really caught up into chasing my losses and revenge trading on emotions. Its gotten to the point of thinking the market is purposely doing the opposite of my trades in order for me to realize im not cut out for this.", "score": 1, "replies": [{"body": "Do yourself a favor and go the etf route like I said above, you will be very wealthy by 50", "score": 1, "replies": [{"body": "which ones are you in?", "score": 1, "replies": [{"body": "VOO is my favorite and very stable long term, just look the holding companies of voo, QQQ, VGT, SPYG and decide which you like the most. Search for them on yahoo finance, and look at the holdings tab", "score": 1, "replies": []}]}]}]}]}, {"body": "Just go back to being a regular 20 year old for a while. Once you get your first job start saving with the goal of investing it.", "score": 1, "replies": []}]}, {"body": "Hey man, 80-90% of people are in the red. You are not alone. A lot of bear loss porn will be posted here. \n\nChin up, buy and passively invest in ETFs as that's the safest, best way to grow your lot. \n\nAlso, the obligatory get the fuck off WSB and take your safe shit to r/investing. We love being poor and sucking dick behind Wendy's.", "score": 4, "replies": []}, {"body": "God gave you a gift! Stick around wsb. We could use a mantled piece of responsibility around here", "score": 2, "replies": []}, {"body": "Just buy some blue chips and sit back and relax. I just started trading like a month ago and it's tough. I'm not even trading options because shitty canadian brokers, so I'm scalping. I'm making like $50 a day and starting to feel this uhhh...ain't it chief. For me anyways.", "score": 4, "replies": [{"body": "Thanks man. Good luck to u, I have so much to learn about being patient and stuff", "score": 2, "replies": [{"body": "I don't do options and my greatest single lost was 50k on a single stock. It took like 3-5 wins to cover that loss on other stocks. Like really big investing.\n\nNowadays I only buy profitable business. I don't care if it's the greatest growth story ever, especially in Tech.", "score": 3, "replies": []}]}]}, {"body": "What were your positions?", "score": 1, "replies": []}, {"body": "Don't be to hard on yourself. Ive lost 80 k in about 5 minutes.", "score": 1, "replies": []}, {"body": "Good post man I feel you and a lot of other people in this sub probably do too but its WSB so probably just get a bunch of smart ass answers, but honestly it's all good. It's only money at the end of the day and ya it sucks but people have been in much worse positions!   \n\n\nKeep ya head up", "score": 1, "replies": [{"body": "Thank I already been telling myself that it’s just al money and I’ll make way more in my life time than this loss but it’s good to hear from someone else. \nThank you", "score": 1, "replies": [{"body": "NP man! If you wanna talk more can DM. Ik you said no suicidal and what not but ya just leme know :p", "score": 1, "replies": []}]}]}, {"body": "Emotional trading is the fastest way to lose money in a volatile market", "score": 1, "replies": []}, {"body": "K bye", "score": 1, "replies": []}, {"body": "easy come easy go \n\nif you can't handle the easy go part then yea just buy shares and stay stress free", "score": 1, "replies": []}, {"body": "imagine if you just inversed yourself for all those trades", "score": 1, "replies": []}, {"body": "Your ability to recognize this is huge.  Some people, as you know, just keep coming back and losing more.  It’s the gambler’s mentality.  “Maybe this time it’ll work.”  “Maybe this time I’ll make it back.”  Some people just don’t.\n\n$30k is indeed a lot of money, but you can write off $3k a year of that.  If you didn’t claim those losses on your taxes, speak to an accountant.  You can amend old returns.\n\nYou’ll recover from this.  But I just wanted to commend you on your ability to walk away from this.  Good luck.\n\nEdit: Just saw you make $85k a year and you’re 25.  Do not sweat $30,000.  Money is relative, and in the end you won’t even think about it.  Again, good luck.", "score": 1, "replies": [{"body": "Yeah I’ve been writing them off for the last two years.  Got 8 more years to go...haha.  \nI kind of said the same thing during my previous big losses about leaving those risky play days behind. But always came back. I truly hope I’ve grown this time and can stick to what I said I’m gonna do.", "score": 1, "replies": []}]}, {"body": "Buys Stock and sell calls on them for Easy money", "score": 0, "replies": []}, {"body": "This is a tough market OP. I was up and just today lost all my gains for the past weeks and then some.", "score": 0, "replies": []}, {"body": "thats pretty awesome dude", "score": 0, "replies": []}, {"body": "Looks like we gotta pick up some extra shifts at mcd", "score": 0, "replies": []}, {"body": "Not really sure why,  these nuts on your chin", "score": 0, "replies": []}, {"body": "Moron", "score": 0, "replies": []}, {"body": "The truth is everyone loses money in their first few years of \"investing\" until you learn that trading and staying in cash in-between trades is the way to go. Typically they do things like invest in companies they know or buy gold because inflation is real but slowly learn that the real market is much more nuanced, random, and fast moving to where it doesn't respect your ideas. Just watch level 2 quotes as news comes in and do this for months of your life. It's like reading the matrix but it will show you people's true behaviors only then can you get ahead of them and still will fail half the time.", "score": 0, "replies": [{"body": "Haha I really hope this is true because it’ll make me feel like I’m not alone", "score": 0, "replies": []}]}, {"body": "You.... quit? With money left to Yolo? Retard.", "score": 0, "replies": []}]}
{"title": "A few basic explanations for the less Econ-savy autists: the macroeconomics of a depression", "selftext": "[deleted]", "id": "fxzfdf", "created_utc": 1586462189.0, "score": 44, "upvote_ratio": 0.86, "num_comments": 79, "comments": [{"body": "I’m not reading this novel and there’s no TLDR so bend over and I’ll show you where the tldr usually goes.", "score": 55, "replies": [{"body": "This", "score": 3, "replies": []}]}, {"body": "You could have just posted the 30 minute Ray Dalio video from YouTube.", "score": 18, "replies": [{"body": "Puts on plagiarism!", "score": 1, "replies": []}]}, {"body": "Money in the hands of the people. \n\nI was with you until you said this dumb shit. \n\n\nWhat fucking people?", "score": 25, "replies": [{"body": "Yeah no one has received a fucking dime....", "score": 8, "replies": []}, {"body": "Literally all people, but particularly those who spend a higher proportion of their income.", "score": 2, "replies": [{"body": "So basically we need to give a bunch of poor people money so they have a never ending stream of amazon delivery people to their doors to save the US economy, got it.  \n\n\ncalls on amazon!", "score": 6, "replies": [{"body": "Businesses buy stuff from Amazon too, don't bet on them breaking revenue records.", "score": 1, "replies": []}, {"body": "This!!!!. Brilliant!!! Give people that the majority of which have already proven are BAD with money, more money! brilliant!!!!", "score": 1, "replies": [{"body": "It actually is because people who are bad with money will go buy stuff and stimulate the economy/increase the cash activity in the economy\n\nPeople who are good with money are probably less likely to go on a spending spree during a pandemic and just sit on their cash", "score": 4, "replies": [{"body": "Or they buy back stocks and get bonuses. Seems legit.\n\nThis is the way.", "score": 1, "replies": [{"body": "People don't buy back stonks, corps do", "score": 0, "replies": [{"body": "Glad you have seen the light. \n\nThe people are getting the majority of the debt. The corps are getting the majority of the money, again. Dig deeper than what your senator is telling you. Financial education is key. The people should have gotten ALL of the money if they are giving it out like candy. Have fun with your 250k a year when milk costs 20. \n\nThis is the way.", "score": 1, "replies": [{"body": "Yeah the corp's are in a bubble, they've been taking out debt to buy back their own shares and driving the stonk prices higher and higher, and now the fed is starting to purchase speculative grade bonds - aware of all that stuff  \n\n\nNobody should have gotten any money, let it all burn down like nature's forest fire", "score": 2, "replies": [{"body": "I can only upvote this once, appologies. \n\nThis is the way.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Lmao this dipshit thinks the point of economic stimulus is to reward or punish people for financial sins and allocate money to people who \"are good\" with it (ie, good for themselves, not necessarily the economy as a whole).", "score": 0, "replies": [{"body": "Great point... let's send money to businesses that are proven to be bad with money. That will surely help and has never failed before in the past. \n\nHook. Line. Sinker.\n\nThis is the way.", "score": 1, "replies": []}]}]}]}]}, {"body": "The Human Fund: Money for People", "score": 2, "replies": []}]}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 20, "replies": [{"body": "Good bot", "score": 9, "replies": [{"body": "Nice", "score": 3, "replies": [{"body": "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/RepliesNice` at **5183 nices**\n\n**2.** `u/Cxmputerize` at **3988 nices**\n\n**3.** `u/DOCTORDICK8` at **2553 nices**\n\n**...**\n\n**38680.** `u/khzdleof` at **3 nices**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)", "score": 1, "replies": []}]}]}]}, {"body": "> thanks to some technicals analysis I was ultra bearish \n\nCredibility gone. Stopped reading.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "It's a win win for everyone.  Shitty companies get to stick around and accrue more debt, participate in stock buybacks, and bitch about providing healthcare and raises to workers.  And workers get to keep doing their same shitty jobs for companies who don't give a fuck about them, keep buying shit they don't need, and continue to accrue more debt.  Win win!!", "score": 3, "replies": []}, {"body": "It helps to prop up losercimpanies that should be filing for bankruptcy.", "score": 2, "replies": []}]}, {"body": "So what's the end game?\n\nBrrrrrrr money to stop deflation.  The Rona is eventually killed with a vaccine.  And then???", "score": 2, "replies": [{"body": "Massive fucking inflation afterwards, and then taxes go up as the government tries to remove some portion of the \"hot money\" from the economy. Only problem is, most of the stimulus money they're brr-ing out now won't go into the pockets of Joe Citizen, but into offshore accounts of zombie companies \"too big to fail\" and the bank accounts of their executives. So there's no way to go after that vast majority sum of money, and in the end the ordinary citizen pays way more in taxes than what they got in government financial help now.", "score": 7, "replies": [{"body": "To control run-away inflation interest rates would have to rise and increase the burden of enormous debt.\n\nSo fuck it... keep rates at 0, print money, buy calls and real estate on debt and a second home for your wife and her boyfriend.", "score": 3, "replies": []}, {"body": "essentially  yes", "score": 2, "replies": [{"body": "OK, humour me, I know this is going down actual discussion ratholes that's not exactly autistic standards for WSB. \n\nWhat's stopping governments around the world from going after tax evasion/tax loopholes/offshore banking havens? Why are they still allowed to exist? What do countries gain out of it?", "score": 2, "replies": [{"body": "What do countries gain out accruing interest on money that isn't taxed?  Money!", "score": 2, "replies": [{"body": "But it's money that stays hidden and held in bank accounts that can't be touched! At least overtly. So it's just hoarding for the sake of it.", "score": 2, "replies": [{"body": "Sure, if your thinking these companies are simply locking it up in a giant safe deposit box, sure.  But that money is going into the bank and being used as credit for other loans and accruing interest for both the borrowee and bank.  It works like any other bank.", "score": 2, "replies": []}, {"body": "It's all about maintaining power, if you maintain capital in the hands of a few.", "score": 1, "replies": []}]}]}, {"body": "Western countries gain massively out of tax heavens.\n\nTax heavens are basically used by the banking lobbies to let emerging countries starve, since most of the income produced in third  world countires isn't reported and goes offshore. This keeps price level for commodities lows and exchange rates in our favour. They also use tax heavens to keep debt levels high  (since they don't pay any taxes) an to cover any illegal activity that wouldn't bee seen as good. The banking lobby at least  here in Europe has massive power over governments. In particular the London banking lobby gains the most out of tax heavens", "score": 0, "replies": [{"body": "The problem isn't just in Europe. Asia and the US have massive tax haven issues too, and I feel particularly ashamed that I come from one myself (Singapore). Used to work in corporate finance and offshore incorporations, and I quit the industry after I got a peek into the world of tax havens and offshore banking here in Singapore and realised how fucking ugly it truly was morally. You're absolutely right, so much of such money comes from impoverished countries and regions where the money should have rightly stayed and be used for their development and betterment. But human greed is endless.", "score": 3, "replies": [{"body": "Best whishes bro, hope you found a better industry to work on", "score": 1, "replies": [{"body": "I haven't. I'm still unemployed at the moment, and the job market in Singapore has gone absolutely straight to hell. We're a city state that lives and dies on globalisation and trade and tourism. Imagine how it's like now with the pandemic? You won't read about this in the mainstream news, but things are not going well here. We're not handling the outbreak well and now we're starting to peak just like Italy and the US did about three weeks earlier. \n\nI'm a degree grad in History and Politics, and I've just been reduced to applying to work as a HGV driver at the Singapore Container Port, not even sure if I'll get it either. People are queuing up to work for peanuts for Grab to deliver food now. Work from home is a thing but in an absence of demand and with regional/global partners all stalling, everything's drying up rapidly too. \n\nWish me well. Thanks.", "score": 5, "replies": [{"body": "Sorry to hear that, I hope this situation doesn't last very long. I live in Italy, things are going tits up here too. Tbh I was thinking of moving to Singapore sometime in the the future but I get that you don't recommend it", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "So what so you are suggesting is to move everything to a ROTH now. Got it.", "score": 1, "replies": []}]}, {"body": "There will eventually be a recovery after economic production goes back to normal and debt level compared to GDP lower a little bit. And then we'll have this same conversation again in a decade or so I suppose", "score": 2, "replies": []}]}, {"body": "I too have watched Ray Dalio's explanation of business cycles on the YouTube.  I will provide my macro analysis post shortly.", "score": 2, "replies": [{"body": "I study Economics and Finance at University. Having said that, that is an excellent video.", "score": 0, "replies": [{"body": "But it was already said long ago....in a surprisingly and succinctly brilliant video....by (no offense) someone with public bonafides.\n\nSoooooooo......why not just link his video and add a TL;DR and a little color commentary?\n\nWhat you posted is nice but, also, retarded.\n\nAnd since we are bragging about cereal box degrees, I too attended an esteemed post-secondary institute = aka a two year accounting diploma from community college.", "score": 2, "replies": [{"body": "You want my TLDR? I don't fucking care if JPow keeps printing, this market is overvalued. I am short and leveraged to the tits on SPY. Holding with iron fucking hands.", "score": 3, "replies": []}]}]}]}, {"body": "Philips curve ded in 70s.", "score": 2, "replies": [{"body": "That's a good point, Philips curve has been proven wrong, but we could still say we are in a deflationary situation imo. Maybe I'm wrong", "score": 1, "replies": [{"body": "The lockdown in and of itself in deflationary, but the interventions are clearly very inflationary. Anyways it's not really meaningful if by inflation we mean things like the CPI (or if we want to get more technical PPI or GDP deflator) right now because I'm pretty sure they did not lockdown the economy during the Spanish flu.\n\nAsset prices are a different story because of market microstructure where you get \"disorderly\" unwinding. And by large I think the disorderly unwinding stopped. Though if the lockdown lasts well into May I would imagine disorderly defaults to really start pop up.", "score": 1, "replies": []}]}]}, {"body": "But maybe WE NEED FUCKING DEFLATION because rich just keep their assets inflated with taxpayers money DEGENERATE", "score": 2, "replies": [{"body": "It's not taxpayer money. A central bank is a separate entity from the government. It \"prints\" money to buy financial assets. It's new money, it's inflation.", "score": 1, "replies": []}]}, {"body": "People are going to roast me for this but this is a great opinion. Thanks OP.", "score": 2, "replies": []}, {"body": "TLDR?", "score": 1, "replies": [{"body": "Economy BAD => BRRRR => Economy GOOD", "score": 9, "replies": []}]}, {"body": "Title: Basic Econ Autists Depression\n\nContent: TLDR", "score": 1, "replies": []}, {"body": "Nice", "score": 1, "replies": [{"body": "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/RepliesNice` at **5182 nices**\n\n**2.** `u/Cxmputerize` at **3988 nices**\n\n**3.** `u/DOCTORDICK8` at **2550 nices**\n\n**...**\n\n**38657.** `u/stonksteslaup` at **3 nices**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)", "score": 1, "replies": []}]}, {"body": "For a retard like myself, this made a lot of stuff that does not make sense, even more confusing. What YOLO play can I take away from this?", "score": 1, "replies": [{"body": "JNK calls", "score": 1, "replies": []}]}, {"body": "Positions or ban", "score": 1, "replies": [{"body": "I'm short on SPY with my entire account. 3x leverage.", "score": 2, "replies": [{"body": "So you’re saying the SPY 260P 5/1 I bought today for 4.80 is gonna 🚀", "score": 1, "replies": [{"body": "I'd say you have a dangerous expiration date ... I would change it to further down the line, but it depends on pricing obviuosly", "score": 1, "replies": [{"body": "That was the furthest I could afford to go 😔...maybe I should’ve sold when it was up $100", "score": 3, "replies": []}]}]}]}]}, {"body": "Can’t we prevent useless debt by not bailing out companies that do it? This would cause companies to think about every loan they take on and budget more responsibly", "score": 1, "replies": [{"body": "You could, but this could cause systemic damage to the production of goods and to the financial sector. It's better to prevent than to cure. We need different regulations", "score": 1, "replies": [{"body": "But for a lot of industries couldn’t we let the companies in a lot of debt fail like they should and use that money only for financially responsible companies? Take airlines for example, couldn’t we bail out the more stable airlines and let reckless ones fail. The responsible airlines would then take on the business of the airlines that fail (the number of people flying won’t change so it’s the same amount of overall business for the industry). These airlines could then, theoretically, hire some/ most of the employees from the failed airline. Im not saying you’re wrong I’m just trying to learn more cause I’m retarded and don’t know any of this shit. Your original post was informative btw thanks", "score": 1, "replies": [{"body": "If you let too many debt default take place, you end up in a bad place where banks can fail and even more deflation happens, A good policy maker tries to use monetary policy and fiscal policy in a balanced way to seek good goals but without causing additional damage at the same time", "score": 1, "replies": [{"body": "Is this just like kicking the can down the road indefinitely? Seems like in order to fix the current problems we’re just creating bigger ones in the future", "score": 2, "replies": [{"body": "I would say that the US has still a long way to go before reaching that point. But some developed economies like Italy and Japan are already there", "score": 3, "replies": [{"body": "Fuck", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "\" There needs to be a system that stops a bank to lend huge amount of money to a shitty company just to blow it all off on executives compensation packages and stocks buybacks.\"   \n\n\nHonest question then, why can't banks write these in as terms and conditions for the loans they grant companies and individuals? What's stopping them from insisting on accountability on where the money they lent out goes? I can't think of why this wouldn't be a good thing for banks to do, because surely no bank wants to be held leverage by debtors with large amounts of debt and credit so big that they can't afford to fail.", "score": 1, "replies": [{"body": "You make a good point. The problem is that the bank who actually writes the debt in practical terms doesn't assume any risk for itself. When a loan is created it's immediatly resold and repackaged trough a chain of instruments and derivatives all in the seek for yield", "score": 1, "replies": [{"body": "So basically Wolf of Wall Street/Lehman Brothers/Margin Call bullshit?", "score": 1, "replies": [{"body": "Yep. Exactly", "score": 1, "replies": []}]}]}]}, {"body": "Do you work for them? Wtf", "score": 1, "replies": []}, {"body": "I buy it.  I buy it all. So What’s the move? Load up on debt? Minimize debt? Dump home? Convert everything to ROTH to avoid rising taxes? Already 70% cash. 5% puts. 25% stocks.", "score": 1, "replies": []}, {"body": "> Everyone thinks that they are rich, beacuse they have lots of cash in the bank, but they don't realize that their cash positive balance is another's person debt balance. It's how a bank works, lends your cash to a retard and fucks you with obscene fees in the process.\n\nNo, you absolute moron. The bank loans come from the fact that they are writing down that loan in their balance sheet. Nothing else. Bank create money, you austrian scum.", "score": 0, "replies": []}, {"body": "Ban", "score": -2, "replies": []}]}
