{"title": "Sharing my portfolio picks which includes some more unknown speculation stocks", "selftext": "TSLA - Just buy it, way to bullish not to own.  New products are being announced shortly will continue to drive stock price.\n\nSHOP - This will/is turning into Amazons largest competitor for online shopping.  I see growth going to the moon on this pick. Buy this over Amazon.\n\nGOOD - Gladstone Commercial Capital this is a REIT with a dividend yield of 10% that pays monthly and have never missed a monthly dividend payment.  Their portfolio is all corporations with strong balance sheets (example JP Morgan Corporate offices) who are locked into long term agreements.  The most pessimistic  analyst has the stock price at $24 and its currently around $14.\n\nDIS - super strong balance sheet lots of cash to weather the storm.  Will be up from $100 to $130.\n\nUSO - United States Oil,  trade oil contacts, trading at all time lows right now.  One thing guaranteed in life is that oil will increase in price.\n\nBNED - Barnes & Noble education, most of your college bookstores is this company running under colleges name.  Coronavirus has not had an effect on future textbook sales but the stock is down to $2 from where it should be trading around $6.  Additionally BNED has taken all there money for years and instead of doing Stockbuybacks have spent it for online R&D for future growth.  This is a buy, buy, buy.\n\nHD - Trading at $207, you will see continued growth.", "id": "g38qce", "created_utc": 1587151738.0, "score": 70, "upvote_ratio": 0.86, "num_comments": 73, "comments": [{"body": "These are the posts I love to see. I’m always just generally curious what other redditors are putting there money in", "score": 46, "replies": [{"body": "This post belongs in the quarterly “rate my portfolio” thread. Also, you should check that thread to see what others are investing in", "score": 10, "replies": [{"body": "Dope, thanks", "score": 4, "replies": []}]}]}, {"body": "Just buy AMD. Heard the price is going up 9200%. Don't ask me how, just AMD bro.", "score": 18, "replies": [{"body": "[deleted]", "score": 17, "replies": [{"body": "Having an AMD graphics card in your phone will do that to ya mate", "score": 3, "replies": []}]}]}, {"body": "From what I read, USO is only going down. They'll either reverse split or default to $0.\n\nWill try to add more winners to my portfolio.\n\nEdit: just added SHOP, hopefully I made the right choice doing it now.", "score": 7, "replies": [{"body": "I think you will be happy with it, I know I am.  I've been increasing my shares with SHOP and it might turn into my largest position.\n\nFor USO I believe there is going to be more pain especially when the next months futures need to be bought.  However nobody knows if it will go zero and there have been academic papers written on these types of situations.  However im a believer that states will open up and things will turn back to normal making the fear of 'Contango' 'roll yield' something that wont be as feared as it is now.  Im also a believer you need to buy on peoples fear to make money so ive been buying USO at these all time lows.", "score": 5, "replies": [{"body": "same i think USO is all time low right now and once things start rolling i feel like it will have a good run", "score": 2, "replies": [{"body": "Same", "score": 2, "replies": []}]}, {"body": "Alot of things need to keep happening right for SHOP in order to sustain this rate of growth. It's trading at 52 week highs during an economic time that's not favorable at all to small businesses or general consumerism. Oooof I don't know man. I have a bad feeling about it. Maybe it's an okay long term pick. But medium term seems way too risky", "score": 1, "replies": []}]}, {"body": "Might join u on that let’s pray it’s a bull", "score": 2, "replies": [{"body": "Join me on SHOP or USO? I pray for USO bull. It's thus far my biggest loser at -42¢.", "score": 2, "replies": [{"body": "I meant shop and -42 cent over how many days ??", "score": 1, "replies": [{"body": "Since last Thursday. I invested $2 that day, then an additional $1 today.", "score": 1, "replies": [{"body": "Why don’t u invest more?", "score": 2, "replies": [{"body": "I'm concerned it could default to $0 or do a reverse-split.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Bned stock is interesting havnt heard this one mentioned yet", "score": 6, "replies": [{"body": ">BNED \n\nidk fam looks like a steady decline for the past decade for me....makes sense since more and more people will use online textbooks which are less profitable and (for some) easy to copy/pirate", "score": 7, "replies": [{"body": "Yeah, I’d rather buy Chegg", "score": 2, "replies": [{"body": "Got me through physics 1 and 2", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 23, "replies": [{"body": "You dont know a single small business using shopify? Every store I buy something from online that's a small business seems to be using shopify. For inventory control and listing products its one of the easiest ways available. My take might be anecdotal but there are companies switching *to* Shopify quite often because of how poorly Squarespace and Bigcartel are for some business owners at handling releasing new products.", "score": 9, "replies": []}, {"body": "I agree with this guy on almost all accounts. I own 2 online businesses and after looking at Shop for their services, I went with a competitor of theirs instead. \n\nTSLA is way too overvalued for what it is and saying 'buy the hype' is pretty terrible investment advice. Maybe when they are more of an IP company and less of a car company I will change my mind.", "score": 7, "replies": [{"body": "Look up SolarCity and Powerwall. Tesla is not just a car company at this point", "score": 1, "replies": [{"body": "What about those? They are such a small part of Tesla that and you think it justifys a 150b valuation? Tesla is a completely hype stock that has literally never made a year of profit in its existence.", "score": -2, "replies": [{"body": "You specifically said: \n\n>Maybe when they are more of an IP company and less of a car company I will change my mind.\n\nThat is what I’m giving you examples to counter. I didn’t justify anything, I was giving you examples that they are not purely a “car company”.\n\nSolarCity’s NY production plant employees over 1,500 people. It’s fucking tiny.\n\nPowerwall deployments are growing at a huge rate, and have been basically since thy rolled out, as well as furthering their Battery R&D that will improve their solar storage, and EV car distance.", "score": 1, "replies": []}]}]}]}, {"body": "Cars, insurance, and renewable energy are not “real world use”?", "score": 2, "replies": []}, {"body": "There’s over a million businesses using Shopify. You’ve probably bought something online through their platform without knowing it. Apparently they’re seeing Black Friday like traffic. Plus, many businesses who have had to close brick and mortar have moved operations online. SHOP is a long term play for sure. Gaining market share every year and investing in their own fulfillment network will turn them into a key competitor to Amazon.", "score": 1, "replies": []}, {"body": "Tesla was not 180 a month ago.  Tesla is beating the S&P500 on the 1 week, 1 mth, 3 mth, 6 mth, 1 yr, 2 yr, and 10 yr charts.  Over valued is debatable and I’m not waiting my time with another Tesla hater.  You do you, I’ll keep making that real money as the company get into a lot more in the future.", "score": 1, "replies": []}, {"body": "BNED sounds like an awful idea for sure", "score": 0, "replies": []}]}, {"body": "Completely agree with the tsla pick, shop tho do you not think it is overvalued and suffer in the short to medium term with the virus. What is shops moat that makes them a cut above the rest I’ve spent ages researching the company but can’t find it like I did with tsla", "score": 3, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "Please check your info, it is flat out wrong.", "score": 9, "replies": []}, {"body": "Sorry, I don’t understand. If you are infering due to the recent rise of tsla it is now a poor pick, I think over the next 10 years today’s price will be seen as a bargain", "score": 3, "replies": []}, {"body": "I owned TSLA when it was at $30 does that make $18O a poor buy?", "score": 2, "replies": []}]}]}, {"body": "What is the driving force behind SHOPs recent rise?", "score": 2, "replies": [{"body": "Its the future, every small business, amazon seller and online entrepreneur is going on this platform.  It will continue to bite away at Amazon marketshare.", "score": 7, "replies": [{"body": "I don’t think amazon has any threat from shopify right now. As a matter of fact amazon can spin off an arm like shopify in a matter of weeks if not months.", "score": 7, "replies": [{"body": "what if there was a way we could invest in both as well as other online retail companies....like some kind of fund...that tracks an index...", "score": 2, "replies": []}]}, {"body": "I honestly hope so. I use Amazon some (b/c I can't find certain things anywhere else for a bargain), but I hate it. Jeff Bezos is a crooked big-cat who is way too rich & greedy. I ain't bought a single penny of Amazon & genuinely wish it will crash then burn.", "score": 0, "replies": []}]}]}, {"body": "AMZN-every one should have some in the portfolio during the most recent correction. It dropped -4.5% and right now it is +9% higher than historical high(SP500) in mid Feb.", "score": 2, "replies": []}, {"body": "I completely disagree on shopify being a competitor to Amazon sooooooooo much. It's just hype, trading at all time highs. Don't get me wrong I've watched all these YouTube videos how easy it is to start a small business on there and make thousands per day. But I just don't see it as a competitor, don't like their interface either. \n\nIf you wanted e-commerce when Amazon is too expensive for you. BABA or JD is better. Check their balance sheets compare to SHOP. Just an opinion, I do own JD shares tho, later want to add BABA too since they have a larger profit margin. Anything but SHOP or maybe I'm not seeing something", "score": 2, "replies": [{"body": "SHOP is the second largest eCommerce platform in North America with 7% market share. They are investing billions into their own fulfillment  network and have seen increasing growth of merchants joining their platform year over year. Shopify is also putting money into their own marketplace. Also, it’s not just small businesses using their platform. SHOP has many large businesses making billions on their platform. I agree that right now their stock is a bit overpriced but Shopify is clearly a direct competitor to Amazon.", "score": 1, "replies": []}]}, {"body": "I own $GOOD stock and its a magnificent stock.  Really overlooked in terms of volume.", "score": 2, "replies": [{"body": "Completely agree its probably my most coveted stock I own.", "score": 3, "replies": []}, {"body": "GOOD sounds interesting but doing some more research I found that they have an insanely high payout ratio. In 2019 they paid out 60 million in dividends while their net income was only 9.5 million. Ignoring other expenses, their dividend is almost twice as much as their operating income (35 mil).\n\nIs there something I’m missing?", "score": 3, "replies": [{"body": "REITs are required by law to pay a minimum of 90% of its taxable income in dividends.", "score": 6, "replies": [{"body": "These dividends are also taxes at income tax rate. Is that right?", "score": 1, "replies": []}]}]}, {"body": "What is your opinion on Ventas Inc. in this case? It seems to have a better balance sheet and also pays around 10% dividend. Am I missing something?", "score": 1, "replies": [{"body": "I havent really followed or looked into Ventas.  Ive always been weary of Research Institutes because its an expense that can always be pulled or moved geographically.", "score": 1, "replies": []}]}]}, {"body": "Nice", "score": 1, "replies": []}, {"body": "Can’t find uso on my trading app but that’s some really small amounts u investing", "score": 1, "replies": []}, {"body": "long term (5-10 years) i'd worry about barnes & noble, but short to medium that should be a nice pickup.\n\nmy concern with then is that paper is clearly a dying business, and it's only a matter of time until the major book publishers start running their own digital market places cutting out the middleman like we already saw with music. music is alive and well, tower records? not so much. same thing could happen to b&n.", "score": 1, "replies": [{"body": "People still prefer paper over electronic in book form.  Nooks and Kindles have gone from becoming mainstream to niche and gone.  Additionally BNED have been one of the main contributors for digital R&D and the platforms they run on.", "score": 1, "replies": [{"body": "That people prefer paper has been proven false by bookstores closing en masse the past 1.5 decade. and you can read ebooks on any smartphone or tablet. at college a few years back, we would laugh at people who actually bought the textbook.\n\nI just don't think investing in paper, a dying medium and finite resource, is a good bet.", "score": 1, "replies": [{"body": "Barnes & Noble Retail has not closed any stores and if a store closes it usually been to lease agreement issues.  \n\nBNED stores open and closed has had little fluctuation.\n\nEreaders have failed, the Nook is gone and the kindle is actually losing money for Amazon.", "score": 2, "replies": [{"body": ">Barnes & Noble Retail has not closed any stores and if a store closes it usually been to lease agreement issues\n\nlol so has it closed stores or not. I only had to google \"b&n stores closing\" to find a NYT article from 2019 saying over 150 stores have closed in the past decade...\n\n>Ereaders have failed\n\nNever said ereaders are popular, but I can tell you really want that to be the topic of conversation. They are largely unnecessary now because any smartphone or tablet can do the same thing. And people, esp. tech-savvy (and broke) college students know this.\n\nedit: in 30 years, books will be antiques", "score": 1, "replies": []}]}]}]}]}, {"body": "I looked at GOOD, not really sure what to make of them. Dividend looks solid, but they have no positive EPS since Q1 '19. Debt looks very high, but maybe that's normal for that type of business? Analysts sure seem to love them though.\n\nBNED is really hard to read. They're earnings are just all over the place, and negative 3 out of the 4 last quarters.\n\nTo me, both looked distressed, with good chance of short term upside.", "score": 1, "replies": []}, {"body": "I agree with you on DIS and HD. I am not so sure about the others. I see COST or WMT as better retail plays against Amazon. AMZN has cloud but I think MSFT is a better play. I would avoid oil until the economy is pretty close to being fully open... Probablly a good company but Probablly a few weeks to a month too soon if you don’t have a position already.", "score": 1, "replies": [{"body": "You want to sell oil when yheneconomy is open.  You want to buy it now.", "score": 1, "replies": []}]}, {"body": "Tesla has long term potential but I can’t imagine the share price rallying further when factoring reduced sales due to higher unemployment.\n\nIf I was out of work the last purchase I’d be making would be an expensive car.", "score": 1, "replies": []}, {"body": "Just buy Sony, they are making a ton shit of money with the lockdown and releasing the PS5 late in the year", "score": 1, "replies": []}, {"body": "Love me some tsla.  Did cut my holding 10% though.  Will buy more below $600 otherwise just good to have some cash in this market", "score": 1, "replies": []}, {"body": "Who are the big e-commerce companies using shop? I did a little research and it seemed to be small make up, lingerie and cannabis companies.", "score": 1, "replies": [{"body": "Just about every small online company you purchase products from are using it.", "score": 1, "replies": []}]}, {"body": "Never heard if shop.... amazon is that much more then online shopping. It provides infrastructure for like big share of the internet", "score": 1, "replies": []}, {"body": "I like Shopify. I knew their Q4 earnings would kill it and I didn't buy. I thought they'd do well in this environment and I didn't buy. I should still buy but always feel I'm late to the party.", "score": 1, "replies": [{"body": "Same. I just got in last Monday b/c I didn't know Cash App did stocks (despite their 📈 icon in the menu). I've made decent gains, but still feel too late.\n\nI used to think I was still too early when I got in due to the massive amount of bears here saying we're going to crash again.", "score": 2, "replies": [{"body": "I think they are a great company and it will do you well. I think too late is when you see the news talking about it and you hop in after a huge gain. I believe that with most stocks.\n\nI disagree with a lot of redditors. I think The risk of missing out is worse then the risk of losing equity value. This is because I have time for stocks to rebound", "score": 2, "replies": [{"body": "Before this notification, I was scrolling through a comment thread where they're panicking about these good prices being artificially inflated & we're gonna crash again.\n\nAlso, I meant I started in general. Etsy is what's doing the best for me. I bought Shopify today right before closing, anticipating a gap up.", "score": 1, "replies": []}]}]}]}, {"body": "TSLA - Great company (bought at 2019 lows and sold, bought at recent lows and sold), but priced for perfection. The powers that be seem like they want this thing to succeed, but too much downside potential for me. A BOD member, Tony Gracias, liquidated all of his 77,000 shares in February, FYI. Elon is due for an award which will dilute you a bit. I think the cars are pretty poorly made in terms finishing, but the tech and performance are unreal. If they execute on what they say (and they have to date) you're rich. Risk adjusted, I think there are much better opportunities out there, but owning Tesla is just cool regardless of stock price.\n\nDIS - Disney is a great brand and great business. I was a buyer a few weeks ago, but more as a “f it, this is oversold.” I think Disney+ on the other hand is overblown after using it. The interface sucks, the margins suck (currently negative), and the content gets old quick. The production costs of their content type are also relatively high. Lowering content costs (production quality) would hurt the brand, and a subscription model doesn’t justify big upfront investment in content. They pay Microsoft (or Amazon or Google) a ton of money, and that only will increase as competition in the space increases from Amazon, Apple, Netflix and others. I see their content portfolio as a competitive disadvantage 1) because it actually isn’t that vast, 2) because it’s relatively expensive, and 3) because the type of content isn’t that “addictive” for anyone but little kids which is a small segment of the market. Disney is a blockbuster type content producer which works well for feature films (which are essentially stand alone businesses), but not for subscription based content. A subscription model doesn’t justify the huge upfront expense of creating Disney quality content.\n\nDisney’s cash cows are parks and movies. Parks *might* be permanently impaired by changes in social norms due to this pandemic. Movies might be hurt similarly and by the mere existence of Disney+. “Why pay $17 to see ONE movie when I can wait for it to be available on Disney+?” Or “Why pay a subscription when their good content never gets released on it?” Iger is also gone (operationally) and he was a big part of why they’ve been successful over the past 20 years.\n\nNot saying they won’t continue to grow, but relative to other companies with more certain futures, I don’t see Disney as an obvious anything. Their balance sheet is also not amazing. It's fine.\n\nUSO - If the world changes in the way that everyone wants it to, why would oil be worth anything? Could go either way.\n\nBNED - Can only speculate as I don't know what their business model is at this point. All I've noticed is stores closing (which is probably good for them long term), but textbooks are overpriced. There's more pressure on tuition (and related) prices recently and I think that's a good thing. I don't like the idea of investing that are reliant on selling things for inflated prices (education materials) that are largely becoming available for cheaper or even free.", "score": 0, "replies": [{"body": ">The interface sucks, the margins suck (currently negative), and the content gets old quick.\n\nBut do most people feel this way? . Feel like if you're investing, best to leave personal opinions in the background. Reddit is a big bubble. \nAlso the margins were expected to be negative for a while and will likely be positive a lot sooner than expected. Remember they don't spend anywhere as much on content for D+ as Netflix does and they've gotten new subs a lot faster than expected. \n\n>They pay Microsoft (or Amazon or Google) a ton of money, and that only will increase as competition in the space increases from Amazon, Apple, Netflix and others.\n\nI'm confused about this. Disney + doesn't run on AWS or Azure or any of that. I assume this is what you're talking about when you say they'll have to pay. Correct me if I'm wrong.\n\nThey bought BAMtech ( and renamed it Disney streaming services) for exactly that. Most of D+ is in house as far as I know.\n\nAnd Iger is pretty much still in charge. He remained executive Chairman, retained creative control and retook some CEO operational duties. He never really left\n\nI just feel like some of this is more drenched in opinion than fact.", "score": 1, "replies": []}]}, {"body": "I don't necessarily agree with home depot, at over 200 it's let's say all time high and I don't see a sustained growth. Just my opinion :)", "score": 0, "replies": []}, {"body": "Not english speaking but I try to give my point anyway.\n\nI think Tesla is way overhyped as mentioned by many others. Their products are cool but there are major non adressed problems. (too expensive car prices, the most sells of Tesla cars go to NA and the market is expected to be fed, with the pandemic now the whole car market is unhealthy for all the cars producers, factory problems, still too heavy competition from fosil car makers - people seem still to prefer fosil cars). The biggest for me is that all the other producers just kinda startet to get into the e-car market so i see harder competition in this sector for the near future. Despite that Tesla has an market cap of 137B$ and never made 1 Dollare profit. There are companys like Volkswagen which are huge global players in the car market with a market cap of 67B$. Volkswagen makes over 10 times more revenue (25B$ to ca. 270B$ - roughly exchanged from Euro to dollar) and even profit and should be worth half of TSLA. That makes no sense to me.I am aware that the stock market is also about potential but there are a lot of IFs for Tesla and a good chunk of hope thinking. So too expensive to jump on but could be a good stock in the long run if they can adress their challenges.", "score": 0, "replies": []}]}
{"title": "Don't be fooled, most bear markets have a double bottom. We will hit the March lows again. 🌈🐻 SPY 5/15 250p", "selftext": "This current rally is false. Printer go brr and retail cucks with FOMO fueling it. Compare this year's [S&P 500 performance to 2008](https://imgur.com/vcoAYdG) and you'll see there was also a rally followed by the double bottom.\n\nA precondition for the bottom of any severe correction is that the VIX term structure returns to contango. [It's still in backwardation.](http://vixcentral.com/) Expected volatility in the future needs to be lower than expected volatility in the near-term. \n\nAlso in 2008, forward earnings first declined by 18% when the market tested its first bottom. By the time it hit the second bottom forward earnings were off by 36% from the peak. Current forward earnings are down 11% from the peak. Do you honestly think the autists on Wall St. have fully factored in the effect of the beer virus? Don't believe me? Go find an cuck with a FactSet/Bloomberg terminal to look this up.\n\nHold on to those puts. JPOW shot his load too quickly.", "id": "g35zn0", "created_utc": 1587143037.0, "score": 103, "upvote_ratio": 0.85, "num_comments": 72, "comments": [{"body": "All I know is I don’t know anything", "score": 143, "replies": [{"body": "~Socrates", "score": 44, "replies": [{"body": "We've gone full retard.", "score": 3, "replies": []}, {"body": "I drank what?", "score": 5, "replies": [{"body": "Corona", "score": 1, "replies": []}]}]}, {"body": "“Marge, remember when I took that home winemaking course and forgot how to drive?”", "score": 11, "replies": [{"body": "That's cause you were drunk!", "score": 3, "replies": []}]}, {"body": "All I know is that I ran out of money.", "score": 3, "replies": []}, {"body": "Needs to be the title of WSB.", "score": 2, "replies": [{"body": "Every time I make a logical decision I lose money. Every time I say “fuck it I’m just gonna send it” I make money then I lose money.", "score": 6, "replies": []}]}, {"body": "seriously what does the backward contagion of the COVID have to do with anything.", "score": 1, "replies": []}]}, {"body": "I buy calls every time this is posted. Works 100% of the time.", "score": 64, "replies": [{"body": "Thank us for the profits", "score": 3, "replies": []}]}, {"body": "All the economic indicators is showing that this virus is making the 1929 great depression look like disneyland. But that doesn't matter, as long as Jpow keeps the printer going, president cheeto lying to his teeth about the virus numbers improving and Company X of the week proclaiming a breakthrough in vaccine/cure/etc.", "score": 88, "replies": [{"body": "Unfortunately, Pow has to turn off the printer temporarily at some point. Risks overheating. I don't know if we retest the lows but I doubt we are going to see 3k anytime soon.", "score": 20, "replies": [{"body": "They already did slow down the printer, not much junk bonds bought at all and total fed balance expansion halved from the first burst.\n\n[https://wolfstreet.com/2020/04/17/fed-massively-tapered-qe-4-hasnt-bought-any-junk-bonds-yet-was-just-jawboning/](https://wolfstreet.com/2020/04/17/fed-massively-tapered-qe-4-hasnt-bought-any-junk-bonds-yet-was-just-jawboning/)\n\n  \n\n* $356 billion (Mar 18, partial bailout week started Mar 16)\n* $586 billion (Mar 25)\n* $557 billion (Apr 1)\n* $272 billion (Apr 8)\n* $285 billion (Apr 15)", "score": 24, "replies": [{"body": "Exactly, I was looking for this on the fed reserve page. Thanks for posting. I still don't think we see a massive drop till late 2020 once we realize the job market will have to sustain 10%+ unemployment for the next few years.", "score": 9, "replies": []}]}, {"body": "I don't know. Does he really have to turn off the printers? I don't think Trump would let him until after the election.", "score": 5, "replies": [{"body": "Bad optics in the short term imo. Imagine if NDX hits ATH while we have 20% unemployment and multiple cities have lines outside food banks. The dems will eat that shit up.", "score": 8, "replies": [{"body": "Yeah, the optics can change from savior of the economy to Scrooge McDuck really quickly.", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 40, "replies": [{"body": "where’s Buffett.", "score": 12, "replies": [{"body": "Working at DQ.", "score": 19, "replies": []}]}]}]}, {"body": "Cash gang waiting for the next retest. Trying to time the top is harder than timing the bottom.", "score": 15, "replies": [{"body": "Unlike with real gay bears, market bottoms are very rare. Opportunity for new tops everyday.", "score": 4, "replies": []}]}, {"body": "If that put prints I will suck you off", "score": 10, "replies": [{"body": "Me too, seconded the suck off", "score": 1, "replies": []}]}, {"body": "I'm longing $SPY but to be honest, part of me wants the market to tank. I don't know why, maybe because this rally feels wrong....or I learned to like pain. 🤷🏻‍♂️", "score": 12, "replies": []}, {"body": "Most bear markets don't have a JPow though.", "score": 29, "replies": []}, {"body": "Yeah but in 2008 didn’t it take forever for them to secure QE? And now we instantly got unlimited QE?", "score": 18, "replies": []}, {"body": "“Double bottom just sounds like another buying opportunity” - A raging Bull. Who knows nothing.", "score": 7, "replies": []}, {"body": "Fed has never taken this much action either.", "score": 8, "replies": []}, {"body": "Finallyyy a brother in arms! I've been searching for bears whole fucking week! Brave autistic fuck you made me cry!\n\nDon't have to read the post, I'm in! Same gay position.", "score": 3, "replies": []}, {"body": "\"Don't be fooled, most bear markets have a double bottom. We will hit the March lows again. 🌈🐻 SPY 4/17 200p\" - here a month ago just about", "score": 4, "replies": []}, {"body": "[deleted]", "score": 12, "replies": []}, {"body": ">Hold on to those puts. \n\nI'm holding till EOD. Then I can't anymore.", "score": 3, "replies": []}, {"body": "Most bear markets don't shoot down 40% in a month", "score": 3, "replies": [{"body": "and neither did this one", "score": 3, "replies": []}]}, {"body": "Just my two cents but max pain would burn the SPY 300C and the SPY 250P for 5/15. SPY 260 seems appropriate for 5/15  \n\n\nPositions:  \n5/22 SPY 230p", "score": 2, "replies": []}, {"body": "JPow has unlimited loads to blow.  🍆💦🌈🐻", "score": 2, "replies": []}, {"body": "I’m all out of money... will give handies for puts", "score": 2, "replies": []}, {"body": "RemindMe! 1 month", "score": 2, "replies": [{"body": "I will be messaging you in 1 month on [**2020-05-17 21:17:21 UTC**](http://www.wolframalpha.com/input/?i=2020-05-17%2021:17:21%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/g35zn0/dont_be_fooled_most_bear_markets_have_a_double/fnq5tv0/?context=3)\n\n[**3 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fg35zn0%2Fdont_be_fooled_most_bear_markets_have_a_double%2Ffnq5tv0%2F%5D%0A%0ARemindMe%21%202020-05-17%2021%3A17%3A21%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20g35zn0)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Technical Analysis is like astrology for the stock market. We need some quantitative analysis.", "score": 2, "replies": []}, {"body": "Feel free to buy puts. You ignore difference in fed intervention between now and 2008 on short term liquidity.", "score": 2, "replies": []}, {"body": "Like last week: we had terrible jobdata. 1 minute later JPow was already shooting lazerbeams with a new stimulus package. He ll keep doing that, it s his job or he s fired.", "score": 2, "replies": []}, {"body": "Breh I swear I've read this exact post every week for three weeks 🤣", "score": 2, "replies": []}, {"body": "Why do I see this type of gay post everyday?", "score": 2, "replies": []}, {"body": "Another gay bear losing money with his shorts. This is getting old. Time to switch teams; S&P has blown past 50% retracement and Remdesivir to the rescue!!", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "everyone seems to be just pissing all their money away on puts with zero indication that it wants to go down- just blindly hoping that is what it will do next. And it’s pretty much done the opposite for almost 3 weeks straight.  I’m shocked. Total opposite of what this sub was like 2 months ago. Yes the trades were dank but at least they went with the trend.", "score": 1, "replies": []}, {"body": "Yeah this time your right bro.", "score": 1, "replies": []}, {"body": "You have to see the positive: once this whole thing is over, we have one more crisis we can compare the next crisis with. We can say it’s just like 2008. Ah no, more like 2020, or maybe 1929. Or maybe entirely different.", "score": 1, "replies": []}, {"body": "It doesn't matter if it doesn't happen all at once. This wasn't a crash, it was a bear trap", "score": 1, "replies": []}, {"body": "I’ll do you one better, 230 5/1 p", "score": 1, "replies": []}, {"body": "I bought SPY 5/15 250p at $20.66 and sold at $3.54.\n\nIf you bought my shit, godspeed. I took the beating so you don't have to.", "score": 1, "replies": []}, {"body": "Your a double bottom.", "score": 1, "replies": []}, {"body": "I don't know if this is comforting or frustrating", "score": 1, "replies": []}, {"body": "Don’t fight the Fed with unlimited printing", "score": 1, "replies": []}, {"body": "Remember to post this again in a week.", "score": 1, "replies": []}, {"body": "All the salty bulls scared shitless because you didn’t buy. This is nothing similar to 2008", "score": 1, "replies": [{"body": "Bears?", "score": 6, "replies": [{"body": "Damn yes my bad", "score": 3, "replies": []}]}]}, {"body": "This isn’t 2008. Thanks for your contributions.", "score": -4, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "I would. Times were unpredictable but I could also leave the house for a beer. Not now...", "score": 3, "replies": []}, {"body": "Can’t even go walk around pottery barn or William Sonoma. What’s the world coming to?", "score": 1, "replies": [{"body": "Right? That's where I want to be at the most more than anything in the world.", "score": 2, "replies": []}]}]}, {"body": "No shit. It's like 10x worse, but with a sliver of hope some cure or vaccine materializes in like a month.", "score": 3, "replies": [{"body": "I didn’t say it was better. But it’s not 2008.", "score": 4, "replies": [{"body": "And I agreed with you. That is what \"No shit\" means.", "score": 4, "replies": [{"body": "And I agreed with you. That is what \"I agreed with you\" means.", "score": 0, "replies": []}]}]}]}]}, {"body": "  These kind of predictions wind up in the dustbin of bs calls than never happen\n\n&#x200B;\n\n  If you were smart enough to  be respected, you wouldn't be here on this stream of fools.", "score": 0, "replies": []}]}
{"title": "GILD Puts help", "selftext": "Hey everyone, I am not buying into this GILD pump and want to get some puts. I’m thinking of about $3k worth of puts but having trouble deciding which strike and expiration. Any recommendations of what will profit me the most considering the stock goes goes down? Opinions? Or should I just go and get Netflix or amazon calls?", "id": "g38ned", "created_utc": 1587151474.0, "score": 3, "upvote_ratio": 0.55, "num_comments": 72, "comments": [{"body": "Nobody tell him\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 52, "replies": [{"body": "Good bot", "score": 13, "replies": []}]}, {"body": "put it all in GIL", "score": 33, "replies": [{"body": "I bought puts and already up 9% :):)", "score": 5, "replies": [{"body": "I bought puts and I'm down 10%", "score": 3, "replies": [{"body": "i bought $GILD calls earlier this week and i'm up 141%", "score": 2, "replies": [{"body": "I'd sell soon", "score": 1, "replies": []}]}]}]}, {"body": "Can’t tell if you are being sarcastic or not bc I know that GIl spiked today and I don’t really know why unless some confused the two but how can someone be so dumb lol", "score": 3, "replies": [{"body": "It happened with $ZOOM and $ZM a couple weeks ago (ZM is the video conferencing app, the other just has a similar name). I honestly think most investors are more retarded than this sub, which is fucking saying something.", "score": 12, "replies": [{"body": "SPCE too.\n\nhttps://www.cnbc.com/2020/04/14/virgin-galactic-stock-spce-jumping-but-some-might-be-trading-the-wrong-company.html", "score": 3, "replies": []}]}, {"body": "Puts on dumb people. Literally can't go tits up.", "score": 3, "replies": [{"body": "Inverse this for tendies", "score": 1, "replies": [{"body": "So, $SPY 300c 5/15?", "score": 1, "replies": []}]}]}, {"body": "I think it was because people are dumb, look what happened with SPCE the other day. And our elected officials. People are that stupid.", "score": 4, "replies": []}]}, {"body": "This is actually smart. Puts locked in thx.", "score": 1, "replies": []}, {"body": "Op wants the D though", "score": 1, "replies": []}]}, {"body": "5-1 $75P", "score": 29, "replies": [{"body": "This is what I have. Up arrowed", "score": 12, "replies": [{"body": "Same here. Long live GILD puts", "score": 4, "replies": []}, {"body": "You Stupid fuckers are supposed to ride it up with calls AND THEN short the shit out of it. I’m afraid you all are a little too early w your positions \n\n5/15 $65p $GILD", "score": 1, "replies": []}]}, {"body": "75p gang\n\n5/15 75p", "score": 2, "replies": []}]}, {"body": "Shortest expiry and lowest strike will profit you the most", "score": 15, "replies": [{"body": "Or lose the most.", "score": 3, "replies": [{"body": "Nonono you never lose with this strat :)", "score": 3, "replies": [{"body": "How", "score": 1, "replies": [{"body": "It’s a joke", "score": 1, "replies": []}]}]}]}]}, {"body": "If i was a gambler I'd buy long calls (less of a gamble) and puts for the next ~month.\n\nI'd stay away tbh, people don't understand how to read clinical trial data or studies for that matter. It's going to be hyped for a while even if the data doesn't support it.", "score": 7, "replies": [{"body": "But if this new drug isn't working it won't take long for people to realize it", "score": 2, "replies": [{"body": "That is not how science works, you prove a drug has effect not the other way around. It's way too early to tell if this drug will be effective, this 2nd hand information (I wouldn't even call it data) from 1 trial location should be taken with a massive grain of salt.", "score": 5, "replies": [{"body": "this is true. but remdesivir will be beaten once the official vaccine comes out. when will it come out? who knows? but once it does, gilean is going to shit, at least <$65. i find this investment similar to investing in airline businesses where it relies so much on guessing what date the lockdown will be lifted.\n\nputs or calls on this is a no for me.", "score": 1, "replies": [{"body": "There is a flu vaccine. Tamiflu still earns a billion in revenue. Now imagine the flu was 10 times more deadly and the flu vaccine didnt exist. Now also imagine instead of reducing the sickness from 7 days to 5 days, Tamiflu actually changed it from death to recovery with lung damage in 25% cases..\n\nHow much would Tamiflu be worth?\n\nAnd oh BTW GILD makes Tamiflu too", "score": 1, "replies": []}]}]}]}]}, {"body": "To be honest I'd rather wait for the next pump on trial results. GILD PUMPED on completely garbage yesterday afternoon - I'm not gambling the market won't be stupid and will pump on meh trial results.", "score": 7, "replies": []}, {"body": "GILD 70p 5/15 had a volume of 11,000 right before the market closed. Should be a safe bet", "score": 4, "replies": [{"body": "Also saw on bar charts someone bought large volume of  70ish puts 4/24", "score": 4, "replies": []}]}, {"body": "Not doing that should win you money,", "score": 4, "replies": []}, {"body": "$75p 5/1", "score": 4, "replies": []}, {"body": "Be as close to in the money as possible. Don’t go crazy. Stock was steady in the $70’s so keep that in mind.", "score": 3, "replies": [{"body": "If it turns out it was fake news, would probably drop significantly. Keep my eye on this, see if it pumps into Wednesday", "score": 2, "replies": [{"body": "why Wed?", "score": 1, "replies": [{"body": "It seems like when these stocks get pumped it happens for a couple days. It may not and puts will get more expensive. If this is up Monday and Tuesday and it opens up Wednesday I'll probably buy puts then. If I missed the boat I missed the boat", "score": 8, "replies": [{"body": "👆that", "score": 1, "replies": []}]}]}]}, {"body": "That’s what I was thinking which is why I was thinking $80p 4/24 but think that is to short of a time frame so will probably do $80pm 5/1. What u think?", "score": 1, "replies": [{"body": "Always give yourself room. I never have luck with short term trades. Just personal preference but I like to give myself minimum or 2-3 weeks depending on the market environment", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I did $80p 5/1. May we both print!", "score": 5, "replies": [{"body": "5/15 $78 checking in!", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm chillin with 4/24 $80 PUTS and 4/24 $75 PUTS only 2 of each cuz I'm broke af. My total loss is 6k since 2018. Why I still do this? No fucking clue.", "score": 5, "replies": []}, {"body": "Month plus down the road, $10-$15 dollars under the current share price", "score": 4, "replies": []}, {"body": "Strike and expiration", "score": 2, "replies": []}, {"body": "6/19 $70 - 08/21 $60", "score": 2, "replies": []}, {"body": "$SPY calls. That's all.", "score": 2, "replies": []}, {"body": "Yeah I'm also trying to find a good chain option to short this rally. Easy money. I'm looking at July puts perhaps in the $65-70 range. Premiums are a little up there if you ask me though. Maybe I'll wait a till next week for better deals.", "score": 1, "replies": [{"body": "To be fair, the news of the bullshit is breaking now.  Any significant dips should be expected in the next few days, not weeks.", "score": 2, "replies": [{"body": "I figured it will take at least a month for a drop if the drug falls thru or any bad news come out about it\n\nEDIT: Did you pull the trigger on anything", "score": 1, "replies": []}]}]}, {"body": "little late, but ATM 4/24p should still print", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I bought in at open today, closed 30 minutes late for a quick 50% profit. Gilead doesn't really move too much intraday besides at open. Maybe it will gap down over the weekend", "score": 1, "replies": []}]}]}, {"body": "RIP GILD puts", "score": 1, "replies": []}, {"body": "if you put it in, you  prob got wrecked eod today lol", "score": 1, "replies": [{"body": "I went in at 3:57pm, so it just allowed me to get more lol", "score": 1, "replies": [{"body": "Same. Bought puts at the top of that last pump.\n\n$67.5 5/15", "score": 2, "replies": []}]}]}, {"body": "Yea I’m surprised as well. It was relatively flat throughout the day. Maybe just some mms feeling optimistic of weekend news?", "score": 1, "replies": []}, {"body": "5/15 82.5p", "score": 1, "replies": []}, {"body": "I got a couple $50 dollar puts for next month. If it drops it'll dump, if it doesnt well the puts were like 7 bucks each.", "score": 1, "replies": []}, {"body": "My puts for next week expire on the 24th, I feel like im going to get fucked", "score": 1, "replies": []}, {"body": "GILD is either overbought or oversold, ignore it. I wouldn't buy in at anything less than 70$ per share.", "score": 1, "replies": []}, {"body": "I have GILD 4/24 calls, $85, $90, $100.\n\nExpecting it to moon on Monday from NIH.gov news today about positive test results in vitro and in monkeys.\n\nGoing to dump everything by Tuesday and never look back.\n\nI also have AMC $2.50p 4/24.\n\nEither GILD has good news about a cure and it moons, thus these calls makes money. Or bad news about cure and AMC retraces the 30% gains from today and those puts make money.\n\nLiterally can't go tits up.", "score": 1, "replies": [{"body": "literally going tits up", "score": 2, "replies": []}]}, {"body": "Ok .. everyone or most are buying PUTZ on Gild so guess what.. I’m buying Callz... everyone already knows the result when all WSB is going one way...", "score": 1, "replies": []}, {"body": "Lol good luck!! You are retarded.", "score": 0, "replies": []}, {"body": "Good luck moron!", "score": 0, "replies": []}, {"body": "If they actually have a way to treat COVID like they say then your puts are fucked. Find something that’s actually not doing well/ has no good news coming (not that that seems to matter)\n\nGILD 110c 6/19", "score": -4, "replies": [{"body": "Bruh 110 seems fucking retarded", "score": 2, "replies": []}, {"body": "Problem is the drug boils your organs", "score": 2, "replies": []}]}]}
