{"title": "SPY Option Hypothesis - Continuation", "selftext": "After seeing the original post by  [u/Xmata96](https://www.reddit.com/user/Xmata96/), it got me thinking how exactly I could optimize the theory outlined using options. If you haven't seen the post and aren't familiar, check it out here: [Original post by Xmata96](https://www.reddit.com/r/wallstreetbets/comments/g5vdak/how_to_make_money_on_spy_options_every_time_prove/)\n\nUsing his hypothesis, I decided to set up an analysis that would take a look at option prices at the exact minute the 0.75% limit was reached, on days his criteria was successfully met. To do this, I used ToS to check historical option price movement on the targeted days. Note, as stated in his criteria, VIX has to be above 30 for the theory to hold true. The last time VIX stayed above 30 for an extended period prior to the last few weeks was in 2011 and since ToS doesn't appear to show data back that far, the analysis I have completed has limited data points. In total 15 cases were analyzed. However, given the successful results I obtained, paired with his thorough analysis I have confidence this will work moving forward.\n\nNow to dig into what all I examined. I started off by looking at the closest ITM option at the exact minute SPY hit the 0.75% threshold. After determining the strike price to focus on for the given date, I pulled up the option price movement for that day and found the high price of the option at the same minute (note, I used the high price to be conservative - in many instances there were far lower prices that hit during that minute time frame). Using the cost of the option, I calculated a stop loss value at 25%, 50%, and 75% in addition to take profit values at 130%, 160%, 200%, and 300%. My goal was to determine which, if any, stop loss would be most beneficial and determine at what point taking profits would allow for the most success in the long run.\n\nI then repeated the outlined process above, for options that were OTM by $1-$5 in $1 increments since I had a hunch these would be more profitable and definitely have an lower initial cost. This turned out to be true.\n\nYou may be thinking at this point, who cares? Just show me the tendies! Here's the optimal options strategy I determined, if options are purchased o/a the minute the criteria is met:\n\n* The best option to purchase is 3 strikes OTM from the 0.75% target price.\n* Nearest expiration date option is recommended for max profit since it won't be held overnight.\n* Set a stop loss at 75% - if the option price hits a 75% loss it is almost guaranteed to not recover, so no use losing everything.\n* Ideally, when SPY hits the 0.75% threshold the RSI should be between 27.5 and 72.5. I have found when the RSI is more overbought/oversold, the probability of success is much lower. I don't have any hard proof of why this is the case other than the hypothesis that the momentum for the day will clearly just be in one direction if there is that significant level of buying/selling.\n* Take profit when the option reaches a profit of 160%. The probability of success is much lower when reaching for 200%+ profits. However, a strategy could be incorporated to sell the majority of options at 160% and allow a few \"runners\". In the study I have seen options reach 900% profit, just not often.\n* On days the criteria was met, results were more successful when option contract prices were under $3.50. Just note, opportunities for incorporating this method will be more limited if that is followed.\n* The success rate I found with the limited data points I had was \\~75% if the $3.50 option price criteria was omitted and \\~90% if the criteria was followed.\n* Lastly, DO NOT risk everything on any given day or you will end up losing it all eventually.\n\n**TLDR; Read** [**u/Xmata96**](https://www.reddit.com/user/Xmata96/) **post. Purchase 3 strikes OTM options on days that meet his criteria. Sell at 160% profit. Set stop loss at 75% loss.**\n\nIf anyone wants the Excel data file, just let me know and I'll provide it. Additionally, if anyone has access to option prices from 2008-2012 and wants to further examine the theory using the guidelines I mentioned, please do.\n\n[Example Excel Spreadsheet Used](https://imgur.com/a/oqErCjD)\n\nI'll continue to track the results daily and will be following the guidelines given. Best of luck!\n\n**EDIT (4/27):**  Since I've noticed some confusion regarding some of Xmata96's guidelines, I'm posting a few of the nuances here for visibility:\n\n* The 0.2% threshold has since been revised to 0.18%.\n* If SPY reaches the 0.18% threshold in one direction and proceeds to cross over the opening day price prior to hitting the 0.75% threshold, it is a no day trade, even if it doesn't cross the opposing 0.18% threshold. The key there is the opening price point cross over, which is one of the keys of his study.\n* It is recommended not to take any trades occurring after 12pm EST.\n* Lastly, my studies were done using 1m charts, with the exception of Feb. 28 since I couldn't obtain that resolution for option prices.\n\n[VISUAL EXAMPLE OF A TRADE DAY - 4/23](https://imgur.com/a/8doAcsc)\n\n[VISUAL EXAMPLE OF NO TRADE DAY - 4/28](https://imgur.com/a/SM8MKw8)\n\nFirst tradable day (5/5) since this was posted was a success, congrats if you took it.\n\n**Successful Days Since Post:**\n* 5/5, 5/6\n\n**Unsuccessful Days Since Post:**", "id": "g88dmt", "created_utc": 1587876713.0, "score": 187, "upvote_ratio": 0.95, "num_comments": 107, "comments": [{"body": "Thanks for the additional analysis. Xmata96 found some really cool info and your contribution was neat too", "score": 47, "replies": []}, {"body": "Now we just need someone to script all of this for TOS.", "score": 34, "replies": [{"body": "That’s definitely out of my area of expertise, but would be awesome if someone were to do so", "score": 14, "replies": [{"body": "So another questions that remains to me is what is the window of action at open we should be acting on? Is it up to 30 min, 60 min, more?", "score": 1, "replies": [{"body": "I believe [u/Xmata96](https://www.reddit.com/u/Xmata96/) suggested the window should end no later than 12pm EST, so that is what I'm following for the time being until I have more data to suggest an alternative time.", "score": 3, "replies": [{"body": "Thanks, been looking for that answer for a while.\n\nToday is another example where it goes super close to the target level, but turned around just before triggering it. It when over later on, but much after the \"opening window\".\n\nhttps://imgur.com/a/ysK4ye5", "score": 3, "replies": [{"body": "First play today. Excited. Did you pull the trigger?", "score": 1, "replies": [{"body": "I did!\n\nSpy 288c april29\nPaid 2.21 10h53 am EST (spy was at 287.45)\n\nSpy opened at 291.02 so 0.75% target was 288.84.\nKept going down to ~286. Didn't reload as it wasn't looking good (very low fate that we would retrace today). Time will tell.\n\nhttps://imgur.com/a/DFtMYf2\n\nSelling at 130% (2.87)\nMight let it ride to 160% (3.5) if I see the market is on a strong retrace.\n\nBut overall not looking to good for me.so far unless we rally at the close.\n\n*============*\n\nEdit: well that's was a fail. Never crossed back. Loss 14k\n\nhttps://imgur.com/a/ARrxein\n\nLooking back at the spreadsheet maybe today wasn't a trading day.\nSpy open at 291, and went down to 290.38, then moved up 291.11\n\nSo instructions says it's noise below 0.18%, don't trade if between 0.18 and 0.75 as any reversal in that window my be the top/low of the day. Trade only if it straight drop/rise beyond 0.75%\n\n-Open 291\n-Noise: 291 to 290.48\n-No trade: 290.48 to 288.82\n-Trade: if straight down to 288.82 and lower.\n\nBut today you can see at 9h38 with it 290.38, and reverse up to 291.11 at 9h46.\n\nSo we were in the No trade for the day window of 0.18% to 0.75%\nTherefore I missed read this play out of the gate.", "score": 2, "replies": [{"body": "What do you trade on and is there a better option for smaller investors?", "score": 1, "replies": [{"body": "I trade on TOS", "score": 1, "replies": [{"body": "Xmata deleted his account. Lol.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "((bid() is greater than (open() \\* 1.0075)) or (bid() is less than (open() \\* 0.9925))) and (open(\"VIX\") is greater than 30);\n\nThrow that in as an alert that is activated when this study is true. I don't know if this works yet for sure, but it looks alright.\n\nI unfortunately couldn't get the bid of VIX because bid and ask functions only allow you to get the current ticket that the alert is applied to, so I had to get the open of VIX instead. Be careful with this, of course, as VIX can decay through the day quite a lot, as it did on Friday.\n\nOf course, also use your own discretion when hearing the alarm because from my understanding, this technique is only intended to be used during the early market hours, just about before 12 noon EST. I could have added a check for that but I was too lazy.", "score": 5, "replies": [{"body": "That's pretty good, but when using that, you'd want to manually check for reversals. That was one of the parameters of the original post, and stopped u/Xmata96 from trading on 4/21.", "score": 3, "replies": []}]}, {"body": "What language does TOS support for it's macros?", "score": 1, "replies": []}]}, {"body": "Your sample size is same as Mesoblast's.", "score": 19, "replies": [{"body": "Yeah I know, but the results follow the trend of the original analysis of just following SPY price movement, which has a significantly higher sample size. Worth continuing to track or back test further if someone has access to that data imo", "score": 9, "replies": [{"body": "Shoot, you can backtest that into the Stone Age with a free Thinkorswim account.  It’s just tedious.  Figure out your price points, scan through the day’s data and see if it hits, move to that time - in real-time - and make your order.  Look at the chart for the equity and guess the high point for the option.  See if it sells.  Ignore what it sold for because you would’ve sold it earlier at your limit.  If it doesn’t sell see what happens to your nest egg.\n\nIt takes me about five minutes to backtest this strategy on a day, if I hurry.  It took me a significant amount of time to figure out how to do it in the first place.", "score": 7, "replies": []}]}]}, {"body": "I don’t know all of the dates, but the 75% stop loss is pointless.  It recovers every single time in your dataset if you diamond hand it.  The market has a significant tendency towards reversion on large swings right now.  I haven’t looked into it beyond these two, but at least 2/4 of your 75% stop losses are failures and you’d be much better off to diamond hands the option.  Mar 26 gaps significantly downward overnight and April 13 swings back strongly late in the day.  You’d recover many of your losses on the Mar 26 of you diamond hand until the morning.  You’d make a small profit if you diamond hand to the end of the day.\n\nEdit: I glanced at the other two.  Mar 23rd you wouldn’t be able to sell for as little as 1.3% if you diamond handsed that loss overnight.  April 17 crosses the opening line after the 75% stop loss.  Probably not a profit but better than a 75% loss.  So in all four cases diamond hands beats the stop loss.  Mean reversion is powerful unless you’re expiring now.\n\nThe 0.2% rule was specifically set because the original version was a dollar amount that would’ve prevented a wipeout day trade on March 26.  It was like a penny less.  Then he moved to percentages and rounded and the rounding error messed it up enough that you would make the trade on March 26.  The whole thing is fucking stupid, it’s a number that was achieved in the madness of the first couple seconds of trading off the opening bell.  And it was applied because it makes the strategy “always works so far”.\n\nThe trading theory is that SPY very consistently crosses over the opening line sometime after open.  That’s what makes this trade work.  But it doesn’t always.  Sometimes, like March 26th it really just goes one way.  Xmata wanted a strategy that always worked so he set the limit just below the opening volatility of that day that would otherwise end disastrously.  And then the rounding error made that day a “buy”.  It’s silly, it doesn’t provide any actual protection against a repeat of that.  It’s a bullshit number to avoid the one genuine disaster in a very limited dataset.\n\nBut it does bad things: it doesn’t provide any real protection against a March 26th style day where you eat pigeon shit.  The limited dataset does not establish that .2% is the lower bound, in fact it’s .19% given that Xmata said successfully said fuckit on Friday.\n\nI suspect we can adjust the 0.2% number upwards significantly with no appreciable affect on actual risk.  This provides more trading days to take profit against the days that we will lose and that’s crucially important.\n\nAlso, is your 1.6x profit target actually backtested such that calls will sell?", "score": 14, "replies": [{"body": "So update the lower limit to .18% lol problem solved", "score": 3, "replies": []}, {"body": "[ERROR?!?](https://alienmelon.itch.io/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -6, "replies": []}, {"body": "The options aren’t held overnight so time decay isn’t a problem. The market doesn’t actually have that many reverses, maybe 1 or 2 times a week but you shouldn’t trade on days when it reverses because is shows uncertainty in that days market", "score": -2, "replies": [{"body": "This entire strategy is based on the tendency of the market to reverse across the open line during trading hours.  If that doesn’t happen you lose your entire investment.  So if it only happens 1-2x a week we’re fucked!  Also time decay definitely affects options held intraday, especially the NTE options the strategy calls for.  You should check out the overnight gapping too.  So far this month 11/15 have been a reversal of the day’s sign and most massively.", "score": 7, "replies": [{"body": "What, I was saying that a day that you can’t use the strategy only happens 1 or rarely 2 times a week not that the strategy only works 1 or 2 times a week.\nSo it works 3 to 4 times a week and you know when it’s going to work and when it’s not so if it’s not going to work on that day then you wouldn’t trade on that day", "score": 3, "replies": []}]}]}]}, {"body": "TOS script almost complete for this hypothesis, will see what happens when backtesting", "score": 13, "replies": [{"body": "That was quick. Was planning on sitting down later tonight to work on this. Do you plan on sharing backtest results?", "score": 3, "replies": []}, {"body": "Did you end up completing the script?", "score": 2, "replies": [{"body": "yes the strategy is okay on higher volatility days, the script is very rough but plots the thresholds and determines whether the day was profitable. its a decent base strategy, but with some additional constraints it may actually be a decent day trade model.. might work on it some more this weekend and share", "score": 3, "replies": [{"body": "Fak yea", "score": 1, "replies": []}, {"body": "Please tag me if you do. Cheers.", "score": 1, "replies": []}]}]}]}, {"body": "This is actually really interesting, so you recommend selling at 160% instead of 130% like the original OP? \n\nPart 3: can someone write an algorithm for this and share it with WSB? Then we can go tell hedge funds to go fuck themselves, CNBC will come crawling to us for interviews, etc.", "score": 27, "replies": [{"body": "Read the comments in the original post. There are a lot of reasons to be skeptical of this strategy.", "score": 14, "replies": [{"body": "Why, I’ve made profit on all days that the conditions are met", "score": 9, "replies": []}]}, {"body": "Yep, ROI is better so far. Hoping to further confirm this in the coming weeks", "score": 8, "replies": []}]}, {"body": "this guy really thought we’d read this", "score": 68, "replies": [{"body": "Bullet points. 7 words or less per bullet.", "score": 17, "replies": [{"body": "6 letter or less per word", "score": 6, "replies": []}]}, {"body": "This mfer called the “ask price” the “high price”. \n\nThis shit should be on investing or something. Wtf would you want everyone from wsb to know a lucrative scheme. Quickest way to get it shut down.", "score": 2, "replies": []}]}, {"body": "tldr: zero sum game. Risking it all can make you rich or lose everything.", "score": 9, "replies": [{"body": "He did not say risk everything , your loss is max 75% .160 % win. \nEven if your chance of win is 50% . You are making some .", "score": 7, "replies": []}]}, {"body": "Do not risk everything you have in a given day? Did you post this in the wrong sub?", "score": 17, "replies": []}, {"body": "Pretty nice seeing retards come together to provide valuable research and present it here for all of us to skim to the tldr", "score": 13, "replies": [{"body": "\"... for all of us to jump to the comments so someone can explain the tldr.\"\nFixed it.", "score": 1, "replies": []}]}, {"body": "Did you manually backtest the data?", "score": 6, "replies": [{"body": "Unfortunately, couldn’t find any free historical data", "score": 5, "replies": [{"body": "What a legend. If you can find free data I can code something up", "score": 6, "replies": []}, {"body": "I believe Yahoo finance has historical prices for individual days. \n\nNever mind, [this link looks promising](https://www.quantshare.com/sa-636-6-new-ways-to-download-free-intraday-data-for-the-us-stock-market)", "score": 0, "replies": [{"body": "We need prices from 2008 to 2011", "score": 2, "replies": []}]}]}]}, {"body": "If anyone's interested, i wrote a basic script for tradingview to show the 0.18, 0.2 and 0.75 lines based on the opening price per day, just plop it into the pine editor window and run it.  Makes it a lot easier to see  every morning if its a trade day or not.\n\nstudy(\"scalper\", overlay=true) odl = input(true, title=\"Open Daily Line\") dopen = security(tickerid, 'D', open) dcolor = close < dopen ? red : green dcolort = close > dopen*1.0018 ? #0dff00 : orange dcolorb = close < (dopen-(dopen*0.0018)) ? #0dff00 : #fc03a1\n\nplot(odl and dopen ? dopen :na , title=\"Daily\\_Open\",style=circles, color=dcolor, linewidth=2)\n\nplot(dopen-(dopen*0.0018), title=\"Daily\\_Open\",style=line, color=dcolorb, linewidth=3) plot(dopen*1.0018, title=\"Daily\\_Open\",style=line, color=dcolort, linewidth=3) plot(dopen-(dopen*0.0020), title=\"Daily\\_Open\",style=line, color=color(#fc03a1,80), linewidth=3) plot(dopen*1.0020, title=\"Daily\\_Open\",style=line, color=color(orange,80), linewidth=3)\n\nplot(dopen*1.0075, title=\"Daily\\_Open\",style=line, color=#0398fc, linewidth=2) plot(dopen-(dopen*0.0075), title=\"Daily\\_Open\",style=line, color=#00d17d, linewidth=2)", "score": 4, "replies": [{"body": "Doesn't seem like it's working", "score": 1, "replies": []}]}, {"body": "This is the way", "score": 3, "replies": [{"body": "Ban", "score": -1, "replies": []}]}, {"body": "Very good post, well done", "score": 4, "replies": []}, {"body": "A couple thoughts: \n\nI looked at this and I think the 3 strikes is true because that brings you to the closest value to your sell price when crossing the opening line. For example, if SPY moves 1% down from opening from 280 to 277.2, then a 281 call is the closest strike back to the 280 opening. It makes sense that this is the best value given that options are optimized for expiration around their strike values.\n\nI haven't looked yet, but I was thinking there may be a way to hedge in situations where they'd be losing days by doubling down on the same day. For example, if you buy your first call at 1% down and it keeps moving down, maybe you can buy a 2nd call at 2% down and catch some upswing even if it doesn't cross the opening again. That way, maybe you'd break even or worst at least hedge against a full loss. Still gotta review that more though.", "score": 3, "replies": []}, {"body": "Send that sheet my way plz", "score": 3, "replies": []}, {"body": "i think you are ovefitting", "score": 2, "replies": [{"body": "Explain", "score": 1, "replies": []}]}, {"body": "Great post! I can script and backtest this but not sure which platform offers option historical data for free.", "score": 2, "replies": [{"body": "ThinkorSwim has historical data (however for options in the GUI I only saw back until 2017). It’s beyond my skillset to extract the data from the GUI beyond manual means, however.", "score": 2, "replies": []}]}, {"body": "Id like the excel doc!!!", "score": 2, "replies": []}, {"body": "Does ToS give you minute-by-minute historical options data?  Including bid/ask?", "score": 2, "replies": [{"body": "It does, but it appears it only goes so far back. All of March/April was fine loading 1m data for options and SPY. \n\nFor me at least, when I try going back to Feb. I can only load the 5min data and when trying to go back to 2011 I can’t get data beyond 1 day limits to load. I have a feeling they have data deleted after x amount of time.", "score": 2, "replies": [{"body": "That's great that they offer that, ETrade doesn't offer that.  Options data is hard to come by.", "score": 1, "replies": []}]}]}, {"body": ">\tIdeally, when SPY hits the 0.75% threshold the RSI should be between 27.5 and 72.5.\n\nOn which chart? 1min? 5? 15?", "score": 2, "replies": [{"body": "1m. All the analysis I did was based upon the 1m chart", "score": 3, "replies": []}]}, {"body": "trade is a go?", "score": 2, "replies": []}, {"body": "Regarding Wednesday, April 29th, 2020:\nSince the price has already changed by more than 0.18% since open and then retraced back to the open price, today is a NO TRADE DAY according to the criteria. Is that correct?", "score": 2, "replies": [{"body": "Correct", "score": 3, "replies": []}]}, {"body": "This is great. Thanks for the constant updates. Looking to see how this will roll.", "score": 2, "replies": []}, {"body": "Anyone try this today? Looks like it met the criteria. I didn’t notice it til after the fact and it was too late but looks like it played out perfectly. Just curious what gains were made on this.", "score": 2, "replies": [{"body": "I've coded up the algorithm with a .2% limit and auto trading since yesterday. 2 for 2. Just doing 1 contract a day  and I'll spit out the results at the end of next week", "score": 2, "replies": [{"body": "That’s awesome. What do you use to do that?", "score": 1, "replies": [{"body": "just some javascript and the tdameritrade api", "score": 1, "replies": []}]}]}, {"body": "Today actually didn’t meet the criteria, just barely broke the upper 0.18% limit before proceeding down to the -0.75% limit.\n\nHowever, there were other days the criteria just barely missed, like today, and I still took the trade and it worked like it would’ve today.", "score": 1, "replies": [{"body": "Am I interpreting the criteria wrong? Or did I miss a fluctuation in the chart? Looks like SPY opened at 278.95 and dropped almost immediately (within the first 30 minutes) to 276.58 (-0.85%) before skyrocketing. I didn’t see the 0.18% uptick prior to proceeding down.", "score": 1, "replies": [{"body": "I have 278.94 for the open, but negligible difference there. I monitor price change action on the 1m timeframe and at 9:31am, the upper 0.18% threshold was hit. TOS is showing a high of 279.68 for that bar and the upper 0.18% threshold was at 279.44.\n\nI use the extreme values (i.e. high bid/low bid for each bar) when determining if a threshold was crossed at any point and exclusively monitor the 1m timeframe for this method.", "score": 1, "replies": []}]}]}]}, {"body": "Can you clarify what you mean by \"3 strikes\" Do you mean if SPY was at, say, 280, then \"3 strikes\" would be 278?", "score": 2, "replies": [{"body": "In short, the 3 strikes is relative to the ITM strike option. \n\nSay SPYs opening price is $285.37 and the price proceeded to drop and hit the 0.75% threshold at $283.23. The closest ITM call option would be the 283 call. The 3 strikes I refer to would be the 286 call.", "score": 4, "replies": [{"body": "Okay, makes sense. This is also what allows you to secure at least 130%, since its decently enough OTM. With your price of <3.5 per contract as well, that helps to ensure you get a sizeable payout, which is why you were finding 160% was actually a better time to sell.\n\nWhen I get back enough cash to not worry about a loss, I'll start trying to trade this strategy. It could see some serious gains. The other important thing to remember is definitely the idea of not throwing your entire profit at the next trade. If the chance of success is 80-90%, as long as we only use a portion of our porfolio to do this trade, we should see solid gains, and even when we lose eventually, we just wait for the next time and we should come out on top.", "score": 3, "replies": [{"body": "Hit the nail on the head. Personally, I’m going to be trading this method on days the criteria are met and I’ll continue tracking results until VIX drops below 30. I’ll add weekly updates so long as there are tradable days during any given week.", "score": 3, "replies": []}]}]}]}, {"body": "What do you mean 0.75% target price, also, would you buy the 3rd closest to spy price otm option?", "score": 2, "replies": []}, {"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "how do you set a stop and a limit at the same time? or you have to just watch the entire time to exit?", "score": 1, "replies": [{"body": "In ToS, it is called a One-Cancels-Other (OCO) order. You can place a limit and stop loss order then.", "score": 1, "replies": [{"body": "yea i managed to figure it out. thanks", "score": 1, "replies": []}]}]}, {"body": "Ouch boss!", "score": 1, "replies": [{"body": "No trade day following xmatas guidelines.\n\nIf it goes above/below 0.2% threshold (revised to 0.18% he mentioned) and then crosses the open price prior hitting 0.75% don’t trade.\n\nHe also recommends not trading if 0.75% gets hit after 12pm EST.\n\nQuite a few nuances.", "score": 3, "replies": [{"body": "there have been so many times where it retraced but still went in the inital direction", "score": 1, "replies": []}]}]}, {"body": "is there a way to automatically consruct the lines of 0.18% and 0.75% based on opening price?", "score": 1, "replies": []}, {"body": "I think ur 0.18% threshold advice is bs. looking back there were so many times where after reaching over 0.18% it crossed the opening line again but then continued in the direction of the 0.18%. i think you need to see a SIGNIFICANT retrace from the 0.18% to know you shouldn't trade", "score": 1, "replies": []}, {"body": "Anyone want to clarify stop loss vs TP? Regardless of probabilities of this thesis, the R:R seems retarded. I keep reading different values but it seems the take profit should be 130-160% of the premium purchase price (ie: premium is $2.00 then TP should be $2.60-$3.20) however that the stop loss should be -75% of the premium price? So $2.00 premium should have a stop at $0.5? That's risking 75% of your position size to gain 30% which results in a horrible negative risk:reward value of -2.5:1. I must not be understanding something about this thesis. Or is it meant to be a stop at 75% of the value of the premium (in this example, $1.50)? If so, I'd expect that to too easily get hit. Something isn't adding up here.", "score": 1, "replies": [{"body": "it's 75% of the premium", "score": 1, "replies": [{"body": "That's a -25% stop from entry. In options, that will too easily get clipped and stopped out. Also barely a 1:1 trade. Just seems like shit odds to me.", "score": 1, "replies": [{"body": "it's true. if your confident (which you should be if you enter one of these) then you shouldn't use a stop", "score": 1, "replies": []}]}]}]}, {"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Yesterday was the first unsuccessful trade day since posted?", "score": 1, "replies": [{"body": "No, yesterday was successful as well.\n\nThe price didn’t cross back over the opening price, but the option was able to be sold at 160% of its purchased value if purchased at the time the stock price hit the -0.75% limit.", "score": 2, "replies": []}]}, {"body": "The update was very clear, Thanks", "score": 1, "replies": []}, {"body": "Is anyone still using this strategy?  If so, what are the results?", "score": 1, "replies": []}, {"body": "So calls or puts?", "score": 0, "replies": [{"body": "Yes", "score": 3, "replies": []}]}, {"body": "How did it work out today?", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Yeah no trade today. \n\nBarely crossed back over the opening price after hitting lower 0.18% limit before proceeding down to the lower 0.75% threshold.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": -11, "replies": []}, {"body": "This asshole tells us to read another fucking post in a TLDR. *who does that*", "score": -10, "replies": []}]}
{"title": "This article helped me understand a little as to why the market is rallying. Wish I knew this before buying puts on SPY - \"Amazon’s $1.2 trillion market value, in fact, now accounts for more than 40% of the entire value of the S&P 500 consumer-discretionary sector.\"", "selftext": "", "id": "g8a2tp", "created_utc": 1587885245.0, "score": 278, "upvote_ratio": 0.88, "num_comments": 74, "comments": [{"body": "The key phrase here is \"of the S&P CONSUMER-DISCRETIONARY SECTOR\"\n\nAMZN is only 4.3% of the overall S&P500", "score": 331, "replies": [{"body": "Thank you. I read this article last night and knew it'd eventually find its way to WSB. The wording on the article is very important and also misleading. There was a pie chart on here a week ago trying to show how the big four tech account for half the S&P500 (if you don't count the middle 100!) it's such pointless drivel.\n\nThat said... I think 40% of discretionary is still really high. I would say I'm a fairly heavy amazon shopper; I'd like to think more than the average American. However, it's definitely not 40% of my discretionary spending. Maybe on the order of 20%. Many small businesses have totally stopped shopping online because they are closed. \n\nThis is probably stupid but I am thinking put spreads on Amazon.", "score": 82, "replies": [{"body": "I've excluded 499 companies and results are SHOCKING, Amazon accounts for 100% of S&P500.", "score": 88, "replies": [{"body": "😮", "score": 22, "replies": []}, {"body": "Math and facts hate this guy", "score": 12, "replies": []}, {"body": "Those elitist 100%'ers", "score": 2, "replies": []}, {"body": "There are over 500 companies in the S&P500....", "score": -3, "replies": [{"body": "Over 500 stocks.  Exactly 500 companies.", "score": 3, "replies": []}]}]}, {"body": ">That said... I think 40% of discretionary is still really high. I would say I'm a fairly heavy amazon shopper; I'd like to think more than the average American. However, it's definitely not 40% of my discretionary spending. Maybe on the order of 20%. Many small businesses have totally stopped shopping online because they are closed.\n\nlol talk about pointless drivel... I like how Amazon's software + cloud platform doesn't enter your analysis at all. Good luck with your put spreads retard.", "score": 8, "replies": [{"body": "You're right, I didn't mention it. AWS has been massively profitable for years. Online shipping has not. Labeling AMZN as a consumer discretionary sector and people investing in such doesn't make sense. Which is why a stat is like 40% of that sector is meaningless.\n\nAnd who said anything about analysis? This is WSB, bro.", "score": 4, "replies": [{"body": "Haha not profitable for years...but still profitable. If anything it has room to grow cause of mainstream old school logic like yours still living in 1999 when they lost money on selling books instead of today when they're profitable worldwide on almost every major business. Maybe buy some GE while you're at it? I heard they're doing great.", "score": 0, "replies": [{"body": "When you account they pay their employees with RSUs, their margins are not impressive.", "score": 1, "replies": []}]}]}]}, {"body": "They killed their ER in January, but I fully expect them to disappoint this round.  Expectations are too high.\n\nMore than anything I'm guessing this will be the guidance that shakes the market.", "score": 1, "replies": [{"body": "Just to counter your views a little.\n\nThey just started hiring almost 200k additional employees. They are actively preventing people from buying more shit on their site by turning off some of their suggestion algorithms. Netflix is on AWS, just as an example, and Netflix just had an insanely big quarter.\n\nI think you are looking at this wrong man. They are going to blow shit out of the water so hard it might come as a shock even after the 20% run-up in the last few weeks.", "score": 1, "replies": [{"body": "Amazon's ecommerce business is literally a loss leader for them, all their ecommerce profits are from FBA.  Which is a drop in the bucket compared to their other divisions.", "score": 2, "replies": []}]}]}]}, {"body": "True.\n\nBut the top 10 companies in S&P 500 are all internet companies that are in some way benefiting from remote work. And them make up 26% of the S&P 500\n\nTop 10 Holdings\n\n[https://www.schwab.com/public/schwab/investing/investment\\_help/investment\\_research/mutual\\_fund\\_research/mutual\\_funds.html?&&path=%2Fprospect%2Fresearch%2Fmutualfunds%2Fsummary.asp%3Fsymbol%3Dswppx](https://www.schwab.com/public/schwab/investing/investment_help/investment_research/mutual_fund_research/mutual_funds.html?&&path=%2Fprospect%2Fresearch%2Fmutualfunds%2Fsummary.asp%3Fsymbol%3Dswppx)", "score": 2, "replies": [{"body": "The top 10% make up 26%? Seems legit.", "score": 1, "replies": []}]}, {"body": "That's still a very considerable amount considering they are only 0.02% of the companies listed (1÷500). Im sure a couple other big dogs in that index are also \"recession proof\" which makes SPY a bad thing to short during any downturn. I should've focused on the individual companies that are lagging behind on the rally like some auto manufacturers as stated in the article.", "score": -10, "replies": [{"body": "Well yes obviously the biggest US companies are gonna have the biggest contribution to the S&P500. And seeing as the biggest us companies are amzn, goog, msft, aapl,... Tech is about 22% of the S&P. No offense, but this is very basic knowledge that you should have BEFORE you invest in an index, especially shorting it. If you want smallcaps go for the russel2000 (IWM).\n\nI do however believe that these tech stocks are not recession proof in the slightest and this entire rally is based on hopium and money having nowhere else to go, making them very overvalued. If you think its 'safer' to short the smaller companies who are already down a lot and havent been recovering, be my guest. I guess this week will show how recesiion proof tech has been so far.", "score": 36, "replies": [{"body": "The market will shrug off whatever comes in Q1 and basically Q2 but if the guidance for Q3 isn't promising then this party is over.", "score": 12, "replies": [{"body": "Probably", "score": 3, "replies": []}]}]}, {"body": ".2% boss", "score": 20, "replies": []}, {"body": ">0.02%\n\n1 in 500 is 0.002, or 0.2%. Or to put it even more simple, 1 out of 100 is 1, dividing that by five equals 0.2.\n\nfucking middle school math lmao", "score": 8, "replies": []}, {"body": "The 5 biggest stocks in the S&P500 (MSFT AAPL AMZN GOOGL FB) have a weighting equal to the bottom 350 stocks.", "score": 7, "replies": []}, {"body": "Well good thing you learned that before you lost a lot of money...right?", "score": 15, "replies": []}, {"body": "Nice math bro.", "score": 2, "replies": []}]}]}, {"body": "And Apple also at $1.2 trillion is another 40%.", "score": 67, "replies": [{"body": "Then Msft at 1.3trillion is another 40%.", "score": 82, "replies": [{"body": "Wait that doesn't add up", "score": 29, "replies": [{"body": "Sure it does. How else do you think we'll reach the moon?", "score": 19, "replies": [{"body": "TSLA?", "score": 10, "replies": [{"body": "69%", "score": 5, "replies": []}]}, {"body": "SPCE", "score": 0, "replies": []}]}, {"body": "Yes it does. It adds up to 120%", "score": 2, "replies": []}]}]}]}, {"body": "Who knew Daddy Bezos would help save Donny’s Presidential bid by singlehandedly keeping SPY afloat.. The next plot twist coming must be wicked..", "score": 52, "replies": [{"body": "Ooh wicked.... Randy Marsh", "score": 9, "replies": []}, {"body": "They are actually in cahoots and the feud is just WWE style pizazz", "score": 3, "replies": []}, {"body": "This. One wonders if it irks him to some extent.", "score": 2, "replies": []}, {"body": "JEDI is cancelled and awarded to Amazon", "score": 3, "replies": []}, {"body": "Don't think 4.3% of SPY's value is holding it up alone.", "score": 1, "replies": []}]}, {"body": "IWM is rallying without big tech exposure. Its not just  Amazon.", "score": 17, "replies": [{"body": "Still way behind SPY and QQQ.", "score": 6, "replies": []}]}, {"body": "Next step - figure out which S&P 500 stocks will drop further than the top five in the index when the market drops. Short those, not SPY or SPX. It will be less expensive and outperform.", "score": 17, "replies": [{"body": "AIRLINES", "score": 2, "replies": []}, {"body": "USO", "score": 1, "replies": []}]}, {"body": "Remember the last time a few mega-caps propped up the indices, rallying at breakneck pace? Of course not, because the next person to read this is probably going to be a zoomer. Long YHOO. Stonks only go up.", "score": 15, "replies": []}, {"body": "Literally could have found this out with two clicks.  Which is a lot fewer than what it would have taken you to buy your puts.  But why research when you can guess.", "score": 12, "replies": [{"body": "## 5 seconds google search\n\n## TOP 10 HOLDINGS for SPY\n\n**COMPANYSYMBOLTOTAL NET ASSETS**\n\n[**Microsoft Corp.**](https://www.marketwatch.com/investing/stock/msft)**MSFT**4.94%\n\n[**Apple Inc.**](https://www.marketwatch.com/investing/stock/aapl)**AAPL**4.55%\n\n[**Amazon.com Inc.**](https://www.marketwatch.com/investing/stock/amzn)**AMZN**3.13%\n\n[**Facebook Inc. Cl A**](https://www.marketwatch.com/investing/stock/fb)**FB**1.85%\n\n[**Berkshire Hathaway Inc. Cl B**](https://www.marketwatch.com/investing/stock/brk.b)**BRK.B**1.61%\n\n[**Alphabet Inc. Cl A**](https://www.marketwatch.com/investing/stock/googl)**GOOGL**1.6%\n\n[**Alphabet Inc. Cl C**](https://www.marketwatch.com/investing/stock/goog)**GOOG**1.6%\n\n[**JPMorgan Chase & Co.**](https://www.marketwatch.com/investing/stock/jpm)**JPM**1.45%\n\n[**Johnson & Johnson**](https://www.marketwatch.com/investing/stock/jnj)**JNJ**1.41%\n\n[**Visa Inc. Cl A**](https://www.marketwatch.com/investing/stock/v)**V**1.24%", "score": 10, "replies": []}]}, {"body": "Top 5 SP500 worth more than bottom 350 companies. Until those tech giants fall, SPY won't budge. I expect FB GOOGL APPL to fall after earning, but MSFT & AMNZ be tough", "score": 7, "replies": [{"body": "I don’t understand this Amazon mania. Their margins are too small for the online sales section, most of their growth lately came from AWS, so not sure if this pandemic will help them as much as people assume it will.", "score": 6, "replies": [{"body": "Most people don't know that and just think Amazon + pandemic sales = profit. Hence why it's stock is mooning, justified or not.", "score": 4, "replies": []}, {"body": "netflix runs on aws", "score": 1, "replies": [{"body": "So does tons of other companies that are cutting cost. Ie before laying off 1/3rd of their workforce, first thing Yelp cut was their AWS cluster usage. Lots of AWS operations are a tradeoff and can certainly be frugalized. Plus this is also an opportunity for competitors (msft, alicloud, gcloud etc) to take market share slowly since they provide much cheaper Onboarding experience.", "score": 1, "replies": []}, {"body": "No it doesn't, netflix has its own deals with ISP and does not use AWS for anything other than frontend customer service.", "score": 1, "replies": []}]}]}]}, {"body": "Its the pumping of the money supply. Banks **need** to put it somewhere. But it does mean that the value of stocks has gone up more than the value of the company  which basically means each stock you held yesterday is worth less today even if the price goes up.\n\nIt's essentially like devaluing a currency so more dollars buy you less stock.\n\nThe FED is kidding itself if it thinks there is not going to be  a major sell off to cash out and pump this money into the real economy.", "score": 5, "replies": []}, {"body": "“It’s difficult to get worse than worst ever,”", "score": 6, "replies": []}, {"body": "Dude this is the top. Get your puts", "score": 2, "replies": []}, {"body": "Big brain!!", "score": 2, "replies": []}, {"body": "You belong here", "score": 2, "replies": []}, {"body": "maybe they need to split it up so like $AMZN and then $AMZN class b ($SPY) then have a real index (S&P 499) so it is not a secondary index tracker of one company.", "score": 1, "replies": [{"body": "Or maybe they don't", "score": 9, "replies": []}, {"body": "Ah the old Wayne Gretzky fantasy hockey split to make things fair", "score": 3, "replies": []}]}, {"body": "same could catch", "score": 1, "replies": []}, {"body": "> 40% of the entire value of the S&P 500 ... Consumer-discretionary sector\n\n\n\nYou had me in the first half", "score": 1, "replies": []}, {"body": "People are just now realizing the money has shifted like it always does in a bear market to companies that still have an income? \n\nAnything considered essential in the real world is the same in a portfolio.", "score": 1, "replies": []}, {"body": "Nah, I'm still going to load up on Apple puts after earnings and maybe Amazon out spreads near the EoW.", "score": 1, "replies": []}, {"body": "[XD](https://www.slickcharts.com/sp500)", "score": 1, "replies": []}, {"body": "Lol CNBC", "score": 1, "replies": []}, {"body": "Its people don't understand the market trades big fucking companies and not barber shops.", "score": 1, "replies": [{"body": "Yup, the top weighted holdings of the indexes are still open for business. In the SPY top 20 holdings. Only Disney at #17 is not really open.", "score": 2, "replies": []}]}, {"body": "I think the part you might have missed and that we all missed is the following: Amazon is one of the top 3 largest companies period. It in entirety is worth 1.2 trillion. We have printed 10 FULL Amazon’s worth in free money. \n\nHow the fuck did we not add that in.", "score": 1, "replies": []}]}
{"title": "Speculative Shitpost: The Market will tank around October/November", "selftext": "I keep making the same arguments over and over, so I'm just going to make a big shitpost about it.\n\n#Understanding The Market\n\nNo one understands the market, but there are some very broad rules of thumb that the market tends to follow. One of them is that the market tends to go down with uncertainty more than anything else. You can take the recent dips: One came when a single drug was found to maybe not be super effective against COVID, and another happened when Oil went into a freefall. The market recovered fairly quickly, but the dips had less of a real-world impact than the uncertainty surrounding them.\n\nI know we joke that bad news means green because stonks only go up, but the reason the \"priced-in\" memes have some weight is because the bad news is already accepted, and the world banks have tapped their cheat codes to prop things up.\n\nThe thing is: banks can't solve all the real world problems.\n\n#Things Banks Can't or Won't fix even with Infinite Cash\n\nOil was another domino in the collapse, but why did the banks not just use cash to fix it? Because the problem wasn't cash, it was physics. Cash doesn't just buy space to keep oil, and buying oil doesn't do shit if you don't have a place to put it or people to consume it. In theory they could just dump it in the ocean or burn it, literally burning the cash they used, but they won't do that. They would just as soon let the whole thing work itself out while pumping money into the market.\n\nCommodities are much more difficult to manipulate because you're dealing with something that is real and takes physical space and actual labor to produce.\n\nMy point is that there are things that infinite cash cannot address, and if they are addressed (e.g. burning oil bought with infinite cash), you're probably going to see your dollar become useless anyway. There's an economic breaking point where you will Sophie's choice the market vs real-world issues, and the Fed has already shown it will chose the market.\n\n#Understanding the Virus\n\nA lot of places in the US are getting itchy to reopen as our measures appear to be working. The thing is: COVID isn't going to just disappear. No one expects it to, but the way things are playing out, we are likely going to see a significant deceleration of cases in the next several weeks. The result will be a political nightmare to keep things closed. Wait until someone suggests cancelling Football and the South will start a civil war.\n\nSo, given the path we seem to be taking, expect it to be politically adventageous to open the country in the June-to-August range. This will see people get sick, but we're going to likely sacrifice Nana to the Economy god \"for the good of the country.\"\n\nWhat will happen, then, around October? A couple things: One is that the virus may have more staying power with cold weather. It will now be mostly dispersed in the population rather than isolated to a few hot spots, and with the globe open again, it will have a chance to come back harder than before. This is something that is likely \"priced-in.\" But, there are two things that are likely not \"priced-in:\"\n\n1. The Flu\n\n2. Congress\n\n#The Flu\n\nConstantly being compared to COVID is the fucking flu. I'm not going to go into detail as to why the comparison isn't really relevant, but flu season is basically baked into society.\n\nI can tell you that hospitals, at times, get pretty crowded when it comes to the flu. Certain seasons can hit critical care units pretty hard. You can't predict how bad the flu will be year-to-year, but I can guarantee you that this season is shaping up to be a humdinger. You thought COVID was bad? Combine it with a peaking flu outbreak. Suddenly you have a resurgent COVID running in with the flu, and all sorts of speculation is going to happen with \"how bad is flu season going to be this year??\"\n\n#Congress and their shitty stimulus\n\nCongress has shown its hand in doing what they have always done: giving money to people who really don't need it, and leaving workers the honor of footing the bill after getting the crumbs.\n\nRight around election time, the state of the country is going to likely be at the forefront of discussion. If we're open for a few months by then, there will be bitching about closing for no reason, and accusations that we opened too soon. This bitching will likely be marbled into other discussions for how their massive stimulus bills benefited X people when they should have gone to Y people.\n\nThe result is that congress, around October/November, will likely be super hesitant to approve more stimulus, even if the need arises.\n\n#A Perfect Storm\n\nIf COVID went to zero tomorrow and the global economy reopened, there is likely going to be a chain of events that would happen in fairly rapid succession:\n\nFirst, the historic unemployment levels will likely be very slow to reverse. Many have already stated here that businesses are very likely to use this time to \"trim the fat.\" What better opportunity to cut staff than to simply not rehire them? This lag is going to be exacerbated by the fact that businesses are going to be scared to add more expenses to their books after the recent downturn. This hesitance will snowball as service industries are likely going to have a significant drop in customers with people still hesitant to gather in large groups. The spending power of the populace will continue to drop and businesses that were expected to bounce back, won't.\n\nThis is likely not going to be addressed by the Fed because it will be at the worker level. It would have to be addressed by Congress, who I just mentioned would likely be politically hesitant.\n\n\n#Back to the Market\n\nSo, what does this all mean? Uncertainty.\n\nYou have an economy that just reopened, a virus that will start coming back, the flu season starting, a congress that had diamond hands, an unemployment ATH which is not rapidly reversing, and to top it all off, you have the election.\n\nAll of this isn't even accounting for possible commodity collapses, interruption of supply chains, and already collapsing shipping industries, all of which are likely going to peak in the future despite being disrupted now.\n\nThe only way the Fed can keep the Market afloat long-term is to literally nationalize stocks, at which point you should probably just invest in Gold.\n\nTL;DR: Uncertainty breeds crashes+Volatility. We're comfy now with the idea that we will return to normal in a few months, but a lot of sparks are in front of us that are likely to start new fires.\n\nVIX 11/18 50c", "id": "g8gfeo", "created_utc": 1587915565.0, "score": 97, "upvote_ratio": 0.88, "num_comments": 78, "comments": [{"body": "\"Things Banks Can't or Won't fix even with Infinite Cash\" - this point is the real hit. If you look at commodity derivatives and how much banks are exposed there, 6 trillion will seem like a dime to you. If shit hits the fan there, we are looking at 100-200 trillion of vaporware. Supply chains are being disrupted right now.", "score": 51, "replies": [{"body": "Check out this visualization to get a real understanding of the derivatives market\n\n[http://money.visualcapitalist.com/worlds-money-markets-one-visualization-2017/](http://money.visualcapitalist.com/worlds-money-markets-one-visualization-2017/)", "score": 13, "replies": [{"body": "All the Fed has to do is type in 1,200,000,000,000,000 into the magic money computer and it's better again.", "score": 10, "replies": []}]}, {"body": "Could it really be that our shitty deregulated meat packing plants and their awful conditions will bring down the world economy lol", "score": 9, "replies": [{"body": "Fuck the meat stuff, look at everything else. Banks are in so hard on this shit, that the whole world is on derivative cocaine right now.", "score": 4, "replies": [{"body": "O lordy. You think they haven't had enough time to delever themselves?", "score": 1, "replies": []}]}]}, {"body": "What do you mean by vaporware? Commodities that arent able to function because of corona?", "score": 1, "replies": []}, {"body": "So which retail warehouse company can I buy calls for", "score": 1, "replies": []}, {"body": "What matters is net derivatives", "score": 1, "replies": []}]}, {"body": "Even if someone doesnt agree with this, they should put about 5-10% of their betting cash on this call as insurance while they are riding the trends", "score": 10, "replies": [{"body": "Considering this option is trading at 2.45 and was trading at 32+ during it's peak, this is an opportunity to get a 13 bagger if the caca hits the fan.", "score": 6, "replies": []}]}, {"body": "> we are likely going to see a significant deceleration of cases in the next several weeks\n  \nWho wants to tell him?", "score": 9, "replies": [{"body": "Testing up =cases up", "score": 5, "replies": [{"body": "If we stop testing, we cure coronavirus...", "score": 1, "replies": []}]}]}, {"body": "It will tank after earnings around end of may. After the ramp up to 300-310. Market recovers way before all the bad news hits. It will then probably ramp up into the elections", "score": 15, "replies": [{"body": "That's what I am thinking too...sure seems like it would be a smart political move for Trump to let the cat out of the bag and then print another 2-3 trillion right before the election with goodies for votes", "score": 8, "replies": []}, {"body": "It won't tank end of May.  Everyone is looking forward to the reopening.  Then they will wait to see the results of the reopening, at the least.  Then they will make excuses that not everyone reopened yet and that the first month was expected to be bad.\n\nI'll probably cash out half in the first of July.", "score": 7, "replies": []}, {"body": "Yay 6/19 put holding will pay off", "score": 1, "replies": []}]}, {"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 6, "replies": []}, {"body": "Naw....July-August IMO.  When Q2 earnings come out and we realize how the markets over estimated what was \"priced in.\"", "score": 7, "replies": []}, {"body": "If you're going this direction, why not do a straddle/strangle and leg in and out as appropriate? Seems that has more profit potential to me", "score": 4, "replies": [{"body": "Because based on his comments about his expectations this play sounds more like a YOLO than a comprehensive thought out trade...you know the WSBs special", "score": 5, "replies": [{"body": "Yeah, I definitely see your point now after reading the comments. Oh well, helicopter yacht or bust I suppose", "score": 2, "replies": [{"body": "Yeah saying 1000% short term gain, mooning, etc. are usually the tell-tell signs of a YOLO but I mean this is WSB so I expect nothing less.\n\nShit mods should probably ban me because my portfolio is like 80% stocks and 20% option hedges.", "score": 2, "replies": [{"body": "Sir, this is a gambling sub", "score": 2, "replies": []}]}]}]}]}, {"body": "How much are you in the hole with those VIX calls? I mean your DD says tanking in Oct/Nov soooo why did you buy those calls so early? Did you put this DD together during restless nights or something?", "score": 15, "replies": [{"body": "I'm planning on buying at open.\n\nBasically I'm betting some major shifts will happen between now and November. If we see a spike that's even a portion of what happened in March at any time, I would more than double my money", "score": 9, "replies": [{"body": "Autist based on your own DD that’s not a smart move. If it plays out the way you expect it to theta gang is going to rape your culo and a big drop in Oct/Nov might get you break even or a small gain. If you think volatility is going to spike again in Oct/Nov then buy your calls in September and have the expiration 3-6 months out. \n\nTLDR buying now contradicts your own DD and is a FOMO move that’s gonna split them cheeks", "score": 19, "replies": [{"body": "Only if you get greedy.\n\nIf we see a crash anything like we saw in March between now and then, you have a 1000% gain.\n\nI'm basically betting it will happen between now and then. I will double my position come September if it hasn't hit already 60", "score": 3, "replies": [{"body": "Do you know what theta is bro", "score": 3, "replies": [{"body": "Yes. And if Vix hits 60 anytime between now and then, I more than double my money. If it hits 80 at any time, I get over 1000% return.\n\nThe bet is that it will happen before the expiry. Anytime before then.", "score": 2, "replies": [{"body": "I have a very small VIX put position that I bought at the bottom about a month ago. It’s -81% even though the VIX is much lower than when I bought them and they are dated for August.\n\nGo ahead and try but I think you should wait til September before you buy.", "score": 3, "replies": [{"body": "You got IV crushed. Little of that loss was from theta.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Time decay has entered the chat", "score": 5, "replies": [{"body": "This dude bought his first option 10 days ago and is now buying VIX calls 7 months out. /thread", "score": 1, "replies": []}]}, {"body": "I 100% agree. I’ve already been opening long ass calls on gold for the past few weeks. The buck stops when the play money hits a wall of reality. Gold price is also increasing due to mining halts, and mints actually running out of physical gold because so much is being bought as insurance", "score": 6, "replies": []}, {"body": "May come sooner.  Once Georgia or Las Vegas get a spike it will show that lockdowns are needed, and that will be applied to other areas.", "score": 2, "replies": [{"body": "I don’t think Vegas even needs a spike. When they reopen & post earnings wayyyyy down because no one WANTS to travel, especially the old timers who usually gamble the most, it will be obvious that it’s out of the mayor’s hands.", "score": 2, "replies": [{"body": "Agreed as well", "score": 1, "replies": []}]}]}]}]}, {"body": "It is unfortunate Congress is more concerned with the election and how to manipulate things now, to get in the best situation. Regardless what browns this is going to be an ugly volatile election. The economy is a pawn. We all will be impacted for the parties better good.", "score": 2, "replies": []}, {"body": "I think the same but earlier", "score": 2, "replies": []}, {"body": "This reads like that one smart dude in the anime who just monologues about boring shit for ten minutes", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Dumbasses always get their flu shots, and they still get the flu", "score": -1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Look at the historical VIX back in 09 when the market reached its low, VIX went down.  You want puts in $SPY, $JNK or $HYG...not calls in VIX.", "score": 1, "replies": [{"body": "Why is jnk composed of foreign corps? I thought it was at least American junk bonds", "score": 1, "replies": []}, {"body": "Why would you buy puts on HYG when the fed has started buying it?", "score": 1, "replies": []}]}, {"body": "TLDR", "score": 1, "replies": []}, {"body": "October historically volitile", "score": 1, "replies": []}, {"body": "Gonna happen before that", "score": 1, "replies": []}, {"body": "Vega gang running up to November??", "score": 1, "replies": []}, {"body": "VIX 50 in Nov? Too conservativ. I think it will hit 50 within weeks to up to 2 months.", "score": 1, "replies": []}, {"body": "I think it will tank in June.  States will open up in May prematurely,  and cases will spike.  America doesn't have the patience to let the bell curve fall.  \n\nIn May we will unleash the virus, because \"hurr durr I'm free fuck science Im from Merica.\"", "score": 1, "replies": []}, {"body": "Sir, this is a breadline.", "score": 1, "replies": []}, {"body": "Invisible Spending War\n\nCoronavirus is a nest of scams\n\nSmall businesses across America get raped\n\nGot it\n\nBuy robots\n\nSoftBank Group Corp - ADR\nOTCMKTS: SFTBY\n20.48 USD −0.15 (0.73%)\nClosed: Apr 24, 4:41 PM EDT\nAfter hours 20.50 +0.020 (0.098%)", "score": 1, "replies": []}, {"body": "Ofcifbed is when the market will go up. Papa Donald will not let the market take the shot so close to the election", "score": 1, "replies": []}, {"body": "Imagine thread after thread being such wrong opinions", "score": 1, "replies": [{"body": "Nah, I think he is right, but the tank will start in late August or September. This is assuming COVID lingers, which I assume it will. It goes out the window if we get a miracle breakthrough. \n\nI think we'll continue to need stimulus or relief plans every month or two. Around the time of the presidential conventions in August or shortly thereafter, the Democrats are going to put their foot down and refuse any stimulus that has a modicum of a chance of helping business. That is about when we'll start to see solvency issues really starting to develop in some bigger household name companies. Biden has cover because he's not in the House voting to shoot this stuff down. The fear that big time free money is ending will torpedo the stock market and the Democrats will be able to point to the Dow trading at 15k or whatever as an indicator of how disastrous the Trump presidency has been.", "score": 4, "replies": [{"body": "My position would moon even if it spiked early", "score": 0, "replies": []}]}]}, {"body": "Meh. A bunch of old and/or mostly unhealthy people will die. People will get over the shock bale and go on with their lives.", "score": 0, "replies": []}, {"body": "Flu deaths are being counted as corona deaths. \n\nThe numbers are baked.", "score": -13, "replies": [{"body": "Numbers are being significantly under reported.\n\nFor example a significant amount of unexplained deaths in NYC at the time this data was taken. \n\nhttps://mobile.twitter.com/joe_pickrell/status/1248721149233713153\n\nFurther, samples taken from some who died before the first known death were positive for COVID-19.", "score": 9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The report that came out this week the first American death of rona was in California early February.", "score": 1, "replies": []}]}]}, {"body": "Deaths aren't being counted unless they've been confirmed to have Corona. Lack of tests means you're wrong. Underestimated deaths.", "score": 9, "replies": [{"body": "Actual reporting from NYC says otherwise.  A full 33% of covid deaths aren't tested just listed as \"probably\" had covid\n\nNumbers are totally being cooked because of all the Medicare Medicaid dollars being thrown at it.  Tons of DR's on twitter complaining about things being coded as covid that shouldn't be.\n\nIt's become one big giant dumping ground so hospitals can recoup some money from this disastrous shutdown\n\n[https://imgur.com/a/GWGBF53](https://imgur.com/a/GWGBF53)\n\nSweden had it right", "score": -3, "replies": [{"body": ">Sweden had it right\n\n👆", "score": 1, "replies": []}, {"body": "Significantly more deaths for the month than typical, yet only part of them attributed to Covid-19.  And you say the numbers are being over reported? \n\nhttps://mobile.twitter.com/joe_pickrell/status/1248721149233713153\n\nQ: So what’s the cause for all these unexpected deaths? \n\nSweden had it right?  Sweden isn’t overwhelming their hospital system. If NYC did as Sweden did what would the situation have looked like and how many people would die that could be saved?\n\nNYC did as Sweden did - ramped up hospitals while imposing restrictions to ensure hospitals didn’t go in to melt down.", "score": 1, "replies": []}]}]}, {"body": "Oh fuck we got an Omega Trump Cuck here", "score": 1, "replies": []}, {"body": "Even the baked numbers are lower than initial modelling by a factor of 10. We got duped", "score": -7, "replies": [{"body": "We got duped?  Hospitals in hard hit areas have done nothing but battle covid.  That means zero elective surgeries.  There have been morgues overrun and refrigerated trucks full of bodies, and this is all WITH shutdowns and social distancing in place.\n\nIt blows my mind that there are people retarded enough to not be able to imagine how fucked we would have been if we had just treated this like the flu.  It’s pathetic.", "score": 4, "replies": [{"body": "Hospitals around the country and even in NYC are a giant ghost town.  Quit being tricked by the fear mongers trying to get clicks. This has been Y2K 2.0\n\nNO MORGUES WERE OVERRUN.  They had about  2-3 day window to adjust to the supply chain at hand.  Now it's tumbleweeds.  That was all panic driven fake news.  You seriously won't find an article written in the past 2 weeks talking about that as something actually happening.  Hospitals across the country. Even in NYC are letting people off and furloughing \n\n[https://www.houstonchronicle.com/news/houston-texas/houston/article/Harris-County-to-close-17M-medical-shelter-at-15224560.php](https://www.houstonchronicle.com/news/houston-texas/houston/article/Harris-County-to-close-17M-medical-shelter-at-15224560.php)", "score": -1, "replies": []}]}]}]}, {"body": "Whatever makes you feel better...", "score": -10, "replies": [{"body": "Shh, These guys are the ones buying the Puts we are writing. :)", "score": 0, "replies": []}]}]}
