{"title": "CAVA up +20% because of all the put lemmings lol", "selftext": "It's fReE moNeY because  IPO LocKuP PerIod ExpiRation. \n\nHall of shame:\n\nu/Veritatis-Cupitor [$CAVA – DECEMBER SHORT PLAY (Potential Crash and/or Death Spiral)](https://reddit.com/r/wallstreetbets/comments/18d0g1y/cava_december_short_play_potential_crash_andor/)\n\nu/jamzkourt [I gave you UPST yesterday ….up over 20% today !! So hear me out on this next play ….short CAVA and here’s why](https://reddit.com/r/wallstreetbets/comments/188qi3e/i_gave_you_upst_yesterday_up_over_20_today_so/)\n\nu/mlamping [CAVA YOLO](https://reddit.com/r/wallstreetbets/comments/18g93ph/cava_yolo/)\n\nu/Dragonian36 [Is CAVA “dumping” this month?!?](https://reddit.com/r/wallstreetbets/comments/18d0h3f/is_cava_dumping_this_month/)\n\nSo what up geniuses, what's your next great free money play that we just need to inverse?", "id": "18gy5rj", "created_utc": 1702419208.0, "score": 292, "upvote_ratio": 0.93, "num_comments": 82, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|7620|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "LMAO, I started lending my cava shares as Fidelity was giving me 30% interest rates , I pity whoever bought that thinking that they can short cava", "score": 186, "replies": [{"body": "Does fidelity contact you to do that?", "score": 33, "replies": [{"body": "I just saw a notification in my portfolio that I can participate in this lending program,they never contacted me via email or phone", "score": 58, "replies": [{"body": "30% interest?\n\nThat's huuuugeeee", "score": 47, "replies": [{"body": "it's per annum you dofus \n\nthat's fucking latin for it's per year and not really that much per day", "score": 4, "replies": [{"body": "Dumb OP, show me something else that pays more than 6% guaranteed interest right now.", "score": 10, "replies": [{"body": "Do you think people are going to be borrowing your shit stock from a failing company for an entire year at 30% interest? Sometimes it feels like people on this sub don't think at all.", "score": 3, "replies": [{"body": "This right here. But even if it averages 30% over an entire year. It's going to be calculated *daily* (<0.08% per day), based on the daily stock price. If it tanks 80%, then 30% interest would turn to shit too.", "score": 4, "replies": []}]}, {"body": "Stock tanks 80% over a year. You get 30%, calculated *daily* based on the stock price (<0.08% per day). How much money do you make? None, you going to just lose it as usual with this genius idea because the stock price won't stay the fucking same.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I was getting a lot for weed.to\n\nGuess what?  Price fell.", "score": 12, "replies": []}, {"body": "Damn and then you can sell calls and puts on top of that", "score": 5, "replies": []}, {"body": "And that’s 30% per year or ?", "score": -5, "replies": [{"body": "Yes. Assume any interest rates you see are yearly", "score": 19, "replies": []}, {"body": "No it's actually bi annually in this case", "score": 2, "replies": []}]}]}, {"body": "Obviously it's time to do CAVA calls to make up for all the losses lol", "score": 67, "replies": [{"body": "Gonna be the time for puts once everyone jumps into calls lol", "score": 42, "replies": [{"body": ">Only true regards got Dec 15th puts on CAVA. Most are playing several months out of expiration\n\naka now, everyone bought calls expecting a massive squeeze", "score": 4, "replies": []}, {"body": "Exactly how it works💪", "score": 3, "replies": []}]}]}, {"body": ">I'm thinking we short $CAVA again. They just had their IPO lockup period expire, and I think there's a good chance they'll see some selling pressure as insiders cash out. Plus, the stock is still pretty expensive relative to its earnings power, so it could be ripe for a correction.", "score": 68, "replies": [{"body": "One more time! One more time! Gooble gobble gooble gobble.", "score": 24, "replies": [{"body": "Wobble wobble shake it shake it.", "score": 2, "replies": []}]}, {"body": "Thanks for the financial advice.", "score": 12, "replies": [{"body": "I am going to make decisions based on it.", "score": 15, "replies": []}]}, {"body": "Maybe you're on to something, but all the put lemmings need to sell their puts at a loss first", "score": 0, "replies": [{"body": "Only true regards got Dec 15th puts on CAVA. Most are playing several months out of expiration", "score": 9, "replies": []}]}]}, {"body": "No need to bash or mock, the DD was reasonably solid in theory.  Problem is when it just makes so much sense it’s guaranteed not to work", "score": 43, "replies": [{"body": "There was literally 4 paragraphs about how OP was a carnivore. Are you fucking stupid lmao", "score": 8, "replies": []}, {"body": "It was a regarded theory based soley on the fact they “thought” people would sell lol.", "score": 5, "replies": []}, {"body": "The DD literally didn't make sense. That's why OP made the post, it was pretty obvious folks were wrong.", "score": 2, "replies": []}]}, {"body": "I want to like Cava but they always act pissed to see me. I usually do online orders and it’s always tiny portions, go out of my way to be polite and not rush them, yet they’re still annoyed", "score": 30, "replies": [{"body": "Bullish\n\nToo many regards like you going to cava", "score": 22, "replies": []}, {"body": "Seriously, what’s with the attitude bc I wanted a fucking bag for my food??", "score": 8, "replies": []}, {"body": "why keep going", "score": 1, "replies": [{"body": "I don’t", "score": 1, "replies": []}]}]}, {"body": "Wow - where were these posts on this angle in any of the 3 posts above? Loving the after the fact posts - just hilarious.", "score": 13, "replies": []}, {"body": "Wow…the first time I actually sold something right before it tanked instead of right before it mooned 😂 sold my 12/15 $30 put yesterday for 100% gain (yes I’m a pussy and only bought one lol)", "score": 12, "replies": [{"body": "Damn are you me lol, except I sold on Friday for like 50% lol", "score": 1, "replies": []}]}, {"body": "Guess now is the time to short Cava", "score": 12, "replies": [{"body": "Yah I thought this too. Volume totally imploding after that insane day. Seems precarious.", "score": 14, "replies": [{"body": "Thought about shorting it at 40. Probably don’t feel like playing hot potato though.", "score": 1, "replies": []}]}]}, {"body": "Where is your gain porn then?", "score": 13, "replies": []}, {"body": "Balance sheet propped up by offloading assets haha gl cava longs", "score": 3, "replies": []}, {"body": "How can cava be a good business? Is sweetgreen a good business? Idk man", "score": 7, "replies": [{"body": "Same can be said of chipotle. They sell a lot of food and are opening new stores. That’s how.", "score": 3, "replies": [{"body": "Except they NEED TO SCALE to 1000 stores to compete with CMG. Currently 318 locations", "score": 1, "replies": [{"body": "You don’t have to have the same store number to compete lmfao, chipotle is their biggest competitor. Cava is in its growth stage. Chipotle is not. Of course chipotle has more stores you Buffoon", "score": 4, "replies": []}]}]}, {"body": "It’s delicious AF, expensive and always seems packed.", "score": 2, "replies": []}, {"body": "They put them near big offices in nyc and they are always PACKED for lunch takeout, marked up asf", "score": 3, "replies": [{"body": "Bro I bet SBUX was once packed too, now there's a Blank Street everywhere theres a SBUX in NYC. I'm not sure lunch hour is a valid argument here.", "score": 4, "replies": []}]}]}, {"body": "Just buy leaps.", "score": 6, "replies": [{"body": "Dec 24 put leaps are stupid cheap right now, plenty of time for it to tank", "score": 6, "replies": [{"body": "Low IV, if you are patient it could pay off.", "score": 2, "replies": []}]}]}, {"body": "So glad I finally listened to my brain. Didn’t have calls but at least I didn’t lose more on puts lol!", "score": 2, "replies": []}, {"body": "Well now all those same idiots would pile into calls and that’s when it gets dumped.", "score": 2, "replies": []}, {"body": "I lost $300 in weekly puts on the play, but the DD was reasonable. You win some, you lose some.", "score": 2, "replies": []}, {"body": "There’s no incentive to dump it when you can get more value pumping it then dumping it on retail and now that their lock up period expired it’s game on.", "score": 3, "replies": []}, {"body": "the lockup means stocks guaranteed to go down bro trust me bro it's not priced in by the institutions already bro", "score": 3, "replies": []}, {"body": "They clearly don’t understand how hedging works especially with a million more put flow than call flow 😂😂 The moment I saw the OI on the put side, I knew this come but I was too much of a chicken shit to buy an actual call.", "score": 3, "replies": [{"body": "Whered u see OI", "score": 2, "replies": [{"body": "I use barchart but I’m sure your brokerage can show you as well. I believe Robinhood still does. Just click on whatever put/call you want to buy and it’ll give you the open interest.", "score": 2, "replies": []}]}]}, {"body": "Lmao what idiots. \n\nI was going to buy puts but I completely forgot. That’s my trading secret. Shit memory", "score": 2, "replies": []}, {"body": "Lol. I thought of this today.", "score": 1, "replies": []}, {"body": "https://preview.redd.it/8rrsjnfp4z5c1.jpeg?width=1170&format=pjpg&auto=webp&s=bd8300524d4f06396667f1329108428653e9c987\n\n🚀🚀", "score": 1, "replies": []}, {"body": "I want this to drop not because I shorted it because I want to scoop it on sale. I’m a huge fan of their food, I think every college in the US should have a Cava just like they all have chipotles", "score": 1, "replies": []}, {"body": "I was waiting for this.  Lol lol lol lol", "score": 0, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Good bot.", "score": 1, "replies": []}]}]}, {"body": "Thanks for the follow up 🤣", "score": 0, "replies": []}, {"body": "So glad I stopped believing in any WSB drivel in 2022", "score": 0, "replies": []}, {"body": "Oof", "score": 0, "replies": []}, {"body": "…why would anyone short cava? Have you fucking TRIED IT? It’s incredible. It shits on every other casual dining establishment", "score": -4, "replies": [{"body": "it's pretty good, costs too much though. I think $15-$16 is average, some items at $17 or $18 after tax. the Avocado Harissa bowl is like $19 after tax", "score": 2, "replies": []}, {"body": "I'll try it tomorrow and report back. I'd do some awful things for something that tastes like the Olga's pita burgers I used to have back in the day.", "score": 1, "replies": [{"body": "Never heard of Olga’s, but you’re really in for a treat. It’s basically chipotle but Mediterranean food instead of Mexican, you build bowls and what not. I could eat it everyday", "score": 2, "replies": [{"body": "Nice! Anything specifically you recommend from them? Here's Olga's btw:\n\n[https://www.olgas.com/menus/#classic-and-signature-olgas](https://www.olgas.com/menus/#classic-and-signature-olgas)\n\nThey were all over the country back in the 80's 90's but now pretty much just in Michigan", "score": 1, "replies": []}]}]}, {"body": "Always packed for those corporate lunches", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}
