{"title": "[deleted by user]", "selftext": "[removed]", "id": "18ic52w", "created_utc": 1702570561.0, "score": 21, "upvote_ratio": 0.62, "num_comments": 75, "comments": [{"body": "People from Phoenix are called Phoenicians.", "score": 79, "replies": [{"body": "I thought they wer called retired Canadians.", "score": 27, "replies": [{"body": "Ive been calling them Loonies.", "score": 3, "replies": []}, {"body": "Socialist carpet baggers.", "score": 2, "replies": [{"body": "And the smell like maple syrup!", "score": 1, "replies": [{"body": "The stench of Communism.  They should have to keep that shit north of the border.", "score": -5, "replies": []}]}]}]}, {"body": "\"Shut up fggot!\"", "score": 2, "replies": [{"body": "\"Quit being a fggot and suck that dick!\"", "score": 3, "replies": []}]}, {"body": "How do you pronounce that?", "score": 1, "replies": [{"body": "Fun-knee-shins", "score": 4, "replies": []}]}, {"body": "Mexinicians", "score": 1, "replies": [{"body": "Doing the jobs the fun-knee-shuns won't do.", "score": 2, "replies": []}]}]}, {"body": "If you really believe this, where are your positions?", "score": 21, "replies": [{"body": "He def has otm spy calls and got nervous when spy dropped this morning", "score": 17, "replies": [{"body": "I don’t do spy at all, just voo. Bought the majority of it near the bottom of the crash and accumulated since then. Believe my original purchase was 20 shares around 348.\n\nhttps://imgur.com/a/Wa5wWBA\n\nThe rest of what I own is meme shit", "score": 5, "replies": [{"body": "ooh, shares.  big baller here.", "score": 4, "replies": [{"body": "I mean... it's only 32 shares lmao", "score": 3, "replies": [{"body": "Too bad it wasn't vug, or ITV or QQQ. Get good.", "score": 1, "replies": []}]}]}, {"body": "Same, been buying VOO every week since late 2021 and put in a few lump sums in between 340-360. \n\nExtremely happy with this decision. Not as happy as buying Tesla in 2017 though haha. I'll probably never sell that. I continue to buy Tesla even today. Every day honestly.", "score": 2, "replies": [{"body": "Presumably at this point you just don't want to ever deal with the capital gains.", "score": 1, "replies": []}]}]}]}, {"body": "https://imgur.com/a/Wa5wWBA\n\nBought the majority of it when it was around 350~ and accumulated since then", "score": 1, "replies": [{"body": "Best of luck.", "score": 1, "replies": []}]}]}, {"body": "Well I just bought calls so….. here comes the dip", "score": 6, "replies": [{"body": "RIP", "score": 1, "replies": []}, {"body": "This checks out", "score": 1, "replies": [{"body": "Dude it actually dipped 😭😭😭", "score": 1, "replies": [{"body": "You either need higher tolerance or lower size", "score": 1, "replies": []}]}]}, {"body": "You’re 95% of the way through inversing yourself strat", "score": 1, "replies": []}]}, {"body": "Spy 550 feb 2024", "score": 11, "replies": [{"body": "You’re gonna make me bust. stop it", "score": 3, "replies": [{"body": "Chuck a few quid on a ~d25 call, just for kicks. You’ll likely quietly thank you did. There’s no need to go full 🌈🐻", "score": 2, "replies": []}]}, {"body": "I want you to be right so I can paint my walls in coom", "score": 1, "replies": []}]}, {"body": "Does anyone truely believe we have an actual recession around the corner ?", "score": 9, "replies": [{"body": "Ask the bears in here lmao", "score": 12, "replies": []}, {"body": "Yes. Literally 100% of the time that the fed has cut rates we have entered a recession. You can look it up. 100% of the time. The fed cuts rates only bc something has broken.", "score": -1, "replies": [{"body": "that's not true at all lol. they cut rates in december 2018/2019 during the trade war when we were nowhere near a recession and rates were like 2%. They also cut rates during the 2015 euro crisis.", "score": 4, "replies": [{"body": "It is true. https://www.macrotrends.net/2015/fed-funds-rate-historical-chart\n\nIt doesn't matter if it was years later or if they had to raise rates again after lowering, 100% of the time after rates were lowered we entered a recession some time after.", "score": -3, "replies": [{"body": "100% of all history has happened before this comment was posted. What an arbitrary argument your making.", "score": 7, "replies": [{"body": "It isn't arbitrary and it isn't an argument. It's fact. When the fed cuts rates, historically, 100% of the time we entered a recession.\n\nIf you want to ignore that, that's totally fine with me, but it def isn't arbitrary. In fact, it's literally the exact opposite of arbitrary. \n\nJPow even mentioned it in his speech yesterday. He even said one of the reasons you cut rates is bc something is broken (in not so many words, though).", "score": -1, "replies": [{"body": "You're trying to say that if we *ever* enter a recession after cutting rates, no matter how far out, it's directly related to the rate cuts. You can't see that that's a stupid argument?", "score": 5, "replies": [{"body": "That isn't what I'm saying... Actually, I'm not saying anything. It's what the data says.\n\nDid you even look at the data?\n\nI guess I need to be more specific with ppl like you, but typically within 5 years or so of cutting rates we enter a recession. It depends if the fed has to re-raise rates after initially lowering them, though.\n\nIt is common knowledge that the fed starts lowering rates only once they have accomplished their goal of cooling the economy, in which something usually breaks. That's why they raise rates in the first place. To slow the economy.\n\nAgain, it isn't an argument. It is 100% fact.\n\nIt is also why you see a recession after the yield curve uninverts. When the curve inverts, a recession has also followed 100% of the time, but not until we uninvert.", "score": -2, "replies": [{"body": "The point is that going out as far as 5 years means the recession could be totally unrelated to whatever caused them to want to cut rates. It's a useless correlation at that point. \n\nDon't try to talk down to people when you're making a dumbass comment you don't understand.", "score": 2, "replies": [{"body": "It isn't a useless correlation. Just because you can't wrap your head around it doesn't mean I don't understand it.\n\nIf we enter a recession in 2025 it will ultimately be bc of what happened in 2020. These things take time to work through the economy. Regardless of if the catalyst is some bank failing - that ultimately happened bc of all the stimulus in 2020. Which is why we had crazy inflation, which is why we had to raise rates, etc..\n\nUltimately, I never stated WHY we entered a recession as the WHY doesn't matter. I simply showed you the fact that once the fed cuts rates, we enter a recession soon after. IT IS A FACT.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "*five years later* “SEE?! RECESSION CUZ RATE CUTS! I KNEW IT!”", "score": 0, "replies": [{"body": "Typically it only takes that long when the fed has re-raised rates after initially lowering them.\n\nThese things take time to work their way through the economy. \n\nAnd I'm not saying the recession is bc of rate cuts. I'm saying when the fed cuts rates, a recession follows soon after.\n\nYou can mock all you want but the data shows it is a 100% fact that once the fed starts to aggressively cut rates, a recession follows. Idk why that's so hard for you to understand - it's literally in the data. It isn't my opinion.", "score": 0, "replies": []}]}]}]}, {"body": "Did the action of them dropping rates cause a recession or were they in response to a recession? Others here say you are lying and wrong how can I trust you?", "score": -1, "replies": [{"body": "https://www.macrotrends.net/2015/fed-funds-rate-historical-chart you could literally do your own research.", "score": 0, "replies": [{"body": "Dude you are saying that there is 100% guaranteed recession next year? Did you say this in 2022 like the other megabears did? Tell me when bottom so I can time it and buy. I missed the entire run this year because I listen to bears tell me go all cash because recession croosh is coming 2023 now I’m going through this all over again don’t tell me the same bs", "score": -1, "replies": [{"body": "I'm not saying there is 100% chance of recession next year. No, I didn't say that in 2022. \n\nI'm just providing tangible data and facts, which you can ignore if you want, that's entirely up to you.\n\nHowever, what I'm saying is history has shown that 100% of the time the fed has cut rates, we have entered a recession sometime within the next 5 years (the recession takes longer to hit if the fed lowers rates, then has to raise them again).\n\nI never said I could pick the bottom. I never told you to go all cash. I never said a recession was coming in 2023. I said I think a recession is coming solely based upon history. Even so, past performance is not indicative of future results, so we may not enter a recession... But if I were a betting man, I would say that yes, based upon history, I would bet we enter a recession in the near/medium term future.\n\nWith that said, if you also look at the charts, we typically rally hard before falling. Like in 2008 we rallied 15% once the fed announced cuts. Then dropped a little and actually had another 10% rally before finally falling.\n\nMaybe you should stop listening to people on the internet for financial advice and start accepting some responsibility for your decisions instead of blaming other ppl bc of what they told you. I'm not giving you advice, or predicting when a recession will hit, I'm simply providing you facts.", "score": 0, "replies": []}, {"body": "God. There was a recession in 2021 or 2022. Why does everyone equate collapse with recession?", "score": 0, "replies": [{"body": "Because that’s what they said on r/rebubble and I learn my economics from there.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Gai bares", "score": 0, "replies": []}, {"body": "Ask any mega doomer bear. They say huge crash is cooming.", "score": -1, "replies": []}]}, {"body": "Thought-provoking perspective! Makes me wonder how high SPY could climb with today's inflation. Bold take, issuing a challenge to the bears here.🚀🐻‍❄️", "score": 8, "replies": [{"body": "Bers ded", "score": -1, "replies": [{"body": "JPow murder bers wid pritner 🖨.    Brrrrrrrrrr", "score": 1, "replies": []}]}]}, {"body": "Girl math", "score": 4, "replies": [{"body": "Flair checks out 💅🏻", "score": 2, "replies": []}]}, {"body": "This is only true in terms of what you could sell your stocks for and get in return, in consumer goods. The money supply has decreased since 2022, so in that sense we are far above all time highs.\n\nBasically your stocks are worth less than they were two years ago because the price of everything else is higher.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "New bull market. F your puts", "score": 5, "replies": []}, {"body": "🏳️‍🌈🐻 are fuk", "score": 10, "replies": [{"body": "Gay bears are fucked or are fucking?\n💀", "score": 2, "replies": [{"body": "fukt", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "I’d be offended by that if I knew how to read", "score": 8, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}, {"body": "People fail to realize last ATHs were before we added trillions of dollars into the economy. we are no where really close to the proportional ATH\n\nI've been long since Nov 2021 when we dropped like a rock. My option trader buddies have been saying \"this market isn't real\" to me and that I should be careful for the last 2 years\n\nNow I'm certain that they wish they did what I did because they don't even talk to me about the market anymore. And I don't rub it in either. We all make choices", "score": 2, "replies": []}, {"body": "Hello fellow person who realizes market is SEVERELY undervalued.\n\n&#x200B;\n\nAll the naysayers will be gone when we go on the next multi year bull market. It's funny how history repeats itself and the same naysayers never get revealed as blatantly wrong.\n\n&#x200B;\n\n![img](emote|t5_2th52|4258)", "score": 2, "replies": [{"body": "\"SEVERELY undervalued\"\n\nThe S&P500 PE and Shiller PE ratios are above long term average though. Seems barely undervalued at all.", "score": 1, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|3 years ago\n**Total Comments**|349|**Previous Best DD**|\n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "It's funny how all time highs are never adjusted to inflation.", "score": 1, "replies": [{"body": "In all fairness inflation is usually not 10% over a span of a few months. But you're not wrong", "score": 2, "replies": []}]}, {"body": "Bulls are definitely tripping. Also fear and greed index almost at very greedy.", "score": 1, "replies": []}, {"body": "Yes, I feel like we will hit that or close to inflation adjusted ath before the market crashes again. Bull", "score": 1, "replies": []}, {"body": "Lol that isn't how this works. Previous prices don't get adjusted for inflation. Yes, we are 100% close to ATH. Got within 17 points this morning.", "score": -4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Nope. Just facts. How is saying we are close to ATH a bearish statement?", "score": 0, "replies": []}]}]}]}
