{"title": "How to survive the crash of the ‘everything bubble’", "selftext": "", "id": "vb8wo4", "created_utc": 1655115571.0, "score": 62, "upvote_ratio": 0.9, "num_comments": 45, "comments": [{"body": "Not selling . Thinking of buying more . We can’t control macro economic factors", "score": 35, "replies": [{"body": "These are not macro economic factors but widespread corruption and shenanigans. Stock market is a roulette wheel and the house always wins. \n\nTake action, invest in companies you believe in and want to see succeed, and together you shall grow.\n\nObv. Not financial advice :)", "score": -6, "replies": [{"body": "Both. It’s both.", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 17, "replies": [{"body": "Getting killed on USD Contract into GBP salary.  Damn strong USD.", "score": 2, "replies": []}, {"body": "On sane person here", "score": 2, "replies": []}]}, {"body": "Sqqq, working for me. It's balancing my hemorrhaging portfolio right now.", "score": 8, "replies": [{"body": "Seriously. I’m up ~70% right now. Considering buying more at open.", "score": 5, "replies": []}]}, {"body": "i have %65 cash,i am waiting for another%30 crash then start buying", "score": 3, "replies": []}, {"body": "Cash", "score": 15, "replies": [{"body": "The loss to inflation may be less than the loss in the markets --short term anyway.\n\nVIX -> 33.05 when the VIX gets down ...", "score": 10, "replies": [{"body": "Wow VIX up 18% today", "score": 2, "replies": []}]}, {"body": "Cash loses value by inflation. Repo your cash if you must at the very least.", "score": 2, "replies": [{"body": "I plan on putting the cash back in, just waiting for the next leg down and earnings season to confirm that, I feel we’re reverting back to the mean for sp500 eps of roughly 170-175ish 17pe putting it around 3000ish", "score": 2, "replies": [{"body": "Summer season and Wall street will be on the beaches with low volume until Sept?", "score": 2, "replies": [{"body": "Will be interesting to see, there’s a lot going on in the world, would be hard to see volume being low throughout the summer , might see a period of complacency but I feel the cpi report confirmed that markets have no idea how to call a top on inflation and even if there is a drop in inflation for June, which I don’t believe there will be, they’ll continue doubting it due to this previous reading, peak inflation might not happen until late 2022 early 2023 unless demand destruction take place imo", "score": 3, "replies": [{"body": "Who will be the first news channel or talking head to shout \"we are now in a recession!\"", "score": 2, "replies": [{"body": "Lmao we’ve been in a recession, just waiting for that q2 negative gdp at this point, why you never listen to that talking heads", "score": 3, "replies": []}]}, {"body": "If the 70s is anything to go by, only a massive economic crash will fix the inflation problem which we have not seen yet.", "score": 1, "replies": [{"body": "Shaping up to be Japan 1990s IMO \n\nStarted out at 2.2% ended up 5%+", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Moron", "score": -22, "replies": [{"body": "Yes you are, don’t be so hard on yourself", "score": 14, "replies": [{"body": "Go ahead sell lol then i wont need to see you in here", "score": -18, "replies": [{"body": "Bag-holder spotted", "score": 12, "replies": []}, {"body": "I’ve been sitting in cash since January, only thing I have on are puts on Zillow ARKK DKNG VGK", "score": -2, "replies": [{"body": "I was gonna b mean to you then i saw you are a mets fan like me. We need degrom back", "score": 0, "replies": []}, {"body": "Those r some good puts for trash ass companys lol wish u could make puts on the mets😂", "score": -2, "replies": [{"body": "Wow hit on a nerve on this one, have a great day losing money!!!", "score": 0, "replies": [{"body": "I was being serious i love the mets", "score": 2, "replies": [{"body": "Lmfao Yes to your other comment", "score": 2, "replies": [{"body": "I think we got a shot this year. Degrom needs to come back tho", "score": 2, "replies": [{"body": "Yes I would agreed, hopefully a big trade at the deadline", "score": 1, "replies": [{"body": "Jose ram would be nice and hes lindors buddy. But idk where u put him.", "score": 1, "replies": [{"body": "Doubt it after that extension he signed but would have been great", "score": 1, "replies": [{"body": "We prob need pitching anyway and a lefty bat. Maybe a relief pitcher", "score": 1, "replies": [{"body": "Certainly pitching", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Pete mvp", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "TIPS", "score": 1, "replies": []}, {"body": "You survive by selling.", "score": -23, "replies": [{"body": "Why would\nYou sell now?", "score": 8, "replies": [{"body": "I sold ages ago. I'm just saying that to survive any crash, you need to sell. There is no other way if you want to preserve your capital. I suppose you can hedge, but that's too complicated for most people.", "score": -5, "replies": [{"body": "No crash is permanent. Also I have a paying job. That’s how I will Survive. Your points make no\nSense", "score": 9, "replies": [{"body": "Sure, but it's about being efficient with your money. I don't want to wait around. I also have no idea how bad things will get, so I cut my losses quickly.", "score": 0, "replies": []}]}]}]}, {"body": "Only morons sell", "score": -10, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Thats ok", "score": -1, "replies": []}]}]}]}, {"body": "Buy, buy, buy, all the way down! You'll be sitting pretty on the rebound", "score": 1, "replies": []}]}
{"title": "RDBX Missing the real issue", "selftext": "I know that a few are talking about the options, but most of the chatter is about the short interest.  I think traders have this backward.  I made a ton of money in the GME squeeze, but I lost money for months prior in options trying to time it, having it beaten down by Gabe and Andrew time after time.  The shorts were able to manipulate it until enough attention was drawn to the short float which turned it into the gamma squeeze.  You should be focusing on the gamma squeeze, knowing that it’s what ends up forcing the shorts to capitulate.  \n\nI believe that this is going to be easier to time than GME because the float is so small that it’s easy to see that the gamma squeeze has already begun (on a Friday with big call OI expiring OTM).  There are 76m shares of GME in existence, while this has 12.6m.  GME was like trying to get the Titanic to take off like a rocket in that we had to get all those shares moving.  It was also the first time that social media played a huge role in a squeeze.  This has 6x less shares OS (36x less if you consider float of 1.95m), and is a much worse math problem for both shorts and MM’s because of the Gamma risk.  On top of all that, all of social media (and really everyone in the United States) is waiting for the next GME because it’s all the country talked about for a week, and FOMO is real.  This post will lay out why this math is more compelling than GME (I never thought I’d say this, as I never thought shorts would be dumb enough to let it happen again).\n\nI want to make it simple so people without that much experience can understand it.  There are many things to consider when trying to predict a squeeze, but I think there are two things that matter most: short interest as a percentage of float, and gamma risk as calculated by call options expiring ITM as a percentage of float.\n\nGME had a short float of 141%.  However, at the time of the squeeze the market cap was much bigger.  I can’t remember how many call contracts were expiring ITM on the Friday that began the squeeze when it went from $42 to $76, but it’s likely that that it wasn’t crazy, as a percentage of float, because it had a market cap of $3.5b (maybe someone can look up that historical data).  Typically a stock will close less than 1% of call options in the money as a percentage of float.  In gamma squeeze situations this is higher… maybe 8-12%.  So let’s say GME had 20% of options as a percentage of float expiring ITM on 1/22/21… that’s why it began to rocket that day… the shorts simply couldn’t push harder than the MM’s who needed to hedge their gamma risk anymore.\n\nWith a short interest of over 220%, RDBX is far worse for shorts than GME.  But the one thing they have going for them is that at Friday’s close with a market cap of $166m, RDBX has a much smaller cap than GME did so they can still push it around… But something changed yesterday.  According to Thursday close numbers (without Friday trade which was huge volume), RDBX had 19k contracts (1.9m share equivalent) close ITM.  That’s 97% of available float that needs to be delivered!  I’m pretty sure this has never happened before, and is why the squeeze began yesterday.\n\nBut the thing that is absolutely mind blowing about the RDBX squeeze is that you can argue that the real squeeze hasn’t even started yet.  When you look at next weeks call OI (again, at Thursday close, excluding Friday trade), you see that this coming Friday at the 6/17 triple witching expiry there are 59k contracts ITM at the $13 strike and under.  Between yesterday and this coming Friday, 4x of the float (and 80% of all shares OS for that matter) will have call options that are ITM.  \n\n220% short float + 300% OI calls expiring ITM… This is absolutely mind boggling to me.  With options volumes in the markets the highest they’ve ever been, I’m pretty sure there has never been a setup like this.  The math here is so much more compelling than GME.  \n\nI’m excited at the potential of making a life changing amount of money, but also have that same feeling I had with GME and what made me get out at the right time.  I was prepared to hold GME into the thousands because I knew that I had the math right.  I was like “the only way this doesn’t happen is if they kill it, and if they don’t kill it, it’s going to crash the market”.  So I didn’t have an exit price target… I had a “sell when they crush it” target.  The morning it broke that RH and IB were turning off the buy button, I, like many, sat in disbelief for a few moments, knew that was it, and then sold.\n\nThe math here is much more compelling and I’m pounding the table even harder.  This squeeze IS going to happen this week if they don’t crush this thing early Monday.  I don’t have an exit target… I have a “I don’t know how they make this stop, but when the excuses start rolling in on why it has to stop”, that’s my exit.", "id": "vb64tm", "created_utc": 1655103619.0, "score": 13, "upvote_ratio": 0.64, "num_comments": 40, "comments": [{"body": "Lets have a look. RDBX has 4m shares short and 18m average volume, and 74m on Friday. \n\nIt might go up due to the \"squeeze\" narrative. But there is not real squeeze happening.", "score": 11, "replies": []}, {"body": "Be careful GME built up this came out of no where and MSM seems to cover it positively.", "score": 8, "replies": []}, {"body": "So they killed GME to live, do you believe they’ll kill   RDBX so they can live?", "score": 3, "replies": [{"body": "If RH shuts down the buy button on RDBX, I think worse will happen to their HQ than human feces being thrown at their door.", "score": 2, "replies": [{"body": "I guess time will tell", "score": 1, "replies": [{"body": "They already did. Can’t buy options anymore. On any broker.", "score": 2, "replies": [{"body": "Exactly. My point about that was it all started with GME and they’ve pretty much got away with it so far. So why won’t they kill any other stock and still take your money? So until then I’m helping trying to break the system", "score": 1, "replies": []}]}]}]}]}, {"body": "Yes you are missing the real issue. Chicken soup for the soul is buying redbox for .87c a share.\n\nYes your shares are worth less than $1. Hedge funds know this. They are not worried at all because as time goes on they will just buy up a very small amount of shares (4 million short shares on already 18m volume for the day is plenty of time to escape had they wanted too) as you all clamor to retain something of value in your play.\n\nTake. Profits. And do not look back. Period.\n\nMarket makers having to create liquidity because there are buyers and options chain going wild does not mean legitimate short squeeze here.", "score": 3, "replies": [{"body": "Yeah, and 74m shares traded on Friday was enough liquidity to get out if they wanted to, yet net shares short INCREASED.  Also, I can tell you from experience that trade this morning has not felt like covering is happening.", "score": 2, "replies": [{"body": "Your missing the point of my post. \n\nThey will never cover shares above $1.\n\nThe shares are on book being purchased for 87 cents man. They have 0 interest in this game until they need to close out right before the acquisition.\n\nThis is such a terrible play and the reason there is a net increase in short interest.", "score": 6, "replies": [{"body": "What if when the deal closes there are more shares in peoples accounts than outstanding? That is what I am interested in.", "score": 2, "replies": [{"body": "Well if you think the price before the deal is gonna be higher than a dollar your crazy.", "score": 1, "replies": [{"body": "You are right about it’s value. The issue is hypothetically if more share are in circulation than actually are when they deal happens. Shorts need to return their shares. If apes legit hold shares and don’t sell, they could  demand the price for their shares.\n\nNot saying this at all will happen, but set up for an interesting situation to follow. I bought 20 shares because, why not 🤷‍♂️", "score": 2, "replies": []}]}]}, {"body": "Everyone understands that it’s a squeeze play and not something long term.  The gamma risk to market makers that’s being created here is monstrous, and if they can’t push it below $12-13 by Wednesday, you’re gonna see why this is not a terrible play.\n\nI mean, it already isn’t, I’ve up 25 bags on my calls and have removed 700% of my cost basis already.", "score": 2, "replies": []}]}]}]}, {"body": "This belongs to r/Wallstreetbets. Let us know when you are on the Moon.", "score": 6, "replies": []}, {"body": "There was no GME squeeze and the fact you think that shows how little you actually know about the market. Go back to w s b", "score": 11, "replies": [{"body": "the term \"squeeze\" is one of the worst thing that's come out of this whole GME meme craze. not everything is a fucking squeeze. in fact, almost nothing is.", "score": 16, "replies": [{"body": "Exactly! There have only ever been 4-6 legitimate squeezes in the history of the stock market and most of those were due to regulatory issues which have since been altered.", "score": 7, "replies": []}, {"body": "If you two clowns think GME didn’t “squeeze” then I don’t know what to tell you… maybe go back to your day jobs.  GME was a gamma squeeze followed by a short squeeze.  The short float fell from 140% back to 20%… that’s the definition of a squeeze.\n\nRDBX is in that process now.", "score": 2, "replies": [{"body": "The gme january sneeze was just fomo bro. MOASS IS TOMORROW.", "score": 0, "replies": [{"body": "The report released by SEC says that the drive up in price was retail buying in. Shorts never covered. After the sneeze, msm went to report that shorts wanted to declare that they covered and there isn’t anything to see anymore. THAT WAS A LIE. Sorry to burst your bubble kid but they don’t care where your money goes if they are making money off of you. Unless their money is in trouble then that’s when they suddenly care where your money goes. That’s why a particular idiosyncratic stock is going to rocket soon. Positions were never closed. A few covered perhaps. But never *closed* any short positions.", "score": 3, "replies": [{"body": "What evidence do you need to see to confirm that short positions get closed?", "score": 2, "replies": [{"body": "The evidence would have to be when GME actually starts running in leaps. Which would be when our DRS numbers get close to 80%-90% of the entire float and we’ll start seeing some action if whether it’s true or not. Look up the official short report from the SEC about the action from January 2021. Tits are *jacked*", "score": 1, "replies": [{"body": "Is there even a catalyst that might force direct registration? (I struggle to think of one absent Congress's sudden and inexplicable desire to make stock ownership a nightmarish hassle for all involved.)\n\nAlso, is there a place that the public can look up that percentage?\n\nIf you're waiting for DRS, you're gonna be waiting until the 2nd coming, I think.", "score": 3, "replies": [{"body": "The catalyst that you’re speaking of isn’t forced, it’s a decision that people are taking upon themselves. Investors are choosing to DRS their shares because many believe that there are much more shares than are available due to over the top naked shorting. They went overboard with it and were confident that they weren’t gonna get rekt. There is speculation that we’ll receive a dividend but you have to own your shares for that. If you have them with your broker, you are a beneficiary owner. Which means your broker has it in their name. Not yours. But you kinda have part ownership. *kinda* this dividend will go to the real certified shares. If your broker gets the dividend and your share isn’t real, they will give you something else of a equivalent. Could cost you some potential future gains. And they are in control of your shares too. It can blow up and they’ll sell for you in special events. It’s in their terms and conditions. So considering gme can be a black swan event, people are taking no chances. DRS itself is a catalyst to DRS and that leads to gme potentially having the biggest event. Market is falling. Gme is holding up okay tho. Isn’t it weird? \n\nYeah the place you can look how DRS is going for gme is in recent gme filings. They list the drs numbers. I heard it’s rare for any company to do that. You’ll have to do some math to calculate the percentage. \n\nWe can wait for DRS but it serves many purposes. We just want to own our shares. Other catalysts are Marge calls and dividends and marketplaces. They can create more buying pressure and drs.. another note, The SEC is making fun of meme stocks and investors who invest in them in their recent YouTube video. Rather peculiar isn’t it? SEC raising red flags about actual companies and saying “they are considered meme stocks…don’t put your money there” 2nd coming? We’ll wait however long we have to. Nothing to lose, we got loads of time…..and I just like the stock.", "score": 1, "replies": [{"body": "Hahahahahaha. You really drank *all* the kool-aid didn't you. Good God man nobody is going to DRS their shares. This is like flat earth or young earth conspiracy shit. Have fun.", "score": 1, "replies": [{"body": "Not all the kool aid, just a little bit. *sigh* well you can lead a horse to water but you can’t make it drink. \n\nHow are you telling me that nobody is drs’ing their shares when the official filings are saying otherwise? Literally every 3-4 months, drs numbers go up and are NOT slowing down. Not even comparable to young earth or flat earth brother, the facts are all there. You just choose to close your eyes. Have fun with your blue pill.", "score": 1, "replies": []}]}]}]}]}, {"body": "Short interest went down?  Number of returned shares matched the rate?  I don’t get it what evidence are you looking for…", "score": 1, "replies": [{"body": "Huh? I'm not the one who says that people haven't closed their shorts. That's the other guy. I'm asking him what evidence *he* needs to see. Because I *do* see that GME's SI has gone down since Jan 2021.", "score": 2, "replies": [{"body": "Oh, my mistake!", "score": 1, "replies": []}, {"body": "SI is what someone else is reporting right? Who says the numbers are accurate and they won’t give a false number? I learned not to look at the data nor the numbers for this particular stock, I look at its upcoming future and it’s leader who has a history of making nothing to a huge something. Gme also has a major cash reserve. That itself is Very bullish. There is some funny business happening with this stock behind closed doors to hide accurate numbers and info. Even some lies are thrown around to sway the public into not throwing their money into gme. Whether something big happens or not, I’m enjoying the ride.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Tell me you have no clue what a squeeze is 😂😂 moron. There has only ever been 4-6 actual squeezes in the HISTORY OF THE ENTIRE STOCK MARKET. You fkn clowns have no idea what you’re spouting.", "score": 1, "replies": []}]}]}]}, {"body": "Buying puts at open then. Going to dump harder than a cloud burst in the tropics.", "score": 2, "replies": []}, {"body": "Is there a chance the merger finalizes soon and RDBX holders get .087 shares of CSSE for every share of RDBX?  \n\n\nAnd why do the numbers on the float vary so much between sources?", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "vbfe2u", "created_utc": 1655135767.0, "score": 0, "upvote_ratio": 0.48, "num_comments": 39, "comments": [{"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Because ***hyper***inflation refers to rates of 50% per month or higher.\n\nThere should honestly be a ban on this term here.  And no one thinks the terminal rate is just 1.5%.", "score": 36, "replies": [{"body": "I wasn't sure so I Googled it and hyperinflation has never happened in the USA. Didn't even officially get half way. How useful is a term that describes a situation that's never occurred? Maybe the term should be banned altogether 😂", "score": 5, "replies": [{"body": "It's happened in places like Venezuela.  But this underscores the ridiculousness of people on this sub saying it is about to happen in the US on an almost daily basis.\n\nAnd the US hasn't even gotten close to half of hyperinflation.  The highest inflation rate we've ever had was just under 30% year over year, and that was in 1778.  Hyperinflation is 50% **per month.**", "score": 10, "replies": []}, {"body": "because it's not meant to describe a common possible outcome of monetary & fiscal policy, it's meant to describe a few extreme fringe cases that have occurred such as Weimar Germany, post-WWII Hungary, and Zimbabwe", "score": 5, "replies": [{"body": "Exactly.  This should be a sticky.", "score": 3, "replies": []}, {"body": "What's the middle ground then? This period of inflation is far above what most would consider normal but evidently 'superinflation' is not a word at all so the next best thing apparently only describes a historical phenomenon.", "score": -1, "replies": [{"body": "Very high inflation, inflation similar to the 70s, inflation worse than the 70s, using specific rates like \"what's to stop inflation from reaching in excess of 40% per year\" etc", "score": 1, "replies": []}, {"body": "high inflation", "score": 1, "replies": []}]}]}, {"body": "Well it never happened ever here in Hungary until it did.", "score": 1, "replies": []}]}, {"body": "OP's take isn't completely off. If nothing is done, hyperinflation isn't off the table considering how much cash has been injected, the current level of inflation, and the fact that our economy hasn't fully re-opened yet. But yes, hyperinflation is always caused by a failed government and you would expect them to raise interests a lot more than they did.\n\nBut like OP suggests, more ***must*** be done.", "score": 1, "replies": [{"body": "We are at 8% annually right now.  We'd need to get to 600% annually or higher to have hyperinflation.  This is an absurd conversation.", "score": 1, "replies": [{"body": "Hyperinflation isn’t a linear function, but very much exponential. OP is saying if they let inflation settle in, it gets even harder to contain. No hyperinflation in history happened by design. Every single one took place by lack of action. OP is pointing out that lack of action.\n\nI agree that the government probably won’t let that happen, but if they keep waiting for the next election cycle, it’s not a ridiculous conversation to have.", "score": 1, "replies": []}]}]}, {"body": "Okay- so what’s going to stop it from\nHappening?\n\nObviously it’s not happening now. That’s why I’m asking what’s preventing it from happening?", "score": -8, "replies": [{"body": "The Fed will stop it.  We only got to 8% before the Fed started hiking.  What makes you think we can get to 600%+ with the Fed taking action?  This is sort of like asking what will stop me from weighing 2,000 pounds next year since I gained a pound last week.", "score": 8, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Yes they can.  What do you think demand destruction is?  It takes months for rate hikes to ripple through the economy, and the Fed is just getting started.  The only question is how high rates have to go and how much economic collateral damage there will be.  The Fed's lever is blunt and crude, but it can get rates down.  \n\n\nThe Fed hasn't done everything possible.  They just started.", "score": 5, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "It's been months since the first Fed hike.  The Fed will be hiking for months more.  We won't see the total effect of the rate hikes until next year.", "score": 5, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "You asked about what inflation is going to do.  How is that not inherently a matter of prediction?", "score": 2, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": ">Please educate me- how is hyper inflation not in the cards considering how the federal response to inflation has been so mild?\n\nHow is the above not a statement about the future?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "My bad.  You did say this, though: The problem is the Fed can’t stop it.\n\nHow is that not a prediction?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "The fed can easily stop it. Want to stop inflation? Jack up rates to 25% tomorrow. Inflation will stop. And so will everything else in the economy. The fed is trying to stop it without crashing everything else in the process. That's hard to do with nothing but interest rate adjustment and QT.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I think they are afraid to raise rates too quickly and risk a deflationary spiral. Deflation is more dangerous than inflation and much much harder to stop. \n\nConsumer rates have gone up much faster than the fed rate too. Which means they are using the bully pulpit too. People are anticipating rate hikes, which is almost the same effect as raising rates, without actually raising them. It just takes time to feel the effect.", "score": 1, "replies": []}]}]}]}, {"body": "The fed isn’t stppping inflation now though…", "score": -10, "replies": [{"body": "Yes, they are.  They just started.", "score": 9, "replies": []}]}]}, {"body": "Just stop it. FUD. Stop spreading shite", "score": 1, "replies": []}, {"body": "It is not valid, it is ignorant...quite a difference.", "score": 1, "replies": []}]}]}, {"body": "Hyperinflation is more than 50% inflation per month. We are at 8.6% per year. \nStop it with this alarmist nonsense.\n\nAlso, sorry OP but you are completely clueless about basic economics. High inflation kills demand, which leads to lower inflation. The problem is that it doesn’t affect the supply side. Until our supply chains are fixed, I don’t see us going back to a rate of 2-3%. The interest rate hikes might only bring it down to 5% or so.", "score": 12, "replies": [{"body": "I know it’s not happening now\n\nWhat’s stopping it from escalating to that point?", "score": -7, "replies": [{"body": "Hyperinflation happened when a central bank kept printing money non-stop. With raising rates and QT the contrary is happening right now. (Not to mention the FED never printed money like that anyway)\n\n \n\nSo no worries about hyper inflation.", "score": 4, "replies": []}, {"body": "What’s to stop an asteroid hitting us this afternoon and wiping out all life on the planet? Or Putin to nuke the entire planet for breakfast tomorrow? Seriously dude, just chill the fuck out?", "score": 6, "replies": [{"body": "How am I supposed to chill out after you brought those two things up????", "score": 2, "replies": []}]}]}]}, {"body": "People use the word “hyperinflation “ to trigger the pedantic Econ-finazis\n\nMost people have no idea that it’s a specific definition \n\nAnd only using to express feelings at costs rising at a rate that feels insane", "score": 3, "replies": [{"body": "Okay I know it’s not happening now\n\nWhat is going to prevent the current wave from escalating?", "score": -2, "replies": [{"body": "It's a bit frustrating that no one has given you solid reasons yet, I'm no economist but I'll give you the best reasoning as I understand it. Your question presumes that that hyperinflation is a logical plausible end point to rising inflation. That's not really the case, hyperinflation is not just really high inflation, it is a very specific economic condition that occurs when your currency essentially becomes worthless. While the US is undergoing very high historic inflation, it's currency is far from becoming worthless as it has actually appreciated significantly against nearly every other world currency. In other words, people around the world are buying dollars like crazy. There has never been a historic situation in which a currency that was gaining value relative to nearly every other world currency underwent hyperinflation.", "score": 2, "replies": []}]}]}, {"body": "Hyperinflation is caused by a complete loss in faith in a currency, which is usually caused by a failing government at risk of being conquered/overthrown/collapsing thus making it’s currency valueless and usually also happens in conjunction with some catastrophic economic failure. The printing of money on a mass scale is more reaction to the above than a cause of hyperinflation. \n\nPeople are fairly sure the US government isn’t going to dissolve, and while the economy is probably headed for a recession it isn’t enough to make people believe the US economy will entirely collapse and never recover. As such we may run high inflation, but not hyperinflation.\n\nAs far as “we have to raise the rate to 9%”, the specific number is probably unknown. We need to raise it enough to cause a slow down or a recession. The drop in demand means the supply chain has a better chance at catching up and that companies lose pricing power adding deflationary pressure.", "score": 3, "replies": []}, {"body": "because world is full of shitholes where dollar is preferred currency.", "score": 1, "replies": []}, {"body": "1. They are not raising the rates slowly they waited too long to raise them. \n\n2. Yes it is still in the cards you couldn’t imagine how bad they are at their jobs. It’s like they are doing the worst possible moves on purpose", "score": -2, "replies": []}, {"body": "it is transitory /s", "score": 1, "replies": []}, {"body": "You're right. A lot more needs to be done. There's no reason to think that they won't, but you're looking at politics and what the state produces, not common sense or responsible financial management. So they're waiting for the last minute, hoping that raising rates by a whole lot will fall under the next administration, or at least after the upcoming elections. Politicians have no incentives to fix things, their primary focus is their career.\n\nBut hyperinflation in history has always been the product of a failed state, and I don't think they'll let that happen. But we're in for a shit show, and as you stated, the longer we wait, the worse it's getting. So I wouldn't rule out a depression at the very least.", "score": 1, "replies": []}]}
{"title": "Tell me why $AMZN is worth $1 trillion", "selftext": "Hey everyone I would like to know why Amazon is worth a trillion dollars. I feel like they won’t be super profitable in the near future(5-10 years) because they relay heavily on gas.\n\nOther than AWS(which is nice) has future competition. What is the sole reason why Amazon is worth $1 trillion?", "id": "vblypr", "created_utc": 1655153113.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 40, "comments": [{"body": "Because they sell everything to everybody.", "score": 54, "replies": [{"body": "True, they sell everything to everybody....even [Uranium] (https://www.amazon.com/Uranium-Ore/product-reviews/B000796XXM).", "score": 5, "replies": [{"body": "And they can get it to their customer as soon as the same day in some cities.", "score": 2, "replies": []}]}, {"body": "This. Wal-Mart has margins that are razor thin and always have been, but their reach is amazing. There was a stat I read somewhere in the past few months were basically WMT and AMZN are both in a one day shipping window to 99% of all Americans. Then AMZN gets the multiples assigned to both cloud (AWS) and streaming (Prime) and you get 1 Trillion.", "score": 5, "replies": []}]}, {"body": ">What is the sole reason why Amazon is worth $1 trillion?\n\nWhy must there be a sole reason?  Amazon is a huge company that does many things.  Ten reasons worth $100B each adds up to $1T, too.", "score": 23, "replies": []}, {"body": "AWS.", "score": 13, "replies": [{"body": "This is the correct answer.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Lol", "score": 1, "replies": []}]}, {"body": "Bro… you gotta see longer term than near times price pressure from fuel costs\n\nIf that’s your bear case, then everything has no future profitability \n\nAmazon is an obscenely well run business, endless cash, multiple different distinct segments, they could be 2-3 Fortune 500 companies if they wanted to be.\n\nI see no future where Amazon isn’t still shipping all your dog food and bs, whilst also giving you a decent streaming app, whilst also dominating in AWS, and then eventually they’ll spring you with some other line of business\n\nBesides, whose their competition? (Just for the retail side)\n\nBrick and mortar retail? Didn’t we just go through the past 10 years of realizing brick and mortar is dead?\n\nWalmart? Costco? Other online brick and mortar? \n\nAll those companies are basically trying to do what Amazon does, but less effectively, and at a higher cost", "score": 3, "replies": [{"body": "I agree with you in general, but I do think Amazon's retail experience is deteriorating quickly.  It's always been extremely fast and easy to buy, which really is great, but they are adding in so many promoted listings that it's becoming a total mess to find what you're looking for.", "score": 4, "replies": [{"body": "Ya I get your point.\n\nI’m def of the opinion, however, that sometimes you just buy really good companies that have a proven track record of success\n\nAmazon, et al., is that.\n\nThey have the cash and the market share to do whatever they want and they’ve got a history of developing whole new streams of business.\n\nSo, I have faith that they’ll come out better on the other side.\n\nRelated point, that seems to go unspoken of when speaking of recessions, is the fact that in recessions, the strongest eat the weak\n\nCompanies like Amazon, amongst others, have so much $$, they can eat up market share even if losing money, they can acquire companies, they can afford to keep their best people, they can afford to continue to develop new ideas, they can do all those things smaller companies can’t do when cash is tight.", "score": 3, "replies": [{"body": "Oh, I think Amazon is a good company.  I'm not buying anything right now, but when I do buy, they will probably be on my list.  I'm just saying they need to be careful with their UI on retail.  Half of winning in that game is becoming the habit for the customer.  If they push people to Walmart, it might not be easy to get them back.", "score": 1, "replies": [{"body": "Hey, I’m with ya brother\n\nI bought Thursday, then Friday, then today. And trust me, I regret buying Thursday\n\nAlthough, tbh, what’s the difference between buying apple at $143, or $137, or $133…?\n\nI’m not managing a 50b account, so for my 75 shares it ain’t going to make a huge difference. \n\nBut, I wish I’d waited …;(", "score": 1, "replies": []}]}]}, {"body": "The promoting stuff is an interesting point. Amazon has become on of the largest search engines in the world. Their ad business adds another reason why this companys huge valuation is somewhat justified.", "score": 1, "replies": []}]}, {"body": "Last quarter or so have indicated that it’s not that well run. Growth is slow. Profits will be significantly impacted by gas price.", "score": -1, "replies": [{"body": "The retail side? Yes, the margins aren’t great there.\n\nBut for every shit sandwich, they’ve got a chocolate sundae, AWS. Which is growing like some sort of freakish gremlin", "score": 5, "replies": [{"body": "Hence the stock is handicapped. Even AWS is not all-great anymore with competition from Azure and Google.", "score": 1, "replies": []}]}]}, {"body": "This is objectively false. Their fcf has been negative since 2020 as the retail segment is sinking Amazon. Aws is the only thing keeping the company alive. Retail has horrific margins (currently negative margins) and honestly I don't understand why they bother with it at all", "score": -2, "replies": [{"body": "What did I say that’s “objectively false”?\n\nThat they’re a well-run business?\n\nThat brick and mortar won’t compete with them long term?", "score": 4, "replies": [{"body": "You can't be a well run business and have endless cash while hemorrhaging cash more and more with each passing q with no end in site. Aws is amzn, not the retail nonsense", "score": 1, "replies": [{"body": "Alright bro. Amazon trash. You right \n\nEven accepting your entire narrative, AWS is growing revenue at … what 40%?", "score": 1, "replies": []}]}]}, {"body": "Right, right, Retail has no value at all, because if you look at a typical household budget nobody buys physical goods anymore, just directly or indirectly cloud backed services.  And there's no competition their at all, nobody else is even trying to offer competent cloud services with similar efficiency.\n\nAll companies should just completely abandon retail, especially the one company doing it more efficiently than anyone, because there's no moat.  Anyone can just spin up a vast global fulfillment and logistics network in a year or two.  There will never be any profit in retail again as evidenced by a single unprecedented pandemic.\n\nAnd nobody buys Prime for shipping, it's all about streaming.\n\n/s", "score": 4, "replies": []}]}]}, {"body": "AWS makes $20B a year  (and growing) this is worth a lot of money, since the segment is expanding (think bigger pie, not bigger pieces of pie)", "score": 3, "replies": [{"body": "Precisely. So many people don't realize we're barely scratching the surface of global enterprise IT spend there.", "score": 1, "replies": []}]}, {"body": "They have their hand in damn near every sector", "score": 3, "replies": []}, {"body": "Amazon is practically ingrained into public life at this point.\n\nAmazon is widely diversified, they have diversified into their own grocery store (Amazon Fresh), their own streaming services for music and video, with their own originals too, also have a foot in the door with the smart home market with Amazon Alexa, there's also Audible and so much more. Not even mentioning AWS. \n\nLoads of businesses even use Amazon's storefront, small and large. \n\nBy branching them all under the Amazon name, the public essentially have an all-in-one place to go to do their online shopping. \n\nWhile their workers rights aren't the greatest, also have perfected the consumer's greed with prime and their next day delivery, people really would rather throw money at an Amazon Prime subscription than wait an extra few days. \n\nLove them or hate them, they really have roots in everything.", "score": 3, "replies": []}, {"body": "They run the biggest counterfeit crap online store.\n\nMost of the counterfeit goods come from Amazon created businesses using data from product sales leaders' statistics, that only Amazon gets to look at. \n\nIt's an ethically questionable business model. Possibly Illegal.", "score": 2, "replies": []}, {"body": "3 letters: AWS", "score": 2, "replies": []}, {"body": "Drones.", "score": 1, "replies": []}, {"body": "It’s not worth a trillion in my eyes. In my opinion, it should only be worth $400 Billion.", "score": -7, "replies": []}, {"body": "It's Not!", "score": -2, "replies": [{"body": "It seems everyone likes Amazon", "score": 1, "replies": [{"body": "Amazon HAD a monoply through googles Unfair Biased search algorithum, price fixing along with propping up and downplaying of chosen winner's and Loser's...\n\nThose Days are Gone.\n\nIn time saturn always come's back around.", "score": 1, "replies": []}]}]}, {"body": "Amazon needs to add a curated section and they will be worth $2 trillion. Up the membership to add a premium products where both customers and sellers have to pay to access and 💥", "score": 1, "replies": []}, {"body": "It isn't. Not at the moment anyway, maybe in the future.", "score": 1, "replies": []}, {"body": "Storage and hosting servers.", "score": 1, "replies": []}, {"body": "The fear is if union bargaining power is obtained, going on strike can cripple America.", "score": 1, "replies": []}, {"body": "After -5.05% price in stock price (lost -5,45%) it will not be a 1T market capitalization company.", "score": 1, "replies": []}, {"body": "It's not.", "score": 1, "replies": []}, {"body": "They sell everything. We’d be able to order a new sun from Amazon when this one is gone.", "score": 1, "replies": []}]}
{"title": "The Wetards of Oz. - Chapter 1: The Inflation Cyclone", "selftext": "", "id": "vb9qtg", "created_utc": 1655118845.0, "score": 774, "upvote_ratio": 0.97, "num_comments": 44, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|20|**First Seen In WSB**|1 year ago\n**Total Comments**|24|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vb9qtg)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vb9qtg)", "score": 1, "replies": []}, {"body": "'its cheaper to buy cocaine and run everywhere' 😂😂😂", "score": 56, "replies": []}, {"body": "Top stuff", "score": 25, "replies": [{"body": "[JPOW is the top-gun of money printing](https://www.youtube.com/watch?v=xnp0Cl5NXdE)", "score": 7, "replies": [{"body": "I love it when ppl tell me, they don't actually print the money", "score": 2, "replies": []}]}]}, {"body": "Chapter 2 please!", "score": 23, "replies": [{"body": "Rezun8 has a whole series of this. But his MoneyTrix is even better", "score": 7, "replies": []}]}, {"body": "And the Grammy goes to..", "score": 17, "replies": []}, {"body": "“Listen up, I got the DD for ya, I done scrolled through Reddit”…. Hahaha. So perfect \n\nWell done OP. Well done.", "score": 16, "replies": []}, {"body": "Slow clap...", "score": 11, "replies": [{"body": "No clap", "score": 6, "replies": []}]}, {"body": "it's official: cocaine is cheaper than gasoline.", "score": 12, "replies": []}, {"body": "You retards have way too much time on your hands 🙌🏼", "score": 8, "replies": []}, {"body": "Good shit, very nostalgic and modern at the same time\n\n(I loved loved loved this damn movie when I was a kid)", "score": 7, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "I like the way you used the story of the perils of taking America off the Gold standard and the beginning of fiat currency as the basis for your meme. Nice touch.", "score": 7, "replies": []}, {"body": "Lmao Clarke & Dawe from abc? 🥲", "score": 7, "replies": []}, {"body": "Lmfao bruh I love you you dipshit never change", "score": 6, "replies": []}, {"body": "Holy shit dude, is this wha you did all weekend?!? FFS", "score": 6, "replies": []}, {"body": "Can't wait for chapter 2!!", "score": 6, "replies": []}, {"body": "Yes yes yes!!! This is the quality content I live for in this community!!!", "score": 6, "replies": []}, {"body": "“Put ‘em in the most under valued commo-“\n*tornado ensues* \n\nI wanted to hear the rest of that DD.", "score": 4, "replies": []}, {"body": "Outstanding", "score": 4, "replies": []}, {"body": "Single tear", "score": 10, "replies": []}, {"body": " kkkkk", "score": 4, "replies": []}, {"body": "High end! Thank you.", "score": 4, "replies": []}, {"body": "Hahaha, nice bro.", "score": 3, "replies": []}, {"body": "u/savevideobot", "score": 3, "replies": []}, {"body": "I’m Luvin it!\nDon’t forget to get your Hot n Spicy", "score": 3, "replies": []}, {"body": "Whats a wet ard?", "score": 3, "replies": []}, {"body": "And the Oscar for best documentary goes to The Wetards of Oz!", "score": 3, "replies": []}, {"body": "Now that's how you do a soft landing JPOW!", "score": 3, "replies": []}, {"body": "Phew! Thank God I woke up and it was just a nightmare! (It felt so real, though!)", "score": 3, "replies": []}, {"body": "Good job on whoever made this.", "score": 3, "replies": []}, {"body": "Add me to your mailing list", "score": 3, "replies": []}, {"body": "This is why I'm still on reddit", "score": 3, "replies": []}, {"body": "You should quit your day job", "score": 3, "replies": []}, {"body": "how do I short SPY lol", "score": 3, "replies": []}, {"body": "I was like what’s a wetward?", "score": 3, "replies": []}, {"body": "I think times were too good for WSB for the last couple years. About time we get back to more of this", "score": 2, "replies": []}, {"body": "Who needs religion for hope. I have my fellow Wetards.", "score": 2, "replies": []}, {"body": "Hey, this meme is fire. I love it. Want to see more.", "score": 2, "replies": []}]}
{"title": "The only way left to make gains in this market is literally by betting against it", "selftext": "Everything is red and it's showing no signs of slowing down. I've decided that is just best to let my portfolio hibernate for the next 6 months. I won't be selling anything, nor I'll be buying (not until things at least stabilize).\n\nFor the time being I'll be moving from trading stocks to trading events. I'm sure I can't go wrong betting on inflation.\n\nhttps://preview.redd.it/90fmshq6ng591.png?width=1625&format=png&auto=webp&s=374fb62ae3a1353eaf14d1f14ca3a322dc7cc2ff", "id": "vbnlin", "created_utc": 1655157420.0, "score": 133, "upvote_ratio": 0.9, "num_comments": 41, "comments": [{"body": "\"The only way to make gains....\" \n\nDoesn't share positions.\n\nMaybe you should go to r/talkaboutbets??", "score": 1, "replies": []}, {"body": "Wait till you hear about puts", "score": 103, "replies": [{"body": "Nobody tell them", "score": 23, "replies": []}, {"body": "or VIX call options 🍆💦", "score": 11, "replies": [{"body": "You know, I tried that for the first time on Thursday, probably sold a little too early today but they were trading lower than intrinsic by a decent amount.  Was pretty annoyed. Maybe you have to buy them already ITM, not sure what the deal was.", "score": 3, "replies": [{"body": "Yea, I sold my VIX options this morning too, probably too soon as well, but I know exactly what you’re saying about the IV.", "score": 3, "replies": [{"body": "Really bugged me because I spent like 2 bucks for OTM ones on Thursday and then once they passed the intrinsic value they didn’t keep up even with a couple weeks left on them.  It was kind of a test run so I’ll probably stick to TQQQ or SQQQ next time I guess", "score": 4, "replies": []}]}]}, {"body": "Also this", "score": 1, "replies": []}]}, {"body": "Or sell your first (otm) put like I did last week.  Soon to be itm. Rip", "score": 14, "replies": [{"body": "lmao what convinced you to sell puts in this market?", "score": 2, "replies": [{"body": "I was very bullish on the company  and it had already taken a beating. But yeah, good point. I just wanted to join the theta gang so badly", "score": 2, "replies": [{"body": "Sadge, we all want to join theta gang :(\n\nAt least you'll have a bunch of shares at a price you are willing to buy at... Right? You didn't get exercised on a bad short, you capitalized on a price displacement opportunity.", "score": 1, "replies": [{"body": "We'll see. First margin call e-mali received.", "score": 1, "replies": []}]}]}]}]}, {"body": "Lol ok. Betting on inflation is still funnier/less risky right now", "score": 2, "replies": [{"body": "Just messing with you. If I’d taken the last 6 months off I would be way ahead of where I am now.", "score": 1, "replies": []}]}]}, {"body": "Wtf is this inception shit, a casino in a casino?", "score": 29, "replies": [{"body": "In a casino people will make side bets on just about anything from how long it will take for a waitress to bring a drink to the color of the flop.", "score": 12, "replies": [{"body": "Ah like the CDO^2 scene.. thanks, it sounds like you've spent a little time there", "score": 5, "replies": [{"body": "Growing and selling shrooms was my only income during college. I didn't get rich but it was way better than a job.", "score": 7, "replies": []}]}]}, {"body": "it's a prediction trading platform", "score": 2, "replies": [{"body": "Sounds like gambling on whether the bullish or bearish gamblers will profit", "score": 1, "replies": []}]}]}, {"body": "Shorting the market in a downtrend isn't \"betting against the market\": The market is clearly showing what its doing. You're just going along with it.", "score": 15, "replies": [{"body": "Not just going along, ya need to stay a step ahead.", "score": -3, "replies": []}]}, {"body": "11 rate hikes jesus christ.", "score": 5, "replies": [{"body": "you seem surprised", "score": 1, "replies": [{"body": "I'm sitting on puts so I'll survive.", "score": 2, "replies": []}]}]}, {"body": "A casino, inside a casino,\n\n\ninside a casino.", "score": 9, "replies": []}, {"body": "Betting against it right now is going long, not short\n\nYou never adapt the mentality to the market maybe that's the cause of the porn loses", "score": 4, "replies": []}, {"body": "SQQQ and DRV is what I'm in", "score": 3, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|2 weeks ago\n**Total Comments**|1|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vbnlin)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vbnlin)", "score": 2, "replies": []}, {"body": "Fuck you barely figured that out Einstein", "score": 2, "replies": []}, {"body": "You are one day late. Sorry.", "score": 2, "replies": []}, {"body": "*Michael Burry has entered the chat*", "score": 3, "replies": [{"body": "Michael Burry would never say „I can’t be wrong“.", "score": 3, "replies": []}]}, {"body": "The bottom is in. Thank you!!", "score": 2, "replies": []}, {"body": "what sucks is iv gonna fuck you too", "score": 1, "replies": []}, {"body": "Yatzee!", "score": 1, "replies": []}, {"body": "The only way to make gains.... Doesn't share postions.\n\nMaybe you should go to r/talkaboutbets??", "score": 1, "replies": []}, {"body": "Now you only need to reed the market trend, then be a contrarian", "score": 1, "replies": []}, {"body": "It's not even a good time to bet against it, imo.  At least not right this minute.  I only started actively investing in January and I was just too far behind the curve to take advantage of puts.  I tried a couple and it didn't really pan out since my thesis were incorrect and my timing was off.  I feel like I missed a huge opportunity because I just lacked the knowledge to take advantage . .but now volatility is high and puts are expensive.  Better to sell calls, imo . .but I'm too inexperienced and my account is too small for that right now, too.", "score": 1, "replies": []}]}
