{"title": "Lost out on 15k today", "selftext": "So I have been holding  $WFC Feb 19 33.50 .56 Calls since Friday 10 contracts. I was up about $800 going into today. The market dumped early and I lost around $350 and decided to sell. I also saw Buffet closed his position in $wfc which was in the back of my mind. 10 mins later $WFC announced the Fed will let them overhaul their plan ties to cap. The stock immediately rose 2.60 and is up .39 in afterhours. I still made $670 today but I’ve been sick to my stomach all day on the missed out gains.\n\nCurrent Holdings\n\n1-2 weeks currently holding \n\n$bac $33.50 Feb 19 .33 30 Contracts +$1850 (+189%) Equity $2850\n\n$wfc $37  Feb 26  .67 10 contracts +$70(Opened today) Equity $740\n\n$VZ $56 Feb 26  .58 10 Contracts +$770(+132% Opened Today) Equity $1,350\n\nI’m a very small trader. Just got back into it after about 4 years off. Started with $800 up to $5591 in a month.\n\n\nFinancial sector is strong outperforming every other sector. Banks are up 15% in the past month. They are coming off a sell of at the end of January it’s when I started getting in an out for weekly short term gains.\n\n$c $wfc and $bac are all up between 20-30% over a 3 month period.", "id": "lm924y", "created_utc": 1613608003.0, "score": 251, "upvote_ratio": 0.85, "num_comments": 327, "comments": [{"body": "Don't worry about the ones that get away. You were right once. Just keep at it. You'll have more chances in the future. \n\nNever be upset with a profit.", "score": 388, "replies": [{"body": "This is the way.", "score": 65, "replies": [{"body": "this is the way", "score": 39, "replies": [{"body": "This is the way.", "score": 31, "replies": [{"body": "This is the way.", "score": 29, "replies": [{"body": "This is the way", "score": 25, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "This is the way.", "score": 13, "replies": [{"body": "This is the way.", "score": 6, "replies": [{"body": "This is the way.", "score": 3, "replies": [{"body": "This was the way. Now it is a new way", "score": 2, "replies": []}, {"body": "Crusty jugglers.", "score": 1, "replies": []}, {"body": "Herp derpy derp derp", "score": 1, "replies": []}]}, {"body": "This is the way.", "score": 3, "replies": [{"body": "This is the way.", "score": 2, "replies": []}, {"body": "This the way", "score": 2, "replies": []}, {"body": "This is the way.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Guys, I’m just trying to find directions to the zoo!", "score": 1, "replies": [{"body": "This is the way.", "score": 1, "replies": [{"body": "Wait... which way is it?", "score": 1, "replies": [{"body": "That way", "score": 1, "replies": [{"body": "Thanks, I was confused.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "##This Is The Way Leaderboard  \n\n**1.** `u/RedVision64` **109** times.\n\n**2.** `u/StonkU2` **90** times.\n\n**3.** `u/anticensor_bot` **83** times.\n\n..\n\n**12755.** `u/GeneralCapone` **1** times.\n\n---\n\n^(^beep ^boop ^I ^am ^a ^bot ^and ^this ^action ^was ^preformed ^automatically.)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Strong", "score": 1, "replies": []}]}]}]}, {"body": "This is the way", "score": 1, "replies": []}, {"body": "The way this is", "score": 1, "replies": []}]}, {"body": "I live by the words of Buffett, \"The stock market is a no-called-strike game. You don’t have to swing at everything – you can wait for your pitch\".\n\nOf course Buffett means that you don't have to swing at bad pitches / investments. In options, the goal is to avoid bad trades, since unlike stocks, our options time frame is inherently limited. \n\nDon't beat yourself up over \"missed gains\", as doing so will only make you more likely to swing at crap next time, as you think about how things \"could have been\".", "score": 16, "replies": [{"body": "when you see a profit, take it.. there is no tomorrow for taking profits.. don't be too greedy, let the others have some too.. you may sell it too quickly maybe at first, but later on when you know how a particular stock/or the option behaves, then you'll be more comfortable with it..  just like Jazz says, there is no FOMO,, there'll be another one coming around later.. make sure you'll have some dry powder to get them,", "score": 1, "replies": []}]}, {"body": "Exactly. I once saw someone say “there will always be another party to go to” in reference to FOMO. There’s another day, another stock, another chance to earn. No point sweating the stuff that can’t be changed.", "score": 22, "replies": [{"body": "Makes sense", "score": 0, "replies": []}, {"body": "Well said bro", "score": 0, "replies": []}]}, {"body": "The biggest pitfall for a trader is trading with emotions. Sounds like OP didn't have or didn't follow a plan. that's why they exited the trade prematurely in the first place on a small market dip because the position was too risky or too big. And now that feeling of missing out will result in taking more risks probably without a plan.", "score": 24, "replies": [{"body": "That’s just simply not always true lol.  Some people just aren’t willing to risk it.  This guy seems like one of them.  And that’s honestly good for the most part.", "score": 10, "replies": []}, {"body": "My plan was busted when Berkshire  at EOD Tuesday exposed the closed their position in WFC", "score": 5, "replies": [{"body": "Buffett isn't always right, example is airlines he sold", "score": 12, "replies": []}, {"body": "If that was from his 13F filings it was old news.....Oct-Dec 2020......", "score": 0, "replies": []}, {"body": "We have known for a year he was selling WFC and the Airlines.   That is why Wfc dipped to 21.  I almost sold calls on my shares yesterday but someone just bought like 1000 March 37.5’s reported on Benghazi so I resisted.", "score": 1, "replies": []}]}]}, {"body": "I concur! It’s better to miss out gains than to lose money! Similarly, the stock could have dipped and you could’ve lost money. One never knows about the future.", "score": 4, "replies": []}, {"body": "This is the way", "score": 2, "replies": []}, {"body": "That’s true.", "score": 1, "replies": []}, {"body": "Buy blue stock will be 100$ in a year", "score": 1, "replies": [{"body": "BLUE will go to nothing after the lawsuit begins in April.  $100 per share wishful thinking but I get rid that in the very near future.", "score": 1, "replies": [{"body": "What's BLUE?", "score": 1, "replies": []}, {"body": "We will see I am in biotech for over 20\n Years and I have seen Ariad and biogen many other recover to new highs, this is one of the best company you will ever find in entire biotech industries", "score": 1, "replies": [{"body": "What about the law suit?", "score": 1, "replies": [{"body": "Lawsuit is because of delay in filing BLA and fall in share price, both will be corrected in near future because more data is needed: https://www.globenewswire.com/news-release/2021/02/16/2176359/0/en/LAWSUIT-FILED-bluebird-bio-Inc-Sued-for-Violations-of-the-Federal-Securities-Laws-Investors-Should-Contact-Block-Leviton-LLP.html", "score": 1, "replies": [{"body": "What does this biotech have that the others don’t", "score": 1, "replies": [{"body": "Gene therapy cure can be permanent", "score": 1, "replies": [{"body": "Thank you.  I knew a guy who was working with nano biotechnology in Austin.  But I can’t remember the company he works for.  I wondered if that company is public.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Profit is profit man. Big or small, you are still winning.", "score": 1, "replies": []}, {"body": "I really needed this today. Thank you for this.", "score": 0, "replies": []}, {"body": "This is the way", "score": 1, "replies": []}, {"body": "Sure scalp for peanuts and lose your ass on the next trade.  Need balls to make money in the long run.  Lose big, win bigger.", "score": 1, "replies": []}, {"body": "This is the way.", "score": 1, "replies": []}]}, {"body": "Hindsight is always 20/20, and you can always play the what if game. End of the day, you made money. Take that win and keep moving forward. One step at a time.", "score": 60, "replies": [{"body": "This^^\nAs shitty as that pit feeling of what could have been is, think about what could have been if it shit the bed and you didn’t cash out.  All you really can do is adjust your tolerance and hope to better catch the falling knife next time.", "score": 5, "replies": [{"body": "Man you nailed my brother, live and learn always gonna be another day to become a better person. That's why I forgive alot.", "score": 3, "replies": []}]}, {"body": "Yea I jumped back in with. Feb 26 $37 .74 Calls. Also made about $800 off of $V Feb 26 $56  1.35. Buffet announced he bought a shit ton.", "score": 13, "replies": [{"body": "Never sell all your contracts. that is the way to learn", "score": 2, "replies": []}]}, {"body": "This sub is full of philosophers. So well said. 👍", "score": 3, "replies": []}]}, {"body": "I sold $3k worth of calls of Popeyes the day before Burger King bought them. Don't let it get you down. \n\nNo one ever got hurt taking a profit.", "score": 45, "replies": [{"body": "I sold bitcoin at 6k", "score": 11, "replies": [{"body": "You retard lol jk", "score": 17, "replies": [{"body": "Clay you lol don't make fun him, 7878 that's my race number cool", "score": 3, "replies": [{"body": "I'm Sorry you don't feel well, look on the bright side, GOD is here.....I love you. I hope everyone has a great night.", "score": 2, "replies": [{"body": "Manski 2020 you still there Brother?", "score": 1, "replies": []}]}]}, {"body": "I know it was joking, but really depends on which time it was at 6k\n \nCuz when it went 6k->3k, I thought BTC had finally died\n \nWho could've seen 0->20k->3k and expected it to be where it is today?\n \nI also used my btc at 6k lol", "score": 3, "replies": []}]}, {"body": "I sold at $400. No, I didn't miss a zero. I still have old hard drives with clues to wallets, but haven't found any yet :/", "score": 1, "replies": [{"body": "I bought and sold bitcoin since 7 dollars\n\nI could have bought 50 but mtgox was so shady like a geocities website back then I didn't want to risk my 300 bucks which was alot for a kid", "score": 1, "replies": []}]}]}, {"body": "What would you have made in this case?", "score": 10, "replies": [{"body": "A life without student loans.", "score": 18, "replies": [{"body": "Word", "score": 3, "replies": []}, {"body": "Bless up 🙏", "score": 1, "replies": []}]}]}, {"body": "I’m curious too.", "score": 4, "replies": []}, {"body": "I bough like 5k worth of Tesla option for end of the years n sold it after 200% gains. Couldn’t hold it. It would have been 1m", "score": 2, "replies": []}, {"body": "Dang", "score": 1, "replies": []}]}, {"body": "You only need to land one whale a year. The fact you didn’t lose 15k is an accomplishment. AND you made money. You’re a winner", "score": 35, "replies": [{"body": "I like that. Thanks.", "score": 5, "replies": []}, {"body": "Bam 👍", "score": 6, "replies": []}]}, {"body": "I bought COTY calls back in November for like 8 cents, sold em at 100+% profit, and if I'd held just a couple days more they were going for over 80 cents. Easy ten bagger. But, selling when I did was the right move at that moment. \n\n\"If I'd known,\"...but you never do.", "score": 22, "replies": [{"body": "If you got a 100% why don't you just sell half and enjoy the ride on ur free calls?", "score": 1, "replies": [{"body": "Beeeeecause selling at 100% profit is never a bad idea?", "score": 1, "replies": [{"body": "Can't argue there. Just saying sometimes when this happens to me I take a 30 to 50% (where I usually cash in coz I'm good with that) gain and leave the rest in to see where it goes.", "score": 1, "replies": []}]}]}]}, {"body": "pause jobless plant wipe far-flung memory butter fuzzy telephone connect\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 19, "replies": [{"body": "I’m up 600% the past month so I can’t complain but it hurts.", "score": 7, "replies": [{"body": "combative growth cows forgetful insurance hurry mindless grey desert mountainous\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 10, "replies": [{"body": "Yea I’ve been trying to share what I’ve been trading but the mods suck dick in this sub and unless you give a detailed description as to why you are trading what you are trading they delete your post. \n\n\n**FUCK YOU MODS**", "score": 1, "replies": []}]}, {"body": "What did u buy", "score": 2, "replies": [{"body": "Been fucking with $bac and $wfc weeklys for the past month. Literally the only to stocks I’ve been trading. Opened $V $57 today. I made a little money on $amc puts but nothing crazy. The financial sector is outperforming every other sector. Bank stocks saw a sell of in late December and have risen for the last month. Over 3 months $wfc $bac and $c are up 20-30%", "score": 2, "replies": [{"body": "Was it maybe *C* (Citibank) you bought a 57C on today?  It closed at 63, while  $V(isa) closed at 209.\nDo you have a blog or something showing your trades?  I'm surprised more people didn't ask you, but $800 to $5xxx in 1 month is extraordinary, especially just playing semi-stodgy bank stocks, so I'd like to learn more specifics about what you're doing.\nI just started trading options seriously on 1/15 and was up 30-40% over two accounts into last week, but PLUG going the wrong way and some ill-advised MJ plays have really hurt this week.", "score": 2, "replies": [{"body": "Sorry I meant $vz not $v", "score": 1, "replies": []}]}]}]}]}, {"body": "You’d rather be wrong than right? Wtf lmao", "score": -1, "replies": [{"body": "vast reply snatch roof glorious coordinated tease roll steer bored\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 4, "replies": []}]}]}, {"body": "Yeah, hindsight is 20/20. I’ve lost tons of money by selling too early, but all you can do is learn from it and move on. No sense in beating yourself up over something you can’t change.", "score": 12, "replies": [{"body": "Man I have every penny I have in the market praying I don't lose it all. Just have to have faith. I trust god......", "score": -1, "replies": []}]}, {"body": "In poker there's a mentality that once you fold, forget the hand. No sense in saying 'should have stayed in' after seeing the river.\n\nYou only have the knowledge you do when you do. 99/100 the fed says nothing.", "score": 10, "replies": [{"body": "Heck yeah, make the best decision you can with the information you have and let the chips fall where they may.", "score": 4, "replies": []}, {"body": "Yea that’s true", "score": 2, "replies": []}]}, {"body": "It's ok to feel what you're feeling. That feeling doesn't change regardless of how many times the same thing happens. \n\nFocus on what you can control now: the next trade/idea.", "score": 9, "replies": []}, {"body": "If it makes you feel any better, I sold all my long $12.50 cciv calls for gme a few weeks ago. I can't even try and process it without breaking down.", "score": 9, "replies": [{"body": "Guh", "score": 10, "replies": []}, {"body": "I mean CCIV has done aight....", "score": 3, "replies": []}, {"body": "why didnt you sell calls over your calls and bought gme with the premium ?\n\ni sold a 50 call for this friday and bought 50 call for jan 2022 about 2 weeks ago\n\ni rolled the 50 call fro this friday  to a 70C march didnt expect it to move this quick :O", "score": 2, "replies": [{"body": "Because that is beyond my knowledge lol I'm still trying to learn as much as I can everyday though. With my current knowledge, I don't dare to sell calls or puts.", "score": 1, "replies": [{"body": "Fair enough;;)", "score": 2, "replies": [{"body": "Thanks though, it's definitely something I'm trying to learn more and more about!", "score": 1, "replies": []}]}]}]}]}, {"body": "It happens.\n\nMe personally, I usually wait it out if the selloff isn't due to a stock specific news as was the case today. But it also depends on how much money I put in, for how long, margin or cash etc.\n\nBut you're learning new lessons everytime you trade.", "score": 8, "replies": [{"body": "Yea I’m stupid the market always either goes up then dumps at 1030 then climbs rest of the day. Or dumps early and climbs rest of the day. Love and learn.", "score": 3, "replies": []}, {"body": "Well it was at first Buffet closed his position. So that was also in my mind when I closed my position.", "score": 2, "replies": []}]}, {"body": "Can't think like that, it'll eat you alive. I just got into TSM calls, 70 for 03/16. There's always another chance", "score": 7, "replies": [{"body": "Yea but 15k I can go right to the dealership and get the AMG I’ve been saving for. I’m only 10k away", "score": 6, "replies": [{"body": "Why buy an AMG when you can buy MORE weeklies and get a house? 🏡 > 🚗", "score": 10, "replies": [{"body": "Everyone I know that has a house complains about it. I’ll stick to renting", "score": 1, "replies": [{"body": "Buy a house.  It'll help offset some of your gains.  Plus it is another investment tool.  I'm up 80K on my place in 5 years.", "score": 10, "replies": [{"body": "Let him rent lol", "score": 6, "replies": []}]}, {"body": "Then you’re talking to the wrong people. Why throw rent money away paying off someone else’s home instead of building your own equity??", "score": 1, "replies": [{"body": "It may be your own equity but there’s always another project or maintenance looming in the distance.", "score": 4, "replies": [{"body": "Not really.  Just buy a newer home and you will be fine.  Cost of maintenance is very minor and certainly way lower than the capital gains... nm the base ownership vs throwing money away to others.", "score": 2, "replies": [{"body": "You obv haven’t seen the housing market in the Northeast as of late", "score": 2, "replies": [{"body": "I wouldn't say looming, set your up to take a 2 week vacation every year, do some falanhrooy once in awhile and don't over do the kindness. Took me a long time to find that asshole button. Learn to say (no) but be fair. Basically know when to use a light touch and move at the spread of life.", "score": 1, "replies": []}]}]}, {"body": "Yeah but a car loses value as soon as you drive it off a lot. My first home is worth 66% more from when I first bought it (2016), currently renting it out. My second is worth 25% since I bought it(2018) and is currently being remodeled while in a very up and coming area and my current home is up 40% and I bought it one year ago before the pandemic. \n\nAre there projects with it? 100%. But I get the interest I'm paying back partly in the form of a mortgage interest deduction, can write off expenses for repairs, especially for rentals, and I get the equity in the property on top of the increase in value. \n\nIf I have tenants it pays for my mortgage + some, which I can either save for paying defraying maintenance or put toward my other expenses. Get a property manager on top of it and they'll oversee anything that may come up. If maintenance is an issue get a home warranty, which will fix/repair/replace any electrical items in your house. If you care about roofs, etc, then sell them home in a few years time to avoid issues with crazy maintenance while getting rental income in the near term and letting the equity build.\n\nI wouldn't just casually push away home ownership. 3% down gets you a first home, sometimes 0% depending on where and your credit. Also, typically a mortgage is cheaper than rent and you can always get a roommate. But cars are fun too!", "score": 1, "replies": []}]}, {"body": "Sounds like OP may enjoy entropy a tad too much to do that", "score": 5, "replies": [{"body": "You sound like someone who just learned what entropy means and now wants to use it in every conversation", "score": 0, "replies": [{"body": "Correct. But let’s be honest, what’s wrong with that? It’s an important concept for one to understand. Especially if OP wants to buy an AMG. Or trade options effectively.", "score": 7, "replies": []}]}]}]}, {"body": "Man I can't wait to have my own place some day.", "score": 0, "replies": []}, {"body": "I have 3 homes. Best investment ever. I bought first when prices were up. Big deal. Hold for life. Now with 700k equity. Rent is for the short-sighted . But I love my renters. They pay my mortgage", "score": 1, "replies": []}]}]}, {"body": "My balls itch and I've got a ***WOODY***!", "score": 2, "replies": [{"body": "Eh", "score": 2, "replies": []}, {"body": "Sounds like hpv", "score": 1, "replies": [{"body": "Krekenutz - Did your sister get home yet?  I gave her cab fare and sent her on her way.  Whoa, my plumming is a lot cleaner now.  She did a great job.", "score": 1, "replies": [{"body": "Man I was worried - I thought you said crab fare. That was supposed to be apart of the deal.", "score": 1, "replies": [{"body": "No, I would never give anyone the crabs.  That's just rude and not very classy.", "score": 1, "replies": []}]}]}]}]}, {"body": "You’re doing all thus for an AMG? Dude cmon. Do it for more massive stock market gains and keep rolling it", "score": 1, "replies": []}]}]}, {"body": "This is why I always sell incrementally. I dollar cost average my way into and out of every position. Incremental, people. Hedge risk, profit take. It’s the way.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "This is not the place for dating advice.", "score": 2, "replies": []}]}, {"body": "You don't go broke taking profits. You will however when you leave naked calls on GME naked the night before Elon was supposed to tweet about GME.", "score": 5, "replies": [{"body": "Lmfaoaoao", "score": 2, "replies": []}]}, {"body": "\"I still made...\"\n\nYou're moving the needle in the right direction.", "score": 6, "replies": []}, {"body": "🤢", "score": 4, "replies": []}, {"body": "There are more opportunities than we have money or time. Don't sweat it! There will always be more. The best thing you can do is reflect on your decision. Who knew that the Fed would let WFC overhaul their plans. Was that part of your thesis? If not, you did the right thing! You sold out of a trade instead of blindly hoping for some random catalyst you don't know about.", "score": 5, "replies": []}, {"body": "Just remember it could have easily gone the other way. Protecting your profit and sticking to your plan is more important. Especially with options it sounds like you could have lost a whole lot more.", "score": 3, "replies": []}, {"body": "Go visit wallstreetbets and talk to the people that bought Gamestop at $350. You'll feel better.", "score": 5, "replies": []}, {"body": "wasn't meant to be", "score": 3, "replies": []}, {"body": "I sold FSR 2/19 calls I held for 2 months the week before it shot up.  I dumped CCIV calls I held for a month 2 days before it went up.  I feel your pain brother.  Took small gains on both but got tired and wanted to float the capital somewhere else (which were winners, but I dont like so many moving pieces)", "score": 3, "replies": []}, {"body": "I sold my GME feb 19 $30 calls for 1500 dollars the first day it rallied to like 40. They were worth over 100k at one point.", "score": 3, "replies": []}, {"body": "Profits are good. Don’t sweat it. There will be other opportunities.", "score": 3, "replies": []}, {"body": "I sold puts on LUV, DIS and RCL for a light profit BEFORE the March 2020 crash. Missed out on prob 50k. Don’t feel bad", "score": 2, "replies": []}, {"body": "Shit happens sometimes.... I day traded several thousand SCKT shares yesterday. I bought in the 6s and exited + $1 from cost basis and it took off for another $27 from there before a pullback to low 20s. \n\nI could have paid off my mortgage and still had a lot of money left over if I didn’t rush to take profits on a crazy running Stock so quickly", "score": 2, "replies": []}, {"body": "Steady gains like this can be put toward buying WFC's next dip.", "score": 2, "replies": []}, {"body": "You made money and didn’t loose those gains! Still a win man!", "score": 2, "replies": []}, {"body": "I sold the 250/260 calls for PYPL just  before earnings.  It’s part of the game. Nobody ever went broke taking profits.", "score": 2, "replies": []}, {"body": "I’m new to all this guys and wonder if you have any recommendations on what too go for right now. I do not have a large amount to invest. Like I said, I am brand new to this.", "score": 2, "replies": [{"body": "Buy IBIO and thank me later 😀", "score": 2, "replies": [{"body": "On a straight buy or something else?", "score": 1, "replies": []}]}, {"body": "Buy long and just hold it until you are happy with the profit.  Always do your own DD first", "score": 2, "replies": [{"body": "Thank you very much.", "score": 1, "replies": [{"body": "Good luck 🍀", "score": 2, "replies": [{"body": "Thank you for putting up with a rookie and answering my questions. Have a great week.", "score": 1, "replies": []}]}]}, {"body": "And sorry, what is DD? I know, dumb question", "score": 1, "replies": [{"body": "Due diligence aka your own research", "score": 1, "replies": []}]}, {"body": "Thank you", "score": 1, "replies": []}]}]}, {"body": "You made a move based on information you had, and the stock shot up later based on information that wasn’t presented until after you sold. Don’t kick yourself about the ones you missed because really, in one way or another you probably miss out on a trade every day that could have made you a millionaire. \n\nJust keep working your strategy and stay diligent. It’s a marathon, not a sprint.", "score": 2, "replies": []}, {"body": "You made money today you lucky fuck! I lost a butt ton today.", "score": 2, "replies": []}, {"body": "Someone once said: “it doesn’t matter, stick to your rules, I understand F.O.M.O. (Fear Of Missing Out) but don’t forget, the beauty of the market is simple: it’s going to be here tomorrow, it’s going to be here next week, it’s going to be here next month, and next year. Did you miss a trade?... doesn’t matter, there will be many more to come, get ready!”", "score": 2, "replies": []}, {"body": "You made a profit my man. You cant win them all. As long as you didnt go in the negative, i would call that a win. Hell if we always did it right everyone would be a millionaire. It comes with the risk of trading. You did good though. Pat yourself on the back and take what you can from it to improve the next time. Continuous improvement is the key and if youre profitting, youre improving. Keep up that trend.", "score": 2, "replies": []}, {"body": "Nobody goes broke securing profits \n\nOf we all dwelled on what we left on the table we'd all be sick. \n\nKeep pressing forward and look for the next play", "score": 2, "replies": []}, {"body": "I missed out on 450k on gamestop, I came out with 4K instead. It sucked for a few days but you will get over it. I was just happy to have made money rather than to have lost money", "score": 2, "replies": []}, {"body": "My motto: I take my piece, and I'm at peace. \nIf I try to do something not in my system, I'm risking an adverse outcome. Sometimes the big winners get away.\n\nIf your plan was to sell, and you sold, you got your piece.\n\nIf you didn't have a plan, why?", "score": 2, "replies": []}, {"body": "You were in the green today, don’t sweat it. But the feeling sucks. I was up $600 at EOD but panic sold potential $3k more profit today... \n\nIt happens. We adapt to the market, it does not adapt to us.", "score": 2, "replies": []}, {"body": "Profit is profit my man rather positive than negative right lol", "score": 2, "replies": []}, {"body": "Unless you have a crystal ball you won’t be able to sell at the top and buy at the bottom. But as long as you made a profit you’re already ahead of the pack.", "score": 2, "replies": []}, {"body": "How far out do you buy your calls", "score": 2, "replies": [{"body": "1-2 weeks currently holding \n\n$bac 33.50 Feb 19 .33 30 Contracts +$1850 (+189%) Equity $2850\n\n$wfc $37  Feb 26  .67 10 contract +$70(Opened today) Equity $740\n\n$VZ $56 Feb 26  .58 10 Contracts +770(Opened Today) Equity 1,350", "score": 1, "replies": [{"body": "I just have trouble knowing when to buy? And do you have a stop loss?", "score": 1, "replies": [{"body": "I watch charts when it starts to go south falling through supports. That’s when I get out.", "score": 1, "replies": []}]}]}]}, {"body": "Bro same. I sold when it dipped early today and then it went waaaaaay up after and I could have taken gains. Instead took a loss.", "score": 2, "replies": [{"body": "Still sick to my stomach.", "score": 2, "replies": []}]}, {"body": "We all have stories like that, right now my AAPL march 125C has been losing value for days. I'm holding to expiry, but at one point I was up almost 200%. \nOthers I've panic sold early. \nWith the swings in options trading it'll happen many times. You have to have a short memory.", "score": 2, "replies": []}, {"body": "wfc looks safe for time being", "score": 2, "replies": [{"body": "I’ve been trading the same 3 tickers for a month $bac $wfc $c. They move together and had a very big sell off in the end of January.", "score": 1, "replies": [{"body": "These are slow movers but safe,  you not gonna lose or gain 50% in a month,  probably in 2 years", "score": 1, "replies": [{"body": "I’m up 600% this month. I started with 800 currently sitting at $5590 so yea.", "score": 2, "replies": []}]}]}]}, {"body": "That’s a lot of numbers 😩 I should’ve paid attention in math class...", "score": 2, "replies": []}, {"body": "My question is why did you sell all 10 calls?  Seems you could have sold around half and had profit and let the other half ride?", "score": 2, "replies": [{"body": "It fell .70-80 in first half hour. Falling through support after support from two days prior. Without the news it would of continue to fall.", "score": 2, "replies": [{"body": "Guess I understand your position then.   Like others say, don’t fault yourself, just move on to the next play.", "score": 1, "replies": []}]}]}, {"body": "Glad you made a profit never second guess yourself you made a decision on the information you had ...good play", "score": 2, "replies": []}, {"body": "There will be more... fomo is the combo of the 2 most negative and hindering emotions of any trader. Fear and Greed. Next time. Cheer it on and wait for another one...", "score": 2, "replies": []}, {"body": "These are very good value stocks with strong momentum and yield tailwinds right now.\n\nBuffett sold airlines and banks at the bottom and bought the top on Barrick, don't forget. \n\nIf it's any consolation, you could not have anticipated the news on the asset cap. You did what was reasonable and mitigated your risk - this will make you a good trader in the long run.", "score": 2, "replies": []}, {"body": "Be careful not to attach your emotions in certain positions it'll make you even sicker!! Best of luck going forward though 🤞🏼", "score": 2, "replies": []}, {"body": "It could also went the other way where Fed block Wfc. Do not blame yourself on market randomness", "score": 2, "replies": []}, {"body": "There is no way to predict the future.  Dont beat your self up on decisions you made based on info you had at the time.  \nI was down 10k on some tsla calls and panic sold.  S&p admition announced next day.  If i held to week of expiry, id been up at least 100k.\nIts the game we decide to play.. sometimes works out, sometimes it doesnt.  Cest la vie", "score": 2, "replies": []}, {"body": "No one went broke taking profits", "score": 2, "replies": []}, {"body": "Reminds me when I traded SHOP. Could have made $2000 on a single contract but sold way early for a small 100-200 dollar profit. I was sad for maybe 1 hour and then just shrugged it off and was happen I even profited that trading day", "score": 2, "replies": []}, {"body": "just focus on the downside of the banks when the Central bank will use yield curve control you wanna be in puts ;)", "score": 2, "replies": [{"body": "I’ve been hearing whispers of this do you have any reading material to educate myself.", "score": 1, "replies": []}]}, {"body": "Any day that ends in Profit = goal achieved", "score": 2, "replies": []}, {"body": "lost $1k over the last month. needed to vent :( I need to take a break and focus", "score": 2, "replies": []}, {"body": "Really? I'm pretty sure many here would be a millionaire by now because of many things they did or didn't do. If the stock went on a different direction, you won't be posting this nonsense.", "score": 1, "replies": [{"body": "Rough day bud?", "score": 2, "replies": [{"body": "Just stating facts.", "score": 0, "replies": []}]}]}, {"body": "I don’t care", "score": 1, "replies": [{"body": "haha!", "score": 1, "replies": []}]}, {"body": "haha loser", "score": 1, "replies": [{"body": "haha", "score": 1, "replies": []}]}, {"body": "This is the way say’eth thy diamond hands!", "score": 0, "replies": []}, {"body": "Haha GME💎🤤🦍🦍🦍🦍🦍🦍🦍🤩🤩🤩🙌🙌🙌💎💎💎💎💎💎💎💎💎💎💎💎💎", "score": 0, "replies": []}, {"body": "You needed another year off.", "score": 0, "replies": []}, {"body": "Take the profit and don't look back.   I tried waiting out my last ride.    Was up $2,800, and believed it would go higher.   Now I have -$1800 because of my greed", "score": 0, "replies": []}, {"body": "Because you weren’t buying GUSH 🚀🚀🚀", "score": 0, "replies": []}, {"body": "Everybody misses out when they sell , you must be new to trading .. every trader knows not to dwell on stocks they had that went up !!", "score": 0, "replies": []}, {"body": "Hello everyone just joined options community.  Im new to options and have a few questions.  One if you hit your strike price before the expiration date can you sell or do you have to sell on that date at that price?", "score": 0, "replies": [{"body": "Can sell anytime before the expiration date", "score": 1, "replies": []}]}, {"body": "Never whine about making money.  Its bad mojo.", "score": -1, "replies": []}, {"body": "Who cares that your business 🤦🏻‍♂️no crying in trading you win some you loose some!", "score": -1, "replies": []}, {"body": "Ahh grow a pair lol there's always more. I could have turned a 1k account into 25k when fsly cut guidance awhile back. Instead I cut right before close and lost half if it", "score": -2, "replies": []}, {"body": "I wrote a long ass essay about how i've done the same thing, multiple times, but everyone in this thread has had the same experience so i'm just going to say this.\n\nEven top hedge funds get this wrong. even Dr.Michael fucking Burry got gamestop wrong. No one is perfect, and while the feeling never goes away, its best to just internalize, understand, and move to the next trade.", "score": 1, "replies": [{"body": "I guess if you stop feeling the way I feel after something like this then something is wrong.", "score": 2, "replies": [{"body": "Get rid of your feelings, far as stocks go. Yeah it feels amazing when every deal goes like silk and you feel like money is falling from heaven. But that shit don't last and it can lead to over confidence. Which will blow up your account.", "score": 1, "replies": []}]}]}, {"body": "How do you figure 15k?", "score": 1, "replies": [{"body": "Guesstimate based off of yesterday’s gains and today’s drop and the price right now.", "score": 0, "replies": []}]}, {"body": "There’s always another play. Just got to keep your eyes open.", "score": 1, "replies": []}, {"body": "Did the same with tilray bought out of the money options at 33 strike when shares were at 28, hit 37 AH that same night and I cashed out at like 120% profit in the morning to lock in those gains, that night it closed at 67 or whatever. I have to remind myself profit is profit and especially 120% on an initial investment. good luck on your next play!", "score": 1, "replies": []}, {"body": "Missed out is better?", "score": 1, "replies": [{"body": "Probably but I had a 6 pack so", "score": 1, "replies": [{"body": "I missed out 2 millons with GME.", "score": 2, "replies": []}]}, {"body": "Yesterday I made a nice hit for 10 grand.  I went out later that night and ended up spending a grand on the most beautiful whore I have ever seen in my life. She was absolutely beautiful and worth every penny.  Not a bad day, 9 grand, and the best blow job of my life.                                 ,", "score": 1, "replies": [{"body": "That's another one", "score": 1, "replies": []}]}]}, {"body": "I did this yesterday. Sold at a dip, then immediately jumped 18%....was extremely sick to my stomach but I had good gains so whatever. Not going to start chasing anything now.", "score": 1, "replies": []}, {"body": "I’m glad to see this doesn’t just happen to me then. One rule I’ve started trying to follow is not to do anything in the first 30 mins after the market opens, except maybe sell if you’re up a lot. I fucked myself like that too though after gnrc earnings I sold my 300c when I could have made another 1k if I held for the day and even more if I held longer", "score": 1, "replies": []}, {"body": "I sold 10 4/16  $6 $FCEL option calls at $8.....loss thousands.  Look at FCEL now!!  I was new to trading and it started dropping and panicked bc my buddy sold all his.  Still sick about it 🤦🏾‍♂️🤦🏾‍♂️🤦🏾‍♂️. I still have 3 options left now at least I didn’t blow it all lol.", "score": 1, "replies": []}, {"body": "Bro I missed out on 9k today too on nxtd:/", "score": 1, "replies": []}, {"body": "I think the title should be changed to \"I made less money today\" or something like that. The gut feeling that resulted in less profits, probably prevented (and will prevent) more than 15K loses. \n\nObviously I would be bawling my eyes out if it were me, but I wouldn't have had the courage/instincts to but $WFS in the first place. So kudos on your profits.", "score": 1, "replies": []}, {"body": "You need to secure your emotions if you want to do this for the long haul. If you let it eat you up, you will potentially introduce anxiety and fear into your trades which make for a higher probability of you making a decision that you should not have otherwise. \n\nI’m assuming you’re relatively young, and if you’re in this game for the long haul, don’t worry about it. Iron out the process and stick to it. Earning the money is the easy part. It’s holding onto it that’s harder.", "score": 1, "replies": []}, {"body": "I sold MRNA in Aug after it dropped 25% 🤷‍♂️", "score": 1, "replies": []}, {"body": "Least you made it out positive.  I dont have a lot of money in options, Im just starting out.  Had 1500 in a semiconductor etf, didnt sell yesterday was going to sell this morning.\n\nWas up 800 dollars at some point yesterday, got raked in the pre-market down and lost about 1k nefore I could even do anything to try and save face.", "score": 1, "replies": [{"body": "Started with $800 I’m currently at 5200", "score": 1, "replies": [{"body": "Im still up overall, I knew the semiconductor thing was going to bust I just thought it would be later, I was wrong.\n\nIm up overall barely though, but I might pull through Tommorrow is another day.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I love that song", "score": 2, "replies": []}]}, {"body": "You can only be so results oriented. Especially because confirmation bias exists.\n\nDo you play poker? How often do you fold trash cards and then it turns out you would’ve hit trips or two pair? Feels like all the time, right? So should you be playing those hands? **No.**\n\nYou made a call. Maybe 9/10 it would’ve been the right one. This time it wasn’t. Do you want to be wrong 9/10 times to be right the once? You got your money and got out, you couldn’t have known the announcement would come, don’t overthink it.", "score": 1, "replies": []}, {"body": "I got one that stabs pretty bad too. AABB wanted to put 400$ down on 1.9c. About  a week ago. I was using a new brokerage app fidelity to be exact. I wasn’t familiar with the app and bought 400 shares. The stock currently sits at 30c and that was after an 8c drop today in power hour. I didn’t want to redump after my stupidity because I really wasn’t watching the stock and it rose fast. Was up to 5c like 2 days later. Then we I decided I wanted to get in apparently fidelity has a 2 day waiting period for funds to clear so I was watching my money sit as the stock blew up.", "score": 1, "replies": []}, {"body": "You could always sell higher strike calls against the ones you hold to lock in profit or take your principal off the table. \nBuy your naked position, as stock price rises or exceeds your strike- sell higher strike call. If there's momentum in the move, this is a safe way to profit let it continue running without fear. 💎👐", "score": 1, "replies": []}, {"body": "Listen. Shoulda coulda woulda.\n\nImagine if it went the other way, and you were explaining to your wife's boyfriend, how you lost 15k today.", "score": 1, "replies": [{"body": "Well first off I’m not an idiot and would never marry. So there’s that", "score": 2, "replies": [{"body": "Smart man. 😂", "score": 2, "replies": []}]}, {"body": "Not sure that’s how options work. He wouldn’t have lost 15k", "score": 1, "replies": [{"body": "It's advice hinted with a joke. Take a chill pill kiddo. The day could have been a bust. 💊", "score": 1, "replies": [{"body": "I’m chill, thank you. Just saying", "score": 1, "replies": []}]}]}]}, {"body": "I missed out on 66k with Gme don’t worry", "score": 1, "replies": []}, {"body": "Lol I’ve missed out on multiple 20-30x plays by selling a week early after holding positions for months. Don’t feel bad about this because there will be more.\n\nGotta stick to your guns though.", "score": 1, "replies": []}, {"body": "I spent 5k on some PLUG calls that I sold for 10k. They ended up being worth over 80k. I think about it all the time.", "score": 1, "replies": []}, {"body": "Completely the wrong attitude lol", "score": 1, "replies": []}, {"body": "Sold Tup at ten, it went to 35, sold Sens at 1, it went to 5, sold Glc at 10 it went to 15...been there done that lol", "score": 1, "replies": []}, {"body": "I mean, appl just kept dropping after buffet disclosed he trimmed his position yesterday.", "score": 1, "replies": []}, {"body": "Yup I use to feel the same way as long as you make or break even life is good", "score": 1, "replies": []}, {"body": "We all been there lol", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Not me I’ve been trading the same two tickers for a month up 600%", "score": 1, "replies": []}]}, {"body": "I feel you I missed out on 40k a few months back.", "score": 1, "replies": []}, {"body": "Happens to the best ofnus", "score": 1, "replies": []}, {"body": "It’s a trade.  Once it’s over move on to the next one .", "score": 1, "replies": []}, {"body": "Yikes I know what you mean", "score": 1, "replies": []}, {"body": "No doubt. Take profits and run. I know it isn’t options, like normal for me. My story is Doge coin when it hit .08 I chanced it thinking ok might wake up a millionaire, I had 5 mil coins. Long story short I gambled and lost overall. Missed out on over 250k in profit. Slow and steady wins the race, but dam it sure is fun getting that heart pumping from time to time. I did walk away 100k up but missing 250 isn’t easy to ignore, least not for me.", "score": 1, "replies": []}, {"body": "Time to pick better names and have a thesis for their movement.  That’s what I did when I saw Bitcoin hit 50,000 on a breakout move then pull back around 48,000 and change.  I figured the earlier move made headlines and quickly retreated for profit taking.  I surmised a broader move up by investors would be more gradual and momentum would carry price to retake 50,000 and perhaps more - I was proved right - I did RIOT calls , CAN calls, and HVBTF shares.  I timed the long calls and waited patiently to add short calls after RIOT moved up.  I am still waiting on some price targets for CAN and have GTC orders in play for the CAN short calls as those didn’t fill by end of day - they might tomorrow or the next day.  I’m not saying to do exactly what I did or give any professional advice here as I am not licensed - but I certainly wanted to respond to your post as I have had 6 + years of trades like what you described with not enough of a move and the possibility of price going against you.  My focus is on Blockchain and Cryptos - and I will win.\n\nThere’s a multitude of possibilities in the space.", "score": 1, "replies": []}, {"body": "My biggest regret was virgin galactic. I believed in it so much when nobody did. And I literally sold at $22 with a $17 average and it went to $36 the next week. Now sitting at 50’s", "score": 1, "replies": []}, {"body": "No one ever went broke taking profits.", "score": 1, "replies": []}, {"body": "True dat.  Same thing happened to me yesterday.  I was up on RIOT, it was going down and I sold. It recovered and went up $25 by the end of the day. .  So I bought it back this morning and it soared to $77 today.  Live and learn.  Sometimes you can recover sometimes you can't.  But they are all learning experiences.", "score": 1, "replies": []}, {"body": "My #1 goal is to avoid big losses so you did the right thing if you felt you had to sell. There’s infinite chances to make more money. One thing to consider though is to sell half to cut risk and let the rest play out a little bit.", "score": 1, "replies": []}, {"body": "What do you guys think about the merge bet\nWeen lucid and cciv I just bought 30 shares today", "score": 1, "replies": []}, {"body": "Happens to the best of us. On amc I sold options before it hit 330% in a day and lost out on 5k", "score": 1, "replies": []}, {"body": "I wouldn’t follow Berkshire in and out of trades, they havnt been making that great of pics lately.  Cathy wood on the other hand...", "score": 1, "replies": []}, {"body": "Missing gains stinks, but there’s always another trade. \n\nShort term call options just make me too nervous. I’ve got WFC LEAPS instead. It was a good day.", "score": 1, "replies": []}, {"body": "How do you find your strike price and expiration dates?", "score": 1, "replies": []}, {"body": "Help.. explain options or a good way to learn", "score": 1, "replies": []}, {"body": "You didnt lose out on it, you just made less money than you could. We all have those moments and that one had to sting, but you're still up and other opportunities will come.", "score": 1, "replies": []}, {"body": "It happens, just try to learn from it if possible and move on.", "score": 1, "replies": []}, {"body": "Oof", "score": 1, "replies": []}, {"body": "Huh? $33.50 calls would now be $3.50 ITM (WFC is at $37 AH). If you had 10 contracts that means they'd be worth $3.5k + some extrinsic value.\n\nHow are you getting $15k? Unless they go to $48 this week I think you're way overestimating what you lost out on.", "score": 1, "replies": []}, {"body": "?", "score": 1, "replies": []}, {"body": "Manski2020 you ok?", "score": 1, "replies": []}, {"body": "You never lose by taking profit..", "score": 1, "replies": []}, {"body": "Do you guys think there is still time to grab a wfc Feb 26 $37 call and make money?", "score": 1, "replies": []}, {"body": "it’s just like going to Vegas you win some and you lose some, but in recent light of the GME debacle i feel you have a better chance in Vegas, the system in Wall St. is rigged", "score": 1, "replies": []}, {"body": "It’s better not making the profit then going into debt. Always trust your gut even if it’s wrong on the off day", "score": 1, "replies": []}, {"body": "Stop whining and be happy that you walked with profits.....", "score": 1, "replies": []}, {"body": "With spiking oil and gas prices GUSH is gonna hit 2500+ by year end", "score": 1, "replies": []}, {"body": "Can anyone recommend where to by crypto. I’m new to the game. Thx in advance.", "score": 1, "replies": [{"body": "Crypto, is weird you just incrementally add some money randomly to cheapest, and most expensive the bitcoin. You don’t get munch in bitcoin, but little players all can offer you better value. Just personal experience, if uou missed bitcoin at $3000, it is not something you get a bang on your bucks. But you never know which one pop in next few years. But one of them well.", "score": 0, "replies": [{"body": "Thank you all for you help. I downloaded coinbase and bought 4 Ethereum. Let’s see how it goes. Thanks again everyone for your help.", "score": 2, "replies": []}]}, {"body": "Coinbase. I also recommend Exodus for a cryptocurrency Wallet when you decide to move your xrp. It is not convenient enough to move my other coins. Just my Bitcoin", "score": 1, "replies": [{"body": "Coinbase, ok thank you. I’ll check it out.", "score": 1, "replies": [{"body": "For sure. And right now BTC is quite high. People will sell. Buy the dip. That’s what I did a month and a half ago", "score": 1, "replies": [{"body": "Can you buy partial coins? I don’t have 50 liquid. I was thinking eurethium. I think that’s how you spell it. Haha", "score": 0, "replies": [{"body": "Yes you can buy with usd from your account. I have .0038863 BTC if I’m remembering properly. I started with 240$ back when Bitcoin dropped to 29k. And it was worth .0088btc. But my initial investment is worth 350$ today at the coins value. So I have my deposits coming from my savings account. I think everybody is buying partial coins. But be careful before you move any. There are fees but other apps are worse.\n\nEthereum quite valuable still. But it is up lately from 1.5k last month. I should’ve put more money in both of them when I did my initial investment. Also on coinbase you can trade btc to other coins. I have 5 other currencies.", "score": 2, "replies": [{"body": "Great info. Thank you very much. I’ll do my homework today.", "score": 1, "replies": []}]}, {"body": "You can buy bitcoin cents instead of whole dollar,,, they have specific name. But Ox XRP, Eth all or some of  them have future. It if they pop they are big. I have heard of XRP and Ox etc now they are less than 60C. Some think they may go to $200,,, but all speculations. You know same happened when bitcoin was less than $300 per coin. Some believed it some not. If you bought in latest dip if $3000, 200 coin now 600K. But it is again betting against some odds as you do in stocks, it is not different. Even Warren Buffet was wrong on bicoin, you can imagine that, but Secretary he may bought BTC. How Jeff Bezos sell one Tesla for one coin or less????", "score": 1, "replies": [{"body": "Thank you for the tips. I signed up for coinbase and made some transactions. It’s going well. Thanks again for the info.", "score": 2, "replies": [{"body": "I am glad it worked, any wealth expands with sharing! All great people here teaching us a lot, 🙏", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Slow and steady wins the race! lol", "score": 1, "replies": []}, {"body": "ONCX & NOUV looks good these past 2 weeks.. Let’s go!!", "score": 1, "replies": []}, {"body": "I feel your pain. It’s all about timing.", "score": 1, "replies": []}, {"body": "Dont worry, I lost out on more than 20K in gains because I paper-handed... Sold CCIVW at 13 last week, SFTW at 2 same week...", "score": 1, "replies": []}, {"body": "So wat should I buy today? N e ideas before Friday ends", "score": 1, "replies": []}, {"body": "I changed my plan today due to the action on CAN as well as RIOT.  I’m still holding HVBTF shares with a paper profit.  I had to adjust - I did exit RIOT call verticals but had to cancel my GTC short calls on CAN and exited the long calls before the further drop occurred.  It may take some time for my OTM RIOT longs, but I’m confident given the Bitcoin action I’ll be fine - may take another day or so.", "score": 1, "replies": [{"body": "Don’t forget Riot jumped once in BTC rise to 2K. It has crazy dips, but if you believe in BTC it may go this time above 2K. But get some option with 2022 expiration date with more than 100 per stock price it has cheap wide verticals IDM. I remember at BTC crash I sold riot at $4 bought it for $16. It is mirroring BTC.", "score": 1, "replies": []}]}, {"body": "Guh", "score": 1, "replies": []}, {"body": "Man any profit is better than no profit just go ask some of those folks that held on to game when they could have made a killing smile and enjoy you came up", "score": 1, "replies": []}, {"body": "I need help to get on your level ! I’m completely lost about the market", "score": 1, "replies": []}, {"body": "Any thoughts on the RMO plunge", "score": 1, "replies": []}, {"body": "This is the way", "score": 1, "replies": []}, {"body": "Today is not a day to look at your profile, if you are a option trader, just have a bear enjoy your day, specially if you have long contracts of apple amazon etc, and you have bullish spread. It is depressing while you know the red in your stock in your  profile, doesn’t makes sense,", "score": 1, "replies": []}, {"body": "I don’t even know what this means, except you made money... what type of trading did u do?", "score": 1, "replies": []}, {"body": "Anyone have bitwise in the portfolio I don’t just was asking opinions I see it doing double digits greens when the whole market on my list is in the red", "score": 1, "replies": []}, {"body": "Profit is profit. And the potential gains were never yours the moment you sold, so don't fret too much. I had many of these instances happen. Just shrug it off and on to the next one", "score": 1, "replies": []}, {"body": "Youre too emotional, take a break for a week or you're gonna start losing. At least, thats what happens to me", "score": 1, "replies": []}, {"body": "Always do the opposite of what Buffet is doing, unless you have his kind of assets", "score": 1, "replies": []}, {"body": "Damn that’s harsh", "score": 1, "replies": []}, {"body": "Hey man I lost 70% of my 11k PLTR calls this week. Could be worse.", "score": 1, "replies": []}, {"body": "Taking profits is ok, and it’s better than gambling.", "score": 1, "replies": []}, {"body": "No FOMO bro.", "score": 1, "replies": []}, {"body": "I was up 1,100% on riot blockchain yesterday evening and thought about taking the profits, but I said I’d let it ride for another day and bang!!!   Down about 8k today alone, but I’m up nicely now on BCII", "score": 1, "replies": []}, {"body": "Why didn’t you roll to March?", "score": 1, "replies": []}, {"body": "If you don’t get that out of your head it’s going to make you take unnecessary chances. Stay the course make high probability trades and don’t worry about it. Everyday offers new opportunities.", "score": 1, "replies": []}, {"body": "We can only work with the info we have..atleast u knew the catalyst. I just see money come n go this week a lot has gone I think its due to earnings big loss on tesla 795 call dte 2 19", "score": 1, "replies": []}, {"body": "instead of taking close option calls I'd suggest you to go for option leap for around a year or 8 months apart, you could very well use 15k with these bank stocks without getting affected by sudden market fluctuations", "score": 1, "replies": [{"body": "The sudden market fluctuations is what is giving me the gains", "score": 1, "replies": []}]}]}
{"title": "Blackberry: Bear Case", "selftext": "The more in look into Blackberry and Connected Cars and Unified Endpoint Management the ***more bullish I get on BB***, on top of that Reddit is filled with CONSTANT confirmation bias. To ground myself I wrote a bear case, please help me add to it, ***the stronger we can make the bear case, the more clear we will see the potential opportunity*****.** \n\n# Macro: \n\nIvy will not be released till 2023, developers are not expected to get access till 2022 **Far too early to expect Ivy to benefit BB’s bottom line.** Without it, stock price will not moon.\n\n**Collaboration/partnerships** with 3rd parties (AWS, Biadu, IBM, Hyundai via Motional, Microsoft (crisis management/Microsoft Teams)) to develop technologies, products and services  **may not result in ROI**\n\nSome OEMS and tier 1 customer have accelerated **internal development of embedded solutions** could result in fewer customer orders, loss of market share, pressure to reduce prices, etc\n\nCOVID-19 Impact, Chip storage hitting the automobile sector resulting in revenue decrease of 16% in Q3 FY21, **could continue into the future**\n\n**Market is highly competitive**:  IBM, Microsoft, VMware, Mobile Iron, CrowdStrike to name a few\n\nTechnology landscape: **evolving customer requirements, high frequency of product introductions by competitors** could leave BB behind\n\nMaintaining key personal: success is dependent on ability to develop/retain skilled employees (executive team, R&amp;D team, experience sales people with specialized knowledge). Competition is intense, has resulted in **solicitation** resulting in higher compensation costs not offset by higher prices\n\nChanges in endpoints, operating systems and applications, security threats and industry standards \n\nMust obtain/maintain certain product approvals and certifications from government bodies and regulated enterprise customers, although BB is already ISO26262 certified (auto industry)\n\nBBs software runs on \\*3rd party operating systems\\* (Apple, Google, Microsoft, OEM op systems). **Updates to these op system with limited notice can disrupt operations**, forcing company to divert resources from preexisting product roadmap to accommodate changes \n\nMeeting debenture covenants\n\n# Financials\n\nRevenues have stalled, **growth is challenged** based on current financials\n\n**BB** (4%) **trails the average revenue when compared to competitors** **in each space** in Enterprise Software (5%) , Licensing &amp; IP (10%), Cybersecurity (10%), Canadian Enterprise Software (9%) per TD Securities equity research\n\nNormalized operating expenses have fluctuated although below average for last 8 qtrs\n\n**Hasn’t reported a profitable qtr since Q4 FY19** (Feb 2019)\n\nLet me know if I missed anything.\n\nCurrently holding ~400 shares @ $12, I started buying last week, before WSB happened\n\n**Edit**\nNew points added from the discussion below and my observation..\n \n**Perception: Many retail investors still consider BB a smartphone maker**, John Chen and the BB marketing team need to rebrand to change this perception. Other than their PR releases and twitter, I don’t see much else..i could be wrong..  **Although BB deals with B2B not B2C**, specifically they are niche with OEMs, governments, banks and healthcare.  One could argue no marketing is needed as a result, the security industry is well aware of the best products.\n \nWSBs: I’ve been active in the BB community for 2 weeks now, and **ALOT of people are bag holding, ALOT, which is why I believe your seeing so many pumps**, granted BB has been killing it with their constant updates with partnerships..not sure what came first but someone had posted a chart showing the correlation between BB, GME, AMC, and they are moving in sync!\n \nBB Cylance (AI and machine learning-based cybersecurity solutions) **was trending down from 20% of revenue in FY20 Q1 to 10% by the end of the FY.  Since then, BB stopped breaking out revenue between IoT and Cylance and now present it as one (Software &amp; Service)**", "id": "lmcvkk", "created_utc": 1613619839.0, "score": 1493, "upvote_ratio": 0.94, "num_comments": 220, "comments": [{"body": "Thanks for the review.  Long shares so hope your bear thesis is wrong.  We all need an inversion of our investment thesis so this was helpful!", "score": 283, "replies": [{"body": "If this is BB, we need more bad news for the stock to rise again.", "score": 20, "replies": []}]}, {"body": "Thank you for doing bearish DD. It seems like all DDs on Reddit have a short bear case section if one at all. We need two sides to make an informed decision.", "score": 94, "replies": []}, {"body": "[deleted]", "score": 131, "replies": [{"body": "(/r/stocks tries to change it up and post a bear case for BB)\n\n*(BB still goes down 8% every single day)*\n\nReally the BB posts are like the first thing that I kind of regret buying into on this sub. But it’s only shares and a few calls so I’ll hold out.", "score": 23, "replies": [{"body": "[deleted]", "score": -16, "replies": [{"body": "I mean its good long term its just that we failed to see that it was up like 100% on the 3 month due to meme stuff.  So it was almost guaranteed to go down in the short term.", "score": 6, "replies": [{"body": "I bought in before the run up at like $8 CAD and bought a little more on the way up for an average price of $13.59 CAD. I feel like a moron thought because at some point I filled my sell order for $37 CAD and didn't execute, didn't even sell a single stocks. Would have made me close to 50k CAD if I executed the trade, now I am almost back to my original buy point. At least AMC in januray and a SPAC lately have been making me a lot of money, but I am still kicking myself about not executing this trade.", "score": 2, "replies": []}]}, {"body": "That's because you bought in after it had already jumped 100%.... I found a fantastic DD on reddit back in december, jumped in then at 7 bucks, and made over a grand. Took profits when it hit 20 bucks, and now we sit and wait. This has been a fantastic play for anybody that didnt fomo into it, and to even suggest never buying a reddit recommended stock again is just pure stupidity. There are fantastic DD's all over reddit and to completely disregard all of that is just absurd.", "score": 2, "replies": []}, {"body": "“Yeah **i lost 30$ on it and felt like shit**. Can't imagine people losing thousands.\n\nI've decided to never buy anything reddit mentions again.\n\nThe rest of my portfolio is **up 50$ in a month**, so at least my loss was offset. Still felt dumb for buying into memes.”\n\n\nLol bruh. Sorry to sound like an asshole. But you’re making a huge deal out of really really tiny gains and losses.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "If you’re tripping over a 3% loss, trading might not be for you", "score": 0, "replies": []}]}]}]}]}]}, {"body": "You're going to get downvoted just from bagholders reading the title but you've done the right thing. This is what due diligence should actually consist of.", "score": 696, "replies": [{"body": "Thanks ianhouser", "score": 169, "replies": [{"body": "Heavy bag holder checking in- upvoted for the great bear thesis. Finally something other than the usual-\n\n“fuck guys, BB literally cannot go tits up. Get your moms, Dad’s, and grandmas to throw their life savings into this baby before it hits the moon 🚀 *whoosh*”.", "score": 93, "replies": []}, {"body": "[removed]", "score": 11, "replies": [{"body": "Just started entering into BB last week. I’ll continue adding. My goal is 1000-1500 shares at current prices. Hoping BB bleeds a little more before I add. \n\nThe 400 are currently less than 5% of my portfolio", "score": 16, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "I’ve been lucky, done really well over the last year (TSLA, Bynd, Pton, SPACs lol) so I got cash I want to put into a long term play, therefore I don’t mind sitting on a LT play with the potential of 5x..\n\n1000-1500 shares will equal less than 10% of my portfolio, and time horizon is 2023-2025.\n\nAlthough that option strategy is cleaver, hmm I may consider this, gotta play around with optionpricecalc..is there a name to the strategy?\n\nMy only issue is timing it via options increases my risk..", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Totally agree, Ive been ignoring Valuations for the most part bc of the market we are in.\n\nBelieve me I think I’m the shit bc of those picks, bc is “researched them” haha but I’m not, most of it is luck. \n\nI def want to get ahead of this bull market stopping, esp before the interest rate increases in 2-3 years.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "I'm down 20k on BB. Thank you OP for making this post. It is important to see the truth, no matter how unpleasant.\n\n&#x200B;\n\nI do think BB still has potential for long term, no way I will sell, I think I'd rather end up with the bag then sell for 50% loss and have it go up.", "score": 51, "replies": [{"body": "Ouch! Maybe average down here and there. But Yaa, def hold.", "score": 9, "replies": []}]}, {"body": "Explain to me why I, a bagholder, cant also buy puts to hedge. Off of Hopium. Two days sober.  Puts will print until they dont", "score": 4, "replies": []}, {"body": "Funny how I didn't see a single bear post on BB reach the front page for a month but now that it's in a slow decline and didn't go to the moon like they hoped, only now the bears get up voted. I hate this subs groupthink so much", "score": 13, "replies": [{"body": "Bro, I’m still bullish, but cautious. Instead of going balls deep, yoloing into it, I’ll to my position over the next 6 months", "score": 23, "replies": [{"body": "Cautiously optimistic? I’ve only heard successful investors speak like that, are you sure you’re doing it right?", "score": 5, "replies": [{"body": "I had to Google how to spell cautious..", "score": 16, "replies": []}]}]}]}, {"body": "Most \"investors\" here have no clue what an actual DD/analysis is. If there isn't a bear case/moat/serious competition analysis it'd a pump and dump. All thumbs up/rockets/whatever = be wary", "score": 2, "replies": []}, {"body": "I don't think so. From all meme stock bag holders the BB people are the most patient.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -31, "replies": [{"body": "It's a bear case, and OP is a bull. It's the duality of a well researched decision.", "score": 32, "replies": [{"body": "[deleted]", "score": -10, "replies": [{"body": "That's what everyone's here to talk about. I hope you share your opinion", "score": 13, "replies": []}, {"body": "Expand. I'm a neutral party with no position. Curious what's wrong?", "score": 5, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "Well done", "score": 5, "replies": []}, {"body": "Thank you", "score": 3, "replies": []}, {"body": "Damn you were getting shit on by downvotes in your earlier comments but knew exactly what tf was up the whole time. Thank you for sharing your opinion regardless of people downvoting, this was helpful", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Well you were wrong lol", "score": -4, "replies": []}]}, {"body": "My $18 positions don’t like this lol", "score": 37, "replies": []}, {"body": "I believe in BB long term. No one wants to hear that. They just want their nut but sometimes it’s ok to edge. Make the nut last longer.", "score": 210, "replies": [{"body": "Hahaha! Your terrible, your a badguy", "score": 61, "replies": [{"body": "Just because you are ~~Bad~~ **Bag** Guy, doesn't mean you are **Bad Guy**.\n\n- Wreck it Ralph", "score": 25, "replies": []}, {"body": "*You're", "score": -23, "replies": [{"body": "Hahaha you hav no idea wats goin on", "score": 12, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Stfu xnet", "score": 2, "replies": []}]}]}]}]}, {"body": "You say no one wants to hear it, but all I see on Reddit is people pumping BB tires, like they’ve got something special going on.", "score": -2, "replies": []}]}, {"body": "Good write up. Like you, I’m a bag holder for BB. My question is, do we cut losses right now and reinvest elsewhere to make back our losses? Or do we hold (or average down) and stay patient?\n\nMy big concern is that BB stays dormant for an extended period. It might eventually grow (which I believe it will), but are we missing out on other opportunities while we’re just playing with our wieners over here?", "score": 71, "replies": [{"body": "This is my exact thought. Down about $4k on BB. Might just take my $3k 2021 capital loss now...", "score": 21, "replies": [{"body": "How does the capital loss work?", "score": 6, "replies": [{"body": "You can offset capital gains with capital losses, but to the extent that you don’t have any cap gains, you can still deduct up to $3,000 worth of capital losses for the tax year.", "score": 29, "replies": [{"body": "[removed]", "score": 14, "replies": [{"body": "Yes exactly! You can carry forward your capital losses forward indefinitely until exhausted completely.", "score": 13, "replies": [{"body": "By forward you mean from that -5k example you could do 3k for 2021 and another 2k for 2022?\n\nThis is helpful, thank you!", "score": 5, "replies": [{"body": "To be more clear though, you need to take a look at your tax bracket. It’s foolish to only do the $3K loss, if it’s not going to move you into a different taxable bracket. Otherwise, it doesn’t move the needle very much in terms of the write off. You’re better off to wait until you have gains to offset directly", "score": 3, "replies": [{"body": "Ah I was wondering if it was better to just carry over the losses to subsequent years (saving it to offset gains) or to take advantage of the 3k deduction every year. Thanks for the info!!", "score": 2, "replies": []}, {"body": "Yeah that is a very valid point. I may be a CPA, but this is why I don’t do tax🤣", "score": 1, "replies": [{"body": "Lmaooo. I only know this cause I’ve been carrying like 24K in losses for the last few years. On target to wipe it all out for this tax year though haha", "score": 4, "replies": []}]}]}]}]}, {"body": "That’s correct", "score": 1, "replies": []}]}, {"body": "When we file our taxes do we need proof of the exact amount that we lost or can we just estimate the amount when filing taxes? And if we do need proof, how would we find out the exact amount?", "score": 1, "replies": [{"body": "Yes, you should receive a form 1099 from your broker. This has all the proof you need.", "score": 7, "replies": [{"body": "What if I used Robinhood when I lost that money?", "score": 1, "replies": [{"body": "Robinhood sends 1099’s don’t worry", "score": 7, "replies": []}]}]}]}]}]}]}, {"body": "Wouldn’t it make more senses to hold on with the prospect of it going down more? You’d be able to sell your loses to offset gains.", "score": 8, "replies": [{"body": "Unfortunately, you are right: the loses off set the gains. Forget taxes, that’s not good. \n\nNow... if you have gains AND you also have unrealized loses, it’s good to make them ‘realized’ to pay less tax on the gains, but intentionally losing money just to pay less tax or hoping a position will go down even further is silly/foolish/stupid. \n\nI’d rather have all winners, huge gains, and pay taxes than no gains, no profit. Since I don’t have all winners, I’ll tax loss harvest, but I won’t burn money just to make it worse.", "score": 10, "replies": [{"body": "Yeah you’re right. Losing money purposefully is foolish.", "score": 1, "replies": []}, {"body": "Would your advice differ is there is no capital gain tax involved?", "score": 1, "replies": [{"body": "Your question is unclear to me, but my best response is: don’t intentionally try to lose or hope to lose money to offset a gain. Gains are good, despite the portion you need to pay in taxes.", "score": 1, "replies": []}]}, {"body": "I guess technically you could utilize this to offet taxes on realized gains by realizing your loses for tax purposes and then buying back if you're planning on holding regardless. But you'd have to pay taxes on the gains regardless eventually unless you move it into a tax free account 🤔", "score": 1, "replies": [{"body": "That would be a wash sale I think, depending on the investment tool you use.", "score": 1, "replies": []}]}]}, {"body": "In almost no situation does it make financial sense to continue holding a security intending to increase your loss. (Real estate can have very weird rules so this is just stock)\n\nA $1 loss is still a $1 loss, even if it lets you save 30-50¢ on taxes", "score": 2, "replies": [{"body": "It’s not so much as intending as if the stock does go up you could benefit from it. This isn’t an intentional purchase for tax harvesting, it just happened that way. And it really depends on how much your initial investment dropped, so I wouldn’t take this as a sweeping statement for all loses. But the meme stocks are basically paper losses until they’re realized at the end of the year. \n\nI’m not 100% on the legality of talking about this or advocating for it, just asking questions.", "score": 1, "replies": []}]}]}, {"body": "'Opportunity cost' is a phrase that may save you many words in the future", "score": 5, "replies": [{"body": "Why waste time say lot word when few word do trick", "score": 3, "replies": []}]}, {"body": "Depends on your goals and how the rest of your portfolio is setup, when you need the money, etc. You got to make the decision.\n\nI’m not bag holding, I started my position last week, my average is $12,", "score": 2, "replies": []}, {"body": "Not sure why you wouldn't hold especially if they are shares. Loss is only a loss when sold at a loss. I guess it depends on how much money you have tied up in BB and can you go for an extended period of time without it. \n\nHowever, you should've known BB was a long play and simply got coupled with the meme stocks back a few weeks ago.", "score": 1, "replies": [{"body": ">Not sure why you wouldn't hold especially if they are shares. Loss is only a loss when sold at a loss.\n\nThat's a very misleading sentiment. You are losing out on potential gains from other investments. So you are losing as we speak. Furthermore, there is an assumption that BB will go back to January prices.", "score": 10, "replies": [{"body": "Yea thats why he wrote \"I guess it depends on how much money you have tied up in BB and can you go for an extended period of time without it.\"\n\nI have 400 BB shares with an average price of $13.5 Im holding because honestly, its nothing to me. Yea sure opportunity costs, blah blah blah....but $5K is nothing to me at this point so I'lll just bag-hold for the time being.", "score": 6, "replies": []}, {"body": "Already pointed that out", "score": 2, "replies": []}, {"body": "The way I think about it is, I decided before I bought that is going to be a long play therefore the fact that is down right now does not change anything, because even if it was trading at 15-18 per share I would still not sell it.", "score": 2, "replies": []}]}]}, {"body": "If you believed in it at $15 then this dip should get you excited. Investing =/= trend following", "score": 1, "replies": [{"body": "Yep, no doubt. The dip did get me excited and I used it as an opportunity to average down.\n\nBut recently more analyst have contributed analysis to BB and there’s been plenty consensus among “professionals” that the growth expectations should be tempered, at least for now. Lots are declaring single digit value for the short term. Was just curious what ppl thought about the opportunity cost vs long term potential.\n\nI still believe in the long term value of BB but I could probably hop back on the train at nearly the same cost in 2-3 months.", "score": 2, "replies": [{"body": "Analyst ratings mean jack shit. When AMD was in 50s they didn’t rate AMD that well.", "score": 3, "replies": [{"body": "No doubt, which is why I called them “professionals.” But some of their fundamentals make sense. Mostly stuff that OP listed in his Bear Case, which his why I posed the question. Opportunity Cost vs. BB Long Term Value?", "score": 1, "replies": [{"body": "I don’t know really what else to get in this market so I can wait. 🤷‍♀️", "score": 1, "replies": [{"body": "Haha fair point. I’d probably lose my money elsewhere anyway, which is the primary reason I’m still holding on.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Bullish on BB but loved this DD. Great job, OP.", "score": 35, "replies": []}, {"body": "Bagholding 500 shares which are now worth almost half what I paid...but I'm hoping as long as the market doesn't go into a full on nosedive bb will find a bottom around $10 usd? Idk what do you guys think?", "score": 29, "replies": [{"body": "Look at it as a 5 year hold, when it’s over $100 you’ll wish you had bought more. \n\nIf you were short term and buying the hype, take the L and sell.", "score": 21, "replies": [{"body": "5 years is fine with me... I'll just keep buying", "score": 10, "replies": [{"body": "Yup my best stocks I’ve bought at all time highs. Those all time highs after few years look like steals.", "score": 14, "replies": [{"body": "🍻", "score": 6, "replies": []}]}]}]}, {"body": "march pocket aback complete shrill cows license ring absurd materialistic\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 5, "replies": []}]}, {"body": "First bear case I’ve seen for BB!\n\nThis should produce a green day yes?", "score": 28, "replies": []}, {"body": "I like it. Buying more tomorrow.", "score": 28, "replies": []}, {"body": "Thanks for the Bearish DD. I hope short term paper hands will fall on this. \nBtw, I am also long with 258 shares and believe in company’s future.", "score": 8, "replies": []}, {"body": "[deleted]", "score": 19, "replies": [{"body": "A small counter point I will make as someone who works in the industrial automation sector, and deals with a lot of custom languages etc, is i do find the dev support for these outside sectors (that aren't pure desktop/mobile/web) is a bit non existent. I tend to get most my info from developer knowledge bases, internal company people, and the old fashion figure it out yourself.", "score": 3, "replies": [{"body": "So you would agree that the developer community is small for QNX. Are there alternatives?", "score": 2, "replies": [{"body": "Oh i hope my comment didn't imply i work with QNX. More that i work in a similar industry, and we typically don't use stuff like stack overflow.\n\nI mean having a quick look at BB they have a forum which requires sign up to access, so I'd imagine there might be better support there.\n\nFurther more while I haven't worked with embedded systems in quite a while, a lot of the knowledge between systems is quite transferable. So to the end engineer who has to develop the code, its just another embedded platform to work in.", "score": 2, "replies": [{"body": "This is good to know! Thanks bud!", "score": 2, "replies": []}]}]}]}, {"body": "Dude! Thanks for this, great to get insight from someone who is in the space. I’ll dig into this.\n\nI believe your right about the developer community being small is a risk, but I also believe you’re right about the variance stemming from your industry and OEMS which BB specializes in. Is there a way for us to find out how BB stalks up in the auto industry for developers?", "score": 1, "replies": []}, {"body": "Are those two companies that you mentioned good investment decisions?", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Neither company shows up on TD Ameritrade. Its good to know companies like the ones you mentioned. You never know what might happen down the road. This is why reddit is a such a great place, knowledge is exchanged freely. I definitely wouldnt know what companies BB is in competition in terms of government certifications. I appreciate you sharing your knowledge.", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 38, "replies": [{"body": "Blackberry also has one of the most prestigeous technical universities in North America within spitting distance of its headquarters...the university of Waterloo...i'm sure they have their pick of the litter for engineering talent coming out of there.", "score": 36, "replies": [{"body": "I studied CS in Waterloo 3 years ago and BB was definitely not an attractive place to be an intern or new grad. People would only take it if there absolutely nothing else for them. With the tech scene growing in both Waterloo and Toronto, I would imagine they now have an even slimmer chance of retaining retaining and attracting good talent.\n\n1000 BB@15", "score": 36, "replies": []}, {"body": ">.i'm sure they have their pick of the litter for engineering talent coming out of there.\n\nYou'd think so, but companies with better growth will attract better engineers.", "score": 12, "replies": [{"body": "Of course proximity matters...LOTS of high potential students probably receive offers during Co-op placements that decide to stay onboard...$ isnt everything to everyone...", "score": 8, "replies": []}]}, {"body": "Sorry but I think this is very wishful thinking.  Most people aren't trying to stay near their school after graduation, it's just not a priority.\n\n\\> pick of the litter\n\nMore like.. Pick of the few people who are trying to stay near school for a year or two  until their younger SO graduates.", "score": 4, "replies": [{"body": "Saw it many times during my tenure being 36 now...but I also live in a desirable area in Canada...", "score": 2, "replies": []}]}, {"body": "Distance don't matter, it's about the salary compensation", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "No need to be so angry because you're so misinformed about the salary of a field. Money talks, top talents will only consider a less paying company is if they have tremendous growth and have potential to cashout on stock options. BB have showcased neither of those yet\n\nIt doesn't matter if there are far more L3 than L6 at Google, these are the companies all the engineers strive for and those that don't cut it have to settle for less.", "score": -11, "replies": [{"body": "yeah netflix pays more than 500k for a senior engineer https://twitter.com/theckman/status/1344708919889805312 \ni believe google would be on the same level\n\nif you check it out, hes saying it's all cash too no stock options even included yet", "score": 4, "replies": [{"body": "A lot of people have no idea how well paid faang engineers are, I'm not surprised by the skepticism. If you are not in the field or paying attention to rd cost you wouldn't believe it either. 500k salary developers are not uncommon in silicon valley. Its to be expected when tech in CA is shittng out new millionaires by the thousands every year after massive decade long bull run in the tech industry", "score": 2, "replies": [{"body": "Yep, have seen some pretty reputable tech folks post their offers before.\n\nEg Tracy Chou getting an 800k offer from googz  five years ago\n https://twitter.com/triketora/status/1360547891312553986?s=21", "score": 3, "replies": []}, {"body": "Very few people make it to that level though. You don't make that kind of salary based only on technical skills alone nor do you make it there just because you've been there for 6-10 years. \n\nI'm not so sure I would say 500k salary developers aren't uncommon either. I mean it's like saying multi-million dollar basketball players are not uncommon in the NBA. Sure Steph curry makes tens of millions every year but G league players and bench players make a fraction of what he and other superstars make. A 500k salary in SV will easily put you in the top 5% or top 10% of developers so in that sense i wouldn't really say it's common.\n\nAlso to address the 200k right out of college claim, that is as you've mentioned, referring to other factors that make up a TC of 200k. Hardly any junior engineers are getting 200k base out of college unless you're going to FB (and are extremely talented) or a quant shop. It's really more like 120k - 130k base for juniors at FAANG these days. \n\nWith that said you should probably factor in cost of living to paint a more accurate picture. Almost all of these high salaries are being paid to the employees in SF or NYC where $120k-130k salary is really more like earning $80-90k elsewhere. \n\n>these are the companies all the engineers strive for and those that don't cut it have to settle for less.\n\nYes and no. Every junior engineer certainly strives to work there but most actually leave after around \\~2 years or less. This is for a variety of reasons but I'm sure many decide to leave to go to startups or unicorns or start their own company if they're so inclined.", "score": 2, "replies": [{"body": ">Also to address the 200k right out of college claim, that is as you've mentioned, referring to other factors that make up a TC of 200k. Hardly any junior engineers are getting 200k base out of college unless you're going to FB (and are extremely talented) or a quant shop. It's really more like 120k - 130k base for juniors at FAANG these days. \n\nI never said base pay, 180k-200k for right out of uni including bonus and stock option are the industry normal right now for any well known tech companies. 120k was so 8 years ago. Data sets for these are very well known, feel free to check yourself.\n\nThe **median** software engineer salary package for bay area is 240k according to levels, fyi. There is a reason why cost of living and real estate is so high here, tons of tech millionaires. \n\nhttps://www.levels.fyi/Salaries/Software-Engineer/San-Francisco-Bay-Area/", "score": 0, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I'm really not going to waste more time with someone who's obviously not in this field. Seriously you're incredibly out of touch with what tech is paying these days, you can confirm this with anybody else that's working at faang if you don't believe my personal experience. \n\nlevels.fyi is also legit, they're as very up to date with what top tier companies are actually paying since their verified program requires actual w2 or offering letters.\n\nPeople don't go to google and accept measly 140k job offers including comp, this isn't 2012", "score": -1, "replies": [{"body": "[deleted]", "score": 3, "replies": []}]}]}, {"body": ">I never said base pay, 180k-200k for right out of uni including bonus and stock option are the industry normal right now for any well known tech companies. 120k was so 8 years ago. Data sets for these are very well known, feel free to check yourself.\n\nOkay well let's check some out. You can find average TC on levels and also median if you check out the salary ranges box slightly below on each of these pages. I'll go ahead and be referring to them mostly as one in the same since it looks like for most the median and average are roughly equivalent.\n\nAmazon \\~160k TC\n\n [https://www.levels.fyi/company/Amazon/salaries/Software-Engineer/SDE-I/](https://www.levels.fyi/company/Amazon/salaries/Software-Engineer/SDE-I/)\n\nApple \\~170k TC\n\n[https://www.levels.fyi/company/Apple/salaries/Software-Engineer/ICT2/](https://www.levels.fyi/company/Apple/salaries/Software-Engineer/ICT2/)\n\nGoogle \\~180k TC\n\n[https://www.levels.fyi/company/Google/salaries/Software-Engineer/L3/](https://www.levels.fyi/company/Google/salaries/Software-Engineer/L3/)\n\nMicrosoft \\~160k TC\n\n[https://www.levels.fyi/company/Microsoft/salaries/Software-Engineer/SDE/](https://www.levels.fyi/company/Microsoft/salaries/Software-Engineer/SDE/)\n\nFacebook \\~180k TC\n\n[https://www.levels.fyi/company/Facebook/salaries/Software-Engineer/E3/](https://www.levels.fyi/company/Facebook/salaries/Software-Engineer/E3/)\n\nso among FAAMG only F and G really pay anywhere near what you're claiming. And even then the average and median aren't 200k. I did not include Netflix since they only have senior engineer data on hand. Sure it's not unheard of for junior engineers to get offered that, and you can certainly find other unicorn companies in SV that do pay upwards of 200k but that is hardly the norm for \"well known\" tech companies. For any one of those I could probably find you 5 more that pay in the 130k - 140k range.\n\n&#x200B;\n\n>The **median** software engineer salary package for bay area is 240k according to levels, fyi. There is a reason why cost of living and real estate is so high here, tons of tech millionaires.\n\nYes, the data you've linked to takes into account all different levels of software engineers though, not just juniors. I don't really see your point in bringing this up. Yes experienced engineers make nice money in SV, I'm not denying that. I took issue with what you were claiming most junior engineers enter the field making 200k and the fact you were saying $500k isn't uncommon. 200k is pretty extraordinary for juniors, hardly the industry norm. A select few unicorns will pay that and a few FAANG will pay that to some juniors but as you can see above that isn't the median for junior engineers. \n\nAlso you can see in the very data that you linked to, a $500k TC puts you in the 98th-99th percentile of engineers. This is the top 1% of engineers... saying a salary like this is \"not uncommon\" is wild. There's big money in tech yes but they aren't handing it out like candy.", "score": 2, "replies": [{"body": "I'll grant you I may have slightly too high of estimate, but 160-180k average for starting salary is still a lot closer to 180-200k than 120k and it's not significantly off. And most of my figures are based off of silicon valley since that's where I used to work, which is actually that high when you start breaking down the salary by region.\n\nYou also need to make 400k earner to be considered top 1% in the US on average, many are concentrated in the bay area. Anywhere between 5-10% of google engineers are in the L6 which is 400-500k salary and its similar for all the faang companies. The 500k earners are closer to 3 percentile in the entire bay area, but for faang itself it is a much larger percentage which this discussion is about not the entire engineer workforce as a whole. We all know there is a significant salary discrepancy between computer scientists", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I gave you data to support it. Literally waste of time replying this since obviously you just double down on being ignorant. You're clueless who thinks no engineer at google makes 500k when that's literally a L6 salary and it's not even close to top of the chain. There are thousand of L6 in google alone and every faang companies have comparable tiers with just as many engineers being paid this well. Just senior engineering role that may supervise a very small team. Do you have any idea what a principle engineer makes at google?\n\nYou're not in this field, you don't know shit stop pretending you do cause its getting embarrassing.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "That is just not true at all - I work in tech, but at not a \"cool tech company\". FAANG only makes up a handful of engineering positions, and while they do go after the best of the best, there are way more great engineers than there are positions at those of FAANG.", "score": 2, "replies": []}]}, {"body": "Good job on considering opposite. But your tech related to bear case seems weak. More so they are too generic that they apply for their competitors too. \nThere's Jarvis too. \nTheir security is top notch and that renders them well for use in iot and embedded systems. \nYes, ivy takes an year for fruition but deal is signed and aws is usually very aggressive with their projects. \n\nIt will definitely take couple of quarters to start turning around but stock at this point is undervalued given the potential", "score": 7, "replies": []}, {"body": "Yh I got in at 13 avg, not the worst but fuck me it just keeps dropping lol\n\n\nIm in long but I never like seeing red obviously\n\n\nI think its going to be a hard 2021 for BB, you'll need other winners to balance out your portfolio most likely", "score": 6, "replies": [{"body": "Same here dude. $13.50 average and it stings. I have a small portfolio so im debating selling and putting my money elsewhere, or I may just go long. Not sure yet", "score": 4, "replies": [{"body": "I advice long tbh im not selling ive read more on BB again and I just dont care, all I care is how many shares I got and when im selling, which is in 1-3 years time.\n\nI dont care about current prices anymore, it sucks but it is what it is.", "score": 2, "replies": []}]}]}, {"body": "Holding long positions=won’t sell at a loss.", "score": 8, "replies": []}, {"body": "Great DD. I completely agree that this will be a good long term hold. While I’m still a little salty about the fiasco with Robinhood, this will be a great opportunity for BB to really bring some value to the table.", "score": 6, "replies": []}, {"body": "TBH what we all need here is a tweet from Elon \"BB\" and that will do it.  \n\n\nSorry totally irrelevant hehe. one could only wish right", "score": 9, "replies": []}, {"body": "Holding a lot of BB shares. Not happy reading this. Thank you for showing this", "score": 4, "replies": []}, {"body": "Great DD! Always good to hear the other side. I’m in on BB regardless of meme, if it’s not a good call then so be it, I’ve made plenty losses in my time, I don’t believe this one would be significant", "score": 3, "replies": []}, {"body": "Thank you for posting this. All I was seeing is how great BB is and/or going to be, your post provides a different perspective especially on risks.", "score": 3, "replies": []}, {"body": "I really like this kind of DD. It's too easy just to say: buy X because reasons. Negative DD gives you a much better perspective of your potential investments.", "score": 3, "replies": []}, {"body": "Fair points. I think BB will need something more special to come out of the news to turn it around. Potentially doing something big with Amazon would work but I’m not expecting much from their seminar end of the month. It’s had a good run and may return to glory but guess we’ll see.", "score": 3, "replies": []}, {"body": "I went in for BlackBerry at $18, amidst the GME and AMC hype. While I made on both of them, I unfortunately didn’t think $24 was the peak and ended up bagholding BB.\n\nI decided to take the hit and offload my BB shares when they were at $14 for a loss (note - it was a small position). Mostly as, while I see the bull case, I have to agree with the bear points here on likely timescales. I also think it’s likely to continue downwards before trading sideways, until an eventual rise. I fully intend to get back in either down the line, or if it dips back under $9.\n\nIt was also a good lesson in FOMO investing for me. If I’d have gone in when I’d initially considered it ($7, and again at $9), I’d have walked away with a profit even offloading when I did.", "score": 3, "replies": []}, {"body": "Hm", "score": 2, "replies": []}, {"body": "So what's your realistic price target this year?", "score": 2, "replies": []}, {"body": "Also add the 90 patents sold to Huawei but can anyone find how much they were worth\n\nDeep IP with 38,000 patents\nhttps://www.techradar.com/news/blackberry-sells-smartphone-patents-to-huawei\n\nWould this count as intangible assets?", "score": 2, "replies": []}, {"body": "150 shares 2 $15 Calls Sept 17 2021. Not much but I'm long on BB", "score": 2, "replies": []}, {"body": "OP - if you have sources for any of the claims, can you edit them in?", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I think this is the worst post I’ve seen to get 1k+ upvotes. This is all literally just ‘maybes’. And see above - OP just lifted it from the risk section of their own disclosures. Low effort.", "score": 2, "replies": []}]}, {"body": "Sure no problem, will add later on today. To be honest, most are out of BBs financials statements, the risk section.", "score": 1, "replies": []}]}, {"body": "So if anything this is just short term bearish long term bullish", "score": 2, "replies": [{"body": "You sir/ma’am are smart. Agree", "score": 1, "replies": []}]}, {"body": "I think people know there is a lot of potential in BB but the market does not want to pay for that potential yet. A lot of businesses get really sexy forward multiples, but not BB. They are going to have to work very hard to show that their new business is sustainable, scalable and profitable. Once they get that demonstrated, and I think they can, they will soar. Now, if they hit a few roadblocks, lose ground, or have some bad news, then the market will punish them disproportionately.   \n\n\nIn other words the short term is this is a high risk-high reward trade with a lot of volatility. You must have a long term play of at least 12 months.   \n\n\n12 months + this might turn into a different company insofar as the market perception is and at that point the risk may be diminished and the upside improved.", "score": 2, "replies": [{"body": "Agree. \n\nInstitutional ownership has gone up from 45% to 65% if I remember correctly", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "I'm not so sure the software being built on 3rd party infrastructure is detrimental. Linux has proven, over time, to be the best foundation on which to build software. Apple operating systems is the only thing that can compete, but everyone hates using them because they're so locked down. Android is the only comparable, and we all know how janky it can be. \n\nOn the bull side: they're building partnerships that are likely earnings neutral in the near-term. BB software has to prove itself all over again and thus likely gets in at cost and can build margin over time. Opportunities will be plentiful after proving the quality of its software during the SolarWinds breach. \n\nOn the bear side: if BB gets held on the sidelines in the US for being foreign it will be difficult to make gains anywhere other than emerging markets. Basically, if they can't get stronger, deeper, US relationships fast they'll be stuck. \n\n5 6/21 10c (originally 10, but took profits during the surge)", "score": 2, "replies": []}, {"body": "Interesting article", "score": 2, "replies": []}, {"body": "[http://www.blackberry.com/patents.html](http://www.blackberry.com/patents.html)", "score": 2, "replies": []}, {"body": "This is good DD that does show the risk, involved. That being said I see it having huge upside if it accomplishes its goals. I don't expect a return for 2-3 years. I put in 629 @ $13.75.", "score": 3, "replies": []}, {"body": "I'm going to be honest...thank you for your thread and post...I didn't even read it basically the company's earnings and salsa don't support anywhere near this price. If you want to pay a premium for years down the road be my guest but thats not how I trade. \n\nI do like the company and I was like until about 6-7....then Amazon news...then the parabolic wsb infused rally. Anyone that believes bb did that on its fundamental needs to see the doctor asap...im sorry\n\nI like the company but not at these nose bleed levels the numbers do not support it here...maybe 8, maybe\n\nI have 0 position now, and would buy on a serious pullback \n\nGood luck 👍", "score": 3, "replies": [{"body": "Agree", "score": 1, "replies": []}, {"body": "I am in agreement with you - was a hype and that’s what created this short bubble - I sold half my positions  lose to the top 23$ and the rest at 18$ - not sure I’m ready to jump back into this one when there are so many others that might skyrocket soon in this volatile melt up market -\nI guess it’s opportunity costs for the people that are still holding shares :(", "score": 1, "replies": [{"body": "If it comes to 7-8 I'll trade it again... if not I'm sorry Bb, I'm even typing this on my BlackBerry key2 backup phone...but there are other fishes in the sea", "score": 1, "replies": []}]}]}, {"body": "I think like many of you BB is a long term but not for few years... \n\nSo glad i sold many shares and diverted to ARK etfs before it hit below $13", "score": 2, "replies": []}, {"body": "Thank you for posting this.  Everyone has a reason to make puts or calls now lol.", "score": 1, "replies": []}, {"body": "Look, Blackberry is loosing money consistently. I do not invest in losers. Sorry", "score": 1, "replies": []}, {"body": "Great write-up! Bought some leaps on BB because it may still tank for the next couple of months, until people stop associating BB with meme stocks..", "score": 0, "replies": []}, {"body": "I read that they gonna release new phones also.", "score": 0, "replies": []}, {"body": "The whole bb frenzy began when news came out that they sold more patents to Huawei. Dont know how this is a plus for the stock (maybe revenue for the quarter) but imo just shows their inability to generate a consistent revenue stream. QNX is not used by all automakers, security in the supply chain has been around for a while and there are many other players/manufacturers doing this. Their big switch to software seems related to their acquisition of cylance (spark/upm). I wouldn’t buy into this as its just new marketing of existing products. Also cylance is in a highly competitive market esp. vs crowdstrike which has gobbled up tons more share of the market than cylance. If anything the prev. stock price reflected their value until this whole 🚀🌕 saga based on zero fundamentals", "score": 0, "replies": []}, {"body": "Though I'm long on BB, it was a good case to read, and constructive arguments are needed to snap us out of biases. Well written.", "score": 0, "replies": []}, {"body": "Interesting to see the full scope.\n\nI would now like to see (if I can't do it myself), the impact this has vs the positives in future prices.\n\nObviously, there is a lot of risk in being wrong with such an analysis, but it would be interesting to see.\n\nGood investors know that future contracts are not the same as money now (what destroyed Enron), but I'm wondering if QNX will be impacted by any of these.\n\nTo note, low volume of car purchases would strongly affect their QNX model. Not only would they not make as much because of lost sales, but car companies might not be as willing to partner with an autonomy oriented software company, while focusing instead on making companies more lean, reducing spending on R&D effectively.\n\nIs it fair to say that it all depends greatly on the trends of the regular market? If so, how much cash does BB have on hand? This is vital for an R&D company during a recession. Their overall standing matters as well - retaining employees who like to work there, as well as how willing a bank is to loan them money are incredibly important from my viewpoint as a potential investor. \n\nIf a recession puts QNX back 5 years, will they be impacted by their competition? Looking at Tesla, they have a cash balance to stride through a recession with ease. Banks are salivating to give them a loan and individual investors are lining up to throw money at them.\n\nIt's one of the reasons I believe Southwest will do well. They've proven they have a strong foothold in a market time where cash reserves are important.\n\nNote: cash reserves by themselves are meaningless if it's not attached to meaningful progress. Having QNX as intellectual property becomes a liability unless spending their cash reserves don't automatically bankrupt them, and they have to offload this software to another company.", "score": 0, "replies": [{"body": "Traditional OEMs are def focused on short term profitability while balancing long term investments in reinventing themselves as EV companies. \n\nQNX and Ivy can potentially allow traditional OEMS with short term profitability by allowing them to transition into being more “Connected Cars” and monetize data while they transition into EVs. This can be done with low investment compared to redesigning an ICE car to an EV car.\n\nTraditional OEMs reducing their R&D (I believe most are increasing) would help QNX. \n\nI think traditional OEMs are late to the party, Telsa is 5 years ahead of them. They don’t got time to develop their own OSs, they will have to choose what they do in-house, I doubt it will be developing an alternate to QNX and IVY (AWS)", "score": 0, "replies": [{"body": "Interesting viewpoint. So you have to balance how much R&D their partners are doing with how quickly they want to remain competitive. Add to the balance the cost effectiveness of QNX's platform, and you get a good idea of how much OEMs would need to spend on their own OS before they would jump ship.\n\nIt seems to me like they have been able to dig their own niche market, which banks would not shy away from loaning money.\n\nI'd invest in a long bid, but I have to decide whether my Palantir investment is a loss before putting money into it.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Who hurt you? Don't have be such an elitist about it. It was an interesting bearish perspective when all I've seen are either bulls, or sourpusses like yourself.\n\nTesla is far behind QNX. QNX has been approved for safe use, while Tesla's Linux based autonomy OS hasn't.\n\nEvery company which you hinted at is molding their autonomy around the QNX OS.\n\nAnd yes that is my point, the cost of development is certainly going to be measured against the cost of implementing QNX. How is that so hard to understand? Whichever is cheaper long term will be used.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "While I'd love to see more Tesla's out there, they are a fraction of the entire market, so maybe there's is better connectivity, but it's a moot point until they have a monopoly.\n\nElitist is not confused with informed. You're just confusing the smell of your own ass with the smell of roses, man.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I think it would be smart of you not to talk about proprietary company products if you are in the field.\n\nExposing such secrets on the internet to win a fake internet pissing contest is not only elitist, it's potentially illegal.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Absolute shit lord. Your name checks out though, you're a hyena, and you think yourself brilliant.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "When the auto assigned name even realizes it...", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Thanks for the opposing viewpoint. Are you interested in a bear case post for Palantir? I'm bout as bullish as you can be however I don't think I've ever read a single serious bear case post. Any I have come across have been wrong in thier understanding of what Palantir is and what it offers.", "score": 0, "replies": [{"body": "I’m currently not invested in palantir. I’ve been focusing on the EV, Climate change space", "score": 0, "replies": []}]}, {"body": "New here, what is Bullish and Bear suppose to mean?", "score": -1, "replies": [{"body": "Bull = confident on growth, bear = think price will go down.  Learn how to google shit like this in the future though", "score": 3, "replies": []}]}, {"body": "Some good wisdom here. I think BB is overpriced at 11 and am waiting for it to drop ~30% before I buy in for the long term bull. I think retail exuberance and meme stocks created an artificial floor at 12 (just like how GME is still at 50$ despite being no where near worth that by fundamentals).\n\nWhile I agree with the bull case that BB could be worth a ton more in 5 or 10 years, I still think BB @ $11 is the result of retail mania and it will drop back down to a level more supported by the fundamentals.\n\nOr maybe you crazy traders will keep your floor at ~10 and I'll never buy in 😩", "score": -1, "replies": []}, {"body": "Yea, I know alot of people will downvote this and call me out.  Let me make something clear. I owned BB and I sold it as fast as I could.  My fault for not researching this throughly but I see a BB post DAILY that is absolute garbage. \nThere is a huge difference between actual market news vs announcing any vaguely positive news.   I would almost understand this more if this is a mooning stock but it has quickly lowered to it's pre-meme price.  \n\n1. EVERYONE KNOWS ITS NOT A PHONE STOCK AS NOBODY HAS OWNED ONE SINCE 2011 (sarcasm but you get my point). There is no reason that other investors don't get this point and if you believe that, then you are saying you are smarter then lead analysts. \n\n2. This is a stock with a ton of bagholders from over 10 years ago when they owned the space.  The anatomy of a pump and dump, with a community of bagholders desperate to get their losses back.\n\n3.  If you look at their 2008 numbers their shares were well in the triple digits.  Notice the plummet?  Exactly with the explosion of IPhone and Galaxy.  I know your saying \"It's not a phone company anymore\".  Exactly the problem.  They had since 2011 to adjust and they didn't.  They last released a phone in 2017 which they quickly discontinued.  They had plenty of time and still not a leading player in software even with name appeal.\n\n4. With every post screaming about the deals and moves they make, I see no movement outside the wsb fueled short squeeze.  If you wanna argue I'm wrong so me a correlation of a positive news story that wasn't wsb based.\n\nSo why am I so annoyed at BB posts other then frequency?  I feel it's misleading and preys on new investors which alot are frequenting this site.  A big part of me feel that this is intentional and lead from 2008 bagholders.", "score": -4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm just saying BB is one of the worst when it comes to pump posts.  What I'm writing is to attack those who keep saying \"it's not a phone stock\". Cause everyone knows.", "score": -1, "replies": [{"body": "Okay but all your points still refer to it as if it is a phone stock", "score": 0, "replies": [{"body": "Ok, your reading this the way you want to.  Everyone can interpret anything the way that fits their narrative.  Later.", "score": 0, "replies": []}]}]}]}]}, {"body": "Nice to get both sides thanks.", "score": 1, "replies": []}, {"body": "https://www.reddit.com/r/BlackberryYOLO/comments/lhdf3t/bear_vs_bull_analysis_partnerships_it_security/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nBear Vs Bull analysis.", "score": 1, "replies": []}, {"body": "Thank you! It’s rare to see anyone these days arguing against themselves in order to strengthen their point. I very much appreciate this diligence.", "score": 1, "replies": []}, {"body": "This is something I’ve been thinking about for a while. I feel like NOK is a bear case too", "score": 1, "replies": []}, {"body": "Yes, BB has an edge in security certification. However, how difficult would it be for a much bigger software player or a heavily capitalized automaker to decide they don’t wanna pay licensing on software forever to a third party and decides to insource it instead?\n\nAlso, BB doesn’t have the kind of market share monopoly on auto apps like apple does on iOS devices, or google on android development. Those two companies own a platform and the ecosystem, making it nigh impossible to switch. BB does not have this impenetrable ecosystem, they’re trying to start creating one and they don’t have that much of a lead on the others. If apple is truly trying to launch an apple car, with their strong vertical integration strategy on everything, and their massive app ecosystem and developer base, and their experience in software and marketing and OS management, and reputation...how would an Apple auto Os not blow Bb out of the water?", "score": 1, "replies": []}, {"body": "These are all fair points for a bear case. \n\nThe reason I like Blackberry is that I believe that there is a potential for a great long term upside. At the same time Blackberry sits on some relatively lucrative patents that should protect an Investor, as there is some underlying value in the company, even if their new ventures lose out to competition.", "score": 1, "replies": []}, {"body": ">Appel\n\nSpelling mistake. I'm going to ignore your whole DD.\n\nPosition: 77 BB", "score": 1, "replies": []}, {"body": "HE DONE F*ING SAID IT\n\nThank you for your service sir, didnt change my mind.", "score": 1, "replies": []}, {"body": "We cannot win the war if we do not sit down and have a honest assessment of the battlefield.", "score": 1, "replies": []}, {"body": "Thanks for the DD. I’m in with BB before the WSB hype and believe it to be a long term investment as well. Originally bought in at 10 then add more at 13~18. I would also evaluate the penetration rate over the electric car manufacturers and its development progress. But overall I’d definitely consider putting more portion into it.", "score": 1, "replies": []}, {"body": "Short / put screenshots pls", "score": 1, "replies": []}, {"body": "As a dude hopping gain trains... sure.", "score": 1, "replies": []}, {"body": "This isn’t a serious bear case. It’s a bull case by omission.", "score": 1, "replies": []}, {"body": "So, we hold. Got it 👍", "score": 1, "replies": []}, {"body": "You deserve a boiling lemon juice enema for your troubles. \n\nThank you.", "score": 1, "replies": []}, {"body": "Will load up when it gets back to 6", "score": 1, "replies": []}, {"body": "Another bear scenario - they burn too much cash before they make a profit front that IVY project and they can’t get new loans from banks", "score": 1, "replies": []}, {"body": "I’m tired of hearing talk of $BB mooning. That happened on 27th January. Now it’s a long term investment.", "score": 1, "replies": []}, {"body": "Below $11 in PM. Maybe this will bounce back one day but in the meantime there are better stocks to meme over.", "score": 1, "replies": []}, {"body": "I love this! Wish more people provided bear cases alongside their bullish stocks. More perspective never hurt.", "score": 1, "replies": []}, {"body": "My $24.50 shares are crying.", "score": 1, "replies": []}, {"body": "Thanks for this bear case. We should always consider the antithesis to our position/thinking to reduce as much bias as possible and possess an informed view.", "score": 1, "replies": []}, {"body": "I trimmed some holdings yesterday because it was too much risk for my blood but I’m still in. With that said if it does get back down to the $8 rang or finally settles I’ll hop back in because I like where they could go.", "score": 1, "replies": []}, {"body": "I thought it was proud to be a SOC so then the software issues would actually be the OS, correct?", "score": 1, "replies": []}, {"body": "Agreed. I'm going long and buying these dips every time I get a significantly cheaper buy in point. Luckily I didn't go all in on first buy but I agree. The timeline may be longer than we think but cyber security is only going to get bigger as times goes on and breaches continue.", "score": 1, "replies": []}, {"body": "i lost too much with gme so ima just hold this one till the grave. Been wanting to invest in bb ever since i got my first bb curve in grade 7 so i really do believe in them.", "score": 1, "replies": []}, {"body": "I am long on $BB. It's cheap and a lot of upside. Not to re-has your semi DD, but I am holding long. I am only a few hundred $$ deep, but I am holding.", "score": 1, "replies": []}, {"body": "I'm out.\nDunzo.\n\"Do more of that which is working, And less of that which is not.\" -Dennis Gartman", "score": 1, "replies": []}]}
{"title": "Is there any point in holding stocks/ETFs?", "selftext": "Im a 19 year old kid, who made a very large amount of money from GME. I bought some calls back in august which I kept rolling to higher and higher strikes and made more than 1000x on my very small investment. I am at 800k now. I think its easy to see why I am hesitant to dump this much money into the stock market after we have had such a huge rally.\n\nI have been thinking about it and have come to the conclusion that its better to simply sell extremely OTM puts rather than actually buying the stocks and being exposed to the risk of a crash. You can easily make 20-30% selling these options, and if there is a crash you can simply just take assignment, and be better off that if you had bought shares. Or you can keep rolling them for a credit until the recession is eventually over. \n\n\nWhats the downside?", "id": "lmfp4v", "created_utc": 1613629241.0, "score": 29, "upvote_ratio": 0.7, "num_comments": 121, "comments": [{"body": "Look, gonna be real with you here. If you are 19 and made 800k on dumb luck then your **absolute best** option is to cash out 790k and save it to start a beautiful life. You could decide to keep 10k as playing money, just because, but for the love of God cash out like 90% of your winnings and set them aside.", "score": 151, "replies": [{"body": "I have to pay almost 400k in taxes cuz of where I live, so its not quite enough to be set for life. But If I grow it to a million over the next 5 or so years then that would definitely be enough.", "score": 29, "replies": [{"body": "Risking 800k to grow it to a million means you are willing to end up with nothing for a measly 100k increase from 400k to 500k, fren. I'm not telling you what to do, but consider the risk you are taking.\n\nYou can find alternative ways to stash your money. Maybe just put it in ETFs and only take out what you need when you need it. There are various ways you can get away with less taxation.", "score": 48, "replies": [{"body": "Some places you have to pay taxes on unrealised gains on ETF’s once a year", "score": 2, "replies": []}, {"body": "Yea but selling puts on say SPY is actually a safer strategy than just straight up buying SPY. Its exactly the same as buying SPY then selling ITM CCs on it. At worst you are assigned but you get a lower cost basis than if you had just bought shares, best case is you are not assigned and keep the premium for free.", "score": 5, "replies": [{"body": "How do you know this shit. I wanna make money too", "score": 17, "replies": [{"body": "This is an option strategy called a cash secured put if you are interested. Even better is selling cash covered puts until you get assigned, then selling covered calls on those shares. A strategy called \"the wheel\"  Not sure what this subs opinion of r/thetagang is, but they have a lot of interesting strategies that they claim can match or beat holding etfs for relatively low risk (compared to most stock options)", "score": 4, "replies": []}, {"body": "I'm new myself, but before you get seduced, make sure you read a couple of pages like this, too [https://optiongenius.com/blog/weekly-options-credit-spread-horror-story/](https://optiongenius.com/blog/weekly-options-credit-spread-horror-story/) or most especially this [https://www.marketwatch.com/story/trader-says-he-has-no-money-at-risk-then-promptly-loses-almost-2000-2019-01-22](https://www.marketwatch.com/story/trader-says-he-has-no-money-at-risk-then-promptly-loses-almost-2000-2019-01-22) . \n\nOptions are high risk/high reward. I have not yet myself found an option trade where your overall risk is actually less than buying a stock... just ones where risk gets concentrated in certain smaller price ranges, so it's easier to win, but if you do still lose, you lose MUCH BIGGER.", "score": 1, "replies": []}]}, {"body": "Sounds like you already know the way.  .wish I had hopped on that gravy train too", "score": 1, "replies": []}]}]}, {"body": "Dude park that money in value investments like dividend paying stocks. Reinvest your dividends and enjoy being a multimillionaire in a few years. What you did was gamble which is far from investing. If you want to invest then do it safely based on value, not speculation", "score": 5, "replies": []}, {"body": "What country are you in? You're obviously not in the US", "score": -11, "replies": [{"body": "California", "score": 15, "replies": []}, {"body": "This could very easily be California.....", "score": 13, "replies": []}]}, {"body": "Cash out!! Pay the taxes. Use 10k to re invest.", "score": 1, "replies": []}]}, {"body": "No, keep it invested. Don't listen to this person.", "score": 2, "replies": []}]}, {"body": "if I came in to that amount I'd put 60% in dividend stocks and collect the passive income... I don't know shit but that seems like an ideal situation for what I'm trying to do.", "score": 37, "replies": []}, {"body": "Fuck you. That’s crazy awesome", "score": 25, "replies": [{"body": "thanks, I got unbelievably lucky", "score": 20, "replies": [{"body": "You mean you did not hold the line ? 🚀", "score": 3, "replies": [{"body": "Lol feel bad for the new trader who bought in really high. We could have gone much higher but looks like DTC shut it down to protect themselves. I sold when it first hit 150. If I had held to 500 I would have made 20x more. I was out before ape gang even joined", "score": 11, "replies": [{"body": "Congrats :) I was not in GME. I made 2x with AMC. and holding NOK... I bought it at the absolute max lol", "score": 2, "replies": []}]}]}]}]}, {"body": "With 400k, while obviously you're not 'set for life' but you can easily buy a house outright(or when you move out). Which would save you a LOT of money in rent each month, and can expand your work prospects as can probably just work part time the rest of your life, or until you hit it big again.\n\nSo for a young investor, it seems like those kinds of savings over your lifetime can likely outperform most investments you'd make today. \n\nI'd def cash out. You're trying to go for a carefree life from an easy life. But could end up with just a regular one again.", "score": 14, "replies": [{"body": "Could easily buy a duplex, live in one half, and collect rent from the other. Live rent free and eventually the house pays for itself", "score": 2, "replies": []}, {"body": "400k is rent in California", "score": 2, "replies": []}]}, {"body": "Here’s what i would do. Take 400k  in cash and pocket that shit. I would spread that money into dividend paying tech companies. Take 30 companies and (minimizing risk) spread the money evenly. When dividends payout. You can use that to buy more options and play around the option world. \n\nRemember you have to pay taxes on those gains next year so don’t get too excited with this money yet.", "score": 11, "replies": [{"body": "Yea because of where I live my taxes are going to be about 400k", "score": 5, "replies": [{"body": "Then move", "score": 3, "replies": []}, {"body": "Well I'd say you have the cash to move and buy a house elsewhere. Cali will only get worse from here.", "score": 4, "replies": []}]}]}, {"body": "If you're telling the truth thats kinda incredible, congrats. I echo what most people here have said: cash out at least half. Don't worry about taxes, they are unavoidable. By all means keep some play money in the market, hell you might make another 800k, but be sure that you have the majority of what you earned somewhere safe. If you manage it well you may have just funded your retirement at 19...", "score": 9, "replies": []}, {"body": "Invest it into safe ETFs like VOO QQQ ICLN etc", "score": 13, "replies": [{"body": "Yea but I can see even the sp500 crashing more than 50% over a multiyear recession. If I go with my plan of selling puts, I can definitely beat the market and keep generating cashflow even as the market trends lower.", "score": -18, "replies": [{"body": "Then go beat the market.", "score": 32, "replies": []}, {"body": "Respectfully, if you foresee the S&P500 falling more than 50% over an extended period of time, then I have a hard time believing you can consistently beat the market.\n\nNo taking away from your accomplishment, it’s incredible what you’ve done. But don’t expect it to last.", "score": 7, "replies": [{"body": "Said it could happen not that it would. people are very high off of this 11 year bull run and forgot what actual downturns look like.", "score": 3, "replies": [{"body": "Lol @ this coming from someone who’s first foray was ten GME pump", "score": 8, "replies": [{"body": "I bought gme calls when it was 5 dollars because it was extremely undervalued, not cuz of the short squeeze. I've been trading on and off for 4 years now, so even though Im not an expert Im still moderately knowledgeable. Just look at the 2008 crash, sp500 dropped 50%. Anyone who thinks something like that couldnt happen again hasnt looked at history.", "score": 1, "replies": [{"body": "Plenty of people are aware of this, as we actually lived through and navigated it while your biggest worry was avoiding nap time.", "score": 2, "replies": [{"body": "You lived through a 50% crash and dont think it can happen again?", "score": 3, "replies": [{"body": "Where are you getting that I said it can’t happen again? I never stated that.", "score": 1, "replies": [{"body": "Whats your thoughts on the market right now? I think with a average pe of about 40 its extremely overpriced. Only time we have gone higher was the dotcom bubble and 2008 after the recession started and earnings tanked which shot up pe.", "score": 2, "replies": [{"body": "Should be looking at P/S vs P/E, P/S we’re pretty much underlevered across industries compared to the dot com bubble, the 08 crisis isn’t comparable as it was triggered by a different mechanism and set of circumstances. We also have the fed who has adopted MMT and QE to prop the markets - these low interest rates give people no alternative. Will there be a pullback, of course, the market is cyclical, do I expect as deep or as long a crash as 01 or 08, no.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "And I ‘could’ marry Sofia Vergara, but it ain’t happening.\n\nWe’re certainly due for a correction but a 50% decline over an extended period of time? Balderdash.", "score": 3, "replies": [{"body": "We have had many 50% crashes before, no reason to think it wont happen in the future.", "score": -2, "replies": []}]}]}]}, {"body": "What if rates stay low, and the market keeps going up?", "score": 5, "replies": [{"body": "Ill still beat the market if it keeps going up. Unless its gaining like 20%+ for consecutive years. Then I would perform worse because of the short term capital gains taxes which hamper my strategy", "score": -12, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "What? I was asking for a downside to my strategy. The arguments people are making arent that good so Im defending my strat. Although I conceded in the above comment that I would underperform if the market kept going up 20% or more every year.", "score": 2, "replies": []}]}]}]}, {"body": "Real estate is a great tool for cash flow and generating wealth.", "score": 3, "replies": []}, {"body": "Have you checked out the prices for puts? I don’t know which options you were planning on selling, but here is an example: \n\nA SPY put with a strike price of 300 and expiration on June 18th will sell for about 360 dollars per contract. It requires you to have 30k ready to buy the shares if it drops that much. A 360 dollar profit on 30k is a profit of about 1.2%. Not 20-30% as you said. \n\nThat was just an example, and you can play around with different strike prices and expiration dates, but it will be hard to find anything that will get you 20-30%.", "score": 1, "replies": [{"body": "300 is extremely otm. For SPY I would sell much closer to the money since I dont mind being assigned it. I would use 75% of my money selling puts on indices and 25% for high IV stocks I wouldnt mind holding.", "score": 1, "replies": [{"body": ">300 is extremely otm\n\nYeah, I gave that as an example because in your post you said you intended to sell extremely otm puts. \n\nEven if you sell an at the money put for that date, you’d make about 4.7% from the premium, not 20-30%.", "score": 3, "replies": [{"body": "For SPY I would sell 365 and make like .8% a month. When I said really OTM I mean on the high IV stocks. For example I actually think GME will be a good business in the future and wouldnt mind owning it at $25, so I sold  a ton of GME puts at that price 3 weeks ago and got paid 20%.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Look into ARK ETFs, set and forget, enjoy being a millionaire in about five years.\n\n(I’m not giving you financial advice, make your own decision.)", "score": 6, "replies": []}, {"body": "you turned 8k to 800k???", "score": 6, "replies": [{"body": "750 > 762k, the rest was in other stocks", "score": 13, "replies": []}]}, {"body": "I would go with real estate. At such a young age you could buy a house/houses and keep borrowing off of the equity in your houses to buy more. Rent them out and have others pay your mortgage. It depends on the housing market you are in, but if you could buy 2 houses, you could leverage that to get multiple houses. Live in one, rent one out. Borrow off of the equity in your house/houses to put down payments on another 1-2 houses. Take out 15 yr mortgages on those and have renters pay them. You could potentially be living in a home and owning 3 other houses that you can rent out for life at the age of 34. You can continuously repeat this process to keep multiplying your houses. Just something to consider even though this will likely be less popular in this sub.", "score": 4, "replies": [{"body": "Yup thats what I want to do, but buying a decent house where I live will set you back 1-2 million", "score": 3, "replies": [{"body": "Ah. The housing market in Cali is pretty expensive. You could put a down payment on a house, but that’s not really going to grow your money in the same way that having renters would. Unless you plan on staying with your parents, putting a down payment, taking out a mortgage and having renters in that house. That could work, but would rely on your parents’ willingness to house you. You can borrow off the 400k equity in that home and buy another using the same process if you feel comfortable. The mortgage rates are rock bottom now, so it’s a pretty good time to do something like this.", "score": 1, "replies": [{"body": "I dont have a job so I cant pay a mortgage. I just enrolled in college last September", "score": 2, "replies": [{"body": "Renters pay the mortgage if you aren’t living in it. Once they pay it off, you can move in and borrow off the equity to buy another house which your new renters also pay for. Basically someone else buys you houses.", "score": 1, "replies": []}]}]}]}, {"body": "50% taxes sounds like Europe to me. It's similar in Germany. You have to pay 30% taxes on earing if you sell the stock before 1 year is over. Everyone tells him \"buy a house\", but reality might be he can't. An average house in Germany costs between 400K€ ($460K)  and 800K€ ($960K)  depending on region. Plus 12% taxes, notary etc. He won't get a credit to buy that house even with 400K downpayment, simply because he has no stable job. Rules to get credits have become pretty strict following 2008. \n\nTo live off mortgages and rent in Germany, he would at least need a few millions to get started. Also he will need an attorney, since renters rights are quite a thing. He can't even freely determine the height of the rent, since it's bound to an regional average. It's a bureaucratic nightmare to rent out property in Germany. \n\nWouldn't recommend it to a 19 year old.", "score": 1, "replies": []}]}, {"body": "To be blunt the broadmarket ETFs are far safer. You're taking risks you don't realize yet.\n\nKeep in mind if you're investing in a broad market ETF and it crashes, it will recover, it might take a few years in the worst of times. What is important is not to get solely stuck with the hot-potato companies that go out of business. When you build a full portfolio you leave money you need for the coming 6 months, 12 months, 24 months in much more conservative investments (savings accounts, Bonds, low volatility dividend stocks). Then you put higher amounts, things that it is alright if they crash for a couple years, in riskier broad market ETFs or broadmarket growth ETFs. That minimizes risk.\n\nIf you do that, you've made it. You can have a full retirement fund within 10-15 years with limited risks.\n\nGood investing is a long-term strategy. To do what you did takes great risks with the money you started with. Basically every dollar you just made, someone else had lost playing in the GME craziness trying to do similar things. GME wasn't structurally doing better as a company to increase it's value. That was a rare occurrence.\n\nIf you try to recreate this success, you could lose much of what you made.\n\nAt a minimum, take a large chunk of the money you made and make a good safe portfolio that is safer and likely to make life easier for you later in life.\n\n Then choose a small portion to be your riskier, let's do this again.... If that works, then keep working riskier stuff with just that portion. If you lose that portion, don't take anymore. If you gain alot, keep using that money. You can always have a good amount stashed away in your broadmarket ETFs, whether you do good or bad in that situation.", "score": 3, "replies": []}, {"body": "Provide screenshots of your 800k or it didn't happen", "score": 4, "replies": []}, {"body": ">You can easily make 20-30% selling these options\n\nIf that was reliable then everyone would do it.", "score": 3, "replies": [{"body": "Hedge funds who manage billions of dollars cant do this. The retail traders seem to hate selling options too.", "score": 2, "replies": []}]}, {"body": "Check out r/thetagang and r/options, selling puts can be very good and have much less risk when done right", "score": 3, "replies": [{"body": "Yea I have been doing theta gang strategies for almost a year now. Learned a lot from Tastytrade", "score": 1, "replies": [{"body": "Hell yea, I'm a big fan of those strategies", "score": 1, "replies": []}]}]}, {"body": "Dude, if you made 800k at 19 years old…. I now work for you. Let me know what your need boss. \n\n&#x200B;\n\nAnd P.S.\n\nI’m all for taking advise, but following your gut has damn near made you a millionaire, so just follow your gut….. \n\nSorry if i spoke out of line Boss.", "score": 10, "replies": []}, {"body": "Stop trying to time the market. If it crashes, it crashes - hold until it rebounds. \n\nJust invest in blue chip stocks that you like. You have the opportunity to hit a mil before graduating college, don’t blow it.", "score": 2, "replies": [{"body": "I treat the market as a business. Would I invest in a business that will take 40 yrs to give me a ROI? No.", "score": -1, "replies": [{"body": "Not going to take you 40 years to have a good ROI from blue chips lol", "score": 3, "replies": [{"body": "sp500 has a pe ratio of 40, so technically it would take 40 yrs. Obviously the PE will come back down in the future but thats uncertain.", "score": -1, "replies": [{"body": "You’re thinking too technically. We are in a growth / future orientated market, P/E ratio really doesn’t matter until valuations come down. By picking blue chips I meant selecting big companies that you like and holding their individual shares not holding an index. \n\nJust invest in companies that you like man there isn’t really much more too it in this type of market. Use some advanced strategies if you want to try and automate your gains but you really can’t go wrong investing in good companies in this market.", "score": 3, "replies": []}]}]}]}]}, {"body": "I would very much consider not reinvesting it unless you have professional guidance. I also made money on GME (not as much a you) and I consider it a fluke. It took no technical or practical knowledge of the stock market to make those gains. You, like me, have no actual ability to read the market. Don't let that big win make you confused into thinking you're ready for this stuff.\n\nEven though I came out at 400% profit, I still think gamestop was one of my dumbest decisions. I have to remember not to expect money to be easy like that ever again. And winning big like that doesn't give me an honest reflection of my own investing abilities.", "score": 2, "replies": [{"body": "I have been selling options for several months with most of my portfolio. So this isnt just based of GME. I considered this a better strategy then buy and holding before too.", "score": 2, "replies": []}]}, {"body": "You got lucky. Your main concern are your relatives and gambling. Do your parents still have access to your accounts? If yes, make a new one before you cash out. And please go see an independent financial advisor in your country who helps you with investing and taxes.\n\nPersonally, I would cash out half, put 25% in various booring boomer ETFs and keep 25% as gambling/fun money. But that's just me. \n\nPlease don't gamble away 400K.", "score": 2, "replies": []}, {"body": "You are 19. Plot VOO, pick the fkcin highest point, assume that you get 2% of dividend, and imagine that you hold for 20 years. Now you cannot find singular point where you would lose money, plus the dividends. I know, it is BORING, so even if you just put 400K in it, you are set for life. I wont mentioned bonds and stuff :). Congrats btw. Put like 20K aside to gamble, or something like this. About selling OTM calls, you can definetly join r/thetagang, but I would never sell naked, you could end on the opposite side of GME. I dont want to disregard you success, but there is a chance you would never be this lucky again. It is up to you, do you want to be one of those guys that you read about how they gained half a mil then lost it all?", "score": 2, "replies": []}, {"body": "skirt thought screw far-flung hat shocking hunt spotted boast cows", "score": 2, "replies": []}, {"body": "If you have that much money, put it in a safe, market tracking ETF. You got lucky. Very lucky. With money like that (post taxes) you should have a million in less than fifteen, and much more following that.", "score": 2, "replies": []}, {"body": "Do you have any debt OP? I would pay that off first. Second, find some high dividend yielding stocks $T for example and put in there. 400k is a good chunk of money that takes many people DECADES to earn. It is life changing and nothing to play around with because just as easy as it is gained it can be lost. If you buy shares longterm value they should ALWAYS almost increase at SOME point. If an option goes to 0 sum gain then you just lose your money is something to consider.\n\nYou went with the crowd and it paid out big, and I would keep 15k as play around money. \n\nThinking of when I was that age a decade ago what I would NOT DO is:\n\n\\- Don't but a expensive car  \n\\- Don't tell your friends about it because they will expect YOU to pay for food, drinks, parties, etc.  \n\\- Don't necessarily leave outside your means and be careful with people asking for any loans or money outside direct family\n\n&#x200B;\n\nMaybe put a down payment on a house, apartment, or condo and rent it off as income? I wouldn't buy a house outright honestly imo but maybe 20 - 25% down. \n\n&#x200B;\n\nThe real thing is none of us will have the best advice. You are better talking with a tax professional and asking them on opinions but congratulations on your big win and hope they keep coming.", "score": 2, "replies": [{"body": "Thanks for the advice. I havent told anyone about the money and definitely wont change my lifestyle.\n\nRight now I think Ill put 33% of my money in good value stocks and the rest Ill use for theta farming strategies.\n\nI have like 10k in student loans but I took that out on purpose even though I didn't need it because theres no interest and theres a chance Biden will forgive 10k.", "score": 0, "replies": []}]}, {"body": "Buy an apartment where you A) Want to live B) Where it is easy to rent out. If 800 000 K does not equal a house where you live, an apartment will be fine. Get a large apartment with extra bedrooms, so that you can have a roomie you want to live with and who pays you rent.\n\nSafe investments (relatively), can give you income, and you will in time reap the  gain from increasing real estate prices. Most importantly though; it gives you something back that you will need; gotta live somewhere. \n\nAnother option would be to put it in a few broad ETF’s tracking global stock markets. If you can avoid taxes that way by not cashing out now, that strategy is tempting too. Keep some money «to play with» in the market. Just make sure you don’t touch your main ETF investments should you lose it on risky investments.", "score": 2, "replies": []}, {"body": "First of all, congrats!\n\nSecond of all, contact an accountant. You have a MASSIVE tax bill and there might be ways to get that down. Methods that you aren't going to learn from Reddit.\n\nThe hard truth is that you got extremely lucky and it's unlikely that it is going to happen again.  Psychologically, it's hard to stop when you're up so much, but consider the very real possibility  that you could lose all this money betting on options. Read some of the loss porn on Wall Street Bets, very sobering.\n\nA couple of your comments here say that you think you can beat the market if things go south. I wouldn't be so confident. People on Wall Street spend all day every day trying to beat the market and a lot of them STILL can't beat the S&P 500. What makes you think that you can? \n\nInvest in safe index funds and leave it there. You have a ticket to a very early retirement. Don't throw it away by spending it all or gambling on risky options.\n\nIf I were you, I would invest in broad ETFs. If you're worried about a downturn in the near future, consider a portfolio with more bond indexing and less stocks. You have so much money that you don't really have to take risks. This is for Canadians, but here's a good visual with the risk and reward you can expect with different ETF portfolios based on bond percentage: [https://cdn.canadiancouchpotato.com/wp-content/uploads/2021/02/CCP-Model-Portfolios-ETFs-iShares-Dec2020.pdf](https://cdn.canadiancouchpotato.com/wp-content/uploads/2021/02/CCP-Model-Portfolios-ETFs-iShares-Dec2020.pdf)\n\nAlso, read Millionaire Teacher by Andrew Hallam. It's an easy read you can get through in 1-2 days. A lot of it will be basic for you, but it outlines why you shouldn't try to beat the market and what an ETF portfolio can do for you. Also, some personal finance tips to make sure you don't blow all your gains.\n\nCongrats again and be careful out there!", "score": 2, "replies": [{"body": "This is great advice. 800k is going to cost you probably 240k in taxes. Take the rest and invest properly and let it grow. At a modest 5% a year you will be a millionaire by 30 and potentially retired at 40. The reason people invest long term is you don’t pay taxes on gains till you sell and it keeps growing. Get into index funds and a few good blue chips. Ride them for the future and leave gambling for time in Vegas. You hit your long shot parlay. Don’t blow it buying lottery tickets.", "score": 1, "replies": []}]}, {"body": "PAPERBOY!", "score": 1, "replies": []}, {"body": "Not even gone lie but it sounds to good to be true .. respectfully no way you gained 800k on “ a small investment “ ...", "score": 0, "replies": [{"body": "Have you seen GME?", "score": 3, "replies": [{"body": "Yes sir.", "score": 1, "replies": [{"body": "Then you should deffinetly not be surprised", "score": 1, "replies": [{"body": "Still at. Small fortune would have to be roughly 20-30k", "score": 1, "replies": []}]}]}]}]}, {"body": "I mean I know this is a stock sub but you can consider putting part of the money into buying bonds since you have a huge sum. Bonds are a safer investment and they pay bond dividends that can range up to 5-6% \n\nAlternatively blue chip companies are also good buys. I mainly buy AAPL.\n\nBtw I'm not from USA but I see a lot of older folks with large amounts of retirement funds doing this in my country. They are able to retire by living frugally on bond dividends and also blue chips.", "score": 0, "replies": [{"body": "Wow bonds have returns that high? Had no idea.\n\nI was looking into some stocks that return money to shareholders and are still growing for maybe 1/3rd of my portfolio.\n\nSo far $MO has looked good", "score": 2, "replies": []}, {"body": "Interest rates are rock bottom so anything that pays that much interest is highly likely to be at risk of defaulting. This isn't very good advice compared to buying a low cost globally diversified or S&P 500 ETF.", "score": 1, "replies": []}]}, {"body": "You big mistake is you’re talking too much... that kinda money will get your family killed... you can get advice without divulging dollar amounts... I hope you aren’t this open w the information in person", "score": -12, "replies": [{"body": "Nobody is going around killing peoples families over 800k unless you live in a 3rd world shithole or have ties to criminal enterprises.", "score": 8, "replies": [{"body": "😂😭😂😭 you must live with your head up your ass... CLEARLY", "score": 0, "replies": []}]}, {"body": "Nah I havent told anyone in person. Not even my parents know.", "score": 1, "replies": []}]}, {"body": "I would invest in 100 shares of TQQQ. It has higher volitility, but on average, it's returned about 70% yearly. Selling CCs on those is pretty nice too. \n\nYou could sell a CC leap for where you expect it to be. If it doesn't reach your mark, the premium helps makes up for not reaching it. \n\nSell monthly CCs, when it splits again, you get double or triple the shares.\n\nIf you're not actively managing all of your capital, parking some in an ETF is a hassle free way to keep it growing.", "score": 1, "replies": []}, {"body": "Buying a house would be a better investment and paying off in full a new car then the stock market lol", "score": 1, "replies": [{"body": "Afterwards stick that money into big name companies that have impressive growth. IE Sony/Microsoft/shit even amazon. Basically, you will bank any money you make from work as you already paid off your mortgage and car. Almost 30-50% of people’s income if not more goes to those two bills.", "score": 2, "replies": []}, {"body": "If I could afford a house I would just buy it, but houses cost like 5x what Ill have post-tax", "score": 1, "replies": [{"body": "Okay what currency is this 800k in?", "score": 1, "replies": [{"body": "usd", "score": 1, "replies": [{"body": "If you can’t buy a house with that much money you should probably move. You will be able to bet in more money securing a house and car with no loans than the stock market again (most likely)", "score": 1, "replies": [{"body": "Isnt the housing market also inflated because of low interest rates? Im going to see what happens in the next couple of years when they are forced to raise rates to combat inflation. I also dont want to move since I grew up here my whole life.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Selling cash covered OTM puts can be dangerous. When you say \"if there is a crash you can simply just take assignment\", I think you are downplaying the risks with selling options. When you turned a small amount into 800k with call options, think about the leverage that you used to your advantage. When the tables turn and you are the one selling the options, that leveraging affect could work against you.  If I were you , I would paper trade your strategy first. You can then see how  the losses can potentially be way worse than the premiums you collect when things don't go your way.", "score": 1, "replies": [{"body": "The way I see it, even if there is a crash and the puts I sell are ITM, its still better than if I had bought shares. Not only would my cost basis be lower, I also have the option to indefinitely roll for a credit and wait for the underlying to recover.", "score": 2, "replies": []}]}, {"body": "I don’t understand. Even cashing out and keeping your 800k under the bed has risks.\n\nyou have to figure out where your windfall will be.", "score": 1, "replies": [{"body": "Yea, i have serious loss aversion fear now. I think im going to go 33% value stocks and 66% thetagang strats and try to match the market", "score": 0, "replies": []}]}, {"body": "Buy a house or two make a rental place profit", "score": 1, "replies": []}, {"body": "I’m in a similar position as you. I am currently selling weekly OTM puts against my highest conviction stock, TSLA. I choose strikes with delta between -0.05 and -0.1. Sometimes I’ll roll the puts up mid week if the stock is steady or up. If the stock is down, I am defensive and roll the put out and down. This week I made over 30% annualized gain, which I suppose would be ~15% after tax since it’s all short term gain. I think it’s a great strategy as long as you monitor it, know how to defend it, and are willing to run the wheel by selling calls if the put prints. I would recommend though not to get greedy, and target a lower percentage annualized gain to protect your cash and once you have a good feel for how to defend and monitor the position, you can target higher.", "score": 1, "replies": []}]}
{"title": "Today will be all about this. Don't forget to set the alarm. February 18 at 12:00 PM ET / 18:00 Berlin time.", "selftext": "", "id": "lmiu0o", "created_utc": 1613640548.0, "score": 3631, "upvote_ratio": 0.98, "num_comments": 259, "comments": [{"body": "SEC Hearing - GME related.\n\nSince people keep asking for live streams:\n\n\nhttps://youtu.be/RfEuNHVPc_k\n\nhttps://financialservices.house.gov/live/\n\nBig thx to the retarded apes in the comments who posted it first.", "score": 299, "replies": [{"body": "Remindme! 3 hours", "score": 21, "replies": [{"body": "I will be messaging you in 3 hours on [**2021-02-18 17:03:55 UTC**](http://www.wolframalpha.com/input/?i=2021-02-18%2017:03:55%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/lmiu0o/today_will_be_all_about_this_dont_forget_to_set/gnvwj8s/?context=3)\n\n[**59 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Flmiu0o%2Ftoday_will_be_all_about_this_dont_forget_to_set%2Fgnvwj8s%2F%5D%0A%0ARemindMe%21%202021-02-18%2017%3A03%3A55%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20lmiu0o)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 12, "replies": []}]}, {"body": "they should have left the youtube comments on lol", "score": 21, "replies": []}, {"body": "Over 6K waiting right now to see it and still 2hrs to go", "score": 19, "replies": [{"body": "10k now", "score": 14, "replies": [{"body": "12358", "score": 6, "replies": [{"body": " 15,186 waiting now", "score": 4, "replies": [{"body": "19,463 @ 11:31 AM", "score": 1, "replies": [{"body": "22k", "score": 1, "replies": []}]}]}]}]}, {"body": "26k now and 12 mins til it starts", "score": 3, "replies": []}]}, {"body": "You are the hero we deserve", "score": 12, "replies": []}, {"body": "Big thanks!", "score": 3, "replies": []}, {"body": "Is there an audio only stream?", "score": 2, "replies": [{"body": "Audible.com/retard", "score": 3, "replies": []}, {"body": "Just play the video and don't watch.", "score": 2, "replies": [{"body": "I'm at work with no wifi trying to preserve my data lmao", "score": 2, "replies": []}]}]}, {"body": "Remindme! 3 hours", "score": 1, "replies": []}, {"body": "RemindMe! 1 hour", "score": 1, "replies": []}, {"body": "which link is the live stream?", "score": 1, "replies": []}, {"body": "no sound for you all?", "score": 1, "replies": []}]}, {"body": "Look at this graph", "score": 690, "replies": [{"body": "Every time i do it makes me laugh", "score": 324, "replies": [{"body": "How did our stocks get so red?", "score": 233, "replies": [{"body": "What the hell is on DFV’s head?", "score": 214, "replies": [{"body": "This is where we blew up", "score": 119, "replies": [{"body": "I think Robinhood fucked us up", "score": 127, "replies": [{"body": "Maybe memes will bring them back up?", "score": 88, "replies": [{"body": "Come on, let's buy the dip, fix it up!", "score": 91, "replies": [{"body": "They don’t teach us stonks in school", "score": 67, "replies": [{"body": "If they did that would be pretty cool", "score": 72, "replies": [{"body": "But that would never happen cause I'm a fool", "score": 20, "replies": [{"body": "And the hedgies are all fucking tools!", "score": 21, "replies": [{"body": "LOOK AT THIS GME GRAPH!", "score": 9, "replies": [{"body": "Been fucked by hedgefund staff!", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": []}]}]}, {"body": "Every dollar in my Roth is through the back door\n\nBut my options keep on falling straight through the floor\n\nIt's hard to hold it, (and) I've not sold it.\n\nGo buy, go buuuyyy", "score": 12, "replies": []}]}]}, {"body": "I never knew we werent at the moon", "score": 8, "replies": []}, {"body": "I never knew we'd ever went without", "score": 4, "replies": []}]}]}]}, {"body": "Where on the graph did the hedge funds touch you?", "score": 73, "replies": [{"body": "Ruined the song 🤦♂️", "score": 45, "replies": [{"body": "Impossible, that shit was wrecked when it came out", "score": 6, "replies": []}]}]}, {"body": "Except for AMC right now.", "score": 6, "replies": []}, {"body": "I should have never got out of bed...", "score": -7, "replies": []}]}]}, {"body": "Look at this fucking graph", "score": 40, "replies": []}, {"body": "https://youtu.be/sIlNIVXpIns", "score": 19, "replies": [{"body": "I legit LOL'd", "score": 2, "replies": []}]}, {"body": "If ur portfolio ain't look like this then u ain't diamond hand", "score": 57, "replies": [{"body": "why does that guy have a screenshot of my portfolio????", "score": 35, "replies": []}]}, {"body": "Mickelback", "score": 8, "replies": []}, {"body": "Lol", "score": 4, "replies": []}, {"body": "What color is this? I've never seen it before...", "score": 3, "replies": []}, {"body": "But what the hell is on Joey’s head????", "score": 2, "replies": [{"body": "Batman's head", "score": 2, "replies": []}]}, {"body": "M", "score": 1, "replies": []}, {"body": "I had a feeling they sold us out", "score": 1, "replies": []}, {"body": "Damn it. I read that in his voice.", "score": 1, "replies": []}, {"body": "I have never laughed as hard at any other meme. I peed myself from laughter the first time I saw this one.", "score": 1, "replies": []}]}, {"body": "I want this hearing to get more views than Super Bowl considering that we have international retards as well in the sub", "score": 215, "replies": [{"body": "This is the ✨Stock Bowl✨\n\nTEAM  🚀 DFV vs Evil Corporate Giants 🔪\n\nDun dun dunnnn... 🥁✨", "score": 38, "replies": []}, {"body": "Americans realizing there's more than their 50 states in the world is all the viewing pleasure i need.\n\n&#x200B;\n\nKinda like watching a monkey realize they have fingers, the little guys get so excited.", "score": 40, "replies": [{"body": "You mean there are Americans who believe that there are more than 48 states? /s", "score": 4, "replies": []}, {"body": "Until they realise that they can't be world champions of a national league.", "score": 2, "replies": []}, {"body": "We know there is more than just us but yall are irrelevant 99% of the time but now we are all getting fucked together and I want to look into your eyes while it happens", "score": 1, "replies": []}]}, {"body": "Hmm, Super Bowl has a slightly better ring to it. Fuck watching, I'll just buy some more. (German retard)", "score": 5, "replies": []}, {"body": "British retards checking in 🇬🇧", "score": 3, "replies": []}]}, {"body": "UK 5pm", "score": 132, "replies": [{"body": "UK MVP right here", "score": 46, "replies": [{"body": "thanks for caring about USA CSPAN more than most USA ppppl", "score": 5, "replies": [{"body": "CSPAN is gonna hit an all time viewing record today", "score": 6, "replies": [{"body": "So calls option on CSPAN? Got it.", "score": 3, "replies": []}]}]}, {"body": "Really that hard to take an hour away from German time?", "score": 1, "replies": [{"body": "What's a German?", "score": 2, "replies": [{"body": "A dog breed.", "score": 2, "replies": []}]}]}]}, {"body": "Fellow uk reporting for duty", "score": 2, "replies": []}]}, {"body": "Hopefully there are multiple sources because some shitty government site is about to get crushed by the weight of a million fat retards", "score": 36, "replies": [{"body": "its on yt", "score": 2, "replies": []}]}, {"body": "Going to be setting an alarm for 12.59am Perth time.\n\nWork is going to be exciting and hell tomorrow.", "score": 35, "replies": [{"body": "Jesus, seeing comments like yours make me very glad I live in EST time. Good luck soldier", "score": 2, "replies": []}]}, {"body": "That shape that will forever be immortalized on all who 💎✋GME thru the storm\n\n100@$20 and still holding", "score": 128, "replies": [{"body": "20@$100 and still holding.", "score": 86, "replies": [{"body": "11@$350 still holding.", "score": 59, "replies": [{"body": "$350 GME gang in the house. Don’t fuck with us, we’re poor now", "score": 51, "replies": [{"body": "Facts! 4@ 350, living on canned soup and sausage for a week now. Dont care. Let's get it!", "score": 16, "replies": [{"body": "2 @ $350 and 1 @ $300. 💎✋ Am I doing it right?", "score": 5, "replies": [{"body": "Yes you are, you absolute beast. We all contribute to our success", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "You mentioned something that looks like crypto. We get it, crypto is neat, but it's not our thing. [(Rule 4)](https://old.reddit.com/r/wallstreetbets/about/rules)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Bless your heart...", "score": 13, "replies": []}, {"body": "x8 @$93 avg ✨🚀👀", "score": 5, "replies": []}]}, {"body": "800 at 99 - holding and buying. 🚀🚀🚀🥜🥜🥜", "score": 9, "replies": [{"body": "Would if I could. I'm all in.", "score": 1, "replies": [{"body": "Good I’m getting close. For the record, I did well but bought back in.  I like the stock long term.  I want to see the bag holders on the moon with me.  This is the way.  This sub was awesome before it got invaded with paper handed bitches.", "score": 1, "replies": []}]}]}, {"body": "this is the way", "score": 2, "replies": []}, {"body": "20 @ 200\n\nHolding and hoping", "score": 2, "replies": []}]}]}, {"body": "Can’t believe I didn’t sell on Batman’s second ear", "score": 87, "replies": [{"body": "you always sell back some on the second ear....", "score": 18, "replies": [{"body": "Right?! I thought you guys were telling me I should keep holding, but it turns out it was just some stupid jerks that were saying that", "score": 18, "replies": [{"body": "Thank you for your service", "score": 11, "replies": []}]}]}, {"body": "Underrated", "score": 2, "replies": []}]}, {"body": "Lol the [\"Look at this graph\"](https://www.youtube.com/watch?v=sIlNIVXpIns)video made me laugh my ass off when it first came through here", "score": 20, "replies": []}, {"body": "Thank you for the Berlin time USA friends. The chart looks like Batman.", "score": 14, "replies": [{"body": "Waving from Hamburg City", "score": 5, "replies": [{"body": "Tachchen Sir!", "score": 3, "replies": []}]}]}, {"body": "Where do you watch it?", "score": 13, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "Thanks!", "score": 7, "replies": []}]}, {"body": "https://youtu.be/sIlNIVXpIns", "score": 1, "replies": []}]}, {"body": "What's this about? I am new here.", "score": 9, "replies": [{"body": "Like brand new? Like five minutes ago brand new?", "score": 6, "replies": [{"body": "Actually I’d like to know too", "score": 1, "replies": []}, {"body": "Yes, 5min ago brand new without any knowledge of that topic", "score": 1, "replies": []}]}]}, {"body": "Does anyone believe Maxine Waters or any of the house members on the finance committee will be able to understand and comprehend anything the witnesses say?", "score": 15, "replies": [{"body": "no.  ideally they know enough to ask for data/facts/proof instead of just nodding their head.  that is all I want.", "score": 13, "replies": []}]}, {"body": "So someone dumb it down for me. What are we hoping for?", "score": 6, "replies": [{"body": "- Expecting: entertainment and monkey noises\n- Hoping:  anything useful", "score": 39, "replies": [{"body": "hoping: the GOV does not simply nod their head and agree with everything the HF and RH say.  \n\nHoping: The gov asks for facts and data to backup the claims made.", "score": 14, "replies": [{"body": "They have to do the song & dance, but afterwards, when less people are paying attention, charges will be dropped, fines reduced, etc.", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "[deleted]", "score": 26, "replies": [{"body": "thanks for not rick rolling", "score": 20, "replies": [{"body": "[deleted]", "score": 17, "replies": []}]}]}]}, {"body": "That graph looks like it went tits up", "score": 13, "replies": []}, {"body": "Time in uk pls", "score": 6, "replies": [{"body": "5pm", "score": 7, "replies": []}, {"body": "Check the comments for \"uk\". \nAlready posted somewhere", "score": 5, "replies": [{"body": "How's a retard supposed to do that, you fool? Most of us can't read. Someone only showed me where the buy button is and what to do. Still trying to learn the other shit.", "score": 6, "replies": [{"body": "Shit i even forgot for a second that even I cant read...\nWent full retard on that one. Thx for reminding me.", "score": 3, "replies": [{"body": "No worries. If you have a minute, could you tell me what time it is?\n\nNah, forget that. I know the answer, it'd be a minute. Or you wouldn't have one in the first place. This is weird, I'll leave now.", "score": 3, "replies": []}]}]}]}]}, {"body": "View in your timezone:  \n[February 18 at 12:00 PM ET][0]  \n\n[0]: https://timee.io/20210218T1700?tl=Today%20will%20be%20all%20about%20this.%20Don't%20forget%20to%20set%20the%20alarm.%20February%2018%20at%2012%3A00%20PM%20ET%20%2F%2018%3A00%20Berlin%20time.", "score": 10, "replies": []}, {"body": "It’s a virtual hearing :( I wanted to see them all in the same room", "score": 10, "replies": []}, {"body": "I'm betting the dip this morning is market manipulation from hedges, and there will be a spike on the afternoon.", "score": 5, "replies": []}, {"body": "NO SOUND", "score": 5, "replies": []}, {"body": "Will there be online stream?", "score": 7, "replies": [{"body": "Happy Cake Day!", "score": 3, "replies": []}, {"body": "No thousand have to go there during quarantine time.. best without masks", "score": 1, "replies": []}]}, {"body": "The day roaring kitty received his ears.", "score": 3, "replies": []}, {"body": "Be lucky to get a nickel back", "score": 3, "replies": []}, {"body": "Audio issues on Youtube lol", "score": 3, "replies": []}, {"body": "https://financialservices.house.gov/live/", "score": 2, "replies": []}, {"body": "Where the link for live stream?", "score": 2, "replies": []}, {"body": "What’s the purpose of this? Help an retard. \nStill holding btw", "score": 2, "replies": []}, {"body": "Where can we watch online?", "score": 2, "replies": []}, {"body": "Chad is such a babe", "score": 2, "replies": []}, {"body": "Capital \"M\" for \"Melvin Captial\"", "score": 2, "replies": []}, {"body": "lol..I am in Berlin! :)", "score": 2, "replies": [{"body": "I... know![gif](emote|free_emotes_pack|table)", "score": 1, "replies": []}]}, {"body": "look at this graph", "score": 2, "replies": [{"body": "everytime I do it makes me hold", "score": 1, "replies": []}]}, {"body": "Sadly this retard is being forced by \"corporate action\" to \"close\" their shares today. Fuck if I know what it really means, but I'm pretty sure that means that the app I use is going to forcibly sell my shares, and prevent buying. They did it with Score Media today, but at least I made a solid $9.30", "score": 2, "replies": []}, {"body": "I'm through with buying some calls for stocks ill never get in its like the stock is shorted wide and deliveries are thin this retard just wants to buy some more GME. \n\nSo what chu want\n\nI want some brand new shares wanna buy em from melvin and i really dont care what happens to plotkin I didn't even know the guy was jewish - news to me\n\nBeen there, done that", "score": 2, "replies": []}, {"body": "I want my Nickels back", "score": 2, "replies": []}, {"body": "Wait, what's going on? I'm a newbie, is this about GME?", "score": 2, "replies": []}, {"body": "Thanks for german time in the title", "score": 2, "replies": []}, {"body": "Will he need to tell the judge he is not a really a cat?", "score": 2, "replies": []}, {"body": "Nice fucking haircut, Vlad", "score": 2, "replies": []}, {"body": "I bought 1 GME out of shear admiration. \n \n\nSo when they say thank you for the opportunity do they mean “ fuc* you very much”\nThey do research for months or years! Oh good lord he just played a card!", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "SEC hearing. Since you are asking this question I assume you probably don't know who will be there. Melvin Capitol CEO, reddit CEO, robbinhood CEO, DeepFuckingValue.", "score": 36, "replies": [{"body": "Excuse me, it’s Dr. DeepFuckingValue", "score": 17, "replies": []}]}, {"body": "Where tf did u come from? Like seriously it’s the only reason why we are all here.", "score": 15, "replies": []}]}, {"body": "Can your retarded countries stop using am/pm. It's confusing", "score": 3, "replies": [{"body": "am = morning + midnight\npm = noon + afternoon", "score": 1, "replies": [{"body": "10 = 10\n\n22 = 22\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nmono = one\n\nrail = rail", "score": 2, "replies": []}]}, {"body": "for any pm number, just add 12 to it. \n\n2pm=14:00\n\n8pm=20:00", "score": 1, "replies": []}]}, {"body": "CET*, not everything in Central EU revolves around Berlin lol.", "score": 2, "replies": [{"body": "Sure it does, Berlin is what Toronto is for Those outside of Canada. \n\nWe all know it and have a rough idea of where it is.", "score": 2, "replies": [{"body": "Why would it matter? Doubt us Europeans care about Toronto's time zone and 4 sho know in what time zone are we.", "score": 2, "replies": []}]}]}, {"body": "Nickleback?", "score": 2, "replies": []}, {"body": "definition of tits up...", "score": 2, "replies": []}, {"body": "8am. Sydney Australia, alarm is set", "score": 1, "replies": [{"body": "U sure? 3am Qld time.", "score": 7, "replies": []}, {"body": "You mean 4am. Melbournian here", "score": 2, "replies": [{"body": "Thanks for the heads up for sure got my times wrong...", "score": 1, "replies": []}]}]}, {"body": "I'm starting to hate that M shaped pattern, GME and now PLTR :'(", "score": 1, "replies": []}, {"body": "Backstreet Boys still got it.", "score": 1, "replies": []}, {"body": "Don't forget to watch the [mars landing](https://youtu.be/gm0b_ijaYMQ) too.", "score": 1, "replies": []}, {"body": "au ?  \nany info please ?  \n\n\ndon't get it", "score": 0, "replies": []}, {"body": "I know I’m late to the party, but I wanna join with you guys. I wanna but $600 worth of GME but I’m scared to lose it all. Why are we confident that it will go back up?", "score": 0, "replies": []}, {"body": "What happens today?\n\nEdit: why yall downvoting? Im just curious.", "score": -6, "replies": []}, {"body": "Which share?", "score": -7, "replies": [{"body": "Wild guess bro.", "score": 8, "replies": []}]}, {"body": "its M for Melvin", "score": 1, "replies": []}, {"body": "Need to use this one too\n\nhttps://preview.redd.it/dhcfkktetsh61.png?width=2076&format=png&auto=webp&s=09e8a3d2b8b59bb02c0ae8d3da18e40b6f0dcec6", "score": 1, "replies": []}, {"body": "where link?", "score": 1, "replies": []}, {"body": "Woooooooooow forgot about this song", "score": 1, "replies": []}, {"body": "Hey that's a 'graph, not a chart.", "score": 1, "replies": []}, {"body": "When he starts to talk i ll buy", "score": 1, "replies": []}, {"body": "That should be GME's logo.", "score": 1, "replies": []}, {"body": "Remindme! 3 hours", "score": 1, "replies": []}, {"body": "Euro retard checking in! Watching to see what shut spin they got with against DFV.", "score": 1, "replies": []}, {"body": "[https://www.youtube.com/watch?v=RfEuNHVPc\\_k&feature=emb\\_title](https://www.youtube.com/watch?v=RfEuNHVPc_k&feature=emb_title)   \n\n\nHere is the stream.", "score": 1, "replies": []}, {"body": "Thanks, I already was looking for that. Germantard here.", "score": 1, "replies": []}, {"body": "Remindme! 1 hour", "score": 1, "replies": []}, {"body": "Is that the dude from Nickleback?", "score": 1, "replies": []}, {"body": "Hahahahha", "score": 1, "replies": []}, {"body": "\"Please don't be all about Nickelback.\"", "score": 1, "replies": []}, {"body": "This song is stuck in my head now and I will never forgive you.", "score": 1, "replies": []}, {"body": " I looked at this graph so much it’s practically ingrained in my brain", "score": 1, "replies": []}, {"body": "i am poor", "score": 1, "replies": []}, {"body": "What will happen ?", "score": 1, "replies": []}, {"body": "!RemindMe 45 minutes", "score": 1, "replies": []}, {"body": "Look at this GRAPHHH", "score": 1, "replies": []}, {"body": "Will it be on regular TV too or livestream only?", "score": 1, "replies": []}, {"body": "This meme is one of the few that make me crack up without fail every time", "score": 1, "replies": []}, {"body": "Redrum. 😕", "score": 1, "replies": []}, {"body": "Can someone ask how they have managed to cover so many shorts in the last two days while at the same time driving the price down? S3 is showing shorted shares down to 18 million. 26% decrease this week alone. We are watching a massive fraud before our very eyes.", "score": 1, "replies": []}, {"body": "What's with the text on the graphic while we wait?\n\n[https://www.youtube.com/watch?v=RfEuNHVPc\\_k&feature=youtu.be&ab\\_channel=FinancialServicesCommittee](https://www.youtube.com/watch?v=RfEuNHVPc_k&feature=youtu.be&ab_channel=FinancialServicesCommittee)\n\n\"Game Stopped? Who Wins and Loses When Short Sellers, Social Media, and Retail Investors Collide\"\n\nThis isn't some WWE matchup. We already know who's winning rn. It's the Big Money that banded together to over-short a company and manipulate the market so that company's stock dropped.\n\nThey were going to win, but then a bunch of Apes banded together and called them out. But the moment they started to feel the squeeze they pulled some shady strings, manipulated the market again, flipped the board, and took the W anyway. And now they're trying to call foul on a few people on the retail side just to kick them in the teeth while they're already down.\n\nWe know who's winning and it isn't the retail investors.\n\nThis is about holding the Big Money accountable for changing the rules when it suits them most. This is about Big Money screwing the market however they want and then screwing the retail investors out of millions of dollars just so they could have their cake and eat it, too.\n\nThis isn't a game and I'm not laughing.", "score": 1, "replies": []}, {"body": "Is the guy in the photo the lead singer of Nickelback?", "score": 1, "replies": []}, {"body": "I just bought another hundred GME stocks in support of DFV!", "score": 1, "replies": []}, {"body": "WHere the fuck is the sound.", "score": 1, "replies": []}, {"body": "Watching rn, we are all apart of this moment in history", "score": 1, "replies": []}, {"body": "What’s happening? Can someone please explain? Thanks !", "score": 1, "replies": []}, {"body": "Shit, what are we investing in?", "score": 1, "replies": []}]}
{"title": "I have proof PLTR will moon in the future that hedge funds have no yet considered.", "selftext": "Amazon is going balls to the wall on the upcoming LotR series based on the Second Age of Middle Earth. They are expected to spend about $1 billion dollars on this series and are hopeful that it can be the next Game of Thrones.\n\nSome of you movie watchers probably already know that PLTR is named after the Palantír seeing stones that Saruman(the old evil white wizard guy) was using, or when that midget Pippin almost fried his brain after touching it.\n\nThese stones are used much more frequently in the 2nd age, they were located in Minas Arnor(Tirith in the movies - aka Gondor), Ithil(aka Morgul the evil Nazgul place with green lights and shit), Orthanc(Isengard), as well as the northern Kingdom of Arnor where big dick Elendil(father of Isildur - Aragorn's great great great grandfather) lives.\n\nIf this show is successful and PLTR is regularly featured it will 100% become a meme stock.\n\nBuy shares since we too broke for leaps.", "id": "lmqbsy", "created_utc": 1613664930.0, "score": 2826, "upvote_ratio": 0.94, "num_comments": 253, "comments": [{"body": "This is the best DD I've read here", "score": 1099, "replies": [{"body": "Makes sense. Buying in!", "score": 119, "replies": [{"body": "[deleted]", "score": 47, "replies": [{"body": "\"A wizard is never early, he arrives precisely when he means to.\"", "score": 41, "replies": [{"body": "A wizard never buys too high, he buys precisely when he means to.", "score": 23, "replies": []}]}]}]}, {"body": "Don't know if I trust it there was no rocket emojis. All my rocket emoji DD shit has been becoming red as fuck on Fidelity(meaning its a hot stock).", "score": 16, "replies": [{"body": "Damn right!  Buy high sell low.  I dont what these guys game plan is im tryn to make sure all money is gone and only debt is left for asshole ungrateful kids", "score": 1, "replies": []}]}, {"body": "Nah, the shorting South Africa one still takes the cake", "score": 62, "replies": [{"body": "I was digging it until he mentioned forex.", "score": 2, "replies": []}, {"body": "Now I'm curious.  Got a link?", "score": 4, "replies": [{"body": "lazy cunt  \n\n\n[https://www.reddit.com/r/wallstreetbets/comments/lkzviy/i\\_am\\_going\\_to\\_short\\_the\\_whole\\_country\\_of\\_south/](https://www.reddit.com/r/wallstreetbets/comments/lkzviy/i_am_going_to_short_the_whole_country_of_south/)", "score": 26, "replies": [{"body": "Thanks bitch", "score": 11, "replies": []}]}]}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "Due diligence", "score": 5, "replies": [{"body": "And here was me thinking it was a “Deep Dive” 😓", "score": 5, "replies": []}]}, {"body": "Dick & Dalls", "score": 6, "replies": []}, {"body": "Do Diligence", "score": 1, "replies": [{"body": "Poo pillaging", "score": 1, "replies": []}]}]}, {"body": "NO ONE UPVOTE THIS ONCE IT HITS 669", "score": 3, "replies": [{"body": "I just updated it to 966...", "score": 1, "replies": []}]}, {"body": "Sorry, I'm still bagholding Valyrian Steel", "score": 1, "replies": []}, {"body": "\\>be AMZN", "score": 1, "replies": []}, {"body": "Ahhh back to the basics", "score": 1, "replies": []}, {"body": "No rockets. How the fuck am i supposed to interpret this?", "score": 1, "replies": []}]}, {"body": "Bilbo Bagholder", "score": 347, "replies": [{"body": "Gandolf the gay... Bear", "score": 27, "replies": []}, {"body": "PLTR will go back up lalalalala I can't hear you lalalalala", "score": 39, "replies": []}, {"body": "Underrated comment.", "score": 17, "replies": []}, {"body": "Dill Dough Baggins", "score": 1, "replies": []}, {"body": "💀💀", "score": 1, "replies": []}]}, {"body": "Sir, this is a Middle-earth", "score": 81, "replies": [{"body": "Where am I?", "score": 1, "replies": []}]}, {"body": "Convinced at the “midget Pippin” comment - buying more pltr", "score": 148, "replies": [{"body": "Ex-fucking-scuse you. Peregrin Took was the second tallest hobbit in history, only surpassed by Meriadoc Brandybuck. I mean, Bandobras in third doesn't come close. So watch your damn tongue.", "score": 32, "replies": [{"body": "Save some pussy for the rest of us boss.", "score": 45, "replies": [{"body": "I’m chest deep in Entwife right now", "score": 15, "replies": [{"body": "WHERE ARE THEY?!", "score": 5, "replies": []}]}]}]}, {"body": "Halfling and Hobbit are non-PC terms. We say midget now.", "score": 26, "replies": [{"body": "😂", "score": 6, "replies": []}, {"body": "I believe the term is height challenged. 😁", "score": 3, "replies": [{"body": "I'm circumferentially challenged.", "score": 6, "replies": []}, {"body": "Vertical impairment", "score": 7, "replies": []}, {"body": "Differently tall.", "score": 3, "replies": []}, {"body": "Compact engineered", "score": 1, "replies": []}]}]}]}, {"body": "Upvoting because of LOTR lore being used as reasoning.", "score": 103, "replies": [{"body": "And my share", "score": 4, "replies": []}]}, {"body": "You have my sword", "score": 81, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "I traded in my axe for this neat helmet", "score": 5, "replies": []}, {"body": "... How about a friend?", "score": 3, "replies": []}]}, {"body": "And my axe!", "score": 7, "replies": []}, {"body": "And my money", "score": 2, "replies": []}, {"body": "And my weaponised cock", "score": 2, "replies": []}]}, {"body": "Top-tier shit post", "score": 24, "replies": []}, {"body": "It also starts with a P and I like those odds\n\nProfit\n\nPussy\n\nPalantir\n\nPoon to the moon", "score": 17, "replies": []}, {"body": "This is the most retarded thing I’ve seen in my 2 weeks of trading. I’m in", "score": 44, "replies": []}, {"body": "You can afford LEAPS. PLTR Jan 22 calls @ 30 are trading below ten bucks. That’s less than a grand and you can find even cheaper ones too.\n\nFool of a Took", "score": 11, "replies": []}, {"body": "Everyone in this sub is now a little bit more brain dead.. well done.. good dd", "score": 21, "replies": []}, {"body": "I can't trust this, no rockets,  no diamonds, no insults.  This is misleading spam.  Im doubling down on Sears", "score": 25, "replies": [{"body": "Don’t forget JCP", "score": 4, "replies": []}, {"body": "I like sears. I miss those catalogs, especially the bras pages. The first things I jerked off to! \n\nLifesavings on sear! I love pennystocks anyway!", "score": 2, "replies": []}]}, {"body": "I use to be an investor like you, then I took an arrow in the GMknee.", "score": 9, "replies": [{"body": "🤣", "score": 1, "replies": []}]}, {"body": "I like pltr to be honest... I’m way down with an avatar cost around 28~ but it will go back up I believe", "score": 21, "replies": [{"body": "Same boat with an avg cost of 29.50, I beleive it will hit 50 by next quarter.", "score": 15, "replies": [{"body": "i honestly can't believe people doubt pltr. even I'm not that retarded", "score": 2, "replies": []}, {"body": "Ya I’ll have some funds next week so I may gobble some more up if it stays this low", "score": 3, "replies": []}]}, {"body": "Just bought in at 25 because it's going up over time. Don't have the balls to gamble right now but.i like the stock.\n\nI'm still learning to lose my money like you retards", "score": 2, "replies": []}, {"body": "Going off the charts and today's action, $25 does appear to be the floor.  But I'm retarded and it will be down to $10 tomorrow.", "score": 1, "replies": [{"body": "This week I have learned there is no floor", "score": 1, "replies": []}]}]}, {"body": "This guy fucks 🚀 💎", "score": 6, "replies": []}, {"body": "Didn't read the post but I see people in comments are buying so guess I'll buy some too!\n\n\\#investing", "score": 19, "replies": []}, {"body": "Asked my wife's boyfriend for an advance on my allowance and yoloed it all in!", "score": 13, "replies": []}, {"body": "Convincing.", "score": 12, "replies": []}, {"body": "Stonks go up makes sense", "score": 12, "replies": []}, {"body": "Fuck it, I'm convinced", "score": 7, "replies": []}, {"body": "I am putting my entire 401k in it after this DD!", "score": 11, "replies": [{"body": "Pics when it works", "score": 1, "replies": []}]}, {"body": "all in", "score": 5, "replies": []}, {"body": "Thanks, buying in when my bags aren't so heavy.", "score": 5, "replies": []}, {"body": "Turned on margin this morning", "score": 4, "replies": []}, {"body": "Seems likely to base around 20 tomorrow or Monday", "score": 3, "replies": []}, {"body": "Mmmmm\nBreakfast Tendies\nSecond Breakfast Tendies\nElevenses Tendies\nLuncheon Tendies\nAfternoon Tea Tendies\nDinner Tendies\nSupper Tendies", "score": 7, "replies": []}, {"body": "Something festers in the heart of Middle-Earth. Something that you have failed to see. But the Great Eye has seen it. Even now he presses his advantage.", "score": 3, "replies": []}, {"body": "How do you spell pltr? I want to buy some.", "score": 3, "replies": [{"body": "P-L-T-R", "score": 1, "replies": []}]}, {"body": "You son of a bitch, I'm in!", "score": 3, "replies": []}, {"body": "I’m sold", "score": 3, "replies": []}, {"body": "Going to the moon 🦅🦅🦅🦅🦅🦅🦅", "score": 3, "replies": [{"body": "Ride the eagles to Mt doom!", "score": 1, "replies": []}]}, {"body": "Ahhh but AMZN knows this to and will rename the seeing stones to confuse the background of PLTRs name and mess with a competitor. Stocks will collapse.", "score": 3, "replies": [{"body": "Look into the AWStìr", "score": 2, "replies": []}]}, {"body": "Subliminal messaging", "score": 3, "replies": []}, {"body": "well I fucking hope so cause the let downs are starting to piss me off...alas I hold", "score": 2, "replies": []}, {"body": "You know the future and the best you got for us is about some fkng stonk?", "score": 2, "replies": []}, {"body": "I'm in.", "score": 2, "replies": []}, {"body": "As long as I don’t have to hear Celebrimbor ever say “palantir” again, it should be good.", "score": 2, "replies": []}, {"body": "Everytime I read the stock name I say/think it like Celebrimboor from the LoTR Shadows of War games. He says Palantir like a million times in the game. They must have know the future when making it, trying to lead us to the tendies.", "score": 2, "replies": [{"body": "https://gamefaqs.gamespot.com/boards/206388-middle-earth-shadow-of-war/75885222", "score": 1, "replies": []}, {"body": "People even posting about how often he says it years ago.\n\nhttps://www.reddit.com/r/shadow_of_war/comments/7yl35o/can_someone_please_make_a_compilation_of_every/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 1, "replies": []}]}, {"body": "I've been holding out but between this, the dip in price, and Cathie Wood buying in, I won't be holding out anymore.", "score": 2, "replies": []}, {"body": "I was waiting for a good dip to buy a leap, looks like the time has come", "score": 2, "replies": []}, {"body": "all in", "score": 2, "replies": []}, {"body": "Gréât chance of succes. Buying the dip", "score": 2, "replies": []}, {"body": "Big brain right here", "score": 2, "replies": []}, {"body": "Knows his history and his views are in line with mine✅", "score": 2, "replies": []}, {"body": "seems good, all in", "score": 2, "replies": []}, {"body": "You son of a bitch, I’m in", "score": 2, "replies": []}, {"body": "PTLR is just good stock, is definitely undervalued at the moment. I've been buying it since last year already have gains on it.", "score": 2, "replies": []}, {"body": "I mean I was already balls deep in this. But now I’m putting my whole fucking soul.", "score": 2, "replies": []}, {"body": "A retard is never late, he buys the stock exactly when he intends to buy the stock.", "score": 2, "replies": [{"body": "Fool of a Tard!", "score": 1, "replies": []}]}, {"body": "$25 is a steal right now.", "score": 2, "replies": []}, {"body": "I got in at 25 today in the afternoon. It’s a steal at that price in my opinion. Options are expensive so I did stock this time.", "score": 2, "replies": []}, {"body": "PLANTIR GOTHAM!", "score": 2, "replies": []}, {"body": "Cathie just added another 5 mil shares to Arkk", "score": 2, "replies": []}, {"body": "I came for Palantir DD, I left as a Palantard.", "score": 2, "replies": []}, {"body": "You have my dwarf dick!", "score": 4, "replies": []}, {"body": "Mr. u/jrviimonya, what you’ve just said is one of the most insanely nerdy things I have ever heard. At no point in your rambling, incoherent response were you even close to anything that could be considered a rational thought. Everyone in this subreddit is now nerdier for having listened to it. I award you all points, and may God have mercy on your soul.  PLTR🚀🚀🚀", "score": 2, "replies": []}, {"body": "Now hedgies know", "score": 1, "replies": []}, {"body": "This makes me want to sell 🤮", "score": 0, "replies": [{"body": "Stfu sauron", "score": 3, "replies": [{"body": "Eat a dongus you nerd!", "score": 2, "replies": []}]}]}, {"body": "Okay so what? So show comes out > features a Palantir in it > people realise there’s a stock called Palantir > buy Palantir\n\nDunno how you deduce this chain of events unless elon musk tweets about it. but hey maybe he will cos Peter thiel helped start Palantir and elon probs knows him from PayPal days.", "score": 1, "replies": []}, {"body": "JFC...wsb really is in dire need of some quality control...just because you watched Pulp Fiction doesn't mean you're the next Tarantino", "score": -10, "replies": [{"body": ">13 minute old thread\n\n>9 minute old comment\n\n>wsb is kill\n\nno", "score": 16, "replies": [{"body": "It was more a plea to posters to up the quality than an indictment of your efforts u/zjz.", "score": -2, "replies": []}]}, {"body": "Bruh I bought shares only because of the name, and there are people more retarded than me that just don't know about it yet. \n\nTolkienfanatics are like horny band geeks when it comes to anything LotR related.", "score": 10, "replies": [{"body": "I don't even know where to start, so I won't. Welcome to wsb and remember to post that loss porn.", "score": -5, "replies": [{"body": "Bet you pee sitting down", "score": 6, "replies": [{"body": "Fucking hilarious. I'm jacked to the tits in Palantir...it's OP's kinda first level thinking that is going to tank my position.", "score": 1, "replies": []}, {"body": "My wife’s boyfriend forces me to sit, otherwise I spray the whole wall full with my piss :(", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "What? So that we can hold bags until our dicks don't work?", "score": -2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "No my guy...wsb is a vehicle to evening the playing field and helping us achieve financial freedom. It saddens me that so little realise this.", "score": 0, "replies": []}]}]}]}]}, {"body": "[my preeeccciioooussss](https://www.youtube.com/watch?v=Iz-8CSa9xj8)", "score": 1, "replies": []}, {"body": "anyone know where i can get a replica Palantir like from LOTR?", "score": 1, "replies": []}, {"body": "Makes sense,. Buying", "score": 1, "replies": []}, {"body": "Bless you, you delightful little nerd", "score": 1, "replies": []}, {"body": "I’ll be your Sam", "score": 1, "replies": []}, {"body": "I’m just saying vista outdoors.\nThey’ve been down a long time.  And they own federal cartridge, and just bought Remington cartridge, they also own CCI, bushnell, demand is through the roof.  Finding ammo is basically impossible and prices are almost doubled in the last year. They’ve met or surpassed earnings expectations.", "score": 1, "replies": []}, {"body": "Ok nerd", "score": 1, "replies": []}, {"body": "Already waiting for the selling to stop so ...", "score": 1, "replies": []}, {"body": "Is this DD the reason why PLTR is in his low roaring twenties again? I like it. Now it has the chance to fly again.", "score": 1, "replies": [{"body": "Pleas", "score": 1, "replies": []}]}, {"body": "very conveincing", "score": 1, "replies": []}, {"body": "It's currently dipping right now despite positive news which I'm happy with. I'm just curious on how far it will dip. I bought at little bit when it $9. If it drops down that far somehow I'll be going all in. I highly believe the believe it's undervalued after listening to various YouTubers and reading some articles.", "score": 1, "replies": []}, {"body": "Ooooooh", "score": 1, "replies": []}, {"body": "This actually might work", "score": 1, "replies": []}, {"body": "average cost 31 🤕", "score": 1, "replies": []}, {"body": "This is so retarded, God speed PLTR, say hello from Jupiter", "score": 1, "replies": []}, {"body": "Finally DD I understand! ALL IN", "score": 1, "replies": []}, {"body": "You’re a god damned genius!\n\nDoubled my position after reading this.", "score": 1, "replies": []}, {"body": "The palantirs were the seeing stones of the men of the west. It was the guardians of the past and the future. \n\nCurrently only priced as Sarumans peeping cam.", "score": 1, "replies": []}, {"body": "Evil wizards and midgets? Roger that.. buying now.", "score": 1, "replies": []}, {"body": "Cybersecurity company with no stock splits means it might be very promising.", "score": 1, "replies": []}, {"body": "my wife's tits are a DD so I'm all in.", "score": 1, "replies": []}, {"body": "This is the type of DD that makes me go from 🕡 to 🕛. I actually only go to about 11:55, but the emoji clock doesn’t work that way...🍆🚀", "score": 1, "replies": []}, {"body": "Unassailable DD", "score": 1, "replies": []}, {"body": "WHoa WHoa whoa, the seeing stones are not all accounted for,   \nyou dont know who else might be watching", "score": 1, "replies": []}, {"body": "Best DD ever. Made my day 🤣", "score": 1, "replies": []}, {"body": "For as bad as this sub has gotten w/the influx of normies shit like this keeps me coming back.  Thank you", "score": 1, "replies": []}, {"body": "this is enough reason for me to buy", "score": 1, "replies": []}, {"body": "I need more govt spying on citizens in my life.", "score": 1, "replies": []}, {"body": "Solid dd thanks", "score": 1, "replies": []}, {"body": "I like the way you think", "score": 1, "replies": []}, {"body": "I like the rocks!", "score": 1, "replies": []}, {"body": "solid logic.. long and now going back in for more. 🚀🌝", "score": 1, "replies": []}, {"body": "This is the stupidest thing I've ever seen here. I'm in.", "score": 1, "replies": []}, {"body": "They're taking the meme stocks to the stratosphere", "score": 1, "replies": []}, {"body": "Great DD, just bought 500 more shares accordingly.", "score": 1, "replies": []}, {"body": "Lightning bolt! Lightning bolt! Lightning bolt!", "score": 1, "replies": []}, {"body": "Funny thing is I just saw something about Palantir dipping today.", "score": 1, "replies": []}, {"body": "No rockets emojis? Can we really trust this? lol", "score": 1, "replies": [{"body": "Why rockets when we have eagles?\n🦅🦅🦅🦅🦅🦅🦅", "score": 1, "replies": []}]}, {"body": "I picked up some pltr a while back solely because of lotr. I still have no idea what the company does. Do they specialize in technology to spy on sneaky little hobbitses? Also, what's the ticker for PO-TA-TOES?", "score": 1, "replies": []}, {"body": "Im legit buying 20 more shares at the dip now you genius mongoloid dd sensei", "score": 1, "replies": []}, {"body": "This is gonna work because it's so dumb and that's both stupid and awesome", "score": 1, "replies": []}, {"body": "This is the way 🦾", "score": 1, "replies": []}, {"body": "I hope so I bought some pltr when it was da meme stock right before GME happened and it's been kinda sad just watching pltr since...", "score": 1, "replies": []}, {"body": "Hope they moon, im down -$2500", "score": 1, "replies": []}, {"body": "I need to ask my moms boyfriend for anime tiddies figurine money so I can buy into this stonk. He never asks to see what I buy just knows it keeps me away from him for a couple days.", "score": 1, "replies": []}, {"body": "![img](emote|wsb_emojis|bull)", "score": 1, "replies": []}, {"body": "Finally some quality DD!\nGme is over. Tired of seeing the same bullshit", "score": 1, "replies": []}, {"body": "Did you just convince me to buy the dip?", "score": 1, "replies": []}, {"body": "thread is filled with hating gay bears but this shit actually blew my mind", "score": 1, "replies": []}, {"body": "See? This is why I don't worry about Melvin data mining WSB.", "score": 1, "replies": []}, {"body": "But it’s already a meme stock.  This sub is filled with bag holders.", "score": 1, "replies": []}, {"body": "I wonder what the hedgie data science shitters are gonna do with this post", "score": 1, "replies": []}, {"body": "I remember when Citron shorted PLTR AND I LOST $50,000 AND I HAD TO GET A JOB AT MCDONALD'S. I AM WORRIED THESE FUCKERS ARE ON HERE LOOKING FOR THE NEXT STOCK THEY CAN SHORT.", "score": 1, "replies": []}, {"body": "If I write Palantir into the books I am writing will you all buy the book?", "score": 1, "replies": []}, {"body": "H", "score": 1, "replies": []}, {"body": "Oh you said YOLO it all on PLTR? Say less, going to take out a second mortgage on my grandmothers house and go balls deep in.", "score": 1, "replies": []}, {"body": "Just to make sure, palantir tech?", "score": 1, "replies": []}, {"body": "I bought EBON because it’s a lot cheaper right now", "score": 1, "replies": []}, {"body": "Galadriel bless r/wallstreetbets", "score": 1, "replies": []}, {"body": "This is a mega opportunity people.", "score": 1, "replies": []}, {"body": "I was ready to jump on and call Bullshit.... But damn! Loving it.", "score": 1, "replies": []}, {"body": "I'm in", "score": 1, "replies": []}, {"body": "Fool of a Took!", "score": 1, "replies": []}, {"body": "MEME ECONOMY.\n\nposition in PLTR: more than you.", "score": 1, "replies": []}, {"body": "You got me at wizard", "score": 1, "replies": []}, {"body": "Wait, wasn't PLTR always a meme stock? It had to be.... its, its, already in my portfolio!", "score": 1, "replies": []}, {"body": "Absolutely bulletproof.", "score": 1, "replies": []}, {"body": "absolutely everything I say is true", "score": 1, "replies": []}, {"body": "Psychic. Can confirm", "score": 1, "replies": []}, {"body": "Is this a new kind of DD? \n\n&#x200B;\n\nThis is like the girl who won the football office pool by picking the quarterbacks with the best asses.", "score": 1, "replies": []}, {"body": "But LEAPs are cheaper...", "score": 1, "replies": []}, {"body": "Just think, your contribution could be paying for Peter Thiel’s next blood boy! Or helping ICE deport your neighbors! Or assist the CIA in doing **REDACTED CLASSIFIED**. Buy today folks!", "score": 1, "replies": []}, {"body": "This is the worst thing I've ever read. I'm all in.", "score": 1, "replies": []}, {"body": "Son of a bitch! Im in", "score": 1, "replies": []}, {"body": "This guy is playing 4d chess", "score": 1, "replies": []}, {"body": "that's about as much dd as saying \"yall should buy comstock, it has stock in the name so it'll go up!\"  \n\n\nbuy", "score": 1, "replies": []}, {"body": "You spelt Elondil wrong", "score": 1, "replies": []}, {"body": "Solid DD. I bought 96 shares!", "score": 1, "replies": []}, {"body": "You son of a bitch. I'm in.", "score": 1, "replies": []}]}
{"title": "CNBC's play by play of WSB comments is so meta", "selftext": "", "id": "lmtfck", "created_utc": 1613672688.0, "score": 11053, "upvote_ratio": 0.99, "num_comments": 218, "comments": [{"body": "Haha wtf I finally have made it.", "score": 8692, "replies": [{"body": "\"...and that grandkids, this is how your pawpaw peaked before the Great Wars of 2022.\"", "score": 1979, "replies": [{"body": "the\n\nWHAT", "score": 811, "replies": [{"body": "It's ok.  He said great wars.  Great means very good.", "score": 197, "replies": [{"body": "He also said \"Wars\", means multiple opportunities!\n\nTendies, Moons, Glory!", "score": 112, "replies": [{"body": "\"Moons\"  calls on jupiter", "score": 16, "replies": [{"body": "Puts on Uranus", "score": 19, "replies": [{"body": "Due to my \"personal risk tolerance\" currently being \"quixotic crusade against HFs\" im selling those sooo........ dont threaten me with a good time", "score": 16, "replies": []}]}]}, {"body": ">Moons\n\nThere is now a Space Force, so, this is a major probability.", "score": 10, "replies": []}, {"body": "Buy defense stonks, got it!", "score": 5, "replies": []}, {"body": "\"Wars\" \n Wsb Assumes Reddit Superiority", "score": 2, "replies": []}, {"body": "Lockheed leaps, got it.", "score": 2, "replies": []}]}, {"body": "And wars means more than 1 war. 🙆‍♂️", "score": 19, "replies": []}, {"body": "Bigly", "score": 4, "replies": []}, {"body": "Raytheon calls here we go.", "score": 1, "replies": []}]}, {"body": "“Buckle up trader, we’ve got a financial system up burn!”", "score": 405, "replies": [{"body": "Ok, so buying puts, got it. Thanks.", "score": 96, "replies": [{"body": "Gonna be a melt-up, due to all the hyper inflation and what not.", "score": 19, "replies": [{"body": "Fuck it just close your eyes and click around on the options matrix", "score": 26, "replies": [{"body": "Throw darts for every decision: *hits 18* $18Strike! *Hits 14* 14Days out to expiration! *hits 5* 5Contracts!", "score": 12, "replies": []}]}]}, {"body": "*Raytheon bulls have entered the chat*", "score": 1, "replies": []}]}]}, {"body": "The great wars of 2022. Do they not teach future class in high school anymore?", "score": 19, "replies": [{"body": "My future history book says the second Trump presidency of 2024 lasted 3 and a half years before he launched nukes to start \"The Greatest War Ever, So Great, The Greatest\" in 2027", "score": 28, "replies": [{"body": "Luckily most of humanity had already boarded the ‘Musk-Moon-Mobile’... he had a bit of a re brand.", "score": 5, "replies": []}, {"body": "\"It's going to be tree mendus\" - Trump", "score": 6, "replies": []}, {"body": "https://en.wikipedia.org/wiki/Future_History_(Heinlein)", "score": 3, "replies": []}]}]}, {"body": "It’s a misnomer, really. The wars start in late 2021", "score": 12, "replies": [{"body": "Didn't they start in 2020? Early summer. When the great uprisings began. Fire and killing on the streets. Eventually by the time the beginning of 2021 came around they had attacked the capital building. Then the NSA and FBI started coming unraveled after being implicated on domestic terrorism charges then... Shit, next couple pages are ripped out but then next one is after the fighting has begun and California had turned into a battleground and... Well, I'm boring you, we all know how we got here.\nAll hail The Flag of Gamestopistan! Together comrades", "score": 5, "replies": [{"body": "Don't forget us, your allies to the North in EBGamesopia or EB-opia as the kids call it!", "score": 4, "replies": []}, {"body": "No, I don’t remember any of that. I think I would have heard about all of that.         \n       \nStop making stuff up", "score": 1, "replies": []}]}]}, {"body": "If I tell you what happens, it won’t happen.", "score": 6, "replies": [{"body": "Oh look... it's happening.", "score": 1, "replies": [{"body": "#**FUCK**", "score": 1, "replies": []}]}]}, {"body": "Quick, buy LMT calls!", "score": 2, "replies": [{"body": "You would have been correct...", "score": 1, "replies": []}]}, {"body": "5/7/22", "score": 1, "replies": []}, {"body": "Shhhhhh... Don’t worry about it. \n\n*You can’t escape it anyway.*", "score": 1, "replies": []}]}, {"body": "Don’t you put that evil on me Ricky Bobby", "score": 22, "replies": [{"body": "Too late...", "score": 2, "replies": [{"body": "This is fucked", "score": 1, "replies": []}]}]}, {"body": "RemindMe! 1 year \"Great Wars\"", "score": 7, "replies": [{"body": "I will be messaging you in 1 year on [**2022-02-19 01:43:27 UTC**](http://www.wolframalpha.com/input/?i=2022-02-19%2001:43:27%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/lmtfck/cnbcs_play_by_play_of_wsb_comments_is_so_meta/gnyi8pk/?context=3)\n\n[**4 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Flmtfck%2Fcnbcs_play_by_play_of_wsb_comments_is_so_meta%2Fgnyi8pk%2F%5D%0A%0ARemindMe%21%202022-02-19%2001%3A43%3A27%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20lmtfck)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 4, "replies": [{"body": "I'M RECLAIMING MY TIME!!!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}]}, {"body": "God damn it.", "score": 2, "replies": [{"body": "I know!", "score": 1, "replies": []}]}]}, {"body": "are you.... a time traveler... GET THIS MAN", "score": 4, "replies": [{"body": "apparently...", "score": 2, "replies": [{"body": "But for real... are you?  \nhow is the nuclear winter of 2023?", "score": 1, "replies": [{"body": "I don’t see anything in that timeline", "score": 2, "replies": []}]}]}]}, {"body": "If they ever re-make Demolition Man they should reference the great Reddit Rebellion along with Taco Bell winning the franchise wars.", "score": 3, "replies": []}, {"body": "amazing.", "score": 1, "replies": []}, {"body": "!remindme 1 year", "score": 1, "replies": []}, {"body": "Holy shit this aged so well. The bot reminded me and here we are one year later at the beginning of WW3 with Russia invading Ukraine.", "score": 1, "replies": [{"body": ":(", "score": 2, "replies": []}]}, {"body": "Holy shit this aged so well. The bot reminded me and here we are one year later at the beginning of WW3 with Russia invading Ukraine.", "score": 1, "replies": [{"body": ":(", "score": 2, "replies": []}]}]}, {"body": "Why couldn't you be POTATO_IN_MY_ASS", "score": 222, "replies": [{"body": "Or PM_ME_HORSE_COCKS", "score": 102, "replies": [{"body": "I like your name", "score": 19, "replies": []}]}, {"body": "Or MotorizedDoucheCanoe", "score": 13, "replies": []}, {"body": "or DeepFuckingValue", "score": 4, "replies": [{"body": "As for me, I like the stock.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 16, "replies": [{"body": "positions or ban", "score": 12, "replies": [{"body": "^ i second this", "score": 1, "replies": []}]}]}]}]}, {"body": "Careful or you’ll be at the next hearing.", "score": 46, "replies": []}, {"body": "Time to put CNBC Financial Commentator on your Resume!", "score": 26, "replies": []}, {"body": "Imagine thinking in your life you'd make a Congressional hearing.", "score": 26, "replies": []}, {"body": "Add this to your resume. You've had an editorial on CNBC", "score": 20, "replies": []}, {"body": "So happy for you Stevie Rave-Party on!\n\nEdit:  Don’t you have to take a never ending beer funnel?!?!", "score": 19, "replies": []}, {"body": "Call your mom Stevie", "score": 8, "replies": []}, {"body": "Atta pepper", "score": 8, "replies": []}, {"body": "Congratulations legend! lol", "score": 6, "replies": []}, {"body": "Goat", "score": 5, "replies": []}, {"body": "Look at our retarded boy shine!", "score": 5, "replies": []}, {"body": "What will you do with all this newfound power?", "score": 5, "replies": []}, {"body": "mod this man right now", "score": 5, "replies": []}, {"body": "My favorite guitar player, fuck helicopters.\n\n💎✋", "score": 6, "replies": []}, {"body": "Sir, I said YES or NO", "score": 4, "replies": []}, {"body": "Nice call on these Filibusters!", "score": 3, "replies": []}, {"body": "Bro this is epic and you deserve it", "score": 3, "replies": []}, {"body": "That fucking flair lmao", "score": 3, "replies": []}, {"body": "That was exactly the feeling I had every time these asshats answered.....also, \"let me burn some of your time with BS so I won't have to answer as many difficult questions! \"", "score": 3, "replies": []}, {"body": "your famous now", "score": 5, "replies": [{"body": "His famous? My famous.", "score": 8, "replies": [{"body": "Best comment of the hour   \n... of the our", "score": 3, "replies": []}]}]}, {"body": "Except you can’t tell people in real life unless you want to dox yourself!", "score": 2, "replies": []}, {"body": "LMAOO LESGOO", "score": 2, "replies": []}, {"body": "Congrats!!!!", "score": 2, "replies": []}, {"body": "Keep up with your amazing guitar work too! I'm a big fan.", "score": 2, "replies": []}, {"body": "LOL Side character Stevie\\_Rave\\_On", "score": 2, "replies": []}, {"body": "beauty", "score": 3, "replies": []}, {"body": "lol congrats man", "score": 1, "replies": []}, {"body": "dam u famous", "score": 1, "replies": []}, {"body": "so what's the next short squeeze candidate?   no pressure", "score": 1, "replies": []}, {"body": "LEGEND", "score": 1, "replies": []}, {"body": "You’ve made history my friend", "score": 1, "replies": []}, {"body": "Congratulations 👏", "score": 1, "replies": []}, {"body": " Nicely done sir.", "score": 1, "replies": []}, {"body": "Nice", "score": 1, "replies": []}, {"body": "I came here to comment that at the time of this posting, precisely 69 awards were given.\n\nNice.", "score": 1, "replies": []}, {"body": "69 awards nice", "score": 1, "replies": []}, {"body": "69 awards.  Nice.", "score": 1, "replies": []}, {"body": "Overnight celebrity", "score": 1, "replies": []}, {"body": "Rave on Steve, Rave on!!", "score": 1, "replies": []}]}, {"body": "/u/stevie_rave_on being cited on CNBC.\n\nNow we need someone to comment about CNBC to get put on CNBC", "score": 932, "replies": [{"body": "metaception", "score": 107, "replies": []}, {"body": "Just say something about boner pills, prune juice, and low yield bonds and they’ll jump on that shit like a boomer pretending they can still play pickup basketball before they break their hip and have to go to the emergency room.", "score": 37, "replies": []}, {"body": "I think CNBC could be doing a better job at covering this whole debacle.", "score": 6, "replies": []}]}, {"body": "I appreciate the opportunity to waste CNBCs time by stating that I love sucking huge, sweaty, flappy testicles.", "score": 721, "replies": [{"body": "I want too see your comment get posted next", "score": 175, "replies": [{"body": "If for no other reason than his username", "score": 20, "replies": []}]}, {"body": "Well thank you for the opportunity to be here, and I am glad you asked me that question. You see....Chewbacca is a Wookiee from the planet Kashyyyk. But Chewbacca lives on the planet Endor...", "score": 41, "replies": [{"body": "I haven't thought about that episode since I was my early teens, when I thought it was just a funny funny Star Wars thing. Holy shit, the Chewbacca Defense is a real courtroom strategy.", "score": 8, "replies": []}, {"body": "Wait a second... That does not make sense!", "score": 2, "replies": []}]}, {"body": "Is your name Jerry Smith?", "score": 2, "replies": []}, {"body": "I would die a happy man to hear anyone read your username on national television.", "score": 1, "replies": []}]}, {"body": "I'm reclaiming my time...\n\nReddit / DFV - speaking truth\n\nEveryone else - dancing to avoid regulation", "score": 172, "replies": []}, {"body": "ur famous u/Stevie_Rave_On  \n\n\n[Comment](https://www.reddit.com/r/wallstreetbets/comments/lm7n51/congressional_hearings_dfv_gme_etc_megathread/gnwruxi?utm_source=share&utm_medium=web2x&context=3)", "score": 116, "replies": []}, {"body": "Haha I took that same picture of my tv bc I feel like how can they allow this amount of Filibustering!!! Vlad just kills the clock by repeating himself and acting like it’s free advertisement! He thinks if he says the same thing enough and says “my written testimony” and “I appreciate your question”! At this moment he still refuses to admit liquidity issues!!!", "score": 76, "replies": [{"body": "Well any attorney who has passed any state's bar exam would advise their clients to say as little as possible since while this isn't a court, things said on record will be used against them in actual litigation.  \n\nThe best course of action is to minimize PR damage.", "score": 47, "replies": [{"body": "Agreed, he should have kept his mouth shut back in January...he thought he could do his own PR work by trying to spin the decision to halt trading. He attempted to hide behind the pretense of looking out for Roobinhood investors, when it truly was a liquidity issue which he vehemently denied! So yeah now that he doubled down he has backed himself into a corner.\n\nHonestly, I think everyone sees through it so I don’t think there is too much he can do to win back trust.", "score": 24, "replies": [{"body": "“It was not a liquidity issue”\n\n“Ok, well what happened then?”\n\n“Well see, there are deposit requirements, and we didn’t have enough money to-“\n\n“Bitch if you ain’t have enough money, THAT’S A LIQUIDITY ISSUE.”\n\n“Well but we raised capital so we are good now”\n\nGet fucked Vlad.", "score": 34, "replies": []}]}, {"body": "Right.  That’s the issue here.  He’s giving cagey practiced responses.  And the people asking them either don’t know enough about the issue, or just don’t fucking care to ask real questions. \n\nWSB has anime memes that denote more understanding than these hearings", "score": 6, "replies": []}]}]}, {"body": "I gotta say, I was amazed I was quoted, too:\n\n[https://twitter.com/markskull/status/1362502545789374464](https://twitter.com/markskull/status/1362502545789374464)", "score": 54, "replies": [{"body": "I love it!  Very quotable comment!", "score": 12, "replies": []}, {"body": "Someone get this man a flair!", "score": 5, "replies": [{"body": "Gave my daily freebie", "score": 1, "replies": []}]}, {"body": "We're not?", "score": 2, "replies": [{"body": "I like to think us apes are at least smart enough to realize that when we invest money we know there's a chance that stonks don't always go up, they also go down. Plus, you know, loss porn.", "score": 1, "replies": [{"body": "Meh just a great chance to buy the dip", "score": 2, "replies": []}]}]}]}, {"body": "\"SO what I am saying is can you make cornbread from call options? Can I get a real answer?\"", "score": 34, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "then buy the dip sauce?", "score": 9, "replies": []}]}, {"body": "That is a great question! \n\nLet me reiterate multiple times how great that question is. Let me thank you for the greatness of your question.", "score": 1, "replies": [{"body": "Thanks, but my 5 minutes are up......", "score": 2, "replies": []}]}]}, {"body": "Until Congress starts to regulate stock advice on golf courses, they can mind there biz.  Dont need help from out of touch Congress members who can’t even turn on a pc without help.  That’s why we need term limits.", "score": 36, "replies": [{"body": "If people publicly discussing stocks in large numbers is manipulation, then one asshole on an investing show broadcast to millions is also manipulation. Y'all will even disclose your positions though, the weather talking heads on TV don't.", "score": 11, "replies": []}, {"body": "Thats actually the opposite of why we need term limits. Term limits keep politicians new and stupid and reliant on lobbyists for their info.\n\nIf you dont like a politician vote them out.", "score": -3, "replies": [{"body": "Did you not watch the hearing.  These guys sitting in Congress in there deathbed can’t argue a coherent thought.   Like seriously, retire already....Unfortunately, most voters are older generation that vote in the the non presidential races and inclined to vote for the household names they are accustomed to.  To each is own, that’s why nothing gets done in our political structure.  Electoral college and these term limits worked in the 1800’s because the life expectancy was much much lower, we are now at a time where folks live longer and our policies are out of touch and politicians abused the rules to rig the system.  Whatever, just hand me my 🍌", "score": 6, "replies": [{"body": "I just dont think term limits solve this at all. It just makes it so all the politicians swap every few years without getting anything done. How are you so sure term limits mean a younger congress person will be the next to be elected instead of yet another old crony of the previous candidate?", "score": -1, "replies": []}]}]}]}, {"body": "Does anyone have more shots?", "score": 13, "replies": [{"body": "[I like this one also](https://i.imgur.com/akaOWRj.jpg)", "score": 36, "replies": [{"body": "[deleted]", "score": 29, "replies": [{"body": "yup, transaction tax only racks up when you're doing a lot of transactions, which most of retail is NOT doing.", "score": 15, "replies": [{"body": "Still destroys the liquidity and would just lead to us paying most of it through really shitty fills through a really wide bid/ask spread most of the time.", "score": 3, "replies": [{"body": "If the liquidity comes from synthetic longs and naked shorts, the liquidity shouldn't exist in the first place.", "score": 9, "replies": [{"body": "Algos flipping pennies give us a fuck ton of extra liquidity that would vanish for one (at least with these bid ask spreads)", "score": 0, "replies": []}]}]}]}, {"body": "FTT is basically just going to kill day traders and force everyone to go into more of a buy and hold approach. 0.1% per trade means that you've already lost 0.2% entering a day trade.\n\nIt may raise tax revenue, but it actually discourages active trading. Want to buy $10k for apple stock for the event next week? subtract $20.\n\nGuess what actively traded ETFs also get hit. Bear market? don't matter, also paying a tax just to trade. So your pensions, 401ks, your buy and hold ARK ETFs, you get lower returns. \n\nThis is the other side of this tax.", "score": 9, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "(link to the article outlining the proposals)[https://theappeal.org/the-lab/policy/the-case-for-the-financial-transaction-tax-in-2021/]\n\n0.1% was the lowest. Bernie was pushing to go all the way up to 0.5%.\n\napple doesn't even move $5 on most days, talk less of $20 per share. it trades at 130, are you really telling me that you often see daily swings of it dipping to 110 or 150?\n\nyou say it is a trivial sum once. trade 10k/week for the year. you have suddenly incurred a $1k tax just to trade. or 10%.\n\nIf they want to discourage active trading and make it more a buy and hold world. By all means do that, and call it that. Don't act like a whole sect of traders who aren't millionaires wouldn't be quite materially affected by it. when compounded\n\nAnd you still didn't affect the fact that active traded ETFs will still suffer. which are the things that you pensions and 401ks are in. lets say the only thing that does is cause a 1% fee per year. let's say you would be getting 15% annual returns, and so now, you only get 14%. 14% compounded over 40 years is 188x. 15% compounded over 40 years is 267x\n\nSimple example, you reorganize your portfolio 5x a year. You have incurred 1% in tax. that is not a trivial sum.", "score": 0, "replies": [{"body": "I'M RECLAIMING MY TIME!!!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}]}]}]}]}, {"body": "lmao I can't believe they did this; having some editor sitting on this sub updating their splashscreen live with random comments is on a new level for boomer TV", "score": 3, "replies": []}]}]}, {"body": "This is the Senator that stood out to me. Probably the least prepared and have no idea what's going on. He was asking irrelevant questions without context.", "score": 13, "replies": []}, {"body": "They are probable watching the pinned comments", "score": 10, "replies": []}, {"body": "Is this available to watch online for those of us at work all day?", "score": 7, "replies": [{"body": "Financial Services Committee has a yt channel. It'll likely be posted there", "score": 9, "replies": [{"body": "I found it, found the livestream on youtube from CNBC and you can scroll back. \n\nVlad is infuriating to watch, but its pretty interesting so far.", "score": 7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Here you go! If you can make it through 1 hour of Vlad you deserve a medal.\n\nhttps://www.youtube.com/watch?v=D7N4S_FKMq4&feature=emb_title", "score": 3, "replies": []}]}]}]}]}, {"body": "ORDER FLOW - pay to play\n\nChange the LAW.  \nI would rather pay for trades", "score": 36, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "Now days you gotta get like 6 different brokers, you never know when the order flow is going to intentionally get disrupted.", "score": 6, "replies": []}]}, {"body": "I would rather have a choice with clear difference shown and transparent fee structure", "score": 7, "replies": []}, {"body": "PFOF existed long before free trades.  The broker wouldn't get paid as much as RH does cause they required better fills for their clients.", "score": 2, "replies": []}, {"body": "Use a real broker like IBKR then, retard.\n\n/s", "score": 1, "replies": []}]}, {"body": "Any idea how to watch these clips back? Someone mentioned I had a comment make it so I’m trying to go back and find it", "score": 6, "replies": []}, {"body": "That was my favorite one!!", "score": 10, "replies": []}, {"body": "Maxine did not come to play.  Glad she's grilling them.", "score": 36, "replies": [{"body": "Maxine is an idiot and you should want her as far away from your politics as possible.", "score": -17, "replies": [{"body": "Ooh, criticizing a Democrat on Reddit. Very dangerous\n\n[Sources don't change people's minds, but hey, we can try.](https://www.businesswire.com/news/home/20110920005493/en/Rep.-Maxine-Waters-D-CA-Named-One-of-the-Most-Corrupt-Members-of-Congress)", "score": 14, "replies": []}, {"body": "I dont know about all that. She has managed to use her position to enrich herself and her family to incredible levels, and starting with almost nothing. Her corruption is epic and just the fact that it is such an open secret in DC and political circles shows she isn't a fool by any stretch. A corrupt scumbag who cynically uses her useful idiot supporters to enrich herself yes, stupid no.", "score": 15, "replies": [{"body": "You can be an idiot several different ways. You're right that she is a skilled manipulator and has survived politics. She's still an idiot 99% of the time. It's one of the reasons she sticks out like a soar thumb all ways putting her foot in her mouth. She's a lot closer to Trump's style of politics than dems will admit. Say a bunch of crazy outlandish shit for attention and call the other side names.", "score": 2, "replies": []}, {"body": "2 comments in a row you’ve made that claim with no source.", "score": -1, "replies": [{"body": "Fine. I usually prefer not to spoon feed people because I believe they learn more (and more importantly are more open to the truth) when they learn it for themselves. And it was several years ago when I did my deep dive on R and D corruption in congress, which was a depressing dive, but a quick google search brought up this businesswire article, along with many other results if you're interested.\n\nhttps://www.businesswire.com/news/home/20110920005493/en/Rep.-Maxine-Waters-D-CA-Named-One-of-the-Most-Corrupt-Members-of-Congress", "score": 9, "replies": [{"body": "Guy doesn’t want to realize that someone who has spent their entire career in the public sector, maintaining two residences in HCOL areas, and is now a multi-millionaire is corrupt.", "score": 6, "replies": []}, {"body": "10 year old article that includes a single case of fraud.", "score": -2, "replies": [{"body": "Uh thats enough. Far more than you usually get", "score": 6, "replies": [{"body": "Enough to call them the most corrupt person in congress? Bullshit.", "score": 5, "replies": []}]}]}]}]}]}, {"body": "Shoulda led with the article below. Just the link and let people figure it out", "score": 1, "replies": []}]}]}, {"body": "Sit on my face you famous fuck!", "score": 4, "replies": []}, {"body": "Dear CNBC, the truth actually lives on reddit. And a lot of redditors can see through the bullshit, tread cautiously.", "score": 5, "replies": []}, {"body": "Rep Tom Emmer... congressman... you are awesome! That is all.", "score": 4, "replies": []}, {"body": "Some of our comments are great. Would have loved to watch the intern go through all the thread to pull these", "score": 3, "replies": []}, {"body": "I LOVE REDDIT", "score": 3, "replies": []}, {"body": "Mf had nothing prepared.\n\nShould have at least had the courtesy to pass.", "score": 3, "replies": []}, {"body": "LEAN HOGS!!!!!! goodtimes", "score": 2, "replies": []}, {"body": "100% some CNBC intern saw the username and immediately pushed up to be quoted. Who doesn’t love a good Stevie Ray pun?", "score": 2, "replies": []}, {"body": "Are they doing like a live stream of comments?", "score": 2, "replies": []}, {"body": "Is there a video or collection of all the comments they showed? People could have found fame on the small screen with their retarded poetry and not know it.", "score": 2, "replies": []}, {"body": "Has anyone got a list of all the comments CNBC quoted? I was watching it on the official stream", "score": 2, "replies": []}, {"body": "Can their coverage be streamed?", "score": 3, "replies": [{"body": "I think it's on YT live", "score": 5, "replies": [{"body": "Got it thanks", "score": 3, "replies": []}]}]}, {"body": "Funny enough, I know this congressman, he is a family friend.", "score": 2, "replies": [{"body": "Gregory Meeks is your friend ?", "score": 1, "replies": [{"body": "Yeah I had the chance to interview him years ago for a school project.", "score": 1, "replies": []}]}]}, {"body": "The fed and US government need to take a self assessment, not retail people. A bank run to drain them of leveraged liquidity is the only answer to tip the apple cart and start the game over--u won'tbeat HFTs over time. An elder of mine who lived through and did it in the 1920's said it would be required to do so eventually again. The time is now my friends, and u have to spread the word, or nobody understands. Look around...the cost of capital is not 0...and yeah, I bought more GME today too...💎🙌", "score": 0, "replies": []}, {"body": "Lmao I’m switching to watching this on CNBC", "score": 1, "replies": []}, {"body": "please tell me there's a link", "score": 1, "replies": []}, {"body": "RemindMe 1 year great wars", "score": 1, "replies": []}, {"body": "we do not seek money or power", "score": 1, "replies": []}, {"body": "The news media is straight up garbage", "score": 1, "replies": []}, {"body": "I have no issue with people trying to form an answer. I have an issue wasting time because you know they only have 5 minutes", "score": 1, "replies": [{"body": "To you it's wasting time.  To them it's running down the clock.", "score": 1, "replies": [{"body": "That's what I was implying", "score": 1, "replies": []}]}]}]}
{"title": "Did Melvin's CEO just admit to insider trading?", "selftext": "Is it considered insider trading? There's no way he could have been lucky enough to have exited his short positions the day before the spike. \n\nIf he indeed exited his positions the day before, someone high up informed him this shit was coming and caused him to leave before the spike. \n\nJust a thought.. I know it probably isn't technically considered insider trading, but there has to be some sort of law against that sort of inside information, right?\n\nEdit: he said days before the spike, not day. My bad. My point still stands valid, though.\nI'm talking about what he said on stream earlier, not any speculation or other bullshit. He literally said under oath that he exited his short positions just days before the spike. \n\nEdit: Buy $GME! I'm too broke and retarded to be sued, so IDGAF about telling people I'm not a financial advisor. Buy $GME because it's a great stock, not because I told you to buy $GME. Stonks only go up.\n\nLast edit: forgot positions pls no ban. I'm not holding any options because I'm too poor but I hold 40 GME @ $36 and 1 tesla @ $834.\n\nFinal final edit: I'm aware this isn't actually insider trading by definition. However if he actually had someone from one of the clearinghouses giving him information that isn't privy to the public, that's shady as fuck and should be considered insider trading. This is speculation of course but it's suspicious as fuck for him to claim he closed his positions only days prior to the massive spike past $100.\n\nNo this is not the same as some average Joe pulling out right before the spike. He has infinitely more power over things than retail investors do, and that's what makes it suspicious as fuck.\n\nAlso here's some 🚀🚀🚀🚀🚀 for the retards with no attention span", "id": "lmv9z7", "created_utc": 1613677296.0, "score": 1414, "upvote_ratio": 0.93, "num_comments": 163, "comments": [{"body": "They will say they were lucky and any timing of the move is pure coincidence. Without an audit and someone blowing the whistle it will never stick unfortunately...", "score": 465, "replies": [{"body": "Yeah and all the lost tendies will be in vain, only used for our masturbatory pleasure. Don't get me wrong, I love a good loss porn fap, but it feels a bit wrong knowing those tendies were lost because the other guys cheated.", "score": 128, "replies": [{"body": "That's why the universe invented karma.\n\nHang tight friends, always.", "score": 57, "replies": [{"body": "Karma doesn't exist, if it did there would be some VERY bad accidents happening to a LOT of very shitty fucking people after what they did in '08.", "score": 66, "replies": [{"body": "Its almost like anti-karma exists.  Maybe we are actually anti-matter living in the anti-universe and theres a good universe somewhere where people actually get comeuppance.", "score": 15, "replies": []}, {"body": "Who said karma was immediate, or even in our lifetimes?\n\nI believe in balance, and consequence.\n\nThat's why evil people are obcessed with living forever.\n\nThey are afraid to die.", "score": 17, "replies": [{"body": "Because not only were the NOT punished, they were REWARDED for it. \n\nKarma is a lie.", "score": 9, "replies": [{"body": "People believing in karma usually believes in reincarnation as well. Who knows. They could be reincarnated as a hog being eaten alive, slowly, by a lion.", "score": 4, "replies": []}, {"body": "Not punished, yet.\n\nKarma is real.", "score": 3, "replies": [{"body": "I'll believe it when i see it.", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Hey, it sounds like you're struggling. Reddit has some great resources for any problem, but unless that problem is having too much money, WSB is not the right sub for you right now. Take a break for a bit. We'll be here when you're ready.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Hang in there.", "score": 5, "replies": [{"body": "I am not a cat.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}]}]}, {"body": "How is it insider trading when retail traders say “I’m buying, a short squeeze may be coming” and the hedge fund steps out of the way and lets it hit other hedge funds??  It’s like the opposite of insider trading when your opponent is publishing their plan transparently online days ahead of time.  It’s like seeing a wave in the ocean and getting off the beach.", "score": 9, "replies": [{"body": "\"Short squeeze may be coming\" said half of the retards on this sub a week after the squeeze happened.\n\nIt's more like saying \"man these waves are getting big there's probably a tsunami about to come, but instead it was a fucking level 5 hurricane that came instead.\"", "score": -2, "replies": []}]}]}, {"body": "Worked for David Perdue and Kelly Loeffler...", "score": 45, "replies": []}, {"body": "Apparently, against all odds, miracles happen regularly for the hedgies when the cards are stacked against them. Cant have shit in this world lmao", "score": 7, "replies": []}, {"body": "Such coincidence, much wow", "score": 2, "replies": []}, {"body": "How can anyone tell them that there was going to be a spike tomorrow? This is ridiculous.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 221, "replies": [{"body": "[deleted]", "score": 179, "replies": [{"body": "[deleted]", "score": 102, "replies": [{"body": "Well damn, now I want to be a HF manager", "score": 14, "replies": []}, {"body": "This is more like it.", "score": 4, "replies": []}]}, {"body": "probably meant retirement in Florida after an acquittal", "score": 1, "replies": []}, {"body": "Oh, you made 20M by insider trading and screwing people?  Pay a 2M fine and you can keep the rest.", "score": 1, "replies": [{"body": "A 10% fine, surely you jest", "score": 1, "replies": []}]}]}, {"body": "Jail? We're you not around in 2008?\n\nBesides reckless gambling, there was literal fraud and no one went to jail", "score": 38, "replies": [{"body": "1 mid level manager from swisse bank did but that was clearly the sacrificial lamb. They are still doing NINJA loans and credit default swaps today.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Because the cult is on copium.", "score": 4, "replies": []}]}, {"body": "Jail? Are stupid or dumb. \n\nThese dogs don't do jail time.", "score": 4, "replies": []}, {"body": "I highly doubt their broker would allow them to naked short.", "score": 2, "replies": []}, {"body": "Yeah. I absolutely don’t believe they gave exited all their short positions, either.", "score": 1, "replies": []}, {"body": "People that wealthy don't go to prison.", "score": 1, "replies": []}]}, {"body": "I think the missing TV from the wall in the background, dented/scuffed desktop behind him, single bent blind, and only a printer in his camera frame tell more of his last few weeks then anything he’s said so far. I can just imagine selling off any items possible to recoup losses, and constantly looking through closed blinds for debt collectors pulling into the parking lot. The guy looks like he’s been through the ringer.", "score": 40, "replies": [{"body": "Just like a guy in court who is guilty and trying to get sympathy from the jurors.", "score": 9, "replies": []}]}, {"body": "or he was sitting in a margin call and already fuckeroo'd but when they closed it fucked even more shorts which started the cascade of the card fall of shorts to \\~500 til brokers coordinated to pulled the corruption lever in unison.", "score": 55, "replies": [{"body": "I doubt it. These guys didn't make money by getting fucked. The make money by being the ones doing the fucking. They most definitely have someone in one of the clearinghouses letting them know what's going on so they can get in and out of trades without getting fucked as badly as those without that information.\n\nNot really a conspiracy at this point that they're being fed privileged information that we don't have access to.", "score": 22, "replies": [{"body": "you sir do not seem to fully understand what a short squeeze is and what causes it...\n\nCitadel sells pfof (payment for order flow) info to hedge firms which then take short positions against the retail sector, so in reality they end up being short on a shit ton of meme stocks / small stocks, including that of the likes of GME.\n\nIt would not be surprising if Melvin was indeed one of the hedge funds that took pfof info from Citadel and in turn had a large short against GME due to this fact alone.\n\nThey claim they have been short on GME since 2014 bro, Robinhood app started around 2013.\n\nI've seen posts of grandma, dad, and kids cashing out millions on GME.  Do you think citadel which had access to 40%+ of the retail sector didn't pass on that info to the likes of Melvin so they could short the retail sector or not?  c'mon, use your brain...\n\nIt's obvious what happened here, the large hedge funds were short fucking GME beyond what was normal or realistic and when everyone woke up to the 150% open short interest, new management, 2 new game consoles, record game sales due to the pandemic large firms bought in to GME as well.  Once there was enough rise in price there was clearly hedge fund blood in the water, and several other big firms went in for the kill (estimates said 11-20 large firms bought millions of shares as late as dec/jan; including the likes of BlackRock, the largest asset management operator in the US if not the world.)\n\nReddit was like the shark researcher in JAWS calling out that there was a major bloodbath in the water but actual Redditors will get little to no success from the ordeal, but in the end we will take the largest blame and attention for the shark killing the bleeding hedge funds.", "score": 20, "replies": [{"body": "I'M RECLAIMING MY TIME!!!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 16, "replies": [{"body": "Good bot", "score": 3, "replies": []}]}, {"body": "Melvin and citadel aren't connected idiot.", "score": -12, "replies": [{"body": "I literally didn't say they were.  I said, it's entirely possible Melvin was acting on citadels PFOF info they were selling.  Just like how RH gets paid, Melvin too could have paid for PFOF info Citadel held from RH purchasers or other brokers that held large retail trading account volumes.  And then acted on that same fucking info.  I'm not saying they were buddy buddy but they likely could all have had eyes on some or even the same retail data/order flow data on some tickers and it's possible GME was one of them.", "score": 2, "replies": [{"body": "Citadel and melvin aren't connected either idiot. Melvin received 2 billion from citadel and other investors.", "score": -8, "replies": [{"body": "Melvin worked at citadel for a year before starting his own hedge fund, Citadels portfolio manager previously worked at melvin capitol and is now at Citadel", "score": 3, "replies": [{"body": "Did the 2 firms do any sort of business before gme blew up?", "score": -1, "replies": []}]}, {"body": "[https://finance.yahoo.com/news/citadel-point72-back-melvin-2-203509666.html](https://finance.yahoo.com/news/citadel-point72-back-melvin-2-203509666.html)  Means they are connected in some way shape or form.  \n\nAnd you literally just said it, Melvin was given access to cash via Citadel, does that ever ethically look good in a situation like this?  When citadel is openly known to have direct access to RH (pfof) data while bailing out the hedge fund which is losing against the people they literally had the RH data on?  \n\nIt was reported/estimated and posted to reddit that over 50% of RH users owned 1 share of GME...  ([https://www.reddit.com/r/wallstreetbets/comments/l83osk/listen\\_up\\_retards\\_only\\_50\\_of\\_all\\_robinhood\\_users/](https://www.reddit.com/r/wallstreetbets/comments/l83osk/listen_up_retards_only_50_of_all_robinhood_users/))   meaning Citadel knew more clearly what that actual RH # of users and ownership was and their avg price/share because they had access to RH pfof (buy/sell order data on GME...)  And even still they then bailed out the guy opposite those same people they had all this retail data on.... ?\n\nDoes that not imply Citadel and Melvin, were in a way, acting based upon RH/retail information they had access to and were possibly sharing even if it was just GME alone?  \n\nAlso... are you seriously that dense to repeat yourself 2x now but not understand what you are repeating?", "score": 4, "replies": [{"body": "I'M RECLAIMING MY TIME!!!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Theyre connected after melvin sold off their shorts in exchange for shares in the company. Do you even read the articles you post? You're so dumb. It does not imply that at all. There is nothing to imply that.", "score": -3, "replies": []}]}]}]}]}]}, {"body": "You don’t know what you’re talking about", "score": 1, "replies": [{"body": "New phone, who dis?", "score": 1, "replies": []}]}]}]}, {"body": "If “sold right before the spike” was grounds to charge someone with insider trading 80% of this sub would be in prison", "score": 42, "replies": [{"body": "*buy high, sell right before it goes higher.*\n\nThis is the way.", "score": 7, "replies": []}, {"body": "80% of this sub sold out if fear, not potential insider information", "score": 1, "replies": [{"body": "I’m not referring exclusively to GME. Saying that “exiting a short position right before a spike means you have insider info” is anecdotal and dumb.", "score": 6, "replies": [{"body": "You're right. It doesn't necessarily mean he had insider information but with his position of power, you can't not look at the strong possibility of it being true. \n\nBut you're comparing average Joe retards to the CEO of a multi-billion dollar hedge fund. \n\nWhom is more likely to have access to that kind of information?", "score": -1, "replies": [{"body": "Do you know what insider trading is? What you're saying makes no sense. Insider trading would be if someone who worked at gamestop told him private information related to gamestops business that then was revealed causing the spike. That's not what happened. \"people might buy more\" is not insider info, especially considering that literally everyone knew that.", "score": 2, "replies": [{"body": "I'm aware that's the technical definition. I was implying he got info from one of the clearinghouses that caused him to make that decision. \n\nWhile it's not insider trading by definition, but it definitely should be considered as insider trading if that's what happened.\n\nDo you not agree?\n\nThe insider I'm referring to in this situation is someone from one of the clearinghouses, not an employee of GameStop.", "score": -1, "replies": [{"body": "What information lmao?? Clearing houses don't have a crystal ball that tells them people are going to buy more tomorrow. Besides, it was extremely obvious to everybody. Maybe Elon warned him before he tweeted! They're probably secretly gay lovers! The evidence is right in front of you sheeple!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Melvin intern huh? \n\nStart printing your resume bud :) \n\nYour job doesn't exist anymore. \n\nThey are to poor to pay you. \n\nThey cant even cover shorts. \n\nWhat are they gunna pay you with?", "score": -6, "replies": [{"body": "A. You’d have to be either 8 years old or actually mentally handicapped to not realize that this flair is satire.\n\nB. They manage $8BN I think they’re doing fine lmfao", "score": 7, "replies": [{"body": "Lol 8bn? \n\nAnd it took them 200 years? \n\nMust suck to loose it to a bunch of day traders on reddit.", "score": -5, "replies": [{"body": "Wtf are you talking about weirdo", "score": 6, "replies": []}, {"body": "Melvin Capital was founded in 2014.", "score": 6, "replies": [{"body": "Lmfao there gunna make it less than a decade  that sucks for them 😁😆😄😃😅🤣😂", "score": -2, "replies": []}]}]}, {"body": "There are probably not may 8 year olds here, I suppose that narrows it down some.", "score": 1, "replies": []}]}]}]}, {"body": "Maybe he’s a member of this group.  Not insider if the information is available to all.", "score": 9, "replies": [{"body": "Well why did they attack all the meme stocks if they exited? Why did they need a 2b loan from citadel, Seems like a defense mechanism for legit crimes. I mean its easy enough for the sec to find out the truth.", "score": 4, "replies": []}, {"body": "Nobody could have actually predicted the squeeze would happen how it did. Anyone saying otherwise is full of shit.\n\nThere were indicators, yes; but you can't predict something like this", "score": 2, "replies": []}]}, {"body": "It's their shorts... They know what their buy volume would do to the price... Which would likely trigger a buying frenzy.\n\n\n\nThey have PhD's analyzing this stuff, they have advanced software analytics... They likely played the spikes both days to their advantage.\n\n\n\nMy buddy works at hedge funds, he said there is no way they didn't see this coming, and no way they didn't figure out a way to play it to their advantage.", "score": 11, "replies": []}, {"body": "The stock had already been exploding for a few days before the trading restrictions. They had already eaten billions in losses. It’s not a conspiracy that they would have already closed their positions lol", "score": 4, "replies": []}, {"body": "Lets be sure to get waaaaaayyyy off the subject.", "score": 21, "replies": [{"body": "How is that off the subject? Him getting out of a trade ~~one day~~ days before it goes bad is exactly the reason we need more transparency about what trades these hedge funds are making.\n\nIt shows that they have infinitely more information than we do to be able to make a profit.\n\nIf I'm going to gamble I don't want to do it knowing that the odds are stacked against me even moreso than the risk I'm already taking by betting. \n\nIt's like betting on a football game but you already know the outcome and the other guy doesn't.", "score": 19, "replies": [{"body": "Sir this is a casino", "score": 13, "replies": [{"body": "No it's a Wendy's retard. I'm here for tendies, not an ass-fucking from the manager.", "score": 10, "replies": []}]}, {"body": "No no ...about something else they started saying....woooo Im hot!  Sorry about that.\n\nYou are spot on!", "score": -3, "replies": [{"body": "I'm not sure what you're talking about at this point but I support you, fellow retard. May your future be full of sweet tendies and may your positions be as green as, well, whatever super green things are!", "score": 3, "replies": []}]}]}, {"body": "Aw naw sorry that was about the Melvin dude trying to get shady. I'm so wound up...im just spewing every thought so i dont throw my phone at the tv.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "They want to believe that diamond hands is a solid/professional investment strategy so badly.", "score": 6, "replies": [{"body": "You literally comment replied to the dude that was saying \"Infinity or bust. 🚀🚀🚀🚀🚀🚀. 100 shares. 💎💎🤲\" during the squeeze. That was his exact comment with several made just like it last month.\n\nWho are you idiots trying to fool here, trying to act educated *after the fact*?", "score": 2, "replies": [{"body": "I have never at any point owned shares of GameStop. What are you talking about.", "score": 1, "replies": [{"body": "Re-read my comment, you obviously didn't see who I was talking about.", "score": 1, "replies": [{"body": "My bad, i only saw it said you replied to my comment.", "score": 1, "replies": [{"body": "All good man. 👍", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Short at 300, without manipulation you're margin called at 600 lose all and watch it go over thousands.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "So like 2 people saw that trend then? Cuz I see about a million bagholders around here. \n\nA few retards got lucky, but the main winners were the hedge funds and Vlad, not retail.\n\nDon't for a second act like you're a smarter retard than the rest of us.\n\nEdit: you're not. \"Infinity or bust. 🚀🚀🚀🚀🚀🚀. 100 shares. 💎💎🤲\"\n\nThat was one of several similar comments you made about GME last month.  Now post some loss porn before I go flaccid.", "score": 0, "replies": []}]}]}, {"body": "He exited before the initial spike but okay.", "score": -2, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "The run up time from the 22nd is irrelevant in this conversation. He exited a day before the spike to 300 that was 10x as big of a spike. Btw I am a fucking idiot and proud of it. Good day sir", "score": -4, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Regardless, I am an idiot", "score": -2, "replies": []}]}]}]}]}]}, {"body": "wasn't he and some guy from 72 fined 1.8b for insider trading during their time at SAC", "score": 3, "replies": []}, {"body": "Why did the market kick GME?\nWho caused the fluctuations?\nWho made the calls?\n\nWe all know. Now just admit it.", "score": 9, "replies": []}, {"body": "I don’t think you understand what insider trading is.  Just stop posting.", "score": 8, "replies": [{"body": "Okay Mr. Plotkin. If you read the fucking post you'd see that I said it probably wasn't actual insider trading, but you may just be a bit more retarded than most of us and are illiterate.\n\nTL;DR there isn't one. l2read", "score": -11, "replies": [{"body": "I'm illiterate but you don't know the meaning of the word \"probably\" ?", "score": 5, "replies": [{"body": "Do you want me to sit and explain the meaning or 'probably'?\n\nProbably. May or may not. It could be or it could not be. There is a plausible chance, but not completely certain. \n\nI understand what you're trying to imply but making a trade based on privileged information not released to the public can very well be defined as INSIDER TRADING. Maybe not by the legal definition but very well by the literal definition. It does not mean that person has to be an entity of the stock being traded.\n\nSo while it may not fit the legal definition of insider trading, it very well could have been a trade based on privileged information that would have swayed his opinion if he had not had that information", "score": -8, "replies": [{"body": "And what information might that be?", "score": 3, "replies": [{"body": "If I knew then it wouldn't exactly be private information, would it? \n\nI get what you're saying, but you've asked a question I couldn't possibly give an answer to.\n\nGonna ask me \"what's the meaning of life\" next?", "score": 1, "replies": []}, {"body": "*The* information bro, obviously", "score": 1, "replies": []}]}, {"body": "Dude there is no definition of insider trading except the legal definition.", "score": 2, "replies": []}]}]}]}]}, {"body": "What information do you believe he was able to access? Retarded information that’s freely available on Reddit?", "score": 4, "replies": [{"body": "I'll return that question with an easier to answer question: what information do you have access to that he doesn't?\n\nThe answer is likely nothing. \n\nBut I'm very well sure there's a shit ton of vital information that he has access to that we (retail investors) don't have. \n\nI'd absolutely love to know the juicy profiteering information he's fed on the daily, but there's absolutely no doubt in my mind that he gets whatever useful information he needs to have an advantage well before it become public. I would also bet that some of it was obtained illegally. \n\nShorting is much easier to hide than going long is, which is exactly why it's preferred over actually investing in the fucking company.", "score": 1, "replies": [{"body": "Lol. Like how could there be insider trading in this scenario? Like someone at GameStop called him and was like “hey man! I think some retarded stoners on Reddit might be about to buy a lot of stock in our company. Let me know how I can help defend your short positions.”", "score": 1, "replies": []}]}]}, {"body": "It’s not called insider trading when you’re rich. It’s called luck. \n\n/s", "score": 2, "replies": []}, {"body": "Are 🚀🚀🚀 code for buy puts?", "score": 2, "replies": [{"body": "It's code for do whatever you want, stonks only go up!", "score": 1, "replies": []}]}, {"body": "It wouldnt be the first time. Wasnt he and some other dude fined 1.8b for I sider trading already?", "score": 2, "replies": []}, {"body": "He probably caused the $20 —> $60 jump if he’s telling the truth", "score": 2, "replies": []}, {"body": "Are we really surprised?", "score": 4, "replies": []}, {"body": "woo tendies 🚀", "score": 2, "replies": []}, {"body": "Ban", "score": 2, "replies": [{"body": "Updated with positions, my bad", "score": 4, "replies": []}]}, {"body": "fuck this is some new age retardation that doesn't belong on wsb", "score": 1, "replies": []}, {"body": "I once told a police officer I was only months away from getting hit on 9/11.\n\nIT HAD TO BE INSIDER INFO\n\nFuck I miss the old brand of retarded wsb rather than this new age shit", "score": 1, "replies": [{"body": "I wrote a reply but the Relay app went full retard and posted a reply that I made on another comment so this is an edit. \n\n I know it's not considered insider trading but if what I said was actually true it should be added to the legal definition. He seems to have had information that the public was not privileged to that made him make that decision right in the nick of time.\n\nDo you not agree?", "score": 2, "replies": [{"body": "Fuck son, imagine making a good call once in a while. A fund that returned 30% per annum making a good decision?\n\nYep must be something fucky going on here, they’re clearly idiots 😂😭😭\n\nAnyway pls yolo more I will watch your posting career with great interest 🙃", "score": 1, "replies": []}]}]}, {"body": "Do you have any idea what insider trading is? And no, there is no law against closing your position because GME is going to unrealistically high levels and media hype continues to influence the price. Do you live under a rock? This was all public", "score": 1, "replies": []}, {"body": "How could that possibly be insider trading? As to him being \"lucky\", well how many invested here understanding this was going to just go up and up? I realized that and made money on that.", "score": 1, "replies": [{"body": "I think the millions of bagholders would say otherwise. \n\nCome on now, just admit you're retarded like the rest of us and have no clue what you're doing either.\n\nIt's okay, your wife's boyfriend doesn't have to know.", "score": 1, "replies": [{"body": "There have been only two investments in my life where I felt there was no question they will pay off. (1) Tesla after battery day and (2) in the GME squeeze.\n\nI have investments in PLTR, QS and others and none of them do I have that level of confidence.\n\nSo yeah, maybe I am retarded and have no clue what I am doing, but I have never had that belief in the value of an investment other then those two times.\n\nWith GME by Wed of that week I was no longer as confident in it as I did not understand how it was possible for there to be liquidity to cover if it goes up and up. I was having trouble understanding how the share price can go up to a $1,000+ without threatening the system and as a matter of fact had raised this concern on this sub Wed morning (see link below if you care). Sometime later in the day I sold most of my positions due to concerns about how this can all work.\n\n[https://www.reddit.com/r/wallstreetbets/comments/l5xpai/the\\_gme\\_thread\\_for\\_january\\_27\\_2020/gkxd5uu/?context=3](https://www.reddit.com/r/wallstreetbets/comments/l5xpai/the_gme_thread_for_january_27_2020/gkxd5uu/?context=3)\n\nI believe by Thursday in private conversations I was warning people about investing in GME as the situation had become toxic. One guy who did not listen to me in the end bought, then he apparently listened to me the beginning of the following week when I suggested he cut his losses as the squeeze is clearly over.\n\nJust to point this out, if I understood this thing was poised to go up some crazy amount and would put counter-parties into insolvency, I would hope that someone like Gabriel Plotkin who is very smart and spends his life trying to understand markets could see this as well. What no one saw coming was the mass retail buying causing a squeeze as that was unprecedented. The rest was to a large extent predictable (had I realized the clearing-houses or brokers can restrict trading to protect themselves or the markets I would have sold my remaining investment in GME on that Wed when it had clearly gone up to critical levels).", "score": 2, "replies": [{"body": "That's literally my point. Sure, it had to come crashing back down eventually, but they quite literally cheated the system to avoid massive losses, which disrupted the series of events that would have resulted in $1000+ shares and a few insolvent hedge funds before it crashed back to earth. \n \nSure we would have still had bagholders, but the catastrophic hit that would have went to the hedge funds first was avoided by restricting buying.\n\nSo they got out of it almost scott free, literally avoiding bankruptcy because they knew exactly what was happening and their only choice was to keep us from buying.", "score": 1, "replies": [{"body": "I think some realized sooner (e.g. Melvin) that this was toxic and closed their positions. Others did not and they lucked out when the clearing-houses/brokers restricted trading to closing out positions. Otherwise you are right they would have faced bankruptcy. I don't think the brokers cared about them, rather they cared about themselves and not being on the line to cover these.", "score": 2, "replies": [{"body": "On the bright side, we at least found out we actually had power, we just had it taken away at the exact moment we found out we had it.", "score": 2, "replies": [{"body": "Yep.", "score": 2, "replies": []}]}]}]}, {"body": "I'M RECLAIMING MY TIME!!!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}]}]}, {"body": "\"Thank you for the question, congressman. I look forward to endeavoring to find an answer to that question.\"", "score": 1, "replies": []}, {"body": "These peeps have access to your trade data and have already made their move before your trade fills. 😉", "score": 1, "replies": []}, {"body": "Nothing is off limits for you conspiracy theorists, it’s incredible to watch everything become a conspiracy.", "score": -5, "replies": [{"body": "What conspiracy am I making exactly? He literally said it himself on stream that he exited his short position only days before the spike", "score": 2, "replies": []}, {"body": "Why are you even on here then go back to watered down wsb", "score": -5, "replies": []}]}, {"body": "inside info from whome? God? Nostradamus? nobody knew when the peak would be", "score": 0, "replies": []}, {"body": "Black pool?", "score": 0, "replies": []}, {"body": "WSB is not secret.", "score": 0, "replies": []}, {"body": "WTFF = thats....what the fuckety fuck", "score": -5, "replies": []}, {"body": "The guy with the blue shirt need to get a better mic. Cant here shit when he talks.", "score": 1, "replies": []}, {"body": "Reading that flow.", "score": 1, "replies": []}, {"body": "Maybe. There would have to be a full investigation on why the spike happened on that particular day. It might even be that big players exiting their short positions triggered the main spike of the squeeze. Could be insider trading or market manipulation if people were coordinating", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "That's why you need to get out of RH (and others) and get into a respectable broker who won't disable your buy button during the squeeze of the century.\n\nI don't care if they get into trouble, it won't solve the issue.. what will solve this issue is new legislation for better transparency and harsher tax penalties for those who aren't being transparent or fudge their numbers to look legitimate. On top of that, better enforcement of naked short selling as it stands now.", "score": 2, "replies": []}]}, {"body": "No, he just lied. \n\nHe ain’t exit shit", "score": 1, "replies": []}, {"body": "From what I saw, he looked like a dead man walking. Like none of what was going on in the hearing mattered. Could be the 6B loss hangover. Could be that he’s just a smug guy that feels like this is a waste of time. Could be that today was the least of his worries. Either way, I thought it was peculiar body language.", "score": 1, "replies": []}, {"body": "They got out just before... and lost ~$6B still? In a month?\n\nHard to believe.", "score": 1, "replies": []}, {"body": "Same way Warren just moved into Verizon...", "score": 1, "replies": []}, {"body": "Two sentences later he claimed that Melvin was “exiting their position during the frenzy at a loss.” How did no one say anything about him contradicting himself?", "score": 1, "replies": [{"body": "I must not have caught that part. \n\nThe point I was trying to make is that if he did indeed exit his positions before the initial spike (his words were something along the lines of \"days before the trading halt\") then he was subject to privileged information from someone inside telling him his positions would explode and lose money in the next few days. \n\nIf he is in fact lying and held positions during the run-up, well... Lying under oath is probably something he would do in his sleep.\n\nEither way, he had to have known way more about the situation before it exploded like it did than he lets on.", "score": 1, "replies": [{"body": "Wouldn’t L3 data (also should be illegal) be able to see that a massive amount of calls were about to expire ITM? And if he could see that why wouldn’t he exit? And if he did have insider info he also would have exited. And if he exited, how did he take a 53% loss? None of it makes sense. It was abundantly clear that he was lying.", "score": 1, "replies": []}]}]}, {"body": "If MC exited before the spike and didn't lose any money on GME, why are they in a Congressional hearing about it? Same goes for Citadel.", "score": 1, "replies": []}, {"body": "One Tesla please sir. I want some more (Troll lord Elon).", "score": 1, "replies": []}, {"body": "They have data we can only dream of. They know exactly how much money is long, short, the available shares, they know everything in real time. \n\nIts likely the identified the short squeeze long before we knew about it on WSB. Whether they acted on that information or not is another issue.  \n\nBut typically the buying of positions would set off the short squeeze.  If they bought a fuck tonne, then the price would go up.  Its not a coincidence,  you just have the cause and effect mixed up.  They aren't independent events and Melvin buying a load of shares is inevitably the precursor to the share price increasing.  \n\nI mean, that's why we were hiding right.  Because when they cover the price would go up. Well it did and would continue to of retail were allowed to keep buying.", "score": 1, "replies": []}, {"body": "TLDR", "score": 1, "replies": [{"body": "Sorry too retarded to make one, just buy GME", "score": 2, "replies": []}]}, {"body": "&#x200B;\n\n&#x200B;\n\nthis has to be wrong.\n\n&#x200B;\n\nthe melvin fund was not able to close their shorts on time. the fund imploded and had losses of several thousands of millions.\n\n&#x200B;\n\nit could be that the guy who used to manage that fund is just too proud and idiotic to admit it, but it is a fact that the fund was obliterated by their losses.", "score": 1, "replies": [{"body": "He said it under oath (about an hour in) so it must be true!\n\n/s", "score": 1, "replies": [{"body": "&#x200B;\n\nif losses of approximately $7,000,000,000 usd are what he understands as exiting positions before the spike, well, it is hard to argue with that.\n\n&#x200B;\n\nthe losses are documented and the fund was shut down, so it is fortunate that they could exit before things got ugly.", "score": 1, "replies": []}]}]}]}
