{"title": "[deleted by user]", "selftext": "[removed]", "id": "jz7n7u", "created_utc": 1606093347.0, "score": 582, "upvote_ratio": 0.93, "num_comments": 98, "comments": [{"body": "Nice explanation and thanks for sharing. Good luck to you.", "score": 79, "replies": [{"body": "Thank you", "score": 15, "replies": []}]}, {"body": "the man is back! i like these plays thanks for posting", "score": 30, "replies": [{"body": "i like the words too", "score": 2, "replies": []}]}, {"body": "I'm up over 40% since August. My portfolio was 70% VOO (S&P 500), 20% NIO, 10% airlines and PLUG. Easiest money I ever made.", "score": 58, "replies": [{"body": "Lets go my man, keep up the good work.", "score": 25, "replies": [{"body": "Oh yeaaah, when I can actually use that money in 30 years I'm gonna have a blast lol. I'm holding NIO for the long haul though so who knows, maybe it crashes and all my gainz go in the dump", "score": 21, "replies": [{"body": "Haha sooner than you think. Slow and steady!", "score": 4, "replies": []}]}, {"body": "I made a fun money account because we can't freakin travel; Albania, Japan, Ukraine.\n\nThe fun money account is up almost 107%, just with solid picks around March; ZM, CCL, MGM, NVDA, and SPCE up 16.75%.  Now I got more places to pick out when that is a good idea again!\n\n\nEdit:  SPCE up 16.75% since buying last week.", "score": 3, "replies": []}]}, {"body": "NIO still running up. Mad at myself for getting rid of 2/3 of my shares but I really thought that Citron article would be the end of it", "score": 1, "replies": [{"body": "I have 138 shares. Had 150 but I sold a couple to buy PLTR and now that's going up like crazy. I'm in these for the next 5+ years because I have them in my Roth so I've just held through the days when it's dropped.\n\nI do not expect to get these kind of gains or anything close to 40% consistently though, which is why I'm so heavily skewed towards VOO shares. NIO and PLTR could easily crash in the next year and my portfolio would still be fine.", "score": 2, "replies": []}]}]}, {"body": "I have been buying Tesla since 2016 and continue to buy today.  It’s 86% of my portfolio today and I’m holding long. Cybertruck on reserve too.", "score": 35, "replies": [{"body": "LFG !!", "score": 7, "replies": [{"body": "It went :)", "score": 2, "replies": []}]}, {"body": "Holy shit😂", "score": 9, "replies": []}, {"body": "can you be my idol?", "score": 2, "replies": [{"body": "Too much pressure :)", "score": 2, "replies": []}]}]}, {"body": "$ALPP- https://finance.yahoo.com/news/alpine-4-technologies-ltd-alpp-133000025.html\n\nThis is still unknown but by mid week it will be out there", "score": 4, "replies": [{"body": "Will check it, thank you.", "score": 3, "replies": [{"body": "You’re welcome, the CEO wants this on the NYSE so even though it’s up about 65% if you get in on a dip you can still do very well", "score": 2, "replies": []}]}]}, {"body": "yo no disrespect but 1.9%? might as well just sign up for a credit card with rewards on it", "score": -34, "replies": [{"body": "Averaging 1-2% per week would double your account in less than a year.", "score": 33, "replies": [{"body": "Wouldn’t have made a lot more just investing the money in the shares directly?", "score": -7, "replies": [{"body": "It would be close, but probably not. It depends on the market, but the last 3 months have been completely sideways.", "score": 9, "replies": []}]}, {"body": "Doing 1.9 when the market is blowing up is not impressive. Did you even beat the S&P for that time period?\n\nI’m up 100% this month.", "score": -9, "replies": [{"body": "I've beaten the market every week except last week.", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "No, I've been averaging 2-5% per week. I sell the option for 1-4 weeks out but usually close within 1 or 2 weeks. Sometimes I close in 3 days if the stock gets a good jump and I'm up 60-70%.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I documented everything in my posts. Check my profile out and you will see the last 2 week's positions, returns, and screenshots.", "score": 2, "replies": []}]}]}]}]}, {"body": "This. I think a lot of people miss out on the free points by putting everything on a credit card and paying off the balance each month so there is no interest. I get about 1.5% back in the form of gift cards.", "score": -12, "replies": []}, {"body": "Yo no disrespect but 1.9% in a week is over 160% a year, might as well learn about compounding returns if you’re going to try to be funny", "score": 28, "replies": []}, {"body": "You need to take a math course.", "score": 8, "replies": []}]}, {"body": "missing baba", "score": 1, "replies": [{"body": "BABA still good at $270, wouldnt mind a little China news dip to get in on it though.", "score": 4, "replies": []}]}, {"body": "1.9% for the week.. seriously? and you're posting analysis? that's terrible lol. the spy has been going up more than 1.9% per week the last several weeks", "score": -21, "replies": [{"body": "What about on the down weeks? I like my risk-averse strategy. I've more than doubled my account since April using this strategy after wiping out half my account in March on yoloing. I've switched away from the dark side.", "score": 23, "replies": [{"body": "The entire market doubled since April.", "score": 2, "replies": []}]}]}, {"body": "Good stuff OP and good luck! I really enjoy reading your posts with TA. Thanks for sharing with us newbie...", "score": 5, "replies": [{"body": "You're welcome and thanks for the appreciation!", "score": 5, "replies": []}]}, {"body": "Dang I did the opposite and have 275c for FB exp 12/11", "score": 1, "replies": [{"body": "I'm selling the put so entering a long position. I'm on the same side as you my man!", "score": 7, "replies": []}]}, {"body": "1.9%? the commisons on the options and bid / ask spread you traded are around 1%... not lookin good...", "score": -12, "replies": [{"body": "Not sure what you are talking about here. There is no 1% fee. 1.9% was what I cleared last week.", "score": 8, "replies": []}]}, {"body": "[removed]", "score": 19, "replies": [{"body": "We're not gonna sell. I mean we will, but only at a profit ;)", "score": 10, "replies": []}]}, {"body": "Umm, why not just buy and hold good stocks. You'd get way better than 1.9% for the week?", "score": -6, "replies": [{"body": "The last week I under-performed the market.\n\nThe last 8 weeks I out-performed the market.\n\nAlthough in months like August I would have greatly under-performed by a lot. It's all relative to your risk tolerance. Also, this is the first time in years that tickers like AAPL and AMZN have been flat for 3 months straight. They need a catalyst to move higher and when they do the market will follow, but it needs a leader.", "score": 9, "replies": []}]}, {"body": "Thoughts on AAPL?", "score": 1, "replies": []}, {"body": "Opinion on CRSR?", "score": 1, "replies": [{"body": "I like it but crazy hyped right now", "score": 5, "replies": [{"body": "too late to hop on?", "score": 1, "replies": [{"body": "I just hopped on this morning. Will update positions in the thread shortly.", "score": 2, "replies": []}]}]}]}, {"body": "Thank you for the information and breakdown!\n\nEven though I don't have the capital to play around like you do, it's so helpful to see what more experience traders are looking at and thinking of :)", "score": 1, "replies": []}, {"body": "It makes me feel better about my KR long play seeing that someone else who knows their stuff is in the same direction as me. Thanks for sharing!", "score": 3, "replies": [{"body": "Could be a slow and steady grind up, but I believe in it.", "score": 3, "replies": [{"body": "Thats my prognosis too.", "score": 1, "replies": []}]}, {"body": "I bought LEAPs on KR and so far they're not doing so well, I certainly hope that's right.", "score": 1, "replies": []}]}, {"body": ">Diversified in 4 stocks\n\nI'm not really sure that's what diversified means but, thanks for the breakdown post.", "score": -3, "replies": [{"body": "I was being sarcastic, of course I am not divesified! Haha", "score": 2, "replies": []}]}, {"body": "Gosh I am envious, I'm trying to learn about investment but it's doing my head in. Keep up the good work!", "score": 3, "replies": [{"body": "Start slow and learn by having skin in the game. Its nearly impossible to learn without actually doing it.", "score": 2, "replies": [{"body": "Or practice accounts to start", "score": 2, "replies": []}, {"body": "Thank you!", "score": 1, "replies": []}]}]}, {"body": "I will be selling more put spreads on SHOP if they have a down day. Strong support at the 900 level.", "score": 2, "replies": [{"body": "I really like the SHOP play. e-commerce is going to continue to boom and SHOP is the leader. Big support at 900", "score": 2, "replies": [{"body": "I am biased as I work within eCommerce but I think people are underestimating just how massive it is going to be for BFCM/Holidays.", "score": 1, "replies": []}]}]}, {"body": "I'm up 2.08% in the last hour .up 15% in the last month.", "score": 1, "replies": [{"body": "Amazing numbers my man!", "score": 2, "replies": [{"body": "Thanks . I just broke 40% since april , must be beginners luck .", "score": 1, "replies": []}]}]}, {"body": "Which book to learn how to plot lines / charting", "score": 1, "replies": [{"body": "No book, just experience. Beauty of the lines is in the eye of the beholder.", "score": 1, "replies": []}]}, {"body": "After reading all of this, I don't think I'm ready to invest just yet", "score": 3, "replies": [{"body": "Can’t learn until you do!", "score": 1, "replies": []}]}, {"body": "For your previous posts I’d like to clarify you made 4K in a week, or rather 5% ROIC from selling Puts? \n\nCan you drop your previous week plays because that’s insane. I assume that’s realized gain in which you basically bought to close? Or are the listed figures how much premium you got for selling that week?", "score": 6, "replies": [{"body": "Realized gains after closing the positions. I wont count a gain until it's realized. Even last week the puts I sold were all for 2-3 weeks out but I closed them in 4 days after they were 80%-90% profit.", "score": 3, "replies": []}, {"body": "I am also curious.\n\n **RemindMe! 3 Days \"check for updates\"**", "score": 1, "replies": [{"body": "I will be messaging you in 3 days on [**2020-11-26 19:44:52 UTC**](http://www.wolframalpha.com/input/?i=2020-11-26%2019:44:52%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/jz7n7u/i_draw_with_crayons_so_you_dont_have_to_last_week/gdd1ng0/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fjz7n7u%2Fi_draw_with_crayons_so_you_dont_have_to_last_week%2Fgdd1ng0%2F%5D%0A%0ARemindMe%21%202020-11-26%2019%3A44%3A52%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20jz7n7u)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "1.2% in a week? What are you playing, AAPL ?   \nOne of my investments when up 30% in 7 days. The only problem I had is that I didn't put more money in.", "score": -1, "replies": []}, {"body": "> My goal is to never take a loss on a position and always wheel it back to profitability.\n\nBig brain ideas 😂\n\nFor real though, thanks for the write-up!", "score": 1, "replies": []}, {"body": "Sent you a PM", "score": 1, "replies": []}, {"body": "Good stuff OP. I have also been trying to dig myself out of WSB style plays on tech that blew my account in September. I went down 37% from my previous high. I made 30% of it back (thanks Corsair). Slow and steady 🤙.", "score": 1, "replies": [{"body": "This is the way, lets gooo", "score": 2, "replies": []}]}, {"body": "Would you mind elaborating on your technical analysis?", "score": 1, "replies": []}, {"body": "What do you think about AMD vs NVDA", "score": 1, "replies": [{"body": "Both are good, I made money off AMD last week, check my profile for the post. AMD stock is over-extended right now up a lot in just 7 days. I prefer the risk to reward on NVDA at this very moment.", "score": 1, "replies": []}]}, {"body": "I'm brand new here. Where are these pink and blue lines you speak of in the \"chart rules\" section?", "score": 2, "replies": [{"body": "Pink lines are trend-lines that I drew. Shows the general direction that the stock price is moving in at the macro level and not day-to-day.\n\nBlue lines shows support and resistance lines. Also known as demand and supply, respectively. It shows where there might be buyers and sellers into the buy and supply zones.\n\nThese lines are all subjective.", "score": 3, "replies": [{"body": "I'm not seeing any links to the charts.  Is it just me?  Great post though.  Thanks for sharing.", "score": 1, "replies": [{"body": "I just realized I can probably pots imgur links to the images. I'll do that next time. In my profile I made a similar post in ThetaGang sub-reddit and it has the images loaded.", "score": 3, "replies": []}]}]}]}, {"body": "Insane detail. Thank you so much for posting this!", "score": 2, "replies": []}, {"body": "This is a really dumb question but what do you mean by selling cc against it in Reference-to Kroger", "score": 1, "replies": [{"body": "I sell a covered call against my shares to collect premium and limit my gains. If the shares go above $34 I don't get any gain after that, but my max gain would be about $1,100 on 500 shares.", "score": 1, "replies": []}]}, {"body": "Thanks for sharing!\n\nI am new to options and wanted to do something like this w/ MSFT as I watch them closely, however I currently do not have the capital to tie up say $20k in selling a put.\n\nIs there a way to lower the cost but still do it in that way?", "score": 1, "replies": [{"body": "You would need to sell a put on a ticker with a lower price or perhaps just stay entered in a share position.", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "jzdsmh", "created_utc": 1606119579.0, "score": 164, "upvote_ratio": 0.91, "num_comments": 88, "comments": [{"body": "Very professional.  People seeing me scroll through this would be impressed.....what about the claim that they have been cooking the books?", "score": 104, "replies": [{"body": "It's Chinese, it's automatically assumed they're cooking the books.", "score": 105, "replies": [{"body": "lol priced in book cooking, i like it", "score": 23, "replies": []}, {"body": "“Chinese accounting magic.”", "score": 6, "replies": []}]}, {"body": "Short sellers are always out to catch the next China fraud/Luckin Coffee, but you can Google trips a room at one of their hotels. \n\nAlso, due to the fact that their business is based on 'hard' assets leads me to believe that they have to operate under more legitimacy than 'brand' pumps.\n\nLastly - this is why I have my price target set at a multiple that is a slight discount to US-based hoteliers; otherwise I'd be looking at $90+ a Share.", "score": 16, "replies": [{"body": "I don’t understand the “but you can Google trips a room” point you are making in relation to cooking the books. You could also drink Luckin Coffee? I had lots of cups last year.", "score": 28, "replies": [{"body": "Bc if u have ever worked in corp america to have a reseller/retailer of your products requires some due diligence on the Company. for example if u run a website claiming to sell real rolexes and the rolexes turn out to be fakes you would be liable", "score": 1, "replies": [{"body": "Your comment makes it seem like the fraud in Luckin was that there was no coffee to be sold. \n\nThere was coffee sold. I bought a lot of it and drank it. The fraud in Luckin was cooking the books because every single cup of coffee I bought was over 50% discounted. They have practically gave the shit away and then lied about profits.", "score": 7, "replies": []}, {"body": "Lol. No online retailer (except hopefully your broker) gives a shit if its sellers are committing securities fraud. It isn’t even part of their diligence review. They hardly care if the product is safe or is violating someone’s IP, and that’s only because retailers have potential liability as the point of sale. \n\nBottom line in China is that you don’t get to know if the company is committing fraud, and a large part of your bet is on the CCP’s willingness to tolerate foreign investors (fun fact: even if the company isn’t a fraud and is wildly successful, it can cut out foreign investors entirely and there isn’t anything investors can do). There are a lot of reasons the companies and CCP are not likely to cut out foreign investors, but this is solely dependent on their views of their own self-interest, not any legal protections (as a foreign investor you have no legal standing or property rights under Chinese law).", "score": 1, "replies": []}]}]}]}, {"body": "Chinese, so that's priced in already", "score": 2, "replies": []}, {"body": "It’s priced in atm.", "score": 2, "replies": []}, {"body": "Apparently China is very optimistic that it can be sorted out with a Biden administration.", "score": 6, "replies": []}]}, {"body": "How much addy you take?", "score": 66, "replies": [{"body": "My powder white", "score": 74, "replies": [{"body": "IAMCOKEMAN", "score": 14, "replies": []}]}]}, {"body": "[deleted]", "score": 74, "replies": [{"body": "that's the spirit", "score": 17, "replies": []}, {"body": "I had to Google  what RevPAV meant to understand one of the charts to see if I should plop down $575 on a June $55 call and this guys over here just dumping 10 G’s into this shit. I love this sub.", "score": 13, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Poor people are allowed in the comments. I’m not posting loss porn when my $3000 account got blown up and rebuilt like it’s something anyone gives a shit about it.\n\nPlus that’s a weeks of take home pay so imma at least do what I can to avoid another P&D.", "score": 11, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Oh I didn't actually put $10k in dude, it was a joke. All my money is tied up in selling covered calls on PLTR and I sold some RIOT puts. I ain't fucking with any Chinese garbage my dude.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "The joke wasn't about buying shares, it was about the laziness and mob mentality of this degen sub.\n\nhttps://i.gyazo.com/973b8a43bbbdaba7425f8087caac2610.png\n\nSome of you people in this sub have the sense of humor of a MAGA chud.", "score": -1, "replies": []}]}]}]}, {"body": "show proof and i'm in", "score": 1, "replies": []}]}, {"body": "this is a perfect play since according to the CCP, they have ZERO covid cases and everything is booming", "score": 23, "replies": [{"body": "It’s the truth because my money depends on it!", "score": 9, "replies": []}]}, {"body": "NIU is going to be way higher than this and its EV. you want to buy hotel stocks when they're at an ATH?", "score": 21, "replies": [{"body": "Risk-reward is tilting to other China stocks given the run-up in EVs. My job is to hit a target no one sees, not what everyone else sees", "score": 27, "replies": []}, {"body": "It's too dumb to fail", "score": 6, "replies": []}, {"body": "Dudes trying to pump his $50 bags", "score": 20, "replies": []}]}, {"body": "I only scrolled down to see your upvote percentage. I will now blindly follow you.", "score": 35, "replies": []}, {"body": "What color are their mattresses?", "score": 14, "replies": [{"body": "green & PRPL", "score": 11, "replies": [{"body": "PLTR? Okay i'm in!", "score": 40, "replies": [{"body": "Somebody say PLTR? I'm all in!", "score": 9, "replies": []}]}]}, {"body": "Piss yellow.", "score": 1, "replies": []}]}, {"body": "Cool just bought 100k. Load up the memes.", "score": 9, "replies": []}, {"body": "If three fraudulent Chinese EV stocks that don't sell vehicles and a low tier company that sells RAM and mouse pads can go up 1000% why not a crappy Chinese hotel. I'm all in.", "score": 35, "replies": [{"body": "Put some respect on Corsair smh", "score": 5, "replies": []}, {"body": "Crsr? You are mistaken sir", "score": 6, "replies": []}]}, {"body": "one thing I would like to add is that China is saturated with hotels even before the Covid. You can get cheap 5 star in Shanghai for under 100 usd nowadays. Only thing that would make this play work would be bringing in more tourists.", "score": 9, "replies": []}, {"body": "WTF happened to this stock in May/June of 2018 when I lost almost 70%?", "score": 5, "replies": [{"body": "Basically a 4:1 stock split but done in the China way where it gets reflected in the stock price - they changed the 'ratio'", "score": 6, "replies": [{"body": "Interesting, thanks", "score": 1, "replies": []}]}, {"body": "Most China stocks dropped in 2018 because of China's growth declining and trade war by Trump.", "score": 1, "replies": []}]}, {"body": "\"mini hiatus\" aka deleted my several wrong predictions so I could point out the 3 that literally everybody on this sub was already in\n\nAlso probably says \"blocking amounts for privacy\" aka I have $300 in my account because I'm not the financial guru I'm proclaiming to be", "score": 18, "replies": [{"body": "reddit history me or sell me calls. also u can somewhat see i had xx,xxx shares of crsr. enough to be your mama and sisters bf", "score": 13, "replies": []}]}, {"body": "You had me at ni hao 🇨🇳🥠 🚀", "score": 3, "replies": []}, {"body": "Great DD. I'm gonna follow you.  \nPutting an order for 75C 3/19/21, .25 limit.", "score": 3, "replies": []}, {"body": "My dude. I live in China (and I live in a 5 star hotel). Aight no one really going to go for one of those Chinese branded hotels except those that can’t afford the international ones. I’ve stayed in many of these and they’re just meh...I’m not Chinese though. Good DD, godspeed.", "score": 13, "replies": [{"body": ">no one really going to go for one of those Chinese branded hotels except  those that can’t afford the international ones.  \n>  \n> I’ve stayed in many of  these \\[...\\]", "score": 19, "replies": []}, {"body": "Have you been to the NIO lounge my friend", "score": 10, "replies": [{"body": "I hear the mojito is delicious.", "score": 4, "replies": []}, {"body": "I have!!", "score": 2, "replies": []}]}, {"body": "Isn’t that what OP is saying though? China wants to be building brands with international reputation while increasing domestic travel? They aren’t there yet but that’s going to be part of the 5 year plan. To get to being a desired hotel space", "score": 3, "replies": []}, {"body": "How do you feel about Las Vegas Sands over there?", "score": 1, "replies": [{"body": "I live in Shanghai but I never see any sand", "score": 0, "replies": []}]}]}, {"body": "thanks for writing this when the stock is on all time highs.  for fuck sake.", "score": 3, "replies": []}, {"body": "Wow Batman. Who the fuck are you??\nYou are a different breed of autist man! This DD is another level.\n\nI get ya, I rrreally get'ya. I've been making decent money with XPEV/NIO but HTHT was out of my radar, I'll double check on my side your arguments and I might as well jump into you bandwagon. You seem to be a good autist to follow.", "score": 3, "replies": [{"body": "Just leave", "score": 4, "replies": []}, {"body": "HMU if this dad turns out. But preferably before market opens", "score": 2, "replies": []}]}, {"body": "This post was flaired as DD so it's on [the DD list](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da).\n\nDon't fuckin' misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. \n\nDD is for wall-of-text deep-dive Pepe Silvia shit. [Read this to learn how to do your own DD.](https://www.wallstreetoasis.com/forums/on-the-job-with-simple-as-my-research-process)\n\nPlease message [modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets&subject=DD%20Flair%20Abuse&message=Link%20to%20thread:) to report this DD if it is low quality, or violates the [Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "Noone is travelling to these hotels.", "score": 2, "replies": []}, {"body": "What the fuck are these garbage crops", "score": 0, "replies": []}, {"body": "A bit off topic, but any thoughts on SMIC?", "score": -1, "replies": []}, {"body": "Too much baijiu, comrade? \nNext big play is BAIC and Geely 🤩", "score": 0, "replies": []}, {"body": "Meanwhile AYRO up >20% in premarket for the 3rd day in a row.", "score": 0, "replies": []}, {"body": "Airbnb or China hotels (htht)", "score": 3, "replies": []}, {"body": "Fuck you im in.", "score": 3, "replies": []}, {"body": "Too many tards saying no here so for that reason I’m out", "score": 2, "replies": []}, {"body": "H is the 8th letter of the alfalfabet chinese love 88. Two H in HtHt. T is also in their somewhere, not sure what that has to do with chinese people but chinese people love tea so buy tesla calls.", "score": 3, "replies": []}, {"body": "Who actually read this? What’s the short version", "score": 1, "replies": []}, {"body": "This is truly one of the worst DD I have ever fucking seen", "score": 1, "replies": []}, {"body": "I actually like this for a short position, I'm in no way saying it'll go down but I want sone cheapish shorts just in case we dip a little and I like the pricing here", "score": 1, "replies": []}, {"body": "A little bird told me this company has been laundry money on some offshore island for a long time, could be a huge risk", "score": 2, "replies": []}, {"body": "The “next....” shut the fuck up", "score": 1, "replies": []}, {"body": "Howndid you come up with that strike price and date though? Why not further out or higher strike?", "score": 1, "replies": []}, {"body": "Why the big dip in 2018 from 100+ to like 40? Any potential risk for that happening again?", "score": 1, "replies": [{"body": "Responded to earlier guy but it was a 4:1 stock split but done in a way where it got reflected in the share price (a ratio change not traditional way)", "score": 1, "replies": []}]}, {"body": "Are you talking about that old flash furry porn game?", "score": 0, "replies": []}, {"body": "13th 5yr plan goal: double income \n\n&#x200B;\n\n&#x200B;\n\ni like these Chinese guys they seem much nicer than our politicians", "score": 1, "replies": []}, {"body": "This one screwed me early covid days. Never again.", "score": 1, "replies": []}, {"body": "What about Li Auto?? I bought in at 30 due to the cap being a little higher than XPEV and the stock being a little cheaper. And LI is only continuing to go up (still new to stocks)", "score": 1, "replies": []}, {"body": "FAwk chy-na", "score": 1, "replies": []}, {"body": "What happened on May 18, 2018?", "score": 1, "replies": []}, {"body": "so shines a good deed in a weary world", "score": 1, "replies": []}]}
{"title": "Don’t be dumb, buy GME", "selftext": "[deleted]", "id": "jztm6k", "created_utc": 1606175420.0, "score": 92, "upvote_ratio": 0.93, "num_comments": 92, "comments": [{"body": "Friendly reminder that if you’re in it for the infinity squeeze buy shares in addition to calls. More shares in wsb hands mean less shares available to cover shorts.", "score": 94, "replies": [{"body": "Big brain right here", "score": 28, "replies": []}, {"body": "This is actually big dick genius. If everyone reading this bought 100 shares...", "score": 20, "replies": []}, {"body": "You gotta put a limit order on them so they can’t be borrowed tho", "score": 2, "replies": []}]}, {"body": "This will be a winner with or without Cohen because it is an undervalued cyclical at the beginning of a cycle. However, we have Cohen and I expect him to stick around one way or another. \n\nAnyone that doesn't at least have some GME shares let alone calls is gay and retarded", "score": 29, "replies": [{"body": "Yea Cohen is just a really really nice bonus. Also if he buys out GME it’s mega squeeze time", "score": 11, "replies": [{"body": "Without a squeeze scenario where tons of covering is done in a short span, I still expect us to be at a minimum of $20 by the end of spring. \n\nWith a hostile takeover or even just rumors of a hostile takeover... we go up... fast. I imagine management directs profit towards paying off debt early, but buybacks would also potentially get the ball rolling on a squeeze.\n\nHere on out while I play this, I plan to buy at least 1 share each time I buy a call. Everyone should help and grab even just a handful of shares even if they are buying calls. We need to shrink the float.", "score": 17, "replies": [{"body": "With a hostile takeover we have no ceiling, shorts would be forced to cover, at massive losses, KBIO is the only thing somewhat similar to GME, and KBIO went up 10,000%, and was 70% short", "score": 8, "replies": [{"body": "The ideal scenario is if multiple suitors emerge to fight over control of GME... if they bid each other up then watch out, we moon. I'd love for buybacks to happen before a potential takeover, lower the float even more... the buyback of 33% of the shares a year ago was amazing for making this possible. Probably is what got the attention of u/deepfuckingvalue", "score": 10, "replies": [{"body": "A bid war would be amazing", "score": 4, "replies": [{"body": "Don't bet on it, but back in its glory if it happens. \n\nI'm loaded up on calls and there's a decent chance we open at $15 tomorrow. If it does indeed happen, I expect IV to be wild and since I already own calls and wouldn't mind more shares, I might sell slightly ITM puts", "score": 5, "replies": [{"body": "Yea I doubt we see a bid war. I also believe we will break 15 tmrw morning. I currently have shares and January 15th 30c. In the case of a tender offer, I could see us hitting 500 at the peak, However it really has no ceiling, since GME is unique to itself. This is only in the case of forced coverings", "score": 4, "replies": [{"body": "I have some weekly's but most of my position is Jan and Apr $10, $15, and $20 calls. Theta might start eating your asshole on those 30c's after this week unless we get into the 20's. After earnings, theta will start hitting January calls hard imo. Other than weeklies, I'm only buying Apr calls. And will do Jan 2022 calls once we hit the new year. I'm considering selling OTM covered call spreads on my calls, so I win if we go even or go up", "score": 2, "replies": [{"body": "yea theta will hurt me, but I’m betting on Cohen offer right after earnings. So it all really depends on what happens after earnings, the weeks before won’t make too much of a difference", "score": 3, "replies": [{"body": "Give yourself time to be right", "score": 2, "replies": [{"body": "yea I might roll out to april", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Can anyone give me advice on what percent to plug into my trailing stop loss to acquire maximum gains without accidentally selling early in anticipation of this big squeeze?", "score": 1, "replies": []}]}]}]}]}, {"body": "All Cohen has to do is shrug when asked about GME leadership and our shit will print. Need something, these psycho shorts didn’t even cover at the ATH\n\n🕹💦", "score": 28, "replies": [{"body": "Worse yet they're shorting even more 😂\n\nThese short sellers are like lambs to the slaughter", "score": 11, "replies": []}]}, {"body": "Dude, I've been thinking of buying a Palantir, but I think they already know that.", "score": 19, "replies": [{"body": "They knew I bought a Palantir before I even bought the Palantir. It drives very smooth tho. I like the feature where it has cameras spying on me in the car", "score": 21, "replies": [{"body": "Get the Corinthian Leather option.\n\nThe microphones can’t tell if you’re shifting your weight or farting.", "score": 10, "replies": []}]}]}, {"body": "most people here dont even realize the short squeeze would be over 1000usd", "score": 16, "replies": [{"body": "1000 is a lot but it technically could hit that briefly, I was thinking more 300-400 but it could very well go higher. It has no ceiling", "score": 15, "replies": [{"body": "Sauce?", "score": 8, "replies": [{"body": "150% short. Every short will have to start covering + retail + mms hedging. Float is low and shorts will have to buy at the highest bid to cover. OSTK went from 15-130 and not all shorts covered I believe, it was 70% short", "score": 10, "replies": [{"body": "For 300-400 to happen Ryan Cohen would have to randomly announce he acquired like a 50 percent stake, and he would have to recall his shares. A 50x move like that (like KBIO) would require more of the float to be locked up and randomly pulled. I think 40-50 is a more reasonable target in a squeeze.", "score": 10, "replies": [{"body": "And that’s exactly what he will do. Tender offer at 25-30. He wants GME badly and the current mgmt isn’t following what he wants to do. Cohen knows the potential of GME, he declined multiple offers to be a part of the board, he obviously wants to become CEO. Why would he wait longer than December to put out a tender offer? He’d want to take over during Q4 due to it being an extremely important quarter for GME. He also does not want to risk GME spiking during Christmas sales and vaccine approvals", "score": 8, "replies": [{"body": "He personally doesn’t have enough money for the whole company at 30 bucks a share, but maybe if he teams up with some of his rich friends. I don’t think he is a leveraged buyout type guy", "score": 4, "replies": [{"body": "True, I’d say low 20’s is more likely", "score": 2, "replies": [{"body": "Yeah it could hit 20 by eow lol, probably not. But 100 is not out of question. Ryan Cohen fuck shorts up by just lifting his finger right now and calling a proxy vote .", "score": 3, "replies": [{"body": "20 is a little high, I think we end out he week around 15-16 realistically. And yea if he calls for a vote and shares get called back shorts are straight fucked", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Any idea what option liquidity would be like? I assume brokers would only put in market buys for shares.", "score": 3, "replies": [{"body": "Options liquidity would be weird. Not really sure", "score": 6, "replies": []}]}, {"body": "where did you find the percentage? i thought it was 130 previously?", "score": 1, "replies": []}]}]}, {"body": "I will have what this guy is on...", "score": 3, "replies": []}, {"body": "Damn that’s a good prediction, 70 days later and it’s right on the dot", "score": 2, "replies": [{"body": "Insane, I did not expect to get it right. I thought it would hit 300-400 for all the different reasons but I guess it got their either way", "score": 2, "replies": []}]}, {"body": "1000 is a conservative estimate... with short interest and institutional ownership this high, we are looking at 10.000 - 20.000 per share albeit briefly.", "score": 2, "replies": [{"body": "1.3 Trillion market cap are you fucking retarded???", "score": 16, "replies": [{"body": "Well, that's a short squeeze for you... could go up to over 2 trillion for a few minutes, depending on the intensity. Maybe 3 trillion max.", "score": 2, "replies": []}]}, {"body": "Lol that’s a little much, 1000 should be the absolute ceiling", "score": 8, "replies": [{"body": "How do you capture gains if it pops?  Do you set a sell trade for 1 week with a limit with a high stock price, say $100?  and then reset each week?  I'll probably miss the boat while I'm stuck on a conference call...", "score": 2, "replies": [{"body": "I hold through it all, my most recent trade has been shares bought at 11.32 and January 30c calls bought at low 11’s. If your talking about a squeeze, I’ll probably sell whenever I feels right, or set a trailing stop loss idk", "score": 1, "replies": []}]}]}]}, {"body": "wdym briefly, like an hour?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "1000 I will wake up a millionaire, but I think 500 more realistic for the peak", "score": 2, "replies": []}]}]}]}, {"body": "calculations?", "score": 2, "replies": [{"body": "Volkswagen quintupled with like a tenth of the short interest. Back of the napkin.", "score": 7, "replies": [{"body": "Look at this guy with his napkins", "score": 7, "replies": [{"body": "fucking rich napkin guy am i right?", "score": 1, "replies": []}]}, {"body": "not even the front of the napkin", "score": 5, "replies": []}, {"body": "You need more room on your napkin: Volkswagen had max 5% floating shares..", "score": 3, "replies": []}]}]}]}, {"body": "Autistic enough, I'll throw my PS5 money here instead tomorrow", "score": 11, "replies": [{"body": "GME makes more on Xbox anyway no?", "score": 5, "replies": []}, {"body": "Buy a PS5 for yourself and all your friends soon enough. Smart move brother.", "score": 3, "replies": []}]}, {"body": "I bought 1k shares just to shrink the float. If it pops, cool. If not, oh well.", "score": 11, "replies": []}, {"body": "Have a shit ton of $30c 1/22 and 4/22 💰", "score": 8, "replies": []}, {"body": "I bought 4k worth of shares @~$12. If there is a short squeeze than I am gonna have a great time. If not no biggie either, there is literally no way GME doesn't reach 30 off the back of positive vaccine news, upcoming stimulus checks, and console refresh. All the Ryan Cohen stuff is just extra.", "score": 9, "replies": []}, {"body": "balllssss deeeep already", "score": 7, "replies": []}, {"body": "4th option is cohen actually pushes a vote to replace current ceo.  i think its reasonable to assume this would happen in 4Q earnings", "score": 7, "replies": [{"body": "Imo Cohen won’t waste time to become CEO. Q4 is crucial for GME and will contain console sales and shit. Current management could fuck it up and Cohen would likely want to take over as early as possible and force it", "score": 4, "replies": []}]}, {"body": "I don't know what the fuck I'm doing, quick somebody give me a straight price and an expiration date I need a yellow some money", "score": 7, "replies": [{"body": "BUY SHARES. Imagine your calls expiring and then the next day shit starts popping off. Don't be stupid, make dummy gains on shares instead. Plus every share you buy is a share thats not in the hands of a short seller trying to cover  their pasty ass", "score": 9, "replies": []}, {"body": "Well the safest options is April calls that are close to ITM. If you want to go all out yolo then January 15 30c but that’s very risky", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "January", "score": 3, "replies": []}]}, {"body": "Amen gonna buy some more shares so bears r fuk", "score": 7, "replies": []}, {"body": "So obviously this is going to have more liquidity than VW or KBIO, but the 137%short interest gets us at least a few days to cover?Tutes will dump some for sure but it makes me feel better that even the guy with a million in this stock only has 80k shares.", "score": 6, "replies": [{"body": "We really don’t know how many shares are in the public float rn. Hedge funds could have taken another chunk of the float but not filed yet, we just don’t know but yes it is probably more liquid. And yes it will be a few days long. Some shorts won’t even be able to cover day 1 Becuase of a fail to deliver shares to be bought by shorts, like I said the stock will be broken Becuase of these synthetic shares. Some ppl will dump but the coverings and retail will push it higher. Like I said, this situation is unique to itself", "score": 6, "replies": []}]}, {"body": "How long are you expecting the squeeze to go on for?", "score": 6, "replies": [{"body": "3-4 days", "score": 5, "replies": []}]}, {"body": "Just bought my first GME call 14$ 11/27. I feel good about it.", "score": 11, "replies": [{"body": "No, stupid autist!\n\nThe earnings will be at December!", "score": 28, "replies": [{"body": "Well fuck it let it ride", "score": 12, "replies": []}, {"body": "in December", "score": 3, "replies": []}]}, {"body": "Get sum shares and strap in for a long ride", "score": 7, "replies": []}]}, {"body": "Would you say to hold January calls through earnings then?", "score": 5, "replies": [{"body": "Could be a bit risky if Cohen doesn’t go through with the offer, but that’s what I’m doing, holding January calls past it, it’s rly up to you. I believe Cohen will offer after earnings", "score": 9, "replies": []}]}, {"body": "20c 1/15", "score": 4, "replies": []}, {"body": "will there be a drop to 13.60 ish or is she staying above $14", "score": 4, "replies": []}, {"body": "I got a metric fuck ton of Jan 30c", "score": 4, "replies": []}, {"body": "**I am a bot. Is this submission violating the [content guide](https://www.reddit.com/r/wallstreetbets/wiki/contentguide)? Vote below.**\n\n| **Remove It** | **Keep It** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=jztm6k&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=jztm6k&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=jztm6k)\n___\n ^comment ^will ^disappear ^--- ^0 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "score": 3, "replies": []}, {"body": "If Cohen makes an offer - squeeze? They would have to vote their shares?", "score": 3, "replies": [{"body": "If he makes an over at low 20’s, shorts will lose a fuck ton of money, many will cover, leading the big boys to cover, and so on. Chain reaction, no shorts will wait for the vote to finish. As soon as Cohen offers, share price will start the day at whatever the offer price was, and we will see mass coverings and buying, the vote will likely be a yes anyway but it’ll take a few weeks to finish I assume", "score": 5, "replies": []}]}, {"body": "Fucking balls fucking deep in GME. Save me gaming gods", "score": 3, "replies": []}, {"body": "I’m not selling to Cohen", "score": 3, "replies": [{"body": "Me neither, but I’m sure multiple institutions with big stakes will gladly sell to him at a 100% gain", "score": 3, "replies": []}]}, {"body": "Lot of pumping on this one lately", "score": -5, "replies": [{"body": "Nothing compared to the pumping on these shitty EV stocks", "score": 11, "replies": [{"body": "PLTR is the one getting flooded.", "score": 7, "replies": []}]}]}, {"body": "I may be autistic but definitely not autistic enough to buy GME", "score": -6, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Actually kind of funny people down voted me hahaha why do u think ps5 has one without a disc reader because gamestop is going extinct hahahah no one fucking goes outside any more", "score": -1, "replies": []}]}]}]}
