{"title": "What happens when $PLTR meets $FB and $TSLA?", "selftext": "So Palantir makes all their money by working with very large and complicated data sets. You follow me?\n\nThe fact is, they're the best and the brightest in the world and that's why the US government hires them to do their security and surveillance data work.\n\nNow some see their connection to the government as bad. People are saying Palantir's future is shakey, because they rely solely on government contracts. How are they going to do anything other than work with the US government?\n\nWhere could they possibly get access to huge sets of data outside of their friends at the pentagon? There just aren't that many billion dollar database factories looking for AI vendors.\n\nOh my, what a pickle indeed.\n\nWell it just so happens that the co-founder Peter Thiel is on the Facebook Board of Directors: [https://investor.fb.com/corporate-governance/default.aspx](https://investor.fb.com/corporate-governance/default.aspx)\n\nWhich also happens to be the company that is building up the largest personal and behavioral information database on the planet. Coincidence?\n\nMaybe Zuckerberg just recruited him because of his taste in memes? Who knows.\n\nOh and don't forget, Thiel worked with Musk at PayPal. Word is, these guys are still BFF's. And we all know everything connected to Elon Musk goes to the moon.\n\nEven better, Thiel was one of the start up investors of SpaceX. The company which seems to be on track to have the entire planet connected to their satellite internet service.\n\nNot to mention - THEY ARE NAMED AFTER LORD OF THE EFFING RINGS!\n\nI am literally all in on Palantir shares. X shares at 9.70.\n\nEdit: Oh and it turns out both the cofounders, Peter Thiel and Alex Karp, are on the steering committee for the Bilderberg group. Palantir global takeover confirmed.\n\nhttps://www.bilderbergmeetings.org/background/steering-committee/steering-committee", "id": "j2z42o", "created_utc": 1601515625.0, "score": 56, "upvote_ratio": 0.8, "num_comments": 75, "comments": [{"body": "Buying some plantain chips tomorrow", "score": 64, "replies": []}, {"body": "8,000 shares and I’m hoping your post blesses my shares with many, many green lines instead of the red ones.", "score": 30, "replies": [{"body": "Bro how fucking rich are you to YOLO 80 fucking thousand on one stock that hasn't even proven itself yet\nAnd I thought my 20 shares was a lot", "score": 13, "replies": [{"body": "Lmao right. I bought 2 :)", "score": 9, "replies": []}, {"body": "I heard someone around here say stocks always go up", "score": 6, "replies": []}, {"body": "Probably more like 30k with margin lol", "score": 2, "replies": []}]}, {"body": "8000! lol dude.", "score": 8, "replies": []}, {"body": "Gotcha, bought 35420.69", "score": 4, "replies": [{"body": "69 nice", "score": 1, "replies": []}]}, {"body": "You still holding those 8000 shares?", "score": 3, "replies": [{"body": "Currently at 6000, sold a few to help buy a truck lol. Will hold the rest for the foreseeable future though. Feelin’ comfy.", "score": 5, "replies": []}, {"body": "Came here to ask", "score": 1, "replies": []}]}, {"body": "Just checking in. How are you doing McDoogles?", "score": 2, "replies": [{"body": "I just discovered this post lol, I really hope he held till now", "score": 2, "replies": []}, {"body": "Sold covered calls at $13.50 before the boom. I've had better days lol.\n\nI'm jumping into Asana for a bit.\n\nLet's just say I've learned a lot of valuable lessons in the past two months.", "score": 1, "replies": [{"body": "Brutal dude. I am sorry to hear you lost faith.", "score": 1, "replies": []}]}]}, {"body": "I guess he did... Palantir the Palantir", "score": 1, "replies": []}]}, {"body": "Got 1000 shares. I guess I just don't want it to dump too hard so I can sell calls", "score": 20, "replies": [{"body": "1000 shares with you", "score": 1, "replies": []}, {"body": "Can I have some?", "score": 1, "replies": [{"body": "You can buy them for cheaper than I did right now", "score": 2, "replies": []}]}]}, {"body": "I finally convinced my girlfriend to delete Facebook today, so I’d buy puts.", "score": 32, "replies": [{"body": "God bless you, my son.", "score": 13, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "WhatsApp, another FB company, don't buy puts", "score": 3, "replies": []}]}]}, {"body": "Asana ipo was also today and the ceo is Co-founder of Facebook.", "score": 11, "replies": [{"body": "I don't have any money left to invest jalapeno man.", "score": 26, "replies": [{"body": "Welp lets hope Pltr works out. I’m 200 shares with you along the ride", "score": 12, "replies": []}]}, {"body": "You mean the idiot that got diluted out of the equity position of the century?\n\nYeah... not a good thing to have on your resume or corporate board.", "score": 3, "replies": [{"body": "Are you talking about Eduardo? This is Moskovitz's company.", "score": 6, "replies": []}, {"body": "Profit is profit", "score": 2, "replies": []}, {"body": "Yeah, that guy", "score": 0, "replies": []}]}]}, {"body": "I'm a retard who didn't do any research and my only question is why does anyone need Palantir for data collection when Google, Facebook and Amazon exist?", "score": 4, "replies": [{"body": "They do not collect data. They process and analyze other people's data.", "score": 22, "replies": [{"body": "thanks for the explanation  \nmight buy some and start selling covered calls", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "im a little late, but theres a huuuge shortage of data scientists out there. its not that they arent hiring the science guys, its that they cant, because there arent enough to go around", "score": 1, "replies": []}]}, {"body": "I’ve read that the main reason the government uses them to analyze data legally since they can’t do it themselves? Is this not something that the big tech companies can do themselves?", "score": 0, "replies": []}]}, {"body": "Basically it comes down to legal and illegal ways of capturing data and what you can do with it palantir is a private organization which doesn’t fall under the government data protection of consumers(ie government needs evidence, private organizations just need money) the government uses the services of PLTR to get evidence in a what would be illegal way, but it’s not, because a private org can sell its services to anyone. Their service uses data, the government can not,making it all good.\n\nThey fire house a shit load of data build out reports and give you what you want to a scary level of accuracy. You got on snapchat 2 hours ago it’ll find out who near you was on and find your relationship to the other user. \n\nAll in all it uses about 50 pieces of IP protected software and IP protected algo that straight fucks on anyone without worry of ethics or bias. \n\nBit of a fucked up explanation but what they do it’s pretty, wild I work at a MAGA and we use their services over having an intelligence team and correspondents.", "score": 11, "replies": [{"body": "you work at a what?", "score": 8, "replies": []}]}, {"body": "Palantir takes the controversial government contracts Google and Facebook do not want to get involved with.", "score": 4, "replies": []}]}, {"body": "Next time you DD maybe google the company?\n\nThey already make 46% revenue in the private sector with Palantir Foundry, for example for Merck. \n\nThat’s about half, if you’re not so strong with math.", "score": 5, "replies": []}, {"body": "I used Palantir when I was doing criminal tax investigations for NYC. This was in like 2013 and they gave us alot of support personnel to be able to make the most of it. We barely used 1% of what it can do. All of those support techs went on to get jobs at the best defense contractors in the world. it's legit and no way will govt or even private America ever go backwards on this type of analysis.\n\nThis post will be used in my indictment as found by Palantir. we are fucked.\n\nPos: 20 (I'm broke and stupid)", "score": 4, "replies": [{"body": "What exactly does the software look like? Is it like you just upload a huge ass file and automatically generates a fancy pants report or what?\n\nCan you say?", "score": 2, "replies": [{"body": "We were using it for relationship analysis. Spider web charting would appear linking various parties while at the same time giving a quick snapshot of other types of data that can intersect. \n\nIt requires quite a bit of manipulation on the users part, just like any analytical software. Like I said we barely scratched its capabilities, but from what I was told it was deployed extensively in Iraq/Afghanistan for intel.", "score": 1, "replies": []}]}, {"body": "Lol.", "score": 1, "replies": []}]}, {"body": "Shares? Shares!? Gtfo!!!", "score": 7, "replies": [{"body": "Options aren't even available yet.", "score": 8, "replies": []}, {"body": "Buddy, if I played options with the rest of you, I wouldn't have a pot to piss in with my luck.", "score": 10, "replies": []}, {"body": "LEAPs are so expensive.", "score": 1, "replies": []}]}, {"body": "Not quite the yolo, but I bought 200 shares. Trying to DCA my way into this one.", "score": 3, "replies": []}, {"body": "300 shares and holding here. Let’s. Go.", "score": 4, "replies": []}, {"body": "Nice write up.\n\nFew things to note.  Thiel is also an investor in SpaceX (fun fact).  Musk and Thiel are visionary autists just like us.\n\n2.  Many people hear Peter Thiel's name and automatically think because he donated to the GOP campaign in 2016 he's a friend of Trump.  But thats not necessarily true.  I dont think is a die hard Trump lover, Trump just so happened to be the candidate.  I think Thiel's position in 2016 was more so opposed to the opposition (crooked Hillary, her ring of criminals and kid diddler of a husband, Bill).\n\nIt goes deeper than that though.  Above all else, Peter is more concerned about not getting fucked over and overrun by China in the new arms race (artificial intelligence, and AI warfare).  He's really an intelligent and interesting person and i think he is one of the few people out there who has the country's(USA) best interest in mind.  I suggest you watch some of his interviews on YT or read his book.  But I digress.\n\nSo now that thats cleared up.  Yes Peter is a PLTR founder and I think board member still but he is not involved in the day to day show.  That would be Mr. CEO Alex Karp.  Which brings me to the point I am trying to make; the guy actually running the show and managing the company, Alex Karp, has vocally said **he does not like Trump** and is a libertarian.\n\nSo there you have it, just about all the employees and management at PLTR dont like Trump so stop associating the company with him.\n\nThe only thing Trump and Thiel might have in common is they use the same private security forces.  I swear the hive mind infects so many of you.", "score": 9, "replies": []}, {"body": "Puts on Bilbo Baggins", "score": 2, "replies": [{"body": "Too soon.  \n[https://www.npr.org/2020/06/19/880811998/actor-ian-holm-who-played-king-lear-to-bilbo-baggins-has-died](https://www.npr.org/2020/06/19/880811998/actor-ian-holm-who-played-king-lear-to-bilbo-baggins-has-died)", "score": 3, "replies": [{"body": "You mean too late.. Aka, priced in.", "score": 7, "replies": []}]}]}, {"body": "2641 at 9.99\n\nLong", "score": 2, "replies": []}, {"body": "Palantir? more like eye of sauron  \n\nedit: order for 9 stockaroonies sent", "score": 2, "replies": []}, {"body": "Palantir is apolitical.\n\nA little more than half of their work is government work as of this year.\n\nThiel has a degree in math and loves sci-fi. Is it any surprise that he's into tech heavy businesses?\n\n[Palantir](https://youtu.be/TBMiyEzOJmI?t=119) is elvish for far seeing stone. Appropriate given their work, I just was disappointed that level of creativity didn't carry over into their software names or the ticker.", "score": 2, "replies": [{"body": "As for the ticker: SPY is already taken", "score": 5, "replies": []}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/Troflecopter the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "What happens when a Snowflake falls and outperforms with your wife?", "score": 1, "replies": []}, {"body": "I think you’re 100% correct. This thing might take 5 years to blow up but it will. This is a “if you bought apple at ipo you’d be worth a trillion dollars now” stock. No doubt. $20 billion is chump change for a trillion dollar industry", "score": 1, "replies": []}, {"body": "> So Palantir makes all their money\n\nWhere is this money that you are writing about ?", "score": 1, "replies": [{"body": "You're missing the important point. This company had the opportunity to build the software for real life Skynet through USA military/security funding. They had to run at a loss for all those years of R&D, but the government kept it afloat. No one else is going to get that opportunity.", "score": 1, "replies": []}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/Troflecopter the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Now that I’m reading this post ! Holy shit", "score": 1, "replies": [{"body": "lol. You should google \"Palantir Tiberius\" and \"Palantir Project Maven\" and \"Palantir Avril Haines\" if you want to get a little more excited.", "score": 2, "replies": []}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/Troflecopter the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "> because these guys are tight with the Donald.\n\nPalantir *is* the \"DeEp StAtE\" that QAnon rails against on a daily basis.\n\n...or, you know... maybe TrumpTards have been [sold a bill of goods](https://idioms.thefreedictionary.com/sell+a+bill+of+goods).", "score": -5, "replies": [{"body": "The deep state runs the world bro.", "score": 3, "replies": [{"body": "It's a ratchet, not a pendulum... until it's neither, at which point it becomes a guillotine.", "score": 0, "replies": []}]}]}, {"body": "Same I just took a long haul position on Palantir. Bought 8 shares, but I bought them at 10.75 each yesterday, I think I should just sell off and cut my loses. I don’t get why I can never make money", "score": -2, "replies": [{"body": "This is why", "score": 1, "replies": []}, {"body": "8 shares and he’s freaking out? Smh. 8 shares!?!", "score": 1, "replies": []}, {"body": "I agree, this is why. Patience bud, youre up $36 today", "score": 1, "replies": [{"body": "I actually bought puts 11/13 $7p", "score": 1, "replies": []}]}]}]}
