{"title": "Expected moves for big tech earnings, AAPL, GOOGL, AMZN, MSFT, FB", "selftext": "[removed]", "id": "jgs6ah", "created_utc": 1603475772.0, "score": 157, "upvote_ratio": 0.96, "num_comments": 64, "comments": [{"body": "Let's be real, this has to be the bottom for AMZN right? Regardless of expected earnings, no company consistently puts out profit like Amazon and their numbers should be nothing less than spectacular. I want to double down here but I'm just a little nervous about the absolute clown market that we're in", "score": 33, "replies": [{"body": "If you are speculating amazon earnings I highly recommend looking into Ebay. They are basically discount amazon, they will do really well like amazon, but their expectations aren't nearly as high (in comparison). It moved 3% today and my calls printed, I sold the 10/30 exps I had and held 2 53.5C 11/20. Not too late to jump in either, today was just rebounding from the bad news earlier this week.", "score": 1, "replies": [{"body": "You’re forgetting the internet runs on AWS. It’s not an e-commerce play", "score": 22, "replies": []}, {"body": "Ebay is just trash. Unbelievable to compare it to Amazon. Didn't do anything last earnings and won't do anything on this one either.", "score": 13, "replies": [{"body": "I used to think the exact same thing. Remember Meg Whitman? sure when she was the CEO Ebay was a dumpster fire, she moved onto quibi which was a total failure as well. Ebay has a really solid business plan now, especially their newer CEOs. With their expected Q3 earnings, it would put them at a growth of 28.4% from last year's numbers. That's not even considering the fact that this eps estimate is lower than last quarter.", "score": 1, "replies": []}]}, {"body": "Comparing a moped to a race car", "score": 1, "replies": []}]}]}, {"body": "seems about right, MSFT always moves very little after earnings", "score": 41, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "[deleted]", "score": 25, "replies": [{"body": "If that's long term I'd start shifting to google in the next 5 to 10 years. The younger crowd is going google, nobody is going to want to pay $10/mo or over $100 upfront  for office 365 when they can get it for free + cloud in a web browser. Now, Microsoft still has a gaming console, but their number one customers are kids who already have one. That wouldn't be a problem for revenue if they tuckered out after a couple years or became obsolete, but that's not the case. An original xbox one can keep up with most titles today, and the original xbox 360 is still in some households aswell.", "score": -20, "replies": [{"body": "Yes because Office 365 for students and game console sales are totally Microsoft’s prime sources of revenue. Jesus...", "score": 17, "replies": []}, {"body": "Xbox 360 = Skate 2. Never will go extinct", "score": 1, "replies": []}, {"body": "You’re also forgetting that they optimized and wholesaled Microsoft teams which killed it in global sales. They also provide software and cloud consulting services. Removing all physical stores was a strategic plan to build cash into their expansive acquisitions of other companies to optimize their global services. Don’t get me wrong Google is a growth stock but they vary in what they both do. At the price point for stock traders it’s reasonable.", "score": 1, "replies": []}, {"body": "Office is a cash cow, yes, and they've morphed it quite nicely to a subscription model.\n\nConsumer products like xbox are a nice add on, but by no means msft strength.\n\nYou're entirely missing the billions and billions of dollars that other very large corporations spend on server licenses, application licenses, azure services (growth outpacing AWS at this point, I believe), Microsoft is dominant in the world of commerce.\n\nNobody cares what a college kid is using to write a term paper.", "score": 1, "replies": []}]}]}]}, {"body": "I will be careful with Microsoft. Intel reported dismal data center sales. That does not sound good for Azure and AWS.", "score": -9, "replies": [{"body": "No chance. MS is a part of every cloud deal on all platforms everywhere. What it loses on cloud it makes up in licensing.", "score": 6, "replies": []}, {"body": "Azure licensing and usage revenue doesn't care if it's an Intel chip or AMD.  Intel got their ass handed to them by AMD.", "score": 1, "replies": []}]}]}, {"body": "Stock either goes up or down, this is some insider trading level shit man", "score": 21, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Usually when you have a strangle, too!", "score": 5, "replies": []}]}, {"body": "SEC, open up!", "score": 1, "replies": []}]}, {"body": "MSFT seems like a good Target for an iron condor..I'm running one right now...thinking about picking up a few more soon", "score": 5, "replies": [{"body": "What was your setup?", "score": 5, "replies": [{"body": "http://opcalc.com/g9b\n\nIt was a slightly bearish position when I opened it, but MSFT sank a bit recently so now I'm in a sweet spot.\n\nI can take profit at any point right now, but I think this one should be good til expiry", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -29, "replies": [{"body": "Wtf does Gates have to do with Microsoft anymore?", "score": 13, "replies": [{"body": "[deleted]", "score": -15, "replies": [{"body": "Are you on crack?", "score": 14, "replies": []}, {"body": "Based.", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "OP said \"big tech\" :-)", "score": 17, "replies": [{"body": "Ha! Yes, will do a more extensive list on Sunday or Monday.", "score": 5, "replies": []}, {"body": "Spotify, Snap and another one will be there sooner rather than later 😉", "score": 2, "replies": [{"body": "And ahead of those guys are fintechs like PYPL and SQ.\n\nI do think investors looking for the next 10x growth stock have to look at these names we list, rather than FAANG.  It'll take a lot for an AAPL or AMZN to double so I expect growth to slow in the FAANG stocks.", "score": 3, "replies": [{"body": "Agreed on the second part though I'm not a fan of Schulman or Dorsey. Lackluster stewardship imo. Stripe on the other hand...", "score": 2, "replies": [{"body": "And that’s my hope for a PSTH partner :-)", "score": 3, "replies": [{"body": "Shhhh 😂", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "PSTH is a SPAC that is lead by Bill Ackman, recently famous for making (IIRC) a 10-bagger bet that COVID would crash markets and making over a billion for his hedge fund as a result.  No merger target had been announced but rumors are swirling. \n\nThere are dozens of SPACs, but few lead by someone with the experience of Ackman.  So many of us bought PSTH shares in anticipation of a great company.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "This doesn't seem right.  Did you get the expected move for a specific date and just draw a line through todays price to it? Vol isn't linear like this.  The expected move in 1 month isn't just the 7 day expectation \\* some scalar.  It's completely nonlinear.\n\nIt sounds like I'm saying \"well achtuuuaalllyyy\"... but I'm trying to say good job but keep the above in mind.", "score": 4, "replies": [{"body": "Ha! I appreciate it. It's linear between data points, and those data points are the actual options at each expiration. You'll see it clearly when there's a large difference in IV between expirations, check out this BIIB chart where vol is much lower for their recent earnings than for their FDA news in Nov: [https://twitter.com/Options\\_Eye/status/1318244098910920705](https://twitter.com/Options_Eye/status/1318244098910920705)", "score": 1, "replies": []}]}, {"body": "I lost my butt on Thursday with an AMZN call. It can’t keep going down, right? So Friday I bought a put. Almost made back my losses. It’s so crazy how much you can PL in 30 minutes after the market opens. According to your bears and bulls prediction, it’s a coin toss. Better odds than roulette, I guess.", "score": 4, "replies": [{"body": "Do yourself a favor and don't buy anymore options until you understand at least 3 ways in which what you just wrote is stupid.", "score": 0, "replies": []}, {"body": "Do you guys use the term \"ghetto spread\" to describe that move? Just curious because I was a bit taken aback to see it reading urban dictionary recently.\n\nI take it \"PL\" means price-lock?", "score": 1, "replies": [{"body": "PL is profit loss", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Ne yoo bro", "score": 1, "replies": []}]}, {"body": "Facebook should go up quite a bit and hit new ATH. MSFT will have good results but not sure about stock moment. AAPL could go either way. If Q4 forecast is much better than analyst projects there is a chance. I am more optimistic about their Q1 2021 when entire iphone 12s will be ramped up and selling like hotcakes duet to folks moving to 5g phone and attraction of small form factor iphone mini. I am slightly pessimistic about GOOGL and AMZN. Dont have any specific reasons but let us see how things go.", "score": 2, "replies": []}, {"body": "Amzn has been a slow moving downward sloth.", "score": 2, "replies": []}, {"body": "Msft will drop", "score": 1, "replies": []}, {"body": "Could you help me understand the math because I’m a little confused.\n\nIt sounds like you’ll readjust the bounds each day to match your 70% accuracy, but investments on day 0 can’t carry that forward. I don’t understand the upper bounds and lower bounds and what the expected take away is from this analysis.\n\nTl;dr - it seems like you just said stocks will move up or down on a daily basis and it’s equally probably they will move up or down (as defined by your corridors)  ¯\\_(ツ)_/¯  - Or did you just plot Bollinger Bands... Would love to understand what I’m missing so thanks in advance.", "score": 1, "replies": [{"body": "Pretty sure he is just showing the ATM options cost for the closet expiration to earnings.", "score": 1, "replies": []}]}, {"body": "Dude I need MSFT on steroids next week..... holding Nov 20th calls (240 strike)", "score": 1, "replies": [{"body": "I have 220s same expy and I'm nervous", "score": 1, "replies": []}, {"body": "Ouch.. 240 plus your premium in a month?  Not seeing it", "score": 1, "replies": []}]}, {"body": "Definitely think Apple will drop", "score": -14, "replies": [{"body": "Why", "score": 5, "replies": [{"body": "Our useless government extending their stimulus time table every fucking day. At this point I assume they are just saying “it’s coming soon” to prevent the stock market from crashing.", "score": -11, "replies": []}, {"body": "Looking at their earnings reports passed quarters, it doesn’t even matter if they do good or not it just commonly happens.\n\nAlso I know a ton of people who used the stimulus to buy the iPhone 11 months after it was launched. With no stimulus and no reason to buy a new phone after only having an 11 for 6-7 months, there is no reason for an “upgrade”. The iPhone 12 is merely all upgradable specs, and idiots don’t care about specs if the phone looks the same", "score": -14, "replies": [{"body": ">\tAlso I know a ton of people who\n\nThe plural of anecdote is not data.", "score": 11, "replies": [{"body": "Dati", "score": -2, "replies": [{"body": "Data is plural, datum is singular", "score": 5, "replies": [{"body": "he was calling you daddy but with an invoiced consonant for the second syllable :)", "score": 2, "replies": []}, {"body": "Los datan", "score": 0, "replies": []}, {"body": "Datathen", "score": -1, "replies": []}]}]}]}]}]}]}, {"body": "So what are the spread plays to make?", "score": 1, "replies": []}, {"body": "Pretty cool", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Ultimately you have to decide on what you believe the outlook is, then set up the wings to match that expectation.", "score": 1, "replies": []}]}, {"body": "What about little tech associations with big tech. EMAN is looking hot right now", "score": 1, "replies": [{"body": "What do you like about EMAN? Didn’t they have a reverse split?", "score": 1, "replies": [{"body": "I did a bit of digging and there was talk of it last October but it doesn't look like they went through with it. The govt contract they gained really put them back in a better position. They have been talking about being contracted by a tier 1 company but havnt disclosed who. rumor was that it was apple but with Sony being their distributor for oleds that's a bust. Its Its currently rallying going into earnings on speculation it will name the company.  someone like Facebook or even licensing their tech to Sony to produce their ultra high resolution OLED for apple could mean a lot for their year over year revenue. they already showed that they are making money, but more never hurts", "score": 1, "replies": []}]}]}, {"body": "So in other words trade SPY 🤪", "score": 1, "replies": []}]}
{"title": "Just snooped on my BF's e-trade account. Can someone explain to me how he's losing all our money?", "selftext": "My BF discovered options about a month ago, and I don't think he understands how they work. I don't understand them either. I just know he's lost A LOT.\n\nI'm snooping his transactions right now and this is the most recent:\n\nOn 10/20 he bought 2 TSLA call options contracts (?) at $422.50. One cost 1807.51 and the other cost 1809.51. So that adds up to 3617.02 right? Today he sold both contracts when TSLA was around $432 and made 2950.90. So he lost 666.12. Did he misunderstand options or am I the one misunderstanding?\n\nHe's still holding call options for Tesla. One at $440 that he paid $2,082 for and one for $450 that he paid $2,465 for. They expire tomorrow. Are we about to lose another $4500?\n\nThanks in advance!\n\nUPDATE: I just explained to him that strike price isn’t the price where you start making money. He is not amused by my overnight knowledge of options. Thank you to the people who actually took the time to explain things to me!", "id": "jggb0x", "created_utc": 1603428093.0, "score": 42, "upvote_ratio": 0.76, "num_comments": 70, "comments": [{"body": "You acting like your gf posting to this sub is worse than your actual trades.", "score": 175, "replies": [{"body": "Just assumed they were gay", "score": 36, "replies": [{"body": "either way the GF has a cock", "score": 7, "replies": []}, {"body": "This", "score": 6, "replies": []}]}, {"body": "Right? No gf picks up your phone and speaks like this. She’ll have a new boyfriend in no time now if she doesn’t already", "score": 9, "replies": []}]}, {"body": "Hes lying to you because he is in denial that he's losing money.\n\nKeep him.", "score": 44, "replies": [{"body": "that hit home", "score": 3, "replies": []}]}, {"body": "BF = OP", "score": 42, "replies": []}, {"body": "Boyfriend = \" our money \" lolz\n\nMy wife laughs at my loss porn while she is steady gains... and her and steve still wont shut the fuck up when they are upstairs. /sigh", "score": 30, "replies": [{"body": "Steve is always so fucking smug.", "score": 10, "replies": []}]}, {"body": "My wife doesn’t bother me about it since I told her if she complained about my losing ones I would keep my winning ones all to myself. Now she’s convinced I’m hiding money somewhere. Which I am.", "score": 25, "replies": []}, {"body": "This sounds like an elaborate way to ask the WSB magic 8 ball if your ~~boyfriends~~ positions are gonna print.", "score": 25, "replies": []}, {"body": "Yea you guys are going to lose quite a bit unless Tesla moves higher. For the first one Tesla will need to be $460 to break even. The second one Tesla needs to go to 474 to break even. If Tesla ends below $440 tomorrow you will lose the $4500. You can always sell anytime during the day for some portion back. \n\nHe would have been better keeping the 2 options that he sold as they would have broke even and in the money if Tesla is above $440", "score": 18, "replies": [{"body": "Thank you for this helpful answer!!", "score": 2, "replies": [{"body": "There was a recall on their vehicles. Rest in pepperonis.", "score": 4, "replies": []}, {"body": "Good luck! Who knows what Tesla does. It could pop to $480 and you guys make $2.5k", "score": 0, "replies": []}, {"body": "Ouch!! He needs to stay away from Tesla", "score": 1, "replies": []}]}, {"body": "Bruh she didn’t even give the expiration date. That could have been today and it probably was.", "score": -2, "replies": [{"body": "They expire today 10/23. I posted this last night and said that they will expire tomorrow.", "score": 6, "replies": [{"body": "Sorry missed that sentence and forgot it was Thursday. Sorry your boyfriend has a gambling problem.", "score": 1, "replies": []}]}]}]}, {"body": "Holy shit. This dude is pretending to be his gf.", "score": 12, "replies": []}, {"body": "“Our” money lol. It’s his money so let him lose it as he pleases...and why is he leaving his laptop open in the kitchen? \n\nEdit: Since you’re already snooping, post a pic of the loss porn plz. He sounds like a priemo autist", "score": 20, "replies": [{"body": "We were living off our shared credit cards so we can put our cash in his e trade account. Guess I’m the autist for trying to help him fulfill his dream of becoming a day trader?", "score": 21, "replies": [{"body": "[deleted]", "score": 45, "replies": [{"body": "Fuck that’s funny", "score": 11, "replies": []}, {"body": "I wouldn’t be surprised if this is actually what happens to aspiring pro poker players lol", "score": 5, "replies": []}, {"body": "Right?! I felt like he was doing good until he got obsessive about making it over the PDT rule and figured options would get him there fast.", "score": 10, "replies": []}, {"body": "You need to double up your bankroll before you get your poker chips. That way you're playing with house money.", "score": 1, "replies": []}]}, {"body": "Yes Kaitlyn you are.", "score": 10, "replies": [{"body": "Ugh it’s all hitting me now 🤣😭", "score": 8, "replies": [{"body": "Welcome home :)", "score": 4, "replies": [{"body": "I’m assuming my new role of autist by proxy", "score": 3, "replies": []}]}]}]}, {"body": "You’re joking right? If not you both need to stay away from trading... wow. Stick to target fate funds...", "score": 2, "replies": []}, {"body": "If he truly aspires to be a day trader he should get a job in the industry rather than trying to self teach at home.  He’s gonna get destroyed by professional traders who hunt rookies like him.", "score": 2, "replies": []}, {"body": "Living off shared credit cards. You are the autist.", "score": 1, "replies": []}]}]}, {"body": "Karen, this is a Casino in a Wendy’s.", "score": 8, "replies": []}, {"body": "You gay bro", "score": 6, "replies": []}, {"body": "I assume you have a bigger dick than your boyfriend.", "score": 5, "replies": []}, {"body": "Dump him and go get a real autist", "score": 4, "replies": []}, {"body": "Not one person commenting on her post history or making sure she is real, seems like she isn’t trolling. \n\nOne way or another leaving this here to read the fall out", "score": 4, "replies": [{"body": "No. Comments check out.\n\nShe's short, a bit on the heavy side, fighting weight loss. Watches a ton of tv. Huge RGB fan (not the pcmaster race variety, the deceased supreme court justice.\n\nAlso a recovering alcoholic liberal living in Whale's Vagina (San Diego) California who just stopped wasting money on HBO Max. While this is the first time she's donated to a political party, she is donating to Harrison out of South Carolina, so either roots and friends there or a super hard hate boner for Lindsey Graham.\n\nShe's older than most of the young pups here as she discovered Oral sex from Bill Clinton (could pizzagate be a thing?), in the 90s. Probably also has issues of understanding 'is'.\n\nYep. Bit of a mess. Although, good God, can't imagine the shit that could be pieced together from all the shit I get up to.", "score": 6, "replies": [{"body": "I tip my e-stalker hat to you sir. Waaaay deeper than I went", "score": 4, "replies": [{"body": "I'm a fast reader.", "score": 2, "replies": [{"body": "Do you have more analyses of random internet folks? I’d enjoy reading some more commentary Hahahah or just a good roast", "score": 2, "replies": [{"body": "It's a first. Maybe in the future, when more snooping outsiders show up crying about their gf/bf/spouse/fuck puppet's monetary antics.", "score": 1, "replies": []}]}]}]}, {"body": "Ew this is the weirdest description of me. Thanks I hate myself now 😂", "score": 4, "replies": []}]}]}, {"body": "These are the people that make me believe in myself", "score": 3, "replies": []}, {"body": "Aaaannnnddddd iitttssss goonneeee", "score": 3, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Theta and volatility will make breakeven closer to 455ish, so unless it pumps tomorrow probably going to be a loss.", "score": 3, "replies": [{"body": "First one needs 460.82 for breakeven by end of day tomorrow. Second one needs 474.65. Idk where you're getting 455 from. They probably wouldn't even get back close to half the money spent even if it opened at 455 and they sell the contracts immediately.", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Yea, I may have been off too. If it opens at 455, they may be able to get half back at open since they'd be about $2k value above strike on both combined. With the little time remaining, maybe they could get another hundred or two on top. I'd be less unhappy if I were them if I only lost half instead of almost all of it.", "score": 2, "replies": []}]}, {"body": "How did you get these numbers?", "score": 1, "replies": [{"body": "Take price paid for the contract and divide by 100. That’s the price per share the contract costs. Add that number to the strike price and you have your break even.", "score": 2, "replies": [{"body": "That makes sense! Thank you!!", "score": 1, "replies": []}]}]}]}]}, {"body": "If it jumps $25 tomorrow he might come close to breaking even", "score": 1, "replies": []}]}, {"body": "Bitch go make me a sandwich 🥪", "score": -10, "replies": [{"body": "This !", "score": -2, "replies": []}]}, {"body": "Holy shit.", "score": -1, "replies": []}, {"body": "Fuck me and earn it back", "score": -2, "replies": []}, {"body": "My guess would be these are call spreads, with one buy and one sell? So actual amount at risk would be like $400 (the difference between the two contracts).\n\nGotta take a screenshot though to see exactly what was purchased.", "score": 1, "replies": [{"body": "I can't take a screenshot but they both say \"bought to open.\" What would indicate a call spread? God I hope you're right!!", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "No negative numbers. Ugh. Thanks for the explanation tho!", "score": 1, "replies": []}]}]}]}, {"body": "there are plenty of retarded virgins here if you need a new boyfriend", "score": 1, "replies": []}, {"body": "Nice joke man", "score": 1, "replies": []}, {"body": "Theta will be his new bitch!", "score": 1, "replies": []}, {"body": "FAKE. RETARDS HAVE NO GIRLFRIENDS", "score": 1, "replies": []}, {"body": "Make him watch tasty trade videos. Clearly he doesn’t understand options as well as he thinks", "score": 1, "replies": []}, {"body": "The better question is why the fuck are you sharing your bank account with someone you're not married to lol", "score": 1, "replies": [{"body": "We’ve been together six years, we live together...", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "jgyl4b", "created_utc": 1603496653.0, "score": 131, "upvote_ratio": 0.91, "num_comments": 75, "comments": [{"body": "Gotta have money to make money. Wish I could afford 100 shares of TSLA", "score": 90, "replies": [{"body": "400 shares and enough buying power to cover selling 6 puts. Dudes loaded as fuck this is like posting pictures of pennies", "score": 90, "replies": [{"body": "And still uses Robinhood he is rich but still autistic AF", "score": 44, "replies": [{"body": "For real", "score": 5, "replies": [{"body": "Being rich and spending time on reddit indicates high levels of autism", "score": 6, "replies": [{"body": "What would indicate the opposite? You’ve gotta spend your time somewhere.", "score": 3, "replies": [{"body": "19th century opium dens are the coolest", "score": 2, "replies": [{"body": "Hmm Interesting, I’ll check one out if I ever stumble upon one.", "score": 2, "replies": [{"body": "You need to look for them", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Real.. that's what us option sellers **don't** wanna show you.. how much money it takes to make that money... Realistically he's getting a few % return on notional.. which is still damn good for a week, but it's still akin to the \"picking up pennies in front of steamroller\" analogy.", "score": 18, "replies": [{"body": "How am I picking up pennies infront of a steam roller ? If I get exercised on the puts I’ll just sell calls until I make my money back and get forced to sell shares at a profit lol", "score": 1, "replies": [{"body": "Risk adjusted return wise, it's akin to picking up pennies in front of steam roller.", "score": 1, "replies": [{"body": "I’m making 2% a week lmao I don’t think you understand. I made 240k doing this since last year. it’s not risky because there is very little room for me to lose money. I’m either buying stock at a discount or selling it above where I bought and getting paid premium both ways seems safer than just trading options that go to 0", "score": 2, "replies": [{"body": "Dude, i do the same fucking thing, i make 2-5%/week.. i fucking get it. Holy fuck.", "score": 1, "replies": [{"body": "Bruh then how are you calling it picking up pennies it’s 20 fucking grand lmaooo", "score": 1, "replies": [{"body": "Relative to fucking capital required to do it, and on a risk adjusted basis, that's exactly what it is.. same capital you can make 200 fucking grand buying those same options.. fuck me. Nobody gets it.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Here's me happy I sold 1 put and made a grand", "score": 9, "replies": []}, {"body": "Who said you need to cover?\n\n- Welfare recipient", "score": 1, "replies": []}]}, {"body": "If he used bullish put credit spreads instead of just selling cash secured puts he doesn't need the collateral to actually buy the 100 shares just the diff in the two strike prices. #themoreyouknow", "score": 10, "replies": [{"body": "SHHHHHHHHHHHHHHH", "score": 4, "replies": []}, {"body": "Why would he do that if he wants to own shares", "score": 1, "replies": [{"body": "If you want to own shares then you dont care about taking assignment which is even better when running the strategy of bullish put spreads", "score": 1, "replies": []}]}]}]}, {"body": "It takes one to know one ☝️", "score": 18, "replies": [{"body": "Got him!!!!!!!!!!!!", "score": 4, "replies": []}]}, {"body": "Good luck when it goes the other way.", "score": 9, "replies": []}, {"body": "You theatagang? It’s spooky Halloween. Oh no? Do we not have enough cash to do what you do? It’s a circle of life and I live on both sides", "score": 10, "replies": [{"body": "Poser cant even spell it right", "score": 1, "replies": [{"body": "Because I’m a looser", "score": 2, "replies": []}]}]}, {"body": "Don't count your tendies just yet..", "score": 3, "replies": []}, {"body": "I literally bought those puts. The fuck 😂", "score": 3, "replies": []}, {"body": "How much cash colateral ? What are the other legs of that trade?", "score": 7, "replies": [{"body": "They were probably both debit spreads and he lost a ton😂", "score": 9, "replies": [{"body": "Nah they were naked calls and puts", "score": -11, "replies": [{"body": "Honestly just messing with you bro, solid trades👌", "score": 6, "replies": []}, {"body": "How can they be naked but you had collateral for the puts and shares for the calls? Either you're lying or you're playing with almost half a mil and have no idea what the fuck you're doing", "score": 3, "replies": []}]}]}, {"body": "About 228,000 for the puts and 400 shares as collateral for the calls", "score": -16, "replies": [{"body": "That would make your puts and calls not naked dummy", "score": 59, "replies": [{"body": "Only retards have that much money to start with", "score": 7, "replies": []}]}, {"body": "This man is truly autistic and belongs here.  Clicking buttons and doesn’t know the fuck about anything.", "score": 20, "replies": [{"body": "His problem was calling us all idiots, he should have said he loves selling calls to us beautiful retards", "score": 2, "replies": []}]}, {"body": "? So you did have collateral bro. What the fuck are you talking about", "score": 15, "replies": []}, {"body": "This fuck tard doesnt even know what CSPs or CCs are. Nice flex retard", "score": 4, "replies": []}, {"body": "Risking 228k for 10k? I get it if it was MSFT that hasn’t moved in 3 months but TSLA is an autistic child that swings wildly. Then again I don’t have the balls to “invest” 228k so I’m a retard.", "score": 3, "replies": [{"body": "Even if exercised he would just wheel it back. Who wouldn't want Tesla at 380?!", "score": 5, "replies": [{"body": "This is the correct answer. The amount of people who do not understand the wheel strategy is too damn high.", "score": 1, "replies": []}]}]}, {"body": "Lol you’re actually retarded, find out what naked options are", "score": 3, "replies": []}, {"body": "Nice bro", "score": 1, "replies": []}]}]}, {"body": "Cash to cover puts and the 400 shares to cover the calls. Only the puts are naked you beautiful special needs child.", "score": 2, "replies": [{"body": "The puts are not naked, they are cash covered. You said it yourself.\n\n&#x200B;\n\nGeez, this sub man...", "score": 2, "replies": [{"body": "That’s what I meant. Fuck I’m retarded. 🤷‍♂️", "score": 2, "replies": []}]}]}, {"body": "This isn’t a fortune retard", "score": 2, "replies": []}, {"body": "Fortune - I don't think that word means what you think it means.", "score": 2, "replies": []}, {"body": "It aint over yet. I got both those strikes and ima exercise early when we hit em both monday.", "score": 2, "replies": []}, {"body": "Congratulations on the gains!! What is this strategy!? You selling calls and holding 400 shares of Telsa as collateral?", "score": 2, "replies": [{"body": "Curious minds want to know!", "score": 1, "replies": []}]}, {"body": "What are your next moves?", "score": 0, "replies": [{"body": "I’ll post em as I go", "score": 1, "replies": []}]}, {"body": "gg wp", "score": 1, "replies": []}, {"body": "Good luck towards election. Tsla hit 330 a week post split. Political uncertainty makes for wild rides", "score": 1, "replies": []}, {"body": "How much margin to sell naked Tesla calls before earnings lmao? More than I got for sure", "score": 1, "replies": [{"body": "Even this retard is not that retarded to sell naked on tesla before earnings. They are covered calls", "score": 1, "replies": []}]}, {"body": "Spreads or those cash secured puts?", "score": 1, "replies": []}, {"body": "How much fucking money do you have that you can just sell calls like that", "score": 1, "replies": [{"body": "He could had shares to secure em", "score": 1, "replies": [{"body": "He’d need like 1000 shares for that but then again its possible", "score": 1, "replies": []}]}]}, {"body": "Okay retard question here. Am I correct to think that if you buy call or puts options, that you can sell those for a higher price once the demand for them rises? \n\nSay hypothetically you bought calls a week ago, and since that week the price has risen or fallen 0$. But the demand for the calls has risen. Does that mean you can sell your calls for a higher price? \n\nI have never traded options so excuses my retardness", "score": 1, "replies": [{"body": "The price might increase little because of iv increase but theta would have taken more out of it", "score": 2, "replies": []}, {"body": "Theta would eat away at the value without a move on the underlying. You can look at the mid points for the same strike with varying expirations to know how much is lost per week.  Demand could pick up ahead of some event but that would also be reflected in the underlying as well.", "score": 1, "replies": [{"body": "Thanks for the explanation!", "score": 1, "replies": []}]}]}, {"body": "how much buying power is needed for that?", "score": 1, "replies": []}, {"body": "compared to the collateral you put up to sell these this is fucking pocket change", "score": 1, "replies": [{"body": "240k a year is pocket change ? What are you a trust fund baby ?", "score": 1, "replies": [{"body": "if you make 240k a year then idk why you’re gloating on reddit lmfao", "score": 1, "replies": [{"body": "Quarantine, can’t go out and blow money. That’s why", "score": 1, "replies": []}]}]}]}, {"body": "U got a lot of cheddar in that Robinhood account in order to sell those options, make sure 2FA is on lol", "score": 1, "replies": []}]}
