{"title": "Here is a Market Recap for today Thursday, October 29, 2020. Please enjoy!", "selftext": "**PsychoMarket Recap - Thursday, October 29, 2020**\n\nStocks rose today, reversing course after being deep in the red the last two days. Market participants digested a record increase in third-quarter GDP for the US, a better-than-expected weekly unemployment report, new coronavirus restrictions in the US and Europe and a slew of corporate earnings for massive companies.\n\nThe Nasdaq (QQQ) rose 1.75% today, the best performing of the major indices. The S&P 500 (SPY) finished 1.05% up and the Dow Jones (DIA) finished 0.44%.\n\nAfter coming off one of the worst quarters in US history, the economy rebounded, growing at its fastest pace ever. Gross domestic product (GDP), a measure of the total goods and services produced from July to September of this year, expanded at a 33.1% annualized pace, according to the report by the Department of Commerce. The gain came after a 31.4% plunge in the second quarter and was better than the 32% estimate from economists surveyed by Dow Jones. The previous record was the post-World War II 16.7% surge in the first quarter of 1950.\n\nToday, the US Department of Commerce released its weekly unemployment report, showing that another 751,000 individuals filed initial jobless claims, better than the 770,000 estimated by analysts.  Continuing claims, which refer to individuals that are currently receiving unemployment benefits who filed for unemployment benefits at least two weeks ago, was 7.75 million, slightly better than the 7.77 million expected. According to Yahoo Finance, this report represents the ninth-straight week initial unemployment claims have remained below 1 million and continuing claims below 10 million, a key indicator that the economy is recovering, though not as fast as many would like.\n\nIn Europe, countries are still struggling to contain the recent surge in coronavirus infections. Both France and Germany announced renewed lockdowns spanning for about the next month, though the restrictions stopped short of the draconian measures announced earlier on during the pandemic. In the US, the seven-day average of daily new cases rose to a record 70,000 as of yesterday, according to data compiled by the Washington Post.\n\nOn the vaccine front, Dr. Anthony Fauci, the nation’s top infectious-disease expert, said he believed it would take until at least January for the U.S. Food and Drug Administration to authorize a COVID-19 vaccine. There are five companies (Johnson & Johnson (JNJ), Moderna (MRNA), Pfizer (PFE), Eli Lilly (ELY), and BioNTech (BNTX)) in the final stages of study for a coronavirus vaccine, with Pfizer Inc. and Moderna Inc. having fully enrolled their trials, Fauci said.\n\nSome analysts consider the recent pull-back in the stock market a healthy inevitability, given the strong rally that took many stocks to all-time highs earlier in the Month. Brad McMillan, chief investment officer for Commonwealth Financial Network, said in a note to clients, “Markets have been baking in a lot of optimism: that the pandemic was under control, that the economy was healing, and that things would be back to something approaching normal in 2021. Those assumptions were always optimistic, though, and what we are seeing now is a reality-based repricing. As such, this drop is both necessary and healthy. Markets should reflect the most likely future path, not the most optimistic, and that is where we are headed.”\n\n**Highlights**\n\n* Today is going to be a huge day in earnings:\n   * Amazon (AMZN) reported better-than-expected earnings.\n      * EPS of $12.37 vs $7.41 estimate\n      * Revenue of $96.1 billion vs $92.7 billion expected\n   * Apple (AAPL) reported better-than-expected earnings\n      * EPS of $0.73 vs $0.70 estimate\n      * Revenue of $64.7 billion vs $63.7 billion estimate.\n   * Alphabet (GOOG) reported better-than-expected earnings and went up 5% in after-hours\n      * EPS of $16.40 vs $11.42 expected\n      * Revenue of $38.01 billion vs $35.35 billion\n   * Facebook (FB) reported better than expected earnings.\n      * EPS of $2.71 vs $1.91 estimate\n      * Revenue of  $21.5 billion vs 19.6 billion estimate.\n      * Daily Active Users of 1.82 billion vs 1.78 billion expected\n   * Twitter (TWTR) missed user-growth expectations and as a result, the stock dropped 9% in after-hours.\n      * EPS of $0.19 cents vs $0.06 estimate\n      * Revenue of $936 million vs $777.15 million estimate\n      * Daily Active User of 187 million vs 195.2 million estimate\n* Disney (DIS) is closing its Disneyland Paris theme park at the end of the day as France initiates a fresh round of restrictions meant to curb a rising number of new Covid-19 cases.\n* Pinterest (PINS) exploded after beating-earnings up 26% at the time of writing\n* Pinterest (PINS) with several price target increases from Barclays, Wedbush, and Robert W. Baird with average price target of $68. Stock gapped up 30% after earnings yesterday\n* After the rally post-earnings report, $PINS rocketed up 35% adding $10 billion in market cap to a company that was valued at roughly that much when 2020 began. Crazy\n* The largest deal in luxury is back on after New York's famed jeweler Tiffany agreed to a slightly reduced offering price from LVMH in Paris. LVMH will now pay $131.50 for each Tiffany share putting the total price tag at $15.8 billion, down from the $16.2 billion that was first offered earlier this year.\n* Shopify (SHOP) destroyed earnings!\n   * EPS:  $1.13 vs $0.53 estimates (113% surprise!)\n   * Revenue: $767M vs $636\n* Penn National Gaming (PENN) with a pretty nice surprise. Stock opened around 5% higher but lost the gains throughout the session. Stock has been pulling back stteply since hitting all-time high earlier in the month.\n   * EPS $0.93 vs $0.48 estimate (93% surprise!)\n   * Revenue: $1.13B vs 954M\n* Tupperware (TUP) upgraded by DA Davidson from $30 to $46 at BUY.\n* Penumbra (PEN) with price target increase from Smith Barney Citigruop from $264 to $270. The stock gapped up today 13%\n* ETSY price target increased by Wedbush from $155 to $165 at OUTPERFROM\n* UPS with price target increase:\n   * Wells Fargo (WFC) $152 to $184 at OVERWEIGHT\n   * Deutsche Bank (DB) from $195 to $201 at BUY\n* ServiceNow $NOW with several price increases from Wells Fargo (WFC), Morgan Stanley[ (](https://twitter.com/search?q=%24MS&src=cashtag_click)MS), Raymond James, and Piper Sandler today after beating earnings. Very notable\n* Bunge (BG) with several price target increases:\n   * Credit Suisse from $60 to $67 at OUTPERFORM\n   * Morgan Stanley (MS) from $50 to $66 at EQUAL-WEIGHT\n* Viking Therapeutics with price target of $27 at STRONG-BUY by Raymond James. Very notable because the stock is only $5.60 right now.\n* Exxon Mobil (XOM) said it plans to cut 1,900 employees in the U.S., as company seeks to reduce costs to fend off lower demand for its products during the pandemic. In comparison renewable energy stocks have been flying this year                                                                                                      \"To thine own self be true\" - William Shakespeare", "id": "jki8li", "created_utc": 1604004027.0, "score": 372, "upvote_ratio": 0.97, "num_comments": 69, "comments": [{"body": "the sanest stock market reports come from a psychotrader. we truly live in a society, it really makes you think.", "score": 91, "replies": [{"body": "you made me really laugh with this one hhahh😂😂😂 thanks, really appreciate the kind words", "score": 29, "replies": []}]}, {"body": "[deleted]", "score": 29, "replies": [{"body": "whoops totally right, definitely an oversight, i even traded NIO today😅", "score": 35, "replies": [{"body": "Haha fair enough!", "score": 3, "replies": []}]}]}, {"body": "How come Apple and amazon are down AH if they reported better than expected earnings? Google on the other hand is up 7% ah", "score": 35, "replies": [{"body": "That's the million dollar question!", "score": 35, "replies": [{"body": "WTF shit Google", "score": 4, "replies": []}]}, {"body": "I've been wondering this myself. It doesn't make any sense to me,  but I'll keep adding shares at this cheap price 🤷‍♂️", "score": 11, "replies": [{"body": "How about the increase the last 6 months Jesus fucking christ people", "score": 3, "replies": []}]}, {"body": "Re: AAPL, from Yahoo Finance:\n\n“However, shares traded lower by more than 3% immediately following the report, as investors focused on a worse-than-expected drop in iPhone sales during the third quarter, and a steep decline in sales in China.”", "score": 8, "replies": []}, {"body": "Multiple reasons, poor iphone sales, no guidance but probly the biggest reason is manipulation.  Either way apple is a stock that you buy forever", "score": 4, "replies": []}, {"body": "Apple didn't report Q1 21 guidance. That's why. Same story with UPS.", "score": 6, "replies": [{"body": "So what. There was no report twice this year due to pandemic. This whole thing is rigged as hell", "score": 2, "replies": [{"body": "Investors like having something they can go off of. The market hates uncertainty. Not giving guidance stokes uncertainty. Market reacts as it should.", "score": 7, "replies": [{"body": "Yes. But there was no guidance for Q3 and Q4 2020 as well. Yet for investors there was no problem with that.", "score": 4, "replies": [{"body": "I’m curious why companies would choose to not give any guidance, as it does produce uncertainty among investors and therefore is seen as being a negative", "score": 3, "replies": []}]}]}]}]}, {"body": "google core revenue growth is good, that is why.", "score": 2, "replies": []}, {"body": "Same for SHOP", "score": 1, "replies": []}, {"body": "For Amazon at least, surpassing expected earnings was largely priced in, and then some. It trades at a premium, but we all know that.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "yep and to celebrate, -5%!", "score": 16, "replies": []}]}, {"body": "Finished green....and then After Hours happened", "score": 9, "replies": []}, {"body": "Thank you for posting this! I was literally just refreshing the subreddit waiting for this to show up", "score": 6, "replies": [{"body": "&#x200B;\n\nGlad to hear it!", "score": 6, "replies": []}, {"body": "Mate why dont you just subscribe to them via email. Still giving upvotes on reddit for support tho!", "score": 4, "replies": [{"body": "How do you subscribe via email?", "score": 1, "replies": [{"body": "Go to www.psychotrader00.com", "score": 7, "replies": []}]}]}]}, {"body": "I admit my ignorance but is there any theory as to why every company that has posted decent/good/great earnings has dropped immediately afterwards?", "score": 5, "replies": []}, {"body": "Envista(NVST) spiked after hours when they beat earnings by 500%. .08 expected vs .48 actual", "score": 6, "replies": [{"body": "Wow, thanks for providing that info!", "score": 2, "replies": []}]}, {"body": "Great summary of the day as usual. Thank you!", "score": 3, "replies": [{"body": "Thanks for reading!", "score": 3, "replies": []}]}, {"body": "is there a way to get these recaps as rss,api or email. Love reading these", "score": 3, "replies": [{"body": "Yes there is!", "score": 3, "replies": [{"body": "how if i may ask?", "score": 2, "replies": [{"body": "Psychotrader00.com just go there", "score": 5, "replies": []}, {"body": "www.psychotrader00.com", "score": 3, "replies": [{"body": "**I found links in your comment that were not hyperlinked:**\n\n* [www.psychotrader00.com](https://www.psychotrader00.com)\n\n*I did the honors for you.*\n\n***\n\n^[delete](https://www.reddit.com/message/compose?to=%2Fu%2FLinkifyBot&subject=delete%20gak0emn&message=Click%20the%20send%20button%20to%20delete%20the%20false%20positive.) ^| ^[information](https://np.reddit.com/u/LinkifyBot/comments/gkkf7p) ^| ^<3", "score": 2, "replies": []}]}]}]}]}, {"body": "Also OSTK released earnings this am and rocketed +14% before opening, only to finish the day -13%.  That’s a massive 27% change in the stock price!", "score": 2, "replies": [{"body": "Wow i missed that, crazyyy price action", "score": 2, "replies": []}]}, {"body": "All these companies destroying earnings and they go down.  And yeah it happens all the time but man if only I picked pinterest over ups and etsy.", "score": 2, "replies": [{"body": "Yeah feel you, earnings are just so crazy its very difficult to predict", "score": 2, "replies": []}]}, {"body": "Thank you for these daily updates.  Is there a Discord community for this?", "score": 2, "replies": [{"body": "its in the works but not yet!", "score": 2, "replies": []}]}, {"body": "Today was a good day.", "score": 2, "replies": [{"body": "glad to hear that!", "score": 1, "replies": []}]}, {"body": "As usual this was brilliant. Thank you", "score": 2, "replies": [{"body": "youre very welcome, thanks for reading!", "score": 1, "replies": []}]}, {"body": "AUY Yamaha gold had good earnings!", "score": 2, "replies": [{"body": "thanks for pointing that out, missed it!", "score": 1, "replies": [{"body": "Ya it went under a lot of radars with the big companies quarterly earnings.  Was sad AUY is a legit company with decent financials.", "score": 1, "replies": []}]}]}, {"body": "Today I had two cups of water. It was better than the expected 1 and a half cups of water.", "score": 2, "replies": []}, {"body": "Thank you!", "score": 1, "replies": [{"body": "Not a problem!", "score": 1, "replies": []}]}, {"body": "no idea what viking does or anything but seems like worth a gamble with that price tag", "score": 1, "replies": [{"body": "hahaha, same when i saw that price target i was surprised. Vikint went up a fair bit today", "score": 2, "replies": []}, {"body": "They have a drug that will be treating NASH. A very very common liver disease that currently has no treatment. Their drug is very promising.", "score": 2, "replies": []}]}, {"body": "$NOW noice.", "score": 1, "replies": [{"body": "yeah been a fan of that stock for a while, its in my longterm portfolio", "score": 1, "replies": []}]}, {"body": "Thank you for the recap", "score": 1, "replies": [{"body": "of course, thanks for reading!", "score": 1, "replies": []}]}, {"body": "Tanks for the recap, surprised at the earnings revealed today, may The U.S. great again!", "score": 1, "replies": [{"body": "thanks for reading!", "score": 0, "replies": []}]}, {"body": "I gained so much money only to loose it to fucking after hours", "score": 1, "replies": []}, {"body": "F", "score": 1, "replies": []}, {"body": "FB revenue is incorrect", "score": 1, "replies": []}, {"body": "Yes to TUP! I don’t see it mentioned much but I grabbed some in April and have been jumping in and out since. I’ve gotten attached to it so I’m still holding shares.\n\nIt is still a good price for swing trading as well. I expect it to have multiple large adjustments for the next season or so.", "score": 1, "replies": []}, {"body": "So, um, you guys think that the market works like this?", "score": 1, "replies": []}, {"body": "Anyone notice the anti-correlation in S&P and BTC over the last year? It's interesting, especially in the context of people like Paul Tudor Jones being more vocal about their bull stance.", "score": 1, "replies": []}]}
{"title": "The Election, SPY, and Your Retarded Positions", "selftext": "Alright retards, next week is the election and we are all wondering what the fuck is going to happen. I am going to be your autistic Nate Silver to guide you to Tendie town. To understand what could happen from a market perspective, we need to see what has happened after elections of the past. \n\n**TL;DR: Buy SPY Puts on Tuesday at close. If election is contested, BTFD after a week or so.**\n\nSo first off what happens the day after an election you might ask? I went back through SPY's illustrious history and pulled what happened the day after the election going back to 1996. \n\n   \n \n\n[SPY Performance Day after Election](https://preview.redd.it/j1290wvuy2w51.png?width=621&format=png&auto=webp&s=0021f22ff10f594e87c0c208d2d3a938d94813b3)\n\nThe last three elections SPY has had a red the day ranging from .8% to 1.2% down. Assuming that trend continues and SPY is around 335, a -.98 day would put spy at 328, plenty of room for SPY weekly puts to cash. That's just for the day though, what about the rest of November?\n\n   \n \n\n[Election Year SPY November Performance](https://preview.redd.it/nmsdqaewy2w51.png?width=634&format=png&auto=webp&s=47cdb07ff4ec4495f3dfef10e958c184033fe8a3)\n\nBill Clinton's election during the .com boom reigns supreme at 6% gain whereas Obama's election when the country was in shambles lead to a -10% at the end of November. Trump's surprise victory over Hillary lead to a 3% gain by the end of November. Surely by now you've noticed the mark of 2000 and -8% when Florida couldn't get its shit together.\n\nSince we are expecting both sides to either contest the election OR not even have a winner due to mail in delays, we could see another 2000 scenario play out. The Supreme Court resolved the 2000 election on December 12th after about a month of uncertainty. **From the day after election close to the resolution, SPY tumbled from 140.56 to a Low of 129.75 (-8%) and ultimately made a 6% recovery from 11/30 to 12/12. So if SPY closes at 328 and we have an 8% uncertainty crash that would take SPY down to 301 before it recovers to \\~320.**\n\n&#x200B;\n\nhttps://preview.redd.it/sdksss2sy2w51.png?width=500&format=png&auto=webp&s=e30e2cea1a2fccf7483dd3a95a0f09b08a42aba4\n\nLastly, to gauge the anti wisdom of the crowds effect of the WSB genius mob, I threw a poll out and 56% think it will be Big and Red. The last 3 elections have been red the day after but WSB thinks it will be Red too soooooo who knows what the fuck that means.   \n \n\nhttps://preview.redd.it/9tadvxwoy2w51.png?width=658&format=png&auto=webp&s=7e4fd365c737a6781b81f5b56633f5d1d60ad423\n\n**Conclusion**. No matter who wins, markets will probably open \\~1% Red which gives plenty of SPY strikes the ability to hit. If the election is contested, wait about a week for the bottom and BTFD with everything on sale. Thank you for reading and go fuck yourself.\n\n**POSITIONS: 11/6 SPY ATM PUTS bought at close on 11/3**", "id": "jkg5mk", "created_utc": 1603997632.0, "score": 116, "upvote_ratio": 0.95, "num_comments": 66, "comments": [{"body": "i saw the font in the screenshot and decided not to read ur dd sorry", "score": 71, "replies": [{"body": "sorry this wasn't done from a Bloomberg terminal, peasant math is the best you get", "score": 24, "replies": [{"body": "You don’t do math on a Bloomberg terminal", "score": 2, "replies": []}]}, {"body": "This right here. That font is gay af", "score": 2, "replies": []}]}, {"body": "Your sample size is 6. Big brain analysis time.", "score": 30, "replies": [{"body": "And one of them was during the housing crisis.", "score": 6, "replies": [{"body": "And he uses that as the cutoff point for when he cherry picks it 😂", "score": 2, "replies": []}]}]}, {"body": "If you didn’t buy puts last week for the uncertainty, your best bet is to wait until a few days after the election shenanigans and then buy calls.", "score": 6, "replies": [{"body": "premiums too high now?", "score": 2, "replies": [{"body": "Yes", "score": 2, "replies": []}]}]}, {"body": "This post makes little sense. There will not be a winner declared by 11/6 they have already said that many states have 11/3 as the deadline to finish mailing in the ballots. Even if you have wild swings, the market is preparing to wait 7-10 days for the full results. You \"position\" is literally buying an option ATM at 3:59pm  a minute before earnings announcement. Those usually work out great......", "score": 12, "replies": [{"body": "It depends on how the early and day of votes go. If Biden’s polling lead is reflected in vote counts, you won’t have to count the mail in ballots to call the election. I think AP uses a 99.5% confidence interval before they call it so there’s a 1/200 chance of being wrong when final tallies come out but for all practical purposes they can call it. \n\nIf vote totals end up being much closer then the late mail in ballots will be significant and it’ll take much longer, but both Texas and Florida should report a winner by 11/6 and if Trump loses either of those he’s basically eliminated from the race. PA will be a shit show and probably be the source of delay if trump holds Texas and Florida. How long this takes depends on early and in person voting in a few key states.", "score": 6, "replies": []}]}, {"body": "buy spy got it", "score": 3, "replies": [{"body": "As if this isn’t on the weekly to do list. Wake up Monday wait 10 minutes for a solid trend to develop but calls or puts cash out when in the green and go back to sleep. It’s not work but it’s honest work.", "score": 6, "replies": []}]}, {"body": "My money is on red but only because it's November and the world is still going to shit. Honestly it feels more and more like a dream; time is flying by so much faster these days.", "score": 4, "replies": []}, {"body": "I bought my puts today before market close. Should i sell tomorrow and buy back in on the 3rd ? Holding 11/23 300p", "score": 3, "replies": [{"body": "if you think its getting contested, i would sell tomorrow and rebuy Tuesday then you aren't getting any weekend theta burn or getting in a shit spot because of green monday", "score": 9, "replies": [{"body": "Gracias for your advice colonel!", "score": 2, "replies": []}, {"body": "https://youtu.be/TRXdxiot5JM", "score": 1, "replies": []}]}, {"body": "No, sit on em, big gains in week or two.  Maybe more gains swing trading but those are a month out, we could easily have multiple consecutive down days ahead.  Too far out for me to swing trade, sit on those, swing some closer expiration dates.", "score": 2, "replies": []}]}, {"body": "Why wait till 11/3 to buy?  You think Monday and Tuesday will be green?!?  No fucking way.", "score": 3, "replies": []}, {"body": "BTFD. Buy the fucking dip?", "score": 3, "replies": [{"body": "Yea", "score": 1, "replies": []}]}, {"body": "I’d like to add that if the democrats lose, they have contested every single election since JFK, minus two landslide elections, where republicans clearly won.", "score": 19, "replies": [{"body": "Jo Joregenson going to lead the recount charge like Jill Stein did in 2016", "score": 9, "replies": []}, {"body": "Whereas mr trump has stated he won’t even accept the results of the election if he loses lol", "score": 9, "replies": [{"body": "Dude this isn’t politics.  This was a simple fact of history which helps with info regarding the OP’s post. 🙄", "score": 19, "replies": [{"body": "So was mine, imagine the impact on the market if the president refuses to leave the White House and has the support of the Supreme Court he packed? Shit would be wild.", "score": -7, "replies": [{"body": "No, yours was hypothetical.  Saying something and doing something are two different things.  60 years of historical actions on the books contributes to the thread. \nYour “dUdE tRuMp hAS sAiD tHiS bUt I cAnT pReDiCt tHe fUtUre so yOlO” contributes absolutely 0", "score": 9, "replies": [{"body": "Both are hypotheticals and the original statement is extremely misleading. If you drop all the dem wins and the 2 rep landslides that leaves what, 2 contested elections in the past 60 years? Honestly, I only even remember the Florida Bush recount. It’s not exactly the massive precedent he’s trying to sell it as.\n\nHowever, the current situation with COVID along with Trumps words and actions leading up to the election leave me with little doubt this will be contested regardless of who wins.", "score": 1, "replies": []}]}, {"body": "If I recall correctly Hillary also took the stance of \"refusing to accept the results of the election\" and absolutely nothing happened...", "score": 2, "replies": [{"body": "You recall incorrectly. She had a concession speech telling everyone to accept the results and to give Trump a chance to lead.", "score": 3, "replies": []}]}]}]}, {"body": "Vid?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I’m not sure what this means?  What did I not explain well enough?", "score": 9, "replies": [{"body": "Clinton gave a concession speech the day after the 2016 election. She also won the popular vote by a margin of ~4%. Which part of your claim are you having trouble with?", "score": 0, "replies": [{"body": "Russian interference fell flat on its ass", "score": 0, "replies": [{"body": "“Collusion” fell flat years later. Russian interference isn’t really questioned.  \n\nDid Hillary Clinton contest the 2016 election or not?", "score": 8, "replies": [{"body": "Well he did say Democrats contested, not Hillary. Still technically true.", "score": -2, "replies": []}]}]}]}]}, {"body": ">I’d like to add that if the democrats lose, they have contested every single election since JFK, minus two landslide elections, where republicans clearly won.", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Democrats.", "score": -2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Think that has anything to do with densely populated cities adopting hive minds like fucking  authority dependent bees.", "score": 0, "replies": []}, {"body": "Thank goodness the founding fathers thought through the libtards flocking together and created the electoral college to give smaller states more representation.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Will vix calls also work?", "score": 4, "replies": [{"body": "just swapped out SPY for VIX and: 10% gain on 11/9/2016, 1% gain on 11/7/2012, 14% gain on 11/5/2008, -7% gain on 11/3/2004, 3% gain on 11/8/2000, -5% 11/6/1996", "score": 4, "replies": [{"body": "Thanks, I bought vix 40c Nov20 on Tuesday, so I'm going to need something dramatic but they were cheap", "score": 2, "replies": []}]}, {"body": "No!  Because VIX is already at 35ish.  There’s a good chance it just goes up\nAnd down all month.  It would take consecutive days of the market being slaughtered to get it up meaningfully compared to your risk.", "score": 3, "replies": [{"body": "Good job I didn't buy many then lol. Here's to consecutive days of the market getting slaughtered!", "score": 1, "replies": []}]}]}, {"body": "Sign me up", "score": 2, "replies": []}, {"body": "I feel that it’s so obvious and everyone will buy puts, so we will be green next week.", "score": 2, "replies": []}, {"body": "This is the type of DD I like. Market sentiment and historical data. No fucking lines. Just needs a ban bet and it’d be perfect.\n\n9.5/10", "score": 2, "replies": []}, {"body": "If you’re expecting a -1% red day is it even worth it? IVs have priced in volatility you’re gonna need a bigger move than that", "score": 2, "replies": []}, {"body": "Don't bet against America. Buy at close Monday. Always inverse WSB.", "score": 1, "replies": []}, {"body": "Sounds like it’s time to buy spy calls😏", "score": 1, "replies": [{"body": "Most probably true when everyone here wants to buy puts. Contested election shouldn’t cause any problems to the market.", "score": 1, "replies": []}]}, {"body": "History is priced in", "score": 1, "replies": [{"body": "COVID record numbers every day are historic and not at all priced in.", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/Colonel_Cubical don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Your numbers don’t even make sense \n\n11/9/16 - open 212.36 close 216.38.  You have this as a -1.74 loss for the day . How did you math this?", "score": 1, "replies": [{"body": "it is the day before's close - that day's close", "score": 1, "replies": []}]}, {"body": "What price did you pay for your position?", "score": 1, "replies": []}, {"body": "Assuming we trintificate the flux capacitor I’m predicting 3 Green Day’s in a row for tech", "score": 1, "replies": []}, {"body": "Given most A+ pollsters are giving trump a 4% - 5% chance to win, I'm thinking smart money already priced in trump getting the boot yo", "score": 1, "replies": []}, {"body": "130x GLD 200c already bought.", "score": 1, "replies": []}, {"body": "Ban for positions not existing yet - future positions? Lmao this sub is truly ridiculous", "score": 1, "replies": []}, {"body": "just remembered i bookmarked this... how'd this turn out?", "score": 1, "replies": [{"body": "😂 Inverse WSB struck again. Lost 90% but my stocks did well", "score": 2, "replies": []}]}]}
