{"title": "NIO - A buy right now or wait and watch?", "selftext": "Amongst the EV stocks, NIO seems to have great potential amongst other. Financials wise, their EPS ($-1.97) and P/E ratio (-17.45) are not so ideal along with their Margins but it is frequently called the next TSLA . Also it helps to have Chinese govt backing like they do.\n\nI have currently 15% of my portfolio in QCLN which has NIO as one of its top holdings. The main question is that is it a good time to jump into NIO at this very moment or wait for a dip to a certain price point? Its RSI is overbought on both daily and weekly, also elections are looming which could make it go either way. What is your take on this. Thanks", "id": "jhz76f", "created_utc": 1603653431.0, "score": 20, "upvote_ratio": 0.85, "num_comments": 70, "comments": [{"body": "I believe NIO has consolidated enough from it’s last increase where it’s a great buy right now. During market hours it tends to dip as low as 26.50. Really anything under 30 a share on NIO is a steal. Especially if you’re in long term.\n\nIf you look at the 6 month growth chart for NIO, it’s been consistent with having a large increase between the last week of the month, and first week of the following month. It might be a good to get in before these times and catch that wave in advance.", "score": 31, "replies": [{"body": "100% agree. With the momentum of the company plus growing EV space, this stock could be $40 or $50 by this time next year", "score": 11, "replies": [{"body": "The way EV companies are running up and down on nothing these days, it could be 50 tomorrow.", "score": 6, "replies": [{"body": "Diddo, I remember just almost a month ago when I had bought in it was only at $18 a share now it’s about $28. If that doesn’t tell you how promising of an increase it will be making in comparison to its charts and obvious growth potential I don’t know what does.", "score": 5, "replies": []}, {"body": "LOLOLOL this comment aged hella well /u/yungtucii", "score": 1, "replies": []}]}, {"body": "> this time next year\n\nlol", "score": 1, "replies": []}]}]}, {"body": "Copped like 100 shares at $7, in this for the long haul. I think it’d be a good idea to buy when you can.", "score": 10, "replies": [{"body": "Yup, I bought shares around there and LEAPs when price was around 12. Been pretty happy so far.", "score": 3, "replies": []}]}, {"body": "Amazing how 6 months ago it was left for dead and now analysts see it as the next Tesla.  Just goes to show you wall street analysts have not idea what they are talking about", "score": 6, "replies": []}, {"body": "If Biden is elected, it likely will increase (as will all EV markets, including GM)", "score": 13, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "He is promoting clean energy.  He clearly stated that during the debate and said he wants to put an end to oil by 2035 or something..", "score": 7, "replies": []}, {"body": "Investors will feel more safe investing in chinese company under biden", "score": 10, "replies": []}, {"body": "It’s electric. Democrats are more pro electric cars while inbreds are more pro gas diesel cars (Pickups SUVs)", "score": 5, "replies": []}, {"body": "You need to educate yourself on Trump and Biden's respective relationships and opinions on China.", "score": -18, "replies": [{"body": "Well, that’s why he’s asking.", "score": 16, "replies": [{"body": "True, but this is one of those questions where if you dont know the answer to it you really shouldn't be throwing large sums of money at individual companies IMO", "score": -6, "replies": [{"body": "who said he was throwing large sums of money at these companies? he's asking a question for crying out loud", "score": 8, "replies": []}]}, {"body": "There is no opinion on Reddit that should form his own. You've gotta be able to do your own DD if you want to see consistent returns and success. Last thing I'm trying to be is a jackass, it's a lesson that I learned myself not too long ago.", "score": -7, "replies": [{"body": "Good to know that no one should ask any questions on Reddit, this is a scholarly site. \nRedditpedia", "score": 5, "replies": []}]}]}]}, {"body": "Its a fair question ...dont get the downvote.  Im not expecting NIO to get a boost from US elections", "score": 1, "replies": []}]}]}, {"body": "NIO has been trading in a downtrend range, making lower highs, there is some rejection on each candle, however I think I would watch $25.80 If the pullback is not done yet. I wouldn’t buy right now, because I’m uncertain about the direction it’ll go", "score": 8, "replies": [{"body": "Yeah personally waiting for that $25 range too", "score": 0, "replies": [{"body": "Nio will go above 30 in the near future anyways, whats 1$ difference", "score": 7, "replies": [{"body": "The difference is some 5% which might not be too small", "score": 1, "replies": []}, {"body": "🤗🤗🤗", "score": 1, "replies": []}]}]}]}, {"body": "I think it's a solid buy under $28 right now. I'm also interested in $40 calls for next year.", "score": 2, "replies": []}, {"body": "I bought 500 shares 2 weeks ago just above $26 and immediately sold $28 calls on it. In 2 weeks it has returned over 10% thanks to the volatility. If it gets called away I dont mind, but I can see this stock going up a lot more. It has a product already which it has other companies manufacture. They have the government behind them to really spur production numbers, and china is a HUGE market.", "score": 2, "replies": []}, {"body": "Buy Li auto \nSame thing as nio just poor branding\nAlso has higher revenue", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Gotta give it some time. All EV stocks were once like this.", "score": 2, "replies": [{"body": "How much time, I’m looking to turn my falling tech stonk money into bank", "score": 1, "replies": [{"body": "You are welcome btw (if you listened to me)", "score": 3, "replies": []}, {"body": "Went up 10% yesterday. I am thinking it’s gonna cool back down to 18-19 over the next week.", "score": 1, "replies": [{"body": "This aged well", "score": 2, "replies": []}]}]}]}, {"body": "yea I was thinking the same looking at the chart", "score": 1, "replies": []}]}]}, {"body": "Selling calls at 27 hope I get assigned lol", "score": 2, "replies": []}, {"body": "Theres a lot of people who are citing specific numbers like 25.8, 23 etc.   Just remember NIO only rose last week because of an analyst upgrade.  Its the same stock still as it was from the 20s.\n\nThe redditors likely have no clue on this on as its price is just a wild guess on how successful an early stage ev maker  will become.\n\nI found NIO at 15 right after last earnings.  And its not clear to me whether they're worth $2 or $50 next year but it seems like ok risk/ reward.\n\nHowever theres something trendy going on with EV makers, and I dont like it.  Reminds me of pot stocks a few years ago which all eventually crashed", "score": 4, "replies": []}, {"body": "If you are buying for long term. I would wait for a small pull back and enter. \n\nIf you are playing short term - I reckon it will drop down to $23 - $26.", "score": 2, "replies": []}, {"body": "Etfs suck. Buy nio.", "score": 1, "replies": []}, {"body": "To me NIO just isn’t worth it...I’d rather put my money into other stocks", "score": 1, "replies": [{"body": "Like which ones?", "score": 2, "replies": [{"body": "Ones that are less speculative and give me dividends, also ones that trade at a true value, not a speculative one", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Bruh I’m 18", "score": 3, "replies": []}]}, {"body": "thats the risk vs reward. think of all those people who bought in the last year how happy they are with their gains. I bought in at like 18.50 and dropped like 8k on them as a gamble. Paid off so far.", "score": 1, "replies": [{"body": "Oh yeah totally, I’m not saying it’s a bad buy or anything... but it’s so early in the EV wave, the switch to EV will take easily 10 years+, we don’t know where NIO will stand, which I’m not a fan of, I’d rather take a stock that I know for a fact will produce, like Visa, American Water, certain REITS, AbbVie, defense stocks, so forth", "score": 1, "replies": [{"body": "The switch to EV is already happening in our face right now. I would say differently if it’s 5 years ago or something.", "score": 1, "replies": [{"body": "It’s happening now, but we’re still long off from having a majority of cars being EV", "score": 2, "replies": [{"body": "Long? 10, 20 years? I have the time to watch it grow and roll with it.", "score": 1, "replies": [{"body": "I’d say between 10 and 20 years", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "You'll probably be downvoted to hell but I think your future scenario might not be that far off, people right now expect this stock to, for some reason, go up endlessly, it's just not Elon and it's not Tesla, they don't even produce their own cars,  just something to keep in mind in between all the euphoria.", "score": 3, "replies": []}]}, {"body": "It'll be 1k by 2025", "score": 0, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "1k in 2040 maybe", "score": 2, "replies": [{"body": "1k by 2037.5 maybe", "score": 1, "replies": []}]}]}, {"body": "Based on what? If they manage to go global and actually sell better in Europe than European and Japanese cars, sure. Don't think doing well in China will be enough for a that price tag. Honestly, I'd be super happy with a 150$ per share in 5 years.", "score": 6, "replies": []}, {"body": "i only have 10 shares.\n\nWill sell 9 of those shares if it ever hits 1000", "score": 5, "replies": [{"body": "I'll retire if it hits 1k/share.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": -15, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "I invest in long term, so I’m only looking at companies that are up in the long run. Looks like y’all already invested in NIO without even looking at the companies financials and fundamentals that are audited by the government. I dare if if atleast one of you folks can provide that data. LOL.\n\nYou guys are the same folks that invest blindly and then cry on this sub Reddit when your portfolio drops by 30%. \n\nAnd sorry, if you’ve purchased NIO shares and are still holding them, it hasn’t made you rich. Until you have encashed the stock and gotten the money, don’t even call yourself rich. \n\nAt least understand the basics of investing and trading, if you want to lecture me on how others get rich. Noob.", "score": -4, "replies": []}]}, {"body": "This is what I am mostly scared about. The West is basically at a trading war with China and Chinese companies are not so honest with their financials", "score": 3, "replies": []}, {"body": "You haven’t done any DD at all it seems", "score": 0, "replies": [{"body": "Probably a NKLA investor.", "score": 2, "replies": [{"body": "Sir, I hope your investing skill is way better than your math. Because your probability calculation is just shite.", "score": -4, "replies": [{"body": "Found the NKLA investor. Let me guess, you're also an Enron investor.", "score": 2, "replies": [{"body": "Lmao. No wonder you’ve been downvoted a lot in this sub and elsewhere. https://i.imgur.com/jVQYFe8.jpg\n\nYou’re sounding pro Chinese. Never knew that the Chinese government had their bootlickers join this sub. Anyway, I don’t want to invest any more time in a person who just sucks at logic and math. \n\nI wish you luck in your blind investments cause that’s what you’ll need, otherwise your kids and grandkid’s would have to polish other peoples shoes to repay your debt. Cheers!\n\nP.S. NKLA is just as poor in fundamentals like NIO. Why on Earth would your pea sized brain think that I would invest in NKLA? Are you obsessed with NKLA? Lost your life savings in it? By the way, I own only two stocks - Amazon and Apple. Go ahead and mock them, cause when I encash my profits, I’ll make sure I send some your way to help repay your debts.", "score": -1, "replies": []}]}]}]}, {"body": "No, I’m a NIO employee lmao", "score": -2, "replies": []}]}, {"body": "lol", "score": 0, "replies": []}]}, {"body": "If you buy you’ll have to hold for 6 months if you’re considering taxes. Buy more QCLN", "score": 0, "replies": []}, {"body": "Hey it doesn't hurt to be optimistic. Worldwide takeover", "score": 1, "replies": []}, {"body": "Looks like it’s starting to consolidate around 26.5-27 but I think I’ll wait for it to confirm a bounce back before buying... starting to bottom but still could break either way", "score": 1, "replies": []}, {"body": "THe fundamentals are nto there I got in at 18 out at 28. Why, because there is nothing to push this movement to 40 that JPM claims.  Just my take, you can make some money in the stock because of its volatility but, there is risk but we all know that.", "score": 1, "replies": [{"body": "Well its over 40 now and not slowing down. Citi Bank just raised their target price to 46!!!! a fucking share. Buy back in before its Tesla prices.", "score": 1, "replies": []}]}]}
{"title": "Tesla Is Not a Trade, It's an Investment", "selftext": "", "id": "jhtxl6", "created_utc": 1603635040.0, "score": 218, "upvote_ratio": 0.95, "num_comments": 76, "comments": [{"body": "I don't have a short term target, I'll hold at least a decade. By then I expect to have doubled the money, hope to have 10x, and dream of 25x!", "score": 63, "replies": [{"body": "If you are only doubling over a decade then it is not better than buying sp500 index fund.  10 times multiple for tsla over next  10 years is  more like it given that dojo and energy are still in infancy stages.", "score": 13, "replies": [{"body": "2x is the negative scenario \n\n10x is the likely \n\n25x is the bullish\n\nEverything above negative is positive 😀", "score": 19, "replies": [{"body": "I have a couple hundred shares spread out over my brokerage account. Being conservative and saying I have 200 shares in each account (I think I have 285 in one and 219 in another) current price is 420ish x 10 x 200 nets me 840,000.  If I do not add to my positions at all and TESLA gets to get to 10x I'm a multi-millionaire. Sweet.", "score": 5, "replies": [{"body": "What will you be doing with your extra millions (while still retaining majority of your tesla shares)", "score": 1, "replies": [{"body": "When I said Multi-millionaire at my current share count getting to 10x would be about 1.6M maybe 2M at most and roughly half of that would be in my Roth IRA. \n\nAdditional chairs would add to that. I bought a few with savings and margin, so hopefully I'd sell a few and pay off the margin, return the money to savings with a sizable chunk additional value. The money was about 2 years worth of salary which is more than enough for an emergency fund and a down payment on a house. Dont expect to buy a house for a while so I threw it at Tesla, hopefully I can pull a few shares out in the future to put a down payment on a house. \n\nAs a Federal Employee on the low end of the totem poll I'm hoping to move up into the high single, low double digits on the GS scale. Currently at 4, would like to get to 7 and then eventually to 9 or better. \n\nHopefully things work out with my girl. We both both have health issues and this pandemic is keeping us apart making me miserable and honestly I cant figure out how she feels but being a single mom dealing with a pandemic, health issues and work is hard so - shrug. \n\nI cant really start pulling money out of the Roth IRA for another 20ish years and my Federal pension I think starts at 10 years of service which is 8 years away. Full is at 20-22 years but even at 22 years I'll only be 60. \n\nLots of what ifs and maybes in life. If Tesla makes me several million, maybe we both retire early. Guess we'll cross that bridge when we get there.", "score": 3, "replies": []}]}]}]}]}, {"body": "I've already gotten 600% returns. I bought another 100 shares this year on top of that. It's free money. Just hold it.", "score": 5, "replies": []}, {"body": "10x is 4T maybe?  25x is 10T.  Very unlikely?  P/E $400 share x 25 = $10k a share. 50 P/E $2k a share?  \n\nMaybe I did the math wrong. Possible...... really hard.", "score": 8, "replies": [{"body": "A conservative guess is that tesla produces 10 times as many cars in 2030 (5 million), their average profit/car is double and the P/S is about 1. That makes 2x\n\n10x: 10 million cars, twice the current profit per car, equal revenue from software, autonomous taxis, grid storage, solar et cetera, P/S ~2,5\n\n25x: 20 million cars produced, none of them sold to consumers, just robo taxis that are moving people around in all major cities in the world day and night generating shit loads of money to tesla. Solar roof and battery packs in >50% of all houses that are beeing built or renovated, mega packs to take the place of peaker plants making arbitrage money between day and night, every day plus a lot more clean, exciting and innovative stuff that we have no idea about today. \n\nMaybe 25x is not enough in this bull scenario...", "score": 24, "replies": [{"body": "This assumes none of their other lines of business generate revenue in the next 10 years.  They make batteries, insurance, solar, energy plant software just to name a few.", "score": 17, "replies": [{"body": "Tesla needs to grow a lot in the coming years just to grow into their current valuation. All known valuation models are beyond their maximum. For further climb of the stock price tesla needs to expand their business at a rapid pace in several areas", "score": 8, "replies": [{"body": "But then when we reach that time the stock price will reflect what's coming in the next 3-5 years.", "score": 8, "replies": []}, {"body": "You clearly don’t understand how exponential growth works.", "score": -3, "replies": [{"body": "You clearly don't understand what you are talking about", "score": -2, "replies": [{"body": "Again you’re proving my point.", "score": -1, "replies": []}]}]}]}, {"body": "It also assumes no one other than Tesla is in any of those lines of business, causing a race to the bottom.\n\nThe thing about taxis is that no one cares about anything other than getting from A to B, thus hailing a Tesla is no different to anyone than hailing a Honda.", "score": -2, "replies": [{"body": "People care about cost. Here TSLA has an advantage", "score": 8, "replies": [{"body": "Why would Tesla be the cheapest? When you're talking about generating hundreds of thousands of dollars in revenue per year, the cost advantage of the car itself becomes meaningless.\n\nSo Tesla saves $20K in costs upfront over 10 years. So what? Let's say a robotaxi generates $100K/year in revenue for Tesla. Over 10 years that $1M in revenue. Let's say a competitor comes along and offers fares for 50% less and accepts $500K in revenue over 10 years. That extra $20K Tesla maybe saved in manufacturing costs becomes meaningless in terms of the cost of the service.", "score": 3, "replies": [{"body": "Cost is not the only advantage for TSLA. Scalability is also another important advantage. \n\nIf this becomes a race to the bottom(which is still uncertain, there is room for multiple players), the bottom will be TSLA as things stand today. They are the only electric car producer able to produce at scale which leads to lower costs than the competitor. They are ruthlessly innovating in battery and production technology to bring costs down and to scale as fast as the can. They are producing and delivering potential robotaxis globally in the thousands every day, today. \n\nI can’t see other players scale as quickly as TSLA which gives them first mover advantage in many markets. That will also play a big role in which service will prevail in these markets.", "score": 6, "replies": [{"body": "If Tesla is the bottom, then they likely won't be making much money.\n\nWhy would you not expect a race to the bottom though? Things that are commodities tend to always find the floor price. Taxis should be a commodity since there will be nothing to differentiate them. They will be like airplanes where the difference in cost is merely related to the comfort/size. In fact, the one thing that does differentiate them is actually not Tesla's strong suit. If priced the same, I'd always opt for an S-Class taxis over or Model S.", "score": 1, "replies": [{"body": "Well, I'm not sure. Probably will be in some locations, in others, the first-mover advantage might play a big role. I think electric vs non-electric will influence people more when they choose which service they use than luxury vs non-luxury (even though I consider the Model S a luxury car). Robotaxis will be used predominantly by younger people who are more conscious of global warming and the environment.", "score": 1, "replies": []}]}]}]}]}, {"body": "You obviously talk without even knowing the basics.  Cars are all going EV because it’s simply cheaper to buy within a year or so and already much cheaper to maintain.  No fleet owner gives a damn about anything else.  More importantly you need the software for self driving.  No one is even close to Tesla in any capacity so so either Tesla is the exclusive provider or everyone else licenses it from them.  Good luck to google PAYING someone to drive every inch of road to map it for their geo fenced solution just to find out construction was done and they have to go back and redo parts.", "score": 3, "replies": [{"body": "So you know Waymo and Mobile Eye's technology intimately? You know everyone's technology?", "score": 1, "replies": [{"body": "The likelihood of them having anything even fractionally as good is minuscule", "score": 1, "replies": []}]}]}, {"body": "I guess I should throw my money at every car manufacturer then. They'll just get on it anytime.\n\n\"We can win anytime we want. We just haven't yet.\"\n\nFirst mover doesn't matter at all.", "score": 1, "replies": [{"body": "How do you know Tesla will even succeed at robotaxis and FSD? So far it has neither.", "score": 0, "replies": []}]}, {"body": "except your car becomes a taxi when you do not use it. it's a totally different thing", "score": 1, "replies": [{"body": "This won't happen in any profitable markets since Tesla will just supply all their own cars that are taxis 100% of the time.", "score": 1, "replies": []}]}]}]}, {"body": "Even Elon himself stated that they expect 30% to 40% of their earnings will be from car insurance in the future. Then add Robotaxi. Then add Solar. Tesla is going to earn from many more sources than cars alone", "score": 2, "replies": []}]}, {"body": "There's no point looking at any classical reference parameter (p/e, or others) for companies that are in massive growth mode. You need to look at the future, and on their technology development and on their level of disruption.", "score": 5, "replies": []}, {"body": "Lol people just throw out random numbers when they talk about Tesla. They have no idea what a 10T market cap means", "score": 3, "replies": [{"body": "It means more than a $9T market cap.", "score": 4, "replies": []}]}, {"body": "I can imagine it. Too many industries to interrupt. Now what I can't imagine is what other innovation they'll come up with on the way to improving all these industries.", "score": 1, "replies": []}, {"body": "Let’s ditch the P/E on TSLA once and for all. Now is not the time.", "score": 1, "replies": []}]}, {"body": "There is a fundimental problem with all of the math on this thread, and that is that people are saying that the stock is currently overvalued because of massive future potential but would be worth 10x or 25x if certain scenarios play out. Tesla shouldn't be worth more than $200 a share right now if we base it off what they are currently worth, but high hopes pf future potential is priced in. \n\nI would argue that Tesla will still have massive future potential priced in even in 5/10 years, and if you think the stock will be genuinely worth $2,400, after you factor in future growth/potential expectations you actually have a $3,500-$5,000 price point.", "score": 2, "replies": []}, {"body": "I think 40x is possible over 10-15 years.  Bigger than Apple.", "score": 2, "replies": []}, {"body": "If you’re base expectation is doubling your money in 10yrs then just put it in the S&p.  That’s the equivalent return it has historically gotten.", "score": 1, "replies": [{"body": "That's the worst case. I prefer to keep my money in tesla since i dont expect S&P to 10x or 25x", "score": 3, "replies": [{"body": "Yes.   Actually expect a minimum of 5x in 10years.... as a very conservative return.", "score": 2, "replies": []}]}, {"body": ">That's the worst case. I prefer to keep my money in tesla since i dont expect S&P to 10x or 25x\n\nagree but technically it doubles every 7 years i think. certainly VTI seems to double every 7", "score": 1, "replies": []}]}, {"body": "Calm down, Sally.", "score": 1, "replies": []}, {"body": "A doubling in 10 years as an annual average return of 7 %, which is in line with the overall market.", "score": 1, "replies": []}, {"body": "I doubled my money in 3 months this july. Things did slow down the, but I have hopes for the future!", "score": 1, "replies": []}, {"body": "If Tesla has $1-2T revenue with 40% gross margins, shouldn't the share price be worth well over $100,000?? Someone please help me understand. (Apple share price is currently around $30,000 pre-split.", "score": 1, "replies": []}]}, {"body": ">My aggressive target is $600, making use of the $502 spot as pivot.\n\nThat's a big bag of wind typed to merely announce the author's updated TSLA target price.\n\nI thought the article was going to say \"look, short term price doesn't matter much, hold it for the long term ie ~2030-ish and you'll rejoice in being rich, and here's why\". Unfortunately, that's not the case.", "score": 22, "replies": []}, {"body": "If you already follow the stock there’s nothing new in that article.  All I can say now is that volatility will be a constant companion for another year.", "score": 16, "replies": [{"body": "I felt it was a good reminder after all of the good news only to follow up with not great stock movement.", "score": 3, "replies": [{"body": "The most visible legacy auto pumping analysts still pushing the NoT PRofiTABle withoUt crEdIts lie. Oh well, crush them in q4.", "score": 2, "replies": []}]}]}, {"body": "Tesla is aiming for 50% compound annual growth. Even if the stock price doubles every 3 years from now on that’s only about 26% growth per year. It could easily double, three times this decade (double by 2023, then again by 2026, and again by 2029 - that’s 8x from now) and it would probably be growing more slowly than revenues at that rate. \nI’m continuing to buy every month for the next year, then forget about it until 2035 or so. It’s a no-brainer.", "score": 9, "replies": [{"body": "Right?!?\n\n*People 20 years from now*\n\n“Ugh why didn’t I buy Tesla stock 20 years ago! There was literally no one else making electric vehicles like they were making on a mass scale and that was when their battery and solar business portion was just starting to taking off. I’m such an idiot”", "score": 14, "replies": [{"body": "I'm so glad when everyone was buying toilet paper back in March, I was buying TSLA. Now I have their toilet paper! I won twice! My friends gave me their extra packs.", "score": 2, "replies": [{"body": "> Now I have their toilet paper! \n\nReally glad you proceeded to explain that a little more.", "score": 3, "replies": []}]}]}, {"body": "I only have 35 shares (I’m 16) and I’m planning to hold for atleast 10 years - currently I’ve been using some margin to help purchase more, do you think I should continue purchasing more shares every month? \n\nMy account is at $18000 market value, with $10,000 of that being on margin (my thoughts were that the stock would go up much faster than the 3%/year interest rate on the margin, which seems to be holding true). I make around $500USD/month, so I’m not sure if it’s smarter to work towards paying off the margin now or if I should just keep on purchasing shares. \n\nAnd just an FYI, my entire account is entirely self funded, no hand-me-downs from my parents. Been working full time summers and part time the rest of the year for the last 2 years.", "score": 9, "replies": [{"body": "Damn, I fucked up my life at 16. Moved back home before Covid. Helped my mom sell our house in Cali. Luckily, got a buyer just 1 month before I even heard of the virus. Bought that massive crash with everything I got as well as some of my mom's house money and quadrupled it.\n\nLife NOT so fucked now!\n\nEnvying your position though. Invest more! Retire at 30! I wish I knew any of this stuff when I was 16!", "score": 5, "replies": [{"body": "My mom just got $60,000 from my recently passed grandpa's estate - going to try and get her to invest at least half of it and hopefully she'll be able to pay off her mortgage on her house. If we see 25% annual returns over the next 10 years i'd be ecstatic, any more would just be incredible.", "score": 2, "replies": [{"body": "Don’t forget, while we have been in a massive bull run the market is volatile. Don’t invest that money if you’re not willing to half it or lose it completely", "score": 2, "replies": [{"body": "Definitely not going to invest anything I’m not prepared to lose. Going to be especially careful with my parents money, as they don’t have the luxury of having a long time to be able to recoup any losses before retirement. I’m definitely more bullish with my personal account because I plan to put half of the account towards retirement and the rest towards school and housing (and I’d love a model 3 eventually aswell).", "score": 2, "replies": [{"body": "Beeing only 16 gives you massive leverage in the long term. In your shoes I'd keep adding as many shares as I could and pay off the margin as slow as possible. Don't sell under any circumstances. Well done one the 35 shares bud.", "score": 1, "replies": [{"body": "Yeah. I think I’m gonna go with that plan, thanks! Was planning on paying off the margin sooner but it makes much more sense to do it slowly.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Are you sure you know how margin works?  You one $8k and margined it more than 100%.  You should be paying that down now.  You’re risking getting a margin call and having to sell at much lower prices", "score": 1, "replies": [{"body": "Yes, I do. I have $2000 in maint excess so I’d have to lose $2000 before I get a margin call, and I have money set aside for if that happens.", "score": 1, "replies": []}]}, {"body": "normally i wouldn't want to encourage a 16 year old to trade on margin, but 5-6%, backed by tsla, sounds fine to me, especially at 3%. you are way ahead of me, congrats. from earnings, pay at least the interest on the margin, pretend like your investments won't cover your margin, even though in this case they probably will. it is not unlikely that tsla will go bankrupt without warning at some point during your lifetime; by then you should have diversified and paid off margin. in the medium term (5-10 years) your strategy looks good.", "score": 1, "replies": []}, {"body": "Nice! This is awesome experience. Great job starting early - one of the reasons Warren Buffett is so rich is that he started investing at a young age!", "score": 1, "replies": []}]}, {"body": "Lol, it grew 800 percent in a year and it's supposed to grow 26 percent from now on 😐", "score": 3, "replies": []}, {"body": "Yea this is one of those companies that come along maybe once a decade and you just have to buy the stock and not worry about the price.  Apple Amazon and Microsoft were all “expensive” ten years ago. Just buy and your future self will thank you.", "score": 2, "replies": []}]}, {"body": "Back in 2013 I used to write an annual investment letter for my friends and family. I forget the exact numbers but the gist of it was I expected Tesla would gain 30% that year and it gained several hundred %. Lols", "score": 4, "replies": []}, {"body": "A long while back I made a plan that next time I go \"wow that's cool but I cant afford it\" I am spending money on stock. \n\nI just noticed that my Facebook timeline from October 25, 2014 says \"Gassed up at the Racetrac by [location]. If I had believed the pump when it clicked off the first time, I would have paid less than $20 for a tank of gas. I haven't seen a bill this low since high school. 6.83 gallons, final bill $20.03. Total Mpg 41.9. If I can afford a Tesla model III when they come out I want my license plate to read \"OPEC HA\" or maybe \"HA OPEC\" oh well, that will have to wait until I can afford one.  \n\nJust looked at the Tesla chart, it says six years ago Tesla was around $47 so adjusting for the split about $235/share. That means 20 shares would have cost me less than $5000 and be worth more than 42,000 now. :( Had I done that and bought any more over the last 6 years I'd have enough to buy a Model 3 right now and possibly more. :(", "score": 2, "replies": [{"body": "The split average cost was like in the 400s", "score": 2, "replies": [{"body": "The day it split yes... But it was trading in the mid 200s in 2014 if you dont also adjust that price the stock was worth almost as much 6 years ago as it is now, which is not the case. $250/5 is $50. Math.", "score": 2, "replies": [{"body": "I see I was just blackout when I read that", "score": 1, "replies": []}]}]}]}, {"body": "I didn’t read the article, and I’m not saying Tesla isn’t an investment. But its a great stock to trade. Huge swings.", "score": 2, "replies": [{"body": "Not sure about that. How many traders have 500%+ gains?", "score": 1, "replies": [{"body": "Dude, Tesla options traders were getting 2000% on the reg.", "score": 1, "replies": []}]}]}, {"body": "Never sell!!", "score": 2, "replies": []}, {"body": "Every time I tried to trade I got burned a little a bought back in. Now just holding until I absolutely need it", "score": 1, "replies": []}]}
{"title": "Real Estate on the brink of collapse, short VNQ", "selftext": "Hear me out, Hear me out\n\nWe all know that real estate is on the brink of collapse. This work-from-home ordeal has left a huge amount of office buildings empty with owners collecting jack shit for rent. Also other problems blah blah blah. Housing Market bubble blah blah blah\n\n&#x200B;\n\nSomeone bought over $3million worth of puts for VNQ dating March 19th. VNQ is a real estate ETF. Not only this, if you look into real-time trades, people are buying puts dating December to February. These people that are buying Puts know that the housing market is about to crash. Remember the movie \"The Big Short\"? This is our opportunity to buy credit default swaps (puts). We will either walk out of this trade as kings or peasants. There is no in-between.\n\n&#x200B;\n\nhttps://preview.redd.it/66osd3yooav51.png?width=1046&format=png&auto=webp&s=e7b731446869eecfeb1d062f3e8962c3dd556c61", "id": "jhzp9l", "created_utc": 1603655106.0, "score": 33, "upvote_ratio": 0.79, "num_comments": 71, "comments": [{"body": "[deleted]", "score": 80, "replies": [{"body": "MM's who have no directional stake in it.", "score": 3, "replies": [{"body": "This message was brought to you by \"Liquidity creation gang\".", "score": 5, "replies": []}]}]}, {"body": "Real question is, have you sold your house to buy puts ?", "score": 50, "replies": [{"body": "Might as well since the housing market is gonna collapse", "score": 26, "replies": [{"body": "[deleted]", "score": -11, "replies": [{"body": "Not in a ton of the residential US. Lots of people leaving the cities for places with more land and seclusion the past 6 months. It's commercial real estate that isn't being used for what made it valuable in the first place.", "score": 3, "replies": []}]}]}, {"body": "I have no karma on here but thought a discussion to get some might be asking:\n\nHas anyone looked at the real estate holdings of GME? Is it worth putting their real estate creditors into a squeeze, or alteratively, how bad of a shake are they getting in that department? Kind of makes one wonder what holdings Shit-a-del has in the finance tied to that end of things", "score": 2, "replies": [{"body": "Do you fuck ?", "score": 2, "replies": [{"body": "Just getting back into it after all these years", "score": 2, "replies": [{"body": "I’m just playing chief, but what are their real estate ?", "score": 2, "replies": [{"body": "It would take an army to figure it out. I'm too lazy for that", "score": 1, "replies": []}]}]}]}]}]}, {"body": "a put is not a credit default swap\n\nthis is great dd...6 months ago\n\ni would be extremely surprised if the downside risk wasn't baked into put prices months ago\n\nthat said, im too lazy to check", "score": 28, "replies": [{"body": "Downside is not even close to being baked in to the market", "score": 8, "replies": [{"body": "i mean, it's pretty easy to solve this\n\njust bring up the charts for some of the puts and see if the price has jumped\n\ni appreciate you being as lazy as i am, but you're not adding anything to my own laziness here", "score": 9, "replies": []}]}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "I agree actually. Crash in 08 was similar for VNQ as it was for the rest of the market. Plus the dividend will go upwards of 7-8% if that happens", "score": 7, "replies": []}]}, {"body": "\"Credit Default Swaps (Puts)\"\n\nYou're definitely in the right sub-reddit.", "score": 28, "replies": []}, {"body": "Calls on rkt got it", "score": 19, "replies": []}, {"body": "Just watched the big short?", "score": 9, "replies": [{"body": "Actually the film was rather more artistic. *dodge, duck, dip, dive, and dodge*", "score": 4, "replies": []}]}, {"body": "Have you tried buying a house lately? Yea it ain't as easy as it was before. There is no bubble and there is actually not enough houses being built fast enough for buyers.", "score": 9, "replies": [{"body": "Yeah, the value of my house goes up rediculous amounts every month. Bought in 2013 for 300k, now it's worth 495. Pulling out the equity for Tqqq calls.", "score": 11, "replies": [{"body": "Houses in the US have a historical price growth rate of 0.6%", "score": 1, "replies": [{"body": "Same as my boner.", "score": 3, "replies": [{"body": "Pic or ban", "score": 1, "replies": [{"body": "https://www.loe.org/content/2014-02-07/18-moby1.jpg  Best I can do. It gives you an idea...", "score": 2, "replies": [{"body": "Looks like I am buying puts again", "score": 2, "replies": []}]}]}]}, {"body": "when you control for like all of the fucking shit parts of the US it doesn't", "score": 2, "replies": []}]}]}, {"body": "Kinda sounds like a bubble?", "score": 5, "replies": []}]}, {"body": "Yeah, the situation is really bad in NY. The value of real estate there was based on the fact that there's so many people in New York and so much to do. Now a lot of people are working remotely, and restaurants and theaters are closed. Other businesses are starting to close down and many aren't re-opening because rent prices aren't dropping. This just means that fewer people are actually in NY. The real estate there is a bubble just waiting to pop. Even if you don't live in NY, that crash will probably affect you because of how much money is invested in it.", "score": 5, "replies": []}, {"body": "I heard you out.  Even if I believed what you say is about to happen would, I can't understand for the life of me why the YOLO play would be VNQ.\n\nI award you no points, and may God have mercy on your soul.", "score": 4, "replies": []}, {"body": "just buy DRV if you really think the real estate crash is coming in the next 24 months. way safer then options and will still pay you out 4x1", "score": 6, "replies": [{"body": "Shit been going down for 5 years straight", "score": -1, "replies": [{"body": "uhmm its a 3X fund do you understand how those work?  Thats like saying your leap options have been going down every month", "score": 5, "replies": [{"body": "5 years ago it was $35. now it’s at $13. Hmmm seems legit", "score": -3, "replies": [{"body": "correct. thats how 3X leveraged funds work. Here i'll have google help you out\n\n&#x200B;\n\n \n\nWhat is a 3x leveraged ETF?\n\nUnderstanding **3x ETFs**  \n\n\nAs with other **leveraged ETFs**, **3x ETFs** track a wide variety of asset classes, such as stocks, bonds, and commodity futures. The difference is that **3x ETFs** apply even greater **leverage** to try to gain three times the daily or monthly return of their respective underlying indexes.", "score": 5, "replies": [{"body": "I mean I would understand if it would fluctuate up and down but it seems like that ETF is just going downhill. If you only do options alright I understand but if you buy the ETF I don’t see the point of owning it", "score": -3, "replies": [{"body": "Thats why I said \" if you really think the real estate crash is coming in the next 24 months \"   a 3X Bear/Bull ETF is a much safer way to try to win the lottery. Unlike buying options and having it go to zero, this is a way for you to have more time to be right. Look into how 3X funds work man. Its not safe, but how many people have you seen here loose everything on weekly options? From 100 to 0 in 7 days, 14 days, 30 days, whatever. This bleeds much slower..... but you still obviously have to be right or just like options you will lose. You can't hold 3X funds", "score": 5, "replies": []}, {"body": "These aren’t things you’re meant to buy and hold long term. You’re not even supposed to hold most of them overnight.", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "This is until they pass the stimulus.", "score": 3, "replies": [{"body": "Yep. Papa Powell comes to the rescue and your teddies get thrown in the trash.", "score": 2, "replies": []}, {"body": "Not for CRE.", "score": 1, "replies": []}]}, {"body": "Could be a market maker hedging their position.", "score": 7, "replies": [{"body": "Jesus Christ that was a retarded sentence.", "score": 1, "replies": []}]}, {"body": "Oh yeah definitely going to collapse with record levels of money being handed out..", "score": 6, "replies": [{"body": "Printed from the great tendies gods themselves", "score": 2, "replies": []}]}, {"body": "Buy put at your own peril", "score": 2, "replies": [{"body": "This is a pretty safe bet. CRE is about to collapse.", "score": 1, "replies": []}]}, {"body": "Thanks for the tip.The stock price failed several times around $90. What strike price and time frame are you looking at?", "score": 2, "replies": [{"body": "feb-march, 75-70 for risk tolerance, >60 for a YOLO", "score": 4, "replies": [{"body": "If you do decide to go ahead with your puts, why not buy the DRV or SRS both short ETF? Wouldn't it be safer than options", "score": 1, "replies": [{"body": "It is safer and makes more sense, I don't think you're in the right subreddit", "score": 1, "replies": []}]}]}]}, {"body": "Look at us, some greedy motherfuckers", "score": 2, "replies": []}, {"body": "There will always be localized bubbles in real estate but don’t count on anything near the scale of 2008.  Lender conditions are more strict than ever.  Even refis are looking for 700+ FICO.", "score": 2, "replies": []}, {"body": "> We all know that real estate is on the brink of collapse.\n\nInversing, sounds like house prices are going to the moon to me", "score": 2, "replies": [{"body": "CRE is fucked though. CMBS high at 10.31% delinquency rate, sept a 8.3%.\n\n31.2B over 800 loans, are in forbearance. 28% of that is retail. \n\nReal estate is about to crash hard. Except this time it's 2008 for CRE. It will be bad.", "score": 1, "replies": []}]}, {"body": "I would buy in to a potential commercial real estate bubble, but not a housing bubble. The fed’s targeted inflation rate inflating land and assets, and lumber prices so high making new construction more expensive, I think real estate in locations that have a reasonable expectation of demand (college towns, mid size cities like Nashville and Charlotte, Austin and Dallas still) are good investment opportunities. Can’t speak for rural America and would stay away right now from NYC, LA, and SF.", "score": 2, "replies": []}, {"body": "The people buying puts could very well be real estate owners.", "score": 3, "replies": []}, {"body": "Does this count in residential?", "score": 1, "replies": []}, {"body": "“We all know”? You almost gaslit me into puts. \n\nRKT 11/13 23c to inverse this autism.", "score": 0, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/CheesecakeTroll the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Better off going bull on SRS (2x bear Dow real estate etf). More weight on commercial", "score": 1, "replies": []}, {"body": "I looked into this. It tracks commercial real estate. These are multi year leases with businesses, which are consistent, unless the businesses fo bankrupt.", "score": 1, "replies": []}, {"body": "Pulling my money out of my 401k on December 31st and going to wait for the housing market to crash. Then I'm going to buy some rentals. \n\"If history has taught us anything, it's that you can't go wrong buying a house you can't afford\"", "score": 1, "replies": []}, {"body": "$69 strike price. Nice.", "score": 1, "replies": []}, {"body": "If you're conservative, straddle it. Otherwise, I can't see how this one will go tits up", "score": 1, "replies": []}, {"body": "this is a bet on this foreclosure situation. Could pay off, could blow up in your face", "score": 1, "replies": []}, {"body": "Commercial real estate crash. Actual suburban houses to the fucking moon", "score": 1, "replies": []}, {"body": "Not the good play and im not sure what is, but eviction moratium and morgages deferrals will end in January. Unless there is a stimmy to cover that we probably gonna see a failure in the credit structures. Looking at bto’s is where you want to be, as retail we cant play this, or at least I dont know how yet (tard). Been looking at banks maybe but again fed money is ready to fuck puts at anytime. \n\nThe real DD is to go for firms that make their bread with BTOs maybe. \n\n\nAnyway not shorting anything American as long as oil is traded in USD worldwide which is the reason America can basically guarantee demand for their currency and  keep the debt ponzy going, fuck it im not fighting the printer magic. \n\nGood luck, keep a long term vision, stay safe and dont buy over valued assets.", "score": 1, "replies": []}, {"body": "With all these buisness owners and retailers and office spaces probably working from home and finally dying out due to covid \nThere is definitely a commericial real estate crash for commericial buildings \nWhats the best bet for commercial real estate?", "score": 1, "replies": [{"body": "I bought 140 shares of ticker DRV etf (Direxion Daily MSCI Real Estate Bear 3X Shares) today for about $14 each. Although its only a small $2K investment but its peak price was in 2008-09 housing crash around $30K each share. My downside is limited but the potential is there for a massive return of capital", "score": 1, "replies": [{"body": "2009 was from the average people i dont think it will be big as that but will definitely be something since i can only imagine a bunch of buisness owners defaulting on payments", "score": 1, "replies": []}]}]}]}
