{"title": "What are your go-to long term hold stocks?", "selftext": "Hi,\n\nFairly new to trading, trying to build my portfolio for long term growth (10-20 years).  Current portfolio is around $5000 and I'm adding at a rate of $1000/mo.  I currently have the following:\n\nAMD ~5%\nNTDOY ~5%\nMSFT ~10%\nUNH ~10%\nJPM ~10%\nV ~10%\n\nBroad ETFs: ~50%\nSPY\nVOO\nVTI\n\nI was considering something in aerospace like Boeing, maybe Illumina in the sciences, maybe WM (because I heard that somewhere, I duno).  Eventually maybe add some Apple, Amazon, Google, but those are expensive as hell at the moment for a portfolio my size.  \n\n\nWhat are some stocks that you feel are reliable long term holds and I would also love to hear why.  Thanks very much!", "id": "a176s8", "created_utc": 1543418933.0, "score": 20, "upvote_ratio": 0.73, "num_comments": 76, "comments": [{"body": "[deleted]", "score": 39, "replies": [{"body": "Gotta love WM and JNJ", "score": 10, "replies": []}]}, {"body": "V, MSFT, WM, ILMN, CME, JPM, AAPL, ADBE, BRK.B, SQ\n\nTech heavy, but believe long term in all of these companies. ", "score": 11, "replies": [{"body": "Oh, and BAM", "score": 8, "replies": []}]}, {"body": "Y’all heard of FANG which is now FAANG\n\nBut let me tell you bout DAMN\n\nDIS\n\nAAPL\n\nMCD\n\nNVDA", "score": 8, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Esports bubble + AR/VR becoming the next frontier. These chips ain’t going anywhere. (Assumptions)\n\nAlso fundamentally the company is great", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "They might run ok on ok hardware, but these events (I assume) will be sponsored by nvdia. Kids are easily manipulated and want the best even if they don’t need it.", "score": 4, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "I'll 2nd the KO... one of the better longs with great dividends.", "score": 5, "replies": [{"body": "Yeah I just kept buying a few months ago and kept buying more until it went up back in october slump. Just checked I've got an average a little above 45 a share ", "score": 3, "replies": []}]}]}, {"body": "Add some KO to that", "score": 7, "replies": [{"body": "Such a boring stock. Which is a great thing for long term 20-30 year holds. ", "score": 11, "replies": []}]}, {"body": "Consolidated to six stocks in Robinhood.\n\nAMZN 29%, AAPL 23%, AMT 16%, BRK.B 13%, V 10%, MSFT 9%", "score": 5, "replies": [{"body": "50% in AMZN and AAPL, thats incredibly risky.", "score": 6, "replies": [{"body": "77% tech is risky. And that's if BRK.B has no tech in their assets/investments.", "score": 4, "replies": []}]}, {"body": "That's portfolio would be down like 35% since October. They're good long term buys but it's pretty much all tech. ", "score": 0, "replies": []}]}, {"body": "$PFE, $MRK, $BLK, $BRK.B", "score": 4, "replies": []}, {"body": "If you’re adding $1000 a month, you really should buy Apple. Use a broker like Robinhood that doesn’t charge commission.  Apple is undervalued compared to peers and still has incredible upside. \n\nIf you want to get into Amazon or Google but can’t afford the stock price, you could do an ETF like FDN or XLK\n\nI started out small like you and made the most money off SIRI (high P/E now so “expensive”, but price in the single digits), BAC (bought when Buffet bought) and FB (bought at IPO)\n\nDon’t be seduced by low price stocks though—the stock price tells you very little about the company itself. ", "score": 11, "replies": []}, {"body": "What I do sounds a bit convoluted but it has worked well and allows me to save around 110% of my income each year.\n\nI have 4 accounts.\n\nAccount 1 is stocks and index funds, I’m quite risky with this account and make short term investments and take profits when they exceed 20% (minus fees).\n\nAccount 2 is dividend stocks which I setup on a DRIP (Dividend Reinvestment Plan). I have a bunch of different stocks here widely distributed, it grows slowly but always grows. In bad times the dividend either grows 1-4% but I’ve never lost anything.\n\nAccount 3 is the money I live on and includes all expenses (house, car, utilities, entertainment, food, etc)\n\nAccount 4 is my business account \n\nEach time I get paid I divide the payments into 1/4s with one 1/4 going to each account. The rules are simple.\n\n1. I don’t withdraw from account 2, ever. It’s for retirement.\n\n2. If I want to spend any money from my business account an equal amount has to go to each of the other 3 accounts. For example, if I want a $5,000 computer I really need to have saved $20,000 into that account.\n\n3. I never carry any debt, I have a credit card with a $2,500 limit but it gets paid off every month and rarely holds any balance. I use it mainly to pay rent and business expenses, then immediately transfer the money from account 3 to cover the purchase. This way we can travel once or twice a year free on points.\n\nI’m 38 and will be able to retire financially in 5 years comfortably although I won’t because I like what I do.\n\nAnd yes, I live on 25% of what I make, my life isn’t super shiny, I drive a 7 year old BMW 5 series that’s in excellent shape with low mileage. I can afford nicer things but recent splurges are things like an Apple Watch Series 4 in aluminum. I really just focus on not over extending myself. I’ve found many people buy based on what they have in the bank and not on smart ratios.", "score": 7, "replies": []}, {"body": "Micron. Memory is the future of tech it’s undeniable. Recent stock dip may have confidence down but stock price isnt reflecting companies performance. Micron has low debt, is a tech leader and solid earnings power with clean balance sheet. Cloud/data centers, iot, and ai are huge growth drivers for the company which will likely generate billions upon billions in revenue. Micron currently makes 10-15 bil in annual net income while only valued at only 40 bil. People keeps referring to past cycles in which the company went cash flow negative but they have ignored the rate and scale of growth in the memory market. Memory market is more diverse and isnt just pc and mobile like in the past and now has expanded to have many more customers in the tech industry that rely on memory products to\nconduct business. Plus they are performing a huge buyback program to buy back 25 percent of their outstanding shares which will have a very positive effect on company eps. Long term this seems to be one of the best plays in the market. Valuation is extremely cheap. Literally cheapest stock in the market while having some of the best financials.", "score": 3, "replies": []}, {"body": "I'd look to hold PM just because I'm anxious to see where the smokeless tobacco market takes it", "score": 3, "replies": [{"body": "LOVE PM", "score": 2, "replies": [{"body": "Also checkout $MO they have wonderful dividends and I'd hold onto them for awhile.", "score": 1, "replies": []}]}]}, {"body": "Me personally i wouldn't do single stocks.. Stick to low cost funds or ETF's. VTSAX is a great one!!", "score": 8, "replies": [{"body": "I did think this originally, and I know it makes a lot of sense.  I am trying to keep other things in my portfolio so I can get a sense of how individual stocks move over time in reaction to news and earnings and things.  I want to pick reasonably good ones and follow them on their fundamentals and news and things so I can learn, and I'm willing to take the risk for it that I know that ETFs would alleviate.  ", "score": 3, "replies": [{"body": "If you're going that route and this is purely an 'opinion' of a professional who's done this for a few decades...\n\n1) Have a 'core' - i.e. 401k, EFT/LOW-cost index non-qualified portfolio. Add to this substantial sums of money, ESPECIALLY if you are a youngin' (i.e 20's or teens). Don't mess around with compounding. \n\n2) Read. READ. READ. John Bogle, esp. All about Asset Allocation. Fama/French. The Behavioral Investor. Etc. Fusion Analysis. Learning some parts about technical analysis, fundamental analysis, etc. \n\n3) Subscribe to [Investors.com](https://Investors.com), investors business daily, & [www.aaii.com](https://www.aaii.com).\n\n4) Remember, there are people and computers LITERALLY doing this 24/7. You have a SMALL% chance of growing your portfolio on your own\n\nMy opinion is, and some will disagree, speculate on when you can afford to and that amount is different for everyone, but start at 5% or so your portfolio or monthly/annual funding needs. I WISH I had just started max funding or nearly max funding my IRA/401k at 22. People do not realize that MOST long-term wealthy accumulation comes from a FEW factors:\n\n1) Low-trading costs, low fees, low-tax impact\n\n2) Re-invested dividends; this will amount to 40-60% of your LONG-TERM wealth accumulation. You don't need specifically DIVIDENDS payers, simply etfs/mutual funds over time that distribute dividends & s/l term capital gains is sufficient. Apple started out NOT paying a dividend and now they do. GE started out LONG AGO paying a dividend and now they don't. IMO, and research shows, today, focusing solely on dividends is a losing strategy (Credit: Meb Faber). Better strategy is buying SYLD or similar funds. \n\n3) REGULAR reinvesting. Read: The Next Millionaire Next Door. For present and future millionaires, (they polled over 10,000 millionaires in the latest book), it was never about one stock (that helped), it was never about timing markets. It's about budget, HIGH savings rates, long-term investing, frugality (living within one's means, no matter the income; and most never earned high incomes). Saving, saving, saving & not messing up ASSET ALLOCATION & COMPOUNDING. \n\nI have a 401k, general investment account, and my speculative investment account. I base my spec account on [Investors.com](https://Investors.com) teachings & the book \"100 baggers and how to find them.\" In the book(s), IBD has you as more active, though long-term that can work against you if your personality isn't to 'manage' to that degree. 100-baggers has you more along the lines of a 'coffee can approach,' where you find about 10-20 stocks, dump about 10k into each, then let them ride for ten years. They do discuss the concept of moats and growth and some metrics, but in reality, no one here would have had held AMAZON through it's major 90+% drawdown in the late 90's/2000's \\*if\\* you didn't lock-in for a decade, that's how the BIG money is made. The book, plus IBD's material, helped me crystallize that if I'm not searching for 10-100 baggers, why bother in individual stocks at all?\n\nSure, Apple is great, but it's likely to net you 100% in 10 years, that'd make it a $1.6 trillion dollar company. However, small-cap stocks found through [aaii.com](https://aaii.com), [ibd.com](https://ibd.com) and other sources COULD grow 10-100x in 10 years or less. Those large caps were at least a small or mid-cap company at some point. When FB went public it was a mid-cap company, now it's a large-cap company. Holding a stock like AAPL for the long-term is more of a SWING trade. It may be a great compounder to pivot capital into another position at some point, but it doesn't have the 'risk' to grow 10x or 100x. Is it undervalued? Yeah, I'd say so. It's a 'value' stock' beaten down from 210+ to 134. The dividends, stability and grow make it a good vehicle to slowly grow wealth and preserve it to a point...\n\nMy favorite etfs: VWO, VSS, VEA, GVAL, SYLD, RSP, VNQ, VB. I drip into those at 2k/month, outside my 401k (I max that out with an aggressive portfolio in DFA funds). I buy spec securities about 5% of my income/portfolio now and then, and plan to hold them for 5-10 years. I do think without a plan, you'll get lost. I owned $DDD when it blased from 10-100 and should have sold, I've played options and broke even (up 25k, then lost it). ", "score": 17, "replies": [{"body": "Thanks very much for this detailed advice, I really appreciate it. \n\nI do have a 401k that I contribute to that I'm never touching.  I just recently reached my cash savings goal and wanted to put some money to better use and am also interested in investing as a sort of hobby. I'm going 5% 401k, with an employer match, and whatever savings I was dropping into an account I'm now putting into stocks, with the plan to keep a 3:1 cash-to-stock ratio over time (though that ratio might change in the long term).  \n\n I have a late start because education took forever, just in my 30s now, but I feel like that gives me some time and my income isn't bad (thanks education).  I will certainly read the things you mentioned here.  I realize how little I know and how far I have to go, and I really appreciate the time you took to give me these specific tips.  Thanks again. ", "score": 3, "replies": []}, {"body": "This is really great advice!", "score": 3, "replies": []}]}]}]}, {"body": "BIDU", "score": 2, "replies": []}, {"body": "VIG", "score": 2, "replies": []}, {"body": "Microsoft, Apple, Square, BRK.B, Visa, Paypal", "score": 2, "replies": [{"body": "What are you thought about paypals future ? ", "score": 1, "replies": [{"body": "They bought iZettle, I bought them purely because of that. I used to work with iZettle and they making moves in Europe. The Square of Europe. Anyway, if they play it right, they can go very far on that alone. Capture payments in all restaurants, hotels, bars, coffee shops and the data that comes with it.\n\nThe rest of the business is table enough, people use it where they can't pay with Amex online, and others trust it, especially via Venmo.\n\nCould all go wrong if they screw it up but seems like they know what they're doing since they knew to buy iZettle at a massively over inflated price.", "score": 2, "replies": []}]}, {"body": "Did you see the microsoft trend last 2 years? That thing will crash hard sooner than later imo.", "score": -4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "That’s speculation  .. look at their revenue growth MsFT has made what I would call Steady growth . their revenue has grown as well as their business which is now more diversified Windows and MS office Isn’t the only money maker anymore and the increase in stock price has mostly been after positive revenue increase has been shown . \nI hold NVDA , AAPL and TSLA they have all out grown MSFT price wise (% growth ) in recent years and are now (exception of Tesla) seeing major corrections, but MSFT even in these past 3 bloody weeks has only seen a minor correction currently at $110\nWith ATH of Around $118 ish I think . \n In a Bear market I feel like it’s one of the safer tech giants that has a sweet dividend .", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I mean that in a large bear market correction, which I personally think is coming in the next 2 years, also Microsoft can fall very deep. Of course these are all speculations and if you want to hop on the train right now and you’re in for the long run, go right ahead :)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "CCF, boring small cap materials stock. Sensitive to pipeline and infrastructure. Managed so damn good, they don't fuck up acquisitions, made me some good money past few years.", "score": 2, "replies": []}, {"body": "Khc", "score": 2, "replies": []}, {"body": "No one says GOOG or GOOGL?", "score": 2, "replies": []}, {"body": "BA, MSFT NVDA APPL SQ and TSLa - get into TSLA now if you feel comfortable they have defied all odds and are making positive changes to meet market expectations they will be the next Google Amazon or Apple growth wise . ", "score": 4, "replies": [{"body": "TSLA is run by an untrustworthy showman. I don't think it will have the same date as those.", "score": 3, "replies": [{"body": "He is the company and the company is him .. I made peace with that a while back I believe in the product and not the sales man and that’s why I invested in it. I feel like he needed to be taken down a notch and the SEC did jut that and gave him a wake up call that he could loose his position in the company if he keeps this shit up.  All care about is production numbers and seeing new Model 3s on the road and there are quiet a few these days . ", "score": 0, "replies": [{"body": "So I worked for solar City I have friends that worked for Tesla and aquatintces from Reno involved in the 'battery factory'. \n\nWe all have the same story. My advice to you is to never trust that companies numbers.", "score": 2, "replies": []}]}]}, {"body": "Don’t know if Tesla is good for long term.  They are at forefront of EVs but soon all the automakers will be doing it as the norm.  They will have to have a serious edge on battery tech to keep up.", "score": 2, "replies": [{"body": "Which is exactly what they have no doubt the competition will get tougher but so far big names are all not committing to an all out EV war my long term is around 5 years I would like to hold it for 20 years and think it will be worth a lot more, but who da heck knows . ", "score": 1, "replies": [{"body": "Big names like Audi, BMW and Benz have all developed EV  but have not yet focused on them as unlike Tesla, they have other cars they actually sell...", "score": 2, "replies": [{"body": "That’s common knowledge the future is electric and Tesla is leading the way they might not be the most dominant in the next 10 years but it’s a good bet so far . \nBMW Audi and Benz have to design manufacture and market cars that compete with Tesla, overhaul production and assembly at existing plants and toughest thing compete against Tesla’s brand their tech and Auto Pilot ... it won’t happen overnight and just cuz they can make electric cars Doesn’t mean they will make better ones  compared to Tesla. \nFor example BMW i3 vs Tesla Model 3 or Chevy Volt vZ Model 3. \nI had a similar discussion with someone at Schwab and one thing I told hem was - all existing car manufacturers,  once they start designing and producing” All Electric vehicles “ they will be under cutting and competing with their own gas powered cars a burden or decision that  Tesla doesn’t have to make as they only make 3 models. Benz sells more C 300s than any other model if they drop a EV 300 their C 300 sales will suffer same goes for BMW who made i3 starting at $45,000 to compete with Model 3  that car doesn’t even come close to what the Model 3 offers. \nThey will catch up but they are  too heavily invested in the gas engines and change won’t come quick . ", "score": 1, "replies": []}]}]}]}, {"body": "Tesla is my one stock that I'm afraid to sell. Sky is the limit.", "score": 1, "replies": [{"body": "Why is the sky the limit? IMO Tesla can easily be overtaken by Benz, BMW, Audi etc all of whom are working on their own self driving and/or electric cars. The only thing about Tesla I like is their battery factories which could solve s huge issue associated with storing energy though at this point it's not a proven technology.", "score": 2, "replies": [{"body": "Tesla has about a 5 year head start which in technology is a lifetime. As well, the brand of Tesla is recognized as the real deal when it comes to electric cars... ", "score": 1, "replies": []}]}]}]}, {"body": "I really like Nintendo as a company. I'm extremely biased so I will keep buying and holding, but with that being said I'm not sure how sound of an investment it is.", "score": 3, "replies": [{"body": "based on my research they are growing faster than other gaming companies and trade at a more attractive valuation.  I think there is a little more risk because they rely heavily on the Nintendo switch.", "score": 3, "replies": [{"body": "I'm not sure about ssbu or splatoon but the lack of esports worry me compared to atvi", "score": 4, "replies": [{"body": "but its fine, they still make plenty of money on traditional games, I don't think they need to get into esports.  The Nintendo switch is such a unique console.  I think the new smash bros should push a lot of switch units this Christmas.  This will be a big quarter for them.", "score": 2, "replies": [{"body": "Plus they have next gen pokemon and metroid next year. Also I feel like plge and plgp sold well", "score": 2, "replies": []}]}, {"body": "I think ATVI esports is a facade of bs. I have trouble believing any of the actual people who bought teams are seeing any kind of actual return on the overwatch league.", "score": 1, "replies": [{"body": "It's tough to gauge. Its too early, but when you look at say LoL there is definitely a market for esports.", "score": 1, "replies": []}]}]}, {"body": "One thing I like about Nintendo is they seem to be more open to other media.  Such as with the live action Pokemon movie coming out.  I think there is some long term potential there.\n\nThere are also rumors of a (more faithful) Mario movie coming out.", "score": 3, "replies": [{"body": "they finally got into mobile gaming which has been a great move.", "score": 1, "replies": []}]}]}, {"body": "Thats why I'm keeping them too, but at a small % of my portfolio.  ", "score": 1, "replies": [{"body": "Mine is a larger portion and I keep adding, but like I said, really no logic other than I know the company's products and I enjoy them", "score": 2, "replies": []}]}]}, {"body": "CGC APHA NVDA AMZN", "score": 2, "replies": [{"body": "Where have all of my APHing gainz gone? How could you do this to me Vic!!!", "score": 1, "replies": [{"body": "Well, OP said long term. ", "score": 2, "replies": [{"body": "True. I am hoping Thicc boi will be able to carry us into the future. They are my largest holding and I've been investing in the industry for about 3 years now...Hoping for continued success even though the past month has been pretty rough.", "score": 1, "replies": []}]}]}]}, {"body": "DIS, HSY, GIS", "score": 1, "replies": []}, {"body": "TWLO, SQ, AAPL MSFT, MDB and AYX are all I hold.", "score": 1, "replies": []}, {"body": "H and m. Carrefour.", "score": 1, "replies": []}, {"body": "VYM ETF", "score": 1, "replies": []}, {"body": "I would do DIS instead of NTDOY", "score": 1, "replies": []}, {"body": "paypal is my go to at the moment ", "score": 1, "replies": []}, {"body": "Ford\nRoyal bank\nDisney\nApple\n", "score": 1, "replies": []}, {"body": "VTI, MSFT, V, AAPL, JPM, UNH.", "score": 1, "replies": []}, {"body": "Dis\n\nMsft\n\nAAPL\n\nJpm\n\nAmzn ", "score": 1, "replies": []}, {"body": "If your looking in the aerospace sector, I think $I and $MAXR are good buys right now. Space is our future, these two companies offer high end equipment in space. Only thing that bothers me is their debt. ", "score": 1, "replies": []}, {"body": "$FB", "score": 1, "replies": []}, {"body": "I'm not sure if you are using Robinhood as your platform, but if you'd like to own the FANG stocks and if price of each stock is preventing you from buying them, try M1 finance, they also have free trades but they also allow you to buy partial shares.", "score": 0, "replies": []}, {"body": "GM, GE", "score": -7, "replies": []}]}
