{"title": "New challenge: $450 -> 1 million ;P", "selftext": "I \"just\" (<-LOL) gotta double it a bit more than 11 times, without screwing up and losing it all even once, which is incredibly difficult, but it's just a lil game anyway to keep me (and perhaps you?) entertained.  ;P\n\n450-> 900-> 1,800-> 3,600-> 7,200->14,400-> 28,800-> 57,600-> 115,200-> 230,400-> 460,800-> 921,600\n\nTrade 1: AAPL Sept 102/104 call spreads @ .85", "id": "2ggtnu", "created_utc": 1410795554.0, "score": 28, "upvote_ratio": 0.83, "num_comments": 69, "comments": [{"body": "Dont be a pussy, you only have to quadruple it 6 times. No problem", "score": 12, "replies": [{"body": "http://www.youtube.com/watch?v=-DT7bX-B1Mg&t=0m27s", "score": 1, "replies": []}]}, {"body": "I am going to start a 10K to $450 challenge.  For those of you who think this will be easy, remember the market is mostly random and it may actually be difficult to lose 10K.", "score": 10, "replies": []}, {"body": "well you're going to need to have a 94% winrate to have a 50% chance of getting 11 wins in a row. 94% winrate on a 1:2 R:R strategy shouldn't be too hard, right? Then it's like a coinflip for a mil!", "score": 5, "replies": [{"body": "You only have to be right 11 times. That's easier than being on Who Wants to be a Millionaire!", "score": 10, "replies": []}]}, {"body": "This represents you.\n\nhttps://www.youtube.com/watch?v=dTDy8XVdRSk", "score": 5, "replies": [{"body": "Oh man, my favorite anime for the longest time. Just so completely over the top! Good times...", "score": 1, "replies": []}]}, {"body": "Thought i read a post over the weekend that said you were finished with this throwing darts shit? \n\n", "score": 3, "replies": [{"body": "I'm bored... and this isn't really throwing darts since it's AAPL post-release with massive sales = increased targets from analysts on the way + increased buying from institutions and others... as you can see from today's positive action on a huge NASDAQ down day.\n\nEDIT: It's $450, not $45k.  So yea... ;P", "score": -1, "replies": [{"body": "LOL naw.... you throwing darts, son. No doubt in my mind you are going to zero again. Might not be on this crAAPL trade but it will happen. \n\nYou should probably let the chart make your decision rather than iphone sales and news. Only two things apple could do 1) test support lost from all time and 2) make new all time high. ", "score": -2, "replies": [{"body": "Who gave me the tag?? RM is that you? Hows that ES chart working out, man?? http://i.imgur.com/EN2Wbs0.png ", "score": 1, "replies": [{"body": "anyone see what the tag was?", "score": 3, "replies": [{"body": "It was something along the lines of NeverWrongAvg4Life as he tried to continually short /ES and that chart looks about right.  I'm such the Nostradamus. \n\nEdit:  I also did not give him the tag, but I did come up with the tag.  Credit goes to me for the line, credit goes to someone else for putting it there.  ", "score": 2, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Well, that's the one guy with the highest probability of getting paid here. So...", "score": 2, "replies": []}]}, {"body": "OP what should I have for lunch today?", "score": 4, "replies": [{"body": "How about eating at an Indian food buffet?  ;P", "score": 7, "replies": [{"body": "Like shit thru a goose.", "score": 7, "replies": []}]}]}, {"body": "Considering AAPL will likely pin $100, I'd say you're off to a rough start. ", "score": 2, "replies": [{"body": "Apparently news out that they will not ship to China this year.  =/", "score": 2, "replies": [{"body": "Chinese irony: Citizens cannot buy the phones made in their own country!", "score": 3, "replies": []}, {"body": "Yeah, RIP your $450", "score": 1, "replies": [{"body": "Shut down before getting started.", "score": 1, "replies": []}]}, {"body": "Looks like Apple didn't bribe the communist party enough to have permission this year. ", "score": 1, "replies": []}]}]}, {"body": "How exactly are you executing the call spreads? Could you ELI5? \n\nHow would this double your $450? \n\nWould love to follow this to learn more about different options strategies. \n\nThanks!", "score": 2, "replies": [{"body": "He didn't give any info on the strategies he'd be using besides that first trade there. For information on common options strategies, I would recommend links in the sidebar or a google search. For the time being, this should be a good show though.\n\n", "score": 3, "replies": []}, {"body": "I bought the Sept 102's and sold the Sept 104's.  I paid .85 per share x 5 contracts x 100 shares per contract = $425 + some commissions.  104 on Friday =  +135% - commissions because 104-102 = 2.  2-.85=1.15.  1.15/.85 = 135%", "score": 6, "replies": [{"body": "And return is -100% if the stock is not within the 102-104 spread?", "score": 1, "replies": [{"body": "102 or less = 100% loss.", "score": 4, "replies": [{"body": "You sold at open today when AAPL hit a high of 102.35 ?", "score": 2, "replies": [{"body": "Of course not.  =/", "score": 1, "replies": [{"body": "Promise yourself no more AAPL trading for 90 days !! Seriously !!", "score": 1, "replies": [{"body": "I think I hate AAPL now.  LOL.", "score": 1, "replies": [{"body": "Think of AAPL as a hooker with an STD and just stop fuckin' with it! \n\nFocus your brains & capital elsewhere. ", "score": 2, "replies": []}]}]}]}]}, {"body": "Shit yeah. Thanks ", "score": 1, "replies": []}]}]}]}]}, {"body": "I can't wait for /u/iheartoptions to find this.  \n\nGL OP", "score": 2, "replies": []}, {"body": "Statistically, if you flip a coin 200 times, you should get 6 heads or tails in a row at some point.  But there's still going to be a whole lot of loses in something like this, but you know that.  Lol", "score": 1, "replies": [{"body": "Since he's going all in, one loss is enough to wipe him out, despite how many wins in a row. Would suck if on his 10th win, he loses the last trade.", "score": 3, "replies": [{"body": "I don't think he'll really be able to go all in on the larger steps unless he's trading SPX or SPY or something similar.  I just don't think there's enough interest to clear $100,000 worth of options on a single underlying, let alone 200K or 400K.", "score": 3, "replies": [{"body": "Just humor him :)", "score": 2, "replies": [{"body": "After I get into the 50k range I'd start skimming pretty heavy and pocket it in case I fuck up.  And I WILL fuck up :D ", "score": 1, "replies": []}]}, {"body": "he should get filled on that. they will fade like no other if sent electonically but he will get filled.", "score": 0, "replies": []}]}, {"body": "No way in hell he still flips after 10k.", "score": 1, "replies": [{"body": "no way he even gets close to 10k ", "score": 2, "replies": []}]}, {"body": "Definitely not going all in at that level, IF I even get that far, LOL.", "score": 1, "replies": []}]}]}, {"body": "GPRO October $60 Puts", "score": 1, "replies": []}, {"body": "Love it!", "score": 1, "replies": []}, {"body": "What exactly could he stand to lose in this? $450? Or is it more?", "score": 1, "replies": [{"body": "max loss on this would be just $450. I believe profit would be had when 102.85 > APPL < 104", "score": 1, "replies": []}, {"body": "Just $450... entertainment value alone is worth it.  ;P", "score": 1, "replies": []}]}, {"body": "OP is playing WSB ride the bus. You always mess up on the last card flip on that game. ", "score": 1, "replies": []}, {"body": "Why AAPL?  Even when it was the one stock that decimated me??  Well, I'm hoping for a strong lead up to it going on sale in store this weekend and weekend sales numbers coming out Monday.  I'm thinking traders will be buying ahead of it, especially Friday... much as we saw YHOO rise last Friday in anticipation of a BABA price increase following its road show.", "score": 1, "replies": []}, {"body": "Yeah I did that in my head a few times over the last few month, but one bad move and it's all over!  I sunk everything into General Moly and its not sinking but not going anywhere either. \n\nI think I'll just flip SVR ETFs - buy in around 18 and toss around 20, it's been going like that for months.  ", "score": 1, "replies": []}, {"body": "Can I ask what broker you're using? I can't seem to find one that lets me write options without posting ridiculous amounts of margin (Charles Schwab)", "score": 1, "replies": [{"body": "What was there requirement?\n", "score": 1, "replies": [{"body": "100% margin, in case the stock moves against you 100% even on short dated options.", "score": 1, "replies": []}]}, {"body": "I have schwab, and as long as you are approved for the appropriate level and have $5k in your account you should be able to write options", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Because he can make more money cause he can buy more contracts as his price is lowered from the premium he collects on selling the 104", "score": 3, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "If he thought the stock was going to 120 sure that would make sense. If he only thinks the stock is going to go to 104 ish he'll make more by buying more contracts. He is only able to buy more contracts because he's collecting the 104 premium and lowering his cost basis.\n\nSeeing as anything over 104 is an all time high for apple. I think this spread is a smarter trade. Then buying just 102 calls.", "score": 2, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "Lol\nHe's maximizing his gains for what he believes the stock will do. He also said from the outset he's trying to double his money each trade.  He's also increasing his likelihood of success.\n\nBy ur logic he should buy the 104 calls. gamble it going up or going down. It's not going to stay the same.  Couldn't possibly stay at or near the price the market has decided is the correct price for it. *sarcasm*", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Earlier today i bought $600 worth of Sept 26 100 puts but I put a tight stop on them.  This is how you do a big gamble imo, I will lose 100$ at the most but can make quite a bit.  It's much easier to get to 1m$ when you give yourself more chances.", "score": 1, "replies": [{"body": "Those stops will get hit easily though with options.", "score": 1, "replies": [{"body": "Not if the stop is based on the underlying price not the option price.", "score": 1, "replies": []}]}]}, {"body": "you need to be way more aggressive", "score": 1, "replies": []}, {"body": "The next 2 days are what matters... especially Friday.  I feel some solid buying coming... lots of interesting tid bits coming out today pointing to a renewed Apple TV, new products next month, etc... and lines are already forming for the iPhone 6 release this weekend, which was the main reasoning behind this first trade.  Last year it was up 5% the following Monday.  Traders know this and should be buying in anticipation.", "score": 1, "replies": []}, {"body": "I'm excited.", "score": 1, "replies": []}]}
