{"title": "Stock Comparrisons? Noob question, insight much appreciated", "selftext": "Ok so I am part of a trust which holds around 800k in stocks and bonds. Executor wants to sell off about 30% of trust to purchase other stocks. \n\nTrust was set up by my grandma and grandpa. Dividends were always re-invested and the portfolio has done well. I'll list current holdings, their dividend and amount invested in each stock.  Then I'll list the suggested stocks the executor wishes to purchase. I'd appreciate insight as to whether or not the recommendations to sell noted stocks and buy noted stocks are a good or bad idea. \n\nXOM   $90k           3.2%\nAEP.   $26.8k       4.2%\nDUK $45k            4.4%\nNEE $81k (SELL) 3.1%\nPOM $28.5k          5.3%\nSE $34.5k (SELL) 3.4%\nUPL  $9k.               --\nVZ.  $64k (Sell).      4.1%\nT      $98k.              5%\nXEL  $49k (sell).    3.8%\nKMP $181k            ~6%\n\nLoomis Sayles Bond  $47k sell\n\n\nWith proceeds of sell, wants to buy:\n\nVodafone (VOD)\nVeolia Water (VE)\nBank of Montreal (BMO)\nBank of America (BAC)\nRoyal Dutch Shell (RYDAF)?\nMercury Gen Corp (MCY)\nQualcomm (QCOM)\n\nMain reason for adding BAC is allegedly going to double soon, so that's the only short position in the To Buy list...\n\nThe premise of this was initially get get involved with great infrastructure companies who pay a good divided, IIRC. \n\nSo reddit, can you please weigh in on these proposed changes?\n  ", "id": "1itrbl", "created_utc": 1374516304.0, "score": 8, "upvote_ratio": 0.84, "num_comments": 12, "comments": [{"body": "I can't speak of the merits of each individual stock, but the idea of lightening the weight of energy companies in the trust, and taking on some financials and insurance companies isn't a bad idea.\n\nBut really, nothing very exciting/risky here, though I probably wound't hold VZ *or* VOD.\n\nI'd love to hear the justification for a BAC \"doubling\", and why the executor thinks the rest of the market is missing that piece of information.\n\n(long BAC and QCOM)", "score": 3, "replies": [{"body": "I really can't explain the justification at all about BAC- I was just worried that he wanted to tinker with such a large percentage of a portfolio that was bringing in close to 50k a year in dividends.  But basically you're of the opinion this is a relatively lateral move (read:safe) that is mainly just diversifying holdings?", "score": 1, "replies": [{"body": "With the massive disclaimer that I'm not a professional, nor giving investment advice:\n\nYes, I'm of the opinion that this is a safe move.  As I said, the initial portfolio seems heavily-weighted towards energy stocks.  Lightening that in exchange for some financial companies in an environment that will soon see rising rates is a good idea to me.\n\nNow, whether you're buying and selling the *best* or *right* stocks, that's another question.  For that you'll have to trust the executor.", "score": 1, "replies": []}]}, {"body": "noob here: what do you mean by \"bringing in 50k in dividends\".  what does this mean exactly for fund holders?", "score": 1, "replies": [{"body": "His portfolio of $800k is paying $50k in dividends annually.  Which, at 6.25%, is pretty high.", "score": 1, "replies": [{"body": "but what does that actually mean?  Why is it significant, what do dividends do or \"get\" for an investor?", "score": 1, "replies": [{"body": "You get paid a portion of company earnings, cash, per share you own of the company.\n\n[Investopedia is your friend.](http://www.investopedia.com/terms/d/dividend.asp)", "score": 1, "replies": []}]}]}]}]}, {"body": "BAC has tripled since December of 2011. What makes you think it's going to double again? ", "score": 2, "replies": [{"body": "That was just the explanation given to me. I'm pretty wet behind the ears when it comes to investing. I guess it was a red herring to throw it in there.  \n\nI was really hoping some other people could agree with what testeemctest said or offer their own insight. ", "score": 1, "replies": [{"body": "BAC owns a lot of estates, and have gained a lot of assets since collapse while everybody else is downsizing. \n\nHome values continues to go up. They are sitting on piles of gold mine and the only thing stopping them is government intervention.\n\nIt would not surprise me if BAC doubles, but nobody can ever claim for certain.\n\nBut honestly just because something have tripled, doesn't mean it have no room for growth. This \"it won't grow anymore\" is part of the reason many have missed out the rally in the first place.", "score": 1, "replies": []}]}]}, {"body": "This trust as set up by your grandparents is a diversified USA energy / utility portfolio.  Your executor wants to enter the water utility, domestic banking, Canada banking, insurance and chipset sectors, in each case buying only one stock; and swap Verizon for Vodafone.\n\nI think your executor doesn't understand the purpose of diversification and is therefore nuts; with the possible exception of swapping Verizon for Vodafone, which a lot of folks have been recommending as a pair trade for years (although, as far as I can tell, it hasn't panned out yet.  It's worth knowing that Vodafone owns 45% of Verizon's mobile US business, which is where VZ derives most of its revenue, so the two stocks are tightly linked.)\n\nThat said, the stocks he's recommending may do well; and utility stocks are poised to do poorly as rates begin to rise and their dividends become less attractive to investors.  That's a good argument for getting out of utilities here; I think it's a poor argument for concentrating risks by purchasing single stocks with the proceeds.  Why not buy a banking ETF, an insurance ETF, and a semiconductor manufacturing ETF with the proceeds instead?", "score": 1, "replies": [{"body": "Thanks a lot for the insight! \n\nI should note that once these stocks get placed into my Schwab acct I can do with them as I please but for the sake of other interested parties who might just go along with the changes blindly, I figured I should call the choices into question \n\n", "score": 2, "replies": []}]}]}
{"title": "NFLX Earnings tonight..", "selftext": "Complete noob to TA.. honestly, this is probably backwards.  This is a gut feeling I'm trying to justify with charts rather than actually looking at the charts and extracting real info from it.  But you've gotta learn somehow, right?\n\nHere's the chart.  Red icons on the bottom denote the days where earnings were released.  \n\nhttp://i.imgur.com/plBdwTY.png\n\nThe last two earnings calls, the stock has gapped up hard, however, if you look, the price was fairly flat between earning calls.  This time around, the stock has been creeping up the past couple weeks.  I think people are hoping it's going to gap up again.\n\nI think that regardless of what info comes out, it's not going to shoot up.. and when it doesn't, people are going to sell off. There will be a bit of chop, but I think it's going to settle in around $235.\n\nI'm looking at selling a few AUG13 275/280 vertical spreads.  I think that gives me enough wiggle room in case it does pop a little bit, and if it drops like I think it will, I should be able to buy them back cheap fairly soon.\n\nThoughts?  I know earnings are always a gamble, but hey.. this is WSB!", "id": "1itmra", "created_utc": 1374512947.0, "score": 8, "upvote_ratio": 0.91, "num_comments": 9, "comments": [{"body": "Well the [results](http://qz.com/106978/netflix-not-adding-enough-subscribers-to-satisfy-investors/) are in. EPS beat but subscriper base is not expanding quickly enough for wall street. Shares down ~6% in after hours trading.", "score": 3, "replies": []}, {"body": "Well its AH now, did you go through with anything? Just want to know how it ends up. I liked the Strangle idea honestly. ", "score": 1, "replies": [{"body": "Nope.. just watching from the sidelines as it plummets.. \n\nhttp://www.businessinsider.com/netflix-q2-earnings-2013-7", "score": 2, "replies": [{"body": "wow op, good call on that bubble!", "score": 3, "replies": []}]}]}, {"body": "Looking back into 2012 they're support was 203. Here is my chart with the trend pitchfork. I see it two ways, drop to 230 and follow the pitchfork or drop to the old support and go from there.\nhttps://www.tradingview.com/x/sAilXwwF/", "score": 1, "replies": [{"body": "I think it's going to drop to 230 and follow the pitchfork.  I've been making decent money on the pops and dips of the past few months, and I don't see it dropping off down to 200 until the rest of the market softens up a bit to drag it down.", "score": 1, "replies": []}]}, {"body": "300 is where you short from. PM me when it hits 300. ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I agree that if it pops, it's going to go higher... I was looking at it and thinking it would sell off a bit and be back down in that range by Aug OpEx.  \n\nI think I'm going to play this one on paper...", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah.. I don't have that type of capital in my \"betting\" account.  I only keep a couple grand in it to learn options and futures better.  \n\n\n\n", "score": 1, "replies": []}]}]}]}]}
