{"title": "Are you ready for the 6th wave? (why we aren't in a AI bubble yet.)", "selftext": "", "id": "15brykk", "created_utc": 1690534624.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 17, "comments": [{"body": "Literally in your diagram you include two bubbles that wiped out thousands of companies and trillions in assets, let alone what happened in the 70s", "score": 7, "replies": [{"body": "That's right 95% of the AI companies will fail. The trick is to find the best to invest in.", "score": -2, "replies": [{"body": "Counterpoint: buying those stocks in 2000 that ended up being great, was still stupid, because it took a long time for them to come back, and it was highly stochastic. There is no rush to momo in.", "score": 3, "replies": []}]}]}, {"body": "Said every speculator in AI bubble stocks ever.", "score": 12, "replies": []}, {"body": "Why aren’t we in an Ai bubble yet is funny , global growth is collapsing my man be careful AI will boost productivity for these companies but it won’t create real growth and put more money in consumers pockets. We are getting very close to consumer spending falling off a cliff.", "score": 5, "replies": []}, {"body": "Some economic disappointment coupled with an interest rise will delay if not wiped out all the projections. This is evolutionary not revolutionary technology.  Only a few companies seem to show some benefit so far. Until the benefit can be truly quantified, we do not know the future yet.", "score": 3, "replies": []}, {"body": "In 1968 HAL 9000 was a fictional artificial intelligence character and the main antagonist in ***Space Odyssey*** appearing in the 1968 film 2001. I thought so. 55 years have passed we are nowhere close the technology predicted.", "score": 3, "replies": [{"body": "You want us to invent murderous supercomputers then?", "score": 1, "replies": [{"body": ">[**HAL 9000**](https://www.ebay.com/sch/i.html?_nkw=hal+9000&norover=1&mkevt=1&mkrid=711-153677-323661-0&mkcid=2&mkscid=102&keyword=Collectibles&crlp=_&MT_ID=&geo_id=&rlsatarget=dat-2328559469519103:loc-190&adpos=&device=c&mktype=&loc=43991&poi=&abcId=&cmpgn=603265135&sitelnk=&adgroupid=1228155483929699&network=o&matchtype=b&msclkid=71d5b77820901338dce6d27f6a404b16)", "score": 1, "replies": []}]}]}, {"body": "Bro missed the huge spike and is trying to make themselves feel better", "score": 5, "replies": []}, {"body": "Even if I accept the wave hypothesis, good luck calling the winners at the beginning. Geocities, MySpace, Redhat…", "score": 1, "replies": [{"body": "Unlike the meriad of basement startups in the early 1990ies. The ai startups require multi billion dollar investments. Deepmind, Chat-Gpt all require huge datacentres to work. There's going to be a lot less to chose from compared to the likes of yahoo, pets.com and amazon.", "score": 1, "replies": []}]}, {"body": "cope harder", "score": -1, "replies": []}, {"body": "Lol ok", "score": 1, "replies": []}, {"body": "Mumbo jumbo", "score": 1, "replies": []}, {"body": "Did you just put Palantir in this next wave?  I got in $7 and got out $10, wished I’d stayed, but what rationale are you using to put them in the same league as Microsoft and Google?   What’s their growth story and P/E ratio?", "score": 1, "replies": [{"body": "Long hold. They are not profitable right now but soon...", "score": 0, "replies": []}]}]}
{"title": "Delta 50 option did not move on 10% gain yesterday.", "selftext": "I believe I am going crazy.\n\nI have a handful of 1/24 VIX call options.  The VIX went up about 10% today so there should be some positive movement on them - especially being high delta at \\~.50.  They actually lost a couple pennies.  High delta, decent move, and calls lose value?  Is this real life?\n\nI have some shorter dated calls (August/Sept/Oct) that went up as expected so I am not sure what is going on with my 2024s.  Is this a volume thing?  Do I really not know what I think I know?  Am I in the twilight zone?\n\nAny insight would be appreciated.\n\n&#x200B;", "id": "15brwuw", "created_utc": 1690534454.0, "score": 14, "upvote_ratio": 0.73, "num_comments": 19, "comments": [{"body": "that's it mate, trading options while having no clue what you're trading!\n\nEven though the current spot moved, the VIX forward barely moves with any given move today. It's one of the most mean reverting things there is, and the VIX 1 year out moves way less than the front month vix. Moreover the future as well as the options on it are probably illiquid as fuck.\n\nLook at the settlement for the VX/F4, which is probably what your options expires on.\n\nhttps://www.cboe.com/tradable_products/vix/vix_futures/", "score": 35, "replies": [{"body": "Ah, that makes sense.\n\nI will admit that trading VIX is a new one for me.  I was so focused on the 30 day SPY/VIX movement and \"VIX is low, must profit\" that I overlooked the contracts that they are based on.  A bit of an oversight on my part.  Thank you for clearing that up.\n\nI take it this applies to VIXY, VXX, etc. and such too since they are also based on the contracts?\n\nThanks!", "score": 7, "replies": [{"body": "Some of those are ETF’s I believe that hold some kind of weighted front month/2nd month balanced futures. \n\nI’ll give you some advice: don’t trade them, you’ll just lose money as you don’t have any edge on the firms who trade those professionally. Just buy SPY.", "score": 10, "replies": [{"body": "Solid advice brother", "score": 1, "replies": []}, {"body": "Right. I’ll second this. Sometimes options don’t make as much sense as just buying the stock. You really need to paper trade to know or just be willing to lose your money. Most of the ppl who traded TQQQ options for example didn’t do as well as the ppl who just bought and held since Jan 2023", "score": 1, "replies": [{"body": "It's why you sell puts on tqqq only or yes just buy shares, but selling puts is the answer because tqqq rebalances so it's better to sell puts", "score": 1, "replies": []}]}]}, {"body": "VIX has to outright explode, and reasonably quickly, for almost anything long-VIX to move. This has become particularly true since 0DTE options trading began, since most of the volatility is reflected there.\n\nThere is some seasonality to volatility. The next couple of months may at times work out for long-VIX. But history has had periods where the VIX could go lower than it is now and stay that way for months.", "score": 3, "replies": []}, {"body": "No, VIXY, VXX, UVXY, UVIX etc - are all single instruments (ETFs) that you can buy and hold, so options on them work just like on any stock that you can buy and hold. Only VIX options are related to different instruments (different futures) for each expiry that don’t need to be directly related and each expires on their own. While some of those  ETFs are leveraged with options usually responding much better. But at the same time they decay fast if nothing happens for a while. They may also be overpriced prior to events like CPI or Fed interest rate announcements (as VIX in general), so IV crush applies them too. The delta doesn’t take IV crush into account.", "score": 2, "replies": []}, {"body": "VIX options are European style (no early exercise) and are priced according to the future with similar expiry. \n\nVIXY, VXX etc are ETFs or ETPs that hold a mix of the current month and 1 month out futures. Their options are American style (early exercise is possible) and therefore they behave more normally - if VXX goes up today, even a 1 year to expiry option will react. \n\nBut remember that these underlyings are still holding futures and not the spot VIX. Since spot VIX is about 13.6 and the August future is 15 it is possible for spot VIX to go up but the future to go down as the future moves towards spot at expiry.", "score": 1, "replies": []}]}]}, {"body": "VIX doesn't work like everything else does.  You don't understand how it works, so you should stop trading it.", "score": 3, "replies": []}, {"body": "I had some similar shit in May. I bought Nov 10C - DEEP ITM - and VIX exploded from like 14-15 to 20 and my options barely budged. Got deep ITM on the idea that delta heavy would move almost dollar for dollar on a big ride. NOPE. I got out and said fuck the VIX lol.", "score": 2, "replies": []}, {"body": "Yeah, I had a similar experience 6 months ago. VIX went up 15% and my LEAPs didn’t move an inch. They just don’t move like regular stocks. Plus the VIX is a bit broken now.", "score": 3, "replies": []}, {"body": "I never touch VIX, that shits rigged I swear ongod", "score": 1, "replies": []}, {"body": "Usually you’ll always lose with the options. If you really want some exposure to vix I used to spend what I would have on options on just the shares of one of them. \n\nStill usually never made much of anything going that route either.", "score": 1, "replies": []}, {"body": "You’re trading the wrong security. Get away from VIX", "score": 1, "replies": []}, {"body": "Shall I post my findings?  Market makers eg the casino heads have intentionally rigged vix to mainly go down. \n\nCompare 6 month contracts almost no theta on puts like 1%.\n\nWhile calls are priced at 21-23 dollars vix.  Meaning shorting the vix is heavily favored by market makers. \n\n\nIt is basically 10 -1 ratio to short the vix.  \n\n This tells you market makers are paying hf and everyone to short the vix.  It's a completely unbalanced market by design. Did you degen gamblers ever once considered that?  Did you consider the markets are rigged?  Well now you know", "score": 1, "replies": [{"body": "VIX is literally an index based on \\~30 day SPX options, if the underlying does nothing by expiration than those options expire worthless. The VIX is used by institutions to hedge massive moves, if massive moves don't occur than the insurance policy can't be collected, the policy is then worth nothing. Bogles one's mind that more on's can only comprehend insurance when it is in their favor and benefits their own short term interests. Maybe it should bring to mind that old Seinfeld episode, protests should result in: \"No insurance for you!\"", "score": 1, "replies": [{"body": "Compare the vix contracts 6 m out compare the options premiums on both puts and calls.\n\nCompare premiums to current month premiums.\n\nOh did you find it yet.  I'm sorry it's going over your head.\n\nBut current premiums call on vix is much lower than 6 m premiums\n\nCurrent put premiums are marginally lower than 6 m put premiums.\n\nIf you cannot see it you cannot be helped gg", "score": 1, "replies": []}]}]}, {"body": "The Vix is a scam right now", "score": 1, "replies": []}]}
{"title": "why do you think Allogene therapeutic has more than 50% of its float shorted?", "selftext": "[removed]", "id": "15c84bu", "created_utc": 1690575779.0, "score": 9, "upvote_ratio": 0.77, "num_comments": 15, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|1 week ago\n**Total Comments**|54|**Previous Best DD**|\n**Account Age**|1 week|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "this thing is due for a squeeze. 85% institution owned, 49% float shorted, company in negotiations to partner up a pipeline and we're trading at near cash on hand levels. Pfizer owns like 25% of it, first whiff of commercialization or pipeline partnership and they're scooping. Shorting at these levels is unwise.", "score": 6, "replies": [{"body": "The company was more active recently on Twitter,  I expect good news soon", "score": 1, "replies": []}, {"body": "IBKR says: % 97 institution owned", "score": 1, "replies": []}]}, {"body": ">You're right, Allogene is definitely a company to watch. They have made great strides in cancer treatment and their products show promise for the future. I'm sure Pfizer will be keeping a close eye on them!", "score": 4, "replies": []}, {"body": "Loading up !!!", "score": 1, "replies": []}, {"body": "Keep me updated on this!", "score": 1, "replies": [{"body": "Sure", "score": 2, "replies": [{"body": "Price targets look good for what it’s worth", "score": 1, "replies": []}]}]}, {"body": "Hoping you’re right! I picked up a hundred shares this week based of their pipeline and squeeze potential", "score": 1, "replies": []}, {"body": "It was not planned, I guess,  too many hedge funds involved here", "score": 1, "replies": []}, {"body": "The float is 76.5m shares, 41.3m is sold short(~54%). Institutions hold ~80% of the float. If a short squeeze begins, all shorts cant cover unless the big boys sell. This is unlikely to happen as most of them have price targets $15 plus.\nStock downside is little. They have $470m cash and no debt. Looking good for me.", "score": 1, "replies": [{"body": "Thanks", "score": 1, "replies": []}, {"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}
