{"title": "Tesla peaked at 10:10 on 10/10", "selftext": "", "id": "1g10ix4", "created_utc": 1728616597.0, "score": 82, "upvote_ratio": 0.87, "num_comments": 48, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 589 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "This weeks call buyers going to be sitting with bloody asses tomorrow morning", "score": 31, "replies": [{"body": "https://preview.redd.it/q44r5n3yj2ud1.jpeg?width=635&format=pjpg&auto=webp&s=d2065488d14b9a45a97f49e454b17239a8aa0290", "score": 13, "replies": []}]}, {"body": "It's the aurora borealis, northern lights caused the perfect symmetry in the numbers.", "score": 15, "replies": [{"body": "Elons autism is going crazy for it rn.", "score": 2, "replies": [{"body": "I'm here for it, elon is him.", "score": 1, "replies": []}]}]}, {"body": "TSLA is now a robotics company. 10 trillion market cap by end of 2026,", "score": 42, "replies": [{"body": "![img](emote|t5_2th52|18630)", "score": 22, "replies": []}, {"body": "Were you advised by cathie?", "score": 3, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "ok i gonna buy 1$ tesla share today for my pink lambo in 2026", "score": 1, "replies": []}, {"body": "Tell me how much all those other robotics companies are worth", "score": 1, "replies": []}]}, {"body": "Sell the news", "score": 8, "replies": []}, {"body": "![img](emote|t5_2th52|4276)", "score": 6, "replies": []}, {"body": "220 by morning ?", "score": 6, "replies": [{"body": "I think 225 area is bottom", "score": 1, "replies": [{"body": "Let’s see how it goes . Any may I had only few and avg is 190", "score": 3, "replies": []}]}, {"body": "Let's hope so", "score": 0, "replies": []}]}, {"body": "Where the fuck do you see this. On yahoo finance (and everywhere else I look) it just shows it at 239, for a +0.38% in AH. Where the fuck is that information (250, +5%) coming from?", "score": 6, "replies": [{"body": "Rohinhood's 24hr market", "score": 10, "replies": [{"body": "But where are they getting the info from? I'm not in the US, I don't have robinhood. Where can I see it? Surely they must be pulling the data from some official source, otherwise it means nothing, if it's just \"their numbers\"", "score": 1, "replies": [{"body": "they are pulling it from the overnight market. I saw it hit 250 on Interactive brokers as well.", "score": 7, "replies": [{"body": "And where can I access this \"overnight market\"? Is there a website? I just want to be able to see the current price", "score": 0, "replies": [{"body": "you can google it mate, it depends on your brokerage and access is not free. similiarlly when you use yahoo finance its free to you, but costs them.", "score": 8, "replies": [{"body": "Well, seems I can't access it anywhere. Sucks.", "score": -1, "replies": [{"body": "Just google the specific stock ticket and Robinhood ,\nhttps://robinhood.com/stocks/TSLA/\nOverall it’s not very accurate but it’s useful if you hold Chinese or Japanese stocks", "score": 6, "replies": []}, {"body": "yeah don't worry about it it varies widely and you can manipulate it easily. \n\noften its a few hundred orders, so you can press the price down or up quickly since not many people are trading.", "score": 2, "replies": []}]}]}]}]}, {"body": "Maybe you should get robinhood? I heard the gold was nice.", "score": 1, "replies": [{"body": "I can't, not available in my country.", "score": 0, "replies": []}]}]}, {"body": "Which is fake", "score": 0, "replies": []}]}]}, {"body": "No it stopped trading at 8 robinhood making shit up", "score": 1, "replies": [{"body": "Well now it's down to 233 in the overnight is Robinhood still making that up ", "score": 3, "replies": []}]}, {"body": "LOL", "score": 1, "replies": []}, {"body": "Wall streets regards know what they are doing lmao", "score": 1, "replies": []}, {"body": "Just mass produce these robots at low cost and train them to be paratroopers and sell it to the Ministry of Defence.   \nAt 20k to produce, it is defintely way cheaper to drop a battalion of these robots than humans. They dont even need to do much, just be a ammo sponge to drain the enemy's resources is good enough.", "score": 1, "replies": [{"body": "Yeah and the fun begins when robots shoot each other.", "score": 1, "replies": []}]}, {"body": "Cathie did this", "score": 1, "replies": []}, {"body": "Looks like some large investor played it safe", "score": 1, "replies": []}, {"body": "Why did it go down? I didn't see anything horrible in the livestream.", "score": -8, "replies": [{"body": "They didn’t show shit in the live stream. You cannot delay the event for 5 years and show a couple of toys that don’t do shit.", "score": 26, "replies": [{"body": "And tell everyone it’s still years away at best.", "score": 3, "replies": []}, {"body": "yeah but wasn't it almost always like this?! and every time the stock rose", "score": 1, "replies": [{"body": "Yeah, but the outlook was negative even before the event and then they showed bunch of toys without any focus on the execution.", "score": 2, "replies": []}]}]}, {"body": "You drinking too much of Elon’s sauce bro", "score": 8, "replies": [{"body": "I didn't even buy any TSLA, I was just curious lol.", "score": -4, "replies": []}]}, {"body": "It was a complete waste of time. They didn’t even debut a model 2. The intro EDM screensaver was on longer than the actual presentation.", "score": 4, "replies": []}]}]}
{"title": "Uber Eyes Breakout After 'Toothless' Tesla Robotaxi Reveal", "selftext": "[deleted]", "id": "1g1bxkn", "created_utc": 1728659098.0, "score": 309, "upvote_ratio": 0.88, "num_comments": 47, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 114 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Where’s the waymo breakout?", "score": 112, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|31226)", "score": 28, "replies": []}, {"body": "Don’t worry there’s only ten more chains of arbitrary managers to go through approvals before they announce something!", "score": 7, "replies": []}]}, {"body": "It's weird, most already knew Tesla won't deliver in robotaxis. Waymo and cruise are faaaar ahead, Tesla is insignificant in this Field and will be for the next 10+ years", "score": 167, "replies": [{"body": "Tesla is 10 years+ behind?\n\nTesla cars already drive themselves everywhere in the US.\n\nWaymo and Cruise have a combined 5 cities they can operate in?\n\nAnd Waymo and Cruise will never scale to the whole US because of their business model. They have $100K cars and need HD maps to work. If there's construction or a change in the road, they suck.", "score": -21, "replies": [{"body": "Teslas don't drive themselves, they are driver assistant not FSD, even with the recent improvements they require many interventions making them far behind Waymo and not viable for robotaxis.", "score": 17, "replies": [{"body": "I wouldn’t say many interventions, there’s plenty of intervention-less drives. Cruise however if you hadn’t checked isn’t operating at all for quite a few months now since it dragged that person under the car…", "score": -9, "replies": []}]}]}, {"body": "Waymo cabs cost a lot more and are geo fenced. If Tesla can pull this off in the next 5 years it’ll leapfrog waymo instantly", "score": -38, "replies": [{"body": "“Just five more years bro, trust me. Papa Elon is gonna make it happen for sure. He ALWAYS delivers, bro!”", "score": 12, "replies": []}, {"body": "They're geofenced because they're actually making a driverless car not one that needs constant baby sitting like Teslas. They've been '5 years away' from FSD for a decade now.", "score": 6, "replies": []}, {"body": "It's 2 seater dude it's not gonna leapfrog shit", "score": 4, "replies": []}]}]}, {"body": ">UBER breaks out because of Tesla failure\n\nLOL. Always thought it was stupid folks and/or the market priced Uber negatively because of Tesla. Why would you give a shit about Tesla if you're invested in Uber or Lyft? Tesla wasn't the leader before, isn't the leader today, and won't be the leader any time soon. \n\nTesla was SAYING they will make Robotaxi earlier this year and promising everything including making every tesla/elon dick rider think their model 3  will be picking up your groceries, dropping off your kids, allowing you to sleep to work, taking your wife out for dates with her bf, and making money while you sleep by being a robotaxi.\n\n**MEANWHILE WAYMO** was already fully autonomous. Was already on the streets. Was a platform that isn't only tied to 1 brand like Tesla but is a cross brand platform that can be worked onto Toyotas, Jaguars, or whatever cars you install it into. Was already driving people around for free. *And also started already giving people rides* ***AND HAVING PEOPLE FUCKING PAY FOR THEM.*** Like how Elon promised earlier this year that he'd reveal a robotaxi that MIGHT be in production by 2025/26 and then MAYBE giving people rides sometime further down the line! But Elon dickriders will disregard the facts because they have too much dick in their mouths.", "score": 62, "replies": [{"body": "Spoken like a true dick disbeliever, come join us and suck on this sweet sweet elongation. It's just 2 inches, won't even bother you.", "score": 4, "replies": []}, {"body": "Folks who bought FSD threw money down the drain", "score": 2, "replies": []}, {"body": "Right but people were holding their breath on Musk being able to pull this off in regular production cars without LIDAR. If he magically managed that somehow it would definitely disrupt some things", "score": 7, "replies": [{"body": "While we're at it let's put people on Mars, fix social media, make an artificial humanoid, and oh yeah, impregnate every woman in the world. If I can't do it, then obviously I'm not rich enough yet.", "score": 14, "replies": []}, {"body": "Why not LiDAR, what’s your take on Tesla decision here? Curious", "score": 2, "replies": []}]}, {"body": "Bro waymo admitted they have atleast 1 employee per car on the road, they may as well be remote operated with how many people they need controlling the fleet.", "score": 1, "replies": []}, {"body": "Waymo currently is lighting money on fire. Their current business model isn’t profitable w the cost of the tech and geofenced locations. It’s TBD on how they will be able to scale and be profitable.", "score": -20, "replies": [{"body": "Yep. Not a business if you don't make money.", "score": 0, "replies": []}, {"body": "Don’t waste your time here man all the libtards have bled into this sub", "score": -8, "replies": []}]}]}, {"body": "I think WS is underestimating how much damage Elon has done to the Tesla brand by going full Mike Lindell.  Nobody wants to be associated with Trumpsla anymore.  And he did the same to Twitter.  Big money is just trying to unwind their position now.", "score": 7, "replies": []}, {"body": "Can we ban “eyes” from Reddit already?", "score": 20, "replies": []}, {"body": "Uber shutdown its autonomous division a while ago. But they haven't been sleeping on it. They are heavily invested in autonomous via Aurora innovation and will be doing autonomous freight delivery. And the thing is that Aurora is developing a solution that can handle both trucking and normal commuting. I would not be surprised if they announced a collaboration to offer an autonomous taxi soon.  Auroras stock is up 150% since June.", "score": 1, "replies": []}, {"body": "This looks like the beginning of a pump and dump. ", "score": 0, "replies": []}, {"body": "I don't get it, because if Tesla Robotaxi rolls off the production line on time and everyone's buying one... wouldn't Tesla just create their own app/platform for the owners of the Robotaxis to get customers? \n\nKinda like Airbnb for taxis.\n\nWhy include Uber?\n\nTesla could handle it all and make money off of selling the cars and gathering data... perhaps charge a small platform fee?\n\nUber is just a useless middleman!\n\nEDIT: downvote me if you like to touch yourself when Elon's talking.", "score": -85, "replies": [{"body": "> if Tesla Robotaxi rolls off the production line on time and everyone's buying one\n\nlmfao dude", "score": 114, "replies": [{"body": "I heard that Bed, Bad and Beyond is planning to buy 420 of these to turn in to mobile stores.", "score": 38, "replies": []}, {"body": "The need for copium after yesterday's event is amazing", "score": 34, "replies": []}, {"body": "Robo taxis got that FSD release timeline.", "score": 7, "replies": []}, {"body": "No, but why would Uber stock go up 10% off of Tesla's event?", "score": 3, "replies": [{"body": "Read the headline. A spooky potential competitor just showed they won’t be competing any time soon.", "score": 3, "replies": [{"body": "Oh, haha! True. \n\nThanks for explaining instead of just downvoting ☺️", "score": 3, "replies": []}]}, {"body": "Has uber ever been profitable?", "score": 1, "replies": [{"body": "I think not!", "score": 1, "replies": [{"body": "Like Elon once said, \"You're not a real company if you're not profitable\".", "score": 2, "replies": [{"body": "Haha, well, it's true! But then again, profitability might be coming in the future?!?!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Have they ever launched a product on time?", "score": 19, "replies": [{"body": "I'm just wondering why Uber is getting any attention", "score": 2, "replies": []}]}, {"body": "in theory, sure. in practice? please refer to cybertruck and a decade of saying robotaxis are here.", "score": 21, "replies": [{"body": "I'm just wondering why Uber would go up after this event?", "score": 2, "replies": [{"body": "Uber partnering with Waymo to bring a similar product to market.", "score": 2, "replies": [{"body": "Right they are... Waymo needs Uber because Waymo doesn't have any users.", "score": 2, "replies": []}]}]}]}]}]}
