{"title": "Dow futures slide more than 300 points as investors weigh coronavirus and oil outlook", "selftext": "[deleted]", "id": "g09f1d", "created_utc": 1586742635.0, "score": 61, "upvote_ratio": 0.81, "num_comments": 80, "comments": [{"body": "Trump just retweeted a suggestion from someone that he fire Fauci.", "score": 45, "replies": [{"body": "This will start the next leg down if wall street has any brains left.", "score": 26, "replies": [{"body": "I do not think it will start this week.", "score": 2, "replies": []}, {"body": "Assuming there is a functioning brain on Wall Street right now :-/", "score": 1, "replies": []}]}, {"body": "From OANN... 🤦🏽‍♂️", "score": 24, "replies": [{"body": "Oh fuck seriously?", "score": 11, "replies": []}, {"body": "They're the only credible news outlet left though.\n\n-our president", "score": 12, "replies": []}, {"body": "Is this gonna be the new brietbart for this election cycle?", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "https://www.google.com/amp/s/www.nytimes.com/2020/04/12/us/politics/trump-fauci-coronavirus.amp.html\n\nGoogle is one hell of a search engine", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "He called out fake news \n\nLike sorry Jim,\nBut sorry fake news,\n\nRetards on here can’t even read but think they’re warren buffet", "score": 7, "replies": []}, {"body": "Go back to middle school and take some reading comprehension classes.", "score": 0, "replies": []}]}]}, {"body": "If it were green: \"Dow futures up 300 as investors are happy about OPEC agreement\" -- the market is fucking retarded. we still have plenty of time to be +1000 by the morning. It's bullshit, but it is what it is.", "score": 27, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Two weeks from now:\n\n“markets up to ATH due to record breaking unemployment figures”", "score": 7, "replies": []}]}]}, {"body": "Why do you idiots report futures when there’s like 10 hours left. Futures were red all last week at this time and we saw a green week.", "score": 139, "replies": [{"body": "Jpow could wake up with a boner from taking too much Cialis from fucking my puts and the market would turn green.", "score": 36, "replies": []}, {"body": "This, they flipped to green last Sunday around midnight.", "score": 26, "replies": [{"body": "That is a lie. Last Sunday the futures went green from opening. I still remembered the despair.", "score": 24, "replies": [{"body": "Lol you know this could be true and I might be confusing it with the weekend prior. This quarantine shit has my days all mixed together.", "score": 14, "replies": []}]}]}, {"body": "Fax", "score": 3, "replies": []}, {"body": "no", "score": 2, "replies": []}]}, {"body": "It’ll be green as fuck tomorrow", "score": 69, "replies": [{"body": "If all you can muster is ~1% down in futures, you're fucked come open on Monday", "score": 38, "replies": [{"body": "Yea i have puts but im done after tomorrow, fuck this rigged ass shit lol", "score": 17, "replies": [{"body": "That’s the spirit. Buy calls. 4/24 SPYc $297", "score": 3, "replies": []}]}, {"body": "Jpow \"pssshhhhtt\"", "score": 2, "replies": []}]}]}, {"body": "Futures...hah, they are like my first wife, look good in red but useless", "score": 13, "replies": []}, {"body": "Literally will be +700 by the morning don’t be dumb. Seriously a stupid headline this motherfucker is up 5k in 3 weeks and a slide of 300 means anything. Nothing about corona matters after we touched 1800", "score": 32, "replies": [{"body": "Japan markets down today. Thats why they reporting it. We will have to wait till Europe opens", "score": 8, "replies": [{"body": "Japan's been in the red since pearl harbor you androgynous hipster", "score": 54, "replies": []}, {"body": "We would have to slide like 3k points this week for there to be any concern about anything. If the fed can prop it up why the fuck wouldn’t they. Oh right they will.", "score": 12, "replies": [{"body": "I think we due for a correction thats all. Pretty fucked up how zillow is pumpimg this whole shit. Could be playing the fed and normal investors", "score": 6, "replies": [{"body": "What do you mean Zillow? There is no correction coming it will be the opposite of correct and go to 35000.", "score": 5, "replies": [{"body": "Zillow is the housing market amd its up when third of americans cant paay rent, so who the fuvk is buying a house with a failing a business. I believe theres stupid money in the market", "score": 2, "replies": []}]}]}]}, {"body": "correct me if im wrong, but i dont think there’s option trading in the asian markets...", "score": 3, "replies": []}, {"body": "Most of Europe is closed tomorrow", "score": 3, "replies": []}, {"body": "pretty sure europe markets closed for easter Monday. Too lazy to check", "score": 1, "replies": [{"body": "confirmed", "score": 1, "replies": []}]}]}, {"body": "Still holding at -1%", "score": 1, "replies": [{"body": "Hahaha. -1%. Its up 28% in 3 weeks. Again if they have the power to control this the fed that is why would they not. It’s not stopping", "score": 2, "replies": []}]}]}, {"body": "“18 months of rolling shutdowns” MN Fed President \n\nThese statement are what matters right now. We won’t be opening up everywhere, all at once, without restrictions. This will be a long drawn out process...\n\n>“Extreme volatility has been the rule in global markets for two months as traders struggle to price in the impact of the virus and the efforts to contain it. On Sunday, Fed Bank of Minneapolis President Neel Kashkari said that without an effective therapy or a vaccine, the U.S. economy could face 18 months of rolling shutdowns as the outbreak recedes and flares up again.”\n\n[Bloomberg](https://www.bloomberg.com/news/articles/2020-04-12/stock-bounce-hits-wall-with-u-s-futures-falling-before-earnings?srnd=premium)", "score": 9, "replies": [{"body": "How can anyone sustain a job if you could lose it within a month? Job market is going to be fucked.", "score": 7, "replies": [{"body": "Going to be interesting", "score": 6, "replies": []}]}]}, {"body": "We get it futures are red F off and let me enjoy my DMT without this negativity", "score": 33, "replies": [{"body": "Block WSB between Friday close and Monday open, better than fucking Ambien.", "score": 5, "replies": [{"body": "I refresh by new every hour on the weekends. What you are suggesting is blasphemy", "score": 3, "replies": [{"body": "Weekend posts be like \n\n\"MONDAY GREENER THAN HULK'S DICK DD INSIDE\"\n\nthe DD: \"me have calls\"", "score": 3, "replies": [{"body": "True. What do you expect to find with 1,000,000 retards here. No one knows anything and everything is a gamble", "score": 3, "replies": []}]}]}]}, {"body": "Preach. Booze, weed, and video games til sleep. I’ll deal with this shit bright and early.", "score": 1, "replies": []}]}, {"body": "lol I see from the comments that a lot of wsbers sold their puts at a loss and changed to calls at the top of the dead cat bounce in typical autist fashion...", "score": 14, "replies": [{"body": "When the general sentiment here turned bullish my gay bear senses started tingling.", "score": 12, "replies": []}, {"body": "If you're still calling it a dead cat bounce that means it's not over yet or it's going straight to ath", "score": 3, "replies": []}]}, {"body": "DOW futures (adjective) (points instead of %) as investors/wall st (recent news)", "score": 5, "replies": []}, {"body": "Need a 3000 point drop", "score": 4, "replies": []}, {"body": "Everybody 1....2....3 BRRRRRRRRRRRRRRRRRRRRRRRRRRRR....", "score": 3, "replies": []}, {"body": "👍 DOW 30,000 👍", "score": 14, "replies": [{"body": "Where’s my hat 🎩", "score": 7, "replies": []}]}, {"body": "Big green dick energy tomorrow with JPowell printer BRRRR-ing. Futures are fake news.", "score": 3, "replies": []}, {"body": "these bylines always try to include [current event] instead of years of pumping corporate debt", "score": 3, "replies": []}, {"body": "Not for long...", "score": 2, "replies": []}, {"body": "So what, they didn't weigh corona and oil outlook the last two weeks?", "score": 2, "replies": []}, {"body": "All you fucks did it. Couldn't just shut up and let the day be red. Everyone knows if you call out a red Monday then it won't exist anymore.", "score": 2, "replies": []}, {"body": "If only we fixed everything as quickly as the CCP right? Haha. Those lying f#@$s.", "score": 2, "replies": []}, {"body": "What time do they turn the brrr brrrrrr printers on?", "score": 3, "replies": [{"body": "Bout Tree Fiddy", "score": 6, "replies": []}, {"body": "9:29", "score": 1, "replies": []}]}, {"body": "Only the Asian and Australian markets are open. What happens right now is meaningless in the futures.\n\nEuro and US markets volume is where it's at.", "score": 3, "replies": [{"body": "when does eruo open, midnight US est?", "score": 2, "replies": [{"body": "Not till Tuesday it’s Easter Monday ma man", "score": 3, "replies": [{"body": " [https://heavy.com/entertainment/2020/04/is-stock-market-open-closed-easter-monday/](https://heavy.com/entertainment/2020/04/is-stock-market-open-closed-easter-monday/) \n\n&#x200B;\n\nsays otherwise", "score": 0, "replies": []}]}, {"body": "Nah, Europe doesn't matter that much too. Here in central Europe the show begins at 3:30 p.m. in the afternoon - when Wall Street opens.", "score": 1, "replies": []}]}]}, {"body": "300 points isnt even that bad.", "score": 2, "replies": []}, {"body": "There was a lot of bad news all week. +5% SPY by EOD", "score": 2, "replies": []}, {"body": "ja ja isn’t even awake yet this shit don’t count", "score": 2, "replies": []}, {"body": "Demnit Dondon. Fyre Fauci!", "score": 1, "replies": []}, {"body": "Honestly if the fed can just make the market do anything they want then why the fuck does it even matter. Like it’s not a fucking free market what the hell are we rooting for", "score": 1, "replies": []}, {"body": "If there are any cucks left holding US shale producers how you feeling right now?", "score": 0, "replies": []}, {"body": "dude, future is irrelevant. It's just people guessing what the spot market will be.", "score": 0, "replies": []}]}
{"title": "My last post for you retards - $SPY Bullish TA", "selftext": "$SPY Technical Analysis 4/13/20 - Bullish, Potential Entries on Monday\n\nA Quick Note: This is meant to be a purely charting and analytical approach to evaluating market movements.  Although I have been very successful in the past predicting movements traders should always make an effort to adjust their positions based on changing political and media landscapes. This approach isn’t meant to be any more accurate than a meteorologist predicting the weather. Take positions at your own risk and always do your own due diligence. I release these for thoughtful criticism from traders who use different approaches for analysis.\n\nTl;dr: Bullish in the short term but there is going to be a wall of resistance after 285. Sitting on call positions with a convex tail hedge and tightening my stops once the market price get above 285\n\nTicker: $SPY\n\nIntervals: 1W, 1D, 1H\n\nIndicators: MACD, KDJ, MA(200 & 50), ATR, NetVolume, VPVR\n\nSignals: \n\n1W: MACD Bearish Decreasing Divergence, Net Volume (730) Bullish, KDJ Oversold Converging Bullish  \n\n1D: MACD Bullish Divergent, Net Volume (190M) Bullish, KDJ Overbought Converging Upward\n\n1H: MACD Convergent Inconclusive, Net Volume (-21M) Slightly Bearish, KDJ Overbought Divergint Bearish\n\nKey Supports: \n\n257\n\n248\n\n243\n\nKey Resistances:\n\n273\n\n285\n\n297\n\nPosition: 280c 5/17 with convex tail hedge. \n\nTargets: Take profit at 283 or above. Looking for possible entries during a reversal at or below 257.\n\nNews: \\[“OPEC and its oil producing allies on Sunday finalized a historic agreement to cut production by 9.7 million barrels per day, following multiple days of discussions and back-and-forth between the world’s largest energy producers. The cut is the single largest output cut in history.\n\n”\\] (https://www.cnbc.com/2020/04/12/opec-and-allies-finalize-record-oil-production-cut-after-days-of-discussion.html)\n\nAnalysis: Bullish momentum seems to be building on longer intervals although history has shown that bear markets have the most significant rallies. Still expecting a continuation of bearish trends over the next few months but in the short-term bullish positions seem justified with potential entries presenting themselves early Monday. Take profit or tight trail stop target should be found at 283 or above.\n\nCharts: [https://imgur.com/a/HkK6hV0](https://imgur.com/a/HkK6hV0)\n\nOption Flow Data: https://imgur.com/gallery/FkIM1rL\n\nAlternative Plays: XOM, USO, MSFT\n\nYouTube Walkthrough on TA: [https://www.youtube.com/watch?v=bI0XgK-qdvc](https://www.youtube.com/watch?v=bI0XgK-qdvc)", "id": "g0dvcg", "created_utc": 1586761220.0, "score": 57, "upvote_ratio": 0.83, "num_comments": 82, "comments": [{"body": "I see lines. What lines tell I donnu. You say lines go up. But line not moving. Are you shaman ? Why trust lines ? Grug trust penis.", "score": 16, "replies": [{"body": "Grug penis get hard where lots of money buy stonk. Hedge fund have lots money. Hedge fund buy at line. Greg’s penis get hard at line.", "score": 8, "replies": []}]}, {"body": "[deleted]", "score": 38, "replies": [{"body": "Bull traps will continue just long enough for retards to go bankrupt. Such is the law of nature.", "score": 50, "replies": [{"body": "my thoughts exactly over the past month. this is pretty much maximum pain working like you'd expect", "score": 8, "replies": [{"body": "For sure. Trade on momentum not on expectations.", "score": 11, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Wtf are you talking about, I told everyone to take profit at 219. The bottom was 218.\n\n“Targets: take profit at 219 or below”\n\n\nhttps://www.reddit.com/r/wallstreetbets/comments/fn8yap/spy_technical_analysis_bearish_215p_417/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nNot that I don’t agree with your overall sentiment, but this shit is public record.\n\nI definitely did miss on my 256 CCS but if you followed all my TA you took a limited loss position after making a shit ton of money.", "score": 8, "replies": []}, {"body": "This is better dd than op", "score": -1, "replies": []}]}, {"body": "Nice emojis you 8 year old child", "score": -1, "replies": []}]}, {"body": "Where is this option flow data from?", "score": 5, "replies": [{"body": "Flowalgo and optionssonar", "score": 3, "replies": [{"body": ">Flowalgo\n\nthis flowalgo site is not even SSL not sure how much I would trust this site.", "score": 1, "replies": []}]}]}, {"body": "This supports my calls, take my upvote", "score": 16, "replies": [{"body": "I think your calls will be in rough shape early morning Monday but should be fine mid week.", "score": 8, "replies": [{"body": "So buy calls early morning is what I’m hearing", "score": 7, "replies": [{"body": "Yeah, just don’t be greedy with your exit.  Set a stop b/c the macro is against you.", "score": 10, "replies": []}]}]}]}, {"body": "I have some SPY 280 calls for 4/17 and sold 284s for 4/13.\n\nHow fucked am I? I thought I was crafty selling some that would almost certantly expire worthless., but I'm afraid I'll be bagholding on Tuesday.", "score": 8, "replies": [{"body": "Statistics are in your favor but fuuuuuuuuck that’s  gonna be a really tight exit if it works out.", "score": 9, "replies": [{"body": "Yep. Going to be rough. haha. I was planning to exit after earnings are announced on Tuesday. I probably should have entered on Monday instead of Friday :/", "score": 2, "replies": [{"body": "🙏 blessed be your tendies brother.", "score": 4, "replies": []}]}]}, {"body": "You thought selling an OTM call would expire worthless over a weekend of no trading? Wtf?", "score": 1, "replies": [{"body": "My bet was that Monday would trade sideways as people anticipate hesitate before bank earnings are announced. If SPY goes up I can't lose money.\n\nDon't be so dense.", "score": 2, "replies": [{"body": "I mean futures are down and it closed at 278 so the 284 C is probably gonna be fine. I have a 259/256P spread expiring friday", "score": 1, "replies": [{"body": "Your puts should be good on Monday but I think J-Pow and Trump are doing everything they can to make the economy look rosy. My calls are a hedge against my SPY puts. I'm going to roll them out sometime mid week and pick up some more puts.", "score": 3, "replies": []}]}]}]}]}, {"body": "Good ta", "score": 3, "replies": []}, {"body": "Yes yes but tell me, do my jizz stains say if I’ll find fortune and romance this week?", "score": 3, "replies": [{"body": "Yes, your mom will be in the apex of her fertility cycle. Smash when venus is aligned with the Moon.", "score": 6, "replies": []}]}, {"body": "Thanks OP. It’s crazy how all the people doubting you never check your post history at the very least", "score": 3, "replies": []}, {"body": "I’ll go ahead and beat you to it...\n\n“BuT mAh fuTuRes”\n\nSaid the fucking idiot in a coma for the passed 3 weeks.", "score": 3, "replies": [{"body": "Futures are down ALOT. I mean spy ended Friday at 278 and right now it's at 274 lol", "score": 1, "replies": [{"body": "Remember that day they were limit down 2 weeks ago? \n\nIf you want to get bent over; by all means...\n\nSPY will open red then molest you with green.\n\nEventually this shit will capitulate, but it won’t be before Wednesda imo.", "score": 3, "replies": []}]}]}, {"body": "Since we don't know when it's gonna drop, how about longing spxu / spxs shares?", "score": 2, "replies": [{"body": "Not a bad idea, but hold out until the EOW before you take a position.", "score": 2, "replies": []}]}, {"body": "Thanks for the generous TA! Just checked out your YouTube channel and I’m digging the KDJ gospel. Gonna go through all your videos in the coming days and learn the way :)", "score": 2, "replies": []}, {"body": "Appreciate the effort and perspective. Always good to aggregate thought-out bullish and bearish views and make a decision from there.", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Do you plan to do these analysis every week?  I think it's really good and I am trying to learn TA.", "score": 1, "replies": [{"body": "Yeah, I’ve done these TA every week for 2 months now but this is the last one on WSB", "score": 3, "replies": [{"body": "Where do you plan to go from now on?  I will follow up and read them every week.", "score": 1, "replies": [{"body": "I think it’s against the rules to mention specifically, but you’re welcome to message me.", "score": 5, "replies": [{"body": "You can post it in your profile", "score": 2, "replies": []}]}]}, {"body": "Are you going to be posting to another sub on reddit?", "score": 1, "replies": []}, {"body": "Why are you no longer doing it for wsb?", "score": 1, "replies": []}]}]}, {"body": "You sir are a professional retard I’m ready to see blood monday", "score": 1, "replies": [{"body": "Lol you should read the comments on my last post.\n\nHighlight was “dOwnTreND iS LosIng stEaM”\n\nGood luck!\n\nCautious for sure, but retarded. No. Autistic.. certainly.", "score": 3, "replies": [{"body": "After every market crash there’s is a huge rally, guess what comes right after that.", "score": 1, "replies": [{"body": "Dude... can you read?  Then read “analysis”.\n\nYou may be interested in taking green dicks to your butthole.  Idk, I’m not judging, but that’s not my thing.", "score": 4, "replies": [{"body": "Do you think that it will be red tomorrow? futures are looking down rn. just curious.", "score": 1, "replies": [{"body": "In a lot of my videos I’ve referred to 257-274 as “no mans land.”\n\nThere’s no data, no volume, just WSB subs getting bent over by hedge funds. Join theta gang or grfo at this price level.", "score": 1, "replies": []}]}, {"body": "Ngl I didn’t read ur trash ass post all I gotta say is red monday", "score": -5, "replies": [{"body": "Dude... you’re on to something. Go all in!!!!! Hold till EOD for sure.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Of course you hold calls. TA allows any retard to find a pattern that supports their book", "score": 1, "replies": []}, {"body": "SPY to $300 EoW?", "score": 1, "replies": []}, {"body": "What do you think of long VIX? I feel like volatility should take off again with a daily mix of good and bad news or will they never reach March levels?", "score": 1, "replies": [{"body": "Unless we have some kind of completely out of the blue catastrophe, we’re not going to see VIX 70-80 again.  Could possibly see 50-60 of there is some secondary tremors like in 2008, but you have the FED injecting itself way ahead of anything at this point so there won’t be any high profile cascade failures like we had then.   Most likely we’ll stay in the 30-50 range for a couple months while trending down.", "score": 2, "replies": []}]}, {"body": "Thanks!", "score": 1, "replies": []}, {"body": "Thanks for the red dildo...BAN", "score": 1, "replies": [{"body": "You're welcome.  Does this mean you're banned now?", "score": 1, "replies": [{"body": "Apologies fellow autist, stoncks go up some days, down on others. Holding short-term hedges that I'm looking to move out of around 285 as well", "score": 1, "replies": []}]}]}, {"body": "Have your thoughts changed on this yet?", "score": 1, "replies": [{"body": "Naw, I figured Monday and possibly Tuesday would be red.", "score": 1, "replies": []}, {"body": "tightening my stops today at open to lock in profits.", "score": 1, "replies": []}]}, {"body": "Update:\n\nAs of 10pm 4/13 this position looks live! Let’s hope Tuesday’s open swings our way.  I’m moving my take profit to 280-281. This position was like picking up pennies in front a steamroller anyway so I don’t plan on getting greedy.", "score": 1, "replies": [{"body": "OP you netted me a %50 gain. Thank you.", "score": 2, "replies": [{"body": "You’re welcome!  Enjoy the tendies!", "score": 2, "replies": [{"body": "Can you PM me where I can find your TA in the future if not here?", "score": 1, "replies": []}]}]}, {"body": "I just wanted to take a second and say thank you, your TA allowed me to finally break a 2 week losing streak. Dumb question but how long are those support and resistances good for? I'm guessing weekly based on your post but wanted to ask. If the 285 resistance holds do you think that will start a large leg down (with the rally fizzling out) or do you think we may look to trade sideways for another week?", "score": 2, "replies": [{"body": "I redo them weekly but unless we see crazy high volume at new price levels (which is totally possible) they’ll likely be meaningful for months.\n\nThis shit is a greed frenzy. I think there’s good reason to believe there will be a reversal around 285-295 I’m not willing to bet more on it than my hedging strategy dictates anyway. Being early in this case is the same as being wrong.\n\nSo I’m just sitting on cash and amazon stock (cuz why tf wouldn’t you be) until I see a play and TA supports an entry.\n\nEnjoy those perfectly cooked tendies!", "score": 2, "replies": [{"body": "I appreciate the insight. I've definitely bled a signficant portion of my account by being too early. I think a drop will come but, no surprise, the timing is everything.", "score": 1, "replies": []}]}]}, {"body": "If you're moving your take profit are you rebuying or switching positions to puts?", "score": 1, "replies": [{"body": "Looking for put entries but being careful about it. SPY shouldn’t be up this much this fast but it can keep going way longer than I can hold onto puts.", "score": 1, "replies": [{"body": "So if it fails 285 resistance you’re gonna load up on puts? At what strikes", "score": 1, "replies": [{"body": "I think if it fails resistance once its not a strong enough signal at this point. Im gonna be cautious", "score": 1, "replies": []}, {"body": "I got a couple small puts I’m using as part of my convex tail hedge.  272 0dte and 241 5/20. I wouldn’t recommend either as a primary play but since I bought my tail at 281 it’s going pretty great. Especially since I closed my primary leg at 283.5", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Fuck you... buy 25m after open. Give up if it drops another .50%. Sell EOD Tuesday.", "score": 5, "replies": [{"body": "Calls 25 min after open? Then sell eod tuesday ?? 290c 4/17??", "score": 1, "replies": []}]}]}, {"body": "This TA is bull-shit. No patterns involved. The fuck knows what you look at. You have a few levels. No fibs, no MA. Busy chart. That’s why it’s astrology cuz you have no fucking clue what you look at", "score": -1, "replies": [{"body": "Lol “no fibs”", "score": 4, "replies": [{"body": "What’s so funny? There are people that exclusively trade fibs", "score": -1, "replies": [{"body": "They’re fucking insane. I use fibs but without volume fibs might as well be tea leaves.", "score": 3, "replies": []}]}]}]}, {"body": "3/13/20? You have a time machine?", "score": -5, "replies": []}, {"body": "[deleted]", "score": -8, "replies": [{"body": "K, good luck.", "score": 3, "replies": []}]}]}
