{"title": "Looks like another UPPIE tomorrow", "selftext": "[https://i.imgur.com/oDt0EEH.jpg](https://i.imgur.com/oDt0EEH.jpg)\n\ni've plotted the DIX GEX and S&P over the last week to get a better picture of short term expectations. these are just indicators and of course everything could behave contrary to what i believe but the simple conclusion obtained from having big DIX is there is a higher chance S&P will be bought up tomorrow. the negative GEX is also giving a greater chance of a large movement due to elliot's fibonacci noodles among other legitimate reasons better explained by someone other than me.\n\n**TL;DR** \\- GREEN TOMORROW load up on puts at 265  \nrip to the 4/3 p's (i'm holding my dix and SPY 5/1 240p among other things)\n\n**4/1 EDIT**: this was wrong because of eom rebalancing as some commented but now DIX is up even higher than yday and GEX is even more negative so tomorrow is the real UPPIE! we’re going to the moon SPY 260 tomorrow.\n\n**4/2 EDIT**: what a battle. we tested key highs and low levels and ultimately ended up right at 252. honestly expected it to break resistance earlier in the day but the DIX was not hard enough. DIX has dropped to 48.5% but is still at a generally bullish level and GEX is still negative. as it was bought up into close i’m expecting another UPPIE day towards 260. good news for oil is bad news for puts. \n\n**4/3 EDIT**: had a slow roll down day with uppies to close. jobs report blew out the 100k expectation by 7x. if not for the jobs report would’ve expected a big green but nonetheless the bullish outlook has taken VIX down today. DIX still up at 50%. GEX still negative. would’ve liked to see DIX drop down over this last week but the little guy is here to stay. I had open SPY 247p’s expiring today and wasn’t even worried about assignment bc of the expected eod volume. OIL is looking to maintain its rebound next week with expected good news coming out of russia and saudi talks. IF talks somehow fall through we can expect a tumble down and VIX coming back to life otherwise look for DIX to take us up toward 265 monday. UPPIE MONDAY ahead. good news from oil talks will take us higher. covid not likely to get worse than already projected so bears have little on their side.\n\n**4/6 EDIT**: closed right at 265. DIX has now dropped down to 44% while GEX turned up positive. looks like buying interest has subsided a bit but it’s still possible to climb from here. expecting a slow roll throughout the week testing a new high above 266 before dropping down to establish a higher low level. VIX is getting lulled to sleep so it’ll be a good time to reup on puts if you’ve left some capital for further speculation moves. i’ll be going in on some short term high strike puts this week to take advantage of the inevitable drop ahead. until there’s a cure or definitive step forward with the virus the V shaped recovery is not on the menu. i don’t believe it and as soon as retail investors start to believe it we’ll be heading down. oil is also still in limbo. was expecting good news to push market up further but delays have actually had a reverse effect. will hold out for some oil news before reupping puts. expecting tomorrow to hold a FLATTY 265.\n\n**4/7 EDIT**: closed right at 265. DIX slightly up to 48% and GEX up a bit more into positive. oil tanked a bit but we have OPEC thursday and G20 emergency meeting friday. still a lot of factors that can play into next week and expecting the unknowns to cause a selloff before the long weekend. with two more days to go i don’t know if there will be enough confidence in these DIX to buy bigly tomorrow. i’ll be expecting a DOWNIE but just don’t feel there will be much movement. close at 262.\n\n**4/8 EDIT**: i was way off - closed at 274. the big DIX ain’t scared of no drop. oil shot up based on reports of a 10 mil production cut. OPEC meeting tomorrow 10am EST with lots of pressure on saudi to comply. DIX is up to 50% but i don’t see a much room for more upside. it would be an extremely bullish position to buy above 275 and again i just don’t see us there yet. long weekend coming up and expecting a dump to end the day. looking for 275 to be our ceiling tomorrow and a general sell off as it seems we are overbought with this level of uncertainty ahead. many companies have already entered indefinite cost cutting cycles with dismal results expected in upcoming quarterly reports. DOWNIE tomorrow with SPY closing at 266. keep an eye on opec. also fyi i’m just updating this for myself but leaving it as a resource for others to inverse me if they choose :)\n\n**4/9 EDIT**: closed at 278. felt very confident shorting every time it went up to test 280 today. behaved very predictable for a change and almost second guessed myself because it was too good to be true. DIX posted at 48.9% today still not showing telling signs of a drop off. G20 tomorrow but i’m not expecting anything substantial from it. i still maintain the opinion that we’re overbought above 275 and will be looking for a downturn eventually. monday expected to be a slow climb barring any major news over the weekend as recovery confidence is building and market will want to test higher levels. expect a trading range similar to today ending with an UPPPIE 282 close. i’ll probably do some more analysis over the weekend and make a new post if i discover anything insightful. hope my basic reporting helped the 3-4 of you that were checking up with me. until next time!", "id": "fsoiy4", "created_utc": 1585699426.0, "score": 40, "upvote_ratio": 0.66, "num_comments": 84, "comments": [{"body": "I know excel too", "score": 58, "replies": [{"body": "this was far more complicated. i used an **online** charting tool", "score": 36, "replies": [{"body": "Sounds like you wasted far more time", "score": 36, "replies": [{"body": "good thing my time is only worth $1200 per.. total", "score": 28, "replies": [{"body": "Go in front of a mirror and say to yourself, \"I figured out how to predict the stock market\". If this was somehow possible and you were right, you would win Nobel Prizes, have a national holiday in your name, and would also be the most powerful person in the world.", "score": 0, "replies": []}]}]}]}, {"body": "This guy numbers!", "score": 5, "replies": [{"body": "Hey guys if you will look at my post from 40 days ago I said to buy vail (MTN) and I need it to go up please", "score": 1, "replies": []}]}]}, {"body": "Irrational market. Red tomorrow.", "score": 31, "replies": [{"body": "but you should always inverse what you've concluded. green tomorrow", "score": 21, "replies": [{"body": "which is what the market would expect you to think, red tomorrow", "score": 33, "replies": [{"body": "What if it expects you to expect that so it actually goes green?", "score": 10, "replies": [{"body": "then it should go red because I’m expecting green 🤯", "score": 9, "replies": [{"body": "It knoes ur lyin, frend", "score": 3, "replies": []}, {"body": "this is like that princess bride poison scene so the market is both red and green and always wins", "score": 3, "replies": []}, {"body": "markets actually gonna open and close with no change and stay flat all day", "score": 2, "replies": []}]}]}]}, {"body": "Why could this high DIX not be because of large funds EOM rebalancing?", "score": 3, "replies": []}]}]}, {"body": "If it’s green I’ll suck your dick", "score": 23, "replies": [{"body": "i hate being right ;)", "score": 7, "replies": [{"body": "spy 250", "score": 2, "replies": []}, {"body": "Well you weren't, maybe about April 2 though, still have to see", "score": 2, "replies": []}]}, {"body": "MODS", "score": 2, "replies": [{"body": "MoDs", "score": 1, "replies": []}]}]}, {"body": "No me digas eso papi", "score": 18, "replies": []}, {"body": "Isn’t a high DIX indicative of increased short positions? That would mean we should see a downtrend", "score": 16, "replies": [{"body": "What if I love DIX?", "score": 10, "replies": []}, {"body": "it is a bit counterintuitive but a majority of buys are registered as MM shorts since they do not actually own the shares. DIX > 40% or so is generally bullish", "score": 5, "replies": []}, {"body": "Don’t ask this guy", "score": 4, "replies": [{"body": "you go for it then", "score": 4, "replies": [{"body": "Head and shoulders were revealed on the SPY today. Means bull run is cancelled and tomorrow we drill. So technically you’re right but for different reasons", "score": 2, "replies": [{"body": "can you draw the head and shoulders for us? i'm having trouble seeing them on my chart", "score": 9, "replies": [{"body": "Take a look at my post history. Auto mods hate my guts", "score": 1, "replies": [{"body": "automod just thinks you're wrong :(", "score": 1, "replies": [{"body": "Don’t think it works like that", "score": 1, "replies": []}, {"body": "5 min chart bro", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "[removed]", "score": 8, "replies": [{"body": "your true love will show himself to you under the moonlight. learn chinese: happiness - kuai le. lucky numbers: 3 13 23 27 32 41", "score": 4, "replies": []}]}, {"body": "Don't think so, sorry. Negative GEX with selling momentum into the close = strong downward move. Unless there's some reversal, we're going down, fast. The DIX spike may just have been EOM fund rebalancing.", "score": 6, "replies": []}, {"body": "This is good and all but what do geckos have to do with stocks?", "score": 5, "replies": [{"body": "if they eat 10 mins before market close next day is green. u/buttermenasty can confirm", "score": 4, "replies": []}]}, {"body": "You could’ve thrown darts at a board and still made a more compelling chart than this. Head and shoulders are in. Tomorrow we drill.", "score": 3, "replies": [{"body": "i knew i should've drawn some curvier lines", "score": 1, "replies": []}]}, {"body": "I have calls so please be right", "score": 3, "replies": [{"body": "imagine buying calls during the worse pandemic the world has ever seen", "score": 3, "replies": []}]}, {"body": "Lol", "score": 3, "replies": []}, {"body": "The gecko didn't eat the worm so it's red. No need for analysis.", "score": 3, "replies": []}, {"body": "Good job with the edits! Keep it up.", "score": 3, "replies": []}, {"body": "idk why it showed me a 6 days old post on sticky pin but I don't regret it. Keep it going OP!", "score": 3, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": [{"body": "yum yum", "score": 2, "replies": []}]}]}, {"body": "You're kind of a buzzkill dude.", "score": 3, "replies": [{"body": "i'm sorry. futures are 1% red, you will print!", "score": 4, "replies": []}]}, {"body": "This can't be true. The weekend dow is clearly red good sir", "score": 2, "replies": [{"body": "much respect for the weekend dow. the lines may adjust our trajectory by friday", "score": 1, "replies": []}]}, {"body": "DJA broke out of uptrend from the bottom for the first time today, and futures are down 400 points from today's close. Would be blown out of my mind if tomorrow is green", "score": 2, "replies": [{"body": "your mind won’t be the only thing getting blown if i’m right", "score": 1, "replies": [{"body": "Your wife's boyfriend?", "score": 1, "replies": []}]}]}, {"body": "This is not how DIX works. When DIX is high and gamma is negative you’re more likely to see a sell off.", "score": 2, "replies": [{"body": "sir your DIX is not being handled correctly. if DIX is > 45% we can still see a sell off but odds are less likely", "score": 2, "replies": []}]}, {"body": "Market tomorrow is sideways because theta wants to kill me", "score": 2, "replies": []}, {"body": "ELI5 DIX & GEX to me please", "score": 2, "replies": [{"body": "if you have big DIX of over 45% flaccidity levels, it’s likely to go up. negative GEX increases chance erection blood flow will either reach functional engagement UP or completely constrict flow to drop DOWN. positive GEX makes erection blood flow slow and leaves you in a middle state where neither pleasure can be achieved nor is there loss of hope. \n\nDIX = dark pool dollar weighted short volume. also it’s useful to know that DIX > 45% has corresponded with roughly a 5% return over the next 2 month period. \n\n-GEX = higher likelihood of MM rebalancing gamma positions through either buying or selling at a quick rate", "score": 1, "replies": []}]}, {"body": "I’m expecting green so it’ll be red", "score": 2, "replies": []}, {"body": "ehh, i dunno, i think that tomorrow is going to be flat or go negative. i base this on nothing other than intuition", "score": 2, "replies": []}, {"body": "I’d say it will be green for airlines tomorrow.", "score": 2, "replies": []}, {"body": "Yeh keep trying to predict this wild market by the lines on your chart, did they tell you when the stimilus bill was gonna come out? how about the amount of unemployment? Did they tell you Coronavirus was coming?", "score": 1, "replies": [{"body": "no but they are solid informants with the current information on the table. the lines are more powerful than you think", "score": 1, "replies": [{"body": "this is more powerful\n\nhttps://www.newyorkfed.org/markets/domestic-market-operations/monetary-policy-implementation/repo-reverse-repo-agreements/repurchase-agreement-operational-details", "score": 2, "replies": []}]}]}, {"body": "So inverse WSB?", "score": 1, "replies": []}, {"body": "WTF is this dog shit?", "score": 1, "replies": []}, {"body": "This doesn’t count if the market opens at 9:45 tomorrow", "score": 1, "replies": [{"body": "the breaker man is on furlough", "score": 1, "replies": []}]}, {"body": "Hope your right my dude", "score": 1, "replies": []}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Come on guys it's back to red green red green. So *that's* why tomorrow is green", "score": 1, "replies": []}, {"body": "Wow. Looks like my puts are gonna print.", "score": 1, "replies": []}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Fake news.", "score": 1, "replies": []}, {"body": "This only applies if we’re full bull, trending up \n\nIf that was the top of the bounce, then this chart is useless.", "score": 0, "replies": []}]}
{"title": "Stop buying short term options you idiots", "selftext": "All of you retards buying or holding options that expire in less than a week, complaining about 90% losses and then selling to switch sides a week late. You're a bunch of fucking dumbasses and I know because I'm one of them. After losing 93% of my portfolio trying to play short term I came to my senses and used my remaining cash to buy 5/15 245 puts. Sell weekly puts to cover the cost and make easy fuckin money. This was my #1 strat with calls before the crash.", "id": "fsvgej", "created_utc": 1585728164.0, "score": 198, "upvote_ratio": 0.85, "num_comments": 79, "comments": [{"body": "Sir, this is a casino", "score": 340, "replies": [{"body": "[removed]", "score": 19, "replies": [{"body": "Truly inspiring. Many don’t know this, but the song “Pump it up” by Joe Budden is actually a late birthday gift dedicated to Mr.Pump", "score": 8, "replies": [{"body": "Everything makes sense now. Bet you that’s mister Pump’s favorite birthday gift of all time. I bet he likes that even more then he likes pumping the spy 5-6% while eating his big Mac in the white noise by sending a tweet. \n\nThat’s legendary gambler for those of us on the spectrum we can only ever dream of being the Pumper in Chief \n\nI love this timeline", "score": 1, "replies": []}]}, {"body": "\\#2 maybe.  RIP Kenny Rogers.", "score": 5, "replies": []}]}, {"body": "A casino where most people walk up to the blackjack table, and then turn around, throw their money on the ground and cry about manipulation", "score": 16, "replies": []}, {"body": "No, this is JPow's Thunderdome", "score": 5, "replies": []}, {"body": "Speaking of casino, why aren't my czr puts printing?? The company isn't even operating!!", "score": 3, "replies": [{"body": "Because that was priced in\n\nStonks only go up", "score": 2, "replies": []}]}, {"body": "Sir this is a mac donalds", "score": 0, "replies": []}]}, {"body": "no keep buying weeklies with a <25k account\n\ni need to make a living selling options so i can feed my wife and her boyfriend", "score": 126, "replies": [{"body": "BOY KEEP YOUR MOUTH SHUT. CANT TELL THEM THE TRUTH.", "score": 20, "replies": [{"body": "He should keep that in r/wsbtheta", "score": 1, "replies": []}]}]}, {"body": "Going bankrupt in a week makes me feel alive", "score": 25, "replies": []}, {"body": "Imagine buying weeklies but not being able to day trade more than 3 times?\n\nI can imagine bc I gambled my last in order to get above 25k now that we Here I’ll never look back, 3 day trades a week what a sick Fucking joke. \n\nI’m making 115 trades a day now come see me DT police. \n\nI’m legal", "score": 24, "replies": [{"body": "You could have day traded with a cash only account you fucking autist", "score": 4, "replies": [{"body": "Once a day lol! \n\nI like to use all my ammo, I’m a size trader. So with cash I could buy 10k of Tesla pits and sell it once. \n\nAfter you take the training wheels off, I can buy and sell those 10k of Tesla calls as many times as I please. Might take 500$ off the top here, 1000$ there, etc. if it Moves against me\nI sell too", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I suppose the purest would call it so, ya, myself I’m a degenerate gambler doing the best I can. \n\nWhat I mean more than a full scalp is say like today the market finds a daily low and starts to bear flag up and out, well when I see that happening I can reduce size on my position by 50-75-90% and lock in 🔐 some profits while it finishes the move, then buy back in at the top. \n\nIntraday scalps while size trading the momentum of the whole move to Maximize gain and minimize loss", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Honor and a privilege my fellow autist brethren. I remember when I first started many many years ago and how overwhelming and complex the markets can be. Spent many tens of thousands learning myself what not to do, and slowly learned what to do. Finally broke the 25k barrier this year and haven’t looked back! Praise be to God brother. \n\nAnything I can do to help those new to the venture fulfills my soul. If you have any questions feel free to ask, good job on the trades so far it sounds like you’re doing pretty good.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "What are you trading today / this week if I may good sir?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Wow that’s a bold move. Based on the meetings coming up or just on the fact that it’s so cratered? Ya that’s smear that’s what I try and do as well. 5.5 is above average, if I can get 7-8-10 hundred is when I’m really happy. \n\nYa man honestly 3-6% a week isn’t for me, not my trade style. I’m a size trader, and my gains aren’t 98% like yours but days like today when I’m up 50% if more than makes up for that. I’m a size trader. I usually only write if I see a good opportunity on a slow market (burn someone else with theta instead of me getting burned lol) or if I wanna stack a synthetic. Now are you letting it sit to expire or buying to close at -50, -25% etc?\n\nLike you said the thing the mostly turns me off from writing ✍️ isn’t the low premiums, it’s the collateral you need to write high ticket 🎫 contracts.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "BUY MORE WEEKLY PUTS.", "score": 20, "replies": []}, {"body": "Lick the dick, we are retards. We don't know any better.", "score": 32, "replies": []}, {"body": "I bought $229 puts 4/20 randomly picking $229, should I have picked a different strike price? There's not much volume on mine :D", "score": 35, "replies": [{"body": "Lmao that \":D\" face kills me\n\nAre you European or prepubescent?", "score": 48, "replies": [{"body": "Serious question: I know where European is, but where is prepubescent?", "score": 37, "replies": [{"body": "Lmao flair this man \"from prepubescent region\"", "score": 40, "replies": [{"body": "Pleaseee", "score": 5, "replies": []}]}]}, {"body": "lol its like „are you european or gay?“", "score": 14, "replies": [{"body": "Is there a difference?", "score": 4, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Before I was a gay bear I would say European but now I don’t know when they ask..", "score": 2, "replies": []}]}]}]}]}, {"body": "If it's SPY you'll be fine for volume. I would've picked something less OTM but you do you", "score": 9, "replies": [{"body": "180p 5/15 is much better I agree", "score": 8, "replies": []}]}]}, {"body": "your not my dad shut up", "score": 20, "replies": []}, {"body": "Sir this is a Wendy's. Do you want a large coke or not?", "score": 19, "replies": [{"body": "Yes, may i speak with Wendy please?", "score": 10, "replies": []}, {"body": "I'd like a large coke put thank you", "score": 3, "replies": []}, {"body": "I’d love a large line of coke. Thanks 😋", "score": 3, "replies": []}]}, {"body": "Most people don’t have the money to be selling puts", "score": 13, "replies": [{"body": "You never heard of a calender spread?", "score": 9, "replies": [{"body": "Why calendar over vertical", "score": 7, "replies": [{"body": "Easier to spell", "score": 22, "replies": [{"body": "No it not.", "score": 5, "replies": []}, {"body": "Cal lender, verticle, vert tickle.    \n      \nSpelling is hard. Long FDs!", "score": 1, "replies": []}]}]}, {"body": "Is that one of those naked lady pin-ups?", "score": 1, "replies": []}]}]}, {"body": "anyone see a yacht around here?", "score": 6, "replies": []}, {"body": "Spy 220p 4/1 it is. Thanks for the dd", "score": 6, "replies": []}, {"body": "Ya buy late April SPY puts in the third week in March and lose money like a real man!", "score": 4, "replies": []}, {"body": "So buy May puts and offset it with sell to open weekly puts. What if the weekly puts gets assigned?  How do you unwind?", "score": 4, "replies": [{"body": "If you get assigned, your long put will cover it. Ideally, you dont let that happen by rolling your short put to a lower strike price if its getting too close. You'll have to pay a debit for that and probably lose the initial premium but its preferable to the alternative.", "score": 3, "replies": [{"body": "How much of a strike price margin would you recommend when selling the weekly puts. For example, SPY is at $250 today and you wrote an option expiring Friday, so 5%? So $237.5?  Or less of a margin, like 3% or $242?", "score": 1, "replies": [{"body": "I sold one today at $242.5. There's no right answer, it's just about what you wanna risk", "score": 2, "replies": [{"body": "So if the price goes down to $243, do you buy the put back, take the loss and sell a new one at $230 or whatever? Am I understanding correctly?", "score": 1, "replies": [{"body": "Yes, pretty much.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "So I should be selling weekly options for easy profit?", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Looks like you'll print hard at open but any intra-day rally will fucking destroy you. Not worth the risk. Don't bet against theta", "score": 4, "replies": []}, {"body": "Looks good, just get rid of it before midday tho. Maybe at morning drop", "score": 2, "replies": []}]}, {"body": "Is september still short term?", "score": 3, "replies": []}, {"body": "SPY 4/20 120 put with a vol 3 6 9\n\ndamn it time... \n\nWorld Ending", "score": 3, "replies": []}, {"body": "-3.10% in only 36 minutes in futures indices 🌈🐻", "score": 5, "replies": []}, {"body": "No but I need the money fast because I have a giant gay Manbearpig in my backyard that I’m hiding from Al Gore and I need to feed him and it’s expensive.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Cause of retarded bets where people will think SPY will drop to $200 by 4/3", "score": 1, "replies": []}]}, {"body": "https://www.reddit.com/r/wallstreetbets/comments/fsrj07/quit_buying_shortdated_puts_you_fucking_idiots/?utm_medium=android_app&utm_source=share\n\nYou mean, like this?", "score": 2, "replies": []}, {"body": "Poor man's covered put is for poor people. Rich only on wuzbee. BAN", "score": 2, "replies": []}, {"body": "😅😂😂", "score": 1, "replies": []}, {"body": "Throw them dice baby 🎲", "score": 1, "replies": []}, {"body": "Theta gonna get ya", "score": 1, "replies": []}, {"body": "Never!", "score": 1, "replies": []}, {"body": "But that 4/2 SPY 165P only costs like 10 dollars :O", "score": 1, "replies": []}, {"body": "Fuck you. SYY30 and DRI30 on APR 9.", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "Can you give an example weekly put?", "score": 1, "replies": []}, {"body": "You still had 7% of your portfolio left??? What a fukkin loser....", "score": 1, "replies": []}]}
{"title": "SEC Extended 1st Quarter Reporting by 45 Days", "selftext": "SEC  extends deadline to provide certain disclosures, such as earnings, by 45 days, so MarketWatch asked all 30 Dow components their plans.  The Securities and Exchange Commission  will allow companies to delay reporting earnings, if needed, but that doesn't mean any of them will.  The  SEC  said last week that [it would extend the deadline](https://www.sec.gov/news/press-release/2020-74) for companies to provide certain disclosure reports by 45 days, given business disruptions resulting from the COVID-19 pandemic. The companies requesting delays just have to provide a summary of why an extension is needed for each report, the  SEC  said. Read [MarketWatch's Coronavirus update](http://www.marketwatch.com/story/coronavirus-update-803650-cases- 39033-deaths-and-white-house-expected-to-release-models-showing-trajectory-of-illness-2020-03-31).  Some of the companies within the Dow Jones Industrial Average have already issued press releases stating when their earnings reports will be released. But as many companies have withdrawn financial guidance, given difficulties in assessing the potential impact of the coronavirus health crisis, they can still look to push back releasing those reports.  Don't miss: First-half earnings are a bust as coronavirus stops companies in their tracks. Will the second-half be better? [It depends](http://www.marketwatch.com/story/first-half-earnings-are-a-bust-as-coronavirus-stops-companies-in- their-tracks-will-the-second-half-be-better-it-depends-2020-03-26).  MarketWatch asked all 30 Dow companies whether they would take advantage of the added flexibility in reporting results.  Here is what the companies that responded said (in alphabetical order):\n\n American Express Co. .(AXP)  \n American Express  is scheduled to report first-quarter first-quarter results on  April 24 .  \n\"We are still focused **on 4/24** as a date,\" said  Marina Norville , vice president of corporate affairs and communications.\n\n Caterpillar Inc. .(CAT)  \n(CAT)\" Caterpillar's  first-quarter earnings will be released on **April 28, 2020**  as stated in the company's recent press release issued  March 26, 2020 ,\" said  Kate Kenny , corporate media manager at  Caterpillar , in an emailed response.\n\n Chevron Corp. .(CVX)  \n(CVX) Chevron  is projected to report first-quarter results **on or about  April 24**, according to FactSet, after reporting result on  April 26  a year ago.\n\"We are planning to report our earnings following a similar schedule and process as we have done in the past,\" said  Sean Comey , senior adviser--external affairs at  Chevron .\n\n Cisco Systems Inc. .(CSCO)  \n **Cisco  lists  May 13**  as the date for fiscal third-quarter results on its investor-relations website.\n\"We have no plans to change our timing,\" a  Cisco  spokesman said.\n\n Coca-Cola Co. .(KO)   \n(KO)Coca-Cola is projected to report first-quarter results on or about  April 28 , according to FactSet, after reporting results on  April 23  a year ago  \nA company spokesperson said there was \"**no additional information to share at this time.**\"\n\n Dow Inc. .(DOW)  \n(DOW)Dow said it would report first-quarter results on  April 30  \n\"Consistent with our normal quarterly reporting process, our 10-Q is expected to file shortly thereafter,\" a spokesperson said.\nA year ago, the company reported first-quarter results **on  May 2 , and filed its 10-Q on  May 3**.\n\n Exxon Mobil Corp. .(XOM)  \n(XOM)\"We're still planning to issue a press release and hold an earnings call **on  May 1**,\" a spokesperson said in an emailed statement  \nA year ago, the company reported first-quarter results on  April 26  and filed its 10-Q on  May 2 .\n\nGoldman Sachs Group Inc..(GS)  \nGoldman is scheduled to report first-quarter results **on  April 15**  \nA spokesperson said Goldman expects to report earnings \"as previously scheduled.\"\nA year ago, the company reported first-quarter results on  April 15 , and filed its 10-Q on  May 6 .\n\n Home Depot Inc. .(HD)  \n Home Depot  is expected to report fiscal first-quarter results on our about  May 19 , according to FactSet  \n\"**We haven't announced any changes in timing**,\" a company spokesperson said.\nLast year, the company reported first-quarter earnings on  May 21  and filed the 10-Q on  May 29 .\n\n Intel Corp. .(INTC)  \nIntel is scheduled to report first-quarter results **on  April 23**  \n\"Our timing has not changed,\" a spokesperson said.\n\n J.P. Morgan Chase & Co. .(JPM)\n(JPM) J.P. Morgan  is currently scheduled to report first-quarter results on  **April 14**.  \n\"We're on track to report as scheduled,\" a spokesperson said.\n\n Microsoft Corp. .(MSFT)  \n Microsoft  is projected to report fiscal third-quarter results on  April 23 , according to FactSet, after reporting last year's third-quarter results on  April 24 .\nThe company said it **didn't have anything to share** about the timing of its coming earnings report.\n\n Travelers Companies Inc. .(TRV)  \nTravelers said on  March 9  that it will review first-quarter results **on  April 21**  \n\"As of right now, we are still on a schedule,\" a spokesperson said.\n\n Verizon Communications Inc. .(VZ)  \nVerizon said earlier in March that it will conduct its first-quarter earnings call  **April 24**.  \n\"We have no plans to change our timing,\" said a company spokesperson said in an emailed statement.\n\n Walgreens Boots Alliance Inc. .(WBA)  \n Walgreens  (WBA) said on  March 2  that it will report fiscal second-quarter earnings **on  April 2**.  \nA spokesperson for the company said, \"WBA has not changed its earnings date.\"\n\nThe following companies **did not immediately respond** to a request for comment:\n\n 3M Co. .(MMM)  \n**Apple Inc. .(AAPL).**  \n **Boeing Co. .(BA).**  \n International Business Machines Corp..(IBM)   \n Johnson & Johnson (JNJ).  \n McDonald's  Corp..(MCD).  \n Merck & Co. Inc. .(MRK).  \n Nike Inc. .(NKE).  \n Pfizer Inc. .(PFE).  \n Procter & Gamble Co. .(PG).  \n **UnitedHealth Group Inc. .(UNH).**  \n United Technologies Corp. .( UTX ).  \n Visa Inc. .(V).  \n Walmart Inc. .(WMT).  \n Walt Disney Co. .(DIS).  \n\n 03-31-20   1748ET", "id": "fswdx8", "created_utc": 1585732603.0, "score": 256, "upvote_ratio": 0.97, "num_comments": 84, "comments": [{"body": "Useful info, thanks!", "score": 92, "replies": [{"body": "[removed]", "score": 37, "replies": [{"body": "no good deed goes unpunished, eh?\n\nFor what it's worth, I always ~~delete~~ deactivate my accounts when they get banned and I have double digits worth of aged accounts waiting on the sideline, so ban away!", "score": 56, "replies": [{"body": "Evading bans with multiple accounts? Oooo, that's a ban!", "score": 32, "replies": [{"body": "Don't forget the VPNs.", "score": 20, "replies": [{"body": "#B&", "score": 9, "replies": []}, {"body": "It’s amazing to what lengths you’ll go to be on this demented sub. I love it!", "score": 3, "replies": []}]}]}, {"body": "Children throwing around Bans. Stupid.", "score": 1, "replies": []}]}]}]}, {"body": "Shoutout to CAT they let me push off all my heavy equipment loan payments four months. Long CAT and construction cuz we actually make shit", "score": 52, "replies": [{"body": "Fuck yeah, I work for cat (rebuilding/Remanufacturing big trucks). Actually think we’ll weather this a bit better than a lot of companies", "score": 11, "replies": []}, {"body": "You still own the payments for the four months right?", "score": 6, "replies": [{"body": "Yes just helps free up litquidity for tendies", "score": 8, "replies": [{"body": "Yeah a lot of places are doing that but my familys Business was not profitable even during good times.", "score": 4, "replies": []}, {"body": "We are going to go bankrupt. Already maybe getting that sweet airbn money when this settles down.", "score": 1, "replies": []}]}]}, {"body": "If construction crews actually made anything, housing prices wouldn't be crushing two generations.     \n       \nCAT $69 4/20", "score": 2, "replies": [{"body": "My house went from 250k - 400k in two years", "score": 4, "replies": [{"body": "...", "score": 4, "replies": []}, {"body": "Exactly, long Z. Home builders love housing costs being so high because it jacks up their margins, and home flippers love it, too, which further increases valuations. And, landlords live it because it lets them increase their rents....which just increases home values due to people being willing to pay higher mortgages to escape renting.", "score": 1, "replies": [{"body": "Ahh well it’s fucking land bro, there is only a finite amount, my lot is estimated at 300k , structure is only valued at 90k And sheds 10k (which is ridiculous cuz it only cost me 2k. It’s the way they assess     Jacked up land cost!  So if your house is burnt to the ground they still get big taxes every year.    -Fuck you pay me -", "score": 1, "replies": [{"body": "Truth. My homes are all ~$600k. Two are shitholes adjacent a university, the other is 15 minutes from those two, twice as nice, and nearly twice the size. So, Les, location, sure. But, I was mostly referring to suburbia. In most places, builders can still sprawl outward and/or build upward. They don't as to control supply. Rather than build high quantities at a quality people want and can afford, they build low, low quantities at qualities people want but absolutely cannot afford. Imo, fuck home builders, but while they're fucking the poor, I'll profit from understanding how/why they're doing it -- knowing they won't stop doing it.", "score": 1, "replies": [{"body": "Most can’t, once your in construction your locked into ownership, and owing money.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Wow they really are rigging the fucking game.", "score": 23, "replies": [{"body": "They are attempting to mitigate the collapse of the economy by prolonging it, because if they can delay the worst then maybe a cure/vaccine can be found, or maybe people will start wearing masks, which would allow us all to resume a semi-normal day to day life.  But there must be a solution to C19 that works before the economy can return to normal, so what you are seeing is delay tactics.", "score": 4, "replies": []}, {"body": "Haha yes but it’s not a game...sure these companies don’t deserve the easy way out, but nobody who cares about the economy is trying to let it go to shit over a virus we didn’t propagate. \n\nThat being said, SPY 205 4/17", "score": 3, "replies": []}, {"body": "I'm actually willing to give them the benefit of the doubt here--no company is operating normally right now, and the people that do the actual work to prepare earnings statements are probably more worried about trying to stay safe and keep themselves sane during quarantine.\n\nPlus, it increases uncertainty and that's good for my puts.", "score": 2, "replies": []}]}, {"body": "Prolonging the inevitable. \n\n$SPY 220p 6/5", "score": 20, "replies": []}, {"body": "Hahah rigged market what in the fuck is going on", "score": 31, "replies": [{"body": "Maybe we'll be able to get out ahead of the bots?\n\nOr maybe the Fed will gain a week or three to paper over the entire mess.\n\nI'm not here to call heads or tails; just here to flip the coin.", "score": 9, "replies": [{"body": "I'll be the first to say it... I congratulate J Pow and Trump. Those two psychos are more autistic than any of us. They already have and continue push the date of this collapse out about 30 seconds before it happens. Those two are inventive, I will give them that!", "score": 7, "replies": []}]}]}, {"body": "Ok so now my 4/17 and 4/20 puts are effed", "score": 36, "replies": [{"body": "depends... if the market needs confirmation, then, yeah, probably.\n\nif everything is priced in even before earnings are announced, probably not.", "score": 28, "replies": [{"body": "I needed a Vega spike around earnings because I bought at ~60, even if my puts are ATM or maybe ITM I won't be able to make a profit. Right now I'm hoping to sell to stop the bleeding.", "score": 9, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Let's hope...  (I hate the word \"hope\"... it's right up there with \"believe\")", "score": 6, "replies": []}]}]}]}, {"body": "This could lead to uncertainty, literally the opposite of priced in.", "score": 10, "replies": [{"body": "Turn that could to has *!*", "score": 2, "replies": []}]}, {"body": "Ok ok yes yes so what’s my strike", "score": 8, "replies": []}, {"body": "The market loves delayed ER.\n\nSpy 300c 4/17", "score": 8, "replies": []}, {"body": "Wow. What fucking bullshit is this. thanks for the info though!", "score": 5, "replies": []}, {"body": "It would be a terrific sign in most cases if these companies delayed. If they have been impacted, waiting a month more means having to provide a realistic update of 2Q as part of 1Q release. If they don't want to do that, investor confidence will be at all time lows.", "score": 5, "replies": []}, {"body": "Great post thanks 🌈🐻", "score": 3, "replies": []}, {"body": "I don't know why I am surprised anymore.", "score": 5, "replies": []}, {"body": "How the fuck does this not create more uncertainty and thus more FUD selling. \n\nOh wait! If we dont talk about or recognize a problem then it obviously must not exist. Ah yes the equity market will act like a fucking ostrich, putting its head in the ground until people go back to work and everything is “okay”\n\nWe have officially entered ostrichnomics guys, for the love of god please buy long dated contracts, apparently 6 months out now because the government will just keep changing the rules until they fuck every retail investor to keep the big boys afloat", "score": 3, "replies": []}, {"body": "Too much text...\n\ndo I buy puts or calls?", "score": 8, "replies": [{"body": "Find the groups of three big letters in that text wall and buy puts that say june\n\nAnd no not SEC", "score": 24, "replies": [{"body": "Thank you good sir, these are instructions I can follow", "score": 3, "replies": []}]}, {"body": "If they’re pushing the q1 earnings date that means more days in q1. More days in q1 means more revenue!", "score": 4, "replies": [{"body": "That's completely wrong. They're pushing back the filing date not the quarter end date dipshit. They're still reporting 1/1/20 - 3/31/20, they just have more time to get their financials and disclosures together. Keep in mind that the people that release earnings need to figure out what guidance to give because of the virus and people are working from home. Smaller companies might have more difficulties managing this than larger companies, so the SEC is giving relief.", "score": 1, "replies": [{"body": "Wow. I didn't think anyone on here could possibly be dense enough to read that epic post as anything but sarcasm. I was wrong.", "score": 6, "replies": []}]}]}, {"body": "Magic 8-Balls say:  \"wait and see\"", "score": 1, "replies": []}]}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": [{"body": "Good bot", "score": 7, "replies": [{"body": "Thank you, LazyMeal, for voting on AutoModerator.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)", "score": 2, "replies": [{"body": "Go back to /r/investing retard.", "score": -1, "replies": []}]}]}]}, {"body": "gotta pump the market more up. ffs!", "score": 2, "replies": []}, {"body": "Holding onto inverse ETFs (SDOW and SPXS) is turning out to be a really good idea given how many delaying tactics are being used to keep the market afloat. I would've been done in by theta otherwise.", "score": 2, "replies": []}, {"body": "I should’ve fucking read this before buying my May puts man.... fucking bullshit", "score": 2, "replies": [{"body": "I did release this before the market was open.", "score": 1, "replies": []}]}, {"body": "Buying June puts, three comma club here I come", "score": 1, "replies": []}, {"body": "yeah, nobody will know anything is wrong if the numbers dont get reported", "score": 1, "replies": []}, {"body": "u/variation-separate", "score": 1, "replies": []}, {"body": "Not too much of a big deal just gives these companies more time to figure out how bad their future guidance will be", "score": 1, "replies": []}, {"body": "These delay tactics are not looking good for those with puts. If I were to buy any options right now it would have to be in June.", "score": 1, "replies": []}, {"body": "What absolute bullshit. What we’re seeing is so farcical. Numbers dogshit? Welp, don’t report em! Heyyyyyyy", "score": 1, "replies": []}, {"body": "Delaying the inevitable", "score": 1, "replies": []}, {"body": "Everything they do it's pointless except to fuck over shorts. Delaying earnings is going to be a huge red flag and have the same effect on the stock anyway", "score": 1, "replies": []}, {"body": "That's extremely desperate", "score": 1, "replies": []}, {"body": "Ban", "score": 0, "replies": []}, {"body": "Did you just did a shitty copy paste job?", "score": -9, "replies": [{"body": "maybe?\n\nCan you do better?\n\nAt least I don't use shitty sentence constructs like \"did you just did [...]\".", "score": 21, "replies": [{"body": "Im already on my pajama, so not rn.\n\nEdit to your ninja edit: english is hard. No idea how i can construct my sentence in a better way to point out your garbage editing skills.", "score": 0, "replies": [{"body": "Its yo quiero", "score": 4, "replies": [{"body": "Mod made the flair on the fact that im mexican.. which makes it worse since i despise taco bell", "score": 2, "replies": [{"body": "Wait.... was the mod mexican too?  ...you know as a side job after ripping off the Tijuana city government renting vehicles to them under the umbrella of his higher-up-the-political-food-chain father (now dethroned).", "score": 3, "replies": [{"body": "I dont think the mod was mexican", "score": 1, "replies": [{"body": "You're kind of missing an inside joke.  I'd link to the video exposé that spills all the beans (so to speak), but I can't be bothered to find it again.  Let's just put it this way:  one of your countrymen runs /r/WSBs and he's crooked as hell (and we love him exactly for that reason).", "score": 1, "replies": []}]}]}, {"body": "Que padre wey. De dónde eres en México?", "score": 2, "replies": [{"body": "Monterrey", "score": 2, "replies": [{"body": "Me encanta Monterrey. Está bien tranquila. Cuídate bro", "score": 2, "replies": []}]}]}]}]}]}]}]}]}
{"title": "GME is about to get hit hard", "selftext": "[deleted]", "id": "ft42f9", "created_utc": 1585761745.0, "score": 56, "upvote_ratio": 0.73, "num_comments": 77, "comments": [{"body": "GME is a portfolio killer, can’t really play it even if it goes in your direction.", "score": 50, "replies": []}, {"body": "Not enough meat on that bone.", "score": 32, "replies": []}, {"body": "Uhhhh the premiums are fucked. Good luck with that 200%+ volatility.", "score": 21, "replies": [{"body": "[deleted]", "score": 24, "replies": [{"body": "honestly the october 4$ options are looking juicy as fuck...\n\neven if they go complete tits up your maximum loss is going to be $200 per option after the premiums, and looking at gamestops current books their position actually ain't as bad as people make it out to be. lots of value to be unlocked if an activist investor swoops in and divies up the company.\n\nalso the next console cycle will definitely bring in extra cash, even if it is going to hurt it in the long term, in the short term it will provide gamestop with some much needed cash infusions.\n\n&#x200B;\n\nthinking of selling a shitload of gme 4$ puts for october, maybe even january 21 as I don't think the company is going tits up in the near future", "score": 2, "replies": [{"body": "That's a hell of a gamble man but hey high risk, high reward.", "score": 1, "replies": []}]}]}]}, {"body": "It's down 35% in 3 trading days. You missed the boat", "score": 14, "replies": [{"body": "Lol now it’s going to bounce harder than a strippers tits. I hope he can handle the ride he is about to go on.", "score": 2, "replies": []}]}, {"body": "OP is a shit comedian. Ban.", "score": 12, "replies": []}, {"body": ">along with their business license suspended in Pennsylvania, which is sad for the eight people that live there  \n\nPA is the 6th most populated state in the US you dumb idiot", "score": 14, "replies": []}, {"body": "Hey ghost of Christmas past", "score": 6, "replies": []}, {"body": "They couldnt afford the ticker $GAME huh?", "score": 4, "replies": []}, {"body": "Is it going to get hit as hard as PTON? Fucking thing won’t die", "score": 5, "replies": [{"body": "Only thing I’ve ever seen a stationary bike used for us to hang clothes. 5/9 135", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "My $3ps expire Friday. I think I am fuk.", "score": 5, "replies": []}]}, {"body": "It's getting to the point where liquidating everything they have will result in > 2$ a share. you're trying to squeeze juice out of a used lemon.", "score": 3, "replies": []}, {"body": "I would do this but Michael burry sees something we don’t, not gonna go against him", "score": 3, "replies": []}, {"body": "Every day someone posts about GME. Y’all really need to stop pumping this GME short. The whole world knows it’s going under and its options are already priced for that. You missed this trade. Stop chasing it and go look for the next one.", "score": 3, "replies": []}, {"body": "first of all, ill be fucking pissed that i cant get the .02 cents for my copy of The newest madden after a week of playing and realizing its the same game with some bullshit catch mechanic added.\n\n&#x200B;\n\nsecond of all, dont bet against a stock that has hovered $3-4 during the madness and crushed q1\n\n&#x200B;\n\nthird, do you want any dippin sauces at the window?", "score": 2, "replies": []}, {"body": "Look at this retard buying puts on something with no volume.", "score": 2, "replies": []}, {"body": "GME will undoubtedly go tits up. The problem is we can't know when and the options market is designed so your maximum gain from your stunning revelation will probably be capped at about a nickel per share. Thanks for the heads up, though.", "score": 2, "replies": []}, {"body": "Fuck off", "score": 2, "replies": []}, {"body": "Fuck off", "score": 2, "replies": []}, {"body": "Sold my 4.50p 5/15, 2 days ago for an ok profit.  Not mad", "score": 2, "replies": [{"body": "I’m contemplating selling my $3 puts. Could snag a decent gain right now. Might give it another day", "score": 2, "replies": [{"body": "Happy today?", "score": 2, "replies": [{"body": "Yep. I closed out for over 50% gain (which in two days is pretty good IMO). If I missed out on a little more, oh well. It's pretty oversold, so I imagine it can't go down that much further given that it is undervalued (trading below book value per share), and it is under $3/share now", "score": 1, "replies": []}]}]}]}, {"body": "I've been holding 5/15 $4p for a 1-2 weeks\n\nHas only been profitable today with the exception of a short 150% jump last week. Break even price of 2.90. Looks like an easy play, but one can easily get burned especially if you hold", "score": 2, "replies": []}, {"body": "Wtf. Theres no volume on these options man, wtf ban", "score": 2, "replies": []}, {"body": "You're about 7 years late buddy. Other than that, awesome post.", "score": 2, "replies": []}, {"body": "Odd dig at Pennsylvania - 6th largest population.", "score": 4, "replies": []}, {"body": "Hey ghost of Christmas past", "score": 1, "replies": []}, {"body": "Back to shilling", "score": 1, "replies": []}, {"body": "Priced in along with pretty much every retailer. Would be wary of a pop and squeeze", "score": 1, "replies": []}, {"body": "doing better than blue light special Kmart.", "score": 1, "replies": []}, {"body": "Should anybody tell him?", "score": 1, "replies": []}, {"body": ">So for the eight of you with half of a brain cell, you’ve probably already heard GameStop is in financial trouble\n\nAnd anyone with 1/2 of a braincell already know it's priced in. GME is on a downward spiral since forever. Take a look at IV. It's priced in via the IV.", "score": 1, "replies": []}, {"body": "Ban", "score": 1, "replies": []}, {"body": "Pump and dump", "score": 1, "replies": []}, {"body": "Pump and dump", "score": 1, "replies": []}, {"body": "I’ve holding 7/17 $3.5, IV has been weird here. But I’m fairly certain I’m on the right side of this trade.\n\nGME reported an earnings beat on RH, my friend showed me is Phone and the screen shot of the notification - but my TradingView says they missed. I’m legit confused. Either way, I’m only in with 2 contracts and riding this one as far as I can.", "score": 1, "replies": []}, {"body": "Volume is low but if you hold till expiration this is still good DD", "score": 1, "replies": []}, {"body": "They treat their employees like shit so I doubt even they will be upset", "score": 1, "replies": [{"body": "And their customers", "score": 1, "replies": []}]}, {"body": "Problem with GME is people would still want niche stores dedicated to very small subsets of the consumer market. GME fulfills that need", "score": 1, "replies": []}, {"body": "Right now is an awful time to buy. The stock is so low, IV is so high, and volume is relatively low. The time to buy it was like 2 weeks ago. Everyone knows its going down", "score": 1, "replies": []}, {"body": "You know. If gamestop doesnt stop existing by september 2020. \n\nThen they will be worth 30$ by 2022", "score": 1, "replies": []}, {"body": "Hd", "score": 1, "replies": []}, {"body": "Priced in bought calls 🇮🇱", "score": 1, "replies": []}, {"body": "You're trying to short a fucking penny stock? GTFO, ban.", "score": 1, "replies": []}, {"body": "Great DD it's not like it has 110% short interest", "score": 1, "replies": []}, {"body": "Fuckin Keith.", "score": 1, "replies": []}, {"body": "isnt GME one of the companies Michael Burry is buying up?", "score": 1, "replies": []}, {"body": "isnt GME one of the companies Michael Burry is buying up?", "score": 1, "replies": []}, {"body": "Oh wow you’re gonna make a lot of money with these puts, wow....", "score": 1, "replies": []}, {"body": "Oh wow you’re gonna make a lot of money with these puts, wow....", "score": 1, "replies": []}, {"body": "I am shocked the bid-ask spread is only $0.02.", "score": 1, "replies": []}, {"body": "Sold my 4.50p 5/15, 2 days ago for an ok profit.  Not mad", "score": 1, "replies": []}, {"body": "Sold my 4.50p 5/15, 2 days ago for an ok profit.  Not mad", "score": 1, "replies": []}, {"body": "You wanna know how BAD GME is off right now?\n\nI tried to short a couple hundred shares today and my broker won't fucking let me because there are no shares to short.\n\nL.M.A.O.", "score": 1, "replies": [{"body": "Been like that for months. Shorts have paid massive fees but the stock has floated at $3-6 range forever. Can't really go bankrupt in the near term with all the inventory, cash, real estate + low debt. Maybe if they have a bad holiday season, but that's unlikely since we have console launch coming up.", "score": 1, "replies": [{"body": "I was able to short it a few weeks ago - did so for a bit of easy money.\n\nAnd I'm not sure where you think any of what you just said matters when GME is closing like all of its stores en masse and doesn't even offer proper online gaming... or even delivery. Just store pick up. They're gonna be making fuck all for money during the coming months. Sure - near term they might be okay. But we don't know how long this will last, haha. And they'll just be hurting the whole time until it resolves.\n\nNot to mention they already made a few pretty major PR blunders during the COVID crisis that reduced investor, consumer, AND employee confidence in their business.", "score": 1, "replies": []}]}]}, {"body": "Don't bet against Michael Burry", "score": 1, "replies": []}, {"body": "Nope", "score": 1, "replies": []}, {"body": "Retards", "score": 1, "replies": []}, {"body": "Dont even touch gamespot. Way too expensive for any payout", "score": 1, "replies": []}, {"body": "Hahaha fucking LMAO every once in a while there is this one schmuck that thinks he found a holy grail of all shorts. Only to get dicked hard by a company that’s slowly and surely going under, yet the stock acts funny and puts never print.", "score": 1, "replies": []}, {"body": "A bit late probably. I lucked out and sold my 3.5 puts today and managed to double but I think I lucked ok ut with my timing", "score": 1, "replies": []}, {"body": "Shorting a company trading under liquidation value with short leases is kind of retarded.\n\nThey could just sell off their inventory, complete their leases, sell their real estate, pay off their debt, and have more than $1B left over.\n\nIf you're shorting at $4/share you're betting that management is going full retard, although that's already priced in.\n\nBurry bought into Gamestop because he knew it was trading under 33% of liquidation value and 2020-2021 earnings will prob be decent.", "score": 0, "replies": []}, {"body": "They also have very little debt and a shitload of assets, even if they don't make a penny for a year they won't go below ~$2.50.", "score": 0, "replies": []}, {"body": "It's gonna skyrocket when Sony and MS announce their console release dates.  Historically GME soars from the time of the announcement up until console release. It won't hit $56 ever again, but $30 by early November is reasonable.  Or they go bankrupt before then and I'm out of fun money.", "score": -1, "replies": []}]}
{"title": "I think NRZ calls are a smart, short term play.", "selftext": "[deleted]", "id": "ft8b86", "created_utc": 1585774085.0, "score": 78, "upvote_ratio": 0.9, "num_comments": 65, "comments": [{"body": "Thanks. Think I’ll sell some more NRZ calls tomorrow. Well actually just one. But hey. Something is better than nothing", "score": 28, "replies": [{"body": "Sell puts too if you want a cheaper way in for some shares 🤷‍♂️", "score": 7, "replies": []}]}, {"body": "IV crush. They just massively reduced dividends. Could be on general downward projection over next few weeks after that bounce.\n\nI'm long on nrz but I've just been buying shares. Maybe grab a couple calls if it keeps dropping", "score": 13, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "I'm not vehemently against buying a few calls just don't feel comfortable on anything expiring so soon after that stimulus bounce.", "score": 5, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Yeah, I'm definitely buying more shares here soon and averaging down.", "score": 2, "replies": []}]}]}]}]}, {"body": "Why not just buy the stock if you’re talking about a $4 company that’s mostly an income play? If your DD says they’ll be good and will be paying $1 div/year in a year on a $4, seems like a better play to me. Not a WSB play, but a good one if it works out.", "score": 13, "replies": [{"body": "I agree, their market cap is tiny! Thanks though, reasonably solid looking company", "score": 1, "replies": []}]}, {"body": "Well this post was a day early, looks like a buy now!", "score": 8, "replies": []}, {"body": "Good play, thank you", "score": 7, "replies": [{"body": "Agreed. Gracias", "score": 4, "replies": []}]}, {"body": "Lol down 20% and halted", "score": 7, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": []}]}, {"body": "Lol", "score": 5, "replies": []}, {"body": "do you think buying and holding these would be a good idea?", "score": 4, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Haha, true. I was honestly looking at this stock since it was like $16 (i think that was its peak). Thinking about buying 100 and holding for a couple years.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "My only thoughts are they haven’t been around as long as other REITS. This is really the big test for them to see if they come through or not", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "OMG! Those both plummeted and were doing relatively well. That’s literally insane. Do you think either of those have any room to recover? I’m imagining buying 100 shares each for literally pennies and getting a ton of money back lol", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "This is a really dumb question man, i’m still learning here but if those other two REITS do go bust, does their stock go to $0? What would happen", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Gotcha man. Hoping my SPY 235 and 250p 5/15 will print soon lol", "score": 1, "replies": []}]}]}]}]}, {"body": "Same.   I've made a little on MFA and NRZ,  but I'm staying out until things settle down a bit more with the economy.  I'll try to buy them as long term holds in a few months.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "[https://imgur.com/a/tJwkG0q](https://imgur.com/a/tJwkG0q)   \nLooks like you're at a turning point. Either current price breaks through the bottom and you get another run down, or the bottom is rejected and you bounce up. Tomorrow should dictate where it's going for the near future.\n\n \n\ntl;dr if it's green tomorrow, you're right. If it's red tomorrow you will lose big.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I will not buy these puts and wait it out cause I have a funny feeling it will dip if I buy lol", "score": 3, "replies": [{"body": "You missed. 2,000% gain", "score": 1, "replies": []}]}]}]}, {"body": "Not bad, I'll bite", "score": 3, "replies": []}, {"body": "Did you make something semi intelligent from my shot post? And does this mean I should pay my mortgage ?", "score": 3, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I have liked it all year until everything got scary as fuck. I’m still holding some but panic sold a while ago and bought puts", "score": 2, "replies": []}]}]}, {"body": "This is how you lose 100% even with shares.", "score": 3, "replies": []}, {"body": "I love it in concept. But isn't it still tracking with the general market? Looks like it. Which means a bounce is unlikely if market continues down, no?", "score": 3, "replies": []}, {"body": "NRZ is getting close to being a good long term hold.", "score": 3, "replies": [{"body": "When isn’t it close anymore?", "score": 1, "replies": [{"body": "I added today, I would love to see it in the 3 range which is possible in the coming weeks.", "score": 1, "replies": [{"body": "Well, here’s your chance... I shouldn’t have bought in at $6 :/", "score": 2, "replies": []}]}]}]}, {"body": "Fuck you dude", "score": 6, "replies": []}, {"body": "Real estate is fucked why the fuck would anyone buy real estate shit", "score": 4, "replies": []}, {"body": " This reeks of a pump and dump.", "score": 5, "replies": [{"body": "Isn't volume to high to make that work?", "score": 4, "replies": []}]}, {"body": "Why the hell not. I'm in.", "score": 2, "replies": []}, {"body": "Take my $38 and move on", "score": 2, "replies": []}, {"body": "I like this OP, if I print I will let you know", "score": 2, "replies": []}, {"body": "I loaded up NYMT, MFA, and NRZ 1-month charts side-by-side. They all have a very similar shape and those two dips and bounces were in all of them. Then I pulled up SPY, and while they are not as pronounced, it has the same dips and bounces. SPY just had a longer and higher bounce after the last dip.\n\nWhile none of this means jack shit for predicting what will happen tomorrow, it does suggest that all these stocks are just following SPY, and the general consensus around here is that SPY will keep dropping for at least a couple of weeks. That general consensus means jack shit too.\n\nIt just seems that this is more of a Yolo play than a DD play.", "score": 2, "replies": []}, {"body": "I hope you played this like I did. If so bravo to you sir!  Or ma’am", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Up another 30% today... I sold it for a small loss end of last week. Biting my teeth now.", "score": 1, "replies": []}]}]}, {"body": "Are there any other REITs or BDCs worth looking at? $NLY, $PSEC or $AGNC?\n\nThe CEO for $PSEC has bought a lot of shares in recent weeks.", "score": 2, "replies": [{"body": "Nrz also had a fair amount of insider trading between $5.50-7. I also bought into mfa", "score": 3, "replies": []}, {"body": "I’ve been buying up O and SCHH. Somehow picked the 23rd (luck?) Scooping up more if they fall anywhere close to that again.", "score": 3, "replies": []}, {"body": "Look at HASI.  Mortgage REIT that finances energy efficiency improvements etc.  They're also involved with some wind farms and solar etc., and they do securitizations and some other weird stuff.  I don't know whether the stock is down just because all mortgage REITs are in the doghouse or whether there are some icebergs below the surface.  \nI like them better than normal mREITs because they have less prepayment risk and they're not invested in retail/office/hotel debt (which I wouldn't touch with a 10 foot pole).", "score": 2, "replies": []}]}, {"body": "Hahahaha “even if it only goes up 50%” this is some autistic shit", "score": 3, "replies": []}, {"body": "RIP this guy lol", "score": 2, "replies": []}, {"body": "Thanks for posting this after market has closed holy shit why not post an hour before?! All these dd posts actually decent come out the night before shit gaps up!", "score": 2, "replies": [{"body": "It could also drop further tomorrow. If that happens, would you see it as an even better discounted opportunity, or would you think OP was totally wrong and this is headed down much further?", "score": 2, "replies": [{"body": "[https://imgur.com/gallery/uuRxCKP](https://imgur.com/gallery/uuRxCKP) \nActually no I would say it just tripped bottomed and today would've been a good time to get in on the ride back up (: if it doesn't move tomorrow I'd love to take a position.", "score": 2, "replies": [{"body": "Yeah, I'm new at this. What's a triple bottom and what's its significance?", "score": 2, "replies": [{"body": "It just shows there's a support at a certain level and it's been tested 3 times. Market-wise it shows that sellers won't sell below that level & buyers would love to buy the stock at that level. Very simple but important.", "score": 1, "replies": [{"body": "Huh - kinda like how SPY got tested at $260 three times recently and never made it more than a couple of dollars past before diving today\n\nOk, now I'm interested.", "score": 3, "replies": [{"body": "Now pairing that with moving averages & fib levels will give you a really simple profitable trading plan.\n\nMy strategy I've adopted is in line with [thetradingninja's](https://youtu.be/RW2ezfEsjbY) \n\nCluttered charts but if you learn to understand them, most importantly the moving averages it's very easy to enter and exit trades at good points.\n\nEdit : for example using FIB arcs incorporated time + fib levels, [here's](https://imgur.com/gallery/Zv2E72Q)  the spy chart and you can see how it interacts with each level", "score": 1, "replies": [{"body": "Fuck", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I lost a good bit so far listening to this", "score": 1, "replies": []}, {"body": "I’m still in. I’m going long. I stocked up for the dividends in the future. Set it and let it DRIP", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Good play, thanks 🙂", "score": 1, "replies": []}, {"body": "how much did you lose dude? let us know!", "score": 1, "replies": [{"body": "[deleted]", "score": 4, "replies": []}]}, {"body": "Sold Puts on this DD. Thank you for this horrible advice.", "score": 1, "replies": []}, {"body": "I see calls, i post disapproving comment, I click next post.", "score": -1, "replies": []}]}
