{"title": "Why Market Isn't Crash Crash", "selftext": "Look, I've got a friend. Dude is a financial analyst. Works for a big company run by a turtle without a shell, master of disguise looking ass dude. Got into an argument. This motherfucker thinks this is the optimal time to invest in the economy. This dude is showing off his 10% gains and explaining why he's investing in oil right now. I get into an argument with him about how Hump and Dump Donny has manipulated the markets this past month. He denies it, says all the bullshit you expect to hear, \"unemployment didn't surpass expectations, Trump is just being Trump, and the Market is forward thinking.\"\n\nI just wanted to point out this anecdotal case study, because I think this is how most people think. No one truly believes we are in an economic crisis. No one truly believes the government is manipulating the stock market. No one truly believes we have a problem. Everyone thinks we've already moved past the worst of it. Especially people who write articles that retail investors consume. It's a self-fulfilling prophecy. \n\nFor those of us who analyze financials, leverage, and forecast scenarios... it doesn't matter. Just because you make the smart decision doesn't mean it's the right decision. We like to say we're autists, but if 99 SPEDS out of 100 all believe the market will go up, the market will go up. Just because you're right doesn't mean you'll make tendies. Play the people, not the stock.\n\nSPY 265p 05/15, 270p 6/19\n\nEDIT: Added positions", "id": "g9dp7p", "created_utc": 1588036503.0, "score": 91, "upvote_ratio": 0.92, "num_comments": 73, "comments": [{"body": "Your positions make me think you added your may puts at a lower price then your June puts later at a higher price after being down a ridiculous amount", "score": 71, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "I think he’s saying bet on the general vibe that you think the majority of people are feeling. Don’t bet on logical thinking, such as seeing the world on hold by a virus and the possible effects on every companies earnings. Just because you know everything is pointing to a shitty direction doesn’t mean it really is shitty.", "score": 1, "replies": [{"body": "The problem is his positions then. Why does he have puts given that sentiment? Unless, he is stating that he thinks the big boys will and the like will pull the rug out from under everyones feet causing the chain reaction of a drop when all the paper hands retail investors pull out after them.", "score": 1, "replies": []}]}]}, {"body": "I do believe we have a winner.", "score": 9, "replies": []}]}, {"body": "They will be the paper hands that panic sell and turn a 4% down day into a circuit breaker", "score": 51, "replies": [{"body": "And I say bring it on, can't happen soon enough.", "score": 24, "replies": [{"body": "It’s pretty obvious people are praying for circuit breakers again so they can “buy in low”\n\nWhat happened when we were at the 2200s? Too scared? Lol", "score": 0, "replies": [{"body": "No one here is buying stocks, retard.  Volatility makes us money.", "score": 1, "replies": [{"body": "Y’all don’t make money, you lose betting the same way week after week, and only make half back when it finally moves in the direction you want.\n\nBulls and bears make money, pigs who bet the same way get slaughtered.\n\nI guarantee you retards lost most of the gains you made from the initial drop during this bounce back up lmao\n\nPlus most of y’all too broke and only buy naked options...lmao", "score": 2, "replies": []}]}]}]}, {"body": "This is what I'm expecting as well. That day last week when oil shat it's pants, I thought we would see circuit breaker. I can't help but think, given the narrow range we've been in, that it's going to take just one bad bit of news or earnings or some other catalyst that sees several days of volatile movement. I think everyone can feel the tension that is building up. \n\nOf course, this retarded market could release the tension to the upside as well. I think given the relatively low volumes we've been seeing that are moving this market up, it suggests that there are many people just waiting on the sidelines to see where this market is going who haven't played their hands yet. \n\nI think AAPL is shaky and could be the one to start this next down move. I wouldn't be surprised if we see circuit breaker this week when some realities are delivered and these weak hands decide to get out.", "score": 20, "replies": [{"body": "Unbelievably bad GDP worse than -4% or a huge miss by tech like you said are our only chances I think", "score": 9, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "USO skipped the June future.", "score": 4, "replies": [{"body": "nope, they started selling them off today and have two more days of selling to go", "score": 1, "replies": []}]}]}, {"body": "This would be huge. Market would have limited safe havens. \n\nFor the market to crash you really need QQQ to participate. Airlines and Banks can't do much more of the heavy lifting.", "score": 2, "replies": [{"body": "Yep, my current conservatively small portfolio has been built around this assumption. I'm not prepared to get entirely back in while we're in this state of craziness.   \n\nThe tech sector must also correct as other sectors have for market to truly capitulate and set a new \"priced in\" baseline that the market can rebuild from. Tech has not been immune from direct economic impact of the virus yet the market hasn't reflected this.  \n\nWe'll remain in a volatile state where shit could collapse at any time if tech doesn't correct like the others. Right now, my feeling is it's all complacency, false hope and heavy manipulation. Not a great foundation for a successful recovery or rally.", "score": 3, "replies": []}]}]}]}]}, {"body": "The Feds job is to instill confidence in the economy. They’ve succeeded. At one point they even released a video not to do a bank run. They know shits bad but they don’t want the public idiot to know", "score": 20, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "You are 100% correct. Replace that with this fairy dust stock market. Energy price and consumption is the unadulterated proxy for the economy.", "score": 10, "replies": []}]}]}, {"body": "Dead. Fucking. On. Every time I finish thinking about whether a position is good, the first thing I think is \"how do the bumbling masses fuck me on this.\"\n\nI do calls more than puts now because the zombie hoard of robinhood boomers is always bullish.", "score": 24, "replies": [{"body": "Every investor is inherently bullish otherwise they would not be in the stock market. Some of the biggest bear plays are actually done by the bulls who just see the imbalance and capitalize", "score": 3, "replies": []}]}, {"body": "I talked to a colleague today who said the economy is back on track, especially the stock market.  He became overtly aggressive when I suggested otherwise.\n\nThe best I can do to explain this to myself is that people think all of the market's/economy's problems were caused by the coronavirus and lockdown, and that both are now going away, so everything is going back to normal.\n\nIt's like the market gets shot in the dick, and now it's DTF because you remove the bullet.", "score": 19, "replies": [{"body": "Aptly put.  I'm half convinced social distancing is making everyone a little loopy.  The first wave isn't even over yet and people are already cheering the end.  I really hate to think where people's heads will be if/when the second wave hits, even more a third.", "score": 12, "replies": [{"body": "I'm thinking also that the social distancing means the white collar work-at-home crowd has extra money they'd normally spend at bars, restaurants and malls, plus their stimulus checks, and they literally can't come up with anything to spend it on besides stocks.", "score": 13, "replies": [{"body": "I dont think the average white collar worker even knows how to start up a trading account let alone make trades. They will find ways to spent it elsewhere.", "score": 2, "replies": []}, {"body": "Yup, someone posted recently how literally hundreds of thousands of people are dumping money into stock on Robinhood alone:\n\nhttps://robintrack.net/symbol/F\n\nWhich means, over all brokerages, there's probably at least a million new people entering the market.  Along with the tons of people throwing money in who already had positions.\n\nThese are retards FOMOing the bottom, people who watched The Big Short and since they're *definitely* smarter than average, they can beat the system in the same way.", "score": 1, "replies": []}]}]}]}, {"body": "mmmmm tuuuurtle", "score": 8, "replies": [{"body": "Mmmmm monkey", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 24, "replies": [{"body": "finally someone mentions this. so should we be asking when will bond yields go back up and when will people start putting their money into real estate? sort of unknown answers", "score": 8, "replies": []}, {"body": "the money should go pay off some of that debt instead of creating more and we can stop buying shit we don’t need with cc and HELOC and layaway.\n\njust kidding, debt fueled spending is good!  just not sure why the world continues to tolerate making shit for our big box stores though\n\nIWM 5/1 $127p", "score": 2, "replies": []}, {"body": "This.", "score": 1, "replies": []}, {"body": "Except a mad influx would see high volume. Not the shit we have had.", "score": 1, "replies": [{"body": "Yep low volume should have everyone treading carefully.", "score": 1, "replies": []}]}]}, {"body": "Hahaha, SPEDS!  I haven't heard that term in years.", "score": 6, "replies": []}, {"body": "What’s an anal-lyst?", "score": 4, "replies": [{"body": "It's half of an analrapist", "score": 1, "replies": []}]}, {"body": "I pushed out my spy puts to late July and bought closer dated TSLA calls. Might as well play both sides.", "score": 3, "replies": []}, {"body": "Here you are losing all your money on WSB arguing the other people are the ones who are wrong...", "score": 6, "replies": []}, {"body": "Fucking right. It's inversely backwards.", "score": 2, "replies": []}, {"body": "The longer this goes on the more likely it's going to be a rapid floor cratering shitshow", "score": 3, "replies": [{"body": "Kicking the can down the road is what we do best. But I don’t have a better idea.", "score": 1, "replies": []}]}, {"body": "Well, I am on the side thinking there will not be any further crashes. For stocks, I am already invested for the long-term. For options, I play it day by day.\n\nOverall, I think the market is going up. I think this virus is a temporary problem. I think its effects on the economy is temporary, even if it is bad in the short term.\n\nIf I am wrong and it goes down further, I would still want to be in the market now than trying to time it correctly. Why?\n\n- If I am right that we are past the worst of it, then I am already in the market. If I was out of the market, I would have missed the recovery and it would be even more expensive to get back in.\n\n- If I am wrong and it goes down 50% from high, then I already collected one or two quarters of dividends that would be compounded over time. This would soften the blow long-term.", "score": 5, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "If it goes down over 50%, I would be buying even more. Wouldn't you be?", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "If it goes down more, I don't know how long it will take. But I am already in the market. However long it takes, I'd rather be in now, collecting the dividends that compound over time, than trying to guess how long it will take. Those that are not in the market right now and betting against it are the ones assuming it will go down some more and guessing how long it will take. What if it doesn't go their way? If it doesn't go my way, at least the dividends compounded over time soften the losses.", "score": 6, "replies": [{"body": "Sitting on the sidelines watching the market go up is substantially less painful than the feeling of watching your portfolio going tits up. \n\nSaid differently, being in cash while the market plummets is a very fun place to be. Want to know how to get quarterly dividends the size of your cost basis? You buy large blue chips during a market crash. Look at what the banking sector was trading for in 2009, you'll shit a brick. You talk of longevity, the real setup is having cash and buying during dips. Holding for higher highs is fine, but that's not how you  accumulate real wealth.", "score": 2, "replies": [{"body": "Of course it would be nice if you timed it right and went out on cash or had puts during a market crash. But in a time like right now, where nobody knows if this is the recovery or if it will go down more, I personally would rather be invested in dividend paying stocks than out.\n\nAlso, I've been selling puts to collect premium and \"buy stocks\" if I got assigned them. I also sold calls to collect premium for stocks I didn't care holding. In other words, the wheel strategy. I plan on doing this until the market figures out where it wants to go.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 0, "replies": [{"body": "401K is in S&P 500. I don't think all of the dividends will get canceled. Other investments are in Microsoft. I think Microsoft benefited more from this situation than being hurt from it, but we'll find out for sure when their earnings comes out this week. I don't think they will be canceling their dividends.", "score": 2, "replies": []}]}]}, {"body": "there’s PORKflation", "score": 2, "replies": []}]}]}]}, {"body": "I was confused there a minute, thought I was on /r/investing. DCAing into a 100% US stock portfolio?  Not judging if so, there are different ways to gamble.", "score": 2, "replies": [{"body": "Sex in the missionary position, after marriage", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "I don't think the problem will end soon. But I do think it is a temporary problem and will end within two years. I do think organizations are already adapting to the situation and those that don't will fail.\n\nI think where there is failure, somebody else will benefit from it. Mortgage doesn't get paid and house gets foreclosed, some real estate investor will see it as an opportunity. A local restaurant closes, another business will take its place. Airlines and travel is down, video conferencing software is up. And so on. I don't see the economy collapsing. I see it getting shifted where some businesses benefit while others hurt, but I don't see a full failure to the point of a depression.", "score": 4, "replies": [{"body": "> I do think organizations are already adapting to the situation and those that don't will fail.\n\nHave if jobs are small business and those mom and pop shops are royally fucked.", "score": 1, "replies": []}, {"body": "What if the second wave hits much worse than the first wave? It would definitely affect the major players in the market. The travel industry decline will have adverse affects on each country. As you speak about economy which tends to shift to other places like video conference, and real estate those doesn't account majority of the market. People might be conscious about the cheapest possible options when it's about real estate.", "score": 0, "replies": []}]}]}]}, {"body": "Market isn’t crash crash because there’s no reason for it to crash. Get with the program. I don’t understand why there are still so many people here that think market should crash...", "score": 2, "replies": [{"body": "The market and the economy are linked, albeit forward thinking. The economy is shitting a brick fight now. Most bears think the recovery happens slowly. \n\nExample: every is ignoring unemployment right now. What happens if half (8% currently) the lost jobs don't return by July? I still see this as a probability.", "score": 2, "replies": [{"body": "Unemployment doesn’t matter. The last time we were at 8% unemployment the market’s been trending higher for a couple of years. We blew past the ‘08 highs when unemployment was ard 8%. The only thing that matters is that the Fed has signaled that QE is unlimited. Why there are still bears that think anything else matters is mind boggling. You guys are just prepared to keep claiming to be “right” until you’re broke from betting against this.", "score": 3, "replies": []}]}]}, {"body": "People can live in la la land for a long time until reality hits them in the face and makes it impossible to ignore.", "score": 1, "replies": []}, {"body": "inverse wallstreetbets", "score": 1, "replies": []}, {"body": "The market is a popularity contest in the short term but generally follows fundamentals in the long term. The hard part is timing.", "score": 1, "replies": []}, {"body": "This market will not go back down. You are making a bet against Trump during an election year(he will need a strong economy if he wants to win again and he is very well aware of this) and you’re making a bet against the fed. Don’t fuck with Trump and don’t fuck with the fed. \n\nI work in the oil industry. Tomorrow is my last day in west Texas and I will be furloughed for 90 days. My company has already laid off 50% of our workforce and are only doing furloughs from here on out so that they can call employees back when the work picks back up (90 days or less) They are expecting July to be the worst month and $50/bbl oil by eoy. Now, if Saudi and Russia back out of their deal or if the virus comes back with a vengeance this fall, then the oil market is fucked. But as of right now the oil market will struggle for a few months and rebound in the second half of the year. Also, don’t be surprised if Trump slaps tariffs on oil soon. Wouldn’t surprise me at all.", "score": -2, "replies": [{"body": "Trump can't influence consumer spending which is what this market needs to validate for a new high or new lows.\n\nWait until half the jobs don't come back and Trump bucks run out. Let's see how well the market does on 2Q earnings trying to validate Disney at 80x PE", "score": 4, "replies": [{"body": ">Trump can't influence consumer spending \n\nWanna fucking bet? They've been doing it. PPP 1 and now 2, unlimited unemployment checks, stimulus round 1 with the Dems trying for round 2  (2000 a person a month?)  \n\nThey have and will continue to. Banks are going to get whatever they need for assurances to loan out to small businesses that didn't make it to get them back and running after all this.  \n\nNot saying we're not going recession,  just saying we're not doing 08 again. The whole world learned from that shit and most countries decided fuck it we'll just keep printing.  Can't fuck up your own currency to bad if everyone else is doing the same shit.", "score": 2, "replies": []}, {"body": "Priced in. You don’t think these billionaires and hedge fund managers can look 3-4 months ahead? I think very few people on the planet can really grasp the power of the United States Federal Reserve. They’ll keep the market propped up and it won’t even be hard for them. Meanwhile, we’ll all be bitching about inflation and who knows what else.", "score": 1, "replies": []}]}, {"body": "If you think trump is gonna put tariffs on oil you’re smoking crack. That will just cause huge dumps in oil prices to unbelievable lows from Saudis and Russians", "score": 1, "replies": [{"body": "We’ll know for sure in just a few weeks.", "score": 0, "replies": []}, {"body": "Tariffs on oil wouldn't change anything usa barely imports. So he probably will do it because it dog whistles for xenophobes while achieving nothing. Like the green card thing.", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "People on wallstreetbets are the only people that think the oil market is fucked. Everyone in the industry is fully aware that this is all temporary and we will be stable by eoy. My company already has contracts written for August and September. Also, temporary 30 day suspensions that will pick back up soon. No doubt some companies won’t survive this, but plenty of others will. As for oil storages being 100% full?? We’ll see. Good luck with your trading 👍 Buy OKE", "score": 1, "replies": [{"body": "No, they’re just acting like it’s all temporary because it’s their only option. If it’s not, they’re bankrupt and the company is finished. If it is, they’ve positioned themselves well to take advantage of the recovery. Betting it all on a quick recovery is obviously the best play, but that doesn’t mean they even see it as a likely outcome.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Buying shares only. My watchlist is OKE LBRT VLO PBA MRO and ENB. Will likely take positions in all of them.", "score": 3, "replies": []}]}]}]}]}, {"body": "The market can stay irrational longer than you can stay solvent.", "score": -1, "replies": []}]}
{"title": "PFE about to pump", "selftext": "[deleted]", "id": "g9rfr5", "created_utc": 1588094684.0, "score": 74, "upvote_ratio": 0.92, "num_comments": 96, "comments": [{"body": "In. Wait for Trump pump press conference.", "score": 60, "replies": [{"body": "1 option was already up 2500%\n\nI am inversing you guys. $35P 5/8", "score": 14, "replies": [{"body": "why? there is no reason it should fall", "score": 8, "replies": [{"body": "Been above 20-day SMA for a full month now. It’s a crash waiting to happen.", "score": 2, "replies": [{"body": "the market is a crash waiting to happen and yet here we are", "score": 10, "replies": [{"body": "Two wrongs don’t make a right", "score": 2, "replies": []}]}, {"body": "TA is the GAY", "score": 7, "replies": []}]}]}, {"body": "Remind me! 10 days", "score": 1, "replies": [{"body": "**ThatGuyKegan**, reminder arriving in **10 days** on [**2020-05-08 18:44:22Z**](https://www.reminddit.com/time?dt=2020-05-08 18:44:22Z&reminder_id=35be2af3ef1843c38240966b8be8949c&subreddit=wallstreetbets). Next time, remember to use my default callsign **kminder**.\n\n> [**r/wallstreetbets: Pfe_about_to_pump**](/r/wallstreetbets/comments/g9rfr5/pfe_about_to_pump/fovdfii/?context=3)\n\n> kminder 10 days\n\n[**3 OTHERS CLICKED THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202020-05-08T18%3A44%3A22%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fwallstreetbets%2Fcomments%2Fg9rfr5%2Fpfe_about_to_pump%2Ffovdfii%2F) to also be reminded. Thread has 4 reminders.\n\n^(OP can )[^(**Delete Comment**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20Comment&message=deleteReminderComment%21%2035be2af3ef1843c38240966b8be8949c) ^(·) [^(**Delete Reminder**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20%28and%20comment%20if%20exists%29&message=deleteReminder%21%2035be2af3ef1843c38240966b8be8949c) ^(·) [^(Get Details)](https://reminddit.com/reminders/id/35be2af3ef1843c38240966b8be8949c) ^(·) [^(Update Time)](https://reddit.com/message/compose/?to=remindditbot&subject=Update%20Reminder%20Time&message=updateReminderTime%21%2035be2af3ef1843c38240966b8be8949c%0A10%20days%0A%0A%2AReplace%20reminder%20time%20above%20with%20new%20time%20or%20time%20from%20created%20date%2A) ^(·) [^(Update Message)](https://reddit.com/message/compose/?to=remindditbot&subject=Update%20Reminder%20Message&message=updateReminderMessage%21%2035be2af3ef1843c38240966b8be8949c%20%0Akminder%2010%20days%0A%0A%2AMessage%20is%20on%20second%20line.%20Message%20should%20be%20one%20line%2A) ^(·) [^(**Add Timezone**)](https://www.reminddit.com/user/setTimezone?source=reddit&username=ThatGuyKegan) ^(·) [^(**Add Email**)](https://reddit.com/message/compose/?to=remindditbot&subject=Add%20Email&message=addEmail%21%2035be2af3ef1843c38240966b8be8949c%20%0Areplaceme%40example.com%0A%0A%2AEnter%20email%20on%20second%20line%2A)\n\n**Protip!** We have a community at r/reminddit!\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Questions](https://reddit.com/message/compose/?to=remindditbot&subject=Feedback%21%20Reminder%20from%20ThatGuyKegan)", "score": 1, "replies": []}, {"body": "Boom boom u/ThatGuyKegan cc u/Logical_Username! ⏰ Here's your reminder from **10 days ago** on [**2020-04-28 18:44:22Z**](https://www.reminddit.com/time?dt=2020-04-28 18:44:22Z&reminder_id=35be2af3ef1843c38240966b8be8949c&subreddit=wallstreetbets). Thread has 4 reminders.. Next time, remember to use my default callsign **kminder**.\n\n> [**r/wallstreetbets: Pfe_about_to_pump**](/r/wallstreetbets/comments/g9rfr5/pfe_about_to_pump/fovdfii/?context=3)\n\n> kminder 10 days\n\n\nIf you have thoughts to improve experience, [*let us know*](https://reddit.com/message/compose/?to=remindditbot&subject=FeedbackAfterNotify%21%20Reminddit%20Reminder%20%2335be2af3ef1843c38240966b8be8949c).\n\n\n\n^(OP can )[^(**Delete comment, Repeat reminder, and more options here**)](https://www.reminddit.com/time?dt=2020-05-08 18:44:22Z&reminder_id=35be2af3ef1843c38240966b8be8949c&subreddit=wallstreetbets)\n\n**Protip!** We have a community at r/reminddit!\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Questions](https://reddit.com/message/compose/?to=remindditbot&subject=Feedback%21%20Reminder%20from%20ThatGuyKegan)", "score": 1, "replies": []}]}, {"body": "You finally learned the secret", "score": 0, "replies": []}, {"body": "Definitely the move.\n\n\nhttps://www.tradingview.com/x/1hZWEOzP/", "score": 0, "replies": []}, {"body": "smart man", "score": 0, "replies": []}]}, {"body": "Positions?", "score": 7, "replies": [{"body": "5/8 $40c\n5/15 $42c\n5/29 $44c", "score": 8, "replies": [{"body": "5/8 40$c / 9/18 38.5$c", "score": 5, "replies": []}]}, {"body": "5/1 $40C\n5/8 $41C", "score": 6, "replies": []}]}, {"body": "When is the press conference?", "score": 5, "replies": []}, {"body": "5/15 40.5c here!!!!", "score": 4, "replies": []}, {"body": "you think he is going to mention this?", "score": 2, "replies": [{"body": "I’m hoping* he will and think it is highly likely he will. He would be a fool not to.\n\n\nhttps://www.foxbusiness.com/lifestyle/trump-touts-promising-pfizer-coronavirus-treatment-under-development\n\nHe’s mentioned them before.", "score": 5, "replies": []}]}]}, {"body": "Wow Bigly Huge The Best ........ Thanks for the info", "score": 20, "replies": [{"body": "Tremendous", "score": 8, "replies": []}]}, {"body": "hmmmm this is not going well", "score": 15, "replies": [{"body": "😂😂", "score": 6, "replies": []}]}, {"body": "Can I get a link to emergency vaccine info?", "score": 9, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Thanks. Pfizer is a great company and their leaps are currently Hella cheap. Might have to grab some.", "score": 5, "replies": []}, {"body": "Last post I saw about this used a link from [sciencebusiness.net](https://sciencebusiness.net), this is far more credible. This guy fucks.", "score": 4, "replies": []}]}]}, {"body": "Just hopped in on many $42c 5/1", "score": 8, "replies": [{"body": "$42c 5/8 are only .9c rn, I picked up 10 🤷🏻‍♂️", "score": 6, "replies": []}, {"body": "Let's get it", "score": 3, "replies": []}]}, {"body": "https://www.eventbrite.com/e/stat-digital-event-series-combating-covid-19-registration-100940973168\n\nPFE CSO also speaking during this event tomorrow at 1:00PM EST.", "score": 8, "replies": []}, {"body": "I believe the same but everyone reacted negatively to the earnings report released this morning. I jumped in while it was in free fall and picked up 10 5/1 $40C and 10 5/8 $41C for $100 total premium. Let’s 🚀", "score": 11, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Yeah I made decently on earnings before the drop. I'll buy in on this news again, though fuck it.", "score": 5, "replies": []}]}, {"body": "Fingers crossed, either way. Hopefully I don't lose the profits I got off em this morning by rebuying in 😅", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Hahahaha fair enough! I'll lean on that in case this implodes ;D", "score": 2, "replies": []}]}]}, {"body": "Well, tried selling at a profit this morning, but the app froze and won't let me execute any sales, won't let me cancel orders. This is neat.", "score": 1, "replies": []}]}, {"body": "Picked up 5/15 40c", "score": 5, "replies": []}, {"body": "On April 9, Pfizer handed BioNTech an upfront payment of $185 million and promised it up to $563 million in potential milestone payments. If the BNT162 program produces a successful vaccine, the partners will split the costs of development and commercialization. If the vaccine never reaches commercialization, though, Pfizer will pay for 100% of the development costs.", "score": 6, "replies": []}, {"body": "Pfe should honestly be $45 within next week", "score": 6, "replies": [{"body": "What make you think that besides being a retard", "score": 3, "replies": []}]}, {"body": "Come on Donny pump!!!!", "score": 6, "replies": []}, {"body": "Don’t forget about the unusual call options that were placed yesterday over PFE.", "score": 5, "replies": []}, {"body": "Let's roll, just bought in.\n\nMay.15 $39 @ $0.52 each\n\nMay.1  $40  @ $0.10", "score": 6, "replies": [{"body": "Money me? Money now, me need lot money now.", "score": 6, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "make gains, sell", "score": 2, "replies": [{"body": "That's so crazy, it might just work.", "score": 2, "replies": []}]}]}]}]}, {"body": "6/19 41c put it on the board", "score": 3, "replies": [{"body": "Been holding 6/19 40c for a few days now and been up even with the drop today. Will ride this out for a bit.", "score": 1, "replies": []}]}, {"body": "5/8 40 let’s rock n roll", "score": 4, "replies": []}, {"body": "I’ve been up 120% on 5/1 $39 calls I got earlier today", "score": 5, "replies": []}, {"body": "Think it's worth holding onto my 40C 5/1?", "score": 5, "replies": [{"body": "We got this, I'm w/ u until 5/1!", "score": 2, "replies": []}]}, {"body": "Can't wait to inevitably lose money on this", "score": 4, "replies": []}, {"body": "I need it like NOW", "score": 3, "replies": []}, {"body": "I believe it. Because I just sold my call contracts to close.", "score": 3, "replies": []}, {"body": "Holy fuck it’s a Christmas miracle, option DD before closing", "score": 3, "replies": []}, {"body": "Fuck your advice", "score": 3, "replies": []}, {"body": "Why not BNTX, they are working with Pfizer for this", "score": 2, "replies": []}, {"body": "/u/Osmosis_Bones13", "score": 2, "replies": [{"body": "With the amount of shares that are in the market, might rise to 40 a share. We shall see!", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Fixes the economy 100000%", "score": 7, "replies": []}, {"body": "Cures autism.", "score": 2, "replies": []}]}, {"body": "ROEs looks good  [https://www.macrotrends.net/stocks/charts/PFE/pfizer/roe](https://www.macrotrends.net/stocks/charts/PFE/pfizer/roe)", "score": 2, "replies": []}, {"body": "In 5/8 $40c", "score": 2, "replies": []}, {"body": "This bitch better be my NASA", "score": 2, "replies": []}, {"body": "GG PFE tanked. Rip everyones calls", "score": 2, "replies": [{"body": "Woohoooo Down 50%! when will I learn to inverse anything I see on WSB", "score": 3, "replies": []}]}, {"body": "If this news is really significant why didn't the algos pump it?", "score": 3, "replies": []}, {"body": "Made 350% off them from earnings right before the proce crashed anyway.\n\nI'll grab a few more for the news of vaccine for shits and gigs.", "score": 2, "replies": [{"body": "Stock opened up less than 2% and immediately dropped. How could you have possibly made 350%?", "score": -2, "replies": [{"body": "iv crush after earnings.  happens to a lot of stock prices after earnings", "score": 2, "replies": [{"body": "I bought MSFT $190C 6/5 yesterday morning and it’s lost 50% in value with only a 2.5% drop in stock price. I thought IV was supposed to increase on the way up to earnings. I’m surprised, unpleasantly", "score": 0, "replies": []}]}, {"body": "Because I bought days ago low and sold immediately at open, high, before they dropped?\n\nThat's... How profit works?", "score": 0, "replies": []}]}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "got in some 5/8 call positions at a 50% discount from yesterday's closings yet still down right now.", "score": 1, "replies": [{"body": "Same. Mine were 5/1. Waiting for CFO presentation/speech today at 1 EST. Just a tiny bump would be great.", "score": 1, "replies": [{"body": "Danks for the slither of hope fellow 5/1", "score": 1, "replies": [{"body": "Picked up 11 39C for 0.10.", "score": 1, "replies": []}]}]}]}, {"body": "Well this was shitty.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I already won with Pfizer once, so I straddled a bit just in case, for this one. Saved me lol. \n\nWe'll see where this goes, though.", "score": 1, "replies": []}]}, {"body": "Bought my first option ever because of this post! 5/8 $40c. Thanks guys! mentally prepared to lose bigly with you retards", "score": 0, "replies": []}, {"body": "every company COULD have a vaccine for emergency use if testing result is good. Why do you think PFE is dumping.", "score": 0, "replies": [{"body": "That's weird... maybe there were already rumors going around that they had something and the market's disappointed that it's not a more solid announcement?", "score": 2, "replies": []}]}, {"body": "Thought this news is about a week old", "score": -1, "replies": [{"body": "If by a week you mean about 40 minutes then you’re absolutely right.", "score": 13, "replies": [{"body": "Check google, other sources released this testing in Germany a week ago, only new news is that they will expand testing in US", "score": 1, "replies": [{"body": "Post the link. Please make sure it includes “emergency vaccine by fall.” Thanks.", "score": 7, "replies": [{"body": "You’re right.", "score": 6, "replies": []}]}]}]}]}, {"body": "Whether it justifies buying into it after it’s terrible earnings I don’t know", "score": -3, "replies": [{"body": "They beat earnings", "score": 4, "replies": [{"body": "Revenues", "score": 2, "replies": [{"body": "Fair", "score": 2, "replies": []}]}]}, {"body": "90% of option traders are wrong. Time to go contrarian on this post.", "score": 1, "replies": [{"body": "Where this stat from?", "score": 1, "replies": []}]}]}]}
