{"title": "AAPL suspends 2020 iPhone model production", "selftext": "[Link](https://www.investing.com/news/technology-news/apple-to-delay-mass-production-of-2020-flagship-iphones--wsj-2151846)\n\nApple suspends mass production of their 2020 new model iPhone, Stock up 2.3%", "id": "g8z9du", "created_utc": 1587988228.0, "score": 96, "upvote_ratio": 0.92, "num_comments": 79, "comments": [{"body": "5g won’t be ready so why rush a 5g phone. 5g has taken a massive delay in rollout.", "score": 72, "replies": [{"body": "[deleted]", "score": 33, "replies": [{"body": "Yeah that's crazy, but I would like to see more independent studies on the effects of 5g radiation", "score": -25, "replies": [{"body": "Wow I actually found one of these idiots in the wild. Can i ask, how did you make it this far in life? Do you have to wear a helmet when you leave the house?", "score": -5, "replies": [{"body": "What exactly is wrong with what he said? There have been few scientific studies around 5G health effects in big part because those take time to confidently test, and we’re about to put it literally everywhere.\n\nYou’re attacking someone for simply wanting more independent studies that would make us more confident that there’s no problems. Why are you *against* that idea?", "score": 17, "replies": [{"body": "All that news you're hearing on the possible effects from 5g stem from one study that made bogus claims and is now being heavily exaggerated. Maybe do some actual research before defending misinformation.", "score": 1, "replies": [{"body": "No, answer the question. Why are you attacking them for wanting more studies on the effects of 5G? \n\nThey did not claim to believe in those bogus claims, and neither did I - you’re extrapolating that idea so you have a strawman to burn.", "score": 2, "replies": [{"body": "There have been countless studies done on the effects of electromagnetic fields on humans. None of them have come back with strong evidence that they produce negative effects. 5G is the latest fad for stupid people to get riled up on something they don't understand. You're upset because you don't understand? Stop complaining and go educate yourself about it.", "score": -2, "replies": [{"body": "This post is comical tbh. You realize electromagnetic fields include X rays and gamma rays right? So everything you’ve said is completely wrong. There is plenty of evidence proving EandM can be dangerous. Don’t act educated online if you don’t want to get called out. There’s also no long term epidemiological studies on 5G yet so blindly believing the limited data available is a really stupid thing to do.\n\nObviously the carriers rolling out 5G will take the first study that supports that it’s safe and call it “proof.” That’s how cigarette companies did it, how the asbestos/ lead sellers did it, and how phone companies are currently doing it. \n\nDoes 5G actually cause cancer? No one knows yet as there is insufficient data covering acceptable lengths of time.  Anyone telling you “it’s completely safe” is lying. Likewise so is anyone saying it’s dangerous.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I think that’s a tad bit over dramatic. Yes there are for sure the crazy lunatics who will never be happy (I met a landlord once who wouldn’t let you have wifi and would show up once a month with this device that measured radio frequency to make sure the house wasn’t getting “toxic” lol).\n\nThe main issue though is people hear 5G and assume it’s 5GHz which isn’t true. These devices start at 5 and will go up to 300+ GHz which is orders of magnitude greater than anything we have reliable  studies on. \n\nCalling it safe because 4G is safe if like saying it’s safe to drink bleach because it’s safe to drink pool water. You’re extrapolating rather than relying on evidence. \n\nThese are going to be devices millions of people have in their pockets 8 hours a day, 7 days a week. It’s technology that’s been around for quite a while now so give me a couple independent studies showing the 5 year or 10 year effects (if any) on men and women’s genital cancer risks, brain cancer risks and if it affects pregnancy or infertility. The other big one is what’s the effect on wildlife. Does having so many of these towers impact animals that can hear higher frequencies? \n\nIt shouldn’t be much to ask these billion dollar companies for due diligence", "score": 2, "replies": []}]}, {"body": "This is wrong in so many ways. I almost feel sorry for you if you believe what you just wrote.", "score": 0, "replies": []}]}, {"body": "Right, so just to be clear, your defense is effectively “There are other studies on lower-frequency EMF that have so far not found a correlation. Thus, we do not need new studies as the frequency climbs, and I am free to insult anyone who dares think we should be 100% sure before rolling something out in every city across the globe”.\n\nIs there a frequency where you think we *should* conduct further studies, or are you cool with trusting old data for anything lower than UV levels, since we confidently know that is a harmful level?", "score": -6, "replies": [{"body": "Not sure what you googled since this is clearly copy pasted but if youre gonna be an idiot, could you go bother someone else?\n\nk thanks", "score": 4, "replies": [{"body": "Copy pasted? For someone who talks a big game, you don’t even know basic electronics terms, and yet you think you know enough to insult somebody else?\n\nFucking lol mate. At least know *something* about the subject next time.\n\nEdit: lmao, the downvote/upvote spread on this chain of comments is as wild as the actual stock market", "score": 3, "replies": [{"body": "k thanks", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The  US National Library of Medicine\nNational Institutes of Health released [this review](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6765906/) which has [these sources](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6765906/bin/ijerph-16-03406-s001.pdf). I'll admit I did not review these resources but, judging by their sources and titles, they do appear to have more than 1 actual study on technology incorporated in 5G networks.", "score": 0, "replies": [{"body": "I'll take a look, thanks for pointing it out", "score": 2, "replies": []}]}]}]}, {"body": "Learn to read. Asking for studies for long term effects does not equal ‚spreads corona virus‘.", "score": 0, "replies": []}]}, {"body": "If only to make it clear to idiots that it does nothing. But probably (read: definitely) a waste of scientific resources", "score": -1, "replies": []}]}]}, {"body": "Most investors have no idea what 5G is or how useless it is in smartphones - the real benefits are in industry and the internet of things. \n\nIt definitely won’t bring a resurgence in smartphone sales.", "score": 12, "replies": [{"body": "While it's true that 5G won't benefit smartphones that much, it's still something that is very marketable and therefore will increase sales.\n\nJust like even though 4K for TVs doesn't really provide much benefit for most TV viewers and there are other technologies that offer more benefit, \"4K TV\" is still a very marketable term to the uninformed masses just like \"5G iPhone\" will be.", "score": 12, "replies": [{"body": "I doubt it, 5G smartphones are already performing poorly:\nhttps://www.rli.uk.com/galaxy-s20-sales-prove-underwhelming-amid-the-global-pandemic/\n\nI know few people that complain about the speed of 4G on their phones, it’s poor coverage in general and indoors that’s the problem.", "score": 4, "replies": [{"body": "Isn't it also true that some '5G' phones didn't even come with a 5G radio? I believe I heard they were being sold in areas that don't even have 5G service yet. [JerryRigEverything](https://www.youtube.com/watch?v=k-OZVWcyN5w) on youtube did a teardown and couldn't find the 5G antenna's I believe.", "score": 2, "replies": []}, {"body": "5G cannot penetrate walls very well, let alone concrete or multi-level buildings, and it has a drastically shorter range than 4G, so coverage issues are probably always going to exist. Like someone else said, functionally it’s not all that useful for mobile phones. \n\nFactories, warehouses, etc. that can put a bunch of transmitters all over the place will love it, as IoT also demands a much higher bandwidth to send the amount of data they want to collect from every robot or sensor.", "score": 2, "replies": [{"body": "Why can’t factories just use WiFi?", "score": 2, "replies": [{"body": "It’s good for lower scale, but noise is a huge factor alongside bandwidth. If somebody says witi can solidly go 300ft, some C-level is going to demand they only buy enough equipment for that range, not understanding that they’re in a very electrical/not fully shielded environment and the effective range may only be 100ft (likely inaccurate numbers, but the concept stands) requiring more equipment. **5G is easily going to face this problem as well. Had some bad info bouncing around my head**\n\nBandwidth is going to be big as robotics and IoT grow. You ever tried to run three Skype calls on the same wifi? Multiply that by 100, easily. Over the next decade, a lot of equipment is going to move to AI - inspection equipment, assembly, even material movement. All of that has to either talk to each other’s processors, or to a central processor directing all of the movement. Wifi *works*, but the equipment is getting smarter, and being smarter in part relies on more information and faster responses.", "score": 1, "replies": [{"body": "Electrical / shielded environments are going to be tougher for 5G than WiFi. \n\nWiFi has been used in large conference halls where everyone is connecting, and some are doing video. In the early days, they couldn’t cope, but nowadays with a competent setup, it holds up pretty well.", "score": 2, "replies": [{"body": "Just re-looked into it, 5G can actually go much further than I remembered. Max distance is about a mile in good conditions - that far outclasses wifi. \n\nYou make a good point about interference as well. The way I was thinking, it’d be easier to avoid noise if you had transmitters every 20 some feet, but that’s unlikely. Dunno where I was pulling that from", "score": 1, "replies": []}, {"body": "especially with 6G wifi around the corner", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "5g in phones opens a massive market for computer vision but I agree robotics and automation ie industrial demand will be the main early driver.", "score": 5, "replies": []}]}, {"body": "So what are the best 5g stocks?", "score": 4, "replies": [{"body": "In Europe, probably Ericsson from Sweden. Then there's Nokia as well. Lots of talks about Nokia being spooned by a hostile takeover!", "score": 2, "replies": []}, {"body": "Verizon + Apple for me. Verizon will benefit from 5G, as will Apple", "score": 2, "replies": []}, {"body": "$XLNX", "score": 1, "replies": []}, {"body": "INPHI", "score": 1, "replies": []}, {"body": "AMT or CCI. They are the ones that actually own and operate cell towers.", "score": 1, "replies": []}, {"body": "It’s all priced in. But your best bet would be an etf", "score": -24, "replies": [{"body": "A technology that is going to be used likely over a decade is priced in, sure bud...", "score": 10, "replies": [{"body": "Has anyone considered the massive cost to install 5g infrastructure and the competition to do so? Yes they have. People have been discussing 5g rollout for several years now, hard to say there is anything new in this", "score": 1, "replies": []}, {"body": "The slow roll out of 5g is definitely priced in, bud. Considering the companies competing in the space your better off buying into an etf than trying to pick a specific player.", "score": -7, "replies": []}, {"body": "4g has been used over a decade and how did that affect any particular company?\n\nEdit: why are you booing me? I’m right.", "score": -7, "replies": [{"body": "Netflix couldn't even exist without 4g.", "score": 9, "replies": [{"body": "Lmao +75% of netflix happens on TV’s.\nThat doesn’t even take into account laptops or tablets.", "score": -5, "replies": []}]}, {"body": "Are you joking, amazon, google, oracle, apple, at&t, akami, cloudflare, Samsung and countless other companies relied on 4g inferastructure for years, you are so wrong its actually laughable and you actually think you are right. Do you actually believe 4g didnt affect the businesses involved in wireless communication, like I really have a hard time believing anyone is this dumb.", "score": 2, "replies": [{"body": "Lmao yeah, i'm sure Apple rallied because 4G.\n\nI suppose it has nothing to do with the fact that they sell millions of thousand dollars phones each year.\n\nAT&T is practically the same price level it was 10 years ago.\nNone of the companies u listed above were remotely influenced by 4G.\n\nGoogle runs on ads, Amazon runs on webservices and ecommerce, Apple sells hardware, AT&T sells 4G services and ironically is the worst performing out of all of them, akami and cloudflare don't even know. \n\nSamsung is conglomorate, they sell more non-4G devices than they sell 4G devices so that's just the dumbest example ever.", "score": -2, "replies": [{"body": "First off learn to read, I said relied not rallied. Secondly just wow you are just really dull", "score": 3, "replies": [{"body": "Relied even makes it worse.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Only in america, because of nationalist and racism.\n\n5g implementation is doing well in asia, particularly china and South korea", "score": -12, "replies": [{"body": "This sounds like gibberish to be related to an iPhone delay.", "score": 6, "replies": []}]}]}, {"body": "Stock going back down again.", "score": 14, "replies": [{"body": "I’m okay with this. Gives me a buy in on a company that I have every confidence in succeeding.", "score": 4, "replies": [{"body": "Is there really a point or difference long rub in a dollar or two difference", "score": 2, "replies": [{"body": "Well. I’m on the poorer side, so in the immediate yes.", "score": 11, "replies": []}, {"body": "not really in a long term but it makes me feel better about myself and that's priceless", "score": 8, "replies": []}]}]}]}, {"body": "So aapl 300c?", "score": 5, "replies": []}, {"body": "The SE is going to crush everyone and keep AAPL strong, just my opinion", "score": 5, "replies": []}, {"body": "Next year iPhone sales gonna be insane think of the pent up demand.", "score": 9, "replies": [{"body": "I'm going to buy 6 iPhones. One for each of my pockets in my cargo shorts. That I will be wearing, when the economy opens in May. Which is a good month for cargo shorts. \n\nDisclaimer: last bought new phone in 2015.", "score": 12, "replies": [{"body": "Cargo shorts stock goes up? Buy $JCP", "score": 3, "replies": []}]}]}, {"body": "And the stock goes up? Got to love this illogical market!", "score": 13, "replies": [{"body": "The market is not logical, otherwise how could Enron become so valuable, before their downfall? Those books were burnt to a crisp, after cooking them.", "score": 2, "replies": []}]}, {"body": "It’s like a 5 year old wrote that article", "score": 4, "replies": [{"body": "*wrote", "score": -10, "replies": []}]}, {"body": "Is Apple still slowing down current phones to boost sales of new phones?", "score": 3, "replies": [{"body": "Technically that’s not why it was done. The overall purpose of that design is to protect the batteries of older phones, because them cutting out due to higher demand than they can supply quickly damages them. \n\nThey were fucking retarded in how they handled that entire situation, but from an engineering perspective, it makes a lot of sense.", "score": 6, "replies": []}]}, {"body": "5G gone be good just for home / office use but phones with fake 5G ( fake because it not gone be able to use 100% of real 5G speed ) 5G only gone boost signal of 4G and 3G in limited places . Companys shoul increase cover of 4G instead 5G ...", "score": 1, "replies": []}, {"body": "Apple is concentrating on selling ear buds.", "score": 0, "replies": []}, {"body": "Damn it. And I need a new phone too!! I still have the original X!😭", "score": -15, "replies": [{"body": "Shit I have the original X and do not need the 12", "score": 13, "replies": [{"body": "I have the iPhone 8 and am not even thinking of buying a new phone.", "score": 3, "replies": []}, {"body": "It’s been slow as fuck recently and my battery is wearing out. I’d like a new one", "score": 0, "replies": [{"body": "Battery replacement is easy and cheap. Buy a battery and kit online for $40, and you can do it yourself in under 20 min.", "score": 6, "replies": []}, {"body": "Your battery could be the reason it’s running slow. If the battery app in settings is telling you to have it serviced then there’s a good chance your CPU is being throttled to prevent it shutting off under load.\n\nDespite the uproar a couple years ago, Apple was throttling to prevent shut-offs as the battery aged, and I highly doubt they stopped using the technique or they’d have upset users that phones keep resetting.", "score": 2, "replies": []}, {"body": "lol, i can't even", "score": 2, "replies": []}, {"body": "Oh wow! Mines going strong. And personally we’ve plateaued with phones so I’m in now rush to upgrade.", "score": 1, "replies": [{"body": "I’ve had it for over 2 years now so I’m ready for a change", "score": 0, "replies": []}]}, {"body": "SE 2 dude", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -13, "replies": [{"body": "Agreed on Apple impact but aren't all mega caps affected big? Digital advertising will be down 30% year over year. Even Google just slashed own marketing budget by 50% for rest of 2020.\n\nGoogle, Facebook and Amazon will be hit by this. Advertising is Amazons fastest growing segment. \n\nCompanies already using azure, o365, AWS, big query, etc are still using them. But how many new companies signed up for these services post covid? If they weren't using them they may have added some video calling service but that's it. As SMBs go under cloud subscriptions will decrease so Msft bigger B2B weighting will be impacted to. \n\nI feel like the rush to tech the last month has created a bubble and that sector rotation will come soon enough to deflate the tech bubble even if the wider market doesn't pull back.", "score": 3, "replies": [{"body": ">Companies already using azure, o365, AWS, big query, etc are still using them. But how many new companies signed up for these services post covid? \n\nJust on that point...\n\nI have no idea what those numbers are, but you seem to be implying that existing users don't represent a growth proposition. That's completely incorrect. AWS services are largely priced by usage. As demand for these services increase, so does revenue.", "score": 1, "replies": []}]}, {"body": "Their debt level? Explain", "score": 3, "replies": []}]}]}
{"title": "For those of you who think Boeing's stock will react positively to the weekend news, consider this:", "selftext": "Boeing’s balance sheet is in tatters and its cash flow, already under strain, now rests with its Defense unit and a shrinking stream from the 787, 767 and 777 programs. Cash flow from Boeing Global Services is tanking along with the airline industry.\n\nNew product development was put on the back burner with the firing of CEO Dennis Muilenburg and replacement by David Calhoun.\n\nBoeing 777-9 demand was shrinking before the COVID-19 crisis. It’s worse now. Product development now has ground to a halt. There are no New Market Airplanes, no “NMA Lite,” no Future Small Airplanes in the foreseeable future. There are no customers. It will take years to recover from the virus crisis.\n\nThis means Boeing’s future for this decade, for better or worse, relies on getting the MAX recertified and deliveries restarted.\n\nThe need for access to Embraer engineers and Brazil’s lower cost base, for a new airplane, is over—for now.\nPaying around $5bn for a company that has a market value closer to $1bn is problematic, which the market already knew. Assuming Boeing takes federal money, however the deal may be structured, and that would present huge political problems if Boeing sends $5bn to Brazil.\n\nBoeing’s near-term priority is saving itself and rebuilding its balance sheet. It’s hard to see how Embraer fits into this.\n\nThe 2020 decade is going to be Boeing’s lost decade.\n\nThe market knew this merger was not going to materialize, because simply put Boeing could not afford the merger. So the analysts are already saying BA built a narrative with other excuses, and now ERJ will take legal action, and at the very least it will cost BA a hefty termination fee. The bigger issue is that longer term this puts Airbus in a much better competitive position, as the failed merger gives Airbus an advantage.\n\nTL;DR:\nThere's no joy or excitement for Boeing's stock, relative to the failed merger. Any stock advance Monday or Tuesday will probably be faded, and is another selling opportunity before the crushing blow in their earnings report on Wednesday. Good luck to all.", "id": "g8qqxb", "created_utc": 1587950063.0, "score": 68, "upvote_ratio": 0.91, "num_comments": 86, "comments": [{"body": "I’d be aggressively shorting Boeing if it weren’t for the fact that the government will never, never allow Boeing to fail. Boeing is responsible for too many jobs and too much technological development. If commercial aviation goes to shit, the government will order military hardware.", "score": 88, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "1.) Boeing files for chapter 11 bankruptcy\n2.) Gov't gives them money in exchange for assets\n3.) Existing shares effectively become useless because the gov't took control.\n4.) Profit\n\nIs that a correct interpretation? I'm thinking if that's the case, there's still a chance to short Boeing. They'll continue to operate but shareholders gonna get wiped out.", "score": 16, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Would buying a put on a company that files chapter 11 but gets purchased by the gov't print?", "score": 4, "replies": []}]}, {"body": "Yeah right approx 100B yearly revenue out of which 30B comes from defense budget every year. In other words all our taxes or fed printing goes directly to BA every year like a clock work.", "score": 1, "replies": []}]}]}, {"body": "Not failing doesn’t mean it can’t go to sub $100. Just short it.", "score": 8, "replies": []}, {"body": "Defense defense defense.\n\nExactly zero percent change the government let’s anything happen to Boeing.  Way too important to our country", "score": 8, "replies": [{"body": "Bankruptcy is not liquidation", "score": 4, "replies": []}]}, {"body": "BINGO", "score": 0, "replies": []}]}, {"body": "The Max 8 is a dead airframe.  So much needs to be done to correct its deficiencies that [it is cheaper to send them to the wrecking yard](https://www.youtube.com/watch?v=UEPDgSUCVbw) after recovering the engines and selling them to an aircraft manufacturer that doesn't take good engineering for granted.  \n\nHere's a small list of work that need to be done for the Max 8 pass the (\"new\") FAA's recertification requirments:\n\n- the elevator trim jack screw striction issue needs to be corrected (this requires extensive aiframe modifications)\n\n- a triple redundant voting architecture implemented with separate clean room software design needs to be developed (this, just for the software, is probably a five year effort, but it also requires wiring harness and airframe change... mostly adding multiple types of redundant sensors)\n\n- a top to bottom human factors study of the control system and hydraulic amplification system needs to be conducted (this will require an in-depth investigation of why pilots were not able to overpower the MCAS flight control computer and will probably require significant changes to the hydraulic systems, including airframe modifications)\n\n- engine placement and incident adjustments probably need to be made.  It might not be possible to adjust the engine positions so that they don't force the Max 8 into an accelerated stall at full power without full nose down trim.\n\n- control surface blow down issues need to be corrected at the elevator.  This was a contributing factor and requires a redesign of the aiframe's control surfaces.\n\nThere, we have five separate issues, all directly involved in the reason the Max 8 crashes happened.  All of them involve extensive airframe modifications that send all currently \"flying condition\" Max 8s back to the assembly lines for correction.  It is worth observing that the assembly lines are designed to work in the forward direction, meaning the wing will have to be de-mated from the fuselage in order to get the airframe back to the assembly line for correction.", "score": 25, "replies": [{"body": "I didn't understand anything you just said but it sounds like you know what you're talking about and BA is bad. Going all in on $100 5/1p tomorrow at open.", "score": 13, "replies": [{"body": "Don’t do it, that guy is retarded", "score": 5, "replies": [{"body": "If I inverses that, you are retarded", "score": 6, "replies": []}]}]}, {"body": "Also the wiring harness was badly designed leading to rubbing -> potential shorts and fires over a reasonable operational timeframe.", "score": 2, "replies": []}, {"body": "Damn are u an engineer", "score": 2, "replies": []}, {"body": "Those are all nice to have.  Most of that is not a requirement to have the aircraft certified.  The FARs aren't as stringent as people think.", "score": 1, "replies": []}, {"body": "Rule 1 of building model aircraft: Always go nose-heavy.   \n\nAny slightly nose-heavy aircraft can be made to fly with enough power. Here's Peter sripol making a flying tortilla:  \n\n[https://youtu.be/dpVp3NX-QOA?t=602](https://youtu.be/dpVp3NX-QOA?t=602)  \n\nA tail heavy plane (max8) is fundamentally unstable", "score": 1, "replies": [{"body": "The Max 8 is not tail heavy.\n\nIt is *effectively* \"tail heavy\" (not actually) under full power.", "score": 0, "replies": [{"body": "Oh okay so it will only enter an unrecoverable stall when close to the ground, got it, that sounds like the safest place to be uncontrollable because the passengers can just walk out.  \nDo you work for Boeing PR, or are you just /mostly/ retarded?", "score": 1, "replies": [{"body": "The center of lift is moved ahead of the center of gravity with the application of full power.\n\nThere, are you happy now?", "score": 1, "replies": [{"body": "yes. We have fixed our comments like true gentlemen.", "score": 1, "replies": []}]}]}, {"body": "It's still a fully safe airframe, it climbs a bit more than the standard 737 during full power, but there is nothing wrong with that.\n\nThe issue is that they tried to make it fly exactly like a 737, but they wrote bad software.\n\nIt will be the safest plane ever once certified", "score": 0, "replies": [{"body": "Until they get the \"runaway trim\" issue fixed, it is not a safe aircraft.\n\nFixing that problem is multifaceted and requires structural airframe modifications.\n\nFADECS sometime fail at full throttle.", "score": 3, "replies": [{"body": "Yeah the runway trim is of course a safety issue, but that is not the fault of the airframe, just the software and the point of making it fly like a 737.", "score": 0, "replies": [{"body": "> but that is not the fault of the airframe,\n\nIt is directly due to airframe engineering decisions.\n\nThe 737 series aircraft have always had trim jack screw striction issues.  That became deadly in the Max 8.  It needs to be solved before the airframe is safe.\n\nSecondarily, the engines require full nose down trim in a flight regime experience at least once during every flight (takeoff and departure).  Some might argue that this is only an issue because MCAS went \nberserk, but the reality is that the trim should never be completely pegged at maximum setting due to engine operation.  It's just bad design and it is unsafe.", "score": 2, "replies": [{"body": "Thank God someone actually heard the phrase \"control systems engineering\".  \nBeing at the edge of your control regime is the equivalent of your Boeing calls getting margin called when you work at MacDonald's part time", "score": 2, "replies": []}, {"body": "I was actually not aware that standard procedure was full nose down trim for takeoffs, that does seem like a bad thing. I was under the impression that the plane could fly perfectly safe, and that the software being used to make it fly like a 737 was the issue", "score": 1, "replies": [{"body": ">  and that the software being used to make it fly like a 737 was the issue\n\nYou are correct on this point, but the software is only one of many, many issues that combined to create completely unrecoverable situations.\n\n> under the impression that the plane could fly perfectly safe\n\nThis is obviously not the case, with two entire plane loads of people going to a horrific end having already proven that point.", "score": 1, "replies": [{"body": "My second point was hypothetical if the software would be fixed, sorry if that wasn't clear. The plane was obviously not safe as it was.", "score": 1, "replies": []}]}]}]}, {"body": "Dude they put OP overweight engines too far back what don't you understand about this?!  \n  \nThe guy you're arguing with (not me) clearly knows a lot about aircraft engineering so sit down.", "score": 1, "replies": [{"body": "I'm just trying to understand where I'm wrong, I'm interested so I want to learn", "score": 1, "replies": [{"body": "WSB comment threads are meant to be combative :)\nThere are some really good youtube channels about aviation - plane nerds are like train nerds but way more socially acceptable. For aviation industry news, I recommend DJs aviation - he has access to shitloads of leaks.  \nFor highly technical but easy to understand videos about how commercial aircraft work, I recommend Mentour aviation. He is a pilot so he breaks down the technical details, with the perspective of a pilot, but at an ELI8 level.", "score": 1, "replies": [{"body": "I already watch those haha", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Guy actually thinks this matters, what a true retard, this is how real things work. How important is your business? How difficult and much money does it take to start up a plane building business? How much are you connected to big daddy government, and how bad are we gonna look if the chinese or europe makes planes? Guy thinks screws are gonna take down a company...FAA? Who the fuck you think controls that? Thats why you are en engineer, go tinker with your legos, while the big boys control the zombies and slaves.", "score": 1, "replies": []}]}, {"body": "Consider this: you’re betting against a company which designs, manufactures, and supports nuclear-capable aircraft for the largest defense budget in the world. They can pull all kinds of fucky stuff with numbers to make their earnings where they need to be. \n\nThis stock has taken the short term hit. Small opportunity left for downside... best move I see here is with equity. They’ll pop back, it’s just a matter of timing. \n\nSince stocks are boring, $140 calls within a month or $150 in June are looking cheap and juicy too.", "score": 29, "replies": [{"body": "This is what scares me about shorting BA at these levels/playing earnings. The Gov can at ANY time drop a fat contract for new aircraft and flip sheets to the black.", "score": 18, "replies": [{"body": "Boeing’s leadership is well positioned with Trump. I’m confident we will see $BA pop back to $180 by September.", "score": 17, "replies": [{"body": "Yea I could see that happening but with that being said a revisit of lows if the market tanks again like people are predicting wouldn’t be a surprise", "score": 11, "replies": [{"body": "Big if there chief", "score": 4, "replies": []}, {"body": "It’s in the realm of possibility, but I don’t see circuit breaker days anymore. I think a longggg sideways moves between $130-$140 for the rest of the year is the most likely worst case. This Embrear deal is an insignificant blip on the radar too.", "score": 3, "replies": []}]}, {"body": "Yeah, 5 months is more than enough time for Trump to threaten military stuff causing boom boom death machine stocks to moon.  Personally, I think he will go after Bad Korea, because his pal little rocket man is in poor health.  Kim Yojo will take over, piss off Trump, he'll call her a nasty woman and threaten NK to as a proxy action against China for the beer virus.", "score": 3, "replies": []}]}]}]}, {"body": "Long term I'd bet on Boeing. But short and even medium term, it's likely to face a lot of troubles. I had 120/share as a buy in point. I might hold off until sub 100. They won't go out of business, it's a matter of National Security that they don't. That doesn't mean they'll bounce back within the next few years.", "score": 11, "replies": [{"body": "I’ve been cost averaging since 160 my average is probably 140 but yeah I’ll be loading up if it hits 100", "score": 4, "replies": [{"body": "r/investing needs more people like you.  \n\n\"I have been throwing dollar bills at this dead stripper since i finished my buffalo wings 4 hours ago. Pretty soon she'll start dancing again once the flies clear away\"", "score": 1, "replies": []}]}]}, {"body": "Sir, this is a casino.", "score": 24, "replies": [{"body": "Luck?   Lucky???\n\nLK 15C 5/1", "score": 3, "replies": []}]}, {"body": "Leave Boeing alone! (Fellow bag holder)", "score": 8, "replies": []}, {"body": "While many of your points are valid near term, there’s no numbers to back up the impacts described.Yes, the commercial side is bleeding, but they had a 5 yr backlog, which is now 3 based on number of cancellations and deferrals. In 3 years, pending a virus strain mutation, Boeing will be back to providing planes as usual at 3 years and could be better off if government forces American Airlines to use US made planes as part of their bailout (wouldn’t be surprised if Trump pushed this). Ok, on to Defense. Here’s where Boeing has shined the last last couple of years Boeing defense was 23.2B revenue last year with 14% YoY growth compared to 60B on commercial. There are several very large defense contracts coming this year and next. I expect with the defense news and commercial side getting MAX SW re-cert, the stock will stabilize 180 - 220 until demand returns. No way it plummets to 2 digits and if it does everyone should buy, there’s enough cash flow to make it to the Max re-certification and recoup payments on the grounded planes.", "score": 5, "replies": [{"body": "Idk about wide bodies but I’m fairly sure the 37 has close to 5 years of backlog", "score": 2, "replies": [{"body": "Hey everyone get in here this guy thinks the Max will fly again!", "score": 1, "replies": [{"body": "He said nothing about the max? And I'm 99.9% sure that it will fly, and be one of the safest planes ever", "score": 0, "replies": [{"body": "OK well it's not one of the safest plane ever, that ship has already sailed.  \n(Or rather that plane is already a smouldering wreckage).  \nThere is another comment in this thread with details on why the max could take up to 5 years to fly. This isn't like recalling a shitty airbag in a car, this is a complete recertification and CAA/EAA are not as beholden as FAA.  \nAs the author of the other comment stated it may be cost effective to rip out the 20mln worth of engines and seats and fit them to your 320neos rather than parking and cycling the aircraft for a recertification that will certainly come too late.  \nBoeing will be paying for the grounding and it is rapidly becoming larger than its NAV.", "score": 1, "replies": [{"body": "They won't get it back up in the air unless it is deemed 100% safe, and at that point it will be one of the most scrutineered planes ever", "score": 0, "replies": [{"body": "Read. The. Parent. Comment.  \nIt's not flying this year. Stop trying to make 'fetch' happen it's not going to happen", "score": 1, "replies": []}]}]}, {"body": "It's only down 0.58% so far today thanks to retail you can still get out with a small loss\n  \nAddendum: You know they will lose substantially more than 2bn this quarter and they haven't started compensation for airlines on the max yet?", "score": 1, "replies": [{"body": "Yeah economic growth will be halted, I was more talking about the safety of it. I don't own any Boeing stock btw so that has nothing to do with this", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I've got most of my portfolio in 135c 5/1. 🙏\nNot feeling so great tbh. May try to cut my losses at open.", "score": 3, "replies": [{"body": "I think we'll gap up Monday-Tuesday...that being said, I'm dumping as soon as that happens", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "This aged well", "score": 1, "replies": [{"body": "We got all day", "score": 0, "replies": []}]}]}, {"body": "It dipped after hours.  On the rebound by open.", "score": 4, "replies": []}, {"body": "It’ll bounce when the government provides them emergency funding", "score": 4, "replies": [{"body": "Yes, but how much BA flesh will the government talons get to dig into if Boeing accepts that money?\n\nFNMA junior preferred share holders have \"enjoyed\" a full decade's worth of suspended dividends.", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Dividend investors will be all over that if it drops, but it'll come back up.", "score": 2, "replies": [{"body": "They suspended the divi", "score": 1, "replies": []}]}, {"body": "Earnings call push IV up bby", "score": 2, "replies": []}, {"body": " Confirmation bias.  I can dig this.", "score": 2, "replies": []}, {"body": "I’m seeing way too many posts on shorting Boeing here..... calls it is", "score": 2, "replies": []}, {"body": "Maybe Embraer will be buying Boeing at this rate", "score": 2, "replies": []}, {"body": "You forgot about uncle Sams infinite Wallet there mr bear.", "score": 2, "replies": []}, {"body": "All I read is puts on Airbus, but I don't think you can trade options on Airbus!?", "score": 1, "replies": []}, {"body": "Remindme! 2days", "score": 1, "replies": [{"body": "I will be messaging you in 1 day on [**2020-04-29 03:24:48 UTC**](http://www.wolframalpha.com/input/?i=2020-04-29%2003:24:48%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/g8qqxb/for_those_of_you_who_think_boeings_stock_will/fopc7px/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fg8qqxb%2Ffor_those_of_you_who_think_boeings_stock_will%2Ffopc7px%2F%5D%0A%0ARemindMe%21%202020-04-29%2003%3A24%3A48%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20g8qqxb)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "So sell the longest calls on boning that I can", "score": 1, "replies": []}, {"body": "What’s a balance sheet? Can I use it as toilet paper?", "score": 1, "replies": []}, {"body": "No stake in this game, just curious.\n\nRemindme! 4 days", "score": 1, "replies": []}, {"body": "Boeing can and will exist just fine with a single digit stock price.", "score": 1, "replies": []}, {"body": "The government will pay literally any price Boeing asks for anything though.  50 billion for a jet?  They don't have any other buyers lined up for it, but sure we'll just pay it.", "score": 1, "replies": []}, {"body": "Lol the usual reverse WSB holds true. BA the one stock continuing to hold green this week in a sea of red.", "score": 1, "replies": []}, {"body": "This didn't age well. It's doing great. Glad I bought. Just going to sell here in a day or so.", "score": 1, "replies": []}, {"body": "Is this Dave trying to short BA again?", "score": 1, "replies": []}, {"body": "Priced in.", "score": 1, "replies": []}]}
