{"title": "[deleted by user]", "selftext": "[removed]", "id": "g7k52g", "created_utc": 1587774952.0, "score": 140, "upvote_ratio": 1.0, "num_comments": 88, "comments": [{"body": "This is fantastic. Thanks for taking the time. I read at least 70% of it", "score": 35, "replies": [{"body": "I appreciate that! Haha", "score": 10, "replies": []}, {"body": "You mean 72.345% of it.", "score": 5, "replies": []}]}, {"body": "Couldn't have said this any better. This is one of our biggest advantages as option sellers and one of the foundational reasons that we can profit consistently. Great work", "score": 16, "replies": [{"body": "Consistently until you don’t. And when short gamma doesn’t, it tends to blow up. Risk management is definitely key to long theta trades.", "score": 7, "replies": []}, {"body": "Thanks man!", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "So all you are saying is that this just needs a big number of trades for the edge to play out?", "score": 2, "replies": [{"body": "correct. If you only make 10 trades a year, and all of those trades have a 70% chance of winning, do you really think its likely you'll win 7 and lose 3? Maybe, but not likely. If you make 100 a year you'll be closer to 70/30, and so on. There's something called the Central Limit Theorem in statistics that kind-of gets at this point.", "score": 8, "replies": [{"body": "Yup, and it’s brother the law of large numbers.", "score": 3, "replies": []}]}]}, {"body": "The law of large numbers.", "score": 1, "replies": []}]}, {"body": "Really In-depth post affirmed what I thought and added some tid bits of things I didn’t thank you OP", "score": 9, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}, {"body": "Nice write-up. So I assume your setup is you short volatility (sell calls, puts or both) when the IVR is at a certain high level since it is likely to revert back. Can you elaborate a bit on the specific mechanics such as which is the IVR threshold you use, which delta you sell, if you choose directional or neutral plays, DTEs and such.", "score": 6, "replies": [{"body": "Not op but we likely use very similar mechanics, i like to sell in IVR >50 if possible, the higher the better, around 30-45 DTE, typically delta neutral strategies unless hedging my portfolio, strikes determined by my credit target (1/3 of the strike width for defined risk, ~15-25% of margin req for undefined risk)", "score": 5, "replies": [{"body": "Basically this! Haha.", "score": 3, "replies": []}, {"body": "Interesting, these sound like tastytrade mechanics. How do you select what stocks to trade/screen your trades?", "score": 2, "replies": [{"body": "Well they pretty much are, ngl. I typically only look at liquidity and IVR, and sometimes it's still hard to find a suitable underlying. Besides tight bid asks, I ofc will screen by price if im trading undefined risk, but that's about it", "score": 2, "replies": [{"body": "Can I find IVRank on a website for free? I don't use TastyTrade.", "score": 2, "replies": [{"body": "[optionsivr.com](http://www.optionsivr.com) is one but I know there are others. If you Google 'XYZ IVR' you should come up with a couple", "score": 2, "replies": [{"body": "Wow thanks this is what I was looking for!", "score": 1, "replies": []}]}]}]}]}, {"body": "Undefined trades will have sharper Vega declines right?", "score": 2, "replies": [{"body": "Yes (I believe)", "score": 1, "replies": []}]}]}, {"body": "What tools do you use to monitor this? Can you put alerts on this in TOS or something like that?", "score": 1, "replies": [{"body": "Tools to monitor what? IVR? I'm not sure how in TOS but tastytrade calculates it for every underlying I want to look at. All my watchlists have it, I can type in any ticker and see it. I can also plot it by typing the ticker and then \".IVR\" which is how I made that NFLX.IVR plot above.", "score": 4, "replies": [{"body": "Yeah how do you tell when's a good time to open the contract. Say you want to sell a weekly sometime during the week, do you just keep checking it over and over or put an alarm with a specific price?", "score": 2, "replies": [{"body": "No, tho I also don't sell weekly cycles. I look at what is liquid and has high IVR, then decide if I like the trade based on underlying, portfolio Greeks, other things and trade it or don't. I don't decide I'll sell X and then watch the price, I sell based on where premium is high.", "score": 2, "replies": [{"body": "And how do you search for stocks with high premium? Is it a manual process of checking out a stock individually or search for it in a specific way using a specific site/app?", "score": 2, "replies": [{"body": "I use watchlists. Tastyworks has some good default ones but just build your own. Liquidity is King for me, all the popular stocks, the most highly traded ETFs. I hate wide bid/ask spreads", "score": 2, "replies": []}]}]}]}]}, {"body": "I am wondering the same thing.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I mean if he makes directional plays like bull/bear credit spreads and such or neutral ones such as strangles, butterflies and such.", "score": 1, "replies": []}]}]}, {"body": "Nice writeup. I think the 5% risk free rate refers to junk bonds guaranteed by the Fed perhaps?\n\nI saw an interesting article a while ago that I have been unable to find again which suggested that in the long run IV was not overstated for earnings events and I notice that many people try to avoid being short options over earnings or try to close out first thing after opening.", "score": 4, "replies": [{"body": "Yeah the example I used is somewhat dated. I'd love to read that article, earnings are something I'm just starting to explore, tend to avoid binary events in general but looking to expand.", "score": 3, "replies": [{"body": "I was just joking. I've got the same book and frequently recommend it. Apparently at some time in the past government bonds actually paid that much! Actually, I remember being young and seeing an actual paper government bond which paid 10%", "score": 5, "replies": []}, {"body": "[Here's a link to an Options Alpha study on earnings events](https://www.reddit.com/r/ActiveOptionTraders/comments/g8pita/earning_trades_research/?utm_medium=android_app&utm_source=share)", "score": 2, "replies": []}]}]}, {"body": "Nice perspective. Have you considered implementing bollinger bands?", "score": 5, "replies": [{"body": "I don't know much about them really, any suggestions on where to learn?", "score": 5, "replies": [{"body": "Bollinger bands is just a simple X moving average with 2 lines above and below it in a Y standard deviation distance, where X and Y are the parameters of the indicator. So for example Bollinger Bands (14,2) are a moving average with 2 lines above and below it in a distance of 2 standard deviations.\n\nAlso I find it really weird on how you know all this stuff about volatility but nothing about Bollinger Bands, they are one of the most common volatility indicators.", "score": 5, "replies": [{"body": "My thoughts too, that’s why I suggested them. They are one of the first indicators I use for HV and IV analysts.", "score": 2, "replies": [{"body": "How do you use Bollinger bands to determine if the volatility is high enough to sell premiums? I thought HVR/HVP were more suitable tools for that.", "score": 1, "replies": []}]}, {"body": "Thanks! That's an odd gap in my knowledge haha", "score": 1, "replies": []}]}]}]}, {"body": "How do you do the remind thingy .. this makes alotta sense but im kinda drunk and wanna remember to read it again tomorrow ..", "score": 4, "replies": [{"body": "Just save the post", "score": 4, "replies": [{"body": "Ill save your post .. jk im still drunk .. re-remind!", "score": 3, "replies": []}]}, {"body": "!remind tomorrow", "score": 0, "replies": [{"body": "Nope thats not it 😂", "score": 5, "replies": [{"body": "Someone upvote me so atleast that notification brings me back!", "score": 9, "replies": []}, {"body": "!remindme 24 hours", "score": 2, "replies": [{"body": "I will be messaging you in 1 day on [**2020-04-26 10:04:20 UTC**](http://www.wolframalpha.com/input/?i=2020-04-26%2010:04:20%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/thetagang/comments/g7k52g/introduction_to_volatility/foj5e8x/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fthetagang%2Fcomments%2Fg7k52g%2Fintroduction_to_volatility%2Ffoj5e8x%2F%5D%0A%0ARemindMe%21%202020-04-26%2010%3A04%3A20%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20g7k52g)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}, {"body": "I started selling options for the exact reason you stated:   \n\nI have learned the hard way that I’m not good at timing market direction.  \n\nI also learned the hard way about IV crush and theta.\n\nI have sold five options that reached expiration so far.   All 5 were profitable.   Two put positions ended exactly ATM.   Two puts were OTM and one covered call ended up ITM, but I was fine with the shares being assigned. \n\nI know that sooner or later I’ll be left bag holding, and I hope to diversify enough to mitigate that problem.   I’m also taking some potential gains off the table with near-strike covered calls, but I’m not using that much of my money for this strategy so far.", "score": 5, "replies": []}, {"body": "Awesome post man, thank you. Couple questions: I see how price is calculated and IV is one of many factors but how is IV determined? I’m unclear on that, like how is it determined that IV plummets for Netflix after earnings? It can’t just be the event itself because I have seen plenty of options keep their high IV after earnings the past couple weeks. Also what setup are you using for that IVR chart?", "score": 3, "replies": [{"body": "If market participants expect the underlying to have a high future volatility, this will be reflected via demand and supply in the option price, and therefore you can deduct said implied volatility from actual prices observed in the market by solving your pricing formula for IV. \n\nThere is no direct link to any specific event like earnings calls, it is just a reflection of the market sentiment. For example, a oil driller might release earnings and guidance tomorrow, but if market participants think that these numbers are not particularly relevant to the future price of the underlying in the current market environment, it may not significantly affect IV.", "score": 2, "replies": [{"body": "When you say supply and demand in the option price is that just open interest?", "score": 1, "replies": [{"body": "Hm, i’m not sure open interest is directly involved in this. The market price, i.e. last traded, is determined by someone willing to buy and someone willing to sell. The exchange where you trade options has an order book and the price will move up and down that order book depending on what orders are filled at what price. I would say open interest is therefore a result of the price movement, but I could be wrong here.", "score": 1, "replies": []}, {"body": "supply and demand in my mind is essentially just bid/ask.", "score": 1, "replies": []}]}, {"body": "this!", "score": 1, "replies": []}]}, {"body": "I think you can basically look at high IV as being a result of there being a lot of willingness amongst option buyers to pay higher and higher prices for an option contract. They‘re willing to pay more because they anticipate that the underlying stock price is really going to move.\n\nLow IV would be the opposite. People aren‘t paying a lot for a particular option so the IV remains lower.\n\nIn this sense, the IV comes out of the prices driven by demand. You could say that it’s the last component of the pricing model and it goes up and down as the prices do. Therefore, at a glance, a high IV in relation to that stock‘s historical volatility tells you that prices are high and selling likely makes more sense than buying.", "score": 1, "replies": []}, {"body": "> but how is IV determined?\n\nThis is one of the big things I was/kind of still am confused about. I used to think until only a couple weeks ago that the pricing of options, following the Black Scholes model for example,  depended on some known parameter called \"Implied Volatility\". My new understanding is exactly the opposite. The (extrinsic) option price just is what it is. *Implied volatility is calculated from the option price and not the other way round!* That's why it's \"Implied\" volatility. It's implied by the price of the options, because as op mentioned, the true volatility is never actually known.\n\nSomeone please correct me if I've still got this messed up lol", "score": 1, "replies": [{"body": "Thanks for the input. That doesn’t sound quite right though. Yes it isn’t known for certain that’s why a contract can be profitable, IV may be over or underestimated. But a drop or increase in IV can cause an options price to drop or increase respectively, as well other things like price movement and time. I think is the fluctuations of IV that reflects on the price rather than the other way around, I could be wrong though.", "score": 1, "replies": []}]}]}, {"body": "Options as a strategic investment will always be my go to book anytime I have to brush up on something.", "score": 3, "replies": [{"body": "It's so good!", "score": 3, "replies": []}]}, {"body": "I think most theta gang trades would be more affected by delta than vega, I'm not sure selling high IV options is the best strategy if you're not delta hedged.", "score": 3, "replies": []}, {"body": "Great read, I really needed that. Quick question, how often does the IV change dramatic around earnings?", "score": 3, "replies": [{"body": "I don't have any hard numbers for you off hand so I would just say \"most of the time\" IV drops after earnings announcements", "score": 2, "replies": []}, {"body": "And thanks!", "score": 1, "replies": []}]}, {"body": "I don't use TastyTrade. Is there a free website I can find IVRank for stocks and chart it like you did on Tasty?", "score": 3, "replies": [{"body": "Barchart or marketchameleon can give you volatility info, not positive if they let you chart it or not.", "score": 2, "replies": [{"body": "Marketchameleon gives too many IV numbers it gets confusing which one to look it. Plus it has a freaking pop up on every page, super annoying.", "score": 1, "replies": [{"body": "Your broker probably has this info to be honest, who are you with?", "score": 2, "replies": [{"body": "I use paper trading on ThinkOrSwim for research.", "score": 2, "replies": []}]}]}]}]}, {"body": "Great explanation. \n\n\nYou mention that you think (justifiably so) that the market overestimates IV. Do you (or anyone else) know of a common situation where the market underestimates IV (aka there's more volatility than expected)? Just curious.", "score": 2, "replies": [{"body": "There have been extreme IV discounts to 30 day realized since the market bottomed on the 23rd (locally least) but in an up trending market you’d have lost on many long vol trades. IV is much quicker to react than historical vol measures.", "score": 2, "replies": []}, {"body": "You can see it here https://marketchameleon.com/Overview/SPY/IV/\n\nMost of the time historical volatility is below implied but not always.", "score": 2, "replies": []}, {"body": "I think as someone else said earnings can occasionally do that. Also flash crashes like what happened recently are outliers. I'll ponder whether this can happen outside of those scenarios.\nAnd thanks!", "score": 1, "replies": []}]}, {"body": "Thanks for the writeup! When you say, that HV of 50% means that there is a 68% chance for the underlying closing at +/- 50% in a certain timeframe: Does this mean there is a 68% chance for the underlying to stay in the +/-50% channel over the entire timerange? Or can the underlying break out of the channel as long as it closes within +/-50% at the end of the timeframe?", "score": 2, "replies": [{"body": "That's a good question. I believe the answer is the latter. There is another, smaller probability of the price getting to whatever that \"breakout\" point is. The probability is after the entire period of time will it be within 50% of where it is right now. 68% of the time yes. Single day outliers wouldn't be predicted by something like this as this is a statistical approximation. It could blast up to 200% of current price tomorrow, it's just very unlikely.", "score": 1, "replies": []}]}, {"body": "Ok. If IV is implied based on stock movement in the past - how does option buying and selling change it?", "score": 2, "replies": [{"body": "IV is not implied by past movement, it's implied by current prices. See the above reply by u/LimaSierraRomeo for a nice succinct explanation. Basically IV is a calculated result from a pricing model such as Black-Scholes. More supply/demand action = more IV since it's forward looking, not based on past prices.", "score": 1, "replies": [{"body": "I gotcha, but why would prices decline after ER? The stock is still volatile, it's still had all its historic movement.", "score": 1, "replies": [{"body": "People no longer are speculating as to what the ER results are gonna be, and the option prices reflect that", "score": 1, "replies": []}]}]}]}, {"body": "This was my concern for a while - is wheeling just picking pennies on a railroad track, or is there some sound reason why it works. Option trading is ruled by big companies with billions of $ and huge computers, so if I see a price I can be sure it is not bad for the counterparty, all imbalances are sniped out in miliseconds. A followup question: so selling let's say calls and hedging for delta is pretty much a money printer? Or selling straddles?", "score": 2, "replies": []}, {"body": "Hasn't realised vol been higher than implied vol during this crash?", "score": 2, "replies": [{"body": "It was for a bit, yes absolutely.", "score": 1, "replies": []}]}, {"body": "Great explanation of Vol, thank you.", "score": 2, "replies": []}, {"body": "Looking at the earnings threads in WSB, and everyone trying to take directional positions (and all *buying* options) you should make this post private lol!\n\nThanks btw it was a very interesting read", "score": 1, "replies": []}, {"body": "So you sell puts???", "score": 0, "replies": [{"body": "I buy and sell puts and calls", "score": 1, "replies": []}]}]}
{"title": "A High Level Guide to Trading Unusual Options Activity", "selftext": "Hey all, I've received a good number of requests to post a guide on how exactly one trades high volume unusual options activity. I'll keep this fairly high-level, and I encourage those who are inspired by this post to do more research on the subject. My goal is to give you guys a guideline one where to begin your studies, but I'm not here to teach you guys outright on how to trade Unusual Options Activity.\n\n&#x200B;\n\n**What is Unusual Option Activity?**\n\nUnusual options activity occurs when a certain contract on a specific series experiences unusually high volume. Generally volumes above one to two thousand on smaller cap stocks or in the tens of thousands for larger more liquid equities. \n\n&#x200B;\n\n**What is UOA good for?**\n\nUOA is primarily used to see institutional option order flow in order to piggyback off their plays. Institutions are smart, richer, and have far more resources than your average retail investor, so piggybacking off of their plays will usually net you a profit 9/10 times. Insider trading is a lot more common than you think, and sometimes you can see institutional order flow to predict big stock moves before they occur.\n\nUOA is NOT useful for ETF's such as SPY, QQQ, or USO. I don't care how smart an institution is, no institution can predict the market. Even Bridgewater Associates, the largest hedge fund in the world headed by Ray Dalio, experienced massive losses during the current COVID-Crash. SPY is not going to hostilly takeover Apple. USO will not be bought out by Netflix. IWM is not going to have a shitty press release and tank after earnings. Stop burning your cash through trying to predict ETFs\n\n&#x200B;\n\n**How to Scan for UOA**\n\nThere are many services that can scan for UOA, but you guys all have google and I'm not going to shill products. Personally I use ToS's built in scanner. If you're interested, there are many videos on the art of scanning for UOA. \n\nOne thing of note, websites like BarChart are good for a general picture, but never trade based on options activity found on BarChart alone. It does not show individual order flow and you have no way to tell if they were selling, buying, opening or closing positions. Plus they update super slowly so you'll miss out on trades anyways. \n\n&#x200B;\n\n**Things to Look Out For**\n\nAnalyzing UOA is more of an art than a science. It really requires an understanding of different types of option spreads, MM behavior, option pricing, and fundamental analysis. It by no means is an easy way to make money and it is very difficult to differentiate hedges and bets. UOA is NOT the holy grail of trading, or else other people would have already jumped in on it. That being said, with proper risk management and a well developed set of financial skills, it can be a great supplement to an existing trading strategy. With that out of the way, here are general things to look out for.\n\n* Volume to Open Interest\n   * Understanding the Dynamics of volume and open interest is a great way to determine whether orders are opening or closing. \n* Bid/Ask Spread\n   * Bid/Ask Spread analysis will help you determine how aggressive orders were and whether or not order flow was buying or selling. \n* Days till Expiry\n   * This is the best method to differentiate between hedges and bets, but it is not an exact science and is sometimes very subjective until the trade runs its course. \n* Implied Volatility\n   * Sets expectations of Institutions\n* Charting\n   * Option orders leave footprints in the form of MM orders. Learn these.\n* Option Spreads and Strategies\n   * You MUST have a deep understanding of every option strategy. These are critical to determine direction of bets. \n\nAnd that's about it. UOA is a difficult strategy to master, but once you know what you're doing it can be a consistent and profitable strategy. \n\n**TL;DR**: if you're reading this then this post isn't for you. Just buy SPY 5/1 200p.", "id": "g7lvae", "created_utc": 1587781936.0, "score": 320, "upvote_ratio": 0.97, "num_comments": 79, "comments": [{"body": "Thank you for an actually good post. More of this, please.", "score": 36, "replies": []}, {"body": "Mommy when I grow up I want to be a trend follower", "score": 48, "replies": []}, {"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 28, "replies": [{"body": "awesome, 3 garlic bread plz", "score": 10, "replies": []}]}, {"body": "How do propose distinguishing genuine option interest from a hedging option position?", "score": 25, "replies": [{"body": "That's where you'll have to do more research and gain more experience", "score": 16, "replies": [{"body": "Fuck you bitch, give me free advice", "score": 64, "replies": [{"body": "spy 5/1 100p", "score": 60, "replies": [{"body": "You trying to be poor here? Need that 75p to print the extra tendies.", "score": 16, "replies": []}]}]}]}]}, {"body": "A valuable post and not some shitty jpow meme on wsb in April 2020?? 🤯\n\nBitchy comment aside, thanks! That's the good content.", "score": 22, "replies": []}, {"body": "Can you elaborate a bit on the footprints you are referring to and a hood resource for learning?", "score": 13, "replies": [{"body": "You could go to any low income area and find a hood resource for learning.", "score": 42, "replies": [{"body": "Lmao, I would gold you but I’m poor", "score": -8, "replies": [{"body": "Should’ve bought calls 🤷‍♂️", "score": 2, "replies": [{"body": "Plot twist: I have. I only trade options with $1,000 and reinvest all gains above that threshold into a brokerage account", "score": 1, "replies": []}]}]}]}, {"body": "Youtube is a great resource to understand how option block orders affect MMs", "score": 5, "replies": [{"body": "Did that 2:00 YouTube video inspire you to spend an hour writing this?", "score": -3, "replies": [{"body": "nah i just got tired of people asking after my ACC and SNAP calls lol", "score": 8, "replies": []}]}]}]}, {"body": "What do you think about ACC option activity for 5/15 puts? Around 5000 puts for $25 dollars expiring 5/15, every other option has a volume of <50", "score": 6, "replies": [{"body": "I made a post about that this morning, bought in at .8", "score": 8, "replies": [{"body": "Ohh my bad I’m retarded I didn’t realise that was you. Is it too late to buy in on Monday? That contracts worth like 1.40 or something now and it looks like it rose a lot off of IV alone.", "score": 5, "replies": [{"body": "IV may have reduced the gains, but the primary thesis still hold. We're waiting for a catalytic event. Make sure to set your trailing stop losses though just in case", "score": 3, "replies": [{"body": "Thanks for taking the time to reply and write these up!!", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "usually a trailing percentage, 20-30%", "score": 2, "replies": []}]}]}]}]}]}, {"body": "> Just buy SPY 5/1 200p.\n\nWhy so far out? Did 4/27 and 4/29 cease to exist?", "score": 4, "replies": [{"body": "Those will expire worthless.", "score": -5, "replies": []}]}, {"body": "Sir this is a Wendy’s.", "score": 12, "replies": []}, {"body": "The best thing to use it for is mid to small cap companies pre earnings. For example LVS call buying of a particular strike was getting bought up a few days in advance of earnings last week. I bought the same strike and cleared 120%. I look for the insider trading looking plays only when utilizing this type of info.", "score": 3, "replies": []}, {"body": "Thanks for the writeup. I recently got into UOA plays after profiting bigly on $GILD and $SHAK. Like you said, UOA plays don't work on Index funds and I found this out the hard way after taking some losses on $SPY and $IWM. But overall this is an amazing starting point for someone like me. I just have a couple questions if you don't mind me asking. \n\n1. While ETF plays are bad when doing UOA, would you still consider it to be important to do analysis on ETF movements as they, from my experience, seem to influence the movement of stocks?  \n\n2. Do you trade in anticipation of catalyst events or try to avoid them? I've been hesitant to make Earnings plays based on unusual options activity and was wondering if they're even reasonable plays to make. \n\n3. what are your thoughts on my current plays? All of them are derived from my own research into UOA plays combined with some TA as well as research into any possible catalyst events. These are all small plays (2 contracts) that I bought with the profits from my $GILD and $SHAK plays to test the waters. \n\n- $SPCE 20c 5/1 - I noticed repeat call activity on multiple strikes for 5/1 and decided that the safest bet would be at the 20 strike. After doing some TA, it seems that SPCE is trading on a rising channel so I bought at the bottom and am up 44% so far. \n\n- $PLAY 12c 5/1 - 3,000+ contracts were purchased at open expiring next friday at the 12 strike. I had mixed feelings between if this is a hedge or bet and made a bet on this being a bet based on how close the expiry is. It also seems that PLAY is trading on a falling wedge pattern with a breakout to be expected soon. I'm up about 7% on this one. \n\n- $ACC 25p 5/15 - It seems you also got into this play but my reasoning for getting into this was the fact that I noticed that ACC was trading in a downward channel and was luckily able to buy in at $0.95. I'm up 63% on this one. \n\n- $DAL 24c 5/15 - I have mixed feelings about this one, an order was placed above $1M expiring in 2 weeks. The main deciding factor was the size in terms of cost and volume along with the relatively close expiry. Other than that that I did some TA and it seems like DAL is trading in a falling wedge. Unfortunately I placed this order while it was tanking and am down 14%.", "score": 5, "replies": [{"body": "I haven't had too much research on ETFs and UOA price action, but I would say UOA analysis is pointless of ETFs. Things like SPY are so liquid and so commonly used for hedging that there's too much noise.\n\nBoth catalyst events and trades without catalysts but with rumors are good to trade on.\n\nI'll DM you about the rest", "score": 1, "replies": []}, {"body": "Hey, I'm trying to learn from first principles too and feel I've hit a bit of a wall. Perhaps you can help. I've watched several long videos on UOA and feel I have a good grip on it. But in ToS I can't put together a meaningful scanner for them. The videos I've found on YouTube are mostly people spotting large trades - and that's about where the analysis ends. I cant figure out how to find out more about the possible trade nor am I confident in those particular scanner settings. Pointers to better content appecistef!", "score": 1, "replies": [{"body": "So I personally have only started using ToS and have been in the same boat as you in terms of building meaningful filters that produce good results while filtering out a lot of the noise. I wish I could help but I think you'd be better asking OP. \n\nAs for things to look out for, I'd point to this article. It does a good job of pointing out what to look for with UOA: https://www.tradermentality.com/2016/10/how-to-find-unusual-options-activity.html", "score": 1, "replies": [{"body": "Thanks! I'll have a look!", "score": 1, "replies": []}]}]}]}, {"body": "With UOA you have to also be careful to make sure it's not a large hedge. I've seen people follow big money thinking a 200k put purchase was because someone knew it was gonna tank only to find out it was a hedge for a massive account.", "score": 3, "replies": [{"body": "that's why it's important to properly manage one's risk and never yolo into these", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "will meade is good imo", "score": 2, "replies": []}]}, {"body": "High volume, low open interest, does that mean a lot of positions got open and then closed, repeatedly within a day? Unless there are wild price fluctuation within a day, why would anyone do that?", "score": 2, "replies": [{"body": "The thing about open interest is that it's only calculated at the end of the day. so volume>open interest implies large buying or selling to open", "score": 4, "replies": [{"body": "I see, but I still don't understand.\n\nTake any day, suppose 1k transactions is made per hour for 8 trading hours, if all these transactions are to open position, both volume and open interest at the end of the day would be 8k, if yesterday's open interest is 0. \n\nIf the open interest at the end of the day is 0, then 4k transaction is to open position and the other half is to close position. Is that right?", "score": 3, "replies": [{"body": "that's why you have to cross-check with level 2 info. remember sometimes it's MMs on the other side of this trade, not just another trader", "score": 1, "replies": [{"body": "Now I understand, it is those HFT MM that open a position one second, and close it another.", "score": 1, "replies": []}]}]}, {"body": "Summabitch, that's the piece of information I was looking for. I was getting confused as to how change in open interest could possibly be higher than volume! So if open interest is calculated at EOD, that means the current value during trading day is for yesterday's EOD open interest then, and change in open interest is yesterday's EOD compared to day-before-yesterday's.", "score": 2, "replies": [{"body": "calculated eod, displayed next day", "score": 2, "replies": []}]}]}]}, {"body": "Thank you for posting this! I started looking into this yesterday and by the look of reading your post, I got more lucky with my win than anything else! I’m looking forward to continuing to see you post some of your picks and appreciate the time you’re taking to help us noobs. SPY 5/15 200p.", "score": 2, "replies": []}, {"body": "This is great, thanks for posting. It was exactly what I needed to hear. I have one quick question about your SPY put. I lost so much money on my SPY puts, do you still really think we will get too 200 by 5.1? It seems if we were to have a drop, it would be slower than that. Would love to hear your thoughts.", "score": 2, "replies": [{"body": "bruh it's a joke haha\nI only hold long term spy puts and vix calls to hedge my positions against systematic risk", "score": 4, "replies": []}]}, {"body": "You briefly touched on IV- do you look for a certain level?  like >80?", "score": 2, "replies": []}, {"body": "Thank you for a valuable read.", "score": 2, "replies": []}, {"body": "Great write up. Im new to the game but on way to being a autist soon enough. Ive been looking over barchart uoa page and i see put options but I don't understand if it is a buy or sell of a put. How would i know? Im using robinhood and the 2 options are super confusing me", "score": 3, "replies": [{"body": "Step one is to get a real brokerage. Also as I said above, only using BarChart will actually make this strategy impossible. Take a look at ToS", "score": 3, "replies": [{"body": "Thank you for this. I have been using ToS for a bit now and it has been a breath of fresh air. I am going to start looking at the scanner function.", "score": 3, "replies": []}, {"body": "What is your opinion on cheddarflow and flowalgo?", "score": 1, "replies": [{"body": "Good for scanning and generating trade ideas, gives you too many false positives to be worth the price you pay for", "score": 1, "replies": [{"body": "You don't have this with ToS?", "score": 1, "replies": [{"body": "I do but at least I don't pay for it", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Do you have any books you could recommend? I will do research online but I always learn best reading a real paper book", "score": 2, "replies": [{"body": "I don't know any book that delves into UOA, but if you're looking for some relevant reading material, I recently bought Options as a Strategic Investment 5th edition, I really like anything by Nassim Taleb, and the New Market Wizards by Jack D Schwager are all good books if you want a mix of science and psychology of trading.", "score": 4, "replies": [{"body": "Oh nice I'm reading market wizards right now! I'll check out the other one, thanks for reply", "score": 2, "replies": []}]}, {"body": "2 words John Hull", "score": 2, "replies": []}]}, {"body": "Every option has 2 sides...\n\nAlso a lot of times I use Unusual Options Activity to pick which side to sell spreads on at earnings.  MMs will buy heavy at a ridiculous OTM strike a few days prior to ER, new autists will follow that trade and get wrecked.", "score": 1, "replies": []}, {"body": "Can you quick a response on how to best understand the bid-ask spread on flow?", "score": 1, "replies": [{"body": "B/A analysis is good for determining aggression in trading. Just think about what price you would buy or sell at for a sure thing vs a speculation", "score": 2, "replies": []}]}, {"body": "U got any good videos u recommend to learn more?", "score": 1, "replies": []}, {"body": "How do you differentiate a hedge from bet based on expiration date? Protective put hedges are usually close dated then rolled over? Reason being long term would be more expensive? Only thing is, wouldn't a bet based on insider info usually be close dated as well?", "score": 1, "replies": [{"body": "again, this is more of an art than a science. Not every trade is going to be right and sometimes an option flow that looks like a bet may turn out to be just a hedge. The key is with experience it will help you differentiate between the two much easier. however, Hedges are usually LEAPS, not close dated and not bought a week till expiration", "score": 3, "replies": []}]}, {"body": "Nice post. What exactly are you looking at in TOS that BarChart isn’t showing you? I have eTrade and have the same search feature but not sure what to look for. How can you see option flow for example? Thanks!", "score": 1, "replies": [{"body": "Level 2 options data is critical", "score": 1, "replies": [{"body": "What do you mean by Level 2?", "score": 1, "replies": [{"body": "https://www.google.com/search?q=level+2+option+data&oq=level+2+option+data&aqs=chrome..69i57.6115j0j7&sourceid=chrome&ie=UTF-8", "score": 1, "replies": []}]}]}]}, {"body": "You ever heard of The Trading Fraternity on YouTube (aka the CULT)?  Every other time we go for a play it shows up on CNBC as “unusual options activity” lol.  Most those trades are decided based on a literal coin toss, but you’ve got nerds thinking some rich fund is trading so many contracts — actually it’s like 5,000 people trading a handful of contracts each.  \nIf you’d like to follow that kind of stuff, you might as well toss your own coin.  I’ve been trying to toss my own coin for years, but I can never manage to reach.", "score": 1, "replies": [{"body": "what", "score": 1, "replies": []}]}, {"body": "> Understanding the Dynamics of volume and open interest is a great way to determine whether orders are opening or closing. \n\nIn ToS, how do you determine whether the day's volume went to Open Interest?  Or does \"unusual\" mean Open Interest and Volume are roughly equal?", "score": 1, "replies": [{"body": "OI is calculated at the end of the trading day and the updated number is displayed at the beginning of the next trading day. The rest of the info you need is here\nhttps://www.investopedia.com/ask/answers/050615/what-difference-between-open-interest-and-volume.asp", "score": 2, "replies": []}]}, {"body": "Can you share the filters you use in your tos scan? Right now mine is divided into volume being greater than open interest but it’s hard to determine sweeps, above the ask, etc just from that", "score": 1, "replies": [{"body": "options volume>2000, option dte 1-30. stock mkt cap", "score": 2, "replies": []}]}, {"body": "Has anyone heard from r/WSBGOD?", "score": -4, "replies": [{"body": "It was proven that he was fake. Where have you been lol", "score": 1, "replies": [{"body": "Ahh son of a bitch. I’ve been on r/feet", "score": 1, "replies": []}]}]}]}
