{"title": "Is AMD Somehow Still a Buy?", "selftext": "This stock has been making huge gains and I unfortunately missed all those, since I never bought.", "id": "5dmowl", "created_utc": 1479479692.0, "score": 26, "upvote_ratio": 0.9, "num_comments": 56, "comments": [{"body": "Are you planning on holding long-term?  Then yes.  If you're trying to swing-trade it, then no.  Faggot.", "score": 38, "replies": [{"body": "/thread ", "score": 5, "replies": []}]}, {"body": "Yes, but make sure you buy it at the top of a price jump. ", "score": 16, "replies": [{"body": "Alright, now what?", "score": 5, "replies": [{"body": "Sell the dip.", "score": 12, "replies": []}]}]}, {"body": "I think it needs to drop at least a dollar to be a good buy.  That said I will probably buy in at$8 because I'm really dumb", "score": 9, "replies": []}, {"body": "No because I sold at 3.50 and I'm still bitter. ", "score": 9, "replies": []}, {"body": "no", "score": 27, "replies": [{"body": "care to elaborate on why?", "score": 8, "replies": [{"body": "no", "score": 46, "replies": [{"body": "no", "score": 6, "replies": []}]}, {"body": "no", "score": 19, "replies": []}, {"body": "no", "score": 12, "replies": [{"body": "no", "score": 12, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "no", "score": 8, "replies": [{"body": "no", "score": 6, "replies": [{"body": "no", "score": 5, "replies": [{"body": "no", "score": 5, "replies": [{"body": "no", "score": 7, "replies": [{"body": "cat", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "no", "score": 8, "replies": []}, {"body": "no", "score": 3, "replies": []}, {"body": "on", "score": 5, "replies": []}, {"body": "like someone said, if u want to hold it and wait months it'll likely go up, imo, but if u want to swing trade then no. wait till it dips and then buy a lil and it shoujld go up again. i expect to sell at like 10 or maybe even just hold it for a v long time", "score": -2, "replies": []}, {"body": "Fuck No", "score": -1, "replies": [{"body": "https://m.youtube.com/watch?v=IYdX9geon6U", "score": 1, "replies": [{"body": "GTFO Hillary! Go walk some dogs or shit", "score": 1, "replies": [{"body": "Walk the dog... with like a yo yo?", "score": 1, "replies": [{"body": "Yeah but only after you wipe the server with a cloth", "score": 2, "replies": [{"body": "With this: http://www.bleachbit.org/cloth-or-something\n\nOr a microfiber cloth?", "score": 1, "replies": [{"body": "You got me. That was funny ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[removed]", "score": -2, "replies": []}]}]}, {"body": "Wait to see if it pulls back, but it's definitely still worth holding into Q2 of 2017. At that point I think we'll have a better idea of how Zen can compete on the open market and whether or not NVDA will start to claw in AMD's market share.\n\nFull disclosure;\nI purchased 918 shares of AMD at $6.66 (no joke, go fuck yourself)\n\nI sold 500 shares yesterday at $8.72 per share.\n\nI currently hold and intend to hold, if not buy more, 418 shares.", "score": 6, "replies": []}, {"body": "Yes. Go check their balance sheet YOY, it looks incredible. If Zen is a success, you'll wish you got in at $9 a share. I sold some of my position yesterday and I'm looking for either a dip or for it to test a $9 high before buying again.", "score": 7, "replies": []}, {"body": "Fuck no.  If anything I will short it just because every fucking time I buy AMD it falls 5-10% the next day.  And then I sell to \"cut losses quickly\" like a fucktard then it goes back up.  But then again I'm retarded.", "score": 3, "replies": []}, {"body": "Yes, Q1 of 2017 is going to be godly for AMD.", "score": 3, "replies": []}, {"body": "I stand by $10 in 1-2mo.", "score": 6, "replies": []}, {"body": "Wait until it dips.", "score": 4, "replies": []}, {"body": "No, AMD is a stock symbol, silly ", "score": 2, "replies": []}, {"body": "As soon as their debt dilutes share price then it's a buy. Till then watch us other cucks make gains\n", "score": 1, "replies": []}, {"body": "Nah, you missed out on them. AMD is still heavily indebted and super risky. Wait for it go back to like $6, or $6.50 even first. ", "score": -1, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "Good point. I'd buy NVDA too, if it goes below $90. ", "score": 3, "replies": [{"body": "You're setting arbitrary buy points based on tea leaves coming out of your asshole.  They're both worth the buy if you're planning on holding long-term.", "score": 15, "replies": [{"body": "[removed]", "score": 5, "replies": []}, {"body": "True. But why buy now when you can wait a little and the market goes schizophrenic?", "score": 1, "replies": [{"body": "Because how do you know the market is actually going to go schizo and AMD is going to drop?  No one knows whether AMD is going to go up another 3% today or drop 5% on Monday, but it's far more likely over the long-term that it's going to keep going up because of their position in a huge growth industry.  \n\nSo you might as well buy as soon as you can instead of trying to time the market with unknowable information.", "score": 3, "replies": []}]}]}]}]}, {"body": "No they are not heavily indebted, they pretty much paid half of it off, and with share price at a high, I wouldn't doubt they would double down and pay of the rest again. That would create a nice dip to play.", "score": 3, "replies": []}, {"body": "Idiot, they paid off their debts in Q3", "score": 2, "replies": []}, {"body": "Yeah, I think I'm gonna wait and see if it dips to like $6 and then buy.  It sucks because just looking at that one year chart, it's insane what that stock has done.  Over 300% return.", "score": 1, "replies": [{"body": "Hold that thought and never let go. A bad habit to get into is thinking that a stock will just stop going up because it's consistently gone up. It's really just another variation of the Gamblers Fallacy. A lot of people disagree on this, but I firmly believe AMD has at least a year of solid growth and momentum to sustain it. \n\nYes, I do think it will pull back in $7 territory, but I don't know if it could go back to $6. A lot of their high interest debt has been paid off and investors have certainly noted that their balance sheet looks much better with some great product prospects on the horizon.\n\nI also just love betting on underdogs though.", "score": 5, "replies": [{"body": "Q4 earnings report will be positive and put them in the profits for the first time in years, I personally believe.  It's going to be a $10 stock within the coming months.  And then possibly $20 within the coming year or two.", "score": 3, "replies": []}]}, {"body": "Don't worry about it. Still plenty of other opportunities in other companies. If you like biotech, go buy some BMY. It's still at a good price and there was an overreaction to some test results a while back because the company selected a higher p-value to conduct them. \n\nPlus the company is a leader in immunooncology.\n\nPlus, tech's taken a hit, I would get into Amazon right now if I were you.  ", "score": 0, "replies": [{"body": "Also, whoever had the foresight to buy DRYS at the beginning of November and sell last week must be happy with themselves", "score": 0, "replies": [{"body": "DRYS was on the brink of insolvency. You could have lost all your money. Why would you buy into a bankrupt business? Bet on legit companies with legit earnings. ", "score": 5, "replies": [{"body": "I agree, like what happened with SUNE.  I bought JBLU because I really like the company and their growth, but for about a year, it was performing bad and I finally broke even.  I'm up 6.30% on that, but I think it has ways to go.\n\nI bought some shares of ZTO, which was the biggest IPO of the year and they seem to be a growing company and has potential, if they expand outside of just serving Alibaba.\n\nApple has been terrible for me, but still holding long term.  I might consider buying Amazon stock.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "It's time to buy puts when wsb is posting these questions.", "score": 0, "replies": []}]}
