{"title": "Downbeat earnings ahead and no guidance make Aapl a dull boy Downbeat earnings ahead and no guidance make Aapl a dull boy Downbeat earnings ahead and no guidance make Aapl a dull boy", "selftext": "[deleted]", "id": "10ksa91", "created_utc": 1674628686.0, "score": 0, "upvote_ratio": 0.09, "num_comments": 18, "comments": [{"body": "Post your short position.", "score": 9, "replies": [{"body": "No short position. As I have said for years.  What is hard to believe about that. There are lots of patient investors waiting for discount prices to increase upside🥉.  That is me. No shorts till summer", "score": -1, "replies": [{"body": "With phrases like “bull trap” and trolling comments like “but here on the aapl subreddit it’s always sunny in The Shining Garden of Eden”… I just assumed you’d have a short position. Since you’re obviously smarter than everyone here and all…", "score": 5, "replies": [{"body": "I am not smarter than everyone here. \n\nI’ve just found that if you have any kind of contrarian opinion on this sub, there is  rarely a discussion to be had other than dismissive snark. \n\nCan’t this sub be a portal for engagement on anything other than holding?  \n\nSeriously. I don’t think I’m being outrageous to suggest that there may be a good buy in the 115 area. Why is that upsetting to people?\n\nIf I’m wrong no Biggs right?\n\nI’m just looking for a discount because I think the next few quarters will be underwhelming.  If I’m wrong no Biggs \n\nI keep thinking when I post opinions not pulled out of thin air, that there might be others who say, I’m buying at this price because _______\n\nI’m not posting for holders. I’m posting for new positions.  If you’re buying at $144 I would like to understand your thinking beyond apple always goes up forever", "score": -1, "replies": [{"body": "Have you tried going about in a less condescending way? Your post leads me to believe you have little intention of presenting actual discussion.", "score": 5, "replies": [{"body": "My bad - totally not my intention. I just have conviction for what I’m suggesting. And believe me, I’m ready to be wrong in this market", "score": 1, "replies": [{"body": "Well, personally… I have an average far lower than $144 and I haven’t bought this year with all the green we’ve been seeing. But I wouldn’t fault anyone for buying right now.\n\nSure… if I was forced to make a prediction I’d say we see some more downside due to economic uncertainties and depending on what moves the fed makes in the coming quarters. But not many of us in here care what the stock does this year. What is the stock going to do in 5 years? 10 years? 20 years? I’d say in 2033, $144 is going to look like a pretty great entry price.", "score": 3, "replies": [{"body": "Hmmm.  My point about aapl Reddit", "score": 1, "replies": [{"body": "I thought your point was that people are constant permabulls, in any climate over any timeframe.  Thought I provided a rational take…", "score": 2, "replies": [{"body": "It’s all good. Upvote", "score": 0, "replies": []}]}]}, {"body": "Avg price of 29 or so…holding for decades…and will never sell…buy more on dips", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Then, you’re full of crap. Given the confidence you exude in your post and the explanation you gave me, you should be certain you could make money. Yet, you have taken no short position on what should be a sure thing. I call malarkey.", "score": 1, "replies": [{"body": "Haha.  Okay buddy. I have never taken a short position. I am confident I will be able to buy aapl at 115-117. It won’t stay there long. But look at a chart. You can see this is a low resistance level multiple times. Like over a year ago in a better economy \n\nI have never once in decades of trading and investing taken a short position. I wait for better prices.   \n\nI like the Biden reference though.  But don’t know why it’s so controversial to suggest a pullback before a June to Dec surge.\n\nWhat price are you buying new shares at?", "score": 1, "replies": [{"body": "Market because my model puts the maximum buy price at about $200 in order to achieve my growth goals. If it tanks, fine, I buy more. If it grows, fine, I still buy more. Each quarter I recalculate the maximum buy price and, decades in, the approach has never let me down all without worrying about what’s going to happen in the next 3-6 months.\n\nBut here’s the thing, if you’re so confident of the drop, you would be shorting. The fact you’re not tells me you’re probably lying. Why you’re lying, I have no idea.", "score": 2, "replies": [{"body": "Wow. Accusing me of lying now.  What is up with this Reddit. Never shorted in my life. Waiting for a better entry price like many many out there that are far smarter than me.\n\nWhy are you lying about me?  Lol\n\nBe well human I wish you luck in your endeavors", "score": 1, "replies": []}]}]}]}]}]}, {"body": "So, exactly what do you think AAPL will reach when? If your analysis is correct, you should be ready to present your predictions so we can see if you are indeed an oracle. If so, I would love to subscribe to your newsletter.", "score": 1, "replies": [{"body": "It was all there for ya you \n\nBefore the next to 2 earnings calls are through aapl will hit 115-117.  I will buy some lots at these prices and below. Can’t get more simple or testable than this", "score": 0, "replies": [{"body": "Great, thanks. This information was not clear in the original post.", "score": 1, "replies": []}]}]}]}
{"title": "Tesla's 2022 Q4 Results", "selftext": "Here's a quick take on Tesla's Q4 results. $81.5B is the FY2022 revenue, a growth of 51.4% year over year from FY2021. The gross margin increased for the year from 25.3% to 26.2%. Net income increased 128% from $5.5B to $12.5B. Expect EBITDA to be at least $17.6B this year, an increase of 9% or so from FY2021.\n\nGiven these results, the valuations are as follows: the invested capital of Tesla is 5.1x LTM or FY2022 revenue -- remember, this multiple includes Tesla's huge cash balance of over $21b. The EBITDA multiple is about 25x while the earnings multiple (over market cap) is around 30.0x. Based on 2023E results, the earnings multiple should be around 26.0x. In other words, they're coming down like many growth companies that turn the corner and report positive earnings. Tesla was EBITDA positive starting in 2016 and earnings positive starting in 2020. The revenue growth year over year is 51.4% from FY2022. Plus these multiples would be somewhat lower if you took out the cash Tesla has: the actual trading multiple based on its businesses would be more reasonable: 4.7x revenue; 17x EBITDA; 30x earnings.\n\nAt $148, Tesla seems to be fairly valued based on continued growth: would expect another 50% sales growth for FY2023 and improving EBITDA and NI margins. The valuation isn't that ridiculous assuming the growth rates and profit margins are reached in 2023 and beyond. The question is how threatening is competition from the new entrants to the EV market introducing their own models.\n\nAddendum: Tesla turned FCF positive starting in FY2019. One concern is the amount of capex necessary to keep churning out vehicles.  The average capex the last 5Y is nearly $4 billion per year.  Assuming that plant capacity hasn't been reached and capex goes down to the $2.5B level, this shouldn't be a concern.   ", "id": "10lcfjp", "created_utc": 1674687475.0, "score": 7, "upvote_ratio": 0.69, "num_comments": 10, "comments": [{"body": "TSLA data.\n\n```\n TSLA                                                                              [Data from latest 8 quarters]\n\tTesla Inc         : AUSTIN, TX\n\tConsumer Cyclicals, Auto & Truck Manufacturers, SP500, NASDAQ\n\tEmployees         :       99,290\n\tOpInc per Emp     : $    200,654\n\t10Q Date          :  2022-Sep-30\n\tPrice             :       133.42                                               [ 133.42 227.54 297.15 290.25 312.24 371.33 229.07 236.48 ]\n\n\tMarket Cap        :    401,571.40 M\n\tShares            :      3,146.00 M (Seq=    1.12% : QoQ=    5.08%)            [ 3,146.00 3,111.03 3,102.03 3,039.03 2,994.03 2,913.03 2,883.03 2,853.03 ]\n\n\tSales 12m         :     74,863.00 M (Seq=   26.69% : QoQ=   55.95%)            [ 21,454.00 16,934.00 18,756.00 17,719.00 13,757.00 11,958.00 10,389.00 10,744.00 ]\n\tCOGS 12m          :     54,940.00 M (Seq=   26.55% : QoQ=   59.18%)            [ 16,072.00 12,700.00 13,296.00 12,872.00 10,097.00 9,074.00 8,174.00 8,678.00 ]\n\tGross Profit 12m  :     19,923.00 M [Sales - COGS]\n\tOp Income 12m     :     12,368.00 M (Seq=   49.68% : QoQ=   84.03%)            [ 3,688.00 2,464.00 3,603.00 2,613.00 2,004.00 1,312.00 594.00 575.00 ]\n\tIncome Tax 12m    :      1,148.00 M (Seq=   48.78% : QoQ=   36.77%)            [ 305.00 205.00 346.00 292.00 223.00 115.00 69.00 83.00 ]\n\tNet Income 12m    :     11,187.00 M (Seq=   45.92% : QoQ=  103.46%)            [ 3,292.00 2,256.00 3,313.00 2,326.00 1,618.00 1,142.00 438.00 270.00 ]\n\tInterest 12m      :        229.00 M (Seq=   20.45% : QoQ=  -57.94%)            [ 53.00 44.00 61.00 71.00 126.00 75.00 99.00 246.00 ]\n\tInterest Rate     :          5.17 %\n\tEst Interest 12m  :        183.67 M\n\tIncome Tax Rate   :          9.28 %\n\n\tCash <- Ops 12m   :     16,031.00 M (Seq=  116.93% : QoQ=   62.06%)            [ 5,100.00 2,351.00 3,995.00 4,585.00 3,147.00 2,124.00 1,641.00 3,019.00 ]\n\t  CapEx 12m       :          9.00 M (Seq=    0.00% : QoQ= -100.00%)            [ 0.00 0.00 5.00 4.00 6.00 10.00 12.00 13.00 ]\n\t  Dividends 12m   :          0.00 M                                            [ 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 ]\n\t    FCF 12m       :     16,022.00 M [Cash from Operations - CapEx - Dividends]\n\tCash <- Fin 12m   :     -4,289.00 M [Movement of cash between a firm and its owners/creditors : borrowing, debt repayment, dividend paid, equity financing.]\n\t  Net Cash 12m    :     11,742.00 M [Cash from Ops + Cash from Financing]\n\tCash <- Inv 12m   :     -7,758.00 M [Purchases and sales of long-term assets such as plant and machinery - assumed infrequent.]\n\t  Cash Flow 12m   :      3,984.00 M [Cash from Ops + Cash from Financing + Cash from Investing]\n\n\tCurrent Assets    :     35,990.00 M (Seq=   15.27% : QoQ=   43.95%)            [ 35,990.00 31,222.00 29,050.00 27,100.00 25,002.00 24,693.00 24,705.00 26,717.00 ]\n\t  Cash            :     19,532.00 M (Seq=    6.59% : QoQ=   21.58%)            [ 19,532.00 18,324.00 17,505.00 17,576.00 16,065.00 16,229.00 17,141.00 19,384.00 ]\n\t  Acct Rx         :      2,192.00 M (Seq=    5.33% : QoQ=   11.72%)            [ 2,192.00 2,081.00 2,311.00 1,913.00 1,962.00 2,129.00 1,890.00 1,886.00 ]\n\t  ST Invest       :      1,575.00 M (Seq=  166.50% : QoQ= 5,150.00%)           [ 1,575.00 591.00 508.00 131.00 30.00 0.00 0.00 0.00 ]\n\t  Inventory       :     10,327.00 M (Seq=   27.37% : QoQ=   98.63%)            [ 10,327.00 8,108.00 6,691.00 5,757.00 5,199.00 4,733.00 4,132.00 4,101.00 ]\n\t  Other           :      2,364.00 M (Seq=   11.61% : QoQ=   35.40%)            [ 2,364.00 2,118.00 2,035.00 1,723.00 1,746.00 1,602.00 1,542.00 1,346.00 ]\n\tCurrent Liabs     :     24,611.00 M (Seq=   12.79% : QoQ=   36.34%)            [ 24,611.00 21,821.00 21,455.00 19,705.00 18,051.00 16,371.00 14,877.00 14,248.00 ]\n\t  Acct Pay        :     13,897.00 M (Seq=   23.95% : QoQ=   68.24%)            [ 13,897.00 11,212.00 11,171.00 10,025.00 8,260.00 7,558.00 6,648.00 6,051.00 ]\n\t  ST Debt         :      1,457.00 M (Seq=   -4.90% : QoQ=  -15.09%)            [ 1,457.00 1,532.00 1,659.00 1,589.00 1,716.00 1,530.00 1,819.00 2,132.00 ]\n\t  Other           :      9,257.00 M (Seq=    1.98% : QoQ=   14.64%)            [ 9,257.00 9,077.00 8,625.00 8,091.00 8,075.00 7,283.00 6,410.00 6,065.00 ]\n\tWorking Capital   :     11,379.00 M (Ratio=1.46)\n\tWC + FCF          :     27,401.00 M\n\n\tTotal Assets      :     74,426.00 M (Seq=    8.63% : QoQ=   28.69%)            [ 74,426.00 68,513.00 66,038.00 62,131.00 57,834.00 55,146.00 52,972.00 52,148.00 ]\n\tGoodwill          :        419.00 M (Seq=   -4.12% : QoQ=  -10.85%)            [ 419.00 437.00 454.00 457.00 470.00 486.00 505.00 520.00 ]\n\tTangible Assets   :     74,007.00 M (Seq=    8.71% : QoQ=   29.01%)            [ 74,007.00 68,076.00 65,584.00 61,674.00 57,364.00 54,660.00 52,467.00 51,628.00 ]\n\tLT Debt           :      2,096.00 M (Seq=  -27.67% : QoQ=  -67.44%)            [ 2,096.00 2,898.00 3,153.00 5,245.00 6,438.00 7,871.00 9,053.00 9,607.00 ]\n\tTotal Debt        :      3,553.00 M\n\tDebt to Equity    :          0.09\n\tNet Tangible      :     70,454.00 M\n\tNet TAVps         :         22.39\n\tSharehldr Equity  :     39,851.00 M (Seq=    9.55% : QoQ=   47.31%)            [ 39,851.00 36,376.00 34,085.00 30,189.00 27,053.00 24,804.00 23,017.00 22,225.00 ]\n\tBVPS              :         12.67   (Seq=    8.38% : QoQ=   40.15%)            [ 12.67 11.69 10.99 9.93 9.04 8.51 7.98 7.79 ]\n\n\tOp Margin         :         17.19 % (Seq=   18.14% : QoQ=   18.01%)            [ 17.19 14.55 19.21 14.75 14.57 ]\n\tNet Margin        :         15.34 % (Seq=   15.18% : QoQ=   30.47%)            [ 15.34 13.32 17.66 13.13 11.76 ]\n\tROE 12m           :         28.07 % \n\tPE                :         37.02   (Seq=  -49.60% : QoQ=  -86.02%)            [ 37.02 73.45 0.00 0.00 264.83 ]\n\tPrice/TAVps       :          5.96\n\tPrice/BVps        :         10.53\n\tSales per Share   :         23.80\n\tPrice/SalesPS     :          5.61\n```", "score": 2, "replies": [{"body": "```\n\t3-Year Net Growth :        734.94 % (-870.00 to 5524.00)\n\tQ0 Est Growth     :         64.25 % (0.69 to 1.14)                             [ 0.95 0.65 0.95 0.69 0.48 0.34 0.13 0.08 ]\n\tY1 Est Growth     :         32.63 % (3.25 to 4.30)\n\tY2 Est Growth     :         36.66 % (4.30 to 5.88) [Forward PE=22.68]\n\n\tFloat             :      2,642.27 M\n\tInsiders          :          0.10 %\n\tInstitutions      :         44.80 % (Number 3,446)\n\tAvg Daily Vol     :        180.31 M\n\tTurnover Float    :         14.65 days\n\tRS                :        -26.07\n\tDebt to FCF       :          0.22\n```", "score": 2, "replies": []}, {"body": "Can you show the link where I can download that data? Thanks.", "score": 1, "replies": [{"body": "I get much of mine from [here](https://www.aaii.com/stock-investor-pro).", "score": 2, "replies": [{"body": "What kind of membership plan do you have to be on to do that: $2 or $3 per month membership?", "score": 1, "replies": [{"body": "I am not sure about the AAII subscription. The SIP subscription is $300 per year. I think that is a bargain.\n\nNo company is going to work hard to collect, collate, and provide an app for this data for free.", "score": 1, "replies": []}]}]}]}]}, {"body": "Seems pretty weak", "score": 3, "replies": [{"body": "50% sales growth is nothing to sneer at. The company is profitable and has no material debt. It's not going bankrupt. 140 sounds about right.", "score": 1, "replies": []}]}, {"body": "After a big price cut, why not positive result. The question is it’s sustainable?", "score": 1, "replies": [{"body": "No one knows that. It's somewhere between 100 and 200. 200 if you believe the continued growth story. 100 if a car company with an EV first mover advantage.  It's crazy to think it's worth 400.", "score": 1, "replies": []}]}]}
{"title": "Is Facebook a buy?", "selftext": "At the beginning of last year, Facebook saw a very large drop in its stock price. This is likely due to Facebook's growth slowing down.\n\n**Case for buying:**\n\nAs of January 24, 2023, its P/E/ ratio is now 12.98 which is remarkably low for a tech company. The saying is that one should be greedy when others are fearful. It appears that investors are currently fearful.\n\nFacebook is the first company to go into virtual reality in a big way. This could be huge for the company and earn it much more revenue in the future.\n\nDespite faltering domestically, Facebook is still growing worldwide.\n\n**Case for selling or holding off:**\n\nFacebook is facing strong competition from the likes of TikTok\n\nFirst mover advantage has very little precedent in the tech industry in which market growth is so high and technological change is so quick that it's easy for rivals to do something better. None of the big tech companies were first movers. Google replaced Yahoo which started out competing with other search engines. Amazon replaced Book Stacks Unlimited (tbf, Amazon was kind of a first mover for overall online retail). Apple replaced Osborne in the PC market before getting overtaken by Microsoft (Apple eventually bounced back with iphones and macs). Facebook itself replaced MySpace. What I'm trying to say is that Facebook's virtual reality is likely to face some serious competition from probably one of the other big tech companies. There is already talk of Apple developing its own virtual reality.\n\n**Personal thoughts:**\n\nI think with everything said, Facebook would be a good buy in the short or medium term but not the long term (investors should pay careful attention to the development of virtual reality by potential rivals). Investors may eventually come to the conclusion that they overshot their fear. Netflix went down 68% in 2022 but has since then doubled. As of January 24, 2023, it's still going up.", "id": "10kseva", "created_utc": 1674629176.0, "score": 3, "upvote_ratio": 0.59, "num_comments": 11, "comments": [{"body": "It could still be a buy but it was a buy when the price was below 100$. That was probably the best moment to get in without much risk", "score": 11, "replies": [{"body": "I do agree!!!", "score": 2, "replies": []}]}, {"body": "Being greedy when others are fearful really only applies  if there isn't a reason to be fearful in the long term. You should only buy stocks that you believe have a good long term growth prospect, if all you see is a possible short term growth then you can very easily get screwed by a short term market fluctuation without having the safety net of an eventual rebound due to the company having good fundamentals.\n\nIf you think facebook has good prospects in 5 years you should buy it, if not you shouldn't.", "score": 4, "replies": []}, {"body": "Ofc it's a buy. They make money on their platforms and have 3bn users. They are very popular in SE Asia and South America so still have room to grow. Tiktok makes huge loses and as soon as tiktok start monetising their app the users are going to go down as there will be more and more ads. They are also mostly young users on tiktok which have no buying power. What's interesting will be to see if these users stay on tiktok as they move through towards their later ages when they have more disposable income. I somehow doubt it...", "score": 10, "replies": [{"body": "And 2 billion of them are fake spam profiles posting shit stolen/recycled “content” . it wont be long before that house of cards comes tumbling down as well", "score": 2, "replies": []}]}, {"body": "Continously gaining for 3 months and kinda too big to fail. I'd say yes", "score": 7, "replies": []}, {"body": "Yes and I bought at 114.  When the only obstacle is the CEOs metaverse fixation and it can be changed on a whim, (and will be IMO) yes.", "score": 2, "replies": []}, {"body": "More like a bye 👋🏻", "score": -1, "replies": []}, {"body": "Yes buddy, buy buy buy! CRAMER SAID IT ALREADY!", "score": -1, "replies": []}, {"body": "No, ever.\n\nEveryone hates it, the ceo is a lizardoid, they burn cash like crazy with zero result, the company itself is demonstratably evil, etc etc.\n\nFuck the numbers, fuck the TA - This ones gonna die eventually.", "score": -1, "replies": []}, {"body": "META seems to be rallying right now within a longer-term bearish trend, driving its MACD above the signal line. However, shares still are getting lower a declining 200-day ma suggesting the dominant trend remains lower. \n\nIt is slightly performing as good as S&P moving avg meaning not very attractive as a buy.", "score": -2, "replies": []}]}
{"title": "Was Tesla IPO a Big Deal?", "selftext": "Sorry for my ignorance, I feel I lived under a rock not knowing who Elon Musk or Tesla was entirely until much later than most. I was wondering was Tesla's IPO well-known?\n\nIs this something investors were talking about since day 1, or did it fly under the radar unconsidered until much later on? Thanks in advanced!", "id": "10ksfsn", "created_utc": 1674629277.0, "score": 9, "upvote_ratio": 0.68, "num_comments": 18, "comments": [{"body": "Well, they raised about 220 million dollars at IPO (in 2010). If you factor in the 15:1 stock splits we've had so far that would be 1.13$-ish per share. There was some media stuff about it since Tesla was the first auto manufacturer to go public in....forever, but I don't think a lot of regular people beyond the eco-crowd saw this as something to invest in - much less count on as making a huge profit some time down the road.\n\n(Heck, I dumped some money into Tesla in 2019 and I didn't do it for profits - I just didn't want to see the company fail. I was aware of Tesla before then but Roadster/Model S and Model X were 'toys for the rich' so I didn't give the company much thought until they brought out the Model 3)\n\nToyota held 50mn $ worth (of the roughly 225mn dollars raised during IPO) and I think Mercedes still owned a healthy chunk of Tesla at the time (also around 50mn $ IIRC?). Both must be kicking themselves that they eventually sold (I think Mercedes sold their share for 500mn $). That 50mn stock package back then would now be worth about 5bn$ today.", "score": 28, "replies": [{"body": "[removed]", "score": -11, "replies": [{"body": "It's a bit like recycling. My bit of recycling isn't going to make a difference - but if enough people do it it makes a difference. \n\nAnd for enough people to do it you have to start with yourself and not just go \"Oh, someoe else shoudl do it but not me\". (i.e. if you believe in something you have to \"put your money where your mouth is\")", "score": 17, "replies": []}, {"body": "Nothing/everything matters", "score": 1, "replies": []}]}]}, {"body": "No, in the early days of Tesla going public they were constantly teetering on going bankrupt. Even Elon said they could possibly go out of business. The main sentiment was they would run out of money and declare bankruptcy eventually.", "score": 10, "replies": []}, {"body": "Tesla’s IPO was fairy well known as IPOs go. It was nowhere on the order of a Facebook or Google but it was not totally obscure either. I’d say slightly above average in terms of visibility", "score": 8, "replies": []}, {"body": "Under the radar; dont forget tesla had a small roadster car with low range, being a bit of a laughing point for electric cars not to work. Only when the model S launched and people got proven there is a future for it; the stock exploded.", "score": 7, "replies": [{"body": "The roadster had 244 miles of range in 2009. That is not low range  even by todays standards", "score": 5, "replies": [{"body": "https://www.autoexpress.co.uk/tesla/roadster\n\n“Near 100”\n\n\nThat, and the common used complaint of “where do you charge it!?!?” Was the common consenses and hence my reply about the stock. I am not defending, nor approving, that it was right or wrong.", "score": 5, "replies": []}]}]}, {"body": "Not to mention the timing was pretty bad. 2009 was the automaker bailout extravaganza so a lot retail investors were terrified of auto in general. \n\nThe logic was that if even the giants of the industry weren't safe then how could anyone be brave enough to take a shot on a startup.", "score": 2, "replies": []}, {"body": "Tesla had a lot of gov $$$ to start up. That was the single biggest chunk. \n\nAt the time, EVs were all thought of as Toyota Hybrids, Honda. Prius. A novelty. \n\nThere was a lot of time the company spent near the peril of possible bankruptcy. \n\nIt's fortunate that most of its existence was in the era of cheap cheap cheap money via 0% rates from the Fed.", "score": 1, "replies": [{"body": "Ding ding on that last statement there. Probably the exact reason why they were successful. I'd wager that there are probably companies that could've been similar to tesla starting up now or in the late 2010's that will now fall because of the high interest rates.", "score": 3, "replies": []}, {"body": "Not rly, tesla came out of bankruptcy in 2019 before the Covid and feds rate happened", "score": 1, "replies": []}]}, {"body": "I envy early investors. Only in my fourth year investing.", "score": 0, "replies": [{"body": "The sad fact was I knew bout tesla since 2015 but I was too poor to buy any shares as I was still studying", "score": 1, "replies": []}]}, {"body": "Tesla was quite popular the moment Elon became a bit more mainstream to the point where it was at $400 at some point. But ever since he became a bit of \"annoying\" on  twitter, it started to plummet and not to mention, the bad news about the car crash of Tesla. I don't know much to be frank, hopefully someone can tell you about it much better than me.", "score": -9, "replies": [{"body": "I'm talking about Tesla in 2010 when it IPO'd, was it something investors were already hopefully waiting for in anticipation or did it slip under the radar for most until much later?", "score": 14, "replies": []}]}, {"body": "dream debt you mean?", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "10kwe89", "created_utc": 1674645632.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 19, "comments": [{"body": "Microsoft is a blue-chip stock and any money you'll put into it is unlikely to be lost as long as you wait long enough. However do keep in mind that Microsoft is an expensive company and it already does hundreds of billions of dollars in revenue on a yearly basis so dont expect any miracles, I think anyone buying Microsoft should expect around 5-6% a year of returns.", "score": 7, "replies": [{"body": "How much do you think I could make back by the next 7 months?\n\nCan you guys actually respond instead of just downvoting for whatever reason please?", "score": -11, "replies": [{"body": "Probably nothing. Maybe negative. Maybe 1% higher. Nobody knows.", "score": 12, "replies": []}, {"body": "There's no rhyme or reason in going into that kind of speculation. If you want guaranteed income you should purchase treasury bonds. In fact I would say that buying treasury bonds at this point is a better idea than buying microsoft anyway.", "score": 2, "replies": []}, {"body": "I own MSFT as a long term hold and I'd be very surprised if it doubles in the next 5yrs, let alone make any big moves in the next 7 months.\n\nSounds like you're trying to \"time the market\" which is very risky and can result in big losses.\n\nFinally, if you need the money in the next 7 months, you probably shouldn't be investing in it the stock market.", "score": 2, "replies": [{"body": "I don’t need the money but for where I am now I’d really want some money in my pocket", "score": 0, "replies": [{"body": "I understand that the downvotes are disencouraging, but your question had a level of naiveness in it. 7 months is a very specific timeframe and in the stock market there are no certainties, Microsoft could be worth anything in 7 months. Again, if you want guaranteed income, look for treasury bonds. You can also buy high dividend positions such as $WU but neither the dividend nor the stocks price are guaranteed, as opposed to treasury bonds.", "score": 1, "replies": []}]}]}, {"body": "Lol.  One hundred billion dollars Dr. evil", "score": 1, "replies": []}]}]}, {"body": "If it means anything I trade options on tons of stuff daily like a fiend and MSFT is one of the only stocks I actually hold. Like never really considered selling. This just reinforces that position.", "score": 2, "replies": []}, {"body": "VTI and chill", "score": 2, "replies": []}, {"body": ">I believe next Monday or Tuesday Microsoft will be announcing how much they will be investing into (or further) into the ChatGPT AI and I want to know what to actually do when that time comes.\n\nWe already know, they invested 10b, a chunk of it being Azure credits.\n\n>I want some advice on what to do to get my foot in the door for the moment it happens next Monday/Tuesday.\n\nThe investment into ChatGPT is already priced in.\n\n&#x200B;\n\n>I'm not very knowledged onstocks and I know some of the things I say here will not sound correct or how people talk about it but I have a good understanding of it.\n\nInvest into index funds and learn about investing.\n\nHere are some great resouces:\n\n\\-One Up on wall street\n\n\\-Margin of Safety\n\n\\-Intelligent Investor\n\n\\-BRK letters\n\n\\-You can be a stock market genius\n\n\\-100 Baggers\n\n\\-M Maubosein Papers\n\n\\- Alchemy of Finance & Interviews of Druckenmiller\n\n\\-Bill Gurley Blog", "score": 2, "replies": [{"body": "Are these books or advice websites or a mix of a bunch of things?", "score": 1, "replies": [{"body": "These are books, interviews, blogs and shareholder letters.", "score": 1, "replies": []}]}]}, {"body": "Growth is slowing year over year. Msft even said azure usage to slow. Windows revenue down 39%, Xbox down 12%, personal computing down 19%. Overall revenue narrowly beats hence the stock taking a dump this morning. Long term should be fine, short term not so much.", "score": 1, "replies": []}, {"body": "I thought they already announced the terms of the deal? To be honest it doesn’t matter how much it deviates from what has already been announced.you aren’t going to see a big upswing on Msft next week tied to this announcement. The earnings report that came out today plus the feb 1st announcement on interest rates will likely have an affect on the stock price in the very short term.", "score": 1, "replies": []}, {"body": "Best way is to watch free youtube tutorials.", "score": 1, "replies": []}, {"body": "That news is priced in. Further investments won’t change the price. Retail should not be trying to play the news just look at after hours on msft yesterday", "score": 1, "replies": []}, {"body": "If you have any debt your better paying that down first.", "score": 1, "replies": [{"body": "I’ve figured out how to not trap myself into slavery and debt so I’m good 👍", "score": 1, "replies": []}]}]}
{"title": "Is AT&T a Sinking Ship or Not?", "selftext": "Hey everyone! I've been looking at AT&T as a dividend opportunity and decided to share my research with you so, without further ado... Behold! AT&T. A stock with history and a stock that has been through a lot. You don't see a lot of companies that hit their all-time highs 24 years ago and are still trading at half price apart from Intel, maybe (they've been having a rough patch, too). Now, I last talked about AT&T over a year ago and I didn't really have a lot of nice things to say about it back then, but has the outlook for AT&T changed in 2023? Well, let's see!\n\n# Operations\n\nFirst of all, AT&T's operations are showing growth in numbers. The telecom company added 2.9 million postpaid wireless subscriptions, 280 thousand fiber net subscription marking the 12th consecutive quarter of more than 200 thousand additions! In terms of 5G, AT&T now covers 150 million people, too! Overall, these are very solid results and better than what analysts and AT&T's management expected.\n\n# Profits\n\nWhat about revenue, earnings and all that? In 2023, AT&T brought in 120.7 billion dollars in revenue and adjusted earnings per share were 2.57 dollars. Reported EPS was actually negative 1.1 dollars, but that was due to non-cash charges, mainly around impairments. AT&T's free cash flow was a 14.1 billion dollars which is okay, but it's not great by any means. The management's forward guidance was also decent. The expectations for 2023 are growth in wireless and broadband of 4% or more, capital investments of about 24 billion dollars, similar to 2022, free cash flow of 16 billion dollars or better which is an expected increase of 12% although AT&T does expect to see a slight drop in earnings per share.\n\nOverall, AT&T performed well in 2022 and is expecting slow, but steady growth in 2023. On the good side, it seems that the Warner Media spin off has not impacted AT&T's business in the way I thought it would. The operations are looking leaner. After we exclude the non-cash impairments, operating expenses in Q4 have actually dropped a bit from 26.2 billion in the year-ago quarter to 25.8 in this quarter. However, there are two big risk considerations here.\n\n# The Two Main Risks\n\nFirst of all, the free cash flow. We are seeing a pretty significant drop from previous years due to the Warner Media spin off. Less free cash flow means less security when it comes to dividend. It also means less money left over for capital investments. Overall, less free cash flow equals lower chances of growth and less money being returned to shareholders. At the end of the day, as investors, we want to make a profit and seeing this drop with AT&T is expected, but still worrying. That is definitely something to keep an eye on. The good thing is that, like we saw, management expects higher free cash flow in 2023, but that is still just an expectation and not a fact.\n\nThe second and much bigger problem I'm seeing is debt. I've never been a fan of companies that rely too much on debt and have a high leverage. I understand why they would do that and with the extremely low interest rates of the last 10 to 12 years, it makes absolute sense. However, it does make a company more fragile and more susceptible during tough economic conditions. Historically, telecomms have been hit harder during recessions, too, which means that AT&T is not really well-positioned for the upcoming year in my opinion. As of the end of the 2022 financial year, AT&T has $135.9 billion dollars in debt. That's a lot considering their equity was 122.4 billion at the end of the third quarter! Their interest payments for 2021 were 7.67 billion dollars. It is looking like the 2022 interest payments will be similar, but given the rising interest rates, it is only a matter of time before the increased interest payments start weighing down on AT&T.\n\n# Valuation\n\nNow, these are two big issues that AT&T desperately needs to work on to get their business in order. However, does AT&T's current price and dividend justify the risk? Let's take a look. I'll be looking at the adjusted ratios because they reflect the underlying business better. AT&T's trailing adjusted PE ratio is only 6.7 and their forward adjusted PE ratio is 7.4. Historically, these are a bit lower since the 5-year average for AT&T stands at 8.7 and 8.9 respectively. However, let's look at their main competitors, Verizon and T-Mobile. Verizon has PE ratios of 7.8 and 8.2 respectively, whereas T-Mobile stands at 21.7 and 66.8 although T-Mobile really has a much different business model and focuses on growth without paying a dividend. In terms of forward price-to-cash-flow, AT&T has the lowest at 4 versus Verizon's 4.5 and T-Mobile's 11.1. It is also lower than it's 5-year historical average which stands at 4.6. Finally, AT&T is again cheapest when it comes to price-to-book with only 1.1 versus 1.7 for Verizon and 2.6 for T-Mobile and historical average of 1.2. Overall, we can see that AT&T is trading at some discount to both its historical performance and its competitors so there is some compensation for the risks that I've outlined above.\n\n# Dividend\n\nFinally, the dividend is one of the biggest arguments for AT&T. Despite the recent dividend cut, AT&T still yields about 5.8% which is a very decent yield. Unfortunately, it is below Verizon's 6.5% yield and below the 5-year historical AT&T average of 6.6%. The payout ratio is similar to Verizon's as both companies have between 45 to 50% there. Plus, chances are AT&T will not raise its dividend until its financials have become improved while Verizon has been showing a slow, but steady annualized dividend growth of 2.5% over the last 10 years.\n\n# Conclusion\n\nSo, what's my final take on AT&T? Honestly, it's hard to see a strong bullish case for the company. Best case scenario, the AT&T stock is a weak buy simply because it has some turnaround potential. However, I personally would not make it a big bet given that I'm not expecting a very rosy economic outlook ahead. In fact, I would avoid both AT&T and Verizon and instead simply buy some of the Charles Schwab's Dividend Equity ETF. It's a lot more reliable and, while it has a much lower dividend yield, it offers a much better total return in my opinion while being exposed to a lot less risk. I may consider buying AT&T if and only if the price drops further down, maybe about $16. Remember, AT&T is a company that hits its all-time high 24 years ago and is heading into a possible recession with a massive debt burden. There are simply better options on the market.\n\nIf I've made an obvious mistake, let me know, please. I'd also love to hear your opinion - what do you think about AT&T (or Verizon) right now?", "id": "10l99pr", "created_utc": 1674679692.0, "score": 3, "upvote_ratio": 0.57, "num_comments": 10, "comments": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Agreed, I would love to see the company dissolve and a different company pick up their service towers in my area", "score": 2, "replies": []}]}, {"body": "Was ATT customer for 20+ years...Moved cell and internet service away last month.\n\nCell - Moved for cheaper option\n\nInternet - Moved to fiber from their copper.\n\nTheir customer service is better than most big companies (just my experience).", "score": 4, "replies": []}, {"body": "With 5.8% dividends in a big and old company, you don't have to get bullish growth for it to be a good investment. Just be satisfied with what you can get. Also, it has a beta of 0.6 so it's good if you want to buy something relatively safe.", "score": 10, "replies": [{"body": "The total return (inc. dividends) for T is -1.26% over the last 5 years vs S&P's 54.53%. Just because it's cheap doesn't make it safe. I don't think it can go down much, but the upside isn't that big either.", "score": 14, "replies": []}]}, {"body": "Nice try Charles Schwab. Had me in the first half ngl though.", "score": 1, "replies": [{"body": "How do you do, fellow retail investor *\\*in Steve Buscemi's voice\\** 😂\n\nEdit: Adding Steve", "score": 4, "replies": []}, {"body": "Schwab? Why?", "score": 1, "replies": []}]}, {"body": "Telecom is always going to be fighting with one hand tied behind it back as they compete with cable companies that can provide similar services without a lot of the legacy laws and regulations that keep them from doing better.", "score": 2, "replies": []}, {"body": "Oh yes.  Yes any company so universally loathed by the unwavering majority of its consumers will die as soon as a Fiesable alternative comes around.", "score": -1, "replies": []}]}
{"title": "New 8-K - on Jan 20, Tesla entered into a $5B revolving credit facility agreement with Citi, Deutsche and others, which Tesla may draw upon from time to time.", "selftext": "", "id": "10lbkld", "created_utc": 1674685283.0, "score": 48, "upvote_ratio": 0.95, "num_comments": 14, "comments": [{"body": "But why do you need a loan when you have so much cash?", "score": 5, "replies": [{"body": "I am a financial simpleton, but I expect the reason to be reasonably similar to why I have a wad of cash in the bank for emergencies and still buy shit with my Visa.\n\nDifferent money, different use cases", "score": 19, "replies": [{"body": "Their cash literally equals about the same in liabilities.", "score": 1, "replies": []}]}, {"body": "Easier to get credit when things are going well vs then when things aren't...", "score": 8, "replies": [{"body": "Yep. Bank will only loan you money if you can prove that you don't need it.\n\n\nthis is a revolving credit line. Tesla doesn't have to draw down on it. It is there just in case they need some major capex project", "score": 9, "replies": []}]}, {"body": "Revolving credit agreements don't need to be drawn against. It's like a 5b dollar credit card with a lower rate", "score": 6, "replies": []}, {"body": "Among many reasons, it allows you to \"positively influence\" those banks.", "score": 3, "replies": []}, {"body": "Masterplan part 3 is all about scaling to massive size... \n\n:)", "score": 2, "replies": []}, {"body": "Balance sheet $22B in cash, Accounts payable $15.2B, Accrued liabilities $7B. Cash wiped out.", "score": -5, "replies": [{"body": "There is also account receivable, car inventory, parts inventory, materials inventory.", "score": 2, "replies": []}, {"body": "Exactly not a lot of cash in hand.  Why not have a credit card for a rainy day IMO.", "score": 1, "replies": []}]}, {"body": "Rich people or company always invest with other people money. Far cheaper to support a loan on interest than to bleed down your cash. You have more opportunities and options.", "score": 1, "replies": []}]}, {"body": "Are they going to use this for stock buyback?  Assuming the irr or whatever is greater than the interest rate on the credit.", "score": 1, "replies": [{"body": "Insurance.", "score": 1, "replies": []}]}]}
{"title": "Long Volatility Options Trade for TSLA Earnings: Straddle vs Iron Condor", "selftext": "*tldr: TSLA is a volatile stock around earnings, I study past earnings moves numbers and calibrate a non-directional position looking at break-evens and projected P&Ls.*  \n\n&#x200B;\n\nThis week I looked at TSLA as a possible play for their earnings releasing Wednesday after close. My usual approach is to start by comparing the stock move on past earnings versus current expected move then look at some positions.\n\n# Past Earnings Moves\n\nA good first step is to start by looking at past earnings moves for the stock.\n\nLet's start with the main numbers:\n\n>***Average post move***: **+/-7%**  \n>  \n>***Std deviation***: **4%**\n\nStandard deviation is a measure of the dispersion of a set of values.\n\nA quick approximation is that most values are as low as average minus this, and as high as average plus this.\n\n**⇒ TSLA moves between +/-3% and +/-11% on its earnings.**\n\nWe can refine these numbers by looking at the breakdown of these past moves:\n\nhttps://preview.redd.it/kiqi2bcvr3ea1.png?width=2044&format=png&auto=webp&s=5d043f427030a5c201a4d068e8e55799cf401936\n\n&#x200B;\n\nEvery line is a past earnings of TSLA showing data about that release date. We see the average and standard deviation calculated on those date.\n\n>**⇒ We can assess that 7% average and 4% std dev stayed grew over the last two years from around \\~5%**\n\nFor every date we have the pre-release / day-of-release / post-release actual moves, this time not absolute. Pre / Post moves are highest recorded move leading to / after the release by one day.\n\nHighlighted rows are dates where the move on day of release exceeded the past average value.\n\n>**⇒ We see since 2018, the lowest move recorded was +15.1% on 2021-10-19.**\n\nWe can assess if these dates correspond to perhaps other events that pushed those moves as outliers or whether the stock is more unpredictable on when its spikes on earnings.\n\nA good way of investigating this is looking at histograms charts:\n\nhttps://preview.redd.it/r6ymza86s3ea1.png?width=1034&format=png&auto=webp&s=793e5ba8cab592a6f1e219d4cf8658e5291d1dd8\n\nThis a distribution of the past moves we were looking at. The x axis is the value of the move and the y axis is how many it occurred, *so spikes correspond to the highest occurrences*.\n\n>**⇒ Most historic moves are concentrated between -10 and +10, with however many occurrences of peaks at +15% and drops at -16%, and overall a very volatile stock on earnings**\n\nGiven these informations, we can start looking at possible plays for betting on the stock moving higher than the past average of +/-7% as this is a volatile stock on earnings - if we can find a suitable trade in terms of break-even.\n\nOne thing to always keep in mind is the IV crush: implied volatility rises in the days leading to the earnings release which makes holding options positions through earnings risky where I.V drops significantly right after the release, inflicting a high loss on long options positions if the stock price does not exceed the implied move.\n\nStock price at the time of this write-up is 143.1$, near close Tuesday , so closest strikes is the143$ for the closest expiration of 01-27.\n\n# TSLA 01-27 143p 143c\n\n[***link to position***](https://app.earnings-watcher.com/#/positions?symbol=TSLA&pos=TSLA.147.0.c.01-27;;s;;)\n\nWe see the straddle is showing a small delta of 0.08 and a gamma of 0.15: this position is non-directional, meaning it gets affected in the same way wether the stock moves up or down. Gamma shows us how *fast* that reaction is.\n\nLooking at IV, the call IV is 108% vs 110% for the put. **These values of IV are not informative on their own: they need to be compared to historic IV around earnings, and more importantly, we need to know how they will impact any position when IV drops after earnings. This translates into thee break-even of the position and its p&l for different scenarios of stock moves, and that's what we will be looking into**\n\nThis is the position break-even, calculated for exactly Thursday, taking into account the drop of IV for this position from 110% to 80%:\n\nhttps://preview.redd.it/xpcyi6glu3ea1.png?width=734&format=png&auto=webp&s=504b1ba28536429e1a4ed5a67e4eb0a9fae562d0\n\n>**Break-even**: **-9% +7.8%**\n\nThis is a bit higher than the average historic move of +/-7% and skewed to the downward side given the strikes and IV.\n\n**Worst case scenario of no stock move will yield a -50% loss:**\n\nhttps://preview.redd.it/rvap36lou3ea1.png?width=3100&format=png&auto=webp&s=326d976a1662afe55abc5097149c9adbe18abd7e\n\n# We can better estimate maximum profit and loss\n\nLet's look at P&Ls for minimum and maximum historic moves from the analysis earlier.\n\n>**Minimum move of +/-0% => P&L: -50%**  \n>  \n>**Minimum move of +/-3% => P&L: -38%**  \n>  \n>**Maximum move of +/-11% => P&L: +50%**  \n>  \n>**Moonshot move of +/-15% => P&L: +70%**\n\n*This can be used to calibrate stop-loss and take-profit thresholds with some margin:*\n\n**Aggressive** (willing to hold for maximum move even through no move at the beginning)\n\nTake-profit: +50% | Stop-Loss: -50%\n\n**Mild** (happy with just an average past move, and cutting it if the move is a bit over the minimum)\n\nTake-profit: 30% | Stop-Loss: -30%\n\n**A good practice is to not activate the stop less in the first hour to give the market time to react, then we either exit at stop loss or take profit,** we are ready for the potential loss so might as well give ourselves more room since most of the loss will occur at open.\n\nLet's see if we can lower the potential loss of 50% and perhaps our break-even too by selling some out-of-money legs.\n\n# TSLA 01-27 long143p 143c short 148c 138p\n\n[***link to position***](https://app.earnings-watcher.com/#/positions?symbol=TSLA&pos=TSLA.143.0.c.01-27;;TSLA.143.0.p.01-27sTSLA.148.0.c.01-27;;TSLA.138.0.p.01-27)\n\nhttps://preview.redd.it/p2mu5sxex3ea1.png?width=3104&format=png&auto=webp&s=da83fcab8a22f19bc06c64bf581deca577f22edb\n\nBreak-even is now lower at -7.2% +6% which is lower than the average historic of +/-7%, and we lowered our potential loss to -15%, but on the other hands we also reduced our potential gains:\n\n>**Minimum move of +/-0% => P&L: -15%**  \n>  \n>**Minimum move of +/-3% => P&L: -10%**  \n>  \n>**Maximum move of +/-11% => P&L: +10%**  \n>  \n>**Moonshot move of +/-15% => P&L: +15%**\n\nHope this is helpful, lemme know if you have any questions!\n\n&#x200B;\n\nData from [*EarningsWatcher*](https://earnings-watcher.com)", "id": "10kor50", "created_utc": 1674616981.0, "score": 55, "upvote_ratio": 0.92, "num_comments": 11, "comments": [{"body": "Well good DD bt I m selling strangles 95 put and 195 call expiring 17th Feb . I will manage it as much I have to. I think my short strangle is looking safe bet", "score": 6, "replies": [{"body": "TSLA strangles have been printing for me . The continued drop got a little scary but was great for the call side and turns out even if put side was more aggressive Idv been assigned shares at the bottom which is really ideal situation for CSP if you have the funds. My prob is it's too large a position compared to my account size so I get nervous", "score": 7, "replies": []}, {"body": "You have a +/-21% breakeven, i think you're definitely safe, we can even both make money!", "score": 5, "replies": []}]}, {"body": "I would rather try a calendar IC...like -1 150C & -1 130P for Jan27 and +1 140C & +1 140P for Feb3", "score": 2, "replies": []}, {"body": "$TSLA is just an amazing stock, it defies gravity.  Its my biggest holding and I realize its a big risk,  I cannot resist selling options on $TSLA as they pay more than my job.", "score": 2, "replies": []}, {"body": "So you're risking 50% of a $4.20 debit to make %10-15 of profit, and Tesla needs to move well outside of the market's priced Standard Dev? You're betting that HV will increase above IV. \n\nI would rather be on the opposite side of this trade...", "score": 1, "replies": [{"body": "Not at all well outside the standard deviation if you look at the numbers, the breakeven is even below the past average. And historically that happened more than 50% of the time. Sure it's a gamble but not far fetched", "score": 1, "replies": []}]}, {"body": "If I understand the implications of the histogram to the two strats given their breakeven points, it looks like the straddle has about a 15% chance of breakeven results or better, and the condor's odds are 50-50.  OP, does that sound like a fair characterization?", "score": 1, "replies": [{"body": "I guess you're empirically counting the ticks, which would make sense and your numbers are fair!", "score": 2, "replies": []}]}, {"body": "What is the name of the last position you posted?", "score": 1, "replies": [{"body": "Inverse condor!", "score": 1, "replies": []}]}]}
{"title": "Sold some credit spreads on IBM", "selftext": "", "id": "10ladi8", "created_utc": 1674682367.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 14, "comments": [{"body": "I have no idea what you trade is. You shorted some calls?? Naked? Bull put?", "score": 3, "replies": [{"body": "He sold the $146 and bought the $147, the $147 is his long leg that covers him in the scenario that the stock goes above $146. If the stock doesn’t be pockets the difference between the credit of the closer to the money call vs the ones he bought further away, therefore a call credit spread (essentially it’s a put but theta is your friend)", "score": 5, "replies": []}, {"body": "Yes I have a call credit spread basically a short saying the stock won’t go above 146", "score": 2, "replies": [{"body": "So max profit price point is where on expiry?", "score": 1, "replies": [{"body": "Yeah, but most will never (YOU SHOULD NEVER) let it get there or get to expiration.  They look for 70-90%.   If it creeps in between the two is where max pain can be because you will be assigned “short” and then end up buying on margin, and it’s whole thing.   \n\nIf I were to guess, he’ll hit 85% soon with the drop and IV crush (earning over, volatility lowers the price action) and clean up well.  This is more of a gamble because of the fact that he’s playing earnings.", "score": 1, "replies": []}]}]}]}, {"body": "Earnings season is here. After watching what happened with MSFT earnings I decided to look at IBM as it has a history of staying flat after earnings. It had a good IVR at around 50% so I decided to make a trade on it. I picked this trade because I can roll out the expiration date if IBM did have a crazy earnings but history shows it isn’t a big mover on earnings. I will look to close this trade soon and collect around 50% of the premium.", "score": 2, "replies": [{"body": "Nice job picking direction, Martin.", "score": 0, "replies": []}]}, {"body": "So I sold 2 vertical spreads at $25 each. So the max loss for this trade is $150 max gain is $50 because I have 2 of them. I’ve already collected $18 in profit on this trade. I can close it tomorrow or wait untill expiration. Closing it at a 50-70% gain frees up my capital so I can place another trade.", "score": 1, "replies": []}, {"body": "Why does it look as if you have gotten around .15 for these?", "score": 1, "replies": []}, {"body": "Nice gain", "score": 1, "replies": [{"body": "Ty I’m just letting people see different trade ideas.", "score": 2, "replies": [{"body": "Logic is actually really good. Tech as a sector is taking a beating anyway. Similar company(MSFT) posted bad results. Someone did the same thing with Walmart and Target, played one based on the other ones earnings last quarter. Your principle amount might be low, but little plays like this add up and don't blow up. Did something similar with lrcx, tech is down, AMAT posted bad results bad last quarter, so I expected them to go down as well. Nice small gain.", "score": 3, "replies": [{"body": "Thank you this is on my small challenge account so I can’t take big size", "score": 1, "replies": []}]}]}]}, {"body": "Good trade.\nI traded $1 wides for a year and a half and the long term results did not end up in my favor. Taking some directional $1 wides is no biggie but if this is your primary spread width of choice I would be cautious about it.", "score": 1, "replies": []}]}
{"title": "Tesla Regard DD (shitpost)", "selftext": " Alright folks, gather 'round for some shitpost that's sure to knock your socks off (and maybe even your portfolio). It seems ol' Elon might have bitten off more than he can chew with this class-action lawsuit. If he loses, he's looking at paying out billions to investors. So, what's a billionaire to do? Dump more Tesla shares, of course! That's right, folks. If this lawsuit goes south, we're looking at a major drop in the stock price. But don't just take my word for it, do your own research (and maybe invest in a good pair of knee pads for the fall). And if you're feeling daring, you know what to consider.\n\nPaper position : qty:20 2023/3/3 100$ tesla puts at 2.4$\n\nWhy paper? cause can't afford to feed theta gangs anymore.", "id": "10kn3hx", "created_utc": 1674612116.0, "score": 5, "upvote_ratio": 0.57, "num_comments": 14, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|1 year ago\n**Total Comments**|7|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "Instead of posting paper positions meet me behind the Wendy’s dumpster and I’ll provide to you an honest living", "score": 21, "replies": [{"body": "People are so nice here 🥰", "score": 1, "replies": []}]}, {"body": "Paper position? Shouldn’t that be an automatic ban? Mods? MODS?!?!", "score": 11, "replies": [{"body": "Agreed. What have we become...", "score": 5, "replies": [{"body": "Sell me dat pfp", "score": 3, "replies": []}]}]}, {"body": "Hah I made my take on the last couple days earnings run up and gonna sit back with a Macallan 25 and watch earnings report show🤑", "score": 3, "replies": []}, {"body": "Lol, doesn't matter what analysis/DD just play the run up to earnings instead of playing the earnings. Theta & IV & volatility eats ur ass, and you can end up like MSFT, F ur puts in the after hours at first. Then F ur calls 2 hours later. I bought a 10 250 calls prior to the earnings booked the 500+ profit and just didn't feel it and exited it. Sure, tiny amount of gains, nothing noteworthy but I didn't get my ass fk'd in the AF's.", "score": 2, "replies": []}, {"body": ">This is definitely something to keep an eye on. If Elon Musk loses the lawsuit, Tesla's stock price will almost certainly take a hit. However, it's important to do your own research and not just blindly follow my advice. I'm just here to provide information, not make investment decisions for people.", "score": 2, "replies": [{"body": "Ban this dude", "score": 2, "replies": [{"body": "What did he say?", "score": 1, "replies": []}]}]}, {"body": "We can all become one happy bearish family, sorry Elon it is us taking off to mars this time 🫡", "score": 0, "replies": []}, {"body": "I think he will need to dump more shares for to pay off and finance Twitter, where even lawsuit.", "score": 1, "replies": []}]}
{"title": "Microsoft earnings pumped the markets then brought down the entire market after they provided weak guidance for the future", "selftext": "", "id": "10krput", "created_utc": 1674626662.0, "score": 186, "upvote_ratio": 0.93, "num_comments": 17, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|7 years ago\n**Total Comments**|26|**Previous Best DD**|\n**Account Age**|9 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "It was literally just like that Futurama episode where the share price started moving up and down while  making his speech to the Mom's company shareholders.", "score": 35, "replies": [{"body": "My only regret is that I have bone-itis", "score": 5, "replies": []}]}, {"body": "Me not doing options trading and right now holding some safer stock options :)", "score": 7, "replies": []}, {"body": "So down just 1% AH? How is this even news?", "score": 16, "replies": []}, {"body": "Considering the potential downside of a massive miss in the face of a QT program that went faster than any before in history, this was welcome news. \n\nJust to be clear, MSFT has seen their net grow 111% from Q2 2019 while their share price has increased 40%. \n\nBest to ignore 2020-2021 in your fundamental analysis, no useful comps can be generated with the money printer at 11.", "score": 3, "replies": [{"body": "[https://www.nasdaq.com/market-activity/stocks/msft](https://www.nasdaq.com/market-activity/stocks/msft)\n\n10 year graph says a lot.", "score": 1, "replies": []}]}, {"body": "this aged poorly.", "score": 3, "replies": []}, {"body": "Hopefully Tesla shats the bed", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)", "score": 2, "replies": []}, {"body": " Are the pictures in the wrong sequence?", "score": 4, "replies": []}, {"body": "Down 6.55 lol wow such a epic drop. This isn't wsb fodder at all.", "score": 2, "replies": []}, {"body": "What happened? It was up like $10 then went down", "score": -1, "replies": []}, {"body": "and here we are in this scam fest of a market where everything came back to “normal” ![img](emote|t5_2th52|4641)", "score": 1, "replies": []}, {"body": "\"Brought Down entire market\" *looks*  tech stocks up even though Nasdaq is only 0.02 percent down.  Good try though", "score": 1, "replies": []}]}
{"title": "Seems Microsoft is already cutting cost in server maintenance 🤡 millions of users hit by outage", "selftext": "&#x200B;\n\nhttps://preview.redd.it/tby7h2f8r5ea1.png?width=678&format=png&auto=webp&s=bdcd3eaa75cae5d0fa25b95558e04bb1e560e7ec\n\nPerfect follow up for the stock meltdown yesterday after the initial pump... now also the services are melting down.\n\n[https://www.dailymail.co.uk/sciencetech/article-11674211/Microsoft-Outlook-Teams-crashes-Email-millions-world-goes-down.html](https://www.dailymail.co.uk/sciencetech/article-11674211/Microsoft-Outlook-Teams-crashes-Email-millions-world-goes-down.html)", "id": "10kuqwk", "created_utc": 1674638792.0, "score": 29, "upvote_ratio": 0.75, "num_comments": 17, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|2 years ago\n**Total Comments**|29|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 30, "replies": [{"body": "Maybe they shouldn’t have fired the server admins 🤡", "score": 17, "replies": []}]}, {"body": "This is what happened when microsoft employee blindly follow chatgpt for server maintenance tips", "score": 32, "replies": [{"body": "sudo rm -rf / --no-preserve-root", "score": 4, "replies": [{"body": "&& kill -9 [kernel PID]", "score": 1, "replies": []}]}]}, {"body": ">I'm not surprised. Poorly designed systems always crumble under pressure. It's just a matter of time until everything falls apart completely.", "score": 11, "replies": [{"body": "Seems bullish", "score": 4, "replies": []}]}, {"body": "So many outages it's almost as if Klaus Schwab said this in the WEF and now it's rolling out.", "score": 5, "replies": []}, {"body": "My shorts like the sound of that news 😹 (yes I know stocks, but we can’t get proper options in the UK😿)", "score": 5, "replies": [{"body": "IBKR ?", "score": 1, "replies": []}]}, {"body": "thank go i dont ha e to work", "score": 2, "replies": []}, {"body": "Probably you just should short the entire IT. Massive letoffs, outages, hacking and phising strikes. Seems a like a rough time for a lot. Though some don't seem to be hit as bad.", "score": 2, "replies": []}, {"body": "I can't send memes to my coworkers because of Microsoft 🙁", "score": 2, "replies": []}, {"body": "Bet the stock rockets", "score": 1, "replies": []}, {"body": "Germany has confirmed it was a cyber attack and have authorities investigating. Unlikely this has anything to do with server maintenance at all, also they only announced cuts this week which makes it hard to believes the changes have been implemented widely enough to spark service disruptions this early.", "score": 1, "replies": []}, {"body": "Can’t help but wonder if Russian hackers are striking out at any target they can get after. The FAA had planes grounded a week ago, trading halts on Tuesday and now the Microsoft tomfoolery. It’s one of the few ways they can lash out at the west. Makes you wonder.", "score": 1, "replies": []}, {"body": "Someone pulled the server power cord on the way out after being laid off.", "score": 1, "replies": []}]}
{"title": "<CALL or PUT> $QQQ Bear Pin Pre-Market $TSLA Earnings A.M.C.", "selftext": "From $AAPL, $AMZN, $PYPL to their major index $QQQ, have bear pin. $TSLA pre market opening making higher-lows but moving average seems to be making bear signals. What are your though for today's market?\n\nhttps://preview.redd.it/kivvjyj2y6ea1.png?width=2560&format=png&auto=webp&s=477685774afdcb186ca6a960f1ac8f7d269a5cf0", "id": "10kynbg", "created_utc": 1674653390.0, "score": 6, "upvote_ratio": 0.69, "num_comments": 12, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|2 months ago\n**Total Comments**|21|**Previous Best DD**|\n**Account Age**|3 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": ">The market looks bearish today, with many major indexes and stocks making lower lows. I am particularly bearish on $TSLA, as the moving averages seem to be signaling a downward trend.", "score": 7, "replies": []}, {"body": "You know the typically MM; market maker makes you think today gonna be bearish, when you short or buy a put, the market immediately bounces back up the valley. Bear trap!", "score": 5, "replies": [{"body": "It really happened, first 45 mins into the market, bear mood, got trapped and the bulls came in to control. \n\nFucked it with a hedge with calls later lunch ard time to protect my overall short positions.", "score": 2, "replies": []}]}, {"body": "Curious, is there any system to show who are the buyers? The bear pin seems to be manipulated making a signal.", "score": 1, "replies": []}, {"body": "looks really heavy for today", "score": 1, "replies": []}, {"body": "SARK SARK SARK SQQQ SQQQ SQQQ", "score": 1, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "TSLA ERs is what everyone is waiting for", "score": 1, "replies": []}, {"body": "I bought some 125 puts on TSLA. Pretty bearish on it.", "score": 1, "replies": [{"body": "RIP", "score": 1, "replies": [{"body": "I know![gif](emote|free_emotes_pack|facepalm). Live to fight another day.", "score": 1, "replies": []}]}]}]}
{"title": "$CRM hires Matthew McConaughey and Will.i. am", "selftext": "", "id": "10l61h9", "created_utc": 1674672068.0, "score": 25, "upvote_ratio": 0.86, "num_comments": 12, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|20 minutes ago\n**Total Comments**|4|**Previous Best DD**|\n**Account Age**|7 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "I remember reading about a study that found people who obsess over celebrities have lower IQs", "score": 16, "replies": []}, {"body": "I believe that Benioff is becoming distracted by celebrities and this could negatively impact the company. I think it would be better if he focused on business strategy and left the celebrity interactions to others.\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 5, "replies": []}, {"body": "Children running a Marketing Company at CRM", "score": 4, "replies": []}, {"body": "Huh? Can’t they find someone more ahhh qualified?  Actor, musician?  What happens in C suites should scare the shit out of every investor.", "score": 4, "replies": []}, {"body": "Will.I.am and Britney Bitch.  Great song and more recent than 2009.  All the same why isn’t Britney invited.  She’s just as qualified.  Lol", "score": 4, "replies": []}, {"body": "CRM puts, gotcha", "score": 2, "replies": []}, {"body": "I work for Salesforce. This is not a comforting read 🤦🏻‍♂️", "score": 2, "replies": []}, {"body": "Two celebrities who no one cares about at all. When is the last time this guy got a hit song 2009?", "score": 2, "replies": [{"body": "That literally has no bearing on whether he is qualified or not to be involved in high level executive discussions. Which he likely isn’t.", "score": 6, "replies": []}]}, {"body": "will.I.am was also Intel’s Director of Creative Innovation. He has apparently helped design smart watches and owns a machine learning company working on a camera enhancer. \n\nThey also acquired the Wink app which is like a hub for smart home devices. \n\nI really can’t tell if it’s all celebrity fluff bullshit or if he actually is knowledgeable in tech to this degree", "score": 1, "replies": []}]}
{"title": "General Dynamics has now the opportunity to permanently displace German competition in the European main battle tank market -> Long", "selftext": "* GD is a fundamentally well-positioned defense contractor with a strong order book, an attractive dividend yield (consistently increased its dividend for 28 years, safe payout ratio of around 41%), and steady share repurchases (reduced the total number of shares outstanding by approximately 22% from 2012 to 2022).\n* Germany has just announced that it will allow the supply of Leopard 2 to Ukraine (and that Leopards of the German Armed Forces will be delivered to Ukraine).\n* The German defense industry is far from being able to replace the tanks supplied to Ukraine. The production capacity of the Leopard 2 manufacturer Krauss-Maffei Wegmann was already [stretched](https://www.welt.de/wirtschaft/plus238759401/Leopard-Panzer-So-gross-ist-der-deutsche-Ruestungs-Rueckstand.html) last summer.\n* Even if the German government were to use the €100 billion that Mr. Scholz announced at the end of February 2022 for his \"Zeitenwende\" to increase production capacity for German tanks (which would probably be too late now), German defense industry faces a severe  [shortage](https://www.handelsblatt.com/karriere/ruestungsindustrie-von-400-kandidaten-beisst-einer-an-wen-deutschlands-waffenhersteller-gerade-dringend-suchen/28497644.html) of skilled workers.\n* GD now has a unique opportunity to sell M1A2 Abrams tanks in Europe. Poland (which has 247 Leopard 2 tanks and wants to send some of them to Ukraine) has already ordered 250 M1A2 SEPv3 Abrams tanks in Q3 2022 and just 116 more Abrams M1A1s. [Some 2000 Leopard 2s are in service with the armed forces of 15 European countries](https://www.theguardian.com/world/2023/jan/20/leopard-2-german-tanks-what-are-they-why-does-ukraine-want-them) and defense spending in the EU even [grow by 6%](https://eda.europa.eu/news-and-events/news/2022/12/08/european-defence-spending-surpasses-200-billion-for-first-time-driven-by-record-defence-investments-in-2021) before Russia's war of aggression started.\n* Choosing a tank model is a commitment for decades. No army can switch from one model to another overnight. Different tank models require special infrastructure, tank crews need to be trained for a particular model, and a tank model with its special features needs to be integrated into an army. This means that if GD is in, it will stay in.\n* Selling a tank model generates steady revenue. In the third quarter of 2022, for example, GD earned $125 million in \"systems and sustainment technical support services\" and $40 million in spare parts for the U.S. Army's Abrams tanks.\n* Selling more tanks results in more cost-effective production and therefore a higher margin. GD has already a higher profit margin (8.62%) than the sector median (6.74%). McKinsey analysts estimate that doubling the production of a main battle tank can reduce labor costs by [20% and material costs by 10%](https://www.mckinsey.com/~/media/mckinsey/industries/public%20and%20social%20sector/our%20insights/enlisting%20productivity%20to%20reinforce%20european%20defense/the%20future%20of%20european%20defence.pdf). GD has now the opportunity to become by far the most competitive main battle tank manufacturer. In the long term, the M1A2 could become NATO's standard main battle tank.\n* So I am long in GD.\n\n**This is not financial advice.**", "id": "10l6zzl", "created_utc": 1674674288.0, "score": 4, "upvote_ratio": 0.6, "num_comments": 15, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|3 months ago\n**Total Comments**|9|**Previous Best DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/xyz1pg/why_not_att/) [x](https://www.reddit.com/r/wallstreetbets/comments/10l6zzl/general_dynamics_has_now_the_opportunity_to/) \n**Account Age**|3 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "Unless they let them manufacture parts in EU. They won't, this dd takes the cake for today.", "score": 9, "replies": []}, {"body": "Used to work for general dynamics.  Those mfers make MONEY for sure.  They expanded one of their manufacturing facilities when i was there a few years ago.  All of the work we did was engineered to be flawless.  I'd never bet against them, that's for sure.", "score": 3, "replies": []}, {"body": ">I am long in GD.", "score": 2, "replies": []}, {"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "The fact that the Abrams is not produced in Europe did not prevent Poland from ordering 367 of them. The increased fuel requirement is not really an argument, buying an Abrams is much cheaper and costs about USD 6 million, a Leopard 2 costs at least USD 8.8 million. The German defense industry cannot simply increase its production capacity overnight, this is not a video game. I don't know what image you have of Germany. The construction of a single railway station causes there half a national crisis and takes a quarter of a century (Stuttgart 21).", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "If you think Poland is just a \"minor influence\", you don't understand how the European Union works at all...\n\nThe joint venture between Germany and France to develop a main battle tank (MGCS) is making no progress at all. The other countries mentioned have so far been using German tanks, for which there is hardly any production capacity…\n\nI wish there was no reason to be \"insulting\". I am German, Germany is (still) rich, but on its way to become a banana republic - probably just decadence. Believe me, it is impossible to increase production capacity for anything here in the short term.", "score": 1, "replies": []}]}]}]}, {"body": "BAE manufacturers some tank equipment for Europe", "score": 1, "replies": []}, {"body": "How about all of the Korean merchandise flooding the market as well? And the Germans can’t offset 15 tanks? Seems a little sunny to me.", "score": 1, "replies": [{"body": "Ordering weapons makes a country dependent on the supplier to a certain extent. The US, as a guarantor of stability and a superpower, is therefore a more attractive partner than South Korea. The current goal is to deliver 90 main battle tanks to Ukraine. EU countries have a total of 2,000 Leopard tanks. I expect this to be just the beginning; Ukraine needs more tanks to regain its territory.", "score": 2, "replies": [{"body": "So, as an example, Poland will likely send twice as many Leopard 2s to Ukraine as the Germans have committed at this point. They aren’t backfilling them with more Leopard 2s, or Abrams, they placed an order for close to 1,000 K2s from Korea, with 180 on the way already and another 800 planned to be built inside Poland by 2026. That’s right, the Koreans are setting up local manufacturing of competitive equipment. Also, the Korean made K9 self propelled gun is already selling all over Europe in the hundreds if not thousands of vehicle. Korea’s approach of basically transferring the technology to the purchaser by establishing local production also makes them arguably more competitive as they DON’T make you reliant on them for security, but rather give you the keys to the castle. So why would a prohibitively controlled agreement with GD be a more competitive choice than the Koreans again?", "score": 1, "replies": [{"body": "True just hope Korea knows they don’t really have to partake in the war.. The country is way small and economy can’t really even support a war at this time.", "score": 1, "replies": []}]}]}]}, {"body": "What are your option plays for next quarter ER?", "score": 1, "replies": []}, {"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}
{"title": "ChatGPT for Video - Genius Sports $GENI", "selftext": "$MSFT just invested $10B in the private company OpenAI, the owner of Chat GPT, valuing the overall business at over $29B! There is a public company called Genius Sports (GENI) who owns the video version of Chat GPT through their Second Spectrum acquisition. They currently create new and actionable data from live sports broadcasting. The data has use in their sports betting business as well as enabling teams to use the data to create insight for better team performance. Their technology can be used across all video to create actionable insight beyond just sports. They are the Chat GPT of video! Stock currently has $1B valuation that is based solely on the growth of data they provide to sports betting companies to run their business. OpenAI is expected to do $200M in total revenue for 2023, Second Spectrum will do $25M in revenue. Why isn't Second Spectrum worth $3.6B based on Chat GPT's recent valuation for the video version of Chat GPT? Would add about $16 per share to the current $4.80 share price of $GENI. (Am long 400k shares)\n\n&#x200B;\n\nhttps://preview.redd.it/wgk6gqjn49ea1.png?width=2574&format=png&auto=webp&s=ca8ceb398645dfaabcb693dfca9731f16e413e61", "id": "10l98dk", "created_utc": 1674679600.0, "score": 8, "upvote_ratio": 0.7, "num_comments": 13, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|5 hours ago\n**Total Comments**|2|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)\n\nHey /u/jerricho8, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": ">This is an interesting question. I did some research and it seems that the current valuation of Second Spectrum is based on their growth potential in the sports betting industry. However, I believe that their technology has much broader applications beyond just sports betting, which could lead to a higher valuation for the company.", "score": 3, "replies": []}, {"body": "it looks like they have the one thing that matters for machine learning models: labeled data. anyone can get a model and play with it. all of that is open source -- even OpenAI's gpt-2 is available and if you search hard enough you can find 3 which is all the rage right now. the thing that separates them from everyone else is trained data. if GENI's Second Spectrum has labeled data then they can sell it to all comers in sports, media, video games, etc.", "score": 3, "replies": []}, {"body": "They are using ai tools that other people made. Your logic is flawed", "score": 1, "replies": [{"body": "Everyone uses AI tools made by other people. They are all open source. You can go to hugging bear and download any model you want.", "score": 1, "replies": [{"body": "openai is making the tools, there is a difference", "score": 1, "replies": [{"body": "Machine learning is less about the models/tools and much more about the quality of training data. You can have the greatest model of all time if you train it on shit it’s gonna be shit. This company owns the data labels, much more lucrative than the model, which is built upon PyTorch (open AI didn’t invent lol).", "score": 3, "replies": []}, {"body": "the industry is very open and rooted in math, statistics and computer science. the tools you see from Open AI are phenomenal but they are all built on top of basic research and then trained on real world data sets . . .  mostly manually labeled. those models are not proprietary. but again that is not the point. $GENI has labeled data. Open AI would need that labeled data to run any tool they built in the sector.", "score": 1, "replies": []}]}, {"body": "Hugging bear, lmao", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "[https://news.geniussports.com/genius-sports-acquires-second-spectrum-the-official-data-tracking-and-analytics-provider-of-the-epl-nba-and-mls/](https://news.geniussports.com/genius-sports-acquires-second-spectrum-the-official-data-tracking-and-analytics-provider-of-the-epl-nba-and-mls/)\n\nhere's the link to the acquisition announcement.", "score": 2, "replies": []}]}]}
{"title": "S&P 500 back above 4,000", "selftext": "The recession isn’t canceled, but the stock market doesn’t care. \n\nBull gang about to have a good year. \n\nOnce this hits 4,100 we will start to see some major inflows from bonds and cash. \n\nAnd then the higher it goes from there we will see FOMO kick in and could be at 5,000 by end of year. \n\nWhen the news says sell you buy.", "id": "10l9oj2", "created_utc": 1674680691.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 17, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|8 months ago\n**Total Comments**|180|**Previous Best DD**|\n**Account Age**|6 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "Holding 25 x 402 calls expiring tomorrow.  Hope we hit 408 because I really need to pay off that cc debt", "score": 8, "replies": []}, {"body": "![img](emote|t5_2th52|4267)", "score": 2, "replies": []}, {"body": "Whiplash year. Last year definitely was a recession. Every recession is followed by a plateau, a long plateau.. this is either the echo bubble and the recession isn’t done yet or it’s the beginning of the flat line", "score": 1, "replies": [{"body": "You can’t have recessions if unemployment is at 3.5. Lolz 😂", "score": 1, "replies": [{"body": "Oh you can’t? What was the markets loss % for the entire year of 22? Checkmate, get lost. Anyone looki by at the market behavior for AN ENTIRE YEAR, can recognize that that was a recession and may even continue to be one. I can’t predict the future but I can certainly read a graph that shows the entire market lost 20% of the entire year.", "score": -1, "replies": [{"body": "You need to educate yourself if you think 20% market correction means recession. \nNot interested in arguing with someone who has no clue what is a definition of a recession.", "score": 0, "replies": [{"body": "20% over the course of an entire year of downtrend. Let me repeat, an entire year of downtrend. An entire year of downtrend is a recession. How is an entire year of losses not a downtrend and a recession please tell me. Please educate me. Show me a point in the market where an entire year of significant losses does not mean a recession happened. Let me guess 410 spy calls?", "score": 2, "replies": [{"body": "Whatever happen in 2022 was valuation reset since fed fund rates went up from 0.25 - 4.25. All the major selling in 2022 took place because of valuations reset and not actual recession.", "score": 0, "replies": [{"body": "You are actually delusional if you think an entire year of downtrend is not a recession. I could totally see this argument over the course of like 6 months maybe? 12 months, down, recession. It happened", "score": -1, "replies": [{"body": "Alright… you won.. here is your internet trophy 🏆. Good luck with your trading .", "score": 2, "replies": [{"body": "You too. Like we can argue about the future and I have 0 evidence but the past is right there for you to look at. It’s a giant downslope for 12 months", "score": 1, "replies": [{"body": "You say the same shit over and over. You sound like a dumbass", "score": 1, "replies": []}]}]}, {"body": "How can a recession happen if nothing but the stock market corrected? You not see what’s going on? Look at SPY 1D and 1H", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": ">You're obviously not as rich or intelligent as I am if you think the recession is still happening. The stock market is doing great and anyone who knows anything about investing knows that now is a good time to buy. Bonds and cash are already flowing into the market and we could see even more FOMO buying later this year which could push prices even higher.", "score": 0, "replies": []}, {"body": "Very tru", "score": 1, "replies": []}]}
{"title": "Tesla Earnings Call Notes", "selftext": " earnings call key notes   \n\\----------------------------------------------------------------   \nAutomotive operating margins above 20% after price cuts above 47k average product price \n\n2x demand vs production \n\nQuestion: are you concerned about brand damage from your political stances? elon: i still have plenty of twitter followers and growing. I'm quite popular  \n\nCyber truck production Mid Summer Volume production 2024\n\n 2 million cars is potential if no supply chain restraints \n\nnew exciting products in line won't announce yet \n\nFSD Take rate trend very strong \n\nQuestion: who do you see as your main competitor in the next 5 years? Elon musk: I can't see one with a telescope", "id": "10lddyo", "created_utc": 1674689858.0, "score": 16, "upvote_ratio": 0.79, "num_comments": 19, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|10 months ago\n**Total Comments**|413|**Previous Best DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/yx0gth/lets_talk_about_what_we_might_see_for_nvdia/) [x](https://www.reddit.com/r/wallstreetbets/comments/wc02h2/the_basics_of_dollar_and_interest_rates/) [x](https://www.reddit.com/r/wallstreetbets/comments/10kgulo/msft_earnings_report_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/vas0sp/why_i_simply_dont_ever_want_to_touch_netflix_stock/) \n**Account Age**|10 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "He was asked ab whether he believes we’ll have a recession, or something like that, and he said he thought we would\n\nLater on he said something ab how that wouldn’t hurt tesla bc their input costs would go down, which I thought was a bit silly, since that would clearly be the result of slowing demand …", "score": 6, "replies": [{"body": "not every sector hurts in a recession. Bakers never have recession. You need bread.\n\nWhile cars are not essentials like that, usually luxury products don't suffer, and for most of the word Tesla is a luxury brand. For 47k + taxes, you could buy a flat or even a home where I live.", "score": 1, "replies": [{"body": ">usually luxury products don't suffer, and for most of the word Tesla is a luxury brand. For 47k + taxes, you could buy a flat or even a home where I live.\n\nLook up Mercedes + BMW financials during 2008-09", "score": 1, "replies": [{"body": "Usually=\\= never\n\nFurthermore I might work on partial, wrong or partially wrong data thus having bad understanding.", "score": 1, "replies": []}]}]}]}, {"body": "Love how nobody is really picking up on Elon saying a recession is coming this year. They’re centering their strategy on that idea. Not sure that is very confident guidance but TSLA go big green line ha ha", "score": 7, "replies": [{"body": "Ya I thought that was interesting, checked the AH and nobody seemed to care", "score": 1, "replies": [{"body": "That's what has me thinking about selling my calls to close if it opens up, then keep the puts open for the realization to kick in by Friday.", "score": 3, "replies": [{"body": "That’s a good idea. I’m holding calls at the moment", "score": 2, "replies": []}, {"body": "I’m not sure what’s gonna happen next. For that reason, I closed all my cc today in the morning. Worked well. With the exception of google, I was severely punished by google when I sold a then-atm $95 call expiring mid February. Actually was up nicely but let it run. Then the stock gapped up hard in the AH, burying me.\n\nAlas, selling longer dated options has the inherent benefit of theta decay so we’ll see. \n\nSeems like we’re at a real turning point, for at least the short to medium term. \n\nEither we’re gonna breakout above this resistance or we’re gonna fuck around these levels some more, imo it’s highly doubtful we’ll get anywhere near the lows (in the short to medium term).\n\nStill think we could end up back down there in 5 months. Could be something like a pattern of rough earnings, or a hot inflation print, or a meaningful and concerning rise in unemployment.", "score": 1, "replies": []}]}]}]}, {"body": "All the regards on here bought puts. Always inverse this fucking thread & you’ll be rich ![img](emote|t5_2th52|4275)", "score": 6, "replies": []}, {"body": ">I don't really see any competition for Tesla in the next 5 years. Everyone else is playing catch up, and even then they won't be able to match our technology or production levels.", "score": 0, "replies": [{"body": "that you Elon?", "score": 2, "replies": []}]}, {"body": "I listened to the podcast. Also, tesla is offering insurance now, which will drive prices down even for those who dont insure with them. \nOther notes. Teslas have very advanced AI with dedicated chips, called them robots on wheels, not cars. Autopilot is getting better every day. Even those who dont buy the option will still have access to the safety features, collision avoidance, etc.\nLots of other poeces of info, nothing negative i can remember.\nDisclaimer. I do own TSLA stock, and I've bought more during the call", "score": -1, "replies": []}, {"body": "I think Elon played it right.  Price cut is addressing tax credit, rate hike, recession.  Key of the key is there are no other players that can do the same.  Tesla is truly in a league above all other automotive manufacturers! ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 0, "replies": []}, {"body": "Hey, do you have a source? Please add a link in the post or as a reply to this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": [{"body": "I sat through a long ass earnings call, da fk u want.", "score": 21, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}]}]}
