{"title": "Is anyone else going all in on Tesla at open tomorrow?", "selftext": "Just seems like a great deal for the company.  Get an experienced Chairman and Musk faces no real consequences from the going private scandal.", "id": "9k79u4", "created_utc": 1538321988.0, "score": 28, "upvote_ratio": 0.83, "num_comments": 58, "comments": [{"body": "Bought a way OTM 300 10/5 call 5 mins before close Friday. I'm expecting ITM when I wake up tomorrow. ", "score": 54, "replies": [{"body": "Better buy another freezer for all those tendies ", "score": 41, "replies": [{"body": "If that actually happens i'll finally be back to where I was when I came here 3 months ago.", "score": 16, "replies": [{"body": ">3 months ago\n\nYou were just in time for 7/20 $90 MU Calls", "score": 10, "replies": []}]}, {"body": "Way too soon to celebrate ", "score": 7, "replies": []}]}, {"body": "I’m otm 297.5 10/5 an hour before close. If it’s itm when I wake up, I’m gonna cash it out all in 1’s and go to the titty club ", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Lol i'm back to even.", "score": 4, "replies": []}]}, {"body": "Highly doubtful", "score": 1, "replies": []}, {"body": "I deeply regret not following suite", "score": 1, "replies": []}, {"body": "~~Tendies secured~~\n\nBroke even, still not bad", "score": 1, "replies": []}]}, {"body": "Yes also take out a 200k loan to buy even more shares ", "score": 35, "replies": [{"body": "Gotta make sure that interest is at 600/day too", "score": 8, "replies": []}, {"body": "Is there a reason for 200k only? ", "score": 2, "replies": [{"body": "there was a guy on here called wakka who borrowed 200k to buy tsla in anticipation of a buyout at 420", "score": 11, "replies": [{"body": "Ouch. ", "score": 2, "replies": []}]}]}]}, {"body": "You'll be kinda late by then, might be a decent day trade if you get lucky, or if you plan to hold thru earnings you'll probably see a pop.\n\nWhoever bought in Thurs/Fri is about to be rich as fuck\n\nFags", "score": 24, "replies": [{"body": "After hours it’s unchanged since it was down 13% Friday. I guess the DOJ investigation for fraud is keeping it down.", "score": -17, "replies": [{"body": "Lol are you really this dumb?  There is no after hours on the weekend.  Disclosure Long tsla via call options and stock.", "score": 11, "replies": []}, {"body": "> After hours it’s unchanged since it was down 13% Friday. I guess the DOJ investigation for fraud is keeping it down.\n\nDude, option prices do not change after hours.", "score": 5, "replies": [{"body": "I was looking at the share price.", "score": -3, "replies": [{"body": "No share price AH on the weekend. Lol", "score": 2, "replies": []}]}]}]}]}, {"body": "Yes ", "score": 15, "replies": []}, {"body": "If you’ve had the idea, 1000 other fucks have as well.  Just enjoy the show.  ", "score": 11, "replies": [{"body": "After hours it’s unchanged since it was down 13% Friday. I guess the DOJ investigation for fraud is keeping it down.", "score": -11, "replies": [{"body": "Lol - again genius - after hours has no trading activity until tomorrow morning.  Disc. Long tsla calls and stock.", "score": 7, "replies": [{"body": "NO YOU DONT GET IT. AFTER HOURS IS STILL UNCHANGED.", "score": 9, "replies": [{"body": "This is not false", "score": 1, "replies": []}]}]}]}]}, {"body": "I’m not touching that, it is way to unpredictable.", "score": 21, "replies": [{"body": "Pussies get no gains", "score": 40, "replies": [{"body": "That's because no one likes a bulky robust pus", "score": 5, "replies": []}]}, {"body": "\\>doesn't know the difference between to and too\n\n\\>wants to make a killing on the stock market\n\nhmmmm", "score": 3, "replies": []}]}, {"body": "The only open question left is whether criminal charges will be filed from the DOJ. If that happens this goes sub 200.", "score": 9, "replies": [{"body": "If there is a conspiracy against Tesla we will see the DOJ reveal charges tomorrow to put a damper on all the good news. ", "score": 13, "replies": []}, {"body": "Whats the probability of doj charges with a relatively light punishment from the Sec?   ", "score": 2, "replies": [{"body": "Full disclosure I'm long tsla via calls and stock but my guess is that DOJ will be nothing burger.  Stock market is the SEC's domain so I think DOJ will be very unlikely to act.  The SEC has now done their job so everyone saves face.  Government bureaucracies generally seem to play and stay in their own sandbox.  Might be a few more civil lawsuits from shorts but that is it.  This was just one tweet...", "score": 2, "replies": [{"body": "Ill just fucking sue the DOJ for ruining my Calls. ", "score": 2, "replies": []}]}, {"body": "high, SEC concluded he was guilty (not a big punishment, but they found him guilty nonetheless)... so evidence is there for DOJ ", "score": -1, "replies": []}]}, {"body": "he has settled with DOJ before.... \n\nthe bigger question is what's gonna happen when that the shorts who had to cover and the longs post \"funding secured\" tweet now have even more ammunition for their lawsuits and file (if they haven't already)? ", "score": 1, "replies": []}]}, {"body": "Musk is literally pumping stock and manipulating emails. He’s “leaking” an email about profitability nearly being green the stock tanked 12% so he settled and will do just about anything to get it back up. You could go all in tomorrow, make a quick buck and get out. Who knows, but with tsla don’t expect anything guaranteed ", "score": 12, "replies": [{"body": "get outta here. 300Cs.", "score": 10, "replies": [{"body": "10/5 400C", "score": 8, "replies": []}]}, {"body": "Imo what Elon has done is genius, he continued to act like an idiot to send the stock tumbling, got the shorts overconfident, they still are. It's not gonna be a squeeze, it will be a super squeeze. Just a matter of time. \n\nI also think the saudis played him with false promises in a possible attempt to topple the company and help their oil. Then they invest a paltry 1b into the Chinese rivals...", "score": 5, "replies": []}, {"body": "Agree. This is a MONITORED DAY TRADE.  Still potentially a lot of bad news to come. Tesla as usual. Respect the volatility. ", "score": 7, "replies": []}, {"body": "He sends these emails every quarter before the end. I think it's done to motivate stuff or manipulate stock", "score": 1, "replies": []}]}, {"body": "I'll make the popcorn", "score": 2, "replies": []}, {"body": "I think there is gonna be a delay in mooning until the new chairman is announced. ", "score": 2, "replies": [{"body": "As long as it’s not Grimes it should be a positive.", "score": 9, "replies": [{"body": "That'd be a top tier troll move.", "score": 5, "replies": []}, {"body": "That'd be a top tier troll move", "score": 1, "replies": []}, {"body": "Have to find her first.", "score": 1, "replies": []}]}]}, {"body": "You’re too late you could always scalp a run up", "score": 2, "replies": []}, {"body": "[removed]", "score": 3, "replies": [{"body": "There’s no evidence that happened and it would be easy to prove it did. That would be illegal.", "score": 3, "replies": []}]}, {"body": "Already got Jan 300c.  Went far out so I can recover from any short term down turn. ", "score": 1, "replies": []}, {"body": "If you really wanted to have fun you should have done that on Friday... when I dropped $5K on a 310 call for 1/17/20. ", "score": 1, "replies": []}, {"body": "Why would you buy $TSLA when you could just buy the stock of a company who's Chairman doesn't act like a rebelious teenager?", "score": 1, "replies": []}]}
