{"title": "Amazon becomes world's second $1tn company", "selftext": "[removed]", "id": "9cwunx", "created_utc": 1536076192.0, "score": 277, "upvote_ratio": 0.95, "num_comments": 52, "comments": [{"body": "Amazon will own a country by 2030", "score": 39, "replies": [{"body": "They're doing good so far. They already have their own river!", "score": 71, "replies": [{"body": "Don't forget their rainforest!", "score": 16, "replies": []}]}]}, {"body": "so much more room to run. THis is the greatest company in the world, the best stock in the world. I see 2500 by end of year...", "score": 78, "replies": [{"body": "If Wall Street likes their Q3 earnings and guidance in October, then $2,500 is totally achievable by year-end. This thing has been going up at an average rate of $100 a month the past year and the higher it goes, the faster each dollar will come by.", "score": 38, "replies": [{"body": "Sounds like 2000 all over again...", "score": 26, "replies": [{"body": "Was this year 2000 thing a legit comment or being ironic? The dotcom crash happened because all these new and exciting websites and services came out in the late 90s and people were going nuts. The internet and doing everything online was the future that came reality and everyone was going crazy with excitement and pumping money into everything internet and tech related whether it was a big legitimate company or not. Most tech companies were basically like penny stocks that turned into $10-20 a share companies in a couple years. \n\nBut after the crash, the small companies, the ones that were previously penny stocks, all went away and the big boys and major players came out with less competition. There were too many start-ups back then. Now all the big money is being thrown at major companies so they can continue their dominance. \n\nSure, this great run won't last forever and there will be temporary downturns, but another drop like the dotcom crash probably won't ever happen again with major tech companies. I'd bet on Amazon going up another 50% or more within the next year rather than LOSING 50%. Though Amazon has had such a great run this past year that it could lose 50%...and STILL be up over 50% from what is was a year ago. ", "score": 6, "replies": [{"body": "The dotcom crash happened because investors did not know how to accurately value the companies they were investing in.  \n  \nAmazon is a fantastic company and they have changed the world, but whether they are really worth $1T with a PE of 160+ remains to be seen. And I do think their valuation is based on a lot of optimism and crowd mentality and not just careful, thoughtful due diligence to objectively estimate intrinsic value.    ", "score": 18, "replies": []}, {"body": "That's not how math works.  It's up around 100% over the last year.  If it loses 50% of what it is now, it's back to where it started a year ago.", "score": 8, "replies": []}, {"body": "It IS happening right now. Tech is the most consumer contacted product today. \n\nThere are tons of micro penny stock tech companies that have grown in the past decade all over the US. \n\nI don't disagree with the notion that there was a crash in 2000 and that the bubble didn't come right back BUT it has in the past ten tears with the rise of portable communication computing. \n\nThink of one microchip based item that doesn't communicate with another device. \n\nThis trend has allowed the \"little tech penny stock\" companies to innovate this kind of tech and then sell their tech to the \"big guys\" like Apple and Amazon.\n\nHow do you think it is possible for these companies to innovate so quickly?\n\n Allowing the big guys to focus on acquisitions to bloat stock price. The big guys use this cyclical profit sharing to reinvest in tech acquisitions of small companies at a fraction of large company operations.\n\nSo far its been working out for everyone.\n\nIf the crash comes i think it is going quick. I think it is going to come from the large company stock sell offs because of retiring boomers seeing dollar signs. The economy growth has finally reached a point where people who have been putting off retiring can do now since their personal and professional lives are at a stable point. \n\nBig companies will consolidate and have massive layoffs. The housing market in the bay area will go upside down and tech in the bay will decentralize to more favorable economic climates like Portland and Salt lake city.", "score": 3, "replies": [{"body": "I would say that the housing market and large loans would be a bigger factor in an economic downturn rather than tech being overinflated. \n\nA big difference in the rise in tech in the past 10 years compared to the dotcom crash is that at least smaller companies have made a steady rise in the past 10 years to where they are today. In the late 90s and 2000, these companies, well, at least their stock price, would explode after their IPO and stay hot without any real valuation or projection. \n\nThe Nasdaq as a whole went up about\n300% in less than 3 years back that. Insane. An even though the Nasdaq has been on a good run lately, it took about 7 years to go up 300%. That's really good growth in 7 years, but doing that in 3 years was just asking for trouble. ", "score": 1, "replies": [{"body": "Good points.", "score": 1, "replies": []}]}]}]}, {"body": "such a lazy comment. 2000 was 18 years ago, its a whole new different world out there...\n\nugh\n\n", "score": -9, "replies": [{"body": "It's different this time...", "score": 28, "replies": [{"body": "It's different this time, just like last time! /s", "score": 9, "replies": []}, {"body": "By your logic this is amazing. Look how far the economy has come since 2000! I don't remember there being massive hardship in 2000. So bring on 2000 pt 2!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "it's Mainstream media hype driving people into a frenzy....", "score": 3, "replies": []}]}, {"body": "Dutch East India beat them all at $7.9 Trillion. http://www.visualcapitalist.com/most-valuable-companies-all-time/\n\nApparently Standard Oil may have beat both Apple and Amazon in the US too.", "score": 5, "replies": [{"body": "True, but DEI was basically like a quasi government back then", "score": 3, "replies": []}]}, {"body": "In the US, yes. World, no.\nChina already had their trillion dollar company back in 2007.", "score": 36, "replies": [{"body": "I'm sure the books on that company are very accurate and none of the assets making it 1 trillion are from the state.", "score": 51, "replies": [{"body": "It was valuation by market cap not by assets, although your point still stands.", "score": 19, "replies": []}]}, {"body": "Saudi aramco as well", "score": 11, "replies": []}]}, {"body": "Almost all of my IRA (87%) is Amazon. I know that's not the right way to go about it..  but it's been damn swell for me.", "score": 2, "replies": [{"body": "There has never been a more perfect time in your life to sell 50% of that and hold or invest into recession safe stocks. Think of the regret you'll have after having had so much. ", "score": 6, "replies": [{"body": "What are some examples of recession safe stocks?", "score": 1, "replies": [{"body": "SQQQ. \n\n/s\n\nBut for real, the only real way to recession-proof is to diversify across US stocks, international stocks, bonds, etc. in a variety of sectors. ", "score": 1, "replies": [{"body": "You have the right point for the wrong problem. \n\nWhen I say recession proof stock I mean specifically ones that either flourish or hold value during a recession (funeral homes or mobile homes that sell during hard times).\n\nIf you can do this right and still have your money when the recession occurs then you can reinvest it into diverse US stocks at a discount. \n", "score": 1, "replies": []}]}]}]}, {"body": "Kudos to you. Very risky to do but I wish I had the balls to do it! Make sure you pull some profits here and there and maybe take out your initial investment and play with house money. ", "score": 1, "replies": []}]}, {"body": "[removed]", "score": -3, "replies": [{"body": "Everyone knows that Tesco puts something in its sandwichs though.", "score": 24, "replies": []}, {"body": "I wonder why the UK warehouses seem to have so many issues, since the North American ones seem to have way less worker related issues\n\n&#x200B;", "score": 5, "replies": [{"body": "[removed]", "score": 7, "replies": [{"body": "Interesting, I was unaware. I usually browse the warehouse workers subreddits and they seem to never really talk/complain about issues, Also the warehouses I've seen (in Canada) seem actually quite nice. That being said I'm not an employee and can't speak to anything, I only have a second hand experiences.", "score": 2, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "which is why I mentioned I can't speak to any of the experiences as none of them are mine", "score": 1, "replies": []}]}]}]}]}, {"body": "If this is true, why do people continue working for them? The same thing was copied in another thread.\n\nNobody is forcing you to work for Amazon. I often get the sense these style posts are just angry people who couldn’t get hired by the company they’re complaining against.", "score": -3, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "How are they different? As far as I know, warehouse workers get compensated above minimum wage and get health care in many instances and even stock. Oh they’re different because Amazon is valued somewhere around $1 trillion and people are jealous.", "score": 1, "replies": [{"body": "Ask people that have actually worked in a warehouse, hopefully both inside Amazon and a comparable environment.  Amazon by comparison treats employees better, provides educational and training  opportunities and has a robust focus on safety.\n\nSource:  I’ve done manual labor for multiple companies  and actually have a frame of reference on how to evaluate working conditions at FCs.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "A few people out of half a million workers complained because they were disgruntled. So?\n\nI dont know if drivers are forced to pay for their vans but no one is forcing them to work for Amazon.\n\nQuit your entitlement.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I don’t think you’re understanding mate, Amazon doesn't owe you anything. If you can't find a job that suits you, move.\n\nQuit your entitlement.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "You keep repeating the talking points of a couple disgruntled workers.\n\n>Can you stop with quit your entitlement it makes you sound 5 and it doesn’t make you seem powerful, just lacking the mental age to have a civil argument\n\nYou resort to personal attacks because I pointed out no one is being forced to work for Amazon, and you really have no response. They're a private company. If you don't like them, don't do business with them. It's really that simple.\n\nBezos doesn't owe you anything. Quit your entitlement.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Then move to another city or vote for change in your government so there can be other jobs. Amazon doesn’t have to kneel to you and give you what you believe you’re entitled to, mate. You’re literally the text book definition of entitled.\n\nThe world owes you nothing. Until you stop believing that Amazon or anyone else is responsible for giving you the quality of life you desire, you’re going to happy a very unhappy life.\n\nQuit your entitlement.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Except you’re wrong. Their average wage is > $15/hr, and they give healthcare. You want more money, get a better education or find a job with more demand. Quit your entitlement.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They pay taxes to contribute to it. You have the entitled belief that private companies owe you the ability to afford the lifestyle you desire. Like I said, until you drop this belief, you’re going to live an unhappy life.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You insist in your entitlements and respond with personal attacks. Amazon pays taxes like any other company in your country.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Looks like Bernie! ", "score": -1, "replies": []}, {"body": "So? Don’t work there ", "score": -9, "replies": [{"body": "\"just don't be poor\" ", "score": 16, "replies": [{"body": "There's plenty of other unskilled labor opportunities. No one is forcing people to choose amazon. ", "score": -7, "replies": []}]}]}]}, {"body": "It looks like the bitcoin 2018 bubble on the verge of getting rekt in Q1 next year:\n\n[https://www.tradingview.com/symbols/NASDAQ-AMZN/](https://www.tradingview.com/symbols/NASDAQ-AMZN/)\n\n&#x200B;\n\nSurely, it's too late to try to hop on that rocket?", "score": 1, "replies": []}]}
{"title": "AMD double upgraded to $30 by Cowen, Jefferies", "selftext": "[deleted]", "id": "9cv70x", "created_utc": 1536064577.0, "score": 129, "upvote_ratio": 0.96, "num_comments": 59, "comments": [{"body": "oh shit guys stogg is going up its time to upgrade\n\n:\\^)\n\nprofushional financial analysts", "score": 92, "replies": [{"body": "This is how nvidia was treated for years. I missed that ride from 25 to 250 but there is still time to board the Su Bae gain train.", "score": 41, "replies": [{"body": "always funny when you read their \"reasoning\" for the upgrade, its always something that could have held true 6-12+ months ago", "score": 31, "replies": [{"body": "I do believe they are based on the company's zodiac sign.", "score": 30, "replies": []}]}, {"body": "AMD has gone from 2 bucks to over 25, so...", "score": 7, "replies": []}]}]}, {"body": "[deleted]", "score": 40, "replies": [{"body": "they all piled in with ridiculous PTs the last time MU was on a run, analysts are such a joke", "score": 15, "replies": [{"body": "I'm happy for the guy who downgraded AMD to $5 back in March.  Allowed me to average down to $10 right before the run up.", "score": 1, "replies": []}]}]}, {"body": "Soon more analysts will bend the knee to Su Bae and upgrade. There are still several \"Sell\" and \"Hold\" ratings with price targets in the teens. They will ALL pay the price to ride the Su Bae rocketship. $30 incoming", "score": 30, "replies": [{"body": "My body is ready.", "score": 2, "replies": []}]}, {"body": "Su Bae bringing the breakfast tendies hot from the oven", "score": 53, "replies": [{"body": "Mama Su's Tendies o' Plenty\n\nOffering casual southern dining and massive gainz", "score": 4, "replies": []}]}, {"body": "Do you feel the way shit clings to the air bois? The shit storm of tendies is coming.", "score": 10, "replies": []}, {"body": "Double secret probation upgrade!", "score": 5, "replies": []}, {"body": "Su bae Su bae", "score": 4, "replies": []}, {"body": "Mama Su.... thanks for the mula... ", "score": 3, "replies": []}, {"body": "Oh wow. It was nice seeing them burn my tendies last week. Now that I’m out they do this shit.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Just powered through 26. Looks like we could hit 27 by EOD\n", "score": 14, "replies": [{"body": "Lol.  Make that 28", "score": 14, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "What is the breakdown of other companies? Curious what is to their relative market caps.", "score": 2, "replies": [{"body": "For chips in servers Intel rounds to 100% ", "score": 5, "replies": [{"body": "Damn, so it seems there is some room for AMD to snag some of that. ", "score": 3, "replies": [{"body": "https://www.tomshardware.com/news/intel-ceo-amd-server-market,37273.html", "score": 2, "replies": [{"body": "This makes my AMD LEAPS very happy. Thank you. ", "score": 1, "replies": []}]}]}]}]}, {"body": "And what's the eps at with 10% server market?", "score": 1, "replies": [{"body": "10% would increase revenue by about 40%\n\nCould be more though:\n\nhttps://www.tomshardware.com/news/intel-ceo-amd-server-market,37273.html", "score": 1, "replies": [{"body": "https://www.reddit.com/r/AMD_Stock/comments/9650lq/goldman_sachs_upgrades_amd_downgrades_intc/\n\n> we believe AMD will earn $1.06 (incl. SBC) in 2020 (up from our prior estimate of $0.89). In a more bullish scenario (implying higher share gains), we see AMD earning between $1.72 and $2.46\n\n...\n\n>Our updated 12-month price target of $21 (from $13.25 prior) is based on 20x our normalized EPS estimate of $1.05\n\nHari has been pretty accurate with his eps estimate so far. I don't like buying AMD at this price and this far out from 7nm release. I like MU better at these prices.\n", "score": 1, "replies": [{"body": "1.06 to 2.46 is clearly a huge range. I do expect it to be closer to 2 than 1 myself. That put the stock around 40 by the 20x measure, but given that it will have been bullish for two years I expect 50. I honestly expect 80+, but happily admit I am overly bullish. In any case it has a lot of room to run. And I have about 40k in LEAPS to run with it.", "score": 1, "replies": []}]}]}]}]}, {"body": "Just like a week or two ago?", "score": 1, "replies": []}]}, {"body": "It's going to fall", "score": -6, "replies": [{"body": "No it's not", "score": 5, "replies": []}, {"body": "Narrator: *It would not fall*", "score": 3, "replies": [{"body": "It's all good. Switched my puts to calls and I'm reigning back pretty much all of my losses ", "score": 1, "replies": []}]}]}]}, {"body": ">  Intel's i9 leaks are breathtaking\n\nYeah, every time they tell us about their vaporware I take a breath.", "score": 6, "replies": [{"body": "And no one really gives a shit about the highest tier, most expensive chips. Even with the huge pc gaming resurgence in the last decade, most people buy middle tier parts for their PCs", "score": 1, "replies": [{"body": "Well cloud centers care, but they are going to be eaten by AMD I think, given that AMD has a 20% lower TCO and 50% lower licensing costs in many cases.", "score": 1, "replies": [{"body": "Datacenter aren't using i9s.", "score": 2, "replies": [{"body": "Yes, that's true. AMD has a killer EPYC line now.", "score": 1, "replies": []}]}]}]}, {"body": "they still shit on AMD \n\nhttps://www.pcworld.com/article/3298859/components-processors/how-memory-bandwidth-is-killing-amds-32-core-threadripper-performance.html?page=2", "score": 0, "replies": [{"body": "First of all, it's EPYC that you should be paying attention to.  https://www.anandtech.com/show/11544/intel-skylake-ep-vs-amd-epyc-7000-cpu-battle-of-the-decade/12\n\nSecondly, the threadripper is $1500US. The i9 is $2K. And if you go here and look down the list:  https://www.cpubenchmark.net/cpu.php?cpu=AMD+Ryzen+Threadripper+2990WX&id=3309\n\nYou'll see under the September benchmarks it comes in at about the same speed. (27K). And, correct me if I'm wrong, but is the AMD overclockable?\n\n", "score": 1, "replies": []}]}]}, {"body": "People are going to get pumped and dumped", "score": 1, "replies": [{"body": "All in on Intel -- it's sure to win with no products and an unencrypted kernel space.", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Well no worries, all they have to do is to dump out a busload of bullshit PR. Maybe they should make an Israeli PR company into a \"security\" company and release a negative report on AMD next.", "score": 2, "replies": []}]}, {"body": "intel is still number 1 by far\n\nthey have so much more to offer to data centers than just chips its almost laughable how people cant see this in this golddigger frenzy", "score": 1, "replies": [{"body": "So invest in Intel. Just fyi, though, Intel is partnering with AMD.", "score": 1, "replies": []}]}]}]}, {"body": "Pls happen soon. Need to unload my puts ", "score": 1, "replies": []}, {"body": "Correct me if I'm wrong, the new 10nm processors are delayed by 2 years because they have the same security issues of their 6,7,and 8th generations. Hence the jump for amd, no competition for 2 years.\n\n Edit, i9 series is not the new 10nm architecture. But this is the last series until then. ", "score": 1, "replies": [{"body": "this whole nm bullshit is almost meaningless\n\nthere are many more factors to consider", "score": 1, "replies": [{"body": "hrm....  if only you were correct....", "score": 1, "replies": []}]}]}]}, {"body": "i can only get so hard...", "score": 1, "replies": []}, {"body": "Up 100% on 9/14 25c. I have other positions that are like 100% loss. Selling AMD now would make up for those losses and gain a small profit. I wonder if I should sell now or hold longer. \n\nEmpress Su, please give me guidance.", "score": 1, "replies": [{"body": "Look at what profits you could lock in by legging into a call spread or butterfly spread. Keeps you in the game to make even more money.", "score": 1, "replies": []}]}, {"body": "By the time it's posted on this subreddit, it's obviously too fucking. How do I stay ahead of the sheep ", "score": 1, "replies": []}, {"body": "How do I subscribe to these new articles? ", "score": 1, "replies": []}, {"body": "This is bad for $MU", "score": 0, "replies": []}, {"body": "This is bad for $mu", "score": 0, "replies": []}, {"body": "is this a ~~stonke manipulation~~ AMD double upgrade?\n\n&#x200B;", "score": 0, "replies": []}]}
