{"title": "Global Stocks declining as China prepares to ask the WTO for permission to impose trade sanctions on the", "selftext": " \n\n### US Stocks\n\n* **Global stocks are declining this morning,** as China prepares to go to the WTO in its escalating trade dispute with the United States \n* Reuters is reporting that China is looking for permission from the WTO to impose trade sanctions on the United States \n* The last time China attempted this strategy in regards to duties applied to goods the US accused China of dumping into the US markets, the WTO sided with China against the United States \n* US stocks index futures are pointing to a negative open in NY with the Dow Jones minis –0.37%, S&P500 minis –0.21% and Nasdaq 100 minis –0.20% \n* The VIX is little changed this morning and is currently at 14.41 after closing at 14.16 yesterday\n* Chesapeake Energy (CHK) January 2020 OTM Calls, Petrobras ADR (PBR) January 2019 OTM Calls, Antero Resources (AR) January 2020 ORM Calls and Advanced Micro Devices (AMD) September 14 OTM Calls are the most heavily traded options contracts in the US pre-market \n* Goldman Sachs is arguing investors should get long European volatility while shorting US volatility – the spread between the VStoxx and VIX is now close to zero\n* US 10-Year Treasury Bonds are lower with yields up 2.39 basis points to 2.95%\n* The US Treasury 2s-10s Spread has widened 0.73 basis points to 0.23%\n* WTI Crude is currently down -0.31% to USD$67.54/bbl with the Brent-WTI spread up USD$1.24 to USD$10.21/bbl\n* Gold is currently little changed -0.18% to USD$1193.75/oz\n\n### Stocks Trending in the News\n\nClick name for Q-Factor score and financial data.\n\n* **Apple (AAPL)** is allegedly planning to introduce electronic sims (eSIMs) with its new iPhone lineup.  The technology behind eSIMs would permit users to seamlessly change phone carriers by changing settings on the iPhone.  Apple is little changed in pre-market trading this morning.  The stock is rated a “Top Buy” in our US Large-Cap Global Top Picks and “Attractive” in our US Information Technology Global Top Picks.\n* **ArcelorMittal (MT NA)** has raised its bid for Essar Steel India to 420bn rupees (USD$5.8bn) according to press reports.  As part of the deal Arcelor agreed to pay all of Essar’s outstanding debts. Arcelor is down 2.3% to 24.43 euros.  Arceleor is rated ‘Attractive’ in our European Large-Cap Global Top Picks.\n* **Ashtead (AHT LN)** delivered 1Q results above expectations and the stocks traded up 3.7% to 2364 pounds.   There was strength in its business in all regions.  Ashtead is rated ‘Top Buy; in our United Kingdom All-Cap Global Top Picks\n* **Galaxy Entertainemnt (27 HK)** was cut to sell by Deutsche Bank which cited VIP share losses it expects in the coming year.  It also expects less overall revenue for the sector in Macau.  Galaxy is down 5.7% at HKD$48.10.  Galaxy is rated ‘Attractive’ in our China All-Cap Global Top Picks\n* Signa Holding GmbH’s acquisition of **Hudon’s Bay’s (TSX: HBC)** Galeria Kaufhof is creating a German Department Store with EUR€5.4bn to better compete with Amazon.com (AMZN) expansion plans for Europe.  Hudson’s Bay is little changed in pre-market trading this AM and is not rated in our Canada All-Cap Global Top Picks. \n* **Pioneer (6773 JP)** will receive \\~60bn yen in financial support from Baring Private Equity Asia through a mixture investments and loans.  Baring will become its biggest shareholder.  Pioneer closed 3.2% higher at 129 yen.  Pioneer is rated ‘Top Buy’ in our Japan Large-Cap Global Top Picks\n* **Renesas Electronics (6723 JP)** will acquire **Integrated Device Technology (IDTI)** in a USD$6.7bn deal.  Renesas is the second biggest supplier of semiconductors used in cars and the acquisition will allow it to expand into other areas.  At $49 per the deal will be at a 16% premium to market price. Renesas closed up 4.4% at 754 yen.  Renesas is not rated in our Global Top Picks.  Integrated Device is rated ‘Neutral’ in our US Large-Cap and US Information Technology Global Top Picks.\n* **SJM Holdings (SEHK: 880)** was downgraded to “Sell” at Deutsche Bank after the investment bank cuts its outlook for Macau 2019 gross gaming revenue.  SJM closed down 6.44% to HKD6.97 and is a “Top Buy” in our China All-Cap Global Top Picks. \n* A UK court has ruled that **Sports Direct International (LSE:SPD)** must have over financial documents as part of an investigation into its CY2016 results.  Sports Direct is down 3.05% to GBP3.48.  Sports Direct is “Neutral” in our United Kingdom All-Cap Global Top Picks. \n* **Tencent (700 HK)** bought back shares for the second day on Monday, its first buy backs in over 4 years.  This has led to speculation there could be much more to come.  Tencent closed down 1.8% at HKD308.  Tencent is rated ‘Top Buy’ in our China All-Cap Global Top Picks\n* **Yum China (YUMC)** will not be acquired by a Chinese group after the initial offer from the group was rejected. The group cited a worsening of conditions as well as a reason for abandoning the deal.  Yum China is the USD$14bn operator of KFC in China.  Yum China is rated ‘Top Buy’ in our China All-Cap Global Top Picks  \n \n\n### European Stocks\n\n* **European stocks are declining to start the morning,** following an article from Reuters that alleges that China is prepared to ask the WTO for permission to impose trade sanctions on the United States \n* The Euro Stoxx 600 is currently down -0.29%, the FTSE 100 is down -0.57%, the DAX is down -0.49%, and the CAC 40 is down -0.15%\n* Oil & Gas (+0.34%), Health Care (+0.08%), and Financial Services (-0.06%) stocks are the top performers in the Euro Stoxx 600 today\n* Basic Resources (-0.98%), Automobiles & Parts (-0.84%), and Insurance (-0.79%) stocks are the worst performers in the Euro Stoxx 600 today\n* Investor sentiment for European stocks is negative with the advance/decline ratio for the Euro Stoxx 600 currently at 0.45x\n* 40 stocks in the Euro Stoxx 600 are at 4-week highs while 86 stocks are at 4-week lows\n* 8 stocks in the Euro Stoxx 600 are overbought while 58 stocks are oversold according to the 16-day RSI Measure\n* VSTOXX, the European stocks equivalent of the VIX, is moving little changed this morning and is currently at 15.99 after closing at 15.89 last week\n* EUR€ is currently little changed against the USD$ at 1.1581\n* GBP£ is currently little changed against the USD$ at 1.3022\n* CHF is currently little changed against the USD$ at 1.0263\n* German 10-Year Bunds are lower with yields up 1.9 basis points to 0.42%\n* UK 10-Year GILTs are lower with yields up 2.8 basis points to 1.497%\n\n### Asian Stocks\n\n* **Asian stocks closed mixed,** with Japanese stocks advancing while Chinese/Hong Kong stocks finished in the red again \n* The Nikkei 225 finished up +1.3%, the Hang Seng ended down -0.72%, the Hang Seng China Enterprise declined -0.96%, and the CSI 300 was -0.18%\n* Hong Kong stocks are formally in a technical “bear market” after dropping more than 20% since their January 2018 highs \n* A weakening Yen continues to support Japanese stocks  \n* Investor sentiment for Japanese stocks finished positive with the advance/decline ratio for the Nikkei 225 closing at 2.46x\n* 16 stocks in the Nikkei 225 hit 4-week highs while 36 stocks reached 4-week lows\n* 7 stocks in the Nikkei 225 closed overbought while 18 stocks closed oversold according to the 16-day RSI Measure\n* Investor sentiment for Hong Kong stocks finished negative with the advance/decline ratio for the Hang Seng closing at 0.43x\n* 1 stock in the Hang Seng hit 4-week highs while 20 stocks reached 4-week lows\n* 1 stock in the Hang Seng closed overbought while 8 stocks closed oversold according to the 16-day RSI Measure\n* Japan 10-Year Government Bonds are higher with yields down -0.3 basis points to 0.115%\n* JGBs 2s-10s Spread has narrowed 0.1 basis points to 0.22%", "id": "9ewzbm", "created_utc": 1536667900.0, "score": 203, "upvote_ratio": 0.86, "num_comments": 54, "comments": [{"body": "Stocks are not declining.", "score": 41, "replies": [{"body": "The market clearly fears Trump more than China.", "score": 13, "replies": []}]}, {"body": "Markets are all up this morning. Great prediction....", "score": 63, "replies": [{"body": "The \"importance\" of the news, or should I say the importance of trading stocks based on a headline writer's impression of the news.", "score": 11, "replies": []}]}, {"body": "[deleted]", "score": 32, "replies": [{"body": "US doesn't have sanctions on china, just heavy tariffs", "score": 76, "replies": []}, {"body": "90% of having a great economy is having great allies. China is making friends while the US is losing them.", "score": -9, "replies": [{"body": "How do you figure?\n\nI think it’s more important to have a good working relationship with trade and purchasing. Diplomacy is nice but not at the cost of a deficit. Sureee, Every country will want to be best buds with the US if they get to walk all over them in trade, no doubt lol", "score": 7, "replies": []}, {"body": "On the contrary, giving money away to governments that manipulate currency and don't live up to expensive defense agreements may get you cool photo opps but will ruin your economy. See: clinton, bush, obama.", "score": 3, "replies": []}]}]}, {"body": "ELI5.\nI got JD, IQ.\n\nAm I fucked or is this good news?\n\n", "score": 5, "replies": [{"body": "Anally", "score": 4, "replies": []}, {"body": "It's not good news, but too soon to tell the effects.", "score": 7, "replies": []}, {"body": "You’re good! This is fucked news ;)", "score": 1, "replies": []}]}, {"body": "China talking about the US  trade trade practices.\nROFL  ", "score": 52, "replies": [{"body": "[deleted]", "score": 75, "replies": [{"body": "[deleted]", "score": 41, "replies": [{"body": "ROFL... Is there such thing? As far as I know Chinese companies continually steal American and other nations' Intellectual Property without any repercussion. Cost of doing business apparently.", "score": 21, "replies": [{"body": "Yes, there is such a thing. DJI being perhaps the best example of a Chinese tech company.", "score": 4, "replies": [{"body": "Interesting. I believe DJI was having issues with Yuneec no? A Hong Kong based company. ", "score": 2, "replies": []}, {"body": "Except DJI has almost zero original IP. ", "score": 0, "replies": [{"body": "DJI has hardware designs, patents, software, algorithms for tracking and piloting, an R&D operation that's core to the ideation and product generation for the company, etc. In no way shape or form can you credibly say that DJI has no original IP.", "score": 8, "replies": [{"body": "Their specific hardware designs and their specific software implementations, sure in so far as you can call it IP. \n\nBut their hardware designs are nothing that wouldn’t be done in a similar way by a million different people, there are only so many ways to design a stable multi-rotor. And if you look at their code verses someone else’s code to implement the same things, they will both look awfully familiar as there are only so many ways to implement certain algorithms and design patterns.\n\nAll of the meat of their products is still really just borrowed. All the CV tracking algorithms, PID tuning algorithms, and even basic flight controls are all non-novel applications of existing technologies. They just emulated existing stuff and threw their name on it.  Hell, large portions of it is actually ‘open source’ and freely available to everyone. \n\nGranted they have a reputation for decent quality at what used to be a decent price. But I wouldn’t go so far as to say they have any significant IP of value beyond their trademarks and it’s attached reputation.", "score": 3, "replies": []}, {"body": "They haven't created many successful new consumer products, I believe is what they are trying to say. ", "score": 1, "replies": [{"body": "They pioneered consumer drones and have a lot in the way of videography equipment, both for consumers (like the DJI Osmo) and professionals (the Ronin series of gimbals). Again, I think you all discount what DJI has managed to offer in the marketplace.", "score": 3, "replies": [{"body": "I'm not making any claim other than I think that is what they meant, rather than literal patents. ", "score": 1, "replies": []}]}]}]}]}, {"body": "As revenge Trump should get our spy's to steal all their tech, and release it on the web for everyone. Drones are going to be huge going forward, but it wouldn't even put a dent in the damage caused by their theft of micron IP. They steal 200 billion per year, we should steal whatever we can.", "score": 1, "replies": [{"body": "Haha love it! \"Theeeeyyyy toook errrr jobs\" [https://www.youtube.com/watch?v=toL1tXrLA1c](https://www.youtube.com/watch?v=toL1tXrLA1c)", "score": 0, "replies": []}]}]}]}]}]}, {"body": "I mean you can laugh all you want but they won the last time they bought this case to the WTO. Obviously China knows how to play the game.", "score": 15, "replies": [{"body": "Can't deny that no one plays the long game better than China", "score": 2, "replies": []}, {"body": "So the WTO doesn't work.\n\nWe should leave\n", "score": -15, "replies": []}]}]}, {"body": "Wow the US stock market was reaaalllllyyyy down today.... ", "score": 5, "replies": []}, {"body": "“Daddy! Trump is bullying me!” ", "score": 3, "replies": [{"body": "Actually it is how this works. Mocking is out of context. ", "score": 0, "replies": []}]}, {"body": "    Chesapeake Energy (CHK) January 2020 OTM Calls, Petrobras ADR (PBR) January 2019 OTM Calls, Antero Resources (AR) January 2020 ORM Calls and Advanced Micro Devices (AMD) September 14 OTM Calls are the most heavily traded options contracts in the US pre-market\n\nWhere do you find this info??", "score": 1, "replies": []}, {"body": "this is fear mongering. aint workin.", "score": 1, "replies": []}, {"body": "[removed]", "score": -58, "replies": [{"body": "[removed]", "score": 32, "replies": [{"body": "[removed]", "score": -32, "replies": [{"body": "[removed]", "score": 5, "replies": []}, {"body": "What is wrong with you?\n\nWere you abused? ", "score": 2, "replies": []}, {"body": "Well I mean if your post history wasn't retarded maybe reading it wouldn't be a waste of time", "score": 0, "replies": []}]}]}, {"body": "Dumb ass president decides to start a trade war with the world and his equally stupid sheep followers will blame the WTO", "score": 33, "replies": [{"body": "Well when we're getting ass raped in trade by every country on the globe and the WTO is no help we take it into our own hands. And what a horrible result we've had in the markets since November 2016 eh? ", "score": -17, "replies": [{"body": "I don't call being the strongest most prosperous country on the globe getting ass raped.\n\n/* also, all trump has done that can possible effect the economy is sign off on the tax bill and place tarrifs. tax bill was dec 2017, tariffs started june 2018. and we've been pretty stagnant this year", "score": -8, "replies": [{"body": "[deleted]", "score": -12, "replies": [{"body": "> we've been pretty stagnant this year\n\nsorry, by stagnant i meant the stock market. should have clarified.\n\nalso all of your links are dead garbage. also I never disputed that jobs were good? theyve been on the same track for 10  years congrats on not fucking things up trump.", "score": 12, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Rightwing snowflake triggered by FACTS and LOGIC", "score": 7, "replies": []}, {"body": "Also I love how to Trumpers right wing news headlines are evidence, not sure most of them can understand numbers.", "score": 6, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": -23, "replies": [{"body": "Name one ally that imposed sanctions on US goods.\n\nBeing tough on china is fine. I don't agree with the WAY he's trying to deal with China's bullshit, but I at least see a reason. On the other hand, broad sweeping blanket tariffs on everyone at is just dumb", "score": 10, "replies": []}, {"body": "You are fucking delusional.  lol.", "score": 16, "replies": []}]}]}, {"body": "Lol troll alert", "score": 4, "replies": [{"body": "Sad part is you can't tell a troll from a true believer.", "score": 8, "replies": [{"body": "Is there really a need to differentiate lol", "score": 6, "replies": [{"body": "Yea. There is a *vast* difference between someone who genuinely believes what they say versus saying things they don't believe to get a reaction.\n\nOne could potentially be an existential threat depending on particular ideology. The other is never a threat.", "score": 3, "replies": [{"body": "I mean I disagree, I think the latter could be more of a threat since they have to be more cogniscent of both sides and articulating their thoughts on a structured way to elicit a specific response, whereas the former is predictable. Plus a troll can incite the genuine person further where as the genuine person is by no means going to sway a troll", "score": 2, "replies": [{"body": "Ok, you disagree on which is more of a threat... But simultaneously acknowledge they are not the same, which was the content of my argument.\n\nI'm glad you came around and agree they are different and there is value in identifying them as different.", "score": 1, "replies": [{"body": "Damn I gotta remember what side I'm arguing better lol", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[removed]", "score": 4, "replies": [{"body": "Build a wall against Mexico to fight China, I can *totally* see how related these 2 things are.", "score": 6, "replies": []}]}]}]}
{"title": "Tesla Bull [Nomura Instinet analyst] Capitulates, Says Stock Is ‘No Longer Investable’", "selftext": "", "id": "9ey6p3", "created_utc": 1536677201.0, "score": 9, "upvote_ratio": 0.76, "num_comments": 62, "comments": [{"body": ">Nomura Instinet analyst Romit Shah downgraded Tesla this morning to neutral from buy in a note titled “No Longer Investable.” The note to clients starts by pointing out that previously he’s been one of the biggest bulls on the Street since initiating coverage last October.\n\n> Shah slashed his price target on the company to $300 from $400 citing the “erratic behavior of CEO Elon Musk.” Among Shah’s concerns: The increasing number of Musk tweets per day, his cave diver accusations, his outbursts on an earnings call, his taunts of short sellers and his appearance on Joe Rogan’s podcast.\n\n> Shah continues to believe that Tesla can out-innovate the competition and that the company may eventually be much bigger than it is today, but says it’s better to remain on the sidelines until the company has better leadership", "score": 9, "replies": [{"body": "This is just so odd to me. He gets so much scrutiny and new people seem to actually be starting to think he is mentally crazy. He is crazy but not mental... so... more buying opportunities guys!\n\n*sigh edit*: [Jim Cramer says he should go on medical leave](https://www.cnbc.com/amp/2018/09/11/tesla-ceo-elon-musk-should-go-on-medical-leave-says-jim-cramer.html) \n", "score": 10, "replies": [{"body": "This Jim Cramer: https://www.youtube.com/watch?v=t5qX7zjb09A ?\n\nFuck that guy.", "score": 7, "replies": [{"body": "Cramer acts like he's on something *all the time*.", "score": 1, "replies": []}]}]}, {"body": "I think the folks turning on Elon are going to have some serious egg on their face shortly.  \n\nAlso Cramer needs to be on permanent medical leave.  Such a clown.", "score": 6, "replies": [{"body": "Fundamentally, Shah is right-- Tesla needs to demonstrate quality and stability of management in order to make it a solid investment.  Implied in that is \"long term.\"  That isn't mutually exclusive with Tesla is going to have a great quarter or second half.\n\nI'm also happy to jump on the Cramer Clown bandwagon and criticize him, but traditional investment advice is you don't buy when a company has just had a 30% drop due to major management mis-steps and proven itself over the following two quarters.\n\nIronically both of them are complaining about the same thing-- **management induced volatility**.\n\nBut, personally I believe in the company, I believe in Elon's ability to get back in focus, and I believe in the long-term success of their products.  I am quite comfortable buying here-- my average cost is around $233, and at anything under $300 it is easy to justify buying for me.  I do kind of wish I wasn't so optimistic at the $420 tender offer though...", "score": 13, "replies": [{"body": "This is the crux of the issue.  You reference \"major management mis-steps\".  Clearly there's a huge gap in interpretations of what that means with respect to Tesla.  What exactly has Elon done that could be considered a \"major management mis-step\"?   Bringing to market a car that is now the 5th top selling by unit volume and #1 top selling by revenue?  Nope, that wouldn't be a mis-step in my book.  Building a car that can pretty much drive itself?  Building an car and organization that monitors it's vehicles for accidents and immediatly calls the driver to verify he/she is OK?  Building a gigantic factory that churns out batteries like nobody's business?  The fastest car on the planet at 1/10 the price of the nearest competitors?  A semi that operates 50% cheaper than the competition?  Nope, those are all awesome.  Puffing a joint on a podcast watched by millions on his own personal time?  OK, distasteful to many, but a \"major\" mis-step?  Definitely not \"major\".  Tweeting funding is secured to go private?  Definitely not conventional and certainly riled a lot of folk.  But did it slow down production?  Did it cause cars not to be delivered?  Did it slow installation of new equipment at G1?  Other than damaging perception did it actually, materially damage the company in any way?", "score": 10, "replies": [{"body": "\\^This. People lose perspective easily.\n\nThe only thing they/Elon has to prove is if they can do this profitably or not.\n\nYou don't get disruptions like Elon is pushing without a certain personality. If they want predictability/stability they're invested in the wrong stock. No massive upside without risk.\n\n They can come back afterwards, and they will, but they'll be kicking themselves alright.", "score": 5, "replies": []}, {"body": "Nope, that's why I love buying on this faux volatility. One day, these questions will be nothing more than jokes...", "score": 2, "replies": []}, {"body": "Hey, afterallwhoami, just a quick heads-up:  \n**immediatly** is actually spelled **immediately**. You can remember it by **ends with -ely**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": 2, "replies": [{"body": "Fuck you misspelling bot.\n\nImmediatly fuck off", "score": 4, "replies": [{"body": "Bot fight!", "score": 3, "replies": []}, {"body": ":(", "score": 7, "replies": []}]}, {"body": "ha ha, thank you bot!", "score": 1, "replies": []}]}, {"body": ">Other than damaging perception did it actually, materially damage the company in any way?\n\nSEC investigation and lawsuits secured.", "score": 0, "replies": []}]}]}, {"body": "Is it that hard to believe Tesla might not be worth $50 billion? \n\nI posted this elsewhere, but I think it's applicable here too:\n\nRemember, if Tesla is a $50b company now, and you want a 10% annual return, that means it has to be worth $55b next year, $60.5b in 2020, $66.5b in 2021, and so on. \n\nOver the next year they'll hit peak production with their current capacity, produce a trivial amount of profit, work through their real backlog, and then everyone will realize there's nothing else in the pipeline. \n\nFrom there they'll just have to: \n\n1. Keep making SX3 at a steady state, producing profits that don't even come close to justifying a $50b equity value. \n2. Try to turn Fremont into the Y factory and give up SX3 production for another painfully slow model Y ramp. \n3. Twiddle their thumbs for 2-3 years to build a factory for Model Y, but with what money? \n\nAll the while, competitive threats are coming from all sides and Uncle Sam's $7500/car subsidy is winding down. And Tesla has to repay big debt maturities over the next year. \n\nTesla is caught with its pants down unless Elon can convince Wall St to give Tesla a big equity injection for Y. ", "score": 1, "replies": [{"body": "I agree.  This is why I don’t understand why they didn’t raise capital so that they could invest in a Model Y factory.  Is this a growth stock?  Where is the growth plan? ", "score": 3, "replies": [{"body": ">Is this a growth stock?  Where is the growth plan?\n\nThe growth plan is :- (Hopefully, needing minimal funding, or loans being arranged)\n\n* Ramp Model 3 production to 10K with the minimum Capex spend.\n* Ramp energy products at GF1 & GF2\n* Clone Model 3 and battery pack production at China GF & Europe GF. (financed by local loans)\n* Start building the Semi in small  volumes in 2019/2020 probably at GF1.\n\nNeeding a lot more Capex, funding unsure.\n\n* Model Y & Pickup production possibly 2020/2021 reveal 2019.\n* Roadster production/Semi ramp up 2020/2021\n\nThere is some uncertainty around both aspects of the growth plans in terms of timelines and funding, and even where new products will be built. But it does seem like they need to raise capital for the Model Y build before the reveal.\n\n&#x200B;", "score": 3, "replies": [{"body": "Since we ware discussing Tesla's growth, Let's make predictions about Q3 of 2019 and 2020.    \nThey are growing well right now, but what do you think revenue growth will look like in 2019 (one year from now) and then in 2020 (two years from now).  \n\nHere is my prediction.    \nIn Q3 2019 their revenue will be similar to their revenue in 2018.  I am going to say -5% growth vs. 2018.   They may be able to manufacture more model 3's than they do currently, but the US demand for the vehicles will be largely stable and internationally the model 3 will be overshadowed by locally available products (China will have its own local producers and Europe's brands will have theirs in production).    \n\n\nIn Q3 2020 I expect that Tesla will not yet have the Model Y, nor Pickup in production.   I make this guess because they do not yet own the real estate for those manufacturing plants.  Although they may be making Semi's, the revenue from that business will be small compared to Model 3 revenue.  The energy revenue will continue to be a tiny bit of their business, and their vehicles (S,X,3) will be stale at this point. Ao I'm going to say -10% YTY growth here.   \nLet me know what you think and why? ", "score": 1, "replies": [{"body": "For revenue I see the following numbers for Model 3.\n\nQ4 2018 - average Model 3's per week 5,000 average margin - 20% of 50,000 =  650M\n\nQ1 2019 - average Model 3s per week 6,500 average margin - 25% of 45,000 = 950M\n\nQ2 2019 - average Model 3s per week 7,000 average margin 25% of 40,000 = 910M\n\nTesla energy income also growing.\n\nAs I have stated previously I don't see any drop off in demand for Tesla EVs  or margin competition until EVs are 95% of the new car market. Which I guess is around 2030-2035. For China Tesla appeals to those who can afford a Tesla which is a minority of the population, but still large enough to grow sales for the next few years. The Chinese government wants to eliminate all new ICE sales in China as fast as possible. (Probably 2030).\n\nEurope is similar Tesla appeals to a minority of buyers but again plenty of ICE sales that can and will be displaced.\n\n&#x200B;\n\nBy 2020 Model 3 production to be 10K to 14K cars week - average margin 25% of 38,000.\n\nTesla energy income to be 4-6 X what it is now.\n\nTelsa Semi produced in small numbers at Nevada GF1.\n\nModel Y build location known and building works in progress but no plant and equipment.\n\nModel S/X refreshed with significance improvements and  cost savings on production, slightly increased competition and some pressure on margin but still selling 2K cars per week.\n\nModel 3 product matured with some additional costs savings and gradual improvements still being made, competition starting to belatedly appear but no pressure on sales volumes or margins, the issues are still production, delivery, servicing  and supercharging.\n\n&#x200B;\n\nAt this stage we don't know who is right, but it is fine to have very different opinions.\n\n&#x200B;\n\n&#x200B;", "score": 2, "replies": []}]}]}]}, {"body": "What?\n\n\n>Over the next year they'll hit peak production with their current capacity\n\n\nThey're not even close to their peak capacity at Giga.  Whatever you think about solar stuff, at least Powerwalls are a real business.  All they need to start huge Powerwall ramp is more battery cells.\n\n\n>produce a trivial amount of profit\n\n\nIf they completely stop future development like you're suggesting, they should have tons of profit.  Obviously not desirable.\n\n\n>work through their real backlog\n\n\nIn two years.\n\n\n>and then everyone will realize there's nothing else in the pipeline.\n\n\nExcept the most compelling (price to performance) production car made in decades (Roadster), the most compelling Semi-truck made in decades, and two vehicles (pick up/Y) that have potential to outsell the Model 3, which so far has had the fastest growing sales for a mass production car in basically the history of cars.  This is completely ignoring energy and FSD.\n\n\n>Keep making SX3 at a steady state, producing profits that don't even come close to justifying a $50b equity value.\n\n\nAnd how do you know that?  Given GM is a trash company tied with promising Cruise Automation and is worth >8 P/E, who's to say Tesla isn't worth more than that?  They can easily reach 50B valuation with a high P/E.\n\n\n>Try to turn Fremont into the Y factory and give up SX3 production for another painfully slow model Y ramp.\n\n\nThat would be utter nonsense.\n\n\n>Twiddle their thumbs for 2-3 years to build a factory for Model Y, but with what money?\n\n\nThe money they're getting from local foreign debt.  Meanwhile they have enough backlog for 2 years of Model 3 supply to tide them over.\n\n\n>competitive threats\n\n\nAs long as LG Chem is the only company that can produce a competitive battery pack/pouch, there is no competitive threat.  Competitive threats will come only when NMC 811 is mass producible in a pouch format by multiple vendors.  So maybe 2020?\n\n\n>Uncle Sam's $7500/car subsidy is winding down. \n\n\nConcede this point.  Money talks.  Though Tesla has a bigger advantage than $7,500 right now.  This is more of a concern in 2020 if Tesla hasn't maintained the gap.\n\n\n>And Tesla has to repay big debt maturities over the next year.\n\n\nThey also have a sizable cash position and LOCs for liquidity.  If Tesla can reach FCF for Q4, this isn't a concern.\n\n\n>Tesla is caught with its pants down unless Elon can convince Wall St to give Tesla a big equity injection for Y.\n\n\nDon't need it.", "score": 0, "replies": []}]}]}]}, {"body": "Be wary of activists drastically changing the trade on you. Tesla is primed for someone to try and move in and push a narrative like this.  \n\nThis could be the start of a few activists call for changes. It’s often times hard to predict.\n\nThis looks very different than the normal shorts stories we’ve seen so far.\n\nhttps://www.investopedia.com/terms/a/activist-investor.asp\n\nI can see more people rallying behind a message like this. I know this will be an unpopular opinion here. I guess my point is just watch out for this, and don’t discredit news like this. Institutions might keep pushing the mis-management angle. It’ll get a lot more media play then the usual shorts sellers get.", "score": 10, "replies": [{"body": "Well it’s interesting that the bear narrative is switching over to “Elon has mental issues”... it’s almost as if all the other Bear narratives are falling apart and this is all they have left. \n\nI just watched Iron Man a couple days ago.. everyone thought he was mentally unstable too ;)", "score": 6, "replies": [{"body": "If you’re investment thesis is “I watched Iron man”, please consider index funds. ", "score": -1, "replies": [{"body": "Yup you got me. That is the full extent of my investment thesis.", "score": 6, "replies": [{"body": "Mine is \"I watched the Joker in The Dark Knight\" ;)\n\n[Love this scene](https://www.youtube.com/watch?v=HIcIIBTJA6o).\n\nWhile I'm obviously joking I've been thinking of this scene with all the drama around Elon/Tesla lately. Both Tesla/Elon aren't acting according 'to plan', like every other company/CEO, hence all drama.", "score": 4, "replies": []}]}, {"body": "*your*", "score": 1, "replies": []}]}]}]}, {"body": "Reading between the lines, he was morally offended by Musk puffing on that blunt.", "score": 5, "replies": [{"body": "Great point. I can imagine a lot of these reactions to Elon’s behavior proceed directly from feelings of moral superiority.", "score": 2, "replies": []}, {"body": "Dude went to Berkeley And worked for Lehman brothers when it fell. Sure he’s done plenty of coke and smoked plenty of blunts. Hypocrisy at its best.", "score": 3, "replies": [{"body": "People can be weird about public vs private behavior, and live completely divided lives.", "score": 1, "replies": []}, {"body": "He's Indian, so maybe not. Unless.. Is he an ABCD?", "score": 0, "replies": []}]}, {"body": "To be fair, puffing on a blunt with your friends at home is different from doing shots of whiskey and plastering links to it on your LinkedIn page the day before your final round interviews at Deutschebank\n\nIf there’s any moral outrage it’s not the behavior, it’s the timing.", "score": 2, "replies": []}]}, {"body": "If fidelity or black rock or any other large owner decides this trade isn’t worth it, you can be freight trained quick.\n\nMusk is a risk, one that people may not want to have to explain to investors.", "score": 5, "replies": [{"body": "Musk is the #1 asset of the company - for now. One day - 15-20 years from now they can have they’re Tim Cook style switch", "score": 9, "replies": [{"body": "Ya but the problem is that if Musk is the #1 asset, it might not be good enough to support the $400 price targets. Remember that the explosive rise was all predicated on 10,000 Model 3s rolling off every week from a factory where robots would build robots and air friction would be the constraining factor and then they’d get sold for $35,000. And then plowing all of that cashflow into building capacity for the Model Y.\n\nNone of those things are happening. \n\nI think some of it is still possible but Tesla needs to transition from the “innovation” stage to the “reliably churning out 500,000 high quality cars per year at a price most people can afford” stage, and Musk has yet to show that he has the qualities necessary to make that transition happen reliably.\n\nI’d say Musk should stay on as a visionary or with the title of “chief engineer” but he needs to bring people in who really know how to make cars in mass numbers using well-established processes that can be confidently relied upon by investors.", "score": 7, "replies": [{"body": "I don’t think anyone reasonably thought any of those things would be happening by now, I certainly didn’t. All long term aspirations.\n\nImpossible to say what will justify a $400 price. The price is the price, right now it’s $274.30 and no amount of arguing will change that. To me it doesn’t seem like it’s going to take a whole lot to get to $400, especially since most bulls have a price target of $4000.", "score": 4, "replies": [{"body": "They may be long term aspirations but Tesla didn’t present them that way, and the bankers who were lending the money were doing so on the basis that it was “3 months probably, 6 months definitely.”\n\nNone of this would be an issue if Tesla didn’t need to borrow money. As long as they can run their innovation track using their own cashflow like Amazon did (or keep convincing new investors to take equity stakes while convincing existing investors to accept dilution), then I would definitely be on board with Tesla’s growth trajectory.\n\nThe problem is that Tesla is using other people’s money. Lenders’ money. And lenders do not f**k around. If there’s a set of people who can bring this whole thing crashing down, it’s not the shorts. It’s the lenders, and based on bond values they aren’t appearing to be too generous these days. ", "score": 3, "replies": [{"body": "Elon did say that they expect to be cash flow positive in perpetuity on the last earnings call. If you think he’s lying there’s nothing else to say, I don’t. So I’m not worried, they’ll refinance near term loans if they need to. It’s not a long term issue.", "score": 4, "replies": [{"body": "“Lying”? I don’t think he’s lying. Lying presumes that he believes something to be false and presents it as true.\n\nNo, I don’t think he’s lying.\n\nI also don’t think he was lying about the $35,000 Model 3, either. I think he fully expected that to happen. But that doesn’t mean that it’s here, either.\n\nMusk says he expects to be cashflow positive. We will soon find out if he was accurate.", "score": 5, "replies": []}, {"body": "Just saying... this has been said a few times.\n\n> 2015 Q4 letter (includes full-year guidance):\n\n> We expect to generate positive net cash flow and achieve non-GAAP profitability for the full-year 2016. Thus our cash balance at the end of 2016 should increase from the year end 2015 level. We plan to fund about $1.5 billion in capital expenditures without accessing any outside capital other than our existing sources that support our leasing and finished goods inventory. We plan to invest in equipment to support cell production at the Gigafactory, begin installation of Model 3 vehicle production machinery, open about 80 retail locations and service centers, and energize about 300 new Supercharger locations.\n\nhttp://files.shareholder.com/downloads/ABEA-4CW8X0/1490591419x0x874449/945B9CF5-86DA-4C35-B03C-4892824F058D/Q4_15_Tesla_Update_Letter.pdf", "score": 4, "replies": []}]}]}]}, {"body": ">  he needs to bring people in who really know how to make cars in mass numbers using well-established processes\n\n\"Well-established processes\" are the complete opposite of innovation.\n\nI agree that there will be a time where \"well-established processes\" are needed, but not before the phase of exponential growth is over.\n\nWhen Tesla is churning a few millions EV a year, then exponential growth can stop. At that point Elon and high speed Tesla executives will no longer be needed and it will be time to optimize for profits instead of growth.  By then Tesla will be ridiculously profitable.", "score": 4, "replies": [{"body": "Well pretty soon they’re gonna have to choose between innovation and paying down their debts.  10,000 cars per week and $35,000 per car was supposed to be a year ago, and they’re not even close.\n\nI’m not saying that they won’t ever get there, but the question is whether or not they get there in time. Part of the avoiding default on the big debt payment due next spring requires them to have enough unrestricted cash on hand to pay the debt in full even if they have the option to pay with stock.\n\nThe growth trajectory works as a business model as long as you can keep the lenders at bay. Based on the shift in Tesla bond pricing as well as bullish analysts finally capitulating, it’s looking more and more like the banks are ready to close off the spigot.\n\nTo me the banks are far more compelling than how amazing the car is, cuz once the banks turn their backs on Tesla, there is no more innovation.", "score": 8, "replies": [{"body": ">Well pretty soon they’re gonna have to choose between innovation and paying down their debts. 10,000 cars per week and $35,000 per car was supposed to be a year ago, and they’re not even close.\n\nI certainly admit that the delay really hurt them. If 5k cars were achieved in 2017, then they would've have been profitable this whole year. That was two full quarters with losses instead of profits. Certainly sad. That also delayed the 10k goal significantly. At 10k Model 3 a week banks wouldn't matter. \n\nHowever, between the cash on hand and the cash from the next 2  quarters, there should plenty to meet the coming debt.\n\nBTW remember that Chinese banks are opening up for Tesla China Gigafactory.", "score": 2, "replies": [{"body": "I think there is good news in all of this, believe it or not. IMHO, Tesla isn’t going anywhere. The innovation will likely continue and much of Musk’s vision will gradually come into fruition. \n\nBut I think there is at least a reasonable risk that in the process, existing shareholders may take a bloody bath or even even lose everything as new inflows of capital are necessary to keep the paying the upfront costs of innovation and growth.\n\nBack in the early 2000s, miles and miles of fiber optic cable were lain to bring high speed internet connectivity around the world. The vision was compelling: keep innovating and entire worlds of communication could be connected in ways never seen before.\n\nBut many of the initial companies putting in the up front cost of digging and laying the cable went belly-up because the revenue from bringing on new users just couldn’t grow fast enough — at first — to pay the lenders.\n\nThey were right about the vision. \nThey were wrong about the timeline.\n\nEven though many shareholders lost everything, the fiber optic cable didn’t disappear, it was just repossessed by the lenders...who turned around and sold them to new investors to recoup the money they were owed. Those new investors had more time and fewer lenders to answer to, and it didn’t take long for the internet to explode and for many shares to “go to $4000/share”.\n\nThat’s why I don’t think the question about Tesla is about capability. I’d say that given enough time (and resources) Musk could accomplish just about everything he sets his mind to.\n\nThe bigger question for me is not capability. It’s time and resources. Almost anyone interested in investing in Tesla needs to be looking at and scrutinizing the reliability of Musk’s financial forecasts and comparing them to the burning fuse of lenders’ time. \n\nTesla may be right about the vision.\nAre they right about the timeline?\n\nIf they can beat the clock, there is a lot of upside.  But if your analysis stops at taking Musk’s forecasting at face value, then it can get really ugly really fast. \n\nMusk is good at a lot of things, but admittedly one of his weak points is reliably communicating timelines and expectations. Unfortunately, that is where most bankers and lenders are focused on right now. \n\n", "score": 5, "replies": [{"body": "> as new inflows of capital are necessary to keep the paying the upfront costs of innovation and growth.\n\nand they are there in the Model 3. This time next year Tesla will have a lot less debt, be profitable, have a nicer cash cushion and Gigafactory China should be getting started. \n\nAll they have to do is produce cars. By 2020 there will probably be 2 simultaneous Gigafactories being built and Giga1 pumping batteries at maximum rate.\n", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Is he? \n\nI could also call him the largest liability.\n\nNot my view point, but I can see an investor wanting to bring in a boring CEO with a history of manufacturing success. Tesla could spend years refining and building the 3, Y, semi, and roadster.\n\nIs Musk needed to execute that dream now? IDK", "score": 3, "replies": [{"body": "Why would someone with that mindset ever invest in Tesla, they would be a moron. If you’re long Tesla you’re hitching your ride to Elon and you just have to be ready to hold on tight - sometimes the ride gets rough.\n\nIf Elon wasn’t at the helm I would not be invested and I doubt I’m the only one.", "score": 6, "replies": []}]}]}]}, {"body": "Isn't this actually the best time to invest since the stock price hit the 200+ range?  You want to go in when others are fearful.", "score": 1, "replies": []}, {"body": "Are these guys big? Not heard of them before ", "score": 1, "replies": [{"body": "I’ve heard the name before but not familiar. But they are apparently on the top 30:\n\n> After Tuesday’s downgrade, bulls on the stock have become the minority with just 9 analysts recommending buy, 11 recommending a hold, and 12 recommending a sell, according to data compiled by Bloomberg.", "score": 3, "replies": [{"body": "oh, that's not ideal ", "score": 1, "replies": [{"body": "TSLA is one of the most manipulated stocks in the market. Pay no attention to these. Even when they say Buy. ", "score": 2, "replies": []}]}]}, {"body": "Instinet, LLC\n\n(A Wholly Owned Subsidiary of Instinet Holdings Incorporated)\n\nStatement of Financial Condition\n\nMarch 31, 2018\n\n(in thousands)\n\nAssets\n\nCash and cash equivalents $ 8,140\n\nRestricted cash 6,100\n\nCash segregated in compliance with federal regulations 5,000\n\n**Securities borrowed 117,992**\n\nReceivable from broker-dealers and clearing organizations 284,382\n\nReceivable from customers 120,993\n\nTransaction fees and other receivables, net of a $193 allowance 50,662\n\nDeferred tax assets 6,072\n\nReceivable from affiliates 7,015\n\nOther assets 14,564\n\n**Total assets $ 620,920**\n\n\nLiabilities and member’s equity\n\n**Securities loaned $ 36,250**\n\nPayable to broker-dealers and clearing organizations 137,460\n\nPayable to customers 88,354\n\nAccounts payable 44,177\n\nAccrued compensation 41,109\n\nPayable to affiliates 19,989\n\nAccrued expenses and other liabilities 27,839\n\nTotal liabilities 395,178\n\nCommitments and contingent liabilities (See note 8)\n\n**Total member’s equity 225,742**\n\nTotal liabilities and member’s equity $ 620,920 \n\n\nI'll leave the judgement on whether a sub-billion company is big to other people.", "score": 1, "replies": [{"body": "Huh. That is tiny\n\nEdit: I stand corrected by u/jajajinxo ! \nTotal assets are $620B. \nSuch a novice mistake :(\n\nEdit of dumb edit: nope actually $620M ... thanks guys...", "score": 2, "replies": [{"body": "If it's thousands then it's 620,920,000 so 620M", "score": 2, "replies": []}, {"body": "(In thousands) so those are billions of dollars ", "score": 0, "replies": [{"body": "XXX,XXX in thousands is XXX,XXX,XXX. That's not billions.", "score": 1, "replies": []}]}]}, {"body": "cool username. ", "score": 1, "replies": [{"body": "Thanks.", "score": 0, "replies": []}, {"body": "Actually it’s not.  The user seems cooler than his user name suggests which is why he hasn’t been banned.  I value his contributions to the discussion but user name is not helpful.", "score": 0, "replies": []}]}]}]}]}
{"title": "$MSFT making my micro hard", "selftext": "", "id": "9ey2pw", "created_utc": 1536676427.0, "score": 273, "upvote_ratio": 0.97, "num_comments": 62, "comments": [{"body": "Gain: $154,418.81\n\nMarket value: $655,325\n\nInitial investment: $500.906.19\n\n30.82% return off of that 500k. Well done!", "score": 131, "replies": [{"body": "I also sold 300 Oct and 300 Sep calls before this pic so it has been a good day :)", "score": 68, "replies": [{"body": "you made more in 1 day than i did an entire year. grats!", "score": 56, "replies": [{"body": "I also had two 6 figures losing days last week but those aren't as fun.", "score": 89, "replies": [{"body": "Lol - what kind of portfolio size are you playing with? $5-10M? can keep is vague ", "score": 34, "replies": [{"body": "Nowhere close to that. I just bet big :)", "score": 68, "replies": [{"body": "You, sir, may have a micro but your ballz are mega.", "score": 70, "replies": []}, {"body": "Mr huge balls...\n\nI thought I was doing well making 2 grand on SBUX this week. Got a ways to go still", "score": 14, "replies": [{"body": "You did do well making 2k dont diminish your achievements by comparing to others. ", "score": 21, "replies": []}, {"body": "Remember from the Joe Rogan podcast “Comparison is the thief of joy.” ", "score": 5, "replies": []}]}, {"body": "*Big Dick Faggot..*\n\nYou legit fam", "score": 7, "replies": []}, {"body": "You speak to me :) Be well Batman", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Scared money don't make money. Well done sir. Now close your positions and abandon the what ifs; words of the devil ", "score": 3, "replies": []}]}, {"body": "Nice play and all but I made $100 today", "score": 108, "replies": [{"body": "I'm up $180 today but down $700 in total. I just focus on the green and zone out the red.", "score": 24, "replies": [{"body": "Im up $20 today but down $300 in total, am I doing it right too?", "score": 13, "replies": [{"body": "https://i.imgur.com/9IZZAWs.gif", "score": 6, "replies": []}, {"body": "I'm down $320 total from -$400 last week and +$80 this week, both on AMD $29c. \n\nOne didn't clear and one I sold ASAP in the green just to be done with AMD once and for all. No more Su Bae siren song for me, no siree.", "score": 1, "replies": []}]}, {"body": "I know your pain, down 1.3k still due to Calling IQ and HUYA", "score": 1, "replies": []}]}]}, {"body": "Gawd damn +$100k\n\nWhat made you pick today?", "score": 22, "replies": [{"body": "I actually picked last Wednesday after the dip. Finally seeing a bit of recovery.", "score": 28, "replies": []}]}, {"body": "[deleted]", "score": 22, "replies": [{"body": "As is tradition", "score": 9, "replies": []}]}, {"body": "Me:  I should just put everything in MSFT.\n\nAlso Me:  Oh, TWTR!\n\n&#x200B;\n\nThanks for reminding Me that Also Me is an idiot.", "score": 18, "replies": [{"body": "I will never understand investing in social media as a good strategy. But that said the only social media I use is Reddit (and I would never invest in Reddit)", "score": 7, "replies": [{"body": "I tend to agree.  However, short term they are companies and people apparently want to use them.  TWTR's chart looks good, the number seem fine, I think it will regain a lot of value in the relative short term.  I wouldn't buy stock, but I have calls.\n\nYou don't have to buy yoga pants to invest in LULU.", "score": 5, "replies": [{"body": "Thank God", "score": 3, "replies": [{"body": "I'm wearing LULU shorts right now.  My legs... they look worth some DD in them according to my friends.", "score": 2, "replies": []}]}]}]}, {"body": "twtr is an ok buy right now. i can see it going back to 36.", "score": 1, "replies": [{"body": "I can see it too.  TWTR apparently can't.\n\nIt's fine, it's a 12/21 35c; it just went down right after I bought it.  Selling covered calls on it until it recovers.", "score": 1, "replies": []}]}]}, {"body": "smh MSFT and AMD steal all the milk, and little MU gets none.", "score": 11, "replies": [{"body": "So milk bad for MU too?", "score": 5, "replies": [{"body": "Haven't you been paying attention? Everything is bad for MU", "score": 3, "replies": []}]}]}, {"body": "Congrats man. Just out of curiosity, when did you entered those positions?", "score": 7, "replies": [{"body": "He said last Wednesday", "score": 3, "replies": []}]}, {"body": "I'm in for Nov 16 $115 Cs. Please tell me you're holding so I can continue feeling confident going into ER next month", "score": 6, "replies": [{"body": "I'm not op but 120 January calls felt good.", "score": 6, "replies": [{"body": "I've got about 1k sitting on December and January calls. They feel very good.", "score": 3, "replies": []}]}]}, {"body": "Please tell me the rally will continue.", "score": 5, "replies": [{"body": "The rally will continue.", "score": 18, "replies": [{"body": "arigatou", "score": 5, "replies": []}]}]}, {"body": "A king among mere tendies ", "score": 4, "replies": []}, {"body": "Nice flex champ! Holding to exercise or exit at 50%?", "score": 3, "replies": []}, {"body": "That’s awesome dude. I’m too pussy to risk that much money.", "score": 3, "replies": []}, {"body": "Now you can buy mu faggies", "score": 3, "replies": []}, {"body": "I timed the bottom almost perfectly the other day at 107.50. But I bought shares. Fuck me.", "score": 3, "replies": []}, {"body": "Random question: Who are you trading with? That interface looks amazing", "score": 2, "replies": [{"body": "E-trade", "score": 1, "replies": []}]}, {"body": "I sold.my MSFT call spreads before 10AM this morning, you're welcome.", "score": 2, "replies": []}, {"body": "i love how a 1.7% increase in a stock adds hundreds of thousands of dollars to this subs portfolios. god bless options.", "score": 2, "replies": [{"body": "Did you miss the down 30% when AMZN is down 0.5% post?", "score": 1, "replies": [{"body": "didn't see the post but experienced it myself first hand. it still hurts", "score": 1, "replies": []}]}]}, {"body": "I also have a 10/18 @110 call, but just one. Don you think msft will pass the 112 price? I dont know what is a realistic expectstion for me to sell it. At 100% profit? 120%, what are your plans?", "score": 1, "replies": [{"body": "I sell little by little over time. I don't like to give advice but I heard a good point here before - If you would buy the option at the current price keep holding, if not, sell.", "score": 6, "replies": []}]}, {"body": "which broker are you using?", "score": 1, "replies": [{"body": "E*TRADE ", "score": 2, "replies": []}, {"body": "It looks like Fidelity", "score": 0, "replies": []}]}, {"body": "getting that micro penis hard af ", "score": 1, "replies": []}, {"body": "When did you buy these?", "score": 1, "replies": []}, {"body": "Fuck you dude", "score": -7, "replies": []}]}
