{"title": "How is everyone feeling about Amazon, any action with the 20:1 split?", "selftext": "", "id": "v1ulvq", "created_utc": 1654015674.0, "score": 112, "upvote_ratio": 0.89, "num_comments": 63, "comments": [{"body": "[deleted]", "score": 78, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "And 500 million to 10 billion outstanding shares", "score": 5, "replies": []}]}]}, {"body": "Give AMZL credit too. Revenue has double digit growth and they're seeing improving margins over time as they scale, which only makes sense. That will be the real cash cow soon.", "score": 13, "replies": []}, {"body": "It will increase simply because I can afford more 0DTE OTM FD's and that is clearly going to print and make me wealthy", "score": 2, "replies": []}, {"body": "In my contacts there is no broker that offers fractional shares. I don't care about those as i think about the overall cost rather that per share, but a lot of my friends find it too expensive and can't buy AMZN or TSLA because of share price.\n\nWe also don't have 0 fee brokers but that's a story for another time.", "score": 0, "replies": []}, {"body": "that last bit made no sense. you just talked about why amazon is valuable, nothing about why the stock split will change it. \n\nit’s possible the split produces a short term upward movement but it’ll come back down to reflect the market’s best guess of amazon’s value. only really matters if you’re a trader. \n\nalso isn’t AWS unprofitable atm?", "score": -39, "replies": [{"body": "Lol no, AWS prints money.", "score": 30, "replies": [{"body": "true", "score": -3, "replies": []}]}, {"body": "AWS is what keeps the online retail and other projects floating", "score": 2, "replies": []}]}]}, {"body": "AMZN River is 4300 miles\n\n4300/20 is 215\n\nAMZN to 215", "score": 57, "replies": [{"body": "The math checks out. Going all in", "score": 28, "replies": []}, {"body": "This is fool proof mathematics", "score": 7, "replies": []}]}, {"body": "yea get in, stock market isn't the economy its a casino and ppl will pile in on the split", "score": 26, "replies": [{"body": "Guys at my work are to caught up on the Crypto.", "score": 2, "replies": []}]}, {"body": "I like Amazon they deliver my dogs treats and food.", "score": 22, "replies": []}, {"body": "I don't know if this is too off-topic or anecdotal, but my hesitation with Amazon is more of a quality control problem in their core business.   They have increasingly become a pass through for third party sellers of Aliexpress-style products with all-caps brand names that were created in a blender.   (Looking for an OLUOQI watch band?  Look no further!)  And there are tons of reviews from people who claim the products they received are contraband.   Personally, I've been more inclined to buy from Target or other retailers lately.  I think people are going back to Costco in search of deals, too.   I'm holding, but not buying more.", "score": 28, "replies": [{"body": "This is absolutely my experience (and concern).", "score": 8, "replies": []}, {"body": "Yeah fakes and garbage items are my main reason I will buy elsewhere when I can. Amazon has a large quality issue and they don't seem to care. \n\nBest buy has 2 day shipping for free and will have a lot of products at the same price my business is going there. \n\nAmazon is still damn convenient and I use it but they really should step up there game.", "score": 6, "replies": [{"body": "Most of the stuff I've bought from Amazon worked adequately enough considering the price.  Nothing was outright garbage but some things were kind of crappy you get what you pay for though.", "score": 1, "replies": []}]}]}, {"body": "As long as I can get cheap crap I will buy from Amazon.", "score": 37, "replies": [{"body": "The challenge for them is that inflation in wages, freight, and fuel will put downward pressure on their margins, and it’s unclear how long those issues will persist and whether it is already fully priced in. \n\nAnd if we are heading into a prolonged recession, demand will get hit as well.\n\nI like Amazon long term, but I’m not so sure about short or medium term.", "score": 7, "replies": [{"body": "I was wondering how fuel will effect them too, but on the other hand maybe people will buy stuff from them instead of say Walmart so they don’t have to drive and spend money on gas", "score": 3, "replies": [{"body": "That’s possible. All in all, a business model that delivers a bunch of individual items to houses is going to be hit harder by fuel prices than one that sells though “centralized” retail locations. The cost of Amazon’s “free shipping” is just incorporated into the product price and/or cost of prime, or else Amazon and/or the manufactures eat it via lower margins. In reality, it’s a little bit of “all of the above”, and it’s hard to know how exactly the chips will fall with higher fuel prices.\n\nBack to your point… In the end, consumers probably won’t save money by shopping at Amazon instead of Walmart, but they may think they are.", "score": 3, "replies": [{"body": "> shopping at Amazon instead of Walmart\n\nHa, yes, keeping a knee-jerk mindset to \"just go to Amazon for the cheapest price\" is foolish. \nToo many sellers there rely on that attitude with inflated prices. Instead, it's best to include other retailers like Walmart and B&M in your shopping routines.", "score": 1, "replies": []}]}, {"body": "They already have increased prime fee I guess that will cover fuel", "score": 1, "replies": []}]}, {"body": "We are heading into a  recession (IMO) just no idea how long it could last, and with people still recovering from the covid mess I don't see prices going back down. My brother reminded me I said gas will be over $5 a gallon and that was in 2020. Now I'm better off than most and I have been stockpiling food for the last two years and I feel sorry for those who could not. I also give to homeless shelters  but I suspect hard times coming.", "score": -1, "replies": [{"body": "Yeah I don’t see prices going back down either (except perhaps fuel and commodity prices at some point, though not any time soon). To me the question is whether prices keep going up at a similar rate, or if the rate of increase slows.", "score": 4, "replies": []}]}]}]}, {"body": "Added one more share about 2 weeks ago.  Debating to add one more Google or one more Amazon in the next week or two.", "score": 5, "replies": [{"body": "Next week a share of Amazon will be around $120\n\nAlso you’ll have 20 shares for each one you currently have", "score": 2, "replies": []}]}, {"body": "Walmart is the #1 Fortune 500 company with ~$500b in sales while Amazon is the #2 Fortune 500 company with ~$400b in sales. The battle for #1 is already underway. Amazon continues to hit double digit sales growth figures while Walmart struggles with Walmart+ and direct to consumer. Walmart has 0 investment in cloud tech while Amazon competes directly with Azure and Google. Ask yourself:\n\n1. Will Amazon continue to eat Walmart’s market share? Yes. If you’re going to eat a pie you might as well go after the biggest pie. \n\n2. Will Walmart ever catch up with Amazon’s direct to consumer model? Maybe, but I’m guessing unlikely. \n\n3. Will Amazon become the #1 Fortune 500 company? Yes. Trend charts already show that Amazon will surpass Walmart within 5 years.", "score": 4, "replies": []}, {"body": "Buy now, you are still in time, this is going to take off for the summer ......", "score": 7, "replies": []}, {"body": "They can stock split themselves all they want to make themselves look prettier and cheaper for investors but that doesn't solve the underlying issues like supply chain shortages, constant union bad news and company constantly under government scrutiny.", "score": 8, "replies": [{"body": "How are they under government scrutiny? Not trying to challenge you I just haven't heard of it.", "score": 6, "replies": [{"body": "Some politicians like Bernie Sanders or AOC constantly talk about the working conditions at Amazon, how they deserve better pay, and Amazon's success at avoiding taxes.  (I have no political bias when it comes to the stock, these are just a couple of the more famous politicians that often criticize Amazon)", "score": 1, "replies": [{"body": "Literally nothing will come of it", "score": 14, "replies": []}, {"body": "Dems are gonna get slaughtered in the mid-terms. No one will care what the minority in the house has to say about Amazon.", "score": 6, "replies": []}]}]}]}, {"body": "This makes options prices cheaper right?", "score": 2, "replies": []}, {"body": "Staying away for now. They're gonna have several rough quarters.", "score": 7, "replies": [{"body": "Historically if you had bought any major stock before a split (MSFT, NFLX, etc) and held for at least 5 years you are guaranteed money. That’s just the facts.", "score": 12, "replies": [{"body": "Is that a result of the split itself, or perhaps its more so that companies split when things are going quite well.", "score": 8, "replies": []}]}]}, {"body": "I wanted to get In But with supply chain issues and unions. IDK, plus I didn’t rollover my 401k in time….", "score": 3, "replies": []}, {"body": "I’ll buy it at a cheaper price for sure", "score": 2, "replies": []}, {"body": "I've made a few moves trading Amazon since 2019, but I'm holding very few shares after I sold the majority in Nov '21. It may very well get back to 3K by August, but I don't see any strong potential over the next few weeks. I'd suggest allocating no more than 10% of your portfolio. The split will be relative with no substantial gains, and will increase the potential for volatility. This is because new investors will be short and those holding are still largely in the red.", "score": 1, "replies": [{"body": "holding 20 shares from $1,256... I'll keep holding another 10 years.", "score": 12, "replies": [{"body": "That's a good position. Cheapest I ever got AMZN was around $1600 and never held for more than a year. Best wishes with your investments!", "score": 1, "replies": [{"body": "yeah that was January 2018...it's been dead like 2 years now though lol", "score": 1, "replies": []}]}]}]}, {"body": "Dogs hit company. Exploiting workers and being over run since bezos departure. The time to get out was when he did.", "score": -6, "replies": [{"body": "I find amusement with how your comment conflicts with another post in this same thread \n\nhttps://www.reddit.com/r/StockMarket/comments/v1ulvq/how_is_everyone_feeling_about_amazon_any_action/iaojjk8/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3", "score": 1, "replies": []}]}, {"body": "Well it was up over 5% today at one point. I think it is time for it to run.", "score": 0, "replies": []}, {"body": "Amazon latest movement is due to everyone buying the stock with the interest of being short on the stock…. Meaning it was bought to sell today and rest of week and get price back down to $1750-$1780 or so…. Everyone used margin to buy… no one is holding threw the split it will take a steep dive in the months to come", "score": 0, "replies": []}, {"body": "I think the American consumer has had a last hurrah for a year or so", "score": -3, "replies": []}, {"body": "now I'll be able to get some shares lol", "score": 1, "replies": []}, {"body": "If I had the money I’d short Amazon.", "score": 1, "replies": [{"body": "Why?", "score": 1, "replies": [{"body": "Because he had the money", "score": 9, "replies": []}]}]}, {"body": "Bullish", "score": 1, "replies": []}, {"body": "When will the split happen? This Friday?", "score": 1, "replies": []}, {"body": "The NFL deal is huge, especially once the UI overhaul is done.  They’re going to be a big deal in streaming", "score": 1, "replies": []}, {"body": "Amazon is up 20% in the past week from all time lows.", "score": 1, "replies": []}, {"body": "I've been loading up.", "score": 1, "replies": []}]}
{"title": "How do you interpret Warren Buffett's massive investment in oil?", "selftext": "I see a lot of people sounding the alarm on oil stocks, saying things like:\n\n* We're nearing the top and it will drop soon after summer.\n* Demand destruction is coming oil will crash.\n* Renewables will drive oil down in next 2-3 years.\n\nFor people who believe oil is not a good long term hold, how do you interpret Warren Buffet's massive investment in Chevron and Occidental? For example, do you think that:\n\n* He's wrong.\n* He might be investing in the short term and may transition out right around summer peak. \n* He's not bullish in oil perse, but more bullish in specific two companies that are under valued.\n\nI would really like to hear someone who is bearish on oil stocks critique Warren Buffett's investment here. I bought a lot of oil stocks and I'm very interested in contrarian opinions against Buffett's oil position.", "id": "v1jb9o", "created_utc": 1653976046.0, "score": 40, "upvote_ratio": 0.82, "num_comments": 63, "comments": [{"body": "1. Oil isn't going away for a loooooong time. There is no off/on switch for fragile economies heavily dependent on oil. ICE vehicles still need to operate using gasoline. Diesel trucks, which transport goods across the world are needed. Planes don't operate on solar energy. Energy across the world will run on oil and fossil fuels for quite some time longer.\n2. The shale boom in 2014 along with OPEC intentionally sabotaging the prices caused oil prices to plummet. With shale and new fracking technology, United States became one of the largest producers rapidly with large oil reserves. Because shale fracking requires much lower of an upfront cost, many small-time players flooded the industry and thus, flooded the oil market with shale oil which dropped oil barrel prices. This is why you saw the stock performance of oil companies do poorly starting at 2014 and only recently recovering post-COVID.\n3. So #2 caused many oil companies to take huge risks and then have it backfire on them. Oil companies got hasty and thought they could make record profits with the high oil prices in 2014. Once the oil prices plummeted from an oversupply, OPEC sabotaged the oil industry by producing even more oil so they can cause the shale fracking companies to lose money/low profit = will stop capex on oil exploration and projects.\n4. Because of #3, oil companies, post-COVID, are being a lot smarter with their money... meaning, fewer capex and more towards rewarding shareholders. That is why you saw these oil companies increase dividend yields to borderline record highs during late 2020 to early 2021. They wanted to reward shareholders after the horrible 2014-2020 stock performance and since they slowed down on capex, dividends was the best way to do so. BTW, many oil companies (smaller ones) went bankrupt and hundreds of billions of investor money went towards oil projects that weren't the best use of ROI.\n5. Because of #4, what you will see in the future are oil companies wising up knowing that they have very little incentive to ramp up oil projects and as you've stated, with increased government intervention towards renewables and the eventual decline of oil dominance, oil companies will milk as much profit as they can, while they can, as long as they can. BTW, many oil companies are large players in renewable energy as well so let's not forget that.\n6. The political climate towards fossil fuels in America is very poor. Biden and his administration has been heavily against the oil industry, meaning, tighter regulations, more rules and restrictions. This means higher costs... so even if oil companies wanted to produce more, again, the financial incentive and political climate make it unappealing. Why would they spend hundreds of billions for projects that isn't worth the ROI when they can appease investors, reward corporate executives, and use that money to prepare for renewable energy alternatives? Same with the OPEC countries. That is why Biden pleaded with them to increase production and they REFUSED. There is NO incentive for any oil company to do so. NONE.", "score": 86, "replies": [{"body": "I see we both saw the Wendover video.", "score": 14, "replies": []}, {"body": "Also people think retail can just copy Buffett trades but that ain’t how it works. He doesn’t check his RH from the shitter every morning nor does he watch every tick of dogshit spacs. \n\nHis investments are offered at a lower price and with many terms and conditions. You can see his deals with Bank of America in 2008/09 and with Occidental petroleum during Covid not too long ago. \n\nHe essentially bank rolls massive corporations and gets it on his terms and will almost always make a profit.", "score": 3, "replies": [{"body": "This needs to be higher.  Retail doesn't get oftered the same terms he does.", "score": 3, "replies": []}, {"body": "Still, the Buffett's direction is right usually.", "score": 1, "replies": []}]}, {"body": "Great post! What sites/newsletters can a retail investor follow to learn more about the oil industry and current trends? I want to learn more. Thanks.", "score": 1, "replies": [{"body": "Oil industry is largely supply and demand which of course, is manipulated by OPEC and other countries who have nationalized their oil industry. So if the prices are high, just know it's because they expect demand to outpace the supply. So with possible talks of even more sanctions on Russia's oil, that means you have fewer global supply of oil available which means more people competing against one another to buy limited oil on the market.\n\nCurrent trends, you can just follow some stock apps. Almost all of them will mention something relating to oil if there is a drastic event. [Dailyfx.com](https://Dailyfx.com) is pretty nice to use.", "score": 8, "replies": [{"body": "Thanks! I signed up!", "score": 1, "replies": [{"body": "oilprice.com and Josh Young, HFI Research, Doomberg on twitter, and Open Research and crude chronicles on substack are for the starters.", "score": 2, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}]}]}, {"body": "Canadian energy is taking a large roll in NA energy.  I subscribe to the BOE report, six days a week energy news\n\n* Forward this e-mail to anyone who can use the BOE Report \n\n* Sign up to receive this daily e-mail here: https://boereport.com/daily-digest-email/\n\nI have bought a few companies they wrote about.  They highlight great green initiatives and carbon capture too.  You can support companies looking to be carbon neutral", "score": 4, "replies": [{"body": "Great, thanks! Just subscribed!", "score": 1, "replies": []}]}]}, {"body": "The bribes have ended, so oil companies have returned to price gouging and doing as they please, like selling our oil overseas.  We are about the most incompetent nation when it comes to controlling our oil, we throw billions at these companies and they treat it like a slush fund.  We need to crack down on them hard, this is critical infrastructure and they have been treated as VIPs too long.", "score": -6, "replies": []}]}, {"body": "[deleted]", "score": 28, "replies": [{"body": "uhm, you do realize Berkshire keep buying oil stocks up to this quarter right?\n\nthis is not 18 months ago purchase, this is few month ago (heck maybe he keep buying up to this day).", "score": 15, "replies": [{"body": "I bought more today.  I will buy more when I can.  This is not a sit and wait, this is active investing.  There is no solution to the energy crisis, only more interruptions.  Just adding to my positions.", "score": 4, "replies": []}, {"body": "Most of the gains happened from January for many oil stocks (oxy, ctra). I'd be surprised if he's still buying now. It should still go strong this year at least, but people talking about the next decade must be delusional.", "score": 1, "replies": []}]}]}, {"body": ">We're nearing the top and it will drop soon after summer.\n\nWe had a decade where capex was substantially lower than required for our world's population and the rise of energy usage in emerging countries like South East Asia, India and Africa.\n\nMaybe it will drop, but I think oil is in a decent position the next decade. Given that oil performs very well in inflationary environments, it is a good protection.\n\n&#x200B;\n\n>Demand destruction is coming oil will crash.\n\nLook at the demand destruction of the last few recessions. Those were minuscule. If we have a big demand destruction, the price of the stocks would probably be the least of your worries.\n\n>Renewables will drive oil down in next 2-3 years.\n\nNo. Cheap oil drove down the price of renewables. There is a number called Energy Return on Energy Investment. So what proportion do you get out of your energy invested. These numbers are not great for most renewables (hydro is one of the best tho).", "score": 23, "replies": [{"body": "Hydro is great,  it there’s huge support for getting rid of all of it from environmentalists. I think here in WA, we’ve torn down five dams since I started following this ridiculous thing.", "score": 7, "replies": [{"body": "Sadly most environmentalists don't think about the consequences. YOu can't have no oil, no hydro, no wind (birds and insects), no nuclear, no coal and still have a good living standard.", "score": 17, "replies": [{"body": "We are protecting the rare dodo birds meanwhile humans are at risk of freezing to death and going extinct instead due to the energy crisis.", "score": 1, "replies": []}]}]}]}, {"body": "Oil stocks aren't exactually expensive and the upside could potentially be very large depending on how geopolitical events play out. It's also likely that oil stocks will act as a fairly decent hedge against inflation and any potential oil price driven recession.\n\nBuffett has stated that he's not trying to achieve 50% YoY returns anymore, but would like BRK to simply beat the S&P500 with less volatility. Given the low-risk and average to high return potential of oil stocks it's kind of obvious why they made an attractive investment for BRK.\n\nI'm not sure I'd read it as the massively bullish signal some have. This is probably more just Buffett buying fairly valued companies with good risk/reward profiles, and hedging his portfolio against risks to weather whatever might come over the coming months and years.", "score": 8, "replies": []}, {"body": "Warren Buffett has two chosen spheres of specialization: Resource manufacturing and insurance. Both of which have wonderful cashflow production and he can buy cashflows on the cheap. He bought Occidental at a super super low point and it will produce a lot of cash each year to Buffett that he can use in other buying opportunities well into the future. \n\nAt the end of the day, if you can buy a large enough chunk of a good company, with good management, at a low enough PE, you'll make money in the long run because the company is producing enough cash to pay back your initial investment regardless of what the market does.", "score": 9, "replies": [{"body": "This. Other commenters are missing the point - Buffett didn't invest \"in oil\", he invested in a specific company for reasons outside of the momentary product price. The decision is based on Occidental's particular situation and outlook.", "score": 4, "replies": []}]}, {"body": "If oil prices continue to stay high which they most likely will till there's a supply capacity relief from new investing/capex then a lot of the oil stocks will have a free cash flow of 10-20% of market cap.  \n\nWith share buy backs one can assume that the 10-20% of free cash flow can be sustainable even if oil prices decrease to 80s range in a year or two.", "score": 11, "replies": []}, {"body": "Occidental $60b market cap…. Now they are not going bankruptcy and paying down that debt…last quarter $3b free cash flow, per year $12b free cash flow.\n\n12b / 60b = 20% price to free cash flow. Look at all Buffet investment… high free cash flow ratio", "score": 4, "replies": []}, {"body": "One thing to remember is that Warren Buffett is no messiah, nor is he a fortune teller. He is often wrong. As long as he is right more often than he is wrong, he is successful.\n\nI remember last year when he sold Suncor (a stock I hold) I got a little nervous. He didn't see the upside that I did, and he was wrong. He sold under 20 and it's now above 40.\n\nIt's just an example, but it's a good one I think. Don't worry too much about what others are doing.", "score": 8, "replies": []}, {"body": "So listen to warren Buffett or some rando on Reddit", "score": 3, "replies": []}, {"body": "Its not just fuel that makes an oil company money. They make money from downstream products the turn the crude into. They are also currently best positioned to take whatever we figure out is the next best renewable chemical feedstock and refine that. I interpret Warren Buffet's investment as his belief that these oil companies are capable of making more money from downstream processes even as their upstream revenue dries up.\n\nhttps://www.investopedia.com/how-exxonmobil-makes-money-5116766\n\nhttps://www.trefis.com/data/companies/CVX/no-login-required/aYgCXHMX/Chevron-Revenues-How-Does-Chevron-Make-Money-\n\nhttps://www.investopedia.com/terms/d/downstream.asp", "score": 2, "replies": []}, {"body": "I disagree with all 3 comemntaries. Not able to see an end to Russian oil export.  Especially gas is between 6-7 dollars needing clean gas to burn here. Until there is a massive renewables  on the road I suspect the renewable car, charge station will continue to be depressed.  Granted there will be more eVs on the road next 10 years, there will be even more IC engine cars. \n\nBuffert is not interested in HOARDING crude. Just companies that are well managed.", "score": 2, "replies": []}, {"body": "Oil cycles are not short. The supply boom that started in 2014 depressed oil prices for 6 years. The supply shock we are now experiencing will last at least until we get a new President in the US and then a few years after that before any changes actually lead to more production. \n\nThere are oil companies trading at 2-3x free cash flow right now even after doubling. They can easily double again. $OAS is one example. The merger with Whiting is going to be a wonderful outcome for shareholders.", "score": 2, "replies": []}, {"body": "It's a pretty safe bet for the next year.  The price of oil continues to go up and these companies are offering bigger and bigger dividends.  The outlook for western oil companies is also looking good as they're diversifying from oil but also buying up a larger share of the whole oil pie.", "score": 2, "replies": []}, {"body": "Buffett buys when the price is right and the company is good. that's it. so he thought the price was right and the companies were worth buying. \n\n>Renewables will drive oil down in next 2-3 years. \n\nrenewables are nowhere near that level of adaptation. try 20-30 years for any significant dent in the need for oil. half the top 10 companies globally by earnings are oil related. https://companiesmarketcap.com/most-profitable-companies/ Nvidia is less profitable by gross numbers than Canadian Natural Resources, an oil company you probably never heard of. \n\n>For people who believe oil is not a good long term hold\n\nthe premise is flawed. oil is a long-term hold. oil is going to be critical for decades if not centuries. it's delusional fairy-tale nonsense to think renewables are going to destroy the need for oil anytime soon.", "score": 2, "replies": []}, {"body": "You need to remember that BRK has more assess to data than most people allowing to spot trends before hand.   He already own Occidental, but his knowledge probably is enhanced by his ownership position in Pilot Flying J, Lubrizol, Benjamin Moore.", "score": 2, "replies": []}, {"body": "Oil companies have shown that they can gouge prices and nothing will happen to them, even when the price per barrell goes down. So they'll continue to do so.\n\nOil is the only \"safe\" place in the market right now.", "score": 1, "replies": [{"body": "Ahhh.  The conspiracy theorist's view of oil prices.", "score": 1, "replies": [{"body": "There's no conspiracy behind companies charging a price they think they can get away with. That is literally how this system works.", "score": 3, "replies": []}]}]}, {"body": "I've been buying oil since the mid 60s and that was my reasoning:\n\n-Shale overestimates\n\n-Russian sanctions are here to stay\n\n-The low demand because of covid makes it a nice entry point, implying that the pandemic is reaching to an end. Then you have this fixed output that OPEC set themselves back when it was negative and I thought back then they won't increase it even if demand skyrockets(which I was right on that one) \n\n-Oil is a commodity which tend to perform well in bear markets. \n\n-Since I believe that humans are inherently lazy by nature, I doubt all those drilling permits will get used any time soon. And supply chain issues will make drilling really hard.", "score": 1, "replies": []}, {"body": "I wondered about this too. I don’t think its his strategy to hold for a short term but I also dont see oil/energy getting higher than it is now (maybe it might reach $150 max). If demand destruction occurs, were gonna see it dip a huge %. \n\nIn short, no idea why he’s gone HAM on these stocks. I would have assumed he would go short on them if anything.", "score": 0, "replies": [{"body": "Energy stocks will keep running higher all year.", "score": 8, "replies": [{"body": "Fucken hope not. Can’t afford to drive out as it is. Im thinking other consumers will be at a breaking point before they flat out can’t afford to drive far", "score": 1, "replies": [{"body": "I spend $40 a week on gas. Maybe get a bike?", "score": -4, "replies": [{"body": "I’ve been taking public transport more often. No need to find parking, paying for it and paying tolls during days out. \n\nTaking a bike wouldn’t be possible. Got a kid and places are way too far out.", "score": 6, "replies": []}, {"body": "Are you mentally challenged? Not everyone lives close enough to their workplace to make biking feasible.\n\nAnd if you mean a motorbike, those are death traps.", "score": 6, "replies": [{"body": "I live 5 minutes from where I work.", "score": -7, "replies": [{"body": "Not everything is about you", "score": 7, "replies": []}]}]}]}]}]}, {"body": "Buffett is a dividend guy. He gets a ton of free cash flow from his other businesses like auto insurance and throws it in to companies like Chevron which returns over 3% annually. 3% of 26 billion = $760 million/ year with no need to sell any shares. \n\nPeople should realize that even if oil falls in the short term, Buffett is doing just fine. He can keep using that constant stream of free cash to buy more shares even at all time highs. \n\nThis is also why people shouldn’t necessarily follow his trades. He could take some profits or he could just keep it for the dividends", "score": 2, "replies": []}]}, {"body": "Smart for 2021-2022 and maybe 2023 but the  get out and stay out.  If not for Putin and his war, oil would be $50 a barrel lower.", "score": 0, "replies": [{"body": "I looked up the chart and this guy is correct. Pre pandemic oil was like at best $60.", "score": 0, "replies": [{"body": "We had a big glut of oil before covid, then shutdowns and no demand so many oil-gas companies went out of business or close to it.  Now it is the opposite, extreme gouging and deliberate shortages. But back in 2008 we had both high prices and plenty of supply. That was because two GOP oilmen were in the White House. The GOP is all for gas gouging because they all get paid by the oil cartels.   Putin is now the #1 problem by far, without Putin we'd be at $75 a barrel instead of $120.", "score": -1, "replies": []}]}]}, {"body": "He late to the game. He should know better. It might stay bid but the demand is going drop cause if $5 per gallon gas people are going cut back", "score": 0, "replies": []}, {"body": "Oil has been down for over a decade.  We have started a 5 year run and I think everyone might will double their money.  If you look to natural gas could 3x or 4x return. \n\nThere is a political party that wants prices to stay high, which only adds to the potential of huge returns.\n\nOn the flip side, Rolls-Royce has the ability to develop SMRs- small nuclear power reactors.  \n\nStates have also started looking putting them in use because they have zero emission and qualify for federal green tax dollars. \n\nI think in 20 years, SMRs will be in Red states.", "score": 0, "replies": []}, {"body": "Old fart won’t be here for when Florida is swallowed by the ocean - he’s an establishment Democrat", "score": 0, "replies": []}, {"body": "imagine being one of the richest dudes on the planet, having the luxury and power to dictate where human resources are allocated to, old and probably dying in a few years, and you decide to invest heavily into an industry that will [undoubtedly](https://en.wikipedia.org/wiki/Environmental_impact_of_the_petroleum_industry) lead to the destruction of humankind and the environment.", "score": -3, "replies": [{"body": "I am invested in oil because of the infantile beliefs of people like this.  \\^\\^\\^  Their lack of understanding of how world economic development has relied on oil plus their flatearther-like rejection of basic laws of economics pretty much guarantees the transition to renewables will be accompanied by sky high oil prices.  I am making bank off their stupidity.", "score": 3, "replies": []}]}, {"body": "Gas powered vehicles will be banned by 2035 the way that things are trending right now. \n\nOil is decent short term place to put your money, absolutely god awful long term. Very good chance you’re buying at the absolute top it’s ever going to be in history going forward.", "score": -1, "replies": []}, {"body": "RemindMe! 6 months", "score": 1, "replies": [{"body": "I will be messaging you in 6 months on [**2022-11-30 11:13:56 UTC**](http://www.wolframalpha.com/input/?i=2022-11-30%2011:13:56%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/v1jb9o/how_do_you_interpret_warren_buffetts_massive/ianenmd/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fv1jb9o%2Fhow_do_you_interpret_warren_buffetts_massive%2Fianenmd%2F%5D%0A%0ARemindMe%21%202022-11-30%2011%3A13%3A56%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20v1jb9o)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "I think Buffet is just aware that the current situation realistically shouldn't just be a flash crash with an ensuing bullrun, but that it should be a drawn out downtrend, risk of recession is still very high, and he managed to pick up good companies from a sector expected to do well at a reasonable price.\n\nAnd even if he was wrong about the current situation and the market went on to be irrational and insane again, it's not like oil is gonna go away within a year and it's not likely that the world will just trust Russia and lean on their exports heavily again as if nothing ever happened in a couple of months.", "score": 1, "replies": []}, {"body": "I'd trust the goat", "score": 1, "replies": []}, {"body": "Makes me feel like I shouldn't have sold all my oil stocks when they started dropping", "score": 1, "replies": []}]}
{"title": "More signs that a major shift in the economic narrative could be underway", "selftext": ">There’s more evidence that the economic narrative could be [undergoing a major shift](https://www.tker.co/p/inventories-delivery-times-labor-shortage-change).  \n>  \n>For months, we’ve been living in an economy in which [strong demand has been met with lagging supply, causing inflation inflation to surge](https://www.tker.co/p/complicated-state-of-markets-economy). We now appear to be shifting to a phase where demand growth is cooling and supply chains are easing, which should cause inflation to come down.  \n>  \n>According to Census Bureau data [released Wednesday](https://twitter.com/SamRo/status/1529441786258927616), orders for nondefense capital goods excluding aircraft — a.k.a. [core capex](https://www.tker.co/p/durable-goods-record-core-capex-orders-backlog) or business investment — climbed 0.3% to a record $73.1 billion in April.  \n>  \n>While the 0.3% growth rate represents a deceleration from the 1.1% rate in March, it’s the kind of slowing that’s welcome news for folks like the Federal Reserve, which is [actively working to cool economic growth](https://www.tker.co/p/federal-reserve-monetary-policy-inflation-down) in its effort to bring down inflation.  \n>  \n>“That is consistent with our view that economic activity is bending rather than breaking under the impact of higher rates,” Michael Pearce, senior U.S. economist for Capital Economics, said in a note on Wednesday.  \n>  \n>Core capex growth represents a [massive economic tailwind](https://www.tker.co/p/saving-job-openings-capex-orders). And the fact that it continues to grow, albeit at a decelerating pace, is a good sign for economy-wide growth.  \n>  \n>According to [S&P Global Flash US Manufacturing PMI](https://www.markiteconomics.com/Public/Home/PressRelease/b669b93cb25f4270952e1d9a03be464e) report released on Wednesday, these emerging economic trends have continued into May. Specifically, the composite output index fell to a four-month low of 53.8 in May. For this index, any reading above 50 signals growth, and so the declining number suggests growth is decelerating.\n\n [More signs that a major shift in the economic narrative could be underway (yahoo.com)](https://www.yahoo.com/finance/news/more-signs-that-a-major-shift-in-the-economic-narrative-could-be-underway-153719966.html)", "id": "v1gb7v", "created_utc": 1653965117.0, "score": 81, "upvote_ratio": 0.85, "num_comments": 65, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|65|**First Seen In WSB**|1 year ago\n**Total Comments**|44|**Previous DD**|\n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=v1gb7v)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=v1gb7v)", "score": 1, "replies": []}, {"body": "So what I’m reading is Daddy JPow’s gonna give us the ‘ol sully sullenburger soft landing right into 2.0% inflation just in time to lower rates out of the clutches of a full-blown depression? \n\nOk. I’m gonna fasten my seatbelt and light one up, better drop the oxygen early.", "score": 63, "replies": [{"body": "guy's a magician", "score": 14, "replies": []}]}, {"body": "Ban. Not enough hyperlinks.", "score": 41, "replies": []}, {"body": "\"Demand growth is cooling and supply chains are easing.\"\n\n\"I still can't get formul-\"\n\n\"Demand growth is cooling and supply chains are easing.™\"", "score": 109, "replies": [{"body": "Yea if demand is zero, all supply chain problems are solved.bloody clowns", "score": 21, "replies": [{"body": "supply chains are fucked. Manufacturing of HVAC units is 3x what it should be. the construction industry is ravaged by supply chain constraints right now as far down as copper pipe. the worst part is industry experts are expecting issues to last two more years.", "score": 10, "replies": [{"body": "Auto is not doing great", "score": 3, "replies": []}]}]}, {"body": "media management is another tool for \"forward guidance\"", "score": 24, "replies": []}, {"body": "Or else", "score": 2, "replies": []}, {"body": "Formula is transitory.", "score": 2, "replies": [{"body": "Formula shortages are a good thing", "score": 1, "replies": []}]}, {"body": "True but the formula situation is also an outlier", "score": 3, "replies": [{"body": "Like toilet paper was? And perhaps not everybody noticed it, but appliances like washers, dryers and refrigerators are still more often “out of stock” or backordered.", "score": 12, "replies": [{"body": "Used cars skyrocketed because they can't source widgets for new ones. They've stopped taking pre orders because of inflation.", "score": 4, "replies": [{"body": "It’s transitioning into a soft landing. Lol. They’re peeing on our leg and telling us it’s raining. I think we should all start wearing those rainbow colored umbrella hats everywhere we go.", "score": 6, "replies": []}]}, {"body": ">Like toilet paper was\n\nThe toilet paper thing was complete and utter bullshit.", "score": 10, "replies": []}, {"body": "> Like toilet paper was?\n\nStill is bruh, or do they have more than half a dozen 4-packs of toilet paper on your store shelves at a time?\n\n^^^This ^^^is ^^^not ^^^financial ^^^advice ^^^and ^^^I ^^^am ^^^not ^^^a ^^^professional, ^^^everyone ^^^here ^^^is ^^^an ^^^actual ^^^retard.", "score": 5, "replies": [{"body": "I don’t actually know. I buy in bulk at sam’s club on anything that won’t spoil. Nothing will ever get cheaper than it is today. Real world execution of a call option. Buy it at today’s price for use in the future.", "score": 2, "replies": [{"body": "That's my read on things too, could be a marketing ploy when you put it that way.\n\n^^^This ^^^is ^^^not ^^^financial ^^^advice ^^^and ^^^I ^^^am ^^^not ^^^a ^^^professional, ^^^everyone ^^^here ^^^is ^^^an ^^^actual ^^^retard.", "score": 3, "replies": []}]}]}, {"body": "I think more big ticket items are going to go forward as always “back ordered”, or ordered to go.  I don’t think many manufacturers have an appetite for keeping these big ticket items in inventory any more, at least not as they were before.  Puts on commercial warehouse and real estate.", "score": 2, "replies": []}, {"body": "The underlying cause of the formula shortage is malpractice by one company. And years of monopoly/lobbying over formula production. It has absolutely nothing to do with the rest of the inflation picture", "score": 1, "replies": []}]}]}]}, {"body": "Everyone on the earth will still want to eat breakfast lunch or dinner , they will still buy tooth paste , gasoline , and use electricity . The computer chips are still needed and so long story short, not much has really changed", "score": 34, "replies": [{"body": "They will until they cant. Consumers are sinking into debt, nobody knows how it ends.", "score": 2, "replies": [{"body": "Correct, nobody knows how it ends .\nEveryone who has drank water though has eventually died .", "score": 2, "replies": [{"body": "That means I'm dead? Unbelievable. Thanks Obama", "score": 2, "replies": [{"body": "You're not a person, obviously.", "score": 1, "replies": []}]}]}]}, {"body": "I learned to cook meals for the family with awesome youtube channels. I now order my meats and do more grocery shopping instead of eating out. For the past 20+ years I would exclusively eat out daily. Since the lockdowns in 2020 we have been cooking at home and going out a lot less.\n\nI have an EV with FUSC for life and the gas cars just sit in the driveway. Its difficult to find a need to use them unless its for a road trip (which we are not doing with covid).\n\nWe saved a lot and dumped it all on AAPL while we eat better by ordering Harris Ranch steaks delivered to our doorstep next day frozen.\n\nI get more games for my kids Nintendo switch and sign up for more streaming services for entertainment.\n\nIts a much better ROI just to enjoy staying at home. Even my kid goes to school online from home, no need to drive him to a school and waste time on that non sense.", "score": -30, "replies": [{"body": "Kids do benefit from going to school, doing outdoor activities, being in a competitive environment and of course, socialising with peers. Take em back to school man.", "score": 16, "replies": []}, {"body": "Ripe for the slaughter.", "score": 17, "replies": []}, {"body": "“I must consooooom”", "score": 6, "replies": []}, {"body": "say youtube? long google", "score": 3, "replies": []}]}]}, {"body": "Food, energy and shelter costs are going to continue to increase at higher rates. Labor market is near historic lows. \n\nGoods inflation may have peaked and will decline slowly but thats because so much demand was pulled forward and now consumers are switching to services (travel etc) so your seeing prices hike there now.\n\nNo way inflation turns meaningfully lower until either there is increasing unemployment or interest rates get high enough that people can’t afford discretionary spend because their debt service costs are becoming a larger portion of their expenses.\n\nSupply issues are a red herring. Overall supply levels are at record high volumes but demand is outpacing that level and industry can’t increase output to match. Either because of capacity issues (need more factories/hotel rooms etc) or labor issues (need more people to work). Classic too much cash chasing too few goods.", "score": 11, "replies": []}, {"body": "Long story short nothing change no body knows where we heading. It’s all fugazi. Keep your head high and your middle finger higher and ignore the fud.", "score": 19, "replies": [{"body": "I am a patient boy. I wait I wait I wait. My time is like water down a drain….", "score": 7, "replies": [{"body": "Everybody's moving\nEverybody's moving\nEverybody's moving, moving, moving, moving\nPlease don't leave me to remain", "score": 5, "replies": [{"body": "you shall not pass - Gandalf", "score": 1, "replies": []}]}]}]}, {"body": "Someone please translate into calls or put.", "score": 6, "replies": []}, {"body": "I work for Walmart and we have more inventory than we do at Black Friday.  Our highest sales numbers and we have more inventory now.  Prices on goods will come down we aren’t the only ones", "score": 5, "replies": [{"body": "What's up with the lack of quaker oats in grocery stores?", "score": 3, "replies": [{"body": "No clue probably in the back cause we are so behind on getting things out..", "score": 1, "replies": []}]}]}, {"body": "Mystery of the fishy fart solved. She's gonna wash better down there so when I go for the surf and turf tongue tickle I'm not billowing rotten cod from the bilge pump.", "score": 19, "replies": [{"body": "🤘😅🤘 Thank you.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "If you can afford those things, you clearly don’t give a fuck about inflation or money in general.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "It was sarcasm, but compared to these other guys, yeah.", "score": 2, "replies": []}]}]}]}, {"body": "These are minor developments.\nWhat happened to the price of oil?\nWhat happened to the price of food?\n\nThere's two major contributor.\n\nWhat direction are they heading?\nThat's what will happen to inflation.", "score": 4, "replies": [{"body": "Government steps into to subsidize oil prices. Barely avoids depression status. Reverses recession and we flat line stock market for a year then speculative investing causes a boom 2024.", "score": 1, "replies": []}]}, {"body": "But I just spent $700 on food items at Costco and it might last my family 2 weeks…and no, we aren’t an obese family", "score": 2, "replies": [{"body": "Cnbc had an article today on the average family spending $387 /mo on food and I wondered how old that data was.\n\nI live by myself and spend at least $300 a month on food. I of course waste a lot as a single person, but it didn't really seem possible to me.", "score": 1, "replies": []}]}, {"body": "EU has decided to ban Russian Oil. China is not going to give up their zero Covid with \"you can die to anything but Covid\" policy. A housing crash in China probably getting ready.\n\nJPow is not goings to be able to print with his ass until the shortage is over or at least looking better.", "score": 3, "replies": [{"body": "priced in", "score": -4, "replies": []}, {"body": "PrICeD In", "score": 1, "replies": []}, {"body": "China won't allow there to be a housing crash. They'll find a way to prevent that at the expense of some other calamity.", "score": 1, "replies": [{"body": "They will try. I am just not too sure if it will work out for them. China housing market problem is really deep. It's starting to look like a bubble and everyone knows it's a bubble but they don't do anything but make the bubble larger and hope it's not going to blow.\n\nThe local governments need money from selling land to developers. The developers need financing from the banks to develop. Then they realize they can sell the current projects to average people before it's finished and use the money to borrow more and build.\n\nNow they have sold houses that nobody lives in, sold houses that aren't finished but people moved in anyway because they can't afford rent plus mortgage and sold houses that will never get built. Now the banks aren't lending, developers don't have money to build and local governments are nationalizing the debt and projects they can't pay.\n\nThey whole thing is going down to hell on a hand basket and everyone is holding on to it because they don't know how to stop it.", "score": 1, "replies": [{"body": "Ya man, it's a wild situation. I actually live in China and have done so for quite some time. It's amazing how much empty housing there is, and it's not just in the middle of nowhere either. If you drive anywhere outside of any major cities you'll find whole 'towns' that didn't take off. Some of them have the capacity to house maybe 100,000 or more people and yet there are maybe a few thousand or less.\n\nThey've got an issue on their hands and I don't see how they make it out unscathed.", "score": 3, "replies": []}]}]}]}, {"body": "Soft landing…on the motherfucking moon 🚀📈🤑", "score": 2, "replies": []}, {"body": "You are either Sam Ro or a Sam Ro fan.", "score": 0, "replies": []}, {"body": "Are you like, actually retarded?  Asking because we have like a few weeks of diesel left before we run dry.\n\n^^^This ^^^is ^^^not ^^^financial ^^^advice ^^^and ^^^I ^^^am ^^^not ^^^a ^^^professional, ^^^everyone ^^^here ^^^is ^^^an ^^^actual ^^^retard.", "score": 0, "replies": []}, {"body": "Agree with this.", "score": 1, "replies": []}, {"body": "Scrolled down looking for TLDR, saw yahoo.com and stopped reading", "score": 1, "replies": []}, {"body": "Fun fact future demand can drop, there is a 24mo backlog for current demand from supply bottlenecks. Companies can literally survive next 24mo w/o new orders as the market cools, all current backlogs at elevated prices, this will cause further stock down turns since futures will continue to drop.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "v1mqg0", "created_utc": 1653991132.0, "score": 30, "upvote_ratio": 0.74, "num_comments": 63, "comments": [{"body": "I personally wouldn’t touch Carvana with a 10ft pole… by all means I can see a quick squeeze for cash but too much risk for little reward!", "score": 33, "replies": [{"body": "I work in auto, Carvana is fuckled", "score": 23, "replies": [{"body": "Why is Carvana F’ed?", "score": 2, "replies": [{"body": "For one, they are currently being investigated in multiple states for unscrupulous behavior. A personal story, my FIL traded his car in to them for a new car with a guarantee return period of maybe 5 days or something. Anyways, life happened and he had to return it. They gave him the car back, but the title had already been sold in a different state. Months later, no title. He had to go to court and get a bearer bond for the vehicle and Carvana did fuck all to help him. This story is echoed all over the country and has caught numerous attorney general's eyes.\n\nTLDR: something shady or incredibly incompetent is going on at Carvana. I wouldn't touch them at all to survive.", "score": 7, "replies": [{"body": "In auto your reputation is everything, especially specializing in uncertified pre-owned. People are easily spooked by the car buying purchase. As a master salesman I overcome this fear by screaming “BUY IT BUY IT BUY IT” at the negotiating table until they cave.", "score": 3, "replies": []}]}]}, {"body": "Yep I dropped it. What do you think about Vroom?", "score": 2, "replies": []}]}, {"body": "i agree...it will likely die out", "score": 5, "replies": []}, {"body": "It seems losses mean nothing. All the food delivery services still bleeding money and no one seems to care.", "score": 1, "replies": []}]}, {"body": ">FSLY: Fastly Inc, -72.1%, they shutdown the internet sometimes\n\nLmaoo", "score": 9, "replies": []}, {"body": "Casual reminder that PLTR is also fcf positive and has no debt and is tapering sbc hard. They are definitely going to survive. Also WSB hates it now, so also a good indicator of future success.", "score": 12, "replies": [{"body": "Overvalued. Huge stock-based compensation. I read the whole prospectus before it direct listed and chose not to buy it then. It's relies on consulting, it's not a true tech company that serves clients with the same product.", "score": 11, "replies": [{"body": "I think they will survive but THRIVE is a different story.  I", "score": 4, "replies": []}, {"body": "This is the correct take. Success of product is far to reliant on services organization.", "score": 4, "replies": []}, {"body": "Consulting company with 80% gross margins? They build variations on a core product and then the recurring revenue flows. But no matter, invest in what you understand.", "score": 0, "replies": [{"body": "Uh huh. I know, I read their prospectus. It wasn't a buy in 2019 and it's not a buy now.", "score": 3, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|8881)![img](emote|t5_2th52|4276)", "score": 4, "replies": [{"body": "<3", "score": 2, "replies": []}]}]}, {"body": "I dunno who tf Clifford Sosin is, but he has been absolutely loading his bag with PRTY.\n\nThey look like they are going to go bankrupt.\n\nThey are priced for bankruptcy.\n\nCould be a $0.  LFG. Load your bag with PRTY. \n\nI’m surprised the SI is only 17%.", "score": 5, "replies": [{"body": "Yep that's why it made the list. Not my number one choice given how cooked they were pre-pandemic.", "score": 2, "replies": [{"body": "Plus DFV was interested in it…\n\nCheck 31:05 \n\nhttps://m.youtube.com/watch?v=kWjYryckE2M&t=5709s", "score": 2, "replies": []}]}, {"body": "If they go bankrupt, would they cost out share prices for a buyout and it pays? What’s the play on a company that could go outta biz?", "score": 1, "replies": [{"body": "If they file chapter 7,  creditors get paid first, then preferred stockholders, then us(if there’s anything left).", "score": 2, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|2 years ago\n**Total Comments**|0|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/v1mo4u/my_list_of_shredded_companies_that_may_survive/) \n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=v1mqg0)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=v1mqg0)\n    \nHey /u/AxelrodWins, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 3, "replies": [{"body": "$1M on each bot", "score": 0, "replies": []}]}, {"body": "Why to you think they will survive? B/s? biz model? leverage?", "score": 3, "replies": [{"body": "Some of them B/S is not horrible (PRTY, AVYA - I mean it's not great but shouldn't have a -90% fall), some recent insider purchasing (hmm maybe I rejected these off my 50 long list some just long-term business proposition/industry growth (L.IQT, A.DN, D.PRO, FSLY) and one new CEO/short-squeeze potential/gamble (V.RM).", "score": 2, "replies": [{"body": "bump about your opinion about Regis.", "score": 1, "replies": []}]}]}, {"body": "Epam systems. Stock fell from 725 to 170 at its lowest because its a tech stock and that has has 5% of its profits coming from the ukraine region. Sold of from 700 to 400 during the jan-feb selloff, fell the rest of the way when the war occured. However they are relatively unnafected by the war. I saw it being undervalued compared to the sector and bought.\n\nOnly problem is that since march it has recovered to 340, so its less of an opportunity now. \n\nHowever they have held up great in the past 2 months. They are mostly unnafected by the huge selloffs, and i think its a good bet for this year. I reccomend you look at the 5y stock graph for a good idea of its preformance. (And the company ofc)", "score": 3, "replies": [{"body": "Nice good find! Maybe if it's drops back, looking for ones with >2 x potential to previous highs with the understanding some of these will die.", "score": 1, "replies": []}]}, {"body": "PS. the % declines are 1 year losses", "score": 6, "replies": []}, {"body": "only dragon fly here has potential rest is junk", "score": 2, "replies": []}, {"body": "Did you just sort by highest % losses?", "score": 2, "replies": [{"body": "Yes over 1 year and then I eliminated a heap based on filters like \"no Chinese companies\" and got this list. I'll redo it in a couple of weeks and see what else there is.", "score": 1, "replies": []}]}, {"body": "By the way to those commenting, you have to break-up the tickers to defeat AutoMod if they are <$1.5 B market caps, which four of these (A.DN, L.IQT, V.RM, D.PRO) are (plus F.SLY today probably).", "score": 2, "replies": []}, {"body": "Holy shit, this username. Lead us!", "score": 2, "replies": []}, {"body": "Lick Tech sounds good to me!  I'll ride that to a 69% profit", "score": 2, "replies": []}, {"body": "I'm curious about dragonfly, will have to read their annual report.\n\nI feel like the depreciation on their assets will kill them though, with drone delivery still being niche at best, and no real way to exclude other players.", "score": 0, "replies": [{"body": "I already dropped dragonfly. CEO looks like a scammer, one of those \"I'm an entrepreneur\" types on LinkedIn. And yes, niche and making drones is not special.", "score": 2, "replies": [{"body": "I stumbled across this on a google search, I used to work for one of Cameron Chell's companies, the guy and his crew are scam artists. They find niche ideas that have potential they never really reach, or plan on reaching, they go public, buy a boat load of shares then when the stock blows up they cash out, run the company into the ground, maybe sell it.\n\nIf anything the CEO is someone to follow because he has done it several times now.", "score": 2, "replies": []}]}]}, {"body": "This is not DD. Please mark this as discussion", "score": -6, "replies": [{"body": "I'll mark it however I want unless you're a mod in which case I definitely don't care.", "score": 6, "replies": [{"body": "You are sincerely a piece of shit", "score": -7, "replies": [{"body": "Cute. Can't take it and you're trying to trade on open markets haha.", "score": 3, "replies": []}]}]}]}, {"body": "infobird $IFBD chinese sASS play\n\ntrading at .25 future PE!\n\ninsane", "score": 1, "replies": []}, {"body": "FSLY is intriguing but burns cash at an alarming rate. The only one of these I would consider if Draganfly.  \n\n\nCarvana is a great company to deal with, I've sold them two cars, but I have to assume their inventory is devaluing over time.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Michael Burry responded to my craigslist ad looking for someone to mow my lawn. \"$30 is $30\", he said as he continued to mow what was clearly the wrong yard. My neighbor and I shouted at him but he was already wearing muffs. Focused dude. He attached a phone mount onto the handle of his push mower. I was able to sneak a peek and he was browsing Zillow listings in central Wyoming. He wouldn't stop cackling.\n\nThat is to say, Burry has his fingers in a lot of pies. He makes sure his name is in all the conversations.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "what do you think about Regis? they went literally to the toilet on most recent earnings though, $30m market cap.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "v1zohl", "created_utc": 1654029960.0, "score": 49, "upvote_ratio": 0.85, "num_comments": 53, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|79|**First Seen In WSB**|1 year ago\n**Total Comments**|359|**Previous DD**|[x](https://i.redd.it/0nj6t80618n71.jpg) [x](https://www.reddit.com/r/wallstreetbets/comments/q3ryz7/wish_dd_upside_surprise_potential_in_november/) [x](https://www.reddit.com/r/wallstreetbets/comments/ulgdxg/the_wish_dd_you_need_to_read/) [x](https://www.reddit.com/r/wallstreetbets/comments/namxv9/i_like_the_stock_spce/) [x](https://www.reddit.com/r/wallstreetbets/comments/pletr5/wish_dd_moon_not_in_sight_but_2x_or_3x_possible/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=v1zohl)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=v1zohl)", "score": 2, "replies": []}, {"body": ">”I’m already NZD$180k in the hole, so I thought I’d play it safe…” \n\nProbably my favorite part of this.", "score": 96, "replies": [{"body": "It just says so much¡", "score": 9, "replies": []}, {"body": "I read that as \"It literally cannot go tits up.\"", "score": 8, "replies": [{"body": "priced in", "score": 1, "replies": [{"body": "Bad bot", "score": 2, "replies": []}]}]}, {"body": "I mean, 180,000 New Zealand Dollars is only about 12.50 USD, but it's still pretty impressive to owe that much money from the Shire", "score": 4, "replies": [{"body": "I read it ass 180k Nutt Zack Deep", "score": 2, "replies": [{"body": "I mean, he's from New Zealand, which means he's 180 bags in the hole to Mordor", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Okay, that was 2 months ago ya fucking weirdo", "score": 1, "replies": []}]}]}, {"body": "So it's like worth $20 rubble", "score": 1, "replies": []}]}, {"body": "Someone make this guy a mod, this is some high level advanced retardation", "score": 50, "replies": []}, {"body": "Sounds like a margin call with extra steps.", "score": 33, "replies": []}, {"body": ">I received a notification from my broker, IBKR, that I had breached Reg T margin requirements and my portfolio was at risk of liquidation  \n\n> I thought I’d let my combo fly  \n\nSo you decided to ignore the liquidation warning and are now unhappy with the fact that part of your position was liquidated? If only there was some sort of warning that would happen...", "score": 19, "replies": [{"body": "What are you tarded?", "score": -5, "replies": []}]}, {"body": "Interactive Broketard or IBKR where the R is for retard", "score": 15, "replies": []}, {"body": "that’s degen shit forsure", "score": 11, "replies": []}, {"body": "RH is Restoration Hardware, please use HOOD", "score": 20, "replies": [{"body": "You think this sub knows the difference", "score": 15, "replies": [{"body": "Stonks go up brah.", "score": 9, "replies": []}]}, {"body": "What? All this time I thought it was RH. Damn I need to exit some positions when the market opens.", "score": 9, "replies": []}]}, {"body": "You stayed true to your username.  \n\\*IBKR warns you of breached margin requirements and liquidation risk\\*  \nYou: Ahhh.. I'm hwangin it", "score": 6, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": ">What would Bill Hwang do…?\n\nGo to jail probably\n\nEDIT: As a sidenote, Bill Hwang was indicted for illegally going 20:1 leverage, and then proceded to go 20:1 leveraged on his bail payment (WIKI: Hwang was released on a $100 million bond, which was covered on margin with $5 million.\\[17\\]\"). What a fucking legend.", "score": 3, "replies": []}, {"body": "He would call up IBKR and tell 'm what's up and then demand a special line of credit, so he could make at least x10 what he's owed by 'adequately' utilizing leverage.", "score": 2, "replies": []}]}]}, {"body": "I'm on IBKR. If I got that msg, I would not let that position ride.\n\nDon't blame them. They warned you.", "score": 9, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Username checks out.", "score": 9, "replies": []}, {"body": "I agree, it sucks.\n\nBut you can never expect any broker to look out for your interests.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "They didn't. You had two positions and they closed one", "score": 5, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "It’s the price you pay for margin my G. This same thing is currently happening to someone I’m close with except with Tesla. Watched this person nuke their account from 2.4 million down to 600k since January.", "score": 5, "replies": [{"body": "Why is he not here yet? Get on it. Slacker.", "score": 6, "replies": []}]}, {"body": "They will close the one using more margin.", "score": 2, "replies": []}]}]}]}, {"body": "# This is the only answer OP is looing for.", "score": 1, "replies": []}]}, {"body": "😭😭😭 love this", "score": 4, "replies": []}, {"body": "This is so sad. Idk how they closed the winning side….", "score": 5, "replies": []}, {"body": "Looks like they broke you", "score": 5, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": ">they still do margin calculations that liquidate or prohibit from opening LONG CALLS that you can’t afford to exercise LOL\n\nThey pulled that shit on me once and all I could think of was \"I'm supposed to be the retard here\". What a bunch of morons", "score": 3, "replies": []}]}, {"body": "Read the TOS and see what it says about how they handle margin calls.  It's one thing to close a position, it's another to cherry pick like they did here.  Though I would imagine the TOS gives them a lot of discretion on how to handle this.", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Sounds like they screwed you then.  I would get someone on the phone and not let up, repeatedly ask for someone at the next level, etc.  Unfortunately I doubt they will give you anything back or admit fault, and 7500 isn't worth arbitration (assume you have an arb clause in there) but if you raise enough hell, who knows, you might get something.\n\nJust curious, could they have equally closed your position on both sides, i.e. liquidate the same number of calls and puts?  If yes, that would have preserved your play, and I would make an issue out of it.  Also note they could have called and asked what you wanted to close, but did not.\n\nGood luck.", "score": 3, "replies": []}]}]}, {"body": "This is standard operating procedure for IB. You’ll go back and forth with them and may have some hope at one point that something good will come of your exchanges with CS. But it will all be a wast of time. \nYou have to manage your account prior to the computer liquidation, as it’s a total gamble. Do it yourself, so at least you know what you are betting on.", "score": 5, "replies": []}, {"body": "IBKR is notorious for auto-liquidation. No idea how they choose which positions to liquidate (which I think you can raise an issue with) but they gave you a warning that you were going to breach margin and based on their TOS they auto-liquidate if you don’t close out. \n\nYou didn’t have a margin call during the day, because the daily margin requirement is lower (i.e. 25% of investment needs to be held compared to 50% for overnight positions)", "score": 2, "replies": []}, {"body": "You probably got assigned", "score": 0, "replies": []}, {"body": "A bit more of us break it like this and we in for some fun market manipulation from tHe HeDgE fUnDs", "score": -2, "replies": []}, {"body": "Are we talking US or NZ legislation here?", "score": 1, "replies": [{"body": "UNSZ!", "score": 4, "replies": []}]}, {"body": "Wow", "score": 1, "replies": []}, {"body": "You did t break anything but your wallet!", "score": 1, "replies": []}, {"body": "Noooo, wait... fuck. I just checked CRM after hours... yeah man, that's fucking sad =/\n\nThese fuckers owe you money", "score": 1, "replies": []}, {"body": "You broke me with all this jargon, all I normally do is buy and then ask \"wen moon?\"", "score": 1, "replies": []}, {"body": "I was gambling with other peoples money and they called the loan", "score": 1, "replies": []}, {"body": "“Repeatedly ask for someone at next level”\n\nSo…. You want to talk to the manager, Karen? ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Bruh I just call that happening to me a Wednesday. It happens so often I've given up. I paid for market data that was showing incorrectly", "score": 1, "replies": []}]}
