{"title": "$250 billion in ‘rebalancing’ inflows could rescue stocks by the end of June, JPMorgan says", "selftext": "https://preview.redd.it/gtxrhb6ndo191.png?width=1900&format=png&auto=webp&s=5823b029dffdff20b8e986399cdc967950dd625e\n\nWhile stock-market strategists at Bank of America and Morgan Stanley grow increasingly bearish, JPMorgan’s equity-research department has churned up yet another bullish note for the bank’s clients, advising them about the potential for massive month- and quarter-end rebalancing flows that could trigger a sustained rebound in stocks, putting even more distance between the U.S. benchmarks and the bear-market territory with which the S&P 500 index was flirting late last week.\n\nThe team of JP Morgan equity quants, led by Nikolaos Panigirtzoglou, told the bank's clients that potentially more than $250 billion could flow into stocks by the end of June as American mutual funds and pension funds, along with foreign pensions and sovereign wealth funds, “rebalance” by buying stocks and selling bonds.\n\nFull article: [https://www.marketwatch.com/story/250-billion-of-rebalancing-inflows-could-rescue-stocks-by-the-end-of-june-jp-morgan-says-11653395405](https://www.marketwatch.com/story/250-billion-of-rebalancing-inflows-could-rescue-stocks-by-the-end-of-june-jp-morgan-says-11653395405)\n\n**According to JPMorgan $JPM, more than $250 billion could potentially flow into stocks by the end of June. Mutual funds, pension funds & sovereign-wealth funds will likely “rebalance” by buying stocks and selling bonds. Do you think this inflow might cause a rally in stocks?**", "id": "uxpcth", "created_utc": 1653507820.0, "score": 215, "upvote_ratio": 0.92, "num_comments": 59, "comments": [{"body": "Like a hotdog down a hallway", "score": 126, "replies": [{"body": "Everything has a ripple effect, just like when a company misses earning, 1 fund dumps leading to other funds dumping with it. Same thing to a wave of buying", "score": 9, "replies": []}, {"body": "Please explain", "score": 8, "replies": [{"body": "Hot dog small, hallway big", "score": 66, "replies": [{"body": "😂", "score": 5, "replies": []}, {"body": "Sorry, retard here. PleAse explain like I am a 5 year old midget retard.", "score": 7, "replies": [{"body": "$250 billion small, stock market big", "score": 80, "replies": [{"body": "Thanks mate", "score": 24, "replies": []}]}, {"body": "$250 billion is small potatoes compared to the two trillion (or whatever the figure is) that was wiped out in the last few weeks.", "score": 8, "replies": [{"body": "Shouldn't we compare with the volume instead?\n\nSay if a stock drops from $3000 to $2000 on a daily volume of 10 shares but has a market cap of $1T before, would this mean that $300B of capital is needed to bring it back? Or just $3k?", "score": 7, "replies": []}]}, {"body": "It's and old dirty joke about a small dude, or a large gal.", "score": 6, "replies": []}, {"body": "All 5 year olds are midgets", "score": 3, "replies": []}]}]}, {"body": "Sex", "score": 6, "replies": []}]}]}, {"body": "I hear about these kind of things all the time, but they never seem to do what people predict. At least not reliably. \n\nThe total market cap of the US Stock Market is around $50,000 Billion. So you are talking about inflows equalling about .5% of that. The market moves more than that many days a year.", "score": 62, "replies": [{"body": "Algorithmic trading is largely based on momentum. These inflows don't have to make up the entirety of the market move, they just have to be significant enough to trigger algorithmic buying for a nice summer bear market rally before the drawdown continues.", "score": 38, "replies": [{"body": "That and doubling the value of the market from 50t to 100t wouldn’t mean 50t of new capital has entered the market. It would just mean that everyone who’s buying and selling is doing so at those valuations.", "score": 14, "replies": [{"body": "Uh, no. In order to *get* the market to those valuations, the capital must enter the market.", "score": -18, "replies": [{"body": "If a stock has 100 shares priced at $0.5, and I buy a share for $1 the market cap is now $100 because the price is based off the last sale. $50 did not enter the market\n\nExtreme example, but there’s a gap at every price change because you’re buying a minority of the total shares, and if everyone decided to sell you wouldn’t be able to get $100 out of that market either. The market cap is only real when supply and demand are closely matched", "score": 18, "replies": [{"body": "Interesting, I didn't know.", "score": 8, "replies": [{"body": "Someone on Reddit who is open to new ideas. Congratulations sir. You will learn much...", "score": 9, "replies": [{"body": "If one takes any other attitude in their approach to learning the ropes in this business, they're in for a really bad time.", "score": 3, "replies": []}]}]}, {"body": "mind blowing, never thought about it", "score": 2, "replies": []}, {"body": "Market cap is based off last sell price? How would you calculate the new market and stock price if for example you expect a CEO to buy back 25% of shares of their current $1B market cap company?", "score": 1, "replies": []}]}]}]}, {"body": "This sort of thing isn't a mystery. It is already built into the models.", "score": 2, "replies": []}]}, {"body": "What’s the total volume of trading though? P", "score": 2, "replies": [{"body": "Today was over $300 billion. It was over $400 billion earlier this week.", "score": 5, "replies": []}]}]}, {"body": "JP Morgan dangles bag in front of retailers hoping they'll hold it for them.", "score": 16, "replies": [{"body": "“Holding these bags is fantastic,” one JPM quant was quoted as saying. “These are the best bags I’ve ever held. If only others could experience the joy of holding them.”", "score": 7, "replies": [{"body": "😂", "score": 1, "replies": []}]}, {"body": "Exactly.. Recession .... Sold at a 30% loss, cannot take anymore.... F...ing stock.", "score": 0, "replies": []}]}, {"body": "Their quant's surname is not Yang and he didn't win a national maths competition in China. I'm not sure of his maths.", "score": 28, "replies": [{"body": "lmao good ref", "score": 5, "replies": []}, {"body": "Well Yang came in second in that one competition. Maybe this quant came in at first? Hopefully?", "score": 3, "replies": []}]}, {"body": "If $250 bn inflow would save the market, what about QT of $65 bn / month for June/July/Aug, then $95 bn / month from sept on?  Would market crashes back to the ground?  \n\nUse to have a lot of respect for the JPM team, but lately it appears they just pick random facts to support whatever their view is.  You can support any notion about the market by selectively picking facts. I don't have a view and I don't know if their view is right or wrong, but I will surely not to listen to them blindly.  Are they over-leveraged with longs and wanting to get out or what?", "score": 12, "replies": [{"body": "Nah, this message seems bullish, but I would say it bearish. If the $250 is going into the market it would either be split into different weeks, months. Or at once, either way one thing is certain they don’t want to buy the top.\n\nSo to me that means June is going to be even more blood in the water, we are going to bleed some more. Perhaps a rally at the beginning/second week of June and than we bleed down further.\n\nAnd IF the 250 comes in June that means they bought the bottom. But still there are other things at play here that makes the whole ride a very bumpy and uncomfortable ride. So we shall see…", "score": 2, "replies": []}]}, {"body": "I mean who cares, it wont happen. Only tightening. You could name any number, sure maybe but maybe not. Pointless to discuss as it wont be a thing.", "score": 9, "replies": []}, {"body": "It looks like OP posted an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.marketwatch.com/story/250-billion-of-rebalancing-inflows-could-rescue-stocks-by-the-end-of-june-jp-morgan-says-11653395405](https://www.marketwatch.com/story/250-billion-of-rebalancing-inflows-could-rescue-stocks-by-the-end-of-june-jp-morgan-says-11653395405)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)", "score": 8, "replies": []}, {"body": "Like a Ferengi will wait for $pike and take profit .", "score": 5, "replies": []}, {"body": "A nugget of hope. PCE inflation, the Fed’s preferred inflation indicator is released Friday. If its a hot print we will see another leg down.", "score": 6, "replies": []}, {"body": "Rebalancing usually saves the market when the fed cuts rates. \n\nBonds are not looking so hot right now, and if they start reducing the balance sheet it might get even worse", "score": 4, "replies": []}, {"body": "I shit myself when these banks start going bullish.", "score": 4, "replies": []}, {"body": "Fuck banks and anything they say.", "score": 5, "replies": []}, {"body": "Bonds are down as well", "score": 2, "replies": []}, {"body": "Interesting, whenever I see news like this is seems to have the opposite effect or they're trying to get a better price to unload.", "score": 2, "replies": []}, {"body": "They throwing around 2tn a day in reverse repo now tho.", "score": 2, "replies": []}, {"body": "Where are these people going to get the money. They all bought Treasuries ???", "score": 2, "replies": []}, {"body": "Oh look, copium", "score": 2, "replies": []}, {"body": "I like how they are giving up on trying to sound smart and use words like \"flow\". Let me pull out my earth vagina crystal and heal the wounded market.", "score": 2, "replies": []}, {"body": "A brief look at bonds and treasury performance can reveal that they were falling along the way this year ij a historical fashion.  So they might be not so much out of balance after all. Maybe if some funds start selling bonds to buy loss making tech (which had some serious sell offs recently). But you will need so pretty big balls to sell bonds and buy that now :)\n\nPlus if the mood gets worse I am sure some big bag holders are happy to dump in that liquidity", "score": 2, "replies": []}, {"body": "Humored lies to hide crime...weird.", "score": 2, "replies": []}, {"body": "Hasn’t Jpm had a really poor track record with this kind of thing?", "score": 2, "replies": []}, {"body": "I haven't seen anything about it in a while, but aren't the derivatives markets valued in the tens of trillions? If those blow up, how the hell is $250 billion supposed to make a difference?", "score": 2, "replies": []}, {"body": "JP Morgan has been publishing \"feel good\" stories across all platforms and asset classes. Trying to generate more exit liquidity?", "score": 2, "replies": []}, {"body": "I’m a bit late to this (thought about posting here earlier but forgot), but this is one of a few reasons why the June FOMC setup is closer to March than May, unless the market continues to rally.\n\nBig quarterly OPEX, where the big guys are going to have to shift their positioning around, which could cause a move higher.\n\nRebalancing.\n\nThe JHEQX roll (this is a weird reason but the last couple times this happened, you had geeks frontrun it, and it’s kept a strong bid under the S&P for the week after OPEX week in December/March).\n\nI’m fully aware that I might get pied in the face because I did think that we’d see some further relief after the past FOMC day and as we know, that didn’t happen. But \nif this turns into a one-off rally week by the S&P and it undercuts 3810 in the next couple weeks, I think we end up with the March like outcome instead of May post decision unless something that is a lot more hawkish than what we think we're going to hear is said.\n\nAll this blabber may be invalid if some NYSE indicators hold though. We might be in the midst of a push like that now. \n\nThink if I traded and preferred the short side, I’d probably prefer that Friday last week be a multi-week low and would lay off for a bit longer outside of intraday. Think if we go into the meeting at 4300, it’s more likely we get killed after that. If we don't, then I don't know...it's probably a coin flip this time for real unlike May.", "score": 2, "replies": [{"body": "Agreed. Great thoughts on this. Thank you for sharing.", "score": 1, "replies": []}]}, {"body": "Absolutely. Technicals all point towards a nearing summer rally. I would not be surprised at all. \n\nPeople here always make the mistake of believing that macro conditions must change for the market to rally.", "score": 4, "replies": [{"body": "Sounds like the people who believe markets rally based off technicals", "score": 4, "replies": [{"body": "Rallies don't necessitate ATH. We have multiple divergences that indicate a trend change and we have institutional buying. It's coming.", "score": 2, "replies": []}]}]}, {"body": "The next Lehman brothers…", "score": 1, "replies": []}]}
{"title": "Did $TWTR just become a BUY?", "selftext": "[removed]", "id": "uxt0yg", "created_utc": 1653518113.0, "score": 2, "upvote_ratio": 0.54, "num_comments": 68, "comments": [{"body": "I still don't think Musk buys Twitter so for me it's a 'no'.", "score": 15, "replies": [{"body": "Why not? He's on the hook for billions in damages if he backs out. The only reason he'd eat that kind of loss, in my mind, is to avoid an existential risk to Tesla.", "score": -10, "replies": [{"body": "I think it's only $1 billion if he backs out. But even if it's billions Twitter isn't worth what he's willing to pay. His ideas for Twitter are also crap and while they may make money in the short term it'll kill Twitter in the long term.", "score": 14, "replies": [{"body": "Yeah, that's absolutely not the case.\n\nIt's for everything he negotiated for. Or less if Twitter decides to cave and sell for something like $45.\n\nIf they don't, we're on our way to a sh--show in a Delaware court...which honestly, it'd be fitting, because a Musk failure would be a big event for this time period.\n\nEdit: This may be a disregard...it sounds like Dorsey may help him out here.", "score": 0, "replies": [{"body": "Actually, it is the case.\n\n[https://www.cnbc.com/2022/05/13/elon-musk-cant-just-walk-away-from-twitter-deal-by-paying-1-billion.html](https://www.cnbc.com/2022/05/13/elon-musk-cant-just-walk-away-from-twitter-deal-by-paying-1-billion.html)\n\nJust stop talking about the law if you are not an attorney. You are not qualified to have an opinion.", "score": 2, "replies": [{"body": "You didn't understand what I said.\n\nHe's not on the hook for 1 billion if he wants to walk, I agree.\n\nHe's on the hook for it all (which is 44 billion or so), and if Twitter refuses to negotiate down, which is what Elon wants them to do, this absolutely \"is\" headed for a sh--show in a Delaware court at some point.\n\nThis is still not a good arbitrage play right now unless you have the stones and are a believer in Elon.", "score": 2, "replies": [{"body": "Ah I see what you're saying, sorry. I think the closest analogy is Tiffany v. LVMH and that lawsuit resulted in the deal going through with about a 2.5% discount to the negotiated price.", "score": 1, "replies": []}]}]}]}, {"body": "The $1b penalty is an option for Twitter not an option for Musk, as in Musk does not have the choice to simply pay the penalty and walk away. And there's no reason for Twitter to choose a $1b penalty when they can instead sue Musk for legal damages, which would be $54.20 less the share price on the day of breach, multiplied by outstanding shares, plus consequential and incidental damages. At current prices, Twitter's damages would be $13.20 x 764.18 million shares = $11.6b+ in damages out of Musk's pocket if he walks. Musk does not have that kind of liquidity, so he would need to sell a significant number of shares in Tesla or SpaceX to back out.\n\nYou may think his ideas are crap and speculate they will be the death of Twitter, but apparently you're basing the core of your opinion of the stock on misinformation.", "score": -6, "replies": [{"body": "Freedom of speech,  yes total crap.  Lol", "score": -1, "replies": [{"body": "Democrats have gone full 1984 and now consider free speech to be dangerous. It's mass propaganda under the guise of countering \"mis- and disinformation,\" which has become a euphemistic label to attach to politically unpopular speech or any speech that challenges establishment interests.", "score": -14, "replies": [{"body": "Funny considering it was Republicans in Florida who just had a bill ruled largely illegal and unconstitutional because it violated the law and the rights of corporations.\n\nTexas is up next with their law that violates the free speech rights of corporations.\n\nThose aren't small states or some random small town. Violating the 1st Amendment is a prime desire of big name Republicans.\n\nAdd to that Florida attacking Disney because of its criticism of the governor and writing a law specifically designed to punish it because of that criticism.\n\nNo sane person takes what you wrote seriously.", "score": 13, "replies": [{"body": "You seem to have confused me for a Republican. I said: \"Democrats have gone full 1984,\" not that Republicans are pro-free speech. But of course, you're a partisan hack, so any attack on Democrats must be met with a reciprocal attack on Republicans. You're all shitty establishmentarians slinging your crap at each other like a bunch of mouth-breathing, tribal monkeys.\n\nVote Green", "score": -6, "replies": [{"body": "I took you for someone who is incapable of deciphering reality. You attack Democrats for doing what Republicans have actually done and passed actual laws to do.\n\nYou just left that out. I'm sure it was a complete oversight and you'd have gotten around to mentioning it in some follow up comment.", "score": 6, "replies": [{"body": "You can take it however you want. But, in reality, the average Democrat voter is more opposed to free expression of ideas than the average Republican voter. You can point to Ronald McDonald and argue that clown is against free speech, but your whataboutism doesn't change the fact Democrats are bending over backwards to censor anything they find disagreeable.\n\nDon't be upset just because there are real liberals left who won't accept your shitty party as our representatives.", "score": -3, "replies": [{"body": "lol\n\nOnly conservatives use \"Democrat\" as an adjective. You can claim all you want that you're Green but I don't actually believe you.\n\nRepublicans have actually passed laws to block the free speech rights of companies. Actual real laws. That's far more \"bending over backwards\" than whatever Democrats have done. What have they done? Who knows! You certainly haven't provided any evidence.", "score": -1, "replies": [{"body": "I'm left-libertarian. \n\nDemocrats are scum. So are Republicans. You don't realize because you're trapped in your little tribal shit-slinging contest. You've been slinging shit for so long it's starting to come out of your mouth when you talk.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Show me in the Bill of Rights where it protects peoples speech from the Terms of Service written by private companies.", "score": 0, "replies": [{"body": "Just because speech on social media is not constitutionally protected, it does not follow that the speech is outside the penumbra of free speech principles, which clearly favor an open dialectic rather than censorship. Free speech on Twitter is absolutely a good thing for America even if it is not mandated by the Constitution.\n\nNice try though at playing attorney.", "score": -2, "replies": [{"body": "So Twitter can silence whomever they want, just as Truth Social can, and Fox News and MSNBC can refuse to book whomever they want. Great. Thanks for catching up with reality.", "score": 4, "replies": [{"body": "Not anymore, which is clearly why you're so upset. You're just another Democrat who wants to suppress speech you find inconvenient.", "score": 0, "replies": [{"body": "Cry some more. So sad you can’t promote an insurrection or school shooting on Twitter. Waaah.", "score": -1, "replies": [{"body": "Solicitation to murder is a crime and has never been protected speech. We are talking about political bias. Get your bullshit strawman the fuck out of here.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Censorship = good\nFreedom of speech = bad", "score": -6, "replies": [{"body": "On an internet discussion forum no rules regulating behavior is a terrible idea. We have ample evidence from decades of forums what happens.", "score": 0, "replies": [{"body": "No one is saying there should be \"no rules.\" But rules that do exist need to be enforced without political bias. I got permanently banned from Twitter for writing an analysis that exposed Andrew Yang's UBI proposal as a Trojan horse for universal credit. All I did was share the article during the primary campaign in about 20-30 replies to different people and Twitter permabanned me for \"spam.\" The political bias on the platform goes way beyond what is necessary to prevent harm.", "score": 0, "replies": [{"body": "So you spammed and then were banned for spam.\n\nBanning for spam isn't political bias. It's just good moderation.\n\nDid you spam? Yes.\n\nIs spamming allowed? No.\n\nYou deserved the ban.", "score": 2, "replies": []}]}]}]}]}, {"body": "Not true.  If he can not secure the funding for the 44b the deal can be canceled and cost him the billion dollar fee.", "score": 0, "replies": [{"body": "Seriously, stop spreading misinformation.\n\n[Elon Musk can’t just walk away from his Twitter deal by paying a $1 billion breakup fee](https://www.cnbc.com/2022/05/13/elon-musk-cant-just-walk-away-from-twitter-deal-by-paying-1-billion.html)\n\nPeople who are not lawyers need to stop giving their opinions on legal matters.", "score": 2, "replies": [{"body": "This is the internet you crackhead", "score": 3, "replies": [{"body": "Hehehe my mistake, apologies.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "He's on the hook for nothing. You don't get to have official SEC filings estimating less than 5% of accounts are bots when in reality it is 20-50% or higher and keep your ability to enforce a damn thing.", "score": -11, "replies": [{"body": "TWTR's filings are sufficiently hedged and make clear the true number of bots may be significantly larger. Musk doesn't have any case for rescission in my professional opinion.", "score": 2, "replies": []}]}, {"body": "Very high change Twitter going to be found to have committed Fraud by misleading shareholders and customers.\n\nLawsuits up the A, and musk could probably walk away unscathed (or sue them himself since he is now a shareholder)", "score": -1, "replies": [{"body": "Nope.", "score": 1, "replies": []}]}]}]}, {"body": "I scooped up a ton of shares when the value dropped after the deal went got delayed. It's gone right back up to where it was before. 9% AH yesterday. Already made a boat load if I sell now.", "score": 3, "replies": [{"body": "Very nice mate. I was thinking of playing it sooner but wasn't comfortable with the margin loan complication. I'm in for 100 at $39 today though and building a position.", "score": 2, "replies": [{"body": "What’s your plan? Long term or just guess he won’t lower the bid and hope to cash out before October?", "score": 1, "replies": [{"body": "Holding until buy-out.", "score": 1, "replies": []}]}]}]}, {"body": "Before it hits you, Elon Musk will find a new way to boom you.", "score": 7, "replies": []}, {"body": "I am simple minded anything way under 54 is a potential gain.  With Musk I am not so sure.", "score": 4, "replies": []}, {"body": "He won’t buy it if in fact half the users turn out to be bots! That’s the big unanswered question right now. Getting interesrinf.", "score": 2, "replies": [{"body": "He was buying it claiming he was going to get rid of the bots. He can't turn around now and say the price is too high because there are bots on it.", "score": 5, "replies": [{"body": "Twitters value is derived from the number of subscribers or users. In their filings, Twitter claimed to have less than 5 percent of bots (as fake customers) now it appears that number may actually be as high as ten fold. If true, that would drop Twitters valuation like a rock as companies placing ads would not be willing to pay as much as the viewership of actual\nReal people would be far less than claimed. Musk also said he wanted to fix the algorithms to ensure unbiased free speech and get rid of the bots (the 5 percent) that were being used to falsely support or counter certain tweets.", "score": 2, "replies": [{"body": "Musk should have determined how bad the fake bot problem was before he signed a contract to buy the company. His failure to do due diligence is not a reason to void the contract.", "score": 0, "replies": []}, {"body": "Musk knew there were fake accounts.\n\nHe knew *his* follower count was nearly 50% fake.\n\nHe knew the quarterly reports contained disclaimers about their estimation method.\n\nThe Delaware Court of Chancery isn't going to back him unless the things he *didn't* know would produce a 40% decline in long-term profitability.\n\nHe's playing games or else he really doesn't know what he's doing at all.\n\nHe should pay the price he contracted to pay (he effectively sold a $54.20 Put) or the $1 billion quit fee.\n\nThe loss of credibility is costing him more than either of those.", "score": 0, "replies": []}]}]}, {"body": "Maybe, but I think at even 50% bots, it's still less of a cost for Musk to go ahead with the deal than eat $10-15b in damages paid out of his Tesla or SpaceX stock.", "score": 1, "replies": [{"body": "If Twitter has a material percentage of its users turn out to be bots, the deal gets renegotiated.  Considering the premium Musk was willing to pay for Twitter just 2 months ago, I’d say he actually wants the company.", "score": -1, "replies": [{"body": "No, it doesn't, because Twitter made clear in their SEC disclosures the bot number could be much higher than 5 percent. Musk should have done proper DD before making an offer; instead, he threw out a joke number and Twitter hit his bid. He can talk shit about the bots but there's simply no material misrepresentation: Twitter told everyone the number could be much higher and Musk knew as much when he made his offer. Based on Musk's tweets after Twitter accepted, he only asked how Twitter calculated the 5 percent (with a tiny sample size of 100 user accounts) after he made the offer. That's his own fault and should be a lesson for him.", "score": 2, "replies": [{"body": "“We have performed an internal review of a sample of accounts and estimate that the average of false or spam accounts during the first quarter of 2022 represented fewer than 5% of our mDAU during the quarter. The false or spam accounts for a period represents the average of false or spam accounts in the samples during each monthly analysis period during the quarter. In making this determination, we applied significant judgment, so our estimation of false or spam accounts may not accurately represent the actual number of such accounts, and the actual number of false or spam accounts could be higher than we have estimated. “\nThat’s their full statement in the filing.  Their analysis used nonpublic information.  All the due diligence in the world isn’t going to get Elon access to Twitter’s internal data.  If Musk can determine that it’s significantly higher than 5% or worse, if Musk can show that Twitter used poor “judgement” in determining the 5% figure, he has all the ammo he needs.", "score": 1, "replies": [{"body": "Musk could have sought Twitter's methodology for arriving at the 5% number before making an offer. That methodology does not rely on non public data as it is just a random sample of 100 accounts. Musk does not have any \"ammo\" to renegotiate.", "score": 1, "replies": [{"body": "Keep telling yourself that.  There’s a reason the stock is considerably lower than $54.", "score": 0, "replies": [{"body": "Yeah, and that reason is not the one you articulated, which has no legal basis.", "score": 0, "replies": [{"body": "As someone who has actually experienced numerous trials, arbitrations and legal settlements in my career, I can tell you legal basis is only a fraction of the puzzle.  Twitter and Musk will weigh the cost and time involved in the dispute, they’ll weigh public opinion and ultimately steely they’ll weigh the distraction of it all.  Legal basis in civil trials is a joke.  It’s a popularity contest and has very little bearing on facts and law when it gets to a jury.", "score": 1, "replies": [{"body": "Spoken like someone who experienced all those trials, arbitrations, and settlements as a client and not as an attorney.", "score": 0, "replies": [{"body": "Bless your heart.", "score": 0, "replies": [{"body": "Seriously, I know you're not an attorney when you say things like popularity is more important than facts and law. Sounds like you've lost a few cases and told your shareholders it's because the other side had a prettier smile.", "score": 0, "replies": [{"body": "You being an attorney means absolutely nothing in this instance - attorneys are either wrong 50% of the time, or opportunistic parasites that feed and breed on conflict.\n\nI have mostly testified in trials as a expert witness or been deposed in that manner.  I wouldn't waste my humanity as an attorney.  \n\nMy statement that the \"law\" is really only part of the puzzle is accurate.  If it were as simple as the \"legally correct\" one always winning, we wouldn't really need trial attorneys.  Your own link noted that Tiffany's went through a similar scenario when being purchased by LVMH in 2020 and ultimately agreed to a lower sale price.  \n\nMusk has plenty of leverage to lower his bid on Twitter.", "score": 0, "replies": [{"body": "You aren't an attorney and as such your opinion of the law is worthless, besides the fact you are wrong. \n\nI happen to only work pro-bono for a nonprofit, so . . . .", "score": 0, "replies": [{"body": "Well, I guess they're getting what they pay for.", "score": 0, "replies": [{"body": "They aren't paying. Even your jokes don't make sense.", "score": 1, "replies": [{"body": "Would you like to bet your law license on the deal closing at $54?", "score": 0, "replies": [{"body": "You're not an attorney. Are you upset no one gives a fuck about your layman's opinion or how much court room experience you have as a witness lol? \n\nSeriously, just go away.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I hate how this is political, hard to gauge the likeliness with the amount of Bias on this website. I think today is definitely a slight indication, but who knows. The market is so unpredictable lately.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "kthxbye", "score": -12, "replies": []}]}, {"body": "I haven’t followed the story too much but I am going to say no for the time being. \n\nIt sounds like Musk wants to buy Twitter without selling or putting his current assets at risk. Trying to do this with the uncertainty with the fed, economy and inflation will be difficult. \n\nPair that with Twitter might have more bots than expected whoever is giving Musk money for the purchase is going to want collateral (which Musk doesn’t want to do) or assurance that the user/bot numbers are accurate.", "score": 1, "replies": [{"body": "That's actually a really good point. We won't know whether Musk's private financing deals are secured against his equities. It's possible Musk feels more comfortable collateralizing his shares with a private partner rather than a bank.", "score": 0, "replies": []}]}, {"body": "Damn that misaligned panel on that Tesla", "score": 0, "replies": []}]}
{"title": "Elon Musk says Tesla will have self-driving cars without the need for human drivers this time next year", "selftext": "", "id": "uxm278", "created_utc": 1653498605.0, "score": 51, "upvote_ratio": 0.76, "num_comments": 62, "comments": [{"body": "How many days are articles going to keep taking the same comment and republishing it?\n\nHe will be right eventually.  V11 will be a good benchmark to see how close.\n\nEdit: v11 now in shadow mode according to green.", "score": 47, "replies": [{"body": "He's definitely right this time!", "score": 1, "replies": []}, {"body": "Did wholemars put a tweet out? I can’t find it", "score": 0, "replies": [{"body": "He did…will try to find it. Maybe yesterday?", "score": 1, "replies": [{"body": "Probably a retweet from the hacker green, May 22: [https://twitter.com/greentheonly/status/1528486518536523779](https://twitter.com/greentheonly/status/1528486518536523779)", "score": 6, "replies": [{"body": "Yes sorry. Green not mars…thank you!", "score": 2, "replies": []}]}]}]}]}, {"body": "Here we go again", "score": 37, "replies": [{"body": "On my own", "score": 10, "replies": [{"body": "Going down the only road I’ve ever known?….", "score": 5, "replies": [{"body": "Killed a drifter to get an erection and walk alone!", "score": 9, "replies": []}]}]}, {"body": "*same old song again*", "score": 2, "replies": []}, {"body": "Elon predicts and no promises.", "score": -1, "replies": []}]}, {"body": "Back in July 2017 when we bought our Model S he said we’d have that by Christmas… 😂🤣😅🥹", "score": 25, "replies": [{"body": "I think he keeps it up for the new buyers - got to initiate them into Elon FSD prediction disappointment to truly have the Tesla experience.", "score": 6, "replies": []}, {"body": "At one point I think in 2020(?) he said they started over to do it a different way or something. Whether that’s true or just what they said to buy them some time….whose to say", "score": 1, "replies": [{"body": "> At one point I think in 2020(?) he said they started over to do it a different way or something.\n\nBefore they were using machine learning, but now they've switched to AI.", "score": 3, "replies": []}]}]}, {"body": "😂", "score": 20, "replies": []}, {"body": "This time, for real. \n\nI'm not sure if I want to add the /s. I hope not.", "score": 5, "replies": []}, {"body": "Two weeks or next year? Which one you prefer or believe?", "score": 8, "replies": []}, {"body": "RemindMe! 1 year", "score": 3, "replies": [{"body": "I will be messaging you in 1 year on [**2023-05-26 03:29:45 UTC**](http://www.wolframalpha.com/input/?i=2023-05-26%2003:29:45%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/teslainvestorsclub/comments/uxm278/elon_musk_says_tesla_will_have_selfdriving_cars/ia0uvxu/?context=3)\n\n[**6 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fteslainvestorsclub%2Fcomments%2Fuxm278%2Felon_musk_says_tesla_will_have_selfdriving_cars%2Fia0uvxu%2F%5D%0A%0ARemindMe%21%202023-05-26%2003%3A29%3A45%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20uxm278)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 3, "replies": [{"body": "Well he was wrong but FSD beta is getting pretty damn good", "score": 3, "replies": []}]}]}, {"body": "I love the tech, but he should *seriously* stop talking about the release. Just say we'll release when it's done. He has tried and tried to pump the stock with FSD for so long.\n\nElon, it's under promise, over deliver not over promise and under deliver, remember?", "score": 9, "replies": [{"body": "I think he's just excited, optimistic, and isn't remotely as in touch with the software team and development as he is with other aspects at Tesla.", "score": 2, "replies": []}, {"body": "Elon IS NOT trying to pump the stock. If that was his goal, he's fucked up more times than I can count.\n\nRegarding a later comment:\n\n>I think he's just excited, optimistic, and isn't remotely as in touch with the software team and development as he is with other aspects at Tesla.\n\nIt's not that. They are literally doing a new kind of scientific endeavor. Elon's non-FSD optimism has been much closer to reality because he has a physics/engineering background. This sort of problem is very different, and it will take a while before humanity has internalized the workflow/expectations for deep learning at this scale.\n\nI thought his predictions 5 years ago were laughable. I thought his discussion of robotaxi a couple years ago was thought-provoking but remarkably premature.\n\nHis predictions about this time next year? I'm cautiously optimistic. Elon's expectations are converging to reality.", "score": 1, "replies": []}]}, {"body": "bitch please, can’t even get me that model y ordered back in january by this time next year", "score": 3, "replies": []}, {"body": "Thinking about Teslas running through the Las Vegas boring tunnel without drivers.  Yup, that fits the quote.\n\nSo Vegas will give permission to pull drivers by this time next year.  Makes perfect sense.", "score": 6, "replies": [{"body": "Oy Vey, is this actually the case?? Electrek didn't provide the original quote with context, if what you say is true then this statement is horribly misrepresented.", "score": 0, "replies": []}]}, {"body": "I mean, I *want* to believe this. We all do, right? But all the smartest minds in AI driving have been saying this will happen for a very long time. It's going to remain impossible, until it isn't.", "score": 6, "replies": [{"body": ">It's going to remain impossible, until it isn't.\n\nI still don't understand how anyone thinks it's impossible. Imagine seeing the Wright Brothers make the first flight in history and following it up with, \"Yeah, but they needed to have perfect conditions and only flew for like 3 seconds... it's never going to work...\".\n\nI really don't understand how anyone can watch FSD Beta or even WayMo vehicles drive around autonomously and then turn around and say, \"well, it took that turn a little too sharply and sometimes it hits the brakes kinda hard... it's never gonna work...\" with a serious face.\n\n>all the smartest minds in AI driving have been saying this will happen for a very long time.\n\nKeep in mind, \"the smartest minds in AI\" have only been working on this type of AI for like 5-10 years. [This technology (deep convolutional neural networks) only gained popularity in like 2012](https://arstechnica.com/science/2019/12/how-neural-networks-work-and-why-theyve-become-a-big-business/), before then neural networks were mostly experimental.\n\nSome of the newer breakthroughs have literally only happened within the last few years, like self-learning techniques that allow for [depth-estimation using cameras](https://youtu.be/eTYcMB6Yhe8) (Tesla uses this for their pseudo-lidar, it's why they don't need radar or lidar), and [transformer neural networks](https://www.techtarget.com/searchenterpriseai/feature/Transformer-neural-networks-are-shaking-up-AI) that allow for more context-based decision making with less computation (Tesla uses these for the new lane line detection so they can 'trace' the lanes and selectively ignore lanes that don't matter for a given maneuver).", "score": 13, "replies": [{"body": "I don't disagree with what you say, but perhaps the biggest change has been in expanded computational power. Deep learning and neural networks couldn't have taken off in 2012 without cheap processing power, and the need for even more processing ability specifically to learn self-driving is why Tesla has felt the need to design its own chips and the Dojo supercomputer.\n\nOne of the debates about whether Tesla's can achieve L4/L5 with existing vehicles is whether the current Hardware 3 is capable enough.", "score": 5, "replies": []}, {"body": "For people with simple minds like this I like to tell them why WD40 is named the way it is.  WD stands for Water Displacement and the 40 stands for the 40th attempt to get it right.  This is infinitely harder problem, so it's going to take them some time.", "score": 4, "replies": [{"body": "The problem is they didn't sell WD-2 and promised WD-40 by next year", "score": 3, "replies": [{"body": "LOL, yes that's the problem.  He has been promising it for too long, so people have become sceptical.  Which is fair enough, but I think they will figure it out one day, just when?", "score": 2, "replies": []}, {"body": "Well yeah… the process for going from\nWD-2 -> WD-40 could be done in private. You could make a formula, and then test whether it works in-house until the formula was just right. \n\nHow can they test how a version of FSD will perform on millions of miles of roads in the USA “in house” at Tesla? The short answer: you can’t. You have to deploy the software to larger and larger groups of people and capture examples of failures along the way in order to make FSD better/safer for the next/larger group of people.\n\nThat’s why this technology is called machine *learning*. It needs to try, fail, and record examples of those failures in hundreds of different driving environments in order to make any improvements. You can’t just build this in private and then deploy a fully working FSD by surprise one day. It’s just not how the technology works. \n\nAlso, I hate the term “promise” for stuff like this. I don’t think I’ve ever heard Elon say, “I promise it will be done by X.” I’ve heard him say he’s 100% confident, but that’s VERY different from promising someone. Ones an estimate, the other is a commitment.", "score": 1, "replies": []}]}]}]}]}, {"body": "Et: 2016", "score": 2, "replies": []}, {"body": "Also, I think HW4 will go into robotaxis, which I think is the minimum necessary for FSD at Level 4.", "score": 2, "replies": []}, {"body": "Disappoint me again, daddy 😍\n\nSeriously though, I'll hope for the best. It'll be interesting to see the progress as its made. On the plus side, they've gone a while without nearly restarting from scratch, so maybe they *are* finally on the right track", "score": 2, "replies": []}, {"body": "Great we will have self-driving Tesla car in 2026. (Convert from Elon time)", "score": 2, "replies": [{"body": "That would be fantastic.", "score": 1, "replies": []}]}, {"body": "For realz this time? 🙄 \n\nThey'll get there eventually, and probably ahead of others, but good lord Elon shuddup for a bit.  Sheesh.", "score": 2, "replies": []}, {"body": "Lucy says she's going to let Charlie Brown kick the football this time too.\n\nSeriously, just show us when it works and quit making me feel stupid for believing this same rhetoric five years ago.", "score": 2, "replies": []}, {"body": "🎶 *here we go again…* **SAME OLD SONG AGAIN**🎶", "score": 2, "replies": []}, {"body": "So using your customer as Guinea Pigsis the Solution?", "score": 2, "replies": []}, {"body": "Fool me thrice", "score": 1, "replies": []}, {"body": "Ofcourse we will. And I will start to shit out gold bars in the morning, so I don’t have to work anymore !!! :)", "score": 2, "replies": []}, {"body": "Check back in 2030.. er, 2032.", "score": 0, "replies": []}, {"body": "I can see it happening by then. Progress is good. Probably only in geofenced areas though. Which is fine.", "score": 0, "replies": [{"body": "Not geofenced. The whole point of Tesla's approach is it doesn't have to geofence like amateurs at waymo. Tesla is truly solving the fsd problem.", "score": 6, "replies": [{"body": "Fsd is slightly geofenced right now with respect to places that Tesla know fsd can't handle", "score": 3, "replies": []}, {"body": "I mean, yeah, their approach doesn't NEED to be geofenced to certain areas, but you're majorly misunderstanding the tech if you think FSD will be ready for driving autonomously in India at the same time it's capable of driving autonomously in California.", "score": 5, "replies": []}, {"body": "Obviously the end goal is to not have to geofence anything. I'm just saying within this speficic timeline geofencing would enable full operations quite easily.", "score": 2, "replies": []}, {"body": "It will be \"geofenced\" to US only initially, most probably. Other regions will need some re-learning (e.g. Europe) and places like India can be challenging :)", "score": 1, "replies": []}]}]}, {"body": "but still hope that they have human handover emergency plan", "score": 1, "replies": []}, {"body": "Brah stop", "score": 1, "replies": []}, {"body": "Didn’t he say “this year” during the recent TedTalk?", "score": 1, "replies": []}, {"body": "\"He has been wrong 26 times before, so he will be wrong this time and future times.\"\n\n\\-That's the mentality of a dumb monkey.\n\nThe correct view is: why it didn't work? What's the current approach? Does this approach make sense? How is the progress? What's the probability for it to work in a year or two?", "score": 1, "replies": []}, {"body": "the pump lol", "score": 0, "replies": []}, {"body": "I’ll gladly pay you Tuesday for a cheeseburger today", "score": 0, "replies": []}, {"body": "Enron at it again", "score": -5, "replies": []}, {"body": "removing the whole steering wheel and pedals and the related HW I believe Tesla will be able to deliver the famous sub $25k car. Private consumers won't like it in the beginning, but I think plenty of taxi/transportation options for companies could be extremely interested in this technology. Over time, all those who don't like driving or can't due to age, physical problems, revoked driving license, etc will buy this kind of car as well", "score": 1, "replies": []}, {"body": "Andrej better come back or it will delay.", "score": 1, "replies": []}]}
