{"title": "Entered 50K on tesla this week", "selftext": "My earning this week are very good, the question is should I stay or should I leave?  \nOn the one hand I like Elon a lot, he knows how to deliver a good product.\n\nOn the other hand - 7 percent in a week, might have  some correction?\n\nGuts feeling - stay until the earnings,\n\nBrain -  join after the earnings,\n\nWhat do you think?", "id": "mqlzvy", "created_utc": 1618387448.0, "score": 5, "upvote_ratio": 0.57, "num_comments": 35, "comments": [{"body": "I feel like it might go up or it might go down", "score": 91, "replies": [{"body": "I think it will go right", "score": 21, "replies": [{"body": "Oh I think you mean left", "score": 3, "replies": [{"body": "No, that’s in Australia where its the opposite", "score": 8, "replies": []}, {"body": "\"Up and to the left\" was last year. Unfortunately I think from here on out we'll have to stick to the more conventional 'up and to the right'. Le sigh.", "score": 2, "replies": [{"body": "My portfolio: “I don’t understand, Imma go down”", "score": 1, "replies": []}]}, {"body": "Did you know your brain inverts all the images it processes?", "score": 1, "replies": []}]}]}, {"body": "Are you a cnbc analist? I think you're qualified", "score": 5, "replies": []}]}, {"body": "Time in the market beats timing the market! Elon puts out a tweet and the stonk moves, tesla is just unpredictable. it’s been down for a while but rallying again so it may continue for a few days", "score": 10, "replies": []}, {"body": "Take profit cover original investment (or a little more if you want some extra play money) and the shares left are 100% profit and you can see how far it may go.", "score": 14, "replies": []}, {"body": "Buy more", "score": 7, "replies": []}, {"body": "Earnings are always a gamble. Anything can happen even on good news", "score": 4, "replies": []}, {"body": "Take profits at open today. Premarket looks good so far as it’s up another 2%", "score": 7, "replies": []}, {"body": "Set a stop loss that will lock in profit you’re comfortable at and let it ride", "score": 3, "replies": []}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Elon becoming a trillionaire will make me a multi-millionaire. Unless TSLA flatlines and all his gains are in SpaceX. That would make me most sad.", "score": 1, "replies": []}]}, {"body": "I’ve put more time into tsla than anybody you will ever meet or know.\n\nThis is not advice, this is a data point for you among many.\n\n\nForget about your $. Don’t watch it. It will grow.\n\nDon’t stress over it. Don’t have it be a thing.", "score": 5, "replies": []}, {"body": "Tesla acares me\n.\n\nI always say no its too high. then it growa 20% then it dips 20% and i say its too high. then it grows.\n\nI could have made alot on tesla alas I did nothing", "score": 6, "replies": []}, {"body": "If you sell now you'll regret it a couple years from now.", "score": 4, "replies": []}, {"body": "Hold. Trailing stop loss set at $30.00 after price hits $850.00", "score": 3, "replies": [{"body": "Be careful with that, a trailing stop at $40 made mine sell at $570 on the way up in December. Stock went over $800 a few weeks later. Tesla is so volatile yo mu can easily lose your shares.", "score": 2, "replies": []}]}, {"body": "If you're thinking about what to do with Tesla short term, I think you should stop worrying about selling and start worrying about where you went wrong mentally...", "score": 3, "replies": []}, {"body": "Gee I don’t know Mr, maybe ask the twitterverse!", "score": 1, "replies": []}, {"body": "it will run up before earnings and then fall so prepare to sell the news but i wouldnt do it yet", "score": 1, "replies": []}, {"body": "How's your gut reactions track record? Mine is great so I tend to trust it.", "score": 1, "replies": []}, {"body": "More often then not, it runs up the week before earnings and then the week of earnings down/flat and then the weeks after earnings it drops chunks.", "score": 1, "replies": []}, {"body": "lately all stocks have been taking a dive after earning reports. I usually dump all or more then re enter after if I want", "score": 1, "replies": []}, {"body": "Take your gains and set up your stops. That’s all.", "score": -1, "replies": []}, {"body": "Take profits", "score": -1, "replies": []}, {"body": "This is the way", "score": 0, "replies": []}, {"body": "Buy more", "score": 0, "replies": []}, {"body": "Have you considered using [Binance] (https://www.binance.com/en/register?ref=RFF0U7TG) to trade $TSLA?", "score": -3, "replies": []}, {"body": "I usually sell half. Buy in again at the dip. If you’re bullish on the stock, you could just hold.. but it’ll probably correct at some point in the near term.", "score": 1, "replies": []}]}
{"title": "Walmart Thesis Statement (04/07/21)", "selftext": "Did my own personal DD on a few companies and WMT stood out.  Thought I would share it here.  Not really looking for comment or criticism just sharing my own findings.  I've been writing my own thesis statements for investments > $10,000 for the last few years.  My last successful venture was $DIS and I also shared my thesis statement here around two years ago.  Full disclosure, I've purchased 80 shares as of this morning.  Writeup was completed as of 04/07/21 and I will send my analyses via excel to anyone interested.\n\n**Walmart Thesis Statement:**\n\nWalmart Corp. is growing its eCommerce presence and maintains a dominant position in the retail industry. Walmart is able to differentiate from its competitors due to the niche market of affordable products in a brick and mortar format that is augmented by its growing online presence. Walmart maintains the highest revenue amongst its competitors (listed below) and is currently relatively undervalued due to short-term financial statements which show a negative net income growth which can be directly attributed to investments in online growth. Assuming a rational market, Walmart is undervalued relative to its direct competitors. It maintains its market capitalization as a retail corporation which will reap the benefits of a growing online economy.  In this paper, a justification for a Market Capitalization of $500B will be made with supporting fundamental and competitor analyses.\n\n**Background Information:**\n\nPrice as of Wednesday, 04/07/21: $140.16\n\nDirect Competitors: Amazon, Target, Costco, Kmart, Kroger, ALDI, Walgreens, Tesco, Carrefour, Best Buy\n\nMarket Capitalization: $394.78B\n\nP/E Ratio: 29.53 (Growth Mode)\n\nDiv. Yield: 1.57%\n\n52-wk high: $153.66 (9.63% Upside) approx. December 1st 2020\n\n**Benefits:**\n\nAs of Wednesday, 04/07, Walmart is the lowest risk retail conglomerate and is priced at a multiple less than its direct competitors including Target and Walmart. Walmart is currently in the midst of a transition to eCommerce which has not yet been sufficiently reflected in its Market Capitalization.\n\n**Competitor Analysis:**\n\n[**https://imgur.com/a/XBizaMp**](https://imgur.com/a/XBizaMp)\n\n**Conclusion:**\n\nA conservative P/E ratio of 40 would bring Walmart in line with its three top competitors. This computes a 36% P/E ratio increase. This P/E would result in an increased EPS of $9.87/share; in line with Costco and slightly higher than Target. Adjusted Market Capitalization to offset this P/E increase can conservatively be estimated at 25%. A fair valuation for Walmart can then be computed at a Market Capitalization of $500B. Translated to cost per share, a sell price of $176.93 can be computed.\n\n**Debrief:**\n\nIn the coming year, the most important metrics to watch in Walmart’s financial statements will continue to be Revenue, and P/E Ratio. Also important is Walmart’s net income which will be the star of the show as a turnaround in this financial datum will likely result in an increased price per share.", "id": "mqzmof", "created_utc": 1618433140.0, "score": 56, "upvote_ratio": 0.88, "num_comments": 32, "comments": [{"body": "This is what I want to see more of. Less memes & screenshots", "score": 46, "replies": [{"body": "Agreed, however it received six comments including mine in almost an hour after being posted. I guess it's just not sexy enough.", "score": 13, "replies": [{"body": "Fundamentals are boring. 🤷‍♂️", "score": 6, "replies": []}]}, {"body": "How are you so sure this is not a very convoluted meme?", "score": 12, "replies": []}, {"body": "Me too. But, why put money into a market that is going to take a massive hit. Take your money out. Buy shit on sale. Gonna happen, structurally the DTCC has been (quickly) putting in place rules. Gary Gensler (Co-led the restructure of 08 Crash) just voted in as Chairman of SEC.", "score": -2, "replies": [{"body": "Got a link for those rules?", "score": 1, "replies": []}]}]}, {"body": "Nice job! shows only good, what risks did you find?", "score": 8, "replies": [{"body": "Risks are boundless.  Most would say increasing bottom line due to increased COGs and the over-exaggerated impacts of increased min. wages.  I think the largest threat to any company is the counterbalance to their largest opportunity.  In this case, online presence and maintaining hold of retail sector.  So in my mind, the largest threat/risk would be the flop of Walmart's multi-billion acq. of flipkart.", "score": 13, "replies": [{"body": "Really appreciate you doing this", "score": 1, "replies": []}]}, {"body": "Yeah, nice job! We need more of this.\n\nOne risk / gripe is the idea of a P/E ratio of 40 as being conservative for a company in this stage of growth. That strikes me as definitely not conservative.\n\nFWIW, I also added WMT recently and will be a long term holder.", "score": 1, "replies": []}]}, {"body": "Hey buddy. I've researched walmart to no end fundamentally, and everything points towards the steady growth and transition into a more profitable company.  The CEO has goals to see walmart with 3x profitability compared to the 2-3% they get now. With advance in inventory control tech thru surveillance and automation it eases issues that walmart deals with.\nTheft, mis count, etc etc. With they're massive presence around the entire world you can pretty much count on their supply chain being supplied. It kind of saddens me though..... because to me a world where we see justification in contributing to wal-marts bottleneck like economy which only continues to reshape consumers and repurpose their profits to self interested campaigns of more profit. Capitalism is so dead, like what the hell are we going to do in 40-50 years at this point?\nHell even 10 from now,  will mf society still have room to press the gas and drive sales and blah blah I mean its incredible how this stuff works.  I just don't fit in today's world I guess", "score": 13, "replies": [{"body": "Hi friend.  With you in your sentiment.  Doesn't mean we can't turn a profit as the world sheds its soul.", "score": 10, "replies": []}, {"body": "> Capitalism is so dead,... I just don't fit in today's world I guess\n\nYeah I'd say so.", "score": 2, "replies": []}]}, {"body": "I would love to see the analysis you mentioned via excel. really cool post . Thank you for taking the time to make it.", "score": 3, "replies": []}, {"body": "u making me want to  buy some...hmmm", "score": 3, "replies": []}, {"body": "Nice DD. One question does your thesis consider market share? Because it looks like your thesis is based on the fact that walmart will gain more market share from the competition. Am I understanding your thesis correctly? Because in my mind, for one company to be in line fundamentally with its competitors they would have to gain more market share from them. Or at least increase their footprint in  the sector with a new business model. Please correct my view on this.", "score": 2, "replies": [{"body": "Hi.  Yes, in fact my thesis statement is based on the premise that Walmart currently has a majority of retail market share and is strategically placed to build on that market share via eCommerce.  There's a lot you're missing and it may be better to address it via a PM but in essence, fundamentals in market analysis refer to looking at financial statements and drawing conclusions from data such as multiples and financial ratios.  \n\nThe theory is that companies in the same industry should share similar financial metrics.  This becomes increasingly difficult in a blended market where companies such as Amazon are doing more than one thing so their multiples result in outliers from the norm.    \n\nMaybe I can address u/7loUge and u/Stock_Resolution7866 here as well.  P/E is simply the price per share over earnings per share.  Typically, or so I was taught, a P/E under 15 is indicative of a value stock whereas a P/E greater than 15 is a growth stock.  Has Walmart ever been at a P/E of 40?  Of course not.  But then again, Walmart has never been considered an eCommerce retailer until very recently.  There's certainly a paradigm shift in HOW Walmart does things not so much what they do.  To say that 40 is not viable long-term is to also say that a P/E of 70+ for Amazon is irrational.  Whether it is or is not doesn't matter in this analysis.  The bottom line is that in a fair market, WMT is undervalued.  \n\nKey takeaway:  Walmart doesn't have to grow their business through eCommerce (though they will) to increase their Market Cap. there are scores of ways they can do this.  One such way is if they maintain market foothold while decreasing operating costs through eCommerce.  I do not believe a P/E of 40 is irrational whatsoever.  Sometimes people look too closely at a stock and forget the only thing that matters.  Market Capitalization.  WMT is a $400B company and Amazon is at $2T (? fact chk.).  Yet Walmart has a much larger share of retail and more distribution channels.  Now obviously its much more complicated than that.  But to say WMT can't reach $500B market cap. which, all things being equal, directly translates to a P/E of 40, is false.", "score": 4, "replies": [{"body": "Ty for the explanation. But don't get me wrong, I am very thankful 🙏 for your insight and I'm very bullish on WMT. In fact I recently bought in after they announced their fintech startup business. This is because I am more of a business model and leadership driven buyer. Only thing I'm bearish about WMT is the CEO. He has not so good approval rating and when I went through his track record, he is more of a broadening business type guy. But WMT should focus its efforts in efficiency now more than ever imo. WMT is losing its footprint in Asia due to high cost of operations. Also for fintech business model I went in because I thought it would give them more efficiency not because they are broadening their footprint in e-commerce.(Also that part of fintech is already populated by companies like Square and Stripe. So unless WMT aquires a fair size fintech company, their entry barrier will be quit high, imo)", "score": 3, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Oh shut up I’m replying here lol I’m just saying clearly he/she’s new and there’s a lot he/she is missing so I may be able to help clear it up. And comparison is limited to apples to apples? Are you kidding me? I said I’m not looking for comments for me. Feel free to offer comments. This fundamental analysis is for me and has been peer reviewed but don’t try to neg it’s bad for the community.\n\nEdit: very flustered that you would say comparisons only work on apples to apples. Don’t spread false information especially when someone is clearly learning. If what you said were true, then competitor analyses would be horseshit.", "score": 3, "replies": []}]}]}]}, {"body": "would love to take a deeper look into your excel file if you don't mind sharing. i bought some walmart after doing a little DD into their transition to e-commerce but tbh after personally trying to order some stuff, i am less confident in their abilities to rival amazon. i think its undervalued relative to the rest of the market, but thats only because everything else is so ridiculously overvalued", "score": 2, "replies": []}, {"body": "Any other strong blue chips you recommend?", "score": 2, "replies": [{"body": "COST, MSFT, DIS", "score": 6, "replies": []}]}, {"body": "I'm very heavily in ETFs (a lot that have WMT) and my single biggest position is also WMT with 6 shares. I'm actually -4.5% on them right but I'll buy more because I feel the same about it. Dividend yield is nice, the runup over the last year hasn't been too explosive to where I feel like it can't go up anymore, and the fact that it's significantly down from ATH (without any real news that I know of) gives me confidence that it can hit those values again.", "score": 1, "replies": []}, {"body": "I picked up WMT about a year ago (March, 2020) and sold out of it about a week ago at $136 (give or take).  \n\n* It moved very slowly.  \n* Dividends were nice, but growth is nicer\n* There were better options out there\n\nSo it may be a good deal, I simply found other deals to be more compelling and liquidated my position.  Their leadership has struggled with the ecommerce side of things, the app needs work and their purchase-to-pick fails for me many times (in stock, to out of stock or swapped ... long waits to pick up, etc.), and I'm seeing struggles with their technology and employee engagement.  \n\nI do not consider them \"in growth mode\" at this time and wouldn't consider re-investing.", "score": 1, "replies": []}, {"body": " [Can Walmart Catch Amazon In E-commerce? - YouTube](https://www.youtube.com/watch?v=XuO2EqRddHM&ab_channel=CNBC) \n\nIf you read the comments, you might get a different idea about Walmart. In my opinion, it looks like Walmart's management is a little bit old-school. They can talk the talk but can they walk the walk?", "score": -3, "replies": [{"body": "Citing comments on Youtube as a counterpoint to a fundamentals thesis is very cash money of you.", "score": 18, "replies": [{"body": "This made me genuinely laugh, your thesis has convinced me to invest in walmart. I just made back the money i dumped into doge on the hype train a few months back. -_- How long is the end game in a consitent investment like this?", "score": 5, "replies": [{"body": "Depends what your thesis is.  My thesis is that to be fairly valued, Walmart would have to reach a PPS of $176.93 for its fundamentals to be in line with its competitors while factoring outliers such as the multiples of Amazon.  My theses never include a timeline because I do my best to value the asset at its fair market value which is different than the current market value. Hopefully that answers your question.", "score": 2, "replies": []}]}]}]}, {"body": "My call option exp in may after earnings got smashed pass two day but I might hold a bit more and see I think we get a bounce soon", "score": 1, "replies": [{"body": "Why trade options on low beta stock?", "score": 3, "replies": []}]}]}
{"title": "AAPL ER YOLO. $150 BY EARNINGS 🍏", "selftext": "[deleted]", "id": "mqiql3", "created_utc": 1618372711.0, "score": 46, "upvote_ratio": 0.82, "num_comments": 38, "comments": [{"body": "God speed", "score": 17, "replies": [{"body": "Retard", "score": 12, "replies": []}]}, {"body": "Bought AAPL $130c on the run last week and paper handed way too early. Hopped into these $135c at open today before the beginning of the face ripper rally that we’ll see up until ER on the 28th.\n\nSurprise event announced for April 20th makes me extra bullish. Feeling good Tim!", "score": 9, "replies": [{"body": "Apple car reveal?", "score": 4, "replies": [{"body": "Ah ssshit, the Crapple is back!", "score": 1, "replies": [{"body": "I think I missed the joke....", "score": 1, "replies": [{"body": "That’s the name of the apple car.", "score": 1, "replies": [{"body": "😂😂😂 I heard it also has a snapple car. Teamed up with them and it runs on snapple. IOSEV 4 Update download.", "score": 2, "replies": []}]}]}]}, {"body": "Nah, not yet. Probably main things will be new ipads and the air tags tracker devices", "score": 1, "replies": []}, {"body": "Apple car most likely not even until 2025 :(", "score": 1, "replies": []}]}, {"body": "Yeah i expect it to rip up until ER", "score": 2, "replies": []}, {"body": "iWeed confirmed", "score": 2, "replies": []}, {"body": "Same. Got 5/7 130c and paper handed too. Missed out on 6k. Then got some 5/7 140c...holding these.", "score": 1, "replies": []}]}, {"body": "Its a 135 call and expires mid May. Earnings are a crap shoot though.ill probably sell at 100 percent profit. Thats my target. 2X", "score": 6, "replies": []}, {"body": "⚠️ caution, got totally fucked last crapple er play. Diamond handed to $0 hoping it would turn around.  If you get up 30%+ dump that shit.... IMO.... Good luck fellow Ape", "score": 5, "replies": [{"body": "That’s because you probably held through earnings. AAPL has a pattern of running up to earnings and then trading sideways or falling right after earnings, everyone prices in the beat. Up 50% on AAPL $133 4/30 calls, zero intention of selling until before earnings or AAPL @ $140. Whichever comes first.", "score": 7, "replies": []}, {"body": "I could be wrong, but I believe that was when GME turned into the Space Needle. It tanked the rest of the market, including AAPL, even though they crushed earnings.", "score": 8, "replies": []}]}, {"body": "I bought a bunch of $130 calls back when the stock was at $128. Then it fell forever, and stayed down. Luckily, I made sure the expiration date was far enough out. Looks like my diamond hands are paying off. :)", "score": 5, "replies": []}, {"body": "The current run-up makes me feel all tingly inside with my singular 145 Oct 15 call from March. Better timing and I'd be up almost 100% but alas...\\^\\^\n\nAnyhow, gonna sell on ER and then rebuy after the IV crush for a nice second round against the iPhone release in Sept.", "score": 5, "replies": []}, {"body": "I have a AAPL call will sell before earnings to be safe", "score": 4, "replies": [{"body": "What is your target $", "score": 1, "replies": [{"body": "2X profit", "score": 3, "replies": []}]}]}, {"body": "This shit will print.", "score": 4, "replies": []}, {"body": "Still on Robinhood 🦧", "score": 3, "replies": [{"body": "I’m also on Robinhood along with millions. It’s not going anywhere. Get over it", "score": 1, "replies": []}]}, {"body": "Apple is the original meme stock and has done it over a decade.\n\nI just buy this bad boy and hold.", "score": 2, "replies": [{"body": "AAPL is like the most anti meme stock you could find on the market. Like 50% of billionaires portfolio is aapl and 100% of boomers are aapl", "score": 5, "replies": []}]}, {"body": "I’ve got 2 01/2022 $145c. I’ll be a very happy man if those are itm by earnings lol", "score": 2, "replies": []}, {"body": "In with a few January 145C.", "score": 2, "replies": []}, {"body": "I sold covered calls and my shares got face ripped from me last Friday.  All good tho.  Gains are gains.", "score": 1, "replies": [{"body": "When the price keeps climbing, you will cry inside.", "score": 2, "replies": []}]}, {"body": "I have two contacts for the same expiration. Need more", "score": 1, "replies": []}, {"body": "What did these cost", "score": 1, "replies": []}, {"body": "Going to jump in with you at open. Nothing is ever a sure thing of course but I just can’t see how these don’t print.\n\nEDIT: And I'm in at 26x 140c 6/18.", "score": 1, "replies": []}, {"body": "Hearing a lot of rumors this morning about an apple car contract with magna being imminent... of course still seems like a rumor, but still glad I’m already holding calls", "score": 1, "replies": []}, {"body": "I give this a 1 full Shepard Smith watch.   \n[https://www.youtube.com/watch?v=XB3FMTFNgcg](https://www.youtube.com/watch?v=XB3FMTFNgcg)", "score": 1, "replies": []}]}
{"title": "Nancy Pelosi’s Husband Bought Roblox & Microsoft Stock", "selftext": "", "id": "mqzc8r", "created_utc": 1618432267.0, "score": 20, "upvote_ratio": 0.88, "num_comments": 31, "comments": [{"body": "I think you meant to say Nancy told her husband which stocks to buy", "score": 17, "replies": [{"body": "This sounds more accurate", "score": 5, "replies": []}]}, {"body": "For those wondering why the stock went up yesterday. This was discovered Monday. This may have caused a boom, however, the partnership with Hasbro is more likely the reason it went up.", "score": 3, "replies": [{"body": "This mf obviously knew of the hasbro deal \n\nShady deals all around \n\nWhy would pelosi put $1mil into CRWD sep 30 \n2 months before solar winds hack broke", "score": 6, "replies": [{"body": "They're all just happy accidents", "score": 8, "replies": []}, {"body": "I suspect he might know about other things too (potential switch pro / ps5 / xbox launch).   \n\n\nInsider trading is pretty dodgy, especially from government. Thankfully they do make them public... Unfortunately, it's sometimes after the main news comes out. Think it's by law 30 days after making the trade.", "score": 3, "replies": []}, {"body": "Politicians are officially exempt from insider trading bans. Not joking.", "score": 2, "replies": []}, {"body": "Do you have proof he knew, much like the Republican senators who made bank on the pandemic?", "score": -10, "replies": [{"body": "Keep arguing red vs blue while **they** **all** bend us over. Exactly how they want it.", "score": 15, "replies": []}, {"body": "He's done it a lot. Very coincidental timings.   \n\n\nThey all do it. No reason trying to poke anyone individually.", "score": 5, "replies": [{"body": "Do you have actual proof or are you just saying that?", "score": -10, "replies": [{"body": "Pelosi met with crwd and invested 1 mil big local news\n\nI knew it was sketch so I sat and watched \n\n2 months later solarwinds hack and crwd soars\n\nHe bet big on msft then gov announced a deal\n\nBet big on tsla and Nancy pushed ev credits \n\nThere is no evidence only timing of these buys and timing of the news usually about 1-2 months after she buys", "score": 9, "replies": []}, {"body": "What are you expecting I would have as proof?   \n\n\nIt's insider trading. Everyone calls it that.", "score": 8, "replies": []}, {"body": "Do you have an actual brain that can think critically?? Evidently, NO is the front runner here.", "score": 5, "replies": [{"body": "So your opinion is a suitable substitute for facts. Got it. If you have proof a crime was committed, feel free to contact the DOJ.", "score": 1, "replies": [{"body": "I offered no opinion whatsoever concerning unscrupulous politicians. Only an opinion on your brainpower. \n\nRepublican guilty. Democrats nope. Got it. Red vs Blue. \n\nWho said anything about facts?? Oh wait, you did. \n\nAfter insinuating republicanucks who did/do the exact same thing demowhatevs did.  Cool angle bruh. Career politicians are slime. The world over. Welcome to the real word kid.", "score": 1, "replies": []}]}]}]}]}, {"body": "Reeeeeeeeeeeee", "score": 5, "replies": []}]}]}, {"body": "Why did it go down lower than yesterday's open today?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I was thinking because the 80mil volume Coinbase IPO release fucked like half the market", "score": 1, "replies": []}]}]}]}, {"body": "Nancy Pelosi. Skeletor. Smart for making money for herself but hands down one of the most evil politicians out there.", "score": 3, "replies": []}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "He was early on PayPal and Visa as well.", "score": 3, "replies": [{"body": "I have to wait a few days to see who bought into coinbase, but I'll post it here as soon as I find out!", "score": 6, "replies": []}, {"body": "Being early is different then buying right before the news breaks in almost every stock her husband buys", "score": 1, "replies": []}]}, {"body": "She’s so hot", "score": 2, "replies": [{"body": "Yikes dude", "score": 2, "replies": [{"body": "I stand by it", "score": 0, "replies": []}]}]}, {"body": "And her son was on the board of alt reporting diluting pot companies.", "score": 1, "replies": []}, {"body": "Think of this. This is a politician’s loophole to get the stimulus money indirectly. We rarely hear politicians have position on stocks and options pre-pandemic. Now, it is more common that politicians get positions on a stocks or options during the economic impact payment. Why? Because when we get our stimmy, we got to spent it in the casino", "score": 1, "replies": []}]}
