{"title": "$TSLA Daily Investor Discussion - July 21, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "cfx6pn", "created_utc": 1563700565.0, "score": 21, "upvote_ratio": 1.0, "num_comments": 80, "comments": [{"body": "Am charging in Fátima Portugal right now, 14 stalls... 8 Model 3’s, all with Portugese license plates.  \n\nI bet they paid the drivers to drive around in these things to make it look like a popular car /s\n\nEDIT: number 9 just showed up", "score": 31, "replies": [{"body": "They must have, who in the world wants to drive a Tesla? /s", "score": 3, "replies": []}]}, {"body": "We're going to the moon", "score": 13, "replies": [{"body": "Mars we go.", "score": 6, "replies": [{"body": "... so... 142 times (at least) higher than the moon?  Feeling optimistic?  :)\n\n&#x200B;\n\nHow high is \"to the moon\", anyway... in terms of TSLA performance as reported this Wednesday?  >$1B?  It'd have to be nearly unattainable.", "score": 1, "replies": []}]}]}, {"body": "See my profile for the completed parts 1-4 of the battle of helms deep: TSLA", "score": 33, "replies": [{"body": "Damn I actually got goosebumps.\n\nEdit: If earnings kill you should do a bonus return of the king scene, the garbage ending one with everyone hugging for 10 minutes.", "score": 11, "replies": []}, {"body": "You’ve broken the 4 year silence between my  father and I.  Thank you.", "score": 8, "replies": [{"body": "Lol are you serious", "score": 5, "replies": [{"body": "Haha on a real note, It’s the only thing I’ve shown him online that has made him laugh.  We don’t talk/bond about anything other than Tesla related things.  We’ll talk for hours a day about Tesla, shorts, EVs, Musk etc. to the point that it’s a running joke in my family.", "score": 7, "replies": [{"body": "That’s crazy dude, but good for you", "score": 6, "replies": []}]}]}]}, {"body": "Is Tesla is at 420 by December I’ll be rich and this will age very well.", "score": 6, "replies": [{"body": "avg 317 w/ 300 shares.  420+ would be nice right about now.  been sitting red for such a long time.", "score": 2, "replies": []}]}, {"body": "Should have chose you to do the Hobbit", "score": 5, "replies": [{"body": "Are you calling him short?", "score": 7, "replies": [{"body": "I feel attacked", "score": 6, "replies": [{"body": "Cheer up little fella", "score": 1, "replies": []}]}]}, {"body": "Which scene?", "score": 1, "replies": [{"body": "All of them. The whole trilogy was a cockup.", "score": 1, "replies": [{"body": "Oh I feel you. Are you the real Elon?", "score": 1, "replies": [{"body": "No just the real elonsmonkey.", "score": 1, "replies": [{"body": "Give me a job bro", "score": 1, "replies": [{"body": "Count skabooshka's at Fremont plant.", "score": 1, "replies": [{"body": "lol holy shit what a nutcase", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "This is the best thing I’ve seen on Reddit", "score": 3, "replies": []}, {"body": "you got part 4 already?", "score": 1, "replies": [{"body": "Yea see profile", "score": 1, "replies": [{"body": "saw it. i'm expecting those exact outcome come dec 2019!", "score": 1, "replies": []}]}]}, {"body": "For those too lazy to hunt:\nhttps://streamable.com/trj5d", "score": 0, "replies": [{"body": "That’s just part 4 boi", "score": 1, "replies": []}]}]}, {"body": "Wish Elon would guide slightly lower on purpose but keep the actual guidance internal. Would stop the media onslaught every quarter when they very slightly miss.\n\nHis guidance is so lofty that even if he lowered it 10% then analysts would believe it is a legit guidance.", "score": 19, "replies": []}, {"body": "Shorts still haven't covered. Shared shorted still over 41m .  That's a lot of rocket fuel.", "score": 19, "replies": [{"body": "Where did you get the latest number?", "score": 8, "replies": [{"body": "Probably from [Ihor Dusaniwsky](https://twitter.com/ihors3/status/1151935986076700673?s=21) on Twitter.\n\nI don‘t know how accurate their algorithm is, though.", "score": 3, "replies": [{"body": "It's pretty good, but not completely accurate. It updates to real data when NASDAQ publishes the semi-monthly data. It's probably about 70-80% accurate? I say this because recently he was overestimating the shares sold short and did not forecast a reversal in June until official numbers came out.", "score": 3, "replies": [{"body": "If it is semi-monthly data why are there like 8 data points per month? Is the semi-monthly data more than just one day's data?", "score": 1, "replies": [{"body": "[https://www.nasdaq.com/symbol/tsla/short-interest](https://www.nasdaq.com/symbol/tsla/short-interest)", "score": 3, "replies": []}]}]}]}]}, {"body": "Show shares shorted by shorts? Sure as shart a short shorts shares. Got a Tesla now. Mah shevy shook a shit.", "score": 6, "replies": [{"body": "I feel like you're trying to say something but I cant understand your accent.", "score": 17, "replies": []}, {"body": "Ya", "score": 3, "replies": []}]}]}, {"body": "Are the profits form a leased Tesla model 3 realized the same way as a typical car loan? Or is it on some type of time delay?  I don’t know enough on how it works, but if the lease of the model 3 delays the profit then maybe that’s why they guided not to be profitable. With the profits being realized over several quarters or years. Can anyone clarify how Tesla takes in the income from a leased car?", "score": 9, "replies": [{"body": "From their last 10-Q:\n\nAutomotive Leasing Revenue\n\nWe record leasing revenues to automotive leasing revenue on a straight-line basis over the contractual term, and we record the depreciation of these vehicles to cost of automotive leasing revenue.\n\nAutomotive leasing revenue includes revenue recognized under lease accounting guidance for our direct leasing programs as well as the two programs with resale value guarantees described below.\n\nWe capitalize shipping costs and initial direct costs such as the incremental cost of contract administration, referral fees and sales commissions from the origination of automotive lease agreements as an element of operating lease vehicles, net, and subsequently amortize these costs over the term of the related lease agreement. Our policy is to exclude taxes collected from a customer from the transaction price of automotive contracts", "score": 5, "replies": []}]}, {"body": "Thinking they maintain guidance for q3 and q4 -- was pretty lofty to begin with. I can only hope that we get some idea of China reservation numbers, force the market to broaden its outlook. If not thats OK, more opportunity to buy before that reality hits.", "score": 8, "replies": [{"body": "Given 2018 had the mega boost of a giant backlog and 7500$ tax credit, 2019 was always a year of backfilling. Tesla is clearly going for volume over profitability and that strategy should be discussed. Obviously one way to justify it is to say the cars are worth 100k$ due to robotaxi capability which sad to say is not allowed in GAAP accounting, but I don't know how many investors are on that page. Not me.", "score": 3, "replies": [{"body": "I think they hope to make a small profit on higher volumes, perhaps not Q2 but Q3 & Q4.\n\nHigher volumes is to help drive down costs, and tap latent demand....\n\nSo the strategy is higher volumes, but lower margins...  I don't think the process will stop until the 35K Model 3 is on the menu and they are shipping at least 10K per week Model 3s out of Fremont and China... (combined)\n\nFor  Model S/X I think they hope to rebuild to 25K per quarter on better than Q1 margins, essentially plugging that revenue steam back in..\n\nFinally the hope is that Tesla energy will contribute something...\n\nFor Robo-taxis my guess is that the strategy is to keep increasing the price of the FSD software... they need product improvements to justify the increase....\n\nI'm fine with expanding market share, on very low profits, even very low annual profits...for now.", "score": 2, "replies": []}]}]}, {"body": "u/AutoModerator still sleeping? 😴", "score": 8, "replies": [{"body": "he ded", "score": 4, "replies": []}]}, {"body": "I Wonder what elon meant on investor anual meating   when he said that is expected record quarter on \"EVERY LEVEL \", really hope he started underestimate targets then beat expectations if you want to beat short that the way to do it", "score": 21, "replies": [{"body": "That's the big question right there. We know now deliveries, but does this mean fcf is good?", "score": 5, "replies": []}, {"body": "Sorry the way you beat shorts is by building a strong company with healthy margins, consistent demand, and positive cash flow. \n\nPeople act like the shorts are holding this company down. Elon himself is the one setting expectations and delivering guidance to the marketplace.  \n\nQ1 he set guidance of 90-100 and they hit it dead-on. That's how it's supposed to work.", "score": 10, "replies": []}, {"body": "I need one more quarter to accumulate below 300 😁", "score": 2, "replies": []}, {"body": "Turns out he did not mean any financial metrics at all.", "score": 1, "replies": []}, {"body": "Record losses would be a record.", "score": -19, "replies": [{"body": "Your puts are showing", "score": 17, "replies": []}, {"body": "You should probably study", "score": 7, "replies": []}]}]}, {"body": "I got banned from WSB, I guess this is my new home", "score": 4, "replies": [{"body": "What happened 😂", "score": 1, "replies": [{"body": "Was talking politics and I guess a mod got butthurt 🤷‍♂️", "score": 3, "replies": []}]}]}, {"body": "Purchased my first options! Two calls at $260 for 9.10. Excited to see how this turns out and hopefully walk away with thick money", "score": 5, "replies": [{"body": "You're already in the green as of pre-market. Best of luck!", "score": 2, "replies": []}, {"body": "What exp?", "score": 2, "replies": [{"body": "friday", "score": 1, "replies": [{"body": "Dam, good luck my man", "score": 2, "replies": []}]}]}, {"body": "Sorry but I don't think this is going to work out for you. Your breakeven is at 269 while stock is at 255. After IV crush in earnings your calls will be worth nothing unless there's  a massive beat. Next time consider a spread.", "score": -1, "replies": []}]}, {"body": "Around April Elon commented about the Q1 loss and said this:  \n“We expect to return to profitability in Q3 and significantly reduce our loss in Q2,”   \n\n\nDuring the past I learned to take Elon at his word regarding losses. While  his positive guidances sometimes do not materialize, once Elon says there will be a loss (Q1/19) or less profit (Q4/18) the trend almost always turns out to be true.  \n\n\nEach time I hoped for a \"Elon Musk surprises everyone with X\" I was disappointed. (Q3/18 profit was pretty obvious if you read what Elon commented during the quarter)\n\n  \nIn that sense believe Q2/19 numbers to be significantly better than Q1, but I do not expect them to have made a profit. Just like Elon said. Therefore, I'm thinking about selling a few shares and buying the dip afterwards. But there might not be a dip even with a small loss ... tricky decision", "score": 2, "replies": []}, {"body": "Brian Johnson on Bloomberg regurgitating more bearcrap. MSM rarely has bulls on anymore.  Biased much?", "score": 5, "replies": [{"body": "That's one of the major reasons I stopped watching the news.\n\nI used to religiously watch Sunday morning political talk shows. Then I realized they were biased as hell in their guest selection when Scott Walker pushed his anti-union bill in Wisconsin years ago. None of them invited a single pro-union guest on their show, but they all invited plenty of anti-union businessmen. I don't care what the topic is, you'll never get a balanced panel discussion when all of your guests are prominently on the same side of the issue.", "score": 4, "replies": []}]}, {"body": "Pre-market is about 0.1% from reaching $260.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That didn't last long 😅", "score": 5, "replies": []}]}]}, {"body": "So what caused today’s sudden downrun after that spike ? Was there any news or downgrades ?", "score": 1, "replies": [{"body": "No new Tesla LOTR meme :(", "score": 10, "replies": []}, {"body": "Roth capital downgraded", "score": 2, "replies": [{"body": "3 days before ER.", "score": 2, "replies": [{"body": "And they upgraded in June? What’s made them go back on that since? Smh these firms man", "score": 5, "replies": []}]}, {"body": "A downgrade right before earnings? Must be trying to offload some puts", "score": 1, "replies": [{"body": "I mean they were buy before so idk. It’s sketchy def", "score": 1, "replies": []}]}]}, {"body": "Chaos theory. Some interlocking of algos all trying to guess where the stock is gonna go.", "score": 2, "replies": []}]}]}
