{"title": "Now that the Brexit market fear is basically gone, what was your best buy during the chaos?", "selftext": "I bought GOOGL at $689!", "id": "4sgtek", "created_utc": 1468327901.0, "score": 40, "upvote_ratio": 0.8, "num_comments": 74, "comments": [{"body": "Brexit market fear is gone? We haven't even had Brexit yet..", "score": 65, "replies": [{"body": "I read some articles that more than 1000 lawyers claim that Brexit has no legal force. I wonder what do you think about it? Do you feel some difficulties now?", "score": 1, "replies": [{"body": "The vote isn't technically legally binding, but it is EXTREMELY unlikely that the government won't follow it. ", "score": 7, "replies": [{"body": "And how the situation influences on your opinion? What does Brexit mean for you?", "score": 1, "replies": [{"body": "We have no idea how it will affect anything until the negotiations actually happen. From a market perspective, I think the UK and EU banks have been over sold, especially Lloyds and Barclays. \n\nI also think there should be a bit more risk priced into the US market, but I understand why there isn't. ", "score": 3, "replies": [{"body": "Thanks a lot for your post. We can only wait for significant results of this. I want to hope that they will come to a correct decision and people won't suffer. ", "score": 1, "replies": []}]}]}]}, {"body": "The referendum was an opinion poll sure, but that's how the UK works.  It *was* a democratic expression of the peoples will and the cabinet are going to have their feet well and truly held to the fire on this by the back benches.  \n", "score": 1, "replies": []}]}, {"body": "What do you mean?", "score": 0, "replies": [{"body": "I'm British. I can confirm that we are still in the EU and our shitshow of a political class haven't even initiated the legal process for leaving yet (article 50). I don't imagine 'Brexit' will happen until after our next election in 2020. At which point who knows what the British people will vote for? They'll probably vote Trump as king or the cat that lives in 10 Downing Street as PM or something.\n\nPoint is, we still don't even have a clue what Brexit will even look like.", "score": 18, "replies": [{"body": "Do you think May will not trigger the exit and will call an election? I really hope for this but want to know what the general sentiment is in the UK right now. Don't you think there could be an early election instead of waiting for 2020?", "score": 1, "replies": [{"body": "That would probably be best for stability. I'm not sure whether to hope for that or to hold on until 2020 when people's attitudes to Brexit might have changed.\n\nDisclosure: I'm very pro EU.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I was thinking of voting for Obama's dog, Bo. He seems pretty bright and I've heard he's a good boy. ", "score": 4, "replies": [{"body": "what, you'd be voting for a Portuguese immigrant to take office? have an up vote", "score": 3, "replies": []}]}, {"body": "No, we need it just as much as you. :P", "score": 1, "replies": []}]}]}, {"body": "Well I assume he/she means that there will be more volatility due to brexit in the future and Britain hasn't actually implemented their brexit yet....", "score": 4, "replies": [{"body": "The real volatility will happen when we actually leave the EU, which at this rate could be 10 years away.", "score": 3, "replies": []}]}]}]}, {"body": "TSLA @ ~$193 / share", "score": 13, "replies": [{"body": "Grabbed some at 200 which was handy", "score": 1, "replies": []}, {"body": "191.30! Ya baby!  I remember reading lots of comments about people speculating it going down much further and thought I might have pulled to early.  Feels good today though!", "score": 1, "replies": []}, {"body": "I had a chance at $195 but was greedy and $180 was my target. I think TSLA could be an up and down rollercoaster but the upside is huge", "score": 1, "replies": []}, {"body": "That's great. TSLA is my favorite stock. About $193 is an attractive price and you've found the right moment. ", "score": 1, "replies": []}, {"body": "Why is tsla back up?", "score": 1, "replies": []}, {"body": "You caught TSLA literally right at the very bottom? I'm mildly sceptical.", "score": -5, "replies": [{"body": "I remember it being below $189. Was going to pull the trigger myself, but thought it would keep going lower. ", "score": 1, "replies": [{"body": "Fair enough! Good buy then. Absolutely jealous!", "score": 2, "replies": [{"body": "> **Was going to pull the trigger** myself, but thought it would keep going lower.\n\nHe missed out.", "score": 1, "replies": [{"body": "He probably meant the OP had a good buy, of which he is jealous", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Airlines, bought 2 days after the vote at their low. AAL @ 27.80 now $33.60", "score": 6, "replies": [{"body": "AAL @ 26.94 for my first stock purchase ever!", "score": 7, "replies": []}]}, {"body": "SAN at $3.85", "score": 5, "replies": []}, {"body": "$12,000 in VTSMX while we were down big. Worth about 8% more now!", "score": 5, "replies": []}, {"body": "I bought \n\n$F @ $12.08\n\n$TWTR @ $16.29\n\n$APPL @ $91.61 and $93.94", "score": 4, "replies": [{"body": "I was fortunate to jump on $F @ $11.05 few months back", "score": 2, "replies": [{"body": "Yeah I've been trading $F swings for the past year. Started when it was above $15, I've gotten my average price down to like $12.43 and have taken some profits each swing.", "score": 3, "replies": []}, {"body": "It was that low? I've been ignoring it but even then I would get it. ", "score": 1, "replies": [{"body": "My mistake it was at $11.60, still pretty low though", "score": 1, "replies": []}]}]}]}, {"body": "I rolled over my 401k during the shit storm. The timing was awesome. I cashed out the day before the referendum and then it was transferred and deposited the following Tuesday before the bounce back.", "score": 5, "replies": [{"body": "did you plan this", "score": 1, "replies": [{"body": "nope completely lucky. i wasn't really in control of the timing since it required my old employer to approve the request then mail the check to my new financial institute. ", "score": 1, "replies": [{"body": "bad ass", "score": 1, "replies": []}]}]}]}, {"body": "SYF.  Up 18% since Brexit vote.", "score": 3, "replies": []}, {"body": "My best buy was $14/toz. physical silver\n\nedit: I should add, $14-15/ oz was shortly before brexit. ", "score": 5, "replies": [{"body": "Yeah. It hovered near the $14.50 range for about a year and then surged recently. ", "score": 2, "replies": []}]}, {"body": "I bought 20 shares of FB at around $112 and it's up to ~$118. \n\n**Edit:** And just opining here, but the *short term* Brexit market fear is over. There could be more slumps when the terms of the UK's exit are negotiated and when new trade deals are made. We also have to consider the long-term effects of the Pound's depreciation against the dollar/euro, if other countries in the EU will follow suit in exiting, etc. So before we sip on our pina coladas, let's not pretend this is over yet. ", "score": 4, "replies": [{"body": "FB yes, me too! I'm hoping to have enough cash on hand to take advantage of the future volatility stemming from brexit.....", "score": 1, "replies": []}]}, {"body": "Bought some DAL calls. Up 83% now.", "score": 2, "replies": []}, {"body": "X at $15.35. Now over $21. Also DAL at $33.49. Now at $39.50", "score": 2, "replies": []}, {"body": "I sold AUY before Brexit.  I'm not a smart man.  Luckily I'm only doing this for fun with like 50 bucks.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Using Robin Hood.  It's free.", "score": 1, "replies": []}]}]}, {"body": "SPY at $199.75. Not enough of it though. ", "score": 2, "replies": []}, {"body": "Barclays @ 6.99", "score": 2, "replies": []}, {"body": "$LTBR @ $.4289, today's close $.63 (+46.89%) as of today.\n(this is my average cost for this stock, I averaged down)", "score": 2, "replies": []}, {"body": "VIX put options at varying strikes. The 14s and 15s were especially good (in the money now; selling for pennies then).", "score": 1, "replies": []}, {"body": "BRK.B - Dropped to a three month low, almost completely recovered now. ", "score": 1, "replies": []}, {"body": "Bought AMGN (up 7.55%) and CSCO (up 3.23%).", "score": 1, "replies": []}, {"body": "WY at 27.80 14.7% return, feel it was a pretty good move.  Not huge but it's been a good winner for me in the past. ", "score": 1, "replies": []}, {"body": "BAC (up 10.04%).  Sadly it's my best performing stock this year.", "score": 1, "replies": []}, {"body": "Jyske bank, up 5% from then", "score": 1, "replies": []}, {"body": "Puts on the market on 6/20.  Sold them on the 24th.", "score": 1, "replies": []}, {"body": "TDC European telecom stocks Bought very close to the lowest blip on Monday 26'th at 30.60 sold on Friday for 32,81 +9.33% in 4 days.", "score": 1, "replies": []}, {"body": "BGI", "score": 1, "replies": []}, {"body": "Bought $XIV at $21.40\n\nSitting at $28.50\n\nI'm a happy man. ", "score": 1, "replies": []}, {"body": "Indeed, I also see that for a moment Brexit buzz is slowly ceasing. I found a couple of recommendations about what is really necessary to think http://www.marketwatch.com/story/5-investment-themes-bigger-than-brexit-2016-07-12", "score": 1, "replies": []}, {"body": "GV is up 30% since then they're gonna keep going", "score": 1, "replies": []}, {"body": "CIE. Bought in at 1.29. What a steal.", "score": 1, "replies": []}, {"body": "1,700 shares of SAN at $3.81", "score": 1, "replies": []}, {"body": "GOOGL at $676.79 sold at $715. \nsold it thinking it would go down next day(sell, buy again) \nBut the market just kept going up.\n\n", "score": 1, "replies": []}, {"body": "AMAT 10.69% gain", "score": 1, "replies": []}, {"body": "Bought Ubisoft @ 28 - 34 now", "score": 1, "replies": []}, {"body": "WDC@$42.08/share\n\nCurrently sitting at $52.01\n\n", "score": 1, "replies": []}, {"body": "NFLX at 87, now ~95", "score": 1, "replies": []}, {"body": "I got APPL at $92. ", "score": 1, "replies": []}, {"body": "Doin' pretty, pretty, pretty good so far with LYG, BCS, RBS", "score": 0, "replies": []}]}
