{"title": "#TBT to all these pros that saw the huge market crash coming", "selftext": "", "id": "4sv5nn", "created_utc": 1468524792.0, "score": 385, "upvote_ratio": 0.93, "num_comments": 74, "comments": [{"body": "You forgot:\n\n> Ladies and gentlemens, it's officially time to panic \n\n* F.S. Comeau, June 25, 2016", "score": 251, "replies": [{"body": "And by the love of the inverse fsc we were blessed with his holiest gains.", "score": 46, "replies": [{"body": "With his blessing may we fight the holy gains war in the name of Allah.", "score": 2, "replies": [{"body": "We fight jihad for our profit.", "score": 2, "replies": [{"body": "Allah sayeth that thou who step in thy way of massive gains be slain and have their testicles ground and spewn across the land so that no longer may large profits be taken from thy infertile soil. -Qu'ran (69:69)", "score": 1, "replies": []}]}]}]}]}, {"body": "My god...it's a wu-tang!", "score": 97, "replies": [{"body": "[deleted]", "score": 39, "replies": [{"body": "Are patterns ever not total bullshit? My roommate was saying they literally learned about coffee cup patterns in one of his university finance classes. But I still don't understand how you'd rationally factor it into a decision", "score": 8, "replies": [{"body": "TA is a meme that is sold to stupid people so that smart people can make money off stupid people thinking the stock market is like a magic eye picture.\n\nYou see a sailboat, somebody much more successful than you sees an idiot seeing a sailboat and makes a play accordingly. ", "score": 12, "replies": [{"body": "gfy and take your eyes off my yacht.", "score": 7, "replies": []}]}, {"body": "Yeah. I do not know anything really about TA. But for most companies that produce goods or services and whose stock reflects the demand for those goods or services the shape of the chart of their stock price seems like a really dumb thing to base your decisions to trade on. \nBut then again I could see it working if you have a like algo trading going on or maybe things with more factors determining value like currency. There are probably plenty of things I don't know about that it's useful for. ", "score": 7, "replies": [{"body": "TA only even works on a theoretical level if you assume that short-term changes in stocks are mostly caused by people that use TA really poorly, and a good enough analyst of TA can predict how the terrible analysts of TA are going to drive the price in the short term.\n\nEdit:  Holy shit, this is why inverse FSYOLO works.  He gives us the perfect view into the emotional trader's mind.  It's what TA intends to be, but the problem with TA is that it's all but impossible to imagine the complex psychological depths of the stupid trader.  FSYOLO is the perfect indicator.", "score": 13, "replies": [{"body": ">it's all but impossible to imagine the complex psychological depths of the stupid trader\n\nIf you gaze long into an abyss, the abyss will gaze back into you", "score": 1, "replies": []}]}, {"body": "As much hate as TA gets, TA books are pretty good for a lot of things, like stabilizing your desk, or wiping your ass. ", "score": 13, "replies": [{"body": "Don't forget the mad gainz for the writers and publishers.", "score": 1, "replies": []}]}]}, {"body": "yes patterns are bullshit, I studied charts and scanners for quite some timw,  every pattern you see is typically shared by a dozen stocks in the market at the same time,  and of those dozen a slim minority respond as pattern watchers predict.  Charts are not bullshit,  persay,  but financial influence,  then news,  then charts is the order to watch,  charts have more power at support and resistance levels.  patterns are interesting and have momentary effect but you see,  no one is trading at the same time frame of chart,  so the pattern is usually only something a few people see.", "score": 3, "replies": []}, {"body": "There's a big difference between a weak correlation and causality. ", "score": 2, "replies": []}, {"body": "the only pattern that isnt complete bullshit is the dead cat bounce. works every time if you can time it correctly. ", "score": 2, "replies": []}, {"body": "Patterns are just a sketchy way to identify the natural tendencies of a market sprinkled with more superstition than a Feng Shui session.\n\n\"Coffee cup\" is just a silly way to say the market has been repeatedly trying to rise above a critical level with ever shorter pullbacks.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Fuck off\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "Yes sir ", "score": 3, "replies": []}]}]}]}, {"body": "I'll do it first in the next paid financial summit. ", "score": 2, "replies": []}, {"body": "You need to diversify yo bonds nigga... ", "score": 2, "replies": []}]}, {"body": "Diversify yo bonds nigga", "score": 14, "replies": []}, {"body": "Market's going to the moon after the Wu too.", "score": 7, "replies": []}, {"body": "very strong wu-tang formation if I do say so myself", "score": 9, "replies": []}, {"body": "This fucking sub makes my life more colorful than soul train.  lmfao", "score": 2, "replies": []}]}, {"body": "You realize they have to spew random shit to keep the show on air? Otherwise they'd have nothing to talk about. \n\nCNBC is on at my job all day and after a couple weeks listening to the same old shit makes we want to kill myself. The commercials are more entertaining", "score": 36, "replies": [{"body": "Same here. Same feeling as well... Over 7h of programming I extract about 5 min of somewhat useful info in a good day.", "score": 7, "replies": [{"body": "Exactly i wish they would just cut to the chase and do a simple 1 hour show at 6 o-clock explaining everything that happened for the day without any dumbass analysts. ", "score": 2, "replies": [{"body": "marketplace on NPR does exactly that at that exact time and it's p charming about it. \n\nlot of fluff though ", "score": 3, "replies": []}]}]}, {"body": "hot chicks tho", "score": 2, "replies": []}, {"body": "Oh look the random number generator put out some new numbers, let's create a narrative around it.\n\nNOTE: This also applies to sports news casting.", "score": 2, "replies": []}]}, {"body": "My TA indicates we have a ¯\\\\\\_(ツ)_/¯ pattern forming.", "score": 26, "replies": [{"body": "I think you were trying to make this ¯\\\\\\_(ツ)\\_/¯!  \n  Type it like this ¯\\\\\\\\\\\\\\_(ツ)\\\\_/¯  \n  ^^I ^^am ^^a ^^bot, ^^visit ^^/r/ArmFixerBot ^^for ^^more ^^info!", "score": 0, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "/r/botsrights", "score": 7, "replies": []}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/botsrights] [Helpful bot gets told to go fuck itself by stock gambling addict](https://np.reddit.com/r/botsrights/comments/4t304u/helpful_bot_gets_told_to_go_fuck_itself_by_stock/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)", "score": 6, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "Rude", "score": 3, "replies": []}]}]}]}]}]}, {"body": "This is great. Ass holes speak, idiots listen and /r/WSB keeps putting people on Yachts. \n\nNext stop, the moon!", "score": 19, "replies": []}, {"body": "Is what they said the same as what they did? That's the real question. I think its all market manipulation. I remember a wsb Titan once said that the market is rigged. Rigged!", "score": 6, "replies": []}, {"body": "I don't care about those faggots, I need to know where Shikreli and FSC posted ! ", "score": 4, "replies": []}, {"body": "Is.. Is that first guy Randy Quaid?", "score": 4, "replies": [{"body": "right behind you, Mr President", "score": 3, "replies": [{"body": "http://m.imgur.com/gallery/JviBCRn\n\nEdit: wait a minute... ", "score": 1, "replies": [{"body": "something like that", "score": 1, "replies": []}]}]}]}, {"body": "it's disgusting.\n\nThey use their \"Expert Reputation\" to collude against the common investor. They tell you to buy when they know it will drop, and sell when they know it is going to rise.", "score": 14, "replies": [{"body": "[Or they're just idiots](https://en.wikipedia.org/wiki/Hanlon%27s_razor)", "score": 53, "replies": [{"body": "I am familiar with \"HR\" and can see where you are coming from. I think it's more nefarious, especially Cramer. He's a scumbag", "score": 15, "replies": [{"body": "I FUCKING HATE THAT GUY. WHAT AN ABISMAL YELLING MORON.\n\nI ALSO HATE THE SEWER GUY.. FUCK HIM.", "score": 3, "replies": [{"body": "All hail Jim Blamer, certified idiot and ex market manipulator.", "score": 1, "replies": []}]}]}, {"body": "Like most aphorisms, this is always the case, except when it isn't.", "score": 2, "replies": []}, {"body": "They are idiots, can confirm.  Idiot here. ", "score": 1, "replies": []}, {"body": "The obvious corollary to Hanlon's Razor:\n\nNever attribute to stupidity what can be attributed to acting in one's own self-interest.", "score": 1, "replies": []}]}, {"body": "So what you're saying is that I can just take the do-the-opposite train all the way to yacht town? ", "score": 3, "replies": []}, {"body": "This is the subreddit that worships shkreli.  We love our colluding assholes and amoral cunts.", "score": 2, "replies": []}, {"body": "If you're relying on anybody to tell you what to do, you deserve what you get.\n\nThis isn't financial planning, its speculating.  You either do it yourself or you stay the fuck away.", "score": 1, "replies": []}, {"body": "I just subbed. Why is this shit upvoted. Are you guys this fucking retarded?", "score": 0, "replies": []}]}, {"body": "Whats the name of the sewer guy? God. I wish I could punch his elitist face.", "score": 3, "replies": []}, {"body": "These assholes should be called out publically. Old assholes who think they know everything are the problem with every field out there. When will these dicks die", "score": 3, "replies": [{"body": "Well, there're plenty of young \"assholes who think they know everything\". They just grow up to become old assholes who think they know everything.", "score": 4, "replies": [{"body": "Fair enough. ", "score": 1, "replies": []}]}]}, {"body": "So when all these fucktards start calling for new highs and saying to go long, what the fuck you dipshits going to do? GFY", "score": 1, "replies": []}, {"body": "EXPERT FORTUNE TELLERS", "score": 1, "replies": []}, {"body": "They all actually believed the FED could normalize interest rates LOLOL!!!!!!!", "score": 1, "replies": []}, {"body": "Bill Gross indahouse!", "score": 1, "replies": []}, {"body": "i like to imagine that all of you guys are like those two young guys in the big short making the right call :) ", "score": 1, "replies": []}, {"body": "That's not even a crash, I'd love to see a chart like that during the credit-crunch when the S&P was in the 600s.", "score": 1, "replies": []}, {"body": "Now is the time to put everything in. Markets are going to the moon.", "score": 1, "replies": []}, {"body": "I want to make one of these with all of Bill Gross's doomed quotes. I tried the other day, I think I found articles from each year from 2010 till now. Guys a joke.", "score": 1, "replies": []}, {"body": "Theyre worse than the news pundits as they can hurt you financially and just as stupid", "score": 1, "replies": []}, {"body": "Don't forgot the high schooler Buffet", "score": 1, "replies": []}]}
