{"title": "Is this a Flash Crash", "selftext": "One day and all major indices below 2% and some 3%. Is this the start of something more sinister or should I be taking advantage and putting more money into this.", "id": "85lw64", "created_utc": 1521484991.0, "score": 1, "upvote_ratio": 0.53, "num_comments": 26, "comments": [{"body": "Please look up what a flash crash actually is.", "score": 16, "replies": [{"body": "is today it", "score": 0, "replies": [{"body": "No.", "score": 1, "replies": []}]}]}, {"body": "The way the Economy is looking right now I would say buy! I would say this is a small bump in the road just like all the others we have seen recently. Nothing major has happened that would justify a \"correction\" or \"recession\" in my opinion.\n\nThe Trump Economy is still looking strong; and there are some big earnings reports coming out soon that should prop the market if they are positive (They most likely will be due to tax reform and deregulation)\n\n", "score": 10, "replies": [{"body": "> Nothing major has happened that would justify a \"correction\"\n\nI mean....we literally *just* had a correction a month ago. Whether or not you personally feel it was \"justified\", it happened. Recessions are different. Something systemic must happen for those. \n\nBut I don't think corrections ever *need* to come with an explanation. If nothing systemic causes them, simply \"cooling off\" is good enough reason for me. That could certainly explain the one that happened recently.", "score": 6, "replies": [{"body": "Didn’t inflation scares justify the last correction? And then the most recent jobs report numbers helped alleviate that fear. \n\nA correction is typically  a 10-15% decline among major indices. If you look at all corrections there has usually been some systemic fear/reasoning. ", "score": 1, "replies": [{"body": "That's the excuse that talking heads like to give the last correction. It doesn't look good on TV when somebody asks you why the markets crashed and you said \"uhh...I dunno. Just because\". They then have nothing to talk about. They like to be able to point at something and say \"THAT! That is why things are happening!\" If the talking heads can't do this and can't explain things, they have a hard time justifying their existence in the media.\n\nMy personal opinion is that the last correction simply happened for technical reasons. People taking profits and people getting margin called for being way over-leveraged on that bull run. The implosion of VIX ETNs didn't help. That's not sexy, though. And your average listener doesn't like to hear that sometimes things happen \"just because\". Inflation and rising interest rates didn't come out of nowhere and hit us as a surprise. There's no reason that SPX would drop 13% or so in a matter of days because of inflation alone. ", "score": 0, "replies": []}]}]}, {"body": "Tax reform was decent but the tarrifs are going to hurt defense stocks like BA, LMT, and anything that needs steel and aluminium to produce products.\n", "score": 1, "replies": []}, {"body": "what about now..", "score": 1, "replies": [{"body": "At the end of the day the economy is still strong and corporate earnings are breaking records. I think this tariff situation is a negotiation tactic by president Trump to help leverage our position when it comes to international trade.\n\nAt the end of the day companies are more profitable then ever, and tax expenses are decreasing. Don’t watch the news/talking heads cause that’s what drives day to day fluctuations. \n\nAlso we are seeing a 700 point drop on low volume. That basically means that there isn’t much buying interest today, but no one is rushing to sell large quantities of shares. In my humble opinion there is no reason to be fearful right now large companies (eg. Comcast, apple, at&t) are investing millions in the US. If the big guys were afraid of the direction of the economy they wouldn’t make those investments.", "score": 1, "replies": []}]}]}, {"body": "Buying the dip only works until it doesnt.\n\nIn the case of the past 9 years, its generally worked. \nAnytime now, it wont.  But exactly when is anyones guess.\n", "score": 4, "replies": [{"body": "And then it will again.", "score": 2, "replies": [{"body": "And again and again", "score": 1, "replies": []}]}]}, {"body": "Million dollar question. I placed a few orders but set the limit even lower than the reach for the day. It'll have to be after hours retraction too for me to buy in. \n\nI'm a long term investor so 10-20 years waiting isn't a concern. \n\nAVGO, MSFT, DIS, NVDA and FB for me ", "score": 3, "replies": []}, {"body": "nobody knows...", "score": 1, "replies": []}, {"body": "I don't really see anything positive to suggest a quick recovery. It's all bad news, pretty much everywhere.", "score": -2, "replies": [{"body": "It's not  necessarily bad news. It's that all news is examined until people can see bad news in it.\n\nThe sentiment has changed. Staying mostly out for now ", "score": 0, "replies": [{"body": "No, I think you are wrong. There is plenty of actual bad news to consider. There's the tax-steal bill, the health care debacle, the budget deficit, looming inflation, threats of a trade war, threats of a cold war, threats of a hot war. The current administration appears to be neither competent nor honest nor likely to last out the year.\n\nI know it's not popular to mention politics in the stocks forum, but it is perilous to ignore this kind of news. Where is the positive news that propels the market upwards? The only positive thing is the supposed gutting of regulations.\n\nAccording to [this guy](https://www.cnbc.com/2018/03/19/biggest-risk-to-the-market-democrats-says-investor-marc-lasry.html), the biggest risk to the market is the democrats might come back in the fall and investigate something. ", "score": -1, "replies": [{"body": "Yes, a return to anti-business government would be a disaster ", "score": 2, "replies": [{"body": "You managed to put two false assumptions in one sentence. 1-the left is anti-business. It isn't, that's just propaganda. Some of us are good at business and love it. 2-even if the left were anti-business, it would still be less of a disaster than the current dumpster fire in the white house.\n\nSaying the greatest danger to the stock market is the left completely ignores reality. The stock market did great for 8 years under Obama, and has suffered recently because of the chaos and corruption of the Trump regime. \n\nThe threats to the stock market are as listed before. The tax bill redistributed wealth to the rich, leaving poor people with less spending power. Inflation is on the horizon. Relationships with our trading pardners are suffering. These are serious problems, not caused by the left, but by the right. We don't need more investigations to know who is screwing up the economy right now. It's not the left, who are on the sidelines watching the right make a whole bunch of mistakes.", "score": 1, "replies": [{"body": "> Relationships with our trading pardners are suffering. These are serious problems, not caused by the left\n\nWe're moving to equitable free trade. There will be some disruption as we undo the bad deals made by the left but that will pay off in the long run ", "score": 2, "replies": [{"body": "I hope you find it comforting to believe that. I don't believe it at all and I think you are engaging in wishful thinking.\n\n> undo the bad deals made by the left \n\nThat is also propaganda and it is false. The left did not make \"bad\" deals, they just made deals, some of which involved compromise. The current president rejects all compromise because he is a bully. People who reject compromise are  bullies. Being a bully works for a while, but it's not a winning strategy in the long term. \n\nWe would all be better off if we had trade treaties instead of trade wars. ", "score": 1, "replies": [{"body": "> We would all be better off if we had trade treaties instead of trade wars.\n\nFalse choice ", "score": 1, "replies": []}, {"body": "Ok bro, cool story. Your political beliefs are 100% right and everyone else is wrong. You win. \n\nBack to stock talk.", "score": 1, "replies": [{"body": "So much winning you are going to get tired of all the winning.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "i would wait out until wed to see what feds say, then maybe even wait till next monday for long positions because tariffs coming into effect on friday for china... not sure what that brings for the SP or is it \"priced in\"", "score": 0, "replies": []}]}
{"title": "Should I invest in NVDA?", "selftext": "[removed]", "id": "85n2zh", "created_utc": 1521493715.0, "score": 11, "upvote_ratio": 0.73, "num_comments": 18, "comments": [{"body": "[deleted]", "score": 14, "replies": [{"body": "Hell Yeah*", "score": 3, "replies": []}]}, {"body": "Also just to add(and I would be curious to see what others think, too) but I don’t expect the future growth of nvda to be anything like it has been for the past year. Having said that, if they keep out performing their quarterly earnings reports or at least staying right within ballpark of the expectation, I see them maintains slower but consistent growth. I can’t remember exactly what the numbers were but I saw somewhere that AI currently only makes up something in the ballpark of 10% of their business right now. I see that as a promising sign as I see AI to be much more broadly adopted in the next 10 years and it seems like they are doing a good job of stepping into that sector rn. ", "score": 6, "replies": []}, {"body": "Yes. It is volatile though, you will go through good days and bad days just like today.", "score": 2, "replies": [{"body": "To be fair, everyone had a bad day today. ", "score": 2, "replies": []}]}, {"body": "Iv been in since 45 bucks and I’d still buy. As a company, new market sectors seemingly fall into their laps. I’m kinda hoping for 300-315 then I’ll probably bail", "score": 2, "replies": [{"body": "Your nuts must be huge. I got in at 25 and left at 88.", "score": 2, "replies": [{"body": "well I left at 110 and then came back in at 130. So my nuts vary in size...its something I'm trying to work on....I need to be more disciplined about my strategy  ", "score": 2, "replies": [{"body": "Now that I recall, I came back in at 130  and then got out at 160. ", "score": 1, "replies": []}]}]}]}, {"body": "Yes. Last Month was slow. So right now it’s about time for liftoff again!", "score": 1, "replies": []}, {"body": "[removed]", "score": -5, "replies": [{"body": "What percent of their revenue is crypto? Oh, you have no fucking clue? Ok. ", "score": 12, "replies": []}, {"body": "Removed, so false it's trolling.  This thread is locked anyways, low effort on OP's part.", "score": 2, "replies": []}]}, {"body": "Do whatever Reddit says ...", "score": -1, "replies": []}, {"body": "IMO it is going to pop again with new release hype. I've been in for a year and a half", "score": 0, "replies": []}, {"body": "No", "score": -2, "replies": []}, {"body": "NVDA has stumbled upon a brand new market and they're beginning to exploit it big time. Bitcoin. All the news about bitcoin lately has people building mining rigs left right and center. They were smart enough to realize this and announced recently that they're building a whole line of graphics cards designed for bitcoin mining (instead of using their traditional gaming cards). Once these hit the market, I imagine they'll have a pretty good surge.\n\nIn my opinion: as long as bitcoin and other cryptos exist, nvidia will do well.", "score": -3, "replies": [{"body": "You do know that you don't mine botcoin with GPUs, right?   \n\n", "score": 1, "replies": [{"body": "You certainly can, though. An antminer may be more profitable, but GPU has better resell, can be used for any crypto you want, and has other purposes (games). Crypto is not going away and the folks at the major chip makers know it. ", "score": 1, "replies": []}]}]}]}
{"title": "RIP OLED - Apple has a secret plan to build its own screens in a bid to make slimmer, brighter devices with a longer battery life", "selftext": "[deleted]", "id": "85frcq", "created_utc": 1521421739.0, "score": 78, "upvote_ratio": 0.92, "num_comments": 27, "comments": [{"body": "I remember when I went all-in on this piece of shit before earnings. Fuck this stock ", "score": 43, "replies": [{"body": "Saturday read a Barron's article had a target of $400 over time, I bought in at $198 on Monday, started sliding Tuesday and I'm -30% ever since. Fucking POS.", "score": 8, "replies": [{"body": "Barron’s ... are they ever right about anything ?", "score": 6, "replies": [{"body": "They should change their name to Red Barron's", "score": 6, "replies": [{"body": "They had a story on their front page to sell Apple and Microsoft and buy Facebook. ", "score": 1, "replies": []}]}]}]}, {"body": "I got destroyed by Apple AND OLED, and it looks like the OLED pain train is going to start back up tomorrow", "score": 4, "replies": []}]}, {"body": "I'm a total noob, but is this part of the reason why Universal Display Corp's stock has been cut almost in half since January? I've been eyeballing them since their stock was less than $30 back in 2011, but never had enough money to invest, as I was only 20.", "score": 7, "replies": [{"body": "It’s been cut in half because it inflated 2x over speculation on the iPhone X. UDC is still up 40% yoy ", "score": 5, "replies": []}, {"body": "Look at that pe. Even with today’s hair cut, it’s still 42. Crazy high speculative and they just got cucked by their number one buyer", "score": 2, "replies": []}]}, {"body": "This has to be good for AMAT", "score": 5, "replies": []}, {"body": "maybe, maybe not.  they’re working on mircoLEDs, which are more complicated to produce, and something apple tried/abandoned before.\n\nalso, samsung and lg display would be the hardest hit; samsung is the current sole supplier for oled screens for iphone x with lg display contracted to supply for 2019, even got $2b(?) prepayment from apple to expand their production lines.", "score": 7, "replies": []}, {"body": "https://giphy.com/gifs/mrw-tomorrow-neet-TTnXtbnXgKVb2", "score": 3, "replies": []}, {"body": "I hope they're better at making screens than keeping secrets.", "score": 3, "replies": []}, {"body": "Knew those 4/20 180 calls would come through for me.", "score": 6, "replies": []}, {"body": "Time to YOLO some puts this week", "score": 2, "replies": []}, {"body": "DOWN ANOTHER 13 FUCKING % TODAY! WHO'S BTFD!?!?!?", "score": 2, "replies": [{"body": "Let's go !", "score": 2, "replies": []}]}, {"body": "So... short apple? They can't innovate shit since ol' man Jobbers died. Calling this a ploy to increase market share growth.", "score": 3, "replies": [{"body": "Steve Jobs's entire existence was marketing. Huge teams of really smart engineers do all the groundbreaking shit at Apple--not their execs.", "score": 37, "replies": [{"body": "His cult is really strange.", "score": 8, "replies": [{"body": "Why is it strange?\n\nHe has brought me a lot of joy", "score": 2, "replies": []}]}, {"body": "That's what I thought. But why are there so many people worshiping him? Apple users are like cult followers. I feel like Jeff Bezos received way less credit than he should. A lot of people know him now because he became the wealthiest guy on earth.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "> Unfortunately they also have been slacking hard on polish.\n\nWhat do you mean by this? Sorry I don't use Iphone.", "score": 1, "replies": []}]}]}, {"body": "I can't believe no one is mentioning that whole sapphire thing and the awesome collapse of GT Advanced Technologies.  That was a beautiful thing.", "score": 1, "replies": []}, {"body": "Long SNAP", "score": 0, "replies": []}, {"body": "> It’s unlikely that the technology will reach an iPhone for at least three to five years, the people say. \n\nlol by the time they're done it'll be obsolete. \n\n> 300 engineers \n\n> 26,000 square feet\n\nGood thing they have cash to burn cause that's what they're doing. \n\nBTFD", "score": 0, "replies": []}]}
{"title": "$MU DD (in glyphs, needs translation): SK Hynix tells $AAPL to get bent, dictates terms in massive role reversal; Memory Companies are the Big Swinging D's these days", "selftext": "", "id": "85fz0x", "created_utc": 1521423883.0, "score": 19, "upvote_ratio": 0.84, "num_comments": 27, "comments": [{"body": "After glyph translation\n\n> Blood glucose, blood pressure worries Now it's over! Adjust it with one egg! \n\"Nose blocked with\" rhinitis \",\" this \"in your nose, you bang!", "score": 14, "replies": [{"body": "Amazing technology, isn't it?", "score": 11, "replies": []}]}, {"body": "ah clever, reading Asian news gives you a 12hr head start", "score": 6, "replies": [{"body": "The top competitors are Korean and Japanese", "score": 4, "replies": []}]}, {"body": "The link you provided gives an error.", "score": 6, "replies": [{"body": "weird, looks like they took the article down.\n\nIt was about how Apple tried to strong-arm SK Hynix into renegotiating their current memory contract since Apple is not making as many iPhone X's.  SK Hynix told them no and that if Apple tries any funny stuff they'll stop selling memory to Apple all together (daaaaaamn).  Apple said they were sorry and humbly continues to pay for the memory they agreed to purchase.", "score": 20, "replies": [{"body": "Do you think that twink Cook secretly liked getting deep-dicked like that?", "score": 8, "replies": [{"body": "From a power bottom to a twink.  Sad. ", "score": 5, "replies": []}, {"body": "He was the one trying to do the dicking and got denied", "score": 6, "replies": []}, {"body": "Yup caz if he walked, he have to suck Samsung’s bigger blacker d. Apple is trying its hardest to break up with Samsung ", "score": 1, "replies": []}]}, {"body": "Apple going to buy MU now", "score": 1, "replies": [{"body": "A lot of people think they should.  Would increase margins significantly while locking down future memory tech that would give them a competitive advantage (for the first time since Jobs died).  But MU would be very expensive and AAPL doesn’t make big acquisitions", "score": 1, "replies": [{"body": "What about buying up a sizable stake? I don't think apple has ever done that , but it could be their first.", "score": 1, "replies": []}]}]}, {"body": "MARTY!!! Sup baby, how's that MU moneyz treating ya?\n\nCan I have a Ferrari plz uncle Marty?", "score": 1, "replies": []}]}]}, {"body": "There is simply not other option for these companies.  They MUST go to one of the main three suppliers. ", "score": 5, "replies": [{"body": "Right, AMD SK Hynix said “get your DRAM from someone else if you don’t want to honor our contracts”.  for the first time in a decade, AAPL does not have the upper hand in a supply negotiation.", "score": 5, "replies": []}]}, {"body": "apple’s iphone alone account for 15% of NAND chips produced and they have multiple suppliers for chips, including tsmc and samsung that plans to spend billions of dollars expanding their chip production.  if this is true (guessing its not due to the article being pulled and not showing up anywhere else), this would be a major fuck up sk hynix’s part.", "score": -1, "replies": [{"body": "TSMC doesn’t produce NAND and AAPL uses Toshiba NAND in their iPhones.  Any other bad info you’d like to share?", "score": 12, "replies": [{"body": "Go easy on em boss", "score": 5, "replies": []}, {"body": "there's no fucking article, i'm going by your replies in this thread that makes no sense.  apple asked to renegotiate with hynix due to poor x sales but apple uses toshiba in their iphones?  then hynix threatening to stop selling to apple all together?  that is the stupidest thing ever.\n\n\nhynix, tsmc, samsung, and toshiba spending tens of billions combined in expanding their production, apple supposedly going to add chinese companies to their supply lines, and market expects chip demand is going to peak this year.  who in their right mind tells fucking apple to go elsewhere?\n\n\nand even if tsmc doesn't make nand, they alone are spending $20b in r&d and expanding production over next few years, if hynix/apple story is any way true, they're going to prioritize being able to produce nand.\n\n\nnews came out that apple supposedly working on mircoled displays, something that's years out, and their display supply chain took a hit.  just the possibility of losing apple's business is enough for stocks to drop.  ", "score": 0, "replies": [{"body": "Hynix DRAM, Toshiba NAND.  Do some research before you open your mouth. \n\nThe article was pulled shortly after I linked it.\n\nTSMC doesn’t make NAND and they never will.  You lack a fundamental understanding of the memory business and your ignorance shows.  China is spending $30B (so far) to build up a DRAM and NAND industry that will produce products two generations behind their competitors.  That makes the products less dense and far more expensive.  Then there’s the issue of yields, which will undoubtably be suboptimal as they don’t have decades of experience under their belts like their competitors.  That will make their products even more expensive and decrease their capacity.  Then there’s the issue of qualifying their products for use, which can take quite a while.  So we’re looking at old tech at low yields, low capacity, high price, and no one is sure if it’ll even be usable.  I better close my MU position, it’s so scary!\n\nAAPL is not buying Chinese memory, that was a ploy to help renegotiate with their existing memory partners, who told Apple to get bent.  If AAPL’s choice suppliers of DRAM drops from 3 to 2, they have even less negotiating power.\n\nDisplays made for iPhones do not compare to DRAM which is used in every computing device you moron.  Mobile demand has been declining for a while, and while still important, AI, cloud/server infrastructure, AV, and IoT are the big demand drivers going forward for DRAM and NAND.  I’m glad MU doesn’t do a lot of business with AAPL as the margins are lower.  DRAM and NAND are the most expensive components of phones outside of the high end screens, btw, which is why it’s been speculated AAPL could buy MU.  AAPL will have a hard time bringing those costs down otherwise.\n\nThere will be no oversupply of DRAM in 2018 and NAND is expected to tighten in 2H18.  Again, do some research fuckwit,  the two $100 price targets last week were granted for one reason: those analysts now believe earnings will be higher in 2019 than 2018.  MU is not a buy if you think the opposite.", "score": 11, "replies": [{"body": "Can you shout at him some more? I found this really helpful.\n\nBtw why did you choose Jan 70/80s vs say 70/85?", "score": 1, "replies": [{"body": " I’d of a nice return for what I consider not intolerable risk.  Mid 70s is my safe estimate for MU by Jan", "score": 1, "replies": []}]}, {"body": "My only research is to read up your comments.", "score": 1, "replies": [{"body": "I’m cool with people not knowing every detail but don’t tell me I’m wrong without facts backing you up", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "GOOG has been trading above GOOGL all morning... WTH?", "selftext": "[deleted]", "id": "85jr4j", "created_utc": 1521468768.0, "score": 26, "upvote_ratio": 0.8, "num_comments": 19, "comments": [{"body": "Hell of a company. If I had more cash I'd buy more. We started using the Google Express app as much as Amazon. Next day delivery from Target free if over $35. More packaging material than they need only downside.  FedEx delivers.\n\n Long $Google, $Target, and $FedEx.", "score": 11, "replies": [{"body": "Good buying opportunity today I suppose.\n\nGoogle has always been very aware of user data and privacy concerns.\n\nI dont expect any regulations to hurt them long term", "score": 3, "replies": []}, {"body": "> Google Express app\n\nTIL. Thanks. When you say \"we\", do you mean your family or friends and acquaintances? ", "score": 3, "replies": [{"body": "My family-6 of us. Some friends in the neighborhood.  Starting to catch on. Early dayz.", "score": 1, "replies": [{"body": "Screw it. Sold some UVXY and bought another Google. Bullish long term. I never thought it would be Google to rival Amazon. Been watching for a competitor. Wasn't Wal-Mart fo sure. ", "score": 1, "replies": []}]}]}]}, {"body": "It's not the stock its your tracker. It just looks like they're each on different delays. You can see that the GOOG had a tick update while the other did not.", "score": 12, "replies": [{"body": "Nope. Both updating together. Been like this all morning... Starting to correct now tho", "score": 1, "replies": [{"body": "Good opportunity to change goog to googl , when it corrects you should be 1% up for free", "score": 9, "replies": []}, {"body": "Alphabet pays out the difference in class A&C shares values, there is no reasonable benefit for them to differ. If anything someone's bots kicked in a second later than their others. But 99% of the time it's just tracking errors.", "score": 0, "replies": []}]}]}, {"body": "clearly voting has become a liability", "score": 3, "replies": []}, {"body": "i've been watching the gap close over the last few weeks, and now they're even. i'm debating selling my goog and immediately buying googl just to help relieve my anal retentiveness of having to look at both in my portfolio.", "score": 2, "replies": [{"body": "I dont see how you could go wrong with this honestly. ", "score": 3, "replies": [{"body": "just did it. cost me $13 for the 2 trades and the difference in pricing. worth it for a cleaner looking screen on my account.", "score": 3, "replies": [{"body": "Nice", "score": 0, "replies": [{"body": "Unrelated question to this thread. I just read your flair. Genuinely curious - why are you/people on this sub so bullish on MU? You guys have been right so far, but I just don't know why.", "score": 1, "replies": []}]}]}]}]}, {"body": "This was true on Friday as well, I purchased a share then (fucking worst timing...) and was so confused why Class A was cheaper than class C.\n\nI mean, even if Google execs know how to run a company better than investors, why would the *added ability to vote* cause the price to be less? Doesn't make sense.", "score": 1, "replies": [{"body": "Too much responsibility, voting is a pain. ", "score": 1, "replies": []}]}, {"body": "I think Google has been buying back its Class C stock in order to bring it up to parity with the other class. ", "score": 0, "replies": []}]}
{"title": "When to take the loss on options", "selftext": "I have MSFT 94.50 calls expiring Friday which are down big time right now. All you experienced option traders out there, what would you normally do in this situation? (This is my first option I’ve bought) Should I hold until Friday and hope the market turns around? ", "id": "85jz1p", "created_utc": 1521470590.0, "score": 28, "upvote_ratio": 0.9, "num_comments": 18, "comments": [{"body": "[deleted]", "score": 68, "replies": [{"body": "Right? Sell that shit. Buy 275 $FDX calls and drink your tears for nutrients for the next 3 months. ", "score": 11, "replies": []}]}, {"body": "I'm not in the exact same boat (not options first timer) but Facebook is buttfucking all major tech stocks right now. It's ineptness is taking down the NASDAQ and in turn my April 13th CSCO $46 calls. My Cost basis is $0.85 and that shit is trading at $0.32, I can cost average but it might be a lost trade. So I am just letting my money ride and hope it has a bit of good bump here soon. \n\nThat being said, when I place an options trade, I view it as \"I am ok with losing up to $1500.\" So honestly, I'd just leave it on the table and re-evaluate on Thursday-ish.", "score": 17, "replies": [{"body": "U got some time \n", "score": 1, "replies": []}]}, {"body": "It depends on how much risk youre willing to take on that single trade.\n\nIf its only a small % of your total portfolio, you could consider trying to average down a bit if you can make a good second entry at a low price (check dailly RSI to support your second entry, obviously if its in oversold territory for the day, that would give you a bit of confidence its a good time to look at averaging down).\n\nWhat other people have said here though is very true, at some point you have to acknowledge the trade isnt a winner and just take the loss before it goes to zero.  Throwing good money after bad is something that can really burn you. Especially if the intention is just to throw in more and more money hoping that you can eventually break even to get out for a wash.  The obvious problem here, is that you'll take on a higher risk:reward ratio to the point where you end up risking 10k to save your initial 2k investment (for example).  This is an inherently flawed trading practice. \n\nSet a hard sell limit for yourself and stick to it.  Its way too easy to look at your position down 70% and say fuck it, the trade is dead and let it ride, when in reality you could have at least saved your 30%.\n\nIf you had more time on your trade, I would approach things a bit differently, but since its a weekly option, youre also getting burned pretty quickly by Theta so if it goes sideways youre screwed, and if it goes down youre screwed even worse.  Really, you have 1 out of 3 potential stock movements and obviously those odds are against you.\n\nGood luck whatever you decide, but above all, if things dont go well you should look at it as a tough lesson to help you be a smarter trader in the future.", "score": 10, "replies": []}, {"body": "What's the premium you paid?\n\nYou have minimal chance of getting in the money.\n\nSalvage what you can and close the trade.\n\nNASDAQ has a much needed correction going on right now since it just hit ATHs at retarded fast rates without any pause...\n\nTech weakness will hurt your Msft calls. Close em and move on. ", "score": 5, "replies": []}, {"body": "When they expire worthless. Go down with the ship or ur a pussy lol", "score": 4, "replies": []}, {"body": "You could take the loss now or wait until the fed comments on Wednesday, which is going to send the market bigly in one way or another. ", "score": 3, "replies": []}, {"body": "50% loss is my threshold.", "score": 3, "replies": []}, {"body": "You can try to delta-hedge to stop the bleeding since we have some good volatility here.  Though really, if you are taking doing single-leg calls/puts you should really put stops on at -10% or -25% depending on your outlook.  I know it is frustrating to blow through three day trades while losing money in the first hour on Monday, but it's better than chasing.  ", "score": 3, "replies": []}, {"body": "Guys this is an overreaction by the market, $MU earnings are on Thursday with this selloff I can see a 6% jump by the end of the week. Do a \"Sell to open put March 23rd OTM\" if you want to buy cheap or keep the morning from people panic selling.", "score": 2, "replies": [{"body": "I'm just going to throw this out there: the QQQ made an island top.\n\nThat's a technical pattern, and I know not everyone goes for that. But before the 3/9 open it gapped up into new all-time highs. Great. Then the next day more new highs though slower gain. Then the day after it opened even higher - only to fall all the way through those prior gains on higher volume. That's known as an \"engulfing pattern\". Then the rest of the week finished down down down.\n\nAnd today we gapped down over the exact same price that gapped up 10 days ago. And the down volume accelerated through the day.\n\nThis is a classic signal that a market has \"run out of buyers\". The potential was there to be back in \"buy the dip\" days but the buyers didn't win. Selling pressure has been creating the dominant movement. However I don't think we're in freefall either. I think we're going to muddle around 166-168 on the QQQ this week and then maybe start anther move up next week.\n\nOf course this is a very short-term prediction for which it's hard to read any signal over the noise. I wouldn't state it with anything higher than 60-70% confidence. But it's relevant for an OP who's dumb enough to want to hold OOM options into expiration.", "score": 3, "replies": []}]}, {"body": "Honestly I'm just going to start cutting my losses @ 25% max and moving on. If the market is moving against you then you're better off pivoting to the favour of momentum than to hold for break-even because quite often it never comes. Case and point I'm holding shit SPY calls probably work 10% of what I bought them for when I was profitable on them this time last week. Given that I'm down $3600 what the fuck is another $400 but had I been intelligent I would have taken the $1300 loss the market privileged me last Wednesday and transitioned to puts and that $1300 would have been chump change by comparison. \n\nTL;DR if momentum isn't in your favour just fucking take your licks and make it work in your favour. ", "score": 1, "replies": []}, {"body": "depends on how far down you are, if its like 90% or more id just say f- it and keep them till expiration.  I suppose it also depends on position size.", "score": 1, "replies": []}, {"body": "GTFO.\n\nI never want to hold premium into expiration anyway. In your case you're out of the money and being threatened with losing everything. Dump that shit.\n\nNow my market call is to sit on your hands for a month and see. But if you really need to be in Microsoft, dump what you have and put that money into fewer contracts for like October. You have to give yourself time to be right.", "score": 1, "replies": []}, {"body": "Consider rolling the trade if you've got the cash and the sustained bullishness on MSFT \n\nSo in your case you'd sell your call and use the proceeds to fund the purchase of another call at a later date (potentially at a higher strike if you want to get close to the original cost basis) \n\nI'm personally heavily overweight on MSFT stock so take my advice with a grain of salt", "score": 1, "replies": []}, {"body": "U should probably sell tomorrow. If the market turns around ur losses will be reduced but waiting till the end is an all or nothing deal", "score": 1, "replies": []}, {"body": "Never\n\nRide or die", "score": 1, "replies": []}]}
