{"title": "Looking at PIC, ZM put credit spreads, RKT put credit spreads, NIO call credit spreads, AMD Iron Condor $92.5/90, 77.5/75. I also think some call credit spreads on CNK are viable.", "selftext": "", "id": "jx86wq", "created_utc": 1605810442.0, "score": 64, "upvote_ratio": 0.94, "num_comments": 84, "comments": [{"body": "And only 1k in buying power. This guy is legit theta. Can't leave any capital lying around not doing anything for you.", "score": 15, "replies": [{"body": "Yes sir!", "score": 6, "replies": []}, {"body": "I did leave about $30k in BP before the election but I felt good selling puts on BLNK, ACB, WKHS. \n\nMissed out on heftier gains, but that’s okay with me.", "score": 5, "replies": []}, {"body": "cant be messing around with that inflation", "score": 1, "replies": []}]}, {"body": "Charge your phone", "score": 8, "replies": []}, {"body": "Credit spreads! This is how I wanna make my $$$", "score": 9, "replies": [{"body": "Boring but fun", "score": 6, "replies": [{"body": "whats your thought process when you open up a credit spread? How do you find stocks to open up spreads on?", "score": 3, "replies": []}]}]}, {"body": "I only use spreads when reacting to events like Moderna, etc (call spreads at open). That said, I've been looking at the AMD Iron condor all week but never executed bc I found other trades to spend my margin on.", "score": 8, "replies": [{"body": "Margin is scary man.", "score": 5, "replies": [{"body": "Yeah, but if I want to hold specific stocks, im not going to not hold what I believe are solid investments so I can hold it in cash instead. There is nothing inherently wrong with margin and running multiple strategies at once in a portfolio is probably a good idea. I keep 3 core stocks from different industries, theta, and ETF & volatility rotations. Also, if indicators get bad I just liquidate everything.", "score": 4, "replies": [{"body": "I guess I’ve never really cared about margin due to my amount of capital since I love saving money haha", "score": 4, "replies": []}]}]}]}, {"body": "Is there something you can link me to read up on this strategy’s or a video. ?", "score": 4, "replies": [{"body": "I kind of just experiment with my own money as I think I learn and retain knowledge better when it’s my own money.", "score": 3, "replies": []}, {"body": "Check out OptionAlpha and Tastytrade on youtube.", "score": 3, "replies": [{"body": "Fk those 2 useless retards", "score": -6, "replies": []}]}]}, {"body": "When you do put credit spreads on RH are you able to limit price each leg, individually?", "score": 5, "replies": [{"body": "Yes sir", "score": 4, "replies": []}, {"body": "Thats a good question, I'd like to know too", "score": 1, "replies": [{"body": "Yes, you can just enter each contract of the spread and set a limit sell price.", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "You mean enter the long put position first.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "https://www.investopedia.com/terms/l/long_put.asp\n\n\nAgain you mean enter the long option first....\n\n\nThink of shorting options just like selling short stock... you don’t own the stock that you’re shorting. \n\nUse proper definitions will remove confusion good luck brother", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Ok I’m done with you “terminology doesn’t matter”", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I’ll compare my all time returns if you compare yours I’ll also bet 1 bitcoin that mine is better", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Have that too...   also if you don’t know what you’re talking about and cannot use proper definitions then I’d gladly refer you to r/wsb they might benefit from your infinite wisdom... you want to bet cash money lmk if you’re ever in Los Angeles... big stack takes small", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I live in OC work in LA. But whatever", "score": 1, "replies": []}, {"body": "Also not just investopedia \n\n\nhttps://www.fidelity.com/learning-center/investment-products/options/options-strategy-guide/longput-speculative\n\nhttps://youtu.be/k9uiYBQJfOs\n\nEveryone in the world besides you thinks that a long put is when you buy the put....", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Long on the underlying isn’t what you said in the beginning and whoopdie doo what you make\n\n\nAlso you’re confusing bullish with long.....", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Your dumb. Anytime you sell anything \"your short\" anytime you buy anything \"your long\".\n\nSell a call- short call\n\nBuy a call- long call\n\n\nSell a put- short put\n\nBuy a put- long put\n\n\nNow dont be ~~g~~dummy AF ...k?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "No. Size smaller. You’re doing it wrong", "score": 6, "replies": [{"body": "https://www.youtube.com/watch?v=nl8LOnl6qbQ", "score": 3, "replies": []}]}, {"body": "How is this upvoted?! This risk management is literally worse than WSB, at least they split between NIO and PLTR!\n\n1) DO NOT put all your eggs in one basket.\n\n2) ESPECIALLY do not do this on a just-IPO'd meme stock at its all time high!\n\n3) You really think the worst case scenario is making $10,000 a month on $50,000?! The actual worse case is that PLTR goes down and stays down and IV comes out of it. Your CCs will make money but you lose fucktons overall because you blew your account on a meme stock. \n\nI'm not even saying that PLTR is a bad stock to be long in, just that this is a dumbass way to trade it. \n\nThis isn't thetagang, this is WSB with more work.", "score": 17, "replies": [{"body": "You’re comparing buying shares to going all in on oom options? No lol.\n\nThe real worst case is that pltr settles around 10$ -14 and bagholding a couple of years, which doesn’t seem likely.", "score": 7, "replies": [{"body": "Ok fine, it's better than FDs- but still a really bad idea. Your worst case there is a 21%-47% loss that you're bag holding for years. This is a shit outcome and just not an acceptable risk. Again, I'm not saying that OP shouldn't do CCs in PLTR, but don't put EVERYTHING in this strategy.", "score": 6, "replies": [{"body": "Greatest Risk = Biggest Gainz", "score": 2, "replies": [{"body": "With real theta strategies you can make big gains without putting yourself one meme stock away from losing everything. Spread out, learn strategies, trade aggressively.", "score": 2, "replies": []}]}, {"body": "I agree, just saying it’s not the absolute worst if he’s long term or bullish knows the risk. Definitely nothing like fds tho :)", "score": 2, "replies": [{"body": "I guess my WSB comparison was mainly in how the \"worst case\" in the post was making 20% a month, lol.", "score": 3, "replies": [{"body": "Haha, fair point", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Just because it works doesn't mean it's a good idea :)\n\nBest of luck sir 🙌🏻", "score": 8, "replies": [{"body": "Specious but hey good luck to you too my guy", "score": 2, "replies": []}]}, {"body": "I will be messaging you in 1 year on [**2021-11-20 02:04:15 UTC**](http://www.wolframalpha.com/input/?i=2021-11-20%2002:04:15%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/thetagang/comments/jx86wq/looking_at_pic_zm_put_credit_spreads_rkt_put/gcwdrfe/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fthetagang%2Fcomments%2Fjx86wq%2Flooking_at_pic_zm_put_credit_spreads_rkt_put%2Fgcwdrfe%2F%5D%0A%0ARemindMe%21%202021-11-20%2002%3A04%3A15%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20jx86wq)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}, {"body": "billy crystal", "score": 1, "replies": []}]}]}, {"body": "Soros tho", "score": 3, "replies": [{"body": "Money has no owners man, only spenders.", "score": 1, "replies": []}]}, {"body": "Is It not better to buy leaps and sell more CC against those?", "score": 2, "replies": [{"body": "Less money overall right now means less you can reinvest and grow the account sizing. PMCCs aren't bad but if you want to hold the stock (PLTR? Yes you do) and you want to maximize growth, then you should do regular CCs if you can. PMCCs are for people who want to do CCs on big stocks like TSLA but don't have the money to get 100 shares. Not to mention that the theta decay is better with a regular CC so you can exit earlier.", "score": 4, "replies": [{"body": "I would rather have synthetic longs on TSLA agreed.  PMCC is too much management.", "score": 1, "replies": []}]}]}, {"body": "Do people do that do they blow their entire load on one play? \n\nI run multiple on different stocks.", "score": 2, "replies": [{"body": "That's fine too, more power to you. I see no difference in the end, essentially, since I care no really about stock price, only about how many shares I can buy and how high the IV is.", "score": 3, "replies": [{"body": "Sweet. \n\nWhat stocks are you currently watching/working.", "score": 2, "replies": [{"body": "RIOT has insanely good premiums and the benefit of being speculative, so it generally maintains decent-to-good IV levels and even if it drops off, it can still bounce back up easily since the share price is only around $5.\n\nCOTY is another one that you can wheel for a ton of money.", "score": 3, "replies": [{"body": "Thats dope, I’ll run a CSP on Riot tomorrow", "score": 1, "replies": []}]}]}]}]}, {"body": "Agree with idea but suggest only putting 10% of acct in any one stock. Tsla when it dumps is example of not putting it all on 1 stock. I had 100k in tsla that was stupid of me share price dumped $130 bucks in 2 days. So instead of 2700 shares go with like 300 -500. Pltr could drop to 14-16 bucks on some stupid news or black swan. Time we are living in black swans happen anytime now.", "score": 2, "replies": [{"body": "But TSLA hit its all time high today again, and if you just kept doing CCs and CSPs and running the wheel you would have far outpaced any stock value loss. That same $100k you put in would be better than ever.", "score": 1, "replies": []}]}, {"body": "This post aged very well", "score": 1, "replies": [{"body": "lol I have 1200 shares and even with the covered calls limiting my gains, I'm still up $5000 overall in 2 weeks.", "score": 1, "replies": []}]}]}, {"body": "So why do you tend to go with credit spreads vs debit spreads? Does theta act more favorably with credit spreads?", "score": 3, "replies": [{"body": "Debit is the exact opposite of credit.\n\nCredit you put collateral down to cover the difference in the spread and you get money from the premium.\n\nDebit you buy the difference between the spreads and you want the stock to move beyond the further OTM spread.", "score": 7, "replies": [{"body": "Yeah I understand the difference, I was just curious why so many prefer the credit but I think I get it. Do you just use Robinhood or do you use ToS or something for any additional data?", "score": 1, "replies": [{"body": "Apprentice theta gangster Jumping in here - I use tastyworks for my analysis. I keep the vast majority of my funds in Ally (not great trading tools, but alright) and hold a small amount in TW that I can test on spreads. (I would definitely recommend setting up an account if only to check out their desktop or web app).\n\nThe following might be wrong as I'm still learning here, but in terms of directionality:\n\n put debit spread == call credit spread == bearish to neutral\n\ncall debit spread == put credit spread == bullish to neutral\n\n... when I'm trying to run a position, it's ***usually*** easiest to use calls for strikes over the share price and puts for strikes under the share price because that's where the market is most active (and more activity == tighter bid/ask spreads == usually better deals). This isn't always the case, though and is why having a table view \\[[https://imgur.com/a/nRPrQiO](https://imgur.com/a/nRPrQiO)\\] including open interest helps tremendously.", "score": 3, "replies": [{"body": "Thank you! I’m currently going through the options course on their website and enjoying it.", "score": 1, "replies": []}]}, {"body": "This is Theta Gang, the act of trying to collect premium as a means of steady, “safer”, more management profits.", "score": 1, "replies": []}]}]}, {"body": "Yes, this is exactly it. Theta is on your side instead of against you, since theta is higher closer to the money. It means you have a >50% probability of profit if you do an OTM spread, which you just can't get with debit trades.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "If it's a spread, the only $ required is the width of the spread.", "score": 4, "replies": []}, {"body": "So you’re saying you prefer debit spreads?", "score": 1, "replies": []}]}]}, {"body": "My plan was to make my money through credit spreads. I was successful the first time. However the second time burned me. They might not look risky but if a credit spread goes in a direction against you, the losses are freaking amplified so quickly.\nDo not recommend! \nI believe in percentages. I occasionally do credit spreads with 10% of my monthly profits dont care whether it was a dollar or 100$ or a thousand. I stick to that system. Just remember if your making money quick in the stock market means you’re playing it risky", "score": 7, "replies": [{"body": "There are ways to manage losing trades. With credit spreads you have some of the best strategies that exist regarding managing losers. Highly recommend anybody to learn how to fix their losing trades very well before starting to trade.", "score": 4, "replies": [{"body": "is there a link to some guides on this? i know people mention rolling, is that just rebuying the same spread at a later expiry and selling your current spread?", "score": 3, "replies": []}]}, {"body": "Or you’re rotating well within the sectors", "score": 1, "replies": []}]}, {"body": "I was scoping out AMD today since its got pretty strong resistance at $85 and resistance at $75 so I was looking into the kind of spread that would make money on the price staying within my legs. An iron condor would be ideal for that situation,  right?", "score": 4, "replies": [{"body": "Could do a short iron butterfly. An IC would be better as I think it involves less capital.", "score": 3, "replies": [{"body": "So your AMD IC looks like it's a totally neutral expectation, how far out are you doing your legs? Weeklies seem to make sense for fast, guaranteed profits as they expire worthless but reduced due to the premium on such short dated options.\n\nI've sold about 1/3 of my account and I'm sitting on cash now and I'm looking to transition to more theta gang strats now that I got lucky with NIO calls and I'm back positive all-time. So I'm considering entering into an AMD IC today. Do you wait for any price movement before starting your spreads that are neutral like an iron condor?", "score": 1, "replies": [{"body": "Tbh, I wait for a large move like today and set a call credit spread and then wait for it to go down and create a put credit spread, creating an iron condor in the process (easier to execute this on RH).", "score": 3, "replies": [{"body": "Thats a great idea. A few more questions if you don't mind.\n\nDo you watch the delta of your short positions or do you check the total delta for each wing? Like a 92/90 call credit spread wing has delta 0.0203 and 0.2721, respectively. Do you try to keep your delta net positive for call and net negative for puts? Does it even make sense to subtract the two and get the difference of the delta? Or does it make sense to average the pairs together?", "score": 1, "replies": [{"body": "I hate to sound cocky or ignorant but I don’t really check the Greeks all that much. \n\nI go and check resistance lines, what it’s done in the past, MACD, RSI and roll with it.\n\nThe real lesson I’ve learned is to not sell any options on a biotech like CRBP (RIP). \n\nBankruptcy plays like LK and AMC produce a LOT of IV but you, as the writer, need to contemplate why this is besides an ER or offering (might sell some GPRO put credits rn)", "score": 2, "replies": [{"body": "Okay, got it. So it would make sense to check history back for resistance/support lines relative to how far out you're making your legs? How far out do you make your positions, or is that more dependent on how the stocknis currently behaving? \n\nThanks again for answering all my questions", "score": 1, "replies": [{"body": "I wish I could give more straight forward answers but if I knew how to correctly do this 100% of a the time I wouldn’t be teaching high school math.\n\nGenerally, TA works well with some concepts like an ER. I like to watch Stock Dweebs and his charts on Twitter to better myself in that ever growing skill. \n\nI usually do both about a week or two away. Anything longer is also better on the market to do something. Good vaccine news basically raised all stocks besides the few vaccine dependent ones.", "score": 1, "replies": [{"body": "Okay, cool. That was the last piece I was wondering about.\n\nWhen setting these up, do you combine the legs together in robinhood so that it states the type of spread you make? If so, how do you deal with stop loss selling? Or is that not a concern since spreads are meant for limited downsides?", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Definitely should not do an iron butterfly in AMD right now since the IV is is very low.", "score": 1, "replies": []}]}]}, {"body": "Please sell ZM puts guys I have a butterfly centered around 420 if it closes there I’m finna print", "score": 2, "replies": [{"body": "Ok Dad", "score": 2, "replies": []}]}, {"body": "Great choices! I'll check them out. See what WSM looks like tomorrow. The IV was huge, just had earnings. You might be able to place some juicy theta trades on it while the IV is still high af.", "score": 1, "replies": []}, {"body": "NFLX put credit spreads looks good too", "score": 1, "replies": []}]}
{"title": "Hmm, should you buy TESLA 12/24 Calls at 600, 700, to the f*king moon strike prices?", "selftext": "", "id": "jx2f08", "created_utc": 1605791493.0, "score": 684, "upvote_ratio": 0.96, "num_comments": 83, "comments": [{"body": "[deleted]", "score": 101, "replies": [{"body": "No one gives me ultimatums. Going to do both. Blow me.", "score": 32, "replies": [{"body": "galaxy gap straddle like your mum's", "score": 2, "replies": []}]}, {"body": "70$p", "score": 5, "replies": []}, {"body": "I think $800C is the highest available strike at the moment. I know cause I sold an assload for absurd premiums.", "score": 1, "replies": []}, {"body": "The one in front of the SEC, lives forever.", "score": 1, "replies": []}]}, {"body": "I just realized they deepfaked elons face instead of shia lmfao", "score": 83, "replies": [{"body": "And he ended up looking like Post Malone.", "score": 59, "replies": [{"body": "Post Elone", "score": 16, "replies": []}, {"body": "Like the cousin of Post Malone and Dog the bounty hunter", "score": 0, "replies": []}]}, {"body": "Lolol", "score": 5, "replies": []}]}, {"body": "I bought a $600 12/24 for the fuck of it, I'm happy", "score": 44, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Bout tree fiddy", "score": 48, "replies": []}, {"body": "Yup", "score": 3, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "No.", "score": 4, "replies": []}]}]}, {"body": "What is cost of $600 12/24?", "score": 4, "replies": [{"body": "2600", "score": 5, "replies": [{"body": "Damn that’s expensive, how much can I win?", "score": 12, "replies": [{"body": "Fiddy", "score": 22, "replies": []}, {"body": "3", "score": 13, "replies": []}]}, {"body": "theyre 1800 rn lol", "score": 3, "replies": [{"body": "I had January's, I can't read that early in the morning. I already sold for an easy $400 for 3 minutes of work.", "score": 3, "replies": []}]}]}]}, {"body": "I did too and I made a grand.", "score": 2, "replies": []}]}, {"body": "Best TSLA DD I have seen", "score": 17, "replies": []}, {"body": "[deleted]", "score": 25, "replies": [{"body": "> Remember last Christmas Tesla was rocking ~425 then our boy Ellie released the cybertruck. Tesla flew to 600 by eow.\n\nYou're off by a bit. When the Cybertruck was unveiled on 11/21, TSLA was around $350, but it never broke $450 before the end of the year, let alone $600 by the end of that week.\n\n****\nEdit: Just checked the exact date TSLA broke $600, because I was curious - Jan 30th.", "score": 9, "replies": []}, {"body": "JUST DO IT!", "score": 9, "replies": []}, {"body": "Already strapped in boi", "score": 3, "replies": []}, {"body": ">gifting\n\n\\*grifting", "score": 1, "replies": []}]}, {"body": "Yes!", "score": 5, "replies": []}, {"body": "Those were very safe. 600c 11/27 is much better", "score": 6, "replies": [{"body": "$800C 11/27 were selling for almost a buck today lmao, what is wrong with you people.", "score": 1, "replies": [{"body": "So you’re sayin there’s a chance", "score": 2, "replies": [{"body": "Why can't you just be normal?", "score": 2, "replies": []}]}]}]}, {"body": "This shialon digital combo reminds me of a meth addict that hangs out behind my local kroger.", "score": 7, "replies": []}, {"body": "Jesus 700? I believe in TSLA but that is ballsy", "score": 9, "replies": [{"body": "That's what they said last time.", "score": 21, "replies": [{"body": "And the time before that, and the time before that...and the time before that..oh and that time before that..and the 6 other times before that..", "score": 8, "replies": []}]}, {"body": "RH is holding us downby capping December calls at 600 strike, hoarding all the higher strikes to themselves to fund their I banking fees for IPO next year", "score": 11, "replies": [{"body": "more like protecting you retards from buying worthless calls, lol", "score": 15, "replies": [{"body": "Oh I'm sorry I thought this was America... we don't need no protection", "score": 17, "replies": [{"body": "Hit me\n\nSir, you have blackjack\n\nHit me", "score": 4, "replies": []}]}]}]}, {"body": "Morgan Stanley has $1068 as it's bull case in a recent research paper. They've tended to be kinda bullish on the big T. So, sell the car and load up.", "score": 3, "replies": [{"body": "no way tsla gets 1T valuation wtf?", "score": 1, "replies": [{"body": "I have been invested in Tesla for more than 8 years. I'm surprised it's still below 1T.\n\nIf all goes as planned, market cap could reach 20T by 2030 and continue to grow afterwards. Elon gave many hints what's going to happen, many people choose to ignore.\n\nNormally I would heavily discount it. But this is Elon Musk, he tends to deliver. My long term price target is $20k. Those who think $500 is too high will regret down the road.", "score": 2, "replies": []}]}]}]}, {"body": "I have 445v 12/24...wish I had more of them, but my AAPL leaps left me poor.", "score": 3, "replies": []}, {"body": "Is there a full length version of this song I can set as my alarm and price alert?", "score": 4, "replies": [{"body": "The answer is yes. [https://www.youtube.com/watch?v=5-sfG8BV8wU&list=PLoFVyW1YaIebKbKKpaaMQ3dHdhFtQpdE1&index=4&ab\\_channel=Envane](https://www.youtube.com/watch?v=5-sfG8BV8wU&list=PLoFVyW1YaIebKbKKpaaMQ3dHdhFtQpdE1&index=4&ab_channel=Envane)", "score": 4, "replies": []}]}, {"body": "I bought 3/19 800c's on the 3rd (Nov) for $7.34 because (cue laugh track)  the Schwab trade assessor said they represented the biggest move on a 20% move in TSLA. Sold today for $22.80 because it had grown to too big a % of my portfolio, and there was more return now in rolling up to 900's or 1000. It's a little weird buying at strike prices that I know are impossible, but I  did the same with GM 3/19 55C that I'm still holding, and they're up by a larger % than any of the strike prices below. Seems like the outsized premiums for a lot of these call options makes the real outliers on strike price move more aggressively", "score": 5, "replies": []}, {"body": "This should play at the entrance of all casinos", "score": 3, "replies": []}, {"body": "Amazing", "score": 2, "replies": []}, {"body": "So what ur telling me is buy 5 500c 11/20's?", "score": 2, "replies": []}, {"body": "I was in since the big drop and they called me mad", "score": 2, "replies": []}, {"body": "I've been sitting on Jan 500C since before the split (2500 strike).  Shoulda sold the first time it passed 500.  Always a 2nd chance, I guess.", "score": 2, "replies": [{"body": "Always a 2nd chance to fuck it up too", "score": 2, "replies": [{"body": "So true... :D", "score": 1, "replies": []}]}]}, {"body": "Balls deep 11/20 550c bought at eod today I’m either going broke or Rich as fuck", "score": 2, "replies": [{"body": "Do update", "score": 1, "replies": []}]}, {"body": "800c 12/24 \n\n\nLmao jk", "score": 2, "replies": [{"body": "Unless..?", "score": 9, "replies": [{"body": "0.0", "score": 1, "replies": []}]}]}, {"body": "He has a slight resemblance to Papa Elon", "score": 1, "replies": [{"body": "You autist, that is Elon, they deep faked his face over Shia.\n\nTSLA $450P 11/24", "score": 6, "replies": [{"body": "Haha yup.", "score": 1, "replies": []}]}]}, {"body": "dollar store ripoff of shia labeouf", "score": 1, "replies": []}, {"body": "Buying shares is the smart play. Well might as well buy calls and call spreads too. Positions:(https://imgur.com/YgsoyF6.jpg)", "score": 1, "replies": []}, {"body": "I can’t tell the exact location of the border between the faces.  It’s like a true merger", "score": 1, "replies": []}, {"body": "Fkin idiot", "score": 1, "replies": []}, {"body": "What means 12/24? They expire on December 24th?", "score": 1, "replies": [{"body": "Yes", "score": 1, "replies": []}]}, {"body": "580c 12/4 saving my portfolio", "score": 1, "replies": []}, {"body": "$1000 01/15", "score": 1, "replies": []}, {"body": "Thank you, Shia LaMusk", "score": 1, "replies": []}, {"body": "that song sounds epic. anyone got alink", "score": 1, "replies": []}, {"body": "Lol I had Tesla at 420 should of bought more shares or calls ☎️", "score": 1, "replies": []}, {"body": "Elon Meth", "score": 1, "replies": []}, {"body": "Lmao", "score": 1, "replies": []}, {"body": "Bought a $690 12/18 call on tesla today.", "score": 1, "replies": [{"body": "1 570 and 1 580 12/24 here", "score": 2, "replies": []}]}, {"body": "1000c 1/2023", "score": 1, "replies": []}, {"body": "You got it buddy", "score": 1, "replies": []}, {"body": "This is intelligent use of AI", "score": 1, "replies": []}, {"body": "Buy 1/1 calls you dummy", "score": 1, "replies": []}]}
{"title": "Me throwing money at Tesla puts.", "selftext": "", "id": "jx4ypx", "created_utc": 1605800560.0, "score": 653, "upvote_ratio": 0.97, "num_comments": 70, "comments": [{"body": "TSLA is back at all time highs.  This is the place to take profit or buy puts if you like the Buy Low, Sell High strategy...\n\nIm more of a Buy High, Sell low kinda guy though.\n\n700+ mentions of TSLA yesterday on wsb tracked by r/reddittickers is usually a sell signal.", "score": 69, "replies": [{"body": "This is the time to reach down grab your nuts and do nothing but watch the price go up non stop and feel your nuts swelling as it does 💪🏼", "score": 31, "replies": [{"body": "That sounds tempting as fuck", "score": 2, "replies": []}, {"body": "That sounds tempting as fuck", "score": 2, "replies": []}]}, {"body": "This is the place to RECOMMIT EVEN HARDER to Tesla as it gets bought up by indexes and becomes the greatest company in the world over the next 5 years", "score": 16, "replies": [{"body": "Lol, let me know when Tesla can make an infotainment system that doesn't brick itself.\n\nThere seems to be a large disconnect between Tesla owners and Tesla investors and if Tesla cannot improve their quality, reliability, and services to their owners, they may just end up with a customer loyalty problem.", "score": 8, "replies": [{"body": "We're all too poor to own actual Teslas because we lose all our money on Tesla YOLOs one way or the other.", "score": 6, "replies": [{"body": "Amen brother. I'm actually driving a 2020 Audi S3, but yeah, it's leased. I'm even poorer than normal", "score": 1, "replies": []}]}, {"body": "Also Lucid air car and other competitors are on the way too, Tesla’s got its moment in the sun as the best EV right now but that could change as competition catches up.", "score": 2, "replies": []}, {"body": "You mean the 12k MCU units, out if 1 million, that Tesla has covered regardless of warranty status? \n\nI love it when people who don't own a Tesla talk about the tesla ownership experience.", "score": 1, "replies": [{"body": "Yes, but I think you might be forgetting to add that most likely the US government is going to force Tesla to recall over 150k Tesla's affected. The fact that Tesla knew that the infotainment would fail leaving the customer without critical safety features is bad enough. The fact that customers are complaining about it taking over 12 seconds for their backup cameras to appear on the screen and that Tesla service centers are determining that those MCUs are okay and not covered is absurd and scummy!\n\nhttps://arstechnica.com/cars/2020/11/after-12523-replacements-feds-investigate-tesla-media-control-unit-failures/", "score": 1, "replies": [{"body": "Tesla is offering covered replacements for any effected units, thereby negating any need for a recall.  You could even bring in your car prior to the MCU failing and they would replace the affected ECC chip.  Not withstanding that most people who *could* be effected by this have or will upgrade to MCU2 which does not have this issue (only cars from 2012-late 2017).\n\nAlthough I can see how this would effect you as a non investor and non owner....", "score": 1, "replies": [{"body": "That's great news, I am sure all of those Tesla owners on r/teslamotors complaining about being denied a replacement even though they are experiencing issues are totally satisfied!", "score": 1, "replies": [{"body": "I believe everything I read on reddit, 100% of the time.  Just like that guy on that same forum that was complaining Tesla \"removed his ludicrous mode\" because he had ludicrous mode on his car for 6 months, never paid for it, and it was removed.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You had me at puts, you son of a bitch, I’m in. Love the retardation.", "score": 5, "replies": []}, {"body": "Tesla's been at ATH for almost a year now", "score": 4, "replies": [{"body": "Well, considering the ATH was about $500 and tesla has yet to close above $500, I'd say no it hasn't.  Words mean something.", "score": 1, "replies": []}]}, {"body": "Finally TSLA took over the meme hype, so Nio can go up now", "score": 2, "replies": []}, {"body": "It's sell time. It's incrementing up while most other EV stocks are soaring in double digit gains for multiple days. And the only reason it's inching up right now is that it was added to the S&P. People are going to start selling very quickly if NKLA holders start posting gain porn.", "score": 2, "replies": []}]}, {"body": "You’re 100% correct on it’s not about money part. Not sure your message will reach TSLA bulls though, they only hear their calls printing money. BRRrRrRRRrrR", "score": 21, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Yeah sure but why not ride with bulls and make money 90% of the time instead of trying to time the market and make money once in a blue moon?", "score": 6, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "There's no reason to bet against tesla, but that's just my opinion", "score": 0, "replies": []}, {"body": "Give me some puts. What are your positions?", "score": 1, "replies": []}]}]}]}]}, {"body": "Everyone is going to be big sad when the funds and Algos dip out of TSLA today instead of tomorrow to lock in some nice gains. Pigs get fat, Hogs cry when they didn't take their 40% gains and end up -90%, oh and also slaughtered.", "score": 7, "replies": [{"body": "Tesla will dip tomorrow.  And then zoom again starting Monday. You're retarded if you think Tesla isn't going to be at new ATH before 12/11.", "score": 1, "replies": [{"body": "Oh I know it will but people want profits and this thing will probably see a pretty decent sized sell off overnight.", "score": 1, "replies": [{"body": "Yeah probably dip through Monday before further run up.", "score": 1, "replies": []}]}]}]}, {"body": "Some men just want to watch their account burn", "score": 8, "replies": [{"body": "risk is the thrill", "score": 2, "replies": []}]}, {"body": "Keep telling yourself that 🌈🐻", "score": 12, "replies": []}, {"body": "I sold Tesla puts. Feel free to tank the stock. If it executes me at 400 a share I’ll survive", "score": 5, "replies": []}, {"body": "Well, this could be it.", "score": 3, "replies": [{"body": "That was it. Lol. \nGood luck to you now, sir.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Yeah.  The 120k I made this week is the worst.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "So I should sell you some puts then?", "score": 2, "replies": [{"body": "give me a bulk discount", "score": 1, "replies": []}]}, {"body": "I’m shorting for my first time ever, in tsla at $500\n\nI think I will get fucked but whatevs", "score": 2, "replies": []}, {"body": "Tesla DOES have massive growth potential, but at its current price, all growth for the next 3 years is absolutely priced in, 5 years probably, 10 years still probably priced in, hell it's probably just way overpriced in general...\n\nBook value per share is something like $20 ? Share price is almost $500.\n\nAnd... TSLA is only 40% institutional holders. Most are retail investors who don't even know what DD stands for.   \n\n\nThe current TSLA price doesn't make sense, but you can't predict if or when it will drop, so... I wouldn't buy puts on it. I'd just stay away.", "score": 3, "replies": [{"body": "You do know Tesla EPS is higher than Apple by 4-5%?  The biggest Tesla bears don't believe fair market value is -90%.  You may have crossed the threshold from autist to retard.", "score": 0, "replies": [{"body": "You want to talk about earnings?\n\nApple's P/E ratio is 36.00.\n\nTSLA's is 986.35.\n\n(P/E is not the most useful metric, but the disparity above is big enough to be meaningful)\n\nName calling is always a solid argument.\n\nAlso - I never endorsed Apple either. Apple's relative valuation is also significantly overpriced. They're both way overvalued. Name some more companies.", "score": 1, "replies": [{"body": "You said you believe that Tesla's [fair market value](https://money.cnn.com/quote/forecast/forecast.html?symb=tsla#:~:text=Tesla%20Inc%20(NASDAQ%3ATSLA) is $20 a share, giving a them a 16 billion dollar market cap.  There's no other word to describe that other than retarded.", "score": 0, "replies": [{"body": "no, I said book value per share. Very rarely is a company valued at 1 X book value. That would be an extremely easy value play - those hardly exist.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Obviously you haven't done your research. We are drunk off Teslaquila driving our model 3's 120mph down the freeway.", "score": 8, "replies": [{"body": "You can't get a dui on autopilot, right?", "score": 8, "replies": []}, {"body": "[deleted]", "score": -7, "replies": [{"body": "🌈🐻", "score": 5, "replies": []}, {"body": "LMFAO", "score": 2, "replies": []}, {"body": "You mean the basic, off menu, SR that you had to order in person and was the lowest selling model they offered?\n\nModel 3 SR+, LR and Performance are all for sale, and just received a boost in mileage and speed to boot.", "score": 1, "replies": []}]}]}, {"body": "Lol, you retardly buy too many Tesla puts and are hoping to will yourself into not blowing up your account.  Sorry dude, don't fat finger it next time.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "No, the spirit of this sub isn't to buy shit by accident.  That's called being a fucking moron.  The spirit of this sub is to do stupid shit on purpose.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Embrace that you fucked up and are about to be one of those soyboys with 98% loss asking \"what can I do to make it back?  Meanwhile I'll be skrrrrting around town in my performance model S while you're asking your mom for a ride to Wendy's.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I just bought a model S last week.  I also have a model 3 performance.  Some of us actually make money here -- probably by not accidentally buying a multiple of what was originally a shitty trade to begin with.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "https://imgur.com/gallery/bmYsMnL\n\nSorry bb, some of us have made money this year.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Lmaaaoo.  Keep hating my friend.  That's sure going to resurrect your retardly purchased puts.  I'll be sure to follow up with my Cybertruck and Roadster when they get delivered too.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm making money while I'm at work making money.  You're in the basement losing your  barmitzvah money telling your mom that you know what you're doing.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Lol yeah I sure would be happy with losing that much money.   Is that why you're about to sell your car to buy more puts?\n\nI won't have a car payment until I get my CT, but that's just because I can earn more with the 70k over 3 years then I'd save by paying off a loan at 1.99% APR.\n\nI'm sure these are unfamiliar concepts to you, like \"fiscally solvent\", \"good credit\" and \"making money\" but keep at it slugger.  One day you'll move to the register from the fry station.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "the message is that we should keep selling TSLA puts", "score": 0, "replies": []}, {"body": "You are a joke but not the Joker.", "score": 0, "replies": []}, {"body": "I rode a 11/20 $515C for some decent profit today, coulda made the same on the downward swing we just had.  Loving this volatility...", "score": 0, "replies": []}, {"body": "2050: people keep betting against TSLA, and keep losing money", "score": 0, "replies": [{"body": "\"Shorts have lost tens of billions of dollars on Tesla.  But *I* will have success!\"", "score": 2, "replies": [{"body": "just playing roulette", "score": 1, "replies": []}]}]}, {"body": "what message is that?", "score": 1, "replies": []}, {"body": "What message tho", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "I rode a 11/20 $515C for some decent profit today, coulda made the same on the downward swing we just had.  Loving this volatility...", "score": 1, "replies": [{"body": "Made 2k in 9 minutes today buying 5x 500C and selling once it hit 560.50.  Just a quick momentum trade cause I had some capital just sitting there.  It's holding around $500 very strong, once it breaks 510 it's gonna gap up and find a new support level above 500.", "score": 1, "replies": []}]}, {"body": "fuckin keep shorting stocks", "score": 1, "replies": []}, {"body": "what would Boardroom Jimmy do?", "score": 1, "replies": []}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}]}
