{"title": "Trading the other side of TSLA S&P addition", "selftext": "The big day is here, Elon has delivered. TSLA is finally entering the S&P 500. That means 422b of new market cap, the biggest company ever to be added to the S&P. On the other hand, we will likely see one or more tickers removed from the index which could mean short term underperformance. This trade revolves around **shorting names that could be booted from the S&P because of Tesla.** \n\nThe bottom 10 stocks in the S&P by market cap (likely to be removed) are currently ([https://www.slickcharts.com/sp500](https://www.slickcharts.com/sp500))\n\n* Xerox (XRX)\n* Apache Corporation (APA)\n* SL Green Realty (SLG)\n* Ralph Lauren (RL)\n* Vontier (VNT)\n* Discovery Inc. Class A (DISCA)\n* HollyFrontier (HFC)\n* TechnipFMC (FTI)\n* UAA (Under Armour Class A) (UAA)\n* UA (Under Armour Class C) (UA)\n* News Corporation Class B (NWS)\n\nOut of the 10 companies removed from the S&P this year, 2 have been in oil and gas (Helmerich and Payne, Cimarex Energy), and 5 have been retail/consumer facing (Kohls, Coty, Nordstrom, Capri Holdings, Macy’s). \n\nIf we look at companies in the bottom of the S&P which fit this profile, a few stick out (excluding UA due to the share class structure): \n\n* Apache (APA) (Oil/Gas)\n* Ralph Lauren (RL) (Consumer/Retail)\n* HollyFrontier (HFC) (Oil/Gas)\n* TechnipFMC (FTI) (Oil/Gas)\n\nThese are four companies that seem to have a reasonable chance of being excluded, and subsequently underperforming. I’m taking cheap bear call spreads on each that will net a payout initially, and hold up if one or more of the companies are excluded from the S&P\n\n* Apache (APA) [Buy 12c, Sell 11c, Expiry: 2020-12-04](https://plotlion.com/?symbol=APA&strategy=call_spread&expiry=2020-12-04&strike_1=12&strike_2=11)\n* Ralph Lauren (RL) [Buy 85c, Sell 80c, Expiry: 2020-11-20](https://plotlion.com/?symbol=RL&strategy=call_spread&expiry=2020-11-20&strike_1=85&strike_2=80) \n* HollyFrontier (HFC) [Buy 24c, Sell 23c, Expiry 2020-12-18](https://plotlion.com/?symbol=HFC&strategy=call_spread&expiry=2020-12-18&strike_1=24&strike_2=23) \n* TechnipFMC  (FTI) [Buy 9c, Sell 8c, Expiry 2020-12-18](https://plotlion.com/?symbol=FTI&strategy=call_spread&expiry=2020-12-18&strike_1=9&strike_2=8) \n\nLet me know what you think of this trade, was also looking into selling calls on these names, but got a bit scared by higher potential downside if the market goes on tear randomly", "id": "jw6mel", "created_utc": 1605663985.0, "score": 297, "upvote_ratio": 0.97, "num_comments": 81, "comments": [{"body": "Very smart analysis. Looking at the list, I would have bet against Xerox.", "score": 140, "replies": [{"body": "xerox is profitable. I think its going to be some company which is in a bad shape and financials are terrible.", "score": 59, "replies": [{"body": "under armor for me", "score": 32, "replies": [{"body": "Possible but there must be a company in dead and  buried industry with declining business. Under Armor sells over priced sneakers and related products. I would think that market can still grow as they launch in more markets. I think they will grow as we move out of COVID.", "score": 20, "replies": [{"body": "UA had a good last quarter and is going up. I’d be surprised if it’s them.", "score": 15, "replies": []}, {"body": "After covid people are gonna start working out again and because everyone has gotten fat they are gonna need new workout clothes. Calls on Under Armour", "score": 2, "replies": []}]}, {"body": "My calls have been printing and they're on a bull trend currently, plus a lot of their gear is sold during Christmas time/new years as presents and new years resolutions come around. I'm going longer than new years on my options though.", "score": 2, "replies": []}]}]}, {"body": "They do a lot of digital document management I believe especially for governments, I'm not sure I'd count out xerox", "score": 4, "replies": []}, {"body": "Considering how many people still call a photocopy a xerox id think they would survive.", "score": 8, "replies": [{"body": "They said the same for kodak..?? Look at it now. Its in pharma. Lmao.\n\nP.s. this might be anecdotal!", "score": 12, "replies": [{"body": "Touché", "score": 2, "replies": []}, {"body": "Haha RIP thread", "score": 1, "replies": []}]}, {"body": "Do you feel like there is a big market for new large office appliances?", "score": 4, "replies": [{"body": "[removed]", "score": -5, "replies": [{"body": "I work in finance and haven’t used a printer or scanner since lockdown 1.0. I believe the poster has a point.", "score": 9, "replies": []}]}]}]}]}, {"body": "The problem is that when companies are removed from the s&p, historically, the stock price doesn’t fall", "score": 63, "replies": [{"body": "Interesting. Do you have any easily digestible source for this? I suppose I could look it up by stock but I'm lazy.", "score": 26, "replies": [{"body": "https://www.nber.org/digest/nov13/stock-price-reactions-index-inclusion\nSecond paragraph", "score": 45, "replies": [{"body": "You da best. Thanks.", "score": 12, "replies": [{"body": "It’s strange that that’s the case but that’s why you always do your research first before placing trades", "score": 14, "replies": [{"body": "Being boot from the us500 is like having the trapdoor fall out when you are on the gallows. What gives?", "score": 9, "replies": [{"body": "Nothing about the company’s fundamentals has changed. The only loss would be from no longer being in the SP500 etfs but I guess that is not significant enough.", "score": 9, "replies": [{"body": "That is because s&p 500 is market cap weighted and the ones booted usually carry tiny weight.", "score": 18, "replies": [{"body": "Ah yes that makes a lot of sense.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Upvote for honesty.", "score": 12, "replies": []}]}, {"body": "Lol at all the responses saying how smart OP’s analysis is. And they didn’t actually check whether this happens like actually, historically, and just assumed that it would.", "score": 25, "replies": [{"body": "Lol every single one of them didn’t bother to check and some of them are following blindly. I hope they don’t lose too much.", "score": 3, "replies": []}]}, {"body": "I’m way late to this, but the ‘street’ explanation is pretty straight forward. \n\nTo start, like others have said, the bottom of the SPY is pretty tiny. The other reasons have to do with the mechanics of how ETF trust companies work; the ultra simplified gist is that trust companies typically runs dozens (if not hundreds) of *other* ETFs and the bulk of these are pretty arbitrary. So, if (for example) UAA falls out of the SPY, an ETF manager can just stick it in another etf, such as the ‘XYZ consumer ETF’. In plain English, they don’t *have* to sell it; it’s far more likely they just stick it in another box. Conversely, for TSLA you *do* have to buy it (it’s *really* unlikely that you’re gonna pull tsla *out* of a smaller etf to stick it in the SPY). \n\nI work on the bond side, and this happens *all the time* with corporate credits (although for different reasons from index changes - ETFs have become a reasonably important source of bond liquidity, so ETFs are more like fancy parking spots.)", "score": 7, "replies": []}, {"body": "But never has a company this large been added. Fund managers are going to need to free up substantial capital to buy TSLA shares. I'd expect a drop from whomever gets booted", "score": 1, "replies": [{"body": "No, they just have to buy more shares of tesla than when including a smaller company", "score": 7, "replies": []}]}, {"body": "Yeah I bought puts the day before Macy's was booted and ended up breaking even 🤷‍♂️ at least I didn't lose money but", "score": 1, "replies": []}, {"body": "> The problem is that when companies are removed from the s&p, historically, the stock price doesn’t fall\n\nDo they, historically, go up though? Just adjust the strike prices a bit so they are atm/otm. Then you hit max gain if these companies stay flat, too.", "score": 1, "replies": []}]}, {"body": "Do you know for sure the lowest market cap companies get removed? Looking at the historical free float adjusted weights of the s&p before companies were removed should answer that.\n\nThe reason I bring this up is because the committee clearly takes in factors other than just profitability and market cap. See: TSLA", "score": 26, "replies": [{"body": "Criteria for Inclusion in the S&P 500\n\n Its shares must be highly liquid. At least 50% of its outstanding shares must be available for public trading. It must report positive earnings in the most recent quarter. The sum of its earnings in the previous four quarters must be positive", "score": 24, "replies": [{"body": "These aren't hard rules as we've observed - TSLA was not included in the rebalancing following four profitable quarters.", "score": 1, "replies": [{"body": "Those are the criteria to be considered for inclusion. Think of SPY like a country club. You can meet the income requirements and have a recommendation from a member, but that doesn’t mean that the board will let you join.", "score": 2, "replies": []}]}]}]}, {"body": "Removing the smallest name(s) won't do anything. ~~If they place it under Tech then~~ I'd expect some selling of other high cap ~~tech~~ holdings to make room for tesla and keep the index balanced.\n\nEdit: it's going under consumer discretionary.", "score": 12, "replies": [{"body": "It’s going under consumer discretionary (like amazon)", "score": 8, "replies": [{"body": "Ah, that's good to know!", "score": 3, "replies": []}]}, {"body": "Underrated comment.", "score": 2, "replies": []}]}, {"body": "Not financial advice:\n\nI work in oil and gas and regardless if APA remains in S&P500 that’s still a good trade in my mind. \n\nAPA is not performing well and I project a pullback in oil prices soon.", "score": 16, "replies": [{"body": "They’ve beat out expected EPS every quarter this year and steadily climbing since October. You think they’re going to drop suddenly in the next 3 weeks (OP’s timeline)?", "score": 6, "replies": [{"body": "You’re right about the EPS. I’m thinking about it more from a commodity price standpoint. I expect there to be a minor pullback in oil prices which in turn should drive down APA’s stock value in the short term. There’s a lot of oil supply out there and demand really hasn’t begun to recoup to 2019 levels. Even with PFE and MRNA vaccine announcements I believe we are 6-12 months out from a modest rise in oil prices. The other big unknown is OPEC. They have a meeting at the end of this month so we’ll see how that goes.", "score": 2, "replies": []}]}]}, {"body": "I'd be careful shorting companies. They have already been hammered.", "score": 12, "replies": []}, {"body": "Before doing this check how much XOM was hurt by being removed from the DOW", "score": 6, "replies": []}, {"body": "TIF (take for cash $131.50). Expected to close in Q1 2021.", "score": 3, "replies": [{"body": "Was this confirmed after LVMH backed out?", "score": 1, "replies": [{"body": "October 29, 2020... [https://investor.tiffany.com/news-releases/news-release-details/tiffany-and-lvmh-modify-merger-price](https://investor.tiffany.com/news-releases/news-release-details/tiffany-and-lvmh-modify-merger-price)", "score": 1, "replies": []}]}]}, {"body": "I might just pull the trigger here with you", "score": 3, "replies": []}, {"body": "Looking at getting some puts for APA thanks for the DD", "score": 4, "replies": []}, {"body": "Why not buy puts seem mo profitable", "score": 3, "replies": [{"body": "Definitely would be more profitable if the trade goes my way. That being said, I wanted lower downside and didn't want to worry about the greeks", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "it’s 505 tickers but it’s 500 companies . So like google has 2 tickers", "score": 20, "replies": []}, {"body": "maybe all of the four mentioned?", "score": 2, "replies": []}]}, {"body": "Just a side thought - there's something almost poetic about TSLA kicking Xerox out of the S&P500. \n\nXerox was one of the absolute rocketships of the 1960's. It was one of the \"Nifty Fifty,\" stocks which *everyone knew* you buy and hold forever. (Although from its 1972 peak, it never recovered). Its copier technology was earth shattering at the time (hard to believe now). It had a stable of amazing inventions being developed at Xerox PARC. It was thought of as a \"millionaire maker\" for much of a decade.\n\nDoesn't so much of that sound like TSLA?", "score": 6, "replies": []}, {"body": "Xerox building in Rochester was sold not too long ago, wouldn't be surprised if they get dumped.\n\n> Xerox is headquartered in Norwalk,  Connecticut, though its largest population of employees is based around  Rochester, New York, the area in which the company was founded.", "score": 2, "replies": []}, {"body": "Under armor ours free money", "score": 2, "replies": []}, {"body": "That plotlion website is super useful, thanks for sharing.", "score": 2, "replies": []}, {"body": "Something that stuck with me (from cnbc) is that some funds already are maxed out (e.g. can, at most, hold 10% of their fund inam a single company  (or whatever arbitrary rules they have)) so when tesla shoots up, they are forced to sell some to keep at 10%. This causes some downward pressure.", "score": 2, "replies": []}, {"body": "Lmao under armor, I remember doubling my money from them back in 2015/2016 now they’re shit", "score": 2, "replies": []}, {"body": "I read somewhere that AMD buying out Xilinx opened up the spot for Tesla in the S&P so no company is going to need to be removed", "score": 1, "replies": []}, {"body": "Nice analysis!", "score": 1, "replies": []}, {"body": "Wait, why buy calls if they might get delisted?", "score": 0, "replies": [{"body": "It's a credit spread. you sell more expensive (closer to current value) and buy cheaper one (farther out).  \n\nYou have a net credit in your pocket and hope for them both to expire worthless.\n\nWorse case risk is defined it goes to the moon so you're only out the difference of the obligation you sold that isn't covered by the one you bought.", "score": 4, "replies": [{"body": "Well akshually, worst case scenario is it spikes to between the long and short legs, you get assigned before your broker can sell the automatically buy back the short leg. Then over the weekend, while you're short shares, *then* it gaps up to the moon. \n\nRare, but it does happen.", "score": 2, "replies": [{"body": "That would suck so badly to be naked over the weekend with no protection", "score": 3, "replies": [{"body": "That's one thing you do have control over; close out positions before EOD on expiry, especially is it's really close.", "score": 3, "replies": []}]}]}]}]}, {"body": "Yea very smart.  Why the different strike of Ralph Lauren?", "score": 1, "replies": [{"body": "Probably because of volume", "score": 2, "replies": []}]}, {"body": "Great thought process here sir. RL is my put. Sadly his health has declined (a lot) and their innovation is to make the logo 20X bigger and all over Marshalls, can’t be a great sign in the first place that you can always find them there, right? Too many similar brands in the space to stay hot, in my opinion, and in the S&P.", "score": 1, "replies": []}, {"body": "Intc", "score": 1, "replies": []}, {"body": "The problem is that Tesla is such a big company they might need to just take 1% off of every company in the index, not remove several smaller companies on the index.", "score": 1, "replies": [{"body": "You're right, they will probably have to rebalance their weighting of a bunch of different tickers to make room for Tesla. That being said, it also seems like someone is getting removed\n\nIn the statement from S&P, ([https://www.spglobal.com/en/research-insights/articles/tesla-added-to-the-sp-500](https://www.spglobal.com/en/research-insights/articles/tesla-added-to-the-sp-500)) they say \"The Index Committee has not yet determined which current constituent Tesla will replace\" which seems to imply that the Index committee will end up booting someone to replace Tesla", "score": 2, "replies": [{"body": "Well yes it's the S&P 500 not the S&P I Don't Know Whatever.\n\nPart of me is expecting Xerox to get dropped. I know they've dropped oil and gas this year but that also makes me think they're going to dump from a different sector.", "score": 2, "replies": [{"body": "Newscorp would be the best way to help the world.", "score": 1, "replies": []}]}, {"body": "That’s true. Gotta read between the lines sometimes.", "score": 1, "replies": []}]}]}, {"body": "If you combine UAA and UA it doesn't really count as bottom 10 anymore right? Would there be a scenario where they only remove one class of shares to make room?", "score": 1, "replies": []}, {"body": "I could see RL being taken private. They are in trouble.", "score": 1, "replies": []}, {"body": "This is a really interesting idea though unfortunately I dont see a way to profit off of it because you're gonna be 1 for 10.  However they are all pretty poor companies so maybe it'll work on its own merit without the SPY factor", "score": 1, "replies": []}, {"body": "Looking like my APA puts might pay off!", "score": 1, "replies": []}, {"body": "Won't they have to remove too many small companies if they are making way for 1% TSLA weightage in the index?", "score": 1, "replies": []}]}
{"title": "Big investment opportunities in tech companies who adopt this sales strategy", "selftext": "Hi,\n\nI work as a PM at a large tech company and as part of my job it's important for me to understand major technology trends. I put this post together to outline a major technology trend (bottoms-up sales) and to analyse some potential investment opportunities to go along with this trend.\n\nPlease let me know if you found this post valuable. I'm considering starting a tech/investing newsletter where I analyse tech trends and look at associated investment opportunities. Would love to know if that's something people would be interested in.\n\n&#x200B;\n\n**Bottoms-Up Software Sales**\n\nThe \"bottoms up\" go-to-market strategy is the main sales strategy used by some of the world's fastest growing enterprise software companies, from Atlassian to Zoom.\n\nThe premise behind the bottoms-up strategy is simple. Instead of taking a top-down approach, where software is sold directly to company leaders (CEO, CTO etc), bottoms-up software can be adopted by individuals or small teams at a company before expanding to being used company-wide.\n\nFor example, Zoom is often initially adopted by individual salespeople to run a remote sales call before being eventually adopted company-wide to run all company meetings.\n\nThere are huge opportunities for public investors who can understand and identify companies that are successfully using the bottoms-up strategy. In this post, I'll explain the benefits of a bottoms-up strategy and list some exciting public companies using this strategy to their advantage.\n\n## What's so special about bottoms-up?\n\nThere are a number of distinct advantages to the bottoms-up strategy that makes for incredible businesses and investments.\n\n&#x200B;\n\n* **Lower cost of customer acquisition (CAC).** Traditional top-down software companies such as Oracle and SAP spend a massive amount of money on sales. They need to since they are selling to C-level executives and their products typically cost millions to implement. Bottoms-up businesses don't have this problem. Users can sign up to their products directly from the website in minutes. Therefore they spend far less money on sales and can acquire customers for far less.\n* **More money for R&D.** Since bottoms-up companies don't need to employ a large sales force, they can spend more of their revenue on research and development. They can either focus on improving their current product offering or building brand new products.  \n   * This creates a really powerful flywheel effect. Less money spent on sales = more money for R&D = a better and faster improving product = more customers = less money spent on sales....\n* **More chances to be adopted.** Top-down companies only really get one or two chances to sell to a customer. If the CEO doesn't like your sales pitch, there's not much you can do. Bottoms-up companies have hundreds of chances to be adopted since they can be adopted by individual employees or small teams.\n* **You can sell down-market.** Many of the best SaaS (software as a service) products are used by both startups and large companies due to their bottoms-up strategy. This allows them to access a larger total addressable market, generate revenue early, get quicker feedback and to also grow revenue naturally as their customers grow in size. Top-down companies typically don't sell down-market due to the high sales costs involved for them.\n\n## What to look for in a bottoms-up company\n\nNot all bottoms-up companies are created equal. Here are some important things to look out for when evaluating investment opportunities.\n\n&#x200B;\n\n* **Look for a \"receptive\" market.** The bottoms-up strategy is not a one-size-fits-all approach. The approach just doesn't make sense for some products and markets. E.G. Payroll software needs to be adopted company-wide for it to be effective. Whereas project management software can be easily adopted by individuals or small teams. This is a receptive market.\n* **World-class design.** Bottoms-up companies can only be successful if their products can be easily adopted and used by individual users. To provide value quickly, these products need to be intuitive, simple and a joy to use. Look for products that fit this description. If you are unsure on how to evaluate design quality, go to websites such as G2 and read customer reviews.\n* **Growing average revenue per customer.** Bottoms-up products are easily adopted by individual employees. However, the real test of a bottoms-up product is whether or not it spreads within each customer and starts to generate more and more revenue. Look for companies where this is happening. If a bottoms-up company is only growing through new customer acquisition then this is a bad sign. Their product is not being widely adopted at each customer.\n* **High sales efficiency ratio.** In the same vein as the advantage of having a low CAC, high quality bottoms-up companies should have high sales efficiency ratios as they need to employee fewer salespeople than top-down companies.\n* **Moving up-market.** While the ability to sell down-market is a big advantage, you should be wary of companies that only sell down-market. Look for companies that sell to both Fortune 500 companies and startups.\n\n## Bottoms-Up Companies\n\nBelow are some bottoms-up companies that are, in my opinion, great investment opportunities. (Please note, that this is not investment advice and just the companies that I'm excited about for my personal portfolio).\n\n### Asana ($ASAN):\n\nAsana is a project management software company that IPO'd in late September. It is the archetypical bottoms-up company; individual users/teams adopt Asana to run their own projects before it is eventually adopted company-wide as the go-to project management tool.\n\nI like Asana for a couple of reasons:\n\n&#x200B;\n\n1. **Asana's sales efficiency is 1.15.** This is a very healthy number for a newly public company and shows that their bottoms-up strategy is working very well.\n2. **R&D spend is 64% of revenue.** While this may seem incredibly high to some and could be a negative sign at a more mature company, as explained above bottoms-up companies live and die on the quality of their product. A high % spend on R&D shows that Asana's management clearly understand where their money can create the most long-term shareholder value.\n3. **Product & design quality.** This is an entirely personal opinion but I've used Asana extensively and it's the best-designed project management tool I've ever used.\n4. **YoY revenue growth of 85%.** Even though Asana is a relatively young company, revenue growth of 85% is incredibly impressive.\n\n### Slack ($WORK) :\n\nSlack is a business chat/communications tool for companies. Colleagues can send DMs to each other, create channels (chat rooms), private groups and more. It is becoming the de-facto internal communication channel for many of the world's fastest growing companies.\n\nI like Slack for a couple of reasons:\n\n&#x200B;\n\n1. **Product stickiness.** Once Slack is adopted company-wide it is incredibly hard to replace. The deep customisation allowed (different channels, private groups etc) and the amount of stored knowledge in the system means that many companies would almost grind to a halt if they could not use it. They would not be able to effectively communicate. This is in contrast to a tool like Zoom, which could be fairly easily replaced if better video conferencing software was available.\n2. **Average user activity is 90 minutes per day.** The average slack user spends 90 minutes every day on the platform. This is an incredible example of the value that slack is providing to it's users and is indicative of a bottoms-up product that is getting adopted company-wide.\n3. **65 of the Fortune 100 use Slack.** As mentioned above, a critical measure of a bottoms-up company is whether or not they can move up-market. Slack is being used by some of the world's fastest growing public companies. It is also used by Amazon, which at the time of writing is the 3rd largest company (by market cap) in the world.\n\n### Honourable Mentions:\n\nBelow are some more bottoms-up companies that are definitely worth investigating.\n\n&#x200B;\n\n1. Zoom ($ZM)\n2. Atlassian ($TEAM)\n3. Datadog ($DDOG)\n4. Zendesk ($ZEN)\n5. Hubspot ($HUBS)\n\n&#x200B;\n\nWould you be interested in reading more posts like this? If so, please let me know in the comments. Thanks", "id": "jwlgvn", "created_utc": 1605724691.0, "score": 242, "upvote_ratio": 0.94, "num_comments": 82, "comments": [{"body": "How does $ASAN make their money and how scalable is the business? Also, what specific markets is $ASAN in and how much are those respective markets supposed to grow over the next decade or so?", "score": 20, "replies": [{"body": "Hi,\n\nAsana makes money much in the same way that most other Saas companies do. By charging their customers per user per month. Asana typically charges 25 usd per user per month. So if a customer has 1000 employees all using Asana, thats 25K per month. Its hugely scalable since it sells pure software and therefore gross margins are over 80%.\n\nAsana is in the project management market where it competes against companies liek Atlassian. The estimated market size is 20 billion usd and is expected to grow to 35 billion usd by 2025.\n\nI would argue it is even bigger since any company where employees need to collaborate online is a potential customer.", "score": 16, "replies": [{"body": "What competitive advantages do they have over companies like Slack or Atlassian? I also checked out their app and it looks really nice.", "score": 4, "replies": [{"body": "So, I woulsnt say it really competes with slack. There is definitely crossover but Asana is for collaborating on tasks/projects while Slack is for communicating about everything else. They actually have quite a few similar customers.\n\nFor Atlassian, there is definitely no strong moat-like competitive advantage or anything. But I've used both quite a lot and in my opinion the advantage is just that Asana's product is much better. It's better designed and more useful.", "score": 12, "replies": []}, {"body": "Hey buybaba. What do you project baba to be in oneyr.....3 yr? I say it has good upside.", "score": 2, "replies": [{"body": "I project that this name was the first thing i typed that wasn't taken", "score": 2, "replies": [{"body": "Haha cool! I thought you were a baba maximalist.", "score": 1, "replies": []}]}, {"body": "You’re gonna ask a dude who literally made a new account 5 days ago whose name is tryi  bc to pump a specific stock, “why should you buy BABA?”? And trust that they’re not just trying to sell you on pumping that specific stock?", "score": 3, "replies": [{"body": "I don't even have any holdings in baba lol. just funny to me", "score": 5, "replies": [{"body": "Oh haha wouldn’t have guessed. But yeah, we get a lot of memes around here and likely a lot of bots and pumper dumpers. Just figured I’d drop in 2cents", "score": 5, "replies": []}]}, {"body": "Do you really think people are trying to \"pump\" a **700billion** dollar stock on Reddit by having that as their username?\n\nHe would have to influence a market swing of 7 billion  to \"pump\" it by 1%.", "score": 1, "replies": [{"body": "never know man, ive seen people pump amazon before", "score": 1, "replies": []}]}]}]}]}, {"body": "No system will replace jira... no matter how shitty it is", "score": 3, "replies": [{"body": "Say it ain't so", "score": 2, "replies": []}]}, {"body": ">\tThe estimated market size is 20 billion usd and is expected to grow to 35 billion usd by 2025.\n\nBy who?", "score": 1, "replies": [{"body": "A couple of different articles. Here's one from Forres that estimate it will grow to 32 billion: https://www.forbes.com/sites/bethkindig/2020/09/03/analysis-of-asanas-upcoming-ipo/?sh=3fa5f47a6294\n\nMarket growth expectations are always an analyst estimate so could obviously prove to be wrong", "score": 1, "replies": []}]}]}]}, {"body": "Is the phrase not ‘bottom up’ not ‘bottoms up’?? As a British reader i can’t help picturing a load of butts in the air", "score": 9, "replies": [{"body": "Hahaha, you're right. Its bottom-up lol. My mistake", "score": 4, "replies": []}, {"body": "I thought this was about getting drunk before gambling on robin hood", "score": 1, "replies": []}]}, {"body": "Asana's stock listing was organised in the form of direct listing (DPO) and not the traditional IPO form.", "score": 7, "replies": [{"body": "Ya, should've mentioned that. Thanks for calling it out", "score": 3, "replies": []}]}, {"body": "This is interesting, and something that a lot of product / application administrators at companies are now battling against. \n\n&#x200B;\n\nBasically it is as you described, they target individual members, and then you end up with about 1000+ slack licenses for a single company instead of one, then the admins have to do clean up after the fact.\n\n&#x200B;\n\nI guess I'm saying this because I don't think this model is going to be looked fondly upon by a majority of companies that are consuming these applications. They generally move to consolidate quickly, or revoke user privileges to install these things.", "score": 4, "replies": [{"body": ">Basically it is as you described, they target individual members, and then you end up with about 1000+ slack licenses for a single company instead of one, then the admins have to do clean up after the fact.\n\nThat's is very good description, but eventually they make money by targeting individual members instead of spending money on sales.", "score": 2, "replies": []}, {"body": "Definitely an issue. The best bottom-up companies will have a good after-sales team that can identify this. By all accounts Zoom are very good at this.\n\nSo, for example if Zoom notice that they have 5 new accounts at company X, they will quickly reach out to leaders at that company to tey to consolidate that account.\n\nBut if that doesn't work then it can definitely be very messy", "score": 2, "replies": []}]}, {"body": "Also Cloudflare, AWS", "score": 4, "replies": [{"body": "And dropbox", "score": 4, "replies": []}]}, {"body": "love it!", "score": 3, "replies": [{"body": "Great to hear", "score": 1, "replies": []}]}, {"body": "Thank you for this. Would love more and would definitely subscribe to a newsletter.", "score": 3, "replies": []}, {"body": "I help write/analyze for a newsletter. This is a good post and I think it's something you should pursue. You've got your edge and you communicate it well.", "score": 3, "replies": [{"body": "Thanks a lot. Appreciate it", "score": 1, "replies": []}]}, {"body": "Great write-up. I think they are pivoting a little more to more traditional top-down sales now (in what they call a “hybrid” approach). I like the top-line revenue growth, especially the fact that part of it comes from revenue retention itself (at roughly 120%). This is the reason why I don’t really mind the competition as well, because it shows they offer enough of a decent product that their existing consumers are willing to pay *more* for their services. \n\nBut it seems their earnings have been in steady decline and the downward trend is forecast to continue into next several (3ish) years. I don’t mind young tech companies being unprofitable, but I expect that they move toward it when forecasting on the time horizon of 3 years—not away from it. Where are they bleeding? Are they just shovelling money into R&D too fast too soon?", "score": 3, "replies": [{"body": "Really good point on the R&D. Always a danger that its more of a spray and pray than a calculated decision", "score": 2, "replies": []}]}, {"body": "Interesting good informafion.", "score": 2, "replies": [{"body": "Glad you liked it", "score": 2, "replies": []}]}, {"body": "Interesting and clear! Thank you.", "score": 2, "replies": [{"body": "No prob", "score": 1, "replies": []}]}, {"body": "Very informative! Thank you for this post.", "score": 2, "replies": [{"body": "No problem", "score": 1, "replies": []}]}, {"body": "Hi! Great post, would love to read more like this.", "score": 2, "replies": [{"body": "Great to hear. Will update this post when I launch the newsletter", "score": 1, "replies": []}]}, {"body": "Thx for sharing", "score": 2, "replies": [{"body": "No prob", "score": 1, "replies": []}]}, {"body": "Weird for me that the term you use is \"bottoms up\" as opposed to \"bottom up\".  I have always heard and used the term as bottom up.  Bottoms up on the other hand would mean \"drink up\".", "score": 2, "replies": [{"body": "Ya, that was my mistake lol. Its bottom-up", "score": 1, "replies": []}]}, {"body": "Ahhhh ... So THAT'S why sales from places like you mentioned keep contacting me. I'm like \"I can't make the damn decision!! Stop emailing me\" lol\n\nGreat information!", "score": 2, "replies": [{"body": "Haha", "score": 1, "replies": []}]}, {"body": "Always interested in reading more posts like these. :)", "score": 2, "replies": [{"body": "Glad you liked it", "score": 1, "replies": []}]}, {"body": "Nice work, would like more", "score": 2, "replies": [{"body": "Thanks, ill make sure to keep you posted on the newsletter", "score": 1, "replies": []}]}, {"body": "Great write up. Very insightful", "score": 2, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}, {"body": "More post like this please", "score": 2, "replies": [{"body": "Definitely. I think I'll definitely pursue the newsletter", "score": 2, "replies": []}]}, {"body": "Id agree that Bottoms up approach is excellent but primarily for the small to mid market companies. This is a market that big software companies struggle with because prices and process is more rigid.", "score": 2, "replies": []}, {"body": "Very informative. thank you.  i would love to read more, your article  captured my attention.   \nMight want to add that, bottom up strategy works better when product pricing starts low as lower level workers can acquire lower funds easier.  i guess that's why Sales always rather talk to the C Suite Big fishes vs Guppies Engineer's, like me. lol", "score": 2, "replies": [{"body": "Haha, good point. Thanks", "score": 1, "replies": []}]}, {"body": "The biggest challenge with bottoms up is that it creates shadow IT, which companies are increasingly taking steps to prevent. Even though the companies you highlight are great companies, many others are not. You can imagine how widespread addition of new applications into the Enterprise creates an huge security risk. When IT isn't in control of the new apps being introduced into the system, there's no visibility, which means they are much less likely to take proper steps when they become aware of a known vulnerability. Anna my the time they find out that Kevin in accounting loaded that beta version of xyz software, they're n already too late.", "score": 2, "replies": [{"body": "Ya, really good point. I remember reading in Oktas state of saas report that the average software company has over 900 saas apps while there CIO thinks its closer to 50", "score": 1, "replies": []}]}, {"body": "Great writing man :)", "score": 2, "replies": [{"body": "Thanks a lot", "score": 1, "replies": []}]}, {"body": "Stellar post! Will be subscribed to the newsletter!", "score": 2, "replies": []}, {"body": "Thank you for this 🕺looking forward to your future posts/newsletter 🕺🕺🕺🕺🕺🕺🕺", "score": 3, "replies": [{"body": "No prob, glad you liked it", "score": 4, "replies": []}]}, {"body": "Wow you wrote a lot, but also nothing.", "score": 2, "replies": []}, {"body": "Hi everyone, I've decided to give the newsletter a go :) I'll aim to write one detailed post per week on tech trends and investing opportunities. \n\nYou can sign up here if you're interested: [https://techinvestingtrends.substack.com/](https://techinvestingtrends.substack.com/)\n\nHope you like it :)", "score": 1, "replies": []}, {"body": "What about pandadoc?", "score": 1, "replies": [{"body": "I think Pandadoc is still a private company. But I definitely could have included Docusign. Great business too", "score": 5, "replies": []}]}, {"body": "What kind of moat does Asana have and what makes it more appealing then it's competitors and how much market share can they get in the next 5 years I heard you said the market they are in is a 20 billion dollar industry but they are only worth 3 billion", "score": 1, "replies": [{"body": "In my opinion they don't have a moat as such but their competitive advantage is in their superior product. Not sure how much market share they can capture but they are growing revenue at 80% per year so definitely a lot more than they have right now", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Seriously? You hardly think jira is better?", "score": 1, "replies": [{"body": "Or smarsheets? Lol", "score": 1, "replies": [{"body": "Yes, clearly", "score": 1, "replies": []}]}]}]}]}, {"body": "I also like there CEO co founder of Facebook and there customers are Facebook Google PayPal and others", "score": 1, "replies": [{"body": "Your reasoning is flawed based on your initial post. Bottom up companies claim customers, but you don’t know how many users they have. How many justifies a website post? Are they the primary vendor for that customer?", "score": 1, "replies": []}]}]}, {"body": "Once Asana gets their look and feel nailed down like Slack, they will be a force. But, their current UX is terrible.", "score": 1, "replies": []}, {"body": "I wonder why Slack is on here considering most companies are moving to MS Teams which does chat/calling/meetings ect...", "score": 1, "replies": [{"body": "Definitely their biggest competitor. But if you look at net new sales they are doing surprisingly well", "score": 1, "replies": []}]}, {"body": "Hi, just wanted to know what your recommendation on the buying price and when we should invest", "score": 1, "replies": [{"body": "I wouldnt fell comfortable giving a recommendation on buying price etc. I think its important to come to that conclusion by yourself.\n\nWhat I can say though is that I've added both to my own personal portfolio at their current price. But I also plan on holding for 5-10 years and am quite comfortable if a 30%+ drop in price happens in the near term", "score": 1, "replies": []}]}]}
{"title": "Morgan Stanley Turns Bullish on Tesla for First Time Since 2017 - upgrades price to $540 from $360", "selftext": "[deleted]", "id": "jwc9j4", "created_utc": 1605688746.0, "score": 363, "upvote_ratio": 0.99, "num_comments": 75, "comments": [{"body": "[deleted]", "score": 136, "replies": [{"body": "The issue is that as a car company Tesla is way overvalued, but this isn't just a car company.  These big banks are ran by old people who think it's just a car.", "score": 60, "replies": [{"body": "[deleted]", "score": 25, "replies": [{"body": "To paraphrase Jeff Foxworthy: \"if you ever needed your kids to fix your computer or phone issues, you're definitely not a technology company analyst.\"", "score": 12, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "what's a software?", "score": 5, "replies": []}]}, {"body": "Exactly", "score": 5, "replies": []}]}]}, {"body": "People keep saying this. How? Trailing or forward EPS is a bologna # when:\n\n-trailing or forward rev and corresponding EPS is wrong. Bc growth is about to be > 2x analyst estimates for 2021 and 2022, so “fwd eps” is meaningless bc analysts are beyond inaccurate / understated\n\n-eps is meaningless for a capital-intensive hyper growth stock. Why? Bc it drastically over amortized R&D, warranty costs, you name it. When your team can build a factory in 12 months and the cash payback is about 12-18 months but you’ve amortized too aggressively, when you show profits suppressed bc of all the amortization it’s hiding in plane site that your free cash flow by comparison is exploding - use forward free cash flow not eps. With a 100% growth handle next year and 50% long term (Amazon was ~30% so this is 40%+ faster and ought to be far higher valued on fcf or rev to enterprise val basis).\n\nIt’s actually the cheapest mega cap growth stock, by far. This is why it’s been so fun picking up all the free $ off of silly Wall Street clowns who don’t get neither accounting, bot the engineering going into this impossible venture. \n\nTesla is the gift that keeps giving. You can make 100x in a year or more trading options when it’s out of whack or you can buy and hold the stock through the noise. Square is the same way but less exciting. Same path and same confusion that’s very entertaining to watch and then make a fortune on.", "score": 24, "replies": [{"body": "Not to mention Elon can bring in an easy 5-10M within 2-5 hours from his random limited edition collectibles that I'm sure they put to good use. Think Tesla Tequila.", "score": 8, "replies": [{"body": "M? \n\nHe can raise $10B by lifting his ass cheek up slightly during a shit, and raise another $10B+ during the same shit just by leaning slightly the other direction.", "score": 13, "replies": [{"body": "A fart is an additional $1 billion", "score": 6, "replies": [{"body": "Haha. Even his GF’s farts are like $500M. Actually I think he’d dump her if she farted and it wasn’t symmetrical sounding.", "score": 4, "replies": [{"body": "Are you kidding?  She gets royalties every time you someone presses fart mode.", "score": 2, "replies": [{"body": "Jezus some of these threads are gold.", "score": 5, "replies": []}]}, {"body": "hahaha. Is it a clean fart? Or does it have some goo goo", "score": 2, "replies": [{"body": "Ha ha. The fart would have to have an exponential curve for him to be satisfied.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Is it possible to learn this power?", "score": 3, "replies": []}, {"body": "You trade Tesla options?", "score": 2, "replies": [{"body": "I don’t know if I’d say I trade them. But I buy leaps when the stock is absurdly low. I’ve owned March $200s since July of 2019 when it was $39/share and they cost $2 per lot. \n\nLatest trade was buying Dec $500 calls, picked up and posted about the Friday before the election. I think these run up for YE, already up a lot since the news. \n\nThink there’s room to run on options with TSLA but far out ones at far out of money prices have gotten insanely expensive. The free money is now in $SQ options: June 2022 $250 leaps are the SQs I have now. Think they’re going to $1,000 by then or a (1000-250)/$30 or a 25x from here.", "score": 5, "replies": [{"body": "Why is everyone here so bullish on square", "score": 8, "replies": [{"body": "We read a lot from ARK", "score": 4, "replies": []}, {"body": "Bc they have the fastest growing digital bank that’ll dominate all of banking, and with Ant Group coming on as a monster player Ant Group will act like a rudder for SQ. A rudder bc the gov needs to support SQ now and not be totally controlled by the silly big banks. Bc losing to tech is < losing to China. So the best thing that ever happened to SQ is Ant popping up with the worlds biggest IPO. \n\nSQ Cash App sales are going to the moon with crypto volumes (which are Velcro for deposits), a debit card that will dominate the credit card market (think debit / interac infrastructure + bigger points (5-6%) + interest way lower than Visa/MC),  trading stocks/crypto, etc. \n\nIt is growing egregiously fast and margins are huge. Avg user / bank customer goes from ~$150 to ~$1200 in short order at the same time the massive revenue scale and user scale occurs. \n\nSq @ $2T market cap by YE 2022. See you there.", "score": 3, "replies": []}, {"body": "Square is basically following the business plan that Elon Musk laid out as his vision for PayPal before it sold off and he got sort of pushed out.\n\nThe potential for growth is enormous, and many people feel that what Tesla is doing to the established auto business is what square will be doing to your  banking majors in the next several years.", "score": 3, "replies": [{"body": ">Square is basically following the business plan that Elon Musk laid out as his vision for PayPal before it sold off and he got sort of pushed out.\n\nSo Jack Dorsey took elons plan and hid it in his ugly long fake ZZ top beard ?", "score": 1, "replies": []}, {"body": "Exactly. If PayPal had balls or talent they would have gone for the CashApp strategy before AliPay went and did it. Now it’s erupting as the crypto movement cranks adoption and deposit flows -> 💣🔥🩳🔥💣", "score": 1, "replies": []}]}]}]}]}]}, {"body": "so your telling me they are to old to go to the website and see solar, powerwalls and miss that tesla is building the biggest batterie systems of the world? oh and they cant understand / see autopilot?  come one", "score": 1, "replies": []}]}, {"body": "Where do I get sum of dem 5 figure salaries ;)", "score": 11, "replies": [{"body": "[Tyrone Biggums](https://cdn.quotesgram.com/img/94/40/1959393122-OThmYTA0M2UtZWQwMC0xMWUwLWFjYTYtMDAyNmI5NDE0ZjMwLnN3ZjY1_o_tyrone-biggums---fear-factor.jpg) has entered the chat.", "score": 2, "replies": []}]}, {"body": "Not only that, they  lack long term thinking as well. Same as in politics, people don’t realize that if we spent a little money on education and infrastructure(green) now it would save us boatloads in the future", "score": 8, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Oh NOOO!  Analysts do not get paid to be right.   They get paid to tell clients what they want to hear and push the safe investments that are purely safe because they are \"widely held\" and generally accepted and known names.  \n\nI know this because I've been to investor conferences and wealth manager meetings.", "score": 2, "replies": []}]}]}, {"body": "I don’t believe it is an honest mistake. Their job is not to do the right analysis and be honest with the public. They are paid shills like those talking head on highly politicized mainstream news media. We will never know who’s behind them and they are not trustworthy worthy.", "score": 5, "replies": [{"body": "Agreed. Wall Street has had it out for Elon for years now, they tried to oust him a few years ago.", "score": 1, "replies": []}]}, {"body": "It is absolutely mind-blowing how little analysis is done by these so called analysts. My theory is that they just copy one another. If an analyst at Morgan Stanley sees his counterpart at Citibank downgrading a company, he'll follow suite and then put together something to back his \"thought process\".\n\nWall Street professionals are just salesmen and women.", "score": 3, "replies": []}, {"body": "yea just need to put a price target on a stock and write some rubbish reason. can’t think of an easier job for this", "score": 2, "replies": []}, {"body": "You do realize $10k / year is a five figure salary, right?", "score": 2, "replies": []}, {"body": "There are a surprising number of people from top universities who lack any sort of creative or independent thought.  They were good at taking rote exams or have parents whose wealth bought them a seat.", "score": 2, "replies": []}, {"body": "Adam Jonas is totally clueless, asks the most space-cadet, ignorant questions on the earnings calls. Incredible that people trust him with their money.", "score": 2, "replies": []}, {"body": "I just posted the article from 2019 where he had a $2-78.2 range post split. \n\nhttps://www.marketwatch.com/story/tesla-stocks-bear-case-is-10-morgan-stanley-says-2019-05-21", "score": 2, "replies": []}, {"body": "once they have a big position in it they upgrade the stock", "score": 2, "replies": []}, {"body": "Really highlights some ingrained inefficiencies in the market... which is great for me as a retail investor. Just had to recognize the value and be very patient as the market caught up.", "score": 2, "replies": []}, {"body": "You ***do*** realize that Morgan Stanley doesn’t use Adam Jonas to influence their own decisions on whether or not to hold TSLA, right?  Morgan Stanley (and every other institution) has their own ‘buy-side’ analyst(s) who do real research and actually know what they’re talking about.  Jonas is a ‘sell-side’ analyst, hired to make drama and noise which attracts clients to Morgan Stanley.  Jonas isn’t paid to be right and he’s doing his job well.  If he was actually good at predicting stocks, he’d be worth so much to Morgan Stanley that they’d hire him to a team behind their curtain, and you’d never hear of his name again.", "score": 2, "replies": []}]}, {"body": "So basically he is not bullish but just forced now that they are in the S&P500...  I think I can become an analyst too... (and do a better job).  I'll take 50% of his paycheck, they will save money.", "score": 25, "replies": [{"body": "All you gotta do to be an analyst is set your price target to the current stock price. Then once every month or two change your price target to the current stock price again. Analysts are jokes.", "score": 12, "replies": []}]}, {"body": "Adam Jonas wrote in a note as he upgraded the shares from equal-weight and raised his price target by 50% to $540, suggesting 22% upside for a stock that’s quintupled this year.", "score": 17, "replies": [{"body": "> Adam Jonas \n\nBTW., Adam Jonas is the \"$2 TSLA bearish price target\" bozo from last summer ...", "score": 29, "replies": [{"body": "Morgan Stanley’s valuation now includes 'Tesla Network' services, Energy storage and Insurance businesses.\n\nExpect introduction of Tesla Network soon (possibly January 2021).", "score": 9, "replies": [{"body": "He started reading this sub, I presume?", "score": 15, "replies": []}, {"body": "ride hailing network?", "score": 2, "replies": []}]}, {"body": "https://electrek.co/2019/12/06/tesla-tsla-500-bull-case-morgan-stanley-wrong/\n\nAlso this gem here too...", "score": 3, "replies": [{"body": "Ha, that was back from the days when /u/FredTesla was still writing fairly worded Tesla news:\n\n> \"Morgan Stanley analyst Adam Jonas has a strange approach to covering Tesla where he is significantly hedging his prediction with an extreme bear case of $10 per share, a base case of $250 per share, and a bull case of $500 per share\"\n\nThat's all pre-split, so he had a bear case of $2, base case of $50 and bull case of $100. 🤦", "score": 10, "replies": [{"body": "It just baffles me how people can follow or pay these analysts.", "score": 3, "replies": []}, {"body": "And with that wide a margin, he STILL missed it:-)", "score": 2, "replies": []}]}, {"body": "That's 6th December 2019 11:09 am. (Before the stock split).\n\nToday is 18th November 2020.", "score": 5, "replies": []}]}]}, {"body": "During that 5 billion raise some weeks ago, a lot of big boys bought at 475.\n\nYou know they can’t let themselves have a loss on that by end of year. Expecting more upgrades.", "score": 19, "replies": [{"body": "> You know they can’t let themselves have a loss on that by end of year. Expecting more upgrades.\n\nAnalyst upgrades leading up to the end of 2020 will usually be indicative of expected 2021 deliveries and earnings - which have been moving up steadily.", "score": 9, "replies": []}]}]}, {"body": "Apple destroyed Nokia, Sony Ericsson, Motorola and became 2T company. Netflix destroyed Blockbuster.\n\nTesla is disrupting not only car makers, oil companies and introducing energy storage. \n\nWhat do you think the outcome would be, if successful.", "score": 33, "replies": [{"body": "The largest company this planet has ever seen. Everyone on this sub would be millionaire's.", "score": 22, "replies": [{"body": "I hope so cuz I'm @ 98 chairs.... That would mean over $10,2XX  stock price!", "score": 4, "replies": []}]}, {"body": "papa elon will soon overtake papa bezos", "score": 7, "replies": []}, {"body": "Tesla definitely has a path to becoming a $5-10T company considering the markets that it is disrupting.", "score": 12, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Rooftops", "score": 3, "replies": []}]}, {"body": "Netflix (and now others) are in the process of hurting cable tv as well. Cord cutting keeps happening.", "score": 2, "replies": []}]}, {"body": "Just read this already at $453 as we speak.", "score": 10, "replies": [{"body": "I bought 440,450,470 calls expiring friday, today\n to add to my 420/450/550 calls expiring in 2021/22.\n\nRolled the dice, trying to hit that fire bet...\n\n🎲 🎲", "score": 6, "replies": [{"body": "Don't gamble too much.", "score": 3, "replies": []}]}, {"body": "$480", "score": 4, "replies": []}]}, {"body": "What a bunch of numb nuts...", "score": 6, "replies": []}, {"body": "Remind me never to take advice from  Morgan Stanley, worst track record ever.", "score": 11, "replies": [{"body": "Citibank would like a word.", "score": 3, "replies": []}, {"body": "JPM still has price target at like $60", "score": 2, "replies": []}]}, {"body": "Better late than never", "score": 2, "replies": []}, {"body": "He's such an idiot, how is he still employed and not fired yet? From that $10 bear case pre stock split to this. Joke. Someone pay me to be wrong all the fucking time at work please?", "score": 2, "replies": []}, {"body": "Nice", "score": 1, "replies": []}, {"body": "Can't believe they skipped over 420. Now they'll just have to wait for the next split to hit that magic number.", "score": 1, "replies": []}, {"body": "Adam Jonas/Morgan Stanley are dumb and manipulative. IMHO\n\nMany main street people figured out Tesla a long time ago. How can Jonas/MS stay dumb for so long?\n\nLast year Jonas was so sure Tesla was going to reach $10 and bankrupt. This year he thinks it could go to $5350 (both prices before split).\n\nI bet MS loaded Tesla shares and Calls and closed Puts. Now it's time to push it higher.\n\nThis kind of manipulation is illegal, if confirmed. Yet it's so lucrative, I don't know how to prevent it.", "score": 1, "replies": []}]}
{"title": "PLTR Big Brain Rich!", "selftext": "So a lot of us that were hyped as fck for PLTR because we were looking for something new instead of SLV, Tesla, PRPL, NKLA, and the same ol same ol hit biggg!\n\nNow I am asking... What is the newest one we all need to look at as our meme stock/option of the quarter!", "id": "jw8y2h", "created_utc": 1605672793.0, "score": 17, "upvote_ratio": 0.74, "num_comments": 84, "comments": [{"body": "PLTR it’s a long term meme, see you feb 2021", "score": 35, "replies": [{"body": "Lol buckle up 🚀🚀🚀", "score": 1, "replies": []}]}, {"body": "The newest one is PLTR. It's a triple digit stock for $17🚀🚀🚀", "score": 55, "replies": [{"body": "If it goes triple digit then it will surpass 100 billion. I can't wrap my retarded mind around it.", "score": 3, "replies": [{"body": "Zoom is 110b", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Did you seriously buy a bunch of shares not having a single fucking clue about this company or why it could go up? Nice!", "score": 76, "replies": [{"body": "Yea I bought a lot at 11 and averaged up today I said why not . I’m young and naive . Worked with net why not PLTR\n\nI saw someone post a 30 min YouTube video explaining it and it seemed legit , also trader stewie on Twitter does TA said it was just getting started . He’s much smarter then me\n\nForgot add thanks it is nice scared money don’t make money and you can’t be scared if you don’t know what your buying", "score": 17, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "I did that with SOLO yesterday. I knew they were EV and was just swing trading off hype but then I actually went and looked at the vehicle and sold everything at open today lol", "score": 16, "replies": [{"body": "I cannot being myself to buy their stock even though it keeps going up. Who the fuck wants one of these things?", "score": 9, "replies": [{"body": "Disregard their ugly one seaters (which do on fact have valid use cases) and look at their tofina and eRoadster then come back to us with how ugly you think they are 😉", "score": -1, "replies": []}]}]}, {"body": "*Winning*", "score": 0, "replies": []}, {"body": "Leap of faith.", "score": 1, "replies": []}, {"body": "That's what Soros said he did", "score": 1, "replies": []}]}, {"body": "The guy that owns PLTR has seen elon musk bald. He knows things others don't.", "score": 3, "replies": []}, {"body": "This is the way.", "score": 2, "replies": []}]}, {"body": "Yup this guys got it PLTR aint over yet", "score": 2, "replies": []}, {"body": "Lol PLTR is old news, we been talking about that for a lonngggg time.  The whole post is about finding the new ones 🚀🚀🚀", "score": 2, "replies": [{"body": "It’s about finding successful ones. PLTR and NIO are gonna slow trend up. It’s gonna make me rich if I keep compounding it all.", "score": 3, "replies": [{"body": ":) I prefer huge bursts thank you very much Lol", "score": 3, "replies": []}]}]}]}, {"body": "My post got removed but fuhk it. I was able to pick up RIOT!!! Take me to the tendies 🏴‍☠️", "score": 3, "replies": [{"body": "Make those tendies pirate!", "score": 1, "replies": []}]}, {"body": "Pltr is the bagger man", "score": 5, "replies": [{"body": "Money shot Lol", "score": 1, "replies": [{"body": "Smooch", "score": 2, "replies": [{"body": "💦", "score": 1, "replies": []}]}]}]}, {"body": "DKNG", "score": 4, "replies": [{"body": "say more", "score": 1, "replies": []}]}, {"body": "BLNK. IPOB. SPCE.", "score": 6, "replies": [{"body": "Tell me more of each of these and your views", "score": 1, "replies": []}]}, {"body": "I don't know if OTC stocks go here but I have a pink sheet lithium position that is running up on 2x avg volume with no hype, no pump, no news... nothing. Just going up\n$STLHF", "score": 3, "replies": [{"body": "Your username tells me that you went from chicken nuggets to bbq smoked chicken thighs.  The way of a boss.", "score": 1, "replies": []}]}, {"body": "FUBO", "score": 9, "replies": [{"body": "I like this", "score": 6, "replies": []}, {"body": "Say more, I prefer FUBAR", "score": 0, "replies": []}]}, {"body": "NIU worth a look", "score": 6, "replies": [{"body": "At first I thought that was NIO hah", "score": 0, "replies": []}]}, {"body": "NVDA. The robots are coming for our jobs and AI is the future!!!", "score": 5, "replies": [{"body": "NVDA is full to the t*ts and spraying, no way I am thinking this is a ride rally past 575-600.", "score": 1, "replies": [{"body": "You might be surprised. Strong Q3 and the ARM deal is looking fruitful.", "score": 2, "replies": [{"body": "maybe", "score": 2, "replies": []}]}]}]}, {"body": "$FVAC is a rare earth opportunity", "score": 2, "replies": [{"body": "Will check out :)", "score": 1, "replies": []}]}, {"body": "Kndi", "score": 2, "replies": [{"body": "say more", "score": 1, "replies": []}]}, {"body": "I am currently looking into Oil/Gas, they have been gaining up quite a bit since vaccine news, might be a quick buck as long we leave before the rug is pulled.", "score": 2, "replies": [{"body": "I lost so much there not even wanting to back despite tendie city haha", "score": 2, "replies": []}]}, {"body": "CIIC!", "score": 2, "replies": [{"body": "details!", "score": 1, "replies": [{"body": "https://www.reddit.com/r/wallstreetbets/comments/jwoakc/the_next_ev_play_ciic_and_arrival_merger/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 2, "replies": [{"body": "Will check out :)", "score": 2, "replies": []}]}]}]}, {"body": "$teva", "score": 2, "replies": [{"body": "Say more", "score": 3, "replies": [{"body": "Makes generic drugs which is a possible solution for reducing drug costs in US/Globe. Has been stuck in a range for 3 months looks like its poised to breakout. They sold off over opiod, price fixing suits that will likely settle for less than originally thought.", "score": 5, "replies": [{"body": "Teva is corrupted as fuck and go north or south. They carry too much risk IMHO", "score": 2, "replies": []}, {"body": "Gotcha thanks for the clarification dude", "score": 1, "replies": []}]}]}]}, {"body": "SPWR , FUBO, KNDI, FSR, BLNK", "score": 2, "replies": [{"body": "Tell me more of each of these and your views.  So far it shares with another poster and BLNK.", "score": 0, "replies": [{"body": "Look at 1 month, 3 month , 6 month and 1 year growth rates. Also look at the market sales info", "score": 2, "replies": [{"body": "Lol hmm", "score": 0, "replies": [{"body": "lots of EV\n\nEV need charge\n\nBLNK make charger\n\ncharge point bigger\n\nnot traded yet\n\nbuy when can", "score": 2, "replies": [{"body": "Buy SBE if you want Chargepoint", "score": 2, "replies": []}, {"body": "This is straight up socratic logic.  Fool Proof and no need for symbolic or predicate logic and truth tables -_-", "score": 1, "replies": []}]}, {"body": "It's too much to put here but google each of them.", "score": 1, "replies": [{"body": "-_-", "score": 1, "replies": []}]}]}]}]}]}, {"body": "CRSR", "score": 3, "replies": [{"body": "CRSR c are too expensive for me, when’s dat dip?!", "score": 6, "replies": [{"body": "Next month", "score": 7, "replies": []}, {"body": "Haha, I know, I got in at 17, sold at 22, and have been trying to get back in since. But I’m currently holding 2 5/21/21 30C’s that has been and should keep printing plenty of tendies.", "score": 4, "replies": [{"body": "Nice! I had my limit order all set at IPO and iirc RH glitched on me that morning and didn’t recognize it was finally listed.\n\nSo my avg is 21.52", "score": 2, "replies": []}]}]}, {"body": "Say more", "score": 1, "replies": []}]}, {"body": "NNDM", "score": 1, "replies": [{"body": "Say more", "score": 0, "replies": [{"body": "Israeli 3d printing firm. They're 3d printing circuit boards. Could be a player in rockets and satellites. \n\nTheir performance is lackluster but the stock is volatile. \n\nFound them through sifting through what ARK is buying up.", "score": 4, "replies": [{"body": "Will check out!", "score": 1, "replies": []}]}]}]}, {"body": "Quantumscape (KCAC)\n\nDeveloping lithium metal batteries for EV’s that are more energy dense than current lithium ion batteries. Better range, faster charge, no fires. Partnership with VW in place but aren’t planning on revenue for a few years still.  Bill gates has also invested.", "score": 1, "replies": [{"body": "Upvote for providing info :)", "score": 2, "replies": []}]}, {"body": "CRWD is about to go through the roof... had a great quarter and earning are coming up", "score": -1, "replies": [{"body": "Why", "score": 1, "replies": []}, {"body": "Reasoning?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I am looking for the new scoops!", "score": 1, "replies": []}, {"body": "lol guess he’s gonna miss out on tendie town. i’ll bet you 10k that pltr will hit 25 in 2021 oh wait i already literally bought 10k$  in calls for PLTR 25$ feb 2021 EZ CLAP GG NO RE PLTR GO BRRRRRRRR", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "absolutely and fuck you", "score": 1, "replies": []}]}]}, {"body": "...because of the companies envoy emr to in DHS, which he opposes. It has nothing to do with the companies outlook", "score": 1, "replies": []}]}]}
