{"title": "What are the best EV stocks to buy besides Tesla and Nio?", "selftext": "As we are all aware, EV stocks have been booming recently and are hyped up to be big winners in 2021. As we also all know, Tesla and more recently Nio have been all the rage. We all know these 2 stocks very well, but there are many other EV stocks out there such as Workhorse, Hyliion, BYD, Li, Lordstown, Fisker, etc. And there are other non-vehicle EV stocks such as BEEM and SBE. And I'm sure I'm missing many other EV stocks as well.\n\nWhat are everyone's thoughts on the best EV stocks right now besides the Tesla and Nio?", "id": "jshj10", "created_utc": 1605132136.0, "score": 34, "upvote_ratio": 0.85, "num_comments": 88, "comments": [{"body": "FSR", "score": 29, "replies": [{"body": "Automotive whitelabeling at a $6B valuation. No thanks.", "score": 1, "replies": [{"body": "What do you mean white labeling?", "score": 1, "replies": [{"body": "Magna platform, Magna engineering, Magna manufacturing, Fisker branding.", "score": 1, "replies": []}]}]}]}, {"body": "SBE is a buy", "score": 7, "replies": [{"body": "Still a buy?", "score": 3, "replies": []}]}, {"body": "Xpeng", "score": 24, "replies": [{"body": "This one right here", "score": 3, "replies": []}]}, {"body": "I'm going to say watch HYLN's upcoming earnings...", "score": 19, "replies": [{"body": "When is HYLN's earnings? I held them through October and felt nothing but despair. November has been kinder at least lol.", "score": 5, "replies": [{"body": "This morning.", "score": 1, "replies": []}]}]}, {"body": "Hyln", "score": 10, "replies": []}, {"body": "I like Niu for the bike/moped market.\n(Not a nio typo)", "score": 11, "replies": [{"body": "Ya! Im doing pretty well with them this year. Strong fundamentals and not overhyped like Nio. I'm holding long term.", "score": 2, "replies": []}]}, {"body": "FSR , WKHS?", "score": 5, "replies": []}, {"body": "NIU. Solid fundamentals, profit, not overhyped and you can actually see their product around US and Europe.", "score": 7, "replies": []}, {"body": "Ah another Nio thread, cannot wait to see another Nio post in the next 30 mins!", "score": 47, "replies": [{"body": "I get the frustration here, but that's honestly a big part of why I made this thread to hopefully discuss EV stocks without talking about Nio.", "score": 30, "replies": []}, {"body": "It's a three team cycle of Nio, PLTR, and RKT lately. Can't wait to see what we get next week!", "score": 11, "replies": [{"body": "Makes you almost the dkng posts. Almost", "score": 7, "replies": [{"body": "woops", "score": 1, "replies": []}]}]}]}, {"body": "I waited and took a position in HYLN at $20.32.  I like their business model and the ability to get their product into trucking fleets at a relatively low cost.", "score": 4, "replies": []}, {"body": "I'm wheeling on fsr, wkhs, blnk and hyln\n\nGet before rocket ship to mars", "score": 3, "replies": [{"body": "FSR reportedly has 2 employees, and hyln has 4. I wanted to buy in, but this seems sus to me.", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Hmmm. Can't post pictures in comments?", "score": 1, "replies": []}, {"body": "On the company profile of robinhood, it says 2. This link shows 1 employee. Can't find anything that says it has more. https://www.owler.com/company/fiskerautomotive", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Yes, definitely could be. I looked on their website and looks like they have 74 openings, including an HR coordinator, lol. Maybe they've been on a hiring spree.", "score": 1, "replies": []}]}, {"body": "https://www.dnb.com/business-directory/company-profiles.fisker_inc.eb232eabbf6fee2583fc2231a74b86a0.html#company-info\n\nThis link says they have 5 employees.", "score": 1, "replies": []}]}]}]}]}, {"body": "XPENG, LI and SBE", "score": 7, "replies": []}, {"body": "Li Auto", "score": 8, "replies": []}, {"body": "ALB", "score": 3, "replies": []}, {"body": "Workhorse.\n\nThey also own 10% of RIDE.", "score": 3, "replies": []}, {"body": "Fisker if you’re looking for growth potential.", "score": 6, "replies": [{"body": "I remember seeing a Fisker Karma in 2012 and thought that car looked awesome", "score": 7, "replies": [{"body": "They lost badly to Tesla for a number of reasons but I really did like the look of that car. It also had really nice interior and fit&finish compared to Tesla Model S of the era.\n\nProblem is back then their pockets weren't big enough to expand the market, Tesla basically did that for everyone which is basically why EV companies are viable today.\n\nAlso from memory the Karma wasn't a pure EV, it had an ICE motor as well. Regardless, fucking cool car and I hope Fisker does better this time around now the market isn't EV hostile.", "score": 1, "replies": [{"body": "Happy Cake Day beefstake! The only dare you ever want to take is the dare to be all that you can be.", "score": 1, "replies": [{"body": "Good bot.", "score": 1, "replies": []}, {"body": "Man, it’s nice in here", "score": 1, "replies": []}]}]}]}]}, {"body": "KNDI. BLNK. SBE.  Huge soon.", "score": 3, "replies": []}, {"body": "ALB", "score": 2, "replies": []}, {"body": "RIDE", "score": 2, "replies": []}, {"body": "I’ve got skin on F. Mach-E reservations around 50,000 at ASP of $50,000 that’s $2.5B. And as a legacy auto-maker, they’re going to be able to scale fast.", "score": 3, "replies": [{"body": "Ford, GM, and Volkswagen.", "score": 1, "replies": []}]}, {"body": "The top three EV companies in China are NIO followed by XPEV, followed by LI. I have money in all three with the most in NIO as they have the least amount of risk.", "score": 5, "replies": [{"body": "I would argue that they have the biggest risk since they are more hyped than the others.", "score": 10, "replies": [{"body": "That’s an interesting point of view. I personally love Nios battery subscription plan, which will allow buyers to purchase cars for 10K less, and is great for sales. Customers don’t have to plug in their cars but instead this allows them to get the battery swapped out in 5 minutes at one of the many automated battery exchange stations - no human contact required. Customers have to pay a monthly subscription fee for this service, which is great for NIO. China plans to reduce gasoline cars soon and eliminate them completely by 2035.", "score": 2, "replies": [{"body": "I actually didn't know what the \"subscription\" model mean before. Thats actually quite a good idea.\nHowever i still think that doesn't exactly make the risk lower than LI and XPEV", "score": 1, "replies": []}]}]}]}, {"body": "WKHS + RIDE + NIU", "score": 1, "replies": []}, {"body": "GM. Mark my words", "score": 3, "replies": [{"body": "I seriously hate GM!! Parent has their stock, which they simply abandoned about 16 years ago. They just started a new stock symbol and left the old one so everyone that owned the old stock symbol was screwed. I’ll hate them forever as that was such a shitty thing to do!", "score": -5, "replies": [{"body": "Pretty sure that's not how that works.", "score": 8, "replies": [{"body": "That's actually exactly what they did 2009 after the bailout.", "score": 6, "replies": [{"body": "Yeah but through bankruptcy. They didn't just say \"hey we're changing our ticker so that none of our investors have any ownership anymore\". Buy companies with high debt and you risk the bankruptcy unfortunately", "score": -1, "replies": [{"body": "Yes they filed for bankruptcy and got billions in government aid, and still screwed over everyone that owed their stock, as they continue to do business to this day just under another stock symbol. \n\nPeople looking at some of the failing businesses due to CoVid19 need to consider this possible - think cruise lines, airlines, etc.", "score": 3, "replies": []}, {"body": "I mean Ford, Citigroup, AIG, Freddie Mac, Fannie May all did it without delisting but okay.", "score": 2, "replies": [{"body": "Yeah, just referring to the dude who said they just created a new stock symbol and left the old one. It's not that simple, they went bankrupt or had other circumstances. Companies don't just say hey let's screw over all the investors.", "score": -1, "replies": [{"body": "Except they did!! They did file for bankruptcy but they did not go out of business as they still are open today.", "score": 3, "replies": [{"body": "Bankruptcy doesn't necessarily mean that a business can't operate anymore, it's usually just debt consolidation.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "That is EXACTLY what happened!! The worthless stock is mine now. Google it! I’m warning people for a reason.", "score": 2, "replies": []}]}]}]}, {"body": "Tesla, Hyliion and NIO for the Asian market are the only EV companies that I reckon will actually succeed on a massive scale.", "score": 1, "replies": []}, {"body": "Volkswagen, BMW, GM, Ford.", "score": 1, "replies": []}, {"body": "Under the radar play: $GP \nThey make ev school busses and utility trucks. Check them out. It’s a low float stock so they pop nice. They’ve been going unnoticed since their ipo back In the summer.\n\nAlso look into $RMG for a spac ev battery play.", "score": 1, "replies": [{"body": "I'm looking at RMG and why is this so under the radar?\n\nEDIT: I see the merge hasn't happened yet and that's probably why it's under the radar thus far, still surprised it didn't move much on the news of the merge. I am legit debating putting a heavy position into this. With EV plays being so hot, this appears to be a no-brainer. It's stable at $10 currently and I don't see how the merger will let it drop lower than that. \n\nIf you have any additional DD and want to share your position, that'd be interesting to know. PM me to discuss.", "score": 1, "replies": [{"body": "Strong rumor is that wkhs will be getting the big usps contract before end of the year to electrify the next fleet of vehicles.  $TPIC may be getting part of the contract to supply materials to build and RMG is rumored to get the part of the contract to provide the batteries.  Roth Capital included this in their report a few weeks back.  The usps announcement hasn’t come out yet, but it has to be made before the end of the year. Wkhs, rmg and tpic spike then retraced back, so it’s just a waiting game for the announcement to come out.  I think it’s just being overlooked.", "score": 1, "replies": []}, {"body": "I just checked options flow and they’re dirt cheap. I’m loading up Jan calls before this thing pops. I already have a long position in the shares.", "score": 1, "replies": []}, {"body": "Sorry, dumb question. Who are RMG?", "score": 1, "replies": [{"body": "Rmg is a spac for romeo power tech a battery manufacturer", "score": 2, "replies": []}]}]}]}, {"body": "HYLIION", "score": 0, "replies": []}, {"body": "Keep buying nio and tsla.", "score": 0, "replies": []}, {"body": "NKLA", "score": -11, "replies": []}, {"body": "Just pick something with ev in its name, Evian, eve, Evan- doesn’t matter, they will all go up forever", "score": 1, "replies": []}, {"body": "Toyota and GM", "score": 1, "replies": []}, {"body": "NFYEF", "score": 1, "replies": []}, {"body": "Volkswagen. Not fancy but tangible", "score": 1, "replies": []}, {"body": "Brookfield Renewable Partners (BEP) and  TPI Composites (TPIC).", "score": 1, "replies": []}, {"body": "Fsr", "score": 1, "replies": []}, {"body": "Nobody talking about BYD.\n\nThis company is really closest to beeing a chinese Tesla, they do there own batteries and electronics but they also got cars and for me the biggest reasons are theire busses and trucks. They are all out since years and proven, expending production and sales every year.\n\nThey got years of experience in the heart of electronics (Shenzen) with doing all of this. \n\nLook at their Youtube, the garbage truck looks super efficient, busses already all over the world as market leader. This is going to grow even faster then EV sales imo, because these dont need a wide spread infrastructure (that is not here yet), just a small charging station at there normal depot/ parking place. And its also a way for politicians in green minded citys and region to do something against climate warming and toxic air.\n\nAlso they got good and cheap products and seem to have a great innovation and sience department.", "score": 2, "replies": [{"body": "How do you buy BYD outside of China? I've never figured this out.", "score": 1, "replies": [{"body": "In my european broker i can buy BYD CO. LTD on different ways. I can buy the CNE ticker (CNE100000296) or US one (US05606L1008). Maybe the US one is not really the company itself (like with many chinese stocks) but stock price will move the same.", "score": 1, "replies": []}]}, {"body": "US folks watchout : BYD Auto co  is the Chinese automaker with ticker BYDDF. You wont find this in Robinhood and other US brokerages (atleast as of Nov 2020)\n\nDon't get confused with Boyd Gaming with ticker BYD. This is a US based casino company established in 1975. This company is lucky because if the actual Chinese car stock rallies, people are also going to buy this casino stock due to confusion (similar to how the penny stock $ZOOM rallied because of the real $ZM Zoom video conferencing stock)", "score": 1, "replies": []}]}, {"body": "Why would you want to invest in something else if tesla is already the best investment option.", "score": 1, "replies": []}, {"body": "XPEV and Li?", "score": 1, "replies": []}]}
{"title": "GME - Let the games begin", "selftext": "I just wanna start off by saying, it's no coincidence that this news came yesterday - on CONSOLE RELEASE DAY which **also** happens to be the day when short interest data was to be released. That's what you call execution * *chef kiss*.*\n\nYes, this is only the beginning. The console cycle has just begun and GameStop is the largest retailer of games and consoles in the world, with over **5,500** stores worldwide in 14 countries [1]. This cycle will last (at least) 5 years, as all have previously. GME's pivot to e-commerce combined with an entry into the gaming equipment market will be the defining edge for GameStop.\n\nGameStop. The only place you *know* will have whatever gaming-related item you want - with same day delivery in many locations. This is where GameStop is headed. \n\nMost of you will already have heard the news from GameStop regarding \"Voluntary Early Redemption of Senior Notes\" [2]. For anyone that's unsure, this means that they are repaying debts equivalent to $125mn *voluntarily*; as in they are not *required* to pay that debt back right now. \n\nWe already knew that GameStop reported $700mn+ in cash so this reaffirms that GameStop are able to use the cash for deleveraging as opposed to them being *in a tight spot for cash*, so to speak, during the pandemic. This is great news for a brick-and-mortar store (since half of Reddit wants to keep calling it that) considering the sheer number of funds that are about to flow through GameStop (as they have been on pre-orders and will continue for YEARS). I'm no longer concerned about the next earnings as the cost-cutting by Management has been ridiculous. GameStop WILL beat ER expectations.\n\nThe news of a vaccine does not negatively impact GameStop or GME stock, in my opinion. People aren't going to game any less than they were before lockdowns, simply because lockdowns are (allegedly) going to go away soon. Before covid was a thing, the gaming industry was continuing to explode as it as has been year on year. It's not gonna slow down any time soon. Not now. Not when Sony and Microsoft just blessed us with the next generation of gaming consoles.\n\nAlso, short interest is down this time around but only by around 4 million shares. We still have about 66 million shares short. Any more big news and we'll be off 🚀🌚.\n\nTo recap: \n\n-Burry/Cohen still **in**\n\n\n-u/DeepFuckingValue still *IN* (big respects for 💎 hands)\n\n\n-institutions increasing their stakes in GME [3]\n\n\n-short interest still over 100% (insane, in itself. However, combined with the increase in institutional ownership, this adds to the \"battle for GME\" lore. Meme status increased⬆️)\n\n\n-new console cycle JUST started and it's going to last YEARS\n(GameStop bout to make bank and keep making bank)\n\n\n-debts have been reduced by $125mn\n\n\n-costs being reassessed and cut down regularly\n\n-stores with negative cash flow being shut down continually\n\n\n-MSFT deal\n\n\n-yada yada yada\n\n\n**REFERENCES/LINKS:**\n\n[1] http://news.gamestop.com/about-gamestop\n\n[2] http://news.gamestop.com/news-releases/news-release-details/gamestop-announces-voluntary-early-redemption-senior-notes\n\n[3] https://fintel.io/sob/us/gme\n\nSomeone asked for that *one* chart in another post. If you haven't seen it, **LOOK AT THE CHART**:\nhttps://www.reddit.com/r/wallstreetbets/comments/jjuo14/gmebout_to_see_history_repeat_itself/?utm_medium=android_app&utm_source=share\n\n**TL;DR** If you *still* think GameStop is going bust, idk for you fam. Quit while (you think) you're ahead. It may squeeze, it may not. But if you don't think it's gonna moon, think again.\n\nI wonder how many times I said GameStop in this post.\n\nPositions: GME shares\n\nDisclaimer: I'm not a financial advisor and this is NOT financial advice or a recommendation to trade any financial securities.", "id": "js2yyy", "created_utc": 1605075807.0, "score": 84, "upvote_ratio": 0.92, "num_comments": 87, "comments": [{"body": "I was already raped by this last month.\n\nI'm in.", "score": 75, "replies": [{"body": "Our time will come.", "score": 22, "replies": [{"body": "And when it does, so shall we.", "score": 32, "replies": []}]}, {"body": "As a boy, my dad once told me: 'after you've been raped, the second, third, fourth and fifth time don't matter. They're inconsequential. Whether you've been raped once or fifty times, you've been raped either way, and numbers don't change that'.\n\nJust grabbed 200 calls", "score": 11, "replies": [{"body": "Shit, sounds like your dad was speaking from experience. I'd suggest buying shares instead of calls tho, less risk involved✊", "score": 6, "replies": []}]}]}, {"body": "Burry doing our DD for us \nhttps://gyazo.com/d4f3ae5e850bc3e5c5d371286d7d6233", "score": 25, "replies": [{"body": "Where did you find this? Checked his twitter and it’s not there.", "score": 7, "replies": [{"body": "Pretty sure he deleted it. Popped up in my feed but kept getting errors when I looked at it.", "score": 8, "replies": [{"body": "The article and the tweet are real however.\n\nhttps://twitter.com/tomwarren/status/1325931389909397504?s=21\nhttps://www.theverge.com/2020/11/9/21557532/amazon-xbox-series-x-preorders-delayed-email", "score": 7, "replies": []}]}, {"body": "He deleted it. Sometimes he posts DD and deletes it", "score": 5, "replies": []}, {"body": "might be a dumb question but,...how do you know that account is actually him?", "score": 1, "replies": []}]}]}, {"body": " GME liquidated inventory last quarter without replenishment, which makes sense ahead of the new console cycle. However, it is clear that they will need to use cash in order to replace inventory with the newer products that are about to release.\n\nSo why would they redeem a huge chunk ($125M) so early? It is a crucial time for liquidity.\n\nThis only leads me to 3 possible conclusions, and I'd like to know if you think I am missing something.\n\nThey decided to redeem $125M in SPITE of the fact that they clearly need to use cash to replenish inventory ahead of the new console cycle.\n\nTherefore, management either 1) knows that that the current 3Q quarter will produce positive FCF, 2) extremely confident about 4Q numbers, or 3) are flaming idiots.\n\nWhile 3) is possible, I'd like to think 1) or 2) is more reasonable here.", "score": 28, "replies": [{"body": "Whilst 3 was probably possible under previous management, I don't believe it is under this team. Also, they have a LOT of cash. I don't think they need to pay upfront for new consoles and such. Payments are usually made on credit basis for stuff like this. GameStop make the sale, then pay their supplier once they receive the money. Plus they had over $700 million of cash so I don't think this redemption hurt their pockets as such.", "score": 15, "replies": [{"body": "Looks like the the notes restricted their ability to repurchase stock. If so, redeeming the $125m would allow them to better leverage their Revolving Credit which **does** permit **share repurchase** and **redemption of options**.\n\nInteresting that the redemption date is a few days after earnings...seems like this news is setting up the stage for something BIG!", "score": 5, "replies": []}]}, {"body": "The management already knows the 3Q quarter result. \n\nJustin Dopelara (DOMO Capital), who right now have 6 million shares, is saying that their QoQ online sales growth is probably flat, which is great, considering that the stores reopened.\n\nAlso, a consulting agency said today that last quarter was the best one for video games EVER.", "score": 1, "replies": []}]}, {"body": "GME gang 🚀😭", "score": 19, "replies": [{"body": "Let's gooo✊", "score": 9, "replies": []}]}, {"body": "And yet, here we are, watching the stock slowly drift back to flat and probably negative by the end of the day. Sigh.", "score": 10, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Yep. Shit is fucking tiresome. Something has to give at some point.", "score": 3, "replies": [{"body": "And it shall. Just when we least expect it. Just like this news of voluntarily paying back debts came out on *console release day*. It's a show of strength from GME as we go into the new console cycle. \n\n**PS** I heard that Amazon are saying some preorders won't arrive till December. Who does this benefit?", "score": 7, "replies": []}]}]}, {"body": "Yupp. Again and again a Boulevard of broken dreams.\n\nThankfully, i didn't buy at $15, though.", "score": 3, "replies": [{"body": "I'm in @11 which really makes me wish I had sold at the 52 week high a few weeks ago so I could have made a quick buck and sat on the sidelines to watch this staring contest since it ended up dropping back below my original cost basis.", "score": 3, "replies": [{"body": "Well that's the thing about staring contests. You can't just look away and *pretend* you didn't blink. You gotta maintain that eye contact. We need to wait this out and make them blink first. Hold the line.", "score": 5, "replies": []}]}]}]}, {"body": "Hoarding 1100 shares here. Fewer for those bitches to short.", "score": 9, "replies": [{"body": "Shares are where it's at.", "score": 9, "replies": []}]}, {"body": "Keep the GME porn coming pls", "score": 26, "replies": []}, {"body": "I have no knowledge of GameStop but for some reason I trust you 100%. I’m in", "score": 7, "replies": [{"body": "Wow, that's crazy. I guess I should say thank you but I should warn you. I'm retarded.", "score": 7, "replies": []}]}, {"body": "Wo your saying I should by 3500 shares?", "score": 6, "replies": [{"body": "As my father says: \"listen to everyone but do only as YOU wish\".\n\nBut yes, let's gooo", "score": 5, "replies": []}]}, {"body": "BULLISH AF - Seems like someone is wanting to either buy shares or get paid HUGELY. Who would want to buy 7 million of there own shares back ....\n\n20,000 (or 2 million shares) DEC 17p\n\n50,000 (or 5 million shares) July 15p", "score": 7, "replies": []}, {"body": "Fuck it I’m in", "score": 12, "replies": [{"body": "That's what I'm talking about let's gooo", "score": 9, "replies": []}]}, {"body": "A M E N brothers and sisters, to walhalla it must be", "score": 9, "replies": [{"body": "Walhalla is a little mountain town in SC.", "score": 5, "replies": [{"body": "Good trout fishing around there", "score": 3, "replies": [{"body": "I've got family that runs some airbnbs on the river in mt rest.  Love wetting a line up there.", "score": 2, "replies": []}]}, {"body": "Ha ! Mountain we wants :)", "score": 3, "replies": []}]}]}, {"body": "GME/GameStop was said 24 times in this post(including title and links)brother, $24 strike price calls it is 💰💰💎💎", "score": 9, "replies": [{"body": "The most solid DD done on gme.  You sonofabitch. IM IN!", "score": 4, "replies": []}, {"body": "This is the way✊", "score": 1, "replies": []}]}, {"body": "GME GameStop is good great and going to go up", "score": 5, "replies": []}, {"body": "Yes sir! This is the good news I needed to see today. $17k deep in shares and calls", "score": 3, "replies": []}, {"body": "What calls you got brotha?", "score": 9, "replies": [{"body": "Only shares brother. I don't understand options well enough so it would pretty much equate to gambling for me. I don't gamble.", "score": 30, "replies": [{"body": "Yes brother. May it serve you well", "score": 14, "replies": []}]}]}, {"body": "May the prophet speak out of you, Brother.", "score": 11, "replies": [{"body": "I am merely a servant.", "score": 10, "replies": []}]}, {"body": "I did some research:\n\nWent to 2 EB games stores and they’re all sold out of PS5 preorders, expecting to sell 300 on release day. Furthermore Canada is all out of PS5 and XBOX. \n\nUsing conservative numbers, $499 is the price of the PS5 multiply by 500 stores is roughly $748m in cash on PS5 release date. I don’t have the numbers for XBOX but I’m gonna assume $390m to be conservative. \n\nThis is roughly $1.1b cash that they’ll have on their books for November. \n\nI also did some research on the klarna partnership and this is something that everyone is missing. \n\nKlarna is a company like PayPal but it’s much easier to pay with, and much easier to buy in bulk. Apparently it’s also 3 month of no interest. \n\nKlarna’S institutional backers include sequoia capital and silver lake, which also backed Unity Software. Currently 9million active users and remember even if the economy is bad, people are willing to buy video games on credit. This to me is GameStop trying to change their business model to allow for multiple purchases from their consumers which will increase the dollar value per costumer. Using myself for example, I usually will buy 1 game every few months. But if I see a limited edition nendoroid (cuz funkos are the poor man’s version) I would snatch it up a long side my game using credit because why the  fuck not? No interest for 3 months. \n\nSource: I asked GameStop employees and did some light DD on klarna when I was doing DD on unity software.", "score": 9, "replies": [{"body": "Klarna is not easier than paypal, and you would never have suggested that if you’d ever used klarna lol\n\nThey gave me a decent promo to use it once, and so I did. Couldn’t uninstall the app fast enough when I was done.", "score": 5, "replies": [{"body": "Thanks. I only saw a demo. I’ll have to try it myself once.", "score": 1, "replies": []}]}, {"body": "I’m drooling just reading these numbers.", "score": 3, "replies": []}]}, {"body": "There is anyway to call all the short positions? Like a votation or something? At this point I think they maybe using naked calls or something. What do you think?", "score": 3, "replies": [{"body": "I have no idea about that to be perfectly honest with you.", "score": 2, "replies": []}]}, {"body": "Been holding steady on my 2700 shares, bought at $6.11.  Would love to see this company turn it around. They have a lot of tailwinds for sure.", "score": 3, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}, {"body": "went to go pick up the new xbox and my local gamestop and they only had 5 there. so i didn’t get it.", "score": -2, "replies": []}, {"body": "if the economy tanks, consumer spending will tank too, we are heading into a dark winter", "score": -6, "replies": [{"body": "And you think we *aren't* gonna be sitting on our asses playing the latest COD, Destiny, or some shit during this dark winter you speak of?", "score": 25, "replies": [{"body": "Consoles should shift more towards multitasking to take on pc market, with current hardwares inside the consoles, people should be able to to use it for both gaming and some office works. Rumors are Xbox Series X will launch a windows mode. I still think a contraction in customer spending on expensive electronic will kick in once the fallout from pandemic hits the globe. I’m guessing Q3-Q4 next year will be bad, we should get a clearer idea by next summer. That’s why they should grab market share from other sectors especially with such capable devices", "score": -5, "replies": [{"body": "If gaming consoles were about task performance other than gaming, people would just buy gaming PC and use controllers and still have a keyboard for office type work. It's not like a console with these capabilities is going to provide any sort of portability at this stage (you're not gonna carry a screen around with you even if you carried the console around in the car or something). Gaming consoles are for gaming. Being able to use Netflix, YouTube and such is a bonus.", "score": 9, "replies": []}]}]}]}, {"body": "Take away the “M” and then go balls deep in calls", "score": -3, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Nah, you went to look for an item that's HARD to come by brand new these days. However, if you ordered online you probably would've found one.", "score": 7, "replies": [{"body": "Agreed.  I went to Walmart to find a new ps4 controller a couple months ago,  and they were out of stock.", "score": 6, "replies": [{"body": "Come to think of it, I almost bought 2 \"brand new ORIGINAL\" PS4 controllers from eBay a while back. I've mentioned in previous posts that I picked up a LOT of PS4 games recently as there are still titles I haven't had a chance to play. I wanted to buy 2 more controllers so my housemates could have a controller each. Well, they turned out to be fake so I didn't buy them. I couldn't find brand new original ones anywhere that I could trust, so I just didn't end up buying any. This was just a couple of months ago.", "score": 5, "replies": []}]}]}]}, {"body": "[deleted]", "score": -10, "replies": [{"body": "Did you just call me a fucking weeb lol", "score": 8, "replies": []}]}, {"body": "Only 700 mill left with so many stores? Wow that baby is a cash burner.", "score": -9, "replies": [{"body": "That baby is also a cash bringer, consoles ain't cheap and GameStop are selling a shit ton of them.", "score": 9, "replies": [{"body": "They have been selling them for a decade. So what. They used to have billions in their cash pile, now you’re saying it’s close to 700mil and 5.5k stores worldwide. This is going to be a cold winter for gay stop.", "score": -6, "replies": [{"body": "I don't know if you know, but the stores that were cash flow negative have been getting shut down real quick. They're only keeping stores open which are actually making money. Plus new console cycle JUST started during the fastest growing gaming industry we've had til date. Also, physical games are NOT out. People aren't even done with old consoles and demand is HIGHLY in favour for physical-game consoles when it comes to the new consoles. Watch their cash go up quarter-on-quarter.", "score": 8, "replies": [{"body": "I haven’t bought a physical game in like ages. As a gift sure, but everything is digital these days. Priced in & limited upside for GME with abysmal risk on the downside.", "score": -8, "replies": [{"body": "Fair enough man. I don't believe that we should use your anecdote as a metric for market sentiment because I've also never bought a digital game in my life. Always physical copies and I LOVE to keep them pristine. If I ever need cash and I can part with my games then I can sell them too. Can you do that with your 1s and 0s?", "score": 8, "replies": [{"body": "Keep on keeping on. I keep PS1 CDs and some PC games that were released on three CDs back in 2000 — all going to the trash bin or garage. If you like collecting dust, great. There are collectors but imo most games are, you play them once you never touch those CDs again. Not to mention that you have to insert the CD into your PS. Bro why? To sell them back for $5 to GameStop, meh.", "score": 0, "replies": [{"body": "I don't see how having to insert a CD into the PS is an issue. The ONLY benefit of digital copies are that you don't have to physically go and get one, and yeah I suppose that you don't have to insert the CD into the PS. Other than than, physical games win any day.", "score": 6, "replies": [{"body": "It's an issue. I don't like moving my ass to swap CDs. It's annoying, I just want to fire up my PS & start playing without waiting for the CD to spin out in the drive & crazy noise it makes.\n\nI don't want to have it because it collects the dust on my shelves & carry that garbage through my entire life.\n\nHow do physical CDs win it anyday? Because you can trade them for $5 at GameStop? Giving games to your neighbors? Sure, but who does that these days? Sure these are benefits, but when the game is out, everyone buys their own copy. Do you think I am gonna wait when a friend of mine finishes Cyberpunk? No way & I am getting my own copy.\n\nBesides, when the game is available right there on the internet, no need to go to GameStop, spend a fucking hour in the street with 'rona raging in the wild to get a box & it's really a FOMO moment you just buy it right on the spot.\n\nThe reason why big boys share profits with GameStop is, in my opinion, because big boys benefit more from that deal more than GameStop. Do you think they would just give a nice cut to GameStop just because they sell their consoles?\n\nBro. Every single retail store sells consoles and CDs these days. The CD section in particular looks sad, with games wrapped in plastic & not a single kid around those shelves. Big boys will share some profits with GameStop until physical is phased out & then just ditch them.\n\nEnough profit sharing to keep GameStop afloat for another year or two before they inevitably decline into bankruptcy or become a zombie company like Kodak.\n\nEven YoY stats on net sales by GameStop points at significant decline. [https://www.statista.com/statistics/284532/net-sales-of-gamestop-worldwide-2010-2012-by-region/](https://www.statista.com/statistics/284532/net-sales-of-gamestop-worldwide-2010-2012-by-region/)\n\nYet the new console cycle begins & all retards are jumping on GME after it literally went 150% up.\n\nI have always sold calls on GME & always bought puts. It never disappointed me. I have stopped touching it after it went down to \\~$3 and I have been trying to fill 4.5p and 5p expiring next year for a while now, spreads are too wide. I think it's inevitably going back down but even if it doesn't, puts are really cheap because GME sits so high now, so no regrets even if they expire worthless.", "score": -1, "replies": [{"body": "So you...\n\n- are too lazy to get up to put the CD in your console\n\n- are annoyed by the *crazy* sounds the optical drive makes\n\n- assume that people are generally okay with their purchased \"item\" retaining no value whatsoever, even if it's a mere $5\n\n- think everyone, like you, can just go out and buy whatever they want, whenever they want\n\n- think that most people have the internet capabilities to download games rapidly and would find it more convenient than spending an hour picking up a game\n\n- probably haven't heard that Amazon are having troubles getting preorders out to some customers and won't be able to until December\n\n- are going off of Y-o-Y \"stats\" and placing no value on anything that's happening being the scenes or the fact that GameStop will be one of *the* biggest beneficiaries of this gaming cycle at the very least, which will last 5 years at the very least\n\n\nI don't think you're assessing GME fairly. You said it yourself, you only sell calls and but puts on GME. I think you are letting your bias get in the way of this one. It's not too late. Buy shares ;)", "score": 3, "replies": [{"body": "Fuck you with that nonsense. I am not buying shares of that dumpster fire. I gave you the link with the stats and you didn’t even bother to look at the sales numbers. \n\nYou think that Stone Age blockbuster retailer is making a come back, buy shares and diamond hand it. Why you looking for confirmation bias and attacking me with “you are lazy” arguments. This is stupid, I play games for 30 years, I know what is convenient and what’s not.", "score": -1, "replies": [{"body": "Lol in your own words, you don't like to move you ass to swap CDs. That's clearly what I was referring to.\n\nAnd congratulations. Maybe you do know better. Maybe you don't. That's what we're all trying to find out here, right? So I guess we'll see 🙃", "score": 2, "replies": []}]}]}, {"body": "I’ll give it to you, I went to some EB games today and did not see a line up. I asked the employees and they said that a big chunk of their customers order online and pick up their items from the store. Most of the traffic happened in the morning and died down during evening when most wagies like me get off work. \n\nStore sales have also increased for merchandise aside from games; such as gaming peripherals and figurines. \n\nBack in 2017, I spoke with a hardcore employee and questioned why they were selling other stuff than games. In 2020, I can see why now with the closure of Toys R us and slow death of over nerdy / hobby stores and Eb games slowly filling that hole in the past few years. \n\nFyi EB games is the GameStop’s operation in Canada.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Well it is cyclical. So they had billions, now they’re under one billion. It happens every cycle that they struggle and have to cut costs.", "score": 3, "replies": [{"body": "Only this cycle, they're becoming something completely different to what they were during the previous cycle.", "score": 1, "replies": []}, {"body": "Sure, fine. So that run up from $3 to $11 must have priced in everything. Why more upside and how much more?", "score": 1, "replies": [{"body": "Why was it not \"priced in\" at the previous console cycle? Why did it continue to rise after release and stayed at very elevated levels for more than a year afterwards? Why is it that, just like previous console cycles, the stock at sitting at the same level it would be at this stage in the cycle (i.e. the beginning)? What makes you think it's gonna be *worse off* this time around, when GameStop is in the execution stage of a massive turnaround and pivot to e-commerce?\n\nThe truth is you can't answer these questions and still be so certain that GME is going to fail. Not if you're being honest with yourself, anyway. \n\nYou've been presenting straw man arguments, claiming market sentiment is negative for GME solely on the basis of your own personal opinions and preferences with gaming, and rejecting any possibility that the stock will continue to perform in the near future. I don't think you're ready to have a logical argument about GME because of your own biases. If you were, you would already know *why* there is a great upside potential and *how much*.", "score": 1, "replies": [{"body": "Yes, I have 30 years of experience playing games since zx spectrum. I gave you arguments of someone who spent a big chunk of their life playing games. \n\nShit is going digital. It’s easy. I have seen it all from cassette tapes to disk less. \n\nYou can invest in oil, because oil is not going anywhere in the next decade or you can invest in green energy. I prefer to invest in things that have more upside than downside. GME is the latter on my spectrum. Times change. \n\nPivot to e-commerce is so 2005. Dinosaur company with retard marketer arguments. Come on. What is it? Amazon is doing e-commerce for decades and you keep talking about it like a turning point while it has been at the core of many successful companies for ages.\n\nI don’t claim market sentiment, I claim my sentiment and that I wouldn’t put my money in this and that I think that smart money bought this long ago. \n\nYou can’t accept my argument because you’re biased, possibly have a position underwater and hoping that it will eventually pan out. \n\nAll I am telling you that the risk reward is garbage for the reason I had outlined in the prior comments.", "score": 1, "replies": [{"body": "You have valid points don’t get me wrong. I don’t think it’s certain they find wild success in their transition, even though new management has shown impressive results so far. If it turns out to be meh in the long run, I’d agree we’re nearly priced in approaching $20. But you’re blind if you can’t see the upside in this IF they manage to pull it off. They aren’t ‘competing’ with Amazon any more than WMT+ is. Amazon doesn’t make any attempt to appeal to the niche other than raw selection. Though it remains to be seen whether even same-day pickup will be attractive.\n\nAs for the short squeeze, and I don’t know about all that, I believe the thesis was it just needs to not fail.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}
