{"title": "Dear amazon", "selftext": "Fuck you, you little fucking pussy stock. Piece of shit work factories and overrated delivery \n\n\n\n\n\nLike what the actual fuck who beats earnings and shits the bed this bad", "id": "jmto48", "created_utc": 1604343169.0, "score": 301, "upvote_ratio": 0.93, "num_comments": 86, "comments": [{"body": "You must be new to this :/. Earnings beat doesn’t mean anything the past 8 months..", "score": 137, "replies": [{"body": "Not sure what you’re on about, beating earnings is as good as taking a bullet to stock price this year", "score": 33, "replies": [{"body": "Conclusion - All meme stock goes up after earnings (SNAP, NIO).  Others takes hit...", "score": 8, "replies": []}]}, {"body": "Earnings beat didn’t mean shit ever. Not just in the past 8 months.", "score": 23, "replies": [{"body": "Shut up idiot", "score": -9, "replies": [{"body": "Did u lose a few bucks on amzn too?", "score": 8, "replies": []}, {"body": "Is someone having a temper tantrum", "score": 1, "replies": []}]}]}, {"body": "Earnings mattered for $SNAP...", "score": 3, "replies": []}, {"body": "I knew that before hand honestly, just thought this time would be... different.. 😔", "score": -1, "replies": [{"body": "The battle cry of WSB...", "score": 10, "replies": []}, {"body": "Your ex also, just thought this time would be... different..", "score": 11, "replies": [{"body": "You don’t know how accurate that is lmaoooooo", "score": 21, "replies": []}]}]}]}, {"body": "Stfu and buy the dip pussy", "score": 84, "replies": [{"body": "I bought the dip and guess what happened my boy. The tale of old times..", "score": 42, "replies": [{"body": "The dip that kept on dipping", "score": 60, "replies": [{"body": "Thatta boy", "score": 24, "replies": [{"body": "Story of my life. Sell the dip then buy back right before it dips again and not have the balls to sell again", "score": 1, "replies": []}, {"body": "Theta boy", "score": 1, "replies": []}]}]}, {"body": "Look, when you take a chip, just take one dip and END IT!", "score": 3, "replies": []}, {"body": "https://youtu.be/c_tjqWwGjUw", "score": 2, "replies": [{"body": "Thank you for that", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You can buy fractionals tbh", "score": 2, "replies": []}]}, {"body": "Saved my call spread today by rolling it down at today's dip. still gonna print 11/6  \n\n\n3000/3005 C bought when it was at 2960. already back green", "score": 1, "replies": []}, {"body": "Were you trying to say the tale as old as time you fucking idiot?", "score": 1, "replies": [{"body": "You’re late to the party and no one cares, get fucked", "score": 2, "replies": []}]}]}]}, {"body": "Welcomes to earnings, where only the lube is priced in.", "score": 12, "replies": []}, {"body": "Amazon’s prediction of next quarter profit being affected by the cost of Covid and extra staff is the reason.\n\n\nI believe it will pay off in spades going into Xmas and next quarter will be better than anyone anticipates.\n\nAmazon has created a runway for near future that will be used atleast until the vaccine is there. They are well prepared and then some more.\n\nThere is no escaping some companies. Amazon is one of them. Every analyst estimate out there is 3500+ .\n\nThese prices will not be there for long and once gone, they will stay gone.", "score": 12, "replies": []}, {"body": "I feel this pain", "score": 9, "replies": []}, {"body": "...UPS", "score": 7, "replies": []}, {"body": "Ups does", "score": 7, "replies": [{"body": "Lost 100% of my money on UPS calls.", "score": 2, "replies": []}]}, {"body": "Fuck amd bishhh ass Lisa Su with that horrible clitx buyout", "score": 13, "replies": [{"body": "xilinx buyout bullish as fuck. Intel's over there in the corner selling off fabs and industry arms, AMD is buying big players.", "score": 4, "replies": [{"body": "TSM> NVDA > AMD", "score": 1, "replies": []}]}]}, {"body": "I feel you, I lost some money to amd as well....", "score": 6, "replies": []}, {"body": "Better opportunity to buy more for the year end rally. I lost quite a bit but dont give up.", "score": 4, "replies": [{"body": "Yeah I know", "score": 4, "replies": []}]}, {"body": "Show me on the doll where Amazon calls touched you", "score": 4, "replies": []}, {"body": "Just buy the dip retard. Its on sale this week", "score": 3, "replies": []}, {"body": "What companies positive earnings made the stock value go up since late March?  I thought everyone sells pre-earnings to take profit.  Think of earnings as the stonks version of \"do deliveries\" of this sub.", "score": 3, "replies": [{"body": "Zm snap pins logi aapl ericcson crm \n\nLots", "score": 4, "replies": []}, {"body": "I KNOW I thought it would be different this time", "score": 2, "replies": [{"body": "Well, there's always next time!", "score": 1, "replies": []}]}]}, {"body": "This is why I only play ITM leaps when buying options, OTM plays are for theta gang", "score": 3, "replies": [{"body": "And then what happens when your shit falls way OTM", "score": 4, "replies": [{"body": "Buy more", "score": 1, "replies": []}]}, {"body": "You play weeklys?", "score": 2, "replies": [{"body": "I’ll sell credit spreads on weeklies with 1% of portfolio tops if things seem overextended one way or another", "score": 2, "replies": []}]}]}, {"body": "microsoft :(", "score": 3, "replies": []}, {"body": "I freaking feel your pain dude", "score": 3, "replies": []}, {"body": "Who knew that going into Prime Day and earnings I should have shorted the most successful company during this pandemic. 🤷🏾‍♂️   \n   \nI sold 3050/3000 puts back when Amazon was at 3300. Guess that'll teach my dumb ass to be bullish when things are supposed to be on the up and up.", "score": 3, "replies": []}, {"body": "Shut up and post some loss porn.", "score": 8, "replies": [{"body": "Waiting for it to get over $10k, just wait on it.", "score": 8, "replies": []}, {"body": "lol", "score": 1, "replies": []}]}, {"body": "I want it lower...keep tanking. Cash on hand", "score": 7, "replies": [{"body": "STOP", "score": 13, "replies": []}]}, {"body": "This fucked me too weekly gains gone ...that fucking market watch article fucked everybody every company is hurt by covid 5 billion cost yearly is chump change for Amazon", "score": 2, "replies": []}, {"body": ">who beats earnings and shits the bed this bad\n\nLike AAPL ?", "score": 2, "replies": []}, {"body": "Check my post history :( lost some more on it too.", "score": 2, "replies": []}, {"body": "Something that’s overvalued by $1000 a share", "score": 9, "replies": [{"body": "You’re overvalued, keep that same energy come Christmas Amazon $3500c 1/21", "score": 23, "replies": [{"body": "Please, don't.", "score": 6, "replies": [{"body": "I’m down 10k and a child, I got nothing to lose", "score": 13, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Doctor said I just needed 1", "score": 4, "replies": []}, {"body": "You could do a partial liver as well.  Only internal organ that regenerates.", "score": 2, "replies": [{"body": "So I can sell my liver on the black market multiple times? I'm seeing multiple yolos with no ability to lose money.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Bitch ass stock gave me late delivery too", "score": 2, "replies": []}, {"body": "I’ll start buying when Amazon is less than $2500.", "score": 2, "replies": [{"body": "Well I hope that’s never.", "score": 13, "replies": []}, {"body": "I saw another post that except two times, market has always closed green before the election.\n\nThe lowest Amazon will ever go will be until then.", "score": 2, "replies": []}, {"body": "Thats a severe market crash", "score": 2, "replies": []}]}, {"body": "fuck ATVI as well", "score": 1, "replies": []}, {"body": "Bro the shit’s overvalued and correcting. It’ll be a good buy back around $2500", "score": 0, "replies": []}, {"body": "[Buy the rumor, sell the news.](https://www.investopedia.com/ask/answers/06/stockdeclinegoodnews.asp)", "score": 1, "replies": []}, {"body": "News flash bitch. The market doesn't give a flying fuck about your feelings", "score": 1, "replies": []}, {"body": "Something something something sector rotation something", "score": 1, "replies": []}, {"body": "It's because some guy published an article saying it's time to take profit on tech stocks *AFTER* tech fell 10%\n\nhttps://www.marketwatch.com/story/its-time-to-take-your-profits-from-tech-stocks-jp-morgan-says-11604348246?mod=home-page", "score": 1, "replies": []}, {"body": "I love it when every idiot be like “but they beat earnings!”.\n\nDid you ever wonder how the red fucking candles just drop? Do you think it’s humans placing these orders?\n\nNo, my dear retard, they are not. They are algorithms, and algorithms know what they are looking for. If earnings feel amazing to you, and algos *still* defermine it’s sell-time, can you imagine just how much more of absolutely insane growth was already priced in? I know you can’t, because you’re an idiot, but I’m saying it anyway. \n\nAlso, god knows what other circumstances algos consider when they’re selling? Connections you couldn’t even comprehend in that tiny brain. \n\nBottom line - don’t try to make sense of the earnings, unless you’re deeply familiar with the valuation and expectations and have a shit-ton of context. Algos are gonna just rip you apart.", "score": 1, "replies": [{"body": "you mean just like NKLA is trading still at a healthy 18 dollars a share?", "score": 1, "replies": [{"body": "I guess the point to take home is - not everything in the marker makes sense.... to you. Obviously it makes sense to many other players. I have no idea what’s behind $18 NKLA.", "score": 1, "replies": []}]}]}, {"body": "Ups is in the same boat", "score": 1, "replies": []}, {"body": "Selling AMZN put $2900 December expiry tomorrow. Same with aapl at $95. These boys are covid bulletproof. Come at me wuhan", "score": 1, "replies": []}, {"body": "I look upon this sub like Zeus from mount Olympus.  I purchased a single share of AMZN in November of last year at $1734, sat on it checking once every few weeks completely ignoring it in a Schwab account. look upon my works in terror, for I have made 1.2k in a year", "score": 1, "replies": []}, {"body": "\"I bought a stock that is already up like 60% year to date, not understanding that positive earnings have already been speculated on and factored into the price.\"", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "jmumbj", "created_utc": 1604346256.0, "score": 68, "upvote_ratio": 0.88, "num_comments": 80, "comments": [{"body": "He said spreads. Not naked puts.", "score": 51, "replies": [{"body": "Okay what’s the spread, layman’s version", "score": 5, "replies": [{"body": "Instead of just selling a 185 put on tdoc, I sell a 185 put and buy a 180 put at the same time, for the same expiration. Because it's only $5 wide, it only uses $500 of my buying power. As long as TDOC closes above 185 by expiration, I make max profit. If TDOC is below 185, then I can roll out the position to a later date, and receive more premium to do it.\n\nEdit: every position I posted is already profitable right now, one day later", "score": 26, "replies": [{"body": "This guy fucks *edit* only waving girls apparently. To each their own I guess.", "score": 4, "replies": [{"body": "🙋‍♀️girl", "score": 6, "replies": []}]}, {"body": "> If TDOC is below 185, then I can roll out the position to a later date\n\nunless you get fucked by early assignment", "score": 0, "replies": []}, {"body": "Hey how exactly do you roll a put spread? Do you buy + sell to close positions or how exactly does that work", "score": 1, "replies": [{"body": "Pretty much, yeah.  Buy to close, then sell another further out and further down (if talking selling puts)", "score": 1, "replies": []}]}, {"body": "Does anyone know if RH would also only consider this $500 buying power?", "score": 1, "replies": [{"body": "Ya I trade spreads and thankfully robinhood recognizes this. What retarded robinhood doesn't recognize is that if the options expire you can cover the max loss, so they automatically try to close your spread on expiration day. You can lose a few dollars here which isn't much but adds up over time", "score": 3, "replies": []}]}, {"body": "Are there any decent in depth discussions on this?", "score": 1, "replies": []}, {"body": "How do you roll out the position to later dates? What would that look like in actual terms?", "score": 1, "replies": []}, {"body": "what do you think about long calls expiring next week?", "score": 1, "replies": [{"body": "Short call spreads, maybe. I wouldn’t buy calls after days of green", "score": 1, "replies": []}]}]}, {"body": "Spread is when you make $1 but you can only lose $5. It’s when you hate losses but you hate gains even more", "score": 45, "replies": []}, {"body": "Google", "score": -6, "replies": []}, {"body": "idk I'm not a bottom", "score": 1, "replies": []}]}, {"body": "Robinhood doesn't allow selling naked puts duh", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "What if you need a physical?", "score": 2, "replies": [{"body": "You hold your balls, cough, and tell the doctor how it felt.", "score": 17, "replies": []}, {"body": "They send a 🌈🐻 from here, as they have extensive ball fondling, balls-on-chin and cock handling experience. Plus, they need the money.", "score": 5, "replies": []}]}, {"body": "I thought Teladoc only have nurses and can’t prescribe medicine.  Has it changed?", "score": 1, "replies": [{"body": "Yes, you can talk to a doc and get your script filled.  They won't do controlled stuff like painkillers or muscle relaxers, but they do the other stuff.", "score": 3, "replies": []}]}]}, {"body": "Thanks for taking the time.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "It expires on a Friday, so wait until Friday of expiration to decide if you’re closing or rolling. I always set mine to close for .1 so if at anytime it moons, it just auto closes for me. That also keeps freeing up my buying power for me. Or close early if you hit 50% profit before expiration", "score": 2, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/keepitswolsome don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "Buy puts. Got it", "score": 3, "replies": []}, {"body": "Be careful of W. They are valued on growth despite standing on a very precarious and expensive international supply chain. A 5% loss of efficiency in their next earnings report would send the company to $70 faster than a covid vaccine would do to Zoom.", "score": 1, "replies": []}, {"body": "These idiots don’t understand... they see big money posts in the buying and think they are Gordon’s Gecko and when they blow their college loans, and grandmas birthday money, they come here and blame the internet.", "score": 2, "replies": []}, {"body": "can you do a weekly post?", "score": 2, "replies": []}, {"body": "Don’t do it man. You’re dumb mofo thinking TA matters against black swan red wave tsunami coming your way ahead of elections day. It may happen or may not but will most certainly cost you a fortune if you’re on the wrong side of it. \n\nLet me tell you a fairy tale. One day Apple goes below 105, and it doesn’t stay there long, it goes back up to 110 before heading to 95, then 85 etc shit happens. You eat shit and hate yourself for ages just like a horde of bulls that bought Apple pre-split. They still eat shit.", "score": 1, "replies": [{"body": "You can still exit the trade. You don't go all the fuck in", "score": 2, "replies": []}]}, {"body": "Stopped reading as soon as you said BA has “solid fundamentals”", "score": 1, "replies": [{"body": "Stopped reading as soon as he said sell", "score": 2, "replies": [{"body": "Stopped reading in general", "score": 2, "replies": []}]}, {"body": "You would have closed out all these trades early already for close to 100% profit; especially BA. It doesn’t matter how the company is ran, they have a monopoly on building aircrafts and hold large military contracts. No one can casually break into the plane manufacturing sector to edge BA out.", "score": 1, "replies": [{"body": "Yeah I blew it by selling my BA shares last week. You are correct, you win, I hate myself.", "score": 2, "replies": [{"body": "I’m sorry :( I’ll post again when there’s another day like that one where there’s obvious great entry. They’ll be one soon, IMHO another weekish we’ll have a blood red day where everyone will be all doom and gloom and that’s the best time to sell puts and buy calls", "score": 2, "replies": [{"body": "I’ll be following, thank you for your service", "score": 2, "replies": []}]}]}]}]}, {"body": "How does selling puts work in layman’s terms, you are obligated to sell them and put up cash?", "score": 1, "replies": [{"body": "You pick the strike and expiration. You put up cash to make the purchase. If the stock closes below your strike price at expiration you will have to buy the stock. If it closes above then you do not buy the stock. Either way you keep the premium", "score": 9, "replies": [{"body": "So if I buy one contact to sell apple puts I am obligated to buy them if they’re below the strike price ?", "score": 0, "replies": [{"body": "Eh... If u sell a put contract (100 shares)....\n\nOn the expiration date of that contract, if the stock closes below the strike price you choose...you will be assigned the contract. You keep the premium. So... You buy the stock at discount...\n\nIf it plunges 30% ur fucked(unless the premium u got paid offsets this loss, which I doubt)... If it goes up 30% you only get to keep the premium bc it's not ur stock. So you have a maximum profit...but technically an unlimited risk of the stock plummets to $0\n\nSelling puts is recommended if you plan to purchase a stock anyway...", "score": 7, "replies": [{"body": "Not unlimited loss potential!", "score": 4, "replies": [{"body": "Uh yeh...if a stock goes bankrupt...u lose it all", "score": 1, "replies": [{"body": "If it goes bankrupt you have to buy them for the strike and then the stock itself is worthless so that's money down the drain but technically the loss is limited to the strike price x100. A naked call, that one can go to infinite if the stock goes to infinity", "score": 2, "replies": [{"body": "Yah correct...I mean God damn, I wasn't talking about him losing the fucking house and kids and cars lol...", "score": 1, "replies": []}]}, {"body": "That’s not what unlimited loss is. Unlimited loss is ONLY on calls as a stock can theoretically go to infinity but a stock cannot go below zero. Look it up if you have any doubts. Max loss is equal to current price  of stock x 100 - premium", "score": 2, "replies": [{"body": "Right right we get it lol...unlimited isn't the correct term!", "score": 1, "replies": [{"body": "Lol I hadn't nerded out in a while, thanks for being cool about it.", "score": 1, "replies": []}]}]}, {"body": "If a good company like AAPL goes to 0 we're all eating rocks anyway", "score": 1, "replies": [{"body": "Big facts!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You keep the difference...if there is one lol! So yes you can buy it back...but if the stock has gone down, you'll lose money...if it went up you'll keep some", "score": 2, "replies": [{"body": "Interesting, thank you", "score": 1, "replies": [{"body": "Think about it like...a candy bar... \n\nI sell u a candy bar for $5, u keep it a month...\n\nBut then I want it back...but now it's worth $6\n\nSo I buy it back..I lost a dollar...\n\nBut...if it would have been worth $4... I made a dollar", "score": 2, "replies": []}]}]}]}]}, {"body": "Selling puts is probably the safest way of playing options (beyond extreme forms of autism here wanting to prove it wrong). Do 45 day+ out collect that time decay and deuce out.", "score": 2, "replies": [{"body": "But what about the collateral they ask for?", "score": 1, "replies": [{"body": "It’s held as option collateral I write puts on my margin account so I don’t need the cash on hand but leverage my other positions to write the put and collect premium.", "score": 1, "replies": [{"body": "I need to use my SCHWAB trading account for margin then. Thanks for the assist.", "score": 1, "replies": []}, {"body": "yall big boy plays, i ain't got the balls to play with margin, i just use cash to cover lol", "score": 1, "replies": []}]}]}]}]}, {"body": "W and FSLY no good for this\n\nErrything else fine tho", "score": 1, "replies": [{"body": "They all were closed for 100% profit", "score": 1, "replies": [{"body": "Hell yeah. I hate selling puts on hot stocks that I don't like the fundamentals of, but I absolutely can't deny there's great money in it.", "score": 1, "replies": []}]}]}, {"body": "put spreads don't really take advantage of high IV the way CSPs do. they are more directional plays unless your strikes are quite wide", "score": 0, "replies": [{"body": "If the stock drops, you can close your long for a profit and then your short becomes a CSP", "score": 2, "replies": []}, {"body": "Not the same way, but they do take advantage of it", "score": 1, "replies": []}]}, {"body": "Lol on Boeing having solid fundamentals. If you’re so sure about that, you better bet your whole life savings on it.", "score": 0, "replies": [{"body": "Biggest worry about Boeing is that their such a terribly run company that if the gov ever moves any contracts they’re gonna tank", "score": 1, "replies": []}]}, {"body": "Spreads? What is that?", "score": 0, "replies": []}, {"body": "imagine loving charts and still being bullish right now", "score": 0, "replies": []}, {"body": "\"not the be retarded\"\n\nAll I needed to know here.", "score": 0, "replies": []}, {"body": "Instructions unclear - sold naked calls.", "score": 0, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yes, you are selling the puts.. you think it will go up when you sell puts", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "When you roll you play around with the strikes and dates until you're rolling for more premium. I only roll for a credit.", "score": 2, "replies": []}, {"body": "I think I understand your question. Rolling is just closing out a position and reopening it for a later date. You also might get more premium or less depending on how you play the strike price. \n\nThat’s the general concept but on TOS you can actually click roll which will execute the two moves in one for you. If you roll for a credit you don’t need any buying power which is a huge advantage if you are over leveraged", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Which broker are you with right now?", "score": 1, "replies": [{"body": "Lol", "score": 2, "replies": []}]}]}]}]}, {"body": "I made a rule to not sell calls or puts because I don't fully understand it yet.  But...how confident are you in your TDOC play?", "score": 1, "replies": [{"body": "Like 98%. 100% go for it, because if it drops then you can roll. It has a lot of support in the 180s it won’t pass both strikes", "score": 2, "replies": []}]}, {"body": "I had LVGO that just turned into some TDOC + cash.. Not familiar with TDOC charts yet but I hear from a friend who used their services that they suck. I was excited by LVGO cause seemed like a decent service with great potential.\n\nI may hold TDOC for a while, maybe fill a lot and sell covered calls until it's dumped", "score": 1, "replies": []}]}
