{"title": "First month of investment progress. Any advice would be greatly appreciated! ", "selftext": "This is the first month of investment. It’s not perfect as it seems though! Parentheses are the amount spent on each share! \n\nAlthough I’m up thanks to the investments of CVS ($58.25), Chevron ($141.75) SCHD ($83.25 before split), Palantir($34.50), Nio ($5.38), NVidia ($112.00), Intel($21.45 before Amazon deal) and Gevo ($1.58).\n\nI ended up selling my Sirius XM Liberty (-$90 at most) and reinvested it into MSTY ($27.61) and more SCHD made a positive results.\nThe losses were minimal! \n\nThe ones falling in the red of double digits are TRMD and CWEN. Ranging at a deficit of -$30 to -$40. \n\n\nWhat should be recommended and when to sell the growth stocks? ", "id": "1g23e5m", "created_utc": 1728749098.0, "score": 70, "upvote_ratio": 0.75, "num_comments": 102, "comments": [{"body": "Plant seeds, water them, watch them grow, and pluck weeds.\n\nEdit: I read your responses and you are not humble and it disgusts me. You are seeing a gain this month, guess what? So are everyone else. Thank me for my input…", "score": 58, "replies": [{"body": "Thank you for the input!", "score": -2, "replies": [{"body": "dang how you do that ? which strategy you use i wanna know i wanna do that same", "score": 4, "replies": [{"body": "Hello!\n\nMake safe investments with lower risk. Bigger companies like Charles Schwab for dividends and growth stocks like NVidia, Amazon, and whichever you prefer.\nVOO has always been a good suggestion.", "score": 0, "replies": []}, {"body": "You can also check my investments as listed how much I bought them for last month. They’re still going up. It’s up to you though. This isn’t guarantee to put you in the green so research before investing!", "score": 0, "replies": []}, {"body": "Funny thing to do is to watch what US congress invest in and sell when they sell! 😂😂😂", "score": -10, "replies": [{"body": "Why are people down voting this comment? Does it not work? I’ve heard good things about that Nanci pelosi tracker app lol", "score": 5, "replies": []}]}]}]}]}, {"body": "don’t get carried away with beginners luck. the market moves based on inflows not logic. ", "score": 11, "replies": [{"body": "Hello!\n\nThanks for your stern and good input. I understand to be very wary as I’m already very cautious. Especially the Chinese dump and withdraw that happened was insane! I thought that was too good to be true. I’m glad that I didn’t invest in stocks like Baba or any Chinese index or stocks.\n\nBeginners luck will always be appreciated by anyone! That’s why I’m asking on Reddit for advice.", "score": 1, "replies": [{"body": "other than buying total market funds, there’s many trading strategies. not worth trading unless you’re willing to lose significant amounts of money on downswings. ", "score": 1, "replies": [{"body": "If it’s alright to ask. My main question is that is it better to hold off on more larger investment like Vanguard after or before the Presidential election?", "score": 1, "replies": [{"body": "I’m still learning myself about 10 years into trading. Don’t take my advice because like I said above, logic doesn’t help always, IMO trump would cause major economic issues and economic warfare. Kamala makes international opportunities more interesting. Gold and materials sound interesting with Trump win but I doubt he wins. \n\nwhat have you found for the election investment playbook?", "score": 0, "replies": [{"body": "Heya!\n\nThanks for your response and clarification!\nI’m planning on focusing on a dividend buildup for my retirement for the next two decades. However I’m not swaying away from growth stocks as well. Just a little bit of diverse investment and was advised not to put it all in one.", "score": 0, "replies": [{"body": "I’m also looking at dividends to work towards. need more capital first. ", "score": -1, "replies": [{"body": "4% is what they say is the magic number… I don’t think so. That’s back in 1970-80s… I think it should be a dividend income of 4.75%-6% if possible", "score": 1, "replies": [{"body": "with inflation i’m not sure what makes sense anymore. With interest rates coming off 0% to 5% it seems to me there was a massive shift in opportunity cost for a company with 2% dividends. I have some research to do to see what actually played out with the last year. ", "score": 1, "replies": [{"body": "Ah gotcha", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Tell me the next stock you pick and i’m in!!", "score": 7, "replies": [{"body": "Hey! Thanks for the input! I’m planning to drop another $1k into a mix of stocks. I’m keeping a close eyes out on these stocks right now for dividends on compound interest growth!\n\nIncludes investing more in SCHD or any other Charles Schwab stocks like SCHG and SCHX. JEPQ, SPYI, QDTE, and PFLT.\n\nOther growth stocks I’m keeping a close eyes on are Humana, UPS, and Boeing. \nImportant note that I see is:\n\nRight now all Vanguard stocks are too high and the elections will determine the future of many growth stocks.", "score": 0, "replies": [{"body": "JEPQ does well when US stocks are running out of growth, because it sells covered call options.", "score": 1, "replies": [{"body": "Thanks, the way I understand for high yield dividends etfs is that they are only good when the market is stagnant", "score": 0, "replies": [{"body": "Like a recession I think. I think Charles Schwabs and few other thought of Dividend and DRIP would work out in the longer run. Right now it’s good but everything else seems kinda high. I ponder about how would the presidential election’s outcome would affect the stocks right now like Vanguard.", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "That’s a good question! I’m also asking around! I think Demo. Party focuses will be more internationally. \n\nI think someone commented or responded to me about the preference between Trump and Harris if you can find it.\n\nConservative Party will increase domestically has always been the norm! If Trump gets elected again I think the S&P will go up again for example. His first 12 months during election had the S&P 500 increased by 30%.\n\n\nI personally think the election will tend to sway voters over than investors.", "score": 0, "replies": []}]}]}]}, {"body": "Hello!\n\nThanks for your input! I didn’t know that and this definitely keeps me thinking a bit! However, the monthly dividend right now is $0.55 per share the last two months I think it’s worth it for now. JP Morgan Chase is also one of the largest bank if not the largest Bank in USA!\n\nSo I don’t see them go bankrupt anytime soon! If they go up or down it really doesn’t matter since its growth is usually positive annually! If I think it’ll go bad eventually I’ll sell and re-invest it later!", "score": -2, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "As someone mentioned. Despite being logically invested on today’s news. Stocks are more influenced by inflow. I mainly watch the US congressman when they sell and buy.\n\nWhen they invested into companies like Palantir. I immediately bought a couple. Keeping out eyes on our gaslines or gas pipes are important as well!", "score": 1, "replies": []}]}]}]}, {"body": "If you are thinking about long term and your goal is to make money, put everything into a low cost index fund. \n\nAlternatively you can try to beat the <1% of investors who are able to beat the market on the long term. Who says someone with no resources and professional training or experience couldn't do that?", "score": 3, "replies": [{"body": "Thank you for the input! \n\nI do appreciate this! Other things I’ve done was following bigger investors like Warren Buffet’s constant investment in Sirius XM (This didn’t go too well). \n\nI ended up investing some into Gevo and Nio. Which is performing really well! Growth stocks I’m playing it safe cause I’m still new and don’t really have the funds to gamble too risky.", "score": 1, "replies": [{"body": "Following bigger investors means you're getting a significantly worse deal.\n\nIf you every feel like asking about investing on reddit, you can be 100% certain, that your best option is something like VT. On the long term you're not going to outperform the market. It doesn't matter the slightest how well a portfolio is performing one month.\n\nOn a 6 year period only 5% of actively managed funds beat the market. Those are people mind you who are infinitely more smart about the stock market than you or I. And the % keeps going down and down and down and down every year after that.", "score": 0, "replies": [{"body": "Hey Van! \n\nThanks for your response back. I definitely learned from that. It wasn’t fun. Vanguard is definitely on my top priority list. My friends says I should wait after the elections to invest in higher premium and faster growth stocks like Vanguard stocks. Do I must invest now or wait after the election?", "score": 1, "replies": [{"body": "You should never wait (here I'm excluding stuff like saving up for a house, or emergency funds etc.) if you have a lump sum that you want to invest, the best time is always now. Why? Because of course everyone else knows that there's an election coming up, and the stock prices reflect that already. You are not smarter than the sum of every dollar going through the market.\n\nJust some simple examples, if the market is indeed about to go down a bit, of course every professional trader, who has way more info than you do would act on this, and sell the stocks, until it reflects the \"correct\" price, and this is basically what's happening, that's what people mean when they say the stock is already priced in. Waiting for a dip or selling your market portfolio is thinking \"I know better than all the market combined\". Also statistically speaking it's just never worth waiting for a dip.\n\nAnother way you can think of it is as a line going up with random deviations. The randomness you cannot control or predict. The only info you have is that it's trending up, that's why we invest our money. Waiting for a dip is simply a bad bet.\n\nThat said, the market still can go down, and it can seem that you made the \"right\" or \"wrong\" decision based on that, but keep in mind that's just one event, on the long term waiting will not be worth it either way.\n\ntldr: Dumping in everything (that you don't need or get tax benefits to) ASAP will have statistically the highest yield long term. (bonus points, it's also the least mentally exhausting way of investing)", "score": 3, "replies": [{"body": "Thank you for the time to tell me this! \nI really really appreciate this!\n\nI’m also putting a side off to pay off around $17.5 worth of student loans and Car payment. \n\nI’m also waiting for the housing market to stabilize or calm down (crash hopefully). \n\nIt never hurts to invest funds that I could afford to lose and just drop it off which seems understandable. I’m just cautious and would prefer to have more control over my funds and would hope to get as much gain as possible the best way. \n\nI’m not wealthy. That’s the best thing I could admit to myself and I’ve just started barely a year into my well paid job.", "score": 1, "replies": [{"body": "When I'm talking about these \"rules\" I'm talking about 10+ years keep that in mind. If you are looking to buy property, pay off loans, etc. you have multiple variables in the equation. But if you can set aside some money (for retirement basically) in that situation I'd just throw that amount instantly in VT.", "score": 1, "replies": [{"body": "Ah, gotcha. Thank you!", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Losing money at the get go is actually a good thing as it keeps you grounded.  Worse thing you can do is make money straight away because it makes you fell invincible ..and doomed hit the wall hard. \n\nGood to see you made money after the lessons of losing money :)", "score": 3, "replies": [{"body": "Thank you for the kind input!\n\nI definitely learned much from starting out and learned even more from this post! Appreciate it again!", "score": 1, "replies": []}]}, {"body": "6.2% up in a month? I would pay YOU for advice, and I'm 57.\n\nDiversify around the world, not just the overvalued US market. Those sweet, sweet 8% dividends on UK blue chip stocks are looking very attractive as revenue streams, and the Chinese government has decided to get 1 billion investors out of unproductive assets like property and gold, and into its stock markets.", "score": 4, "replies": [{"body": "Hello! \n\nThank you for the kind words and praise!\nI’m young and new! I’ve held back investing for almost a decade and learned from trials and mishaps. \n\nI would give favors for exchange of other favors. I didn’t know 6% increase is lot or not! \n\nI just started keeping up with news and close eyes out for strikes, protest, the presidential elections will determine much of the future growth of these stocks! \n\nI focused on playing it safe on bigger companies like Charles Schwab’s stocks of SCHD, SCHX, and SCHG. Other low stocks that may had our US Congress investments were all great picks as well!", "score": 2, "replies": []}, {"body": "Same. But which UK stocks you picking?", "score": 0, "replies": []}]}, {"body": "Play ODTE. Very safe limited downside", "score": 2, "replies": [{"body": "Thanks for the input! I’ll put this on my watchlist. Thanks again!", "score": 1, "replies": [{"body": "It's a joke by the way. 0DTE means a '0 days until expiration' option, which is likely to be cheap, but unlikely to make money.", "score": 5, "replies": [{"body": "Someone just told me that and I didn’t know! 😂😂😂 I do appreciate it and hopefully you understand. I’m new to this.\n\nEdit:\n\nI asked which one they preferred and explained not to do it. I’m like… Bummer.", "score": 3, "replies": [{"body": "Dw, learn as much as possible, but remember that Risk Management is key. Enjoy it, and just be careful to not succumb to Fear & Greed!", "score": 2, "replies": [{"body": "TY!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "More 0dte options", "score": 2, "replies": [{"body": "Hello!\n\nThanks for your response. Which 0dte do you prefer or recommend?", "score": 2, "replies": [{"body": "Nah I’m being sarcastic, stay away from options. If you need any reason to stay away from options, go look through the loss flair over on r/wallstreetbets. \n\nMy honest advice would be to stick with an etf tracking the S&P 500. Even most hedge funds, with all their financial analysis and models, don’t beat the S&P 500 over the long term. So as a retailer who isn’t digging through 10 years worth of financial statements, calculating key performance indicators, and modeling growth, there is a zero percent chance your random stock picks will beat the overall market in the long run. \n\nThat said, I also like picking my own stocks because it’s fun. My advice would be to keep 90-95% of your portfolio in something like SPY or VOO, and use the rest to see if you can do better with your own picks. \n\nGood luck!", "score": 3, "replies": [{"body": "Ah,\n\nSorry, once again I’m new and didn’t pick up the understanding. Roger that stay away from options! \n\nI’m def having my eyes on SPY and VOO is high rn. I’m thinking what if I invest now and it dips after the outcome of the Pres. Election? After all this isn’t guaranteed or we expect to get rich quick. .", "score": 2, "replies": [{"body": "Yeah I was making a dumb joke and felt bad when you responded haha. Options are very high risk, and a lot of people lose their entire investments when they jump in with no experience. \n\nSPY is very high, and it very well may dip. It’s also possible we enter a bear market, which would last around 9 months based on historic averages. That would be alright. It always comes back up, and it would give you opportunities to buy more shares at a discount. The S&P 500 has averaged around 10.5% returns since inception. Some years it’s down, most years it’s up, and it averages out to a return unmatched almost anywhere else. \n\nYou’ve probably heard the cliche “time in the market beats timing the market.” Consider it this way: the market might drop, and your shares might lose value for a little while. But they’ll always come back up. On the other hand, the market might also keep going up, and you miss out on a bunch of gains, and might never have the opportunity to buy at these prices again. The second risk is much, much greater in my opinion.", "score": 2, "replies": []}, {"body": "I don’t know what your income or age is and whether you’ve thought much about retirement, but you should consider opening a Roth IRA. If you invest the maximum Roth contribution every year (it’s currently $7k) you will retire a multimillionaire, tax-free.\n\nEdit: like you said, it isn’t get rich quick. But with regular investments in tried and true ETFs, it will make you rich over the course of your life.", "score": 2, "replies": [{"body": "TY for the response!\n\nLow six figures and I’m in my mid 20s. I have good amount of cash liquidation and cash on hand. I’m just playing a safe ratio.", "score": 2, "replies": []}]}, {"body": "Is that a brokerage account ? Why not a roth ?", "score": 1, "replies": [{"body": "It’s a brokerage. I’m def setting up a Roth or something for retirement!", "score": 2, "replies": [{"body": "I always max out my roth first. Brokerage you still have to pay taxes after you gain.", "score": 2, "replies": [{"body": "That’s pretty important. I guess I’m just overly cautious and preferred to pay what I gained and will eventually get the Roth started. However, are there any downsides or disadvantages of having a Roth?", "score": 1, "replies": [{"body": "The only downside is that if you withdraw your gains before you’re 59 and a half years old, you’ll have to pay tax and a 15% penalty on the gains. But note that’s only on the gains; you can withdraw your contributions. And there are a lot of scenarios, such as buying your first house, where you can withdraw quite a bit without any penalty. You’ve gotta be willing to leave your money invested for a long time, but the long-term tax savings are definitely worth it", "score": 3, "replies": [{"body": "Gotcha!\n\nI think I may had coincidentally gladly that I only invested about 20%ish of my savings! So I’m good!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "very good", "score": 2, "replies": [{"body": "TY! Any advice would be appreciated!", "score": 1, "replies": []}]}, {"body": "I got 1.5 ones for you. If you want to invest in something, have it in your watchlist for at least 2-3 weeks, watch it everyday before buy it. Market has been chilling so far so 6% is a decent return but you havent seen the fucked up part yet. At this point, not losing is winning. Good luck and keep it up. You did better than me when I started.", "score": 2, "replies": [{"body": "Thx u for the compliment and input! I’m asking around and making sure that I’m doing everything just fine. \n\nI know that the market is volatile and it’s tough love learning when to sell and accept losses. It just felt better when advises and tips are given and I couldn’t appreciate them enough! Thank u again!", "score": 2, "replies": []}]}, {"body": "Congrats! I know I'm not the first to say it but I'd just recommend keeping a healthy ammount in VOO or equivalent and playing with the rest.\n\nHow much is up to you, I used to keep it at 50%, then about 20%, then almost 60% and now I'm thinking less in terms of percentages and more in terms of how much money (in terms of initial investment) I want to keep relatively \"safe\" in case I make a bunch of bad decisions or the market starts to crash in the middle of too many swing trades.", "score": 2, "replies": [{"body": "Thanks for your input and compliment! \n\nI definitely have VOO and a few others too on my watch list and always wanted to buy some. I held back cause of this. \nI’ve done the math. It’s at a constant all time high. \n\nI’ve juggled and thought about it. A share was $499 last month and now it’s $528 or so. It seems like a lot but that’s a 5.49% increase and it’s a growth stock. Dividends are alright per share. \n\nI ended up putting that $6k into diverse stocks and the results was a 6.2% growth through Chevron, CVS, and other stocks that US Congress has contracted with. \n\nIt’s mainly built as 80% DRIP with 20% growth stocks. \n\nBy my next paycheck month I’m def dropping into Vanguard on VOO, VTI, VUG. They will be heavily researched. If Trump gets elected. I think that ETFs in the S&P 500 will grow and go higher! \n\n\nEdit: I’m not showing any political support for Trump or Harris. The S&P 500 has done really well when Trump was in office. The performance and growth was over 30%.", "score": 1, "replies": []}]}, {"body": "what's the app or website named ?", "score": 2, "replies": [{"body": "good question.", "score": 1, "replies": []}, {"body": "Hello!\n\nI’m using SOFI savings and investing!\n4.3% APR Savings given monthly and easy to use investing! I’m avoiding foreign trading rn so it helps my choices.", "score": 1, "replies": []}]}, {"body": "Stay away from option", "score": 2, "replies": [{"body": "Thanks for the input! Heard!", "score": 1, "replies": []}]}, {"body": "That seems to be a pretty good portfolio for a beginer.", "score": 1, "replies": [{"body": "More about me:\n\nI’m in my mid 20s. \nDropped out of college and worked my way up on a job that ended up paying low end six figures around the middle-class ish income (Living on the suburbia town outside of a capital city).\n\nI have about $12,500 in car loans and $5k ish in student loans to pay off. \n\nLearning from the mistakes of others and taking in the advice of others helped me make some good progress. I didn’t do it perfectly cause following Warren’s Buffets investments wasn’t a good choice for Sirius XM merge. I got it originally due to dividends but the merge with Liberty really messed me over and even worse… it dipped from $3.20 to $2.30. \n\nAnything can happen. I also didn’t invest in any Chinese Stocks and my intuition was right about it being a trap.", "score": 2, "replies": []}, {"body": "Thanks for the input! \n\nI’m being very very cautious right now. Especially with the elections coming up.\n\nI’m keeping an eye out on falling stocks with good dividends such as UPS, Humana, Johnson and Johnson, and the protest of Boeing.", "score": 1, "replies": [{"body": "If you're interested in dividends, forget US stocks. The UK market is the place to be. Lots of 6-10% dividend payers. UK companies earn money around the world and bring it to London for their shareholders.\n\nWarren Buffet's own company, Berkshire Hathaway, looks like a great investment. It has more free cash than any other company, waiting to bail out overleveraged businesses in the next crash.", "score": 2, "replies": [{"body": "Thanks for your kind input! I definitely learned about following Buffet. I learned that he could afford losses!", "score": 1, "replies": []}]}]}]}, {"body": "What advice to you have for a newbie just starting?", "score": 1, "replies": [{"body": "Hello Latinlover!\n\nOf course! Some cool and easy to follow tips I’ve racked up or read is:\n\n1. \nDon’t expect to get rich quick! It takes patience and upkeep on the news! \n\n2.\nOnly gamble or risk investments on what you could afford to invest! Don’t invest it all! Keep some on side for emergencies! \n\n3. Watch the news or keep up with the financial side of the world!\n\n4. If you have anyone or any connections with people working in the financial field or at Wall Street for example. Ask for their advice! Invite them out for lunch or something. Be respectful and polite. Remember that all of this are good advice and opinions! It doesn’t guarantee returns as anything could happen!\n\n5. Don’t be like me where I made the mistake of following one singular investments like Warren Buffet. His investment into Sirius was pretty bad and they’re still losing subscribers! Follow through your research and stay put with it!\n\n6. Try to not make too many risky investments. Why not just put it into safe investments like Amazon, NVidia, Apple, etc etc etc? We don’t see them going bankrupt anytime soon and their inflows are good!", "score": 2, "replies": [{"body": "Man this is awesome! Thanks so much", "score": 2, "replies": [{"body": "All good and love for all! 😁 sharing is caring!", "score": 1, "replies": []}]}]}]}, {"body": "What app do you use to calculate your portfolio?", "score": 1, "replies": [{"body": "Hello!\n\nThis is SOFI banking and investing!", "score": 2, "replies": []}]}, {"body": "Why would you sell your growth stock?\n\nYou should keep a portfolio of growth + value to get balance.\n\nIf you are young, and willing to take more risk, you should not be buying stocks for dividends.\n\nInvestment period too short... Not to denigrate your effort, your gains could be purely of luck (this is election year).\n\nCome back in a year and we shall see...", "score": 1, "replies": [{"body": "Hello,\n\nThanks for your input! I do appreciate the words of advise and did a thorough research. I’m more of a cautious and patience investor and try to build a safer investing portfolio. It’s ok for me tot grow some funds here and there but I’m trying to build a portfolio with a good amount of passive income plus some growth stock to sell next year and reinvest it into more high dividend yields. \nMy situation is that I have a pretty good income and my bills are low. My needs and necessities are minimal. I’m paying off my student loans by the end of this year. My new 2023 car will be paid off in 14 months. Ahead of schedule.\n\nI just like investing this way for me.", "score": 1, "replies": []}]}, {"body": "Try options. You can become a bajillionaire", "score": 1, "replies": [{"body": "Bro I know right? Imma get them zeroes asap! 😂😂😂💀💀💀💀", "score": 1, "replies": [{"body": "Good man!", "score": 1, "replies": []}]}]}, {"body": "I would buy google", "score": 1, "replies": []}, {"body": "unless you have all the time in the world, and an unfair information advantage. over the longer term, it's hard to generate returns that beat the market. \n\nthere are professionals who spend their entire days and weeks researching stocks. you're not going to be better than them as a retail investor.\n\n  \noption b is have a clear niche in something. for example, if you are a gamer and you know the gaming industry inside and out, played every title under the sun, and is also in the competitive scene; chances are, you might be better connected to what's happening there than people who sit in an office every day. that might be your advantage. otherwise, it's just blind luck\n\n  \nlast, move to a geographic area where information flow benefits you. moving to palo alto / mountain view california, every cafe you go to would be some engineer talking shit about their company. now and then it would be some disgruntled employee saying how things are falling apart, or the next day it might be a tesla engineer going \"elon finally moved out of the damn factory and i can finally go home on time now\". all of these things are information that other people wont have that gives you an advantage. \n\nin the absence of the above, you are just playing casino and thinking you have an edge when you really dont.", "score": 1, "replies": [{"body": "Roger that and thanks for the input!", "score": 1, "replies": []}]}, {"body": "unless you have all the time in the world, and an unfair information advantage. over the longer term, it's hard to generate returns that beat the market. \n\nthere are professionals who spend their entire days and weeks researching stocks. you're not going to be better than them as a retail investor.\n\n  \noption b is have a clear niche in something. for example, if you are a gamer and you know the gaming industry inside and out, played every title under the sun, and is also in the competitive scene; chances are, you might be better connected to what's happening there than people who sit in an office every day. that might be your advantage. otherwise, it's just blind luck\n\n  \nlast, move to a geographic area where information flow benefits you. moving to palo alto / mountain view california, every cafe you go to would be some engineer talking shit about their company. now and then it would be some disgruntled employee saying how things are falling apart, or the next day it might be a tesla engineer going \"elon finally moved out of the damn factory and i can finally go home on time now\". all of these things are information that other people wont have that gives you an advantage. \n\nin the absence of the above, you are just playing casino and thinking you have an edge when you really dont.", "score": 1, "replies": []}, {"body": "Bout time we start cranking cash out!!", "score": 1, "replies": [{"body": "😂 I know but will get taxed pretty heavily so I have to play it fairly. I did some thorough research and check with opinions of others. I think I’ll very likely still be in the green plus dividends!", "score": 1, "replies": []}]}, {"body": "A good rule of thumb is to set it and forget it.\n\nAnd if a stock is going down you double down and buy some more of that stock (unless it's a stock that you have no trust in).\n\nAnd also trust in the S&P 500, it's quite rare for that index fund to leave you hanging", "score": 1, "replies": [{"body": "Thanks for your input!", "score": 2, "replies": []}, {"body": "Would you buy S&P 500 over a target date fund for a retirement account?", "score": 2, "replies": [{"body": "Unless you’re over 45 or 50, I would. Even then, I would keep a large chunk in the S&P 500", "score": 2, "replies": [{"body": "I’m 35. Everything is in target date funds. Wanted to move it earlier this year but dragged my feet. Now I’m afraid of a crash haha", "score": 2, "replies": [{"body": "You could always dollar cost average in. In general, a lump sum investment is better, but a DCA strat would allow you to get some benefit if we don’t get a crash soon, while also limiting your loss in the case of a downturn. But even if we do have a crash, it doesn’t matter if you’re not close to retirement. It always comes back up.", "score": 2, "replies": [{"body": "Good point", "score": 2, "replies": []}]}]}]}, {"body": "Hmmmm that’s a hard one", "score": 1, "replies": []}]}]}]}
{"title": "Ride-sharing giants Uber, Lyft jump after Tesla’s ‘toothless taxi’ fails to excite investors", "selftext": "Tesla’s hyped robotaxi unveiling posed a threat to Uber’s ride-sharing aspirations, but it has turned into a boon for the stock instead.\n\nUber shares had been falling on the initial investor excitement leading up to Thursday’s event — particularly slumping in early August and mid-September — but surged more than 9% on Friday on renewed enthusiasm that the company is well positioned to advance its autonomous vehicle offerings. The move pushed the stock to a 52-week high and it was leading the S&P 500 higher during the session.\n\nThat is a massive turnaround for Uber’s stock, which is now up nearly 22% over the past month and about 38% for the year. Lyft, another major player, is also surging about 10% on Friday. By comparison, Tesla’s shares are plunging during Friday’s trading session and are down more than 11% this year, vastly underperforming both the S&P 500 and the Nasdaq, which have each gained around 22% so far this year.\n\nThe buzz around Tesla’s highly anticipated cybercab has largely dissipated due to a lack of detail on its latest full self-driving technology advancements and the company’s failure to provide insight on its ride-sharing service strategy or economics, among other expectations investors had.\n\n“TSLA’s toothless taxi is a best-case outcome for UBER,” Jefferies analyst John Colantuoni said in a Friday note, noting that the electric car maker provided ambitious targets but little signs of feasibility.\n\n  \nSource:  [https://www.cnbc.com/2024/10/11/ridesharing-giants-uber-lyft-jump-after-teslas-toothless-taxi-fails-to-excite-investors.html](https://www.cnbc.com/2024/10/11/ridesharing-giants-uber-lyft-jump-after-teslas-toothless-taxi-fails-to-excite-investors.html)", "id": "1g221z2", "created_utc": 1728745380.0, "score": 336, "upvote_ratio": 0.92, "num_comments": 101, "comments": [{"body": "What other companies other than Waymo have autonomous cars on the road? I can’t think of any others.", "score": 103, "replies": [{"body": "A dozen+ Chinese companies: https://www.nytimes.com/2024/06/13/business/china-driverless-cars.html They've been running like Waymo for over 2 years. Go to y o u t u b e and you'll see 5 year old videos about autonomous buses, street sweepers etc. also. (The sub auto deletes video links)", "score": 58, "replies": []}, {"body": "Zoox, but they're not public yet", "score": 19, "replies": [{"body": "Isnt ZooX an amazon venture?", "score": 18, "replies": [{"body": "Yes, Zoox is part of Amazon", "score": 14, "replies": []}]}]}, {"body": "Cruise, I think. They suspended operations a while ago but went online again recently, but again, \"I think\".", "score": 12, "replies": [{"body": "Isnt GM gutting it?  Mainly due to them covering up that they knocked over a pedestrian and then dragged them along the street.  So the regulator is spitting blood.", "score": 5, "replies": [{"body": "Apparently they're about to start: [https://www.reuters.com/business/autos-transportation/gms-cruise-begin-testing-autonomous-vehicles-california-2024-09-19/](https://www.reuters.com/business/autos-transportation/gms-cruise-begin-testing-autonomous-vehicles-california-2024-09-19/)\n\nSo I was wrong, but GM is also not gutting them (unless there's something more recent I'm unaware of).", "score": 6, "replies": [{"body": "About to resume\n\n>On Oct. 2 [2023], a pedestrian in San Francisco hit by another vehicle was thrown into the path of a self-driving Cruise car and dragged 20 feet (6 m).\n\n>In the aftermath, California suspended the company's permit for driverless vehicles, and Cruise pulled all its U.S. self-driving vehicles from testing. The unit's then-CEO, Kyle Vogt, and co-founder Dan Kan resigned in November.\n\nFollowed by a wave of GM ordered cuts to Cruise.  900 jobs/25%.\n\n>Cruise’s troubles can be traced to an Oct. 2 crash when a car hit a woman at an intersection in San Francisco and flung her into the path of one of Cruise’s driverless taxis. The Cruise car dragged the woman some 20 feet before pulling to the curb, causing severe injuries. Regulators accused Cruise of omitting footage of its car dragging the woman from a video that it provided to state officials.\n  \nhttps://www.nytimes.com/2023/12/14/technology/cruise-layoffs.html", "score": 2, "replies": [{"body": "They're still starting up again this year from what I can gather, that's all I'm saying 🤷‍♂️", "score": 3, "replies": [{"body": "Yea. That Cruise news is from 2023. Users may need to update their news to 2024. \n\nUber is partnered with Cruise\n\nhttps://www.cnbc.com/2024/08/22/gm-owned-cruise-will-partner-with-uber-to-offer-driverless-rides.html", "score": 3, "replies": []}]}]}]}]}]}, {"body": "No one literally. And even Waymo is unlikely expand nationally in a fast expansion due to its high cost of adoptions. In other works, autonomous driving still years away.", "score": 4, "replies": [{"body": "High cost of adoption?  If this were true, then why were Tesla investors so excited about the prospect?", "score": 5, "replies": [{"body": "Because they believe a conman conning them.  ", "score": 6, "replies": []}, {"body": "Huh, why Tesla investors would be excited about Waymo. I was talking about Waymo’s high cost of adaption.", "score": 2, "replies": []}, {"body": "For Tesla the cost of adoption would be very low.  Every Tesla that is currently on the road is fully equipped to operate as a robotaxi.", "score": -5, "replies": [{"body": "Every Tesla that is on the road today is fully equipped to maime and kill passengers and pedestrians as a robotaxi. As a Tesla owner who has used FSD for hundreds of drives, I don't believe the current vision only hardware can ever be safe enough for fully autonomous driving. Rain, direct low horizon sunlight, and night time have made FSD make some sketchy AF decisions that I don't think will improve on HWD3 or HWD4 in the coming years.", "score": 5, "replies": []}]}]}]}, {"body": "Mercedes on their $200,000+ range, +$5,000 per year, only works on a very limited number of stretches of highways.", "score": 4, "replies": [{"body": "Both numbers are wrong. They have it on 2024 EQS Sedan which is around ~125k but that's before any discounts which it has plenty. Annual fee is also 2500$.\n\nHaving said that if I was in California, I would have still waited to buy it because it is fairly limited right now mainly to be used when there is heavy traffic on highways and flow is under 40mph but Mercedes' level 2 does a decent job on that anyway. Once they enable it for full highway speed then it may be a different story.,", "score": 8, "replies": []}]}, {"body": "There’s not a lot of value for the end customer in autonomous taxis in and of themselves. That’s why other taxi equivalents are being compared against.", "score": -1, "replies": []}, {"body": "Waymo has cameras, lidar and radar and still can’t drive straight \n\nTeslas only use cameras. They can never be true self driving cars", "score": -14, "replies": [{"body": "> Waymo has cameras, lidar and radar and still can’t drive straight\n> \n> \n\nWaymo is far superior statistically to human drivers when it comes to reported crashes, injuries, and insurance claims.\n\nLuddites are the only people claiming that Waymo isn't a good driver.", "score": 19, "replies": [{"body": "“luddites” 😂😂\n\nDid you learn a new word and feel special?\n\nAll I’ve been buying are electric or plug in hybrid cars for the last 8 years and I get a new car every other year. I must really hate new tech 🙄🙄\n\nMaybe I’m just a guy who lives in an area with a lot of Waymos, realizes that they’re designed to “learn” people’s drivings skills, and have firsthand seen them do stupid shit 🤷‍♂️", "score": -14, "replies": []}]}, {"body": "Waymo is now doing well over 100,000 rides a week.\n\nThat is not happening unless you can drive straight.", "score": 7, "replies": [{"body": "And they’re avoiding certain streets and on go on the freeway in San Francisco why? If they’re truly self driving why not give them the ability to drive everywhere? Why are they only in a couple cities? Since their sensors are so amazing and they’re clearly not on digital tracks. You’re just listening to information from the very company that would obviously just give you good news 😂", "score": 1, "replies": [{"body": "Same reason that they did the 10/10 event on a back lot of a movie studio.  FSD is not safe to use for anything beyond that simple track.\n\nWaymo does vigorous testing to make sure it is safe before being deployed.", "score": 1, "replies": [{"body": "Yeah, they would never lie so they can get their product on the road and start making money. Never! The cars are perfect!!\n\nhttps://www.instagram.com/reel/DBUNLNZRtT8/\n\nWhy are you glazing Waymo? You work there or you really trust companies when they put out press releases? They’re all over my neighborhood and they make stupid decisions everytime I see them. Just because people like me are avoiding them so they’re not getting in accidents every ride doesn’t mean they’re safe lmao", "score": 1, "replies": [{"body": "They are now doing over 100,000 fares a week rider only.\n\nThey are amazing.   But Google/Waymo did their first on public roads, rider, only, nine years ago!\n\nWaymo is just nothing short of amazing.", "score": 1, "replies": [{"body": "It’s embarrassing how obvious a plant you are lmao\n\n“Short of amazing?” Who the hell would say that about Wayne\n\nYour post history tells me you’re not connected to reality though 🤷‍♂️\n\nhttps://www.instagram.com/reel/DAwUCS3qCjQ/", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Have you been inside a Waymo? I doubt it", "score": 3, "replies": []}, {"body": "We use only 2 eyes. Why would 10 cameras in all directions never be enough?", "score": 0, "replies": [{"body": "We also use hearing, risk awareness & perception and intuition that allows us spot potential hazards and preemptively act. \n\nThis is of course missing for cameras and why I think as many other guiding elements like lidar are a good idea.", "score": 2, "replies": []}, {"body": "Birds have wings that flap and planes do not.\n\nSame reason.", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": 56, "replies": [{"body": "I'm buying UBER. I think it has Way Mo upside as well. The risk seems to be dipping. You buy UBER it is a bet they become the platform robotaxis get their rides off of. All you need is robotaxi competition. \n\nBut I totally get this thread will turn into a Google thread with how much popular Google is to UBER/LYFT which the article in OP is about.", "score": 18, "replies": [{"body": "Can you break down how exactly Uber plans to dominate this long term? Like, what about them gives them a bigger upside to Google? I know they have a very big platform, but Google being Google, they can easily catch up and accelerate their own, at which point, what would be Uber’s unique competitiveness in this field? I’m genuinely curious.", "score": 5, "replies": [{"body": "My investment thesis isnt for Uber to dominate robo car industry. Just like Uber was never dominating the regular car industry. They just have to be the platform that facilitates these rides. As I said in comment all you need is for there to be robotaxi competition. \n\nGoogle being Google isnt enough if there are 10 different companies offering robotaxis in the world. However if Google is the only one then yea Uber would be screwed. But I think the safer bet is to assume their wont be a monopoly where one company owns all the robo taxis.\n\nI think you have to go to a Google vs Tesla thread for a thread where holes being poked at Waymo is more accepted. I cant really go into more detail in an Uber vs Google thread. People love Google more than Uber.", "score": 4, "replies": []}]}, {"body": "Why would Google need Uber? In SF people are using the Waymo app pretty readily.  Eventually, it'll virtually replace Uber altogeether", "score": 5, "replies": [{"body": "That hinges on Google having a monopoly on robo taxis. I said in my post investing in Uber is a bet that there will be multiple companies with robotaxis that they become like regular cars such as GM, Ford, Chrysler, etc with intense competition.\n\nWaymo is just a small part of Google business that if that happens they have other ways to make money. But in a thread about robotaxis that is something that needs to be considered.", "score": 7, "replies": [{"body": "I'd be shocked if Waymo is not a huge bet for Google. They're not stupid. They see the same potential that you and I do. \n\nJust because they have other businesses doesn't mean they're not putting a big bet on Waymo.  It only means they can allocate more resources and handle failure better.", "score": 1, "replies": [{"body": "This goes back to my original comment. Other companies see this potential too. I dont think Google will be the only company with robo taxis. If other companies create robotaxis the question becomes does Uber need Google. But that question cant be asked since threads only last 24 hours. We wont know until at least 2025 when Cruise starts rolling out robotaxis.\n\nIm not sure why so many think robotaxis will be a monopoly. Do people really think rest of world going to sit back and let Google get all those profits.", "score": 3, "replies": []}]}]}, {"body": "Takes a lot of capital investment to build out a fleet of cars. \n\nEasier/cheaper to lease the tech out and keep the data.", "score": 1, "replies": []}]}]}, {"body": "Goog is on the verge of being broken up, by the DoJ due to monopolistic behavior.", "score": -9, "replies": [{"body": "Watch the value skyrocket", "score": 11, "replies": []}, {"body": "1. You can't say that with 100% certainty. If that's your approach to investing than you should 150% stick to index funds.\n\n2. If they get broken up that could be a good thing. Being a shareholder you will be entitled to all the split up company's shares.", "score": 5, "replies": []}, {"body": "Ya, end?\n\nIt that happens that you as a shareholder are going to get shares in multiple very competitive companies which are all going to seek to become huge.\n\nAnd the big cash cow companies like Search would be given an insane valuation as it doesn’t have to invest in moonshot projects and can instead pay a fantastic dividend.\n\nGoogle getting broken up would suck for Google Management, but it would be a huge boon to investors", "score": 1, "replies": [{"body": "Except that it loses the connection between search, mobile, chrome and advertising.   With advertising being the most important part but relies on the others.", "score": 8, "replies": []}]}, {"body": "DOJ logic : let’s break up google during the most competitive point for search even and LLM introduction", "score": 1, "replies": []}, {"body": "Google will acquire the DOJ", "score": 1, "replies": []}, {"body": "A broken up Google is worth a lot more money than on intact.\n\nBut with that said.\n\nThere is next to zero chance Google will be broken up.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "But thou end up losing the connection between advertising and the rest of the company.  \n\nWith Google just being a very fancy advertising company.  Which relies on other services to deliver ads.", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Google could stop paying Apple.  Apple has said thst they were offered the entiriety of Bing for free and still didn't take it, as it's just so far behind Google.  \n\nI'm not quite sure how Maps and Street view helps Google's bottom line.  Apart from knowing where their customers live, go to work etc.  But  it's one of the factors that means that they know more about you and feeds into how well they can target and measure ads.  Their primary source of income is advertising whethether that's through Ad-Sense or through sponsored search.  Breaking Google up, reduces their ability to collect that data.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I always keep saying that people shouldn’t be playing with TSLA stock because TSLA will play with them.", "score": 21, "replies": [{"body": "Yeah i think at this point it is a meme stock for traders.", "score": 6, "replies": []}]}, {"body": "Someone asked me a few days ago how much I'd bet against Tesla and I said $0. Turns out my Uber long position was a huge bet against Tesla...\n\nThe more you know. And praise Elon for that gain.", "score": 10, "replies": []}, {"body": "Uber is not a competitor of Tesla.\n\nThis entire pairs trade is asinine.\n\nIt was dumb when Uber sold off 7 months ago, as a result of this cyber taxi bs being announced, and it was dumb when it pumped when cyber taxi event was bs.\n\nWall Street loves a dumb fuck narrative, and this is one of them. \n\nDisclosure: I have both; but more uber. I’m heavily loaded to the tits in Uber leaps that I’m up massive amounts in.", "score": 25, "replies": [{"body": "Ok now explain to me how a functioning Tesla Robotaxi wouldn't challenge Uber's market position?", "score": 10, "replies": [{"body": "Because Uber doesn’t manufacture vehicles. \n\nThey’re a ride sharing and food delivery app with hundreds of millions of users, but they rely on others to provide the vehicle.\n\nTesla manufacturers vehicles.\n\nIt’s just entirely speculative to suggest Tesla will compete with Uber.\n\nIndeed, their businesses are symbiotic. Uber would be infinitely more profitable if the rides were autonomous. \n\nIt seems like a huge assumption to believe Tesla will, some day, roll out a fully autonomous vehicle, and then also roll out a ride sharing app?\n\nWhy do they even need to do that?\n\nWhy not just manufacture the vehicle and make a deal with Uber and take x% of any ride? \n\nNot to mention, it’s entirely unknown when tesla autonomous driving will happen, and it’s also not a foregone conclusion that ONLY Tesla will be able to develop it. See e.g. waymo.\n\nRealistically, even if Tesla did want to enter into the ride sharing market, whenever that was to occur, Uber would be able to partner with one of Tesla’s competitors, and leverage their massive install base.", "score": -3, "replies": []}]}, {"body": "Whats your bull thesis on uber", "score": 3, "replies": [{"body": "They they keep earning more money.\n\nThey’re the dominant player in ride sharing and food delivery and that won’t stop anytime soon.\n\nEventually they’ll be doing robo taxi as well but it’s a whatever issue for me at this point.\n\nNobody is even close with autonomous driving so idc ab that.\n\nI do think they’ll be a better player in that than TSLA", "score": 8, "replies": []}, {"body": "uber is at ATH now, no point buying it now", "score": 4, "replies": [{"body": "Im not. Just curious why people are so bullish on it", "score": 2, "replies": [{"body": "uber is partnering with waymo to offer autonomous rides", "score": 1, "replies": []}]}]}]}]}, {"body": "I had $232.50 puts I paid $300 for. I sold them for a small profit Thursday because I was scared. Turns out they would have been 500% profit for the entire day Friday if I’d held. They went as high as $1800 a contract", "score": 5, "replies": []}, {"body": "Elmo needs to go", "score": 17, "replies": []}, {"body": "Are people finally waking up and realizing Elon is a grifter and he’s committing fraud to inflate his stock price?", "score": 8, "replies": []}, {"body": "I’ve been in Uber since $38 don’t mind if I do.", "score": 2, "replies": []}, {"body": "If you think Mr. musk will deliver the robotaxi in 2027, I’ve got a bridge I’d like to sell you.", "score": 2, "replies": []}, {"body": "More lies from Elon", "score": 2, "replies": []}, {"body": "Salivating over the thought of money moving from Tesla to others.", "score": 3, "replies": []}, {"body": "I'm stacked on waymoooo", "score": 1, "replies": []}, {"body": "Two things I admire in this life sofi bulls and Tesla bears….oh the confidence to be wrong 100% of the time but still speak with such authority ", "score": 1, "replies": []}, {"body": "all cars of all brands will be self driving within 10 years.\n\ni don't really see the need for this.", "score": 0, "replies": []}, {"body": "if I was a girl I would rather sit in the robotaxi than to risk getting hit on by a perverted/sleazy Uber Driver", "score": -9, "replies": [{"body": "This is a weird hypothetical.  The drivers have rankings, they’re not going to be able to drive for Uber for very long if they’re hitting on their customers.", "score": 15, "replies": [{"body": "well idk but it happened to my friend that a driver asked for her number but she had to politely but uncomfortably say No", "score": -3, "replies": []}]}, {"body": "Uber isn't \"Fake Taxi\"", "score": 2, "replies": []}]}, {"body": "TSLZ. Two times inverse leveraged Telsa up 17% on Friday. This puppy has been on my watchlist. Might run all week next week.", "score": -1, "replies": []}, {"body": "I cant wait to see how \"toothless taxi\" ages in 10 years.", "score": -7, "replies": [{"body": "It's been 10 years since Elon began talking about FSD. \n\n[Tesla FSD Timeline ](https://motherfrunker.ca/fsd/)\n\nHe has a history of this.\n\nDecember 2020\n\"I'm extremely confident that Tesla will have level five next year, extremely confident, 100%\"\n\nRiiiiiiiiiiiiiiiiiiiiiiiiiight", "score": 4, "replies": []}, {"body": "It'll age by Elon saying it's still 2-3 years away like he always does", "score": 9, "replies": []}]}, {"body": "[deleted]", "score": -31, "replies": [{"body": "Lack of firm timelines to launch. Ambiguous status on regulatory approval.\n\nFinancial estimates for cost to run these things felt like Elon was making them up on the spot, there was no evidence of real analysis there.\n\nCould have tried explaining the design decisions for the taxi. Why 2 seats? Is there a variant with more? \n\nI'm not an Elon hater. I think the meme-hating on the guy here is cringy AF and kind of childish. And, I was excited for the robotaxi event. But it did not really deliver in my opinion.", "score": 16, "replies": []}, {"body": "I saw a video of someone who actually got to ride in one. They drove in a one block loop and they were in a traffic jam. They're nowhere near road tested. Google has been testing on the road for years. Even before waymo", "score": 5, "replies": []}, {"body": "Well he’s been lying about the capability of his self driving tech for well on a decade now. When you’re never going to deliver on your promises they become toothless and we’ve seen no indication that Tesla can deliver", "score": 5, "replies": []}]}, {"body": "The obvious astro-turfing of hate on Tesla and Elon the past 48 hours is ridiculous over multiple subs. Typical reddit behavior. C'mon MODs.", "score": -35, "replies": [{"body": "Maybe Elon shouldn’t have lost public trust by cozying up to white supremacists on his platform, giving them a voice, and constantly spewing hate and bigotry on the platform he has completely destroyed all good will from. \n\nActions have consequences. His shitty actions have led people to stop believing in his rhetoric and to stop investing in his companies. Those are his consequences. If you want to whine about it, you can feel free to flock to ex-twitter with all the other hateful bigots spewing bullshit left and right. \n\nInvestors are no longer fooled by his grand gestures and ideas. We see through his grifting nonsense and see him just as another lackey pushing bullshit.", "score": 12, "replies": []}, {"body": "Hundreds of millions worth of bets were placed as soon the market opened, it’s not just Reddit, there’s very few people left to believe his fantasies given his track record and it seems like they’ll unfortunately watch their investments decline", "score": 11, "replies": []}]}]}
{"title": "Robotaxis coming, Robotaxis coming, oh yes Robotaxis still coming!", "selftext": "I’m sure, just like me you all have heard the famous song over past few years, “Robotaxis are coming, Robotaxis are coming…”,  song writer and the singer - Elon Musk!\n\nMusk has been playing this song “Robotaxis are coming, Robotaxis are coming…”  for nearly a decade promising 'next year, next year'. And, each time, media, dumb analysts and his fans gather to his next concert just as charmed as previous time, only to be disappointed again!\n\nIn April, when $TSLA was around $150-$160, Musk announced the Aug. 8 unveiling day of its robotaxi, Again, the hype starts building, analysts start coming up with crazy numbers and stock starts going up, then around last week of July when TSLA rose to around $260, and knowing that there is no robotaxi, Musk panicked and again changed the date to Oct 10. Stock tanks down to about $190 in August and then as Oct 10 approaches, same hype machine starts working, propelling stock to $260 by Oct 1. Finally, Oct 10 came and Elon finally sang the song again “Robotaxis are coming, Robotaxis are coming in 2026, Robotaxis are coming certainly before 2027”. And, he showed a 2-seater toy car as future robotaxi! Only, 2% cars sold in US are 2-seaters!! Finally, some analysts are calling the bluff, with Adam Jonas writing “That’s it”? \n\nI wonder why people have been believing this BS for years and spiking TSLA stock each time, when all experts have said that all TSLA has is level 2 driver assistance system, but not FSD as Tesla blatantly continue to lie. You need a combination of LIDAR, Cameras and radars to have level 4 or level 5, fully self driving system while Tesla uses only cameras.\n\nWaymo already operates more than 100,000 paid trips per week through its 700+ driverless robotaxis in cities like San Francisco, Phoenix etc! Scary thing for Tesla investors is that NVDA is also working on driverless robotaxis and humanoid robots and per Jensen, they’re doing pretty good at both products!", "id": "1g2d63z", "created_utc": 1728777308.0, "score": 0, "upvote_ratio": 0.49, "num_comments": 100, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 8 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 81 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Why can’t we just get decent fucking public transportation.", "score": 84, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Well, I, for one, would NEVER hope you get hit by a bus.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}]}, {"body": "Sir this is wendys", "score": 3, "replies": []}, {"body": "People want to show off to their friends by summoning their cars, and I would just call an Uber.", "score": 1, "replies": []}, {"body": "It’ll cut towards the profits of the auto industry. And they’re not exactly as profitable as before so there’s even more an incentive to make sure everyone gets a personal vehicle", "score": 1, "replies": [{"body": "I understand, but I couldn’t care less about corporate profits. Auto manufacturers robbed many cities of public transportation years ago so fuck ‘em.", "score": 3, "replies": [{"body": "The auto industry is a huge deal in places like where I’m from in the mid-west. It’s literally a political battleground. They may be providing jobs for many people but they’re also costing us good cheap public transportation", "score": 0, "replies": [{"body": "Yeah…", "score": 1, "replies": []}]}]}]}, {"body": "I'm guessing there's no money at it specifically?\n\nAnd in todays worlds something need to earn money specifically or its not worth it.\n\nIt's like there's no correlation thinking and long-term thinking anymore.", "score": 0, "replies": [{"body": "how come theres money for it everywhere except america?", "score": 4, "replies": [{"body": "Neoliberalism did a number on Murica. Now everything needs to be profitable just to exist including what used to be considered a public good. This means market failure for anything but the most profitable of ventures", "score": 6, "replies": [{"body": "some country its actually not profitable, atleast directly", "score": 2, "replies": [{"body": "Yeah but it’s considered a public good that supports the economy by allowing industry to  be indirectly  subsidized through government funded infrastructure. How do workers get to their jobs? Public funded roads that’s free to use for anyone with a vehicle", "score": 3, "replies": []}]}]}, {"body": "Because America is a vastly different country geographically and more importantly the populations live differently. Majority of countries with lots public transport have most of their population living in urban areas/cities close together, and most Americans live in suburban areas", "score": -4, "replies": [{"body": "china has both though.", "score": 7, "replies": [{"body": "Chinas infrastructure is made out of chalk and funded by America and the rest of the world. The government also keeps all the profit. We did the same thing 60 years ago, then our govt was infiltrated by the CIA and we are now helping china catch up", "score": -6, "replies": [{"body": "we dont give china money and their infrastructure has lasted longer than ours.", "score": 3, "replies": [{"body": "Where do you think your money goes when you buy something that’s made in china?(everything) \n\nTheir infrastructure is constantly failing lol what are you saying. This isn’t subjective", "score": -4, "replies": [{"body": "trade deficits arent the same as giving money away.\n\ntheir infrastructure is fine so far, ours is the one that’s constantly failing.", "score": 4, "replies": []}, {"body": "Where do you even get your information from? Let me guess you’re some trailer dwelling hick from the rust belt who’ve never been anywhere", "score": 1, "replies": []}]}]}, {"body": "This is catching up lol. Where in America can you find this? New York? I’ve been to that rat infested trash heap. It doesn’t compare \n\nCope much? \n> https://youtu.be/MAiltiE8tgI?si=am3Mf-g9PPlrndN2", "score": 1, "replies": []}]}]}, {"body": "This argument doesn't hold on east and west coasts. You can connect Philly, NY, Boston and Hartford together. There's alot of people traveling between those cities for work and high speed rail would help immensely. Also amtrak sucks ass.", "score": 2, "replies": [{"body": "That makes sense. Those cities should do it then. Does not need to be a state level or federal thing at all", "score": 1, "replies": []}, {"body": "philly here.  we don't want to be connected to any of them.  we don't even like being connected to camden.", "score": 1, "replies": []}]}]}]}, {"body": "That’s because you’ve adopted neoliberal capitalist practices and now you’re fucked", "score": 2, "replies": []}]}, {"body": "You have to build dense cities for public transportation to make sense.  Once you build dense cities, then you get the public transportation.", "score": -3, "replies": [{"body": "They are plenty dense for public transportation. More cars, more highways only cause more congestion.", "score": 1, "replies": []}, {"body": "America doesn’t have cities? Didn’t know that", "score": 0, "replies": []}]}, {"body": "Because no one fucking uses public transportation even if it’s available. It’s extremely unprofitable", "score": -11, "replies": [{"body": "It’s not supposed to be profitable you stooge. That’s why it’s public.", "score": 11, "replies": [{"body": "Well that’s just one of the reasons why private companies aren’t interested in it anymore. Too much competition. \n\nIt’s amazing that we even fund the public transport that we do for the 8 people that ride it. In most cases in America it’s highly impractical and has limited use cases", "score": -4, "replies": [{"body": "Private companies have taken over public utilities in plenty of areas. In every case the quality of the product goes down and cost goes up. This isn’t me saying private is inherently bad, just that some things, like subways and railroads and power lines, do better as public goods subsidized by taxes and affordable because there is no profit incentive.", "score": 1, "replies": [{"body": "Yea I agree 100%. I’m not against public transport, but the Maine strategy to get more seems to urbanize everywhere so people are forced into needing it. People want it federally funded instead of locally in each city", "score": 1, "replies": []}]}]}]}, {"body": "Except in New York. And Europe.", "score": 9, "replies": [{"body": "Europe is one big city/urban center. \n\nThere’s very good reasons why public transport isn’t huge in America and it’s not lobbying or because car companies forced it to be that way \n\nIt’s hugely impractical in lots of areas and absolutely just not profitable at all. There’s a reason why street cars got phased out. Ride a bus if you want", "score": -5, "replies": [{"body": "Well, I, for one, would NEVER hope you get hit by a bus.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}, {"body": "More than 21 million paid subway trips last week in nyc. Millions more rode buses.", "score": 3, "replies": [{"body": "And that’s the best use of it. Not sure why everyone wants every square inch of America covered by public transport. Where it’s needed it’s already established and used. \n\nIt’s almost like public transport is for cities and majority of americas land mass is undeveloped or sub urban/rural. \n\n5% of americas land is cities/urban, Europe is 22%", "score": 1, "replies": [{"body": "[80% of Americans live in urban America.](https://www.census.gov/programs-surveys/geography/guidance/geo-areas/urban-rural/2020-ua-facts.html)", "score": 3, "replies": [{"body": "This statistic is skewed because the government doesn’t define suburban. So it’s either rural or urban, and I’m pretty sure the definition/cut off for urban/ city is a population greater than 10,000. Which is insane", "score": 2, "replies": [{"body": "20% of the country lives in 100 cities. About 60% of the country lives within metropolitan areas of those cities. 20% live in the rest of the country. The US is an urban country.", "score": 2, "replies": []}]}]}]}, {"body": "And isn't the MTA projecting a 1 billion~ deficit?", "score": 1, "replies": []}]}, {"body": "It should be free. And how will we pay for it? With taxes we already pay. Prioritize it instead of the 50 other things they waste money on like inflated police budgets.\n\nAlso this isn’t remotely true. Feel free to look up the statistics on the commuter trains that we do have.", "score": 1, "replies": [{"body": "If it’s publicly funded obviously it should be free. Still dosnt mean it’s a huge waste of tax money if it’s not being used. The only places it should be used is in dense cities, which is already the case in most US cities", "score": 1, "replies": []}]}]}]}, {"body": "You guys remember the game of thrones south park where scott malkinson almost dies because geroge rr martin keeps telling him the pizzas almost here", "score": 11, "replies": []}, {"body": "As someone who drives a Tesla and had his FSD, there is no fucking way I’m getting in one with no steering wheel. FSD is not very good and with no ability to correct the car, I think people are going to die. I sleep easy knowing he will never get this done.", "score": 10, "replies": [{"body": "You have FSD and don’t think it’ll get there? It’s pretty incredible in my experience.", "score": 1, "replies": [{"body": "I had the free trial for about 3 months. He gave it out to everyone. It’s great on the highway, but it tried to drive me into things and was definitely super close to curbing my rims in the city. I have the x plaid and I suppose my meh attitude has to do with the fact that my steering wheel vegan leather is peeling off, not under warranty, I have the yoke steering wheel, cant buy an aftermarket cover, cost to fix is $1600; all the seals on the front doors are falling off; I’ve had to replace my tires 3 times due to the way telsa designed the suspension; broke a windshield once( the whole roof is glass) $1200. Idk, everytime I look at it I kick myself for not buying a Mercedes. It is crazy fast though. Like insanely fast. So I guess that makes up for being put together like ass.?", "score": 6, "replies": [{"body": "Ah… sorry mate, don’t have the yoke and haven’t needed serious repairs (fingers crossed). Isn’t that kinda within range for windshield replacement? I live in a complicated city to drive and fsd does well, but could see it getting much better.", "score": 1, "replies": []}]}]}]}, {"body": "It’s not coming. Tesla is level 2  autonomous. It needs to be at 5. They have been level 2 for years.", "score": 9, "replies": []}, {"body": "The man who buys Twitter, turns it into a hub of misinformation and hate speech, forcing his biggest advertisers to pull out, to which he formally responds with, \"Go fuck yourself.\" This a child with a cheque book.", "score": 4, "replies": []}, {"body": "TL;DR", "score": 5, "replies": []}, {"body": "Look you can pay us 1000 a month to get the same amount of rides as your 399 Camry lease?  Deal?", "score": 4, "replies": []}, {"body": "Yea it's unbelievable how so many analysts hyped this crap. The whole concept doesn't make any sense. But it had to be proven to be a farce. Reminds me of flat earthers.", "score": 6, "replies": []}, {"body": "This is gambling sir , lose or win , we are here to gamble .", "score": 2, "replies": []}, {"body": "OK", "score": 3, "replies": []}, {"body": "Thank god.  I just recently riding with a drunk Lyft driver  who had obviously wrecked his car just prior to picking me up.  It smelled like anti-freeze and there no headlights even though it was night.", "score": 2, "replies": []}, {"body": "Is it a buy thesis?", "score": 1, "replies": []}, {"body": "It's a bus, but worse", "score": 1, "replies": [{"body": "Well, I, for one, would NEVER hope you get hit by a bus.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": [{"body": "Bad bot", "score": 1, "replies": []}, {"body": "Bad bot", "score": 1, "replies": []}]}]}, {"body": "I sold long ago", "score": 1, "replies": []}, {"body": "So puts on everything else taxi, lyft or uber…?", "score": 1, "replies": []}, {"body": "If they can't even get trains to function without a driver, the chances of doing so with cars are under zero.", "score": 1, "replies": []}, {"body": "Winter is coming my boiz", "score": 1, "replies": []}, {"body": "Just get the Optimus robot to drive the car.", "score": 1, "replies": []}, {"body": "Let’s say robotaxis are here today. Right now all the taxis in nyc are like Toyota minivans and ford escapes. If Tesla magically takes all that business why should the Tesla stock go up - Toyota and ford are each worth a fraction of Tesla?  Also more taxis means fewer cars it’s not great to make the sales pie smaller ( though probably great for society) ", "score": 1, "replies": []}, {"body": "As of 2024 there are 44 verified TSLA autopilot deaths and counting.  \nRobotaxis... call it a literal death trap, no thank you.\n\nhttps://en.wikipedia.org/wiki/List\\_of\\_Tesla\\_Autopilot\\_crashes#:\\~:text=As%20of%20June%202024%2C%20there,and%20hundreds%20of%20nonfatal%20incidents.", "score": 1, "replies": []}, {"body": "Leon made impossible things possible by inspiring young minds to work for his companies and innovate, at time without even proper compensation.\n\nToday Leon is powered by ketamine, knee deep into local politics and shit, stock pumping, crypto pumping, geopolitics , gender shit and so on.\n\nDefinitely not inspiring as before.", "score": 1, "replies": []}, {"body": "What’s the difference between Waymo and Tesla robotaxis? Why do people act like this is new?", "score": 1, "replies": [{"body": "Car cost", "score": 2, "replies": []}, {"body": "Because it’s Elon musks product they throw a hissy fit like a bunch of children. They couldn’t name a difference between Tesla robotaxis and waymo", "score": 0, "replies": [{"body": "One has a large fleet in operation generating income, the other does not. No one needs educating on which one Elon Skum is behind.", "score": 0, "replies": []}]}]}, {"body": "Robotics engineer here.  Vision can get almost the same results as lidar IF you develop it correctly. LiDAR is kinda like the quick and dirty method to get the results you want but it’s expensive. Waymo is not even close to profitable and I’m sure the vehicles cost $100k+. If Tesla can deliver similar performance at $30k, Waymo is over.", "score": -1, "replies": [{"body": "Almost doesn’t cut it.", "score": 2, "replies": [{"body": "I say almost because lidar is superior to even human senses and we get by without it.", "score": 1, "replies": [{"body": "I could go on and on about this but we really aren’t ‘getting by’ in the US on human senses-based driving. Our motor vehicle traffic death rate is way higher than any comparable advanced economy. Purely from a BCA perspective, the marginal gain in safety (marginal decrease in excess deaths) from using LiDAR is worth the cost.", "score": 1, "replies": [{"body": "That has nothing to do with senses, it deals with human processing, experiences, and distractions. Our senses are perfectly fine for driving.", "score": 1, "replies": [{"body": "In this incredibly pedantic framing of the argument, what you’re saying about LiDAR being unnecessary still falls apart. The camera is not the inadequate component in the AV system, it’s the ‘processing, experiences, and distractions’ aka the model. The workaround for trying to make a rigid model solve a general problem is to throw more complete data at it, aka LiDAR, or any other addition to the sensor suite. The solution is NOT to use fewer sensors and try to ‘make model more good’.", "score": 1, "replies": [{"body": "I don’t think it’s pedantic at all, your argument is mostly around compute which has nothing to do with the sensor type. They are two very different problems to solve in robotics.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Dude, looks like you didn’t get the wake up cal, may be your cell ran out of battery😀 \n\nTesla is at level 2 autonomous car with hardware that doesn’t even support getting to level 5. Waymo is already operating 100,000 rides a week, that’s about 5,200,000 or 5.2 million rides a year and it’s growing fast. You probably know that Technology takes years to generate profits. \n\nEven if you still believe Elon on his word, Tesla is at least couple of years from robotaxi, though he started saying “robotaxi coming next year” in 2014 By that time, Waymo would be over 25 million rides/year. And, NVDA might come up with its own robotaxi and license it to traditional car manufacturers.", "score": 2, "replies": [{"body": "Waymo could have 1m rides a week and they still wouldn’t be profitable. Their cars and tech stack are too expensive. Tesla robotaxi will be profitable right out the gate for Tesla and whoever buys them. And when the taxi drops it’s going to be L5 or they wouldn’t be able to release it.", "score": 0, "replies": []}]}, {"body": "Yeah. LOL why not say $5 while we're throwing out imaginary numbers. I can get rich as long as I do everything perfectly in my business and don't make any mistakes.  And I can do it 50x cheaper than all my competitors.", "score": 2, "replies": [{"body": "The 4 Lidar sensors themselves cost $40k… car is easily $100k+.", "score": 1, "replies": []}]}, {"body": "LIDAR units are around $500 now and projected to be less than half that by the time the Cybercab makes it to production.  And, there are loads of solid state (no moving parts) LIDAR units coming.  Those will be as cheap as optical cameras soon.", "score": 1, "replies": [{"body": "I’m sorry but they aren’t reducing the cost of industrial Lidar units like Waymo uses by 95% in 2 years. Waymo won’t see profitability for 5-10 years at a minimum.", "score": 1, "replies": [{"body": "Even Tesla said the units they priced from Luminar were $1,000 in quantity.\n\nWaymo is very unlikely to be using $10,000 units very far into the future.", "score": 1, "replies": [{"body": "Even if they do get the price sub $1k. They still can’t compete on cost with Tesla. Tesla is completely vertically integrated. Waymo is buying 100% of its cars and sensing HW from other companies. Every car that comes off the line at Tesla makes them money.  The more robotaxis out there the longer waymos ROI will be per car.", "score": 0, "replies": [{"body": "Except Waymo exists and works.", "score": 2, "replies": [{"body": "I mean yeah, this was a discussion based on the solution. Burden is on them to deliver.", "score": 1, "replies": [{"body": "By the time you see Cybercab anywhere, Waymo will be different, far cheaper, and far better than it is now, even.\n\nAs far as vertical integration, Google can buy any number of hardware manufacturers, all the way up to even Toyota, if that makes sense for them.  Personally, I think acquiring Polestar would be the best move.  When the time is right.", "score": 1, "replies": [{"body": "Maybe, I dont see a path to reducing costs that much since they are buying everything off the shelf, unless they reduce the amount of sensors they use. I think they take the route where they only care about expanding their revenue instead of chasing profits. Similar to Amazons old strategy. Polestar or Rivian would be solid buys.", "score": 1, "replies": [{"body": "They wouldn't be buying everything off the shelf by buying up the suppliers.\n\nAmazon and Google both have a history of doing this anyways.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "1: Point clouds of LIDAR and Images should have the same underlining implicit representation.\n\nFor example, to construct a 3d point cloud of objects, people can use multiple-views for NERF.\n\nSo it should not be difficult to integrate LIDAR if sufficient advanced Vision model for Tesla car is developed.\n\n2: Tesla cars have multiple views of scenes, given the sheer amount of cameras.\n\n3: Given LIDAR technology is cheap enough, Tesla can convert these MV into 3D scenes.\n\nMillions of cars still win 750 data-collecting vans at the end. Fr, they can start chunking out HD-maps automatically using the data obtaining from millions of cars.\n\nYou are a robotic engineer; you should know much of the inner-working of these techniques than me. It's just my opinion.", "score": 1, "replies": [{"body": "LiDAR is mostly used because it uses very low compute and gives precise distance data without the overhead of interpretation. Vision can do everything and more when it’s developed right. The problem is, no company besides tesla is all on board. Vision is very very hard, but getting easier over time. LiDAR is just a stop gap along the journey.", "score": 2, "replies": [{"body": "Ye man. I also believe the same thing because us - humans design streets that our eyes are sufficient to drive. \n\nI just cannot understand how Tesla can lose the LiDAR race if LiDAR devices become cheap due to the existence of Neural Radiance Fields (NeRF).\n\nDef: A neural radiance field is a method based on deep learning for reconstructing a three-dimensional representation of a scene from two-dimensional images.\n\nIt can make HD-maps that Waymo uses from millions of cars if it invests in Images-to-HDMaps deep learning models.\n\ntl;dr can't lose with millions of cars out there to collect data. they are swimming in gold.", "score": 1, "replies": [{"body": "There’s plenty of semantic segmentation applications out there now they you would have no idea a stereo camera could make vs a LiDAR. Things are progressing really fast in visual sensing.  My position will remain that LiDAR is great for quick  and accurate object detection but it’s not the future unless prices drop 90%.", "score": 1, "replies": []}]}]}]}]}, {"body": "Major copium, didn't even read this. Sorry you lost in telsa stock, or fuck you for making gains. One of those two", "score": -1, "replies": []}]}
