{"title": "Equity Returns Across Recessions", "selftext": "This is a summary of an excerpt of some firm-wide DD sent out last week from Morgan Stanley. Thought this would be useful for you guys but let me know if this is too abstract. Can post excerpts from research daily if there is interest. \n\nThe worst performance for most industry groups has tended to come in the \\~3 month period after the start of the recession, with significant widening in returns thereafter. \n\n* Persistent Outperformance: Health Care & Staples\n   * Food/Beverage/Tobacco, Health Care Equipment + Services, Pharma/Biotech/LS tend to perform on an absolute and relative basis. Household/PP/Software/Utilities show relative outperformance with a significantly greater variance. \n* Persistent Underperformance: Autos & Tech Hardware \n   * Strong tendency to continue weakening through recessions. Capital Goods, Materials, M/E, & Telco show the same trend but to a less extent. \n* Rebound: Consumer Discretionary\n   * CD/Apparel, CS, and Retailing have a tendency to show solid rebounds in relative performance starting a few months after recessions begin. CS and Transportation show similar patterns, but have generally stronger performance through the entire recession. \n* Sizes & Styles: Avoid Junk and Lean Defensive\n   * Junk displays consistently poor performance after the start of a recession (mods r gay and even they would know this). Defensives tend to outperform cyclicals, but Telecom and Utilities (which traditionally are defensive) did not display as strong a tendency to outperform.", "id": "cwt2zl", "created_utc": 1567036948.0, "score": 54, "upvote_ratio": 0.93, "num_comments": 44, "comments": [{"body": "What does Morgan Stanley define as the start of a recession? The day after GDP is reported as having contracted two quarters in a row? The first day of the quarter which has negative growth? The last day of the 2nd consecutive quarter before government reports confirm the recession?\n\nAlso how did bonds compare vs outperform sectors?", "score": 22, "replies": [{"body": "It classifies it the same way as the general public: GDP falling in two successive quarters.\nI can't tell you off the top of my head about bond performance but I can tell you that prices have gone up a fairly absurd amount (because of rate cut obviously) and the banker who I work for (trades ~150k in FI daily) has not found a bond that he is comfortable bidding on in a week. Not sure how useful that is lol", "score": 11, "replies": [{"body": "Lol 150k in fixed income per day? What does he manage like 3 accounts?", "score": 13, "replies": [{"body": "Yeah he just hits ALLQ all day for odd lot garbage and pretends he’s an economist. Obviously.", "score": 9, "replies": []}]}, {"body": "I understand the classification. The question is when it starts measuring. Is this assuming us to be predictive (i.e. start measuring before government GDP reports confirm 2 quarters) or reactive (I.e. numbers are in, we're in a recession)? \n\nIt matters a lot whether the report suggests moving now if you suspect vs ignoring everything until Uncle Sam tells you shit stinks.", "score": 5, "replies": [{"body": "Very very important classification you are 200% right. MS used a predictive model for this report.", "score": 4, "replies": []}]}, {"body": "While two consecutive quarters of negative growth are the usual rule of thumb, actual recession start and end dates are officially determined by the US National Bureau of Economic Research (NBER).", "score": 1, "replies": []}]}, {"body": "The National Bureau of Economic Research declares an official recession after two negative quarters.", "score": 1, "replies": []}, {"body": "While two consecutive quarters of negative growth are the usual rule of thumb, actual recession start and end dates are officially determined by the US National Bureau of Economic Research (NBER).", "score": 1, "replies": []}]}, {"body": "Mods love junk displays", "score": 10, "replies": []}, {"body": "It says Health care outperforms but it will still take a 50% hit in prices though right?", "score": 7, "replies": [{"body": "Enough people continue taking medicine during  economic droughts that it doesn't impact pharma much. It'll dip along with everything else but not as drastically, and it picks up in the near term as money floods into it along with other defensive stocks.\n\nTLDR : Buy the pharma dip cuz people ain't too broke to die...usually.", "score": 16, "replies": [{"body": "Unless Bernie or someone gets in.  Then pharma is fucked.  That has nothing to do with recessions though.", "score": 6, "replies": [{"body": "Bernie wouldn’t be able to get shit through Congress if he was elected. Healthcare is one of the few sectors that looks relatively cheap.", "score": 7, "replies": [{"body": "Obamacare just barely passed through a Democratically-controlled Congress...then again we live in an era of New Socialism.", "score": -3, "replies": []}]}]}, {"body": "They have like 5000% + or - 5000% margins on their drugs so they'll still make a killing.\n\n\nSource: I worked for health care doing analytics on drug supplies (contracting)", "score": 6, "replies": [{"body": "TIL margins over 100% were possible. What sort of analyst were you again?", "score": 6, "replies": [{"body": "if it costs $1 to make and u sell it at $2 thats 100% margin. if it costs $1 to make and you sell it for $1000 thats far above 100% margin", "score": 2, "replies": [{"body": "Not sure if you're trolling or retarded. But you are talking about markup, not margin. In your first example, that's 100% markup but 50% margin. Your second example is 99.9% margin.", "score": 1, "replies": []}]}, {"body": "Relative to expense I'm assuming", "score": 0, "replies": []}]}, {"body": "Any underrated pharma companies that you think are good to go long on?", "score": 1, "replies": []}]}, {"body": "Amen", "score": 3, "replies": []}]}]}, {"body": "2022 UNH calls, got it", "score": 4, "replies": [{"body": "If the next elected president is democrat you can say goodbye to that portfolio", "score": 7, "replies": [{"body": "Thanks Mr Sanders", "score": 2, "replies": [{"body": "I’d avoid UNH or health insurance all together but long but pharma, JNJ, Pfizer etc", "score": 2, "replies": []}]}]}]}, {"body": "Oh good, I will watch for CD's when it starts to rebound. Good heads up.", "score": 5, "replies": [{"body": "FYI I mean consumer discretionary here, not certificates of deposit - not sure if you realized that or not lol", "score": 6, "replies": [{"body": "Long compact discs, got it.", "score": 23, "replies": [{"body": "He meant collateral debts, moron. Haven't you seen the ~~Bible~~ movie?", "score": 3, "replies": []}, {"body": "Candy dicks, you idiot", "score": 3, "replies": []}]}, {"body": "I... did not. And looking back on it I now feel foolish.", "score": 3, "replies": []}]}]}, {"body": "Thanks.\n\nLong WEN!", "score": 5, "replies": []}, {"body": "just tell me what to buy", "score": 3, "replies": [{"body": "Buy AMD. That's always the answer.", "score": 6, "replies": []}]}, {"body": "Any chance of details?", "score": 1, "replies": [{"body": "In what sense? Don’t want to post anything that’s going to get me in trouble haha but abstractions of the material is AOK", "score": 5, "replies": [{"body": "Haha I mean like numbers and charts and stuff?", "score": 1, "replies": [{"body": "I'll scan those tomorrow and post them. Somebody uploaded the MS 'Recession Playbook' last week IIRC and that has the same data that I'm referencing.", "score": 8, "replies": [{"body": "Link?", "score": 3, "replies": []}]}]}]}]}, {"body": "Yes, please.", "score": 1, "replies": []}, {"body": "Similar report from Fidelity:  [https://institutional.fidelity.com/app/proxy/content?literatureURL=/953042.PDF](https://institutional.fidelity.com/app/proxy/content?literatureURL=/953042.PDF) \\-- Look at page 7, exhibit 5\n\nBetter to stick to health care & consumer staples during recession", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}
