{"title": "The opening of tomorrow and Russia’s invasion plan.", "selftext": "Hi everyone,\n\nI have decent experience in trading crypto, mostly made my money with it last year, and  want to switch to stocks and commodities since that whole boom is behind us. I keep myself busy with macro economics and the state of the economy for fun. This is what led me to invest in crypto early, seeing the rise of inflation and run up of the conjuncture cycle. \n\nLast year we have seen the absolute peak of a high conjuncture that was fueled by central banks calling the current inflation transitory. But with the start of this year (and a bit earlier) we have seen the reversal of the conjuncture. This means more dissatisfaction and less jobs, riots and more expensive products. The latter being an indicator of reaching a peak in the conjuncture cycle.\n\nWith the invasion plans being scheduled on coming Wednesday, I expect tomorrow to become a bloody red day. I had my hopes of avoiding the conflict because of the riot’s in russia’s border country Kazakstan. But i’m pretty sure that the pride of Vladimir is so big that he won’t back down of Ukraine. \n\nThis is the reason I am going to hedge my crypto with some investments in oil and gas this afternoon, as I see a rise in oil prices being more likely than tech and crypto doing good. With this I am also considering option trading with a small amount of money which I can afford to lose. \n\nHow are you guys going to handle upcoming weeks? And since I am not super experienced like most of the people on this sub, I am open for your opinions and advice. :)", "id": "srduf2", "created_utc": 1644740244.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 76, "comments": [{"body": "A reminder to everyone, please focus on how this is going to affect a specific stock or the stock market in general.\n\nIf your comment is pushing political agendas, memes, insults, trolling, etc then your comment is going to get removed and/or get you banned.\n\nIf you *have* to discuss just the politics, then post this topic to r/PoliticalDiscussion without linking back to r/stocks, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "That first sentence is gold.", "score": 38, "replies": [{"body": "And so is the last sentence", "score": 17, "replies": []}, {"body": "It's cryptographic currency aka digital gold , not real gold", "score": 2, "replies": []}, {"body": "Barrick Gold and Kinross Gold wend up something like 6-7.5% on the last Friday. \n\nHigh volume in US stock: [https://www.investing.com/equities/barrick-gold-corp](https://www.investing.com/equities/barrick-gold-corp).\n\nCoincidence? I don't think so. Whale buying.", "score": 1, "replies": [{"body": "Ok, who asked?", "score": 2, "replies": [{"body": "that was a comment related to the gold, not the answer to the question", "score": 2, "replies": [{"body": "My bad", "score": 2, "replies": []}]}]}]}, {"body": "Yeah i understand what it says, i meant it differently though. I edited it for you :)", "score": -7, "replies": []}]}, {"body": "I’m super simplified, I buy my companies when they trade at a low P/E, good luck with the oil thing! I hope it plays well for you brother! I’ll be watching from the sidelines", "score": 12, "replies": []}, {"body": "Nothing will happen. I'm here in Poland and our Company dep. is in Ukraine and this whole action is like to pump oil and dump other stocks.\nSame case like with omicron...", "score": 17, "replies": [{"body": "Friday, I asked my coworkers in Kiev if they wanted to reschedule a meeting we have in about twenty-one hours (I think 9am Monday morning their time), and they seemed confused as to why I would ask. Possible invasion wasn't even on their minds. I asked how grocery stores were holding up since I know they've had trouble with stock at the two closest ones to the office, and one guy said they were better stocked than usual. People aren't even panic-buying bread and milk like they would for bad snowstorm. They aren't worried.", "score": 17, "replies": []}, {"body": "He’s mobilized troops.. which costs a lot of money.\n\nI really doubt he’s bluffing at this point.", "score": -4, "replies": [{"body": "An actual war is much more costly.", "score": 8, "replies": [{"body": "Here’s hoping it’s a bluff.\n\nEither way he’s fucked.", "score": 1, "replies": []}]}, {"body": "I’ve been in the military since the early 2000s. Putin has done this to every President we’ve had in that time. I would be surprised if this amounts to anything", "score": 6, "replies": [{"body": "So far so good. Had your thoughts shifted since? Mine got less optimistic", "score": 2, "replies": [{"body": "I watched Biden’s address to the nation on Friday. He said he won’t commit troops to a fight and would enact the toughest sanctions in history. Same song, different President. I’m not drafting a will, nor am I packing a seabag.", "score": 1, "replies": [{"body": "Yeah I'm not 'concerned' about US involvement. Oil prices are probably the most global concern, ignoring loss of human life in Ukraine/Russia.", "score": 2, "replies": []}]}]}, {"body": "That didn’t age so well did it.", "score": 2, "replies": [{"body": "No, no it did not. I was definitely 100% wrong on that one.", "score": 2, "replies": [{"body": "I would lol but for the subject…", "score": 2, "replies": [{"body": "Yeah, it’s pretty shitty", "score": 1, "replies": [{"body": "I trusted you!!!", "score": 2, "replies": [{"body": "Let this be a lesson in trusting strangers on Reddit", "score": 1, "replies": []}]}]}]}]}]}, {"body": "!RemindMe 1 week", "score": 1, "replies": [{"body": "Bold of you to only give this one week", "score": 1, "replies": [{"body": "My guess is if anything happens, its now, not later, so just wanna see. I hope you are right of course.", "score": 1, "replies": [{"body": "When this stuff started popping off, I was worried. I’m personally tired of being sent all over fucking planet for stupid reasons, but the more I read on this, the less concerned I am. It’s déjà vu.", "score": 1, "replies": []}]}]}]}]}, {"body": "The question to me is, is Russia at the start of an invasion of Ukraine or in the middle of mugging Ukraine?  If you are mugging someone you bring a weapon to show you aren't bluffing, but ideally you won't have to do more than threaten with it.", "score": 2, "replies": []}, {"body": "I see this often, but no numbers. How much does it cost then?", "score": 0, "replies": [{"body": "Nobody outside of top level Russian leadership can answer to any degree of certainty. Rule of thumb, prepositioning technical assets and equipment is relatively cheap within the country. Manning that equipment by moving troops from other military districts is more expensive but stil not too much. Logistic trains and rotary aircraft forward deployment is very expensive. Fixed wing aircraft forward positioning and troops moving up to the border and dispersing is a clear sign they're committed to launch an attack in very short time unless Ukraine or NATO basically capitulates to their demands. This is ignoring a lot of nuances (navy, artillery, etc.), just illustrating the point here.", "score": 4, "replies": []}, {"body": "The US civil war cost $3.5 million dollars / day in 1865. Russian tanks are a lot more expensive to feed than mules.", "score": 2, "replies": [{"body": "Didn't knew that you have to feed a tank. You learn new things every day.", "score": 1, "replies": []}]}, {"body": "Millions. It’s not cheap.\n\nI want him to bluff to be honest with you.", "score": 1, "replies": []}]}]}, {"body": "Well in that case the result will be the same no? A higher oil price.", "score": -1, "replies": [{"body": "Yeah, in my opinion we will see nice cash flow from energy sector again to tech. Big pump, inflation down, rates still 0.", "score": 2, "replies": [{"body": "Well rates won’t be zero. Thats a given, but it would be a nice future if this happens. As i said with conjuncture cycle trading you always see tech booming in a run up to a high conjuncture, but now with the switch it will be up to commodities and energy again.", "score": 3, "replies": [{"body": "For sure but I think that we will hit one last pump and then all in energy with oil over $150", "score": 1, "replies": []}]}]}]}]}, {"body": "So far my plan is to wait on the sidelines with cash. I'm looking for opportunities and dips to buy.", "score": 10, "replies": [{"body": "This is also one of my options, I’ll try and wait Monday out to see what’s happening and respond to that.", "score": 1, "replies": []}]}, {"body": "Russia : Launch the Nukes!!! And send the population to shelters.\n\nr/stocks : We have 15 minutes to buy the dip guyz!\n\nr/wallstreetbets : It's just an evil hedge fund manager ploy and big bank propaganda. Hodl boyz!", "score": 4, "replies": [{"body": "/r/bogleheads: What’s happening in Ukraine? I don’t watch the news.", "score": 6, "replies": [{"body": "/r/dividends: My monthly 65 cents came in, so i don't need to panic like everyone else currently is.", "score": 4, "replies": []}, {"body": "r/tldr\n\nSituation: Russia prepositioned to militarily intervene/invade if they don't get hard guarantees Ukraine doesn't join NATO. USA ready to fight to the last Ukrainian (will impose sanctions etc. but will not fight directly) and open about it. Ukrainians hanging in the wind without much options. Major EU members give even less fuqs about Ukraine, just can't say so openly. Baltics and Polish hawkish as usual, but just because they know talk is cheap. Ah yeah China has zero intentions to put pressure on Russia, more like passively supportive. \n\nBest outcome: Russia says nothing ever happened and backs down.\n\nLikely outcome: Either Ukraine gives in to demands or they get their country half-invaded and a new puppet state created.\n\nWorst outcome(highly unlikely): Someone somewhere fcks up and someone else somewhere nervously overreacts and we all get fried in nuclear fires and some of us frozen in nuclear winter. Time for civilization 2.0 if lucky.\n\n\nEdit: Khm! Khm!", "score": 1, "replies": [{"body": "/r/woosh", "score": 2, "replies": [{"body": "Made a poor attempt of coughing while farting.", "score": 1, "replies": []}]}]}]}]}, {"body": "XLE is the plan", "score": 5, "replies": [{"body": "Why choose this over crude oil?", "score": 1, "replies": [{"body": "which crude oil stocks? XLE is an ETF that tracks oil companies in the S&P 500. CVX & XOM are their two top % weights", "score": 2, "replies": [{"body": "I don’t get the downvotes on this sub, i ask questions… i get downvoted… am i doing something wrong here?", "score": 7, "replies": [{"body": "Focus on answers and discussion. Downvotes are meaningless.", "score": 7, "replies": []}]}, {"body": "Allright so i take it that it’s better to lean towards etf’s than direct oil stocks? Like ARC or WLL", "score": 2, "replies": [{"body": "ARC? pick the oil majors BP, SHEL as I’m sure you know, CVX, XOM. An ETF like XLE or OIH gives you more broad exposure", "score": 3, "replies": [{"body": "Allright, this is comment alone was worth the post. Thank you man, I will :)", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Just buy puts of the Russia an Oekraïne banks and your good", "score": 2, "replies": [{"body": "Sberbank already down 20% , but I think you’re right, there is much more downside", "score": 2, "replies": []}]}, {"body": "The plan is to buy 50 GTE leaps... Later this year they should procreate dollar bills!", "score": 2, "replies": [{"body": "Oh interesting, i can’t really find a dutch broker that sells those. I like the risk reward play there!", "score": 1, "replies": []}]}, {"body": "If you’re looking to play the Ukraine-Russia conflict, instead of oil/gas stocks, buy /CLH22 futures. (WTI Crude Oil March ‘22). Profit would be much more pronounced than playing oil/gas stocks. \n\nOf course, you’re playing with insane leverage (1000:1 in this case) so you would need to set very tight stop losses if something goes wrong.", "score": 2, "replies": [{"body": "Yeah that would be an awesome trade. But as i said, not very experienced with these markets so i’ll start of slow. Thanks for the tip anyways ;)", "score": 1, "replies": []}]}, {"body": "Gazprom", "score": 2, "replies": []}, {"body": "Bought my oil and natural gas stocks when Brandon cancelled Keystone pipeline and Arctic drilling. Those stickers on the pumps were calling to you.", "score": 3, "replies": [{"body": "Cue the \"I did that\" sticker.", "score": 2, "replies": []}]}, {"body": "I am going to put more in an energy ETF (XLE)…..as oil prices rise above $100.", "score": 1, "replies": [{"body": "Yeah I started a position in XLE on Friday. Not sure if I’m long or swinging yet…", "score": 1, "replies": []}]}, {"body": "If Russia invades I think it will be short-lived and limited to extreme eastern Ukraine. People will freak out and we will see temporary reflections of this in markets. Just a bump in the road, not the first or last time we experience one.", "score": 1, "replies": []}, {"body": "Just buy VTI.", "score": 1, "replies": []}, {"body": "Gold bounced. May see a rally if if continues to pushup or bounces down a little and reconfirms support.", "score": 1, "replies": []}]}
{"title": "Probably more like a WSB strategy but I want to hear if Im wrong or your points", "selftext": "Edit : so ... basically its a credit spread only with unrralized losses , I finally got it , thanks guys and sorry \n\n\n\nLets suppose that I see AMD falling further in the next two weeks ( I really dont know its just an example) but well, I dont want to blow up my account or risking 100% of my investment by buying only puts, but at the same time even if I sell covered calls the unrealized loss will be higher (or at least Im expecting) than my premium.\n\nI really dont know if it has a name , probably has , Im still new to this, but what if I sell a cash secured put and then at the next strike price buy a put, probably lower if I want the credit of the trade be larger but the transaction more riskier.\n\nExample: lets say that I have the money to buy 100 stocks of amd at the current strike price ( lets say 100$ each for the sake of the example ) but even if I want to buy the stock I see a dip incoming so I sell at 95$ my cash secured put and at the same time I buy a put at 94$ the premium its 3 for the first one and 2.95 for the second one.\n\nThe credit of this transaction its almost nothing .5$ but Im technically covered to not losing money unless the price stays between 93.5 and 95 and the max loss would be .95$, the ratio loss/gain its pretty high but its still low comparing it with my total investment being.\n\nEdit:\n\nStocks bought( or money waiting to buy those shares until expiration), 95*100= 9500\n\n\n\nBuy put , 2.5* 100 = 250\n\n\n\nTotal investment, 250+9500 =9750\n\nMax loss, .95 *100= 95 \n\nPercentage lost, 95/9759 =.9% \n \nI would need over 50 bad trades in order to get my account into the 63% and a loss of 37% .\n\nOf course the credit its just .05% gain which its basically nothing \n\nBut here is the juicy stuff, technically I have a put that has the potential of unlimited gains now.\n\nIf the prices goes to 85$ and I didnt had the cash to cover my put that would had been a .9% loss(basically a credit spread) , but I did, so the put its still in the game with basically the price of .95 at 94$ so the formula for my gainz is:\n\n94-.95= 93.5 \n\n93.5-85= 8.5\n\n8.5*100 = 850 \n\n850/9750= 8.7% \n\nIts still not a lot but take into consideration that Im risking the .9% on every trade and if I feel like the stock will constantly go down little by little destroying my account I can at one poing simply assign the put I bought the moment it starts hitting the strike price.\n\nBasically gamble but with low risk .\n\nAm I missing something? did I fudge the numbers wrong? please help me it seems to good to be true.\n\n\nOf course this can be just reversed into calls and it would be the same.", "id": "srs834", "created_utc": 1644784385.0, "score": 18, "upvote_ratio": 0.68, "num_comments": 70, "comments": [{"body": "Longest explanation for the simplest strategy I've seen.  Congrats, you just discovered credit spreads.", "score": 80, "replies": [{"body": "Wait a week. They’ll arrive at ratio spreads soon enough", "score": 13, "replies": [{"body": "Buttt ratio spreads required naked positions, which aren’t suitable for most people", "score": 1, "replies": [{"body": "I’m guessing there is an implied /s there but this is Reddit so you never know", "score": 2, "replies": [{"body": "I wasn’t entirely sarcastic with mine. Ratios require naked positions which can be hard to get approved for and carry inherently more risk. While the risk isn’t too bad since you’re only short one or two contracts, it’s still there and requires high level options approval", "score": 2, "replies": [{"body": "It doesn’t require it. Depends on your ratio", "score": 2, "replies": [{"body": "I don’t usually use ratios so correct me if I’m wrong. \n\nIsn’t a ratio typically buying some number of options and then selling a greater number farther OTM. Ex: buying a call and selling two calls a few strikes farther otm. This would lead to a naked call being sold, correct?", "score": 1, "replies": [{"body": "Or go the other way. Buy 3, sell 2", "score": 2, "replies": [{"body": "Ah gotcha. I’ve always thought of ratios with the intent to receive a credit (or net 0 trade) instead of a debit. But that’s my theta mind speaking", "score": 2, "replies": [{"body": "Hey now Vega gang opens positions for a credit too", "score": 1, "replies": []}]}]}, {"body": "There’s long ratio and short ratios. If you have a debit spread that’s going underwater adding another long may help out your original position. Same as short ratio, if your short put is getting underwater, another short put maybe help it. But short ratios req more margin, long ratios do not. \n\nAnother example, I have a debit put spread and the stock dropped, I want more leverage - I would buy more long puts to my original strike and murder the hell out of the stock. Like I did BABA.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "It's actually kindof impressive that OP arrived at the conclusion.of credit.spreads completely on their own.ost of us just watch a YouTube video or read a blog post which explains credit spreads and how they work.\n\nOP logically thought through the credit spread strategy from scratch completely in isolation", "score": 5, "replies": []}, {"body": "The credit spread has limited gains , this doesnt, or at least I think lol", "score": -3, "replies": [{"body": "This is literally a credit spread. Whatever profit you make from the put you bought is canceled out by the loss from the put you sold.", "score": 10, "replies": [{"body": "No ... cause I canceled my put sold by buying the stock , thats why it has to be a cash secured put first", "score": -5, "replies": [{"body": "Since you sold the put, you don't choose when it gets excercised. The only thing you can do is buy the put back to close.\n\nIf you sold a put and buy 100 shares, them your put is exercised, you will be assigned another 100 shares and you will now have 200 shares.", "score": 10, "replies": [{"body": "Well I just ... you know , wait until the contract expires and I will have to buy them by contract.", "score": -1, "replies": [{"body": "If the put you bought is still there at expiration, it'll be excercised as well and you will sell them back by contract. \n\nThen you will realize the difference the difference between the 2 puts minus the credit you received as a loss.", "score": 2, "replies": [{"body": "No cause again I have the OPTION  of assign  it , and well I could just sell the put 1 hour before the contract expires or at the beggining of the last day , its only one so I still dont have problems of liquidity.\n\nAnd why would I wouldnt want to close all the positions and now I have only cash? There no more risk.", "score": -3, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Explain yourself why ?", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Well please help me lol", "score": 0, "replies": [{"body": "THE MOTHERFUCKER SPENT AN HOUR TELLING YOU", "score": 1, "replies": []}, {"body": "https://www.optionsprofitcalculator.com/\nPut your trade idea in here and report back. Once your further out of the money put strike is burst through, you’re at max loss, you don’t start making gains below that because your long put is just covering the losses of your short put. \nInthemoney on YouTube is the easiest to understand explainer that I’ve found, look up credit spreads, as far as I can tell that’s what you’re attempting to explain unless I’m missing something?", "score": 1, "replies": [{"body": "Yeah , its just what I saw ... either way thanks, btw those losses are unrealized so if you believe in the company you could still make money, or simply get back the money you lose with a ITM call and sell those shares.\n\nBut thanks nontheless.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You can also close both puts and buy 100 shares at $85. No matter what you decide to do, it doesn't change the fact that you had a spread and you are realizing max loss on that spread. The spread did its job and limited your loss to $95.", "score": 2, "replies": [{"body": "No ... cause Im obligated of buying them at 95 dollars by the put I sold and then IF I WANT sell them at 94 with the put I bought.", "score": 1, "replies": [{"body": "I see how you want to use it. The strategy is still called a spread no matter how you want to use it. The fact that you have enough money to cover assignment doesn't change the name of the strategy. If you decide to sell back the put you bought at the last minute, that will change your put credit spread into a cash secured put.", "score": 2, "replies": [{"body": "Yeah sorry I mean you still have your shares but the unrealized losses of this shares will be covered by the price of the option, sorry for being a little arrogant , but thats the mainly reason I posted this.\n\nVery helpful.", "score": 1, "replies": [{"body": "I'll keep your strategy in mind. Thanks for posting.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "yes, so now you are long stock at 95, and the price keeps dropping you are losing on the stock and gaining of the long put you still have", "score": 3, "replies": [{"body": "Well thats why its a problem when its between 95 and 93.5 , but even that only happens between 95 and 94 , below that I can assign both contracts .\n\nOr simpy dont do it and then with those shares sell an ITM call and wait expire it and get assigned and sell those shares", "score": 1, "replies": [{"body": "its a problem anywhere below 95 minus the credit", "score": 1, "replies": [{"body": "No cause I can assing my 94 strike price put that I bought and assign both contracts.\n\nWhich I wouldnt do it until its profitable until 93.05 , you still have the stock and then sell an ITM call to sell and recieve an extra premium\n\nEdit:\n exercise ... sorry but you get the point.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Why is anyone still responding to this post lol you all tried to help explain it but sometimes it’s just falling on deaf ears. Let’s all just say good luck and stop trying on this one", "score": 5, "replies": [{"body": "Im not , Im arguing with arguments ... tell me how this doesnt work ... like how do I lose money besides getting the price into 93.05 and 95", "score": 0, "replies": [{"body": "Just go papertrade it before you risk anything real please", "score": 1, "replies": []}]}]}, {"body": "Congrats op you figured out how to get free money", "score": 3, "replies": [{"body": "The counter arguments are just pointing out the risks or simply dont completely getting it, I will give it a try hope I dont blow my account hahah", "score": -3, "replies": [{"body": "Maybe, when everyone else is telling you something, and you think its them that doesn’t completely get it, maybe you don’t completely get it.  Maybe.\n\nHere is the deal.  You are talking about trying to build a technically hedged position that includes a credit spread.  Its unlikely you have found a new way to build a technical hedge that is better than existing ones you can look up.  By that I mean there is a zero percent chance you have.  Its time to put this away for a few days and come back and look at it with fresh eyes since you think everyone else is confused.", "score": 5, "replies": [{"body": "OK... I will be waiting then, hope it at least helped haha", "score": 0, "replies": []}, {"body": "Exactly.  And there are enough tutorials on fidelity tasty trade. Think swim e trade etc etc\n\nGet think or swim. Play  with fake money to learn", "score": 1, "replies": []}]}]}]}, {"body": "Yes there’s an error here somewhere. I’m not sure you’re accounting for the losses to the put you sold, though I’m having trouble following your post. \n\nBut if the stock is at $100, and you sell a 95/94 put credit spread for $5 and the stock falls below 94, you’re looking at a loss of $95 on the spread at expiry. \n\nPlus you’ll be down on the shares.", "score": 3, "replies": [{"body": "Yes ... technically Im accounting for the loss of my put sold but its technically unrealized ? If I sold the put I and it goes to 85 I could get a heavy loss ... oooor get assigned and the put sold its now covered, besides the unrealized loss would be only between 95 and 94 cause my put I bought its no good until 94.\n\nAnd about the 100 dollars thats why the spread its important , if Im wrong well then I just made .05% basically nothing but I also didnt lose anything and again I dont have the stock yet , so there is not unrealized loss.", "score": 1, "replies": [{"body": "Yes, buying the 94p would limit your losses. But you still lose $95 if you’re wrong and the stock goes below 94. \n\nYou would then have to realize those losses at expiry, if not sooner. \n\nFWIW, realized vs. unrealized losses only matter for tax purposes. Not for strategy.", "score": 2, "replies": [{"body": "Yeah I just saw it ... thank you very much either way", "score": 1, "replies": []}]}]}]}, {"body": "If you buy 100 and sell a CSP those are mutually exclusive trades. Your stock doesn’t cover your put. \n\nNot sure what you’re saying there but as said if you sell a short put and buy a long put for same expiration it is a vertical credit spread with 100 long shares.", "score": 3, "replies": [{"body": "Yeah cause I will be assigned and wait until expiration if the put contract its ITM, I will not buy the stock but HAVE the money to cover those 100 stocks ... again if the price goes to 85 with the put I sold I have a heavy loss , but I always have the chance to just get assigned.", "score": 0, "replies": []}]}, {"body": "You just described a bull put spread. Since, hypothetically, you think the stock will go down, you'd want to do a bear call spread. Example: sell a 120 call, buy the 125 call.  You'd get about $150 credit for opening this. So your max loss would be $350.  But if AMD went up to say, $130, your unrealized gains on the long stock is +$1700 (from today's price). Making your total gains $1350. Of course, if your short strike got tested you could leg into an iron condor/butterfly for more credit, therefore, reducing your losses.", "score": 2, "replies": [{"body": "Yeah but again ... you guys are not getting into consideration of just simply getting assigned , what you propose could be better and actually what Im trying to explain \n\nInstead of simply limiting your gains why not simply get assigned , you could just sell the stocks that you have and let the call run.", "score": 1, "replies": []}]}, {"body": "Look into covered calls as hedge.  If you own shares. Hedge by selling calls. And buying puts on pull backs", "score": 2, "replies": []}, {"body": "Of course I stumble on this thread while stressing knowing tomorrow is Monday and my AMD yolos are going to shit the bed", "score": 1, "replies": []}, {"body": "You could just do a put credit spread and buy 100 shares to cover the one you sold and leave the put you bought open", "score": 0, "replies": [{"body": "That was basically the whole idea haha , but as some here mentioned the price would fall and you wpuld still have losses on the shares that you bought, unrealized losses but losses nontheless", "score": 1, "replies": []}]}, {"body": "Where are you taking into account the 100 am stocks you bought at 100 and now sold for 94?\n$600 loss", "score": 1, "replies": [{"body": "No ... cause I didnt buy them , I will wait until I am assigned", "score": 1, "replies": [{"body": "I'll try one last time....You sell a 95 for $3, buy a 94 for $2.95---giving you 5 cents credit.  At ANY price below 94.95 (95-0.05), you are losing money.  Your long put only helps mitigate the losses if stock drops below 94, but it is still a loss.  \n\nas an aside, you are using the  term \"assign\" incorrectly some times----sometimes to mean your assigned shares, and sometimes to mean you exercised your put.", "score": 2, "replies": [{"body": "Well I MUST buy the 100 shares at 95 , and the have the RIGHT of selling them at 94.\n\nI just fulfill my contract as it should be by simply buying those shares , and the put its on the run again.", "score": 1, "replies": [{"body": "Not sure what \"and the put its on the run again\" means.  So now you have bought the shares at 95 (or you could say at 94.95 with your 5 cent credit), and you still have a 94 put----can we agree on that?  as the stock continues to drop (per your thesis), you are losing money on your long shares.  Anything you make on the put is offset by loss on shares.  If you buy at 94.95, and sell lower it is a loss.  I think it is time to start drinking now.........", "score": 2, "replies": [{"body": "OK I think you may got a point here the unrealized losses , I didnt see it ... you may still have your shares but the only gains that you would are the unrealized losses of your shares, now I see , thanks", "score": 1, "replies": [{"body": "lol. loss is loss, especially when you're trying to theory craft a winning strat.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Lmao you belong in wsb", "score": 1, "replies": [{"body": "Yeah well thats true ... but that doesnt mean I am wrong, or I guess I am genuinely hoping for a convincing counter argument cause I dknt want to blow my account haha", "score": 0, "replies": [{"body": "You're not wrong it's just that this is called a credit spread :p", "score": 1, "replies": [{"body": "Yup..there is no “counter argument” here because you are “assumed” wrong and wanted someone to counter it. Anyway, you figured it now i guess…try put debit spread if you believe the stock is going down and if you have trouble figuring out support line (resistance line in case of call spreads). That will limit you losses and profits but still good strategy if the underlying goes down.", "score": 0, "replies": []}]}]}]}, {"body": "99% of what I have seen here is WSB in nature, so I would not be too concerned about that.", "score": 1, "replies": []}, {"body": "Man stop overthinking. Look at vix. Look if market pulling back. Look at 10 year yield cpi index etc \nI got 95 strike k  110. AND 120 PUTS KILLING IT. GOT LAST WEEK", "score": 1, "replies": []}, {"body": "I do weekly puts. 3 months. 2 weeks etc\n\nBuy lol.  And I buy calls.  Usually on rip u face of Tuesday. Or turn around Tuesday  lol. \n\nBut I get calls when above 200 day moving average and above 20 and 20 above 200 day", "score": 1, "replies": []}, {"body": "On a separate note if you already own shares and think its gonna drop you could always just sell an ITM covered call to get a higher premium to cover the loss on your shares. Just make sure you get at least enough premium to cover your cost basis so you don't lose money if it goes up instead", "score": 1, "replies": []}, {"body": "My head hurts, this sounds like the ramblings of a mad man.  Net net you are buying shares and selling a put credit spread.  If you are legging out of your short put to buy shares and keeping the long put you are giving the position overall more positive deltas.  Not sure how this benefits you if the stock keeps falling.  If you are trying to get into shares on a dip and some downside protection why not just sell a very wide put credit spread.  You’ll give up some of that credit you would have received from selling the put but then you have the tail risk of a much larger correction covered.  If assigned on your short leg you can simply set up a collar to finance the protective put going forward to hedge tail risk.", "score": 1, "replies": [{"body": "Yeah I couldnt see it at firts , but thats why I posted it here , but it could be a good strategy if you think the dip its temporary, cause the losses are unrealized and you just got a big chunk of money out of the put you bought, if the shares go back to 95 you just made money out of nowhere , and if it doesnt, you lost almost nothing or at least just in paper.", "score": 1, "replies": []}]}]}
