{"title": "[deleted by user]", "selftext": "[removed]", "id": "sjzgbl", "created_utc": 1643935323.0, "score": 71, "upvote_ratio": 0.84, "num_comments": 79, "comments": [{"body": "Take your gains, and no crying about missed post exit potential gains.", "score": 110, "replies": [{"body": "I agree. Sell at open. Any bounce on 2022 market will sure get shorted. Put your data on optionstrat I’m sure you got a ten bagger on your fridays contract.", "score": 8, "replies": []}, {"body": "The Mod speaks. you should listen.", "score": 4, "replies": []}]}, {"body": "I saw someone say earlier that if you allow for IV to adjust to price a few minutes into market open you’ll get a better price on the options. \n\nPersonally, I would take some profits shortly after open tomorrow morning.", "score": 56, "replies": [{"body": "I do not see 3600/3640 making money despite the 400 point move after hours. Bank the 3300.\n\nCan it go to 3600 in 2 weeks? Sure but there should be a massive IV crush tomorrow that will negate a lot of it. Your point is right but OP is too far from money to say it will be profitable (depends on entry of course).\n\n3600 expiring 2/18 closed at 7 bucks. It is unlikely to be double digits.", "score": 29, "replies": [{"body": "i bought them all minutes before close when it was ~2800 (-7% at the time)", "score": 10, "replies": [{"body": "Yep, but they are still 10% otm even after the move. They might win but its just as likely they lose", "score": 19, "replies": []}, {"body": "Check optionsprofitcalculator.com to see if they are profitable at the current after hours price. Also look at the numbers for tomorrow to see how theta decay will impact them overnight.", "score": 4, "replies": [{"body": "optionsprofitcalculator won't work well in this situation because of the IV crush due to the earnings release (and that calculator doesn't know about/take into account earnings announcements). Theta isn't the main concern here - it's Vega and the massive drop in IV that will kill the option's value.", "score": 18, "replies": [{"body": "Thank you. I didn't realize that calculator doesn't take into account IV. I just figured it used something like a running average IV or something so it would always show 'worst case' IV. Good to know.", "score": 6, "replies": [{"body": "I think it assumes a relatively stable IV over time. Earnings are unusual because of the sudden and instantaneous drop in IV. It's one of those things that's really hard to take into consideration in mathematical models, so I don't fault that calculator for not taking it into account.", "score": 3, "replies": []}, {"body": "It does take into consideration IV. You can even move the volatility slider yourself.", "score": 1, "replies": []}]}, {"body": "If you’re knowledge able enough you can adjust the IV for earnings it’s built in.", "score": 2, "replies": []}, {"body": "Question since you seem pretty knowledgeable on this subject.  I have 1 2/11 3120C that I bought Monday morning when stock was $2890 for $2200.\n\nI’m not even sure what to expect at this point.  I guess a lot of it depends if the open stays in the money.", "score": 1, "replies": [{"body": ">even sure what to expect at this point.  I guess a lot of it depends if the open stays in the mone\n\nWith IV crush, it's $10 per 1K. So your about 5K-7K if we stay at 3170, or if it push to 3200 with MM maybe about 10K. Congrate you made bank today.\n\n&#x200B;\n\nAlso please reply back tmr when with your actual sell value. I might be wrong due to IV.", "score": 7, "replies": [{"body": "Better then thinking I was losing it all at close.", "score": 3, "replies": [{"body": "Market tank pre hour due to MM not happy. You still made profit?", "score": 0, "replies": [{"body": "Yea still made some money but def no where near what I was thinking lol", "score": 1, "replies": [{"body": "had a 3270 C that was absolutely obliterated because of IV. unlucky.", "score": 1, "replies": [{"body": "Were you able to make anything?  I missed out on a lot of the gains today cuz I sold too early to be honest.\n\nLesson learned I guess", "score": 1, "replies": [{"body": "no, I didn’t. bought the 3270 C Feb/4 @ $8 and it dropped to $2 at open. currently sitting around .30c. I practically blew up my account bc of this play. like you said, lesson learned", "score": 2, "replies": [{"body": "Yea man!  Only way to make money on trades like this is if the price of the stock next day Is in the money.\n\nIn the morning the stock was dropping and I didn’t hold long enough, still made money but if I just had let it ride rest of day I would have made an extra $7k but hindsight is always better cuz you never know where the stock is going to go.", "score": 1, "replies": [{"body": "I was hoping it would hold 3200-3300 but it didn’t. kinda bummed out. I thought I would at least get a 2x-5x before selling.", "score": 1, "replies": [{"body": "Yea man I went from super happy yesterday to WTF today.  Mostly cuz of my bad decision to sell early.\n\nGoing to try and put it behind me over the weekend lol.  Hate looking back at what could have been.\n\nHard to pay attention to the market all day too when I’m trying to work and all.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "if AMZN can stay up here by the time the market opens this morning, I think you will make a decent profit. My guess, and it is just a guess, that the market will probably price in at least 100 points worth of movement over the next week, so your \"at the money\" call should be worth at least half that.\n\nIf AMZN can stay up here at around 3120, you should definitely make some decent profits if you only paid 22 for that call.\n\nBe aware that if your call still is at-the-money when the market opens this morning, you will have essentially 50 deltas in that call. Which means you will have the exact same profit and loss exposure at that moment as owning 50 full shares of Amazon. Roughly $155,000 of notional value, and so your profit and loss this morning will fluctuate that much as Amazon moves around. It's something to consider - if you want to take profits right away when the market opens, I certainly wouldn't blame you!", "score": 1, "replies": []}]}]}]}]}, {"body": "Do come back and update", "score": 1, "replies": []}]}, {"body": "Multiple threads tonight on this where you have to explain IV crush. I'm seriously worried about the state of the options market if this many people don't know this.\n\nWish op the best. Sell early. Especially your short dates.", "score": 13, "replies": [{"body": "I also think people are overstating IV crush here. Sure it happens, but people here are acting like the IV on these AMZN contracts in this environment after that move is going to just be down wicked fast. When you have an outsized move, IV can certainly remain elevated.", "score": 3, "replies": [{"body": "I don't think they are at all.", "score": 2, "replies": []}]}]}, {"body": "An example here would be UPS for me. The first 3 minutes it was only up 66% and so i just let it sit. It shot up to 1000% after those first few minutes.", "score": 2, "replies": [{"body": "this all depends on strike and expiration and then the continued move up that UPS had.", "score": 3, "replies": [{"body": "Just happened again with SNAP. Opened at like 0.66% and then shot up to 500%", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "how does this change the fact that if i sold right at open, when premiums haven’t priced in yet, i would’ve sold for much less?\n\nsome people wanna be right so bad. can’t imagine how you are with taking your stop losses", "score": 1, "replies": []}]}]}]}, {"body": "Good to know. I now now to give it a few minutes, not that I’ll ever be in such a beautiful situation.", "score": 1, "replies": []}]}, {"body": ">not see 3600/3640 making money despite the 400 point move after hours. Bank the 3300.  \n>  \n>Can it go to 3600 in 2 weeks? Sure but there should be a massive IV crush tomorrow that will negate a lot of it. Your point is right but OP is too far from money to say it will be \n\nOP is not ITM, IV crush will kill all his option tomorrow unless MM pre hour push it toward $3300 to save 1.", "score": 4, "replies": []}]}, {"body": "$3620 2/4 might be hard to fill, might not be many or any bids, but some people might be trying to close spreads so you could get lucky. \n\nThe 2/18s I'd let everything settle for a bit, maybe 15-20 min, maybe longer. The bid/ask is gonna be wild because of the gap up. I'd sell sooner rather than later unless you think AMZN will continue to rip. Theta and IV crush will start to work on those options hard.", "score": 12, "replies": [{"body": "It’s so weird, the little marble stops bouncing but the wheel is still spinning!", "score": 2, "replies": []}, {"body": "That leaves a massive gap that will need to fill, and likely will before expiration. Sell sell sell!", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 21, "replies": [{"body": "Wait, isn’t that what we all do? 🤣", "score": 23, "replies": []}, {"body": "the play is to absolutely sell them, but what part of the day \n\nim aware we are in a long bull market", "score": 3, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": ">e’s no guarantee what will happen tomorrow but you can pretty reliably guess tomorrow AMZN will open green over today’s close so just sell them. Maybe it trends higher and you’re bummed you didn’t max your profits or\n\nHe's going to lose value the moment market open with IV crushing down. IV usually is about 30-45% with AMZN,  however today was in high 60-80% depend on the hours. That means he lost almost half of value due to IV.", "score": 2, "replies": []}, {"body": "It will open in the red, at least the first 5 min.", "score": -1, "replies": []}]}, {"body": "\n>im aware we are in a long bull market\n\nIf by long you mean 2+ years yeah. At this very moment though we're certainly not.", "score": 2, "replies": []}]}]}, {"body": "Bruh 3600? Hahahaha", "score": 11, "replies": [{"body": "i got it at -7% today before close", "score": 2, "replies": [{"body": "Question is have you ever had something that was green that turned red or something that was green that you wish you would have sold. Maybe this is the day to do what you want.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Not the point. Nobody was expecting a move this big. 3600 is so far out of the money.", "score": 2, "replies": []}]}]}, {"body": "These are going to be worthless on open 😂", "score": 4, "replies": []}, {"body": "3600 is a stretch by expiration. I wish I was optimistic as you. I bought 3250 2/18", "score": 3, "replies": []}, {"body": "Jesus, sell them tomorrow and plan your next play. Don’t let greed kick in.", "score": 3, "replies": []}, {"body": "Sell them all tomorrow just after market opens.", "score": 3, "replies": []}, {"body": "Take your profits and run like the wind!!!", "score": 2, "replies": []}, {"body": "Sell them. I’m holding a put credit spread at 3050-2850 2/18 and even that’s not a guarantee that it’ll expire out of the money. But you’re wrong about 3600, and probably wrong about 3300, just take your profit ASAP.", "score": 2, "replies": []}, {"body": "Unfortunately IV Crush first thing in the morning will kill your calls except for $3300. If you bought that one today, your going to be in the loss for a really expensive morning. Never EVER BUY on a High IV date especially today (Which entire market depend on AMZN if we going up or down.)", "score": 2, "replies": []}, {"body": "A bird in hand is better than 2 in the bush.", "score": 2, "replies": []}, {"body": "Because some IV crush sell right away", "score": 2, "replies": []}, {"body": "I have a 2920 exp 2/4 (cost 6,850) and a 3100 exp 2/25 (cost 7,295). Thoughts??", "score": 2, "replies": []}, {"body": "IF OP sold at open or waited few minutes:  \n3640 CLose: 6.967 to Open 5.85  \n3300 Close: 20.76 to Open 37.75\n\n3620 Close 1.95 to open 1.07 (now 0.1)\n\n&#x200B;\n\nOP made about 1K if he close everything at open. If not he lost in value within 5-10 minutes holding.", "score": 2, "replies": []}, {"body": "You made good money.  Now take it.", "score": 0, "replies": []}, {"body": "Take profit buy in tomorrow when it drops", "score": 0, "replies": []}, {"body": "Sell when it hits $3300", "score": -2, "replies": []}, {"body": "The one expiring tomorrow might lose value lol. The other ones will be nice probably should sell them ASAP.", "score": 1, "replies": []}, {"body": "Sell one 3640 call at open and let other ride", "score": 1, "replies": []}, {"body": "Sell on the open and don't look back. Move on to the next play. Congrats", "score": 1, "replies": []}, {"body": "sell for gamma crush", "score": 1, "replies": [{"body": "What is the gamma crush?", "score": 1, "replies": []}]}, {"body": "You got very lucky. You’re gonna end up winning while also learning about iv crush on your far OTM (out of the money) call. Generally it’s a hard earned lesson while losing money. Just because something is down and very cheap does not equal profit on an increase. If you’re otm 0dte is up right at open, take it. Take the others as well", "score": 1, "replies": []}, {"body": "Take the $$", "score": 1, "replies": []}, {"body": "Yea bro you sell at open no questions take your money", "score": 1, "replies": []}, {"body": "i m 70% sure vega will take all your gains, expect maybe 3300 2/18", "score": 1, "replies": []}, {"body": "🐑🐑🐑", "score": 1, "replies": []}, {"body": "That's assuming it doesn't reverse by market open...", "score": 1, "replies": []}, {"body": "OP ,\n\nIm sure you know about options, but if youre here POSTING then it's because you want advice.\n\n&#x200B;\n\nNOBODY GOES BROKE SELLING SOME TO COVER YOUR INITIAL INVESTMENT. \n\nPEOPLE GO BROKE CHASING THEIR GREEDY PLAYS! \n\n&#x200B;\n\nYou have OTM calls? I would sell enough to cover initial investment, MAYBE  your 3300C makes you profit pero yeah BB I would sell because this market is HELLA volitile.\n\n&#x200B;\n\nWhat right now is 20k profit? could be -5k because you held. Take the green, invest in Googles 20-1 reverse split and make DUMB money on your next plays bro! GOOG will go from 150, to 1000 EASY, and if you have 6 shares? thats 120 SHARES AFTER THE SPLIT. Bro THAT COULD BE 120K WHEN GOOG GOES TO 1K AGAIN OR MORE. \n\n&#x200B;\n\nFollow the gravy train and dont get caught up on ONE winning play. Take your win, and move on to the next winning play bb, YOU got this.", "score": 1, "replies": []}, {"body": "If you want to stay in AMZN, sell everything and buy further out. \n\nSell your earliest expirations first/asap.", "score": 1, "replies": []}, {"body": "So what did you end up doing?", "score": 1, "replies": []}, {"body": "take advantage in the jump in price and gamma and STC the options", "score": 1, "replies": []}, {"body": "I’d sell immediately and buy $DWAC.  LGB.  Not financial advice.\n\n$DWAC me.", "score": 1, "replies": []}]}
{"title": "$20,000,000 Mistake", "selftext": "Someone bought 700 shares of AMZN at 4:30est for $31,656 each. Can you imagine fat fingering an order that size? It would have been a $2m order at $3165, but was over $22m. I'd post a screenshot, but we'll yeah... You can see the massive candle wick on the daily chart, or if you look at market price it shows up as the last sale on RH. Someone is looking for a job tomorrow...\n\nEdit: Screenshots https://imgur.com/a/qwGeemq", "id": "sk050b", "created_utc": 1643937132.0, "score": 8, "upvote_ratio": 0.53, "num_comments": 74, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|18|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sk050b)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sk050b)", "score": 1, "replies": []}, {"body": "I thought I was retarded. Then I saw OP thinking you can fat finger at 1000% over the stock price and it means you pay it…I bet his ex wife is Cathie Woods and his mom is Jim Cramer.", "score": 100, "replies": [{"body": "You leave his mother out of this, Jim Cramer is a SAINT", "score": 6, "replies": []}, {"body": "OP definitely fell out of cramer's ass.", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|4886)", "score": 6, "replies": []}]}, {"body": "Let’s get off moms… cuz I just got off yours ;)", "score": 2, "replies": [{"body": "Your just got up off her knees for me !!", "score": 1, "replies": []}]}, {"body": "Well, he belongs here. So the right place", "score": 0, "replies": []}]}, {"body": "The level of stupid on this sub will never cease to amaze me.", "score": 107, "replies": [{"body": "Lol OP assumes Robinhood charts and data are accurate", "score": 42, "replies": [{"body": "Probably thinks strippers like him too.", "score": 74, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 17, "replies": []}, {"body": "Does his mom count?", "score": 6, "replies": []}, {"body": "Wait, they don't?", "score": 1, "replies": []}]}]}]}, {"body": "I ll take things that didn't happen for $1,000.", "score": 32, "replies": []}, {"body": "It pisses me off that this retard is probably doing better in the market than me.", "score": 81, "replies": [{"body": "Lol, hope not. Down $70k ytd as of yesterday. AMZN calls made up about $40k so far today but still not a great start to the year for me.", "score": 3, "replies": []}]}, {"body": "go back to crypto you fool", "score": 56, "replies": []}, {"body": "It fulfills at ask not…oh never mind obv too retarded to understand", "score": 24, "replies": []}, {"body": "No way an order for 31656 was filled lmaooo, do you got any sort of proof for that from the order book?", "score": 39, "replies": [{"body": "Or that there isn’t a mechanism to correct it as a gross overpayment?", "score": 18, "replies": [{"body": "It fills at the next ask order ffs, not some random price skipping over everything else", "score": 15, "replies": []}, {"body": "my broker has a pop up screen that would scream at me and call me a retard (like are you sure you want to do this)...if my bid was a few % above the ask.", "score": 12, "replies": [{"body": "It just gets cancelled by the exchange", "score": 12, "replies": [{"body": "It says last sale", "score": 3, "replies": []}]}]}, {"body": "No mechanisms at pre/after market. You can see some crazy trades once a while on those after markets. Look at Berkshire A share recently in after market. Absolute rip there too.", "score": 2, "replies": []}]}, {"body": "Seriously what the fuck I cannot tell serious from satire in this sub", "score": 4, "replies": []}]}, {"body": "Yes yes yes OP. This. This wsb just hits the spot sometimes. Sometimes it’s not massive loss porn you need or a stupid lengthy argument.\n\nSometimes just some soft retardation like this is all you need. I can sleep happy tonight knowing a brain as smooth as yours exists", "score": 18, "replies": [{"body": "If you think the post is retarded, I present to you, my encore. The last year of Robinhood trading, WSB style...\nhttps://imgur.com/a/wPUwwOn", "score": 3, "replies": [{"body": "Seriously bro you’re gonna make me bust with all this 💦", "score": 1, "replies": [{"body": "I mean, what else could a WSB'er ask for?\nSmooth Brain Posts ✔️\nWild Account Chart ✔️\n-99% on the year ✔️\nGive me a fuckin flair or something...", "score": 3, "replies": [{"body": "If I could give you a “smoothbrain” flair I would", "score": 3, "replies": []}]}]}]}, {"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Please, never be dad", "score": 11, "replies": [{"body": "Son, pack ur bags we lost the house", "score": 2, "replies": []}]}, {"body": "Lmao this is more retarted than my fat son", "score": 19, "replies": []}, {"body": "But it buys at available prices doesn’t matter what put as price.", "score": 6, "replies": []}, {"body": "No this is not a real order. Its a glitch reported wrongly in the system. It was a option contract that was exercised but reported wrong. No broker would allow this to happen. There are literally no shares that would sell for over $10,000 a piece. Which broker would fill that?", "score": 6, "replies": [{"body": "Robinhood", "score": 2, "replies": []}]}, {"body": "At some point we gotta start sterilizing these people and break the cycle", "score": 10, "replies": []}, {"body": "OP has to be trollin’. No one’s this daft.", "score": 4, "replies": [{"body": "Daft…….haven’t heard that is a long time. I like it!", "score": 3, "replies": []}]}, {"body": "We can’t have memes, but posts this stupid are allowed to live…I give the F up!", "score": 6, "replies": []}, {"body": "So I was sitting there, broke as fuck, had just lost everything and was contemplating buying ROPE.  Looked at my account and all that was left was 700 shares of AMZN. I grabbed my Ti-83, leftover from when I dropped out of high school algebra to become assistant night shift team lead at the local Wendy’s. I ran the numbers and needed 20 million to make my margin call by tomorrow market open. “Fuck it, why not go for it.” I said. I threw out a ask of $31,656 which would more then cover my debt and leave me with some trendies to blow on META calls. I sat quietly and cried, then “ding”. I looked up at my screen, with less then a minute till close, some fucking retard  bought  all 700 shares.", "score": 3, "replies": [{"body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "You mean they hit “market” and got jacked", "score": 6, "replies": [{"body": "I guess if you're dumb enough to market order 700 shares at the last second you deserve it. Whoever was on the selling side has a big smile.", "score": -39, "replies": [{"body": "Cashapp me $2 and I'll explain it to you.  Make it $3 and I'll also explain why your response prompted so many people to dog pile on your downvote button.", "score": 7, "replies": [{"body": "I see you are also unsuccessfull in trading for charging for everything 2$", "score": 1, "replies": []}]}]}, {"body": "Jacked on my tibs?", "score": 1, "replies": []}]}, {"body": "Idk what caused that spike but Somebody made bank on some Amazon FDs", "score": 5, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "My cat stepped on the keyboard. HOW TF AM I GONNA PAY FOR THIS BREH", "score": 2, "replies": []}, {"body": "That’s not fat fingering, I think that was calculated.", "score": 2, "replies": []}, {"body": "i suspect that is an overworked trader at JPM. Highly likely that order will not go through or settle. Its called erroneous trade", "score": 2, "replies": []}, {"body": "I remember a post here on wsb I think were someone set a market order that got filled at 10x the trading price.. I think it was DWAC but I am not sure..", "score": 2, "replies": []}, {"body": "More surprising people still use fuckwad Robindahood", "score": 2, "replies": []}, {"body": "Tax lose harvest", "score": 0, "replies": []}, {"body": "Don't worry about it.  Go back to playing candy crush on your smart phone.", "score": 1, "replies": []}, {"body": "Wtf lol", "score": 1, "replies": []}, {"body": "Never knew this level of retardation existed", "score": 1, "replies": []}, {"body": "He’s gonna be green in a week. Watch", "score": 1, "replies": []}, {"body": "Even if you put in an order for a billion buckazoos for an Amazon share, or whatever, then you will still get filled at the national best offer. Either your wrong or this guy vacuumed all the liquidity up to that price. My bet is that you're wrong.", "score": 1, "replies": []}, {"body": "No you retard he just bought 700 shares of the next available price because that's how an order book works you fucking chode", "score": 1, "replies": []}, {"body": "This is gold", "score": 1, "replies": []}, {"body": "My broker wouldn’t let me go 100$ over ask and you think some pro would fat finger at 1000s above ask they would let it go thru? Retarded.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Where can you see data like that eg. Last sale?", "score": 1, "replies": []}, {"body": "I thought when you do a limit order it buys at a price lower or at the specified amount - why didn't it get filled at the market price? I'm assuming the volume would be there", "score": 1, "replies": [{"body": "It's probably a mistake on the exchange reporting, almost certainly. But if you enter a market order, it will fill at ask for the qty ordered, or a limit will do the same, up to your limit set. Almost 100% it's a reporting mistake, but if liquidity is low, you enter a market order and someone has a high limit sell order set you could end up paying a stupid price. Look at the GeeEmmEee apes sitting on $100k sell orders. Whether this actually happened or not, don't enter a market order for a large amount of shares in extended hours. You could get burnt badly.", "score": 1, "replies": []}]}]}
{"title": "FB: we were the bad guys all along", "selftext": "Ok. So this is the FB bull post among all the bear posts.\n\n1. FB has Instagram. Yes. That thing you use daily. It’s owned by FB. Doesn’t matter if you quit using FB and start using Instagram. They will still get your eyeball and that's dollar.\n\n2. FB has WhatsApp. Which is slowly creating monetization opportunities in developing countries. It could a be bigger cash cow than Instagram even.\n\n3. FB based Marketplace and Meta's continuous integration of similar selling services will ultimately be the biggest cash cow of FB.\n\n4. Stonks go down, stonks will go up. We can buy the dip.\n\n5. FB has much, much better fundamentals than the overall market. TTM P/E is much lower compared to S&P 500 index (though P/E doesn’t mean jackshit).\n\nIndebtedness much lower, growth gonna be higher in the long run, and the most important thing: FCF is much better compared to the overall market.\n\nNow, tell me this. We can gamble on SPY call options, buy VOO. Yet, we cannot do that for FB? Buy FB stonks?\n\nDon’t give me that look. Don't tell me it’s morally bankrupt or some shit. Every company in the index is the same. Weapons manufacturers, oil giants, banks,  real estate speculator companies, those soft drinks companies etc. Which one is not harming society?\n\nMoreover, when such a giant drops 20%+ in a single day, you know it’s a knee-jerk reaction from the market, you know it will be back up pretty soon as long as the overall market doesn’t crush.\n\nEdit: I haven’t yet opened any position in FB, will open it tomorrow and add the position screenshot in this post after that.\nI do have traded a very small position in FB a little before the earnings call though. Sold in the pre-market at around [327](https://imgur.com/a/DXFIWwi) (with some profit) expecting it to dump hard (just didn’t expect it to dump this hard).", "id": "sk20q2", "created_utc": 1643942494.0, "score": 21, "upvote_ratio": 0.65, "num_comments": 76, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|55|**First Seen In WSB**|1 year ago\n**Total Comments**|200|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/mqu2ph/stmp_the_play_you_have_been_looking_for/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sk20q2)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sk20q2)", "score": 1, "replies": []}, {"body": "I yolo'd $5,000 into FB thinking exactly what you said.", "score": 10, "replies": [{"body": "Same here.", "score": 3, "replies": []}]}, {"body": "Agree.  Drop seems overdone despite some issues regarding Apple policies", "score": 17, "replies": []}, {"body": "Agreed. Their marketplace is one of the easiest way to sell stuff. FB is not going anywhere", "score": 13, "replies": [{"body": "MySpace didn't go anywhere either, but platforms have their prime and afterwards, niche.", "score": 9, "replies": [{"body": "Agreed, but WhatsApp & IG will likely stick around", "score": 1, "replies": [{"body": "We’ll have replacements appear for those, i’m sure.", "score": 6, "replies": [{"body": "It's called Tik Tok... ask your kids", "score": 4, "replies": [{"body": "😳😫😂🙏🏻🙏🏻\n\n\n\n\n\n\n\n\n\n\n\n\nNo.", "score": 3, "replies": []}, {"body": "And everyone should move to signal from whatsapp", "score": 1, "replies": []}]}]}]}]}, {"body": "There are other options. “Ease” is a function of enabling abuse.", "score": 3, "replies": []}, {"body": "AFAIK their marketplace generates no revenue for the company.", "score": 1, "replies": [{"body": "I think they skim some off of the “Shipping” features where they collect the money and act as the exchange of funds, but I don’t know how many people are using that. \n\nIt’s mostly local sales and FB isn’t taking cuts on those yet", "score": 1, "replies": []}, {"body": "Another thing to be monetized.\n\nI am going to give it a week to settle out before I give it a spin.", "score": 1, "replies": []}]}]}, {"body": "I am loading calls with strike price 300 for March seeing how they move daily, this should and will print me some moolah", "score": 10, "replies": [{"body": "Don’t do it. The fire has only just been lit. 🔥", "score": 11, "replies": [{"body": "The fire rises.", "score": 3, "replies": []}, {"body": "A grease fire, at that.", "score": 2, "replies": []}]}, {"body": "Agreed. Smart play", "score": 1, "replies": []}, {"body": "As a clown who did this but for PYPL in November thinking “it just fell 25% that’s it” … tread lightly", "score": 1, "replies": [{"body": "Seems PYPL was very overvalued and still is.", "score": 1, "replies": []}]}]}, {"body": "i honestly have no idea why everyone hates fb and zucc. i met my awesome gf on fb dating. i bought some nice clothes on the cheap from people on facebook marketplace. when i got a defective shirt, fb reimbursed me immediately. its a good app with a lot to offer in one spot.\n\nzucc is a genius, theres old videos of him doing guest lectures on comp science at his college before facebook was huge (but after it had become well known). he grew the company himself, even if you believe the narrative that he stole it all which i think is believed due to a movie that i havent seen. he is honestly pretty endearing and happy to make fun of himself publicly. what exactly has facebook done that is so toxic, except hold a mirror up to people? if anything, we have come to know ourselves and our society a lot better through our time on social media. anyway, hating zucc feels like hating trump, i just cant jump on the bandwagon with everyone else because it feels so damn spiteful and self serving. \n\ni do congratulate all put buyers, however. fb stock has never really moved as smoothly as some of the other tech stocks and i think it has to do with different management styles of each and the emphasis each company puts on their stock performance.\n\ni’ll add one last thing. this history making dip has everyone all eyes on this company and its stock. its already been hype for a minute since the sweet baby ray’s, err, metaverse video. the concept is new and shiny and could be cool. but the stock dip is ironically valuable in the form of free press, and i imagine when the wheel starts moving for meta, we will all remember this dip.", "score": 11, "replies": [{"body": "Never invest with your duck...", "score": 4, "replies": []}, {"body": "Liberals hate facebook because it paved the way for Trump to win. Conservatives hate it because facebook censors them. They both love it because they can argue with each other all day on it.", "score": 1, "replies": []}]}, {"body": "You all got Zucked ( new term for a sudden loss of a shitton of tendies ), Zucked!!!!\n\nFB calls = Zucked!!!!!", "score": 5, "replies": [{"body": "But what about leaps now on discount and wait a year or two?", "score": 1, "replies": [{"body": "Research it out, they might be getting some headwinds soon , remember gov is constantly pressing them.\n\nTomorow might be uglier, if people overloaded on margin need to unload. Chart it out, find heavy supply / demand zones, make a call. Im not touching it , and ive never have. Just based off Zuck's shitty ethics", "score": 3, "replies": []}]}]}, {"body": "Fuck Fascistbook.", "score": 6, "replies": []}, {"body": "FB sold info about US Citizens all over the world including Russia and Apple fucked them in ass which was right thing to do period.", "score": 2, "replies": []}, {"body": "\"It's morally bankrupt to invest in Facebook\"\n\n*Invests in Amazon*", "score": 2, "replies": [{"body": "Lol those people need to check your morals at the door. The casino doesn’t give a fuck about your feelings.", "score": 1, "replies": []}]}, {"body": "facefuck doesn't hold a thing of actual positive value", "score": 5, "replies": [{"body": "You are using moral arguments in a gambling sub. Take it to r/politics or r/technology \n\nFB can make me money, that's why I have posted this. And remember, you are posting this on Reddit, basically the same shit.\n\nI hate Facebook and Reddit more than you do.", "score": 10, "replies": [{"body": "Well, I would respectfully disagree on a few points.\n\n1) Metaverse is currently only a vapourware buzzword.\n\n2) If a single company like Apple can fuck up its ad revenue bottom line so much, it doesn’t have much of a moat. It can only go down from here if Android decides to do the same.\n\n3) That leaves us with WhatsApp. How do you monetise it? If you pick out keywords from there for ad generation, what’s stopping others from leaving to Signal or Telegram?", "score": 11, "replies": [{"body": "Good to see some actual discussion. Thank you for this.\n\n1. I don't know anything about metaverse and how that will turn out, that's why I only talked about Meta's current product portfolio.\n2. Apple and Google are the only 2 companies that can impact facebook. They can impact almost anyone. That doesn’t say anything much about lacking moat but more about Facebook leaderships strategic mistake in thinking that these two platform giant will always allow Facebook to have free reign.\n\nYes, it can go down if Android decides to do the same. But, Google itself is an ad company and there would be antitrust concerns if it decided to have special treatment for itself and not allow Facebook to enjoy that treatment.\n\nI would say, it’s more of a return to norm in matters of privacy than anything else. I don't think it counters the long game of FB at all.\n\n3. https://techxplore.com/news/2021-01-whatsapp-terms-monetize-app.html#:~:text=Facebook%20aims%20to%20monetise%20WhatsApp,they%20already%20do%20in%20India.\n\nFacebook aims to monetise WhatsApp by allowing businesses to contact their clients via the platform, even sell them products directly using the service as they already do in India.\n\n\n\n***and lastly, I am suggesting buying Meta as more of a short term play (that's obvious, given the nature of the sub), not a 50 year buy and hold.\n\nHowever, I do appreciate your counterpoints. Thank you for this.", "score": 5, "replies": []}]}, {"body": "i said nothing about morals", "score": 2, "replies": [{"body": "What positive value do you speak of then?", "score": 1, "replies": [{"body": "All the ones that are not there? I feel like this should be obvious based on... English.", "score": 3, "replies": [{"body": "We like money. Enjoy morality sissy", "score": 4, "replies": []}, {"body": "Such as…?", "score": 1, "replies": []}]}, {"body": "i didn't lol", "score": 2, "replies": [{"body": "\"doesn’t hold a thing of actual positive value\"", "score": 1, "replies": [{"body": "a statement of absence does not imply existence", "score": -2, "replies": []}]}]}]}]}, {"body": "No way. I hate Facebook way more than you, bro!", "score": 3, "replies": [{"body": "Prove it.😉", "score": 1, "replies": []}]}]}, {"body": "They hold $58bn cash but I guess that’s got no value.", "score": 2, "replies": [{"body": "got me there :)", "score": 1, "replies": []}]}, {"body": "And which one does? Palantir?", "score": 1, "replies": [{"body": "AAPL BRK AMZN GOOG(L) JNJ would be my top 5", "score": 2, "replies": []}]}]}, {"body": "Fb is just following in the footsteps of other similars that came before them. Like the footsteps of aim and myspace that were popular for a few years until the trend faded out and something else came along.", "score": 4, "replies": []}, {"body": "Don’t put your fingers where ya wouldn’t put your dingdong! 🙂 \n\nStand against Meta for a brighter future, one without a platform of censorship and privacy invasion.\n\nThe next question is, who’s platform will we allow to rise in the aftermath? With Facebook and Instagram being dumped like garbage, who will create the new pieces of art, free from the twisted desires of Meta?\n\nWhoever is out there, make your projects known. Be loud. This is the open door.", "score": 5, "replies": []}, {"body": "FB business model, capitalizing on lack of privacy, is dead . Apple fired the first shot. Wait until they make laws about it. FB is that floating turd going around about to get  flushed for good.", "score": 2, "replies": []}, {"body": "TL;DR: Buy the dip.", "score": 2, "replies": []}, {"body": "You’re right, it’s not just a website , ITS JUST TWO WEBSITES . LOL .... still not worth 600 billion. Not even close", "score": 2, "replies": []}, {"body": "Dude .... fb ipo d at 42$ dropped to $19 - thos large player who've been holding it since and below the 100 line are cashing out and why shouldn't they? The investment was just that... they invested and now they're selling along with so many other overvalued tickers.", "score": 1, "replies": [{"body": "Fb has a PE of 17, have you looked at their CAGR? Fucking 30%. This is probably the best valued cash cow that will print money for the foreseeable future. You are actually retarded.", "score": 3, "replies": [{"body": "Thank fellow and yes I understand the balance sheet is great but of course I'm actually retarded - wankers unite you may be able to push it back up", "score": 1, "replies": []}]}]}, {"body": "I dont know anyone that regularly uses instagram let alone uses it everyday.", "score": 1, "replies": [{"body": "What lol? \nDoes your 1 friend not have a phone?", "score": 10, "replies": []}, {"body": "Probably because you still live in your moms basement with no friends. Just go out in public, all girls are on it 24/7 next to tiktokshit", "score": 0, "replies": []}]}, {"body": "fb is on the slow road to zero\n\nget out now", "score": 1, "replies": []}, {"body": "why say \"YOU use daily\"  \n\n\nI don't use it or any of there other services.... just because you do doesn't mean us autists do", "score": 1, "replies": []}, {"body": "Always there are some degens that buy falling knifes. Do you think professinal hedge funds  that sold today don't understand all of that? They still sold. Sentiment is bad and big investors don't like the metaverse idea.", "score": 1, "replies": []}, {"body": "just dont see a $600B company here. other tech companies tend to offer more HW, like phones, data server services, cars, logistics, etc. FB's core product is SW with token HW offerings like portal/oculus (which they probly outsource). that SW isnt particularly constructive either", "score": 0, "replies": [{"body": "They only provide a service (the social media platforms) for 3 billion people. Yeah their SW isnt constructive, that is a joke dude. Do you know what it would cost to set up a similar system as efficiently as FB? Zucc also said in the earnings report that they are using vast amounts of money to work on working around Apples privacy issues. This stock will be much, much, much higher in 2/3 years.", "score": 2, "replies": []}]}, {"body": "Lmao who buys VOO", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4258)", "score": 1, "replies": []}, {"body": "Wait stonks go *down*?  Heresy", "score": 1, "replies": []}, {"body": "The sooner Gov't rips this thing into pieces the better the world will be.", "score": 1, "replies": []}]}
{"title": "Why you should pull your finger out of your ass about $COIN", "selftext": "In this post I'll try to explain to you degens why Coinbase is actually a high growth tech company, and not some exchange that will become irrelevant in 3-5 years.\n\nLet's ignore revenue from trading fees (89%) of Coinbase' revenue in Q3.\n\nAND let's ignore the upcoming \"expensive jpeg\" (I know that's not the only use case, fuck off) marketplace.\n\nLet's just focus on subscription & services revenue, which made up the other 11% of revenue from Q3.\n\nHere's what you need to know. the average quarter over quarter growth rate for their subscription and services revenue over the last 4 quarters is 97.34%.\n\nYes (in millions $, Q3'2020 - Q3'2021): 10.7 > 20.7 > 56.4 > 102.6 > 145.2.\n\nNow, you might say, millions is nothing for a company with a $40B market cap. Why are we talking about this?\n\nHere's why: Q3 posed 41.5% growth in S&S revenue quarter over quarter, and this was during a \"winter\" where trading volumes were down 30% quarter over quarter. I propose that this means regardless of asset prices, institutions (primarily) are continuing to invest into this new asset class.\n\nAnd that this category of revenue is going to CONTINUE to grow exponentially for the foreseeable future. Coinbase is the best positioned to serve the needs of existing institutional entities as well as startups that want to get involved in this space. And I see no competition coming.\n\nAlso, even if there was competition, guess what - Coinbase would probably be an investor, and probably acquire them. Their Venture arm has invested more than $26B in various \"decentralized web technology companies in 2021)\n\nAnalysts are expecting Coinbase revenue & earnings to decline substantially in 2022. I think for one thing, that Q4'2021 may surprise to the upside on higher than expected growth in the S&S category of revenue (since trading volumes are public data, there's not much room for surprise).\n\nFurthermore, I think that 2022 is going to be another explosive year of adoption in all aspects of this space.\n\nWe'll talk about valuations next. Now, we can't ignore revenue from trading fee's here. So keep that in mind. But I like to think of revenue from trading fees much like the tax credits Tesla received that made them profitable originally. They may be temporary, but they are giving the company a really strong financial foundation to stand on. But let's try to price this company based on the underlying growth, with the understanding that the balance sheet is exceptionally  healthy.\n\nGiven their Q3 S&S revenue of $145M, up by \\~1300% from Q3 of 2020... We'll to be honest, I started writing this section with the intent of proving they deserved a certain multiple, but I'm kinda retarded, so I'll leave that to somebody else. But I ASSERT that a P/E of \\~16 (as it stands today) is too damn low. And - oh - by the way - after they report Q4 earnings it should be closer to 13.\n\nYes - If they have a record breaking quarter (they will), but, let's for simplicity assume they match Q2 (less the tax credit they cashed in Q2 which pumped their earnings \\~$737M, and I might be missing something here but I'm doing the conservative thing) that would leave them with Q4 net income of $869M. Which would put their yearly EPS at $13.9. Which only edges out consensus to the upside by \\~5%.\n\nSo if consensus is so on-the-nose, again, what are we talking about?\n\nWell consensus is only coincidentally on the nose, because S&S revenue is only ramping up. An extra $100M here or there doesn't mean a lot to Coinbase' earnings today. But by the end of 2022, they could be doing closer to $1B (roughly 4x on the +$200M I expect to see in Q4 earnings) in S&S revenue each quarter. Do I know where the growth stops? no I do not. Which is why I'm bullish as fuck.\n\nAnd again, analyst consensus is that Coinbase revenue declines in 2022 and beyond. I think there will be a tidal wave of price target raises somewhere between Q2 & Q3 of this year.\n\nAll of this to say that in the face of overwhelming evidence, analysts will have to raise price targets and somewhere along the way, wall street will realize Coinbase is a high growth tech company that deserves a growth multiple. Revenue diversification isn't coming, it's here, and it's sneaking up on everybody who doesn't understand why Coinbase should be worth more than Nasdaq.\n\n&#x200B;\n\nNo TLDR for you. $505 C 1/20/2023.\n\nPosition: [https://www.reddit.com/r/wallstreetbets/comments/s81l6k/77k\\_505\\_c\\_leaps\\_on\\_coin\\_update\\_trials\\_and/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/wallstreetbets/comments/s81l6k/77k_505_c_leaps_on_coin_update_trials_and/?utm_source=share&utm_medium=web2x&context=3)", "id": "sk3bb0", "created_utc": 1643946330.0, "score": 66, "upvote_ratio": 0.75, "num_comments": 70, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|6 months ago\n**Total Comments**|27|**Previous DD**|\n**Account Age**|6 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sk3bb0)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sk3bb0)", "score": 1, "replies": [{"body": "I was tracking until you said $505. Why not pick something sub 300 (aside from it being more expensive)?", "score": 2, "replies": [{"body": "When I started buying it was at \\~$330 or so per share. So that's part of it. But honestly I still think that's a reasonable target 11 months out. But If I had more money I'd probably buy a lower strike.", "score": 1, "replies": []}]}]}, {"body": "I still need Cramer to call it a short opportunity before I am ready to buy calls.", "score": 65, "replies": [{"body": "This is the real DD", "score": 23, "replies": []}, {"body": "Cramer: Master of confusion", "score": 2, "replies": [{"body": "“Confuse and conquer”", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 60, "replies": [{"body": "Nothing wrong with that good buddy.", "score": 22, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "…let’s face the facts you were in long before this post", "score": 4, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Nothing better than being bagsdeep in a play that is perpetually on the launching pad to the moon", "score": 4, "replies": [{"body": "I got PLTR for that. They have been on the launching pad for so long, it can’t be more than a decade till we moon.", "score": 5, "replies": []}]}]}]}]}]}]}, {"body": "Your mistake was telling me to pull my finger out of my ass.\n\nThis is not the way.", "score": 28, "replies": [{"body": "Well said time to short", "score": 5, "replies": [{"body": "A crypto exchange when anyone can buy an ETF?\n\nLaughable.", "score": 3, "replies": []}]}]}, {"body": "So basically, short COIN?", "score": 13, "replies": [{"body": "By all means and good luck 🍻", "score": 4, "replies": []}]}, {"body": "Fuck me…ok, I read the first paragraph only. But I got it. Agree…will blindly follow. But also, read an interview with their CEO, and was interesting all the other shit they are doing besides simply being an exchange. He emphasized self-custodial tools and alluded to hardware wallets. COIN is on auto DCA in my brokerage account.", "score": 11, "replies": []}, {"body": "I love lamp.", "score": 6, "replies": [{"body": "Doctors would later inform you that you are what is referred to as mentally retarded.", "score": 2, "replies": [{"body": "I read this in Morgan freeman voice.", "score": 3, "replies": [{"body": "As it should be son. As it should be.", "score": 2, "replies": []}]}]}]}, {"body": "Their profits goes down along with the price of digital assets and vice versa. \n\n&#x200B;\n\nIf a crypto winter / bear market is on the verge, you will regret buy at these levels. I have seen 2 crypto cycles and believe me it doesn't matter if the richest man in the world holds it. The bear cycle will eventually come and washout the noobs and moon boys.", "score": 7, "replies": [{"body": "If you read the post you'd realize I'm disregarding the trading revenue in my theses outside the fact that it's padding their balance sheet for the time being.", "score": 7, "replies": [{"body": "i dont know why, their trading revenue wont go down with bitcoins price meaninfully. the only way you can rationalize them losing significant revenue on trading is if less trades occur (which is highly unlikely regardless of btc price action)", "score": 2, "replies": [{"body": "I agree with you, but haters always want to hate on the theory that trading revenue is unsustainable. So in this post i wanted to highlight growth in other areas of the buisness", "score": 2, "replies": []}]}]}]}, {"body": "Sounds like a short signal", "score": 8, "replies": [{"body": "Agreed", "score": 2, "replies": []}]}, {"body": "Finally a man of culture", "score": 5, "replies": []}, {"body": "I think you’re right. Even aside from competition compressing fees in the near term, the ultimate bull case for crypto is to no longer need to switch back to fiat rails (I know seems like forever from now). All exchanges face this same terminal value risk, in that scenario. As a result, the right way to value Coinbase is not to focus on it as an exchange but a crypto early/growth fund, and focus on founders ability to pick winners in that market.\n\nOP, what can we look at to help us understand Coinbase’s ability to pick winners in this space vs. other private VCs.", "score": 3, "replies": []}, {"body": "Ah. So is Coinbase the new pump n dump?", "score": 5, "replies": [{"body": "I think it's the new $TSLA", "score": 3, "replies": [{"body": "Elon tries.", "score": 1, "replies": []}]}, {"body": "No that is Bitcoin post CME.", "score": 1, "replies": []}]}, {"body": "A few shares for the long haul...🍻", "score": 2, "replies": []}, {"body": "God, I hope your wife's boyfriend doesn't need that money. A 2nd furnace for his French bulldogs bed has more utility than this trade.", "score": 2, "replies": []}, {"body": "This hasn't aged well.", "score": 2, "replies": []}, {"body": "“$505 C 1/20/2023” \n\nPost a screenshot.", "score": 2, "replies": [{"body": "Linked to previous YOLO post. Check it out.", "score": 7, "replies": [{"body": "I just did, respect and good luck, amigo.", "score": 7, "replies": [{"body": "> Thanks, man.", "score": 7, "replies": []}]}, {"body": "Jesus lmao", "score": 2, "replies": []}, {"body": "When did you buy that", "score": 1, "replies": []}]}]}, {"body": "whats the tech? is it a spread sheet and a bank account?\n\n&#x200B;\n\nI guess it's tech if your a caveman boomer", "score": 2, "replies": [{"body": "Yah what tech did they invent, nothing! No patents and 2 years from now they will be obsolete", "score": 2, "replies": []}]}, {"body": "TSLA stock is inflated from repeated short squeezes. TSLA however is also years ahead of their competition technologically, and is constantly innovating and expanding into new sectors/anticipating bottlenecks before they hit - see building battery gigafactories before anyone thought battery supply would be an issue or their recent work on lithium mining. \n\nCOIN charges extremely high fees, has repeatedly allowed their customers to get hacked and robbed, and is facing a wave of competition that is low cost. The business model is closest to an old school broker that charges you $80/trade except the internet is already here so the time window to exploit people not knowing how crypto wallets actually work is like 2 years, not three decades.", "score": 0, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 9, "replies": []}, {"body": "Customer service is also literally, and I mean literally completely nonexistent. If you ever have an issue you just have to take the loss.", "score": 3, "replies": []}, {"body": "False. COIN has never been hacked.", "score": 4, "replies": []}, {"body": "If you can't read you should just say so ![gif](emote|free_emotes_pack|kissing_heart)", "score": 2, "replies": []}]}, {"body": "I would assume their valuation will rise as soon as fake internet money recovers, as they hold a lot (it’s up ~20% from the recent dip, so we’ll see how quickly that translates to $COIN).\n\n\nI am trying to figure out how much their revenue will depend on overall fake internet money capitalization. They get fees from fiat-to-fake, but afterwards they benefit from the spread for all fake-to-fake conversions.\n\n\nWould that revenue boom as fake internet money value increases? I guess their cut in fake internet money would remain the same, but its actual value would be more and more.\n\n\nThoughts anyone?\n\n\n\nAlso fuck expensive jpegs. I hope other applications will steal the limelight, as this idiocy is just a bubble-maker.", "score": 0, "replies": []}, {"body": "Here's a link to my most recent post about my $COIN position. https://www.reddit.com/r/wallstreetbets/comments/s81l6k/77k\\_505\\_c\\_leaps\\_on\\_coin\\_update\\_trials\\_and/?utm\\_source=share&utm\\_medium=web2x&context=3", "score": 1, "replies": []}, {"body": "coin became irrelevant and then went public, meanwhile there are other companies not that known as coin but they have higher revenue more incoome and are not valued in the quadrillions. Like all the IPOs during covid, the stock is overvalued at least by 10x, you got played.", "score": 1, "replies": []}, {"body": "Baghold moment", "score": 0, "replies": []}, {"body": "For what does coin have a subscription? Do you sub to be a retard?", "score": 1, "replies": []}, {"body": "People traded more due to the mania, that’s over", "score": 1, "replies": []}, {"body": "As a COIN account holder I can say that COIN Shares are going to crap until crypto goes mainstream.  Which so far has not.  Crypto will go mainstream when you can go to your favorite sex toy store and buy stuff as easily as swiping a credit card.  Until then COIN will do nothing.", "score": 1, "replies": [{"body": "you can already do that with visa / mc cards linked to your wallet.\n\ncoin will go up as trading activity goes up.  which it certainly will unless crypto literally ends.  biden has said he is going to regulate it, which means it will wont die.  \n\ni too have $75k in OTM leaps.", "score": 1, "replies": []}]}, {"body": "screw coin bruh. if you wanted to buy shitcoins and invest 1000 they will take out like 20 bucks, and when you sell, they will take like 20 bucks as well. fuuuuuuuuuck that. no one will use that shit unless they change those fees. that means you gotta back 40-50 dollars on the shit coin just to pay for coinbase fee. $50 goes along way fuck all that. puts", "score": 1, "replies": [{"body": "you realize the post just makes you look like a moron because your not trading on pro....", "score": 2, "replies": [{"body": "I AM PRO", "score": 1, "replies": []}]}]}, {"body": "Coinbase has security problems. They leaked my email and phone number to a hacker that did a sim swap, accessed my account, and stole thousands. Coinbase can rot in hell.", "score": 1, "replies": [{"body": "rofl, no they didnt. \n\ni wouldnt mind having a brain this smooth for a while to think im right with no knowledge of how things work", "score": 2, "replies": [{"body": "So tell me how that works then.", "score": 1, "replies": []}]}]}, {"body": "I agree. I’m buying up days with coin weakness.", "score": 1, "replies": []}]}
