{"title": "Is this the first time we've been afraid of Hyperinflation?", "selftext": "I believe we're in a massive bubble, and yet I have everything I own in stocks, simply because I believe JPow could one day cause hyperinflation.\n\nI'm curious, is this a first?  Is this the first time in history where people would be more cautious that their government would run their currency into the ground before they would cause a significant drop in the stock market?  Now I hear the market is \"predicting\" a rate hike, followed by a dropping of rates across the board.\n\nIn 2008, I doubt even the people buying near the bottom would have expected they might have done QE, outright printing money to buy our own bonds to artificially drop interest rates.  Now I'd say its a 60/40 chance they would again, even with inflation going near 8%.\n\nSo is this a first in history?  Could there be any ramifications of this change in sentiment?", "id": "sss77u", "created_utc": 1644892621.0, "score": 8, "upvote_ratio": 0.58, "num_comments": 78, "comments": [{"body": "[deleted]", "score": 12, "replies": [{"body": "It would actually have to be closer to 100x higher", "score": 5, "replies": []}]}, {"body": ">'we've been afraid'\n\nUnless you're referring to you and a mouse in your pocket... this isn't true.  With the exception of a few click bait articles no serious person is expecting hyperinflation to take hold (and no I do not consider Jack Dorsey a serious person).", "score": 40, "replies": [{"body": "This!", "score": 3, "replies": []}, {"body": "Ah really, I figured the projection of a few rate hikes followed by a decline in rates was enough to show that.  I'm just speculating some things, based on my current knowledge level, which isnt great though I'm still curious.\n\nI didnt know this Jack Dorsey guy, pretty interest guy.  I'm assuming hes rich cofounding Twitter and yet he still seems like a bit of a nutter.", "score": -21, "replies": [{"body": "people touting about hyperinflation is just sensationalism. Yes, QE and supply shocks will create high amounts of inflation, but inflation might not even break double digits. The fed is planning on raising interest rates to 0.9% by year end and they're going to start shrinking the balance sheet here in March I think.", "score": 2, "replies": []}]}]}, {"body": "Historically, when hyperinflation hits, assets dont just rise but screeeaaaam higher.", "score": 13, "replies": [{"body": "What about growth stocks during hyperinflation?", "score": 2, "replies": []}, {"body": "How much above what they are can they go before they start screaming?\n\nRight now you've got every analyst saying we've peaked, if it somehow goes up another 30-50% I might consider that we have entered some form of strange reality, and I might make sure I'm fully invested.", "score": -7, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "If we raise rates a couple times, say 3-4,  and the Fed unloads more QE, and we jump up 30%.  What would you be thinking?  What would you do if that happened?", "score": -9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Sure, I guess it depends if you believe the government CPI, shadowstats, or something in between.", "score": -4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I will look into that, thanks.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "We haven't peaked... Every product is made from a series of other products or commodities that all get shipped from destination to destination. Fuel costs were up 12% in Jan alone.. Feb even higher.. \nBig business has already absorbed a large amount of wholesale cost increases...\nSo we will see a 14 to 18% inflation print!", "score": -2, "replies": [{"body": "I'd heard similar things about food prices.  We're even running out of cellophane now.", "score": -4, "replies": []}]}]}]}, {"body": "The US has a AAA credit rating, probably the best rating globally. Theres currently no additional borrowing, but the option is there. This means it would take a special kind of stupid to wreck the economy. Will buying power be reduced? Yes, but the flood of new cash was spent which raised demand when supply was reduced. The correction has happened. People who can borrow, are borrowing which will help ease inflation down the road. Shares in banking are going to do well. Once supply/demand corrects and rates start rising higher, we'll see some form of normalcy. Im just an idiot online though (i always forget that part).", "score": 10, "replies": [{"body": "Thanks for including the last part", "score": 9, "replies": [{"body": "I need it as a signature for all my comments", "score": 5, "replies": []}]}, {"body": "With the current leadership... what can go wrong?", "score": -2, "replies": [{"body": "You mean the current leadership enjoying the most new jobs in a first year administration.....ever?  Or the one with the GDP already past the trajectory of even the most favorable pre covid record of the idiot past?  The one currently that hires capable competent bureaucrats and not bomb throwing wackos?  That one.", "score": 6, "replies": [{"body": "Yep.", "score": 2, "replies": []}, {"body": "Remind him, one year.", "score": 2, "replies": [{"body": "Judging by every single Democratic administration in my adult life, its going to be better.  \nIf Republicans take over the senate, worse.  House, worse.  But the best economic record is held by undivided Democratic leadership.", "score": 1, "replies": [{"body": "I read this nowdays.  Partisans who truly believe, since there guy is in office, just like a spigot, allthe good happened, all the bad stopped. LOLOL. \n\nLike economics and math don't work on a continuum, but do an about face depeding on whether or not the person has a (D) by their name.  \n\nGet ready for it to be obviously untrue in a year. \n\nWhat's sad, is other than his shenanigins in the oil world, Joe had and has little to do with inflation, but he's the guy in office.", "score": 2, "replies": [{"body": "Tax cuts favor profit taking and speculation over investment, layoffs over hiring, debt over savings .  Lax regulation favors cheaters.  But that is the Republican answer for everything.  Eventually the sugar high fades and we have recession.  \n Democrats favor investment, education and effective governance which invariably leads to sustained growth.  Its not an accident they have completely different results.", "score": 1, "replies": [{"body": "Even if that were true, it's not going to matter. \n\nMath is just math.\n\nInflation is going to rip Joe's head off, because of math. \n\nSadly, he's in there, and so that's how we do it. \n\n&#x200B;\n\nI doubt there is little reading left for me to reccomend to you that is non partisan, simply showing history and economics.  \n\nLots of history readingis very good to cure partisan ecomomics.", "score": 1, "replies": [{"body": "Economics is entirely partisan.  You really dont get such a difference in records without the influence of the office holders.\nI have read all sorts of economics papers excusing the poor performance of Republicans, which usually just hand wave off the disastrous long term effects of their policy.  The proof is in the results.\nInflation is a worldwide phenomena right now, but so is wage growth and job portability.", "score": 1, "replies": [{"body": "You truly believe buying and selling can be chopped into little pieces of who has a (D) by their name or not.  Amazing.", "score": 1, "replies": [{"body": "Amazing that completely different philosophies and polices can lead to different results....stunning!!!!", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Citing Biden job numbers is literal baby brain shit. I cannot believe there's a real human being making this argument. Life boat rescues at all time high in April 1912 etc", "score": 1, "replies": [{"body": "Yeah, because you feeeeeeel its bad.", "score": 1, "replies": []}]}, {"body": "Imagine being this blind and deluded..", "score": -2, "replies": [{"body": "Imagine thinking the economy is in the trash because the man on TV tells you to.", "score": 4, "replies": []}]}]}]}, {"body": "Isnt it AA by the S&P now?  Canada overtook you, with their fantastic housing bubble and low productivity investment.\n\nI suppose I'm worried more about these people who arent spending money, since that causes a crash, which causes more QE and lower rates.", "score": -1, "replies": [{"body": "It could be by now.", "score": 2, "replies": []}]}]}, {"body": "I've been hearing were on the verge of hyper inflation for the past 20 years... hasn't happened yet. Everyone just needs to calm down", "score": 4, "replies": []}, {"body": "Why are we in a bubble. Everything has been crushed", "score": 3, "replies": [{"body": "Just things like Schiller PE ratio, net domestic savings, real unemployment, and debt load.\n\nThen the huge dam ready to burst of people waiting to buy bond, as we pushed people on fixed income over to junk bonds and preferred shares to keep rates low.", "score": 0, "replies": []}]}, {"body": "The market doesn't seem to take any of it seriously, I think what's 'built in' is the assumption JPow will fold and not follow through. I mean the market has been spluttering for weeks because it can't handle a tiny .5% rate rise that they know has to come, that is not a healthy market.", "score": 3, "replies": [{"body": "Well I would agree, especially if 2018 is any indication.  The bubbles far larger now.", "score": 1, "replies": []}]}, {"body": "Its the lack of faith in the Biden admin to take steps to improve the economy that might be counter to Far Left policy points. \n\nOver the last year the Biden admin, has reversed on nearly every pro Domestic business stance, and ignored every warning of the damage their actions could take.", "score": 6, "replies": []}, {"body": "> Now I'd say its a 60/40 chance they would again, even with inflation going near 8%.\n\n8% a year is no where close to hyperinflation. 8% a month wouldn't even be hyperinflation. I've been in countries with hyperinflation. When that happens, when you go to a restaurant for lunch, the prices are already higher when you go back for dinner. That's hyperinflation. 8% is just high range of normal inflation. We've just had unusually low inflation for about 15 years. Before that a savings account gave 5% interest. Why do you think it was so high?", "score": 2, "replies": [{"body": "I'd guess because they adjusted the CPI to exclude housing and to allow substitutions?  But that was something like 25 years ago.", "score": 1, "replies": [{"body": ">  But that was something like 25 years ago.\n\nInterest rates in bank savings accounts were 5% 15 years ago. I just checked an old statement. At the end of 2007 it was 4.9%.", "score": 1, "replies": [{"body": "Sure, the scenario people generally parrot is that in the 90's they modified the CPI, allowing them to blow up the Dotnet bubble.\n\nThen dropped rates again after that, blowing up the housing bubble.\n\nNow they've blown up the everything bubble.  A kind of cyclical boom and bust, every time rates are pushed down the [Schiller housing index](https://fred.stlouisfed.org/series/csushpinsa) goes parabolic.\n\nThough I see what you mean, rates didnt stay low for long leading into 2008.  Though I do still hear many people say without the Fed setting rates too low the housing bubble could have been avoided, in Ted talks and various Youtube interviews.\n\nI guess the counter argument would be that the Fed had no part in the irrational exuberance and that it was a realistic approximation of the true market price of housing.  Its just a hard thing to decipher.  Is this just late stage capitalism or a debt bubble caused by central planning.", "score": 1, "replies": []}]}]}]}, {"body": "CPI Data for February coming on March 10, right before Fed meeting on March 15, if they freaks out from January numbers what their respond will be then? Cars and gas are the most responsible to the higher CPI numbers", "score": 2, "replies": []}, {"body": "Hyperinflation might be hyperbole, but 7.5% a year for 5 years will cut the value of your money in half.", "score": 2, "replies": [{"body": "Well more than that I think, if housing keeps going up.", "score": 1, "replies": []}]}, {"body": "Why do people keep using the word Hyperinflation? People who don't have a grasp of basic economics should not be allowed to post.", "score": 2, "replies": []}, {"body": "got to have a reason to replace it with the new digital dollar they are working on while hyperinflating our debt away", "score": 2, "replies": []}, {"body": "Hyperinflation is 50% a month... a MONTH. We're at like, .5% a month. The USD is still the reserve currency and all our debt is in our own currency... \n\nOnly Perma bears that are wrong 99.9999% of the time are talking about hyperinflation. I caution you against listening to people using the term \"hyperinflation.\" It's mostly people like Mike Maloney trying to sell you gold...", "score": 5, "replies": [{"body": "Ah sure, I more meant like 70's inflation.  I'm likely just using the word hyperinflation carelessly.\n\nIs there something nowadays that prevents 70s inflation, after we adjusted the CPI with owners equivalent rent and other things to soften it?", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "You dont think an interest rate to stamp out this level of inflation will cause a debt crisis?\n\nWhat about this housing bubble that teetered in 2018 when we attempted to raise rates?  Doesnt that act as simple proof this will cause an inevitable crash, which the Fed will swoop in to solve?\n\nThis is where I am worried about inflation.  I just dont trust the Fed to raise rates and stamp out inflation, I see them pumping QE, otherwise I'd be in cash right now waiting for QE to be rolled off and rates to raise.  Which is really the root of the question, am I in the majority or minority?", "score": 3, "replies": []}]}]}, {"body": "Isn’t that how hyperinflation begins? If the debt is denominated in your own currency at some point to pay it back you have to print money which devalues the currency and given the enormous amount of debt the US has I don’t think there’s any way they could realistically pay it back without devaluing the dollar. That’s ignoring all the money printing that’s gone on in the last two years", "score": 0, "replies": [{"body": "To my knowledge, no. All the classic examples (post WWI Germany, Zimbabwe) held debt in foreign currencies. They printed money and exchanged it for that foreign currency. Obviously that would quickly devalue their money as no other country would have much trust in it. The exchange rate would then become much worse, then they have to print even more, and it becomes a never ending cycle. \n\nThe US could print all the money it needs to pay off its debt, and start with a clean slate. Of course that would have other HUGE issues associated with it. But if we owe $100 in USD, there's not much the debt holder can do if that money was just printed out of thin air", "score": 2, "replies": [{"body": "As long as all oil  must be paid for in dollars, according to the deal made in the early seventies, when we came off the gold standars, then all non-iol producing countries need to buy our debt, so they have T notes, denominated in dollars, to legally buy oil. That is the only reason we were able to run our debt this high and triple the dollars in circulation without runaway inflation. \nIf China were to agree to buy all or most of their oil directly from Russia and pay in something other than dollars (say Euros), that might cause the demand for dollars to evaporate and we would see a an economic downturn here of unpredictable size. \n\nIn the short run, I’m more concerned that in 12 years we tripled the amount of dollars in circulation while keeping the volume of goods and services roughly stable. (Not counting the transitory drop in goods/scvs due to covid shutdowns).  If math worked in the global economy, prices of everything priced in dollars should have tripled. But sentiment is a powerful factor\n\nOne last thing to note, they way inflation is calculated has changed since the ‘70 to make it seem lower. If calcuythe old way, our 7% last month would have been more like 13%. \n\nSo, ya know, a lot for us to think about.", "score": 1, "replies": []}]}]}]}, {"body": "Nope.\nLearn about pre WW2 Germany.\nZimbabwe also comes to mind.", "score": 2, "replies": []}, {"body": "No chance of hyperinflation. Zero.", "score": 2, "replies": [{"body": "So why would someone keep their money in stocks if they thought inflation wasnt going to pick up?\n\nI mean you've got record low net domestic savings now, interest rate hikes coming, the reverse wealth effect from housing values dropping via higher rates just as it did in 2018.\n\nWhat upside is left?", "score": 2, "replies": [{"body": "As long as you are avoiding having cash by putting your money in assets, that is the right strategy.  What asset is the question and that depends on so many personal things. \n\nWe are in the trough of economic growth and a period of price discovery that will not end till QE ends.", "score": -1, "replies": [{"body": "You truly believe our economy is healthy when the numbers are only compared to when it was shut down?", "score": 1, "replies": [{"body": "Oh no, that is a different thing.  I'm just talking about avoiding inflation which is the main concern for many right now. The economy is not healthy at all.", "score": 2, "replies": []}]}]}]}]}, {"body": "Currency has been run into the ground, money was printed and rates were low to help many during the pandemic...and now we see the consequences of all that easy money...\n\nIt's that simple, unfortunately", "score": 2, "replies": []}, {"body": "My man Mansa Musa literally crashed the economy in a portion of the world for over 200 years just cuz he felt \"generous\" for the \"poor people\" \n\nSo if you want to talk worth, talk to my homie", "score": 1, "replies": [{"body": "Thats pretty neat, youve got me into some documentaries.", "score": 1, "replies": []}]}, {"body": "Hyperinflation isn't going to happen. The FED can easily tame the inflation we've been seeing, but doing so without causing a recession is where the challenge lies. To my knowledge no serious economist is worried about hyperinflation.\n\nPersistant high levels of inflation however is a concern because it will increase the odds that the FED makes a policy mistake and causes a recession. But high single digit inflation is very far from hyperinflation.", "score": -2, "replies": [{"body": "I agree we are a long way from Hyper Inflation; my question is how can the Fed easily tame inflation?  CPI at 7.5% wouldn’t the Fed need to raise rates somewhere near inflation in order to slow it down?  Last time we had inflation this high Volker raised rates to over 15%.  The Fed can’t raise rates that high without creating the mother of all crashes.  Will be interesting to watch them attempt to thread this needle without creating the recession you mentioned.", "score": 3, "replies": [{"body": "> wouldn’t the Fed need to raise rates somewhere near inflation in order to slow it down?\n\nBasically, no, there isn't a 1-to-1 relationship between CPI and the fed funds rate. They only need tighten enough that it lowers demand to sustainable levels. Generally inflationary pressures wouldn't remain in a recession because a recession almost by definition a recession requires a drop in economic demand. Even a small recession would tame inflation significantly, but obviously the FED doesn't want that. Given the the fact the FED is still stimulating the economy with asset purchases and negative real rates (something you would typically only do if you were trying to increase demand in a low inflationary environment), simply ending the asset purchases and raising rates to neutral would be a significant move.", "score": 2, "replies": []}]}]}, {"body": "I hope the market crashes to 500 and never recovers again.", "score": -4, "replies": []}, {"body": "Is this what you are afraid of:\n\nHyperinflation is a term to describe rapid, excessive, and out-of-control general price increases in an economy. While inflation is a measure of the pace of rising prices for goods and services, hyperinflation is rapidly rising inflation, typically measuring more than 50% per month.", "score": 1, "replies": [{"body": "Ya no, I just used the word badly.  I mean 70's style inflation.", "score": 1, "replies": [{"body": "👍", "score": 1, "replies": []}]}]}, {"body": "Hyperinflation lol. 7.5 is fucking bad, real bad, more than we’ve seen. Still not even near as bad as hyperinflation. If you are so fucking scared go buy gold. If the USD goes to 0 the world is fucked. The euro will be 0. The pound will be 0. If USD is 0 we are beyond fucked.", "score": 1, "replies": []}, {"body": "Hyperinflation is defined as inflation over 50%\n\nThe highest rate one could even stretch is 10% peak to trough, so we are very short of hyperinflation. \n\nThe high prices are due to supply chain issues, making credit more expensive (riasing rates) wont fix a lack of transport capacity, in fact it could make it worse.\n\nInflation really isn't that big of a deal, its kinda a smoke screen in common discourse. I say this not because price changes don't matter but because it leaves out more than half the equation; monetary velocity, wages, and supply side factors all contribute to purchasing power, which is the real value of a currency.", "score": 1, "replies": []}, {"body": "Why do people keep using the word Hyperinflation? 8% inflation is not hyperinflation. 20% is not even hyperinflation. It sucks, but it does not fall into that definition.", "score": 1, "replies": []}, {"body": "Nah, went through this in 1970s and 1980s.", "score": 1, "replies": [{"body": "You think we'd have a Volcker style decision today?\n\nGiven the level of debt, the sky high stock valuation, housing, etc..?", "score": 1, "replies": [{"body": "My take is they go up 25-50 basis points next meeting. Same for subsequent meetings until inflation drops to 4%.", "score": 1, "replies": [{"body": "what would be different now from 2018?", "score": 1, "replies": [{"body": "The difference is that the unemployment is low, and wages have been pushed up. Couple that with supply chain issues, and there is a pretty heavy cost-push effect for inflation.", "score": 1, "replies": []}]}]}]}]}, {"body": "Keep on belllliiiiiieeeving", "score": 1, "replies": []}]}
{"title": "12 Rules for Avoiding Misery", "selftext": "A young teenager contacted me on Reddit, asking me to tell him how he can predict stocks. He asked a person who, after 2 years, still cannot understand how the stock market works, not to mention predicting, but what I realized is, if I ignore his question, he will ask someone else, and I think I am a tiny bit wiser than others who wouldn't mind selling their future for gambling on the stock market. After long typing I realized that it would make sense to post my thoughts here, perhaps someone else might want to read it.  \n\n\nI ended up writing 12 points, even though I didn't plan to write more than 4. Why did I name this post this way? Well if I named it '*12 Rules for Success on the Stock Market*' I would trick many people, since I am not successful at first place, plus the whole idea about this post is to help people be wiser and avoid losing their investments. Once they figure this out, then they can also make profits. If you focus on profits from the very start you might end up having nothing. Plus if I knew how to be successful I wouldn't be here, would I? So here's what I learned in the last 2 years.   \n\n\n**FYI: I learned all of that by making mistakes, so this is just my experience and you shouldn't use it as a guide or the ultimate truth!**  \n\n\n1. **Get to know the company and try to understand the principles as much as you can.**  \nWhat is their goal? What are their promises? What promises have they kept in the past? What is their vision and when should it become reality? How much money do they have in cash? And so on. If everything sounds great or promising then there's SOME hope. \n2. **Go to their website and read their quarterly reports as well as other documentation.**  \nThis will give you a better insight on whether the company is healthy or not. It is obviously not enough but still better than nothing. \n3. **Check if they are hiring.**  \nOften on their websites they might have open positions - if you see a small company like ABGD (Alpha Beta Gamma Delta Inc.) with big promises but you don't know if it's true or not, then you can go to their website and check if they have open positions. In this case with the fake company ABGD, they have a lot of open positions which MIGHT mean that they have the money to pay them, they plan to go big and that's all a SMALL sign that people are working behind it. It is not enough, but if there are 5 open positions in a team of a 100, but everybody is talking about it, then stay away from this hype.\n4. **Read the news.**   \nKeep yourself up to date. Yahoo Finance is a great platform to show you the news from different sources. You don't need to read every single one of them but you need to know what is going on. Don't sit and wonder why your stock is 80% down in the last month.\n5. **Don't buy/sell depending on the news.**   \nOften the media tries to scare or encourage people to do something, one article is not enough to convince you that everything is great. Take your time and don't trust everything you read. Many will get scared sometimes for no reason but remember why you are there. Sometimes it is good to go against the crowd. \n6. **Don't invest in too many companies.**  \nIt might be good to have a diversity in your portfolio because then if one goes down the others will support your finances, but that is often silly because you cannot keep yourself up to date with 30-50 companies, therefore you cannot control your money. But if you have a portfolio of 3-5-10 companies then you have a better control over your investments because you know what's going on and you will know if one day the company goes shit and it's time to pull.\n7. **Don't think short-term - always look at things long-term.**   \nLike 2-5 years. Maybe more sometimes, not 2-5 months from now. Don't be short-sighted unless you want some quick profits. Companies can't grow massively in just half a year, but a stock could. If you are focused on quick profits, then you have to look for a hype, not values or mission. \n8. **Never punish yourself for making a mistake in the past.**   \nYou should learn from the past but you live in the present so if you lose money that doesn't mean you should gamble now to return your loses. You will lose even more this way. Always be patient and learn from your mistakes. Even the richest had to fail many times in order for them to succeed.\n9. **Invest what you can afford to lose.**  \nI know everyone says that but some people really don't know this. If you have $1000 but you think you might need them in a few months then don't invest them. If you think that you only need $500 and you can live perfectly fine with $500 less then invest $500. If you lose them one day then you won't have to stress yourself about it. But if you win, then it'll feel like you have a bunch of apple trees in your garden. FREE FRUITS! Unlike apples, money don't grow on trees but they grow on the stock market. Money kept under your mattress will have the same worth as the mattress one day. \n10. **Take some profits out!!!**  \nDon't make the mistakes that I did where you triple your income in few months and then you let your money there thinking that it will be like that forever! You need to take some profits out. The stocks will always go down, some will go bust, but having some money out will give you the chance to invest more or invest in something new. If you wait until you have 10 or 100x gains, you might quickly end up with a lot less than what you had at the peak, or go minus. Being in minus is fine as long as you remember that you're there long-term and the company will grow again, but having your money stuck there for 2-3 years when you know you could've made even bigger investments if you took the profits out, will only prevent you from getting rich.\n11. **If you don't know much about stocks and what the companies do and you are very emotional person, then invest in ETFs**.   \nThe growth there is small, but it is a great way to preserve your wealth from being eaten by the inflation, plus if you keep investing every month a bit, after 10-20 years this small growth of 1-5% a year, could become 30-50% a year. This should be your retirement money, but if you want to have a house in 10 years from now then ETFs are not gonna be for you.\n12. **Any small profit is a profit.**   \nMost amateur investors lose their money. If you manage to not lose your money and one day leave even with 10% more, you still did well and better than most, so don't hate yourself for missed opportunities. There will be more chances. \n13. **Don't listen to any Redditor online, including me.**   \nAs you can see I am not that competent in what I do because I said there will be 12 Rules, but instead there are 13. We are all here to grow and get rich, but if we knew the secrets, insights, hidden knowledge, and made a great fortune and have a great life etc, then probably we wouldn't sit here trying to inform ourselves and look for the next big thing. The successful people here are a very small percentage. Most of the people are here to fix their mistakes, become better at what they do, and so on. You'll get so many bad pieces of advice and people might trick you into believing in something that is a complete BS, so **if you want to avoid mistakes caused by someone else, then simply listen to no one**. Learn from them, learn from their mistakes and successes but ALWAYS decide what is the best for you! Don't let others do that for you. I hope this will help you to become successful and remember, don't listen to me.   \n\n\nGood luck!", "id": "st08u3", "created_utc": 1644922066.0, "score": 132, "upvote_ratio": 0.87, "num_comments": 75, "comments": [{"body": "I have been investing for about 8 years and I can tell you some of these advices are pretty good/accurate.", "score": 41, "replies": [{"body": "Thank you. I'll be happy to read your experience one day", "score": 7, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Well put, mister. Yes, what I wrote is my experience. Even though I know that you need to take some risks and you'll be better rewarded, I don't think I have the courage to say this to people. I made good and bad investment, some were bad long term others bad short term. That's why I think people should do their due diligence. Perhaps long term for certain stocks won't be ideal since there are many new traders on the market and they're driven by hype, media, rather than real numbers.", "score": 1, "replies": []}, {"body": "Kind of related, I think you have to ask yourself are you investing or trading?  If you're investing then the goal should be long term.  You should close out early if there is no hope but you probably shouldn't buy those kinds of things, anyway.  If you're trading that's entirely different.  It's possible to do both but very important, imo, to understand which you're doing.", "score": 1, "replies": []}]}]}]}, {"body": "Stop talking to teenagers on the internet", "score": 66, "replies": [{"body": "He could have saved that teenager from tossing his house deposit on Nothingcoin or futures and losing it all.\n\nOP is doing a public service.", "score": 21, "replies": []}, {"body": "I randomly had someone randomly in my DMs\n\n\"can I ask a question\"\n\nme \"k\"\n\n\"Do you have any advice for investing\"\n\n\"lol what? why exactly are you asking me?\"\n\n\"communicating with more friends will be more fruitful\"\n\nEdit: my response. \n\n\"what sub did you see me in even dude? just kind of weird to randomly have someone ask me that. My advice is to absolutely not follow strangers investment advice. You're going to get scammed or something. Always research. You can look in my post history to get an idea where I'm at bruh.\"\n\nThe haven't replied when ask", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "U/BackgroundCom \n\nOne month old account,  no comment or post history basically.  Def sus", "score": 1, "replies": []}]}]}, {"body": "I for one don’t think he’s a pedo", "score": 1, "replies": []}]}, {"body": "I got to point 13 and realized that everything I read was absolutely worthless. Well play OP, well played", "score": 13, "replies": [{"body": "Well I got your joke so don't worry about it haha", "score": 5, "replies": []}, {"body": "If you see someone post on Reddit that it’s raining you can look out the window to check. But don’t go buy an umbrella and a rain coat without looking out the window yourself. I think that’s what point 13 means", "score": 2, "replies": [{"body": "I think you're right, and I also think I was making a joke. I guess it didn't land", "score": 5, "replies": [{"body": "Oh gotcha I missed the joke. I saw others making similar comments in earnest", "score": 2, "replies": []}, {"body": "Nope, it didn’t.", "score": 0, "replies": []}]}]}]}, {"body": "I’ve got some advice. Whenever I make a trade do the opposite. You will basically be printing money.", "score": 5, "replies": []}, {"body": "Saving this post. I respect when fellow investors are selfless and post their knowledge. Kudos.", "score": 3, "replies": [{"body": "Thank you for the nice feedback, sir", "score": 1, "replies": []}]}, {"body": "Or just DCA into SPY and call it a day.", "score": 5, "replies": []}, {"body": "TLDR\n\n> 13. Don't listen to any Redditor online, including me.", "score": 2, "replies": [{"body": "SPOILER ALERT!", "score": 2, "replies": []}]}, {"body": "The only one I agree with is #13 :)", "score": 2, "replies": []}, {"body": "What data do you have to support ANY of the above gives better returns then passive investing.  To suggest it is clearly wrong and worse propagating misinformation to another young wannabe investor.\n\nThe data clearly shows individual stock investing is a loser's game.\n\nSPIVA study (active vs. passive investing) website shows results passive investing in sp500 beats 70% of all active funds (trying to pick individual stocks) in just 10 years and 80% in just 20 years.  That is short period of time since most investors horizon is more like 40+ years.\n\nBHB and BSB were the seminal studies published in JFA showing pension fund managers choices of stocks and market timing (alpha) LOST them money vs. just their asset allocation.\n\nDalbar studies clearly show individual investors dragging several % points every year vs. the index.\n\nOr how about only 20% of ALL stocks beat the index in just the last 10 year period showing the chances of picking the winners is not likely no matter what you like to think. https://www.morningstar.com/articles/1035348/how-many-stocks-beat-the-indexes\n\nSo not sure where the data is that any of the steps above make one a better investor then the passive investor who doesn't know anything about investing let alone the claim,\n\n*\"The growth there is small, but it is a great way to preserve your wealth from being eaten by the inflation, plus if you keep investing every month a bit, after 10-20 years this small growth of 1-5% a year, could become 30-50% a year. This should be your retirement money, but if you want to have a house in 10 years from now then ETFs are not gonna be for you.\"*\n\nThe data is clear if you think index funds can't buy you a house individual stock investing is more then likely to make one poorer.\n\nMy advice to any young investor is don't trust any of us and do your own DD.  I included the exact studies above to get one started.  Also here are several excellent beginner books on how to actually invest (nothing close to this post)... 1.  Jack Bogle's \"Little book on common sense investing\" and 2.  Allen Roth \"how a second grader beat wall street\".", "score": 2, "replies": []}, {"body": "Strongly disagree with #6. People who invest in the total market far outperform individual stockpickers. Even based on technicals its impossible to predict where a company will go. The bulk of your portfolio should be heavily diversified, then if you want, you could overweight into certain sectors/companies by buying individual stocks. \n\n\nAlso, #9 is just plain wrong. Its something the wsb guys say to eachother. In other words, investing what you can afford to lose is a healthy mindset for a gambler. But real investing isnt gambling.", "score": 8, "replies": [{"body": "I disagree with both of these. #6 is in regards to people holding dozens of individual tickers. OP did not say to not hold funds just that new investors sometimes pick up 30+ individual stocks which is much harder to actually follow and research than a small handful. I didn’t see him say to avoid indexes at all but this is geared towards people investing in individual companies \n\nIn regards to only investing what you can afford to lose this to me is the same as saying don’t invest your emergency fund. Don’t invest your house down payment. Don’t invest money you actually will need to use in the next several years. Which is very sound investing advice", "score": 11, "replies": [{"body": "Exactly, don’t sell the house or refi and put it all into investing in something,  market/crypto/etc. Gamblers mindset goes both ways, “spend what you can afford to lose” as well as “all in” cause it’s a “guarantee”. Of those two one is a better mindset than the other.", "score": 1, "replies": []}]}, {"body": "As for #9, remember it is **always on the cards** that **you could lose all the money**. And if you invest more than you can afford to lose, well then you'll be right up the creek with no paddle in sight.", "score": 4, "replies": [{"body": "You **might** eventually lose all of your money if you invest it.\n\nYou **will** eventually lose all of your money if you don’t.", "score": 0, "replies": [{"body": "If I squint at this comment, it is correct, because inflation.\n\nHowever, if I do not squint, I see that you say inflation will cause you to lose *all* your money, which is simply false.\n\nFor you to lose all your money due to inflation, the Fed would have to print no less than an infinity of dollars.\n\nHowever, for you to lose *all* your stock value, all that has to happen is a business goes bust. Even if you're invested in the holy AAPL, they could go bust. Even if you're invested in an index, look at the Great Depression.\n\nSo, yes, investing is good, invest some of your money.\n\nBut do not invest more than you can afford to lose.", "score": 2, "replies": []}]}]}, {"body": "where do you draw the line on #9 then? how much of your net worth is currently in the market", "score": 3, "replies": [{"body": "For me personally I carve out a very healthy emergency fund and a smaller cash reserve. I like to have about a year of core expenses in cash. This is because I have a mortgage and bills so I want to be prepared for the worst case scenario (my wife and I lose our jobs, someone gets seriously ill, etc) and I really don’t want to be forced into selling my investments.\n\nOverall I have about 90% of my money invested and 10% in cash. But this is an extremely personal decision that every individual needs to make for themselves. What are your expenses and commitments? What is your risk tolerance? How much capital do you have and why are your time horizons. Those are the questions that go into cash vs investing calculus", "score": 2, "replies": [{"body": "I have used that setup of 90/10 which is effective when you have a disciplined system. the mistakes are more noticeable when you’re using a high concentration % of your account such as trying to recover FUBO losses by shorting into a bounce lol. Now in current market conditions I’m more comfortable utilizing ~50% of my account and looking for short term 1-2% account gains. Also I trade both directions and usually only mid/large caps (minimum $1B)", "score": 1, "replies": [{"body": "I should also mention that of the 90% of my money that’s invested, half is in indexes and 70% of the remainder is in what I consider extremely strong blue chips. I’m not trying to maximize the value of every penny in my portfolio at the cost of increased risk", "score": 2, "replies": [{"body": "that’s good diversity, I mix between individual stocks and sector ETFs, I had a great January from being hedged with short positions in both TQQQ and SOXL", "score": 1, "replies": []}]}]}]}]}, {"body": "I think that number 9 is a wise rule to follow for new investors or for anybody that has less of an appetite for risk . New investors may not know about proper positioning of your portfolio to balance risk amongst your investments.", "score": 1, "replies": []}, {"body": ">Strongly disagree with #6. People who invest in the total market far outperform individual stockpickers. \n\nI don't think that is true. If you have any idea of what you are doing you are probably better off holding a funds holding companies from various industries and build your own representation of the market. I wasn't day trading or swing trading before 2020, but my positions greatly outperformed both the S&P and the Nasdaq from 2008 to 2020. Index funds have way too much shitty companies included.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Idk I have had several people message me and ask me investing questions based on nothing more than a comment they have seen me make. I never established their ages or whatever but it does surprisingly happen", "score": 12, "replies": [{"body": "Just letting you know, those peoples are probably just trying to scam you not asking you tips because they think you are a great trader lol.", "score": 3, "replies": [{"body": "Many are but I’m sure at least one is genuine, although to be fair he did reveal his age to me and is mid thirties like myself. But you are correct many scammers do reach out", "score": 1, "replies": [{"body": "Haha yeah, I don't doubt that some of them are genuine, but when I post here or on other subs related to money I get so many scammers messaging me every days.", "score": 2, "replies": []}]}]}, {"body": "No you must be wrong, because the comment above is a mind reader and is also the guru of all things, so if anyone would message anyone, it would be them, and as they haven't had any messages it can't Possibly be true /s", "score": 4, "replies": []}]}, {"body": "Why so toxic", "score": 10, "replies": []}, {"body": "Dude there's thousands of teenagers on here with no idea what they're doing. Some of them bullshit that they do know. Some of them actually ask people for advice.", "score": 3, "replies": []}, {"body": "do you need a screenshot or what? plus it's up to the audience to decide what they wanna do with this info.", "score": 6, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "I don't know what pills you're taking, man. Feel free to hate, but I learned a lot from the internet and random people and I want to share my experience. I wouldn't have done it if a boy didn't ask me for it, but now that I replied to him I thought it'll be good for others to hear my experience. If I knew some of these things 2y ago I would've had 4 times more than what I have today. I am not rich, but if some noob like me has this knowledge before their first investment I bet they'll make more than what I made, so by sharing my experience and mistakes people will at least have some awareness. You can cry all day that I have an imaginary friend but that's not an argument to what I wrote, just sayin'\nIf you have something interesting to say you can always post like me, that's why we have Reddit. I'll be happy to read your stories, I'm still learning", "score": 2, "replies": [{"body": "He's mocking you because despite your admitting you screwed up, your 12 points of advice show you've not taken the correct lessons from the experience", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Which of his advice is shitty?", "score": 2, "replies": []}]}]}, {"body": "Which of his advice did you think was bad? This seems like pretty boilerplate investing advice overall", "score": 1, "replies": []}, {"body": "Why don't you post better?", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Nice one!", "score": 2, "replies": []}]}, {"body": "People who have been in the market for years understand that there are people who are over emotional, read more into what is written or can't read, have a voice but not much else, and in general want to act like they are two years old.  Point 14: Misery loves company.", "score": 1, "replies": []}, {"body": "> Don't invest in too many companies.\n\nThis is my sin but I can't ignore a good company. I like to collect them.", "score": 1, "replies": []}, {"body": "I have an issue with rule 9. If we keep cash, we lose against inflation. If we invest (not gamble or yolo) we should just invest what we are willing to lose. \n\nInvesting is long-term by default, and the assumption is that long-term, stocks go up. Isn't it that you shouldn't invest money you will need in the next year? That is, emergency fund + expected expenses (however big they are)\n\nOtherwise, I need a ELI5 for this contradiction...", "score": 1, "replies": [{"body": "Okay yes I didn't notice that I contradict myself a bit. I guess my point was is to invest what you can afford to lose (your example is good) so our money don't devaluate because of inflation, because let's assume the ETFs in a very long term are always going up, so 10-20y later you will have preserved the value of your money and probably doubled or tripled.\nBut yeah, if you are willing to lose some money then that equals of you gambling your money which leads me to the old conclusion that \"investing\" is a different synonym for gambling. I guess here it'll be very hard not to contradict myself. Thanks for noticing it!", "score": 2, "replies": []}]}, {"body": "\"13. Don't listen to any Redditor online, including me.\"\nIncluding this? Is this a riddle? What!?? :D", "score": 1, "replies": [{"body": "Checkmate", "score": 1, "replies": []}]}, {"body": "Good post! 👍 Thx for sharing!", "score": 1, "replies": []}, {"body": "What’s the best way to ‘take some profits out’ for example I have $400 of Disney stock. It’s up 9% on a great earnings report. It’s likely to drop back down for a while once the hype passes. Should I be selling some of that stock now and buying back when it falls to normal levels? If so how much is sensible. In the long run I don’t want to sell my Disney stocks", "score": 1, "replies": [{"body": "It's hard to say because it's hard to predict it. In that case you should trust your guts but whatever happens you should not make regrets, or if you sell and then jumps higher you shouldn't suddenly try to buy back at a loss. I did that with SPCE when it was 24$ then I thought it'd drop as always so I sold everything, but it went up, so I bought again and lost few shares, but now the price a year later is around $9. I could've sold earlier at $50 but then I told myself that what I did back then was stupid so I don't want to sell again. Well because of my foolish mistake, I made another mistake by not taking profits out (I doubled my money) and now I am 70% down. If I took the money out, I could've bought much more. Anyway, as you see, one silly decision can lead you to a bigger mistake. That's why I mention that you should always take some profits out. Imo 9% isn't much, and if you believe in it long term then keep investing small portions when the stock dips. If you want to take the risk then do it, just don't end up like me, and don't regret what you did in the past. Good luck man", "score": 1, "replies": [{"body": "Thanks for the good reply :) my gut says to just leave it alone for the next 5 years and keep slowly adding to it - and whatever will be, will be.", "score": 1, "replies": []}]}]}, {"body": "Marry the right woman.\n\nEdit: oh... I noticed after the message that it was about stocks.  But either way, it helps.", "score": 1, "replies": [{"body": "Or the right man", "score": 2, "replies": [{"body": "So true!", "score": 1, "replies": []}]}]}, {"body": "Thank you. Will our order be filled with the closing price of the previous day or the future price when the martket opens? Thank you.", "score": 1, "replies": [{"body": "Depends on your order type. If it was set for market price, then it’ll be when the market opens. If it was a limit price, then it’ll sell at a price at least that at limit or buy at a price below the limit.", "score": 1, "replies": [{"body": "Can you clarify the limit price?", "score": 1, "replies": []}]}]}, {"body": "I like most of these except the take profit - I think it’s fine but it shouldn’t be a rule but an exception, bc u need the money or found a better opportunity but not just because u think it’s high and u need to take a bit off.  Just my opinion though.", "score": 1, "replies": []}, {"body": "I just get drunk and sell weekly CC's and margin secured puts. It's worked out fantastic this year so far.", "score": 1, "replies": []}, {"body": "Two years and you STILL can’t understand the stock market… cute", "score": 1, "replies": []}]}
{"title": "Past month has been good", "selftext": "https://imgur.com/a/e9XF07L\n\nThe % is way inflated because I withdrew 20K. I’ve got no one IRL to talk about stock stuff with so I’ll recap this months activities.\n\nGoogle calls on earnings, sold next day to bump the account a ton.\n\nThen I started buying shares of NVDA, COIN, and DIS, and selling calls against them right at the price I bought, basically just counting the premium as my goal profit.\n\nMargin was active since I’m stupid, but that allowed me to sell 10-15 calls, depending on the stock.\n\nThen bought Spy puts it expiring 4/14 last week which made me about 12K. Sold them today cause the market seems too stupid.\n\nJust gonna buy stocks I like now, but immediately sell calls against them, so if they get called away, I made my weekly profit, and if not, I like the stock.\n\nAlso, I’m awful at this. Still down 70K all time, so not worried about capital gains tax.\n\nHope the tendies find you all during these manipulated times. Take profits, treat yourself, and kiss pelosi.\n\nFlare me.", "id": "ssp7pe", "created_utc": 1644883996.0, "score": 233, "upvote_ratio": 0.92, "num_comments": 76, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|138|**Previous DD**|\n**Account Age**|8 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=ssp7pe)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=ssp7pe)", "score": 1, "replies": []}, {"body": "The line that describes WSB in a nutshell: \"Still down 70K all time\" 😂", "score": 259, "replies": [{"body": "I just wanted everyone to know I still belong here, despite my crayons being green this month.", "score": 106, "replies": [{"body": "![img](emote|t5_2th52|4887)", "score": 22, "replies": []}, {"body": "This is the way", "score": 2, "replies": []}]}]}, {"body": "Here I am thinking OP is a champ (\"past month has been good\") and then 7 paragraphs down there's the \"still down 70K all time\". \n\nYou definitely belong here (just like the rest of us).", "score": 59, "replies": []}, {"body": "Here here! A toast to the highest degree! Selling calls right now is like selling puts back in summer of 21 - Bank it…", "score": 36, "replies": [{"body": "It’s literally safer than just buying shares. I’m buying shares, and selling calls immediately against them. Takes $10-15 off each share price, so if there’s a 5-10% move, recovery is way easier than outright buying shares.\n\nYou also win theta on flat days like today. I just exit these trades as soon as they net me 3K daily.\n\nI’m so dumb I thought your post was sarcasm lmao", "score": 18, "replies": [{"body": "I wish I had the money to buy in batches of 100", "score": 6, "replies": []}, {"body": "I’ve been selling itm calls, it’s been nice, for the most part", "score": 2, "replies": [{"body": "I feel like it's a hack no one talks about. I try to make it a rule not to sell shares unless they get assigned. I've picked my sale price, and ITM premiums provide a great cushion if things tank. It's better long term downside protection than strategies involving puts imho. \n\n\nI'm not ashamed of selling a call ITM and buying a way OTM call for cheap. It's insurance against my own very bad FOMO emotions kicking in. Even if it's a sub optimal strategy, I'm still better off overall then falling in love with shares and refusing to risk them. \n\n\nPlus, I don't have to worry as much about another unfortunate error where I lost out on thousands because I missed the bell by 4 minutes and didn't close out a few contracts in time.", "score": 2, "replies": [{"body": "An otm cheap call is cheap insurance for your insurance, very smart, net credit achieved, hadn’t considered that", "score": 2, "replies": [{"body": "We've seen too many huge swings recently, especially the tech giants doing crazy things after hours. For sometimes literally a few dollars, I sleep better at night.", "score": 1, "replies": []}]}]}]}, {"body": "How do you protect downside?", "score": 1, "replies": [{"body": "Just selling CC’s is enough downside protection for me currently. If NVDA moves 5% south, the calls will drop enough for me to roll to a lower strike price and continue covering the downside at a steeper level.", "score": 5, "replies": []}]}]}, {"body": "Dude, Covered call is same as naked put selling....he is still selling puts, just not directly.", "score": 2, "replies": [{"body": "That’s why you have to do cc’s on companies you actually like, shares don’t expire", "score": 4, "replies": [{"body": "If the pay off is same, what is the point in covered calls?", "score": 1, "replies": [{"body": "More trades then transaction fee probably waved to the minimum would be my guess", "score": 1, "replies": []}, {"body": "The pay off of selling naked puts being the same as covered calls? They’re very different trades", "score": 1, "replies": [{"body": "Not really, model the pay off diagram and you will see they are the same", "score": 1, "replies": [{"body": "Very different risk profiles tho. There’s a reason ones a level 1 option and the other is level 4. Also Naked puts are bullish play and cc’s are generally a hedge against sideways or downward movement", "score": 1, "replies": []}]}]}]}]}, {"body": "Honest question, how is selling calls against shares you own the same as selling a naked put? Because the potential max loss is the same?", "score": 1, "replies": [{"body": "Scenario 1, stock moons: naked put goes to zero you keep the premium. In covered call too you only  keep the premium because stock gets called away\n\nScenario 2, stock craters: you are assigned the shares at (strike price- premium). Same thing in covered calls, you get to keep call premium and reduce the cost basis of the stock, but the stock is in the ditch. \n\nScenario 3, stock price stays same: both cases you get to keep the premium.\n\nIn covered calls, you buy the stock first, but in naked put you buy it only when it is assigned.", "score": 1, "replies": []}]}]}]}, {"body": "You will become stone if you kiss pelosi", "score": 5, "replies": []}, {"body": "What", "score": 3, "replies": [{"body": "Uhh…green good", "score": 10, "replies": []}]}, {"body": "Sick. Any big moves on NVDA for earnings or just covered calls?", "score": 4, "replies": [{"body": "Just five covered calls, will open more tomorrow when margin kicks back in.\n\nI figure if they blast off, then I guaranteed my 1K per CC. If they go down, I don’t see them losing more than 10% in value, so recovery should be easy.\n\nI also see them beating earnings in general, but we’ve seen major tech like GOOGL crush earning, announce a split, and then fade their post earnings gain in a week.", "score": 2, "replies": [{"body": "True. Tech seems to either demolish earnings or completely blow it. 10% in either direction followed by consolidation over the week. I might end up setting up a strangle / straddle.", "score": 3, "replies": []}]}]}, {"body": "Not many folks making money right now so good\njob", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)", "score": 3, "replies": []}, {"body": "Congrats and fuck you", "score": 5, "replies": []}, {"body": "“Still 70k down” I love it.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "…brother?", "score": 2, "replies": []}]}, {"body": "same + 15k but -65K overall", "score": 3, "replies": [{"body": "It’s a journey 🙏", "score": 2, "replies": []}]}, {"body": "Straddle might be the play. Selling the winning side on Thursday, and holding the other through consolidation, but that might require a further expiration, like a month or so.", "score": 2, "replies": []}, {"body": "You had us in the first half 😝", "score": 2, "replies": []}, {"body": "I like the approach. Hope you will break even soon in this crazy market! ![img](emote|t5_2th52|4887)", "score": 2, "replies": [{"body": "Thanks 🙏 Hoping to be back to flat by end of summer.", "score": 1, "replies": []}]}, {"body": "solid month.", "score": 2, "replies": []}, {"body": "Damn 🤑", "score": 2, "replies": []}, {"body": "I also posted a gains post and it wasnt that well received either!? I wonder why?", "score": 3, "replies": [{"body": "Well congrats anyway! I’m sure you’ll sleep just fine with cash instead of approval 💪", "score": 6, "replies": [{"body": "Agreed!", "score": 2, "replies": []}]}]}, {"body": "Imagine how much more you could’ve had using a respected brokerage.", "score": 2, "replies": [{"body": "Yawn", "score": 1, "replies": []}]}, {"body": "\"Im awful at this still down 70k\"\n\n\"take profits treat yourself\"\n\nM8 you are horrible at this you lost more money in a year then most morons have in student debt and you keep going.  Its time to admit you have a problem and buying yourself nice things isnt a good solution.", "score": 0, "replies": [{"body": "I’m down 70K account lifetime. I was doing awful stuff early on like Tesla weeklies or weekly spreads. \n\nKeep an eye out for the post where I’m finally positive lifetime in a few months.", "score": 1, "replies": []}, {"body": "> you lost more money in a year then most morons have in student debt \n\nHard pressed to call out morons when you don't know the difference between then and than", "score": 1, "replies": [{"body": "You judge people based on english ho boy incel have fun with that :P", "score": 0, "replies": []}]}]}, {"body": "options on qyld???", "score": 1, "replies": [{"body": "I had a really large position in QYLD, as I was going the dividend to retirement route, so I had bought some puts as a hedge.", "score": 3, "replies": [{"body": "I don’t see a reason for that 🤣", "score": 1, "replies": [{"body": "I don't see a reason not for it. They were $10 and would be profit in the case of a marketwide crash.", "score": 4, "replies": []}]}]}]}, {"body": "I cannot believe im seeing “qyld” and “options” in the same sentence.", "score": 1, "replies": []}, {"body": "ATM covered call is same as selling ATM put...\n\nWhat is the point of covered call? Dividends?", "score": 1, "replies": [{"body": "You can’t sell naked puts on margin, and I’m ‘stupid’ enough to use margin to buy shares for CC’s.", "score": 5, "replies": []}]}, {"body": "I'm just trying to get educated here. You bought shares of NVDA and then sold calls against them--that's a covered call right? Do you mind telling me a bit how that works to get you a weekly profit?", "score": 1, "replies": [{"body": "Sure!  \n\n\nSo say I buy NVDA for $200 a share, or 20K for 100 shares. I then immediately sell a call at the $200 strike price for that week, and get paid $10 per share, or 1K for the week. If the stock goes up at all, I make 5% on my money that week. Now, really for a $200 security, the weekly ATM calls will actually be like $600-700 in my experience, but because I'm using margin, my % profit on my actual money is increased.  \n\n\nIf the stock goes down, I have a few options that are left up to discretion. \n\nI can sell another call for the following week at that same strike price, despite the underlying going down.\n\nI can wait for the underlying to hit my original purchase price, and then sell another call at that strike price.\n\nI can consider the premium I collected from week 1 as simply lowering my cost basis, and sell a new call at the original strike price minus the previous weeks premium.\n\nThere's a couple more paths, but they're all essentially either waiting for the underlying to move or selling calls now. Personally, I have been selling calls immediately, as I don't want to assume the underlying will \"move up,\" so the second option is usually what I do, and just have a smaller profit for week 2.\n\nHope this helps!", "score": 2, "replies": [{"body": "Thank you so much for the write up, I understand it a lot more now. I’m going to try this on some NYSE simulator to see what you mean in action. I really want to get into an investing career but it’s one thing to read definitions in textbooks and another to hear from someone’s real experience. \n\nThanks!!!", "score": 2, "replies": []}]}]}, {"body": "How much did you make selling calls?\n\nIn my estimation, you need to be holding A TON of shares for it to be worth it.  Otherwise, it's pennies.", "score": 1, "replies": [{"body": "Each call sold is about 1K each, give or take. I made a ton on COIN though, their premiums were nutty compared to others.\n\nI’m using margin, so yes, I needed multiple of 20K to make income. The account is at 60K cash now, and with margin, that enough for 8 calls worth of shares on NVDA. But even 4K a week compounds quick.", "score": 1, "replies": [{"body": "How far OTM do you go and how far out?", "score": 1, "replies": [{"body": "I don’t go OTM at all, I go directly where I bought them. That gives me “maximum downside protection” while being okay with just making that premium a week if the stock goes up/stays flat. Really, if the stock stayed flat, I would roll those out to the following week.\n\nI do weekly expirey since the intent is to be perfectly fine with maximizing premium and not holding shares.", "score": 1, "replies": [{"body": "Seems like a pretty decent strategy, aside from using margin.  If you buy the 100 shares per call on margin, but the stock tanks and doesn't recover for a while, you're kinda screwed, no?", "score": 1, "replies": [{"body": "Using margin definitely increases the risk a bunch, but I have a decent income IRL to offset that risk and DCA if it stays down for longer than 2 weeks.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Instead of selling callson the stocks u buy y not run the wheel sell the put if u get assigned then sell the calls?", "score": 1, "replies": [{"body": "You can’t sell puts with margin. This is essentially selling puts, but with margin.", "score": 1, "replies": []}]}]}
{"title": "Arguments against a crash?", "selftext": "[removed]", "id": "st17h9", "created_utc": 1644925800.0, "score": 6, "upvote_ratio": 0.59, "num_comments": 78, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|1 year ago\n**Total Comments**|19|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/qucz6m/gores_guggenheim_polestar_dd_35_pt_seeking_alpha/) [x](https://www.reddit.com/r/wallstreetbets/comments/quhq3n/polestar_spac_dd_its_at_15b_now_so_unbanned/) [x](https://www.reddit.com/r/wallstreetbets/comments/quhsvm/polestar_is_extremely_undervalued_years_ahead_of/) [x](https://www.reddit.com/r/wallstreetbets/comments/quhw1r/polestar_is_extremely_undervalued_years_ahead_of/) \n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=st17h9)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=st17h9)", "score": 1, "replies": []}, {"body": "The market is irrational", "score": 10, "replies": [{"body": "So is the fed at this point.", "score": 3, "replies": []}]}, {"body": "The market ultimately wants to go up. Any major pullback will be temporary. The U.S. economy is too big to fail. This has been demonstrated countless times. Buy during fear, trim the excess during euphoria. This is key.", "score": 17, "replies": [{"body": "We aren’t in the fear stage if everyone is still buying the dip.", "score": 9, "replies": [{"body": "At this point buy the dip will only work if the FED is willing to sacrifice the dollar. We hit rock bottom with interest rates and inflation is now the only valve left to rescue markets. If you dont mind gaining in the stock market while paying 70$ a gallon at the gas station then good luck.", "score": 5, "replies": [{"body": "#Did they mind paying 30? NO INFLATION IS PRICED IN ONLY THE STRONG SURVIVE THE PONZI SCHEME MUST KEEP GOING", "score": 2, "replies": []}]}, {"body": "Wasting money… people were “buying the dip” weeks ago and it’s still going down. I’m not even considering a buy til mid spring if not summer.", "score": 3, "replies": [{"body": "I put a large chunk of my holdings into $IAU\n\nI feel like gold is going to breakout this year, especially with all the consolidating over the last year if you really take a look at it", "score": 2, "replies": []}]}, {"body": "Those that are buying are smart. I wouldn't necessarily go all in on everything but I'm adding once my positions get into the oversold or below average readings.", "score": 2, "replies": [{"body": "I have 1/3rd of my holdings in gold rn and the rest in biotech warrants on a high conviction play", "score": 1, "replies": [{"body": "Uhhh", "score": 1, "replies": [{"body": "Imagine being this smart and dumb at the same time😩\n\nYou have no idea how much I’m hurting rn", "score": 1, "replies": []}]}]}]}, {"body": "Bingo", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "There's a lot of differences from then to now, primarily the access to and accuracy of market information. \n\nOne of the greatest aspects of consumer debt is student loans. A forgiveness program and short term tax increase would suffice to satisfy a 'Great Reset'.", "score": 1, "replies": []}, {"body": "Good thing things have changed since then…….", "score": 0, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "WW3 isnt happening", "score": 0, "replies": []}, {"body": "We've been close to ww3 as soon as ww2 ended", "score": 0, "replies": []}, {"body": "That and slavery was abolished...", "score": 1, "replies": []}]}]}, {"body": "The dutch are doing just fine, thank you for your concern", "score": 0, "replies": []}]}, {"body": "Exactly this.", "score": 2, "replies": []}, {"body": "Yes I agree, in the longterm. But why wouldn't the market crash in the near term now that big brother Powell isn't supporting it?", "score": 1, "replies": [{"body": "The market has been popularized substantially lately. I have family members and kids approaching me that never discussed the market before, asking about where to invest. This was never the case when I was younger. I can only assume it's FOMO. People are jumping in at the sign of an all-clear.", "score": 2, "replies": []}]}, {"body": "Believe it or not there are plenty of companies who will prosper in a higher rate environment - banks and insurance cos at a minimum but there are many more. The cos that will hurt the most are those growth companies who now will have to pay more to access capital.", "score": 1, "replies": []}]}, {"body": "plucky desert oil ossified plants fanatical drunk stocking roll ancient", "score": 5, "replies": [{"body": "Classic \"it works until it doesn't\" scenerio.", "score": 1, "replies": [{"body": "Or I don’t know I just work here.", "score": 1, "replies": []}]}, {"body": "But prices are going up now on everything due to inflation. Which means assets are going to inflate as well. Sure companies’ costs are going to go up but they have pricing power to increase their incomes as well. The net result will be larger profits but with a less expensive dollar. Stock prices will increase if multiples stay the same. Therefore, market will go up.\n\nIf profits in real terms stay exactly the same but the dollar is worth half of what it is, the market should theoretically double.\n\nThat’s the long term though. Of course short term there’s going to be a little pain ripping the bandaid off with higher interest rates. But it’s anyone’s guess how much that’s going to hurt versus when the market finally seems cheap again because the dollar is worth less.", "score": 1, "replies": []}]}, {"body": "Good DD.\nChart looks high therefore crash, got it.", "score": 3, "replies": [{"body": "It was more so that the chart showed that the market is highly correlated with the Fed's balance sheet, which will be shrinking.", "score": 2, "replies": [{"body": "It's almost as if stocks didn't go up before -08", "score": 1, "replies": []}, {"body": "a) your timeframe for the data is probably too small\n\nb) Use scientific methods if you want to claim real correlations. At first glance I'd assume it will be hard to find any in this chart, not to mention the external factors that led to that amount of QE. What you do is just tell us: \"I saw this and it looks kinda high right now and fits my narrative that I think it's high and because it's high, it will (maybe, eventually, someday?) fall.\" But yes, looking at charts that seemingly fit your opinion is much easier.\n\nc) Just think about it for a sec: if it was THAT clear that a crash is in proximity, every reasonable professional with double the brain cells of entire WSB (which is likely just a normal person) would call their clients, family and lovers NOW and tell them to GTFO stonks. Why don't they do it? Because they don't fucking know.", "score": 1, "replies": []}]}]}, {"body": "Oh is that why the market crashed in 206-2018 when they actually started raising rates. Can you show me on the chart where it crashed during those years please....", "score": 4, "replies": []}, {"body": "Ebb and flow player. It will happen just knowing when. The double bind system has always occurred.  1929 crash it wasnt until the worst quarter that occured 1937 with the third quarter going into the 4th quarter unemployment went to 20+% ... 1971 oil crisis 1979 energy crisis.  2008 recession... it was set to occur in the trump presidency but with covid it eased this trend off for a little while longer. There will be a technological advanced similar to the industrial revolution where several sectors will be eliminated due to sophisticated technology. I could keep people up at night with the evil behind quanitative easingggg. The fed is propping for THE biggest drop yet. In reality it's all an experiment grab the 🍿 🍿 🍿", "score": 2, "replies": [{"body": "Yes but when will we see robots at McDonald’s and Amazon drone delivery? When will we see AI doctors and designer genes?", "score": 2, "replies": [{"body": "If you're not apart of the ground breaking accomplishments then you're just a spectator.  i would just be making assumptions. Know this it will happen. And as for making lives better it'll just make humanity more efficient.  Such as on demand hot water.  I've got doubts on Amazon drone because of the constant air tracking system we use and anything over 300 ft has to be registered to the faa and have a point a and point b destination.", "score": 2, "replies": []}]}, {"body": "What difference does it make was match 2020 a crash? Maybe Did we rebound yes the infinite printing will continue", "score": 1, "replies": [{"body": "You haven't even seen it yet young blood there's a deeper down we still can go...", "score": 1, "replies": [{"body": "I saw 420 a few weeks ago. We didn’t even stay there that long just a blip on the radar. This isn’t March 2020", "score": 1, "replies": [{"body": "Now tell me again. This isn't march 2020 playboyyyy", "score": 1, "replies": []}]}]}]}]}, {"body": "Gtfo", "score": 2, "replies": [{"body": "He’s a 🌈🐻", "score": 0, "replies": [{"body": "Looks like it the bastard", "score": 1, "replies": []}, {"body": "These bears will sell their mums panties for crashing the market", "score": 1, "replies": [{"body": "30 trillion in debt and still going strong spy to infinity and beyond. 😎", "score": 1, "replies": []}]}]}]}, {"body": "But during those 14 years, the fed has raised rates multiple times before. This is not something novel. It's called normalising policy. They can't keep rates at zero forever.", "score": 2, "replies": []}, {"body": "No. If they do it won't last forever. It will cause another bound of money printing until they see things going up again.", "score": 2, "replies": [{"body": "What has stopped money printing before ?", "score": 2, "replies": [{"body": "That's what I'm saying, perceptions and inflation expectations but a brake but it won't stop", "score": 1, "replies": []}]}, {"body": "Yeah, but that's after the market has already gone down, right?", "score": 1, "replies": []}]}, {"body": "It Will Not. DWAC will.", "score": 0, "replies": []}, {"body": "Fed going to raise rates and taper?\n\nMm.. they didn’t do anything at all yet…\n\nThey are in the corner. Say they hike a few times, everything tanks, they stop again an d the crazy buying goes on again… what’s their role except pleasing financial markets?!", "score": 0, "replies": []}, {"body": "Everytime the Fed has raised rates for the first time in a new cycle, the market has been up a year later.", "score": 1, "replies": []}, {"body": "One word: History", "score": 1, "replies": [{"body": "My argument is also built on history, Fed balance sheet grows= stocks increase, Fed balance sheet shrinks, stocks decrease", "score": 2, "replies": [{"body": "Predicting the short term is impossible. However I know for a fact our market will be more than 10-20% higher in 5 years", "score": 2, "replies": []}, {"body": "But over time, the market increases.", "score": 1, "replies": []}, {"body": " a growing balancd sheet is considered a stimulus. Are you seriously suggesting that a stimulus stimulates? Ground braking!", "score": 1, "replies": []}]}]}, {"body": "Here is the real information.  Still S&P is undervalued\n\nhttps://www.yardeni.com/pub/valuationfed.pdf", "score": 1, "replies": [{"body": "This compares stocks to bond yields. If S&P stocks are in a bubble, treasuries are in a bubble of epic proportions. It’s a super bubble😬", "score": 1, "replies": []}]}, {"body": "Because it always does the opposite of what reddit thinks it will do.", "score": 1, "replies": [{"body": "reddit seems pretty divided on this", "score": 1, "replies": []}]}, {"body": "If you have been thinking about going cash gang more before fed starts to taper, this is the day/week to start accumulating.", "score": 1, "replies": []}, {"body": "Market will crash if the people buying are doing do on debt.  Long term, the market goes up from inflation.  Inflation is supposed to be like 2% and somehow the DOW doubled every 10 years for the last 60 years…\n\n(Church Lady Voice)\nCould it beeeeeee….\nINFLATION", "score": 1, "replies": []}, {"body": "The US economy is a PONZI. The debt is too high it will eventually crash", "score": 1, "replies": []}, {"body": "#GET OUTTA HERE YOU 🐻🌈 THE STONK MARKET WILL ALWAYS BE PROPPED UP BY THE FEDS THEY LOVE MONEY. THERE ARE THE ORIGINATORS OF THE INFINITE MONEY GLITCH.", "score": 1, "replies": []}, {"body": "High inflation is a sign of economic growth. The fid raising rates is a response to this. While economic growth will slow. I doubt the fed will willingly and knowingly crash teh econony by raising rates to fast. They will be careful and take it slow.\n\nThe pendulum will not violently swing to the other side. \n\nI see current high valuations as a direct result of the inflation of the money supply. Where the money supply wont drastically shrink. It is by no means out of control or out of hand. Earnings and wages and prices are adapting to the new bigger money supply. Itll take time but it wont break the economy.", "score": 1, "replies": []}, {"body": "I think it will crash or drift downward to a bottom and it could take weeks or a couple of years. \n\nOn the other hand, I could think of a likely scenario of a new normal wherein Fed just keeps printing and takes rates negative or even more negative. Negative nominal rates in TIPS now, although positive real rates given inflation. They can print to hyperinflation if they wanted to and there are examples in history in either scenario. \n\nIf the Fed keeps printing and accommodating, the market stays up but the government can also sttt as ET increasing taxes and selling assets and decrease spending for a very long gradual normalization. The vaunted soft landing.", "score": 1, "replies": []}, {"body": "Bro, the market has been crashing since October.", "score": 1, "replies": [{"body": "Not really, but it has come down a bit", "score": 0, "replies": []}]}, {"body": "positions or ban", "score": 1, "replies": [{"body": "Post your positions.  You will be banned if positions are not provided.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "The more I read these threads about potentials for a 'crash' the more I realize that the commentors don't understand what constitutes a crash.", "score": 1, "replies": []}, {"body": "The government won’t let it because it would ruin several business who pay them not to let it.", "score": 1, "replies": []}, {"body": "When does the feds balance sheet shrink? When do they start selling? No one knows. They can talk talk talk, but will the retail investor know when the fed starts pulling the rug out from under the market? Smoke and mirrors. Smoke and mirrors…..hope your timing is right. If it’s not, wait. The crash is coming and many retailers will get burned up.", "score": 1, "replies": []}]}
