{"title": "Is Meta (FB) horribly mismanaged?", "selftext": "FB main business of Apps include FB, IG, Messenger and WhatsApp.  That's their business and it's been very profitable.  But instead of building on this core, they announced a new focus called the Metaverse and even changed the company name too Meta.\n\nMeanwhile, they repurchased shares at all time high levels for $19B!\n\nDO you think they are horribly mismanaged?", "id": "slkg9j", "created_utc": 1644105203.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 71, "comments": [{"body": "40 billion a year in free cash flow, 50 billion in cash, 0 debt. Yep sounds like a terribly run company to me.", "score": 69, "replies": [{"body": "And they haven't even monetized WhatsApp yet, which is huge around the world and the #3 biggest social platform, with twice as many active users as TikTok.\n\nThen there's their 40 billion share buy back plan. FB bought back 35 billion worth of their own shares in the last 2 quarters. If that doesn't spell out confidence, I don't know what does.", "score": 19, "replies": [{"body": "They haven't monetized Whatsapp yet because they can't figure out how to do it. It's a messaging app - there's no way to integrate ads without being really annoying and intrusive, and there isn't enough value for users if they start charging a monthly or annual fee.", "score": 15, "replies": [{"body": "They are trying to get into payments but it is difficult due to regulations in all the different places. That was why they were so interested in a crypto stable coin.", "score": 2, "replies": [{"body": "That's the point I've been making in a lot of these threads about the company. They keep trying things to keep up with the competition, and everything they try is a failure.", "score": 2, "replies": [{"body": "Google’s “Other Bets” vertical has a ton of losses. They fail at a lot too. But they have the money to keep trying.", "score": 1, "replies": [{"body": "One difference is that Google's main business is a lot stronger than Meta's. The other difference is that Google tries new things, they don't just try to copy what others are doing.", "score": 1, "replies": [{"body": "Touché", "score": 1, "replies": [{"body": "The fact that they're focused on growing Reels shows just how behind they are. They don't realize that young people have been leaving FB for years because it isn't cool. It's become a site for mothers to play Farmville and share family photos with grandparents. The only demo that's growing on FB is the 55+ age group. Not only are older people less lucrative for the company, but they sure as hell aren't going to be making Reels.\n\nSo Reels will fail just like their attempt at dating failed and just like their attempt at crypto failed.", "score": 1, "replies": [{"body": "I think they do realize it. It just takes time to pivot. Pivoting is even harder when you have reputation and perception issues. They’ve been treading carefully because this is not an easy or quick pivot. It is doable. Remember when Amazon was just books? It was almost 10 years between books and prime. To say they don’t realize user fatigue is like ignoring the obvious. They know they are just strategically shifting their business. They are also probably keeping things under wraps to get a heads up on the competition. Apple does this all the time.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "This assumes there is zero monetary value from user data.", "score": -1, "replies": [{"body": "The whole appeal of whatsapp is that all communication is encrypted end to end. Even whatsapp can't read it. What data would they collect? Besides knowing who talks to who.", "score": 21, "replies": [{"body": "Returning to OP's question, they bought Whatsapp 8 years ago for $16 billion and haven't figured out how to make a cent off it. Not exactly looking like a great business decision.", "score": 1, "replies": []}]}]}]}, {"body": "If they did, i would leave and quit messaging tbh. I hate getting bombarded with ads.", "score": 5, "replies": [{"body": "Exactly and they know it.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I dont think so, user count is probably their most valued metric. The problem is zuck doesn't know what he wants fb to be. He went from awesome social network to trying to be a newspaper to trying to be a bank.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No, he’s trying to control all aspects of society. Social interactions, news, and finally financial transactions. So he can farm data and sell ads. \n\nAnd in the meanwhile hes destroying democracies, causing genocides, and causing mental illness. And he doesnt seem to understand hes doing anything wrong. \n\nThe legal structure of facebook also gives him total control (which is unusual for a public company) \n\nIts about time governments step in...", "score": 2, "replies": []}, {"body": "It's not really the public or the government at fault when zuck is caught red-handed trying to buy a business using shady tactics when the person who owns the business doesn't want to sell. Or the fact that he made his millions through selling peoples data and fake news with an agenda to create discourse.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "To me it's more confidence to buy when your down. Not up\n\nLike the CEO buying netflix", "score": 1, "replies": []}]}, {"body": "I could only wish every stock I invest in could be that \"terribly\" run. But seriously, FB is great. Their ads just print money.", "score": 0, "replies": []}, {"body": "https://www.reddit.com/r/worldnews/comments/slvbca/mark_zuckerberg_and_team_consider_shutting_down/?utm_medium=android_app&utm_source=share\n\nThreatening Europe with closing down seems like shooting yourself in the foot\n\nThey tried Libra and failed\n\nThey copy Snapchat and TikTok. No longer lead \n\n Spending on metaverse which could fail\n\nLosing ad revenue from aaple/google", "score": 1, "replies": []}]}, {"body": "How are they not building on their core? They are growing at 20% per year, 40 billion in FCF; hardly any debt. They spent 10 billion on a bet they believe will pay off and people are giving the crap.\n\nDo you know how many billions Microsoft, Google, and Apple have lost on future projects that have been trashed?\n\nEveryone wants to forget how Microsoft and Apple were  radioactive at one point in their life.\n\nFacebook is a cash cow, as 2.9 MAUs, 1.9 DAUs, a 20% on a ROIC, and projected 20%+ CAGR over the next few years…….how do you call it mismanaged?\n\nHave they contributed to the downfall of civilization…absolutely…should you care when come to $$$$ nope….Altria has entered the chat.", "score": 11, "replies": [{"body": "Windows vista.....\nApple homePod....\nGoogle+.....", "score": 4, "replies": []}, {"body": "As someone that got screwed by Microsoft’s lies about OS/2, you are right. They wasted so much time and money, but they cost others even more of both.", "score": 1, "replies": []}, {"body": "Excuse my ignorance, but what are MAU's?", "score": 1, "replies": [{"body": "Monthly Active Users = MAU = 2.9 billion\n\nDaily Active Users = DAU = 1.9 Billion\n\nMeasures how many accounts login at least once per day  or once per month", "score": 1, "replies": [{"body": "Kind of figured that was what it was but I think you got the opposite values for each, it's 1.9B daily users 2.9B monthly", "score": 2, "replies": [{"body": "You’re right, fixed. Ty", "score": 1, "replies": []}]}]}]}]}, {"body": "No. Management is specifically the reason why I invested. I would invest in Mark and Sheryl regardless of the underlying business. What looks horrible mismanaged to you now is going to look geniusly managed in a few years. \n\n1) Share buybacks almost always happen at ATH because only highly profitable companies do them and highly profitable companies usually are at ATH. \n\n2) They're actually not doing stock buybacks at ATH. They only announced them last fall after the FUD from that blonde chick about 3% of Instagram teen girls responding \"worse\" to a poll about if they feel better, worse, or the same after using Instagram.\n\n3) Mark is geniusly using this opportunity to use the remaining 39 out of 50 billion in buybacks at huge discounts, while taking away congress's talking points about no competition, while also showing material evidence of adverse effects from Apple which could be useful in future lawsuits like Epic's recent one which could still be appealed.\n\n4) They've been working on the Metaverse since 2014 which is another example of great management since without it the FB brand would not be exciting to attract the best employees. That was one of the key points Mark made even back then for buying it in the leaked internal letter about the acquisition so just shows his foresight.", "score": 7, "replies": []}, {"body": "Sure Zuckerberg could focus all his money on trying to monetize his customer base to infinity, instead he is trying to create the future. As a citizen of earth, I prefer the latter, although there are some risks to it obviously. But without risk we would still be in the stone age", "score": 12, "replies": [{"body": "I agree. If you tell me we would still be staring down at our smartphones 10-30 years later .. that would be boring .", "score": 2, "replies": []}]}, {"body": "I haven’t done ANY due diligence on Facebook - so I don’t know the numbers - this is purely anecdotal:\n\nThey’ll continue to make money and in a decade I don’t think anyone will think about the price at which they repurchased shares.\n\nAs long as they avoid government interference with their algorithms and advertising deals - they’ll be fine.", "score": 6, "replies": []}, {"body": "They can't keep acquiring social media platforms. They might not be able to capture the next TikTok, and even if they do, will the young Zoomers reject it? Or will regulations stop them from expanding their monopoly? Best to invest elsewhere and pivot.", "score": 3, "replies": []}, {"body": "The mere action to change the name from FB to META was a terribly risky move. Investors poured their money into Facebook. A brand and product they understood and had confidence in. \n\nThen one day we get a couple of informercials about virtual reality and they change the entire companies vision to META. Investors don’t like mystery and unknown. Not ones that are invested in fb anyway. Any bad news will spook the shit out of them. They don’t even know what this company is at the moment. \n\nIt Should have been a separate entity to Facebook.", "score": 8, "replies": [{"body": "They want to be the next Alphabet", "score": 8, "replies": []}]}, {"body": "Only reason I'm holding the stock is because I trust Zuckerberg.  The guy is still in his 30s.  Google offered him billions for facebook and he turned it down.  FB is in a difficult position.  They can't expand their social media influence because of politics.  Even buying a 400 hundred million gif company met a lot of scrutiny.", "score": 8, "replies": [{"body": "Exactly, they have to re-invest in themselves away from social media, because they might not be able to acquire the next big platform.\n\nWhat helps me alleviate anxiety about metaverse as a holder, is that all the big names are investing into it: Microsoft, Apple, Nvidia, Unity, Roblox, etc etc. If it's a delusion, then it's a mass delusion on the largest scale adopted by the biggest & brightest companies today. I don't have to believe in the metaverse, I just have to believe in the leadership and company and where the money is pouring in by all these companies.", "score": 7, "replies": [{"body": "I view metaverse the same way i view dotcom when everyone was thinking of ecommerce, iot, etc. 10-15 years too early.  Ppl overestimate short term adaptation and underestimate the long term.  I hope im wrong because seamless no lag picture perfect vr/ar would be pretty rad", "score": 4, "replies": [{"body": "the difference is dotcom seat on hundreds of PE, but fb now is 17. I would agree with you if fb sits on 170 pe now, but it is not true. fb on 17 means people not actually believe meta will eventually happening, this is just the opposite of dotcom bubble, which during those days, everyone believes dotcom would come, and sent dotcom to moon.", "score": 1, "replies": [{"body": "I'm not comparing valuations.  The concept of metaverse is too small to even begin affecting markets.  \n\nI'm comparing rate of technological adoption.  I think the concept of \"Metaverse\" is likely, but not in 5 years time.  And the market agrees with me.  Metaverse is an anchor to fb price - if they decided to not spend an annual 10 billion the stock would go up.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I'd do it for half of his compensation", "score": 2, "replies": [{"body": "You'll do it for 50c?", "score": 1, "replies": [{"body": "Compensation is not salary!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Only thots are hired", "score": 1, "replies": []}]}]}]}, {"body": "fb is a cycling company, they have obviously election cycle. they drop on early 2018 before mid term and now again. Mark is trying to lift fb out of the cycle which need something specular, not just some average thing which grow earnings a bit, they have money on hand. VR is actually doing decently for fb, and growing pretty healthy, now they try to hit the meta jackpot again, man, what can they lose, the worst case nothing changed. even nothing changed, they still have stock buybacks.", "score": 2, "replies": []}, {"body": "No, i don't think it is. I think they just have finally hit a wall where their userbase has had enough with how privacy vs piracy works with their data.", "score": 1, "replies": []}, {"body": "If Zuckerberg resigned I bet the stock price would increase.", "score": -3, "replies": []}, {"body": "They bought back their stocks at $310 I believe which is still a very low price for the stock based on financials. The price now is ridiculous. Not mismanaged, I think people are miseducated…", "score": 0, "replies": []}, {"body": "The problem is that the brand is toxic and no one uses Facebook or its spin off products anymore, and that trend seems to be growing.  You probably can't see how toxic the brand is because you use Reddit (also a toxic brand) and are inside the bubble.\n\nYes, the brand getting involved with politics is literally what damaged the brand.  It was a stupid decision.  Now they are paying the price.\n\nLeftish shill is no longer a viable platform the way it was say... 5 years ago.", "score": -1, "replies": [{"body": "No one uses Instagram or WhatsApp... Do me a favour mate", "score": 2, "replies": []}]}, {"body": "They should have partnered with a company already capable of the metaverse creation and onboarded the FB user base. Later down the track buy out the partner.", "score": 0, "replies": [{"body": "I think they are trying to rebuild the world as we know it ready player one style. Why buy a company that has possibly a different direction when you have the resources to lose money for years before it’s successful", "score": 1, "replies": [{"body": "It’s easier to buy/partner. That’s why they bought Instagram. Come on.", "score": 1, "replies": [{"body": "You realize no company is that advanced in metaverse research? Why would they buy a company for 10B when they can easily shell out 10B of their own and not be affected", "score": 1, "replies": []}]}]}]}, {"body": "I think the pivot is because China is too competitive.  I really dont know anything about any of it, I've never used Tiktok, but I guess its like twitter for short videos that FB cant compete with.", "score": 0, "replies": []}, {"body": "They just need to hire a ‘front person’ to replace Zuckerberg.", "score": 0, "replies": []}, {"body": "I’m thinking weeklies for the dead cat bounce. Long term I think fb is going to do just fine.", "score": 0, "replies": []}, {"body": "[removed]", "score": -3, "replies": [{"body": "A gook? I think you surely meant geek?!", "score": 1, "replies": []}]}, {"body": "Yeah I think Zuckerberg only knows how to deal with success and not failure. Now that he's looking a few failed projects in the mouth and watching his company lose 25% of its evaluation it's going to mess with his head. He will try make some very rash and frankly bad decisions that will end up sending him and his company in a death spiral if he doesn't get out of his own way.", "score": -1, "replies": []}, {"body": "Every big and successful company eventually tries to enter new markets. Most fail.", "score": 1, "replies": []}, {"body": "Oh look another $FB post", "score": 1, "replies": []}, {"body": "People are nervous in the US due to the fact both parties are trying to take their big bites of the pie", "score": 1, "replies": []}]}
{"title": "12K -> 69 on TSLA and BABA Calls do I belong here yet?", "selftext": "", "id": "skvoak", "created_utc": 1644027965.0, "score": 128, "upvote_ratio": 0.94, "num_comments": 69, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|847|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=skvoak)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=skvoak)", "score": 1, "replies": []}, {"body": "Holy shit this is like the 10th 99% portfolio loss porn I’ve seen in the past hour. Wtf is going on? AM I NEXT?!", "score": 43, "replies": [{"body": "Have noticed the volatility these past few months? haha if you pick the wrong color you are toast!", "score": 20, "replies": [{"body": "![img](emote|t5_2th52|4735)", "score": 5, "replies": []}, {"body": "I'm color blind.", "score": 4, "replies": [{"body": "An aristocrat, aye?", "score": 2, "replies": []}]}]}]}, {"body": "So this is the result of my retardedness in thinking that BABA was going to 'bounce' the last few months, coupled with several TSLA FD's the past couple weeks.. \r  \n\r  \nCould be worse..", "score": 10, "replies": [{"body": "Thanks for the courage in posting this. What is FD?", "score": 3, "replies": [{"body": "I did a strangle on TSLA and earnings killed the calls but the poots I bought on the other leg were not much saving grace because I took that money and then lost it on calls the following days, missing the big pump.\n\n&#x200B;\n\nPretty much did the opposite of what TSLA did the last two weeks.. oof\n\n&#x200B;\n\nno biggy though I can always get back up", "score": 3, "replies": [{"body": ">\tno biggy though I can always get back up\n\nExactly $12k is nothing and you can still borrow that cheap. Double down and make it all back.", "score": 1, "replies": []}]}]}]}, {"body": "Only after it expires", "score": 6, "replies": [{"body": "Yea they are all closed. I am gonna wait til next week and start over.", "score": 9, "replies": [{"body": "Then welcome to Wendy's may I get your order", "score": 14, "replies": [{"body": "fuckin frosty pleas", "score": 10, "replies": [{"body": "Anything for ANAL GoD 😂", "score": 8, "replies": []}, {"body": "should u be the one taking the order", "score": 3, "replies": [{"body": "I am about to take a couple shots, that is for sure.", "score": 10, "replies": []}]}]}]}, {"body": "Sir I won’t be asking you again but we will need you to work the cash register and back booth at Wendy’s Monday thru Saturdays now.", "score": 5, "replies": [{"body": "You are going to trust me with the money?\n\n&#x200B;\n\nFuck it, I'm in!", "score": 4, "replies": [{"body": "You typed in that deposit, I’m sure you’ll do just fine!", "score": 3, "replies": []}]}]}]}]}, {"body": "DAMN. Thanks man I feel so much better", "score": 7, "replies": [{"body": "Thats what I am here for", "score": 5, "replies": []}]}, {"body": "Yup! You belong here while your wife is with her boyfriend", "score": 7, "replies": []}, {"body": "You forgot a K!\n\n12K -> 69K\n\nSee, this looks much better", "score": 3, "replies": []}, {"body": "get your free stock bro u need it", "score": 4, "replies": [{"body": "Hm, I still cannot figure out how to do that :/", "score": 2, "replies": [{"body": "This is the way", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4553)", "score": 1, "replies": []}]}]}]}, {"body": "nice", "score": 3, "replies": []}, {"body": "You can still buy tacos, try harder", "score": 2, "replies": [{"body": "Hey, 69 bucks can still be a decent weekend", "score": 3, "replies": [{"body": "$50 hooker, a 6-pack of beer and some Funions.", "score": 4, "replies": [{"body": "What if the hooker smells like funyuns", "score": 2, "replies": [{"body": "Wait, so that's not her name?\n\nOh dear...", "score": 1, "replies": []}]}, {"body": "☠️☠️☠️☠️☠️☠️", "score": 2, "replies": []}]}, {"body": "Nice!", "score": 3, "replies": [{"body": "Good bot", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I have not looked at all today until after close basically. I knew my remaining positions were toast haha", "score": 3, "replies": []}, {"body": "☠️☠️☠️☠️☠️☠️☠️☠️", "score": 1, "replies": []}]}, {"body": "Have you learned anything from your mistakes?", "score": 2, "replies": [{"body": "Just that I need to insert more money next week..", "score": 5, "replies": [{"body": "Very wise… WSB has taught you well.", "score": 4, "replies": []}]}]}, {"body": "Wtf would anyone place a call on anything, when a recession is imminent?", "score": 2, "replies": [{"body": "Idk, I am just a 'tard who likes the color green", "score": 4, "replies": [{"body": "Fair. Comes to the dark side! Puts can be juicy", "score": 3, "replies": [{"body": "I mean I use both. I did a strangle on TSLA for earnings.", "score": 2, "replies": []}]}]}]}, {"body": "One of us", "score": 2, "replies": []}, {"body": "Say hi to ur mom for me", "score": 2, "replies": []}, {"body": "You have $70 bucks left now do the inverse of what you just did", "score": 2, "replies": []}, {"body": "Nice", "score": 2, "replies": []}, {"body": "69 nice 👍", "score": 2, "replies": []}, {"body": "Noice.", "score": 2, "replies": []}, {"body": "Nice", "score": 2, "replies": []}, {"body": "Nice", "score": 2, "replies": []}, {"body": "nice", "score": 2, "replies": []}, {"body": "Hey, please ensure that your {{flair}} thread has an image of your trades or portfolio! Use [imgur](https://imgur.com/upload) to upload your photo and then resubmit this post with the imgur link in the body of the thread.\n\nIf this is a mistake and you did include an image, please message the mods.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "missed legendary status by 0.09", "score": 1, "replies": []}, {"body": "Welcome retarded.", "score": 1, "replies": []}, {"body": "You done good Jimmy", "score": 1, "replies": []}, {"body": "I think so..", "score": 1, "replies": []}, {"body": "How?", "score": 1, "replies": []}, {"body": "If you don’t hedge you shouldn’t be playing with options", "score": 1, "replies": []}, {"body": "Lmao i went from 20k to 800$ on fb and PayPal calls", "score": 1, "replies": []}, {"body": "How? I dont understand", "score": 1, "replies": []}, {"body": "You belong behind Wendy's", "score": 1, "replies": []}, {"body": "You're in the right place with the BABA calls...", "score": 1, "replies": []}]}
{"title": "Betting on Justin Trudeau's dedication to maintaining the housing bubble", "selftext": "**Skippable intro:**\n\nCanada is a great country. It is full of moose, beavers, natural resources and overpriced houses. If you are a mining company looking for an easy place to IPO or a maybe who wants 0 international oversight Canada is a great place for you. If you want to launder money through one of the top three hottest housing markets in the world, send your money to Canada, and Justin Trudeau will be happy to scrub it clean for you, and he’ll keep it safe while he’s at it. Every Canadian administration has bent over backwards to ensure the bubble never pops and this one is no different.\n\n**Why Canada will never increase its interest rate:**\n\nThe Bank of Canada is at complete mercy of the Fed for all of its policy. As our main trading partner if our dollars get out of synch it puts Canada at a major disadvantage. If the US has high inflation and Canada keeps theirs low, all of a sudden Canadian buying power starts looking good, but our exports become too expensive and the US will find another way to get our products.\n\nSo far Canada has been reporting inflation significantly lower to our big brother in the south flirting with 5% rather than 7%. (How realistic either of these numbers are who can say.) Either way, Canada has some wiggle room with respect to their interest rate hikes that the BoC said might be coming last month and didn't. Now they're saying they for sure might be coming in March.\n\nI do not expect Canada to raise interest rates in March regardless of what the FED does (although I am skeptical there as well). I expect that Canada will continue to shelter their home owners, who have taken out a record amount of personal debt in the form of 5 year fixed mortgages. (That's what banks offer here. You can negotiate a longer term but its often quite expensive.) While I believe that the housing market has priced in that no rates hikes are coming, I do not think that the long term bond market has.\n\n**The move:**\n\nCall options on the VAB (Canadian bond ETF). If anyone else has a US Ticker, or another way to play let me know. The VAB is down around 7% in the last 6 months in anticipation of rate hikes. The other appealing catalyst would be if the bears are right and the TNX hits 2.0 then dumps to negative, VAB will rip as rates crash because again BoC will always mirror the FED on major changes to policy.\n\n**Positions:**\n\nI haven’t opened a position yet because I’m jacked to the tits with spy puts and VIX calls for the next leg of the bear market next week, but this week I’ll start loading up on near the money VAB calls dated for early April.  I'll post an update with my positions if this makes it past the mods and anybody bothers to read the whole thing.\n\n**TL:DR:**\n\nCanada’s foreign friends and wealthy boomer voters have no interest in rate hikes that could affect their portfolios of multi-million dollar bungalows in Oakville and shitty overpriced garbage in wastelands like Guelph ON. The BoC will not be raising rates as promised and the Canadian bond market is going to rally. My bet is calls on VAB (Canadian bond ETF) with an April expiry. \n\nHere’s a link to [my last play](https://www.reddit.com/r/wallstreetbets/comments/r7rjak/gambling_my_kids_christmas_present_money_on_corn/?utm_source=share&utm_medium=web2x&context=3) which has worked out pretty well so far. I ended up selling my RIVN puts to double down on the $corn plus I added $cow.\n\nEdit:\n\nPositions: (will update when I set my VAB position)\n\nVIX Feb 15th 25calls\n\nSpy Feb 14th 448puts\n\nCorn Aug 19th 21calls\n\nCow July 15th 38calls", "id": "slg86t", "created_utc": 1644093933.0, "score": 39, "upvote_ratio": 0.79, "num_comments": 75, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|10 months ago\n**Total Comments**|3248|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/mp6wu9/leveraged_index_etfs_as_longterm_holds/) \n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=slg86t)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=slg86t)", "score": 1, "replies": []}, {"body": "Canada will increase rate soon. Buddy 🤪", "score": 40, "replies": [{"body": "We’ll see, guy", "score": 20, "replies": [{"body": "Yes we shall, pal.", "score": 14, "replies": [{"body": "Sorry.", "score": 7, "replies": []}, {"body": "I’m waiting, bro.", "score": 7, "replies": [{"body": "It’s happening, friend.", "score": 11, "replies": [{"body": "Any day now, friendo", "score": 3, "replies": [{"body": "Someone wasn’t old enough to watch the south park movie", "score": 10, "replies": [{"body": "I have underwear older than you. Ask your mom, she can confirm.", "score": 1, "replies": [{"body": "Lol this is a post about bonds, how old do you think I am?", "score": 6, "replies": [{"body": "Somewhere between 12 and you're a dork", "score": 6, "replies": [{"body": "ahhaahhhaha x 3.", "score": 2, "replies": []}, {"body": "This was funny lol", "score": 2, "replies": []}]}, {"body": "ahhaahahahha x 2.", "score": 1, "replies": []}]}, {"body": "aahahhahahha", "score": 1, "replies": []}, {"body": "You mean his moms boyfriend", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "All Canadian options have the worst volume and spreads", "score": 14, "replies": [{"body": "yeah but the only other use for CAD is to get your wood stove started so it's not all that noticeable", "score": 1, "replies": []}]}, {"body": "I still haven't seen a moose irl yet here. I'm 41 and have traveled all of the west and as far as Quebec. I'm kind of disappointed lol. But they are delicious", "score": 9, "replies": [{"body": "I’ve been going to Algonquin park since I was a kid, on one 3 night trip I saw 9. They’re out there.", "score": 4, "replies": []}, {"body": "They’re all in Newfoundland", "score": 2, "replies": []}]}, {"body": "Raising rates 50-100bps isn’t gonna make that much of a difference. Most home buyers were already being stress tested at ~5% interest rates anyways. \n\nAnd why do you think the long term bond market hasn’t priced it in yet? Do you think you’re smarter than market?  \n\nI will gladly inverse you.", "score": 8, "replies": [{"body": "Not proof or anything, but it’s kind of looking like there’s a good chance for a bounce. https://invst.ly/xbf42", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "10 more partnerships and 3 more patent sales, then it’s guaranteed to print", "score": 6, "replies": []}]}, {"body": "No positions!?!?! Fucking BAN!!!", "score": 11, "replies": [{"body": "Updated", "score": 2, "replies": []}]}, {"body": "hey come on up and watch a sporting event or concert anytime ..... oh wait nvm", "score": 5, "replies": []}, {"body": "You’re right about housing, but wrong that we won’t follow the Fed like the little bitch vassal state we are.  And bonds blow", "score": 3, "replies": [{"body": "We might have to let our inflation catch up to the fed if anything", "score": 2, "replies": []}]}, {"body": "If BoC doesn't raise rates in March we are TRULY fucked", "score": 4, "replies": []}, {"body": "Wait…is this not a Wendy’s anymore?", "score": 3, "replies": [{"body": "no ... it's a Timmmys ... we like rainbows apparently", "score": 10, "replies": [{"body": "I'll have a double double and 20 timbits", "score": 5, "replies": [{"body": "their called beiber bits now or i mean timbiebs .... i wish i was joking", "score": 5, "replies": []}]}]}]}, {"body": "puts on JT’s career.", "score": 3, "replies": []}, {"body": "I stopped reading at beavers", "score": 3, "replies": []}, {"body": "Demand still outstrips supply.  Just wait until the pent up back log of immigration comes in.  Housing prices will continue going up.  Buy now if you can - mortgage rates are way under inflation and real estate appreciation in any suburban area or major city.", "score": 3, "replies": [{"body": "Fuck that. You won’t see me buying a house in 2022.", "score": 1, "replies": [{"body": "Good idea - apartment buildings are the play since most people will be priced out waiting for housing prices to drop. 👍", "score": 2, "replies": [{"body": "Everyone is going all in unconditional, people are turning down jobs in Toronto to speculate on property in Moncton and all the cool guys from high school are real estate agents all of a sudden… This is the top or at least near to it.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "How long has he been in power. It seems like the status of \"democracy\" is a really low bar to jump in the west lately.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Our Conservative party has gone full leftist rather, I hate our Conservative party bunch of ass kissing spineless politicians.", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "No speaking as a Canadian voter having grown up in rural areas my entire life, me and a large portion of people I know feel destitute of a political party, and those who don’t actually pay no attention to politics or world events, nothing is more important to them than the next hockey game and beer 🍻", "score": 1, "replies": []}]}]}]}]}]}, {"body": "😅 Poor Guelph... can't catch a break.", "score": 2, "replies": []}, {"body": "I'm holding the same VIX calls 🥰", "score": 2, "replies": []}, {"body": "Enjoyed reading this. Hope this works out for you. Can confirm the oakville real estate market south of the qew has been on fire the past few years. Everyone wants a big lot and builders are forced to offer like 35' lots. Scarcity creating demand.", "score": 2, "replies": []}, {"body": "I almost feel sorry for our Canadian brothers who are stuck with Justin Trudeau.... Then I look at the drooling  dementia King we have supposedly running the US and think better of it.", "score": 5, "replies": []}, {"body": "Positions or Ban", "score": 2, "replies": []}, {"body": "I'm in Canada, 5 minutes from the Trucking protest and where Trudeau \"works\". I can assure you they will raise interest rates. The problem is we also don't have any competent people at the helm, our finance minister \"resigned\" a year ago and was replaced with a yes sir person. Kinda like Powell now. Anyhow, we only follow what the other nations are doing, we can't lead because we can't extrapolate that far out. US raises .25, we will follow suite, if US goes up .5%, we will do the same. We can only do what the big boys are doing, not lead it. Notice how Canada never gets invited to decision making meeting with the other world leaders? He's also getting called out from all over the world right now, kinda like deer in the headlight moments!\n\nI will say this though, he doesn't fall asleep in the middle of speeches then pick up out of nowhere on a different topic.", "score": 1, "replies": [{"body": "The guy just happened to get covid and went into isolation as the protest was rolling into town. How convenient", "score": 4, "replies": [{"body": "And who isolates in an underground bunker for getting covid anyways?\n\nFunny in his last Q/A he told reporters that he was slated to speak with Russia and Ukraine about democracy and rule of law. He better bring his notepad.", "score": 2, "replies": [{"body": "LoL", "score": 0, "replies": []}]}]}, {"body": "![gif](emote|free_emotes_pack|facepalm)![gif](emote|free_emotes_pack|facepalm)![gif](emote|free_emotes_pack|facepalm)![gif](emote|free_emotes_pack|facepalm)We![gif](emote|free_emotes_pack|facepalm)![gif](emote|free_emotes_pack|facepalm).  Are  both![gif](emote|free_emotes_pack|facepalm). In trouble  Justin’s Indian outfit was quite funny though! Don’t worry Biden will top that . I fully expect him to walk out with no pants on shortly", "score": 1, "replies": []}]}, {"body": "Justin won’t be PM in 6 months", "score": 1, "replies": []}, {"body": "As someone who lived in Canada for 10 years until December. They can’t afford to increase, even with the dollar to usd$$ Canadians pay more for everything. “Except healthcare” blah blah, trust me, they pay for it with their time.", "score": -1, "replies": []}, {"body": "Ban", "score": -2, "replies": []}, {"body": "Good DD. Maybe something to keep an eye out for if I understood the bond market a little better.", "score": 1, "replies": []}, {"body": "I would inverse OP. Dumb move. There is this ZMBS canadian mortgage backed securities etf that just launched not sure if you can buy calls/puts on this.", "score": 1, "replies": []}, {"body": "The US has fell into the same trap...Letting rates get to near zero is irresponsible and harmful to ANY economy. Now the US must also manipulate the natural flow of rates while trying to fight rabid inflation. We shall see how it goes but personally I dont see how the US slows the train without letting the rate get above 5% and thereby deflating the housing market placing millions underwater.", "score": 1, "replies": [{"body": "Well the “solution” can be found in raising inflation targets. 4 % instead of 2 % and you are good to go. National debt will thank you later.", "score": 1, "replies": []}]}, {"body": "Cow? Is that the agriculture ETF?", "score": 1, "replies": [{"body": "Yeah it holds live cow and lean hog futures, Corn  is about the real kind of corn also. I linked the post about fertilizer prices, they’re still way up", "score": 1, "replies": [{"body": "Ok ya cow.to iShares I think. I have been watching this for a while. Haven't pulled the trigger yet. Check out cww.to. sort of a utility ETF but tracks water specifically. Dividends are good.", "score": 1, "replies": [{"body": "Not COW.to it’s a US ETF. Cow.to is similar but has a wider holding with some agricultural companies. I wanted a commodity play", "score": 1, "replies": [{"body": "Ok ya I thought it might be different. Cow.to holds companies like John Deere and Case.", "score": 1, "replies": []}]}]}]}]}, {"body": "I thiught Canada said they are keeping it low for the year?", "score": 1, "replies": []}, {"body": "Nah, not touching any Canadian stuff.  Only Canadian stock I like is PKKFF.. but that's based on their financials which looks too good to pass up.", "score": 1, "replies": []}, {"body": "How the F are y'all buying million dollar houses with 5 year mortgages?", "score": 1, "replies": [{"body": "5 year fixed rate 25 year term", "score": 2, "replies": []}]}, {"body": "J'exige de klaxonner!", "score": 1, "replies": []}, {"body": "got me exited thinking I could buy puts on VAB. No options fuck..", "score": 1, "replies": []}, {"body": "Well, this didn’t age well.", "score": 1, "replies": [{"body": "Haven’t pulled the trigger yet. These bitches keep tanking.", "score": 1, "replies": []}]}]}
