{"title": "[deleted by user]", "selftext": "[removed]", "id": "192ar57", "created_utc": 1704792169.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 50, "comments": [{"body": "The day Taiwan gets invaded, buy puts on the entire tech sector", "score": 38, "replies": [{"body": "And, calls on whoever makes the Predators.", "score": 3, "replies": [{"body": "Gonna be a naval war. GD makes Navy missiles.", "score": 3, "replies": []}]}, {"body": "I mean yeah they control the whole thing but money gonna rush to intel  China coulda been took Taiwan it wasn’t for the USA", "score": -7, "replies": [{"body": "you been forgetin how too write proper english sentences mate?", "score": 0, "replies": []}]}]}, {"body": "China won't invade, they'll take over politically after supporting an opposition party who will eventually take power and thaw relations over decades.", "score": 24, "replies": [{"body": "Pulling a move outta the USA playbook 😂😭", "score": 3, "replies": [{"body": "It's highly effective. I know this from obsessively playing games from Paradox Interactive.\n\nIn fact if I wasn't at work, I'd probably be playing Hearts of Iron 4 right now.", "score": 4, "replies": [{"body": "Fucking phenomenal game", "score": 2, "replies": []}]}, {"body": "Facts", "score": 0, "replies": []}, {"body": "The difference between US and China’s playbook is that the US does it comically fast whilst China is okay to bide its time.", "score": 1, "replies": []}]}]}, {"body": "intel uses tsmc's fabs.", "score": 3, "replies": [{"body": "Really they ain’t finish that fab in Ohio? I coulda sworn the was hiring folks in Lancaster I know somebody who said that got hired up there", "score": -1, "replies": [{"body": "wut\n\nthey're building shells/fabs... and they have fabs here.  but intel's a notorious 3rd party fab and their fabs are substandard to tsmc.  intel uses their own fabs... but also tsmc's.  more and more.  intel currently seems more dependent upon tsmc's fabs than their own.\n\nfwiw, the best neutral fab in the usa is glofo.", "score": 2, "replies": [{"body": "intel is currently buying machines to jump over tmsc i mean the machines are being delivered.", "score": 2, "replies": [{"body": "...and?  that's their plan, it may or may not work, and said machines aren't making anything for a while.  regardless, intel is relying on tsmc's fabs and intel's aren't even 2nd best.", "score": 1, "replies": []}]}, {"body": "Imma look into them good looks", "score": 1, "replies": []}]}]}]}, {"body": "&#x200B;\n\nhttps://preview.redd.it/lmv53g5dydbc1.jpeg?width=754&format=pjpg&auto=webp&s=9b8042c3c94bbc37a306b9d40bf21ff2ecfb6bf6", "score": 4, "replies": [{"body": "Just needed to know other folks saw the same play I’m seeing 😂 I speculate they actions", "score": 1, "replies": []}]}, {"body": "we got a lot more important things to worry about than your $5k if China invaded Taiwan.  we're talking about possible the start of WW3.  the equity market across the world will tank.", "score": 2, "replies": [{"body": "I have no choice in the matter if they invade Taiwan. Im just seeing it’s a strong possibility. But just like every other world war the markets recover over time.", "score": 1, "replies": []}]}, {"body": "Chinese invasion of Taiwan is at least a couple years out. They're not predicted to have the sea lift capacity until 2027, and will likely wait and pray for a Trump whitehouse; because he's an isolationist pro dictatorship oligarch, not a NATO establishment guy..", "score": -2, "replies": [{"body": "we are in 2024 right now", "score": 2, "replies": [{"body": "Edited. Typo.", "score": 1, "replies": []}]}]}, {"body": "you dont understand the chip market and it shows.\n\nWhen talking about high-end chips Intel, like AMD, is a chip designer. TSMC is a chip manufacturer.\n\nlow-end chips can be manufactured by many, among them Intel.", "score": -1, "replies": [{"body": "Intel is both a chip designer and manufacturer.", "score": 4, "replies": [{"body": "It has a name, idm", "score": 2, "replies": []}, {"body": "thats exactly what my comment says. with the differentiation that intel already designs the highest end chips but so far is not able to produce the top-flight.", "score": 0, "replies": []}]}, {"body": "intel just get delivered with 2nm asml euv, you tell me that machine produces low end chips?", "score": 1, "replies": [{"body": "not a single 2nm chip has left the Intel factory.", "score": 2, "replies": [{"body": "their intel 4 (meteor lake) is not low end chip either and its already out. thats TSMC N5 and Intel 4, do you think its high end? you have no idea what you are talking about.", "score": 1, "replies": [{"body": "good lord. last thing i will say to this:\n\nIntels Meteor Lake is made with TSMC tech. \n\nmy comment stands. you want the highest end chip? TSMC fabricates it while players like AMD and Intel design it.", "score": 2, "replies": []}]}]}, {"body": "No he’s telling you that machine is not producing anything.", "score": 0, "replies": []}]}, {"body": "No shit that’s why I asked the question 😂", "score": 1, "replies": [{"body": "your post is not a question but a statement man...", "score": 1, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 week ago\n**Total Comments**|10|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "How about apple chips?", "score": 1, "replies": [{"body": "The m-chips? I thought apple had tsmc making chips or the make them in house at apple?", "score": 3, "replies": [{"body": "Taiwan Semiconductor Manufacturing\nLater versions -- the M1 Pro and M1 Max last year -- brought Apple-designed chips that could power the company's bigger MacBook Pro laptops. Though Apple designs its processors, it relies on Taiwan Semiconductor Manufacturing Co. (TSMC) to build them.", "score": 2, "replies": [{"body": "I figured cause I thought intel was the only place in the USA that could build chips so apple gonna move to intel too", "score": 1, "replies": [{"body": "Well doing simple chips is possible everywhere. But most hitech chips are being made in TSMC USING ASML dutch technologies. Basically to switch production it can take 5 years or more. The problem here is that corporate ceos with master of business administration were taught that only china could produce cheaply enough electronics and now were are at a tipping point to nowhere. Chips nowadays is like oil. It must be protected locally or sourced internationally by different regions", "score": 3, "replies": []}, {"body": "> I figured cause I thought intel was the only place in the USA that could build chips \n\nffs, man.\n\nthere are many fabs in the usa.  but they all kinda suck.  intel is one of tsmc's biggest customers.", "score": 1, "replies": []}]}]}, {"body": "Apple has zero ASML machines in their inventory. They cannot produce any chips themselves.", "score": 1, "replies": []}]}]}, {"body": "Intel sells about 22% of its revenue into China and 28% into Greater China. Not to mention 45% into Asia. \n\nIs WW3 bullish for that?", "score": 1, "replies": [{"body": "Not at all 😂", "score": 1, "replies": []}]}, {"body": "Ah yes the periodic War With China thread", "score": 1, "replies": [{"body": "Blame the news 😂", "score": 1, "replies": []}]}, {"body": "If China invades Taiwan you won’t have to worry about money anymore.", "score": 1, "replies": []}, {"body": "I'm heavy into Intel from mid summer last year 25$ per\n\nRefurbishing a plant in Britain and building a new facility in India\n\nCan't wait to be hitting big\n\nSeems like people aren't finding the news", "score": 1, "replies": []}]}
