{"title": "[deleted by user]", "selftext": "[removed]", "id": "1977len", "created_utc": 1705321659.0, "score": 101, "upvote_ratio": 0.86, "num_comments": 65, "comments": [{"body": "All I know is that NVDA put action will get smoked", "score": 67, "replies": [{"body": "I am loaded on NVDA puts as of Thursday. Talk to you in a couple months.", "score": 14, "replies": [{"body": "That’s a date bud. I mean this in a non malicious way. We just have different ideas.", "score": 14, "replies": [{"body": "I’m not an emotional trader or anything, but I feel in my guts that NVDA will pop to $600 BEFORE earnings.\n\nThe last 4-5 mths it has moved sideways, so this breakout has been a long time coming!", "score": 4, "replies": [{"body": "It's already well on its way to pop to $600 at the rate it is going.\n\nGodspeed to anyone brave enough to buy puts. NVDA is literally Tesla round 2 in 2023-2024.\n\nA lot of people will lose their asses trying to short it, and a lucky few will probably become rich whenever competition truly arrives. \n\nMy guess? NVDA will keep grinding up, with dips here and there, well through 2024 and probably in mid 2025 or early 2026 there will be competition and the stock will start falling just like Tesla did.", "score": 3, "replies": []}]}, {"body": "They’re the April 19th strike although I’m hoping they succeed after the next earnings call when people expect absolute perfection and end up with only “good”.", "score": 3, "replies": []}]}, {"body": "!remindme 2 months \n\nlol tell us your bear case logic that would possess you to be \"loaded on NVDA puts\"... next earnings call is 5 weeks away and I am fairly certain your puts will be get torched and expire worthless.", "score": 3, "replies": [{"body": "I just said in the other comment they are April 19th, they will have a ton of value left at earnings. \n\nNVDA is priced as if the company is going to grow 50% per year over the next 10 years. People are expecting perfection, if they come in at even 40% growth, that’s a fail, and the stock will be hit. It’s a great company, but the price is absolutely insane.", "score": -5, "replies": [{"body": "lol no it's not priced for 50% YoY growth for 10 years. Do the math that would be an astronomical number on their current $19 Billion of TTM Net Income.\n\nYou realize they only have a P/E ratio of 70 and a Forward PE of 30? That's not asking for 50% YoY growth times 10...\n\nLet me ask. They earned $19 Billion Net Income in the Trailing Twelve Months... what do you guess it will be in the next 4 quarters?", "score": 5, "replies": [{"body": "Sorry 50% was the profit margin. The growth over 10 years is 28% to go from 44B revenue to 520B revenue. If they are able to do, and maintain 50% profit margin, the fair value would... $528 lol\n\nThe forward P/E is a meaningless number. It's based on analyst estimates who are among the group pricing absolutely insane growth/margins.", "score": 0, "replies": [{"body": "Where are you getting these figures? I'm only seeing analyst estimates going out to 2028 with revenue guessed at $158 Billion...\n\nForward P/E is absoultely not a meaningless number since you pay for future earnings not past ones. Also NVDA has consistently beaten analyst estimates for something like 19 of the last 20 earnings calls so we can assume they aren't overestimating and likely are underestimating.", "score": 6, "replies": [{"body": "You’re free to put your money on them underestimating lol. Forward PE is based entirely on what a group of people who are wrong as often as a coin flip think the earnings might be.", "score": 0, "replies": [{"body": "I own a large position of shares. \n\nSince those analysts are always wrong each Quarter by underestimating earnings, it's not a smart bet to think they will be wrong because they are overestimating...", "score": 2, "replies": [{"body": "I think every person buying and holding NVDA at this price is mental. I’ve got $6,000 in puts. If the stock goes higher between now and April, I’ll do that again. One day reality will come back.", "score": -2, "replies": [{"body": "lol have fun burning money on poorly researched conviction.... \n\nWhat do you think is the current fair value? What do you think they will report for Fiscal Year 2024 Revenue and Net Income?", "score": 2, "replies": [{"body": "> What do you think is the current fair value? \n\nSomewhere between 250-300\n\n> What do you think they will report for Fiscal Year 2024 Revenue and Net Income?\n\nTheir fiscal year 2024 is almost done... it's on a weird ass schedule. Their fiscal year 2025 is what you want which contains ~11 months of calendar year 2024, not that I would expect someone who think it's worth $500+ to care enough to know something like that. By the end of calendar 2024/fiscal 2025 I think revenue will be in the ballpark of 75B and net income will be in the ballpark of 35-40B. A nice chunk lower than \"analysts\" project.", "score": 1, "replies": [{"body": "You really think $600-$700 Billion Market Cap is Fair Value? I'm fully aware this is the last quarter of FY24 for them. My point was they are likely going to be reporting $59 Billion for the year, meaning $20 Billion in revenue this quarter vs the estimated $16B, which will be a 25% beat.... \n\nI'm guessing 108B Revenue and 56B Net Income in Fiscal Year 2025 reporting 13 months from now....", "score": 2, "replies": [{"body": "I mean best of luck to you. They might be able to keep the hype train alive for a couple quarters. One day though, they will return to a fair value, it happens to everything eventually.", "score": 1, "replies": [{"body": "Confidently incorrect. I'll pour one out for your puts...", "score": 1, "replies": [{"body": "See you in 6 months", "score": 1, "replies": [{"body": "!Remind Me 6 months \n\nGodspeed. What are your strike price(s)?", "score": 1, "replies": [{"body": "April 19th, 500p\n\nIn an ideal world it has an imperfect earnings report and and I can sell right after that", "score": 1, "replies": []}]}]}]}]}]}, {"body": "So did you buy it in the 100s less than 12 months ago?\n\nBought in 100s, sold at what, 300? And now shorting at 550.\n\nOr..", "score": 1, "replies": [{"body": "Never held it before. It just reached a point of being so overvalued in the last week that I can’t ignore it.", "score": 1, "replies": [{"body": "But then why ignore it when it was so obviously undervalued? \n\n\nSince you are apparently the authority on valuation, and by your own guesses could have doubled your money easily, less than 12 months ago.", "score": 1, "replies": [{"body": "I wasn’t looking at it… I don’t buy individual stocks. I only buy puts on them when I feel the market is overvalued as a hedge. I still have most of my index funds, they’re just hedged.", "score": 1, "replies": [{"body": "You're just another person who would have blown up shorting it at 300 for the same reasons you're wrong to try it here.\n\nGood luck - thanks for the fuel.", "score": 1, "replies": [{"body": "Why would I have shorted it at 300? I didn't because it was grossly overvalued then.", "score": 0, "replies": [{"body": "You have no idea what the right valuation is - it's why you didn't buy it when it was low (why would you give up free money?) And it is why you are wrongly thinking it is overvalued now.\n\nI'll just let the market keep doing the talking.", "score": 1, "replies": [{"body": "I don’t look for undervalued companies. I normally only buy index funds. Then I buy some medium-long dates puts on companies that have excessive valuations. I really couldn’t care less if you believe in me or not.", "score": 1, "replies": [{"body": "It's easier to win on buying undervalued vs shorting overvalued, which you should know.\n\n\nIt's funny seeing how you people try and protect yourselves from the reality that you have no idea what you're doing.\n\n\nYou say all these things with the same confidence that you disregard not winning on the other side 12 months ago.\n\nSucks to be you, I guess.", "score": 0, "replies": [{"body": "I really don’t understand what you’re so angry about. Because I’m shorting your favorite stock? I like how you just make statements and assume that they’re true with zero evidence. I was incredibly happy with how 2023 went and I plan to repeat that this year.", "score": 0, "replies": [{"body": "That you are saying with a straight face that you turned down free money, but that you are justified. \n\nYou don't see what you're saying? Your own statements are at conflict with yourself!", "score": 0, "replies": [{"body": "They don’t… I told you specifically what I invest in. The statement you just said is as stupid as telling me I turned down free money by not buying Bitcoin in 2010. I hold a portfolio of leveraged index funds as my main investment. I hedge that with puts on a handful of companies that are grossly overvalued. It’s not that complicated.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Can you explain in detail why you say it needs to grow 50% per year over the next 10 years? That rate would be a 150x return on investment when calculated as compounded daily. Nvidias current forward PE is lower than Apples and Teslas forward PE. Would you say that Apple or Tesla need even more growth than 150x?\n\nI mean this statement needs very little to debunk it doesn't it? Where did you get this information? Bad youtube videos?", "score": 2, "replies": [{"body": "Sorry 50% was the profit margin. The growth over 10 years is 28% to go from 44B revenue to 520B revenue. If they are able to do, and maintain 50% profit margin, the fair value would... $528 lol\n\nThe forward P/E is a meaningless number. It's based on analyst estimates who are among the group pricing absolutely insane growth/margins.", "score": 1, "replies": [{"body": "Oh no wrong again. They have ~$20B in GAAP earnings right now. 28% compounded for 10 years would give $320B GAAP earnings which would put their PE 3 based on their current price. \n\nCan you imagine! PE of 3 for a large tech company. Lol.", "score": 6, "replies": [{"body": "jesus thank you for actually having a brain...", "score": 7, "replies": []}]}]}]}, {"body": "remindmebot told me to check on you. RIP to your $6k....", "score": 1, "replies": [{"body": "Oh yea it's gone. That stock is nuts. I refuse to believe it stays this high.", "score": 1, "replies": []}]}]}, {"body": "I will be messaging you in 2 months on [**2024-03-15 18:46:28 UTC**](http://www.wolframalpha.com/input/?i=2024-03-15%2018:46:28%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1977len/aapl_tsla_nvda_what_positioning_data_tells_us_to/ki04e41/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1977len%2Faapl_tsla_nvda_what_positioning_data_tells_us_to%2Fki04e41%2F%5D%0A%0ARemindMe%21%202024-03-15%2018%3A46%3A28%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201977len)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "I think NVDA will be a toast soon. Most companies have already figured out that AI is like dotcom", "score": -4, "replies": [{"body": "You either have puts or regret not buying when it was lower. Literally everyone agrees AI is here to stay. I mean chatgpt is here to stay and now everyone is trying to find the next big thing.", "score": 2, "replies": [{"body": "I dont have puts and I dont regret at all. however, i am someone who has been asked to suggest AI implementation for multiple clients and after giving the presentation the general consensus was ai is not ready yet. So ai is going to stay yes, but it is going to have a dot com bust before it can really be used. I am myself getting trained in AI at this age because i am convinced that it will be in demand after 10 years when we will have no industries", "score": 1, "replies": []}]}]}, {"body": "Six days later what's going on here?", "score": 1, "replies": [{"body": "I mean they’re down, but they’re months out so this is all just noise.", "score": 1, "replies": []}]}]}, {"body": "RemindMe! 6 months", "score": 1, "replies": []}]}, {"body": "My portfolio is 75% NVDA, 0% AAPL, 0% Tesla.\n\nGo big on semiconductors or go home.", "score": 32, "replies": [{"body": "Nothing's got me more excited for tomorrow than NVDA", "score": 7, "replies": []}, {"body": "Haha yolo attitude", "score": 0, "replies": []}, {"body": "You guys are crazy, like I know it's not the same thing, nvidia and pltr but it's sounding like when everyone was talking about pltr and SoFi and etc.\n\nYou still can be with a super good average, and if so I can see why you hold. Can have a good outlook if things workout how people are expecting but IMO it's too much. It's like they don't even have competition ta this point, people just pour money", "score": 0, "replies": [{"body": ">It's like they don't even have competition ta this point\n\nNvidia doesn't have a competition as of now to dethrone them. Their CUDA proprietary software tech is a moat with almost 2 decades of refinement, growth, and adoption. AMD doesn't have the marketspace Nvidia has and their CUDA competitor, ROCm, was founded in 2016 and wasn't seriously invested in until recently so it has a long way to catch up.\n\nAMD has taken major steps to advance in AI, but Nvidia was never the type of company to rest on one's laurels like Intel did so Nvidia is still far ahead.", "score": 5, "replies": [{"body": "NVDA will likely dominate for the next 2-5 years, based on what you've said here...but, the stakes are clearly large enough that all semiconductor companies, really mainly AMD and Intel, will realize they need to push into software fast. I think they will catch up fast enough to reduce NVDA's moat from 85% to maybe 40-50%, but that will be enough to tank the stock. \n\nImho, NVDA stock will peak at $800-1000 at MOST, in the next 2 years, before falling back to become a trillion dollar company, rather then a 3 trillion dollar company.\n\nAnd that's my bull case. It could peak at $600-700 for all we know.", "score": 1, "replies": []}]}]}]}, {"body": "Most of the time, stock prices reflect the chance and rate of growth.\n\nAmong three names in this post,\n\nNVDA - definitely a top performer in terms of growth in view of the AI waves\n\nAAPL - faces some kind of competitions (particularly in China) and the sales performance is under pressure\n\nTSLA - faces numerous competitors in the market (though its kinda leading in the technology area) and it is cutting price continuously to maintain its market share\n\nSo clearly NVDA will outperform another two names in the foreseeable future", "score": 10, "replies": []}, {"body": "Short term is so volatile and unpredictable, to make money always go long.", "score": 6, "replies": []}, {"body": "The thing with Tesla is that I believe they still have more room and control over their supply chain to actually make those price cuts and remain profitable. A VW or other car brand not so much. But we will see", "score": 2, "replies": []}, {"body": "ARK's history of trading $TSLA is very good\n\nTesla enthusiast @TeslaBoomerMama has done a good job [tracking their $TSLA trades](https://x.com/teslaboomermama/status/1732135841626239320?s=46&t=EkpToHWw3RdSnZl0TVSdcw)\n\nBasically, ARK dumped 2/3 of their $TSLA positions during its run up from 200 to 400 in 2H of 2021, and bought back quite a bit during its late Dec 2022 collapse. Then ARK started selling again after its Jun 2023 run up\n\nFinally, ARK is buying $TSLA again during its latest decline", "score": 2, "replies": [{"body": "I feel like this has been said a million times but they maintain a certain amount of each stock percentage wise. When Tesla runs up big then they have to sell some so that Tesla isn’t an overwhelming part of their assets. And then same in the opposite direction", "score": 3, "replies": []}, {"body": "Frankly, Catherine Wood has direct access to the CEO of TSLA ...", "score": 1, "replies": []}]}, {"body": "Tesla is such strong buy right now among large caps.", "score": 1, "replies": []}, {"body": "Where do you get data for Open interest flow for options ? \nDo you have a link for any exchange's data repository.\nI would like to see the change in OI in realtime.", "score": 1, "replies": []}, {"body": "Sell tesla, buy nio", "score": -6, "replies": []}, {"body": "Curious how you are viewing call volume. Checking a few of the most recent dates for AAPL it appears the majority of the volume is call options.", "score": 1, "replies": []}]}
