{"title": "NVDA will RISE…EOY", "selftext": "[removed]", "id": "1g1u0dt", "created_utc": 1728714049.0, "score": 11, "upvote_ratio": 0.66, "num_comments": 58, "comments": [{"body": "This is a subreddit dedicated to building a professional environment to analyze NVDA stock. Posts without descriptive analysis will not be tolerated unless it is an article or video sharing informative information.\n\nFor posts like this please add them in the Daily Discussion thread pinned at the top of the subreddit each day. Thanks!\n\nIf you repeat breaking this rule it will result in you getting banned.", "score": 1, "replies": []}, {"body": "🍿🍿🍿...what's the price next year this time? Holding 800 here. 😁", "score": 18, "replies": [{"body": "That I am not sure. Just seeing until end of year for now", "score": 3, "replies": [{"body": "I'm hoping 250.00.  I've almost tripled my position.", "score": 4, "replies": [{"body": "NVDA levels will rise. The $80’s and $100’s are done. $120 and up now.", "score": 7, "replies": []}, {"body": "Nvda to add 3 trillion to it's market cap in one year 🤣", "score": 2, "replies": []}]}]}]}, {"body": "Anything is possible.  I plan to hold and see where it goes", "score": 13, "replies": [{"body": "I’m excited …", "score": 2, "replies": []}]}, {"body": "I think we will get a dip before it can really go up again I think long term it will be great. I", "score": 10, "replies": [{"body": "love it, all we can do is see and prepare!", "score": 0, "replies": [{"body": "Gonna buy more on the dip!", "score": 3, "replies": [{"body": "That’s always the plan 🙏", "score": 0, "replies": []}]}]}]}, {"body": "The last quarter the margins went down and growth was slowing which was counter trend and the next quarter that will reverse again due to Blackwell. It’s that simple 150+ EOY", "score": 6, "replies": [{"body": "LFGO", "score": 1, "replies": []}]}, {"body": "Ah yes the GME cult analysis of the big bad money makers (who don’t give a shit which direction the stock moves because they make money both ways)", "score": 5, "replies": [{"body": "Did you DRS your nvidia shares?", "score": 0, "replies": [{"body": "🤣🤣🤣 screw GME. I went in, lost money, got out, made back and then some with NVDA", "score": 1, "replies": []}, {"body": "Hahah I own one share of Nvidia, so I didn’t DRS it to best the big evil market villains \n\nI have exposure to 6000 shares via LEAPS and sell 60 covered calls per 45 days", "score": 1, "replies": []}]}]}, {"body": "Here’s what I can add to this conversation thirty years ago there were only a handful of 1 Billion dollar market cap companies now that figure is a small cap companies value. Hold the best companies like NVDA they can only go up in value", "score": 3, "replies": []}, {"body": "Um if you stop day trading you will see a range of EPS and historical PE ranges. It follows it under volatility and manipulation.", "score": 2, "replies": []}, {"body": "The growth in AI companies and demand on microchips is huge \nI believe its going to be rise exceptionally in next year", "score": 2, "replies": []}, {"body": "It could deviate from this timeline, but it still will continue to steadily move up long term, and be volatile, which is actually good for potential high growth, which seems likely.  10-15 years from now I might consider winding down my position based on the company fundamentals, but also maybe not, we will see.", "score": 2, "replies": [{"body": "For sure, we gotta get in as much as possible then there will be another changer to invest in", "score": 2, "replies": []}]}, {"body": "Well if Snkrjoyboy on Reddit believes it, that's good enough for me.", "score": 2, "replies": [{"body": "Much obliged 😘", "score": 1, "replies": []}]}, {"body": "I'm long in NVDA but have recently been concerned about whether or not the stock will bump into some kind of \"ceiling\" as to how far the market will let it run from the pack. I decided to do some analysis using the data available here: [Top 20 S&P 500 Companies by Market Cap (1990 – 2024)](https://www.finhacker.cz/top-20-sp-500-companies-by-market-cap/). I'm happy to say that my concerns are unfounded based on the results from the past 35 years. Here's a summary:\n\nNote: The metrics below (max, stdev upper, avg, stdev lower, min) are exclusive of the YTD values.\n\n\nFrom an overall top 20 market cap change year over year perspective:\n\n* Max: 53.90% (1998: GE)\n* Stdev upper: 34.56%\n* Average: 13.10%\n* Stdev lower: -8.36%\n* Min: -31.88% (2009: Exxon)\n* YTD: 32.10% (Currently just within the upper stdev)\n\n\nThe growth of the top ranked market cap stock each year:\n\n* Max: 86.05% (1999: MSFT)\n* Stdev upper: 45.61%\n* Average: 15.71%\n* Stdev lower: -14.19%\n* Min: -38.67% (2001: GE)\n* YTD: 15.53% (Right at the average)\n\n\nThe % difference between the #1 company market cap and the average of #2 through #20 companies:\n\n* Max: 288.29% (2021: Apple)\n* Stdev upper: 210.38%\n* Average: 152.58%\n* Stdev lower: 94.78%\n* Min: 84.11% (2004: MSFT)\n* YTD: 223.13% (Slightly outside the upper stdev)\n\n\nThe % difference between the #1 company market cap and the #2 company market cap:\n\n* Max: 84.66% (2009: Exxon to Walmart)\n* Stdev upper: 40.54%\n* Average: 21.79%\n* Stdev lower: 3.04%\n* Min: 3.22% (1993: Exxon to Walmart)\n* YTD: 4.63% (Near the minimum. NVDA is closing the gap!)\n\n\nIn conclusion, I don't have any guesses about where the NVDA stock price will end up at the end of the year or next year, but I have at least done some basic analysis to allow my mind to believe that NVDA can break away from the pack and from the 2nd place stock with some fairly large margins. Prior to taking the time to look at the data I had assumed that the top 20 stocks were a little more constrained and clustered.\n\nEdit: Updated the metrics to add stdev values and organize them a little better.", "score": 2, "replies": [{"body": "Ty for your analysis and input. Can’t wait to see what happens!", "score": 2, "replies": []}]}, {"body": "Na bro $160 and then back down to $145 and then next year we’ll be over $160 and spring time $185", "score": 2, "replies": [{"body": "I believe we will go up to higher levels as time goes on. As interest rates go down, it’ll be more enticing for more people to invest in growth stocks. We shall see", "score": 1, "replies": []}]}, {"body": "Or it can crash because stock manipulations.", "score": 2, "replies": [{"body": "True. Very true. But, it can also shoot up to find the next ATH first and then come back down to $120’s level and stay within $120-$145 price range to trade in", "score": -1, "replies": [{"body": "I'll bet the $5 upside it goes down to the $10+ downside. I sold 80%", "score": 1, "replies": []}]}]}, {"body": "All it takes for Trump to say something about Taiwan.", "score": 2, "replies": [{"body": "In Taiwanese 👌", "score": 1, "replies": []}]}, {"body": "Back in August or so i predicted that we wouldnt break the past all time high until october and it did, now i belive that it will stay around 117-120 to 130 till the election then idk what will happen.\n\nI think we could break 145 near new year and then down again to 130-135 until febuary and then maybe up since it took near 4 months to get very close to breaking our all time high (we did see a few above or near 130 occationaly), buuut thats only if we break our all time high within some weeks, if we dont we might see it in febuary if 4 months are linear and febuary is 3 months away almost. \n\nWe could tho break the all time high this year near the end even if its just a few dollars and if that happens we see 140-145 in febuary. \n\nBut thats just numbers without taking in account irl news and are speculations only. \n\n* shrug * idk why these things matters, if you sell you most likely will lose on it until 2030 or past that. Nvidia will rise no matter if we are being speculative about the price, they are one of the guys holding up the future, unless you are about to die or other personal needs there is no point in selling. \n\nBuying a Lamborghini isnt really that good compared to what the price on your stocks will be years from now, maybe you could even buy two if you dont sell until then - if you got that much into nvidia tho, no way i could buy one with my total current amount.", "score": 2, "replies": []}, {"body": "Likely not this year. Blackwell impact won’t show until Q4 FY25 earnings in Feb 2025", "score": 1, "replies": []}, {"body": "170 ATH by end 2024", "score": 1, "replies": []}, {"body": "ok, then that means if you really believe it, you would be looking to sell/write calls and buy puts in that range where premiums would be high and then you can reap the rewards.  that'll get you a nice source of income.", "score": 1, "replies": [{"body": "Going for $150 strike price, 1/17/2025 exp", "score": 1, "replies": []}]}, {"body": "A lot depends on November earnings and how well Blackwell is rolled out.\n\nBut the company is a victim of its own success. It can’t produce Blackwell fast enough, which is bad because people question the capacity.\n\nThe last two weeks have been about wider pre-market sentiment pre-election, not to do with Nvidia’s fundamentals.\n\nI struggle to believe its market cap can rise significantly more.", "score": 1, "replies": [{"body": "Then…buying more at dippppp", "score": 2, "replies": [{"body": "If it dropped $10-20 I’d be all over it like cheap perfume.", "score": 2, "replies": [{"body": "Yeah. But, I don’t think that’ll happen until we reach the new all time high peak. As it dips down, a second attempt to reach it will happen but most likely fall short and fall more.", "score": 1, "replies": []}]}]}]}, {"body": "Sounds good to me. I’m holding for 20yrs anyway hah!", "score": 1, "replies": [{"body": "Oh yeah … new market cap will be reached for sure by then", "score": 1, "replies": []}]}, {"body": "When Trump wins it will sky rocket. There is a lot of money sitting on the sidelines waiting for energy prices to come down.", "score": 1, "replies": [{"body": "OooooO weeeeeeeee", "score": 2, "replies": []}]}, {"body": "I sold all my shares because I think the stock has split too many times, and no amount of money can keep driving it up. For every dollar it goes up, the market cap increases by $30B, how insane is that? With 200M shares traded daily on average worth $27B, that’s half of NVDA’s buyback for the quarter. Thinking it’ll hit $140 again, let alone $200, is just delusional. You’re all about to get trapped, and those shares are going to fuel a massive short soon. I might be wrong, but that’s my take. Good luck, everyone.", "score": -6, "replies": [{"body": "Imagine thinking this would happen to Amazon, Tesla, Meta, or Google lol", "score": 3, "replies": [{"body": "Did it not just happen to tsla yesterday?", "score": 1, "replies": [{"body": "Haha you’re totally right -  I own all the other stocks except Tesla because I fucking hate Elon Musk.  I’m glad you showed me how bad they are doing.  Happy Monday!", "score": 1, "replies": []}]}]}, {"body": "The first part was reasonable although stock don’t really work that way, but saying it will never go to $140 again is delusional, I think also that you are wrong in that judgement. As long as NASDAQ is pushing up and break another ATH, NVDA will push along side it. It is okay to sell, but the danger is to believe something to confirm your own biases.", "score": 2, "replies": []}, {"body": "Thank you, all opinions and thoughts are welcome. My take is we are still so new in this AI boom. To think $3 Trillion Market Cap is the be all end all is not what I believe. The next goal is to get in the $10 TrillionMarket Cap. AI revolution will be the way to get the market there. Remember … the Mag 7 are highly invested into OpenAi and other businesses which means they will profit at some point in time and grow even more.", "score": 1, "replies": [{"body": "They’ve invested BILLIONS and they will want returns in the TRILLIONS. They will definitely make it happen.", "score": 3, "replies": []}]}]}, {"body": "I believe by the EOY or in 6-months, the stock will either go up, down or stay the same! Book it and I don’t need no stupid chart for my prediction!", "score": 0, "replies": [{"body": "IM RICK JAMESSSSS BITCHHHHH!", "score": 1, "replies": []}]}]}
{"title": "Week 41 $1,626 in premium ", "selftext": "I will post a separate comment with a link to the detail behind each sold option this week.\n\nAfter week 41 the average premium per week is $766 with a projected annual premium of $39,823.\n\nAll things considered, the portfolio is up +$46,958 (+21.32%) on the year and up $80,895 (+43.43%) over the last 365 days. This is the overall profit and loss and includes options and all other account activity.\n\nAll options sold are backed by cash, shares, or LEAPS. I do not sell on margin, nor do I sell naked options.\n\nAll options and profits stay in the account with few exceptions. I took out $17K earlier this year for taxes and various expenses. I replaced some of the $17K with a $9K deposit recently. This is not my full time job, although I wish it was. I still grind on a 9-5. \n\nAdded $500 in contributions to the portfolio. This is a 26 week streak of adding at least $500.\n\nThe portfolio is comprised of 94 unique tickers with a value of $172k. I also have 142 open option positions, up from 141 last week. They have a total value of $96k. The total of the shares and options is $268k. \n\nI’m currently utilizing $38,300 in cash secured put collateral.\n\nI sell options on a weekly basis. I prefer cash secured puts and covered calls. Sometimes I’m ahead of the indexes and sometimes I’m behind. My goal is consistency in option premium revenue. As shown below, I have been able to increase the premiums on an annual basis and I will attempt to keep this upward trend going forward. \n\n1 year performance (365 days)\nME 43.43% |*\nNasdaq 35.30%  |\nS&P 500 32.86% |\nDow Jones 26.80% |\nRussell 2000 26.00% |\n\n*Taxes are not accounted for in this percentage. The percentage is taken directly from my brokerage account. Although, taxes are a major part of investing, I don’t disclose my personal tax information.\n\nI have been able to increase the premiums on an annual basis and I will attempt to keep this upward trend going forward. \n\n2025 & 2026 LEAPS\nIn addition to the CSPs and covered calls, I purchase LEAPS. These act as collateral to sell covered calls against. You may have heard of poor man’s covered calls(PMCC). The LEAPS are up $6,329 this week and are up $42,273 overall.\nSee r/ExpiredOptions for a detailed spreadsheet update on all LEAPS positions including P/L for each individual position.\n\nLast year I sold 964 options and I’m at 1,079 year to date.\n\nTotal premium by year:\n2022 $8,551 in premium.\n2023 $22,908 in premium.\n2024 $31,399 YTD.\n\nI am over $72k in total options premium, since 2021. I average $24.36 per option sold. I have sold over 2,900 options.\n\nPremium by month\nJanuary $1,858\nFebruary $3,670*\nMarch $3,727*\nApril $2,853*\nMay $2,745*\nJune $3,749*\nJuly $3,775*\nAugust $945\nSeptember $5,310*\nOctober $2,767* (thru week 2)\n*indicates personal record in that month. This means that 8 out of the first 10 months have been a record amount of premium for that month. \n\nTop 5 premium gainers for the year:\n\nHOOD $3,112\nARM    $1,844\nAFRM  $1,719\nSHOP  $1,682\nPLTR   $1,503\n\nPremium in the month of October by year:\n\nOctober 2022 $771\nOctober 2023 $2,193 \nOctober 2024 $2,767 (week 2) \n\nTop 5 premium gainers for the month:\n\nPDD     $672 |\nCRWD $431 |\nHOOD $414 |\nSHOP  $265 |\nPLTR    $122 |\n\nThe premiums have increased significantly as my experience has expanded over the last three years. \n\nHope you all had a productive and successful week. Make sure to post your wins. I look forward to reading about them!", "id": "1g1op17", "created_utc": 1728694322.0, "score": 120, "upvote_ratio": 0.95, "num_comments": 78, "comments": [{"body": "My My My ... well done my friend, you continue to impress. Keep doing what you are doing and I will continue to enjoy your results.\n\nI collected $229 in net premium this week ($680 so far in October)\n\nI use margin to leverage my holdings and sell short puts, short strangles and short straddles. (currently 14 short puts, 2 short strangles and 1 short straddle open)\n\nMy options account is now at $89,477. I am currently 34% cash/sgov and 66% equity (mostly SPY and VT)\n\nThis week was the 44th week in a row I deposited $775 cash to my account.\n\nI opened my options trading account and started trading options in July 2023 with about $2000 and will keep updating until I reach my goal of $300,000 for this account, sometime in 2028.\n\nEnjoy your weekend and good luck to everyone next week :)\n\nI started posting a lot of my current open positions (both good and bad) at r/OutsideCup", "score": 18, "replies": [{"body": "Hey Mr. Cup. Thanks for checking in again with your results! My favorites are the 44 weeks and the almost $90k built up in your options account. \n\nIf you are reading this, I agree, check out r/OutsideCup I appreciate his insights and his transparency. \n\nKeep up the good work, man.", "score": 5, "replies": [{"body": "Thank you, I always appreciate your kind words :)\n\nI have learned so much from your posts. My hope is someone reads through mine and learns just 1 thing they didn't know yesterday.", "score": 5, "replies": [{"body": "This is the goal. Posting is fun and all but actually helping someone learn something or point them in the direction to learn something is a pretty nice feeling.", "score": 8, "replies": []}]}, {"body": "Congratulations on the great results & thanks for sharing! What criteria do you use to pick CSPs, and can you share your ytd premium on CSPs vs CCs? I’m asking because many people try to avoid assignment, but my ROI is higher on CC premium.", "score": 2, "replies": [{"body": "Hi Pixalated\\_Pop. Thanks for the comments/questions. If I am selling CSPs, the objective is to own the shares. That being said, I am usually aggressive in weekly puts that are just below the current value. I will roll and squeeze as much premium as possible until it eventually dips and I own the shares. My goal is assignment, I am not just selling CSPs for premium. I want to own the shares to sell covered calls against the ticker. \n\nMy YTD premium breakdown is:\n\nCCs $29k\n\nBuy backs -$4.5k (mostly CRWD on one buy back)\n\nCSP $7k\n\nTotal $31,399\n\nBest of luck to you!", "score": 5, "replies": []}]}, {"body": "im doing 5-7k a week in premium lol, last statement over 350 pages long lol", "score": 1, "replies": []}]}, {"body": "Can’t really play theta with $2K, how did you build from that position? Did you just do pure calls and puts to success?", "score": 2, "replies": [{"body": "Started depositing my pay, adding 775 a week to build my balance\n\nI think 1st week I did a put on Ford until my balance started building up. A few months in I transfered about 20k worth of apple and Berkshire in from another brokerage account to get me some buying power on margin", "score": 3, "replies": []}]}, {"body": "im doing 5-7k a week in premium lol, last statement over 350 pages long lol", "score": -1, "replies": [{"body": "How much cash if you don’t mind me asking are you using to earn $5-$7k weekly premiums?  Sounds like it be somewhere around $500k", "score": 1, "replies": [{"body": "yer well as im selling around 10 deltas its more than that", "score": 0, "replies": []}]}]}]}, {"body": "This is so fantastic! Proof that consistent strategy with non-emotional management is a very feasible way to use options to escape the trad rat race!", "score": 11, "replies": [{"body": "Hey Embarrassed\\_Job\\_1561. Thanks for the positive comments. Man, escaping the rat race has me more than motivated.", "score": 4, "replies": []}, {"body": "And under-perform the S&P YTD", "score": -2, "replies": [{"body": "“Level 100 Karen” checks out…", "score": 4, "replies": [{"body": "Acknowledging the most important benchmark when evaluating a trading strategy is too mean, I guess.", "score": 0, "replies": []}]}, {"body": "Well, lookie lookie what you learned here. You learned his strategy isn't for you, and you much perfer the index.\n\nAwesome, you will do well long term, and I probably speak for all of us when I sincerely say we wish you the best and success in whatever strategy you choose.\n\nI would hope you wish the same for your fellow investors :)", "score": 2, "replies": [{"body": "I'm up 38% YTD and 51%YoY. And that's not from just index investing.", "score": 1, "replies": [{"body": "Good numbers.\n\nI don't actually keep track of mine. it's such a pain to track. I have a rough estimate, I am mostly equity", "score": 2, "replies": [{"body": "Believe it or not in this instance I'm not actively trying to roast OP. But I am serious that the point of active investing is alpha, and if you're not generating alpha you need to be honest with yourself that your strategy isn't working and try to understand why. \n\nIn this case, OP posts a lot about his premiums but very little about bets that go against him. That leads me to believe he is either not honest with himself about losses or far too conservative in his capital allocation. Either one requires a come to jesus moment at this point in the year  in my opinion.\n\nAlso, you really should track your performance. You can't improve what you can't measure (speaking as someone who does a LOT of statistics and metrology for a living)", "score": 2, "replies": [{"body": "I get that you are all about Alpha, but you don't just start there. I don't really think it is good advice to simply give up if you are not hitting Alpha after a short period of time. \n\nThat being said, the reason that I talk about premium is because that is my focus. There is no rule about what I should and should not be focussed on when posting. I don't really think it is fair to make assumptions without coming right out and asking about it. \n\nEveryone can see when my plays are getting out of hand with the high DTEs. I already have some capped covered calls that have been rolled out to 2027. Obviously, this was not part of the plan. The details behind the plays are posted every week and I list the average DTE in the summary as I am not trying to hide anything. \n\nAs far as the \"either or\" on the too conservative with capital or not honest with myself about losses... that is a neither. I take an appropriate amount of risk, especially since risk is subjective to the person putting up the capital. \n\nThe \"come to jesus moment\" comment makes me think you are not very serious about the comments you are making. \n\nNot taking anything personal, this is just my rebuttal to the comments that were directed at me.", "score": 3, "replies": [{"body": "I mean you can say all of those things buddy but your results speak for themselves.  I guarantee your Sharpe ratio is lower than the S&P which means you're not being paid appropriately for the risks you're taking. \n\nYou're taking above normal risk by writing options and you're not getting any risk premium for it. Your desire to turn every position into profit (rolling CCs to 2027 for example) is costing you money (by costing you alpha) \n\nAnd nobody said give up. I said you need to change your strategy, as on a post-tax basis you're doing pretty poorly\n\nYou should not be so defensive if you're going to post your strategy for all to see. I guarantee you any quant or serious wall street professional is deeply unimpressed with your results.  I'm giving you the umvarnished truth: that for the effort you're making you're not doing very well.  I'm sorry if that bothers you but it is objectively true.", "score": 1, "replies": [{"body": "I am not being defensive. I am answering to the comments directed at me. You are not bothering me, I am speaking to and correcting some of your assumptions. I have never said that my goal is to outperform markets, although I am over the last year, but you seem to think YTD is more important than that.\n\nI am not worried about wall street professionals opinions. There are plenty of highly paid wall street professionals that underperform on a regular basis. \n\nYou have nothing to be sorry about. I will respond when I see statements that are not true.", "score": 2, "replies": [{"body": "I'm not making assumptions about most of the things I'm saying, most things I am saying are plain fact and objective.\n\nYour Sharpe ratio is your rate of return divided by your standard deviation. It measures your return normalized to one measure of risk. Is yours lower than the S&P? I am willing to bet my house it is.  That means for the risk you're taking you're doing worse than a diversified index.\n\nI fully acknowledge your YoY is better than the index, but you also have to understand that the vast majority of that return (actually more than half of it) is coming from the last 2.5 months of last year. Maybe there was something about that strategy that worked then that isn't working now. And quite frankly it's a cop-out to say your goal is not to outperform markets. That's what people who under-perform say to dodge questions about the weakness of their strategy. That 100% is the goal of every active investment strategy.\n\nI think you strongly need to reconsider indefinitely rolling covered calls to keep shares. Having a CC expiring in more than 2 years has absolutely terrible rates of return (assuming you rolled it that far, which I admit I *do* assume based on the context from your statement).\n\nYou may be better off with spreads rather than CSP to up the leverage, especially since you seem to be decent at picking stocks and entry points.  I have had great success this year with diagonal strategies. \n\nDon't make excuses for yourself. I've underperformed in the past as well, and I changed my strategy to get better. As they say about the definition of insanity....", "score": 3, "replies": [{"body": "All good my man. I don't think either one of us is going to gain anything further from the conversation. I appreciate the back and forth. \n\nHope you continue to hit Alpha, fellow investor.", "score": 2, "replies": [{"body": "Who says I don’t aim to beat the S&P??? Then what is your goal to waste your time? Spending anytime to perform the same or worse than the S&P is a waste.", "score": 2, "replies": [{"body": "Hi abitofhumor. Thanks for the comments, questions, and your opinion of what is a waste of my time. I never said that I don't aim to beat the S&P. I did say that it was not a goal. Obviously, I want to get the best percentage possible, but I don't obsess about benchmarks. \n\nPeople spend time on all kinds of things that I personally think is a waste of time. I just don't go out of my way to tell them about it, because I think that it is a waste of time to try to convince other people that I think that they are wasting their time.\n\nWhat I'm doing is not a waste of time to me because I enjoy it. \n\nBest of luck in whatever you are wasting your time on.", "score": 0, "replies": []}]}]}, {"body": "I think the strategy is designed to sell patreon subs.", "score": 1, "replies": []}]}]}]}]}, {"body": "I get what you are saying about tracking but it's not really my main concern. I know if I have 90% of my portfolio in a market ETF, I generally know what my performance is on those funds, same with what I have cash, I know what it is paying.\n\nOptions income (or loss) is just a bonus (or expense) on top of that.", "score": 2, "replies": []}]}]}]}]}, {"body": "Why is this getting downvoted? If he just put all that money in the S&P and did literally nothing else, he would’ve achieved the same results.", "score": 1, "replies": [{"body": "Because apparently facts *do* care about feelings. Also most people are doing worse than this based on all the \"wow, amazing job!\" posts.", "score": 1, "replies": [{"body": "Facts do care about feelings?", "score": 0, "replies": [{"body": "It's a reference to a Podcaster, ben Shapiro, whose catchphrase is \"facts don't care about your feelings.\"\n\nThe joke here is that, in fact, the fact I reference is true yet people seem to be upset by that.", "score": 1, "replies": [{"body": "Gotcha. I don't listen to that guy, as it is my opinion that he is a waste of time. Look, you keep bringing up \"defensive\" and my \"feelings\" about your comments. I simply don't care as much as you may think. \n\nWhat you are doing is projecting. You care about what wall street analysts think, I don't. That is why you brought that up in a previous post. You care about the benchmark and sharpe ratio WAY more than me and believe that everyone else should too. I just don't care as much as you. We have different priorities.\n\nIf you think that is dumb, ok... It does not affect me at all. But stop telling me that I'm lying to myself or how I am feeling.  \n\nIn your original post before you said that I was underperforming YTD, I did not disagree. I only started to disagree when you starting talking about how I felt.\n\nIf your point is to tell me that I am underperforming, point taken. Why do you insist on making your point over and over and over again?", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Expired, congrats on another fantastic week!  You pulled in more than twice your weekly average.  And, your 1-year performance is still leading the pack including an 8-point lead over your closest benchmark (Nasdaq).  You're clearly doing something right (surprise, surprise)!  I see you made some nice premiums off of HOOD, and old reliable CRWD produced some really nice premiums (again) including a $70 premium on one of your 1DTE plays.  Outstanding!  You and I actually sold the same CC this week (GME $22) although you sold yours on Thursday and I sold mine on Monday.\n\nI had a nice week collecting $1250 in premiums.  I had a small debit this week - I had to pay a debit to roll a short AVGO call up and out.  I only went up $5, but even after going out a full month I still had to pay a $50 debit.  Not fun.  On a happier note, I pulled off another profitable 1DTE buy-write on SOXL.  Last week I made $94 on that play and this week I only made $68 but it was still fun to make and monitor that trade.  The short call finished ITM so my shares will be called away tomorrow morning.  I'll probably try it again next Thursday.  Works until it doesn't!\n\nLike Gucci said, it's fun watching your (highly successful) journey.\n\nHappy trading next week!", "score": 5, "replies": [{"body": "Hey Lintsowner, thanks for the detailed and on-point comments. Along with the GME play, our premiums were almost identical too. I was hoping to hear the update on the buy-write for SOXL. This play seems pretty interesting. \n\nHappy trading my man. Thanks again!", "score": 3, "replies": []}]}, {"body": "What are you doing with Hood?", "score": 3, "replies": [{"body": "Hi Electricengineer. I have 1,000 shares of HOOD. They have been on a roll lately and I've been rolling covered calls and collecting premium as the underlying has been increasing.\n\nEDIT: Thank you for the award!", "score": 3, "replies": []}]}, {"body": "You sold PLTR expiry June 2026 strike 45\n\nIt closed at 43.51\n\nWhat's your rationale for selling otm LEAPS, and for selling at all time high?", "score": 3, "replies": [{"body": "Hi Plantastic24. Thanks for the question.\n\nI had two LEAPS on PLTR and recently exercised both of them. One was at a $3 strike and the other was a $17 strike. Now I am in at 201 shares with an average cost of $9.98. \n\nSince I understand that selling covered calls can lead to capped gains, it was a known risk that PLTR had the potential to soar and lead to unfavorable DTEs. \n\nHowever, due to the average cost of $9.98, I am ok with parting with the shares at $45 and $40 respectively. Those are my two strike prices with 2026 expirations. \n\nIf PLTR keeps going on this terror, I lose out on some long term gains. If it goes back down, I may be able to wait out the covered calls to 2026. We will just have to wait and see how it plays out.", "score": 2, "replies": [{"body": "your better off getting the time decay and moving the 2026 to 45days/30days and keep doing it every month, if you dont mind losing the shrs, if you do it every month youll get more $ then losing it in years, also you can just roll them to not pay cap gains", "score": 5, "replies": []}]}]}, {"body": "Well done mate for another great week!", "score": 3, "replies": [{"body": "Thanks, asxetos101. I appreciate the comments. \n\nBest of luck to you in October!", "score": 1, "replies": []}]}, {"body": "[detailed list of each option sold this week.](https://imgur.com/a/6DSZhb5)", "score": 2, "replies": []}, {"body": "Thanks fam it’s fun watching your journey", "score": 2, "replies": [{"body": "Hey GUCCIBUKKAKE. Thanks for the comments. I appreciate it!", "score": 1, "replies": []}]}, {"body": "how do you manage risk? eg not opening more than X contracts per ticker etc", "score": 2, "replies": [{"body": "Hey cornsushi, thanks for the question. When I'm selling options, I manage risk by limiting exposure in any single position and use defined risk strategies like CSPs and covered calls. For covered calls specifically I am conservative with Delta and stay around .1-.2. I'm always considering rolling positions if trades move against me and sometimes if they move favorably. I diversify the trades across different industries to reduce the impact of any single trade going wrong, however, I am heavy in tech. I monitor market conditions and implied volatility as best that I can, and I try to have an exit plan for worst case scenarios.\n\nBasically, I pay attention to the market and monitor my positions and try not to make super risky trades. Also, I am not too heavy in any single ticker.", "score": 4, "replies": [{"body": "How long do you estimate is spent per week on this portfolio? I assume have a full time job outside of this? Or is this being done for income?", "score": 2, "replies": [{"body": "Hi idkyou1. Thanks for the questions. I have a full time job. I am on the West Coast and wake up around 6am to prepare for the 6:30am market open. This consists of checking out foreign markets, reading articles, looking at the leading/trailing tickers. I also check it out throughout the day. I have alerts set up to notify my of 5% jumps/declines on a lot of stocks. After the markets close at 1pm, I check out for a while and then do some more readying listening to podcasts in the afternoon/evening. It is hard to quantify, but I am always checked in, so to speak. It is more of a hobby than a job to me.", "score": 1, "replies": []}]}]}]}, {"body": "What do you use to track?", "score": 2, "replies": [{"body": "Hi Covercallmillionaire. Thanks for the question. I assume you mean tracking tickers, I spend a lot of time tracking on FinViz.com. However, you may mean tracking my performance in which I use an Excel spreadsheet. I pay for Microsoft 365 which comes with a Stock tracker embedded in Excel. It is a pretty nice feature as it pulls real time pricing, 52 week highs and lows and a bunch more data. You simply enter a ticker and then you have options to select the output in adjacent cells.", "score": 3, "replies": [{"body": "Nice! And the options thing with Robin Hood?", "score": 2, "replies": [{"body": "Yes, I use Robinhood as my broker to execute the options.", "score": 1, "replies": []}]}]}]}, {"body": "Are you mainly selling puts with deltas .1-.3? Or do you sell more aggressive ones for premium and/or to get assigned shares you want to hold?", "score": 2, "replies": [{"body": "Hi sciguyx, thanks for the questions. The .1-.2 is closer to my Delta for covered calls. When I am selling puts, I am usually trying to get into the position at a slight discount by setting the strike right below the current value and collecting premium. So, I am more aggressive with PUTs than covered calls.", "score": 3, "replies": [{"body": "So your main goal with calls, is to collect premium and to hold the shares - while with puts you aren't necessarily \"scared\" to get assigned? The goal is to obtain shares, more or less, and keep them?", "score": 2, "replies": [{"body": "I think you nailed it. I don't usually enter a position where I am worried about the position or the outcome. This feeling of scared usually means I am doing something I should not be doing. And yes, the goal is to obtain quality long term shares.", "score": 2, "replies": [{"body": "Yeah I definitely learned I did something wrong this week, had to roll my covered calls on HOOD twice because it went parabolic. 13% more or less in 2 days. I’m hoping to be able to keep rolling them but it doesn’t look like the premium is there yet. In this instance, would you buy back the option for a loss to be able to keep the shares before you allowed them to be called away?", "score": 2, "replies": [{"body": "I don't just buy back, I roll. I figure that if I buy back, the money is just gone. If I roll, always for a credit, the position may turn in my favor. When I buy back, there is no chance of getting that premium back. Now, there are some isolated moments when I have bought back, so, I am not saying never buy back.\n\nIf the shares get assigned, start again with a CSP or LEAPS. Although, I am actively trying to avoid getting the shares called away, I am rarely emotional about it. It is just a business transaction. If I think it will continue to grow, I'll make sure to get back in.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "curious to know details on afrm after this crazy run. did it get called away?", "score": 2, "replies": [{"body": "Hi PreparationCareful87. Thanks for the question. \n\nI own 410 shares of AFRM with an average cost of $46.75. I got in near the IPO in 2021 which was not a good entry point. All 4 covered calls against the 400 shares have strikes of $52.50 and expire 1/15/27. If it continues to go up, I'm capped. If it stays flat I may ending up riding it out. If it goes back down, I may have a chance of buying it back or rolling it backward. \n\nBut to answer your question, they have not been called away yet.", "score": 2, "replies": []}]}, {"body": "Hi Expired. Thanks again for posting your results. I enjoy reading your updates every week. My portfolio of cc’s is up about 9% ytd. It would have been higher had I not played around with verticals earlier in the year but I’m happy with my results. I have another 6% in sold premiums I can collect by the end of the year if the market stays stable. My best gainers this week were PLTR, TTD, LLY, and JPM. My worst ticker was FSLR. I’ve moved out of a lot of tech stocks and it’s only 22% of my portfolio right now. Keep up your good work! 🙂", "score": 2, "replies": [{"body": "Hey TrackEfficient1613. Thanks for the comments and kudos. I appreciate it. Nice job on PLTR, it has been parabolic recently. For the movement out of tech, where are you redirecting the funds?\n\nThanks again. Best of luck in the upcoming week.", "score": 2, "replies": [{"body": "Thanks I appreciate it. I bought 400 shares in May and it’s been a good ride. I’m currently selling cc’s on it and csp’s to create a spread. So far I’ve been able to get the entire growth of the stock so it hasn’t been limited by selling calls. I learned a little more about the company over the weekend and am going to add to my shares and go to 5 contracts in  cc’s and 5 contracts in puts. I have 100 shares of everything else I’m selling cc’s on. Right now I’m pretty happy with the mix of stocks. Almost all of it is in Roth IRA’s so I’m not worried about tax on gains. \nThey are LLY,COST,AAPL,JPM,FSLR,ABBV,AMZN,PLTR,NVDA,TTD,MS,NÉE,ROKU,DKNG,CHWY, and SOFI. Things change when I earn call premiums so I’m always adding to the portfolio. I just bought to close some WFC puts and routinely make small adjustments. Basically my focus has been on adding manufacturing, retail, financials, and utilities to take the place of where I was more tech heavy. Two stocks I’m looking to add at some point are JCI and MSI. I feel FSLR is going to go way up or down depending who wins the election so I want to get out of it by the first week of Nov! Lol", "score": 2, "replies": [{"body": "Nice timing! Looks like you got in, in the low $20s if you bought PLTR in May. That is great that you are able to produce solid results in a Roth! I am currently building my Roth to a point where I can start to sell options in that portiolio as well. \n\nI like the thought behind your plays. The reduction of risk by reducing the tech heavy position, the careful additions in strategic categories/sectors, and the FSLR exit before the election. All forward thinking incremental adjustments. I believe this is what they call investing! I mean that in the most complimentary way. \n\nBest of luck!", "score": 2, "replies": [{"body": "Thank you! I started trading options in January. The first 4 months was pretty much a mess as I was trying a bunch of different strategies. Some worked and some didn’t 🙁. I had to realize what my strengths were which is understanding sectors and choosing stocks that had good growth potential not guessing short term movements. Since then I’ve changed the way I trade and have been averaging about 2% a month.", "score": 2, "replies": []}]}]}]}]}, {"body": "Hey expired, another 1k week and you are getting consistent, looks.like you have cracked the magic formula to land 4 digit premiums.each week! Keep going strong 💪, you deserve it for your passion and work you are putting in each week!!\n\nThis week I had $756, in premiums from TNA csp and SQ CC. Holding BITO CC, SQ n Riot covered calls for next week.\n\nGood luck for next week.", "score": 2, "replies": [{"body": "Hey abicit. I don't want to be pessimistic, but I don't think I will hit $1k this week. I have a lot of expiring options on 10/18. Regardless, I appreciate the kind words. \n\nNice job on the premiums. If you have a chance, I would be interested on how BITO has been doing for you. Someone posted about it weeks ago, not sure if that was a contributing factor to you getting in or just a coincidence. \n\nThanks for the good luck wishes, same to you!", "score": 1, "replies": [{"body": "Hey expired , I am rooting for a 1k week again. BITO came in to radar based on twitter, follow @rationaltrades, he gives out a lot of insights on cryptos and mining stocks.\n\nFor BITO I took a 18p 10/25 CSP that got breached today, I was  hoping for an assignment, worst case I take the premium. Check out their dividend history and combined with CC could be a good income generator provided they are consistent with the dividends.", "score": 2, "replies": []}]}]}, {"body": "it's a measure of the quality in a post when i can read thru the commenting feedback(s) & the originating value is multiplied by these added perspectives.  learning is contagious.", "score": 2, "replies": [{"body": "Hi machine2SEE. Thanks for the comments. I agree, it is nice to have discussion and conversation that everyone can learn and benefit from. This is why I close out my weekly post by asking others to post their wins. Not only is it good to celebrate accomplishments and milestones but the descriptions of the plays encourages others. \n\nGetting a DM telling me that someone has sold their first option because of something they read in one of my posts or comments makes my whole day. Also, I just like hearing/reading about people on their come-up! Especially financial victories like paying off a high interest credit car, car, or loan. I know how hard it is to be responsible with money. Anyway, this kinda went off topic, but thanks again for your comment.", "score": 1, "replies": [{"body": "there is an exemplary positioning of leverage to a discerning judgement in one's PA modeling.  options offer the pitch to structure those choices & be effective.  your posts & a few others give cause to the time spent reviewing for that opportunity i seek. all the best to your forward efforts.  Shelly Natenberg would often pop into our office in WTC 7 when visiting nyc & the floor and many a discussion was bandied about during those precious moments. solid thetagang offerings make up life's displacement in these new paradigms many, many challenges later.", "score": 2, "replies": []}]}]}, {"body": "I'm going to come in with a different take: although you put a nice package together you're under performing the indexes YTD. The whole point of investing strategies beyond just buy and hold is to generate alpha. Which you aren't doing YTD (though you are generating alpha on the 1Y chart.\n\nI appreciate the work and effort you put into this but I don't think you have a good strategy. You do, however, make this subreddit a better place by posting quality content.\n\nBest of luck in your future trades, but I suggest strongly reconsidering your strategy because unless you value your time as free you're not beating the indexes over the last 10 months.", "score": 2, "replies": [{"body": "Hi MostlyH20. I appreciate your comments both positive and negative, mostly because you do it in a straightforward and honest way and which I believe to be without malice. \n\nThank you for wishing me luck and providing honest feedback. Best of luck to you as well.", "score": 2, "replies": []}]}, {"body": "Incredible results again!!! And what a spectacular run from CRWD!", "score": 2, "replies": [{"body": "Thanks, Mean\\_Office\\_6966. Always appreciate when you stop by and drop some comments.", "score": 3, "replies": []}]}]}
{"title": "1% a day keeps allows me to play", "selftext": "Whoever tried doing the 1% a day thing was doing it wrong. This is a result of a LOT of day trades. I can easily do 10-15 day trades a day. Keep around $30k in this account and play with it for fun money. A lot of boomer stock scalping, such as DG, RKT, UVXY, JPM, HUM, and AZN. UVXY has a special place in my heart because there’s always money to be made in volatility. All I want is 10-15 cents per share x 1400 shares about 5-10 times a day. Bought a house early 2022 and all my money had to go there so that’s why you see a flatline there for a while.  ", "id": "1g1thpu", "created_utc": 1728711839.0, "score": 199, "upvote_ratio": 0.85, "num_comments": 58, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 54 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "How do you change to font Color from red to green?", "score": 270, "replies": [{"body": "Maybe if we turn our phones upside it turns green...", "score": 16, "replies": [{"body": "This is the way.", "score": 6, "replies": []}]}, {"body": "Put everything into NVDA puts that expire on Friday. Trust.", "score": 3, "replies": [{"body": "Thatda been a little $$$ now huh?", "score": 1, "replies": [{"body": "Hopfully he trusted me ;)", "score": 1, "replies": []}]}]}, {"body": "$NVDA calls. Make sure the strike price is $200 and they expire by the end of the week, free ez money", "score": -16, "replies": [{"body": "Post your position and stop yapping", "score": 3, "replies": [{"body": "Im just giving terrible advice for no reason lol", "score": 6, "replies": [{"body": "W in WSB stands for you", "score": 0, "replies": []}]}]}]}]}, {"body": "1%?\n\nIm sorry but r/smolppinvesting is that way 👉👉", "score": 128, "replies": [{"body": "Description of that sub is “DCA into HYSA” \n\nCracked me up 🤣🤣", "score": 22, "replies": [{"body": "You should see the welcome message after joining", "score": 4, "replies": []}]}, {"body": "I’m sorry I didn’t see the sign when I came in. My other account is a big boy account I swear", "score": 2, "replies": []}]}, {"body": "And my broke ass can't do more than 3 trades week . Can't wait to make money to get rid of this Shitty rule .", "score": 41, "replies": [{"body": "I mean, you can just switch to a cash account and then you aren’t subject to it.", "score": 24, "replies": [{"body": "Yeah but then you have to deal with T+1 settlement peroid. If you yolo day trade, that limits you to 5 trades a week. Better than 3 🤷", "score": 15, "replies": [{"body": "It always settles overnight, you can trade the entire value of your account 5 days per week. If youre using your entire account on one trade, what are you doing anyways", "score": 9, "replies": [{"body": "Not being a pussy?", "score": -13, "replies": []}]}, {"body": "Well you can buy with unsettled cash but you can't sell so more like 5.5", "score": 1, "replies": []}, {"body": "I can literally do like 20 round trips a day with no issues", "score": 0, "replies": [{"body": "Are you:\n1. Using your full account size in each trade?\n2. Have an account registered in the US?\n3. Have an account under $25k\n5. Using margin to trade?", "score": -3, "replies": [{"body": "Usually, Yes, No, Yes", "score": -5, "replies": [{"body": "If your account is over $25k and you have margin, then patern day trading rules wont affect you", "score": 6, "replies": []}]}]}]}]}]}, {"body": "Cash account dude", "score": 1, "replies": []}, {"body": "What app are you using? This is why I switched from cashapp to webull", "score": 1, "replies": []}]}, {"body": "I basically do the same thing with only leveraged etfs in my Roth IRA, no options, and am up similarly. The majority of my trading is just TSDD and TSLR. Up 376% ytd", "score": 17, "replies": [{"body": "Not worried about a hugely drop on the individual stock while you’re holding/waiting for it to go up? Or do you just hop in while there’s momentum", "score": 2, "replies": [{"body": "The momentum this year has been very predictable especially with TSLA and NVDA. And if I’m unsure I’ll sit it out and wait a few days", "score": 3, "replies": [{"body": "That’s exactly how I feel with the markets, minus earnings surprises and upsets. Day to day market moves are very predictable and nothing is linear", "score": 1, "replies": [{"body": "How do you time your entries?\n\nDo you average down at all?", "score": 1, "replies": []}]}]}]}]}, {"body": "Now do it for years and come back and let us know how it is working out.", "score": 10, "replies": [{"body": "Gonna be the world's first trillionaire.", "score": 4, "replies": [{"body": "Not when I pull out gains past $30k", "score": 5, "replies": []}]}, {"body": "Will do, sir", "score": 1, "replies": []}]}, {"body": "I am using an Ai with Cryptohopper, its doing average of 2% per day.", "score": 58, "replies": []}, {"body": "What's your stop loss rule of thumb?", "score": 11, "replies": [{"body": "I’d like to know as well", "score": 2, "replies": [{"body": "Try not to get into securities that suck, are too volatile in the first place. If I am down 2k at close on a position, and the close looking iffy (downward sloping regard pattern) I close out. If close is upward sloping I hold on and try to sell at open", "score": -1, "replies": [{"body": "The downward sloping regard pattern is the reason I lost my house and my wife left me", "score": 4, "replies": []}]}]}]}, {"body": "Congrats and well done.\n\nDiscipline & strategy are something many people lack when it comes to investing. They do so at their own peril.", "score": 8, "replies": []}, {"body": "No options just shares?", "score": 3, "replies": [{"body": "No options at all, never traded then", "score": 27, "replies": [{"body": "#🙀", "score": 5, "replies": []}]}]}, {"body": "Why does your chart go up and not down?", "score": 4, "replies": [{"body": "Ancient Chinese tradition", "score": 5, "replies": []}]}, {"body": "Hmm my math may not be mathing right but those ups and downs don’t look like 1% a day", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Scroll through the photos my brother", "score": 0, "replies": []}]}, {"body": "So did you not learn about Avax yet? Its the network of networks", "score": 1, "replies": []}, {"body": "Which stocks you buying?", "score": 1, "replies": []}, {"body": "Ima throw up on my foot", "score": 1, "replies": []}, {"body": "What's that thing next to buying power? Kinda looks like this ⚠️", "score": 1, "replies": [{"body": "That’s a margin call for warning. Holding UVXY over the weekend. While it’s a stock, it still acts as an options play because there’s theta and volatility.", "score": 2, "replies": [{"body": "Ok I figured it was something to do with margin.\n\nThanks.", "score": 1, "replies": []}]}]}]}
