{"title": "$TSLA was a flurry of announcements days before earnings", "selftext": "it is interesting that $TSLA in the last few days has announced\n\n1. New AI chip\n2. Robo Taxi Fleet\n3. New Model S/X with longer ranges\n4. Production of Tesla Semi\n\nAlso this happening right before earnings - I think it is to mitigate must worse earnings this quarter\n\nI believe Model S and X sales have fallen off cliff, Model 3 US sales have stalled and Model 3 European role out was way more expensive and less successful than publicly announced\n\nalthough the implied move is very high  Looking to buy puts leading into earnings\n\nany thoughts ?", "id": "bgu8zi", "created_utc": 1556110418.0, "score": 117, "upvote_ratio": 0.94, "num_comments": 49, "comments": [{"body": "This is kinda my take as well. I opened some bear credit spreads. But based on my history with TSLA it’s going to go the exact opposite direction of my position.", "score": 67, "replies": [{"body": "Hope so, my $570 June 2019 calls are not doing so well.", "score": 40, "replies": [{"body": "Damn, that sucks", "score": 8, "replies": [{"body": "I took a big gamble that Q3/Q4 positive earnings would be the start of continued profitability which would lead to a short squeeze, but I was wrong. Oh well.", "score": 3, "replies": [{"body": "Win some, lose some, I suppose. And in any case, you still have a chance...", "score": 2, "replies": []}]}]}, {"body": "Sorry to hear. I just sold a covered call for $290 may 31st.", "score": 3, "replies": [{"body": "you think earnings tonight won't do anything to move the stock up? my guess is the stock probably falls to the $220-240 range before charging back.", "score": 3, "replies": [{"body": "Supposedly about 60% of the time TSLA goes up after an Earnings Report (unverified by some random guy on Reddit). Hope it's the case for you :)", "score": 4, "replies": []}, {"body": "There is no new good news coming out. Tesla and Elon already did an impressive presentation on autonomy day. Plus they also came out with 370 mile model S/X press release. Other than those 2, I don't see anything positive this quarter. Delivery miss has already been baked into the stock. \n\nHaving said that Tesla has not gone below 250 for quite a while. If they reach 250-240 they will be oversold and might bounce back. \n\nThe news I'm looking forward to is the gigafactory in China because that will increase the amount of cars being built drastically without being hit by tariff.", "score": 2, "replies": []}]}]}, {"body": "When did u buy these calls? What was your DD on such a high strike price.", "score": 2, "replies": [{"body": "More a swing for the fences than DD. Back in December.", "score": 1, "replies": [{"body": "Don't blame yourself. Tesla did so well that quarter. Logistics is a big problem. Ity takes them a while getting the cars shipped from California to Europe, Asia. That makes the numbers even worse.", "score": 1, "replies": []}]}, {"body": "He drank too much retard juice one day", "score": 1, "replies": []}]}]}, {"body": "The question is the bad news baked into the stock ?  the stock is near 6 months lows. 250 has been the low end of $TSLA range the past few years .  if we break down from here TSLA could go down to 220", "score": 14, "replies": [{"body": "It all depends upon Model 3 numbers. This car has been touted as the model that will take Tesla mainstream. If there is credible weakness in demand it will pop the bubble that’s been propping up the stock price the last couple year. \n\nThe concept of using excess production as an autonomous fleet of taxis might be a way Musk will try to spin the unsold inventory. The more he talks about that, the more bearish I become. \n\nI really have no idea which way it will go, which is why I did a credit spread instead of straight up puts. Musk can make any market irrational, long live Musk.", "score": 10, "replies": []}]}]}, {"body": "Wouldn’t a strangle be good as well if you expect high volatility?", "score": 15, "replies": [{"body": "Good luck with those premiums.", "score": 18, "replies": []}, {"body": "All that matters is the difference between EXPECTED and REALIZED (post event) volatility.", "score": 2, "replies": []}]}, {"body": "Doesn’t it make anyone suspicious that almost everyone is expecting bad news? I think this might be one of those priced in situations. Expectations are super low, so all TSLA has to do is meet expectations and have good guidance for it to rally imo.", "score": 12, "replies": [{"body": "My thoughts exactly. Only thing that is troubling are a handful of legit banks have price targets of $210-$240.  \n\nThis tells me either we will see a major selloff (20% could happen) which make that price target a reality, or a flurry of short covering scrambles to raise price targets if TSLA somehow impresses on the call (probably +15% in that case). \n\nI don’t know; I had an options position I closed for a total loss of $17 today simply because I didn’t want to bear this risk.  If I had to bet I’d say the news is priced in and if earnings are as expected based on the low guidance, the stock will surprise people by staying flat.  All the near-term volatility of options would get crushed in the process.", "score": 5, "replies": [{"body": "Price targets are bullshit", "score": 3, "replies": [{"body": "Can't say ot often enough!", "score": 1, "replies": []}]}, {"body": "Deleted comment due to reddits API changes. Comment 3560 of 18406", "score": 2, "replies": []}]}, {"body": "Either that or Musk boi wants to buy take it private at $200", "score": 1, "replies": [{"body": "Funding secured?", "score": 1, "replies": []}]}]}, {"body": "I made some money shorting $TSLA earlier in the week. Wouldn’t want an inch of skin directly in the game today. Instead, I added to my $GM position, and took a position in $TM. Both have a tendency to bounce a little when $TSLA reports bad news.\n\nETA:\n\nAt this particular inflection point, I think premiums are too high for most long option strategies, and the after earnings move is too hard to predict (ie. $TSLA is home to some of the least sophisticated/educated investors in the market) to want to fuck with writing options.", "score": 4, "replies": []}, {"body": "I have an iron condor therefore, expect crazy big moves up or down.", "score": 7, "replies": [{"body": "....you mean a strangle? an iron condor is if you don’t expect a stock to move\n\nEdit: damn I’m retarded", "score": 3, "replies": []}]}, {"body": "Dont forget a leaf blower!", "score": 3, "replies": []}, {"body": "And this, ladies and gentlemen, is why selling options is better than buying!", "score": 4, "replies": [{"body": "They do not want $TSLA to break 250", "score": 1, "replies": [{"body": "I'm cool with that. My short puts are below 250. \n\nThis stock is an option sellers best friend right now.", "score": 3, "replies": []}]}]}, {"body": "The news outlets as usual are milking Tesla's 700M loss. it's already pretty bad gonna look worse.", "score": 2, "replies": []}, {"body": "I’ve had puts for a while, so I agree.", "score": 2, "replies": []}, {"body": "Deliveries were reported but total cars sold has nothing to do with delivery shortages and everything to do with logistics, especially since they had to move inventory from TX. Uber and Lyft should be pooping in the pants with their race to autonomy, $TSLA long, Lyft and Uber short.  Even if Uber and Lyft finish autonomous lidar crap, they still need manufacturing.  Are you going to invest in these companies building plant jobs to get their fleet?  Uber/Lyft modern day slavery.\n\nThis is not about a single quarter of financials, it never was", "score": 6, "replies": []}, {"body": "And you forgot the most important news... Elon might be working with PornHub soon.", "score": 2, "replies": [{"body": "Wut?", "score": 1, "replies": []}]}, {"body": "I short a call spread (285/282.5), long two put spreads (275/272.5 and 260/257.5) for Friday. I'm also short a 270/240 strangle for 5/10/19.", "score": 1, "replies": [{"body": "I found the Vega for June options was double the May options. Wouldn’t a June strangle therefore provide a greater IV crush?", "score": 1, "replies": [{"body": "Tesla is always likely to always have high IV. June is to far out for me to tie up capital right now. \n\nMost of the IV \"crush\" will happen on options expiring this week and maybe next. Also all depends on how much TSLA moves", "score": 1, "replies": [{"body": "My plan was to buy back my June strangle tomorrow (which I bought today). I guess we’ll see how much the value actually went down due to IV crush, I thought it would be nearly as much as this week expiration.", "score": 1, "replies": [{"body": "Closed the 260/257.5 spread for 25 dollar profit (not worth the risk to hold open)\n\nHaving a closing order out for 50% profit on the short strangle (~$800).\n\nEdit: closed 275/272.5 spread for $123 profit (basically max profit)\n\nSold a 240 put this morning for $825 and bought it back 7 minutes later for $615.", "score": 1, "replies": []}]}]}]}]}, {"body": "I would buy puts if TSLA closes below $252 support. Before that no way.", "score": 1, "replies": []}, {"body": "$TSLAQ folks a little muted after hours.", "score": 1, "replies": []}, {"body": "\nSold a strangle 290 C / 245 P to hedge a covered call @ 300 and a stock position acquired at 292.50. The Vega is .40-.50 for June NTM. Looks like it flat lined after market. Hopefully pre market is flat and I’ll collect that juicy .20 IV crush.", "score": 1, "replies": []}, {"body": "This stock is a cesspool of trouble", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Non Google Amp link 1: [here](https://www.cnbc.com/2019/04/24/tesla-should-be-valued-at-less-than-100-a-share-investor-says.html) \n \n\n \n --- \n \n^^I ^^am ^^a ^^bot.  ^^Please ^^send ^^me ^^a ^^message ^^if ^^I ^^am ^^acting ^^up.  ^^Click ^^[here](https://medium.com/@danbuben/why-amp-is-bad-for-your-site-and-for-the-web-e4d060a4ff31) ^^to ^^read ^^more ^^about ^^why ^^this ^^bot ^^exists.", "score": 2, "replies": []}, {"body": "Lol one morons opinion", "score": 2, "replies": []}, {"body": "This google amp thing is going to squeeze news media hard.", "score": 2, "replies": []}]}]}
{"title": "Boeing pulls 2019 guidance, pauses share buybacks due to 737 Max uncertainty", "selftext": "https://www.cnbc.com/2019/04/24/boeing-earnings-q1-2019.html\n\nBoeing announced it was withdrawing its full year 2019 financial forecast while Boeing works through issues surrounding its 737 Max aircraft.\n\nThe company has completed over 135 test and production flights of updated software for the 737 Max.\n\nThe FAA, as well as regulators around the world, grounded the airplane in mid-March after the second deadly crash in the past year.\n\nEPS: $3.16 a share vs. $3.16 a share expected according to Refinitiv.\n\nRevenue: $22.92 billion vs. $22.98 billion expected according to Refinitiv.", "id": "bgtovd", "created_utc": 1556106938.0, "score": 211, "upvote_ratio": 0.95, "num_comments": 56, "comments": [{"body": "Pulls guidance\n\nStops buybacks\n\nMisses on earnings\n\nStock goes up? wut.", "score": 97, "replies": [{"body": "A worse result was already priced in", "score": 60, "replies": []}, {"body": "Priced in.\n\nPriced in.\n\nPriced in.\n\nBetter than what was priced in.", "score": 32, "replies": [{"body": "Bullshit! Down 10% is the priced in mark for this kind of news!? They pulled their entire guidance.! F wall street!\nAnd it's still trading higher than it did for the entirety of 2018. How the hell can ppl say it's priced in if we no longer even know what the hell to expect for the rest of the year? This is wall street hypocrisy at it's finest. Tesla would be under $200 a share if they pulled their guidance for the rest of the year on negative news.", "score": 23, "replies": [{"body": "Tesla doesn't have over $2B in FCF in a terrible quarter.  Did you even look at the income statement?  It wasn't bad.  \n\nThey didn't provide guidance because the Max situation is largely in the FAAs hands.  They could fly next week or six months from now.  It would be stupid an irresponsible to issue a forecast you can't control.", "score": 22, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Using Tesla was a bad example, I'll give you that. \n\nThis government would absolutely let Boeing fail, most of them wanted to let the automakers fail. \n\nAt the end of the day what they provided to investors today and what the previous comments reiterated is uncertainty. Uncertainty about the 737, profits, timelines, orders, all of it, and that should send the stock down 3-5% to recent lows. It's so bad their not even buying their OWN stock anymore. What more could they possibly say that would warrant a negative day in the market today? Sure they met revised estimates, but that still doesn't tell you anything about next quarter or the rest of the year. \n\nLook, I'm not saying they are worthless or that there should be a stampede to the exit, but it's illogical to me that people would be buying BA at this price with all this uncertainty.", "score": -6, "replies": [{"body": "> This government would absolutely let Boeing fail, most of them wanted to let the automakers fail.\n\nBoeing is a critical defense contractor, the US would not let it just go out of business. This is just a ridiculous topic to talk about.", "score": 9, "replies": [{"body": "It’s kinda sad since 2008 we can confidently confirm some public companies are safe from Chapter 7. Just doesn’t feel like a true capitalism economy anymore.", "score": -1, "replies": [{"body": "I mean, I am so ignorant on this topic I shouldn’t even comment, but just thinking about it for a second, I think it’s actually pretty fair. Say Boeing just makes mistake after mistake and crumbles into the earth on some of their revenue lines. Defence will always be there as a revenue source and I can only imagine the massive pain in the ass it would be for the government/company/banks(?) to liquidate those assets and basically open it under a new company which would be Boeing 2.0 let’s be real. Even if it all went to hell, I can imagine the Boeing that would be saved would look a lot different that it is today and would lose the majority of the revenue streams and just keep the essential ones intact. Actually, if they were completely dissolved, how do patents work? Do they go away?", "score": 1, "replies": [{"body": "Patents can/would be sold to the highest bidder. In a efficient economy, new and old competition would arise to take the market Boeing is losing. These companies would get the defense contracts if they earned them. \n\nIt would take a lot for Boeing to go to hell, my main point is that Executive Management knows the US Gov won’t let them fail, so they can take more risks if they want.", "score": 1, "replies": [{"body": "Thanks for the response. I don’t know the market share of Boeing and too lazy for a 5 second google, but I can imagine that the 3,4,5th runner up competition could not afford the bid war that would ensue? Would that not be a prime transition into a major monopoly?", "score": 1, "replies": []}]}]}, {"body": "They're safe from bankruptcy because they make billions of dollars a quarter, have tons in the bank, have access to giant amounts of credit, have an order book going out years in the future and are the sole supplier of many critical products to the entity that prints US Dollars. It's not a bailout situation.", "score": 1, "replies": [{"body": "That’s not what we’re talking about though. Your reasoning is solid and based on the company itself. What I’m saying, and others here are saying, is that Boeing could fuck up to an enormous degree (think banks in 08) and the government wouldn’t let it fail. That’s the consensus at least. \n\nTo me this gives companies too much leeway in risk management. If they know the government will be there to pick them up, they can be as risky as they want. I’m not saying this is Boeing’s attitude, but it could be.", "score": -1, "replies": []}]}]}]}, {"body": "I don't think the government would let Boeing fail, especially since it employs so many Americans.", "score": 4, "replies": []}, {"body": "There are many automakers, theres only one boeing, I know this sounds dumb but they are literally one of two companies in the world that can mass produce civilian aircraft. Also im fairly certain boeing is the largest defense contractor for the us government, automakers dont even have remotely the same level of economic width or individual value to the government.", "score": 6, "replies": []}]}]}]}, {"body": "Someone lost money", "score": 6, "replies": []}, {"body": "stop expecting the market to act rationally and logically.", "score": 2, "replies": []}, {"body": "I hope you saw the TSLA ER 320% miss and how the stock held. Again, priced in.", "score": 1, "replies": []}]}]}, {"body": "i mean its only up 1%. Thats just random noise", "score": 6, "replies": []}, {"body": "I guess when there is a duopoly bad news just means it’s time to buy becuase unless one company is completly going down in flames for good there is nowhere to go but up.", "score": 1, "replies": []}, {"body": "No way it was priced in. BA has been going up ever since the big drop after the crash. The decline after the accident was an emotional reaction with little news. After that the news gets worse and worse and yet it keeps clawing back up.", "score": 1, "replies": []}]}, {"body": "Them losing just $1billion. My expectation  were upward of 10 billion.  Surprising!", "score": 37, "replies": [{"body": "not done yet", "score": 18, "replies": [{"body": "Some murmurs about the 787 production facility in SC started to drop yesterday, I don’t think there’s any issue with the planes but it seems whistleblowers were reporting poor quality on the production line for some time.", "score": 13, "replies": [{"body": "If you've ever worked in manufacturing, you'll know that there are always disgruntled employees who do one of three things: call anonymous lines to report harassment that isn't harassment; complain they aren't paid enough; claim unsafe conditions or poor quality production lines.", "score": 9, "replies": [{"body": "Probably true, again the reports were things like “tubes of sealant were left on finished planes, tools were left after production”. So the complaint was that production was rushed to get planes out quickly. \n\nI think it’s fine, but this could add to the PR mess. And PR can get out of hand these days.", "score": 3, "replies": [{"body": "This came from the Charleston SC plant where the 781 is assembled. It came out years ago about these complaints and I bet they are overblown and coming back up again due to the recent news about the KC-tankers having items left in the aircraft during delivery and acceptance phases.", "score": 2, "replies": []}, {"body": "From [this NYT article](https://www.nytimes.com/2019/04/20/business/boeing-dreamliner-production-problems.html)\n\n*“I’ve found tubes of sealant, nuts, stuff from the build process,” said Rich Mester, a former technician who reviewed planes before delivery. Mr. Mester was fired, and a claim was filed on his behalf with the National Labor Relations Board over his termination. “They’re supposed to have been inspected for this stuff, and it still makes it out to us.”\n**Employees have found a ladder and a string of lights left inside the tails of planes, near the gears of the horizontal stabilizer**. “It could have locked up the gears,” Mr. Mester said.*", "score": 1, "replies": [{"body": "And that sounds bad, but at the end of the day this inspectors job was to find those issues and he did. It’s not like the planes reached an airport ready for passengers with these flaws, they were caught by the inspection process Boeing established. \n\nSure they should’ve been caught a step or 2 sooner, but ultimately they were caught before leaving the facility.", "score": 2, "replies": []}]}]}]}, {"body": "This mornings episode of the NYT The Daily podcast featured one of the whistle blowers. If it’s true (and even if it’s not), it doesn’t look good for the company that this information is coming out...", "score": 1, "replies": []}]}]}]}, {"body": "Keep in mind 1 billion is 1% of their 100 billion in revenue last year", "score": 6, "replies": []}, {"body": "Good, this is what happens when you value $ over safety concerns.", "score": 11, "replies": [{"body": "What happens? The stock price goes sideways? Corporations will always care more about money then safety. It's literally their job to make a profit! People don't give an f about other people and people running billion dollar companies care even less.", "score": 9, "replies": []}]}, {"body": "Makes sense. Didn’t lose as much as Wall Street expected. News media hyped it all on Boeing when the final report isn’t even out yet. Planes will be back flying in a month or so. \n\nGood for Boeing. Kinda of tired of everyone blaming it on Boeing when there’s always a chain of events that led up to the crash. The public has no idea how to let an investigation run its course before trying to form their own opinions and play the blame game.", "score": 6, "replies": [{"body": "Agreed! People blame manufacturers too often. I do think the 737 crashes could possibly be attributed to Boeing, but look at there brand as a whole. It is phenomenal!", "score": -8, "replies": [{"body": "\"could possibly be attributed\"?  There is no doubt this is Boeing's fault.  Zero.", "score": 10, "replies": [{"body": "Have the investigations concluded yet? They have said it is a problem with the flight computer, however until the investigation concludes I do not think you can blame Boeing. And also, why did this not happen on every flight?", "score": -2, "replies": [{"body": "Because sensors don't malfunction on every flight?  And on other planes, there's not MCAS forcing the plane to a different angle of attack that the pilots can't override?\n\nMCAS was necessary because the Max is a fundamentally different plane with the oversized engines mounted too far forward on an existing 737 fuselage.  Boeing did this because they wanted to get the plane cleared for sale as a 737, not a new design.  Further, they claimed that because it was a 737, all pilots cleared for flying a 737 are certified for the Max without the necessity of retraining.", "score": 5, "replies": []}]}, {"body": "https://m.youtube.com/watch?v=HBqDcUqJ5_Q&feature=youtu.be&utm_source=share&utm_medium=ios_app\n\nIf you have the time check out this video. Really helps put things into perspective instead of just reading a news media’s biased article written by journalists who have no aviation experience. Really good video and I’m also devastated by the loss of life. No crash is ever a good crash, but there’s always a chain of events that leads up to a crash and there is zero doubt in my mind that the MCAS system was one of those chain of events.", "score": -2, "replies": [{"body": "Not sure what I'm supposed to take away from this. There's a malfunctioning AoA sensor as a SPOF and no ability for untrained pilots (untrained because Boeing pushed the Max as equivalent to all the other 737s, thus pilots didn't need special training) to circumvent MCAS.  That's all on Boeing.", "score": 2, "replies": []}, {"body": "I don't even pay attention to mainstream media.  As a software engineer, I can tell you that the SPOF (single point of failure) in MCAS is an enormous design flaw in a system that will kill people when a sensor or an input fails.\n\nhttps://www.google.com/amp/s/moneymaven.io/mishtalk/api/amp/mishtalk/economics/boeing-737-max-unsafe-to-fly-new-scathing-report-by-pilot-and-software-designer-ed5jwi2s8kCuGTAgFXR0GA/", "score": 3, "replies": [{"body": "Thanks for the link. I’ll definitely read it.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This stock has disappointed all greedy bastards here. I fully expected it to go down to 360 or even less, and now we get these news and it goes up? lol", "score": 2, "replies": []}, {"body": ">The company has completed over 135 test and production flights of updated software for the 737 Max.\n\n\nBoeing is being dumb here. Why are they still using a software patch to fix a fundamental issue with the aerodynamics of this aircraft? Boeing is literally willingly putting people's lives at risk. I will never fly a 737 Max even if they can prove they have been able to \"fix the issue\". I write software and I know how god damn buggy it can be even after you've done your full SDLC due diligence. \n\nEdit: Not sure why I got downvoted. You guys do know that Boeing jimmy-rigged this aircraft using software to counter-balance its inherent flaws just to get it out and into production for competition sake, right?", "score": 3, "replies": [{"body": "> Boeing is being dumb here. Why are they still using a software patch to fix a fundamental issue with the aerodynamics of this aircraft?\n\nThe planes already exist. You can't change the airframe of an existing airplane and expect it to be safe.", "score": 3, "replies": [{"body": "They should own their mistake and scrap them. That's the right thing to do. But I don't expect most people on this sub to agree with that sentiment.", "score": -2, "replies": [{"body": "Why? They're still functional airplanes with a software bug. You're talking about a multi-billion dollar waste.", "score": 3, "replies": []}]}]}, {"body": "The plane isn't unstable, the software just makes it behave more like the original 737 so the pilots don't have to be retrained to operate the max 8.", "score": 2, "replies": []}, {"body": "Have to agree, I'd rather fly on a safe plane than a unsafe plane held together by software.", "score": 0, "replies": [{"body": "Boy are you in for a surprise when you learn how Airbus' fly-by-wire system works", "score": 9, "replies": [{"body": "I don't care how the plane is controlled, it could be completely autonomous but the flight dynamics of commercial aircrafts should always have positive longitudinal stability. After any input the plane should revert to back to it's original speed and orientation, doesn't matter if the input is done by a human or computer but the plane should be inherently stable. This just depends on the centre of gravity and the aerodynamic centre of the aircraft, they fucked it up with adding a larger engine so in certain situation the plane becomes unstable and has to corrected by a computer.", "score": 3, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "What about this article on boeing.com? \n\nhttps://www.boeing.com/commercial/aeromagazine/aero_02/textonly/fo01txt.html\n\n>Figure 1 is a plot of speed stability, which is the manner in which static longitudinal stability is demonstrated in flight. It measures the relationship between airspeed and longitudinal control force. Simply stated, speed stability is a measure of the control force required to hold the airplane at an airspeed other than the trimmed airspeed, with the throttles fixed at the trimmed thrust setting. Airplanes with positive static longitudinal stability require a pull force to maintain a speed below the trimmed speed, and a push force to maintain a speed above the trimmed speed. For conventional airplanes (those without stability augmentation), this is a design requirement of the U.S. Federal Aviation Administration Regulations (FAR) Part 25. However, in an unstable airplane--one with negative static longitudinal stability--if the airplane is in trim and the flight crew applies a pull force, the airplane will initially pitch up and slow down, but the pitch rate will quickly become large enough to require a relaxing of the pull, and eventually a push force, to maintain a constant speed below the initial trim speed. The converse is true when the flight crew attempts to accelerate the airplane from the trimmed state. This difficult task can be accomplished without increasing the crew's workload by using electronic flight control computers for stability augmentation.\n\nThis is how most planes work, unstable aircrafts is something usually only used in military fighter jets. Like on the JAS 39 Gripen \n\nhttps://saabaircraftindustry.com/en/roads-to-new-capability/development-skills/technical-capability-development-for-control-systems/\n\n>In a modern statically unstable aircraft, the lift of the wing acts forward of the aircraft’s centre of gravity; a statically unstable aircraft has no natural restoring aerodynamic pitching moment, i.e. no inherent stability. The lift of the wing must be continuously parried by the flight control system. The forces on the control surfaces acts in the same direction as the lift of the wing to create a parrying counter-moment. These forces are combined into the total lift acting on the aircraft, which means that the wing of a modern statically unstable aircraft can be made much smaller which provides less drag. This enables the energy to be better preserved.\n\nI don't want to fly on these planes where disturbance get doubled in amplitude every 0.4 seconds without a stabilising autopilot. It's a commercial airplane, it doesn't need to do quick turns and be super responsive, just make it stay in the sky.", "score": 4, "replies": []}]}]}]}]}]}, {"body": "Anyone considering Boeing should hear the The New York Times podcast about their manufacture mal-practices.  I can't justify myself buying this stock as this company is borderline murderers with no sense of guilt.", "score": -5, "replies": [{"body": "Boeing engineers probably know more about airplanes than the NYT", "score": 8, "replies": [{"body": "The podcast is interviewing a former Boeing Engineer though.", "score": -1, "replies": [{"body": "...and you don't think that he might be a bit disgruntled or possibly biased against his former employer?", "score": 5, "replies": []}]}]}]}]}
{"title": "Ford invests $500 million in electric pickup startup Rivian, will make an EV together", "selftext": " [https://electrek.co/2019/04/24/ford-invests-rivian-electric-pickup-truck/](https://electrek.co/2019/04/24/ford-invests-rivian-electric-pickup-truck/) \n\nEVs are definitely coming. Long $TSLA", "id": "bgw2pk", "created_utc": 1556120174.0, "score": 54, "upvote_ratio": 0.96, "num_comments": 53, "comments": [{"body": "Long tesla indeed, neither ford or rivian have a battery factory that produces more then half of the worlds lithium ion battery output, but tesla does", "score": 65, "replies": [{"body": "Tesla could become the main manufacturer of batteries for these companies then car sales would not matter as much", "score": 23, "replies": [{"body": "That’s their plan.  Elon has even called Tesla an energy company before.", "score": 10, "replies": []}, {"body": "except its actually Panasonic that manufacturers the cells", "score": 2, "replies": [{"body": "Long Panasonic then", "score": 2, "replies": []}]}, {"body": "More competition means more infrastructure for EVs which will would in the end help tesla.", "score": 0, "replies": []}]}, {"body": "Do any of these companies have developments with graphene batteries?  I understand the Samsung 10 uses one, but any on a grandeur scale?", "score": 7, "replies": [{"body": "Those developments will come from Samsung, they are leading the development on the manufacturing and chemistry fronts.", "score": 1, "replies": []}, {"body": "I'm pretty sure graphene is still a meme.", "score": 1, "replies": []}, {"body": "Graphemes might be able to increase cell voltage and long term performance of a battery but it’s not a miracle material. It won’t produce high energy density batteries.", "score": 1, "replies": []}, {"body": "I still haven't heard of anyone being able to mass produce graphene. Lots of stuff I read say graphene is problematic in terms of being mass produced and becoming marketable. I also heard there's other materials that can compete with graphene, but they suffer from the same problems and are less known to the masses.", "score": 0, "replies": []}]}, {"body": "Oh please you know ford or gm could do this in a few months if they wanted to. Just cheaper and smarter to buy them, at this point anyways.\n\nSo many butthurt fanboys. Elon doesn’t care about you. Tesla is fundamentally a poor company.", "score": -9, "replies": [{"body": "No. They couldn’t. The retooling alone lol. Few months. Dude. No. Just no.", "score": 5, "replies": [{"body": "They could easily retrofit one of the factories they just put on standby. The key is there has to be money in it. Right now there isn’t.", "score": -5, "replies": [{"body": "I understand your second point. However. I have family members in the automotive industry. It’s not that easy. Supply chain. Training. Operations. Like no. It’s not that easy to retrofit. Especially on a F/GM scale.", "score": 7, "replies": [{"body": "Maybe a few months is not realistic, but they could do it in a year. Hell Ford and GM converted in WWII and made more tanks in 2 years that the world in several years. I know batteries are completely different, but my point remains.", "score": -4, "replies": [{"body": "A year. Yes. WWII is different than making a car today. Robots. Suppliers. Etc.\n\n-\nMaking batteries isn’t making tanks but you are still thinking about the “production line”  but it’s more.", "score": 2, "replies": []}]}]}]}]}, {"body": "truly the most naive thing i've read on the internet all week", "score": 2, "replies": [{"body": "You’re not browsing very much then. Implying a car manufacturer could make a battery factory isn’t exactly a moon shot statement. Nor is it naive.", "score": 0, "replies": [{"body": "ur saying i should lurk moar is the difference between ford and elongate muskrat", "score": 0, "replies": [{"body": "What?", "score": 2, "replies": [{"body": "I don’t agree with your comments but I also don’t know what the fuck he means either.", "score": 1, "replies": []}, {"body": "you shud brows moar\n\n.", "score": 0, "replies": [{"body": "I’m not saying browse more here. I’m just saying if it’s the most naive thing you’ve read on the internet today that’s probably not true. It’s not naive to think a global car manufacturer couldn’t make a battery factory.", "score": 1, "replies": [{"body": "they didn't and still haven't and you grossly underestimate the amount of engineering required to basically invent, test, and scale a technology that has very little to do with traditional combustion engines. with your logic, why doesn't any fucking company with a $1B valuation and some engineers just go compete with tsla? Why can't mercadez-benz compete even after spending years and years trying just to replicate?\n\nthe amount of ignorance in your statement is astounding, even assuming you have absolutely zero engineering background (which I think is accurate, or correct me. or leave me alone).", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I'm pretty sure Tesla buys Panasonic batteries..you can find them on ebay, sold by junk yards\n\nAdd:  Come to think of it..since batteries dont really get destroyed in accidents and sell for alot...junk yards might be the real winners in EV", "score": -1, "replies": [{"body": "Yeahhh that's a pretty gnarly misrepresentation of Panasonic / TSLA's cell manufacturing agreement.", "score": 3, "replies": []}]}, {"body": "Rivian is level 3 autonomy only. This isn’t a competitor.", "score": 0, "replies": []}]}, {"body": "Don't bet against Jim Hackett. Bottom line is the guy wins.", "score": 7, "replies": []}, {"body": "I bought 2 Ford calls for 10c and this shit actually went up lol", "score": 5, "replies": []}, {"body": "Long Ford. Slept on stock with good dividend", "score": 17, "replies": [{"body": "Hahahahahah no way I travel the world u dont see any ford trucks or cars much", "score": -10, "replies": [{"body": "Ford F-150 has been the highest volume selling truck for years", "score": 17, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "I said Ford F-150 which is one model. Two makes combining 2 models would not make sense to compare to one make one model. Rams just passed them anyway", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "6-7% dividend is weak? Oh r/wsb", "score": 6, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "They’re retooling multiple factories, and have never declared bankruptcy.  Along with maintaining the dividend since 2015", "score": 6, "replies": [{"body": "Agreed, the company is turning around, they cut their sedans off to maximize profits. I dont see how this company isnt worth more.", "score": 3, "replies": [{"body": "Find out tomorrow right?", "score": 1, "replies": [{"body": "Yup, got 240 shares", "score": 1, "replies": [{"body": "120 and still have 6x 9.5c left", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Maybe you should take a marketing class then. \n\nLmao nvm you need to take a lot of basic business classes after your 2nd paragraph", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Only thing that’s resting are deez nuts in your mommas mouth", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Lots of dumb people, I'm one of them. Why did I buy that piece of shit.... Better off investing in SNAP.", "score": -1, "replies": [{"body": "Yikes lol you need to spend more time researching companies instead of researching common wsb sayings", "score": 2, "replies": [{"body": "At least I don't drive a ford.... Ahh fuck I do don't I, just shoot me now.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Lol $TSLA is light years ahead of every other car other company in terms of electric vehicles!!!\n\nLONG $TSLA", "score": 9, "replies": [{"body": ">other car other company\n\nindeed", "score": 5, "replies": []}]}, {"body": "Is it coincidence that they announce this the day of TSLA earnings?", "score": 2, "replies": []}, {"body": "If you close one eye and look at the right angle Ford is Nio", "score": 2, "replies": [{"body": "A cardboard box with a d battery?", "score": 3, "replies": []}]}, {"body": "ford made an electric ranger a while back. i can see the new ranger with rivian electric drive train as a possibility.", "score": 2, "replies": []}, {"body": "Too bad it’s ugly as shit for 69k.", "score": 2, "replies": []}, {"body": "LONG TESLA there pickup truck will rape this rivian bs.", "score": 1, "replies": []}]}
{"title": "Why hasn’t the value of my call option for Microsoft, Facebook, and PayPal increased since earnings?", "selftext": "", "id": "bh00a5", "created_utc": 1556139979.0, "score": 0, "upvote_ratio": 0.24, "num_comments": 47, "comments": [{"body": "Bruh, option prices don’t move after hours or premarket you clown", "score": 79, "replies": []}, {"body": "why are you the way you are?", "score": 42, "replies": [{"body": "Extra chromosome", "score": 17, "replies": [{"body": "At least you're honest.", "score": 14, "replies": [{"body": "I seems like you have one too", "score": -29, "replies": []}]}]}]}, {"body": "[deleted]", "score": 25, "replies": []}, {"body": "Do you tell people in your social circle that you actively manage a portfolio? Haha", "score": 21, "replies": [{"body": "That's what I tell the police when they try to l'escorte me from the livrary.", "score": 5, "replies": []}, {"body": "I actually keep it on the down low", "score": -1, "replies": [{"body": "Your portfolio?", "score": 4, "replies": [{"body": "His homosexuality", "score": 11, "replies": []}]}, {"body": "Were you born in 2000?", "score": 1, "replies": [{"body": "That’s my chromosome count", "score": -4, "replies": [{"body": "So you’re saying you’re dead.", "score": 2, "replies": [{"body": "No", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Market is closed due to AIDS contamination.", "score": 11, "replies": [{"body": "Fuck man that sounds serious", "score": 3, "replies": [{"body": "It's real fucking bad man! They may have to close markets globally, in a rotating basis to clean it out.", "score": 3, "replies": [{"body": "Don’t look at stock prices for a month or you’ll catch it too!", "score": 1, "replies": []}]}]}]}, {"body": "Sticky this, mods.", "score": 11, "replies": []}, {"body": "are you -13", "score": 9, "replies": []}, {"body": "Can’t buy or sell options when market is closed so price doesn’t change", "score": 7, "replies": []}, {"body": "So you bought deep OTM calls didn't ya?", "score": 6, "replies": [{"body": "Microsoft one is 4/26 the other 2 are at the end of May", "score": -5, "replies": [{"body": "Right, don’t tell strike prices to anyone, it’s been humiliating for you enough.", "score": 21, "replies": []}, {"body": "4/26 is the date idiot", "score": 1, "replies": []}]}]}, {"body": "Market closed", "score": 5, "replies": []}, {"body": "Never go full retard nephew 🤦‍♂️", "score": 5, "replies": [{"body": "How else would I get those tendies", "score": 1, "replies": []}]}, {"body": "Robinhood is glitching!!! Won’t show me my increased tendies!!", "score": 4, "replies": []}, {"body": "Ban", "score": 4, "replies": []}, {"body": "The market shut down. Your account has been closed. Unlucky.", "score": 3, "replies": [{"body": "*they just TURNED OFF the internet!*", "score": 2, "replies": []}]}, {"body": "bc you are dumb", "score": 3, "replies": []}, {"body": "because you touch yourself at nights", "score": 3, "replies": []}, {"body": "Never go full retard nephew 🤦‍♂️", "score": 2, "replies": []}, {"body": "DELETE THIS NOW", "score": 1, "replies": []}, {"body": "W h y d i d y o u b u y o p t i o n s b r u h?", "score": 1, "replies": []}, {"body": "How much are my 5/10 202.5 FB calls worth at fb current price? Paid 1.04 per contact", "score": 1, "replies": []}, {"body": "stop trading and start studying.....nobody told me that...\n\nNow I just .....literally can't go tits up!", "score": 1, "replies": []}, {"body": "the amount of people who dont understand options is too damn high!", "score": 1, "replies": [{"body": "Chill, what were you doing at 18 other than masterbating", "score": 1, "replies": []}]}, {"body": "Wtf is this shit?", "score": 1, "replies": []}, {"body": "XXX OR XXY?", "score": 1, "replies": [{"body": "It depends on the day", "score": 1, "replies": []}]}, {"body": "Wew lad", "score": 1, "replies": []}, {"body": "Causes i burned that shit down with my options", "score": -1, "replies": []}]}
{"title": "TSLA Earnings", "selftext": "[removed]", "id": "bh0g2l", "created_utc": 1556142276.0, "score": 15, "upvote_ratio": 0.86, "num_comments": 52, "comments": [{"body": "Because that makes sense.\n\nLose way more money that anyone expected - stock price goes up.", "score": 16, "replies": [{"body": "* **Adjusted loss per share:** $2.90 versus $1.30 expected.\n* **Revenue:** $4.54 billion versus $4.84 billion expected.", "score": 4, "replies": [{"body": "So they lost more than double what was expected. \n\nAnd the stock is up.\n\nWhat the fuck is this bizarro world.", "score": 7, "replies": [{"body": "It Tesla. Everyone knows logic does not apply to this ticker.\n\nAlso, bad earnings priced in. $380 to $260. It's taken a beating. You need investors to pull out at this low level? Doubtful. Cult like investor group.", "score": 9, "replies": [{"body": "looks like logic does apply lol", "score": 1, "replies": [{"body": "It's a miracle.", "score": 1, "replies": [{"body": "what are your plays?", "score": 1, "replies": [{"body": "Popcorn. It's a falling knife. To volatile to play unless u wanna do shares. Premiums still retarded ... If it hits $200 I'll buy some long dates calls lol.", "score": 1, "replies": [{"body": "no i mean shares in general or any commodity, not just tesla", "score": 1, "replies": [{"body": "Waiting. I don't like buying at these levels. \n\nOil dip looks interesting might enter some UWT. AMD held strong from Intel and nvda tanking...tempted to play ER calls since server business from all companies like amzn, msft, etc all reported great business growth so they should be spending strong money for capex in server hardware....but AMD GPUs probably hurting for now..\n\nAlso waiting on Disney to freaking pullback ...so tempted to fomo here but I'll be patient. \n\nEntered ATVI at $45 earlier in the week...feel like bottom is in and even a mediocre ER will send it to $50 next week.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Guidance is looking good for the rest of the year.", "score": 5, "replies": [{"body": "Idiots are still believing what Tesla says?", "score": 4, "replies": [{"body": "They have the best cars that exist, so yeah, even if it takes a bit longer, they deliver.", "score": -1, "replies": [{"body": ">They have the best cars that exist\n\nLol", "score": 6, "replies": [{"body": "What other car can you buy that just drives itself? And has these stats?", "score": -1, "replies": [{"body": "Cadillac CT6 has supercruise and a much nicer interior and sound system than a Tesla Model S. It also has a magnetic suspension which allows for amazing handling. \n\nSo, I am going to have to ask, what stats? Sure, electric motors allow you to put up nice zero to 60 times because of all the low end torque, but that torque curve will come back to bite you in the ass on your highway pulls or your 1/4 mile.\n\nTesla's are fine vehicles, but the best vehicles in the world. That is so blatantly untrue it is laughable, which is why I lol'ed.\n\nP.S. I am not saying that a Cadillac CT6 is the best vehicle in the world either but you asked for a vehicle with a similar function to Tesla's AP being soldto consumers and Cadillac's supercruise was the first system that came to mind.", "score": 1, "replies": [{"body": "But can the cadi keep a baby alive in a rollover?", "score": 2, "replies": []}, {"body": "Lol. I'll take a Tesla over a Cadillac.", "score": 0, "replies": [{"body": "I'd take the 2019 CTS-V over anything Tesla has to offer but to each their own.\n\nhttps://www.cadillac.com/v-series/cts-v-sedan", "score": 1, "replies": [{"body": "https://www.google.com/amp/gmauthority.com/blog/gm/cadillac/cts/cadillac-cts-sales-numbers/amp/ \n\n\n....looks like you might need to jump on it quick then before they discontinue them lol", "score": 1, "replies": [{"body": "Non Google Amp link 1: [here](http://gmauthority.com/blog/gm/cadillac/cts/cadillac-cts-sales-numbers/) \n \n\n \n --- \n \n^^I ^^am ^^a ^^bot.  ^^Please ^^send ^^me ^^a ^^message ^^if ^^I ^^am ^^acting ^^up.  ^^Click ^^[here](https://medium.com/@danbuben/why-amp-is-bad-for-your-site-and-for-the-web-e4d060a4ff31) ^^to ^^read ^^more ^^about ^^why ^^this ^^bot ^^exists.", "score": 1, "replies": []}, {"body": "Well I’ll be sure to do that. I’ll be able to buy a Cadillac and get parts for it in 10+ years. Can’t exactly say the same for Tesla.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Dude. Have you actually looked at Tesla’s books? They have debt up to their fucking tits. They’re debt leveraged to the moon.\n\nPeople would have said the same thing about GolfSmith 7 years ago that you’re saying now. Every single location was making money. They were a profitable company. Except for the fact they were debt leveraged to the fucking moon. They were so debt leveraged, in fact, that they had to declare bankruptcy despite the fact that every single store was raking in cash.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "RH account? Yeah.\n\nPoor? Lol no.\n\nAlso sweet ad hominem bro.\n\nAt least I have wins to post. You’re really killing it with your 6 year old account and zero tendies worth posting.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "RH is just the platform you idiot. You think I do my DD through there? It’s what I use because it’s 0% fees on everything. \n\nRobinhood is far from the only thing I use lol. RH is just a cog in the machine.\n\nAlso, again, sweet ad hominem. You didn’t address a single thing I said about Tesla so you obviously have never even looked at a 10k or a balance sheet.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "How heavy is that bag?\n\nArms getting tired yet?\n\n$370+ to $258. Must be getting tiring at this point. \n\nDo you $TSLA stans not see the shit Tesla does? Tesla out of the blue announces a “self driving summit” and hosts it 1 day before earnings in a fucking Raddison conference room to 20-30 automotive journalists spouting off about the future. They did this 1 day before an earnings report where they post -$2.9EPS when guidance was freaking -$1.30 EPS. \n\nThe “self driving summit” was nothing but a bullshit attempt to pump the company a day before they announced they royally fucked up their quarter, but you bag holders are too stupid to see it. You’re too daft to make a cognitive connection between the fact that $TSLA blew smoke out their ass and made monumental claims 1 day before they announced they royally fucked the quarter. You can’t even see the fact that the ass smoke blowing was in direct relation to the fact they knew their EPS was dog shit. You can’t see the fact that that stupid ass conference in the basement of the local holiday inn express was just an attempt to get market investors to feel confident and to temper reaction to their dog shit quarter.\n\nFucking $TSLA Stans, I swear...\n\nIf you can’t see this stuff logically and separate emotion from finance, you’ll never be able to afford a Tesla as it is. Go buy a fucking Mitsubishi, cause lord knows that’s about all you’ll ever be able to afford if you keep thinking the way you do.", "score": 0, "replies": [{"body": "I've had much heavier bags and they're all green at this point.  Honestly you kinda seem like the emotional type.\n\nIt's really your right not to believe in Tesla. I'm fine with that.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Inverse the earnings call, duh", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I’m with you. Let’s hope we don’t get rammed tomorrow!", "score": 3, "replies": []}, {"body": "Yeeeeep. Boner soup brother.", "score": 1, "replies": []}]}, {"body": "TSLA is the Donald Trump of stocks. It's should be gone and disgraced by every precedent set before, but still it survives and thrives", "score": 9, "replies": [{"body": "GYNA", "score": 2, "replies": []}, {"body": "so.. an outlier?", "score": 1, "replies": []}, {"body": "Fake news", "score": 1, "replies": []}]}, {"body": "Why is this stock not ridiculously down after hours? \nA) lower revenues than expected\nB) lost even more money than expected\n\nIgnoring the BS about forecasts,,, what is keeping this stock stable at the minute? What am I missing?\n\n(Yes I bought puts)", "score": 7, "replies": [{"body": "Your puts are single-handedly keeping the stock up.", "score": 10, "replies": [{"body": "As a true autist, I don’t understand your joke", "score": 1, "replies": [{"body": "You're overthinking it.", "score": 7, "replies": [{"body": "This is WSB, nobody think around here.", "score": 2, "replies": []}]}]}]}, {"body": "If wallstreetbets thinks it should go down, it will do anything but that", "score": 3, "replies": []}, {"body": "maybe it goes down a bit at market open. Banks set a target of like $230 predicting a BAD ER (maybe its not as bad as they expected? lol)\n\nAnyways, if you look at its revenue (21 billion) and then compare it to market cap (44 billion), then its quite fairly valued. Also, the tsla self driving would take on Uber.", "score": 1, "replies": []}]}, {"body": "Tesla insurance product - \"...more compelling than anything else in the market.\"", "score": 3, "replies": [{"body": "Would be big if Elon didn’t say this about literally everything including the shit he took before the call.", "score": 8, "replies": [{"body": "I’d drop a deposit for it", "score": 1, "replies": []}]}, {"body": "What a marketing legend", "score": 1, "replies": []}]}, {"body": "Zomgongkgnktkng HUGE never BEFORE Seen UUUUUUUGE", "score": 2, "replies": []}, {"body": "Everyone using the /wsb inverse method", "score": 2, "replies": []}, {"body": "Tesla posts loss and stock is up. Shouldn't all the WSBers have made a profit on this move? Or did they all got smart and bought puts?", "score": 1, "replies": [{"body": "IV crushed em", "score": 1, "replies": []}, {"body": "The only good move was buying shares at this level", "score": 1, "replies": []}]}, {"body": "Don’t we have an ER thread for. TSLA?", "score": 1, "replies": []}, {"body": "Well see what happens at market open", "score": 1, "replies": []}]}
