{"title": "Anyone else take a break from options?", "selftext": "[deleted]", "id": "kqab2u", "created_utc": 1609772336.0, "score": 111, "upvote_ratio": 0.91, "num_comments": 82, "comments": [{"body": "Yeah ... playing options lost me $1,500 in the last few months. Good thing my long-term Bitcoin investment that I literally never look at is up huge. I'm honestly considering moving my TD Ameritrade funds over to Bitcoin if it has another significant dip.", "score": 48, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "A much smaller scale but more volatile moves, which is beneficial during a bull run.", "score": 3, "replies": [{"body": "I am not selling calls against my calls so that helps.  Ban PDT!", "score": 2, "replies": []}]}]}]}, {"body": "\"Everyone be cautious\" but put your money in Dogecoin?", "score": 49, "replies": [{"body": "It's a bet that: \n1. People will flow into the cryptocurrency markets over the course of 2021\n2. People like jokes and memes, which DOGE offers the cryptosphere in a way no other coin does\n3. People like inexpensive, low-commitment investments or gambles a la scratch offs or casino games\n\nNot a bad bet in my book.\n\nIt's a collectors item like old gaming tokens back in the day that had value but you didn't care about redeeming because it had another meaning attached to it.", "score": 17, "replies": [{"body": "Maybe thats your bet.\n\nFor most, I'd say its a bet people will jump into something they dont understand. Then, due to their greed and half baked rationale they'll follow posts like this one (that are actually recruitment posts for suckers) where in the end theyll lose their money, but thats a small price to pay to show your grandkids your dogecoin collection.", "score": 7, "replies": [{"body": "1 DOGE always equals 1 DOGE.", "score": 7, "replies": []}, {"body": "I wonder if they said that about Bitcoin too? There’s a new dog in town Dogecoin! But I only invested 23 dollars before it’s recent spike! We going Mars!", "score": 2, "replies": []}]}, {"body": ">It's a collectors item like old gaming tokens\n\nNah, it's just retarded. LTC to the moon.", "score": 1, "replies": []}]}, {"body": "Haha this aged like milk", "score": 1, "replies": [{"body": "We'll just give it a little longer then", "score": 1, "replies": [{"body": "Bro just throw it out spoiled milk is nasty :(", "score": 1, "replies": [{"body": "Haha Im glad things are workin out for you", "score": 1, "replies": []}]}]}]}]}, {"body": "WSB is filled with bot accounts and pump and dump posts right now. You can fall victim to these posts and lose a lot of money atm. Options are still super profitable but you can’t listen to WSB posts right now. I also got banned for 4 days because the mod didn’t like my meme post lmao the reasoning was “wtf is that” they’re struggling over there and it’s kinda sad to see a place where I made a lot of money fall into chaos.", "score": 76, "replies": [{"body": "At one point last year, I took the advice of WSB on 6-8 trades and lost money on all of them.", "score": 21, "replies": [{"body": "Pump and dumbs at its finest.", "score": 13, "replies": []}]}, {"body": "How exactly does a pump and dump work? If you can recognize a pump and dump is going on, is there any way you can still make money off it?", "score": 7, "replies": [{"body": "Gme is a solid example. It’s a terrible company and people wanted this pipe dream to happen and everyone is spamming DD’s on it with rocketships preying their stupid calls that failed horribly make it to break even so they and all their bots make shitposts on why you should invest in a bad company to pump it enough for them to just dump their shit and make money off of new investors. Its hard to spot but no post on WSB will be solid advice for starters. Yes you can make money if you catch it in time yes you can spot these P&D’s and buy puts even if it peaks because there most likely will be a huge sell off. At the end of the day it’s all risky and forced trades. Long story short WSB is a casino and sometimes you can take note of some companies and watch them and do your own DD on it. I actually found ICLN on WSB and have profited a solid amount off of it. But at the end of the day the stocks you’re about to invest in should be researched by no one other then yourself. Watch it for a few days or even weeks. “No one is forcing you to make a trade” is a quote I love. Also a good tool to use is a website called [Options Profit Calculator ](https://www.optionsprofitcalculator.com/calculator/long-call.html)", "score": 24, "replies": [{"body": "Ahh okay, so it's pretty much people who bought a bunch of options expecting the stock to go up but it doesn't. So they hype it up trying to raise the price so they make money or won't loose money. That makes sense now.\n\nIve only been trading since June and even I thought it was weird that gamestop was being talked about. I keep expecting them to go out of business.", "score": 5, "replies": [{"body": "See why gme is the perfect example? But you nailed it. It is a dead business. People over hyped news hoping it would catch and it did. People made some money\nPosted it and it grew more attention and all of the posters dumped it harder then your local highschool psychopath. It’s absurdly common in WSB at the moment. People using bot accounts and etc to do it it’s insane.", "score": 4, "replies": [{"body": "Uhm...", "score": 2, "replies": [{"body": "Yes yes I know gme yielded good gains but it took what? 2 months almost for it to finally “ROCKET TO THE MOOOOOOOOOON 🚀” ? Not my kind of dd to follow.", "score": 2, "replies": [{"body": "I am still a believer in GME, not because it is a good company but because there are still more shorts than shares exist. The price feels low for a time where consoles are new and hot, flying off the shelves faster than they can stock. It seems like the company's value should still rise at least while they are selling buttloads of consoles. During that time while it is rising, the shorters will be losing money and hopefully give up and cut their losses and the price will jump even higher. What about that sounds false? I doubt it is going into whatever ludacris numbers many are hoping for but I don't think it is crazy to think it will hit $30 or $40 per share. (Currently about 17, was up to 23 recently). Not in it because I believe in them or anything, just waiting for that rise and get out forever. Those dickbags ripped me off as a teenager with their bullshit exchange rate of pennies for used equipment, so now it is my turn to make some money off of them! \n\nSo you are saying that because it took 2 months it is invalid? If it doesn't moon tomorrow it is bullshit advice? I dont think WSB is looking out for your best interest so take it with a grain of salt, but either way it was solid and correct on gme so far. The mooning has only just begun.", "score": 3, "replies": [{"body": "TLDR.... 🚀🚀🚀🚀🚀🚀🚀💦💦💦🍻", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Funny story about ICLN: I opened a brokerage account with SoFi to take advantage of some promotion they had going on a while back and ended up buying a few shares of ICLN just because I liked the idea of a clean energy etf and have a good feeling about clean energy moving forward. Long story short: I completely forgot about the account and its meager holdings (I think it’s about 10 or 11 shares) for a year or so and when I looked back at it the share price had doubled. I kicked myself for not buying more, but you know what they say about hindsight.", "score": 4, "replies": [{"body": "Couldn’t tell you how many times this has happened to me 😂", "score": 2, "replies": []}]}]}]}, {"body": "Yup just happened to me, lost all of it on XL FLEET smh", "score": 3, "replies": [{"body": "Rip. Been there lost 4K in two days lmao", "score": 2, "replies": []}]}, {"body": "Any good subs or twitter?", "score": 2, "replies": [{"body": "Honestly I got nothin besides looking at the kind of shit wsb posts for fun and my watchlist", "score": 1, "replies": []}]}]}, {"body": "I lost 1000 in the last two months, I am doing well with stocks. I guess it ain't for me", "score": 8, "replies": []}, {"body": "Watch out with dogecoin it's a regular pump and dump. Go on tradingview and look for dogeUSD on some old exchange like Poloniex. Every now and then people pump & dump it. I would take profits regularly and consistently. Don't be greedy", "score": 7, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "This is exactly how bag holders are born in the crypto space but okay😅", "score": 9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Avoid overhyped pump and dumps. Stick with ETH and BTC. Everything else is a shitcoin. If you can make a quick trade in and out on a shitcoin, good for you. But don't hold shitcoins. Keep your long exposure to BTC and ETH that's it", "score": 4, "replies": [{"body": "Alright, thanks. I want to get into mining but it seems useless on anything other than an altcoin. I don't feel like paying for a made up peer to peer currency is a very sound idea, however, there's money to be made in it for now and dogecoin mining is largely unprofitable so I'm in this for the hype at the moment. Id do mining if I found a decent altcoin with good exposure and potential.", "score": 1, "replies": []}]}, {"body": "First.... you're not \n\nLeave the $$$ to the toxic \"influencers\" who use their \"influence\" to get all their followers on Tik Tok to pump up their play just to hold the bag while they, the \"influencer\" rides off rich. Lemme know how that works out for ya", "score": 2, "replies": []}]}]}]}]}, {"body": "Yeah when I had $5k in stocks at the start of 2020 I was up 10%.  Then I discovered options and I'm down $3I.  If I had held the shares I owned I'd be up 10k. I exchanged lottery tickets for options and lost on both", "score": 6, "replies": []}, {"body": "Don’t make bad options trades my guy, sincerely $LIT $55c 1/15/21 gang 🥶", "score": 10, "replies": [{"body": "$PLTR $40C 3/19 would like a word...", "score": 1, "replies": []}]}, {"body": "Was down $200 on bad option plays then Bitcoin put me back in the green", "score": 5, "replies": []}, {"body": " \n\nI agree with OP Fellow retards I know how we all love our helmets and our kneepads, how we love to sing in the short bus when going to bowling, love me tender, we're all dreaming of the moon. Fair enough, we all want a new wife and a CyberTruck paid with TLSA weeklies. It's okay, that's the American dream, last time I checked, it worked for a few people.\n\nWe all think we can be this guy, cocaine and hookers on a Wednesday, sun bathing in the Caimans. Fuck you money they call it. Yup, America is fucked because we are all poor that see themselves not as an exploited ~~proletariat~~ (Wendy's workers) but as **temporarily** embarrassed **millionaires**.”\n\nI know, you hate me for saying this, that's fair I hate myself too. My point is, this sub culture is a fun joke, if you got 1k at your name fine, you deserve to lose it by yoloing at the roulette table. Fuck them, I'm talking to all the other inexperienced retards, crayons-eaters with a family to feed, inexperienced boomers gambling their retirement money, dumbass kids with 10k because they be hustlin hard full-time without spending much because they are virgins and have no friends, Yeah. You autistics rocket emojis kids that turned 1k into 15k in 3 months after investing in unaudited Chinese ADRs crap or near bankrupted pump n dump scheme.\n\nSTOP fucking playing! I'm talking about practice, not the fucking game, don't get in a F1 if you can't park, **LEARN YOUR STUFF** start to read, know your Greeks, fuckin understand what you are doing before it's too late. Loss porn isn't that funny, it's sad, we just fake it.\n\nDEEP DOWN YOU KNOW IT, IF YOU DONT KNOW WHAT YOU DOING! My advice? Just buy fucking shares, and paper trade options until you understand how hard and random they are. **CALLS ARE NOT EASY MONEY,** if you think it is, you really don't know shit and you're just proving my point! PLEASE DON'T GAMBLE EVERYTHING, or you will want to kill yourself like it probably happened before.\n\ntldr: WSB culture is destroying financial health of a lot of people, dont fall for it! Stop lying to yourself you will not turn 1k into 1M, and if you do it this way, you will have learn nothing and will most definitely lose it all or partially before understanding that you have no strategy, no plan.\n\nBtw I'm ready for the insults and the downvote, I just hope I can influence a single person with this. (And yes, I did beat the market this year, just not +500% on the year, I don't fall for unrealistic expectations because of social medias, that's for teenager beta cucks). Learn or get burn! Don't fall prey to the Theta gang ruling this sub.", "score": 5, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "\nFuck Off CoolDownBot Do you not fucking understand that the fucking world is fucking never going to fucking be a perfect fucking happy place? Seriously, some people fucking use fucking foul language, is that really fucking so bad? People fucking use it for emphasis or sometimes fucking to be hateful. It is never fucking going to go away though. This is fucking just how the fucking world, and the fucking internet is. Oh, and your fucking PSA? Don't get me fucking started. Don't you fucking realize that fucking people can fucking multitask and fucking focus on multiple fucking things? People don't fucking want to focus on the fucking important shit 100% of the fucking time. Sometimes it's nice to just fucking sit back and fucking relax. Try it sometimes, you might fucking enjoy it. I am a bot", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\nFuck Off CoolDownBot Do you not fucking understand that the fucking world is fucking never going to fucking be a perfect fucking happy place? Seriously, some people fucking use fucking foul language, is that really fucking so bad? People fucking use it for emphasis or sometimes fucking to be hateful. It is never fucking going to go away though. This is fucking just how the fucking world, and the fucking internet is. Oh, and your fucking PSA? Don't get me fucking started. Don't you fucking realize that fucking people can fucking multitask and fucking focus on multiple fucking things? People don't fucking want to focus on the fucking important shit 100% of the fucking time. Sometimes it's nice to just fucking sit back and fucking relax. Try it sometimes, you might fucking enjoy it. I am a bot", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\nFuck Off CoolDownBot Do you not fucking understand that the fucking world is fucking never going to fucking be a perfect fucking happy place? Seriously, some people fucking use fucking foul language, is that really fucking so bad? People fucking use it for emphasis or sometimes fucking to be hateful. It is never fucking going to go away though. This is fucking just how the fucking world, and the fucking internet is. Oh, and your fucking PSA? Don't get me fucking started. Don't you fucking realize that fucking people can fucking multitask and fucking focus on multiple fucking things? People don't fucking want to focus on the fucking important shit 100% of the fucking time. Sometimes it's nice to just fucking sit back and fucking relax. Try it sometimes, you might fucking enjoy it. I am a bot", "score": 1, "replies": [{"body": "Did... did you break it..?\n\nThese bots blew up like my portfolio", "score": 3, "replies": [{"body": "Infinite loop right here", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Now is probably the best time to get in the game. Buy the dip.", "score": 4, "replies": []}, {"body": "$DOGEcoin train! All aboooooard!", "score": 7, "replies": []}, {"body": "Partly agree.\nMy stocks, aside from cineplex, have all regained their covid losses. \nOptions has been volatile to say the least. Lost a few  g of paper gains on apple today.\nHowever, if you want to play apple or tesla or boeing options are sometimes the only way to have exposure. I cant afford 100 shares of any of those companies. \nYou can be wildly successful in options if you just close a position at 50 percent gain each time. It's when you hold to expiry, hoping for that 50x or 100x hit that you get screwed.\nAlso stay away from the pltr pumps. If youre reading it on wsb, you've likely missed your chance", "score": 3, "replies": []}, {"body": "Agree, I put in options when I do lots of research on. \n\nIn all, I've been just buying dips and selling them when I make a good %. Don't look back or re-buy the dip. I'm not interested in putting up $10k on one company for option. \n\nCrypto is a great place to start.", "score": 3, "replies": []}, {"body": "After nearly losing all my money in October, I managed a comeback and nearly doubled it in two days, then pulled everything out.  I'll get back in sometime this year, but it was just getting too stressful and I needed to cool off before I tilted myself into the gutter.\n\nOptions are a casino for me.  Apparently I'm incapable of trading them any other way, so it's probably good for me to take breaks and just passively watch the market for a while.", "score": 3, "replies": []}, {"body": "I prefer long dated options (LEAPs), it's easier to predict a general long term trend rather than trying to guess short term stock movements.  Had most success with TAN April 2021 calls which are up 600% since buying in September.", "score": 3, "replies": []}, {"body": "Playing Doge just as risky as options.... lol fuckin meme coin", "score": 3, "replies": [{"body": "Id rather throw my money into memes than the reddit option dumpster fire", "score": 2, "replies": []}]}, {"body": "Definitely not for everyone.", "score": 2, "replies": []}, {"body": "I switched over to forex recently and I’m so fucking glad I did lmao fuck options", "score": 2, "replies": [{"body": "Can you share some details?  What was your currency pair and over what length of time?", "score": 1, "replies": [{"body": "I trade multiple different pairs at different times and for different periods of time lol. There’s 24 hour trading and NO PDT rule. For anyone who prefers technical trading, forex is the way to go cause there’s only a few fundamentals associated with forex compared to stocks. I just feel like I’m doing a book report or homework when I’m doing fundamental analysis but I loveeeeee technical analysis so forex is the move for me lol", "score": 3, "replies": [{"body": "Thanks - what did you use to learn? Both the trading and the tehnical / fundamental analysis?", "score": 1, "replies": [{"body": "Honestly just YouTube and Google lol. I spent all 2020 learning to trade stocks and options and that’s just where I picked up my analysis process. I wouldn’t pay for a course, especially a forex one cause there are a shit ton of scammy “gurus” in forex, even more so than stocks. For anyone who’s truly passionate about the market, the info is out there for free. You just gotta dig for it. As long as you know candle sticks and candle stick patterns, you’re already pretty set for technical analysis. Just throw on some moving averages and you should have a pretty good edge", "score": 3, "replies": []}]}]}]}]}, {"body": "I took a break when the out of the first and only three I took, two ended in a humongous loss. So I pledged to not take another options play until I watch 6 hours worth of video about options so I know a little bit more about what I’m doing. So I put it on hold and now I’m looking at OTC.", "score": 2, "replies": []}, {"body": "I just do debit spreads! Once it hits the long leg I close and take my little profit! I’ve done about 5 or 6 and been successful! I have a debit spread on Spy for the 6th but once I can close I will close and get my little profit! I’m a noob so I could be doing it wrong! You never go broke taking profits!", "score": 2, "replies": []}, {"body": "honestly, i think NOT allocating some percentage of your portfolio to crypto is irresponsible. I just wish I did this earlier, but oh well. Buffet got into AAPL late in 2016. Better late than never.", "score": 1, "replies": []}, {"body": "Yup, buying shares like a boomer.", "score": 0, "replies": [{"body": "Not entirely a boomer; I know young teenagers thatd prefer not to throw their money into dumpster fires too", "score": 2, "replies": []}]}, {"body": "I'm exclusively trading crypto now because you won't get dinged for day trading.", "score": 1, "replies": [{"body": "Its pretty liberating lol\n\nForex be hitting too", "score": 1, "replies": []}]}, {"body": "I made $210 today on a SPY put. %150 gain. Options have a purpose they are a tool", "score": 1, "replies": []}, {"body": "I am still doing options but not as actively, letting some longer term plays play out.\n\nCrypto has been where it's at, up like \\[many many many ks\\] in the last few weeks. It's fucking insane.\n\nAnd don't get me started on Pancakeswap, that is the gift that keeps on giving...", "score": 1, "replies": [{"body": "Decentralized exchanges seem... sketchy at best to me", "score": 1, "replies": [{"body": "They serve a new and emerging role in the eco-system and I think more and more is going to end up there.\n\nI am pulling $2k a week out of PancakeSwap yield farming with no real effort. It has some serious scale already.", "score": 1, "replies": []}]}]}, {"body": "I agree. Stick to ETH and BTC, not other coins.", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "Never, learn how to trade strats", "score": 1, "replies": []}, {"body": "Yeah, I told myself I’d wait for the next oversold market to yolo in calls. Seems like that time will be eow this week or next. (4-5 week break)", "score": 1, "replies": []}, {"body": "Where are you all trading bitcoin? (Serious)", "score": 1, "replies": [{"body": "Here's my referral link for Coinbase. Get $10 in free Bitcoin when you buy or sell $100 or more: coinbase.com/join/ngo_1o2?src=ios-share", "score": 2, "replies": []}]}]}
