{"title": "How can you justify Tesla's insanely high valuation?", "selftext": "Title. I've been long since $70, and as much as I recognize that I have been skeptical of its valuation from ever since it hit even $200; I don't understand how it's trading at its current valuation. Why would you justify its current price?", "id": "ksgjjo", "created_utc": 1610036343.0, "score": 28, "upvote_ratio": 0.81, "num_comments": 84, "comments": [{"body": "It is more like religion at this point rather than any sort of financial theory.", "score": 101, "replies": [{"body": "Simple answer", "score": 12, "replies": [{"body": "More like legalized gambling.", "score": 12, "replies": []}]}, {"body": "Cult stock", "score": 8, "replies": []}, {"body": "Soon go pop.", "score": 4, "replies": [{"body": "Show us your puts", "score": 4, "replies": [{"body": "You can invest in alternatives to Tesla as opposed to living in a world where there is only owning calls or owning puts of Tesla. \n\nYou can just not touch it.\n\nFor example, Musk insists Hydrogen and Lidar are \"mind-bogglingly stupid.\"\n\nElon is a bit of a liar. Hydrogen and Lidar are working out pretty ok for me so far.", "score": 9, "replies": [{"body": "I know nothing about either of those but I just want to point out, given that this is a thread about Tesla being ridiculously over valued, the fact that hydrogen and lidar are working out ok for you does not mean they're not mind bogglingly stupid....", "score": 4, "replies": [{"body": "But Musk IS a well known liar", "score": 1, "replies": []}]}]}]}]}, {"body": "Can't beat the Cult of Tesla.", "score": 1, "replies": []}]}, {"body": "Insane volume on OTM call options coupled with shorts being forced to cover positions and S&P inclusion forces market makers and institutional money to just keep buying shares. I’ll be drunkenly ranting and raving to my grandkids that I should have bought more in the nursing home in 53 years.", "score": 34, "replies": [{"body": "Hahaha, what do you imagine we'll be at in say 20 years? Ballpark guess of course, but I'm interested in hearing peoples thoughts", "score": 2, "replies": [{"body": "Back at $800, after 2 or 3 more 5/1 splits of course", "score": 20, "replies": []}, {"body": "Fundamentals seem to not matter too much and TSLA is one of the last stocks you want to bet against.  I say keep riding the fad (though they have a legit product but no where near what they are valued at) until it busts then take your profits onto something else.", "score": 2, "replies": []}]}]}, {"body": "Just FOMO into Tesla just like everyone else. Don’t ask questions", "score": 24, "replies": [{"body": "In the case of my relationship with tsla it means fuck i missed out", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Fear Of Missing Out", "score": 1, "replies": []}, {"body": "Fear of missing out.", "score": 1, "replies": [{"body": "Fear of missing out", "score": 2, "replies": [{"body": "Fear of missing out", "score": 2, "replies": []}]}]}]}]}, {"body": "You can probably find some answers in the many other threads just like this one that get posted every single time that Tesla reaches a new all-time high which feels like it is happening about every week.\n\nAt this point, I think that it might be best to have one permanent sticky \"Tesla valuation\" thread so that way people will be able to read all of the bull and bear cases in one place and won't have to repeat the same arguments over and over again every single time that Tesla reaches a new high. Otherwise, I look forward to next week's \"Tesla's valuation is insane\" thread.", "score": 9, "replies": []}, {"body": "Well EV is in bubble, what makes me questions things more is crypto, all indexes being ATH to make sense of current market environment. \n\nI was selling my TSLA pre split for 600 so shit I know about them. :D", "score": 6, "replies": [{"body": "Ev is a bubble just like internet was a bubble in the early 90s. But Tesla is the Amazon in that analogy, not the myspace. \n\nSource: lived through the dot com bubble and had a myspace account.", "score": -4, "replies": []}]}, {"body": "Back in 2000 when AMZN was making +$1000 moves we all asked the same question.\n\nThere was a constant stream of \"expert\" opinion on CNBC telling us that we are in a new paradigm of investing and this is the new norm.\n\nHundreds of analysts put out long and in depth reports explaining how the price moves are justified. Its all true and accurate until its not.\n\nAMZN kept being overvalued until one day some big whales decided it was time to take profits. The same here, TSLA can continue to rise and it does not need to make sense.\n\nThere will be a correction  eventually, but it could be from $2000 back down to $1000, or from $1000 down to $500, we have no way of telling at this moment in time.", "score": 11, "replies": [{"body": "When did It ever go up $1000? This articles states the largest ever gain for the stock occurred in 2020 after Q1 earnings- total of $181 increase in the stock.\n\nTheir stock traded around $400-5 years ago. Are you adding extra zeros or something\n\nhttps://www.google.com/amp/s/www.bloomberg.com/amp/news/articles/2020-01-31/amazon-set-to-break-record-for-one-day-gain-in-market-cap", "score": 0, "replies": [{"body": "You misunderstood the entire comment, or the meaning of eventually.\n\nThose values were hypothetical.", "score": 3, "replies": [{"body": "I understand the argument, rampant speculation and experts gleaming to tell everyone how it was different lead to one day a bubble popping...\n\nBut 2000’s era Amazon is the wrong argument to make, Nortel, Yahoo, Cisco those were speculative and the paradigm shift, Amazon was just a book seller that was along for the ride and got knee capped. \n\nGenerally I think Tesla will be this decades Oracle, IBM, Cisco, Mcafee.... all had radical CEOs who were seen as the future and raised tons of money, but ultimately will get lapped by the 2nd wave who takes it past the finish line.... Apple, Amazon, Visa companies that I consider the 2nd wave of tech.", "score": 1, "replies": [{"body": "I think Raleigh Noles is a theory that makes a lot of sense. They could get lapped in 2nd round in a few years.  THen might make a comeback or not. Think Apple.", "score": 1, "replies": []}]}]}]}]}, {"body": "TSLA is the BTC equivalent of the stock market.", "score": 4, "replies": []}, {"body": "Here's ARK Invest's thesis about TSLA:\n\n[https://ark-invest.com/articles/analyst-research/tesla-price-target/](https://ark-invest.com/articles/analyst-research/tesla-price-target/)", "score": 5, "replies": [{"body": "Defiantly appreciate it", "score": 1, "replies": [{"body": "🚀 ok now im in, stopped reading at Ark.", "score": 8, "replies": []}]}, {"body": "So this article was written in January 2020 pre-split. Adjusted for split Tesla’s price would be about $3,468, which exceeds ARK’s 2024 price target that had the highest probability ($3,400 and 28%). Just some food for thought about Tesla’s trajectory and current valuation.", "score": 1, "replies": []}]}, {"body": "You absolutely cant. And yet, it may still go up even more.\n\nMusk is not easily understood. He's seen as a Steve Jobs of sorts, not a traditional CEO. In such a scenario, people aren't investing on fundamentals but with emotion and faith that his vision represents something much bigger than the actual number of cars Tesla sells today.\n\nHonestly, outside of Jobs he's an anomaly in many respects. An engineer/nerd, an intellect and willing to risk his own fortune on his convictions. I understand the appeal, but I can never make sense of the Tesla valuation.\n\nAll I can say is, he's working on a ton of cool sh!t. From solid state batteries, to their own processors, proprietary software, camera-guided AI autopilot (all others are Lidar), etc. Toss in the solar initiative with a green-friendly incoming administration, the nueralink AI company, the Boring Co. and last but not least, SpaceX and its incredible strides in the last couple years.\n\nIt's hard not to want a piece of action and Tesla is currently the only \"in\" for the average investor so people will apparently increasingly pay anything for it.\n\nBut to answer your question if you can justify the high valuation? In regular terms, no. Then, consider all I wrote above.", "score": 2, "replies": []}, {"body": "Just short it and hold your dicks until this bullshit collapses. TSLA will never take over the global car industry. The Chinese will, collaboratively.", "score": 2, "replies": []}, {"body": "Tesla is making money producing products with materials.  \nBatteries, Solar Panels, Cars ... etc.\n\nAmazon is shjipping products and profitting from every transaction. Not even considering its Cloud business, which they heavily use for themselves, meaning it has an intrinsic value regardless of revenue.\n\nTesla can never ever make enough profit to justify its evaluation. It is simply impossoble.  \nEven Apple that has a high margin because of its outsourcing strategy (to not use a different term), has an upper limit on evaluation.\n\nSo mo, Tesla is in investment vehicle for rich investors to park money.  \nThey trust Elon with their money until they no longer do.\n\nThere is no technology, product or invention that Tesla owns that can ever let them make as much profit.", "score": 3, "replies": [{"body": "Tesla’s battery costs are expected to half in a few years and with increasing software sales and potential autonomous driving their margins are expected to match Apple quite easily. This is a super weak argument.", "score": 13, "replies": [{"body": "You shoulds go back to the last earnings call and read about P/E.  \nIt has nothing to do with future earnings or cost reduction.\n\nThey cannot sell a billion cars for profit.\n\nAlso, please really looking into their revolutionary battery technology.  \nI really do not want to sound condescending, but they have little to show there.  \nBuilding factories to mass produce their cells is not innovation.  \nThere are lots of videos about the disadvantages of Tesla form factor and glued battery grids.", "score": 1, "replies": [{"body": "Some interesting information. Ford makes $0.001 in profit for each car sold after calculating all it's expenses. Tesla makes $1,000 in profit for each car sold after calculating for all it's expenses.", "score": 4, "replies": [{"body": "Most of their profit last year came from selling carbon credits.", "score": 3, "replies": []}, {"body": "wow, Tesla must be worth 1,000,000 times more by that logic! that's stonks!", "score": 4, "replies": []}]}, {"body": "K. It’s really hard to explain Tesla to people who insist on sticking their head in the sand.", "score": 2, "replies": [{"body": "Exactly.  \nThis is why they will all run away crying once it is back to $200", "score": 0, "replies": [{"body": "What a fucking joke. $200 is like a 180b market cap, like 7x 2020 sales with 40% growth with 24% gross margins. That’s insanely cheap you donut.", "score": 1, "replies": []}]}]}]}]}, {"body": "I think Tesla can make as much money as Amazon some day. If they dominate the autonomic driving market they take over the whole person transportation market. People will throw their money at them.", "score": 1, "replies": [{"body": "I guess this is what Walmart investors must have felt like when they saw Jeff in the mirror.... absolutely didn’t make sense back then, but now I sit here shaking my head not understanding it either.... they sell cars and not even close to the most cars but are worth more than all carmakers??? Huh", "score": 0, "replies": []}, {"body": "It just doesnt look like tesla can dominate in the future like it does now. Norway has the most EVs per person in the world and VW is already outselling them. China will be the biggest market for EVs and the ccp prob wont let tesla dominate in a few years if they can just leave it to nio, xpeng etc..", "score": 1, "replies": [{"body": "I know what you mean, they have powerful competitors. But for autonomous driving they are years ahead which let's them enter the market first and if lucky build a monopoly.\nAbout China, you could be right. But I was in Shanghai a couple times, and they for sure love their Apple products. So they will love a Tesla over a plastic interiour NIO.", "score": 2, "replies": [{"body": "A Monopoly seems crazy to me considering all the powerful competition, but we will see. And apple is the perfect example for being pushed out china hardcore, xiamo sells more phones then apple already.  I think the same will happen to tesla but we will see", "score": 1, "replies": []}]}]}]}]}, {"body": "I won't touch it with a 100 foot pole.  A lot of people are going to lose a lot of money.", "score": 1, "replies": [{"body": "A lot of people are making a shit ton as well", "score": 6, "replies": [{"body": "If they can keep it. Yes, absolutely!", "score": 2, "replies": []}]}]}, {"body": "Because the car market is absolutely massive. Just about every family has 1 or 2 cars and most of them WANT a Tesla. This is known as Total Addressable Market. With no true competition,  Tesla will be running.", "score": 1, "replies": [{"body": "No true competition? VW is already outselling them in some european countries and every other car company will bringt out EVs in the next few years, Not even counting companies like apple, amazon, alibaba etc..", "score": 1, "replies": []}]}, {"body": "How does this question get asked every week.\n\nI've been reading up on AI programming, and something they said really made me think about stocks. \n\nWe all know what's happening,but we really have no idea wtf is happening. And anyone who says they do is a liar. Lol", "score": -2, "replies": [{"body": "Do you have a link for the article? AI is one of my hobbies!", "score": 1, "replies": [{"body": "I've started getting into programming as a career, I was watching some candid vids on youtube from computer science students and \"what it's like\" as their take on some misconceptions. That was a recurring theme among a few of them when the topic of ai came up lol", "score": 1, "replies": [{"body": "Programming is great dude. Very therapeutic and pays well! Good luck with your classes!", "score": 1, "replies": [{"body": "I got my hands wet with html and css, decided to slide on over to js and I'm in physical pain. Currently trying to get myself out of bed and start some videos. Dreading it because I'm in the space where I have a good grasp on the basics, and the next chapter is so abstract to me i have no idea how to apply it much less synthesize it meaningful into anything. \n\nLike sure, I can whip up a .slice or .substr but...why? Lol", "score": 2, "replies": []}]}]}]}]}, {"body": "The future.", "score": -8, "replies": [{"body": "Care to elaborate?", "score": 1, "replies": [{"body": "Speculation that Tesla's technology, R&D and Elon's vision will make them one of the most profitable companies in the world. People have been overhyping this company since 2018.", "score": 3, "replies": [{"body": "Appreciate it, I just don't get how its gotten to its current valuation. Nuts", "score": 4, "replies": [{"body": "It is definitely overvalued and overbought. At the same time, look at Bitcoin and many tech stocks. It doesn't pay to be safe right now.", "score": 1, "replies": []}]}]}, {"body": "More like “the tech bubble”", "score": 0, "replies": []}]}]}, {"body": "I'm new to this so I'm not use to the terminology. What's justify mean? I've only been on WSB and haven't ever seen that? All I really know is 🚀 means sacrifice unless ur the one posting it then is means gains. \nSo confusing", "score": -2, "replies": []}, {"body": "Can't", "score": 1, "replies": []}, {"body": "Stocks only go up", "score": 1, "replies": []}, {"body": "Like this:\n\n[Youtube LINK](https://youtu.be/rKCZu1-o7iY)", "score": 1, "replies": []}, {"body": "They just throw in SpaceX equity free.", "score": 1, "replies": []}, {"body": "Tesla’s stock growth has been so exponential within the last year that I find it hard to believe that they will continue to grow at such a rate, at this point in time Tesla seems to be a good investment for a long term hold, by that I mean Atleast 1-2 years. But if you see yourself gaining more than 100-200 within the next 12months without a major drop off that would be almost unbelievable. Okay long term hold bad short term hold, usually best to stay away from top gainers who continuously receive such hype", "score": 1, "replies": []}, {"body": "I don’t own them and 6mo ago thought they were overpriced but now see them doubling in next 1-2 yrs. rolling out full self driving allowing individuals and fleets to compete with Uber to the tune of estimated 30k profit per car per year. Also spent 2020 launching 1k satellites into space and is on the cusp of launching global high speed satellite internet available from almost anywhere. If investors see those as growth vectors then the price will keep climbing.", "score": 1, "replies": []}, {"body": "Because it's not just a car company.  Solar,  insurance,  battery, and MOTHERFUCKING SPACE BEYATCHES!!!  🚀🚀🚀🚀🚀🚀", "score": 1, "replies": [{"body": "Someone correct me if I am wrong but the TSLA stock you’re buying into is the car company only, not the space/ or other arms of Elon Musk’s businesses.", "score": 1, "replies": []}]}, {"body": "You just need to believe it. Belief requires no justification", "score": 1, "replies": []}, {"body": "COUV is the next big thing 💪💪", "score": 1, "replies": []}, {"body": "People are investing in TSLA not because of value but because they think it will go up. When it doesn't go up any more it will come down and bring the whole market with it", "score": 1, "replies": []}, {"body": "With my wallet that says you're wrong until you aren't but whatever because I have a 10% stop loss", "score": 1, "replies": []}, {"body": "At the end of the day it’s just another car company. Don’t let the FOMO on more profits screw you over. It will pop, I’d recommend taking the profits and buy it back when the bubble pops. Look at Volkswagen who actually turns a true profit and sells 10x more vehicles worldwide than Tesla. Tesla’s market cap is 7x more than VW, and when everyone starts pumping out EV’s Tesla won’t be so much of a hype stock. I’d take the 1000%+ profits and run.", "score": 1, "replies": []}, {"body": "china stock", "score": 1, "replies": []}, {"body": "Dont know what's harder. Giving a valid explanation for Tesla's valuation, or providing a valid bull case for PLTR...", "score": 1, "replies": []}, {"body": "I could buy it if they were winning everywhere, but they are already losing in Europe to legacy auto manufacturers which I think is a sign of things to come.", "score": 1, "replies": []}, {"body": "Casino Royale at its best!🤑", "score": 1, "replies": []}]}
{"title": "Reeeeeeeeecap of today's market driving news (Jan 6, 2021 after market close)", "selftext": "(*Editor's note: It's a [wild day](https://d2qig04bry9arv.cloudfront.net/uploads/2014/04/roller-coaster.jpg) for the market and the country, and I will try to be as neutral as possible despite the fuckery afoot)*.\n\n* Dems clinched the GA Senate run-off election as Warnock defeats Loeffler while Ossoff defeats Perdue (the first millennial Senator). As the results became more clear last night, futures took a deep dive particularly for NQ, while conversely small caps enjoys a favorable bump. The market opened deeply red for QQQ as big tech retreated with renew fear on antitrust probes  and overall an unfriendly corporate environment as Democrats will control WH and both chambers of Congress. \n\n* By early morning, the sell-off quickly reversed and big tech recovered most of their red, with big tech such as AAPL going from -3% to just shy of yesterday's close during day's high. In contrast to big tech, clean tech and weed soared on Dems securing the Senate. ICLN was up almost 4% during pre-market and as high as 9% during intraday high and HASI was up 10% during intraday high. Weed stock such as TLRY was up as high as 21%, ACB as high as 11%+, and APHA as high as 14%.\n\n* Things quickly pulled back and tech started fading in earnest at 2:15 PM ET when protestors [cosplaying as revolutionaries](https://image.cnbcfm.com/api/v1/image/106820104-1609961746992-gettyimages-1230453313-AFP_8YA6MW.jpg) stormed the capitol and Congress had to quickly pause their certifying of the Electoral College votes. Shit got real when a lady got shot as these protestors attempt to storm the [barricaded House chamber](https://dynaimage.cdn.cnn.com/cnn/w_1600/https%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F210106150417-03-house-chamber-0106.jpg) while Reps were still in the building.\n\n* The sell-off accelerated for AAPL, AMZN, FB, MSFT, and NFLX as most drilled back to opening lows by EOD. AAPL closed the day -3.37% to $126.60, AMZN -2.49% to $3,138, FB -2.83% to $263, MSFT -2.59% to $212, and NFLX -3.9% to $500.49. Thanks to overall negative sentiment of all things tech, QQQ closed the day red at -1.39% to $307 (retreating quite a bit more than IXIC given the weigh of big tech in QQQ).\n\n* Morning economic numbers had ADP reporting payrolls dropping to 123k in Dec, slightly below consensus of 130k. PMI was at 54.8 while consensus was 55.3, while factory order was up 1.0% MoM. Thankfully, none of these number fucking matters as the Dow, SPY, and IWM proceed to sky rocket with the market looking forward to stronger spending and stimulus from a Dem controlled govt.\n\n* Beyond weed, clean tech, and infrastructure - financial sector killed it today in particular mid-cap banks such as ZION (up 11.24%), CNC (up 9.81%), and KEY (up 9.73%). You'll find a similar story for large-cap bank stock with JPM closing up 4.70%, BAC up 6.25%, C up 5.75%, and WFC up 7.08%. It's a good thing I've already dumped my reopening [WFC leaps play](https://www.reddit.com/r/wallstreetbets/comments/kftjzt/weekend_discussion_thread_for_the_weekend_of/ggarcbi/) of $25c and $30c which are now fucking ITM by $3~$8 and still have a year left to go on them. Nice.\n\n* In yet another confusing about-face and showing a real Karen spunk, the NYSE is *really* delisting the three Chinese telecoms this time. The real kicker though came in at 2:25 PM ET when news broke that US officials are considering *more* Chinese stock delisting, adding Chinese big tech Alibaba, Tencent, et al. to the potential list. A sea of red soon followed to compound the sell-off as BABA crater to the Earth's core and closed down -5.32%. Following suit, PDD closed down -5.58%, JD down -7.66%, and the same goes for Chinese EV NIO at -5% and XPEV at -2.62%. LI escapes semi-unscathed and closed the day up 2.48% thanks to a new BofA coverage with a Buy rating and a PT of $42.\n\n* In WSB meme stock land, GME was on track for a solid 8-9% day until the storming of the capitol occurred, PLTR's fade accelerated further while MT stays modestly flat, bouncing back from the overall market sell off. GME closed up 5.70% to $18.36, PLTR closed down -4.31% to $23.54, and MT closed up 0.32% to $24.70. ICLN, a new WSB favorite due to new balance of power in Congress might be added to future roundup if it continues to pump. Imagine that, a clean energy boomer ETF becoming a meme stock. The iShares fund managers are probably wondering why their alerts going tits up with social media mentions and sentiment brewing.\n\n* Random trade ideas (these are not financial advice and if it goes wrong that's your own gdamn fault):\n\n    1) FSLY leaps Jan 2022 90c or 100c+ for eventual TikTok climbing back fully onto the service as ByteDance pointedly makes a political jab at outgoing administration. Headwind on this retarded play: cloud/stay-at-home stock continues to take a beating as rona gets under control as vaccine roll out picks up. \n\n    2) Sell AAPL cash secured puts Jan 15 120p to 122p if the big tech fade continues rest of the week. These ~0.18 to 0.24 delta strikes are likely safe enough and if assigned, you'll have an upcoming ER on Jan 26 to sell IV pumped covered calls to get out of the trade intact. Feb 19 puts are likely okay to sell as well given you'll receive much more premium from the ~43 dte chains. Headwinds on this retarded play: its CSP and CC. As boomer as it gets. \n\n    3) BABA leaps and/or March debit call spread for another bounce in a wild trading week for BABA. March 230c/250c is probably a sufficient spread while baking in a bit of IV via ER which is on Feb 11. Jan 230c to 250c if you're not poor. Headwind on this retarded play: Jack Ma really is missing and the US govt really will delist a 600 bil market cap Chinese ADR, forcing out all major US institution holders. Yeah, right.\n\n* The DOW closed up 1.44% or 437 pts, Nasdaq down -0.61% or -78 pts, S&P up 0.57% or 21 pts, and RUT closed up 3.98% (!!) or 78 pts. Stay in school kids and avoid storming federal buildings or Twitter will start banning your fucking account. (TWTR locks POTUS account for 12 hrs and is down -1.99% AH).\n\n(Yesterday's [recap](https://www.reddit.com/r/wallstreetbets/comments/kr7ze8/reeeeeeeeecap_of_todays_market_driving_news_jan_5/)).", "id": "ks13de", "created_utc": 1609978905.0, "score": 421, "upvote_ratio": 0.98, "num_comments": 83, "comments": [{"body": "Riots at the Capitol = Futures green.", "score": 147, "replies": [{"body": "I was gonna name this \"Jan 6, 2021 Civil War edition\" but didn't want to inflame the situation further heh.", "score": 86, "replies": [{"body": "im so god damn pissed\n\nlost 3% when I was up 6% cause of them goofs and probably stopped a run", "score": 41, "replies": [{"body": "Civil war is bad for business. Fuck those cock-smoking trumpettes", "score": 38, "replies": [{"body": "CALLS on SWBI. Civil War is GOOD for gun businesses. You gotta take advantage of the situation retard", "score": 14, "replies": [{"body": "If you can’t make money in a war, you just plain can’t make money.", "score": 1, "replies": []}]}, {"body": "GME gonna pivot to selling guns and riot gear, short squeeze imminent", "score": 8, "replies": []}]}, {"body": "I got puts and banked. 50% in 16 min baby", "score": 5, "replies": []}]}, {"body": "Surely, you have saved some lives tonight.", "score": 15, "replies": []}]}, {"body": "Government overthrow means less regulations and taxes. Bullish af.", "score": 18, "replies": [{"body": "Overthrow? Nah, big temper tantrum.", "score": 5, "replies": []}]}]}, {"body": "Bough the fucking tech dip EOD. Nothing *too* short term given 3 day rule and all...\n\n* AMZN OTM Sep calls\n* NVDA March calls\n* AAPL leaps\n* FSLY leaps + March calls \n* BABA leaps\n\nI know financials and small caps are killing it but I just can't stop buying tech. Will probably add more to CRWD if I can get it under $200 again.", "score": 50, "replies": [{"body": "What are your strike prices? (if you don’t mind me asking)\n\nThanks for the killer summary every day!", "score": 18, "replies": [{"body": "AMZN 3700c and 4000c\n\nNVDA 540c \n\nAAPL 122 to 127.5c (this way i can sell weeklies against them if I have to)\n\nFSLY 100c and some 80-90c for March (just playing for a bounce on these)\n\nBABA 230c\n\nhonestly a cheaper play is probably ICLN/HASI monthlies which are cheaper but may keep pumping given market sentiment and all\n\ni took my ICLN gains intraday cuz i bought them in the AM, and reloaded Feb 32c x 10 before power hour. modest position all things considered. looking at AH I probably should have added more...", "score": 23, "replies": [{"body": "May I ask why you choose Feb expiration for ICLN instead of longer dated leaps 6-12 months out?", "score": 6, "replies": [{"body": "I'm just playing current sentiment and trend. Probably won't hold beyond a few days, let alone a week.\n\nSafe stuff is definitely June and beyond tho or just go with shares", "score": 10, "replies": [{"body": "Got it. I think green energy will be fine but i could be wrong. I bought 110 Jan 2022 $35C's and about 330 shares", "score": 5, "replies": []}]}]}, {"body": "Thanks for the details! I played ICLN today and did well. Might dip back into it tomorrow. Also looking into NIO calls pre-NIO day.", "score": 4, "replies": []}, {"body": "I also took my gains intraday and feel the same way. Didn’t expect it to keep pumping AH. I’m eager to get back in tomorrow if the price is right.", "score": 3, "replies": []}]}]}, {"body": "CSP's for CRWD are juicy-ish. Boomer plays and all", "score": 2, "replies": []}, {"body": "Exactly, no reason to hit a homerun when base hits are fucking free", "score": 2, "replies": []}, {"body": "Also picked up AAPL $125c leaps for 01/2023 when it dipped to $126. That’s for the IRA. Seemed like a safe enough dip to pick those up.", "score": 1, "replies": [{"body": "Yeah I've had some pre split aapl leaps that I've since rolled over and it hasn't failed yet for the IRA... Just buy on random dip days and forget about them till rebalancing time", "score": 4, "replies": []}]}, {"body": "this should be a good time to enter long AAPL and BABA positions you would say?", "score": -1, "replies": [{"body": "As a BABA $285 bag holder: ABSOLUTELY!", "score": 2, "replies": []}]}, {"body": "Aren't they talking about delisting BABA? What happens if they do? Does everything expire worthless?", "score": 1, "replies": []}]}, {"body": "As a GME gangbanger, I felt super bad for PLTR. They struggled at opening, but I was hoping that after market wide dip, they’d rebound. \n\nFortunately, they are recovering a smidge in AH trading.", "score": 43, "replies": [{"body": "that front page post basically sums it up for PLTR gang\n\nhttps://www.reddit.com/r/wallstreetbets/comments/krr8qs/when_the_markets_hit_an_alltime_high_and_you_dont/", "score": 20, "replies": []}, {"body": "Yeah, for my pltr brothers i was hoping for a green day for everyone", "score": 4, "replies": []}, {"body": "PLTR has been sideways since Nov. So many other opportunities out there since then, they're wasting their money bag holding it. It printed after the IPO there's no reason to get transfixed on one stock", "score": 3, "replies": []}]}, {"body": "Love these recaps. By some miracle I managed to score on both ICLN and TRLY calls resulting in my first big wins on the market ever. Too bad i'm not rich and don't have a million dollar screenshot to post.", "score": 17, "replies": [{"body": "First ones on the house. You’ll lose it all tomorrow 🤙🏻", "score": 10, "replies": [{"body": "You forgot the obligatory “ask me how I know”", "score": 2, "replies": []}]}, {"body": "Doood same... doubled my money on MT calls I bought with the wrong expiration date of Friday (meant to buy next week). Whopping $100 gain lol", "score": 1, "replies": []}]}, {"body": "Ryan Cohen:\n\nhttps://twitter.com/ryancohen/status/1346943412663177218?s=21\n\nThat made me hard.\n\nGME: 🚀🍆🚀🍆🚀🍆🚀", "score": 32, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 14, "replies": []}, {"body": "Thanks news daddy, you forgot to mention TSLA has a PT of 🌝", "score": 12, "replies": []}, {"body": "This is great. Please keep it coming!", "score": 10, "replies": []}, {"body": "Man fuck CNBC and Bloomberg this is where it’s at, keep making these please", "score": 9, "replies": []}, {"body": "Best thing I’ve read today. Thank you.", "score": 5, "replies": []}, {"body": "after today wouldn't be shocked if we'd see control the narrative back in here", "score": 5, "replies": []}, {"body": "Jack Ma on vacation lol", "score": 8, "replies": [{"body": "Father Guido Sarducci is still dead.", "score": 1, "replies": [{"body": "Haha", "score": 1, "replies": []}]}]}, {"body": "Thank you kind sir!", "score": 4, "replies": []}, {"body": "This autist posting this for FREE!", "score": 4, "replies": []}, {"body": "Some other good options in the space\n\n[https://listblender.com/2020/12/29/top-5-cannabis-stocks-for-2021/](https://listblender.com/2020/12/29/top-5-cannabis-stocks-for-2021/)", "score": 4, "replies": []}, {"body": "So what do I do with my 2/19 10c on TLRY? \n\nAnd are my SNAP 2/19 $55 calls gonna print ? That’s tech right ?", "score": 3, "replies": []}, {"body": "Subscribe", "score": 5, "replies": []}, {"body": "solid work", "score": 2, "replies": []}, {"body": "Thank you so much for these, most entertaining thing I’ve read the last few days", "score": 2, "replies": []}, {"body": "Nice, thanks!", "score": 2, "replies": []}, {"body": "This is great, thanks", "score": 2, "replies": []}, {"body": "Thoughts on my AMD 3/19 calls $110? And INCL long calls? Idk what the fuck leaps are", "score": 2, "replies": [{"body": "Long ass calls foo", "score": 1, "replies": []}]}, {"body": "Fun fact : Perdue in french literally translates to \"lost\"", "score": 2, "replies": []}, {"body": "Fucking love this", "score": 2, "replies": []}, {"body": "How do I subscribe to ur newsletter", "score": 2, "replies": []}, {"body": "No TSLA recap?", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Just be a patriot and buy tesla. Literally free money", "score": 2, "replies": []}]}, {"body": "you missed Corsair up bigly too today after a few days of deep red", "score": 0, "replies": []}, {"body": "Man what a fucking day", "score": 1, "replies": []}, {"body": "good stuff bro, keep it up!", "score": 1, "replies": []}, {"body": "Thanks love reading you", "score": 1, "replies": []}, {"body": "Can someone tell me why my was flat and all other steel companies saw tendies?", "score": 1, "replies": [{"body": "Because I have calls in it. \n\nSetup still very bullish. It seems to have a tendency to jump randomly. But follows trend.", "score": 2, "replies": []}, {"body": "My guess is that US based steel jumped bc Biden wants \"buy american\" infrastructure projects and MT is euro based?  So MT can still pump on overall steel supply/pricing over coming months but not bc of a US senate binary event.  (This is literally a total guess)", "score": 1, "replies": []}]}, {"body": "Solid recap, thank u fellow retard.", "score": 1, "replies": []}, {"body": "Love your updates. However, I don't really agree with the AAPL cash secured puts with those Jan 15 dates and strikes, although the Feb ones seem not too bad. If your an Apple bull, you would not be disappointed buying and holding at $120 for the next earnings. If you are Theta gang, you can earn a lot more premium with in a week with $12k on other stuff. 3% for a month and a half of work is so-so.\n\nBABA spreads look good though. I think it's bottomed and will slowly creep back upward. Agree with assessment on Jack Ma and delisting.\n\nKeep up the good work!", "score": 1, "replies": []}, {"body": "Thanks for the summary. I was excited seeing green until our freaking capitol was stormed. My biggest regret is selling out of Smith and Wesson last week. They climbed 20% today thanks to the Georgia race and DC fiasco.", "score": 1, "replies": []}, {"body": "I like these. Keep em comin", "score": 1, "replies": []}, {"body": "Man I love These thanks so much!", "score": 1, "replies": []}, {"body": "Finally I can pinpoint why I like these reports. Not one example of that freshman-level flowery style where stocks drop down like the OP's mom's panties after fourth beer etc.", "score": 1, "replies": []}, {"body": "Some legend hyped me up to buy leaps on Mara at like 4 am and I got a spread cuz I’m a broke bitch but I’m up 40%. Should’ve asked my girl to front me my 600$ stimmy while I wait for that shit in the mail", "score": 1, "replies": []}, {"body": "Welcome back Chimpu", "score": 1, "replies": []}, {"body": "Guys, anyone know when the squeeze is going to burst? We speaking of days, weeks or months? \n\nNoob here btw.", "score": 1, "replies": []}, {"body": "SM to the moon!", "score": 1, "replies": []}, {"body": "awesome write up :D", "score": 1, "replies": []}, {"body": "Is there a way to subscribe to these Reeeeeecaps?", "score": 1, "replies": []}]}
{"title": "Why $QQQJ isn't done - YUUUUUGE POTENTIAL", "selftext": "Tired of seeing ICLN and TAN posts and feeling FOMO because you missed the rocketship ETF? Well, look no further than QQQJ, an ETF which tracks the NASDAQ Next Gen 100 Index (the next 100 NASDAQ companies after the ones in QQQ). 🚀🚀🚀\n\nAs expectations for an economic recovery increase due to the incoming Biden administration, we should see continued growth in the stocks that comprise QQQJ, more so than the large-caps that comprise QQQ. This evidence can be seen by backtesting data provided on the NASDAQ website, which compares the performance of QQQJ against other mid-cap fund performance.\n\n&#x200B;\n\n[Back-tested 1-year returns](https://preview.redd.it/0vpf5800yw961.png?width=1008&format=png&auto=webp&s=209a318c5e67a98e8609022c2c2ffd6034485856)\n\n&#x200B;\n\n[Back-tested 10-year returns](https://preview.redd.it/nfmx41j1yw961.png?width=933&format=png&auto=webp&s=c232397f03f07eac82456b04bbdbbb5e008b2aa8)\n\nSome of its more well-known holdings include recently beat-down companies such as:\n\n* ROKU (down 5% from December highs)\n* TTD (down 20% from December highs)\n* BYND (down 18% from December highs)\n* DKNG (down 10% from December highs)\n\nDespite this beatdown of its more famous holdings, it's still almost back to pre-December crash highs. More importantly, the premiums on its calls are still lower compared to other similarly priced ETFs.\n\nThe incoming volatility from the swearing in of a new president should also cause an IV spike.\n\nBut won't growth be limited because companies will move into QQQ as soon as they grow? Not necessarily - in a bull market, all stonks go up, including those in QQQ. If all stonks are going up, then everyone wins, but QQQJ wins more.\n\n# More confirmation bias:\n\nBelow is some historic data showing what happens when we have a Democratic president and a split or Republican-led Congress. Combine this with the Roaring Twenties, vaccine hopes, stimulus hopes, economic recovery hopes, and super hot growth potential in healthcare, tech, IT etc, and QQQJ rocket confirmed.\n\nhttps://preview.redd.it/lmn6ix83yw961.png?width=789&format=png&auto=webp&s=f278c0d3f7bf60b2676dda3f7421e703c7aedee0\n\n# Charts\n\nI've done some rudimentary crayon analysis on Tradingview, and as you all can see, we should see QQQJ at 35 sometime around March. This is based on the most bearish analysis I could find based on its current trend and macroeconomic conditions. As you can see, it's shown relatively stable growth thus far (aside from the crash in December).\n\n[Rudimentary Bearish Crayon Analysis](https://preview.redd.it/jdhzylf4yw961.png?width=1060&format=png&auto=webp&s=3b75e4174338e6161bf7467950f3512f840f3319)\n\nAlternatively, we could see hyper growth as the stocks in the Next Gen 100 Index rally based on an optimistic outlook from the potential redo of the Roaring Twenties, vaccine hopes, stimulus hopes, economic recovery hopes, and super hot growth potential in healthcare, tech, IT etc. Below is my best bull-case TA drawing:\n\n&#x200B;\n\n[Advanced Bull Crayon Analysis](https://preview.redd.it/fi72sz56yw961.png?width=931&format=png&auto=webp&s=c693b0b836a9f0b30a2b706821970d8088c95796)\n\n# HERE'S THE KEY POINT\n\nSome of QQQJ's holdings recently suffered major beatdowns and are poised for recovery.\n\nPremiums are higher than they were two weeks ago but still undervalued compared to similarly priced ETFs. June 35cs are going for $1.10 right now.\n\nBased on my ~~astrology~~ TA predictions, these should be ITM by March/April, at which time you can either sell the calls or just exercise them and sell the shares.\n\nBuzzwords:\n\nROARING TWENTIES VACCINE STIMULUS HYPE HEALTHCARE TECH IT RECOVERY STOCKS MOON ROCKET\n\n# Positions\n\n100x June 35c 🚀🚀🚀", "id": "kscrx2", "created_utc": 1610024357.0, "score": 213, "upvote_ratio": 0.95, "num_comments": 86, "comments": [{"body": "This sub really swings hard between posts on very in-depth analysis and really brain-wrecking shitposts\n\nI love this sub", "score": 122, "replies": []}, {"body": "I see three 🚀, so I assume you are a man of culture, I’m in", "score": 42, "replies": []}, {"body": "500 contract June 35c@0.65 Yolo OG QQQJ grandmaster checking in. We are going to be 40-45 at some point between now and expiry. I might have missed out on TSLA, but at least I didn’t miss out on QQQJ", "score": 26, "replies": [{"body": "Post positions...you spent 35k", "score": 11, "replies": []}]}, {"body": "I don’t know what this said but there’s a lot of pictures and words so im in", "score": 62, "replies": [{"body": "Funny how people are trying to make ETFs and indexes a thing in this sub.", "score": 11, "replies": [{"body": "You can buy options if you like\n\nPersonally I'd be up for a 3x qqqj etf but I don't see that happening any time soon.", "score": 8, "replies": []}, {"body": "There are options available on it. I mean one of the most popular plays on this sub are the QQQ, SPY, ARK funds and ICLN, which are all ETFs. You must be new on the sub if you think this is a recent phenomenon.", "score": 3, "replies": [{"body": "he is a robinhood-er probably. no options there.", "score": 1, "replies": []}]}]}]}, {"body": "You spelled huge with a y. You must be cool mf, I am in", "score": 26, "replies": []}, {"body": "Your DD covers the reasons why I am in this stock, but it sucks that it hasn't really moved the last few days. Either way, QQQJ to Saturn 🚀🚀🚀", "score": 13, "replies": [{"body": "QQQJ is a grower not a shower", "score": 7, "replies": [{"body": "QQQJ has been hiding the world's largest growing rocket to protect us from whiplash on our way to Saturn's 🚀🚀🚀🚀", "score": 3, "replies": []}]}]}, {"body": "I have been in QQQJ since I saw some random comment on it a few weeks back. Up over 100% on the June 35c. Diamond hands this one.", "score": 8, "replies": []}, {"body": "Nice backtesting but from 2009 to today QQQ made 670% and your QQQJ backtesting made 440% and for that reason i am out\n\n[https://www.macrotrends.net/stocks/charts/QQQ/invesco-qqq/stock-price-history](https://www.macrotrends.net/stocks/charts/QQQ/invesco-qqq/stock-price-history)", "score": 23, "replies": [{"body": "QQQJ has been out for 2 months", "score": 8, "replies": [{"body": "He backtested the qqqj since 2009\nPlease read the post before making comments", "score": 2, "replies": [{"body": "Shots fired", "score": 2, "replies": [{"body": "“BANG!! TIMEOUT BOSTON!”- Mike Breen", "score": 3, "replies": []}]}]}]}]}, {"body": "20 grand in this thing 🚀🚀🚀", "score": 8, "replies": [{"body": "same but x10^-2", "score": 8, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Lol that would be absolute autism. Imaging buying calls on a 3x leveraged QQQJ :D", "score": 15, "replies": [{"body": "I think this will be a good week for the QQQs I just grabbed some Jan 22 200c on TQQQ for 2.68.", "score": 3, "replies": []}]}, {"body": "you will not be so confident on consecutive down days. you can have a better risk profile holding qqqj options.", "score": 8, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "What's your cost basis?", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "That's awesome. I almost pulled the trigger on 800 shares at about that price in March. Too bad almost doesn't count for shit haha. I was too afraid of another crash. Fml", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}, {"body": "100% agree I've been running a TQQQ heavy portfolio for a while now and the daily re-leverage makes it dominate everything. Do you also run UPRO or just stick with the QQQ heavy exposure?", "score": 1, "replies": []}]}, {"body": "The advanced bull crayon analysis is all I need 🚀🚀🚀🚀", "score": 7, "replies": []}, {"body": "I got a little nervous I was blowing all my money after that December but the last two days have been amazing. We’re just beginning 🚀🚀🚀", "score": 6, "replies": []}, {"body": "Fixed your graph for you.\n\n&#x200B;\n\nNeeded a big red rocket.\n\n[https://imgur.com/a/bv2hYEq](https://imgur.com/a/bv2hYEq)", "score": 9, "replies": [{"body": "Fuckin mint", "score": 1, "replies": []}]}, {"body": "TTD, one of the largest holdings in QQQJ, is down 20%. When that baby rallies it’s tendie town", "score": 5, "replies": []}, {"body": "I have 10x June 35c, you son of a bitch better be right!", "score": 4, "replies": [{"body": "Same here, +125 shares and some yolo Jan 35c that went nowhere. I was worried during the past two weeks for the June calls, but im way more optimistic now if the market keeps that momentum going.", "score": 4, "replies": []}]}, {"body": "Something about all these QQQJ posts make them feel like shills and not DD.", "score": 7, "replies": [{"body": "I mean, its an ETF, not a stock. Not like you can pump and dump it.", "score": 21, "replies": [{"body": "If you have options you can pump the IV since the IV is normally super low.  WSB caused the option prices to go up huge a few weeks ago.", "score": 11, "replies": [{"body": "That kind of only matters if youre trying to dump. That pump a week ago was nice but I didnt sell a single contract, theres way more money to be made riding the bull run to expiry.", "score": 4, "replies": [{"body": "I wasn’t saying that you were doing it but rather that it could be done.", "score": 5, "replies": []}]}]}]}]}, {"body": "I see a long post, im in.", "score": 3, "replies": []}, {"body": "Fuck a peloton and marvel . We will get some new bad bitches to take their place", "score": 3, "replies": [{"body": "Did they announce which stocks are taking their places?", "score": 1, "replies": [{"body": "Not that I could find . I’d assume it’s the lowest 6 of qqq but I couldn’t find anything that actually confirmed that", "score": 1, "replies": []}]}]}, {"body": "Bull crayon sold me. Buying at open", "score": 3, "replies": []}, {"body": "I'M IN", "score": 3, "replies": []}, {"body": "I sold my calls today so it can only go up, no need to thank me", "score": 3, "replies": []}, {"body": "Been holding 32 2/19 C and they have been printing bigly even got my gf to buy a call.  If you have any extra cash i highly recommend this stock.", "score": 3, "replies": []}, {"body": "I'm poor, I think I'll have to go with the 06/18 40c then.", "score": 3, "replies": []}, {"body": "I was calling QQQJ back at 28 and people were more interested in Tesla.", "score": 3, "replies": [{"body": "35 by February lol", "score": 2, "replies": [{"body": "It seems it may hit $35 **in** February. What's your next play, I want in.", "score": 3, "replies": []}, {"body": "35 by March for me", "score": 1, "replies": []}]}]}, {"body": "June 33c checking in 🚀🚀🚀", "score": 2, "replies": []}, {"body": "100x 40c 6/18 checkin in!", "score": 2, "replies": []}, {"body": "Wait you're telling me to buy something? SOLD!", "score": 2, "replies": []}, {"body": "I'm in for shares and calls. See you on the moon, brother!", "score": 2, "replies": []}, {"body": "I was a bit miffed watching my other calls jump 10-50% these past few days, but was today a BANGER. Only a measly 17x QQQJ $35c for me at the moment, but I am ready for tendie town on Venus 🚀🚀🚀🚀", "score": 2, "replies": []}, {"body": "Just tell me exactly what I'm supposed to do", "score": 2, "replies": [{"body": "6/18 35c", "score": 4, "replies": [{"body": "This is the way", "score": 3, "replies": []}]}]}, {"body": "Calls printing this morning, thanks retard", "score": 2, "replies": [{"body": "Whale cum", "score": 2, "replies": [{"body": "🐋🍆💦", "score": 2, "replies": []}]}]}, {"body": "June 35c in the money already!", "score": 2, "replies": []}, {"body": "Did u sell?", "score": 2, "replies": []}, {"body": "Ummm, I don't remember a December crash....does that mean I am a boomer?\n\nBut seriously, this etf sounds like it is loaded with wfh stocks that exploded last upwards last year. We have 6-9 months left at home.\n\nWhat are thoughts on what these stocks will do then?", "score": 1, "replies": [{"body": "uh..go up for 6-9 months? who cares about after. switch to a travel etf down the road", "score": 2, "replies": [{"body": "Why chase stocks that people are already rotating out of? \n\nNow is the time to get in to stocks that will lead the market in 6-9 months. \n\nI don't want to hold stocks that will most likely go down for the next 6 months. Maybe there are some good ones in there but the ones you listed seem iffy right now.\n\nGood luck.", "score": 1, "replies": [{"body": "You have it backwards, people are going to be rotating out of nasdaq100 into nasdaq100-200 stocks (aka qqqj). Theyre not going to completely rotate out of qqqj once WFH is done and qqqj is not even super WFH heavy, look at the holdings. If you want to see what rotation looks like, watch what happens to ARKK later.", "score": 2, "replies": [{"body": "Are you saying that following a move from the nasdaq100 to the 100-200 there will be a flow out of ARKK to small/mid caps/recovery?", "score": 1, "replies": []}]}]}]}, {"body": "Pepperidge Farms remembers.", "score": 1, "replies": []}]}, {"body": "shhhhhhhh we don't need to talk about this one here", "score": 1, "replies": []}, {"body": "Got it. PLTR all in. 🚀🚀🚀", "score": 0, "replies": []}, {"body": "Call it what is, the B team not Next Gen.", "score": 0, "replies": []}, {"body": "Why not just get ark or betz or one of the other ETFs that includes some of the best picks within qqqj?", "score": -1, "replies": [{"body": "For options, the IV on ARKK and BETZ are insanely high. Premiums on QQQJ are much cheaper relatively", "score": 1, "replies": [{"body": "got 19x shares at $1.2 per contract. options noob here. how do you check if the IV on a given contract is too loo or too high? thank you!", "score": 1, "replies": []}]}]}, {"body": "im in", "score": 1, "replies": []}, {"body": "Dumb question: Let’s say you have a solid company in the NASDAQ Next Gen ETF that’s like 110th position and it pops big. If it gains a lot of momentum and then leaves the QQQJ (to join the QQQ), wouldn’t that be bad for this ETF? Because you lose a winner?", "score": 1, "replies": [{"body": "QQQJ only reconstitutes once per year, and the value would stay the same after they rebalance with new additions", "score": 9, "replies": [{"body": "Which year month does the rebalacing happen?", "score": 1, "replies": [{"body": "It happened in December last year but it was its first year in existence and it was formed in October. Maybe it will be done again in December this year.", "score": 2, "replies": []}]}]}]}, {"body": "I'm in! 🚀", "score": 1, "replies": []}, {"body": "I am confidently in QQQJ for the long haul.\n\nHolding 500 shares and 5x Jun 18 35cs. Adding more whenever it dips.", "score": 1, "replies": []}, {"body": "I’m in", "score": 1, "replies": []}, {"body": "FNY is a better mid cap etf imo", "score": 1, "replies": []}]}
{"title": "DD: AMD is undervalued 🚀", "selftext": "DD time retards.   \n\n\nAMD. Ya heard of it? No, not American Mini Dicks, thats your 2nd favorite subreddit. I'm talking Advanced Micro Devices.   \n\n\nWhat does AMD do? They make CPU and GPU's. What do those do? Well without computer processors, you wouldn't be able to yolo your life savings on OTM options, and your wife wouldn't be able to send nudes to her boyfriend.  GPU's are cool too. Right now NVDA is making the best GPU's. But AMD is 2nd best! NVDA is currently trading at 529.78. That's pretty good. But AMD is only trading at 94.95!   \n\n\nI know that youre thinking little buddy. If AMD is making the 2nd best GPU's, shouldn't they be a little closer? That's right retard. But there is more.   \n\n\nAMD makes CPU's too. Those are rad. In fact, AMD is making some of the best processors in the world right now. That's a big deal, CPU's are used in everything. Probably takes some really smart nerds to make those. Not anybody can do that.   \n\n\nIntel is falling behind in the competition, and AAPL is starting to make their own CPU's. That leaves the rest of the market for AMD.  Surely lots of companies (HP, Dell, Lenovo) will want to use the BEST (AMD) CPU's in their desktops and laptops. And they are already trending that way. Some of the best computers you can buy right now have AMD processors. That's right, your favorite porn machine might have an AMD processor in it right now.   \n\n\nYOU KNOW WHAT ELSE HAS AN AMD CHIP IN IT?  \n\n\nEVERY XBOX SERIES X AND PLAYSTATION 5. That's right. If you didn't waste your stimmy on one of these consoles, your wife's boyfriend probably did. And if he didn't buy one for himself, he probably bought 2 or 3 for your kids. Theyre everywhere. These things are selling out everywhere, and we all know it. The processing power that allows you to look at those sweet cyberpunk tits is all thanks to AMD.   \n\n\nBut what gives? AMD is in every Xbox and PlayStation, their stock hasn't moved much since those releases..  \n\n\nThat's right, youre getting it! Lisa Su is gonna drop a big fat bomb on the shareholders this month during earnings, letting everybody know that they made millions. (Probably)  \n\n\nAMD is undervalued.   \n\n\n90c 3/19  \n\n\n \n\n# 🚀\n\n#", "id": "ksil1w", "created_utc": 1610042111.0, "score": 84, "upvote_ratio": 0.86, "num_comments": 77, "comments": [{"body": "AMD for the first time in 15 years now has over 50% of the desktop cpu market share 👀", "score": 45, "replies": [{"body": "Their huge run over the past few years could be tiny compared to what happens if they can somehow pull off a similar market-share-take in the server space.  Last I read Intel was still above 90% in the server space.", "score": 6, "replies": [{"body": "They are taking it.  It was slowly happening.  Now it’s happening a lot faster.  Still its a huge market to penetrate.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 26, "replies": [{"body": "go on", "score": 11, "replies": [{"body": "AMD may announce an ARM competitor chip on the 12th at CES", "score": 8, "replies": [{"body": "Without the ARM architecture? Seems boneheaded.", "score": 0, "replies": [{"body": "AMD owns an ARM Architecture License. Thats not the plebian \"pay per unit sold\" looser license. Its the True One, the one that also Apple, Samsung and Qualcomm have. Its Basically: AMD payed ARM upfront a long time ago, now ARM must give AMD full access to the Instruction Set and all updates and AMD can make and sell their own Chips based on that Instruction set without paying anything, they would only have to pay if they would use ARMs own Chipdesigns. But why should they, when they can design their own chips, like Apple does.", "score": 3, "replies": [{"body": "I read that they would have a competitor \\_to\\_ ARM instead of making an ARM chip to compete. My mistake.", "score": 1, "replies": [{"body": "That was my bad, unclear wording in my original comment.", "score": 1, "replies": []}]}]}, {"body": "The rumor is that they have it already.", "score": 2, "replies": []}, {"body": "This DD kind of sums it up well \n\nhttps://www.reddit.com/r/wallstreetbets/comments/khk1ew/amd_s_lisa_su_and_her_shiny_new_armed_rocket/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 2, "replies": []}, {"body": "They have RISC-V which is competitive.", "score": 1, "replies": []}]}]}]}]}, {"body": "\"Undervalued\".. Up 90% on the year.. earnings this month.  100c it is", "score": 24, "replies": [{"body": "I'm pissed they didn't hit 100 eoy. I was hyped getting back into AMD and they fucking dropped the ball last second. Hope they start climbing again", "score": 7, "replies": []}, {"body": "Well GME was up 220% on the year so undervalued seems like a fair way to describe AMD", "score": 4, "replies": []}, {"body": "I got in at 97 a month ago with June $130’s. Just waiting with bated breath.", "score": 1, "replies": []}]}, {"body": "I've been missing out on AMD profits for years, I don't intend to stop now", "score": 20, "replies": [{"body": "With that attitude you'll preserve your cash in no time!", "score": 1, "replies": []}]}, {"body": "Damn that’s crazy. But have you heard of this company called Tesla? They’re pretty neat", "score": 59, "replies": [{"body": "I keep trying to convince myself to buy $1k calls but I know as soon as I buy in it’ll tank", "score": 16, "replies": [{"body": "so buy 1k calls and then buy 100 puts. literally can't fail", "score": 6, "replies": [{"body": "Yeah I was thinking of doing that, I’ll prob do it Monday or tomorrow morning", "score": 1, "replies": []}]}]}, {"body": "Tesla is looking to switch to AMD chips per new reports last year.  \n\nTesla 🚀🚀🚀= AMD 🚀🚀🚀🛸🛸", "score": 11, "replies": []}, {"body": "Tesla has potential. Amd is up 3000% on the 5year but tesla is up 1600% which is respectable", "score": 5, "replies": [{"body": "Tesla indeed has potential. And that's all it has. Because it doesn't have profit. Or tech. Or actual majority market share.\n\nBut Tesla is the dream stock. Because only in your dreams would you ever collect a return on it if you held it forever.", "score": 3, "replies": [{"body": "Tesla doesn’t have tech 🧐 BAN", "score": 8, "replies": []}]}]}]}, {"body": "are you new here retard? AMD has literally been the meme stock of WSB in 2018 and since. I'm sure half here are 120c march including me", "score": 16, "replies": [{"body": "1/15 $90c, 3/19 $100c, 6/18 $120c. Su Bae gonna deliver. The best is yet to come!", "score": 4, "replies": []}, {"body": "Ive been trading stocks since you were suckin milk from your mums tit. Im saying even at 90+, AMD is undervalued. Go buy some", "score": 10, "replies": []}]}, {"body": "Comparing share prices without regard to market cap, a true retard move", "score": 12, "replies": [{"body": "Why else would I be here", "score": 4, "replies": []}]}, {"body": "In with shares and feb $92.5 calls since last year! Ride the red rocket boyz", "score": 7, "replies": [{"body": "Our wives ride red rockets, and we should too dammit. AMD to the moon.", "score": 5, "replies": [{"body": "remember that south park episode about red rockets", "score": 4, "replies": []}]}]}, {"body": "I take offense with the OP’s post   How does he know I’m American?  Got dick size right, but other assumptions wrong.", "score": 7, "replies": []}, {"body": "holding at 77 this is a late realization op", "score": 6, "replies": []}, {"body": "$AMD? DAE hidden gem?", "score": 6, "replies": []}, {"body": "Su Bae hasn't failed us yet.", "score": 5, "replies": []}, {"body": "You should compare market caps, not stock prices. Still, Nvidia has three times the market cap of AMD.", "score": 4, "replies": [{"body": "Yeah that was just a tidbit. The meat of the post is still solid", "score": 3, "replies": []}]}, {"body": "GL. My Jan $100C is fked.", "score": 8, "replies": [{"body": "Yea fuck mine expire on the 15th", "score": 3, "replies": [{"body": "Same lol", "score": 2, "replies": []}]}, {"body": "Roll it out... you need to let amd see earnings", "score": 2, "replies": [{"body": "I think they will outperform in earnings but I don't think their stock will move much from it TBH, maybe even drop slightly. But a week or two after it will shoot up. But then again, AMD so close to $100 it will prob magnet up. who knows", "score": 1, "replies": []}]}]}, {"body": "Yolo time", "score": 3, "replies": [{"body": "Youre god damn right.", "score": 3, "replies": [{"body": "Literally putting everything I have into tesla and amd", "score": 6, "replies": []}]}]}, {"body": "Amd has supply issue doesn't it? Or is that solved. Tsm has more room to grow", "score": 3, "replies": [{"body": "Nope, the whole industry has supply issues.\n\nEverything but AMD’s game console chips are in short supply. NVidia has the same issue even though they went with Samsung.", "score": 2, "replies": []}]}, {"body": "Been looking at my 2/19 90c going down like 'wtf'\n\n....\n\nUntil today!", "score": 3, "replies": []}, {"body": "You spelled AM C wrong", "score": 2, "replies": []}, {"body": "I put 14k into 3/19 100c around 3:50pm today. Gonna moon this month. Big announcements on the 12th.", "score": 2, "replies": []}, {"body": "wow actual DD with an ITM call months out DTE?", "score": 2, "replies": []}, {"body": "Will YOU SHUT UP MAN??! I can't let WSB know about my golden goose egg. It's been making me money bigly. Been in AMD for years now and they keep working hard. Your DD is exactly in line with what I believe. I don't think Options are the play with AMD though. They move when they want to. So you gotta buy and hold them, but soon in the next year or two, their stock will gain momentum towards 200.. just you wait.\n\n\nAnd you don't bet against Dr. Su.", "score": 2, "replies": []}, {"body": "Bullish af on AMD, but considering how AMD and Nvidia can barely supply like 10 graphics cards/cpus a week right now, this upcoming earnings will blow", "score": 2, "replies": [{"body": "The 3600, a processor thats over a year old, is still going in and out of stock a major retailers. Their new Ryzen series can't stay in stock for more than five minutes.\n\nPeople are ordering old graphics cards as placeholders for the new series, which is surely helping AMDs bottom line.\n\nNvidia to the moon, AMD to mars with Elon and Tesla.", "score": 6, "replies": []}, {"body": "Thats true, but they also created the brains of every Xbox and PlayStation. You think Lisa Su took a bad deal on those?", "score": 1, "replies": [{"body": "At the price point that consoles have to sell at I'm not confident AMD is making any significant margin on the GPU's and processors in the consoles.", "score": 3, "replies": [{"body": "Microsoft and Sony take those losses amd rakes in the bags for every console made", "score": 5, "replies": []}, {"body": "Their revenue was about $100/chip.\n\nThis time around it’s apparently less up front (but more a few years from now), let’s say $80+\n\nYou’re still looking at more than half a billion in revenue. Check PS5 sales figures. They’re gonna move north of 10M XBOX and PS5 chips this year imo.", "score": 1, "replies": []}]}]}]}, {"body": "New blood joins this Earth\n\nAnd quickly he's subdued", "score": 1, "replies": [{"body": "Subdue these nuts", "score": 1, "replies": []}]}, {"body": "AMD has been overvalued for a while.   \n\n\nAMD is going to $108 - $115 by the end of the month.  🚀  🚀  🚀  🚀", "score": 1, "replies": []}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**AMD**|**$90**|**BUY CALL**|**2021-03-19**|**$11.2**|**$94.38**|**27704**|**929**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckjn617vmdd260701tqyu5xla) | [Track Record](https://www.pickmojo.com/user/JakeG127/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "I am in", "score": 1, "replies": [{"body": "See you on the moon little buddy", "score": 1, "replies": []}]}, {"body": "idk man 90c seems kinda safe to me, you think they gonna get to 120 by march?", "score": 1, "replies": [{"body": "Yolo. Joe B is gonna print money, and Lisa Su is gonna Lisa Su. Im in", "score": 3, "replies": [{"body": "fuck it, lets do this Shit 🚀", "score": 1, "replies": []}]}, {"body": "I got a buddy who bought 6/10 150C and I'm like dude that's a bit much even for someone who believes in AMD like me. But I respect it. I hope this year is a good one for em.", "score": 1, "replies": []}]}, {"body": "Got it! I am all in!!\nI yoloed 1mil stock and options on AMD (on margin) but still in the red due to the dip last month.\nHope they will print or I will be broke!", "score": 1, "replies": []}, {"body": "Without ARM chips AMD could end up like Intel. However I am sure Lisa Su already has this in the pipeline.", "score": 1, "replies": []}, {"body": "\" GPU's are cool too. Right now NVDA is making the best GPU's. But AMD is 2nd best!\"\n\nAMD is literally the only other option.", "score": 1, "replies": []}, {"body": "AMD is completely undervalued.  I own $10k in shares.\n\nI also build high end gaming computers.  I have somehow found a 5950x and its fucking great!  All of my friends and I migrated to AMD from Intel.  AMD is making waves.", "score": 1, "replies": []}]}
