{"title": "Extraordinary market situation for Tesla (TSLA) right now. Musk is selling 10% of his holdings. I found daily repeating patterns, is it poss", "selftext": "Ok so I there is an extraordinary opportunity to trade Tesla right now\n\n# How it started:\n\n[https://twitter.com/elonmusk/status/1457064697782489088](https://twitter.com/elonmusk/status/1457064697782489088)\n\nAs per this tweet he announced to sell 10% of his stocks, which was at the time of his tweet: 172,6m ordinary shares\n\nHe started on monday 8th november and started selling. We know exactly how much he sells each day since he needs to file those numbers to the SEC. You can find them here: [click](https://ir.tesla.com/sec-filings)\n\nThis is the proof he is really selling as announced.\n\nYou may check this article to see its legit:\n\n[https://www.marketwatch.com/story/elon-musk-sells-tesla-stock-in-plan-set-before-twitter-poll-sec-filing-shows-11636591389](https://www.marketwatch.com/story/elon-musk-sells-tesla-stock-in-plan-set-before-twitter-poll-sec-filing-shows-11636591389)\n\n# How it is going:\n\nI found this graphic on Twitter which visualizes his sales in relation to the performance of the Tesla share price: [here](https://twitter.com/RawBooty2/status/1459121681549733893)\n\nThis shows that Elons sales continously move the price downwards. Please note that the graphic wasnt updated for fridays sales yet. I will update it as soon as its available.\n\n# Now the interesting part We know how many shares he still has to sell !\n\nIt is 17,3m shares (10% of 172,6m) minus what has been sold already.\n\n**So that is 10,8m shares left for sale** since we know from SEC files he sold 6,5m shares until friday.\n\nI copied all the SEC files in one Excel document and calculated the sales volumes.\n\n&#x200B;\n\nIf we assume he will continue to sell 500k - 1,2k shares a day as he did the last three days that means **he will be selling for another 9-23 trading days**.\n\nSo how do we use this knowledge ?\n\nWell I assume and the chart proves it that the buyers will not be willing to jump in front of the bus while Elon dumps his shares. So there is a really good chance we see lower prices until he is done.\n\nUnfortunately i cant include pictures in this post. I will give you guys a link to a post with pictures in the comments.\n\nThere was a rise in SP on Wednesday but he filed his first SEC report on Wednesday evening.\n\nSo ever since it is public knowledge that he **really** started selling and how much he sells it was going down.\n\n# How to play it:\n\nI see several possibilities to take profit from this knowledge\n\n1. Hold puts until Elon is almost done\n2. Sell a part of holding now and buy it back later at lower prices (some say thats what EMusk might intend to do)\n3. Hold puts until Elon is done and reinvest your gains in calls\n4. Look at the daily patterns, caused by Elons broker dumping shares\n\nAgain, i cant post pictures here. I will include the link to the pictured post in the comments.\n\nYou might notice that each day from Wednesday to Friday starts with a dip and then a mini rally which peaks between 10:30 AM and 11:00 AM. Followed by descending prices through the day.\n\nCurrently i am holding puts which i bought last monday and wednesday.\n\nI am no financial advisor and please dont regard this as any form of advice or recommendation.\n\nPlease do your own due dilligence!\n\nEdit updated numbers due to a mistake with fridays sales volume", "id": "qtzgu6", "created_utc": 1636923980.0, "score": 74, "upvote_ratio": 0.74, "num_comments": 86, "comments": [{"body": "Yeah no thanks I’m not shorting tsla I don’t feel like getting my face ripped off", "score": 154, "replies": [{"body": "I’m not Elon Musk and I agree with your assessment.", "score": 23, "replies": []}, {"body": "Looking forward to OPs WSB Loss or Gain porn thread.", "score": 9, "replies": [{"body": "The visualbot hates me. I can share it here", "score": 1, "replies": []}]}, {"body": "Buying puts isn’t shorting", "score": 1, "replies": []}]}, {"body": "Right away you're suggesting to buy puts while the IV is high, you really shouldn't do that. IV crush will, you know,  crush you. There is very little evidence that the price is going to move downward enough to actually make much money and the downside risk is massive. Sell leap puts instead, I sold one last week and collected 27k in premium which I can buy shares with and ride the pop when he done selling.", "score": 31, "replies": [{"body": "I bought leveraged open end knockout puts on monday and wednesday. And currently i couldnt complain about rewards.", "score": 3, "replies": [{"body": "Monday was the day to buy puts for sure, too late now though.", "score": 0, "replies": []}]}]}, {"body": "He sold 1.2m shares on Friday alone for a total of 6.3m so far or 37% of total. That's an average of 1.2m a day. So at that pace he should be done in around 8-9 days", "score": 18, "replies": [{"body": "You have summed the sales for friday and thursday.", "score": 2, "replies": [{"body": "Nah check the f4 filings. 639k shares on Thursday and 1.2m on Friday.", "score": 6, "replies": [{"body": "Oh you are right. Weird dont know what went wrong\n\nThanks for bringing it up!", "score": 4, "replies": []}]}]}]}, {"body": "Lots of poor people right now that held puts and/or shorted Tesla. No thanks", "score": 63, "replies": [{"body": "Im one. Have lost tens of thousands shorting pre-covid.", "score": 19, "replies": [{"body": "Ouch", "score": 7, "replies": [{"body": "Still hurts.", "score": 8, "replies": [{"body": "I hope you learned from it", "score": 3, "replies": []}]}]}]}]}, {"body": ">\tFurthermore he filed to the SEC that he will sell back in September, so the Twitter poll was a show.\n\nThis is only true for the options he exercised and shares he sold to pay the tax. The shares sold Tuesday through Friday had no such disclosure.", "score": 23, "replies": [{"body": "Ah yes youre right. I removed that part to avoid misleading information", "score": 7, "replies": []}]}, {"body": "I buy 1 share of tesla when it trading close to $999, if it go lower I can avg down, if it go back up, I can hold it or take profit later.", "score": 9, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Psychology is important in investing, if a trick can help you stay the course its worth using it simply for that reason.", "score": 2, "replies": []}]}, {"body": "\\~1T company today. Multi-trillion before the end of the decade.\n\nBuy. Hold.\n\nBecause the people that do their research know they're going to grow auto sales \\~15-25x and storage by \\~200-300x. And that's just TWO of their business ventures.", "score": 0, "replies": [{"body": "For the trading opportunity i have offered here it is totally irrelevant what they will do some day.\n\nYou dont hold puts for years.", "score": 1, "replies": []}, {"body": "do inform us uninformed peasants how they're going to grow their auto sales by 15-25x and storage by 200-300x? Also, you do know that the extreme sales growth is already baked into the price, so in a rational market the price would have to grow at the normalised cost of equity?", "score": 1, "replies": [{"body": ">1: how they're going to grow their auto sales by 15-25x  \n>  \n>2: and storage by 200-300x?  \n>  \n>3: Also, you do know that the extreme sales growth is already baked into the price,  \n>  \n>4: so in a rational market the price would have to grow at the normalised cost of equity?\n\n1: The largest and most dense battery manufacturing ramp up of all auto makers. Berlin and Austin are both going to initially start at \\~100GWh of installed capacity and Berlin is going to ramp to \\~250GWh as the additional phases are built. That alone is the more output as VW's proposed \\~dozen factories spread across the EU. And you'll see that at all factories going forward.\n\nAnd by 'all factories' I mean enough to support 20M annual units. There will be a 2nd Chinese factory, an Indian factory, a 3rd North American factory, a 2nd EU factory. All built before the end of the decade. Assuming \\~2 factories built at a time and \\~1.5-2 years per batch, they can get it done.\n\n2: Megapack/powerwall factories, local to cell production.\n\n[https://insideevs.com/news/542298/tesla-builds-40gwh-megapack-factory/](https://insideevs.com/news/542298/tesla-builds-40gwh-megapack-factory/)\n\nThey're going to move from \\~5GWh of megapack capacity to \\~40GWh with one new build. If megapack factories are anything like their auto factories, expect the 1st to be smaller as they grow larger with each iteration. This factory is local to Fremont and Sparks. Expect more, local to Austin, Berlin, Shanghai, and all the other to-be-built locations. They're nowhere near done.\n\n3: Sure, stocks are forward looking. Tesla also is not done on improving margins (which are stellar for the auto industry). But no one is pricing 15-20M units by 2030-32. Everyone with a \\~1000-1400 price target is looking at only \\~5-7M by 2030.\n\n4: Can you break this down for me? I'm the 'uninformed peasant' in this jargon.\n\nEDIT: Same goes to superchargers. They're making them in North America at their factory in Buffalo, NY and most recently a factory in China. At their rate of expansion and wanting to grow that network at a CAGR of 30% they're going to eventually manufacture them in the EU as well. And the SC network being open to all EV's is going to be another nice revenue stream.", "score": 0, "replies": []}]}]}]}, {"body": "Sure thing, Puts are only like $7,000 each.", "score": 6, "replies": []}, {"body": "ok short it and then show the gains later", "score": 17, "replies": [{"body": "I am short since last week monday. Can show the result if people are interested", "score": 1, "replies": []}]}, {"body": "There is a gap between 909 and 950 ish. I would expect it to land in that range if not lower.", "score": 5, "replies": [{"body": "People forget that just last month we saw $850.", "score": 7, "replies": []}]}, {"body": "I am not bullish at all on the stock, but I am also not taking any bearish position on this or touching it with a ten-foots pole.", "score": 10, "replies": []}, {"body": "Listen buddy I think TSLA is completely disconnected and should be nowhere near where its at. But by no means I think you should short. Literally the best thing to do with Tesla is do nothing. Listen to the magic conch shell. Don’t buy and dont short. This stock is basically the wild west of the market and Wall Street and Reddit loves to play games with this stock. Your betting this negative news is going to have an effect on the stock while in the past Tesla has typically not gone down on negative news and rather tends to overreact on positive news. I would not short this thing. Its basically a huge gamble at that point.", "score": 7, "replies": []}, {"body": "Question is how’s Nancy gonna play it?", "score": 4, "replies": []}, {"body": "Elon has until August 2022 to sell the shares. So, no one really knows when he's gonna be done with it. Also, until he sells the 10%, the shares are gonna be in a range. What I'm wondering is why aren't the others selling instead of holding in spite of prices not going anywhere?", "score": 3, "replies": [{"body": "Like this?\n\nhttps://twitter.com/DonutShorts/status/1458462793162792969?s=20", "score": 1, "replies": [{"body": "I mean if you have a company that should not be worth 1.3 trillion and you have the ability to sell, you would be financially irresponsible to not sell.", "score": 2, "replies": [{"body": "Exactly", "score": 1, "replies": []}]}, {"body": "I meant institutions and small investors who own millions of shares. I guess it's a matter of time. \n\nBTW, I liked the Twitter link you shared. Wonder is billionaires behave the same in other countries too? It's time to fix the loopholes.", "score": 1, "replies": [{"body": "Well mcap slipped about 150b USD already ..", "score": 1, "replies": []}]}]}]}, {"body": "This stock is one of the stocks that defies any logic. Why would you want to short it", "score": 2, "replies": []}, {"body": "Stock buyback = bullish\nCEO dumping stocks = bearish\n\nOnly idiots buy into the “selling stocks to pay tax” bullshit that Elon spewed out. There are a thousand ways for a person of Elon’s caliber to come up with liquidity to pay tax, selling long term stocks and pay capital gain tax is the last resort.", "score": 2, "replies": [{"body": "You clearly have no idea what the situation is and how this played out. He has options that expire and he had to buy 22+ million shares of the stock and gave him a profit of over $28 billion. He owes taxes on closing out these options. He owes $5+ billion in cash for taxes. He doesn’t have that sitting around. He sold to cover the tax bill. This was disclosed and known since sept. But back to your story and not having a clue why this took place", "score": 3, "replies": [{"body": "Who says 5b?\n\nhttps://www.cnbc.com/2021/11/07/elon-musk-faces-a-15-billion-tax-bill-which-is-likely-the-real-reason-hes-selling-stock.html\n\nThe number in the article was also in a twitter discussion involving Elons active participation\n\nYou can find it if you check his replies on his account", "score": 1, "replies": []}]}]}, {"body": "Here is the link to a post including the pictures which i couldnt post here.\n\nI hope the cross linking is not prohibited ?\n\n&#x200B;\n\n[https://www.reddit.com/r/Vitards/comments/qtny13/extraordinary\\_market\\_situation\\_for\\_tesla\\_tsla/](https://www.reddit.com/r/Vitards/comments/qtny13/extraordinary_market_situation_for_tesla_tsla/)", "score": 1, "replies": [{"body": "You sound like a shill who's never been on reddit before.\n\nCan you explain what is stopping you from including pictures in your own post?", "score": 1, "replies": [{"body": "Have you ever posted in this sub?", "score": 1, "replies": [{"body": "Yes, now answer the question.", "score": 1, "replies": [{"body": "I just couldnt technically post pics.\n\nAnd i wont upload them all to imgur just because someone decided i shouldnt be able to directly include them here", "score": 1, "replies": []}]}]}]}]}, {"body": "Updated the initial post to fix fridays sales volume and the projection of remaining sales time", "score": 1, "replies": []}, {"body": "Musk reported another 930k shares sold on monday", "score": 1, "replies": []}, {"body": "Musk reported another 930k shares sold on monday", "score": 1, "replies": []}, {"body": "Latest sales chart: https://mobile.twitter.com/rawbooty2/status/1460594744833282056/photo/1", "score": 1, "replies": []}, {"body": "Ok I'm convinced. Opening a major short position tomorrow. It's not like it's going to squeeze with an already 1 trillion dollar market cap.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "So how long til \"despair\"? Love to load up then.", "score": 4, "replies": []}]}, {"body": "*lights up a cigarette sitting at the corner of the dark room*\nShort TSLA they said...It will go down Bury said...I was young, full of life, more money than I could ever wish...I thought I knew where I was getting myself into......I can still see those long ass green candles...When I sleep I see green...I will never be the man I used to be......Feeling brave, young stud? Short it then hahaha, you were warned..", "score": 1, "replies": [{"body": "Its all a question of position size and risk reward ratio", "score": 2, "replies": []}]}, {"body": "Shorts doesn’t seem to learn from past mistakes. I also thought that TSLA was too high and thought shorts will have their day. I waited and waited but history shows otherwise. At this point TSLA is unstoppable beyond want Musk does.", "score": 1, "replies": []}, {"body": "TSLA is a dumpster fire, run away and let it burn.", "score": -3, "replies": [{"body": "Highest margins in the auto industry. 50% year over year growth on average every year. You call it a dumpster fire?", "score": 1, "replies": [{"body": "Oh I meant right now with Elon selling it like hot cake. I have my fair share of profits from Tesla. But I want to wait out for few weeks for all of this to settle", "score": 0, "replies": []}]}]}, {"body": "I think Bezos is selling too ?", "score": -1, "replies": [{"body": "Bezos has been consistently selling billions of dollars worth of Amazon shares every quarter for over a year now. With the total approaching over $20 billion now it's probably one of the biggest reasons that AMZN share price has stalled out.", "score": 6, "replies": []}, {"body": "Thats new to me. How do we know?", "score": 0, "replies": [{"body": "https://asumetech.com/bezos-sells-3-3-billion-in-amazon-shares-in-a-week/", "score": 1, "replies": [{"body": "He tends to do this every year though for a few billion in play money.", "score": 3, "replies": []}, {"body": "Soo... Race to mars incoming?", "score": 0, "replies": [{"body": "i wouldnt bet on it", "score": 3, "replies": [{"body": "Yeah most likely he will just get toilet paper and pasta in case we run out of it again", "score": 3, "replies": []}]}]}]}]}, {"body": "Elon is cash poor while Jeff is cash rich, and warren if Uber rich", "score": 1, "replies": []}]}, {"body": "I sold my shares and took my modest profits.", "score": 1, "replies": []}, {"body": "A lot of assumptions with little data behind them.\n\nHe is selling his stocks because of the taxes for his options that will expire next year, September I believe. He has up to then to sell the stocks. Nothing forces him to to continue selling now. He could let the stocks rebound this week and continue next week, he could continue next month.\n\nDon't try to time the market, you will likely lose.\n\nPersonally, I don't own Tesla shares, not puts and even if the stock drops back to 700-800 I would still think twice if I want to buy.", "score": 1, "replies": [{"body": "Yes we dont know his intentions.\nBut obviously its not his aim to sell the shares at the best possible return as we can see.\n\nSo either he just wants it done quick or there is a reason to hurry, which we dont know yet.\n\nhttps://www.cnbc.com/2021/11/07/elon-musk-faces-a-15-billion-tax-bill-which-is-likely-the-real-reason-hes-selling-stock.html\n\nSays 15b within the next months. So the timeframe is not as wide as you suggest", "score": 1, "replies": []}, {"body": "He has financial incentive to fill poorly to drop the value of the stock, since his stock options are taxed as income when exercised. Maximizing his return from LTCG and decreasing the tax hit from exercising is the optimal play for him if his ultimate goal is to increase equity with minimal tax hit.", "score": 1, "replies": []}]}, {"body": "How many times do we have to teach you bears this lesson? You *cannot* short $TSLA and win!", "score": 1, "replies": [{"body": "I am a bull. 90% of my portfolio is long right now", "score": 2, "replies": []}]}, {"body": "Buy leaps, this will pass and bounce, too many upcoming catalysts", "score": 1, "replies": [{"body": "Which big announcents are expected within the next two weeks?", "score": 1, "replies": [{"body": "I didn't say 2 weeks but upcoming catalysts I see are November sales, Berlin, Austin, New FSD releases, December and 2021 sales, 2021 Financials, Battery progress, Electricity Network progress, Solar progress, Insurance program expansion to name a few. There might also be some interesting purchases of other companies.", "score": 1, "replies": [{"body": "So it doesnt matter since i will have closed by then anyway.\n\nWe will see if it will be loss or profit", "score": 1, "replies": []}]}]}]}]}
{"title": "Cathie Wood thinks Tesla's recent slide is just a 'blip' toward the EV's maker stock climb to $3,000", "selftext": "", "id": "qtik2l", "created_utc": 1636866246.0, "score": 284, "upvote_ratio": 0.98, "num_comments": 79, "comments": [{"body": "The stock is up 28% in one month and we’re talking about a week ‘slip’. Idk, just zoom out.", "score": 123, "replies": [{"body": "exactly, if we can \"slide\" like this every three months we are all going to be filthy rich :)", "score": 37, "replies": []}, {"body": "That dip was bull shit. Never should've happened.", "score": 17, "replies": [{"body": "Yes consider it a gift from Elon to reorganise your portfolio 😁", "score": 19, "replies": [{"body": "Same thought ! Last chance to grab shares low / near 1k … don’t miss that Train …", "score": 5, "replies": []}]}, {"body": "It’s alright, a nice buying opportunity to add more before we continue our upward trajectory.", "score": 26, "replies": [{"body": "Buying shares from a CEO who has no other option. That's not just a great discount, but you could always ask him to autograph them. ;)", "score": 20, "replies": []}]}, {"body": "Dips are healthy for developing a new floor. Think of this as papa Musk giving you one last chance to buy some shares on the cheap. The viewpoint is always relative", "score": 8, "replies": []}, {"body": "Supply and demand is real. People who sold due to short term fear deserve to have their shares in new hands.", "score": 3, "replies": []}]}, {"body": "Can’t zoom out stonky not going up", "score": -3, "replies": []}, {"body": "It will continue to slip for now.", "score": 1, "replies": []}]}, {"body": "At 3000 I’m retiring", "score": 23, "replies": [{"body": "At 30000 I will join you 🥳", "score": 18, "replies": [{"body": "At 30,000 there will likely be a $300+ per quarter dividend payout per quarter. Selling won't be the play. At that point if you hold 20+ shares you should be able to hold and retire and pass your shares down and your family can live without working for generations.", "score": 11, "replies": [{"body": "If the stock goes to $30,000, even 20 years from now, I’m buying a building for my university.  Might even put teslas name on it, lol", "score": 6, "replies": []}, {"body": "The comment was somewhat in jest. I’m holding until the fundamentals say otherwise. I do think that may carry through the 30’s.", "score": 4, "replies": []}]}]}, {"body": "At 3000, Im gonna still HOLD", "score": 11, "replies": []}, {"body": "Me too!!", "score": 3, "replies": []}, {"body": "Not long now my friend", "score": 3, "replies": []}, {"body": "3000 is my FU number!", "score": 2, "replies": []}, {"body": "That is just under $1.5m worth of shares. What are you going to do then? Sell your shares over time and slowly spend it all?", "score": 2, "replies": [{"body": "Perhaps he is already 60", "score": 5, "replies": []}, {"body": "With the 4% rule you could in theory spend 60K / year forever with that (and adjust for inflation each year). Even more if this isn't their only $$$", "score": 3, "replies": [{"body": "But then op will have to sell all his tsla shares and cut himself off from further upsides except through index fund. \n\n\nWith all the money Tesla is making, maybe they will start issuing dividends at some point so that long time shareholders can live off just the dividend incomes while letting the principal continue to ride and appreciate in value over time.", "score": 2, "replies": [{"body": ">But then op will have to sell all his tsla shares and cut himself off from further upsides \n\nNot all, you sell a few each year to generate that income, if they are still going up you sell fewer and fewer shares, if it splits again you end up with smaller chunks to sell.\n\n\n>With all the money Tesla is making, maybe they will start issuing dividends\n\nIt has been stated that as long as they have something to spend money on IE factories, or new lines of business Robots, VTOL they have no reason to have a dividend, the company will just keep growing and thus increasing share value.\n\nTopped out companies issue dividends, nothing is growing the way Tesla is and Tesla growth appears like it will continue a long time.", "score": 2, "replies": [{"body": "Aapl issues dividends and they are far from topped out. It rewards shareholders to continue to hold the shares and benefit from appreciation without selling", "score": 2, "replies": [{"body": "Apple isn't doing 50% growth a year with a plan to do that for 5+ years.\n\nIf you look at apples annual revenue you can see that its growth has flattened out since about 2018.\n\nApple also has had that dividend for a long time, since 1987 since it was common to do at the time.", "score": 3, "replies": [{"body": ">Apple isn't doing 50% growth a year with a plan to do that for 5+ years.\n\nBut AMD is^1 and they had so much revenue they started a stock buy back to reward shareholders like the GP mentioned. These are all perfectly reasonable actions when you have more money than you can use efficiently.\n\nI don't expect it for a few years with Tesla, but it's bound to happen at some point sooner rather than later.\n\n&nbsp;\n\n^1 well, \"the plan\" they have is unstated but this year they'd planned for 50% revenue growth, and now expect 65%, with a lot more marketshare to be gained over the next few years.", "score": 2, "replies": []}]}]}]}]}, {"body": "Note: 4% has been updated to 3.3%\n\nhttps://www.cnbc.com/2021/11/11/the-4percent-rule-a-popular-retirement-income-strategy-may-be-outdated.html", "score": 2, "replies": [{"body": "4% will be peanuts to Tesla holders.", "score": 1, "replies": []}]}, {"body": "4% wont look to great with inflation at 6%", "score": 1, "replies": [{"body": "Considering even basic indexes like $SPY are up 30% during large inflation, I think it'll be more than fine", "score": 1, "replies": []}]}]}]}, {"body": "How will you spend your time?", "score": 1, "replies": []}, {"body": "Me too man, targeting 2025 latest", "score": 1, "replies": []}]}, {"body": "That blip was a gift", "score": 23, "replies": [{"body": "100% and continues to be", "score": 3, "replies": []}, {"body": "[deleted]", "score": -9, "replies": [{"body": "See you at 3000.", "score": 8, "replies": []}]}]}, {"body": "This lady, is one of the few who had the cojones believe and hold on.  CNBC was clueless, to this day Kramer “I don’t understand this stock”, like the guys with swords, when they first saw a gun fire a bullet... that little metal object can’t be better than my sword, I trained my entire life...", "score": 27, "replies": [{"body": "Lets Go Cathie!!!!!", "score": 4, "replies": []}, {"body": "The queen has spoken!", "score": 5, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Rewriting history, she made huge gains...  and as for fees, etc., it’s the way it is.  All fund managers get fees.", "score": 5, "replies": []}]}]}, {"body": "Yup.", "score": 17, "replies": [{"body": "I think there was a typo....$3000 by 2022", "score": 18, "replies": [{"body": "It was 2025 but going up to $1250 so quick they didn't expect. Q4 up & Q1 up & away! ![img](emote|t5_n9evv|5717) all the way", "score": 11, "replies": [{"body": "NEED TO GO HIGHER QUICK", "score": 1, "replies": [{"body": "No rush. Buying as much as I can. Q4 earnings will be another record & with Berlin, Texas stock build up, Q1 next year will make me weak at the knees & bring a tear to my eye  no doubt.", "score": 11, "replies": [{"body": "Yup. I’ve been working all the overtime I can get since February 😁", "score": 3, "replies": []}, {"body": "Berlin is unlikely to contribute to earnings in Q4 (I think).", "score": 3, "replies": [{"body": "No Berlin Texas officially this year. Their sandbagging, building stock for Q1 2022. Then ramp as fast as possible. 22 is going to be a cracker", "score": 8, "replies": []}]}, {"body": "Per Pierre using aapl as comp, A fair valuation for tsla right now would be 2 times all auto makers mc or 2T. So it should double from here shortly. As to when it gets there, wall st is usually behind the curve on what Elon and Tesla have been up to, so sit back and enjoy the ride as always", "score": 3, "replies": [{"body": "today's $1T market cap requires 3M sales per year at efficient ops: 3M x $55k ASP x 20% net margin x 30 P/E\n\nI think to double from here some indication that Tesla can in fact grow to GM scale (6M/yr) at $55k ASP is needed. But I could be wrong LOL.", "score": 1, "replies": [{"body": "30 is also not the PE. At least not in this market. And at 3M vehicles with goal of 20… a near 7x trajectory deserves a higher PE than Mature tech. I’d say amzn levels might be fair 50-70.", "score": 2, "replies": []}]}]}, {"body": "👍", "score": 0, "replies": []}]}]}]}]}]}, {"body": "[removed]", "score": 13, "replies": [{"body": "[removed]", "score": 14, "replies": []}, {"body": "[removed]", "score": 11, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 4, "replies": []}]}]}]}]}, {"body": "[removed]", "score": 2, "replies": []}]}, {"body": "Ready to dump 5000shares @2999.99", "score": 0, "replies": [{"body": "Ready to buy more at $2999.99 🤡", "score": 2, "replies": []}]}, {"body": "First her price target 4k(presplit) was hit, before it was hit she jumped the price target to 6k(pre split), as it was nearing 6k she jumped the price target again 3k(after split).   \n\n\nIt is obvious what she is doing, stock goes up - her price target goes up.", "score": -5, "replies": [{"body": "price goes up, Elon has all the capital he needs to expand operations.\n\nBack in 2019 I didn't foresee this positive feedback loop . . .", "score": 8, "replies": []}, {"body": "Price Goes Up TSLA Bulls Win", "score": 2, "replies": []}, {"body": "Are you staying price targets should never change?  Amazon should still be $100?…", "score": 1, "replies": []}]}, {"body": "“I am sure he didn't want to use any more of his stock as collateral for loans. So I think that's sensible” interesting comment. Deleveraging sounds like … 🧐", "score": 1, "replies": [{"body": "Huh?", "score": 0, "replies": []}]}, {"body": "And to think that only if Elon made his 83(b) election 5 years ago this never would have happened.", "score": 1, "replies": [{"body": "Yep", "score": 1, "replies": []}, {"body": "Big risk for a few percentage points of savings. He might not have survived the 2018 margin call.", "score": 1, "replies": [{"body": "Yes, I had the same thought thinking back 5 years and his cash “fully deployed,” and not just Tesla.  Remember Solar City?  SpaceX?  He was bleeding cash so I figured that was why the pass on paying some tax on what was then  my at out of cash c and alternatives.  He pulls this off it certifiably would be the greatest startup story of all time.  Some think it is already.  I don’t disagree.", "score": 1, "replies": []}]}]}, {"body": "we know it already. market cap 2028 = 6.5T", "score": 1, "replies": []}, {"body": "Oh it's just the gully, that's all. Just nerves.", "score": 1, "replies": []}]}
