{"title": "What are your favorite / reliable index funds for 5-10 year timeframe?", "selftext": "We are looking to move a chunk of money ($20k - $40k) into moderate risk/reward indexed funds over 5-10 years. \n\nWe are already going to move $20k from our terrible CD account into Treasury I Bonds so we have a low risk component of our portfolio. \n\nWe want to invest another $20-$40k in something that's going to grow at least 5%+ per year, on average, over the next decade. \n\nConsidering the pre-COVID tech boom, and the COVID tech boom, would you consider the Nasdaq's total indexed ETF (QQQ) to be superior to the one for S&P 500 (SPY) or for Dow Jones (DIA)? \n\nOr would you consider it wiser to invest in something like Vanguard's total stock index fund (VTI / VTSAX) or the Wilshire 5000 index fund (WFIVX) instead? \n\nWe essentially want to set it and forget it for 5-10 years.", "id": "r3evsj", "created_utc": 1638024091.0, "score": 41, "upvote_ratio": 0.8, "num_comments": 80, "comments": [{"body": "VTI", "score": 46, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "VT is much more diversified. If US ever goes to hell in our lifetime, we’ll be glad we went VT", "score": 12, "replies": []}, {"body": "VT gang reporting for duty.", "score": 19, "replies": [{"body": "Aye aye sir", "score": 6, "replies": [{"body": "Welcome aboard.", "score": 1, "replies": []}]}]}, {"body": "American exceptionalism baby", "score": 2, "replies": []}, {"body": "VT’s expense ratio is over double that of VTI and it has performed slightly worse historically. If the US market starts to fall behind I might switch in the future.", "score": 1, "replies": [{"body": "Unless you have a 8-9 figure position the expense ratio difference is pretty negligible. VT has better diversification and will do better in a downturn like you mentioned", "score": 0, "replies": []}]}]}, {"body": "Any reason for that over VTSAX or VOO?", "score": 2, "replies": [{"body": "VTSAX is the mutual fund version of VTI and will have the same investment results.  \n\nVOO is an SP500 index ETF which is not as diversified as VTI/VTSAX, but generally has similar performance since the SP500 makes up about 80-85% of VTI/VTSAX and the many many other companies in VTI each are only a small fraction of a percent each.\n\nThe ETF VXUS is a total international, (ex-US) ETF.\n\nMy preferred ETFs for long term holding are VTI and VXUS in a 70/30 ratio.", "score": 15, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "VT is the ETF with float adjusted market capitalization weighting, which is somewhere around 57% US, 43% ex-US.   \n\nCurrency exchange rate variations slightly increase the volatility of stock denominated in other currency when converted back to USD, so the minimum volatility point , in USD, is a bit lower than the market capitalization weighting —- somewhere in the low 30% range of ex-US holding.  The minimum volatility point has varied during different time periods, but generally lies somewhere in the 20-40% international allocation range\n\nThis is all just a fancy way of saying I spend mostly in USD so I choose to have a mild home country bias.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It doesn’t really matter much.  How much and how consistently you invest is what counts the most.\n\nEven just dumping a lot of money into SP500 index gets you 95% there.   Going to total US market adds a tiny bit.   Adding international is a bit more important, but not really essential.  70/30 vs 60/40 vs 100% VT is just a very fine level detail that doesn't matter much.\n\nAsset allocation between equity and fixed income is important, although for many young investors the fixed income investment isn't a percentage allocation, but instead an amount like 6 months of average expenses and is called an emergency fund rather than being considered part of your portfolio.", "score": 1, "replies": []}]}]}]}]}, {"body": "Lower expense ratio I believe.\n\nVSTAX is a mutual fund, VTI and VOO are ETFs", "score": 2, "replies": []}]}]}, {"body": "60/40 VTI/QQQ", "score": 6, "replies": []}, {"body": "You're on the right path, r/financialplanning could offer some really good advice.", "score": 9, "replies": [{"body": "As well as r/Bogleheads", "score": 6, "replies": []}]}, {"body": "QQQ is more concentrated (only 100 stocks and dominated by tech-related companies). plus it's had a dramatic spike the last few years. so based on historical trends I would not expect it to consider such strong performance going forward. what goes up...\n\nI would prefer VTI, because it's got a healthy chunk (up to ~20/25%) in small and mid-cap stocks. there are periods large cap is in the toilet but smaller companies do very well (1970s, 2000-2012). \n\nmight want to consider a multi-asset ETF that's focused on dividends/income more than capital growth. things like ALTY or INKM. they'll have a mix of dividend-paying blue chip stocks,  + various bonds or REITS. you will get some growth over the years, but these are slow and steady options rather than rapid growth. \n\nhttps://www.ssga.com/us/en/intermediary/etfs/funds/spdr-ssga-income-allocation-etf-inkm\n\nhttps://www.globalxetfs.com/funds/alty/\n\n>something that's going to grow at least 5%+ per year, on average, over the next decade. \n\njust FYI more than a few professionals are forecasting the US market as a whole will underperform for the next 10-25 years. loo up \"mean reversion\" -- mean as in average. if the long-term market average is 7/8% after inflation, what does that imply when the market has averaged 14% for a decade? it implies sub-par performance going forward.", "score": 9, "replies": [{"body": "I appreciate the very thorough reply!", "score": 2, "replies": []}]}, {"body": "CDs and T bills are very conservative options. \n\nCouple of things. Fund costs and return over 10 years. \n\nVOO or VOOG are cheap and have returned very well over 5 and 10 years. \n\nQQQ is a bit higher fee but has done even better over 10 years. It’s a bit more volatile. \n\nSuper easy process. Put money into a brokerage account like Fidelity or something that gives you access to research. Go to charts. Load up a few options. Compare the chart growth over time and their administrative fees. Choose from there. \n\nKeep in mind that any whole market or S&P fund is still very heavily weighted in their top 10. So you’ll be owning Apple, Microsoft, Tesla, Google, Meta, NVIDIA, Amazon, etc whether you want to or not.", "score": 4, "replies": [{"body": "Excellent, this is basically the research we've done. Haven't looked at VOOG but I will add it to the list to compare. \n\nDo you have any opinions on if Nasdaq / QQQ / tech stocks in general are currently over-valued?", "score": 2, "replies": [{"body": "The question is, do you think the world will become less tech focused 10 years from now, or will investors be less greedy? \n\nNo, and no. \n\nTherefore, I’m very bullish on tech. Chips and butteries are smaller and cheaper every year. That means tech companies will become more profitable over time. It’s simply the future.\n\nEdit: I’m keeping “butteries”.", "score": 4, "replies": [{"body": "Mmmmm butteries", "score": 3, "replies": []}, {"body": "2000 to 2015 was the world less bullish on tech? If chips and “butteries” are cheaper, doesn’t that deflate the price of technology, resulting in less revenue and profits? \n\nAs the price of a stock rises, the expected return gets smaller. Tech companies now will age and be like General Electric or General Motors today. If you think you can pick the next tech winners, out of the many many losers that will flourish and pass away, good luck with that, but “technology is the future” has literally always been true, but rarely the best investing strategy (see railroads in 1800s, cars in early 1900s, Pets.com in 2000).", "score": 0, "replies": [{"body": "This ignores actual large scale data. \n\nYou can only lose 100% of your investment in any single stock. Your potential gains on any single stock are, in theory, infinite. \n\nYes, many companies failed. But Tesla and Amazon didn’t. Your 10,000% return on that single company absolutely wiped out 9 out of 10 companies going completely bankrupt", "score": 2, "replies": [{"body": "> You can only lose 100% of your investment in any single stock. Your potential gains on any single stock are, in theory, infinite.\n\nThis is true of literally every stock so I am not sure how it supports the argument technology stocks will outperform other stocks long term?\n\n> Yes, many companies failed. But Tesla and Amazon didn’t. Your 10,000% return on that single company absolutely wiped out 9 out of 10 companies going completely bankrupt\n\nSame general question, the average of your ten companies is 1000% over the long term, how does that show they should be outperforming the market average?\n\nA fundamental tenet of economics is that an asset that rises more than expected in price has an increasing probability of having a lower return moving forward; on average. Citing the outliers of a data set doesn’t invalidate the average.\n\nThose 10000% increases have already happened, do you really expect Amazon to produce another 10000% increase (minus inflation)?", "score": 1, "replies": [{"body": "Again, this is a terrible take. \n\nThese aren’t probabilities. These are unique entities. Probability doesn’t apply at all. \n\nFurther, you assume that these entities remain constant. No, Amazon isn’t likely to 10x again. But other companies will certainly 10x again. \n\nI got into Tesla early (not early enough) AND I got into Moderna early (not early enough). Neither of those companies were on the S&P 500 10 years ago. \n\nIn fact, an enormous amount of value on the S&P 500 wasn’t included there 10 years ago. \n\nIf you don’t understand that up and coming companies will be added, that they will in fact multiply many times their current value, and they will drive the market higher… I think you should put your money in CDs and spend the rest of your retirement playing pinochle or euchre. \n\nThe future is tech… biotech, nanotech, cloud tech, blockchain, and quantum. There is NO company or industry that won’t be touched by increasingly rapid developments in AI, machine learning, battery efficiencies, or chip processing. You can invest in corn and soy beans, but someone is behind the scenes running their computer systems. You can invest in railroads or rubber bands, and someone is behind the scenes managing their client lists and accounting. \n\nIf you can find me ONE successful publicly traded company in 2021 that wasn’t positively influenced by a top 25 tech company, I will shit in my hat and eat it on the evening news.*\n\nDisclaimer: No, I won’t do that. I didn’t actually check so there is always a slim chance I’m wrong.", "score": 1, "replies": [{"body": "I don’t base my investing plan on “this year” or any one year. Investing is a long game not a short one. So, here are some examples.\n\n>rail industry. Despite going from a 63% to 1% share of the stock market capitalization between 1900 and 2019, it still managed to outperform innovative new transportation technologies like cars and airplanes during the same time period.\n\n> A second example is that you would have made more money holding oil stocks instead of technology stocks over the time period between 1971 and 2019. \n\n> The moral of the story is that great companies are not necessarily great investments if you pay too much for them, and when new technologies come out investors get excited and do just that. Additionally, bad companies could be good investments if you can get them cheap enough.\n\nI feel sorry for the hat, and that you see CDs and tech as the only two options in the investing play book. I totally understand the enthusiasm for tech, but as an investment, it has struggled because the enthusiasm often runs ahead of the fundamentals (meaning there are expectations of beating targets piled on top of expectations of beating targets).", "score": 1, "replies": [{"body": "Yes, but I didn’t say just buy tech stocks. I said I’d go VOO or VOOG, and maybe QQQ if you wanted to get riskier. \n\nMy portfolio has like 10 different ETFs or Mutual funds, well over 80 individual equities, and 12 metaverse or blockchain projects. If a layer2 or parachain project doesn’t blow up, maybe my Sherwin Williams will. But that’s what my advisor is for. They’re responsible for being responsible. I’m responsible for picking things I’m interested in and I believe have a chance to multi-bag. It’s a good relationship. But here’s the thing…. I’m trailing VOO this year. As are most folks. Same for 5 years. Same for 10 years. \n\nAnd again, this isn’t 20 years ago or 120 years ago. Technology advances exponentially. The rules of decades ago simply will not apply decades from now. 200 years ago we were shooting at each other with black powder rifles. This year Elon Musk is putting a dog coin on the moon. 200 years from now we’ll be electing a dolphin president of Mars. Technological advances are exponential. \n\nEither you or I will be right. In the meantime, vote Eekeekeekeek for Mars President 2224", "score": 2, "replies": [{"body": "So, here is your hot take for this year's returns: \n\nTEC.TO Global Technology Leaders ETF - one year to date +35.31 (from their website)\n\nZEB.TO Equal weight bank etf (only 6 Canadian banks) - one year to date + 34.96% (from their website)\n\nSo even this year, an ETF dedicated to technology just barely is outperforming banks. Go exponential growth. \n\nThe idea that everything has change, and this time is different, is an appealing one, but it hasn't yet been true. If a pattern existed 120 years ago, 20 years ago, and still in 2019 (2 years ago), then there is a good chance it persists.\n\nEDIT: looked up AMZN price over one year + 10%, TD was 40%, looks like I did find find you ONE successful publicly traded company in 2021 that wasn’t positively influenced by a top 25 tech company.", "score": 1, "replies": [{"body": "You’re cherry picking data. I referenced broad ETFs, and 2021 isn’t a typical year. I, repeatedly, mentioned longer term periods.", "score": 1, "replies": [{"body": "> Yes, many companies failed. But Tesla and Amazon didn’t. Your 10,000% return on that single company absolutely wiped out 9 out of 10 companies going completely bankrupt\n\n> And again, this isn’t 20 years ago or 120 years ago. Technology advances exponentially. \n\n> If you can find me ONE successful publicly traded company in 2021 that wasn’t positively influenced by a top 25 tech company, I will shit in my hat and eat it on the evening news.*\n\nAre these not your words? Did you not say 20 years ago is meaningless?  Did you not say “this year” tech was driving the success of all the other businesses? \n\nSure you threw in VOO a few comments in, but the discussion started with Amazon and Tesla and technology being the future and this year being different than the past. \n\nNow you’re pivoting to “broad ETFs and longer term trends. What happened to “this isn’t 20 years ago”?\n\nGoing VOO isn’t going Tech stocks and isn’t a bet on “ tech being the future. Old man Buffett has been going on about the 500 for years, and yes invested in Apple, and yes is old and a bit dated now, but so is the idea of VOO and it’s not a new idea nor a tech idea.\n\nYes, buy VOO, though I’d be curious  how “ I got into Tesla early (not early enough) AND I got into Moderna early (not early enough). Neither of those companies were on the S&P 500 10 years ago.” tells me your recommending the S&P 500 rather than gambling on whatever is hot currently.", "score": 1, "replies": [{"body": "Dude! That’s what I started with before your whole tirade!\n\nhttps://www.reddit.com/r/stocks/comments/r3evsj/what_are_your_favorite_reliable_index_funds_for/hma39hy/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Thing is the biggest tech companies are already migrating towards the future, they're not auto makers that have been making the same thing for 50 years, they're the ones leading the change.\n\nGoogle started out as a search engine, now it's a gazillion things. Amazon started out as a book store and then moved to e-commerce, now they're into a million things. You get the point.", "score": 2, "replies": [{"body": "Yes I get your point, there are a few companies looking backward that have done really well in technology in the relatively recent past. But the recent past isn't a good guide to technology. Technology has literally always been the future, and always migrating towards the future in all time periods, ever. \n\nWhat you miss is that in 2000 GE was the largest market cap in the whole US market. They did this by branching out beyond household appliances into a \"million things\", in 2004 they were still the largest market cap, and looked like the safe sure thing. Then, 2008 happens and they plummet and never recover. You argue looking back \"its obvious\", but it wasn't then (or how is it the largest market cap). \n\nThat is the life-cycle of technology and technology companies. They are great growth stocks, until they aren't. They don't go up forever, and over the long term, the market average reels them in. \n\nIn 2000, you would have been saying the same thing about Yahoo and all kinds of other companies, including Microsoft and perhaps Amazon. Then the crash, and it took 15 years for those companies to regain their footing and start producing gains, let alone outperform the S&P 500 as a whole (the Nasdaq as a whole languished for years). \n\nBuy Amazon in 1998 when it joined the Nasdaq, you underperform until 2008. You stick it out, then sure you're fine, but in 2008 you have a bunch of stocks that delisted or are languishing at the bottom, and no big returns from your other technology stocks, it will be pretty hard to make your \"future\" argument and stick to it with underperformance for almost 10 years.  \n\nBack in the early 1900s, cars \"were the future\", but investors in autos didn't outperform the market investing in cars, they were volatile, and many were delisted. \n\nThe problem with tech is that it is literally the easiest sector to be disrupted, and hence it is volatile with huge swings up, and huge swings back down. The recent past is not a good guide - the longer view shows us that technology is cyclical and the companies in technology have a quite defined life cycle that very few overcome.", "score": 1, "replies": [{"body": "Thing is I don't see how monsters like Google, Microsoft or Amazon could fail. It's not like they're just the highest caps, they are that and what they produce/provide is used by the whole planet, and it's not just one service/product.\n\nTo be honest I can see how old dudes investing in \"tech\" got it wrong though, I've been using Google since like 1999~2000 over everything else, same way I've been using Windows for 25+ years now and since Amazon became a giant everyone uses Amazon for everything whether they know it or not (guess what's Amazon's the main source of profits... it's not selling you stuff, it's AWS).\n\nSomething similar happens when it comes to hardware, unless we completely rework how we build computers I don't see the current kings getting dethroned. What would need to happen is to the whole informatic system to get overhauled completely and I don't see that happening without the kings leading the way.\n\nThings are not now the same way they were in 2000, we're investing in the future by investing in tech, sure, but we're also investing in the present. It's not just promises, there's like 10 companies that basically build/provide most of what we use, and because of globalization we're not like in 2000 where you had that one big American company with fingers in many pies, you have something a lot bigger.", "score": 2, "replies": [{"body": "So “this time is different”, where and when have I heard that before?", "score": 1, "replies": [{"body": "That's not an argument, we've never been in times like this.", "score": 1, "replies": [{"body": "Top investing quotes seems to disagree with you. We are always \"never been in times like this.\"\n\n22. \"The four most dangerous words in investing are, it’s different this time.\" — Sir John Templeton\n\nAnother famous quote is, \"History doesn't repeat, but it does rhyme.\" \n\nAre you talking Covid, yep done that, it was called the Spanish Flu and we wore masks, had lock downs, the whole thing. Is it a quick recession, yep done that. Is it fiscal stimulus, yep did that in 2008, it literally wrote the play book. \n\nYes, this time is different, literally every time is different, and yet the same old trends and patterns emerge. It has in fact become cliche to say \"we've never been in times like this.\"\n\nFollow market trends and history. Don't speculate that this particular time will be any different.", "score": 0, "replies": [{"body": "At what point 100 years ago were people live-streaming a SpaceX rocket launch? Or arguing with people on Reddit via a device small enough to fit into your pocket but more powerful than the computers on Apollo 13?", "score": 1, "replies": [{"body": "Lol you’re cute - good luck with everything", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "ESGV. It's basically VTI without the baddies.", "score": 3, "replies": [{"body": "I love this. OK expense ratio / fees?", "score": 1, "replies": [{"body": "Not bad at all. 0.12% expense ratio. That's a little more than VTI, but I sleep just fine knowing I'm not profiting off weapons or tobacco companies.\n\nPairs well with VSGX for international exposure.", "score": 2, "replies": []}]}]}, {"body": "Covid tech boom is about to turn into the new norm.\nThis man made variation is smarter and more evolved…smart move on seeking a solid investment vehicle to invest in.", "score": 3, "replies": []}, {"body": "VTI or any other funds or ETF similar to it. You can also try picking individual stock. Some people are really good at it, and you might be one of them.", "score": 2, "replies": []}, {"body": "Vusa", "score": 2, "replies": []}, {"body": "my acct doing 80/20 of VTI / QQQ... set it and forget it for 5-10 years... and keep buying monthly every time I get pay from 9-5 job :)", "score": 2, "replies": []}, {"body": "* BKLC - Basically VOO with no fees at all and no mid caps\n* VTI - More diverse than BKLC (3500 stocks vs about 250)\n* VXUS - International stuff\n\nOther considerations are based on timing but:\n\n* BKMC - Mid caps only 0.04% fee\n* BKSE - Small caps only 0.04% fee", "score": 2, "replies": []}, {"body": "Voo and qqqm", "score": 2, "replies": []}, {"body": "IJR", "score": 2, "replies": []}, {"body": "FSMEX- fidelity select medical \nFBMPX- Fidelity select communication \nFNILX fidelity large cap", "score": 2, "replies": []}, {"body": "fzrox", "score": 2, "replies": []}, {"body": "VTI is at a discount right now. Buy and never look at it ever again.", "score": 1, "replies": []}, {"body": "\n\nSPXL", "score": -2, "replies": [{"body": "SPXL is buy-and-hold?", "score": 1, "replies": [{"body": "Yes, it's no different than the S&P imo. Just 3x as impactful", "score": -1, "replies": [{"body": "I would just add the difference is you need a lot of patience and temperament to hold it. Same with TQQQ.", "score": 3, "replies": [{"body": "I buy it precisely because I am impatient. Average 30% return per year. Where else can you get those odds and still be somewhat diversified?", "score": 0, "replies": []}]}]}]}, {"body": "I’m buying it every week. When I feel like it has a good run, I sell all and repeate. Leveraged ETFs are given bad name because people are people.", "score": -1, "replies": [{"body": "Leveraged ETFs have a bad name because some people have experience and memory that start before this latest long running bull market.", "score": 1, "replies": []}]}]}, {"body": "Throw it all into a meme stock and make 1800% or lose everything. The chains cannot be pulled slowly, they need to be ripped off. I understand its scary, but when it pans out and you make 10+ times your money, you might be able to retire (!!!!!) otherwise, you will live a pipedream and eat crumbs. It takes balls to change your life ! NFA , just my humble opinion.", "score": -15, "replies": [{"body": "I'm personally gonna do / have been doing the exact opposite of this. The meme stocks / digital coin frenzy has absolutely rotted the cognition of anyone who buys into the mantra.", "score": 9, "replies": [{"body": "You can do what you want, i simply wanted to give another option to OP. We each can do what we want. 10% makes me want to puke. Here have the leftovers. While hedge funds and well connected investors make billions", "score": -1, "replies": [{"body": "Good luck with it. Nothing wrong with old school methods of lookng at a fundamental well or investing in ETFs for passive investing. What you're doing is gambling on momentum alone and a mantra that's more akin to religion than rationality (doesn't mean you're not going get good gains). I'm personally bored of \"manipulation\" talk, virtually everything is overpriced historically to the point of madness. Most companies need a 40 - 60% haircut.", "score": 2, "replies": [{"body": "They may need that haircut, and may get that haircut someday. But the thing is you can use short term strategies to ride that wave up, and as soon as the cut starts short it all the way down. Obviously you want to have some percentage of your portfolio in safer plays, but imho unless you truly want to “set it and forget it” you are seriously missing out on compounding growth by not setting a percent for speculative plays", "score": 2, "replies": [{"body": "I've in speculative things mainly, but a little more grounded in valuation (streaming, semiconductors, synthetic biotechnology)", "score": 1, "replies": []}]}, {"body": "I dont see the religious parallele, the more accurate way to describe it is madness. Like the Joker. It also depends on your capital. Im broke as fuck and young. I need (want) an explosion. I want to skip steps. If i lose everything, i can go back to being broke im used to it. I have no kids. No rent. No responsabilities. I have a phone bill. Thats it. I want to pay my parents house off. Thats what i want and thats why i dont go for anything short than highest risk highest reward possible. Not only for me but for my parents and sister", "score": -1, "replies": []}]}]}]}, {"body": "SYFY is just that etf for that lol\n\nMix of meme and other stocks. Sofi balances this etf based on widely held stocks it’s members are buying and holding on Sofi.", "score": 2, "replies": [{"body": "My god, is this actually a real ETF!?\n\nThe future is now...", "score": 1, "replies": [{"body": "Yes, It’s one of Sofi’s etf.\n\nI don’t own this, I do own their version of SPY\nIt doesn’t guarantee exposure to meme stocks but it’s what Sofi members are buying and members are mostly millennials and genz", "score": 2, "replies": []}]}]}, {"body": "Tell me you’re financially illiterate without telling me.", "score": 2, "replies": [{"body": "What a smart fucking guy!!! U available on the weekend to fuck my wife Achilles ?", "score": 1, "replies": [{"body": "Buddy I’m positive that position is already filled", "score": 1, "replies": [{"body": "Huge fucking guy, i would take my shoes off and  give em to you", "score": 1, "replies": []}]}]}]}, {"body": "Just go to a casino and put it all on 47 it’s like doing the same thing exact thing", "score": 1, "replies": [{"body": "No it is not the same. There are similarities. The game is rigged in favor of the house. To each their own, i know that if i win money, or if i lose money, i drink and smile regardless. Life is a fucking joke under these financial circumstances. I want more than 10% money looks amazing on me", "score": 1, "replies": []}]}]}, {"body": "MSFT GOOGL NVDA", "score": 1, "replies": []}]}
