{"title": "[deleted by user]", "selftext": "[removed]", "id": "i7uu2l", "created_utc": 1597163193.0, "score": 7, "upvote_ratio": 0.77, "num_comments": 25, "comments": [{"body": "Just DCA man. Split your money into 10 or 15 or 20 or w/e many pieces and buy once per two weeks or something like that. You might be able to grab the crash or the ride up.", "score": 8, "replies": []}, {"body": "You missed the train. It has left the station....  you'll have to go to the tunnel and wait for it now. Hopefully you will see light at the end of the tunnel.", "score": 15, "replies": [{"body": "That light might be a train, though...", "score": 13, "replies": [{"body": "Deep", "score": 3, "replies": [{"body": "https://youtu.be/b_ulRwXIzbo 02:42", "score": 1, "replies": []}]}, {"body": "Maybe a shuttle bus but unless covid20 comes I don’t think there’ll be a train", "score": 1, "replies": []}]}]}, {"body": "I agree with your sentiment. However, time in the market is better than timing the market. If you buy stocks for the long term, the current ATHs might be meaningless in 5+ years (think Apple, Microsoft, Amazon etc).", "score": 6, "replies": [{"body": "Also even if there is another crash it’s just another time to keep buying as everything is on sale, doesn’t change the strategy right now though. I’ll buy now and I’ll buy then :)", "score": 4, "replies": [{"body": "What are you buying in?", "score": 1, "replies": [{"body": "Highly diversified single stocks and some ETFs this month, next month mostly ETFs and a slice of gold", "score": 1, "replies": []}]}]}]}, {"body": "The next dip is likely when we move towards the presidential election when things grow uncertain. But there is no guarantee if that dip would be lower than the current valuations. Many stocks are still rightfully undervalued, and tech stocks are justifiably high due to increased revenue last quarter with high likelihood that it can be sustained this quarter.", "score": 4, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "“Be Fearful When Others Are Greedy and Greedy When Others Are Fearful”\n\nApply this however you deem fit.", "score": 1, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "True", "score": 1, "replies": []}]}]}, {"body": "Sold a bunch of stocks today, will try to not put the money back in the market until a crash", "score": 0, "replies": []}, {"body": "Lol you lost.", "score": -5, "replies": []}, {"body": "SPY $200 by Nov.", "score": -5, "replies": [{"body": "Isn’t it at $337 now?", "score": 1, "replies": [{"body": "Sure is", "score": 1, "replies": [{"body": "So u think it will drop to $200 in few months?", "score": 1, "replies": [{"body": "I do, hope I’m wrong, but it’s propped up on sand", "score": 0, "replies": [{"body": "I agree it’s probably gonna go down but hopefully not that low. We’ll see what happens in the world around us to drive it down or maybe higher?", "score": 2, "replies": [{"body": "That’s all us peasants can really do in this world", "score": 1, "replies": [{"body": "I own GLD for a year or so and thinking about pulling the trigger but want to see what happens in the months ahead! I see the spot of gold down almost $100 today!", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Asset inflation alone will keep SPY way above 200, we're not going to see that number again.", "score": 1, "replies": []}]}]}
{"title": "Micron (MU) 2020 Year End annual report approaching", "selftext": "tldr: I'm a holder of MU and would like to know the communities feelings towards this stock.\n\nIn 1 month, we should see Micron's 2020 annual report. The 2019 annual report was for the period ended August 30, 2019 and is available here:\nhttps://investors.micron.com/static-files/67180e49-d379-4675-a20c-9bdb7fa04d97\n\nThis was filed on September 26, 2019, so expect around the same time for 2020.\n\nSome industry comparison, MU hasn't hit the highs as other semiconductor stocks such as AMD, NVDA, TSM, QCOM, etc. Even moreso, MU has lagged the semiconductor ETF of SOXX: https://www.etf.com/SOXX?__cf_chl_jschl_tk__=c93ca818f148d91388954f7d5347f008ff472bee-1597159502-0-AXhcx8z7a5DTKkZYvPA6elpYQ2fkYEujR0gVP2zriuM9k9Ut_Tsbfqkcrmxc8mwxOViol2Qfz1TK7kJDiy3ouACz2kvyo7BQTAsbkcPqK2mz7Bnrn-PwUczXw3hAUyDl2MaHR3NdpNte1hW2Mc5uEJilA36zG_q8S6QWwdoNDbGni4O8F_m5pt2rLc-LMGJGrZMFdExuWTZ3HOFvd1IYagh92soNvn-g_jtPKhm6yoM-xnOrf9QLDTNInUMkUHVs4LvZT1XcuFUmYKlhLqPmmvZip5vvq_tV5AQqe6kdigX3P2J1uJRwwCQkVBeUJKU1RjEvxHlmCNMGOhiPW3vfP2k#overview\n\nI'm trying to understand why and this post tries to dissect it.\n\nLets start by looking at their 2019 year end financials: https://investors.micron.com/static-files/67180e49-d379-4675-a20c-9bdb7fa04d97\n\nIn 2019, they had revenue of $23M with a COGS of $12M, posting a gross margin of $10M. The gross margin for MU seems to be consistent at between 57% and 43%. But its moving in the wrong direction, with gross margin getting lower, with 2018 gross margin being 57% and 2019 being 43%. And this was before COVID started to hammer the supply lines of all semiconductor companies.\n\nTheir R&D spending has increased about 10% year over year into 2019.\n\nBut their net income has cratered between 2018 and 2019, dropping from $14M to $6M. The stock moved from $50 to $43 between Sep 9 and Sep 23. Reflecting their bad numbers in that 10% decrease in stock price.\n\nThen from October 2019 to February 2020, we saw the stock rise to $58.50 from $43, a 40% increase over 4 months. I can't clearly understand why this stock rallied over that period, given that their Q1 numbers weren't that great. Their Q1 reports were filed on Dec 18 2019, and weren't that great. Their QoQ numbers were up, but their YoY numbers were down. Reading made it seem like 2020 would be another down year compared to 2019.\n\nI believe the stock price bounced up during that period because in Q1 MU did a share buyback program of 1M shares for $50M. They have 1.1B shares outstanding: https://finviz.com/quote.ashx?t=MU\n\nSo perhaps this was the cause of the price increase over that time period.\n\nSince then, the has been hammered by COVID, with the price dropping to $35 before leveling off somewhere around $50.\n\nSo adding up their quarterly numbers for FY2020, we see the following:\n\nFY2020 Revenue\nQ1 5.1M\nQ2 4.7M\nQ3 5.4M\n\nIn FY2019, they had revenue of $23.4M. That means that in order to match their same revenue they would need Q4 to put up $8.2M of revenue. Looking at their numbers, this doesn't seem very likely. This means that MU will be posting a YoY revenue decrease of about 15% (20% between 2018-->2019, 10% from 2019-->2020). That doesn't look great at initial glance.\n\nAdditionally, in their annual report, they claim that a threat to their business is the decreasing price of DRAM and NAND storage. They're seeing DRAM decrease in price by 30% and NAND decrease by 44%. This means that there is higher increased pressure to do business in volume since the lower selling price of their product is going to eat into their gross margin.\n\nWe see this trend playing out as their gross margin in Q1, Q2 and Q3 has fallen in 2020 compared to 2019. Falling from 50% to 30%. This is probably whats eating into their operating income number. Looking at the quarterly reports, the main way that Micron makes a higher net income is through higher revenues, as they don't have much left to slash in their expenses.\n\nWhere does that leave us in terms of quantitative analysis? Well, its looking like the revenue for FY2020 is going to be around 21B with net income being around 2.5B (these are projections using Q4 2019 numbers and FY2020 numbers so far). I'm not getting the EPS calculations right when I'm doing it, so I wouldn't trust this following section without verifying. But it looks like if the year end net income is targeted to be 2.5B with 1.1B shares outstanding, we're looking at a yearly EPS of 2.27 with quarter EPS of 0.72.\n\nIts unclear what analyst projections are, but these numbers are well below the expectations and performance of the previous year. This puts a price to earnings ration on MU at around 50, which may make it overvalued for the growth rates they're putting up. I could see MU sliding to a stock price of $40, or even $35 as a correction unless they can give confidence that they're back on the growth trajectory for year over year numbers. Comparatively, their QoQ numbers do look better and could offer some of this hope.\n\nThe last component I'll add here is the qualitative assessment. Most of MU's blog and press details are focusing around 5G. Which could help them pull out of this current slump of sales.\n\nI'd love to know feedback on the future of MU and whether we have any MU holders going long on the stock. I'm holding a small portion, but looking at these numbers I'm tempted to exit with my modest gains and redeploy my assets elsewhere.", "id": "i7uukm", "created_utc": 1597163240.0, "score": 9, "upvote_ratio": 0.77, "num_comments": 23, "comments": [{"body": "Been holding MU for over 2 years now. I think my entry was $38. Seen it go $60 twice, but didn't sell yet. I may just sell at $50 this time.", "score": 11, "replies": [{"body": "This is the way I'm feeling. If you look back at the history of this stock, they have a few things going against them that they can't seem to shake:\n\n1. Decreasing prices for NAND and DRAM storage\n\n2. Negative growth on revenue and earnings\n\n3. Stagnant stock price that doesn't indicate momentum or interest from the broader community\n\nThe only reason I've stock around is because analysts have price targets for MU in the $70's. But  I just can't see it getting there without a huge boon from an external macro factor. Like NOK or ERIC leaning hard into MU to power their next generation 5G solutions.\n\nI'm trying not to be a bear, but I just don't see the positive upside for these folks.", "score": 1, "replies": []}, {"body": "Oh, one more thing. If you had put the $38 in SOXX instead of MU, you'd have 2x return on your investment vs the meandering stock that is MU. Something to consider as an opportunity cost. Which is why I'm bearish on MU...", "score": 1, "replies": []}, {"body": "Hoping they hit $50. I put 20% of my IRA in this Thursday or Friday.", "score": 1, "replies": []}]}, {"body": "The reason why $MU stockprice hasn't recovered is because of the DRAM/NAND spot-price market. It's been cratering for 3 months now and that's usually a bad sign for future gross margins.\n\nI am expecting MU stockprice to remain recessed till smartphone sales recover. \n\n5G won't be having a big impact for atleast another year. AI for atleast another 2 years.\n\nIf you have a long horizon (3+ years) Micron could be a great stock to hold. Short-term? It's gambling. Micron is extremely volatile.", "score": 3, "replies": [{"body": "This is EXACTLY what I'm reading. Thanks for validating. Even their 10-K calls this out. DRAM/NAND pricing has falling almost 50% in the past 2 years. They can't continue to make good gross margin with that kind of drop in their price.\n\nThe only way the price goes up is increased demand, lowered supply, or technology innovations in manufacturing. Since MU does all their own manufacturing, I was hoping they could trickle some of that information.\n\nThe only thing I could find was the CEO of MU eluding to it in passing in this talk: https://youtu.be/Bvdw3eO72Y8?t=320\n\nHe brings it up at around 5:20. DRAM/NAND prices falling. CEO says that he's looking at long term demand trends and is claiming their secular. But he doesn't give any details, which gives me pause as to his real strategy and ability to execute.", "score": 1, "replies": [{"body": "I guess the bottom line is captured in this \"FOOL\" article: https://www.fool.com/investing/2020/06/30/microns-memory-chip-prices-firm-up.aspx\n\nObviously, disclaimer that this website is known for being sensational.\n\nBut since MU makes a commodity product, they're influenced by macro factors. MU is the equivalent of a potato farmer. If their product doesn't differentiate from any other storage manufacturer, they will get clobbered by macro price factors in the supply/demand market.", "score": 1, "replies": [{"body": "The bull case for Micron is that memory is starting to become an OLIGOPOLY and 'cooperation' between the major players limiting supply could fix prices at higher levels. With current R&D and CapEx requirement it will be impossible for new players to enter the market (Except for China entering the NAND market next year, danger alert).\n\nThere's now only 6 companies selling NAND (Samsung,Hynix,Micron,Intel,WDC,Kioxia(Toshiba) and 3 companies selling DRAM (Samsung, Hynix, Micron). This used to be different in the past with 10+ companies having large market shares in both NAND and DRAM. Many companies have gone bankrupt or have been taken over by bigger players. See: Micron buying Elpida in 2013.\n\nIf these companies 'become smarter' and limit supply so that it doesn't exceed demand and hurts pricing, profitability in the memory business could improve greatly. \n\nEspecially in the DRAM business this seems likely as there's only 3 players instead of 6. China is aiming to enter the NAND market with their own products next year, but they are failing to get proper DRAM manufacturing started at all. Hightech DRAM is generally more difficult to produce than NAND.\n\nIn mid 2021 there will be a transition to DDR5 memory for server/cloud chips which will be a major tailwind for DRAM starting from ~mid 2021.", "score": 2, "replies": [{"body": "Amazing insight! Thanks for this comment.", "score": 1, "replies": []}, {"body": "Looks like Apacer just reported that DRAM and NAND will be oversupplied through H1 2021. Holding Micron for a cyclical cycle will include a long hold through H1 2021 it seems.", "score": 1, "replies": []}]}]}]}]}, {"body": "I bought MU 2 years ago when it was around $50. The price doesn't seem to move, and they don't have ways to generate more revenue other than selling their current products. So I sold it with a slight losses. No regrets thought, I put all that money into AMD around $50.", "score": 2, "replies": [{"body": "This is what I'm thinking. I see the stock maybe getting to $70, but reading their business plan, its not clear how they're going to combat the aggressive reduction in price of the DRAM and NAND chips. Since they manufacture their own solutions, I was hoping for some innovation on driving down the cost of manufacturing. Its not clear based on any of the research I've read.", "score": 1, "replies": []}]}, {"body": "you guys don't follow the cyclicality of this stock do you?", "score": 1, "replies": [{"body": "Can you elaborate? I'm willing to learn.", "score": 1, "replies": [{"body": "It goes thru booms and busts, their products go in cycles, I didn't know this in my younger days and bought near the peak of like $33 in 2013 and then it dropped to like $8 then boomed to $64 a few years ago at another peak, the drop down to $30 wasn't really the bottom but people catch onto the cycle by now and are anticipating the boom up. Demand is up for some things like data centers but with things like cars and ai that didn't need memory before, I think a boom is sooner than a bust cycle", "score": 1, "replies": [{"body": "Thanks so much for this information. It makes a lot of sense!", "score": 1, "replies": []}]}]}]}, {"body": "I recently added more MU shares thinking it was undervalued.  The more I read convinces me it was a mistake.  Should I just exit and take a loss?  I would probably put that money into an index fund or Wal-Mart and CVS.  My portfolio is tech heavy.", "score": 1, "replies": [{"body": "Whats your investment horizon? I got out of MU because I was tech heavy as well. And I was willing to take my meager gains (I bought in at the low 40's and got out in the low 50's) and reinvest it into other firms as capital reallocation. If my time horizon was 1 year, I would have just held. MU is going to hurt through March 2021 as the supply excess of NAND and DRAM memory will drive down prices. But, I could see them picking up strong into Q2 of 2021 based on the cyclical patterns discussed above by /u/Henk7839 and /u/doctorkar\n\nBoth comments had great bull case reasons for why MU will pop in 2021. I just wasn't willing to hold that long, since investing is all about allocating limited resources.", "score": 1, "replies": [{"body": "I’ll cash some out to buy a house in 2-3 years, but leave most of it long term.  I’m just worried Micron is going to keep dropping.  In that case, I’d rather pull out to invest in something that’s gaining.  I might reenter on the up cycle.  I know that’s literally trying to time the market, but I was expecting MU to follow the rest of the sector this year.", "score": 1, "replies": []}]}]}, {"body": "So 10/16 calls?", "score": 1, "replies": [{"body": "I'm staying away from options as I've been fucked with in a while.\n\nWhats your logic to go for 10/16 calls? Or are you just trolling?", "score": 2, "replies": []}]}, {"body": "I didn’t read all of your post BUT I do know this. One of there major headquarters is right by my house in Virginia and they just did a 3 billion dollar expansion that was completed on time for cloud computing.", "score": 0, "replies": [{"body": "I read about this. I'm long MU.", "score": 1, "replies": []}]}]}
{"title": "What is the next good entry point for TSLA? And what are good stocks to invest now (other than tech) that should surge when COVID situation improves?", "selftext": "[removed]", "id": "i7w3pl", "created_utc": 1597167224.0, "score": 7, "upvote_ratio": 0.77, "num_comments": 27, "comments": [{"body": "Buy Tesla at exactly $1352.21.", "score": 6, "replies": []}, {"body": "I’d go into MSFT, especially if you’re in it for the long term.", "score": 8, "replies": [{"body": "Agreed, I think MSFT, AAPL, and even NET are poised for excellent long term runs.", "score": 3, "replies": []}]}, {"body": "Today might be the day to invest in Tesla if you're intent on doing that.  It's under $1400 at the moment. That's on just released news that Lucid Air has an EV with a 500+ mile range that will begin production early next year. Good news from a competitor will always cause a dip in the price, and my expectation is that it will probably go back up; perhaps by the end of the week.", "score": 3, "replies": [{"body": "Are you from the future?", "score": 6, "replies": []}, {"body": "Thank you! Interesting stuff.", "score": 1, "replies": []}]}, {"body": "Most will tell you that Tesla is way overvalued and they're not wrong. If you're \"investing\" then I wouldn't touch them in their current state. They probably have years of growth already priced in. However, i find them to be good swing trade stocks. If you can snag it in the $13xx range, they tend to swing back and forth to the $15xx range and back quite quickly, within the week sometimes even the day. Ymmv", "score": 5, "replies": [{"body": "That's a solid idea, thanks.", "score": 0, "replies": [{"body": "Keep an eye on it, there isn't much support on the graph as it breaks heavily down into the 1300's and if that does happen there's a likely chance it'll drop further, saying that though, there has been resistance at 1400 so it may just end up staying in this range.\n\nI have a position built but personally would pick up more if it enters between 1100-1250.", "score": 2, "replies": [{"body": "I was going to say the same thing. I like Tesla at 1100-1250 or so. I’m a believer that the future of Tesla’s full self driving technology is where the advantage lies. There will probably be a short squeeze at some point, but no one knows when.", "score": 2, "replies": []}]}]}]}, {"body": "This might be completely wrong, but I saw BUD took a huge hit around when COVID started so I bought up a few shares of them recently. I figure a big company like them should have no problem getting back up when things normalize, so I’m in it for the long haul on them.\n\nThen again Fidelity is telling me they’re overrated so what do I know", "score": 2, "replies": [{"body": "I think BUD is a good bet to rebound to 75$ by next summer.  It’s currently very cheap compared to last few years.\n\nSTZ is another good booze play. SAM is on fire but I can’t make myself buy because I missed the boat.", "score": 2, "replies": []}]}, {"body": "For Tesla it would've been today. Now stock split announced it'll pop a bit.", "score": 2, "replies": [{"body": "I feel like an oracle with this call on splits", "score": 3, "replies": []}]}, {"body": "What’s your time horizon?", "score": 1, "replies": [{"body": "It's not really a time horizon as much as medium to long term prospect of high growth, so high growth/scaleable companies are of interest.", "score": 1, "replies": [{"body": "Then imo you shouldn’t really worry about when to enter Tesla, if like me you are interested in them you think they will dominate in the years to come, so it’s going to be a lot higher in 5-10 years than it is today, tomorrow and next month. Stop waiting and just get in now. I got in at 450 and I’m still buying now", "score": 1, "replies": [{"body": "Nice, I am a bit jealous. \nWill do.", "score": 2, "replies": []}]}]}]}, {"body": "If you want to invest in them long term instead of trading, I think an ARK fund would be great.\n\n  \nI know alot of people dislike them for their expense ratio but it is actually pretty good for an active managed fund. Also the CFO is smart as a whip.", "score": 1, "replies": []}, {"body": "Invest in ARKK etf instead.  They are long Tesla, but also trade around Tesla’s volatility, which is what you want.\n\nCheck out ARKK’s holdings.  I believe Tesla is always, at least, 10% of their portfolio.", "score": 1, "replies": []}, {"body": "I don't know, what was the price per share beginning of the year? Probably that.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I don't think there is a lot of rationality surrounding TSLA stock. Odds are I will be regretful in a few years if I don't invest in it now.", "score": 1, "replies": [{"body": "in a few years? quite possible. But in a few weeks or months? You could be hitting yourself that you bought in at 1388 when you could have waited until it hit 1000.", "score": 1, "replies": [{"body": "That's a bit extreme. If people would let it drop to 1000, it's only because they would be losing faith in Tesla. Maybe low 1200s, but even then, seems pretty resistant.", "score": 2, "replies": [{"body": "we'll see what happens, but I'm just giving you an example. \n\nFrom your replies in this thread, it looks like you already have an expectation where TSLA will be going. Why not go with your gut?", "score": 2, "replies": [{"body": "Diversification, I guess.:) Always open to suggestions.\nI am also waiting for upcoming IPOs.", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "Tesla Announces a Five-for-One Stock Split Nasdaq:TSLA http://www.globenewswire.com/news-release/2020/08/11/2076760/0/en/Tesla-Announces-a-Five-for-One-Stock-Split.html", "selftext": "[removed]", "id": "i807jc", "created_utc": 1597180227.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 28, "comments": [{"body": "[deleted]", "score": 4, "replies": [{"body": "It’s just gonna fuel (pun intended) stock price rally just in time for battery/investor day next month! We haven’t even looked into S&P 500 inclusion either", "score": 1, "replies": []}]}, {"body": "It’s on sale! Get ready Robin Hooders! \n\nWeeeeeeeeeee! 🚀🚀🚀🚀🚀", "score": 3, "replies": []}, {"body": "Intriguing. I may look into Tesla, but I am not 100% bullish on them. \n\nI wasn’t sure how long their $1400-1500 per share was sustainable either.", "score": 3, "replies": []}, {"body": "I have a question. Do you need to hold a full share? I have a 0.69565  of a share of tesla rn. Will that roll over to somthing like 3.5 shares or whatever the math is? or do I need a full share? Just want to make sure I understand this correctly.", "score": 4, "replies": [{"body": "Robinhood or fidelity? Better check with borker", "score": 2, "replies": [{"body": "I have Robinhood", "score": 1, "replies": []}]}, {"body": "Leaving this comment here, since I'm also holding a fractional share for TSLA and am curious about this too.", "score": 2, "replies": [{"body": "Haha i felt kinda dumb for asking, i tried to look it up but couldn’t find much", "score": 2, "replies": []}, {"body": "Same", "score": 2, "replies": []}, {"body": "Hey someone replied to me so check it out", "score": 2, "replies": [{"body": "Thanks for the heads up 😁", "score": 1, "replies": []}]}]}, {"body": "I know this!  They round you down to the nearest whole share and deal the remainder out to you in cash.  One of the downsides of Robinhood.  Not sure about other brokers.", "score": 2, "replies": [{"body": "So say the math was guna work out that I would get 3.6 shares. I would just get 3 shares and then the .6 would be liquidated into my account?", "score": 2, "replies": [{"body": "Exactly!  So that makes a lot of people want to round up, which is part of why the price is jumping", "score": 2, "replies": [{"body": "Hmm that makes a lot of sense, and it’s interesting. Now do figure out what i want to do haha.. well thanks i appreciate it!", "score": 1, "replies": [{"body": "You got it!!  I averaged up to a full share to make sure I end up with an even 5 :)", "score": 1, "replies": [{"body": "Haha i actually did the same thing like 30 mins ago! I think them splitting has a lot to do with their upcoming battery day.. i think they see that announcement plus the split as a way to bring in a ton of new investors", "score": 1, "replies": [{"body": "Plus, and I’m being 100% serious here, this will once again force a push up to $420 lmao.  Meme stocks are very real and Tesla just bought a nice long runway", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "What will the price be after the split?", "score": 2, "replies": [{"body": "Whatever the share price is at the end of the day 8/31 divided by 5.\n\nSo if it is 1800/share, the next trading day it will be $360", "score": 1, "replies": [{"body": "What happens if you sold your share after August 22, will you still get additional shares on August 31?", "score": 1, "replies": [{"body": "--No. The split happens 8/31 at end of day. Whatever stock holdings you have then will get adjusted.--\n\nEdit: I was completely wrong", "score": 1, "replies": [{"body": "“Each stockholder of record on August 21, 2020 will receive a dividend of four additional shares of common stock for each then-held share, to be distributed after close of trading on August 28, 2020. Trading will begin on a stock split-adjusted basis on August 31, 2020.”\n\nI dont know. It says here as long as you held shares recorded on Aug 21, you will receive dividend of 4 additonal shares on Aug 28", "score": 2, "replies": [{"body": "As long as you buy the shares before the trading day of the split, you will get the split shares.\n\n\" **Record date:** This is an important date when it comes to accounting, but it isn't terribly important for investors to know. The record date is when existing shareholders need to own the stock in order to be eligible to receive new shares created by a stock split. Simply put, if you buy after the record date but before the split is effective, you'll be entitled to receive new shares when the split takes effect (I'll explain this shortly). \"\n\n[Split](https://www.fool.com/investing/stock-splits-what-investors-need-to-know.aspx)", "score": 2, "replies": [{"body": "Please do! Awaiting reply. Thanks!", "score": 1, "replies": []}]}, {"body": "OK I stand corrected. That is weird. Never heard of that before. Wonder how that works with fractional shares?", "score": 1, "replies": []}]}]}]}]}, {"body": "I assume it’s going to be divided by five at current price on said day. Of course I could be wrong", "score": 1, "replies": []}]}, {"body": "the pressure is on for the rest, Amazon next", "score": 2, "replies": []}]}
{"title": "Tesla leads China’s EV sales for July, estimate set at 100K units for 2020", "selftext": "", "id": "i7o9yt", "created_utc": 1597135954.0, "score": 192, "upvote_ratio": 0.96, "num_comments": 24, "comments": [{"body": "No comments - 40 upvotes already. Is teslarati botting? There’s a similar trend amongst all of their articles.", "score": 16, "replies": [{"body": "This subreddit upvotes good news.", "score": 33, "replies": [{"body": "This estimate of 100 k is from China. Troy Teslike estimate is 139 k for 2020 for China.\n\nJust for the record.", "score": 11, "replies": []}, {"body": "You don’t see the coincidence in teslarati articles getting 40 odd upvotes within hour of being posted? I don’t see other posts getting the same action and it’s a consistent 40 something.\n\nEDIT: multiple electrek articles sitting at <10 upvotes. Maybe I’m being overly suspicious for no reason, but I’m still curious", "score": 9, "replies": [{"body": "The question of botting is a bit academic.\n\nIf you send a reddit link to 40 friends and family who upvote is that botting?", "score": 3, "replies": []}, {"body": "electrek is not that respected among tesla fanboys... pretty sure people dont tend to upvote electrek stuff, unless extremely exiting", "score": 8, "replies": [{"body": "I’m biased because I don’t like the writer, but I’ve heard similar concerns from other members of this sub who don’t like the news outlet for same reason. Makes me think I’m not the only one who feels this way, but once again, I don’t speak for the sub as a whole. So you very well might be correct.\n\nEDIT: concerns I’ve seen expressed are why I think it’s odd for such a controversial news outlet for what seems like a negative piece (lowball estimates compared to others) to get so many upvotes.", "score": 3, "replies": [{"body": "If he posts news that's good quality fine. But most of the time his articles are things that were already posted.", "score": 3, "replies": [{"body": "That’s the point, the articles are horrible. It takes a big leap over the line of optimistic nonfiction well into the area of sci-fi fanfic.", "score": 3, "replies": []}]}]}]}]}, {"body": "This should be the first statement in the subreddit description.", "score": 2, "replies": []}, {"body": "Not sure if this is that of a good news. China EV market isn't that big after all. Europe market is defintely bigger.", "score": 0, "replies": [{"body": "According to a quick Google search, in 2019, there were around 1.2 million EV sales in China, and about 580k in Europe. So in what way do you propose that Europe is a bigger market?", "score": 5, "replies": [{"body": "There’s no way EV sales are at 1.2M if tesla is only projected to sell 100k cars.", "score": 2, "replies": [{"body": "That was my initial thought. But then I decided the estimates are wrong. We’ve sold 58k model 3 in China this year, so less than 10k/month until December would get us to 100k for the year. That is unrealistically low in my opinion - 12k / month in future already puts us at 118k for this year. No way is 100k sensible :)", "score": 3, "replies": []}]}]}, {"body": "Do you have an article somewhere which says that Europe market is bigger? Would be interested to know for sure. I checked this article and it seems to point that China is much bigger: [https://en.wikipedia.org/wiki/Electric\\_car\\_use\\_by\\_country](https://en.wikipedia.org/wiki/Electric_car_use_by_country)", "score": 2, "replies": []}]}]}, {"body": "How much commentary do you think it deserves? This is about right. It's not your first day on Reddit. No need to pretend you don't know better.", "score": 2, "replies": []}, {"body": "I posted a Tesmanian article yesterday. It had the same pattern, first comments rolled in a few hours later after hitting >30 upvotes.\n\nI also have upvoted a lot of articles without any comments. I only comment when I feel it adds to the conversation.", "score": 2, "replies": []}]}, {"body": "This is actually concerning as the EV market boomed, but the 11k that Tesla sold was a 23% decline over the prior month... hoping there’s some other logical factor that caused the slow down, because if it was just natural demand sputtering this early...", "score": -4, "replies": [{"body": "This happens every quarter.  They start shipping some of these cars to far flung locations and will deliver them later in the quarter.  Never compare 1st month of quarter to last month of quarter.  This is either a rookie mistake or a short troll mistake.", "score": 17, "replies": [{"body": "Thanks, I didn’t realize the first month in a quarter always slumped. Had me worried.\n\nEdit: fixed month - lack of sleep brain.", "score": 6, "replies": [{"body": "July is the first month of the quarter.", "score": 6, "replies": []}, {"body": "No problem 😂", "score": 1, "replies": []}]}]}, {"body": "Between the economic issues in China and the coming Model Y I would imagine we are going to see lumpy numbers from there for some time. The key things I will be looking for from Tesla:\n\n* Market share leadership for the EV segment\n* Growing EV marketspace as it supplants the ICE market\n* higher per unit profits as they localize more of the production\n\nChina is still going to be a huge market for Tesla and will make up the same percentage of the company as planned but I think we can expect the overall growth timeline, rate, and experience to shift as the global markets slow in general. As long as the growth continues in EV/Tesla especially vs declines in ICE we are going to be doing well.\n\nIt may shift some plans regarding commercial vehicles as companies look for cost savings since commercial entities tend to be better at doing ROI calculations than individuals. However I don't think it will long term impact Tesla's growth opportunity in a negative way. Tesla was built to be a long term company and trying to monitor it on a month to month situation is going to hard to do when you have multi-year growth investments in manf required. It made sense to monitor monthly number when the company was in do or die mode month to month but now that they have that solved it is less reasonable.", "score": 6, "replies": []}, {"body": ">This is actually concerning \n\nExcept it's the opposite.", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "i7zji3", "created_utc": 1597178074.0, "score": 4, "upvote_ratio": 0.7, "num_comments": 25, "comments": [{"body": "What's to prevent you from being burnt on some of the big ticket names?", "score": 6, "replies": [{"body": "I sold these puts around earnings and basically went with my emotions knowing they ran up going in. Hence the big names where I wouldn’t need to risk volatility too much for premium  Would definitely stick to my discipline.", "score": 2, "replies": [{"body": "Generally a bad strategy speaking from experience. Stick with the stocks you’ve traded as you’ve already taken the risk versus taking a new one w a new ticker. Unless you don’t believe in those companies anymore", "score": 3, "replies": []}]}]}, {"body": "> I’ve been burnt on my FSLY/AYX, CSPs ~ $3k. The only consolation is it’s my IRA.\n\nNow sure what you mean by burned and IRA being a consolation. Normally, being in an IRA makes it worse, since you can't deduct losses on your taxes and your can't replace the money lost with new money without deducting it from your lifetime max contribution limit. \n\nBut as they are Wheels, does all this mean that you are holding FSLY and AYX shares? Not sure why being in an IRA makes that better?", "score": 5, "replies": [{"body": "Meaning I can’t access it anytime soon anyway and it’s a pretty long time horizon. You’re right, it does seem counterintuitive. I’ll edit. Thx. I sold puts on both Fsly and ayx and they got crushed. Had to buy them back since they crashed and burned.", "score": 2, "replies": [{"body": "> Had to buy them back since they crashed and burned.\n\nSo you were not running the Wheel on those, but you are going to try the Wheel now?", "score": 1, "replies": [{"body": "Correct. Went in with the plan to wheel them, but they both crashed so hard right after er - Ayx is down $20+ at close - figured I’d cut my losses and reinvest in better positions.", "score": 1, "replies": [{"body": "Well, the lesson here is never realize a loss in an IRA, for the reasons already cited. It would have been fine to let those get assigned and then hold for however many months or years you needed to get back to even. You could have written CCs on them all the live long day.", "score": 4, "replies": []}]}]}]}]}, {"body": "3k? Try being burned 6k by fastly!", "score": 5, "replies": [{"body": "Curious, why’d u get into a stock that shot up so much and reached highly overextended levels", "score": 3, "replies": [{"body": "Sold puts at 90. Liked the stock and wanted to own it. Didn't know it would die in a fire after an ok earnings report.", "score": 2, "replies": [{"body": "really? TWLO has poor ER along with five9 and so I was very cautious about entering FSLY considering the flow wasn’t great. Maybe you found something in their balance sheets and business that I didn’t tho, I only did surface level research", "score": 1, "replies": [{"body": "You’re spot on. I got off the fsly train with a profit for the year of $1500. Ayx - rode it up from 90s to 130. Dumb/emotional decisions I made cost me bigly! I’m now 2000 in the red on ayx just based on 1 bad csp.", "score": 2, "replies": []}, {"body": "I figured fsly would beat, which they did, but i never expected this level of profit taking", "score": 1, "replies": [{"body": "Okay, no offense, but you didn’t research into their Earnings then because open reporting they notified investors their biggest client was tiktok. This was dangerous because a ban or acquisition by Microsoft would cause them to lose 15% of their business", "score": 1, "replies": [{"body": "The tiktok aquisition isn't a guaranteed deathknell for them, as msft likely wouldn't immediately move them off FSLY for some time", "score": 1, "replies": [{"body": "Okay, as a trader/investor you need to understand what other investors are thinking. They see the risk in their investment drastically increase as FSLY could be hit by that move. So logically they pull out, chain reaction, and it dumps to approx 80 now. They also reached a very juicy valuation that wasn’t proportional to their business from people pumping it IMO. It was undervalued at like $20, $50 it was good entry, $80 it was pushing, $120 it was overextended", "score": 1, "replies": [{"body": "So, with that logic, can you explain TSLA?", "score": 1, "replies": [{"body": "Tsla? Yeah didn’t it go from like 1750 to now 1400? Same thing, overextension and exhaustion of trend. \n\nIf you mean valuation, I 100% think it’s overvalued. It’s very volatile in its corrections as you’ve noticed probably. 300 to 200, 900 to 300, 1750 to 1400. It’s practically a meme stock, the volatility is great for day traders though. But it’s main core valuation is based on its future prospect of releasing self driving + batteries + still holding the EV lead. All of which they’re doing great in. \n\nFSLY isn’t a bad company, and if it hits 60 I’m gonna buy for sure, 70 I might start to scale in. It’s just recognizing these huge run ups might not be sustainable, I’ve found more success with ranging stocks/reversals because they’re about to start a new trend", "score": 2, "replies": [{"body": "I agree with your TSLA assessment. I honestly look at fsly as a company on better footing than TSLA, because of their proven earnings. But I am a little bummed that I bought in at FSLY around 90, but it's not the end of the world. I may sell another put at 70 and average down if it falls more. Until then I'll sell covered calls to lower my cost basis.", "score": 1, "replies": [{"body": "Great plan! Luckily it’s not a company like NKLA because then I would seriously question your judgement. Ur not a loss of money, just really time since you’ll be stuck holding for a bit. Personall I like these stocks for cloud \n\nSKYY - etf\nFSLY\nNET\nTWLO\n\nSkyy is easier for me to just buy an HOLD. But FSLY has nice premium so like I said, at 70 or possibly reversal before price gets there, I’ll sell pug spreads", "score": 1, "replies": [{"body": "Oh yeah, I don't mess with nkola or Kodak haha. I am not into meme stocks. I like that etf, how do you like wcld?", "score": 2, "replies": [{"body": "I like their holdings, wish they had options linked! Their top 10 positions are all stocks I like though haha", "score": 2, "replies": [{"body": "Me too, with the exception of zoom. Not sure how I feel about them", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "See below. Thx", "score": 1, "replies": []}]}]}
{"title": "Netflix and Tesla are following same trading pattern for past 3 months", "selftext": "# This is the 15min chart, even yesterday both stocks went down -2%\n\n&#x200B;\n\nhttps://preview.redd.it/tgyyzqw5v9g51.png?width=1407&format=png&auto=webp&s=cbf39b5863e33688dc0b57a2f17f7c58f3305b4c\n\nThis is a zoomed in chart, but its the same for 3 months.\n\n&#x200B;\n\nhttps://preview.redd.it/gyadrl0av9g51.png?width=1408&format=png&auto=webp&s=5b492bfe0aa93c7faefecc7586fd306fa6674a84\n\nThis gets me thinking that the rise of both companies is due to a hedge fund. I can't think of anything else to explain this because they are both different companies.\n\nTesla sells electric cars, electric power banks and services such as construction.\n\nNetflix provides entertainment.", "id": "i7hx8i", "created_utc": 1597107725.0, "score": 21, "upvote_ratio": 0.78, "num_comments": 29, "comments": [{"body": "Patterns work until they don't.\n\nReading into coincidental patterns as future indicators is going to leave your asshole hurting.", "score": 59, "replies": [{"body": "I agree patterns have a limited run, but if you can catch onto them before they are gone, you can make good money.   \nAs long as you have a good profit taking strategy and risk control in place.", "score": 4, "replies": []}]}, {"body": "You’re posting this as if it’s a surprise? Most similar size companies trading on on the same exchanges will mirror each other very closely. Computers handle the vast majority of hedge fund and institutional money. Retail is still relatively small at around 20% of market activity.", "score": 13, "replies": [{"body": ">Your posting this as if it’s a surprise? Most similar size companies  trading on on the same exchanges will mirror each other very closely.\n\nThats incorrect, because if you compare tesla with apple, microsoft, you don't see that match.\n\n>Computers handle the vast majority of hedge fund and institutional money.  Retail is still relatively small at around 20% of market activity.\n\n&#x200B;\n\nBut good call that hedge and institutional money accounts for 80% and that computers are handling this.\n\nThis would mean that algorithms are in place to decide netflix and tesla share price, each day.", "score": 2, "replies": [{"body": "They have a lot of in common. They both are not in the S & P 500 and both are in the Nasdaq.  What did you expect?     Apple, Microsoft are in S & P 500.  So yea you won't see a correlation as much.", "score": 2, "replies": []}]}]}, {"body": "Uhh. Most stocks you pick will have the same general pattern because they all follow the market", "score": 15, "replies": [{"body": "I compared tesla  with with apple , amd, intel, berkshire, microsoft,  but there wasn't a match in patterns.", "score": 5, "replies": [{"body": "Start using TOS to develop trading strategies. You will quickly realize that Tesla does not play by the same rules of conventional charting indicators.", "score": 1, "replies": []}]}]}, {"body": "Computer algorithms and the Fed.", "score": 12, "replies": []}, {"body": "I am an East Coast boy born and bred. I took a trip out to Cali/Portland/Seattle last year and visited a bunch of the companies I have invested or YOLO'd in. It is amazing how all the major players are pretty much neighbors over there. Roku shares their HQ building with Netflix and they are both a 20 minute drive from Tesla HQ. Put the Roku chart over those two and I am sure you would have the same. Everyone just rotates employees in that area and it's surreal. I thought I met the smartest people in finance/pharma here in NYC/NJ but those scientists in California are on another level.  \n\nEdit: Just found out Roku has just completed its move to a brand new office building in San Jose.", "score": 4, "replies": [{"body": "yes you are correct, ROKU is very similar to NFLX and TESLA  \nA little bit different because roku is still close to its all time high but Tesla and Netflix are both down a fair bit from their all time highs.", "score": 2, "replies": []}]}, {"body": "It’s not hedge funds. It’s FUNDS. Mutual funds, ETF. They all buy/sell the same shit. Most investment institutions need to take profit periodically, large positions sell of throughout days or weeks. It happens, stop having useless theory and stop being a pig.", "score": 4, "replies": []}, {"body": "I own both Netflix and Tesla long dated calls. 2021. And yes both move the same.", "score": 6, "replies": [{"body": "good to know, do you see a follower between these two.\n\ni.e tesla moves first then netflix?", "score": 0, "replies": [{"body": "Netflix probably goes first", "score": 3, "replies": [{"body": "Interesting, I will watch out for this in coming trading session.", "score": 1, "replies": []}]}]}]}, {"body": "Anyone else ever heard NFLX is a leading indicator of markets?", "score": 3, "replies": [{"body": "I've never heard of that, I always thought it was amazon and google that lead the dance.", "score": 1, "replies": []}]}, {"body": "Perfect.. now all I need to do is accurately predict Netflix movements and I'll know exactly what tesla is going to do!! This is way easier!!!!!; Thank u!!!", "score": 3, "replies": [{"body": "Lmao 🤣", "score": 1, "replies": []}]}, {"body": "just tell me what price to buy netflix and tesla , i’m ready to go all in 1k shares each", "score": 1, "replies": [{"body": "Maybe we can ask these fund managers, they seem to be dictating and manipulating every move. Regardless of company health, standings, revenue.", "score": 1, "replies": []}]}, {"body": "Netflix and Tesla both require electricity to run. DUHHH.....", "score": 1, "replies": []}, {"body": "Same is for Shop and Square", "score": 1, "replies": [{"body": "That kind of makes more sense than Netflix and Tesla", "score": 1, "replies": []}]}, {"body": "They are in the meme stock sector. Makes sense.", "score": 1, "replies": []}, {"body": "Tech stocks move together. Even more so when you have two tech companies with similar long term prospects.", "score": 1, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "A little but crwd is nearly matching JUNE earnings, but docu is still having good earnings. \n\nNot really on the same level as NFLX and TSLA  \nblob:[https://imgur.com/6cb00ba9-cef8-425e-9fdf-c89f611a319e](https://imgur.com/6cb00ba9-cef8-425e-9fdf-c89f611a319e)", "score": 1, "replies": []}]}]}
{"title": "Forget SPY calls... buy DIA calls", "selftext": "The cyclical rotation has begun... Bye bye tech fun... join the DOW JONES big balls gang.\n\nYes tech is a nice long term hold but the stock market is all about **trend** and the story it creates.\n\n**Past:** The tech stock benefiting from lockdown and everyone at home online.\n\n**New:** The return of the beat up stocks... even if their numbers are ugly they'll be bouncing back from the worst two quarters in recent history. (SEE GDP)\n\n* Consider taking profits on tech and stop buying weekly calls as they're set to fail and buy into the DIA calls and buy calls.\n* Keep your silver and gold as the bull run just begun.\n* Today (8/10) Trump mentioned the NASDAQ was at ATH and that he expects the DOW to go back to ATH and above... \n* Mr. Powell and company said they'll be brrrrrrr into the blue caps. Sounds boring like the DOW\n\nThis hurts me as I have ATVI calls which I will let IV crush my balls because it's the autist way.. However I'm getting all my money back by following the new **trend.**\n\nPlease prove me wrong...", "id": "i7iozm", "created_utc": 1597110595.0, "score": 24, "upvote_ratio": 0.83, "num_comments": 30, "comments": [{"body": "Tech gonna go up at least twice as much as DIA tomorrow now just to spite you", "score": 24, "replies": [{"body": "I hope so just so I could not completely lose my ass on ATVI calls.", "score": 12, "replies": []}]}, {"body": "I get that many of us don't want to hear this because of our balls are deep into tech... but I admit to my flaws. Fuck it", "score": 11, "replies": []}, {"body": "From tech straight to main st", "score": 10, "replies": []}, {"body": "I cannot argue. Good dick sucking. Fuck it I'm in!", "score": 5, "replies": [{"body": "gang!", "score": 0, "replies": []}]}, {"body": "List top tickers in the Dow. Thanks. My google isn’t working.", "score": 5, "replies": [{"body": "AAPL, UH, HD, MSFT account for close to 30% of DIA.", "score": 6, "replies": [{"body": "Lol 2 of the biggest tech stocks make up large portion of DOWn Jon's industrial average.", "score": 6, "replies": []}]}, {"body": "\"My google isn't working\"  you are perfect for this sub.", "score": 2, "replies": []}]}, {"body": "OK, fine I\"ll sell puts on DIA and DDM!.. You asked for it, When I sell puts, the computers will need to drop it below the strike I sell or else I make money buddy..\n\nSo Get ready for DDM and DIA to start dropping tomorrow if I see good premiums on puts to sell.\n\n\nThat is ThetaGang.", "score": 4, "replies": []}, {"body": "I like this post as much as I love making love with my farm animals.", "score": 3, "replies": []}, {"body": "Trying to time a rotation is like trying to time the market, you’re gonna be late every time unless you’re some head honcho autist", "score": 3, "replies": [{"body": "This started a week ago and it's just getting started. IWM calls for me.", "score": 1, "replies": []}]}, {"body": "This happened about 2 weeks ago were tech was down and everything else went up.\n\nIt only lasted about a day.", "score": 3, "replies": []}, {"body": "I will never alt QQ-Q, who's with me?", "score": 2, "replies": []}, {"body": "Nah. We bout to get main stream media spinning how shitty trumps been at Covid and how it’s gonna kill us all in the fall. \n\nSports and schools gonna shut down at some point this semester too I think. \n\nThen people gonna remember airlines won’t be profitable for years, if ever, and cruise ships don’t sail till next year. \n\nI was bullish on travel and value in May/June but I think it’ll take longer. \n\nThink tech gonna be around awhile longer", "score": 2, "replies": [{"body": "Yeah airline won’t survive as they are bleeding cash so is the cruise line. Buy tech on pull back.", "score": 3, "replies": [{"body": "Yeah dude airlines r fuk. Same with cruises sadly. Don’t see this recovering for a good bit", "score": 2, "replies": [{"body": "Cruises and airlines were literally pumped up today what 2-3% what are you talking about?", "score": 1, "replies": [{"body": "He’s talking about how ppl think it’s back to normal. It’s not and won’t be for a minimum of one year. The price you see right now when factoring cruise company diluting their stock to raise cash in March bottom. Is quite high.", "score": 2, "replies": []}, {"body": "It’s not gonna last man. They do random pumps all the time. Airlines not gonna last till travel returns at this rate. They’re gonna have to get another bail out and probably cruises too. \n\nI expect some to merge or disappear entirely before this is all over", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "i bott da dip", "score": 3, "replies": []}, {"body": "listen to the market.", "score": 1, "replies": []}]}, {"body": "my portfolio and my 3 indian kids are depending on this. don’t let us down.", "score": 1, "replies": []}, {"body": "Lost my ass on ATVI calls as well... hope you’re right lol", "score": 1, "replies": []}, {"body": "Bought my first option today. Have no idea how the stock market works. ATVI 8/21 $83.5c. Immediately lost most of my money. I love this sub!", "score": 1, "replies": []}, {"body": "DIA Is a good play but I'm going IWM.", "score": 1, "replies": []}]}
{"title": "The way to keep RH nice, tidy and green...", "selftext": "I just sell everything that’s red, and buy back immediately. Starts off green right away - works 100% of the time!\n\nPRPL, SLV, TSLA calls for you down. SELL. Then buy back and prepare to enjoy a nice green portfolio.\n\nOnly works with, when your wife’s boyfriend gives you a weekly allowance :)", "id": "i7snot", "created_utc": 1597155593.0, "score": 112, "upvote_ratio": 0.92, "num_comments": 18, "comments": [{"body": "who are you so wise in the ways of trading?", "score": 40, "replies": []}, {"body": "Wait I sold my red stuff and bought it again and it's already red again help what did I do wrong", "score": 32, "replies": [{"body": "Just rinse and repeat. I tell you - this cannot fail!", "score": 19, "replies": [{"body": "I rinsed and repeated but now robinhood won’t let me buy anymore stocks", "score": 9, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "just missing the free share achievement I need it now", "score": 2, "replies": []}]}]}]}]}, {"body": "remember if you buy at 100 and sell at 80 then buy at 80 and sell at 100 you would’ve lost only 20% but then earned 25%", "score": 17, "replies": [{"body": "That's big brain", "score": 4, "replies": []}]}, {"body": "I see you work in IT", "score": 1, "replies": []}, {"body": "Omg it works thanks a lot", "score": 1, "replies": []}, {"body": "Damn, appreciate the hot tip. I’m having a red day, but not for long!", "score": 1, "replies": []}, {"body": "I actually cut my losses on some shit and made about half of it back 🗣🗣. Goes down as a Green Day for me", "score": 1, "replies": []}, {"body": "My wifes boyfriend is an ISIS commander hes super busy", "score": 1, "replies": []}, {"body": "Except now you can’t write off your losses", "score": 1, "replies": []}, {"body": "Has this money glitch been patched yet??", "score": 1, "replies": [{"body": "Still works - plan to execute on this first thing tomorrow morning", "score": 1, "replies": []}]}, {"body": "I do not recommend doing this there's a few reasons why (whitewashing for one)", "score": 1, "replies": []}, {"body": "Turn on color accessible that works too it turns the red to pink lol", "score": 1, "replies": []}, {"body": "Terrible, if I was your dad id be ashamed.", "score": 0, "replies": []}]}
{"title": "Chip makers means free trendies?(NVDA/AMD", "selftext": "$QQQ down this morning, both $AMD and $NVDA down a bit after weeks of free i missed out on  \n\nI may be retarded but I’m typing this now on my Nvidia GPU computer, and I used to sell AMD CPUs to nerds as a day job(who bought them up like candy), 100% good reasons to believe in these 2 \n\n\nAt first when I saw the BofA price target increase on NVDA to $520, I thought they were retarded... that would be almost a ridiculous increase in market cap... then I decided to stop thinking and decided to follow BofA just this once.. am I retarded??\n\nNVDA $510c 8/21\n\nAMD $84c 8/21\n\nAMD $84c 8/14", "id": "i7tjk8", "created_utc": 1597158898.0, "score": 5, "upvote_ratio": 0.7, "num_comments": 28, "comments": [{"body": "Hey, Don't forget about INTEL\n\nhaha", "score": 16, "replies": [{"body": "It took 6 shots of whiskey to forget about what INTEL did to me... :(", "score": 8, "replies": []}, {"body": "Even if intel is doomed, which it’s not, it’s going to fill that monster gap soon. I’ve been loading up on 10/13 60c.", "score": 3, "replies": []}]}, {"body": "AMD probably gon retreat to low-mid 70s first", "score": 11, "replies": []}, {"body": "Those 8/14 calls are just inting. I have 81c 8/14 and don't even feel good about them, retard", "score": 3, "replies": [{"body": "I got the 8/14 one last week... held thinking stonks only go up.. am definitely retard", "score": 4, "replies": []}]}, {"body": "What about TSM", "score": 3, "replies": []}, {"body": "Ok I bought 8/21 $79c with my wife’s savings. Let us all pray it goes up from here so maybe she’ll let me watch her get plowed one of these days", "score": 3, "replies": [{"body": " RemindMe! One Week", "score": 2, "replies": [{"body": "There is a 1 hour delay fetching comments.\n\nI will be messaging you in 7 days on [**2020-08-18 19:49:55 UTC**](http://www.wolframalpha.com/input/?i=2020-08-18%2019:49:55%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/i7tjk8/chip_makers_means_free_trendiesnvdaamd/g14voue/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fi7tjk8%2Fchip_makers_means_free_trendiesnvdaamd%2Fg14voue%2F%5D%0A%0ARemindMe%21%202020-08-18%2019%3A49%3A55%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20i7tjk8)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Welp, we may both need to search up the nearest homeless center soon", "score": 2, "replies": [{"body": "What a disaster... somebody take me out to Wendy’s I need some snacks", "score": 1, "replies": []}]}, {"body": "Congrats retard and fuck you", "score": 1, "replies": []}]}, {"body": "Just got killed by amd and nvidia today. Fml ride it till the red comes out the ass am I right!?.... seriously am I right I clearly have no idea what I'm doing lol", "score": 2, "replies": []}, {"body": "Oh so you got a NVIDIA GPU and AMD CPU and so they will rise?\n\n Are there publicly traded dildo companies ? Sit on one of those and buy calls. Same reasoning.", "score": 4, "replies": [{"body": "I mean is it an industry leading dildo?", "score": 7, "replies": [{"body": "I buy only the highest quality dildos on the market, sir", "score": 1, "replies": [{"body": "AMDildo said to be rapidly taking butthole share from rivals, raises guidance. Rival INTButt announces delays to 7nm prostate tickler, shares fall", "score": 2, "replies": []}]}]}]}, {"body": "Nividia is taking a shit today", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They just need to not fuck me this week because i have quite a bit of Mula riding on those cucks", "score": 1, "replies": []}, {"body": "Wouldn’t nvda owning SoftBank be bullish?", "score": 1, "replies": []}]}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**NVDA**|**$510**|**BUY CALL**|**2020-08-21**|**$2.63**|**$442.0015**|**2872**|**24**\n|**AMD**|**$84**|**BUY CALL**|**2020-08-21**|**$1.39**|**$79.98**|**956**|**474**\n|**AMD**|**$84**|**BUY CALL**|**2020-08-14**|**$0.49**|**$79.9895**|**6654**|**2568**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckdq3co1bb57b0768rxsj2ko0) | [Track Record](https://www.pickmojo.com/user/ihopkid/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "Good call, i'm more drawn to TSM for some reason, read [this](https://www.zaginvestor.com/tsmc-investing-in-semiconductors/) earlier last week\n\nbought the stock instead, cause i'm an idiot on this :D", "score": 1, "replies": []}, {"body": "That price target was for the EOY you retard", "score": 1, "replies": []}, {"body": "I think NVDA $510c 8/21 is a bit of a stretch. I'm hoping for a run up before earnings, but my break even is around $443 and I'm still not sure if this will print with how things have been trending.", "score": 1, "replies": [{"body": "Happy now?", "score": 2, "replies": [{"body": "Yeah, definitely a good day for NVDA. I'm stuck in a weird spot that drives me nuts. I've got debit call spreads open that expires 8/28. Both legs are currently ITM after today's performance, but I find that it's damn near impossible to close the spread for the full difference between the two legs.", "score": 1, "replies": []}]}]}, {"body": "Opened a position today in AMD!", "score": 0, "replies": []}]}
{"title": "WMT", "selftext": "Expecting an earnings crush on the 18th for quarter 2 support at 130.24 and 2nd level 128.60. Plenty of time to run up. Options still cheap, expecting a 140 PT around earnings and 145+ after. Anybody else with me on this. \nTotal of 9 positions, picked some up on the dip this morning \nAll 8/28c \n1-129c\n2-132c\n1-133c\n1-135c\n1-136c\n2-138c\n1-140c\n Update added another 135c and currently down $25. Gave up 300 in gains.", "id": "i7u21b", "created_utc": 1597160709.0, "score": 8, "upvote_ratio": 0.79, "num_comments": 29, "comments": [{"body": "I see your data, but frankly if 76% analysts recommend buying it, how could it ever go down? Clearly your points are useless.", "score": 9, "replies": [{"body": "Stonks only go up?", "score": 5, "replies": []}]}, {"body": "I’ve been bag holding Dec 160cs for a month now.  I’m starting to think this stock will never got above 132.", "score": 6, "replies": [{"body": "132.93 resistance 1st level and 133.70 second level. Need some volume which we should expect on the earnings run up. We will break it", "score": 7, "replies": [{"body": "You’re making money, bro.", "score": 1, "replies": [{"body": "Picked up more during the dips today, trimmed some of the position at EOD. Holding the rest through earnings.", "score": 2, "replies": []}]}]}, {"body": "Hope you’re still holding those", "score": 2, "replies": [{"body": "I’m still in", "score": 2, "replies": [{"body": "Nice! Any predictions for tomorrow?", "score": 2, "replies": [{"body": "If there’s a god in heaven they beat and then announce Walmart+ on the call.  \n\nBut honestly, I’m hoping it settles around 140 this week and Walmart+ comes sometime soon.", "score": 2, "replies": []}]}]}]}]}, {"body": "They just announced they’re teaming up with instacart too so it should go up today as well", "score": 4, "replies": [{"body": "I liked WMT because I thought they were going to develop their own delivery infrastructure. I was picturing branded delivery trucks zipping around the city like mail trucks on a route.", "score": 1, "replies": []}]}, {"body": "Got in yesterday morn", "score": 3, "replies": []}, {"body": "I’m in", "score": 2, "replies": []}, {"body": "What’s your position?", "score": 2, "replies": []}, {"body": "positions or ban mf", "score": 2, "replies": []}, {"body": "In", "score": 1, "replies": []}, {"body": "I've got 137c", "score": 1, "replies": []}, {"body": "I'm in.", "score": 1, "replies": []}, {"body": "Ex-dividend on 8/13. I saw a tweet that someone bought like $4MM in $135p for 8/21, likely to play the ex-dividend date. \n\nI was planning to sell a bunch of my WMT calls pre-earnings, but looks like I might hold through. \n\nPosition: 15 $130/$140 spreads Sept, 4 $125c Sept", "score": 1, "replies": []}, {"body": "Earninga crush will only happen if IV is actually high near earnings correct? Right now IV is still low for WMT", "score": 1, "replies": [{"body": "No I meant that earnings will be good. Not IV crush", "score": 1, "replies": [{"body": "ahhh i must have read the post wrong then, my bad.\n\n&#x200B;\n\nAlso i am not so sure earnings will be as good as expected. i Think last quarters great earnings came from mass spending from hysteria, and this quarter people realise theres enough toilet paper for everyone.", "score": 2, "replies": []}]}]}, {"body": "In", "score": 1, "replies": []}, {"body": "BOT +5 WMT 100 16 OCT 20 180 CALL @.19 PHLX\n\nLong exp, far OTM, let's get itttt.", "score": 1, "replies": []}, {"body": "I rarely see WMT discussed in the daily threads. This is good to avoid the wsb kiss of death.\n\nHolding calls for last two weeks. 65 x 145c 10/16. I've been +/- 10% gains last few days.\n\nThey are gonna crush earnings imo and will likely release WMT+ or a big update.\n\nI am Bullish on WMT. My last play was UPS for 305% gainz. \n\nWMT is a boomer slow moving stock so only play weeklies if you are truly autistic. Good luck all and let me know if you have any questions!", "score": 1, "replies": []}, {"body": "In", "score": 1, "replies": []}, {"body": "In", "score": 1, "replies": []}, {"body": "When everyone here is in it I get nervous - but I have 7 150C 1/21", "score": 0, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "i7wfhx", "created_utc": 1597168273.0, "score": 16, "upvote_ratio": 0.78, "num_comments": 26, "comments": [{"body": "too late for kodak puts or what", "score": 3, "replies": [{"body": "I still have mine. It’ll be a wild ride. If the loan back on, it surges maybe 25-75%. But it’s going to bleed out down to $6 or $7 I think until that reaches clarity. Risk is risky :)", "score": 5, "replies": []}, {"body": "Have you seen that IV?!? I wanna say I’d go in, but almost a 400% IV is insane. Don’t wanna get crushed even if the stock goes to $7", "score": 2, "replies": [{"body": "IV if you go a few weeks or a month or two out is around 250%, not 400%. Expensive but not even unlikely with all that is going on. \n\nThis means you either need to believe it’s going to collapse rapidly and move into the money(I do), or you need to be selling call spreads or something (arguably more conservative). Or just go short and hedge with sufficiently out of money calls paid for with selling covered puts deep oom (covered vs your short stock)", "score": 3, "replies": []}]}]}, {"body": "Very cool, very legal", "score": 2, "replies": []}, {"body": "WTF - KODK up 5% after hours today!?  \n\nHow is this not market manipulation?", "score": 2, "replies": [{"body": "So much for puts....", "score": 3, "replies": []}, {"body": "On not that much volume - 800k vs 18m for the day. It’s not that meaningful. Could be manipulation to show green and give people hope into tomorrow that earnings mattered (they don’t) but this game can’t go on forever. So many shares need selling. This could also be RH dip buyers manifesting without the institution selling - a lot of institutions wont well after hours. So you could be seeing what the demand looks like in the absence of the selling pressure. Hard to say. I think its probably the last one, not manipulation. Manipulation is illegal and compliance is looking hard at this at southeastern asset management I think - traders also know its illegal. So I think naked RH buying pressure manifesting AH. The test will be if we see the same pattern or more collapse tomorrow.\n\nQuestion is - is their RH bag holder capacity for the scope of selling? And are the sellers selling all 35m+ or just 10 or 15?", "score": 2, "replies": [{"body": "I didnt even see they had their earnings call today.  I think people will unload tomorrow.", "score": 1, "replies": [{"body": "The unloading may have started today. Very stable vs prior days - looks like someone was selling consistently and carefully except for lunch time where Southeast asset management is located..... awfully big coincidence.", "score": 1, "replies": []}]}]}]}, {"body": "Oy vey!", "score": 2, "replies": []}, {"body": "I saw that this morning too.\n\nMade my puts smile.", "score": 1, "replies": [{"body": "Today is low vol. I think it’s Robinhood dip buying against insiders selling as much as they can.", "score": 2, "replies": [{"body": "If REEtards are stimying my gains I'm gonna be big mad.", "score": 3, "replies": [{"body": "They only have so much money, and will dump. Tomorrow may be bloody. May be seeing it now near close. Rinse and repeat tomorrow until people give up. Unclear if insiders have more to sell than RH buying supply.", "score": 2, "replies": [{"body": "o7 \n\n10-4", "score": 1, "replies": []}]}]}]}]}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Once ER Hits, this shit is going to the bottom of the ocean.", "score": 1, "replies": [{"body": "ER?", "score": 1, "replies": [{"body": "Earning Report, of course they don’t any earning so the stock is dead.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Oh, I missed it, thanks", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Maybe they are waiting for the conference call in 7 mins", "score": 1, "replies": []}, {"body": "I think I understand why is it not dropping, it’s probably because of SSR restricted the short sale for today (I noticed it when I tried to short today and my order didn’t go through). So tomorrow would be the day for it to crash lol.", "score": 0, "replies": [{"body": "I also think the institutional seller may not sell after hours.. notice the only surge was during central time lunch break which is where the trader selling is located.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Are all your options expiring on August 28th? With $10 and $7.5 strikes? So close and yet so far.", "score": 1, "replies": [{"body": "I have $10 aug 28 and $9 as well. Modified positions some.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": []}]}
{"title": "Calm before the Storm?", "selftext": "It has been pretty quiet around our favourite meme stock TSLA during the last weeks. With Battery Day coming up and the potential inclusion into the SP500, could there be some big moves leading up to these events? What do retards think, is worth dumping a few grand on some calls for dem sweet sweet tendies?", "id": "i7xum0", "created_utc": 1597172673.0, "score": 43, "upvote_ratio": 0.88, "num_comments": 23, "comments": [{"body": "Fucking nailed it", "score": 28, "replies": []}, {"body": "The thing about TSLA is that it usually makes big fat moves upwards very quickly so if you dump yo money give yourself some time and then wait for that one great tendie session", "score": 21, "replies": []}, {"body": "They just announced 5-1 stock split", "score": 11, "replies": []}, {"body": "*its happening*", "score": 9, "replies": []}, {"body": "Did you call a storm on SPY? Just lost 5000 bucks in 10 minutes", "score": 6, "replies": [{"body": "F", "score": 4, "replies": [{"body": "U", "score": 2, "replies": [{"body": "K", "score": 1, "replies": [{"body": "[removed]", "score": -3, "replies": [{"body": "Kinda wish I held on to my F Jan 21 $7c. Oh well", "score": 3, "replies": [{"body": "Ha, I'm holding one of these but bought at the last peak I briefly hit even money today...still time I suppose.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "What goes up...must come down. No?", "score": 0, "replies": []}, {"body": "Not as bad but I lost 2 grand in 10 minutes...", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "genius", "score": 1, "replies": []}, {"body": "If there is going to be a storm, then buy vix calls otm..\n\ntry strike 28.. because if we sell-off it will only spike to 28.", "score": 1, "replies": []}, {"body": "[removed]", "score": -5, "replies": [{"body": "Must be from r/investing", "score": 4, "replies": [{"body": "He's just from the past", "score": 2, "replies": []}]}, {"body": "Oh well, if you say so. Guess we are fucked then.", "score": 3, "replies": []}]}]}
{"title": "Is it possible that a major crash never happens again?", "selftext": "[deleted]", "id": "i7yo9y", "created_utc": 1597175296.0, "score": 6, "upvote_ratio": 0.75, "num_comments": 22, "comments": [{"body": "All you have to do is Buy Vix strike 28 calls.. It will hit 28 on the \"sell-off\" or \"2nd wave\" or whatever dumb CNBC tries to call it..", "score": 2, "replies": [{"body": "Playing the VIX is some dangerous stuff.  Get it right you're cumming on the tits of every model in Victoria Secrets catalogue.  Get it wrong, and you're sucking homeless men dicks for crack money.", "score": 2, "replies": []}, {"body": "Yea I was planning on hedging soon like this, is vix really dat good? Like if my whole portfolio is 30% down will this save me lollll", "score": 1, "replies": [{"body": "Only if you had bought vix at the lowest though.. so...", "score": 1, "replies": [{"body": "DW my portfolio is fine right now, this is for future reference 🤠", "score": 1, "replies": []}]}]}]}, {"body": "If you are stupid enough to bet your life savings on stocks  then you were probably going to lose or piss away your money somewhere anyway.  Translation - market crash won't prohibit you from paying bills your own lack of financial responsibility does.", "score": 2, "replies": [{"body": "Tru Tru, I guess as a 20 y.o with few bills my situation is probably not common, most are probably only in the market a fraction of their savings", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "crash coming when noone is looking\n\npeople will get burned but wait ten years and get burned again", "score": 1, "replies": []}]}, {"body": "If it crashes it crashes. Nothing is not possible", "score": 1, "replies": []}, {"body": "I guess my point with this was, if the slave masters kill their slaves that's bad for them so they wouldn't right?", "score": 1, "replies": []}, {"body": "Nope the credit bubble is to massive imo", "score": 1, "replies": []}, {"body": "Let's say a pull back is happening. You are holding over 100k of shares and having few millions profit. Is it smart to hold for loss just to not hurt the feeling of robintards?", "score": 1, "replies": []}, {"body": "Always remember these two quotes.\n\n**For stocks:**\n\n\"In the short term, a market is a voting machine, and in the long term, marketing is weighing machine\" (Benjamin Graham)\n\nif the underlying business doesn't support the evaluation, stocks will crash sooner or later. It doesn't matter, how high or low stock is.  Before 1999 stocks were values insanely, due to internet euphoria, and that led to dot com bubble  \nEven the share prices of blue-chip technology stocks like [Cisco](https://www.investopedia.com/articles/markets/113015/if-you-had-invested-right-after-ciscos-ipo.asp), Intel and Oracle lost more than 80% of their value. It would take 15 years for the Nasdaq to regain its dotcom peak, which it did on April 23, 2015.\n\n**For market:**  \n\"Whatever goes up, will come down eventually\"  \nWhen there is a \"bad\" event a war, next pandemic, financial crisis, etc. It will cause the market to crash, at least for the short term. You can buy Gold to hedge again such events.", "score": 1, "replies": []}, {"body": "You make a very convincing argument why the upcoming crash is going to be worse than the first one... there is quite a gap in SPY from 227-233", "score": 1, "replies": []}, {"body": "Also also wouldn't a big crash with so many new investors hurt the fuck outta the markets future, cuz that'd be millions of people never willing to invest again?", "score": 1, "replies": [{"body": "Didn't seem to stop people from buying after the last crash.", "score": 7, "replies": [{"body": "I don't think 2008 was exactly the most booming time for new investors", "score": 2, "replies": [{"body": "I meant March", "score": 3, "replies": []}]}]}, {"body": "Millions of people don't matter, billions of dollars do. The 80% poorest americans own what, seven percent of the wealth by generous estimates? Stoo pretending this makes sense and just yolo your pocketmoney already.", "score": 3, "replies": [{"body": "Well if those millions can no longer spend money at amazon or Walmart wouldn't it", "score": 1, "replies": []}]}, {"body": "lmao you think the markets not gonna crash because its gonna hurt your little feelings?", "score": 2, "replies": [{"body": "Or cuz it would be catastrophic for millions of people lol", "score": 1, "replies": []}]}]}]}
{"title": "TSLA to 300", "selftext": "[removed]", "id": "i80drw", "created_utc": 1597180802.0, "score": 87, "upvote_ratio": 0.96, "num_comments": 28, "comments": [{"body": "Genius play by Musk, people are going to meme it to $420 instantly ($2100)", "score": 60, "replies": [{"body": "$420.69", "score": 12, "replies": []}, {"body": "FUNDING SECURED 🔒", "score": 4, "replies": []}, {"body": "One can wish. That's one of two calls I own that went downhill from day one. But if they would be even close to that it would be my biggest gains yet.", "score": 1, "replies": []}, {"body": "Assuming it doesn't split higher than that. The amount of people who can buy at 1500 is a lot less than the people at the 300-500 range", "score": 1, "replies": []}]}, {"body": "Really cucking Apple by doing the split before Apple.", "score": 20, "replies": [{"body": "yup. apple is for gray bears.", "score": 7, "replies": [{"body": "I think he do this on purpose right before battery day", "score": 3, "replies": []}, {"body": "I hate gray bears!", "score": 1, "replies": []}]}]}, {"body": "After watching what happened to AAPL, I had to buy shares AH. Let's go.", "score": 6, "replies": [{"body": "Same, copped $25k worth, TSLA to the moon 🚀", "score": 7, "replies": []}, {"body": "After it shot up 6% after hours?", "score": 3, "replies": [{"body": "AAPL was slow to respond to the split, the real pump didn't happen until EOD the following day after the announcement. It's a gamble like everything else here.", "score": 7, "replies": []}]}]}, {"body": "Fuck the gay bears 🚀🚀🚀", "score": 8, "replies": []}, {"body": "I tried posting this as Discussion, Satire and Shitpost. Automod keeps rejecting till I mark it as DD. Forgive the misuse of DD flair.", "score": 7, "replies": []}, {"body": "Think about all the autists who will be able to afford 14 DTE+ ITM calls again and not just FDs. Going to $400 in no time.", "score": 3, "replies": [{"body": "It will go up to $700 no problem. It has retard strength.", "score": 2, "replies": []}]}, {"body": "So...TSLA 1500 puts?", "score": 2, "replies": []}, {"body": "and then its going back to its ipo price", "score": 4, "replies": [{"body": "Lol", "score": 1, "replies": []}]}, {"body": "I got a 1405c 8/14 20 min before close. I wish I had 150k to keep the option.", "score": 1, "replies": []}, {"body": "oh boi where ja hear this?", "score": 1, "replies": []}, {"body": "So no future bag holders just diluted bag holders.", "score": 1, "replies": []}, {"body": "All in TSLA $450p. They dirt cheap", "score": 1, "replies": [{"body": "wat", "score": 6, "replies": [{"body": "Dude doesn't understand that their 450p becomes x5 75p.", "score": 3, "replies": [{"body": "I wasn't sure if it was that or just an attempt at a very bad joke. \n\nBecause if things worked like that every one would be rich. Sounds like those people in the Hitchhikers Guide to the Galaxy that crash landed in some planet and decided to use tree leaves as currency.", "score": 2, "replies": []}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/pgh1979 don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}
{"title": "PCG calls?", "selftext": "Had a bit of cash a little while ago and was looking for a long call, then Tesla made the announcement that they’re partnering with PCG and I bought a bunch of 1/21/22 $25 calls on PCG. They were cheap and its hard to imagine PCG going much lower than post-fire and post-bankruptcy (you know...unless there’s another fire and bankruptcy) and the word “Tesla” is usually enough to empty pockets. Seeing green so far and the price shoots up heavily once a day like clockwork before coming back to earth. Some weird shit. Anyone else jump on the bandwagon? I haven’t seen much talk about it, particularly again given that the word “Tesla” was involved in the same sentence with PCG.", "id": "i81g95", "created_utc": 1597184226.0, "score": 8, "upvote_ratio": 0.67, "num_comments": 24, "comments": [{"body": "[deleted]", "score": 11, "replies": [{"body": "If PCG hits $25 by 2022 I will not get a tattoo or drink my own piss but my $10 and $12 calls will have hopefully gotten me to break even overall on PCG.\n\nAlso, the Tesla thing was announced months ago and groundbreaking on the actual hardware was a couple weeks ago. Old news. Maybe when it comes online it will pump? Bag holders can only hope.", "score": 6, "replies": [{"body": "If PCG hits $25 by Dec. 31 this year I will get a tattoo of me drinking my own piss.", "score": 2, "replies": []}]}, {"body": "25c is astronomical, when it comes to PG&E run muthafucka! Otherwise they’ll burn your house and portfolio down!", "score": 3, "replies": []}, {"body": "Haha You’re not wrong about the delusional optimism. I’m testing out this whole “get in at the bottom” thing.", "score": 2, "replies": []}]}, {"body": "Sell calls?  Got it.", "score": 3, "replies": [{"body": "Lol I can’t say it’s a bad move.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I mean, PCG is gonna be flat at best IMO.", "score": 1, "replies": []}]}]}, {"body": "I’m thinking about adding some 1/21 calls. Your 2022 calls are safe as fuck.\n\nFire? State wildfire insurance fund will cover the bill. Bankruptcy again? Never gonna happen because PCG will never go broke from a fire again because of that fund. \n\nThe reason this is a buy is because people don’t understand this or won’t believe it till it happens. But all the risks are mitigated and PCG is hugely profitable so it’ll moon.", "score": 3, "replies": [{"body": "This was basically my motivation...The whole batteries > cars valuation of Tesla. I mean anything in the near term for PCG seems crazy; I just thought what the hell for 2022. Allegedly this is supposed to be in full swing by then. Key word being “allegedly.”", "score": 2, "replies": []}]}, {"body": "Fire season isn't over yet.", "score": 2, "replies": [{"body": "Fire sale?", "score": 4, "replies": []}, {"body": "$20B says it doesn’t fucking matter anymore", "score": 3, "replies": []}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**PCG**|**$25**|**BUY CALL**|**2022-01-21**|**$0.32**|**$9.09**|**1294**|**18**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckdqictu3hrj50768pyc7zrze) | [Track Record](https://www.pickmojo.com/user/thedeafeningcolors/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "Ferengi Rules of Acquisition:\n\n\n    #108: Hope doesn't keep the lights on.", "score": 1, "replies": []}, {"body": "Wave Bye bye", "score": 1, "replies": []}, {"body": "It's a public utility. Free and clear. Also a safer play if the world falls apart. Maybe?\n\n\nWhat did you pay per contract? RH shows last sale at \n34 cents. That's too high imo. Should be like 10 cents.", "score": 1, "replies": [{"body": "Also PCG traded at $69 before the fire. With the bull run from 2018 onwards it should have been near $100 or more.", "score": 1, "replies": []}, {"body": "“World falls apart” = spy puts?", "score": 1, "replies": [{"body": "Lol. Well maybe. I noticed my private prison stocks have been slowly rising. Those things got battered last month but are seeing more interest. I'd watch stocks like utilities, etc because as people take their profits from tech it's either cash or a mix of cash and safe stocks.", "score": 2, "replies": [{"body": "Yeeesh talk about head vs heart", "score": 1, "replies": []}]}]}, {"body": "Bought a bunch at different times but the avg is 18 cents", "score": 1, "replies": []}]}, {"body": "The 1/22/21 calls are 10 cents each. I picked up fiddy \n\nDoubt they’ll print but whatevs", "score": 1, "replies": []}, {"body": "PCG loves to burn shareholders with ch 11 bankruptcies.", "score": 1, "replies": []}]}
{"title": "The Airlines Play", "selftext": "I'm not going to go over the airlines situation. We all know its fucked for now but they will likely get bailed out and weather the storm. \n\nOptions prices are sky high though so what do you do?  Bullish leap spreads. For those that don't know, spreads are where you make expensive calls cheap by selling a higher strike price. You won't get a 10x bagger but your odds of getting a 2x bagger go way up. If you want to strike it rich on FDs this post isn't for you. If you want to double your money on a long hold this could be it.\n\nWhat you do is buy some ass to mouth calls for Jan 2022. For AAL those cost about $5.90 right now. Them sell some out of the money calls. The $20 strike are sitting at about $3.75 right now. So for $2 you can get exposure to possibly $6 worth of gains and 1.5 years for those gains to be realized. Thats a 3x bagger with tons of time to expiration for cheap.\n\n\nNo more guessing \"is this the week\". Just set it and forget it and come back when your money is tripled.\n\n\nThis is a strat for the patient so if you want to lose money tomorrow you should go elsewhere.\n\n\n\nPositions:\n\nLong AAL Jan 21, 2022 13c (last trade $5.9)\nShort AAL Jan 21, 2022 20c (last trade $3.75)\n\n\nYou can change the strikes up based on your cash and how bullish you are but that's essentially the bull play on airlines.", "id": "i8357a", "created_utc": 1597190206.0, "score": 14, "upvote_ratio": 0.86, "num_comments": 28, "comments": [{"body": "[removed]", "score": 15, "replies": [{"body": "Do it for cruise lines then. Hotels. Any of the areas that got raped by covid.", "score": 12, "replies": [{"body": "WYNN is where is at. They just open Macau to Chinese tourists. Think of all those autistics just salivating to lose money.", "score": 6, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "I’m already up 100% on my WYNN 9/18 97.5c", "score": 2, "replies": []}]}]}]}, {"body": "LOL. Not if you are making money!", "score": 1, "replies": []}]}, {"body": "Just buy shares", "score": 6, "replies": []}, {"body": "Or hear me out.... buy shares of DAL.", "score": 5, "replies": [{"body": "Shares cost $13.  This strategy costs $2.  Leverage baby.\n\nSorry. Dal is almost 30. Same deal though.", "score": 0, "replies": [{"body": "Not really same deal although your strategy might likely work out but I’d do a ATM long call instead cause I’m retarded.", "score": 1, "replies": []}]}]}, {"body": "I'm doing DAL covered calls weekly right now.  Far OTM.  If it actually makes it, I still sell at a profit.  Free money to blow on SLV!", "score": 2, "replies": [{"body": "So you're getting like .10 per contract?", "score": 1, "replies": [{"body": "Managed to pull .24 today for the 14th at 33. So not terribly far but...", "score": 2, "replies": [{"body": "That is free money. Nicely done.", "score": 3, "replies": []}]}]}]}, {"body": "Sir, this is a casino", "score": 1, "replies": []}, {"body": "I threw 3k on this same strategy 2 days ago with DAL which seems like one of the safer bets(compared to AAL lol)\n\n and so far so good, but I went for the June\n2021 cuz I’m an impatient retard", "score": 1, "replies": []}, {"body": "Too late, it’s going down now.", "score": 1, "replies": []}, {"body": "What about selling some puts on those bad boys to fund your long calls?", "score": 1, "replies": []}, {"body": "Please stop with the travel options plays. Total toilet flush in all the names. If you get a hunch buy a weekly and get lucky. There’s no strategy or trend at all in these losers", "score": 1, "replies": [{"body": "You don't think they will recover at all in the next 1.5 years?", "score": 3, "replies": [{"body": "How would you not get fucked by IV tho?", "score": -1, "replies": [{"body": "You would not Because your long leg would be in the money and your short leg will expire worthless....", "score": 6, "replies": []}, {"body": "IV impacts the long and the short leg.  So while IV hurts the calls you buy, it helps the calls you sell.  So it sort of balances out.", "score": 4, "replies": []}]}]}, {"body": "Exactly the perfect fit for wsb", "score": 2, "replies": []}]}, {"body": "I guarantee u that every kid that mentions airlines, travel, cruises here are 17 year olds that think they are smart and gna be millions of dollars.", "score": 1, "replies": [{"body": "I guarantee you didn't read the post.", "score": 2, "replies": [{"body": "Sry i cant read more than 10 words. Which is considered very smart here. All i see is tldr :)", "score": 1, "replies": []}]}]}]}
