{"title": "Thoughts on why the US stock market has been dropping since late Dec 2021?", "selftext": "Disclaimer: I'm only following the US stock market at the moment so that's why I haven't mentioned other markets worldwide. I'm no expert so that's why I'm on here to hear everyone's thoughts \n\nWhat are your thoughts on why the US stock market has been going through the biggest dip since the start of COVID?\n\nIs it\n- the Ukrainian war?\n- oil shortages leading to high prices (somewhat related to the war)\n- high inflation erroding market confidence?\n- overall instability globally due to high govt debt, high inflation, increasing distrust of the banking system (eg after Canada using the Emergencies Act)?\nOr other factors/ combo of other factors?\n\nThanks ☺️", "id": "tagay0", "created_utc": 1646856379.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 36, "comments": [{"body": "Yes.", "score": 15, "replies": [{"body": "Yes to what? All the above?", "score": 3, "replies": [{"body": "Yes.", "score": 5, "replies": [{"body": "Are there more major reasons you would add to that list?", "score": 0, "replies": [{"body": "Ok i feel bad but basically all the reasons you listed would be valid in trying to determine why the markets have been in a downtrend. All of those factors combined seems to be what’s causing all these red days.", "score": 2, "replies": [{"body": "Gotcha - why do you feel bad?", "score": 0, "replies": [{"body": "Yes.", "score": 3, "replies": []}]}]}, {"body": "Yes", "score": 2, "replies": []}]}]}]}]}, {"body": "Elliott Wave 3 is over (The Money Wave), and We're in the middle/end of Wave 4, which is really choppy and hard to predict when it'll be over. Good news though, it's almost over, and Wave 5 should start with quite  a rally, once there's enough velocity to escape the pessimism.\n\nOptimism/Pessimism works in waves. Aside from the 'conflict' and worrying about raising interest rates, there are also a lot of things we should be looking forward to.\n\nEventually, the market will become technically VERY oversold and need to rebound. Look at Germany's DAX index, up neary 8% in a single day, yet they've just been warned they should be cutting back on oil use, and fear that Putin might consider pushing the red button.\n\nThe Quarter will be over in 3 weeks, and earnings reports will start 2 weeks after that....when everyone forgets about what's happening around them, and focus specifically on what they own. Strap in for liftoff.", "score": 4, "replies": [{"body": "I like your optimism ☺️ thank you", "score": 1, "replies": []}]}, {"body": "It’s everything you said", "score": 3, "replies": [{"body": "Thanks. Anything else you'd add to the list?", "score": 1, "replies": [{"body": "The fact that re marked is massively overpriced. It’s about time.", "score": 4, "replies": []}]}]}, {"body": "It’s the big guys all working together to manipulate the market. Politicians, businessman etc. They all profited big during COVID and took their profits and now they want to collapse the market and buy it back again at a huge discount.", "score": -1, "replies": [{"body": "Take off the tin foil hat, buddy.", "score": 2, "replies": [{"body": "Would love to hear your thoughts on the market dip?", "score": 2, "replies": [{"body": "Markets work in cycles. Large ones and smaller ones within those larger ones. \n\nThe market was frothy and had reached all time highs far above the moving averages for the stocks, several sectors were in a bubble, there was a mania in the market for meme stocks and SPACs because the Fed doubled the money supply so the going was good. Until it wasn’t. \n\nAs with most cycles there need only be a minor trigger to start the always inevitable downswing before the next up trend. I’d argue nothing really caused the market to go down but the market. Confidence evaporated because the status quo changed with inflation, the spectre of interest rate rises, and war.", "score": 4, "replies": [{"body": "Thanks for that and I completely hear you. I think what you said about the Fed printing money is similar to what Fun_Airport was saying around big players (eg the Fed) using monetary policy, which had an influence on the boom in stock market in 2021", "score": 1, "replies": [{"body": "No, it isn’t at all.  \nThey implied that there was market manipulation and that it’s somehow a conspiracy, instead of literally being how the economy works. It is the purpose of central banks to intervene to and pull different levers to achieve economic targets set by politicians. \n\nOf course politicians are working to stabilise the markets in a pandemic where a good chunk of the world shut down with people legally required to stay home and no longer consume and transact. The alternative is total economic collapse. The economy is transactions. A market is just a group of transactions of a certain type. Not being able to do those requires intervention. \n\nThe fact the result of that was some people who happened to have seen this kind of shit before, being more prepared than others and profiting from the situation isn’t evidence of a grand a manipulation, it’s just that for the majority of adults (including millennials, now on their 4th adult recession) this ain’t their first rodeo. It’s just the latest cycle.", "score": 4, "replies": [{"body": "Fair call. It's definitely not everyone's first rodeo", "score": 0, "replies": []}]}]}, {"body": "Sad, you sound like an Elliott Wave guy. Nice to meet you.", "score": 1, "replies": [{"body": "I have no idea who that is, but ok.", "score": 1, "replies": [{"body": "It's called Wave Theory. A guy named Elliott figured it out in 1938, that the market moves in psychological waves, which have fractal sub-waves, and larger super-waves.", "score": 1, "replies": [{"body": "Way too much math for me. Fractals? Yuck. No thanks.  \nI’m more of a vaporwave guy.", "score": 3, "replies": [{"body": "Hardly any math at all. It's all visual if you have a good charting tool like TD Ameritrade's Think or Swim product. Not selling the product, just letting you know that it's a great tool for ElliottWave.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Yeah it definitely seemed like the huge rise after COVID was at least partly pushed up by manipulating the market. I guess the big question is when the big guys will start manipulating it up again right...", "score": 1, "replies": []}]}, {"body": "joke ass question", "score": -2, "replies": []}, {"body": "Democrats.", "score": -3, "replies": []}, {"body": "None of the above.  Massive deleveraging event that's managed by the plunge protection team.", "score": 1, "replies": [{"body": "What do you mean by the plunge protection team?", "score": 1, "replies": []}]}, {"body": "QE has begun.  The covid money is no longer being pumped into the economy.", "score": 1, "replies": [{"body": "Do you mean QE has begun or ended? Isn't QE about putting more money into the economy/banks?", "score": 1, "replies": [{"body": "From wiki:\n\n\"Quantitative easing is a monetary policy whereby a central bank purchases predetermined amounts of government bonds or other financial assets in order to inject money into the economy to expand economic activity.\"\n\nI don't think they are continuing to pump the money they were during covid.  Between this and raising interest rates they are trying to cool down the economy.  I think we have a mess on our hands in the near future.", "score": 1, "replies": []}]}]}, {"body": "End of QE means the asset inflation of covid is going back to what it was before 2019. \n\n2800 ish for the spy is where it was around about that time.\n\nI'm betting on it all the way down and have shorted the whole big tech all the way down, leveraged etfs as well.\n\nAll of the market has been unnaturally bloated..and now that air is going down its going down to where it would have been before the pandemic.", "score": 1, "replies": []}, {"body": "sun goes up, sun goes down", "score": 1, "replies": []}]}
{"title": "What is your Sector Allocation? How do you decide?", "selftext": "Here is mine. I try to stay have a similar allocation of the S&P 500, give or take.\n\nTechnology: 23.43%\n\n\\- MSFT, AMD, AAPL, SONY\n\nFinancials: 14.16%\n\n\\- WFC, V, XLF, SOFI\n\nConsumer Cyclical: 14.13%\n\n\\- WEN, LUV, CZR\n\nHealthcare: 10.10%\n\n\\- XLV, TDOC\n\nEnergy: 9.79%\n\n\\- NEE, ET, XLE\n\nConsumer Defensive: 8.38%\n\n\\- WMT, KO\n\nCommunications: 6.81%\n\n\\- DIS\n\nIndustrials: 5.90%\n\n\\- CAT\n\nMaterials: 4.79%\n\n\\- MMM, XLB\n\nReal Estate: 2.96%\n\n\\- XLRE\n\n&#x200B;\n\nDo you think there is a benefit to staying similar to the market, or do you not care about sectors, rather focusing on stocks primarily?", "id": "tadbvq", "created_utc": 1646848123.0, "score": 35, "upvote_ratio": 0.91, "num_comments": 39, "comments": [{"body": "If you are trying to mirror SP500 why not just buy it?", "score": 41, "replies": [{"body": "I don’t like a lot of the stocks the S&P favors. For example, I’m pretty sure JPM is the highest financial holding in the S&P, but I’m not a fan. So even though the allocations are similar, I prefer my companies", "score": 9, "replies": [{"body": "Don't do so much mental gymnastics, man. You're not gonna beat the market with 25-30 stocks in your portfolio, it's like you're a fund manager and they never beat S&P 500. \n\nPut 50% of your money in S&P 500 and use the remaining 50% to buy 5-6 stocks you really believe in (do all mind games and research). You have got a much greater chance of beating the market this way in the long run and it's less mentally exhausting.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I own very little XLF. Overall, I just like WFC a lot more, so I like to hold it individually", "score": 6, "replies": [{"body": "OP - I think a lot of people miss that it can be beneficial to model your portfolio after successful ETFs without the deadweight. Your picks seem solid and if you are a long term investor I think you will be fine. As long as you have a conviction in your plays and can ignore short term noise, deviating from ETFs is fine in my opinion. While you dont have every one of my favorite stocks, you have plenty enough that are financially sound as far as I can tell. How long do you plan to be invested for?\n\nEdit to say I read your other comment and have the same line of thinking: Some of our mega caps are quickly becoming ETFs themselves in the future. If / when they ever get hit with the anti trust act, holders will get the sum of their parts which should be a great opportunity. If they dont, many are still growing at a double digit rate with no sign of slowing down more than the current analyst estimate of the broad market", "score": 9, "replies": [{"body": "I've got a horizon of 30+ years, and I plan to hold each of my picks for that duration if they don't financially change.\n\nI appreciate your thoughts, and I think similarly. I really like DIS as a company, to me it doesn't make a ton of sense to hold XLC (whose top allocation is FB), just to get a slice of Disney.", "score": 3, "replies": [{"body": "Personally, I wouldnt try to avoid FB if you want exposure to the industry. Did you know that under their umbrella they have\n\nFB - billions of users | WhatsApp - most used messaging service, 100B messages per day | Messenger - top 3 messaging service | Instagram\n\nIf you want in to the comms industry, I wouldnt count them out just cause Zuck isnt the most inspiring CEO and the brand isnt the most fun to say you support but investing shouldnt rely on that too heavily", "score": 4, "replies": [{"body": "Can't really argue with any of that. Though. to me it almost feels like Zuck himself has outgrown FB. That and almost everyone I know has quit facebook, even though thats anecdotal, it affects my perception of them", "score": 2, "replies": [{"body": "This is my reason for a bull case on them. I dont know how long it will take, but I think the rebrand to Meta will pay off. FB leaves a sour taste in anyones mouth, cause we have all seen some of the stuff they were responsible for, or at least okay with in pursuit of profit.\n\nStill though, the biggest bear cases I see is about how TikTok has all the kids and I dont really care. Countries need to move around protecting kids data. You know who have money, and like clicking advertisements? The hundreds of millions of people in the older generations, that wont be leaving Facebook for decades (all of this is obviously my opinion, but I think they have a strong bull vs bear case)", "score": 3, "replies": []}]}]}]}]}, {"body": "I can’t find a reason why anyone would prefer WFC, so I’m curious. JPM has a better balance sheet, better brand, better track record on the investment banking side, and wasn’t recently involved in a major scandal like Wells was. It’s even cheaper at the moment.\n\nWhat’s the thesis behind preferring WFC?", "score": 1, "replies": [{"body": "I think WFC very well equipped to handle rate hikes, which I think everyone is expecting. Also, WFC has impressed me with their ability to trim expenses. I also think the scandals, while bad, are contributing to an undervalue of the stock.\n\nJPM is obviously a giant, and I am sure they'll do just fine for themselves, I just am a fan on WFC growth prospects.", "score": 1, "replies": []}]}]}]}, {"body": "55% TECH apple, Microsoft \n25% FINANCIALS J.P. Morgan, Bank of America \n20% CONSUMER DIS Amazon, PG", "score": 1, "replies": []}]}]}, {"body": "110% tech", "score": 19, "replies": [{"body": "This is the way. Took out 3 mortgages for PLTR", "score": 11, "replies": []}]}, {"body": "For a portfolio like yours of 20-25 individual stocks, while you of course wouldn't want all of those stocks to be from one sector, I disagree with the idea that you need to hit every sector and attempting to mirror the weighting of the S&P 500 is downright counterproductive in a 20-25 stock portfolio.\n\nFor a 20-25 stock portfolio, you want to buy a stock when an individual stock is cheap or undervalued, period.", "score": 10, "replies": []}, {"body": "I don't. My buys are based off of what I can understand, see value in, and think is underappreciated by the market to date.\n\nIn practice that means EVs, semiconductors, media, telecom, boring banks/payment processors (without a brokerage arm), and small/value retailers. \n\nMy competencies have increased a bit over time, but I'm not going to invest in mining or trucking for instance because I don't understand them well at all. I'm also skeptical of conglomerates because there are too many different sectors to follow and long-tail events can cause unpredictable consequences based on how those all interact.", "score": 8, "replies": []}, {"body": "I mostly have SPY and few tech giants and growth stocks. \n\nEnergy and financials are part of SPY so why stress.", "score": 7, "replies": []}, {"body": "It depends on your time horizon, but you have a pretty good allocation overall. My only thoughts are:\n\n1. You have a few high PE companies that could use more diversity for sectors.\n2. WFC is a massive company but they have so much risk and are in the news for all of the wrong reasons. Visa is going to take a hit as Apple and others start taking on payments. SOFI has a market cap of 8B with a revenue of 1B. Their NI is increasingly negative. I see no reason to see mass adoption of SOFI or that they'll be massively profitable.  \n3. I don't like anything in your consumer cyclical. The PE's are high or speculative on COVID/economic conditions. \n4. Why TDOC? I review entrepreneurship competitions and it seems like every third person has a telehealth pitch. I see zero barriers to entry here. \n5. Your real estate allocation is heavily weighted in companies that might struggle under higher inflation. \n\nI'm mainly playing devil's advocate, but if we hit hard times you are highly exposed to market sentiment. If it were me (older), I'd pick a few companies with better fundamentals. If you're younger, I'd pick younger companies with higher upside.", "score": 6, "replies": [{"body": "I appreciate your thoughts!\n\nI guess it depends on how you see P/E. VTI has a P/E of 26 and SPY 24. If you consider those market average, LUV and WEN are below average P/E.\n\nWFC certainly has had its issues. But I really believe in the new CEO. I think it will handle rate hikes well and as big of a bank as it is, it will never really fail.\n\nTDOC is more speculative. I think COVID is going to have seriously lasting effects on the younger generation in terms of mental health, health consciousness, and virtual. They have the first mover advantage, I just really think the demand will be astronomical in a decade.\n\nSOFI is what it is. I’m like anyone else whose in it, hoping it blows up and Noto turns out to be Zuckerberg. \n\nOverall, I am very young and am willing to take a swing on companies like that", "score": 1, "replies": []}]}, {"body": "Look at this video. Dalio is a big advocate on diversification. According to him it's a great idea to be in 10-14 different assets. You can lower risk and increase reward. I love his approach. [https://www.youtube.com/watch?v=Nu4lHaSh7D4](https://www.youtube.com/watch?v=Nu4lHaSh7D4)\n\n23.5% - American tech (FB, GOOG)\n\n17.5% - Semiconductor and chips (INTL, MU)\n\n10.5% - Auto insurance (PGR)\n\n9% - Diet space (MED)\n\n9% - Health diagnostics (QDEL)\n\n7% - Health insurance (CI)\n\n7% - Japan tech and entertainment (SONY)\n\n6% - Media broadcasting (NXST)\n\n2% - Gold (GLD)\n\nThe rest in cash position.\n\nI would like something in the financial sector or consumer products. Still looking.", "score": 4, "replies": []}, {"body": "Its a good strategy and most of the companies are quite good companies. Hope you have luck with your portfolio, if not, then just ETF it. Did a similar thing with my own portfolio.\n\nOh, NEE. Had no luck with that company for more than a year. Been a bit angry at myself for buying it. Good dividend tho.", "score": 3, "replies": []}, {"body": "Pretty much all large cap tech at this point.\n\nHave really high free cash flow staples like altria and bti.\n\nHigh free cash flow discrenary like cvs, low, dg\n\nAlso have bmy as a pharma", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You'd be wrong.", "score": 2, "replies": []}]}]}, {"body": "Financials: 36% \n\n—PayPal & JPM\n\nConsumer Goods: 27% \n\n—KO, PG, \n\nAgriculture: 9% \n\n—CURLF and TLRY \n\nReal Estate/Construction: 9% \n\n—IIPR \n\nRetail/Wholesale \n\n— CURLF, TILRAY, RBLX, OUNZ\n\nHealthcare/Life Sciences \n\n— ABBV, TLRY, and CURLF \n\nMy allocation by assets \n\nStocks 81% \n\nETFs 18% \n\n\nI’ve been busy with my financial services. I don’t care to much about sectors but I do like my portfolio heavily weighted in financials and health care(predominately medical devices not necessarily medications). Those are two sectors in my opinion companies can’t go belly up unless they’re blatantly embezzling.", "score": 2, "replies": [{"body": "So long as people spend money and use medicine, sounds like you'll be just fine. Also, you may be the least tech invested investor on all of Reddit.", "score": 3, "replies": [{"body": "Lol, yeah tech is rewarding but risky. I’ve got plans to add DDOG, MSFT and VOO. They’ll be my tech sector along with RBLX. I try to play it safe with tech.", "score": 2, "replies": []}]}]}, {"body": "For me its Tech 20% AAPL, MSFT, KLAC, INTC\nCommunication Services 15% GOOGL, DIS, \nReits 13% O, MPW, \nConsumer Cyclical 12% KO, PEPS, COST, \nConsumer Discretionary 10% AMZN, SONY, Healthcare 10% ABBV, JNJ, SMLR, \nFinancials 10% BRKB, BNS, V, \nIndustrials 7% LMT, \nEnergy 3% PNM\nMore or less.", "score": 2, "replies": []}, {"body": "Legit question…. How do we decide on what sector some stocks fit in?  For example V is a fintech. Is it financial sector? Tech? Or both \n\nI allocated it under tech in my portfolio but not really sure", "score": 1, "replies": [{"body": "It’s difficult for sure. Big companies are basically becoming ETF’s. I just pick what feels right. MSFT could tech, comm, consumer defensive. To me though it just makes most sense as a tech stock. I don’t think there’s a perfect method.\n\nV does all sorts of things, but to me, it’s a financial company", "score": 2, "replies": []}, {"body": "There is nothing tech about any of the money moving services. They are all financial. Only recently have people started attach \"tech\" to everything. Just because they use tech doesnt make them tech. They dont innovate anything which is a huge criteria nor does their technology give them any sort of advantage.\n\nThey are just financials. Everyone including my dog uses tech.", "score": 1, "replies": [{"body": "So you would include PayPal as being in the financial sector?", "score": 2, "replies": [{"body": "Of course its not tech. What tech advantage do they have? To be tech, as defined traditionally, you need a tech advantage. Something that is very hard to duplicate and requires years of R&D to copy. Thats what tech is all about.\n\nThat doesnt mean Paypal doesnt use tech. They do. But they use it the same way a brick and mortar uses assets to conduct their business. But here is the real problem with calling Paypal tech... if Paypal is tech, then all banks are tech. They all have very similar if not more complex tech systems. So where do you draw the line?\n\nFurther, Paypals earnings are more similar to financial counterparts than tech companies who sell software or hardware. So it makes perfect sense to call them a financial company.", "score": 1, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}]}]}]}, {"body": "About 75% in Telekom.\nExpect it to fall below 50 eoy. I'm loading up on other things.\nI finished my goal last months ( goal was in shares).\n\nAltho if USD keeps soaring compared to my currency, I'm fucked.", "score": 1, "replies": []}, {"body": "100% tech\n\n50% big tech/blue chips and the other 50% growth tech", "score": 1, "replies": []}]}
{"title": "Tesla Bull Cathie Wood Says Current Sell-Off Is The 'Most Massive Misallocation Of Capital' In History - Benzinga", "selftext": "", "id": "ta2cb5", "created_utc": 1646810353.0, "score": 128, "upvote_ratio": 0.96, "num_comments": 31, "comments": [{"body": "My biggest misallocation of capital was buying ARKG :(", "score": 70, "replies": [{"body": "Between Elon and Cathie, I pick Elon every time.\nAll in Tesla and never touched ARK.", "score": 26, "replies": [{"body": "Long TSLA but I can't handle having all my eggs in one basket even if I know that diversification is not the way forward.", "score": 10, "replies": [{"body": "I’ve been selling well-out-of the-money covered calls on TSLA and the using those proceeds to purchase s&p 500 index on a weekly basis. If the shares get called away, I pivot to selling cash covered puts at the strike price the shares were sold at. These premiums I also invest in s&p 500 tracked funds. This allows me to be invested in Tesla but also to diversify, and cause any gains in Tesla stock to be compounded.", "score": 4, "replies": []}]}]}, {"body": "Same , big down", "score": 6, "replies": []}, {"body": "F", "score": 1, "replies": []}]}, {"body": "Really hope she turns out being right, I bought several ARK funds to \"diversify\" somewhat. Really should have just bought Tesla.", "score": 32, "replies": []}, {"body": "People will probably paint me as a Cathie Wood hater, but she predicted peak oil in 2019 and said it was going down from $40 (in 2020) to $12. She said it was never going to recover.\n\nNow as we know, it recovered to $90 due to post pandemic reopenings and high transportation demand. Now it's pushing $130 because of geopolitical issues.\n\nShe also missed badly on Zoom TDOC, and other obvious WFH advantaged plays. She kept saying that the pandemic was a catalyst of demand, and not simply a moment in time in which these things became temporarily and unsustainably desirable.\n\nMy point is that Cathie Wood essentially thought that the pandemic would usher in a new era in which none of us ever work in an office ever again, do all meetings via Zoom, talk to our doctor only through TDOC, etc. And she thought that this world would come in 2021. This is utterly ridiculous. You cannot say \"I'm right, my timing is just off\" when this fantasy world will not come for quite a while. Any one can say that.\n\nShe keeps trying to paint this as \"innovation wins\" when it's not obvious how she would have invested properly in other innovation plays in the past. There were plenty of shit \"innovation\" companies in the market throughout history. You don't make money on shit, you make money on good companies.\n\nArk's TSLA thesis is 100% predicated (as it always was) on FSD, when it's clear that manufacturing execution and resulting massive profitability is what got them here, not FSD. In fact, Ark's current PT on Tesla is downright bearish if you take out the value they're adding for FSD (and a wannabe Tesla Uber thing they're advocating for). This leads me to surmise that their analysts do not fundamentally understand Tesla's manufacturing capabilities and execution and instead are just stuck on this ridiculous vision that we're all going to be couch potatoes permanently within a year or two. Their massive investments into TuSimple (instead of increasing Tesla) lends more credence to this theory.\n\nDon't even get me started on ARKX and ARKG.", "score": 31, "replies": [{"body": ">Don't even get me started on ARKX and ARKG.\n\nI'm so glad I got out of ARKG before it shit the bed. \n\nWhat a wet fart of a fund that was.", "score": 2, "replies": []}, {"body": "I remember seeing their team say that Tesla should get into the ride sharing business right now before they even have autonomy. Was so dumb, and ever since then I can’t imagine letting them manage my money.", "score": 2, "replies": []}, {"body": "I think what she taught me is that it's OK to invest growth stocks with high p/e ratios if the thesis is bullet proof. Tesla is more or less bullet proof. Zoom is not. ARKK and arkg probably will be long term, but most investors are short term investors.", "score": 3, "replies": [{"body": "That's really the thing. No one is disputing innovation wins, people are disputing that Ark's innovation stocks win.\n\nLike ARKG. Lots of people think genomics are the future. But there will be winners and and hell of a lot more losers. It's clear from listening to Cathie talk about genomics that she is completely clueless about the minutia (even her broad sweeping points are often misinformed). I know that their analysts are (probably?) more knowledgeable than she in, but how can an investor get any real assurance?\n\nRemember, people aren't investing in or against innovation, they're investing in or against Ark Invest.", "score": 7, "replies": [{"body": "Yeah. That's why I don't do index funds.", "score": 2, "replies": []}]}, {"body": "It really doesn't matter if the thesis is bulletproof. You're still a slave to sentiment and market conditions. Really great stocks can go up, and then absolutely crater just a few months down the line.", "score": 2, "replies": [{"body": "Yep. That's why you don't know if what Ark has is good or not until way in the future. While her funds may go up, seeing that her success in TSLA was essentially luck (since her thesis did not play out at all and instead Tesla became the most capital efficient automanufacturer in history), it does not bode well for the future success of her picks. \n\nShe holds Tesla though, so I can't see complete failure happening, else I would also fail as a 100% TSLA holder. But her success rate is effectively that of a VC firm randomly shooting into the dark.", "score": 2, "replies": []}, {"body": "Well that doesn't matter long term. Short term invest what you can afford to and buy the dip.", "score": 1, "replies": []}]}]}, {"body": "Hindsight is bliss. But IMO a reason most of ARKs stock are crushed is because general market thinks there is no momentum. As you said they had an unsustainable momentum during the pandemic but now the revenue has dropped. I think she sees a company that had a lot of potential pre pandemic, showed it works during pandemic, returned to more sustainable revenue post pandemic (but higher than before) and in 12-24 months the momentum will be evident again so a return to ATHs", "score": 1, "replies": [{"body": "The general market is bearish on moonshots right now. And I agree that if the market goes back to pure exuberance, then Ark stocks will go back up.\n\nSo this is not to say Ark funds will never return to ATH. It is possible. But the bottom line is that many of these companies are probably not worth that much. If we don't go back to a crazy bull market before these stocks play out, then I doubt some of them will ever go back to their ATH.\n\nCathie made it clear that she believed the pandemic conditions were here to stay. If she had said what you said, I would be more inclined to agree with her. \n\nHere's another way to look at it: if we pretend that there is another TSLA in her portfolio, but the rest are kind of shit, we can do the math. Say for instance one of the holdings 16x, and she doesn't sell a single share (unlike TSLA) while the rest of the portfolio stays flat over 5 years. Say that the one that 16xed was 5% of the fund. She'd have a return of 75% in 5 years. Not bad, but a far cry from the 40% annually that she basically promised. For reference, S&P500 is up more than 75% in the last 5 years.\n\nFor her numbers to work (roughly 4x money in 5 years) you need multiple TSLAs in her portfolio and very few if any misses. Given TSLA was the highest returning megacap in the last 10 years, this seems highly unlikely and borderline impossible. Again, even if TSLA went to $14T valuation in 5 years, she needs a couple more of those to even get close to her projected return numbers.", "score": 3, "replies": []}]}]}, {"body": "True, there is probably not a best Company to be invested in than Tesla in the stock market", "score": 24, "replies": []}, {"body": "This is just a money managers way of saying “Crap!  I have been dead wrong on predicting how the markets will move”", "score": 4, "replies": [{"body": "To play devil's advocate, this market is even more illogical that normal.", "score": 2, "replies": []}]}, {"body": "Her fund is seeing net inflows now. Big boys are buying near bottoms and retails are selling. Happens every single time!!!!", "score": 3, "replies": []}, {"body": "Shes wrong.  It's just a return to more normal valuations.", "score": 3, "replies": []}, {"body": "Not a hint of personal interest in her statement and if this re-allocation continues where is her risk management?", "score": 1, "replies": [{"body": "If you ever actually listened to Cathie wood you would know she invests most of her net worth into ark funds.  People say so much stupid shit about her who have never actually heard her talk about anything.\n\nListen to someone before you judge them as “good” or “bad”", "score": 7, "replies": [{"body": "Some people listen to Jim Cramer and trust Seeking Alpha so..🤷‍♂️", "score": 3, "replies": []}, {"body": "I think maybe you didn’t actually read the comment, it was sarcasm. Of course she is personally invested, borderline deluded. This is not an isolated opinion. She got lucky for a while taking excessive risk by any fund managers standards", "score": 0, "replies": [{"body": "She is not deluded.  She has a legitimate strategy and a solid track record.  Ratcheting up risk investments in secular easy money environments is a good strategy.  It’s just super volatile.  We’re on the downswing now, but it will come back eventually.\n\nListen to what she says and judge for yourself, not the hot takes.", "score": 1, "replies": [{"body": "I do listen to what she says, most of it is word salad, from a professional investing track record I wouldn’t exactly call it solid either:\n\n3 yr Alpha: -14, Sortino: 0.33, Sharpe: 0.65: Kurtosis: -0.7 Max Drawdown 47%\n\nI fail to see how she has been anything but lucky.", "score": 1, "replies": []}]}]}]}]}, {"body": "Ok Cathie", "score": -2, "replies": []}, {"body": "She got lucky and now everyone can finally see it.", "score": 1, "replies": []}]}
{"title": "What’s your guys opinion on DIS", "selftext": "", "id": "t9vbvo", "created_utc": 1646786359.0, "score": 26, "upvote_ratio": 0.8, "num_comments": 37, "comments": [{"body": "A good way to lose money is to bet against the Mouse.", "score": 32, "replies": [{"body": "If you bet against in the past year your screen would be green", "score": 12, "replies": [{"body": "Fortunes aren't made in a year.", "score": 19, "replies": [{"body": "They’re made in a day", "score": 16, "replies": [{"body": "And lost in an afternoon.", "score": 9, "replies": []}]}, {"body": "And this sub is about short term trading, not buy-and-hold long term investment", "score": 6, "replies": [{"body": "🤦🏽‍♀️ I think you got woooshed, my man.", "score": 0, "replies": [{"body": "It’s not obviously sarcasm tho", "score": 2, "replies": []}]}]}]}, {"body": "This is true for basically anything this year except for oil prices", "score": 2, "replies": []}]}, {"body": "so then it should be a good money maker to sell bets against the mouse? why isn't thetagang salivating at wsb trying to bet against the mouse?", "score": 1, "replies": []}]}, {"body": "I went to WDW very recently and was rather impressed with the experience, and got me thinking about investing in them again (owned shares right around the time Disney+ was launched). \n\nThey are a money making machine with some of the most valuable IP in the world. Their parks have been leveled up with their App, you can pay more for Lightning Lane, order food on the app, pay for things in the gift shops with the app…they are finding more and more ways to get money from their customers…and I’m not even mad about it. \n\nThey also just announced that they are building an entire community just outside Palm Springs. Me and more they are becoming synonymous with an experience, no matter who you are or if you have kids. They are up there with Apple IMO.\n\nI also like Nintendo for similar reasons.\n\nThe future continues to be focused on immersive experiences (irrespective of the metaverse). Check out the new Vanderbilt Tower in NYC as further proof.", "score": 15, "replies": [{"body": "Hold on. They let you pay to skip the queue?", "score": 4, "replies": [{"body": "Yep. Not a full skip but you get to go into the fast lane. They’ve done it for years but this is definitely the most advanced form.", "score": 5, "replies": []}]}]}, {"body": "Ya man. I was looking at that today. I didnt come up with any big thesis yet but its on my list. But i think youre in the right place!", "score": 8, "replies": []}, {"body": "Disneys slide has coincided with the broader market sell off, but they seem to have taken a heavier beating the last few sessions.. thoughts on the extra punches:\n1) the newly announced discounted subscription rate (with ads) is being repriced by the market who originally estimated new subscribers paying full freight \n2) oil pricing may make people think twice about travel? (I believe park occupancies are still on the rise, but this can’t be great…)\n\nOr… could just be a the demographics of investors who own Disney seeking haven in commodities. \n\nAnyway, interested in if you think any of this has teeth?\n\nWould love to open a long call at these numbers soon. \n\nPOSITIONS: 115 AAPL (sell a covered call every other week)", "score": 7, "replies": []}, {"body": "Before streaming and the pandemic, Disney traded with a PE around 19. Once it got into streaming, it got a blended Netflix multiple and it’s PE went into the 40’s. For projected 2022 earnings, it’s PE is around 30 and the S&P sits at around 19-20. Is the past this would be fine because of streaming’s high growth rate but the shine has come off streaming lately. Too much competition - Netflix stock is down 50% since last November and the fact that Disney is trying to juice their subscription numbers with the new, ad supported service does not bode well in my opinion. Great company but I see more downside than upside until this still gets a more realistic PE of 22-25. Not financial advice", "score": 10, "replies": [{"body": "Their earnings got savaged by Covid shutdowns of their parks and cruise line. I believe I read that the 2022 projected earnings are relatively conservative with an assumption of continued Covid related decline in attendance. I am interested to see Q1 earnings and guidance.  \n\nI do agree on your other points except Disney already had a robust film library and studios which I believe almost qualifies as a moat over a streaming competitor like Netflix.", "score": 8, "replies": [{"body": "i would drop my disney sub long before i’d drop netflix. disney gets less time than any of the 6 subs we have at home.", "score": 6, "replies": []}]}, {"body": "I think this Is actually where the value in Disney lies. Earnings are skewed. 12m trailing P/E is super high and as you mentioned for 2022 it’s around 30 even still. Earnings will catch back up. I think last time I looked Morningstar has their fair value estimate at 170 which isn’t a massive amount of upside, but it’s still undervalued even currently. Earnings for 2021 were still only about 1/4th of 2019.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I’m curious to know :)", "score": 1, "replies": []}]}, {"body": "Not a terrible good stock to own unless you had it awhile ago....", "score": 2, "replies": []}, {"body": "I’ve been bad holding for a while after getting assigned on a CSP last year - and it just keeps sinking. \n\nI’m optimistic it’ll grow as people celebrate the end of Covid and travel again.  It’s exactly what people need right now to feel good again. \n\nI’m less optimistic about the streaming service.  I dont think the growth will hold up.  \n\nNet, I see upside but probably not enough in the next few years to make up my deep loss. \n\nFor now I’m holding and selling CCs.", "score": 2, "replies": []}, {"body": "DISGUSTING", "score": 3, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "username checks out", "score": 12, "replies": []}]}, {"body": "I keep hearing the term IP when talking about dis. What is ip?", "score": 0, "replies": []}, {"body": "Great ticker to trade earnings on. Not looking to be long.", "score": 0, "replies": []}, {"body": "There’s plenty of better options out there. Huge discounts right now. I will not even bother", "score": -1, "replies": []}, {"body": "DIS NUTS", "score": -1, "replies": []}, {"body": "Not bad to wheel", "score": 1, "replies": []}, {"body": "0.1 delta weekly CSPs keep going expired, so that’s something", "score": 1, "replies": []}, {"body": "You’ll be hard pressed to find a time when they’re undervalued or even fairly valued, but it’s Disney, the question is how much are you willing to overpay for one of the most solid businesses in America. Disney+ is still a young segment so it’s far from Disney+ = Netflix. If you want to own Disney you don’t get many screaming buys but there are other stocks that are at a better valuation IMO.", "score": 1, "replies": []}, {"body": "I did a DCF calculation on DIS 2 weeks ago. Granted, this is with a lot of Covid data and my own assumptions. But I still got a fair value of $157 for it… even if you account for a 15% margin of safety, it would still be $133. So I’d say it’s a great price to be buying right now, especially if you are buying using CSP.", "score": 1, "replies": []}, {"body": "I’d buy hand over fist if they spun off ESPN.  Too much of Disney’s revenue is dependent on ESPN and the linear TV subscriptions.  I’m not paying a growth stock multiple when the linear TV business is in a secular decline.", "score": 1, "replies": []}, {"body": "Holding for many years even though unfortunately they ruined Star Wars", "score": 1, "replies": []}, {"body": "Somewhat bullish -- people I know with kids all have Disney+, economy re-opening seems good for their parks, chart approaching possible support: [https://ibb.co/9cYZvxr](https://ibb.co/9cYZvxr)", "score": 1, "replies": []}]}
{"title": "Do you see what the market makers doing? Which of the 5 strategies are you taking?", "selftext": "there has been some interesting market trading sessions the last week. With all that's happened so far I have seen 5 major plays that require a lot of conviction for YOLO opportunities please tell me what are betting on. Now think and listen closely. \n\nwe have war, we have inflation,  and we have a market that has proven to lose stability when squeezes initiate themselves.  Now listen.\n\nMy belief is with the market crashing yesterday the plays to pick from is all cash, all Sp500 index, all energy, BBBY or acronym short squeeze.  \n\nUndeniable data and research had been done to identify that GME squoze so high because the market cap had fallen so low and such a large retail movement had grown since the market algos left this stock to die. \n\nLately we have seen lame squeeze after squeeze with well name stocks like IRNT, BBIG, and PROG. But in reality the individual tickers has been quite since the June AMC Run.\n\nNow, unless you have a message from the God's you cannot ignore this message. I am gonna yolo on acronym I Hope you all find what you are looking for, but where are you going to put your money tomorrow?", "id": "t9uv09", "created_utc": 1646784926.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 34, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|1 year ago\n**Total Comments**|70|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=t9uv09)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=t9uv09)", "score": 1, "replies": []}, {"body": "what the fuck am I reading?", "score": 24, "replies": [{"body": "super retard level autism", "score": 4, "replies": []}, {"body": "IDK(I Don't Know)", "score": -2, "replies": [{"body": "is this what you mean by YOLO on acronyms ?", "score": 2, "replies": [{"body": "No this is just an example.  The acronym is somewhere else.", "score": 0, "replies": []}]}]}]}, {"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 16, "replies": []}, {"body": "There is more than 5 choices but let's keep it simple .\nI'd you see 5 strategies then you should go for all of them simultaneously", "score": 5, "replies": [{"body": "Unless you know which one of the 5 is the actual threat and also know the other 4 are designed distractions to limit and neutralize the threat... but the threat will still be the best investment regardless of market market efforts.  Good luck!", "score": -1, "replies": [{"body": "Are we talking about strategies or threats ? \nI'm thinking you see 5 strategies so based on that is say you should do all 5 .\nIn my opinion though there is more then 5 strategies", "score": 2, "replies": [{"body": "I'm saying the markets moved in specific areas in ways it hasn't out of much of the last year,  ridiculous moves up and down and it was intentional to catch interest and distract.  I'm suggesting most event gamblers will pick between 1 of my 5 options or some form of it.  And I'm dropping bread crumbs trying to lead them to the right answer.", "score": 1, "replies": [{"body": "Ok, I'm not sure how each of your 5 notes have any difference from each other . Are you saying BABA went down  intentionally distract and Alcoa went up for the same reason ? \nI have a hard time believing that", "score": 2, "replies": [{"body": "The market sounds 2% moves 3 times that.  99.999% stocks were put on 1 algo and then a few other stocks with a few other stories were put on another algo.  I'm saying only one stock that has so much buying pressure that it can only go up and everything else will go exactly where the market makers want it to go.", "score": 1, "replies": [{"body": "I don't agree but ok \n\nI'm still not sure about what your 5 strategies are", "score": 3, "replies": [{"body": "This dude is like a Qanon for stocks", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "This ain't no movement you fuckin mouthbreather. Trading is not a team support.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 7, "replies": [{"body": "Team sport* wtf is team support 🤣", "score": 2, "replies": []}]}, {"body": "OP. And IO", "score": 2, "replies": []}, {"body": "I wish they would allow post about this stock. I really wonder what the tards of WSB think about it.", "score": 2, "replies": [{"body": "Most don't know,  the ones that do know will shill about an early start up and fundamentals. This although can be an easy fundamental play,  the squeeze is happening regardless!", "score": 1, "replies": [{"body": "You can't be a shill and call others shills. Please tell me \"okay whatever bro, miss out on an opportunity\" I dare you 🤣🤣🤣🤣", "score": 0, "replies": [{"body": "It's a certainty anyone not 100% invested is very noobish.", "score": 1, "replies": [{"body": "Hey idiot you realize your crappy translater didn't translate the ticker? Are we all going heavy on acrynym?", "score": 0, "replies": [{"body": "I think some will be able to read between the lines.", "score": 1, "replies": [{"body": "So you expect them to understand nuance but be dumb enough to follow that advice? Hit the drawing board your terrible at drawing in buyers", "score": 0, "replies": []}]}]}, {"body": "\"woah I'm not all in on this terrible dd and he suggested I'm a noob if I don't go all in\" is that how people are supposed to react?", "score": 1, "replies": []}]}]}]}]}, {"body": "Oh fucking joy. Another short squeeze post. I'd rather chop up a ghost pepper & snort the fucking thing before following the short squeeze crowd into another black hole.", "score": 2, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": [{"body": "Hot damn, bot. You fire.", "score": 2, "replies": []}]}, {"body": "Got some almond milk?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}]}, {"body": "You know, it's a bad rule on my part, but I never trust a post that's broken english 🤷 it's mainly because I get 3 calls a day with a broken english person trying to scam me.", "score": 0, "replies": []}]}
{"title": "3/9/22 SPY Pre-Market Analysis", "selftext": "[removed]", "id": "ta89jp", "created_utc": 1646834059.0, "score": 58, "upvote_ratio": 0.86, "num_comments": 38, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|108|**First Seen In WSB**|1 year ago\n**Total Comments**|1113|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/spxvil/spy_210_the_bear_rages_on/) [x](https://www.reddit.com/r/wallstreetbets/comments/rj1up5/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/lyng6s/buy_the_rumor_sell_the_news_hear_me_out_here/) [x](https://www.reddit.com/r/wallstreetbets/comments/rgqp0q/spy_dec_14th_recap_and_dec_15th_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/riyt4w/december_17th_spy_recap_and_next_week_anticipation/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=ta89jp)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=ta89jp)", "score": 1, "replies": []}, {"body": "That is absurd, who would put money in a bull market right n-\n\n$500K YOLO TIME TO SEE IF I MAKE MONEY OR NOT", "score": 27, "replies": [{"body": "Show me the money", "score": 4, "replies": []}, {"body": "Shit are you millionaire already?", "score": 2, "replies": [{"body": "Who said I put it on a bull market? If I was a millionaire I wouldn't be on this sub", "score": 1, "replies": []}]}]}, {"body": "Surging market into what will obviously be terrible cpi data tomorrow is making me feel puts.", "score": 24, "replies": [{"body": "Same, but the fact that the CPI data is \"obviously terrible\" doesn't really help much there. When it's terrible as expected no one is surprised. If it's slightly less terrible our puts may get blown out.", "score": 12, "replies": [{"body": "yea, but has any data or prices of things the last couple months made you think there's any chance inflation comes in slightly less awful?  And when it comes in even worse that raises the fear of a .5 hike again.\n\nYou're not wrong, but I'm gonna chuck a lot at puts before close tonight if this stays green.", "score": 3, "replies": [{"body": "Just bought my QQQ puts", "score": 1, "replies": []}]}]}]}, {"body": "I’m playing ultra safe today , seeing some weird movement with gold and gush . Normally those don’t fall without reason .it feels like someone is trying to paint a perfect picture of stability and growth a day after declaring a financial war with Russia. Seems like a pump and dump coming. I will be going further out with really wide body iron condors.", "score": 16, "replies": [{"body": "I'm with you here.  I think Plunge Protection Team wants Retail to hold their bags, and all their buddies' bags.  And I say F that.  Bought 3/18 410 PUTS at Open.", "score": 7, "replies": [{"body": "#&#128065;&#8420; *Illuminerdy confirmed* &#128065;&#8420;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": [{"body": "SssshhHHHH!  it's a secret, Bot! god damn!", "score": 3, "replies": []}]}]}, {"body": "> trying to paint a perfect picture of stability and growth a day after declaring a financial war with Russia. Seems like a pump and dump coming\n\nI hate to put my tin foil hat back on but I agree here, seems like we've had some very conveniently green days lately seemingly closely tied to Vlady's madness in Ukraine", "score": 5, "replies": []}]}, {"body": "targets acquired, +29% today.   this TA is invaluable, huge thanks.", "score": 8, "replies": []}, {"body": "i took 3/9 423p this morning.", "score": 6, "replies": [{"body": "best of luck. i took 3/10 420p and 3/18 410p.  All i can see is bull trap, and Fed P&D.", "score": 2, "replies": [{"body": "In hindsight, I should’ve gone for a Friday or Monday expiration date.", "score": 2, "replies": [{"body": "yeah I've learned my lesson there a couple times the hard way.  for a someone new to trading, it's much easier to be right about the direction, then it is about the timing, so giving yourself so more time for things to turn around can be pretty beneficial.  or at least soften the blow of volatility.", "score": 2, "replies": [{"body": "i ended up closing the position for a loss and open 3/11 413p.", "score": 1, "replies": [{"body": "Spy is going to close up higher on 3/11 according to my analysis.", "score": 1, "replies": [{"body": "I hope to god your analysis is so far off that I can get some tendies on 3/11", "score": 2, "replies": [{"body": "Hey, I got 410p as well. How was your day? Mine? Total shit", "score": 1, "replies": [{"body": "I’m hoping for blood tomorrow, but hope is a smooth brain retard thing", "score": 2, "replies": []}]}]}, {"body": "care to elaborate on this \"analysis\"?", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "got gain, got out 10%+ may dip my feet in again sometime today", "score": 3, "replies": []}, {"body": "👋🏼   Hi just", "score": 3, "replies": []}, {"body": "Bull run or bull trap?? Stagflation cancelled?", "score": 5, "replies": [{"body": "Idk feels like a bull trap but today's market is a trap everyday", "score": 5, "replies": []}]}, {"body": "For all the dutch retards searching less retarded investing info: www.financieelontwikkelen.nl\n\nFor those who dont: good luck", "score": 0, "replies": []}, {"body": "I’m not touching today. It looks like it’s gonna trade sideways. Boring and nothing big to be made like yesterday’s options. I even expect a teensy dump at the end of the day. Tomorrow on the other hand will be decent.", "score": -1, "replies": [{"body": "My thoughts exactly after the first 20 minutes. But I already bought 10 contracts lol", "score": 4, "replies": []}, {"body": "How do you figure it’ll trade sideways", "score": 1, "replies": []}]}, {"body": "“we COULD see VIX as low as 31 today before we hit support. If we break that support line we could see VIX re-enter the 20s”\nYeah no shit, that’s how numbers work.", "score": -8, "replies": []}, {"body": "Based on my projections it will likely go up or down then later in the day it will likely reverse a few times. I'm buying puts and calls", "score": 1, "replies": []}]}
