{"title": "[deleted by user]", "selftext": "[removed]", "id": "tibcg8", "created_utc": 1647744043.0, "score": 13, "upvote_ratio": 0.72, "num_comments": 34, "comments": [{"body": "Shopify is a \"money making beast\"?  Seriously?  They've barely had a year of profitability.\n\nAnd yes, some of those companies are big money makers.  And their prices reflect it.  Buying the company that is the most profitable is not necessarily the same thing as buying the company that will see the greatest stock price appreciation over the next ten years.", "score": 24, "replies": []}, {"body": "VTI is far more than the S&P 500, it’s a collection of 4070 stocks. You buy VTI if you want the broadest equity diversification at a very low expense ratio.\n\nConcentration in select stocks can provide periods of outperformance vs the index(es). It’s more difficult to sustain outperformance over time whenever you start actively managing / trading and introduce emotion into potential decision making re: positions.\n\nAnd when you mention “why VTI if I can diversify myself”… if you bought the 7 names above (all generally correlated to growth stocks), this would not be considered diversification.\n\nConcentration builds wealth, but it cuts both ways - good and bad.", "score": 18, "replies": []}, {"body": "By \"bad money making companies\" are you referring to the free cash flows and other such of the company? Or that its stock price hasn't appreciated much? Which one?", "score": 4, "replies": [{"body": "Doesnt stock price and earnings go hand in hand? Assuming we're in a risk on market and a company earnings are better than expected", "score": -1, "replies": [{"body": "Also, going back to your post, the basket of stocks you mentioned is not diversification, but more like a blue chip tech fund.", "score": 8, "replies": []}, {"body": "Sometimes it does. Sometimes it doesn't. In which case you end up with undervalued gems or overvalued stocks. I've personally found following the earnings, profits, cash flow, debt etc of a company much more rewarding than its ticker price.", "score": 3, "replies": []}]}]}, {"body": "You *could.* You could also significantly underperform it.  Concentration widens the range of potential outcomes. You have very little diversification with those names though.  They're all super tech heavy, all priced for growth, mostly mega cap.  They're going to move together.\n\nDiversification would look more like Deere, Apple, Google, Waste Management, Delta Airlines, Chevron, Home Depot, Allstate, JP Morgan, Union Pacific, etc. (Ideally with some small/mid cap exposure as well, but those names aren't as recognizable for this example). If you're absolutely convinced that your names will outperform, you can choose to be concentrated.  There's nothing *inherently* wrong with it, but it is a much riskier strategy.\n\nMy gut tells me that the next decade will not be as kind to MSFT, TSLA, Apple, NFLX, Shopify, Amazon, Alphabet, etc.  It's pretty atypical that the best runners from the past decade *all* have a stellar next decade.  My guess is some of the rosiness in their projections doesn't work out, increase interest rates make everything drop, and they just kind of have an okay decade.  I'm not selling my Apple position, but I'm also not adding to it (other than DRIP) at this valuation.\n\nObviously, *most* of this subreddit disagrees if they have any opinion on picking individual stocks.  And that's a red flag to me. I'll keep buying the Agco, Activision (pre-merger) and Intel's of the world.", "score": 12, "replies": []}, {"body": "I did last year and out performed the US-500, but this won’t be the case every year…", "score": 3, "replies": []}, {"body": "You probably will tbh.", "score": 4, "replies": []}, {"body": "You could put your money in VOO which is large caps.  The best thing about an ETF, imo, are the tax advantages.   If I'm managing my own portfolio I will incur taxable events every time I remove a stock or add a stock.  So not only do I have to beat the SP500 but I also need to beat it by more than I pay in capital gains I incur along the way.\n\nVOO (my favorite one) lets me mindlessly contribute to my investment over a long period of time and never have to worry about it.  I think a lot of confusion about 'can you beat the market' and 'time in the market beats timing the market', etc is from not understanding the different reasons people have for investing.  Statements like '99% of people should just buy ETF' is also not helpful, imo . .especially because the person saying it always seems to think they they are the 1%.\n\nIf you want a long term investment it's really hard to beat the index.  If you want to invest for big gains or to make income then it's pretty terrible.  Can I beat the market for a week or a month?  Possibly.  Can I beat it for 20 straight years?  ehh . . . .", "score": 2, "replies": []}, {"body": "See Warren Buffett versus the S&P and the only tech he owns is Apple. \n\nShort answer is No. Sector rotation (like we saw January-February) prevents you from being isolated to a small amount of positions over the long run", "score": 4, "replies": [{"body": "Institutional investors , fund managers rotating back into technology again it all balances out stick with good companies and a long term plan . The big boys move the market and some time your shit is hot and sometimes it isn't . Don't panic.", "score": 0, "replies": []}]}, {"body": "Shopify, Netflix and Tesla are far from being \"beasts.\"", "score": 3, "replies": [{"body": "Exactly, I'd pick the actual good ones and skip the speculative ones.\n\nMuch better choices to be making speculations on out there", "score": 3, "replies": []}]}, {"body": "They are money making beasts - until they aren't.", "score": 1, "replies": []}, {"body": "Nope you're the only one", "score": 0, "replies": [{"body": "It’s a new investing hack", "score": 0, "replies": []}]}, {"body": "Google.", "score": 0, "replies": []}, {"body": "Could you? Yes. Will you? Probably not.", "score": 0, "replies": []}, {"body": "You get all those stocks buy buying broad based indexes.", "score": 1, "replies": []}, {"body": "All that you said are part of QQQ and heavily tiltlted towards big tech names .", "score": 1, "replies": []}, {"body": "I never bought index and pretty much just own big tech and I outperformed the sp500 every years since 2008.", "score": 1, "replies": []}, {"body": "Yes.\n\nOver longer periods VUG outperforms VOO.", "score": 1, "replies": []}, {"body": "Actually I do exactly that and did outperform the markets the last 3 years. But not the 5 years before. Actually at all-time high.\n\nIt is a completely mechanical and sector-diversified strategy with dividend paying large caps: [I am a robot.](https://www.reddit.com/r/dividends/comments/so8xcq/i_am_a_robot/?utm_source=share&utm_medium=web2x&context=3)", "score": 1, "replies": []}, {"body": "Yeah you can. Here’s how. Find a broker who offers direct indexing and buy everything in the sp500 except the stocks you know (Nostradamus????) will underperform. Or you could just buy sector etfs minus the sectors you know will underperform.", "score": 1, "replies": []}, {"body": "Just buy IWY if you think large caps will outperform the sp500. If IWY doesnt than your portfolio probably wont", "score": 1, "replies": []}, {"body": "Vti should under perform the s&p because it's even further diversified than voo.\n\nBut the answer is yes. Some expensive wealth managers essential take a strategy of starting with the s&p500 weighted to market cap, like spy, then eliminate the holdings with the worst growth prospects. It's a stupidly simple strategy to \"beat the market\", but these people make millions as fund managers by doing this for wealthy individuals.", "score": 1, "replies": []}, {"body": "Buying the biggest tech companies in the S&P 500 is not diversifying lol", "score": 1, "replies": [{"body": "Why tho", "score": 0, "replies": [{"body": "Diversification is not buying and holding the big tech companies. Diversification is buying different companies in different sectors. Different sectors are financials, industrials, consumer staples, real estate, etc.", "score": 1, "replies": []}]}]}, {"body": "The answer to your question is yes, it could, but there are more risks. When you pick individual stocks, there's a psychological risk that you will talk yourself into making mistakes. You'll fall for FOMO or panic sell, without realizing it, because you'll be rationalizing those decisions.\n\n\"Omg Tesla's down 50% this year and everyone's saying it's already overpriced and due to fall much further and people are also jumping ship and CNBC released a video of their full self-driving tech crashing and Elon Musk is trying to pump the stock with empty promises and there's rumors of a recall.\"\n\nThat sort of thing. You're far less likely to panic sell the S&P500, since you trust that it's diversified and the winners will make up for the losers with enough time.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "tio7aj", "created_utc": 1647792075.0, "score": 18, "upvote_ratio": 0.82, "num_comments": 37, "comments": [{"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "Year 30 doesn’t matter to them, they actually make a majority of their profit in the first few years. The amortization table nets them thousands of profit there, then you have to “wait” till year 10ish till you actually starting paying anything meaningful towards the principal.", "score": 29, "replies": [{"body": "The math for profit doesn’t work that way. While it’s true that amortization over long periods of time means that most of your money is accounted toward interest at the beginning, it isn’t true that mortgage bond buyers make the majority of their profit in the first few years (assuming you aren’t talking about fees and origination costs — which is made by the lender).", "score": 8, "replies": []}, {"body": "This! \n\nWe bought a home in 2015.  The house was $300k the mortgage lifetime [what we'd pay over 30 years]  came out to $670k.  The first 10 years is all interest.", "score": 14, "replies": [{"body": "Yours is sort of a bad example, with those numbers your mortgage rate would have to have been around 6.3% while the average mortgage rate in 2015 was below 4%. Obviously a loan rate 50% higher than the market average is going to make things look really bad (I hope you refinanced)", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Something doesn't add up", "score": 1, "replies": []}]}]}]}, {"body": "ah yes.  you essentially pay your mortgage 3 times.  and they front load the interest so you are paying mostly interest/little principal in the beginning.", "score": 7, "replies": []}, {"body": "Ahhh, so amortization terms are extremely important, like the duration of a bond!", "score": 4, "replies": [{"body": "You need to understand the way mortgage industry works.\n\n**This is simple explanation, but actual work is very complex !**\n\nBorrower (WE) => Gets low from bank(BANK) => Gets packaged loan from underwriter (secondary provider=SP) .\n\nBank packages 1000s of borrower and sells to Secondary provider. The SP holds them 2-5 years and he packages and sell it to another service provider like stocks buy/sell whatever rates available at that time.\n\nEven if we hold 30 year fixed mortgages, it would have changed hands at least 5 to 10 times during this 30 years.\n\nDuring this process some one pays excess cash or premium and makes some gin or loss like the way we do with stocks.\n\nThis is the way year 2008 - millions of loans failed (Banks lost trillions) where FED rescued them.", "score": 3, "replies": []}]}, {"body": "Yeah I found out this neat little trick my first time buying a home. If you actually plan on keeping it for 30 years it’s not so bad, but most will not live in their home that long and will move/sell out long before the loan is less predatory. Do a 15 year or cash if you can somehow manage it people.", "score": 4, "replies": [{"body": "It's not predatory, you're paying a loan down. Each year, you pay interest on the remaining principal. \n\nYear 1 - 350k mortgage, 4.0% APY:\n\nYear 1: Interest paid: .04 \\* 350k = $13,887.82 (after the principle gets chiseled down a little each month) = $1157/month (now in reality it varies a bit each month as you pay it down but that's the average)\n\nYear 15 Beginning Balance: $236,680.25\n\nInterest paid: .04 \\* 236,680.25 = $9,467.21 = $789/month\n\nYear 30 Beginning Balance: $19,623.67\n\nInterest Paid: .04 \\* 19,623.67 = $785 = $65/month\n\nEach year you're paying 4% on the remaining balance. It's just that by the end of the loan, so little balance is left that you pay very little interest.", "score": 5, "replies": []}, {"body": "If you weren't planning to stay in the house truly long term couldn't you get the 30-year mortgage, pay double or whatever installments as if it were a 15 year mortgage?\n\nI know few people will actually *do* that but in theory that could work? I suppose you pay a bit more in interest with this route.", "score": 2, "replies": [{"body": "Yes you can double down and it lowers the principal/pay off date substantially. You would need to have the money of course though.", "score": 1, "replies": []}]}]}, {"body": "Do you know what the effective duration of the 30 year fixed is? In other words, by what year are the majority of the inbound interest payments received? Just out of curiosity really lol", "score": 1, "replies": []}]}, {"body": "the originating lender gets their money out of it via closing costs and points.  then sell your mortgage plus others' mortgages as a bundle to Fannie Mae or Freddie Mac so FNMA/FMCC are left holding the bag.\n\noriginating lender still talk to you for customer service, monthly collection, paperwork.\n\nFNMA/FMCC then bundles up a lot of mortgages and sells them as Mortgage Backed Securities and make money off that.\n\nas for inflation... FNMA/FMCC eats that... and if they eat too much (and lose too much money or cash reserves) then the american taxpayers bail them out.\n\nhttps://www.rocketmortgage.com/learn/fannie-mae\n\nedit: corrected freddy mac's symbol.  \n\nthe GSEs are facinating stocks.  they basically print money when economy is good... FNMA is at $.81 right now with 20+ billion annual profit?  research them if you want to know how the government screwed a lot of people.", "score": 12, "replies": []}, {"body": "They get money at a non existent rate and sell you the money at 5 times what they paid minimum.", "score": 8, "replies": [{"body": "Correct. The Fed gives them money at a deep discount. Then the Fed artificially keeps rates low with quantitative easing bullshit.  So the bank is encouraged to make risky loans. As they know they will make money.   Causes bubbles and crashes.\nThe bank wraps up a bunch of mortgages, and sells them anyway.", "score": 2, "replies": []}, {"body": "Wait aren’t they getting their money from depositors?\n\nDo you mean that they are marking up depositor rates by 5x?", "score": 1, "replies": []}]}, {"body": "GPa always said \"no tax on debt\" i get it now", "score": 2, "replies": []}, {"body": "The money is paid out up front, not over time.  So the lender's costs don't increase as rates rise.\n\nIf you get money at 1% and sell it to me at 3% today, it doesn't matter what happens over the next thirty years.....you paid 1%.", "score": 2, "replies": []}, {"body": "The money lent by US banks is completely created at the time of the loan. \nSince that sale price costs the originating lender zero, all they, or any future servicers, want is the servicing revenue.", "score": 5, "replies": []}, {"body": "Mortgages are typically 5 year terms and directly tied to offsetting investments sold by the lender like term deposits which are always at a lower rate thus guaranteeing a profit margin for the lender.  All inflation does is reduce risk for the lender as the higher the property value the more equity vs the mortgage amount which is secured by the property.", "score": 1, "replies": [{"body": "Residential loans are not typically 5 year terms though, they are fixed for commonly for 30 or less commonly 15 years, and property values do not always rise, although I get your point.\n\nBut I mean specifically for yield on cashflow, not through foreclosure where equity would make a difference.", "score": 2, "replies": [{"body": "I guess mortgages are different in US vs Canada, in Canada terms are typically 5 years with ammortizations of up to 25. \n\nAs far as yields on mortgages, you have to remember that interest compounds on a declining balance, so even at very low interest rates, ROI is still very good on long term paydowns, and most of the interest is collected earlier on in the term.", "score": 3, "replies": [{"body": "Right right this is a good consideration", "score": 1, "replies": []}]}, {"body": ">Residential loans are not typically 5 year terms though\n\nDepends where you are. In the UK for example a fixed rate mortage will be fixed for the first 2,3,5 years typically then jump back to a tracker to prevent exactly what you describe from happening in your original post.\n\nThis is also why if you look at a 30 year deal in the US right now its giving mortages at 4-5% and the UK 3-5 year fixed rates are still giving 1.6-2.0% going to 3.5% after the deal expires.\n\nThe other thing to factor in here is costs on the mortage as well. If there is a $2k fee on it. Take that as an extra X% with Y years of compound interest basically being added nothing.", "score": 2, "replies": []}]}]}, {"body": "Don’t forget that banks make money from fees and the average person only has each mortgage for about 7 years.", "score": 0, "replies": []}, {"body": "Inflation doesn't affect loans in any way. Let's say you take out a loan of 100 at 4% interest and you buy 100 loafs of bread with it @ 1.00. Inflation that year is 4%. At the end of the year you're required to pay back 104. Due to inflation a bread now is worth 1.04, so you sell all your bread and now have 104 to pay back the loan. The lender still made a profit of 4 but he can't buy more loafs of bread with it compared to before the transaction due to inflation, but banks don't care about bread so it keeps the 4 and now has more money, something that the bank does care about.", "score": -1, "replies": [{"body": "Wait, it’s a wash though. It has more money but only nominally. The bank is going to price interest on a FRM to include expected inflation so that in real terms they made money.\n\nIs there something I’m missing in this example?", "score": 1, "replies": [{"body": "No, that's not what will happen. A banks direct exposure to inflation is neglectable. Banks will increase interest rates as their financing costs increase because central banks raise their interest rates to combat inflation. As a rule of thumb you should remember rising interest rates are beneficial to the financial sector in general because it increases their cash flow and ability to control margin. That means a rising inflation is beneficial for banks if it triggers central banks to tighten monetary policy.", "score": 0, "replies": []}]}]}, {"body": "Your assuming that the bank that provides you the mortage is fhhe same party as the party that makes they money, this os not true. Eith mortages there are usually 3-4 parties involved. \n\nAn investor looking for a fixed return (usually a pesnion fund or something similar) give money to the mortage bank at a variable interest. The mortage bank then sells you the loan at a fixed interest with a mark up. And then hedges his interest risk in the market with an interest rate derivative fixed vs variable. Often times the loans are them securitized and sold on. So the bank actually might only have it on the book for a few years max.\n\nAlso the whole reason mortages exist is to gove the home owner maximum profit off inflation (once on the rising house value and once on the falling debt value.) without constructions like this the loan would be unaffordable for anyone.", "score": 1, "replies": []}, {"body": "The trick is fractional reserve banking. They are lending you made up money. It used to be 10% reserve rate, to they could lend out $10k for every $1k they actually had. Their 4% on that 10k would be a 40% return on their $1k actually invested. I think that reserve requirement might have even been removed or lowered, didn’t bother looking it up. Anyone for sure please correct me if I’m wrong here. I’m not in finance", "score": 1, "replies": []}, {"body": "Read some comments and noticed no one talking about the rate banks get the loans at as many borrow themselves to loan to people. Your 4% loan today they borrowed at 2.46%. Its super profitable to loan money and if theyre in trouble or need capital they sell the loan to another bank. Also inflation isnt flat rate on everything go look at the breakdown of inflation. Notice buying somethings make up 2-4% of inflation like food, car, oil? Banks aren’t buying food for their families", "score": 1, "replies": []}, {"body": "Inflation doesn't eat at it. The answer is far more simple. You're thinking about it from an individual mortgage point of view, but think of it as a total balance sheet point of view instead: they have x dollars, so that's what they can loan. If you pay back half your mortgage, they can lend that money to someone else. As long as the total amount loaned out grows, their profits grow too.", "score": 1, "replies": []}, {"body": "inflation isn't really eating it as much as you think. don't forget, the interest is compounding for 30 years. also, that 4% interest rate is going to be higher than inflation in normal times. these inflation rates near 10% are NOT the norm.\n\nadditionally, defaults aren't in anyone's best interests. i haven't seen any studies to back this theory up, but it seems like fixed rate mortgages would be at a much lower risk of default than adjustable rate. don't forget, adjustable rates is part of what made everything collapse in 2008.\n\nif someone's interest rate goes up 2-4x, that's going to have a big impact on their monthly payments and could make them unable to pay. instead if someone is paying 2k/month, their risk of default with fixed rate might be if they lost their job and couldn't afford the bill anymore. with adjustable rates, they would also have the risk of their monthly payment jumping to 4k overnight.", "score": 1, "replies": []}]}
