{"title": "Nvidia’s stock suffers record plunge after analysts say it’s time to sell", "selftext": "Chip maker’s stock suffers biggest-ever one-day price drop, snaps longest-ever streak of closes above 50-day moving average.\nShares of Nvidia Corp. plunged on heavy volume on Thursday, after two Wall Street analysts swung to rare bearish ratings on the graphics chip maker, citing concerns over valuation and a tempered outlook for gaming.\n\nAnalyst Romit Shah at Instinet downgraded Nvidia to reduce from buy. Shah also slashed his stock price target to $90, which is 10% below current levels, after raising it to $100 from $80 just two weeks ago.\n\nBMO Capital analyst Ambrish Srivastava dropped his rating to underperform, after being at market perform for at least the last 2 1/2 years. He cut his stock price target to $85, or 15% below current levels, after raising it to $100 from $75 less than three weeks ago.", "id": "5vxe6g", "created_utc": 1487942344.0, "score": 110, "upvote_ratio": 0.94, "num_comments": 68, "comments": [{"body": "it is crazy to me that two analysts have such control over the shares of stock. I know this is how the world works, but it boggles my mind. ", "score": 75, "replies": [{"body": "They have zero control, they just state what people already have in mind and it gives a spark. ", "score": 26, "replies": [{"body": "How many people honestly had in mind that the gaming industry was dwindling?  My thought is, not many.", "score": 16, "replies": [{"body": "is there a place I find information on why the gaming industry is dwindling?", "score": 2, "replies": [{"body": "It's not ", "score": 27, "replies": [{"body": "it's almost like there are people using their influence to control the price by rating-manipulations. .. .", "score": 22, "replies": [{"body": "Analysts have been doing that for decades xD ", "score": 3, "replies": [{"body": "Doesn't make it right", "score": 3, "replies": [{"body": "Wolves", "score": 1, "replies": []}]}]}]}, {"body": "phew. the teenager has allayed our fears", "score": -5, "replies": []}]}, {"body": "That's the thing though, there isn't.\n\nSteam It's praying record numbers of concurrent users, sales are fine - why does nonsense these guys pull out of their asses affect the share price so much?\n\nNot to mention their influence and rise in non-gaming sectors...", "score": 7, "replies": []}, {"body": "It's not gaming, it's competition. Nvidia has had little in the way of competition but I believe amd/Intel made a big announcement a couple of days ago", "score": 4, "replies": [{"body": "This is the real answer. Both nvidia and intel are going to be hurting now that amd is coming for their market share.", "score": 3, "replies": []}]}]}, {"body": "It's not about gaming industry, NVDA's stock was the original problem, a lot of people thought that it was overbought on Tesla's news. ", "score": 1, "replies": []}]}, {"body": "That is similar to being in control ", "score": 2, "replies": []}]}, {"body": "It's not two analysts... go look at fidelity's coverage. Two analysts don't pull a stock down like this. The writing is on the wall", "score": 4, "replies": [{"body": "Understood that it's more than 2 people but I do find it interesting that certain individuals either making statements as themselves or as representatives of organizations have a lot of power regarding which direction a stock will head. I assume they have some sort of trade blackout/can't trade at certain times. ", "score": 4, "replies": [{"body": "Oh gosh you need to read the first book of the level 1 CFA exam. Often analysts can't even own holdings in the sector they cover. They have no skin in the game, just using the mosaic theory and their own methodology to piece together an outlook. They want to dig into the numbers and tell the story of what's going on under the hood. But they don't hold any power, people empower their opinions by acting on them.", "score": 3, "replies": []}, {"body": "exactly. ", "score": 1, "replies": []}]}, {"body": "morgan stanley still has them listed at a 114 price target. ", "score": 4, "replies": []}]}, {"body": "It just shows that prices are just not optimal in either way", "score": 1, "replies": []}, {"body": "Fake news?", "score": 1, "replies": []}]}, {"body": "They say it's time to sell when everyone's already selling. ", "score": 12, "replies": [{"body": "No you sell when everyone else is buying lol.", "score": -1, "replies": [{"body": "No sure why the downvotes...go out on top!", "score": 2, "replies": [{"body": "Why? because most people who come on these subs want to make a quick buck. No one wants to wait a year.. two or three or longer to make money. The problem is most people lose more money in that time. Stick with companies who have a history and have profits instead of jumping on the bandwagon like everyone else. It was Warren Buffet who said sell when everyone is buying and buy when everyone else is selling. Smart man.", "score": 2, "replies": [{"body": "Eh I'm agreeing with you.", "score": 1, "replies": [{"body": "I know you are. This was for the benefit of others. :)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Isn't Nvidia diversifying into automotive, specifically chips for autonomous driving? I would expect consistent growth in these chips for the foreseeable future. Either camera or Lisa based systems will win out or maybe a combination of the two. ", "score": 14, "replies": [{"body": "The main reason why i bought at 119 :/", "score": 3, "replies": []}, {"body": "Yes and their biggest growht was in datacenter and AI, which is what they are positioning themselves for in the next years.", "score": 3, "replies": []}]}, {"body": "Hey look, a sale for a product I was going to buy. Let's see how Monday goes.", "score": 6, "replies": []}, {"body": "> Shah also slashed his stock price target to $90, which is 12% below current levels, after raising it to $100 from $80 just two weeks ago.\n\nWhat information available to Shah changed in two weeks?", "score": 7, "replies": []}, {"body": "The problem? You guys wanna know it?\n\nMost retail investors are gullible sheep way too rash, naive, and scared of their own shadow when it comes to taking losses.\n\nMarkets, and even strong stocks fluctuate, that's just what they do.\nThis Is NVDA, not some stupid low volume bio-tech...these losers who sold in a panic should give their head a shake. Nvidia has a TON going for them right now, especially their diversification, namely in the car computing market as well as self-driving cars which will be HUGE and is just around the corner. Go ahead, buy high sell low...more of a discount for me.\n\nA few talking heads make some speculative statement with an opinion piece and all of a sudden its 2008 again...\nSheeple.", "score": 5, "replies": []}, {"body": "Gotta fill that gap at ~72.50", "score": 3, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "I bought at 100.67. I'm not concerned, I'll either make a quick buck or hold until it comes back, and I'm confident it will. ", "score": 6, "replies": [{"body": "[removed]", "score": -6, "replies": []}]}, {"body": "Well, it's going great... for now... Let's hope it keeps going! \n(I bought yesterday at 104, definitely too early!)", "score": 1, "replies": []}, {"body": "Hold forever. - Buffett", "score": 1, "replies": []}, {"body": "Looks pretty much ok now, though I think it's gonna close red. ", "score": 0, "replies": []}, {"body": "I bought it at 110.  I wanted to buy it at a lower price, but my dad insisted that it wouldn't go down...", "score": 0, "replies": [{"body": "Your dad can't predict the future? What an idiot. ", "score": 8, "replies": []}]}]}, {"body": "It's so easy as an analyst to cut your target prices. Most guys don't even know what's going on they just follow everyone else. ", "score": 2, "replies": []}, {"body": "All I see in the headline is \"stocking stuffers\"", "score": 2, "replies": []}, {"body": "They've been wrong on the stock all along, nobody listens to them. Everything is fine with NVDA, just momentum coming out of the stock...it'll settle out and buyers will come in. ", "score": 2, "replies": []}, {"body": "Finally, a time to buy for those of us who didn't jump in yet. I'll happily settle for a 90 price.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "In absolute numbers though", "score": 1, "replies": []}]}, {"body": "Those guys don't know what they are talking about, the majority of growth for nvidia was in the Datacenter and AI markets and that is what will drive their future growth.\nEven if those analysts underlying assumption, being that Nvidia is going after the gaming market the most, they would still be wrong in assuming that PC gaming is dying. If you look at the concurrent user metrics for steam you would know that PC gaming is going no where but up, especially with virtual reality coming in the next years.\n Even if consoles become able to perform virtual reality they will not be able to use integrated graphics and will need dedicated graphics cards in their machines to support VR and those cards will have to come from AMD or Nvidia.", "score": 1, "replies": []}, {"body": "This is why I own NVDA, AMD, and AMAT. One of them has to win lol", "score": 1, "replies": []}, {"body": "Record plunge?  Barely.", "score": 1, "replies": []}, {"body": "Look at that mountain. Should have sold at the white cap or now. https://www.bloomberg.com/quote/NVDA:US", "score": 1, "replies": []}, {"body": "Time to buy then!", "score": 0, "replies": [{"body": "Why? IMO even $90 is a huge price. I am not saying that NVDA doesn't worth it, but it's going to be pretty tough for the stock to regain its positions. ", "score": 4, "replies": [{"body": "Exactly. It was a correction meaning the super high price was people being suckered into paying too much for the stock. It might regain over time, but it will require more than just traders hoping the price will go up.", "score": -1, "replies": [{"body": "Something like their chips for autonomous driving taking off in the next couple years? ", "score": 1, "replies": [{"body": "Exactly. Or even just growth in the graphics card sector. The problem there is that people aren't being convinced to buy graphics heavy computers that don't already own them. People will upgrade every 5 years or so, but the market doesn't really seem to grow. ", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Nvidia's chips are being used in a variety of systems.\n\nNotably, [Nintendo's Switch is powered by a Tegra SOC from Nvidia](https://arstechnica.com/gaming/2016/12/nintendo-switch-nvidia-tegra-x1-specs-speed/).  They could get a nice boost if the Switch takes off.\n\n[Nvidia is also a player in the autonomous vehicle market](https://arstechnica.com/cars/2017/01/nvidia-audi-bb8-self-driving-car/) which is a market primed to explode in the next 2-5 years.\n\nGPUs are also increasingly being incorporated into super computers and powering machine learning/AI services.  For example, [Nvidia chips are powering AWS P2 GPU compute instance types](https://aws.amazon.com/blogs/aws/new-p2-instance-type-for-amazon-ec2-up-to-16-gpus/).\n\nI think Nvidia will be fine.", "score": 11, "replies": []}]}]}, {"body": "Hold out the new 1080 ti  chip comes out next week", "score": -1, "replies": [{"body": "The Ti chips are not the bread and butter for nVidia. Their x60 and x70 lineup is always the best sellers. The x80 and x80Ti cards are premium products. I want to see what their next gen is, which probably will not be til May.", "score": 5, "replies": [{"body": "the 1080/TI is where they make the best margin. The point is it is a positive catalyst. ", "score": 3, "replies": []}]}, {"body": "Thats what im thinking too. But they are releasing it during AMD confereence. Which might affect them badly. I have a couple shared with Nvidia at 117 and im kickinv myself everytime it goes down. I dont know when to sell. ", "score": 2, "replies": [{"body": "Careful!   I hear AMD has another pocket aces up their sleeve!", "score": 4, "replies": []}, {"body": "I think the key is not to buy immediately after the stock moves up 20%. 117 holy shit, where'd you think it was going, the moon?!", "score": 2, "replies": [{"body": "WSB is leaking", "score": 1, "replies": []}]}, {"body": "I recommend selling now, looking back 2 years this stock looks like a classic bubble: https://static1.squarespace.com/static/569fce7adf40f315de772b61/t/56bbd3a1b654f965b7c8e479/1455149987131/\n", "score": 1, "replies": []}]}, {"body": "if this is the case, now's the time to buy more. ", "score": 0, "replies": [{"body": "Anything that drops like a knife is risky, watch for a dead cat bounce its only been two days.", "score": 2, "replies": []}]}]}]}
{"title": "If you actually want to learn about derivatives", "selftext": "Here is a link to all the course materials for UGA's graduate level derivatives course: https://drive.google.com/drive/folders/0B3vffzeJiqj8Q2o5ZmdvM01KZGs?usp=sharing\nThe folders include all the lectures and homework (with solutions) so you can practice. Fell free to message me if you need something explained. The course starts with the basics of intrinsic/extrinsic value and progresses into binomial modeling and then black Scholes. The course ends with basic commodity derivative pricing and hedging strategies. There are plenty of finance jobs that require the use of derivatives so that you can continue making WSB's even at work. \n\nAs far as additional reading goes, I recommend you purchase Financial Options: From Theory to Practice. It is only $.01 on amazon (https://www.amazon.com/Financial-Options-Practice-Stephen-Figlewski/dp/155623872X). This book gives a good introduction and is not a textbook. \n\nIf you are looking to learn more in depth about derivatives I recommend you purchase 'Introduction to Derivatives and Risk Management.' It covers everything you need to know and is only $50 on amazon (https://www.amazon.com/Introduction-Derivatives-Management-Stock-Trak-Coupon/dp/1133190197/ref=mt_hardcover?_encoding=UTF8&me=). This is really cheap for a textbook and you might be able to find a previous edition for even less. \n\nHope this helps those who want to learn more about derivatives/options. \n\nupdated link: https://drive.google.com/open?id=0B3vffzeJiqj8Q2o5ZmdvM01KZGs", "id": "5vyk7c", "created_utc": 1487955175.0, "score": 294, "upvote_ratio": 0.97, "num_comments": 75, "comments": [{"body": "[deleted]", "score": 49, "replies": [{"body": "JNUG", "score": 12, "replies": []}]}, {"body": "You forgot this classic: \n\nhttps://www.youtube.com/watch?v=hGh2OzI06o8\n\n", "score": 23, "replies": [{"body": "Wtf, Michael Moore did not give that anything close to a good faith effort. That is a blatantly agenda-based pseudo-explanation. No wonder Michael Moore's credibility is low. ", "score": 44, "replies": [{"body": "Selena Gomez explained them in The Big Short in a way that anybody could understand.  There are complicated aspects of finance, knowing what a derivative is is not one of them.", "score": 16, "replies": [{"body": "+1 for Selena Gomez. She should explain WSB naked puts, for example. While she's naked.  \n\n\n", "score": 3, "replies": []}]}, {"body": "For real, he made it look like those guys didn't understand it themselves, but they were stumbling because they were trying to dumb it down for him but he kept playing stupid. \n\nSame shit happens to me when I try to explain evolution to my 5 yr old. Just cause I can't simplify down to your level doesn't mean it's a scam.  ", "score": 33, "replies": [{"body": "+1 for truth\n-1 for believing in evolution", "score": 2, "replies": []}]}]}, {"body": "\"They made them purposefully confusing, so they could get away with...MURDER\" \n\nMoore is a hyperbolic moron. Those equations he put up looked to be involving calculus and differential equations, which the average viewer of a Moore film will never understand. ", "score": 3, "replies": []}]}, {"body": "Follow this and then round out trading knowledge with natenbergs option volatility and pricing ", "score": 9, "replies": [{"body": "round out?", "score": 1, "replies": []}]}, {"body": "ddb4, you da real MVP", "score": 7, "replies": []}, {"body": "Thanks brah", "score": 5, "replies": []}, {"body": "You are a damn good dawg", "score": 7, "replies": []}, {"body": "You seem like a guy 'in the know' since you just showered us with logical reading material. Let me ask you this. I have been managing a modest amount of my money for awhile now and just recently put ~5k into a robinhood account for WSB. My WSB -Robinhood acc grows substantially faster since I apply a little bit of my previous knowledge with making WSBs. I've been trying to find a valid answer to a small question. Why the fuck don't I just day trade 3xETFs for a few hours a day and scalp ~$300-500/day doing basically nothing. I mean am I missing something here?", "score": 15, "replies": [{"body": "what do you mean by scalping 300-500 a day? Although the 3xETFs fluctuate quite a bit, I don't think they can consistently be day traded day after day. $5,000 can be wiped out fairly quickly if a few trades don't go your way. You'd want to have another source of income to fall back on. ", "score": 32, "replies": [{"body": "By scalp 300-500 a day he means take 300-500 a day out of his Robin hood account and put it into his bank account as his \"salary\".  Poker players will do this with their bankroll sometimes, if that makes sense.", "score": 4, "replies": []}, {"body": "Start point-50k no margin.\n\nEnter trade 1- 500 @10.00=5000\n\nExit trade 1- 500 @10.05=5025 net +25\n\n12 trades similar to this using 5k/trade would be ~$300. Minus fees and such of course. 12 trades is basically 30min-1hour at most unless the day just isn't looking good for your strategy. Also, I used to let some things ride above stops for .10-.15 which compounds even greater. Obviously, I use more than 5k/trade, but that's just fake numbers.\n\nEDIT(1min): I forgot about scalping from the short position too.\n\n So I guess my question boils down to why am I not doing this?", "score": 5, "replies": [{"body": "technically it should work considering this is what most algorithmic trading systems do, but it will still be hard to produce consistent results. I've never used robin hood, but i assume they have settled funds policies that will prevent you from day trading. 5,000 per trade gives you 10 trades per day max. Have to take into account short term capital gains as well. ", "score": 10, "replies": [{"body": "Robinhood has a margin account W instantly fund settling. But then you get hit with PDT rules unless you got 25k", "score": 7, "replies": [{"body": "I know this. Did you even read what I wrote?", "score": -7, "replies": [{"body": "I mean it wasn't even a response to your post", "score": 17, "replies": [{"body": "I stepped out and went mobile, my bad mannnn", "score": 9, "replies": [{"body": "Well ur op doesnt talk about pdt or if u have +25k in ur acc", "score": 1, "replies": []}]}]}, {"body": "He's not talking to you chief", "score": 7, "replies": []}]}]}, {"body": "Ohhhhh, I definitely won't use robin hood for this. I suppose there are more things to consider, but as I've been using this RH account (since Feb10) and watching 3x more than I ever have I just keep wondering why I'm not taking it seriously yet. (Also, as far as I know by using fund through RH. You can just re-apply your gains for another trade in the same day). Like you mentioned, that may change if I move it to Day Trade, but that would be something else to look into for I guess anyone that has that much in RH.", "score": 1, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "I know this, this is why I only put 5k into RH so I could play with it and not worry about losing a lot. 10% of 5k is not a lot. 10% of bigger numbers starts cutting into my life.", "score": 2, "replies": []}]}]}]}, {"body": "Yeah I mean sure, if it goes up 5 cents Everytime.\n\nWhat happens when you buy at 10 and it goes to 9.95, 9.90, etc", "score": 8, "replies": [{"body": "then it's a loss. When day trading losses happen for various reasons just the same as they do on normal trades. It's no big deal, you just shake it off and keep going. Tighten up parameters/see what you did wrong, also play the short side. With practice and familiarity to your platform, the motions become really fast.", "score": -6, "replies": [{"body": "I mean, the way you're talking about makes it seem like you can make $300/hour easy. I am saying that's not reality.", "score": 11, "replies": [{"body": "Day", "score": 0, "replies": [{"body": "Start doing this on Monday and keep a running thread so we can see how you get on. You'll learn real fast.", "score": 16, "replies": [{"body": "Funds won't be available that fast. Also, there are a lot of other things I need to consider. It's not like I can't just do it in my TD account and eat the fees to see what the results are lol. I feel like I'm being limited to my RH account or something.", "score": 1, "replies": [{"body": "It's an overly simplistic way to look at trading. Do you think you're the first person to try buy high/sell low? ", "score": 12, "replies": [{"body": "Does no one read the part where it says the short position too? Also, you don't only trade stocks, you hit up options, and if you're experienced, any other part of the market, which I am not. I will stick to options and buy/sell.", "score": 0, "replies": [{"body": "You can't trade options on RH", "score": 1, "replies": [{"body": "Did you not read the comment (s) that mentioned I have a td account?", "score": -1, "replies": [{"body": "In your first comment you made it sound like you've been scalping like this for a while. You know how many people come with their master plans looking for justification? Go test it in the market. If you have something that works repeatedly and you can reproduce your results, and you understand *why* it works, then you have an edge. Then you have something to teach. Until then, try to learn. Try scalping like that with paper trading and see how it goes.", "score": 6, "replies": [{"body": "hear hear. have you found an edge yet? because I seriously haven't, other than \"lawl markets go up except when they crash\"", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Judging by all of your comments below, you have no idea what you are doing and you got lucky in this bull market. The fine folks here on wsb would love for you to show us how to make an easy 300 a day though. Set up a RH account and update us here whenever you \"trade stocks\" lol", "score": 4, "replies": [{"body": "Well I made 12% since Feb 10 in my RH, and my td acct is doing fine, it's been fine for years. I appreciate your shitty attempt at being funny though, good on ya go back to your video games and being drunk in /r/drunk. Again, it's like you're another person that didn't even read. Also, you should stick around and make more statements using your apathetic tone and knowledge of popular phrases gained after scanning this sub.\n", "score": -4, "replies": [{"body": "Hes actually being pretty nice to you considering you sound like a completely uninformed dickhead", "score": 6, "replies": [{"body": "Well, it's apparent I'm missing something here and not connecting how I intended. I definitely am not as uninformed as people seem to be thinking I am. I guess I will just have to do it and come back and show proof.", "score": -4, "replies": [{"body": "You are definitely not as informed as you think you are. You have only been trading in the most bullish market we have seen since '06 and got lucky.\n\nId love for you to prove us all wrong. Like me and many others have already said, if you are so informed and can make 300 a day so easily, then you should start making daily posts so we can see what youre doing.\n\nWe all know you will fail. Prove us wrong or stfu and gtfo.", "score": 5, "replies": []}, {"body": "The part your missing is where you haven't done anything and you want some kind of credit for your novice understanding. This is the Dunning-Kruger effect in full force. Just the way you put together sentences shows your naivety, and honestly its ok.  I'm not saying you're no good, and I didn't contribute to your downvotes, but if you're around market boards for a while you always find people with some simple \"oh I'll just do this and this and the market will behave how I expect it to and I'll  make 10% a day I don't know why you guys complicate this stuff\" or some variation and try to defend their logic against reason. There's a ton of people that do this  and you blend right in.\n\nYou know what you *don't* see? People with consistently profitable win-win strategies explaining themselves and defending their knowledge on /r/wallstreetbets. \n\nThis is the equivalent of \"I'm gonna start going to the gym and eating right and get jacked\" while you're still a fat fuck eating cheetos and mountain dew watching anime.\n\nNo one gives a fuck about your idea, or your knowledge, or how much time you put into it. What people care about is VALUE. You put yourself in a position where you're not helping anyone and not letting anyone help you and you wanna go make money to prove us wrong? Go make money for you dude. I'd love to learn any insights you have if it's actually insightful.", "score": 6, "replies": [{"body": "RemindMe! 1 month", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Is this something a noob could start studying are do you suggest any prereqs ", "score": 5, "replies": [{"body": "yes, this starts with the basics and then progresses. begin with intrinsic value/extrinsic value(time value) and then move onto black scholes. black scholes is the main pricing model used to get the bid/ask you'll see quoted. It's built off the ideas presented in binomial modeling but incorporates continuous time rather than discrete time. ", "score": 8, "replies": [{"body": "This is awesome. Now can you give us the TL:DR on how to turn this into money?", "score": 2, "replies": [{"body": "Buy high, sell low faggot.", "score": 4, "replies": []}]}, {"body": "I need to research this more, but both discrete and continuous time have infinite possible value, the only difference being discrete has defined values v undefined like continuous, so I fail to see an edge/problem with the modeling as you suggested. Would love to hear otherwise.", "score": 1, "replies": []}, {"body": "Thanks. Done with my MA (non finance related) in May so I'll have to save this stuff for some summer learning!", "score": -3, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "So tough", "score": 4, "replies": [{"body": "gettha fuk out of this sub u fukin cvck", "score": -14, "replies": [{"body": "Keep trying", "score": 5, "replies": [{"body": "you think a MA is special? I got that sht in a year. a BS was way harder. required real effort/thought not required at a BA/MA level", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "The google drive link seems to not be working, any alternatives? Thanks", "score": 3, "replies": [{"body": "try it again. \nhttps://drive.google.com/open?id=0B3vffzeJiqj8Q2o5ZmdvM01KZGs", "score": 3, "replies": [{"body": "Hmm, im getting a server error. Ill give it a shot in a few hours, I should probably work at work too instead of skimming through derivatives lectures.", "score": 2, "replies": [{"body": "Works fine for me. Is your work using a web filter/proxy server? Might not be a good idea doing this there if so.\n", "score": 2, "replies": []}]}]}]}, {"body": "Did you just give me homework? Get the fuck out of here", "score": 3, "replies": []}, {"body": "dude it's easy x^2 is 2x thats all u need", "score": 3, "replies": []}, {"body": "Is this FIN6320? I'm a master's student at UGA now (artificial intelligence). What are your thoughts on the course as a whole?", "score": 3, "replies": [{"body": "yes, it's the hardest course you'll ever take. Put in roughly 40 hours a week just to get an A. ", "score": 4, "replies": []}, {"body": "But don't get me wrong, you'll learn more from this class than anything else. Celim is a good professor. ", "score": 5, "replies": []}]}, {"body": "Thanks! Saving this for later.", "score": 3, "replies": []}, {"body": "Thanks for the links. Have you used any of the CBOE's educational tools?\n", "score": 2, "replies": [{"body": "yep, it's a great site to use. here's another sight that's similar: http://www.optionseducation.org/en.html", "score": 2, "replies": []}]}, {"body": "Thx", "score": 2, "replies": []}, {"body": "thanks, saved for now and will read at a later date.", "score": 1, "replies": [{"body": "...Never", "score": 1, "replies": []}]}, {"body": "Good job man", "score": 1, "replies": []}, {"body": "> U[sic]GA\n\ndo you even finance, bro?", "score": 1, "replies": []}, {"body": "Ive gone through most of the tasty trade videos. Should I still learn all this crap? Tom Sosnoff says tasty traders are the most advanced traders out there, leagues ahead of all kinds of CEOs and fund managers. He also said not to use any other services. ", "score": 1, "replies": []}]}
