{"title": "You do not know how to trade in this week's market. Stay out of it.", "selftext": "[deleted]", "id": "4ox43m", "created_utc": 1466399329.0, "score": 53, "upvote_ratio": 0.88, "num_comments": 51, "comments": [{"body": "I took the week off work. Taking a trip to NYC with my $SWHC profits. Might take a selfie with the bull statue on wall st. \n\nNo trading. Just chilling until ARRY and MSTX cure literally every known disease on earth. ", "score": 38, "replies": [{"body": "Hey me too buddy. I'm just waiting for them to cure this one disease called Brokeasfuck.", "score": 15, "replies": []}]}, {"body": "So basically your puts are killing you right now?", "score": 20, "replies": [{"body": "Yeah. Market was consistently down so I sold puts.  Buy high sell low and all", "score": 0, "replies": [{"body": "Um...many of us do know what we're doing and your loss is your loss...sorry...but Brexit is fluffery to syphon cash flows into the major central banks...that's all... \n\nJust hold on...when they leave it's gunna be a madhouse!", "score": 3, "replies": [{"body": "If you're right, I'll respect you for once. ", "score": 1, "replies": []}]}, {"body": "If you have the balls to hold those puts, then you have a good chance to come out ahead. Selling into strength is a great strategy when the market is overpricing volatility.", "score": 1, "replies": []}, {"body": "Why would you be down if you sold puts and the market is going up?  Wouldnt you only be down if you bought the puts?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "it is real suspicious that lady getting iced.\n\ni feel like that is an example of some real \"MI6/MI5\" activity. ", "score": 7, "replies": [{"body": "Damn straight. Going long on any dip before 23rd. I wonder if the guy is just an agent that spent awhile building a legend, or if they have more interesting ways of manipulating people into doing things like that.", "score": 1, "replies": [{"body": "probably have ways of manipulating him.\n\nhe probably didn't even know he was being used.\n\nsubliminal sleep suggestions when brexit poll starting going against bankers.  maybe a spy pretending to be a random Internet person talking about conspiracy theories, instigating him to take action......\n\n*A random web poster perhaps....*\n\nI am starting to get worried..... about myself..... ", "score": 2, "replies": [{"body": "Spies have all kinds of shrinks serving them. They are masters of all things related to deception and manipulation, so naturally they would be interested in those who study the mind.\n\nhttp://www.latimes.com/world/afghanistan-pakistan/la-fg-torture-psychologists-20141214-story.html\n\nhttps://theintercept.com/2014/02/24/jtrig-manipulation/\n\nI think a lot of therapeutic psychiatry is snake oil, but I wonder if after decades of MKULTRA type research they really do have practical methods of programming suicidal, totally deniable assassins who have no idea what they're doing or who they're doing it for. Like suicide bombers, only with technological methods instead of applied theology.\n\nThis too-convenient assassination is like seeing a magician at work. Like a good magic trick, it may be elegantly simple. Curious about the tradecraft that went on.", "score": 1, "replies": [{"body": "brave new world.\n\ngood luck with your trades.", "score": 1, "replies": []}]}]}, {"body": "Guys were in WSB", "score": 1, "replies": []}]}]}]}, {"body": ">Go jerk off to totally nude singles in your area and come back next week  \n\ni prefer the singles in my area to by partially clothed. i feel like it helps my imagination.  \n  \nin your opinion whats stupid about gold? gold's at an all time high, people are entering because \"in uncertain times investors flock to precious metals\". if brexit doesn't exit, won't the market gain certainty and if the market has some certainty, maybe people will take profit?  \n  \ni know there's a bunch of if's and maybes in that statement. but if the market is gonna swing on some fool from england why not play the fool's binary?", "score": 9, "replies": [{"body": "Golds at 1900? Wat?", "score": 5, "replies": [{"body": "D'oh. Near 52 week highs... Not near alltime highs... My b", "score": 1, "replies": []}]}, {"body": "Please PM all material to me for inspection.", "score": 3, "replies": []}, {"body": "Can confirm, am up 8-9% on XIV and DUST", "score": 2, "replies": []}]}, {"body": "I am going to teach you that the best time to make money is when the volatility goes nuts... the 2000 and 2008 bubble presented some massive bubbles that shorters absolutely made a killing on and if you're that one lucky son of a bitch then why not try? For me, I say become a trader in volatile times and become an investor on bull runs.", "score": 5, "replies": [{"body": "> For me, I say become a trader in volatile times and become an investor on bull runs.\n\nGood motto. ", "score": 2, "replies": []}]}, {"body": "OP thinks he is smarter than everyone else, something that is extremely rare on reddit. ", "score": 3, "replies": []}, {"body": ">The market is trading primarily on Brexit which means it's trading on random polls of random selections of UK citizens that (literally) have no idea what they're doing until they do it. You could be up in your positions and then some UK news outlet at any time could announce it just did a poll showing _____ and the market could massively reverse.\n\nIf you think polling is that statistically unreliable then you are no more worthy of trading this week than any other robinhood redditor with a $100 portfolio.", "score": 3, "replies": [{"body": "He didn't imply the statistics were unreliable anywhere in that statement.   The implication here is that the people comprising the samples don't have a static opinion, and don't know what it is they'll collectively do until the day it actually happens.   There are still advertisements for both sides, so the statement \"polls can still massively reverse\" is true.", "score": 1, "replies": []}]}, {"body": "I'm holding a short Jul 1 exp IC on SPX 2000/2005/2140/2145. I plan to hold until expiration or at least close to it. I expect the wild swings but still range bound. \n\nI got in this trade before the murder and craziness but still holding tight. If the market stays green until Fri I may just close the short puts to neutralize my down side risk. \n\nGood post though. Many people think keeping money on sidelines is stupid but better than being in the game an losing. Play smart with your funds. ", "score": 2, "replies": []}, {"body": "From what I've seen/read, the brexit is price in for the initial shock that it will cause. I'm making this assumption based on the S&P 500 touching and falling around 2100. I know there are limitless other factors in play that could be keeping the S&P down, but it feels like the market's been propped up thus far by the powers at be preserving their \"legacy\" so I don't think we will see any major corrections (apart from unexpected events) until after Hillary or Trump assumes their role as potus. The pricing in seems almost like the SWHC 12% drop and then that decent upswing with their good earnings. So I think that we will see a decent boost up if the brexit fails and hopefully a under powered dip (due to the expectations of a leave that have been going on) if it's a vote in favor of leaving. Maybe I'm just a fslebman but logically that's how this seems to be playing out so far.", "score": 2, "replies": [{"body": "Brexit not gonna happen, Globalists wouldn't allow such a thing. ", "score": 3, "replies": [{"body": "but bug money will still bet the other way. Volatility galore this week. Calls and puts", "score": 1, "replies": [{"body": "Bugs don't have money you crazy asshole", "score": 1, "replies": []}]}]}, {"body": "You can only price in something like this so far when about a quarter of the market earnestly believes it's not going to happen, and another half has no fucking idea if it will or not.", "score": 1, "replies": [{"body": "It's not happening. It was never happening ", "score": 1, "replies": []}]}]}, {"body": "Where'd you see that information about algo trading volume? Would love to follow that.", "score": 2, "replies": []}, {"body": "http://panel.opinium.co.uk/\n\nregister for a brexit poll, impact the market", "score": 2, "replies": []}, {"body": "If you know BRexit is gonna happen, then you have something to go on, but yeah this week is gonna be a volatile week.", "score": 2, "replies": []}, {"body": "the fuck is this shit, telling people when to trade? why dont you just close out all your positions and unsub", "score": 2, "replies": []}, {"body": "yes, shit will go red again but I'm not staying out of it until it's too late ", "score": 1, "replies": []}, {"body": "I sold all my positions last Friday, gotta admit I was so close buying puts but luckily I didn't, never guessed the futures are up this much... Amazing....", "score": 1, "replies": []}, {"body": "WEEKLY SPY CALLS", "score": 1, "replies": []}, {"body": "good advice.......\n\ngonna ignore it.......\n\nselling naked spy calls , playing for a flat S&P or small drop before thursday's close.\n\nwish me luck...\n\nstill gonna fap to nude singles. thanks.\n\np.s. your brexit analysis 100% will add one thing though; some of the news quoted polls are freaking online polls. think i will go vote 10k times for brexit  and drive the market down a bit.", "score": 1, "replies": []}, {"body": "Britain won't let there be an exit. The powers that be won't allow that there is too much at stake financially speaking for many companies.", "score": 1, "replies": []}, {"body": "Speaking of political shit that fucks with market shit, is there any reading on the effect of markets around US presidential elections?", "score": 1, "replies": []}, {"body": "I don't know where OP got the idea that anyone here ever knew how to trade in any market.", "score": 1, "replies": []}, {"body": "This title should be posted every week tbh.", "score": 1, "replies": []}, {"body": "The people who will go on to own yacht's are trading this week.", "score": 1, "replies": [{"body": "Possessive yachts?", "score": 1, "replies": [{"body": "lol i guess this sub really does make people more retarded", "score": 1, "replies": []}]}]}, {"body": "So just bc you don't know wtf you're doing, we don't either? LOL.\n\nCongrats fggt, you win the autism award for the week. GFY wit this shit post. Enjoy sitting on the sidelines jerking off fggttt, while the rest of us are actually making $$ and not being pussies.", "score": 1, "replies": []}, {"body": "Complete agreement. FWIW banks have advised their trading desks not to quote in certain instruments already in the run up to the referendum. For those looking to have some potentially face ripping vol in their life, do not expect there to be plenty of liquidity to trade about in the run up, especially if the market is led to believe the outcome is no longer a certainty.", "score": 0, "replies": []}, {"body": "Its ok bruh, I covered all my shorts Wednesday, and I went long Friday.", "score": 0, "replies": [{"body": "GFY, faggot.", "score": 2, "replies": []}]}, {"body": "You all over there deep throating and I'm here making GAINz on CXRX", "score": 0, "replies": []}]}
