{"title": "This can’t be good for TSLA - Tesla hires a Snap exec as its engineering vice president", "selftext": "", "id": "8lilf7", "created_utc": 1527074921.0, "score": 246, "upvote_ratio": 0.97, "num_comments": 55, "comments": [{"body": "They hired Snap’s VP of monetization? Snap loses almost as much money as Tesla.", "score": 131, "replies": [{"body": "maybe they're trying to lose more money?", "score": 13, "replies": [{"body": "What goes down must go up.", "score": 2, "replies": []}]}, {"body": "lol I thought it was ironic too... surprised there wasn’t this comment 100x", "score": 14, "replies": []}, {"body": "I’m curious as to what a VP of reselling-user-data knows about running a worldwide, multi billion manufacturing company. ", "score": 5, "replies": [{"body": "Selling people’s credit cards to Mexicans?", "score": 3, "replies": []}]}, {"body": "Because you don't understand the math.   Tesla is running at -30% operating loss/gross margin and snap is running at -20%.    Combining both together is a multiplicative function and you get 60% gross margin.    Math doesn't lie.   ", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 30, "replies": [{"body": "Now for a $1B Pershing Square stake to top it off ", "score": 3, "replies": [{"body": "Can Ackman even afford that at this point?", "score": 2, "replies": [{"body": "We’ll see how Lowe’s plays out ", "score": 1, "replies": []}]}]}]}, {"body": "How shitty of a company do you need to be to have an entire VP-level role dedicated to \"wait a sec how the fuck do we actually make money?\"", "score": 88, "replies": [{"body": "Can we go to next question?", "score": 48, "replies": [{"body": "NEXT! ", "score": 27, "replies": []}]}, {"body": "Yeah that's like a political organization giving an entire position to someone to strategize elections. Crazy! ", "score": -6, "replies": [{"body": "It's not, though. Most organizations have a very clear monetization path, and the CEO/CFO are just trying to ramp that.\n\nIt'd be like a political organization giving a high-level position to somebody trying to figure out how voting machines work.", "score": 21, "replies": [{"body": "Ok well apparently SNAP, a company that started as a free app for sending nudes, does not have a such a plan. Having a VP for this role (not a C-suite like you're suggesting) doesn't seem so outlandish to me. ", "score": 2, "replies": [{"body": "It's  not outlandish that they have the role. \n\nThe amount of VC funding and investment in a company that NEEDS such a role is what is outlandish. ", "score": 6, "replies": []}]}]}]}]}, {"body": "Tesla will go the way of Snapchat, you put money in and it disappears after 30 seconds. ", "score": 29, "replies": []}, {"body": "Snap has cameras, autopilot has cameras. Clearly a massive synergy. Maybe Tesla can play ads on the model 3 touchscreen while autopilot is on.", "score": 8, "replies": []}, {"body": "Tesla said it had hired Snapchat maker Snap's vice president of monetization engineering, Stuart Bowers, as vice president of engineering.\n\nTesla to the moon? They going to find ways to monitize.", "score": 27, "replies": [{"body": "Hiring a money guy to do autopilot engineering sounds like he hired his buddy not someone qualified. ", "score": 59, "replies": [{"body": "He's there to figure out how to DLC the fuck out of Autopilot to maximize monetization.", "score": 11, "replies": [{"body": "The intent is to provide drivers with a sense of pride and accomplishment for unlocking different autopilot functions without dying.", "score": 13, "replies": []}]}, {"body": "Sounds like he hired someone to grow Tesla's social media presence and make it profitable, plus selling clothing and shit like Ferrari does. Plus gimmicky shit like the Snap Glasses but with Tesla's engineering behind it so it would actually be worth buying", "score": 6, "replies": [{"body": "From the article:\n\nTesla said it had hired Snapchat maker Snap's vice president of monetization engineering, Stuart Bowers, as vice president of engineering.\nBowers will work on the electric carmaker's Autopilot software and other projects.\n\nHe’s going to do Engineering, not social and monetization. ", "score": 20, "replies": [{"body": "\"Engineering\"", "score": 11, "replies": [{"body": "A quick trip to LinkedIn shows he was the head of applied machine learning for Facebook from 2012-2015 before SNAP.  Circle jerk aside, the dude probably knows his stuff. ", "score": 12, "replies": [{"body": "'LEAD TECHNICAL PM'\n\nAKA MORON who knows enough ML to convince executives he is useful\n\nkidding, slightly", "score": 3, "replies": []}, {"body": "But does he know how to lose money?", "score": 2, "replies": []}]}]}]}, {"body": "> plus selling clothing and shit like Ferrari does\n\nLolz.", "score": 3, "replies": [{"body": "Well, I hear Tesla shorts are popular...", "score": 7, "replies": [{"body": "They have a habit of riding up your ass, unfortunately.", "score": 4, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 18, "replies": [{"body": "Isn't that just businessman? That's like some dumb rebranding of an MBA. \n\n\"Oh no I'm not getting an MBA, I'm getting a Masters in Monetization Engineeringm\"", "score": 27, "replies": [{"body": "sounds like a business/marketing double degree", "score": 4, "replies": [{"body": "With a single course in CAD or Intro to Mechanics so they can brand it an eng. role.", "score": 1, "replies": [{"body": "Does the US not have an accreditation system for engineering degrees or are you just making shit up?", "score": 2, "replies": [{"body": "Sorry, forgot the /s", "score": 1, "replies": []}, {"body": "pretty sure civil enginerds have tests n such for safety but I'm not sure mechanical engineers or even electrical need a test", "score": 1, "replies": []}]}]}]}, {"body": "He would be the person in charge of figuring out technically how they can maximize spying on their users and collecting the most revealing and personal information possible, so that the data can be resolved to advertisers. Hence, engineering monetization. ", "score": 2, "replies": []}]}]}]}, {"body": "Snap, that's the sound of a TSLA investor's neck.", "score": 9, "replies": []}, {"body": "It’s a loss only if he’s fired", "score": 8, "replies": []}, {"body": "Elonnnnn whyyyyyyyy", "score": 3, "replies": [{"body": "[Elon's response when asked for comment](https://i.imgur.com/ZPdSFVT.png)", "score": 3, "replies": []}]}, {"body": "tHiS iS GoOd fOR tEsLA", "score": 3, "replies": []}, {"body": "From Jim Keller to Stuart Bowers 🤦‍♂️", "score": 2, "replies": []}, {"body": "Engineering what? The acquisition of Tesla by Hyundai? The assassination of NHSTA and SEC investigators? Fuck off, Elon. ", "score": 2, "replies": []}, {"body": "Which one of y'all on here gave them that idea", "score": 2, "replies": []}, {"body": "I wish there was some kind of reward for calling out Musk's bullshit in 2013-2014 when it was insanely unpopular to do so", "score": 1, "replies": []}, {"body": "Elon! Why are you burning my money hiring this faggot!? ", "score": 1, "replies": []}, {"body": "was musk recently vaccinated?", "score": 1, "replies": []}]}
{"title": "Roku with bogus numbers? hear me out", "selftext": "Roku has been reporting huge numbers of new subscribers. A quick google of \"Roku subscriber growth\" and you will see headlines of 48&#37;, 61&#37; etc. from 2017 to 2018 quarterly articles. This sounds great. But maybe too great. They are pretty late to the game, something has to give.\n\nLast weekend I went to WallyWorld and bought a $300 50\" 4k TV from some company I never heard of for my outdoor kitchen and got herpes from the checkout girl.  My thought is it will get fucked so might as well buy a cheap TV and replace it when it shits the bed, lightening, rain, drunk dude, etc.  The cheap TV makes you sign up on Roku and you have to go through a Roku account to get to the cable box HDMI  source to watch TV. Now this shows you being a Roku subscriber and you are an active account. But you are not. You are just watching two fags on ESPN yell at each other about if LeBron is a leader on your cable provider and not giving any money to Roku. \n\nSince this is a cheap shit TV from the largest brick and whitetrash store, how many fucking Roku accounts out there are BS? Someone just made an account to get into the TV to get to cable, air tv, or other platforms like AMZN, Netflix, Hulu, xBox, Playstation, etc. and Roku acting like they are \"active users\".\n\nMore to come as I dig deeper into this bottom bitch, without lube.", "id": "8lluj1", "created_utc": 1527101221.0, "score": 58, "upvote_ratio": 0.95, "num_comments": 51, "comments": [{"body": "damn guy, you're still around?  ", "score": 26, "replies": [{"body": "yeah, not as active on sub but still check it out every day.  We too old now.", "score": 22, "replies": [{"body": "Got that right. Hope all is well. \n\n\nxoxo", "score": 4, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "You can sit down until your beard is better than mine.  NIPPLE level. ", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I remain superior, but good work.  ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "my beard is 5'5\" tall, weighs 109lbs, made two kids, and is really good at cooking dinner.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Instructions unclear...  Buy calls??  I need to dig myself out of my $10k SNAP hole.", "score": 10, "replies": [{"body": "if you are in a SNAP hole you might want to just end it....find a bridge...", "score": 22, "replies": []}]}, {"body": "You might be on to something, send this to citron and prepare the sweet shorts. ", "score": 8, "replies": []}, {"body": "What brand? Hisense?", "score": 5, "replies": [{"body": "yes. pretty sure that is it.", "score": 3, "replies": [{"body": "I have one, but never hooked up a cable box to it. I've hooked up plenty of other stuff though and didn't have to set up a roku account. I think it asked me to create one when I first set up the tv, but I just ignored it and it fucked right off.", "score": 1, "replies": [{"body": "this one requires an account to get past, no skip feature. I spent 10 minutes looking for away around it.", "score": 1, "replies": [{"body": "Brutal.", "score": 1, "replies": [{"body": "at least you can skip the credit card part right now.... I am sure soon they will require a valid credit card to try to get those sweet sweet the user had no idea it was going to cost them $4.99 a month to watch a rerun of the Voice.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I'm fine with bogus numbers as long as they resurrect my 6/15 calls. After June 15 the SEC can take them down for all I care", "score": 4, "replies": []}, {"body": "roku is a real piece of shit that will not survive with as many competitors as it has, but it could be a while before people figure this out", "score": 4, "replies": [{"body": "The big problem with their competitors is that they all are more intent on selling you their content and they hate each other. Amazon wants you to use Fire for Prime. Google's not really competing anymore than chromecast, which is fine if you're just casting stuff from a laptop. Apple wants you to use Apple TV for iTunes. ROKU's the only agnostic platform.", "score": 5, "replies": [{"body": "Forgot Android TV. The Shield TV is the shit and plays everything in HDR. ", "score": 3, "replies": [{"body": "> The Shield TV is the shit\n\nTrue but NVIDIA has no idea how to sell it.", "score": 2, "replies": [{"body": "Yeah the gaming part is kinda lame but it’s the most powerful box by far. If you want 4K HDR it’s the best option by far. ", "score": 2, "replies": [{"body": "I'm just worried that it depends on the Google TV platform, which Google doesn't care about anymore.", "score": 1, "replies": [{"body": "Android TV.  Google TV is a very different thing...\n\nThere was just some news reports about Google killing off dedicated Chromecast devices and ramping back up on Android TV development.  They also released a new developer streaming stick at their developer conference earlier this month.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "No you stupid bitch you have to stream something over the last month to be counted.", "score": 8, "replies": [{"body": "Reference? ", "score": 2, "replies": [{"body": "http://imagizer.imageshack.com/img924/512/gO211n.png\n\nYOU NOW SMART", "score": 6, "replies": [{"body": "Yeah..you might be young and were not around for all the frauds in early 2000’s, 2007’s and even 2010’s when it comes to users. They state our “platform” but that could mean their OS. So unless they mark it as their owner or leased content that they bill for....it is could all be BS.\n\nFacebook got crushed by that kind of wording, so did YouTube before google bought them, and clear channel to name a few. \n\nYou probably think vitamin water is healthy too.\n\nNever trust vague terms from a company....they are vague for a reason. ", "score": 11, "replies": [{"body": "Roku doesn't even own content they generate funds by splitting the profit from ads, so as long as an ad is playing that's all that matters. This wording seems pretty legit to me.", "score": 3, "replies": []}, {"body": "It is their OS, pretty clear to me. They don't own any content. MVPDs rarely owns any content, all licensed. ", "score": 1, "replies": []}]}]}]}, {"body": "zing", "score": 1, "replies": []}]}, {"body": "I had a similar situation where my TV came with roku already on it and it is basically what makes it a smart TV. I havent used cable TV in years and instead just have Netflix and HULU, which I am only able to access through roku (just like you would use an amazon fire stick to access those apps if your TV wasnt a smart TV.) ROKU is bassically my TV's operating system. Instead of it technically being a \"SmartTV\" its a \"Roku enabled\" TV\n\nSo I actually am a daily active ROKU user but its just my TVs operating system and all I use it for is accessing Netflix and Hulu. I dont really see how ROKU could be benefiting from having me as a \"user\"\n\nWould you consider me a \"bogus\" user? I feel like a lot of people do the exact same thing as me. Honestly i dont even know what roku really is or if there is any other way I could be using it. Its just the screen that comes up when i turn my TV on then i click what App i want to use", "score": 2, "replies": [{"body": "you would be a bogus user, because you are not generating revenue for them but they are counting you as a active user \\(which is my claim that they are doing\\).", "score": 3, "replies": [{"body": "That shitty TV paid ROKU a licensing fee to use it and the OS serves up ads. That's the revenue streams it's getting.", "score": 6, "replies": [{"body": "Lol, ads? What are you talking about?", "score": 1, "replies": [{"body": "https://i.imgur.com/YydJsdm.jpg", "score": 5, "replies": [{"body": "LOL, Crackle. Watch Free.\n\nYou right though, you right", "score": 2, "replies": []}]}]}]}, {"body": "Yeah I think they are getting literally almost all of their users this way. Who the fuck buys a ROKU because they actually want it? No one I know. ", "score": 1, "replies": [{"body": "I stream stuff using many different services like Youtube TV, Amazon Prime video, Netflix, and HBO now.  I want one device that lets me access anything, and that's Roku.  Chromecast doesn't have Amazon Prime, and Firestick doesn't have Youtube TV.  And Apple TV is gayer than Elton John sliding down a rainbow with a plug in his ass.", "score": 7, "replies": [{"body": "Get a ps4 and the world is your oyster", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Yeah but what good is targeted content If all i do is go straight to netflix or hulu. Im not gonna click on an ad for a big black dildo on my way to those apps just because ROKU knows I am interested in one. \n\nI can understand facebook ads because they are everywhere and you actually spend time on facebook. The hour you spend scrolling through your feed creeping on girls you went to highschool with you are actually seeing the ads. \n\nAll of my time spent \"on roku\" so to speak is in one of 2 apps that are completely separate from roku. So they have the one chance of targeting ads at me for the 2 seconds im on the TVs \"home page\" and thats it. \n\nI get how free services make money with advertising i just dont see it applying similarly to the case of ROKUs that come built in consumers TVs\n\nI am pretty retarded tho so I could be wrong", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I fixed it.\n\nSTOP YELLING AT ME DAD ", "score": 4, "replies": []}]}, {"body": "I guess they could be collecting any data you give them using the Roku OS. ", "score": 1, "replies": [{"body": "Yeah but i question how much that data is actually worth. MoviePass collecting data was also supposed to be SUPER valuable. We all know how that is going for them ", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I am actually working on something about Spectrum, a real how they are frauding it up and breaking telecom laws. But I still have months of work on it. ", "score": 5, "replies": [{"body": "OP gonna wind up suiciding. ", "score": 6, "replies": [{"body": "here is my post \"I am not suicidal, do not do drugs, do not drive drunk, do not have any life threatening disease, and my last checkup a few months ago I was in the 95th percentile for my age with heart, blood pressure, weight, etc.\"", "score": 6, "replies": []}]}]}]}, {"body": "I just bought the exact same Hisense tv from Costco, can confirm.  Shorted Roku last ER and made a couple tendies", "score": 1, "replies": [{"body": "Actually impressed with TV once on cable box.... not bad for $300 ", "score": 1, "replies": [{"body": "Yeah, best $300 I've ever spent. Better than the $300 FD's I watch evaporate daily", "score": 2, "replies": []}]}]}, {"body": "they are giving them away if i come back to cable lols", "score": 1, "replies": []}, {"body": "Keep us updated. This could be an amazing put to have", "score": 1, "replies": []}]}
