{"title": "Inflation... recession... something... something... Meanwhile the S&P500 is climbing up and up. Never listen to the experts who \"predict of the future\".", "selftext": "", "id": "1487yds", "created_utc": 1686636067.0, "score": 682, "upvote_ratio": 0.89, "num_comments": 320, "comments": [{"body": "And it can come down just as easily. Nobody knows that the stock market will do.", "score": 450, "replies": [{"body": "yup the same people who yells 2021 was obviously overvalued are the same ones who are now yelling new bull market. Good to be balanced. Trim when market's overvalued, add when it's undervalued.", "score": 101, "replies": [{"body": "The major indexes will never be allowed to drop and stay down the kind of drop we saw in 87,29,08 etc..", "score": 8, "replies": []}, {"body": "Very different now and 2021. It's now doing a 2021 bull run even with opposite macroeconomic conditions. I think this gonna last longer than we expect", "score": 37, "replies": [{"body": "We are down from 2021 highs.", "score": 30, "replies": [{"body": "2023 new highs is my point", "score": 24, "replies": [{"body": "That is an interesting way to assess investment returns.", "score": 16, "replies": [{"body": "So what's your outlook friendo", "score": 3, "replies": [{"body": "I am light on equities and will remain so for some time.\n\nI hold energy and some commodities along with a few tech main players that I bought at compressed valuations.\n\nI have been lucky outperforming the index but I attribute it to luck and reading tea leaves in the right lighting.\n\nEdit: Earnings I am expecting to compress and ongoing unit labour costs to be poor secondary to productivity. With interest rates I think this will be a drag on investment and a slow grind of slightly positive to slight negative growth will persist. Ongoing poor productivity and dislocated markets will see inflation sit above target making rates stickier than expected by many.\n\nGood cash returns while markets balance out. Hard for me to justify any recession risk in an index.", "score": 11, "replies": [{"body": "You already missed out a lot. When will you finally admit you were wrong?", "score": -5, "replies": [{"body": "When my portfolio is down?", "score": 15, "replies": [{"body": "My portfolio is down but I’m not admitting I missed out. What am I doing wrong?", "score": 1, "replies": [{"body": "I don’t know.\n\nI hold a small concentrated portfolio with minimal turnover of holdings.", "score": 1, "replies": []}]}, {"body": "What matters is not if your portfolio is up or down, but whether it outperforms or underperforms the market.", "score": -3, "replies": [{"body": "Risk weighted returns is what matters.\n\nThe loss has a different cost for different people.\n\nRule number 1# Don’t lose money.\n- some old bloke said it once at an Annual Meeting.", "score": 5, "replies": []}]}]}, {"body": "They will never admit that they’re wrong. Instead they will stay out of the market forever, like morons. If they thought 400 was too expensive then they definitely won’t buy back in at 500, 600, or 4000. A generation of cucked bears has just been born.", "score": 2, "replies": [{"body": "Precisely.", "score": 1, "replies": []}, {"body": "RemindMe! 6 months", "score": 1, "replies": []}, {"body": "lmao at the short-sightedness. Please people use your brain.", "score": 1, "replies": []}]}, {"body": "FOMO is a dangerous thing. And his end date isn’t today so how can you know he missed out?", "score": 1, "replies": []}]}, {"body": "Get a recession proof stock?", "score": 1, "replies": []}, {"body": "Energy? Come on", "score": 1, "replies": [{"body": "If you think we have adequate energy supply systems in place to meet societal expectations I would love to see your working.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "What macroecon condition? Most of rate hikes haven't taken effect yet. Powell said this, all Fed officials basically said this.\n\nDo you think inflation is gonna go down magically to 2% with unemployment rate at 3.5%? No if rate hike takes 1 year to affect the real economy, we're only feeling the effect of 1% Fed fund rate. Like Fed Bostic said, the hard part hasn't even begun. And when the hard part hits, that's when people scream at the Fed telling them to cut rates, and they're gonna have to hold it. The difference between a Fed's soft landing and a mild recession is very minute. 0 growth is gonna feel like a mild recession, and we're not there yet. Also, I don't think people realize this, but the Fed forecast, and many economists who predict a soft landing, have unemployment around 4.5% by the end of 2024. So we're gonna be in this sluggish period for a while.", "score": 17, "replies": [{"body": "You ought to take a look what happened after Jul 2018", "score": 3, "replies": []}, {"body": "Explain \"haven't taken effect yet\"?", "score": 1, "replies": [{"body": "Rate hike affects bond market immediately but takes about 12-18 months before fully affecting the real economy and having an impact on consumer spending and business investment.", "score": 12, "replies": [{"body": "Moving goalposts, first it was 6-12 now 12-18 months.\n\nSo 24-48 months this fall then before the dreaded reaction?\n\nI'll just keep DCA investing myself.", "score": 8, "replies": [{"body": "Ya, see here’s what’s funny.  When you listen to morons talk about a recession it makes normal pleebs lose patience and get all defensive and laugh as the market goes up.  But when you listen to professionals, their level of accuracy is pretty high.\n\nWe have just now fallen into the normal distribution of recession timeline from when the yield curve first inverted.  The meat of the bell curve is basically the next 6 months.  Also the most predictive and accurate predictor of hard landing recessions is the SLOOS report that shows the tightness/looseness of bank lending.  The banks only became super tight in March.  The lag on that to recession is usually about 6 months without fail.  So anyone who knows what they are talking about would have only recently started predicting recession and would be predicting it for Q3 of this year.", "score": 9, "replies": [{"body": "No \"expert\" I've listened to could explain the deflation process we've had the last 10 years.\n\nWe've printed money and had low rates but nothing worked. Then comes corona and extreme moneyprinting giving us inflation. But I think the deflation processes never went away. It's still there plugging along in the background and picking up speed.\n\nWe'll probably see inflation going towards deflation soon and the fed lowering rates. The economic system is more resilient and chaotic than we give it credit.\n\nBut these are just my layman theories :)", "score": 0, "replies": [{"body": "I’m in the deflation camp too.  These videos are worth your time, I know every idiot on Reddit posts must watch videos, but if you are concerned about deflation, these are highly respected macro guys talking about it when few are.\n\nCheck out Jeff Snider with Eurodollar university.\n\nhttps://youtube.com/@eurodollaruniversity\n\n\nAlso, Dr. Lacy Hunt, he’s a macro legend with very significant results from the 70s to now.  He’s in the deflation camp too.  \n\nhttps://youtu.be/kzgzK-1xudY", "score": 2, "replies": []}, {"body": "I think us little guys are very resilient... and persistent lol.... I welcome red days. Because it won't even matter in 20 years lol..... That's my perspective on the whole thing.", "score": 1, "replies": []}]}]}, {"body": "Who's moving goal post? This time horizon was coined by Milton decades ago and used by fed officials today", "score": 8, "replies": []}, {"body": "I say buy. But really really buy when it's red.😁", "score": 1, "replies": []}]}]}]}, {"body": "Its already at 2% \n\n[https://truflation.com/](https://truflation.com/)", "score": 0, "replies": [{"body": "The Fed doesn't use truflation to set their 2% target. The accuracy of the data is still questionable, and its history is incredibly brief.\n\nJust look at SEP year end 2023 PCE forecast. It's been revised up every quarter for the last 1.5 years, and likely to get revised up again tomorrow.\n\nAlso, in case if you're not aware, getting from 9% to 4% is the easy and \"transitory\" part of inflation. Getting from 4% to 2% is the actual hard and persistent part, where all the low-hanging fruits are all gone.", "score": 2, "replies": [{"body": "But that doesn't mean the data is wrong? Cheers anyway", "score": 1, "replies": [{"body": "a 3% on truflation isn't the same as a 3% on CPI, and also isn't the same as a 3% on PCE.\n\nIf we're just picking any inflation metric, there're a bunch of different ones. The Fed themselves have like 10 of them, from dallas trimmed mean to atlanta sticky to NY underlying.", "score": 1, "replies": []}]}, {"body": "It’s 5.3. The core inflation is not 4 percent. It’s 5.3.", "score": 1, "replies": [{"body": "it doesn't matter what the current inflation print is. The last statement is still true. The underlying inflation is somewhere between 3.5% and 4.5%. That's the sticky, non \"transitory\" part of inflation that actually requires softer labor market to bring down.", "score": 1, "replies": [{"body": "It does matter bcs ur not including cost of food, housing etc. yes its 4 percent but the Fed goes by core inflation which is 5.3. It dropped from I believe 5.5 to 5.3. But whatever man, everything is super expensive and the cost of living is terrible for a lot of us and these ass wholes r playing a game with the economy. The truth is, everything is not affordable anymore so go ahead and hit new highs in ur stock market", "score": 1, "replies": [{"body": "when i said 4%, i'm not talking about headline CPI. I'm talking about underlying components within core CPI that are actually sticky.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Learn to distrust the Fed.  They frequently do not know what they are doing!", "score": 0, "replies": [{"body": "Or do things for the wrong reasons on purpose", "score": 1, "replies": [{"body": "Like listening to Cramer", "score": 1, "replies": []}]}]}, {"body": "It'll be a great time to buy such like VTI & such correct? Newbie here.....", "score": 1, "replies": []}]}, {"body": "What macroeconomic conditions? companies are printing money, we're back in business for the next 10 years.", "score": -2, "replies": []}, {"body": "It will last until the end of 2023. I believe we'll have a bear market 1Q24.", "score": 1, "replies": []}, {"body": "When stocks move opposite to macro - macro wins, every time.", "score": 1, "replies": []}]}, {"body": "How are you able to tell if market is over valued? What if earnings grow to catch up with valuation and price stays the same or goes up? Instead of prices falling down to even out valuation? \n\n&#x200B;\n\nSounds like you have some sort of a secrete, perhaps?", "score": 6, "replies": [{"body": "the notion that market was overvalued in 2021 wasn't a wild concept. The only thing is it took too long to correct, and people gave up and bought back in. Sounds familiar?", "score": 5, "replies": [{"body": "\"Sounds familiar?\"\n\nAre you implying that market is overvalued now? \n\nAlso seems like you have it figured out, as far as market timing. Care to post screen shot of your performance vs SP500 past 10 years?", "score": -1, "replies": [{"body": "yes. Sure if you're betting on SP500 unreasonably high earnings growth of 15% YoY for 2024, it might not be, although getting close to there as well. Hard to imagine earnings grow that much in 2024 when all of this resilience in inflation means the Fed's gonna keep rates high for longer into 2024. You can bet on PE expansion instead, but without easing rates, how's that gonna keep up?\n\n&#x200B;\n\nI'm pretty sure I heavily outperformed SP500, but that's just due to being an early tech investor for the last decade. But pretty sure you'll chalk me down as statistics so doesn't really matter.", "score": 2, "replies": [{"body": "Bro ! If your an early Tec. investor your freaking mooning 🚀🚀🛩️✈️🚀🌝", "score": 1, "replies": []}]}]}]}]}, {"body": "This sentiment is smart but it feels like most of the sub misses the boat on it. Most here seem like they’re 0% cash with a complete over-reliance on “muh new bull.” No stops or anything, just DCA until the money’s gone. Just bad risk management and the definition of the type of euphoria that gets completely trashed when the other shoe drops (and it definitely will).", "score": 2, "replies": []}, {"body": "The markets been overvalued for about 2 years though, that why the market is moving up to close the short positions before they send it back down again", "score": 1, "replies": []}, {"body": "still heavy cash in some parts. only put 20% back in today. there is an air of euphoria right  now, and the last 3 years reminds me euphoria leads to a wtf moment.... not that I am bearish, but I only added mostly to some mfs that is was like ok my dca is still down from this spot, I'll add to lower it a bit to this level.... too nutty in some cases, the institutions are going to need to take profits soon to close some gains. they do not leave everything on the table at all times. not all places are like buffet, and even he closes things down and buys back later at times or adds...\n\nmassively starting think like if you never realize, everything is on paper, and you are bound to lose, so realize at times... yes your dca might get higher, or lower depending on where it is, but you have realized and rebalanced.", "score": 1, "replies": []}, {"body": "But the point is that you probably don’t know whether the market is overvalued or undervalued. If you did then you could be a billionaire.", "score": 1, "replies": [{"body": "sure you don't know 100% the market's overvalued. But when the valuation depends on the Fed keeping 0% interest rate and doing quantitative easing for 5+ years and every big tech benefited from COVID stimulus and working from home and people started projecting that same level of growth 10 years into the future, there's a high probability the market's overvalued if just one of those conditions don't materialize.  \n\nJust like now when the market's priced in a perfect economic and earnings soft landing and Fed cutting pretty soon in a few months, if any of those don't conditions don't materialize, the market's overvalued.", "score": 1, "replies": []}]}]}, {"body": "“Just as easily?”  The trend for the S&P over 140 years is up. The average annualized return is greater than 7%. \n\nCasinos set up blackjack tables with less favorable odds and make bank. If you’re betting on “just as easily fall as rise” you’re looking for the soybean market, not the US equity markets.", "score": 11, "replies": [{"body": "Just you wait until all of this falls apart and we'll be back to 1900's prices! just you wait!!!! I tell ya!!!", "score": 7, "replies": [{"body": "I remember the 1900s. We used to walk around with an onion on our belt because it was the style of the day.", "score": 5, "replies": []}]}]}, {"body": "A month later “never fight the fed”", "score": 4, "replies": []}, {"body": "It can also go up easily\n\nJust buy dips and hold🤷🏻‍♂️", "score": 8, "replies": []}, {"body": "It will go up. It's just a matter of when.", "score": 4, "replies": []}, {"body": "Up, down, nobody know but one thing is for certain, it always moves to the right.", "score": 5, "replies": []}, {"body": "The stock market always goes up in a long enough time frame. Nobody knows what the stock market will do? Literally look at the 100 year chart. That is why every sell off is nothing more than a buying opportunity.", "score": 6, "replies": [{"body": "In all honesty the next 100 years could go up and up. Nobody knows what it'll do the next 2 years, 5 years 10 years etc. With human technology advancing at such a rapid rate we really don't know anything about tomorrow. On the same note, it could crash like the Titanic.........   It's only money anyway. So just buy more anyway lol. Especially when it's down. That's just my opinion any how... Cheers 🥂", "score": 1, "replies": []}]}, {"body": "I thought exactly the same. It takes 4 or 5 bad days in a row to send this YTD to 0%. This is why I bought VOO just once this year, and it was 14th of March after SVB sunk. \n\nWaiting for another pull back.", "score": 7, "replies": []}, {"body": "Actually that’s not really a true statement- zoom out and tell me what the stock market does.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "What’re you talking about? He’s just saying it’s as easy for the market to fall as it is to climb, and that no one knows what’s gonna happen???", "score": 7, "replies": []}, {"body": "If you cant comprehend his perfectly sensible message maybe you should not be having money in the stockmarket.", "score": 6, "replies": []}]}, {"body": "Not if you decrease rates and increase money supply.", "score": 1, "replies": []}, {"body": "The problem is everybody began throwing around the term stagflation and then that became “truth.”", "score": 1, "replies": []}, {"body": "This is where you're wrong as it's 1 in a 10 years where we have a bear market where SP usually dumps pitful 20% and we've had that last year but greedy people had to wait as always and now theyre crying.", "score": 1, "replies": []}, {"body": "Recession is NEVER happening.  🚀\n\nExperts don't know jack, they were just shaking the tree.", "score": 1, "replies": []}]}, {"body": "Never listen to those who cannot predict it either", "score": 45, "replies": [{"body": "My guess: we'll have a recession in the beginning of 2024, say feb. or march.\n\n15 to 20% drop on S&P 500.", "score": 0, "replies": []}]}, {"body": "As someone that has been in the markets since the early 1970's, what I see in my personal charts is the usual pattern of the roller coaster.  Institutional money causing personal money to follow so that they can pull the plug and enjoy the ride down while the individual gets screwed.", "score": 36, "replies": [{"body": "You mean insider trading among the wealthiest to screw everyone else?  Gasp.", "score": 15, "replies": [{"body": "Not just insider trading.", "score": 3, "replies": []}]}]}, {"body": "The market can stay irrational longer than you can remain solvent", "score": 24, "replies": []}, {"body": "Just buy value stocks or diversified ETFs and hold.", "score": 10, "replies": []}, {"body": "5000 SPX by next June", "score": 36, "replies": [{"body": "🐂👨🏻‍🍳😉", "score": 4, "replies": []}, {"body": "You got money where your mouth is?", "score": 1, "replies": [{"body": "Yes I do. Well I am long equities. Not exactly buying more here. Would love that gap to fill at 3990 SPX to load up. We are a bit too stretched on tech on RSI. \n\nWe can have a -7% dip and SPX be at 5000 next year 👍", "score": 4, "replies": []}]}]}, {"body": "Isn’t the stock market always bullish before a recession?", "score": 85, "replies": [{"body": ">Isn’t the stock market always bullish before a recession?\n\nAnd bearish before a huge rise, lol.", "score": 68, "replies": [{"body": "What I mean is I’ve noticed that majority of the recessions occur after a bull run. Considering the recent predictions that a recession is imminent don’t you think the market is being pumped to make a quick buck before the recession hits? Idk but I feel like with the amount of info these hedge funds and investment firms have it only feels like they’d do this to make a quick buck before it comes down crashing(again no clue what I’m talking about but the fact that the stock market and the economy has little correlation these days is a little scary) \n\nPs: its a tin foil but out of pessimism and not a bear bias.", "score": 6, "replies": []}]}, {"body": "100%", "score": 22, "replies": []}, {"body": "Why though?", "score": 1, "replies": []}, {"body": "Yes but that doesn't mean anything today as chance of recession is low", "score": -2, "replies": [{"body": "Europe is in recession", "score": 2, "replies": [{"body": "Their stock market at two year high though", "score": 2, "replies": []}]}, {"body": "\"this time is different!\"", "score": 4, "replies": []}]}, {"body": "Not the market but news sources will all say bullish/bearish. Eventually, when everyone is on the same page, the inverse happens. \n\nNot what's happening rn tho, many sources still saying the worst is yet to come while others say we are in a bull market.  \n\nImo we've been in a bull market for about 6 months. Wasn't a lot of strength at first but the last few weeks convinced many as per the volume increase that this is the start of a new bull market. Again. Just my opinion. I'll change it when conditions are met but as of now I'm bullish", "score": 1, "replies": []}]}, {"body": "It’s almost as if the stock market like most of the economy no longer matches how the American populous is performing.", "score": 29, "replies": []}, {"body": "I remain convinced this is the riskiest and most epic pump and dump of the entire market we’ve ever seen. \n\nSomebody or some groups are going to rake in as much as they possibly can and then one day, the rug pull. I don’t know if the rug will pull all at once or like dominoes but it’s gonna happen. \n\nIn my totally uneducated opinion, this whole market is so fuckin crazy it looks/acts like those ridiculous meme/penny stocks …. I’m just waiting for the rug pull and then all the poors holding the bag. People’s retirement and savings wiped out. The economy completely looted and people kicked out of their homes again, all the while the super rich get richer and swipe up all the property and investment opportunity at a steep discount. \n\n\nYes…. I’m a child of the 2008 recession. How could you tell?", "score": 29, "replies": [{"body": "I just don’t see it. Its a natural phenom for markets to correct themselves naturally. Its a healthy part of a good market. For nearly 12 years of ridiculously stupid gains, we suffer just around a -18% performance on equities for a single year? It just doesn’t make sense to me either. Perfectly fine collecting 5.5-75% APY on my Tbills right now.", "score": 0, "replies": []}]}, {"body": "The bigger it is, the harder it falls", "score": 27, "replies": []}, {"body": "Take 7 tech companies out of the s&p and see where we at", "score": 28, "replies": [{"body": "... That's literally the reason to buy index funds.  So you get all the winners.", "score": 38, "replies": [{"body": "That's irrelevant to what he's saying. He's talking about the market breadth.", "score": -5, "replies": []}, {"body": "Why just not buy the actual winners instead wtf? There are only 7 names to DYOR and get the best 1 or 2??", "score": -6, "replies": [{"body": "That's a great idea!  Which 7 stocks are going to perform the best for the next 5 years? \n\nAlso, why did no one else ever think of this in the history of the stock market?", "score": 11, "replies": [{"body": "more than likely a few of the 7 tech stocks that move the S&P, are you not paying attention", "score": -3, "replies": [{"body": "Yet another brilliant idea!  You're full of them!  \n\nNow, are those stocks going to move the S&P up, or down over the next 5 years? \n\nYou're so good at investing, you must be very rich.", "score": 1, "replies": [{"body": "Just saying that it makes sense to me to buy the individual stock.. and yeah this year I have done really well on my stocks and pair trading assets, TSLA/MSTR especially so.", "score": 1, "replies": []}]}]}]}]}, {"body": "Why not just buy 7 tech companies?", "score": 1, "replies": []}]}]}, {"body": "I mean to be fair most people calling for recessions were saying late 2023/early 2024 if you bothered to read their articles. So this really means nothing.", "score": 15, "replies": []}, {"body": "See 2006/2007 for more details", "score": 13, "replies": [{"body": "Or, you know, maybe not", "score": 8, "replies": [{"body": "Just look at the 1929-1932 market crash. This is the exact same thing.", "score": -2, "replies": [{"body": "🤨", "score": 1, "replies": []}]}, {"body": "I remember identical conversations in 2006 and 2007. People denied the problem right until people started jumping from buildings. Is there really a question of whether a recession will ever happen again? History tells us that it’s only a matter of time. Methods and policies shift, which steer the ship but sometimes crash it. The federal reserve, an unelected group of bankers that rotate in from private industry, can change the fate of the country with one decision. One house speaker can crash the whole world economy by freezing the debt ceiling. It’s a fragile system that runs on corruption and it breaks all the time.  There’s always a chance that someone bumps the table and knocks over the dominos. I make good money on puts because system failure isn’t hard to find. Ever recession is preceded by bullish periods. Start investigating how the ship is being steered. There’s a lot more to the story of the banking crisis from a few weeks back. Trading options allows for profit no matter what happens and encourages an honest assessment.", "score": 1, "replies": [{"body": "Oh a recession will happen again. Maybe in 2026 when the S&P500 hits 6000 and it falls to 4800.\n\nI remember first looking at investing around 2017 - we were overdue for a recession. So many people were saying it was an awful time to invest because everything was too hot. It was scary to invest because these people were convincing and easy to believe. S&P500 was around 2500.", "score": 2, "replies": [{"body": "100% agree on the general fear mongering. Reminds me of chicken little’s “the sky is falling”. That said, people are out right denying recession as a possibility. I spoke to a member of my extended family who was told by all his investment buddies that the economy will only go up. Recession is a constant risk. We’ve seen industry-specific collapses. No one, with the exception of government officials with access to classified information, could have guessed that COVID would collapse the world economy. The fall is always imminent but rarely happens. I have been in two car accidents but have worn my seatbelt thousands of times without really needing it. The people who disagree point to how well the economy is doing, as if that somehow negates the possibility of a downturn. I’m simply suggesting factoring in the risk and tracking indicators.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 18, "replies": [{"body": "When the market is\"terrible\" it is cheap. Why pause when it's cheap?", "score": 44, "replies": [{"body": "To me terrible means when it's at ath", "score": 27, "replies": [{"body": "Now I got you and completely agree with you 👍", "score": 15, "replies": []}, {"body": "It's at ATH most of the time tough.", "score": 16, "replies": [{"body": "This", "score": 1, "replies": [{"body": "Hey there realguyfromthenorth! If you agree with someone else's comment, please leave an **upvote** instead of commenting **\"This\"**! By upvoting instead, the original comment will be pushed to the top and be more visible to others, which is even better! Thanks! :)\n***\n ^(I am a bot! If you have any feedback, please send me a message! More info:) [^(Reddiquette)](https://www.reddithelp.com/hc/en-us/articles/205926439#wiki_in_regard_to_comments)", "score": 0, "replies": []}]}]}, {"body": "If I understand it right, you would have paused investing in 2013 after market was back at ATH and would still be waiting to get back in in 2023?", "score": 2, "replies": [{"body": "There's always pullbacks. What i meant is that ath usually means a euphoric market.", "score": 1, "replies": [{"body": "If I'm following your logic, in 2013, SP500 set new all time high of 1,600 points. You would sit out on side lines, waiting for pull back bellow 1,600 that never came?", "score": 1, "replies": [{"body": "U need to look at valuations dude...", "score": 1, "replies": [{"body": "Ok", "score": 1, "replies": [{"body": "Just to expand on the point. Let's pluck numbers out of the air here. 1400 at P/E 20, is more expensive at 2000 at P/E 10. In this case I'll buy at 2000 and not 1400.", "score": 1, "replies": [{"body": "You thinking we are going to drop down to ~2,200 level? \n\nAlso, if I looked at the right chart, last time we were close to pe of 10 was 1985.", "score": 1, "replies": [{"body": "That was an example...I literally said \"plucking numbers out of the air\"...", "score": 1, "replies": [{"body": "I think we just gona have to go our separate ways on this one pal. Have a nice night.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": ">\tf the market is terrible then pause but other than that keep at it. There is no sense to time the market, \n\nYou’re literally advocating for timing the market.", "score": 23, "replies": [{"body": "Yeah you never know when the conditions are actually terrible.\n\nI've seen bull markets continue on for years, even though the shorters were eventually right. The problem is their accounts got blown up shorting too soon, and never had a chance to participate in the actual bear market.\n\nThat's the thing about shorting, you have to be right about the direction AND the timing.", "score": 2, "replies": []}]}, {"body": "Yeah you never know when the conditions are actually terrible.\n\nI've seen bull markets continue on for years, even though the shorters were eventually right. The problem is their accounts got blown up shorting too soon, and never had a chance to participate in the actual bear market.\n\nThat's the thing about shorting, you have to be right about the direction AND the timing.", "score": 2, "replies": []}]}, {"body": "Fundamentals stay the same, so the more it climbs now, the more it falls later", "score": 11, "replies": []}, {"body": "All scam", "score": 13, "replies": []}, {"body": "Cat bounce", "score": 5, "replies": []}, {"body": "Inverse the experts.\n\nBy the way, how do they becoming experts. Constantly being in industry. Anyone tracking them all....", "score": 7, "replies": []}, {"body": "Wow!\n\nhttps://imgur.com/iH8FwE8\n\n4 comments pumping TIO, and two of the accounts are less than a day old.  That's not suspicious at all!", "score": 5, "replies": []}, {"body": "little bit of a short term view my friend.", "score": 9, "replies": [{"body": "Yeah you could actually make this point for real by zooming out", "score": 8, "replies": [{"body": "yes the s&p 500 only goes up, but you it goes down too. Everyone sounds like they are pitching [pets.com](https://pets.com) right now.", "score": 2, "replies": []}]}]}, {"body": "The pump before the dump", "score": 7, "replies": []}, {"body": "Unless unemployment gets above 5% there won’t be any recession imo. Right now, janitors are asking for $20 per hour where we are. Such is labor shortage. The little people can prop up the markets too through buying power of goods and services.", "score": 2, "replies": []}, {"body": "Lmao what is up with the $TIO shilling", "score": 2, "replies": []}, {"body": "So far so good. Tomorrow it is another story.", "score": 2, "replies": []}, {"body": "“Experts”", "score": 2, "replies": []}, {"body": "Well, with the spread inverted like nothing we’ve seen since 1981-82 for as long and as deep, something’s gotta give. It’s bubbling under the surface, and I think we’re all going to get toasted.  Employment stubbornly high, inflation stubbornly high, commercial real estate in a hole, high interest rates pushing mortgages over the edge. This event has all the ingredients to be a recession, even a great one. We’ve seen this movie before…", "score": 2, "replies": []}, {"body": "The SPX has not been a useful gauge of anything related to the real economy since QE forever started and probably prior during the Greenspan era as well.", "score": 2, "replies": []}, {"body": "Never listen to anyone about the market period. Come to your own conclusions and problem solve when things go wrong. It's the only way you'll be consistently profitable year over year.", "score": 2, "replies": []}, {"body": "4040 next resistance is major resistance", "score": 2, "replies": []}, {"body": "The future is just an idea in the head. When it comes it comes as right now.", "score": 2, "replies": []}, {"body": "Crazy how the S&P keeps climbing yet our ports are slow as fuck and about to be on strike 🪧", "score": 2, "replies": []}, {"body": "It’s called a wall of worry, bull markets are born by climbing it. Nothing new under the sun my friends.", "score": 2, "replies": []}, {"body": "Friendly reminder that the stock market does not measure the health of the economy.", "score": 2, "replies": []}, {"body": "Buy and hold, no matter what market looks like", "score": 2, "replies": []}, {"body": "And then the U.S. was forced to default, due to unforeseen circumstances. The end.", "score": 2, "replies": []}, {"body": "I kind of like the idea of diversified bond portfolios right now. Big baskets of bonds at a discount that would then rise when fed eventually cuts rates again. Have started buying a little now and plan to just buy a little every month. A lot of bond funds seem to be at Covid lows which looks oversold to me and dividends of yields of 8% to 10% cover inflation? Example PDI, PDO. Community thoughts?   To be clear not looking for a bagger or 5 bagger. See maybe 30% return + dividends over a 3 year period.", "score": 2, "replies": []}, {"body": "I'm learning never listen to the fud and negative news. Just keep buying when I can. Especially when it's red.", "score": 2, "replies": []}, {"body": "Same people forgot to tell us to invest in 2008", "score": 2, "replies": []}, {"body": "Gotta love the guys who celebrate like they won at the end of 2nd quarter.", "score": 2, "replies": []}, {"body": "Sometimes I just hope it’s a massive bear trap so people like you can learn a good lesson about the market", "score": 3, "replies": []}, {"body": "If you know you know. \n\nThe debt ceiling removed spending for the next 2 years, that's bullish. Last time this happened. 2020. Made a killing in futures. Today I retired from my day job!", "score": 2, "replies": []}, {"body": "Inflation is real lol S&P500 doesn’t change that fact", "score": 2, "replies": []}, {"body": "I only listen to experts that uses tarot or crystal ball, if I see a chart I run away.", "score": 2, "replies": []}, {"body": "Melting up boys and and girls. Followed usually by.  Well,  you know...", "score": 2, "replies": []}, {"body": "Like yourself?", "score": 2, "replies": []}, {"body": "You want reality? Look at a 2 year chart", "score": 2, "replies": [{"body": "OK.\n\nhttps://imgur.com/8fu1kAR\n\nSeems ok to me?", "score": 3, "replies": [{"body": "Seems fine to me too. Especially if you kept buying the whole way", "score": 1, "replies": []}]}]}, {"body": "Could simply be rising for a better cash out when they sell right before the crash", "score": 2, "replies": []}, {"body": "This is just trying to get the average Joe to move their money into the market. Let the billionaires fight each other.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Does it really? I’ve only been in the investing game for the last 3 or 4 years so have never seen a cycle before.", "score": 1, "replies": []}]}, {"body": "I agree \"Mr market guru\" always drop a hit peice on a stock. Last week was consumer spending stocks. Then A.I. hype stocks,  even going as far to compare A.I. to the tech bubble . What they did to tesla today with the talk of being over brought. Rsi above 70, 10 days of consecutive gains. \n\nThose damn stock news casters are fear mongers.", "score": 1, "replies": []}, {"body": "Just because we are going up right now, doesn't mean that we don't have a major crash coming... if anything, the price of the stock market is getting way beyond fundamentals... \n\nP.S. I'm actually long right now and riding this as I think we are going to grind higher until at least August. But I do believe new lows are coming once the recession is very clear. Market is priced at 19x FE right now... that's very expensive.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I will be messaging you in 2 months on [**2023-08-13 13:57:05 UTC**](http://www.wolframalpha.com/input/?i=2023-08-13%2013:57:05%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/StockMarket/comments/1487yds/inflation_recession_something_something_meanwhile/jnzss5z/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2F1487yds%2Finflation_recession_something_something_meanwhile%2Fjnzss5z%2F%5D%0A%0ARemindMe%21%202023-08-13%2013%3A57%3A05%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201487yds)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}]}, {"body": "Inflation actually drives the stock market up, so your point is?...", "score": 1, "replies": []}, {"body": "Fed gave up on being tough on inflation . It's why we've been hearing a pivot from October and why there talking  about a pause while inflation is still at 5% .\n\n\nMarket is ripping because we're pricing rate cuts growth and inflation going  down as if we somehow solved economics.", "score": 2, "replies": [{"body": "This is all I can figure as well.  But there is also that possibility the markets really are fraudulent.", "score": 2, "replies": []}]}, {"body": "Do what 99% of the investors are not doing. Now the 99% is doing what the 1% should do.", "score": 1, "replies": []}, {"body": "Bear markets have historically seen the biggest pull backs and gains. This is normal market structure. \n\nNew lower lows are coming later this year.", "score": 1, "replies": []}, {"body": "Confirmation bias.", "score": 1, "replies": []}, {"body": "Anyone please help me on this, all those yelling “THERE WILL BE A STOCK MARKET CRASH!!!” There already WAS a stock market crash, Nasdaq felt 36% and SP500 felt 20% last year.", "score": 1, "replies": [{"body": "yup, and likely this has been a bear market rally is all. Rate hikes likely to continue tomorrow… several months of downturn is what I’m looking for.", "score": 2, "replies": [{"body": "Rates will go down before 2024.", "score": 1, "replies": [{"body": "Agreed.. but if (when?) they raise tomorrow and the then again in July, it aint gonna be pretty for markets. Perhaps a pause in Sept is what I’m leaning toward", "score": 1, "replies": [{"body": "So you believe that a country with a 130% debt to GDP ratio will have 5.5% interests rates for an extended period of time ? Specially with inflation going down hard and fast ? Let’s see I guess :)", "score": 1, "replies": [{"body": "Yes. I think the FED said their target rates were 5.5% and 2% inflation. What they have been doing, raising rates for a year, has been working so why stop now when they’re still short of their 2% inflation goal(?)  Also, didn’t they pause too early in the 70’s and have to jack shit up double digits to make up for that mistake? \n\nI think they raise .25 again tomorrow, then maybe again in July, perhaps a pause.. but likely a pause in Sept, which would send markets soaring. And then when they finally start lowering rates we’ll know the recession is here (next year?). They’ll use rate cuts as a tool to ease recession just like they raising rates to ease inflation now. \n\nas my old man would say, “Clear as mud?” 😆", "score": 1, "replies": [{"body": "Clown on me if I’m wrong, but I think there’s a high chance the fed will pause tomorrow.", "score": 1, "replies": [{"body": "Good call Gretzky! Although I think we 3 were all right here, yall with the pause, I with the two more rate hikes coming. Either way.. I was still SHORT and did ok (sell the news) 😆", "score": 1, "replies": []}]}, {"body": "Number one the recession is already underway, number two we just can’t compare today with the 70’s as we are 130% Debt to GDP ratio when it was 25-30% debt to GDP ratio back then, it is impossible to see 10-20% interests rates nowadays. Also if you look at this www.truflation.com we are actually at 2.54% yearly inflation today.", "score": 1, "replies": [{"body": "Mornin’, Hmm interesting, thanks for sharing. I don’t think we are in a full blown recession yet though cause we’re missing two major things for that to be: 1) Negative Earnings and 2) massive Job losses. We don’t have either of those yet (another reason to continue rate hikes, they haven’t broken things yet 😆). So until both of those start happening I think the “real recession” is still on the way. See you at the rate hike! or pause! 😉", "score": 2, "replies": []}, {"body": "Hey Loud! Guess we were both right, sorta lol. You with the pause call, me with the two more hikes coming before end of year (per his press conference) so technically a skip(?) \n\nI was Short so doing good lol", "score": 1, "replies": [{"body": "I believe the FED have a narrative they have to follow and what they say and the truth are two different things. They lied about keeping interest low for a long time, so why do you believe them now when they say the interest rates will be high for a long time ? I’m very curious. Fool me once shame on you, fool me twice shame on me.", "score": 1, "replies": [{"body": "I dont recall saying anything about interest rates being high for ANY amount of time so I don’t know where you’re getting that. I’ve said they are targeted 2%, we aren’t there yet. I’ve said we’d get two more rates hikes, yet was surprised by the skip decision today, thinking they should have just cont’d to pull the bandaid off. I know there target is at least 5.5 so when they get there, who knows how long they pause for. \n\n“Rate cuts this year will not be appropriate” and \n“We are talking about a couple of years out for rate cuts” are two points that stuck out to me. \n\nIdk, I just follow this shit to better trade shitcoins \nClosed +30.64% today shorting Lido DAO/usdt on 5x", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "What goes up, must come down.", "score": 1, "replies": []}, {"body": "Now is the time for puts PLTR 6/16 15P", "score": 1, "replies": []}, {"body": "Ever notice that terminal people always feel great just before they go? \nYour looking at a terminal economy. Just wait", "score": 1, "replies": [{"body": "To clarify to other readers, you don't know anything", "score": 1, "replies": [{"body": "True education comes with age, many young people believe education and wisdom are the same….they are not.", "score": 1, "replies": []}]}]}, {"body": "SP is weighted with majority big tech. It’s being held up by 4 companies. Horrible representation of our economy", "score": 0, "replies": [{"body": "That's the point of an index", "score": 0, "replies": [{"body": "The point of an index is to find a representative sample, not just pick and choose across industries to inflate/deflate the value", "score": 0, "replies": [{"body": "Yes, I agree. but if someone is comparing SP, that is weighted, to an entire economy (recession) than it is horrible.\n\nEdit: I wasn’t clear in my point but I think you proved it. The fact that it IS WEIGHTED means it’s the worst. The average company on the SP is at a loss…", "score": 2, "replies": [{"body": "For sure, then it seems the problem is not with the principle of looking at the index as an economic marker. That's why they were made in the first place. The issue is that it has been adjusted so much for purposes of fine tuning the actual values (rather than letting the market/companies within it dictate it's value) in the effort to drive \"growth on paper\", that it became useless as an economic marker. I'm not disagreeing with you by the way, just elaborating my previous comment.", "score": 1, "replies": [{"body": "Lol we are agreeing aren’t we. Cheers!", "score": 2, "replies": []}]}]}]}]}, {"body": "thats how its been for a long time though, back in the day they were just different companies.", "score": 1, "replies": []}]}, {"body": "Obligation money going into stocks :)   \nNobody want to buy america or EU obligations, it's becoming more and more risky. This money is going right into stocks", "score": 0, "replies": []}, {"body": "JPOW said screw your soft landing. This will be the mother of all crashes later this year. AI bubble going to burst.", "score": 0, "replies": []}, {"body": "The market moves opposite to public sentiment, this is how they make money. As soon as faith is restored they will tank the market", "score": 0, "replies": []}, {"body": "[removed]", "score": -2, "replies": [{"body": "What's it like to be a shill? Does it pay well? Literally all your posts are pumping a single stock.", "score": 2, "replies": []}]}, {"body": "Every economist will tell you the stock market is not the economy. I hope you are able to make a boatload before the next dip. CEO’s are forecasting that the economy will dip this winter. Recession? Who knows- but CEOs know their balance sheet and revenue streams- I’m not saying it’s a deciding factor, just worth considering in your strategy.", "score": 0, "replies": []}, {"body": "The stock market was horrible in 2022. Worst year since 2008. We were due. I think inflation and a recession were already priced in. We're going up a lot more from here. The Dow is still down over 2,000 points from 18 months ago.", "score": 0, "replies": []}, {"body": "I got back in last Thursday and was worried I had made a mistake!  😂", "score": 0, "replies": [{"body": "Remind me next week lol. Good luck", "score": 2, "replies": []}]}, {"body": "He thinks stonks only go up lol", "score": 0, "replies": []}, {"body": "The Mainstream Media was non stop fear mongering for 2022 up until May of 2023. They couldn’t go a few sentences without mentioning hinting at a crash. \n\nSurprise surprise when you only get one side of the story, you may get misled. If you’re one point of view you’ll miss the other likely possibility, like an obvious swift economic recovery.\n\nI try to ignore obvious forms of emotional manipulation. Ignoring the lying false prophet financial influencer gurus and the fear mongering Mainstream media. Once I started doing my own research and looking at the financials and trends of individual companies, I started being profitable.", "score": 0, "replies": []}, {"body": "Oh i am not predicting some obscure future.   \nI am expecting a result from a calculation. Though you are correct, no one can predict how far from reality this whole system will go.", "score": 0, "replies": []}, {"body": "I fully expect this to be a fake-out before the market tanks like a Russian convoy", "score": 0, "replies": [{"body": "Everybody expects it to tank. That's why it won't.", "score": 1, "replies": []}]}, {"body": "This is what happens when you give a hedge fund/market maker control of 70% of public listed companies. \n\nManipulation. \n\nIt’s a free and fair market though they say.", "score": 0, "replies": []}, {"body": "This is sme good fud. This is some inverse Cramer shit right here.\n\n\n\nGME", "score": 0, "replies": []}, {"body": "I mean its pretty clear that the Stock market is not a good representation of the economy itself. Look at covid when everything was shutting down but the Stock market was booming.", "score": 0, "replies": []}, {"body": "[removed]", "score": -4, "replies": [{"body": "I don't know why I like Carl Icahn but I want him to be innocent.", "score": 3, "replies": []}, {"body": "What's it like to be a shill? Does it pay well? Literally all your posts are pumping a single stock.", "score": 2, "replies": []}]}, {"body": "2022 was a crash so 2023 is up. It‘s not that difficult, people. Inflation falling. Economy and labor market strong. Add 1 + 1 together 🤷🏻‍♂️", "score": -1, "replies": [{"body": "and there is it.. my Sell signal 😉", "score": 1, "replies": []}]}, {"body": "[removed]", "score": -1, "replies": [{"body": "NIO suck ass", "score": 1, "replies": []}]}, {"body": "[removed]", "score": -5, "replies": [{"body": "What's it like to be a shill? Does it pay well? Literally all your posts are pumping a single stock.", "score": 3, "replies": []}]}, {"body": "[removed]", "score": -5, "replies": [{"body": "What's it like to be a shill?  Does it pay well? Literally all your posts are pumping a single stock.", "score": 2, "replies": []}]}, {"body": "All that recession talks, how the stock market will crash....\n\nFrom all time highs of SP500 at 4800, it went down to 3500 briefly and it's back up almost 4400..\n\nListening to anyone, anytime is like a fool proof way to miss chances and fail in the stock market", "score": 1, "replies": []}, {"body": "never ever listen to the experts who predict the future. rather tease them when they are not immediately right. much better strategy", "score": 1, "replies": []}, {"body": "What goes up cannot come down", "score": 1, "replies": []}, {"body": "Well, the future is a pretty long timespan ^^'", "score": 1, "replies": []}, {"body": "Inflation can make stocks go up just as easily it  can make stocks go down.", "score": 1, "replies": []}, {"body": "Only a handful of companies in that index are bringing the prices higher, notably TECH stocks due to the AI hype. If you look at the other indexes, industrial averages, they dropped or remained the same. \nCurrently the 10Y 3M rate has inverted, meaning it's more profitable to invest in a short term savings account linked to Tbills (now above +5%), so investors will eventually pull their money out of the stock market ... 😅", "score": 1, "replies": []}, {"body": "As long as people continue to believe the stock market is the best place to make money the markets will continue to grow.", "score": 1, "replies": []}, {"body": "Thank god I bought TQQQ in April", "score": 1, "replies": []}, {"body": "Newer investor here… it’s becoming clear that no one knows what will happen. I’ll just keep buying and holding good companies I guess.", "score": 1, "replies": []}, {"body": "The 2 year return of the S&P 500 is something like 2%. Proper time horizons pay dividends", "score": 1, "replies": []}, {"body": "Just because they are early doesn’t mean they are wrong", "score": 1, "replies": []}, {"body": "...said someone on August 22, 2000 & on October 2, 2007 & on February 5, 2020 & on January 3, 2022.\n\nFull disclosure: They did fine as long as they were buy & hold investors.\n\nAlso, please, for the love of God (if you believe in one), **listen to the experts  from a variety of backgrounds and opinions, and ignore the people who tell you otherwise**.", "score": 1, "replies": []}, {"body": "I only listen to people on Reddit for financial advice.\n\nCheckmate", "score": 1, "replies": []}, {"body": "I’m convinced it’s just more inflation. No real growth. Just greed and everything in our lives getting more expensive, and the cash in our pockets bleeding value.", "score": 1, "replies": []}, {"body": "They have been talking about recession since november 2021", "score": 1, "replies": []}, {"body": "Same thing happened in 2007. Check your arrogance. You’re just exposing your inexperience. Congratulations on learning the obvious, DCA and keep powder dry.", "score": 1, "replies": []}, {"body": "But it legitimately is only 5 tickers pumping the market. Everything else (except those 5) are flat or falling.", "score": 1, "replies": []}, {"body": "Turns out people oversimplify both the bearish and bullish scenarios.  The market is complicated.  Few will argue with the buy and hold strategy, but if I'm predicting what happens in the next 12 months I am still going to guess down.", "score": 1, "replies": []}, {"body": "Its almost like the CPI methodology was last revised in 1999 and actual inflation measured with modern methods is more like 2.8% and not 4%. \n\n&#x200B;\n\nAll my \"smart money\" friends said I was going to regret buying the dips from October to February.  \n\nNow it's \"well, you can't predict the market\" lol well if you bought those dips then you predicted the market.", "score": 1, "replies": []}, {"body": "Still think something has to give. Everything is so over inflated in value. The age of fraud is upon us. Corruption everywhere. False numbers to inflate value has become the norm...", "score": 1, "replies": []}, {"body": "Inflation is going down, so the market goes up.", "score": 1, "replies": []}, {"body": "The stock market is not representative of the economy. Business students learn this in their first semester.", "score": 1, "replies": []}, {"body": "The reddit experts can suck my tiny bolls, anyone that follows people on Internet knows how much cope they snort after they've missed the bottom.", "score": 1, "replies": []}, {"body": "Have you not been looking at the last 3 years of returns? (Or lack thereof)", "score": 1, "replies": []}, {"body": "*Sigh...*", "score": 1, "replies": []}, {"body": "It's a bit crazy how the market focuses on various minutia on a weekly basis. \n\nIn 2008 with the PIIGS, people used to call Greece a totally fucked up economy for letting their debt levels get out of control (hit 146% i think). Now the US is almost at those same levels, and yet no one seems to care... so long as inflation ticked down a tad everything is fine, or so long as interest rates don't move a sliver then nothing wrong here. \n\nMarkets feel more like a casino than any kind of sober evaluation of value.", "score": 1, "replies": []}, {"body": "I always tell myself, time in the market > time out of the market.", "score": 1, "replies": []}, {"body": "You do know that inflation means higher prices right, right?", "score": 1, "replies": []}, {"body": "I think what the market is doing, speaks for itself. The market is forward moving, and it shows that our economy is stronger than most people believed. Who is leading the charge? Companies like nvidia, and faang companies. Innovators like Elon and Mark...these people lead the charge. They are adapting to the current economical situation, and i believe other businesses will follow. The american people are adapting as well, and i think things will slowly improve going forward. It's not that nobody has any money. People aren't used to seeing such high interest rates so we Americans are currently pouting. I believe this initial shock factor will fade away, along with the continued rising of the rates, and things will slowly improve. Just my opinion anyhow", "score": 1, "replies": []}, {"body": "Ye we are mooning", "score": 1, "replies": []}, {"body": "Only buy when your stomach is falling out of your butt", "score": 1, "replies": []}, {"body": "Trade what you see not what you think.. (pheww finally i can say this)", "score": 1, "replies": []}, {"body": "I remember this sub saying to short nvidia 🤣", "score": 1, "replies": []}, {"body": "Because markets are forward looking,?", "score": 1, "replies": []}, {"body": "I predict we keep printing money and line go up, with wealth gap continuing to grow, and more people continuing to live off debt", "score": 1, "replies": []}, {"body": "Aaaaand we all missed out… AGAIN", "score": 1, "replies": []}, {"body": "I’m glad I’ve been aggressively contributing to my accounts all year. If it falls then no worries. I’ll still be adding more", "score": 1, "replies": []}, {"body": "Regardless of what you believe, just use your brain. We’re in extreme greed, so the short term move is clearly going to be bearish once this tops (and it’s likely close). If nothing else, understand the risk of putting a bunch more money in and not having any hedges or defensive positioning. But it’s your money so best of luck.", "score": 1, "replies": []}, {"body": "Next week's post:\n\n\nS&P500 down 4% in a week", "score": 1, "replies": [{"body": "thats a bit conservative, no? gonna be more like -4% in a day 😆\n\n..to start several months of selling.", "score": 1, "replies": []}]}, {"body": "Watch that bubble get bigger and bigger!", "score": 1, "replies": []}, {"body": "It’s certain to crash. The trillion dollar question is when. You’re naive and very foolish to believe that it won’t.", "score": 1, "replies": []}, {"body": "Unless his name is Tom Fucking Lee", "score": 1, "replies": []}, {"body": "!remindme 6 months", "score": 1, "replies": [{"body": "shittttt.. remind me 6 days", "score": 1, "replies": []}]}, {"body": "Don’t listen to so called experts that get things totally wrong consistently", "score": 1, "replies": []}, {"body": "This comes up a lot. This is actually an indicator of inflation. Price of stock going up while economic metrics stagnate or drop.", "score": 1, "replies": []}, {"body": "There’s a lot of freed up excess liquidity. This is a divergence", "score": 1, "replies": []}, {"body": "The market hasn't even crashed yet. Stfu", "score": 1, "replies": []}, {"body": "All the factors become to complicated and confusing, I'm so glad I blindly buy s&p every month.", "score": 1, "replies": []}, {"body": "A rug pull to dwarf all rug pulls. Nothing feels right, right now.", "score": 1, "replies": []}, {"body": "Never too late to make money", "score": 1, "replies": []}, {"body": "No one know wheres the market’s headed, I know much richer people then me that decided to hold a ton of money in cash, gold, or silver around the pandemic anticipating the SP500 will fall to new lows. Time in the market is better than timing the market.", "score": 1, "replies": []}, {"body": "I listen to what the FED and the president is doing on fiscal policies, then try to act accordingly.  The last few days \"smart money\" was betting that inflation numbers would look good--and they did kinda. \n\nCongress and the president decided to increase the debt limit so more money printing.  \n\nNow we'll see what good old J-Pow throws in the ring...", "score": 1, "replies": []}, {"body": "Those who know don’t say and those who say don’t know", "score": 1, "replies": []}, {"body": "Lots of doomer cope in the comments section today", "score": 1, "replies": []}, {"body": "Anyone who sorts by YTD and not 1Y is not someone you should trust", "score": 1, "replies": []}, {"body": "S&P to 2500-3000,  first leg down is 3800", "score": 1, "replies": []}, {"body": "Look at the core SP numbers and they tell a different story. Combined with inverted treasury yields with a huge spread and over a trillion in CRE loans due in the next few years tough times are ahead. This AI rally is brutally overvalued.", "score": 1, "replies": []}, {"body": "Hasn’t fallen more than 1% in 14 weeks which is truly nuts", "score": 1, "replies": []}, {"body": "Haters be like nooooooo economy is doing great! 😂", "score": 1, "replies": []}, {"body": "Only 5-6 companies are really up and driving these metrics... most of the rest or all rest are like 0-ro", "score": 1, "replies": []}, {"body": "SPX has around 7 stocks pumping it. The other 490 aren’t going up.", "score": 1, "replies": []}, {"body": "Shits coming down soon", "score": 1, "replies": []}, {"body": "Tesla goes brrrrr", "score": 1, "replies": []}, {"body": "I would short here with both hands", "score": 1, "replies": []}, {"body": "The best time to invest was the past. The second best time is the present.", "score": 1, "replies": []}, {"body": "Remindme! 6 months", "score": 1, "replies": []}, {"body": "Inflation is very real lol…..", "score": 1, "replies": []}, {"body": "Your comment won't age well.", "score": 1, "replies": []}, {"body": "Isn't that just like 5 companies with the rest of the 495 going down?", "score": 1, "replies": []}, {"body": "Up like 8% since this post. Hmmm", "score": 1, "replies": []}]}
{"title": "Inflation rose at a 4% annual rate in May, the lowest in 2 years", "selftext": "", "id": "148edz4", "created_utc": 1686659593.0, "score": 217, "upvote_ratio": 0.9, "num_comments": 118, "comments": [{"body": "In general, if you have to ask \"is this spam?\" - it's spam. Spam includes but is not limited to:\n\n- lazy or low effort posts\n- copying and pasting the same post across multiple subs\n- Posting the same thing multiple times in the same sub\n- clickbait, self promotion, referral links, surveys, and anything else that could be regarded as shady or unwelcome.\n\nViolating spam rules may result in a permanent ban.\n\nLink to the rules: https://www.reddit.com/r/StockMarket/wiki/rules", "score": 1, "replies": []}, {"body": "Oil fell from 85 to 68 so this isnt shocking. Now do core.", "score": 41, "replies": []}, {"body": "Question: how do they calculate inflation? Like, if a bag of blueberries is $10... and the vendor shrinks the bag 25% but still charges $10... does that count as 25% inflation? Or is inflation considered flat since the blueberries still only cost $10.", "score": 73, "replies": [{"body": "US Gov has a bunch of people that go around to different vendors and inspect the item and its price. It is pretty stringent, they make a note of price, the type of product, content of the product, weight of the product, and I even think ingredients.\n\nYou might have even seen them around your grocery store, they are just regular looking people carrying around a tablet looking at items.\n\nWSJ article on it, but it's paywalled:\n\n[https://www.wsj.com/articles/inflation-bls-price-checkers-who-determine-cpi-11652132333](https://www.wsj.com/articles/inflation-bls-price-checkers-who-determine-cpi-11652132333)\n\nQuote: *\"The job of a price-checker is exacting. To price an item, workers go through an up to 11 page list of data points to make sure they are pricing the same item they did the prior month. a can of soup has 12 different specifications, including* ***flavor****,* ***size****,* ***brand****, organic labeling, material of the packaging and* ***dietary features*** *such as sodium content.\"*", "score": 61, "replies": [{"body": "You don't even have to go through the paywall loophole from some news site. The Bureau of Labor Statistics just tells you how they do it! :)\n\n[https://www.bls.gov/opub/hom/cpi/](https://www.bls.gov/opub/hom/cpi/)", "score": 33, "replies": []}, {"body": "Non-paywalled: https://archive.ph/JA8CG", "score": 6, "replies": []}]}, {"body": "Deflation because I'm substituting them finally with my own blackberries and I pay $0 for them 🤣\n\nThe \"permaculture effect\", soon to be adopted by the BLS, will interact with the hedonic quality effect because your home grown blackberries are 100 times better than anything available in the supermarket, so even more deflation", "score": 6, "replies": [{"body": "i've always wanted to grow fruit and veggies... but I figure they'd get infested with bugs and I'd end up eating a spider or something.", "score": 2, "replies": [{"body": "cayenne pepper keeps everything away", "score": 2, "replies": [{"body": "As in a cayenne pepper plant or ground pepper sprinkled around? :)", "score": 1, "replies": [{"body": "sprinkled", "score": 2, "replies": []}]}]}, {"body": "Peanut butter is one of the most controlled foods in the FDA list; an average of one or more rodent hairs and 30 (or so) insect fragments are allowed for every 100 grams, which is 3.5 ounces.\n\n But don't worry it's just adds to the protein.", "score": 1, "replies": []}]}, {"body": "blackberries have good and bad years mainly due to precipitation in correlation with ripeness. obviously an armature blackberry farmer. you'll have many bust years", "score": 1, "replies": [{"body": "you can water them", "score": 1, "replies": [{"body": "No. Rain or watering before ripeness will swell the berries causing them to lose their flavor and/or go to mush.", "score": 1, "replies": [{"body": "I water mine using rainwater, amazing flavor", "score": 1, "replies": []}]}]}]}]}, {"body": "It’s a joke, consider for example that CPI used to include steak as one of the food items, it later was substituted for some ground beef, to make inflation seem lower.", "score": 10, "replies": [{"body": "Source?", "score": 11, "replies": [{"body": "https://www.bls.gov/opub/mlr/1998/10/art1full.pdf\n\nHere ya go.\n\nPrevious poster was slightly incorrect in their steak for ground beef analogy. \n\nHow this actually works is, steak goes up in price, so people buy less steak and more ground beef. Or, more chicken, or more pork, or whatever is on sale that week. So a households net meat expenditure stays the same, but they’re buying lower quality/different product so therefore inflation doesn’t exist because they’re still spending the same total dollar amount", "score": 9, "replies": []}]}, {"body": "Or because ground beef is purchased more often than steak and is a better representation of the average household’s spending patterns.\n\nI don’t see anything on Google though, do you have a source?", "score": 6, "replies": [{"body": "Right so it’s not an accurate depiction of decreasing standard of life.\n\nI laugh at people that think SS won’t be there ever.  The reality is they are slowly destroying the purchasing power by gaming CPI numbers.  I mean didn’t they recently take one year averages into effect as opposed to two year averages for comparison data?  It would be obvious why you do that at the top.  Or like the OER number which will always come back low and accounts for 3/4 of shelter when only 2/3rd of people own homes.  I", "score": 1, "replies": []}, {"body": "Doubling up here so more people can see \n\nhttps://www.bls.gov/opub/mlr/1998/10/art1full.pdf\n\nHere ya go.\n\nPrevious poster was slightly incorrect in their steak for ground beef analogy. \n\nHow this actually works is, steak goes up in price, so people buy less steak and more ground beef. Or, more chicken, or more pork, or whatever is on sale that week. So a households net meat expenditure stays the same, but they’re buying lower quality/different product so therefore inflation doesn’t exist because they’re still spending the same total dollar amount", "score": 1, "replies": []}]}]}, {"body": "The CPI is a joke\n\nhttps://twitter.com/davidlin_TV/status/1668604346584690688?t=e8nn1qU7cyzEUBZ0WNCrIQ&s=19", "score": -5, "replies": [{"body": "100%", "score": -4, "replies": []}, {"body": "How? Did you really expect every category to be up exactly 4% and are calling fraud when it's not?\n\nGoogle weighted averages and it'll show you how some categories can be up more than 4% and some actually decrease like energy and average out to a 4% increase overall", "score": 1, "replies": []}]}, {"body": "Eh, how is this an issue? Just use the price/mass, then package size is irrelevant", "score": 1, "replies": []}]}, {"body": "Someone please talk to me here… isn’t that still bad? Yes it’s going down but there will be a few more months of the highest inflation rates in like a decade right? And it’s been this high for over a year now", "score": 14, "replies": [{"body": "And prices aren't coming down so these horrible prices are here to stay and its still rising at twice the level we want and that's if you even believe their numbers", "score": 12, "replies": [{"body": "Deflation is near impossible because of the ratchet effect, you may see deflation in certain markets but due to wages overall prices basically never deflate without economic collapse", "score": 13, "replies": []}]}, {"body": "Yes, they say it's going down, but actually it's still going up, the rate by which inflation goes up is lower. If inflation would go back it would be negative.", "score": 2, "replies": [{"body": "Why don't they just say that inflation is not going up as fast as it had been in the recent past.", "score": 1, "replies": [{"body": "Because journalists are know-it-all pussies", "score": 1, "replies": []}, {"body": "Money", "score": 1, "replies": []}]}]}]}, {"body": "I love the year over year comparison, what was it last year in the US? Oh yeah 8.58% in May. So 12.63% over 2 years, that's not very good.", "score": 39, "replies": [{"body": "I mean that’s how compound interest works but end of the day you’re not getting deflation so you need to measure it year over year.  \n\nBasically you can’t put the genie back in the bottle just hope prices don’t keep increasing at the same rate", "score": 37, "replies": [{"body": "The genie can go back into the bottle if there is deflation.", "score": -9, "replies": [{"body": "This is very naive.  Deflation is total economic disaster essentially.  It means everyone in debt (which is almost everyone) gets more underwater every year as their home, car, business etc decreases in value", "score": 8, "replies": [{"body": "Not to mention on a macro level it discourages businesses from investing/producing more in general", "score": 1, "replies": []}]}, {"body": "You really really don’t want deflation, as nice as it initially sounds.", "score": 3, "replies": []}, {"body": "If we’re continuing the analogy that’s not the genie going back into the bottle.  Your salary keeping up with inflation and then it stopping would be the genie going back into the bottle because then it’s be like nothing happened, other than maybe your mortgage being a much better deal.\n\nDeflation would be the genie physically putting **you** into the bottle and all the pain that would entail.", "score": 2, "replies": []}]}]}, {"body": "https://twitter.com/davidlin_TV/status/1668604346584690688?t=e8nn1qU7cyzEUBZ0WNCrIQ&s=19", "score": 0, "replies": []}]}, {"body": "Inflation rose slower, so time to celebrate. /s it did not go down, it just went up slightly slower than it did last quarter... this is REALLY trying to find a silver lining in a fecal matter hogie", "score": 19, "replies": [{"body": "At no point in this process will inflation go negative or we have a serious problem. Inflation at 4% isn’t great news but it is good news.", "score": 32, "replies": []}, {"body": "Some inflation is not bad", "score": 17, "replies": [{"body": "Some inflation is normal.\n\nIt's usually 2-3% per year.", "score": 11, "replies": [{"body": "The normal rate is still debated but it used to be lower than 2 to 3 percent, more like below one percent in classical econ with closer to price stability. The 2 percent inflation number was never empirically or theoretically justified, it was basically just a number pulled right out of thin air by some central bankers (from Australia or around there) who were late to a meeting to fill in a slide. Long term deflation of course isn't desirable, though short term deflation can and sometimes has to happen in certain sectors if they get inflated by bubbles--when rent, housing and groceries become unaffordable such prices of basics do have to come down. \n\nHowever, the amount of \"useful\" inflation beyond stable prices has never been empirically tied to 2%. That's more of a rule of thumb lacking anything better, but traditional econ had that number at under one percent, or at least some stable number to make sure wages and cost of living stayed manageable for most Americans. In fact if wages *don't* rise with inflation (and that's a particular problem for the United States with such low unionization levels), then even relatively low levels of inflation are much more destabilizing and contribute to social unrest. (We're seeing a lot of homelessness and stores getting stolen from or shoplifted now as prices rise beyond wages) If there isn't a reliable way to raise incomes with inflation, then even modest increases in inflation beyond stable prices (ie. even below 2 percent) can cause serious trouble, and due to the severe inflation over the past 3 years, even 2% inflation in the US on top of that would be troublesome, saying the very least.", "score": 1, "replies": []}]}, {"body": "Why? Why is some inflation not bad? Inflation is the increase in the money supply, that devalues the currency. We have been on a 2 year tear. We are hitting 18% real inflation, that means the purchasing power of the US dollar has declined by almost 1/5th in the last 2 years. with 4 trillion due to be printed and funneled through the fraudulent markets via Yellen, this is only going to get worse. MUCH worse.", "score": -8, "replies": [{"body": "Some inflation is good because it encourages people to invest their money. “Some” meaning like 1-2%.", "score": 14, "replies": [{"body": "I completely disagree with you. No inflation is good for the regular person (everyone not in the top tax bracket). Wages have not kept up with inflation over the last, well ever... Investing money in a fraudulent market to allow Wallstreet Bankers and the financial services industry to GAMBLE with it, is not investing. It is literally giving your money to the house in HOPES they don't blow it all, and maybe give a little bit extra back. 2008 should have taught everyone, but we have 2 problems in our society. 1. we are incentivized through culture to be greedy, and 2. we have very short memories.", "score": -16, "replies": [{"body": "You can disagree all you want, the economic science is in and overwhelmingly agrees with my point. I’d be curious to read any article trying to make the point that deflation is good. \n\nAlso how are wall street bankers gambling with my money when I DCA into broad market ETFs and the SPY?", "score": 13, "replies": [{"body": "Deflation would realign asset value with asset pricing. Currently the entire system is flush with un-supported fiat currency. The country owes 34 trillion dollars. The interest alone on that debt is larger than most countries GNP. BRICs is going to really hurt the value of the dollar if they can ever get their bickering tabled and get cohesive in their approach. \nOn the topic of your investment, that is going to really hurt if it rolls over and flatlines because the market corrects to where it fundamentally should be. There is no real economic reason for the US stock market to have such a massive valuation. The only thing that has it pumping is the removal of government borrowing limits. Someone is going to be left holding the bag, when the bill comes due. Buy yeah 1-2% is good. 0% would be good. Neither of those things is going to actually happen seeing as the Fed just turned the printer of absolute debt on, and put it on overdrive.", "score": 0, "replies": [{"body": "*takes a look at the subs in your comment history*\n\nAh makes sense...", "score": 3, "replies": []}, {"body": "You made a lot of unrelated points but I will try to address each one.\n\nDeflation would align asset value with pricing:\nNot sure what you mean by this….. ? we value an item based on what people will pay for it and the. Price it accordingly. \n\nUnsupported Fiat:\nIt’s been that way since the 70’s and for good reason. Countries that tried to maintain some sort of gold standard were left in the dust economically. \n\n34 trillion in debt:\nI agree with you here. We have to get the deficit under control. It can’t keep increasing exponentially indefinitely \n\nBRICS:\nThey have been the boogey man for 30 years and are in worse shape now than they were 20 years ago.\n\nStock market correction:\nWhat do you mean by that? What price “should” they be at and how did you determine that?\n\n0% inflation is good:\nSource? Again this goes against every economist for atleast the last 100 years \n\nFed printing money: again I agree with you. It can’t keep going", "score": 2, "replies": []}]}]}, {"body": "I have some news for you. Every single central bank in the world has one job and one job only: to keep inflation at 2%.", "score": 4, "replies": []}, {"body": "You can disagree because perhaps you just don’t know better but deflation is an economic disaster", "score": 2, "replies": []}]}]}, {"body": "Because deflation is very bad", "score": 7, "replies": []}, {"body": "Inflation helps whittle away my mortgage, auto, and student loans. A little is great as long as you keep your income moving up with inflation and keep your assets in classes that will weather inflation as well.", "score": 3, "replies": [{"body": "Wage growth has not even come close to matching inflation. All those things would be great, if they ever happened. The problem is they don't, they won't, because that eats into Wallstreets arbitrage profits.", "score": 2, "replies": [{"body": "Wage growth is the number most in your control.", "score": 2, "replies": [{"body": "Sure, based on an expanding products market which drives an expanding services market. Now price in the inflated (due to government intrusion) cost of higher education, and roll that right into the massive outstanding student debt. A degree and a decent job does not make much sense to a young person whonis going to be paying that off for 10 years, just so a banker can skim their percentage off the top for Lending borrowed money to a student.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Still high.", "score": 15, "replies": [{"body": "3% is the norm. 4 is actually amazing compared to what we’ve been seeing", "score": -11, "replies": [{"body": "2% is norm… 4% is still high.", "score": 24, "replies": [{"body": "Closer to 3 and well over 3 for an average for the past 60 years.", "score": 8, "replies": [{"body": "Not the last 20 years though. They have struggled to get it up to 2% in fact", "score": -1, "replies": [{"body": "For one, the past 8-10 years are far from the norm.", "score": 2, "replies": [{"body": "Sure but it’s closer to the reality we are adjusted to compared to arbitrarily grabbing some data points from the 60’s and 70’s", "score": 1, "replies": []}]}]}]}, {"body": "The \"norm\" depends on what time period you're looking at. \n\nThe \"norm\" for the past 10 years has been about 2%. But that decade itself has been an abnormally long period of lower than \"norm\" rates.  From 1960 to 2021, the average annual rate of inflation has been 3.69%.", "score": 2, "replies": [{"body": "Anchor point is 2%, the normal.", "score": 1, "replies": [{"body": "\n\nSo it seems like we have a difference in what the word \"normal\" means. To me, it means \"in line with past results\".", "score": -1, "replies": [{"body": "You are moving goal posts and calling it normal. Your opinion is wrong.", "score": 2, "replies": [{"body": "In addition to having unconventional meanings for commonly understood words, you are also needlessly confrontational and stubborn.", "score": 1, "replies": [{"body": "Aren’t we all here for that?", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "https://twitter.com/davidlin_TV/status/1668604346584690688?t=e8nn1qU7cyzEUBZ0WNCrIQ&s=19", "score": -7, "replies": [{"body": "Not clicking a twitter link lol", "score": 2, "replies": [{"body": "\"People might say, but ya, look at my grocery bills, it's up a lot more than 4%, CPI is a lie....yes, look at the groceries components of the CPI. All up a lot more than 4%. Remember, CPI is an index of weighted items.\"", "score": 1, "replies": [{"body": "One guys grocery bill is up more than 4%? Oh yeah, CPI is a conspiracy", "score": 3, "replies": []}]}]}]}]}, {"body": "4% is still greater than 2% right? Or do we have new math now?", "score": 5, "replies": []}, {"body": "The headline is misleading. Monthly inflation for May wasn't 4%. The 4% figure is year-over-year inflation. And most of it happen about a year ago. We have been freaking out about inflation that actually happened about two years ago.", "score": 4, "replies": [{"body": "\"Inflation rose at a 4% **annual** rate in May, the lowest in 2 years\"", "score": 9, "replies": [{"body": "It did not. The 4% figure is for year-over-year inflation. You get that by adding up the monthly inflation for the last 12 months.", "score": 1, "replies": [{"body": "I get that. I highlighted \"annual\". It says it rose 4% \"annual\" in May. That means from May to May. When they write annual they are saying for the last year total", "score": 1, "replies": [{"body": "Yes, they are but most people think prices rose 4% last month.", "score": 1, "replies": []}]}]}]}, {"body": "Lol so just cause it happened a year ago it doesn’t matter. Prices are still high af how out of touch are you?", "score": -1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Where did I say that? I’m saying everyone is celebrating this as a win is brain dead because we are still fucked", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Should’ve cranked rates 1% a long time ago", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Same thing. The FED bases their decisions on core CPI anyway which is still fucked.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Normal y-o-y inflation is about 2.5%. We are close to that. Prices never go down except in a doomsday depression. What you want is for wages to go up.", "score": 1, "replies": [{"body": "In 2009 we had 6 months of deflation from March to October. We need that now. People are struggling. Wages obviously aren’t going up.", "score": 1, "replies": [{"body": "Wasn’t that the Great Recession? No thanks. Didn’t lose my job like many others but my stocks took a beating.", "score": 1, "replies": []}]}]}]}]}, {"body": "No matter how much you polish a turd it's still a turd. \nInflation is still higher than it should be yoy. Plus, your weighted basket of goods has been substituted to death to fluff the numbers for so long. No one actually knows what the true inflation is. Especially over these last 2 years.", "score": 1, "replies": []}, {"body": "Celebrating inflation that is still rising but *slower* as a victory is like thinking a beer makes you sober after drinking an entire bottle of Jack Daniels. \n\nInflation is entrenched and has been compounding since 2021. Core inflation has been .4 or higher every month for the past six months. Hardly a victory and most consumers still think the economy sucks.", "score": -1, "replies": []}, {"body": "Yields still up anyway", "score": 1, "replies": []}, {"body": "command narrow gullible fear waiting grey abounding tease marry dependent\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": []}, {"body": "I think a rate pause is likely tomorrow after this report. though I expect the Fed to maintain the current rate for at least the rest of the whole unless if we enter a sudden recession. \n\nI do think it's funny that I basically predicted that inflation would fall and be in the three percent range sometime during Q3 of 2023 last summer due to commodities dropping in price and supply constraints easing, only to be laughed at back then lol.", "score": -20, "replies": [{"body": "Hur dur, i told you so!  My totally uneducated guess ended up now looking marginally less implausible than it did last summer", "score": 6, "replies": [{"body": "I followed commodity, container prices, and tanker rates last summer, all which were dropping, with all three of them being the biggest indicators for future inflation. \n\nSo no, my analysis wasn't uneducated.", "score": -2, "replies": []}]}, {"body": "Not even close to 3%", "score": 0, "replies": [{"body": "MoM about to turn negative later this year. Look at the trend, Feds are done. Soft landing", "score": 2, "replies": []}]}, {"body": "No way they keep it at this rate for the rest of the year if it keeps dropping like this. We’ve dropped basically a whole percentage point in 2 months", "score": -2, "replies": [{"body": "Core still at over 5%.  Headline CPI down largely due to lower energy prices.\n\nI think we see another hike.", "score": 8, "replies": [{"body": "I don’t think we see a rate hike tomorrow, but my unscientific swag feeling guess is 50% chance of at least one more hike later on.", "score": 0, "replies": []}]}]}, {"body": "Even a blind squirrel finds the occasional acorn.", "score": 1, "replies": [{"body": "If you followed commodity, container prices, and tanker rates last year, you would know that inflation was bound to drop throughout the year.", "score": 2, "replies": []}]}]}, {"body": "Slow progress, but still progress, expect a rate hike tomorrow, act accordingly.", "score": 0, "replies": []}, {"body": "I’m not buying it!\nGas is back over $5 a gallon in Commiefornia!\nFood prices still on the rise, and insurance rates, well they are at all time highs!", "score": -9, "replies": [{"body": "Well, it's not just a California problem. It's the same in most metro areas. DC area food (both grocery and restaurants) are very expensive. Car prices and housing prices continue to be sky-high.  I doubt we'll ever go back to pre-trillion-dollar-wall-street-bailout price levels. \n\nThanks Trump! God, I hope they throw that bum into jail.", "score": 4, "replies": []}, {"body": "The fact that you actually talk like this means you’re never going to actually understand what’s going on.   You’re like a child", "score": 1, "replies": [{"body": "Yeah, thanks.\nMy day is complete now.", "score": -1, "replies": []}]}]}, {"body": "When will you people just admit that the fall of 2022 was the bottom of this bear market 🤣", "score": 1, "replies": []}, {"body": "No comments about the high base affects from last year?", "score": 1, "replies": []}, {"body": "Stocks to the moon. We are in Bull market !!", "score": 1, "replies": []}, {"body": "My bank account paid me 4% in May", "score": 1, "replies": []}, {"body": "Shit costs more than ever. Hike rates until the fucking economy crashes and everyone is forced to lower everything.", "score": 1, "replies": []}, {"body": "There's people out there that think that raising the minimum wage will fix the problem, If minimum wage was raised to a $1000 per hour, 1Big Mac would cost $750.00", "score": 1, "replies": []}]}
{"title": "JUST IN: US May CPI 4.0% year over year versus 4.1% expected. Core MoM: 0.4% as expected", "selftext": "", "id": "148ehcg", "created_utc": 1686659865.0, "score": 267, "upvote_ratio": 0.94, "num_comments": 117, "comments": [{"body": "Damn.. we going to outer space", "score": 69, "replies": [{"body": "🚀", "score": 8, "replies": []}]}, {"body": "ELI5?", "score": 29, "replies": [{"body": "Bulls bout to make bank", "score": 52, "replies": [{"body": "No way! A recession is coming! Numbers are lying! We are all doomed! lol! :)", "score": 18, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I also forecast a recession. As a matter of fact it is unavoidable, since the market goes in cycles. :)", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Did they actually used the word \"recession\"?", "score": 1, "replies": [{"body": "Do they need to when 2 quarters of negative is one of the definitions of a recession? Amongst others", "score": 0, "replies": [{"body": "Just read my other comment. It all goes as expected, nothing to worry/panic about. You know that a recession is part of the game. You can't have just growth (that reminded of Madoff btw). Also do not confuse the recession with a crisis. A crisis can't be predicted by fed, like a recession can ;)", "score": 2, "replies": [{"body": "Not worried just waiting to pick some discounted stocks", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "> If you recall the financial crisis occurred during a similar environment in which fed hiked rates and it just so happened an unexpected shoe dropped.\n\nAnd what does that mean? That we are going to an uncontrollable crisis like the one in 2008? And if that's the case, what should we do?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">It’s impossible to know\n\nExactly! You wouldn't know beforehand about a crisis like the 2008's one, in a similar way that you wouldn't know beforehand about a gamma ray burst hitting earth and destroying every sign of life. I don't think that such extremely events are reasons to always keep you in a panic/worrying mode. If it happens it happens and there's nothing to do about it.\n\nPS: I'm writting the above having in mind that one would only invest in the stock market money that they can afford to lose. For example in my case whenever I buy a new stock, I always recall Southpark \"and it's gone\" (ie I assume that I don't have the invested money any more).", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I don't think so! It results to a recession, not a crisis. \n\nAnd in any case, let's suppose what  according to what you believe we are heading to a crisis. So what? What will you do now that you know that a crisis is coming?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "OK! So let's suppose that we are heading in a crisis for sure and we already know that. Is that info of any use? Other than panicking? Can you do something about it?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">Yeah save money.\n\nYou should always do that! And not invest in the market money that you can't afford to lose. Like I wrote in a previous comment (I'm quoting myself here)\n\n> PS: I'm writting the above having in mind that one would only invest in the stock market money that they can afford to lose. For example in my case whenever I buy a new stock, I always recall Southpark \"and it's gone\" (ie I assume that I don't have the invested money any more).\n\nSo I'm good I guess. And I believe that I now know why are you are panicking: you probably invested more money that you are willing to lose.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Then all is cool! :)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": ">The economic forecast prepared by the staff for the May FOMC meeting **continued to assume** that the effects of the expected further tightening in bank credit conditions, amid already tight financial conditions, **would** lead to a mild recession starting later this year\n\nOh well! The phrase \"continued to assume\" reminded me of the Random Walk model :)\n\nEdit: in any case, a recession predicted and caused by fed is nothing to worry about. The 2008 crisis (pay attention to the term, it wasn't a recession, it was a crisis) wasn't predicted by fed, and I guess this is true for every crisis (not recession) in the whole US history", "score": 1, "replies": []}, {"body": "How soon after meetings do these minutes get released? I noticed these are May minutes. Very useful minutes indeed", "score": 1, "replies": []}, {"body": "Reddit does not read despite being all text lol", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "my understanding is that prices are still going up at 4% per year, but that’s not as fast as prices have been going up in recent years. This is a “good” sign that inflation is being slowed, albeit probably not being slowed fast enough for most people, but enough for the stock markets to take it as good news and keep climbing.", "score": 19, "replies": [{"body": "The problem is the reaction. Does this mean that it's safe to spend now and drive up inflation some more? A rate hike pause will just test the spending sentiment and concrete current consumer prices as bottom, which allows room for price hikes... if inflation surges on a pause, then we're screwed. In my opinion, we're just compressing the spring instead of breaking it. Wages will never catch up to inflation and these rates are never going down. Time to let the wife's boyfriend move in and start paying some of the bills.", "score": 10, "replies": [{"body": "It's possible that people start spending more as a result of lower CPI numbers, but I think it's fair to say that consumers generally base their purchasing decisions off of their financial reality rather than CPI numbers.\n\nOne aspect of inflation that is hard for anyone comprehend in the moment, including the FED, is whether or not inflation is falling because consumers have reached a breaking point, or because they are incentivized to save. Personally, in our current situation, I lean towards the former. The personal savings rate in April was 4.1% which is well over half of the rate we were seeing prior to the pandemic (roughly 8.5 - 9%), plus we saw a fairly significant drop from the 4.5% reading in March.", "score": 4, "replies": []}]}, {"body": "yes prices are still going up but not at 4% per year. it’s at 4% from last year. also, keep in mind that the numbers are adjusted to fit the “everything is under control” narrative. they took away gas, housing, and anything else that would send the actual CPI number soaring", "score": 2, "replies": [{"body": "> the numbers are adjusted to fit the “everything is under control” narrative. they took away gas, housing, and anything else that would send the actual CPI number soaring\n\n\n1. Core CPI has been around for decades, so I'm not sure what you're talking about with this whole \"narrative\" thing.\n\n\n2. It's reported right next to the headline number, so IDK what you mean by \"actual\" CPI number\n\n\n3. Gas is included in headline CPI and is the main reason it's down from the 9.1% peak. It's not included in Core but housing is. Do you even know what you're criticising here?", "score": 3, "replies": [{"body": "1. inflation is under control narrative \n\n2. they keep changing the things they use to calculate the CPI number. for example, this month they’ll use beef and the next they’ll use ground beef since it’s cheapest\n\n3. i’m criticizing how the CPI calculations are changed. \n\nthere’s no way it’s a 4% increase from last year. my grocery receipts alone are way higher than that", "score": 1, "replies": [{"body": "> they keep changing the things they use to calculate the CPI number. for example, this month they’ll use beef and the next they’ll use ground beef since it’s cheapest\n\n\nCitation needed\n\n\n> i’m criticizing how the CPI calculations are changed.\n\nCitation needed\n\n\n> there’s no way it’s a 4% increase from last year. my grocery receipts alone are way higher than that\n\n\nYou're correct! If you bothered to read the report, \"Food at Home\" (groceries) is up 5.8% over the last 12 months. CPI is made up of many factors, including groceries.", "score": 6, "replies": []}]}]}, {"body": "4% from this time last year. That’s 4% annual rate.\n\nThey way they decide what belongs to cpi hasn’t changedz", "score": 0, "replies": [{"body": "Lol… yeah right.", "score": 0, "replies": []}]}]}]}, {"body": "Last year at this time it was up 8%\nThis year at the same time it’s up 4% \n\nSo year over year it’s up 4%", "score": 12, "replies": []}, {"body": "As another redditor explained it, I'm trying to lose weight. Last year I gained 8 lbs but this year I've only gained 4 lbs. Time to celebrate my accomplishments.", "score": 5, "replies": [{"body": "Except the goal wouldn’t be to lose weight it would be to only put on 2 pounds each year, so you’ve actually made good progress towards your goal! It may not seem like a huge difference but these fundamental misunderstandings of the economy are why bears always get wrecked in the stock market. People will continue to act shocked when things go up despite the economy returning to a steady state.", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "This is one of those things that is essentially meaningless though. Whether or not you personally believe they should lose weight, that is not the goal of the fed/government and it is not something they are even working towards. It will never be the case that the fed tries to lose weight so why even bother mentioning it? The market understands this but people on Reddit will continue to think something that will NEVER happen has any chance of coming to pass.", "score": 1, "replies": []}]}]}, {"body": "This I love", "score": 2, "replies": []}, {"body": "That's perfect, merci !", "score": 0, "replies": []}]}]}, {"body": "Core CPI:\n\nDec 2021 : 5.5%\nJune 2023: 5.3%\n\nParty on Garth! 🤘", "score": 64, "replies": [{"body": "Imagine that’s with mediocre disinflation (falling faster than it rose last year). Imagine when you really start heading toward the deflation that AI can cause in the future.", "score": 6, "replies": [{"body": "Do you think if we removed the monetary base inflation the currency would be deflationary?", "score": 1, "replies": []}]}]}, {"body": "Soooo no rate hike tomorrow then?", "score": 32, "replies": [{"body": "I’m pretty sure a pause is like 95% confirmed at this point", "score": 53, "replies": [{"body": "then .25 in july", "score": 12, "replies": []}, {"body": "Only what they’ve said every single times there’s been a hike", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "“They” have said they have a long way to go. Only dipshits online and financial institutions with vested interests in the people thinking that there won’t be rate hikes continually predict pauses or even cuts, and are wrong again and again. \nThis idea that the market rising means that inflation is defeated or we aren’t in serious fucking trouble is dumb.", "score": 3, "replies": []}]}, {"body": "Not really", "score": 6, "replies": []}]}]}, {"body": "that would be very unlikely", "score": 2, "replies": [{"body": "This will be an interesting one for JPow. If I were in his shoes, I would still hike to try and push stubborn inflation lower and I would jump it more than expected. If he only raises rates slightly it will not have the dramatic effect necessary to get it to 2%. What will happen with a slight raise is that Saudi/OPEC will lower production again to try and keep that stubborn core inflation around. This is a game of chess we are watching play out with moves and counter moves.", "score": 11, "replies": [{"body": "Not me. The FED was aggressive hiking rates and the impact of many of these effects are lagging. I would just wait and see at this point how inflation and unemployment react. Target rates are now slightly higher than inflation, which should naturally chip away at inflation.", "score": 6, "replies": [{"body": "Yeah, possible. I think if there is a pause then those that want to knock the US dollar down a peg will see it as an opportunity to strike.", "score": 1, "replies": []}]}]}, {"body": "Why unlikely?\n\nThe likelihood of a pause is over 90%. What’s your definition of unlikely?", "score": 2, "replies": []}]}, {"body": "It will be a pause this for go around. Unless employment some How gets stronger and NFP continues to beat. \n\nKeeping employment in line is more important politically now than inflation since the peak was last year anyway.\n\nAny jump in claims or uptick in unemployment the fed is going to freak out. Especially ahead of next years election.", "score": 1, "replies": []}]}, {"body": "How anyone looks at Core CPI and think this is bullish... I don't know.", "score": 27, "replies": [{"body": "Lol because it isn’t. But any spec of hope is enough for the bulls to run with it adding more pressure to traders to explain to their boss why they are holding short positions on tech", "score": 5, "replies": [{"body": "What if all stocks just dropped like 20% at once", "score": 2, "replies": [{"body": "What if all stocks soared 20% at once? Both scenarios are highly unlikely. Even during the COVID meltdown that only lasted for about 6 months", "score": 2, "replies": []}]}]}]}, {"body": "R.i.p. bears and doomers", "score": 44, "replies": []}, {"body": "What does this mean? Explain it to me like I’m 5, plz.", "score": 5, "replies": [{"body": "Your buying power is decreasing but the rate that it is decreasing is slowing.", "score": 16, "replies": [{"body": "Thank you, friend! 😀", "score": 3, "replies": []}]}, {"body": "The rate where they are stealing your money is slowing down, they are still stealing your money and will not give it back and never will, expect more stealing in the future.", "score": 0, "replies": []}, {"body": "It means start investing in Bitcoin because your USD loses 5%+ of its buying power each year.", "score": -5, "replies": [{"body": "I don’t think bitcoin is a good investment", "score": 4, "replies": [{"body": "Because you don’t understand it.", "score": -4, "replies": [{"body": "Yeah, me and half the world. We all saw the same huge drop-off in cryptocurrency value the last few years. That’s enough for me to say that’s it’s probably not the best investment. Even gold, typically a safe investment, is seeing volatility.", "score": 1, "replies": [{"body": "Ironic that this dude is complaining about USD losing 5% yeear-on-year, then suggests to invest in bitcoin which is down 60% from all time high 🤦‍♂️", "score": 4, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 35, "replies": [{"body": "Well for a starter, morons don’t understand how CPI is calculated nor understand how percentages work.\n\nThing’s don’t get cheaper unless you enter a deflationary period.\n\nEnergy was a big contributor last and this year in the ride and fall.\n\nCorrelated to food, food is 6.7% YoY vs -12% for energy. Food costs are slowing down month over month but if you take the 3 months as a proxy, we should be around target next year. So apparently, energy didn’t cause food prices to skyrocket\n\nThe problem is in core excluding food and energy, is around 5.3% YoY and was 5.5% last year around the same time, so it is not really slowing down.\n\nIf you combine all items minus Energy, I think YoY should be around 5.8% relative to 6-6.5% last year.\n\nOne of the biggest myths around is that shelter is cooling down because its lagging and yet its coming at 8% YoY vs 5.8% last year. Shelter is below peak last year, but by no mean cooling down or flat\n\nYou can make from the data whatever you want, but inflation not going down, its just sticky relative to last year. Literally core been flat for 3 months around 5%, if you go back to 2019, which is a good proxy, it was ranging between 2.2 and 2, which is the Feds target\n\n\nAlso a random rant, medical services is not on decline. I have no clue how the read is coming on negative for physicians and hospitals or flat to PY.\n\nservices are definitely going as up as commodities (prescriptions).  I would love meet any human being who is paying for medical services this year as much as last year or the same. Also, airlines fares (3)%?  Yeah if you play Spirit", "score": 43, "replies": [{"body": "Rare extremely good post for this sub. \n\n>One of the biggest myths around is that shelter is cooling down because its lagging and yet its coming at 8% YoY vs 5.8% last year. \n\n100%\n\n>The problem is in core excluding food and energy, is around 5.3% YoY and was 5.5% last year around the same time, so it is not really slowing down.\n\nExactly. There's certain analysts who originally said you could only read core since it was stable, and now those same people are championing reductions in headline. Same people switch from YoY to MoM and vice versa when its convenient, or cite a supposed lag in housing disinflation (citing Zillow, not CPI) while never mentioning the lag on the way up. \n\nGreat genuine post man. Rare when everyone tries to argue for the inflation narrative that justifies certain interest rate levels that would benefit their portofolio.", "score": 15, "replies": []}]}, {"body": "I'm not sure what's giving you idea that anyone here is talking about anything getting cheaper.\n\nThey say inflation dropping which is exactly what's happening, given that you understand what that means.", "score": 8, "replies": []}, {"body": "Inflation describes rate of increase though so they arent wrong?", "score": 6, "replies": [{"body": "Rate of the rate", "score": 3, "replies": []}, {"body": "Cause we've lost probably upwards of 20% of our moneys worth? They describe the rate cause it makes them look better lmao.", "score": 1, "replies": []}]}, {"body": "It’s not misleading, you just don’t know the definitions of words.\n\nOur goal is 2% inflation, not deflation. Deflation is worse than low levels of inflation.", "score": 15, "replies": []}, {"body": "Nobody asked for deflation.\n\nRegards.", "score": 5, "replies": []}, {"body": "Bears spotted, it's hunting season baby!", "score": 3, "replies": []}, {"body": "Inflation IS down.\n\n**Inflation is a rate of increase.**\n\nIf I have a balloon and I blow into it quickly, it *inflates* at a certain rate. If I blow into it slower, it *inflates* at a slower rate.  The balloon always gets bigger, but its inflation rate has decreased.\n\nWhat you're describing is *deflation*, or the shrinking of the balloon's size.  Letting air out.\n\nNo, we are not seeing deflation. Nor is anybody claiming that we are. And frankly, you shouldn't want to see it.", "score": 2, "replies": []}, {"body": "It's also incredibly dishonest how they present the data in baskets.  Makes no sense to me why they separate food and energy, which are arguably the most important commodity to the middle class.", "score": 0, "replies": []}, {"body": "this is *chefs kiss*", "score": -1, "replies": []}]}, {"body": "I'm .04% away from being back in the green. It feels unreal.", "score": 3, "replies": []}, {"body": "They couldn't tell the truth even if their life depended on it.", "score": 16, "replies": [{"body": "Hyperinflation call not working out as you thought?", "score": 10, "replies": [{"body": "According to the FED, from 2020 to now, prices have gone up 15%. Does that sound right to you? Cause it sure as hell doesn’t to me.", "score": 6, "replies": [{"body": "Inflation is regarded... As an example if inflation goes up 50% in one year and the next year its at 2% everything is then great?", "score": 3, "replies": []}, {"body": ">According to the FED, from 2020 to now, prices have gone up 15%. Does that sound right to you? \n\nActually, it sounds about right considering you're establishing your basis smack dab in the middle of a global pandemic where people couldn't leave their homes and GDP had just dropped 5% YoY.", "score": 4, "replies": [{"body": "Really? Gas has gone up atleast 50%, food has double if not tripled, rent is up atleast 50%, car prices doubled, need I go on? Some things have come down after going up but there is absolutely no way inflation is 15% over the last 3 years.", "score": 1, "replies": [{"body": "Other than maybe gasoline (which you actually under-represented), your component numbers are out of line with reality and really over exaggerated.  The increase in the non-energy components you mention from their 2020 low-point to today is more like 24%. Nowhere near \"doubled\" or \"tripled\".\n\nAlso, that 15% you're citing is the core (non-food+energy) number. The headline index has increased about 18-19% since its 2020 low-point.", "score": 4, "replies": [{"body": "Yeah the difference is your looking at data, I’m looking at reality.\n\nYou’re telling me your groceries haven’t doubled in price? What a joke. Open your eyes.", "score": 2, "replies": [{"body": ">You’re telling me your groceries haven’t doubled in price?\n\nNo. They haven't. Not even close. I'm not sure why you insist on telling me that they have.  I can't even identify one food item that I consume regularly that has doubled in price, much less the entire basket of food I buy.", "score": 3, "replies": [{"body": "Bottled water and eggs were found to have doubled over the last year, but obviously the avian flu played a huge part in this.  Butter is up around 27% and bread 15%.  Chicken breast up almost 20%- but again bird flu.", "score": 0, "replies": [{"body": ">Bottled water\n\n??? I just checked my own receipts. I paid $9.48 for an 18L case of Member's Mark Alkaline Water at Sam's in 2021.  Today, that same case costs me $1.00 more. For regular Ice Mountain water, I paid $4.98 a 40 pack case in Sept., 2021.  Today, I pay $6.54. (I live in Chicago, FWIW.). \n\n\nAs for eggs, isolated, temporary spikes due to cause-specific shortages happen in even the lowest inflationary periods.", "score": 3, "replies": []}, {"body": "I bought eggs for $1.99/18ct yesterday.  They were $6 a year ago.", "score": 1, "replies": []}]}, {"body": "True, a basket of groceries as a whole is probably closer to 50% while other items have doubled in price - specifically fruit, dairy, meat, nuts, chips, lettuce and other vegetables.", "score": 0, "replies": []}]}]}, {"body": "Real estate and the cost of rent is up at least 25-50% since the pandemic, depending on the area.", "score": 1, "replies": [{"body": "I can't speak to individual markets, but national median rent in April 2023 ($1,967) is up about 24% from its 2020 low-point ($1,585):\n\nhttps://www.rent.com/research/average-rent-price-report/", "score": 1, "replies": [{"body": "So life’s biggest expense went up 25% across the board, yet somehow inflation is 15%. The next biggest expense, food, is up way more than 15% too.", "score": 0, "replies": [{"body": "First of all, why are you citing the core inflation rate, which doesn't include food, and then talking about food in the next sentence?  Headline CPI, which includes food, is up 18-19%. \n\nAlso, do you know that you can [review the weights](https://www.bls.gov/cpi/tables/relative-importance/home.htm#RIData) for the CPI calculations?\n\nThe BLS weights [shelter as 34% of the total CPI basket](https://www.bls.gov/cpi/tables/relative-importance/2022.xlsx).\n\nSo 34% of the headline CPI basket has increased 24% since 2020. That doesn't seem at all out of whack for a top-line number of 18-19%.", "score": 2, "replies": []}]}]}]}]}, {"body": "https://fred.stlouisfed.org/series/GASREGCOVW\n\nLooks like gas is down about 25% since a year ago.", "score": 1, "replies": [{"body": "I’m talking since 2020 pre pandemic", "score": 1, "replies": []}]}]}]}]}]}, {"body": "in theory wouldn't that be considered market manipulation and criminal?", "score": 2, "replies": []}, {"body": "This isn't about truth it's about vast sums of obscene wealth.", "score": 4, "replies": []}]}, {"body": "Houston,  permission granted to land ! 🚀", "score": 4, "replies": []}, {"body": "If only CPI actually meant anything.", "score": 7, "replies": []}, {"body": "desert carpenter slimy unused spark north like poor subsequent insurance\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 3, "replies": []}, {"body": "Brrrrrrrr....", "score": 2, "replies": []}, {"body": "Too bad wages don't go up.", "score": 2, "replies": []}, {"body": "so... inflation still up, got it.", "score": 2, "replies": []}, {"body": "Didn’t they change how CPI is now recorded? \nCrayon eater asking.", "score": 0, "replies": []}, {"body": "[removed]", "score": -10, "replies": []}, {"body": "Big if true", "score": 1, "replies": []}, {"body": "Explain it like I’m 5? What does this mean?", "score": 1, "replies": [{"body": "It's year over year. The number is how much more expensive everything is exactly 1 year ago. \n\n2 years ago the number was (I'm making this up idk 100%) 4.5%. Which means 2 years ago to last year everything went up 4.5%. From last year to now its 4%. Meaning everything is only 4% more expensive. \n\nIt means inflation is \"slowing\" down.", "score": 4, "replies": [{"body": "Thanks. :)", "score": 1, "replies": []}]}]}, {"body": "Is this good for the T-bills that are coming and a pause until July, when will T-bills affect the Market?", "score": 1, "replies": []}, {"body": "Hold on tight, we might need a rocket to come back down!", "score": 1, "replies": []}, {"body": "I think 4% of people feel inflation is actually at 4%", "score": 1, "replies": []}, {"body": "Its 4% higher than the 8% it was last year. Put the rockets away", "score": 1, "replies": []}]}
{"title": "What’s your take on this S&P 500 graph. Recession coming? Imminent? Not at all?", "selftext": "", "id": "148mp91", "created_utc": 1686682441.0, "score": 643, "upvote_ratio": 0.91, "num_comments": 290, "comments": [{"body": "S&P 7", "score": 252, "replies": [{"body": "The Standard 7 and the Poor 493", "score": 172, "replies": [{"body": "I have not laughed so hard in my life lmao 🤣", "score": 3, "replies": []}, {"body": "The 7 with Poor Standards.", "score": 1, "replies": []}]}, {"body": "What's really crazy, and a lot of people don't realize, is that ETF's that follow the index like SPY and VOO use liquidity as part of their weighting system, meaning stocks with larger floats make up a disproportionately large allocation. This allows issuers and AP's to sell larger volumes which is critical since fees are so low on these compared to mutual funds.\n\nThis is interesting for a few reason: if a mega cap does a large buyback or insiders buy a lot of stock for example, the ETF issuers will actually have to reduce the allocation - which is arguably bad for ETF holders. It's even more apparent in the case of insider selling which forces the ETF to *increase* allocation. If insiders have a valid reason for the sell-off the last thing you want is to be the one buying their bags.\n\nBut more importantly, it increases the weighting of the *already-huge*, largest cap tickers. Basically, these ETFs are more concentrated in a few stocks than most people realize and yet, they are touted as being highly diverse and safe. It's scary to me how similar it is to housing - everyone seems to believe it's guaranteed to go up over time, and literally everyone has their money in these things. Seriously go ask any friend what their retirement fund is held in and it's going to be mostly SPY, VOO, or a target date fund that holds similar concentrations of the huge, top stocks (MSFT, AAPL, NVDA, GOOG, TSLA, AMZN, etc).\n\nThat's not diversity.", "score": 33, "replies": [{"body": "I wouldn’t say that’s exactly true. The top 10 companies have a holding of 30%. An example if you look at holdings\n[etf sp](https://www.justetf.com/en/etf-profile.html?isin=IE00B5BMR087)", "score": 10, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Will it? When every other company has had no growth?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "So your hoping currently unsuccessful companies will replace “successful” companies because they will be “worth more” when the fed themselves see a recession?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yur retarded", "score": 1, "replies": []}]}]}]}]}]}, {"body": "That is some mighty fine perspective.", "score": 0, "replies": []}, {"body": "I see the point you are making and I don't have the knowledge to dispute the facts, but it seems like your statement of \"Basically, these ETFs are more concentrated in a few stocks than most people realize and yet, they are touted as being highly diverse and safe.\" implies that they don't track the actual index they are supposed to.  VOO/VTI track the s&p500 almost precisely.  Are you saying the index itself isn't diversified?", "score": 1, "replies": [{"body": "I'm saying two things; the indices themselves aren't as diversified as advertised, and additionally that indices (and the ETF's that track them) aren't as different from *each other* as you'd expect in many cases. For example, if you look into ETF's that track \"growth\" stocks, or \"tech\" stocks, you will often find huge overlap between their top allocations and the broader indices. And target funds are often full of the same few equities as well.\n\nBasically you might think your retirement portfolio is diversified by having it in a combination of ETF's or target funds, but the reality is that nearly every investor in the world is extremely long the same ~10-30 companies. Some of the big ones being AAPL, MSFT, BRK, NVDA, TSLA, META, GOOG, XOM, JNJ, UNH, WMT, LLY, JPM...\n\nIf everyone is passively investing in these exact same stocks are they really diversified? Are they as hedged as they think against market risk? Personally I don't think so.", "score": 2, "replies": [{"body": "How do you define \"diversified\"? BRK and MSFT alone own something like 300 companies themselves between the two of them.", "score": 2, "replies": []}]}]}, {"body": "I bet you can't ELI5", "score": 1, "replies": []}, {"body": "Those index ETFs are still better choice over individual high performing stock that a average joe cannot pick unless they are incredibly lucky. Yes the index is biased towards mega cap but over a long term of 30 years, these low cost ETF are the best bet against market risks. There are some funds that have consistently outperformed the index but not everyone is Peter lynch.", "score": 1, "replies": [{"body": "What makes you so sure? Past performance does not guarantee future returns.\n\nPlus, ETF's have only been popular for the last ~15  -20 years, so how can you possibly know how they will do over a 30-year horizon? The fact that everyone uses them now has changed market dynamics (the tail wags the dog, now) - which is something that I don't think gets enough attention.", "score": 1, "replies": [{"body": "SPY has been around for 30 years now, it’s performance is on books surviving dot com crash, housing bubble and COVID crash. S&P500 has been around for much longer. And no there is no way anyone can guarantee future returns but given the data that’s the best bet for someone who doesn’t understand balance sheets, EPS, P/E, IRR, intrinsic value etc. \n\nCase in point - British ruled the world in 1700 and 1800s with GBP being reserve currency . No one back then knew they would be bombed to rubble by Germany in 2 world wars in 1900s and that US would emerge as world superpower with USD as reserve currency in 20th and 21st century.", "score": 1, "replies": []}]}]}, {"body": "RSP is an equal weighted S&P ETF that was up 1.15% today, SPY was up 1.24%. The rally is broadening.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 39, "replies": [{"body": "Yeah, nope. Definitely not entire s&p history.", "score": 24, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "There was a pretty great graphic over time I think from /r/dataisbeautiful but...", "score": 1, "replies": []}]}, {"body": "The one on the Bloomberg goes back pre WW2 into the 20s..\nPretty sure there was no SPX before WWII.", "score": 1, "replies": []}]}, {"body": "Well just find an equal weight S&P 500 index graph and compare it to a market cap weighted one. There are periods where the equal weight index outperforms.", "score": 2, "replies": []}, {"body": "Exactly. When all stocks are moving together, that’s just money going up and down in value.", "score": -7, "replies": []}]}, {"body": "Hahaha true", "score": 2, "replies": []}, {"body": "Super league - 7", "score": 1, "replies": []}, {"body": "Lols", "score": 1, "replies": []}]}, {"body": "Big tech dropped a lot in 2022 so no suprise they raise a lot now when recovering", "score": 227, "replies": [{"body": "A 2 year graph would tell a much better story. It has been a real test the last two years. Very few people had a strategy that shined both years", "score": 98, "replies": [{"body": "When in doubt; zoom out.", "score": 46, "replies": []}, {"body": "My tech/crypto heavy portfolio shrunk 18% last year (though I had some insane luck with Reddit NFTs which covered this) and I'm up 39.1% this year, no options or leverage obv.\n\nPretty sure I need to start a YouTube channel since this will obviously repeat forever and there is no way I got lucky", "score": 25, "replies": [{"body": "Now you just need some liar clickbait thumbnails and supreme overconfidence.  You're on your way to being the next big thing!", "score": 8, "replies": [{"body": "Hedgies hate this guy! Like and subscribe to learn his 3 simple tricks to grow your finances by 3873% by the end of the year!", "score": 10, "replies": [{"body": "They hate him because he keeps drunk dialing their front office trying to ask if they got his CV yet.(he sent 500 since 1998).", "score": 3, "replies": []}]}, {"body": "Sign up to my course where I copy paste then selectively remove somebody elses paper trades before anybody else gets them!", "score": 2, "replies": [{"body": "Do You NeEd SiGnAlS??", "score": 1, "replies": []}]}]}]}, {"body": "I wouldn't say it's common but there are people that are very heavy in pharmaceuticals and would be up in both years. I think that's about it, though.", "score": 3, "replies": []}, {"body": "A 100 year logarithmic graph is the only story worth paying attention to", "score": 1, "replies": []}]}, {"body": "well if you look further back, they only dropped so much because they grew so much because of low interest rates. depends how you look at it", "score": 13, "replies": [{"body": "Bingo.\n\nCheap debt makes big tech go brr.", "score": 7, "replies": [{"body": "Last 6 months with high interest rates tech also goes brr apparently", "score": 1, "replies": []}]}, {"body": "They drop until the plunge protection team is deployed.", "score": 1, "replies": []}]}, {"body": "All of them are playing with AI financial tools and I don’t trust the markets one bit", "score": 9, "replies": [{"body": "All bubbles burst. 👍🤘🎲", "score": 2, "replies": [{"body": "Just maybe not in our lifetime", "score": 1, "replies": []}]}]}, {"body": "Meta dropped from around 380 a share to *90*", "score": 1, "replies": []}]}, {"body": "More likely shows how huge the top tech companies are, they are absolutely entrenched in everything we do and this will most probably increase in the future imo", "score": 94, "replies": [{"body": "Until we have one. Skynet", "score": 38, "replies": [{"body": "Actually Skynet is the name of the software, the company is cyberdyne systems.", "score": 23, "replies": [{"body": "Ticker?", "score": 10, "replies": [{"body": "DEATH.AI", "score": 14, "replies": [{"body": "Ah yeah I have that in my ESG funds", "score": 4, "replies": []}]}, {"body": "PLTR", "score": 5, "replies": []}]}]}, {"body": "Guess what china is calling it's AI system?", "score": 1, "replies": []}, {"body": "Guess what china is calling it's AI system?", "score": 1, "replies": []}]}, {"body": "The matrix is calling you!", "score": 7, "replies": []}, {"body": "yea, these are good companies, weather you think they are over valued or not. they arent going anywhere", "score": 0, "replies": [{"body": "Turnover at the top of the index is pretty fast. If you invested in the S&P's top 10 companies a decade ago, you'd have started losing to SPY in less than a year.", "score": 5, "replies": []}, {"body": "You can overpay for a good thing.", "score": 3, "replies": [{"body": "ye a but i'll always remember when ppl said tesla was over priced at 400 and then it went to 800 in a couple of months, and eventually hit 1k. hovered around 800 for a year\n\nactually after the stock split, that seems to be the price is now.", "score": 1, "replies": []}]}, {"body": "Just their earnings and profits are down %50-80 that’s all lol", "score": 1, "replies": []}, {"body": "Sorry but .. *whether*", "score": 1, "replies": []}]}]}, {"body": "The world is becoming more tech dependent, so I wouldn’t be betting against tech giants.", "score": 93, "replies": [{"body": "[deleted]", "score": 27, "replies": [{"body": "Tech is holding the sp500, not the economy. They  pay small taxes comparing to the rest.", "score": 29, "replies": []}]}, {"body": "Said the man investing in .com companies in 2000", "score": 4, "replies": [{"body": ">Said the man investing in .com companies in 2000\n\nIf you want to bet against tech giants, be my guest.", "score": 6, "replies": []}, {"body": "Yea Apple and Microsoft are Pets.com", "score": 2, "replies": []}]}, {"body": "Kind of like when steam engines were the rage and people were betting against gas powered engines.", "score": -5, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "During that time period steam engines were huge. Simply comparing time periods and importance of the time period.", "score": -1, "replies": [{"body": "A better comparison would be like saying trains were huge then, they still are today. Or engines were and are popular. \n\nApples iPhone may not be popular in 20 years, but there’s a good chance “Apple” will be. \n\nYour comparison is more of like saying bows and arrows aren’t around anymore so weapons manufacturers must not be good businesses.", "score": 8, "replies": []}]}]}, {"body": "Not really like that at all tbh", "score": 7, "replies": []}]}, {"body": "Expectations are all that matter. Tech is always the future, almost by definition. \n\nStock Performance comes from changes in expectations and expectations of expectations. At some point expectations will peak and at that point  tech will revert. When are expectations too high?\n\nIt won’t matter if nvdia is the most successful company in the world if expectations became something like “they’ll be the ONLY successful company someday!” Like happens to Tesla at peaks.", "score": 1, "replies": []}, {"body": "But not all tech is the same, some will survive and some will die", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 44, "replies": [{"body": "What % or you portfolio is \"hard into TQQQ\"?", "score": 7, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "As I learned the hard way", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Bought at $75, still in 😂", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah luckily I didn’t go heavy into it, and it seems like we’re back in a bull market. Fingers crossed", "score": 1, "replies": []}]}, {"body": "Ooofff", "score": 1, "replies": []}]}]}]}, {"body": "With that winning strategy you should've bought calls on margin of TQQQ", "score": 6, "replies": []}, {"body": "its scary how a 10% drop will lead to a 30% drop in tqqq", "score": 8, "replies": []}]}]}, {"body": "New to all these. Just curious, why this particular etf instead of other growth stock?", "score": 2, "replies": [{"body": "It a leveraged tech ETF. So you get all the winners in one basket + leverage = a lot of percents up.", "score": 10, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "What does it mean 3x levereged?", "score": 0, "replies": [{"body": "Leverage means they borrow money to invest for you. It increases volatility. The most common is a 25% leverage, which means if you invest 100$ they borrow 25$ and invest 125$ in your name. Stock rise, decline and dividends are 25% more. There are also fees to pay for borrowing or course (these will be included in the management fee for that ETF). \n\n3x leverage is extreme. Tech is already very volatile. So it's not for the fain of heart. When it goes down, it will go down 3x times more as well.", "score": 9, "replies": [{"body": "*crypto 200x leverage taking notes*", "score": 6, "replies": []}, {"body": "Interesting, thank you", "score": 2, "replies": []}]}, {"body": "If nasdaq goes down 10% this in general will go down by about 30%", "score": 2, "replies": []}]}]}, {"body": "TQQQ is up almost 100% in 3 months. Great during a bull run, can break you in a bear run", "score": 2, "replies": []}]}, {"body": "Fuc* you and congrats.", "score": 1, "replies": []}, {"body": "Same here", "score": 0, "replies": []}]}, {"body": "It’s like everyone really WANTS a recession.", "score": 11, "replies": [{"body": "It would be nice if asset prices fell, given that 75% middle income Americans can't buy a house", "score": 12, "replies": []}]}, {"body": "You’ll get a rotation into value: crude won’t stay below 70 forever either. Keep in mind if the fed pauses or inflation continues to fall the dollar is going to fall in value. Stocks are priced in dollars obviously but that’s going to be a backdrop for a continued rally. But this time investors have options: you can get a 3-4% CD at a bank this time or even bonds with decent yields. \n\nThere’s trillions sitting on the sidelines in money markets looking for appreciation better than single digit returns they are getting.\n\nIf you’re a fund manager you won’t get fired for a bear market, but you will get fired for missing a bull market", "score": 9, "replies": [{"body": "This stock market price action with low volatility is showing stabile upside not inflated by 0% interest rates and an easy fed", "score": 2, "replies": [{"body": "The stock market is being propped up by options flow and dumb money.", "score": 1, "replies": []}]}, {"body": "This isn’t true, as inflation drops the time value of money increases? No? However during anytime of inflation (including healthy inflation) moneys value will depreciate but not in the way that you are describing. Or am I missing something?", "score": 1, "replies": [{"body": "Well regardless if you stretch the time frame from the federal reserve act you can see the pricing power or value of the dollar sink. Really it’s due to innovation and technology. The fed is there actually produce inflation ironically enough. \n\nFor example: if AI starts taking menial clerical tasks that’s less labor costs and lower overhead which causes theoretically for prices to fall. \n\nThe fed is there as a counterbalance using monetary policy to prevent deflation - our economy is 80% consumer consumption. If jobs are loss due to innovation (AI example) or autonomous 18 wheelers that means less workers working over even pay cuts. Which brings down demand. What we had recently was more supply side inflation mixed with a printing frenzy. (Too many dollars chasing too few goods)\n\n\nTLDR: look at a chart between the SPX since the beginning of the federal reserve act in the 1900’s and the value of the dollar. It’s inversely correlated. The more the dollar falls in value the higher assets priced in dollars goes.", "score": 2, "replies": [{"body": "Ohhhh damn I appreciate it. I think I understand now, so they can’t allow deflation to occur so now that they are lowering interest rates they can’t allow for the decrease in jobs caused by innovation such a technology to cause for the dollar to gain value so they will always be work to keep it down? Lol I’m currently in a honors finance program and I swear I learn more from conversations. What’s the problem with deflation though, with all these proped up prices I would have thought a period of deflation would be good", "score": 2, "replies": [{"body": "Deflation can cause economic stress to the system. Economics itself can’t be at extremes it works on a balance. An economy too hot always leads to inflation economic depressions causes deflation. It’s cycles over time. I think what you are looking for is disinflation where high inflation is coming down. CPI was +0.2% so we have inflation it’s just lower. PPI is in deflation territory since that came in negative. Cheers", "score": 1, "replies": []}]}]}]}]}, {"body": "Too big to fail goes tech lol", "score": 19, "replies": []}, {"body": "I don’t get why no one fucking understands half these stocks dropped like 50% before this.", "score": 18, "replies": []}, {"body": "14 years of QE after GFC allowed zombie companies to exist via easy access to capital. with rising interest rates, the existence of these companies are under threat, while cash rich companies like the tech giants are well insulated and are hence seen as \"safe\". this along with the AI theme helps explain why big tech is leading so much.\n\nThat being said, we saw the market get hammered by tons of bad news a couple of months ago. everyone was on the bear wagon. those short positions are being obliterated right now, which helps explain this recent melt up in the market, and a drastic shift in sentiment.\n\nBut fundamentally, has anything changed? not at all. people constantly make the fallacy of correlating the market with the economy. \\*spoiler, they. are. not. the. same.\\* druckenmiller figured out the housing bubble in 2004. market hit peak short interest in mid 2007. those shorts got squeezed out after the market continued to rally. sentiment shifted as the market topped, and the shit hit the fan in late 2008. is the recession coming? as sure as there'll be another rainy day. when will it be is anyone's guess. and if anything, if Ray Dalio is right,  people are likely underestimating the severity of the next big one.\n\nI'm a nobody and I know next to nothing, but those are my thoughts", "score": 30, "replies": [{"body": "Ray Dalio say the next crash/recession Will be the biggest one yet?", "score": 4, "replies": [{"body": "https://www.youtube.com/watch?v=xguam0TKMw8", "score": 4, "replies": [{"body": "Holy shit that was phenomenal.  I am late for work and a fan of his now.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "1. what makes you think I'm a perma bear?\n\n2.  you might want to look at that chart on a log axis [https://i.stack.imgur.com/9I9dv.png](https://i.stack.imgur.com/9I9dv.png)  \n\n\n3. try doing that with the nikkei, hang seng, or stoxx and tell me why US exceptionalism should last forever.", "score": 2, "replies": []}]}]}, {"body": "Is there an ETF we can buy that mimics the S&P without those 7 companies in it?", "score": 5, "replies": [{"body": "Best bet would be an equal weight s&p ETF", "score": 11, "replies": [{"body": "Which one is it?", "score": 1, "replies": [{"body": "RSP is an example, I’m sure there are others to select from also!", "score": 1, "replies": []}]}]}]}, {"body": "We’re ONLY like 70+% overvalued based on historical averages. No chance it ever comes back down 😂", "score": 8, "replies": []}, {"body": "When will Investors figure out that 5 stocks generating the vast majority of returns is not a good thing for the markets?", "score": 14, "replies": [{"body": "\"Buy in May and go away\" still a trend?", "score": 3, "replies": []}]}, {"body": "Not at all", "score": 10, "replies": []}, {"body": "okay so if i have no stocks, what should i buy be fr you guys", "score": 5, "replies": [{"body": "If you have little money and little experience with stocks just dump it into etfs until you learn more and have more money to work with. VOO, VTI, VOX (crushing lately) are my 3 preferred at the moment. QQQ if you want to ride more of the nasdaq waves but it will be more volatile. Many many ETFs to get into as you want to diversify more. VOO and VTI are diverse enough u can have only those and you’ll be okay (still wouldn’t recommend that tho). Whatever you choose just stick with the strategy and let it ride.", "score": 6, "replies": []}, {"body": "Equal weight (instead of market cap weighted) sp500, mid cap, and small cap, and Europe.", "score": 3, "replies": []}, {"body": "BRK.B", "score": 3, "replies": []}, {"body": "Buy broad low cost ETFs, that way you're diversified right away and can't really go wrong. Maybe don't dump all your money all at once, DCA into it. Put you cash in a high interest saving account ETFs, and slowly add to your positions. You don't need a lot of ETFs, but I recommend a major position into the US market (like S&P500 or total market) and some secondary position in international (Dev. Countries Ex. US).\n\nVery important, what are your goals? How long do you have? Will you need the cash soon? Because that style of investing is Growth and it's for the long term. Learn to know about yourself, how do you react when your investment go down, when you have to sell,... Maybe dividend investing would be more suited for you depending on your personality and needs.", "score": 2, "replies": []}, {"body": "my favorite “ETF” is BRK.B", "score": 4, "replies": [{"body": "Factss", "score": 1, "replies": []}]}]}, {"body": "This chart has little to do with the odds of a recession.  The stock market is not the US economy.   In most cases, one pages the other by months.", "score": 4, "replies": []}, {"body": "Don't chase these hard because of FOMO.  Nibble the dips if you have to.", "score": 3, "replies": [{"body": "Ive been DCAing into these for a couple years and even now im buying at ATH, it doesnt matter.  Two stock splits from now, Im thinking longer term, will it matter if the 10 stocks you now have of said company were bought for ATH a decade ago?  Not in my mind.", "score": 1, "replies": []}]}, {"body": "🔥🔥 🐶🐶 🔥🔥 this is fine", "score": 4, "replies": []}, {"body": "It’s coming for sure", "score": 8, "replies": []}, {"body": "Just putting it out there but TSLA is at 119%, GME is at 45% - I hold FAANG, TSLA, GME, and picked up SOXS today just in case Jimmy P. decides to nuke the markets tomorrow", "score": 3, "replies": []}, {"body": "My thoughts are I wish I bought Tesla at 100 and I didn’t think cause mining eth was done that nvidua would take a decline and stay\n\nOh and last time I put a buy order for Tesla I did 145 and it got to 153 :(", "score": 5, "replies": [{"body": "Tesla believer just buy dips and hold until 2035.", "score": 5, "replies": [{"body": "Not wrong, I have other stocks I have as well, can’t buy all them! I may enter at a later date, I went heavy into Amazon around the same time so that’s doing okay", "score": 3, "replies": [{"body": "Amazon and Tesla are both good holds.\n\nI believe TSLA will reap more profits but then again idk your cost average and I'm bad at MAFF.", "score": 2, "replies": []}]}, {"body": "What's happening in 2035?", "score": 2, "replies": [{"body": "EM retires", "score": 1, "replies": [{"body": "from what, shit posting?", "score": 2, "replies": []}, {"body": "What’s EM?", "score": 1, "replies": [{"body": "Daddy Musk.", "score": 1, "replies": []}]}]}, {"body": "Sex robots.", "score": 1, "replies": []}]}]}]}, {"body": "Why does it start in dec 2022 making it an 18 month graph?\n\nThere is a classic how to lie with statistics fallacy that may be at play here.  If you can select arbitrary start points you can select the slope of perceived gains. \n\nIt occurred to me because meta is in there and i bought the dip on meta.\n\nMeta had this huge covid income surge that swelled it's price followed by a \"let's spend billions on vr that nobody wants\" (dip) followed by a \"thats dumb let's not do that\" which resulted in gains. The percentage gain to now can be manipulated a lot by just moving a month or two.  \n\nWhen your list is down to 5 stocks, and one of them is already noted to have that issue, how you selected your start point matters allot to interpretation.\n\nWas it selected to maximize the percieved gains of those 5 stocks? If so that is a bias not predictive of future performance.", "score": 3, "replies": []}, {"body": "House of cards", "score": 6, "replies": []}, {"body": "Economic recession has been here. Economic depression coming next. Those blue chip stocks price are being overpriced by Wall Street to dump on retail.", "score": 4, "replies": []}, {"body": "How would one predict a recession from this graph?", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "From Apple? Cook isn't even a fan as of yet.", "score": 1, "replies": []}]}, {"body": "If you think you can tell anything from this graph other than what it literally says, you are delusional.", "score": 2, "replies": []}, {"body": "Stonks only go up", "score": 2, "replies": []}, {"body": "If there isn’t a 25% cliff ahead soon, we may have seen a mirage and not the end of the canyons edge…\n\nI am treading carefully for a couple weeks.  July is just around the bend.  Never try to catch a \n\nfalling sword 🗡️", "score": 2, "replies": []}, {"body": "What's my take? My take is this -- don't use red and green to distinguish two things that you expect the viewer to compare, even if the viewer is red/green color blind. Or, were you trying to exclude me from being able to distinguish between those two time series?", "score": 2, "replies": []}, {"body": "It doesn’t really matter if the recession is coming or not. For sure on the long run, like in 10/20/30 years, the S&P is going to be higher than now", "score": 2, "replies": []}, {"body": "I'm 100% confident the market will experience a recession in the future. \n\nYou never specified how far out I need to make that prediction", "score": 2, "replies": []}, {"body": "Idk maybe some of those big tech companies shouod be broken up. Just a thought. Maybe that would help the other 493", "score": 2, "replies": []}, {"body": "Interesting graph and I think it is even more impressive to consider the more than 100% YTD performance of NVDA, META, and TSLA — the first one due to generative AI tailwinds and the other two as bounce backs. If equally weighted the big tech performance will be even greater than the performance of the S&P 500. \n\nI think investors see big tech as all-weather stocks with enough cash for a recession and as the leading drivers of growth in our country. Some of the valuations are quite high like NVDA and AMZN, which could very well mean that the rest of the market is significant undervalued.", "score": 2, "replies": []}, {"body": "It's always a few who move the market.  \n\nBut honest to God I don't understand what is holding Facebook up. The others make stuff,  even if it's just data.  But what does META do now.  Does anybody actually use FB any more? \n\nIt started off for kids.  Then adults , then old people . Now I don't know anyone who uses it. And if people don't use it they don't generate data to sell.", "score": 5, "replies": [{"body": "Instagram? Also everyone outside the US uses WhatsApp to communicate, except New Zealand who use FB Messenger for some reason. \n\nThey may not be able to see the content of those messages but they know who you talk to, when you do it, and if you aren’t using privacy mode in your browser, track just about everything a lot of people do on the internet (if you don’t use Safari or privacy mode in Chrome, go take a look at your off-Facebook activity section on FB).\n\nThis is all useful for selling adverts which is where they make their money.", "score": 5, "replies": [{"body": "Oh  yeah. And Insta is owned by...? Yep The Zuck.\n\nI remember when people said he was crazy for buying it at $2b.", "score": 1, "replies": []}]}, {"body": "Facebook makes ads, same as Google.", "score": 6, "replies": [{"body": "Ads for companies that are languishing?", "score": 2, "replies": []}, {"body": "You're right.  But everybody uses Goog . Nobody uses FB that I know of.  And I haven't checked their user metrics in years.  But it just seems like it's time has passed. And the joke of a 3d trial just made it seem like a failed company.", "score": -2, "replies": [{"body": "FB had $116B in revenue last year, so clearly someone is using it.", "score": 7, "replies": [{"body": "It's India.  As India comes online, Facebook I believe is their premier social media site.  They have 175% of the US's total active users, and I'm sure they are far more active than Americans.", "score": 1, "replies": []}]}, {"body": "What things \"seem like\" doesn't matter at all. What things are is what matters. Facebook doing fine", "score": 2, "replies": []}, {"body": "That you know of? There's more life outside of US... India, Indonesia, Brazil, Mexico, Philippines, Vietnam, Thailand, Bangladesh, Egypt provide much larger user base than just US. People need to stop living in US bubble.", "score": 1, "replies": []}]}]}, {"body": "I cannot understate how Meta is the king of advertising. Social media marketing is the biggest it’s ever been, and Meta is in the middle. This advertising niche has more power than anyone else, including Google and tiktok.", "score": 0, "replies": []}]}, {"body": "It’s a rollover recession similar to that after war world II. A lot of people won’t even notice it really happened.", "score": 4, "replies": [{"body": "What's a rollover recession?", "score": 2, "replies": [{"body": "Small recession that you barely notice?", "score": 2, "replies": []}]}]}, {"body": "Tech boom", "score": 1, "replies": []}, {"body": "Same as it ever was \n\nMost stocks underperform, few carry the market and they all go bankrupt eventually", "score": 1, "replies": []}, {"body": "Sign of the times and late stage capitalism", "score": 1, "replies": []}, {"body": "No wonder 20% of the companies produce 80% of the results. Where have I seen that before?", "score": 0, "replies": [{"body": "7/500 does not equal 20% lol", "score": 7, "replies": [{"body": "Eh close enough, my school didn't teach me enough math to figure this out.", "score": 1, "replies": []}]}]}, {"body": "It's the same every decade probably. Some big companies have exponential growth while others just grow normally. It's just diversification.", "score": 0, "replies": []}, {"body": "Récession and crash coming", "score": 0, "replies": []}, {"body": "prob not at all because none of those guys are going anywhere.", "score": 0, "replies": []}, {"body": "incoming tech crash is all I see.", "score": -1, "replies": [{"body": "Wasn't that last year.", "score": 2, "replies": []}]}, {"body": "Any similar scenarios in history?", "score": 1, "replies": [{"body": "Uh... 1999. Or were you too young?", "score": 3, "replies": [{"body": "Too stupid (uninformed) would be more precise", "score": 1, "replies": []}]}]}, {"body": "Two letters \nA\nI", "score": 1, "replies": []}, {"body": "You cannot determine whether a recession is coming or not based on an index chart. Nor can you determine future S&P500 behaviour based on a chart showing the history of the index's value.", "score": 1, "replies": []}, {"body": "Out of touch with reality.", "score": 1, "replies": []}, {"body": "I’m thinking puts this week.", "score": 1, "replies": []}, {"body": "The recession is coming… any year now, any year", "score": 1, "replies": []}, {"body": "About 70% of Reddit is bullish.", "score": 1, "replies": []}, {"body": "Looking at macro structure it has to come down at least to around 400 sooner rather than later", "score": 1, "replies": []}, {"body": "Imagine thinking this chart will tell you if there's an impending recession", "score": 1, "replies": []}, {"body": "Maybe", "score": 1, "replies": []}, {"body": "People are rushing to safety.. not much to see here", "score": 1, "replies": []}, {"body": "\n1. All those big tech names went down just as much last year. Few are at ATHs.\n\n2. Forward P/E has dropped which is good for value.  Now imagine if all those other companies stop consolidating sideways, which direction do you think they’d most likely go?", "score": 1, "replies": []}, {"body": "They are all making money….. earnings have been good for all of them and they are able to operate at lower costs after they just dropped the bottom 10% performers out of their orgs. I’m bullish at this point, it seems we survived high inflation and can live at 4.5% or whatever it really is now. There was SO much money circulating before the rate hikes, its back in play and a lot of people got very wealthy from the pandemic. The rest of America that is struggling… low impact, the top is running to the endzone with the football now", "score": 1, "replies": []}, {"body": "Equal weight sp500 ETF up 4.5% year-to-date, and coming out of a several month base, suggestive of some incoming sector rotation imo. 56% of s&p 500 companies are currently trading above their 200-day moving average. Nothing abnormal there to me.\n\nI think big tech has just been the easy play as markets position for a soft landing, and position themselves for AI. Consolidation becoming more likely.\n\nI personally think big tech is the trade of the next decade, so I expect to see a lot of charts like this.\n\nAt the very least, I don't really see how you get from \"some companies are doing great while others are doing a little bit worse than average\" to \"imminent crash\".\n\nAlso s&p 500 is up closer to 15% year-to-date not 11%. Not sure where you got this chart?", "score": 1, "replies": []}, {"body": "Recessions Happen twice per decade, so regardless of this graph, I predict we'll have a recession this decade.", "score": 1, "replies": []}, {"body": "I loaded up on equal weight sp500 etfs yesterday for this reason", "score": 1, "replies": []}, {"body": "Rich people need things to pump too", "score": 1, "replies": []}, {"body": "  Unsustainable, bear market rally to suck is as much as possible. \n  Institutional money can’t unload their positions without a sucker on the opposite side.", "score": 1, "replies": []}, {"body": "Normal. Tech stocks have been punished for too long. This is exactly supposed to happen at this time.", "score": 1, "replies": []}, {"body": "I set stops this morning before the market opened, I’m long tech but I’ve gotten some crazy gains the last 8 months. where’s the volume??", "score": 1, "replies": []}, {"body": "FATMANG is the way.\n\nOh wait, it’s MATMANG now. \n\nOr ATM.MANG", "score": 1, "replies": []}, {"body": "Ken griffin programming takes the most from each Americian. That's why VIX & S&p500 run together or drop together every few months. The balance of poor people options gets uneven so Citadel will put them on same algorithm and run them together for the day.", "score": 1, "replies": []}, {"body": "The rest will catch up to big tech. Always happens.", "score": 1, "replies": []}, {"body": "And the bubble is forming beautifully.", "score": 1, "replies": []}, {"body": "AI? ai aia ai ai aiiai", "score": 1, "replies": []}, {"body": " META.   I sold my atem today !   #fuckZuck #noMetaatem", "score": 1, "replies": []}, {"body": "A lot of tech company revenue comes from targeted advertising though, right? How is that revenue stream so strong when the S&P500 companies that actually make products are not performing well and consumer spending is overall down? \n\nHow can tech be so strong if material goods retailers are not doing well?", "score": 1, "replies": [{"body": "Most of my ads are for services", "score": 1, "replies": []}]}, {"body": "That's the point of a broad based index like the S&P, it captures all segments.  If tech drops, energy rises.  If energy falls, maybe financials takes it place.  If a company does so poorly that its a burden to the index then it gets dropped.", "score": 1, "replies": []}, {"body": "It’s coming. It’s always coming. It’s non-sensical to say it will never happen. It’s a matter of when, not if.", "score": 1, "replies": []}, {"body": "Rule 1 \n#\n**STOCK IS NOT PART OF THE ECONOMY**", "score": 1, "replies": []}, {"body": "[Heavy Truck Sales and Recessions](https://fred.stlouisfed.org/graph/fredgraph.png?g=1684q)", "score": 1, "replies": []}, {"body": "They are pumping the big 7 for collateral needs! The phone is gonna start ringing soon!", "score": 1, "replies": []}, {"body": "Stock pickers environment", "score": 1, "replies": []}, {"body": "I have spent days analyzing current market data and historical trends and I can conclude with 100% certainty that it will either go up, down or stay the same. If you want to see my breakdown on this, then you need to buy my master class", "score": 1, "replies": [{"body": "“Either go up or down or stay same”??? Where’s the climax???", "score": 1, "replies": []}]}, {"body": "Hahaha nothing has changed but all tech companies earning and profits are down %50-80 and there’s the highest interest rates in over 25 years with no end in sight. But 7 companies are holding the whole market up. smh. Something is going to give soon. It’s .com bubble and 2020 all over again.", "score": 1, "replies": []}, {"body": "Big tech has rallied solely on chatgpt", "score": 1, "replies": []}, {"body": "Too late to get into NVIDIA?", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "harmful bot, report it", "score": 1, "replies": []}]}, {"body": "Probably not uncommon to have years where a few companies drive the value. That’s why the S&P is king", "score": 1, "replies": []}, {"body": "What is the reason for steep increase in tech company stocks? All of them laid off many workers and at least a couple of them are not doing well like meta and intel. Even though there is lot of talk about AI , none of the companies produced any new ground breaking products or services. So what gives?", "score": 1, "replies": [{"body": "AI isn't groundbreaking, it just increases efficiency where ever it's applied. Also, AI doesn't mean anything in particular. Machine Learning does though. And it cannot, by definition, itself be ground breaking.", "score": 1, "replies": [{"body": "Yep. So what is the reason that tech stocks are up? None of those companies have any groundbreaking product or service. In fact they all talk about AI only because it is the current buzz word.", "score": 1, "replies": [{"body": "Increasing efficiency is a big deal. It's just not ground breaking in the sense that it's not the smartphone for example.", "score": 1, "replies": []}]}]}]}, {"body": "Where is the value plays?", "score": 1, "replies": []}, {"body": "Being in the S&P500 isn’t as prestigious for these 7 companies. What would really kill it would be for them to form their own index fund, the elite 7 or something, E7. Leave the S&P behind and form their own thing. Exclusivity. 7 companies propping up 493 is annoying to those 7.", "score": 1, "replies": []}, {"body": "Well, SCHD is what S&P could likely look like if it did not have all those tech stocks", "score": 1, "replies": []}, {"body": "Based on the triangular float reaching a critical upside down cup point, I’d say it’s not a recession we should fear coming but your mom!", "score": 1, "replies": []}, {"body": "Yes, there will be a recession in the future", "score": 1, "replies": []}, {"body": "This graph is not working ... Can you chack it and make it correct", "score": 1, "replies": []}, {"body": "That's BS.  You must be one of those brokerage manipulators.  Been paid to spread BS to what you call investors \"Muppets\" ya perhaps the lost sheep but there's a TON of GREAT STOCKS that are Home Runs and even GRAND SLAMS.\nHere's a short list of stocks doing better than 11%.\n\nSMCI +137%\nRCL +202%\nCCL\nSNOW\nLLY\nAMD\nCOST\nCVNA\nXOM +18%\nSHOP +94%\nSPOT\nPLTR +78%\nSMH\nEDIT\nTTD", "score": 1, "replies": [{"body": "I think you’re confused.", "score": 1, "replies": []}]}, {"body": "Uphill from here for a year or more", "score": 1, "replies": []}, {"body": "The fact that everyone is talking about it…\n\nI think we can postpone the recession until everyone is doing the opposite.", "score": 1, "replies": []}, {"body": "Remindme! 7 months", "score": 1, "replies": [{"body": "I will be messaging you in 7 months on [**2024-01-14 03:32:32 UTC**](http://www.wolframalpha.com/input/?i=2024-01-14%2003:32:32%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/StockMarket/comments/148mp91/whats_your_take_on_this_sp_500_graph_recession/jo2c8ka/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2F148mp91%2Fwhats_your_take_on_this_sp_500_graph_recession%2Fjo2c8ka%2F%5D%0A%0ARemindMe%21%202024-01-14%2003%3A32%3A32%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20148mp91)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Recessions will always happen. Recessions are necessary, and often positive in long term economics. What is unpredictable is the severity.\n\nTo anyone who is afraid of a looming recession, I would take every step you can to cut your expenses/debt and be prepared for a radical economic environment.", "score": 1, "replies": []}, {"body": "Generally, a thin market like this is a sign of weak markets overall and not a good sign. Not great here", "score": 1, "replies": []}, {"body": "The rally is broadening to other companies outside of the magnificent 7, particularly cyclical stocks. That's a pretty strong bull signal", "score": 1, "replies": []}, {"body": "No recession coming yet. The NASDAQ AND S&P might slow down but the DOW is just heating up. Home builders/construction stocks are doing well, in addition to financial stocks", "score": 1, "replies": []}, {"body": "World is changing", "score": 1, "replies": []}, {"body": "So how can the sp500 return the same before big tech?", "score": 1, "replies": []}, {"body": "Wow. That’s crazy", "score": 1, "replies": []}, {"body": "Recession imminent. Morgan Stanely is also still bearish. I'd have to look at the others but when the big players all say the same things, it's a certainty. \n\nWith that said. A recession doesn't have to mean a market crash. Could be a slow way down only lose 10-15% then back again in a year when rates get cut.", "score": 1, "replies": []}, {"body": "Oil needs to go up  , in good market.  Should be sa $95", "score": 1, "replies": []}, {"body": "I actually think this presents a bull case as the other 493 catch up.", "score": 1, "replies": []}, {"body": "It’s a graph. It doesn’t tell the future. Stop deluding yourself.", "score": 1, "replies": []}, {"body": "MANAGMT", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "harmful bot, report it", "score": 1, "replies": []}]}, {"body": "Let's see how much kids musk will hire if the stock price of tesla drops in the same niveau as GM or other car manufactorers.\n\nWaiting for the next marketing stunt from him to keep the stock up.", "score": 1, "replies": []}, {"body": "I’ll hold onto my apple stonks", "score": 1, "replies": []}, {"body": "Imminent!", "score": 1, "replies": []}, {"body": "Dang, should have invested earlier", "score": 1, "replies": []}, {"body": "Damn... Looking like the wealth gap post Reagan...  You know wealth distribution is fucked when the Fortune 500's are looking like they're the middle class...", "score": 1, "replies": []}, {"body": "Lpw chance of recession.", "score": 1, "replies": []}, {"body": "the tech giants are dominating lately - wouldn't bet against them tbh", "score": 1, "replies": []}, {"body": "The thing I don’t like about this is that while most of the big companies have run up it doesn’t really show an accurate picture. This is implying that ALL 493 stocks have done nothing other than the big 7. But look under the hood more, Eli Lilly has run a bunch which means some companies have gone down a bunch. There are several of the 493 that are up 20%, there are plenty of companies that are down 20%+. So it’s just not a great way to look at it in my view. If the chart showed all financial sector together I bet that would show regional banks -50% or however much it would be for their collective shit performance", "score": 1, "replies": []}, {"body": "Politicians: But look at all that volatility! We can’t allow people to buy such a terrible asset!\n\nAlso politicians: Goes and buys supposedly terrible asset.", "score": 1, "replies": []}, {"body": "I'd say a melt up for the laggards is more in order than anything else.", "score": 1, "replies": []}, {"body": "Recession is coming(here),but not where the SPX is concerned ..never that.", "score": 1, "replies": []}, {"body": "The book I'm reading says the market works in cycles and tech stock gaining is the start of a new cycle.....coming out of a recession", "score": 1, "replies": []}, {"body": "The entire market is propped up on derivatives.. in the past few months s&p has been pumped from like 3800 to almost 4400 now almost entirely on 0 dte pumps as there have been consistent outflows in equities.  They are selling you the dream of a bull market along with their bags.", "score": 1, "replies": []}, {"body": "Market is rigg controlled by rich", "score": 1, "replies": []}, {"body": "Nope. No recession. We didn't get a depression in 2021-22 either.  Thanks Joe", "score": 1, "replies": []}, {"body": "The others will catch up soon", "score": 1, "replies": []}, {"body": "Supreme 7. Pathetic 493", "score": 1, "replies": []}, {"body": "S&P 500 at this point has just become the NATO of the stock market....a handful of them stocks contribute all the money and the other stocks just take from the pot", "score": 1, "replies": []}, {"body": "Until i know what the hell is going on, i'll stick only to US ai companies, rest of the stocks i buy and sell are using pounds and pence", "score": 1, "replies": []}, {"body": "Definitely recession. Or maybe not.", "score": 1, "replies": []}, {"body": "I see big gains shorting the 7 once this fake bull rally is over.", "score": 1, "replies": []}, {"body": "Its always like this.\n\nA few companies drive everything while the rest are just burning money. This is nothing new.", "score": 1, "replies": []}, {"body": "So my portfolio is assigned with th top line and a few others that have been doing well.  \n\nAs far  as recession - if anything it will be mild.  The chart does not they’ll the story because that story has been around for a while.\n\nSomeone mentioned the Standard 7 - they get a lot of attention and investors flock to them which helps raise their value regardless of their PE Ratio - not that that really matters with those companies - what matters is hype!\n\nCan we say TQQQ?", "score": 1, "replies": []}, {"body": "I buy the Canadian banks and BK.to and a few others. Div snowball thing...", "score": 1, "replies": []}, {"body": "My take on this is I have the biggest fucking grin on my face after going balls deep in tech at the start of the year. \n\nGoing forward tech will be the main driver of GDP gains through increased operational efficiency, and I think we're seeing people allocate investments accordingly. Prices are likely to get ahead of themselves in the short term, but I still think tech is king long term.", "score": 1, "replies": []}, {"body": "Graphs like this should have the y axis be log scale.", "score": 1, "replies": []}, {"body": "Recession is not coming anytime soon. Strong jobs and more importantly wages have increased for ALL people given them more money to support themselves. As a small business owner, there has never been a time when employees are making more money.", "score": 1, "replies": []}, {"body": "Long term graphs are better comparisons.", "score": 1, "replies": []}]}
{"title": "SPY has been in a bull market for 83% of the last 70 years", "selftext": "", "id": "148em2i", "created_utc": 1686660298.0, "score": 1384, "upvote_ratio": 0.96, "num_comments": 158, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|86|**Previous Best DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "It’ll always be in bull market until i buy calls..", "score": 448, "replies": [{"body": "Keep this man away from calls!", "score": 137, "replies": [{"body": "Keep my calls name out of your fucking mouth", "score": 45, "replies": [{"body": "Darden puts it is", "score": 4, "replies": []}, {"body": "Balls?", "score": 1, "replies": []}]}, {"body": "Call this man away from the keep!", "score": 6, "replies": []}]}, {"body": "Sir, can I interest you in a side of selling puts?", "score": 8, "replies": []}, {"body": "Hello good sir, could you pls buy some Tesla calls? Trying to buy cheap but the market doesn't care that Elon tweets stupid shit anymore.", "score": 10, "replies": []}, {"body": "![img](emote|t5_2th52|4640)", "score": 3, "replies": []}, {"body": "I can help you buy some calls so it will drop faster.", "score": 2, "replies": []}]}, {"body": "So the guy saying run spy calls a month out but sell at 20 days or 50% profit wasn't as dumb as we all thought?", "score": 175, "replies": [{"body": "No he’s a genius. But so is anybody else who develops brain dead strategies based on “buy the dip” and “stonks go up”", "score": 99, "replies": [{"body": "Confirm. I'm literally rich now ever since I started buying low selling high. Can't believe I didn't think about it before.", "score": 97, "replies": [{"body": "Damn my dyslexia, i though it was buy high, sell low.", "score": 25, "replies": [{"body": "You guys sell? I just wait and my broker just makes them dissapear for me so I don't have to sell my own options like some disgusting poor.", "score": 17, "replies": [{"body": "I just like when my cpa says congrats on the tax write off.", "score": 3, "replies": []}]}, {"body": "And here I was thinking it was “buy blow to get high”", "score": 2, "replies": [{"body": "No no. You’re right. That rule has always worked for me.", "score": 1, "replies": []}]}]}]}, {"body": "It’s so stupid it might just make you rich/bankrupt/cokefiend", "score": 2, "replies": []}]}, {"body": "But why sell if it just keeps going up?", "score": 5, "replies": [{"body": "I wouldn't pretend to know the whole strategy but I'd geuss its about profit taking, reinvesting and theta. I could be 100% wrong though lol", "score": 7, "replies": []}, {"body": "It only goes up 83% of the time", "score": 1, "replies": []}, {"body": "That remaining 17% is what makes you bankrupt", "score": 1, "replies": []}]}, {"body": "I just did it for 145% profit in about a week. Will that last forever? Absolutely not. Be careful, but this is a solid opportunity", "score": 3, "replies": []}, {"body": "Buying ATM options is regarded. Especially expiring that soon. You get to pay the absolute maximum extrinsic value.", "score": 1, "replies": []}]}, {"body": "That's a really interesting graphic, TonyLiberty. It's clear that bull markets have been getting longer and longer over the past few decades, while bear markets have become shorter and less frequent. This is likely due to the increasing stability of the global economy, as well as the advance of technology which has made it easier for investors to make money in rising markets and protect their capital in falling ones.", "score": 428, "replies": [{"body": "[deleted]", "score": 222, "replies": [{"body": "VM is the most reasonable actor in here", "score": 17, "replies": [{"body": "Most is a really strange way to spell only", "score": 5, "replies": []}, {"body": "*moist", "score": 2, "replies": []}]}]}, {"body": "Probably also with tech is more, less experienced investors mixed things up like the robin hood incident. No way that could have happened in the early 90's before online trading was the norm. \n\nNo way I could semi day trade back then either.", "score": 29, "replies": []}, {"body": "And lower interest rates.", "score": 38, "replies": [{"body": "wierd to see you getting downvoted. also the introduction of QE has been used to artifically prolong bull markets. These are all coming at the cost of taxpayers and dollar holders.", "score": 38, "replies": [{"body": "It’s also why the wealth gap has been ever growing.", "score": 8, "replies": [{"body": "Facts. Cuz of artificial low rates", "score": 0, "replies": [{"body": "Artificial....Artificial....Artificial intelligence! Lets get buying!", "score": 3, "replies": []}]}]}]}, {"body": "Didn’t the lower interest rate regime start after the dot com bust? The longest bull market looks to be starting in 87", "score": 6, "replies": [{"body": "Lower is a relative term. Interest rates were highest in the early 80s and after that on a downward trend.", "score": 10, "replies": []}, {"body": "Nope, real interest rates been falling for 50 years now... issue is we're now going into a increasing rate regime... RIP equities in the mid to long term, praise to Cash interest accounts", "score": 1, "replies": []}]}]}, {"body": ">advance of technology\n\nmoney printer goes brrr", "score": 9, "replies": [{"body": "Brr deez nutz 🌰🌰", "score": 1, "replies": []}]}, {"body": "Or money printer go brrrrr. Bull markets got longer after monetary policy changed following inflation in the 70s 80s", "score": 8, "replies": []}, {"body": "its because systems have been put in place with blessings or revolving door treasury secretary office to apply duck tape to fix any faults in financial system", "score": 5, "replies": []}, {"body": "Any chart that doesn't take methods of \"investing\" into account are garage and meaningless. Also as meaningless as bots making stupid comments.   \n\nHow many of these years involved hundreds of thousands of zero dte pumps? That's right...", "score": 2, "replies": []}, {"body": "Was 1996 the dotcom bubble? It was that bad compared to 2006?", "score": 1, "replies": []}, {"body": "They lasted longer because they perfected manipulating the market and selling bad loans.", "score": 1, "replies": []}, {"body": "How the fuck does it make such an insightful comment???", "score": 1, "replies": []}]}, {"body": "don't fight the Fed", "score": 28, "replies": [{"body": "Market has fought the fed and won for months now.", "score": 14, "replies": [{"body": "They won't win in the end... the Fed can stay regarded longer than the market can remain solvent", "score": 6, "replies": []}]}]}, {"body": "Bears like those odds", "score": 43, "replies": []}, {"body": "I love how you de-emphasize the actual scale of the downturns in favor of amplifying the scale of the positive. Wonderfully misleading graph, good job.", "score": 29, "replies": [{"body": "\"help my calls are underwater\"", "score": 9, "replies": []}]}, {"body": "And this sub is full of regards trying to short it", "score": 13, "replies": [{"body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 9, "replies": []}]}, {"body": "Bull market is just getting started", "score": 16, "replies": []}, {"body": "And bears have claimed the market to be overvalued for 100% of the last 70 years", "score": 33, "replies": []}, {"body": "Beats had one big win in 1929 but since then Bulls have been in control.", "score": 14, "replies": [{"body": "That is from before I was born (2014) so it doesn’t matter buy calls", "score": 15, "replies": []}, {"body": "I mean.. I've been getting beat by my mother for years", "score": 3, "replies": []}]}, {"body": "The 401k ponzi", "score": 5, "replies": []}, {"body": "You forget to adjust for inflation... Always adjust for inflation 😞", "score": 6, "replies": []}, {"body": "JP can continue with interest hikes\n\nJPMorgan can pay fines happily\n\nRecession can continue\n\nInflation can continue\n\nMarket will be going up", "score": 10, "replies": [{"body": "Bubbles, bubbles everywhere!", "score": 2, "replies": []}]}, {"body": "I just saw another chart that said In 2001 s&p rose 20% from bottom and that bull market lasted 3 months\n\nIcba to verify coz honestly all of this is so meaningless but whatever helps u sleep at night", "score": 9, "replies": [{"body": "If you look at the movement of this index after 1996 (helpful date choices...) you can see volatility around the peak in 2000. There are drops and rallies both at the end of the \"bull market\" period and at the start of the \"bear market\" one.\n\nThis very simplistic dichotomy doesn't help guide good investment decisions, but hey, that's not what we are here for.", "score": 5, "replies": []}]}, {"body": "Mainly because of a very low federal funds rate. Now the bull rlly is happening with a high federal funds rate. Nothing makes sense.", "score": 8, "replies": [{"body": "I think the market is experiencing FOMO at the moment. Everything is overbought, even SPY lol", "score": 8, "replies": []}]}, {"body": "70 years is an odd time frame. Why not go 100 years and show the roaring 20s?", "score": 36, "replies": [{"body": "Claiming that starting a graph about the S&P500 at the inception date of S&P500 is \"odd\" is peak regard.", "score": 56, "replies": [{"body": "Cherry picking! Let's see the s&p from 10,000,000 BC", "score": 35, "replies": []}, {"body": "lol I think people may have forgotten that the stock market existed before s&p", "score": 2, "replies": []}]}, {"body": "That's like including the wild west in crime stats and comparing to today. Back then the market had drastically fewer rules and much less transparency.", "score": 41, "replies": []}, {"body": "I don’t think it makes much sense to compare to times when the market and monetary system were fundamentally different.  Gold standard caused many a deflationary spiral and bear market, that no longer exists.", "score": 14, "replies": [{"body": "> Gold standard\n\nYet they included the 50s....", "score": 3, "replies": []}]}, {"body": "Maybe we are *in* the roaring 20s.....", "score": 16, "replies": [{"body": "The 20s have been anything but roaring so far……", "score": 9, "replies": [{"body": "So was the start on the 20th century's", "score": 1, "replies": []}]}, {"body": "Depressing thought but there’s a lot of similarities", "score": 5, "replies": [{"body": "No, depression comes next decade.", "score": 11, "replies": []}]}]}, {"body": "How many of the 500 companies are older then 70 years?", "score": 2, "replies": []}, {"body": "Not everything will fit a person's narrative.  Got to be selective.", "score": -1, "replies": []}]}, {"body": "The scale is misleading. +100% and -50% ends up at where you started, but on this chart they look different.\n\nIt would be to use a log scale instead of percentages: 0 for no gains/losses, log(2) for 100% gains, log(3) for 200% gains, log(1/2) for 50% loss, log (1/4) for 75% loss, etc. With this scale a loss and a gain that cancel out would have equal size on the chart.", "score": 5, "replies": []}, {"body": "Spy is designed to go up.", "score": 3, "replies": [{"body": "Maybe I'm silly here, but if you compare it to inflation it isnt too crazy. This is the whole design of SP500 to be stable and follow the market, no? And if the whole idea that the market goes up in the long term ofc SP500 index trackers will follow that trend.\n\nOr am I some regarded andy here?", "score": 1, "replies": []}]}, {"body": "The bull market from the 1986 crash lasted 12 years until the crash of 1996.\n\nW8 wot?", "score": 3, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "my dude it's been up for almost 100 years. even the regard who bought at the top in 1929 would be massively up today or even 20 years later. unless nuclear war happens, stonks only go up", "score": 8, "replies": [{"body": "Calls on Lockheed?", "score": 2, "replies": []}]}, {"body": "This is why you should never look at charts and just buy everything", "score": 2, "replies": []}]}, {"body": "It would be nice to see it adjusted for real inflation", "score": 2, "replies": []}, {"body": "Make the chart logarithmic. Extra fun if you divide it by M2", "score": 2, "replies": []}, {"body": "Add recession bars maybe", "score": 4, "replies": [{"body": "Those are the white bars", "score": 6, "replies": []}]}, {"body": "1986 to 1999 really makes sense as a lot of generation X and earlier made money from this.\n\nInteresting chart. Do you have something similar with Berkshire?", "score": 1, "replies": [{"body": "you know that you can just look at the chart of berkshire and hold it over this right?\n\ni mean he basically just cut out a few parts and put them lower.", "score": -1, "replies": [{"body": "Look. I do have two screens, but one is exclusively for pornography.", "score": 2, "replies": [{"body": "you cant put two windows on one screen? sigh", "score": 1, "replies": []}]}]}]}, {"body": "Yeah baby. Groovy. The regard who shagged me is back from being frozen in the 60's.", "score": 0, "replies": []}, {"body": "63% of statistics are made up on the spot.", "score": 0, "replies": []}, {"body": "mfw you don't use a sliding window", "score": 0, "replies": []}, {"body": "maybe if we all buy calls then the market will have no choice but to explode", "score": 1, "replies": []}, {"body": "i think with todays circumstances, this will be a major twist in the history's chart patterns.", "score": 1, "replies": []}, {"body": "Yup you think that would make me feel better…", "score": 1, "replies": []}, {"body": "Bull market rise for the past 70 years but the bear market lose every years. It's means that the marketing strategy of the bull markets is more effective rather than the bear market.", "score": 1, "replies": []}, {"body": "I belive its due to more people being.acually able to invest .. 50 years ago it wasn't normal now its becoming normal", "score": 1, "replies": []}, {"body": "So we already decided that this year is ending as a win for the bulls? 🤔 . We still have another 6 months, the market can easily go down and continue the bear market trend of last year", "score": 1, "replies": []}, {"body": "I remember in 2009, 2011 and 2012, the market crashed so hard, but people did not buy anything at so freaking low prices. They feared to lose again and stick to that so long.\n\nThe change from bear to Bull market Right now reminds me of the feeling from back then. Really funny how people get crushed while holding puts or not had bought near all time low.\n\nThats like standing in front of a train and arguing. Look at NVDA, blablabla overvalued blablabla. The market is the truth and if there is a Hype, dont be the tryhard partypooper. \n\nYou can not stand", "score": 1, "replies": []}, {"body": "But 1920 guy says we fuq", "score": 1, "replies": []}, {"body": "This is why I’ll never understand when bears mockingly say “this time it will be different”. \n\nNobody thinks it will be different, idiot. The market will dip a bit and then rally for another 5-10 years.", "score": 1, "replies": []}, {"body": "Fuck...look at 86-96", "score": 1, "replies": []}, {"body": "You can always cheat in statistics if you choose arbitrary data. From March 2023 until March 1st 2020, the stock market was a bull market for 17 years, with only a short downturn in 2007-2009. \n\nTwo very big corrections were in 1973 and 1974. If you leave those out you can say the stock market was a very good investment from 1975 until March 2020. \n\nOr if you leave out 1929, the picture of stocks looks a lot better than if you include 1929 and 1860 to 1909. And so on.\n\nIf you take the time from 1860 until 2023 and you cut the time in non-overlapping 30-year time windows, you get a more objective picture. But even then you sample size is small.", "score": 1, "replies": []}, {"body": "Notice 2016 I wonder why there was no bear market? Hmmmmmmmm", "score": 1, "replies": []}, {"body": "Weve been in a bull market for 2 days…….", "score": 1, "replies": []}, {"body": "Well of course it goes up. The money press never stopped since they drop the gold standard.", "score": 1, "replies": []}, {"body": "All that borrowing of money... it's beautiful until we can't pay the debt off.\n\nOnce we get there, we might be back in the 100's on SPY.", "score": 1, "replies": []}, {"body": "Gee what a coincidence. I wonder what happened 70 years ago and whether such global hegemony ever ends/is cyclical, I hope not!", "score": 1, "replies": []}, {"body": "It is well known that you have to wait longer to get rich on the long side.", "score": 1, "replies": []}, {"body": "Stonks always go up", "score": 1, "replies": []}, {"body": "Tell me you are hurting because your portfolio is down without telling me.", "score": 1, "replies": []}, {"body": "Lesson is buy calls?", "score": 1, "replies": []}, {"body": "Hey the waves are getting smaller... thats good right....right?!", "score": 1, "replies": []}, {"body": "So even a moron can win big with SPY, given enough time.", "score": 1, "replies": []}, {"body": "Yeah stonks go up we know", "score": 1, "replies": []}, {"body": "It conveniently starts in 1956.   \nDo it better, from 1900.", "score": 1, "replies": []}, {"body": "Bears, this picture means you’re regarded", "score": 1, "replies": []}, {"body": "I don’t think the bears understand how to read", "score": 1, "replies": []}, {"body": "3", "score": 1, "replies": []}, {"body": "3", "score": 1, "replies": []}, {"body": "party is just getting started. ![img](emote|t5_2th52|4276)", "score": 1, "replies": []}, {"body": "Ah yes, I recall the one that lasted 12", "score": 1, "replies": []}, {"body": "Now plot the realized volatility vs the VIX. Selling long dated /ES strangles with a light VIX hedge for black swans literally never goes tits up managed correctly.", "score": 1, "replies": []}, {"body": "Adjust for inflation", "score": 1, "replies": []}, {"body": "Bears are shaking reading this", "score": 1, "replies": []}, {"body": "I raise you a graph…\n\nhttps://preview.redd.it/d24cc4ekev5b1.jpeg?width=1179&format=pjpg&auto=webp&s=13d7d32b4b0eed0b8b1f14a9b14dc720cd0d49ac", "score": 1, "replies": [{"body": "And another…\n\nhttps://preview.redd.it/dofd1akmev5b1.jpeg?width=1179&format=pjpg&auto=webp&s=946d7af6571fbf1db2107b9f5e1e309def916498", "score": 1, "replies": [{"body": "So what’s the take home message here?", "score": 1, "replies": []}]}]}, {"body": "Soooo, just buy and hold", "score": 1, "replies": []}, {"body": "I don’t think it will continue at that rate", "score": 1, "replies": []}, {"body": "News flash crayon eaters, the market always goes up.", "score": 1, "replies": []}, {"body": "These are the kind of charts I like to see.", "score": 1, "replies": []}, {"body": "That remaining 17% is where you will be bankrupted. Well, most of the people here anyway", "score": 1, "replies": []}, {"body": "Because of how it is calculated.\n\nIt's not a good measurement for anything, though.\n\nIt's simply used to mislead people.", "score": 1, "replies": []}, {"body": "what they say about past performance doesn’t predicate future performance?", "score": 1, "replies": []}, {"body": "We are primed for a massive collapse. The market is way over bought and over valued", "score": 1, "replies": []}]}
{"title": "CPI 🌈🐻", "selftext": "", "id": "148fjzs", "created_utc": 1686663081.0, "score": 909, "upvote_ratio": 0.95, "num_comments": 122, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|1 year ago\n**Total Comments**|3823|**Previous Best DD**|\n**Account Age**|7 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": [{"body": "Because of the CPI, bears lost a lot of money and opportunity to be awake from the nightmare of bankruptcy they need to do something about it but they lost that opportunity.", "score": 1, "replies": []}]}, {"body": "I don’t know why this meme freaks me out.", "score": 67, "replies": [{"body": "it’s their eyes \n\noh yeah they’re also naked", "score": 34, "replies": [{"body": "Wait. You guys aren't naked?", "score": 9, "replies": []}, {"body": "So are the puts ![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}]}, {"body": "Core is still over 5.3 %", "score": 119, "replies": [{"body": "This is what I seriously don't get.  Core CPI is 5.3%.  MoM is .4 annualized to 4.8%.  It makes no sense that Jpow would pause, skip, whatever here.  Another .25% is what's needed.  And no, I don't have puts and won't be getting any because this market is delusional and nothing matters anymore except inertia.", "score": 145, "replies": [{"body": "He never said he would pause in June.", "score": 38, "replies": [{"body": "The market clearly missed that memo.", "score": 53, "replies": [{"body": "The market does this every time he talks, finds a way to interpret his words overly bullish.\n\n\"We hope we can stop raising rates by Q4\" is heard \"We'll be cutting rates by year's end\", etc.\n\nThat said, buy calls baby 😎", "score": 22, "replies": [{"body": "Not necessarily. There has been plenty of times where indices have fallen in anticipation of rising interest rates ahead of fed meetings in the last year.", "score": 0, "replies": []}, {"body": "Yup , bought some at 3:00 pm\nWith my last money ...SMH", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": []}, {"body": "His second in command did.", "score": 4, "replies": [{"body": "I said this elsewhere but Jefferson never mentioned when a pause might happen and his speech came right after Bullard said they were gonna do two more hikes then a pause. I'm balls deep in regional puts though so I have bias", "score": 1, "replies": [{"body": "Bullard isn't voting this year. Kashkari who's the most hawish voting member this year said he's open to a pause at June meeting.", "score": 2, "replies": []}]}]}]}, {"body": "They’re likely pausing because the Treasury is issuing a bunch of new bonds and they’d like to do that at a lower yield.", "score": 10, "replies": [{"body": "They already issued the bonds right??? That’s why they did it before a raise?", "score": 2, "replies": []}, {"body": "Bingo!", "score": 1, "replies": []}]}, {"body": "The focus on core CPI frankly hasn't made sense to me in the current context. Why would we want to use an indicator that strips out energy costs when we know those energy costs filter out to all the other costs over the next few months? It's also heavily weighted towards housing costs, which tend to lag. Seems like bear confirmation bias.", "score": 3, "replies": [{"body": "Maybe because CPI was up 10% last year when the Fed had rates at 2% (June 2022). \n\nAnd so CPI could be at 2% in June 2023 with rates at 10%.\n\nCumulative inflation should matter. Average Inflation Targeting is the Fed mandate.", "score": 1, "replies": []}]}, {"body": "The estimate for June CPI is 3%. I don’t see a hike tomorrow", "score": 5, "replies": []}, {"body": "If he does pause it could be because he sees structural issues and that wouldn’t be particularly bullish either.\n\nFrankly I think he should hike here, inflation isn’t improving .", "score": 1, "replies": [{"body": "Not improving?  Wasn't there just like 10 consecutive months of disinflation?", "score": 2, "replies": []}]}, {"body": "At this point, even if he hikes it won’t matter. Earnings have not dropped off a cliff like many predicted, and unemployment is still low. The economy is chugging along. Who gives a shit if he hikes a couple more times.", "score": 1, "replies": []}, {"body": "Core CPI is high because shelter is high. Shelter is on a 12-18 month lag which the fed has acknowledged.\n\nThis btw is why the fed kept saying transitory in late 2021. The shelter component is so huge and due to lag it kept CPI low even tho real time rents were skyrocketing.", "score": 0, "replies": [{"body": "So we didn't hike in 2021 when real-time shelter was up 20% but now we also don't hike in 2023 because real-time shelter is only up 5%? \n\nUsing Zillow data", "score": 1, "replies": [{"body": "Fed wasn't using real time Zillow data in 2021, they were using lagging CPI data, hence the mistake.\n\nThey learned from said mistake(or so they say).", "score": 1, "replies": [{"body": "Lol so they use the data which supports their bias now while ignoring it in the past. \n\nThey're just like us!", "score": 1, "replies": [{"body": "The current fed bias is towards hawkish, a lot of economists have been calling them to pause earlier due to the housing lag in CPI.", "score": 1, "replies": [{"body": "A lot of economists are also telling them to hike more. \n\nI'm of the camp that when you let inflation go way too high for 2 straight years because you claimed it was transitory, you error on the side of caution and hike more.", "score": 1, "replies": [{"body": ">A lot of economists are also telling them to hike more. \n\nWho?\n\n>I'm of the camp that when you let inflation go way too high for 2 straight years because you claimed it was transitory, you error on the side of caution and hike more.\n\nWhy? They don't want to cause an unnecessary recession.", "score": 1, "replies": [{"body": "Literally what? Furman, Lawrence Summers, Ferguson, Sumner, Warsh, Hubbard all on CNBC in the last week. \n\nThat's a pretty fucking large group of relevant economists and former Fed governors.\n\nExcept the Fed's own forecasts are for negative GDP & 4.5% unemployment, which means recession...", "score": 1, "replies": [{"body": ">CNBC\n\nthat's how you know it must be true", "score": 1, "replies": [{"body": "Yes I watch too much while working out", "score": 2, "replies": []}]}, {"body": "btw i agree w u but im also not running the fed", "score": 1, "replies": [{"body": "Yeah thank God I would be fired", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Pshh, transitory.  /s", "score": 1, "replies": []}, {"body": "Yeah I learned that the hard way over the last couple months. I don’t get it, but I’m here for it.", "score": 1, "replies": []}]}, {"body": "It’s pretty slowly and steadily going down though. This is a marathon not a sprint and at least the interest rate is now higher than cpi and equal to core cpi. In addition the fed is slowly unravelling their balance sheet which comes on top of the interest rate itself. Even if interest rate is not higher than inflation a higher interest rate still makes a lot of leveraged plays unattractive. \n\nIn the end they need to be careful and give banks some time to adjust I guess. A big bank going bellyup because their assets lose too much value would be the worst thing. \n\nhttps://uk.investing.com/economic-calendar/core-cpi-736", "score": 7, "replies": [{"body": "Fed made the Bank Bailout Facilitation Program on March 10th, 2023 for this very reason. \n\nTheir bad investments can be sold at Par Value to the Fed. Don't you wish we could do the same thing?", "score": 1, "replies": []}]}, {"body": "Core is being held aloft by shelter inflation which is absolutely cliff diving right now. \n\nCore services less shelter has been flat from January through May, which is essentially consistent with 2% annual inflation. If this trend holds up, inflation will be under control by EOY. \n\nWe are in the soft landing right now. More rate increases significantly risks unemployment going up beyond their desire.", "score": 13, "replies": [{"body": ">which is absolutely cliff diving right now.\n\nwheres your sources on that? lets look at real numbers \n\nyou cant cherry pick what you like and dont like \n\nenergy and food get to be excluded because theyre volatile, shelter isnt volatile and doesnt fluctuate month to month, its only volatility is to go up", "score": 3, "replies": [{"body": ">shelter isnt volatile and doesnt fluctuate month to month\n\n...what? It literally moves in a cycle every year.\n\nhttps://www.zillow.com/research/may-2023-rent-report-32734/", "score": 2, "replies": [{"body": "literally moves consistently about 4% every year, compared to food and oil thats not volitile at all (outside of FED record money printing that throws everything out of line) \n\nPrinting 40% of all USD in about 2 years will throw everything out of line.", "score": 1, "replies": [{"body": "Guess what? This year's move is also consistent with the same summer time rent increase from before covid.", "score": 1, "replies": []}]}]}, {"body": "See below for higher frequency measures of shelter inflation:\n\nhttps://www.corelogic.com/intelligence/corelogic-annual-us-single-family-rent-growth-continues-downward-slide-in-march/\n\nhttps://sites.psu.edu/inflation/\n\nhttps://www.apartmentlist.com/research/national-rent-data\n\nhttps://www.zillow.com/research/may-cpi-inflation-2023-32777/\n\n> However, relief should be on the horizon. Annual increases in rent of primary residence and owners’ equivalent rent of residences peaked in March and April respectively, and continue to edge down. Annual growth of the Zillow Observed Rental Index (or ZORI) – a measure of market rent – has fallen to 4.8% from its 16.9% high in February 2022. While this is welcomed news to renters struggling to afford rent, it also means that CPI Rent – and core CPI overall – should moderate further as the year progresses.", "score": -4, "replies": [{"body": "4.3% GROWTH in March, it hasnt fallen shit\n\nthats still fat growth on top of fat growth it had this entire time \n\nit needs to be 2%, but realistically 0%, the rent bubble&BnB skyrocketed like nothing else and is way overdue for a correction", "score": 1, "replies": [{"body": "4.3% Y/Y, not 4.3% M/M. \n\nThe bottom was October/December. If Q2 earnings goes like Q1, and it certainly looks like it might, we will see ATH by EOY.", "score": 1, "replies": []}]}]}]}, {"body": "Its just not true - US added 250,000+ jobs last month, plenty of wiggle room on unemployment.", "score": 1, "replies": [{"body": "That figure is just the right amount required to keep pace with population growth.\n\nMaximum employment is the second leg of the Fed's dual mandate. On a forward looking basis, inflation is handled.", "score": -1, "replies": [{"body": "Population growth is 150k a month working age as of 2022 population data", "score": 1, "replies": []}]}]}, {"body": "Where's your proof of \"shelter inflation which is absolutely cliff diving right now\" ? \n\nZillow says rents are up 5% YoY in their report from last week.", "score": 1, "replies": [{"body": "CoreLogic’s single family rent index and ApartmentList’s national rent data, each of which Jay Powell has cited directly in his remarks. \n\nPSU’s marginal rent index reflects the same trend.", "score": 1, "replies": [{"body": "Why didn't he cite those in 2021 when he called inflation transitory?", "score": 1, "replies": [{"body": "Because the Fed members were having too much fun watching their personal holdings go through the roof.", "score": 1, "replies": [{"body": "True true I didn't consider that", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 70, "replies": [{"body": "Very easy to make money as a permabull. Impossible as a permabear.", "score": 19, "replies": [{"body": "That’s why I respect bears more than bulls", "score": 0, "replies": [{"body": "Cause they’re poor?", "score": 4, "replies": [{"body": "No. Cause they're 🌈", "score": 1, "replies": []}]}]}]}, {"body": "First it's a joke. Second I can link you like 25 bearish post from today and about 5 bullish so the rhetoric is definitely with the bears here currently which means it will go up.", "score": 18, "replies": [{"body": "[deleted]", "score": 39, "replies": [{"body": "You were literally responding to my post regard ![img](emote|t5_2th52|4271)", "score": 11, "replies": [{"body": "He said your gay.. Hold the L, bear. ![img](emote|t5_2th52|4271)", "score": 27, "replies": []}, {"body": "He wasn't responding to your post.\n\nHe was just posting a top level comment directly on your post referring specifically to the content of your post.\n\nGet with the program grimkhor.", "score": 14, "replies": [{"body": "My bad I'm sorry. Take this fruit basket as a token of friendship  🍍🥭🍎🍏", "score": 9, "replies": [{"body": "Where's the 🍌", "score": 2, "replies": [{"body": "Why do you want to touch my banana? ![img](emote|t5_2th52|30641) mom pick me up ![img](emote|t5_2th52|30641)", "score": 1, "replies": []}]}]}]}]}, {"body": "🌈🐟", "score": 1, "replies": []}]}, {"body": "First, I'm a bear. Second, you're regarded", "score": 2, "replies": []}]}, {"body": "better than perma bear.", "score": 2, "replies": []}]}, {"body": " CPI is a lie. Market still go reee", "score": 24, "replies": []}, {"body": "Stonks always go up. Bears need to get a reality check and stop fighting the laws of physics", "score": 22, "replies": [{"body": "What goes up", "score": 2, "replies": []}]}, {"body": "Then a bigger red monster called 25 bps is grabbing the 4% monster", "score": 11, "replies": [{"body": "Ohh nooo not another 25 bps! How will the market survive that?!", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 6, "replies": []}, {"body": "Is this a soft landing?", "score": 6, "replies": []}, {"body": "I'm still waiting for Jerome Powell's press conference. Until then, I think I have to be careful in selecting the position. Good luck, everyone.", "score": 15, "replies": []}, {"body": "Long term puts baby 🐻🐻🐻🐻", "score": 11, "replies": [{"body": "6/16 putholder : “I can do this all week”", "score": 13, "replies": [{"body": "For real 🐻🤣", "score": 5, "replies": []}]}, {"body": "So...just watch your money evaporate more slowly. Got it.", "score": 8, "replies": [{"body": "Want to bet?", "score": 5, "replies": [{"body": "!Remindme 3 months", "score": 1, "replies": [{"body": "I will be messaging you in 3 months on [**2023-09-14 04:29:09 UTC**](http://www.wolframalpha.com/input/?i=2023-09-14%2004:29:09%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/148fjzs/cpi/jo2h57e/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F148fjzs%2Fcpi%2Fjo2h57e%2F%5D%0A%0ARemindMe%21%202023-09-14%2004%3A29%3A09%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20148fjzs)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "lol you didn't get puts on shit. If you did, you lost.", "score": 1, "replies": []}]}, {"body": "You really think we're going to keep riding ATH on spy into next month? Lol", "score": 2, "replies": [{"body": "Probably till mid August", "score": 3, "replies": []}, {"body": "The market can stay irrational longer than you can stay solvent. One issue is a lot of those 3-6 month 5% CDs are expiring and people are jumping back into the market. And the HYSA holders are getting serious FOMO. Hence, SPY moon.", "score": 2, "replies": []}, {"body": "You think a month is long term?", "score": 1, "replies": []}]}]}, {"body": "short term holder --one day later--> long term holder", "score": 8, "replies": [{"body": "Long term holder = Long term bag holder![img](emote|t5_2th52|4271)", "score": 4, "replies": []}]}]}, {"body": "“We built a tower that’s 100 feet tall and just added 4 feet to it. It’s getting shorter!”", "score": 9, "replies": []}, {"body": "It’s all a fkn lie, you deal with this shit everyday. Prices haven’t fallen and wages haven’t increased. How are we better? We have created 950 billion in deficit in 2023 alone and we just signed a budget to save 1 trillion over 10 years lol. \n\n\nCompanies make shit look better on paper in crisis. The government does the fkn same thing. The market  is being irrational and it’ll do whatever tf it wants so don’t even pay attention to the numbers. \n\nRed or black idc but don’t act like it’s all well thought out based on rational thought. We are gonna hit ATH mid titanic sinking, playing a violin, buying 0DTE. \n\n\nIt’s all regarded from here on out.", "score": 5, "replies": [{"body": "Don't matter cause printer go brrrrrr ![img](emote|t5_2th52|4640)", "score": 2, "replies": []}, {"body": "Doesn’t matter. Things only go up.", "score": 2, "replies": []}]}, {"body": "I always see the pink guy lifting the other one up", "score": 3, "replies": []}, {"body": "Shhhh just let it happen", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|31125)", "score": 3, "replies": []}, {"body": "Double the target is good enough!", "score": 3, "replies": [{"body": "If we take the average from the last 6 months we're at 2.6% regard. If we're next month below 0.2% MoM inflation we're blow 3% yoy.", "score": 1, "replies": [{"body": "If we take the average and exclude everything then we get 0% also", "score": 1, "replies": [{"body": "Not really. You're actually just 100% wrong here. Look up CPI MoM and learn something. What you actually don't have on your radar is that June last year was the highest rise in monthly inflation.", "score": 1, "replies": [{"body": "The Federal Reserve's official inflation target is PCE inflation which is running at 4.6%, more than double their target. \n\nIt also accelerated higher YoY in March and April. \n\nFinally, focusing on solely CPI and arguing that 4% means inflation is back near target is being willingly ignorant of the main reason CPI is down hard. We had a shit ton of CPI inflation in June 2022. \n\nThe Federal Reserve's official policy is that of Flexible Average Inflation Targeting at 2%. A credible expectation would be that we at the very least get below 2% CPI to make up for the enormous overshoot in 2021-2023.\n\nI'm not an idiot who actually thinks we will even get to 2% before the Federal Reserve cuts rates though. So I'm bullish", "score": 2, "replies": [{"body": "Dude like for real. Why are bears like that. Last year inflation is at 9% (PCE was never at 9%). This year inflations is at 5% (NOW focusing on PCE). PCE is a less volatile inflation. It is less volatile because it uses things that take a longer time to be affected by inflation. If energy drops headline is affected first. Now if energy becomes cheaper and PPI is cheaper what happens to everything else? It becomes cheaper. The result is that PCE is a more stable but more lagging indicator. You're actually a mentally challenged person.\n\n>The Federal Reserve's official inflation target is PCE inflation which is running at 4.6%, more than double their target.\n\nThe funny thing is actually if you read this far that you're not even talking about PCE but about Core PCE and you don't even know the difference. PCE inflation is at 3.2% for the last 10 months and is not out yet for May. It's if I would say last year inflation went up to only 5% because of Core PCE instead of 9%. If we just focus just on Core PCE inflation wasn't even a big deal because it only went up to 5% and never went up to crazy levels.\n\n>So I'm bullish\n\nYeah I hear that a lot lately perma bear. Get rekt.", "score": 1, "replies": [{"body": "Inflation is more than double the Federal Reserve's target. This is after 2021 and 2022 were substantially above Federal Reserve target. \n\nThe Federal Reserve has not tightened monetary policy sufficiently in 2021, 2022, or 2023. Hence how we are still more than double the target inflation rate. \n\nOnce we are actually at the target inflation rate, we can say that monetary policy has succeeded. \n\nIf the Federal Reserve wants to follow it's officially stated policy of Flexible Average Inflation Targeting, this entails getting inflation below 2% to AVERAGE that rate over a few years. \n\nObviously no one actually expects them to do that. Since the Fed lacks credibility", "score": 1, "replies": [{"body": "Get out of here you 🤡 Not listening to uneducated phrases you picked up from twitter ![img](emote|t5_2th52|4640)\n\nhttps://preview.redd.it/gkvtziverz5b1.png?width=620&format=png&auto=webp&s=086597b8081ab1fb5059ba64d0c11f4b3d8f75ba\n\nTheir target was never 2% for 2023 and you obviously never seen the dot plot 🤡\n\n[https://www.federalreserve.gov/monetarypolicy/files/fomcprojtabl20220921.pdf](https://www.federalreserve.gov/monetarypolicy/files/fomcprojtabl20220921.pdf)\n\nThey expect 2% in 2025.", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|27421)", "score": 1, "replies": [{"body": "Core PCE is btw at 4.2% on average from the last 10 months and is again not out for may yet. Considering that their target for 2023 is 3.1% and 8 month of dropping inflation are left you're literally a 🤡", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "![img](emote|t5_2th52|31125)", "score": 2, "replies": []}, {"body": "Jpowell may pause the hike and then raise the next one just because logic no longer exist in this market and the policies, it’s basically exactly the same as southpark’s headless chicken meme", "score": 2, "replies": []}, {"body": "I dont understand how puts work.\nI am buying traditional stocks and made +20% since january 1st.\nWhen are put profitable?", "score": 2, "replies": [{"body": "In extreme negative unexpected events. A good example would be company bankruptcies or such. In the overall market it would be something like a negative surprise in inflation data like recently or a start of a war. How would you know that? You don't. That's why it's gambling. Serious market participants use puts mostly as a form of insurance against extreme events for their stock portfolio.", "score": 1, "replies": [{"body": "Ok thank you. I understand why would one use it that way.", "score": 2, "replies": []}]}]}, {"body": " CPI is a lie. Market still go reee", "score": 3, "replies": []}, {"body": "Bears as usual, After 15 months of getting f\\*\\*ed still finding 'dots' and 'commas' in the report trying to convince the broader market that inflation is going up.\n\nWhat bears don't realize the last CPI report (including the core because bears keep poking the core) was in full alignment.\n\nOn Rate HIkes: People buying stocks here don't even know J Pow has openly said not many rate hikes coming [https://www.cnbc.com/2023/05/19/fed-chair-powell-says-rates-may-not-have-to-rise-as-much-as-expected-to-curb-inflation.html](https://www.cnbc.com/2023/05/19/fed-chair-powell-says-rates-may-not-have-to-rise-as-much-as-expected-to-curb-inflation.html)\n\nMaybe 1-2 more that are not gonna send the market down by 10% anytime. By the time these rate hikes come (love the next 2-3 months), inflation would have gone down to 3% so the market would have already 'priced the good and bad factors'", "score": -1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "148ij0a", "created_utc": 1686671468.0, "score": 767, "upvote_ratio": 0.95, "num_comments": 155, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|135|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 3, "replies": []}, {"body": "Good enough to screenshot good enough to sell your initial investment", "score": 337, "replies": [{"body": "Sir, this is . . .", "score": 15, "replies": []}, {"body": "![img](emote|t5_2th52|27189)", "score": 31, "replies": []}, {"body": "Fk that hold on til the 17th like a real wsber, OP! Who knows that that number could go to but I bet it will have a lot of zeroes in it. Be a man!", "score": 3, "replies": []}, {"body": "It's after the fact anyway so..", "score": 4, "replies": []}]}, {"body": "how bout your $BABA position, must be up at least 80%+", "score": 91, "replies": [{"body": "He could’ve been up over 100%", "score": 9, "replies": []}]}, {"body": "F'in hot streak you're in, what have you been wrong in lately?", "score": 53, "replies": [{"body": "I make losing trades multiple times per day.", "score": 160, "replies": [{"body": "Gonna have to show some losses to balance this out", "score": 62, "replies": []}, {"body": "post your Ls too man", "score": 15, "replies": []}, {"body": "then why dont you post the loss porn with the gain for more karma?", "score": 10, "replies": [{"body": "This makes him feel maximal peepee", "score": 7, "replies": []}]}, {"body": "Even a broken clock is right twice a day 😂", "score": 19, "replies": []}, {"body": "Waiting on that ride in your big green tractor", "score": 7, "replies": []}, {"body": "Alright - i read about 20 of your posts and still haven’t found it.  What do i buy tomorrow?", "score": 5, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "100% apparently.", "score": 6, "replies": []}, {"body": "1000%", "score": 4, "replies": []}]}]}]}, {"body": "How can I hate and love you so much?", "score": 76, "replies": [{"body": "Right\n\nLike, congrats bro! That must be an amazing feeling! \n\nBut also, FUCK YOU😭 lol", "score": 29, "replies": []}, {"body": "My girlfriend feels the same, she 70/30 hate-love ratio.", "score": 4, "replies": []}]}, {"body": "Fuck you and your face.", "score": 36, "replies": [{"body": "But seriously, congrats.", "score": 26, "replies": [{"body": "But also, fuck you.", "score": 28, "replies": [{"body": "Seconded, fellow Jedi", "score": 7, "replies": []}]}]}]}, {"body": "Congratz mate!\nKeep posting more of those so we can also jump in", "score": 12, "replies": []}, {"body": "Please sell", "score": 7, "replies": []}, {"body": "I followed your lead on this one. Much appreciated!", "score": 7, "replies": [{"body": "Where do u follow him? Reddit?", "score": 8, "replies": []}]}, {"body": "How are you identifying Option opportunities and choosing the correct Call (for example) to buy?", "score": 6, "replies": [{"body": "The game is to be sold not be told.", "score": 8, "replies": [{"body": "https://preview.redd.it/qbtqh7kuiw5b1.png?width=378&format=png&auto=webp&s=bdad9570b81adc878cfcbca0701a6ad9f1f354e1\n\nfound it", "score": 7, "replies": []}]}]}, {"body": "Congrats. You sell?", "score": 5, "replies": []}, {"body": "You got serious balls to gamble that kinda money on short duration options.  It could've gone either way", "score": 11, "replies": [{"body": "Hes likely a millionaire multiple times over.", "score": 20, "replies": []}]}, {"body": "Most people only post their winning trades", "score": 15, "replies": [{"body": "I'd post my losers but they are too tiny. Death by a thousand cuts.", "score": 10, "replies": []}, {"body": "What's a winning trade, I'm yet to experience the phenom", "score": 5, "replies": [{"body": "I think it‘s when you inherit money from your family or rob a liquor store or when you receive payment for offering coitus services", "score": 3, "replies": []}]}]}, {"body": "Take profit, regard", "score": 10, "replies": [{"body": "Now you know that’s not what this sub is all about..", "score": 6, "replies": []}, {"body": "Timestamp is from 6:56am (PST), my guess is he already did.", "score": 2, "replies": []}]}, {"body": "GOAT . Great play my man!", "score": 4, "replies": []}, {"body": "Father..?", "score": 4, "replies": [{"body": "Brother?", "score": 2, "replies": []}]}, {"body": "my man gambling $100k in call options that expire in 4 days with a Theta decay that's going to eat up roughly 10-25% a day (acc.) let alone the IV contraction that could possible happen.  \n\n\nDamn, that's some balls![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4276)", "score": 6, "replies": []}, {"body": "Please teach me and make me your Project", "score": 3, "replies": []}, {"body": "Look damn it. You let us know when you're making the moves so we can follow you to the promised land!", "score": 4, "replies": []}, {"body": "Congrats bro. Go treat yourself to something nice. New car? Vacation?", "score": 3, "replies": [{"body": "fuck that\n\nhe needs to treat himself to some 0DTE OTM calls", "score": 19, "replies": [{"body": "All in? 🤷‍♂️", "score": 3, "replies": []}]}]}, {"body": "If you check this guy's post. This guy is winning in life", "score": 3, "replies": []}, {"body": "Can someone explain this to me? I’m learning options and  I’m a little stuck", "score": 3, "replies": [{"body": "He theorized that (among other factors) because CPI numbers were going to come in as predicted or better, that John Deere’s stock price (an industrial stock) would rise with good CPI numbers. Hence he bought 704 call contracts with a strike price of $400 right before market close yesterday as you cannot trade options before or after hours. CPI numbers came in this morning on par with what was predicted and John Deere’s stock price went up. In his situation, up enough that his contracts became A LOT more valuable since the stock price eventually overtook his strike price (the price he needed it to hit to be considered “in the money” which was @ or above $401.40. The reason for the massive amount of return is because not only the percentage change, but because the amount of contracts he purchased, 700+   If you want a better analysis as to why this worked well look at his profile and find his strategy post he made a couple days ago. He seems like the real deal and you can gain some good information about how he finds his edge in that post once you have watched some YouTube videos on options basics first of course!", "score": 7, "replies": [{"body": "The strike is 400, so meaning if he exercises his option he can buy the shares at 400 per, right? Which is where John Deere is at in this screenshot no?", "score": 2, "replies": [{"body": "That’s correct. As long as you have enough capital to purchase it", "score": 2, "replies": []}]}]}]}, {"body": "I'm glad you're doing well with your DE $400 call, but I don't think it's anything to brag about. Anyone could have made that trade and made a profit.", "score": 16, "replies": [{"body": "Why didn't you?", "score": 34, "replies": [{"body": "Not regarded enough", "score": 5, "replies": []}, {"body": "Because anyone with money isn’t buying such a stupid position. It’s not worth the risk. It was a 50/50. \n\n\nNow if you have a paper account or you just fake your screenshots you can make all the YOLOs you want . That’s what half of wsb is now because of lax verification.", "score": 5, "replies": []}]}, {"body": "What??", "score": -1, "replies": []}]}, {"body": "thanks for telling me about it AFTER the move", "score": 4, "replies": [{"body": "He posted this buy before today, you’re just seeing his update", "score": 8, "replies": []}, {"body": "Ur fault for not tailing him earlier", "score": 3, "replies": []}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "Bought DE calls right before close yesterday. Opened 700x weekly $400C at $1.35.\n\nThesis: CPI was low. Confirms NO rate hike tomorrow, helps support thesis of no recession. They would sell tech and buy “real economy” stocks.\n\nInstantly proved right as NQ went red and industrials bid bigly.", "score": 16, "replies": [{"body": "Why would they sell tech?", "score": 4, "replies": [{"body": "Because Jim Cramer said to buy", "score": 20, "replies": []}, {"body": "slowing inflation means there could be rate hikes, rate hikes means more $ out of equities and growth", "score": -5, "replies": [{"body": "Rate hikes are used to slow inflation. You've got this backwards. Slowing inflation means reducing rate hikes", "score": 5, "replies": [{"body": "you sure?  inflation is keep up and rate higes", "score": 1, "replies": [{"body": "Yeah so what does that tell you....what can you deduce from that....", "score": 1, "replies": []}]}]}]}]}, {"body": "Why would no hike and no recession lead to selling tech and buying industrials…. that sounds inverse to me.", "score": 2, "replies": []}]}]}, {"body": "Thank you, king.", "score": 2, "replies": []}, {"body": "Even if DE goes up tomorrow couldn’t this option take a dive on its theta?", "score": 2, "replies": [{"body": "No cuz if it goes up then its itm and the price of stock is 398. A 1% change will offset the theta easily. It would mean the instrinsic value is 2.00 per contract at bare minimum even with 0 theta and volatility.\n\nIf it goes up 0.1%, then sure. Iv and theta will drop and contract price will drop.", "score": 5, "replies": []}]}, {"body": "You spent $100k on calls after it jumped in price from June 9th to June 12th? Why?", "score": 2, "replies": []}, {"body": "This guy fucks", "score": 2, "replies": []}, {"body": "You’re on a winning streak like no other right now starting at like 4K. You at a milly yet?", "score": 2, "replies": []}, {"body": "All hail the king", "score": 2, "replies": []}, {"body": "https://preview.redd.it/qzq6d744jw5b1.png?width=378&format=png&auto=webp&s=ff3ac646c37448a1282d2f0ed35ab18e21ae73e4\n\nconfirm OP?", "score": 2, "replies": [{"body": "Where is this from?", "score": 1, "replies": []}]}, {"body": "show us your all time. skeptical", "score": 3, "replies": []}, {"body": "Easy when all you do is buy calls and market has been ripping for two weeks straight.", "score": 2, "replies": []}, {"body": "Lol I was out to buy put’s tomorrow", "score": 0, "replies": []}, {"body": "What is DE and why?", "score": 0, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "You actually believe that dude has more than 1m in the bank?", "score": 1, "replies": []}, {"body": "Where do u follow him? Reddit?", "score": 0, "replies": []}]}, {"body": "Soooooo, a lot of people are saying his trades are fake, and he is DM ing them to send $200 for trading tips. Is this true OP?", "score": -3, "replies": [{"body": "prob just some indian looking for attempts, found a name that people might glance twice at thanks to his post history", "score": 0, "replies": [{"body": "who? OP or me?", "score": 0, "replies": []}]}]}, {"body": "got confused bought ODTE  instead", "score": 1, "replies": []}, {"body": "you legend Ive been waiting since last night to see your update !", "score": 1, "replies": []}, {"body": "These r great returns but u could have swung ur dick anywhere and been up this much if not more", "score": 1, "replies": []}, {"body": "Fuck you. \\~\\~\\~\\~ Taking all my money lol\n\nI will be a worker ant and give you all my money through stock lol.  \nI am happy for ya brotha.", "score": 1, "replies": []}, {"body": "How do you think the fed meeting will influence DE’s price. I bought these same calls this morning", "score": 1, "replies": []}, {"body": "Sell!!", "score": 1, "replies": []}, {"body": "That's a lot of right calls though", "score": 1, "replies": []}, {"body": "Leave now", "score": 1, "replies": []}, {"body": "Saw your earlier post but took NiO. Some more leg to go i guess. 10", "score": 1, "replies": []}, {"body": "What app is this?", "score": 1, "replies": [{"body": "Robinhood", "score": 2, "replies": []}]}, {"body": "Cash out my guy", "score": 1, "replies": []}, {"body": "Congrats and FUCK YOU", "score": 1, "replies": []}, {"body": "I saw it go up and was wondering how much you'd be up what made you buy", "score": 1, "replies": []}, {"body": "Yeah, you know it's a regarded market when any calls play is printing 200%", "score": 1, "replies": []}, {"body": "Congratz and fuck you", "score": 1, "replies": []}, {"body": "What’s your current net gain after your initial $3K bet", "score": 1, "replies": []}, {"body": "I need ur call outs omg", "score": 1, "replies": []}, {"body": "I guess I need to start hiking", "score": 1, "replies": []}, {"body": "Never heard of DE. Guess I belong here", "score": 1, "replies": [{"body": "John Deere. They make big green tractors.", "score": 1, "replies": []}]}, {"body": "These single, random, Gain Posts are completely meaningless by itself. \n\nWhat does your overall account history line look like? Are you able to relatively consistently repeat this same winning trade over and over and over again,.....", "score": 1, "replies": []}, {"body": "Ok next Yolo you tag me", "score": 1, "replies": []}, {"body": "Added DE. thoughts on $ATVI calls?", "score": 1, "replies": []}, {"body": "How are you doing on the BABA calls?", "score": 1, "replies": []}, {"body": "DE like John Deere? :D", "score": 1, "replies": []}, {"body": "How much did you put in?", "score": 1, "replies": []}, {"body": "What a random trade", "score": 1, "replies": [{"body": "was perfect though, flow sweepers hit CAT hard yest. how the fk this guy knew to pick DE is beyond me", "score": 2, "replies": []}]}, {"body": "Most respectfully, fuck you", "score": 1, "replies": []}, {"body": "Nice trade!  Now sell, these are going to zero.", "score": 1, "replies": []}, {"body": "This guy can’t lose", "score": 1, "replies": []}, {"body": "Some people crazy af out here lol", "score": 1, "replies": []}, {"body": "They have AI too.", "score": 1, "replies": []}, {"body": "I would be chasing that high for the rest of my life", "score": 1, "replies": []}, {"body": "That’s just a random company", "score": 1, "replies": []}, {"body": "What’s your next play?", "score": 1, "replies": []}, {"body": "Congrats. Fuck you if it’s realized.", "score": 1, "replies": []}, {"body": "Nice", "score": 1, "replies": []}, {"body": "Show the purchase transactions so I can correlate to the exchange or else Bullshit.", "score": 1, "replies": []}, {"body": "Yeah that sucker gonna keep running too", "score": 1, "replies": []}, {"body": "Wow", "score": 1, "replies": []}, {"body": "Congrats!! (was gonna do the other half but I just found out I’m about to be a dad so I’m unreasonably positive about everything today)", "score": 1, "replies": []}, {"body": "Funk off\n\nYour awesome 🤩", "score": 1, "replies": []}, {"body": "Must be nice", "score": 1, "replies": []}, {"body": "You make a lot of return so it's a good sign for you take seriously about that money. But be mindful of you investment that money cause a lot of hard work so you better be sure. Study well in what you are investing.", "score": 1, "replies": []}, {"body": "I have no idea what I'm looking at but everyone else seems impressed so congratulations :-)", "score": 1, "replies": []}, {"body": "Can someone help, I’m an uneducated European with no access to options trading, how much was his initial investment on these contracts?", "score": 1, "replies": [{"body": "704 contracts @ $1.40\n\n704 \\* $1.40(100) = $98560", "score": 1, "replies": []}]}, {"body": "Is this best guess or just blind luck I'm doing g so.ething wrong.....", "score": 1, "replies": []}, {"body": "Nice!", "score": 1, "replies": []}, {"body": "How do you guys do it and how can i learn to do that too??", "score": 1, "replies": [{"body": "It's easy. you go to the casino. You tell the dealer, Red or Black. Good luck!", "score": 1, "replies": []}]}, {"body": "dang, worth over $495,000 a few minutes ago, congrats!", "score": 1, "replies": []}, {"body": "you're in the money, bro.", "score": 1, "replies": []}, {"body": "Position currently worth $411,840 omfggggg", "score": 1, "replies": []}, {"body": "Wow congrats\n\nAlso fuck you", "score": 1, "replies": []}]}
{"title": "I singlehandedly saved the market...AGAIN", "selftext": "Hello all, it's been a while. I'm sure there are a bunch of new faces around here and it has been 2 years since my one and only post in the subreddit so, before reading this post, please check out this one -\n\n[I singlehandedly saved the market by fading myself](https://www.reddit.com/r/wallstreetbets/comments/qwpky1/i_singlehandedly_saved_the_market_by_fading_myself/)\n\nI've done it again, I saved the market. This post is a little overdue, but a few weeks ago I bought a single SPY put assuming that the debt ceiling would be hit and America would default on it's debts. Since I made that play, it, of course, did not happen. Now SPY is approaching ATHs and the American money machine is pumping. Inflation went down for the 11th straight month and is at its lowest point in years. The future is bright all because of 1 single SPY put.\n\nSome of you may be saying \"Well, that was a stupid play. It was never going to work! The government would never allow a default on their own debt, this guy is an idiot.\" To that I say, how sure are you? Would you bet your life on that? Perhaps the soul of your firstborn? I know this works because it happens time and time again, this was actually the first trade I've made since my last post. I sacrificed $10 so that you all could make $1000. I saved every American's retirement account, their kids college funds, and for what? Nothing. I am a simple man who seeks no thanks, I only search for the right thing to do.\n\n&#x200B;\n\nhttps://preview.redd.it/u31oz576et5b1.jpg?width=1170&format=pjpg&auto=webp&s=c270ed29d75765a862dbae2b7fc77d7ded9e2a29", "id": "148jsvg", "created_utc": 1686674837.0, "score": 729, "upvote_ratio": 0.93, "num_comments": 107, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|1|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: I made the ultimate market call and saved everyone's money by buying a single SPY put.", "score": 1, "replies": []}, {"body": "Thank you for your sacrifice noble regard. Your name will once again be forgotten and this post banned, but for now, you're the hero we deserve.", "score": 684, "replies": [{"body": "Not the hero we deserved but the one we needed.", "score": 50, "replies": [{"body": "Not the hero we wanted or needed.", "score": 43, "replies": [{"body": "Thank you for your sacrifice", "score": 17, "replies": [{"body": "And honest work", "score": 5, "replies": []}]}, {"body": "Not the need or want our hero asked for", "score": 7, "replies": [{"body": "Finally someone who understands. Thank you brother, I only seek solitude", "score": 12, "replies": []}]}]}]}]}, {"body": "Wait, you guys want puts to print? Why didn't you say so.\n\nLet me go buy another $40,000 shares. Last time I did that SPY dropped $50 in a week.", "score": 54, "replies": [{"body": "Pretty please?", "score": 15, "replies": []}, {"body": "please timestamp and msg the mods to pin your screenshot so we know exactly when to short. thanks regard", "score": 13, "replies": []}, {"body": "Pretty please daddy with a cherry on your dick", "score": 7, "replies": [{"body": "Well that escalated quickly", "score": 5, "replies": [{"body": "'tis r/wallstreetbets", "score": 1, "replies": []}]}]}]}, {"body": "Lmao you actually thought the US would default? The news got you dude", "score": 132, "replies": [{"body": "It would have if he didn’t save us", "score": 114, "replies": [{"body": "Not the hero we deserve…", "score": 13, "replies": []}]}, {"body": "You don't realise how close we were to defaulting. One single malfunction one single neuron missfiring one single missclick and the dude would have bought a call dooming whole planet", "score": 35, "replies": [{"body": "I still believe Powell went into the Quantum Realm to save us all.", "score": 7, "replies": []}]}]}, {"body": ">I'm glad I could help save the market! It's always been my mission to help make everyone as rich as possible.", "score": 62, "replies": [{"body": "![img](emote|t5_2th52|4258)", "score": 6, "replies": []}]}, {"body": "Thank you for your sacrifice", "score": 12, "replies": []}, {"body": "Thanks man! My SPY calls thank you", "score": 9, "replies": []}, {"body": "an incredible act of bravery and stupidity in these dark times.", "score": 9, "replies": []}, {"body": "Thank you for your service, truly. One regard to another.", "score": 12, "replies": []}, {"body": "I thank you anyway very much for my Spx moves. Now I can fire my wife boyfriend and sleep in my old bed again", "score": 6, "replies": [{"body": "I’m happy for you, stories like these keep me motivated", "score": 5, "replies": []}]}, {"body": "An appreciation for your sacrifice. You did not do bad you only want is to help us. Like us who in need of money. You may be forgotten but I will still remember you.", "score": 5, "replies": []}, {"body": "🫡 my calls thank you", "score": 5, "replies": []}, {"body": "Wendy's called, why are you not at work?", "score": 3, "replies": []}, {"body": "https://thehill.com/opinion/finance/575722-the-us-has-never-defaulted-on-its-debt-except-the-four-times-it-did/", "score": 3, "replies": []}, {"body": "Also helped save the market here by ONLY buying PAPER TRADE Calls. Up 75%", "score": 3, "replies": [{"body": "I too have done this, lack of conviction is my middle name", "score": 1, "replies": []}]}, {"body": "Bold of u to assume u are the only one involved in the rescue operation.", "score": 3, "replies": [{"body": "Not the only one, but obviously the most important", "score": 3, "replies": []}]}, {"body": "Nah. I was buying 5/31 330 QQQ puts on 5/24 expecting a breakdown. It went up 6% and hit 350 in 2 days and never looked back. Lost about 20% of my portfolio on those.\n\n(I also bought some 340p expecting the bounce to be fake lol)", "score": 3, "replies": []}, {"body": "Thank you fam, you saved my life.", "score": 3, "replies": []}, {"body": "As a fellow regard, thank you for your service sir. My tiny 1100$ options portfolio thanks you.", "score": 2, "replies": []}, {"body": "Thank you for your service", "score": 2, "replies": []}, {"body": "my calls thank you for your sacrifice", "score": 2, "replies": []}, {"body": "You gotta setup a gofundme, son.  Do this every. single. week.", "score": 2, "replies": []}, {"body": "Appreciate it.  I’ll think of you when I’m fucking my hot woman on my bed made of money.", "score": 2, "replies": []}, {"body": "i live for posts like this ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Highly regarded hero of the masses\n\nWe, the regarded people thank you for your sacrifice", "score": 2, "replies": []}, {"body": "I bought spy at $500. I haven’t seen it near that level since. I sold out at $460", "score": 2, "replies": [{"body": "I should’ve posted sooner, thinking about buying another out soon. You’d be rich", "score": 2, "replies": []}, {"body": "He's a time traveller!", "score": 2, "replies": []}]}, {"body": "Just incredible. When is the autobiography coming out", "score": 2, "replies": []}, {"body": "I’m with you.  I played 4 straight puts and missed all.  Sad", "score": 2, "replies": []}, {"body": "let me know what you;re going to do next?", "score": 2, "replies": []}, {"body": "Yay", "score": 1, "replies": []}, {"body": "thanks dude. let me know when you decide to do this again!", "score": 1, "replies": []}, {"body": "make sure to lmk what ur next play is", "score": 1, "replies": []}, {"body": "I shit my pants so the US would not run out of toilet paper. Sure man, but i do appreciate the comedy.", "score": 0, "replies": []}, {"body": "It is impossible for the US to default in modern times. Will never happen. There is nothing on the horizon to bring the market down. Buy the dips.", "score": 0, "replies": [{"body": "This is asinine.   \n\n\nHow about BRICS.   \n\n\nHow about we won't be the reserve currency in a decade.   \n\n\nYou are crazy.", "score": -2, "replies": [{"body": "Your comparison and assumption that will happen in our lifetime is crazy. Please provide a scenario outside of a nuke dropping that would trigger a default. Asking for...a friend.", "score": 2, "replies": []}, {"body": "What about BRICS? LOLOL. BRICS is going to be BICS in about 5 years at this rate.", "score": 2, "replies": []}, {"body": "> what about brics \n\nYou mean the fucking Goldman Sachs acronym for developing markets they wanted to invest in decades ago? Because that's all that is. A fucking acronym lmao.", "score": 1, "replies": [{"body": "You mean the unilateral trade agreements between countries, that will settle in YUAN, RUBLES, AND GOLD. Bypassing the USD.   \n\n\nDipshit.   \n\n\nTell me you don't understand money without telling me you don't understand money.", "score": 1, "replies": [{"body": "Yeah, that's gonna happen. 🤦‍♂️", "score": 1, "replies": [{"body": "It actually is, August 22nd dummy.", "score": 1, "replies": [{"body": "Right, everyone is going to abandon the US dollar, got it. 🤦‍♂️", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I did the same by not buying a call. 🧻🎲🎰", "score": 0, "replies": []}, {"body": "You bet we’d default? No one informed you that’s a game show and it was always 100%?", "score": 0, "replies": []}, {"body": "Post your NVDA loss porn", "score": 0, "replies": []}, {"body": "aspiring poor screw books disgusted gold humorous uppity paint plate", "score": -11, "replies": []}, {"body": "Have you tried either choosing the obvious path (perpetual bull market) or not gambling at all?", "score": -1, "replies": [{"body": "Gambling and being wrong keeps me chasing. If I was ever right I’d achieve enlightenment and have nothing else to pursue", "score": 1, "replies": []}]}, {"body": "You and I could rule the world. I also bring airport security checkpoints to a halt as well as grocery store checkouts.", "score": 1, "replies": []}, {"body": "congrats. You win a free hot dog................with a purchase over $50 at participating restaraunts", "score": 1, "replies": []}, {"body": "Whatever", "score": 1, "replies": []}, {"body": "That’s a lot of milage!", "score": 1, "replies": []}, {"body": "Did you sell the put?", "score": 1, "replies": [{"body": "Sort of, Robinhood took care of it for me. The 0.00 it was worth is really making a difference around the house", "score": 2, "replies": [{"body": "Shit, so nothing is keeping the market afloat now. This is bad news", "score": 1, "replies": [{"body": "It’s in gods hands. I will return, but I’m not sure when", "score": 1, "replies": []}]}]}]}, {"body": "lol i don’t know anything about everything you said", "score": 1, "replies": []}, {"body": "Is this Chael Sonnen?", "score": 1, "replies": [{"body": "MMA Legend!", "score": 3, "replies": []}]}, {"body": "You really should listen 6o your sage advice and buy some $spy and then throw up a put!  \n\nWhich one should be greater is the real question!", "score": 1, "replies": []}, {"body": "I believe you", "score": 1, "replies": []}, {"body": "Can you explain what happened here and how much you lost ( for those regards that can’t comprehend options) err like me", "score": 1, "replies": [{"body": "I donated my $10 to save the global economy", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|31125)", "score": 1, "replies": []}, {"body": "Thank you for your service", "score": 1, "replies": []}, {"body": "I salute you", "score": 1, "replies": []}, {"body": "I need you to sell all your belongings and buy as many QQQ calls as you can. Thanks bro", "score": 1, "replies": []}, {"body": "You say you seek no thank, but post about how you saved the world publicly? Are your puts just as backwards as your statement?", "score": 1, "replies": []}, {"body": "Well, thanks for the sacrifice champ!", "score": 1, "replies": []}, {"body": "Even Superman has a red cape", "score": 1, "replies": []}, {"body": " \"I bought a single SPY put assuming that the debt ceiling would be hit and America would default on it's debts.\" \n\nHahahaha. Ahem, guys, US has actually defaulted on its debt FOUR TIMES. It is crazy. Definitely going to \"default\" again. Happens all the time.", "score": 1, "replies": []}, {"body": "Please share your next play so you can continue to save our bank accounts!", "score": 1, "replies": []}, {"body": "Hey I did my part as well!", "score": 1, "replies": []}, {"body": "Well done. But since you didn't hold, JPow is fuching everyone's calls today", "score": 1, "replies": [{"body": "I held to the bitter end! Unfortunately the market makers and their expiration dates got me. Don’t blame me, blame the system", "score": 1, "replies": []}]}]}
{"title": "Post CPI and Pre-FOMC Day… 6-13-23 SPY/ ES Futures, QQQ and VIX Daily Market Analysis", "selftext": "Well they did it.. CPI came in cold… however, CORE YoY is still very high… \n\n**CPI**\n\n&#x200B;\n\nhttps://preview.redd.it/y7c2rr4ltu5b1.png?width=975&format=png&auto=webp&s=d348e6d5a4b69b82ffba005b4bfb6ecbc6da2e84\n\nI did come in pretty spot on for my numbers… but honestly even if the fed pauses tomorrow or “skips” I think its dangerous for them to pause when CORE YoY is still as hot as it is…\n\n**FOMC**\n\n&#x200B;\n\nhttps://preview.redd.it/tmjp9jtltu5b1.png?width=975&format=png&auto=webp&s=0bbd8214e9d2fcbeede69a0e62c93c72527bf426\n\nWell I said yesterday we did not have any sort of notice from Fed whisperer NICK… but it would appear our boi has finally signaled that the fed indeed will pause tomorrow… \n\nNow do I think the fed should do a 25bps cause of CORE? Absolutely… but at this point really no reason to expect a surprise at this point… \n\n&#x200B;\n\nhttps://preview.redd.it/kaqnagcmtu5b1.png?width=975&format=png&auto=webp&s=4449e51c4d5fa9dec4dcf3a866e72b29a5fc2b6a\n\nWe do indeed get some PPI data in the morning… but it would have to be extremely hot in order for feds to last minute change their minds… \n\n&#x200B;\n\nhttps://preview.redd.it/33uk9ztmtu5b1.png?width=847&format=png&auto=webp&s=accf4c083812f54c2eb0728ad9673a499684cc85\n\nI showed you guys a very similar chart last night for CPI day… IF you had swung SPY calls it was about a 30-40% win and QQQ calls were about a 40-50% win… now I did NOT swing anything myself as I just don’t think the risk to reward is there… but the odds of a red open tomorrow are pretty solid… \n\n&#x200B;\n\nhttps://preview.redd.it/iucxje9ntu5b1.png?width=838&format=png&auto=webp&s=dc7b95ee4dee7a82edfa5ccd11593c463bd37146\n\nThe last few fed meetings has seen a pretty dramatic drop EOD… actually this is super interesting as it plays out perfectly to what FOMCs have always did….   \n \n\nsell off 2pm to 230pm -> 230 to 245/3pm pump -> 245/3pm to EOD dump… shall we see a repeat? \n\n**SPY DAILY SUPPLY AND DEMAND** \n\n&#x200B;\n\nhttps://preview.redd.it/lowojynntu5b1.png?width=773&format=png&auto=webp&s=1c7865bce874377f44f159f807265ef703cd9d3a\n\nSpy continues to pump and actually did close out an abandoned baby pattern here… however, we did fail to reach the daily demand at 437.87…. this remains our upside target for tomorrow. \n\nIf we break through 437.87 I don’t have any levels until $445 area. \n\nHowever, on a red day tomorrow there actually is a pretty strong chance that bears will put in a supply off todays candle at 436.69. That would in my opinion lead to a sell off Thursday back to 429.86. \n\n**SPY DAILY PRICE ACTION** \n\n&#x200B;\n\nhttps://preview.redd.it/919jkb1otu5b1.png?width=975&format=png&auto=webp&s=3876cb30da415e9edbb0b1c24a8462fdd08388e2\n\nSPY remains in this upward black bull channel and now is coming in on the blue bull channel resistance tomorrow also…\n\nBlack resistance sits at 439.7 and blue sits at 440.\n\nNow we are getting pretty over extended from the daily 8ema here and a pullback is become more and more probable…. \n\nI honestly wouldn’t be surprised regardless of what happens tomorrow with FOMC to see a decently red open Thursday and a decent pullback… SPY actually closed its 4th green day in a row which is something that has not happened since end of march/ beginning of April. \n\nSPY Daily Levels  \n Supply- 428.06 -> 429.13   \n Demand- 429.86 -> 437.87  \n Support- 435.22 -> 433.85 -> 430.9  \n Resistance- 436.7 -> 438 -> 440.5 -> 443.3\n\n\\*remember futures purposefully not included till Friday\\*\n\n**QQQ DAILY SUPPLY AND DEMAND** \n\n&#x200B;\n\nhttps://preview.redd.it/l12sskjotu5b1.png?width=975&format=png&auto=webp&s=14b8a43f5f6debdd3ee1fe8f58f84a6427d42eb6\n\nTaking a look at QQQ today we finally hit my upside bull target of 361.7 and have officially taken that very old demand out… from here our next upside target realistically is the 369.32 to 371.41 supplies. \n\nIf we find a big bounce up tomorrow our target should be 369.32. However, with daily DMI completed to the upside and rejecting the red bull channel resistance we could actually look for a retrace to back test support at 360.5 and 357.09. \n\nDepending on what happens tomorrow QQQ is set up to put in a new daily supply (resistance) off this daily candle at 363.26… that would open up the opportunity to come back and test 357.09 and 354.95 to take out those supplies and retest the daily 8ema before putting in a new demand (Support)… \n\nQQQ Daily Levels  \n Supply- 354.95 -> 357.09 -> 369.32 -> 371.41  \n Demand- 349.06 -> 347.93\n\n**VIX**\n\n&#x200B;\n\nhttps://preview.redd.it/xo6ntu0ptu5b1.png?width=975&format=png&auto=webp&s=689bb8afe3e01c09ecc97560e3e2bcabb3b49f87\n\nNow on the daily VIX here we did close out a nice double top and rejection off the daily 8ema at exactly 15. \n\nIf the VIX was to fall tomorrow we most probably would put in a new daily supply at 15… which would open up an opportunity for the VIX to drop back to that 13.62 demand…\n\nI have a theory and its complete tinfoil permabull fuel type of stuff…. I was thinking about it and clearly market wants to go up and clearly its not sensible long term to fight this bull trend… so I was thinking the fact that the VIX was at precovid lows and back in the 13s really made it difficult for the VIX to go much lower which really makes it difficult for SPY to go much higher… what if with CPI and FOMC back to back and a nice pump on the VIX… that this is the vehicle SPY needed to pump to 440-450 now…\n\nThink about it… SPY loves to unwind with the VIX and despite an 8% pump yesterday SPY did not drop lower… what if not when the VIX unwinds back to the low to mid 13s SPY finally has the momentum to push this to that 450 area? \n\nJust a thought… \n\nHowever then I take a look at the FG index and I see it sitting at 80… the 2nd highest level its been in the last year… Actually since July 2021… the FG index has only seen 80 or higher two times now. \n\nLets take a look at that once again…\n\nNovember 9th 2021 the FG hit 77 and SPX was $4685… SPX then fell to a low of $4513 and an FG index of 25 on December 1st. That would be a 3.8% drop. \n\nDecember 1st 2022 the FG hit 76 and SPX was $4077… SPX then fell to a low of $3850 and an FG index of 37 on December 29th 2022… That would be a 5.9% drop.\n\nFebruary 1st 2023 the FG index hit 82 (the highest level in the last 2 years) and SPX was $4119… SPX then fell to a low of $3856 and FG index hit 23 on March 13th 2022… that would be a 6.8% drop.\n\nSo on average over the last two years when the FG index has peaked at these levels… SPX has seen a 5.5% drop over 19 trading days… \n\nThat COULD mean if we are peaking here at FG 79 and SPX $4369 then we COULD see a drop to $4128 or SPY $412.5 by July 12th… However, if SPY pumps to $440 tomorrow that could look more like SPY $416… \n\nThis all plays into my theory that tomorrow FOMC will be a local top and Thursday minimally (perhaps Friday) could be a juicy retrace… \n\n**DAILY TRADING LOG** \n\n&#x200B;\n\nhttps://preview.redd.it/xyv8utnptu5b1.png?width=859&format=png&auto=webp&s=8773fa96e010ce623eefd78ce43209b6e4f7ea99\n\n(note that last call on SPX was a 1dte not sure why it says 2 thats an error)\n\nI am actually incredibly pleased with myself today and my trading results… I pretty much went into today thinking that “this retrace is an opportunity to go long on a call” now of course I took some puts and I did win nicely on some of those puts… today was low % win types of day because 0dte premiums were so high in the AM and then when you switch to 1dte your premiums are so juicy you don’t see much of a win… \n\nOverall though a great day of trading where I was able to make up all of yesterdays losses and then some… \n\nI have said it before and ill say it again… risk management is the key to success and profitability… Yesterday I struggled for sure and had a red day… however, I was able to successfully manage and mitigate those losses to the point where one trading day got me back to green and back up over my daily profit goal (if you subtracted yesterdays losses from todays wins). \n\nI look forward to trading tomorrow and some of the volatility that will follow with that!", "id": "148qba9", "created_utc": 1686692164.0, "score": 185, "upvote_ratio": 0.95, "num_comments": 171, "comments": [{"body": "My money is on a pause but Hawkish JPow, mention of data driven future hikes, admittance that they’re not happy with the core CPI print, and re-emphasis of no rate cuts this year.\n\nI can’t imagine that after yet another high core print the fed is very happy with the current situation.", "score": 76, "replies": [{"body": "Im very curious what he is going to say.", "score": 22, "replies": [{"body": "I really think the student loan payment pause ending is going to have a major impact on inflation. People are going to stop spending as much and also take money out of the market to use to make payments. It will also cause average credit scores to drop if they miss payments which will reduce their access to credit.", "score": 36, "replies": [{"body": "I hear a lot of people mentioning the student loan repayment starting, but there is a scenario where Supreme Court clears the way to wipe out up to 20k for majority of borrows. In that case more money for people to blow on shit. The decision should be sometime within this month supposedly.", "score": 12, "replies": [{"body": "Borrowers arent repaying student loans now, forgiving 20k wont magically create more money for them", "score": 5, "replies": []}, {"body": "They can give their decision at any moment now, but they have to by the end of the month.  Sadly, they often drag their feet even if they have a decision in hand and do not release it until end-of-month.", "score": 2, "replies": []}, {"body": "That cost gets passed onto the tax payers though?", "score": -4, "replies": [{"body": "There plenty of taxes that can be raised at the top. Just today someone on this sub wrote about a proposal to increase captains taxes on those top investment earners.", "score": 3, "replies": [{"body": "So politicians? That'll go well", "score": 1, "replies": []}]}]}]}, {"body": "I don’t think the people who don’t have money to pay their loans are even invested in the market", "score": 9, "replies": [{"body": "that doesnt mean that the market wont be impacted by this.", "score": 2, "replies": []}, {"body": "You're right,  the majority don't have the money to pay on loans because they been buying houses, and cars, and a whole lot of non essential things the last 4 years. They are wondering where their stimulus check is. The debt is out of control and I think we will be seeing more bank runs. I don't see why people wrote off banks being put in their rightful place", "score": 5, "replies": []}, {"body": "I know many professionals who could pay that just haven't. Why pay if you're not accruing interest?", "score": 1, "replies": [{"body": "I work in healthcare. Everyone I know who wasn’t paying was doing it because they’re underpaid. No one was buying houses and cars.", "score": 1, "replies": [{"body": "Sure but that's just your exposure.  There are plenty who can pay out there", "score": 1, "replies": [{"body": "I get that, but the guy who said people were buying homes instead of paying student loans lives in fantasy land.", "score": 1, "replies": [{"body": "Some people are. My friends for example.  Not everyone is in the same predicament", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Spenders are not only people with student loans", "score": 3, "replies": []}, {"body": "We’ll also find out end of the month if SCOTUS is going to let Biden cancel a ton of student loan debt or not just ahead of the repayment pause ending.\n\nI’m still not a fan of how this “pause” or “skip” was communicated.  They should have said they were still in hiking mode, but hiking every other meeting for now to slow the pace of hikes and that they were only going to be data dependent insofar as they would obviously use the data to help them determine when they were sufficiently restrictive and had inflation trending back towards 2%.", "score": 1, "replies": []}, {"body": "such population is inconsequential in general. Apple might feel a lil pinch when these bums dont have money to blow up on new iphones but thats about it.", "score": 1, "replies": []}]}]}, {"body": "The core data is being absolutely held up by shelter inflation.\n\nTheir favorite new fad \"super-core services\" is currently flat from January. In fact, its behavior YTD perfectly tracks pre-pandemic years and is consistent with 2% inflation.\n\nMore rate hikes are unlikely at this stage. Powell does not want restrictive monetary policy for any longer than absolutely necessary.", "score": 9, "replies": [{"body": "Super-core is remove oil(gas, cooking etc), shelter and food. I mean why not remove everything and say we have 0 inflation. \n\nTaking out oil or using multi year mean works but wtf is super-core?", "score": 3, "replies": [{"body": "The Fed is lasering in on that metric because they, mistakenly I might add, believe that wage pressures are causing inflation in core services ex housing. \n\nThey are looking for an explanation besides greed, but it doesn’t exist.", "score": 6, "replies": []}]}]}, {"body": "Yeah if they pause something it’s already breaking. Absolutely no reason to pause right now, guess we’ll see which jpow we get.", "score": 21, "replies": [{"body": "There are plenty of reasons to pause. For one thing, fighting inflation inherently means demand needs to go down. The thing is that their short rate tool is a blunt instrument. Recessions and downturns are non-linear. They are looking for demand moderation, not demand destruction.\n\nSubstantially hiking from here is completely unwarranted as it will impact the second leg of their dual mandate: maximum employment.", "score": 6, "replies": [{"body": "His puts don't approve of your rebuttal", "score": 1, "replies": [{"body": "Puts were the move in 2022, not 2023.", "score": 1, "replies": []}]}, {"body": "Powell said he's happy to see unemployment 4% and a little bit higher. The fed do want demand destruction and they need it fast. They have already several times said about housing, wage inflation etc being problematic. He wants unemployment a fair bit higher. He wants wage inflation to stop and spending to stop. It's better to go too far than not fair enough because oil will rise into the summer due to demand and inflation will just come right back. \n\nYou also have wealth effect of the market causing further inflation due to perception of being wealthier due to market rocketing up all year. If you take energy out thr only thing that has dropped in core is used cars by just-4%. \n\nFood at home and away from home are both up huge still at 5% and 8% respectively this isn't acceptable.", "score": 1, "replies": [{"body": "It is absolutely not better to go too far. The Fed is significantly more scared of deflation than they are scared of inflation. Rebooting demand is extremely difficult. That is why the 2008 recovery took so long. Deflationary spirals are a central banker’s worst nightmare. \n\nThey want the soft landing. More hikes kill that. I actually think they are done. If they can keep things as they are right now, inflation will be in the low threes by EOY.", "score": 2, "replies": [{"body": "No headline inflation will be low 3s. Core inflation has not moved much at all. There is no such thing as a soft landing it's bullshit. You can almost never lower inflation with a strong labour market like this they need something to break. Headline inflation is an absolute nothing burger. Fed themselves said they absolutely do not look at it only core. Core is not higher than headline which signals stagflationary environment. This is also bad. Fed needs to keep going break something and rebuild again. \n\nOil dropping from 120 a barrel to the mid 60s is the ONLY reason headline inflation has moved at all. In fact the only thing that has moved down outside of energy is used cars by just -4%. Everything else is up. House prices, shelter, food at home and away from home. We now move into high demand oil season with opec cutting production. What do you think happens next when oil moves back to around 80 a barrel?", "score": 1, "replies": [{"body": "Shelter inflation lags by a year. That is what is keeping core up at the moment. It is the same reason that inflation did not really appear until 2022. Inflation was underreported in 2020 and 2021 and is over reported now. \n\nLook at higher frequency measures of shelter inflation and you will see the swan dive it is on. CoreLogic, ApartmentList, and Zillow all point to significant moderation of rent pricing since end of last year.", "score": 1, "replies": [{"body": "It's not just shelter. Food is up both at home and away from home. We are not seeing the situation you describe where shelter is the only thing up. \n\nYou also omit that energy is the reason core isn't much much higher. Moving into high demand energy season.", "score": 1, "replies": [{"body": "Food and energy are not part of the core index the Fed is watching.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I doubt he’s gonna come out Dovish, banks on and off the ropes due to interest rates but MoM inflation has stagnated. In a few more months we’re gonna hit the start of the downtrend from the last peak and I think we’ll start seeing CPI YoY bottom out/start to come back around. I remember reading somewhere about how these larger inflation fights result in CPI prints coming in waves due to it being looked at on an annual basis. So without a decreasing MoM, idk how we’ll break through to their target.", "score": 10, "replies": []}]}, {"body": "They ain’t pausing shit. There is no reason to pause. They need at least 1 more hike and they will do it. The job is not done.", "score": 6, "replies": []}, {"body": "What happens to inflation with all the money we’re about to print?", "score": 2, "replies": []}, {"body": "The student load will have a great impact on the inflation of the economy. The government should do something about it, because it can be a good decision or bad.", "score": 1, "replies": []}]}, {"body": "Don’t forget SPY closed at 436.66 today. 4+3=7 or completeness and 666 = doom. 4+3+6+6+6= 25 or 25 bsps hike. \n\nThus using my utmost regarded strength I predict a 25 bsps hike tomorrow that spells complete doom for the markets", "score": 71, "replies": [{"body": "Add me in the pic if this come true. ![img](emote|t5_2th52|4276)", "score": 13, "replies": []}, {"body": "[666??...............oh god...ITS HAPPENING AGAIN................BLAAGGGG HAA BL BLPPPPPPPPPP I FEEL YOU FATHER!!!](https://youtu.be/wI2gi9N7w5Q?t=172)", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|12787)", "score": 3, "replies": []}, {"body": "This is  the best TA I read.", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|27189)", "score": 1, "replies": []}, {"body": "Lay off the pot, Dave.", "score": 1, "replies": []}, {"body": "If there is 25bps it will be a huge rally! Because it implies no more rate hikes and cuts as soon as next or following FOMC.\n\nSkip and higher for longer is the ultimate scary shit!", "score": 1, "replies": []}]}, {"body": "Also another interesting fact that’s extremely rare. It’s been 14 weeks without a 1% pull back.", "score": 24, "replies": [{"body": "When was the last time that happened?", "score": 6, "replies": [{"body": "I gave up scrolling through data is how long haha 😂", "score": 15, "replies": []}]}]}, {"body": "you know what, you guys have convinced me...im rolling my puts to 2025, because they are absolutely gonna get fucked in the mid to short term", "score": 32, "replies": [{"body": "bad idea..without rate cuts this market has nowhere to go but down, also rolling in general is a bad idea.", "score": -16, "replies": [{"body": "Ha ha ha ha", "score": 11, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 9, "replies": []}]}, {"body": "tarded or bot?", "score": 1, "replies": []}]}]}, {"body": "You had me at \"I have a theory and its complete tinfoil permabull fuel type of stuff\", I'm in", "score": 14, "replies": [{"body": "Lmao good", "score": 3, "replies": []}]}, {"body": "Calls it is ![img](emote|t5_2th52|4276)", "score": 24, "replies": [{"body": "Username checks tf out", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}, {"body": "I have both calls and puts so I can lose regardless of which direction it goes", "score": 22, "replies": [{"body": "Amazingly I have lost on bith", "score": 3, "replies": []}, {"body": "Sideways it is", "score": 2, "replies": []}]}, {"body": "Core inflation doesn’t matter. All that matters is the narrative.", "score": 8, "replies": []}, {"body": "This market is really frustrating to trade it at the moment because 1) either i close my calls to soon or 2) enter my calls too early and get wrecked.\n\nHonestly the FOMC might be a nothing burger, so not having any expectations. However i am bullish and bought the dip on AMD. Will see how that plays out.", "score": 9, "replies": [{"body": "Me too, went in heavy on 6/16 128 calls at the close but am worried it might have been a buy the rumor sell the news thing and it pulls back to 118 by end of the week. Oh well.....", "score": 5, "replies": [{"body": "I think you got a good entry and good chance to profit. I entered horribly in the morning and down 50% at close lol i might average down only if the previous day low holds and we either consolidate and start grinding higher.", "score": 0, "replies": []}, {"body": "Surprisingly held amd held up well today and nvda just ripped all day again 😂. I think tomorrow amd will uptrend all day. Didn’t sold my calls yet, I added to my position on the dips today.", "score": 1, "replies": [{"body": "Well, I chickened out after the FOMC drop and sold it EOD, afraid to hold it overnight. I felt daddy’s speech was hawkish and while the markets brushed it off today, reality could set in overnight and tomorrow could be a big red day, like what happened the day after December 2022 FOMC…Made a good return and didn’t want to push my luck. Best wishes to you though !", "score": 1, "replies": [{"body": "Now that you sold we will for sure retest 132 by Friday. I appreciate your service lol", "score": 2, "replies": [{"body": "You are welcome 😂", "score": 1, "replies": []}]}]}]}]}, {"body": "Definitely gotta be perfect on your timing now a days", "score": 3, "replies": []}, {"body": "Are you trying to scalp really low timeframes? Not sure how anyone is losing buying calls over the past week regardless of expiration. Every dip gets gobbled up and price grinds higher.", "score": 1, "replies": []}]}, {"body": "Well this was some good bearish copium. Thanks", "score": 22, "replies": [{"body": "We all need the copium sometimes", "score": 2, "replies": []}]}, {"body": "I think we continue going higher because of [my magic trendlines. SPX 4410 should be top.](https://i.imgur.com/xqihHJl.png)\n\nWhat's interesting is we started this week by pumping out the gate. Past 8 weeks or so, Monday- Wednesday is pullback/chop and pump on Thursday and Friday. Possible market zags and sells eow,  while retail thinks it continues zigging . I'm trading light as I don't know where the ride ends on this blow off the top run", "score": 7, "replies": [{"body": "That is my thoughts", "score": 2, "replies": []}]}, {"body": "Gonna pump hard af tmrw to 345", "score": 19, "replies": [{"body": "345 would be awesome", "score": 23, "replies": [{"body": "That’s a trend day.", "score": 3, "replies": []}, {"body": "Wait, so probable Red Open tomorrow?! …till Thursday Open?!\nOr Red Day Thursday Open? \nMight have to dump some SPy entries", "score": 2, "replies": [{"body": "80% probability of a red open tomorrow", "score": 6, "replies": [{"body": "Tomorrow is the 20%. Although, I am less confident about the open price, we will be green before Powell speaks.   \n&nbsp;  \nPump on official confirmation of rate hike pause, dump on Powell still not sounding very happy.", "score": 2, "replies": []}]}]}, {"body": "Market is irrational now, too many bears", "score": -9, "replies": [{"body": "Too many bears? Where have you been? Lol calls out weight puts. We’re in extreme greed on the Fear and Greed Index and people are FOMOing into tech stocks. Too many bears? ![img](emote|t5_2th52|4271)", "score": 28, "replies": [{"body": "People are only fomoing into tech, every other sector has been flat, everyone expects a crash in tech and it’s just not coming", "score": -3, "replies": [{"body": "My friend, wtf you mean every other sector flat? IWM, XLU, other sectors have all been climbing recently. Bruh… lol", "score": 5, "replies": []}]}]}]}]}, {"body": "I would bet against majority though. 🤣", "score": 1, "replies": [{"body": "Probably right", "score": 1, "replies": []}]}]}, {"body": "Abandoned baby pattern, haha that is a great term lol. Nice write up. I got some puts for Friday. I hope we do open up red so I can exit a few and maybe rebuy if we rise up going into the meeting for a discount. \n\nI feel like no matter what is said we are selling off into Friday and next week. I’m gonna try and catch the Tsla pump with a few puts too.  Markets on meth, who knows when it will pull back some. I hope to catch it and maybe this will be the narrative to make it happen.", "score": 9, "replies": [{"body": "I like a Thursday pullback and possibly Friday", "score": 7, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "5/19", "score": 4, "replies": []}]}]}, {"body": "My dad abandoned me as a baby so I think it’s a sign and went full port puts", "score": 2, "replies": [{"body": "I’d abandon my son if I thought he’d grow up to buy puts too", "score": 1, "replies": []}]}]}, {"body": "I really enjoy reading your DD every time.  And I this way of journaling freely with us must surely help your trading ;)   Keep up the good work !   \n\n\nI'm curious though, what is your indicator for all those supply and demand levels ?", "score": 9, "replies": [{"body": "Its proprietary", "score": 3, "replies": [{"body": "Does it work on higher time frames ?  For swing instead of intraday ?", "score": 4, "replies": [{"body": "Its how i trade everday and its been incredibly profitable", "score": 5, "replies": []}]}]}]}, {"body": "the roaring 20's are back bitches", "score": 14, "replies": []}, {"body": "How do you find the supply and demand levels?", "score": 4, "replies": [{"body": "I have a proprietary indicator that i use to make them", "score": 2, "replies": []}]}, {"body": "First of all, I applaud your efforts and insight sharing, and I hope we have a chance to discuss CPI in the future because I have a different opinion from you.\n\nI also think there could be adjustments to cool down this overheating of the market because it is currently overbought by many indicators.\n\nHowever, I think the adjustment may be a price adjustment by selling volume, but it may be a period adjustment that takes time while receiving the selling volume at the appropriate level. I think the latter is worse because what traders like us need is volatility.\n\nBecause I think investment is a psychological game, I think the timing of price adjustment is when big institutions like Morgan Stanley, a leading negativist, turn positive.\n\nOf course, I don't know exactly when it will be, but I'm keeping a close eye on it.\n\nAnyway, thank you again and wish you good luck and God bless you.", "score": 3, "replies": []}, {"body": "My theory is that right now we have alot of FOMO and there is a shit ton of money being moved into equities as nobody wants to miss out on the next big bull run.  Everything hinges on tech though, as that is where most of the money has been flowing into.  I'm beginning to think that the fact that people are running out of money and are expected to run out of their savings come July, is a nonfactor.  This is because they are small fish, no, little tiny plankton compared to the absolute behemoths that are moving into equities right now.   So just because Jessica and Andy can't pay their student loans and the program is being implemented to fuck them over, that will not have a short term impact on the markets.  What that will effectively do however is continue to erode the middle classes ability to spend on the things they already spend money on.  So less going out to eat, less travel, etc.  Basically a recession, but one that isn't going to really affect what the rich do or what they spend money on.  Corporations and rich people are richer than they've ever been and equities are the best place to put their money right now.  I can see this bull market lasting for another quarter until people realize the fed is going to be holding rates at 5.25% for a long time and companies start to reveal that their projected growth, which has already been priced in with their massive upswing in stock value, is not something achievable in the next few years.", "score": 4, "replies": []}, {"body": "CPI was not good at all, rationality says a solid case for a hike but chicken JPOW is going to pause and keep saying data dependent with no case for rate cut. this year. Buckle up for crash.", "score": 12, "replies": [{"body": "Agreed", "score": 3, "replies": []}, {"body": "But when? There’s no catalyst. I’m all for a good old fashioned buying opportunity (and to see my UVXY print), but what could trigger it other than a black swan?\n\nEdit: just re-read your post. You’re saying that JPOW’s hawkish stance might shake things up? I agree it’s a possibility", "score": 5, "replies": [{"body": "Without rate cuts its all doom because tighter credit conditions will only make the economy contract and if they cut rates then it will be for the wrong reasons a.k.a something already broke badly. Inflation is still very bad and  nowhere near that 2% number that joker JPOW was aiming for.  Labor market hasnt cooled a bit..irrespective of what the numbers say.", "score": 4, "replies": [{"body": "4% is nowhere near 2%?", "score": 1, "replies": [{"body": "If my math checks out,  4% is 100% away from 2%.", "score": 2, "replies": [{"body": "Wrong. It's 100% higher, but it's only 2% away.\n\nIt's like when you say \"membership doubled!\", but it went from 1 person to 2 people...In absolute terms, you still only added one person...", "score": 1, "replies": []}, {"body": "That's not how % variances work lol", "score": 1, "replies": []}]}]}]}, {"body": " Is this a hedge?  If so, just use SPY puts.  Just short UVXY to zero", "score": 0, "replies": [{"body": "It was more of an experiment. I started trading UVXY shares over the last year based on some rudimentary TA. I managed a decent profit, but missed my window to sell this time around. Worked well until it didn’t, as they say.", "score": 1, "replies": [{"body": "Yeah.  Best to short UVXY on every pop.  Reverse Split coming next Friday.   The term structure right now is looking great for a continued melt down", "score": 1, "replies": [{"body": "Oof. Not great for my shares. Might be time to cut losses.", "score": 1, "replies": [{"body": "Yeah, hope you cut your losses.. This thing is gift to shorts that never stops giving.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "CPI was 9% one year ago and is now 4%.\n\nHow is that not good?", "score": 1, "replies": [{"body": "Remember inflation never gets reversed so the prices are permanent", "score": 1, "replies": [{"body": "Yes, and 4% is better than 9% again.", "score": 1, "replies": []}]}]}]}, {"body": "TLDR: stocks go up….maybe", "score": 3, "replies": []}, {"body": "I swung calls and got out at +54% at market open", "score": 3, "replies": [{"body": "you bought or sold calls?", "score": 2, "replies": [{"body": "Bought", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|18630)", "score": 3, "replies": []}, {"body": "What’s your thoughts on buying a june 20 put at a strike of $433? can i pm you with more questions about it?", "score": 3, "replies": [{"body": "You can dm me yes.", "score": 1, "replies": []}]}, {"body": "Hey, this is good stuff. Thank you for taking the time to put it together.", "score": 3, "replies": []}, {"body": "i'd love to see like a recording of your trades in real time, that'd be awesome to see. Something a lot of idiot \"psychology trading\" and \"trading\" youtubers dont do, is stream/record their trades real time and explain their thought process while they're doing it. Your analysis is top notch brother, its very insightful and i enjoy the detail and seeing what youre thoughts are on these charts. I mainly scalp the Q's on price action, RSI, and gut being that i've focused on the Q's for the past couple years, but your daily trades look a lot like mine, i'd love to see videos of your trades in real time. \n\n&#x200B;\n\nAppreciate your posts as always brother.", "score": 3, "replies": [{"body": "I couldnt really show a full screen live video as some of the indicators i use are proprietary. \n\nBut i do share my entries and exits and what im thinking with then and what im seeing", "score": 1, "replies": []}]}, {"body": "I tried to day trade, I lost 20k over a few weeks, so I'm dead I don't know how your consistent nearly every trade I take is the wrong one", "score": 3, "replies": [{"body": "Hasn't always been green thsts for sure", "score": 2, "replies": []}]}, {"body": "I’m here again to tell you you’re wrong again for the third time. It’ll open and close green like the past couple times.", "score": 12, "replies": [{"body": "Even bull markets have small pullbacks", "score": 14, "replies": [{"body": "Not this one", "score": 1, "replies": []}]}, {"body": "I'm hear to tell you you cant read... \n\nFomc has only opened green one time in the last 5 fomcs... and has only closed green one time in the last 5 fomcs...\n\nAlso saying there is an 80% probability doesnt mean i for sure said it will open red....", "score": 10, "replies": [{"body": "…uuuuup, heres my answer", "score": 3, "replies": []}, {"body": "Absurdly small sample size, and during a period of consistent rate hikes... shouldn't be surprising that it's been red more than green on these days.", "score": 2, "replies": []}, {"body": "With all these analysis, let’s see how your trades do. Welcome to wsb. We all can’t read. Get rekt", "score": -34, "replies": [{"body": "I mean ive been profitable 11 weeks in a row now. So id say its going pretty well", "score": 9, "replies": [{"body": "Damn that’s a pretty subtle solid roast ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 7, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}, {"body": "Damn I’m only at six weeks in a row of straight profits and I’m having delusions of grandeur over here. My hats off to you, sir. I like reading your VIX thoughts, your posts made me look at it for the first time.", "score": 2, "replies": []}]}]}]}]}, {"body": "Lort I hope they hike 25bps", "score": 4, "replies": []}, {"body": "Nice review but , man, that chart of SP 500 average over last 6 FOMC meetings is just baloney.   \nYou can't make meaningful conclusion averaging over 6 data points.    \n6 overlaying graphs of different colors would be better.     \nAnd, it's probably my pet peeve from the training I got 35 years ago, line graphs without data points and error bars are just useless squiggles. Although, apparently, RH crowd loves them.  But don't mind me, you're doing great work.    \nI can appreciate data biased opinion, something to ponder about.", "score": 5, "replies": [{"body": "True but the last 6 fomcs have arguably been far different than the 6 before it... its definitely a trend.", "score": 3, "replies": []}]}, {"body": "You had me at “black bull” channel.  Call it is!!!!  🌈🐻s are fucked!", "score": 2, "replies": []}, {"body": "CORE - Cunts Orgasming Regularly Everywhere", "score": 2, "replies": []}, {"body": "🐻copium alert", "score": 4, "replies": []}, {"body": "Core CPI is high because of rents and used cars. Both of those things are caused by high interest rates, so no surprise it’s been sticky in a high rate environment. \n\nHigh rates take people out of the housing market and into the rental market where the increased demand drives up prices. High rates also take people out of the new car market and into the used car market again driving up prices. \n\nIf this is what the fed is basing their rate hikes on they’re caught in an infinite loop.", "score": 3, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "Preach! Finally.... high rates can also increase costs and temporarily not show the impact they're intended to have.\n\nWe just need to leave rates here, and with other macro-restrictive events we'll get to the promised land.", "score": 3, "replies": [{"body": "This is correct.\n\nMore hikes from here is dangerous.", "score": 1, "replies": [{"body": "Is that why every other country on earth is raising rates?", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Really? Because he’s pretty damn profitable almost every day. And his lines are almost always spot on to the penny. Let’s see you do better.", "score": 2, "replies": [{"body": "Haters gonna hate ![img](emote|t5_2th52|29637)", "score": 1, "replies": []}]}]}, {"body": "Not even a TLDR", "score": 0, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "It's solid and consistent gains nothing wrong there", "score": 10, "replies": []}, {"body": "$500 * 252 trading days is $126k/ year... \n\nPlus today i was up $1200 not $500...\n\nContrary to some beliefs around here... small consistent gains overtime add up far better than one big 200% win and 50 -100% losses. \n\nAlso im still way sized down about 50% of what i used to be...", "score": 9, "replies": []}, {"body": "Just $500.", "score": 3, "replies": []}, {"body": "So are you making a lot of money? Having a portfolio with huge swings isn't a good thing.", "score": 2, "replies": [{"body": "Well, unless you get one massive swing lol", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Well that's my point", "score": 3, "replies": []}]}]}]}, {"body": "Stonks only go up now. Burs ded", "score": -6, "replies": []}]}
