{"title": "Forbes - Walmart Says Ozempic Could Be Impacting Food Sales: ‘Slight Pullback In Overall Basket’", "selftext": "I wonder if these drugs become popular enough, could they have a bigger impact on big food and beverage chains DPZ, QSR, MCD, PEP, KO, etc.?\n\nhttps://www.forbes.com/sites/mollybohannon/2023/10/04/walmart-exec-reportedly-says-ozempic-could-be-impacting-food-sales-slight-pullback-in-overall-basket/?sh=2906bc3d66a7\n\n* Walmart is studying changes in sales patterns by looking at anonymized shopper data and comparing that of people who take a weight loss drug like Ozempic to people who don’t, but Furner said it’s too soon to draw conclusions.\n* The company is seeing “a slight pullback in overall basket” when looking at the consumer data, though, for people who take Ozempic, Wegovy or other popular weight-loss drugs, Furner told Bloomberg.\n* Furner said the pullback has been “just less units, slightly less calories,” Bloomberg reported.\n* Companies like Walmart are working to take stock of shopper trends for people on Ozempic as the weight-loss drug is only expected to continue its rise in popularity: Morgan Stanley is estimating that 24 million people—or 7% of the U.S. population—could be taking GLP-1 drugs by 2035.\n* In its September report, Morgan Stanley said the popularity of these drugs will likely have a stronger impact on grocery stores, while big box markets like Walmart and Target that sell “many product categories along with food will be better insulated.”\n\nWalmart U.S. chief executive John Furner said in an interview with Bloomberg on Wednesday that the company has seen “a slight change” in food purchasing habits of people taking Ozempic and other weight loss drugs compared to people who aren’t—as impacts of the popular medication seep into the corporate world.\n\nOzempic, Wegovy and other weight loss drugs that have risen in popularity in recent years cause weight loss by reducing people’s appetites. The GLP-1 drugs mimic a hormone that signals to one’s brain that they’re full, according to UC Davis Health. The drug has also decreased some patients' cravings to eat foods with high sugar or fat content, though, CNBC reported, which could cause problems for some food brands that have decided in recent years to lean into snacking while marketing their food. Food chains and companies producing junk food were predicted to be potential losers of the weight loss drug boom because of the decreased appetite for unhealthy foods, Markets Insider reported last week.", "id": "1702ble", "created_utc": 1696462266.0, "score": 568, "upvote_ratio": 0.91, "num_comments": 208, "comments": [{"body": "Maybe its the fact that prices for everything has shot up and we are buying less because it's considered frivolous", "score": 963, "replies": [{"body": "It appears that they’re controlling for people who are or have purchased ozempic in the past. \n\nThey know your credit card purchased 75,000 calories of food in January, and on Jan 31, you bought ozempic. For the next 31 days, you only purchased 60,000 calories of food. \n\nAt the same time, other people it tracked that bought 75,000 of food in January but did not buy Ozempic, also bought 75,000 calories worth of food in the next 31 days.", "score": 162, "replies": [{"body": "Maybe paying through the nose for Ozempic means they no longer have the money to buy 75,000 calories worth of food. That shit’s expensive.", "score": 142, "replies": [{"body": "I spend way less on food. Doesn't pay for the price of the drug, but it certainly subsidizes it.", "score": 19, "replies": []}, {"body": "There's less and less of that now.  Supplies were artificially limited to non insulin dependent patients plus the higher copays.  Diabetic patients are getting great coverage so it's not eating into their budgets like you think.", "score": 8, "replies": []}, {"body": "That doesn’t really make a difference to Walmarts analysis. They don’t care if you’re buying less calories of food because the drug is enabling that, or if you’re buying less calories because you can afford less calories. \n\nThe key correlation to them is “people who buy ozempic buy less calories of food (and this may hurt walmart revenues)”", "score": 4, "replies": []}, {"body": "And as soon as they stop taking it, they binge back the 15k per month they were missing.", "score": -7, "replies": [{"body": "Probably not. One of the side effects of glp1 drugs is that the stomach begins to get gastroparisis or slow emptying of the stomach. A few nights of that disease and you voluntarily give up eating at night.", "score": 12, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Gastro has been a side effect of t1 diabetes for a while. It is a few magnitudes worse than just heartburn. Waking up and needing to throw up in the morning cause your stomach does not digest food when the Vega nerve works when it wants too. High fat foods or very acid foods trigger it more. I’ve cut back about half my food at night because of it. I was on mounjurno for about a year or so. \n\nAZN makes omeprazole which works for me to keep acid down. Lots of generics so I doubt it is a cash cow for AZN. \n\nI have a 1-2 on a scale of 10 for my gastroparisis and it is no joke. Just read some of the patients in the subreddit it ruins life. I’d link it but on a phone and not sure I am spelling th e disease correctly.", "score": 5, "replies": [{"body": "Omeprazole is a PPI which has it's own host of long term problems as well.", "score": 2, "replies": []}]}]}, {"body": "We need calls on whatever deals with that. Because there are a lot of heart burn sufferers that can't resist eating at night.", "score": 1, "replies": []}]}]}, {"body": "They did this in Europe, where consumers don't have to pay millions for Ozempic.", "score": 1, "replies": []}]}, {"body": "Am I the only one concerned that Walmart is using medical data to examine other purchases?", "score": 10, "replies": [{"body": "Not really, but there’s not much you can do with it under current privacy laws. Assuming they followed the appropriate measures around anonymizing the data and working with above-board data brokers, they don’t know anything about “you”, they just know things about “people like you”\n\nIt’s basically how any large data analysis with Big Data works. \n\nIf they didn’t follow appropriate laws, sure they should be punished, but this isn’t particularly new capability they’re demonstrating. \n\nI’m far more concerned with the data profiles that can basically track where I live and go every day, and send me special coupons based on walking within 10ft of a store.", "score": 2, "replies": []}]}, {"body": "You are asking people to actually read past the headlines. This is the same as when the posts about shoplifting forcing stores closed and less profits and then you read, buried in the 15th paragraph, that shrinkage rate has been about the same since 2019.", "score": -4, "replies": []}]}, {"body": "Toast got downgraded earlier this week for this same BS Ozempic reason, these people are so out of touch with reality", "score": 19, "replies": []}, {"body": "Grocers follow a unique supply and demand pricing model. If demand goes up, prices go up. If demand goes down, prices go up.", "score": 25, "replies": [{"body": "I think the healthcare industry is on that same pricing plan!", "score": 3, "replies": []}, {"body": "That's partially true. There is [demand pull inflation](https://www.investopedia.com/terms/d/demandpullinflation.asp#:~:text=Demand-pull%20inflation%20is%20a,most%20common%20cause%20of%20inflation) and [cost-push inflation](https://www.investopedia.com/terms/c/costpushinflation.asp). Demand changes very slowly for groceries; the most recent rise in grocery prices was due to cost-push inflation which is why although revenue has gone up for grocers such as Walmart, [profits margins haven't really changed.](https://www.statista.com/statistics/269414/gross-profit-margin-of-walmart-worldwide-since-2006/)", "score": 1, "replies": []}]}, {"body": "No, it's the Ozempic users that are wrong!", "score": 14, "replies": []}, {"body": "wal-mart is far cheaper than traditional grocery stores in my area (publix, kroger, ingles, etc) and their produce selection tends to be fresher from turnover. Its easy to do product comparisons.   \n  \nplus the nearest one has both health and veterinarian service and damn, they are seriously well priced.   \n     \nhowever they do tend to lose out to Aldi by a good margin when it comes to staples", "score": 3, "replies": [{"body": "It is? Here in Vegas, walmart prices are as high or higher than Winco, Target, Smiths and Vons. And not just on food, I mean about everything they sell. Especially food and automotive stuff.", "score": 3, "replies": []}]}, {"body": "Yeah, like what kind of BS excuse is this? They think most of America is on Ozempic? Especially Walmart shoppers? lol", "score": 14, "replies": [{"body": "No, they think people who use Ozempic are purchasing less food and that by 2035 about 7% of the country could be on these drugs.", "score": 42, "replies": [{"body": "Omg there won't be obese people in 2035. It's the end of the world. It's all get c's fault for lack of obese people.", "score": -14, "replies": [{"body": "Do you have some type of personality disorder?\n\nIt’s just an informational article trying to predict changing trends. Food for thought. There’s no doomsaying or panicking.", "score": 6, "replies": []}, {"body": "It just means they'll have to think a bit strategically about it.  To quote ~~Diamond Joe Quimby~~ Walmart executive \"If that's the way the wind is blowing, let now one say I don't also blow.\"", "score": 2, "replies": []}]}]}, {"body": "They did a study where they compared shopping habits between people on the drug and people not on the drug. They said it’s something they’ll need to watch, not sure where the excuse is.", "score": 4, "replies": []}]}, {"body": "Maybe inflation will solve our obesity epidemic.", "score": 6, "replies": []}, {"body": "No, it couldn’t be price gouging by corporations, it must be the ozempic!", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "They're not saying it makes a dent in national sales.  They're just saying they studied Ozempic vs non-Ozempic shoppers and the Ozempic shoppers buy less food.  End of story.", "score": 1, "replies": []}]}]}, {"body": "people that can afford ozempic not shopping at Walmart", "score": 373, "replies": [{"body": "There are people whose insurance covers it (i guess for diabetes?)", "score": 47, "replies": [{"body": "Some insurances will cover it if you're morbidly obese to the point where you're pre-diabetic. But for the most part, people pay out of pocket (like $500 to $1500 a month) for these drugs.", "score": 6, "replies": [{"body": "$500-$1500 to be less fat (if you have the disposable income) is not a bad deal at all", "score": 6, "replies": []}]}, {"body": "Super rare. \n\nI have some of the best insurance you can get, but they still won’t cover it unless it’s a life-or-death thing. Out of pocket costs would be about $1500, with a $300 rebate.", "score": 6, "replies": []}, {"body": "*diabeetus", "score": 10, "replies": [{"body": "Check your blood sugar. And check it often", "score": 6, "replies": []}]}, {"body": "Or Wegovy for obesity", "score": 1, "replies": []}]}, {"body": "it’s funny because it’s not that terribly expensive on the black market lol", "score": 30, "replies": [{"body": "Is it trustworthy to get on the black market though? I mean with how standard practice it is these days to add fentanyl to other drugs, there’s no way there wouldn’t or eventually be counterfeit ozempic also", "score": 20, "replies": [{"body": "Ozempic is just 30 amino acids stitched together in a specific pattern, it’s not that hard to make.\n\nhttps://rcs-research.is/product/semaglutide-glp-1-analogue-10mg/\n\nLots of sources for the research chemical, which is basically unpatentable. So it’s hardly even a black market, more of a grey market.", "score": 44, "replies": [{"body": "Speaking as a fat man, thank you for this information.", "score": 22, "replies": [{"body": "As a fellow fat man and taker of semaglutide, there are safer and more effective means of sourcing it than often-non-sterile compound pharmacies and research institutes selling semaglutide salts.", "score": 16, "replies": []}]}]}]}, {"body": "only about 250$ for a years worth (.5mg injected subq weekly)", "score": 13, "replies": [{"body": "That's an early dose. Most patients graduate to 1 and 2 mg weekly.", "score": 4, "replies": [{"body": "I was supposed to move up to 1mg but the pharmacies can't even get it in stock. It's been 5 weeks since my last dose.", "score": 1, "replies": [{"body": "Can you switch to Rybelsus? That’s what I did.", "score": 2, "replies": []}, {"body": "Try mail order pharmacies. \n\nOr if you are comfortable, you could hypothetically inject the 1.7mg pen into an insulin vial and then draw needles from that vial corresponding to what the dose should be. I am not recommending it, but people have done that before.", "score": 2, "replies": []}]}]}, {"body": "What, where?", "score": 3, "replies": [{"body": "“Naps” — I can’t directly say sources, but do some googling and Reddit searches with that term to figure it out.", "score": 2, "replies": []}, {"body": "i don’t think i can link it because they also sell steroids but it’s 400$ for 10x5mg vials", "score": 3, "replies": []}]}]}, {"body": "Is that from compounding pharmacies? What's the price like in the US?", "score": 1, "replies": []}]}, {"body": "I mean, the data is about people who do just that, so... you're wrong? Might not be representative of all ozempic users, but it's representative of the one's Walmart cares about", "score": 1, "replies": []}, {"body": "This is completely false.", "score": 2, "replies": [{"body": "ok", "score": 0, "replies": []}, {"body": "[deleted]", "score": -1, "replies": []}]}]}, {"body": "People taking weight loss pills are buying less food in an effort to lose weight. More news at 6", "score": 60, "replies": [{"body": "Seriously, this reads more like a sponsored ad for Ozempic.", "score": 4, "replies": []}, {"body": "If every person trying to lose weight, was also buying fewer calories, then everyone would successfully be losing weight.", "score": 2, "replies": []}, {"body": "Why are people buying weight loss pills? Sounds so ridiculous but typical american. Just buy less trash food and more nutritious and you lose weight and diabetes automatically. Your obesity and diabetes rates would probably be cut in half just by banning soda completely.", "score": -1, "replies": [{"body": "I'm Canadian so not sure why I am even replying you, but random dunking on the US like this annoys me to no end.\n\nOzempic is also available and prescribed in Europe where 59% of people are either overweight or obese. Maybe you  guys can start laying off the currywurst too.\n\nhttps://www.who.int/europe/news/item/03-05-2022-new-who-report--europe-can-reverse-its-obesity--epidemic#:~:text=The%20report%2C%20launched%20at%20a,overweight%20or%20living%20with%20obesity.", "score": 3, "replies": []}]}]}, {"body": "lol the average person  isn’t eating less because they’re on ozempic.. they’re eating less because everything is absurdly expensive", "score": 181, "replies": [{"body": "It appears that they’re controlling for people who are or have purchased ozempic in the past. \n\nThey know your credit card purchased 75,000 calories of food in January, and on Jan 31, you bought ozempic. For the next 31 days, you only purchased 60,000 calories of food. \n\nAt the same time, other people it tracked that bought 75,000 of food in January but did not buy Ozempic, also bought 75,000 calories worth of food in the next 31 days.", "score": 27, "replies": []}, {"body": "Source? Because the article above refutes what you said.", "score": 11, "replies": [{"body": "Source is having the ability for rational thought and common  sense", "score": -14, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 28, "replies": [{"body": "Walmart is the main partner in clarusone with McKesson. So they probably see the total amount of ozempic through all the major distributors they buy from.", "score": 14, "replies": []}, {"body": "I wonder this, too. Medical data is strictly regulated by laws (at least in my country).\n\nThere may be people who give medical data to walmart to get some payback shit but many will not or even buy at walmart", "score": 8, "replies": [{"body": "Places like kroger have your info and can cross-correlate using your shopping card (nowadays almost every discount in the weekly ad requires a stupid coupon. It makes you clip the digital coupon and use your shopper card when checking out). When buying medicine you also use your shopper card, so i can 100% see then using that data.\n\nWalmart, however,  doesn't require using a shopper card (they do have walmart pay, but i believe not many people use it. It serves as a ahopper card and payment card).", "score": 7, "replies": [{"body": "Yeah it wouldn’t be that hard to figure out who’s on it and who’s not.\n\nI’m sure Facebook could create a bucket of “Ozempic users vs non-users” for advertising purposes.", "score": -1, "replies": [{"body": "It absolutely could not on its own. You could, in theory, upload a list of people with prescriptions to see if the platform could match your user data to meta accounts to create an advertising audience, but it would still be anonymized and you’d probably get <50% match rate", "score": 1, "replies": [{"body": "The platform that magically gives me ads for things I’ve just talked about and have never google searched? That platform?\n\nThat platform can’t figure out that I’m on Ozempic after I’ve probably searched for a bunch of related terms and adjusted my food intake and other habits, generating a stream of data in the process?\n\nOkay it’s gonna have an error rate, but I’m sure they’ll have a crack at it. Especially if they can include data from other sources, such as credit card data.", "score": 8, "replies": []}]}]}, {"body": "They do it by credit card numbers", "score": 1, "replies": []}]}, {"body": "It’s not medical data. It’s distributor data. Rite Aid, Walmart, CVS and Walgreens are the largest buyers from the rx/gx distributors (CAH, ABC, MCK). They form several different buying groups like Clarusone and red oak which give Walmart insight into the total amount sold everywhere- not the associated customer data which they would only have on their own customers.", "score": 2, "replies": [{"body": "Thanks for the information, I have to dig deeper but it's too late today for me.\n\nI still don't understand how\n\n&#x200B;\n\n>Walmart is studying changes in sales patterns by looking at anonymized shopper data and comparing that of people who take a weight loss drug like Ozempic to people who don’t,\n\n&#x200B;\n\nworks. So walmart has anoymized customer shopping data without data about medication. Then we have data feeds from rx/gx-distributors (Pharmaceutical branded=rx; Generic=gx  , I had to lookup this). How do they measure the amount of customers who use the med? \n\nOr is it a more generic approach, where the data feed contains the location of distribution, the anonymized walmart data contains the residental area and they put this together.", "score": 3, "replies": []}]}]}, {"body": "You should look in to data brokers. The information they have and market “anonymized” is frightening. It’s perfectly plausible that Walmart data analysts themselves or in partnership with a third party, bought or got access to “anonymized” data about ozempic purchasers. They then combined that with their own data that tried to match Walmart users with those data profiles and did this study. \n\nSimple way of doing it would be to give a large pharma or insurance company a bunch of money and access to the Walmart data and say “tell us what correlations you see”", "score": 3, "replies": []}, {"body": "I'm guessing credit card data, loyalty card or member data?\n\nThey have a pharmacy there too.", "score": 2, "replies": []}]}, {"body": "Stupid fucking article -there’s not enough people taking weight loss drugs to have a mass effect on sales. Get the fuck outta here. \n\nMan I’m sick of this shit. \n\nInflation is like 50% or more on some food. \n\nPEOPLE CANT FUCKING AFFORD TO BUY YOUR STUPID OREOS AT 8$ A PACK.", "score": 129, "replies": [{"body": "Don’t buy 8 dollar Oreos. You don’t need this, ever!", "score": 12, "replies": [{"body": "LOL I dont.  Just making a point about pricing on items. Its absurd.", "score": 0, "replies": []}]}, {"body": "The excerpt said its visible in people taking the drug. Walmart viewed the carts of people taking the drug already and saw the purchase reductions there", "score": 30, "replies": [{"body": "But how many people are taking the drug? If 0.25% of their customers start buying 12% less junk food, that's not an industry-shaking change; that's a PR clickbait headline.", "score": 5, "replies": [{"body": "Which is exactly what this is", "score": 2, "replies": []}]}, {"body": "That seems like a wild misuse of their pharmacy data and potentially a Hipaa violation, if they are specifically accessing and following ozempic users' grocery habits and can identify them by their medical issues.", "score": 16, "replies": [{"body": "It’s anonymized so likely a situation where it’s legal, if ethically dubious", "score": 30, "replies": [{"body": "yeah definitely legal, research teams i’ve been on (albeit healthcare research not consumer preferences) have had anon access to ridiculous amounts of data, as long as you can’t identify who any one person is it’s mostly fine", "score": 20, "replies": [{"body": "Have also done a TON of similar work. Legal as long as it can’t be tied to a persons true identity. Lots of smoke and mirrors inbetween the raw data & what gets analyzed.", "score": 1, "replies": []}]}]}, {"body": "You know those consents to aps or sites on your phone - if you read them most access and sell your data.", "score": 3, "replies": [{"body": "Yes but you can't get away with violating the law by getting someone else to sign a contract granting them permission to violate the law.", "score": 2, "replies": [{"body": "It's not a violation in other countries, I mean look at Facebook, Google, and Tiktok. All your data is already out there.", "score": 1, "replies": []}]}]}, {"body": "Damn you should email Walmart and let them know asap!!!", "score": 4, "replies": []}]}]}, {"body": "Eggs $1.80 18 count. \nButter $3.78 a pound \nRice $3.34 five pounds \nPotatoes $3.87 five pounds\nFlour $5.63 eight pound bag\n\nAnd so on, what are you talking about? Healthy food is cheap and plentiful.", "score": 6, "replies": [{"body": "He doesn't want healthy food he wants food that enables his lazy lifestyle.", "score": 1, "replies": [{"body": "He wants to eat the american dream. Chips, Soda and Burgers that is.", "score": 1, "replies": []}]}]}, {"body": "Lays are $7 a bag. I haven’t even been down the chip aisle in ages. That plant strike worked out well for all parties to ensure a mutual demise.", "score": 14, "replies": [{"body": "That's an insane price. They're 25,50 SEK (about 2.50 USD) here in Sweden. Why have your potato products inflated that much?", "score": 5, "replies": [{"body": "It's a big country. I paid $3 for full size lays here in America too.\n\nSome people live in NYC or San Francisco and pay massively inflated food costs and go online and complain. But you never hear the 98% of us living in other cities because we don't talk about our lower prices", "score": 8, "replies": []}, {"body": "It's mostly poor conservatives who bitch and moan about expensive transportation costs to deliver their junk food into the boonies.", "score": -1, "replies": []}]}, {"body": "Lays in Los Angeles are $4 a bag and $3 on sale which is 75% of the time in my experience. Not sure what you're talking about or why you're trying to mislead people.", "score": 1, "replies": [{"body": "You know there are other states in the union besides California, right? Ones with far fewer vehicular thefts and lower insurance costs.\n\nRight now a [12 oz bag of Cheetos](https://www.hy-vee.com/aisles-online/p/3317143/Simply-Cheetos-Puffs-White-Cheddar-Party-Size) is on sale for $5.89, normally $6.99 + ~7% food tax. Factor in the fact that Kansas is slowly sunsetting its food tax as of Jan 1 2023. This change happened because they began collecting ECI sales tax on all purchases through a [nexus agreement](https://www.taxjar.com/sales-tax/kansas). California's been skewering you on online tax collection for ages.\n\nNow, you're thinking Kansas - rural. Kinda, it's Lawrence - a liberal college town 30 minutes west of cheaper, conservative suburbs of KC. A population of ~100k that's had the [highest property tax growth](https://www2.ljworld.com/weblogs/town_talk/2022/aug/27/since-2002-douglas-countys-property-tax-rate-has-increased-70-states-other-largest-counties-up-8/) in the state. Property tax goes idealistic and impracticable solutions like serving as a magnet for homeless. Commercial real estate is happy to pass that cost onto consumers, plus these prices reflect outcome from the factory strike in [nearby Topeka](https://en.wikipedia.org/wiki/2021_Frito-Lay_strike).\n\nTLDR: ton of different factors that go into regional pricing. It's not always a rural Republican town either.", "score": 2, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "[Per capita in LA](https://fred.stlouisfed.org/series/PCPI06037) is worse than [Overland Park](https://fred.stlouisfed.org/series/PCPI20091). Try traveling more than just Vegas in a lifetime. I'm from Atlanta, grew up in the burbs, lived a decade in the city, I don't miss it. You'll learn more about tax blends - and their effects - once you explore the world around you.\n\nKC is [31st in metro](https://en.wikipedia.org/wiki/Metropolitan_statistical_area) just behind Vegas FWIW.\n\nEdit: irony of *from* didn’t dawn on me until just now. California now holds just 1/8 of US’ total population and I’m going to soak in the sun on my hammock here by making an educated guess not all 39 million inhabitants are naturalized or PR “Americans” per your statistic. Maybe 1-2 million of the population are underrepresented as Americans, so the metric gets reduced even further despite having the third largest landmass in the US.", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "More or less you applying some weird narrative to which I corrected your price and pointed out Kansas isn’t all wheat fields and cow farts. Source absolutely supports Angelenos have less income to go around than those in the wealthier suburbs of KC where chips are still godawful expensive despite lower gas costs.\n\nAs noted previously, chips are $7 here.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "i rotate my chip buying habits every week, depending on the sale at publix.  rotates between doritos, lays, ruffles, and cape cod.\n\nno brand loyalty, just gimme dat 2 for 7 or BOGO type deals.", "score": 1, "replies": []}, {"body": "You can get a bag of chips for 1€ in Germany (the cheap ones) and the more expensive ones usually cost between 1.50 - 2€. But then again our sizes are probably 1/4 of what you get in the US. Normal chips bag size here is 150g", "score": 1, "replies": []}]}, {"body": "They’re not saying all sales are down. They’re saying that people who buy that drug buy less than people who don’t.", "score": 11, "replies": []}, {"body": "9 million people on some form of genuine semaglutide, most of which are in the US... that's about 3% of the population. That's enough to be noticeable.", "score": 3, "replies": []}, {"body": "It's a marketing campaign appearing informative. No one's really cross referencing headlines.", "score": 2, "replies": []}, {"body": "But retail stores are having losses due to increased shoplifting, or is shoplifting not really that impactful either?", "score": -2, "replies": []}, {"body": "Calories get substituted, if they don't we have a famine.\n\nPeople will drink cups of vegetable oil before they lower their caloric intake.", "score": -2, "replies": []}, {"body": "Not yet…", "score": 1, "replies": []}, {"body": "yeah,I mean, people are fatter and lazier than ever. what makes anyone think everyone going to start caring about their health and fitness? junk food is here to tay", "score": 1, "replies": []}]}, {"body": "O, O, O prices too high", "score": 15, "replies": [{"body": "😂", "score": 6, "replies": []}, {"body": "you know oh ohhhhhh…", "score": 0, "replies": []}]}, {"body": "Ozempric is merely going to take yo-yo dieting to the extreme.", "score": 5, "replies": []}, {"body": "Short of this class of drug turning out to have some sort of long term detrimental effects, I can’t help but think this might be a real game changer. The majority of the healthcare costs in this country are due to the fact that we are fat as fuck as a nation. Diabetes, heart disease, obesity, and all the other complications that accompany being fat as fuck. The strain on everyone supporting all these costs is a big part of why healthcare is so expensive. (I know pharmaceutical companies and lobbyists are a huge part of that problem too, but we are all carrying the costs of all these enormous people waddling around jacking up everyone’s exposure when it comes to premiums)\n\nIf we can just magically eliminate that with a magic pill, that would mean enormous savings. I do feel a little pissy as someone who has always tried to be reasonably fit and responsible for my health, now any asshole can just be thin with a medication. Anyway it’s still all good.\n\nThen if we can curb our consumption as a nation that would be great environmentally as well. All the profits lost on food consumption will go someplace else, Americans need to consume, and if it ain’t Sonic tots and Walmart brand pringles knockoffs we will put that money somewhere equally dumb and keep the economic wheels greased.", "score": 10, "replies": [{"body": "Obesity healthcare costs are insane. Was just reading a paper earlier that individuals who are considered obese incur about 100% more in medical costs per year.  I want to say it was ~$2800/yr for Medicare/caid and ~$2050/yr for private insurance with it being ~$2500 on average. This was data from 2001-2016 from Meps.\n\n[Source](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10394178/)\n\nAbstract Results\n\n>Adults with obesity in the United States compared with those with normal weight experienced higher annual medical care costs by $2,505 or 100%, with costs increasing significantly with class of obesity, from 68.4% for class 1 to 233.6% for class 3. The effects of obesity raised costs in every category of care: inpatient, outpatient, and prescription drugs. Increases in medical expenditures due to obesity were higher for adults covered by public health insurance programs ($2,868) than for those having private health insurance ($2,058). In 2016, the aggregate medical cost due to obesity among adults in the United States was $260.6 billion.\n\nEdit: from my own current research for a paper it looks like the prevalence of obesity has increased since 2016. Just with general knowledge knowing that healthcare costs have increased id be curious to see a refreshed study of this in the near future to determine if healthcare costs increased at the same rate between obese/non-obese or if there are differences.", "score": 3, "replies": []}, {"body": "I can't imagine that if you're non-diabetic, that forcing your pancreas to make more insulin than it normally would, long term, isn't going to make something go haywire.", "score": 7, "replies": []}, {"body": "Stay tuned for the dramatized expose of \"The Shady Truth Behind Ozempic\" in 15 years.", "score": 1, "replies": []}]}, {"body": "It seems like it would take access to ALOT of personal data to link a person's spending habits to the type of medication they are taking.", "score": 3, "replies": []}, {"body": "It’s quite scary when supermarkets knows this much about human behavior, imagine what Big Dataminers know (Meta, Google,MS etc)", "score": 3, "replies": []}, {"body": "Oh no, the poor junkfood makers will be out of work.", "score": 3, "replies": []}, {"body": "Yes, let's blame Ozempic instead of prices...  I'm pretty well off but my junk food intake has dropped off drastically.", "score": 3, "replies": [{"body": "Inflation has been a wonderful excuse for me to lose weight 😂.", "score": 1, "replies": []}]}, {"body": "Bruh I’m in a six fig household and we’ve cut back lmao I don’t think it’s the ozempic.\n\nMore like it’s everything is fucking expensive as fuck so we don’t splurge on meat, snacks (chips) or drinks anymore.", "score": 15, "replies": [{"body": "Tri tip here in LA is still $3/lb on sale, most meats are similarly cheap including fish. You just need to buy things when they're cheap instead of mindlessly buying the same stuff.", "score": 1, "replies": []}, {"body": "Same here, we started going to Costco. The grocery store is just way too much.", "score": 1, "replies": []}]}, {"body": "These drugs do reduce food consumption… now based on the number of people taking it and the impact on their appetite, the net impact to volume is up in the air.  This will also impact restaurants.\n\nI agree Walmart will be able to adjust their assortments to take advantage of spending elsewhere.  I anticipate happier people with money will now spend it on goods and travel rather than savings (unfortunately).", "score": 4, "replies": []}, {"body": "Too early to draw conclusions yet they publish a study that looks like it draws a conclusion. \n\nWhat a pathetic attempt to explain away the fact that people can’t buy enough to eat.", "score": 2, "replies": []}, {"body": "But how long are the decreased sales lasting? Because it could be the medicine causing a change in diet if it's long term, *or*, if someone starts a new weightloss drug they feel motivated and do a healthy grocery trip or 2 before falling back into old habits.", "score": 2, "replies": [{"body": "Great question, wondering myself if it's more effective than prior drugs.", "score": 1, "replies": []}]}, {"body": "Ozempic solves the food crisis. Prove me wrong.", "score": 2, "replies": []}, {"body": "If one looks at the average Walmart shopper, it seems half are on it because of type II diabetes.", "score": 2, "replies": []}, {"body": "Hey, for you hundreds of illiterate “investors” in the comment sections blaming inflation. This below comment from the article is what researchers consider a *control.* In other words, they removed the variable of inflation being the factor. In fact, those who can afford Ozempic likely can also afford more food than those who cannot afford Ozempic.\n\n“The company has seen “a slight change” in food purchasing habits of people taking Ozempic and other weight loss drugs compared to people who aren’t.”\n\nI’ve lost all hope in this subreddit after seeing these comments and like ratios.", "score": 5, "replies": [{"body": "I mean, /r/stocks is easily the dumbest commenter bunch among the investing subreddits. WSB has their shitposts, but they're at least self aware about it, and the voting usually sorts itself out.\n\nThe commenters here seem to know significantly less about the fundamentals of finance, or even reading comprehension.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "It's not helped by the fact that the things making us fat are in every fucking thing, not just junk food.", "score": 3, "replies": []}, {"body": "Just ban sodas in the US and you cut obesity rates in half. But you gotta have that sweet 100g of sugar in your 1L coke so you survive the day.", "score": 1, "replies": []}]}, {"body": "If someone gave me a deal with guaranteed 40 pound weight loss but costs me $10k I'll do it for sure. You would save wayy more than 10k in long term healthcare costs for being overweight.", "score": 1, "replies": [{"body": "Or you could just eat unprocessed foods for free and save $10k plus all the money spent on junk food", "score": 3, "replies": []}]}, {"body": "I wonder if junk food sales and convenience food sales will increase if this can really be used as an appetite suppressant.\n\nIf there was a way to control hunger, I can buy pizza, ice cream or Oreos and keep it in the house without everyone gobbling it up the second I get home from the grocery store. I haven't eaten pizza in years.", "score": 1, "replies": []}]}, {"body": "Well, I buy less or none of things like condiments, chocolate, seafood, etc, because food has gotten too expensive. I buy more rice and such.", "score": 4, "replies": [{"body": "As Dave Ramsey likes to say, just eat rice and beans... for financial independence.", "score": 6, "replies": [{"body": "Or maybe I'll sell books and seminars telling people to eat corn and sadness, and gain financial independence that way.", "score": 5, "replies": []}]}]}, {"body": "That's the dumbest fuckin excuse for falling corporate profits that I've ever fuckin heard.", "score": 2, "replies": []}, {"body": "Horse shit. They will blame everything in the world except their prices and their wages.", "score": 0, "replies": []}, {"body": "What a bunch of horseshit. Even if this study was remotely true [https://i.imgur.com/Ky3ccOp.png](https://i.imgur.com/Ky3ccOp.png) and the people that used Ozempic actually starved themselves, it would not affect Walmart or Kroger profits much at all.\n\nI reduced my grocery budget because I had to, not because I'm overweight.", "score": 1, "replies": []}, {"body": "Trust me, many American patients have beaten bariatric surgeries. They will take care of Ozempic the same way.", "score": 1, "replies": []}, {"body": "Surely it’s not the cost of groceries?", "score": 1, "replies": []}, {"body": "long term Ozempic won’t impact food sales. i actually theorize it will increase them. \n\nOzempic kills hunger so long as you take it. It also makes you nauseous. No one wants to be nauseous for the rest of their life so eventually they will stop taking it.", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Emetrol", "score": 1, "replies": []}]}, {"body": "How would that lead to an increase in food sales?", "score": 2, "replies": []}]}, {"body": "Holy fucking out of touch. People are broke and shit just went up a ton and they are blaming this drug? Insane. I really hope the class war starts soon.", "score": 0, "replies": []}, {"body": "Corporate greed for raising prices could t have anything to do with this?", "score": 0, "replies": [{"body": "Hey, I was trying to send a message to you but it didn't go through. I read your post on turtle wax hybrid paste and wanted your advice. I wanted to know if that wax would help with tree sap. My driveway is under a tree and my previous car would be covered in the sap. Just wondering if you think that wax would be beneficial in preventing the sap from sticking. Thanks a lot!", "score": -2, "replies": []}]}, {"body": "I think it’s prices", "score": 0, "replies": []}, {"body": "Or they priced junk, processed food out of people's reach.\nSoda, chips, cookies are just super expensive. Suddenly people want to eat healthy.", "score": 0, "replies": []}, {"body": "The dumbest shit I have ever heard from a corporate company.", "score": -2, "replies": []}, {"body": "Next thing you know they'll say the regulations on meth precursors are, too.\n\nSuch a great clientele they have.", "score": -1, "replies": []}, {"body": "Maybe it’s the obscene cost of food?", "score": -1, "replies": []}, {"body": "Lol there's no way. So many people would have to take it for them to notice it in their bottom line. Food is just crazy expensive now.", "score": -1, "replies": []}, {"body": "Yep, it’s Ozempic and not the “inflation,” of food over the last 2 years…", "score": -1, "replies": []}, {"body": "ITT: People who can't seem to understand the study design compares a population that takes Ozempic with a population that does not. Even if everyone is cutting back, this study is reporting that the people who took Ozempic *are cutting back even more*. \n\nIt doesn't matter whether it's only 1% or even 0.1%. If there's a difference in consumer behavior, as the early results seem to indicate, that will mean different shopping patterns if these drugs ever end up reaching a significant portion of the population.", "score": 0, "replies": []}, {"body": "Yeah fucking right", "score": 0, "replies": []}, {"body": "Big ag vs big pharma. A showdown between the axis of evil.", "score": -1, "replies": []}, {"body": "Maybe food prices?", "score": -1, "replies": []}, {"body": "Yea they’ll make it up and then some in extra toilet paper sales.", "score": -2, "replies": []}, {"body": "Do the people who can afford ozempic, really shop at walmart? Seems a bit \"reachy\" with this excuse for the sales decline.", "score": -3, "replies": []}, {"body": "Ozempic pshhhh. If I was a doctor I'd just prescribe adderall, dexedrine, vyvanse, or ritalin.", "score": -3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "The drug works by reducing the appetite- so people eat less.", "score": 1, "replies": []}]}, {"body": "How is this even a discussion? \n\nYes they buy less. The actual clinical trials show they eat less. You eat less, you ( hopefully) buy less. That’s the whole point — do people think this is some miracle drug? 😅", "score": 1, "replies": []}, {"body": "Processed shit sales, to be accurate.", "score": 1, "replies": []}, {"body": "My insurance covers the pill version Rybelsus at no cost to me. I'm staring down my nose at all those needle injectors.", "score": 1, "replies": []}, {"body": "Maybe it's because inflation shot food prices up so much people can't afford what they used to? No? It's the expensive weight loss drug that's sweeping Hollywood? I guess so.", "score": 1, "replies": []}, {"body": "I see it. I’m on the weight loss version of ozempic and it’s completely nixed my sweet tooth. I used to drink 4-5 cokes a day. Now I can only drink a quarter of 1. When I go grocery shopping I feel full already so I’m not buying a bunch of crap because I’m hungry and it looks good. My grocery bill has shrunk to half of what it used to be.", "score": 1, "replies": []}, {"body": "They just handed novo the greatest gift in terms of data.", "score": 1, "replies": []}, {"body": "This is ridiculously tone deaf. \n\nPeople can’t afford to shop there, what is wrong with these companies.", "score": 1, "replies": []}, {"body": "After revelling in profits for decades selling addictive ultra processed foods, suddenly the party comes to an end.", "score": 1, "replies": []}, {"body": "Americans taking pills to fight weight loss. Cant think of better duo. Theyd rather spend 1-1.5k€ a month on pills instead of just buying healthy food? No wonder the health system is a complete disaster from a finance perspective. You should do a revolution and burn the corrupt food industry to the ground. Your country could be so much richer even now just by fixing this. Kind of sad.", "score": 1, "replies": []}, {"body": "This is a dumb take", "score": 1, "replies": []}, {"body": "Maybe the average person on this drug is trying to lose weight so they buy less food. Seems obvious to me.", "score": 1, "replies": []}, {"body": "Lol, like people who shop at Walmart can afford ozempic. My insurance won't cover it for obesity, only diabetes, and it's like a grand a shot. Out of my price range.", "score": 1, "replies": []}]}
{"title": "Warren Buffett-backed BYD is just over 3,000 cars away from overtaking Tesla as the world’s biggest seller of EV cars", "selftext": "", "id": "16zdrgd", "created_utc": 1696394073.0, "score": 4, "upvote_ratio": 0.51, "num_comments": 109, "comments": [{"body": "OP is an anti Elon bot. This was already posted btw", "score": 79, "replies": [{"body": "The Dead Internet lives.", "score": 10, "replies": []}, {"body": "But is the article wrong? Whose a fan of whom is irrelevant", "score": 5, "replies": [{"body": "I mean… it’s not a great quarter to compare. Tesla had factory downtown which also boosts competitor sales.\n\nBut truth is they aren’t far off", "score": 4, "replies": [{"body": "It’s a matter of perspective.  This is like a few years ago when China’s economic growth rate made everyone believe China is destined become the world’s biggest economy in a decade or two.  Now the social-economic implosion in the last year has revealed the emperor’s clothes and dispelled such illusions.\n\nBYD has counted in China’s short-lived post-COVID boom at the same time Tesla’s Shanghai plant reduced its production/export.  Going forward, BYD numbers will tank as China reels from the decline of its internal consumer market while Tesla will ramp up the exports from its Shanghai line.", "score": 3, "replies": [{"body": "Reality is that BYD is very close in BEV sales in Q3. It’s not like in the USA where Tesla is something like 6-10x the quantity of the next person, and sells more than everyone else combined.\n\nBYD also makes many more vehicles in total when accounting for hybrid. It’s plausible they can shift sales form hybrid to BEV if your only care about BEV numbers.\n\nBYD is also making moves globally. Though not that successfully so far. But they are proven to understand ev manufacturing.\n\nHard to predict the future. I wouldn’t say China is tanking at this point. They are still seeing gdp growth for example, but not as much as initially projected. You are presuming that the future of China will see some sort of economic collapse?\n\nI didn’t say BYD will overtake Tesla. But I am now saying that it’s hard to predict. Until Tesla gets it’s small car out the door cost wise is still too high for a lot of folks, especially in places that don’t have great incentives.", "score": 1, "replies": []}]}]}, {"body": "Are you new to this sub? Any remotely critical non-echo chamber, non-Elon-meat-riding post is labeled FUD and downvoted into oblivion.", "score": 1, "replies": []}]}, {"body": "Doesn’t  change the fact though", "score": 4, "replies": []}, {"body": "Doesn’t make it less true. lol.", "score": -1, "replies": []}, {"body": "does'nt make it irrelevant though. i mean how many times do we see repeat posts of cyber trucks and model 3? \n\nIf your an investor you want the good and bad news as long as its facts.", "score": 1, "replies": []}]}, {"body": "China vs Tesla. Americans hate Elon more than the CCP.", "score": 52, "replies": [{"body": "This is sadly true", "score": 17, "replies": []}, {"body": "Doesn't Elon have a manufacturing plant in China?", "score": 8, "replies": [{"body": "Yes, Shanghai. Also Germany, California and Texas, now the headquarters. Planning one in Mexico.", "score": 2, "replies": [{"body": "You forgot New York (where all of the superchargers are made)", "score": 2, "replies": [{"body": "Ah yes, thanks, in Buffalo. Critical piece of the puzzle", "score": 2, "replies": []}]}]}]}, {"body": "Self inflicted.", "score": 16, "replies": [{"body": "Some of it is self-inflicted on Elon's part, but hating someone who sometimes tweets obnoxious stuff more than a country that's actively seeking to destabilize your own is also self-inflicted. That's not sane, but because enough people are emotional enough about it, we pretend it is.", "score": 4, "replies": [{"body": "As Muhammad Ali famously said: “CCP never called me a pedo.”", "score": 1, "replies": []}]}]}, {"body": "Can you elaborate? As I remember, it was actually Musk who was criticized for pushing Beijing narrative, suggesting that \"Taiwan is integral part of China\"", "score": 2, "replies": []}, {"body": "Elon has a greater ability to make our lives worse.", "score": -1, "replies": []}, {"body": "They like trash, uaw and their cars", "score": -2, "replies": []}, {"body": "It’s elon’s fault", "score": 0, "replies": []}]}, {"body": "Majority are hybrids. Hybrids are garbage. Straight battery electric, Tesla is the leader in sales and tech and margins.", "score": 40, "replies": [{"body": "No, the numbers being talked about *are* the BEVs. BYD makes more vehicles total than Tesla.\n\nBut it doesn't matter. Tesla is still doing well. BYD is, and will be, a competitor. So far though, they are the only significant one. GM? Don't make me laugh. Ford, VW? Stellantis and Nissan have too many financial problems. Honda might have something, eventually. Toyota ***should*** be a threat, but I really don't know WTF they're up to, they need to get over their ego and stop backing hydrogen. Short term, their hybrids will make money, but they'll probably get legislated out of the picture.", "score": 12, "replies": [{"body": "It's pretty much just BYD and Rivian. Ford should have a shot since they have competent management, but this union stuff lately isn't helping. Also will probably get gov bailouts should it come to that.", "score": 3, "replies": []}]}]}, {"body": "Who cares, they are in different market segments.\n\nhttps://twitter.com/TSLAFanMtl/status/1709395804480270725?t=KtivIm2t4XimtBg0NGHT8Q&s=19\n\nThere is enough space for both of them.", "score": 43, "replies": [{"body": "I rode in a byd Uber in Mexico. Had enough of the creature comforts like bmw but the finish of a wuling mini.", "score": 13, "replies": [{"body": "Isn't that what they say about tesla", "score": 5, "replies": [{"body": "Who? Not in my experience.", "score": 10, "replies": [{"body": "go check out realtesla sub", "score": -13, "replies": [{"body": "I'd rather r/ flesheatingbacteria", "score": 9, "replies": [{"body": "yeah their criticism is always delusional, that's what I was refering to", "score": 9, "replies": []}]}, {"body": "It’s a sub dedicated to hating Tesla lol. No shit", "score": 5, "replies": []}]}]}]}]}]}, {"body": "I have and love my Tesla. Friend purchased Kia EV. He loves it. He bought the Kia because he does not care much for Musk.\n\nPersonally the Kia doesn’t seem to be impressive.  The Elon factor is real.", "score": 15, "replies": [{"body": "Only reason I remain an investor is because of Elon.", "score": 7, "replies": []}, {"body": "The Elon factor is real for your friend, but not everybody. Still it only has to effect a small number of people looking to buy an EV to have an impact on sales.", "score": 7, "replies": [{"body": "I know several people who were previously going to purchase a Tesla who have either canceled their preorders or are shopping other brands who cite Elon's recent toxicity as the reason, but I don't know a single person who was looking at other EVs who are now considering a Tesla.\n\nElon's behavior is essentially *ONLY* moving people away from the Tesla brand. I myself have had only Teslas for years, but Elon's behavior alone has made me go from 100% sure the Cybertruck is my next vehicle to 95% sure.", "score": 3, "replies": [{"body": "Are vision and leadership part of behavior? Yes, Elon loves to stir the pot and has said some shit that I doubt he actually believes. He's also created the company that's made the EV industry real. \n\nLike you, I'm all Telsa, 4.5 yrs and 125,000 miles in on my model 3, and still 100% in on the Cybertruck. Maybe that'll change when I get to drive one. Elon trash talk? Eh ... it's not a perfect world.", "score": 1, "replies": []}]}]}, {"body": "The Kia will simply end up being his \"gateway\" vehicle.  Once he's had a year or two to really appreciate and understand EVs, he will be able to more clearly see where Tesla has obvious advantages.  It will hopefully, quietly make him question his decision making logic at the time.\n\nIt's always good to avoid being wrong, but the next best thing is when you can come to grips with the fact that you were wrong at some later point in time.\n\nHis next vehicle will be a Tesla.  :)", "score": 2, "replies": []}]}, {"body": "*EV golf carts", "score": 33, "replies": [{"body": "I think they’re more famous on the flipside for EV buses and semis", "score": 7, "replies": [{"body": "Yep, London has a lot of BYD EV and hybrid buses", "score": 2, "replies": []}]}]}, {"body": "I'll have to check to see if Sandy Munro has torn apart any BYD EVs like he has with other manufacturers, incl. Tesla.", "score": 5, "replies": [{"body": "BYD don't sell cars in the US, so it would be a difficult exercise.", "score": 5, "replies": [{"body": ">BYD don't sell cars in the US, so it would be a difficult exercise.\n\nYes, no passenger vehicles ATM but BYD sell commercial vehicles in the US. It's just a matter of time since BYD are focusing on flooding international markets IOT isolate and prevent Tesla from taking more market share. When Tesla is relegated to a smaller % of foreign EV markets, BYD will flood the US, hoping to reduce Tesla from within. Sun Tsu tactics.\n\nIf Dems stay in power the best way to force EV adoption will be to flood the West with cheaper, Chinese, EVs.", "score": 2, "replies": []}, {"body": "You can’t import one?", "score": 1, "replies": [{"body": "yeah, but I don't think car carrier ships want to stuff around with single car customers. It would have to be bought (probably in China) , loaded into a container, shipped to Detroit, customs inspected, quarantine inspected, fumigated? , unloaded and trucked to Troy, Michigan. \n\nI'm not sure the legalities of importing a new car that isn't certified by NHTSA, even if it's intended for destruction. Probably requires a shitload of paperwork.", "score": 1, "replies": []}]}]}]}, {"body": "Warren Buffet has been selling BYD stock for a while", "score": 10, "replies": [{"body": "Does he own any Tesla stock?", "score": 2, "replies": [{"body": "no", "score": 4, "replies": []}]}]}, {"body": "One thing to keep in mind BYD cars are priced lower than tesla", "score": 5, "replies": []}, {"body": "I had lots of airport taxi rides in BYDs in Thailand from 2018 to now, and they were quite good. Those early models (2018, maybe 2017) were pretty boring in many ways, but the underlying tech seemed sound and the quality was good.  Very comfortable too.  I think they'll do great. I'm not worried about Tesla however. There's plenty of room for solid competitors.", "score": 6, "replies": []}, {"body": "I wonder how long it will take other us automakers to catch up", "score": 3, "replies": []}, {"body": "I wonder how much they’re still trying to grow that and if it’ll keep up with giga Austin and Berlin’s growth.  Never hear about BYD gigafactories opening around the world but I guess only Tesla has that megaphone", "score": 4, "replies": [{"body": "Don't need a gigafactory to make matchboxes", "score": -1, "replies": [{"body": "scary zonked plough escape versed coordinated poor normal live ruthless\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": []}]}]}, {"body": "BYD's profits are subsidized by their ICE business.  They BEVs are also generally a lower market segment than Tesla.  However, it's good to see actual competition.  It'll be interesting when Tesla has the \"Model 2\" out.  Depending on how much effect the Tesla factory improvements bring, I do expect BYD to likely surpass Tesla in BEV sales by end of this year or it'll be pretty close.", "score": 7, "replies": [{"body": "Their ice business already closed last year and their business is subsidized by EV battery production", "score": 14, "replies": []}, {"body": "They are subsidized by their battery production businesses which Tesla is a customer. In other word they are subsidized by Tesla itself", "score": 4, "replies": []}, {"body": "BYD doesn't have an ICE business.", "score": -3, "replies": [{"body": "Well technically Hybrids still have an ICE in them so...", "score": 19, "replies": [{"body": "Hybrids are still very much needed and the best fit for lots of consumers", "score": -2, "replies": []}]}, {"body": "As of March of last year they killed off their ice-only lines, but just shrinking the engines and expanded their Hybrid line doesn't mean they aren't magically no longer an ICE manufacturer. They are still very much an ICE business with nearly half their personal cars [still accepting fuel.](https://www.investors.com/news/tesla-vs-byd-2023-comparing-ev-rivals-tsla-stock/#:~:text=Meanwhile%2C%20BYD%20sold%20a%20record,vehicles%2C%20including%20431%2C603%20personal%20BEVs) \n\n\"BYD sold a record 287,454 EVs in September, up 43% vs. a year earlier. Of the personal vehicles, 151,193 were all-electric BEVs and 134,710 were plug-in *hybrids*\"", "score": 6, "replies": [{"body": "This is a very, very lazy response to the conversation of whether BYD 'subsidizes' their BEV production with combustion cars.", "score": -5, "replies": [{"body": "Not lazy - accurate. I was responding to the nonsense \"they don't make engines anymore\" trope. Not sure why you aren't paying attention.", "score": 4, "replies": [{"body": "[removed]", "score": -4, "replies": []}]}]}]}]}]}, {"body": "BYD is making great EVs. It would sell like crazy if it were allowed to sell in USA.", "score": 3, "replies": []}, {"body": "But do they FSD? I think not :)", "score": 3, "replies": [{"body": "Does Tesla?", "score": -6, "replies": [{"body": "Yes. And they will continually improve with ota updates forever", "score": 6, "replies": [{"body": "Is FSD currently U.S. government approved?", "score": -7, "replies": [{"body": "lol. People have done well in Tesla stock looking at what’s coming around the corner, as with most stocks. FSD is coming fast.", "score": 6, "replies": []}]}]}]}]}, {"body": "Hope this means Tesla will rush the model 2 then. BYD has a price advantage, especially in this economy.", "score": 1, "replies": [{"body": "Considering the new manufacturing concepts and likely other innovations, rushing it will be a serious challenge.\n\nI hope that the rumors that they will be doing initial production in Austin rather then Mexico are true, it ought to cut down the time to production start by a decent chunk, don't you think?", "score": 5, "replies": []}, {"body": "At the current speed of price cut they won’t event need a model 2.", "score": 2, "replies": []}]}, {"body": "Very good byd sells to their base and knows what their customers want. Great looking cars", "score": 1, "replies": []}, {"body": "Fake, as usual. BYD sells most hybrid cars. Yahoo is not a reliable source of informations", "score": -9, "replies": [{"body": "This is for BEVs specifically. BYD will overtake Tesla in BEV sales in 2024, maybe even Q4 2023.", "score": 8, "replies": []}, {"body": "Usually is, not this time though. They compare BEV only. That said, it's specifically for a planned down quarter for Tesla.", "score": 7, "replies": []}, {"body": "well then cite another source, because this statistic does not involve hybrids", "score": 2, "replies": [{"body": "this is where I was looking. But, even so: BYD makes half the money Tesla makes for every car they sell\n\nhttps://pbs.twimg.com/media/F7j-bGtXgAAvFC7?format=jpg&name=small", "score": 0, "replies": [{"body": "This is good for EV adoption. Whether it's a low margin car or a high margin car, it's still replacing a dirty fuel alternative.", "score": 2, "replies": []}]}]}]}, {"body": "BYD only has 631,500 employees!", "score": -3, "replies": [{"body": "They do a lot of things that go beyond building cars. They also make batteries used in other cars, like the Tesla standard range ones built in Shanghai.", "score": 2, "replies": [{"body": "yeah totally need 100k ppl just for that", "score": -1, "replies": [{"body": "To be one of the largest battery manufacturers in the world?\n\nI agree!", "score": 3, "replies": [{"body": "will be interesting to see if they can keep their labor costs under control with so many employees, and china’s middle class growing", "score": 0, "replies": []}]}]}]}, {"body": "Very efficient. Are they unionized?", "score": 0, "replies": [{"body": "is ccp a union?", "score": 2, "replies": []}]}]}, {"body": "False. They don't even hold a candle in BEVs, they make a shit ton of hybrids", "score": -1, "replies": []}, {"body": "Outstanding!", "score": 0, "replies": []}, {"body": "Doesn’t matter, BYD doesn’t sell cars in America", "score": 0, "replies": []}, {"body": "Meanwhile, just found out that BYD also surpassed Ford in total auto sales this quarter, making BYD the fourth largest automotive manufacturer in the world. Ford fell to sixth, behind Hyundai. But none of those facts provide a “Tesla” headline, so not likely to generate a lot of clicks, I guess.", "score": 0, "replies": []}, {"body": "CCCp backed will deliver whatever u desire", "score": 0, "replies": []}, {"body": "And as usual, no one is talking about Polestar PSNY", "score": -3, "replies": [{"body": "Fact, fact, fact! We are the invisible and forgotten ones in this market. 😄🕵️‍♂️💼", "score": 1, "replies": []}]}, {"body": "I've never actually seen one on the road.", "score": -1, "replies": [{"body": "Not allowed in US,  very common in Europe and Asia", "score": 0, "replies": [{"body": "UK here.", "score": 0, "replies": []}]}]}, {"body": "A Chinese golf cart 🤷‍♂️", "score": -6, "replies": [{"body": "BYD makes real cars, even ones that are sold in developed countries.", "score": 2, "replies": []}]}, {"body": "Wonder how many will end up in a field...", "score": -2, "replies": [{"body": "That was debunked, and never applied to BYD.", "score": 5, "replies": []}]}, {"body": "Come on, Mexico factory. We’re counting on you to drop the price and raise the volume so these headlines go away.", "score": 1, "replies": []}, {"body": "Is the same Buffett backed BYD Berkshire keeps selling throughout 2023?", "score": 1, "replies": []}, {"body": "This means absolutely nothing. Tesla has double the profits and they are still ramping up. Tesla is a steamroller. Everyone else is pavement.", "score": 1, "replies": []}, {"body": "I mean if we're not comparing segments or sale prices then Hot Wheels is the #1 electric vehicle manufacturer. And they're using full body casting too way ahead of everyone.\n\nCheckmate Baglino.", "score": 1, "replies": []}]}
{"title": "Is wheeling strategy too good to be true?", "selftext": "Has been doing Wheeling for a month and the market has been kind to me. I learned about this strategy from X and Thetagang. I learned the most from u/scottishtrader, especially the risk management part. Special shout-out to him here, thanks for his sharing and patience in answering questions.\n\nI started my investment journey in September 2021 (around 200k). I slowly deployed the money into the stocks I liked from September to December. I have read lots of books about long-term investing and buy&hold. (Warren Buffett, Terry Smith, Philip Fisher, and so on). My B&H strategy so far is barely breakeven, and it experienced the maximum drawdown last year (-26%). My main holding was QQQ, VOO, MSFT, META, GOOGL, etc. (high free cash flow and big names). \n\nAfter I discovered Wheeling, I saw this strategy makes a lot of sense because it can guarantee I scoop up the companies or index I like with a lower price, meanwhile, I have a lot of flexibilities (take assignments, Sell deep ITM Calls, CC, cut loss, roll, etc.) From this perspective, this strategy is not much different from B&H just that it has much more flexibility. I have to add another information here, I don't have to pay tax for trading profit. People like to compare backtest results, I think this is unrealistic because I don't think anyone will all in into S&P500 or whatsoever at a specific time, and the Wheeling strategy can be adjusted. Most likely people will do DCA or try to time the market a little bit. Also, people left comments saying you will get crushed during the market crash. Isn't the B&H strategy even worse during the market crash? (less flexible and higher stock cost)\n\nI can see the wheeling strategy might lose to a super bullish year(assuming that you are already all in the market before the jump), otherwise, it will be better than B&H yearly.\n\nThinking back, I’d have ended up a lot better if I started my investment journey with the Wheeling strategy (lower stock cost + cash interest + premium collected). Now I am committed to Wheeling.\n\nHowever, if the Wheeling strategy is so great why it has not been exploited earlier? Anyone has been doing this successfully for over ten years? I don't think this strategy is complicated. Did I miss something?\n\nJust want to challenge my current thought and look for a good discussion. Thank you for reading!", "id": "16zvcz6", "created_utc": 1696445601.0, "score": 58, "upvote_ratio": 0.84, "num_comments": 145, "comments": [{"body": "There is no free lunch. You can get caught holding heavy bags here almost as easily as other strategies, or have your CCs blown out on a massive bull run and miss out on fantastic returns as opposed to buy and hold.\n\nThere are trade offs.", "score": 110, "replies": [{"body": "Wheel rakes in chop environment but this year it’s either been straight up or down which isn’t ideal for wheeling at least on the indexes. If you were wheeling 0.2 delta on SPY from 30-45 DTE from Jan-July you’d get crushed return wise (based on current VIX and option prices you’d probably see 0.5-1% per month vs S&P up ~20% in those 6 months).  Then trading 0.2 delta from July on you’re probably getting assigned in Jul / Aug at a high price compared to the start of this year. Not the peak but higher than your adjusted wheel cost basis then you’re probably selling CCs below your assigned cost", "score": 16, "replies": [{"body": "I totally agree with your analysis. But most likely nobody will all in their cash in Jan 2023 and foresee the bull market run. By wheeling weekly options since January, I don’t think it will be stressful and I don’t think I will get assignment much. I see that I can earn 12-20% annually by premium plus the cash I park in SGOV to earn 5% yield.", "score": 2, "replies": [{"body": "I have been thinking of wheeling weekly options, how has that worked out for you?", "score": 1, "replies": [{"body": "Doing great. Up 2% a month since I started.", "score": 1, "replies": [{"body": "How about now?", "score": 1, "replies": [{"body": "look at the market. I only do index wheeling now. 2% steadily", "score": 1, "replies": [{"body": "Nice you have been up 2% a month for almost 10 months now?", "score": 1, "replies": [{"body": "Yes. I am underperformed compared to if I all in my money to the index since I started wheeling. But who knows the future back then. I am happy with my return.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "The unfortunate reality is that most of the major gains in SPY or QQQ or other major indices occur in a very small time period relative to the entire existence of them, which means selling calls is a losing strategy because you will not predict when those time periods are. And often times rolling doesn't help much if at all.", "score": 1, "replies": []}]}, {"body": "So it's smart to wheel stocks that I don't mind holding long term in case I get assigned and the CC won't?", "score": 6, "replies": [{"body": "That is what I do. Only use the wheel strategy on the stock I like. Fundamental always come first.", "score": 9, "replies": [{"body": "You need to account for cost of capital. You can potentially be locking up money for a long time just to avoid 'taking a loss'. You can get over 5% right now with virtually no risk. \n\nAlso running the wheel is not generally a tax effective strategy.", "score": 3, "replies": [{"body": "If there is a market downturn, there is no difference between B&H and assigned CSP. Both position are trapped and the cost of capital need to be accounted. I would say CSP might even have lower stock cost. Also, I don’t have to pay tax for capital and trading gains in my country.", "score": 5, "replies": [{"body": "I think he was talking about US bonds. You can get a guaranteed 5% return right now basically risk free (hopefully the US govt doesn't collapse). So wheeling a stock that suddenly drops locks up your money while you wait for the recovery. The tax implications are why I do buy and hold personally. I don't want to pay capital gains taxes on my wheeling profits. Just have a plan and stick to it 👍", "score": 2, "replies": [{"body": "Thanks man. Yeah, I am aware that the government bill pays reasonable yield now. I have half of my portfolio in SGOV tho.", "score": 1, "replies": []}]}]}]}, {"body": "In my experience with wheeling the most of the gains come from stock price recovery after taking assignment. But right now with the high yields I avoid assignments at all cost.", "score": 1, "replies": [{"body": "Thanks for sharing. My goal is to get as little assignment as possible. I think the premiums are lucrative enough even if I don't earn income from assignment and recovery.", "score": 1, "replies": []}]}]}]}, {"body": "Re B&H:\n\nSPY today is almost exactly where it was 28 months ago. Where's the \"fantastic return\"?\n\nOf course you can use individual stocks, but that's just gambling.", "score": 3, "replies": [{"body": "People saying B&H will do better. I assume they are talking about VOO or QQQ? QQQ might be hard to beat, but I don’t think anyone has any foresight and all in their cash before the tech boom. Regarding VOO, I think 10% annual return is not really hard to beat if I perform consistently on wheeling.", "score": 1, "replies": []}]}, {"body": "I agree with it. Do you consider the first half of 2023 a massive bull run? I think Wheeling will do just as good in the first half of 2023 as S&P 500 B&H.", "score": 2, "replies": [{"body": "Wheeling will not outperform in a bull run. \nBut it's not supposed to. Wheeling is an income tool, not a growth tool. The fact that you have to cap your gains with covered calls proves that in a strong bull market you will fall behind. That being said I am an avid wheeler and have beaten the indexes this year, but I wheel individual stocks. If I had held those individual stocks that I've traded instead of wheel in and out of them I would be up massively more, but ide be accepting more risk as well...", "score": 11, "replies": [{"body": "Hi cobynette,\n\nI have been using the Excel sheet you shared. Thank you for that.\n\nI agree with you that “accepting more risk as well”. I started investing in individual stocks at a very bad time (the end of 2021). Hence I understand this “accepting more risk as well”, which is also why I started using the Wheeling strategy. It seems more stable and reliable for me. \n\nThe problem with comparing “could have buy and hold” and the Wheeling is we never know there is a bullish market coming. Even if we did luckily time the market, most likely we will not be committed to all our cash. I highly doubt that there is somebody successfully all in his cash in January 2023. \n\nThanks for replying. Good luck!", "score": 3, "replies": [{"body": "Awesome, glad the sheet is helping!\n\nYah that was a rough time to start for sure . Luckily you're in good companies. The most important part of the wheel is being a good stock picker, imo.\n\nGlad it's working for you! Always make sure to keep your risk in check and enjoy those sweet premiums . Good luck to you too!", "score": 3, "replies": [{"body": "Exactly. Just come out breakeven from the 2022. Had few and smaller position in speculative companies, they all never came back. I definitely think fundamentals come first when doing wheeling. \n\nThanks for the explanation and encouragement. Looking forward to learning more from your post. Take care.", "score": 2, "replies": []}, {"body": "Why not just stick to indexes?\n\nEventually, all companies fold", "score": 1, "replies": [{"body": "Just trying my luck and skill to beat the index? I have exposure to index funds in my retirement account btw. I don't mind using part of my portfolio trying to get better result", "score": 1, "replies": []}]}, {"body": "Mind sharing your spreadsheet?", "score": 1, "replies": [{"body": "You can find it on my most recent post. It's hyper linked at the bottom", "score": 1, "replies": []}]}]}]}, {"body": "Perfect answer so true! What individual stocks did you wheel? Am wheeling SOFI and COCO, prob will start Draft Kings and Palantir lol", "score": 1, "replies": [{"body": "U can check my profile to see my monthly updates which shows a log of all my trades each month. Hope it helps!", "score": 1, "replies": []}]}]}]}, {"body": "Got caught with TSLA and was wondering when I might need to consider bailing", "score": 1, "replies": []}, {"body": "Exactly. It also depends on how you apply the strategies. Some people start with high delta puts and ignore market events or expected potential upside/downside catalysts such as earnings and end up with a huge gap if earnings get crushed or if something like Tesla deliveries falling short, so there isn’t necessarily a one size fits all, but there are smarter ways to manage the wheel just as there are better ways to trade in general. And there are ways to optimally trade the wheel and certainly ways to screw it up.", "score": 1, "replies": []}]}, {"body": "Everything works till it doesn't. One risk is a significant drop in value after selling a CSP.  You can take steps to mitigate or respond but then it's no longer a simple wheel.", "score": 46, "replies": [{"body": "Thanks for replying. I don't get it here. Isn't it the Wheeling is about risk management and position adjustment? Why responding is no longer a simple\nWheel? Also, if there is a significant drop in value, wouldn't any long strategy go into trouble?", "score": 2, "replies": [{"body": ">Also, if there is a significant drop in value, wouldn't any long strategy go into trouble?\n\nNo, there are bearish strategies as well", "score": 9, "replies": [{"body": "I have never used a bearish strategy in the market before. If I do have a bearish position it is most likely for hedging my bullish position.\n\nWhat I want to say is when there is a significant drop in value, any bullish strategy will get hurt.", "score": 1, "replies": []}]}, {"body": "https://learn.bybit.com/options/wheel-strategy/\n\nWheeling is selling a csp, getting assigned, selling cc, getting assigned. Rinse. Repeat. \n\nProfit primarily through premiums. \n\nExamples are in the link which explains in more detail than I will.\n\n(There are better links too, I grabbed the first one)", "score": 8, "replies": [{"body": "Thanks for sharing.\n\nI am new to this Wheeling strategy. I thought getting assigned, selling cc, etc. were considered as responding and mitigating. I only wheel the stock I want to own and I don't mind getting assignments, since my strategy is still based on long-term investing in quality companies. I would be able to stomach a 50% drop in any single stock, and cut loss only if my investment thesis or the fundamental judgment is wrong.\n\nThanks for the clarification.", "score": 2, "replies": []}]}]}]}, {"body": "I absolutely love the wheel strategy. It’s done very well for me also. \nThe feedback I’ve gotten when I ask others is that it requires too much capital AND it takes too long. \nPersonally, I would rather use more $ & have less risk involved. \nI mean, I do daytrade & swing trade occasionally, but I make a consistent income with wheeling & I don’t necessarily have to look at the market while I’m at work. I also don’t feel stressed because I ONLY play tickers I want to own. I never chase high IV. \nThere is a downside, though, I was selling CSP’s  in 2021, it was going great until the beginning of 2022..OUCH. The market tanked & I got stuck with a lot of shares. My averages were too high to sell CCs. I’m actually STILL holding some of those stocks (PYPL & DIS) so that’s the downside… but it would be the same risk as investing. If the market crashes, it crashes.\nBUT I always hedge my portfolio with SQQQ shares & CSPs", "score": 10, "replies": [{"body": "Thanks for replying! \n\nYou are totally right. ONLY play with the tickers we feel comfortable with long term. I don’t chase IV as well.\n\nI can totally feel you. I bought stocks directly with cash before heading into 2022(full position). I was trapped in the position and told myself B&H. I didn’t hedge my portfolio with anything. Just didn’t want to look at it. But I keep adding to my big names like AAPL, MSFT etc. now I finally came out from the mud. Seems like selling puts naked has the same effect if something like that happened again. Just that by selling put, I think I have more flexibility and lower entry price. (Like don’t trade the market for a week if feeling something is not right or only do half the cash)\n\nGood luck to you!", "score": 2, "replies": []}]}, {"body": "The wheel isn't exploited because it sucks as an income strategy. There are far more efficient, profitable, and safer ways to farm theta. \n\nThis guy made a great thread on it: [https://www.reddit.com/r/thetagang/comments/13spq3l/why\\_you\\_need\\_to\\_stop\\_wheeling/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/thetagang/comments/13spq3l/why_you_need_to_stop_wheeling/?utm_source=share&utm_medium=web2x&context=3)\n\nI take umbrage with the wheel, I feel it's a poor, risky, and inefficient strategy. My opinion is outlined in the reasons below. Keep in mind, this is about people running the wheel as a means of generating income, not for an established portfolio looking to up their position via CSPs or juice their returns on their underlyings that have unrealized gains for example in a neutral-ish market with CCs. \n\n\r  \nI find the wheel to be incredibly risky for its return profile. Equities are very risky assets and their primary attractiveness to investors is their huge upside potential and dividends. If you acquire shares just for the sole purpose of generating income on them via CCs, you neuter the main selling point of equities, its upside potential, just to squeeze out some marginal income whilst bearing the full downside risk. The only premiums really worth collecting are the ones on the high IV stocks which can spike down and leave you bag holding, or spike up and you miss out on huge returns all for some measly premium. And not to mention, if you have an underlying that pays a dividend, you're likely to get called out of it early so the option holder can swipe the dividend which you as the short call holder will have to pay out of your own pocket.\r  \n\r  \nSelling CSPs for income seems to be another favorite as well, not for me. The only time I deploy a CSP is if it's part of a spread like a front spread/back ratio. When I learned of CSPs it made more sense that it was an effective method of entering into a long stock position at a specific price and getting paid to do so. But rather than the CSP being a lucrative vector of entering a long position, people are just selling them to collect theta and exposing themselves to the same risk profile as a CC: all the downside risk, none of the upside potential, all for a few bucks of premium.\n\nCapital inefficiency. The collateral you have to post for a CSP could be deployed on spreads across multiple tickers, keep cash on the side to buy in case of a market downswing, the list goes on. Rather than locking up their cash to earn like $10 in theta per day they can achieve better results with spreads instead.\n\n \"Im comfortable owning it at my selected strike price\". This phrase irritates me. If you're comfortable owning it at that price then actually own it at the price, forget about rolling up and out which most people seem to like doing (might be a generalization, but I see it more often than not). Plus, being comfortable doesn't mean just slap CCs on it and cross your fingers, you have to continue managing the position from there. Maybe you sell more CSPs and average in on the way down, maybe you convert the position to something else, idk. I feel like the mentality should be along the lines of \"ok I got assigned, now Im going to manage the position as long stock\" rather than treating their shares as a mechanism to sell calls for premium.\n\nThe sheer amount of cognitive and emotional biases with the wheel is staggering. Also, upon assignment people seem to just slap on CCs and shrug their shoulders like \"oh well, time for it to go up now\". Granted this can be said about any trading strategy and speaks more to trader psychology than the wheel itself, but it seems that this sentiment is baked into wheeling for income. Then you got these people who are wheeling meme stocks posting \"is this thetagang?\" threads like their portfolios depend on it (but thats just a gripe in general).\n\nIt's very easy to get stuck. The wheel primarily works in a sideways/slightly bullish market. One bear market or a downward correction and you're sunk. All those premiums collected may help mitigate the capital losses, but you'll still be hurting bad. You have these poor souls holding onto their bags and selling CCs below their cost basis praying that they can earn enough premium to lower their cost basis and then uh-oh it spikes up and they're called out of their shares at a realized loss. There are too many conditions that have to go in the trader's favor to make the wheel consistently profitable. Granted conditions have to go in the trader's favor in general to profit, but there are too many involved in the wheel.\n\nThere are easier and better ways to make money. When it comes to farming theta, there are far less risky, easier to manage, less capital intensive, more customizable and versatile strategies to use instead of the wheel; mainly spreads. These offer more theta exposure, more delta neutrality, less gamma risk, and more methods to temper vega risk. And spreads can also be deployed in any market condition - low IV environment: buy butterflies and condors / high IV environment: sell front spreads and straddles or strangles / bearish or bullish sentiment: skew your spreads one way or another to speculate on direction / or sell an IC to stay range bound or sell a butterfly as a volatility play in either direction. All of which still require management and monitoring, but nowhere close to the amount that the wheel takes.\n\nTLDR: Solely generating income with the wheel involves bearing high downside risk with little upside potential, high opportunity costs, capital inefficiencies, and many cognitive/emotional pitfalls along the way. Spreads can achieve similar if not superior returns to the wheel with much less risk, better capital efficiency, and overall versatility.\n\nI  exclusively trade spreads on SPX and am up approx. 36% YTD.", "score": 28, "replies": [{"body": ">I exclusively trade spreads on SPX and am up approx. 36% YTD.\n\nDo you mind elaborating a bit more on that? How far out do you go?", "score": 6, "replies": [{"body": "Backratios and BWBs. Depending on my appetite for risk and IV DTE can be anywhere from 14-45 but I usually exit all positions within 9-12 days.", "score": 2, "replies": []}]}, {"body": "I’ll reply u after I study this carefully. Thanks for the tips 👍", "score": 2, "replies": []}, {"body": "What about for smaller accounts wanting to take higher risk. This suddenly changes things? It's a strategy which negates risk but volatile stocks you believe in allows for higher premiums and big CC's profitable swings.\n\nI like COCO, want to own this stock anyways, am willing to see where Vita Coco goes and if it's bought out. Why wouldn't I sell CSP beneath its range, at a price am happy, if assigned then start a strangle and wheel out.\n\nIt takes off a lot of stress, am only agreeing to buy shares at a better price or make almost 4% in a month. If I get assigned, am taking my high risk stock play and letting B&H do its thing but at better cost basis and selling CC's to reduce cost basis overall. Feel it's just tools to better improve trading odds. With larger account prob would *not* do this. Thoughts?", "score": 1, "replies": [{"body": ">It's a strategy which negates risk\n\nNo.\n\n>I like COCO, want to own this stock anyways, am willing to see where Vita Coco goes and if it's bought out. Why wouldn't I sell CSP beneath its range, at a price am happy, if assigned then start a strangle and wheel out.\n\nIf you actually liked COCO you wouldn't \"wheel out of it\". You would actually manage the position as long stock in an equity portfolio, not look to exit the position by being called out of it. Selling CSPs to enter the position is legitimate but actually manage the position instead of turning it into a strangle/selling CCs. Equities arent mechanisms to sell calls against for premium, they're volatile risky assets and should be treated as such. \n\n> If I get assigned, am taking my high risk stock play and letting B&H do its thing but at better cost basis and selling CC's to reduce cost basis overall.\n\nIf you're holding high risk stocks and selling CCs against them you're negating the allure of the stock while maintaining all risk all for a bit of premium. The appeal of volatile stocks are its tremendous upside potentials but those also come with big downside risks. So you forego the upside and maintain all tail risk just for a bit of income. Not worth it in any capacity. You can lower your cost basis a bit but not by any justifiable margins to hold such risk imo. Plus if you get assigned and the stock tanks you cant sell CCs against them at the risk of being called out below your cost basis. Quite easy to get stuck. \n\n>Feel it's just tools to better improve trading odds.\n\nHell no. \n\n>With larger account prob would not do this.\n\nOpposite imo. Large account that can form a substantial equity portfolio will work way better than a small account selling CSPs on volatile stocks. They can effectively diversify while generating meaningful returns.", "score": 1, "replies": [{"body": "What's your yearly return? How have you performed out of curiosity? Everyone seems to be able to talk the talk but when it comes down to it what's your returns look like which seems is only form of credibility so just wondering", "score": 1, "replies": [{"body": "It’s at the end of my original comment. +36% YTD", "score": 1, "replies": []}]}]}]}]}, {"body": "The wheel outperforms during stable or falling markets but performs worse than simply b&h in (quickly) rising markets. Overall you lower your risk and also expected return over longer periods of time.", "score": 7, "replies": [{"body": "Wheel doesn’t always beat during falling markets, can potentially miss small gap ups that buy and hold would catch", "score": 4, "replies": []}, {"body": "Thank you. Do you consider the first half of 2023 as a quickly rising market? As I know, the Wheeling strategy will do just as fine as the market this year and even outperform in the last two months. \nI think there would be a better year in the future than the first half of 2023, I can see how Wheeling strategy will underperform in those years. But if the Wheeling can outperform or catch up in 2023, wouldn't that mean it will also outperform B&H in the long term? Since a super bullish market is rare, it almost always retraces.", "score": 0, "replies": [{"body": "its not that rare though, 2009-2020 was generally bullish af before corona except one big drop", "score": 2, "replies": [{"body": "That's true. I am wondering how the people do if they wheel during 2009-2020. Even though 2009-2020 was a golden decade, there were also ups and downs week by week, I think this will benefit the wheel strategy because you can keep scraping from the ups and downs rather than dollar cost average your salary to the stocks. ( DCA from 2009-2020 will end up holding costs higher coz I assume that people had lower salaries in 2009 compared to 2020 because of career advancement)", "score": 2, "replies": [{"body": "well if you just kept put selling and used some margin you probably still did well because the market never tanked. But buy and holding some things might have outperformed.", "score": 1, "replies": []}]}]}, {"body": "Your gains this past month were at a high VIX. Low VIX and bullish movement like from ~May to July well be far less gains than B+H.", "score": 1, "replies": [{"body": "Thanks for pointing this out. If I think about the beginning of the year until today, the bullish chart also means that I have less stress Wheeling the puts and most of the trade can be closed out way earlier than I planned. Another thing about Wheeling is I can keep scraping the smaller weekly ups and downs even in the bullish environment whereas B&H you have to be exactly right to buy before the market go up and hold until the peak.", "score": 1, "replies": []}]}]}]}, {"body": "I started investing in options recently, not even a month old. I am basically wheeling , learning from YouTube videos and u/scottishtrader. I am still rollin’ and able to reduce my cost basis. Stocks are good like PFE and SCHW. No idea how it will be, but happy to get assigned or keep rollin deep itm to reduce the cost basis.", "score": 5, "replies": [{"body": "Thank you for replying. I have never taken a look at PFE and SCHW, I will check it out later. I mostly do my wheeling on GOOGL, META, AMD, AAPL, etc. I like a company with steady growth and high free cash flow, basically so-called “quality investing” just that I use it with Wheeling strategy. I don't see any difference between B&H quality stocks and Wheeling quality stock, since selling puts is a long position.", "score": 3, "replies": []}]}, {"body": "As valueinvestor0815 points out, it outperforms in bear markets and underperforms in bull markets. Over all, you generally get somewhat less returns for much less volatility.\n\nBasically the wheel is the same as just selling puts, or just holding covered calls (these are equivalent trades). Each of these strategies have had funds dedicated to them for decades. XYLD is a covered call etf being run on the SP500, for example (edit:thats been around a decade). Its a well known somewhat conservative strategy (well, more so than buy and hold). Calling it the wheel is the only new thing.\n\nEdit: Lol I just realized we reinvented the wheel.", "score": 3, "replies": [{"body": "Thanks for enlightening me on this topic. I agree that it is a relatively conservative strategy but I do see the potential for it to outperform the B&H strategy just that it involves a lot of management and monitoring.\n\nDo you recommend people just buy the ETF? I just think it is not worth it after the expense ratio and I would like to manage the money myself.", "score": 1, "replies": [{"body": "Not necesarily. I just included it to note that people have been doing it a while and also to give you an idea of what a mechanical implementation would look like. Running it yourself has the advantages you mentioned though, not to mention you can run it on individual stocks. (And gold etfs, bonds, reits etc).", "score": 2, "replies": []}]}]}, {"body": "To me, the wheel offers different rewards than buy and hold, but with similar risk.\n\nFor long term investing, just B&H. You can miss out on bull runs if you're wheeling instead. Also, how do you not pay tax? That's another big factor for wheel vs. B&H.\n\nThe rewards of the wheel are more consistent returns than B&H, which is what I plan to use the wheel for. I plan to use it to help fund travels month-to-month and I'll have less income then so my tax rate won't be as high.", "score": 3, "replies": [{"body": "I am not subjected to the US tax law. What Wheeling makes me feel comfortable is I can kill trade by trade and earning an income like what you said. Whereas B&H for long term for 10-12% annually and stomach the once in awhile 20-50% dropdowns just need too much patience. Also, I expect my annual income will be growing in the future, so my DCA amount to the index fund will be higher every year. I also don't plan to have kids, I don't see the benefit here in tying all my savings into index fund with higher dollar cost average cost.\nThanks for the replying and discussion!", "score": 1, "replies": [{"body": "Honestly with interest rates where they are right now, I think CSPs with interest on collateral is an amazing use of funds. If I were you, I'd just do a mix. Maybe like 50/50 wheel account vs. buy and hold account. Or just do B&H in retirement accounts and wheel your taxable account. Up to you! But yes, the wheel seems pretty great for your case.", "score": 2, "replies": [{"body": "Yeah. Totally agree. I am now 50% in SGOV and another 50% for wheeling. (Wheeling the stock I don’t mind owning if they are lower than my CC breakeven price)", "score": 1, "replies": [{"body": "Do you earn interest on your collateral for CSPs? I have my money in SPAXX in Fidelity which earns interest while I can also sell CSPs with it. So I have 50% in SPAXX that I use to wheel (though I got assigned some SPY recently haha) and my other 50% in long term B&H.", "score": 1, "replies": [{"body": "Yes. I park the cash in my brokerage, they are paying me something like 4+ %. I am thinking of park them all in the SGOV soon so I can just sell it if I ever get assigned.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I was well off in my portfolio, I wheeled $HUT. I am no longer well off in my portfolio.", "score": 3, "replies": [{"body": "Do you understand the company? It doesn't matter what is the strategy, it will only work if the fundamental is correct. If the fundamental has been proven wrong I will just cut my loss.", "score": 1, "replies": [{"body": "And at what point will you realize the fundamentals have gone from good to bad?", "score": 1, "replies": [{"body": "I mostly focus on free cash flow. You can have your opinion about a company before you invest in it. If the opinion no longer valid, I think it is the time to sell.", "score": 1, "replies": []}]}]}]}, {"body": "The main issue is if you get assigned shares and the price continues to drop. You are then potentially in a NET NEGATIVE position where your options are wait for it to come back or sell at a loss.  Normally through proper active management of the position, risk management, appropriate research and just picking  good stocks this should be very possible to minimize or avoid outside a crazy “black swan” event.", "score": 3, "replies": [{"body": "I agree with you at the risk management part. But B&H has the same risk when “black swan” event happen. I would say B&H cost price would be even higher in that case.", "score": 1, "replies": [{"body": "I think it boils down to a general trading/investing rule which is more profit=more risk and or more effort/stress. \n With wheeling you have to preform well and manage accurately as long as your doing it. With something like buy and hold, you are just banking on historical data and dividends. \nIf someone is a seasoned trader/investor and does what they need to, I believe they can make theta strategies like the wheel work better then other strategies.  Id actually say the biggest issue is human error rather then a black swan when it comes to theta strategies, or more active strategies in general\n\nEdit: I BELIEVE IN YOU THOUGH. Keep doing good work and make dat money", "score": 1, "replies": [{"body": "I agree that I have to spend more time on screen on the Wheeling strategy, but it is also what I enjoy doing. I could see the advantages of b&h here, but my experience was sucked during 2022. \n\nThanks for the discussion and support. I wish you good luck in the market ✌️", "score": 2, "replies": [{"body": "Same here brother. Its fun! Haha goodluck", "score": 1, "replies": []}]}]}]}]}, {"body": "I’ve been selling covered calls for 1 year and 3 months. I’m killing it. It does work in the current market conditions. Even in a bear market with a good company it is great bc you can just buy more shares and dollar cost average every week.", "score": 3, "replies": [{"body": "I agree with that. Thanks for replying. Have fun and keep  juicing all the premiums!", "score": 1, "replies": [{"body": "I own rivian stock just fyi. It has high premiums. The current news is going to make it a great opportunity to buy in again!", "score": 1, "replies": [{"body": "I have a friend just got a Rivian truck, he loves it! I am not comfortable with company still not showing consistent profit and free cash flow. Also, I am trying to stay away from capital intensive business. I am currently on AAPL, MSFT, ADBE, META, GOOGL mostly, also other like ENPH, V, Monster beverage but smaller position and less aggressive.", "score": 1, "replies": []}]}]}, {"body": "Excellent strategy. Do you use IBD for your market data? And what Chart service do you use?", "score": 1, "replies": [{"body": "To be honest, I trade like I never want to sell rivian. I follow the news and the nasdaq to understand the weekly market but I sell covered calls then look every morning and move on with my life. I got wayy too into following the market and it caused me too much stress. I set my cover calls and forget until Friday pretty much. On days like today in rivian ima adjust", "score": 1, "replies": []}]}]}, {"body": "The wheel strategy is actually flawed and you can often make more money with less risk by modifying it a little bit.\n\nA short put and a covered call at the same strike are nearly identical trades. But the big difference is the net debit/credit on each one. With a short put you get a credit and with a covered call you pay a debit. \n\nThe difference in cash is usually around the strike price x100, so $50 strike trades would have about a 5k difference in cash. Because of that difference, covered calls will make more money than short puts, and the market expects you to make up that difference on the puts by investing the 5k cash at the risk free rate.\n\nSo if you're doing cash secured puts, and you're earning less than the risk free rate on the cash being held aside, then you would usually be better off doing a covered call at the same strike instead, because on those it's already priced in that you're earning the risk free rate.\n\nBut puts are overpriced relative to the calls when there is a hard to borrow fee, for example right now BYND and VFS. Cash secured puts are netting a crap ton more than covered calls at the moment. So if you were \"wheeling\" these and you got assigned on a CSP, then you would be much better off selling the shares and doing another CSP, as opposed to doing a covered call.\n\nSo the wheel is flawed because it wants you to do the trades in a specific order, rather than looking at the numbers and doing the more profitable of the 2 trades at the time. \n\nThis youtube video has a ton of more detail and a spreadsheet that does the math for you.\n\nhttps://youtu.be/d6xbhn3ZK9Y", "score": 3, "replies": [{"body": "Just learned about this. This is definitely better than the pure wheel strategy but I don’t think it works for me because I also use the wheel strategy to own stocks. I want to have the flexibility to own the stock I ever get assigned and then ride the rebound. \nThank you for the information!", "score": 1, "replies": [{"body": "Whether you do a CSP, or do a buy write, you still have the flexibility to own the stock. With a CSP if the stock finishes below the strike, you buy the shares. With a CC if the stock finishes below the strike, your call expires worthless and you still own the shares. In either one you can ride the stock higher after that", "score": 2, "replies": [{"body": "Oh you are right! What was I thinking smh 😅. Thank you for this, I will look into this next time I open a position. Hopefully I can juice more premium from this. Have u been using this method?", "score": 1, "replies": []}]}]}, {"body": "Well in my broker IBKR I get like 5% interest on my dollar collateral so for me this wouldn't be too relevant or am I missing something.", "score": 1, "replies": [{"body": "According to their website they pay 4.83% for IBKR pro, but they pay $0 on the first 10k. But even 4.83% is still about 0.5% below the risk free rate. \n\nAnd even if you got the risk free rate on cash then the part about puts being overpriced on hard to borrow stocks would still be relevant.", "score": 1, "replies": [{"body": "Right. Well i'm on pro with over 10k cash.  \nBut you are right, it makes sense to do the math on this stuff. As  a result i've been doing more buy writes lately over put selling.", "score": 1, "replies": [{"body": ">But you are right, it makes sense to do the math on this stuff.\n\nYeah it adds up, especially when dealing with large sums of money, and it doesn't take much effort. 1-2 minutes to gather the numbers and plug them into the spreadsheet I made in case you missed it. Once you do it a few times it really only takes like 20-30 seconds\n\nhttps://docs.google.com/spreadsheets/d/1hgUFyXolX4pJOaJRZKdSC1aT0Q7JGz8F/edit?usp=drivesdk&ouid=106113817838620869564&rtpof=true&sd=true", "score": 1, "replies": []}]}]}]}]}, {"body": "Grats on your solid month.\n\nWheeling isn't a great strategy and typically has both higher volatility and Alpha less than 1 over the long term.", "score": 4, "replies": [{"body": "Thank you. \n\nI don't see why Wheeling has higher volatility because my b&h portfolio is more volatile than my low Delta CSP strategy. Also, why Wheeling has an Alpha less than 1? Do you mean the return has lower expected return than the market?", "score": 1, "replies": [{"body": ">I don't see why Wheeling has higher volatility\n\nThis sub is really vegagang posing as thetagang", "score": 4, "replies": [{"body": "Except the Vega gang sub is dead so they just come here instead. Anytime you're selling options you're short vol unless you hedged for it.", "score": 1, "replies": [{"body": "Don’t understand what is vegagang. You should know I am new to the options if you did read my post carefully. As I posted, I only wheel on the stocks I don’t mind owning, the Greeks doesn’t even bother me.", "score": 1, "replies": [{"body": "Vega is one of the Greeks. You might want to learn more about what all the Greeks are and what they do. They're going to play a big role in any option you're trading.", "score": 2, "replies": [{"body": "I do know what is Vega and what other Greeks mean. But I am not an option trader, I am using wheel strategy to buy stock while juicing premium on the way. On this strategy, Greeks do not help much.", "score": 0, "replies": []}]}]}]}]}, {"body": "It's already clear from the OP that you don't see the downsides of wheeling, because you are so focused on the ideal case.\n\nYou had a good month.  Great.\n\nYou have also done seemingly no research into the downsides of your strategy, a dangerous thing.\n\nBefore you do any strategy, you should be able to make a case against it that is so strong 95%+ people won't touch it with a 10 foot pole.  You clearly can't do that, which means you need to study your strategy more as well as options in general.\n\nSo many people in this sub lose EVERYTHING, and you have no idea how or why or even that they have existed.  That's priming yourself for failure.\n\nOptions are literally risk management tools first and foremost, and you can't spare time to think about risk management...\n\nChange everything about your approach to the market.", "score": 1, "replies": [{"body": "If I am so focused on the ideal case I won't even try to discuss it here, clearly you didn't read my post carefully. The downside of my strategy is holding a bag of magnificent 7 and SPY. What is your strategy and what is your downside? Could be better than mine? Would love to know about your secret sauce.", "score": 1, "replies": [{"body": "Having skimmed it again, it's still a cheerleader post for the wheel, just like the last time I read it.  Having skimmed it again, I still got the feeling you were thinking 99% about the upside and 1% about the downside.  Having skimmed it again, I would change nothing about my response.\n\nThat said, my own strategy is a typical ThetaGang strategy.  I don't claim to be a member of ThetaGang, either, FWIW.  I just know ThetaGang strategies better than 99% of those who post here and I frequent the sub as I do frequent every investment sub on Reddit.\n\nIt's not really in the scope of the sub, but, broken down to the absolute basics, the core of my investment strategy is built around having about 90% cash and 10% long LEAPS on broad market indexes.  Even if the market crashes way down, my accounts won't.\n\nAdd to that, I do some TA to identify overbought/oversold and once in a while I will sell a call and make the bought LEAPS into a calendar, sorta like an OTM PMCC.  I will also sometimes sell a few CSPs against the broad market indexes if they appear oversold.\n\nIn general, it's like 100x less risk of serious loss than the average ThetaGang strategy is.", "score": 1, "replies": [{"body": "Fair enough. I would say we have different risk appetites and it depends on our age, life goals, and understanding of the market. You made a really good point about my worst-case scenario. However, I disagree with you that this is a cheerleader post for the wheel. I am writing down my thoughts and my investment process to let people question me so I can learn and improve my strategy. That's my purpose. After reading your comment, I would not change any thing about my strategy because I don't see holding a bag of high free cash flow company or sp500 index will be a disaster for my wealth. Thank you so much for reading and the discussion. Good luck to you with your strategy.", "score": 1, "replies": [{"body": "100% of people in ThetaGang say \" I will be fine if I am assigned at this price\" and when the underlying goes down by 20% roughly 95% of those all of a suddenly regret being assigned at that price.\n\nCompanies that have overinflated prices, such as \"Magnificent 7\" companies, are not immune to 20% drops.\n\nTSLA is a great example of a company that could do no wrong, and now it's down like 33% from its 11/29/21 high.  On 3/30/22 TSLA was at 359, if you sold a DOTM 350 put on that day with 45 DTEs, it would have been down to 221 within that time frame and you would have lost dumb amounts of money, even though it was a darling of Wall St.  It's still at 246 now, so you would be a long way from profit even 18 months later.\n\nYou can think what you want about your risk tolerance, but you won't know until it's actually tested.  I can tell you, however, that the data says your risk tolerance is likely to, in reality, be far less than you suspect.", "score": 1, "replies": [{"body": "I went into the market in the end of 2021😂 experienced 26% drawdown and keep buying. That’s why I am not in the 100% u said. You like to say thing in a sure way smh😅Also, I don’t own Tesla.", "score": 1, "replies": [{"body": "Good luck with your drawdowns.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "\"market has been kind to me\"  \noccasionally the market will be so unkind to you that you will forget it was ever kind", "score": 2, "replies": [{"body": "Lol. Hopefully I will not see that day and if that happened, most of the stock owner will suffer too.", "score": 2, "replies": []}]}, {"body": "I like to wheel high volatility, low cost stocks, that are trading close to their 12 month lows. I try to sell weeklies. Get your cost base down quick and make a respectable return in short order if your shares get called away.\n\nNot sure if it's a great strategy, but it gives me something to do.\n\nI personally wouldn't wheel the big indexes as you won't outperform them most of the time. Wheeling high vol expensive shares (eg TSLA) is too high a risk of bag holding.", "score": 2, "replies": [{"body": "I have been exploring volatile, lower-price stocks recently. I get uncomfortable once I think about whether I will be able to hold it if it goes down 30% or more without fundamental support. But what you said also makes sense, maybe I should try a few hands or on-paper trades first.\n\nI also think different personalities should use different tools for their investment journey. There is no right or wrong. I wish you good luck man.", "score": 1, "replies": []}]}, {"body": "Wheeling without timing the windows is foolish.\n\nYou have to take advantage of momentum Green Day’s and never sell through earnings. Unless you want to a high chance of assignment with a CSP.\n\nA surprise announcement during earnings and that stock is ripping upwards and you missed out on a big move. At that point put values plunge and it’s going to be impossible to get a decent price avg unless the macro market moves downward to help you get another chance of entry.", "score": 2, "replies": [{"body": "I do time the windows and take advantage of the momentum. Didn't mention it in my post because it is already way too long. For example, I have already churned my weekly CSP three times last week because I could easily get 50% profit in a day or two. How well did the B&H investors do? They will outperform my CSP without a doubt. But did they foresee the bullish week ahead? I doubt so. The advantage of selling CSP is I don't have to time the market, if it goes against me I still have a cushion. If the cushion is being touched, I still can roll or sell the call, etc.\n\nI am thinking hard about missing out on a big move too. I am also curious about how other investors react if their holdings have a big jump. Do they normally sell? Or keep holding? All I do know is I can't time the market. With CSP I am quite sure I could earn a 12%-20% return a year except in the bearish year all my CSP got assigned and I am holding a bag of magnificent 7 and s&p500 index. In the bearish year, how do the B&H investors do when they get trapped because they try to catch the big jump up?", "score": 1, "replies": []}]}, {"body": "Ok, the secret sauce for me is a more complicated version of the wheel. Basic strat plus extras. I.e  I may hold shares in an index and want more hence some CSPs on said index. Also, and, at the same time be selling CCs on some of the, and laddering them out over consecutive  expirations  So... a bit of delta balancing and some  sprinkle of my directional view at the time.  PS I could not do all this with a small a/c.   Oh, and some more points.  1.My percentage return is quite small. 2. I don't give a flying freddo if I beat the index or not. 3. By extension, I don't mind holding some of the underlying shares.  And need to to cover my margin. \nAnd I do live of this faffing about.\nNot some ridiculous amount tho.", "score": 2, "replies": [{"body": "Thanks for sharing. I will think about it. Good luck to you!", "score": 1, "replies": []}]}, {"body": "Wheel away! It’s literally free money", "score": 0, "replies": [{"body": "It is not free money. Need to think carefully before entry and risk management after entry.", "score": 0, "replies": [{"body": "/s\n\nSorry, bro. Forgot to tack this on.", "score": 1, "replies": []}]}]}, {"body": "It’s the equivalent of playing ace-queen in poker: win small hands, lose big ones", "score": 0, "replies": [{"body": "I think the odds are better than in poker. Also, I could sell Deep ITM call if my CC cannot generate enough of premiums for my stock. Furthermore, how does B&H not end up losing the big one? B&H or Wheeling all come down to fundamentals and stock picking anyway.", "score": 1, "replies": []}]}, {"body": "Wheels get punished by trends: up or down. An option gets exercised during the wheel when you could have bought lower (CSP assigned) or sold higher (covered call exercised). You effectively always buy above market and sell below market. That’s the risk for collecting the premium.", "score": 1, "replies": [{"body": "If I just buy or sell stocks at the market price I am most likely not to sell at the highest or buy at the lowest anyway. By selling CSP, I am guaranteed that at least I will buy lower than current. Need to emphasize that I don't trade the price, I am using Wheeling for long-term investing in quality companies.\nThanks for replying!", "score": 1, "replies": []}]}, {"body": "When you pay taxes on B&H, usually it's long-term cap gains: taxed at **15%**\n\nWhen you pay taxes on wheel, usually it's short-term cap gains: taxed at **45%** (depending on your bracket)\n\nThat means for wheel to do better, in head-to-head, you need to beat the SPY by +50% the market returnsFootnotes\n\n1. There are lots of assumptions to extrapolate, but that's why it's too good to be true.\n2. Ultimately, options are a way for financial institutions to charge you more in fees OR hedge their own positions. More sophisticated investors understand the risk/reward and statistically, the house usually still wins over the little guy.\n3. Now if you don't mind being assigned and end up transitioning to a B&H strategy, then you should be fine. Just know what your strategy is and diversify because no one has a crystal ball.", "score": 1, "replies": [{"body": "Yeah. I don’t mind owning the stocks if I got assigned and the CC is no longer able to generate enough of premium. Also, I am not subjected to the US tax law. In my country, we don’t pay any tax for capital or trading gains. Thanks for the heads up and information btw.\nGood luck!", "score": 1, "replies": []}, {"body": "Do you have the US  Treasury Regulations on those taxes that you mentioned? I would love to read them.", "score": 1, "replies": []}]}, {"body": "Yeah…until you’re a couple years in you can’t understand the troubles that come. Was crushing it last year with wheel until I got cocky and sold puts 25% under current price for Amazon earnings and ended up losing big. Nothing is ever free", "score": 1, "replies": [{"body": "But do you want to own Amazon in the first place? I didn’t wheel on AMZN because I don’t think their business model is lucrative, also it is in a capital intensive industry, except for the cloud business section. I only wheel the stocks I don’t mind owning.", "score": 1, "replies": []}]}, {"body": "No strategy is too good to be true. You'll find that out when 6 months of wheeling gets wiped out in a week. We haven't really had a super turbulent move since 2020", "score": 1, "replies": [{"body": "Even the premium get wiped out I ended up holding my favorites company at a lower price compared to just buy at the market price I will just come out better after the 2020 covid recover. The problem is u have to hold the company u want to invest in at the first place.", "score": 1, "replies": []}]}, {"body": "Number 1 advice: Learn how to roll and WHEN to roll\n\nIt will save your ass don’t let the rest of the sub convince you otherwise!", "score": 1, "replies": []}, {"body": "The wheel should smooth out your profit and loss over time, but you will not outperform a buy-and-hold strategy. Reducing risk is part of the program. You don't get rewarded over time for reducing risk.", "score": 1, "replies": [{"body": "Seems like I would be able to do 12-20% a year if I perform consistently. I am not sure diversified B&H has the same result tho.", "score": 1, "replies": []}]}, {"body": "You'll do okay in a bear market, you'll think you're a genius.  But in a bull market where the serious gains are made you'll miss out.  But it's not the worst choice if you're risk averse and want to preserve your capital.", "score": 1, "replies": [{"body": "Based on my calculation, I would be able to earn 12-20% annually in not very bearish market. I thought it is hard to earn that if you buy and hold in diversified portfolio?", "score": 1, "replies": [{"body": "If you can earn 12 to percent 20 percent every year then you should do your strategy", "score": 1, "replies": [{"body": "That is my past performance and estimates. I believe most of the active investors will have a ballpark number of when to profit, how much the profit is, and the expected return, etc. \nI hope I can achieve this as I hope you can achieve yours. Good luck👍", "score": 1, "replies": []}]}]}]}, {"body": "That’s an understatement.", "score": 1, "replies": []}, {"body": "You end up overpaying for stocks when your puts get assigned and missing out on gains when your calls get assigned. One bad put assignment can wipe out the premium you’ve collected.", "score": 1, "replies": [{"body": "I do buy and hold at the beginning of my journey during the end of 2021. Seems like overpaying or not depends on luck (I am unlucky that I have the funds to invest at the end of 2021). I think one thing unfair for people to compare BandH with wheeling is people always assume that they will buy before the bull market, which is not true in most cases. Also, as you earn more income from your job in the future, your dollar cost average method used on the stock will make your holding cost higher. It is unrealistic to think you have saved up enough cash and are all into the market when the market is just about to fly.", "score": 1, "replies": []}]}, {"body": "You feel real smart until the stock whipsaws and you panic", "score": 1, "replies": [{"body": "the current market is whipsaw-ing, but I am still good. I can also roll, sell at higher IV and further, etc. if bigger whipsaws happen. Actually, I think the wheeling strategy benefited if the stock whipsaws.", "score": 1, "replies": []}]}, {"body": "Not when the underlying drops 5% after you just sold atm puts.", "score": 1, "replies": [{"body": "I only do .15 delta. Sell ATM while don't want to hold the stock for me is just equivalent to suicide.", "score": 1, "replies": []}]}, {"body": "The strategy doesn't work if market tanks. U end up holding capital.", "score": 1, "replies": [{"body": "Neither does B&H work when the market tanked. You ended up with the same or even worse unrealized loss", "score": 1, "replies": []}]}, {"body": "Whether it’s bullish or super bullish, at least you have skin in the game and are making money. In a bearish market, you will lose like the rest of her more than likely. Or you pick the right stock in the right strike price and make out fine.", "score": 1, "replies": []}, {"body": "Outliner moves to the downside will cause a large draw down. Outliner moves to the upside causes under performance. Capital intensive unless you sell naked and when you get called you'll need the capital anyway.", "score": 1, "replies": []}]}
{"title": "$TSLA Daily Thread - October 04, 2023", "selftext": " Fun chat. No comments constitute financial or investment advice. ☿️ 🐪", "id": "16zcu5w", "created_utc": 1696391108.0, "score": 42, "upvote_ratio": 0.98, "num_comments": 497, "comments": [{"body": "Anybody remember 800B > 1.2T MC in 12 trading days in 2021. That's some real euphoria", "score": 23, "replies": [{"body": "Was only the best time of my life", "score": 15, "replies": [{"body": "My friend and I went to Arby's that day after supercharging, and I accidentally rang the thank-you bell a little too loud like an asshole", "score": 7, "replies": []}, {"body": "That was a great time, wasn't it?", "score": 6, "replies": []}]}, {"body": "I vaguely recall commenting top 10 closing prices", "score": 9, "replies": []}, {"body": "followed immediately by elon's survey", "score": 7, "replies": [{"body": "[https://youtu.be/w1gCW\\_66zzc?si=wQjcIrVHmNCaL\\_Gx](https://youtu.be/w1gCW_66zzc?si=wQjcIrVHmNCaL_Gx)", "score": 3, "replies": [{"body": "Man, the guys on the very back that fell first could have easily been pinned underwater.", "score": 3, "replies": [{"body": "Lounge members who margined at the top, RIP", "score": 5, "replies": [{"body": "oooof", "score": 2, "replies": []}]}]}]}]}, {"body": "Yeah i remember. Made so much money. Then lost all because the runup ironed my brain. No wrinkles, all smooth", "score": 10, "replies": [{"body": "Trying to time the markets or do fancy options humbles us all", "score": 4, "replies": [{"body": "I would have been fine if I had a plan for what to do with the money. I would have sold and done those things. Oh well", "score": 2, "replies": []}]}]}, {"body": "Yup wish I followed my gut and sold the ath. I'm tax sheltered.", "score": 4, "replies": [{"body": "Yep don't we all. The same trading mentality would have got many burned in the 20x upswing though.", "score": 5, "replies": []}]}]}, {"body": "I strongly recommend missing delivery estimates moving forward", "score": 16, "replies": [{"body": "Ya seems to do the trick 🤣", "score": 1, "replies": []}]}, {"body": "$300 EOY would be nice", "score": 16, "replies": []}, {"body": "Crayons says big gap above to fill to 299.", "score": 14, "replies": [{"body": "Acceptable", "score": 6, "replies": [{"body": "Yall are making me want to sell my $TSLY and go all in on $TSLL", "score": 3, "replies": [{"body": "My guy just no", "score": 2, "replies": [{"body": "Didnt say I plan to. 😜", "score": 3, "replies": []}]}]}]}]}, {"body": "Did Elon delete his twitter account?", "score": 13, "replies": [{"body": "That would be the +30%", "score": 27, "replies": [{"body": "More like 420%", "score": 8, "replies": []}]}, {"body": "![gif](giphy|yQodNVIbIKrEKRUyGE|downsized)", "score": 5, "replies": []}]}, {"body": "https://x.com/sawyermerritt/status/1709688774232297932?s=46&t=iDJc5xUSXXqzW3sSmfWXNA\n🐓 shook", "score": 12, "replies": [{"body": "Ouchie mama", "score": 3, "replies": []}, {"body": "he can go cry with his hookers lmao", "score": 3, "replies": []}, {"body": "![gif](giphy|j9mqKgQvkNOziGICfd|downsized)", "score": 1, "replies": []}]}, {"body": "Really should do a presser on cybertruck before it all leaks out in shitty cell videos", "score": 11, "replies": [{"body": "elon will blue ball us until the last possible minute then \"like\" a tweet from james cat the night before to confirm deliveries", "score": 10, "replies": [{"body": "Will be funny if Tesla does nothing to announce the start of deliveries.  They just start delivering them lol.", "score": 2, "replies": [{"body": "Funny?", "score": 3, "replies": [{"body": "The cure for any problem is to laugh at it", "score": 1, "replies": [{"body": "Its laughable that's for sure", "score": 1, "replies": []}]}]}]}]}, {"body": "Only if Elon can fit it in between diablo livestreams", "score": 8, "replies": [{"body": "Tucker can host it", "score": 6, "replies": []}]}]}, {"body": "cybertruck just not gonna have a price, gonna be the if you have to ask...", "score": 11, "replies": [{"body": "*You must own a model s before receiving CT price", "score": 5, "replies": []}, {"body": "It'll be priced in Eurodollars", "score": 3, "replies": [{"body": "doge coins", "score": 3, "replies": []}]}]}, {"body": "Might be a planned run-up into earnings and then a dump after. Stay frosty.", "score": 12, "replies": [{"body": "yeah I’m not celebrating yet", "score": 7, "replies": []}, {"body": "As per usual.", "score": 2, "replies": []}]}, {"body": "&#x200B;\n\nhttps://preview.redd.it/6enagyu0k5sb1.jpeg?width=764&format=pjpg&auto=webp&s=19eda1935c072bffeae10a62fdc51268932cbd72", "score": 9, "replies": [{"body": "Thanks china", "score": 4, "replies": [{"body": "And fuck you IEA", "score": 3, "replies": []}]}, {"body": "wow that is a great picture!", "score": 3, "replies": []}, {"body": "🤯", "score": 2, "replies": []}, {"body": "What are the horizontalish lines? Some stupid past predictions?", "score": 2, "replies": [{"body": "Those are past predictions from the International Energy Agency, which gets a 30 million dollar yearly budget to give governments around the world valuable policy recommendations using their accurate predictions. In part graciously supported by the [coal industry](https://www.iea.org/about/structure/coal-industry-advisory-board)\n\nThey have been discouraging renewable investments and encouraging fossil fuels for decades by making it look like it'll take a century to replace fossil fuels and huge subsidies will be needed to grow RE capacity.", "score": 3, "replies": [{"body": "I guess results aline with incentives. Shocking", "score": 3, "replies": []}]}]}]}, {"body": "🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀", "score": 10, "replies": []}, {"body": "[https://x.com/matthewdr/status/1709653623976972341?s=46&t=yWmMeP08cyApbkkhK1zkcw](https://x.com/matthewdr/status/1709653623976972341?s=46&t=yWmMeP08cyApbkkhK1zkcw)\n\nSupposed leaks from someone who supposedly test drove Cybertruck last night.\n\nhttps://preview.redd.it/o1dxglfya9sb1.jpeg?width=1284&format=pjpg&auto=webp&s=227e67324888edee98eed2a47655b1b0a97542b5", "score": 9, "replies": [{"body": "Tony Soprano would love these specs.", "score": 8, "replies": []}, {"body": "Please don't be stupid expensive", "score": 6, "replies": []}, {"body": "To me, the most amazing part is a 5 7 person being able to lie flat in the front, I did not get the impression it was a very large frunk.\n\nBiggest question to me would be if there will be a connection between the bed and the cab, potential for airco and what size of connection (if there is one, because the tonneau cover would need a lot of space probably)", "score": 5, "replies": [{"body": "I’m pretty confident the rear window goes down. tesla published the wiring diagram during investor day and it included a button by the rear window", "score": 5, "replies": [{"body": "Yup, it does go down", "score": 2, "replies": []}]}]}, {"body": "Does he know that a frunk is the front trunk? He means truck bed right?", "score": 4, "replies": [{"body": "I thought the same thing, but what is the width of the cybertruck?\n\nThe bed is suppose to be over 6 feet, so a 5' 7\" wouldn't be spectacular in any way.\n\nAt 6' 8\" wide, that would leave 11 inches of room on the sides of the frunk, or 5,5 inch each side, which isn't impossible. If the person isn't laying straight, there's extra space.\n\nThat would imply a huge space available in the frunk.", "score": 4, "replies": [{"body": "The leaker clarified that he was in “sleeping position.” But didn’t say what exactly that meant.", "score": 3, "replies": [{"body": "Hm, it said laying flat, normally you would read that as not on your side.\n\nIf it's foetal position, that's still good but not impressive.", "score": 2, "replies": []}]}, {"body": "Ohhh. Hmm 🤔", "score": 2, "replies": []}]}, {"body": "I’m pretty sure someone as handsome as him knows what he’s talking about", "score": 2, "replies": []}]}, {"body": "There’s a ton of information in there, any idea if it’s a reliable source?", "score": 2, "replies": []}, {"body": "Has to compete w fords v2g horseshit", "score": 2, "replies": []}]}, {"body": "Chicken dumbass 🤣", "score": 10, "replies": []}, {"body": "Happy 1 year anniversary of twitter shitshow", "score": 18, "replies": [{"body": "&#x200B;\n\nhttps://i.redd.it/litxgvi097sb1.gif", "score": 11, "replies": []}]}, {"body": "CT to have options for additional accessories\n\nhttps://preview.redd.it/qp9teryal9sb1.jpeg?width=4096&format=pjpg&auto=webp&s=15b21a9e60c50667800d1b41f2cc7f4e77bc2964", "score": 10, "replies": [{"body": "Can we strap one of those trailers to the stock price?", "score": 5, "replies": []}]}, {"body": "Ark continued selling of golden NVDA/TSLA to buy garbage.", "score": 10, "replies": [{"body": "dumb", "score": 5, "replies": []}]}, {"body": "This is what happens when everyone knows deliveries gonna miss and so shorted and bought puts for this week. Then Mr market maker says uh uh uh not that easy.", "score": 16, "replies": []}, {"body": "Rivian raising money diluting stock. Stock down 6% after hours. Lol at chicken", "score": 16, "replies": []}, {"body": "Just a few more +$15/day please\n\nReally want that $300 (then $400)", "score": 8, "replies": []}, {"body": "Guy who drove CT for 30 mins \n\nhttps://twitter.com/i/spaces/1BdxYrlVgqzKX", "score": 8, "replies": [{"body": "Just do a damn CT release event Tesla.\n\nIt's gotta be close", "score": 8, "replies": []}]}, {"body": "https://preview.redd.it/39uhcfv8f7sb1.jpeg?width=1231&format=pjpg&auto=webp&s=16c7bdf1d5e8b52a69b590e205903474241b24a8\n\nMy bird died 2 years ago now and I haven't gotten another pet :(", "score": 15, "replies": [{"body": "We are srsly considering a Savannah tho.", "score": 7, "replies": [{"body": "I JUST READ THIS ATFER I RECOMMENDED YOU A SAVANNAH", "score": 5, "replies": []}]}, {"body": "My bird died 20 years ago and I dont even have a picture..", "score": 5, "replies": [{"body": "![gif](giphy|UxfsGceQWS8Cvq5Ltw|downsized)", "score": 3, "replies": [{"body": "😂", "score": 1, "replies": []}]}]}, {"body": "I’m sorry to hear about your bird. But if your looking for a really fun pet that isn’t much work you should look into a Savannah cat", "score": 4, "replies": [{"body": "Yep.\n\nWill it spend all of its time climbing my expensive curtains though? 😂", "score": 3, "replies": [{"body": "A good amount for sure. That’s why I keep him in my parents house climbing their expensive curtaibs", "score": 2, "replies": []}]}]}]}, {"body": "first 🟢", "score": 7, "replies": [{"body": "🔥🔥🔥", "score": 5, "replies": []}]}, {"body": "[https://twitter.com/teslahongkong/status/1709127848861278458](https://twitter.com/teslahongkong/status/1709127848861278458)\n\nmore highland roll out", "score": 7, "replies": [{"body": "Wen usa", "score": 2, "replies": []}, {"body": "say it with me osssbornnenee", "score": 2, "replies": []}]}, {"body": " https://x.com/elonmusk/status/1709237921549541735?s=20 \n\nIs there someone here who can tweet Elon and let him know that early adopter FSD beta owners are still on an early-2023 software build (2023.7.x) and have gotten no new features since like February?", "score": 7, "replies": [{"body": "I'll hit him up in diablo 4", "score": 5, "replies": []}, {"body": "2023.27.6 is rolling out faster now, I got it a couple days ago.  It's a welcome catch-up upgrade.", "score": 3, "replies": []}, {"body": "It’s super annoying, I agree. Sometimes wish I could just opt back out to the retail version that includes 11.4.4. Driving wise it makes no difference 11.4.4 vs. 11.4.7 as FSD is pretty weak on both versions but at least you get all the updated goodies that we’ve missed out on over the past half year.", "score": 2, "replies": []}, {"body": "No one in here simps hard enough for Elon to notice them", "score": 3, "replies": []}]}, {"body": "anyone in here using schwab?  td ameritrade switching over to schwab EOM and i kinda like td.", "score": 6, "replies": [{"body": "I was using TD's API for my trading bot and too busy to look into schwab's API. Fuck schwab for buying TD.", "score": 4, "replies": []}, {"body": "I use it. Don't like the interface but don't trade much, and my jobs 401k is through Schwab too so convenient to see all accounts at once.", "score": 3, "replies": []}, {"body": "The mobile app experience seems to be a downgrade. TD was better.", "score": 2, "replies": []}, {"body": "Is it EOM? I am still on TDA and haven't received any emails about the transition.", "score": 1, "replies": []}, {"body": "I like streetsmart edge. I've been having up TOS at the same time and I can see the usefulness but just not used to it.\n\nThe schwab website and app are terrible though.", "score": 1, "replies": []}, {"body": "I like Schwab. Their investor checking account is awesome. Super quick transactions, unlimited ATM fee refunds from anywhere in the world, good customer service.", "score": 1, "replies": []}]}, {"body": "Wow what’s going on! What a nice bday surprise +10!", "score": 7, "replies": [{"body": "Happy B-Day", "score": 8, "replies": []}]}, {"body": "Green cures all (well, most)", "score": 6, "replies": []}, {"body": "Keep those Tesla tweets coming E. We love u.", "score": 7, "replies": []}, {"body": "I like today", "score": 6, "replies": [{"body": "Round of applause to the loungers... solid banter today. You da real MVPs\n\n![gif](giphy|Swx36wwSsU49HAnIhC|downsized)", "score": 5, "replies": [{"body": "Dambledoor ded fyi", "score": 0, "replies": [{"body": "snek kil dambledoor", "score": 1, "replies": []}]}]}]}, {"body": "Yo oil wtf some Saudi man is getting beheaded for today", "score": 6, "replies": []}, {"body": "Jokes on me for waiting for a further dip to rebuy 3x. At least I'm almost all in in shares 🤣.\n\nOn another note how's everyone doing? So busy lately that my hairline is receding at 21 /s", "score": 7, "replies": [{"body": "Buy enough $TSLA and no one will care about your hair, maybe not even you", "score": 3, "replies": []}, {"body": "Re. hairline, are you getting enough Vitamin D? I started losing my hair in grad school, started taking D, hair loss reversed.", "score": 3, "replies": [{"body": ">started taking D\n\nProtein is very important", "score": 2, "replies": []}, {"body": "I was joking mate, therefore the /s", "score": 1, "replies": []}]}]}, {"body": "trading range getting narrow", "score": 7, "replies": [{"body": "Return of the wedge?", "score": 4, "replies": [{"body": "Oh my. Remember the wedge will save us 🥹", "score": 2, "replies": []}]}]}, {"body": "hey we're green on the 1Y again!", "score": 6, "replies": [{"body": "Given how the end of last year went, we better be green on the 1Y going forward!", "score": 3, "replies": []}]}, {"body": "ndx down 6.0% vs. tsla down 1.5% on the monthly - that's a big win", "score": 5, "replies": [{"body": "Esp with those delivery numbers", "score": 5, "replies": [{"body": "Thanks jonas", "score": 5, "replies": []}]}, {"body": "ndx up 10% on half year, TSLA up 30%.. looking good!", "score": 4, "replies": []}]}, {"body": "Rotate out of Crackdaq and into Tesler", "score": 5, "replies": []}, {"body": "Pretty big volume today I think?  Like 40% of average in just 1.25 hours of trading.", "score": 6, "replies": []}, {"body": "https://twitter.com/niccruzpatane/status/1709567340050841696?t=Y_zPA7gt72kQJXdXkj5PPg&s=19", "score": 6, "replies": [{"body": "That’s corny af", "score": -3, "replies": [{"body": "Tesla pR always been cringe level", "score": 1, "replies": []}]}]}, {"body": "Ah yes.. the “somebody knows something” pump", "score": 6, "replies": [{"body": "the best type of pump", "score": 4, "replies": []}, {"body": "Followed by the dump it dump tomorrow. Lol", "score": 3, "replies": [{"body": "![gif](giphy|dXFKDUolyLLi8gq6Cl|downsized)", "score": 3, "replies": []}, {"body": "maybe you should short it today then", "score": 4, "replies": [{"body": "Naw. I've had a few oct 20 300 calls out for 5 weeks now. Just wouldn't be surprised it the clowns dumped tomorrow.", "score": -2, "replies": []}]}]}]}, {"body": "Wish I could know for sure if we will dump tomorrow", "score": 5, "replies": []}, {"body": "Focus dammit, you all start celebrating and those fuckers are gonna pull the rug\n\nAnd keep up the good work!", "score": 7, "replies": []}, {"body": "we’re up several dollars from this time last october siiick  \n\ncurrently very bored waiting at doctors office 😴", "score": 7, "replies": []}, {"body": "can we just take a minute & soak in the fact that all of our factories are now pumping at full speed (🙏) while the big 3 is literally limping along, factories shuttered, until they agree to mortgage their future even more than they already have", "score": 17, "replies": [{"body": "+ free built-in call options on FSD and Optimus 🤖", "score": 5, "replies": []}, {"body": "Price cuts coming,  ramping supply while tweeting for demand. The tesla 4d chess.", "score": 4, "replies": [{"body": "it's ok 80% margins EOY", "score": 5, "replies": [{"body": "Bot will save us", "score": 3, "replies": []}]}]}]}, {"body": "Twitter is on a real hot streak... Linda said 90% ad return, then Ackman praised the hell out of it saying it's better than ever and highly unique/investable, Elon into game livestreaming, then Gaetz/McCarthy showdown, now ADL back and supporting. Bodes well for no more selling.", "score": 16, "replies": [{"body": "Also means Elon's next project is just around the corner 😋😂", "score": 9, "replies": []}, {"body": "would be cool to see if Twitter/X could disrupt twitch. Incorporate X Subscriptions into a no-ad viewing experience like the twitch sub offers. They would also need to tackle the chat experience and ability to watch on connect TV devices (firestick,ATV)", "score": 7, "replies": [{"body": "Literally every twitch streamer hates twitch. Trainwrecks tried to suck people away via kick.com and it sorta worked but not quite as most people are afraid to lose their viewer base without sign on deals.\n\nThe difference with twitter, however, is that all twitch streamers reach out to their communities via twitter and already have accounts. Could work. Need a good UI.", "score": 9, "replies": []}]}, {"body": "linda bae", "score": 7, "replies": []}, {"body": "One 3 am tweet could undo all of yaccarinos good work. Let's hope it doesnt.", "score": 9, "replies": []}]}, {"body": "We need some celebrity to tell everyone the truth about gas cars and evs. Who should it be? Probably Leno.", "score": 14, "replies": [{"body": "T. Swift and we'd be in quad boob territory", "score": 13, "replies": [{"body": "She's too woke to do it", "score": 7, "replies": []}, {"body": "And her boyfriend. Whats his name? /s", "score": 4, "replies": []}]}, {"body": "you're telling me Tesla neckbeard isn't cutting it?", "score": 3, "replies": [{"body": "he is the taylor swift of simps", "score": 1, "replies": []}]}, {"body": "Tesla Optimus w chatgpt integrated when it can walk \nlike a normal human being.", "score": 3, "replies": []}, {"body": "If Jay doesn’t do it we’re left with Joe Rogan and Ben Shapiro", "score": 3, "replies": [{"body": "Add in Tucker and we might be able to make a difference with the part of the market that’s been slow to adopt", "score": 5, "replies": [{"body": "it appears that segment of the market has converted elon, rather than the other way around", "score": 3, "replies": [{"body": "To quote Michael Jordan - “Republicans buy sneakers, too” \n\nHave to drag that segment into the future. Won’t pretend I know how to do that but getting someone they trust to position the benefits of EVs probably wouldn’t hurt", "score": 2, "replies": []}]}]}, {"body": "Joe Rogan likes gas engines too much. He likes to ride a vibrating throbbing loud noisy... car.", "score": 1, "replies": []}]}, {"body": "The almighty god himself", "score": 3, "replies": []}, {"body": "Mike Tyson", "score": 2, "replies": [{"body": "![gif](giphy|eruVMzXlb70oo)", "score": 6, "replies": []}]}, {"body": "Ur pretty popular on here", "score": 1, "replies": []}, {"body": "Mr. Bean", "score": 1, "replies": []}]}, {"body": "🚀", "score": 4, "replies": [{"body": "🚀🚀", "score": 3, "replies": []}]}, {"body": "Been playing Hogwarts Legacy. Quite good.\n\nHave BG3 but I think I might be too much of a filthy casual for it at this point.", "score": 5, "replies": []}, {"body": "are disney and target just gonna bleed to zero?", "score": 5, "replies": [{"body": "Buying opportunity", "score": 4, "replies": []}, {"body": "Go woke go broke.", "score": 6, "replies": []}]}, {"body": "grabbed 50 mo’ this morning at 250.69", "score": 4, "replies": []}, {"body": "Chicken was right", "score": 6, "replies": [{"body": "he's so smart", "score": 5, "replies": []}, {"body": "🐔🤡", "score": 4, "replies": []}]}, {"body": "https://preview.redd.it/mmiudoy0u7sb1.jpeg?width=512&format=pjpg&auto=webp&s=85155f4f7540524d04a42ca2b02a045ef3753ca4", "score": 4, "replies": []}, {"body": "Apologies if posted before, I've been somewhat busy lately, but in this video at 2:20 he mentions there was an event for Giga Nevada employees regarding expansion. Hopefully it's true and we get some good news soon https://x.com/HinrichsZane/status/1708850978626420762?s=20", "score": 5, "replies": [{"body": "Gonna be a stretch to make 50k semis there next year imo", "score": 7, "replies": [{"body": "they've done \\~60 since December so I will agree with you", "score": 6, "replies": []}, {"body": "&#x200B;\n\nhttps://preview.redd.it/x040rh4c48sb1.jpeg?width=381&format=pjpg&auto=webp&s=389bc667a3472475af682ba0c992bece851447c8", "score": 3, "replies": [{"body": "Love a good Ted reference", "score": 3, "replies": []}]}]}]}, {"body": "Back from a 3-day Reddit-wide ban. \n\nNote: do not suggest double mXrdeX even if you add “not srs” to the comment.", "score": 5, "replies": [{"body": "Reporting this post now.", "score": 3, "replies": [{"body": "#rope\n\n🪦", "score": 3, "replies": []}]}, {"body": "The internet is not like it used to be. You get bans for almost anything.", "score": 2, "replies": [{"body": "Good", "score": 3, "replies": [{"body": "Please ban this gentlemen", "score": 6, "replies": [{"body": "I could use the victim complex right now.", "score": 3, "replies": [{"body": "Sounds like you need a Savannah cat!", "score": 0, "replies": [{"body": "Can it change diapers?", "score": 1, "replies": [{"body": "Probably", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "gonna splurge & do saltines with my ramen tonight", "score": 5, "replies": []}, {"body": "Wen bewbs", "score": 6, "replies": []}, {"body": "why is this happening wtf", "score": 4, "replies": [{"body": "Nateleb switched over to rivian", "score": 5, "replies": [{"body": "better for all involved", "score": 1, "replies": []}]}, {"body": "🖍️ said recovery was mandatory today!", "score": 1, "replies": [{"body": "Crayons on TSLA or macro?", "score": 3, "replies": []}]}]}, {"body": "[$GM CTO Exits After One Month: The Information](https://x.com/marketrebels/status/1709652398711435710?s=46&t=WyhsS8WzmgKtgEuHZzFOrA)", "score": 6, "replies": [{"body": "Seems like he was at GM for decades though [https://www.thejewishnews.com/news/business/gms-new-chief-technology-officer-gil-golan-drives-innovation-for-a-zero-emissions-future/article\\_1f59908a-4ffa-11ee-835b-cf6d5a44f999.html](https://www.thejewishnews.com/news/business/gms-new-chief-technology-officer-gil-golan-drives-innovation-for-a-zero-emissions-future/article_1f59908a-4ffa-11ee-835b-cf6d5a44f999.html)", "score": 4, "replies": []}]}, {"body": "Wow Crude -5%", "score": 4, "replies": [{"body": "Good", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "This guy stonks", "score": 2, "replies": []}, {"body": "Cybertruck release date likely became insider knowledge today.", "score": 2, "replies": []}]}, {"body": "[https://twitter.com/TheGregYang/status/1709700104951931077](https://twitter.com/TheGregYang/status/1709700104951931077)\n\nNew Paper from xAI member \\^", "score": 5, "replies": []}, {"body": "Am hyped for cybertruck release starship launch. Both soon I hope.", "score": 6, "replies": []}, {"body": "https://preview.redd.it/9kl71utdi6sb1.jpeg?width=2290&format=pjpg&auto=webp&s=a1f7ad178aa8eced4fb5a5977d317c8b6175365b\n\nSo glad I have a Savannah Cat\n\nPost your pet pics down below ⬇️", "score": 10, "replies": [{"body": "https://preview.redd.it/26r94px1v6sb1.jpeg?width=2070&format=pjpg&auto=webp&s=769c939ed560d14d07b4fd426b115e88e1886348\n\nHenri", "score": 8, "replies": [{"body": "Hi Henri 👋", "score": 4, "replies": []}]}, {"body": "Puppy Enzo\n\nhttps://preview.redd.it/gw8d0oaux6sb1.png?width=2049&format=png&auto=webp&s=9f1bde3a8fe1490eeebb9ba1bd81ecf274547c56", "score": 8, "replies": [{"body": "Hello Enzo!", "score": 2, "replies": []}]}, {"body": "Not mine, but saw this cool cat in Mexico City yesterday\n\nhttps://preview.redd.it/twfq577m27sb1.jpeg?width=3024&format=pjpg&auto=webp&s=9b7713411621f1e3d867c03005531344baea870c", "score": 5, "replies": [{"body": "O wow look at that", "score": 2, "replies": []}]}, {"body": "And here is mine (Bonsai)\n\nhttps://preview.redd.it/y92w15qj37sb1.jpeg?width=3024&format=pjpg&auto=webp&s=facf1a58cd294b2cf29b9c93d1489c7e90553059", "score": 6, "replies": [{"body": "Hi Bonsai!", "score": 3, "replies": []}]}, {"body": "Kool cat", "score": 4, "replies": [{"body": "Thanks!", "score": 3, "replies": []}]}, {"body": "https://preview.redd.it/t2uc7r6697sb1.jpeg?width=4080&format=pjpg&auto=webp&s=360088dbf74054e77243fc666a1fa19bbe164363", "score": 3, "replies": [{"body": "Hello!", "score": 3, "replies": []}]}]}, {"body": "2nd", "score": 4, "replies": []}, {"body": "Why pre turn around?", "score": 3, "replies": []}, {"body": "STONKY PAMPING 😤😤😤", "score": 4, "replies": []}, {"body": "Yields peaked?", "score": 4, "replies": []}, {"body": "Wowz", "score": 5, "replies": []}, {"body": "Up 4.20%\n\nGood", "score": 3, "replies": []}, {"body": "Thoughts on Graffiti CT?", "score": 4, "replies": [{"body": "it's cool", "score": 5, "replies": []}]}, {"body": "I made a comment a awhile ago, market hadn't opened yet. \n\nJust check the stonk. Why bright green?", "score": 3, "replies": [{"body": "Stocks unpredictable in the short term. Cryptoflat circle nowhere to be found now", "score": 12, "replies": []}]}, {"body": "Just got my hands on AC mirage. I keep getting milked by ubisoft.", "score": 3, "replies": [{"body": "Is it worth it?\n\nI loved AC1, AC2 and Brotherhood but everything after that felt less and less like assassins creed.", "score": 1, "replies": [{"body": "i think it is for 50usd. and they went back to the old formula", "score": 2, "replies": []}, {"body": "The AC Pirate game was so good", "score": 4, "replies": []}]}]}, {"body": "[https://www.washingtonpost.com/business/2023/10/03/chipotle-robots-bowls-salads/](https://www.washingtonpost.com/business/2023/10/03/chipotle-robots-bowls-salads/?utm_source=reddit.com)\n\ninvest in the AI stock", "score": 4, "replies": [{"body": "Ty $20 min wage", "score": 1, "replies": []}]}, {"body": "Shiiiett , Macro green day, this market is in total uno reverse card/impossible to predict mode", "score": 5, "replies": [{"body": "Wall Street has no fucking idea what to do either. Bonds are mooning, bonds are cratering, JPow is powing, economy is mooning, economy is cratering, etc.", "score": 4, "replies": []}, {"body": "But cryptoflatcircle can, that's why he's a billionaire", "score": 6, "replies": []}]}, {"body": "![gif](giphy|IgNsf93WK4gbQtfhq6)", "score": 4, "replies": []}, {"body": "![gif](giphy|IQYoP7rv3Qz6g)", "score": 4, "replies": []}, {"body": "Are we allowed to celebrate now? 🥂 🥳 🥂 🥂 cheers everyone!!!", "score": 4, "replies": [{"body": "I'll celebrate when the 200 ma is 300", "score": 9, "replies": [{"body": "Yep", "score": 2, "replies": []}]}, {"body": "I’m celebrating when over 300 and then again at ATH and then again at 500", "score": 9, "replies": [{"body": "Reasonable", "score": 7, "replies": []}]}, {"body": "🍻", "score": 4, "replies": []}]}, {"body": "[https://www.reddit.com/r/electricvehicles/comments/17001wf/rivian\\_r1t\\_fender\\_benders\\_can\\_turn\\_into\\_40k/](https://www.reddit.com/r/electricvehicles/comments/17001wf/rivian_r1t_fender_benders_can_turn_into_40k/)\n\nsht..", "score": 4, "replies": [{"body": "Pointless dent repair that out", "score": 4, "replies": []}]}, {"body": "Anyone else think the Ioniq5 is already outdated looking? When it was announced I genuinely thought it looked cool, now I genuinely think it looks like shit", "score": 4, "replies": [{"body": "It looks really stupid in person", "score": 7, "replies": []}, {"body": "Yeah, its a good example why you want a design to look 'timeless'.\n\nIt kinda looks gimmicky now", "score": 7, "replies": []}, {"body": "I still like it", "score": 2, "replies": []}, {"body": "Model 3 us is out dated", "score": 1, "replies": []}]}, {"body": "Those of you that convert leaps to shares - are you selling the options and buying shares? Or exercising one or more and selling the rest?  Trying to wrap head around the best way to go about it.", "score": 3, "replies": [{"body": "depends on tax situation", "score": 8, "replies": []}, {"body": "Lose a bunch of money and you won't have to worry about taxes.", "score": 4, "replies": []}]}, {"body": "Elon on woke-mind virus rampage rn. He must be unhappy with how much the stock went up today.", "score": 12, "replies": [{"body": "priced in", "score": 8, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Oh please for the love of fucking god.\n\nHe can't sell TSLA stock until next year c'mon hurry.", "score": 3, "replies": []}]}]}, {"body": "4% yep looks like a glibglob first post day to me 😎", "score": 8, "replies": [{"body": "Going to have a hummus plate in your honour.", "score": 5, "replies": [{"body": "🙏🏼", "score": 3, "replies": []}]}, {"body": "![gif](giphy|HhWpLFOMqNTgI|downsized)", "score": 4, "replies": []}]}, {"body": "dam my first post skills on point today  \n\nmeanwhile f/gm nice and red 👌", "score": 7, "replies": [{"body": "❤️", "score": 3, "replies": []}]}, {"body": "Yeah up and to the right. What ever the reason is I don’t care. Just get me that mula", "score": 8, "replies": []}, {"body": "Barely says henlo TL from AZ\n\nhttps://preview.redd.it/fl7skefge7sb1.jpeg?width=4032&format=pjpg&auto=webp&s=f2a80f9c123ff21ce31029952014c1ce5e11a338\n\nhe also says go fukn tezler go", "score": 9, "replies": []}, {"body": "It likely is the fsd licensing deal innit", "score": 10, "replies": [{"body": "U wot m8?", "score": 5, "replies": []}]}, {"body": "The good thing about rn is that tesla is pressure testing it’s capacity for cost reductions. The beast will enter 2024-2025 incredibly lean", "score": 10, "replies": [{"body": "Seriously", "score": 3, "replies": []}]}, {"body": "Oil 💀", "score": 7, "replies": []}, {"body": "~~CPI~~ + ~~PPI~~ + ~~FED~~ + ~~P&D~~ + Earnings. Sacks bear thesis list getting mighty short!", "score": 6, "replies": []}, {"body": "Anyone with a late Cybertruck order have their specs disappear?\n\nMy 115 order switched to no specs a week after my 113 order switched. Curious to see if any 116 or later orders have changed.", "score": 3, "replies": [{"body": "I have a 11280 and and a 11131, both were without spec at the same time.\n\nI wonder how early in line my 11280 is, since I live in Europe, I wouldn't mind giving it away.\n\n(You can choose who the car gets registered to, I think I would have to change my location and I might get a relative early assignment. But you can't transfer the reservation itself from what I found.)", "score": 4, "replies": [{"body": "Interesting! I wonder how your location will affect the allocation.", "score": 1, "replies": [{"body": "Well, if my location remains in Europe, I won't get allocated at all.\n\nThat's why I'm willing to give it up.\n\nIf the Cybertruck comes to Europe, the 11131 shouldn't make much difference vs the 11280.", "score": 1, "replies": []}]}]}, {"body": "The 116? Is that the first 3 digits. Mine is 116. Maybe I'm a smooth brain but I don't know what to do with my reservation number.", "score": 2, "replies": [{"body": "Yes first 3 digits. When you click “Manage” does it still show vehicle specifications?\n\nThis photo is an early reservation that no longer shows vehicle specs\n\nhttps://preview.redd.it/bp30stxc96sb1.jpeg?width=1080&format=pjpg&auto=webp&s=8473428924b75ed6ed7dbc606396837a4bf7094c", "score": 1, "replies": [{"body": "I have the number saved in email. Lemme check", "score": 1, "replies": []}]}]}]}, {"body": "https://twitter.com/blueovalcity/status/1709317714978746785?t=COchWeD3d2G75Xdh_WTNCA&s=19\n\nHyped?", "score": 3, "replies": [{"body": "They got a make it with the cancelled battery factory?", "score": 1, "replies": []}, {"body": "Good for Ford.", "score": 1, "replies": []}]}, {"body": "Hooooold", "score": 3, "replies": []}, {"body": "taking a beautiful morning walk in chandler AZ\n\ntezlers is green and so is my charging cable icon thing at a rapid rate\n\nbusy SC station this morning as well.\n\nhttps://preview.redd.it/32aodn8237sb1.jpeg?width=1170&format=pjpg&auto=webp&s=296e90e382a2d7ef8bfda8912db304bb5937ff4d", "score": 3, "replies": [{"body": "betty white 😀", "score": 2, "replies": [{"body": "heehee", "score": 1, "replies": []}]}]}, {"body": "[https://x.com/xDaily/status/1709587950894285142?s=20](https://x.com/xDaily/status/1709587950894285142?s=20)\n\n🧵", "score": 3, "replies": []}, {"body": "wait what +9", "score": 3, "replies": []}, {"body": "[https://x.com/SawyerMerritt/status/1709568485217480959?s=20](https://x.com/SawyerMerritt/status/1709568485217480959?s=20)\n\nwhat's the bull case against using hydrogen vs electric?", "score": 3, "replies": [{"body": "There isn't one.", "score": 2, "replies": []}, {"body": "battery shortage", "score": 1, "replies": []}, {"body": "People still drive BEV and think hydrogen is viable, we still have a long way to go…it’s crazy!", "score": 1, "replies": []}]}, {"body": "how can he pump??", "score": 3, "replies": []}, {"body": "I haven't had time to follow news or the market today. What is going on?", "score": 3, "replies": [{"body": "We signed Taylor swift to sell teslas", "score": 10, "replies": [{"body": "Okay but could you imagine if they did? The cult would be buying out Tesla.", "score": 11, "replies": [{"body": "Yah I think it's a better idea than retard level price cuts", "score": 6, "replies": []}, {"body": "Ya Swifties would send out inventory  negative stock for a year", "score": 3, "replies": []}]}]}]}, {"body": "420 heehee. because of the marijuanas\n\nhttps://preview.redd.it/nnw73ndbt7sb1.jpeg?width=1170&format=pjpg&auto=webp&s=9ae8a4af7a08d084b7019b44bd7b31858332143d", "score": 3, "replies": [{"body": "I saw that too", "score": 3, "replies": [{"body": "wat a time to be alive", "score": 2, "replies": []}]}]}, {"body": "So quarter numbers means 0 shit", "score": 3, "replies": [{"body": "Yup its all about how many people lose their jobs, the more the better for stock", "score": 8, "replies": [{"body": "Our system is so flawed.  We're a bunch of (relatively) rich people actively rooting for others to lose their livelihood.  There has to be a better way.", "score": 6, "replies": [{"body": "Capitalism, ho!", "score": 3, "replies": [{"body": "Praying for government intervention is not exactly the same as capitalism… crony capitalism, perhaps.", "score": 2, "replies": []}]}, {"body": "Always been this way", "score": 2, "replies": []}]}]}]}, {"body": "That emergency alert system test scared the shit outta me. Was sitting right next to my phone and it was loud as fuck.", "score": 3, "replies": [{"body": "Are you a zombie now?", "score": 4, "replies": []}, {"body": "Just think, what if you had a prison phones", "score": 3, "replies": [{"body": "Alert leads to prostate orgasm, cavity search, and more charges.", "score": 3, "replies": []}]}, {"body": "Interesting that Russia also had emergency alert tests today ![gif](emote|free_emotes_pack|thinking_face_hmm)", "score": 2, "replies": []}]}, {"body": "gm looking to bust through that multi decade $30 support level", "score": 3, "replies": []}, {"body": "Don't be a donkey.", "score": 3, "replies": []}, {"body": "What will it take for the media to finally refer to some controversial matter as “Elongate”…", "score": 3, "replies": [{"body": "That was the horse for handy episode", "score": 7, "replies": [{"body": "I suspect that was just the tip and we are in for much more elongation", "score": 2, "replies": []}]}]}, {"body": "Rob live", "score": 3, "replies": []}, {"body": "Elon pumping Tucker more enthusiasticly than MY RWD.\n\nLol 🤣", "score": 13, "replies": [{"body": "Maga mind virus", "score": 6, "replies": [{"body": "Getting high on hearing his opinions validated. Feeling how right he is.", "score": 7, "replies": []}]}]}, {"body": "https://x.com/DillonLoomis22/status/1708865575202496573?s=20", "score": 5, "replies": [{"body": "Stomach parasites tho.", "score": 3, "replies": []}, {"body": "Me vs Dillon trying to sell shoes vitamins wallets etc", "score": 4, "replies": []}, {"body": "Stopped following that guy when he gave this long ass rant for people to follow his homeboy Jesus", "score": 2, "replies": []}]}, {"body": "https://preview.redd.it/ykfxzmtyu7sb1.jpeg?width=789&format=pjpg&auto=webp&s=cb867016b1f1a1679a0711bdb915e33c69e891f7\n\nAbsolutely monstrous strength all things considered!\n\nFrankly we are being treated well + in line with big boys.\n\nBut this is a moment in time - as we have insane volatility and could easily swing from $150-$400 in the next 6-12 months due to options, macro, and Elon 💪🏼😎\n\n🥳🚀", "score": 5, "replies": [{"body": "🤣", "score": 3, "replies": []}, {"body": "Last time we said we were doing well compared to most mega caps we tanked right down to their levels think it was June", "score": 3, "replies": []}, {"body": "Can you imagine investing in F or GM? Am I missing something or have they stayed relatively flat for their entire life?", "score": 2, "replies": [{"body": "Dividend stock for boomers propped up by the government for the jobs/economic benefit rather than any genuine hope of growth.", "score": 4, "replies": []}]}]}, {"body": "why is the stock crashing after hours?\n\n\\-nate", "score": 5, "replies": []}, {"body": "Gonna be making myself rare on reddit for a while, see ya around, lounge ✌️", "score": 7, "replies": [{"body": "see u tomorrow", "score": 22, "replies": []}, {"body": "nooo why 😔", "score": 8, "replies": []}, {"body": "Enjoy the break.  Don't forget us", "score": 4, "replies": []}]}, {"body": "https://preview.redd.it/i5kh6gc375sb1.jpeg?width=1179&format=pjpg&auto=webp&s=dfb948fb73e7fc7a39c4026861c4feaac42fd511\n\nThis is concerning to me.\n\nHe truly believes this is advertising.\n\nAdditionally, before he never mentioned trims - now he is “advertising” the lower margin vehicle.\n\nMission will continue with volume growth + diminished margins. But brain dead stubbornness to justify using ur acquisition of Twitter as advertising is dumb.\n\nAnyways. More important shit to do like livestream a dead game.", "score": 9, "replies": [{"body": "Hey it's a better tweet than talking about Diablo or how some minorities are out to get ya, at least he's talking about Tesla", "score": 5, "replies": []}, {"body": "Yep, this sucks.\n\nThey should do a proper advertising campaign.", "score": 2, "replies": []}, {"body": "I wish Elon would be as disconnected from Tesla as possible, in the public eye.\n\nHis image is not good for business, unfortunately that seems unlikely, since he's till the CEO, a role he has zero respect for.", "score": 2, "replies": []}, {"body": "fuck the a word triggers me", "score": 2, "replies": []}, {"body": "What is the evidence that he believes this is advertising?", "score": 1, "replies": []}, {"body": "I mean, the guy has how many million followers? This is likely a better ad than running on NBC or CBS.", "score": 1, "replies": []}]}, {"body": "Elon buying Savannah cats for Tesla or something", "score": 6, "replies": []}, {"body": "Rumors of cytruck being able to hold two homies in the frunk in 69 position", "score": 7, "replies": [{"body": "I have heard that elon demanded this", "score": 7, "replies": [{"body": "It needs to fit at least 20 illegal immigrants in this bad boy", "score": 4, "replies": []}]}, {"body": "I call bottom", "score": 5, "replies": []}, {"body": "I heard Cybertruck has really advanced AI that scans your email and social media accounts and if you list your pronouns, FSD will drive you off a cliff.", "score": 8, "replies": [{"body": "Guess I'll be loaning it to my kid's teachers", "score": 3, "replies": [{"body": "They/Them will never see it coming", "score": 2, "replies": []}]}]}, {"body": "I heard it can hold 911 Savannah cats", "score": 5, "replies": []}]}, {"body": "Bring it on!\n\nWill never be the same.", "score": 4, "replies": [{"body": "I mean, if you come at the king, you best not miss.\n\nHe didn't miss.", "score": 3, "replies": []}]}, {"body": "From Tesla China video. Little Easter egg\n\nhttps://preview.redd.it/3bbx99kl97sb1.jpeg?width=2048&format=pjpg&auto=webp&s=bb584a78d5f742f341088b565c736160e28e9eca", "score": 4, "replies": [{"body": "Model y plush", "score": 9, "replies": [{"body": "Was thinking the same", "score": 1, "replies": []}]}, {"body": "Looks like a stuffy, in which case that might be meant to be a Model Y", "score": 5, "replies": []}]}, {"body": "How much for cybertruck fender repair", "score": 3, "replies": [{"body": "Just hammer it out; adds to the patina. I'm actually only sorta kidding.", "score": 7, "replies": [{"body": "Yeah, thing is meant to be beat up. Wear as badge of honor (presuming not structural). Wabi sabi", "score": 3, "replies": []}]}]}, {"body": "Futes recovering. Still F&G", "score": 2, "replies": []}, {"body": "https://twitter.com/StarshipGazer/status/1709386677322706959?t=TNIDzNGQUeQmHkXryt_BUA&s=19\n\nHot", "score": 2, "replies": []}, {"body": "3 day rule", "score": 2, "replies": []}, {"body": "Oil price collapsing.  Guess that's good for Nasdaq", "score": 2, "replies": [{"body": "Bonds next. When it ain't pumping it's dumping", "score": 5, "replies": []}]}, {"body": "[https://x.com/peer\\_rich/status/1709503925768823277?s=20](https://x.com/peer_rich/status/1709503925768823277?s=20)\n\ngood idea?", "score": 2, "replies": [{"body": "Acquiring TSLA:  5 to wealth.\n\nWatching TSLA stock rise:  10 to financial security.\n\nTSLA dips: -2.5 to emotional stability for the day. lol\n\nReaching personal financial milestones: Unlock new life quests.", "score": 4, "replies": []}]}, {"body": "I’ve been buying TGT. 🤡?\n\n\nEdit not sure if the upvoting means I’m a clown or buying TGT is ok?!", "score": 4, "replies": [{"body": "TGT underrated. They don't have locations in crime-ridden shitholes so not as exposed to shrinkage. Unfortunately, they've decided that they have too much of an advantage and should handicap themselves.", "score": 1, "replies": []}]}, {"body": "*President* [*Joe Biden*](https://www.cnbc.com/joe-biden/) *announced Wednesday that he approved $9 billion in* [*student loan forgiveness*](https://www.cnbc.com/student-loans/) *for 125,000 Americans.   More than $5 billion of the aid will go to 53,000 borrowers who’ve worked in public service for a decade or more; $2.8 billion of the forgiveness is for 51,000 borrowers enrolled in* [*income-driven repayment plans*](https://www.cnbc.com/2023/09/12/what-its-like-to-get-60000-in-student-debt-forgiven-after-20-years.html)*; and another $1.2 billion of the cancellation will go to 22,000 borrowers with disabilities.* \n\ndoes autism count as a disability?", "score": 4, "replies": [{"body": "Quite a few doctors who work for regular hospitals for regular pay will be having loans forgiven since most hospitals are non profits", "score": 5, "replies": [{"body": "love doctors but that's fk\\*d", "score": 7, "replies": [{"body": "Why? We need more medical people", "score": 4, "replies": [{"body": "Cuz these dudes making like 300k+ getting loans written off that they can pay easily.", "score": 7, "replies": [{"body": "Lets discourage people from becoming doctors, that will be good for society", "score": 4, "replies": [{"body": "we really need to encourage/incentivize more teachers", "score": 5, "replies": [{"body": "Yah program was designed for teachers and coopted by doctors, cuz I was there when they did it ten years ago. Sounded crazy to me.", "score": 3, "replies": []}, {"body": "That too. Get the politicians to stop attacking teachers. That would be a massive help. I left the profession years ago. Dont miss the long hours, mountain of bullshit or minescule paycheck", "score": 3, "replies": []}]}, {"body": "There's about double the number of applicants to medical school as there are spots. The number is controlled by the NBME basically doctors regulate their own supply and force a shortage to pump salaries. It's all quite corrupt.", "score": 3, "replies": [{"body": "That helps prove my point, we do need more doctors", "score": 2, "replies": [{"body": "Yes but not by giving them loan forgiveness", "score": 3, "replies": [{"body": "Okay Im fine with that", "score": 2, "replies": []}, {"body": "Med school suffers the same problem as regular college/university. Tuition just went crazy. It's not uncommon for recent grads to be $400k+ in debt at 8% or something.\n\nSome specialty compensations (mostly procedural) are increasing, but others (office based) not enough. The average FM/Ped or any of their subspecialties haven't had enough of a bump to make up for the increase in tuition.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "they can (typically) afford to pay their loans off no problem", "score": 5, "replies": []}]}]}]}, {"body": "This will make university more affordable in the long run. /s", "score": 3, "replies": []}]}, {"body": "God damn, I’m making Savannah money today", "score": 4, "replies": []}, {"body": "https://twitter.com/CollinRugg/status/1709728378339705099?t=UUAryQ33ACktMDWBMP57Gw&s=19\n\nFucking LOL. Virtue signaling morons. Like I said with the NY governor: POV of every virtue signaling koom bah yah moron preaching that everyone should live their best life until it actually affects them.", "score": 5, "replies": [{"body": "Well at least that's one domino to fall.  \n\nCan't wait til they come around on all the other common sense issues they've been calling anyone on the opposite side of the worst person in the world for.", "score": 4, "replies": []}, {"body": "Looks like Elon was right", "score": 8, "replies": [{"body": "In the long term, he tends to be right. Foundation psychohistory autism style.", "score": 6, "replies": [{"body": "Exactly. Yet, this sub is non stop with the anti-Elon rhetoric. Even on topics like this where it is clear to most that the border and illegal immigrant issues are a problem", "score": 7, "replies": [{"body": "We dont need any politics whatsoever regardless if you think it's right or wrong.", "score": 9, "replies": [{"body": "With Tesla and Elon companies  disrupting massive industries, we're going to be in some battles like it or not", "score": 0, "replies": [{"body": "There's necessary controversy and then there's what we have going on", "score": 7, "replies": [{"body": "To someone with money, like Elon, this is necessary controversy. To an investor, yes, this is extra. The simple fact is it's not ever going to stop while Musk is alive.", "score": 3, "replies": [{"body": "And I'm gonna call it out as long as I'm alive", "score": 4, "replies": [{"body": "I mean, whatever floats your boat. Personally, I don't see the point in whining about something that won't change day in and day out, but everyone has their own way of coping, I guess.", "score": 1, "replies": [{"body": "Yup, will never become a simp", "score": 3, "replies": []}]}]}]}, {"body": "In the past 24 hours, the ADL folded and now it looks like there's bipartisan support that the border needs additional security. All I can control is where I choose to allocate capital and for me the best current choice is Tesla", "score": 1, "replies": [{"body": "Until the next magneto tweet.", "score": 7, "replies": []}]}]}]}]}, {"body": "Emotional short term mah stonks mentality. Basic heirarchy of needs: money falls under safety needs. Only after money do people start giving a shit about the things that really matter: love/respect/self-actualization.\n\nhttps://www.simplypsychology.org/wp-content/uploads/maslow-hierachy-of-needs-min-1024x724.jpg", "score": 1, "replies": []}]}]}, {"body": "You mean Trump", "score": 2, "replies": []}]}, {"body": "Who the fuck is collin rugg", "score": 1, "replies": [{"body": "Some twitter journalist I guess, doesn't matter, I googled \"biden wall\":\n https://apnews.com/article/border-wall-biden-immigration-texas-rio-grande-147d7ab497e6991e9ea929242f21ceb2\n\nIt's homeland security. This is real.", "score": 3, "replies": [{"body": "Was there no wall before trump was president?", "score": 1, "replies": [{"body": "Lol not really. There were token walls scattered throughout touted as \"400 miles of wall\" (out of 2000), most of which is hoppable fencing. We haven't ever had an effective wall, and Trump's wasn't effective either--not that it was allowed to finish. \n\nThe issue is that the whole world wasn't using the mexican border as a waypoint to America until Covid caused a sudden boom to levels never before seen. If it was just the usual flow of mexicans looking to mow lawns, nobody would have an issue.", "score": 1, "replies": [{"body": "So how are we gonna get the lawn mowers in", "score": 2, "replies": [{"body": "No shortage of those, we've been picking up laborers for over a decade now for our RE business. Going forward, if illegal immigration is down to 0, you can streamline the visa/greencard process and award them proportionately to countries by population/need. If your question is what happens to cheap labor once they're citizens? Well, knowing the R/E construction biz, I can tell you they're no longer \"cheap\"--just cheaper and, more importantly,  available. None work for under minimum anymore. The only ones that do are fresh enough to get swindled by their middlemen bosses until they figure out how to go direct or find better bosses. The market always figures it out. They're charging double what they did 5 years ago but we're making more than double on new constructions.\n\nEdit: keep in mind, all this is coming to a head because of the millions of migrants that can't find anything to do right now. We're set on entry level labor for a while in this country.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "![gif](giphy|TcZLDjsqEQSRvr24JT)", "score": 3, "replies": []}, {"body": "you guys, BYD has a [virtual metaverse](https://byd-metaverse.mkms.io/) where you can tour their cars  \n\nWARNING this is hyper realistic and you may lose sight of whats real and what’s not. the lines between reality and virtual reality quickly become blurred, proceed with caution  \n\nyou can see other people I’ll be jumping around a lot", "score": 3, "replies": [{"body": "metaverse is also the only way tesla gonna achieve cathie woods production targets (20 M in 2027)", "score": 3, "replies": []}, {"body": "Lol shitty mobile game, can't even kill anyone.", "score": 2, "replies": []}]}, {"body": "[https://twitter.com/SawyerMerritt/status/1709678982700896469](https://twitter.com/SawyerMerritt/status/1709678982700896469)\n\nNext step price hikes?", "score": 3, "replies": [{"body": "Hope so. Shit kind of inflation where we cut prices throughout", "score": 5, "replies": [{"body": "Inflation is ded.", "score": 3, "replies": [{"body": "I know, but Tesla was the only company on earth cutting prices throughout the last 2 years of it", "score": 8, "replies": [{"body": "It is better to sell everything than hold inventory.", "score": 1, "replies": [{"body": "Sure, but inflation long term is positive for nominal earnings (but only if you raise prices with it)\n\nAnd nominal matters because your calls and shares aren’t adjusted for inflation", "score": 5, "replies": []}, {"body": "Not necessarily. But it’s definitely better to keep expanding capacity so you’re ready when macro conditions stabilize", "score": 2, "replies": []}]}, {"body": "It really wasn't. I still can get better deals at most dealerships than Tesla can give me if I was dumb enough to want a gas car.", "score": -1, "replies": [{"body": "Only advantage legacy has is in house financing.", "score": 2, "replies": []}]}]}, {"body": "Rates aren't.", "score": 1, "replies": [{"body": "Bingo. Nothing but blue skies soon.", "score": 1, "replies": [{"body": "Perfect for us. Low inflation, high rates (so high fiscal dominance), low unemployment (so no recession) = moon soon", "score": 2, "replies": [{"body": "landing softer than a pile of feathers", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "🚀", "score": 4, "replies": [{"body": "🚀🚀", "score": 3, "replies": [{"body": "🚀🚀🚀", "score": 3, "replies": []}]}]}, {"body": "https://twitter.com/VivekGRamaswamy/status/1709535737513693632?t=vpjTLeV--tgQq95hD6BL8g&s=19\n\nup for it", "score": 3, "replies": [{"body": "Yeah, the guy that wants to give Ukraine to Putin and Taiwan to China is the best option.", "score": 6, "replies": [{"body": "For debate mate, it doesn't matter who we support. But cool to hear anyway whether we disagree or not", "score": 3, "replies": []}, {"body": "Don't worry, Russia already took the part of Ukraine you're referencing for itself.\n\nSooner or later y'all will get it.", "score": -3, "replies": [{"body": "We'll see.\n\nLaughing at a situation, which is human suffering on this scale, it effects millions and that has cost hundreds of thousands of lives already,  countless crimes against humanity, that says a lot about what kind of person you are.\n\nAll the best people support Putin, I guess, in upside down world.", "score": 2, "replies": [{"body": "What's funny about people like you and the fact that you say that is that I was the one from the beginning saying that this will escalate to unimaginable suffering and death from the beginning.  I said this because I've fought in war.  It was a humanitarian thought because I'm much more capable of seeing the reality of the situation.  I don't want Russia to invade and take over half of Ukraine, but at some point reality trumps mine and your want.\n\nThe west should have negotiated when they had the chance.  But now, as I and others predicted, hundreds of thousands and (if the west keeps funding it), potentially millions of people will die.  And the line of contact remains virtually the same.  \n\nBut now, you'll double down on stupid, which is what you're asking for here.  Instead of seeing the reality.   Keep living in that delusion buddy.", "score": -1, "replies": [{"body": "Everywhere the Russians were, they left behind torture chambers and mass graves. Their soldiers steal, rape, torture and murder people in the worst ways imaginable and are proud of it. That's standard operating procedure in the Russian army. What do you think would happen if Russia was gifted millions of Ukrainians?\n\nThey deport people, have work camps, kill and jail innocent people whenever they want. They do this frequently, the world jokes about the suicides, but it's not a joke. They're also not limited to Russian territory, they kill people all over the fucking planet. Advocating for appeasement and sacrificing millions to these terrorists is vile.\n\nGiving up millions to Putin regime is NOT less suffering, it's more, spanning over a longer period of time.\n\nThe line of contact has changed over time and the situation is evolving. Russia is losing everywhere, they are gaining nowhere. True, the advance is slow, but Ukraine is the most mined country on the planet right now.\n\nIf the West had given greater support, the Russian wouldn't have been able to put up the fortifications they have and they wouldn't have been able to mine such large areas of land. The Ukrainians already advanced once and toke big huge areas of land. They could have done it again, if the equipment was available before Russia had months to set up their defences.\n\nI live in reality, Russia is attempting genocide according to their own words. They are also threatening nuclear war with every Western country and keep saying they want to take Poland and they want back the part of Berlin they lost.\n\nIn reality, appeasement leads to escalation, just like every single time in history this was attempted.\n\nSacrificing millions of humans to Putin is not only the worst outcome, RUSSIA WILL NEVER STOP IF NOT STOPPED.\n\nI don't want war, but to not support an ally, the USA made promises. The world is interconnected, if you think what happens outside the USA has no effect, you are deluded. It also has great effects on Tesla, a worldwide brand.\n\nIf you don't want suffering, you want Putin stopped and a clear message sent, the West does not cower in the face of a cowardly dictator sacrificing the lives of his citizens. Awarding the Russians is the worst possible outcome for Ukrainians AND the entirety of the West.\n\nYou are repeating Russian propaganda, it's part of why the West didn't fully support Ukraine from the start, all their propaganda. The war would be over if the West let Ukraine in NATO, they would back of quickly, they stand no chance and Putin knows this.", "score": 2, "replies": [{"body": "All I see is a chicken hawk screaming for escalation of the war because literal humanity is on the line.  If you REALLY believed this shit... like REALLY... you'd go fight because it's that important.  But instead you'll scream and type words and have a strong opinion about how everyone else should be fighting harder and dying harder, but you will NEVER do it yourself.  So how strongly do you really believe this shit?", "score": 0, "replies": [{"body": "Life expectancy in Russia is over 10 years below the average of the rest of Europe, median income is a fraction. While Russia has a lot of resources, it's not just corruption, they are not far of from North-Korea and getting closer every day. Would you advocate to sacrifice millions of USA citizens and territory to North Korea so their dictator stopped threatening nuclear war?\n\nI don't want war or fighting, I do support those defending their country, that's not being pro war. Being pro war is when you support those that start wars, advocating to REWARD A TERRORIST, GENOCIDAL MONSTER with the lives of those he wants to eradicate. Supporting those that are defending themselves against a genocidal, terrorist state that uses rape and torture as tools, while murdering unarmed people is NOT pro-war or escalation, it's the opposite.\n\nI just explained it to you, sacrificing millions does not achieve this. This was what happened in 2014 when Russia invaded the first time. They regroup and go further when they are ready. History is full of examples of appeasement, the results are always the same.\n\nDictators like Putin always talk big, the way to stop human suffering is to stop monsters like him. He is evil, you are supporting evil. There were people in the UK saying Hitler was not there enemy and they should stay out of it, in France and many other countries there were sympathisers. Monsters like him and Putin should be fought, there's plenty of proof what they do to people they get control over.\n\nI don't speak Ukrainian and I don't have a military background, I am supporting Ukrainians in Europe, I've also donated money to buy equipment. That's the way I can do, to be most useful and I'm actively supporting Ukraine.", "score": 2, "replies": [{"body": "Pure delusion.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Reddddd by closeeeee", "score": 3, "replies": [{"body": "Daily 30 mins of green", "score": 2, "replies": [{"body": "Happy to be wrong", "score": 4, "replies": [{"body": "Wrong for now", "score": 4, "replies": []}]}]}]}]}, {"body": "Not foooked", "score": 3, "replies": [{"body": "Unless ur brain is maga", "score": 0, "replies": []}]}, {"body": "Doom porn\n\nhttps://x.com/hkuppy/status/1709293940157898938?s=46&t=fGVL0206fdWMIjq9C1_Fgg", "score": 2, "replies": [{"body": "Eli5?", "score": 3, "replies": []}, {"body": "We survived dec 22 we can survive anything", "score": 2, "replies": [{"body": "It’s just bs anyway, doom engagement", "score": 2, "replies": []}]}, {"body": "What's YCC?\n\nEdit: I think it means yield curve control", "score": 1, "replies": [{"body": "Yield curve control - central bank swaps bonds for reserves to control rates", "score": 2, "replies": [{"body": "Thanks. What are reserves in this context?", "score": 1, "replies": [{"body": "Fed reserves - the currency used on the fed bank accounts/balance sheets", "score": 2, "replies": [{"body": "Thanks.  I guess I need to read a book about all this if I really want to understand it better.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Elon all about Twitter and citizen journalism. Hypothesis: Elon wants Twitter users to promote and market tesla vehicles", "score": 2, "replies": []}, {"body": "[https://www.youtube.com/watch?v=t9GFkilCs\\_c&t=153s](https://www.youtube.com/watch?v=t9GFkilCs_c&t=153s)\n\nhow car makers are switching to evs", "score": 2, "replies": [{"body": "Thought this was going to be some monkeys banging on stuff with wrenches.", "score": 5, "replies": []}]}, {"body": "I gotta say Tesla Vision is shitty when it comes to park assist on the front. \n\nOld Model 3 with sensors detected stuff way better when items or things appeared while car was not moving but the Y doesn’t. This is because of the camera angle probably.", "score": 3, "replies": [{"body": "Fud!!!", "score": -1, "replies": []}, {"body": "automatic wipers retarded too", "score": 1, "replies": [{"body": "They work great so far tbh. In my previous Model 3 not so much.", "score": 1, "replies": []}]}]}, {"body": "Id4 has super access right? Buddy bought one like a chump", "score": 2, "replies": [{"body": "vw owns electrify America so probably going to hold out a while", "score": 3, "replies": []}, {"body": "No", "score": 4, "replies": []}, {"body": "I don’t think so broman… I think VW is a holdout", "score": 0, "replies": [{"body": "Splitting personalities?", "score": 5, "replies": [{"body": "??", "score": -1, "replies": [{"body": "![gif](giphy|9mtE009hcWPOesk8C4)", "score": 5, "replies": []}, {"body": "Is you not that other guy", "score": 2, "replies": []}]}]}]}]}, {"body": "B knight told me to re-search Tsla lounge to fix the app, instead of clicking it on your saved subs recent thing\n\nEdit typos", "score": 1, "replies": []}, {"body": "Nateleb and squawksquare are the same person", "score": 1, "replies": [{"body": "Inflation is a result of dark matter and dark energy, not of money printing and low interest rates.", "score": 2, "replies": []}, {"body": "I muted square squeak as soon as he paid for Twitter blue. I don’t want him to get any money from me viewing his junk tweets", "score": 1, "replies": []}]}, {"body": "Dillon Loomis (Elektrified guy) deleted my Youtube comment pointing out the \"confirmed\" leaks from that wannabee influencer Matthew are (1) him trying to \"pass off\" info from a Twitter spaces as an authoritative source he knows to whore clicks and personally monetize, and (2) has a shit track record of \"leaks\" from his past rumors.\n\nBetween that and him pushing the \"supplement/religion\" stuff for a science, fact-based investor community, WTF is the guy thinking?", "score": -1, "replies": [{"body": "Let me known what I’ve got wrong from my past rumors. \n\nObviously I’m only in this for the monetization. I mean I might have made $17 today! Time to retire!", "score": 8, "replies": [{"body": "Oh shit \n🔫🔥", "score": 6, "replies": [{"body": "![gif](giphy|15BuyagtKucHm)", "score": 5, "replies": []}]}, {"body": "He seems like a hater. Keep it up man 👍", "score": 5, "replies": [{"body": "Click the link below for eternal salvation", "score": 7, "replies": []}]}, {"body": "Great post, thanks for sharing all of the info", "score": 5, "replies": [{"body": "![gif](giphy|kmQREsvNQrhrHdkN7G|downsized)", "score": 1, "replies": []}]}, {"body": ">clicks\n\nOh good you're here so I can expose you properly.\n\n1) Dude on Twitter Spaces says to not widely circulate info (makes him an idiot she shouldn't have been on Spaces), but that doesn't absolve you of being an asshole and immediately posting about it afterward.\n\n2) You disingenuously posted it in a tone that made the information seem 100% confirmed from a source of yours, vs. \"rumors I heard from a rando on a public Twitter spaces\" to build your personal brand, whore clicks and cloud, and monetize. You're the worst parts of Tesla investor cultism. Actually, the worst parts of social media influencing.\n\n3) You distort/embellish the shit out of things, on the Twitter spaces the dude said he could do it in a fetal position while you said laying flat a 5'7 person fits. Funny how when we hear the same source we know how you stretch things, giving us a clue on what you could've \"stretched\" from past convos\n\n4) Speaking of which,  you're the same guy who got banned from Tesla investor events from getting info from Tesla execs in the guise of informal fan convo, then publishing everything online. Lots of Tesla investor wannabee fools spouting bullshit on Twitter, but to actually get black balled from Tesla is actually quite impressive levels of fuck up.\n\n5) How many specs have you gotten wrong in your past rumor bullshit? Entire community cataloging and exposing your bullshit from that fiasco here - [https://www.cybertruckownersclub.com/forum/threads/%F0%9F%93%A1-exclusive-cybertruck-specs-update-including-dimensions-seating-displays-tires-wheels-accessories-more-from-video-aired-3-10-23.8096/](https://www.cybertruckownersclub.com/forum/threads/%F0%9F%93%A1-exclusive-cybertruck-specs-update-including-dimensions-seating-displays-tires-wheels-accessories-more-from-video-aired-3-10-23.8096/)\n\n![gif](giphy|15BuyagtKucHm)\n\nBut maybe i can dumb this down to one of those cute gif retorts you like to do...", "score": 1, "replies": []}]}, {"body": "Censoring YouTube comments is a bit much...", "score": 3, "replies": []}, {"body": "Shilling Loomis a simp through and through. I like realmatthewDR tho", "score": 8, "replies": []}]}, {"body": "Is the Tesla semi 4680 or 2170?", "score": 1, "replies": []}]}
{"title": "For all the regards who have no clue what's all this Bonds and Yields talk driving the markets", "selftext": "Listen up regards, here is some quick 101 for you who don't have slightest clue what's driving the markets and why we are seeing all this news suddenly on Bonds and Yields:\n\n- **Fed led by Papa pow printed a lot of money during Covid.. like a fuck ton of money and used it to buy US Treasury securities** like (T-bills, T-bonds and T-notes). These are debt instruments on which US Government will pay them interest.\n\n- Post-pandemic we got hit by **Inflation that turned out to be not so transitory** due to Covid supply shocks (including factory closures), Russia invading Ukraine, Above mentioned money printing that was given as aid to US citizens and a host of other factors.\n\n- **Fed has only one tool in its toolbox to tame Inflation.. Higher interest rates.** It hiked from near 0% to 5% in a matter of 18 months. Practically unheard of in modern history. The previous hike in rates like this was done by Fed chair Paul Volcker.. the guy with the balls so strong and heavey, he had to weigh them using a truck scale. Seriously, search him on Google.\n\n- Higher rates mean the previous bonds sold with lower interest rate lose value. If US treasury sells a bond that pays 1% interest for 10 years with $100 face value, and then due to higher interest rate US treasury sells you another note that pays 2% interest for 10 years with $100 face value, the previous note that pays lower interest goes down in value due to higher interest rates on the newer treasuries. So the **return a bond gives a.k.a Yield goes higher when the bond prices go down and vice versa.**\n\n- Fed hiking rates and keeping them higher for longer mean **bond traders** are fearing the higher rates for longer and selling off 10 year US treasury securities. **Japanese institutional investors** are selling US treasury securities, **Fed themselves** are selling Treasury securities that they purchased during Covid to reduce size of their balance sheet and **US Government is also selling US Treasury securities** in open market to fund debt.\n\n- **This has caused 10 Year US treasury Yields to spike and hence any debt including Corporate bonds, Mortgages etc. will have to be funded using higher interest rates restricting growth of economy. Corporate Bonds are also having a major selling off due to higher yields. Higher yields also signal higher interest rates which mean Present value of future earnings goes down. Stocks are hating this and falling. Nobody knows what is going to happen next but tighten your seat belt bois as the ride is going to be bumpy.**\n\nTLDR; Papa pow printed a lot of money and purchased US treasuries. Inflation and higher interest rates by Fed to tame inflation mean treasuries decline in value and traders and institutional investors holding them are selling it. Fed is selling them to reduce their balance sheet and US government is selling them to as part of their debt funding. This is causing the 10 year yields to spike and stocks to go down. Strap your seat belt bois, it is gonna be a bumpy ride for next few months.", "id": "16zudj0", "created_utc": 1696443234.0, "score": 256, "upvote_ratio": 0.92, "num_comments": 136, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|5 years ago\n**Total Comments**|179|**Previous Best DD**|\n**Account Age**|6 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: Fed printed money and bought treasuries. Inflation is not transitory and in response Fed raised rates. Traders are selling treasuries, Fed is selling treasuries to reduce balance sheet size, Government is selling treasuries to fund their debt. This has caused 10 year treasury yields to spike and sent stocks down due to expectation of higher interest rates for longer.", "score": 1, "replies": []}, {"body": "If everybody is selling it then who is buying it? 🤔", "score": 38, "replies": [{"body": "I also have the same question.\nWhen China and Japan currently sell their bonds (with huge losses) which I assume they bought in period 2015-2020, instead of waiting to mature and receive the face value back, then who is buying those 1 or 2% paying bonds? Because we talk about selling pressure from foreign governments I assume the amount will be huge.\nIts not like someone here could buy those bonds", "score": 14, "replies": [{"body": "banks could be buying them if they are priced right.  They pay our their par value at the end of their duration, so even if they are titled 2% their value just drops so price + current market interest rates over the duration = par value (and maybe some factors for credit risk too but that makes the math hard)", "score": 18, "replies": []}, {"body": "Someone who can wait for the maturity.  A bank, you, me, some other country, ad infinitum", "score": 7, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "&#128065;&#8420; *Illuminerdy confirmed* &#128065;&#8420;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}]}]}, {"body": "There's always a buyer, at the right price.", "score": 8, "replies": []}, {"body": "It's definitely not market manipulators...jkjk", "score": 2, "replies": []}, {"body": "The HFs shorting them into the ground are probably accumulating.", "score": 2, "replies": []}, {"body": "yellen said she gonna force the banks to buy em", "score": 2, "replies": [{"body": "yellen needs to take her pills and to take a nap before she bankrupts the fucking banking system", "score": 7, "replies": []}]}, {"body": "Thats the problem they are selling without a natural bid", "score": 1, "replies": []}, {"body": "Social Security department...probably.", "score": 0, "replies": []}]}, {"body": "TLDR: cash position for 5+% is the way.", "score": 73, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "No one asked what your mortgage rate is.", "score": 0, "replies": []}]}, {"body": "Or, UUP (US Dollar Index Bullish) if you think the US is better positioned than other developed markets to withstand higher for longer rates and want to short those currencies while collecting that 5% from treasury.", "score": 4, "replies": []}, {"body": "Not really, that rate isn’t locked in for any period of time. Remember when MMMF rates were 0.25% a couple of years ago?", "score": 0, "replies": [{"body": "Where did I imply that you would hold that position forever?", "score": 6, "replies": []}]}, {"body": "so no more options all in on bonds?", "score": 0, "replies": [{"body": "No", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 95, "replies": [{"body": "You are...", "score": 15, "replies": [{"body": "On fire..", "score": 22, "replies": [{"body": "the one desire...", "score": 11, "replies": [{"body": "Believe...", "score": 6, "replies": [{"body": "When I say", "score": 7, "replies": [{"body": "I like it that way...", "score": 3, "replies": [{"body": "TELL ME WHY!", "score": 6, "replies": [{"body": "Ain't nothin but the Feds Rate", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "Omg he’s back again…", "score": 5, "replies": [{"body": "Am I sexual?", "score": 4, "replies": [{"body": "Yeahhh", "score": 3, "replies": []}, {"body": "This is the reference I needed. Thank you for the laugh", "score": 1, "replies": []}]}, {"body": "Brothers, sisters, everybody sing", "score": 2, "replies": []}, {"body": "Check it, direct it...", "score": 2, "replies": []}]}, {"body": "AI will increase productivity and then this would reduce future inflation expectations due to massive productivity. Job losses from AI replacing workers would reduce worker spending solving inflation issues, meaning future rate cuts more likely= bull market in the short term ( next 5-7 months ). \n\nOnce market realizes AI will need more time to replace all the workers it will go down quickly. Or some black swan event like a china Taiwan invasion", "score": 1, "replies": []}]}, {"body": "No rockets no ticker I’m out ![img](emote|t5_2th52|31226)", "score": 45, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|27189)", "score": 0, "replies": []}]}, {"body": "Nice explanation, but I think the Fed doesn't sell securities, it just lets them mature and don't reinvest.", "score": 19, "replies": [{"body": "Not necessarily - https://www.investopedia.com/insights/how-will-fed-reduce-balance-sheet/#:~:text=The%20Fed%20can%20reduce%20its,ahead%20of%20the%20maturity%20date.\n\n\"The Fed can also sell securities ahead of the maturity date.\"", "score": 10, "replies": [{"body": "They can, but they’re not.", "score": 7, "replies": []}, {"body": "Fucking JPow lied then. In one of those FOMC he said they just let them mature, when talking about reducing the balance sheet.", "score": 3, "replies": []}]}, {"body": "Maybe they sell them to another ledger book entity of theirs and it’s a a churn writeoff of some sort.", "score": 2, "replies": []}]}, {"body": "Unpopular opinion, market is going to bounce", "score": 20, "replies": [{"body": "well we kinda bounced a few months ago right?", "score": 2, "replies": []}, {"body": "I think so too. with this smooth regarded brain of mine.", "score": 2, "replies": []}, {"body": "We bounced on Friday.  We may bounce again, but not for long.  A shit storm is a brewin'.  There's a double barrel shit machine gun aimed at the market and it has a hair trigger.", "score": 1, "replies": []}]}, {"body": "Buy 3 month bonds", "score": 7, "replies": [{"body": "This is the way.", "score": 2, "replies": []}]}, {"body": "Tools talking about tools. Central bankers always talking about tools as if they are repair guys. They dont repair shit, they caused inflation and now they play hero to the rescue. Someone kill me pls so I don't have to endure this idiocy anymore.", "score": 9, "replies": [{"body": "it's almost like quantitative easing starting in 2010 was not such a great idea....\n\n&#x200B;\n\nnow its coming to bite us in the hiney", "score": 2, "replies": []}]}, {"body": "So buy bonds?", "score": 15, "replies": [{"body": "Only if you want to hold to maturity.", "score": 16, "replies": [{"body": "Which is not a bad play overall but you can't have a tik tok attention span", "score": 29, "replies": [{"body": "Maybe... buying a 10yr 1-2% bond with inflation what it is?  Face value better be cut quite a bit.\n\nBuying new issue isn't bad, but you aren't making a lot there.\n\n\nCorporate bonds...now there's some nice yields out there, but the risk is obviously higher.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Today was a classic SP 500 support bounce from 4200 levels as yields pulled back a bit and took a breather. But, I am in the same boat as you. 10 year is moving to 5% soon and that's where things start to get real scary. \n\nI wouldn't be surprised if in December SEP Fed shows only 1 rate cut instead of 2 anticipated.", "score": 5, "replies": [{"body": "what if they do one 3% cut? ![img](emote|t5_2th52|29637)", "score": 4, "replies": []}, {"body": "cant we just buy the 10 year at 5% ??", "score": 2, "replies": []}, {"body": "I thought they said 0 cuts this year........? Did I listen to a different fomc meeting than you?", "score": 2, "replies": [{"body": "2 cuts next year - 2024", "score": 2, "replies": []}]}]}]}, {"body": "Buy monthly cds and keep churning", "score": 0, "replies": [{"body": "Negative. CDs are taxes higher than Tbills", "score": 5, "replies": [{"body": "Yes but aren’t u limited in the qty you can buy", "score": -2, "replies": [{"body": "Wdym? You can buy as many t bills as you have cash for afaik.", "score": 2, "replies": [{"body": "I thought you were limited to 10k worth or something like that", "score": 2, "replies": [{"body": "I bonds...", "score": 4, "replies": [{"body": "Bronze ranger you’re my herrrro", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "You always test the water before dipping those bad boys all the way in. Don't want the tub to over flow", "score": 7, "replies": []}, {"body": "OP saying Google Volcker basically invalidates everything. Man was no fucking genius.", "score": 1, "replies": []}]}, {"body": "I don't know enough to know if this information is right or wrong, but damnit... it's written with bullet points and bold lettering, and I'm just foolish enough to believe it.", "score": 3, "replies": []}, {"body": "you forgot china is also dumping US treasuries because their shit is cratering", "score": 3, "replies": []}, {"body": "I aint reading allat 🔥", "score": 19, "replies": [{"body": "TL:DR; Someone forgot to turn off the money printer when COVID ended and now there’s too much money.", "score": 21, "replies": [{"body": "What’s the tldr on the right play? All cash?", "score": 2, "replies": [{"body": "Honesty the smartest play right now is to just dump your whole portfolio into 3-6 month T-bills at 5.5%, hold to maturity and just keep rerolling as the rates keep skyrocketing.  \n\nIt’s no fun, but it’s free money plus you get to point and laugh from a position of security while everything crashes and burns around you.", "score": 10, "replies": [{"body": "thats fkn genius", "score": 2, "replies": []}, {"body": "Except youll miss out on buying appl at $85 and nvda at $35", "score": 1, "replies": []}]}]}]}, {"body": "\"If you can't explain something in one sentence or less, you truly don't understand it that well.\"", "score": 4, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Carefully", "score": 2, "replies": []}]}]}]}, {"body": "Sir, this is a casino.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Not much...it's the 5-10-30y that have higher risk due to inflation/terms, in my opinion.  However if the rates go to 0 again, you may wish you had 5% for 10yrs instead.\n\n\nConsider, you buy a 10yr 5% rate...in a year you might only get 2% on that 3mo (or 0.25% if it's really bad).  You got 3months of 5%, now in 2024, you can only get 2% on the 10yr.  The time works both ways for you and against you.  \n\n\nInflation is the wrench in the works...inflation can outstrip your yield on a treasury...but in normal times, it's just a safe place (barely any gains).   Which is why we say 10yr treasury = hiding your money under the mattress.  Classically, stocks sell off and people \"hide\" in the bond market.  Corp bonds can make decent money, but risk is higher.\n\n\nIf (I have no crystal ball) next year the 10yr is paying 7%...you can sell your 5% at a slight loss and move up to 7% for the next 10yrs.   \n\n\nThe curve is inverted, you should be getting less % on the short bonds...but that will flip eventually into (historically) a recession, and at that time the Fed is supposed to cut rates.  Demand for the dollar bond then skyrockets and yields go way down.  Standard logic at that time is that you will want the 10yr bonds you bought at 5%+, as they will go up in value verses the newly issued 2% bonds in that recession.\n\n\nI am not a finance dude, this is just what i've learned...take it with a heavy grain of salt, and know that I'm not so deep in the shit to understand everything - this is big-picture stuff, not minutia of bond auctions.", "score": 6, "replies": []}]}, {"body": "so next few months will be red? got it", "score": 2, "replies": []}, {"body": "So what do I buy? Spaghetti O’s", "score": 2, "replies": [{"body": "A Spaghetti bond", "score": 2, "replies": []}, {"body": "Yeah, order a whole case with a Sam’s Club Plus Membership. They’ll FedEx them for free.", "score": 1, "replies": []}]}, {"body": "“Higher rates mean the previous bonds sold with lower interest rate lose value. If US treasury sells a bond that pays 1% interest for 10 years with $100 face value, and then due to higher interest rate US treasury sells you another note that pays 2% interest for 10 years with $100 face value, the previous note that pays lower interest goes down in value due to higher interest rates on the newer treasuries. So the return a bond gives a.k.a Yield goes higher when the bond prices go down and vice versa.”\n\n\nI’m kinda thick, help me here. Are you saying by this that the yield or interest earned on the old issue 10 year bonds go up because the face value dropped,  but you still earn the 1 to 2 percent on the issued value?", "score": 2, "replies": [{"body": "Yup, so when Fed interest rates rise, the bonds issued with lower interest rates go down in value as markets can get fresh bonds with higher interest rates. On the flip side if Fed Interest rates fall, the bonds increase in value. \n\nSo basically a bond's coupon rate i.e. the interest payment bond issuer (US treasury or a Company) has to make always stays the same till maturity once the bond is issued. But, the yeild i.e. the return you get on it, follows the broader interest rate trends as value of bonds go up or down. For e.g. a $100 bond with 5% ($5) annual coupon may be trading at $70 due to rise in rates making the Yield on that bond around 7.1%.\n\nFYI Bond market is much bigger than stock market and bonds are traded just like stocks. But, most retail investors don't trade bonds, only institutional investors do as most bonds are traded OTC (Over-The-Counter) instead of on an exchange like NYSE or Nasdaq.", "score": 3, "replies": [{"body": "So if I’m company X and I issue a 100 bond and promise to pay 2 percent annually until maturity. Don’t I also have to return the 100 dollars at maturity?", "score": 2, "replies": [{"body": "Yes you have to return the $100 at maturity as well. So when a bond is nearing its expiration, the price starts to come back towards par or face value. The example I gave you was an oversimplification of the concept. If you want to know how bond prices are calculated and concept like YTM (Yield to maturity - the total return a given bond would pay today if held till maturity and the coupon payment reinvested) read this. It explains all this in great detail:\n\nhttps://www.investopedia.com/terms/y/yieldtomaturity.asp\n\nhttps://www.investopedia.com/ask/answers/why-interest-rates-have-inverse-relationship-bond-prices/#:~:text=Most%20bonds%20pay%20a%20fixed,a%20decline%20in%20its%20price", "score": 3, "replies": []}]}]}]}, {"body": "That's why it's called a bear trap.", "score": 2, "replies": []}, {"body": ">The Fed's actions have definitely caused some market turmoil recently, but I'm not too worried about it. I'm confident that the markets will eventually stabilize and continue to grow in the long run. In the meantime, I'll just keep making money hand over fist and enjoying my life of luxury.", "score": 6, "replies": []}, {"body": "It's a bumpy ride and you're sitting at your ugly uncle's lap", "score": 4, "replies": []}, {"body": "Look man, hooked on phonics didn't work for me. I just need to know puts or calls!", "score": 1, "replies": []}, {"body": "How to short bonds though?", "score": 1, "replies": []}, {"body": "Great explanation 👏 \n\nI would not be surprised to see a dreaded debt deflation spiral coming out of this mess. You have a market that clearly wasn’t productive enough to sustain itself in 2008, and the only reason it didn’t collapse entirely was a MASSIVE influx of debt. The moment the debt faucet gets turned off, the rotten underbelly of the market is going to be exposed, like ripping granny’s nightgown off. Nobody wants to see that and it will scar us for decades.", "score": 1, "replies": []}, {"body": "Something is probably going to break and there will be a capitulatory event. When that happens start buying by the truckload. But don’t overleverage. That is how real money is made. I personally am going to load up on renewables. Should have a huge run as the fed starts to ease. Renewable energy is still a secular story and is only being beaten down by rates. Once that corrects - it’s off to the races again. Ya’ll heard it here first.", "score": 0, "replies": []}, {"body": "Listen I'm regarded and don't understand any of that. Does this mean green dildos or red dildos are coming in my future?", "score": -1, "replies": []}, {"body": "God damn chatgpt spam", "score": -2, "replies": []}, {"body": " If you don’t know what bonds are or how it works, please just leave 🤦‍♂️", "score": -11, "replies": [{"body": "I know James Bond.", "score": 2, "replies": [{"body": "Is that the guy that broke the home run record?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "If they are selling now it means they expect rates to go up even more. \n\nMy theory: the long term rates are gonna go above the short term rates like it is in normal times. People holding longer want to get paid more for the duration risk. The last year has been very unusual where short term rates were higher than long term. It's because everyone kept saying recession was imminent. \n\nIf it's not imminent, and if rates will be higher for longer, then longer term rates will go up to above short term. So longer term bonds could continue to sell off even if jpow doesn't raise rates at all.", "score": 3, "replies": [{"body": "And as soon as the inversion stops… recession comes full speed ahead", "score": 1, "replies": []}]}, {"body": "It is a mix of technicals and fundamentals. When yeilds crossed 4.5% they crossed a key reistance zone so traders started selling bonds sharply pushing yeilds up. Just like stocks, bond traders buy/sell bonds pushing yields lower/higher based on charts and moving averages.\n\nFrom a fundamental perspective, you are right why would someone sell bonds that already have 4.7% yield.. answer is Fed's higher for longer interest rates. No one knows how high Fed may go. Even Fed itself is data dependent and changes its projections. Clearly bond market is seeing higher interest rates for much longer pushing yields up and spooking the stock market.", "score": 2, "replies": []}]}, {"body": "Buy the dip!", "score": 1, "replies": []}, {"body": "And the big question:  Extend duration or wait in short term bonds?  Are we near peak long term yields or is there more to go?   I have no idea so just going to keep laddering as my fixed income holdings mature.", "score": 1, "replies": [{"body": "Short strategy; 0-3 years to minimize effective duration risk. But opportunistically, probably 10 yr as I doubt there’s much more room for movement. Yield curve is already starting to deinvert and the 2-10 yr spread is rapidly deteriorating which is like almost always a sign of an imminent recession lol.", "score": 1, "replies": []}]}, {"body": "So calls?", "score": 1, "replies": []}, {"body": "Serious question, how do you buy bonds? I only know how to buy options.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "It couldn’t be that the republicans can’t field a house speaker and there is only 45 days of budget left?  \n\nNothing screams predictability like heading to a government shutdown during the holidays with no speaker of the house.", "score": 1, "replies": []}, {"body": "Inaccuracies all over the place", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Because dollars are debt instruments", "score": 2, "replies": []}]}, {"body": "Already missed the short LT us treasuries trade. Go long now.", "score": 1, "replies": []}, {"body": "buy low sell high", "score": 1, "replies": []}, {"body": "So, what I'm hearing is I should liquidate all positions of my 401(k) and go 100% into FDLXX?", "score": 1, "replies": []}, {"body": "You deserve award", "score": 1, "replies": []}, {"body": ">**Fed has only one tool in its toolbox to tame Inflation.. Higher interest rates.** It hiked from near 0% to 5% in a matter of 18 months. Practically unheard of in modern history. The previous hike in rates like this was done by Fed chair Paul Volcker.. the guy with the balls so strong and heavey, he had to weigh them using a truck scale. Seriously, search him on Google.\n\nThat's why the Fed is not the most appropriate entity to fight inflation, it can help, but in truth the only instrument the Fed has have is not enough and using it has massive consequences on the economy. \n\nInterest rates hikes can also end up fueling further inflation, by reducing investments\\\\production and so lowering the offer together with the demand. \n\nGovernments should do most of the work, but of course, it's easier to just adjust a number and see what happens that actually make reforms.", "score": 1, "replies": []}, {"body": "How do higher interest rates tame inflation?  Don’t they just mean that people with lots of money get more free money in interest they can then spend to drive up prices even more?", "score": 1, "replies": [{"body": "Majority of people don't have a lot of money. Higher interest rates discourage borrowing \nand hence curbing demand for majority of goods/services. It also encourages savings instead of spending as it gives higher returns reducing demand and hence reducing inflation.", "score": 1, "replies": []}]}, {"body": "Bonds aint gonna crash. Feds just gonna buy it back up. The ballpark aint the same, we got different players now little homie", "score": 1, "replies": []}, {"body": "Sure but thats all been happening at steady state over the past year... what's caused the explosion in yields over the past 2 weeks = Leveraged players who bought bonds used as collateral for loans to buy more bonds used as collateral for loans to then buy more bonds... repeat this until the risk team cuts you off. Then fast forward 18 months and you are getting margin called having to sell bonds at a fervent pace. My best guess.", "score": 1, "replies": []}, {"body": "What is this r/bondstreetbets? But jokes aside nice post OP.", "score": 1, "replies": []}]}
