{"title": "$TSLA Daily Thread - October 23, 2023", "selftext": "&#x200B;\n\nhttps://preview.redd.it/sgow0gb5qcjb1.png?width=1024&format=png&auto=webp&s=66b946e6eb58829619e7609470913a0f2c785343", "id": "17e9n5b", "created_utc": 1698027009.0, "score": 32, "upvote_ratio": 0.88, "num_comments": 398, "comments": [{"body": "\"I said we would advertise. We are doing so at small scale and will do so at larger scale as we figure what works best.\"  \n[https://twitter.com/elonmusk/status/1716331220726951975?s=19](https://twitter.com/elonmusk/status/1716331220726951975?s=19)\n\n\n[in response  to  James Stephenson](https://twitter.com/ICannot_Enough/status/1716184212380741797?s=19)", "score": 26, "replies": [{"body": "Good, there's a lot to gain with advertising.", "score": 11, "replies": []}, {"body": "I like that tweet", "score": 3, "replies": []}, {"body": "Simps: *Tesla applying first principles to advertising. Absolutely unheard of in the industry*", "score": 8, "replies": [{"body": "he’s making effective advertising merely late", "score": 7, "replies": [{"body": "🤣🤣", "score": 5, "replies": []}]}, {"body": "Lol every time", "score": 2, "replies": []}]}, {"body": "Simps in shambles", "score": 4, "replies": []}]}, {"body": "We were rich once.", "score": 13, "replies": [{"body": "A few years ago at this point", "score": 7, "replies": []}, {"body": "And young", "score": 6, "replies": []}]}, {"body": "is anyone considering buying S, X, Y for the free supercharging for life transfer? i’m seriously considering it because i have a 2016 S with free supercharging…", "score": 12, "replies": [{"body": "![gif](giphy|xUA7bgLCTSGnh1Qxe8)", "score": 6, "replies": []}, {"body": "The question is how often do you supercharge?  I don't often supercharge my 2015 S, so I don't plan on upgrading just for the free supercharging benefit.  \n\nI was planning to upgrade once FSD was fully released, but it looks like I'll have to wait longer.  I don't like the yoke steering wheels they put on the S/X and how they replaced the turn signals and horn with capacitive buttons.  At least they reverted the horn button back to being a switch on the center of the steering wheel in the Highlander 3.", "score": 4, "replies": [{"body": "you have 30k shares may as well just buy one to help the stock price lol", "score": 2, "replies": [{"body": "Yeah, that's not going to happen.  I can't justify selling shares just to buy a car with features I don't like.  lol", "score": 1, "replies": [{"body": "You honestly get used to it quickly.", "score": 1, "replies": [{"body": "That may be the case, but I’m still not buying it.\n\nI’ve heard people getting used to it, but not the horn button.  IMHO, Tesla’s steering wheel overhaul to cut costs is not the way to go.  Buttons have been on the steering wheel for decades across many OEMs, but not for the turn signals and the horn for obvious usability reasons.  I would probably care less about the steering wheel if FSD was fully complete and reliable.  But for now, I do care about the usability of the steering wheel and the S/X steering wheel is not going to do it for me.  If the Highland steering wheel does come to the S/X, I might reconsider.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "UAW-6,800 UAW MEMBERS AT STERLING HEIGHTS ASSEMBLY PLANT JOINED STAND UP STRIKE, SHUTTING DOWN PRODUCTION AT STELLANTIS' LARGEST PLANT, BIGGEST MONEYMAKER 💀", "score": 12, "replies": [{"body": "Ram truck line", "score": 3, "replies": [{"body": "Ouch! Didn't realize that.", "score": 3, "replies": []}]}, {"body": "We stand for bankrupting US companies and collecting unemployment checks from the government! - UAW", "score": 3, "replies": []}, {"body": "\"I'm a union guy\" -Biden", "score": 2, "replies": []}]}, {"body": "https://preview.redd.it/78l5qb405vvb1.jpeg?width=2271&format=pjpg&auto=webp&s=f95ae721abb327999519b11ef49ad41dce2e21cb\n\nWife and I flew down to Daytona, FL and picked up my 83 yr old dad’s new MX, drove it back to the ATL. Will have my guys do full front PPF and tints. Then I’ll ceramic coat every surface.\n\nRan 85 on FSD and yes the MX is still a pig with a WH/mi of 369. 😂 Air suspension does ride really well.", "score": 11, "replies": [{"body": "Just spent the weekend ceramic coating my Y. What a fucking difference that bitch makes", "score": 5, "replies": [{"body": "is that a difficult process?", "score": 2, "replies": [{"body": "It’s all in the prep. So standard wash, iron decontamination, clay bar, paint correction (if needed), surface preps and then coat. Nothing particularly difficult, but very time consuming. I like the process", "score": 6, "replies": []}]}]}]}, {"body": "Bought 10 more.", "score": 11, "replies": [{"body": "You go girl", "score": 2, "replies": [{"body": "![gif](giphy|kELDhOqIwTi8FEXuy8|downsized)", "score": 3, "replies": []}, {"body": "![gif](giphy|kELDhOqIwTi8FEXuy8|downsized)", "score": 2, "replies": []}]}]}, {"body": "![gif](giphy|3oxHQLHCnuCtjuZjVe)", "score": 11, "replies": [{"body": "Well September has ended....", "score": 7, "replies": []}]}, {"body": "you ever have one of those Mondays where it takes every last bit of willpower you have to get out of bed and go to work? thats my feeling today\n\n![gif](giphy|3owyoUHuSSqDMEzVRu)", "score": 12, "replies": [{"body": "My tolerance for work is so high vs when TSLA was 400", "score": 4, "replies": []}]}, {"body": "In case anyone missed it, the Q3 '23 10-Q was filed today:\n\n[https://www.sec.gov/Archives/edgar/data/1318605/000162828023034847/tsla-20230930.htm](https://www.sec.gov/Archives/edgar/data/1318605/000162828023034847/tsla-20230930.htm)", "score": 11, "replies": [{"body": "I skimmed through it earlier. Didn’t find anything super interesting", "score": 3, "replies": []}, {"body": "I look forward to Rob's breakdown", "score": 3, "replies": []}]}, {"body": "Bought 10 more to get to my goal of 700 woohoo! Unfortunately I will force myself to keep adding as long as we're under 300 lol", "score": 10, "replies": [{"body": "Congrats. Cloud 9", "score": 3, "replies": []}]}, {"body": "Are we going to have a nice xmas like last year again, damn. Im still with you balls of steel gang.", "score": 10, "replies": [{"body": "Plz no more merry margin calls of death", "score": 6, "replies": [{"body": "![gif](giphy|iNiLzpizhcSc8Nr0pR|downsized)", "score": 1, "replies": []}]}]}, {"body": "green wtf?", "score": 9, "replies": []}, {"body": "oh I suppose I should mention that /u/unknownspacepioneer won the cybertruck announcement date contest along with a brand new cybertruck!  \n\nso please make sure to pay him some respect as he is clearly a time traveler or something", "score": 9, "replies": [{"body": "time traveler and Warden of the B0obS of Unusual Size", "score": 4, "replies": [{"body": "he truly has it all", "score": 6, "replies": [{"body": "You may all donate a share to me as I sold my tiny collection for my Model Y. DM me for my PayPal!", "score": 3, "replies": []}]}]}]}, {"body": "Black monday they said?", "score": 10, "replies": []}, {"body": "\\+1000 over the weekend. I thought the put buyer would forget about it, but I guess not", "score": 8, "replies": []}, {"body": "What a recovery!", "score": 9, "replies": [{"body": "Blessed", "score": 5, "replies": []}, {"body": "cleared out all the ~~nates~~ suckers", "score": 10, "replies": []}]}, {"body": "Gween is gween", "score": 9, "replies": []}, {"body": "So maybe Nate made the right decision to sell after all...", "score": 8, "replies": [{"body": "For him personally it may have been the right decision.\n\nHe seems to favor more stability and less volatility in an investment, so TSLA was always going to be a poor fit in his portfolio.  Nate also didn't have conviction in Tesla as a business", "score": 3, "replies": [{"body": "Nate knew zero about tesla. Also obsessed with Elon. Not a good investment for him.", "score": 5, "replies": [{"body": "Well said", "score": 2, "replies": []}]}]}]}, {"body": "&#x200B;\n\nhttps://preview.redd.it/hqr6b4yofzvb1.png?width=1024&format=png&auto=webp&s=e49a6c20b6b8e54f8e62867dbb5ceb37b79a8b0f", "score": 8, "replies": [{"body": "Cool image. Did you create that? Looks a bit like my dog!", "score": 3, "replies": [{"body": "chatGPT + Dalle3. You can also create stuff like this for free with Bing; go to Bing, go to images, click the create button, give it some image description. The description for this was  \" An animal that's a cross between a bull and a bear. It looks confused. Tesla theme.\"", "score": 3, "replies": [{"body": "Great prompt!\n\nhttps://preview.redd.it/kssgsuihqzvb1.jpeg?width=1024&format=pjpg&auto=webp&s=305e2fdd8de859fa7a4e6508368816b4dd96808a", "score": 3, "replies": []}]}]}, {"body": "trans bear bull", "score": 2, "replies": []}]}, {"body": "It’s quiet in here", "score": 9, "replies": [{"body": "Anti advertisers in shambles since Elon admitted there was some benefits to advertising", "score": 6, "replies": []}, {"body": "weak hands gone again", "score": 7, "replies": []}, {"body": "I check in to read somethimes but honestly lots of exciting things going on irl right now and obv the mood here is understandably dim... \nWe'll be back though!", "score": 3, "replies": []}, {"body": "Only so much we can complain about getting fucked.", "score": 4, "replies": []}]}, {"body": "https://preview.redd.it/i5ryd3xvw0wb1.jpeg?width=1284&format=pjpg&auto=webp&s=74a7c287229dcb7361980a815b70e4a5ec41ca79\n\nHmmmmm, maybe helpful down the road\n\n[https://x.com/tslachan/status/1716559970786058712?s=46&t=yWmMeP08cyApbkkhK1zkcw](https://x.com/tslachan/status/1716559970786058712?s=46&t=yWmMeP08cyApbkkhK1zkcw)", "score": 8, "replies": [{"body": "If he loses they gonna cancel giga mex", "score": 3, "replies": []}]}, {"body": "Let's go! 🚀", "score": 6, "replies": []}, {"body": "You can kiss my black ass I ain’t lookin at shit today.", "score": 7, "replies": []}, {"body": "TA only exists because everyone thinks it exists.", "score": 7, "replies": []}, {"body": "[https://twitter.com/3PeaksTrading/status/1716448120979263965](https://twitter.com/3PeaksTrading/status/1716448120979263965)\n\nBring on that fkn santa rally please", "score": 8, "replies": [{"body": "Just not last year's coal in the stocking rally", "score": 6, "replies": [{"body": "You got coal??", "score": 3, "replies": []}]}]}, {"body": "https://x.com/rickygervais/status/1716383954943578623?s=46&t=mG-wx8ewMg03AyZIsmD4-g\n\nLounge members 2134", "score": 7, "replies": [{"body": "Lol. Gold.", "score": 1, "replies": []}]}, {"body": "My body is ready", "score": 6, "replies": []}, {"body": "Don't have anything to say, but just showing solidarity with y'all watching this train wreck in real time.", "score": 6, "replies": [{"body": "![gif](giphy|JYEEdjzlsb280)", "score": 1, "replies": []}]}, {"body": "[https://twitter.com/anuarbekiman/status/1716213944606511548](https://twitter.com/anuarbekiman/status/1716213944606511548)\n\n\\#advertising", "score": 7, "replies": [{"body": "Glad 100 people on Twitter/at the race are now informed about the reasons to buy a Tesla.", "score": 3, "replies": []}]}, {"body": "Anything interesting in the 10q?", "score": 5, "replies": [{"body": "Sawyer: \"Tesla says its capital expenditure for 2023 would exceed the $7 billion to $9 billion target it had laid out earlier this year, as it ramps up output at its factories and gears up to roll out new models.  \n\nThe company's spending is, however, expected to return to the $7 billion to $9 billion range in the next two years, a regulatory filing showed.\"  \n\nMe- I wonder if that is why Elon was so down about the Cybertruck costs?  \nThe Cybertruck tooling costs were obviously much bigger than expected,  so in order to play it safe and stay FCF positive,  they decided to not go as fast as possible on the Mexico plant?", "score": 8, "replies": [{"body": "Demon 😈 gonna wack someone for that miss calculation 🔥", "score": 5, "replies": []}]}]}, {"body": "https://www.reddit.com/r/SpaceXLounge/s/Oss0GT5fFa\n\nDam Elons companies are all dumpster fires yeah", "score": 6, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I think OP is being sarcastic, SpaceX is the good child and Tesla is red headed stepchild", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "They just got to Chuck’s turn and think it’s sweet", "score": 11, "replies": []}, {"body": "Any real news on V12?", "score": 5, "replies": [{"body": "Nope", "score": 5, "replies": []}]}]}, {"body": "We will see Nate buy back in after we go past 400.", "score": 10, "replies": [{"body": "![gif](giphy|jsl82uOLnCdAXBqT1O)", "score": 8, "replies": [{"body": "market just hasnt been the same since the Bogdanoff twins died imho", "score": 3, "replies": []}]}, {"body": "💯 ^%", "score": 3, "replies": []}, {"body": "He will say he buys at the top, but then again it appears he says everything with trolling in mind.", "score": 4, "replies": []}, {"body": "![gif](giphy|l1Aswx03WbLDf9kYw)", "score": 2, "replies": []}]}, {"body": "Bullish  [@RedboxWire](https://twitter.com/RedboxWire)RUSSIAN PRESIDENT VLADIMIR PUTIN SUFFERS CARDIAC ARREST IN PRESIDENTIAL BEDROOM, AN INSIDER GROUP REVEALS - SKY  https://x.com/RedboxWire/status/1716553440514425203?s=20", "score": 10, "replies": [{"body": "need a heart for it to be attacked", "score": 6, "replies": []}, {"body": "I call BS", "score": 4, "replies": [{"body": "Agreed but it's nice to have a little hope", "score": 4, "replies": []}]}, {"body": "Because the next guy will be better, right? Uncertainty won’t be good here", "score": 4, "replies": [{"body": "Russia's is suffering, the next guy is probably going to blame the whole shitshow on Putin and try to salvage some deal to keep Crimea.\n\nTheir economy is in tatters, carbon exports are down significantly, you can't just turn down the tap and reopen it when you want, no more expertise and tech from the West also means it's even worse if they ever slow down.\n\nTheir army was for the longest time seen as the second strongest in the world. A lot of 'state of the art' equipment has been proven to be all talk, including their super special killer rocket that is unstoppable, the one that got stopped by the patriot system...\n\nTheir numerical superiority has been shown to be rather worthless with modern tech, human wave attacks haven't gotten them much. They toke territory because of the surprise factor, like a sucker punch. After the first week, they've lost a lot more than they gained in territory.\n\nEven if their tech was able to go toe to toe with NATO (which it can't), they have lost SIGNIFICANT amounts of everything that matters, even a submarine and a few ships that are either sunk or unsalvageable. Their tanks, helicopters, artillery,... they have lost insane numbers. They are no longer seen as serious threat, not even close to the second strongest army in the world. It also doesn't even matter, because all their neighbours to the West (Belarus is more an occupied state than a real country) belong to NATO and the combined armies of NATO absolutely DWARF Russia. NATO vs China, North-Korea, Russia and Iran and they still stand zero chance in occupying any country. Nuclear destruction has no winners, these dictators want power, they wouldn't achieve power and they know it.\n\nAll this WWIII rhetoric is, at ground, Russian propaganda. Same as all their red lines, not tanks, no long range missiles, no fighter jets, no... Russia threatens and each time it gets repeated and the West holds back, Russia is emboldened. Look at history, what happened with Hitler. Russia needs to be stopped now, hard by a united West, that gives the best chance at a future without war.\n\nDon't forget the invasion started in 2014 and appeasement led to the full scale invasion in 2021, this war has been going on a lot longer. Also maybe look at all the other wars Russia has started since Putin toke power. It's insane how a few monsters are allowed to do this much damage to humanity.\n\nIt's not just the hundreds of thousands of dead and wounded soldiers suffering, the oligarchs are suffering as well and those are the one who will take over. A lot of people don't want this war, many high powered people were killed in the first year, those that spoke up or tried to stop him. Entire families were killed to send a message to the rest. If Putin is dead, they will try and stop the financial bloodshed and as a result, the physical war will cease.\n\nBig chance IF Putin dies, the war ends rather quickly. A bit of uncertainty is not bad if the result is the end of war this year.", "score": 3, "replies": []}, {"body": "The devil you know yadda yadda", "score": 1, "replies": [{"body": "I strongly disagree, things can't really get worse.\n\nRussia is trowing everything they can at Ukraine, nuclear weapons can't be used to gain power or win the war. The result for Russia would be worse than retreating now.\n\nBig chance if Putin dies, they have a black sheep to put the blame on and stop the war.\n\nThat is the Russian playbook, even when their highest in command are killed, they spread rumours and destroy their reputation before they let the public know they are dead or whatever lie they have invented. It would be no different with Putin. They will never admit their strong men are not indestructible, so Putin's public image would be destroyed.\n\n(Realistic chance a future leader would praise him and use propaganda to improve their image, to the benefit of whatever pos that is in charge at the time. Like Putin has done with Stalin.)", "score": 2, "replies": []}]}]}, {"body": "Hope he gets well soon", "score": 3, "replies": [{"body": "wtf", "score": 2, "replies": []}, {"body": "The good die young 😢", "score": 3, "replies": []}]}, {"body": "Очень хорошо!!!", "score": 1, "replies": []}]}, {"body": "Hope you weren’t counting on macro for relief…", "score": 6, "replies": []}, {"body": "Someone on Friday promised us that 212 was the line in the sand!!", "score": 6, "replies": [{"body": "It was. Finishing below was bad.", "score": 0, "replies": []}]}, {"body": "Ohh 😲😲😲 I didn't look since short after market open.. wow, thx market, u didn't think today would turn out like that...", "score": 4, "replies": []}, {"body": "it would be cool if lounge was like the continental in John wick with gold coins and we passed around shares like that  \n\ncool bread pic? here glib take a share no big deal", "score": 4, "replies": [{"body": "we could, i mean the shares arent that expensive anymore", "score": 3, "replies": []}, {"body": "And get to have cool fancy Spanish words as names.", "score": 2, "replies": [{"body": "you referencing the babayaga thing? thats russian", "score": 2, "replies": [{"body": "Excommunicado.\n\nEnough spanish for me.", "score": 3, "replies": []}]}]}]}, {"body": "The website of one of the guys on the space with Elon lol\n\nhttps://preview.redd.it/yt8etwtg60wb1.png?width=823&format=png&auto=webp&s=57b0e4a37cfcc1c0b2e8660ebcff7d3e9e7abf43", "score": 4, "replies": []}, {"body": "![gif](giphy|YZlQaMesgPIAM|downsized)\n\nRed??", "score": 5, "replies": [{"body": "one of my favorite SNL skits", "score": 5, "replies": []}, {"body": "Green bitch!", "score": 4, "replies": []}]}, {"body": "https://x.com/jamesvictorino2/status/1716466965999477018?s=46&t=FJnwUzmO93DGxmO6Ihn37g\n\nWtf is this guy even talking about?", "score": 6, "replies": [{"body": "If tesla gonna fake numbers our stock would be a lot higher", "score": 7, "replies": [{"body": "Yeah, if he was faking shit, hes terrible at it. Rookie numbers. Gotta pump that shit up.", "score": 3, "replies": []}]}, {"body": "Thinks Zack was committing accounting fraud and left the company to strike a deal for immunity and sell the company out. This is a big GoJo theory. Tesla can't be making money legally. They have to be forging shit.", "score": 5, "replies": [{"body": "Roflz ok", "score": 4, "replies": []}, {"body": "They are really running with this \n\nhttps://x.com/vickibryanbonda/status/1716541235144306769?s=46&t=FJnwUzmO93DGxmO6Ihn37g", "score": 3, "replies": [{"body": "This is not uncommon, including non-disparagement language, for someone exiting with a big package.", "score": 3, "replies": []}, {"body": "Standard legal speak. He knows company secrets and is likely on a no compete also.", "score": 2, "replies": []}]}]}, {"body": "Shorts trying to create a story. \n\nSimple facts. Zach made 100M+ survived Elon and wants to do something else.", "score": 3, "replies": []}, {"body": "\"personal benefits\" probably Elon's glass purchases\n\n\"personnel decisions\" probably for Tesla sidelining David Searle for investigating internal fraud https://www.teslarati.com/tesla-loses-head-of-legal-purchasing-probe-david-searle/   ... weird I missed that Elon wants to personally approve each individual contractor hired at Tesla - https://www.cnbc.com/2023/05/15/tesla-ceo-elon-musk-says-in-email-he-must-approve-all-hires.html", "score": 2, "replies": [{"body": ">I missed that Elon wants to personally approve each individual contractor hired at Tesla\n\nNow he doesn't even know the latest OEM that signed up for NACS. Guy's clueless and just busy coming up with the  edgiest meme since \"My Pronouns are prosecute/Fauci\".", "score": 1, "replies": []}]}]}, {"body": "![gif](giphy|MZocLC5dJprPTcrm65)\n\nBTC playing with 52 week high now", "score": 6, "replies": [{"body": "Risk on or fake out 🧐", "score": 3, "replies": [{"body": "god candles happening now, feels like old tesla days", "score": 5, "replies": [{"body": "Is this from the spot news? Everyone knew that was coming", "score": 3, "replies": [{"body": "ibtc ticker and cusip registered for ishares etf but this news is a few hours old, no crazy official confirmation yet", "score": 5, "replies": [{"body": "Yeah all that news is sort of known. Like everyone knew multiple spot btc etfs were coming. This feels like something else", "score": 2, "replies": []}]}]}]}]}, {"body": "Btc as a hedge is back on the menu boys!", "score": 1, "replies": []}]}, {"body": "Do you think Tesla would issue a cease and desist if a group of investors started funding ads to educate the public on the pricing and features of Tesla cars?", "score": 5, "replies": [{"body": "Investors would get a better return buying shares then starting ad campaign. \n\nRemember the dude that bought the Times Square Tesla ads? Where did that get him or Tesla? Most def be better off with more shares.", "score": 5, "replies": [{"body": "it depends on how many shares you have.", "score": 4, "replies": [{"body": "Also depends how many pool their money", "score": 4, "replies": []}, {"body": "I suppose, but I think it will take 100M+ to make a noticeable difference \n\nI suppose some investors want to prove at a smaller scale that it can work and get management on board. \n\nHats off to them if they succeed", "score": 1, "replies": []}]}]}]}, {"body": "Super Mario Bros. Wonder is amazing, I should have bought NTDOY instead of TSLA", "score": 9, "replies": [{"body": "How would you rate it on a scale of 0 to 800.85?", "score": 3, "replies": []}]}, {"body": "Who’d we lose in this drop ? Achilles?", "score": 9, "replies": [{"body": "Decades of research shows timing the market results in underperformance over the long term. It is exceptionally rare for someone to have the talent, knowledge and resources to trade successfully. \n\nAchilles: I can trade the market.", "score": 14, "replies": []}, {"body": "He said he wanted to re-buy 20% more shares after selling all shares at 214 last week.\n\nThat implies his re-buy price is $178.33, assuming a tax differed account.  The re-entry price would be lower if he has to pay taxes on any capital gains. \n\nTSLA currently trading at just over $215.\n\nJumping in and out of a stock is a bad idea IMO.  \n\nSome people get lucky and pick up more equity, but many others end up losing shares", "score": 3, "replies": [{"body": "He coulda got 10% more at 202 assuming he sold at 212.", "score": 2, "replies": []}]}, {"body": "I'm never lost. Just try timing the market. It's a long week. Lots of earnings this week.", "score": 4, "replies": [{"body": "Will you buy back higher?", "score": 2, "replies": [{"body": "Naw I just roll into leaps usually and ride them out till a peak. I'd buy Jan 2026 250s right now.", "score": 1, "replies": []}]}]}]}, {"body": "Maybe if we make rock bottom a nicer place to be...", "score": 8, "replies": [{"body": "I got friends in low places…", "score": 6, "replies": [{"body": "where the whiskey drowns and the beer chases ...", "score": 5, "replies": []}]}]}, {"body": "Tesla advertising pitch:\n\n*Imagine JFK in Dallas in a Cybertruck*", "score": 8, "replies": [{"body": "How about Elon, Joe Rogan and Tucker drive a Cybertruck around while live-streaming a debate about vaccines, the border and abortion?\n\n“ONLY TESLA CAN DO THIS!! LOOK AT THIS AD!!” - QElon on Twitter", "score": 2, "replies": [{"body": "Shhhh don't give them any \"good ideas\"", "score": 2, "replies": []}]}, {"body": "too soon", "score": 3, "replies": [{"body": "Then Franz-Ferdinand in Sarajevo", "score": 2, "replies": [{"body": "Too late!", "score": 3, "replies": []}]}]}, {"body": "How about a CT chasing terrorists on motorcycles in Israel.", "score": 3, "replies": []}]}, {"body": "It will be amazing if Nate sold at the bottom 😂", "score": 9, "replies": [{"body": "He's the best buy signal!", "score": 9, "replies": []}]}, {"body": "Wonder if Tesla offered a “zero interest for 3 months promo” would help sales — would bridge gap to tax credit going point of sale", "score": 9, "replies": [{"body": "That’s innovative, sounds like a reasonable strategy.", "score": 3, "replies": []}, {"body": "Just lower the prices", "score": 2, "replies": [{"body": "When bots make the cars, we can give them away for free", "score": 3, "replies": []}]}]}, {"body": "“Elon is convinced”\n\nhttps://x.com/wholemarsblog/status/1716367787650867256?s=46&t=fGVL0206fdWMIjq9C1_Fgg", "score": 5, "replies": [{"body": "Hopefully he'll be able to convince us soon he's convinced", "score": 6, "replies": []}, {"body": "🤣🤣", "score": 2, "replies": []}]}, {"body": "Stoopid capex", "score": 4, "replies": [{"body": "Stupid margins, stupid demand, stupid Elon", "score": 4, "replies": []}]}, {"body": "There is a lucid air sellling for 50% msrp on cars and bids. 7.5k miles too", "score": 4, "replies": [{"body": "Have they tried advertisin??", "score": 2, "replies": []}, {"body": "Lucids look nice, but holy fork are they expensive.", "score": 2, "replies": [{"body": "I think S looks way better overall.", "score": 5, "replies": [{"body": "Oh, I absolutely agree. The S is a sexy beast. Lucid is classy looking. Kinda New Money vs Old Money vibe.", "score": 1, "replies": []}]}]}, {"body": "It's sooo ugly.", "score": 2, "replies": []}]}, {"body": "![gif](giphy|3og0IHx11gZBccA98c|downsized)", "score": 4, "replies": []}, {"body": "Goin for $200 so fast.", "score": 4, "replies": []}, {"body": "Gains are transitory", "score": 5, "replies": [{"body": "Life is transitory", "score": 1, "replies": []}]}, {"body": "Btc 🚀", "score": 4, "replies": [{"body": "1m imminent.", "score": 2, "replies": []}, {"body": "Real Sophie's Choice here.", "score": 1, "replies": []}]}, {"body": "Cathie sold coin and gbtc today lol", "score": 3, "replies": []}, {"body": "Those rg353v emulators are sweet. I feel like throwing my money away on one for myself and for Christmas gifts", "score": 4, "replies": [{"body": "I prefer steam deck so I can play ps2 and higher.", "score": 3, "replies": []}]}, {"body": "So over the past few months I have had several negative interactions with homeless Black people in Atlanta. And a white person too. But it’s Atlanta so you know… Just law of demographics they’re going to tend to be black.\n\nLast night at 5 AM a black guy with hood up and a gator covering almost his entire face except for his eyes was recorded walking down my driveway towards cars parked at the end. He wasn’t really looking in the windows, he was making his way towards the cars with a backpack on no doubt to steal steal. Flashed his flashlight at the camera when he realized he was being recorded then went on his way, hopping over the fence in my backyard and walking away on the train tracks. \n\nI spent six years in DC so I sent the video to a few of my friends and was met with dead silence. They know that I’ve drifted more to the right recently but you would think that something so personal, something that happened to me as an individual, would prompt some sort of sympathetic response but simply by giving people a video it comes off as an accusation and statement of a truth they do not want to acknowledge", "score": 11, "replies": [{"body": "Anytime your personal property is invaded is unsettling. \n\nI’m not sure what the solution is but sorry man! 🙏", "score": 5, "replies": [{"body": "birdshot if you're the forgiving type\n\nbuckshot if not", "score": 5, "replies": [{"body": "Slugs if you want to be sure.", "score": 3, "replies": []}]}]}, {"body": "dEfUnD tHe PoLiCe", "score": 4, "replies": [{"body": "The police won't do shit except show up hours later to take a report.", "score": 3, "replies": []}]}, {"body": "What is the point in drawing attention to the fact that the homeless people are black? Maybe your friends are turned off by that.\n\n 90+% of the crackheads and burglars in Spokane wa are white, yet I don’t call them white.", "score": 3, "replies": [{"body": "I didn’t to my friends", "score": 1, "replies": []}]}, {"body": "I guess growing up in a shit town desensitized me to this. You had a guy looking for stuff in your driveway, don’t act so violated it’s not personal. In no way I’m saying it’s not wrong, I just don’t think that’s why your friends aren’t answering. I wouldn’t answer either if someone was clearly begging the question", "score": 2, "replies": [{"body": "Fair point tbh", "score": 3, "replies": [{"body": "It's not. Don't succumb to that nonsense. What that guy said is the slippery slope that ends with \"petty\" crimes not being prosecuted, etc. Check broken window theory.", "score": -1, "replies": []}]}]}, {"body": "People loot and steal cars in my nice Canadian neighborhood,  it's a worldwide phenomenon.", "score": 2, "replies": [{"body": "No, don't normalize this stuff. There are PLENTY of neighborhoods in the US where you don't even need to lock your car. There is a reason why people from all over the world want to come to the US... that reason is the exact opposite of your so-called \"worldwide phenomenon\" of looting & stealing. This is NOT normal for the US!", "score": -1, "replies": []}]}]}, {"body": "This cunt stock better go gween", "score": 7, "replies": [{"body": "Green is also good!", "score": 4, "replies": []}]}, {"body": "🚀", "score": 7, "replies": [{"body": "🚀🚀", "score": 5, "replies": [{"body": "🚀🚀🚀", "score": 5, "replies": []}]}]}, {"body": "Not selling anything like always. But looking at the overall market especially the renewable energy sector, i can see Tesla go down in the the 150s again.\n\nI save as much as i can and will buy with every spare cent below 150.", "score": 5, "replies": [{"body": "Why not start now?", "score": 3, "replies": [{"body": "not enough minerals", "score": 3, "replies": []}]}]}, {"body": "I have 4 cc’s expiring soon (Dec). 220’s, 190, and 185’s. At this point all of my cc’s are out of the money expect for the 190 and 185’s.\n\n![gif](giphy|uauOgWP1E2p2g|downsized)", "score": 6, "replies": []}, {"body": "Sucks we sold off so much on earnings that were expected to be bad. Pumped for refresh 3 in US, minor upgrades to Y (bet they add rear seat screen) and CT. Been a tough year but I’m not worried", "score": 6, "replies": [{"body": "yeh tbh I thought it would be mostly priced in but think the earnings call put a sour taste in markets mouth", "score": 8, "replies": [{"body": "Elon made it much worse than it needed to be.", "score": 10, "replies": []}]}, {"body": "Elon's downward guidance and incoherent rants didn't help market confidence, even though the actual numbers were ok.  Tesla's cash flow was the highest it has been in a year", "score": 9, "replies": []}, {"body": "We will be fine. This is like the stock price too high sell off. Tsla securities 101: don't listen to elon", "score": 6, "replies": []}]}, {"body": "Kirkhorn’s severance agreement: As of August 4, 2023 (the “Separation Date”) you are no longer serving as Master of Coin and Chief Financial Officer. Your last day of employment [***]", "score": 6, "replies": []}, {"body": "AH looks good", "score": 5, "replies": []}, {"body": "I think tesla should _______ which will make the stock go upward", "score": 5, "replies": [{"body": "force Elon to use a dumb flip-phone", "score": 7, "replies": []}, {"body": "Release a product on time and scale it up smoothly without bitching and whining about ww2.", "score": 12, "replies": []}, {"body": "Announce more gigafactories. They realistically take 2 years to build and longer to ramp.", "score": 3, "replies": []}, {"body": "educate the unwashed masses via advertising", "score": 3, "replies": []}, {"body": "Sell all kind of tesla gadgets and become like amazon", "score": 2, "replies": []}]}, {"body": "I gotta admit, those cybertruck spotted posts on tesla motors, makes me wana leave the sub. I've probably seen a hundred of these posts by now.", "score": 9, "replies": [{"body": "Secret truck", "score": 3, "replies": []}, {"body": "Cybertruck wen", "score": 2, "replies": []}]}, {"body": "Looks like ozempic gonna cure world hunger by reducing the massive appetite of American fatasses", "score": 8, "replies": [{"body": "It’s our I am Legend timeline", "score": 4, "replies": [{"body": "I think about that a lot", "score": 2, "replies": []}]}, {"body": "to think elon could have solved this issue a few years ago with a simple one time billion dollar donation", "score": 5, "replies": []}, {"body": "Ozempic going to solve world hunger and FSD", "score": 2, "replies": []}, {"body": "Nothing like GLP1-induced gastroparesis (stomach paralysis) to make people feel full, stop people from eating...  obesity solved!", "score": 1, "replies": []}, {"body": "$900/month McDonald's is cheaper.", "score": 1, "replies": []}]}, {"body": "So glad I have no calls", "score": 3, "replies": [{"body": "Thinking about buying more calls soonish maybe", "score": 3, "replies": [{"body": "I might buy one lol. I actually forgot I had a 400c for 2025 - I’d closed the sold call last time we droppped below 200 and reopened it a few times so even if it hits 0 I’ll break even (roughly)", "score": 3, "replies": []}, {"body": "This guy makes bank.", "score": 0, "replies": []}]}]}, {"body": "Maybe if we raise rates a bit more...", "score": 3, "replies": []}, {"body": "Maybe if we start a war...", "score": 3, "replies": [{"body": "Trend following - geopolitics edition", "score": 2, "replies": []}]}, {"body": "At least NVDA is green", "score": 3, "replies": []}, {"body": "Maybe if we increase gdp by selling more drugs and fast food...", "score": 3, "replies": []}, {"body": "https://x.com/billackman/status/1716450746814570860?s=46&t=WyhsS8WzmgKtgEuHZzFOrA\n\nWe covered our bond short.\n\nThere is too much risk in the world to remain short bonds at current long-term rates.\n\nThe economy is slowing faster than recent data suggests.", "score": 3, "replies": []}, {"body": "Green? Did we just announce FSD level 5 approval? \n\n[No idea why green]", "score": 3, "replies": [{"body": "*whispers*\n\nPsssst.  Look at the market..", "score": 3, "replies": [{"body": "pssst im afraid to", "score": 4, "replies": []}]}]}, {"body": "Tesla ai day 2021 : August\nTesla ai day 2022: Spetember \nTesla ai day 2023: when?\n\nI dont get this inconsistency, seems like year 3 is pretty important considering year one was a dancing person in a robot costume.", "score": 3, "replies": [{"body": "no more fucking anything days plz", "score": 14, "replies": [{"body": "Advertising day", "score": 4, "replies": [{"body": "It'll just be Elon saying that demand is infinite and they don't need to advertise while announcing a new wave of price cuts.", "score": 5, "replies": []}]}, {"body": "How about geenday?", "score": 2, "replies": []}, {"body": "Agreed. No more days for a long time", "score": 1, "replies": []}]}, {"body": "Honestly, AI day is a waste of time. I doubt they have anything much new to say vs AI Day 2. Just get FSD done or increase subscribers of FSD.", "score": 3, "replies": []}, {"body": "AI days have been aimed more at recruitment than investors.  It is possible that Tesla does not need to recruit additional AI engineering talent at this time.\n\nAutonomy Day 2019 was an AI-related event for the investor community.  The material was too technical for Wall Street analysts, few of whom seemed to understand any of it.", "score": 6, "replies": []}, {"body": "Investor Day was basically another AI day. I could see another one around spring next year", "score": 2, "replies": []}]}, {"body": "/u/doctr_sbaitso Bot Lives Matter", "score": 3, "replies": []}, {"body": "We will beat and come out of this. Covid was way worse. Everbody was fear mongering that nobody needs a car during lockdown and that tesla will be trading under 100 pre pre split for years.", "score": 8, "replies": [{"body": "This time we aren't all balls deep into margin either.   Cash ready and waiting...", "score": 9, "replies": [{"body": "And Elon isn’t selling", "score": 6, "replies": []}]}, {"body": "Tesla will for sure do ok. The question/concern always comes down to valuation and multiples of TSLA. During Covid we were also $30-60 a share.\n\nA lot less risky now than then for the company, but also don’t really deserve the unlimited demand, high revenue/margins/earnings, FSD solved by eoy, robotaxis everywhere in 2 years multiple.", "score": 7, "replies": []}]}, {"body": "Green...fuck....Elon isn't happy right now", "score": 7, "replies": []}, {"body": "This is the bottom.\n\nThis is the top.\n\nWe’re mooning.\n\nWe’re dooming.\n\n🎢🎢🎢🎢🎢\n\nLife is just a fucking box of chocolates. 🍫", "score": 7, "replies": [{"body": "Nobody knows anything", "score": 8, "replies": [{"body": "Except easy money hacks", "score": 3, "replies": []}, {"body": "somebody knows nothing", "score": 3, "replies": []}, {"body": "The MM's do, they orchestrate the whole thing", "score": 1, "replies": []}]}]}, {"body": "TSLA Shareholders: [https://x.com/crazyclipsonly/status/1716147403840012484](https://x.com/crazyclipsonly/status/1716147403840012484)", "score": 4, "replies": [{"body": "i feel like this image represents us well too:\n\n&#x200B;\n\nhttps://preview.redd.it/4rxhii936zvb1.jpeg?width=640&format=pjpg&auto=webp&s=816d9b61be6fcf7102c3faade5423a4b13b5301b", "score": 6, "replies": []}, {"body": "Lol my thoughts exactly", "score": 3, "replies": []}]}, {"body": "Opened some 230 CCs this morning. Meh premiums", "score": 4, "replies": [{"body": "I'll open a couple if we bounce back up. I don't dare now.", "score": 3, "replies": []}]}, {"body": "It's monday in the middle of the working hours in US but clearly wasting time with two oxygen wasters like sacks and ramaswamy is the priority", "score": 7, "replies": [{"body": "I plan to vote against any future large stock-based compensation for Elon Musk as CEO of Tesla. \n\nBy his own admission in a tweet he doesn't do much for Tesla anymore.  His behavior on social media damages Tesla's brand and pushes away potential customers.  Many of the grifters in his orbit are bad influences.\n\nElon demands that the workers at Tesla deliver to the highest standards.  We should hold Elon Musk to that same fucking standard", "score": 23, "replies": [{"body": ">Elon demands that the workers at Tesla deliver to the highest standards.  We should hold Elon Musk to that same fucking standard\n\nCompletely agree.", "score": 13, "replies": [{"body": "Rules for thee", "score": 13, "replies": []}, {"body": "Third!", "score": 2, "replies": []}]}, {"body": "He was at the formula 1 race, looking for improvements to the cars. He is hyper dedicated.", "score": 3, "replies": []}]}, {"body": "Concerning.", "score": 3, "replies": []}, {"body": "Has to be done. Free speech, civilization, no remote work, blah blah blah!", "score": 2, "replies": []}]}, {"body": "Excerpt from 2043 Musk biography:\n\nThe atmosphere in the Third Quarter 2023 call was thick with apprehension.  Musk entered in demon mode, obvious to all present, and burst in and started talking without any customary pleasantries, or even turning on the mic.  Only after five minutes did anybody have the nerve to tell him the microphone was still muted, and it after activation he did not acknowledge his oversight.\n\nAsked routine questions on deliverables, visibly annoyed Musk launched into a rant about the evils of work from home, complete with reference to the French Revolution.  Nobody was buying it in the room, and his CFO looked down during the entire period.\n\nTesla stock fell 10% the next day, making it one of the worst days on record.", "score": 7, "replies": [{"body": "Could you please orate each earning call + Twitter drama he gets into 🥰🙏🏻\n\nThat was actually beautiful 🥹", "score": 6, "replies": [{"body": ">That was actually beautiful 🥹\n\nI was trying to imitate Isaacson's style of writing.", "score": 6, "replies": []}]}, {"body": "was his mic muted or the call muted? Because I didnt even hear Martin in the beginning", "score": 5, "replies": [{"body": "Must have been the call was muted, on X you could hear both from the start.", "score": 7, "replies": []}]}, {"body": "Q3 will save us", "score": -1, "replies": []}]}, {"body": "🚀🚀🚀", "score": 5, "replies": []}, {"body": "I think Boring Company might want to hire some of those Palestinian tunnelling experts.", "score": 4, "replies": [{"body": "Yeh those palestinians did it in a cave! With a box of scraps!\n\nElon: well, I’m not palestinian sir", "score": 3, "replies": []}]}, {"body": "BTC will save us", "score": 3, "replies": []}, {"body": "![gif](giphy|UhrHK7yTdYH9D0yIqf|downsized)", "score": 5, "replies": []}, {"body": "superbowl ads please save us", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Buy", "score": 4, "replies": []}, {"body": "I think we'll probably see it eventually", "score": 4, "replies": []}]}, {"body": "Maybe if we block the mutually beneficial international trade network we spent decades building...", "score": 4, "replies": []}, {"body": "Maybe if we replace facts with opinions (my opinions)...", "score": 4, "replies": [{"body": "Is your opinion we'll all rich as shit by 2030?", "score": 3, "replies": []}]}, {"body": "💦", "score": 2, "replies": []}, {"body": "Pop pop", "score": 2, "replies": []}, {"body": "Nateth", "score": 2, "replies": []}, {"body": "Did we get poorer?", "score": 2, "replies": [{"body": "Yes", "score": 3, "replies": []}]}, {"body": "3rd day is here. Let's see what happens. Just bought 15 more. This is a learning experience.", "score": 2, "replies": []}, {"body": "Who needs money anyway", "score": 2, "replies": []}, {"body": "![gif](giphy|JRPftUYuIRw3axuh5y|downsized)", "score": 2, "replies": []}, {"body": "![gif](giphy|kPAEHt9MwTznulisFO|downsized)", "score": 2, "replies": []}, {"body": "Maybe if I buy more calls...", "score": 2, "replies": []}, {"body": "green macro not going to save us", "score": 2, "replies": []}, {"body": "That bull under the moon looks kinda shy right now", "score": 2, "replies": []}, {"body": "Maybe if we spend money to store all the ill formed people in a special warehouse until we release them back into society to commit more crimes...", "score": 2, "replies": []}, {"body": "https://x.com/dimazeniuk/status/1716556240908681538?s=46\n\nOff road CT", "score": 2, "replies": [{"body": "The guys off-roading it need to floor that bitch", "score": 1, "replies": []}]}, {"body": "Is anyone using TSLY ETF? If so how has it performed for you?", "score": 2, "replies": [{"body": "I sold out of it an broke even after a payout initially. It’s super risky as its nav erodes. Gotta really catch it through an upswing", "score": 1, "replies": []}]}, {"body": "Why have we not established a Glibgloby first poster rule?  We're just asking for trouble right now.", "score": 6, "replies": [{"body": "Glib simps are just a level below Elon simps. Didn’t you know he was just chatgpting bread facts for you? Free yourself", "score": 8, "replies": []}, {"body": "![gif](giphy|dJYoOVAWf2QkU)", "score": 3, "replies": []}, {"body": "yeah we may need to go into glibglob lockdown if this keeps up\n\nhttps://preview.redd.it/cd8anlf7dvvb1.jpeg?width=1488&format=pjpg&auto=webp&s=d427690b4f1f8ce08ab8c2a7c2a57b45be27818f", "score": 2, "replies": [{"body": "You also need to show up, Mister.", "score": 6, "replies": [{"body": "I was busy eating cherry pie made with cherries from my cherry tree with home made vanilla ice cream with added pectin for smoothness while watching gen V, which took precedence", "score": 2, "replies": []}]}, {"body": "Super impractical hands on this one.", "score": 1, "replies": []}]}]}, {"body": "https://twitter.com/VivekGRamaswamy/status/1716491507136450725?t=3XeTg_kFWXaIBtrQ48nNQw&s=19\n\nIt's happening 3pm et.", "score": 5, "replies": [{"body": "I'm sure this won't be filled w conspiracy theories", "score": 6, "replies": []}, {"body": "Elon: If there is too much illegal immigration you get an Israel-like situation that the immigrants take over.\n\nStock -20%", "score": 5, "replies": [{"body": "And turn your children trans.", "score": 4, "replies": [{"body": "Or worse… roman-catholic", "score": 1, "replies": []}]}]}, {"body": "Sucks and Elon together again 💀", "score": 4, "replies": []}, {"body": "Indian magatard", "score": 6, "replies": [{"body": "hes indiaredpill", "score": 2, "replies": [{"body": "Yup, just as irrelevant", "score": 2, "replies": []}]}, {"body": "https://preview.redd.it/z7jm9m6gqzvb1.jpeg?width=828&format=pjpg&auto=webp&s=d495837ff21cf570f964e6ac51f88e856c5086bb", "score": 2, "replies": [{"body": "Chuck Schumer is next week?", "score": 2, "replies": []}]}]}, {"body": "“I’m a centrist”", "score": 3, "replies": []}, {"body": "We agree that illegal immigration is a problem.\n\nOk, thx bye.", "score": 2, "replies": []}]}, {"body": "Nice red macro day to kick us under 200?", "score": 3, "replies": [{"body": "I sold everything Friday at 214. Hoping for a nice dip to add 20% more shares.", "score": -1, "replies": [{"body": "Oh lol", "score": 6, "replies": [{"body": "People are giving up on this stock for the long term and moving to trades for short term gains.  There was similar discussion here: [https://www.reddit.com/r/teslainvestorsclub/comments/17ealno/comment/k63g0sk/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/teslainvestorsclub/comments/17ealno/comment/k63g0sk/?utm_source=share&utm_medium=web2x&context=3)", "score": 1, "replies": []}]}, {"body": "Good luck. I sold my leveraged shares when we broke the 20DMA, which was around 230 I think. My LEAPs are still fooked though", "score": 2, "replies": [{"body": "That was wise.", "score": 1, "replies": [{"body": "Yep, aim of the game with the levshares is avoid ruin, and then be there for the next runup", "score": 3, "replies": []}]}, {"body": "Jan 2025s?\n\nI sold them on the Jan-Feb pump this year, couldn't stomach Elon anymore at more than 100% exposure", "score": 1, "replies": [{"body": "Those are the ones.", "score": 1, "replies": []}]}]}]}]}, {"body": "Didn't have much cash. Bought 1 Nov 3 $190P Friday. Its up 51% in 1 trading day. Normally Id sell if I get 50% in 1 day. Sell or hold?", "score": 2, "replies": [{"body": "Sell for sure. I'm a medium term bear but those 1-2 week shitputs are a gift to sell at breakeven, let alone +50%", "score": 8, "replies": [{"body": "Yeah. If I buy something short term for cheap and it pops I have a rule to sell if its up 50% in 1 trading day or 100% in a week. So I was definitely leaning towards sell.", "score": 4, "replies": []}, {"body": "Sold. Bought 1 TSLA share and a few TSLY in my Roth IRA", "score": 4, "replies": [{"body": "Congrats!", "score": 2, "replies": [{"body": "Thanks.", "score": 1, "replies": []}]}]}]}, {"body": "Sell, we’ll bounce off 195", "score": 6, "replies": []}, {"body": "Just sold mine for approximately 50% as well.", "score": 4, "replies": []}, {"body": "Sell. Buy share", "score": 8, "replies": []}]}, {"body": "Maybe if we silence everyone who speaks opposing views...", "score": 4, "replies": []}, {"body": "Why does my Apple Music pause every time I open Twitter or Reddit now? On iPhone 15 pro. There no music or sound on this thread", "score": 2, "replies": [{"body": "Same bull shit for me this morning, can’t drive and pull up Reddit", "score": 3, "replies": []}]}, {"body": "Elon on spaces talking about the wars  https://x.com/DavidSacks/status/1716530087397589138?s=20", "score": 3, "replies": [{"body": "Elon is talking now.", "score": 2, "replies": []}]}, {"body": "And red is Prichard colon", "score": 2, "replies": []}, {"body": "Putin got some of his own medicine?", "score": 3, "replies": [{"body": "Plane grenade?", "score": 1, "replies": []}]}, {"body": "150 Million Shares Trader + Flat\n\nNice recovery!\n\nEarnings start tomorrow 🫡\n\nMiddle East moves post ground offensive probably this week too. 🤷🏻‍♂️\n\nHope for the best!", "score": 4, "replies": []}, {"body": "My souffle", "score": 4, "replies": [{"body": "Our soufflé long gone 🤢", "score": 2, "replies": []}]}, {"body": "Fucking brutal", "score": 2, "replies": []}, {"body": "Breaking Tesla slashes prices of TSLA shares by 5%.", "score": 2, "replies": [{"body": "Why not try advertising TSLA shares instead, Elon?", "score": 2, "replies": []}]}, {"body": "1. Subway billboards in Japan\n\n2. Ten Google adwords\n\n???. Education on fundamental advantages of evs and tesla", "score": 1, "replies": [{"body": "Best I can do is $420k worth of twitter ads", "score": 2, "replies": [{"body": "Best we can get is another maga spaces or livestream from the border", "score": 1, "replies": []}]}, {"body": "Stop being in denial, dude.", "score": 4, "replies": []}]}, {"body": "Omfg is chicky gonna be proven right. He’s on a streak lately", "score": 1, "replies": [{"body": "Nah hes wrong on enph. Or was that meet kevin. Can’t recall", "score": 4, "replies": []}, {"body": "He’s lowered to $69 from $80. Fool", "score": 3, "replies": []}]}, {"body": "So is Nate gone? That's about the only bullish thing I can think of right now", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "![gif](giphy|4ZikOEKno4dnssXLzZ)", "score": 5, "replies": []}]}, {"body": "I bought leaps. You all know what to do.", "score": 1, "replies": [{"body": "Lol", "score": 6, "replies": []}, {"body": "Jan 2026 250s for $60?", "score": 3, "replies": [{"body": "Yes sir.", "score": 1, "replies": [{"body": "Godspeed! 🫡", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Hang him.", "score": 6, "replies": [{"body": "By the gonads", "score": 2, "replies": []}]}, {"body": "Must be a hard life you live", "score": -1, "replies": []}]}, {"body": "![gif](giphy|zk0zTXQY5ukCs|downsized)", "score": 1, "replies": []}, {"body": "Red close?", "score": 1, "replies": []}, {"body": "Elon will save us 🤥🤥🤥", "score": 2, "replies": []}, {"body": "Maybe if we build more weapons...", "score": 0, "replies": []}, {"body": "Maybe if we teach gender ideology and import more people with incompatible belief systems...", "score": -1, "replies": []}, {"body": "Maybe if we put all the poor people in one neighborhood and keep everyone else out of there...", "score": -1, "replies": []}, {"body": "oh look, I was right about something again 🥱\n\n[https://www.reddit.com/r/TSLALounge/comments/z1kzas/comment/ixdww6o/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/TSLALounge/comments/z1kzas/comment/ixdww6o/?utm_source=share&utm_medium=web2x&context=3)\n\nhey upvotemeok, I think you're a bitch if you don't approve my comment because I'm shadowbanned", "score": -8, "replies": [{"body": "Nice. Now predict what will happen next 12 months, buy the appropriate derivatives and show us your fuck u money instead of your reddit comments", "score": 8, "replies": []}, {"body": "I see your comment", "score": 3, "replies": [{"body": "Same", "score": 3, "replies": []}]}, {"body": "Still time to be wrong", "score": 2, "replies": []}]}]}
