{"title": "One daytrader's experience on Monday's crash/bounce", "selftext": "", "id": "3iuv5d", "created_utc": 1440864894.0, "score": 55, "upvote_ratio": 0.96, "num_comments": 58, "comments": [{"body": "What makes Monday a panic and the previous Friday not a panic?\n", "score": 5, "replies": [{"body": "Say Friday lost 100 points in one day. Monday lost 100 points in 5 minutes.", "score": 8, "replies": [{"body": "By that measure, there's never been a panic in the past 20 years except last Monday, not even in 2008.", "score": 2, "replies": [{"body": "[Never, except Monday?](https://en.wikipedia.org/wiki/2010_Flash_Crash)", "score": 1, "replies": [{"body": "First of all, that wasn't panic.  That was just someone making a mistake.  Secondly, it didn't plunge 100 pt in 5 minutes.\n", "score": 1, "replies": [{"body": ">On May 6, 2010, U.S. stock markets opened and the Dow was down, and trended that way for most of the day on worries about the debt crisis in Greece. At 2:42 p.m., with the Dow down more than 300 points for the day, the equity market began to fall rapidly, **dropping an additional 600 points in 5 minutes** for a loss of nearly 1,000 points for the day by 2:47 p.m. Twenty minutes later, by 3:07 p.m., the market had regained most of the 600-point drop.[11]:1\n\nAnd 100 pts is relative. I don't know the exact numbers. You go look.\n\nI'd like to know what you would qualify as panic.", "score": 1, "replies": [{"body": "also, isn't the market technically incapable of panicing beyond a certain point? Aren't there artificial supports that won't allow more than a 10% selloff in a single day?", "score": 1, "replies": [{"body": "You're talking about circuit breakers? That stops the trading for some time, but when the market reopens the price could be lower.", "score": 2, "replies": []}]}, {"body": "The way I remembered it, mostly people were just confused as to what happened.  There was no widespread selling and therefore no panic.\n", "score": 1, "replies": []}]}, {"body": "someone? more like many someones. It was most definitely a panic. ", "score": 1, "replies": [{"body": "Either this guy is a troll or doesn't follow the market at all, which is fine. But maybe a market that doesn't have that many panics is a good thing?", "score": 1, "replies": [{"body": "Quite a few trolls have come out to play in this thread.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "spped, fear, and limit downs. ", "score": 1, "replies": [{"body": "How much speed?  How much fear and how do you measure fear?\n", "score": 1, "replies": [{"body": "i have a few indicators i use but you can just tell the speed by reading the tape, time&sales, or looking at the daily candle how we gap down and puke, gap down and puke, gap down and puke. \n\nI view fear from MOC orders as well as what i just said, when MOC orders are all sell into the, i think it was billions for the few days, that was an important indication.. on top of CNBC \"Turmoil Special\". There's no better fear than the teevee and journalists. \n\nOh, an important one comparing Friday and Monday was NYSE Rule 48 was invoked in the morning AND limit down on 3/4 major exchanges. On top of that, there are 3 tiers for halting trades, I believe it's 7%, 12%, and 20%. When SPY hits 20%, trading halts the entire day -- ppl were talking all about that. \n\ne.g. of fear here looking at the VIX where it is absolutely blowing through 2 standard deviation http://i.imgur.com/HVdQ3uU.png\n\nIf the market grinded on the 2nd std dev, i would have been fine if we kept going down and it wouldn't have really been a panic b/c it's within normalization or at least near it. but when we blew through 2nd std dev and went to 5 std dev, showing every fund was piling in for protection, that's what i consider as fear b/c that's a HUGE outlier. ", "score": 1, "replies": [{"body": "lol", "score": 1, "replies": []}, {"body": "Using your method, how often do you see panics in the market?\n", "score": 1, "replies": [{"body": "i think i get a small one once a month or once every two months. this time was different, it was like a rug pull and i don't think a lot of ppl were ready for it; that's why i think they hedged their positions by jamming up the VIX.\n\nEven the SPY had a huge spread, $0.30-$0.70 spreads as I was watching it go down. MM didn't even want to be there it seemed like. ", "score": 1, "replies": [{"body": "If you get one once a month or two, I would be surprised if 8/24 show up on your radar but 8/21 didn't.\n", "score": 1, "replies": [{"body": "8/21 showed up, it just wasn't that bad. definitely an oversold signal, but no confirmation yet. then it doubles from 6.728998442 to 13.81998583 within a day. \n\nhttp://i.imgur.com/sy2Lzqm.png", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "lol you serious?", "score": 1, "replies": [{"body": "Why?\n", "score": 1, "replies": [{"body": "http://www.valuewalk.com/2015/08/etf-flash-crash/", "score": 1, "replies": []}]}]}]}, {"body": "you haven't seen panic yet, panic is when the vix closes 5 days in a row above 60 or 70, it is coming", "score": 1, "replies": []}, {"body": "Stop doing daytrading and work like a normal person. It's not productive to society and only exacerbates economic inequality.", "score": -22, "replies": [{"body": "lol", "score": 10, "replies": [{"body": "Haha very funny, we let greedy pigs ruin everything for everyone lol. so uplifting", "score": -6, "replies": [{"body": "losses come as easy as profits my friend", "score": 3, "replies": []}, {"body": "If you had the opportunity you'd do it.", "score": 2, "replies": [{"body": "No, I would not.", "score": -3, "replies": [{"body": "What if you were doing it for a flat salary in a way that made the profits all go to someone sympathetic -- like....I don't know, retired teachers or something? \n\n(edit: I work in a role that might seem similar to the job of the person in this article -- but my job is to help make sure the investments we make on behalf of my state's teacher pension fund are profitable. People like me help ordinary teachers harvest the same sources of capital profit the 1% and .01% do.) \n", "score": 3, "replies": [{"body": "I'd use it to buy lobbyists to take money out of politics and tax the rich.", "score": -1, "replies": [{"body": "Right -- noble goal -- I was just setting that up to say, we employ people who do a lot of this kind of thing on behalf of the teachers in my state. ", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "he makes over 6 figs, no point in doing slave work. ", "score": 3, "replies": [{"body": "Others are being exploited like slaves just so he can make 6 figures with a machine calculating his odds in a broken stock market.\n\nPRODUCE SOMETHING, you lazy greed hippies. If you don't produce anything more than what workers do, then give all the stock money to the workers, they deserve it more than you.", "score": -7, "replies": [{"body": "> Others are being exploited like slaves\n\nThey're being offered something for their work, and taking the offer. I guess they have to work *somewhere* doing *something*. But if you call that being exploited, then\n\n> he can make 6 figures with a machine calculating his odds\n\nhe's being exploited the same way. Maybe a more lucrative way -- society is paying more for his contribution -- but it's fundamentally the same thing.\n\n> PRODUCE SOMETHING, you lazy greed hippies.\n\ndo you just not understand the function a healthy financial system is *supposed* to serve? It's very plausible that improving society's accuracy in determining whether to buy a machine for Tesla (or Ford instead) to use could add more value than one more worker on the assembly line. \n\nThat's what capital markets are for: allocating resources (like factory machines) to the place where they add the most value. In order to get that, they use the profit expenses to exploit traders' and investor's greed to make their information useful. Do they do that job perfectly? No. Could some kinds of reforms enable it to be done better? Depends on what kinds, but sure. But the alternative to having functioning capital markets based on exploiting traders' greed is having a central planning office employ at least as many smart people to do basically the same function -- which has never been done before even sort-of-successfully, and there's no good reason to think a system like that would do a better job.", "score": 3, "replies": []}, {"body": "I do produce something. I provide liquidity to the market when others are not willing to.  I and others like me played a role in stabilizing the market and preventing it from going lower during the crash on monday", "score": 1, "replies": [{"body": "> I provide liquidity to the market\n\nDon't tell me - go tell that bullshit to starving families, you monster.", "score": -3, "replies": [{"body": "capitalism is a bitch.", "score": 1, "replies": [{"body": "Stop using it to ruin others.\n\nYou know who provides even more liquidity? Middle class consumers. Invest in them instead.", "score": 0, "replies": [{"body": "and just how did I ruin others?", "score": 2, "replies": [{"body": "Invest in poor and middle class consumers - they make better use of the money than your disgusting and destructive daytrading.", "score": -1, "replies": [{"body": "awww, you looking for a handout?", "score": 2, "replies": [{"body": "Only $300 million, so I can be on a level playing field with Donald Trump when he was born.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "> work like a normal person\n\nthis is work, work some very normal people do\n\n>It's not productive to society \n\nyes, it is\n\n> exacerbates economic inequality.\n\n...are you talking about him making more money than the median? Because that happens when someone does *anything* lucrative.\n\nOr do you have some other hair-brained mechanism in mind for how this kind of thing makes inequality worse in a broader sense?", "score": 3, "replies": [{"body": "Legitimate question: How does day trading contribute to society?", "score": 4, "replies": [{"body": "By taking advantage of temporary inefficiencies in asset pricing, day traders reduce them. Less pricing inefficiency helps keep capital allocated where it's most useful. It can seem superfluous when we're talking about shares that are trading in the secondary market (and thus not directly going to the company that issued them) but the fact that there is and in particular still *will be* a mostly-efficient secondary market is a big part of what allows companies to issue equity shares or debt to raise capital to do productive things in the first place. ", "score": 4, "replies": [{"body": "spot on ^^", "score": 3, "replies": []}, {"body": "Thanks, that's a really interesting way to look at it", "score": 3, "replies": []}]}, {"body": "say you are a farmer. You grow for and make money selling it to food companies. But expenses fluctuate. The price of inputs and equipment change. World demand for corn can change. Even government subsidies can change. This all will reflecting the price you can sell your goods. Well, to mitigate that risk, you enter the futures market and hedge your price risk. All resource companies need markets for this exact purpose like gold miners, Alcoa , apple, Cargill, Kraft, coca cola, etc", "score": 2, "replies": [{"body": "Can I get a little bit more explanation? Having trouble following your scenario/making the connections.", "score": 1, "replies": [{"body": "[Take a look at this investopedia link. It has a good explaination of how futures contracts can be used to mitigate risk and uncertainty in the markets.](http://www.investopedia.com/ask/answers/06/futureshedge.asp)\n\n\nEssentially, it's like buying price insurance (assurance?). If you're a farmer selling potatoes and you have reason to believe that prices of potatoes will decrease next year (bountiful harvests, decreasing demand, etc.) you can pay a premium (like an insurance premium) to essentially lock in today's price.\n\n\nNow think about it in this context: In late November, 2014, OPEC (ahem Saudi Arabia, ahem) decided to keep producing large quantities of oil, most likely to try to reduce prices and make American fracking companies (its competitors) go out of business to retain market share. Realizing oil prices will go down, plenty of these American companies fought back with derivatives by locking in higher prices and being able to hang on for so long. These types of contracts help economies become more stable by harnessing the great force of supply and demand.", "score": 2, "replies": [{"body": "Awesome I'll take a look at the link", "score": 2, "replies": []}]}]}, {"body": "So an artist, like an independent musician, can enter the futures market and hedge price risk? Through daytrading?", "score": 0, "replies": [{"body": "No. There's no futures market for songs. Although songs are easily reproduce these days, the original concept is unique. How can you fairly put a price on two different songs? Where as one share of stock is very much the same as another share. One barrel of oil is the same as another barrel of oil.", "score": 1, "replies": []}, {"body": "the commodity markets are not for hedging price risk in the world of art. price management does not apply to an artist, really.  ", "score": 1, "replies": []}]}]}, {"body": "I was on the other side of the flash crash, buying everything I could, providing liquidity and preventing it from going lower. Without traders like us, the effects of Monday would have been a lot worse. ", "score": 1, "replies": []}]}]}, {"body": "Well excuse me, princess.", "score": 2, "replies": []}]}]}
