{"title": "Apple drops out of talks to join OpenAI investment round, WSJ reports", "selftext": "", "id": "1frdn7i", "created_utc": 1727528030.0, "score": 96, "upvote_ratio": 0.98, "num_comments": 61, "comments": [{"body": "Apple rather bet on AR headsets that’s $3.5k, and a scrapped car project, and flopping Apple TV+", "score": 23, "replies": [{"body": "Yeah thats true. Now that you said it, they have quite a lot of blunders in the past 5 years.", "score": 11, "replies": []}, {"body": "maybe if you read the article, you would realize that every single technical founder and key kechnical leads have left OAI. The only founder remaining is Sam, who's not technical.  Now why the fuck did they all abandon ship preIPO? Why the fuck did they decide to create their own AI startups when this one hasn't even IPO'd.  \n\nImagine Google losing Larry and Serge and was left with founder #3, the marketing/fundraiser guy..before their IPO. \n\nBut sure, make your snarky comments because you know better than AAPL after their due diligence.", "score": 1, "replies": [{"body": "I guarantee that Apple wishes they had invested in OpenAI like Microsoft did initially. \n\nGood thing they scrapped Project Titan (Apple Car) after 10 years of r&d", "score": 1, "replies": []}]}, {"body": "Open ai is going for profit why would they throw their money away lol \n\nWait for the transition and then invest. Msft getting shafted", "score": -2, "replies": []}]}, {"body": "Altman is slimey", "score": 16, "replies": [{"body": "Yea he is , that’s all I interpreted from it. Nvidia and apple will prolly be wit for open ai to turn for profit before loading the truck.", "score": 6, "replies": []}, {"body": "Elon slimier", "score": 5, "replies": [{"body": "Nah elon is not good at hiding his right wing bullshit", "score": 2, "replies": [{"body": "Elon is also a Pedo Guy", "score": 6, "replies": [{"body": "what? how?", "score": 3, "replies": [{"body": "It doesn't matter if it's true. Just like how Elon accused the diver guy of being a Pedo Guy", "score": 4, "replies": [{"body": "oh so left wingers have now become as immature as right wingers\n\ngot it", "score": 5, "replies": [{"body": "Sometimes you gotta fight fire with fire", "score": 5, "replies": [{"body": "Can you fight Elon's billions with your billions, or nah?", "score": 1, "replies": []}]}, {"body": "We live in an incredibly polarized society, everyone’s always stooping to another level, this is just a prime example of our demise, and Yuri Beznemov was right. We’re distracted as a nation that people are going to be, people lol", "score": 1, "replies": []}, {"body": "Left wing means immature (pre-adult).", "score": 0, "replies": []}]}]}, {"body": "[https://www.reddit.com/r/Fauxmoi/comments/12yc7q3/elon\\_musk\\_accidentally\\_revealed\\_his\\_alt\\_account/](https://www.reddit.com/r/Fauxmoi/comments/12yc7q3/elon_musk_accidentally_revealed_his_alt_account/)", "score": 1, "replies": []}]}, {"body": "Pedo asshole", "score": -2, "replies": []}]}, {"body": "Lol no he is not. That's how we know about it", "score": 1, "replies": [{"body": "that... is what they said....", "score": 1, "replies": []}]}, {"body": "He's completely open about his right-wing tendencies, he's not trying to hide it.", "score": 0, "replies": [{"body": "Yah he's not slimy like Sama. He's upfront right wing crazy let it all hang out", "score": -2, "replies": []}]}]}]}, {"body": "So is apple", "score": 1, "replies": []}]}, {"body": "Does Apple know something about AI that others don't? Or are they considering alternatives?", "score": 10, "replies": [{"body": "Just a guess.  Apple is a control freak with a my-way-or-the-highway kind of attitude.  They probably saw they weren’t to get their way with their investment.  With them, it’s control, not collaboration.  OpenAI likely said thanks, but no thanks.", "score": 15, "replies": [{"body": "This makes the most sense considering how they control their App Store.", "score": 3, "replies": []}]}, {"body": "Maybe they’re seeing a disaster internally. All the departures is concerning.", "score": 5, "replies": [{"body": "Could you elaborate? What departures? Any sources?", "score": 5, "replies": [{"body": "About 5 senior executives recently resigned from openAI - in very key areas. Not a good look for Altman. Sounds like a lot of  infighting and stress happening there.", "score": 10, "replies": [{"body": "👆", "score": 2, "replies": []}, {"body": "Found the news. Thanks.  \nhttps://apnews.com/article/openai-mira-murati-quits-df75217584696b442935dbccc9b0347d", "score": 2, "replies": []}]}]}]}, {"body": "OpenAI just went from non profit to profit. It’s a bit unethical to do that I’d imagine it’s for PR reasons", "score": 5, "replies": [{"body": "find me the article where it says they have actually transitioned.\n\nAll I read was the board discussed it but no decisions were made.", "score": 1, "replies": [{"body": "You’re right. They haven’t transitioned yet. But they’ve announced they’re going to?\n\nNot sure what your point is.\n\nhttps://www.reuters.com/technology/artificial-intelligence/openai-remove-non-profit-control-give-sam-altman-equity-sources-say-2024-09-25/", "score": 2, "replies": []}]}]}, {"body": "Typical Apple, always wanting to be the best or different to charge a premium. It is harder when you are so far behind.", "score": 7, "replies": []}, {"body": "I gotchu homie…\n\nThey’re just using OpenAI until they can replace the Siri to ChatGPT integration with their own foundation model within a year. They probably wanted to invest to exert greater control over the integration during this period. This is similar to how they used Intel in Macs until they could build their own ARM-based silicon, but I expect the transition to be comparatively short. Apple always want to own & control their core tech. \n\nAll of the drama at OpenAI — so many co-founders & execs departing — doesn’t inspire confidence. Apple can easily switch out ChatGPT for some other foundation model from Google, Meta, Anthropic for a year until their model is ready, likely in time for the next major iOS release. The difference for the average consumer is negligible, since the performance of SOTA from these companies is similar. The o1 model from OpenAI is the exception but it’s not ready to scale to the 1.4B active iPhone users anyhow. And ChatGPT only has 200M daily active users, which is about 15% of daily iPhone users worldwide, so it’s actually not that critical, from a branding standpoint, for Apple to control that relationship. I still expect Siri and their Spotlight search will handle the bulk of users queries, so kicking out to ChatGPT is actually probably a bit of a long tail use case.\n\nOnce Apple is ready to release their own foundation model, they’ll integrate it more deeply within iOS in a way that they would not do with a 3rd party model (that they don’t own & control). We should start to see this in iOS 19. The current Apple Intelligence integration in iOS 18 is pretty weak, so I bet Apple execs are putting a ton of pressure on the internal teams to get their model ready and make their offering compelling enough to actually drive iPhone upgrades in volume.", "score": 4, "replies": []}, {"body": "Apple's version of ai is controlled and censored.\n\nOpenAI is supposed to not be censored.", "score": 1, "replies": []}]}, {"body": "Apple takes privacy seriously and is the adult in the room. OpenAI is probably far too Wild West for them with huge emphasis on speed and maintaining their lead, despite security risks, etc, and with so many big boys lapping at their heels investing huge sums to secure their own leading positions with their own LLMs - xai, Google, etc.  \n\nWe know Elon will pull out ALL the stops to beat Altman, and he has the bucks to do it.", "score": 5, "replies": [{"body": "Apple doesn't take privacy seriously, they take it seriously that they should decide who can profiting from personal data.", "score": 1, "replies": []}, {"body": "I can't believe Elon has $270 billion dollars. That's so insane I can't even comprehend it. He could buy AMD ($265B market cap) and still have billions left over.", "score": 1, "replies": [{"body": "He couldn't. He doesn't have the money. \n\nHe would have to sell all his stock in all his other companies to cash out first. Trying to cash out all this stock at once would crash the value of them all.\n\nEven if he some magical way could turn all his current net worth into cash without losing any of the value you generally have to pay like 30% premium if you want to buy it all.\n\nMost of Elon's money is very much tight up and he would have a big problem getting more than 10-20 billion in liquid assets. Still insanely wealthy, but not as crazy as you imagine.", "score": 1, "replies": [{"body": "For Elon in particular, he’d run into some major trouble if he tried to cash out more than a tiny fraction of his technical net worth. Dudes so far in debt, just leveraged out the absolute ass. Props", "score": 1, "replies": []}]}]}]}, {"body": "Makes sens, i wouldnt do business with this shady Altman guy neither what a cucklord", "score": 2, "replies": []}, {"body": "Apple is so very secretive. Who knows what they’re cooking up.  They’ll announce something when they are far enough along to know that they have something good.  As far as I know they never admitted to their self driving car initiative, but you could see their black SUVs rigged with all the self driving equipment on top driving around apple HQ and pulling into their underground parking.  So it was very obvious. Hard to hide that kind of project…. But some small gadget or ai software, or chip R&D - much easier to hide that, unless they  post the positions they’re hiring for….which gives it away.   I have faith in Apple, though I don’t own their stock. Much prefer NVDA!", "score": 2, "replies": []}, {"body": "Seems logical considering that Apple wants to use ChatGPT in their devices, so they drop out because of antitrust rules", "score": 1, "replies": []}, {"body": "Apple has to the resources to smash OpenAI. They don’t truly need to be in partnership.", "score": -3, "replies": [{"body": "False, they aren’t buying NVDA chips, they may be able to benefit from it by buying from companies like Open AI, which they are still doing, though.", "score": 4, "replies": [{"body": "You know Apple has extensive experience in semiconductors right?", "score": 0, "replies": [{"body": "Yes, and I know they are unable to compete with the likes of the top of the line chips NVDA is creating, or with its CUDA software, both of which give NVDA competitive advantages that will build on themselves.", "score": 3, "replies": []}]}]}, {"body": "Nvidia is sold out my bro", "score": 4, "replies": [{"body": "Lol, no the fuck they’re not.", "score": 1, "replies": []}]}, {"body": "Why haven’t they already then? With that logic, why don’t they do their own search as well, why use google?", "score": 3, "replies": []}, {"body": "Any signs or news that they have any product at all? Or do you think they are going to launch a competitive product without any public testing?", "score": 2, "replies": []}, {"body": "Yea they do have resources but that’s what they said about the Apple car/autonomous technology and folding phone/tablet", "score": 0, "replies": []}]}]}
{"title": "“Nvidia is overpriced” - LOL", "selftext": "You hear from so many that “NVDA is overpriced!” Disagree. Stock is up 185% over the past 12 months. Great rise. Earnings are up 415% over that same period! \n\nBy the way, look at all the other gaudy numbers, like the 55% profit margin, which dwarfs Meta’s 34% or Microsoft’s 36%.", "id": "1fr5e7b", "created_utc": 1727493896.0, "score": 72, "upvote_ratio": 0.92, "num_comments": 60, "comments": [{"body": "If not NVDA, then who?\n\nThe barrier to entry in the GPU space is very high. AMD is a player but Intel hasn't mustered an AI offering.", "score": 13, "replies": [{"body": "NVDA is the whole game right now and will be for a few years, any slowdown in innovation could open the door for AMD or Google, but that is years away. Nvidia is winning a race of one right now and doing so in a massive way.", "score": 13, "replies": []}, {"body": "AMD of course, Intel's Gaudi3 just came out with similar bf16 performance at a lower price, there are a range of startups too, but it is NVIDIA's own customers who are the big risk to them.\n\nNVIDIA could see a quarter of their market evaporate over the next few years as the hyperscalers all deploy their own chips to avoid NVIDIA's egregious markups.", "score": 4, "replies": [{"body": "Not the trend we are seeing at all, google amazon and meta are buying as much Blackwell as they can, it’s still cheaper for them to pay a huge amount for Blackwell chips because they are so efficient in their computing power.  At this point they are only making their own chips because they want more than what they can get their hands on from NVDA alone.", "score": 3, "replies": [{"body": "It is not cheaper which is why they are spending billions to design and manufacture their own AI chips. You don't go to that effort if you're getting a good deal. \n\nNVIDIA chips are not more power efficient either. Compared to some they have the advantage of using TSMC's leading edge production systems but not always. Meta's MTIA2 uses TSMC 5nm which is an advanced node. Almost the same as the 4nm process used for the H100/200. \n\nBut NVIDIA makes relatively general purpose chips compared to the bespoke chips custom designed for specific workloads. NVIDIA even still calls these parts \"GPUs\" and they contain a lot of logic which won't be used (how often do people use the JPEG decoders on an H200?). \n\nBut there's a lot more to overall efficiency than just which node your chip uses. These large companies are custom designing end to end solutions from the rack, server, chip, compiler to network stacks.  They can get much better total efficiency even if the AI chip is fabbed on a node one or even two generations behind.", "score": 1, "replies": [{"body": "Two h100s stuck together would be h100^2. Exponents. 😂🙈", "score": 2, "replies": [{"body": "Linear scaling doesn't exist.", "score": 1, "replies": []}]}, {"body": "Simply wrong lol.  The compute power advancements of Blackwell are exponential, Moore’s law is being thrown out the window by the positive feedback loop of NVDA creating an AI chip making chatbot that is an extremely effective tool at accelerating compute for the next generation.  The hump from Hopper to Blackwell is insane, and Blackwell to Rubin will be too, a trend nobody has a realistic means of keeping up with.", "score": 2, "replies": [{"body": "Nothing exponential about it. Blackwell is an iterative improvement. Basically two H100s stuck together and adding support for FP4. \n\nIt's actually only 25% faster per die at more common FP8/16 data types. \n\nPerhaps check this out if you're interested in learning about it. \n\nhttps://www.tomshardware.com/pc-components/gpus/nvidias-next-gen-ai-gpu-revealed-blackwell-b200-gpu-delivers-up-to-20-petaflops-of-compute-and-massive-improvements-over-hopper-h100", "score": 0, "replies": [{"body": "# Nvidia’s next-gen AI GPU is 4X faster than Hopper: Blackwell B200 GPU delivers up to 20 petaflops of compute and other massive improvements\n\n  \nThe dual-die B200 GPU has 4X the AI training performance and 30X the inference performance of its predecessor.\n\n  \nLiterally the first two sentences at the top of the article summarizing the main takeaways.", "score": 2, "replies": [{"body": "Read beyond that. Details matter. It's only 4x when you _halve precision_.", "score": 0, "replies": [{"body": "No, it’s actually 5x when you halve precision, and because that covers most processes along with the ability to adjust workflows and level of precision, is 4x, it explains this in the fing article lmao", "score": 3, "replies": [{"body": "I don't know why you won't just read the article but I'll copy and paste it for you..\n\n\"That’s an interesting point that again goes back to the lack of massive improvements in density from the 4NP process node. B200 ends up with theoretically 1.25X more compute per chip with most number formats that are supported by both H100 and B200.\"\n\nThey get around that by fusing two chips together and getting a 2.5x increase in performance. However, the B200 uses 1000-1200 watts which is well above the H100's 700 TDP. So you should also account for that. \n\nI hope this finally clears things up for you. \n\nFor future reference, don't take marketing claims at face value. There are always caveats you need to unravel.", "score": 1, "replies": []}]}]}]}, {"body": "Just blatantly wrong, improvements in the system architecture dramatically improve performance, on the scale of Hopper being 4,000 TFLOPS FP8 ➡️ Blackwell 20,000  TFLOPS FP4", "score": 1, "replies": [{"body": "So actually a bit beyond exponential", "score": 1, "replies": []}, {"body": "You'll want to check the article again (and NVIDIA's own published specs) because there are many caveats which go along with the bold \"20 PFLOPS\" claim. \n\nFirst off that's FP4 and you're comparing it to FP/INT8 on Hopper. So there's goes half the figure. \n\nSecondly, you are looking at *two* Blackwell dies on a GB200 package compared to one die. There goes another half of the figure. \n\nAnd we're of course looking at *sparse* FP4 figures which helps inflate things.\n\nOh, and very importantly the GB200 module pulls around 2700 Watts and isn't compatible with the SXM form factor.\n\nYou really should be comparing the H100/200 to the HGX B100/200 as this is the Blackwell architecture based drop in replacement for H100s operating in the same \\~700 watt power budget and in an SXM form.\n\nThe B200 does 9 P(FL)OPS of FP8/INT8 (@1000 watts) while the B100 does 7 P(FL)OPS (@700 watts). A leap over the 3.9 P(FL)OPS of the H100 to be sure but that's two chips fused together.\n\nSo on a chip-for-chip basis and comparing at the same power levels we get a total performance boost of .... 79.5%\n\nThat's pretty great actually but let's not kid ourselves into thinking anybody on earth is breaking physics and getting 'exponential' gains with little to no significant change to the manufacturing process. It's about what we might expect from a year and half of development and access to the cutting edge node.\n\n\n\n- [https://www.nvidia.com/en-au/data-center/h100/](https://www.nvidia.com/en-au/data-center/h100/)\n\n- [https://www.nvidia.com/en-au/data-center/hgx/](https://www.nvidia.com/en-au/data-center/hgx/)\n\n- [https://www.anandtech.com/show/21310/nvidia-blackwell-architecture-and-b200b100-accelerators-announced-going-bigger-with-smaller-data](https://www.anandtech.com/show/21310/nvidia-blackwell-architecture-and-b200b100-accelerators-announced-going-bigger-with-smaller-data)", "score": 1, "replies": [{"body": "TLDR, read your own article.", "score": 3, "replies": []}]}]}, {"body": "Your article even says 4x improvement? Lol how stoned are you? I smoke my fair share, but sheesh", "score": 1, "replies": []}]}]}]}]}, {"body": "The really exciting bit is the rise and fall of vendors who churn through tons of hardware with their VC.", "score": 2, "replies": []}, {"body": "Yeah AMD rocks for gaming rigs\n\nBoth CPU and GPU\n\nPerhaps decentralized AI might allow them to fill the gaps and cost", "score": 2, "replies": []}]}, {"body": "I like INTC at the price. \n\nIt's not just about the best company, it's...about value...which I know everyone gets, but if I was smart, I'd have divested a bit from NVDA and put some in AMD. I did that with AVGO, but there are a lot of companies that will make a lot of money and I think it'll be easier for AMD to 3X, 4X than NVDA. \n\nNVDA is going to sit between \\~110 to \\~130 between now and Q3 earnings and even then, I don't know that guidance is going to do much as they're conservative. Q4...it'll start going up, but it's Q1-Q2 F '26 where it's going to have another huge growth...IMO. I think it goes to 185-200 by then.", "score": 2, "replies": []}, {"body": "Intel is dead ☠️", "score": 1, "replies": [{"body": "How so if they're getting interest from companies wanting to buy them out?", "score": 2, "replies": []}]}, {"body": "Intel is your grand daddy's chipmaker. Lol", "score": 1, "replies": []}]}, {"body": "NVDA will not rise until the market makers are sure that retail has been sufficiently screwed. They've turned it into a meme stock and like all the others, Hold Hold Hold. It costs us nothing to hold.\n\nNFA", "score": 14, "replies": [{"body": "Holding plays into the pump and dump.....think", "score": -2, "replies": []}]}, {"body": "MU memory is needed on each device, not just Nvidia", "score": 5, "replies": []}, {"body": "Agreed. I am tired of the dimwits on eToro posting about how Nvidia investors are pure speculators. The fundamentals show it's undervalued.", "score": 9, "replies": []}, {"body": "Half of the game is waiting for analysts to adjust their expectations..", "score": 5, "replies": []}, {"body": "By the way, if this were a bubble, the numbers would be reversed. The stock price would have gone up at a higher multiple than the EPS.", "score": 9, "replies": [{"body": "🤫🤫🤫🤫\nI wanna buy more at these prices while they last", "score": 8, "replies": [{"body": "Why didn't you buy before? It was so cheap then. If you have know about ML then it was obvious that GPUs market was going to explode (may be not at the scale we are seeing now) when Google started their deep learning work.", "score": 1, "replies": [{"body": "Lol you have no idea of how long I have been investing in this company and what my average cost basis is. Sit down kid", "score": 1, "replies": [{"body": "If you have bought it since say 2016, then why buy at this price? You should have over 100K shares before the recent surge.", "score": -1, "replies": []}]}]}]}]}, {"body": "I definitely still took out my initial investment bc we are closing in on extreme greed territory.  But hey, I’m not complaining.", "score": 4, "replies": []}, {"body": "NVDIA just needs to find a way to add internal gpus to humanoids not just the AI software running from AI data centers .helping to run other parts of the machine locally for more efficiency..then we are talking another trillion dollar market 😃🤟🚀", "score": 2, "replies": []}, {"body": "AMD doesn't want to compete vs Nvidia on their high end stuff.  Intel is in shambles.  Nvidia has about 80 percent of the market in terms of AI hardware.  CEOs are begging them for the first taste of their Blackwell platform.  I'd say they are considerably undervalued right now.  \n\nI really do think Nvidia should buy Intel.  It seems like a no brainer but I'm not sure that the FCC will allow that.  I'm not a huge fan of consolidation of corporations but in terms of a selfish standpoint, eh.........", "score": 2, "replies": []}, {"body": "Overpriced. It is not a software company. Study and learn", "score": 2, "replies": [{"body": "Thanks for chiming in. It kind of IS a software company, though, with those crazy margins and a moat that is quite wide and deep with their overall lead, the ecosystem of partners and customers and the Kuda software, making it more than your typical hardware that is commoditized. THIS is the new platform for computing. It is sort of like getting the IBM PC and Microsoft in one, circa 1987.", "score": 1, "replies": []}]}, {"body": "Hedge funds pump and dump...rape the retailer (now using reddit and bots to hype up stock a retail tactic) JUST SAYING!", "score": 2, "replies": [{"body": "yeah this reads like bot post …. definitely trying to screw retail", "score": 1, "replies": []}]}, {"body": "What am I looking at here and why are these numbers important", "score": 1, "replies": [{"body": "The stock price grew by 185%. The underlying earnings per share grew by 415%. If the stock P/E ratio had remained the same, the price would also have gone up 415%.", "score": 1, "replies": []}]}, {"body": "Hard to stay on top", "score": 1, "replies": []}, {"body": "They will adjust pricing when needed", "score": 1, "replies": []}, {"body": "Never had luck with amd.  Seems I always enter  position at wrong point.  I’ll stick w the big boys for now", "score": 1, "replies": []}, {"body": "Maybe you’re new to investing. What determines if something is overpriced is the P/E ratio. At a P/E of around 30, it is considered overpriced.", "score": 1, "replies": []}, {"body": "Nvidia $200", "score": 1, "replies": [{"body": "$300", "score": 1, "replies": []}]}, {"body": "Yeah I totally agree, and then when you consider, it would be more than justified if it were overpriced, and it's kind of weird it isn't, considering it has an unprecedent prospect of growth, almost certain to occur.", "score": 1, "replies": []}, {"body": "Nvidia does 1.21 petaflops at 88 mph.", "score": 1, "replies": []}, {"body": "This whole \"underpriced\" or \"overpriced\" nonsense is just a guess. What technicals are these claims based on? Sure, if it gets too far away from a bullish or bearish EMA or something, it will correct at some point. I look at technicals and not value to determine where to go long or short. It's not like where you go around and look at cookware and say, \"Man, that's an overpriced pot.\"", "score": 0, "replies": []}, {"body": "Palantir next nvidia ?", "score": 0, "replies": [{"body": "nope.", "score": 2, "replies": []}]}, {"body": "You can not replace nvidia, you can diversify by adding MU, PLTR, AMD but nvidia is the AI king currently with a long road ahead for the others to catch up", "score": -1, "replies": []}]}
{"title": "AI Plays: NVD, AMD, GOOGL + a Couple Broader Questions", "selftext": "What’s up people,\n\nHope everyone is good. Posting this in hopes of getting some discussion about AI and possible investments going.\n\nFor context, with all the talk about AI going on, I've been trying to learn what I can about it. I don’t have any relevant background or expertise, but I’ve increasingly felt compelled to learn about it so I'm at least not totally ignorant. At this point, I’ve mostly been watching YouTube interviews of Altman/Zuckerberg/Gates types, along with lectures that Stanford makes available.\n\nIn the midst of this, I watched two videos in which separate AI researchers mentioned a [2019 blog post titled “The Bitter Lesson.”](http://www.incompleteideas.net/IncIdeas/BitterLesson.html) Apparently, this blog post was written by a computer scientist and is really influential in the field. One of the main takeaways, as I understand it, is that all that really matters for improving AI is providing more computing power.\n\nGiven how much the tech community seems to believe this, I decided to make a few plays in the space, buying literally just a few shares of NVDA, AMD, and GOOGL earlier this week. NVDA and GOOGL are obviously some of the biggest names in the space, albeit in different aspects. I took a chance on AMD, even though people seem to say their tech isn't as good, just because I still feel like it could rise with the rest of the field as long as people keep thinking AI is the future.\n\nTo be candid, I’m cynical about about how AI will be used and, more broadly, I don’t really think this is a great time to just now be getting into the market- from my perspective, it still seems like a lot of people are burnt out from work/life, and the companies that are making more money seem to be doing so largely by raising prices. I’m not sure how sustainable it all is without some sort of correction. Still, I wanted to get a little skin in the game so that I’m motivated to keep learning.\n\nIf anyone finds any of this worth talking about, I have two ongoing questions at this point:\n\n1)    What really excites people in the field about generative AI/large language models from a technological/computer science perspective? For example, when blockchain was blowing up, I heard it said that Blockchain was exciting because it made it possible to transfer a digital file such that the original sender no longer possessed the file after sending. Regardless of my personal opinions on the technology, that explanation at least made sense to me, and I could imagine possible applications and why people might be excited. What is it about AI that likewise has tech experts so excited really? What specifically does it allow them to do that they could never do before, and why is that valuable?\n\n2)    Outside of the people running tech companies, who is really positioned to benefit from AI? In nearly every video I see of Sam Altman talking, he says something like, “I believe AI will have a positive net benefit on society overall.” I wonder, though, how he would measure this. It seems to me like AI will help any company or user that can leverage it to make money, but could end up harming a lot of employees and end consumers. I feel like it could just accelerate trends of companies extracting more and more money from the rest of the population. I'm really not trying to make this political or turn it into a debate on capitalism. That’s just my honest gut feeling about it from an economic perspective at this point. I see it providing a lot of benefit to a relatively small segment of the population.\n\nWould be interested to hear what other people think and if/how you are investing in the space. I'd even like to know if people here actually use AI in their personal lives. And if anyone has resources that they feel have helped deepen their knowledge about AI, I’d really appreciate you sharing. I feel like I’ve kind of hit a wall trying to get beyond surface-level discussions about the field.\n\nCheers.", "id": "1frpnji", "created_utc": 1727561903.0, "score": 65, "upvote_ratio": 0.87, "num_comments": 69, "comments": [{"body": "Here is an [old post](https://www.reddit.com/r/StockMarket/comments/13xempk/some_ai_apps_by_category/?utm_source=share&utm_medium=web2x&context=3) that may help with a visual presentation.\n\nFor me, the hardware will become commoditized but the question is when - I personally suspect in 5 years.\n\nIn my opinion, the generational winners will be companies with the largest datasets will prevail - GOOG=BIDU > APPL> AMZN=BABA > MSFT=META but there will also be industry specific players (like healthcare, i.e., drug discovery , possibly UNH or research hospital like MSK or Duke Univ), defense maybe PLTR, travel = BKNG, retail (specifically grocery) - any large chains with loyalty programs (they know a lot about you and your preference) or TSLA has more driving data, particularly for autonomous driving AI.\n\nI would also not rule out Bloomberg as they have immense financial data set and how companies interrelate. I suspect they are already using it and being private do not publicize it, like APPL (who prefer to use the term Large Language Modeling)\n\nMSFT except for OFFICE has been a follower or acquirer; they were way behind on AI and is the reason the partner with OpenAI and did better PR.\n\nI will stick with Google.\n\nI personally also suspect that APPL (I know they partner with OpenAI for the consumer front, but believe they have internal products) and AMZN have better AI tech as it is captive and will never be in the open market for competitive reasons.\n\nThere was a good new release of data is king and those that can exploit data will win. Isomorphic Labs partnering with LLY and NVS on drug discovery. If you can shorten drug discovery time and extend protection - it is a big win.", "score": 11, "replies": [{"body": "Thanks, appreciate all this🙌🏽", "score": 2, "replies": []}]}, {"body": "I would throw ANET into the AI bucket", "score": 11, "replies": []}, {"body": "GOOG just seems like an obvious buy. It's priced low right now and they're throwing a lot of money at AI infrastructure. Even if they don't use it directly the can lease out the ML servers in the new data centers they're building.  NVDA is great but GOOG covers so many different area whereas NVDA and amd just make chips. \n\nDisclaimer- I own all 3", "score": 23, "replies": [{"body": "What about the possible break up of Google? Isn’t that a risk factor?", "score": 2, "replies": [{"body": "Personally I don't think its risky if that were to ever happen. What would they do, break out YouTube and the Data Centers? Break off Android to its own company? Separate pixels into their own phone manufacturer? Make Waymo its own thing again? Sure give me shares of youtube. I'd be happy to own any of GOOGs products if GOOG was to be split up.", "score": 7, "replies": [{"body": "So, you are saying even if the company breaks up, owning the underlying businesses makes sense either way.", "score": 5, "replies": [{"body": "Correct sir, that's my opinion.", "score": 5, "replies": [{"body": "Got it. Makes sense.", "score": 1, "replies": [{"body": "Just for context, Google has many products with over a billion users\n\n*Gmail: The most popular email provider in the world \n \n*Google Drive: Reached one billion users in July or August 2018 \n \n*Google Photos: Joined the billion-user club in July 2019 \n \n*Google Play Store: Reached one billion users in September 2015 \n \n*Android: Has over 3 billion active devices \n \n*Chrome: Has over 2.65 billion users \n \n*YouTube: Has over 2.1 billion users \n \n*Google Search: Has over 3.6 billion users", "score": 5, "replies": [{"body": "Nice list you have there, brother...", "score": 3, "replies": []}]}]}]}]}, {"body": "Those individual blocks are worth a lot less if they’re not part of the Google ecosystem.\n\nThey won’t be able to share data. A big drawback for marketing and AI.\n\nThey won’t have the user convenience factor of linking to your other accounts.\n\nThey won’t be able to nudge users of one app to use the others.", "score": 2, "replies": []}]}, {"body": "If it breaks up, the stock will probably go up too.", "score": 6, "replies": []}]}, {"body": "Google is wasting a lot more money than they are spending efficiently. They're a company in decline and the market has known it for some time. All their products become worse over time and their AI efforts have been a disaster so far.", "score": -2, "replies": [{"body": "That's just like, your opinion. Personally I've been holding since $69 and it's worked out well. Their AI efforts have not been a disaster. \nHave you tried Google Lens? It's fantastic. That's just one example.", "score": 4, "replies": [{"body": "Lens is great, but I'm sure it'll get worse over time like all their other products. Also, I wasn't saying it wasn't a good investment in the past, I'm not even saying it won't be a good investment in the future, but the company is clearly in decline, heavily bloated by woke ideologies and at a serious risk of having their search business disrupted because they're making a mess of Gemini.", "score": -4, "replies": [{"body": "> woke\n\n\nAlways worth reading the follow up comment. They can't help but show their bias. It's like a 3 paragraph limit for this type before their cranial diarrhea acts up.", "score": 4, "replies": [{"body": "Not sure this is what you're trying to say, but are you seriously arguing that woke ideologies haven't been a huge negative on many companies' efficiency/profitability on a sub about business and stocks?", "score": -1, "replies": [{"body": "🤡 ", "score": 1, "replies": []}]}]}, {"body": "WOKE MIND VIRUS", "score": 2, "replies": [{"body": "Exactly, although that's only part of Google's issue imo.", "score": 1, "replies": []}]}]}]}, {"body": "Thinking one of the top AI companies in the world is in decline, is peak, even on this sub.", "score": 1, "replies": [{"body": "Thinking a company would be valued so cheaply for no reason is peak, even on this sub.", "score": -1, "replies": [{"body": "Yes because of course the market is never wrong.\n\n\nLike when $META was trading at 10x in 2022.", "score": 1, "replies": [{"body": "Meta was valued fairly at the time but made a dramatic shift that changed its course. Google has not made any such switch. Also, I'm not saying the market isn't wrong by some margin, but it's clear that Google has massive issues and the market agrees. It's not cheap for no reason.", "score": 1, "replies": []}]}, {"body": "It’s valued cheaply due to anti trust concerns not whatever nonsense you claim it is. Google is printing money rn and will continue to do so.", "score": 1, "replies": [{"body": "It's been valued cheaply for at least 3 years, well before anti-trust was a serious concern.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Just track QQQM and you’ll get exposure to all the big AI plays", "score": 22, "replies": [{"body": "I think people make these threads because they want to get into the next big AI plays that arent Mag 7, ETFs, and index funds  early. Such as buying PLTR at $7. The issue with this is PLTR at $7 was regularly downvoted on this sub in these type of forward looking threads. You would be called a bagholder for saying positive things about it back when it was $7. \n\nThe second part is lets say you went against the downvotes and negativity find something at the bottom of these threads. Many people sell it as soon as they get a 30-100% gain. To continue with a PLTR example a lot of people sold when it was $10-15.", "score": 31, "replies": [{"body": "People are saying same for Space plays like ASTS and RKLB. \n\nI do not care making a swing trade of a few thousand bucks. I don’t see the point of this subreddit if all they suggest is ETFs. Most people here already know that lol.", "score": 14, "replies": [{"body": "Same with meta when it dropped to 100, Reddit acted like it was a failing business", "score": 12, "replies": [{"body": "Of course you went with META. This sub gets boring with how Mag 7 heavy the discussion is.\n\nNot hating Mag 7 it just there are hundreds of stocks in the market. I remember when CAVA dipped 40% after its IPO and it was $30 wondering if it really was a failing business that was going to zero. It has since gone up 300%. I hope to hear more stuff like that but I know Mag 7 and ETFs is what this sub tends to have upvoted to the top of most threads.", "score": 4, "replies": []}]}, {"body": "Cause majority of people lose money investing on specific stocks. We get burned and become bitter", "score": 4, "replies": [{"body": "Yeah there is a risk with individual stocks. If people don’t like that invest in broad market ETFs. I do that for my retirement portfolio as well. \n\nBut here we want to find next 5-10x baggers. Take some risk, I’m fine losing money on stocks like RKLB or PLTR. They won’t my change my life it goes to zero. But they could change my life if they go to 100 or more.", "score": 4, "replies": []}]}]}]}, {"body": "If OP wanted to do that, he wouldn't be on /r/stocks but /r/ETFs.", "score": 3, "replies": []}]}, {"body": "AI is a massive field. One interesting play is focusing on manufacturing since demand will likely be higher than supply for the foreseeable future. The companies that have advanced manufacturing (ASML semiconductor manufacturing) are primarily TSMC, Samsung (not traded in the US), Intel, and Micron (at a smaller scale). I have invested heavily in Intel and Micron since I think the US and Europe want western manufacturers they have more control over. \n\nAnother play is arm based processors, with the focus these days being Arm and Qualcomm, I'm invested in both.\n\nI'm also invested in Nvidia, Amd, and a couple smaller chip companies which are less related like Marvell and TSEM. I am quite bullish in general on semiconductors but you have to know when to buy and what. The less risky option is going for an ETF like SOXX.", "score": 5, "replies": []}, {"body": "NVDA is selling chips to Amazon, Google, Azure and also uses these cloud services. They now have them as customers and they also use their own chips sold to these cloud providers as consumers. Both get to claim AI hype is real and real world use cases. \n\n\n\nBesides this evey other production use case is around text generation and struggles with hallucinations, RAG for everything and struggle with long context or long conversations, synthetic data for many things but making sure there is no biases so essentially doing ML but now with expensive hardware with similar outcomes. These are qualified use cases and some more in call center, automated responses which can take advantage of NLP but only big tech companies can spend billions to make no money and still enjoy returns in form of marketcap rise due to hype. GenAI os as good and will stay as has blockchain. Only picks and shovel selling is profitable right now. It's an early innings but market cap for these semiconductor companies is unsustainable. NVDA especially is at risk of massive correction and maybe so many engineers have taken a break or left and sold their stocks to enjoy their time. Insider trading also shows everyone is selling and taking advantage of this high valuation with 10x jump in 2yrs. \n\n  \nTech is evolving but market cap for these picks and shovels company is crazy. So is it for AMD who is miserable behind on software stack that can support Training and doesn't scale too well for inference plus they have very low supply to  make any gains in market share. No one wants AMD and if NVDA hardware gets cheaper they will get another reason to not use AMD.", "score": 7, "replies": []}, {"body": "Google. Theyre going to win in the long run", "score": 8, "replies": [{"body": "Absolutely, and at 22 PE, it's a steal. Original questions, however, are probably not for this forum (which has more investment angle). \n\n\n > What specifically does A.I. allow them to do that they could never do before, and why is that valuable? Who is really positioned to benefit from AI?\n\n\nIt's easy to \"write off\" the utility of Gen-A.I. seeing that an average user can just use it to create cat pictures or short videos. But there're seriously cool applications of A.I. + multimedia in the entertainment industry.  \n\n\nAlso, LLMs are a generic umbrella technology covering specific A.I. algorithms. For example, your city's garbage recycling probably already uses A.I. to separate different plastics, with cameras and other types of physical sensors feeding an A.I. algorithm.  \n\n\n And, of course, most \"talked about\" application is self driving cars and trucks. If you want to see something cool right now, try Google photos app. Ask it to \"remove crowd\" from a picture taken at Eiffel tower. It works!", "score": 3, "replies": []}]}, {"body": "I think you might be a bit too focused on LLMs, not AI in general. LLMs are cool, but they're very expensive and might end up being a race to the bottom. There are other parts of AI that are likely to see much higher profits. I'd recommend diving deeper into AI products by companies like Palantir and Tesla.", "score": 3, "replies": []}, {"body": "AI bubble \"crashes\" when the imagination falls behind direction/training.  What I mean is right now everyone is chasing a LLM, but once they are all pretty good, what then?  That then requires something new, a new idea, and then starting back over at the beginning which will take a few years.  In that interim AI craze will dimish (not crash).", "score": 5, "replies": []}, {"body": "Missing out on META. Palantir has great AI potential. Start following smaller AI verticals (saas) coming out of the LLMs some already have massive valuations keeps tabs on those and which ones you see having a future and when they go public invest and rest.", "score": 2, "replies": []}, {"body": "November 2021 vibes", "score": 3, "replies": []}, {"body": "You are very late to the party son", "score": 2, "replies": [{"body": "Fashionably late, or there’s puke on the floor late", "score": 2, "replies": [{"body": "Everyone has already hooked up. There are some drinks and chips left so all is not lost. In a few hours, some people will puke yes, some will be ok and some will be somewhere in between with a little or big hangover", "score": 2, "replies": []}]}]}, {"body": "One gets more diversification and support from top 50 Nasdaq. I agree in 2024 these magnificant 7 had a huge gain. I small one has to wait for the next opportunity for the next hype.   Too late if one gets started.", "score": 1, "replies": []}, {"body": "Just buy into FSELX or SMA - heavy. People will tell you to stay in an S&P tracking index, and that’s safe, but i think it’s worth the so-called risk for the massive returns these indexes offer.  And I love the idea that I dont have to pick the stocks (or when to sell them), rather,let the people who spend all their time thinking about this stuff - and controlling large influential amounts of capital- make that decision for you.", "score": 1, "replies": []}, {"body": "To see the value of AI, just literally go to the ChatGPT website and ask your questions.", "score": 0, "replies": []}, {"body": "GOOGL has had back to back flops on AI. Was caught asleep at the wheel and has chatGPT eating their lunch.\n\nThey lost on AI and are only being propped up by the rest of their monopoly. I bought dips on each Gemini flop and cashed out at 168. It's laughable to call them an AI company when Gemini performs worse than Grok\n\nIf you want to make money on AI you need to follow the money, datacenters, the components in the server racks, fiber cable to connect centers. Nuclear to power them...\n\nOr you can look at companies selling AI solutions for enterprise data.\n\nMy picks? NVDA, APLD, LUMN, MU, SOUN, PLTR, META, AMD, AI, SMR\n\nbought a lot last year and on the dip this summer. I am sitting pretty high and dry, comfortably in the green.", "score": -13, "replies": [{"body": "Tbh a lot of these you listed is captured under SOXX ETF. If you wanted to go long, SOXX might be a good play.\n\nI’ve been rolling with SOXL/TQQQ and made a few plays last month. Up ~10% in the past month. Probably more if I went full in SOXL but wanted TQQQ for a little exposure to the rest of the market.", "score": 4, "replies": [{"body": "SOXL is the way.", "score": 2, "replies": []}]}, {"body": "Appreciate the comment🙌🏽thanks for the other recs", "score": 2, "replies": []}, {"body": "Downvoters show yourself lol 😂😂", "score": 2, "replies": []}, {"body": "I still think NVDA will continue to do well and it will be hard to overtake them. AMD is the closest but even then, they are really far from NVDA", "score": 3, "replies": [{"body": "Yeah I edited my post I have a lot of NVDA 27$ costavg\n\nAMD is good and I prefer them over INTC", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "[removed]", "score": -2, "replies": []}]}, {"body": "Can you please name these companies.", "score": 2, "replies": [{"body": "I did", "score": 0, "replies": []}]}, {"body": "Sort of right here. I mean I use chatgpt now instead of googling it. Google would have replaced their search engine with AI by now. Companies have been integrating their AI already, even though not great. AI needs to be used to grow. Also I don't trust google and I think it's a trash company in regards to investing. I appreciate what they do  as a company and the products they decide to have faith in but it's like a talented employee that may or may not show up to work or reach a deadline or even deliver. There are less stressful companies.", "score": 1, "replies": []}]}]}
