{"title": "AMD just reset their entire GPU software stack", "selftext": "It's really too bad for them.   Background is a couple of generations back AMD decided they needed two GPU paths, one consumer, one data center with two different product lines and two different software solutions.  Fast forward to today, and they think they need to re-unify those product lines.  What that means for developers is a new future unified architecture, work that's in the past may not be compatible, and that yes, there may be \"some bumps\" sorting it all out.\n\n[https://www.tomshardware.com/pc-components/cpus/amd-announces-unified-udna-gpu-architecture-bringing-rdna-and-cdna-together-to-take-on-nvidias-cuda-ecosystem](https://www.tomshardware.com/pc-components/cpus/amd-announces-unified-udna-gpu-architecture-bringing-rdna-and-cdna-together-to-take-on-nvidias-cuda-ecosystem)\n\nThe noteworthy quote from NVDA standpoint is:\n\n\"Yes, high-end silicon can build markets, but ultimately, **software support tends to define the winners and losers. Nvidia has taught the master's class of how to build a seemingly impenetrable moat with its unparalleled proprietary CUDA ecosystem.**\n\nNvidia began laying the foundation of its empire when it started with CUDA eighteen long years ago, and perhaps one of its most fundamental advantages is signified by the 'U' in CUDA, the Compute *Unified* Device Architecture. Nvidia has but one CUDA platform for all uses, and it leverages the same underlying microarchitectures for AI, HPC, and gaming.\"\n\nIt's what many of us have known and been saying for years:  CUDA is a MOAT.   AMD has had the best shot at taking on Nvidia from a competitive merchant chip stand point.  \n\nReset the clock, this sets AMD back a bunch.", "id": "1fd0pdm", "created_utc": 1725916412.0, "score": 99, "upvote_ratio": 0.95, "num_comments": 60, "comments": [{"body": "Explain like I am 10?", "score": 13, "replies": [{"body": "AMD is going backwards, Nvidia will extend their lead through competitor's unforced error.  (nothing tradeable, imo, for all the opportunistic traders here.   I don't think this effects either companies stock price in the near term)", "score": 41, "replies": [{"body": "They're correcting a fault, they may slip some now but they've decided the slip is worth it to have a unified software stack later. It might be late, and a terrible decision to split them, but it's probably the right move.", "score": 18, "replies": [{"body": "It is the right move now vs later.  But this is just going to put them much further behind in the short term.  NVIDIA made a terrible error back in 2007 and discovered it in 2008.  Go look at the stock prices between 2008 and 2015.", "score": 1, "replies": []}]}, {"body": "Oh my god AMD might lose their 10% market share and 3% profit share in gaming GPUs", "score": 9, "replies": []}, {"body": "Backwards or stuck in the sand? Should I sell my 10 shares?", "score": 5, "replies": []}]}, {"body": "Basically it's rx 580 again while everyone on nvda playing with rtx 1080 ti super with dlss 7", "score": 3, "replies": []}, {"body": "GPUs are not all equal. Nvidia compute is sped up massively on its own GPUs, using it's cuda architecture. Cuda is also the defacto choice for gen AI programing. Nvidia has a moat larger than McDonald's and coca cola etc. In fact, it's probably the biggest moat in the history of companies.", "score": 5, "replies": [{"body": "If Radeon and Instinct were both highly successful product lines with strong market penetration, merging them might be a bad idea. But in reality they're both borderline irrelevant and now Instinct is the team that has any hope of profits.", "score": 4, "replies": []}, {"body": "General purpose GPU and CUDA is not the future of AI.. ASICs will be.", "score": 1, "replies": []}]}, {"body": "Nvdia is releasing their new card next year too. Right now is Sep and the price is low, u should stock up for the dramatic increase next Spring.", "score": 1, "replies": []}]}, {"body": "What about the video game market? How much of that is part of amd buisness? The way things are moving with Nvidia cloud gaming gpus sitting in consumers houses is slowing becoming a thing of the past. And if you use their cloud gaming service often times it uses commercial gpus not consumer models. Seems unified development is the only way moving forward in this market. Ive owned dozens of graphics cards over the last 20 yrs. My last computer doesnt have one…. I cloud game now.", "score": 5, "replies": [{"body": "It's a good point.\n\nBut I think the developers still need relevant hardware in the dev platforms.   Nvidia would rather have them default to Nvidia, and same for AMD.   And then there is the whole question of the servers that serve the cloud gaming platforms.\n\nWhat hardware is in those?   Nvidia's for the most part.  Pretty certain AMD would love to displace those too.  It just (generally) works better on the platform the title was developed on.", "score": 2, "replies": []}, {"body": "> How much of that is part of amd buisness?\n\nlol it's a rounding error. And it's even lower margin than Nvidia's gaming.", "score": 2, "replies": [{"body": "Wow", "score": 1, "replies": []}]}]}, {"body": ">Background is a couple of generations back AMD decided they needed two GPU paths, one consumer, one data center with two different product lines and two different software solutions.\n\nI wouldn't frame it like that. CDNA was basically a semi-custom offshoot of the much larger gaming division at the time, and it only sold to a handful of HPC customers in any significant quantity. Some quarters they had no sales *at all.* There was zero overlap in customers and software stack between consumer and datacenter GPUs, unlike Nvidia's broader strategy which took over not just the gaming market but also content creation, engineering and scientific workstations, enterprise and cloud ML.\n\nNow AMD is *finally* coming around to admitting their Radeon's strategy of \"off-brand GeForce but a little bit cheaper\" didn't work. New times bring new workloads. Nvidia has the industry standard platform for client/workstation AI as well as datacenter workloads. Radeon's lack of a software platform will mean there's no market for it if and when AI performance becomes a major selling point for client devices.\n\nMI300 on the other hand has had some sales success, by AMD standards. They're now making $1B revenue in datacenter GPU quarterly and with a view to increase sharply over the next several quarters. *All* of their gaming segment was $648M last quarter, and presumably at a *much* lower margin considering it includes consoles, and with an expectation to continue its decline until PS6 launch years from now, and who the hell knows what Xbox is even doing now. The roles are now completely reversed, Gaming is the inconsequential segment and AI GPUs are a new moneymaker and maybe AMD's biggest revenue source in a couple years. AMD *must* figure out a way to get a usable AI platform for their client GPUs. They think it doesn't make sense to build separate platforms for datacenter and client GPUs since it's a foregone conclusion that Radeon will fail on its own. I agree with them.\n\nIs AMD far behind Nvidia in the software ecosystem? Absolutely. Does it really matter right now for the client market? Not really. The future client-side AI killer apps are not here yet and there's no telling when it will happen. Intel, Qualcomm, AMD, maybe Mediatek/Nvidia, and yes, Apple, will all be competing in the client market when AI actually matters as a selling point. I don't see a future where developers of client apps will just say \"yeah as long as CUDA support works, we're done, not interested in supporting the other 90% of the client market.\"", "score": 4, "replies": [{"body": ">They think it doesn't make sense \\[now\\] to build separate platforms for datacenter and client GPUs\n\nThat's a fair point.  \n\nBut my counter is, is it any more relevant today than it was a couple of generations ago when they decided to fork the product line?   Maybe AMD didn't know AI was coming to PCs in (?) 2018, or whatever, but they should have anticipated it, just like we anticipate it on mobile devices.  Isn't that why they pay Lisa to sit in the big chair?\n\nI believe AMD thought it was easier to get game devs writing for RDNA with a tighter/less complex API.  Just keep the two product lines in their own lanes.   Well, lo and behold it didn't work out that way.  Now it seems like the worst of both worlds, loss of share in PC Gaming and a reset for the API just as Instinct is gaining steam.\n\nI've been on the receiving end a lot of grief when questioning AMD's GPU leadership, particularly when it comes to software, and to me this is just another example.  Nvidia is trying to build a platform.  AMD's answer was open source and effectively outsource their success to 3rd party developers.   They've spun up a number of ISVs and now they're going to lose some of them, imo because their work is potentially scrap, or will need a rewrite.\n\nI'm not trying to rain on AMD's parade here, genuinely bummed for you guys, AMD, other shareholders and the fledgling ecosystem they're trying to build.  No one benefits with effectively only one supplier.   I'm not a programmer, barely technical, but It was plain to me AMD was going to have trouble with this approach (as discussed in many conversations) -- I've always felt AMD needed to hire a GPU architect who sat above both hardware and software.   If you want to reset, reset it once and then be thoughtful about building that foundation for future products.  It just feels like they're not making ground with the community who can really shape their future, developers.", "score": 1, "replies": [{"body": "> I believe AMD thought it was easier to get game devs writing for RDNA with a tighter/less complex API.\n\nIf you're running a software shop and you have to split your resources to support two platforms - one with 90% market share and one with 10% market share - what will you choose and why? You should see immediately that it doesn't matter much how simple or complex the environment is, you're going to prioritize the one where 90% of your customers are, regardless whether it's easy or difficult.\n\nIf I had to pick one failure in Lisa Su and the rest of the leadership, it's stubbornly clinging to the belief that producing the best product for the best price will always win. RDNA2 was the first time in a decade+ that AMD actually delivered a full generation of products that was competitive from top to bottom and available for a good price, and it got them absolutely nowhere in market share because they failed to convince OEMs to get onboard. RDNA3 didn't help anything. \n\n>Now it seems like the worst of both worlds, loss of share in PC Gaming and a reset for the API just as Instinct is gaining steam.\n\nThere is no way AMD will allow Radeon to impact the progress of datacenter GPUs. That makes no sense if you think about it for 2 minutes. They say AI is the future of the company, Radeon is just a thing that has been allowed to limp along because half of their R&D costs were already sunk into consoles and bringing something to PC market felt like low hanging fruit. AMD can't feel bad about losing gaming revenue because there basically is none after you subtract out consoles. Now we're talking about new AI workloads that will need to run on clients and RDNA is almost completely unsupported. There is literally nothing of value there to lose by switching client graphics to be a downstream derivative of cutting edge datacenter GPUs.\n\n>They've spun up a number of ISVs and now they're going to lose some of them, imo because their work is potentially scrap, or will need a rewrite.\n\nAgain, sounds like you're interpreting this as a change to the ROCm/Instinct stack. Huynh isn't even responsible for that stuff.\n\n>*Jack Huynh is the senior vice president and general manager of the Computing and Graphics Business Group responsible for combining the company’s high-performance CPUs, GPUs, and software to create differentiated client, graphics, gaming, and semi-custom solutions to continue driving AMD’s growth and leadership experiences for our customers.* - from amd.com\n\nWith the limited information we have, I can't conclude anything other than Radeon development being shuffled underneath datacenter GPU development, which is something strategically important to AMD that will get real resources. I would say it's too bad for the devs who have been working on Radeon support on the PC but I don't think there are any of them that AMD isn't paying directly. If AMD wants this future \"UDNA*\" to get supported in games and Photoshop and future local LLMs and everything else, they will have to pay ISVs to do it, just like Nvidia does, just like Intel does. Then maybe OEMs will consider selling more PCs with AMD inside. Hopefully no more fantasy about selling cheaper chips with the hope that they will sell and devs will follow the market share. Nvidia always had the better business sense on this stuff and AMD is finally figuring it out after trying everything else.\n\n>I'm not trying to rain on AMD's parade here, genuinely bummed for you guys, AMD, other shareholders and the fledgling ecosystem they're trying to build.\n\nWhy? I'm just happy that there's news coming about about a future for Radeon and that it won't just be abandoned. That's better than I was expecting. There might be some value there someday but AMD will have to bring some truly unique hardware to market and not just an alternative that they quote out to OEMs who just take it to Nvidia to negotiate better pricing. The change probably means nothing for AMD's datacenter plans except maybe updating a marketing powerpoint slide.", "score": 1, "replies": []}]}]}, {"body": "Thanks much for your posts Norcalnatv. Always good technical stuff.", "score": 3, "replies": [{"body": "Thanks.  It's the interesting part to me -- how does the competition shape Nvidia's future?  -- The entire investing thesis.  ;)", "score": 1, "replies": []}]}, {"body": "I don't like this move from AMD. But for entirely different reasons. Mostly because I don't believe the consumer market has much overlap with the GP GPU market. Consumers want low power high lerformance graphics primarily (laptops sell the most gpus). And prosumers and data centers want high performance, high power, high efficiency products. In addition, there isn't a lot of overlap between data center workloads and consumer workloads. I think amd's key move they should be doing is basically making cdna architectures available to prosumers, not just data centers. I think this is a huge mistake on their part. Making a single hardware chip that can do graphics, AI and compute intensive. Workloads is a big mistake in my opinion as the needs for each one of those workloads is distinctly different and you're just going to end up with silicon that is very inefficient use of space and ends up being not particularly competitive in any single one of those areas. \n\nThe potential exception to this is actually if AMD is able to bring highly specific chiplet architectures to consumers at a reasonable price. For example, if they can break out some of the unit operations for graphics onto a separate tile that's different than the compute tile and they can piece those together. They might have something. But that seems like it would be very cost prohibitive having to use a high performance COWOS interconnect.\n\nThe biggest Miss here that I don't see Jack talking about, is the software. Jack still doesn't appear to understand why AMD isn't in a competitive space in the GPU market. This is a huge problem. He shouldn't be talking about trying to attract developer support. He should be talking about AMD building out their own support for these chips and not relying on third parties through their software work for them. It's really disappointing to see an AMD person in a leadership role not understand this.\n\nAlso, Jack doesn't understand that Halo products drive, mind share and consumer visibility. The bleeding edge doesn't necessarily drive a lot of revenue. But it sets up the mind share the consumer perspective for AMD for the other products in its stack. \n\nI'm often wrong though. So hopefully this is just another case of me being wrong again and they do very well. But I just don't see a unified architecture being valuable for AMD. What they need is to just make their architectures good. They just need a good architecture and good software support. They don't need new ones. The problem isn't that it's not unified. The problem is that is just not good enough, and they need way more software support from AMD. This talk about getting software developers to support their products is the wrong mentality.\n\nI don't think this necessarily resets. The clock against Nvidia though. But it does present new software challenges. But hopefully AMD is able to modify code and support these new gpus pretty easily.", "score": 5, "replies": [{"body": "Appreciate your views.   If the open source strategy was really successful we probably wouldn't be talking about this.\n\nAMD needs a thoughtful ISA for GPUs.  It needs to be able to scale from tiny to industrial, and yes, it needs to be well supported.  Any chip needs a set of software to run and then in order to be successful and extend your reach, you need developers to embrace and write for it.   \n\n>The bleeding edge doesn't necessarily drive a lot of revenue. But it sets up the mind share the consumer perspective for AMD for the other products in its stack.\n\nIt's also the place you introduce new features.", "score": 1, "replies": []}, {"body": "Amd need software devs to do their job and code for amd products, like they do for nvidia. You cant get that support if u have no long term market share in gaming and workstations.", "score": 1, "replies": []}]}, {"body": "Cuda is the acceleration platform where you take low-level software (kernels written in a C++ dialect) and offload it to an accelerator. The Cuda ecosystem is the full software stack: high-level frameworks/solutions to the problems you're actually interested in, like AI, are implemented here and it makes use of the low-level Cuda for you. Popular open-source solutions like PyTorch are also high-level and support multiple backends including Cuda. Cuda compiles the kernels to Nvidia's ISA which is NVPTX. The microarchitecture is the internal implementation of the ISA and is not generally accessible.\n\n99% of developers use high-level frameworks or Cuda directly. Very rarely do people use NVPTX directly. If they do, it's usually for a very small part of the software they're developing where they can't quite get Cuda to automatically generate exactly what they want.\n\nNVDA and AMD are both constantly changing their microarchitecture every generation. In this case, AMD is doing something potentially more radical than just a change. It's too early to tell how drastic though since AMD's very likely just going to continue CDNA on as UDNA and have it be slightly repurposed for client usage. Microarchitecture changes are necessary for microoptimizations and is generally unobservable because it's hidden behind the ISA that so few developers target directly anyways. It's the same for CPUs: AMD and Intel change their microarchitectures all the time yet it's still x86 and nothing breaks.\n\nMy point here is that you're largely exaggerating the impact of a change in microarchitecture. It is, however, very indicative that AMD made the wrong choice splitting the two up in the first place. The \"taking on CUDA\" claim is BS since they're very clearly just doing it to cut down costs on maintaining two microarchitectures and it wouldn't really address AMD's root problem which is that the ROCm ecosystem is several years behind.", "score": 2, "replies": [{"body": "My point is that AMD wasn't thoughtful about their GPU architecture.  Lisa is asleep at the wheel, and that will hurt with developers.  Your idea \"nothing breaks\" is quite in contrast to the lead GPU guy who says there will be \"some bumps.\"", "score": 1, "replies": [{"body": "> My point is that AMD wasn't thoughtful about their GPU architecture.\n\nThis is vague, but I do agree. I disagree that this microarchitecture merge is one of AMD's bigger problems. It certainly won't help AMD much against Nvidia either. Lastly, AMD was already going to do a big overhaul in CDNA for 2025 anyways to achieve what they claim to be is a 30x performance boost.\n\n> Lisa is asleep at the wheel, and that will hurt with developers.\n\nAgreed.\n\n> What that means for developers is a new future unified architecture, work that's in the past may not be compatible, and that yes, there may be \"some bumps\" sorting it all out.\n\nAdmittedly, this statement makes no sense to me. It shouldn't break anything. Microarchitectures aren't accessible to developers outside of the vendor. Only the ISA is visible. If the ISA changes, then it will break past user applications unless they recompile. And again, 99% of developers don't use the ISA directly; they use the acceleration platform (Cuda or ROCm) that would automatically recompile your code to the new ISA for you anyways.", "score": 2, "replies": [{"body": "sounds like we're generally in agreement.    \n\nYou can read the linked article for Jack Huynh's comments about \"some bumps\" along the way.", "score": 1, "replies": []}]}]}]}, {"body": "AMD in the end will have the better hardware though. Nvidia s monolithic chip design comes to physical boundaries and needs to brute force for more performance. \nAMDs chip let design is modular and can be easily redesigned.", "score": 3, "replies": [{"body": "You're smoking dope from 2 years ago.  \n\nHardware is one thing.  But the ENTIRE AI game is application performance.\n\nAMD just proved, with a huge theoretical hardware advantage, they can't beat Nvidia in the solution (MLPerf) H100 vs MX300.\n\nYou might want to reset your thinking.", "score": 2, "replies": []}]}, {"body": "If you don't like AMD's current GPU strategy, just wait a few years.\n\nNow here's something I hope you really enjoy...\n\n[https://www.amd.com/en/resources/product-security/bulletin/amd-sb-6010.html](https://www.amd.com/en/resources/product-security/bulletin/amd-sb-6010.html)", "score": 3, "replies": [{"body": "What is this shit — make your point directly or stfu", "score": 6, "replies": [{"body": "You know, there are plenty of decaffeinated options out there.", "score": -2, "replies": [{"body": "lol this is my decaffeinated self", "score": 3, "replies": [{"body": "Have you considered Rohypnol? Desperate times and all that...", "score": 1, "replies": [{"body": "bro why the fuck would you assume I know what that is lol", "score": 1, "replies": [{"body": "Every accusation a confession.", "score": 1, "replies": [{"body": "you seem regarded", "score": 1, "replies": [{"body": "Not even diamond hands are working for you anymore?", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Can you explain what you think the impact of the link will be?", "score": 5, "replies": [{"body": "A list of exploits lol, just that they have issues", "score": 3, "replies": []}]}]}, {"body": "But stock went up today?", "score": 1, "replies": []}, {"body": "CUDA isn’t the future for AI, ASICs will be.", "score": 1, "replies": [{"body": "I know right?   \n\nASICs, primarily asic chips developed at major CSPs:  Are developed for specific needs, all require their own specific software, all software and hardware is developed independently of other ASIC builders (don't share programming), all re-invent AI techniques established long ago, all have limited ability to adapt to new use cases, and all exist within their own turf only with little ability to extend reach beyond those walls.  \n\nSeems a HUGE threat to NVIDIA GPUs who already support close to 4000 applications, 5M developers, and 20,000 independent customers.   /s", "score": 1, "replies": [{"body": "https://www.barchart.com/story/news/28443972/new-ai-chip-beats-nvidia-amd-and-intel-by-a-mile-with-20x-faster-speeds-and-over-4-trillion-transistors\n\nGet out of your Nvidia echo chamber.\n\n“For organizations dealing with extremely large AI models where inference speed is critical, Cerebras could be the better choice.“\n\nAka all of Nvidia biggest customers.", "score": 1, "replies": [{"body": ">echo chamber   \n\nYou're a brave one throwing around the insults.\n\n\"According to Cerebras, the chip is around 1000 faster than traditional systems.\"  - This is from 2019.  [https://wccftech.com/meet-cerebras-wse-the-worlds-largest-chip-at-more-than-56-times-the-size-of-an-nvidia-v100/](https://wccftech.com/meet-cerebras-wse-the-worlds-largest-chip-at-more-than-56-times-the-size-of-an-nvidia-v100/)\n\nSo now it's only 20X?   what happened that their speed advantage magically dissipated by a factor of 50?\n\nOh, and here we are 5 years later and Cerebras still have like zero traction.  You clearly don't understand their memory and cost limitations, but boy you sure know how to google search for a headline.  Awesome skill bro! \n\nNvidia does more AI revenue in a day than they raised in their last round, but sure, let's go with the idea Cerebras takes over the world.   😂😂😂", "score": 2, "replies": [{"body": "You think Microsoft, Google, Amazon, Apple.. worth trillions.. will continue to allow Nvidia to dictate cost points for their internal hardware?\n\nIt’s same thing with Apple and Intel.. Apple used Intel to a lot of their laptops early on then started their own R&D and now have their own flagship chipsets that are not intel.\n\nIt’ll be the same with AI.  These trillion dollar companies aren’t going to keep buying Nvidia at Nvidia cost points.\n\nThey’ll start designing and implementing their own solutions - they’re big enough that can easily do that within years and already started years ago.\n\nASICs chips are the future with these big LLMs and big companies.. much more efficient than any future general GPU that Nvidia uses.", "score": 0, "replies": [{"body": "You've demonstrated your understanding of the merchant ML chip market -- let's just call it superficial.  \n\nNvidia owns training and the developer ecosystem.   And outside a handful of hyperscalers they own inference too, it's like the whole ball game, 90%+ market share.    There are huge segments of which Nvidia has barely scratched the surface.   \n\nBeyond that there enormous barriers to entry for any merchant ML chip supplier to overcome that your discussion has never addressed.\n\nYour argument that \"these trillion dollar companies aren't going to keep buying\" seems a bit misplaced.  They have since 2016 and in increasing numbers.   And by all indications, they will continue to as they've already put their orders in for next generation Blackwell solutions, 100s of thousands at a time.\n\nSo don't know what you're talking about bro.  Sure they started their own solutions years ago, many years ago in fact.   But it completely upends your argument that they're all still buying Nvidia and they're still paying tremendous margins for that privilege.   You've obviously never thought to ponder why.\n\nWell, let me fill in the blanks for you:  Nvidia is working with 20,000 AI entities because Nvidia's solution works better than anything else.    It's more flexible, more performant, serves a wider variety of use cases, is better supported, and has a broader installed base than anything else.   And every day Nvidia's position just solidifies more.  \n\nSo \"because they won't let them\" sure doesn't seem to be much of an argument.", "score": 0, "replies": [{"body": "It’s not slowing???  Here’s a non echo chamber answer for you.\n\nYes, Nvidia’s growth is slowing down: \n \nQuarterly revenue\nNvidia’s quarterly revenue grew 122% in 2024, which is down from 262% in the previous quarter. \n \nYear-over-year revenue\nNvidia’s year-over-year revenue growth in 2024 was 122%, which is less than half of the growth rate in the first two quarters of 2024. \n \nGross profit margins\nNvidia’s gross profit margins declined between the first and second quarters of 2024 due to product issues. \n \nSome reasons for the slowdown include: \n \nAI companies and cloud providers\nThe slowdown may indicate that these companies are digesting their large-scale hardware investments. \n \nAI infrastructure buildout\nThe slowdown may suggest that the initial wave of AI infrastructure buildout is maturing. \n \nTechnical problems\nTechnical problems with Nvidia’s Blackwell chips may have contributed to the slowdown. \n \nCompetition\nIf rivals can deliver chips that work faster and cost less, coders may write software for competing chips, costing Nvidia market share.\n\n— \nEven tho your echo chamber wants you to believe that Blackwell is the end all be all solution for everything.. it’s not.  Congrats on holding the bags for the rich whales dumping tho — you may see a 30% in a couple years", "score": 0, "replies": [{"body": "😂😂😂\n\nNow you're just trolling.  Stick to the topic or move on, I'm not going to engage with any piece of bullshit that pops up between your ears.  The topic was:  \"ASICs are going to take over AI world.\"   \n\nYou appear to have conceded the subject.  Feel free to go back to your master for some more talking points though, they're always good for a laugh.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "The other big reason is that they are moving onto a chiplet architecture for GPU, and this will necessitate a whole new stack anyway, especially when they need a way for chiplets or a combo of chiplets to talk to each other like one coherent GPU.", "score": 1, "replies": []}, {"body": "Why are you so insecure? Relax baby", "score": 0, "replies": []}, {"body": "What people seem to be failing to grasp (analysts included) is that AMD plain in simply isn't a competitor to Nvidia, they are tiny and so far behind, and getting further and further behind. With Intel blowing up, I wouldn't be surprised if they shift their focus more to controlling the personal computer market and largely giving up on AI chips.", "score": -2, "replies": [{"body": "It's really going to leave a bad taste in developers mouths.  CSPs and ISVs have been working to bring AMD MI300 Instinct product to market and whether those solutions are compatible in the future is a hurdle AMD is going to have to overcome.   AMD's strategy was to farm-out a lot of work to the open source community rather than do the work themselves.   I'd imagine developers will be more reserved to taking on this type of work in the future.", "score": 1, "replies": [{"body": "Yea they have tried to stitch together something to say competitive, but Nvidia is a juggernaut and they have the best of the best working in house. AMD can't compete, whoever they go to.", "score": 2, "replies": []}, {"body": "The big question is, will the new UDNA SW be fully RoCm compatible? Can you still use MI3xx cards with it when it releases?\n\nIf not then AMD will be in big trouble because they do the same thing again which they have bad reputation for years. No continuity in their SW. Nvidia's CUDA supports GPUs from 12 years ago and you know that if you buy Nvidia today, it will run with latest CUDA and support latest SW features in 5-10 years. With AMD it seems to remain a \"good luck\" option for future outlook.", "score": 2, "replies": []}]}]}]}
{"title": "Coreweave the scam that is inflating SMCI and NVDA growth numbers backed by Crypto bros, Energy traders Private Equity, HF", "selftext": "https://www.theverge.com/2023/8/8/23824661/coreweave-nvidia-debt-gpu-ai-chips-collateral\n\nhttps://x.com/Beth_Kindig/status/1832407478748778950\n\nhttps://research.contrary.com/company/coreweave\n\nDon’t think there’s anybody to trust less than crypto bros, energy trader, Hedge funds, Private equity and mingle that with SMCI a company that couldn’t provide fixed 10-k for 2-3 years and got delisted for fraud.  \n\nhttps://www.marketwatch.com/story/super-micros-stock-set-to-be-delisted-as-filing-deadline-wont-be-met-2018-08-22\n\nConnected another note is NVDA’s boom in stock price in 2017/2018 was also fueled by selling mass amounts of GPUs to coreweave that they recognized as organic gaming demand and was fined for improper accounting.  Selling GPUs to themselves during the crypto boom.  Coreweave/SMCI/NVDA circular money glitch\n\nhttps://www.sec.gov/newsroom/press-releases/2022-79\n\nCoreweave is basically owned by NVDA Blackrock Blackstone. Blackrock Blackstone and PE is lending money to Coreweave/NVDA so\nNVDA is selling billions worth of GPUs to themselves\n\nhttps://www.blackstone.com/news/press/coreweave-secures-7-5-billion-debt-financing-facility-led-by-blackstone-and-magnetar/\n\n\n\n“None of the founders came from the cloud space before starting CoreWeave. Rather, all came from trading energy futures. While Venturo and Intrator were working together at their hedge fund” \n\nSix months ago when SMCI was being pushed on to the public I said it was a scam to fleece retail, said they were going to be a ton of lawsuits and they’re all coming\n\nhttps://old.reddit.com/r/wallstreetbets/comments/1bw9c8l/goldman_sachs_and_morgan_knowingly_offering_scams/\n\nI didn’t know when the timing of the dump was but I said it’d be under $100 in the future before all the accounting fraud reports came.\n\nDigging around and talking with people in the field be very careful when Coreweave get offered, it may pump, even for a year but their numbers are going to be cooked.\n \n\nAnd as we see SMCI has the same circular money glitch selling/buying from his brother, wife’s company which are located inside the SMCI campus. So I don’t know the exact but it seems very fishy and makes me think PE loaned money to 2.6 billion to coreweave to pump up SMCI and NVDA revenue numbers and they are going dump on retail?\n\nhttps://hindenburgresearch.com/smci/\n\nI can’t put my finger exactly on it but there’s definitely alarm bells ringing", "id": "1fcxevz", "created_utc": 1725908553.0, "score": 100, "upvote_ratio": 0.79, "num_comments": 56, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 9 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 640 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Coreweave? [The company that got a $2.3 billion dollar loan that was collateralize by their nvidia chips, so they could buy more nvidia chips](https://www.reuters.com/technology/coreweave-raises-23-billion-debt-collateralized-by-nvidia-chips-2023-08-03/)", "score": 62, "replies": [{"body": "So in my country we had our biggest airline company go bankrupt. So it was bailed out, they managed to find a buyer for it since it needed capital. \nWell sometime has passed since then and we just \"found\" out that the buyer used a loan from the airline to buy the company. \n\nSo think about it the guy bought the company with a loan taken from the company he was buying, so he got the company for free really. I mean might as well give the company to a homeless person on the streets with no knowledge since it seems nowadays you dont even need to have money to buy anything in the 1st place.\n\nTheres a lot more corruption and complexity in this case but this is the developed world of 2024", "score": 40, "replies": [{"body": "This happens in the states as a way to get out from underneath massive fringe benefits, pensions etc. Was that the case? Just changes the names on the building and a few c suites and company is profitable again. Fuck the employees.", "score": 13, "replies": []}, {"body": "https://old.reddit.com/r/antiwork/comments/1f6krma/private_equity_is_literally_killing_people_be_it/\n\nIt looks like the work of private equity financial engineering.  Basically rehashed corporate raiders from the 80s is what another commenter said.  I wasn’t around then but yes that looks exactly what they are doing.  \n\nGoogle Private Equity is destroying… not only the people, america, but the environment and killing everything in its path.  So yes they are all about faking numbers", "score": 13, "replies": [{"body": "The problem is fixing things. How do you fix things if the whole system is now tainted with cheap money, everything is connected now, you can build machines that do the work of 50 people and dont get sick or tired.\nIts in the interest of the state to keep things as they are not to change.", "score": 3, "replies": []}]}, {"body": "Isn’t this is what happened to Boeing? Minus the bankruptcy?\n\nVultures came in, used Boeing’s money to buy Boeing, then padded the board with their vultures and ousted the original board.", "score": 7, "replies": [{"body": "I really dont know, Boeing is gigantic and never had money issues, they just call someone and get a government contract if needed. I think it probably comes down to paying to much money to accountants instead of hiring more engineers and qualified workers.", "score": 2, "replies": []}]}, {"body": "that’s an LBO", "score": 5, "replies": [{"body": "I just found out. Still this shouldn't be allowed for obvious reasons.", "score": 1, "replies": []}]}]}, {"body": "Yup, color me surprised.  This is the type of stuff Hedge Fund, Energy Traders, Crypto bros, Private Equity would do to fake numbers", "score": 12, "replies": []}, {"body": "Seems kinda smart (a little corruption and fraud but still...)", "score": 1, "replies": []}, {"body": "A loan is always based on assets. And such loans are common across such late stage startups. Theyvalso raised some 1.1 billion in funding.\n\n\nThey scaled from 3 to 10 data centers this years and have heavy demand, so it's not a surprise They need to raise more money for Capex. \n\n\nThe real story here is that they are (potentially) eating Amazon's and Microsoft's pie.", "score": 1, "replies": []}]}, {"body": "So it seems that NVDA invented the infinite money machine: sell overpriced GPUs to itself for a profit!\n\nCalls!\n\nBTW, your first link is from 2023, lmao.", "score": 16, "replies": []}, {"body": "Nvidia and Blackrock rigged the game?!?! So they can pump the numbers?! Bullish!!1", "score": 33, "replies": []}, {"body": "So this is like clamweaving, right? How much will it improve my parses?", "score": 15, "replies": [{"body": "I thought clamweaving was when you have sex with 4 girls at the same time?", "score": 11, "replies": [{"body": "Don't be silly, there are no girls behind the Wendy's.", "score": 5, "replies": []}]}]}, {"body": "cracks me up that people think ablecom and compuware having their buildings next to supermicro is some kind of revelation. to me, it's the most obvious sign that they weren't trying to hide anything about their arrangement.", "score": 7, "replies": []}, {"body": "All that words and no position. Why are you wasting our time with this!", "score": 32, "replies": [{"body": "You can’t take positions in coreweave, it’s private looking to go public next year.  The more I dig into it the more it looks like a Terra Luna scam.", "score": 33, "replies": [{"body": "So go all in as soon as public and sell half after doubling and then another quarter after tripling.", "score": 2, "replies": [{"body": "Pussy, you'll never get the lambo that way", "score": 4, "replies": []}]}, {"body": "You can position on CoreScientific, CORZ, the bitcoin mining company they are contracting for hosting services:\n\n  \n[https://investors.corescientific.com/news-events/press-releases/detail/78/core-scientific-announces-new-contract-with-coreweave-for-delivery-of-approximately-70-mw-of-additional-infrastructure-to-host-high-performance-computing-operations](https://investors.corescientific.com/news-events/press-releases/detail/78/core-scientific-announces-new-contract-with-coreweave-for-delivery-of-approximately-70-mw-of-additional-infrastructure-to-host-high-performance-computing-operations)", "score": 2, "replies": []}]}]}, {"body": "If Coreweave is a scam, why needlessly sign a big multi billion contract to us CORZ HPC? They shouldn't need anything if it's fake?", "score": 5, "replies": [{"body": "If SMCI is a scam why are they making products, selling billions to contracts with META, Google, AMZN, MSFT, HPE.  \n\nMore $.  Why did some rich asshole scam more people?  \n\nThe obvious answer is to get more money.  Why did Madoff scam people?  He had a lot of wealth, wanted more $ it’s really that simple.", "score": 12, "replies": [{"body": "no one is alleging SMCI is a scam. they are alleging that money is being handled improperly to enrich the people at the top. something that happens at literally every single company ever.", "score": 2, "replies": [{"body": "Tell that to investors who are down 120k on smci if you fake the numbers before and couldn’t provide true 10-k for 2-3 years and get delisted from trading it’s a scam.  \n\nLots of bag holders in smci sub market just shutdown that would say it’s a scam", "score": 7, "replies": []}]}]}]}, {"body": "The stuff happening now makes the enron fraud case look like standard accounting process", "score": 10, "replies": [{"body": "when they said they were going to do the internet through the electrical grid, i thought enron really had a winner...", "score": 3, "replies": []}]}, {"body": "These guys got their sources from Bloomberg", "score": 9, "replies": []}, {"body": "SOMEONE CALL BOEING HR NOW", "score": 4, "replies": []}, {"body": "wow Tinfoil Hat Conspiracy Theory Stringing Together Random Shit Intensifies", "score": 12, "replies": []}, {"body": "This is a nothing burger. NVDA can't keep up with demand for the hyperscalers. Coreweave investment is just a hedge against the hyperscalars if any of them drop nvda.", "score": 5, "replies": [{"body": "Or NVDA just funded a promising startup in the AI space (100 million to be precise), which needs lots of capital. Everything else is a nothing burger. The cost to build a large model now runs into billions of dollars. The cost to create server farms also is billions. So they have to raise capital. The fact that a startup can even do that, and compete with the likes of Google, Microsoft, and Amazon, is a pleasant surprise. But not a surprise given the demand right now.", "score": 1, "replies": []}]}, {"body": "Calls it is on NVDA", "score": 6, "replies": []}, {"body": "This is a nothingburger. Any startup in the Ai space that relies on Nvidia chips needs a tonne of money for the Capex. They are a big hyperscaler and a GPU cloud provider. Yes, NVidia invested in them. Also, Nvidia and many others use them for their GPU cloud. This is not round tripping. In fact, this is great news for a startup that their services are being used by investing companies.  Such dogfooding is not uncommon. Even OpenAi has investments by Microsoft and others, and their services and IP are being used by Microsoft. They are growing really fast given the need of GPU services. They scaled from 3 data centers to 10 this year. \n\n\nAlso, just a cursory glance into numbers will be enough to debunk the conspiracy theory in the posting. Nvidia's net investment in coreweave is just 100 million - typical rounds nvidia makes for promising startups. They have 1.1 billion in funding rounds this year, 7.5 billion in debt from a number of institutions including Blackstone, Magnetar and Coatue.", "score": 4, "replies": [{"body": "The only negative impression I took from this is - all this business should have been driven by Amazon, Microsoft, and Google as leading cloud providers. They are allowing startups like Coreweave to eat a big chunk of this pie. And it doesn't stop at GPU services alone. At some point, they will expand into storage and compute.", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "The real story here is how much companies like Coreweave are a threat to Amazon and Microsoft. They should have automatically captured most of the hyper-scaler business, but apparently not.", "score": 2, "replies": []}]}]}]}, {"body": "celestial AI or cerebras is probably a better play then any of these companies for 2025 IPOs", "score": 1, "replies": [{"body": "There are lots of new \"AI service over cloud\" providers in this space. Most of the business is for GPU services for AI model training, as related operations are very costly. If you look around, even data centers for bitcoin mining are branching into model training, as the GPU infra is essentially the same. Bitcoin being bitcoin, their cost fluctuates, and this allows them to target model training services when prices are down. The demand for these is insanely high right now.\n\nAs we have seen in the past, most of them will eventually die or get bought by the big sharks. A handful of those who exist will be big and just coexist with Amazon and Microsoft offering their models and services on their cloud, or also on the big 3.", "score": 1, "replies": [{"body": "All I’m saying is that these are differentiated hardware solutions. They move data far more efficiently than the current solutions and efficiency is currently king in AI systems. There is literally an energy squeeze from a new technology imagine once it matures.", "score": 1, "replies": []}]}]}, {"body": "I'm so tempted to pounce off into a rabbit hole of conspiracy but I have self-restraint.  \n\nOP, if you want to spiral into madness and connect all the dots I recommend watching a few interviews from Whitney Webb. She'll confirm and add context to what you're seeing here. Just get ready cause it's dark", "score": 1, "replies": [{"body": "Thanks I’m definitely up for a good read/podcast, always good to look at things from a different angle even if I’m wrong.  There’s just so many shady things, from shady characters, who have done shady things and fined for shady practices.  So you can’t blame me or anyone for thinking they are artificially pumping numbers.\n\nCoreweave started crypto mining in 2017/2018\n\nhttps://venturebeat.com/ai/coreweave-came-out-of-nowhere-now-its-poised-to-make-billions-off-of-ai-with-its-gpu-cloud/\n\nSMCI can’t provide accurate 10-k 2018 and before\n\nhttps://www.marketwatch.com/story/super-micros-stock-set-to-be-delisted-as-filing-deadline-wont-be-met-2018-08-22\n\nNVDA fined for misrepresenting revenue obtained from crypto in 2018 (again they sold GPUs to coreweave/themselves and put that revenuse as gaming growth), timing with SMCI 10-k filing fraud, delisted from trading on stock exchange and Coreweave creation.  Hmmm\n \nhttps://www.sec.gov/newsroom/press-releases/2022-79\n\nA large percentage of SMCI’s revenue “growth” was from coreweave during this recent pump and dump.  And a lot of NVDA sales were to SMCI, Coreweave, channel stuffing.   \n\nhttps://x.com/Beth_Kindig/status/1832407478748778950\n\nhttps://www.mololamken.com/knowledge-Whats-Channel-Stuffing-and-Is-It-a-Crime\n\nhttps://x.com/InvResDynamics/status/1765918363652431931", "score": 1, "replies": []}]}, {"body": "Just another misinformation post like what those 2 dickheads did over at Bloomberg", "score": 0, "replies": []}, {"body": "Is crypto still a thing?", "score": 0, "replies": [{"body": "Crypto bad actors and scams are definitely still a thing.", "score": 3, "replies": []}]}, {"body": "Reddit (the company, not r/WallStreetBets, the subreddit) has banned Seeking Alpha articles everywhere on Reddit.\n\nTo get around this, please repost your comment/thread with the link removed, and the relevant parts of the article copy and pasted. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": [{"body": "why?", "score": 6, "replies": []}]}]}
{"title": "Apple Glowtime Event", "selftext": "Time to talk about \"Apple Intelligence\" regards. \n\nSo you may be wondering why the stock is down after this event, well I recall that something similar  happened during the AI event back on June 10th. A dump of around $4 beginning at 1:00 EST. But the stock ended up pumping after the event, shooting from the low $190s to >$210s over the course of two days. It topped out at $219.95 on June 12th around 2:00 EST. I wonder if the same thing will happen this time and if the said \"supercycle\" will begin with the iPhone 16 model. ", "id": "1fcxqk0", "created_utc": 1725909319.0, "score": 27, "upvote_ratio": 0.74, "num_comments": 51, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 7 | **First Seen In WSB** | 10 months ago\n**Total Comments** | 14 | **Previous Best DD** | \n**Account Age** | 10 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 17, "replies": [{"body": "\n\nThis 👆🏻\n\nBuy the rumour, sell the news. Always has been, always will be.", "score": 2, "replies": []}]}, {"body": "The average consumer doesnt want AI. People who have iphones care more about the social aspects of the phone. They also care about other people knowing they have the newest iphone and this phone doesnt look different enough to warrant upgrading their social circle phone status.", "score": 30, "replies": [{"body": "Better yet, i live in Europe all those AI features will probarly never even work here due to rules and regulations. Even now i have a lot of features on my iPhone that wont work. Besides AI this was a very lackluster presentation. Nothing had any real innovation. They really hit the silicone ceiling", "score": 11, "replies": [{"body": "Lol. while watching the keynote i thought to myself \"damn, i wonder how many people realize what all this means\".", "score": 3, "replies": [{"body": "Man it uses their gold platinum status of super privacy they care for you about.\n\nLike, for some reason my macbook password stopped working on a random day and all I needed to do was to launch in safe mode and execute a script in the terminal to reset my password.\n\nAnd I could access all files once logged back in.\n\nThat's how they care about your privacy.", "score": 1, "replies": []}]}]}, {"body": "Does highlighting text on an image when copying it in my note considered AI? I like “quiet ai” if thats a thing then, little timesaver functions i guess.. agreed though.. the first thing i do is always turn off any “in your face” ai helpers be it siri, alexa, google whatever", "score": 4, "replies": [{"body": "You’ve nailed where Apple will do AI well - ‘quiet AI’. Summing up your emails in the preview (rather than just showing the first 2 lines) etc…", "score": 9, "replies": []}, {"body": "Ya that’s AI. Autocorrect and word prediction is too.", "score": 2, "replies": [{"body": "Somehow those features became complete shit on iOS 17, hopefully AI will take over them.", "score": 3, "replies": []}]}]}, {"body": "and yet we going to see a stock out the first few weeks", "score": 2, "replies": [{"body": "Manufactured scarcity", "score": 3, "replies": []}]}, {"body": "they want an actually intelligent siri - if this is what Apple AI can do, that alone is enough", "score": 2, "replies": [{"body": "Why? What does an intellegent Siri do for someone who uses text messaging and social media primarily? Maybe for power user nerdy android users with no one to talk to, but not Apple users", "score": 1, "replies": []}]}, {"body": "I have a 12. I’m ready to upgrade this bitch is slow af and terrible camera. May as well get AirPod max while I’m at it. 🤷🏻‍♂️💸", "score": 2, "replies": [{"body": "I have a 12 too and it keeps crashing the browser. Its only 10 months old. Disappointing ", "score": 3, "replies": []}]}, {"body": "The average consumer doesn’t understand how they’ll use AI yet, but already have been for years. \n\nOnce people figure out its usefulness, especially the way Apple will implement it, there’s no going back. \n\nApple highlighted a perfect example of it during their demo. “Hey Siri, send all of the photos of last weekend’s camping trip to Susan”\n\nThat’s going to be the power of “AI”", "score": 1, "replies": []}]}, {"body": "Boring as fuck", "score": 7, "replies": []}, {"body": "It’s still not pumping. Someone bring him a new defibrillator", "score": 3, "replies": []}, {"body": "Clearly no reason to upgrade hardware from 15 to 16. Also most of my those AI features will just end up in iOS updates and are basically just nice-to-haves.\n\nExited my regarded call play more red than my first period. Time to start writing up my “win journal” at work to butter me up for when I put in for promotion to Wendy’s restaurant manager ![img](emote|t5_2th52|52627)", "score": 3, "replies": [{"body": "Fuck you, Tim Apfel! ![img](emote|t5_2th52|27421)", "score": 2, "replies": []}]}, {"body": "Not upgrading for the second year in a row. Used to upgrade every year. Not worth it anymore.", "score": 5, "replies": [{"body": "this is the first time after iphone6 it is actually worth upgrading.", "score": 2, "replies": []}]}, {"body": "When you get down voted and disagreed with by the degens on this sub that only post losses, have even more faith in what you're saying.", "score": 2, "replies": []}, {"body": "tim cuck cant read a stock chart.  he initiated buybacks at the top instead of waiting for institutions to bring it to a more reasonable price.  iphone 16 is not gonna be worth the upgrade.", "score": 4, "replies": []}, {"body": "I am PUMPED💪✊\n\nMedical grade 🦻\n\nCustom emojis\n\nAI\n\nAAPL 🚀🌕", "score": 3, "replies": [{"body": "Buy as long as people don't realize it's the first huge commercial ai use.", "score": 3, "replies": []}]}, {"body": "Such a bad event", "score": 2, "replies": []}, {"body": "Phone has a new button, watch is thinner, AirPods remain the same, that’s about it", "score": 1, "replies": []}, {"body": "Just felt like a DEI promotion. Products are so so derivative it’s hard to see the new", "score": -9, "replies": [{"body": "For real. Every Apple event seems to decrease the improvement and increase the identity politics. This is a company at the beginning of a painful decline.", "score": 8, "replies": [{"body": "Lmao who's taking their market share? No one I can see. \n\nApples phones we're never about huge leaps really. People have been complaining about \"no big difference between models\" for about 10 years. I mean did going from 1 to 2 or 3 camera lenses change anyone's life? Getting rid of the home button? Lightning to USBC?", "score": 2, "replies": [{"body": "At some point the company needs to have a product idea. Adding more rainbows and brown women to your announcement isn’t enough", "score": 8, "replies": [{"body": "speak for yourself \n\ni want the gayest, transiest phone possible. even if it can’t handle voice commands for shit", "score": 2, "replies": [{"body": "I agree. Make my phone my dom. That’s all I’m saying. I want to open up to my phone and take all 6.9”", "score": -1, "replies": []}]}, {"body": "They are the most profitable company in the space, and have ALWAYS been slow/later in adding features than anyone else. Nothing has changed. Not sure what people are mad at.\n\nAlways fun to take shots at DEI and rainbows though I guess.", "score": 2, "replies": [{"body": "To be fair they’ve also been one of the least profitable companies, which happened because their founder left and they got taken over by suits parroting industry trends. \n\nI don’t care if apple succeeds or fails, but as someone who used to be excited about their products and who had tens of thousands of dollars of those products at home, I would prefer if they actually did something. My $800 or whatever Apple Watch (including the expensive steel link band) basically sits in a drawer because it doesn’t do anything useful, and I can’t believe how bad the updates to the new watch are. \n\nI actively want to waste my money and they managed to make even throwing away money seem not worth it. Well done Apple!", "score": 3, "replies": [{"body": "Is there a better Smartwatch out? Im not aware.\n\nPeople forget... The Iphone didnt launch with a freaking app store. It was added a year after. Steve jobs didnt originally even want to open the phone and wanted them to do webapps in safari.\n\nAI is new...new use cases will come up and when they are mature and stable Apple will add it in surely.", "score": 2, "replies": [{"body": "The issue for me and most people I know is that smartphones are actually useful. Smartwatches much less so.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "\"DEI promotion\" like that's supposed to be a bad thing. Lol", "score": -1, "replies": [{"body": "It is", "score": 2, "replies": [{"body": "If making earbuds that work as hearing aids counts as DEI, then yea, I want more of that.", "score": 2, "replies": [{"body": "Not what I’m talking about. That’s fine if it works. Wont help many causes of hearing loss, but better than nothing. \n\nBut that is a niche feature on one product. AirPods Max 2.0 is literally 1.0 but with usbc", "score": 2, "replies": []}]}]}]}]}, {"body": "The difference between iPhone 15 and 16? A shinier camera... which will cost you $1K more.", "score": 0, "replies": []}, {"body": "Apple is way overpriced at the moment... Maybe that's why?\n\nTheir new phones are just \"here's a new number for 100$ more with 95% same features and that we've locked down so perfectly, you can't even swap an iPhone component with an original(!) iPhone component without breaking the phone\" for years.", "score": 0, "replies": []}, {"body": "buying puts at open", "score": 0, "replies": []}]}
