{"title": "Microsoft's dominant 21st century offers a key lesson for stock market investors", "selftext": "", "id": "1ewyu50", "created_utc": 1724168434.0, "score": 409, "upvote_ratio": 0.96, "num_comments": 69, "comments": [{"body": "Gm logo with GE text.", "score": 188, "replies": [{"body": "Shoot! Thanks for the catch. We are fixing this graphic across our platforms. It should be GE's logo.", "score": 68, "replies": [{"body": "Someone left their intern loose 😉", "score": 29, "replies": []}]}, {"body": "Both had absurd financial divisions back then. Bound to be some overlap", "score": 3, "replies": []}, {"body": "Also the 2024 is on the left when it should be on the right. The lower year should be on the left", "score": 3, "replies": [{"body": "Yeah, I would have done it this way too. But I don’t think he’s asking for style point critiques.", "score": 3, "replies": []}, {"body": "This confused me as well, I read from left to right", "score": 2, "replies": []}]}, {"body": "Bunch of fkn amateurs", "score": 1, "replies": [{"body": "An intern made this", "score": 2, "replies": [{"body": "I was referring to the entirety of Yahoo.", "score": 2, "replies": []}]}]}]}, {"body": "Microsoft was dead in the water for years when Steve Balmer was running the company. They missed the wireless revolution. I believe they were a laggard for close to fifteen years until Nadella took the helm and went full steam into the cloud. If you had the patience to ride out the lean years, you made a lot of money with the current surge. That said, it’s very rare for companies to get second acts. They are an outlier.", "score": 119, "replies": [{"body": "Yeah, there's a difference in technology stocks today because everything they do is on computers and there are many things software can do and it's limited only by people's ideas and the hardware available.\n\nIn contrast, XOM was an oil company and there's not really much room to change their business unless they enter a new completely area with no expertise. The leap between Windows/Office to Azure is enormous in terms of impact, but relatively little in terms of new expertise needed.\n\nWith that said, Ballmer performed badly as a CEO of a software company, but it'd be perfectly normal for most traditional companies.", "score": 34, "replies": [{"body": "Steve Balmer was CEO of Microsoft during the dot com bubble and GFC. Microsoft did ok during that time so Steve did exactly perform badly. Microsoft remained in the top 10 company by market cap since 1995. Can’t really run down a software company that essentially have monopoly on desktop OS.", "score": 9, "replies": []}]}, {"body": "Msft did well under Balmer. The stock market =/= the economy", "score": 9, "replies": []}, {"body": "Comes to show also how important the CEO is. For one thing I generally prefer founders or engineers for tech companies.", "score": 6, "replies": []}, {"body": "Would you consider NVDA getting a second act? Mining kind of died but then AI came. It felt like luck.", "score": 6, "replies": [{"body": "Nvidia is way ahead of the curve with their artificial intelligence computer systems. That’s another stock that was flat for an extended period of time. Almost a decade. The management team at Nvidia has been planning on dominating the AI market since they were primarily perceived as a graphics card company ten years ago. I don’t think you can call that a second act. I don’t want to get too off track here but the point I was trying to make about MSFT is that companies that dominate the S&P 500 from decade to decade don’t repeat as new technology is introduced. If you look at the history of the market going back 70 years to the mainframe era, industry leaders come and go.", "score": 12, "replies": [{"body": "Totally agree. idk Nvidia was planning AI for so long.\n\n  \nNow I'm curious on what the short list of second acts are... even if the second act is dead now and they weren't in the top 100 even. Just companies that have two acts.. I remember giants of the past that just kind of \"exist\" now without influence (IBM, HP, GE, Exxon, GM etc)", "score": 2, "replies": [{"body": "The two that I can think of off the top of my head are IBM and Apple. IBM dominated in the 1950’s and 1960’s with their mainframe computers but got out of favor when mini computers were introduced by companies like Wang and Digital. In the mid 1980’s they got a second life with the advent of the PC . Although IBM is a terrific company, the stock hasn’t performed very well since the turn of the century. Maybe Watson will get them in gear if they can compete in AI. Apple was a good stock in the 1980’s, then got trounced by corporate adoption of Windows PCs in the workforce. They were out of favor for a decade until the introduction of the iPod. The rest is history.", "score": 1, "replies": []}]}]}, {"body": "The emergence of artificial intelligence is an inevitable trend in the future.NVIDIA is expected to continue its leadership in AI as demand for AI-driven technologies continues to grow across industries. The company's continued innovation in GPU technology, AI software, and specialized platforms for industries such as automotive and healthcare positions it well for future growth. In addition, NVIDIA's strategic acquisitions, such as Mellanox and ARM (pending regulatory approval), are likely to further enhance its capabilities and market reach in the AI ​​space.", "score": 1, "replies": []}]}, {"body": "They also lost the mobile market and home console/entertainment by fumbling Windows Phone and Xbox", "score": 5, "replies": [{"body": "I don't think they fumbled Xbox. Xbox is still out there, and gamepass is huge. There are still two major consoles - the PS and Xbox(Nintendo is its own thing). Could they have eaten more of Sony's pie? - sure, but that doesn't mean it's on the scale of Windows Phone, which is basically dead.", "score": 5, "replies": [{"body": "In terms of market presence outside of NA and audience interest/acquisition Xbox has quite a hill to climb, considering their approach to marketing and service availability.", "score": 7, "replies": [{"body": "What are you smoking my guy, PSN is not available to over 100 countries, remember the whole Helldivers 2 fiasco a few months back? \n\nThe only issue for Microsoft has been exclusives. A lot of people I know are buying PS for games like God of War(back when it was just exclusive), Bloodborne, Last of Us(again, before), RDR, etc. Not because of service availability.", "score": 4, "replies": [{"body": "So being completely unable to sell the Xbox anywhere outside of the USA is not a problem? They are being outsold by the PS5 3-to-1 and the god damn Switch is outselling Series X/S in its 7th or 8th year of lifecycle\n\nOr the fact that the only growth their gaming division has had this year is due to the Activision acquisition? Xbox hardware revenue decreased by 42% and they aren't sharing any GamePass financials so I doubt it's as successful as they would've liked. Without the Activision purchase, LinkedIn was bringing in more revenue at higher profit margins than their entire gaming division.\n\nMicrosoft is by far my biggest holding, and I genuinely would not care at all if they just shut down the entire gaming segment tomorrow. Hell, I might even buy more because they've done very little right ever since the failed 360 -> One transition", "score": 3, "replies": [{"body": "I genuinely think they are trying to move away from consoles all together. Gamepass is on pc now and they have been marketing that a lot. \n\nSony is btw doing the same, by porting most of their exclusive titles to pc as well. The semiconductor shortage, due to potential conflicts, tariffs, and coin mining, is showing that the console business has to evolve. Something Nvidia is doing, and Google tried with Stadia. \n\nAnd please, don't mention Nintendo and Switch, it is not part of the conversation as it's not a contender for either of those consoles, there is no overlap, nobody is choosing between Switch and PS5. You are either a Nintendo fan, or not. If anything I think we should bring Steam to the table, they are the silent killer, imo. \n\nAnd as a major MSFT holder myself, I would say that I don't think Xbox is doing well, and I do believe they'll need to innovate a lot with their next iteration, but I am also liking the shift, and looking forward to what's coming.", "score": 1, "replies": []}]}, {"body": "Xbox console business is close to getting shut down. They already exit EMEA", "score": 2, "replies": []}]}]}]}]}, {"body": "Is it reasonable to argue that Balmer set them up for success by making the right investments?", "score": 2, "replies": [{"body": "He probably had some successful ideas but the stock was toast under his watch. Nadella saved Microsoft’s bacon and the jury is still out on how successful they will be with artificial intelligence.", "score": 7, "replies": [{"body": "Toast… bacon. Did you skip breakfast this morning? 😜", "score": 3, "replies": []}]}, {"body": "He made fun of the iPhone.\n\nBut maybe they had no way of catching up anyways so it was his only play? Seems like they could have made a major play though, and I think his reasoning was biased by the widespread love for Blackberry's physical keyboard (by BB users). iPhone touch tech was much better than what came before.", "score": 1, "replies": []}]}, {"body": "Ballmer wasn't nearly as bad as he's currently made out to be. His timing was just ridiculously unlucky taking over right when the dot com bubble burst and presiding over the company during the 2008 crash so judging him by the stock price is not fair, it wouldn't have done well under Gates either.\n\nHe definitely did whiff on the consumer device market but remember that he was the one who pushed Azure, which is currently their cash cow and growth driver", "score": 1, "replies": []}, {"body": "Steve Ballmer has set up enterprise sales… big misconception about him and what he did. He MADE sure that Microsoft stayed afloat when they had the monopoly case, he was the positive rock in the water on stage yelling developers was back then", "score": 1, "replies": []}]}, {"body": "As spotted by u/redbottoms-neon, the logo for the second-largest company in 2009 should be the GE logo, not the GM logo. Sorry about the mix up.", "score": 21, "replies": [{"body": "Are you the REAL yahoo finance??", "score": 14, "replies": [{"body": "The one and only.", "score": 21, "replies": [{"body": "Interesting, I actually read a few of your posts on here a few months back (and I use you as a news source!) What makes you come back to reddit to post? Just curious about the marketing side of Yahoo/Reddit!", "score": 10, "replies": [{"body": "We started getting active again, really, just to connect with readers like you and join communities that overlap with our coverage!", "score": 16, "replies": []}, {"body": "Hopefully reddit stock will hit it big.  Didn’t even notice it’s the official yahoo finance user.", "score": 5, "replies": []}]}]}]}]}, {"body": "In a note to clients on Monday, strategists at Bank of America led by Michael Hartnett looked at the 10 largest companies in the world at four distinct points this century — March 2000, November 2007, March 2009, and November 2021 — plus the end of July of this year.\n\nThese dates represent, respectively: the top of the market before the tech bust, the top before the financial crisis, the bottom of the financial crisis, and the market's highs reached after the pandemic. And today, global stocks are trading at basically record levels.\n\nIn this exercise, BofA teases out two key features of any market always worth keeping in mind for investors — composition and concentration.\n\nRead more: [https://finance.yahoo.com/news/microsofts-dominant-21st-century-offers-a-key-lesson-for-stock-market-investors-morning-brief-100009433.html](https://finance.yahoo.com/news/microsofts-dominant-21st-century-offers-a-key-lesson-for-stock-market-investors-morning-brief-100009433.html)", "score": 16, "replies": []}, {"body": "Makes sense why Buffet is buying an oil company up like crazy. hes legitimately positioning for a recession", "score": 10, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I’m listening to myself lol. Just look at some of my posts about why the fed cycle points to 2024 marking the high. \n\nSold even more bank of merica this week", "score": 1, "replies": []}]}]}, {"body": "Why is Eli Lilly so big? Is it because of mounjaro weight loss (diabetes, technically) drug?  I believe that one is the competition to Ozempic (Novo Nordisk)", "score": 7, "replies": [{"body": "I thought the exact same. PE of 110 is absolutely absurd for a drug company (looking at phizer and J&J as comparison). I would imagine you’re right on the money with the Ozempic dream drug being the catalyst. Still absurd to have a market cap of 800B", "score": 5, "replies": [{"body": "You're thinking too small with little knowledge. The market is only America right now and they cant keep up with demand, obesity is a growing epidemic worldwide, I'd argue LLY and NVO are a safer bet than 80% of the companies on this list with a potential r/r much higher than the others unless AI momentum flips to software side.\n\nWith that being said I have taken profits recently, but that's just cause of % of port than anything else.", "score": 3, "replies": []}]}]}, {"body": "Note that Aramco was probably the largest company in the world in 2009.  It's just not on the list because it wasn't publicly traded until 2019.", "score": 7, "replies": []}, {"body": "China vs america", "score": 8, "replies": [{"body": "This graphic doesn't really demonstrate that, China's economy has grown more than the US's in this span of time.\n\nThe reason Chinese companies left the top 10 here is due to Western companies consolidating, or at least the capital in the market consolidating under them, in the same period of time as China's market has increasingly decentralized.", "score": 2, "replies": []}]}, {"body": "Key lesson.. Do not hire Steve balmer as ceo", "score": 11, "replies": []}, {"body": "Same as Japan, however I don’t think history will repeat this time.\n\nThings are different, technological moats are massive now, I highly doubt MSFT, AMZN, APPL or GOOG will fall within the next 20 years", "score": 8, "replies": [{"body": "yeah also cause next big thing is AI, maybe space exploration or mining could be a new thing but MSFT, AMZN, APPL, GOOG, NVDA software or hardware will always be used.\n\nThere are no threats that can currently menace TOP5.", "score": 6, "replies": []}]}, {"body": "Finally I can say yahoo finance always have Warren Buffet articles all over their site.  I feel like it’s an ad now at this point.  Warren Buffet this, Warren Buffet that.\n\nBut anyways it’s still my fav source for finance news. Lol.", "score": 3, "replies": []}, {"body": "Dammit, I had completely forgotten about my chinamobile loss until I saw this graphic.", "score": 3, "replies": []}, {"body": "gazprom lmao", "score": 4, "replies": []}, {"body": "step one, be a monopoly.", "score": 6, "replies": []}, {"body": "Fixed it for you: https://i.imgur.com/haaFUvb.png", "score": 2, "replies": []}, {"body": "Now do a key lesson for google’s dominance in search over yahoo 2024 vs 2000.", "score": 2, "replies": []}, {"body": "take profit?", "score": 1, "replies": []}, {"body": "What’s more interesting is that China has a lot of players and now it’s mostly dominated by US", "score": 1, "replies": []}, {"body": "So this next \"crash\" will be huge right", "score": 1, "replies": []}, {"body": "MSFT still king.", "score": 1, "replies": []}, {"body": "Does this mean most of the stocks I’m up in now will go away in the near future", "score": 1, "replies": []}, {"body": "So, what exactly is the lesson?", "score": 1, "replies": [{"body": "Never eat yellow snow.", "score": 8, "replies": []}, {"body": "Buy more microsoft", "score": 1, "replies": []}]}, {"body": "What key lesson are we talking about ? All you did was post a picture what type of discussion is this supposed to create", "score": 1, "replies": [{"body": "BofA's comparison points out two key features of any market always worth keeping in mind for investors — composition and concentration.\n\nNot only has the market become significantly more tech-forward and US-centric, but also more concentrated.\n\nThe fact only Microsoft has maintained its place among the global elite over the last quarter century tells us what is most likely to happen over the next 25 years.", "score": 3, "replies": [{"body": "More concentration most likely", "score": 2, "replies": []}]}]}, {"body": "Tells me energy is undervalued but i knew that in 2020 and purchased loads of it.  Still a little undervalue IMO.   The fall of the software giants will be epic.", "score": 0, "replies": []}]}
