{"title": "Did you know Amazon actually has a patent for \"anticipatory shipping\"? This entails shipping goods before you even place the order.", "selftext": "[removed]", "id": "9t4zgd", "created_utc": 1541034666.0, "score": 242, "upvote_ratio": 0.94, "num_comments": 64, "comments": [{"body": "This is what people mean when they say western decadence. ", "score": 150, "replies": [{"body": "Excess is a better problem to have than scarcity", "score": 63, "replies": [{"body": "Unless it's coming at the expense of other people's needs", "score": 19, "replies": [{"body": "That's true. So is the overall wealth and surplus of the Earth greater or lesser now compared to the past?", "score": 7, "replies": [{"body": "Is the quality of the environment better or worse now than before? How about animal population, how about suicide rates. \n\nMaterial goods aren't the only important thing ", "score": 3, "replies": []}, {"body": "And are people willing to share it?", "score": 3, "replies": [{"body": "Were people sharing it before? ", "score": 4, "replies": [{"body": "Ooh, I like this game.\n\nDoes everything have to be the same as it was before?", "score": 3, "replies": [{"body": ":3 \n\nNo, some things can't be changed but others we can! Should we stagnate for fear of the damage we may cause?\n\nAnd it's hard to keep that format XD", "score": 1, "replies": []}]}]}]}]}, {"body": "go cry somewhere else.", "score": 0, "replies": []}]}, {"body": "[removed]", "score": -4, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "I think He means until scarcity leads to excess. ", "score": 5, "replies": [{"body": "I thought that depletion led to excessive scarcity.", "score": 3, "replies": []}]}]}, {"body": "Excess/decadence* \n\nEventually, inevitably, everything will be depleted anyway; the Earth will be scoured of life by a red dwarf, the stars will burn out, all energy, matter, and even time itself will dilute away into nothingness,even blackholes will eventually evaporate... \n\nSo, may as well burn resources now to grow as much as possible. Not that Amazon's delivery is world-changing, but in general I favor utilization over conservation. ", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": -17, "replies": [{"body": ">Yall Americans are spoiled with too many good things.\n\nI agree, I feel like we take it for granted how great we have it. People get on their cellphones and tablets in their warm safe homes after eating a huge meal of exotic foods... and advocate being \"natural\" as if nature is our friend and doesn't want to and succeed in killing us in every imaginable way... XD\n\nEdit: Also, not sure why you were downvoted... People are weird and fickle. ", "score": 1, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "I suppose so... It's usually thingsthat are true but that people wish wasn't. I'm just usually the one getting downvoted! \n\nGlad you've moved to a better area!", "score": 2, "replies": []}]}]}]}]}, {"body": "Ain’t it grand.", "score": 6, "replies": []}, {"body": "We invented it", "score": 3, "replies": []}, {"body": "Have you ever lived in East Asia? At least Chinese people are certainly more consumerist than Westerners.", "score": 3, "replies": []}]}, {"body": "Isn’t this what that Minority Report movie was about?", "score": 41, "replies": [{"body": "Do I have to go to a back alley doctor now and get my eyes replaced just so Amazon won’t send me more toilet paper before I actually need it!!??", "score": 21, "replies": []}]}, {"body": "Or it could never happen.  Companies patent things all the time that they don’t intend to pursue.", "score": 39, "replies": [{"body": "\"just in case\"", "score": 13, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Same thing happens with movie studios buying screenplays/movie rights.", "score": 2, "replies": []}]}]}]}, {"body": "This may have just happened to me. I just ordered the coffee pods that I order quite regularly and religiously. \n\nWhen I checked out, it said “click here for free one day shipping.”  I’ve not seen that before, so they must have staged some at a closer warehouse than usual. I thought it was interesting because one day shipping is always available for a fee, but why would they offer me it at no charge unless it was already a very easy option for them? ", "score": 17, "replies": [{"body": "To entice you to pay for the convenience next time ", "score": 13, "replies": [{"body": "No I’m prime and get this a lot for free. I do live relatively close to a fulfillment center though ", "score": 11, "replies": [{"body": "Time of the day that you ordered it, perhaps? Ordering by a certain cut-off allows for 1 day shipping for free, whereas after a certain point, it's unavailable or available at a premium?", "score": 7, "replies": [{"body": "Ahh, could be it-it would make sense. I don’t pay attention to the times I order though lol so I can’t confirm ", "score": 2, "replies": []}, {"body": "This makes more sense\n\nSo maybe the coffee pod is kind of popular in op’s area, so after a while- it would make sense to move more in stock that is closest to OPs area. Which also be useful when others order as well. \n\nSo as soon as op puts it in the cart- they already know ( based on op’s address) that there are these coffeepods stored closer to op. \n\nSo before they had to offer 2 day shipping free- but it was coming from a far away warehouse\n\nBut now- that offset in price is justifiable because amazon saves a little by bringing it closer. \n\nSo to be eligible for one day shipping- ops sees a clock- that shows ORDER in 2 mins to get one day shipping\n\nThe sense of urgency plus free shit- confirms the purchase 8/10 times. \n\nThat predicabitly is enough to keep restocking the pods in the same warehouse\n\nAnd keep offering it more.\n\nFailure data points where its not feasible to store the pods close to op?( and not offer 1 day free shipping) \n1) not enough people buying it in the area to justify inventory costS\n2) op ( and others) reduce the frequency of purchase- that way the model cant predict accurately that they need to store more pods in the warehouse. So they wont. Stock it. And op will eventually get less number of times - free 1 day shipping options. \n3) not ordering before the time runs out. \n4) out of stock\n", "score": 2, "replies": []}]}]}]}, {"body": "It's exactly because they've got some stored up near your address. Delivering them to you is trivial, and with 1 day shipping they're trying to convince you to buy from Amazon instead of going to the grocery store. Eventually you'll buy everything on Amazon because of the sheer habit.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I always expected more of this to be honest. \n\nMe: Out of candy the day before Halloween? You didn’t know about Halloween?!\nManager: we’ve been out of candy for 3 days\nMe: !?\n", "score": 2, "replies": []}, {"body": "This is very basic inventory management in a supply chain, it's been happening for many years ", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "You don't have to do a lot of things.  Not drinking the coffee at all would be better. Why bother having it shipped to you, using energy to heat the water, washing your coffee cup afterwords, etc etc.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Why not just let people use kcups then? People are gonna drink coffee with kcups", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Plastics turn you gay if you use too much of them though", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Anything sent unsolicited in the mail is the recipients legally without having to pay for it. So that wouldn't work\n\nAdditionally no consumer is going to want to have to return things. It's way easier to simply stock roving autonomous vehicles with goods that people in that area regularly buy so that when a consumers select what they want, it's delivered near instantly.", "score": 10, "replies": [{"body": "Wow ", "score": 2, "replies": []}, {"body": "I'm pretty sure a simple change in terms and conditions will change all that", "score": 1, "replies": [{"body": "Terms and conditions don't supercede the law ", "score": 2, "replies": []}, {"body": ">I'm pretty sure a simple change in terms and conditions will change all that\n\nIt'd require a change in federal law. There's a very good reason that places can't send you things first without your permission and then demand payment.\n\nI'm not sure how any \"simple change in terms and conditions\" can supersede federal law. I doubt amazon would have any legal avenue  to require users waive their rights under federal law.", "score": 1, "replies": [{"body": "Lol I'm ignorant about law so I wouldn't know.\n\nI mean I guess they can put in things like \"by signing up for Amazon prime you're allowing us to send shit to you we expect you to pay for. We will automatically deduct funds from your mode of payment 7 days after confimed delivery\"\n\nWith some proper cooperate jargon to mask it all up of course haha. Something like \" I wish to participate in this scheme by checking the tick box\" or something.\n\nBut I assume by your post you probably already know what I'm saying so it's not possible cause it clashes with federal law or something?", "score": 3, "replies": [{"body": "You're talking about a practice called negative option billing, however even negative option billing isn't completely open ended; there's specific terms about what you are purchasing and the cost. \n\nBy nature, such a proposed system would not have specific terms, and thus would not be negative option billing and instead likely a violation of federal law.", "score": 1, "replies": [{"body": "I see. Thanks for clarifying, that's nice of you lmao. Where can I find these stuff to learn? Good stuff to know\n\n\nIs it possible(probably) for negative option billing to work if they do something like \"only toiletries, below 30 bucks each delivery\".", "score": 2, "replies": [{"body": ">Is it possible(probably) for negative option billing to work if they do something like \"only toiletries, below 30 bucks each delivery\".\n\nYes, would likely be allowed. At that point however, we're essentially just talking about a variant of Amazon's already rolled out \"Subscribe and Save\" with the new caveat that it's different things every month. This is very similar other subscription box businesses as well.", "score": 2, "replies": [{"body": "Icic. Though they can be crafty and send you some every few days or something? Or does the frequency have to be specified as well", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "That is completely different, Doomer ", "score": 5, "replies": []}]}, {"body": "I can’t wait till they just start sending me shit innwcwr ordered. ", "score": 3, "replies": []}, {"body": "I mean Amazon lockers in apartments are already a thing", "score": 3, "replies": []}, {"body": "Where can I go to search and look up patents?", "score": 3, "replies": [{"body": "[https://www.uspto.gov/patents-application-process/search-patents](https://www.uspto.gov/patents-application-process/search-patents)", "score": 2, "replies": []}]}, {"body": "The good old [Columbia House](https://en.m.wikipedia.org/wiki/Columbia_House) business model of shipping you things you didn’t ask for, and then charging you for not returning it in time. Everyone’s favorite way to buy books and CDs!", "score": 4, "replies": [{"body": "But getting those 8 CD's for a penny that you literally taped to the form!\n\nGood times.", "score": 3, "replies": []}]}, {"body": "Want to know how I know Amazon is overvalued?", "score": 6, "replies": [{"body": "[removed]", "score": 15, "replies": [{"body": "Woah now this ain't WSB", "score": 4, "replies": []}]}]}, {"body": "Ehh doubt it. \n\nI've never bough anything from one of their instagram ads... isn't that supposed to predict when/what I want?", "score": 4, "replies": [{"body": "OPs idea sounds like a great way for Amazon to lose a lot of money.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "How much did bezos pay for the iguana and did he enjoy it? ", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Are you accepting intern applications? ", "score": 2, "replies": []}]}]}]}, {"body": "Amazon is currently canceling prime memberships just for returning things, I don’t think they’ll take the risk of shipping something with no garauntee of you want it and wasting their money. Just my two cents", "score": 2, "replies": []}, {"body": "Here is the link to the patent.\n\nBasically they want ship to a local distribution centre the thing most likely to be bought in that area for faster shipping. \n\nhttp://pdfpiw.uspto.gov/.piw?docid=08615473&PageNum=1&&IDKey=28093C462F62&HomeUrl=http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2%2526Sect2=HITOFF%2526p=1%2526u=%25252Fnetahtml%25252FPTO%25252Fsearch-bool.html%2526r=1%2526f=G%2526l=50%2526co1=AND%2526d=PTXT%2526s1=%252522anticipatory%252Bpackage%252522%2526OS=%252522anticipatory%252Bpackage%252522%2526RS=%252522anticipatory%252Bpackage%252522", "score": 2, "replies": []}, {"body": "Well might make sense for say stuff that is already in your basket", "score": 2, "replies": []}, {"body": "That would be a good idea for them. Cause I know for a fact that If an item showed up at my door, even if I didnt want it persay its alot.more likely I'd just say \"oh this is cool\" and keep it. Itd be me constantly reminding myself that I don't need it.", "score": 2, "replies": []}]}
