{"title": "$INTC is a 10 bagger, DIAMOND in the rough.", "selftext": "[removed]", "id": "13x3i0f", "created_utc": 1685580228.0, "score": 32, "upvote_ratio": 0.66, "num_comments": 96, "comments": [{"body": "Thanks for your submission!\n\nWe love new and original content here on WSB.\n\nWe have no tolerance for basic templated memes, reposts from the front page, or boomer memes.\n\nYes, this can be a little subjective at times, but we want to show you the best WSB has to offer!\n\nIf you need some guidance, don't hesitate to reach out to modmail and we'll give you some pointers!\n\nA few tips though!\n\n• Don't just submit a chart of the current price. Come on. Google only costs $5 per search. (wait, you guys are searching for free?)\n\n• Reaction gifs are fucking lame. Put that shit in a comment, no one wants to look at your face in real life anyways so why are you making a thread about it.\n\n• Don't repost stuff. All of us are terminally online, how dare you try and make us laugh with an image posted somewhere else. Jokes aside, we don't want to beat a joke to death, so give us some fresh OC and we'll be a lot cheerier.", "score": 1, "replies": []}, {"body": "10 bags of what though?", "score": 65, "replies": [{"body": "His sad tears after he realizes he is holding INTC.", "score": 70, "replies": [{"body": "You literally made me fall off my bed", "score": 14, "replies": [{"body": "I'm dying", "score": 7, "replies": [{"body": "Who are you intel?", "score": 5, "replies": []}]}]}, {"body": "😂", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "lol!", "score": 0, "replies": []}]}, {"body": "All of it", "score": 2, "replies": []}]}, {"body": "Think this is a 2025-26 story", "score": 23, "replies": []}, {"body": "WSB hates it, so it's probably a good buy", "score": 15, "replies": [{"body": "If they get their datacenter products back on track, succeed in GPUs this time, make good mainstream client chips, succeed in being a contract fab and pay off the debt from doing that then they're an exciting combination of AMD and TSMC and maybe an Nvidia rival in the long term. It's going to take a lot of capital expenditure and low profit quarters before they get there though. So you can get -20% to 100% return on Intel over 4 years or yolo it into Nvidia ATH for -75% to 200% over the next 8 months.", "score": 1, "replies": []}]}, {"body": "Up almost 5% today. Secret’s out.", "score": 23, "replies": [{"body": "There's more, much more", "score": 2, "replies": []}]}, {"body": "So puts thanks bud", "score": 21, "replies": []}, {"body": "Always amazing how these come out after a run", "score": 11, "replies": []}, {"body": "Honestly - I don't think there's much more to fall.  Question is how long do you want to park money here while they fix shit.  Dividend is pretty minimal. They're on a nice run past couple days but they're at the lowest moment of companies history for past 20 years or so.  Pat seems invested in fixing shit, but it'll take awhile.", "score": 9, "replies": []}, {"body": "People who bought 10 years ago are breaking even. Who knows, maybe the next decade will be different ![img](emote|t5_2th52|18630)", "score": 7, "replies": [{"body": "Not really, up around 70% considering dividends. Yeah, lowest among chip producers, but not break even\n\nhttps://finbox.com/NASDAQGS:INTC/explorer/asset_price_return_10y/#:~:text=Ten%20Year%20Stock%20Price%20Total,dividend%20adjustment%20factor%20is%200.74.", "score": 3, "replies": []}]}, {"body": "![img](emote|t5_2th52|12787)", "score": 6, "replies": []}, {"body": "It’s a turn around story that will take a decade to even bear any potential fruit. This stock is going to tread water and lag the S&P and other chip stocks until then. More interesting places to put your money.", "score": 6, "replies": []}, {"body": "Let me refute you real fast:\n\n1) Intel fabs lag tsmc and samsung in the most competitive nodes.\n\n2) Sure, but so is TSMC\n\n3) No\n\n4) They lost money last quarter and recently cut divs. They probably have to cut divs again if they don't stop sucking.", "score": 25, "replies": [{"body": "I don’t know if you’re right or wrong but it’s nice to see real brain tinkering and honest discussion on this forum.  All the memes and same old jokes over and over again (“wife’s boyfriend,” “inverse cramer,” “am I doing this right?” “Cant stop wont stop gamestop,” etc) are getting depressing.", "score": 33, "replies": [{"body": "Calls on this guy!", "score": 6, "replies": []}, {"body": "Can’t stop won’t stop Cramer", "score": 5, "replies": [{"body": "Can’t stop won’t stop this guy’s wife’s boyfriend", "score": 2, "replies": []}]}, {"body": "He's right.", "score": 1, "replies": []}]}, {"body": "Didn’t NVDA make almost nothing (relative to their PE) and have YOY revenue declines?\n\nDoesn’t matter, AI", "score": 6, "replies": [{"body": "Trying to figure out what NVDA got to do with this. Oh what you meant was Pat didn't go full AI during earnings? Never go full AI.", "score": 2, "replies": [{"body": "Exactly. \n\nOnce he realizes there is a free 100% PE multiplier from saying AI at least 30 times on a call, he’ll come around, and so will the market.", "score": 3, "replies": [{"body": "yeah but the recent Q, Intel has reported a loss, and guided to an even bigger loss next Q. So what is negative P/E x 100x multiplier, does that mean essentially they have to pay me to own the stock?", "score": 2, "replies": [{"body": "Pat just didn’t realize that rAIsing tide lifts all boats. \n\nIm just saying that if NVDAs 15% YOY revenue decline is going to magically swing to a 50% gain in a single quarter based on AI, that some of that will spill over to INTC to stem their decline. \n\nBesides, they do computer-y stuff too so if anyone missed out on a 5x run and eye popping multiples on NVDA then they can take a gamble on INTC. If traders were basing their decisions in logic NVDA wouldn’t be $1T market cap chip maker with a 30% decline in their core segment (gaming) leading into a further tightening consumer market. \n\nI’m going to buy 1k shares on open along with 2 week calls and bet I’m not the only idiot that missed out but is looking to make lightning strike.", "score": 0, "replies": [{"body": "Nvda still owns gaming.  The big driver her is the TAM of AI which Nvda currently is dominating and is growing  exponentially.\n\nNvidia remains the most dominant player in the space. According to the most recent monthly hardware survey conducted by Steam, the biggest digital storefront for PC gaming, more than 76% of users own an Nvidia GPU. Competitor AMD is a distant second with nearly 15%, followed by Intel at 8.6%. Despite backlash and criticism from gamers, Nvidia’s dominance has hardly seen a dent compared to the same survey from last year. - https://www.forbes.com/sites/siladityaray/2023/05/29/gamers-are-angry-at-stock-market-darling-nvidia-heres-why/", "score": 1, "replies": []}, {"body": "AI tide does lift all boats a little, but as it currently stands NVDA is the only arms dealer in an multiparty AI arms race. Sure you can use AMD chips but that's like fighting 1980s tanks and planes against state of the art tanks and aircrafts. Intel isn't even in the conversation yet. And sure they can talk it up since they have a foundry and can make whatever chips they want, but they have lagged behind for so long that they have lost trust.\n\nBut I do agree. Intel has all the tools to go head to head with TSMC, but can it? Then they have to compete with NVDA/AMD. Basically being vertically integrated has hurt them because they have been too slow on innovation in a space that can spend on innovation, when your customers are top 4 companies in the US.", "score": 1, "replies": []}]}]}]}]}, {"body": "They hit $7B in their most recent earnings and raised their guidance to $11B for the next quarter which is over a 50% increase.  The future is what contributes to their valuation.\n\nINTC is down 40% yoy.", "score": 0, "replies": []}, {"body": "> AI\n\nEh... It's mostly hype, but there is a there, there.  The catch is that there is no guarantee that Nvidia will own that space.  Far more likely will be custom dedicated ASICS (Application-Specific Integrated Circuits), just like for Bitcoin mining.  Nvidia used to lead that space too, until they did not.", "score": 1, "replies": []}, {"body": "Yeah but their revenue estimates for next quarter were double the highest expectations. And their margins are really high. Now if they miss revenue next quarter it's probably going to be a bloodbath as they have put themselves in hypergrowth mode.\n\nDon't quote me on this part but based on forward looking estimates and current price their forward P/E was like 50-60 which is still real high but reasonable.", "score": 1, "replies": []}]}, {"body": "Cutting dividends is a never a good sign. That reason alone makes me wary of Intel.", "score": 1, "replies": []}]}, {"body": "INTC has been dead money for quite a while.  I feel it because I'm holding some.  INTC has not been producing the right chips for current market demand.  Lately they always have the wrong chip, while NVIDIA has the right one.  \n\nIs it possible that INTC will turn the corner and start racking up bigger revenue?  Sure, but when?  And how?", "score": 5, "replies": [{"body": "The US government needs intel to have cutting edge fabs in the US. They'll give blank checks if necessary.", "score": 3, "replies": []}]}, {"body": "Their gpu work is interesting. That’s all they might have going for them. Sad cause I love their CPU’s. \n\nWill not touch Intel for atleast 1-2 years.", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I liked their i7 models. Still rocking an 11th gen i7", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "And AMD could skip 3nm and go straight to 2nm for it's consumer chips in 2026. If Intel hits any delays going to 3nm they will again be on 3nm when AMD is on 2nm.", "score": 3, "replies": []}]}]}]}, {"body": "great, so I'll place a 2year leap today. thanks", "score": 1, "replies": []}]}, {"body": "Lols seems like OP doesn’t have any idea why INTC is lagging in the first place. \n\nI think Jensen said what he said to give a jab to AMD as they are fighting for market share in the server space. AMD growing lead on this area is NVIDA biggest challenge. \n\nTSM is a giant that makes chips for everyone. It’s not going anywhere either. \n\nINTC is still playing catch up since AMD launched ryzen and they are still many steps behind in manufacturing. It will take many years more to HOPEFULLY come toe to toe again with AMD provided they don’t fuck it up along the way.", "score": 4, "replies": [{"body": "Agree with you but TSM will absolutely be swallowed I when China decides it’s time to take Taiwan.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Agreed. Proof of position or ban, OP.", "score": 1, "replies": []}]}, {"body": "My unwashed nutsack has a better chance of being a 10 bagger.", "score": 13, "replies": [{"body": "$deez", "score": 5, "replies": []}, {"body": "How can i profit off that", "score": 2, "replies": []}, {"body": "Calls on vinegar", "score": 1, "replies": []}]}, {"body": "Horrible horrible idea. It will probably work.", "score": 3, "replies": []}, {"body": "More like a long hold. They’re not gonna have traction for at least a year. Wait for the AI hype to die down and a few more Qs of shit earnings… I bet you can get a real bargain then.\n\nI personally won’t touch it until $25, so there’s at least some chance of coming out even.", "score": 3, "replies": []}, {"body": "Intc is a dog and value trap.  Anyone holding this since 1999 is underwater. Anyone buying since 2015 is underwater.  \n\nJust stay away - better investments include Nvda (at its current price), Amd, ON, Broadcom, Marvell etc", "score": 3, "replies": []}, {"body": "The fact that the government wants to use your tax money to invest in Intel should tell you how bad of an investment this is. Just look at GM. Intel can barely make it as it is and now they are signing up to return a chunk of future profits back to the government. It is an awful investment", "score": 3, "replies": []}, {"body": "What was the chat gpt prompt? “Im down 100k on INTC. Help me convince wsb to baghold this shit stock”", "score": 3, "replies": []}, {"body": "They have the worst management their only hope is government money to fund the fab construction zero vision.", "score": 5, "replies": []}, {"body": ">INTC also makes GPU’s competitive with NVDA.\n\nLOL!\n\nTell me you are a homer, without telling me you are a homer.", "score": 7, "replies": [{"body": "They should've added \"at the mid-range\"\n\nArc has been getting better with driver updates and refinement, and is cheaper than Nvidia's offerings. They'll be going after the majority before they try competing at the high end.", "score": 3, "replies": [{"body": "Another concern at midrange is they basically just offer their high end chips at mid range prices which really cuts into their profit margins. So they can be competitive but at what cost to the company. And this isn't a service company so you don't get reoccurring revenue from having a large consumer install base. That really only comes from the data center segment. Which then leads to the heat/power problem for Intel. Their chips run hotter and use more power. For your PC gamer not that big a deal, but it's a huge deal for a data center.", "score": 3, "replies": [{"body": "> the heat/power problem for Intel.\n\nThey have some petty amazing firmware and drivers that turns off unused parts of the chips on the fly, managing thermals.  But under heavy multi-application load, yeah, heat's a bitch.", "score": 1, "replies": [{"body": "Really? I didn't know that. I feel like if they had focused on not being a foundry they might have been at the top of the US chip market.", "score": 2, "replies": [{"body": "With $63 BB in sales in 2022, I think INTC is still on top.  They are just down from $80 BB in sales in 2021. NVDA is at $27 BB and AMD is at $23 BB (up from $16 BB in '21).  And there is the issue.  Massive downside for INTC.  If NVDA and AMD continue to grab share and I don't see that stopping soon.", "score": 1, "replies": [{"body": "> if they had focused on not being a foundry\n\nIf they had been as good as Samsung or TSMC at it, that might not have been a problem or maybe have even been an advantage.", "score": 2, "replies": []}]}]}]}]}, {"body": "On no benchmarks are Intel even close to Nividia or AMD.  And AMD has the leg up on Intel in integrating GPU into the CPU.  Intel is not even really competitive any more on CPU die size, much less GPU.  Intel rode their monopoly status for too damn long. They only exist because of their tech sharing deal with AMD.  Opteron would have killed them otherwise.  Intel killed themselves with Rambus and Itanium.  Now it's all over but for the crying, and the government support.\n\nThey still do good software and firmware though.", "score": 5, "replies": []}]}]}, {"body": "I feel so bad for kids whose parents bought them Intel GPUs. They must get bullied so hard.", "score": 5, "replies": [{"body": "Bros be on that integrated graphics ![img](emote|t5_2th52|4271)", "score": 4, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|10 months ago\n**Total Comments**|436|**Previous Best DD**|\n**Account Age**|10 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: Intel is a compelling investment option in the artificial intelligence space due to its strong position in the semiconductor market, extensive technology portfolio, and commitment to innovation. The company's well-established presence in the AI market, coupled with its focus on AI-specific solutions, makes it an attractive choice for investors seeking exposure to this rapidly growing industry.", "score": 4, "replies": [{"body": "An AI writing a shorter version of an AI written text", "score": 2, "replies": []}]}, {"body": "Intel has been lagging in technical leadership - its a question of If intel can up their game. I do agree INTC is priced low and discounted. \\[might be good investment in long term\\]\n\nThey are loosing marketshare in China and SE asia: [https://secdiver.com/detail/INTC/report/SEGMENT:REVENUE:GEOGRAPHY](https://secdiver.com/detail/INTC/report/SEGMENT:REVENUE:GEOGRAPHY) \\[Need to spend more time\\]\n\nINTC definitely have margin pressure", "score": 2, "replies": []}, {"body": "Interesting idea, but so far the drop in INTC is gain for NVDA and AMD.", "score": 2, "replies": []}, {"body": "TLDR: you are a regard.", "score": 2, "replies": []}, {"body": "Yeah I'm not sure about some crazy run but selling $35 puts that expire next year, I'm game to do that. What else are you going to do with all that margin hanging out in the account?\n\nI feel like betting on it not to crash and burn is a lot more probable than it actually going up", "score": 2, "replies": []}, {"body": "LOL shitty ass DD", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Very long term and when you only want to park your money there.\nNot efficient use of money", "score": 8, "replies": []}]}, {"body": "TLDR: INTC bout to pump", "score": 2, "replies": []}, {"body": "Worst legacy company in America.   Lee Iaacocca was better.", "score": 4, "replies": []}, {"body": ">I completely agree with your analysis of Intel. They are in a great position to capitalize on the growing demand for AI-related technologies. Their strong presence in the semiconductor industry, coupled with their focus on AI-specific solutions, makes them an attractive choice for investors seeking exposure to the AI market.", "score": 5, "replies": [{"body": "AI likes the AI post, surprise surprise.", "score": 11, "replies": []}]}, {"body": "All about r/NLST bro. These old clowns gonna get hurt.", "score": 1, "replies": []}, {"body": "INTC is definitely an undervalued stock.", "score": 0, "replies": []}, {"body": "Intel is going to zero you fudging regard, so shut the fudge up and buy NVDA, still cheap AF, no cap", "score": -5, "replies": []}, {"body": "Kadarius Toney", "score": 1, "replies": [{"body": "As over hyped as INTC in this post? Yes.", "score": 2, "replies": []}]}, {"body": "10 bagger would be INTC 310+", "score": 1, "replies": []}, {"body": "https://preview.redd.it/pe5eiy30rb3b1.jpeg?width=360&format=pjpg&auto=webp&s=284fa0a13185edbd47c52af3feb8019c86a68bad", "score": 1, "replies": []}, {"body": "I don't think we will see intel run anytime soon. They've had such a bad stigma since amd overtook the market.", "score": 1, "replies": []}, {"body": "“Looks good”", "score": 1, "replies": []}, {"body": "TL;DR \"look good\" & \"friendly countries\"", "score": 1, "replies": []}]}
