{"title": "How to make big gains on ADBE earnings tonight", "selftext": "Photoshop software owner Adobe (ADBE) is scheduled to announce Q2 earnings results on Thursday, June 15th, after market close. They are a SaaS company, SaaS stands for \"Software as a service.\" A software distribution model in which a cloud provider hosts applications and makes them available to end users over the internet. We're going to be going over this in detail later. Like many other cloud-based businesses powered by AI, is poised to generate substantial cash flows in the future. Particularly, Adobe's market is expected to grow at a pace of 13% until 2030. \n\nThe consensus EPS estimate is $3.79, with total revenues between $4.75 billion and $4.78 billion. The consensus mark for the same is pegged at $4.76 billion, implying growth of 8.6% from the year-ago fiscal quarter’s reported figure.\n\nAccording to seeking alpha: \n\n* Over the last 2 years, ADBE has beaten EPS estimates 100% of the time and has beaten revenue estimates 88% of the time.\n\n* Over the last 3 months, EPS estimates have seen 19 upward revisions and 4 downward. \n\n* Revenue estimates have seen 15 upward revisions and 7 downward.\n\nThe company on March 15 reported Q1 Non-GAAP EPS of $3.80, ahead of estimates by 12 cents. Revenue of $4.66 billion was up 9.4% from a year ago and topped analyst expectations by at least $40 million.\n\n**Important Factors**\n\nAdobe’s strong focus on its Digital Media business is likely to have aided its performance in the fiscal second quarter. Growing demand for ADBE’s Digital Media Solutions, along with solid momentum across Creative Cloud and Document Cloud, is expected to have benefited the Digital Media business in the to-be-reported fiscal quarter. For second-quarter fiscal 2023, Adobe expects Digital Media revenues between $3.45-$3.47 billion.\n\n[Vladimir Dimitrov](https://uk.linkedin.com/in/vladimir-p-dimitrov-cfa-aa754932?trk=public_post_feed-actor-name), leader of the \"The Roundabout Investor\" Investing Group, wrote in a recent analysis, \"The set-up for Adobe's share price remains favourable at least in the short-run. With the narrative around generative AI gaining momentum and sell-side analysts still catching-up, ADBE could continue to outperform the broader market in the coming weeks and even months. \n\nThe rising demand for Photoshop, Lightroom and Premier Pro and solid momentum across the Adobe Express platform might have contributed well to the performance of Creative Cloud. Further, solid enterprise adoption of Acrobat and Adobe Sign is expected to have driven growth in Document Cloud revenues in the to-be-reported fiscal quarter.\n\nApart from Digital Media, strong momentum across Adobe Experience Cloud, on the heels of the rising uptake of Adobe Marketing Cloud, Adobe Analytics Cloud and Adobe Advertising Cloud, is expected to have boosted the business in the fiscal second quarter. Moreover, strength in Workfront might have been another positive.\n\nADBE expects the Digital Experience segment’s revenues to grow 13% from the year-ago fiscal quarter’s actuals. Also, Digital Experience subscription revenues are expected between $1.21 billion and $1.23 billion. Additionally, strong momentum in applications like Real-Time CDP and Adobe Journey Optimizer is likely to have been a tailwind.\n\n**Long Term Gains?**\n\nThe SaaS market is highly competitive, especially when compared to the overall Cloud Market, which is dominated by Amazon (AMZN). However, in the SaaS market, no single company holds a market share larger than 25%. This presents a significant advantage for all the companies operating in the SaaS market, as they can continue to grow without concerns about anti-monopoly laws that might put them in direct conflict with the U.S. Government.\n\nAmong the key players in the SaaS market are Salesforce (CRM), Adobe, Microsoft (MSFT), SAP SE (SAP), Oracle (ORCL), International Business Machines (IBM), ServiceNow (NOW), and Workday (WDAY). With a market share of 12.50%, [Adobe currently stands as the second-largest SaaS company, trailing behind Salesforce.](https://i.ibb.co/syLN2fb/EORPpAo.png)\n\nAs mentioned earlier, Adobe delivers its products through the SaaS model. It is projected that the SaaS market will reach a valuation of $149 billion by 2030, with an estimated revenue of $321.6 billion in 2026. The SaaS market can be categorized [into three segments](https://wetelo.com/blog/digitalization/global-saas-market-size-detailed-analysis): Business & Productivity, Transportation & Logistics, and Circular Economy. As evident, Adobe primarily focuses on the Business & Productivity segment. This specific segment is what's going to be reaching a valuation of $149B by 2030. \n\nSince 2018, [Adobe has experienced](https://i.ibb.co/php2nPr/EORPpAo.png) a remarkable revenue growth of 98%, corresponding to an annual growth rate of 16%. Additionally, its operating income has seen a significant increase of 112%, representing an annual growth rate of 18%. The majority of Adobe's revenue is derived from its [Subscription Revenue](https://i.ibb.co/M9Mk6jZ/MA7ypFK.png), accounting for 96% of the total revenue. As evident, Adobe heavily relies on subscriptions, thus necessitating continuous efforts to maintain its reputation and drive innovation in order to stay ahead of the competition.\n\nWhen it comes to operations, Adobe operates in a market that is already characterized by low capital intensity. Over the years, Adobe has consistently improved its [efficiency ratio](https://i.ibb.co/bRT3Bnv/EORPpAo.png). Moving on to the Balance Sheet section, we can see that Adobe has maintained a relatively healthy financial position. Despite numerous acquisitions, Adobe has managed to keep its [debt level relatively stable](https://i.ibb.co/BBT1K94/MA7ypFK.png). Their cash reserves experienced a staggering 172% increase from 2018 to 2020, and have since remained relatively stable, currently standing at $4.072 billion. Moving on to current assets and liabilities, [look at how](https://i.ibb.co/CztwNRp/MA7ypFK.png) Adobe successfully reduced its current liabilities following the acquisition last year.\n\nOverall Adobe is committed to expansion while maintaining its financial health. They prioritize reinvesting a certain amount of money back into the business whenever it exceeds a predetermined threshold.\n\n**Will they mention AI during Earnings?**\n\nAdobe is focusing on generative AI, introducing features like Firefly and [Generative Fill](https://blog.adobe.com/en/publish/2023/05/23/future-of-photoshop-powered-by-adobe-firefly) to enhance its product offerings and user experience. According to the [Adobe Blog](https://blog.adobe.com/en/publish/2023/05/10/adobe-firefly-adobe-express-google-bard), Firefly's launch in March marked one of the most successful beta launches in the history, generating over 70 million images within the first month. This AI-driven tool relies on a model that leverages hundreds of millions of photos, allowing it to generate both images and text effects based on provided descriptions. In [MoffettNathanson's Inaugural Technology, Media, and Telecom Conference](https://www.ibm.com/investor/events/svb-moffettnathanson-technology-media-and-telecom-conference), the management stated:\n\n> \"If you're Nike, for example, what are you going to want your teams to use? You're going to want them to use a commercially viable model that was trained in the right way, which you can talk about Firefly, plus all the assets that Nike has, right, that hopefully are stored in Creative Cloud or in our AEM system.\"\n\nTherefore, with a focus on incorporating AI into Adobe's products and services, it's easy to believe that Firefly will consist of multiple AI models in the future that will serve various use cases. This is particularly relevant in today's self-media-driven society, including millions of business owners and influencers on TikTok and YouTube Shorts, where the demand for such capabilities is rapidly growing.\n\nAdditionally, I think what makes Firefly stand out from other generative AI tools is its distinctive feature. Firefly will provide the capability to generate images that are safe for commercial use, without infringing on copyrighted materials. The management continued:\n\n> \"They wanted to be a commercially viable asset that has -- we have kind of credentials that can show that it can be used. If they want to sell it or if they want to put it on and have it being add on Instagram or whatever else, there are signals in the market that the commercial viability of assets is going to matter, just like you can't use a copyrighted image on Google necessarily on Instagram.\"\n\nIt's simple to see a comparative advantage for this functionality in the future if Firefly is able to produce copyright-free images that may be utilised directly in ongoing projects with efficiency. Firefly may be used as a time-effective AI tool, enabling users to train and enhance models using their own material, in response to the growing need for AI skills from people and businesses.\n\nIn addition to this, the company's partnership with Google's Bard expands Firefly's reach and potential for increased user engagement. So there's no reason why they wouldn't mention AI at least a hundred times. Users will be able to continue their creative journey seamlessly in Adobe Express. Firefly will enhance and showcase text-to-image capabilities within Bard, allowing users of all skill levels to describe their creative ideas using their own words and generate Firefly images directly within Bard. I believe this integration differentiates Firefly from other generative AI tools in the market, which offers users a more intuitive creative experience.\n\nThe company has demonstrated its dedication to embracing generative AI and fostering creativity among artists and content creators. Generative Fill, powered by Firefly in Photoshop (beta), will be available to the public in 2H CY2023. I think all these AI features will add value to their service, and can even be treated as a standalone subscription model. Despite a recent 32% rally due to the AI optimism, the stock is currently trading at 32x P/E TTM, which is lower than the 5-year average of 40x. Therefore, I'm bullish on ADBE.\n\n**What to do for Earnings?**\n\nGiven Adobe's [previous track record of beating consensus projections for its quarterly results](https://i.ibb.co/Mn1mnVH/EORPpAo.png), it wouldn't be surprising if the firm once again exceeded them. This, along with the compelling AI storyline, might result in a significant reaction in the company's share price. Contracts are expensive so I'll be getting a call spread. I'll be buying the 6/16 500c for a whopping $1400, and selling the 520c for $830. This means I can get the call spread for $570, offering a maximum gain of 3.6x if the stock moves up 6% - which is the average move with earnings. Keep in mind tho, this post is meant to just educate people about what we tend to look for when making an earning prediction. It by no means can be considered financial or investment advice. I've reposted this DD without any imgur links so the auto-mod doesn't remove the post.", "id": "14aa1l2", "created_utc": 1686855112.0, "score": 455, "upvote_ratio": 0.95, "num_comments": 87, "comments": [{"body": "The thesis for going long ADBE is simple:\n\nThis sub has almost 14mm followers, and 99% of the people that post “gain” porn use photoshop to entirely make up trades (or to turn their losses into profits) for fake internet karma. If ADBE can get just a fresh 10% of this sub to start posting “gain” porn, that equates to almost 1,400,000 new customers. \n\nAll in calls.", "score": 290, "replies": [{"body": "Thesis only works if you ignore that 99% users of Photoshop are using a pirated version", "score": 66, "replies": [{"body": "wait, is there a not pirated version ?", "score": 37, "replies": []}, {"body": "It's cheaper to just buy a new laptop when the malware you downloaded with that sketchy keygen eats your computer alive.", "score": 5, "replies": [{"body": "Keygen lmaooo dude is stuck in 2005", "score": 14, "replies": []}, {"body": "cuz one can't read the comments on a torrent before downloading?  reinstalling an operating system is illegal?  backups are for pussies?  anti-virus is unholy?", "score": 9, "replies": []}]}, {"body": "To use the ai generative fill you can’t use pirated version as it connects to internet", "score": 1, "replies": []}]}, {"body": "what?? Most of the gain porn is fake? This is news to me 🙄🙄", "score": 7, "replies": [{"body": "Same", "score": 5, "replies": []}]}, {"body": "Lol love this", "score": 3, "replies": []}, {"body": "Yes, Mr.Gensler. This one.", "score": 1, "replies": []}, {"body": "Had me there in the 1st half not gon lie lmao", "score": 1, "replies": []}]}, {"body": "HA, Nice alt CalmGains. Clever. Maybe changing accounts will break the spell of bad luck. I guess you are hoping this time you'll go 9/10 on the plays instead of 1/10. Doubt it, inversing you again.", "score": 48, "replies": [{"body": ">CalmGains\n\nis this the guy that lost most ER after posting?", "score": 20, "replies": [{"body": "Yes, it's the one and only.", "score": 11, "replies": []}]}, {"body": "Their old account got deleted lmao", "score": 15, "replies": []}]}, {"body": "So many words ![img](emote|t5_2th52|4640) puts or calls ![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4259)", "score": 43, "replies": []}, {"body": "Where’s the TL;DR? I’m too regarded to read this", "score": 24, "replies": []}, {"body": "Are you formerly known as WSB CRAMER ??? I saw ur old account got deleted but this writing style is the same", "score": 15, "replies": [{"body": "It is, the old one is calmgains, this one is aggressiveprofits", "score": 1, "replies": []}]}, {"body": "i have a 100% track record of losing every trade, as such i've decided to buy ADBE stonk because my spy puts are fried, thank you my good friend, this can only go well for us", "score": 15, "replies": []}, {"body": "450c & 500c  6/23 🚀🌚👽", "score": 18, "replies": [{"body": "Yolo'd 18k into the 500c... 🙃", "score": 10, "replies": [{"body": "For 6/16? Wat was your cost basis?", "score": 2, "replies": [{"body": "For 6/23... was not cheap so this after market shit isn't helping 😥", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|8883)", "score": 1, "replies": []}, {"body": "6/23 490c. You holding thru holiday weekend?", "score": 1, "replies": []}]}]}, {"body": "printing?", "score": -1, "replies": []}, {"body": "Nice", "score": 1, "replies": []}, {"body": "did you end up profitting?", "score": 1, "replies": []}]}]}, {"body": "Guys you have 3 minutes left to buy puts cause i just dropped 10k on calls. Sorry in advance.", "score": 14, "replies": [{"body": "Why did I listen to you.....", "score": 5, "replies": [{"body": "Idk you’re supposed to inverse wsb", "score": 4, "replies": []}]}]}, {"body": "$480 6/30 x20 locked and loaded", "score": 13, "replies": [{"body": "congrats", "score": 4, "replies": []}]}, {"body": "Wish i saw this 30 mins ago good play", "score": 13, "replies": [{"body": "Same here .. Given everything thats been happening, calls on ADBE was the play, but it slipped my mind entirely that ADBE is reporting this week.", "score": 4, "replies": []}]}, {"body": "Sold an OTM put expiring tomorrow for a few bucks.", "score": 5, "replies": []}, {"body": "You’ve convinced me to buy puts", "score": 15, "replies": [{"body": "Ouch", "score": 19, "replies": []}]}, {"body": "I'm more curious as to why your original account got suspended, but it was a good thing since you finally won for once and can now no longer be WSB Cramer", "score": 5, "replies": []}, {"body": "Calls 600", "score": 6, "replies": [{"body": "Dooo it", "score": 2, "replies": [{"body": "I did..", "score": 3, "replies": [{"body": "Nice.  I think 525-600 🚀🌚👽", "score": 3, "replies": []}, {"body": "how wud it be the 600 calls? will it get paid?", "score": 1, "replies": [{"body": "Guess we’ll find out tmrw.", "score": 2, "replies": [{"body": "Hope it will, i swung 600 calls", "score": 1, "replies": [{"body": "I don't think adbe went up enough for you to be up on the calls...", "score": 2, "replies": []}, {"body": "When’s your expiration", "score": 1, "replies": []}, {"body": "Weeklies though", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "adbe 512 after hours. congrats gang", "score": 8, "replies": []}, {"body": "Always like your post. No one can be 100% but well thought and summarized report ^^^", "score": 3, "replies": []}, {"body": "I think a \"beat\" in earnings is what we want but to avoid the \"crush\" after earnings we need an increased earnings outlook or forcast. Some stonks even play games with this so ever other time the future looks amazing and the price goes way up. ADBE has everything we want and no sketchy ups and downs.", "score": 3, "replies": []}, {"body": "Won't IV get you though?", "score": 5, "replies": [{"body": "Only if you don't read ti'll the end.", "score": 1, "replies": []}]}, {"body": "Congrats OP", "score": 4, "replies": []}, {"body": "Well I got world record screwed on docu straddle earnings play last week.  Literally worst vol crush in docu history.  But good luck buying calls", "score": 2, "replies": []}, {"body": "Wow calmgains to aggressive profits hmmm", "score": 2, "replies": [{"body": "Can't wait until PassiveAggresiveLosses", "score": 1, "replies": []}]}, {"body": "This aged like milk", "score": 2, "replies": []}, {"body": "I’ve been fucked by every earnings I’ve played. Looks like I’m going all in", "score": 71, "replies": [{"body": "Puts it is for me", "score": 4, "replies": []}]}, {"body": "so did i miss the boat on this, or do you expect the price to rise further?", "score": 1, "replies": []}, {"body": "They mentioned AI...shocker.", "score": 0, "replies": [{"body": "Adobe hasn’t innovated since 2016. Why did TikTok become so popular? It made video editing easy and it encouraged people to share. Adobe is not going to be around for much longer.", "score": -4, "replies": [{"body": "I hear ya...my kids both use Photoshop because it's taught in ComTech at school.  They installed it on my Mac Pro and I can tell you as a software engineer for 20+ years...the app looks and works great, but it is the worst app to install on your computer.  It installs over 15 services where you will NEVER be able to get rid of, even after uninstall.\n\nI agree, Adobe is shite.", "score": -1, "replies": []}]}]}, {"body": "Everybody pirates photoshop therefore your claims don't make sense", "score": 0, "replies": []}, {"body": "It appears you were right", "score": 0, "replies": []}, {"body": "Oh god yeah this is calm gains fuck off", "score": -2, "replies": []}, {"body": "I am fcked bcoz Op bought C", "score": -1, "replies": []}, {"body": "You want gains? Hit the fucking gym", "score": -1, "replies": []}, {"body": "Step 1: Don’t listen to OP", "score": -5, "replies": []}, {"body": "[deleted]", "score": -11, "replies": [{"body": "Explain?", "score": 4, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "Yea the end of my post, I suggest a 500/520 call spread. I expected an increase of 4-6%.", "score": 2, "replies": []}, {"body": "Wat do u mean toast?", "score": 1, "replies": [{"body": "6/16 OTM calls going to be worthless. Debit spreads were the play or just buy the stock for the IV crush proof.", "score": 2, "replies": []}]}]}]}]}, {"body": "Screw it, I'm in", "score": 1, "replies": []}, {"body": "Fuck I meant to look into this yesterday and forgot", "score": 1, "replies": []}, {"body": "I read some sentences, I don’t think chat gpt wrote this", "score": 1, "replies": []}, {"body": "Why did you make new account?", "score": 1, "replies": []}, {"body": "A serious question, with the advent of AI, Midjourney, Runway etc. are taking over. Sure Adobe's generative fill is awesome but other AI apps can do the same too. Is there any moat that Adobe has over them?", "score": 1, "replies": []}, {"body": "Pass", "score": 1, "replies": []}, {"body": "Is it gone already?", "score": 1, "replies": []}, {"body": "Took a 10K L on Adobe 510 calls this morning ☹️☹️☹️ FUCK I WAS SO EXCITED LAST NIGHT", "score": 1, "replies": []}]}
