{"title": "[deleted by user]", "selftext": "[removed]", "id": "14bnory", "created_utc": 1686997969.0, "score": 5, "upvote_ratio": 0.56, "num_comments": 95, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 2, "replies": []}, {"body": "What do you mean expecting profit? I don’t understand", "score": 45, "replies": [{"body": "He is probably in the right thread as he is so regarded", "score": 2, "replies": []}]}, {"body": "I would wait and sell at a loss", "score": 45, "replies": [{"body": "Sounds good I’ll try that", "score": 12, "replies": []}, {"body": "Great tax advice", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 62, "replies": [{"body": "And make sure the 0dte buys are way otm... you know, just in case it moons", "score": 13, "replies": []}, {"body": "Why does it sounds like something I did with nvidia ![img](emote|t5_2th52|4640)", "score": 2, "replies": []}]}, {"body": "You have two narratives:\n\n1. Tesla the future tech company of mobility and energy\n\n2. Tesla the overvalued car company\n\nIf 1, hold. If 2, sell.", "score": 15, "replies": [{"body": "1 ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)1/2", "score": 1, "replies": []}]}, {"body": "Profit?\n\nWe don't do that here.", "score": 27, "replies": []}, {"body": "All im saying its they want it past $300", "score": 9, "replies": []}, {"body": "It's the weekend.  You should probably wait until the markets open Tuesday.", "score": 15, "replies": []}, {"body": "In summary. The individual has no idea what they are doing. By chance bought it half way and made some profit. Now emotion is kicking with the fear of missing out. If the shares go up they will kick themselves. If it goes down they are scared to lose money.\n\nAnswer? It is your money. No one knows if it will continue to go up or if it will be a sell off. If in doubt sell off what you can afford. Also, keep what you can lose.", "score": 16, "replies": [{"body": "Who are you talking to in the 2nd person? People like you make me want to live in the woods.", "score": -29, "replies": [{"body": "Nothing wrong with living in the woods.", "score": 25, "replies": [{"body": "Amen.  Sent from a logging road in Shasta.", "score": 3, "replies": []}]}, {"body": "People like you... regard, welcome home, now be quiet and listen. They gave you advice like you asked, while explaining to the other regards what your regarded ass was trying to say...", "score": 19, "replies": [{"body": "This one deserves the hard T me thinks", "score": 3, "replies": []}, {"body": "Who?", "score": -2, "replies": []}]}, {"body": "You should fuck off that's what you should do", "score": 1, "replies": [{"body": "I didn’t ask", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": 17, "replies": [{"body": "That’s why I’m asking in advance bigman", "score": -11, "replies": [{"body": "Inverse your instincts. Asking the ether of reddit what to do with Tesla stock is like screaming at a pygmy marmoset about the difficulties in using CRISPR to improve the human condition while operating within the moral guidelines of society. \n\n`SQUEAK`\n\n\n\n#but how can we make super soldiers without human trials and experimentation??!", "score": 7, "replies": [{"body": ">screaming at a pygmy marmoset about the difficulties in using CRISPR to improve the human condition while operating within the moral guidelines of society.\n\nHmm does this belong on r/oddlyspecific or r/brandnewsentence?\n\nNow that's a wsb question.", "score": 2, "replies": []}]}]}]}, {"body": "But the cyber truck will easily double TSLA stock!!! ![img](emote|t5_2th52|4258)", "score": 9, "replies": []}, {"body": "I bought Tesla in the first round before it hit crazy.  \nI made double and sold, then it went up x10.  \nThis time round I bought on the stock split day a couple years ago, it’s taken that long to break even after the dive and now I’m up 35-40%?  \nYou might have to wait awhile because you bought high.  Maybe cash out when you’re even, or hold long like 5+ years if you can.", "score": 4, "replies": [{"body": "I did the same thing", "score": 1, "replies": []}]}, {"body": "I would say don’t sell I feel like Tesla will continue to trend upwards. If your happy with profit along the way sell some shares on the way upwards. If your not in for long term take profit now, but if your in for long term let it ride while selling some on the way up. Personally from volume in this market I feel we continue upwards till middle or end of July then things may get choppy. Especially with election year coming.", "score": 3, "replies": []}, {"body": "We’ve all been there, but you need to quickly learn to develop a strategy and stick to it, it doesn’t have to be super complicated, in fact my Assessments before buying is very basic, often is biased by the particular company I’m buying, as in, do I actually think it’s a good company, what are the doing next, what’s their cash reserves, are they innovative, so when stocks drop you simply hold. But sounds like you’re bringing a lot of emotion into trading which is not good.", "score": 3, "replies": []}, {"body": "how is that profit", "score": 2, "replies": [{"body": "What’s profit? Please explain", "score": 6, "replies": []}, {"body": "I can reinvest it to acquire more shares when the price drops ?", "score": -2, "replies": [{"body": "that's a loss first though", "score": 7, "replies": [{"body": "I mean it’s equal at the moment but I’m assuming the stocks going plummet again", "score": -4, "replies": [{"body": "Didn't you say it's half the price from when you bought", "score": 7, "replies": [{"body": "He did, but it is $260 now and hasn’t been over $400 in five years. Don’t know if it ever has been anywhere near 2x current.", "score": 1, "replies": [{"body": "It was $414 at the end of 2021.", "score": 1, "replies": [{"body": "According to the Schwab chart, the high close was 381.67", "score": 1, "replies": [{"body": "Nov 5, 2021 is showing between $407.26 and $414.49 depending on which chart I’m looking at.", "score": 1, "replies": []}]}]}]}]}, {"body": "So you're going to pay taxes on something you broke even on which means you're in the negative just so you can hope the price drops to do it over again and more than likely get caught in the same cycle again? I like you.", "score": 1, "replies": [{"body": "Lmao", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Seems you have thought about this, it’s always good to take profits when you can. Tesla is a volatile stock. Can crash 20% in a day can go up 20% in a day. It’s had a massive run up so far, I myself would sell any stock after a massive run like that. Everything has to consolidate eventually, you don’t want to repeat the same mistake over again, holding on to long. There will always be another opportunity to buy back in.", "score": 2, "replies": []}, {"body": "\"Half your original buy price\"....\"sell expecting profit\"...\n\nthis does not compute", "score": 2, "replies": [{"body": "What if his base currency devalued rapidly against $?", "score": 1, "replies": []}]}, {"body": "Sell it before too late!!!", "score": 3, "replies": []}, {"body": " I'm going to sell now and take profits, while the getting is good.", "score": 3, "replies": []}, {"body": "its never a bad idea to take profit", "score": 2, "replies": [{"body": "How do you do that?", "score": 3, "replies": []}]}, {"body": "I wouldn’t sell Tesla that’s me though.", "score": 1, "replies": []}, {"body": "If u up good, why not locking some profits? Unless u re long on tesla then close ur app and dont look for a few years", "score": 0, "replies": [{"body": "That’s what I was thinking tbh. Worse case is I miss out on a couple hundred.", "score": 0, "replies": []}]}, {"body": "Could the money you invested in telsa be better invested elsewhere?", "score": 1, "replies": [{"body": "I would probably reinvest it straight into the Tesla when the price drops. I’ve got more in my portfolio but I have faith in the stock so I’m looking to have money it in longterm.", "score": -6, "replies": [{"body": "Just leave it in there? But I don't know. You do you. You seem to have a plan.", "score": 5, "replies": []}, {"body": "Omg buddy...I hate to make you feel dumb...but if you see tesla doing well long term why touch the money? You'll just make your cost basis higher", "score": 3, "replies": [{"body": "Yeah I was thinking of just holding but wanted to see how everyone feels about it the stock yknow.", "score": 1, "replies": [{"body": "Bro,\nNever Change a running system.\n\nPlace a Stop los and forget about tesla", "score": 1, "replies": [{"body": "what if that makes me go past my day trade limit for the week", "score": 1, "replies": []}]}]}]}, {"body": "It’s a pretty bad feeling to sell expecting to enter at a lower price, only to see it keep climbing, and a lot of times that does happen\n\nIs tesla overvalued right now? Idk, but it’s a pretty profitable company that just locked down the North American market for electric vehicle charging and has a bunch of projects coming down the pipe over the next couple of years. I wouldn’t bet against it, unless the overall market drops", "score": 2, "replies": []}, {"body": "odds are against you that you will time that correctly, if tesla is your only play just hold that shit and buy more if it does drop. Having said that, its generally not a good idea to put all your eggs in one basket and if you can't find any other companies trading at a value in this market you probably should just let someone manage your money for you.", "score": 1, "replies": []}, {"body": "You have faith in it but want to bet on a dip? Sell now, buy puts.", "score": 1, "replies": []}]}]}, {"body": "For selling for profit this is not the right sub", "score": 1, "replies": []}, {"body": "Buy more![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "They are gonna tell you to keep and add but try r/TSLA you could challenge them..... \"r/TSLA convince me not to sell\"", "score": 1, "replies": []}, {"body": "Starry Kevin Hart, so hard seven hug mommy wants to strangle you sleep for one hour", "score": 1, "replies": []}, {"body": "At the last shareholder meeting Elon did warn investors the next 12 months will be rough. what it looks like, nobody knows.", "score": 1, "replies": []}, {"body": "If you are scared sell. If not don’t.", "score": 1, "replies": []}, {"body": "Yeah duh", "score": 1, "replies": []}, {"body": "If your looking for quick money then sell and take profits. This things going to trade sideways for the next month between $265-$240 before a steeper pullback and new lower trading zone for the following few months before pushing above current highs. Stocks don’t go straight up forever, they do what stocks do. Take your profits, unless your willing to hold for the next year and a half to two to see zones $500 and above.", "score": 1, "replies": []}, {"body": "Taking profit is never the wrong answer.", "score": 1, "replies": []}, {"body": "This guy reminds me of somebody that posted about a month ago. They were down 80k and nvidia was getting ready to share their earnings report. He let everybody know to short it. TLDR; I want to know what this guy does, so I can do the opposite.", "score": 1, "replies": []}, {"body": "It's going to 300, though, sell now if you want", "score": 1, "replies": []}, {"body": "If you sell we are grabbing your shares lol", "score": 1, "replies": []}, {"body": "Here is what you should do. Sell the entire position then use options to give yourself exposure at way less capital outlay. \n\nLet's say you have 100 shares. At 260 you would have $26,000 after selling. An at the money call 1 year out will cost you about $6000 dollars or 23% of your cash for the same exposure (1 contract corresponds to 100 shares). Now there are risks here (theta, etc) but if you are bullish on TSLA and want exposure while freeing up your cash then this is the way to go. Just accept the risk of theta slowly eating away at the value potentially until 0. The tradeoff for you is considerably less capital is at play.\n\nMy 2c -- if you do this then buy a put way OTM (like 150). Your cash outlay will be greater but if TSLA shits the bed from a terrible earnings, bad recession, etc then you have some protection.", "score": 1, "replies": []}, {"body": "classic psychology mistake that losing traders make; holding on to losing trades way too long, and cutting winners the second you break even out of fear the price will never be back there again.", "score": 1, "replies": []}, {"body": "Make sure to lock in the loss and immediately violate the wash sale rule. You’re doin great", "score": 1, "replies": []}, {"body": "Market is closed m8", "score": 1, "replies": []}, {"body": "I dream about a day when all crypto will be extinct and all crypto bros will take the streets protesting then getting back to their shifts at Wendy’s", "score": 1, "replies": [{"body": "😂", "score": 1, "replies": []}]}, {"body": "I bought Tesla when it was $290 a share. I bag held it and kept buying more to average down, but it kept dropping. \n\nI got it down to an average of $218 a share. I then sold this past week and never looked back. Made a small profit, but it took over a year to materialize. Am I happy? Hell yeah", "score": 1, "replies": []}, {"body": "Sell its gonna drop\n Or 🚀 to the 🌙", "score": 1, "replies": []}, {"body": "I sold for a $6500 profit. Profit is profit", "score": 1, "replies": []}, {"body": "Sell calls at the price you think it'll go down to, can't go tits up !", "score": 1, "replies": [{"body": "position or GTFO", "score": 1, "replies": []}]}, {"body": "Sell enough to take out your initial cost and let the rest ride", "score": 1, "replies": []}, {"body": "If you think it’s at the peak, go all in by selling your shares now and then shorting it.", "score": 1, "replies": []}, {"body": "Sell TSLA and buy leaps", "score": 1, "replies": []}, {"body": "Why sell Tesla? What other opportunity do you have that is better than Tesla at this time??", "score": 1, "replies": []}, {"body": "Don’t ask us for sound financial advice", "score": 1, "replies": []}]}
