{"title": "How to trade AMZN for less than the price of one share", "selftext": "Noticed a bunch of noob questions about options. Thought I would outline an example of a credit spread in the form of a bull put, for any of you that have mastered the FD and are looking to expand your playbook. \n\nSome benefits of the bull put spread: Your risk is defined and you will know going into the trade how much you can make or lose. Also, when putting on a credit spread, the credit goes into your account right away. This will be your max gain and your goal is to keep all or most of it. \n\nWhy a bull put spread: Choose a stock that you are bullish on. Rather than being an option buyer, you are selling the expensive put option (the short leg) and buying the further out and cheaper put as a hedge (the long leg, without this it’s a naked put and your risk is unlimited).  \n\n[Here is a credit spread on AMZN that I opened on May 8th.](https://imgur.com/a/LKdeiQi) I sold the May 18th 1600 put for $2,758 and bought the 1590 put for $2,279 as protection. I received the difference, or $478 as a credit to my account. \n\nAnalyze and manage your position. If AMZN closes above 1600 this Friday, I will keep the entire credit. If AMZN is at $1595, I break even. If Amazon drops, the most I can lose is $522 (the difference of the spread 1600-1590 times 100 minus credit of 478). [Here is the P&L chart for the position. ](https://imgur.com/a/1v2yVwG) Notice that theta is now your friend, as long as AMZN stays above 1600. \n\nAnd that’s how you can use options to trade Amazon and only risk a few hundred bucks. If this helps anyone, I can share some other trades and strategies. ", "id": "8j46wt", "created_utc": 1526222236.0, "score": 287, "upvote_ratio": 0.94, "num_comments": 88, "comments": [{"body": "To add on...consider selling longer term bull put spread (30 days +) to get better advantage of Theta decay and then sell them early or when you hit a certain % profit for better success rates. ", "score": 109, "replies": [{"body": "Upvote and I completely agree. I have longer dated credit and debit spreads on AMZN as well as small OTM NQ put position as a hedge. I shared this trade as I know people here like the weeklies and I am very bullish for this upcoming week, I see AMZN at 1625-1650ish by this Friday. ", "score": 50, "replies": [{"body": "Will work until Trump tweets about AWS subsidizing Amazon Retail.", "score": 2, "replies": []}, {"body": "Why are you bullish this week? I know nothing.", "score": 1, "replies": [{"body": "I feel Amazon has lagged a little in the NQ run up last week. Looking at the charts it looks to me like it was consolidating and is coiled for a run. Also looks to me like the indices are mooning this week, strong earnings, easing China tensions, etc. \n\nEdit: also looking for the government to announce AWS contract within a week, I think the deadline is the 20th, so that may or may not come into play by Friday. ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 36, "replies": [{"body": "It is interactive brokers", "score": 1, "replies": []}]}, {"body": "Yea I've been doing this since I watched the intro to options series on Tastytrade. I go about 45 days to expiration and close them when they get to 50% max profit. Sure, it may not be as fun as buying faggy d's, but with this strategy I have successfully managed to not lose all my money.", "score": 7, "replies": [{"body": "What kind of profits have you been seeing?", "score": 1, "replies": [{"body": "Started with 5k about a year ago and sitting at 6k right now. I'm starting to get more confident with my trades and see more consistent returns. The first 6 months I was basically just breaking even.", "score": 3, "replies": []}]}]}, {"body": "So you wouldn't always keep this trade going to expiration? I'm retarded. Can you elaborate a bit more on the scenario where you would sell early?", "score": 7, "replies": [{"body": "Let's say you sell a bull put spread for a $100 credit, 40 days until expiration. \n\nLet's say stock has a strong move within 10 days in your favor (the stock goes up). As a result, you may be able to close the spread for $50 10 days into the trade. This will be possible because the put you sold is now much more out of the money and will be able to bought back more cheaply. Additionally, the whole position has experienced theta decay in your favor (since the decay on the put you sold is greater than the decay on the put you bought). \n\nAt this point, it is in your best interest to close the position since you achieved 50% of your max profit in only 25% of the time of the trade. Over the long-run, closing trades early can boost your probability of success 10+% overall. ", "score": 18, "replies": [{"body": "And how do you close a put you sold? Just buy the same one at a discount?", "score": 3, "replies": [{"body": "Exactly.", "score": 2, "replies": []}]}]}, {"body": "Because you take the tendies outta the fryer before they get burnt. Pigs get slaughtered. Take. The. Profit. And. Run. ", "score": 9, "replies": []}]}, {"body": "You could also do a poor mans covered call. Buy ITM calls way out and sell OTM calls like a month out, you can do something like that every month. ", "score": 1, "replies": []}]}, {"body": "Works until trump tweets. A few weeks ago trump knock 4% off amazon by saying they don’t pay enough for mail", "score": 30, "replies": [{"body": "Right after the next tweet I will be putting these on like crazy. Free money. I’ve actually closed these out in a day or two for sweet gains after the Trump tweets on Amazon. Obviously, you’re right and nothing is completely risk free. ", "score": 20, "replies": []}, {"body": "Then you get to buy the shit out of some calls", "score": 2, "replies": []}]}, {"body": "A naked put isn’t unlimited risk....max risk is if the stock price goes to 0 minus premium received. Stock shares can’t be worth less than 0. You’re thinking of a naked call which is unlimited risk because the stock price could keep going higher. ", "score": 21, "replies": [{"body": "Truth. Should have said greatly limited. Takes max loss from 160000ish to 500ish. ", "score": 14, "replies": [{"body": "Also it looks like that trade has a strong probability of biting you in the ass. Less than a 1% move down and you’re at max loss. I would roll it forward or close it out if I were you. ", "score": 8, "replies": [{"body": "Any trade can become a losing trade. I believe the one I discuss is now at 60% chance of max profit. Also, I don’t think Amazon is going down by 1% this week. We will see, but thanks for the tip!", "score": 4, "replies": [{"body": "Did you take my advice and cash out yesterday?", "score": 3, "replies": [{"body": "No I did not. Retail sales were so good the 10 year spiked and I’m going to sell the king of internet retail? I think not. \n\n[I did however double down with 2 more credit spreads @ 1585/1570 for $775 each expiring Friday](https://imgur.com/a/RP7g8RV) ", "score": 1, "replies": [{"body": "Dude I’m hella bullish on AMZN as well (seriously check my post history) but we’re talking about options that expire in three days. We could very well trend down for the rest of the week and shoot back up the next. Why wouldn’t you just go a month out.  At least then you would have more Theta to burn.\n\nWe could very well end above $1600 Friday and I hope we do, but from a risk/reward perspective this was a stupid play.", "score": 2, "replies": [{"body": "Thank you for your kind wishes. I also hope we are above 1600 on Friday!\n\nMy thesis remains or I would have gotten out. We just had what, 8 green days in a row? Today didn’t scare me, if this continues into tomorrow and Thursday I’ll reevaluate. \n\nI posted my other positions that I put on last Friday, mostly bullish on tech and short natural gas. I also mentioned that I bought two OTM NQ puts as a hedge. I closed those out today for enough profit to cover any losses if this week doesn’t turn around. Obviously I don’t want to throw out money and I’ll take the AMZN trade off Thursday if I don’t see it happening. I’ll probably also add another hedge on a pop up (short NQ or ES).", "score": 1, "replies": []}]}]}]}, {"body": "how do you manage it if it does start to go below the 1590, assuming you still have time on the put ? ", "score": 2, "replies": [{"body": "You can't use the put for profit, otherwise your shorted put becomes uncovered.", "score": 3, "replies": []}, {"body": "You would just put in the opposite order if your theory or assumptions changed. So buy the leg you’re short and sell the leg you’re long. Never pay more than your max loss. The more time until expiration, the better chance of getting out unscathed. ", "score": 2, "replies": []}, {"body": "If it's tanking you may be able to buy back the original put at a higher premium and hold onto your safety put. Kind of like pulling your parachute cord and dollar bills come flying out with the parachute.", "score": 1, "replies": []}]}]}]}, {"body": "If you end up holding the bag for amazon it's not really a loss in my opinion. You're getting it at a discount.", "score": 1, "replies": []}]}]}, {"body": "Too bad it don't work on Robinhood unless you have at least the starting BP", "score": 5, "replies": [{"body": "True, but you don't have to do this with AMZN", "score": 2, "replies": [{"body": "True but gotta cash in on that sweet premium", "score": 2, "replies": []}]}]}, {"body": "So does the long leg protect you in the event that the put you are writing is exercised?\n\nAlso, how is buying power affected? Looking at your trade in Tastyworks, it says that buying power would be decreased by $160k. How does this impact your trading account?", "score": 3, "replies": [{"body": "This trade is in an IRA account that can’t have naked positions, another reason I like these spread trades. Do you have both legs in when looking at TW? Your BP reduction should be $521 with the credit you received. You will probably have to keep the full $1000 (spread difference as margin requirement but this will include the credit received). ", "score": 6, "replies": [{"body": "This does not negate the possibility of early assignment.", "score": 2, "replies": [{"body": "Well only if AMZN goes below 1600 and even then the chances of early assignment is slim. If that happened just sell the shares. ", "score": 2, "replies": []}]}, {"body": "Yeah my bad I was looking at my cash account, on a margin account it calculates correctly at $521.", "score": 1, "replies": []}]}, {"body": "I forgot to mention that the spread I put on will only net you $375 right now because I put in on last week and I’m up $100 as of now. \n\nI also have a couple TastyTrade accounts, although my example was done in Interactive Brokers. [Here is a July 20th 1610/1600 AMZN credit spread viewed in TW. ](https://imgur.com/a/tmk8UZO) ", "score": 3, "replies": []}]}, {"body": "What's the difference to a bull call spread besides receiving a credit?", "score": 5, "replies": [{"body": "A bull call spread is a debit spread where you pay, but you have defined max gain.\n\nThere are 4 spreads, 2 debit and 2 credit you can do.\n\nBullish on the stock, credit with puts, debit with calls.\nBearish on the stock, debit with puts, credit with calls.\n\nA debit spread is really just a cheaper version of buying options to save premium, but limits your max gain (which is kinda the point of faggy D's that we all love).", "score": 4, "replies": []}, {"body": "well for example you would choose one or the other in order to take advantage of potentially mispriced options. if all options are overpriced (i.e. IV too high in your opinion) then you would rather sell the ATM (or closer to ATM) option as that will be the most overpriced (vega greatest ATM) and buy the OTM option as that will be \"less\" overpriced relative to the ATM. in a bull put spread, with stock X at 60, you are selling the 60 put and buying the 55 put. so you're selling \"high\" and buying \"low\". \nnow if all options are cheap (i.e. IV is too low in your opinion) you're better off buying the ATM option (as it is the most cheap, in a sense) and selling the OTM. that's what is going on in a bull call spread - e.g. stock X @ 60, buy ATM 60 call sell OTM 65 call.\nif all options are priced accurately in your opinion then the consideration of the credit is the only major difference i can think of. i spoke in a general sense here but it comes down to identifying which options are best to buy and which you want to sell - the most expensive ones (in relative terms) you want to sell so you set up a spread that involves selling that one and lets you take a directional opinion.", "score": 3, "replies": [{"body": "How do you determine if an option is cheap?", "score": 1, "replies": []}]}]}, {"body": "Guy who’s been trading options for one week gives advice to guy who’s been trading options for 1 day", "score": 5, "replies": [{"body": "It’s actually been two weeks, so.... ", "score": 3, "replies": [{"body": "Your post says trade amzn with less money than a share then you talk about opening a credit spread on it, how much did it cost you to open all the legs in that position ", "score": 0, "replies": [{"body": "As stated, it cost me nothing besides $522 buying power reduction. I actually took in $478 when I put the trade on. ", "score": 3, "replies": [{"body": "*bought the 1590 put for $2279*", "score": 0, "replies": [{"body": "When you do both legs at the same time, you take them both into account. The net is a credit. That’s why it’s called a credit spread. \n\nI’m not telling anyone to do this, and if you don’t like it, move on. Just here to share ideas, learn, and get a yacht. ", "score": 6, "replies": [{"body": "You would need at least the 2.7k on hand to open this position without margin in just calling you out for the clickbait title, if you don’t have 1.6k in an account you wouldn’t be able to open this position ", "score": -1, "replies": [{"body": "You’re just wrong. ", "score": 9, "replies": []}, {"body": "realize you’re selling a position simultaneously.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "What never seems to get mentioned and is hugely important is if the stock closes in-between your strikes. In this example of a credit put spread, your long put won't help you if AMZN closes at 1595, as an example.\n\nThe wider your strikes the more credit you collect but the more you're at risk of the stock closing in-between them and getting fucked. Credit spreads don't truly have the limited risk of the spread amount like a debit spread", "score": 5, "replies": [{"body": "If Amazon closes at 1595, and I’m short the 1600, I’m out 500. But since I took in 478, I’m down 22 bucks. NBD, right?", "score": 2, "replies": [{"body": "That put you sold at 1600 is in the money at 1595 and at risk for being exercised. If AMZN stays above 1590 - the put you bought - by expiration, you are completely exposed to the put you sold.\n\nIn other words, the long put at 1590 could expire worthless and be useless as downside in this example. If you get exercised, you'd have to buy 100 shares of AMZN at 1600 with no help from your long put", "score": 3, "replies": [{"body": "They both expire the same day. If I was put the shares of AMZN and my long put wasn’t used, Amazon is above 1590 and 1600. My max loss of $522 still holds. It might sound scary but this outcome is easily settled, sell the shares. ", "score": 2, "replies": [{"body": "If you have $160,000 lying around that might not be an issue. Your broker would likely buy and sell right away if you can't cover, but it may piss off their risk department depending on how many contracts you sell and your account size. If you sold 10 contracts, that's $1.6 million they have to pony up for you\n\nAlso worth noting that owning the shares outright puts you at risk of a change in prices in the underlying for the full amount. Say you're put the shares and the stocked gapped down 5% on bad news before you could sell. You'd be out $8000", "score": 4, "replies": [{"body": "Yes they would liquidate in that case I’m sure. Still don’t see the issue. I have been assigned early and never had an issue. Doesn’t change the trade or max profit/loss. ", "score": 2, "replies": [{"body": "Check out the guy on here who got put $22 mil of SPY for something like this ", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "One question, the bid ask spread for options are often abusive. Do you hit the bid or the ask everytime or do you play mid? Give us some execution strategies please ", "score": 3, "replies": [{"body": "I go to middle or better. If it doesn’t fill, I’ll catch another trade. ", "score": 4, "replies": []}]}, {"body": "Real men go naked. No spreads bruh. ", "score": 3, "replies": []}, {"body": "Nice ! This is well explained. Perfect for fag noobs like me.", "score": 5, "replies": []}, {"body": "Soooo how do I turn my Robinhood account into a Yacht?", "score": 2, "replies": [{"body": "FD's my guy, FD's. Either yacht or broke.", "score": 1, "replies": []}]}, {"body": "Great,  I’m going to go short AMZN now.", "score": 2, "replies": []}, {"body": "This did help and I would love to read any more Options ideas you have. What are FDs? I see people talking about them all the time but dont know what it stands for. ", "score": 2, "replies": [{"body": "Faggot Delights. Out of the money options that expire in a few days, usually selected from weeklies. It’s the WSB scratch ticket and works the same way. \n\nEdit: forgot to mention they’re called that because they usually end up screwing you in the butt, which people here seem to enjoy. ", "score": 1, "replies": [{"body": "Haha, I feel so stupid for thinking it was an actual technical term... forgot where I was. Thanks.", "score": 2, "replies": []}]}]}, {"body": "Downside risk selling puts is capped by the floor, 0 btw, its not unlimited. Just being pedantic. ", "score": 1, "replies": [{"body": "I realize I misspoke about that. Should have said greatly limited downside risk. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "No, because risk is defined. That’s why I can do this in an IRA. You need level 3 options though, I believe.  ", "score": 2, "replies": []}]}, {"body": "In number of shares just put .1 obviously ", "score": 1, "replies": []}, {"body": "What platform are you using for that P&L chart? Thanks", "score": 1, "replies": [{"body": "OP replied in another comment already, they used [this](http://www.optionsprofitcalculator.com/) ", "score": 3, "replies": []}]}, {"body": "I call bull put...", "score": 1, "replies": []}, {"body": "Can someone explain to me what happens when the stock expires expires in between the strikes? \n\nIt seems like your buyer on the higher Sell (Short) would exercise (since strike price 1600 > stock price 1595 for example) on you, but your long would be OTM and thus wouldn't exercise to cover your liability. \n\nWhere am I thinking about this incorrectly?", "score": 1, "replies": [{"body": "You’re thinking is correct. You would need to cover the difference, if you held until expiration. You would use the money from selling the spread and or some of your own, if needed. In your example, if it expired at $1597, you would be out $2x100 or $200. Hopefully the credit you received would cover or you should have sold by then. ", "score": 2, "replies": [{"body": "I see, but if it expires at 1597, wouldn't the buyer of my put sell exercise and thus I would have to buy 100 shares at 1600? I guess I'm not seeing how my long put which expired worthless is able to cover me such that I only have to pay $200 instead of 160000+", "score": 1, "replies": [{"body": "Yes, you would buy them at 1600 and sell them at 1597, so you’re out $300, I had it backward in last reply. \n\nEdit: unless you had the cash in your account to hang onto the shares and wanted to. ", "score": 2, "replies": [{"body": "got it thanks!\n", "score": 1, "replies": []}]}]}]}]}, {"body": "Where did you create the P/L chart?", "score": 0, "replies": [{"body": "[I used optionsprofitcalculator. ](http://www.optionsprofitcalculator.com) ", "score": 4, "replies": []}]}]}
