{"title": "Intel Initiates $10 Billion Accelerated Share Repurchase Agreements", "selftext": "[https://finance.yahoo.com/news/intel-initiates-10-billion-accelerated-213100409.html](https://finance.yahoo.com/news/intel-initiates-10-billion-accelerated-213100409.html) \n\nA little good news after getting absolutely destroyed the last three weeks with calls.", "id": "icxd33", "created_utc": 1597874080.0, "score": 69, "upvote_ratio": 0.93, "num_comments": 75, "comments": [{"body": "I’d much rather see Intel investing that $10b in making their products more competitive. They’ve struggled for several years with their fabs and this sends a signal that they don’t think they can use this extra cash to help address their problems.", "score": 97, "replies": [{"body": "Intel has a Boeing problem.", "score": 31, "replies": [{"body": "Hey I'm new so sorry for the stupid question. What was the boeing problem ?", "score": 4, "replies": [{"body": "spent their money on stock buybacks instead of actually creating good quality products", "score": 15, "replies": []}, {"body": "TLDR got too comfortable due to their past success", "score": 3, "replies": []}]}, {"body": "Maybe consider looking at a 10K before writing something idiotic as that. Intel's BS, CF and P&L are top notch and not comparable to Boeing.\n\nAlso Boeing is overleveraged whereas Intel has a massive amount of cash on hand and marketable securities in their BS (could cover easily cover all of their St-debt).", "score": 2, "replies": [{"body": "The problem I was referring to wasn't Boeing's financial condition, it was a complete lack of leadership by beancounting management who aren't quite sure what a \"semiconductor\" even is. The fact that Intel is spending billions on stock buybacks while they fall further behind in performance is indicative of late stage bureaucratic rot.\n\nEdit: To be constructive rather than purely critical, I've compiled a short list of ways Intel could have spent $10B that would make me more likely to invest:\n\n- Research and development \n\n- Making 10nm actually work\n\n- Hiring Jim Keller, giving him a blank cheque \"Skunk Works\" style business unit, and letting him do his own thing\n\n- Paying down debt\n\n- Literally anything BUT stock buybacks and diversity programs", "score": 2, "replies": []}]}]}, {"body": "Mee too. I personaly don't like buybacks. Investors might be happy but Long term investors would rather see better CPUs", "score": 18, "replies": [{"body": "Your're assuming it's an either/or proposition. If you're already throwing many billions at R&D, it's not a given that chucking more will do any good. As an investor, I like this buyback, as it's a sign that they believe the share price is materially undervalued.", "score": 7, "replies": []}, {"body": "long term investors realize that intel has a great deal of good products in the pipeline.  The short to mid term is being hampered by some bad luck/bad decisions. Short /mid term, a buyback gives a little life to the stock.", "score": 3, "replies": []}]}, {"body": "True. I'm long AMD, but it's not like there's R&D problems with Intel. They have solid plans, just can't execute them with manufacturing.", "score": 6, "replies": [{"body": "That kind of sounds like a problem they should be investing heavily in fixing..", "score": 7, "replies": [{"body": "Not sure more money can fix this type of problem.", "score": 4, "replies": []}]}, {"body": "Yup, I think their chip architecture is still better than AMD's but if you stuck behind in node manufacturing it won't matter how good your chip architecture is. They just now fully transition to 10nm while TSMC is already at 7nm and moving on to 5nm soon. While these numbers cannot be compared 1:1 Intels 10nm is still slightly behind TSMC's 7nm although not by much but Intel is falling more and more behind.\n\nI would see 2 options that would give Intel a huge boost:\n\n- Scrap your own Fabs and just go with TSMC / Samsung etc. That would mean chip manufacturing would be at an even level with AMD and the better chip architecture will win out. Think NVIDIA/AMD.\n\n- Invest huge amounts of money (talent / equipment etc) into chip manufacturing so that you finally catch up with TSMC / Samsung etc\n\nIf they don't catch up with chip manufacturing nodes they will lose more and more marketshare and could actually go out of business at some point (unlikely though)", "score": 1, "replies": []}]}, {"body": "Maybe. But buying $10bn of shares shows their confidence in the stock, and how undervalued it is compared to the intrinsic value. \n\nLong INTC.", "score": 11, "replies": [{"body": "They’ve done ~$27b of buybacks since 2018 (excluding this), while watching AMD and NVDA leave them in the dust. This buyback acceleration will give the stock a short term bump (which also benefits any staff/mgmt who want to sell shares), but competitiveness of product is what will decide their share price over the longer (5-10y) term.", "score": 26, "replies": [{"body": "People criticized Apple too, but that aged like milk lol", "score": -6, "replies": []}]}, {"body": "🤣. Its insanely undervalued for a reason, investors are starting to lose hope.", "score": 3, "replies": []}, {"body": "Or they want to look like it. Like a publicity stunt.", "score": 1, "replies": []}]}, {"body": "I agree in spirit, but I'm not sure these problems are something that can be solved with money. They have plenty of cash, the issues seem operational.", "score": 2, "replies": []}, {"body": "lol, money can't solve everything.", "score": 2, "replies": []}, {"body": "\\+1 as a long term investor here :/", "score": 0, "replies": []}, {"body": "Lol same thoughts", "score": 0, "replies": []}, {"body": "Robert Swan owns roughly 300,000 shares. Just cos of this news, he made more than half a million dollars. https://www.barrons.com/articles/intel-ceo-robert-swan-bought-stock-51596837759", "score": -1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "That 0.5% gain was just cos of premarket. If Intel's share price goes to pre-covid level, he will make $6million.", "score": 0, "replies": []}]}]}]}, {"body": "It speaks volumes that they think their biggest problem is their stock being undervalued. \n\nNVIDIA, AMD, ARM, coming at them hard. Amazon getting big into cloud. Intel gonna lose a lot of business in the next 5-10 years, but they made some dudes in WSB with about to expire calls happy I guess?", "score": 12, "replies": []}, {"body": "I literally was going to buy Intel yesterday because I thought it was undervalued, but decided to wait until my next pay check because I just went on vacation....", "score": 9, "replies": []}, {"body": "Very good news. This was a great dip - almost 3 weeks, even better than in March! It's funny to now see articles suggesting that it's is undervalued and the overselling was irrational, when every major news source was trashing the stock just a few weeks ago during the peak pessimism. Just goes to show that you need to stick to your conviction and judge by facts and numbers, not emotions.", "score": 14, "replies": [{"body": "Let’s be real they write what gets clicks, not actual analysis lol", "score": 11, "replies": []}]}, {"body": "[removed]", "score": 11, "replies": [{"body": "Having a number's guy at an already established business is nothing unusual. The company is already mature and has its clientele locked in place. These people engage in trying to improve margins and cut costs, similar to what sony did a couple of years ago.", "score": 1, "replies": [{"body": "[removed]", "score": 8, "replies": [{"body": "You're right, they have to start innovating in order to be competitive. However Intel does not have the \"choice\" with Bob Swan at the helm.", "score": 1, "replies": []}]}]}]}, {"body": "This isn't good.", "score": 4, "replies": []}, {"body": "AMD *drop mic*", "score": 5, "replies": []}, {"body": "So that's how their stock peaked $50 a share today...", "score": 2, "replies": []}, {"body": "It seems like most of these comments don't realize how massive Intel's R&D current budget is. Intel's R&D budget has been constantly $13B/year which is more than AMD's revenue/year to put it in perspective. Throwing a lot of money at something doesn't always solve problems. I would prefer some strategic acquisition to help diversify their revenue more but management probably doesn't see anything good deals because given their past they are clearly not gun shy.\n\n&#x200B;\n\nManagement had this plan before COVID and they had good quarters that produced a lot of cash so it makes sense to go back to it.", "score": 2, "replies": []}, {"body": "Good for short term swing trades I guess. My medium term outlook still remains bearish. This is what companies do when they can't keep up with actual innovation anymore.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "Jesus christ. These fucktards are losing ground to AMD every single day. They have had 5 years to counter AMD's advance, and they've dropped the ball. Now, instead of innovation, they're going to waste 10 billion on absolutely meaningless buybacks? \n\n&#x200B;\n\n10 billion down the drain.", "score": 3, "replies": [{"body": "Just like Teldar Paper.", "score": 1, "replies": []}]}, {"body": "That’s awesome. I was thinking they were underpriced here recently, and was thinking of buying some. This news put me over the edge and I just went in AH and picked some up. GLTA!", "score": 2, "replies": []}, {"body": "It would be more profitable for them to put that $10B into AMD shares.", "score": 2, "replies": []}, {"body": "Meh its a way to pump a stock but their cash will be depleted...  stock price will be worth same... stupid move.... better off putting that money into R&D", "score": 1, "replies": [{"body": "At some point you can’t just keep pumping money into R&D. It doesn’t work like that. Intel has a lot of cash on hand...", "score": 5, "replies": [{"body": "Yes it does work like that, more money accelerates a lot of things.", "score": -7, "replies": [{"body": "Throwing money at a problem does not always work.  Intel's r and d budget is massive already", "score": 3, "replies": [{"body": "Buy your own stock is stupid.... cash on hand when you are behind technical difficulties so much more important", "score": -4, "replies": [{"body": "Go read through their financials... They are flush with cash. 10b is nothing.", "score": 3, "replies": [{"body": "This honestly just looks bad", "score": -1, "replies": [{"body": "you realize that corps. do buybacks all the time right?  This isn't some weird new thing intel just thought up.", "score": 2, "replies": [{"body": "Yep", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I think they are already putting a ton in R &D", "score": 2, "replies": [{"body": "But still behind soooo obviously not enough investing in growing output or scaling new processes. Or even better yields at new nodes.", "score": 0, "replies": [{"body": "I assume you’re some gamer who bought an AMD GPU and are now of the understanding that the entire world is gonna switch to AMD, but you’re mistaken. \n\n10b in buybacks for a company that has spent more on R&D than AMD’s revenue over the last decade is nothing.", "score": 1, "replies": [{"body": "Been investing and following/involved with tech my whole life.  I’m a electo-mechanical engineer with an mba.  I literally do R&D, product development, and scaling to manufacturing.\n\nI get it on paper intel seems amazing but they have truly sucked for about 4 years because they haven’t made strides to the next node size while tsmc is leap frogging them.  It will become much more apparent very soon because new hardware coming along is significantly more efficient while they are still sitting on their hands.  People are adopting other designs.  Apple is going away. And others are moving to AMD.\n\nFor investing intel is just so so.", "score": 1, "replies": []}]}]}]}]}, {"body": "Remember when GoPro did this when their shares were like $18?\n\nLOL!", "score": 2, "replies": [{"body": "Apples and oranges. \n\nIntel is a highly profitable company that is still growing every year, but suffering from a couple of manufactering issues. \nGoPro is struggling to make a profit and their product is something only a small audience buys.", "score": 5, "replies": [{"body": "I am talking about 6 years ago, GoPro was profitable, and maybe even still growing. AMD is absolutely going to shrink their business, and their leadership is below average.\n\nTwo big red apples.", "score": 1, "replies": [{"body": "GoPro made about 100m in profit in Q4 of 2014. In every other quarter after that they either had negative earnings or just barely turned a profit. \n\nIntel has no issues at all with making fat profits, and they will continue to do so.\n\nStill apples and oranges.", "score": 1, "replies": [{"body": "It was 100MM after doubling revenue for 3 straight years IIRC, so it showed astronomical growth at the time whereas Intel now shows slippage, and should continue to for many years.\n\nI see AMD as a much larger threat to Intel than smartphone cameras were to GPRO, but that’s just my opinion.", "score": 1, "replies": []}]}]}]}]}, {"body": "And the stock will still do nothing. Maybe they could you know get their shit together. That would be nice.", "score": 1, "replies": []}, {"body": "Use that 10 bil to buy ARM😋", "score": 1, "replies": []}, {"body": "I got in on the dip - AMD did pop off but Intel got undervalued and panic sold back then. They've got solid finances and while AMD legitimately did some great stuff Intel was definitely getting sold short by super kool gamer memers who don't realize that their personal fandom of AMD products doesn't equal the company's performance as a whole.", "score": 1, "replies": []}, {"body": "Is there a way to calculate how much of a bump this would likely give the existing share price?", "score": 1, "replies": [{"body": "Nah. Depends on volume and which way it goes tomorrow. Only time will tell haha", "score": 2, "replies": []}, {"body": "I'm holding intel and I'm not expecting much from this. smells a bit too much of desperation. Perhaps a tiny short term bump. Investor sentiment is just too negative about their long term prospects. Im still bullish on intel but they need to really focus on innovation and streamlining.", "score": 1, "replies": []}]}, {"body": "Sounds like they should acquire someone instead seeing how they have no future and all.", "score": 1, "replies": [{"body": "They bought two companies this year already.", "score": 2, "replies": []}]}, {"body": "So...buy AMD.", "score": 0, "replies": []}, {"body": "Awesome news for intel", "score": -1, "replies": []}, {"body": "My roth thanks all the AMD cucks that bought all the Intel puts ive been selling. And just sell put credit spreads bro better chances than just straight calls.", "score": -4, "replies": [{"body": "Whats a put credit spread", "score": -5, "replies": [{"body": "Take 2 position. 2 puts or 2 calls. \n\nSell the one with a closer price point which is worth more. Buy one a bit farther out which cost less. You make the difference. \n\nIf it never hits the strike price, you keep the difference. If it hits the strike price you total loss is the difference between the 2 positions.. \n\nHope that makes sense. Typing on mobile. \n\nTry to google a video and then do what they do on Robinhood. Easiest way to learn.\n\nCredit spread is safe and boring :). But makes money. Slowly but surely..\n\nCall option is where all the excitement is at... already done $6000 in 2 weeks very exciting...", "score": 3, "replies": []}, {"body": "vertical credit spreads can be done with puts or calls. its like a selling a naked put or call but you buy a buy or call that has a further strike than the one you sold. this guarantees that you wont blow up your account selling contracts. they have better odds because time is usually on your side and good stocks like intel has more chances of going up or sideways generally", "score": 2, "replies": []}]}]}, {"body": "Ugh. Should've gone straight into R&D or capital equipment for forge. Or hell even tooling.", "score": -1, "replies": []}]}
{"title": "346$ to 33,349$ in six months.", "selftext": "https://imgur.com/6btUOt7\n\ndecided to try this shit out mid march, with half a paycheck and a dream. Started out buying puts and then calls on hyg and xlf cause 300 bucks dont buy shit. First big win was ZM puts, that last big spike was 1500 tsla calls, and me being autistic afterwards. I've been pretty good at going back to even, consistency is key.", "id": "icdrn7", "created_utc": 1597798609.0, "score": 441, "upvote_ratio": 0.96, "num_comments": 73, "comments": [{"body": "Take out your $300 initial investment so you don’t lose it!!!!!!", "score": 669, "replies": [{"body": "😂", "score": 128, "replies": []}, {"body": "Calls on him losing it all...including the $300", "score": 53, "replies": [{"body": "yup. OP going to get fucked", "score": 14, "replies": []}]}]}, {"body": "The next Warren buffet! Teach us the way Sensei", "score": 149, "replies": [{"body": "YOLO all day everyday, tis the way", "score": 126, "replies": [{"body": "Weeklies?", "score": 22, "replies": [{"body": "Is their anything else?", "score": 70, "replies": [{"body": "I'm all in on weeklie VXX calls.", "score": 18, "replies": [{"body": "Buy after the nasdaq reaches 11700, it is at 11400..", "score": 6, "replies": [{"body": "Too late", "score": 2, "replies": []}]}]}, {"body": "Show us your trades?", "score": 1, "replies": []}, {"body": "they're*", "score": 1, "replies": []}]}]}, {"body": "You ever get girls sending you nudes?", "score": 2, "replies": [{"body": "....like for free? no.", "score": 2, "replies": []}]}, {"body": "This is the way", "score": 1, "replies": []}]}, {"body": "One of the sperm always makes it to the other side.", "score": 21, "replies": [{"body": "The baby still gonna be special though", "score": 1, "replies": []}]}]}, {"body": "CONGRATS. this is peak wsb but somehow you have the green mode on", "score": 97, "replies": [{"body": "I like it a lot better than red mode, I don't understand why everybody doesn't turn it on.", "score": 76, "replies": [{"body": "If you are winning means someone is losing.", "score": 15, "replies": []}]}]}, {"body": "Now lose it all and do it again so we know you’re legit", "score": 44, "replies": []}, {"body": "Nice. Absolutely not retarded.", "score": 24, "replies": []}, {"body": "What’s your next move?", "score": 14, "replies": []}, {"body": "Teach me bb gurl", "score": 16, "replies": []}, {"body": "ZM stock has ~6 down days in the past 5 months and you hit on it.\n\nPretty damn impressive/lucky, yada yada", "score": 7, "replies": [{"body": "Tbh, im pretty sure i was just doing what i was reading on here at that point 😅", "score": 10, "replies": []}, {"body": "Zm has 6 down days in August alone", "score": 1, "replies": []}]}, {"body": "You forgot to add the part where you are 14 years old and drive a yellow Ferrari because your dad wanted to borrow your lambo this weekend.", "score": 7, "replies": []}, {"body": "Buy the dip", "score": 5, "replies": []}, {"body": "Well done, keep up the good work.", "score": 6, "replies": []}, {"body": "So you had one huge banger to go from like $500 to $24k and then you’ve done worse than QQQ since then? Cool", "score": 35, "replies": [{"body": "This is WSB, not old man investing in QQQ for a safe future.", "score": 42, "replies": []}, {"body": "Show us your graph lmao", "score": 10, "replies": []}]}, {"body": "Great job, but a little bit of advice.  Pull out about $10k or so.  I only say this because the same type of autism that lets you go from $346 to $33,349 in 6 months is the same time of autism that will let you go from $33,349 to $3.49 in 6 days.   Of course, i'm not sure why I'm typing this because the same type of autism will never let you withdraw money when you're up.", "score": 5, "replies": []}, {"body": "Congrats brother", "score": 3, "replies": []}, {"body": "Curious about plans for the PSTHU calls you've got.\n\nLong game or waiting for a near term pump?", "score": 5, "replies": [{"body": "the calls are definitely for the near term, Im fairly confident that this will double at some point within 6 months. Ackman already had a shortlist of targets before they went public so I dont think itll take too long for an announcement of somekind and their is quite a bit of hype behind it. \n\nSo with that, I've now got a 3000 unit position, if it hits 30 with a pump I'll be selling off a thousand shares for a 10kish profit, and if it ends up hitting 40 I'll be selling the calls off for around 15-18k profit. That way I'll be able to keep 2k shares long term without anything on margin. Of course things can change but that's the current plan.\n\nAnd if it dips to around 21 again afterwards, I'll be putting all those profits back into it and margin myself to the tits again", "score": 3, "replies": [{"body": "I've got a smallish unit position and Sep calls. I'm hoping the calls print on a bump before the units split, but I may have cut it too close. That action is less than a month away.", "score": 2, "replies": []}]}]}, {"body": "The only thing I like is the username.", "score": 6, "replies": []}, {"body": "On that first big win: can you go over it. How many contracts, and how long did you hold for? I would appreciate it.", "score": 3, "replies": [{"body": "I think I held for like a week and a half, dont really remember how many contracts it was since I just yolo'd my entire account (it was around 1500-2000 at that point). Honnestly, I had no idea what I was doing back then (still dont) and I'm pretty sure I got that stupid otm play from this sub.", "score": 15, "replies": []}]}, {"body": "Dad, is that you? I’m home dad.", "score": 3, "replies": []}, {"body": "congrats.", "score": 3, "replies": []}, {"body": "Ibkr?  A real broker for a real autist", "score": 3, "replies": []}, {"body": "Great job. You lucked out and hopped in at a theoretical bottom. Now you're going to be biased in all your plays cause you think you're a genius. Gonna blow all your shit out in any other environment.\n\n\nSee ya in the breadline.", "score": 3, "replies": []}, {"body": "Name checks out", "score": 2, "replies": []}, {"body": "Congrats and fuck you!", "score": 2, "replies": []}, {"body": "I took 300 to $5000 now, up like a little over 1400%. Will be back when my peen is this large. Mark my mfin words", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Don’t", "score": 3, "replies": []}]}, {"body": "Prouda ya little one", "score": 1, "replies": []}, {"body": "Take out $3k. In the long term it won’t affect your potential gains much but if you blow up your account you’ll at least have a 1000% profit still", "score": 1, "replies": []}, {"body": "IBKR - niceee", "score": 1, "replies": []}, {"body": "I'll be impressed when you turn that 35k into 8 mil.", "score": 1, "replies": [{"body": "Will do!", "score": 1, "replies": []}]}, {"body": "We've seen the first half of this story only..\n\n(hopefully j/k OP, just be careful and realize you won some dice rolls)", "score": 1, "replies": []}, {"body": "IF I were you I'd take out half so you don't have any regrets and just yolo the rest until you get 1.5 mill or you lose it. Retirement or bust baby", "score": 1, "replies": []}, {"body": "I didn't think people made money on here.", "score": 1, "replies": []}, {"body": "...and thats on \"timing\"", "score": 1, "replies": []}, {"body": "Real question is, how many nudes did OP get.\n\nWhat is your next play?\n\nOr are you going to spend it.", "score": 1, "replies": []}, {"body": "your full paycheck is less than $700?", "score": 1, "replies": [{"body": "Paid weekly", "score": 1, "replies": [{"body": "oo ok.  I thought u were an indentured servant for a minute", "score": 1, "replies": []}]}]}, {"body": "Consistency is not key. Risk management is.", "score": 0, "replies": []}, {"body": "So, what made you buy when you did?", "score": 0, "replies": []}, {"body": "Lol dude makes money in biggest bull run in history. NO WAY", "score": -24, "replies": [{"body": "It's rare to see in here tbh", "score": 10, "replies": [{"body": "Do you not see all the retards making money in here right now?", "score": -12, "replies": [{"body": "Do you not see me pulling my cheeks apart in your face", "score": 4, "replies": []}]}]}, {"body": "Dont worry ill send you some tendies once i hit a mil bb 😉", "score": 9, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "he probably lost money during the biggest bull run in history or something.", "score": 15, "replies": []}]}]}]}
{"title": "Equities are UNDERVALUED. There is not bubble.", "selftext": "A bunch of low IQ, broke 20 year olds that got a B- in econ 101 downvoted this post I made 3 months ago.  \n\n [https://www.reddit.com/r/options/comments/gacpc6/more\\_premium\\_in\\_puts\\_than\\_calls\\_credit\\_spread/](https://www.reddit.com/r/options/comments/gacpc6/more_premium_in_puts_than_calls_credit_spread/) \n\nwell look who's laughing now?  I've made insane gains and now I'm back making another post destined to be called \"gay\" and \"retarded\".\n\nFirst how do we define a bubble?  Let's say it's when one asset class has more capital allocated to it than should be.  Let's then look at the total number of cash on hand versus the total amount of money in the stock market.  The ratio of MZM money stock (cash on hand) vs total money in the market right now is 2:3.  In 2000 it was 1:5, and in 2008 it was 1:4.  This means the market is UNDERALLOCATED.\n\nNow lets look at the supply/demand side.  The 10 year note has a yield of <1%, which means stocks are the only thing in town that has yield, and cash flow has a natural tenancy to follow yield.  That means that right now there is record cash on the side lines and nothing to buy with it but stocks.  Therefore every dip will be bought.  A P/E of 15 with 10 year note at 5% yield makes sense, and so does a P/E of 25 with the yield at .7%. \n\nWe have to look at the entire money supply/bond market/equity market cap complex to determine if there's a bubble, not some retarded p/e ratio or gdp number with no other context.  I know a lot of people here are 19 year olds that watched the big short and think that they're the next Michael Burry, but we have to face the hard data and have an honest discussion, without bias, on if a bubble actually does exist.   \n\nAnd before you even try to get cocky down in the comments I'd encourage you to buy my put spreads.  I've been selling them to you for 3 months now and I'm sitting on bigly gains.", "id": "icq2n3", "created_utc": 1597851770.0, "score": 20, "upvote_ratio": 0.61, "num_comments": 75, "comments": [{"body": "gay and retarded", "score": 80, "replies": []}, {"body": "[deleted]", "score": 41, "replies": [{"body": "How?  J powell isnt rasing rates till 2025", "score": -18, "replies": [{"body": "[deleted]", "score": 23, "replies": [{"body": "Mzm isnt going down anytime soon, there is not timeframe perspective needee", "score": -9, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Yup.  Hows shorting been going for everyone here?  Not well.", "score": -9, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "How bout from this day on?  Ill pm you what put spreads im selling and you can tske the other side.  Talk all you want but its all cheap until you get $$$ involved.", "score": 0, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Im selling 337/336 puts this friday, keep shorting and youll get run over", "score": -3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Alright bubble boy", "score": -1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Who's J Powell ? I think you mean jpow right", "score": 8, "replies": []}, {"body": "How do we even know j pow will still be around by then...", "score": 2, "replies": []}, {"body": "is interest rate the only thing keeping this from popping? What if inflation runs out of control, forcing a decision between destroying the dollar vs popping the bubble? The fed doesn't have as much control of the economy as people here would like to think they do.", "score": 2, "replies": [{"body": "Short term their control is limited to the trust that people have in stonks. \n\nLong term, it will all come down to fundamentals. And like you say, higher interest rates will cause a huge capital outflow.", "score": 1, "replies": []}, {"body": "The second the Fed loses control, Congress and the Senate will immediately go balls to the wall on fiscal stimulus measures. The Republicans already proved they don’t actually care about budget deficits. It won’t be to save us, either. It will be targeted at “job creators”. \n\nStonks can’t go tits up.", "score": 1, "replies": []}]}]}]}, {"body": "Retarded and gay", "score": 61, "replies": []}, {"body": "Ray and Getarded", "score": 28, "replies": []}, {"body": "[deleted]", "score": 15, "replies": [{"body": "Sell spy put spreads.  Stay small and hedge", "score": 2, "replies": [{"body": "how hedge", "score": 1, "replies": [{"body": "Call ladder spreads on vxx", "score": 1, "replies": []}]}]}]}, {"body": "thanks for making me feel better about holding puts", "score": 13, "replies": [{"body": "You might have bought mine, thanks!", "score": 4, "replies": [{"body": "you know how unlikely that is in a market as large as this one, with literally billions of options?", "score": 4, "replies": [{"body": "Its sarcasm.  Ill help you out though.  This friday im selling 337/336 puts take the other side if you want to", "score": 1, "replies": [{"body": "i was joking. obviously", "score": 5, "replies": [{"body": "I wasnt.  Keep shorting and youll get run over", "score": -3, "replies": [{"body": "I will, thanks for the words of encouragement though", "score": 5, "replies": []}]}]}, {"body": "Is there any reason not to do this even further down the road for dates to decrease risk?", "score": 1, "replies": [{"body": "no, it all depends on your risk tolerance.  if you wanna be safe thats the way to do it", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Regay and gatarded", "score": 9, "replies": []}, {"body": "Sure sign of a bubble, people like you dreaming up weak arguments why it’s not a bubble.", "score": 7, "replies": [{"body": "Muh p/e", "score": -2, "replies": []}]}, {"body": "But p/e", "score": 6, "replies": []}, {"body": "😂😂top is in", "score": 10, "replies": [{"body": "Buy my puts.", "score": -5, "replies": []}]}, {"body": "Ticker, strike and date?", "score": 4, "replies": [{"body": "Sell spy put credit spreads that are otm, probs 1 to 3 weeks till expiry depending on your risk tolerance.  Roll it out if it gets challenged and trade small", "score": 0, "replies": []}]}, {"body": "Alright, don't you think velocity of M0 money stock and increasing public debt are important variables in your view for M0 money stock to market capitalization ratio?", "score": 3, "replies": [{"body": "Corporate debt is only up 4 trillion since 2000 and mzm is up 16 trillion.  A lot of the massive tech companies and banks are also sitting on hoards of cash.  I expect banks to free up cash for loans soon so velocity should pickup", "score": 0, "replies": []}]}, {"body": "Straight and retarded?", "score": 3, "replies": [{"body": "Thank you", "score": 2, "replies": []}]}, {"body": "Fucking ray guitar", "score": 3, "replies": []}, {"body": "Name checks out", "score": 2, "replies": []}, {"body": "No bubble when M2 money supply is up 3-4 trillion in 6 months", "score": 2, "replies": []}, {"body": "You treat all those bond buyers as suckers, but you know, many of those bond buyers aren't suckers. If they thought stocks will yield more, they would move to stocks. Bond buyers wouldn't agree to being paid less than inflation for cash if they didn't see immense risk in stocks. \n\nBanks don't lend to those who need it anymore. They stopped. Economy is reaching a screeching halt, money velocity is almost dipping below 1. Rates are stuck at zero lower bound which means there's just no reason to lend when the risks outweight the rewards.\n\nReal lending rates are always bound from below by 1/(1-default probability). Even when banks have no cost lending to people, they are always limited by the default probability - and this is independent of \"free market\" rates. When you have such a high unemployment, when those who are capable of returning loans are saving and those who aren't desperately need loans but will never get them, you get a situation where 1/(1- default probability) doesn't reach affordable interest rate for anyone who needs money, and it will halt the economy unless they give direct stimulus (which is freezing the economy even further by disincentivizing work).", "score": 2, "replies": [{"body": "positions? Smooth brain here, It seems like you're advocating cash position, jw", "score": 1, "replies": []}, {"body": "All I'm saying is that there is more yield in stocks than bonds, and so there is a natural money flow into the higher yielding asset", "score": 1, "replies": []}]}, {"body": "**I am a bot. Is this submission violating the [content guide](https://www.reddit.com/r/wallstreetbets/wiki/contentguide)? Vote below.**\n\n| **Remove It** | **Keep It** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=icq2n3&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=icq2n3&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=icq2n3)\n___\n ^comment ^will ^disappear ^--- ^32 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "score": 1, "replies": []}, {"body": "I like the way you think", "score": 1, "replies": []}, {"body": "Graytarded", "score": 1, "replies": []}, {"body": ">And before you even try to get cocky down in the comments I'd encourage you to buy my put spreads. I've been selling them to you for 3 months now and I'm sitting on bigly gains.\n\nYou should have sold naked. Even more bigly gains. Spreads are for pussies.", "score": 1, "replies": [{"body": "Naw, far greater roc with spreads", "score": 1, "replies": [{"body": "You are over leveraging your margin with those spreads? Thats the only way to get better \"ROC\" vs salling naked. Just wait until your overleveraged spread positions go against you. You cannot even roll those easily for credit because the long option acts as a drag, lowers the overall premiums. Also, if it lands in between the spreads, fun times :)", "score": 1, "replies": [{"body": "no way the margin the brokerage holds is less than the capital they hold on a defined risk spread.", "score": 1, "replies": [{"body": "I was not talking about margin. By over leveraging i mean your actual buying power vs contracts traded, if for some reason you were to get assigned the underlying, example if it landed in the middle of the spread etc. That would easily put many people in a margin call and or force liquidation. Trading spreads leaves you with less \"options\" (hehhe) to manage the trade.\n\nIt's easy to \"over leverage\" your self with spreads, common to buy too many contracts  because the initial margin requirements are lesser.", "score": 1, "replies": [{"body": "roc=max profit/total capital required to have the position.  I trade spreads 20-33% the width of the strikes.  Most brokerages hold 8% of the total required capital to hold a cash secured put, meaning very rarely will you come across a situation where spreads are less captial intensive that puts.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Did this mofo just crash the market?", "score": 1, "replies": [{"body": "Yup.  Better buy the 337/336 put spread, expiry this friday", "score": 1, "replies": []}]}, {"body": "\"There is not bubble\"\n-JPOW", "score": 1, "replies": []}, {"body": "So all in on tech stonk?", "score": 1, "replies": []}, {"body": "The economy is demand driven though.  It doesn't matter how much cash on hand a company is sitting on, if nobody is buying the products.  \n  \nEconomists had to fight tooth and nail to get enough help into the hands of the little guy during the last recession.  All republicans wanted to do was preach \"austerity\", and cry that debt would crash the economy.  Fortunately, enough jobs were saved, thanks to that debt, that the economy recovered very well.  \n  \nAfter this, it is said \"everyone became a Keynesian\".  The last of the Austrian economists gave up, admitted they were wrong in the face of overwhelming evidence, and serious academia is now all Keynesian. \n We had mountains of evidence from countries that tried austerity and failed, countries that tried tax breaks for the rich and failed, and countries that stimulated demand and won.   \n  \nInstead of learning from that, a huge number of politicians only took away one thing from 2008: StOnKs gO uP wHeN yOu pRiNT MoNeY  \n  \nThey all think that the stock market saved the economy.  No, that isn't what happened at all.  That is part of it.  We needed the stock market not to crash.  Mission accomplished.  But what saved the economy was saving jobs.  It is a demand driven economy, and we need everyone employed and buying things to save it.  That is all being forgotten right now.    \n  \nLet's just hope Biden gets in and hires enough smart people to figure it out, like Obama did last time.", "score": 1, "replies": []}, {"body": "!Remindme 2 days", "score": 1, "replies": [{"body": "There is a 1 hour delay fetching comments.\n\nI will be messaging you in 2 days on [**2020-08-21 21:28:03 UTC**](http://www.wolframalpha.com/input/?i=2020-08-21%2021:28:03%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/icq2n3/equities_are_undervalued_there_is_not_bubble/g25aazl/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ficq2n3%2Fequities_are_undervalued_there_is_not_bubble%2Fg25aazl%2F%5D%0A%0ARemindMe%21%202020-08-21%2021%3A28%3A03%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20icq2n3)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Tryna give a counter argument to the circle jerk of people talking about high p/e", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes it is, its a counter argument against a bubble.  Read the title", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Sell put spreads", "score": 1, "replies": []}]}]}]}]}]}, {"body": "show your gains", "score": 1, "replies": []}, {"body": "Super straight and smart.", "score": 1, "replies": []}, {"body": "Positions or ban this gay retard", "score": 1, "replies": []}, {"body": "I dont know who to inverse. OP or everyone else in the thread.", "score": 1, "replies": [{"body": "I posted a winning strategy 3 months ago when it was cool to be a bear.  Check the link.  The bubble boys in this thread are, for some reason, angry that im trying to help them.  Idk, you can join the winning team or watch all your puts evaporate to nothing as they have since march", "score": 1, "replies": [{"body": "I get what you're saying and can respect that you made the right move, but being bullish while the market goes up and then saying \"I predicted it would go up therefore it'll go up further\" isn't exactly proof that you're a genius.\n\nEven if we aren't in a bubble there'll be a correction at some point, and what will be the real test is if you handle that correctly and have a more sophisticated strategy than \"stocks always go up\".\n\nIf you play the next correction right you can brag all day as far as I'm concerned, we'll have to see what happens.", "score": 2, "replies": [{"body": "Its basic math and ive laid it out.  Think what you want but selling puts spreads is the way to go.  staying small, rolling out early is how you defend.  It doesn't even matter if there is a correction, anyone that follows this strategy is going to make so much money that a small loss wont even matter.", "score": 1, "replies": []}]}]}]}, {"body": "And retarded gay", "score": 1, "replies": []}, {"body": "Look, man, valuation discussion is one thing, SPY made all times with the lowest volume in months. Regardless of what you think of the fundamentals, the sentiment is shifting. It is okay if you are still bullish on stocks, euphoria can continue running for a very long time, but you gotta make your picks carefully and have proper risk control at this level.", "score": 1, "replies": [{"body": "I trade small and roll early.  If i lose on a black swan correction it wont be much, and it wont matter either because ive already made a ton off btfd", "score": 1, "replies": []}]}]}
{"title": "NVDA 510c 8/21 YOLO", "selftext": "Ok you bunch of degenerate retards! Just yolo’d on the NVDA earnings. Waited all damn day for them to come down before I bought in! \n\nNeed them earnings to be as great as promised!!\n\nEdit\n[forgot the proof](https://imgur.com/a/KD0IrFj)", "id": "icv7hi", "created_utc": 1597867392.0, "score": 28, "upvote_ratio": 0.82, "num_comments": 78, "comments": [{"body": "I’m on the other end of it. One of us will make tendies", "score": 26, "replies": [{"body": "I hope you get wrecked! 😁", "score": 7, "replies": [{"body": "Correction we both got wrecked. Theta gain won", "score": 2, "replies": [{"body": "Looked awful this morning but it’s climbing back up. Go baby go!!", "score": 1, "replies": []}]}]}]}, {"body": "gg man, rip.", "score": 23, "replies": []}, {"body": "How to maximize IV crush in one simple move", "score": 40, "replies": []}, {"body": "I'll pour one out for you later today. I'm sorry for your loss", "score": 7, "replies": []}, {"body": "godspeed autist", "score": 7, "replies": []}, {"body": "Rip to this man's calls", "score": 6, "replies": []}, {"body": "You needed NVDA to go up like 6% just to break even.   And the stock has more than doubled YTD. 3 months ago the stock did not even move 3% on earnings after spectacular numbers. I like NVDA but how plays like this make sense?...", "score": 5, "replies": [{"body": "3000 series GPUs gonna blow radeon out of the water next month\n\nOP got the direction right but fucked the timing", "score": 2, "replies": [{"body": "NVDA is a great stock, no doubt. But the yolo was a fail from the start.  I hope the OP sold in the morning. That would have been ‘only’ a 50% loss. Versus a 95% loss at end of day.", "score": 1, "replies": []}]}]}, {"body": "omg am hurting for you, mayne...hopefully it reverses in the morning?", "score": 5, "replies": []}, {"body": "Well I'm holding 9/4 500s so I hope the next 2 weeks do me right", "score": 3, "replies": []}, {"body": "Imagine being this guy and buying calls literally minutes before earnings...", "score": 10, "replies": [{"body": "Hence it being a yolo", "score": 6, "replies": [{"body": "yolos are stupid, but this is a particularly stupid one", "score": 7, "replies": [{"body": "Haters gonna hate", "score": 14, "replies": []}]}]}]}, {"body": "F", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I was totally on my way over to bring it to you but drove past the casino and couldn’t help but stop and let it ride", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Sorry dad", "score": 2, "replies": []}]}]}]}, {"body": "You are not alone..\n\n\nAt 10:51 a.m. ET, a trader bought 424 Nvidia call options with a $510 strike price expiring on Friday. The contracts were purchased near the ask price at $8.75 and represented a $371,000 bullish bet.", "score": 3, "replies": [{"body": "Well shit. Had they waited a little, they dropped to almost $5 for the same calls", "score": 3, "replies": [{"body": "If you think that was cheap, just wait till you see how cheap they are at market open!", "score": 2, "replies": []}]}]}, {"body": "Good luck fellow \"investor\" I was looking at the same.", "score": 3, "replies": [{"body": "I’m not afraid to call it a straight up gamble 😁", "score": 3, "replies": [{"body": "FUCK IT ROLL THE DICE\n\nEDIT: Fucking shit it actually worked. I should have bought too. Congrats dude", "score": 2, "replies": []}]}]}, {"body": "I made an illustration of your charitable acts to the CBOE today. Congrats on the loss. [IV Crush / Low Volume ](http://imgur.com/gallery/m6fae3Y)", "score": 3, "replies": []}, {"body": "I'll be surprised if you don't lose money tbh. The IV on aug/21 pretty much doubled this week. Theta's coming to fuck you up tomorrow", "score": 3, "replies": []}, {"body": "F", "score": 3, "replies": []}, {"body": "Proof?", "score": 3, "replies": [{"body": "Pic added", "score": 3, "replies": []}]}, {"body": "I am holding 4 of those. gl to both of us", "score": 2, "replies": [{"body": "fk I just realised I need 520 to break even due to my bad entry. and that is +7%. I am doomed", "score": 3, "replies": [{"body": "That’s why I waited so long to buy. Some of the premiums are just silly", "score": 2, "replies": [{"body": "well, rip both of us.", "score": 5, "replies": []}]}]}]}, {"body": "Rip", "score": 2, "replies": []}, {"body": "sorry dude.", "score": 2, "replies": []}, {"body": "People abusing the YOLO flair so much these days wtf. Just playing earnings on a ticker isn’t a yolo", "score": 5, "replies": [{"body": "Putting the last of my cash in that isn’t going to monthly nut, is a yolo", "score": 2, "replies": [{"body": "Nah check the rules fam", "score": 0, "replies": []}]}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/KickMeWhenImDown25 the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "screenshot", "score": 1, "replies": [{"body": "Added", "score": 1, "replies": []}]}, {"body": "Are you the 2.5M bet guy?", "score": 1, "replies": [{"body": "No I’m the 1200 yolo guy on a call that ends in 48 hrs", "score": 3, "replies": [{"body": "IV crush + Theta decay, Godspeed.", "score": 4, "replies": [{"body": "It’ll be sold tomorrow either way. Either a loss on shit earnings or gambling for tendies", "score": 1, "replies": [{"body": "Probably would’ve been better off buying SPY calls after the massive shit it took today. That’s just like, my opinion tho 🤷🏻‍♂️", "score": 1, "replies": []}]}]}, {"body": "You are not very good at this", "score": 4, "replies": []}]}]}, {"body": "And they crushed earnings!!!", "score": 1, "replies": [{"body": "Target crushed earnings. Nvidia skimmed above expectations.", "score": 1, "replies": []}]}, {"body": "Lol. My condolences", "score": 1, "replies": []}, {"body": "F", "score": 1, "replies": []}, {"body": "Thats tuff", "score": 1, "replies": []}, {"body": "Ouch [*Roblox oof*](http://imgur.com/a/e8FGGaJ)", "score": 1, "replies": []}, {"body": "You’re f’ked!", "score": 1, "replies": []}, {"body": "I bought 09/18 500s just before close. This better reverse the trend at open..", "score": 1, "replies": [{"body": "Seriously! I wasn’t looking for a 🚀, just some gains on the positive side before dumping the call onto someone else. \n\nI have faith but yet I’m retarded also", "score": 1, "replies": []}]}, {"body": "Man, should have just bought a new PC with that money.", "score": 1, "replies": []}, {"body": "Funny how you faggots take your time to make a \"yolo\" thread filled with pennies and single-digit contracts. Nonetheless, congrats on the loss, retard.", "score": 1, "replies": [{"body": "Easy to criticize when you don’t throw your bets out there. Live in your bubble little retard", "score": 3, "replies": []}]}, {"body": "So long!", "score": 1, "replies": []}, {"body": "yea that monday buy up was just too much going into earnings, totally cucked it.", "score": 1, "replies": []}, {"body": "The good thing is you started out poor so it won’t be a shock", "score": 1, "replies": []}, {"body": "Oof, ‘tis was close.", "score": 1, "replies": []}, {"body": "I dumped Thur morning when it ran up but yup, that got close to break even. Just have to take some of the TSLA tendies and try again next week", "score": 1, "replies": []}, {"body": "You should head over to smallstreetbets. also you’re retarded", "score": 1, "replies": []}, {"body": "Liar, ban", "score": -2, "replies": [{"body": "who the F would lie about $1.2k for attention, lol", "score": 8, "replies": [{"body": "Exactly", "score": 2, "replies": []}, {"body": "Apparently OP, *lol*", "score": 1, "replies": []}, {"body": "OP edited his post AFTER he got shit for not showing", "score": 0, "replies": []}]}]}]}
