{"title": "Deep dive into the technological aspect of Intel's problems", "selftext": " Since   its’ Q2 earnings call a few weeks ago, Intel Corporation (INTC) shares   have plummeted 20% upon announcement of problems with its’   next-generation 10nm and 7nm manufacturing processes. The massive   collapse has led to widespread attention among investors, but in reality   the situation has been years in the making for those who’ve been  paying  attention. Today I’d like to look at some of the technical  decisions  Intel made, why they’ve caused problems and the implications  of that on  their future.\n\n**Lithography techniques**\n\nLithography   is an incredibly complicated process that forms an incredible   competitive advantage for those who master it. In simple terms, you put a   template of circuit designs (photomask) on a silicon base (wafer) and   shine a powerful laser on it [\\[1\\]](http://www.lithoguru.com/scientist/lithobasics.html).\n\nOver   time, people tried to fit more transistors in the same area – this   would lead to increased performance capability, lower power consumption   and various other benefits outlined in Dennard Scaling\\[2\\]. This becomes   progressively more difficult over time, as you’re trying to cram   transistors into areas thousands of times smaller than the width of a   hair. The industry ran into a particularly tricky wall around the 20nm   mark, since the size of the laser you used to ‘print’ the circuit design   became so relatively big that it couldn’t reliably follow the   complicated patterns needed for all the transistors. Two schools of   thought developed to address this problem – patterning (using more than   one photomask, each with simpler diagrams, and lasering the wafer with   each of these templates separately), and EUV (extreme ultra-violet,   using radiation with much smaller wavelengths than traditional). Intel   saw success with dual-patterning (two templates) on its’ 22 and 14nm   process, and chose to go one step further and pursue quad-patterning on   its’ 10nm process.\\[3\\] Meanwhile, its’ competitors TSMC and Samsung  chose  EUV. \\[4\\] For reference, Intel themselves have also chosen to  pursue EUV  for their 7nm process. That might give you a hint as to  which was the  right choice…\n\nOther  terminology  I’ll be referring to in this piece are yield (how much of a  wafer is  actually useable) and monolithic (the whole CPU is cut out of  the wafer  as a single piece of silicon) vs chiplets (the CPU is formed  from  several pieces of silicon stuck together)\n\n**The problems with 10nm**\n\nBack   in 2013, Intel was in it’s prime. It dominated the CPU market with   >90% market share, and was pursuing a tick-tock strategy with its’   chips – every two years you would have a die shrink ‘tick’, then the   alternating years you would have a microarchitecture change ‘tock’. In   the roadmaps released by Intel, they planned to have their next ‘tock’   of 10nm in 2016. The ‘tick’ – Skylake architecture came, but the ‘tock’   never did. Even today, 4 years after it was supposed to be released,   10nm still isn’t really here. On paper, it was launched with Cannon Lake   in 2018 – but the total number of those are in the thousands, if not   hundreds. On paper, the ‘mass-market’ generation Ice Lake launched in   2020 but they have incredibly limited supply and offer inferior   performance to Intel’s own 14nm offerings. \\[5\\] The latest update is that   desktop and datacentre chips will come in the second half of 2021 –  but  for reasons we shall soon see it is my opinion that these will yet   again be flops. In fact, it is my opinion that 10nm is a total  writeoff,  and that the design decisions taken at a very early stage  have doomed  it to failure.    When you use lithographic techniques, you  are bound to  have some defects in your wafer. After all, creating  billions of  devices tens of atoms in size isn’t going to be perfect.  Patterning as a  lithographic technique inherently has a higher defect  rate than not  using it – you’re basically going through the same  process multiple  times, thus increasing the chance of defect  dramatically. As I mentioned  earlier, Intel is using quad patterning in  10nm – this means their  defect rates are going to be sky high. At the  same time, their usage of a  monolithic die compounds this problem for  high-performance, high core  count CPU models. As you can see from the  blue wafer below, it’s  difficult to draw large squares (high-core count  models) that are  without defect. In comparison, the red wafer is AMD’s  chiplet approach,  built on TSMC’s less defect-prone EUV process.\n\n(Sorry, I copied this post from my blog to not self-promote but I can't insert the relevant pictures here)\n\nSince   you can paste together multiple small CPUs into one bigger one, you  use  a far greater percentage of the wafer, cutting costs and letting  you  freely choose however many high-performance chips you want to  build.\n\nOf  course, it’s impossible  for anyone outside Intel to know the exact  numbers for the defect  rates, yields and unit costs for 10nm. No doubt  they are improving as  time goes on,as they always do with a maturing  architecture. However, I  can say with certainty that\n\n1. they are currently not yielding at rates that could let them release high core-count server chips in any volume, EVEN AT A LOSS\n2. The   margins on 10nm will NEVER reach the heights that Intel has   traditionally seen. Intel has enjoyed gross margins of above 60% for the   last decade. In my opinion, if Intel were to replace their whole   product stack with 10nm, their gross margin will never rise above 30%.   The maximum price they can release their products at is capped not only   by AMD’s offerings, but more importantly their own legacy performance.   If Intel attempted to price at a level that would give them healthy   margins, their entire product lineup would be outcompeted by their 5   year old 14nm chips on a price/performance basis, and their customers   would have no reason to upgrade, decimating their revenues.\n\nThese   are bold statements but I believe Intel’s actions over the past few   years, and their planned actions over the next few, support this view.\n\nWhen   you release a new generation of processors, you always want to have it   be ‘better’ than the previous generation. This may seem incredibly   obvious, but the only exception is when the design has such big inherent   flaws that you can’t physically do so. For instance, the Bulldozer   architecture AMD released in 2011 performed worse than their own   previous-generation Phenom II architecture \\[6\\], leading to   near-bankruptcy of the company, due to the flawed design of maximising   core counts from a belief that multi-threaded performance was the   future; while having the processor cores shares caches and FPUs,   massively reducing the multi-threaded performance of the architecture.   Intel finds themselves in a similar situation today. Their design   choices made back in 2013 mean that it is impossible to mass produce   10nm high core count chips. This would’ve been fine if their monopoly   continued and the mainstream continued to have 4 core, 8 threaded CPUs.   Indeed, they are producing Ice Lake laptop CPUs today that have 4  cores.  However, the resurgence of AMD with their high core count  capable Zen  architecture meant that Intel were forced into raising  their own core  counts to compete – there has been a doubling of core  counts across  their entire product stack, which is fine on 14nm with  its’ double  patterning, but not so much on 10nm. The limitations of  10nm mean that  current generation chips at the same price point from  Intel have 14nm  massively outperforming 10nm, with the higher core  counts outweighing  any density improvements that 10nm brings.  Similarly, leaks for the  upcoming 10nm Alder Lake desktop and Ice Lake  Xeon chips suggest that  the maximum number of cores on 10nm,28,  will  be 33-50% lower than those  from 14nm \\[7\\] – not to mention AMD’s  offerings which top out at 2.3x  the core count at half the price.\\[8\\]  The persistent lack of chips on  10nm that can outperform their  predecessors, despite us now technically  being on ‘10nm+++’, suggests  that there is a fundamental barrier in the  technology that no amount of  delays and extra engineering can get past.  10nm is rotten from the  very first steps taken.\n\n**7nm and beyond**\n\nSo   now we’ve established just how much of a disaster Intel’s 10nm process   is, what about 7nm? It should be better right? After all, its’ built  on  the superior EUV, rather than SAQP. The market obviously expects it  to  be Intel’s saviour, given the massive drop in Intel share price was   widely attributed to the ‘6 month delay’ in 7nm rollout. While I don’t   have nearly as much solid information to go on compared to 10nm, I just   want to note a few things. The exact words Bob Swan used in the Q2  call  were ‘we are seeing a 6 month shift in 7nm… 12 months behind our   internal target… we have identified a defect mode that resulted in yield   degradation’.\n\nThere’s quite a  lot  to break down here. Many people, including analysts on the call,  were  confused by how 7nm could be both 6 and 12 months behind target at  the  same time. Have Intel achieved quantum tunnelling of time? The  truth is  that Bob’s claim of a ‘buffer in planning process’ as the  reason, while  technically true, is incredibly misleading. In any  typical launch of a  new process node, you spend a few months getting up  to speed – running  the foundry through the whole process,  troubleshooting, using the  produced chips as prototypes to send to OEM  partners for them to design  products around, etc. You don’t sell the  chips produced to anyone.  Industry standard is to call this period a  tape-out, not a launch of a  new process – that’s when you actually  produce chips that you sell to  people. Bob’s comment translated is that  the process is delayed by 12  months, but they’re going to breach  industry standard and ‘launch’ 7nm  when the first fabs start spinning  up 6 months before they have chips in  any volume. Sound ridiculous?  Well, Intel did the exact same thing with  10nm. Faced with mounting  pressure over the constant delays, Intel  ‘launched’ Cannon Lake in May  2018. There was 1 CPU in the whole  generation, a dual core processor  with a clock speed of 2.2Ghz that was  slower than the i3-3250 released  in 2013 for $20 less than the 10nm  part. Not to mention it was nigh on  impossible to actually buy one.\\[9\\]  Cannon Lake was an incredibly  obvious paper launch, released to appease  investors at a time where  Intel had just started up its fabs. Ice Lake,  the first 10nm  architecture you could actually buy (in limited  quantities) shipped in  September 2019, more than a year after Cannon  Lake ‘launched’. This  ‘6-month’ delay is nothing more than an attempt to  sweetcoat a 12 month  delay (assuming no further delays).\n\nThe   second part of the comment, relating to a ‘defect mode’, is just as   interesting as the first. Intel are attempting to use GaaFeT technology   for their 7nm process, though there's conflicting information  suggesting  they might move away from this if it proves to be too  difficult. \\[10\\]  GaaFet, or Gates-all-around-Field-effect-Transistor, is  a new and  unproven transistor technology that should overcome the  technical  difficulties current transistor technologies face at  increasingly  smaller sizes. Unlike normal process shrinks, this is  going to a  completely new type of transistor and we only have one other  comparable  in history – the transistor to a 3D FinFeT technology a few  years ago.  With FinFet, the research process from having a ‘working  prototype’  demonstrating commercialisation potential took 8 years. \\[11\\]  Meanwhile,  the equivalent demonstration with GaaFeT took place 3 years  ago.\n\n\\[12\\]  While FinFeT and  GaaFeT are different beasts, it is undeniable that the  plans from  Intel, and indeed all other foundries, are incredibly  ambitious. The  latest leaks suggest that the ‘defect mode’ Intel have  ran into has to  do with their GaaFeT implementation. If this is true,  you could easily  see 7nm being just as much of a disaster as 10nm is.\n\nBeyond 7nm, there are some positives to be [found.](http://found.as/)   As we get even smaller transistors, it will be necessary for both EUV   and patterning to occur. It's likely that Intel will have an advantage   in this area compared to competitors due to their experience with 10nm.   At the same time, they are actively exploring chipletbased designs.  They  might have been late in realising the benefits, but they've  finally  come around with their EMIB, Foveros and big.Little  technologies, all of  which I'll explore in a future blog post.\n\n**Conclusion**\n\nI’ll   leave it to you to decide what the financial implications of these   deductions are for Intel, but suffice it to say the baseline scenario is   far worse than what many people envision. There is no doubt that Intel   will recover from this fiasco, but at what cost? Will it require yet   another management reshuffle? Following in the footsteps of AMD,   outsourcing production fully and writing off its’ own fabs?   Acknowledgement that they will no longer be able to extract incredible   margins from their monopolistic position?\n\nReferences\n\n\\[1\\] [http://www.lithoguru.com/scientist/lithobasics.html](http://www.lithoguru.com/scientist/lithobasics.html)\n\n\\[2\\][Dennard,    R., Gaensslen, F., Hwa-Nien Yu, Rideout, V., Bassous, E. and Leblanc,    A., 1999. Design Of Ion-implanted MOSFET's with Very Small Physical    Dimensions. *IEEE Journal of Solid-State Circuits.*, 87(4), pp.668-678.](https://web.ece.ucsb.edu/courses/ECE225/225_W07Banerjee/reference/Dennard.pdf)\n\n[\\[3\\]2019 Intel Investor Meeting Presentation, slide 9](https://s21.q4cdn.com/600692695/files/doc_presentations/2019/05/2019-Intel-Investor-Meeting-Renduchintala.pdf)\n\n\\[4\\][TSMC PR release, 10/2019](https://www.tsmc.com/tsmcdotcom/PRListingNewsArchivesAction.do?action=detail&newsid=THHIHIPGTH&language=E)\n\n\\[5\\][https://www.anandtech.com/show/15385/intels-confusing-messaging-is-comet-lake-better-than-ice-lake](https://www.anandtech.com/show/15385/intels-confusing-messaging-is-comet-lake-better-than-ice-lake)\n\n\\[6\\][https://www.techspot.com/review/452-amd-bulldozer-fx-cpus/page13.html](https://www.techspot.com/review/452-amd-bulldozer-fx-cpus/page13.html)\n\n[\\[7\\]https://wccftech.com/intel-10nm-ice-lake-sp-xeon-cpu-28-core-56-thread-cpu-benchmarks-leak/](https://wccftech.com/intel-10nm-ice-lake-sp-xeon-cpu-28-core-56-thread-cpu-benchmarks-leak/)\n\n[\\[8\\]https://www.amd.com/en/products/cpu/amd-epyc-7742](https://www.amd.com/en/products/cpu/amd-epyc-7742)\n\n[\\[9\\]https://www.anandtech.com/show/13405/intel-10nm-cannon-lake-and-core-i3-8121u-deep-dive-review](https://www.anandtech.com/show/13405/intel-10nm-cannon-lake-and-core-i3-8121u-deep-dive-review)\n\n[\\[10\\]https://twitter.com/chiakokhua/status/1288402693770231809](https://twitter.com/chiakokhua/status/1288402693770231809)\n\n[\\[11\\]https://en.wikipedia.org/wiki/FinFET](https://en.wikipedia.org/wiki/FinFET)\n\n\\[12\\][https://www.researchgate.net/publication/319035460\\_Stacked\\_nanosheet\\_gate-all-around\\_transistor\\_to\\_enable\\_scaling\\_beyond\\_FinFET](https://www.researchgate.net/publication/319035460_Stacked_nanosheet_gate-all-around_transistor_to_enable_scaling_beyond_FinFET)", "id": "i73vd2", "created_utc": 1597062372.0, "score": 441, "upvote_ratio": 0.95, "num_comments": 71, "comments": [{"body": "Can you imagine being chip manufacturer and falling **a year** behind schedule? \nI bought Intel on the dip but now I'm nervous about it. We'll see what happens.", "score": 80, "replies": [{"body": "I bought at $46 on a dip over a year ago, I was up 48%. Feels bad man.", "score": 28, "replies": [{"body": "I bought some on the dip. Still a great core holding for 10+ years. Something like AMD would be great the next 2 or 3 years.", "score": 14, "replies": [{"body": "Yep, I’m holding for the long run.", "score": 8, "replies": []}, {"body": "As long as Su who is an engineer and a CEO is running AMD, you can forget about Intel making any tangible progress. Intel CEO is starting to clean the house and reassign responsibilities. By the time they will start producing something worthwhile, it will be too late already. \n\nDo not waste your money on Intel even if it is available for a discount. I would bet my house on AMD right now. Wait until September for AMD to rocket.", "score": 7, "replies": [{"body": "Can't deny Su or the story of AMD, but Intel has market share in tons of markets as well as a future in SaaS. They will do okay until they get shit together.", "score": 3, "replies": []}, {"body": "Intel’s assets are massive and their financial situation is great. Should there be a massive slowdown in the semiconductor industry expect AMD to go down before Intel does.", "score": 5, "replies": [{"body": "People have been saying that ever since AMD was $10, which was 4 years ago. Massive slowdown ain't happening my friend. If any, the next decade belongs to the semis. Intel will follow GE's trajectory. I can't wait for people to tell Intel story to their grand kids.", "score": 0, "replies": [{"body": "TSM has already said that their capacity is close to full which would impact AMD's fabrication.", "score": 2, "replies": [{"body": "SMIC. Heard of that name?", "score": 1, "replies": []}]}]}]}, {"body": "AMD is still trading 3 times higher over earnings than any other chip maker but we are paying 3 times premium right now.\n\nA lot of the nearish futures gains are already paid for.", "score": 2, "replies": [{"body": "And that is going to continue into the future unfortunately. AMD will trade at a premium but there is no doubt that AMD will continue to outpace Intel. \n\nJust for shits and giggles, look up Su's ratings on Glassdoor. I like to invest in orgs where people love to work for their chief. Su has earned that reputation. With all the hiring and firing situation going over at Intel, employee morale will only trend downward and so will their stock price.", "score": 1, "replies": [{"body": "Their current earnings outlook does not support this. Is it supposed to rise to 250-500 time earnings? They are currently out pacing Intel on P/e by 20 times. Currently AMD is pricing in EXTREME growth. The only way for a huge run up is to massively surpass this extreme growth projection.\n\nThey have already ran into supply chain issues and I suspect that will slow them down greatly and bring the price back down", "score": 2, "replies": []}]}]}, {"body": "Bet the house on a company like AMD who is wildly overvalued with like 15 years of growth already priced in? No thanks, I'd say right now INTC is a much safer bet at its current price.", "score": 1, "replies": []}]}]}]}, {"body": "Then sell and buy AMD lol", "score": 18, "replies": [{"body": "Price. To. Earnings.", "score": 3, "replies": [{"body": "Price. To. Book. Value. (and look at AMD margins)", "score": 1, "replies": []}]}]}, {"body": "5 years, not 1.", "score": 5, "replies": []}, {"body": "bro intel makes more in a month than amd does in a year. OP is one special autist whe he thinks he has the ability to move a 250 billion cap company with his 3 paragrah DD on reddit.", "score": -16, "replies": [{"body": "Over here from wsb I see", "score": 9, "replies": [{"body": "OP is obviously a sad little shill trying to pump his amd shares while its being dumped. No incentives right OP?", "score": -10, "replies": [{"body": "You know bullying people on the internet isn't going to make your portfolio look any better right?", "score": 3, "replies": [{"body": "To be fair.. OPs a little one sided though.\nNext year will be an interesting one for the semi's!", "score": 1, "replies": [{"body": "One sided? The leading company in the industry just told everyone it will be a year before they can produce something that other companies have now.", "score": 1, "replies": [{"body": "Intel's 7nm is closer to tsmcs 5nm.\nIts something for year 2022/beyond\n\nPlus it seems like they are outsourcing.\n\nhttps://www.eenewseurope.com/news/first-seven-customers-5nm-tsmc-production", "score": 1, "replies": []}]}]}, {"body": "So you think people who spend hundreds of thousands of dollars are sensitive to internet bullying? That some random comment by some stranger on the internet is gonna send some investor off the edge? Get a check buddy", "score": 1, "replies": []}]}]}]}, {"body": "I guess you didnt hear, their cap dropped about 22% due to ineptitude. They're a dumpster fire that killed itself with PC culture. Since 2016 45% of their hires have been \"diversity hires.\" This is what happens when you hire someone based off their gender and skin color instead of the best person for the job.", "score": 0, "replies": []}]}]}, {"body": "I work for a large tech company and I found this post awesome. Regardless of the stock market, it was so informative about what goes into design/manufacture of a processor.  Lucky for me, I bought AMD at 52, so I was already off the Intel ship, but it's even more interesting to see you feel Intel will be behind the 8 ball for a long time.", "score": 68, "replies": []}, {"body": "Informative post, thank you. INTC is selling at a steep discount during an absolute bonkers valuation period. They are under 9 p/e with 2.69 yield and even the biggest pessimists aren’t predicting their demise. The p/e for AMD is over 160 with no yield atm.\n\nEven if you think AMD supplants INTC, I think I’m buying the latter due to valuations.", "score": 11, "replies": [{"body": "Bingo.  Don't follow lemmings.", "score": 4, "replies": []}, {"body": "Don't you mean \"the latter\"?", "score": 2, "replies": [{"body": "Yep. I'm stupid.", "score": 1, "replies": []}]}, {"body": "I was [talking about this same thing](https://www.reddit.com/r/StockMarket/comments/hxexbs/intel_stock_savaged_as_nextgen_chip_delay/fzayg7r?utm_source=share&utm_medium=web2x) a few weeks ago **before** AMD had this huge run up:\n\n>Funny how people talk about INTC being overvalued while trading at 3x book value and a P/E ratio of 9x which is well below the industry coupled with solid revenue growth.  \n>  \n>Meanwhile everyone is clamoring over AMD who is trading at 25x book value with an outrageous 145 P/E ratio and people are acting like they’re some undervalued steal.  \n>  \n>Also worth noting intel had revenues of $70B+ vs AMDs $7B in 2019.", "score": 1, "replies": []}]}, {"body": "Exciting my Intel position which I bough on a dip... great write up", "score": 21, "replies": [{"body": "Its amazing how people actually base their investment decisions in whether they saw a youtube ad or a reddit post lmao", "score": 23, "replies": [{"body": "It's corroborating a lot of news and historical events. People can think for their own and a lot of business deals are made from rumors that have legs.", "score": 4, "replies": []}, {"body": "Got to have that researched", "score": 3, "replies": []}, {"body": "I mean, mans did his research. All of this info is public knowledge and has been for years. Intels die shrink has been a disaster for years. I haven’t been following pc tech for a while but I assumed they would of been past this by now. Also op, drop your blog. Or pm it", "score": 3, "replies": []}, {"body": "Haha. Exactly :p", "score": 1, "replies": []}, {"body": "It's too common nowadays, it's kind of worrisome.", "score": 1, "replies": []}]}, {"body": "intels definitely tanked after you sold your 3 shares", "score": 2, "replies": [{"body": "I sold 9", "score": 3, "replies": [{"body": "Whoa whoa, here comes the market crash", "score": 1, "replies": []}]}]}]}, {"body": "I remember AMD had similar issues 10 years ago or so. They changed their CPU development process around new software and it turned out to be incompatible with their manufacturing process. Lots of yield issues. \n\n&#x200B;\n\nI've also read that Intel CPU's have a big technical debt with the way they interact with memory making the process inefficient but I'm not sure if it's part of their current issues.", "score": 6, "replies": []}, {"body": "I almost wish AMD would screw up this badly so I could buy their stock on the low again. Of course, at the time \"on the low\" was about $2 so I'll probably never see that again unless they REALLY screw something up.", "score": 21, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "In all fairness, the main reason I bought the AMD was because I both like and use them far more than Intel processors. I don't ever see them going ahead of Intel any time soon, but I never see them failing either.", "score": 2, "replies": []}]}]}, {"body": "I never thought I would live to see AMD performing better than Intel 🤣🤣🤣🤣\n\nI knew intel was doomed when Apple dumped them for the iPad.\n\nIf you can put it in one sentence, Intel positioned its chip for computers and they were not willing to pivot to hand held devices or simply lost out on innovation \n\nHowever, awesome write up OP. Good work.", "score": 5, "replies": [{"body": "AMD chips have been faster at various times since the 80s and 90s. It’s been a perpetual back and forth.", "score": 7, "replies": [{"body": "Kid definitely wasn’t around for the Athlon, XP & 64 days. Northwood? Prescott?! Extreme Edition!!", "score": 2, "replies": []}]}, {"body": "Apples own silicon team is pretty fucking rad. I expect great things from them ahead when they vertically integrate into their personal computing hardware. We’ve yet to see what they can throw out for a non-mobile chip, but their mobile chip designs are promising.", "score": 1, "replies": []}]}, {"body": "Thanks for the detailed analysis \n\nIntel didn’t lose to AMD temporarily. It basically dropped out of the race.", "score": 12, "replies": []}, {"body": "Great analysis. I can tell a lot of work went into this. Keep it up!", "score": 3, "replies": []}, {"body": "!remindme 7 months", "score": 5, "replies": [{"body": "I will be messaging you in 7 months on [**2021-03-10 14:39:42 UTC**](http://www.wolframalpha.com/input/?i=2021-03-10%2014:39:42%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/StockMarket/comments/i73vd2/deep_dive_into_the_technological_aspect_of_intels/g0zwqg9/?context=3)\n\n[**13 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2Fi73vd2%2Fdeep_dive_into_the_technological_aspect_of_intels%2Fg0zwqg9%2F%5D%0A%0ARemindMe%21%202021-03-10%2014%3A39%3A42%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20i73vd2)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks for the interest, it's https://www.infinitevalueptr.com/blog\n\nLockdown project so it hasn't got too many posts, but I'll try to write regularly. Won't necessarily all be as technical as this, really just whatever I find interesting.", "score": 2, "replies": []}]}, {"body": "Company still made 19 billion and chips aren’t its only bidness. Stop scaring yourself over a great company. Like what’s so bad about buying a stock at a discount if covid didn’t happen it would be trading at $70", "score": 2, "replies": []}, {"body": "LOL this guy keeps spamming the same shit. Hes bitter cuz he bought the intel puts i sold to him", "score": 0, "replies": []}, {"body": "Thank you for this post! I had no idea this was the complication Intel was having.", "score": 1, "replies": []}, {"body": "I missed the whole boat on AMD as I got more into SaaS software (IT Ops for a living). Is it too late to buy AMD? I feel like it has had an incredible run and not sure how much more room it has to run.", "score": 1, "replies": []}, {"body": "How about buy a bit of them all? Seems like you never really let know when there will be some big breakthrough. I appreciate your understanding here though- that was a great read!", "score": 1, "replies": []}, {"body": "Yea.. I pointed this out on the other post talking about Intel is a value stock right now cause their next gen chip.\n\nBitch please, there is no guarantee their next gen chip will be good. AMD last gen bulldozer promise to beat INtel and it fell flat. They hit the park with this current gen.\n\nI also pointed out that fab tech too. They falling behind on fab. AMD spun their fab tech.", "score": 1, "replies": []}, {"body": "!remindme 5 months", "score": 1, "replies": []}, {"body": "!remindme 5 months", "score": 1, "replies": [{"body": "!remindme 5 months", "score": 1, "replies": []}]}, {"body": "What are you, Einstein?", "score": 1, "replies": []}, {"body": "Team Red >>>>>> Team Blue", "score": -1, "replies": []}, {"body": "Does anyone really read all of these??\nSo looong...Lol", "score": -52, "replies": [{"body": "You want to learn and make money or what?", "score": 9, "replies": []}, {"body": "I did. Computer component manufacturing is incredibly interesting, imo.", "score": 5, "replies": []}, {"body": "People who do will happily take your money in the markets ... if you even have any to put in there :-P", "score": 2, "replies": []}, {"body": ">Does anyone really read all of these?? So looong...Lol  \n\nIf you're not down to do the DD for investing, you might want to stick exclusively to ETFs. This post isn't for penny stock gamblers or TSLA speculators.", "score": 4, "replies": []}]}]}
