{"title": "[deleted by user]", "selftext": "[removed]", "id": "wa23y5", "created_utc": 1658989508.0, "score": 0, "upvote_ratio": 0.31, "num_comments": 66, "comments": [{"body": "Cmon now. How are you going to feel if GDP is up?  What conviction do you need to acknowledge a recession?  \n\nNot being a dick, this is a legit question I’ve been mauling over.", "score": 7, "replies": [{"body": "Some people will defend this pRESIDENT regardless of how everything he touches ends up a miserable failure.", "score": 5, "replies": [{"body": "You think economics changes on a daily basis? There's a huge inertia behind it that is far longer than a presidency. Presidents are just randomly around when (economic) stuff happens.", "score": 3, "replies": []}, {"body": "I just don’t understand. \n\nRegardless. I’m a straight, white male, and Im only allowed to have an opinion on Reddit, where my ID is anonymous (until I end up in Reddit jail). \n\nWhat a world folks. \n\n\nWhat. A. World.", "score": 5, "replies": [{"body": "Oh poor you.", "score": 2, "replies": [{"body": "Lol it’ll be “poor all of us” soon if we continue to neglect the inflation.", "score": 1, "replies": []}]}]}, {"body": "Dude, turn off Newsmax", "score": 0, "replies": [{"body": "Dude, turn off CNN", "score": 2, "replies": []}]}, {"body": "Same way they defended the last president, regardless of how everyone around him ended up in jail.", "score": -1, "replies": [{"body": "Same way they defend this president while his crack head son bangs his dead brothers wife, smokes crack, illegally buys a gun, and is a national security threat.\nSit down and shut up.\nYou’d be up in arms if Don Jr did any of those things.", "score": 2, "replies": [{"body": "are we really bringing up NATIONAL SECURITY THREAT? are you that far gone?", "score": 1, "replies": []}]}, {"body": "At least we didn't have the highest level of inflation in over 40 years, record gas prices, food shortages, and a proxy war in Ukraine. And that's just to name a few.", "score": 3, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "[removed]", "score": -5, "replies": [{"body": "Assuming the market doesn’t really go down before then because then people will vote for our side instead of those Republicans because they will want us to take even more money from the rich to give to us.", "score": 0, "replies": [{"body": "Brandonomics is only harming the poor and middle class. Hopefully they've learned their lesson on Democrat promises.", "score": 1, "replies": []}]}]}]}, {"body": "The US doesn't have food shortages, and gas prices were higher in 2008.", "score": -3, "replies": []}]}, {"body": "[removed]", "score": -3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "Let’s just get this straight. Biden is awful but Trump was a fucking dumpster fire.", "score": 3, "replies": []}, {"body": "You mad that democrats are in full power and the country is a shit show?", "score": 2, "replies": []}]}]}]}, {"body": "You big mad that we are now officially in a recession aren’t you.  Or are you in the camp of wanting to change the definition of what a recession is.", "score": 1, "replies": [{"body": "Don't really care, but...why not change the name? Lets call it CRT...Critical Recession Theory 😂", "score": 1, "replies": []}]}]}]}, {"body": "Inflation is hurting Americans, but that doesn’t mean it’s a recession imo. Likewise, an official recession isn’t needed to recognize the economy is in a tough spot right now. \n\nBut, and this is especially true if GDP is up, the data simply doesn’t point to recession. Personal incomes are up, unemployment is at record lows, GDP forecasts for the year are positive. That said, reopening and supply chain troubles have everything out of whack, especially the labor market, and I wouldn’t be surprised for the NBER to eventually say there was a minor recession this summer", "score": 1, "replies": []}, {"body": "For me I would believe the only way GDP is up is because the government is covering it up.  A recession to me is when I can't save a fair surplus in wages.", "score": 1, "replies": [{"body": "I’m at that point, compadre. I’m officially paycheck to paycheck.  It’s tough telling my kid he can’t have shoes. \n\n\nThey can try to cover it up, but it’ll all become evident when milk is $127.99 a gallon.", "score": 1, "replies": [{"body": "I think they'll crash the global economy within the next 9 months and stop inflation, hyperinflation is worst than deflation.  \n\nInflation is tough on retirees and families, I have a household of 5 so I know what you mean.  My household now bakes all our own bread, pork is about the only meat consumed, making tea instead of drinking soda, go out a whole lot less, and we make our own wine for alcohol now.  We never ate out anyways, terrible quality compared to my wife's cooking, and the value of food from away from home is extremely expensive.", "score": 4, "replies": [{"body": "Psh that’s just lack of consumer confidence /s\n\nI think we will be having a very negative conversation about stagflation and/or a depression soon enough.\n\nIn fact, I’m sitting in cash until that happens.  I have cash to the GILLS that I’m trying very hard to be patient with.", "score": 1, "replies": [{"body": "Maybe, only time will tell if those economic events will come to present.  \nI feel like I'm cash heavy also and it's only losing value.  Wish I was allowed to put more into I bonds, 10k is too low of a number.", "score": 0, "replies": [{"body": "I wish I understood i bonds. \n\nWhen the government suggests something, I tend to lean the other way anyways.", "score": 1, "replies": [{"body": "Something to read up on.  My wife and I invested 10k each into I bonds a few months back, not a bad deal considering.", "score": 1, "replies": [{"body": "I’ve tried to read up on it-\n\nCan’t beat that yield, but the RoR will flux based on…….what?  The lack of info on ibonds is ridiculous.", "score": 1, "replies": [{"body": "Government uses inflation numbers for the interest percentage, the interest percentage is changed every six months.  The money is locked up for one year and if pulled out within five years the last three months of interest is wiped away.", "score": 1, "replies": [{"body": "I understand that much, but is there no way to calculate future value?", "score": 1, "replies": [{"body": "Numbers get floated right before announcement.  I bought right before the 9% amount, so I got 7 something for six months and then 9 something for six months.", "score": 1, "replies": [{"body": "Hmm. I’m going to keep digging. Sounds lucrative.", "score": 1, "replies": []}]}]}, {"body": "With EE, I know they are worth the face in 20. Theoretically, I bonds can lose value. As far as I can tell anyways.", "score": 1, "replies": [{"body": "I bonds aren't TIPS, they never go below 0% interest.\nEE bonds are terrible in my opinion, 20 years to double money isn't good.\n\nhttps://finance.zacks.com/isavings-bonds-show-0-interest-rate-6786.html", "score": 1, "replies": [{"body": "Agreed. My ee bonds are gifts from when I was a baby;  I’d never invest in them myself.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "So it's only a recession if it affects you specifically?", "score": 1, "replies": [{"body": "Yep.  Because at that point everyone else is hemorrhaging.", "score": 0, "replies": [{"body": "I'm not convinced by this metric.", "score": 1, "replies": [{"body": "If savers have a hard time saving, after about 12 months spenders are tapped out.  Let's see what happens later in the year,  November. \n\nHave a group of buddies that are savers and see what they are saving.", "score": 0, "replies": []}]}]}]}]}, {"body": "*mulling", "score": 1, "replies": []}]}, {"body": ">  will you all start accusing the government of fudging the numbers?\n\nIs this your first time on Reddit?", "score": 3, "replies": []}, {"body": "It’s not gonna be positive", "score": 2, "replies": []}, {"body": "Well.. If ts gonna be positive, why the effort to \"alter the definitions\".??\n\nThis is just the most recent proof, that is doesnt matter which person whos president..  Ppl just cant handle the Truth, so now We have.. Fake news, and altered definitions of that..", "score": 2, "replies": [{"body": "They didn’t change the definition", "score": 0, "replies": [{"body": "https://twitter.com/RNCResearch/status/1552355645055270912?t=4IgM0nqjPc3qvcMqcG-Z7g&s=19", "score": 1, "replies": [{"body": "Did you even bother reading the tweet you linked?  He’s very clearly, in 2008, saying “Here’s what Hilary Clinton said.” This gives no indication of whether he refuted her claim. \n\nAs for the 2Q rule: it’s a rule of thumb many use since it typically coincides with NBERs definition of recession, but basically everything is out of whack right now and the rest of the data is mixed.", "score": 1, "replies": [{"body": "Did you?  He says \"of course\" implying it is common knowledge \n\nHere's a few more:\n\nhttps://twitter.com/PhilipWegmann/status/1552365720721399817?t=ZxSZFxif1kP64S43uP9LoA&s=19", "score": 1, "replies": []}, {"body": "https://www.ft.com/content/8e4caa59-5799-430b-9896-e494369900dc", "score": 1, "replies": []}]}]}]}]}, {"body": "In my opinion, let’s be honest we have been CLEARLY in a recession. Just looking at the macro and micro… obviously not according to the theory yet ;V", "score": 2, "replies": [{"body": "Hm I mean with personal incomes continuing to rise and unemployment staying low idk", "score": 1, "replies": [{"body": "But the incomes are higher for inflation, not for enhancement of productivity and unemployment benefit request rising significantly…", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "They are predicting it to be negative…?", "score": 1, "replies": [{"body": "Consensus is +0.04", "score": 1, "replies": []}]}]}]}, {"body": "Are we 'building back better' yet?", "score": 2, "replies": []}, {"body": "DAVE 🚀🚀PGY taking over", "score": 0, "replies": []}, {"body": "Why do you even care.", "score": 0, "replies": []}, {"body": "Will the government fudge the numbers?  Of course!  Will GDP be positive?  Of course not! The controllers want you confused and scared.  Do not fall for it.", "score": 1, "replies": []}, {"body": "Got about half way through the comments and I had to stop because this sub has way to many children in it.  I thought other subs were immature. But this specific thread takes the cake.", "score": 1, "replies": []}]}
{"title": "Why did companies like Microsoft and Google not move much for 10-15 years? And why couldn’t it happen again?", "selftext": "As the title states, why did this happen despite obvious business expansion? It makes one think, couldn’t this happen again? Esp To be considered after insane growth the last 5-7 years, can that CARG really keep up?", "id": "wa9e97", "created_utc": 1659013343.0, "score": 33, "upvote_ratio": 0.87, "num_comments": 64, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Microsoft PE ratio was around 70 in 2001.\n\nIt took 15 years for its E to catch up to its P.\n\nDon't buy stocks with high PE ratios if you don't want this to happen to you, no matter how great the company is. Remember Microsoft was churning out billions of dollars of income every quarter during this 15 year period it was never in trouble. In order to justify its 2001 price it had to quadruple it's earnings.", "score": 36, "replies": [{"body": "[deleted]", "score": 56, "replies": [{"body": "I am not a TSLA bull by any means but it is very impressive how quickly the E has caught up to the P, even if the P/E ratio is still really high. Their earnings growth will inevitably slow down but it’s becoming a question of how high can it get before that happens. They went from being unprofitable to being much more profitable than auto giants like Honda in two years.", "score": 10, "replies": []}, {"body": "Ok boomer", "score": -11, "replies": []}]}, {"body": "The same thing happened with the Nifty Fifty about 60 years ago. \n\nIt was 50 'untouchable' companies that were super overpriced. Everyone bought mutual funds that all owned the same 50 stocks and the p/e went crazy high.  \n\nBasically - that's what happens with marketcap  concentration.", "score": 3, "replies": []}, {"body": "It was overpriced then, but then is was underpriced for many years. It was under 10 pe for a while even. The subscription model is what propelled the earnings and stock way higher in recent years though.", "score": 1, "replies": []}]}, {"body": "Which 15 years? If you’re talking about from 2000-2015 the entire NASDAQ took 15 years to recover because it became so overpriced", "score": 49, "replies": [{"body": "We also had a once in a lifetime recession during that time", "score": 34, "replies": [{"body": "Exactly. It assumes you bought at the absolute peak and never DCA’d. Had you DCA’d you would’ve done far better than the market", "score": 18, "replies": [{"body": "Alphabet wasn't even public back then.", "score": 6, "replies": []}]}, {"body": "6 more times after that", "score": 3, "replies": []}, {"body": "Two. Dot com bubble.", "score": 3, "replies": []}, {"body": "Once in a lifetime?? Hold my beer…", "score": 5, "replies": [{"body": "I think they meant once in a lifetime of an ant.", "score": 3, "replies": []}, {"body": "Once in a lifetime every 10 years lol", "score": 5, "replies": []}, {"body": "Right? Dotcom happened when I was in ninth grade and the great financial crisis just as I was finishing my bachelor's. After forfeiting my business to Covid, I'm primed and ready for many more, catastrophic, \"once in a lifetime\" events. Let's go!", "score": 2, "replies": []}, {"body": "There were actually two once in a lifetime events during that period", "score": 1, "replies": []}]}, {"body": "'once in a lifetime'.", "score": -5, "replies": [{"body": "It was the worst economic crisis the country has seen since the great depression. Not many people see multiple events like that in their lifetime.", "score": 11, "replies": [{"body": "Sure, I'm just saying. They said that about the climate too and we've all had multiple once in a lifetime heatwaves, floods, hurricanes, wildfires, etc., in a few decades. \n\nObviously we're talking about the economy but this is an extremely unsettled new world. I'm not at all convinced a similar event won't happen again in our lifetimes.", "score": -13, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "But in order for it to be wrong, wouldn't we need to have another similar pandemic?  There can be thousands of different once-in-a-lifetime events in one lifetime.", "score": 2, "replies": []}, {"body": "Yeah exactly. The phrase 'once in a lifetime' over the last two to ten years has started to acquire something of a satirical bent. I'd be cautious using it with such certainty.", "score": -1, "replies": [{"body": "You’re soooo close", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Not much disruption for a while…\nOnce they jumped into high margin cloud services, then they exploded again", "score": 6, "replies": [{"body": "As companies go out of business, they lose customers.  That infrastructure isn’t free", "score": 1, "replies": [{"body": "Not sure you fully understand. One workload moved to cloud can generate some 15-20 new revenue streams for each cloud provider as their tools are consumed.", "score": 1, "replies": [{"body": "I understand it’s my entire real world career", "score": 1, "replies": []}]}]}]}, {"body": "Even if a great company like Microsoft stock goes up a shit ton like the dot com era. Let’s say the PE ratio goes to like 70. Well you’re not going to get a great return on your money investing in something like that unless the earnings can quadruple or more pretty quick.\n\nFor example MSFT trades at 70 PE. After 15 years the earning triple. However the stock now trades at a reasonable 23 PE. The stock would not have moved a bit. Obviously the business is worth a lot more than 15 years ago but people got crazy on the price 15 years ago so the returns were nothing for 15 years if you bought at 70 PE.", "score": 5, "replies": [{"body": "Like Amazon? Or Tesla?", "score": 1, "replies": [{"body": "Yeah possibly. But if they can grow earnings by 4-7 times within 5 years you could do great lol probably more likely with Tesla than Amazon because Tesla is way smaller. However Tesla has competitors coming for it.", "score": 1, "replies": []}]}]}, {"body": "MSFT was a specific case of bad management. \nSteve Balmer took the helm from Bill Gates and then proceeded to run a race to the bottom. MSFT became a laughing stock. However Windows was always developing and cementing their relationship with the  business sector . This is their big difference compared to other big tech which depends on all of us and of course teenagers. \n\nThen along came Nadella and turned around the company to what we know today .", "score": 5, "replies": []}, {"body": "Google didn’t go public until 2004. It traded flat from 2008-2012. Otherwise has been moving upward every year since except for 2022. \n\nMicrosoft went flat because the stock was overvalued in 2000. Then as stocks were selling off across the board you had bill gates step down, 9/11 happening, 2008 happening a few years later, and Microsoft settling anti-trust with the DOJ. \n\nSteve ballmer was a terrible CEO because he was reactionary and made an effort into markets that were proven establishments when it was too late (Zune chasing iTunes, windows phones chasing iPhone and Android, windows 8 chasing iPads). Even though Microsoft’s fundamentals were increasing it wasn’t enough to sway investors regarding Microsoft’s standing in the future. The market for windows was looking bleak when Vista and Windows 8 launched. Windows 8 was so bad", "score": 21, "replies": [{"body": "I didn't think Windows 8 was terrible, but Vista was awful. You're right that Microsoft was severely overvalued when the dot com bubble popped. \n\nIn my opinion, Windows Phone failed because Microsoft charged OEMs around $30 per handset to use their operating system.  Balmer also predicted the iPhone would be a failure since it didn't have a stylus.  He did, however, lay the groundwork for Azure, since it launched in 2008.", "score": 8, "replies": [{"body": "Windows 8.1 was fine because it brought back the windows 7 UI. \n\nThe original windows 8 launch was only the tiles menu 🤮", "score": 4, "replies": []}]}, {"body": "I worked at MSFT. Balmer was old school a bit but he knew where the market was going and he started the move to Cloud before Satya took it over and prioritized. He made a mistake with Nokia. Windows was a cash cow so people can complain about some moves but leadership at msft timed things pretty well. Here is one answer… the market didn’t appropriately value the growth of SAAS and Cloud (Amzn) leaders. Net is SAAS and IAAS is a big reason for the current growth and financial gurus out of NYC took a few years to see the moat.", "score": 10, "replies": [{"body": "Office 365 and Azure were started under Ballmer. He missed mobile and had some bad acquisitions, but to totally write him off is a bit unfair.", "score": 3, "replies": []}, {"body": "Msft mgmt is and will always better than intc. Both companies were literally sleeping together but then intc mgmt so bad and the divorced happened and intc became poor.", "score": 1, "replies": []}, {"body": "they hit a home run by making win10 \"free\"", "score": 1, "replies": []}]}, {"body": "It could run flat for another 3 years depending on how long the recession is.  The bottom just dropped.  We don’t know how long", "score": 2, "replies": []}, {"body": "You’re not wrong that msft was mostly a fast follower. You might say it’s part of their business model but it left them flat footing in cloud and mobile. Govt also had them under anti trust watch which didn’t help", "score": 1, "replies": []}]}, {"body": "Last 10 years:\n\nMSFT +832%.  \nGOOGL +612%.\n\nWhat is « not much » ?", "score": 8, "replies": []}, {"body": "It could", "score": 5, "replies": []}, {"body": "Buy and hold MSFT for as long as Nadella is CEO. He will turn it into a $3 trillion company, maybe even 4 trillion.", "score": 2, "replies": []}, {"body": "No matter how good are there companies, the market will tend to over- or under-value them during specific cycles. They are now in the overvalued territory and a natural correction will return their worth down to their historical trend line. This does not imply that those companies decline. It's just the price correcting itself. And yes, the correction could take years.", "score": 3, "replies": []}, {"body": "A Google director told me: In America. Any company can be prosperous and someone came in taking over with a better technology or management team.  Connor Peripery was once the fastest growth company in America. In two years its earning was falling and sold quickly.  I think Tesla, Meta and some of the FANNG companies are on the chopping block.  Earnings come with profitbility they go hand to hand.  Any internet start up after a few years are not profitable investors need to be weary about it.", "score": 0, "replies": []}, {"body": "Guess why it is dumb to pick stocks over indices?", "score": -4, "replies": [{"body": "Microsoft and Google vastly outperformed the indexes to by multiple degrees of magnitude.", "score": 4, "replies": [{"body": "Survival bias", "score": 5, "replies": [{"body": "Stock picking is hard and lots of people have been playing on the Federal Reserve's easy mode but there's plenty of opportunities for money to be made", "score": 1, "replies": []}]}, {"body": "Microsoft didn't perform well vs QQQ out of the financial crisis until Satya became CEO.\n\nThe only real thing you need to know is Steve Ballmer wasn't a good CEO. Them being at a higher premium now is probably justified unless you think this is the early 00's, and if you think this is the early 00's, then the only think that makes sense if you like to play is stuff based off commodities.\n\nNow granted, I'm saying this and while I've thought about it, I probably don't touch Microsoft again unless it hits $220.", "score": 2, "replies": [{"body": "> The only real thing you need to know is Steve Ballmer wasn't a good CEO\n\nThat’s pretty debatable. He was responsible for starting / pushing a lot of the divisions that are now their cash cows.\n\nAzure, Office 365, Xbox\n\nThose were all started by Ballmer. He helped transition MS away from their desktop focused approach. They did miss the smartphone revolution, but so did basically everyone else.", "score": 1, "replies": []}]}, {"body": "… during QE.\n\nFTFY", "score": 1, "replies": []}]}]}, {"body": "It can happen again. Stocks, especially tech stocks, were incredibly out of favor back then. Nobody cared about them, and then 2008 hit, and people *really* didn't care about them. Looking back they will call the 00s a lost decade for the stock market. It can and will happen again, but it's not clear when that would be, so you just buy and hold these great companies that made it out of the fire. They are the next Coca Cola, the next Proctor&Gamble, etc.", "score": 1, "replies": []}, {"body": "Microsoft had lacking leadership.  Wasn't until they changed from balmer and moved towards Azure.  That was the breakout for them.  Thus it's about adding growth to your business.  Without it, you're just barely going up the hill.\n\nGoogle was one main product (search) for a long time and that started to peak out.  Then they got youtube, android and oh right, cloud business as well.  Growth.", "score": 1, "replies": []}, {"body": "It’s the third option in stocks usually go up or down. Occasionally they go sideways", "score": 1, "replies": []}, {"body": "Because market had priced in 15 years of growth and it can definitely happen again", "score": 1, "replies": []}, {"body": "That didn’t happen with Google. Microsoft wasn’t run well after 2000 by the founders.", "score": 1, "replies": []}, {"body": "Stock price =/= intrinsic value. Overvaluation (in the late 90's and 00's) and undervaluation (in the early 2010's for MSFT)\n\nOver very long periods of time stock prices TEND to trend towards their intrinsic value.", "score": 1, "replies": []}, {"body": "It’s a little something amazing….an incredible phenomenon called….modern times", "score": 1, "replies": []}]}
{"title": "Why are markets up today ?", "selftext": "Why are markets up today ? \n\nWhy is everyone in YouTube and reddit saying that interest rate hikes will reverse , and the stock markets are up. \n\nI watched the full fomc briefing, and all I noticed is that the fed may slow down interest rate hikes if inflation is 2%, which is very unlikely. I don't get where people are getting the idea of lowering interest rates.\n\nare we in a bull trap ?", "id": "waog32", "created_utc": 1659050093.0, "score": 22, "upvote_ratio": 0.63, "num_comments": 64, "comments": [{"body": "Stop trying to look at one day of the market performance and explain why. There's a million entities buying and selling with different agendas every day.", "score": 43, "replies": [{"body": "fucking this\n\nevery god damn day there's someone on reddit saying \"why is market up/down today\" and then they give their reasons as to why it should be the opposite\n\nthis is why so many people lose money in the stock market, they have no clue how tf it works", "score": 3, "replies": []}]}, {"body": "Why are boobs good?", "score": 61, "replies": [{"body": "why is ass fat?", "score": 26, "replies": [{"body": "*phat", "score": 9, "replies": []}, {"body": "Why is pussy juicy?", "score": 5, "replies": [{"body": "smells like fish, it’s a dish\n\nsmells like cologne, leave it alone", "score": 9, "replies": [{"body": "U made my day with this comment lmaoo", "score": 0, "replies": []}]}]}]}, {"body": "Man, this sub has gone downhill in the last few years. This is the top comment? Oof", "score": 15, "replies": [{"body": "It's not really the comment that's low effort. It's the post. This should have been downvoted in the new queue. Or there should be a rule that auto removes posts that ask WHY the market went a certain direction today when they think it should have done the opposite.", "score": 12, "replies": []}, {"body": "It's Joe dirt quote. Get over yourself.", "score": -4, "replies": [{"body": "Guess I was just reminiscing of a time before this place got invaded by the WSB degenerates. That place actually used to be enjoyable, too.", "score": 4, "replies": [{"body": "I wasn't here for that time. The degeneracy is what brings me back lol", "score": 0, "replies": []}]}]}]}]}, {"body": "why do i like baddies ?", "score": 11, "replies": [{"body": "Are we the baddies?", "score": 3, "replies": []}]}, {"body": "The pumping the week before Tesla earning was a bull trap because there were no data on companies earning. \n\nThe current bull run looks pretty genuine. Most of the big tech earnings are out. Most of the results are better than expected . Looking back, all of the dumping last quarter happened before the fed rate hike and peak inflation.\n\nThe stock market is ahead of the economic conditions by one quarter.", "score": 11, "replies": [{"body": "I think this is a good read. Companies with good results are seeing stock price increases. Those with bad results seeing further drops.\n\nAnd when things looked bad for the economy almost everything dropped and the company that to prove things were the opposite.", "score": 2, "replies": []}, {"body": "We haven’t reached peak inflation.", "score": 0, "replies": [{"body": "[https://www.businessinsider.com/summer-sales-retailer-price-cuts-excess-inventory-supply-chain-delays-2022-7](https://www.businessinsider.com/summer-sales-retailer-price-cuts-excess-inventory-supply-chain-delays-2022-7)\n\nGas prices were around $6.50 (where I live) last month, but it has come down to around $5.50 this month. Walmart and Target announced big price cuts on items due to excess inventories. \n\nThis solution maybe temporary, but for the next quarter, it is a good indicator of increasing consumer consumption. Coupling with Amazon beating their earning, these are huge indicators of increasing consumer purchasing power for the next quarter", "score": 2, "replies": [{"body": "Oil is back over 100 gas prices will follow.  Those inventory cuts are a bunch of crap left over from pandemic items. Not shit people want now.\n\nCoca Cola and a dozen other companies said in earnings they raised prices just because and at least one ceo admitted that they knew they would have less sales but wanted to keep their high prices and make it stick.", "score": 1, "replies": [{"body": "What I am saying is that these are the conditions for the next 3 month (or quarter) and how the institutions look at it. Whatever happens after that, no one know. The decision of whether you ride the waves or try to time the market is up to you.", "score": 1, "replies": [{"body": "In what other purchases do you not make data based decisions?  If the fundamentals are not there,you don’t purchase an investment.\n\nIt’s not “timing the market” it’s gathering data and investing", "score": -2, "replies": [{"body": "The current inflation is due to the lockdown in Shanghai and the Russian-Ukraine war dated back in February. The fed and companies have been trying to solve these problems with new solutions. \n\nThese are my opinions. If you are so firmly believe that this is a bull trap, just buy long puts. You do what you believe in, I do what I believe. If I could perfectly predicted the market movements, I would be a millionaire, and would just enjoy my luxurious and leisurely life. No point in going on the internet and argue with strangers.", "score": 5, "replies": [{"body": "I am, I am short right now", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Better than expected? Estimates were revised down extremely and most tech missed bottom or top. Wouldn't say better than expected.", "score": -1, "replies": []}]}, {"body": "I think it's kind of a bull trap. A little. QT is still happening, decreasing the money supply. Less money is less money to buy stuff. Stocks is stuff too. Interest rates are still rising, making bonds an alternative to stocks. \n\nBut the consumer is still strong. Earnings are ok. And there's bright signs ahead for inflation. So I'm still sticking with what I thought summer and fall would be: sideways. Wouldn't even think of fomo now, but wouldn't fear a crash either. Just choppy waters.", "score": 19, "replies": [{"body": "Water is wet.", "score": 3, "replies": [{"body": "Water is actually not wet; It makes other materials/objects wet. Wetness is the state of a non-liquid when a liquid adheres to, and/or permeates its substance while maintaining chemically distinct structures. So if we say something is wet we mean the liquid is sticking to the object.\n\n&nbsp;\n\nHow do you make holy water?\n\nMake sure to boil the hell out of it.", "score": 12, "replies": [{"body": "When I say somethings is wet I don not necessarily mean that something has to be solid. Also non-liquid is kind of a weird definition to use, when we throw water into the air do we say the air is wet? It's nothing scientific, it's all semantics.", "score": -2, "replies": []}]}]}]}, {"body": "The answer is that the raising of rates is needed to control inflation.  We know we need this medicine.  However, there's always a chance that daddy powell will decide to give an extra dose of medicine.  And that scares us!  Oh nO!  Then when daddy powell only gives us the required dose we all cheer!  Thank you daddy powell for being so nice!  We will get better soon, we swear daddy!  Next time maybe no more medicine??  Huh daddy?! Maybe?!", "score": 5, "replies": []}, {"body": "Copper went up yesterday. Markets follow Doctor Copper.", "score": 5, "replies": [{"body": "It's been steadily rising for the last couple of weeks actually. Definitely feels like we bottomed for the time being at least the next couple of months.", "score": 2, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "No I dont take advice from YouTube, but I like opinions  but am confused now", "score": 2, "replies": []}]}, {"body": "Tommy copper*", "score": 1, "replies": []}]}, {"body": "Trying to understand why the market moves one way or the other is a fools errand. It does whatever it does, and people simply attach a reason on it after the fact to try to make sense of something that doesn't make sense.", "score": 2, "replies": [{"body": "If you don't believe this, look at the daily headlines on Yahoo Finance.\n\nI used to look at Yahoo Finance every morning, and they always have these headlines that try to explain market movements. I remember laughing on multiple occasions when I loaded the page and it would say something like \"Markets drop as investors concerned over X piece of news\"... Except the markets had only dropped for all of 5 minutes following market open and then proceeded to make a massive move up for the rest of the day, leaving the daily headline looking completely stupid. It was obvious that whatever headline they had, they were just attaching a semi-coherent reasoning to whatever direction it looked like the market would move that day based on futures.", "score": 2, "replies": []}]}, {"body": "Nobody knows.  Come on bro.", "score": 2, "replies": []}, {"body": "Because everything is made up and the points don’t matter. Just wait for it to go down then buy more.", "score": 2, "replies": []}, {"body": "Bull trap. \n\n::puts on tinfoil hat::\n\nStay tuned for somewhere between next Friday and the following Wednesday.", "score": 2, "replies": []}, {"body": "I can tell you most of my tech is up because the semiconductor bill passed - once the semiconductor shortage starts a serious supply chain opens back up and stimulates a bunch of  manufacturing.  My energy stocks are up because the climate initiative is about to pass and should create a growth environment in renewables.  I've only got small pharma stocks and those are up because they are getting ready to have a competitive chance now that big pharma is going  to have to negotiate.  I can tell you that most of my portfolio is up because a couple of big pieces of legislation are finally making it through gridlock.  I can also tell you my tobacco stocks are up because people are chain smoking their way through this horrible inflation just to stay sane. My RV stocks are up because people are having to live in campers to survive because large numbers if them can't pay rent or mortgages. Stocks don't always go up for good reasons. I feel like a hopeful vampire. Can't speak for  what other people are seeing.", "score": 2, "replies": []}, {"body": "I agree, I also thought the markets were going down. I had Puts all week, and have lost about 40% of my portfolio because of the bull run.\n\nToday, I said fuck it and took my loss. I bought some AAPL calls and joined the bull bandwagon.\n\nIt makes no sense but it worked. Welcome to the casino.", "score": -2, "replies": [{"body": "Bull run..relief rally probably, bull trap probably..Def could be the START of a bull run, but isn't that yet...", "score": 4, "replies": []}]}, {"body": "My TSLA is up 😁", "score": 0, "replies": []}, {"body": "You gotta pump it…before you dump it!", "score": 0, "replies": []}, {"body": "Here's a tip. Do the opposite of what \"financial news\" is spoon-feeding everyone. The big players are often trying to cultivate certain sentiments, because their moves involve the opposite. As soon as you see people running around like chickens with their heads cut off yelling \"RECESSION!!! END OF THE WORLD!!!\" , that's when you buy. I bought a huge amount of shares 3 weeks ago, for precisely that reason. Good luck.", "score": 1, "replies": []}, {"body": "It's about a new bill of stimulus mainly for clean energy.", "score": 1, "replies": []}, {"body": "Powell is pivoting. Watch the Fed start cutting rates ahead of the midterm elections so the market pumps. We’ve bottomed.", "score": 1, "replies": []}, {"body": "Something something something dark side", "score": 1, "replies": []}, {"body": "The US had a second quarter of negative growth  with 9.1% inflation and instead of saying “we need a bigger recession to bring down inflation” as expected, the Fed said “we noticed that the economy is softening so we will be more data-dependent”, so investors are revising down their discount rate. The largest market cap companies still saw growth (except Meta/Facebook) and complained more about the strong dollar (which is not so strong anymore) and Tiktok for the slowdown more than the economy, so investors don’t doubt earnings projections so much anymore and energy prices have stopped going up which will help cooling the inflation down. It’s starting to look like the “growth scare” was just that and that the fall in equities in the first half was overdone, and now that we rallied >10% from the previous low, the bears have lost credibility and everyone is getting FOMO. See Buttcoin is back to $24k…", "score": 1, "replies": []}, {"body": "Because people never have and never will make sense. Trade your repeatable system and stick to your rules. \n\nJust thank whoever tf religious deity you praise for not making you a fundamental buy and hold investor….because Jesus. Good luck to you guys. Couldn’t be me", "score": 1, "replies": []}, {"body": "When there are more buyers than sellers, the market goes up", "score": 1, "replies": []}, {"body": "Oh no market irrationale", "score": 1, "replies": []}, {"body": "Because the overwhelming majority of people have a vested interest in the market going up", "score": 1, "replies": []}, {"body": "FOMO", "score": 1, "replies": []}, {"body": "Because you have puts", "score": 1, "replies": []}, {"body": "Mostly because people paid more for shares of stock than previous days.", "score": 1, "replies": []}, {"body": "Because I buy two shares of VTI every month", "score": 1, "replies": []}]}
{"title": "Thoughts on a personal loan to Wheel high Beta stocks?", "selftext": "I'm not really asking if this is advisable, I know it's not smart and has a very low probability of success.  I'm more curious of those in here who have done this before.\n\n* Why did you do it\n* How did it work out for you\n\nI'm contemplating taking a personal loan for around $50k - $100k.  I've been working through my spreadsheet which tells me what the monthly nut to cover would be, then a list of potential players where I've charted weekly contracts with Delta's between 20-30 (as close to 25/24 as I can).\n\nhttps://preview.redd.it/jug6lzhvu8e91.png?width=2874&format=png&auto=webp&s=3f825b5576c1dc296562fb9c7e6f0edde7cc370f\n\nSomething like this concept would leave me 100% available margin to deploy during more risk-off market cycles, leaving me with plenty left over after covering my monthly nut.  The potential player list is still being sorted out and these allocations are just rough first-pass numbers...\n\nI dunno, on paper this looks like a pretty low risk idea but the part of my brain that's always been told to \"shut up, work hard, pay your bills\" is screaming that this is a bad idea.\n\n&#x200B;\n\n**EDIT:**  \nLot's of good feedback here guys, thank you all.  I think I'm going to papertrade this concept for the next couple of quarters (through the end of '22) and see how things shake out.\n\nAs for a response to \"why the loan in the first place\", inflation has taking a huge chunk out of my disposable/investable income, especially with property taxes.  I hope this changes in '23 with house values coming down a bit and if so, then there'll be no need for a loan.\n\nAnyway, fingers crossed of course, and thanks again for the input here folks!", "id": "wa10mo", "created_utc": 1658985862.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 61, "comments": [{"body": "My advice is to rip the band-aid of perceived safety. \n\nTake that 100k loan. Get margin so you can 2-5x leverage. \n\nYolo all 200-500k on 7DTE spy call/put of your choosing. \n\nEither you're poor for life or your rich. \n\nPost on WSB not here.", "score": 21, "replies": [{"body": "A slightly less insane version of this.\n\nInstead of buying the single options, go full send on selling the naked straddle or a tight strangle on SPX \n\nNow your bet is the market doesn't have a stroke or jizz its pants in that time span.", "score": 5, "replies": [{"body": "“the market doesn't have a stroke or jizz its pants in that time span.”\n\nAhh yes, the two market outcomes..", "score": 2, "replies": [{"body": "You profit off selling naked short straddles/strangles by the market not violently moving.\n\nThe original suggestion requires OP to be directionally right. Still would be a very high risk play but arguably less risky than one direction only.", "score": 1, "replies": [{"body": "If OP had pulled the trigger and bought spy calls, he would've 10xed it today.", "score": 1, "replies": [{"body": "And if he had bought puts because we officially entered a recession, shambles", "score": 2, "replies": [{"body": "Don't you love this market. \n\nIt's makes no sense. I'm all cash and oil and I dunno if I should buy the fid500 or sit it out.", "score": 1, "replies": []}]}]}]}]}, {"body": "Baby games. Open a long synth future weekly expiry on highest volatility earnings play you can find.", "score": 2, "replies": [{"body": "Owe a bank $100,000, that's your problem.\n\nOwe a bank $1,000,000 that's their problem 😂", "score": 1, "replies": []}]}]}, {"body": "If only you could buy options with margin.", "score": 1, "replies": [{"body": "You can buy options on margin. All though not usually 7DTE lol. \n\nThink the legal limit is 9 months. You can write/sell options on margin though which is basically the same thing if you know what your doing.\n\n\n(I'm drunk af so don't quote me on any of this. Pure remembering lol)", "score": 1, "replies": [{"body": "You cannot.", "score": 1, "replies": [{"body": "YOU cannot. \n\nGet that credit score up", "score": 1, "replies": [{"body": ">Brokerage firms generally require you to have a margin account to trade options, but they do not allow you to use margin to purchase options contracts. However, brokerage firms may allow you to use margin to sell (or write) options contracts.\n\n\nhttps://www.sec.gov/oiea/investor-alerts-and-bulletins/ib_marginaccount#:~:text=Options%20Trading%20Using%20Margin&text=Brokerage%20firms%20generally%20require%20you,(or%20write)%20options%20contracts.", "score": 1, "replies": [{"body": "Bro. You're like a broken record trying to prove your point. \n\nYou literally just proved one half of my statement. Here's the other half. \n\n“Buyers of options can now buy equity options and equity index options on margin, provided the option has more than nine (9) months until expiration. The initial(maintenance) margin requirement is 75% of the cost(market value) of a listed, long term equity or equity index put or call option.”\n\nhttps://www.cboe.com/us/options/strategy_based_margin/\n\n\nYOU cannot. Because YOU don't have the kind of money to buy options on credit. Do you really think huge tradeing firms  are actually handing over cash for every transaction? \n\nIt's all fake until someone gets called or they hit the transfer button.", "score": 1, "replies": [{"body": "Let's make this simple. What broker are you on?", "score": 1, "replies": [{"body": "Let's make this really simple. Read what I said in the second post and then read those articles you just linked me. \n\nYou're hell bent on proving that you can't buy an option on margin and you've been beaten on a technicality all because you wanted to disprove my original drunken funny comment about yoloing 500k on spy calls. \n\nYou're the kinda person that makes everyone around them want to stab their eyes out.", "score": 1, "replies": [{"body": "Why won't you just answer lol. I can then prove you wrong quickly.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Take out 150k, activate portfolio margin, borrow the rest via box spreads with much more favorable rates, take your positions.\n\n....get liquidated instantly\n\n????\n\nprofit?!", "score": 19, "replies": [{"body": "Box spread rates are almost 3.5% right now.  Not great.  Better than TDA margin though.", "score": 3, "replies": []}]}, {"body": "“I want to do something insanely ill-advised and I know it is ill-advised, so I just want to hear from other people who have done such ill-advised things”\n\nAt this point, screw it - just do it. I’m rooting for you.", "score": 38, "replies": []}, {"body": "[deleted]", "score": 17, "replies": [{"body": "None, but it can't possibly go tits up, so it should be good", "score": 4, "replies": []}, {"body": "*Days", "score": 2, "replies": []}, {"body": "OP: That brings up another option. I've made money for two months now. How much longer until I could quit my job (55k/yr) and just sell options? Anyone doing this?", "score": 1, "replies": []}]}, {"body": "Let's say you do this and then your puts go deep in the money.  If you take assignment and sell covered calls at your cost basis the premium you'll collect will be tiny compared to what ur calculation is predicting.  If you sell below CB to maintain the premium your collecting you risk locking in a large loss if your shares get called away. Rolling your short puts is synthetical equivalent to the covered call positions and will also bring in tiny premiums if you're deep itm.  Your borrowed capital could get tied up in the underlying generating little to no premium.\n\nFor this reason you cannot project forward yields from option premium as if they are fixed income payments. The money you have to pay the bank each month is fixed and the premium you can generate is not.", "score": 16, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "*Insert guy and butterfly meme*\n\n”Is this financial advice?”", "score": 5, "replies": []}]}, {"body": "There is no substitute for experience.  Gaining that experience means making mistakes that can cost you, so will you be able to gain that experience and not lose a significant portion of the borrowed money?\n\nPaper trading can help, but is not real life trading and you may have to be patient while staring at your account being down for some time as this is how the wheel works.  Can you stomach this?  \n\nYou would not be posting asking this question if you had been trading the wheel successfully for a year or longer as you would have already made most of the mistakes and learned from them.", "score": 6, "replies": [{"body": "Quality feedback from a veteran trader 👆", "score": 2, "replies": []}]}, {"body": "I'd advise buying stocks with a long track record of paying dividends above your interest rate. Sell CC on those stocks if you'd like.", "score": 5, "replies": []}, {"body": "Don't do it OP, please", "score": 16, "replies": [{"body": "This", "score": -3, "replies": [{"body": "Hey there keenlyproper_demeanr! If you agree with someone else's comment, please leave an **upvote** instead of commenting **\"This\"**! By upvoting instead, the original comment will be pushed to the top and be more visible to others, which is even better! Thanks! :)\n***\n ^(I am a bot! Visit) [^(r/InfinityBots)](https://reddit.com/r/InfinityBots) ^(to send your feedback! More info:) [^(Reddiquette)](https://www.reddithelp.com/hc/en-us/articles/205926439#wiki_in_regard_to_comments)", "score": 3, "replies": []}]}]}, {"body": "I’m having PTSD to when I was assigned on my CSPs and thought I would wheel DKNG at 40, PLTR at 24, SOFI at 16, etc etc", "score": 4, "replies": [{"body": "Bag holding and talking smart is a critical part of the wheel 🥹🤘🏽😘", "score": 5, "replies": [{"body": "this is sparta", "score": 1, "replies": []}, {"body": "If an increase in property taxes were what got you, you probably couldn’t afford it in the first place. In my experience they rarely go down enough to care about.", "score": 1, "replies": []}]}]}, {"body": "I took out 30k to trade with. It’s been going ok but generally the answer is no. Only do it if you can pay it off comfortably in a worst case scenario at least is what my real advice is. Unless you just would rather say fuck it and declare bankruptcy lmao", "score": 3, "replies": [{"body": "I can’t imagine they could “pay it off comfortably” or they wouldn’t be taking out the loan in the first place. 🤷‍♂️", "score": 4, "replies": [{"body": "He didn't say comfortably doesn't take 5 or 10 years at the minimum payment 🤣", "score": 4, "replies": []}]}]}, {"body": "Try executing on a paper account for your loan about for a few months.  Sometimes it’s a little tougher than you expect and at least on paper trades you’ll learn the lesson for free.  Leverage to wheel high beta is going to end in disaster.  Without experience you don’t have a chance", "score": 3, "replies": []}, {"body": "Let me get this straight: The Fed is raising interest rates (thus increasing the rate you have to pay for a loan), and economists all over the globe are predicting a worldwide recession (thus decreasing the growth of high beta stocks), and this is your idea? \n\nIt’s brilliant. Please report back daily on how this is working for you. I love a good rags-to-bankruptcy story.", "score": 3, "replies": [{"body": "Staking out when everyone else is paralyzed in fear is a bold strategy. High risk, high reward.", "score": 2, "replies": [{"body": "This idea would have been less stupid when interest rates were at historic lows and every trash stock on the market moved 20% in a day.", "score": 2, "replies": []}]}]}, {"body": "I've also thought about this as I always get 50k plus loan offers and have went as far as checking the rate at the time was 6.7%. I was like damn I can write ATM calls on TSLA every week but more if assigned and keep doing this weekly and have cash flow of 2k+ weekly...  Yeah no way it would work it's too easy.", "score": 6, "replies": []}, {"body": "Only wouldve done this on SPY/SPX if we drop <300, all other stocks seem too risky at the moment", "score": 3, "replies": []}, {"body": "Do an installment collar instead at least your principal would be somewhat protected", "score": 2, "replies": []}, {"body": "Depends on the interest rate of the loan and the payment structure. If it’s interest only for a year and then you have to pay it back in full or start paying it down you have something to work with. \n\nI took a 0% interest balance transfer of 10k with a 3% fee and all I do is sell puts far OTM with it. \n\nWith 100k you could get portfolio margin and sell lottos all day long. I would do it\n\nNote: I have a 50K account and the capability to cover any losses I may create on the 10k. It is simply cheaper for me to use a balance transfer than use TD margin", "score": 2, "replies": [{"body": "100K is too low for portfolio margin, 125K is hard minimum. 150K is a realistic minimum.\n\nIf your PM account drops in value below 100K crazy bad things about to happen to you.", "score": 2, "replies": [{"body": "You are right I assumed he would add the 100k to his existing account but that was presumptuous", "score": 2, "replies": [{"body": "It's really absurd how rigged the system is against anyone who wants to climb the ladder if you weren't born on top the ladder.", "score": 1, "replies": [{"body": "Yeah I have $50,000 but turns out I need 150% of that to get PM. To be honest it allows me to learn everything I need to know over a 2-3 year time period before they let me potentially put myself in a position where I can lose millions on a 125k account", "score": 3, "replies": [{"body": "Looks like we're pretty much in the same boat with my 80k account Reg T account at 75% margin.\n\nI'm selling my home soon that has 50%+ equity in it. My next housing market will be more expensive. If I can cleave out cash sanely I want to push more into my taxable account.\n\nI expect my next home to be at or above that 405K median price that happened for the first time ever. So 100K down payment, probably.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This is dumb. Taking the loan and buying qyldgang is a much better business proposition.\n\nI do this, you can check my posts on it.", "score": 2, "replies": []}, {"body": "Do you have a high paying and stable job? Nothing wrong with using debt when you don’t need it, but if you can’t just write a check to cut losses if things go wrong then hell no. Better to save the cash yourself with current rates imo. If saving that kind of cash is hard, don’t borrow.", "score": 2, "replies": []}, {"body": "Lmk if you make your monthly nut to cover", "score": 1, "replies": []}, {"body": "Lol dafuq", "score": 1, "replies": []}, {"body": "Why not just save up that 50k first?\nOnly reason to do it would be if rates are too low now (such as if you had asked 6m ago) and you are afraid they will shoot up significantly by the time you save. \nThat ship has sailed so you might as well save first.\n\nAlso look at student loans/mortgages you might be able to get through someone. Much better rates. Not advice", "score": 1, "replies": []}, {"body": "Typing words like “I dunno” leads me to believe this is a bad idea.", "score": 1, "replies": []}, {"body": "Highly depends on what Stonks you’re going to be selling on. Can it be done? Yes. Do you have the personal responsibility and discipline to manage your portfolio like a business and take a fair amount of risk while cutting losses and being realistic at the same time if the position moves against you? \n\n$2k plus might not seem like a huge nut to cover on the low side of a longer amortization. But shit - what happens when your account value starts to slide and your premium collection dries up? Or the IV environment contracts and premium dries up all over the place. If you had the $100k without the monthly payment I’d be on board. But man…covering that 12% is….harder than you might think it will be and the premium value will change monthly to a degree that you can’t t really predict on your spreadsheet.", "score": 1, "replies": []}, {"body": "Yes 100% do it. You just have to make 10-20%/week and you'll kill it. Unless you like being poor. It's very low risk. Go for max zeta.", "score": 1, "replies": []}]}
