{"title": "Between this and twitter Tesla PUTS are gonna PRINT next week", "selftext": "[removed]", "id": "vzdxc9", "created_utc": 1657854017.0, "score": 78, "upvote_ratio": 0.81, "num_comments": 58, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|8 months ago\n**Total Comments**|14|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/utab6w/bought_some_520_puts_on_bke/) \n**Account Age**|8 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vzdxc9)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vzdxc9)", "score": 1, "replies": []}, {"body": "Elon has stated for years he hates his dad. He’s quoted as saying his father has committed every sin imaginable\n\nThat’s one horrible relationship and the definition of estranged", "score": 52, "replies": [{"body": "But yet he seems to follow the same ethos.", "score": 12, "replies": []}, {"body": "Still took his money. Lol", "score": 6, "replies": [{"body": "What does that even mean? Are you expecting him to say no at 3?", "score": -1, "replies": []}]}]}, {"body": "Seems like not pulling out runs in the family ![img](emote|t5_2th52|4640)", "score": 8, "replies": []}, {"body": "Literally has nothing to do with TSLA and I have puts", "score": 26, "replies": [{"body": "That’s like saying Twitter has nothing to with dogecoin. People trade on emotion and emotional trading triggers algos.", "score": -10, "replies": [{"body": "So this news is released after the guy who started the self driving program for Tesla leaves the company. I realize there’s more people than just Elon Musk who are the brains and backing behind Tesla. Then this news comes out. I can feel an emotion. But what does your dad have to do with your life. Less than you would think.", "score": 4, "replies": [{"body": "Right and now you just think “man this guy is in a downward spiral and playing with money like it’s monopoly! Oh wait fuck! He’s playing with my money too….” \n\nSelling ensues.", "score": 4, "replies": [{"body": "I don’t think that. That’s his dad. Not Elon. Does anyone think that anymore? You don’t have to live in your dads shadow", "score": 0, "replies": [{"body": "Nah you’re right that makes sense I mean clearly this article got posted on WSB because of Errol’s major presence in the stock world….. it’s almost like atleast one person thinks that way 🧐", "score": 3, "replies": [{"body": "Fun Theory: JPM staged this entire day to recover some losses.", "score": 2, "replies": [{"body": "More fun theory. Elon IS the father and old man musk is actually jumping this grenade to try and give Elon the fatherly support he should have from day one! Or in this case grandfatherly!", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "He looks super proud of it too", "score": 12, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Saying someone grandfather and dad at the same time....the horror !!", "score": 1, "replies": [{"body": "“Luke I am your father… and grand father… and possibly uncle”", "score": 3, "replies": []}, {"body": "(Grand)father", "score": 0, "replies": []}]}]}, {"body": "Wow, that's disgusting", "score": 3, "replies": []}, {"body": "what a depraved creature", "score": 3, "replies": []}, {"body": "Elon has 50 problems bigger than this. And they all matter to Tesla. Can’t separate the cult leader from the cult.", "score": 7, "replies": []}, {"body": "Got fuckall to do with the company. Diamond hands motherfucker. FUD don’t shake me", "score": 12, "replies": [{"body": "![img](emote|t5_2th52|4270)", "score": 3, "replies": []}, {"body": "That’s what I’m saying bruv. This is that tabloid news. Good for the can, doesn’t do shit to the brand.", "score": 2, "replies": []}]}, {"body": "Honestly we knew that from the picture no need for the article", "score": 2, "replies": []}, {"body": "I'm sorry English is my second language, does this title mean what I think it means?\n\nElon's dad is Humbert Humbert?", "score": 2, "replies": []}, {"body": "Gee, no wonder he doesn’t want to have anything to do with his dad.", "score": 2, "replies": []}, {"body": "What in the alabama is going on?", "score": 6, "replies": []}, {"body": "Who really gives a crap?", "score": 4, "replies": [{"body": "People who invest. Like father like son.", "score": -5, "replies": [{"body": "What does having illegitimate kids have to do with the way you run a company", "score": 2, "replies": [{"body": "It obviously speaks to character, which is not insignificant.", "score": 1, "replies": []}]}]}]}, {"body": "Nobody cares", "score": 3, "replies": []}, {"body": "Well that helps explain the weirdness....", "score": 2, "replies": []}, {"body": "We’re watching the fall of Elon Musk in real time", "score": 1, "replies": [{"body": "Just a prank brah", "score": 0, "replies": []}]}, {"body": "This guy fucks, literally", "score": 1, "replies": []}, {"body": "Yep, that checks out", "score": 1, "replies": []}, {"body": "Zeus lives", "score": 1, "replies": []}, {"body": "Tesla bulls reading this:\n\n![img](emote|t5_2th52|4735)", "score": 1, "replies": []}, {"body": "Hardly has anything to do with Elon.", "score": 1, "replies": []}, {"body": "I bet this is gonna get more attention from CNN than the Hunter Biden thing. I wonder why?", "score": 0, "replies": [{"body": "Why would someone care about Hunter Biden?", "score": 0, "replies": [{"body": "Why would someone care about Elon Musk’s father?", "score": 2, "replies": [{"body": "I kind of don't. It's mildly interesting given the recent Elon news.", "score": 2, "replies": [{"body": "It’s interesting media getting interested in Trump and Elon Musk’s “affairs”, instead of what really matters right now. \nPlease, don’t read my comment as if I’m against Biden, or pro Trump. \nJust remember when Trump was president, and absolutely everything that happened to him, his wife and kids was everywhere in media. It’s simply amazing how biased the media is. And it’s incredible the amount of false news that are around from “credible sources”.\nI remember reading about Biden’s son, and his business in Ukraine during the last elections. Maybe that has something to do with all the billions US has sent to Ukraine? (I live in the US and pay taxes, so it’s part of my money going there). We are not talking about insider trading in Congress, oil decisions that were made before and now are causing problems, food factories burned, shootings out of control in the US and many many more examples. Let’s focus on Elon Musk father, instead of basically helping him, for resurrecting the dead Space program from the US, or Neuralink, The Boring Company or Tesla, and for creating thousands of jobs around the globe.", "score": 1, "replies": []}]}, {"body": "Why would someone care about Elon Musk?", "score": 1, "replies": []}]}]}]}, {"body": "Why in earth would this have anything whatsoever with the price of tesla shares???", "score": 0, "replies": []}, {"body": "@maiaalexeiva：Buy XRP, XDC, DGB and Kuma Inu. Crypto all the way!", "score": 1, "replies": []}, {"body": "According to our Supreme Court Justices, incest is legal, women‘s rights to abortion is not.", "score": 1, "replies": [{"body": "Please take all unbabying talk to another subreddit. No one wants r/wallstreetbets to become a political hellhole.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Completely normal to parasites like him..", "score": 1, "replies": []}, {"body": "So is it like just normal for rich people to just be okay with being fucked up. I feel like they all have a meeting at epsteins house and discuss how much fucked up shit they can get away with. Rich people rule our world... and the money we use doesn't even have real value.", "score": 1, "replies": []}, {"body": "Honestly who gives a shit what his father does?", "score": 1, "replies": []}, {"body": "Elon flashing his Wang on a plane doesn't seem so strange now does it", "score": 1, "replies": []}, {"body": "Elon musk be turning wall Street into the stage of a gossip magazine", "score": 1, "replies": []}, {"body": "At least post the link to the source you tard", "score": 1, "replies": []}, {"body": "I trimmed Tesla. Andrej Karpathy leaving was very concerning for me. That guy is really good.", "score": 1, "replies": []}]}
{"title": "Why Gold is The Best Play | Hint: Not Because of A Recession", "selftext": "Russia recently moved to peg their currency, the Ruble, to Gold. The Ruble, which was crushed at the onset of initial US sanctions, has been on an absolute tear since they’ve made this decision which appears to have caught the US completely off guard. \n\nSome background - the US has been so successful the past decade because they have had the luxury of being the World Reserve Currency as the USD. This means all oil trades in USD and we reap all of the benefits that go along with that. This is at risk now as countries like Russia and China have gained traction in economical influence. The impact of moving away from the USD as the World Reserve Currency would be absolutely catastrophic to the United States economy. The unfortunate part is that the current administration is unwilling to unlock our abundant supply of natural resources and has been sending away all of our free cash overseas which is diminishing our leverage with big oil players, in addition to other countries advancing their military technology significantly. \n\nRead this for some more info here: https://www.usgoldbureau.com/news/is-brics-a-threat-to-the-dollar\n\nInterestingly enough, the G7 is now looking to ban gold imports from Russia. Apparently this was to be officially announced, but I have yet to see the official announcement myself and I don’t believe it’s made its way into mainstream media for some reason.  \n\nRead here for some more info: https://www.reuters.com/markets/commodities/g7-announce-ban-import-new-russian-gold-tuesday-us-official-2022-06-26/\n\nLastly, Biden is visiting Saudi Arabia this weekend. The discussion points and reasons for the visit have been relatively quiet. In my opinion, the administration is very concerned they will be moving away from the USD as the petrocurrency as they are in active discussions with China to begin using the RMB. I think the whole trip is to try to stop Saudi Arabia from doing so and that all of this was Russia’s entire strategy for starting the Ukraine war. \n\nRead between the lines here: https://www.cnn.com/2022/07/14/politics/jamal-khashoggi-joe-biden/index.html\n\nTLDR; Russia checkmated US with gold backed Ruble. USD will collapse and gold will reign supreme. \n\nPosition: lots of $GLD shares", "id": "vzfhek", "created_utc": 1657858780.0, "score": 16, "upvote_ratio": 0.63, "num_comments": 64, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|16|**First Seen In WSB**|1 year ago\n**Total Comments**|10|**Previous DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vzfhek)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vzfhek)", "score": 1, "replies": []}, {"body": "If you buy gold or silver make sure to buy the physical metal you can hold in your hands, not a paper share which means nothing", "score": 37, "replies": [{"body": "Yes but this is wsb and what’s interesting about GLD is that you can buy options on it. OTM gold leaps are cheaper and highly profitable. I’ve been watching gold for a long time and it’s taken a while for this scenario to play out", "score": 3, "replies": []}, {"body": "At an asset price of $1800 per ounce you can buy a gold bar at a total price of $1850 - $1890 per ounce. The premium is not that large compared to price per ounce", "score": 5, "replies": []}, {"body": "Makes sense but the premium and delivery fees as well as more difficulty liquidating it gives me pause. What do you do? How do you trade?", "score": 4, "replies": [{"body": "Honestly the premiums are nothing considering that the price of gold and silver are desperately undervalued due to the heavy market manipulation from JPM which is why they're in trial for spoof trading on the precious metals", "score": 7, "replies": []}, {"body": "You can easily liquidate gold and silver coin and bars at a local coin dealer LCS or trade directly with other precious metals stackers who can directly trade for food and services", "score": 5, "replies": [{"body": "Mother fucker what? Trade my gold bars for food and services? If our society regresses that far I'm not worried about carrying around pounds of gold. I'm hoarding bullets.", "score": 3, "replies": [{"body": "Services, like handjobs behind Wendy’s", "score": 5, "replies": []}]}]}]}]}, {"body": "Looking at your history, you have invested in Lordstown, Workhorse and Palantir. Forgive for not following your not financial advice.", "score": 32, "replies": [{"body": "PUT YOUR HANDS UP asvrpob!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 6, "replies": [{"body": "Bad bot", "score": 7, "replies": []}, {"body": "Pretty funny, since I said I personally won’t be following someone else’s DD, nothing about what others should do.", "score": 5, "replies": []}, {"body": "Dumb bot", "score": 2, "replies": []}]}]}, {"body": "The ruble isn't gold backed. They are buying gold at a set price, they set a price floor for gold in rubles. You can't trade rubles for a set amount of gold, that's what gold backing would be. \n\nBut I'm super long gold never should have sold off in 2011, should be 10k+ right now if people understood the Fed has no end game.", "score": 12, "replies": [{"body": "On March 28, 2022, the central bank of Russia (CBR) announced it would buy gold from Russian credit institutions (banks) at a fixed price of 5,000 rubles per gram.", "score": -9, "replies": [{"body": "Yes, that sets a price floor for gold. It does not mean the ruble is backed by gold.", "score": 7, "replies": [{"body": "It is pegged to gold as I mentioned. Look it up if you don’t understand the concept.", "score": -10, "replies": [{"body": "Haha bro, I DO understand the concept, I'm trying to explain it to you. They set a price floor for gold, they did NOT back their currency with gold.", "score": 8, "replies": [{"body": "5000 rubles = 1 gram gold.", "score": -1, "replies": [{"body": "https://www.gainesvillecoins.com/blog/is-russian-ruble-linked-to-gold", "score": 6, "replies": []}, {"body": "Dude...\n\nBuying gold at a fixed price - not backed by gold.\n\nSelling and buying gold at a fixed price - backed by gold.", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "So what do u all think about mining companies?", "score": 5, "replies": []}, {"body": "Banks make a lot of money rigging the precious metals paper-market... so good luck with your shares", "score": 10, "replies": [{"body": "Yes they do. But on the otherhand, maybe commodeties just react even more to inflation than gold and silver. People have to buy products made out of commodities. Gold and silver on the other hand are optional for those who can afford it.", "score": 5, "replies": [{"body": "Good point. I think this would be so big it’d be outside of the banks control as well.", "score": 1, "replies": [{"body": "Commodities should be favoured. Like Warren Buffet says, all you can do with gold is stare at it. Whereas something like farmland is a productive asset that produces 'stuff' every year and thus it's value is determined by the cashflow it produces. However, gold does not do such a thing - it's value is rather derived from it's ability to be utilised by businesses to produce a cashflow (price being determined by these businesses demand etc). In inflation, people can't buy jewellery or electronics etc rather need to meet base needs - eg energy requirements. Sure, gold may go up, but it's probably a pretty poor investment when there's a ton of better companies/businesses to buy out there in this environment. Also, highly liquid assets like gold are usually the first thing to be sold during a crash/recession not the other way round (as a lot of fraudulent market 'gurus' who shill gold without much thought would like you to believe). Also, gold is also a poor means to replace a currency. One of the properties that a currency should have is minimum variance properties (read some of the work by Nassim Taleb). Gold simply doesn't meet that as we have clearly seen from it's history", "score": 3, "replies": []}]}]}]}, {"body": "My body will rot before this play can print.", "score": 6, "replies": [{"body": "lol get FDs then bro have you seen how low IV is? could be a life changer in the snap of the fingers if this plays out how I think it does", "score": 0, "replies": [{"body": "In the best way possible... you're extremely regarded", "score": 7, "replies": [{"body": "Some would say, the MOST regarded. Truly, everyone agrees.", "score": 2, "replies": []}]}, {"body": "GL with play, but you've been warned. Gold move on a multi years/decade time scale and you're essentially betting against JPM and the LBMA", "score": 2, "replies": []}]}]}, {"body": "I have lots of GLD and SLV too but it’s not playing out like I thought. The dollar is too strong but it has a parabolic rise so maybe it will reverse just as hard, GLD and SLV will rise as the dollar crashes. CNBC’s carter is bearish on the dollar short term.\n\nhttps://youtu.be/f0IcGF6deFI", "score": 3, "replies": [{"body": "It’s just getting ripe now. Please read the entirety of the articles I’ve posted if you haven’t already, I’d be more confident than ever in holding those positions. The dollar is exactly where you want it for a strong Gold run.", "score": 1, "replies": [{"body": "Here’s hoping. ![img](emote|t5_2th52|4270)", "score": 0, "replies": []}]}]}, {"body": "That is probably why paper gold doesn’t go up, to not let Putin profit?\nAnyway, if we dó want gas again and pay in Ruble the gas prices will be multiplied because of our own stupid sanctions, the Ruble is not 2 cents anymore.", "score": 2, "replies": []}, {"body": "If we collapse, the world will collapse. We'll blow Russia off the map first if Russia could collapse the USA.", "score": 2, "replies": []}, {"body": "If you can buy gold with your paper bills, The currency is backed by gold.... That's the game folks . Eat some 🌵you'll figure it out. This is the", "score": 2, "replies": []}, {"body": "Note - the Ruble has gone up so much in fact that Russia has had to significantly devalue their own currency just so they can be competitive exporting.", "score": 4, "replies": [{"body": "Cite for the devaluation?", "score": 3, "replies": [{"body": "https://www.cnbc.com/2022/06/23/russias-ruble-is-at-strongest-level-in-7-years-despite-sanctions.html", "score": 1, "replies": [{"body": "I literally searched the article \\[CTRL+F, \"devaluation\"\\] and there is no mention of devaluation.", "score": -1, "replies": [{"body": "lol read the second bullet point. weaken = devalue", "score": 1, "replies": []}]}]}]}, {"body": "No, russia put monetary controls on buying foreign currency, they raked central bank interest rate to 20%, during March-April banks were offering up to 23% for deposits in rubbles ( which even great Ponzi haven’t dared to offer), savings accounts in euro and usd were offered at 2% max. This points to high currency devaluing expectations, car manufacturing dropped almost 95% in May. Sales are plummeted. Foreigners can’t sale stocks they own, can’t take money out of russia, major companies are canceling dividends. Government  prohibited disclosing central bank balance sheet and many key financial indicators, which truly should bring investors. Russia didn’t made their bond payments to creditors, stole leased planes and industrial equipment, even Chinese high tech companies are leaving russian market. Importers were forced to sell 80% of their foreign currency. So tell me again how well off \n russian economy right now and how prosperous they will be in a future.", "score": 2, "replies": [{"body": "you’ll find out soon when I see you behind Wendy’s.", "score": 1, "replies": [{"body": "Who told you I would let you look up?", "score": 3, "replies": [{"body": "no no , you’re the guy behind Wendy’s.", "score": 0, "replies": []}]}]}]}]}, {"body": "In only a few short years Russia will have a very nice living standard and a powerful currency. They are smart", "score": 2, "replies": [{"body": "Has russia ever had a nice living standard in the entirety of their existence?", "score": 2, "replies": []}]}, {"body": "We should backup our money with nfts. Far more stable.", "score": 1, "replies": [{"body": " No we should stick with the US dollar backing us..  oh wait", "score": 2, "replies": []}]}, {"body": "I will go buy gold soon. But for now I wait, because imo gold will continue to fall for reasons I dont wanna explain righy now. \nBut for the long term, gold will be great.\nThe US and western sanctions and freezing of russsian assets showed that its not a good idea to let have foreign countries hold governmental assets.\nFurthermore, the rising USD as savehaeven iturns out to be an double edged sword. Because letting buy USD from your own centralbank lets the exchangerate go up and imports of energyimports only more expensive, which effs up your own economy. Centralbanks and governments wouldnt have this kind of trouble if they would have invested in gold. Turns out fluctuatoons in the goldprices arent as bad as too expensive energycosts and  energyshortages.", "score": 1, "replies": []}, {"body": "Gold is going below $1600 and Silver $17", "score": 1, "replies": [{"body": "hedgies getting nervous eh", "score": 0, "replies": [{"body": "SLV puts from $24 are GOLD. GDX from $38 are even more brilliant", "score": 2, "replies": []}]}]}, {"body": "Gold is soooooo boomer. Crypto is the new gold lol", "score": -7, "replies": []}, {"body": "Enough boomer shit. We are in times of uncertainty and that shit still goes down. No one cares.", "score": 1, "replies": []}]}
{"title": "The $TWTR vs. Musk judge is one of the few in DE history to force a buyer to close on an acquisition - just last year she forced Kohlberg to close on a $550M cake decorating products company. Will she stick Elon with Twitter? First hearing is Tuesday.", "selftext": "Chancellor Kathaleen McCormick scheduled the first hearing in the Twitter vs. Musk case on July 19 where she will decide whether or not to expedite discovery and trial preparation in order to conduct a four-day trial in September. The judge joined the court back in 2018 and last year became the first woman to lead the DE court. [https://www.nasdaq.com/articles/newsmaker-judge-in-twitter-v.-musk-once-made-rare-ruling%3A-ordering-a-deal-to-close](https://www.nasdaq.com/articles/newsmaker-judge-in-twitter-v.-musk-once-made-rare-ruling%3A-ordering-a-deal-to-close)", "id": "vzzvqj", "created_utc": 1657921089.0, "score": 37, "upvote_ratio": 0.85, "num_comments": 58, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|42|**First Seen In WSB**|1 year ago\n**Total Comments**|366|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vzzvqj)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vzzvqj)", "score": 1, "replies": []}, {"body": "Elon is going to knock her up before the case is decided.  She will rule in his favor to get better child support.", "score": 48, "replies": [{"body": "![img](emote|t5_2th52|8883)", "score": 3, "replies": []}, {"body": "Ouch", "score": 2, "replies": []}, {"body": "Haha!!!  Way too accurate.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 22, "replies": [{"body": "It's Wall Street Chats now.", "score": 7, "replies": []}]}, {"body": "there are no coincidences", "score": 3, "replies": []}, {"body": "Does she drive a Tesla?", "score": 2, "replies": []}, {"body": "I bought 500 shares of Twitter. Want to buy 500 more. Easiest money ever", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "My position is firmly behind your mother", "score": 1, "replies": []}, {"body": "Competitive_Ad498 has challenged someone to post their positions! \n\nCompetitive_Ad498, if someone has made a claim that they bought / sold something and fails to prove it within 24 hours, message the mods to have them banned.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Ah yes a company that has never made a profit which only makes money from ads whose advertisers all just had their confidence shaken by twitters refusal to show their bot numbers. \n\nYeah super easy money. \n\nAlso there's absolutely no way musk is forced to buy twitter. Best case scenario they force the penalty of $1 billion with some damages slapped on top.", "score": -1, "replies": [{"body": "You’re an idiot with no clue what you’re talking about. Musk is probably Gona be forced to fulfill the deal. In which case nothing about Twitter matters cause I’ll be getting paid 54 per share. \n\nWorst case for Twitter is he’s forced to pay closer to 10-15B to make up for the diff between Twitters current share price and his offered price. \n\nAs I said, you don’t know anything about contracts and I doubt you read this one.", "score": 1, "replies": []}]}]}, {"body": "You clowns forget that DISCOVERY will make Twitter look horrible and they will get sued by their investors and SEC.", "score": 4, "replies": [{"body": "Won’t matter if he’s forced to buy em", "score": 5, "replies": [{"body": "So merger agreements are complete bullshit? that's basically what you're say'in. Fuck contract law what a pointless discipline that shit is. Twitter is swinging for the fences in order to prove diligence and avoid lawsuits. Twitter is fucked.", "score": 4, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "What the fuck are you smoking? If elon buys Twitter it’s not on the market anymore. He owns it. Twitter is a company. Not a person.", "score": 7, "replies": [{"body": "He waived DD like most people on this board, even secured financing before he had the data he wanted. He started on step five and is now complaining he didn't do step 1. I hope the purchase gets forced. The only reason he wanted that data was for personal use so now he'll just personally own Twitter.", "score": 3, "replies": [{"body": "And waiving DD due to filings with SEC that are proven false during completion is all he needs.  Their contract has the standard criminal activity clause.\n\nThe SEC is not going to publicly take the fall for not doing their job.  It’s why they are increasing scrutiny.\n\nHe still has his stake, so he cannot be accused of a pump and dump.\n\nHe drive the price down?  Price is still higher than before he started this.  His actions causing the price to drop?  Whole market is in a downturn.", "score": 3, "replies": [{"body": "And the fun little clause you're forgetting in all of their filings is 'reasonably believes'. What that means for the smooth brains in the front is that as long as Twitter made a commercially reasonable effort to collect this data and presented it in a way that isn't patently false then the SEC has no say. \n\nIn short, they can probably get away with botting being calculated as high as 15-20% because of some calculation method. Doesn't mean it's right, doesn't mean it's wrong. You can make the data say whatever you want, that's why EBITDA is generally considered a garbage metric. That's not against SEC filing rules. Everything else you said doesn't matter.", "score": 5, "replies": [{"body": "I am not forgetting reasonably believes.  I intentionally left that part out.  Typed it up and deleted it.  Reasonably believes, from the media that already had \"smart\" people and \"experts\" saying that of course the numbers are more like 30-40%?  The people for and against the acquisition stating \"Of course it is overran by bots\"?\n\nAs for bot calculation it was estimated at 5% or may be higher.  May be higher is the issue here. I feel most people people logically would understand the fluctuating nature and if it came back at 7% or even as high as 10% (think election season) would be reasonable.  5% or may be exceptionally higher would make me feel 15%-20%.  The key here is the key piece missing.  We know that the number is not under 5% and never was or will be because they did not use 5% and the number may be higher or lower than this estimate.\n\nNo I don't think Musk is some smart master tactician, but like I said it before, he has the money to buy and retain the people that are.  \n\nElon has to prove that the Material Effect stuff is legit, this means that either Twitter shows up correct to court with data in hand or will have to produce the data in a reasonable time frame to prove other wise.\n\nEither way, we are all just morons tossing out our opinions.  Even if one of us was a lawyer, we are nowhere close to doing Billion dollar deals.", "score": -1, "replies": [{"body": "Bro you're just talking at this point. I can't just sue a company with some outrageous claims and then expect them to show up with trade secrets to prove me wrong. Again, he waived due diligence and secured funding BEFORE going to Twitter. He ALREADY decided to make the purchase before he even sent the offer, he didn't ask how much, he told them. \n\nHe wants to walk it back now that he had access to the firehose. He blew through 100k searches in 2 weeks. This was either to train his own technology or to collect the data he needed to start his own company. \n\nHe's an expert troll, and for that he is capable of thinking a few steps ahead, but I'll very surprised if he walks away from this only paying the breakup fee. He played himself.", "score": 2, "replies": [{"body": "This is where we disagree.  I can see you dislike the guy.  that is cool, but i neither like him nor dislike him.  I am just looking at things logically.  Most people seem to think the hearing on Tuesday the Judge is going to say \"Suck it Elon\" and start popping bottles or something.  It is going to take time, and even Legal heads are saying by the fall.  Time is what Twitter doesn't have.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "It won't happen, not in a Trion years. They could get his billion, but that is extremely unlikely. The billion break-up fee is almost double what she ordered. There is really no way it will happen at $54, perhaps arbitration and a renegotiated amount. \n\nWSB is full of the dumbest humans on earth, don't believe a damn thing you see on here.", "score": -5, "replies": [{"body": "This is going to age extremely poorly. You don’t have a clue what you’re talking about.", "score": 7, "replies": [{"body": "What are your positions on twitter?", "score": 3, "replies": [{"body": "Bought 500 shares. Plan to buy 500 more now", "score": 1, "replies": [{"body": "Positions or ban", "score": 2, "replies": [{"body": "Well played", "score": 2, "replies": []}, {"body": "tinnylemur189 has challenged someone to post their positions! \n\ntinnylemur189, if someone has made a claim that they bought / sold something and fails to prove it within 24 hours, message the mods to have them banned.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "Are you an idiot? What the fuck do you think I just did", "score": 1, "replies": [{"body": "Someone's not familiar with how wsb works", "score": 1, "replies": [{"body": "Or you’re too fucking dumb to know that purchasing 500 shares is a fucking position", "score": 0, "replies": [{"body": "See you in 24 hours ;)", "score": 1, "replies": [{"body": "I’ll be fucking your mother in 24 hours.\nMake sure to knock. Elon isn’t your daddy anymore you little bitch", "score": -1, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You have no clue what you’re talking about. The “break up fee” is not what people think it is. He does not have an option to get out of the deal by paying a fee. The fee is more along the lines if something happens outside his control, like inability to get regulator approval or financing.\n\nOdds are he will be forced to purchase it. Delaware has a long history of forcing specific performance in these situations, and the contract specifically states that specific performance is what should happen in This case. Even if they don’t, Delaware will try to make Twitter whole as best they can. That means forcing musk to pay 10-15B to make up for the damage he caused", "score": 0, "replies": []}]}]}]}, {"body": "You can’t force him to buy it when they overstated their numbers.  Like what?", "score": -7, "replies": [{"body": "1. You absolutely can, just look at IBP v Tyson\n2. Even if they overstated (Good luck on Musk's part to prove it), it needs to be judged materially overstated, as in, it would affect the company performance (Also worth noting, it needs to change the company performance in the long run. To prove that is... Nearly impossible, since Twitter's business model is about as clear as fog). If Twitter has more bots than stated, then their profit per user is actually higher and that goes AGAINST Musk's argument. \n3. Elon basically fucked himself over when he signed the Merger Agreement without doing the prior due diligence. Due Diligence is something you do before you officially state your intention to buy.", "score": 8, "replies": [{"body": "1. No in this case. 🤡 \n2. He doesn’t have to prove it. 🤡 discovery is where Twitter will have to show their real numbers and bot counts which goes back to their filings with SEC being false. \n3. Elon never wanted to buy Twitter clown. The “he didn’t agree to due diligence” is a meme /wsb and 🤡 believe. That’s not how that works when you are a public company.", "score": -8, "replies": [{"body": "Yes he has to prove everything, the burden in on Elon. Why? HE SIGNED A FUCKING CONTRACT OF SALE. He also waived dd. Contract 101, you sign a deal you can’t back out of it and claim fault on of the other party without proof. He needs to show proof.", "score": 5, "replies": [{"body": "Bahaha contract 101. Go back to school 🤡.  This is MA so your contract 101 is out the window and now that Twitter sued it’s a whole different ball game. Did you even read the details of the deal? How stupid are you?", "score": -7, "replies": []}]}, {"body": "These are all hallucinations you had with no grounding in reality", "score": 4, "replies": [{"body": "I read / research more about MAs than you do 🤡", "score": -2, "replies": [{"body": "In your hallucinations sure", "score": 1, "replies": []}]}]}]}, {"body": "There is no chance she will force him to buy it, 0.000000%. There is a break-up fee, they may get that, but that is extremely unlikely.\n\nShe may force them into arbitration to settle at a different arrangement, lower price or stock swaps.\n\nIf you think you're right then go buy a bunch of $50c expiring in October. If you don't have the conviction in your statement enough to take a position then you should be keeping your mouth shut.", "score": -7, "replies": []}]}]}]}, {"body": "Back to bed, Andy Griffith.", "score": -3, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Case file? you mean complaint? I highly doubt that you sound like a retarded kid. WTF this looks like it was sperged by a bot.", "score": 1, "replies": []}]}, {"body": "I read most of the complaint; it was like it was drafted by first year law students with a bunch of ad hominem and screenshots of his memes. None of that shit matters. It comes down to one question did TWTR or didn't TWTR satisfy the merger agreement. Musk decides this question not the board. Musk didn't sign off; so i'm thinking about puts on TWTR and have been for a week but i'm chicken shit. Because you know Musk is fucking crazy. If the agreement is dead and his wolfpack dumps who knows what 10%+ for sure we'll see some serious shit. 0.02", "score": -3, "replies": [{"body": "To be fair, the complaint was VERY well written.", "score": 2, "replies": []}]}, {"body": "Elon is 🥒🍑💦", "score": -1, "replies": []}, {"body": "I wonder if this Elon stuff about his family is coming out to hide this, but to me it seems pretty open and shut. Elon asked for data, which was required in the contract (allegedly, I can't read), they didn't give it, so he pulled out.\n\nedit: insert *pull-out joke*", "score": -7, "replies": [{"body": "Slightly more complicated than that. Twitter did actually provide everything asked for in the contract, the problem is that the contract asked for a firehose of raw data that is completely useless determining bot count. Musk also waived a good many rights that he initially wanted during negotiation. \n\nTwitter abided by the rules of the contract, so their argument is fairly textbook bad faith acting. \n\nMusks argument rests on a less concrete allegation that Twitter did not accurately determine their bot count as requested, with his case alleging that he only broke contract because they did first. \n\nMany things will need considering in this case, particularly tweets Musk made about the deal, in order to determine which party actually broke the agreement first. The previously mentioned tweets do seemingly indicate Musk never wanted to close the deal, which helps the case Twitter is building. As it stands, from a strictly legal point, Twitter has a stronger case. It will be an interesting trial. \n\nThat all being said, I'm not entirely sure that having to force someone to buy your company is going to do wonders for its valuation. That certainly seems to indicate it wasn't actually worth the asking price.", "score": 7, "replies": [{"body": "Twitter provides the firehose to external companies. They have done so in the past; one of those companies errr being the fucking NSA. I agree; with the rest Musk has an exit button and he pushed it. It's up to twitter to prove their numbers and they refuse to. When they claimed trade secrets is when it started looking really bad. It's a giant ponzi filled with bots that's been stealing money from the ad market and duping stockholders for years", "score": -3, "replies": [{"body": "See the problem is that Twitter did what was expressly stated in the contract. They provided exactly the data they were asked to. Musk now must prove they acted in bad faith first. It's not good enough in court to just say it, he needs actual evidence.", "score": 3, "replies": []}]}]}]}]}
