{"title": "Spy December 14th recap and analysis for December 15th", "selftext": "[removed]", "id": "rgqkrh", "created_utc": 1639542968.0, "score": 70, "upvote_ratio": 0.86, "num_comments": 28, "comments": [{"body": "Thanks this was super helpful! I didn’t hear the rumor about the tapering and have calls for Friday. I’m going to try to sell those in the am and watch and wait. I might take some lotto puts an hour before he speaks.", "score": 6, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I've got Bloomberg and CNBC in the background and I'm waiting to see which way we start to go. I'll continue to sit on the sidelines if we drop, but I want to get back in with SPY calls soon.", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "I missed that initial mini-whipsaw, but I'm up 15% on 1/28C $470 long. I don't normally buy OTM calls but I'm light on cash because I guess my family likes Christmas presents lol", "score": 2, "replies": []}]}]}]}]}, {"body": "Thank you for this. I too have been looking for a dedicated $SPY discussion board but to no avail. This was very helpful and thought provoking.", "score": 6, "replies": []}, {"body": "Obviously waited way too long for a write up, that was nice work!\n\nThanks!", "score": 4, "replies": []}, {"body": "If you create a spy sub please let me know!", "score": 4, "replies": []}, {"body": "Great analysis, I was watching spy and qqq all day and agree with your prediction for the near future.", "score": 4, "replies": []}, {"body": "Really enjoyed the write up. I’m thinking of a call credit spread at 470/471 I’ll take out in an hour or two after open to expire today. \n\nHave you thought about making these write ups a weekly thing or multiple times a week type thing? I think a lot of people would appreciate it.\n\nEdit: got in at 468/469 a little before 11am.\n\nEdit2: straight up did not have a fun time.", "score": 3, "replies": []}, {"body": "Nice analysis! Surprising there isn't a dedicated SPY subreddit -- seems like there's one for everything else!", "score": 3, "replies": []}, {"body": "Thanks.  I am very much intrerested in SPY.  I tries a strangle one.  Got out the put too late.  I will look for your posts.  What are your daily goals for scalping SPY?", "score": 2, "replies": []}, {"body": "I played too close to expiration.  I agree there may not be a Santa rally.  There is too much news coming out.", "score": 3, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Hey that's a great return.  Better than 0.  I know someone who scalps but I think his expiration dates are close but that is not necessarily a requirement.  The option may be  cheaper but the risk is high.  Good strategy.  Learning something from your post already.", "score": 3, "replies": []}]}]}, {"body": "SPY 500 EOY.", "score": 2, "replies": []}, {"body": "Awesome. Keep it up", "score": 2, "replies": []}, {"body": "I think the market has baked in the more aggressive taper, and expects a far more hawkish stance from JPEEZY, I also think he understands the effect that every word he says will have on the markets and could trigger a pretty substantial correction.  Long term I see two rounds of tapering and that's it. I don't think the economy is robust enough to take much more than that.  Keep in mind I am an idiot with no Idea of what I am talking about.", "score": 3, "replies": [{"body": "As a fellow idiot I appreciate the disclosure. Now lets gamble on the stock market!", "score": 2, "replies": []}]}, {"body": "Great analysis. Have you seen u/optionsmillionaire sub? He trades SPY exclusively and he live streams his day trading too. Lots of discussion from similar minds there, worth a look for sure.", "score": 2, "replies": []}, {"body": "Are you referring to OPtions EXpiration this Friday (and quad-witching) and not OPEC?", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I don't see any OPEC meetings for this week", "score": 1, "replies": []}]}]}]}
{"title": "Here's Your Daily Market Brief For December 15th", "selftext": "**📰 Top News**\n\nS&P Futures: -0.05%; DOW Futures: -0.02%; Nasdaq Futures: +0.01%\n\n**US stock futures are mixed Wednesday morning trading** as investors readied themselves for a highly anticipated decision from the Fed later today.\n\n**Omicron \"going viral\"** \\- The World Health Organization sounded the alarm on the Omicron variant, stating that it is spreading faster than any previous strain and is probably present in most countries of the world. \n\n**US crisis averted! for now...** *-* The US Senate passed legislation that paves the way for the US debt ceiling to be raised, mere hours before the deadline that could have marked the first US default in history. *Note: The bill now heads to the House where it is expected to be approved and sent to President Joe Biden's desk for signature*\n\n**A pill to fight Covid?** \\- Pfizer has said the final analysis of its anti-viral Covid-19 pill showed 90% efficacy in preventing hospitalizations and deaths in high-risk patients. *Note: There are currently no oral anti-viral treatments for Covid-19 authorized in the United States.* \n\n&#x200B;\n\n**🎯 Price Target Updates**\n\nBarclays downgrades Domino's Pizza. DPZ downgraded to UNDERWEIGHT from EQUALWEIGHT - $495 (from $500)\n\nDZ Bank upgrades Oracle. ORCL upgraded to HOLD from SELL - $105\n\nCitigroup upgrades United Parcel Service. UPS upgraded to BUY from NEUTRAL - $250 (from $245)\n\n&#x200B;\n\n**📻 In Other News**\n\n**Google drops vaccine hammer on employees** \\- Google told its employees that they will lose pay and eventually get fired if they don't comply with the company's vaccination policy. *Note: An internal memo said that employees who have not complied with the vaccination rules by Jan. 18, 2022 will be placed on \"paid administrative leave\" for 30 days, then unpaid leave, then termination.*\n\n**Every Doge has its day...** *-* Tesla CEO Elon Musk said the electric car maker will accept Dogecoin as payment for merchandise on a test basis, causing a spike in the meme-coin. *Note: Musk, a cryptocurrency supporter has often endorsed Dogecoin for transactions, most recently in a Time magazine interview*\n\n**Cuomo ordered to pay up** \\- Former New York governor Andrew Cuomo has been ordered to repay more than $5 million in compensation he received for a book he wrote in 2020 on his handling of the Covid-19 pandemic. *Note: The Joint Commission on Public Ethics voted 11-2 requiring Cuomo to repay within 30 days all proceeds received from the sale of the book.*\n\n&#x200B;\n\n**📅 This Week's Key Economic Calendar**\n\n**Wednesday**\\*: Business Inventories (Oct), FOMC Rate Decision, Fed Chairman press conference\\*\n\n**Thursday**\\*: Initial jobless claims (wk end 11-Dec), Markit US Manufacturing PMI\\* \n\n**Friday**\\*: No major economic events\\*\n\n&#x200B;\n\n**📔 Snippet of the Day**\n\n***Quote of the day:*** *\"Be open to and welcoming of unforeseen events because those unplanned moments are often the seeds of spectacular opportunities in your life\" -Pat Flynn*", "id": "rgzama", "created_utc": 1639575477.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 21, "comments": [{"body": "what time is the fed conderence?", "score": 2, "replies": [{"body": "They finish the meeting at 2pm and go live right after.", "score": 2, "replies": []}]}]}
{"title": "Here is a Market Recap for today Wednesday, Dec 15, 2021. Please enjoy!", "selftext": " \n\n**PsychoMarket Recap - Wednesday, December 15, 2021**\n\nThe stock market opened the day but reversed course and bounced today as investors digested the Federal Reserve’s final monetary policy decision of 2021 and Fed Chair Jerome Powell’s speech against a backdrop of persistent inflationary pressures. Bond yields rose up in the immediate aftermath of the Fed’s announcement, rising above 1.46%.\n\n**Notable Numbers Today**\n\n* S&P 500 (SPY): +1.56%\n* Nasdaq (QQQ): +2.28%\n* Dow Jones (DIA): 1.02%\n* Russell 2000 (IWM): +1.59%\n* Volatility Index (VIX): -6.84%\n* NVIDIA (NVDA): +7.81%\n* Apple (AAPL): +2.85%\n* UnitedHealth (UNH): +3.11%\n\nToday, the Fed announced it would double the pace of tapering and signaled a strong likelihood that there would be an interest hike, probably around August-September (according to the Fed’s dot-plot), the first since rates were slashed to near zero in March 2020. This was largely the expected outcome of this meeting. \n\nSince the depths of the pandemic, the Fed has added trillions of dollars in U.S. Treasuries and agency mortgage-backed securities to boost liquidity during a time of crisis and prevent a credit crunch. In November, the Fed started to taper the pace of those aggregate purchases by $15 billion per month, and will now double that pace to $30 billion per month.\n\nA statement by the Fed said, “In light of inflation developments and the further improvement in the labor market, the Committee decided to reduce the monthly pace of its net asset purchases by $20 billion for Treasury securities and $10 billion for agency mortgage-backed securities.”\n\nThe new pacing would bring all asset purchases to a full stop by March 2022, faster than the course set forth in November that originally sought to end purchases by the middle of next year. The decision had unanimous agreement.\n\nA quicker taper gives the Fed room to move earlier on interest rate hikes. All of the 18 members present at the meeting said they could see the case for at least one rate hike next year, a noticeable revision up from [September projections showing a 50-50 split on a 2022 rate hike](https://news.yahoo.com/fed-fomc-monetary-policy-decision-september-2021-141145429.html).\n\nThe updated dot plots, which map out each of the FOMC members’ projections for where rates will be in coming years, shows the median member of the committee projecting three rate hikes next year, another three in 2023, and another two in 2024. Link for dot-plot below\n\n[https://www.federalreserve.gov/monetarypolicy/files/fomcprojtabl20211215.pdf](https://www.federalreserve.gov/monetarypolicy/files/fomcprojtabl20211215.pdf)\n\nThe Fed said, “Supply and demand imbalances related to the pandemic and the reopening of the economy have contributed to elevated levels of inflation.”\n\nThe median expectation of the committee sees core personal consumption expenditures, the Fed’s preferred measure of inflation, \n\nclocking in at 2.6% in 2022 (compared to 2.2% in the Fed’s September projections). Core PCE came in at 4.1% in October (data for November core PCE comes out December 23.\n\n[https://www.bea.gov/data/personal-consumption-expenditures-price-index-excluding-food-and-energy](https://www.bea.gov/data/personal-consumption-expenditures-price-index-excluding-food-and-energy)\n\nThe next Fed meeting is scheduled to take place Jan. 25 and 26.\n\nArt Hogan, Chief Market Strategist at the National Securities Corporation said, “When you have an anticipation of higher interest rates, growth stocks or long-duration growth stocks certainly get hit the hardest. When you do that net present value calculation with a higher interest rate, that implied multiple or ascribed multiple to growth names comes in. So a lot of that's been priced in. When you think about some of those real ‘growth-y’ names and momentum names and risk assets, they've seen a lot of carnage already.\"\n\nHe continued, “What the market is trying to tell us here is that when you set your asset allocation plan for next year, you want to have a barbell approach with growth on one side — you want to have those growth names that are actually valued at a multiple to earnings, not a multiple to revenues or a multiple to cash flows or a multiple to sales. We anticipate 2022 is going to be very much like 2021, where you really want to have a balance between growth and value.\"\n\nI broadly agree with this perspective, 2021 was a hard year for a lot of people who went too heavy into growth after an insane 2020. It’s always important to have a good mix between growth, value, and I’ll add safe ETFs.\n\n**Highlights**\n\n* Shares of Pfizer (PFE) jumped to a fresh record intraday high on Wednesday amid optimism over the company's COVID-19 pill, called Paxlovid. President Joe Biden said Tuesday that the White House had ordered enough of the antiviral pills to treat 10 million Americans, and that he was \"encouraged by the promising data\" that the drug-maker released on the pill. Pfizer's data showed earlier this week that the drug decreased the risk of hospitalization or death by 89% for high-risk adults. \n* Amazon's web hosting platform Amazon Web Services (AWS) experienced connectivity issues Wednesday morning, triggering outages at platforms from Zoom Video Communications to Amazon-owned Twitch and other online services. \n* Retail sales were up 0.3% in November compared to October, [the Commerce Department said on Wednesday](https://www.census.gov/retail/marts/www/marts_current.pdf). This came in below the 0.8% monthly increase consensus economists were expecting, according to Bloomberg-compiled data. In October, retail sales rose 1.8%, which was upwardly revised from the 1.7% increase previously expected. \n* The office of the U.S. Trade Representative is concerned with Canada's announcement that it will continue to pursue a unilateral digital services tax, a USTR spokesperson said in a statement on Wednesday. “If Canada adopts a DST, USTR would examine all options, including under our trade agreements and domestic statutes,” it said.\n* Food safety issues were found at over a dozen Starbucks outlets in the eastern Chinese city of Suzhou, regulators said on Tuesday, a day after the U.S. coffee chain was criticized for violations at two other outlets in another city.\n* The Digital Markets Act (DMA), unveiled by EU antitrust chief Margrethe Vestager last December, sets out a list of dos and don'ts for U.S. tech giants designated as online gatekeepers with fines up to 10% of global turnover for violations, a global first.", "id": "rhb8ge", "created_utc": 1639607306.0, "score": 19, "upvote_ratio": 0.79, "num_comments": 20, "comments": [{"body": "Anchorage Capital Group Just defaulted was one of the biggest hedge funds shorting AMC", "score": 0, "replies": []}, {"body": "do you post your summaries to r/investing?  I am on there the most.", "score": 1, "replies": []}]}
{"title": "commodity stocks not doing well, and why?", "selftext": "Hey guys, so since about Aug 2021 I've been going heavy into commodity stocks such as US Steel $X, Freeport-Mcmoran $FCX and Weyerhaeuser WY thinking that since inflation will be going off the roof, these commodity stocks will be doing well. But so far they have not been doing well. Unfortunately I bought call options instead of straight up stocks so my options, which expires in Jan have been getting destroyed. I'm just so confused, with inflation off the roof, why are these stocks not at all time highs, and they are actually down a lot which is so puzzling. Anyone have some good ideas why? Thank you.", "id": "rgs35x", "created_utc": 1639547942.0, "score": 10, "upvote_ratio": 0.92, "num_comments": 26, "comments": [{"body": "I feel the same about utilities, REITs, and consumer staples, all signs point to it going up over 2022 but everything is just chaos right now. Give it time and zoom out a bit. Do your DD and trust yourself to make informed decisions and try filter out all the noise. I think commodities will do well in the mid and long-term, but it's impossible to say what the short-short-term will look like at all.", "score": 3, "replies": []}, {"body": "The ‘inflation is running crazy’ is a basically a media hype. Current conditions are nothing like the 70s and 80s. \n\nIn fact, energy prices have come back down. Oil is below $70 now and Natural Gas has come way down as the predictions of a brutal North American winter have subsided. Might get a record high in Chicago tomorrow.\n\nI don’t follow copper much, but I know it’s tied to Chinese demand and there’s definitely some uncertainty in China now", "score": 6, "replies": [{"body": "> I don’t follow copper much, but I know it’s tied to Chinese demand and there’s definitely some uncertainty in China now\n\nRecent market action (dollar increasing, treasuries increasing, commodities fading) is indicative of deflationary forces.  The assets performing worst appear to indicate trouble is expected on the horizon for China.\n\nThe media news cycle’s focus on fed watching is so tiresome.  Chinese real estate market is the story.", "score": 5, "replies": []}, {"body": "glad people here know what's going on", "score": 2, "replies": [{"body": "“People here” is a bit too generous of a term if you’re applying it to this subreddit.  Have you read read the 1 millionth “the bubble is here reeeeeeee” thread?\n\nThe narrow group of people who clicked on this thread that understand that we’re in a commodity reversal are actually the ones that know what’s up.", "score": 2, "replies": [{"body": "But I have the feeling it's becoming better here, just half a year ago I would have got a shit ton of down votes for writing something disinflationary, but recently the opinion is more accepted despite record CPI numbers", "score": 2, "replies": []}]}]}]}, {"body": "The market always seems to stay irrational longer than expected.  Give it time - it's not going to moon overnight.  We've been seeing a rotation into value and cyclicals recently, but steel has also seen some amazing gains over the last year, so it is taking a breather for a bit.   Look for buying opportunities.\n\nAlso, check out CLF.   It's got an amazing CEO, is perfectly positioned to take advantage of the \"green\" steel movement, and has been grossly undervalued (it is usually referred to as a 'mining company', despite being the largest flat-rolled steel producer in North America)", "score": 2, "replies": []}, {"body": "Commodities, like gold, are loosely but not directly correlated to inflation. Inflation hits the prices of different sectors differently as well. Making it more complicated, blatant market manipulation like algos push a price to a certain place before a certain date by market makers against the options contracts they wrote (like the ones you bought), are also to blame. It’s a multitude of reasons. So, even if a company does benefit from inflation, there’s no guarantee their stock price will soar unless either the biggest players on wall street decide to jump in (or if they’re shorting it already) or it becomes a MEME stock, that last part is essentially the biggest key in today’s market, which has been changing a LOT more than really discussed the past year or so.\n\nThis is also a product of what michael burry was complaining about with passive investing and ETFs ballooning too much, it throws the whole market off and causes things like this to happen. It all feeds back into itself.", "score": 1, "replies": [{"body": "Ugh, this is an ice cold take.  Commodity prices are highly correlated to real inflation.  And this is not at all what Burry was talking about with ETF investing before he flushed that thesis down the memory hole.  His whole thesis was that deep value was undervalued because people weren’t doing research.  This turned out to be wrong.  He invested in value when growth was taking off, then dumped his value shares (like GME at like 20) just as value was taking off.", "score": 2, "replies": []}]}, {"body": "Inflation isn't as bad as media wants you to believe to sell headlines. It appears to be super bad because CPI is being compared to 2020 levels when oil went to negative and we entered a deflationary period.\n\nSecondly Chinese real-estate market is slowing down which was a major driver of steel prices .", "score": -4, "replies": [{"body": "The base effect from the deflation (actually it was just disinflation it never went below zero) in early 2020 would have ended almost 6 months ago at this point.", "score": 1, "replies": []}]}, {"body": "I own fcx long term and it had a nice run up", "score": 1, "replies": []}, {"body": "Inflation is higher than it has been in years oil came down a little but still higher than last year and from plastics, paper,food to trucking the costs have gone up so if you believe inflation is not an issue buy bonds tlt if you think it is an issue sell bonds tbt", "score": 1, "replies": []}, {"body": "Right now the market is selling off to wait for the Fed's upcoming meetings. Once that is behind us, I expect some allocation toward value and cyclicals. \n\nYou should already be thankful if you were holding equity in cyclical or commodities: the correction in them have been no where as bad as in growth. \n\nAlso China real estate issue is a big f-ing deal too.", "score": 1, "replies": []}, {"body": "freeport was less then half before the pandemic.\n\nbut because there were a lot of supply issues the commoditys are skyhigh, now those are getting resolved with vacines etc the price comes down a little.\n\nbut 2020-2021 were great years for these companys", "score": 1, "replies": []}]}
{"title": "Jam-packed economic calendar in the US today", "selftext": "WEDNESDAY, DEC. 15\t\n\n**TIME (ET)\t                         REPORT\t                                     PERIOD**\n\n8:30 am\t                  Retail sales\t                                                        Nov.\t\t\n\n8:30 am\t                  Retail sales excluding autos\t                        Nov.\t\t\n\n8:30 am\t                  Import price index\t                                        Nov.\t\t\n\n8:30 am\t                  Import price index excluding fuels\t                Nov.\t\n\n8:30 am\t                 Empire State manufacturing index\t                Dec.\t\t\n\n10 am\t                 NAHB home builders' index\t                        Dec.\t\t\n\n10 am\t                 Business inventories (revision)\t                Oct.\t\n\n10 am\t                 Inventory-sales ratio (revision)\t                        Oct.\t\t\n\n2 pm\t                Federal Reserve FOMC announcement\t\t\t\t\n\n2:30 pm\t                Jerome Powell press conference", "id": "rgszaa", "created_utc": 1639551161.0, "score": 22, "upvote_ratio": 0.82, "num_comments": 21, "comments": [{"body": "Puts should start printing around 2:03 pm", "score": 11, "replies": []}, {"body": "J Powell “ Mr transitory came back from retirement, it couldn’t afford the high prices due to inflation, Omicron is causing potential supply issues in China, we will likely do two rate increases in 2022 and 3 seems unlikely because Mr Omicron is truly what is transitory”", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "For calls...", "score": 2, "replies": []}]}, {"body": "today is about either pain or more pain.. look at the inflation numbers", "score": 2, "replies": []}, {"body": "Pleas tell me how you found all of these events going on?", "score": 2, "replies": [{"body": "you're looking for economic calendars. here are a few:\n\n[https://www.dailyfx.com/economic-calendar](https://www.dailyfx.com/economic-calendar)\n\nhttps://tradingeconomics.com/calendar", "score": 2, "replies": []}]}]}
{"title": "VZ -- and the search for pricing errors in the market", "selftext": "I'm out of AMD and into VZ.  Here's why -- \n\nAll last spring and summer, I made the pitch that AMD was a coiled value spring, and that pricing the stock in the $70s and $80s was a mistake that would get corrected within the next few months.  That mis-priced market error was so obvious it was painful to not think I was missing something.  But, as we all know now ... I was right.  I was so persistent in my presentation of this information that the moderators one board actually accused me of being a \"shill\".\n\nBut, my goal was the same then as it is now:  to present my argument for why the market consensus has terribly mis-priced a quality company.  I took my profits in AMD, and now, I've moved on.  \n\nThe next mis-priced great company that I am accumulating is Verizon.  Here's why --\n\nThe pandemic pushed more people on line and the use of 5G cell phones is being swept up in that move.  Data usage is increasing more rapidly than carrier pricing is falling.  Cell carriers are making much more money than the cost of building out 5G and meeting demand.\n\nMeanwhile, cars are becoming more connected .. and new EVs are really ramping up that trend.  Soon everybody will be paying a second monthly shot to the 5G providers for their car. \n\nNext comes the huge increase in data-crunching connected trucking.  As trucking companies look to find efficiencies every minute waiting, hauling, loading, and unloading will be tracked through 5G sensors.\n\nFinally, the move to 5G means that wireless companies can compete for the home and office business that is currently owned by the cable companies.\n\nIn summary, the three big telecom cell providers -- VZ, T, TMUS will be making income from your phone, your car, your home and the deliveries of your purchases.\n\nAnd the idea that the little and secondary cell providers give a different option is a fiction -- behind the curtain, they are all paying one of the three main carriers to actually do the work.  This is particularly true of aggressive new offerings from Spectrum and other cable companies.\n\nThis past week, I've made the pitch for accumulating VZ as my preferred choice of the three.  The reasons:\n\n1.  Consistently profitable and actually paying one of the best dividends of all DOW stocks.\n\n2. Quality of network leadership.\n\n3. Cheap debt -- VZ wisely financed the 5G expansion using bonds with fixed rates which are essentially free in the current inflationary environment.\n\nVZ is a beaten down coiled spring like AMD was last spring and summer.  Check it out.", "id": "rh4a69", "created_utc": 1639589111.0, "score": 4, "upvote_ratio": 0.61, "num_comments": 22, "comments": [{"body": "Agreed that VZ is more attractive than T or TMUS.  I see a lot of people talking about T on Reddit and have no idea why.  PE and EPS are significantly more attractive on VZ than T…TMUS.  I’ve been thinking of putting a significant portion of my money into VZ, but lately all of my moves are bad so I’m currently immobilized by uncertainty.", "score": 6, "replies": []}, {"body": "I like VZ myself, but don’t believe it to have the potential for insane price appreciation. It behaves more like a bond. \n\nUnlike AMD it is very slowly growing its earnings. Still, it’s a fine investment if you are willing to be content with a nice, stable 5% yielder! I love it around this $50 price. Plus, it seems to almost always pump while other stocks go down as a flight to safety since it is a defensive.", "score": 3, "replies": []}, {"body": "Might as well read tea leaves, it’s more entertaining than technical analysis and just as accurate.", "score": -6, "replies": [{"body": "This isn't technical analysis.", "score": 1, "replies": [{"body": "The entire post isn’t, but the part about coiled springs certainly is.", "score": -1, "replies": []}]}, {"body": "you sure you know what Technical Analysis is? not a single sentence in this post can be considered TA.", "score": 1, "replies": [{"body": "The part that mentions coiled springs and what not is most definitely technical analysis.", "score": 1, "replies": [{"body": "go find a chart where there’s a “coiled spring” pattern then ill give ya some credit. until then “coiled springs” don’t mean shit in TA", "score": 1, "replies": []}]}]}]}, {"body": "Comcast provides cell phone service.\n\nIt's crazy to be in a random park forest and I get reception to Xfinitywifi no Mobile required. \n\nAnd they have home internet and NBC/peacock", "score": 1, "replies": [{"body": "isn’t xfinity mobile using Verizon towers though?", "score": 3, "replies": []}]}, {"body": "Just a dividend stock... Hope it gives growth eventually", "score": 1, "replies": []}]}
{"title": "Is anyone arbitraging AMD and XLNX?", "selftext": "AMD and XLNX moved in different directions today.\n\nWas this due to some news about the approval for their merger, or have the arbitrageurs simply given up on keeping them near the ratio in the offer (1.7234 shares AMD for one share XLNX)? They haven't been very near it anyway. XLNX at 208.17 is way below the 241.56 indicated price given an AMD price of 140.17.", "id": "rh895l", "created_utc": 1639599390.0, "score": 20, "upvote_ratio": 0.95, "num_comments": 28, "comments": [{"body": "You're better off browsing r/AMD_Stock. We have daily discussions there about the merger details.", "score": 13, "replies": [{"body": "TL;DR me on why the huge discount XLNX buyers are getting.", "score": 3, "replies": [{"body": "Because the final approval is solely held back by SAMR (China's regulatory agency) and it's not a guarantee to go through because.....it's China.", "score": 5, "replies": []}]}]}, {"body": "AMD and Xilinx trade very similarly long term, but not short term. I believe this is because most people buying Xilinx are just holding until the acquisition completes or plan on holding AMD long term. Conversely, the people trading short term market swings are likely buying/selling AMD. AMD has had multiple big swings in price (up and down) due to short term market trends, but Xilinx tends to stay relatively stable. Thus far, they have always ended up converging with time after any divergence.\n\nDue to China risk and these short term swings, the arbitrage stands. There's only 2 weeks left in 2021 and management showed strong confidence in the acquisition closing this year, so we're due for some kind of verdict soon regardless. I'm a long time AMD holder and already converted everything to Xilinx back when the arbitrage was much greater.", "score": 5, "replies": []}, {"body": "Gasp - because AMD isn't worth $140. DING DING DING.", "score": -29, "replies": [{"body": "it isn't? then why is it trading at $145? lol...", "score": 18, "replies": [{"body": "Oh Jesus christ youre a smart one aren't you?\n\nLololol.\n\nI told people months ago that Buffett himself says Mergers are the best way to see what a company is actually worth. \n\nLooking at XLNX now it looks like AMD went from a price of about $90 to $128.\nBuying above $128 is a risk, and its ok to buy risk and trade momentum and swings.\n\nBut XLNX merger prices AMD around $128.\n\nWhat more do you want explained to you? Gonna argue with Warren Fycking Buffett now?", "score": -27, "replies": [{"body": "You said \"isn't worth\". You did not say \"shouldn't be worth\".\n\nAMD is worth what people are willing to pay for it at PRESENT. Which is $146.44 after market as I type this comment.\n\nIf you don't believe it should be worth $146.44, then say THAT.\n\nI am merely nitpicking your grammar my dude.\n\nAnd if you forgot, there were a horde of hedge funds that thought GME wasn't worth $4.50 a share and now here we are with it sitting comfortably at $147.50 a share. Buffet has been wrong plenty of times before. If you forgot, or need a recent reminder, that both him and munger have been buying up baba since $200 a share and baba is $120 now..", "score": 6, "replies": [{"body": "Nah it's cool I do that too. Because the idea of \"over and under value\" that some buffett wannabes talk about often confuse the same thing. Yes it's \"worth\" what the price is. Its never over or under valued.\n\nExcept when mergers happen, then you can basically see the same thing (by arbitrage) that the book keepers see. And thus know actual value. \n\nBuffetts not wrong about that piece. Which is a piece of the puzzle.\n\nI don't think AMD will ever trade at it's fair value because of its strong fan base. Stocks do have a popularity about them.\n\nBut that doesn't mean trading above the supposed fair value is not risky.", "score": -1, "replies": [{"body": "Book keepers can still value companies more highly then their liquid assets and cash would suggest, though, which means that company value is some element of speculation.\n\nIf a company is merging with another, and is valuing it more then the stock market, it means they are speculating that the company's addition to their company will be worth more in the future then they are paying. Besides the difficulty of determining a target's intrinsic value, and, relatedly, the lack of using the best and right approaches in valuation, buyers often overpay for the target because they overestimate the growth rate of the target under their ownership, and/or the value of the synergies between the two firms.\n\nPure, exact value is hard to pin point. Growth prospects do create value for companies, more then just what they are making NOW. If that wasn't the case, Tesla would be no where near the valuation they currently are at.\n\nAnd you have a weird worship of buffet. Yes he's made a lot of good picks and made a lot of money, but he is not right on EVERYTHING. Just because I or someone else disagrees with buffet does not make them wrong.", "score": 3, "replies": [{"body": "Yeah. This is basically as close an approximation we can get.\n\nBuffetts pretty accurate on the statement. That doesn't mean it's going to be a magic number and tell us how to trade. \n\nBut it's pretty clear and makes sense that AMD trades at a premium. It's a hot commodity. Doesn't take a merger to see that it's price is always at risk.", "score": 0, "replies": [{"body": "trading at a premium is what you get for a growth stock. thats why it's a growth stock though.", "score": 2, "replies": [{"body": "I mean an obvious premium. Like the only reason AMD is up is popularity. There's not enough growth to justify it and so it's a risky trade where as there's plenty of strong growth trades that are at a premium that are less popular...those are the ones that actually make millionaires.\n\nAMD is played out.\n\nIt went from $4 to $80 then took a year to go from $80 to $145.\n\nAMD did great. Future? Not likely. Especially since semiconductor prices will be coming down...it's like trading a Gold stock when Gold spiked high...that is about to end.", "score": 1, "replies": [{"body": "Your future picks?", "score": 2, "replies": [{"body": "Rocket Lab. It'll be a few years slog like AMZN was but will just dominate the future. Along with SpaceX but it only selectively trades on private exchanges.\n\nI'm certain blockchain as well but it will be a lot of ups and downs and not linear. But it is here to stay and is growing like Gold grew after it was unpegged from fiat currencies. \n\nEVs. And the one I'm evaluating the most for trading is LCID but I'm not sold on it long term. TSLA has transformed that industry and I might just sell options on it instead.\n\nI'm waiting for deep sea mining plays. None are coming up on the horizon though. It's almost more difficult to do than space.\n\nThose areas are the biggest growth of the future...Space the biggest most likely and it really only has one investment grade public company. And their management has one of the best strategy teams I've ever seen.\n\nThey are Rockstars on every category of management.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}
{"title": "$BBAI - This AI Pure Play Is Very Close to Run a Lot Higher.", "selftext": " Silver line: $BBAI is a pure play AI company that is 3 times cheaper than the notorious $AI while making the same revenue, has more military contracts, grows faster and it is at sharp discount after the. Also the abnormal low float might make it a lot more expensive, very fast.\n\nYou can search for the reason just by google $BBAI.\n\nWait, but **Who is $BBAI**\n\nBig Bear AI (aka $BBAI) provides decision dominance (as they say) to intelligence communities, national defence and global corporations. Simplisticaly put: they analyze huge volumes of data, use a smart machine and can predict enemy moves, supply chain problems, predict the outcome of naval battle even before jumping in. etc.\n\nThe bigger that volume of data and the longer the built of the AI, the better the results.\n\n**Let's see just how valuable is $BBAI and what can move it higher faster.**\n\nI. **They outperform the AI market and that market is growing really fast**\n\n**AI market is booming and everybody knows that.**\n\nBBAI is not only in the right market but also outperforms that market.\n\nThe global Artificial Intelligence (AI) market size is expected to gain momentum by reaching USD 360.36 billion by 2028 while exhibiting a CAGR of **33.6%** between 2021 to 2028.\n\nBigBear.ai’s is growing even faster: Customers is booming: **U.S. Intelligence Community, Department of Defense, and U.S. Federal Government, space companies, logistics companies, etc.** Some MOU with UAV Factory and Redwaire is building for new lines of business as well.\n\n**Added more than $150 million of new contract awards in the third quarter only bringing total backlog to approximately $485 million as of September 30, 2021. Only in this Q3 only:**\n\n* Entered into a one-year contract with the Defense Intelligence Agency to develop a force element tracking and identity platform utilizing Machine Assisted Rapid Repository Services (“MARS”) solution.\n* Awarded the five-year, single award TACTICALCRUISER contract by the United States Cyber Command.\n* Awarded one of two Global Force Information Management Phase 1 Prototype contracts by the United States Army.\n* Entered into a three-year commercial partnership with Terran Orbital to support manufacturing and supply chain optimization, constellation tasking optimization, space situational awareness analytics, and sensor exploitation to identify relevant insights.\n\n**Also this September BBAI has been selcted by Virgin Orbit to provide AI support for their launcing missions.**\n\n[https://virginorbit.com/the-latest/bigbear-ai-enters-into-transformational-commercial-partnership-with-virgin-orbit-to-deploy-ai-powered-analytics-platform-for-end-to-end-responsive-launch-solutions/](https://virginorbit.com/the-latest/bigbear-ai-enters-into-transformational-commercial-partnership-with-virgin-orbit-to-deploy-ai-powered-analytics-platform-for-end-to-end-responsive-launch-solutions/)\n\nAs you can see their contracts get bigger and thier customer base is growing with famous names.\n\nII. **Second reason to bet on BBAI:**\n\n**Leadership that have the right connections and the right knowledge**\n\nDefence and intelligence communities are hard difficult to penetrate unless there is some trust built in years. I;ve selected 2 key pple that you should know about:\n\n**Reginal Brothers - CEO**\n\n**\"Reggie\" Brothers has deep connections and knowledge with in the military and intelligence R&D**. Beside being former CTO at Peraton, Dr. Brothers served as **Under Secretary for Science and Technology at the U.S. Department of Homeland Security** (DHS) (**Obama nominee - yup**) where he was responsible for oversight of **Department of Defense (DoD) laboratories and helped ensure the long-term strategic direction of the Department’s Science and Technology programs.** Dr. Brothers has also held senior roles as Technical Fellow, Director of Mission Applications and Director of Advanced Programs and Technology at BAE Systems, Program Manager at the Defense Advanced Research Projects Agency (**DARPA**) etc.\n\n**Sam Gordy - a recent addition and meaningful one:** the new president of federal and chief operating officer of BigBear.ai can quickly rattle off the big numbers behind some of the lines of business he ran at **Leidos ($1.5 billion)** and at **IBM ($2.5 billion.)**. BigBear.ai is not at the same scale at $150 million in annual revenue today, but Gordy says the potential is huge and was one factor in his [decision to join the company on Nov. 1](https://washingtontechnology.com/blogs/editors-notebook/2021/11/bigbear-new-hires.aspx) 2021.\n\nThe list is bigger - but with only this 2 leaders of the company $BBAI have knowledge and access to some of the biggest move in the industry - either from the Federal Gov, military or from the corporate world.\n\nIII. **Third catalyst for BBAI: The right partners and the list os growing**\n\n**Just 3 weeks ago BBAI announced the partnership with the king of inteligence data - Palantir.**\n\nEither you like or not Pether Thiel, you have to admit he is a pretty smart and influent guy arround tech world - especially when is connected with the intelligence community.\n\n\"As part of the integrated product offering, Palantir’s Foundry platform will be integrated with BigBear.ai’s Observe, Orient and Dominate products, creating powerful machine learning extensions for the Palantir ecosystem that will provide global data collection, generate actionable insights and deliver anticipatory intelligence at enterprise scale to address high-growth federal and commercial verticals including space, retail, logistics and energy.\"\n\nIn short - a lot , **really** a lot more customers for $BBAI - this exactly the part that I like from their partnership : BBAI capabilities are added as an extra to the Palantir Foundry - meaning 2 things: Palantir recognizing the value and uniqueness of BBAI platform and BBAI getting a lot more customers from Palantir.\n\nBeside that you can see a list of partners on [bigbear.ai](https://bigbear.ai/) website even though, due to the nature of intelligence and military contracts (secrecy) they don't provide much details.\n\nSufice to say that among those partners you can count: Amazon, Microsoft Azure, Knime, Apian, etc.\n\nIV. **How $BBAI stands in regard of valuation? Is it realy cheap at this price?**\n\nSo, [Bigbear.ai](https://bigbear.ai/) is the second pure play stock on Artifial Intelligence. You probably know the first one - $AI ([C3.ai](https://c3.ai/)) jumped some 200% after IPO and stayed in the headlines for months.\n\nLet's compare this two, even if $AI is now a lot lower than it used to be.\n\n**OK, let's see the valuation:**\n\n$AI Market cap - 3.5B\n\nFY2021 (they close reporting year in June) - they had 182M revenue\n\nFor 2022 - (June 2021 -june 2022) they expect 243M.\n\n$BBAI Market Cap - 1.1B\n\n**Full-year 2021 projected revenue between $160 million and $185 million**\n\nFor BBAI the reporting yesr ends in December.\n\nYou see revenues are pretty much in line with some 10% higher for $AI as they closed financial year 2021 in june. For 2022 $BBAI for example expects **260M.**\n\nSo, **$AI has now a 3.5B market cap. After IPO has spiked to almost 10B so this valuation now is a conservative number.**\n\n**$BBAI has now 1.1 B market cap - 3 times cheaper whle playing in the same field, getting a lot more military contracts and growing faster.**\n\n**Hey but $AI is making headlines while $BBAI is not**\n\n**V. News/raly potential - some pretty cool stuf**\n\nHere is what BBAI is doing and judge by yourself what are the ods we will see BgBearAI in th news headlines pretty soon:\n\nIn short , [BigBear.ai](https://bigbear.ai/) is using artificial intelligence to process some 160B data sources to generate real time predictions. They have 500M in back log contracts and made this year alone some 160M from contracts with the DoD (military), the navy, intelligence community.\n\n**Want some examples: They have predicted Russia invasion of Crimea, routes for oil smugling in Mediteranian Sea and they are helping right now with strategies to engage Iran.**\n\n**Very recent they have predicted China's moves in Twain airspace. (search \"china\" in this article to learn more)**\n\n[https://washingtontechnology.com/blogs/editors-notebook/2021/12/bigbear-path-forward.aspx](https://washingtontechnology.com/blogs/editors-notebook/2021/12/bigbear-path-forward.aspx)\n\n**Imagine how valuable is this for the National Security and mostly for the Defence Budget ;)**\n\n**For the intelligence comunity they predict change in behaviout at hime and abroad. They have save 100years of human work (qualified and expensive intelligence work). Imagine how much value they created there.**\n\n**For maritime comapanies they have predicted weather paterns, discovered new routes and new customers. Maritime shipping has been at the core of supply chain disruptions and there are billions there ready to grab if you can offer efficiency and results.**\n\nSo, with less attention and glamour today, $BBAI is a good candidate with high growth, strong moat and riding one of the most influential tech revolution of the century.\n\nAnd yes, you might want to check the float and the redemptions as that might make BBAI a lot more expensive very fast before you have a chance to buy it. You can read more on that if you just google itor on twitter where this play is starting to trend.\n\nBut that is what I think. What do you think ? Open to any bear or bull reply.", "id": "rh9r5u", "created_utc": 1639603425.0, "score": 14, "upvote_ratio": 0.85, "num_comments": 22, "comments": [{"body": "Went public at the wrong time and via SPAC. Other than that, great company! Not sure if the low float aspect will help short term, but it's definitely \"cheaper\" than similar stocks.", "score": 7, "replies": [{"body": "very true. Are you in?", "score": 2, "replies": [{"body": "Playing warrants. Small risk, high reward potential and plenty of time to expiration.", "score": 5, "replies": []}]}]}, {"body": "VERI is another AI pure play; very overlooked", "score": 3, "replies": []}, {"body": "A comment that I made earlier today for BBAI “This is a solid company and a rough diamond, I am working for the tech sector and AI will see big growth. As I bought PLTR at 9.29$ and still holding the same way I bought BBAI since SPAC days and accumulating.\n\nThe warrants are ridiculously cheap (should be at 1.50-2$), great play and this company is not a pump & dump. I am holding 900 shares and 13K warrants as of now.\n\nPartnership with Palantir is a strategic one because Palantir’s customers will be able to use BigBear’s solutions, partnership with Redwire for space applications and in the past there was also an announcement for a partnership with Raytheon if I am not mistaken.”", "score": 3, "replies": []}, {"body": "Why does their gross margin suck?", "score": 2, "replies": [{"body": "why do you think that? Check the numbers: \n\n**Gross margin of about 27% in the third quarter and year-to-date**\r  \n**Segment adjusted gross margin of 49% for the Analytics segment and 21% for the Cyber & Engineering segment in the third quarter, and 48% and 22%, respectively, year-to-date**\n\n[https://www.businesswire.com/news/home/20211110005765/en/BigBear.ai-Announces-Third-Quarter-2021-Financial-Results](https://www.businesswire.com/news/home/20211110005765/en/BigBear.ai-Announces-Third-Quarter-2021-Financial-Results)\n\nIMHO It does not \"suck\".", "score": 3, "replies": [{"body": "On software?", "score": 2, "replies": [{"body": "yup bc Analytics is software pure play while engineering and cyber --- the name is self explaining.", "score": 2, "replies": []}]}]}]}, {"body": "BBAI has been holding up quite good during these bloody days.  I have been taking profits on my older positions left and right recently since these profits are evaporating fast but im adding to this position. Might as well park some more cash here in the coming months.", "score": 2, "replies": []}, {"body": "This is gonna run Monday and next week", "score": 1, "replies": []}]}
{"title": "Here is a Market Recap for today Wednesday, Dec 15, 2021. Please enjoy!", "selftext": " \n\n**PsychoMarket Recap - Wednesday, December 15, 2021**\n\nThe stock market opened the day but reversed course and bounced today as investors digested the Federal Reserve’s final monetary policy decision of 2021 and Fed Chair Jerome Powell’s speech against a backdrop of persistent inflationary pressures. Bond yields rose up in the immediate aftermath of the Fed’s announcement, rising above 1.46%.\n\n**Notable Numbers Today**\n\n* S&P 500 (SPY): +1.56%\n* Nasdaq (QQQ): +2.28%\n* Dow Jones (DIA): 1.02%\n* Russell 2000 (IWM): +1.59%\n* Volatility Index (VIX): -6.84%\n* NVIDIA (NVDA): +7.81%\n* Apple (AAPL): +2.85%\n* UnitedHealth (UNH): +3.11%\n\nToday, the Fed announced it would double the pace of tapering and signaled a strong likelihood that there would be an interest hike, probably around August-September (according to the Fed’s dot-plot), the first since rates were slashed to near zero in March 2020. This was largely the expected outcome of this meeting. \n\nSince the depths of the pandemic, the Fed has added trillions of dollars in U.S. Treasuries and agency mortgage-backed securities to boost liquidity during a time of crisis and prevent a credit crunch. In November, the Fed started to taper the pace of those aggregate purchases by $15 billion per month, and will now double that pace to $30 billion per month.\n\nA statement by the Fed said, “In light of inflation developments and the further improvement in the labor market, the Committee decided to reduce the monthly pace of its net asset purchases by $20 billion for Treasury securities and $10 billion for agency mortgage-backed securities.”\n\nThe new pacing would bring all asset purchases to a full stop by March 2022, faster than the course set forth in November that originally sought to end purchases by the middle of next year. The decision had unanimous agreement.\n\nA quicker taper gives the Fed room to move earlier on interest rate hikes. All of the 18 members present at the meeting said they could see the case for at least one rate hike next year, a noticeable revision up from [September projections showing a 50-50 split on a 2022 rate hike](https://news.yahoo.com/fed-fomc-monetary-policy-decision-september-2021-141145429.html).\n\nThe updated dot plots, which map out each of the FOMC members’ projections for where rates will be in coming years, shows the median member of the committee projecting three rate hikes next year, another three in 2023, and another two in 2024. Link for dot-plot below\n\n[https://www.federalreserve.gov/monetarypolicy/files/fomcprojtabl20211215.pdf](https://www.federalreserve.gov/monetarypolicy/files/fomcprojtabl20211215.pdf)\n\nThe Fed said, “Supply and demand imbalances related to the pandemic and the reopening of the economy have contributed to elevated levels of inflation.”\n\nThe median expectation of the committee sees core personal consumption expenditures, the Fed’s preferred measure of inflation, \n\nclocking in at 2.6% in 2022 (compared to 2.2% in the Fed’s September projections). Core PCE came in at 4.1% in October (data for November core PCE comes out December 23.\n\n[https://www.bea.gov/data/personal-consumption-expenditures-price-index-excluding-food-and-energy](https://www.bea.gov/data/personal-consumption-expenditures-price-index-excluding-food-and-energy)\n\nThe next Fed meeting is scheduled to take place Jan. 25 and 26.\n\nArt Hogan, Chief Market Strategist at the National Securities Corporation said, “When you have an anticipation of higher interest rates, growth stocks or long-duration growth stocks certainly get hit the hardest. When you do that net present value calculation with a higher interest rate, that implied multiple or ascribed multiple to growth names comes in. So a lot of that's been priced in. When you think about some of those real ‘growth-y’ names and momentum names and risk assets, they've seen a lot of carnage already.\"\n\nHe continued, “What the market is trying to tell us here is that when you set your asset allocation plan for next year, you want to have a barbell approach with growth on one side — you want to have those growth names that are actually valued at a multiple to earnings, not a multiple to revenues or a multiple to cash flows or a multiple to sales. We anticipate 2022 is going to be very much like 2021, where you really want to have a balance between growth and value.\"\n\nI broadly agree with this perspective, 2021 was a hard year for a lot of people who went too heavy into growth after an insane 2020. It’s always important to have a good mix between growth, value, and I’ll add safe ETFs.\n\n**Highlights**\n\n* Shares of Pfizer (PFE) jumped to a fresh record intraday high on Wednesday amid optimism over the company's COVID-19 pill, called Paxlovid. President Joe Biden said Tuesday that the White House had ordered enough of the antiviral pills to treat 10 million Americans, and that he was \"encouraged by the promising data\" that the drug-maker released on the pill. Pfizer's data showed earlier this week that the drug decreased the risk of hospitalization or death by 89% for high-risk adults. \n* Amazon's web hosting platform Amazon Web Services (AWS) experienced connectivity issues Wednesday morning, triggering outages at platforms from Zoom Video Communications to Amazon-owned Twitch and other online services. \n* Retail sales were up 0.3% in November compared to October, [the Commerce Department said on Wednesday](https://www.census.gov/retail/marts/www/marts_current.pdf). This came in below the 0.8% monthly increase consensus economists were expecting, according to Bloomberg-compiled data. In October, retail sales rose 1.8%, which was upwardly revised from the 1.7% increase previously expected. \n* The office of the U.S. Trade Representative is concerned with Canada's announcement that it will continue to pursue a unilateral digital services tax, a USTR spokesperson said in a statement on Wednesday. “If Canada adopts a DST, USTR would examine all options, including under our trade agreements and domestic statutes,” it said.\n* Food safety issues were found at over a dozen Starbucks outlets in the eastern Chinese city of Suzhou, regulators said on Tuesday, a day after the U.S. coffee chain was criticized for violations at two other outlets in another city.\n* The Digital Markets Act (DMA), unveiled by EU antitrust chief Margrethe Vestager last December, sets out a list of dos and don'ts for U.S. tech giants designated as online gatekeepers with fines up to 10% of global turnover for violations, a global first.", "id": "rhb7vi", "created_utc": 1639607264.0, "score": 80, "upvote_ratio": 0.93, "num_comments": 25, "comments": [{"body": "Heck of a ride on the stock market rollercoaster today.", "score": 16, "replies": []}, {"body": "Think we cleared the major stuff now. What a huge reaction to Powell announcement! Few of my stocks were down 10% in the morning then reversed and ended up 15% -> over 25% daily range. Just insane stuff.\n\nDebt ceiling can't be used as a pretext to fuck with the market till \\~2023. The next Covid variants should have weaker effect on the market.\n\nThere's still inflation and supply chain, and some China evergrande, but better outlook for now. It'll be interesting to see how the market reacts when the rates hikes actually happen. I think we can have semi-trust in the strong reaction given how so many sectors and indices had large pullbacks.", "score": 10, "replies": [{"body": "WW3: Hold my beer!\n\nI agree with you though. We got a lot of clarity this week and I put my money to work over these last few days.", "score": 2, "replies": []}]}, {"body": "So what’s our hot take of how to position for 2022?", "score": 3, "replies": [{"body": "The party is back on guys, inflation is over, time to buy </s>.", "score": 8, "replies": []}, {"body": "I'm going to gradually (between january and march) trim down my tech portfolio and rotate into consumers & financials, I still see the chance for significant rises in some speculative stuff but the closer we are to QE end the chance for brutal reckoning will grow. For higher risk tolerance person, some utilities will probably continue to rip for better part of next year, but I feel this is a big boy's playground.", "score": 2, "replies": []}]}, {"body": "Thank you so much, have an awesome rest of the day my friend, cheers!", "score": 2, "replies": []}]}
{"title": "Edmunds Top Rated 2022 EV is Tesla Model 3", "selftext": "", "id": "rh35jn", "created_utc": 1639586180.0, "score": 235, "upvote_ratio": 0.97, "num_comments": 20, "comments": [{"body": "Edmunds still trash", "score": 39, "replies": [{"body": "💯", "score": 8, "replies": []}, {"body": "Was exactly my thought.\n\nThe reaction you have when you overhear a horrible human being praising you in a bar. You want to jump up and clarify, “I’m not his friend!”", "score": 3, "replies": []}]}, {"body": "Nice. Hard to argue. The S and X have serious issues and all the quality issues and little quirks kind of screw them over. The Y is a repurposed 3. The 3 is nearly perfect. If it had a hatch like the S it would be pretty unbeatable.", "score": 16, "replies": [{"body": "My Plaid is the best car I've ever had. It's the value of the 3 that makes it a top pick, if the S sold for $45K it would win.", "score": 17, "replies": [{"body": "You think?", "score": 5, "replies": [{"body": "I'm sure cost a huge factor in Edmunds ratings.", "score": 1, "replies": []}]}]}, {"body": "> If it had a hatch like the S it would be pretty unbeatable.\n\nThe main diss on the Y when it was first announced was \"It's just a tall 3 with a hatch.\" Yeah, well, a Crosstrek is just a taller Impreza, too. Everybody does that.\n\nMy main issue with the Y is the *tall* part. Hell yeah: give me a 3 with a hatch!", "score": 7, "replies": [{"body": "Same here. Love me some space, love me some handling. Its a hard life", "score": 2, "replies": []}]}, {"body": "What are rhe serious S and X issues?", "score": 3, "replies": [{"body": "The serious ones are battery failures. I have seen at least 10 just from youtubers and reddit posters and they haven't delivered all that many of them. Motor failures are a little less serious but I've seen a couple of those. \n\nLess serious things are present on basically every single plaid though. Door trim seals NEVER sit flush, like the rubber legitimately does not fit properly and gets wavy and just looks like shit. Bumpers have come with dents under the paint. Trim pieces peeling and leaving sticky residue. Center console broken, watch the pollard family youtube the guy was nuts about his plaid but it had a broken center console from the get go and then the battery completely failed after a few weeks. I think he probably still loves it but man it's like a dice roll if you get a major issue or not. \n\nLook at Munro's plaid they just got. It has a trim piece in the back that is folded in and stuck and it's causing a whistle from wind noise in the back seat. Like come on it's a 130k car and it has a fucking whistle that's embarrassing.", "score": 2, "replies": [{"body": "Do you don’t have any direct experience with an S? I’ve driven multiple and they’ve been flawless so there’s another anecdote for your collection. \n\nNew design models across many companies are expected to have issues just like products in other industries.", "score": 1, "replies": [{"body": "https://www.reddit.com/r/teslamotors/comments/rhwrbq/got_a_plaid_spoiler_came_off_they_replaced_it/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nThis just popped on my feed. Little shit, big shit, shit just keeps popping up with plaids.", "score": -1, "replies": []}]}]}]}, {"body": "If the 3 was a hatchback and no a sedan, I woulda bought one already", "score": 1, "replies": []}, {"body": "We have both a Y and a 3 and I'm not sure a hatch would make it nearly perfect.  May offer a little more room, but the sealed off trunk makes a huge difference for road noise and overall fitment.  Also, the bump in interior room is noticeable enough that the Y is more comfortable for rear occupants.", "score": 1, "replies": [{"body": "Yea true. The normal trunk is definitely nice for road noise. Something that is largely overlooked.", "score": 1, "replies": []}]}]}, {"body": "Shocker", "score": 1, "replies": []}, {"body": "But Mary told me gm was the leader in EVs. And Joe too. What gives. 😂", "score": 1, "replies": []}]}
{"title": "Did I fuck up wheeling? Or did the market just fuck me up?", "selftext": "In the past couple of months I've been writing some CSPs on various underlyings, which in principle I would be okay with to own. Until mid-november everything was working out as intended and I made some reasonable profits. However, two positions have gone against me and erased all the profits I made wheeling (let's call this learning money).   \n\n\nI am curious if you guys can help me analyse my situation and maybe indicate what I should have done differently to limit the (unrealized) losses.  Here is the scenario:\n\n**PLTR Put 23 17 DEC, 0.87 credit, sold on 9 Nov (\\~0.30 delta at that point in time). Rolled the position on 14 Dec to 23P 14 Jan for 0,10 credit. PLTR is currently trading at $18**  \nI sold this CSP  just after the PLTR results expecting that the dump would be of short duration and I could BTC reasonably soon. Unfortunately the opposite happened and it tanked further. I already considered rolling \\~2 weeks ago when PLTR was still trading at $20, but was like: it'll go up again... Should I have rolled earlier to ensure that I could capture more extrinsic value for the roll? What would have been a good indicator to roll?\n\n**TKWY Put 56, 17 DEC, 1.04 credit, sold on 26 Nov( \\~0.30 delta at that point in time).  Rolled the position 15 Dec to 56P 17 Jan for 0.55 credit. TKWY is currently trading at EUR 46**  \nI am quite bullish on this stock and think it is heavily undervalued (I also have some shares with cost basis of EUR 90). However last few weeks with (potentially) rising inflation rates and interest have hurt the company. I rolled the position because I am trading in a margin account and this is less capital intensive than owning the stocks outright. In the long run I would expect to be able to keep rolling until it gets above the 56 again, but I am also fair to realise that this may take quite a while. I also was kind of surprised of the credit I was still collecting for a put this far out of the money.  Is there anything you would recommend me to differently?", "id": "rh38jg", "created_utc": 1639586401.0, "score": 2, "upvote_ratio": 0.57, "num_comments": 24, "comments": [{"body": "I know it seems like there's lessons to be learned here, but there isn't. Market doesn't play by rules. Irrational longer than yadda yadda. Pennies in front of train. \n\nYou made reasonable plays, and the market turned against you. You played with meme fire and the market burned ya. \n\n30 delta 45 days out isn't a guarantee, it's works the majority of the time. You got burned by the minority.", "score": 15, "replies": [{"body": "Yes there are rules. OP wrote CSPs on a company with a 200 PE at the time of execution. He’s an idiot.", "score": -4, "replies": []}]}, {"body": "Yes, you messed up on the first step which is stock selection.\n\nIf you're going to wheel meme stocks like $PLTR, you can't just mechanically select the 0.3 delta put to open the wheel.\n\nI believe that meme stocks cannot be safely wheeled.  There are tactical opportunities when IV blows out and the market is paying stupid high premium for far out of the money puts.  Those are safe to sell.  Riskier, but also feasible, is selling the far out of the money call when both price and IV blow up.  But because this takes patience and experience (knowing when it is \"safe\" to sell naked options against a meme), it is not easy to execute.\n\nI think Tastytrade has done a disservice to neophytes to push the 0.3 delta 45 dte opener put on the wheel without focusing on stock selection.  There's a big difference between a 0.3 delta put that is trading at 4% of the strike versus one trading at 1%.  The high premium is a warning sign that the bottom can drop out of the stock at any time.\n\nI don't know about $TKWY.AMS because it trades on the Dutch stock exchange, but I suspect it's also a meme stock which is why it's fallen so fast in a short period of time.\n\nIf it were me, I'd just buy to close at a loss and start over with a position with better odds of profit.", "score": 9, "replies": [{"body": "PLTR is a meme stock in the same way TSLA or AAPL are. They do post profits unlike GME, WISH or AMC.  They may not be a great investment with 10% share dilution since DPO, but they aren't being held up on the hopes and dreams of people on the same website that is creating a \"no work\" movement.\n\nI think meme stocks are failing businesses propped up by delusional retail investors.", "score": 2, "replies": []}, {"body": "For PLTR you may be right that my stock/option selection could have been stricter. In my defense, the stock had already dropped ~8% and the strike was another 8-10% lower than the trading price at that point (if I remember correctly). For the other part;  you are probably right and should indeed consider to cut my losses on that one. \n\nAs for JustEat Takeway (owner of Grubhub in the US). I would not consider that to be a meme stock, but a regular growth stock that was impacted by inflation and interest. \n\nThanks for the advice though. Would you have any recommendations for a sub 25$ stock to investigate to replace PLTR?", "score": 1, "replies": [{"body": "No need to defend your actions.  Advice was provided on the tactics, not the person.\n\nRegarding sub $25 stocks, consider $BP, $OXY, $AAL, $JBLU, $SAVE.\n\nNone of these are on my high conviction list but these are the only ones on my watchlist under $30.  I currently only have a position on $OXY, as there appears to be a short term disconnect between crude oil pricing and their stock price, so I opened weekly short vol, long delta play today.\n\nAlso, on the meme list, I sold 5x $AMC 12/17 18p for $0.22 this morning.  I don't recommend that play at current pricing though.", "score": 3, "replies": [{"body": "Don't forget $F", "score": 2, "replies": [{"body": "Good point, Ford's CEO recently bought some stocks.  I didn't include $F because it's close to 52 week highs. For those type of stocks, I prefer to buy calls.  Opening the wheel, I focus on good companies that are appear to be bottoming.", "score": 2, "replies": [{"body": "Hmm that is smart true. I should be more methodical with my entry in CSPs. Though it’s harder because the ticker list I follow is pretty short. But you’re correct $F is near the high mark. It just has nice volume and stability and is one of the paragons for learning the wheel on in a small account I believe.", "score": 1, "replies": []}]}]}]}, {"body": "Just keep rolling you know this. I don't get why you are even asking what to do. Roll 3 months out. It's not a monthly paycheck", "score": 1, "replies": []}]}]}, {"body": "Wait for market to recover and PLTR will be fine", "score": 4, "replies": []}, {"body": "You could consider a delta lower than 30 for less risk though lower premium. \n\nAlso a big part of the wheel is being willing to take assignment which is part of the reasoning behind the 30 delta recommendation for the wheel. \n\nIf you really do not want to own stocks you are just selling puts not doing wheel and should trade based on study of just selling puts.", "score": 2, "replies": []}, {"body": "I would be willing to take assignment, but like the short put position better.  I simply was wondering whether I should or could have done something differently to have less losses :)", "score": 2, "replies": [{"body": "I myself would keep rolling for a credit. Time is on your side, the stocks may recover.", "score": 1, "replies": []}]}, {"body": "Unless you closed to lock in the losses you haven't lost anything yet!\n\nPLTR is a meme stock and you should expect big swings.  Not sure what TKWY even is.\n\nAs these are stocks you are good to hold if needed, then hold and wait for them to come back if you cannot roll for a net credit or take assignments to sell CCs.  \n\n[https://www.reddit.com/r/Optionswheel/comments/lliy8x/rolling\\_short\\_puts\\_to\\_avoid\\_assignment/](https://www.reddit.com/r/Optionswheel/comments/lliy8x/rolling_short_puts_to_avoid_assignment/)", "score": 4, "replies": []}, {"body": "You have bad underlyings, that's the biggest problem.", "score": 1, "replies": []}, {"body": "That's the way she goes with The Wheel.  There is no \"bad\" trade.  You just have to take the hit on the chin and either close it out for a loss or take assignment and write calls over your strike and hope for the best.  \n\nPLTR example:\n\n You take assignment at $23.  You have a paper loss of $405 right now assuming PLTR closes on Friday exactly here.  There's really nothing worth your time here until Feb $24 expiry, which you can write for $47.  Personally, I would wait until PLTR starts trading over $21 (if it does), and just sit on the shares until you get close to a price you want out of dodge at.  \n\nYou knew the risks going in (stock goes to $0) so you either have to nut up and let what happens happen or admit the market got the better of you and move on.", "score": 0, "replies": []}, {"body": "No. Check out Benn Efiret thread on theta strategies", "score": 1, "replies": [{"body": "I can’t seem to find this. Do you have a link?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "The Netherlands does not have any capital gains tax so realizing profits or losses won’t affect me. That said:\nThe TKWY is margin secured put (margin from my long term ETF portfolio). The margin requirements are significantly less than the cash requirement for owning the stock outright. Since a covered call and csp have the same pay-out profile I prefer to be short the put.", "score": 0, "replies": []}]}, {"body": "If you are going to roll, you have to do it sooner. Once it's past your BE you should start looking. Your roll to get $10 was not very efficient, the bid ask spreads probably ate $150 because they widen that far in the money. If you are committed to the stock, go out further for more premium and go down a strike. That is only if you prefer to stay in the CSP and not get assigned. I am always trying to get my BE as low as possible while not surrending much premium.", "score": 1, "replies": []}, {"body": "Sometimes the market goes against you.  I got slammed pretty hard today (on some high quality securities), pulled the pin and took the realized losses (I got fed up managing a few positions that have been getting worse for a few weeks, and excuted my own stop loss).  Couple hours later, they began to correct :/  Good portfolio management means  enough dry powder to go back in when the trends are in your favour, and make some good coin.\nAnd while some have done exceptionally well on meme-ish stocks in the short term, it's rare and not sustainable.  Weird and choppy markets lately, not so easy money....hoping to see some solid trends again now.", "score": 1, "replies": []}, {"body": "The only thing you did wrong is not having a plan. Let’s take PLTR as an example. The put you sold looks fine to me at that time. Don’t see much point on rolling it down a month for almost no credit. Start selling calls against the shares when you’re assigned dec 17. Go a few months out to lower your cost basis. If it keeps on dropping sell another put at $15, $10, $5. This is a long term game. Sometimes you are lucky and the short puts expire worthless but you have to have a plan for other scenarios. I did similar but when it was at $30 at the start is this year. I’ve been selling calls against it and the cost basis is now $20. When it dropped from $30 I sold another one at $25. That one ended up being assigned too but was called away soon at $25 with a $21 cost basis so technically looking at this whole trade together it’s positive. When you sell these puts you have to pick a price you are comfortable holding at. Looks like you’re not comfortable holding at $23?", "score": 1, "replies": []}, {"body": "Dude I think a lot of people are in your situation with a variety of different holdings at this point. Myself included. A lot of stocks have dropped to their price point right before covid thereby erasing a lot of gains we all had previously.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "rh4juh", "created_utc": 1639589791.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 26, "comments": [{"body": "Any option assigned (ITM or OTM doesn't matter) where the seller does not have the cash+margin to handle the cost of the shares, and the account is at a full featured broker plus in good standing, will usually be given a day or two to either add the required cash or close the stock position.\n\nThis will result in a \"margin call\" being issued from the broker and is the indication the account is in a position of not having enough capital for the assignment.  If the trader does not start working to close the stock position or initiate a cash deposit then the broker has the right to liquidate the stock position and will do so without regard to the P&L.\n\nSome lower level brokers (RH) will close the option early to avoid it being assigned if the capital is not in the account, and again, they will do this without regard to the P&L.\n\nThere will be fees charged for any margin the broker has to extend while the stock is in the account.  New positions will not be able to be opened, and others may not be able to be closed or rolled if there is buying power needed.\n\nPutting the account in this position once or maybe twice will find the broker willing to work with you, but if this is a constant occurrence then they may liquidate and cancel the account.\n\nIf the position was originally a spread then the broker knows the long leg is there for protection and the trader will be able to close it for its cash value to cover closing the stock position.\n\nEarly assignments are very rare so this is not something that should happen often . . .", "score": 6, "replies": []}, {"body": "This example makes no sense because a put that is out of the money by $90 would never be assigned.", "score": 3, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "Name a situation where an OTM put is assigned.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Only time it will happen is if its a call and you are coming into an exdividend date, and owning the shares +dividend is more than the extrinsic value of the option. That is the only time I can imagine it would be viable to exercise an OTM option", "score": 2, "replies": [{"body": "Exactly.  \n\nCalls are a different story because the dividend means exercising the option would be profitable.\n\nWhat OP is asking is \"what happens when someone does something that would lose them money on purpose?\"", "score": 2, "replies": [{"body": "What you do is the exact same plan as if you were assigned on the put, but you are $x richer", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "If you sold a OTM put and it is OTM you cannot get assigned on it. Period.", "score": -4, "replies": [{"body": "That is false", "score": 5, "replies": [{"body": "You are correct.", "score": 2, "replies": []}, {"body": "EDIT: OP was correct. Reading into mechanics this is possible and has uses in some scenarios.", "score": -3, "replies": [{"body": "Wow. You absolutely have no idea what you are talking about.  You obviously think you do, but your example is so backwards you just sound \nignorant.  You can't buy a call option to sell your shares, you sell a call option to sell shares.\n\nMoreover, you are just flat wrong in your assertion, and you have a fundamental misunderstanding of options.  You go ahead and call your broker, you will just look dumb to them.  American options can be exercised at any time for whatever price by the options purchaser.  You buy an option to secure a right to purchase or sell at a certain strike by a certain time, there are no other conditions.  A seller of options does not have a right to exercise the option, this is your fundamental misunderstanding.  Your scenario only works because you confuse the seller's obligations with the buyer's rights.\n\nIt makes no logical sense to do it, but it theoretically can be done.  European options cannot be exercised early, so they do not function the same.\n\nProbably best to not double down on things you don't fully understand.", "score": 3, "replies": [{"body": ">Moreover, you are just flat wrong in your assertion, and you have a fundamental misunderstanding of options.\n\nMy example has the same logical validity and credence as OP's example of having a OTM option being exercised. They are both equally fundamentally wrong in all regards. Thank you for noticing.\n\n>It makes no logical sense to do it, but it theoretically can be done. European options cannot be exercised early, so they do not function the same.\n\nYou cannot exercise OTM options. Period. American or not, OTM options cannot be exercised.\n\nEDIT: Technically not true. You can. Never knew that was a functional strategy and learned something new.", "score": 1, "replies": [{"body": "Yes you can? If I have an OTM call on something, I can 100% call up my broker and say I would like to exercise. They will think I am an idiot, and I would be, but you can do it, its an 'option' to buy, not a 'forced'.", "score": 4, "replies": [{"body": "Learned something new. Downvoting myself for not know the technically of actually exercising OTM positions. Apparently there is actually a case for this in some market too.", "score": 2, "replies": [{"body": "Ex dividend dates are the only time I can think of right off the top of my head", "score": 2, "replies": []}]}]}]}]}, {"body": "Technically the option buyer has the right to exercise and assign the seller at any point, whether ITM or OTM.\n\nThis most often occurs when there is a dividend as the long call holder can assign the short call trader to buy the stock at the strike price where they can collect the dividend.  This can often happen even OTM.  \n\nOTM options can be assigned early, but they will not be automatically assigned by the broker at expiration unless ITM . . .", "score": 2, "replies": [{"body": "Yea I was reading into this process and actually found some interesting historical use cases on why this would make sense to do. \n\nNever actually had OTM assignments or exercised them myself so really did not consider this to be a viable option until I read about some stuff in historical examples. Interesting thing to learn. ex-Div date scenario makes sense. \n\nI admit I was totally off based on this. Thank you for the write up below as well.", "score": 1, "replies": [{"body": "No worries and this is complicated stuff!  Kudos to you for posting this!", "score": 2, "replies": []}]}]}]}]}]}]}
{"title": "Recession is here", "selftext": "[removed]", "id": "rgp9pv", "created_utc": 1639538762.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 25, "comments": [{"body": "Buy.The.Fucking.Dip", "score": 15, "replies": [{"body": "Instructions unclear,, Hidden Valley or Kraft?", "score": 2, "replies": []}]}, {"body": "I strongly believe we’re in a society", "score": 8, "replies": []}, {"body": "I hear this twice a week. Couple bad days…recession. Hit me up when we have a bad week and a half.", "score": 6, "replies": [{"body": "You must be young…if you think this is bad, 9-11 would of had you shitting your pants daily.", "score": 2, "replies": []}]}, {"body": "Lol love how a few days ago you were like give me the best strategy for this bullish market. Today, guys it is a recession. SPY is down 1%.", "score": 5, "replies": []}, {"body": "Lmao buy puts and post the screen shots pussy", "score": 5, "replies": []}, {"body": "You: Ressesion is here\n\nAlso You: wait 4 months", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4257)", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4640)", "score": 3, "replies": []}, {"body": "Definitely going all in on canned tuna and smokes", "score": 3, "replies": []}, {"body": "BuyDaDip.", "score": 2, "replies": [{"body": "Also...\n\nDipDaBuy hehe", "score": 2, "replies": []}]}, {"body": "Uvxy", "score": 2, "replies": []}, {"body": "My neighbors are all living in newly 2021 constructed Florida homes all bought on mortgage loans. Recession is a few years away at least until they default on non-payment", "score": 2, "replies": []}, {"body": "I strongly believe you are retarded", "score": 2, "replies": []}, {"body": "blah blah blol", "score": 2, "replies": []}, {"body": "You need to focus on being a sophomore in HS, that way U can make ut to your Junior year.\n\nAlso, consider what it means for US dollar to be currency of settlement,  and for US dollar to Not be currency of settlement.\n\nLuvYa", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|3 weeks ago\n**Total Comments**|5|**Previous DD**|\n**Account Age**|1 month|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rgp9pv)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rgp9pv)", "score": 1, "replies": []}]}
{"title": "PFE is a gift that keeps on giving…", "selftext": "", "id": "rgs61p", "created_utc": 1639548190.0, "score": 153, "upvote_ratio": 0.93, "num_comments": 25, "comments": [{"body": "Good job retard, you chose a winner. And congrats on your diamond hand 💎", "score": 15, "replies": []}, {"body": "The writing was clearly on the wall for this one.", "score": 9, "replies": [{"body": "I'm waiting for thier new rectal boosters to drop\n\nI'd happily boost up at least 69 times", "score": 4, "replies": []}]}, {"body": "Well done for holding. I sold my shares, purchased in Oct 2020, right at the top in August 2021 (I got lucky this time and timed it perfect!).\n\nMade decent money but as always with these things I wish I'd have bought more during that initial purchase. With hindsight it was an obvious bet. But how many of them have gone wrong down the years.", "score": 6, "replies": []}, {"body": "When did u buy it?\nDid you buy it on Oct 18 2021?", "score": 4, "replies": [{"body": "Yeah when did you buy it", "score": 3, "replies": [{"body": "Yeah When did you buy?", "score": 4, "replies": []}]}]}, {"body": "good , Pfizer is the way to go, i just sold my profit yerterday , im planing tojump in aigain", "score": 4, "replies": []}, {"body": "Awesome job", "score": 4, "replies": [{"body": "Relevant username, I guess :D  Congrats on the 5G!", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Right after it blows up! Or right before... depends on what you're in(to).", "score": 1, "replies": []}]}, {"body": "I only bought 1 PFE leap, talked myself out of buying 2", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|8|**First Seen In WSB**|9 months ago\n**Total Comments**|4|**Previous DD**|\n**Account Age**|10 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rgs61p)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rgs61p)", "score": 1, "replies": []}]}
