{"title": "Maybe none of you buy Crocs but check out their stock. [CROX]", "selftext": "[deleted]", "id": "i1bx1", "created_utc": 1308241624.0, "score": 3, "upvote_ratio": 0.72, "num_comments": 15, "comments": [{"body": "No joke I was looking at this the other day but for another reason.  I was looking to short Crocks because they get sued all the time.  But after some research I found out that they're mostly frvilous product liability suits that either get dismissed or settled at a much lower figure than that in the complaint.\n\nAlso, there was no correlation with their stock fluctuation and final resolutions to law suits.\n\nSo after doing some more research I came to the same conclusion as well - outperforming/undervalued. ", "score": 3, "replies": [{"body": "It's doing pretty well so far. \n\nI read last week that girls are going crazy over the new chameleon crocs that change colors in the sun.", "score": 1, "replies": []}]}, {"body": "Do they make anything else because those shoes are a fad.  Might as well buy stock in bell bottoms.", "score": 2, "replies": [{"body": "I thought the same thing. Look at their website. They have a huge line of new stuff. ", "score": 1, "replies": []}, {"body": "Considering that their shoes are little more than the same foam used to make flip-flops, their profit margin must be insane.  Of course, this is probably offset by the shitload of advertising they have to do to get people to wear their stupid footwear.", "score": 1, "replies": []}]}, {"body": "You're probably late to a stock if you only notice it because it's already gone up a ton.", "score": 2, "replies": [{"body": "I've been watching it for about 2 months now. The market has been terrible in general but there have been a lot of call options purchased recently which is a good sign and they have also been outperforming on EPS for some time now. It's also summer. This is their season for revenue generation. ", "score": 1, "replies": [{"body": "> It's also summer. This is their season for revenue generation.\n\nSeasonal effects are already factored into stock prices. You can't just buy toy stocks in November and sell them after Christmas for an easy profit.", "score": 1, "replies": [{"body": "This is obvious. Their earnings reports for summer aren't out yet. No one knows how much they will beat earnings by but whenever they have beat earnings, it gets reflected in the stock price once again. Right now P/E is relatively low too, it should get knocked back down as the next report gets put out and might get reset with a higher stock price. Who knows. As long as crocs is making money and beating earnings reports, it's a good investment.", "score": 1, "replies": [{"body": "Ummm, earnings forecasts take seasons into consideration. They also take previous earnings surprises into consideration.\n\n> Right now P/E is relatively low too\n\n25 is not low.", "score": 2, "replies": [{"body": "Are you even reading my comments? I'm optimistic while considering the fundamental bearish arguments. And yes, their P/E is relatively low considering their historical p/e ratios (not that I care much about it).\n\nhttp://ycharts.com/companies/CROX/pe_ratio#format=real", "score": 1, "replies": [{"body": "> Are you even reading my comments?\n\nYes, unfortunately.\n\n> considering their historical p/e ratios (not that I care much about it)\n\nYou are correct to not care much about it, as this information isn't terribly relevant -- which begs the question of why you're using it as the basis of your argument in the first place.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This is absolutely 100% false.", "score": 1, "replies": [{"body": "How can something be 100% false if the qualifier \"probably\" is used? At most it could be something like 70% false.", "score": 1, "replies": []}]}, {"body": "reaction v. prediction trading\n\ntwo very separate, well proven and developed platforms of trading", "score": 1, "replies": []}]}]}
