{"title": "TSLA trouble", "selftext": "Hi all, theirs a bit of a back story to this so sit tight. \n\nBack through the end of 2021 I ended up selling 3 $1,100 for a very small credit. Tsla was trading at the top at this point probably around $1200 pre split. A bunch of drama stuff happened with Elon. Sold a bunch of shares, bought twitter, went from Forbes man of the year to everyone memeing him. Stock tanked drastically and ended up  selling one of the outs for around a $10,000 loss and getting assigned this owning 200 shares of Tsla with a about $213 cost basis. In addition to that I was trading these on margin so I ended up with a $40,000 loan with a 13% interest rate. I know theirs a bunch of options on how to best go about getting out of this but happy to take any advice/suggestions.\n\nAdditionally I paid off $20,000 and have a balance of $23k left of margin to pay off. \n\nA few options I thought of were:\n\n1. Sell shares at a loss and pay the remainder of the loan. (I don’t want to do this)\n\n2. Sell calls at the cost basis for “risk free” premium. Problem with this is premiums are almost non existent if I were to sell weekly calls at $200 cost basis. \n\n3. Slowly continue to put money in and pay down margin. \n\nHappy to hear any other suggestions! \n\nI know, I effed up big time. Very expensive mistake. \n\nI still think Tsla isn’t going anywhere anytime soon and in the long run it will rebound. I’d like to keep the shares if possible. \n\nLet the jokes come rolling in!", "id": "13higrz", "created_utc": 1684086269.0, "score": 30, "upvote_ratio": 0.8, "num_comments": 73, "comments": [{"body": "Choose what’s more important for you. Money or TSLA shares. Option 1 is what I would highly recommend. You don’t ignore a continuous bleeding problem. Any interest you pay is tax deductible but at the same time it costs you more money unless you’re earning close to 150k tax bracket\n\nAlso money = hours of your life.", "score": 38, "replies": [{"body": "It’s only deductible if you itemize on Sce A. Even then it is limited to your investment income. If OP is part of ~90% of folks that take standard deduction, than no relief there.", "score": 6, "replies": []}, {"body": ">unless you’re earning close to 150k tax bracket\n\nI would argue it's not good to pay $1 to save $0.25 no matter what tax bracket you are in.", "score": 1, "replies": []}]}, {"body": "If I'm reading this right, TSLA basically has to gain 13% a year for you to break even. Just sell the shares.", "score": 32, "replies": [{"body": "On the flip side. 13% a year for TSLA is very doable.", "score": 12, "replies": [{"body": "is very doable and is very probable are not the same\n\n13% a year for SPY is very doable, but I wouldn't be buying SPY shares on a 13% loan hoping that it runs 20% and I can pocket 7%\n\nThere's also a very real possibility tesla goes down 13% in a year, which means now OP is down 26%", "score": 4, "replies": []}, {"body": "Also very likely to lose 50% from where it’s currently trading over the next few years if the current trends continue", "score": 0, "replies": [{"body": "What is everyone's outlook on TSLA at thetagang?", "score": 0, "replies": []}]}]}, {"body": "Agreed, you can hope for more gains, but 8% is the limit for expectations or requirements. \n\nI think selling via slightly OTM covered calls is an option as well though.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "How is a box spread different than an iron condor?", "score": 2, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Found a good resource [here](https://www.optionseducation.org/getmedia/2dcfb179-dca6-44a6-bdeb-3f2386122776/listed-options-box-spread-strategies-for-borrowing-or-lending-cash.pdf) interesting strategy I will start educating myself on now.", "score": 2, "replies": [{"body": "Great, thanks for sharing!", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}, {"body": "why can't you do it as a German?", "score": 1, "replies": []}]}]}, {"body": ">sell an SPX box spread 400 points wide\n\nMake sure you are OK with your account being at negative $700,000 after hours.\n\nSome people might get a little antsy about that.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The traditional way to display it is based on the bid/ask spreads as if you wanted to exit the position at that moment, if I am not mistaken.  Because the bid/ask spreads for SPX get insane after hours, you get this weird issue.\n\nYou can just ignore that if you have enough willpower, because you still can't be called or forced to exit the position, but it can be a little unnerving.", "score": 1, "replies": []}]}]}]}, {"body": ">Sell shares at a loss and pay the remainder of the loan. (I don’t want to do this)\n\nYou have a 13% loan. That's basically a $23,000 position losing 13% a year. Do you think your TSLA shares are going to go up faster than your loan interest? Anyway, you could still keep like 63 shares at current price, or sell it all and call it a lucky break that you went in the hole $40,000 and managed to get out of the debacle with only about a $6500 loss.\n\n&#x200B;\n\n>Sell calls at the cost basis for “risk free” premium. Problem with this is premiums are almost non existent if I were to sell weekly calls at $200 cost basis.\n\nThis is gambling. Selling \"risk free\" options is what got you here in the first place. It's also revenge trading - the idea that your future trades are \"making up\" for prior losses. Given that risk-managed trading is not likely to pay off a loss from risk-UNmanaged trades, there's a good chance you'll start taking more and more risk and end up in a worse position.\n\n&#x200B;\n\n>Slowly continue to put money in and pay down margin.\n\nThis is you rationalizing the gambling, as if paying off the debt slowly atones for continued gambling.\n\nYou know what the responsible thing to do is. You'll feel a lot better just getting the situation over with, and you'll also trade more responsibly if your motivation isn't to offset a huge losing position.", "score": 13, "replies": []}, {"body": "If you’re selling covered calls that far OTM, you have to choose a lot longer expiry than weeklies. You get paid for the likelihood that the option goes ITM, which is very slim for such a short duration. See how far you need to go to get paid more in premium than the interest you’re paying - that should be the MINIMUM requirement. Then consider if it’s worth it, if you honestly believe this is the best investment you could make with your money, and if you’re willing to commit for that long.", "score": 6, "replies": []}, {"body": "Calculate what each choice does for you assuming TSLA drops more, TSLA stays around the same and TSLA goes back up.  Helps put things in perspective.", "score": 5, "replies": []}, {"body": "Don’t be afraid to lower the stroke of your calls or just sell call spreads instead of covered calls", "score": 6, "replies": []}, {"body": "Unless you are considering tax ramifications for holding periods and such, behave as if you just got these shares today. All the considerations about how much you are in the hole just make you behave irrationally and suboptimally. \n\nIf the IV looks rich, sell .30 delta calls.", "score": 5, "replies": []}, {"body": "13% rate... What kind of covered call can be risk-free to offset this interest? Just sell the shares to take loss, which can be useful some day", "score": 3, "replies": []}, {"body": "You might wanna just restructure the loan cus 13% interest is killing. Making 13% anywhere will be so difficult it doesn't make sense to do anything else with your money than pay it down.", "score": 2, "replies": []}, {"body": "\"anywhere anytime soon and in the long run it will rebound.\"\n\nNo, no it won't.", "score": 2, "replies": []}, {"body": "I think Tesla is beyond its heyday. Chinese EV manufacturers are forcing Tesla to cut prices. It will still be the largest EV manufacturer in the world but maybe its gross margin is declining", "score": 5, "replies": [{"body": "I think the problem TSLA will have comes from just about every direction; not necessarily the Far Eastern one.   It will likely face a lot of serious structural problems that won't be overcome - and in all their markets, not simply those overseas.", "score": 3, "replies": []}, {"body": "Do they sell chinese cars in Europe? Certainly not in the USA. \n\nTesla lowered prices to put pressure on Ford and GM. Now Bolt is dead, MachE is dying, and startups are too scared to play. Setting the bar for Tesla gross margin at 20% when everyone else in the mass market gets below 10% is silly. Additionally, taking profits at low volume (only 5% of new cars are EVs) just let Ford and GM delay another year profitably. Tesla crashed because it stopped acting like a growth company. Bulls even started asking for buybacks...\n\nPrice cuts heading into a recession supports factory growth while others stall. They still remain crazy profitable considering most thought this was impossible. When we emerge and the fleet is aging, Tesla will be there with inventory to sell. Ford and GM will gloat about their waitlist at 10-20% volume.", "score": 1, "replies": [{"body": "This analysis is beyond stupid.\n\nTesla didn't kill GM's Bolt because of \"pressure\" from Tesla. GM killed GM's Bolt.  Why?  The bolt is an older architecture / battery tech.  \n\nAll of GM's new EVs are on the Ultium platform and they are launching numerous EVs on this platform.  The Equinox EV is slightly larger than the Bolt, has more features, same/better range, more power, and is ~ the same price.  \n\nAs far as \"Tesla stopped acting like a growth company\", no.  Tesla stopped BEING a growth company due to waning demand.  Demand dropped for all sorts of reasons:  economy, build quality issues, poor customer service issues, Elon going far right wing nut job, etc.", "score": -1, "replies": []}, {"body": ">Do they sell chinese cars in Europe?\n\nYes, [they're entering Norway, for example.](https://cnevpost.com/2022/08/10/norway-how-big-is-its-ev-market-how-do-chinese-brands-perform/)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "> 180-200\n\naka my short call spread", "score": -1, "replies": []}, {"body": "Agree", "score": 1, "replies": []}]}, {"body": "They will not be the 'largest ev maker in the world'.  They are already rapidly falling behind everyone else.  \n\nAgree they are beyond their heyday.", "score": 1, "replies": []}]}, {"body": "The only solution here is to sell your house and put it all into dogecoin.", "score": 4, "replies": [{"body": "Only logical solution to op's problem but have to buy it while filming yourself at the gym.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Why not roll the call up and out? You can make good money on weeklies around that strike.", "score": 1, "replies": []}]}, {"body": "I would cut your losses. TSLA is going below $100.", "score": 3, "replies": [{"body": "Below $50", "score": 1, "replies": []}]}, {"body": "Sell the stock and sell an equal number of puts at your cost basis(I'd go for the 30-45 dtes then roll till it recovers), you won't receive the dividend nor pay any interest but you will participante in the underlying movement, the catch here would be not getting screwed by the bid ask spread.\n\nMake sure to check the math, and compare how much you have lost vs the price of the puts you'll sell.\n\nThink it very carefully as it is a good time to change your investing paradigms (sorry I don't do bullish plays on single stocks, also I think Elon is a con artist).", "score": 1, "replies": [{"body": ">Sell the stock and sell an equal number of puts at your cost basis\n\nNewbie here trying to figure out why he should sell itm puts at his cost basis when his cost is so much higher than the current stock price - wouldn't he be assigned at $200 and be underwater?", "score": 1, "replies": [{"body": "Make sure to roll for a credit 2 weeks before expiration until it recovers and leave it expire worthless (this may take years or not happen at all), the idea is to capture the underlying movements without buying the stock when the put is deep itm the delta is so close to 1 that it captures all the movement of the underlying without the need of holding shares, this frees up capital, so he won't be paying interest on that money(however you will need to meet margin requirements on your account, but you can use the cash to buy something with very low risk such as tbills and add up an additional ~5%).\n\nFor example the Jun 16 $213.33 P can be sold for ~$45.5 (96.94 Delta)the stock is @ $167.2 (adding $45.5 + $167.2 gives you $212.7) which is very close to $213.33 leaving you with the same risk profile.\n\nFortunately $TSLA has liquid options so hopefully OP won't lose much on the spread.", "score": 2, "replies": [{"body": "Thanks for the explanation. If the stock price tanks and the puts become more expensive to buy back, would there be a point where he ends up losing more money through rolling?", "score": 1, "replies": [{"body": "If IV expands he will need to add some more time to roll for credit, also liquidity might cause slippage, also keep in mind that when delta is close to 1 the other Greeks provide less extrinsic value...", "score": 1, "replies": []}]}]}, {"body": "the problem here, especially if you're not sure what you're doing - is that you can end-up digging a deeper hole for yourself.", "score": 1, "replies": []}]}]}, {"body": "UPDATE: ended up selling 2 TSLA $200 calls for $2.19 credit each on may 15th. It was trading at $167. and since then Tsla has rallied about 45% or $78. Gotta love it.", "score": 1, "replies": []}, {"body": "I’ve seen compelling arguments that Tesla is relatively “cheap” right now if they meet they not so aggressive goals over the next 5 years. Maybe sell covered calls and wait it out", "score": 1, "replies": [{"body": "well I've seen the exact opposite, and it wouldn't surprise me if ultimately TSLA trades well below $100 - and I'm not putting any limit on how low it could go.", "score": 1, "replies": [{"body": "their cars are shit lmao", "score": 0, "replies": [{"body": "Their cars are shit but it really depends how much market share they can continue to take, it’s in between being value a growth stock or a blue chip, I think it will ride a bit more at least once again until it settles somewhere", "score": 0, "replies": [{"body": "arent its margins collapsing... there are finally ev options other than their shitty cars", "score": 0, "replies": [{"body": "I was under the impression they are still >20% but not sure if that was prior to impact of the price cut", "score": 1, "replies": []}]}]}, {"body": "Ford’s are shit too.  So are kias, chevys and pretty much any car is shit now.   Other than a S or X tsla is no a luxury car - other than the tech side.", "score": 0, "replies": []}]}]}, {"body": "there are ZERO compelling arguments for Tesla being cheap.", "score": 0, "replies": [{"body": "I would have agreed with you 7 years ago but here we are I would have missed a 100x stock… they keep growing into their outrageous stock prices and now they have a P/E ratio that is probably the most realistic one since inception.", "score": 1, "replies": [{"body": "Their PE ratio makes zero sense.", "score": 1, "replies": []}]}]}, {"body": "It's just a car company and should have 8 pe like others, I am surprised people still believe musk scam pumping covered with saving the mankind bs. People are really naive these days.", "score": 0, "replies": [{"body": "The other car companies aren’t growing remotely as quick. Tesla should grow into its current value within 5 years.", "score": 2, "replies": [{"body": "It's not growing, recently no demand, can't even  sell 2 million cars.", "score": 0, "replies": [{"body": "https://lmgtfy.app/?q=tesla+sales+2023", "score": 1, "replies": []}]}]}]}]}, {"body": "wow you can't even be bothered to open a 0% credit card while you figure this out", "score": 1, "replies": []}, {"body": "Congrats you got played by Musk. He thanked you for your generous donation.", "score": 0, "replies": []}, {"body": "Story is irrelevant. Eat loss or keep rolling to bigger loss. End.", "score": 0, "replies": []}, {"body": "That margin rate is too high. You should pay it off as soon as possible. If you don't want to sell shares for a loss, or you can't fund the account to cover it, you can look into selling a box spread to essentially get a loan with a lower rate.", "score": 1, "replies": []}, {"body": "Go with #1 and take the loss now, keep paying off your loan.\n\nBTW, my wife and I sold TSLA puts in early 2021 (obviously before the split), got assigned on all 3 of them when the price dropped. No margin, all cash tied up for 300 shares.\n\nWe sold OTM CCs for months until we made enough premium money and finally sold the last of our CCs when the price went back up before end of 2021.\n\nNo regrets, as we learned a lot about options and have made good profits in 2022 and now in 2023 with other stocks.", "score": 1, "replies": []}, {"body": "Reading your post from the beginning I'm not sure I'm following what you've done at the start, but I understand you're long delta TSLA with a cost basis over $200 with a bunch of margin & interest building.\n\nThe only contribution I'm going to make is one you don't want to hear and one you will most likely ignore:\n\n \\- I'd strongly suggest you consider the possibility TSLA re-tests its January lows - and that it could easily eventually trade below $100.    \n\n \\- I see a lot of overhead supply around the $185/205 (roughly eyeballing it) - and that's simply from a crude technical perspective.  \n\n \\- On a fundamental basis I think TSLA is an absolute dog, and I wouldn't be touching it with a barge pole.  Sorry for the high-brow language, but I think you should know the truth.  I know a fund manager not too far away from where I'm sitting at the moment who knows a few things (about TSLA and its standing in the industry) from insiders, and it is desperate.\n\nI hope you resolve your situation, and are luckier picking your spots and fighting your future battles.", "score": 1, "replies": []}, {"body": "Id sell a covered call close to the money (enough to cover your monthly interest), if you're getting exercised have fun rolling up until you get called. \n\nSell the other call further out to claw back some losses.\n\n\nI'm as bullish as you are, but you are paying way too much to borrow the shares. Any expectation over the S&P 8% is greedy. We're heading into a possible recession, millennials have to repay their student loans soon, and the news is about to freak out about the debt ceiling.\n\nIf tesla rips higher i'll feel bad for you, but i'm not expecting it in the next 3 months.", "score": 1, "replies": []}, {"body": "How is it that you sold 3 contracts before the split and ended up with 3 contracts post split?\n\nBased on my understanding, you should have ended up with an equivalent number of contracts as the split ratio, in this TSLA case, 3x3 = 9 contracts with lower strike $1,100/3 = $366.67).\nIf your mew cost basis was $213, are you sure you collected such a small premium from the naked puts?\n\nOn your topic:\nIf you have a margin interest of 13%, why not selling 305 DTE CC, strike of $200, currently priced at $23. That is 11.5%. You may not break even, but will be losing less, and keep the shares. If the price goes up, you can always roll for some credit, if it goes down, your cost basis is lower now.\nIn such long time, I think TSLA will eventually go high, even though it may go down later again. I think it may be the least worst of the options you are considering.", "score": 1, "replies": []}, {"body": "You should do 1, you’re going to do 3, no matter what everyone else is saying. No point in asking, really.", "score": 1, "replies": []}, {"body": " If you owned the shares outright and didn't have the margin balance, a possible solution would be a no cost $165/185 Repair Strategy. At $185 at expiration you'd net $215. Unfortunately, because you are 40 points down, the nearest repair that would be doable would be the July 21st expiration. Not the end of the world but I prefer nearer expirations for repairs.", "score": 1, "replies": [{"body": "Still doing the lords work, I just read about them last night.  This is something that as long as the stock stays flat or be upward you should be good, but the downward would be “more bad” than ok, correct?", "score": 1, "replies": [{"body": "With a no cost collar, the downside would be identical to just owning the stock. It's a bullish strategy.\n\nI've posted about this before, but I couldn't find a link so here it is again:\n\n&#x200B;\n\nA Repair combines a bull call spread and a covered call per 100 shares owned. The objective is to do it for the nearest possible expiration at no cost. The Repair is a 1x2 ratio spread (buy one call at a lower strike and sell 2 calls at a higher strike. All short calls are covered.\r  \n\r  \nThe premium received for selling the higher strike should be at least 1/2 the cost of the lower strike so that the ratio spread costs nothing. A credit is even better. If the repair does not work out, you'll have the same downside loss potential as just holding the stock, collecting dividends (if any) and hoping for a recovery. To the downside, a failed no cost repair has no impact on the overall position.\r  \n\r  \nThe short strike should be about midway between the current price and your break-even price. You can use higher or lower strikes depending on what the numbers look like. \r  \n\r  \nImplied volatility affects a repair’s cost or credit. The lower it is, the more costly the repair. If higher (for example, pre earnings), the credit will be larger and that may enable you to use a lower pair of strikes which then has a higher probability of the upper strike being reached and the repair succeeding.\r  \n\r  \nTo select a repair, look at a near expiry. Go out one expiration at a time until you find a pair that meets the no cost requirement and provides break even. These criteria are not etched in stone. If you want to pay a small premium for the repair or if you want to shoot for a price less than break even, go for it.\r  \n\r  \nDividends inflate put premiums and deflate call premiums. This has a greater effect on options closer to the money which makes a Repair more expensive, relatively speaking.\r  \n\r  \nIf the Repair succeeds, your covered call will gain up to its strike price and you'll also make the difference in strikes on the vertical spread.\r  \n \r  \nBe aware that doing a Repair with a lot of time until expiration can be problematic because you won't see the full profit at the higher strike pre-expiration.\r  \n\r  \nIf possible, I tend to roll the Repair up and out when the bull call spread has a large profit (before it goes ITM).  Trying to squeeze out the last bit of Repair profit can be costly if the underlying reverses and drops.", "score": 1, "replies": []}]}]}, {"body": "There is no such thing as a risk-free premium. If you go with choice 2, you're getting a fair bit of money (Jul 21 options get you 2.5% in just 2 months). However, you bear the risk of continued losses in the stock.\n\nAdditionally, note that any money you do get comes at a steep cost - namely, your 13% margin loan. A 2.5% return over 2 months works out to 16% annualized, but that is a very risky return that depends on things working out as you hope. In the worst case, you're just digging yourself into an even deeper hole. In contrast, paying down your loan gives you a risk-free 13% return.\n\nI understand that you don't want to do option 1, but I think you know that it's rationally the best choice. That's why you thought ahead to specify that you don't want to do it (since you were expecting everyone to recommend it). It's very very difficult to cast your emotions aside when investing your own money, but try to think about it as if it was someone else's money. If they're losing money to debt at a rate of 13% a year (those are personal loan rates, btw), you would advise them to pay off the debt ASAP.\n\n3 is a good alternative *if you believe in the fundamental thesis of Tesla and you think it will be realized soon*. Otherwise, there's no reason to lock yourself into a stock that you are unsure about in the short-mid term, and continue paying high interest rates while crossing your fingers and hoping that things work out (which is generally not a great strategy).", "score": 1, "replies": []}, {"body": "Jesus so you’re going to sit on speculative shares that are likely to lose even more value, and pay interest on top of that?\n\nSell the fucking shares dude, what is wrong with you", "score": 1, "replies": []}, {"body": "I can't believe you didn't sell the shares immediately. Your plan is to own shares with a cost basis significantly above the current ATH?", "score": 1, "replies": []}, {"body": "I'd sell 2x 30 delta calls around 30 dte.\n\nSo example the June 16 183C or 185C.\n\nThis would yield around $700 premium. Less $200 margin interest = $500 free cash that can be diverted into either paying off the loan or buying more shares.\n\nIf you no longer have a bull thesis for tsla, quit.", "score": 1, "replies": []}]}
{"title": "2011 U.S. Debt Ceiling Crisis timeline!", "selftext": "&#x200B;\n\n[ ](https://preview.redd.it/n7f09q0j1vza1.jpg?width=1737&format=pjpg&auto=webp&s=0d4fff03693e62ded60be54564c0c53a656095de)\n\nFriendly reminder that market dropped almost 15% even after Congress resolved the debt ceiling crisis by passing the Budget Control Act of 2011\n\nsome important events to follow\n\n\\- In July 2011, as the economy showed early signs of recovery and federal debt approached its limit once again, negotiations began in Congress to balance spending priorities against the ever-rising debt burden. \n\n\\- Congress resolved the debt ceiling crisis by passing the Budget Control Act of 2011, which became law on August 2, 2011.\n\n\\- Black Monday 2011 refers to August 8, 2011, when US and global stock markets crashed\\[1\\] following the Friday night credit rating downgrade by Standard and Poor's of the United States sovereign debt from AAA, or \"risk free\", to AA+", "id": "13hn8fi", "created_utc": 1684098011.0, "score": 304, "upvote_ratio": 0.92, "num_comments": 73, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|1574|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "I would like to be a fly in the wall to see how many of them, their friends and family buy stocks just before they finally approve the budget/debt ceiling US craziness", "score": 157, "replies": [{"body": "Tbh this could be why they like playing chicken, because it’s a way to manipulate the market.", "score": 47, "replies": []}, {"body": "Did you see the graph? Stocks go down AFTER they solve the debt ceiling.\n\nThis is because the government can start selling bonds... aka remove dollars from the economy and putting them in their pocket.  It's the inverse of money printing for a few weeks!", "score": 21, "replies": [{"body": "This makes no fucking sense. Deficit spending is inflationary. The government essentially borrows money from large financial institutions sitting on Uncle Scrooge-sized swimming pools of cash and quickly blows it all on defense contractors, Medicare fraud and grants for research on snail mating habits. Dollars are removed when debt is paid off, not when it is created or rolled over.", "score": 10, "replies": [{"body": "This is NOT deficit spending, though. This is the treasury refilling its stash so that they can do the spending later.\n\nAgain, look at the graph that was posted.", "score": 6, "replies": []}, {"body": "Did you know that the research on snail mating habits resulted in Viagra ?\n\n😁", "score": 2, "replies": []}]}, {"body": "double jeopardy! woot!", "score": 3, "replies": []}]}]}, {"body": "It'll be different this time. We're the greatest dip-buying generation in history.", "score": 172, "replies": [{"body": "[deleted]", "score": 39, "replies": [{"body": "I mean it hasn't worked great for banks which traditionally just get bigger and richer and everyone assumes they will. Some tech leader will start the decline in growth stocks when they fail to deliver layoffs part 2 and ai 2 to continue the expectations they've set.", "score": 8, "replies": []}, {"body": "Add to the fact that little to no commission fees makes it ALOT more easier to trade.", "score": 7, "replies": []}]}, {"body": "No y’all aren’t. The algos are. Computers buy 99% of the dip while 5 boomers buy the dip in mega caps.", "score": 61, "replies": []}, {"body": ">We're the greatest dip-buying generation in history.\n\nFalse, most people still buy high, sell low, then buy back in at all time highs.", "score": 23, "replies": [{"body": "I buy high 100% of the time", "score": 1, "replies": []}]}, {"body": "Is Greece defaulting again and destabilizing the EU? If not then it really is different this time.", "score": 2, "replies": [{"body": "they got such a good deal out of that", "score": 4, "replies": []}]}, {"body": "Well you were until the fed stopped buying the dip.", "score": 1, "replies": []}]}, {"body": "So we never moved back up to AAA?", "score": 22, "replies": [{"body": "Nope", "score": 12, "replies": [{"body": "Have we sent tanks?", "score": 23, "replies": [{"body": "To where, the credit rating agency headquarters?", "score": 14, "replies": []}, {"body": "Maybe to Ukraine.", "score": 2, "replies": []}]}]}, {"body": "AA is bigger than AAA anyway", "score": 11, "replies": [{"body": "I am more of a DD fan myself.", "score": 5, "replies": []}]}]}, {"body": ">The downgrade was due to concerns about the country's increasing debt burden and lack of progress on reducing deficit spending. The stock market crash was a result of investors' uncertainty and fear about the future of the US economy.", "score": 66, "replies": [{"body": "I'm glad we sorted all those problems out. Whew.", "score": 118, "replies": [{"body": "Thank goodness. \n\nRemember \"this time is different.\"", "score": 34, "replies": [{"body": "Gotta love that one\n\n> this time is different", "score": 3, "replies": [{"body": "Fool me once shame on you, fool me twice can't get fooled again", "score": 2, "replies": []}]}, {"body": "It is different. Somehow the road that we started kicking the can down back in 2009 looks shorter all of the sudden.", "score": 2, "replies": []}]}]}, {"body": "happy cake day VM", "score": 4, "replies": []}, {"body": "That sounds like the story I’ve been hearing since I was 6.", "score": 1, "replies": []}]}, {"body": "We still got a lot of A's to get through and even a plus!", "score": 28, "replies": []}, {"body": "Yeah, but we didn't have a bunch of zealot regards in Congress who..believe a technologically advanced mermaid fish person civilization is preparing to invade and take control of world governments using...democrat daemon magic and...trans transformers during the 2011 debt crisis.", "score": 16, "replies": [{"body": "I see you entirely forgot the tea party lol", "score": 4, "replies": []}, {"body": "What? There are mermaids now?", "score": 2, "replies": []}, {"body": "I would watch a Trans Transformers movie", "score": 1, "replies": []}]}, {"body": "So the only trick now is to call the bottom eh?", "score": 8, "replies": [{"body": "![img](emote|t5_2th52|4258)\n\nwhen RSI hits negative 3", "score": 2, "replies": []}]}, {"body": "Puts it is", "score": 16, "replies": [{"body": "Which is exactly why I'm going with calls", "score": 25, "replies": [{"body": "You’ve had 2 months of brain dead calls paying almost daily. Times up bulltrd", "score": 7, "replies": []}]}, {"body": "Which tickers?", "score": 2, "replies": [{"body": "Pick one", "score": 3, "replies": []}]}]}, {"body": "Our debt will be upgraded to LGBTQAAA+1 this time around. \n\n\nYou cannot beat that rating.", "score": 30, "replies": [{"body": "Since bears are gay, puts it is.", "score": 4, "replies": []}, {"body": "If you can’t beat it you can try flicking it.", "score": 2, "replies": []}]}, {"body": "US bonds are dog shit wrapped in cat shit", "score": 14, "replies": []}, {"body": "This is why I have stayed out of the market. Way too much uncertainty about what will happen over the next few weeks.", "score": 16, "replies": [{"body": "I’m pretty sure we’ve gone up since 2011.", "score": 31, "replies": [{"body": "Yes, with a zero percent federal funds rate for most of the time.", "score": 8, "replies": [{"body": "The stock market went up in the 80s with a stupid high interest rate. The interest rate is not the sole driver.", "score": 7, "replies": [{"body": "Interest rate isn't sure.... but the money printing is 110%", "score": 1, "replies": []}]}]}]}]}, {"body": "The moment the US debt is under discussion... charts, crayons, math, and \"logic\" can just all go to hike.\n\nLets pause all this default talk for a second and recall that just after the dot-com crash, all the US media ever talked about was shark attacks.\n\nFFS you damned gerbils, fire those neurons and get out of the hamster-wheel.", "score": 2, "replies": []}, {"body": "Except it got resolved pretty quickly back in 2021 when they kicked it down further", "score": 2, "replies": []}, {"body": "Good post", "score": 0, "replies": []}, {"body": "What other country has a “debt ceiling”?\n\nBiden should just use the 14th amendment.", "score": 0, "replies": [{"body": "Nah. He should mint the coin", "score": 1, "replies": []}]}, {"body": "When was the x-date meant to be for 2011? It'd be interesting to compare the movements of now and 2011 relative to their respective x-dates.", "score": 1, "replies": []}, {"body": "Since saudis have billions of dollar short position, I’m willing to bet we stick it to saudis with spy going 420+", "score": 1, "replies": []}, {"body": "On August 11th, the SPX  dropped 6.7%.  That would be a -277 move in SPX based on futures value this morning (Monday, May 15th).\n\n&#x200B;\n\nBears gotta be realistic.  SPX won't even allow a -.7% dip to hold through a session without a V-shaped recovery by end of day.", "score": 1, "replies": []}, {"body": "Then we entered into one of the best bull runs in U.S history", "score": 1, "replies": []}, {"body": "Too many words. When do I buy 0dte SPY puts?", "score": 1, "replies": []}, {"body": "The only thing that I got from this post is that this exact play is a sure shot money loser.", "score": 1, "replies": []}, {"body": "Today's investors/traders would buy the dip and we just keep squiggling up and up. Nowadays THE ENTIRE WORLD can get on their money machine casino phones from wherever they are and panic buy.", "score": 1, "replies": []}]}
