{"title": "Tesla started production of Model Y with BYD battery in German Gigafactory, according to a report", "selftext": "", "id": "137s5se", "created_utc": 1683217300.0, "score": 86, "upvote_ratio": 0.94, "num_comments": 73, "comments": [{"body": "[deleted]", "score": 19, "replies": [{"body": "Eh, it's like apple using displays from samsung. It doesn't really matter when the completed product is compelling", "score": 38, "replies": [{"body": "More like samsung buying oled panels from LG (since apple dont do displays in your example, but tesla makes batteries)", "score": 1, "replies": []}]}, {"body": "Depends on the terms of the deal. If they both benefit then it makes sense. There are other competitors.", "score": 12, "replies": []}, {"body": "I remember the early days where AMD produced processors on behalf of Intel.  It makes sense when demand is high.", "score": 6, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Well it took them 42 yrs...", "score": 3, "replies": []}, {"body": "AMD is now worth as much as intel. And is curbstomping them in almost all markets.", "score": 2, "replies": []}, {"body": "In this instance Tesla is using these batteries to then sell a higher profit vehicle. BYD could be doing this themselves but for some reason they aren't. If anything it's even better for Tesla.", "score": 2, "replies": [{"body": "> BYD could be doing this themselves but for some reason they aren't\n\nHuh? BYD are selling EVs you know. Selling batteries to Tesla is just a side hustle", "score": 2, "replies": []}]}]}]}, {"body": "Tesla doesn’t seem to see any other car company as ”competition”. They want other companies to ramp up and make EVs to combat climate change. With that mindset, there wouldn’t be any sort of conflict with giving money to BYD, as long as it’s not having a negative impact on Tesla. I think something along these lines was mentioned in the last earnings call, but I could be wrong.", "score": 7, "replies": [{"body": "BYD doesn’t sell many cars in Germany.  In China, where BYD does sell many cars, they use CATL batteries.", "score": 7, "replies": []}]}, {"body": "BYD also supply to Toyota, batteries, electric motors etc.", "score": 5, "replies": [{"body": "Even cars.  The new Toyota BEV in China is a rebadged BYD.", "score": 4, "replies": []}]}, {"body": "Tesla probably thinks that market share and revenue growth are more important than a company that targets a different segment.", "score": 2, "replies": []}, {"body": "You are seeing this in the wrong light. CATL, BYD Panasonic sell \"silver\". Tesla turns it in to gold.\n\nWhat i mean, battery manufacturers and also BYD have very thin margins. Tesla has very big margins.", "score": 2, "replies": []}, {"body": "BYD is the one losing on these deals. They are killing there own margins by supplying everyone else. This is just capitalism taking advantage of communism.", "score": 2, "replies": []}, {"body": "Tesla makes cells. Using your logic, Panasonic and LG are direct competitors.", "score": 3, "replies": [{"body": "Not even remotely the same thing.  Tesla doesn’t sell batteries, BYD does sell cars.", "score": 4, "replies": [{"body": "The Powerwall is in direct competition with the LG ESS Home and the Panasonic EverVolt. Then there is the commercial size battery offerings from both Tesla and LG.", "score": 3, "replies": [{"body": "BYD also sells power walls.  \n\nThey are direct competitors of Tesla with cars and power walls.   I don’t understand why they would buy batteries from BYD to put in their made in Germany cars. \n\nObviously I could be missing something here,  maybe they are cheaper? I still think it’s a really bad idea especially with BYD beginning to export into Europe and many other countries around the world.", "score": 1, "replies": [{"body": "Why is it a bad idea? BYD is also a supplier. They're paying what the find to be a fair rate for these cells/packs and are putting them in their cars.", "score": 5, "replies": [{"body": "Because Tesla is helping to fund their main competition in the biggest auto and EV market in the world who is also expanding into Europe, the second biggest EV market in the world.  \n\nAlso, Tesla will need to make a smaller cheaper EV and BYD is miles ahead of them.", "score": -2, "replies": []}]}, {"body": "Why not? For every battery they buy, that’s one less for a competitor and one more car sold in their column appose to a competitor.\n\nIf it came to a choice like Ford buying them or Tesla who would you prefer if both companies are short on batteries them selves.", "score": 3, "replies": [{"body": "BYD is their main competition.  \n\nEvery battery Tesla doesn’t buy from CATL, Panasonic or LG is just one more for the rest of the competition, excluding BYD of course.", "score": 1, "replies": [{"body": "You’re assuming they are not buying as many as they can from the other suppliers?! \n\nAlso it’s called hedging your bets, if any of your suppliers are having issues supplying you due to constraints or shortages etc, then you still have your other suppliers you can lean on.\n\nDon’t keep all your eggs in one basket.\n\nIf they don’t buy them someone else will, so I don’t see why you’re so hung up over them being a competitor.\n\nLG supply their screen to many other Tv companies, so what.", "score": 3, "replies": [{"body": "They are already hedging their bets.  \n\nPanasonic, LG, CATL and the ones they are making themselves.  If it’s pricing that’s the reason it isn’t smart imo.", "score": 1, "replies": [{"body": "As of Nov 2022\n\nLG Display supplies panels to more than 20 TV brands, including LG, Hisense, Sony, Panasonic, Philips and Vizio. Some of these brands market their TVs as OLED EX, while others use their own branding or just refer to them as OLED\n\nBy your own logic, all these companies Sony, Panasonic etc are wrong for doing this.", "score": 3, "replies": []}, {"body": "Why isn’t it smart? What do you know that Tesla doesn’t know or hasn’t considered. Tesla is ramping up both cars and battery storage they want all the batteries they can get.\n\nJust because BYD make cars so what? The cars they sell appeal to different people than what Tesla cars do. The end product at the end of the day.\n\nThis exact thing is done with TV companies all the time.", "score": 2, "replies": [{"body": "BYD is their main competitor in China & they are making quick inroads into Europe as we speak.\n\nThey sell cars that appeal to different people?  Are you serious?   Tesla will never reach their goals until they sell cheaper, smaller models.  \n\nBYD started there and are now making higher end cars.  They have 20 different models today.  \nI think this is a terrible idea.  \n\nWe can just agree to disagree", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I don't think Tesla is yet ready to make anywhere near the number of cells needed for the number of cars they are selling in Germany right now. That is still a few quarters (or years) away.\n\nPlus, the BYD Blade batteries are known to be a great product. Why not use them until they have the capacity to make enough of their own?\n\n&#x200B;\n\nCompetitors very often work together in lower-margin stages of their supply chain. It's the final product that the consumer is buying, and the individual internal parts are usually not relevant to the purchaser.", "score": 2, "replies": [{"body": "This isn't 'working together'. Tesla is a customer in this instance.", "score": 2, "replies": [{"body": "'Working together' meaning ' I need you to supply me these parts for my product that competes against your product'. Competitors don't need to work together, but if the price is right for them both, they will cooperate.", "score": 1, "replies": []}]}, {"body": "Tesla buys the VAST majority of their batteries from Panasonic, LG & CATL.   None of them sell cars.  \n\nMy guess is that the reason they are buying from BYD is that they are selling them cheaper.  If that’s the case then this is extremely short sighted.", "score": -1, "replies": []}]}]}]}]}]}, {"body": "Yeah, this is odd", "score": 1, "replies": [{"body": "It actually makes more sense. They both focus on what they’re marginally better specialized to make, so that both companies are better off than the rest of the industry. It’s like the top two participants in a tournament training with each other, because they both make each other better. And really, they’re both first competing against ICE which the faster they destroy, the faster they can both grow before truly competing with each other. It’s like saying for an Olympic category that team USA shouldn’t train together since they’re technically competing. If the benefits of training together allows team USA to fill all medal slots, and not doing so means team USA only wins gold but by a slightly bigger margin, then the former is preferable. \n\nWhat Tesla sacrifices in vertical integration to the revenue benefit of a competitor, it gains in further crushing the rest of the competition. Tesla makes a little more money in the short term by not having to set up their own facilitates which they can put into production or pass to consumers, BYD gets a facility and some revenue for long term benefit, and the competition loses. To bring this back to the olympics analogy, maybe crushing defeat drives potential athletes to join team USA, the prestige of winning so handily gives more lucrative ad deals and more funding to keep winning.", "score": 2, "replies": [{"body": "BYD sells millions of cars and is hurting Tesla in China and is beginning to export to 49 other countries this year. \n\nThey make 20 different models, sell power walls and sell several commercial vehicles too.  They are just  now releasing higher end vehicles and have already way ahead of Tesla on the cheaper, smaller EVs.  \n\nFor those reasons, I think it is a mistake.  Why help your biggest competitor to save a few bucks?  It’s short sighted imo.", "score": 0, "replies": [{"body": "Because not doing this would mean Tesla selling less cars because they wouldn’t be doing this if they had the battery capacity themselves. And the more cars that the both of them can sell now, the faster they put ICE down, which makes more room for both of them. Nearly every EV produced has a buyer as people switch from ICE so the boost in BYD will come at the cost of ICE, while Tesla also gets a boost. \n\nAlso BYD is suffering in China because the Chinese car market in general is suffering, with the exception of Tesla which has been doing relatively much better than BYD in China. Tesla’s profits are also much higher, and it’s not like BYD would be received particularly well in the US either. Those are glass ceilings and medium to long term issues for BYD that they will have a much harder time breaking through, which dwarf such a relatively minor and short term boost. \n\nAnd in the long term it’s not like Tesla can sell 80% of cars globally forever, there will always be brand saturation and competitors that can keep up. And doing this now in the grand scheme the sheer volume of cars to be produced in the long term might as well be insignificant. Especially since gigafactory Mexico is planned to be an extremely large and high volume production center for the economy model, which is planned to be opened and in production in 12-15 months.", "score": 6, "replies": [{"body": "I don’t agree.  \n\nThey have plenty of options for batteries.  They are first in line with all 3 major battery manufacturers and are making some of their own. \n\nI think this is probably just a cost thing which is important short term but certainly not long term. BYD is the only manufacturer that is taking market share from them in virtually every market except for the U.S. They are planning on exporting to almost 50 new countries this year and have built a fleet of 6 cargo ships for that purpose.  \n\nNot only that, they are years ahead of Tesla in lower cost vehicles and sell 20 models today and have just begun  introducing  higher end vehicles.  Tesla needs to continue to grow deliveries 25-50% a year and that isn’t going to happen without more lower cost models.  \n\nI really don’t understand why so many on this sub hand-wave away BYD.", "score": 1, "replies": [{"body": "You assume that battery capacity is easy to come by.", "score": 5, "replies": [{"body": "There is no shortage today \n\n“Is an EV Battery Shortage Possible?\n\nIt’s a complicated question. While an EV battery shortage is possible, a material shortage in the immediate future is unlikely. According to Bloomberg’s 2022 Electric Vehicle Outlook, the world’s lithium reserves should keep up with the current production rate through the middle of the century. “\n\nEdit:\n\nhttps://blog.carvana.com/2022/12/ev-batteries-can-we-produce-enough-ev-battery-recycling-production/", "score": 1, "replies": [{"body": "Material isn't cell capacity.", "score": 1, "replies": [{"body": "Wrong definition of material.  \n\nMaterial in this sentence isn’t referring to raw materials to make batteries it means there isn’t a shortage of battery cells.", "score": 1, "replies": [{"body": "And capacity isn't generalized to the global market. \n\nNot all companies have an equal amount of excess capacity. \n\nTesla wants battery cells today. Unless you're Ford and willing to wait until 2026.", "score": 2, "replies": [{"body": "Tesla has the best access by far, no reason to buy from BYD unless it is the price.  Again, very short sighted imo given where BYD is headed.", "score": 1, "replies": [{"body": "Tesla does have access to batteries. LG and Panasonic are likely going to supply 4680s. Guess what, they don't have the capacity yet. Still building it out.\n\nAll 2170 capacity is going into model Ys and performance 3s, there's no excess for M3LR. that's why they cut it. \nNow they've ramped model Y beyond the 2170 supply, they need a new source, and it's BYD. \n\nBYD clearly has capacity right now.\n\nThey also had to go with CATL LFP for the standard range because of the shortage with 2170s.\n\n\nLG is building out Ochang plant 1 2170 battery line and it won't be ready until 2H 2024.\n\nYou think Tesla can wait until next year?", "score": 1, "replies": [{"body": "Yes, I think Tesla can get the batteries they need without buying them from their biggest competitor.", "score": 1, "replies": [{"body": "I think Tesla needs to buy batteries from BYD or they will not meet their production goals this year.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "They will do the same without Tesla as a customer.\n\nAt least Tesla can continue growth with their batteries.", "score": 2, "replies": []}, {"body": "Seems pretty normal in the business world.", "score": 1, "replies": []}]}]}]}, {"body": "BYD also supply to Toyota, batteries, electric motors etc.", "score": 1, "replies": []}, {"body": "BYD isn't going anywhere. They're going to do just fine with or without Tesla as a customer.\n\nRather Tesla buy those batteries than Ford or GM.", "score": 1, "replies": []}, {"body": "As exciting as the thought of the competition dying ultimately I believe the success of Tesla is dependent on them playing their A game and innovating faster than their competition. So if getting these batteries is better for Tesla now, then let them go ahead and do so.", "score": 1, "replies": []}, {"body": "The margins from battery production vs Tesla's margin form vehicle sale is quite a bit less I believe", "score": 1, "replies": []}]}, {"body": "Did something change for battery strategy at Tesla?\n\nWhy are they buying batteries from BYD for cars and CATL for the mega pack?\n\nI always assumed that Tesla was not battery constrained and had the leg up on the competition as far as battery supply is concerned.  I would appreciate some insight on this subject.", "score": 4, "replies": [{"body": "Tesla has always said that they would take batteries that work economically from everywhere. They also said last year that they weren't battery constrained in 2022, but expected to be cell constrained again in 2023-24. So this makes sense, especially when considering the delays and underperformance of the 4680 ramp.\n\nBYD and CATL cells go where they're best suited. CATL LFP cells are also used in the china-made standard-range vehicles. Tesla would put domestic cells into the Megapack if they could, but there's very little USA manufacturing capacity for LFP (for now). \n\n> had the leg up on the competition as far as battery supply is concerned.\n\nThe leg up isn't just technological, it's also supply chain. Qualifying and procuring cells from multiple suppliers and securing production growth into the future is one of Tesla's advantages. Tesla's agility makes it possible for them to engineer for multiple different cell types from different OEMs, which is something legacy struggles with.", "score": 1, "replies": []}]}, {"body": "Weren’t 4680’s meant to be in production from Berlin this year? Why BYD now?", "score": 7, "replies": [{"body": "These are LFP cells, 4680 is (at least to start) meant for NMC cells.\n\nAlso, Tesla is focusing on 4680 production in Texas first, in large part because of the IRA. There's no such incentive to start production early in Europe.\n\nThey will do it at some point. Just don't expect 4680s to go to the standard range vehicles.", "score": 8, "replies": [{"body": ">Tesla is focusing on 4680 production in Texas first, in large part because of the IRA. There's no such incentive to start production early in Europe\n\nAlso because 4680s have been harder to develop and slower to ramp than Tesla expected.", "score": 6, "replies": [{"body": "This. I know Elon tried to spin it positively when Tesla gave up on the 1.1 bln Euro battery subsidy in 2021, but it’s far more likely that they just weren’t ready. \n\nhttps://www.teslarati.com/tesla-4680-battery-plant-giga-berlin-no-subsidies/amp/", "score": 2, "replies": []}]}]}, {"body": "US offered huge subsidies, Germany kept sueing tesla. So the US gets the first 4680 plant", "score": 3, "replies": [{"body": "Tesla was approved for 1.1 billion euros in battery subsidies, but they withdrew their application (likely since their tech wasn’t ready at the time).", "score": 5, "replies": [{"body": "Those had a clause that would require the Berlin battery factory to be the first to produce 4680's. With how slow permitting is in Germany compared to China or the US, that would cause a lot of delays.", "score": 1, "replies": [{"body": "No that wasn't the case. There probably were some other things attached to the money but there definitely wasn't a clause for some technology to produced first in Germany.", "score": 2, "replies": [{"body": "https://electrek.co/2021/11/26/tesla-withdraws-application-1b-subsidies-german-factory-musk-implies-dont-want-it/", "score": 0, "replies": [{"body": "Is there any concrete proof in your link that back your claim? Cause I didn’t see any.", "score": 1, "replies": [{"body": "Check the financial times source they quote.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Why would anyone want 4680s?\n\n\nThey offer no known advantages", "score": -4, "replies": [{"body": "They enable structural battery packs which enables frontal casting and weight savings.  \nWeight savings enable longer range and better handling (less mass when turning).", "score": 5, "replies": [{"body": "The castings are heavier...", "score": 1, "replies": [{"body": "He answered your question by giving you a known advantage - they can be used to create structural battery packs. And structural battery packs unlock downstream manufacturing and design choices that align with Tesla's objectives.\n\nAnd anyway, from an engineering or business perspective an advantage is simply a difference that you are able to attach some value to.\n\nSo furthermore, other differences might include:\n - they are individually bigger in all dimensions, with a bigger volume and mass\n - you need less of them for a comparable pack of smaller cells\n - their packing pattern will have different characteristics (could effect things like cooling)\n - a million other ways you could compare and contrast\n\nAnd these differences could lead to advantages such as:\n - you have fewer units to fail per pack, reducing pack failure rates\n - larger cells might be easier to handle by robots, reducing manufacturing costs \n\nYada yada.  I expect a knowledgeable engineer could write a whole paper on the differences with the cells, and how these could theoretically deliver commercial and engineering advantages to Tesla.  Of course none of those potential advantages might be realised, but Tesla clearly thinks so.", "score": 1, "replies": [{"body": "To the consumer, absolutely none of this matters though\n\nThat was my point.  If the costs are identical, there is no advantage to the user", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Tesla 4680s moved to US for the government incentives.\n\n\nMaking 4680s outside the US is leaving money on the table.", "score": 1, "replies": []}]}, {"body": "Good", "score": 4, "replies": []}, {"body": "once again German pseudo environmentalists/regulators shooting themselves in the foot, could have at least started 4680s by now if they hadn't rolled out all the red tape", "score": -1, "replies": [{"body": "Not just regulators, Tesla still needs to finalize development of the dry electrode manufacturing process.  I guess anode is done, but cathode still has work required.  \n\nThat said I guess Tesla is prepared to move forward with a dry/wet process I’m Austin, so maybe they would’ve started production by now.", "score": 3, "replies": []}]}]}
{"title": "How to play tonight's AAPL Earnings safely", "selftext": "Apple (AAPL), the king of the stock market, reports earnings is scheduled to report fiscal second-quarter results after close today. Apple stock has not disappointed this year and the sturdiness of Apple’s returns simply cannot be understated. The stock is up 30% YTD, 300% over the last five years, and **1100% over the last 10 years**. It isn’t flawless though, as it was down -30% during 2022. However, it has nearly earned it all back in the first four months of 2023. \n\nAs the world’s leading consumer products and technology company, Apple’s earnings act as an important forerunner for the broader economy. What should we expect from Tim Apple? \n\nHere’s what analysts think:\n\n* Earnings: $1.43 per share, according to [Refinitiv](https://www.refinitiv.com/)\n\n* Revenue: $92.96 billion, according to Refinitiv\n\nRevenue is expected to *decrease* 4.4% from $97.28 billion in the same quarter a year ago. This isn’t great, but also not terrible. Something I don’t often see mentioned about Apple is the strong seasonal tendencies of its revenues. [Take note of this chart.](https://i.imgur.com/3JGDWtt.png). In the quarterly revenues, we see revenues regularly explode higher following the holiday season and are then mostly stagnant through the rest of the year. But Q1 2023 sales were below Q1 2022, which shows that there was a YoY slowdown in the most recent holiday season.\n\nApple prepared investors for a down quarter in January. The company hasn’t provided formal guidance since 2020, but it gives analysts and investors a number of data points that can be used to roughly estimate its performance.\n\nThe information it provided earlier this year suggested that sales would drop for a second straight quarter by roughly 5%. Sales of iPads and Macs are expected to see sharp decreases — 12% and 25.4%, respectively — and iPhone sales also likely dropped. Analysts polled by [FactSet](https://www.factset.com/) expect annual declines in all of Apple’s hardware product lines.\n\nThe report comes as the PC and smartphone markets are mired in one of the worst slumps in recent years. Electronics sales are down sharply after many consumers bought new PCs and phones during the pandemic and others are tightening their belts because of high inflation or recession worries.\n\nIn the first quarter, PC shipments decreased 29%, [according to IDC](https://siliconangle.com/2023/04/10/idc-worldwide-pc-shipments-fell-29-first-quarter/), while smartphone shipments were off 14%.\n\nApple’s report wraps up earnings season for tech’s mega-cap companies, after Alphabet, Amazon, Meta and Microsoft all issued results last week. All four topped analyst estimates, though growth rates were still muted compared to prior years.\n\nWhile Apple isn’t immune to the broader market slowdown, some analysts hope it will show strength and resiliency because it sells premium products and has loyal customers. Refinitiv consensus estimates suggest Apple could guide back to growth. They expect 2% expansion in the third quarter. But others are concerned that revenue will keep falling, suggesting that demand for Apple’s products is eroding.\n\nDoes anyone know Samik Chatterjee, the analyst at JPMorgan? He mentioned in a note this week that the \"eventual outcome might be simply driven by F3Q guidance, where investors might be looking for assurance and visibility into limited downside despite a tough macro.” See, if Apple’s outlook suggests a year-over-year decline that’s less than 5%, Apple could still “triumph” on fundamentals, at least according to Chatterjee.\n\nAlong with earnings, Apple is also likely to update investors on its [capital return authorization](https://fortune.com/2023/04/17/how-much-will-apple-spend-on-stock-buybacks-earnings-90-billion/). Analysts expect the iPhone maker to announce plans to spend as much as $90 billion on share repurchases and dividends.\n\n**What about the Technicals?**\n\nThere isn’t a clean chart pattern to trade AAPL from, [but this large range looks significant](https://i.imgur.com/xcIhkg0.png). The $180 level is resistance and $130 support. Right now, price is in no-mans land in the middle of this large range.\n\nIf price can clear the $180 level, resistance should turn into support, and the next multi-year leg higher in Apple should commence. However, a rejection at $180 would be very significant. If the stock can’t clear that level, it may be indicative of not just Apple, but the market more broadly.\n\nWith a recession likely coming later this year, it is possible we will see Apple retest the high of the range, and then as the recession takes hold, swing back down to the bottom of the range. Rather than trying to short the stock, investors would be better off waiting for price to come back down to the $130-$140 buy zone.\n\n**Valuation??**\n\nThe price of Apple is currently 28 times its one-year forward profits, which is higher than both the market average and its five-year median price of 24 times. Despite being one of the most respected companies in the world, this valuation is neither particularly high nor low. The bears don't have a good time with this fair assessment.\n\n**What to do for Earnings?**\n\nApple is a juggernaut in the stock market, and its supremacy is undeniable. Apple brought luxury to the masses, so if the average person begins to feel the heat of a slowing economy, they probably won’t be buying a new iPhone. Does this mean puts for earnings? We know the stock moves on average 5 ± 3% with earnings. However last quarter, it moved +7%, the one before it was +9% and the one before it was +6%. Wait, so calls? I'm thinking a strangle. I'm going to bet that while it moves on average 5%, it's going to move more, without attempting to predict whether it's going up or down. So I'll be buying AAPL 5/5 160p (at 138 bucks) and 170c (at 150 bucks). This means you can get the strangle for $288. The stock would have to move 4.6% up or 5.1% down to break even. Mind you, this post is not financial or investment advice - consider it as just me offering some education based on what analysts tend to look for in a company when it's time to make a last minute earnings prediction. In fact, just because I'm posting it, AAPL might just stay flat.", "id": "137wdc6", "created_utc": 1683226529.0, "score": 70, "upvote_ratio": 0.81, "num_comments": 70, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|3 weeks ago\n**Total Comments**|139|**Previous Best DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/12zph3r/your_lotto_play_for_metas_earnings_tonight/) [x](https://www.reddit.com/r/wallstreetbets/comments/135v8qm/your_lotto_play_for_amds_earnings_tonight/) [x](https://www.reddit.com/r/wallstreetbets/comments/12ytt9u/why_im_getting_msft_calls_for_earnings/) [x](https://www.reddit.com/r/wallstreetbets/comments/136t8is/your_lotto_play_for_etsys_earnings_tonight/) [x](https://www.reddit.com/r/wallstreetbets/comments/134yxka/what_to_do_for_pfizers_earnings_tomorrow_morning/) [x](https://www.reddit.com/r/wallstreetbets/comments/12juh8u/can_delta_or_united_airlines_stock_takeoff/) [x](https://www.reddit.com/r/wallstreetbets/comments/135xouh/this_is_why_im_getting_sbux_calls_for_tonights/) [x](https://www.reddit.com/r/wallstreetbets/comments/12qxya3/what_to_do_for_netflix_earnings_tonight/) \n**Account Age**|3 weeks|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\nHey /u/CalmGains, **positions or ban.** Reply to this with a screenshot of your entry/exit.\n>TL;DR: No one knows what's going to happen, I bought a strangle", "score": 1, "replies": []}, {"body": ">I do not know what you are talking about.", "score": 123, "replies": [{"body": "Me neither", "score": 14, "replies": []}, {"body": "Saved me time. I was going to read it otherwise 😄", "score": 9, "replies": [{"body": "Yep. Scrolled to find vizmod tldr lol. \n\nAnyways we know what happened to the last guy that wrote memoirs of a ticker so we can inverse this and profit. Easy", "score": 6, "replies": []}]}, {"body": "😂😂😂", "score": 0, "replies": []}]}, {"body": "I’m gonna sit back, crack open a brewski and enjoy the loss/gain porn!", "score": 32, "replies": []}, {"body": "Nah bro. I got $150 puts that expire Friday. The squirrel that lives outside of my garage got lost under my shelves, and when he made it out I found an apple in our small entryway pond. It was rotten and slowly sinking. All the sign I need!\n\nEdit: EPS (before buybacks) = Negative yoy, revenue: FLAT. Once analysts realize that Apple is just using their massive buybacks as a way of hiding their sliding earnings per share the Squirrrel will have his revenge.", "score": 64, "replies": [{"body": "Most reasonable WSB DD.", "score": 24, "replies": [{"body": "Always trust the Squirrel.", "score": 5, "replies": [{"body": "Legend has it that he served squirrel for dinner that very night and now spends his days looking for a new stock picking rodent.", "score": 3, "replies": [{"body": "Not even close. The squirrel is never wrong. Once the buybacks end for the evening Apple will crater once analysts do the math on their current trajectory for 2023, factor in Chinese shrinking economy, Cloud Market, and the cratering PC sales.", "score": 2, "replies": []}]}]}]}, {"body": "Super. $175c it is", "score": 7, "replies": [{"body": "You might out-regard me and my squirrel with that bet.", "score": 1, "replies": []}, {"body": "I got 20 I’ll sell you for tree fiddy a pop, out to the second week of June.", "score": 1, "replies": [{"body": "I suggest you do what I do.  Sell tomorrow for profit and rebuy next dip.", "score": 1, "replies": [{"body": "I made 45k doing that a couple months ago. But in the last month I lost 15k doing that. ¯\\_(ツ)_/¯", "score": 1, "replies": []}]}]}]}, {"body": "Your reasoning might be better than mine about down Mac sales and China", "score": 2, "replies": []}]}, {"body": "Imagine thinking anyone here is going to read this shit.", "score": 23, "replies": [{"body": "Fuck these shitposts I’m just here for the comments", "score": 3, "replies": []}]}, {"body": "Play ER safely 😂 go on.. don't forget to say hello to IV for me.", "score": 8, "replies": [{"body": "The trick is to always buy dailies that are so far OTM tha the IV isn't even a problem; the problem is that you literally need a proof positive miracle to end up ITM. #jezustakethewheel", "score": 3, "replies": []}]}, {"body": "Buybacks > Bad earnings 🚀🚀", "score": 16, "replies": [{"body": "They announced the buybacks already, so not great earnings are expected", "score": 6, "replies": []}]}, {"body": "Strangles in Shambles", "score": 8, "replies": [{"body": "I just sold the 170c for $375 to bag 30% profits on the strangle.", "score": 1, "replies": []}]}, {"body": "As long as people can keep upgrading their iphones ever 2 years, they need to stop bitching about inflation and how hard life is now", "score": 14, "replies": [{"body": "You ain't lying.", "score": 4, "replies": []}, {"body": "Pretty sure those upgrades are subsidized by carriers again which are in deep shit. Counterpoint to GOOGL which is just as strong as ever, AAPL shrugged their shoulders about forward guidance last two quarters and market rewarded them.", "score": 1, "replies": []}]}, {"body": "Safe what? Where is my lotto play?!", "score": 5, "replies": []}, {"body": "Bearish !!! They are buying back stock bc of bad earnings !", "score": 5, "replies": [{"body": "Few hours later…", "score": 2, "replies": []}]}, {"body": "Inverse WSB, im buying calls![img](emote|t5_2th52|27189)", "score": 6, "replies": [{"body": ">how is that inverse - WSB is 'i dunno' buy both Call and Puts", "score": 7, "replies": []}]}, {"body": "As you write the negative expectations are there and probably already priced in. I therefore do not expect any significant change in stock price at first. But in the mid to long term these figures have the ability to turn market sentiment, because with a company so large and premium they give the best estimate of the purchasing strength of the consumer right now. So watch for the indices, I expect the real reaction to be there.", "score": 3, "replies": []}, {"body": "To long didn’t read gunna go throw my entire life savings into a out of the money call that expires tomorrow nerd", "score": 3, "replies": []}, {"body": "Aged like fine milk", "score": 3, "replies": []}, {"body": "$180 by Friday 🍌🚀", "score": 4, "replies": [{"body": "Fuck yea![img](emote|t5_2th52|27421)", "score": 4, "replies": [{"body": "Can I get a hoyeahhhhhh", "score": 3, "replies": []}]}, {"body": "My calls are hoping for this lol", "score": 3, "replies": []}]}, {"body": "Boooo we want AMC yolo’s", "score": 4, "replies": []}, {"body": "AAPL bought JPM in cash", "score": 2, "replies": []}, {"body": "Bro literally I already did my DD yesterday, should’ve just listened", "score": 2, "replies": [{"body": "This right here is the problem. You have no knowledge to be doing any 'DD'.\n\nTreating reading a bunch of stupid posts on wallstreetbets as 'DD' is exactly how you lost your house.", "score": 3, "replies": [{"body": "Dude was incredibly cocky in his posts just a month or two ago", "score": 1, "replies": []}]}]}, {"body": "I’m the guy who played it unsafely and didn’t sell due to limits not hitting this morning. Hope Tim apple says a bad word on forward guidance", "score": 2, "replies": []}, {"body": "Sell calls, got it", "score": 2, "replies": []}, {"body": "So in reality though AAPL beat both the earnings and revenue forecasts. I expect it’ll open with a green gap, dip down to teabag the bears, maybe twice over like an hour or two, then go back up and close about where it opened.", "score": 2, "replies": []}, {"body": "I dont really understand.\n\nFuck me im all in![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)", "score": 3, "replies": []}, {"body": "25put contracts for tomorrow! Let’s go!!", "score": 3, "replies": []}, {"body": "150 by Friday!", "score": 1, "replies": []}, {"body": "I still dont understand why anyone would buy their products", "score": 1, "replies": [{"body": "Quality is umatched imo, specifically with the mac book pro", "score": 2, "replies": []}]}, {"body": "Weren't they opening stores in India? Bullish", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)", "score": 1, "replies": []}]}, {"body": "So, what im getting is Calls on BBBY out of this fucking wall of words.", "score": 0, "replies": []}, {"body": "Haha , awesome shit show. This strangle lost money on both call and put side. IV crush and theta gang wins again", "score": 0, "replies": []}, {"body": "Aren't macs terrible for AI? puts.", "score": -1, "replies": [{"body": "you have no idea about AI! zilch! ![gif](emote|free_emotes_pack|rage)", "score": 1, "replies": [{"body": "basically all other tech companies but Apple are working on AI. their components are trash at it. They have a lot of catching up to competition.", "score": 1, "replies": []}]}]}, {"body": "Fewer contracts with ATM or ITM contracts", "score": 1, "replies": []}, {"body": "Apparently Tim Apple has said the magic word: AI. Now up 2%.", "score": 1, "replies": []}, {"body": "Thank you for buying some of my puts I sold this week 😂", "score": 1, "replies": []}, {"body": "\"Safely\" ...Avoid individual stocks. This is a casino", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "“I have a system”", "score": 1, "replies": []}]}, {"body": "Nice dd.", "score": 1, "replies": []}, {"body": "such OTM strangles in inflated IV environment just gives MM more free money. If you’re so sure the IV is underpriced, e.g. you expect a 10% move while market is pricing 5% that makes more sense. Otherwise, pick a direction and roll the dice", "score": 1, "replies": []}]}
