{"title": "Is investing always scary?", "selftext": "I’ve been investing with my own stock picking / research etc since mid 2021. Before that I had my money in ETFs through the bank that I left alone to do their thing. \n\nIt seems like since the minute I started paying attention to the market that there’s constant talk of a market crash everywhere you turn. \n\nFor those who have been doing this for decades, is that just part of the deal? That you live in constant fear of a crash and you never feel like your money is safe?\n\nOr are we just in volatile times where it might be better to sit things out for a while? Will the market ever get to a nice stable state, or is it just in fact the big casino everyone talks about?", "id": "13st3o8", "created_utc": 1685147035.0, "score": 40, "upvote_ratio": 0.82, "num_comments": 69, "comments": [{"body": "Yes.", "score": 92, "replies": [{"body": "There’s literally a bear in every corner of the market.", "score": 11, "replies": []}]}, {"body": "You are better off just investing in indexes and forget it. Less stressful and better results most likely", "score": 61, "replies": [{"body": "This is a stock picking sub at the end of the day, so I think it’s important to recognize that people still want to do this and want to discuss it. And some will make good money as a retail investor at small volumes.\n\nHowever, it’s definitely important for any newbie to at least understand what index funds are and what the risk-to-reward for each before jumping in. \n\nI wouldn’t recommend stock picking to any of my family or friends.", "score": 33, "replies": []}, {"body": "It’s really not hard to pick some large cap value/growth stocks that will outpace the index’s. The vague and general “slap it in a index and call it good” isn’t always the top tier choice especially if they’re young.\n\nIf he does his research and due diligence, he could come up with a great ETF portfolio and even cherry pick some stocks that could outperform. \n\n\nAlso, OP, yes. Fear and mania are constant emotions the media is trying to feed you 24/7. It grabs headlines.", "score": 6, "replies": [{"body": "I only invest in things that makes sense that will prob not go away in my life time. Apple, Amazon , big banks, military companies, huge box chains like target Walmart, Kroger and other giant food chains like McDonald’s, coca-cola Pepsi. Stick to stuff like that and most will be good.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 27, "replies": [{"body": "Even the lost decades lose their sting when they’re followed by an epic bull market. My father has been investing since the late 60s, and he fears nothing.", "score": 14, "replies": []}, {"body": "It depends how you look at it. In many ways there’s actually a healthy amount of additional fear over time at the individual level because as your wealth grows, your time in this planet dwindles, and so your risk tolerance naturally should shift to accommodate for that. Hence people moving towards bond funds near retirement, for example.\n\nBut yeah for a complete newbie, there’s a lot to just getting in early and riding through a cycle. It’s a wild feeling and even though you logically know it will happen again, the brain has an uncanny way of making you think “well, what if it’s different this time…? Maybe it is…”", "score": 5, "replies": []}]}, {"body": "It only gets worse as your portfolio grows. I'm at a point where a 1% move is equivalent to 2 weeks of pay. I have to say, going through the experience of the covid crash and being exposed to everything that the covid crash hit helped me understand the volatility of the market.\n\nI put my bonus at the time in Jan 2020, at the time, was equivalent to double my portfolio, into banks, energy and airlines. Covid hit, and those holdings went down 50-75% over 1-3 weeks. I remember being at work and getting notifications of circuit breakers being hit. Over the course of that year I DCA'ed into banks and energy, but held onto my airlines until the end of 2020 before selling them off (when I looked further into the business, they are a terrible business to hold). By the end of 2020, I had a solid cost basis on my bank and energies which kept my portfolio afloat all of last year.", "score": 8, "replies": [{"body": "How old are you?", "score": 2, "replies": [{"body": "28. I started my portfolio late 2018. So I wouldn't say \"I have decades\" worth of experience, but I was fortunate enough to save a good amount of my income throughout the past few years after moving back home from covid. I would consider myself an outlier when it comes to my net worth compared to the average in my age. Going through the covid crash definitely taught me a lot about my own risk tolerance though.", "score": 1, "replies": []}]}]}, {"body": "Investing in individual stocks is.\n\nInvesting in the VT, or VTI is different. If that ship goes down, then everyone is feeling the pain. Not just you.  You can win big or lose big on an individual stock", "score": 16, "replies": []}, {"body": "It's not \"scary\". If you view it that way, you shouldn't be stock picking imo.\n\nIt's a thrill. It's similar to betting, but it's way more classy because you can do so much with it and everyone has their different strategies. It's a hobby. To be a trader is to live and breathe the market.\n\nNo your money is never fully safe, but if you are smart, you can mitigate the losses and maximize the gains. That's what its all about.", "score": 6, "replies": []}, {"body": "Fear always exists, unless it doesn't. Just keep investing and don't worry. Long-term, the market is always up.\n\nRemember the age old saying, time in the market beats timing the market.", "score": 10, "replies": [{"body": "I believe, based off of empirical data, that the market goes up a majority of the time IF viewed over the long term! You’re right on the money — don’t time the market, simply be in the market and stay the course!", "score": 3, "replies": [{"body": "Which market are you looking at - it’s important to keep in mind how much of an infant the US is. There is no such thing as reward without risk. Even if the risk is small, it still exists. We saw a capitalist Japanese market suffer catastrophe not too long ago, and there was no quick recovery. \n\nI’m invested broadly in US holdings as well. So I agree with the advice. Just want to point out that there’s no such thing as a sure thing. This is not physics.", "score": 3, "replies": [{"body": "S&P 500, in the US market, is the gold standard in my view, I've been investing in it since 2006 and, yes, have created significant wealth because of it. \n\nYou are correct that there are inherent risks to the market, and for that matter, US treasuries (which are widely considered to be the safest investment on planet earth). \n\nYour comparison of the US capitalistic society to that of Japan, however, are very misinformed for a number of reasons, the least of which, are the size of the economics, the currencies that back the countries and the companies that make up the countries, again, amongst other reasons that the countries aren't even in the same breath. \n\nLastly, as it relates to a \"sure thing\", the S&P 500, virtually, is a sure thing, over the course of time, due to: employee productivity, technology advancements, inherent efficiencies in the S&P as it relates to their market cap weighting with all companies in the index fund, government spending, population growth (not only in the USA but across the world), dividend reinvestment, share repurchases, money printing, QE, etc...Are there bumps along the way in the index? ABSOLUTELY. Is the index highly likely to be higher 5/10/15 years from now? ABSOLUTELY. \n\nI would also add, given the rates on the short end of the curve, investors with cash laying around absolutely should be taking advantage of 1 month Treasury Bills! \n\nIn summation: I agree with your general theme, in that, there are no \"sure things\". Secondarily, I would argue that while there are no \"sure things\" the S&P 500 going up and creating long term wealth is, virtually, a \"sure thing\" and, lastly, US T-bills are an attractive short-term area to park money to collect a little extra monthly cash flow!", "score": 1, "replies": []}]}]}]}, {"body": "Take comfort in the swings. Warren Buffet once wrote something to the effect of investing is like buying into a company and then having a partner prone to wild mood swings who reliably comes to your office every day offering to buy you out.", "score": 5, "replies": []}, {"body": "75% of the time since 1926, the markets have had positive years.\n\nSo 1 in 4 years will be bad on average.\n\nEvery once in awhile 4 in 4 years will be bad for awhile.\n\nIn fact, from 2000-2010 if you were invested, you didnt earn a single penny.\n\nJust buy and hold, and buy more, and hold.\n\nBuild a diversified portfolio, not a collection of moon flyer meme stocks that dont make any money.", "score": 9, "replies": []}, {"body": "Only upon first entry. An then you lose money, but don’t sell, and a year or two goes by and now you are deep into profit because you held. At this point you won’t worry about market conditions as much because even if you lose money, you are losing profit, not principal anymore. And if it sinks, you just buy more. Never sell. So yeah, after a certain tipping point it gets easier. I would argue that you should make a conscious effort to stop looking at the money your brokerage as “money”. Instead, start seeing it as units. Units of value. You move some units here, and they grow into more units…etc. looking at it that way can help disassociate the emotion attached to “dollars”.", "score": 7, "replies": []}, {"body": "the thing to remember is that you are the one who consumes things.  you are the one who buys cloths (nike, under armor, etc), you are the one who buys food (tyson foods, etc), you are the one who drives (oil and gas companies, car makers, etc).  you are the one who buys smart phone and buys data plan for it (apple, samsung, att, verizon, etc).\n\nstock market is all about you.  if you are confident, then don't worry about it. \n\nif you are living paycheck to paycheck, then you need to get out of individual stocks.  you can not afford to choose wrong one.", "score": 4, "replies": []}, {"body": "For some people, they've been investing long enough, and wise enough, that they've seen their portfolio double several times. So, even if there was a massive crash, it would only bring them back near their original portfolio amount. \n\nWhat I mean is, let's say there's some guy that had a 200k portfolio. This guy doubles this portfolio to 400k. Then he doubles it again to 800k. Now, mind you... this takes many years. But now, the guy has this 800k account. If the market has the mother of all crashes and his portfolio takes a massive hit, he's probably back to his original 200k.\n\nWhen you're new to the stock game, you're not playing with any of the houses money, so it seems WAY more dangerous. Because when you lose 10k, you really lost 10k. But if you're up huge, and you lose 10k, you think of it as your profit got shaved a little bit.", "score": 3, "replies": []}, {"body": "The s&p has an average return between 8-10% depending on how far you go back. But its only been between 7-10 like 4 times in the lasr century .  1 standard deviation is historically over 20% from the mean both ways.\n\nIndividual stocks are much more volatile.", "score": 2, "replies": []}, {"body": "I pretty much puked or cried once a day when I first started. You'll get the stomach for it if you hang in there long enough", "score": 2, "replies": []}, {"body": "People are blah-blah-blah, but basically, you could lose everything, but only if you put everything in. On the other hand, this is a really safe and decent way at increasing wealth. So do with it what you will. If you put in everything, there's a chance to be rich, but doing such an investment leaves you many folds likely to lose it all. The most basic increase on your savings thus far as known is index ETFs. Many think individual stock investments are better now.\n\nI would look into the pog revital. Collectible assets smoke the stoke market, but take work.\n\nGoodluck!!!", "score": 2, "replies": []}, {"body": "Market will always shake the weak holders.", "score": 2, "replies": []}, {"body": "Small time investor here. In 8 months I went from being down 30 grand (which was stressful) to being up 10k this week because I sold my losers along the way and reinvested and lucked out with some AI related companies", "score": 2, "replies": []}, {"body": "Bad news sells. Everything you hear is negative right now but it’s up to you how you take that. The truth is it’s not really that scary or stressful and stay in your lane and do your thing and don’t buy into everything that’s being pushed", "score": 2, "replies": []}, {"body": "I’ve been dabbling for a couple years. I don’t really have time to research everything and stock pick. Even if I did I think it’d always have doubts as to what I was doing and then there’s always the possibility that the market does the opposite of whatever solid research you’ve come up with. It’s irrational after all. I have majority of my money in Roth’s (VOO/VGT split) but do have a play taxable account where I pick based on what I like. Sometimes it works. Sometimes it doesn’t.", "score": 2, "replies": []}, {"body": "If you live on Reddit all you will ever see are freaked out people. Outside Reddit, life goes on much more normally, people make strategies and implement in the short and long term based on their risk tolerance, some people make money and others lose it, that's how it is. Have fun :)", "score": 2, "replies": []}, {"body": "I mean it’s not always as scary as right now. You literally started stockpicking right at the beginning of a massive correction.\n\nThe other thing to watch out for, when things turn around, is irrational exuberance. “This time is different,” the economy is being reinvented, you can throw a dart blindfolded and hit a bullseye. You are a genius. How did you think this stuff was so complicated before? Maybe you should start a fund, take money from family. You are the next Michael Burry, and you’re on your way to your rightful throne of millions, or billions. This period is lots of fun, but no one knows when the music will end - and when it ends, unexpectedly and with abrupt violence - fortunes and sometimes lives will be lost.\n\nTake any wisdom of the crowds with a massive grain of salt. Take anything you’ve “learned” in your personal experience with a massive grain of salt. Swallow the red pill that is “I ultimately don’t know anything about what the fuck is going on,” and allocate your money accordingly.\n\nI’m not saying don’t take calculated risks. And you may decide you want to chance a bit of cash on a moonshot at some point. The big takeaway is to *accept your ignorance*, hedge your bets, and don’t delude yourself into thinking that you are or can “crack the code” and “figure it out” such that you will only make money. \n\nThat’s a fool’s errand, and it will work up until the point where it doesn’t. And you might find yourself back at square one or worse.\n\nPicking stocks can be educational and fulfilling, but please, please do a bit of reading on index funds  (history and present) and diversification. I really like the exposition in the “Bogleheads” book. You should at least understand the different types of investment risk, and weigh those against your goals.\n\nAnyway I’ve rambled… this is a scary time. There are lots of scary times. But don’t put too much stock into public sentiment. It’ll only hurt.", "score": 3, "replies": []}, {"body": "If investing is scary you should’ve buy your own stocks. Buy a low cost sp500 index", "score": 2, "replies": []}, {"body": "I’m used to it. Refer to the efficient market hypothesis and get rid of all gamblers fallacies from your thinking, it helps to keep you sane during the downturns.", "score": 1, "replies": []}, {"body": "Not if you buy what you know. Do some research and buy companies you understand. Pay attention to metrics such as p/e ratio which indicates if the share price is fair. Check balance sheet to avoid high debt, and look for profitable companies. At the end of the day you are paying for future earnings, like a money tree or a farm.", "score": 1, "replies": [{"body": "The risk of Dunning-Kruger effects are high with retail investors knowing just enough to be dangerous. The extent that someone can “know” what they are buying intimately enough to be certain is much slimmer than most realize.\n\nIf you’re going to pick stocks, it’s important to look at all of the things you mention and more. This can be a great way to build financial acumen and get a better intuition around market activity. But it’s not a science, and there’s no sure thing.", "score": 2, "replies": []}]}, {"body": "Once you’ve lost heaps it stops being scary", "score": 0, "replies": []}, {"body": "If it’s scary you probably have no clue what you’re doing", "score": -3, "replies": [{"body": "Similarly, if you're confident you probably have no idea what you're doing.", "score": 6, "replies": []}]}, {"body": "Make it simple.\n\nBuy VOO or SPY, reinvest the dividend, add every month or whenever you have expendable cash available.\n\nBuy and read the book by Jack Bogle: “the little book of common sense investing”.\n\nIt will put everything in perspective and give you comfort.", "score": 1, "replies": []}, {"body": "Price can fluctuate a lot. You get used to it. What gives you confidence to stay the course is understanding the underlying fundamentals of the business and their vision.\n\nYou have to learn how to value businesses and know when they are cheap or when they are expensive.", "score": 1, "replies": []}, {"body": "You need to detach yourself emotionally from your money which isnt easy to do. If you choose strong and profitable companys whos going concern is solid you can ignore the day to day volatility for the most part, although youll always have to pay some attention. The shitty downturns are often opportunities to buy and being attached to the dollar values and percentages are often what cause people to panic and take losses. \n\nI like to remind myself that my life isnt any different if my stocks go up or down, if i have a 100k investment that goes to 50k for awhile im still going to go to work, pay my bills, and do the things i enjoy. The value of your portfolio on a given day should not determine how happy you are or whether your day goes well or not.", "score": 1, "replies": []}, {"body": "If it’s not then it’s probably a top lol but also emotions like fear should be ignored.", "score": 1, "replies": []}, {"body": "No… you just need to have risk capital.", "score": 1, "replies": []}, {"body": "It’s better when you have a good reason to buy a stock based on fundamentals and not just gambling", "score": 1, "replies": []}, {"body": "Yes, sometimes terrifying.", "score": 1, "replies": []}, {"body": "Always keep a significant \"what if\" amount of money in your bank account so that if something happens and god forbid you lose all your investments.. you wont be flat out broke\n\nEdit: typo", "score": 1, "replies": []}, {"body": "Index fund are pretty low risk and are a good choice if you aren't doing your own technical analysis. They are efficient, diversified and provide a high return when compared to its overall risk profile.", "score": 1, "replies": []}, {"body": "There’s always danger lurking in the shadows. Just human nature to think and feel this way. Unfortunately in todays society with social media and click bait articles, it’s ramped up 100x in just about everything including the stock market. Just ignore and don’t check your portfolio every day if you can’t stomach it.", "score": 1, "replies": []}, {"body": "Yes, but also some people will tell you there's nothing to fear about.\n\nTruth is the market has been on it's biggest bull run ever, it's been like 20 years and every major crash has ended up being just a blip.\n\nThere's no way to know when another 2000s is gonna happen.", "score": 1, "replies": []}, {"body": "There's no money for talking heads in predicting a nice, boring time.", "score": 1, "replies": []}, {"body": "If you are emotionally attached to your money than yes. That’s why people dca", "score": 1, "replies": []}, {"body": "If you are not planning on holding your investments for many years you are not investing you are speculating. \n\nIf you are putting money into a wide variety of stocks and leaving them for a couple of decades there is almost no real risk. You are guaranteed to make money. Money compounds, but it takes time. \n\nTake warren buffet, he got to where he is because he has been steadily investing for 75 years. That's it, that's his big secret. \n\nIf you want to make money by the end of the month...well...yeah that's hella scary", "score": 1, "replies": []}, {"body": "Yes, you need strong willpower if you dont have that give your money to a financial expert", "score": 1, "replies": []}, {"body": "Capitalism is brutal and unforgiving.  It's also very rewarding to the successful enterprising individual.\n\nIt's like evolution and survival of the fittest.  The business that can sustainably generate profits, will continue.  The ones that burn cash will fall.  If you owned a small restaurant and guests just stopped coming, you'd be closing up shop.  But if you owned a piece of every restaurant in town, you'd probably be okay, as the consumer is going to probably still visit some restaurant somewhere.", "score": 1, "replies": []}, {"body": "It'll be volatile when you look at it and stable when you don't lol. Schrodinger's cat. If you want less of that stress in your life, the /r/bogleheads way is VTI and chill", "score": 1, "replies": []}, {"body": "It can be. I started investing in the things I use regularly. Phone service, electric, water, trash, food. These companies are the slow and steady income/dividend stocks. Once my essentials stocks were well positioned to pay all of my recurring bills with dividends, then I crept into other companies that are wonderful businesses with a good chance at a long healthy and profitable future.\n\nWhere I found investing interesting is using options to help augment returns.", "score": 1, "replies": []}, {"body": "Nah you detach yourself after a while and realize that ups and down are normal. I would only get concerned if I was swing trading or was nearing retirement age", "score": 1, "replies": []}, {"body": "Every time somebody on the internet types the word \"crash,\" the algo's push up the S&P 1%.", "score": 1, "replies": []}, {"body": "The only time it’s not scary is when everything is green and when that happens you should actually be in fear but greed will consume your mind. When you’re scared is actually the best time to invest usually because the market sentiment is fear. Investing In greed is not a smart idea", "score": 1, "replies": []}, {"body": "Change your mindset. Instead of the market being scary when there’s a downturn, think of it as a sale on good businesses.", "score": 1, "replies": []}, {"body": "57, investing since 1993 (30 years).\n\nIn short runs of 1,3,5 years..the market and your returns look irrational, crazy.\n\nIn Longer views 7, 10,15 years.. it smoothes out.\n\n1l pick a few index ETFs (sp500, Russell 2000) and sit on them.\n\n2) put very small amounts into your \"wile e coyote\" can't possibly fail ideas.\n\n3) sit and watch paint dry (aka, you have a plate full of crap you could be doing right now). A tree doesn't grow in 2 weeks.", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "I wouldn't say it's always scary, but there is always a degree of discomfort. And that's usually due to the uncertain nature of it. But as they say, scared money don't make money. Learn to accept that some of your investments will be losers, and some will be winners. Accept that there's gonna be variance - and learn to enjoy the ride and how to better manage the emotions that come with it.\n\nOnce you have enough successes under your belt that show you have a good track record, have a solid process, and develop the ability to better read the market, it gets a lot easier to deal with the emotions.", "score": 1, "replies": []}, {"body": "No. If you feel scared, you might want to reduce the amount of risk you're taking.", "score": 1, "replies": []}, {"body": "Depends on how your mind works. I buy a lot of recovery plays and when I first started, it was like hanging upside down and starring into an endless void because the stock is down a lot already and may keep dropping. \n\nImagine seeing a stock go down for 1-5 years and buying it. And you are convinced the market is absolutely wrong and you are right. And then you just sit on your ass and wait for your thesis to play. \n\nI’ve been getting outsized returns doing this. It helps to understand cyclical swings in specific sectors and play those. Or it helps to find merger arbitrage plays, litigation, significant fear, spin-offs where people don’t understand what is happening, or significant market misunderstanding. \n\nWhen it comes to swinging cyclicality, aside from understanding the company, it is always difficult to sell but look at retail investors, if they begin piling into a company, that’s usually the exit liquidity. Throw them the anchor and leave with your profits. Most retail investors seem to significantly underperform because they buy cyclicality when the company looks pristine and they sell when the company looks like trash. This is the opposite of what you should do. In that sense, to answer your question full circle, it is only scary if you don’t understand the company because you are buying them when their metrics look like shit and when they look expensive. But in reality this is when the company is cheap.", "score": 1, "replies": []}, {"body": "The last 80 years have been an anomaly in the history of world investment. Expect hard times ahead for the US and world economy with our 300+ percent debt to GDP ratios", "score": 1, "replies": []}]}
{"title": "Good time to move into Amazon?", "selftext": "I have stock in Apple and Microsoft, purchased at the bottom of 2020, both are near or above ATH. I was thinking about cashing out and reinvesting into Amazon which has a greater opportunity in gains moving forward IMO.  Thoughts?", "id": "13t85gn", "created_utc": 1685195729.0, "score": 14, "upvote_ratio": 0.67, "num_comments": 74, "comments": [{"body": "After the 45% run up? \n\nYeah", "score": 51, "replies": [{"body": "Why do people always ask if it’s ok to invest in these stocks after they run up so much", "score": 23, "replies": [{"body": "Because they were scared before and now have major FOMO.", "score": 22, "replies": [{"body": "I will say this\n\nIf you want to sell a stock to buy another, do so without fear. \n\nJust don't expect outperformance. Since historically timing the market is tough. And selling one tech stock for another tech stock is usually just not gonna get you alpha. \n\nIt would be luck. \n\nOf course, if you make huge gains, you can sell the profit and use it diversify. Nothing wrong with that.", "score": 8, "replies": []}, {"body": "I was scared before? So purchasing Apple and Microsoft during the great sell off on March 2020 was me being scared and experiencing FOMO?", "score": -8, "replies": []}]}, {"body": "This isn’t even the same scenario, nor am I looking into a short term hold.", "score": -2, "replies": [{"body": "Why are you asking then?", "score": 6, "replies": []}]}]}, {"body": "45%? That is literally nothing. META and NVDA are both 200%+. This mentality of yours is why you always lose put on huge gains.", "score": 7, "replies": [{"body": "Meta down 72% last year .\nNVDA down 70% and found Holy Grail this year. \n\nAmzn no such luck", "score": 5, "replies": [{"body": "Lmao.. meta down 72%….god you folks are dumb", "score": 5, "replies": []}]}]}, {"body": "The question isn’t about if a stock has gone up 45% from it’s low’s. The question is about the company. If you have analysed Amazon and (based on that analysis) you have come to the conclusion that Amazon is a better buy than your current holdings and all the other stocks you have analysed, then you can go ahead otherwise I would like to encourage you to do the analysis at first!\n\nBtw analysing a business means that you look up the relevant information about the business, especially the fundamentals of the business (for further information about valuing a business I want to encourage you to read “one up on Wall Street” by Peter Lynch, “intelligent investor” by Benjamin Graham and “you can be a stock market genius” by Joel Greenblatt.", "score": 3, "replies": [{"body": "The issue is that actually knowing a business requires literally infinite information at real time. Or insider knowledge.", "score": 4, "replies": [{"body": "If that’s your opinion why are you interested in picking stocks? Stocks are not more or less than ownership rights of a business!", "score": 2, "replies": []}]}]}]}, {"body": "Moving *from* apple and Microsoft to Amazon? No, that's a terrible idea. If you have additional income that you are investing in stocks, it's fine to put a bit into amazon right now. You missed a lot of the run up for the year, but there's still a lot more room to go up than down and a really good 5 year trajectory. \n\nBut it's really only worth it if you are in the buy and hold mindset, if you are just chasing momentum then you should prepare to be disappointed.", "score": 22, "replies": [{"body": "Aapl and MSFT are at ath with a worsening economy, amzn is not at ath. If someone wants to ride the big tech ai bubble, amzn, goog and meta make the most sense to go.", "score": 2, "replies": [{"body": "You only look at previous price with no regard for the actual company? Not a great strategy", "score": 4, "replies": [{"body": "Neither AAPL nor MSFT are sporting the revenue growth rate that AMZN is sporting at the moment. \n\nAbout 11-12% for AAPL and MSFT compared to about 20% for AMZN.", "score": 5, "replies": [{"body": "Ok, but Amazon has a far lower profit margin, plus regulators see it as a monopolist so it could be broken up, plus it has a lot of issues with stock based compensation. Microsoft and Apple are the two most successful companies since the British East India company. They are absolute cashflow machines, perfectly managed, and much safer than Amazon. That said I wouldn't buy any of these stocks at current prices, personally.", "score": 2, "replies": [{"body": "Regulators in the US will never break up Amazon. Not sure if you noticed, but the US is run by a corporatocracy. \n\nFor Amazon to run right by Apple and Microsoft in terms of net income will just take them turning efficiency dials, particularly if the top line growth continues on its path.", "score": 7, "replies": [{"body": "Just wait till they get into Healthcare.", "score": 3, "replies": []}, {"body": "Ok, you buy Amazon if you think so and I'll hold my Microsoft. You might be right, you might be wrong, but I'm pretty certain my Microsoft will beat the market in the long run so that's all that matters to me.", "score": 1, "replies": []}]}]}]}, {"body": "It's the only thing that seems to work these days with this market", "score": 1, "replies": [{"body": "When the tide goes out we'll see who's swimming naked.", "score": 3, "replies": [{"body": "The problem is timing when it goes out is important, market could bubble up another 40% and then drop 20% before resuming the climb again.", "score": 2, "replies": [{"body": "The problem is that you're gambling. If you buy speculative picks based on arbitrary stock price and not fundamentals then you might win or you might lose - it's a casino. If you buy solid companies at a discount then you will win consistently over the long run.", "score": 2, "replies": [{"body": "This generation doesn't care about getting rich in the long run, they want to make 10 million in a year and then go off on vacation the rest of their life", "score": 1, "replies": [{"body": "Every generation wants this. Nothing has changed in human psychology. Every generation thinks the generation that follows them sucks.", "score": 6, "replies": []}]}]}]}]}]}]}, {"body": "Not at an all time high, but look at the historical price and then look at when AMZN hit their highs.", "score": 1, "replies": []}]}]}, {"body": "I think you should do a bit more analysis outside of just distance from ATH. Otherwise you’re just gambling really", "score": 9, "replies": [{"body": "Isn't that the best way to determine value these days though?\n\nIt's below ath so it's cheap, that's basically value investing\n\nLooking at earnings and fundamentals is a good way to make next to nothing these days while you watch hype stocks go up 50-100% in 2 months", "score": -3, "replies": [{"body": "No", "score": 6, "replies": []}]}]}, {"body": "Where do you get that idea from ?", "score": 4, "replies": [{"body": "Buy high sell low gang", "score": 15, "replies": [{"body": "Buy high sell low? … Have you even read my post? I bought Apple and Microsoft at the low of 2020 and I’m considering selling them now that they’ve reached or are over their all time high.  Amazon still has room to get back to that point.", "score": -2, "replies": [{"body": "After AAPL has their next split, you will be kicking yourself.", "score": 4, "replies": [{"body": "Care to elaborate?", "score": 2, "replies": [{"body": "Every time AAPL splits it is back to the original price within 4 yrs.  That’s a 25% return.  I bought AAPL 8/2020 at the last split and we are potentially within striking range of the original pre-split price which is crazy.  This will be the 5th or 6th time this has happened and it has proved consistent.  (Recalling from memory).\n\nI don’t argue about AMZN, as I invested at its recent low.  I have gotten a great return with plenty of runway.  However, I would not sell my AAPL position to take a position in AMZN.  I only used extra $ and profits from selling other positions.\n\nAAPL is a solid hold and add to position until the story changes.  The business & capital structure Tim Cook has implemented since becoming CEO has significantly protected AAPL FCF for the foreseeable future.  AMZN is no where close to this.", "score": 5, "replies": [{"body": ">Every time AAPL splits it is back to the original price within 4 yrs. That’s a 25% return. I bought AAPL 8/2020 at the last split and we are potentially within striking range of the original pre-split price which is crazy. This will be the 5th or 6th time this has happened and it has proved consistent. (Recalling from memory).\n\nThere is no factual evidence proving the correlation between stock splits and price increase. Earnings growth and share buybacks are what kept the share price rising over the years.", "score": 5, "replies": [{"body": "True.  The correlation is to point to the fact that management has been able to maintain the growth and trajectory.  The changes Cook has implemented are what will continue the forward movement and the company valuation.  This hopefully maintains the markets appreciation; however, should the price be trimmed, I would be buying more shares aggressively.", "score": 3, "replies": []}]}]}]}]}, {"body": "I bought MSFT at $23. Still holding.", "score": 1, "replies": []}]}]}]}, {"body": "Personally I own all 3 and don’t really sell them and love all 3 for different things. Right now I’m more bullish on Amazon and still buying more while I’m just holding apple and Microsoft and waiting for a better time to keep buying. But that’s just my opinion and if you are looking for that than yes", "score": 3, "replies": []}, {"body": "Here's a thought, take out your original investment in AAPL and MSFT and invest it in a nice index fund.", "score": 10, "replies": [{"body": "Even index funds are super inflated right now lol", "score": 0, "replies": [{"body": "The best time to be out of the markets is never.", "score": 7, "replies": [{"body": "Time in market vs timing market or something like that", "score": 1, "replies": []}]}]}]}, {"body": "During this AI hype cycle, people really overlooked AMZN. Which was always bit strange to me, not only they are one of the OG of AI and Machine Learning. but they use it so heavily everywhere. Even building their own datacenter chips for AI. I am long AMZN, you never know when it will have a leg up, but once we see more efficiency and profit flowing through their bottom in ER report, this thing is going to blast off.", "score": 5, "replies": [{"body": "Agreed.  Majority of folks still see Amazon as a seller of goods and forget that AWS is a major player in tech, data storage and AI.  They haven’t really been connected to AI yet strangely enough.", "score": 2, "replies": []}]}, {"body": "I hear it's very dangerous. Proceed at your own caution.", "score": 2, "replies": []}, {"body": "Cash out a portion, not all.", "score": 2, "replies": [{"body": "I think I will cash out my initial investment.", "score": 1, "replies": []}]}, {"body": "might as well get a position in SMCI too while you’re at it. not too late", "score": 2, "replies": [{"body": "I should bc that’s like soooo relatable to this scenario.", "score": 2, "replies": []}]}, {"body": "Why do people have such a hard time holding cash after win?   You want a return then go buy some short term treasuries.  It’ll make you feel better.", "score": 2, "replies": []}, {"body": "AMZN going nowhere. I don't love big tech but AMZN is my least fav, followed by TSLA, AAPL. I could go long GOOG, MSFT, NVDA though", "score": 2, "replies": [{"body": "AMZN has problems with its retail business, growing competition in AWS, as well as growing CapEx.  MSFT has similar issues with CapEx growing.  Alphabet has problems with Ad competition growing.  NVDA is priced for 2027 earnings if everything goes perfectly, which it won’t.", "score": 1, "replies": [{"body": "I should have clarified I hold none of them right now", "score": 1, "replies": []}]}]}, {"body": "AI apps run on Amazon cloud, even chatgpt is hosted on AWS.\nAmazon will be part of AI growth", "score": 6, "replies": [{"body": "ChatGPT is hosted on Azure.", "score": 11, "replies": [{"body": "OpenAI was founded on December 11, 2015 and was originally positioned as a non-profit artificial intelligence research company. The company was co-founded by Sam Altman, Elon Musk, Greg Brockman, Reid Hoffman, Jessica Livingston, Peter Thiel, Amazon Web Services (AWS), Infosys and YC Research, with Sam Altman and Elon Musk serving as Co-chairs. The funders have collectively committed $1 billion to support OpenAI.", "score": -1, "replies": [{"body": "That has nothing to do with it. ChatGPT is hosted on Azure, not AWS. Not only has this been talked about in articles, but you can actually validate this yourself if you enable the web browsing option and ask it to browse to whatismyip.com and report back. It will report a Microsoft-owned IP.\n\nhttps://www.reddit.com/r/ChatGPT/comments/13o6gtv/chatgpt_doxes_itself/", "score": 3, "replies": [{"body": "https://openai.com/research/infrastructure-for-deep-learning", "score": 0, "replies": [{"body": "Yeah, that’s from 2016 and has nothing to do with where ChatGPT is currently hosted.", "score": 3, "replies": []}]}]}]}, {"body": "It was running and developed on AWS donated servers and private nvda servers. MFST joined recently", "score": 0, "replies": [{"body": "OpenAI works closely with Microsoft’s cloud service Azure. In July 2019, Microsoft backed OpenAI with $1 billion, and the investment made Microsoft the “exclusive” provider of cloud computing services to OpenAI\n\nhttps://www.cnbc.com/2023/01/23/microsoft-announces-multibillion-dollar-investment-in-chatgpt-maker-openai.html", "score": 6, "replies": [{"body": "https://openai.com/research/infrastructure-for-deep-learning", "score": 0, "replies": [{"body": "It looks like the article is from 2016. Either way, a lot of AI companies use/will use AWS.", "score": 1, "replies": [{"body": "Yes, but not for the reasons /u/LizHurleyFan said. OpenAI has been partnered with Microsoft since 2019 as its exclusive technology provider, mostly due to Microsoft’s $1B investment at that time, and the associated agreement.\n\nEvery cloud has AI cognitive service offerings, but Microsoft is largely considered the frontrunner for the very short term because it has built custom supercomputing clusters in its datacenters in partnership with and to host and run the OpenAI services in Azure, which is why it now offers OpenAI services as a whitelabeled offering to its customers, called Azure OpenAI.\n\nAWS has been cozying up to Hugging Face recently in an effort to compete with this.\n\nThe reality is that it’s a long game and you don’t get points in the end for being a first-mover in a long game. The smart money today is to hedge your bets across the clouds and include both Microsoft and Amazon in your portfolio.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It’s a big reason why I’m highly interested in Amazon.", "score": -1, "replies": []}]}, {"body": "I am bearish on amazon long term. \n\nDelivering shit is just fucking expensive.", "score": -5, "replies": [{"body": "You’ve got a point about their goods but Amazon is more than just about selling goods. AWS is going to continue growing exponentially as tech grows", "score": 5, "replies": [{"body": " Last earnings they said they expect aws to slow down I thought. Isn't that why it had a dip after ?", "score": 6, "replies": [{"body": "They negotiated down their offerings on a per client basis and basically nerfed their revenue to keep customers subscribed and long term healthy. Their argument is brand loyalty and I hope to god it pays off in the next 5y", "score": 1, "replies": []}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "13ta78u", "created_utc": 1685200961.0, "score": 119, "upvote_ratio": 0.9, "num_comments": 73, "comments": [{"body": "It pretty much jumped the valuation of AMD in one day, that's crazy.", "score": 108, "replies": [{"body": "I mean read that again people!! Of fucking course it's over-bought!", "score": 9, "replies": [{"body": "It will continue to moon", "score": 2, "replies": []}, {"body": "And somehow it is actually cheaper on a forward PE basis than prior to the print - insane!!!!", "score": 0, "replies": []}]}, {"body": "And will continue to 🌝", "score": 1, "replies": []}]}, {"body": "I like Adobe assuming you think AI keeps pumping.", "score": 52, "replies": [{"body": "Bad times when you have an art degree. Unless you specialised in hands.", "score": 24, "replies": [{"body": "It’ll be a useful tool for artists (adapt or die), but for sure, the bottom end of the industry is about to be cut off.\n\nConcept art and graphical design (especially logo design) look easy targets, but still in the relative unknown on who owns the IP created.\n\nAnything less than total ownership by the person using the program is going to be an issue for use cases above.", "score": 8, "replies": [{"body": "The one ruling (can't remember if it was a court case or a governing body) that I've seen was that nothing that is AI generated is copywritable by anyone.", "score": 2, "replies": []}]}, {"body": "How — If anything it will help by advancing all things digital design related in terms of speed/documentation/process etc. coming from a person that does ux/design for a living. \n\nI think the fact that this is your assumption is the reason why ppl dont understand the opportunity with nvda/adobe and the AI companies/the space itself. \n\nDo research —- stop posting with uniformed trump type opinions.\n\nYes, nvda might drop 10/15%. But, long 5-10 yrs it will continue to grow imo.", "score": 2, "replies": [{"body": "Same was said of Intel about 14 years ago", "score": 1, "replies": [{"body": "Dude. Based on response to the first guy. Do some damn research before you just say shit. \n\n\nIntel never evolved to pursue products and services to get out of its own way. Hence why it is where it is today. \n\nSo great comparison, not (insert borat voice). Buy intel and hmu in a year lmk how it is treating you.", "score": 2, "replies": []}]}, {"body": "There is a huge difference between what the technology can and will do over time, and translating this into a market cap valuation over $1 trillion.   Also remember that software has and always been here to help YOU.  It’s just getting better and making YOU more efficient.   The fact that some idiot consumer can put a pretty bow on someone’s head in a picture just by typing “bow” is irrelevant.   What YOU do everyday is still way more valuable and the software will just make YOU more valuable.    It’s not going make the software companies that much richer IMO.", "score": -2, "replies": [{"body": "Guy stop typing you in caps—cause it makes YOU look like a jerk off. \n\nOf course it will make the things i do more valuable. But that valuable software will have to come from somewhere cause im not providing it. Hence these companies. \n\nYou just basically went in a full circle of what i said but explaining it differently….", "score": 0, "replies": [{"body": "Touchy.  😂.", "score": -3, "replies": []}]}]}]}]}, {"body": "You like Adobe? What part about their management and capital allocation do you like?", "score": 9, "replies": [{"body": "The fact they have immense FCF and benefit directly from AI and being able to immediately put it into applications", "score": 24, "replies": [{"body": "Also their p/e is 28. And their historical p/e for the past 12 years was around 42. So while 28 p/e is not cheap at all, it's well below their historical p/e. For a company that's grown earnings at 25% in the last 12 years. While not a value investment, it's not a bad investment.", "score": 4, "replies": []}, {"body": "Their capex is also pretty low compared to what they generate in free cash flow. More cash on hand than debt too.", "score": 2, "replies": []}, {"body": "Their FCF is inflated by their “immerse” SBC ~ 30%. \n\nAdobe been using AI years in their premiere pro / Sensei. Literally years.\n\n\nWe didn’t reinvent AI in 2023. How do you think digital insights work on Adobe?", "score": 0, "replies": [{"body": "I know. I'm simply saying it seems like a relatively cheap AI stock which could actually make use of improved LLMs and digital generators.", "score": 7, "replies": [{"body": "This, current tools utilizing AI elements already can be easier to scale, than developing a unique use case from scratch.", "score": 1, "replies": []}]}, {"body": "SBC doesn't \"inflate\" their free cash flow\n\nBesides, they've been buying back shares:\n\nhttps://www.macrotrends.net/stocks/charts/ADBE/adobe/shares-outstanding", "score": 3, "replies": [{"body": "SBC is added back to operating cash flow on the cash flow statement. Since FCF = operating cash flow minus capex, it does inflate the value.\n\nIf the company buys back shares to offset that dilution, then you don't see the effects of it directly. But at that point, is it really \"free\" cash flow? If the company has to spend cash later to buy back shares rather than compensate employees with cash up front, then that isn't really free cash flow left over for shareholders.", "score": 4, "replies": [{"body": "Well, I certainly learned something new. I understand that SBC and dilution is of course mostly bad. I just didn't figure it would be something that was included in free cash flow given that most models are based off of it.", "score": 1, "replies": []}]}, {"body": "I am not sure what is the correlation between buybacks and SBC at high levels? \n\nIn which universe SBC doesn't inflate FCF? 6B in Operating Profit, and 1.5B in SBC TTM. The company is not ran for their shareholders, and the moment has a long track record of poor capital allocation", "score": 1, "replies": [{"body": "Even with their stock based comp, they're buying back more shares than issuing, thus, the shares outstanding is decreasing. \n\nSBC dilutes, not inflates, EPS.", "score": 1, "replies": []}]}]}]}]}, {"body": "They've been phenomenal capital allocators for awhile now, I think they deserve the benefit of the doubt for now wrt the figma acquisition.", "score": 2, "replies": []}]}]}, {"body": "I can’t believe that one move was bigger than Disney. For some reason that one is just nuts to me.", "score": 5, "replies": []}, {"body": "AXP, SBUX, and WM.", "score": 7, "replies": [{"body": "SBUX is my favorite stock, I might add this week if prices stay in the 90s or go lower. It's incredible how much of a 'moat' a coffee company has.", "score": 3, "replies": [{"body": "Amazing brand starbucks. The Peter Lynch argument in me says its terrible coffee. But you look at the growth and financials and people will drink it no matter what.\n\nI met some American girls in Romania who were excited to go to Starbucks cause they were studying in a European town with no Starbucks. \n\nYou could get a good hipster coffee for like $2 and they were spending $10 on Starbucks and were excited! I dont get it personally but pretty amazing.", "score": 3, "replies": [{"body": "Kids in my country drink Starbucks. I’m talking 10-12 year olds.", "score": 2, "replies": [{"body": "Feel like it's normal for lots of teens to get SBUX, at least in the US. 10-12 is really young for coffee though... That said SBUX has a lot of pseudo-desserts kids might like.", "score": 2, "replies": []}]}, {"body": "I have to admit I love SBUX coffee though... Well I almost never buy from the store itself, I buy the whole beans and grind them myself. The bitter, burnt flavor got me hooked, and now I can't stand some of the fancy, fruitier coffees I was drinking before (e.g., Mayorga and its assorted Latin American blends). My goal is to earn more in dividends from SBUX than I pay for personal consumption.\n\nIt flabbergasts me how much people pay for coffee from the store directly, though. I get 2 weeks worth of coffee for the same price of 2-3 visits.", "score": 2, "replies": [{"body": "Thats very interesting your comment on the taste of beans. Makes me think this is a major advantage.\n\nWith guiness the beer when you start drinking it no other beer will suffice. Everything else tastes like water so you are basically stuck on it. Thats why it has such a strong following.\n\nMy Dad lived in the US for a decade or so and drinks your style coffee. I wonder if Starbucks is sort of like that. Once you have the bitter/burnt flavour like you say the other coffees dont hit in the same way.\n\nVery interesting thanks mate. Ill have to go through their financials on Monday and see what I value them at. \n\nThe good thing is they seem to always be in the news for some \"woke\" issue or union issue or something which might cause volatility so I can get my buy price.", "score": 1, "replies": [{"body": "Lol that's so funny you mention beer. The exact same thing happened to me with IPAs vs lagers/Pilsners; I used to love the latter but now the bitterness of the IPAs is all I like.\n\nGuinness for some reason in the US I don't seem to like--I actually find it a bit watery/light compared to other stouts? Apparently if you actually get Guinness in Ireland you get a much heavier drink.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Palantir has almost doubled recently", "score": 17, "replies": [{"body": "Unless PLTR stops diluting as much as they have, i wouldn’t touch it. Maybe it’s great for employers, but it’s bad for shareholders.", "score": 6, "replies": []}]}, {"body": "TSMC", "score": 11, "replies": [{"body": "They have a market call above 184B", "score": 5, "replies": [{"body": "Oh yeah sorry I’m dutch speaking so messed up on billion", "score": 5, "replies": []}]}]}, {"body": "Who piled in to buy the massive spike anyways? Is there anyway to find this? Doesn’t seem to be an insider trade…", "score": 3, "replies": []}, {"body": "Disney imo. It's at March 2020 covid crash levels. Fortress balance sheet. Iger is back. Likely wins against Desantis. Already cut costs. ESPN to streaming will increase revenue", "score": 11, "replies": [{"body": "Parks are good, streaming is a loss and their cinema/movie content has been crap. Disney needs new leadership and *quality over quantity*, not the opposite they've been peddling for years", "score": 7, "replies": []}]}, {"body": "Sony, Thermofisher, Palo Alto, Honeywell, Nike, Texas Instruments, Intel, CVS, Blackrock", "score": 6, "replies": []}, {"body": "RKLB, 1.7b cap", "score": 4, "replies": [{"body": "I'm watching that since someone on wsb told great things about it. but they will not breakeven in the foreseeable future (years). don't touch that", "score": 2, "replies": [{"body": "They under-promise and over-deliver frequently. It will rise more quickly than many suspect.", "score": 2, "replies": []}]}]}, {"body": "If you can overlook the fact that it's Chinese. BABA is a true deep fuckin value play. \n\nThis company is a cash generating machine with over 120bil rev annually and sitting on 70bil cash on hand. It's sitting at 211bil MC!!! which is ridiculously low for the cash and eps growth they produce.", "score": 4, "replies": [{"body": "I lowkey can't wait for the Chinese people to stage a rebellion and get their insane government out and install a more westernized democracy. Cuz then I'll be first in line to invest.", "score": 9, "replies": []}, {"body": "Let him cook (the books)", "score": 5, "replies": []}, {"body": "That is a huge if, my friend.", "score": 6, "replies": []}, {"body": "China is getting isolated more and more, COVID scares never enduring, younger generation is poor.  That country is fu$ed long term, as is BABA.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Way above the $184b market cap.", "score": 2, "replies": []}]}, {"body": "Yodo says, FOMO is real.   I have never seen so much flat out gambling going into a market, well not since 1999/2000.   Despite every lousy thing going on around the world, people are just lazy investing into anything and everything, and YOLOing into anything based on some fantasy.    If you can get it, go for it, but don’t be blind about it.   Keep your shit right.", "score": 1, "replies": [{"body": "We’re not 2 years removed from memestocks, SPACs, NFTs, etc and you’re out here saying you’ve never seen this much gambling in the market", "score": 9, "replies": [{"body": "Different back drop.  High inflation, rising rates, QT. earnings estimates adjusted down, economic conditions mixed to slightly negative, etc.  you make a fair point though.  It’s a new phase in gambling or just a carryover from the last bubble?", "score": 2, "replies": [{"body": "Seems to have some legs. Company dollars are actually flowing to the AI concept. Whether or not it’s successful longer term remains to be seen but it’s become tangible to a lot of investors now with Chatgpt. nVIDIA wouldn’t guide for that much growth if there wasn’t high demand", "score": 5, "replies": [{"body": "NVDA guided appropriately because there is real short term demand.  Not expecting that to last for more than couple quarters.  Market cap not sustainable for them longer term.    The rest of the market is riding their coat tails and with no justification for it.", "score": 3, "replies": [{"body": "I agree, very overvalued but if they can keep or even accelerate this growth then it’ll turn out to be a somewhat justified valuation. No one really knows what’s going to happen or how long this trend has legs for but some of the other names could easily crash as the picks and shovels will benefit first", "score": 2, "replies": []}]}]}]}]}]}, {"body": "2nd to last sentence, what do you mean?", "score": 1, "replies": [{"body": "The OP is asking, \"what companies have market caps worth less than the one day increase in NVDA's market cap followings its earnings?\" The implication being that, if investors were willing to bid up that single company's market cap by $184B, perhaps that implies large upside (as a share of their market cap) for other high quality stocks should their earnings/guidance also improve. I.e., consider what $50B in inflow into another stock like AMD do to the stock price on 'AI' narratives.", "score": 3, "replies": [{"body": "Makes sense that what thanks", "score": 1, "replies": []}]}]}, {"body": "Tesla will run again before the years out.", "score": -5, "replies": []}, {"body": "Could honestly see ZM make another run, I know the sub hates them but they hit their gross margin target like 3 quarters early. Lots of cash.", "score": -4, "replies": []}, {"body": "MPWR\n\nGreat leadership, great fundamentals, great future outlook. There’s all sorts of room for it to run.", "score": -2, "replies": []}, {"body": "SMCI. But it has run up a lot, I don't know if I would enter here.", "score": 1, "replies": []}]}
{"title": "I still have faith in this sub. For every 9 posts about how OP got burnt by NVDA, there is still one good post that sparks good discussions", "selftext": "The money markets is divided into two. A big chunk of people keep talking up and down about NVDA, while the rest of the people are sick and tired of seeing this ticker all around.\n\n\nBut I am still sticking around, and that's because of some rare but quality posts like this \n[questioning wheeling](https://my.reddit.com/r/thetagang/comments/13spq3l/why_you_need_to_stop_wheeling/)\nand this [questioning the sub itself](https://my.reddit.com/r/thetagang/comments/13mdwju/sunk_cost_fallacy_that_runs_rampant_in_this_sub/) as recent examples\n\n\nI see that the sub is heading to a direction that attracts either wsb degenerates or those who want to make money by clicking a mouse wheel once a month but I hope that the people who question and improve the core setup stay here", "id": "13tab0r", "created_utc": 1685201243.0, "score": 129, "upvote_ratio": 0.9, "num_comments": 75, "comments": [{"body": ">or those who want to make money by clicking a mouse wheel once a month\n\nThis is closer to real premium selling than anything else you're describing. Its not exciting or highly stressful and it doesn't require 20 hours or more per week. Its like watching paint dry.\n\nwsb degenerate-style traders get shot down quickly on this sub, because it leans VERY conservative. I think lordxoren666 summed it up quite well in the comment linked in your post\n\n*\"Because the people in this sub aren’t traders. They’re somewhere in between traders and buy and hold investors. More like buy and hold investors that use options to get “better” entry and exit prices.\"*\n\nThis is one of many issues with the wheel. Its universally accepted (outside of the geniuses of thetagang) as a lower-risk, lower-return strategy. Its basically a step up above dividend investing or buying treasuries (in this market). Though I think both of the latter alternatives would significantly perform the average thetagang wheeler over a few years time.\n\nI appreciate your optimism, but I've been on this sub since it started and seen it all - the 2%-per-week bros, the 6-month know-it-alls, the vets, the gamblers, the satisfied underperformers, the bullshitters, the annoying engineer guys who wrote an algo and will tell you how much they know, when they've barely ever made a trade. Pretty much anyone who wants to have a decent conversation gets drowned in a cult-like following of the wheel, before leaving.\n\nSelling premium is about evaluating risk, understanding and using leverage, understanding probability and stats, understanding how volatility works/trades. There are also a million different awesome ways you can set up a trade for a credit or debit with pretty much any risk profile you want. I can't remember the last time I saw a post that dealt with any of these subjects.", "score": 54, "replies": [{"body": "If the people in this sub aren’t traders, who do you consider to be traders?", "score": 4, "replies": [{"body": "Bear in mind that that is a quote from another user. \n\nIf you spend enough time on this sub, you’ll come to recognize a lot of the people are looking to enter long stock positions and using cash-covered puts to do so. \n\nI would say this would only qualify as “options trading” in a technical sense, in that it does include options but it is very different from a premium seller actively opening and closing positions without intending to own the underlying security. That’s fine, but the former tends to not only be over-represented here, but also there’s a general lack of understanding in anything else.", "score": 15, "replies": [{"body": "Intending to own the security is the key distinction, i agree", "score": 3, "replies": [{"body": "Yeah and again, that’s totally fine if that’s what you want. At the same time, that is not really suited to an options trading sub. There are plenty of dedicated wheel subs out there. \n\nThe day you eliminate assignment as a strategic option, you level up 10x as a trader. You’ll be forced to look at risk and risk management differently. Let’s be honest, “I’ll just buy/sell the stock if it moves against me…” is the laziest cop-out ever.", "score": 7, "replies": [{"body": "> The day you eliminate assignment as a strategic option, you level up 10x as a trader. You’ll be forced to look at risk and risk management differently\n\n\nThis!\n\n\nI've made a decision to never get assigned and structuring my setups around this rule. Like you pointed out, some people want to own the stock and that's how they setup their trade. The worst is to mix the two sides", "score": 2, "replies": [{"body": "A million times.  I actually left this sub a while ago because i have given up on it, but reddit keeps shoving posts like this one into my feed.  It just wasn't worth my time trying to help people who didn't think they needed help.", "score": 2, "replies": [{"body": "I too find this sub extremely frustrating because there are so many people distracted by the shiny premium that they ignore their own horrible trading.", "score": 2, "replies": []}]}, {"body": "Yea I used to get assigned earlier in my career and actually did fine with the wheel strategy and selling covered calls, but I agree it’s a much more efficient use of capital to never get assigned and it is more strategic", "score": 2, "replies": []}]}]}]}, {"body": "Well said! Big difference between buy & hold using options & an active options trader trying to profit from theta decay without intention of taking assignment", "score": 3, "replies": []}, {"body": "Is there a good sub for true options traders? i.e. people who understand greeks and volatility and use it to inform their trades; understand when to go long and when to go short, and use multiple strategies in multiple underlyings, rather than focusing on the wheel in relatively cheap stocks?\n\nIt seems like this sub is mostly for wheeling and r/options is mostly for buying calls and puts. No sub seems to regularly discuss spreads, calendars, strangles, etc...", "score": 2, "replies": [{"body": "Pmtraders was kind of this before it died. In theory, that’s what thetagang is supposed to be", "score": 2, "replies": []}]}, {"body": "I always thought this sub was an options trading sub. But I suppose given the types of trades people do make here, you have a good point. I used this sub to learn options trading because every other options sub only focused on the buying portion.", "score": 1, "replies": []}]}, {"body": "Margin requirements prevent most people from earnestly *trading* options.\n\nThere's some recent posts on WSB of people who truly are trading options where they swung millis on NVDA etc.\n\nMost people here just want to beat 5% HYSAs... Irregardless of the cost.", "score": 1, "replies": []}]}, {"body": "All good points, and probably more information packed than my original post.\n\n\nNothing against what you said, but maybe an addition. People generally reason their shortcomings and hide behind excuses. Anything other than buying treasuries is putting on a trade. Buy and hold is also a trade. Risk management, opportunity cost etc all apply to buy and hold as they apply to day trading. Just in a slower pace. \n\n\nThe universe of options is many times broader than the equities. People don't understand that as the possibilities expand, so as the risks. I can't comprehend how the wheelers oversimplify this broad and complex instrument and expect good long term results. \n\n\nAnyways, every \"cult\" has a few good leaders and lots of boot lickers. I see that while rare, thetagang thought leaders are of high quality", "score": 1, "replies": [{"body": "So is this to say that I'm a bootlicker or should leave the sub because I just want to CC my b/h and PMCC in my smaller account, as well as cheer on everyone in the daily chat thread?", "score": 5, "replies": []}]}, {"body": "That's a lot of words. Maybe post a specific transaction you recommend so people can evaluate your knowledge.", "score": -12, "replies": [{"body": "I have years of post and comment history on this sub, if you wish “evaluate my knowledge.”", "score": 5, "replies": [{"body": "Never confused quantity for quality.\n\nPost or STFU.", "score": -13, "replies": [{"body": "I'm pretty sure you've never been confused with a smart person either.", "score": 1, "replies": []}]}]}]}, {"body": "Mechanical selling could work but probably doesn’t beat buy and hold. That is data supported as far as I have seen. \n\n\nWhat probably works better but isn’t data supported that I know of is doing work and finding good stocks and times to open positions in either direction and gain from theta and vega. \n\n\nI’ve asked in the past (new acct, lost old ones login) for data when something peaks my interest and usually nobody will share their own data - ever. I mean neither will I, maybe over PM, not posting publicly though. I think that’s pretty normal though for a larger group.", "score": 1, "replies": []}, {"body": "How do you maintain the patience to continue to post and comment in this sub? I created on of the posts OP linked, and the amount of contradictory, condescending, and even idiotic responses I got took away any desire to ever post here again.", "score": 1, "replies": []}, {"body": "Buy and holders looking to get in and out better… \n\nYeah that describes me pretty well.", "score": 1, "replies": []}]}, {"body": "But I *do* want to make money clicking a button once a month", "score": 23, "replies": [{"body": "what about the ATM machine? a few buttons though", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Yeah the people who complain about it just don’t understand. Instead they’ll roll out and just tie up capital for months.", "score": 0, "replies": []}]}, {"body": "I fall on both sides, we have several long term bull spread  calls that have done extremely well up 800% and I also had stupidly, an uncovered call and also a put so lost on those but overall it worked out OK.", "score": 7, "replies": [{"body": "I think it’s good to fall on both sides though. At least until you consistently find something you’re successful with. You don’t want to be too conservative otherwise you just just buy VOO and hold or whatever the fuck. But you also don’t want to just gamble everything away like a WSB Degen. Gotta be somewhere in between. I have my conservative treasuries/bonds, but I also have a few lottos.", "score": 1, "replies": []}]}, {"body": "People can’t handle going against the hive mind of a sub. This subs mods at least are good in not policing for their own personal views, we can be happy that exists as it is a big problem across Reddit. \n\n\nThe users are 89% uneducated and don’t actually understand anything. 10% understand enough. 1% know more than the rest of us combined. \n\n\nI stay for the 1% nuggets of wisdom. \n\n\nI would say the main issue is the 89% becoming personally offended when their hive mind thinking is questioned. \n\n\nMain myths are:\n\n\n* selling cc > buy and hold \n* rolling isn’t a loss\n* premiums received reduce cost base\n* vega doesn’t exist", "score": 5, "replies": [{"body": "i still don't understand how people don't see rolling as a loss. The position went against you, you are at a worse place than you started. Rolling is nothing but hitting the can down the line. Are they expecting a magic wand will touch the next leg and everything will be OK", "score": 1, "replies": [{"body": "Because the position did not go against you. I don’t see how people can’t understand that.\n\nIf you sell an OTM CC that becomes ITM you are overall in a better position. This can’t even be argued.\n\nIs the position better than if you hadn’t sold the CC? Certainly not, but it’s undoubtedly better than when you began.\n\nSo many people like yourself forget that you get the gain in the underlying in this scenario.", "score": 2, "replies": [{"body": "OK here is why we are not on the same page\n\nYou are looking at things from the combined P&L perspective.\n\n\nIn my mind, both trades are independent of each other. Did the first trade lose money? Yes Just because the second trade is in profit now doesn't justify rolling. And to make matters worse, we don't know where the underlying will be close to expiry. There is no guarantee that the trade will stay profitable", "score": 1, "replies": [{"body": "Fair enough. You just don’t understand why options exist.", "score": 1, "replies": [{"body": "Pls enlighten us as to what the existence of options have to do with mental accounting.", "score": 1, "replies": [{"body": "Options were invented to be able to buy or sell insurance on your positions. They were never meant to be positions themselves.", "score": 1, "replies": [{"body": "Lmao", "score": 0, "replies": [{"body": "Ignorance is nothing to be proud of.", "score": 2, "replies": [{"body": "You’re off your rocker bud.", "score": 1, "replies": [{"body": "You have no idea what you are talking about. For many years retail couldn’t even trade options.", "score": 1, "replies": [{"body": "Back in my day you had to check the ticker tape ya old whipper snapper. \n\n\nGo to bed grandpa.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "The position (1) did go against you. You’re at a loss. \n\n\nOpening a new position (2) has not resulted in a loss yet. \n\n\nIt’s just that simple.", "score": 1, "replies": [{"body": "It’s absolutely not a loss if the call is covered. Not even debatable.", "score": 1, "replies": [{"body": "You’re the only one that has interjected with owning the underlying.", "score": 1, "replies": []}]}]}, {"body": "This is the most bizarre understanding I’ve seen. You would do yourself some good to read or watch some options 101 stuff.", "score": 1, "replies": [{"body": "I’ve only spent 25 years doing this . I don’t think you even know what a CC is.", "score": 1, "replies": [{"body": "Carbon copy obviously. \n\n\nI think it is sad that you equate age with expertise. Plenty of dumb old people lose money.", "score": 1, "replies": [{"body": "Not as many as young people that don’t know what they are doing.", "score": 1, "replies": [{"body": "You seem to be over confident and continuously pull factual statements out of nowhere.", "score": 1, "replies": [{"body": "Stock options weren’t even available to retail until the 1970’s", "score": 0, "replies": [{"body": "Unsubscribe from bad derivatives facts.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I made more rolling SPX options last year than any other trade. Kept it all too.", "score": 1, "replies": [{"body": "Cool. What’s your point", "score": 1, "replies": []}]}, {"body": "It’s hard for humans to admit they lost or are wrong. It’s why we tend to hang on to expiry too.", "score": 1, "replies": []}]}, {"body": "I agree with you. The markets punish you for not respecting reality. And it is very difficult to get a clear picture of what is real and true. It takes lots of time to even give it an attempt. \n\nI just don’t understand the people who get offended by having their worldview criticized or their particular belief about how an event will play out. I don’t understand why they don’t want to be open to another view. Because what if we are wrong in our conviction and if we would just be willing to listen we could adjust our belief to better reflect the real world.\n\nIt’s bizarre seeing the different meme stock subreddits and how that has played out over the last few years. It has truly been reduced to a cult mentality that is not based in reality in any coherent way. \n\nYou’d think your life savings would give you motivation enough to care about being right. At least making an honest effort because what is the alternative?\n\nMaking jokes about blowjobs behind a disgusting dumpster for fake internet votes. I feel bad for these people most of all. It’s a strange world when I care more about their money than they do. \n\nI am afraid of being like that. I’m most afraid about losing my life savings. But I try to respect it for the beautiful selfishness that it is.", "score": 1, "replies": [{"body": "> I just don’t understand the people who get offended by having their worldview criticized or their particular belief about how an event will play out.\n\nBecause people expect a certain outcome that will benefit to their current position. When they are positioned in one direction, they read all the news with that colored glasses. \n\n\nHow do I know? Because I do it too. Instead of open mindedly looking at the charts and trying to understand the price action, if I am long, I am waiting for an upside move. We need to be more flexible and see things as they are, not as we want them to be", "score": 2, "replies": []}]}, {"body": "If you think premiums received don’t reduce cost basis, you ought to call up the IRS and argue with them, because that’s where they set your basis.", "score": 1, "replies": [{"body": "That’s cool. It doesn’t change the math. \n\n\nDo you also only deduct $2k or whatever usa limit is for losses when you’re determining your profit and loss for the year ? \n\n\nTax basis isn’t reality for many things.", "score": 1, "replies": []}]}]}, {"body": "For every 9 posts about NVDA and 2-3 posts about the wheel….there is still one good post that sparks good discussion.", "score": 4, "replies": []}, {"body": "I don’t think its that bad here. Could be worse, could be r/dividends. That has gotta be the most one dimensional sub regarding stocks and such.", "score": 5, "replies": [{"body": "Investing and stocks are pretty bad too. Options is just 99% blind.", "score": 2, "replies": []}]}, {"body": "Tired of all this complaining. Post your trades so people can evaluate them.  Then we can have a discussion about whether you know what you're talking about. \n\nNothing wrong with CC s, naked puts and straddles, chasing delta or theta, making an earnings play. Done intelligently, i.e., at the 20-30 delta and taking profit at 50% of max, these are perfectly acceptable TG trades. \n\nNotice how I provided specifics instead of whining or talking in cliches.", "score": 12, "replies": [{"body": "Agreed", "score": 2, "replies": []}, {"body": "Relax, it's the long weekend. We are still 2 days away from the market opening", "score": 1, "replies": []}]}, {"body": "I avoid this sub because it gives a veneer of giving helpful advice. 99%+ of option retailers lose money over the long run. The strategies that are mostly discussed here are the type of strategies that will make you money consistently except for the singularity that will vaporize your account. \n\nComments that go against that narrative get mostly down-voted into oblivion, so it becomes a great echo chamber to re-inforce dangerous behavior.\n\nYou need to be real careful with options.", "score": 5, "replies": [{"body": "Well said.", "score": 2, "replies": []}, {"body": "i'm new to this sub and new to options trading. i read a few books, but the greeks are largely greek to me-- i understand that each greek informs you about how a certain attribute will change (basically a partial derivative in the calculus/mathematics sense of the word.) i probably need to read the books a few more times to understand how to use greeks properly. \n\nwhat has made sense to me is the P/L diagram. based upon the underlying, you can construct any trade that you think will benefit from the prevailing conditions.\n\nprobabilities are only good when the law of large numbers can be applied- i.e. many similar trades for a particular strategy to determine if you have an edge.\n\ni like that short options are theta positive and instead of the wheel i've put on a few vertical credit spreads. \n\ni don't have enough trades in yet to see if i can trade for a net positive gain.", "score": 1, "replies": [{"body": "the most important thing is to educate yourself. If you want to trade and make money with it will be a lifetime journey. Most people that invest on the market do not understand where they can get an edge.\n\nWhile thetagang understands where you can get an edge (IV difference between actual and expected) that doesn't mean that they know how to get an edge consistently. \n\nMost people are fishes waiting to be eaten by the few. Always protect your downside, you are always at risk of being the tiny fish. \n\n&#x200B;\n\nGood luck", "score": 1, "replies": []}]}]}, {"body": "A flavor of the month is natural as a good chuck of people are just here because they want to follow other people's trades.", "score": 2, "replies": []}, {"body": "Ahh another redditor telling the world how wrong something is. If you don’t like it just move on…", "score": 2, "replies": []}, {"body": "Might as well be wallstreetbets jr at this point.", "score": 0, "replies": [{"body": "Nah, wouldn’t say the sub is close to that at all.", "score": 1, "replies": []}]}, {"body": "You should take precautions from blowing up your account. That's why you still put a stop loss as 3-4X, or when your strike price is breached buy/sell the underlying to negate the trade.", "score": 1, "replies": [{"body": "My hard SL is 1x the premium I receive, and at 0.5x, I am carefully watching the price action of the underlying. Risk management is the number one job", "score": 2, "replies": []}]}, {"body": "Thanks for linking my post. Based on the responses I got, it seems like I chose the wrong title. Seems like \"the wheel\" has a very flexible interpretation (which is a problem), and people were taking issue with the fact that I was criticizing their beloved \"wheel\" rather than focusing on the main problem. \n\nThe main point was that holding on to short options after they've lost a significant amount of extrinsic value is usually too risky and capital inefficient. Instead, two-thirds of the responses where blindly defending \"the wheel\" and insulting me for not understanding the wheel even as they contradicted each other's definition of it (which I thought was hilariously ironic).\n\nAnyway, a better title would've been something like \"why you shouldn't wait for assignment\".", "score": 1, "replies": []}]}
