{"title": "NVDA did not file a new shelf offering.", "selftext": "No open positions in NVDA, but follow it. I’m seeing a misunderstanding run wild and thought I’d make a post to address it: NVIDIA on Friday did not file for NEW shelf offering. They filed an amendment to the one from February (the difference being dilution of 20 billion vs 10 billion). Further, the quarterly report explicitly addressed that this filing was coming purely for administrative purposes and that they actually have no plans to use it anytime soon (ie no dilution at all anytime soon).\n\nThe bear narrative that the rug has been pulled isn’t correct and everything can be understood by reading the quarterly report. \n\nTLDR Translation for WSB Bro: NVDA bear fucked. Can’t read good. Bear bad reading used to try to scare NVDA bull to give up money for Bear. But Bear fucked because other people read good.", "id": "13u2eot", "created_utc": 1685285838.0, "score": 155, "upvote_ratio": 0.81, "num_comments": 77, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|14 hours ago\n**Total Comments**|4|**Previous Best DD**|\n**Account Age**|6 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Me after TLDR: Sad me fucked ![img](emote|t5_2th52|4260)![img](emote|t5_2th52|30641)", "score": 32, "replies": []}, {"body": "It’s bullish if NVDA sells shares and it’s bullish if they don’t. Just buy it, and then buy more.", "score": 81, "replies": [{"body": "If they declare bankruptcy: Bullish.", "score": 34, "replies": [{"body": "Unironically this sub was still pushing bed bath and beyond when it declared bankruptcy", "score": 23, "replies": []}, {"body": "NVDARQ next year?", "score": 2, "replies": []}]}]}, {"body": "I’m short, way short.  Opened 3 8/23 $350 puts at close Friday.  My rare lotto tickets.", "score": 46, "replies": [{"body": "I wrote the January 325 strike puts. Huge premiums on earnings day. Got around $32. \n\nI’ll take some NVDA at $292 after that blowout.", "score": 9, "replies": []}, {"body": "Sadly, I would stay away from NVDA", "score": 14, "replies": [{"body": "Me too, that’s why it’s a lotto ticket.  Only positions I have and expecting my options to expire worthless.  However, the upside versus downside and my overall sediment makes the pot odds good enough for me.", "score": 11, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Rough day?", "score": 1, "replies": []}]}, {"body": "Yup please short you fucking idiot", "score": -13, "replies": [{"body": "Oh man I feel so stupid now and starting to think I’ve made a terrible decision.  Oh great oracle if the market with deep understanding of the market.  Please give me more high quality insight when you see fit.  Fucking pleb..", "score": 21, "replies": [{"body": "\"I feel so stupid now\"\n\n\"...overall sediment\"\n\nHmmm.", "score": 6, "replies": []}, {"body": "I mean when you lose all your money thats cool w me", "score": -8, "replies": [{"body": "Ahh, I apologize.  I should have included that buying a lotto ticket means I don’t think it’s likely I’ll get a return and used >fraction of my portfolio.  You heard lotto ticket - yolo my whole account on far OTM options I’m guaranteed to get rich!\n\nThe irony is a wish I had been a degenerate fuck like you when I bought a lotto ticket pre-earnings.  I’d be rich as fuck, might have hit a 9 digit portfolio  full yolo on margin.  \n\nI’d take some of that money and place a job ad\n\nHiring 30 highly motivated individuals \n\nJob benefits \n\nWork 1 day a month\n\nAny car on the market of your choosing which you keep on expiration of your employment contract.  \nFull health care, dental vision, 10K monthly contributions to retirement accounts.  Potential for travel.\n\nJob details\n\n10 year contract \n\n1 day out of the month you must without fail religiously follow a broke degenerate around while throwing $1 bills on the ground once every min while low key singing \n\nMoney, money, money\nMust be funny\nIn the rich man's world\nMoney, money, money\nAlways sunny\nIn the rich man's world\nAha\nAll the things I could do\nIf I had a little money\nIt's a rich man's world\nIt's a rich man's world\n \nMust deliver a small Wendy’s value meal with most of the fries missing on a solid gold tray. \n\nOccasionally may need to complete short demonstration such as placing $100 bills in easter eggs filled with Opossum shit.  Then you will need to randomly drop these eggs in front of them while reminding them some asshole degenerate on Reddit got lucky on a massive YOLO that printed years ago and decided to troll you for 10 years.\n\nADDITIONAL KEY INFORMATION \n\nAt first the degenerate will resist picking up the dollars at some point will start to pick up a couple here and there and say “thanks for coffee!”  or some other nonsense they are somehow winning in this scenario.  \n\nFrom there the day will come when the degenerate will start to picking all of them up while keeping tally of his total.  It might happen on your shift or the next persons shift but at some point they will yell out “Aw Ha, this is enough for me to get back in the game.  I can buy 4 1 Delta 0DTE calls and that will make me enough to start rebuilding”. You’ll need to follow them to somewhere with free wifi, but you can go ahead and give them a hotspot if you’d like.  \n\nAt this stage they will be essentially addicted to the dollar bills you drop.  Pacing around waiting for the next $1 and scramming about to grab them.  Might run off to deposit them, but will be back quickly after depositing and transferring a few bucks to their Robinhood account.  You will now go from following to leading as the degenerate will follow you about to collect the dollar bills.  You’ll be leading the degenerate to some random places, visiting Wendy’s often and in the later years might need to coordinate having this degenerate follow the dollar bills to wall street and walk him around any lobby you get access to.  After this trip you’ll be dropping quarters.  The degenerate may resist again at first but ultimately will get right back to following you.\n\nNear the end of your contract you’ll need to lead the degenerate to wherever i maybe as a little blast from the pass surprise for me.  You’ll parade the quarter addicted degenerate around whatever area I’m in until I notice and say something like WTF? But I’ll eventually remember what’s going on and start laughing my ass off.  This will conclude your contract.", "score": 0, "replies": []}]}]}]}]}, {"body": "Thank you so much for the TLDR", "score": 16, "replies": []}, {"body": "I'd be more bullish on Nvidia if they WERE offering more. I think it's clear they're in a bubble. If they sell stock now then in 2 years when this bubble is over they'd be in a lot better place. This bubble can't last forever.", "score": 10, "replies": []}, {"body": "It's a bubble within a bubble. A truly dangerous place to be.", "score": 19, "replies": []}, {"body": "Love the TLDR", "score": 7, "replies": []}, {"body": ">It's clear that you don't understand what you're talking about. NVIDIA didn't file for a new shelf offering, they filed an amendment to their existing one. And as the quarterly report clearly states, this is purely for administrative purposes and there are no plans to actually use it anytime soon. So the bear narrative that the rug has been pulled out from under us is completely false.", "score": 22, "replies": []}, {"body": "NVDA only goes up", "score": 9, "replies": []}, {"body": "Surprise surprise...people on this sub intentionally spreading misinformation or otherwise doing something shady.\n\nIt really blows my mind how many bad actors are in this sub, including multiple mods (past and present).", "score": 13, "replies": []}, {"body": "I am a bear. I shorted Nvda at 250 and went long Avgo as a hedge. I am doing fine. I am not fucked as you say, op", "score": 9, "replies": [{"body": "Time to double down. If you didn't like it at $250, then you must hate it at $390.", "score": 7, "replies": [{"body": "Should probably short AVGO for good measure too.", "score": 3, "replies": [{"body": "Naah Avgo has actual revenue and dividend. It will just keep going up.", "score": 0, "replies": []}]}, {"body": "Honestly I would stop shorting in the future. Stocks are designed to go up unless the management really fucks up. So better to find stocks that you thing will double or triple rather than shorting something and then praying it will go down. I am really hoping Avgo, meta, jpm,etc would double or triple in next couple of years.", "score": 0, "replies": []}]}]}, {"body": "I’m inverse whatever the majority is", "score": 3, "replies": []}, {"body": "It’s all the “Lock the float” bros", "score": 3, "replies": []}, {"body": "even if they did offer $10b shares, thats like diluting an ocean with a teaspoon of water", "score": 15, "replies": [{"body": "So a teaspoon is 1% of the ocean now?", "score": 38, "replies": [{"body": "If you round up to the nearest full% it is.", "score": 30, "replies": [{"body": "This guy maths", "score": 10, "replies": [{"body": "Quick maffs", "score": 2, "replies": []}]}, {"body": "RoundUp(1 tsp/the ocean) = RoundUp($10B/$1T) = true", "score": 2, "replies": []}, {"body": "Gotttttt him!", "score": -2, "replies": []}]}]}, {"body": "Support that - but the misinformation campaign on this is running wild and seems like it’s being used to scare people that NVIDIA is rug pulling them, when that’s not the case. I’m just trying to clear it up.", "score": 3, "replies": [{"body": "That 4b guidance seems to be the rug pull initiator though. lol. If you dig deeper into the numbers, and include numbers from the actual chip manufacturers, as well as numerous other big enough companies that would buy NVDA, it just doesn't add up.\n\nNVDA has a history of lying and misguiding. Paid 5.5m fine last year (a slap on the wrist).\n\nCompared to billions generated by overhyping and misleading investors why on't do it again?\n\nHistory repeats itself. Especially when the CEO is a master at hype.\n\nFurthermore, should we take him seriously when he's sitting there with Cramer and Cramer is talking about NVDA being a 10 trillion dollar company in 10 years. For perspective, the US GDP is 23 trillion.\n\nMM's are in overdrive screaming buy NVDA. Louder and louder by day, while a few are pointing out fundamentals don't match the valuation.\n\nDo MM's scream gold mine when the gold is there or after it's been mined?", "score": 11, "replies": [{"body": "NVDA even admitted in their own call in their response to the first analyst question that their supply chain can't even support the level of wild guidance they threw out there and that it would actually take them several quarters", "score": 6, "replies": []}]}, {"body": "Paid troll of nvidia", "score": 2, "replies": []}]}, {"body": "It would be the equivalent of diluting a pint of water with a teaspoon. Still nominal, but definitely note worthy.", "score": 1, "replies": []}]}, {"body": "What it looks like to me is that they need cash to expand their manufacturing capacity and achieve what they promised. Since debt is expensive right now, they are considering going to the equity markets.\n\nWith the current run up, they can get 2-3x more cash than before jan for the same issuance of shares.\n\nOne could even think that they raised guidance to un-achievable levels in order to 1/ pump the stock short term, 2/ issue equity and 3/ fund their expansion. Like a self fulfilling prophecy, that would be a brilliant move.\n\nSo to me it’s highly likely that they WILL raise that cash through equity.", "score": 2, "replies": []}, {"body": "I didn't hold any positions in NVDA up until now.\n\nBut I will sure as hell start to short the fuck out of it next week.", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "*60% of the time*, it works ***every*** *time*", "score": 2, "replies": []}]}]}, {"body": "Great NVDA 1000 EOY", "score": 3, "replies": []}, {"body": "Thats the same thing ya fuckin goof.  Oh no we arent selling 10B shares were selling 20B\n\nRegard:  No guys they arent selling a NEW 10B in shares, theyre just adding it to the last sale", "score": 1, "replies": [{"body": "It’s really not. They’re not adding to a previous sale. They simply added some administrative amendments to their previous filing giving them the RIGHT to sell 10B. The total approved shelf is still the same $10 Billion from Feb. And they explicitly stated in the quarterly report that they had no intention of selling anything any time soon.", "score": 1, "replies": [{"body": "They already had the rights to sell 10B in shares.  \n\nIf this isnt the right to sell an additional 10B what is it exactly?", "score": 2, "replies": [{"body": "It’s literally an amendment to the previous shelf offer adding some administrative information to it. That’s it. They stated that they had to amend the earlier shelf offer in the quarterly report for administrative purposes AND that they had no intention of selling any of the $10B anytime soon.", "score": -1, "replies": [{"body": "Thanks for clearing that up", "score": 1, "replies": []}]}, {"body": "Bears have grabbed the amended filing out of context and are pushing it as a new $10B, and it’s literally not. It’s people people FUD.", "score": -1, "replies": [{"body": "Oh. Lmao. Wouldn’t matter a bit even if they did sold.", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "Lolol so true", "score": 1, "replies": []}]}, {"body": "There were posts like this about PLTR, claiming the dilution would be minimal, if anything at all. How did that turn out?", "score": -4, "replies": [{"body": "lol, the level of imbecile you have to be, to compare PLTR to NVDA.", "score": 20, "replies": [{"body": "I was comparing the dilution, not the company. Clearly, Palantir is ass. Haha", "score": -10, "replies": []}]}]}, {"body": "My eye on the chart says a decent placed put is justifiable if exhaustion begins showing ... oh ya an your bums look ripe for the taking", "score": -3, "replies": [{"body": "make sure to shave yours", "score": 2, "replies": [{"body": "🤘💩🤘", "score": 1, "replies": []}]}]}, {"body": "It's IKEA that makes shelves not NVDA", "score": 1, "replies": []}, {"body": "All I got was 🐻 dumb", "score": 1, "replies": []}, {"body": "Stock market loves misunderstanding.", "score": 1, "replies": []}, {"body": "Next upside target 700 ish", "score": 1, "replies": []}]}
{"title": "Calls on TSLA", "selftext": "", "id": "13u7sle", "created_utc": 1685299412.0, "score": 1084, "upvote_ratio": 0.9, "num_comments": 73, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|6 months ago\n**Total Comments**|4|**Previous Best DD**|\n**Account Age**|11 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Ballish on Telsa 🤑🤑", "score": 165, "replies": [{"body": "Tesla stock 📈📈", "score": 29, "replies": [{"body": "Always measure from the stock.", "score": 9, "replies": []}]}]}, {"body": "[deleted]", "score": 60, "replies": [{"body": "![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I came too.", "score": 4, "replies": []}]}]}, {"body": "Doctor: \"So, how did you find out that you have testicular cancer?\"\n\n\"My Tesla wouldn't start bro\"", "score": 59, "replies": [{"body": "Balls deep in calls now", "score": 12, "replies": []}]}, {"body": "What if u have no balls?\n\nI can't pull the trigger!!!", "score": 27, "replies": [{"body": "Pretty much all tesla owners. ![img](emote|t5_2th52|4271)", "score": 53, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 5, "replies": []}]}, {"body": "ClamScan™ is in the works", "score": 12, "replies": []}, {"body": "That’s what the bond market is for", "score": 5, "replies": []}, {"body": "Basically it’s Elon ‘running’ Twitter.", "score": 5, "replies": []}]}, {"body": "That’s Nuts!", "score": 42, "replies": [{"body": "I saw (read) what you did there", "score": 1, "replies": []}]}, {"body": "That's a typo: Balls on TSLA", "score": 15, "replies": [{"body": "r/Angryupvote", "score": 4, "replies": []}]}, {"body": "Absolutely…\n\nNew Model T looks good…\n\nhttps://preview.redd.it/bntdlwne7o2b1.jpeg?width=1242&format=pjpg&auto=webp&s=06a575a50ff067b2aea51cf81da715b3c800b0b2", "score": 11, "replies": []}, {"body": "Lance Armstrong is gonna have a hard time unlocking his Tesla.", "score": 12, "replies": []}, {"body": "Looking forward to the upcoming election. Something tells me candidates will be caught saying wild shit!", "score": 8, "replies": []}, {"body": "As if accidentally sitting on your balls wasn’t enough, now I have to purposely sit on them to unlock my car", "score": 4, "replies": []}, {"body": "You just have to teabag the handle in the parking lot at the 7-11 to open the door. Genius!", "score": 5, "replies": []}, {"body": "Not even three weeks ago wtf is this\n\nhttps://www.reddit.com/r/wallstreetbets/comments/13f7e3v/so_this_is_why_elon_stepped_down/", "score": 4, "replies": []}, {"body": "So am I being fooled by ai or is this a real interview? Cause thats some cutting edge tech we all need.", "score": 13, "replies": [{"body": "Deepfake. It's a famous one, and the tech already is so good that you can fake anything these days.", "score": 10, "replies": []}]}, {"body": "Why does this look like AI", "score": 3, "replies": []}, {"body": "What if I don’t have balls?", "score": 3, "replies": []}, {"body": "Great Elon, now felons be cutting off my sack just to steal my car.", "score": 3, "replies": []}, {"body": "Women teslas come with a mammogram machine preinstalled.", "score": 2, "replies": []}, {"body": "Lol!!!", "score": 2, "replies": []}, {"body": "wifey can’t drive the Tesla, and neither can her boyfriend so he has to buy his own, bullish", "score": 2, "replies": []}, {"body": "Ow my Balls", "score": 2, "replies": []}, {"body": "So what about for female drivers? Vagiscan?", "score": 2, "replies": []}, {"body": "Also in low end such as Model 3, a rod will come out from middle of the seat and get jammed in your rectum to verify your identity.  This tech would be called ASS-ID.", "score": 4, "replies": [{"body": "They licensed that from Mac.", "score": 4, "replies": []}]}, {"body": "Such a douche. Needs a ball washer installed.", "score": 2, "replies": []}, {"body": "I don’t think that’s him.", "score": 1, "replies": []}, {"body": "u/savevideobot", "score": 1, "replies": [{"body": "###[View link](https://rapidsave.com/info?url=/r/wallstreetbets/comments/13u7sle/calls_on_tsla/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideobot)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/wallstreetbets/comments/13u7sle/calls_on_tsla/) &#32;|&#32; \n [^(pinterest video downloader)](https://ptsave.com) &#32;|&#32; [^(twitter video downloader)](https://twitsave.com)", "score": 1, "replies": []}]}, {"body": "No mames.", "score": 1, "replies": []}, {"body": "So now everyone trying to steal a Tesla will do so with their balls. Does it scan vaginas?", "score": 1, "replies": []}, {"body": "AI sucks but this is funny.", "score": 1, "replies": []}, {"body": "I know this is fake because Elon doesn't normally speak this eloquently", "score": 1, "replies": []}, {"body": "And a fun side effect if this means Women can't drive!", "score": 1, "replies": []}, {"body": "Gotta get that ball data, Daddy. How's ai sexbot going to know what a nut sack feels like without the proper data homie.", "score": 1, "replies": []}, {"body": "It takes nuts to do that!", "score": 1, "replies": []}, {"body": "this will never not be funny, i hope someone recreates this every time AI gets betters and eventually even we see it hundreds of times we don't know if its real", "score": 1, "replies": []}, {"body": "You meet a beautiful girl out in the town, she offers you a ride back to her place and her testicular detection ignition kicks off.......what do you do?", "score": 1, "replies": []}, {"body": "calls or balls, I am confused", "score": 1, "replies": []}, {"body": "Deep Fake", "score": 1, "replies": []}, {"body": "Calls on Balls 😎📈", "score": 1, "replies": []}, {"body": "Omg what’s next 🤣", "score": 1, "replies": []}, {"body": "If this isn't a deep fake I'd call on activist investors to get him 302'd.", "score": 1, "replies": []}, {"body": "Imagine if he actually talked that clear without saying “umm” every 5 seconds", "score": 1, "replies": []}, {"body": "🤑", "score": 1, "replies": []}, {"body": "😭😭", "score": 1, "replies": []}, {"body": "Passenger seat display as well? For those drunken nights out in order to stop misunderstanding later.", "score": 1, "replies": []}, {"body": "Will your Tesla also seek out trans people to run over on its own?\n\nScrew this fascist", "score": 1, "replies": []}, {"body": "Maybe that will finally make MAGA buy his killing machines, he calls, Cars 😳\n\nTucker Carlson would love it😂", "score": 1, "replies": []}, {"body": "has to be fake", "score": 1, "replies": []}, {"body": "As if people who buy Teslas have balls", "score": 1, "replies": []}]}
