{"title": "How to make money when the auto loan bubble bursts?", "selftext": "[deleted]", "id": "3ug6a4", "created_utc": 1448616049.0, "score": 7, "upvote_ratio": 0.89, "num_comments": 19, "comments": [{"body": "Who takes out an ARM for a car? ", "score": 11, "replies": [{"body": "Idiots. ", "score": 6, "replies": []}, {"body": "Very few, the problem occurs when the cost of servicing other debts (mortgage, credit, etc) increase making the car less affordable.  The \"bubble\" is again subprime borrowers.", "score": 1, "replies": []}, {"body": "What does an ARM have to do with my question about the car loan bubble?", "score": 0, "replies": [{"body": "If you get a loan today, how would rates changing tomorrow affect you? ", "score": 3, "replies": [{"body": "Adjustable rates aren't my main concern.  My main concern is a slowing economy.  At some point (probably soon), the economy is going to slow down, and people who extended themselves to buy a car, a house, etc, are going to be in financial pain.  Doesn't matter whether they have fixed rates or not - as soon as mass layoffs begin, expect to see defaults and bankruptcies left and right.", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.3442 \n > [What is this?](https://pastebin.com/64GuVi2F/06447)", "score": 5, "replies": [{"body": "Same people who use access cards to buy steak and lobster.", "score": 7, "replies": []}, {"body": "if the interest rate is low your an idiot not to stretch it out as far as possible", "score": 8, "replies": [{"body": "This is the correct answer.  OP is missing part of the puzzle.  People are taking longer loans in part because rates are so low AND locked.  The portion of auto loans on ARM's is negligible.  He is correct that there is a bubble of under qualified \"subprime\" borrowers who will get into trouble when the interest on their other debt's go up.\n\n  ", "score": 9, "replies": []}, {"body": "*you're. But, yes.", "score": 1, "replies": []}]}, {"body": "I did a 72 month because my industry is in a serious downturn. That being said I'm paying 4x my normal payment each month. \n\n\nEdit: still have a low interest rate and am paying 4x the minimum payment. Did 72 month incase I get laid off. I'm no fool. ", "score": 4, "replies": [{"body": "rofl", "score": 3, "replies": []}, {"body": "You are doing it right! You are helping your credit score. FICO likes for you to have an open installment loan on your reports and gives you points for it. You get more points once you get below 20% remaining balance from starting loan balance. Some people (With money!) get a loan for as long as possible, pay off 90% with the second payment and then just let it ride for years without making payments. This keeps their scores boosted. You can gain as much as 40 points this way.", "score": 3, "replies": [{"body": "Yeah I got a huge bump by getting this loan. ", "score": 1, "replies": []}]}, {"body": "wow lolololololol", "score": 1, "replies": []}]}]}, {"body": "I dunno man, short shit. Just fucking short it. Short all of it. Short it all!", "score": 1, "replies": []}, {"body": "I want to short the student loan bubble.\nedit:(in Edward Norton's voice)", "score": 1, "replies": []}, {"body": "Auto lenders:\n\nALLY\nBOFI\nCOF\nSC\nNICK\n\nAll having varying exposures and credit quality.", "score": 1, "replies": []}]}
{"title": "Everything over 100$ is overvalued as fuck.", "selftext": "TSLA GOOG AMZN AAPL DIS are all shit and you should not buy them.\nYou're better off investing in dildos, then sticking them up your ass.\n\nThey'll probably not rise much more and you're just a sitting duck to banktuptcy. Please dont go into defensive-fanboy-mode, just because you put some money into these shitty stocks. Just acknowledge your mistake and buy something like AMD.", "id": "3ui387", "created_utc": 1448654951.0, "score": 0, "upvote_ratio": 0.09, "num_comments": 13, "comments": [{"body": "[deleted]", "score": 16, "replies": [{"body": "nah, ass dildos are on the up and up\n", "score": 3, "replies": []}]}, {"body": "What is this garbage", "score": 6, "replies": []}, {"body": "You are a fucking moron.\n\nThe fucking share price has nothing to do with the fucking value of the fucking stock.\n\nAAPL /= APPL dumb fuck.", "score": 4, "replies": [{"body": "i wrote that u fgt", "score": -11, "replies": []}]}, {"body": "Brk.a most overvalued stock by a landslide. Has many more digits so its the most overvalued /s", "score": 3, "replies": []}, {"body": "Fuck too bad you didn't tell anyone that AMZN was overvalued when it hit a hundred. You totally could have saved people from a 600% gain in 6 years", "score": 7, "replies": []}, {"body": "#fgt", "score": 5, "replies": [{"body": "u mad?\n\ntold you to not go into defensive faggot mode. ", "score": -12, "replies": [{"body": "*i'm SnugDD. i'm a fgt*\n\n\n\n\n*Everything over 100$ is overvalued as fuck.*\n\n\n\nu don't know shit about stocks\n", "score": 4, "replies": [{"body": "stfu go to 4chan if your gonna be a lil fag", "score": -13, "replies": []}]}]}]}, {"body": "You forgot dis you fucking vanguard pleb", "score": 4, "replies": [{"body": "i didnt", "score": -9, "replies": [{"body": "I see that star next to your post", "score": 6, "replies": []}]}]}]}
