{"title": "Netflix switches from \"star\" review system to \"thumb\" reviews. I hate this. How do I short?", "selftext": "", "id": "66vqua", "created_utc": 1492864761.0, "score": 269, "upvote_ratio": 0.91, "num_comments": 109, "comments": [{"body": "All because a shit comedian got the ratings she deserves", "score": 313, "replies": [{"body": " Let me guess fat pig whore Amy Schumer?", "score": 207, "replies": [{"body": "I googled and I was right. Telling that it was so obvious. She's the least funny comedian I've seen I don't understand why she has any following. Angry feminists and white knight cucks are her fan base. I bet they don't even watch her stuff, just voice their love for her out of some sense of duty to the cause.\n\nNot to mention her fat whoring tv commercials - fucking bud light? Old navy? R u fucking serious? George Carlin rolling in his grave.", "score": 128, "replies": [{"body": ">Schumer’s The Leather Special is currently facing a deluge of not-so-nice press thanks to a mixed bag of critical reviews and what appears to be an alt-right (i.e. “white nationalist”) group on Reddit.\n\nI love how these media faggots think you can't downvote a fat pig who steals jokes and isn't funny without wanting to cook some jews.\n\n>Splitsider, meanwhile, did some digging and discovered concerted efforts on the r/The_Donald Reddit forum to bury Leather Special‘s ratings average into the ground. “To those that still have Netflix,” wrote one user, “please go and 1 star that piece of shit.”\n\nAHHH okay, so The_Donald is a \"white nationalist\" group now? LOL and 1 guy making a comment = organized downvote campaign? ", "score": 86, "replies": [{"body": "What a stupid fucking solution. People still brigade YouTube ratings, and those are binary. They should learn from Amazon and weigh ratings based on how much of a movie someone has actually watched; Amazon weighs \"verified owner\" reviews above others.\n\nAlso, fuck Schumer. She is disgusting. I don't even understand who her audience is. Hilarious how \"alt right\" and \"Russia\" bogeymen get blamed for shit like this.", "score": 41, "replies": [{"body": "what are the point of crowd sourced ratings if you don't want all users to vote however they please? If you want \"accurate\" ratings hire people whose opinions you trust and are well informed on the subject. I personally don't think that's worth a damn but if you want the real ratings then you can't manipulate the results and if you want the \"right\" ratings then you shouldn't let people determine it whom you dont trust.", "score": 4, "replies": [{"body": "tl;dr u can choose to spez or just leave things alone, just make sure to keep it quiet if u choose to spez", "score": 3, "replies": [{"body": "This comment has been edited.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "I look forward to the future article \"WSB a rogue market manipulating investment brigade on Reddit are responsible Schumer's career demise\"", "score": 9, "replies": [{"body": ">Today a SpaceX rocket exploded after it was found that a Ryzen graphics card had been lodged in a critical area near the booster. The terrorist responsible left no trace except for the following cryptic note:\n\n>[**AyyyMD to the mooon!**](https://www.reddit.com/r/AyyMD/comments/5havpa/view_from_lisa_sus_window/)", "score": 22, "replies": []}]}, {"body": "It's a cabal ", "score": 2, "replies": []}, {"body": "if it were any good wouldn't you have people campaigning to 5 star the shit out of it for equality or whatever?", "score": 2, "replies": []}, {"body": "> LOL and 1 guy making a comment = organized downvote campaign?\n\nI think they're starting to catch on to the true driving force of society - autism.", "score": 1, "replies": []}, {"body": "I agree with everything you said, *except*...\n\nThe_Donald is a pretty far cry to make an argument that it's *not* a white nationalist group. I've seen more tempered discussion from Klan members.", "score": -4, "replies": [{"body": "T_D is clearly not a \"white nationalist\" group. It is a group is conservative and libertarians inclusive of all races. This is just a liberal smear because liberals claim that anyone who isn't liberal is automatically a racist who hates women.\n\nThere is nothing wrong with being nationalist. All Americans should love their country and put it first in world affairs. It is a contrast to those liberal \"citizens of the world\" who are ashamed of America and shit on their own country every chance they get because they hate capitalism and freedom. People like Sean Penn sucking Chavez's dick every chance he got, and so forth.", "score": 11, "replies": [{"body": "From literally anybody on the outside, The Donald is about as white nationalist as you get short of wearing a confederate flag while spray painting nazi slurs on a black baptist church. And I actually liked David Cameron. T_D is not conservative. It's boarderline rabid.", "score": -4, "replies": [{"body": "Saying stupid shit like that just shows that you don't actually read or follow T_D, and get all your information about it from liberals who keep trying to misrepresent it as being extremist for political purposes. \n\nYou're just a typical low information reddit liberal. I bet you believe that the Venezuela protests are because someone donated money to Trump because Rachel Maddow said so, right?\n\nT_D is just a reddit sub full of internet people who love America and Pepe memes, and who are sick of the liberal circlejerk that mindfucks all the other major subs into groupthink.\n\nI've been banned on many of the biggest subs simply for posting something that was articulate, well researched, and against the party line. Liberals are cancer when it comes to free speech.", "score": 13, "replies": [{"body": "I have 6.7k karma on my T_D throwaway. Maybe only 20% are true blue white nationalists, but it's not like most people there are exactly allergic to the stuff. The real WN hive was Mr_Trump. That place was more like what he described. The ratio in T_D is/was slightly more balanced.\n\n I think we all know the truth though: most of this is disingenuous tribal games. The people vouching for the lack of racism in T_D are just as sincere as the people there who will gladly take you through the 'ol \"Hitler wasn't racist\" argument. ", "score": 2, "replies": [{"body": "white = okay\n\nnationalist = okay\n\n\"white nationalist\" = some kind of racist confederate flag waving bunker dwelling militia member\n\nwe all know that \"white nationalist\" is really liberal code for the \"basket of deplorables\" that Hillary mentioned. It does not literally mean any nationalist who is also white. \n\nin the way you use the term, maybe 1% or less are white nationalists, and if any \"true blue white nationalist\" posted racist shit at T_D, he would get heavily downvoted if not outright banned.\n\n>the 'ol \"Hitler wasn't racist\" argument. \n\nHonestly, after reading Speer's book, I don't really see Hitler as a racist. Being a racist means that he would take racism as one of his deep core motivations and draw policy from it. Instead, Speer pointed out that Hitler was more of an opportunist who grabbed or discarded ideologies and beliefs based on whether they served his grand vision or not. \n\nHitler caused the deaths of millions of jews and millions more of other groups. He ALSO said racist things sometimes. He ALSO said things that flatly and completely contradicted the whole superficial party line of nazi racist ideology. \n\nGod forbid that I have an opinion that is not in COMPLETE alignment with one of the liberal golden calves, though, I MUST BE A NAZI, AMIRITE? or a fascist, or whatever else you libcucks call conservatives and libertarians these days.\n\nThe fact that you even HAVE a T_D throwaway is pathetic. I don't go on TwoXChromosomes and pretend to dish feminist shit because I'm just soooo obsessed with feminists. If you were able to get any dirt with your pathetic little false flag operation, I'm sure you would have posted it by now.\n\nThe fact that you admit to having a false flag account just proves to me that the most paranoid shit I've seen on T_D, the existence of those accounts, was more valid that I was willing to admit.", "score": 1, "replies": [{"body": "You heard it here first folks: T_D is just as not racist as Hitler.\n\n So where do we stand with the KKK now? I heard they recently started saying [they aren't racist as well](http://bigstory.ap.org/article/b0256e138327481ebcba6e23e2d03957/white-supremacists-not-exactly-kkk-and-other-groups-claim). Guess we can't know what's in their hearts. They're probably avowed anti-racists like T_D, [Hitler](https://archive.org/stream/AdolfHitlerAnti-racist/adolf-hitler-anti-racist-archive_djvu.txt), and MLK. Now you know who was clearly super racist? Obama. I dare say he is more racist than Hitler - which, I know, isn't saying much. How much of this do you agree with, buddy? ", "score": 1, "replies": [{"body": "I dont think the KKK has existed in any serious way in my lifetime outside of fake/joke appearances on Maury or whatever to get chairs thrown at them, maybe back in the 80s.\n\nThe KKK was obviously a racist organization at its core, since the whole point of the KKK was to undo the Civil War and subjugate blacks. \n\nPeople over at T_D don't think Obama was racist, but a substantial number of them DO think he is muslim, and lied about his birth certificate. I don't agree with that, but I don't think that makes those people \"white nationalists\".", "score": 1, "replies": [{"body": "T_D would [*never*](http://i.imgur.com/GJG14DL.png) massively upvote posts calling Obama racist. The nerve though - calling Obama \"the most racist president we've ever had\". He's the *only* racist President we've ever had. I mean, can you think of any? I sure can't. Even Hitler wasn't racist, so I doubt any former US Presidents qualify. ", "score": 1, "replies": [{"body": "You are doing a very bad job of switching between sarcasm and a bad Colbert impersonation. You're not witty. You might notice that we might as well be in PM because literally no one is reading this except you and I. \n\nSo what if some people upvoted a post saying obama = racist? Honestly, who gives a shit? I don't. \n\nDo you honestly think that you've uncovered some kind of dissonance or inconsistency? You realize that T_D has 6 million unique daily visitors. The people saying \"Hitler was not racist\" and saying \"Obama is racist\" are not necessarily the same people. Two different groups of people could hold those views pretty easily depending on how they define what \"racist\" means.", "score": 1, "replies": [{"body": "Lol I'm reading this and you are a fucking idiot.", "score": 1, "replies": [{"body": "that post is 2 days old, libcuck. get with the times.", "score": 0, "replies": [{"body": "Somehow I dont think you stopped being retarded.", "score": 1, "replies": [{"body": "I dont care what some cuck like you thinks. Actually, I'm happy that my posts triggered you. Shows I'm doing the right thing.", "score": 0, "replies": [{"body": "You're the one who got triggered bud.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "On a scale of one to pizzagate?", "score": -1, "replies": []}]}, {"body": "Journalism is shit these days and it takes less time and effort to visit T_D yourself and draw your own opinion than it does to let people feed you one. As an added bonus you don't have to take anyone's word for it.", "score": 3, "replies": []}, {"body": "I think that was about the most retarded thing I've read on this sub.\n\nNo one liked David Cameron in The_Donald because he wasn't a conservative, he was a pro-immigration dipshit who opposed Brexit.\n\nThe_Donald is pretty moderate in real life, compared to the rest of Reddit it's extremely right wing.", "score": 1, "replies": []}]}]}]}, {"body": "Have you been on there? A lot of the shit that gets upvoted there has a clear white nationalist vibe.", "score": -10, "replies": [{"body": "Like what? The [black guy who was challenging the Antifa fag?](https://www.reddit.com/r/The_Donald/comments/66e3qu/antifa_cuck_gets_punked_the_fuck_out_by_dude_in/)\n\nso white\n\nso nationalist\n\nor how about [this](https://www.reddit.com/r/The_Donald/comments/614veu/yesterday_timothy_caughman_was_murdered_by_a/), the top post of the last month ", "score": 15, "replies": [{"body": "Did I say every post / poster on that sub is like that? I don't see how two links that aren't problematic mean dick. Here's one with some pretty cringey upvoted comments: https://www.reddit.com/r/The_Donald/comments/66vauk/lying_crooked_media_pandering_to_muslims_as_always/?st=J1TK459Z&sh=0727b217\n\nI'm not saying most people on that sub are alt right crazies, but they do tend to flock to it.", "score": -11, "replies": [{"body": "the things that people are bundling into the term \"white nationalism\" at this point aren't even bad. It's totally undermining the historical weight of the term. People are concerned that different and uncompromising cultures are increasingly represented in their home. At this point white nationalist means you are white and want to conserve your heritage.", "score": 10, "replies": [{"body": "Yeah. Sure. But also, I've seen upvoted posts advocating the rape and enslavement of all inferior races in order to spread superior Nordic genes. And got downvoted when I protested. And there's a lot of people with 14/88 in their name. Some threads are worse than others, but the [subreddit algebra](https://fivethirtyeight.com/features/dissecting-trumps-most-rabid-online-following/) doesn't lie. I really doubt anyone who has spent any significant amount of time there doesn't know what kind of place it is. It not as bad as /r/Mr_Trump was - that forum was completely overt about it.  \n\nedit\n\nFor the record, I'm a civic nationalist, so I'm not someone who just smears everyone with a different opinion on immigration.", "score": -2, "replies": [{"body": "Show me the posts, show me one post that promotes rape and white nationalism you fucking liar.", "score": 8, "replies": [{"body": "The mod team has pretty good about deleting the posts after I report them, but [here's screenshot of what one of my replies looked like](http://i.imgur.com/myj4CU9.png) before it was removed.  Man, trekked through a lot of post history on my T_D account for this one.\n\nedit\n\n[This one](https://www.reddit.com/r/The_Donald/comments/4dxsip/george_fucking_patton/d1vbdkf/) is a gem that didn't get deleted. You might think nothing of this one, but it pretty clearly is something you'd see on /pol/. I've no joke had an argument with a guy on T_D claiming \"Hitler wasn't racist\" so I expect anything at this point. ", "score": 1, "replies": [{"body": "But that isn't a way to actually day the majority if the sub supports that behavior and way if thinking. It's exactly the opposite. Their are fringes on every side and I have seen the anti white and anti Christian posts all over reddit but the majority of people don't think this way. To actually say that the sub as a whole is racist and supports white supremacy is an outright lie and anyone saying that should be ashamed. ", "score": 3, "replies": []}, {"body": "In all honesty, Hitler was racist or not racist depending on whatever suited him at the time. He praised the Japanese as honorary Aryans or some shit. \n\nHitler did not have a coherent consistent philosophy beyond his own megalomania and wanting to kick everyone's ass and conquer shit (but not the UK because those guys are alriiiight) basically. ", "score": 2, "replies": [{"body": "Yeah, no. Hitler was a racist. Jfc. \n", "score": 2, "replies": [{"body": "am I a neo nazi now because I happen to know more history than you do? because I don't have a two dimensional black and white worldview? \n\nhitler said a lot of racist shit because it helped advance his agenda, and then he later contradicted it when THAT advanced his agenda. if you're keeping score, it means the guy was opportunistically using racism, as opposed to a deep down true racist.\n\nexcept for the jews, but that's a religion, not a race. anti-semitism is not the same as racism.\n\nalso, the russians/slavs were/are white, and yet hitler talked plenty of shit about them.", "score": 3, "replies": [{"body": ">am I a neo nazi now\n\nWow, are you insinuating that Neo-Nazis are racist? Jeez, man, even Hitler wasn't a racist.\n\n We've reached new levels of insight here, friend. Thank you for supplying your vastly superior historical knowledge. ", "score": 4, "replies": [{"body": "It must be nice to think in such simple black and white terms. Ignorance is bliss. \n\nI don't think you understand what racism really is or how racists act.", "score": 2, "replies": [{"body": " I've been going through life thinking Hitler and Nazis were racist. You've totally changed my entire black-and-white view of the world. I feel like a robot being booted up for the first time. ", "score": 2, "replies": []}]}]}, {"body": "\"Jews aren't a race\" \n\nWow ok lol. Idiot.", "score": 1, "replies": []}]}]}]}, {"body": "Fukkin snitch\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "How should a white person conserve their heritage? How is your heritage being threatened?", "score": -1, "replies": [{"body": "Notice how I didn't say white heritage and you are the one conflating the two ideas? You're introducing the racial overtones.", "score": 2, "replies": [{"body": "Uhhh maybe reread the last sentence of your comment about being white and preserving your heritage? I'm not conflating anything. Are you retarded by any chance?", "score": 2, "replies": [{"body": "swedish, irish, english, etc. Shall I go on?", "score": 1, "replies": [{"body": "No reason to because that is completely beside my point. How are those cultures being threatened in this country?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Those 2 posts were major, highly upvoted posts, and they contradict your narrative.\n\nSo what comments do you have a problem with? Comments mocking how the liberal media refuses to associate muslims with terrorism?\n\nSecond, WSB has way more cringe posts than T_D does. I mean: https://www.reddit.com/r/wallstreetbets/comments/651cnt/as_a_jew_i_look_for_technical_signals_on_charts/\n\nIf a post like that was on T_D you would see it on MSNBC", "score": 11, "replies": []}, {"body": "Yea and I mean this sub tends to attract braindead autists so that explains your post", "score": -1, "replies": []}]}]}]}]}, {"body": "She literally is what is wrong with this country summed up into the inverse Dave Chappelle. She makes me cringe and I wouldn't fuck her with your dick.", "score": 18, "replies": []}, {"body": "Watch her 12 angry men sketch", "score": 2, "replies": [{"body": "Any idea where I can see it? Youtube wants me to pay 18.99 for that shite", "score": 2, "replies": [{"body": "Wow was free. Can't find it anywhere else oh well", "score": 1, "replies": []}]}]}, {"body": "And her uncle is the fucking Schumer clown", "score": 1, "replies": []}]}, {"body": "That's offensive... To pigs.", "score": 26, "replies": [{"body": "and whores.", "score": 12, "replies": [{"body": "And fats.. they're not as bad as the man says they are!", "score": 7, "replies": []}]}]}, {"body": "No humor schumer", "score": 11, "replies": []}, {"body": "**HEY!**\n\nAmy Schumer is smart and funny. Get over it. \n\n", "score": 1, "replies": []}]}, {"body": "I gave that stand up a shot, I watched up until when she said she loves cum so much she wants to make snow angels in it and couldn't fucking take it a second longer (like 15 minutes in).  I dont wish she was dead like most of y'all probably do but I 100% support the no star rating", "score": 13, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Oooo, that could be it too. Fucking ridiculous shit man. Could you imagine the reaction about a show called \"Dear black people\" ? xD", "score": 2, "replies": []}]}, {"body": "It's more than that.  Netflix originals started out as great 5 star material but now they have released some bad ones and they are butthurt about it.", "score": 3, "replies": []}, {"body": "I thought this was r/t_d for a second lmao", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Are you lost?", "score": 1, "replies": []}]}]}, {"body": "Netflix reviews are pretty useless anyways. They only help to hightlight obviously bad shows but otherwise it's never a good reflection of the true quality of films/shows. I like watching foreign language films on Netflix and under every one of them there's always some shithead who can't read for their god forsaken lives complaining that they have to watch the subtitles and giving out 1 stars.", "score": 36, "replies": [{"body": "I use rotten tomatoes audience score - way more accurate than other methods on whether I'll enjoy it.", "score": 3, "replies": []}]}, {"body": "Yeah this shit is wack", "score": 10, "replies": [{"body": "Word. Shit is wack yo.", "score": 2, "replies": [{"body": "True. Shit is wack bruh.", "score": 2, "replies": []}, {"body": "https://i.imgur.com/IMvvoCa.gifv", "score": 0, "replies": []}]}]}, {"body": "I don't see a big issue, but maybe I'm just not on Netflix enough to care. I had always heard the star system was a convoluted aggregate system that was misleading, but again I'm not on there enough to be scouring for new stuff to watch based on stars. I just use Instantwatcher.com.", "score": 6, "replies": []}, {"body": "You know, there's a pretty easy way to short Netflix", "score": 7, "replies": [{"body": "Buy everyone in your family a hulu account and meet friends abroad and buy them a VPN so they can get accounts for all the american only online content providers?", "score": 3, "replies": [{"body": "Personally I was thinking more along the lines of raising millions of dollars to start your own competing streaming video/production company, but yeah that might be cheaper ;-)", "score": 2, "replies": [{"body": "wow, the answer was right there in front of me and i didn't see it. It's so obvious now. Now I definitely know the easiest way to short netflix", "score": 4, "replies": []}]}]}]}, {"body": "just paypal me whatever you are willing to spend to short it. I'll send you a care package from the moon later.", "score": 7, "replies": []}, {"body": "Meh, the star rating system was junk anyway. It wasn't an aggregate rating, it was a rating of users in a cohort of \"people like you\", which for someone like me who watches a wide variety of stuff meant that one day something would have 5 stars and the next 2. Not useful.\n\nI'm not sure thumbs up/down will be better, but I won't miss the stars. I don't use those ratings to determine whether I'm going to watch something because I understand how generally useless they are.\n\nMaybe if all you ever watch is modern housewives they can point you in the right direction, I don't know.", "score": 22, "replies": [{"body": "Why is that not useful?  That tells me if I will like it not how it fares in some global award contest ", "score": 11, "replies": [{"body": "It is useful. He's doesn't know what he is talking about. What Netflix is doing is called collaborative filtering. It figures out what people who vote and are like you would vote on a movie you haven't watched yet. It also takes into account peoples tendency to be more positive or negative then the general population and normalizes it. It is miles better than the average vote of the whole population. You'll end up with a list like imdb's top 100, of which I personally wouldn't touch half of.\n\nThe primary reason to remove ratings and stick to up vs down, is that people tend to be polarizing when they vote. If you bother voting, then you either really hated it or really loved it, so movie votes tend to be extreme. It's also easier to get users to actually vote when it's just an up-down.", "score": 4, "replies": []}, {"body": "Did you even read his comment", "score": 7, "replies": [{"body": "Of course not, reading is for fags", "score": 23, "replies": []}]}, {"body": "I'm referring to the fact that it regularly changes & tells me nothing about the audience that likes it or the audience that doesn't like it. It tells me that I may or may not like it. I could say the same thing about everything in the universe.\n\nIf you think something being 5 stars one day and 1 star the next tells you you'll like it, then good for you. For me, 1 star is not good enough, but 5 stars seems great. I'm more likely to watch something that's 5 stars than 1 star. Something that is both is just confusing as fuck.", "score": 1, "replies": []}]}, {"body": "I mean, youd be a fool not to segment/cluster ppl for taste, i dont have the same tastes as someone who reads breitbart and using that person to make an aggregate prediction of me is a mistake", "score": 3, "replies": [{"body": "Agree to disagree. I prefer good old fashioned aggregate ratings - if enough people from different cohorts agree something is great, I find that frequently that thing actually is great. If it aligns with critic reviews, the odds are even better. This is why rotten tomatoes is so useful, whereas Netflix ratings are not.", "score": 1, "replies": [{"body": "Agree as well. people rating a documentary are likely people that like documentaries. They're a good judge. If I'm looking for a documentary but never watch them then I'll trust what people who are into them have to say so I can see what they have to offer. But if they're all shit or wildly across the board from my peer group then I don't have any useful information to work with.", "score": 2, "replies": []}, {"body": "Maybe they could have a bell curve that visually represents the ratings that people who have similar tastes have given compared to the average  of everyone else ", "score": 1, "replies": []}]}]}, {"body": "What if they have a category of people who watch a wide variety of things and that is the peer group they use for you?", "score": 2, "replies": [{"body": "Could work, but I don't know - whatever they're doing now doesn't seem to work and I doubt they aren't trying to do that. Besides, there's also an element of the fact that... ok yes I've watched anime every day for 3 hours for the last 2 weeks straight. Should that mean 90% of the anime on Netflix deserved a 5 star rating? Most of it is still average material, makes it difficult to discern what is going to be high quality vs what is simply an anime when Netflix believes I have no qualifications past it being anime. I've started watching WAY too many 5 star Netflix things that to me are at best a 2-3.", "score": 1, "replies": []}]}]}, {"body": "Buy $BLIAQ\n\n\nNow's their time to shine. ", "score": 4, "replies": [{"body": "How is it still a stock?", "score": 1, "replies": [{"body": "The Q gives it immortality", "score": 3, "replies": []}]}]}, {"body": "http://www.dailymail.co.uk/tvshowbiz/article-4318068/Amy-Schumer-blames-alt-right-poor-reviews-special.html", "score": 3, "replies": []}, {"body": "I wouldn't watch stuff 2 stars or lower.  I always wanted a system where I could search by 5 star only.  Seems like in searching through endless pictures there was a allot of filler movies/shows I never wanted to watch but kept having the cycle through looking for something new", "score": 2, "replies": []}, {"body": "Star systems are bullshit anyway. Giving something a score other than 1 or 5 stars is as useful as voting third party.", "score": 2, "replies": []}, {"body": "Puts on Netflix... duh.", "score": 1, "replies": []}, {"body": "If you have to ask \"how do I short?\" then don't.", "score": 1, "replies": []}, {"body": "They tried this in a few thousand households as a pilot program, and are rolling it out world wide due to the higher rate of rating responses given the simpler system.  Simpler=better=$$$\n\nhttp://www.theverge.com/2017/3/16/14952434/netflix-five-star-ratings-going-away-thumbs-up-down", "score": 1, "replies": []}, {"body": "Wait you're asking how to short Netflix? Maybe you shouldn't be trading because there are a a few possible ways to do what you want and the fact that you don't know about them suggests that you did no research whatsoever on how to accomplish this.", "score": 0, "replies": [{"body": "How to short netflix. Not how to short. \n\nAss.", "score": 7, "replies": [{"body": "You're joking right? It's a popular publicly traded stock, you can short it very easily.", "score": -1, "replies": [{"body": "It was a rhetorical question. Sad.", "score": 4, "replies": []}]}]}]}]}
