{"title": "Understanding and Attacking Trader Anxiety: (A Long Read For Serious Traders who Have Issues with Trader Anxiety)", "selftext": "&#x200B;\n\n[Mitigating Anxiety is Mitigating the Unknown, and Mitigating the Unknown is Mitigating Downside Risk](https://preview.redd.it/p7iethoi3fz71.jpg?width=3907&format=pjpg&auto=webp&s=0576d1b2c223bce6cb25dbb3e47bcdc661b5fe4a)\n\nNote: Its a long post. Please don't forget to upvote if you like the content. I worked hard on it and I want folks who experience trader anxiety to benefit from my work. Over 5000 words, 15 minute read.\n\n**Overview:** For those of you who consider yourself seasoned traders, ignore this... although I promise you that you will learn something. For those of you who have anxiety issues I think this will prove to be an invaluable resource. I'm going to put a lot of time into writing this and it is directed at those who have high amounts of anxiety while trading in the markets.\n\n# Reddit is an Enabler of Trading Anxiety:\n\nBack in the day I used to post a metric ton of highly detailed DD on Reddit. I posted my research on Reddit for a simple reason ... I wanted feedback ... I wanted to crowdsource my DD. One of the primary issues I continued to run into was few, if any, added any substantive value in the comment section. I would post DD and 2-4 weeks later I would get a flood of comments of folks who never commented on the thread before, but nevertheless tanked me for all the money they made as a result of reading and taking action on a ticker I wrote about. It was then I noticed that people on Reddit are frequently looking for justification to throw money at anything that may bring them a return. As it turned out the information I posted provided that justification. But this was not the reason I posted the research. Once again, I wanted to crowd source DD.\n\nI stopped posting DD on Reddit altogether. It was a lot of work for too little feedback. I can do a complete deep dive & workup on a company in my head with a pad and pencil within an hour. Putting it all together and posting the information takes considerably more time. I realized that there is a large segment of people who wanted to be told what to invest in with a detailed summary as to why. They generally want to know  the risks, they want to know the possible rewards, and they wanted to know when to buy in, average down, and sell. I therefore opted instead to publish a daily newsletter instead of positing on Reddit.\n\nPeople on Reddit are buying what they don't understand with information posted by people they ought not to trust. A great deal of DD on Reddit only comes about when some poor fella is bag holding deep and suddenly realizes that he/she wants to share the amazing value with the world under a misguided understanding that they may be able to generate undue interest in the stock. DD on Reddit is bag holders paradise. DD posts on Reddit nearly always means the author is losing money. Remember more recently when SNAP, WISH, or PTON dumped on very poor earnings? Did you happen to notice all the DD that was posted on those tickers days to weeks after? Those were bag holders folks. In part, their anxiety from their losses led them to the desperation of taking to Reddit to pitch trash.\n\nReddit is a trash heap of poorly written \"DD\" and bad advice. For every solid bit of analysis found on reddit there are thousands of poorly written items that are neither \"due\" nor \"diligent.\" How much \"DD\" have you seen posted, for example, with absolutely no consideration for the risk factors? If they're missing a risk section can we honestly say they're being \"diligent\" ... or are they just trying to pump a stock? And there are plenty of new retail traders who have absolutely no clue what they're doing for these fellas to prey on.\n\nThere is a reasons so many new retail traders are taking to Reddit for answers. Reddit has received a lot of attention in the media as a result of the GME/AMC fiasco. So new retail traders see Reddit as a place to look for guidance, but instead of guidance, they end up looking for profit in a sea of bad advice. Many are new to the market, they do not know how to read the financials, they do not know how to assess economic conditions, and they do not know how to read/assess (or even find) 10-K's, 10-Q's, 8-K's, earnings calls, etc... They do not know how to value a company, how to identify entry and exit points, how to assess debt, how to conduct competitive analysis, and some even think technical analysis is all you need. They do not know how to assess trailing PE, forward PE, PB, BVPS, PEG, current ratios, PS, Enterprise Value, GAAP EPS, NON GAAP EPS, operating margin, and the list goes on & on & on. And even if they could somewhat do all of this, they don't have the time. So what's the result? ... Massive amounts of confusion, massive amounts of ignorance, and massive amounts of fear of the unknown.\n\n# Fear of the Unknown is the Number One Reason for Trader Anxiety:\n\nThe reason that most of you  suffer from trading anxiety is a lack of confidence in your picks which leads to a great deal of fear of the unknown. And there is only one way to eliminate the fear of the unknown. ELEMINATE TO THE GREATEST EXTENT POSSIBLE THE UNKNOWN. And if you're are trying to eliminate the unknown through scrolling through insufficient DD posts on Reddit, then your anxiety will likely be amplified when you suddenly find out that most of your trades will fail.\n\n# Eliminating the Unknown will Eliminate Anxiety:\n\nBefore I retired, I spent 8 years in the Marines as an Infantryman and 13 years in the Army as an intelligence analyst. I've been on the receiving end of information and the production end of information. I've seen the horrible results of bad information, and the absolutely amazing successes in good information. In my experience analysis should overwhelmingly be risk based. Assessing and mitigating risk in my former line of work meant an increased likelihood of mission success, friendly lives saved, and civilian lives saved. The less information you collect and process, the more you simply do not know. Having too many unknowns greatly increases risk and diminishes the chance of mission success. I approach trading in the same fashion. And I know from experience the largest risks come from the unknowns. Learning to identify and spot those unknowns comes largely from experience but you need to begin somewhere. There are 3 types of unknowns.\n\n* **Known Unknows:** These are the items you know you do not know. The overwhelming amount of your effort when assessing an equity is dedicated to filling in the gaps of those items you know you do not know, but would like to know. And much of it is easy to find, but what if you can't? There are many cases in which you would like to know something but the information is not available. In those cases you look for indicators of the information requirements you need to make your case. Remember, you are both looking for indicators that justify your trade and indicators that do not justify your trade. For example, if you are invested in Ruger, Smith & Wesson, an ammunition manufacturer, or an outdoors sporting goods store, the [F](https://stocktipstips.substack.com/p/a-message-for-stocktips-subscribers)[BI's NICS Firearm Background Checks](https://www.fbi.gov/file-repository/nics_firearm_checks_-_month_year.pdf/view) tracker is a damn find indicator. There are hundreds of government indicators and thousands of open source indicators available. You just need to know where to look.\n* **Unknown Knowns:** These are things you know, but either forgot you knew, or failed to apply what you knew to your analysis. Perhaps you have solid information to go on, you just didn't thing to use that particular source. To remedy this you simply need to critically think about what you know and how it applies to your analysis. For example, we all know there are websites that check online traffic patterns. Did you ever think to apply this as an indicator for the online retailor you're invested in? I'm willing to bet no!\n* **Unknown Unknowns:** This is perhaps the most dangerous, as it is ALMOST completely derived from ignorance. The more ignorant we are on a certain subject matter the more we run into unknown unknowns. Once you've started on your known knowns, identified your known unknowns (and their indicators), assessed your unknown knowns, you draw your attention to the unknown unknowns. Essentially this is asking \"what the hell am I missing and where can I go to find it,\" or \"where can I look to find the things I do not know I'm missing?\"\n\n# Eliminating the Unknown and Mitigating Anxiety:\n\nInvesting first and researching later is no way to go about business and it can greatly increase your anxiety! The more you know about your company and the current and future economic conditions, the less anxiety you will have. (Note: Much of the data referenced below can be found under the statics tab of [any given company on Yahoo Finance](https://finance.yahoo.com/quote/AAPL/key-statistics?p=AAPL). Bottom line is if you know the relative value and prospects of what you own, and the risks thereof, your confidence goes up, and your anxiety drops considerably!\n\n* **Assessing the Known Knowns:** When you begin your analysis you will always start with assessing what you know. You know, that no matter what company you're looking at, you will generally want the following:\n   * A forward PE (Price to Earnings) that is lower than the trailing PE, unless you think the market forward PE consensus is wrong.\n   * A PE that is relatively lower than sector/industry peers unless you are expecting massive growth.\n   * A BV (Book Value) and BVPS (Book Value Per Share) that is closer to the market cap/share price as possible as compared to industry peers.\n   * A PS (Price to Sales) ratio of one or less (ideally less than industry/sector peers) of unless, once again, you're expecting massive future growth.\n   * A PEG (Price to Earnings Growth) ratio of one or less unless you are pricing in massive growth (Few if any tech companies have a PEG ratio less than one).\n   * An enterprise value that is near, or higher than, market cap. Unless, once again, you are expecting massive growth. Companies that have a enterprise value significantly lower than market cap can be possible buyout opportunities.\n   * Manageable debt relatively lower than industry peers. (A current ratio above 1 but lower than 5)\n   * The company can pay their dividend (see payout ratio)\n   * A solid amount of cash on hand.\n   * Moderate to high amounts of institutional investment.\n   * A solid and growing operating cash flow and operating margin.\n   * Increasing YoY Quarterly Revenue Growth and YoY Quarterly EPS Growth.\n   * Trading at a value on a pullback of no negative consequence.\n   * Solid forward guidance\n   * A history of insider confidence through insider buying\n   * Solid buy rating analyst coverage and upgrades (Take it with a grain of salt, there are more shitty analysts out there than stars in the sky).\n   * Share buybacks are always nice\n   * Did you read the most recent [10-K and 10-Q?](https://www.sec.gov/edgar/searchedgar/companysearch.html)\n   * Did you read the the Risk Factors on the most recent 10-K and 10-Q?\n   * Did you read the latest [SEC filings?](https://www.sec.gov/edgar/searchedgar/companysearch.html)\n   * Did you review the last 4 earnings (Seeking Alpha collects them all to include the earnings transcripts under the news section under any given ticker)\n   * How many analysts cover the stock, what rating did they give, and has it been recently been [upgraded or downgraded?](https://www.benzinga.com/stock/aapl/ratings)\n* **Eliminating Unknowns About the Company:** You can never eliminate all the unknowns about the company. But you can ask yourself the following:\n   * Is the company at risk for an offering?\n   * Can future revenues cover additional debt and reinvestment?\n   * What are the chances the company does not preform as expected?\n   * How critical will it be for my investment if the company misses EPS projections? Its an important question to ask. Companies underperform EPS all the time amid earnings. More often than not it means the company is still growing, just not at the rate analysts expected. For most profitable companies, missing EPS projections does NOT mean the company isn't profitable. Companies with a positive EPS should typically be better off this quarter on the books than the previous quarter.\n   * Is the company's goals realistic and obtainable?\n   * Is the company under or over shooting projected guidance?\n   * Are analysts under or over shooting guidance?\n   * Is the space the company competes in overcrowded?\n   * Is the company losing or gaining market share as compared to competitors?\n   * Does the company have a competitive advantage or disadvantage?\n   * Is the leadership competent?\n* **Eliminating Unknowns About the Current and Future Economic Conditions:** This can be tough but at minimum you should study current and [upcoming economic datasets](https://tradingeconomics.com/) and ask how a positive or negative change in the various categories affects your company. You will also want to come up with your own short, medium, and long term projection of economic conditions and how they will affect your company. Always pay attention to the [economic calendar](https://www.reddit.com/r/StockMarket/comments/qsubyk/next_weeks_economic_calendar_1115202111222021/)!\n   * Inflation Rate (Low is good for preventing dramatic shifts in personal spending, high is good for paying off long term debt. Remember if inflation ever gets to a point where people economize on needs and cut back on wants, it can mean bad news for the wants!)\n   * Semiconductor Shortage\n   * Worker Shortage (Can they meet demand with the workers they got? If not can they beat previous quarters EPS with the workers they got?)\n   * Supply Chain Bottlenecks (Check their domestic inventories as a solid indicator of how affected they are by this)\n   * Rising fuel and Energy Costs\n   * Rising Shipping Costs\n   * Government & Regulatory Environment\n   * Federal Reserve Policy\n   * Reliance on China and Chinese Economic/Regulatory Environment\n   * Unemployment Rate and Labor Force Participation Rate (Too high less people are buying, too low and the cost of labor goes up)\n   * Always Pay Close Attention to the [ECONOMIC CALANDER](https://www.reddit.com/r/StockMarket/comments/qsubyk/next_weeks_economic_calendar_1115202111222021/) and the results reported!\n\n# Perspective and Expectation Management Also Mitigates Anxiety:\n\nIt's gonna go to the moooooon!!!! No it isn't! Read my part on Big money below to find out why. It's important that you have reasonable expectations. It's important that you have a decent and realistic perspective on the outcome of your trade. Doing this will go leaps and bounds toward mitigating your anxiety.\n\n* **There is NO Such thing as a Perfect Stock:**  If your anxiety is so through the roof that you're forgoing great trades on good companies, cut that shit out! There is no such thing as a perfect stock and you will always need to accept a certain degree of risk!\n* **Do not Sweat Minor Misses in EPS:** You're company barely missed analysts EPS or Revenue Expectations? So what!!?? Are they profitable? Are they growing? If they had positive revenue and EPS, chances are they're still growing on the books. Sure their rate of growth may have changed but they're adding money to the balance sheet! It would be one thing if they lowered guidance, but short of that a small EPS miss isn't nothing to frown upon and might put you in the position to buy some more stock for a cheaper price on a really good company! If holding a little longer gives you anxiety then its because you're attempting to get money quick by swinging trades, which is fine, but can add an additional layer of anxiety. I love it when companies miss small but stand by their guidance. The street has a fit as the share price sells off, affording me the chance to enter in.\n* **Expect the Unexpected and Have a Plan:** Black Swans happen. Major unexpected economic shifts happen. Your dry bulk carrier will catch fire or lose their cargo in the ocean. Oil companies will have spills. Companies get sued all the time. Adjusted economic numbers come out every day of the week. Your stock WILL NOT trade as everyone expects it to. Get used to this and you will mitigate your anxiety. Buy in slowly and have a plan, and you will mitigate it even more.\n* **Analysts are Always Wrong:** Firstly it is important to understand that analyst price targets are where the analyst expects the stock to be in a year or so. Not right now. I see a lot of retail traders complaining about the company share price not being at the analyst price target. Its ridiculous expectation management! And unnecessary anxiety.\n* **Understand how Big Money Operates and Expect their Antics!:**  When large institutions dealing in millions to billions of dollars decide to buy or sell a stock, they are well aware that they will inevitably move the share price. The volume they create can be massive. To mitigate this they will either sell calls or buy puts when they sell a considerable lot of shares, or buy calls or sell puts when they buy a considerable lot of shares. Therefore it is important to understand that institutions can often make money no matter which way the stock trades. Unlike most retail traders they even have the option to go both long & short on the same security at the same time. They can, & do, often go short to take advantage of the bearish sentiment they inevitably create while selling large blocks of shares while locking in their profit using a combination of options strategies. Always remember that retail does not own the market … big money does. This reality forces us to come to grips with the necessity not to fight them, but to ride their backs. This includes having the discipline & courage of our convictions to hold through the bearish sentiment institutions inevitably create, on perfectly good companies, when some big firm takes profit. Consider retail traders like ourselves the small Remora Fish attached to a large Great White Shark (The Institutions), waiting to ride their backs out of but a temporary rut of no true consequence.\n* **Trading Psychology:** Psychology plays a large part of why stocks can continue to trade below street value (The value most traders believe fair). Once a stock sells off due to large institutional profit taking, the street wonders why. Does someone know something we don’t? Was there some economic data that cast bearish sentiment on this particular industry or sector? Does the street expect the company to act in a way that will lower its valuation? Such questions, & many more, aren’t just asked by us. They’re asked by everyone who holds a position in the company we do. And these questions cause anxiety. Even analysts may downgrade a stock for no other reason than to tailor their expectations a year out from now. Indeed they hate to be wrong, & they always are. So do not be surprised not only when a security we thought was already undervalued sells off further than expected, but also stays down as it may take time for traders to feel comfortable entering again. Corrections back to street value can often take a few weeks to a few months. Sometimes until next earnings to relive fears of both retail & large institutions.\n\n# Processes Mitigate Anxiety:\n\nProcesses mitigate anxiety. The more efficient the process the less time you spend searching for places to put that money that's burning a hole in your pocket. Some traders feel as though they are in a rush to hurry up and strike while the iron is hot and put their money somewhere only to find out that  they rushed their trades and realized a loss. Below is my process and a few additional pointers for researching equities and it mitigates A LOT of my personal trader anxiety.\n\n1. **Assess the Economic Conditions First!:** Assessing the economic conditions first grants you the opportunity to single out those sectors that stand to benefit the most from current and future economic conditions. If you do not know how to do this please see an earlier post I made on this very topic [HERE](https://www.reddit.com/r/investing/comments/qrtkox/understanding_and_profiting_from_our_current/). Also investing in companies that stand to benefit the most from economic conditions gives you an extra layer of confidence to fight anxiety.\n2. **Make a Price Based Assessment Watchlist and Set your Alerts:** A Price Based Assessment Watchlist is simply adding companies that you've 1. Assessed the Current or Future Economic Conditions as Favorable. 2. Did a Quick Review of the [Company Financials](https://stocktipstips.substack.com/p/stocktips-investment-research-series). 3. Set your alert at your desired reassessment price. ONLY when that alert hits is when you do the rest of your research and DD. That way you ONLY use your valuable time on the most promising of circumstances. That way you aren't frantically searching and scrolling for plays, but letting the plays come to you, which helps with anxiety!\n3. **Buy on a Pullback of Little to No Negative Consequence:** I love a good dump. Perhaps it comes from a bad market day, perhaps it comes from the sector in general doing poorly that day, and perhaps it comes from a whale taking profit. I don't care. If the financials are great, I expect the company to grow, and the economic conditions are favorable, such a pullback will trigger my buy alerts letting me know its time for a starter position. But first I do a quick assessment to see if there is any recent negative news that is driving down the share price. If there is negative news, I ask myself to what degree is the news of legitimate financial substance to the growth prospects of the company. If very little, I'll be happy to buy that dip. Some would argue that they want to jump in on solid relative strength. Yeah ... they're chasing and I don't chase. I like it when its cold, not when its hot. Later, when my thesis becomes true, then it gets hot and I watch everyone else chase. But buying on a pullback of little to no consequence will give you that extra layer of value and security you may have been looking for. You wont be worried if the security is over pumped and about to fall, but rather patiently waiting for it to pump again. I think the latter of the two holds less anxiety. More profitable too!\n4. **Keep Track of the News:** If you want to monitor your investments stop looking at the chart and read all the news that comes out on your company. Two good places to do this are seeking alpha (Put the ticker in and click the news tab) and, believe it or not, StockTwits! The bots and the news scroller on StockTwits are money! Ignore the people there, read the news scroller!\n5. **Set Price Alerts on Current Positions:** Set price alerts at 5% above or below your starter position price. Its a lot more easy to go about your day that way, and waaay less anxiety when you can be rest assured that at minimum your investment has not pumped or lost 5%. If your stock does dump 5% and you get alerted, perhaps then you might want to check for bad news and average down as necessary. Otherwise leave it be!\n\n# Anxiety Mitigating Rules to Live by:\n\nSome added anxiety killing tips!\n\n* **If you aren't willing to hold the stock long term, stay away from it!:** So you think you're going to swing it real quick and get out so you don't need to put too much effort into the trade? Think again. The technical analysis guru on YouTube may have a pretty technical set up, but he's going to throw your anxiety through the roof. And only IF you're lucky, you MAY make a profit.\n* **Quit Checking your Phone, Set Alerts Instead:** Set share price points where you want to be alerted and quit checking your phone. I promise you that your anxiety is really going to increase when you're fired from work because you spend too much time checking your investments and too little time getting anything done.\n* **Stay Away from Risky Options Strategies:** So you wanted to get rich quick so you bough a bunch of naked calls or puts? All or nothing baby!! Well there goes your anxiety. The more professional you are with options the less anxiety you'll have.\n* **Be a Net Options Seller:** Covered calls while you're waiting for your position to turn over long periods of time is a great idea. Its like getting a free dividend and it lowers your cost basis. I've been selling POWW calls for the last three months and in addition to profiting from the increase in share price, I've cashed in $0.56 in premium per share, a 9% gain on the overall position on options premium alone. At this point I don't care how the stock trades. Talk about low anxiety huh? I'll sell calls till the cows come home and if the shareprice on the last day before expiry is slightly over the strike on the calls I sold, pending I want to hold on to the shares I'll just roll the options to another month for additional premium. Furthermore when I can't get a stock for the price I want I often just sell an in the money cash secured put if the options premium is worth it. Lets say a stock is trading for $6.00 but the $7.50 strike put is trading for $2.70. That means the real price to me if assigned is $4.80 per share. Talk about a steal! I'll sell that contract all day every day! And with practically no anxiety on a solid company!\n* **Don't buy in all at once, do NOT chase!:** Don't just throw in a full allocation all at once on a stock. Rather establish a starter position and buy in slowly in the red. This will greatly lower your cost average and increase your profitability. For example, if you established a starter position but now you find yourself down 5%, you can just buy an equally sized position and now you only need the stock to increase 2.5% to recover from your loss. Does this help with your anxiety? You bet it does! Finally, if the stock skyrockets don't chase it. Enjoy the profit and move on. Chasing has been the windowmaker of plenty of traders ... particularly in the penny stock world.\n* **Keep 25-50% Cash to the Side:** Sure it limits your profit, but it can also enhance your profit too. Especially amid uncertain times. The market will never react the way you think it will and it is important to keep some cash to the side in the event the market turns sour. And imagine the amount of anxiety you save by knowing in the long run you can not only double down on a good company, but you can profit more as well. Lets say the stock you're in dipped 25% on a market panic. Well if you bought a reliably profitable company you will eventually recover. But if you used that cash to the side to double down you'll only need to wait until the stock rebounds 12.5%. By the time the stock recovers 25% you'll have made 12.5% profit.\n* **Margin is for Emergencies:** Margin for small retail traders should strictly be used for emergencies. One such emergency for me was the big COVID dump. Sure I made some decent money shorting DIS but that alone did not make up my losses. I also had some cash to the side. And I bought the dip. Much to my surprise however the market kept dipping. I took out 25% leverage on my marginable positions. Because I had cash to the side and I saved margin only for emergencies, I was able to profit big from the rebound.\n* **Stay away from unprofitable companies and Penny Stocks:** This speaks for itself. I have analyzed a the risk on a bunch of penstocks. And unprofitable companies can often disappoint. Indeed the volatility is there, and there is profit to be made amid volatility. However trust me when I tell you that if you are reading this, it means you likely need help in your trading habits, and you should just stay away from penny stocks and unprofitable companies.\n* **If You go Short, Consider Buying a Call:** If you're short, you can lose a lot of money if the trade turns against you. But by buying an at the money call when yo go short on 100 shares, you have the same effect of buying a put when you're long. The max you can lose if you're short and you bought an at the money call, is the price of the call and perhaps just a little bit more in some circumstances. The price of a stock can literally go from $10 to $1000, but still, if you bought a call, your losses are capped at the strike of the call plus premium. You wont even need to cover. When the call is assigned it will automatically cover the play for you. And if the price dips low enough to the point you received enough profit to cover the cost of the call and a little more, you can cover the stock and if you so choose to hold on to the call option, it's paid for! Its a free call. You can sell it if you wish, or hold it as a lotto. But either way you're anxiety is reduced because you can only lose so much on your short position! This is why I laugh when people say \"shorts are scared.\" Big money ALWAYS hedges their short position. They cant stand the anxiety of a naked short and neither should you!\n* **So You're Down 5%? Who Cares?:** 5% is nothing but a great place to average down. You did your DD, you've assessed the economic conditions, plenty of institutions are satisfied with the stock, what have you got to worry about? Expect this and let it in to your way of life. It's going to happen. Just average down with the money you have to the side and hold. They will continue to make money quarter after quarter which will increase their book value which will eventually get realized by upward price momentum.\n* **BUY RELIABLY RPOFITABLE COMPANIES PRIMED FOR GROWTH, TRADING AT A SECTOR RELATIVE VALUE, ON A PULLBACK OF NO NEGATIVE CONSEQUENCE, WITH A DECENT AMOUNT OF INSTITUTIONAL INVESTMENT, UNDER FAVORABLE ECONOMIC CONDITIONS!:** Swing for grand slams and you'll strike out, or ground out nearly every time. Swing for base hits and you'll hit base hits, home runs, and grand slams on a very regular basis!\n\n# You will NEVER Get Rid of All of your Anxiety:\n\nIts got to be said! You will never get rid of all of your anxiety. You just put a significant amount of cash you worked hard for into shares of a company subject to both positive and negative market forces. There will always be unknowns. Therefore, there will always be anxiety.\n\n**TL;DR:** First, I HIGHLY suggest you read this if you feel that you are the target audience. The thesis above speaks to the fact that anxiety in trading largely comes from the unknown, & the more you mitigate the unknown the less anxiety you will experience. Above there are plenty of steps you can do to mitigate the unknown, thereby developing your confidence, and become a more profitable trader. I also argue that you can mitigate a large portion of your anxiety simply by understanding what you're buying in an equity, understand the markets, understanding trading techniques, developing a sense of perspective, and buying \"*reliably profitable companies, primed for growth, trading a sector relative value, on pullback of little to no negative consequence, with a decent amount of institutional investment, under favorable economic conditions.*\" This post is for people serious about mitigating their anxiety and learning how to trade in a manner that will benefit both their mental health and their wallets. In summary, if traders respect their own money and do what they're supposed to do, it will go a long way to mitigating anxiety.", "id": "qtan98", "created_utc": 1636839115.0, "score": 593, "upvote_ratio": 0.97, "num_comments": 103, "comments": [{"body": "Hello! It looks like you might have submitted a post about getting started, looking for book/YouTube/podcast recommendations, or another commonly asked question on /r/StockMarket. To help new investors and traders with these questions, we created a comprehensive [market toolkit](https://github.com/ckz8780/market-toolkit) which has lots of resources for new and experienced traders alike. Here are some direct links in it that you might find useful:\n\n- [Getting Started](https://github.com/ckz8780/market-toolkit#getting-started)\n- [Books](https://github.com/ckz8780/market-toolkit#books)\n- [YouTube Channels, Talks and Speeches](https://github.com/ckz8780/market-toolkit#youtube)\n\nThe phrase or keyword that triggered this response was \"**new to the market**\". Here's [a customized link that will search the whole subreddit](https://www.reddit.com/r/StockMarket/search?q=new to the market&restrict_sr=on&sort=relevance&t=all) for the same topic.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/StockMarket) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Wow this is long", "score": 30, "replies": [{"body": "It’s a lot of solid substantive and actionable information. These best you’re going to find on Reddit from a fella who legitimately gives a shit", "score": 45, "replies": [{"body": "Yeah man thanks for taking the time to share what you know! I'm a total dumbass but trying not to be so much. A wrinkle a day...", "score": 12, "replies": [{"body": "U can do it", "score": 3, "replies": []}]}, {"body": "Much appreciated I will give it all a read", "score": 10, "replies": [{"body": "What does it say?", "score": 3, "replies": [{"body": "It says ur not meant for this", "score": 8, "replies": []}]}]}, {"body": "Really wonderful stuff. Thank you for all the time and effort", "score": 2, "replies": []}, {"body": "It's unnecessary long. The answer is simple - do not trade.", "score": -1, "replies": []}, {"body": "Thank you so much for this write up.\nI have mostly been investing in crypto but that's because it's money I don't mind losing and I haven't done so bad with that yet.\n\nHowever, a lot of things you said applies to crypto as well, I often notice a flood of technical analysis posts from bagholders when a coin starts tanking.\n\nI'm plan on learning about the stock market or just trading in general and plan on coming back to this post often, as such I really appreciate the effort you have put into it.", "score": 1, "replies": []}]}, {"body": "That’s what she said.", "score": 2, "replies": []}, {"body": "Only 15 minutes", "score": 1, "replies": []}]}, {"body": "Really really good write up!\n\nEdit: To expand a bit, I don’t have any real anxiety on trading myself but a large portion of this write up is beneficial regardless of that. \n\nReducing the unknowns on a company you own or thinking of buying will make you much more confident, and I can’t stress enough my agreement on setting price alerts!", "score": 16, "replies": [{"body": "I have two sets of price alerts. \n\n1. Price alerts that let me know when I should start doing a more comprehensive DD\n2. Price alerts where I actually buy in. \n\nLet the market tell you when to buy. That’s the point of the Price Based Assessment Watchlist. Having a list of quickly vetted stocks based on current and assessed future economic conditions and a quick review of their financials. When the alerts hit you dig deep and assess whether you want to buy and where to buy. Saves a ton of time. And you know you’re getting the stock for your personal value zone.", "score": 11, "replies": [{"body": "Amazing post and really love this part. This is what I try to tell all of my younger trading friends. I have about thirty amazing companies I track because I want to own 15-20 of them and I’m just letting the market show me which ones and when. I hate to see a friend chase a stock.\n\nAlso selling covered calls are a must and why more people don’t buy stocks by selling cash secured puts is beyond me. I’ll start a starter position by buying the stock but often check the options chain and sell puts because I’m either getting premium or a stock I love for cheaper then I was about to layer into it for.\n\nAgain thanks for taking the time and thank you for your service.", "score": 5, "replies": [{"body": "Some just don’t like seeing red in their portfolio. … which does not truly matter if you’re selling options into expiry.", "score": 4, "replies": []}]}]}]}, {"body": "I think I will need a strong drink for this excellent piece 👍🏾", "score": 10, "replies": [{"body": "Only if we like losing. This isn't the movies. 1 strong drink is enough to make you do small mistakes that you don't even notice.", "score": 1, "replies": []}]}, {"body": "Awesome!", "score": 7, "replies": []}, {"body": "Appreciate the excellent post.   🤙", "score": 10, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I have quite a few companies in mind. Both in a buy zone and on a price based assessment watch list. But it would be unjust to my subscribers to release them on Reddit. I put a ridiculous amount of research into my picks and *knock on wood* I haven’t lost one yet. But that time and effort will no longer be spent on Reddit. I enjoy helping folks and filling in information gaps on general trading and strategy. But I’m no longer able to post my research and picks here. A matter of fact I’m screening for picks right not to add next week. God this market is overvalued", "score": 3, "replies": []}]}, {"body": "I’ve been finally impressed again by work, effort, time and knowledge on this sub… thanks 🤟", "score": 5, "replies": [{"body": "Love it! Glad you found value in my work. Hope this knowledge leads to increased gains while sleeping like a baby!", "score": 2, "replies": []}]}, {"body": "Phenomenal post, I really appreciate all the time you took, you clearly had a sit down and mind mapped this motherfucker because it reads like a mini series. Being a die hard GME nut it’s hilarious to read the part about DD requiring a risk factor though (while I agree for literally every other situation except the aforementioned), still waiting on a valid counter argument to this day.\n\nI think that almost every single person who hasn’t been an active trader for 5+ years could benefit from a multitude of things discussed here. Namely going through the steps of due process. Proper prep prevent piss poor performance. \n\nI only fuck with systems and models. If you don’t have literally everything you mentioned in this post and more before going into a trade (obviously that’s also the copious amounts of personal anxiety and weed that I smoke) but you shouldn’t touch it. Or go paper trade?\n\nI completely agree with all your mentions of reserve cash and not chasing etc. because all of this used to be my old mantra. I’m sure i’ll go back to this system when my “zen” period ends after moass.\n\nI think that the weed silver mortgage etc “squeeze” distractions from gme are a great example of the psyops bagholding flip. Especially with the twitter furus that have been born subsequent to the crash back in march and the sneeze in january, there was clearly money to be made pushing “squeezes” (SIDE NOTE sec has literally confirmed january sneeze for GME was purely bullish sentiment not shorts covering its in my profile).\n\nANYWAYS I think I should definitely stop here, but as a fellow over thinker/over commenter, I felt you might appreciate some of the thoughts I had about you piece.\n\nIn my head this probably started out as ‘10 ways to prevent you from buying someone’s bag’ and you expanded it in to what is essentially a step by step to navigating the psychological pitfalls of our equity markets. \n\nBrava", "score": 4, "replies": [{"body": "Thank you. Trust me when I tell you I did not start out to write all this… only I realized that the reason my anxiety is so low is because of my risk mitigating trading habits. The moment I hit the buy button I don’t even bother with the starter position until I’m down at least 5%. Only then does my portfolio draw my attention. If you know what you got and the risks you’re accepting then anxiety floats away.", "score": 3, "replies": []}]}, {"body": "Semper Fi. Good read.", "score": 3, "replies": []}, {"body": "Very excellent work here. I will definitely save for reference. It is so difficult to put a clear concise tutorial together on this subject matter but you have done it well. Bravo.  \nI will continue on...", "score": 3, "replies": [{"body": "Thank you. I just added three more categories that popped into my mind under the \"Anxiety Mitigating Rules to Live By\" section.", "score": 5, "replies": [{"body": "Really good stuff.  This is exactly the way its supposed to be done imo.  Ive been doing it much like how youre describing for a couple years now and been much more fun. Im glad to already be doing it this way because I was a disaster before. Options got me into alot of trouble, or buying cheap stocks that seemed promising and avg down on total losers. I was all too willing to throw my money on the line. Im glad what you mentioned wrt options writing.  People just dont get it when it comes to options, buying calls and puts.\n\nI would include one that really helped me...number of positions. Kinda goes with cash reserve you mentioned. My real turnaround happened when I cut my positions from maybe 18 to about 4 or 5. Focus on quality and concentrate into larger and fewer positions of quality. And dont be afraid of $150 stocks etc. That was a big problem of mine, now I actually seek those many times.", "score": 4, "replies": [{"body": "If the $150 stock is where the value is I say go after it. It moves just like any other stock. I think diversification is good for folks who don’t know what they’re doing. But if you can rip a company apart and put it back together again, and you’re really good at reading the economic environment, I don’t care if you invest in 2 or 3 stocks.", "score": 3, "replies": []}]}]}]}, {"body": "If not a teacher by trade, you’re certainly a teacher at heart since, even in your “my Reddit neighborhood has gone downhill” post you can’t help but want to help. Thank you for sharing your experience while ranting. I am saving this post. Best to you.🌈", "score": 3, "replies": [{"body": "I’ve been an instructor of many different crafts for years. I’ve developed courses, written lesson plans, put to gather power points, and submitted courses for certification and accreditation. I love to teach. I love to help folks out. And this particular subject matter, the subject matter of profiting in the markets, is a very wonderful subject indeed.", "score": 3, "replies": []}]}, {"body": "great DD", "score": 2, "replies": []}, {"body": "Excellent read my man.\n\nAll of this came after I listened to some fantastic motivational speeches and a piece of Nietzsche.\n\nThe first takeaway I got was: manifest your intentions. If you believe with conviction that you are correct, you will eventually get there being guided by purpose. Even if you have failed and failed again trading, eventually you will find a path that leads to financial freedom.\n\nSecond is, to stop trusting others and to start believing in *yourself*. In the beginning when you are a young trader, you only follow the advice and plays of others. Once you’ve grown, you suddenly stop asking questions. Your trading becomes.. quiet. It’s between you and the brokerage. No discord chat rooms, no hours on ST looking for confirmation bias. You barely pay mind to any contrarian unless they have a feasible argument (most don’t).", "score": 2, "replies": [{"body": "I’d by lying if I didn’t tell you I paid for my trading education. Most people do. Most valuable lessons I learned were from trial and error.", "score": 1, "replies": [{"body": "I’ve read hundreds of posts from people stating how they’ve gone from losing hundreds of thousands to making millions in the long run. I think the ones who make it are the ones who keep trying.", "score": 3, "replies": []}]}]}, {"body": "This is active and passive study if a Maoist nihilist, rick from rick and Morty come from the same exact spot, if they are this API active but 'passive' nilhilist, fear mongering is the same sided effect you get looking for and as a Maoist. \n\n\nThe idea mix of this water comes from this 'xi'xi' paradox and is aligned for and as the ameing \"she\" is not the active fear of being afraid, but ongoing the belief the only way a API would\n\n\n of xi{bing xi japang), and she as in the words she, is used to explained the absence of though as a sign, as a Maoist debate it only ugly because you miss the side that is considered missing was the debate if this API and what it was, the people who work for .dotnet doesn't supposed that an actual API can doge the net, but if you were looking for this .dotnet code it only understood as Linux code and asking everyone as a way to get introduced", "score": 2, "replies": []}, {"body": "Kudos for putting this down..This is detailed and very insightful. Do you by any chance trade futures as well and have any write ups on that?", "score": 2, "replies": [{"body": "Futes are the devil for new retail traders. I use them as indicators but I do not trade them.", "score": 3, "replies": [{"body": "Thanks for the response. I honestly wondered what percentage of retail traders assess all those company parameters u outlined under the \"known unknowns\" before diving into a trade..i need to go back to the drawing board", "score": 2, "replies": []}]}]}, {"body": "What are the websites/resources you use to do your DD apart from the one you mentioned above?", "score": 2, "replies": [{"body": "Oh there are a ton and it all depends on what sector or industry you’re trading. [Take your pick ](https://stocktipstips.substack.com/p/the-mother-list-of-free-trading-and). The numbers are unfortunately off and that will be fixed but I’m certain you will find everything ok.", "score": 1, "replies": []}]}, {"body": "This is one of the best posts I have read so far on this sub. Highly qualitative post. I noticed that you think, analyze and research exactly the same way as U do. My #1 investment weapon is research, I have never lost money on positions I fully understood and held with high conviction. Where can I subscribe to your newsletter?", "score": 2, "replies": [{"body": "I don’t think posting links to that on this sub would be congruent with the rules. Please check my profile", "score": 1, "replies": []}]}, {"body": "Thank you, I’ve been looking for exactly something like this in order to structure many back up plans put in place in order to react accordingly to the market forces", "score": 2, "replies": []}, {"body": "This is a really great writeup for some of the basics every trader should know about! Thanks OP I hope a lot of people read this.  \nI also noticed that a lot of people are asking for advice after they lost money in a stock... \n\n\nThis just happened a few days ago: guy lost money on a stock, company said they made 10 times more profit but stock kept falling, I explained to him that 10 times is yty and they had extreme and massive losses 2020 so this numbers were fake to soothe uneducated investors and that they won't make real profit in foreseeable future because of macro economical issues they are heavily affected by and that he should educate himself with some literature about macro and micro economics to understand why this is the case and how to deal with it.\n\nWell, I am still getting harassed by him because he thinks he knows more about the market or the economy than me, a guy with over 20 years of experience and a master in economics... He tries to get me banned from reddit even after I deleted my comments and blocking him and his other accounts. Just because I told him that he lost money because he didn't know enough about the very thing every stock depends on. If he would have asked before he bought the stock, I would have explained to him the exact same things.", "score": 2, "replies": [{"body": "lol try explaining to how the MPC affects the money multiplier. His mind will be blown!", "score": 1, "replies": [{"body": "I am sure he would try to get me banned for this and claim that MPC doesn't effect the economy at all  and inflation would be transitory", "score": 2, "replies": []}]}]}, {"body": "This is an excellent post, worth reading!", "score": 2, "replies": []}, {"body": "Thanks for this.", "score": 2, "replies": []}, {"body": "Thank you", "score": 2, "replies": []}, {"body": "Good earning for MRVI. MRVI is down around 40 percent good time to buy.", "score": 2, "replies": [{"body": "This reminds me, it’s a whole new ballgame if you are analyzing pharmaceutical companies. You will want to pay close attention to their pipeline and their peers … or possible peers developing similar drugs. With that said I have just reviewed their earnings, their news history, their statistics on yahoo finance, I know that drugs are inelastic which means no matter what the economy does the price is generally unaffected, excellent institutional ownership, good growth, they can cover their debt, good outlook, positive analyst coverage, …. Shit man where did you find this one!!?? I need to review their drugs and their webpage and their 10-K’s/Q’s and risk factors but a very brief check indicates a solid find!\n\nI wrote this as I was looking it up lol 🤣\n\nEDIT: The crux of this play hinges on their products, their peers, and their marketshare. I’ll need to dive deeper. Thanks!\n\nEdit: I see now what the hang up is. A LOT of growth is priced in already. In cases such as these the earnings had better reflect future street growth expectations. It’s trading with a PS of $7.54 for every dollar of annual revenue (which is very high). 24.69x book value (which is crazy high). That’s a lot! But then again pharmaceutical and medical companies just sell cheap chemicals and devices that only they have a patent for so they can make a lot with very little. But if the market corrects very sharply these high valuations will explode. … so there’s that risk. \n\nEDIT: the aforementioned dump likely came from institutional profit taking. With a relatively small/moderate float of 82m this one can swing wild. But the institutions seem to like it. They’re maxed out on institutional ownership. Update: the bullish run was interrupted by a stock offering at $50 per share. \n\nEdit: as they continue to profit and pay down their debt it will add value to the stock unless they take on new debt for future endeavors.\n\nEdit: I give this one the following\n\nModerate risk 3\nValue 2\nGrowth potential 4\nInstitutional interest 5\nEarnings history 5\nMarket Conditions 3\n\nA grade of 62% in the short run, 70% in 6 months and 75 - 80% in a year or so. A long hold. Expect some set backs and bumps along the way.\n\nUpdate: Selling the March $40 calls against the underlying at current prices will lower your cost basis by $5.40, grant you a maximum return of $775.00 per 100 shares, (a 20% max return). Recommend selling calls every 3-6 months while waiting for your position to swing. Carry them to term and if the price is $40-$42.50 by expiration. you may want to consider rolling the call. There’s a million ways you can adjust that position between now and then both if it goes up and if it goes down but I don’t want to get into a crazy options class 🤣", "score": 1, "replies": []}, {"body": "Update my response to you. Lol. I got carried away.", "score": 1, "replies": [{"body": "Lmao I still think it’s good buy😂", "score": 1, "replies": []}]}]}, {"body": "Great stuff OP!\n\nI will save your post for future reference.\nRespect for putting this down to actually help people! \nHope you make loads on your DD.", "score": 2, "replies": [{"body": "It’s good karma to help folks. Pure and simple", "score": 1, "replies": []}]}, {"body": "Thank you for the detailed post!", "score": 2, "replies": [{"body": "Thank you for seeing value in my work", "score": 1, "replies": []}]}, {"body": "I really appreciated this post, this was exactly what I was looking for. Thanks for taking your time to write this up, and sourcing information for newer investors to learn the ins and outs of investing. The 'known-knowns' section was really valuable to me. I've been looking for resources to learn more about what influences the economy (outside of the stock market as well) your time is greatly appreciated sir.", "score": 2, "replies": [{"body": "Thank you!!! This means a lot!", "score": 1, "replies": []}]}, {"body": "Thank you for your sharing", "score": 2, "replies": []}, {"body": "This is an incredible thread. Thank you for this.", "score": 2, "replies": [{"body": "And just to think this is the thread they banned me for 🤣", "score": 1, "replies": [{"body": "Really? That's humorous.", "score": 2, "replies": []}]}]}, {"body": "I cant tell you how many times Ive fomoed a position and lost BIG. I dont worry about fomo anymore with the value investing picks contained your newsletter! Great article.", "score": 2, "replies": [{"body": "There is the catch lol", "score": 0, "replies": []}]}, {"body": "Your newsletter got me past anxiety….what do you have for my SPY put addiction!\nSrsly if more people would try your newsletter for 90 days, the world would be a better place.", "score": 2, "replies": [{"body": "I don’t know about a better place but I haven’t lost on a play yet *knocks on wood*", "score": 2, "replies": [{"body": "Where can I find this newsletter?", "score": 1, "replies": [{"body": "I don't think the mods would appreciate me posting that here so I wont. Want to follow the rules of the sub.  As most with a newsletter, its on my profile.", "score": 2, "replies": []}]}]}]}, {"body": "The best post I read in this group. Thanks a lot for sharing this!", "score": 1, "replies": []}, {"body": "#SPY 500 EOY", "score": 1, "replies": []}, {"body": "Omg what year is this that ppl still don’t fuking add tldr; you are not respecting your work man! I very much would like to know what this epic novel is about at a glance 😩", "score": 1, "replies": [{"body": "I assure you … and this is 100% true. I put that there simply to prevent comments complaining about no TL;DR. 😢. Last time I did a write up like this, and you can see it in my history, 50% of the comments were complaining about no TL;DR 😭", "score": 2, "replies": [{"body": "Is trader anxiety the same as hesitancy? \nI will get a position in mind or a good view of how things are gonna go in the next few weeks/months and typically be right but each time Ive been a pussy about cashing out or going big on stuff. \nIll read the whole thing in a min but honestly just saw this while searching for a guitar pedal somehow so def feel like the universe is like READ THIS!", "score": 2, "replies": [{"body": "If all of your indicators point to a growing profitable company on a pullback back of no consequence then your hesitancy is derived from fear of the unknown which is anxiety", "score": 2, "replies": []}]}]}]}, {"body": "https://youtu.be/FaLSiSQMSlE Check this out", "score": 0, "replies": []}, {"body": "How to get rid of trader anxiety? Don't trade. There you go. Another good one would be go in with the expectation of loosing money. Have fun.", "score": 0, "replies": []}, {"body": "Are the monkeys listening?", "score": -1, "replies": []}, {"body": "Could i get a TLDR on the TLDR", "score": -1, "replies": []}, {"body": "Good piece. Key to eliminating anxiety is conviction and, without that, one should not be buying. Unfortunately most people are not willing/able to put the time in.", "score": 1, "replies": []}, {"body": "People only have anxiety with trading because they care about losing. If you already accept that each trade can lose, you will have no anxiety because you don’t care anymore.\n\nTo help understand this you should put on a trade that you know will lose and let it play out anyways with a small sum accepting the loss before you put the trade on. Will help correct your anxiety by breaking the pattern…", "score": 1, "replies": []}, {"body": "A very long post for an issue that can be easily cured.\n\nTEST YOUR TRADING METHOD, QUANTITATIVELY. \n\nThe Law of Large Numbers will take care of the rest.", "score": 1, "replies": []}, {"body": "I’m interested in that POWW net options deal but I don’t quite understand it.  I guess I’ll be doing a little research today.", "score": 1, "replies": []}, {"body": "Just buy OTM GME options and become zen with the universe", "score": 1, "replies": []}, {"body": "**TLDR** eliminating trader anxiety: Buy VTSAX and chill.", "score": 1, "replies": []}, {"body": "Great insight. I swear I was t bagholding Victoria secret", "score": 1, "replies": []}]}
{"title": "If inflation turns out to be transitory and there isnt hyper inflation in 2022. What would be the best individual stocks to be buying now?", "selftext": "[deleted]", "id": "qt17lz", "created_utc": 1636809910.0, "score": 36, "upvote_ratio": 0.66, "num_comments": 97, "comments": [{"body": "[deleted]", "score": 124, "replies": [{"body": "Amen. The alternative to transitory is not hyper inflation.", "score": 42, "replies": []}, {"body": "I was thinking about this yesterday. Fucking Google... Up 72% this year... so expensive... But will get some fractional shares because I'm missing out.", "score": 26, "replies": [{"body": "What did Google do? I also checked Yesterday - Cloud Business catching up? Pixel phone? They are awefully quiet.", "score": 6, "replies": [{"body": "Well YouTube is becoming very profitable now. It is growing too and not effected by Apple's update.", "score": 10, "replies": []}, {"body": "No clue. But they are too dominant to ignore. You know, I've never reviewed their financials because they were always too expensive. But with fractional shares at Fidelity, there's really no excuse to only pick $10/shares anymore, right?", "score": 9, "replies": [{"body": "Correct the only thing that matters with the introduction of fractional shares is the percent changes a stock sees. If you put in 10 bucks at Google and they had a 72% increase then that's still almost double your money'.", "score": 9, "replies": [{"body": "I've been with TD for almost twenty years now, had no idea that you could buy fractional shares anywhere. (Which is why, I realize now, I only ever focused on sub $5 stocks... crap like ITUB..) Even when I (stupidly) got onto RH, I never bought anything with fractional shares. But now at Fidelity, it's been great to add some here, some there. But GOOG is so powerful. It's silly to ignore. It's been great to add to giants like ASML, MSFT, IVV, RY a little at a time. I know it's not for everyone, but it seems to be working. I don't think I want to create those crazy 100 stock 1 dollar positions you can do at M1... but I feel like this is working!!!", "score": 7, "replies": []}]}, {"body": "Wrong.  You don't make a buying decision based on \"no clue' and \"hey it's cheap and available\"\n\nHard, hard, \"you're fucking joking, right--????\" stare.", "score": 2, "replies": [{"body": "I was saying, that I only ever focused on sub $10 stocks my whole life and ignored anything that was \"expensive.\" Fractional shares have changed that. Now I know better so definitely putting them on my radar.", "score": 3, "replies": [{"body": "Okay that makes more sense.", "score": 2, "replies": []}]}]}]}, {"body": "One thing they did is made google photos not free anymore. 15gb limit on all data and then start paying up. \nThey are done using our photos for free for their ML and ready to sell it back to us. \nThings like this will tell you they are gearing towards revenue from users not just from ads. And getting in on very sticky subscription business. \n\nHow much years do you think you will start seeing such monetory changes on youtube? After that google will skyrocket like hell again.", "score": 1, "replies": []}, {"body": "They also own a chunk of space x", "score": 1, "replies": []}, {"body": "Google owns YouTube. If YouTube were it’s own company it would be bigger than Netflix, not to mention the overhead is significantly lower since YouTube doesn’t need to create or bid for content.  That is just one of the many moats google has and why they’re killing it. Still an undervalued company in my opinion.", "score": 1, "replies": []}, {"body": "Ummm, their EPS for the 9 months ended has increased from $36 to $82, their net income more than doubled, their operating margins increased from 20% to 31%, their operating cash flows increased by amount $20B, and on a QOQ basis? their assets increased by about $30B while liabilities only increased by about $5B. \n\nSo while you are asking what did they do? You should be asking what didn’t they do?", "score": 1, "replies": [{"body": "Yes, yes, but how... what product is printing all that money - I take it YouTube and their search engine?\nWhat is the next move?", "score": 1, "replies": []}]}]}]}, {"body": "Bruh, so overpriced... \\*looks at my underperforming value stocks\\*", "score": 16, "replies": [{"body": "Most of the mega cap tech stocks aren't at nosebleed valuations *if* they can maintain their growth rates.  GOOGL is at 20x their 2024 earnings estimate, AMZN is at 32x, APPL is 23x, and FB is 17x.\n\nI agree that value stocks haven't gotten the love they deserve, so I've been taking a barbell approach, with allocations split between the mega-cap techs and value (C, CVS, WHR, PHM, HBI, CAG, LMT, XOM, etc).", "score": 4, "replies": []}, {"body": "value traps\n\nftfy", "score": 4, "replies": []}]}, {"body": "AMZN is 10000% going to be a huge Metaverse play. They just haven’t announced anything yet.", "score": 2, "replies": [{"body": "Maybe, but truth is Amazon isn't really into that kind of thing. What they might end up doing is working on the whole \"Metaverse\" shopping area, so you can shop with VR.\n\nI still have my doubts around all of this Metaverse thing though, it sounds like we're at least 10 years away from that. VR has come a long way but it's still uncomfortable af to use and way too... how to put this, I don't like being completely isolated the way I am with VR.", "score": 0, "replies": [{"body": "The concept of the “Metaverse” is going to include IoT devices as well as augmented reality, it will not be purely VR. A decade away? Dude, think closer to 20-30 years away. \n\nWe’ll have the basic *basic* version in 7-10 years. Think internet in 1995 compared to now.", "score": 2, "replies": [{"body": "Remember progress on this is exponential, VR has come along way in the last 5 years, and the only reason it hasn't really come any further is because there's no real use for it, same with AR.\n\nI believe that if big tech really get into it it'll progress a lot faster.\n\nI understand I might be a bit too optimistic, but well worst case scenario I'll be a bit disappointed.", "score": 1, "replies": []}]}]}, {"body": "AMZN IMHO is a web services (i.e., AWS) play.  They are back to losing money on their ecommerce retail (I actually agree with their strategy of continuing to invest in it, and paying up to hire & retain workers to keep their market share, but this will be a low margin business forever)", "score": 1, "replies": []}]}, {"body": "I see your mini Schnauzer and raise you one Dachshund.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Yea, social media... every pretty face can hurl sensationalist crap at the masses... gotta love it. \"Inflation is the government stealing your money\" as if the government is a movie villan who is out to get you personally.", "score": 17, "replies": [{"body": "Wait you don’t think the government is a villain that’s trying to take all our money and stifle our opportunities and freedoms?", "score": 3, "replies": [{"body": "Only half of my freedoms. \n\nDont know, for me government is a mechanism put in place by the people for the people. The best possible option to benefit most. In reality this is not always the case of course but to pout and behave like you would be better of in a society without rules is plain silly.", "score": 7, "replies": []}]}]}]}, {"body": "You’re wasting your time not owning them in this economy. I bought NVDA at 200. Didn’t even think twice that it was at the top (at the time). I believe in the company, leadership and they’re ability to continue to grow. Same for MSFT post-earnings, Pfizer (with its pathetically low beta), Apple, Coinbase, etc… don’t get in your own way making money. \n\nIf the market doesn’t make sense to you, trying to make sensible investments won’t make you money. Value investing is dead. For now.", "score": 2, "replies": []}, {"body": "Can I ask why you think MSFT is overpriced ? Pretty healthy balance sheet for the last earnings two weeks ago.", "score": 1, "replies": []}]}, {"body": "Hyperinflation would be the collapse of the dollar and right now the dollar is actually very strong.  The term you are looking for is secular inflation.  \n\nThis market is weird, but if we went through a prolonged inflationary period, growth stocks should go out... and value should be king.  Right now that's not what we are seeing.", "score": 32, "replies": [{"body": "The dollar is only strong if you compare it to other currencies. It’s losing about 1% of its value every month right now.", "score": 10, "replies": [{"body": "Prepare for downvotes, they can't see what is happening", "score": 7, "replies": [{"body": "Upvoted the both of you.", "score": 0, "replies": [{"body": "Can you still see my comment?", "score": 1, "replies": [{"body": "Yes!", "score": 1, "replies": []}]}]}]}, {"body": "That would be 12% inflation YoY. We’re seeing 6%. Inflation is high right now. You don’t need to lie to make your case stronger.", "score": 4, "replies": [{"body": "I don’t need to lie, but the government does. Real inflation is about 12% based on the government’s past models (before they changed it to make inflation look low).\n\nhttp://www.shadowstats.com/alternate_data/inflation-charts", "score": 4, "replies": [{"body": "First, if the government was understating inflation, then people would demand higher rates on TIPS. That hasn’t happened. \n\nSecondly, [external sources](http://www.thebillionpricesproject.com/) correlate far more to the new calculations than the old ones. Rather than conspire to hide inflation, it’s much more likely that they changed the calculation *simply because it’s more accurate*.", "score": 2, "replies": [{"body": "It’s not more accurate though. The new calculations obfuscate housing, food, and energy costs, which are peoples highest expenditures. They also make up shenanigans like “Owner’s equivalent rent.” These are all tools to artificially suppress TIPS and social security payments.", "score": 3, "replies": [{"body": "I don’t exactly know what to tell you, other than that if there were dramatic differences between CPI and the true rate of inflation, big money would take notice and would price TIPS differently than they do now. That hasn’t happened. Big institutions therefore trust the CPI, which is pretty good external verification considering their resources and their monetary incentive to get stuff like this right.", "score": 1, "replies": []}]}]}]}]}, {"body": "It's gained 6% YTD against the Euro.", "score": 2, "replies": []}, {"body": "> The dollar is only strong if you compare it to other currencies\n\nWhich is all that really matters", "score": 1, "replies": [{"body": "Many people still have money in checking and savings accounts losing 1% a month. Once everyone wakes up to this reality, hyperinflation becomes a real possibility. With inflationary psychology people try to get rid of cash as soon as possibly, which creates a downward spiral of currency devaluation. \n\nIn Weimar Germany, it took less than a year for the currency to fail: \n\nhttps://en.m.wikipedia.org/wiki/Hyperinflation_in_the_Weimar_Republic#/media/File%3AGermany_Hyperinflation.svg", "score": -1, "replies": [{"body": "This is assuming people understand the mechanics of the economy. The average person hasn't a fucking clue", "score": 1, "replies": [{"body": "They don’t need to understand very much. All they need to know is “Prices are going up, so I better spend my cash right now.” Hyperinflation has recently happened in countries like Venezuela, whose education system ranks 59th out of 128 countries.", "score": 1, "replies": []}]}]}]}]}, {"body": "I think people hear buzzwords like “Hyperinflation” from prominent people like Jack Dorsey and immediately think that it’s imminent, without taking into account what hyperinflation actually means. \n\n Firstly, Jack is clearly not well versed in the macro environment, and doesn’t recognize that the variety of data we have at our disposal indicates that we’re in a period of sustained secular inflation, and no where near hyperinflation. I would prefer people like Larry Summers or Mark Carney who actually are trained in the theory and practice of real-world application of monetary policy to have the spotlight on these matters, but their names perhaps wouldn’t generate as many clicks.\n\nHyperinflation, defined by most, is marked by *month-over-month* inflation rates exceeding 50%. Just for some context, our 30 year high of 6.2% was on a *yearly* basis. Of course, that is measured using the highly accommodative CPI numbers, the real rates are likely in excess of 10% if housing and other watered-down consumer staples were measured the same way they were in the 1970’s.\n\nAlso, consider the place that the USD has in the world currency markets. It is currently the world reserve currency, and unless there are major shifts in the underlying machinations or the USD and it’s role abroad, it will not experience hyperinflation. Recent examples of hyperinflation in the likes of Venezuela, Argentina and Zimbabwe were a rejection of the local currency in favour of a foreign one, which in all 3 cases was the USD. Even looking back further, the Weimar Mark was a local fiat currency that was also dumped for gold and other foreign currencies.\n\nYou can bring up the fact that historically, world reserve currencies typically only have a ~70 year shelf life before dissolving via fiat debasement or passing of the torch via military conquest. And the USD happens to be in year 76 since the inception of Breton Woods, so it is due for a shakeup on that basis alone.\n\nBut in reality, the USD is in a commanding position in terms of world currency reserves, comprising of 59% of the total liquidity (As of 2020, down from 66% in 2015), and is being buoyed by Federal Reserve dollar liquidity swap lines with other central banks that are helping ensure other countries have enough USD liquidity in the times of crisis, should they arise in the future. \n\nThe issue is that not every country is involved in these swaps, and in fact, some major world powers such as Russia are actively decoupling themselves from USD reserves, evidenced by their National Wealth fund dumping all USD, and pivoting towards the Euro. China is also mulling over similar actions , as they have already dumped T-bonds en masse recently.\n\nDomestically speaking, record $89bn trade deficits, record $27tn public debts, record deficit spending, record debt/GDP ratios as a %, record first time unemployment claims, record Fed balance sheets, record low T-yields, record gas prices via ESG initiatives and misguided energy policy are all potential catalysts for continued secular inflation and signal a weak economy. Another insane fact is the United States total tax receipts for 2020 don’t even cover the amount to service that $27tn debt.\n\nJack Dorsey may not have the financial incentive to pick up a loose $5 bill on the street, but I’m sure many of us still would. \n\nAnd until we don’t, hyperinflation (partly a product of consumer psychology) will not occur solely on the actions of monetary policy.", "score": 1, "replies": []}]}, {"body": "I like how the thread turned into yet another inflation argument thread instead of recommending stocks if the inflation narrative is wrong. Which is more helpful.\n\nThose people who recommended to buy ABNB during the height of the Delta variant FUD instead of arguing Delta variant will shut down everything made me a lot of money. Just seems this sub is giving out less and less DD/recs as time is going on. I'd say if we are in the peak of inflation and supply chain issues. Probably small/mid cap and growth is what would be best to buy. As the play is buying good balance sheet companies and throwing away any risk/spec stocks.", "score": 14, "replies": []}, {"body": "It's not transitory. That was always a stupid talking point. The inflation that happened is sticking around. It may fall back by a percent or two in some areas, but I'd be prepared to accept the new price hikes as permanent.\n\nIronically with hyperinflation I suspect you can't go wrong with most stocks unless the stock itself goes out of business. Assets and debt are probably great to have during hyperinflation.", "score": 30, "replies": [{"body": "Talking about hyperinflation in the US is so funny 😂😂 literally could not be further disconnected from economic reality", "score": 28, "replies": [{"body": "I think with political factors and accounts balances, if the US were to lose its reserve currency status, it could legitimately enter a hyperinflationary spiral.  However, that is a big if that does not seem likely in the near term.", "score": 6, "replies": [{"body": "I can't see why the Fed would keep printing money if hyperinflation actually becomes a possibility.\n\nThey'd just let the asset bubbles pop.", "score": 0, "replies": [{"body": "Because debt means nothing in a hyperinflation environment and the truth is that the rich can just bounce. None of the people in charge care about what happens to the masses past convenience. If it pulled their individual asses out of a fire, they’d let the whole country burn.", "score": 4, "replies": [{"body": "Hyperinflation is terrible for business.  It's not going to happen.\n\nLetting asset bubbles pop is GREAT for those who have lots of cash.  The rich have lots of cash right now.  It will screw everyone else.", "score": 2, "replies": [{"body": "The rich have lots of cash? How do you know most of their wealth is in cash and not assets? \n\nThe truth is there is a way to play out of any scenario of you have a lot of resources. If debt is ever the overriding concern for those in power, expect to see monetary policy that stokes inflation as a solution to that. I do believe that is partly what’s occurring now in the US, as debt has now eclipsed GDP and is likely to continue rising. Introducing a little inflation into the system takes some of the edge off.", "score": 2, "replies": [{"body": "Yes, the rich are hoarding cash.  Look at Buffet's fund.  They are running out of places to put it.\n\nA nice correction would solve that problem.", "score": 0, "replies": [{"body": "Buffet has actually recently sold off more stock than he did in 2008, mostly bank/Insurance/Financial stocks", "score": 2, "replies": []}]}]}, {"body": "It's the contrary my man, no one who's wealthy has a lot of cash.\n\nThey may have cash temporarily while moving positions, but no billionaire is sitting on billions of dollars worth of cash. The only people who save in cash are people who for whatever reason have no access to an alternative and idiots.\n\nIt's obviously not an idiotic move to sit on cash while a market crash happens, but that's not the case right now.", "score": 2, "replies": [{"body": "There's a wide range of strategies, and yes, pure cash for the ultra wealthy is usually unneeded with their easy access to loans.  In general, the wealthy DO have access to funds to scoop up cheap shares post crash is my point.\n\nBut from what I'm reading, more \"regular\" wealthy investors are increasing their cash positions in anticipation of a downturn.  I certainly am having a hard time finding attractive places to invest with the current market prices given the economic uncertainty.", "score": 1, "replies": [{"body": "> I certainly am having a hard time finding attractive places to invest with the current market prices given the economic uncertainty.\n\nThing is everyone has been saying this for over a year. Since the pandemic started and stocks started going up endlessly people have been \"well it's been hitting new ATHs a lot so I don't feel safe investing in anything\".\n\nThere's also not that much economic uncertainty, that's media bait, I'll make this simple for you: any media outlet that even dares mention hyper inflation should straight up be ignored, because all they're doing is fearmongering. The media have been playing you for decades, they started to make it super obvious when Trump came up, then with COVID it became even more obvious, this applies to both sides. Read what they're saying, **think** for yourself if what they're saying makes any sense and co-related with reality, if the answer is \"not really\" or just \"no\" then you never read anything from them again.\n\nIf wealthy investors were actually increasing their cash positions stocks wouldn't be on a rally, don't you think?", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": ">It's not transitory. That was always a stupid talking point. The inflation that happened is sticking around. It may fall back by a percent or two in some areas, but I'd be prepared to accept the new price hikes as permanent\n\nThat... Is transitory. It means that we won't continue seeing 5% inflation for long periods, but that maybe we get 5% this year and then back to normal 2%.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "When there is rapid inflation, wages tend to take a while to increase. This keeps a lot of people down for years as they try to make up the difference.", "score": 2, "replies": []}, {"body": "By that train of thought, all high inflation periods are transitory, because no one wants it and as soon as it sticks around there will be active efforts to get rid of it. So its basically useless to talk about it like that\n\nPowell at various points not only suggested it would moderate, but that a lot of it would reverse as it was caused by supply chains. I think this is legit 1970-80s style inflation and we need to come to grips with it", "score": 3, "replies": [{"body": "Yet how many of those periods did inflation rise 3-4% in a year and the Fed just said….”eh we will worry about this next year if it’s still here”.  \n\nThe Fed used to move rates 3-4 times a year on average.  Now we maybe seeing a once in generation inflation and our Fed is not planning to deal with it, so it hurts the arguments of “they always have active efforts to get rid of it”", "score": 0, "replies": [{"body": "Yes because Redditors know how to run monetary policy for the USD.", "score": 0, "replies": []}]}]}]}, {"body": "Watch 2023 back at 2%, transitory does not mean back down in 5 months", "score": 2, "replies": []}, {"body": "Pretty much you’re better off owning stocks in any case except deflation.", "score": 1, "replies": []}]}, {"body": "I will continue to buy tech regardless, not worried about this hyperinflation story in the slightest. If you think GOOG MSFT AAPL NVDA AMD TSLA won’t still be crushing it in 5-10 years I have a bridge to sell you.", "score": 3, "replies": []}, {"body": "Hyperinflation is not coming. There’s simply no mechanism that would cause that. Is high inflation a reality? Yes, that 6% inflation is here to stay and probably won’t start going down for awhile. So, keep less cash. Buy assets. Not really gonna change much except USD is worth less than it was by a bigger amount than in recent years.", "score": 7, "replies": [{"body": "The rumors of who the five new people at the Fed will be disagrees with that. They are all very pro-inflation. Plus, if they weren't, the current failed administration wouldn't appoint them since they want the economy to not look like it has crashed since they seized power.", "score": -1, "replies": []}]}, {"body": "Any hypergrowth company with scalable business model (50% revenue plus yoy).\n\nGrowth companies in early stages which are not profitable now are most affected by inflation.", "score": 4, "replies": []}, {"body": "I try to avoid most news because it’s so dramatic  and often wrong in it’s assumptions. Where are you hearing about hyperinflation? By how non-chalant your comment is, I’m betting your sources don’t completely understand how catastrophic that would be to our lives. \n\nHyperinflation would destroy the economy and what’s left of the fabric of this country. And quite possibly the entire world given the importance of the US dollar. In that environment the items in your shopping cart would increase in costs as you waited in line to purchase them. People frantically buying everything because it will be more expensive tomorrow. Think empty shelves at stores, workers pay having to increase monthly otherwise your $2000 paycheck only has half the purchase power it did just 30 days ago. Truck drivers not showing up to work because what’s the point. So no restocking of stores. Nothing to sell means mass layoffs of workers. Basically the entire system would crumble. Anyone who thinks a true reset would be great is also kidding themselves. If you live in a remote area with good neighbors and a strong support system you may be fine. Everyone else would be living a more of “only the strong survive” type of reality. This country in it’s current state would get real ugly, real fast. \n\nI wish I would stop hearing people wishing for a great reset. They don’t know what they are talking about.", "score": 5, "replies": []}, {"body": "Hyper inflation and inflation are not the same. There is not going to be hyperinflation the term is being thrown around like crazy lately.", "score": 3, "replies": []}, {"body": "Travel stocks- hotels and airlines worth a shit like AA and CHH, cruiselines. Probably not LUV unless you're willing to long it for a few yrs. WWE because their revenues didn't come back to pre-covid levels until summer this year. With live attendance back in full swing they're making a lot more money, making huge cuts to make their Q and annual look even better and/or preparing for a buyout, likely candidate being NBC Universal. McDonalds, Coca-Cola because nobody's stopped drinking soda or eating like shit and time has tested even during the hardest times these good ol' American companies thrive as long as sugar is subsidized in the US and people continue to hate their bodies and teeth. DISCK, merger with Warner Media is heavily undervalued and is one of my top year-long plays. Should be priced in about next summer or year from now, probably whenever they reveal the new streaming hybrid that comes out of HBO Max+Discovery+ . You'll see huge fomo on that one when the time comes. If you get in now do a remind me for a year out. You're welcome. GEO because public unrest is ontrack to worsening, ICE arresting more people with no signs of slowing down, very bullish on this private prison stock. FCX as copper is increasingly becoming more valuable with a variety of strong needs such as semiconductors/electronics use and a large supply gap. DIS, AAPL, BAC, SCHD for dividends and great trackrecords of growth with no sign of stopping, based on your theoreticals and fundamentals of the current bull market. Despite those advantages and possibilities I'm very bullish on DIS and AAPL. DIS is similar to WWE based on fundamentals since they're both entertainment companies that have presence in live attendance, streaming services, diverse audiences worldwide and merch up the fucking ass. DIS does a great job at digging out old properties and repackaging them for modern audiences. Disney+ is seeing continued growth and use, proven effective through covid with theater shutdowns. Fantastic Four on the way, another 20 yrs of Marvel movies, Star Wars, domination in toddler and children's culture, brand loyalty in their parents to the point they place shitty funko pops of DIS properties around their living spaces like its their religion. No sign of DIS stopping. AAPL because they continue to innovate, dominate and prove they can sell a cellphone for a thousand dollars nobody needs and people will still buy it. That's brand loyalty right there. People shat on ipad and it was a huge success. People shat on apple watch and it was a huge success. Lest we forget all the copycats replicating those devices shortly after Apple did it first? They set trends, are extremely aware who their consumers are, diversified into a streaming service filled with S tier quality films with the biggest stars in hollywood filling their presence in homes that don't even have apple devices, always slaving away at something incredible behind the scenes that changes everyday life. Lastly, GNW because like DISCK its extremely undervalued.", "score": 2, "replies": []}, {"body": "Costco? Didn't they do pretty great through all this?", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": ">What I’m really trying to understand is, at what point will the markets fully price in the interest rate increase, or has that already been priced in? At what point will people have to actually care about how overvalued stock is?\n\nWhen you can make money with bonds again. That's when I would expect a rotation out of stocks and into fixed income.", "score": 2, "replies": []}, {"body": "It’s about global delivery chains. Corona and the trade war between USA and China reversed the globalized capitalism which had deflationary tendencies (overruling the inflationary tendencies).\n\nI guess that over time more offers will be presented to the demands like always (money will flow again into oil and gas exploration, money will flow in new chip facilities etc.).\n\nOver time there will be again more offerings and that will be deflationary. So far my expectation. But dont know when.", "score": 0, "replies": []}]}, {"body": "Banks", "score": 2, "replies": []}, {"body": "Tesla.", "score": 4, "replies": []}, {"body": "Look up who Ryan Cohen is", "score": 2, "replies": [{"body": "Careful, they don’t like companies with solid fundamentals, no debt, huge cash reserves, big vision and rockstar c suite teams here. Especially when they have a cult like following in their investor base, who overlaps heavily with their customer base. \n\nThis is the sub that was saying Tesla was overpriced at 100 pre split. Their recommendations are always “buy companies who have already peaked and will decline from here.”", "score": 3, "replies": []}]}, {"body": "Inflation is not transitory, but we will not have hyperinflation. If we have hyperinflation you probably need to buy a gun and can food for the upcoming apocalypse.\n\nInflation is rising for sure. But will not keep exceeding 5% for long. Once supply chains comeback to normal.\n\nBut once a retailer or wholesaler increases prices. They usually never go back down. So that is permanent for sure. They do go down if competition happens. But even the competition increased prices too. Plus companies want to keep margins high for stockholders.", "score": 1, "replies": []}, {"body": "There won’t be anything anywhere remotely close to hyperinflation. For example hyperinflation happened in Germany after WW1, in Zimbabwe in 2007 and more recently Venezuela in 2018. The main reason this happened is because they all printed more money although their economies were going down. The big difference is that our economy is getting better so we will be ok.", "score": 1, "replies": []}, {"body": "My dude, even if the inflation you guys have in the US isn't transitory you're not even close to hyper inflation.\n\nWhat's your expected inflation now? Like 4% a year? Hyper inflation means you have like 40 times that.\n\nMy country has a 40~50% annual inflation rate, we've been there for a while, and it's still not an hyper inflation.\n\nInflation is most likely gonna be transitory, the whole world is going through inflation because supply chains got fucked by COVID, give it time.", "score": 1, "replies": []}, {"body": "Guns n ammo stock...physical too", "score": -4, "replies": [{"body": "Actually, I agree, but not for the 'we are headed into a Mad Max dystopia' theme and more for the solid earnings with no debt.  The Obama admin coerced banks to not lend to gun makers (they tried to prevent CC issuers from processing payments, but that was a bridge too far).  This means that RGR and SWHC ended up paying down all of their debt, and now can distribute large dividends and buy back stock.", "score": 2, "replies": []}]}, {"body": "Our lives are transatory, as well. Depends on your time horizon.", "score": 0, "replies": []}, {"body": "It won’t be hyperinflation - with the petrodollar standard and being the worlds reserve currency, it’s unlikely demand would ever be so low versus supply that hyperinflation would occur.\n\nHowever, inflation occurring right now clearly isn’t ‘transitory’ and that was always a bullshit narrative to keep the masses pacified as the fed and politicians whittle down their wealth even more in the face of unprecedented income inequality. \n\nHigher prices are definitely here to stay.", "score": 0, "replies": []}, {"body": "BLS said the inflation rate is 10.8%.  It's really higher than that since they don't count a lot of things. You think that's just going to go away? New Fed presidents are being appointed that hate this country and love inflation so it's just going to get worse. Also, Yellen said 10% is zero.", "score": 0, "replies": []}, {"body": "If this is the case, that’ll also mean the US-China relationship is figured out. We might enter another period of several years of good time.", "score": 0, "replies": []}, {"body": "Americans keep referencing hyperinflation but they have no clue what it even is. On paper they do, but if they actually knew what it was they would know the likelihood of it happening is very low. Stop worrying about hyperinflation folks, you're not in Argentina.", "score": 0, "replies": []}, {"body": "The only way they can make inflation not transitory is by causing a market crash essentially. There is no safe asset in this case, only insurance.", "score": 0, "replies": []}, {"body": "Dollar hyperinflation would cause the collapse of western economy", "score": 0, "replies": []}, {"body": "I'll keep buying the stocks I love and believe in.\n\nI dipped out of HXL but only to pump more into NIO. I'll be back next year for HXL", "score": 1, "replies": []}, {"body": "Don’t worry, market crash doesn’t come with inflation. It comes when big whales want it to come.", "score": 1, "replies": []}]}
{"title": "$wish Diamond Play Long thesis", "selftext": "Update : The market tend to overshoot on on the long and short side. $Wish is one the most undervalued investment to take now. Most people will say they are losing revenu and market. 1) No Recent Tech IPO is profitable, they need money to grow and the IPO provide that money those high growth company needs. 2) Wish lost market share, howerver they are implementing a lot of correction before squeezing the ads for the whole entreprise to be profitable. Still, 90 millions users on a stock that is pretty much woth 1 Year of sale is insane, My Target is 30+ in 2022. \n\nHere is few takeaways after last earning call :\n\n1) 5$ is truly the historical bottom\n\n2) Wish will grow to be a much better profitable company, with better retentention\n\n3) We will see significant quality upgrades on the products in 2022\n\n4) Wish is making deals like there is no tomorrow with a lot of company\n\n5) Ceo and founder stepped down without any fight …\n\n All the steps are in place for a turnover within a year. This is ridiculously undervalued. Top that with a ceo replacement and 243 jobs posting within a month, I would say things are moving in place and someone has a clear plan with this company. You dont hire so much people if you are not planning on growing 🧐. Why is the replacement of the CEO important, because it means changes are coming :   “if you believe that your company is planning to merge, or has secretly already agreed to merge, and the announcement might not be for several months, then the resignation of key employees can be seen as bullish.”  To me is very strange to see $WISH CEO steps down so easily, he seems someone that would fight until the end and we saw that on the past.. For that reason I think that we would have a buyout coming.. \nSo let’s put pieces together. Wish has been posting a lot of executives positions on linked recently. A lot of the management team comes from tech and google. Now the new cfo Vivian managed buyout for two previous companies. Seems like wish will follow the track of a potentail buyout opportunity or a great future growth. \n\n\n \\-4th highest app usage in USA behind Amzn, Walmart, eBay\n\n \\-new Australian office run by ex Silicon Valley exec \n\n\\-Wish Local = mini fulfillment centers at no cost. Same day p/u -Wish Express (5 days or less ship) available\n\n \\-Wish Access ($5.99 unlimited ship) being rolled out -Wish Parcel = discounted logistics to small biz. 1B revenues\n\n \\- Deals w/PrestaShop (300k merchants), Cafe24 (1.9M merchants)\n\n \\-Postal deals w/Spain (Carreos), China, USPS, Africa, Czech (tax exemption in EU) -payment processing license in EU  \n\n\\-BNPL buy now pay later at checkout as well as Applepay -650 new hires creating new departments and efficiency \n\n\\-new Exec Chair running daily operations Jackie Reses (SQ, Yahoo, Baba, Affirm, Goldman)\n\n \\-new CTO Google, eBay 10 years (ran Marketplace)  \n\n\\-new CPO (Ads/SocialMedia) Google, Flipkart, Twitter, Bing  \n\n\\-5 out of 10 merchants are in USA and make up 1/3 sales\n\n \\-TikTok type merchant videos and FB type Wishlists w/followers being created", "id": "qsquwz", "created_utc": 1636769400.0, "score": 75, "upvote_ratio": 0.77, "num_comments": 92, "comments": [{"body": "This shit will get pumped just waiting for the hedges to recoup losses with this", "score": 35, "replies": [{"body": "Vanguard just increased their $WISH long position by 460%. $WISH to $69.42! 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀", "score": 21, "replies": []}]}, {"body": "sell shit doesn’t matter. It’s meme stock. MEME to the 🌝!", "score": 20, "replies": [{"body": "Exactly! There are s.h.i.t.c.o.i.n.s with 10x more market cap than this. Meme status alone should be worth at least $10B! $WISH to $69.42! 💎🙌🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀", "score": 19, "replies": []}, {"body": "Wish to $69", "score": 9, "replies": []}]}, {"body": "Snap, Jumia, GME and AMC had/has way bigger issues than Wish recently and look at where they are now (they all increased several thousand %). Wish has a lot of resources and competent leadership to turn the situation around. Wish also has quite a strong balance sheet, and is virtually debt free with marketable securities, cash, and cash equivalents of approximately $1+ billion. I believe Wish is undervalued and it will be a multiple bagger in 2022 or 2023.", "score": 11, "replies": [{"body": "Well\nSaid 🚀", "score": 5, "replies": []}]}, {"body": "The company’s Executive Chair, Jacqueline Reses, stated that Wish is making progress towards long-term growth and profitability. She also mentioned marketing cost reduction as a positive highlight from Q3:\n“From a financial perspective, we exceeded our bottom line guidance range in part due to more efficient and reduced digital advertising spend.”", "score": 9, "replies": []}, {"body": "Post Position son", "score": 17, "replies": [{"body": "Yes, position or ban", "score": 11, "replies": []}, {"body": "https://imgshare.io/image/pfJpFY", "score": 10, "replies": [{"body": "I didn’t know you could trade stocks on Excel", "score": 4, "replies": [{"body": "Also considering his entire portfolio is in the red seems like a great investment.\n\nMaybe hes got some Enron in there hes long on too", "score": 4, "replies": []}]}, {"body": "You're not very good at this are you?", "score": 1, "replies": []}]}]}, {"body": "WISH going to pop soon holding long on my shares🚀🚀🚀", "score": 15, "replies": [{"body": "I agree with that , it waiting on catalyst.", "score": 5, "replies": []}]}, {"body": "WISH to the 🌝!", "score": 10, "replies": []}, {"body": "But they sell shit right?", "score": 8, "replies": [{"body": "Right? Dude is talking about a “historical bottom” on a stock that hasn’t been listed a year, and seems to be claiming with zero evidence the quality of the products will improve. If the quality of their products does improve (giant fucking if) their prices will likely go up, and then they’re squarely competing with very well established companies like Amazon. Where they’ll get slaughtered. I may be a crayon muncher, but this post is even stupid to me.", "score": 16, "replies": [{"body": "Recently hired rock star management. And they are working on tiktok like shopping experience. $69.42 incoming, baby! 💎🙌🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀", "score": 11, "replies": [{"body": "Retarded", "score": -1, "replies": []}]}, {"body": "Niche - Amazon can’t be a fun shopping e-commerce platform. It has to be bland, so u can find your shit and get out. It’s why they tried to buy wish, and it’s shocking so many miss this. Wish is banking on the experience not cheap products", "score": 1, "replies": []}]}, {"body": "Nah, shit is too high quality to come from wish", "score": 9, "replies": []}, {"body": "NOPE! Some is, but most now is good stuff. They’ve been getting rid of merchants, not paying them or fining them ($3mil month in fines).", "score": 1, "replies": []}]}, {"body": "$wish video shopping is going to hurt my wallet once my wife finds out", "score": 2, "replies": [{"body": "She likes cheap stuff?", "score": 0, "replies": []}]}, {"body": "For fucks sake it’s a company that’s all the DD I need. It’s my money and I want it now!!!", "score": 4, "replies": [{"body": "It’s about that money so make it.", "score": 1, "replies": []}]}, {"body": "WISHQ by end of 2022.", "score": 3, "replies": []}, {"body": "$WISH will easily go to 69 in the very short term... 69 pesos that is ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Dollar store with logistics and operating costs that exceed the value of the products is a sure way to go bankrupt.\n\nThe margins are shit and CEO being fired.  Unless they bring in Steve Jobs this company is fucked.", "score": 2, "replies": []}, {"body": "OP sounds like that fintwit Zach guy or one of his sidekicks.", "score": 1, "replies": [{"body": "Position link : https://imgshare.io/image/pfJpFY", "score": 4, "replies": []}, {"body": "Screech?", "score": 2, "replies": []}, {"body": "Zach Morris…. Pump and dump. But I think his wish shares is stucked at ATH", "score": 1, "replies": [{"body": "His shares are stuck at ATH? Hmmm… 🧐…🚀?", "score": 2, "replies": []}]}]}, {"body": "Aren't they also losing customers and retention?", "score": 1, "replies": []}, {"body": "Their website is garbage, make you  sign up before you can even see what’s on it. And then when you do it’s no different than Aliexpress.", "score": 0, "replies": [{"body": "AliExpress is a serious e-commerce as long s as you stick with reputable sellers (I.e. those with enough sales/reviews). Wish OTOH…", "score": 2, "replies": []}]}, {"body": "What does “$5 is truly the historical bottom” even mean", "score": 1, "replies": [{"body": "Translation is a little rough", "score": 0, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|12|**First Seen In WSB**|4 months ago\n**Total Comments**|12|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/qr9jtk/thesis_on_wish_updated_this_is_the_bottom/) [x](https://www.reddit.com/r/wallstreetbets/comments/qra3v9/wish_a_deep_value_bet_thesis/) [x](https://i.redd.it/q6lrr77xe4s71.jpg) [x](https://www.reddit.com/r/wallstreetbets/comments/qsquwz/wish_diamond_play_long_thesis/) \n**Account Age**|9 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=qsquwz)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=qsquwz)", "score": 1, "replies": []}, {"body": "How does it reach $30 by 2022 when, in its most optimistic outlook, the company says it won’t turn things around until Q4 of 2022 which will be reported in 2023.", "score": 1, "replies": [{"body": "It’s a stock market, it can turn around within a quarter.", "score": 5, "replies": []}]}, {"body": "Waiting for this one to end up with the OTC's.  Few bucks down to go.", "score": -2, "replies": []}, {"body": "Seriously  no offense , this DD is bad; where’s the earning number ? Tells you a different story.", "score": -2, "replies": [{"body": "> I'm not going to tell you my earnings because I don't want people to know how much money I make.", "score": 10, "replies": [{"body": "Yeah , but are you wise with money ?", "score": 0, "replies": []}]}]}, {"body": "Wish is total garbage.", "score": -4, "replies": [{"body": "Your opinion is total garbage 😂", "score": 4, "replies": []}]}, {"body": "👎", "score": -5, "replies": []}, {"body": "$5 is about fair market value for junk suppliers like wish and wayfair", "score": -1, "replies": []}, {"body": "Their margins are atrocious. What’s their plan to resolve?\n\nWhat about their cash burn?\n\nBeing unprofitable is ok if there is a believable plan to become profitable as well as a plan that funds the cash burn until then in a way that doesn’t destroy shareholder value.\n\nEdit to add: how are all these new hires incentivised - big salaries or stock awards based on performance?", "score": -4, "replies": []}, {"body": "wish sucks. have you ever used their site?", "score": -5, "replies": [{"body": "Think like a investor, stop being bias", "score": 2, "replies": []}, {"body": "Yep & I still do.", "score": -1, "replies": []}]}, {"body": "No.", "score": -3, "replies": []}, {"body": "WISH sells shit that even poor folks don’t want! They need to start selling good stuff……it’s like alibaba in 04!", "score": -3, "replies": []}, {"body": "When you look at what analysts are saying, they don't expect the company to become profitable.", "score": -3, "replies": []}, {"body": "No love for WISH, just a shit company like GME / AMC but no love yet. WISH needs to start selling better quality products - no one cares about positive earnings for now.", "score": -4, "replies": []}, {"body": "Look at the ER . Shit the bed", "score": -5, "replies": [{"body": "Waiting for catalyst to pop . You are blind", "score": 4, "replies": []}, {"body": "So did…. Nah let me not go there  ![img](emote|t5_2th52|4887)", "score": -1, "replies": [{"body": "You looked ? What you think?", "score": 1, "replies": []}]}]}, {"body": "Literally just look at the thumbnails on their FB ads. That's all the DD you need on the stonk.", "score": 1, "replies": []}, {"body": "nice $WISH.", "score": 1, "replies": []}, {"body": "\"5 dollars is truly the historic botton\" \nGUHHH", "score": 1, "replies": []}]}
