{"title": "AMD to $200? What do you think ?", "selftext": "AMD possibly to $200.\n\nAMD possibly outperform nvidia in sales, cuz AMD covers cpu for retail and business purpose too.\n\nAMD is innovating CPU , once monopoly  intel is now slacking.\n\nZen 4 of AMD is scheduled for release next year . \nBench mark of normal CPU at 64 cores , 128 threads. New Zen 4 has 128 cores , 256 threads.\n\nAmd chips sized at 7 nanometres, and possibly to 5nm in 2 years . Intel sized at 10 nm.\n\nNet profit from sales quite good.\n\nPossible trade opportunity for Long term option", "id": "r3acq0", "created_utc": 1638006689.0, "score": 84, "upvote_ratio": 0.78, "num_comments": 99, "comments": [{"body": "It's already been to $160, I think $180 is very possible by Q2 next year. Not sure about $200, maybe EOY 2022?", "score": 36, "replies": [{"body": "Honestly halfway thru 2022 it’ll be 200 IMO", "score": 19, "replies": [{"body": "This. I was only hoping for $110 max this year but then moon.", "score": 4, "replies": [{"body": "I sold 120 CC and have such regret. I thought it'd bounce around that $110 mark for a while and boy was I wrong lol.", "score": 5, "replies": []}]}, {"body": "I think so too when zen 4 release . Just announce tesla will use amd for model y entertainment", "score": 3, "replies": []}]}, {"body": "This sounds more realistic", "score": 7, "replies": []}]}, {"body": "I'm holding 85$ 1/23 and 105$ 1/23 calls, looking for $200 next year to start exiting my position.", "score": 17, "replies": [{"body": "heh.. i bought 11 shares of amd in 2010ish when it was $8... i wish i bought more. im up something like 1.7k", "score": 6, "replies": []}, {"body": "Woooow, how much percent gain are those haha?", "score": 5, "replies": [{"body": "I bought 5 of each of them when they were trading about 20$ over each strike price. I also had purchased a number of 11/19 105$c so I have been payed off plenty by AMD this year and am very comfortable holding these to look for 200.", "score": 12, "replies": []}, {"body": "[bout three fifty](https://i.imgur.com/KTIJAta.jpg)", "score": 4, "replies": [{"body": "Neh I got in much later than him . Ady 700% tendies", "score": 4, "replies": []}]}]}, {"body": "Holding 4 of the same contracts.  See you in outer space", "score": 4, "replies": []}]}, {"body": "Nvda underdog I like it AMD🚀", "score": 10, "replies": []}, {"body": "AMD will follow Nvidia chart\n2.5d / 3D stacking NAND chips\nHeterogeneous computing \nEz 10 bagger\n\n$200 2022 eoy easily", "score": 10, "replies": [{"body": "I think hit $200 by July 2022 and fall slightly after release of zen 4.", "score": 4, "replies": [{"body": "July 2022 you mean mate?", "score": 4, "replies": [{"body": "Yes ty mate for spotting that out haha", "score": 5, "replies": []}]}]}]}, {"body": "Definitely true, intel is definitely behind, but next year I think it was around March that I two is releasing a gaming lineup, more powerful, and to get a foot into the door and catch up, it'll probably be at the same or lower prices as AMD and Nvidia, I've also been wondering if I should buy amd", "score": 20, "replies": [{"body": "I think it's hype , if it's prototype isn't ready", "score": 8, "replies": [{"body": "Market isn't as bullish on AMD as I am because the market is full of noobs. I was on AMD from $2 to 15 then took a break elsewhere, and I'm pissed I didn't hold longer it would have made me rich lol.\n\nEveryone thinks Intel is gonna catch up which they are doing to an extent in consumer space on performance but I don't think so in servers unless something drastic happens.\n\nAMD is prioritising efficiency now which heavily hints to me they are looking to dominate the HPC server market. Market has barely reacted to them trouncing Nvidia with a GPU that Intel has been failing to make work for the DoD with a bottomless pit of govt subsidy (Ponte Vechio equivalent).\n\nAnything could happen though, the chip sector is moving fast, I had a $180 target but I think that's unlikely until end of Q1 22", "score": 11, "replies": [{"body": "I am targeting Q2 but when I will let go of my calls. Was the original plan .\n\nBut since its innovating and growing . I might get a 2-4 yrs call.\n\nIf this isn't in the mod bag. My post might get deleted. More censorship than ccp right now", "score": 8, "replies": [{"body": "I reckon 300+ in 2-3 years but idk shit", "score": 3, "replies": []}]}, {"body": "Very insightful and spot on.  They are absolutely prioritising efficiency like you said, they are focusing on the server market while still dominating new sales in the consumer market with CPU's.  Intel has a way to go to catch up again.  I personally don't think they'll catch up anywhere in the near future so AMD is poised to continue to grow.  Especially once the merger goes through.", "score": 7, "replies": [{"body": "They also dominate the laptop market now, they have a chip in Tesla, if they are going into that market with strength they will boom Nvidias original ramp up was all about self driving cars. They are dominating the APU market which is likely to boom, they have exceeded my expectations of them when I was bullish years back, I was stupid enough to listen to the debt issue. Their big risk is they are reliant on other foundries.\n\nI think Intel is going to crash and burn personally I think the doubters are right, they are going to overextend trying to do everything and failing to win anything, they are literally copying AMD and Apple, nothing suggests they will exceed them, their big advantage is they have some very well developed accelerated Math libraries but AMD is catching up fast, with CUDA as well. They'll be relegated to a decade of celeron level (relative) chips in budget laptops and languish at a $40 share price imo whilst they slowly lose their grip on distributors and PC brands. Idk though their AI/Auto offerings might be winners, and all chip tech is going to be a winner on some level.", "score": 2, "replies": [{"body": "I'm very interested to see what their GPU looks like next year. Could be a flop but I would love to have some more GPU competition.", "score": 2, "replies": []}, {"body": "The news for amd in tesla mcu is new to me . Thats incredible news lol\n\nCompanies in debt can have increasing stock price better than companies in net profit", "score": 1, "replies": []}]}, {"body": "Whats going to happen to AMD in datacenter/server once everyone designs their chips in-house like Apple? Facebook, Tesla, Amazon, Baidu etc.. are developing their own chips. For example Google's chromebooks will be powered by it's own in 2023. I'm sure AMD will do well over the next year or 2, and surpass 200 a share easy.  But I think the long term winners will be TSM/Samsung/Intel/MU for their fabs, as demand for chips and memory is increasing exponentially", "score": 1, "replies": [{"body": "Tesla has proof of concept for their chips. But fb, amzn,baidu  needs to get their prototype  ready or it's just all story telling.\n\nIntel I don't think it's biz & consumers going to like", "score": 1, "replies": []}]}]}, {"body": "This. AMD has always focused on HPC and has trickled down the unworthy dies to retail. If intel goes all out on retail they will get back the marketshare, but the moneymaker is HPC", "score": 4, "replies": [{"body": "Amd can scale HPC for the masses. The prob is most companies use HPC for hype but it's unscalable because too many expensive appendix and manufacturing for masses is harder than prototype. In simple words intel has been selling low ends and not innovating IMO.", "score": 1, "replies": []}]}, {"body": "Intel will catch up in the servers area in 2022 and then probably fall behind after AMD releases it's next gen.\nQ3 2022 Intel releases sapphire rapids for servers.  I would be more concerned for AMD it arc starts to steal low end GPU sales when Alchemist is released in the fall. Full disclosure I own INTC.", "score": 2, "replies": []}]}]}, {"body": "Puts on intel sounds like free money to me", "score": 3, "replies": []}]}, {"body": "I'm super bullish on AMD. You know their first truly gaming gpus were released ast year. And as a result Nvidia lowered their prices for their GPUs which is a great sign that that they feal the competition. \n\nI'm investing in both AMD and Nvidia, yet I see the room for growth is much bigger for AMD, they just need time. I think them being making CPUs and GPUs might give them optimizatin leverage that will pop up someday in the future.", "score": 17, "replies": [{"body": "Hoping AMD has a run like NVDIA", "score": 7, "replies": []}]}, {"body": "Easily by the end of Q1 2022. My target is $225 for this time frame.", "score": 9, "replies": []}, {"body": "If this new virus variant helps Jerome Powell get the money printer started again then $200 should be possible yes.", "score": 5, "replies": []}, {"body": "I got shares and 200c.", "score": 4, "replies": [{"body": "See ya at the lambo dealer 👍", "score": 7, "replies": []}]}, {"body": "I bought long term options before the meta deal.  Worked out well so far.  Will continue to hold.", "score": 3, "replies": []}, {"body": "200 is in like Flint.", "score": 3, "replies": []}, {"body": "just gotta get more influencers all there to get ppl to pile in", "score": 3, "replies": [{"body": "News and influencers only stream good news for crappy stocks", "score": 2, "replies": []}]}, {"body": "I think it could…but it also may not…", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|4257)", "score": 1, "replies": []}]}, {"body": "My $180c for 9/2022 exp is up 12%. I just bought it a week or two ago. Might buy more if it dips again. Might sell and buy back in Idk yet", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Did mods ban ur % profit scrn shot?", "score": 1, "replies": []}]}, {"body": "After doing some napkin math, I believe AMD will fall to the 120s resulting from the dilution after the acquisition is made firm. I think this expectation is reflected in the options open interest heavily skewed to puts as well. On technical merits, AMD will get to $200 in 4-5 quarters barring any macro events. Another interesting angle would be a speculative long on an FPGA producer that Nvidia could acquire, to compete with intel/amd. Lattice maybe? $LSCC", "score": 3, "replies": [{"body": "Thats something I didn't look into yet, thank you", "score": 1, "replies": []}, {"body": "I check history of acquisition mergers,  if good biz companies it's not the case", "score": 1, "replies": []}, {"body": "I know this is a month late, but your napkin math is wrong, at least in regard to the merger. The shares converted with Xlinix is not a dilution. It will do nothing to affect the intrinsic value of AMD shares", "score": 1, "replies": [{"body": "Hi, thanks for the input. My calculations were based on adding the market cap of xlnx with a 30% premium over the day the merger was announced to adjust for systemic appreciation, added that to the amd market cap and divided by the new combined float in amd shares. \n\nMaybe im misunderstanding something about the deal but the net effect to amd share holders will be a larger float in exchange for assets, which is dilutive, not saying its a bad thing, in fact im very long on both names, but it was just my opinion that a short-run equilibrium would quickly play out. Happy new year btw.", "score": 1, "replies": []}]}]}, {"body": "\"AMD to $200.\"\n\n\"Why doe?\"\n\n\"Idk cuz like its like pretty good company I guess.\"", "score": 6, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|9 months ago\n**Total Comments**|71|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=r3acq0)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=r3acq0)\n    \nHey /u/Krazy__cat, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "God I remember selling 1000 shares of this at 18 after a bullish earnings", "score": 2, "replies": []}, {"body": "It‘s possible but to be honest - the potential in the other direction is also very high.\nI wouldn‘t buy a huge amount of it.\nIf you weren‘t brave enough to jump in very earlier, it‘s just crazy to jump in now", "score": 3, "replies": [{"body": "Why do you think so? The fundamentals are there, the hype is there slowly. Xilinx aquisition will go through.\nAMD definitely has a step on Intel now. They have a good relationship with TSMC.\n\nOnly thing to go wrong would be China invading Taiwan but then we have more to worry about than some stocks.", "score": 10, "replies": []}, {"body": "Jumped in at $112- 119. Gonna screenshot of soon.\n\nBut I m sticking to the plan. Expected to $180 by next year even if it falls", "score": 5, "replies": []}, {"body": "I'm guessing you don't have any AMD stock and missed out on the gains so far? Why would you ever give someone advice to not buy a solid, proven stock? If everyone does their own DD, let them make their own educated decision on whether to buy or not.  Especially one that appears to have everything lined up for success in the future!", "score": 3, "replies": [{"body": "I didn‘t gave advice to anyone - just said my point of view.\nYeah, you are right - I didn‘t make any big wins until now.\nSo I think, it is to late to make big wins.", "score": 4, "replies": [{"body": "In my opinion, the momentum will continue with AMD for now due to intel still not having a proper response to all of AMDs products (intels new alder lake arch. Looks like to be start of something in consumer, next 18 months will be telling). AMDs only real limitation is TSMCs production capacity. Otherwise intel would have been passed up a long time ago.", "score": 3, "replies": []}, {"body": "so you think the amd stock will basically plateau? I disagree, the entire market seems to be growing and amd is taking increasing market share with a better roadmap than intel.", "score": 0, "replies": []}]}]}]}, {"body": "$200 - yes, but when? AMD fluctuated in 78-95 range during a year since Aug 2020, so we can see this again and price will reach $200 in 2023 only.", "score": 2, "replies": [{"body": "But there is new tech zen 4 128 cores for the masses . New innovative tech tend to move the stock prices up . Plus goina need an upgrade on the market cap. Wouldn't be surprised if it gets to $500 soon.", "score": 2, "replies": [{"body": "Did you get what I wrote? AMD almost a year ignored all positive news and beat earnings. A YEAR! Market can decide that zen 4 is also priced in, as well as many other good news.", "score": 4, "replies": [{"body": "I check the chart after your message , it went from Jan $50 to Dec $90 in 2020.  Now it did not stay stagnant.\n\nUr selecting a specific time frame of no plans of innovation. But it went from $80 in Aug 2020 to $108 in Aug 2021. Pls double check your DD. 80 - 108.. it wasn't as you mention, wasn't consolidating for a year.\n\nTesla gone up cuz of it's innovation for ai neutral network. While people chasing cosmetic designs and electric toy cars. \n\nI m for real here , why do you think it went 100 to 150 after zen 4 announcement.\n\nGood profitable business can have terrible stock price. U gotta look at innovating", "score": 2, "replies": [{"body": "AMD hits $85 on Aug 3, 2020 just a week after earnings release. On 16 Jul 2021 it is still $85 yet, despite of 2 quarters of record revenue/earnings. And just after next record quarter stock price jumps till $118. Why I remember it? I just held AMD this period and was suprised, why stock doesn't take into account any good news.\n\nAnd now I consider that market took into account many good news for AMD and $200 isn't easy to reach.", "score": 8, "replies": [{"body": "What kind of good news other than earnings & growing revenue during that period? It didn't have anything juicy enough yet for me to get in back then .", "score": 4, "replies": []}]}]}]}]}]}, {"body": "You lost me on  \"Intel sized at 10 nm\"", "score": 1, "replies": [{"body": "Intel currently employs 10nm or 14nm technology, while TSMC employs 7nm technology. These are the processor's lithography.\n\nGoogle it", "score": 3, "replies": []}]}, {"body": "AMD is on a bull run, a lot of hype, but I believe it will come down to Earth. I would buy it at 90$.", "score": 1, "replies": [{"body": "Amd is practically quiet.. nvidia is on a hype .\n\nFor the tech and sales . The price is undervalue I say", "score": 2, "replies": [{"body": "They have good tech, but they are priced for a lot of growth. There’s almost no difference between their P/E (48) and P/E1 (46.5) which means that the earnings will stay flat. The Price to earning growth is at 1.36, usually you want it under 1.\n\nAnd think about the macro environment: Interest rate hike is coming. This will shrink high P/E ratio which includes AMD.", "score": 3, "replies": [{"body": "U can check p/e for tesla now and 2 years back . P/e is just crap from rockefeller education system to dumb ppl down and get them to do boring paper work as slaves.\n\nU gotta look at market cap/ sales . Amd is goina increase market cap\n\nInterest hike , crash doesn't matter . Good companies will back stronger.", "score": 1, "replies": [{"body": "AMD cannot decide to increase its market cap, the market does.\n\nYou want your ratio Market cap / sales as low as possible. Higher sales as possible for the smaller market cap possible.\n\nRight now AMD sit at a market cap/sales of 12.75. You would prefer to have it under 5. Anything above 15 is highly speculative.", "score": 1, "replies": [{"body": "Ermm I have heard professors who didn't make money regurgitate their textbook.\n\nI disagree with what u said, for it's sales number , the market cap is very  undervalued. The sales profits will and Infact bring more money into company. Ur not goina find easily from google search", "score": 0, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Lose money in long run in AMD hahaha.\n\nWow so ur not a retard. Dont forget to wear your helmet before leaving the house.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Wow I didn't read the first few words, of your first sentence ? U think?\n\nFell off your tricycle without ur helmet today hah", "score": 2, "replies": []}]}]}]}, {"body": "It’s easier for AMD to go below 130 than it is for Intel to go below 40 imho. You could be right in your call but in general I will stand by what I said as Just something to think about", "score": -1, "replies": [{"body": "Amd is going to be like next tesla . News doesn't cover innovation. As art graduate anchors don't understand tech and science.", "score": -1, "replies": []}]}, {"body": "You can get AMD 2200g for less than $100 at Facebook marketplace.", "score": -1, "replies": []}, {"body": "Intel needs to leapfrog if they’re to survive. Blackberry got blinded by playing catch-up to apple. AMD looks way overvalued.", "score": -1, "replies": [{"body": "For the tech and Innovation amd is in right now . It's undervalued . Just like tesla.\n\nU gotta dig , can't use news facts", "score": 2, "replies": []}]}, {"body": "I've got out at $154. I have a feeling it's hit it the ceiling.", "score": -2, "replies": [{"body": "At $50, 100, 150, or 200. \n\nThere is a temporary mental block of traders . It's a norm. But its temporary", "score": 3, "replies": []}]}, {"body": "For 20 years AMD had been the little train that could, it's healthy, poignant, in TSLA vehicles, expanding, automation is exploding, Musk is one person, and finite, owning both nvidan and AMC isn't like owning wish", "score": 1, "replies": [{"body": "Amd didn't do much till lisa wu \n\nElon recruits real scientist . Scammer engineers will fool biz leaders in automation. Others far behind tesla neural network. Selling toy cars on hype and simulation drive is not real. Tsla = monopoly\n\nWhy did wish fall the last 5 years. User interface is kinda unpleasant for me.", "score": 1, "replies": []}]}, {"body": "Ath next week take it or leave it", "score": 1, "replies": []}, {"body": "With our own government working to collapse the economy, I would say no.", "score": 1, "replies": []}, {"body": "300 EOY que 2022", "score": 1, "replies": [{"body": "Do ya have a theory for increment to such high price racket of 300 ?", "score": 1, "replies": []}]}]}
