{"title": "Is there any end in sight to DIS bleeding?", "selftext": "I’m still fairly new to investing and after recently restructuring my portfolio a bit and taking a chunk of profits from Disney it’s sitting around 30% for me. Since the restructuring I’m now down 17% and it seems to me like it won’t turn around any time soon especially with the new Covid variant scaring people once again. I’ve heard the old adage of “don’t bet against the mouse” a million times at least and in the past it’s done very well for me. I guess I’m looking for a bit of reassurance as I’m fairly confident in them for the long run but damn if it’s not dragging my whole portfolio through the mud right now.", "id": "r4xrge", "created_utc": 1638198297.0, "score": 48, "upvote_ratio": 0.83, "num_comments": 89, "comments": [{"body": "They ran up over 100% in one year on the news of them shutting down their parks and the announcement of Disney +. It makes sense for their stock to have a pullback.", "score": 17, "replies": [{"body": "It made no sense that it went up 100% when their biggest income generator took that big a hit.", "score": 4, "replies": []}]}, {"body": "I wouldn’t worry about the short term factors, especially possible Covid impact on the parks. Don’t forget they own hottest brands in the industry (Marvel, Star Wars, Pixar) with no signs of letting up.", "score": 13, "replies": [{"body": "This helps. I don’t really have anyone to talk to about things like this in my personal life so it’s nice to be able to hear other perspectives once in a while.", "score": 12, "replies": []}, {"body": "yeah when you think about it, disney has been doing not bad during this pandemic.  Theme parks are suffering and movie theaters are suffering", "score": 3, "replies": []}, {"body": "It's reasonable to ask how renewed capacity limits might affect their 2022 movie releases. I'm optimistic long term, but lower box office sales could be pure loss.", "score": 2, "replies": []}, {"body": "Marvel and Star Wars seem like brands on the decline right now.", "score": -1, "replies": [{"body": "From a quality stand point?  Yes IMO. \n\nFrom a cultural and financial standpoint?  No.", "score": 9, "replies": [{"body": "It doesn't take long for the low quality to catch up to you.", "score": 4, "replies": []}]}]}]}, {"body": "Checking in from a packed Disney land, waiting in hordes of people to get a fuckin beer. People still swarming this place.", "score": 40, "replies": [{"body": "Well that of course makes me feel a little better. Enjoy your time there.", "score": 15, "replies": [{"body": "Disney isn’t going anywhere. Even thru the pandemic the parks are still packed lol", "score": 7, "replies": []}]}]}, {"body": "Man i just bought 10k in dis on the \"DIP\" right before the double dip but im holding and will consider adding more if it goes down.\n\nIf your looking for some WSB action, DIS is not the ticker for you. I can see it going down a bit more, but i'll be averaging down .", "score": 31, "replies": [{"body": "I averaged down a bit on the first “dip” as well but ran out of cash before this big drop. Definitely not looking for blow out crazy returns or anything just kinda hurts watching it tank so much and not being able to capitalize on it. Makes me itchy.", "score": 10, "replies": [{"body": "Definitely. I like to think of it as if i hold for the 1 yr mark, capital gains tax will help offset any potential gains i could have made. Kind of me talking myself into it being not so bad.", "score": 6, "replies": [{"body": "Any other year I’d be thinking the same way but I broke my back earlier this year and have been out of work for over 6 months now so I’ll be in the lowest tax bracket come tax time meaning much lower taxes owed on short term gains. So as much as I’d like to be able to make some risky plays and cash out big gains in the short term I just simply don’t have the cash available to make those plays. Kind of a double edged sword.", "score": 7, "replies": [{"body": "Aww man back injuries are the worst, I can sympathize with you on that. get well soon", "score": 8, "replies": [{"body": "I appreciate it. It’s been a long road but it could have been so much worse. I try to keep that in mind when I start feeling sorry for myself.", "score": 6, "replies": []}]}]}]}]}]}, {"body": "I WAS LOOKING FOR THIS POST.  Every day I wake up, curse Disney, and keep holding these bags. I know it will eventually turn around, but if it could do that in the next 1-2 weeks instead of 9-12 months THAT WOULD BE GREAT.  Stupid gosh darn mouse.  I thought we may near a floor at 160.  Then 150.  Now 145? Maybe?  Hopefully not 130 #Copium", "score": 6, "replies": []}, {"body": "Going to buy 24 more shares this morning", "score": 22, "replies": [{"body": "I love how the top rated comment on a stock discussion is “I’m buying more shares” without any justification.", "score": 9, "replies": [{"body": "Standard confirmation bias in most investment subs", "score": 5, "replies": []}, {"body": "Dam shun why you gotta do me like that.", "score": 1, "replies": []}]}, {"body": "Honestly I think I would feel a bit better if I had the spare cash to buy the big dip. But as I’m not in a position to be able to I’m getting a bit jittery I guess.", "score": 7, "replies": [{"body": "Why buy the shares when you can lose just as much money on the options?", "score": 3, "replies": [{"body": "Now I may be a big dumb monkey but I’m smart enough to know to steer way clear of all that until I’ve learned much much more about what I’m doing and how this shit works.", "score": 3, "replies": []}]}]}]}, {"body": "Marvel isn't going away and once they get more movies in, the cash will start rolling with merchandise, licensing, and entertainment-related sales. Their bigger releases such as Spiderman, Black Panther, Doctor Strange, and Thor should draw up more attention since they are fan favorites and more recognizable. The next year should be a winner for them with these releases. \n\nStar Wars has some awesome projects in the upcoming future so there is massive potential with these new arcs that they are exploring.\n\nThese brands aren't going anywhere.\n\nDisney+ subs are slowing down but I believe that has more to do with the economy reopening and people having fewer time as well as a lackluster selection of shows and movies the past year. Netflix has been killing it with their own shows so the competition between them likely ate some of Dis subs. \n\nKey indicator will be the parks and resorts. It's doing well but COVID concerns are obviously going to put a huge dent on it again depending on the severity. \n\nI don't see dividends returning soon. The losses last year as well as increased competition for media, it would make more sense for Disney to reinvest and keep pushing out new content to keep cash rolling in. Long-term, what has changed? We know the parks are going to exist, their studio entertainment portfolio with Pixar, LucasFilms, and Marvel have amazing fan traction and interest, and their Dis+ subscribers should continue growing as long as they pump new content out. I don't see a scenario where Disney won't climb up soon. The only question you should ask yourself is if you want to hold while other stocks are doing better in the market. If you are long, it shouldn't bother you. Business is doing well and will continue doing so.", "score": 11, "replies": [{"body": "Seeing it all laid out like this makes me feel a bit better. I genuinely appreciate the thought out response and I know that took a bit of time. Thanks for the perspective.", "score": 8, "replies": []}, {"body": "Good write up. I agree Once Disney+ starts entering more markets I think subscribers will pick up again. Although people forget Disney + is only a small part of their revenue. Revenue was mostly from their parks, hotels and cruises and entertainment which dropped off a cliff during covid. It’ll take some time to get back to pre covid revenue. Disney is essentially a mini etf in its self. Once more entertainment comes out and parks get back to normal I’m thinking it should recover nicely. First bought at 100 and plan to buy more if it gets below 140", "score": 1, "replies": [{"body": "Yeah...Revenue was mostly from their parks, hotels and cruises and entertainment pre covid, so what makes disney worth 40% more than their pre-covid share price when Disney+ will only be a small part of Disney+ revenue but at the same time eat up a big part of Disney's earning as well and there's simply no  clarity when the parks, hotels and cruises and entertainment will operating back to normal and no more dividend? we haven't even came to the part on rising operating costs due to the massive rise in wages thanks to Powell's eh... transitory inflation", "score": 1, "replies": []}]}]}, {"body": "Not sure how Disney got a rep on Reddit as some sort of amazing forever stock, throughout their history they’ve been a pretty unspectacular investment.", "score": 19, "replies": [{"body": "Disney has a cult following like some other companies, and people see that it owns a lot of companies and content and they think it will only go up. The reality is, Disney is more than just movies or a streaming service. It's resorts, parks, cable TV channels (ESPN has been bleeding money for a long time). DIS, outside of its runup before D+ launched, has been a bad investment for a while. People on Reddit let their obsession with Star Wars and Marvel cloud their judgment.", "score": 12, "replies": []}, {"body": "I mean honestly it’s not even just on Reddit it seems to be the general sentiment with the few people I have discussed investments with in person as well. Maybe not necessarily as a super stock 100x play but as a relatively safe steady grower. Of course this was also coming from when they were handing out a dividend as well so I guess that needs to be accounted for.", "score": 4, "replies": []}, {"body": "I was about to write it, haha. Seriously, it had a history of doing nothing for years.  As soon as they went streaming, everyone acted like it was going to destroy Netflix and every other streaming service.", "score": 3, "replies": [{"body": "So, looks like the answer is no.", "score": 1, "replies": []}]}, {"body": "Yeah Reddit loves Disney.  The funny thing is those fans think Disney is hated if you don't say something like \"don't mess with the mouse\".", "score": 2, "replies": []}]}, {"body": "If you believe in it long term, then just hold it.\n\nIf you need to realize gains, or if you think another stock/ETF will not only offset the losses but show returns in a set timetable then you might want to think about selling.\n\nI sold my (admittedly small) position in Disney for a small loss and picked up some other stocks that I thought were a better fit for me.", "score": 9, "replies": []}, {"body": "I’d say hold but dont be in a hurry to buy more. I think it is a great long-term hold but it is possible it might drop even further", "score": 7, "replies": []}, {"body": "They need to restore a dividend. They need traffic before that.\n\nBut the lock they have on entertainment sources will sustain them through this lull. I just don't know how much new debt they'd need to ride it out.", "score": 8, "replies": [{"body": "Strongly disagree with the dividend.\n\nThey're using the money that would otherwise come from a dividend to help roll out international D+ streaming services, as well as keeping their parks liquid while not having the foot traffic to sustain the parks. \n\nI'm glad they're waiting on the dividend, and I'd be happy if they didn't restore it TBH.", "score": 12, "replies": [{"body": "Exactly. Dividend was fine when it was their old business model, but the pivot into streaming and the changes that are coming with that, combined with the pandemic means no dividend for a couple years is the smart strategy. Use that cash to put into growth and reinstate it again once things have settled. Probably 2024-2025", "score": 7, "replies": [{"body": "This... But it will return. Meanwhile, others pay out *and* grow. DIS is almost completely different stagnant in returns to investors", "score": 3, "replies": []}]}]}, {"body": "From everything I’ve read it doesn’t seem very likely that we’ll see a dividend from them for at least a year or two. Their huge selection of entertainment is one thing that makes me confident in the long term I guess writing it out makes me feel a little better. Maybe I just need to try and not check the charts for a bit.", "score": 2, "replies": []}]}, {"body": "Buy more if you believe in the company", "score": 3, "replies": [{"body": "I would but I’m not in a position to be able to do so. I guess that’s why I’m getting a little itchy.", "score": 1, "replies": []}]}, {"body": "Disney won't recover unless there is no bad news from Covid or the economy as a whole.  But now is a good time to get some DIS at a discount if the Omicron variant turns out to be overblown.", "score": 3, "replies": []}, {"body": "I remember I was getting frustrated with Pfizer about over a month ago. I just closed all the stock market related stuff and just focused on work.\n\nIt is annoying when a company you know is good, after doing a lot of research, keeps going down.\n\nI am not as frustrated with other stocks as I am with Pfizer, since it always seems to have spikes and then downtrends.\n\nBut honestly, at this point it doesn't matter much to me. I know why I am in Pfizer and when I plan to exit this position. Since my frustration times Pfizer went up a lot and I am up 13.3% overall and 27% from my lowest buy.\n\nDisney will stop bleeding eventually and start going back up imo. If you don't believe in the company then sell it, I sold out of Mastercard even though I knew it will most likely go back up from where I bought it but I just felt like it is a waste of time for me and I would sleep better at night.", "score": 3, "replies": [{"body": "I think that’s my biggest problem. Im out of work because of a back injury so not able to do a whole lot. Watching the charts has helped pass the time and been kinda what’s kept me excited to get through each day. But at the same time it has sure had its stressful points. Once I’m back at work and not watching all day everyday I think it’ll make it a lot easier for me to not focus on the day to day movements.", "score": 3, "replies": [{"body": "Perhaps keep yourself busy in a different way like maybe Netflix or something else.\n\nYou can always consider trying to sell 10% of your shares in Disney (For example if the 30% is 30 shares then sell 3), then on one hand you keep the majority of the holding in Disney in case it goes up, but you can also buy at a lower price if it continues going down. \n\nDon't know if I would have done that but it is also an option I guess.", "score": 2, "replies": [{"body": "Yea I did that for a while but you can only watch so much tv before you feel your brain start to melt. I have been reading a lot recently but watching charts is a bit of a thrill at least. When it’s good it’s great but when it’s bad it’s fucking awful. Thanks for the idea though I’ll give it some consideration at the least.", "score": 1, "replies": []}]}]}]}, {"body": "Yeah, nothing fundamental has changed other than people's confidence... that'll rebound once it hits some level of resistance.", "score": 4, "replies": []}, {"body": "Not as long as I'm holding", "score": 2, "replies": [{"body": "I will honor you for years to come if you make this sacrifice. Sell. Sell for us all.", "score": 3, "replies": []}]}, {"body": "Scares like this always happen, if you really believe in your stocks don’t doubt yourself just because of some bad news that will be forgotten about.", "score": 2, "replies": []}, {"body": "If someone could answer your question, they would be extremely rich. The answer is no one knows. In the short term, anything can happen. People might still be unsure about the outlook as the last earnings report wasn't good, and there's a new covid scare (that may or may not be overblown). \n\nBut who knows, tomorrow, the general sentiment might feel it's oversold, so price shoots up.\n\nLong term, you are probably fine. The best thing to do is probably not look at it. It might take a few years for it to go back to the previous all time high. But give it 20 years, dividend will most likely be reinstated, then price will probably go up as well. (Or company collapses, which is unlikely, but good to diversify).", "score": 2, "replies": []}, {"body": "This is me in PYPL", "score": 2, "replies": []}, {"body": "Stop panicking. Any stock can be volatile in the short term", "score": 2, "replies": []}, {"body": "Looks like support won’t kick in until the 119 to 135 range. So will probably bleed until around then.", "score": 3, "replies": [{"body": "Fuck those are scary looking numbers. You’ll be in my nightmares for a while.", "score": 3, "replies": []}]}, {"body": "DIS is up 50% over the last 5 years while other large cap companies like MSFT, COST, WMT, HD are up 100-500%.\n\nIt moves like a dividend stock but it has no dividend.", "score": 2, "replies": []}, {"body": "exultant noxious selective thought like attractive desert sophisticated jobless existence\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 3, "replies": [{"body": "Using trailing p/e to value Disney is unfair given they have had a rough couple years due to  Covid", "score": 3, "replies": []}, {"body": "Kinda harsh but overall a fair take. I admit that was part of my thinking when getting into it with no technical or otherwise knowledge of how the market works. Definitely will make me think a bit more about future positions.", "score": 2, "replies": []}, {"body": "P/E is useless when that includes months where the parks made 0 revenue due to being closed. Walt Disney World reopened pretty fast but Disneyland was closed throughout 2020 (except Jan-Feb)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I’m just a few years older and been in a few months longer and I think my average on Disney is around 165-170. It’s hurting for sure but especially after a bit of reassurance I think in the long run it’ll work itself out just gonna hate looking at it for a while.", "score": 2, "replies": []}, {"body": "I would kill to go back to age 19 and buy 15 shares of Disney. Hold that, for sure! You will be so thankful you did ten years from now. Just pretend that money no longer exists.", "score": 2, "replies": []}, {"body": "You're 19, you can afford to go through some ups and downs. It's part of investing. If you believe in Disney long term just hold it until the company recovers.", "score": 2, "replies": []}]}, {"body": "Spider-Man just had the craziest ticket sale experience. Not really worried about DIS. The demand for their products is clearly still there.", "score": 1, "replies": [{"body": "The money is still going to Sony.....", "score": 1, "replies": [{"body": "Disney still gets 100% of the love tho", "score": 1, "replies": []}]}]}, {"body": "I would not buy any more. There is a serious down trend going on. The 12 month chart looks like a giant horseshoe. Not good stuff. My completely amateur opinion is that if it goes under 135, run.", "score": 1, "replies": []}, {"body": "They are down to pre pandemic numbers. I bought in at 143$ prior to Disney plus going live.", "score": 1, "replies": []}, {"body": "I’ve held DIS since 90’s. Plan to hold for another 10+ not worried.", "score": 1, "replies": []}, {"body": "Expect the bleed to continue and then for it to trade sideways. The MCU is struggling, lucas film drama and then the virus affecting parks in the near future", "score": 1, "replies": [{"body": "How is mcu struggling lol", "score": 2, "replies": [{"body": "So far only Shang-Chi has made money for Disney and the D+ shows aren’t doing well with ratings. Look at how the stock reacted to D+ day lol", "score": 1, "replies": []}]}]}, {"body": "Haven't liked Disney for years. Still don't. A lot of what they do just doesn't scale well. They were giving Disney+ away like free candy for the first year or so, but nothing about it feels sticky. I'm sure they'll continue to exist and be profitable, but I don't see anything that special.", "score": 1, "replies": []}, {"body": "Take a deep breath. In a year zoom out, and enjoy the view.", "score": 1, "replies": []}, {"body": "Hawkeye is pretty weak so I have no longterm d+ need after skipping What If", "score": -1, "replies": []}, {"body": "It’s the most effective propaganda machine ever created next to facebook. It isn’t going anywhere", "score": 0, "replies": []}, {"body": "Don't mess with the mouse.", "score": 0, "replies": []}, {"body": "Just wait it out. If it bugs you, dont even look at it for a month or two. It will be like the drop never happened.", "score": 1, "replies": []}, {"body": "RemindMe! 2 years", "score": 1, "replies": [{"body": "I will be messaging you in 2 years on [**2023-11-30 00:06:30 UTC**](http://www.wolframalpha.com/input/?i=2023-11-30%2000:06:30%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/r4xrge/is_there_any_end_in_sight_to_dis_bleeding/hmljniv/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fr4xrge%2Fis_there_any_end_in_sight_to_dis_bleeding%2Fhmljniv%2F%5D%0A%0ARemindMe%21%202023-11-30%2000%3A06%3A30%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20r4xrge)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "People should maybe watch a few episodes of \"Yesterworld\" or \"Defunctland\" on YouTube. Both shows take several looks at failed Disney ventures, mostly within the context of their theme parks and \"real-life\" attractions. They're biased and don't look at the company as an investment, but they're entertaining videos and can teach you about how easy it could be to fuck up a big project such as Disneyland Paris. \n\nMarvel, Star Wars, etc. do have brand value. However, they are not invincible. They could fall out of favor with future generations. Netflix might throw much sh't at the wall, but here and there it actually sticks. (Arcane, Squid Game, The Witcher, etc.) Disney should be careful with overrelying on their brands dating back multiple centuries.\n\nThat being said, I'm invested in $DIS.", "score": 1, "replies": []}, {"body": "I don't expect it to bounce back before year end because of tax loss harvest and also stalling disney+ subscribers, maybe if they announce something with the metaverse I can see it reversing", "score": 1, "replies": []}, {"body": "They're financials looked solid before covid, but the pandemic really fucked them. Yet this hasn't really been reflected in the stock price.. I guess the market is factoring in potential growth through Disney+?", "score": 1, "replies": []}]}
{"title": "Bejing Olympics = Crash?", "selftext": "Back in 2008, we had the 2008 global financial crisis, and in the same year\n\nwe had the Olympics in Bejing, China.\n\n&#x200B;\n\nThe market is overinflated right now, the bull run can't continue forever, many people are predicting a correction soon\n\nand it just so happens\n\nthere's the 2022 Winter Olympics also held in Beijing China.\n\nSo the question we all need to ask ourselves is\n\nDoes the Olympics being held in Bejing causes markets to crash\n\nOr does the overinflation of the markets cause the Bejing Olympics?", "id": "r534ql", "created_utc": 1638213106.0, "score": 313, "upvote_ratio": 0.88, "num_comments": 93, "comments": [{"body": "That means we have 3-4 extra month for the bull to run. \n\nAll in 10x leverage QQQ", "score": 84, "replies": [{"body": "How can I get this leveraged? Calls on margin on TQQQ?", "score": 13, "replies": []}, {"body": "10 weeks till opening ceremonies", "score": 8, "replies": [{"body": "He’s not that bright", "score": 14, "replies": []}]}]}, {"body": "This is the most retarded shit I’ve read in awhile… why does it actually make sense", "score": 261, "replies": [{"body": "It'll be hilarious if it actually happens", "score": 39, "replies": [{"body": "I was on 9gag and there was an image that came up about parallels to the previous centuries and one of them said there was a virus that popped up in 1919 and then a little while later there were lockdowns. \n\nI'm not saying TA is the be all end all but...", "score": 9, "replies": []}]}, {"body": "It's better research than a lot of these retard posts on here.", "score": 16, "replies": []}]}, {"body": "Nostradumbass", "score": 106, "replies": [{"body": "Autistradamus", "score": 25, "replies": []}]}, {"body": "The answer to your question is C) All of the above", "score": 47, "replies": [{"body": "When the fuck has C) ever been “all of the above?” It’s always D) you fucking mongoloid", "score": 20, "replies": [{"body": "All of the above is C) when None of the above is D)", "score": 6, "replies": [{"body": "You can get this D", "score": 8, "replies": []}]}]}]}, {"body": "> the bull run can't continue forever\n\ni've heard this line for the last couple of years", "score": 42, "replies": [{"body": "Q4 2019 comes to mind", "score": 4, "replies": [{"body": "If that's so just be ready to buy the tasty dip and a few months later you're back in the green", "score": 1, "replies": []}]}, {"body": "The market can stay irrational longer than you can stay solvent.", "score": 1, "replies": []}, {"body": "2 years does not equal forever", "score": 1, "replies": []}]}, {"body": "Winter Olympics don't count", "score": 40, "replies": [{"body": "You’re thinking of special olympics", "score": 25, "replies": [{"body": "Hahahah good comment", "score": 5, "replies": [{"body": "But that's the WSB game of choice.", "score": 5, "replies": []}]}]}]}, {"body": "You're sofa king retarded.\n\nBeijing Summer = Crash.\n\nWinter is opposite of summer...\n\nBeijing Winter = MOON\n\nLoad up on calls before you miss the rocket.![img](emote|t5_2th52|5957)", "score": 11, "replies": []}, {"body": "yes when China turned out the lights of the 2008 Olympics' Birds Nest Stadium - the 'Great Recession' came on - it already had beginnings here in the states, but many thought China would stay strong enough to give a soft landing - didn't happen.", "score": 7, "replies": []}, {"body": ">the bull run can't continue forever\n\nThe bull run stops when Jpow says so. If he dies (assuming he's mortal) before saying so, it will continue forever.", "score": 5, "replies": [{"body": "So which one of us is gonna take one for the team and make sure that happens?", "score": 2, "replies": [{"body": "Don't look at me, I'm not equipped to fight a God.", "score": 2, "replies": []}]}]}, {"body": "Thats like trying to find a pattern where none existed before. A common human mind issue, since people have a need to find a cause/effect correlation even when none exists 🤷🏽‍♂️\n\nMore than likely, a stock market event will occur when a flash mob event happens.", "score": 21, "replies": [{"body": "Imagine not recognizing a shit post.", "score": 0, "replies": [{"body": "I like cyan crayons! 🤷🏽‍♂️", "score": 1, "replies": [{"body": "cyan is a computer color, it doesn't exist in real life dumbass", "score": 2, "replies": [{"body": "Thats why I am a retard", "score": 2, "replies": []}]}]}]}]}, {"body": "I stopping trying to make money in American markets as a bear long ago.  If you want to profit as a bear its China if you dare.", "score": 7, "replies": [{"body": "This is too much autism even for this sub", "score": 8, "replies": [{"body": "False $YANG", "score": 1, "replies": []}]}, {"body": "The lack of substance in this comment is astounding……..", "score": 1, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|16 seconds ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=r534ql)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=r534ql)\n    \nHey /u/illemonati427, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "Jokes on you, jpow go brrrrr", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|4887)", "score": 1, "replies": []}, {"body": "Personally I try to see if some country is trying to build one of em tallest buildings or towers. [Sky Scraper Index](https://en.m.wikipedia.org/wiki/Skyscraper_Index) have historically gone up before economic crashes.", "score": 1, "replies": [{"body": "Read your own link:\n\n>The authors find that height cannot, in fact, be used to predict changes in GDP. However, GDP can be used to predict changes in height. In other words, the study finds that extreme height is driven by rapid economic growth, but that height cannot be used as an indicator of recessions.", "score": 1, "replies": [{"body": "Not scientific or predictive, definitely don’t use for computations. But in terms of general indicators or clues, they have some correlation and probably better than olympics.\n\nBTW, a bunch of recently built tall skyscrapers were built in China in recent years.", "score": 1, "replies": []}]}]}, {"body": ">Does the Olympics being held in Bejing causes markets to crash  \n>  \n>Or does the overinflation of the markets cause the Bejing Olympics?\n\nNeither.\n\nThe PLA invading Taiwan causes markets to crash.  Which may or may not involve them also attacking military bases in Japan, Okinawa, Guam and possibly even Australia and Hawaii as well as knocking out satellites.  Oh if it were to get really dicey possibly launching EMPs over the US mainland as well. \n\nThat or a giant earthquake.", "score": 1, "replies": [{"body": "That's pretty much WW3.", "score": 2, "replies": [{"body": "That isn’t pretty much, that is textbook, by the book, couldn’t be any more direct, can’t make it any easier for a 3yr old to say “WW3.”", "score": 2, "replies": []}, {"body": "There is a risk of it.  But I don't think it will come to an all out world war.   More of a SE Asia regional event.  And the chances of nukes being used outside of potential airburst EMPs is minimal.  They don't want to risk full on conflict.\n\nOTOH if Xi and the CCP become on brink of collapse, I doubt they'd go quietly...\n\nI'm more expecting China will form a blockade, the current American administration to rollover passively, Australia will see that and nope out, and thus a fairly quick conquering of Taiwan.  I don't expect Taiwanese to give up so easily.  They have way more skin in the game.  But China want's the infrastructure intact not in ruin.\n\nThe earlier play out is more of a worst case scenario. But I don't think they're foolish enough to do that and will try to swoop in before any allies to Taiwan can defend.  \n\nThe bigger issue, long term, is a solidified China under CCP rule and their control of TSMC and the chip fabs.  They'd get a ton of knowledge and equipment while also squeezing Western countries by the neck.  Scary stuff!", "score": 1, "replies": [{"body": "I agree that the CCP will try to invade Taiwan if they are starting to lose power domestically.  But I think Japan has seriously started thinking about defending Taiwan if there's such a scenario.  With Okinawa being just a stone throw away, the Japanese will know that China will start using the \"it has belonged to China since ancient times\" to start claiming the entire Okinawa prefecture.  \n\nThe instant any attack is done on Japan, it would automatically trigger the Japanese-USA military treaty.... similar to NATO.  Same if there are any military strikes on Australia as they have the ANZUS and AUKUS agreements.    \nAttacking the US directly would trigger Article 5 for NATO, along with other countries with mutual defense treaty with the US... Japan, South Korea, the Philippines, Latin America, Australia, NZ, etc.\n\nIMHO, the US won't back down if it has to honour its agreements.  I mean if say Australia or Japan gets attacked and the US doesn't followed their signed treaty, then it's pretty much the end of every defense treaty with the US.  NATO would probably collapse and would be open seasons for the Russia to expand West, etc.    \nJapan being a \"turn-key\" nuclear power might start producing nuclear weapons since their nuclear umbrella is gone.", "score": 1, "replies": [{"body": "The man you’re talking to is a fucking idiot. And I say that with having specifically never called anyone an idiot on this sub. He hasn’t the faintest hint of knowledge about military/geopolitics either. I wrote a long reply and baffled myself by how fucking low I had to stoop to type out basic shit for this moron that I deleted it because I refuse to have to discuss with this much stupidity.", "score": 0, "replies": []}, {"body": "It seems to be a major desire of the party for many decades to squash the ROC and any resemblance of a thriving democracy in the region.   They would do it even if they aren't hurting.   Plus the ports and tech there are really lucrative.\n\nJapan is worried about themselves because at least one of the models shows China attacking Japanese mainland to knock out US bases.  Plus most of the expensive tech and cars designed in Japan are powered by chips produced in Taiwan.  So there is a significant economic stake.\n\nBut the question here is does the West respond with major force?  I'm not so sure.  I go back and forth wondering if they would or would not.   I've read several lengthy articles by analysts intimately informed on it, some providing 4 or 5 plausible outcomes in response.   Some local, some regional, and some global.   One of the regional ones is what I alluded to in my earlier posts.  I think that one is what happens if there is a serious military response to China invading Taiwan.\n\nThe UN for that matter have to question is getting into a major war with another well armed military really worth it on behalf of Taiwan.   I suspect there is little actual desire (despite the bluster) in the US and the rest of the West for such a response as the spillover could become catastrophic (as you say, potentially up to a WWIII scenario).   Countries break their agreements and little happens.  What is Taiwan going to do?  The UN is already pretty weak as is NATO.  Article 5 was touted when Russia invaded Crimea and what happened?  Sanctions.\n\nChina could invade too fast for Taiwan allies to react in any serious number anyways.  That could be their 'out' for saying \"we tried but they're already in control.. so we'll just throw more sanctions at them\"   And, either way, once the eggs are in the batter, there is no getting them out.   \n\nThere are a number of scenarios that could happen.  But I think Taiwan is largely on their own.", "score": 1, "replies": [{"body": "Post some of your lengthy articles. It goes against any conventional wisdom about war and current affairs.\n\n-A nuke(EMP) detonated over US shores? That’s war.\n\n-Attacking a US base? That’s war.\n\n-The US leaving Japan out to dry? That’s a serious eroding of NATO, UN and any partnerships we have. \n\n-Australia getting attacked? That’s war, America will come to their aid. As will Canada and the UK. \n\n-Shooting satellites out of the sky? Theirs are coming down with them.\n\n-Attack on Hawaii? That’s war.\n\nArticle 5 being involved by Ukraine has nothing to do with NATO. They aren’t a NATO member. Article 5 saber rattling would have always been meaningless. Though I never saw legitimate sources saying article 5 was ever on the table. So idk where you got that from.", "score": 1, "replies": [{"body": "This isn't an argument, just a discussion.  You're too hostile and rude to discuss with.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I believe the saying is \"correlation is not the same as causation\"\n\nBut on the off chance it's sarcasm and I'm just a tool, I don't want to end up in r/whoosh so I choose option b!", "score": 1, "replies": []}, {"body": "How did they get the olympics again?\n\nI guess nobody else wants it with covid.", "score": 0, "replies": [{"body": "it was chosen in 2015", "score": 4, "replies": []}, {"body": "They got it how everyone does...the most corrupt deal", "score": 1, "replies": []}]}, {"body": "Nobody knows the duration of a bull market. Nobody knows the duration of a bear market. Anyone who says they do based on X, Y, or Z is just as clueless as the rest of us.", "score": -1, "replies": [{"body": "Did you even read the DD? This is foolproof.", "score": 4, "replies": []}]}, {"body": "Come on, this is spurious correlation.", "score": -2, "replies": []}, {"body": "gtfo of here you gay bear", "score": -2, "replies": []}, {"body": "We need a countdown clock ⏰", "score": 1, "replies": []}, {"body": "God damn this is incredibly autistic", "score": 1, "replies": []}, {"body": "Tin-fucking-foil", "score": 1, "replies": []}, {"body": "Take it to the Beautiful Mind wood shed out back", "score": 1, "replies": []}, {"body": "\"The market is overinflated right now, the bull run can't continue forever\"\n\nThe fuck it is, and the fuck it can't.", "score": 1, "replies": []}, {"body": "No lol", "score": 1, "replies": []}, {"body": "China will trade sideways for a few thousand years. Buying January 4575 calls now", "score": 1, "replies": []}, {"body": "After the disgraceful summer Olympics in Tokyo who even cares about the winter crap.", "score": 1, "replies": []}, {"body": "I would say autistic but no positions have been posted and they can be smart at times, I'd say this one has downs", "score": 1, "replies": []}, {"body": "Instructions unclear, Told my girlfriend to fuck off and now I'm with her boyfriend.", "score": 1, "replies": []}, {"body": "Russia took over Crimea after the Sochi Winter olympics.  Russia is massing troops at the ukraine border right now as well.    \n\n\nIf china wants to maintain precedent, they could invade Taiwan after the Beijing olympics, bringing the markets to a screeching halt.  I didn't think another world war would ever occur but China is doing some really shady shit.", "score": 1, "replies": []}, {"body": "Stop stealing my fucking ideas! Lol, but seriously said this like last month. Here’s my logic: there’s an avalanche of default and business failures over there (housing) and thus a china economic recession incoming. They’ll hold it together until after the olympics have passed to save face but come march shit will implode. Ive said it before, but here it is: March 2022 will be the new March 2020.", "score": 1, "replies": []}, {"body": "China is always the problem.", "score": 1, "replies": []}, {"body": "Good old China experiment!", "score": 1, "replies": []}, {"body": "The Jamaican bobsled team will crash harder", "score": 1, "replies": []}, {"body": "This is the same logical fallacy as what happens in numerology. Skip all the intricate, multi-dimensional factors around a highly complex process and just say, “Some 8’s we’re involved on this day and now we have some 8’s coming again.”", "score": 1, "replies": []}, {"body": "many people are predicting a correction soon\n\nYes. Did they ever stop?", "score": 1, "replies": []}, {"body": "More convincing analysis than 95% of the other “here’s why a downturn is coming” posts", "score": 1, "replies": []}, {"body": "my man called it", "score": 1, "replies": []}]}
