{"title": "[deleted by user]", "selftext": "[removed]", "id": "qzeeqy", "created_utc": 1637560342.0, "score": 35, "upvote_ratio": 0.82, "num_comments": 89, "comments": [{"body": "Just let it get called away and then immediately sell an ATM put.", "score": 37, "replies": [{"body": "My avg is near $40 and selling 200 shares I will be hit with huge cap gains", "score": 11, "replies": [{"body": "Long term or short term gains ?\n\nEdit : what am I talking , Of course it’s long term capital gains based on cost basis", "score": 19, "replies": [{"body": "I wonder how self-driving apple car drives on Lombard street!", "score": 5, "replies": [{"body": "They will be fine as long as they don’t use in house maps.", "score": 15, "replies": []}]}, {"body": ":)", "score": 4, "replies": []}]}, {"body": "I suppose it’s the old adage, never write a covered call you wouldn’t want exercised, just like you should never write a put you wouldn’t want to be exercised. \n\nTry rolling that call up and out. But wait until it gets very close to exercise. If Apple dips, no worries. If Apple is at 170, you could probably roll to something a few months out with a 200 strike price and get the same premium you are eating when you close out your current call at a loss. \n\nApple tends to go sideways for a while, and then have a quick steep runs. Tough to write covered calls against if you are looking to hold the underlying shares long term.", "score": 7, "replies": []}, {"body": "I’m sorry but if you don’t want your shares to get called away don’t sell calls on them. \n\nThere are thousands of shares of a certain bank that I have that were assigned to me as employee stock options. I could sell CCs but I know it’ll mean a ton of capital gains so I don’t.\n\nI only sell calls on shares I’m okay being called away.", "score": 23, "replies": [{"body": "While this seems like sound advice it isn't.  \nThe proper advice here would be very cautious with the shares you do not want to get called away.  \nBe as **vigilant** as possible (if that last sentence were not enough for you) and buy back the position if you see lunacy occurring.  Wait till lunacy dies and sell again.  \nAnd if you want to take it step further and have cash burning holes in your account sell CSPs during lunacy to further your gains.", "score": 3, "replies": [{"body": "You simply can’t predict the market. No matter how vigilant you are, there’s always the chance that your shares get called away.", "score": 2, "replies": []}]}]}, {"body": "lol just pay the taxes if they’re long term cap gains, you were going to have to anyway…", "score": 7, "replies": []}, {"body": "Paying taxes isn’t a bad thing. It means you’ve made money.", "score": 9, "replies": []}, {"body": "I was always told to just keep rolling to a higher and further out strike until they have a bad day that covers that realized loss you had on the rolls. Is this not good advice?\n\nIn the same boat with 2 feb 22 $170c. Don’t want my shares called away, but didn’t think it would run that much.", "score": 2, "replies": []}, {"body": "Then just buy them back at a loss and decide if you want to write a new CC as a completely separate decision.", "score": 1, "replies": []}, {"body": "That’s a pretty sweet cost basis on Apple. I would be sad to lose them too. But hey, sounds like you had a great run!", "score": 1, "replies": []}, {"body": "Then buy the CC back when an opportune moment appears. Any cash loss you face from the BTC, you’ll balance with further capital gains in apple. \n\nI think that’s part of the beauty of a CC - you can take a short term loss upon buying the CC back, but your net worth doesn’t actually change.", "score": 1, "replies": []}]}]}, {"body": "I got assigned on my  $155 CCs after writing CCs on AAPL for over a year. As for your question, $160/share equates to a forward PE \\~28x. That's pushing it when you assume one-year EPS growth of 7%, implying a PEG of 4.0, which is very rich. Assuming five year EPS CAGR of 15% equates to a more reasonable \\~2.0 PEG. Hardly a steal. \n\nNet/net: $160 is close to AAPL's ceiling with $170 highly unlikely in the next six to nine months. All bets are off as we approach another product update in September.\n\nHope this helps.", "score": 19, "replies": [{"body": "While I agree with you, just watch it shoot to $180 by January.", "score": 27, "replies": [{"body": "Honestly, I suspect it will be there by the end of the week. Exceptional companies (like people) get exceptions.", "score": 10, "replies": []}]}, {"body": "PE ratios and fundamentals matter a lot less nowadays, speculation runs rampant even for companies with solid growth. Things like TSLA have atrocious PE ratios so it wouldn’t be far fetched to have a crazy price spike for apple if something were to change", "score": 1, "replies": []}, {"body": "Isn't doing CC for AAPL barely earns any premium? I remember when it was flat for a while at $150 , the premium was around 20-30", "score": 1, "replies": [{"body": "That's $20-30/week on $15,000.  That's a nice ~10% annual return for a stock with minimal downside. That's a thetagang worthy trade.", "score": 2, "replies": []}]}]}, {"body": "Apple building infotainment for a car, I can see that.\n\nApple doing the full car. How?!? Tesla are high tech cars, and don’t have the best reliability rating already (engines/batteries are solid at least). Apple will somehow do better than them?", "score": 10, "replies": [{"body": "If you follow the news trail about this, Apple would not be building or manufacturing the car. It would be something like Hyundai builds the actual car part, then Apple finalizes it with their tech including some form of advanced autopilot (and of course Apple would be in complete control of the design/visuals and take full credit for the product). The only thing far-fetched about it are the rumors about having full auto pilot with no steering wheel in the car and it’ll ship in 2025. That is laughably farfetched IMO", "score": 4, "replies": []}, {"body": "Your looking at it backwards. Cars are shifting to becoming tech items. Apple is a tech company. A very good one. Google is also already in this game too.", "score": 7, "replies": [{"body": "Oh, I know that. Google has been investing in cars for N years, I stopped counting. How many Google cars are sold per year? Tesla is more the exception, than the rule. I get that Apple wants a piece of the self-driving car, like everyone else. But they are far from being setup for that. The fact that their car division boss left is sending a mixed message too.", "score": 0, "replies": [{"body": "You know that hey? But you don’t even know that google isn’t interested in selling cars to the public. They want to create totally automated precincts. Self driving taxis buses trans etc.\nYou don’t know shit \nGo do some dd", "score": -7, "replies": [{"body": "lol - funny reaction.\n\nDid I talk about selling car to the public?\n\nGoogle has, what, 0.0000001% of the car market? It is still a prototype stage.\n\nLet me know when they drive outside of some neighborhoods of Phoenix. (ah yeah, they have some test done in SF, I see some once in a while, nothing for us plebs though).\n\nEventually self driving cars will be there, there is more time to wait. I remember in 2010 when they said that in 2020 we would not need to drive ourselves anymore. lol. And folks on Internet said that other folks, like me, did not know shit. (funny with me being the guy coding things like that). So I guess maybe 2025-2030 now?\n\nSo yeah, to answer OP’s question, Apple will not explode with the news, because it is no news and it won’t move the needle before several years.", "score": 1, "replies": [{"body": "You said how many google cars sold so yeah you did talk about that. \n\nYou don’t even seem to understand the difference between automated transport and self driving so I’m not going to waste any more time explaining things to you or how apple might have plans beyond selling pickups to morons.", "score": -6, "replies": []}]}, {"body": "First of all if you even knew one basic thing about Google, you would know that they call them Automated Prefectures - NOT precincts!!!! lol please stop clowning yourself like this. It's a really bad look. Also Google is planning on RENTING cars to people for $300/month. Apple essentially does the same thing with their phones. Whatever you do don't call them precincts again. It's prefectures.", "score": 1, "replies": [{"body": "That. That’s all you have to come at me with. Semantics. Really? \nA precinct is a defined zone, a prefecture is a governed zone. Like you know, it has a prefect. Maybe because Americans butcher English you can’t understand the definitions of words. That’s cool. \nFunny how you just had to try and correct me on semantics but not correct the person spewing bs. \n\nAnd yes as I said google has zero intentions selling cars to the public but will aim to get subscriptions for its automated zones. \n\nI suspect apple will employ its model that sells iPhones. Sell people a car they can’t afford on a plan that traps them. \nPeople don’t seem to understand the cost of a vehicle is nothing compared to the life tine fuel costs. With renewables and electric the weekly fuel costs are gone. Apple wants you paying 100$ a week for ever not just buy a car for 60k.", "score": 0, "replies": [{"body": "You seem to have no idea what you are talking about. Maybe just sit this one out... or you know what sit out tech in general. America creates all this amazing tech and you are living in some foreign country talking nonsense. They won't even bother to give you any of these cars and high tech stuff buddy. I mean you didn't even know it was called an Autonomous Prefecture. Pshhhh 🤡", "score": 1, "replies": [{"body": "You have no idea where I live or what I do. You should be quiet when adults are talking. You’re spare parts bud.", "score": -1, "replies": [{"body": "You constantly make horrible decisions I can tell you that right now... lollll 🤣 🤣 🤣 🤣", "score": 1, "replies": []}]}]}]}]}, {"body": "Go back to whatever shitty memestock sub you came from.", "score": 0, "replies": []}]}, {"body": "AAPL has the best tech manufacturing system in the world.  If they choose to get in they are well equipped.  While it may take a while for them to get in the game they will succeed.  \nSame as F.  If F pushes in they will explode.\n  \nI do not hold a big position in either company so this is an unbiased take.", "score": 1, "replies": [{"body": "Given Ford will be cannibalizing it’s own sales. No, no they won’t explode.", "score": 1, "replies": [{"body": "400% since March 2020 bottom and 131% past year not explosion, noted.  \nThe crap some of you guys spew.", "score": 1, "replies": [{"body": "So is Ford stock up anything close to those numbers. No. It’s not. Wonder why?… oh that’s right it’s all in there financials. Dumb ass. Why is tesla worth more then every other car maker combined when they sell fuck all in the global market?", "score": 1, "replies": [{"body": "Are you touched in the head Friend?  \nCan you do simple math?", "score": 1, "replies": [{"body": "It’s math that know well actually.  That’s why I ask you to explain why Tesla’s market cap is higher then every other auto market combined? You don’t know why but yey….? You think a spike in Ford is todo with them selling electric 150s and not the fact the own a good chuck of rivian and rivian with zero cars has a higher Mcap then ford. \n\nYou’re just spear parts bud. \nGo read fords statements about their concerned that the vast majority of there new customers will be currunt Ford customers. Just being a different Ford. \n\nALL sepeculation on Ford is due to it’s tie to rivian. \n\nFord stock will do nothing like what tesla did. \n\nNow I gotta go, your mums calling and says she wants to suck the sauce. Witch is hard because she only like that Fkn Rick morty shescwan sauce. Lucky I got heaps just for dunking my snouzee into your mumma morty hole.", "score": -1, "replies": [{"body": ".. Thank you kind God for giving me this much space in this girl's brain.  \nMath 101 - elementary algebra?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Yeah but google sucks ass at committing to making new and exciting things. Their core business model basically makes sick ass profit on autopilot without having to innovate much if at all. It's a stagnant company innovation wise whereas Apple is anything but.", "score": 1, "replies": []}]}]}, {"body": "They had some talks with goev. They can use their base model and build on it", "score": 2, "replies": []}, {"body": "Agreed they are a bit late to the game. And if they don't put this thing out till 2025 by then EV competition will be a lot further along than it is today.", "score": 2, "replies": [{"body": "Yeah I have some friends working at cruise. Heh, their recruiters keep contacting me.\n\nCruise/GM is targeting end 2023, and they are not too far off. And same as the others, no wheels, no pedals. The space is going to be interesting. But it is going to take years before people trust it and embrace it.", "score": 1, "replies": [{"body": "I also don't think the highway safety department will make it easy on them to just set this thing on the road and let it do it's thing.", "score": 1, "replies": []}]}]}, {"body": "I don't play with Apple.  I can't stand the company and I don't like their \"tech\", so the idea of an Apple Car sounds silly to me too.\n\nThat being said, building a car is relatively easy at this point.  We've had the base technology for 100+ years, so I don't doubt that Apple can take somebody else's tech, put an apple logo on it, and sell it to the masses.  They're really good at that.\n\nI don't think it will be nearly as revolutionary as Tesla's entrance to the auto industry, nor do I think it will shift Apple's revenue much.  I think it will develop into something like a Rolls Royce - they have an auto division, and some people have their cars, but it's not their \"bread and butter\" as a corporation.", "score": 1, "replies": [{"body": "For years computers in cars have been improving. Now, cars are more computer then car. Apple is a computer tech company. Any computer tech company not getting into auto is falling behind. The money is in the tech not the car. The most expensive part of a million dollar missile is the guidance system not the missile case or explosive. Apple want to build computers that can drive. \nNot smart cars. Why nobody can understand this is baffling to me.", "score": 1, "replies": [{"body": "I don't consider Apple a tech company - to me they're a marketing company.  Most of their \"tech\" these days is borrowed from other companies and stamped with the Apple logo.  The M1 chip is a notable, recent exception.\n\nTheir software is about the only thing that's truly unique, and personally I don't like the experience.  Totally subjective, but I wouldn't want to buy a car that operated like their software.\n\nAnd even if we say that Apple is going to design the software / computers, I still think it makes more sense for them to pair up with a company like Ford to build a car together.  Apple doesn't have any economies of scale set up to mass produce an automobile outside of the microchips / computer hardware.  So given the lack of supply chain they have here, they'll either need to produce a niche vehicle for \"cool\" factor (that's overpriced compared to competitors) or they'll need to subsidize autos on losses until they can build enough infrastructure to achieve the necessary economies of scale.  The latter is a recipe for disaster if the project fails, and the former is my bet on where this thing will end up.  They're going to build the Delorean of the 21st century.\n\nAt least that's this bear's perspective.  Other opinions are just as valid, and obviously you're of this group.  If I had any stock I'd gladly sell it to you.", "score": 1, "replies": [{"body": "They are teaming up. With Hyundai. Apple entering this market has fuck all to do with apple manufacturing cars. \nAnd your points are valid, apple isn’t for everyone but to those that like it they are loyal. Apple is doing this not to sell cars but to get you to tether yourself to apple. You won’t need to buy fuel anymore and fuel costs over your lifetime are much much more then the cost of a new car. Apple wants to sell you an overpriced car you can’t afford to buy outright but can afford to give them $100 a week for basically the rest of your life. This is what they want. If you understand this it’s makes perfect sense why they would even bother taking on tesla Ford Toyota and vw. From a making cars standpoint it’s stupid but from a business model used for selling iPhones but applied to cars it’s genius. \n\nApple is tech company but more then that they are a brand not as much a marketing company.", "score": 0, "replies": [{"body": "I thought the Hyundai deal was dead?  They're working now with LG and Magna?  Though this is from April so could be old.  I'll fully admit I don't follow this much.\n\n[https://observer.com/2021/04/apple-car-near-manufacturing-deal-lg-after-broken-kia-hyundai-talk/](https://observer.com/2021/04/apple-car-near-manufacturing-deal-lg-after-broken-kia-hyundai-talk/)\n\nI drive an EV so I'm a big believer in this technology.  And I agree that Apple has a very loyal fanbase (my wife is one of them) and yeah \"brand\" is probably the better term over \"marketing\".\n\nIt will certainly be interesting to see how it plays out.  I'm not putting any money on it one way or the other, so I should probably shut up :P  Also I don't wish poorly on Apple... I want this tech to succeed and I think there's a lot of potential.  \n\nGood luck if you're taking positions.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "There is no Apple car. There will never be an Apple car. Building cars is a horrible,  extremely cost intensive, low margin exercise that could wipe out all of Apples free cash within a few short years. All for the hope of a grand return of 1500-2000 profit per car 15 years down the road. It literally would be a horrible idea for them to even try.", "score": 6, "replies": [{"body": "Spot on. I think people gravely underestimate the costs and time it takes to develop a car from the ground up, let alone a GOOD car people will actually want to buy. Agreed, Apple will never have a car. The best they will do is collab with an established OEM", "score": 1, "replies": []}, {"body": "!remindme 3 years", "score": 1, "replies": [{"body": "I will be messaging you in 3 years on [**2024-11-23 01:52:08 UTC**](http://www.wolframalpha.com/input/?i=2024-11-23%2001:52:08%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/thetagang/comments/qzeeqy/will_apple_explode_after_car_news/hlpsa0j/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fthetagang%2Fcomments%2Fqzeeqy%2Fwill_apple_explode_after_car_news%2Fhlpsa0j%2F%5D%0A%0ARemindMe%21%202024-11-23%2001%3A52%3A08%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20qzeeqy)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "Apple car is like old news.", "score": 4, "replies": [{"body": "Considering the world's biggest company just jumped 5% in share price in a single day, I'd say it's not.", "score": 7, "replies": []}]}, {"body": "The short on my PMCC is $165 and frankly I want out.", "score": 2, "replies": []}, {"body": "what's wrong with a limit buy at 165? Just grab another 100 shares that are meant to be called away. Follow it up with a stop order at 165 if you think it'll come back down.", "score": 2, "replies": [{"body": "That is a brilliant idea. I might do that. The problem is it is 2 contracts and I would have to buy 200 shares but no powder", "score": 1, "replies": []}]}, {"body": "Still surviving. Have not done anything to it yet. The price has dropped $7 from otm but still, I cannot buy back as I would have to pay $470 more than what I got. Will wait for a few more days", "score": 1, "replies": []}, {"body": "[deleted]", "score": -16, "replies": [{"body": "Yes, unlike Samsung and every other large manufacturer using good old fashioned union laborers getting paid a fair wage for a fair days work. Sorry to burst your bubble but this ain’t 1950 anymore. I know Apple is an easy target but let’s be real, they all do it.", "score": 8, "replies": [{"body": "I guess that makes it cool", "score": -8, "replies": [{"body": "Never said it was “cool”, I’m just not a reactionary. It’s a global economy that thrives on oppression and exploitation of the working class. People like cheap shit. Companies like to make money. There’s only one way to satisfy both parameters of that scenario; the workers get all stick and no carrot. You can give the workers more money but then either the company would have to make less money or charge more for their product. This is a zero sum game. In order to give to one party you need to take from another.", "score": 9, "replies": [{"body": "Yeah that totally justifies slavery!  Go capitalism!", "score": -2, "replies": [{"body": "I think you’re confused friend. Slaves aren’t paid wages nor are they given the choice to leave. Again, do you want cheap smart phones or do you want exorbitantly expensive smart phones that your average consumer would only be able to upgrade so infrequently as to cause the demise of that particular market altogether? Choose one because you can’t have it both ways. You’re *here*, in a *very* capitalist sub complaining about capitalism and not doing a very good job of arguing against it. If you’re just looking for someone to agree with your point of view even though you haven’t elucidated what anyone would consider a coherent thought maybe you should try r/communism or r/antiwork.", "score": 1, "replies": [{"body": "Oh get over yourself.", "score": -2, "replies": [{"body": "Just tryin to help you out bud, you seem confused.", "score": 1, "replies": [{"body": "I think it’s you who’s confused.  $1000 for a smart phone isn’t cheap, and it hasn’t really been innovated in over a decade.  Aapl makes shit tons of profit, you presented an obviously false dichotomy.  And as far as being “in a very capitalist sub”, I have no idea what that has to do with shit business practices.  Capitalism on it’s face does not justify unadulterated greed.", "score": -1, "replies": [{"body": "See? Obviously confused. \n\n“$1000 for a smartphone isn’t cheap” A: according to who? And B: it is when compared to what it would be if the cost of labor was increased. This is simple economics. \n\n“Hasn’t been innovated in over a decade/ Apple makes shit tons of profit” Both true statements. But clearly the market doesn’t care. As all major smartphone manufacturers are just riding their basic flagship design from 10 years ago and people *still* flock to the stores to buy them. You can have the opinion that more innovation is needed. The market obviously doesn’t weigh that factor as much as you do. As for apples profits, meh, “shit tons” is a relative term. And while it would be great if they decided to take the L and just *make less profit* so they can pay their workers better, this is reality. It isn’t gonna happen. \n\nCapitalism at its core *is* greed. Stop trying to fool yourself into thinking it *isn’t*.", "score": 1, "replies": [{"body": "Sure, but you’ve missed the entire fucking point here.  You can’t use Uyghur labor to build cars unless you want the wheels falling off in the street.  Apples practices that have led to a profitable phone business will lead to catastrophic failure in cars.  Lack of innovation while focusing on packaging and cheap labor is not a blueprint for success in that field.", "score": 1, "replies": [{"body": "“Lack of innovation while focusing on packaging and cheap labor is not a blueprint for success in that field” Apple and Samsungs quarterly earnings would disagree with that narrative.", "score": 1, "replies": [{"body": "In the auto field.  Man you are dense.", "score": 0, "replies": [{"body": "Yeah. They weren’t in the phone market until they were. People buy apples shit because it’s Apple. I promise you people *will* buy it. And do you think their quality control standards would change just because it’s a car now? Why?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "But the market will not think like the way you think. But you know what I have been an Android user for so long and recently my company gave me an iPad Pro and I find it to be very cool. Now I know what the hype is all about", "score": 5, "replies": []}, {"body": "I agree w this dude", "score": 2, "replies": []}, {"body": "I bet you’re poor and own an android phone.", "score": 1, "replies": [{"body": "Wrong on both counts", "score": 0, "replies": []}]}, {"body": "“Here’s a list of stuff I’m mad about but don’t understand…”\n\nNice.", "score": 1, "replies": []}, {"body": "Bro that's just good business sense", "score": 1, "replies": []}]}, {"body": "all rumors, apple never confirmed the news…", "score": 1, "replies": []}, {"body": "I doubt it.", "score": 1, "replies": []}, {"body": "You can try to roll it to break even at a higher strike or further out but if you are facing a taxable event just take the loss, its probably the lesser of 2 evils. Apple is going to keep running even if the valuation doesnt make sense due to its position in the indexes.", "score": 1, "replies": []}, {"body": "I really thought Apple might try to acquire some of the smaller EV companies.  Guess they’re starting from scratch?", "score": 1, "replies": []}, {"body": "Why the hell would you write a call so far out? There is NO upside. \n\n- over time, that initial premium turns out to be incredibly underpaid rather than doing weeklies. \n- if the underlying stock explodes, getting rid of the CC will cost a fortune. \n- or you could be stuck holding the damn thing and it’s like your money from the stock is in escrow. \n- CC for a stock as big as apple ALWAYS do weeklies. You can customize your strike price every week based on what the stock is currently trading. And you’ll see - you wind up with BETTER premiums. \n\nAnd if it does get called? SFW. There are a million stocks out there. The nature of close to the money CC strategy is you WANT the position to get exercised. Otherwise, something has gone wrong and the stock is dwindling and you’ve got a fat dick in your ass.", "score": 1, "replies": []}, {"body": "You can immediately sell an ITM CSP to replace your shares, but you will have to pay long term capital gains taxes on the shares called away.  At least tax rates are still relatively low right now, if that’s some consolation.", "score": 1, "replies": []}]}
