{"title": "Confession of a novice option trader.", "selftext": "So I am doing well with my covered calls and secured put strategy and I am sitting there last week and see AMZN  on a tear. The stock takes a momentary breather and I figure I will buy a put and do a little scalping. To my dismay AMZN takes another leg up then another breather I buy another put then what has become horror another leg up. Well I bought a total of three puts and wiped out a lot of good work with my strategy. How many times have I heard to stay mechanical and work your plan. Last week I did not and it cost me. My strategy is getting in with puts and selling CC on IBD 50 and sector leaders if I just stick to it I should be OK. That's my cautionary tale for today. Oh yeah the AMZN puts I was buying were 1/20 so theta was killing as well. \n", "id": "5mqk7u", "created_utc": 1483877143.0, "score": 23, "upvote_ratio": 0.94, "num_comments": 46, "comments": [{"body": "The majority of new option traders, including myself, make a mistake by buying options. After trading options for three years and placing 1500 trades, I will never ever buy a single leg option. Ever.", "score": 14, "replies": [{"body": "As someone that is not a new option trader, that is a really, really simplistic way of looking at it.\n\nThere is money to be made buying and selling options, recognizing when the risk/reward makes sense will only come with experience, but the dismissal of buying options by most of the people in this sub is unfounded and most likely predicated on their own misguided attempts at using options for something they should have just used the underlying for or just a flatout misunderstanding of the characteristics of options.\n\nSelling options (naked) works every time until it doesn't and you get blown out massively, and while covered call writing can be a good revenue stream, there is a reason someone is always willing to buy the calls you sell - but only for the right price.  If you can buy an option at or below its fair value, then your opinion on them may change as you find that you can convert your position into a put when warranted, gamma scalp, etc, to recover the initial outlay.  I can give examples if anyone needs them or if I was unclear.\n\nNot dissing anyone here or any particular strategy, but if I see one more upvoted comment swearing off of long option positions, I might have a stroke.", "score": 17, "replies": [{"body": "Zach can you explain how to determine fair value of an option or direct me to somewhere I might learn option valuation?", "score": 1, "replies": [{"body": "The problem is that it isn't as easy as a formula or a one-size-fits-all system for determining value...\n\nYou can use black-scholes to determine the 'value' of an option, and you can use put-call parity to determine the extrinsic value relative to intrinsic value and derive price that way, however that doesn't necessarily mean that the prices you see will reflect either of those.\n\nAn example is probably the best way of explaining this concept.  Let's say that there is a call that's 25% otm on a stock with relatively high volatility.  Let's say that the spread for the call is  .2 bid by .6 ask.  What is fair value here?  You can use the information you have about the option to determine its properties, its probability of expiring with intrinsic value, etc, however it's hard to know what price is actually fair when the spread is so wide.  \n\nThe spread is wide to begin with because the volatility of the underlying is such that market makers collectively want a cushion of about .40 cents for selling liquidity in that market. This means that if they can sell the .60's, they will more than likely be able to buy them  back for .60, more likely much cheaper than that.  This doesn't mean that the market makers *won't* sell to you below .60, but it just means that they aren't willing to make an entire side for hundreds of contracts on multiple exchanges and risk getting taken out all at once without a significant cushion for volatility risk (the .40 spread is compensation for that).  Even if a hedge fund comes and takes all the liquidity at the .60, they (market makers) have priced the liquidity such that they most likely will be able to cover their own risk with another option, the underlying, etc.\n\nNow, not saying that this is you or anyone here, but if you saw this stock, and thought that it might rise substantially, you might look at the call options to see if there's anything available.  This is where price discovery and valuation comes into practice.  If I looked at this spread,  I would say \"that makes sense, if I'm expecting a big move so are MM's\", however I wouldn't cross the spread and pay .60 for the option, I would look at other strikes to see if someone is offering them down - barring that, I would try bidding the original option at .40 for an hour or two, see if anyone offers it down, or whether I get filled, but crossing the spread is all but guaranteeing that the position will be a loser because the market makers are pricing options such that *their position*will be a guaranteed winner.\n\nFair value is subjective and  based mostly on what you plan to do with an option, but in the example above, if you had bid and gotten filled at .25 or .30, you would have been filled below midpoint, which many would argue is below fair value - meaning if you offered them at midpoint you would likely get filled by someone, even if market makers aren't collectively willing to offer it at that price.  If you were able to buy a one lot at the midpoint price, and sell it back for that same price right away, we would likely say you've bought/sold at fair value.\n\nSorry for the wall of  text, and I'm sorry if my explanation was a little rambling, but I just wanted to emphasize that in practice, the theory only matters so far as it will get you executed - if you can buy something for cheaper than you can sell it for - you've bought it under fair value.  If you bought that option we talked about above for .20 on the bid by luck, then you can lean on that call until the bid gets thin, then sell it for what you paid for it  after what you paid eventually becomes 'fair value'  In many situations you can look at an option chain and find people who are long and will offer an option much lower than the market makers will, those are opportunities to make money buying options, you will very rarely make anything by paying the spread and retail commissions, but there is just as much money to be made long options as short.  Again, sorry for the shotgun style response and lack of focus, but it's Sunday.", "score": 12, "replies": [{"body": "Zach a lot to digest there, are you saying that if you come off bid or ask it is a loser?", "score": 1, "replies": [{"body": "I'm not sure what you mean by 'come off bid or ask', an example would be helpful", "score": 1, "replies": [{"body": "You said crossing the spread equals a sure loser.", "score": 1, "replies": [{"body": "once you cross the spread, you are in the back of the line with everyone else to sell at the price you bought it for. by definition, crossing the spread puts you in a position where you have to cross the spread again to exit the position.  that means that you are starting out with a loser if you buy pay the b/a spread.\n\nthis is why the majority of the people that buy options have a negative experience with it, they don't realize that you want to *buy* options that other people are lining up to buy, and you want to buy them at the price that people are lining up to pay.  if you came into a market such as the one i described in my example (.20 x .60), and you bid .25, and the rest of the market didn't join you, (e.g. you're the only liquidity bid at .25) then that should be a big red flag to you that you don't want to pay much more than that, as it's likely nobody will pay that much when you want to get out, unless the likelihood of it expiring in the money increases substantially.", "score": 3, "replies": [{"body": "Lurker to the overall conversation but wanted to say thanks for your perspective and comments in this thread. You have definitely improved my understanding of the buy side of the market. \n\nI wonder if part of the gulf in understanding between the two sides is because premium sellers are sometimes focused on probability and staying mechanical while premium buyers trade based on a specific bias over a specific time frame. You can backtest doing selling a 1sd strangle over and over pretty easy but backtesting buying options based on price action would be a challenge.", "score": 1, "replies": []}, {"body": "Idk if it's necessarily always bad to cross the spread.  \nIf the markets .20 @ .60 it's probably not trading a whole lot and a .25 bid isn't likely to be filled.  \nIf I think the options worth .85 or something I'd start bidding .50, step up to .55 and then lift .60 if I don't get filled. Obviously, doing that takes conviction on my part and confidence on my higher fair. But I've often found that my very best trades are the ones where I'm confident enough to be the aggressor and not the ones where someone else is confident enough to hit my bid or lift my offer. ", "score": 1, "replies": [{"body": "Why do you think market makers would sell you an option that is worth .85 for .60? What are you pricing in that they're leaving out? That .40 spread is to compensate for volatility in the underlying and any factors known or unknown to the current market participants.  The spread is efficient even if pricing isn't always.\n\nIf you're the only one bidding at .50, and you don't get filled, if you bid up to .55, you're starting out with a loser because if noone joined you at .50 then you might not even be able to sell it for that.  You want someone to give up premium when they sell to you so that you can realize it by hedging it with another option (or the underlying), or you can 'spend' that premium on a finite amount of time and then exit the position if you haven't gained any intrinsic value since you bought it.\n\nYou'll know you got a good deal on an option when other people are immediately willing to buy it from you for what you paid.", "score": 1, "replies": [{"body": "I think you overestimate how good the MM's fair values are. They are largely a response to supply and demand.  \nMM's would sell me an option that I think is worth .85 for .60 because they think its worth .40. Like I said before, it has to be a case where I think the vol for that option is too low and I'm confident on it.  \nAnd sure, I get the point about \"getting a good deal\" on the option and I agree that that's a sound strategy in liquid options where the vol hasn't been moving around a lot in the past few hours. However, if it's something wide that doesn't trade a lot and someone's hitting the entirety of my .25 bid and its not just a random retail 10 lot, I wouldn't be so confident that the option is really worth more than .25", "score": 0, "replies": [{"body": "It doesn't matter what you or anyone else \"thinks it's worth\", it matters what you can get for it in that moment.  If you think  that paying .60 for an option that you won't be able to sell for more than .45 at that moment is such a great play, then what is your reason for buying otm options to begin with, besides leverage? Why not buy 100 shares of the underlying and set your stop .30 below where you paid if you're willing to risk that much for a substantial upward move anyway?  You would be able to get out for substantially less of a loss if it didn't go your way fast enough, and at the end of the day you at least own an asset with limited downside - which many would argue is a better r/r than an otm call that you overpaid for..\n\nMarket maker's spreads are based on fair value at the time of sale, they don't care what it might be worth in a few weeks, because they aren't naive enough to think they can predict its price that far out, and because they know with the amount of edge you gave them by paying .60 that they'll be able to buy them back for .55, .59, or at the very least buy them back on a rebate exchange for .60.\n\nHonestly it's just a terrible way of expressing a trade idea in the situation we just described - the options are there and priced that way for people that don't have the luxury of just using a stop order to cover themselves, or for people that would move the stock more than the premium they pay by trying to initiate a position in the stock.", "score": 1, "replies": [{"body": "Look, I'm a MM and know how this shit works.  \nIf you're confident enough to think that something is worth .85 when its being offered for .65 you don't mess around with bidding .25 and hoping for someone to hit your bid when the thing doesn't trade. If you do that, you'll probably get joined and will be unlikely to get filled.  \nThe key to this is being confident that the MM fair is wrong and the offer is cheap (or the bid is expensive). This happens way more for me on the sell side, and I'll end up hitting the MM bid when vols are seemingly wrong, but on the buy side, I will less frequently think the option is worth far more, but when I do, its usually by a lot, so acting quickly and aggressively is key.", "score": 0, "replies": [{"body": "Look, I am too, and if you want to try and beat our peers by crossing the spread and paying them for a position that doesn't make any sense just to be right in this argument, be my guest, but depending on your size, there are much better ways of expressing a long position in an underlying *in the aforementioned situation* by just buying the stock itself.\n\nI'm not exactly sure what your point really is, other than the fact that market makers can misprice options, which is true, but in the instances where that is the case, you had better have a realistic idea of how you plan to exit a position at a profit, or at least something to lean on in the meantime..", "score": 1, "replies": [{"body": "If someone lifts your .60 offer 1k times and then you go look and see stock ripping and you don't know why would you really be happy with the position? Do you really think you can go out and trade it for .60 again?  \nWhen I'm confident on the option being worth .25 more its not for some bs reason or because i like buying stock. It's cause the vol's way too low and something's going on", "score": 1, "replies": [{"body": "> If someone lifts your .60 offer 1k times and then you go look and see stock ripping and you don't know why would you really be happy with the position? Do you really think you can go out and trade it for .60 again?\n\nNo, my orders would be cancelling and I would be buying the .60's back as soon as the stock started moving substantially.. Just like every other market maker.. If someone takes 1k of my .60's and the stock doesn't move, I'll bid them or just buy the stock and wait till the next day...\n\n> When I'm confident on the option being worth .25 more its not for some bs reason or because i like buying stock. It's cause the vol's way too low and something's going on\n\nWhen you're confident on the option being worth .25 more, go ahead and come try to buy it from me.  If the stock is ripping there will be no offer to take, and if the stock is solidly offered, I'd be happy to sell you .60's and then buy them back from you for .5.  The reason the spread is wide in the first place is in case of a dramatic move, and I wouldn't be offering >1k contracts on something if the stock wasn't sufficiently liquid such that I couldn't quickly be covered for my entire size without much slippage.\n\nI don't know where you're making markets, but there are few people still leaving offers hanging without some sort of automation cancelling them for volatility or moves in the stock.  If someone is still hanging and the rest of the market starts to go, I agree you should take him, but that's completely different than crossing a wide spread based on some move in the future that isn't materializing at that moment.", "score": 1, "replies": [{"body": "Meant it more as in you're say 250 of a 1k lot, it all trades. and then the .60 offer fades. You're not going to be able to buy it back for .60.  \nAnd it's not so much the delta that's a problem, it's the gamma. ", "score": 1, "replies": [{"body": "It doesn't matter what greek you want to use to explain it, if someone takes out the whole .60 level, you're right, it will be hard to buy it back because you're theoretically joining other buyers at .60, and most of the market will have sold with you, increasing the upward pressure on both the underlying itself as people delta hedge and the call as people try to pay up to cover quickly.\n\nBut, that's the business of market-making... the whole reason I quoted such a wide spread was so that in this situation, I can still cover myself immediately with stock and not lose money to slippage because of a lack of liquidity in the underlying.  If the price continues going up I can cover 1 to 1, and if it doesn't then I shed stock and wait for the vol to come back in to where someone says it's too expensive and starts hitting the .60 bid.", "score": 1, "replies": [{"body": "Sure, if you cover the whole thing you're ok if the stock totally rips. But that's what I kind of want as the buyer of the option anyways. Usually, I'm doing these on weekly options offered at a nickel and I've found that I have way more success with those types of ideas if  I just lift a 2 cent wide market instead of putting out a midmarket bid", "score": 1, "replies": [{"body": "> Sure, if you cover the whole thing you're ok if the stock totally rips. But that's what I kind of want as the buyer of the option anyways.\n\nWhat you want as a buyer isn't really consequential to the market though, as a MM in that situation all you're concerned about is mitigating the risk and eventually closing the position without realizing a loss.. It can go your way while I still make money.\n\n> Usually, I'm doing these on weekly options offered at a nickel and I've found that I have way more success with those types of ideas if I just lift a 2 cent wide market instead of putting out a midmarket bid\n\nOkay, so I see what you're saying, but that's actually not at all the type of situation that I was referring to in my original example... Buying cheaply offered options the week of expiry has nothing to do with the concepts we were originally describing because there currently is no bid.. your downside is inherently limited to the b/a spread because the bid can't decrease any further...  There are *without a doubt* opportunities there, but I'm just not really sure what that has to do with crossing a wide spread, or honestly what a market maker is doing gambling on nickel offered weeklies.  If you were selling a synthetic call against it maybe.", "score": 1, "replies": [{"body": "Didn't really see the original example, but I was addressing the assertion that it's not really worth it to cross a wide spread.  \nWhen it's something like .02 at .05, its a pretty wide spread, but it's easy to scoop a couple thousand of those for .05 or bid .04 if you think it should be worth a dime. I don't really aggressively buy meatier options, but I'd imagine that if you're confident on the vol its better to be the aggressor than be passive like a MM.  ", "score": 1, "replies": [{"body": ".02 by .05 is not a 'wide spread' in the sense that I was trying to describe.  The types of options that I was referring to don't even trade in penny increments, they're not liquid enough.  The specific situation you're referring to is more a result of people trying to close positions rather than executing them than it is 'mispricing' by market makers. If you think a MM isn't *letting themselves be hit*  in most cases when retail trades with them, you're wrong.   There are some less sophisticated participants, but most have some sort of backstop or automation to make sure they aren't quoting something that wouldn't profit for them, and most people aren't selling nickels because they want to, they're doing it because getting filled there makes them more than if they let them expire.\n\nCrossing for .05 might be expensive as a percentage of the bid, but the option and underlying itself aren't illiquid in that case, or the offer would be much higher to compensate for the risk of a large move, which was the situation I described earlier.", "score": 1, "replies": [{"body": "People on the .05 offer are definitely not just closing.  \nAnd I'm not saying they're quoting something at a price that they don't think is profitable. When I think something is worth a dime and the market thinks it's worth 3 cents but hasn't reevaluated their vol level in  a while I'll be the aggressor instead of worrying about how much screen edge in giving up. ", "score": 1, "replies": [{"body": "What I'm saying is that if I'm a DPM, and I've been collecting calls (or puts) on every strike for that underlying at/under parity for the past few weeks, you bet your ass I\"m willing to sell them to you for .05 the week of expiry, because I\"m not taking any risk to do so.  Do whatever is profitable for you.", "score": 1, "replies": [{"body": "Why would you sell them for .05 if you think their fair at a dime?  \nAnd I doubt you'd have a ton of these bought under parity. It's otm stuff in not very heavily traded weeklies. The whole idea is that it's a thing that doesn't trade constantly but is still quoted a few vol points wide. ", "score": 1, "replies": [{"body": "If they're offered at .05 and nobody is taking them, they're fair somewhere below .05... I genuinely don't know how you could possibly be making markets profitably and not understand this concept.  An option is only worth what someone will pay for it at any given moment, just like anything else. \n\n Every option has intrinsic and extrinsic value.  If it's otm and you want to buy risk from me for more than it's worth because you think it will all of a sudden have more than .05 of intrinsic value in the next few days, again, be my guest, but don't confuse your hopes for intrinsic value.", "score": 1, "replies": [{"body": "Maybe nobody's looked at that line yet, maybe another trade happened and this option should move, maybe the vol is just wrong as something has just changed.  \nOptions, in addition to being valued based on what someone will pay for it, are also valued based on what they are worth at expiration, and the market makers can be running incorrect vols.  \nI do make markets profitably but I also have edge taking markets when I'm confident that the vol is too high or too low.  \nIn a case like this, usually I'll lift the offer for as much as I can get. Then, they predictably fade it a nickel or so. Usually, what happens after is somebody takes a look and decides they didn't like the trade or that the vol was in fact too low, and they actually start bidding higher. Like I said earlier, it's rare that I'm this confident on the buy side, but when I am I'm usually right and it's reflected in how markets react to the trade.  \n", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "The 'fair' value of an option, mathematically speaking, is when the expected value of the entire transaction is zero (ie the time discounted expected payoff is equal to the price).\n\nFiguring out what this value should be mathematically is very complicated, and the Black Scholes formula is a very simple special case. ", "score": 0, "replies": []}]}]}, {"body": "\nThat was exactly my 2017 options resolution but the lure of seemingly easy $$ clouded my judgement. I had to get smacked around a bit.", "score": 2, "replies": []}]}, {"body": "There's always something to learn and it always seems to be learned the hard way. Sometimes we just have to eat our losses and move on. Just because you're losing money on those puts doesn't mean it's a bad thing. You took a risk and unfortunately it hasn't paid off. Maybe the next risk you take outside of your strategy will reward you. \n\nCheers", "score": 3, "replies": []}, {"body": "You're not alone.  I'm in a similar sh!tstorm with URI.  Every time someone says Trump and wall in the same sentence the price goes up another 5.00.\n\nI'm sure I'm right, as you probably are with AMZN.  The question is, will we still be in the trade when it finally happens.", "score": 2, "replies": [{"body": "Markets irrational something solvent", "score": 5, "replies": [{"body": "Right. Markets can be irrational far longer than you can stay solvent.", "score": 2, "replies": []}]}]}, {"body": "If you have a directional bias why not sell the other side instead of buying... that way you win if it also just stays the same? Think it's going down? Sell a call...  that way if it stays the same or goes up a little you still OK ", "score": 2, "replies": []}, {"body": "How do you choose which of the 50 you target?", "score": 1, "replies": [{"body": "I believe in charts and IBD recommendations. I target underlyings which are in my price range which is up to about $60 (although I have sold a bunch of FB calls.)  I also look for SLIGHT recent weakness or at least consolidation and of course liquidity and some elevated IV. Some past successful underlyings the fore mentioned FB, NOAH, MXL, LUV . Have also done well with MO and BX as dividend plays. \n\n", "score": 1, "replies": [{"body": "<60? Why does the price matter. ", "score": 1, "replies": [{"body": "It depends on strategy.  If you are dealing with a strategy with uncovered options,  capital use can get to be excessive with high price per share stocks.\n\n", "score": 1, "replies": [{"body": "Ah gotcha. Ty", "score": 1, "replies": []}]}, {"body": "Because if I am doing covered calls or cash secured puts it limits my exposure on 1 underlying.", "score": 1, "replies": [{"body": "Fair ty", "score": 1, "replies": []}]}]}]}]}, {"body": "Many people make millions buying only long options. Where you went wrong is that it isn't your game and you tried to jump into something you really had no idea about. The professionals make money by being a specialist at one or two things, not by jumping into a trade when AMZN is on a tear. If anything at least this taught you a cheap but valuable lesson.", "score": 1, "replies": [{"body": "yeah, and I think you can thank forums like wsb and tastytrade \"follow a trader\" feature for making many novices overconfident about their ability to trade options right off the bat.  If all you've done is equities, you have no idea how easy it is to lose control of trades and blow up your account.", "score": 3, "replies": []}, {"body": "You are absolutely correct about that.", "score": 1, "replies": []}, {"body": "And some people make millions trading from the short side in a raging bull market. But not novices.", "score": 1, "replies": []}]}]}
