{"title": "Who's the lucky bastard who bought TSLA at $184 AH?", "selftext": "[deleted]", "id": "5qko3h", "created_utc": 1485561632.0, "score": 63, "upvote_ratio": 0.88, "num_comments": 39, "comments": [{"body": "this was a dark pool trade.  it wasn't actually traded at this time.  it was just processed at this time.  this trade happened at an earlier time (in this case looks like an earlier date as well)\n\ni wish i could see the looks on people's faces that saw the drop and had unhealthy amounts long on TSLA", "score": 45, "replies": [{"body": "dark pool trade? What is this bitcoin???", "score": 14, "replies": [{"body": "oh you're not a member?  no dark pool trade for you then", "score": 25, "replies": []}, {"body": "Read flash boys", "score": 14, "replies": []}]}]}, {"body": "[deleted]", "score": 21, "replies": [{"body": "Surley thats 13 lots", "score": 8, "replies": [{"body": "1300 shares? Couldn't be...", "score": 3, "replies": []}]}]}, {"body": "[FUCK](https://imgur.com/a/o4cAP)\n\n[MY](https://imgur.com/a/zZ2IP)\n\n[ASS](https://imgur.com/a/YMn2F)\n\nThis is why I hate WSB", "score": 18, "replies": [{"body": "That's what your retarded ass gets for using a market sell.", "score": 25, "replies": [{"body": "sells. Those are 3 separate dumb market *sells*\n\nI panicked and sold to lock in my .02% gainz. Then I proceeded to [burn my account to the ground](https://imgur.com/a/Tfq4M) with a series of shitty 3x trades on margin\n\nedited", "score": 17, "replies": [{"body": "you're good at this ", "score": 10, "replies": [{"body": "Yeah I'm good at it now. That bottom is exactly when I switched to only trading DGAZ and UGAZ. It's part of my New Years resolution to trade gooder ", "score": 7, "replies": [{"body": "What's your strategy on trading DGAZ and UGAZ?", "score": 1, "replies": []}]}]}, {"body": "What was your thought process for putting on margin??", "score": 1, "replies": [{"body": "*\"Scared money don't make no money\"* or some shit like that\n\nTurns out [stupid money](https://www.reddit.com/r/wallstreetbets/comments/5b7ebf/can_confirm_uvxy_is_dead/?st=IYHA2SN5&sh=a70e2b44) makes even less than scared money.", "score": 4, "replies": []}]}]}, {"body": "Eh, that's sort of irrelevant in this case, the sell prices were close to the correct trading price at the time. Market orders in that instance are foolish though. ", "score": 1, "replies": []}, {"body": "Only autistics think retardation is funny.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Dang man, I'm not sure if you're aware or not, but those 50 shares would worth a lot more if you hadn't sold ", "score": 6, "replies": [{"body": "149", "score": 3, "replies": []}]}, {"body": "Why is that WSB's fault? ", "score": 2, "replies": [{"body": "BECAUSE IM DOWN MORE THAN 20K SINCE I SOLD THAT SHIT AND I SHOULD BE UP 1000K INSTEAD YOU FUCKS. ITS NOT MY FAULT ITS YOU'RES", "score": 5, "replies": [{"body": "WHY AREN'T I 50 POINTS AHEAD", "score": 3, "replies": []}]}]}, {"body": "WSB didn't do that.  You did.", "score": 2, "replies": [{"body": "Look man. All I'm saying is, you basically owe me money", "score": 1, "replies": [{"body": "i loaned it to Ef Es Si.  Sorry.  I'm sure he'll pay me back soon.", "score": 2, "replies": []}]}]}, {"body": "Jesus Christ lol next time give it some time...", "score": 1, "replies": []}]}, {"body": "Can someone clue us in on how this happened?", "score": 5, "replies": [{"body": "Its just an AH anomaly, there is no actual trade and no one got fucked. It happens constantly.", "score": 3, "replies": [{"body": "Could this trigger a stop-loss? I imagine I'd be quite begruntled if I woke up one morning seeing my shares sold during a 1-hour-spike...", "score": 5, "replies": [{"body": "no it can't, think of how absolutely destroyed our market would be.  this is an uncommon occurance, but happens enough that investors would literally stop investing if it triggered SLs", "score": 3, "replies": []}]}]}]}, {"body": "Calm down, Elon", "score": 2, "replies": []}, {"body": "I bet there's already a system for this, but why not set a limit order for a stock AH considerably low and wait for something like this to happen. Rarely happens but would be worth it ", "score": 2, "replies": [{"body": "Because then you're locking up your liquidity on buy orders that never go through.", "score": 6, "replies": []}, {"body": "because if it keeps sinking youre fucked", "score": 6, "replies": [{"body": "Also there likely aren't that many shares available at that lower price, this order only filled 13 shares at the lower price.", "score": 2, "replies": []}, {"body": "Yeah, but unless big news came out about a specific company, a stock that drops down from a fat finger like this usually spikes back up.", "score": 1, "replies": [{"body": "I understand your idea behind it but you have to consider the system that would be in place. If a stock drops x% then it kicks in a buy right? Well what if it dropped 2x% and you got fucked? When you say it usually spikes up have you actually studied this extensively? How many losses are you going to take before you give up on the system? Typically a system that buys into stocks in freefall isn't profitable. It's a very easy mistake to make in hindsight ahhh I should have bought at the low! Well yeah, If you buy low and sell high thats a pretty solid fucking strat, but you have seen the future. Your system can't see the future and could definitely buy some shit ass stocks. I could keep picking holes at the idea even though I don't think its a bad idea just very hard to successfully implement. ", "score": 2, "replies": [{"body": "Right, i'm not saying it's foolproof or easy, and I am basing this on the few examples i've seen myself and on this sub when a blue chip stock suddenly free falls after hours for no apparent reason and then spikes back up. It was just a thought, obviously not very well thought out I admit lol, but now I guess I know why something like that doesnt exist", "score": 2, "replies": []}]}]}]}]}, {"body": "I'm spartacus!", "score": 1, "replies": []}, {"body": "lol", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": []}]}
