{"title": "Beware of what AMC shorts are holding! (Shorts are causing selling pressure to AAPL and many more)", "selftext": "", "id": "nraupq", "created_utc": 1622718677.0, "score": 8, "upvote_ratio": 0.91, "num_comments": 12, "comments": [{"body": "Wow apple is big the Amc", "score": 4, "replies": []}, {"body": "I am getting worried :( But thanks for the post!", "score": 3, "replies": []}, {"body": "If they have to dump aapl….. wouldn’t that be a huge opportunity for those who aren’t?  AAPL fundamentals don’t change whatsoever.  So… why would it dip for an extended period?  If memes kick it down, that’s free money for someone.", "score": 3, "replies": []}, {"body": "buy snd hold aapl. never trade it, invest in it. very ssfe to hold longterm.", "score": 2, "replies": []}, {"body": "aapl has 100 billion in buyback money so it is the worst stock in the market to short.  no need you wait for a better price. strong support 119-123. this 3 month lack of interest in techs is transitory snd fue to end soon. new highs are almost a sure thing and evrntually 200 will be breached.", "score": 1, "replies": [{"body": "I think you didn't get the point. Shorts have to sell their long positions to cover their losses and AAPL is one of their long positions. They are selling their AAPL stocks and this is why the price is going down these days. It's just a buying opportunity.", "score": 1, "replies": [{"body": "Yes you are right. and indeed money being used for the highly speculative and/or totally overvalued stocks like AMC as well as cryptos and anything else that is simply a Reddit meme fad, hopium dream or a temporary trading playground does sometimes come out of real investments like Apple or paying off mortgages or whatever.   I am 64 and retired and have made 5 million profit off Apple alone, so my attitude is different.   That is, I value capital preservation plus steady longterm gains and dividends.  AAPL's dividend isn't much but for a long term holder with 56,500 shares it is $45,000 play money for me.  My opinion on all the hot gainers of late is to take the money and run. Then put it into AAPL.  I was in the movie business for 35 years and no way AMC is worth even half of what it's selling for now. Want a streaming play, put it in T or VIAC and just wait. Both are undervalued.  In fact people are so used to streaming at home now that theaters probably will never recover. Also all these post covid back to normal stocks have pretty much already priced in a full recovery.  One stock I wish I had  bought is Crocs because I have been wearing nothing but Crocs all year and that company seemed on the verge of going under a year ago.  But you see, that like Apple is a company that has real value because people really buy its stuff in growing numbers. On the other hand, Crocs take forever to wear out and there are a lot of counterfeiters so I prefer to just stay in AAPL.  AAPL has been doing nothing for three months now but that means it now has built a powerful base and can use that as a springboard for the next leg up to the 150 level. I expect to see that at the end of the summer probably.  Longer term I think AAPl can easily pass $200.  and that is why I sleep well at night even if AAPL has been sluggish lately and many days I have been down $100,000 or more.  I can live with that because when it finally moves again and tech is back in favor, I can add a million or more in value rather quickly.", "score": 3, "replies": [{"body": "This guy gets it.", "score": 2, "replies": [{"body": "All these crazy meme \"investments\" and cryptos are bound to crash badly. They are games of musical chairs, pyramid schemes really.  Unless you get in and out at the right time you are playing with fire.  Safer to go to a casino really.   But one stock the Reddit crew drove up was VIAC.  That went to 108 then crashed to 38 and now it's at a very reasonable 41, a real bargain actually. Plus it pays a dividend. That is both a solid investment and one that the meme gang might crank up again. It is also a big takeover play.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "AAPL surged the next day which might finally signal the new market cycle back to actual money-making big tech and away from re-opening trades. Yes the economy is re-opening but the covid shutdown period changed it permanently. I was walking around the outdoor Lincoln Mall in Miami Beach yesterday looking to see which stores are busy.  None were really, Macy's was empty. None of the youth clothing stores were happening,  not as many 50% off sales but it appears people are still mostly buying online and I bet they want to watch movies at home too. So AMC is a poor investment and on down the line. The \"escaping from bankrupcy\" plays are also already all done with and re-opening fully is priced into those stocks, including energy, banks and real estate. So if everything has pretty much recovered, no more re-opening trades left and that means the neglected big tech sector has to be the next wave, and at the top of that list is AAPL.", "score": 1, "replies": []}]}, {"body": "Man I wish I had 5 million and a pair of crocs. :)", "score": 1, "replies": []}]}]}]}, {"body": "Just stay away from AMC, cryptos or any highly speculative investment with little or no fundamental value behind it.  AMC is stupidly wildly overvalued as is Gamestop and even TSLA still.  Cryptos are multiplying like rabbits and the Feds just recovered the ransomware payment to Russian hackers so that means the Feds can and do know where crypto money launderers and tax evaders are hiding their wealth and can seize it.  Regulation, taxation and penalties for non-compliance are a sure thing coming soon. PLus, despite all the hype and volatile success so far it is only a matter of time until all cryptos fall to earth and who knows what the losses could be, maybe even 100%,   Right now buy AAPL, VIAC, T, SWKS, these are al  great undervalued companies with little risk and nice upsides.", "score": 1, "replies": []}]}
{"title": "Apple Stock Is Ripe For A Rally. Here’s Why.", "selftext": "", "id": "nrmidv", "created_utc": 1622750493.0, "score": 14, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "Not exactly compelling reasons, but I'd note we're hanging around the 200-day moving average and next week is WWDC and that will get a lot of news play.  \n\nI would also add, that security will undoubtedly be a featured topic and that, of course, given the recent ransomware news, plays to a fairly unique Apple strength.", "score": 3, "replies": [{"body": "The entire tech sector has been ignored for the last few months. This is a temporary market cycle coming out of the covid \"depression\". Some techs which depend on stay-at-home business like Zoom should and have declined, but Apple is not one of those. Apple performs almost the same covid or no covid. Major growth drivers for Apple now are in China, India and around the world. 90% of US youths are on Apple and IOS and young people everywhere wannabe the same.  Anyway, the last rally to 145 was a bit too much too fast, but the last earnings report was ginormous and justifies a 33+ PE, but the whole sector starting selling off after that and the momentum went to the post-covid stocks. Understandable. Also meme stocks and cryptos have gotten a lot of play but those are all silly non-investments, so sanity will prevail soon. When it does, Apple will lead the market and techs up again.  Likely this will start in 1-3 months as the new product cycle nears. Apple usually does very well around August. So likely that will happen again, and if so, this is the perfect time to buy. and I would not worry about 119 unless there is a major market collapse based on some unforeseen geo-political event. Looks like 123 is the new bottom.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "My lowball 2025 price target is $175 - $265", "score": 2, "replies": []}]}]}, {"body": "Maybe it's in a period of consolidation", "score": 2, "replies": [{"body": "correct, very strong consolidation. edtablishing a new bottom.", "score": 2, "replies": [{"body": "Per Demarks analysis, it has to hold 119.97 TD support", "score": 1, "replies": [{"body": "Iam a big fan of Demarks", "score": 1, "replies": []}]}]}]}, {"body": "i agree. Aapl will take off later this summer. 150 plus.", "score": 1, "replies": []}]}
{"title": "Brk.A Stock Volume", "selftext": "[removed]", "id": "nrhmxt", "created_utc": 1622737924.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 9, "comments": [{"body": "Maybe someone is destroying A-shares\n\nBuying A-shares, converting them to B-shares and selling the B-shares\n\nThis concentrates voting power with the long-term A-share holders", "score": 3, "replies": [{"body": "Protect A-shares! We need a wildlife sanctuary for A-class shares!", "score": 3, "replies": []}, {"body": "ok for that theory- One Class A coverts to 1500 class B\n\nyou would see a huge volume spike in class B (and possible dilution which is not happening with Class B)\n\nalso why would anyone want to covert Class A to Class B", "score": 2, "replies": [{"body": "Why convert A to B? To destroy the voting power, permanently", "score": 2, "replies": []}]}, {"body": "Brilliant if true.", "score": 2, "replies": []}]}, {"body": "Aftermath of Munger and Buffet Departure  whoever holding A shares has great influence in company direction ,  My opinion is to keep the Berkshire culture Intact Berkshire itself wants to strategically destroy A shares and might encourage the well-wishers  Trusts or super long term investors  to do so \n\nWarren himself told multiple times as his entire  Shares (mostly A )  will be donated after converting those to B shares , if people want to pass A shares from one generation in the family to other or sell them in part they are forced to convert them in to B and sell to avoid taxes .\n\nGradually A shares go away or remain within the closed group", "score": 2, "replies": [{"body": "Yeah there are sec forms showing the conversion of A to B, for the donation shares by munger or buffet to the charitable trust...but it's like 40 or 70 shares.\nSomething much bigger is going on. 3 plus months of 2k volume on a stock that typical volume is under 500 and average volume is usually 250.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Fidelity trading pro", "score": 2, "replies": []}]}, {"body": "Great question.    Don’t have the answer, but it does look like there is a steady conversion of “A”s to “B”s that happens every year.  That wouldn’t explain the recent spike in share volume, but it does show a steady reduction of the senior share class.    \n\n\nPage K-107 of the most recent annual report shows 2018-2020 conversion figures…..over 80,000 A shares were converted, with 2020 accounting for over 40,000.  If this clip continues, and already knowing Buffett’s \\~220,000 shares are earmarked for conversion as part of his estate planning, we could see a natural arbitrage in a post Buffett Berkshire where less than 400K shares of “A” hold sway on the conglomerate’s future.\n\nI think of this as I consider selling my “B”s, taking the LT tax hit, and reversing them into a few (4 shares) of “A”s.", "score": 1, "replies": []}]}
{"title": "APXT ticker change/merge with AVPT", "selftext": "APXT, as of 2nd June, is at 11.04.\n\nAPXT has a merger vote to merge with AvePoint from now until 30th June. The ticker will change to AVPT on 2nd July. AvePoint is the largest Microsoft 365 Data Management Solutions Provider. The company is being valued at $2 billion and will trade under AVPT.\n\n**Sector**: Cloud Computing, IT\n\n**The company**:\n\n\\- 200M (Outstanding shares) \\* 11.04 (share price) = 2.2B (marketcap)\n\n\\- First quarter 2021 Financial Results:\n\n\\+ Projected revenue for 2021: 200M, 2.2B/200M -> 10x valuation.\n\nGrowth: 30% YoY, over 80% recurring revenues, and the company is DEBT-FREE.\n\n**Competitors**: some Cloud Computing companies such as Cloudflare, Zscaler, CrowStrike, Snowflake,...\n\nCloudflare (NET, $83): marketcap 26B, projected revenue 2021 612-616m -> 41x valuation.\n\nZscaler (ZS, $192): marketcap 25B, projected revenue 2021 608-612m -> 41x valuation.\n\nCrowdStrike (CRWD, $222), marketcap 50B, projected revenue 2021 874m -> 57x valuation\n\nSnowflake (SNOW - $243), marketcap 72B, projected revenue 256M -> 281x valuation (!)\n\nZuora (ZUO - $15), marketcap 1.92B, projected revenue 80M -> 24x valuation\n\nAXPT has a strong connection with Microsoft and has a huge diversified blue-chip client base - Disney, Verizon, Pfizer, Sanofi, JPMorgan, IRS, Siemens, Raytheon,...\n\nI predict this stock will at least 2x in the short-term to mid-term to get around 20x valuation as a Cloud Computing company. APXT already has positive revenue so it will even grow stronger.\n\nThe stock price is still low at around the NAV price ($11.04). It is because all SPAC stocks are cooling off after a crazy January bull run and the APXT merger gets delayed because of the change of SEC rules for 4 months, now **it's all done**. Everyone gets tired and dumps the stock but it is fundamentally strong. APXT is changing the ticker on the 2nd of July.\n\n**TLDR:**\n\n\\- APXT/APVT will merge on 2nd July.\n\n\\- APXT is undervalued, at least 2x from here, 4x long-term.", "id": "nr5ki7", "created_utc": 1622697250.0, "score": 51, "upvote_ratio": 0.99, "num_comments": 18, "comments": [{"body": "My body is ready for this merge! Sincerely, this is a great technical executive team within AvePoint and a heck of a duo with Jeff Epstein and Brad Koenig from Apex. This is going to be a powerhouse!", "score": 7, "replies": [{"body": "Jeff Epstein has a great history. He joined the APVT board also. This is going to be huge.", "score": 4, "replies": [{"body": "They also added Jason beale from Palo alto networks", "score": 3, "replies": []}]}]}, {"body": "It's about time. Many are worried about the merger approval from SEC due to the policy change, but now it is all done. Solid company, positive revenue, high growth YoY, no debt.\n\nThere are some competitors they mentioned in their slides, which I intend to do analysis on these as well today. My first glance is that, these companies still have 20x valuation, which is double of apxt's (!)  \n\nAvepoint also planned to purchase back maximum 20M shares which no spacs has ever done, indicate their belief in the future of the company. They did buy back 1.6M. I think they will buy more after ticker change.", "score": 6, "replies": [{"body": "Fellow long, hoping institutions add going into and after the deSPAC.  Very low institutional ownership last I checked.  I think you’re right about buyback being resumed if still near $10.", "score": 3, "replies": [{"body": "Been in since November.  I think a lot of institutions pulled out first quarter due to SEC.  I think you’ll see them get back in after merge.  That’s my hope at least.", "score": 3, "replies": []}]}]}, {"body": "Any day now to the moon. No doubt on the AVPT & APXT team.", "score": 6, "replies": []}, {"body": "nice writeup.  i'm also long APXT via warrants.\n\nHow did you get to your comps?  Seems using the highest multiple cloud computing companies is a bit wishful thinking.  For context, APXT lists the following peers in their investor presentation:\n\ngrowth infrastructure:\nAYX\nDT\nJAMF\n\ngrowth saas:\nAVLR\nFIVN\nRNG\nHUBS\n\nAll of the above have substantially lower multiples than the ones you listed.\n\nThanks!", "score": 4, "replies": [{"body": "I do research on Cloud Computing companies. Thanks! I will take a look and do the DD on the companies you have here.\n\nI did a quick skim on AVLR for example, they have 11B marketcap, I would project their 2021 revenue to be around 600M, the valuation is around 18-20x. Apxt is around 10x, still an 2x from here. I will update other companies as well.", "score": 6, "replies": []}]}, {"body": "nice analysis 👍👍👍", "score": 4, "replies": []}, {"body": "I added more $APXT today. Avepoint has an incredibly bright future.", "score": 4, "replies": [{"body": "yes, don't for get to cast your vote.", "score": 3, "replies": []}]}, {"body": "This is probably a silly question, as a shareholder of APXT, the day the merger happens will the ticker(APXT)  just change automatically (AVPT) in my portfolio?\n\nWondering if there’s any other steps I need to take, I have voted. \n\nThanks!", "score": 3, "replies": [{"body": "Yes, your shares just change to avpt automatically", "score": 3, "replies": []}]}, {"body": "No need for 2x. Just get back to 14 so I can get out.", "score": 2, "replies": [{"body": "How long have you hold? For that long hold, don't you want profit?", "score": 2, "replies": [{"body": "I think 5 months or more well over 11k share. Should have sell it when it hit high 17 instead of  adds more.", "score": 2, "replies": []}]}]}, {"body": "I hate my life.", "score": 1, "replies": []}]}
{"title": "In case you've missed what's going on in the US", "selftext": "Fed’s Beige Book Reports Pickup in Recovery, Price Pressures: [www.bloomberg.com/news/articles/2021-06-02/fed-s-beige-book-reports-u-s-economy-expanded-at-moderate-pace](https://www.bloomberg.com/news/articles/2021-06-02/fed-s-beige-book-reports-u-s-economy-expanded-at-moderate-pace)  \n\nGlobal Food Prices Surge To Highes In Almost Two Decades According To The UN: [www.bloomberg.com/news/articles/2021-06-03/global-food-prices-surge-to-highest-in-almost-a-decade-un-says](https://www.bloomberg.com/news/articles/2021-06-03/global-food-prices-surge-to-highest-in-almost-a-decade-un-says)  \n\n&#x200B;\n\n[Citi US Inflation Surprise Index hitting an all-time high since its inception in 1998](https://preview.redd.it/qzpeon80t0371.jpg?width=782&format=pjpg&auto=webp&s=2359cc73c40d3b0d80be858b6c74ec67becf83a8)\n\n&#x200B;\n\n[Government payments still make up 22&#37; of US Personal Income](https://preview.redd.it/yoorg2ylt0371.jpg?width=936&format=pjpg&auto=webp&s=6148693c53fce07a35b5fe4ba040367a63f327eb)\n\nMeanwhile, Powell and the Fed: Inflation is transitory, we're not worried. 🧐 \n\nThe Fed is apparently starting to sell some of its ETFs and corporate bonds accumulated during the stimulus ([https://www.wsj.com/articles/fed-plans-to-sell-13-7-billion-of-corporate-bonds-etfs-by-year-end-11622666400](https://www.wsj.com/articles/fed-plans-to-sell-13-7-billion-of-corporate-bonds-etfs-by-year-end-11622666400)), but when you look at the numbers you can tell that they are just trying to play the market. If I'm not mistaken, that's only about $14 Billion! At the same time, they've pumped at least $750 Billion in the markets over the last 12+ months AND they are continuing to do so!\n\nThis may be a classic case of me falling prey to confirmation bias, but literally everywhere I look, inflation is only just starting! What do you guys think?", "id": "nr9hst", "created_utc": 1622713308.0, "score": 10, "upvote_ratio": 0.92, "num_comments": 10, "comments": [{"body": "The economy is going to crash. It is not going to be pretty. No one wins.", "score": 2, "replies": [{"body": "Most of us weren't winning anyway. It will give everyone a chance to get in on new value positions and heavily average down their current positions. There is good along with the bad.", "score": 2, "replies": [{"body": "Plus if you have money on the side and buy after the crash returns will be crazy.", "score": 1, "replies": []}]}, {"body": "Except for GME, amirite guys?   Guys?", "score": 2, "replies": [{"body": "You are a shill.", "score": -2, "replies": [{"body": "lol\n\nI may not be an xxx holder, but I’m in the xx holding section.", "score": 3, "replies": []}, {"body": "I like the stock, and just tier sold some AMC to cover the initial purchase. So, Here, We, Go.", "score": 1, "replies": [{"body": "I appreciate you, it was the other one whom I was addressing.", "score": 1, "replies": []}]}]}]}]}, {"body": "Most people do not pay attention or invest, they simple are invested through pension or 401. So when the market crashes they lose that amount of cash that was there. They do not have a side stash. The percentage of Americans that invest is so small.", "score": 1, "replies": []}]}
{"title": "The global chip shortage and how I'll be taking advantage of the semi's dip: NVDA, AMD, AMAT, TSM", "selftext": "The global semi-conductor shortage, aka chip shortage, has been crippling many industries. Demand for chips is continuing to outstrip supply and the car industry is longer the only one feeling the pain. Many auto-makers are actually limiting the amount of cars produced in 2021, including Ford recently who announced they will be canceling weeks worth of production of the F-150.\n\n**Overview**\n\nThere are a few factors at play giving analysts the impression that this shortage may last until early 2022. There’s a few KEY points that come to mind:\n\n* Most chips are produced overseas: Covid-related delays in shipping ports have effected supply coming into the United States.\n* China has been stock-piling chips: Chinese businesses have bought an absurd amount of chip-producing equipment (roughly $32 billion) in an effort to protect themselves from further US sanctions.\n* Demand for electronic products have soared.\n* Often over-looked, consumers don’t realize the amount of chips it takes to build cars in 2021. The trend is continuing in the same direction as many analysts expect the automative industry to begin predominantly developing cars with network connectivity.\n\nThis leaves an opportunity for those willing to look past the hardship some of these companies are experiencing of being unable to meet demand. The semi-conductor industry is expected to grow at CAGR of roughly \\~9% over the next 7-8 years. I see this as a relatively conservative number and it is my opinion that we are heading into a super-cycle of chip upgrades, processing power, and memory devices. Here are a few reasons:\n\n1. We are already seeing noticeable shift in demand and the way consumers are interacting in a new digital world.\n2. These electronics are becoming faster and more powerful, which simply requires a larger quantity & quality of chips.\n3. More and more devices rely on connectivity and the car industry is now making it’s way onto a similar path.\n4. Following Nvidia’s earnings call we are seeing a large rise in trends for AI and machine-learning which is leading to increased demand for the required components.\n5. The rise of crypto mining will also play a role in the increased demand.\n\n**The Players**\n\nMany of the chip-related plays have already seen convincing growth over the last 12 months. However, several names have recently followed the markets to the downside and currently pose a potential good entry point. This secular trend in semi-conductor demand over the next several years is here to stay.\n\nMy semis watchlist is holding some familiar names: Applied Materials (AMAT), ASML Holdings (ASML), Skyworks Solutions (SWKS), Nvidia (NVDA), Intel (INTC), Advanced Micro Devices (AMD), Qualcomm (QCOM), and Taiwan Semiconductors (TSM).\n\nThe ones that make my shortlist are the following: NVDA, AMD, TSM, and AMAT. Here’s a look at the 2-year chart for the 4 tickers mentioned above. \n\nhttps://preview.redd.it/xr0kge6rq2371.png?width=2380&format=png&auto=webp&s=c4beece1276b8c383ed5a2c0cca07bf40f42da11\n\n&#x200B;\n\nIt is clear the secular trend in computer chips and processors have contributed greatly to the growth of these companies. Let’s take a look at a shorter time-frame. Here’s the 3-month chart for the same list of tickers. \n\nhttps://preview.redd.it/pip83wxqq2371.png?width=2388&format=png&auto=webp&s=b353b714f1958233646a57ee5680bf2385ee2a3d\n\n&#x200B;\n\nLooking at it from another angle we see AMD and TSM have been lagging behind the performance of AMAT and NVDA, who are on a nearly identical path. TSM is a leading manufacturer of chips and actually supplies most of AMD’s chips. They are based in Taiwan and there have been some concerns over the potential invasion of China. Setting those concerns aside these companies may still experience strong growth. My plays right now are in AMD and TSM and I will feel comfortable adding to any of the names I mentioned in this article if the right entry point shows itself.\n\n**Final Thoughts**\n\nI would love to say here’s why “x” company is in a better financial position than company “y”, but in this case I believe the high demand for semiconductors will benefit most names participating in this industry. Of course, not every company is made equal so please do your own research before investing in any stocks. In my opinion, this industry is in an upward secular trend and demand remains in-tact, providing tailwinds to the participants.\n\nKeep an eye on earnings reports and financial data of companies that BUY these products. Look at phone, tablet, computer manufacturers (Apple), cloud server providers, Google server expansion (also server chip REPLACEMENT rates, which is a thing), and AI/Machine learning projects (autonomous driving, video analysis, big-data processors). It may be years before the growth slows in this industry and these players will stand to largely benefit.", "id": "nrh2hj", "created_utc": 1622736430.0, "score": 31, "upvote_ratio": 0.92, "num_comments": 15, "comments": [{"body": "Excellent DD. In summary, I would say “Buy the chip dip.”", "score": 8, "replies": []}, {"body": "Need more chips", "score": 5, "replies": [{"body": "And dips", "score": 2, "replies": [{"body": "This!! I will follow...", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Same position as you for the same reason. TSM was tempting for a while but due to their valuations and also general unwillingness of China’s to... you know... call them a country...", "score": 2, "replies": []}]}, {"body": "I read some great dd on tsm the other day, looking at 7/16 120calls that falls 1 day after q2 earnings, your dd was a good confirmation, picking them up in the am. Thanks", "score": 2, "replies": []}, {"body": "ON is another one I’ve got my eye on.", "score": 1, "replies": []}, {"body": "I really like TSM, but they make high end, high transistor count chips which isn't what cars use.", "score": 1, "replies": [{"body": "Which companies produce chips that cars use?", "score": 1, "replies": []}]}, {"body": "I recently picked up some shares (really not a big time investor, so we are literally talking 5 shares here) of LEDS after reading a bit on the company, and suddenly in the last week or so it's been jumping like crazy.  I'm about as n00b as they come at this point, having only started investing in 2019, but any chance it is related to the chip shortage?  Or am I just looking some random pump and dump?", "score": 1, "replies": [{"body": "Also, any thoughts on RNECY or IFNNY?", "score": 1, "replies": []}]}, {"body": "Don’t forget LRCX!", "score": 1, "replies": []}, {"body": "SDPI i like this little company and i'm accumulating at this price.", "score": 1, "replies": []}, {"body": "My strategy doesn't relay on shortage because I am long term investor and i think the industry is overvalued as a whole", "score": 1, "replies": []}]}
{"title": "Would Tesla ever consider acquiring Ford?", "selftext": "Disclosure: I own Ford stock\n\nYears ago I bought Ford as a value play, back then it appeared undervalued and had a solid dividend for the sector. I feel like Fords F-150 alone is enough to justify owning the stock. Then the pandemic happened, then the chip shortage happened and I have remained patient. \n\nNow that patience has been rewarded, I keep looking at TSLA and F and wonder why they don't get together. With Ford's diverse product lineup, aggressive move into the EV market and projections of profitability, I think they represent a significant value. I know they are hampered by huge legacy costs, but in todays inflationary environment, I believe those costs are mitigated.  \n\nTSLA is losing market share and their shiny new offering (the cybertruck) is still a long way off. Yet TSLA still has nearly 10x the market cap of Ford. This makes me wonder if TSLA would look to pick off a potential competitor in the EV market, expand their products offerings and create a big splash all at once.", "id": "nrj6n5", "created_utc": 1622741927.0, "score": 0, "upvote_ratio": 0.3, "num_comments": 19, "comments": [{"body": "I won’t ever say something has a 0% chance of happening - but I imagine this is pretty close to 0%.\n\nJust because TSLA’s market cap is larger, it doesn’t mean it has free cash to purchase a ~63 billion dollar company (that likely wouldn’t approve a sale).", "score": 21, "replies": []}, {"body": "No. I highly doubt this would happen.", "score": 21, "replies": []}, {"body": "Including all the subsidiaries??? The Ford Family will never sell. :-)", "score": 11, "replies": []}, {"body": "- Would the US government even allow such a sale or merger?\n\n- Would the Ford Family even consider the idea?\n\n- Aren’t the company cultures of Ford and Tesla drastically different? Ford has more in common with foreign car makers like Toyota or Honda then they do with a tech-oriented company like Tesla.", "score": 7, "replies": []}, {"body": "Lmaoooooooo", "score": 15, "replies": []}, {"body": "Musk has repeatedly voiced that the \"dinosaur\" automobile manufacturers have no chance of competing with him because they have assets that turn into liabilities during the transition to ev.  Theres no chance he will merge with them if that's his perspective, from his perspective it would be a hindrance to tsla to merge it with a company with depreciating assets.", "score": 4, "replies": []}, {"body": "It will never happen.  In order for a merger like this to happen Ford would get a deeper peak into the financials.  Once they discover that most of the income Tesla pretends to have is coming from carbon offsets, crypto and accounting recipes from \"20 top vegan recipes to use a pressure cooker\" F would run away from the table.  \n\nJust because the SEC turns a blind eye to every time Musk tweets in a last ditch effort to bring the stock price back up doesn't mean that F would.", "score": 7, "replies": [{"body": "This is the best answer I have seen so far, thank you!", "score": 3, "replies": []}]}, {"body": "You mean they’d finally be an auto manufacturer 😂😂", "score": 6, "replies": []}, {"body": "Not a chance in hell. Ford is off to a decent start with their EVs, but what most don't realize is it's going to be unprofitable for many years to come and that's not including the Osborne effect with their ICE vehicles. \n\nWhat many believe are assets - equipment, engineers to name a few - are really liabilities needing to be flushed out, rebuilt and retrained (new engineers). \n\nFord is the only US based EV I see surviving the decade. GM is more show than anything else. Huge mistake hyping up a Hummer EV that's not going to be available for a few years. They needed to do what Ford did and focus on their Silverado.\n\nBack to your question though. Tesla is vertically integrated and the cultures are no where near compatible. Note: this isn't about valuation or their futures. They simply have no need for acquiring any legacy manufacturer. Tech and battery side, that's the only possibility I see.", "score": 6, "replies": [{"body": "Stuff like this is why I love reddit. Thank you. Though I do disagree about the osborne effect in regards to the F-150 and other offerings. I think the chip shortage and lack of production is allowing Ford to see what the demand is and then gear their production to meet it. So yes, they may lose some gas powered customers to EV, but that will be more profitable especially with their new subscription based software that all the carmakers seem to be sneaking into their next gen EV's.", "score": 3, "replies": []}]}, {"body": "it's an interesting question but Ford has now finally seen the light- in a good way! and has gotten ahold of what the future will be. \n\nGoogle is also a deep ally of Ford and is far ahead in autonomous driving and AI. If I'm Ford, there is no way in hell I'd let Tesla buy me out. The legacy, the new lineups, the following, the infrastructure... No f'n way.\n\nGood news is that I see Ford being very undervalued, even now. I believe Ford is actually a $40-50 stock. Seriously. And I have put my money where my mouth is on options as well as Ford stock. I see Ford doing very very well in the near, mid, and long-term (without Tesla).", "score": 1, "replies": [{"body": "I see it more around 30 bucks, but I think we are both on the same page.", "score": 4, "replies": [{"body": "indeed! if it gets to $30 I'll still be content!", "score": 3, "replies": []}]}]}, {"body": "The would go against the whole *not an auto manufacturer* mentality and meme.", "score": 1, "replies": []}, {"body": "Wouldn't make sense for either companies.", "score": 1, "replies": []}, {"body": "With what money????", "score": 1, "replies": []}, {"body": "Nah, Ford is the prime example of everything Tesla wants to avoid. They're a slow, corporate and bureaucratic company with outdated tech and no innovation. They'd be a huge drag on Tesla's business and even retooling the factories would be less efficient than just building new factories.", "score": 1, "replies": []}]}
{"title": "Amazon vs Ali Baba without the Chinese FUD taken for account?", "selftext": "I know, the same question gets asked every day. \"Urr durr is Ali Baba a good investment?\" and it gets the same answer: \"Yes but no because China\" and everyone starts arguing in the comments.\n\nSo let's just let's take the China FUD out of the equation, and make believe that in a hypothetical universe, China wasn't threatening to invade Taiwan every 30 seconds, genociding ethnic and religious minorities, imprisoning journalists, and suspending free elections. How much would Ali Baba actually be worth? I'm seeing crazy price targets in the thousands.... but it all sounds like wishful thinking. \n\nIt generates sales of 39.9 billion vs Amazon's 232 billion, and it's revenue is about 71 billion vs Amazon's 386.1 billion. \n\nAmazon seems to already be intrenched in Asian markets, making 30% of online sales in India for instance. Unlike the early 2000's, online retail is no longer a new frontier market, so I just don't get how Ali Baba quadruples it's sales and revenue without Amazon doing the same. \n\nIn fact, right now it's Market cap is 588 billion, vs Amazon's 1.6 trillion, so it has about 1/3 the market cap of Amazon despite having less then 1/5 of the sales and revenue. Doesn't that signal investors are actually bullish on Baba and not bearish? The narrative I've always been hearing is \"Ali Baba is significantly undervalued because of Chinese FUD\" and yet the numbers would appear that it might be overvalued despite the Chinese FUD. \n\nSorry if I'm missing something, I'm kind of an amateur. I don't mean to annoy people by asking a question that's repeatedly asked, I'm just hoping to start a conversation about Ali Baba's actual value as a company without the politics behind it.", "id": "nrjt93", "created_utc": 1622743545.0, "score": 1, "upvote_ratio": 0.53, "num_comments": 19, "comments": [{"body": "The \"Chinese FUD\" (It looks like Chinese Food) is the only reason to stay away from BABA. So why not include it? You are asking people to look at a stock/comoany, but not to look at the massive risks surrounding it. So your argument is pointless. If you don't take risks into account every stock on the market is the best stock ever.", "score": 22, "replies": [{"body": "One thing I think OP got wrong is that it's not FUD anymore when it's been proven time and again that the Chinese government will make sudden moves that depress a stock's price.\n\nSure, if we're just using make-believe companies, then yes, BABA is potentially cheaper than it should be.", "score": 3, "replies": [{"body": "BABA may have grown as much as it ever will if China keeps kneecapping it.", "score": 1, "replies": [{"body": "Yah, seems like in the short term, it's probably capped around $250.", "score": 1, "replies": []}]}]}, {"body": "It's not an argument, it's a question. \n\nThe numbers don't show it as a valued play, it's not like it's undervalued because of the Chinese FUD (I did that on purpose btw). So why not just invest in Amazon or another online retailer? Unless I'm missing something, it does less then 1/5 the sales and revenue of Amazon but is valued 1/3 as high.", "score": -3, "replies": [{"body": "Yes, your better off with Amazon in my opinion and if you still want some Asian E Commerce exposure maybe look into Coupang. Its fairly valued and doesn't have the same risk as Baba since its not in China.", "score": -1, "replies": []}]}]}, {"body": "Finally, I was waiting for today's BABA thread.", "score": 10, "replies": [{"body": "I'll be making one again tomorrow, same time", "score": 3, "replies": []}]}, {"body": "If China were an open and free society and not a Communist dictatorship, many things in this world would look very different. China is by far the largest (soon to be) developed market in the world and the potential is absolutely huge.\n\nBut you can't just exclude that very real problem. The CCP giveth, and the CCP taketh away at the leaderships pleasure.", "score": 9, "replies": [{"body": "Right but my point is that even if China is an open and free society, Ali Baba still doesn't look undervalued compared to other online retails, Amazon being the first example", "score": -2, "replies": []}]}, {"body": "Correct me if I’m wrong, but Baba has a p/e in the low 20s doesn’t it? Amazons is what - 50 or 60? That would suggest people are very bearish on it...?", "score": 6, "replies": []}, {"body": "There needs to be a mega thread for BABA... someone posts about it almost every day whether it’s a bear or a bull post, 99% of the time, it’s the same body evidence, either a “it’s so undervalued, why?!” Or “China govt is going to ruin this company, sell!!” \n\nI hold shares of BABA and even I am tired of seeing these posts here daily...", "score": 1, "replies": [{"body": "if you're not gonna read the post then idk why you would bother commenting", "score": 2, "replies": []}, {"body": "There's hardly any content on this sub. I don't know why you're shitty on posts that you don't care about. Just downvote and keep scrolling.", "score": 1, "replies": []}]}, {"body": "Is baba a good buy?", "score": 0, "replies": [{"body": "It's pretty close to its 52-week low, so yes, there's potential for it to go up (to around $319). That said, the potential may not be realized in the near term. So from a trading standpoint, there are better near-term options than BABA, without the concern that a government will take any big action against the company without due process.", "score": 1, "replies": []}]}, {"body": "Sadly idiots in this thread don’t know how to read.", "score": 1, "replies": []}, {"body": "Why not both?", "score": 1, "replies": []}]}
{"title": "Portfolio Revamp", "selftext": "Ok so I've been in the markets for about a year but I only started investing about 9 months ago. My holdings are BA, JPM, AAPL, AMD, and ETSY with the largest being BA and the smallest ETSY. My school just ended today and I've been contemplating to sell ETSY ( I have a 185 cost basis for reference), not because it fell of earnings but because I'm looking to approach stocks for with a more value mindset and after further evaluating their business model I don't know if it's that sustainable for long term growth. Also, if I sold ETSY for a loss not only could I write it off but put the money into something like AMD, BA, or HP which I'm looking to buy more of or start a position in. Also, for reference on all of my positions except AMD and ETSY I'm up on and for the ones I'm down on I'm not down that much. What do you guys think", "id": "nrm58z", "created_utc": 1622749570.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 12, "comments": [{"body": "I think ETSY is a great company but because of valuation it will likely move sideways for a while.  I trimmed some of my ETSY too, but I've been in it for a couple of years so it was all profit.\n\nIf you're going to add to anything, I'd add to JPM.  I know it's run well (I've been in it since $100 or so) but financials stand to benefit from rising interest rates in the future.", "score": 4, "replies": [{"body": "Yes I love JPM, I bought into BAC at like 25 then after the large spike from vaccine news I sold and bought JPM at 128 cus I like it more long term, anyways for ETSY I own only 3 shares so would it be smart for me to sell like 1every day it spikes", "score": 2, "replies": [{"body": "If your looking at banking or financials, SCHW has been killing it the last few months. I’m regretting not keeping my position in them.", "score": 1, "replies": [{"body": "I actually use Schwab as my brokerage lol but the stock looks a bit overvalued trading at a P/E of 33 while JPM is trading at a P/E of 13, has a bigger dividend yield, and is beginning to evolve in the fintech space. Thanks for the recommendation tho.", "score": 2, "replies": [{"body": "Oof. Good eye there. I haven’t been paying attention to that. I was in it at around $52 and got out around $58 a few months back. I’ve been watching it off and on since then and it gone up quite a bit. I wasn’t paying attention to its p/e though. Thank you for that.", "score": 1, "replies": [{"body": "np", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Are you not bullish on the dePop buy?", "score": 1, "replies": [{"body": "I think they overpaid for the company tbh, although I can definitely see dePop as a company that would fit perfectly with Etsy's overall vibe and business model, they paid over 20x revenue and I don't know if I like dePop as a company because it's just another reselling platform", "score": 2, "replies": []}]}, {"body": "Smaller money = try to go find small/mid cap companies that the big guys can’t get into", "score": 1, "replies": [{"body": "Yeah I did try that strategy with ETSY and look how that turned out,I did also look into TTCF but I didn't have enough cash on hand to buy the dip and now it's too late", "score": 1, "replies": [{"body": "Hmm. I mean I would look for companies with <= analysts. Etsy at 20 billion has tons of institutions looking at it. Companies like small caps typically have few eyes on it. That’s where my best deals have been.", "score": 1, "replies": []}]}]}]}
{"title": "Tesla's Q2 Results Could Surprise Wall St.", "selftext": "", "id": "nr01fc", "created_utc": 1622678429.0, "score": 53, "upvote_ratio": 0.87, "num_comments": 17, "comments": [{"body": "Rob isn’t even giving Tesla any credit for boosting Model 3/Y production out of Fremont. I’m personally expecting Fremont to increase 3/Y by 5-10% and producing 1-2k Model S. I do agree with his assessment of Shanghai though so I’m currently in the 214k-217k range.", "score": 11, "replies": [{"body": "This was mostly just focused on the implications from Shanghai and throwing a Fremont base case in for the total. Definitely potential upside and I’ll give my thoughts on Fremont more specifically in the normal quarter-end estimate.", "score": 34, "replies": []}, {"body": "Stoop putting out good news... Tesla will keep going down.", "score": 8, "replies": [{"body": "Chip shortage is real. It's sad, otherwise TSLA would be at all time high by now. I will hodl.", "score": 4, "replies": []}]}]}, {"body": "Does that title not apply to every single earnings report?", "score": 18, "replies": [{"body": "That title COULD be applied to every single earnings report.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Does your reply not apply to every single question?", "score": 6, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Does you?", "score": 5, "replies": [{"body": "Replies needed.  Apply within", "score": 5, "replies": [{"body": "Need more experience for this entry level reply", "score": 3, "replies": [{"body": "WE'VE BEEN TRYING TO CONTACT YOU REGARDING YOUR VEHICLE'S EXTENDED WARRANTY.", "score": 6, "replies": [{"body": "My bicycle is in excellent condition.", "score": 3, "replies": [{"body": "*repo’s my legs*", "score": 2, "replies": [{"body": "LOL", "score": 1, "replies": []}]}, {"body": "Mine too, what kind is it?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Give us one of those good old-fashioned run-ups \\*after\\* earnings results", "score": 2, "replies": []}, {"body": "Tesla better blow it out of the park. stock is priced with the expectation of epic quarterly increases in sales.", "score": 0, "replies": []}]}
{"title": "tesla requests help getting the right to sell cars in delaware.", "selftext": "", "id": "nr6mgu", "created_utc": 1622701481.0, "score": 129, "upvote_ratio": 1.0, "num_comments": 15, "comments": [{"body": "I live in SC and it’s the same, had to drive to Charlotte to pick up my car last weekend. It’s completely asinine and anti-consumer", "score": 18, "replies": [{"body": "Yea I’m in NH, and they told me I have to drive to NJ lol. That’s about 9-10hrs round trip for me… \n\nI was told “it’s a great experience to visit Tesla, and pick it up yourself”. I’m sure it is, but I’d rather pick it up in NH lol", "score": 6, "replies": []}]}, {"body": "I wish politicians and other state officials were held accountable somehow.  Like a blockchain that records all their actions/decisions and propagates a penalty or reward onto their lives based on how those policies impacted people 10 years later.", "score": 12, "replies": [{"body": "A good way would be to make recall much much easier.\n\nEg. if it can happen in a matter of days any time 80% of people want you gone at that given moment.\n\nWould give strong incentive not to do massively unpopular things; whereas now, they know they'll keep their tenure for 1-2 years and people will forget.", "score": 6, "replies": [{"body": "facts\n\nbring their skin into the game", "score": 3, "replies": []}]}, {"body": "So carried interest for politics? I would be ok with that.", "score": 1, "replies": []}]}, {"body": "Imagine not being able to buy a bicycle online from the official manufacturer site, but instead direct delivery to your home, you have to go somewhere not-so-near to pick it up, and then bring it back.\n\nyuck", "score": 13, "replies": []}, {"body": "I live in Maryland and drive or take the train through Delaware a few times every year.  The state is in dire need of jobs and infrastructure and the opioid crisis is a huge problem.  Any new industry should be welcomed with open arms, but their courts are not always friendly to new business.", "score": 6, "replies": []}, {"body": "wait....What?\n\nWTH is going on in Delaware?", "score": 6, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Ah ok. Thanks for the quick run down. I appreciate it", "score": 3, "replies": []}]}]}, {"body": "Not sure why this is and issue exactly.  I live here.  Tesla has their own store in the Christiana mall.  I really don't see the state overturning this.  Gas is cheap(sorta) compared to PA and NJ.  Someone who is smarter than me should look into how AMZN feels about Tesla.  I don't see the state wanting to upset them or big oil.  I could be completely wrong on this but it's just my observation.", "score": 3, "replies": []}, {"body": "Tesla is close to having enough current customers & new orders where the tipping point will change.  I dont think these laws will exist in 18 months.", "score": 2, "replies": [{"body": "Unfortunately, you over-estimate how fast governments typically move at fixing old laws and how strong car dealership lobbying power is. In TX, it's very likely they will have to ship my Cybertruck out of state before I can buy it. At least they will then be able to ship it back and I won't have to leave the state to pick it up.", "score": 3, "replies": [{"body": "I wonder if Tesla can argue that at a certain depth underground, it no longer is really Texas. Maybe deeper than any oil well will sound convincing? Then Tesla can just dig a huge pit and drop the trucks down the hole on big elastic bands every time an order is placed, bouncing out of state and back up. HMMMMM.", "score": 2, "replies": []}]}]}]}
{"title": "Steinbach: Construction of Tesla plant in the \"final spurt\"", "selftext": "", "id": "nrgreg", "created_utc": 1622735637.0, "score": 98, "upvote_ratio": 0.95, "num_comments": 16, "comments": [{"body": "This factory running at 1M/yr and $10k profit per vehicle will generate $10 EPS, or justify a couple hundred or more of the current $600 stock price.", "score": 21, "replies": [{"body": "It'll get there. Many are thinking 500k/yr with phase 1, growing to \\~2M/yr by phase 4 competition. That could be even higher if they're making some variant on the 'model 2' theory as it would be smaller and use less kwh vs the Model Y.", "score": 10, "replies": []}, {"body": "That could already be in the stock price.", "score": 0, "replies": [{"body": "yup,  very much is . . .", "score": 0, "replies": []}]}]}, {"body": "I wonder if the trials and tribulations that Tesla is facing building this plant in Germany is normal, or are they getting extra special attention because they are disrupting the German automotive industry? It just seems to be a really painful process to build there.", "score": 6, "replies": [{"body": "I think most of it is just normal German bureaucracy but I'd be there's a little automotive group paying to make sure that every tollgate is met with a slightly more critical eye than normal.", "score": 18, "replies": []}, {"body": "They really aren't facing much in delays.", "score": 12, "replies": []}, {"body": "It is normal there and it is amazing tesla has been able to move as fast as they have... just look at the airport in Brandenburg.  \n\n\nBerlin Brandenburg Airport finally received its operational license in May 2020, and opened for commercial traffic on 31 October 2020, 14 years after construction started and 29 years after official planning was launched.", "score": 10, "replies": [{"body": "Reunification? Accomplished within a year.\n\n“Hey ... moving the reunified capital to Berlin ... we should immediately get to building a new international airport!”\n\n30 years later...", "score": 2, "replies": []}]}, {"body": "Any large construction project in Europe would run into more than this tbh. I'd rather say that Tesla has been treated extra nice, in my impression", "score": 8, "replies": [{"body": "They didn't break the law directly but certainly paved the way so Tesla could go ahead as fast as possible within the existing rules.\n\nIf they really wanted to slow them down, not a single tree would have been cut by now.\n\nIt's pretty much expected for any large building project with some degree of publicity that a grass root intiative will be formed against it and that some organizations will sue. And if you ask me it makes sense to give the locals a chance to voice their legitimate concerns and make sure that laws and procedures are being followed. Germany is densely populated and conflicts need to be resolved\n\nThe issue is that increasingly you'll find organizations who campaign against certain classes of projects on principle. We'll need to find a way to speed up the process without loosing accountability", "score": 5, "replies": []}]}, {"body": "Regardless, the plant has gone up pretty fast.", "score": 4, "replies": []}, {"body": "From what I have read, this is Tesla getting **favorable** treatment in Germany. Ive read articles about companies taking a decade to clear all of the regulatory environmental and permitting hurdles to build a factory there. At least Tesla seems to have a ton of support from most of the higher up government officials.", "score": 2, "replies": []}]}, {"body": "💦 🍆 spurt", "score": 3, "replies": [{"body": "😮", "score": 2, "replies": [{"body": "Might not want your eyes and mouth open for this one. :(", "score": 2, "replies": []}]}]}]}
{"title": "Vote for Tesla to hire Rob already. Enough of this FUD.", "selftext": "", "id": "nrn525", "created_utc": 1622752117.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 16, "comments": [{"body": "I think that Tesla is far better served with Rob as a third party rather than an inside employee. Much easier to fight off the haters from a more neutral position. Just my opinion.", "score": 36, "replies": [{"body": "This.", "score": 10, "replies": []}, {"body": "I agree, but maybe a special channel to communicate with Rob if he has any questions would be nice :P", "score": 3, "replies": []}, {"body": "Nobody quotes him in “media” segments or articles… EVER.. it has to come from Tesla directly", "score": 2, "replies": []}]}, {"body": "I'd rather hear independent analysis from Rob than hear PR speak from Rob.", "score": 15, "replies": []}, {"body": "This has to be a joke.", "score": 11, "replies": []}, {"body": "What’s the role supposed to be? Seems like then he will have conflicts of interest reporting on Tesla.", "score": 8, "replies": []}, {"body": "Definitely not, and lol what's a change.org petition going to do? Better luck just tweeting Elon.", "score": 8, "replies": []}, {"body": "And what would you want him to do? Deny or confirm every rumor?", "score": 5, "replies": []}, {"body": "Is there a place to negative-sign the petition because that’s a fucking stupid idea, as outlined by every other comment", "score": 3, "replies": []}, {"body": "Stop this non sense, Rob is NOT Tesla’s unofficial Mouthpiece, and would instantly loose all the credibility he built the moment he’d would become that!", "score": 3, "replies": []}, {"body": "The damage the media is doing is significant without any response from Tesla… people don’t go looking for podcasts to learn the truth.. they take what’s in the headlines as truth… it’s just tarnishing Tesla’s reputation over and over again:.. at least if they had responses the narrative might include some of the real info.", "score": 2, "replies": []}, {"body": "Tesla better off commenting/releasing statements on twitter with their Tesla account imo.", "score": 1, "replies": []}, {"body": "This sub cant handle a few days of negative Stock prices ? WTF is actually wrong with you morons. \n\nThis sub has become a joke ... full of idiots expecting overnight returns", "score": 1, "replies": [{"body": "Hey I’ve been invested since 2013… but enough is enough… they need someone to respond to this crap they write on daily basis.", "score": 1, "replies": []}]}, {"body": "Love the sentiment, but I agree with the idea that Rob's voice needs to remain independent. Our part is support him through Patreon so he's more fairly compensated for the value he creates.", "score": 1, "replies": []}]}
{"title": "Just sold $TSLA IC, do u see anything with this?", "selftext": "no idea where TSLA will be. just thought risk/reward of 2.85/12.15 looks good to me.did i do anything wrong here?\n\n&#x200B;\n\nhttps://preview.redd.it/1ag32m6vi3371.png?width=634&format=png&auto=webp&s=f079a305ae1ab13b4c4104332831077e11d3b1c5\n\n&#x200B;\n\nhttps://preview.redd.it/4rzxhqsp35371.png?width=1074&format=png&auto=webp&s=71e0714bc789543ca18cb66cbbac1bf5e92ad1fa", "id": "nrkqbc", "created_utc": 1622745956.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 19, "comments": [{"body": "I would avoid TSLA especially if you're just starting out. One tweet from the memelord or a dip in crypto can send it violently in either direction.", "score": 3, "replies": [{"body": "Thanks!!", "score": 2, "replies": []}, {"body": "tesla is still very profitable if you have the capital and risk management to trade it. It was my most profitable trade this year!", "score": 1, "replies": []}]}, {"body": "Well the expected move is between 495 and 660 imo thats pretty tight selling 565 and 595.", "score": 2, "replies": [{"body": "your risk/reward looks much safer to me. Thanks", "score": 4, "replies": []}]}, {"body": "I woulda done the -500/485 put -655/670call for 5.90 right now", "score": 2, "replies": [{"body": "just sold it. hope this trade can cover my 1st one. Thanks!!!\n\n\n1 Contract TSLA Jul 16 2021 485 Put Net Credit at $5.87 (Day)\tFilled at $12.20\t\n1 Contract TSLA Jul 16 2021 500 Put Net Credit at $5.87 (Day)\tFilled at $15.05\t\n1 Contract TSLA Jul 16 2021 655 Call Net Credit at $5.87 (Day)\tFilled at $16.48\t\n1 Contract TSLA Jul 16 2021 670 Call Net Credit at $5.87 (Day)\tFilled at $13.46", "score": 2, "replies": [{"body": "For sure better chance for profit, as you see Tesla down about 30 it can move quick and large.", "score": 1, "replies": [{"body": "That's a decent trade", "score": 1, "replies": []}]}]}]}, {"body": "did you just sell a 15 wide spread for 12 in premium? that's not bad at all. \n\nyou're only risking 3 bucks, so just hold and see what happens. if your pop is anywhere above 20%, then technically you've got the edge over the counterpart.", "score": 2, "replies": [{"body": "yes, $3 risk for $12 reward. i will hold and see what happens. Thanks!!!", "score": 3, "replies": [{"body": "yeah, other \"option\" is to catch a good day closer to expiry and see if you can roll it out in time for some cash. As long as you keep making credits on the same strikes/widths, you eventually make enough credits to cover any potential losses and then it becomes a time/opportunity risk rather than a loss to your initial investment.", "score": 1, "replies": [{"body": "Thanks!!", "score": 1, "replies": []}]}]}]}, {"body": "What you did wrong is put on a trade that you didn’t fully understand. Did you bother to calculate the probabilities? Risk-reward is meaningless if not compared with probability of profit. Usually risking $3 to make $12 will result in a very low probability of success.", "score": 2, "replies": [{"body": "just checked POP and added it above. what do u think of it?", "score": 1, "replies": [{"body": "You need to find the probability of profit for the strategy overall. If you have thinkorswim you can use their analysis tab for this or optionsprofitcalculator.com will give you a PoP at expiration for the IC. After that look into probability of touch, that’s the key to success with non-directional spreads.", "score": 2, "replies": []}]}]}, {"body": "It's an IC, but because the short strikes are pretty close to the market, it will act a lot more like an iron fly.\n\nThat notwithstanding, swing analysis,  price action, and time cycles are indicating a relatively high probability of TSLA heading down to about 400, so not a trade that I would consider here. But that's me.", "score": 1, "replies": [{"body": "pretty noob here. this is my 2nd IC and I sold my 1st one yesterday.  \nif it goes below 550 or all the way to 400, what do u suggest to my iron fly?", "score": 1, "replies": [{"body": "I wouldn't make a suggestion, there's not much to do. Personally, I'd take it off and redeploy elsewhere.", "score": 1, "replies": []}]}]}]}
{"title": "Need help estimating option's price in the future", "selftext": "Hi. How can I **estimate** option's price based on Greeks and IV?\n\nFor example, here is a PUT option:\n\n* Symbol: BIIB\n* Type: PUT\n* Strike: $210\n* Price: $4.90\n* Expiration Date: 06/18/2021 (16DTE)\n* Delta: -0.1288\n* Gamma: +0.0031\n* Theta: -1.6173\n* Vega: +0.1189\n* Rho: -0.0174\n* Implied Volatility: 119.77%\n\nIs is possible to tell what will be the price in 5 days, if underlying price would fall 20% but also ImpVol would crash to 80%, all else equal.\n\nThanks for help!\n\n&#x200B;\n\nEDIT: Here's what I've got:\n\nCurrent BIIB price is $270\n\nIf stock price drops to $215, that's $55 drop, so looking at delta, it's: -55x-0.1288 =7.084. In other words, the premium will increase by $7.08\n\nIf ImpVol drops to 80%, that's 40% drop in ImpVol, so looking at Vega, 40x-0.1189=-4.756. In other words, the premium will decrease by -$4.76\n\nI totally have no idea how to treat theta, as it's so big, I'm not sure what to think of it. It's -1.6, that means it will decrease 1.6/day, which is $8 drop after 5 days (but the current premium is $4.9).\n\nIgnoring the theta, I've got 4.9+7.08-4.76=7.22. The price of the premium for this option will increase from 4.9 to 7.22 if ImpVol will drop to 80% and stock price will drop by 20%. Is this correct?\n\nAlso, what's up with the Theta?\n\nThanks for help again!", "id": "nrlgq0", "created_utc": 1622747831.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 11, "comments": [{"body": "Here's another calculator:\n\n[https://www.ivolatility.com/calc/?ticker=SPX](https://www.ivolatility.com/calc/?ticker=SPX)", "score": 2, "replies": [{"body": "I tried to open account, but they never send me confirmation email, ugh...", "score": 1, "replies": [{"body": "It's a free service so not sure why'd there would be a problem.  Sign up again and see if it works out.", "score": 1, "replies": []}]}]}, {"body": "https://www.optionsprofitcalculator.com/calculator/long-put.html\n\nFeed your expected implied volatility in manual entry options", "score": 1, "replies": [{"body": "That doesn't help me much (or I don't know how to use it), Look at my edited question.", "score": 1, "replies": [{"body": "The only thing you are forgetting is Greeks are alk dynamic, so the delta, Vega, theta values you used are valid for today and may not be same for tomorrow. You are treating them as static for next 5 days.\nThat's why you need to also have Second order Greeks for such complex calculations.\n\nAnyways here is the link. I have put in the inputs for you. Left hand of the chart is stock price, above are dates, right side % stock movements, input at 80% vol, 4.9 price.\n\nhttp://opcalc.com/vBG", "score": 1, "replies": [{"body": "I see, so this chart implies that the drop in stock price (and ImpVol) will happen today on Jun 3rd correct?", "score": 1, "replies": [{"body": "Not that. The chart is actually a probability matrix of independent values. It is not assuming price drop today. It is giving you the possible values for all possible prices for all given dates. So you can pick one value in the middle of the matrix that is most relevant for you.\n\nFor example, in your case, you can assume 215 as share price on say 8th of Jun, that gives you about 404 as the value in that matrix.\n\nSo if you bought the option at 4.9, then if the option price becomes 4.9+4.04= 8.94, assuming the volatility is 80 on that day (imp)\n\nEach price box is independent of other. The model is basically using black scholes model(BSM) repeatedly to calculate each of thee boxes. \n\nSo it is not giving you progress over each and every day but more like end state for each combination assuming an input imp vol probability for the BSM model for that day.\n\nIt is not perfect, but is still better than manual calculations without using dynamic nature of greeks and most of us here depend on this", "score": 1, "replies": []}]}]}]}]}, {"body": "In your delta calc you’re ignoring gamma. IV is not directly observable so it’s purely a guess. IV is often misunderstood, and not to be underestimated. It is only back calculated by the amount of B/A on a given strike / date; in other words in your calc, provide a theoretical RANGE of IV. Theta is going to be influenced by the DTE and current price, but it is greatest ATM. There’s plenty of suggestions already for an online calculator, but just giving you some pointers on your estimations.", "score": 1, "replies": []}, {"body": "Have you consulted your crystal ball?", "score": 1, "replies": [{"body": "Math is much better than crystal ball, trust me", "score": 1, "replies": []}]}]}
{"title": "$MSOS - AdvisorShares Pure US Cannabis ETF", "selftext": " \n\nFor many years, it was almost impossible to find an ETF that provides pure-play exposure to the U.S. cannabis sector. However, that changed when the [AdvisorShares Pure US Cannabis ETF](https://www.prnewswire.com/news-releases/advisorshares-launches-pure-us-cannabis-etf-ticker-msos-301122104.html) on September 2, 2020. The actively managed $MSOS became the first U.S.-listed ETF focused solely on American cannabis companies, including **multi-state operators** (MSOs), which differentiates itself from the other cannabis ETFs:\n\n* The ONLY U.S.-Listed ETF Available\n* Easy Access to U.S. Cannabis Exposure\n* Experience (assets are held by one of the largest U.S. custodial banks)\n* $1Billion AUM\n* Emerging Growth Opportunity\n\nMSOs are U.S. companies directly involved in the legal production and distribution of cannabis in states where approved. This ETF with its apt ticker seeks long-term capital appreciation by investing entirely in legal, domestic cannabis equity securities..\n\n&#x200B;\n\nhttps://preview.redd.it/1h7ju9n1qz271.png?width=529&format=png&auto=webp&s=a09190be326f0ff4ae74e06a53e35e5efe05861c\n\nIts objectives are to provide risk exposure to cannabis-themed North American securities\n\nIncreasingly trendsetting, especially with more relaxed [legislation possibly on the horizon](https://www.foxnews.com/politics/schumer-soon-introduce-marijuana-legalization-bill), this sector could swiftly gain renewed momentum, and [Amazon announcing their support for legalization](https://www.reddit.com/r/wallstreetbets/comments/nq8c5t/amazon_backs_federal_bill_to_legalize_marijuana/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) this week.\n\n*We firmly believe that the U.S. cannabis market provides a compelling long-term investment opportunity that clearly differentiates itself from other areas of the globe.* Dan Ahrens, AdvisorShares' chief operating officer and portfolio manager of MSOS\n\nOver the last few years cannabis companies had to prove to investors that they can be profitable and scalable. After Canadian cannabis companies generally failed to meet market expectations after the 2018 Canadian legalization, investors cast a dubious eye on the entire cannabis industry and generally penalized cannabis stocks in 2019. Even to date, many Canadian companies are still struggling to survive after billions of dollars were wasted on overbuilding greenhouses. However, U.S. MSOs have improved EBITDA margin with several generating >$500M annual revenue.\n\n**Global VS Domestic**\n\nWhen it comes to the markets that both these ETFs focus and invest in, MSOS only focuses on the U.S. cannabis market whereas similar ETFs focuses on the global cannabis market. When it comes to which one is a better choice, MSOS has an advantage over others because of the wave of legalization after the U.S. elections and the fact that regulatory approvals have yet to catch up with those from around the world. With many states having legalized cannabis in the U.S., MSOS has the potential to grow to incredible heights as U.S.-based cannabis companies will benefit a lot from the legalization and relaxation of rules and regulations.\n\nInvestors looking for an efficient way to gain exposure to the burgeoning U.S. cannabis sector should consider MSOS.\n\n[Bullish C&H - Just add volume](https://preview.redd.it/n8wbkc6xpz271.png?width=1621&format=png&auto=webp&s=3d6de2313a09a535e72ae7589d0f6081481208aa)\n\nBuy @ 41usd\n\n9/17/21 $50 C's @ 1.50\n\nStay safe & GLTA!\n\n*I am not a Financial Advisor, so please do your own DD. In my Opinion, most cannabis stocks are poised for significant growth following US legalization of cannabis; MSOs provide great exposure for this opportunity.*", "id": "nr685y", "created_utc": 1622699858.0, "score": 40, "upvote_ratio": 0.83, "num_comments": 18, "comments": [{"body": "I hold MSOS.  I like the fund.  :)", "score": 14, "replies": []}, {"body": "MSOS will rocket if the US is able to pass favorable legislation.", "score": 15, "replies": []}, {"body": "I like the etf", "score": 9, "replies": []}, {"body": "Or just wait til Cramer says not to buy it then jump in balls deep", "score": 8, "replies": [{"body": "Or just go for it now. Squeeze time!", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Do both. May need somewhere to park your BB gains. This for me is a long hold. I want in on us weed companies early. And this is one way to do it.", "score": 3, "replies": [{"body": "Can’t say name here but I’m looking at their largest holdings and mirroring my set up off this and some other speculative stuff. ‘Merica", "score": 3, "replies": []}]}]}, {"body": "Why not just buy tilray?", "score": 3, "replies": [{"body": "I have both. Not financial advice but I anticipate broader support/bias in future legislation for US based companies. And also they have a massive head start. Also right now MSO’s are playing with both hands tied behind their backs. Can’t uplist, can’t gain access to liquidity….hell have to take cash.", "score": 6, "replies": [{"body": "I agree with US legalization down the pipe line. Sounds like a good play.", "score": 5, "replies": []}]}]}, {"body": "So... did those options hurt?", "score": 1, "replies": [{"body": "Like a BB gun. ‘23s and ‘24s available now!", "score": 2, "replies": []}]}]}
{"title": "Amazon will no longer drug test for cannabis.", "selftext": "", "id": "nr9dyb", "created_utc": 1622712846.0, "score": 9, "upvote_ratio": 0.86, "num_comments": 11, "comments": [{"body": "Jokes on them I only buy cocaine with my gains", "score": 6, "replies": []}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Guess they're short of man power in some areas))) cannabis companies be like: TO THE MOON.\nNot a financial advice. If you make your financial  decisions based on some info from someone you don't even know drink your piss I guess.", "score": 2, "replies": []}, {"body": "Ban", "score": -1, "replies": [{"body": "Wha?", "score": 2, "replies": [{"body": "You didn’t have enough rocket emojis for these kids to understand your post on how this news might effect the company. 🔥🔥🔥🦺🧨🧨🧨🚀🚀🚀🚀🚀🚀🚀🚀🌛🌝🌝🌚", "score": 1, "replies": [{"body": "But I don't have rocket emojis😐", "score": 2, "replies": [{"body": "It’s that or moons. If you’re going to surprise on here you need to make sacrifices. 🌝", "score": 1, "replies": []}]}]}]}]}, {"body": "🙌🏽🔥🔥", "score": 1, "replies": []}, {"body": "Not sure how this is directly market moving?", "score": 1, "replies": [{"body": "Cronos  group [Cron](https://finance.yahoo.com/quote/CRON?p=CRON&.tsrc=fin-srch) up 8,7%.  \n\nCanopy [CGC](https://finance.yahoo.com/quote/CGC/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAMv1qE-VyhVumQHQU8TbOjev6aO3oPSDAC0buqs3wEfSeHnFKHLseAQsHUS4DMMnNZxFo35L356hrbKKM_ajUoXsPTk2B6mg5NaWwi44uxtoLrBoPuRTjtY6g5rX7N5KI2OefATWKQrhdYV3tzsD0bXV00hVR8ixyvADxCnAmsfP) up 5,3%.\nThat's just a few that comes to mind. And also I think it will have a huge impact in the long run. So that many other companies will lift this cannabis drug test as well.", "score": 1, "replies": []}]}]}
{"title": "Just a reminder they tried to fake out crash the market last time to get you to sell.", "selftext": "[removed]", "id": "nrddcb", "created_utc": 1622726473.0, "score": 95, "upvote_ratio": 0.98, "num_comments": 14, "comments": [{"body": "This guy fucks!", "score": 28, "replies": [{"body": "You fuck, too! We all fuck!", "score": 17, "replies": [{"body": "I’m sure as hell gonna fuck tonight!", "score": 1, "replies": []}]}]}, {"body": "BB babyboo 🚀🚀🚀🚀🚀 We can do it!!!!", "score": 13, "replies": []}, {"body": "Can’t wait for the opening and all of us morons grabbing more bananas 🍌", "score": 11, "replies": []}, {"body": "Eventually, these runs lose steam. Could be today or next week but it will happen. If you're sitting on massive gains, like more than you make in a year, cashing out is the smart thing to do.", "score": 2, "replies": []}, {"body": "Take my wife, and her boyfriends wallet", "score": 1, "replies": []}, {"body": "Yeah, no", "score": -9, "replies": []}, {"body": "Just threw 5k at BB. Now do something", "score": 1, "replies": []}]}
{"title": "I think that $SBUX is behind our recent success. I am long $SBUX... Here's why.", "selftext": "[deleted]", "id": "nrexev", "created_utc": 1622730792.0, "score": 5, "upvote_ratio": 0.54, "num_comments": 16, "comments": [{"body": "This is a shit 💩 post", "score": 14, "replies": []}, {"body": "The line at Starbucks grows longer each day....yes long ...", "score": 9, "replies": []}, {"body": "Overpriced garbage", "score": 18, "replies": []}, {"body": "Turned his conspiracy theory into dd lol", "score": 3, "replies": []}, {"body": "Trash 🗑", "score": 6, "replies": [{"body": "👆  this guy gets it.", "score": 5, "replies": []}]}, {"body": "Everybody *needs* caffeine.", "score": 3, "replies": []}, {"body": "F Starbucks. Trash politics interjected into their business model. No thanks", "score": 2, "replies": []}, {"body": "To good of a mouth on trash .... bot?", "score": 0, "replies": []}, {"body": "Many $SBUX partners are fed up.  I see a post pandemic service problem.  They work long and hard and most customers are asshats.  $SBUX pay is abysmal compared to what competitors are offering.  Plus Craft Coffee that is specifically NOT Starbucks is taking off in Urban Centers better than ever before.  Rural is Starbucks new growth but the margins aren’t as good.  I’m not a Starbucks investor anymore.", "score": 1, "replies": []}, {"body": "We will see a Rocket Frap in my lifetime.", "score": 1, "replies": []}]}
{"title": "Small $MSFT couldn’t help but take that beautiful entry!", "selftext": "", "id": "nrfl4j", "created_utc": 1622732543.0, "score": 25, "upvote_ratio": 0.77, "num_comments": 18, "comments": [{"body": "Position closed at avg sell price of $1.9, I’ll be looking for some more MSFT options. Defiantly buy anything below $245.", "score": 2, "replies": [{"body": "Got microsoftpenis Jun 4 $245 calls for $1.19.", "score": 1, "replies": [{"body": "Hey it’s this guy!", "score": 1, "replies": []}, {"body": "Well looks like you are up a bit. You followed. It’s up to you when to sell.", "score": 1, "replies": [{"body": "Yeah, last time microsoftpenis was down, and I jumped in, it erected and made me over 100% return.  Maybe it will do it again?", "score": 1, "replies": [{"body": "I strongly believe that it will go up or down. This isn’t financial advice but it should reverse today or tomorrow. I see it climbing back today and closing green. Tomorrow more job reports come out which can go either way.", "score": 2, "replies": [{"body": "Yeah, some economic reports tomorrow...  jobs, retail and gdp I think.  Microsoftpenis could end up in the gutter or stars or somewhere in between.", "score": 1, "replies": [{"body": "It’s either gutter or stars. All dependent on the reports, I sold everything but 600 $247.5c at an avg of $0.33 so let’s see.", "score": 1, "replies": [{"body": "Well, as long as jpow doesn't fuck it up tomorrow, I think we'll be ok.  Good luck to you, sir.", "score": 1, "replies": [{"body": "Good luck fellow ape.", "score": 1, "replies": []}, {"body": "Well looks like you are a winner again. Congratulations and fuck you.", "score": 1, "replies": [{"body": "Indeed!  You winning too, so congrats and fuck you too. :)\n\nI sold some at $3.92 to cover my cost basis.  I'll give it a little bit more time to see where the rest goes.", "score": 1, "replies": [{"body": "I sold straight off of the rip. I was holding $247.5 calls @ $.36 avg sold 400 for about $1.2 ish sold 200 around $1.8. Decent money made. See next time.", "score": 1, "replies": [{"body": "Yeah, I just sold the rest at $4.17.  Don't want to get too greedy and lose my ass.  Maybe I'll join you on your next yolo.  Gambling is fun.", "score": 1, "replies": [{"body": "Lol no, it’s not advice. Just happy yummy fellow ape made money.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Looks like it’s going to open around $247. Dont know if I’m selling right at open or waiting for the morning rip.", "score": 1, "replies": []}]}]}
{"title": "VET - Oil is back baby!", "selftext": "Now not all oil is for anal lube, but some is. From what I have seen lately, a lot of lube was used in late April and early May. Or at least it felt that way if you weren't long energy and banks.\n\nLet's talk about a greasy oil company. $VET this mofo was a Canadian junior bellwether that trades on the nasdaq. Saw highs 60$+ before the oil crash in 2016. It has euro natgas as well. It's last earnings beat the streets number to the upside by 10000%\n\nWith a running oil price and the likelihood we see 70$+ WTI by end of the month this could be your next big buy. This isn't a meme, so buy long dated calls. I just bought 120x 10c for July. ($0.23) I plan to buy more as we move.\n\nRemember this only takes one big sell side upgrade to get it running. JPM CITI etc. As oil is working, I expect the banks to start filling their positions and then putting out price targets.\n\nThe recent turmoil with Iran is ultra bullish, but even if Iran comes back online, this player is still making money.\n\nCheers.", "id": "nrhsew", "created_utc": 1622738322.0, "score": 6, "upvote_ratio": 0.6, "num_comments": 12, "comments": [{"body": "I wouldn’t touch oil with a 100 ft pole right now. You are about to see way more *hacks* by the WEF. \n\nGet ready.", "score": 8, "replies": [{"body": "This is the perfect sentiment to trade against, hated but man do you need it.", "score": 5, "replies": [{"body": "Much luck mate. The Biden administration will keep attacking oil.", "score": 4, "replies": [{"body": "Lol it’s the exact reason why oil is going to do so well. People think because Biden and the us is cutting oil production and moving away from it that it’s the death of oil. The death of fracking (why oil has been low for last few years) will keep taking oil higher as economies reopen and heat up.", "score": 6, "replies": [{"body": "Well in all honesty, I think the market will have a huge pull back soon. FED is trying to hide rates and inflation. \n\nOnce the rates are up, which they are headed that way, the market will tank.\n\nEdit: it’s also been dragged down for years now...", "score": 2, "replies": [{"body": "I agree, but people have to put their money somewhere. Industrials with good cash flow will be attractive. Just like with the dot com bubble it was more of a shift to value stocks. Obviously I don’t know what will happen but it seems like the market is shifting that way anyway.", "score": 1, "replies": []}]}]}, {"body": "If you think the administration is \"attacking oil\" by promoting new technologies I have a bridge I'd like to sell you.\n\nOil is going nowhere. We need it for way too much stuff, and not just transport. The white house knows that. But oil has geopolitical and environmental risk factors as well as the climate risk factors that cannot be ignored. Pushing those companies to cut back on CO2 emissions is not \"attacking oil\", it's kicking a complacent industry up the backside. Winners will be those like Petroteq who see that minimizing CO2 emissions and pollution while creating oil is the future.", "score": 1, "replies": []}]}]}]}, {"body": ">This isn't a meme, so buy long dated calls\n\n>10c for July\n\nAh yes, I love my \"long-dated\" 43DTE options", "score": 3, "replies": []}, {"body": "Iran isn’t even that big of a negative catalyst for oil, people seem to forget that China is bypassing the sanction and getting cheap oil directly from Iran. Will add nothing meaningful to the supply of oil. Shell hit peak oil, other large oil producers are being forced to decrease production. Oil/energy is one of the best plays for inflation. Been in XOM since oil turned negative, MRO since Jan.", "score": 3, "replies": []}, {"body": "$BB is the current move 🚀🚀🚀", "score": 5, "replies": [{"body": "This is for July. Cheap calls.", "score": 1, "replies": []}]}, {"body": "OXY 🛢🚀", "score": 1, "replies": []}]}
{"title": "Adding more to $MSFT YOLO", "selftext": "", "id": "nriril", "created_utc": 1622740837.0, "score": 8, "upvote_ratio": 0.58, "num_comments": 15, "comments": [{"body": "You really wanna lose 26k huh?", "score": 4, "replies": [{"body": "That’s what they said about my $GE calls... and my other $MSFT calls.", "score": 4, "replies": [{"body": "Betting 26k hoping it goes up $2? You belong here.", "score": 2, "replies": [{"body": "Check latest post. Betting $64k", "score": 2, "replies": []}]}]}]}, {"body": "Apes no buy boomer stocks. Buy MVIS. Good stonk", "score": 1, "replies": [{"body": "Apes buy anything to make green stuff that means more stonk", "score": 7, "replies": [{"body": "Oh shit. Ape have very smooth brain. Ooga booga. I buy MSFT", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "God damn! I sold at open today. You’re a mad man if you held.. but a rich mad man", "score": 1, "replies": [{"body": "Sold 400 at $1.2 and other 200 at $1.9. Not too mad but just mad enough.", "score": 3, "replies": []}]}]}
{"title": "Gold Rush 21’", "selftext": "I personally think a collective manifestation is a powerful one. And it explains other’s successes like Tesla, and digital currency. \n\n  Every logical synapse on the planet would say “it’ll never work” or “it’s not the time”. Until millions get on board and make it happen despite logic. \n\n  The stock market is an untouched frontier as far as change goes. And at the very least I will make a small contribution by participating in the idea. But I also know I’ll make some money. I’m under no delusion it’ll make me millions. Though, some people will get lucky. Unfortunately I think the whole point gets lost with those people. \n\n  Most will say it failed because “it dumped before people could sell for a profit”, or “it never went past $xxx.xx”... \n\n  While people like me will say “no, it actually worked. We controlled the outcome”.\n\n  But most importantly we all agreed on mutual success, at the expense of any large, protected, criminal entity willing to step in between US and OUR mutual decision. Instead of wasting that collective energy on something stupid, like ripping down statues, or slandering the latest/greatest puppet for no reason. Things like this SHOULD prove to all of us: \n\nThis is the power we have. \n\n  The people that are not in balance or control of their emotions will lose. But being unprepared for that opportunity doesn’t exclude them from other ones. There’s always more. Just learn from this one, and be ready for the next one. But don’t lie to yourself and others. Don’t perpetuate the perspective that it was a disaster, just because you failed to see the opportunity yourself.\n\nAs far as this one goes. I’ve already won, cleared & withdrew my investment plus 50% profit, and put the rest back on black! I’ve learned a lot already. And I’ll have some scars but regardless of what happens, I’ll have 0 regrets. \n\n-Here for the Experience, Not the Opinions", "id": "nro5ku", "created_utc": 1622754766.0, "score": 28, "upvote_ratio": 0.74, "num_comments": 12, "comments": [{"body": "Speechless. You are by far, THE most retarded of all the apes. Well said and papa bless.\n\n\"Ape together stronk\"\n- OP", "score": 11, "replies": []}, {"body": "☝️this guy👍", "score": 6, "replies": []}, {"body": "Retard ape lazy to read but understand ape strong together", "score": 4, "replies": []}, {"body": "I didn’t read the whole thing but yeah, I think that’s why it’s so hard to predict the market, because everyone’s got different preferences, and the state of the market is decided collectively by everyone, we just all have to be in alignment and agreement for something to happen. It’s not random, it’s the result of all our actions.", "score": 4, "replies": []}, {"body": "Very eloquent.", "score": 2, "replies": []}, {"body": "vas is all dis nonsense that you speak of?", "score": 2, "replies": []}, {"body": "Fuck Tesla ( actually, fuck Elon and that skeleton plow bag of his called a wife)", "score": 3, "replies": [{"body": "Which wife?  He's had about 8. Not currently married.", "score": 2, "replies": [{"body": "Sorry. Meant girlfriend (dude is almost 50 and still chasing young poon and having girlfriends?) \n\nMan has PP syndrome", "score": 5, "replies": [{"body": "No problem.  As to the gf, I'd bang her. Just wait a minute while I get my blue pills.", "score": 2, "replies": []}]}]}]}, {"body": "This is so deep it hit my cervix, and I am a dude. But now I know how it feels.", "score": 1, "replies": []}]}
{"title": "Amateur DD on American Airlines (AAL)", "selftext": "[removed]", "id": "nroq31", "created_utc": 1622756299.0, "score": 29, "upvote_ratio": 0.8, "num_comments": 15, "comments": [{"body": "you had me at amateur deep dicking on American...", "score": 13, "replies": []}, {"body": "I work in business travel. You are correct about business travel picking up in the second half of the year- although not to pre pandemic levels. Quarantines/vaccine requirements for international travel remain sticky too.  Our clients want to travel, business at high levels really isn’t done at its best via Zoom.\n\nUAL today announced they are investing in 15 supersonic jets to be flying by 2029, with an option for 35 more. I am looking at them too.", "score": 6, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 6, "replies": []}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**AAL**|**$26**|**BUY CALL**|**2021-06-18**|**$0.53**|**$24.93**|**17291**|**2390**\n|**AAL**|**$27**|**BUY CALL**|**2021-08-20**|**$1.57**|**$24.93**|**2140**|**134**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckphf9hdj66qh0773qrqoddhd) | [Track Record](https://www.pickmojo.com/user/Safeword_is_more/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 4, "replies": [{"body": "Bought AAL when it was under $10, going to hold for a long time", "score": 5, "replies": []}]}, {"body": "Good DD.  \nCouple notes based on my opinion:  Should have bought in earlier this year or ideally last year, cause the stock price is already back up and within a few dollars of pre-pandemic levels.  And as someone else mentioned, business travel will pick up but I doubt it will be back to pre-pandemic levels anytime soon (lots of companies saved a bunch of money without travel and I imagine some will be looking to keep unnecessary travel lower than prepandemic now that they've had a taste of the cost savings).", "score": 4, "replies": [{"body": "Everyone likes the efficiency and convenience of video conferencing.  It cost $0  time and money to set up.  In-person business meetings will be for special occasions and maybe corporate entertainment functions.  Who really wants to pack, get into the limo, go to a crappy airport, get into the crappy plane, get picked up, and travel an hour to a crappy hotel.", "score": 1, "replies": []}]}, {"body": "You r correct. Bought $ERJ and $SABR, airline n travel agent, months ago. Got TRIPLE digit returns n still holding!!!", "score": 2, "replies": []}]}
