{"title": "Theorycrafting a deep OTM VIX play, looking for criticism", "selftext": "Hey, I'm 22, I want to live comfortably but I don't buy into the whole work 5 out of 7 days a week for the rest of your life to retire with no achievements rhetoric, so I started dabbling in stocks last year. I haven't tried options before.\n\nPosting this to get criticised.\n\nDuring the pandemic crash, VIX rose from a 'baseline' of $14~ to a high of $85\n\nIt is of some people's opinion, and mine too, that we are due for another, bigger crash, as the pandemic crash was artificially postponed by injecting cash, and stocks quickly rose to pre-pandemic levels despite businesses still struggling\n\nIf I am understanding the option premiums correctly; \n\nhttps://finance.yahoo.com/quote/%5EVIX/options?date=1644969600\n\nA $40c with a maturity date of 16/02/2022 costs $2.03 per share, or $203. I chose so far back a date because A) You can't time a market crash lol and B) it is as far back as current options go.\n\nI chose a strike of $40 as it is far OTM so cheap, yet in the event of another crash VIX is likely to once again go far above $40.\n\nIf for example, the price goes to $80 again within the next 8 months, the contract will be worth $80 - $40 x 100 = $4,000.00 , for a $203 contract.\n\nAnyway, I'm posting this precisely because I want criticism, so feel free to tell me your thoughts on this play, and if you think I'm an idiot or not... as long as you explain WHY, thanks.\n\nEdit; Woops bad at maths, had to change payout from $40,000 to $4,000, I put an extra 0 haha", "id": "o1e3dv", "created_utc": 1623873968.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 13, "comments": [{"body": "I have three main issues with your analysis:\n\n1. VIX at 40 is very (very) high. It's likely won't gonna happen unless we see another panic, not a just a crash, but real panic. We haven't seen VIX over 50  pretty much since 2008. And only like 5 times above 40.\n2. VIX options don't track the spot VIX. They're priced based on the /VX futures. So for your contract to be ITM, you want the /VXG22 (the Feb expiration VIX futures) to jump to above 40. For reference, during the pandemic panic, the 9-months vix furfures were trading in the 30s, while VIX was above 80.\n3. &#x200B;\n\n>If for example, the price goes to $80 again within the next 8 months, the contract will be worth $80 - $40 x 100 = $40,000.00 , for a $203 contract.\n\nYou have an extra zero. ($80 - $40)x100 = $4,000. Not $40,000.\n\n&#x200B;\n\nOther than that, you're good. If we see a crash, you'll likely to make money. But not as much as you think. You just need to understand your exposure.", "score": 5, "replies": [{"body": "Hey, I really appreciate your response, this is the sort of stuff I was hoping for.\n\nYeah I appreciate VIX at $40 is crazy, and I know it sounds crazy, it's just something I believe could happen... a real serious crash, so that's what the call is based on.\n\nLike I said, new to options so gonna have to google a bit of what you said in 2. about the futures to figure out what you mean. Appreciate the homework so I can understand options better. Even if I don't really know what I'm doing right now, I feel like learning investing with stocks, options etc could be life changing if I figure it out at such a young age - I have so much time to fuck up and start over, getting better each time.\n\nOh and lmao at the extra 0 xD\n\nStill, $200 -> $4000 not bad.\n\nI just noticed too I can see 6x instances of it reaching $40 including and between 2008 and now on marketwatch advanced graphs. Funny idea but I wonder if regularly buying these deep OTM calls could be profitable through probability of it reaching $40 alone, as that shows it reaches $40 every 2 years on average. Maybe with c30$ or something since it only barely passes it sometimes.\n\nAnyway, thanks for giving fuel to my theorycrafting!", "score": 2, "replies": []}]}, {"body": "As Lotto tickets go this might work. The chart I’m looking at shows the VIX spiking over 40 three times in the last 30 years. I think the market has enough sense to not fight the FED given their recent displays of brute force but you might could be right. Who knows? A 20% correction seems reasonable as a worse case scenario but I’m skeptical it’ll get that far given all the liquidity sloshing around.", "score": 2, "replies": [{"body": "Defo a lotto ticket haha. I guess part of my reasoning is I'm making use of the fact that I'm so young so I can afford higher risk higher reward plays, and at the end of the day, it's not like I'm throwing away my retirement - I can just start again with my next paycheck, AND I retain everything I learned.\n\nI posted a similar thing to another comment - Could you clarify are you sure it's only hit $40 3 times in the last 30 years? I'm looking at marketwatch advanced graphs (Candlesticks not line, so it shows All Time High for the frequency too) and I can see 6 times it hit $40 since and including 2008?\n\nAnd I appreciate you taking my post seriously, I understand the premise is a bit out there.", "score": 1, "replies": []}]}, {"body": "It's very important to understand that VIX options do not work like a stock. There is no underlying to trade against and as such, there's not the same connection between spot (current) VIX and further dated like there is for stocks. With stock at $40 strike call, of the stock goes to $50, then every $40 strike call has $10 intrinsic (in addition to their extrinsic) no matter the calls expiration. This is because otherwise would be an arbitrage opportunity. Think of VIX. IOW VIX can spike 1 month from now, but your calls will barely be impacted.\n\nAnother way to look at it is that with leap calls on stock you are buying time for the stock to rise. With VIX leap, you are just saying you expect VIX to rise at some point in the future (near the expiration you chose).\n\nWhat I said isn't 100% accurate, but I think it helps to convey the reason why this strategy isn't like buying a leap on a volatile stock, waiting for a temporary rise, and then selling it. I've also seen a few people asking about this strategy lately, so hopefully this helps them understand why it won't behave like a leap on a stock.", "score": 2, "replies": []}, {"body": "I'm confused as to why you feel like we're posed for some sort of mega crash that will take us back to the stone age. The fed started to inject cash into the market because their was a lack of liquidity but that has been resolved. The QE has been reduced dramatically since the peak pandemic days. Overall yes, they are still very involved in the market especially with treasuries and mortgage backed securities, but any tapering of support is going to be forecasted and expected way in advance. Those words literally came out of JPow's mouth today. So you're not going to get a sudden shock in the market of withdrawn support from the Fed. \n\nThe reason stocks rose so quickly back to pre-pandemic levels was because everyone knew that the economy was going to reopen sooner than later, and in all honesty there was no where else to put your money. With the bond markets offering such low yields, the stock market was the only place to get a decent return (still is). That will balance itself out eventually but it's not going to cause anything that resembles a crash. \n\nTo get the results you're predicting you would need a systematic event that would suddenly and unexpectedly affect every sector in the market simultaneously. No hedge fund or pension fund is going to just wake up one morning and completely dump all their holdings for no reason, which is what would have to happen for a huge crash. \n\nIf you really wanted to go through with this, I would suggest doing $UVXY instead. Their options are cheaper, it's leveraged, and it will explode higher than the $VIX if a day of ultimate reckoning does in fact come.", "score": 2, "replies": []}, {"body": "You are missing one thing.  Do you HAVE, or do you anticipate having 40,000 dollars to buy the stock that you can then turn around and sell for 80,000 netting you the 40k profit?", "score": -2, "replies": [{"body": "No, that's why you sell the contract instead of excercising it? You don't have to buy the shares?", "score": 3, "replies": [{"body": "Sounds extremely risky to me.  That it will go up 40 dollars and you'll get that 40/share premium.", "score": -1, "replies": [{"body": "why would the premium go from $2 to $40?", "score": 1, "replies": [{"body": "If he buys the option when it's trading at 38 to 42 . . have the 213 premium.  Strike is 40, if the share price has gone up to 80, possible to have a 40 dollar per share premium close to expiration.", "score": 0, "replies": [{"body": "Not just possible but likely. This is how options work. In this scenario OP can always sell for the intrinsic value of the contract.", "score": 1, "replies": []}]}]}]}]}, {"body": "You don’t have to exercise calls that you buy 😂", "score": 1, "replies": []}]}]}
{"title": "Options Stock Ranker for Jun-16-2021", "selftext": "Hi, r/options! This is a stock ranker that looks at all stocks that have options. Clicking on the ticker links to a search for subreddit posts mentioning the ticker with News, DD, or Discussion Flairs. The post is updated once an hour.\n\n Last update: 16:15:00\n\n\n\n**Top 5 Stocks by % Increase -**  \n\n  \n| Ticker |  Price | Change | %Change | 52wk high |  \n| ------- | ---------- | ---------- | --------- | ---------: |  \n| [KIN](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/KIN) | 9.235 | 2.895 | +45.66% | 9.26 |\n| [AVXL](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AVXL) | 21.33 | 3.99 | +23.01% | 28.7 |\n| [GTT](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/GTT) | 2.455 | 0.405 | +19.76% | 8.55 |\n| [ALT](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/ALT) | 16.47 | 2.34 | +16.56% | 35.1 |\n| [FUV](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/FUV) | 14.84 | 2.08 | +16.3% | 36.8 |\n\n  \n**Lowest 5 Stocks by % Decrease -**  \n\n  \n| Ticker |  Price | Change | % Change | 52wk high |  \n| ------- | ---------- | ---------- | --------- | ---------: |  \n| [APRN](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/APRN) | 4.3 | -1.23 | -22.24% | 15 |\n| [TAL](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/TAL) | 24.015 | -4.835 | -16.76% | 90.96 |\n| FUSN | 8.3 | -1.34 | -13.9% | 19 |\n| [UXIN](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/UXIN) | 3.945 | -0.565 | -12.53% | 5.82 |\n| PRTK | 9.005 | -1.225 | -11.97% | 11.23 |\n\n\n  12 hour Reddit Rankings : \n\n  Ticker | Total Posts | DD | Discussion | News | Misc.\n------|-----|-----|------|-----|-----\n[GME](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/GME)|17 |6 |5 |0 |6\n[AMC](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AMC)|17 |10 |6 |1 |0\n[WISH](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/WISH)|16 |4 |6 |0 |6\n[DKNG](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/DKNG)|15 |4 |5 |1 |5\n[WKHS](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/WKHS)|13 |6 |2 |2 |3\n[CLOV](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/CLOV)|12 |6 |4 |0 |2\n[AAPL](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AAPL)|10 |5 |3 |1 |1\n[ITUB](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/ITUB)|9 |5 |1 |0 |3\n[TSLA](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/TSLA)|9 |6 |2 |1 |0\n[AAAU](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AAAU)|7 |6 |0 |0 |1\n\n\n 48 hour Reddit Rankings : \n\n  Ticker | Total Posts | DD | Discussion | News | Misc.\n------|-----|-----|------|-----|-----\n[WISH](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/WISH)|74 |16 |14 |2 |42\n[AMC](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AMC)|68 |25 |22 |5 |16\n[GME](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/GME)|56 |21 |16 |3 |16\n[DKNG](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/DKNG)|40 |6 |15 |5 |14\n[CLOV](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/CLOV)|36 |12 |10 |0 |14\n[CLNE](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/CLNE)|34 |11 |11 |2 |10\n[TSLA](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/TSLA)|29 |18 |4 |2 |5\n[WKHS](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/WKHS)|28 |9 |10 |2 |7\n[CLF](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/CLF)|24 |7 |9 |4 |4\n[RIDE](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/RIDE)|21 |9 |7 |1 |4", "id": "o1eayy", "created_utc": 1623874505.0, "score": 75, "upvote_ratio": 0.9, "num_comments": 12, "comments": [{"body": "what's the best trading platform that will allow me to trade options I'm trying to get away from Robinhood. think or swim wouldn't approve me for the lvl of options trading i wanted. any advice?", "score": 8, "replies": [{"body": "IBKR works great.", "score": 9, "replies": []}, {"body": "I'm surprised no one has mentioned tastytrade. I just started using it and it seems to be great so far. Anyone have a lot of experience with it?", "score": 6, "replies": []}, {"body": "on any brokerage, you will have to lie about your level of expertise to get what you want. My main is Chuck Schwab and i wanted to do long and short options but not have to cover. I told the truth on the app. and I can only play in options if i have the stock to back it. I opened a think or swim (TD) account and said i was a intermediate options trader and got what i wanted.", "score": 11, "replies": [{"body": "I did over estimate my experience, but think or swim wasn't messing with me. I want multiple leg options. I'll try Charles Schwab. Also it's there an options trading platform that allows me to trade options from within\n my IRA and/or buy crypto", "score": 3, "replies": [{"body": "Try Fidelity.  I trade options in 2 IRA accounts with Fidelity.  My wife’s and mine.  I also advise you to fib on the application.  The brokerages need to cover themselves legally so you need to “prove” yourself capable of being granted the options level you want.", "score": 3, "replies": []}, {"body": "I know CS will let you trade options in an IRA. But that means you would have to open a new IRA and move everything.", "score": 4, "replies": []}]}]}, {"body": "No broker will let you trade level 3 if you work at Wendy's.  Oh excuse me, behind Wendy's. So of course just lie and tell them you're the CEO of Retard International and you have 30+ years trading options.  Bink...you're in.", "score": 3, "replies": []}, {"body": "If you have sufficient capital to not be flagged as a pattern day trader, tastyworks is great. In fact just as a platform for analyzing strategies - even if you don't trade there - it's good. You even get a live feed of what people like tom sosnoff (spelling?) Etc are trading in real time.\n\nOther:\n- if you're in Europe, interactive brokers is great (you'll probably need to pay around 30 bucks per month for the relevant data subscriptions)\n- family member living in the US uses thinkorswim, but I can't personally comment on it", "score": 2, "replies": []}, {"body": "Webull - cash account", "score": 2, "replies": [{"body": "Same problem with webull", "score": 4, "replies": []}]}, {"body": "Rh. No assignment fees", "score": 1, "replies": []}]}]}
{"title": "Looking for resources on trading VIX options.", "selftext": "Anyone consistently profitable trading VIX options? I am usually a theta trader but my plays have run a little thin with lower volatility. I have been profitable trading VIX calls when I buy at a resistance and sell at a 10% gain. However, I know this will bite me sooner or later.(Works until it doesn't)\n\nI know trading VIX options is whole different ballgame. I'm just looking for some good references, videos, studies, etc. that made you profitable at trading them.", "id": "o1ieuo", "created_utc": 1623885333.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 13, "comments": [{"body": "Don’t do it", "score": 4, "replies": [{"body": "Hey original post, this is the only resource you need!", "score": 2, "replies": []}]}, {"body": "I've been fairly successful \"trading\" the $VIX. There really isn't much of a secret to it. Vol events are largely unforeseeable. I mean you can guess at whether or not a news event (like the fed meeting today) or reports (PMI/jobs report) is going to cause a spike in volatility but there is no way to know for sure. The only certainty there is when it comes to volatility, is that the nature of volatility is to mean revert and come back down from its highs. If you look at any graph that provides a visual representation of volatility whether it's a $VIX chart or just the historical volatility of a Meme stock you'll see a spike followed by a drop and return to the mean.\n\nSo I take advantage of this by shorting the $VIX on spikes that go 2-3 standard deviations outside of its mean. Few weeks/months back if the $VIX popped above $30 I would just sell naked calls to capture the inevitable drop in volatility. This trade has had a 100% success rate for me thus far, and if the expiration was coming up and the $VIX was still uncomfortably close to my strikes I could roll out the calls I sold knowing that eventually it'll drop back down.\n\nI know naked calls are high risk, so if you weren't comfortable with taking the risk you could do a call credit spread or put debit spread to cap your risk but it's going to dig pretty deep into your potential profit.\n\nDisclaimer: Yes I'm aware that if you were to have done this during the corona virus crash you would have lost your ass if you didn't cover fast enough. You should never ever sell naked calls on a position you can't quickly and actively manage.", "score": 3, "replies": [{"body": "Wouldn't it be safer to buy puts than sell naked calls?", "score": 2, "replies": [{"body": "Right?", "score": 1, "replies": [{"body": "I was legitimately asking. I've never bought a put before it just seems to make more sense in that scenario", "score": 1, "replies": [{"body": "Yeah I’m also interested in his answer…maybe buying VIX puts isn’t the way because IV is calculated off the VIX so puts would be more expensive when it is high and you don’t get the profit because a lower VIX means lower priced options?", "score": 1, "replies": []}]}]}, {"body": "The puts are usually priced to break even on the $VIX. Even if you do the put debit spread like I suggested Volatility may not drop past your short leg which would make it less profitable. So when $VIX would jump to $29 or $30 I would sell the $33C or $35C just because it's extremely unlikely it'll be sustained at those levels for an extended amount of time.", "score": 1, "replies": []}, {"body": "yes\n\npeople could argue that P vs C are priced \"correctly\" for Expected Value and yadda yadda yadda, but they're not priced for tail risks.  and tail risks is when you get blown the fuck up, which happens frequently for vol traders making uncapped-risk trades.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks I will look into this.", "score": 1, "replies": []}]}, {"body": "Watching!", "score": 1, "replies": []}, {"body": "Best method maybe buying weekly atm options", "score": 1, "replies": []}]}
{"title": "MAPS – WM Technologies (Weedmaps) A freshly squeezed DD", "selftext": "[deleted]", "id": "o162lm", "created_utc": 1623853396.0, "score": 20, "upvote_ratio": 0.86, "num_comments": 20, "comments": [{"body": "Bad time for retail today and equally bad time for cannabis. Could be a good time to buy the dip if you’re going long term on this", "score": 4, "replies": [{"body": "Agreed. Any mistakes with the Fed chair speech could swoon the whole market.", "score": 3, "replies": []}]}, {"body": "Strong team and strong company in a rapidly growing market. Can't wait to see where this goes!", "score": 3, "replies": []}, {"body": "Nice DD. My only problem with them is they are a SPAC. SPAC is no bueno.", "score": 2, "replies": [{"body": "Why are SPACs no good in your opinion?", "score": 1, "replies": [{"body": "In my humble opinion, they are just set up to make the accusation parter money. If they were good \nenough to list on their own business fundamentals they would. “Reports” say that a SPAC could bottom out to a $2 share price and the accusation partner could still make money. If weed maps could list on their own business fundamentals I would buy right in as they are popular and very useful in my opinion. SPAC’s are a big time speculative gamble. I like to generate not speculate.", "score": 1, "replies": [{"body": "Good thing Weedmaps isn’t a SPAC. SSPK was. Weedmaps isn’t. Weedmaps certainly could have listed on their own, they chose not to because they decided they wanted to do a SPAC. They know what they are doing, they’ve been a profitable business for over 10 years. \n\nAt this point integrating SPACs as a conditionary precaution to whether or not this is an investment worthy of “generating” is irrelevant because it already de-spaced. Seemed rather successful as well I must say.", "score": 2, "replies": [{"body": "I personally don’t want to invest in a company that goes SPAC to enter the market. It have proven shady for most companies that have gone that route thus far. Good luck on your hunt.", "score": 1, "replies": []}]}]}]}, {"body": "Nice dd.  Mine own only problem with those folk is they art a spac.  Spac is nay bueno\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`", "score": 1, "replies": []}, {"body": "Not anymore", "score": 1, "replies": []}]}, {"body": "🥦🚀", "score": 1, "replies": []}, {"body": "This is B.S; Weedmaps delisted", "score": 1, "replies": [{"body": "Sure bout that?", "score": 1, "replies": []}]}, {"body": "Hmmmm; it is strange they would merge and then delist; it's rare for a company to return after delisting even if it was there decision; they normally list on OTC or go private but if you are right??????", "score": 1, "replies": [{"body": "What are YOU smoking?! Neither SSPK or Weedmaps delisted. Ever. MAPS is newly listed on the NASDAQ as of two days ago. Weedmaps is very much public and listed. Go search MAPS on any brokerage you’ll see it. \n\nSo your either trolling or really out of touch", "score": 1, "replies": []}]}, {"body": "I went to purchase 150 shares on webull at 9.98 because I read your article and did research; I had to wait until 4AM to make the purchase because the market was closed , but when I attempted to make the purchase the site stated the stock was delisted. I have a pic as proof. I attempted several times; after reading your message as of 3:33 PM I went to the website to try again; it now list it as MAPS instead of MAPSW, they posted a board message stating SSPK performed a ticker change on 16 June. WEBULL delay resulted in my message and lost of a small profit. I did not like the insult but I do owe you an apology.  I sincerely apologize and I need to rethink my future utilization of WEBULL.", "score": 1, "replies": [{"body": "Ok so MAPSW is for warrants chief. SSPK is done. Gone. no more. That’s because SSPK waS the staging ticker for the eventual change to MAPS. Not all brokerages are equal. I’m not a user of Webull but it sounds like from what you are saying Webull is still processing the ticker change. Give it time. If you had purchases of MAPS your value and cost basis should be reflected properly once Webull finalized the change. Keep in mind using Webull and Robinhood and M1Finance, you are simply using their app. Most of your holdings and details pertaining to them are actually through Apex Clearing. You can contact Webull and request clearing house documentation and login if you wish to see the real inner workings of your account.", "score": 1, "replies": []}]}, {"body": "Sincerely thank you.", "score": 1, "replies": []}, {"body": "Very great post. Thank you", "score": 1, "replies": []}]}
{"title": "My Watchlist For 6/16/2021 -- Some Real Snacks Here", "selftext": "$AAL  - Fundamentally checks out right, but also an amazing support area and great trend up. What an absolute beauty.\n\n&#x200B;\n\n&#x200B;\n\n$CX   - Called 2 weeks ago for 15%, can we do it again? Now just a better deal and more potential up, love this channel up and support.\n\n&#x200B;\n\n&#x200B;\n\n$FLR  - amazing trend up that has found value right at the POC - great support. Massive potential and volatility, love it.\n\n&#x200B;\n\n&#x200B;\n\n$IRWD - I can see this dropping to $10 and if it does - even better deal right? Great trend up, I love the value and low risk play here.\n\n&#x200B;\n\n&#x200B;\n\n$MCFT - amazing support play, super simple. A monkey could see the value and risk v reward, gorgeous.\n\n&#x200B;\n\n&#x200B;\n\n$TTMI - Little less volatility so good for beginners to watch. I want this coiling sideways to lead to a big move.\n\n&#x200B;\n\n&#x200B;\n\n$VIRT - Clear higher lows and unclear trend, but clear support area. Love this kind of triangle.\n\n&#x200B;\n\n&#x200B;\n\n$WH   - Another less volatile one, but again fundamentally it makes sense, right in value - plenty of support - great stuff.\n\n&#x200B;\n\n&#x200B;\n\n$ZIM  - I love Invader ZIM, and now we have this gift. Right where we want it, super easy to read - beautiful.", "id": "o0tg3i", "created_utc": 1623806470.0, "score": 6, "upvote_ratio": 0.69, "num_comments": 12, "comments": [{"body": "What's your entry signal for these stocks?", "score": 5, "replies": [{"body": "I have 180 characters. \n\nWatch my YouTube for that or my page I don’t have the time to write it out my goal isn’t to be follower move for move these are just what I’m watching.", "score": -7, "replies": [{"body": "Yeah I don't have time or interest to watch some random person's YouTube channel. I thought this post was leading to a discussion, but looking at your post history I guess you are trying to sell services. No thank you.", "score": 3, "replies": [{"body": "I think this is uncalled for? Nobody owes you a living, if you do not have time to explore then probably you are better off sticking to yourself ?", "score": 3, "replies": []}, {"body": "It's worth checking this post and doing some quick DD on each to see if you're interested in doing more. A lot of these are short term plays but I've made some money off this dude and never subscribed or even talked to him.  I dont always agree with him, I dont like the Aal play personally but I'm interested enough in zim to look into it more before open tomorrow.", "score": 2, "replies": [{"body": "Thanks. I'm always leery of this type of post (watch my YouTube!) and can't help but be skeptical. I actually own ZIM already, it's a great stock. I was eyeing some of the bounce plays- AAL (one that he mentioned), as well as FCX, AA, F.", "score": 2, "replies": [{"body": "I am too that's why I mentioned something.  Hes genuinely helping just if you dont want to do your own DD I guess the services are worth it, idk I just do DD myself, usually if you're not interested at all you can tell very quickly so it's not a huge time sink.", "score": 1, "replies": []}]}]}, {"body": "No not really. Also if you checked my history you’d see where I can post photos - I have them on the chart. \n\nI’d be happy to discuss but thought you were being aggressive.", "score": 1, "replies": [{"body": "Aggressive? Without any further mention of how you enter these stocks, you leave it open-ended. It's a tactic that \"gurus\" use. When one of these stocks take off, you'll reference it in your next post, \"I called that last week\". As anyone can see here, you clearly aren't calling anything. Just cute notes next to volatile tickers.\n\nAnd for the record, I would never blindly follow anyone's entry. I do my own research and have my own methods. But I am always interested in hearing the thought process behind an entry or exit. I suspect you don't have much of a process other than calling out tickers.", "score": 4, "replies": [{"body": "Bro I’m drunk playing chivalry 2 idk what to tell you. I love you I’m sorry xoxo", "score": -1, "replies": []}]}]}]}]}]}, {"body": "Holding on to this stock for a year now. It's due for some big upside.", "score": 1, "replies": []}]}
{"title": "Nvidia split", "selftext": "This probably was posted here. Just wanted everyone’s thoughts on Nvidia’s split. Would you buy it at the 700 price? I have 4 shares of apple and 5 shares of Tesla. Would you sell any of those to buy Nvidia? Just looking for opinions.", "id": "o0tqtd", "created_utc": 1623807509.0, "score": 4, "upvote_ratio": 0.67, "num_comments": 16, "comments": [{"body": "I will buy a few shares a few days after the split if it hits like 150ish.", "score": 4, "replies": []}, {"body": "Cramer favorite. Stock is a horse. Split doesn’t change that", "score": 4, "replies": []}, {"body": "You got a thing for stocks that split recently huh", "score": 3, "replies": []}, {"body": "My take: there will be a sell-off after the split. Its too late to buy in at $700, but it could get pushed up depending on news from the feds. There is a quadruple dividend payout of $2.56/share bought between now and June 21st that will be payed July 1st. So if you really want that $2.56 then buy.", "score": 4, "replies": [{"body": "The Fed doesn't make their high demand product.. that's irrelevant to some issues, like NVDA.  The dividend would be divided by 4.   It doesn't matter... You'd still get the same % of the company.", "score": -1, "replies": []}]}, {"body": "***It doesn't matter***\n\nYou'll still have 1/ 1,000,000,000 of the company.", "score": 3, "replies": []}, {"body": "I'll be buying some when they split. It's a great stock.", "score": 2, "replies": []}, {"body": "Some brokers offer fractional shares so stock splits aren't really going to affect much for them. Stock splits will affect option buyers mainly, IMO.", "score": 2, "replies": []}, {"body": "🙄", "score": 2, "replies": []}, {"body": "Doesn't matter when you buy it.", "score": 1, "replies": [{"body": "Kinda does. I haven't been following NVIDIA but splits generally happen to generate renewed interest. It probably is already too late for someone to cash in on this renewed interest but there are short term plays that could be made when a stock split is announced both pre and post split. Shouldn't matter if you're holding long-term, of course.", "score": 3, "replies": [{"body": "Meant for long term interest, sorry for being so frank lol. Nvidia is a good buy, but I'd keep cash on the sides to buy dips. This inflation/rising interest theme will present better buying opportunities.", "score": 1, "replies": []}]}]}, {"body": "Will the price go up or down after the split?", "score": 0, "replies": [{"body": "Down.  I'd guess it runs up a bit between now and split, like Tesla did.", "score": 1, "replies": []}]}]}
{"title": "Is my portfolio safe or risky?", "selftext": "28yo here - working fulltime and living at home with parents\n\nI put 100% of my savings into stocks/funds for longterm\n\nThis is my split, do you think this is safe or risky?\n\n10% AMD,\n10% NVidia\n\n20% JPM China funds,\n20% JPM US tech funds\n\n20% nordic small/middlesize corp funds,\n20% new technology nordic funds\n\n\nMarket overview:\n40% into us tech companies,\n20% china funds,\n40% nordic funds\n\nI have no time for minmaxing/daytrading. The plan is just to put my savings into here and wait +2-20 years for the profits\n\nAll these funds I picked are also very popular funds in either Worldwide or Sweden where im from and have had very good ROI the last 1/3/5 years, topping the fund lists.", "id": "o0zph4", "created_utc": 1623830571.0, "score": 7, "upvote_ratio": 0.89, "num_comments": 18, "comments": [{"body": "You have a lot of tech if rates increase that will hurt you.", "score": 14, "replies": [{"body": "he said he's waiting 2-20 years..so rates do not matter", "score": 7, "replies": []}, {"body": "How was tech doing two years ago when rates were higher?", "score": 1, "replies": [{"body": "Nvidia was worth 145. its 712 now.", "score": 1, "replies": [{"body": "Look at QQQ, it did just fine in a higher rate environment (relatively speaking). That's my point I was trying to get across.", "score": 1, "replies": []}]}]}]}, {"body": "100%savings to stock ? That’s a bit risky and less flexible if you need money . Just my 2cent", "score": 6, "replies": [{"body": "I guess its because I live at home with stable economical parents that could always lend me during emergency. \n\nIf this was not the case I would probably do 75-80% savings spent instead.", "score": 13, "replies": []}]}, {"body": "Its not safe, Its not risky. 20% in AMD and Nvidida seems a litte lumpy. I would diversifiy more in big Tech. Also 20% China and 40% North Europe seems not diversified at all. What about Rest of Europe, US besides Tech, Rest of Asia. You completely miss that. Greetings from Germany 👋🏼", "score": 3, "replies": [{"body": "Im from south europe (Portugal). Just stopped to say HI", "score": 2, "replies": [{"body": "🥰👋🏼", "score": 1, "replies": []}]}, {"body": "Hi,\n\nI think its because those are the three different geographical markets I personally believe most in. Us, nordic and china.", "score": 1, "replies": []}]}, {"body": "IMO Tech is super risky due to inflation, but thats just my opinion", "score": 2, "replies": [{"body": "Super risky? Inflation Isn’t gonna last forever champ", "score": 1, "replies": []}]}, {"body": "My opinion is that your portfolio is well diversified. Your portfolio is not risky or safe, it’s somewhere between the middle which is great. I expect your portfolio to do good in the future. Perhaps 15% ROI each year. (Biggest return will be from JPM US and China funds)", "score": -2, "replies": [{"body": "What is the ROI of 15% based on? And no it is not well diversified, as it is not exposed to Europe, to non-tech industries in the US, emerging markets, other developed markets, real estate… you get the point. Also 20% of a portfolio in 2 stocks is too concentrated in my opinion.", "score": 5, "replies": [{"body": "That’s right. Each to their own opinion. For me an annual ROI of 15% is nothing. I make or lose that every week on on crypto.\n\nIn addition my stock investment is all based on risky companies like $SPCE, $PLTR, $NET and space SPACS $VACQ & $SRAC. Nothing else, I believe they will do well in the future and that’s why I keep them. I don’t care if they drop in the short term.\n\nA portfolio diversified in various stocks like OP will do well. $AMD and Nvidia have a large market cap and they’ve been proven to have reliable products. I personally wouldn’t choose those stocks but I see it as a safe investment compared to me. However, if it were me I would swap AMD for $NET, because AMD volume has been relatively low for months and it hasn’t had impressive earnings for a while", "score": -8, "replies": []}]}]}, {"body": "Maybe you should focus a little more in dividends? AT&T for example, pays a little more than 7% of yields", "score": 0, "replies": []}]}
{"title": "Nvidia call options pre split", "selftext": "Hello .\nI was thinking about buying 4 nvidia call options before the split.\nA strike point of 250 with an expiration date of 6 19 2022 \nWould this work,and how much would this cost ?just a ball park guess will do\nWould the options split into 20 options?and would the strike stay the same?I really think this stock is going to go up in the next year and I want to see  some proper gains😀\nI have no experience with this part of the stock market..\nAny feedback will be appreciated. Thanks for your time.", "id": "o109hd", "created_utc": 1623833159.0, "score": 11, "upvote_ratio": 0.84, "num_comments": 10, "comments": [{"body": "Be careful although companies do tend to go up after splits there's no reason for them to go up or down as the is no value added\n\nGood luck it could work", "score": 9, "replies": [{"body": "So if it goes down.\nI just lose  whatever the contracts cost me ?", "score": 3, "replies": [{"body": "yeah if you are buying call options you lose whatever you paid.\n\n&#x200B;\n\nYou are technically buying a LEAP (which refers to an option with more than 6 months till expiry). Keep in mind that this option strike will also be modified after split. if you buy 4, you will then have 12 (3:1 split).  \n\n\nThe last price I see for the 250 strike for Jun 22 is (425.57) which is $42557 per contract.  \n\n\nI would suggest you head over to r/options and learn more before spending $166k on NVDA options.", "score": 6, "replies": [{"body": "Thanks alot..i will check it out..i def have alot to learn ..\nIs the option price that high because of the LEAP?\nthanks again..hope all is well with u and your family 🙂", "score": 1, "replies": [{"body": "Uh it's really complicated >.>  \n\n\nIt's currently trading at 720, so you're paying for the \"intrinsic value\". The other component is the extrinsic value which is basically \"time\".  \n\n\nThe price i grabbed was from a few days ago it wouldn't surprise me if its closer to $500 when the market opens.  \n\n\nGL on deep diving options! They're a great tool :)", "score": 3, "replies": []}]}]}, {"body": "I don't do options can someone in the know reply to this if I'm wrong \n\nBut yes if it go's down your contact will expire worthless unless you can sell it on at a smaller loss halfway through the contract. \n\nYou best plan is to go for 2023 contracts and hold it but if you are playing with small money on a week or month contract you can get burnt fast.\n\nThe likelihood is that it will go up after the split as the news of the split should get the hype going also the fomo \n\nHow long it go's up for is anyone's guess before it go back to the normal price that could be a few hours days weeks or it could keep going up for years\n\nIf I was you I would buy  Corsair gaming 2023 option calls that's going to $100 fast", "score": 2, "replies": [{"body": "Thanks for replying.🙂..i will check out the 2023 contracts and corsair gaming.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I bought 19 shares.😀\nJust thought I  would get my feet wet in the options market.\n1 call option with a 1k strike point pre split with an exp date of 2023.\nAs long as the contract is not over 1000$.\nI would have to sell it b4 the exp date cause I don't have the dollars to actually exercise it.i b wonder what the contracts would be worth if the strike was 250 and the stock price was 125$ in the money", "score": 1, "replies": []}]}, {"body": "The options will auto split proportionally with the stock. 5:1 stock split means your options will also split 5:1. $100C becomes 5x $20Calls", "score": 3, "replies": []}]}
{"title": "Are FAANMG Growth or Value stocks?", "selftext": "I’ve been hearing a lot about switching from growth to value stocks in light of expectations about shifts in the economy, interest rates, inflation, etc.\n\nI’m heavily into AAPL, GOOG, AMZN and FB roughly in that order. Are these stocks growth or value stocks? If theyre growth, should I be reallocating? Into what?", "id": "o19czr", "created_utc": 1623862176.0, "score": 5, "upvote_ratio": 0.65, "num_comments": 13, "comments": [{"body": "They are neither.\n\nCompanies in that stage would typically be considered GARP (Growth at a reasonable price). This is because although they have high growth you should also be able to get a reasonable confident valuation.", "score": 14, "replies": []}, {"body": "I think Cramer has a good name for them: Senior growth stocks.", "score": 6, "replies": []}, {"body": "Growth.", "score": 2, "replies": []}, {"body": "Both at this point.", "score": 2, "replies": []}, {"body": "All fangams will sell off 80% now because of FED meeting today.", "score": -5, "replies": [{"body": "Sell to me", "score": 3, "replies": [{"body": "Msft GOOGL AAPL or amzn?  They make up 36% of my portfolio.", "score": 2, "replies": [{"body": "#ALL", "score": 1, "replies": [{"body": "Cool.", "score": 1, "replies": []}]}]}]}, {"body": "Big swing and a miss...nice try though", "score": 1, "replies": [{"body": "😆", "score": 1, "replies": []}]}]}, {"body": "What difference does it make? What’s the point in buying a “growth stock” if you just sell it before it has time to grow because you’re scared of whatever they’re shouting about on CNBC? If and when you buy a stock you should have some sort of entry and exit plan and you should have an idea of your expectations for the underlying business. You should have a reasonable understanding of the underlying business. Then, when Cramer starts shouting about “rotating into x because of y factors in the economy” you can think: “okay so there’s going to be high inflation/interest rates/etc is this going to affect this business and in what way? Is this going to affect the long term potential of this business or only short term” etc etc. If you feel like you can’t win with stocks because you buy and sell them every few months because of all the headlines then just put your money into a mutual fund/index fund and leave it be and enjoy your free time rather than stressing over whether or not the fed raising interest rates by .5% is going to make your Google stock drop by 1% in a day.", "score": 1, "replies": []}]}
{"title": "Lake DD: Covid-19 PPE winner with too much long term upside to ignore, despite market volatility", "selftext": "LAKE is a stock that caught my attention during the pandemic and slowly (and then less slowly when the bubble happened) became one of my largest positions. Even in the short term, the global pandemic is far from over and LAKE is well divested internationally. PPE in other industries than healthcare longer term I believe will benefit from the need for global warming relief, a lot of emergency servicemen are needed, they all have various PPE for their line of work. This is not just masks (also it is a big part of it)\n\nThis stock dropped off massively, most likely inexperienced investors taking gains thinking the ride is over, but overlooking the long-term advantages this company has could be a mistake.\n\nPros:\n\nMicrocap of 170M, has 53M in cash: I don't feel like calculating how much value this is per share this time, but run the numbers if you want. If they give some of this money back via a 1 time dividend, people will buy back into the stock and it will recover in the short term too.\n\nFuture-Proof Defensive stock: Great hedge against climate change caused economic fallout long-term, as well as future pandemic proofing, which is obviously in demand in the healthcare industry now.\n\nInternational Investment/Opportunities: With the pandemic coming to an end in the US, Lake will look to foreign markets to foster growth opportunities abroad. In the long term, this can help them gain exposure to international markets after the pandemic is over, which will mean the next pandemic, LAKE products will be EVERYWHERE. If it happens anyway.\n\nCons:\n\nshort term volatility investment: This stock likely will be overlooked a long time before its not. Keep that in mind. That is all. But right now, this is a risk for some, because this is a stock that has become much more volatile lately than it historically has. If your aware of current market sentiment, you are likely already pricing this in, but there is some short term risk right now\n\nPotential VERY long term: Be prepared to wait over a decade potentially for the investment to pay off. Eventually another pandemic will probably happen or another disaster that will require insane PPE demand. If you buy, hold for the very long or stay very active on the news of this stock.", "id": "o1g5un", "created_utc": 1623879238.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 11, "comments": [{"body": "Look, man. LAKE is over until it corrects unless you really want to hold it through the dark days ahead. It pumped on the pandemic, but that's over.\n\nTheir EPS pumped like 1000% for 2021. That shit is not real or sustainable. FY 2022 is going to drop intermediate between FY 2020 and 2021 (probably by half), and FY2023 is going to drop to the regular historical uptrend from 2017-2020.  Forward PE is twice ttm PE.\n\nI made money a couple of times swing-trading LAKE.  Right now is absolutely not the time to jump on that roller-coaster.\n\nThey make PPE.  PPE demand is going to drop like a stone back to the historical trend, and so is LAKE's price.", "score": 3, "replies": [{"body": "If even one more global pandemic happens, it could be a fortune making stock. No guarantee it will happen, but there is genuine upside in that alone. \n\nDefensive growth stocks seem like a contradiction, but I am building a future proof side portfolio, and am looking into stocks like this", "score": 2, "replies": [{"body": "Wait until the next respiratory pandemic happens. It's over, for now. If you didn't swing-trade it already, you missed the boat. If you're holding a bag on it, that's it: you're holding a bag praying for another global pandemic that probably isn't going to happen for another decade.", "score": 2, "replies": [{"body": "The moment a lockdown happens again somewhere in the US the stock will already be too overpriced to buy in", "score": 2, "replies": []}]}]}]}, {"body": "Ten year investments ought to be based on talent in leadership, not sector, imo.", "score": 2, "replies": [{"body": "My fundamental analysis was driven from perspectives of global disaster-proofing (not just medical) in the future being extremely important to prevent this from happening. There will be a huge demand for PPE in the years of global warming as well. A hedge of multiple varieties.", "score": 3, "replies": []}]}, {"body": "We have been trading it on my team\nUnfortunately I have shares at 22.75 and 24\nThe earnings report was very good...just have to wait it out", "score": 2, "replies": [{"body": " I wish I had less money tied up right now to chase stocks like this, but at least its such a large position in my portfolio anyway", "score": 1, "replies": []}]}, {"body": "I like it. Buying some tomorrow. Just told a guy not to buy trends but buy undervalued stocks. This looks undervalued. If revenue decreased by half this would still be a good buy at this price.", "score": 2, "replies": [{"body": "Also like it right now as a hedge against the Delta variant", "score": 1, "replies": []}]}]}
{"title": "Someone that understand market data explain something to me please", "selftext": "Okay, I need folks with big brains to educate me on something. JPOW says the reason CPI isn’t an issue is because used cars are inflating the numbers and when I look into it it’s sitting at 29.7% but I also noticed that energy is at 28.5% and gasoline is at 56.2%. I feel like I’m being lied to and the concerns is being downplayed. \n\nhttps://www.bls.gov/opub/ted/2021/mobile/consumer-prices-increase-5-0-percent-for-the-year-ended-may-2021.htm", "id": "o1j37r", "created_utc": 1623887355.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 10, "comments": [{"body": "Used to be a political economist. Some context:\n\nEnergy and Gasoline aren't used in inflation indicators because their prices are highly volatile and influenced by cyclical market activity. Also very subject to international cartel negotiations - remember, oil absolutely plummeted last year because of OPEC+ talks stalling and the crash in demand from COVID hitting at the same time. There are also seasonality issues across all energy markets.\n\nUsed cars also regularly spike when low income people start being rehired after a recession. Need a car to get to work in the US, so a resurgent in those prices isnt a shock and will stabilize quickly. Oil/energy being by similar amounts suggests that's just a cyclical demand spike. \n\nThe bigger story has been construction materials, but that also appears to be short-term supply disruptions and speculative activity. Lumber prices coming back down to earth, per bloomberg. Which makes sense given the demand spike from people being at home doing projects, and low mortgage rates/shifting population from remote work. \n\nBasically, this will be a year of hiccups in the data. But  it's not a multi-year concern because of the recession and size of COVID economic displacement. Fed is taking a wait and see approach for that reason.", "score": 15, "replies": [{"body": "This was helpful. Thank you!", "score": 3, "replies": [{"body": "Happy to help.", "score": 2, "replies": []}, {"body": "This is an excellent reply, don’t believe the conspiracy theorists that reply here or elsewhere you posted the same question.  There is not a vast Fed conspiracy.", "score": 2, "replies": []}]}, {"body": "Nice post, thanks! I watched a video that discusses the 2008 transitory inflation and it seems this will be similar", "score": 2, "replies": [{"body": "Yep. Super common after recessions. People always forget the inflation is coming off a depressed economic activity base case. \n\nThis one might be a bit weirder due to the stay-at-home element and supply chain issues from workplace restrictions", "score": 1, "replies": [{"body": "It'll be so interesting come september when the UI payments stop for many", "score": 1, "replies": [{"body": "\"Interesting\" is one word for it...", "score": 2, "replies": [{"body": "Get yet popcorn lol", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The 3 items of concern are Used vehicles, energy, and gasoline. But these make sense in a COVID/ post covid transition.  Look at the prior values and youll see decreases until just recently we see a spike. I imagine there is a correlation here with people finally getting out and about. Energy and gasoline are typically volatile and so used vehicles might be the underlying problem because those increases may be sticky. Its worth looking at it more.", "score": 2, "replies": []}]}
{"title": "Should you buy Tesla stock? It depends how far into the future you’re willing to look", "selftext": "", "id": "o0u4ps", "created_utc": 1623808836.0, "score": 24, "upvote_ratio": 0.85, "num_comments": 12, "comments": [{"body": "Free cash flow is one area where Tesla has shown it is making strides. Cash-flow generation is prioritized by many investors in a high-tech global economy where the time value of money is not insubstantial. That is doubly true for a growth-oriented company like Tesla that needs significant free cash today if it wants to hit ambitious operational targets.\n\nBased on the last 12 months, then, Tesla has given Wall Street reason to be encouraged as free cash flow didn’t just stay positive but expanded significantly. That’s a huge plus considering the negative numbers from its peers on this list.", "score": 22, "replies": [{"body": "And it's not even free cash flow that is the most important growth metric, but cash flow from operations - which is gigantic even with the margin inefficiencies of a hyper-growth company:\n\nFY|cash from operating activities\n--|--\n2016| $-124m\n2017|\t$-61m\n2018|\t$2,098m\n2019|\t**$2,405m**\n2020|\t**$5,943m**\n\nHere's how it relates to FCF:\n\n> Free cash flow = cash from operations - capital expenses\n\nBut investors by and large ignore capex for hyper-growth companies - and pure cash from operations is a good approximation of the cash generation ability & revenue opportunity of the business.\n\nIf we look at it on the quarterly level, it gets even better:\n\n  Quarter | Cash from operations | Capex   |   FCF     | Working capital Δ | \"Real\" cash flow | cash-EPS\n  ---     |---                   |---      |---        |---                |---               |---\n  Q1'18   |    -398m             |   -656m |  -1,054m  |   -325m           |  **-$73m**    | -$0.07\n  Q2'18   |    -129m             |   -610m |    -807m  |   +167m           |  **-$296m**    | -$0.31\n  Q3'18   |  +1,391m             |   -510m |    +881m  |   -351m           |  **+$1,742m**    | $1.83\n  Q4'18   |  +1,235m             |   -325m |    +910m  |   -199m           |  **+$1,434m**    | $1.51\n  .       |.                     |.        |.          |.                  |.                 |.\n  Q1'19   |    -640m             |   -280m |    -920m  |   +676m           |  **+$36m**       | $0.04\n  Q2'19   |    +864m             |   -250m |    +614m  |   -288m           |  **+$1,152m**    | $1.21\n  Q3'19   |    +756m             |   -385m |    +371m  |   +192m           |  **+$564m**      | $0.59\n  Q4'19   |  +1,425m             |   -412m |  +1,013m  |   -231m           |  **+$1,656m**    | $1.74\n  .       |.                     |.        |.          |.                  |.                 |.\n  Q1'20   |    -440m             |   -455m |    -895m  | -1,447m           |  **-$1,007m**    | -$1.06\n  Q2'20   |    +964m             |   -546m |    +418m  |   -246m           |  **+$1,210m**    | $1.27\n  Q3'20   |  +2,400m             | -1,005m |  +1,395m  |   +635m           |  **+$1,765m**    | $1.86\n  Q4'20   |  +3,019m             | -1,151m |  +1,868m  | +1,242m           |  **+$1,777m**    | $1.87\n  .       |.                     |.        |.          |.                  |.                 |.\n  Q1'20   |  +1,641m             | -1,348m |    +293m  |    -12m           |  **+$1,652m**    | **$1.74**\n\nNote how Tesla's Q1'2021 flipped around the seasonal cash flow pattern negative cash from operations - into a whopping +$1.6b print.\n\nNote how looking at FCF alone hides much of the cash generation power of Tesla's underlying business.\n\nIf Q2 follows these seasonal patterns it's going to be a blockbuster.", "score": 6, "replies": [{"body": "The last quarter in your table is supposed to say Q1'21 I believe you made a typo and put in Q1'20 again instead  \nEDIT: Fantastic post btw", "score": 4, "replies": []}, {"body": "Tesla and Apple are the only companies that manage to combine massive cash flow  with startups like hyper revenue growth.\n\n\nUnlike Apple, tesla is also a vertically integrated manufacturing juggernaut with massive capex expenditures. Yet it still manages to achieve such level of free cash flow. This goes against wall st entire frame of reference and it doesn't compute to their walnut sized brains.\n\n\nIt is gonna be wild when tesla starts issuing dividends.", "score": 3, "replies": []}]}]}, {"body": "What the author completely misses is that Tesla’s operating margin and gross margin take into account an enormous ongoing investment into building new factories, and R&D of brand-new industry-leading technology. If Tesla halted its rapid growth, it would look extremely profitable on the books.", "score": 7, "replies": []}, {"body": "MarketWatch is owned by Citadel.", "score": 6, "replies": [{"body": "[From the wiki:](https://en.wikipedia.org/wiki/MarketWatch)\n\n\"MarketWatch is a website that provides financial information, business news, analysis, and stock market data. Along with The Wall Street Journal and Barron's, it is a subsidiary of Dow Jones & Company, a property of News Corp.\"\n\nNews Corp is basically Rupert Murdoch and friends.\n\nCitadel LLC appears completely unrelated to the media company MarketWatch...", "score": 4, "replies": [{"body": "https://www.reddit.com/r/GME/comments/msuj3g/guess_who_is_also_with_citadel_marketwatch_do_i/?utm_medium=android_app&utm_source=share", "score": 2, "replies": [{"body": "Interesting", "score": 2, "replies": []}, {"body": "Citadel bought 90% of the Dow Jones *Indices* division not the company. MarketWatch doesn't have anything to do with the indices.\n\nOf concern is the fact that Citadel directly controls the Indices.", "score": 1, "replies": []}]}]}]}, {"body": "What kind of message are they trying to send showing a chart of assets and cash without showing liabilities.", "score": 3, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "o0v2hs", "created_utc": 1623812114.0, "score": 29, "upvote_ratio": 0.94, "num_comments": 20, "comments": [{"body": "I think part of \"Elon Time\" is also setting deliberately unrealistic goals in order to motivate your team to drive towards a goal with determination and singular focus. I had a boss that made our team furious with his demands that we deliver designs in a completely unreasonable timeline, but in retrospect nothing has made me more efficient, focused, and clever at problem solving than raging at an impossible challenge almost in spite. That was kind of the theme of Whiplash (excellent movie, btw). Carrots and sticks are always more effective than carrots alone. Having read several books about Elon & his companies, it's safe to say he is very demanding of his engineers so I wouldn't put it past him - if you say something can't be done, you won't last long.  \n\n\nEDIT: This was kind of a tangent from the main point of this post, but just wanting to underline that Elon Time is nuanced in a lot of ways. He's trying to motivate his team, he's trying to motivate himself, and he's trying to be a salesman all at the same time when he states timelines publicly in tweets, interviews, and official statements. Delving into that psychology is probably something we could use more discussion of in this sub since it bears so much into how Tesla ultimately delivers as a company.", "score": 19, "replies": [{"body": "[and this](https://i.imgur.com/3ABqfKW.jpg)", "score": 7, "replies": []}, {"body": "Elon said a long time ago that there is no such thing as internal goals *and* external goals. All goals are external because internal goals will always get leaked. Internal goals are meant to be ambitious to motivate people external goals are meant to temper expectations. If you've accepted that there is no such thing as an external goal, then all your goals will always be too ambitious. \n\nOnce people on the outside accept this, then you stop feeling burned by unmet goals. (though, I will admit, every time I keep thinking, \"Maybe this time they will hit the goal.\")", "score": 3, "replies": []}, {"body": "Though he also said you don't want to set *impossible* goals, either, because that's just demoralizing. Have to see realistic, hard goals.", "score": 2, "replies": []}]}, {"body": "That’s probably a big reason they are starting with the Model Y at the Berlin and Texas factories and also why the CyberTruck will be late.", "score": 4, "replies": [{"body": "But will the MY in Berlin and Austin use 4680s? It’s a pretty big detour to build the factory to use 2170s for awhile and then do an update to use 4680s", "score": 2, "replies": [{"body": "Yes both will use 4680.", "score": 5, "replies": []}, {"body": "MY will use 4680s, it has been confirmed, confirmed and then confirmed again.There has been zero mention of 2170s for MY in Austin or Berlin.\n\nCyberTruck isn't just an update to new batteries, or a new frame, it is a new manufacturing process, with the entire exoskeleton. Completely reinvented from the ground up.\n\nFor the MY; switching battery packs, and structural batteries is iterative to what they're currently doing. 4680s are reinvented, but they're working out the kinks over the past year or two, and they're producing a mini-butt load right now, with the cells ready to ship to Austin and Berlin until their own battery lines are up and running, and scaled.", "score": 3, "replies": [{"body": "4860's\nThey have their own production facilities.\nThey have Panasonics 4860 production lines.\nAnd I think Samsung also buiding 4860 lines.\n\nIf all are successful. They'll have cells to use for lower margin production. \n\nBut 3 means a lot of chances to get it right, enough.", "score": 1, "replies": []}]}, {"body": "So what are they going to do? Delay the entire production until they figure out what's going wrong with 4680?", "score": 0, "replies": [{"body": "No idea. That’s a game time decision. Depends on how far the 4680s are I guess.", "score": 2, "replies": []}, {"body": "You have no idea if it what's wrong with the 4680.", "score": 1, "replies": [{"body": "Elon already stated that there are issues needed to be worked out. Progress is slower than expected. I don't need the details.\n\nIt's most likely the Maxwell DBE process they can't get to scale.\n\nThey may be fine if Panasonic and LG chem can deliver the 4680.", "score": 2, "replies": []}]}]}]}]}, {"body": "It's worth noting that Tesla had an early version of the tri-motor that they were using at the Nurburgring in 2019.    I remember seeing pictures of it.  \n\nIt wasn't good enough for them.   They kept at it to get more improvements.\n\nNow look at the Sandy tear down of the Mach-E.   They didn't say \"how can we make this better,\" the last words said in that meeting was \"fuck it.\"\n\nGM still holding its' 5% stake in Lordstown apparently.   Ford takes 2 years to go from promotional video for the Lightning, to a render of the Lightning.    Guarantee you that's the same fucking prototype they built 2 years ago for the public demo.  That's why it was completely covered up for it's \"debut.\"\n\nWhat other company even bothers to follow up on any promises at all?   We're so used to just continual bullshit from them with no results whatsoever, and yet, they're somehow held up as completely believable.    Astonishing.", "score": 3, "replies": []}, {"body": "Was expecting a formula, not words", "score": 1, "replies": [{"body": "=IF(x,done,fast,slow)", "score": 3, "replies": []}, {"body": "*f = t ∧ o*\n\n* *f* — will be done fast\n\n* *t* — whether Tesla has done it before\n\n* *o* — whether anyone has done it before\n\nHmm ... though, come to think of it, *o* seems redundant", "score": 3, "replies": [{"body": "Lul.", "score": 1, "replies": []}]}]}, {"body": "Adding to this, when they figure it out. Expect exponential growth, i think that applies to the examples you mentioned.", "score": 0, "replies": []}]}
{"title": "As Tesla stock dips, investor says ‘any time you get the chance to buy it, buy it’", "selftext": "", "id": "o13tc3", "created_utc": 1623846868.0, "score": 114, "upvote_ratio": 0.97, "num_comments": 12, "comments": [{"body": "makes me laugh an article from CNBC.", "score": 8, "replies": [{"body": "After a decade of BS, now they have insight?", "score": 5, "replies": []}]}, {"body": "The longer the base the higher the breakout 🚀\n\nI’m putting every € I have in it 🔥🥰", "score": 28, "replies": []}, {"body": "What’s with the talk in graphs and trends.  Who cares.  How about the big picture : transport is going electric - and will see massive growth.   Like yellow tie guy said: Buy and wait for the world changing disruption, which we have just started to see, to play out.", "score": 16, "replies": [{"body": "Ok so tesla is worth 600 billion dollars now, more than all other car companies combined, what do you think it will be worth in the future and at what time scale", "score": 8, "replies": [{"body": "Value of stock is those willing to bet on FSD becoming reality. But once it is reality then its gonna skyrocket well past a few trillion immediately.", "score": 2, "replies": []}, {"body": "No idea.  There’s good arguments they can be world’s most valuable company in 5-10 years (the relation to other car companies only matters if margins, structure, and products are comparable - this argument says no).  Given net zero commitments from 70+ trillion usd - the sky is the limit if others don’t learn to execute a whole lot faster. If the disrupters are disrupted or fail on ‘bet the company’ actions - could be flat or down for a farrrrr and long time! My money is on the first.", "score": 3, "replies": []}]}]}, {"body": "Until you are out of fiat :)", "score": 3, "replies": []}, {"body": "ironic that its coming from a managing director at Rockefeller Capital Management, when they would have made their capital from oil. I wonder if in 60 years their will be Musk Capital Management that will invest like Ark-invest", "score": 3, "replies": [{"body": "That are also newly members of the net zero asset owner alliance.", "score": 2, "replies": []}]}, {"body": "Absolutely agree - this was a good summary of $TSLA. I liked it.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Wheres my dividend!?", "score": 6, "replies": []}]}]}
{"title": "Green groups seek injunction for Tesla factory permits in Germany", "selftext": "", "id": "o1butx", "created_utc": 1623868332.0, "score": 14, "upvote_ratio": 0.85, "num_comments": 16, "comments": [{"body": "The so called « green groups » 🤥🥴", "score": 26, "replies": [{"body": "I worked at an Apple Store about ten years ago. Greenpeace came in with a bunch of helium balloons and let go of them in the store. These kind of people are morons and have no idea what they are fighting for.", "score": 19, "replies": [{"body": "Well this but I think IMO these groups are payed by legacy OEMs … could be wrong but that’s my take as some of their locations are near VW headquarters…", "score": 15, "replies": []}]}]}, {"body": "The environmental Group NABU has filed a court case against Tesla demanding the immediate stop of works\n\nThe responsible Ministry declared the NABU request as not justified\n\n… woaw 🥴", "score": 7, "replies": []}, {"body": "Wouldn't be surprised if the \"green groups\" are backed by the massive German auto industry and all their unions.", "score": 8, "replies": [{"body": "This has nothing to do with Tesla or the auto industry. That's just every big German construction project in a nutshell.", "score": 1, "replies": []}]}, {"body": "Elon should make the tree huggers an electronic tree that hugs back", "score": 2, "replies": []}, {"body": "Any idea on what grounds?", "score": 1, "replies": [{"body": "Nope not for now :x", "score": 2, "replies": []}, {"body": "The environmental issues they are worried about seem to be\n1) water consumption (30% of the areas water)\n2) lack of plans to prevent poisonous gasses from escaping\n3) plans to produce batteries on site, without government approval\n\nEurope has learned to be preventative in environmental protection. We are densly populated continent. You really need to show your work in backup and safety plans. It's same rules for everyone. You can't half ass the paperwork. European manufacturers might be able to build factories faster, because they make sure all the plans and forms are in great condition from the get go.", "score": 1, "replies": [{"body": "Sounds like a reasonable thing to worry about.\n\nBut you make it sound like Tesla did bad and sloppy paperwork. I haven't seen any evidence of that but I guess we will see in court if the groups have that evidence.\n\nI don't know the validity of #1 and #2 but #3 seems wrong. If Tesla had no government approval for battery construction what is this pre-approval they received in January?\n\nhttps://www.teslarati.com/tesla-4680-battery-factory-worlds-largest-giga-berlin-approved/", "score": 2, "replies": [{"body": "Most factory building projects in Europe have some delays over environmental issues. If any get things done fast, the paperwork isn't just good, it's pristine with tons of consultants massaging it to shape (source, relative used to be one of those consultants).\n\nThe 3 points were the quick summary I found of the issues. 3rd one seemed to be often worded in different ways, and I think the problem is that there is some inconsistancies with the permit and the production plan (different news sources summarizing the issue slightly differently). \n\nThe link you gave states that they were allowed to start building the factory. The actual construction of the building was initially blocked because they weren't allowed to cut the trees on the location (separate environmental issue court already ruled on). So it might be they were allowed to start the construction of the building, but the final plans weren't approved for environmental and safety point of view regarding battery production (hasn't passed inspections, can start building but risk of making costly changes before production can begun, or might need to convert the building to producing something else). \n\nMy german isn't good enough that I could check a primary source for you. Sorry.\n\nEdit: actually your article does state the issue. The permit was given by federal minister while the local officials weren't even delivered the necessary plans. It's questionable if this was legal.", "score": 2, "replies": [{"body": "Thanks for the summary!", "score": 1, "replies": [{"body": "Looks like out going minister is trying to rush things in election year (hoping to keep their spot). All they probably accomplished was giving Tesla the false impression they would be able to skip or delay a step.", "score": 2, "replies": [{"body": "Looks like Tesla should have chosen another country to do business in then.", "score": 1, "replies": [{"body": "Like US doesn't have to deal with politics. Where ever you build a factory, you need to know the local politics. That's just how the world works. \n\nIf Tesla still hasn't given the plans for the battery plant to be approved by local government, it's on them. Local is always going to be the level of government you deal with the most. Even if approval wouldn't be absolutely necessary, you would still want to keep them happy and well informed.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}
{"title": "UP Tesla Plaid - The ICE Bull Run Is Over", "selftext": "", "id": "o1d0p4", "created_utc": 1623871251.0, "score": 64, "upvote_ratio": 0.93, "num_comments": 12, "comments": [{"body": "Can the plaid actually beat these supercars in a full race? Would like to find out. These clips don't provide much context.", "score": 13, "replies": [{"body": "Depends on the track I'm sure. The S is an acceleration beast, so tracks like this Laguna Seca cater more favourably to the Tesla due to more corners and turns.", "score": 13, "replies": [{"body": "Can't wait to see it on the Nurburgring and see how much it can take down the Porsche Taycan by.", "score": 9, "replies": [{"body": "It should handsomely I'm hoping they can break the top ten", "score": 1, "replies": []}]}, {"body": "I don't know much about racing, but isn't accelerating through corners and turns the entire point?", "score": 3, "replies": [{"body": "Yea, I think S Plaid will win in most common tracks", "score": 4, "replies": []}, {"body": "Exactly", "score": 2, "replies": []}]}]}, {"body": "What's a full race? I mean, there's single lap times but beyond that isn't it whatever you want it to be? 5? 10? 100? 24 hours? At some point ICE will win because gas tanks are big.", "score": 5, "replies": [{"body": "Agreed, unfortunately. Running a Tesla Plaid at its full capacity would seem to drain the batteries quickly. Even the track focused electric hypercars are limited to lap (s) before needing to be recharged.", "score": 0, "replies": []}, {"body": "Ice Tanks are often 20 gallon... But modded Ice track cars that push 1000hp tend to only get 5-6mpg... Which means they can get ~110 miles on a fill. Granted, you can fill an ice tank in a few minutes, and  it would take 15 minutes to get the plaid S to the same point...  This will only come up in very specific races... And those \"races\" won't be about speed, they will be about endurance... And I there are very... Very few people who will care that Plaid doesn't enter races longer than 2 hours because it takes 15 minutes to regain power verses the 3 of ICE.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "The window is open bruh", "score": 1, "replies": []}]}, {"body": "This is the way", "score": 1, "replies": []}]}
{"title": "Portfolio Allocation by Strategy? - PMCCs, CSPs, CCs etc.", "selftext": "What % allocation do you have for each strategy? \n\nI am looking at running Credit Spreads on SPX ($15 wide, delta 9-10, 10 DTE), PMCCs (mostly cheaper plays on crypto miners like MARA), CCs on long-term plays like SLV, or eventually a nice little AAPL farm (in addition to physical) and a descent cash ballast of 40ish%.", "id": "o12u62", "created_utc": 1623843552.0, "score": 10, "upvote_ratio": 0.86, "num_comments": 16, "comments": [{"body": "It really depends tbh.  I do no spreads except the occasional PMCC, but generally I prefer to do CSP or CC depending on where the price is in relation to where I want to buy.  Currently 30% PMCC, 5% CSP, and the rest CC.", "score": 3, "replies": [{"body": "Why do you not tend to use spreads? I am curious, I assume you are not wanting to limit your upside potential, I have always liked the leverage that spreads can give you for ROC, that being said i had a GLD spread that blew through it and i would have been far better with a straight call or PMCC.", "score": 2, "replies": [{"body": "Spreads are really good for short term trading as they provide an excellent ROIC if you use them within reason (assuming you’re doing credit spreads).  Debit spreads make a little more sense (PMCC is a debit spread) so I tend to use those slightly more.  The reason I don’t like credit spreads in particular is there’s no way to extend your time other than to roll and often you’ll be rolling into perpetuity.  Basically getting blown through a credit spread is extremely difficult to recover from.  If you size small they work nice, but my investing style is highly concentrated generally leveraged bets on high confidence plays so I’m usually 40%+ in a single position.\n\nEdit actually it doesn’t matter if you do credit or debit spreads in regards to ROIC they’re both capital efficient.  I just don’t like credit spreads for the reasons outlined above", "score": 3, "replies": [{"body": "Very true, i prefer vertical debit spreads to vertical credit spreads for the same reasons, although they certainly have their place.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "That would be one of my goals, i tend to want to take longer-term speculative plays, but i really want to have a nice stream of theta that is paying for those speculative gambles to limit my downside.", "score": 2, "replies": []}]}, {"body": "What is even the point of this question?\n\nAllocation is to diverse away sector risk. It doesn't make sense to say x% in one strategy and y% in another.\n\nIs there any meaning in % of strategy if I do 5% PCS and 95% CSP but all in AMC?", "score": 3, "replies": [{"body": "I don't want to speak for OP but I think this question is asked with the assumption that your underlyings are diversified.", "score": 2, "replies": []}, {"body": "Well yes there is meaning in the question, because in your example you just told me you are 100% long, with 5% defined risk and 95% significant risk (because while CSPs are defined they are still substantial).\n\nStrategy allocation changes your exposure to time, directional and IV risks and is better than sector diversification because correlations go up in a bear market/ downturn, go look at 2008, 1987 or 2020.\n\nDebits spreads = directional risk, not IV risk\nPMCC = directional risk and some IV risk \nCSPs = directional and IV \n\nI know traders who trade just the one instrument with 5 strategies and can weather a variety of market conditions, so yes, if you fail to understand how your strategies and % into each can effect your exposure your overall delta, theta, or vega risk then you are missing a key piece imo.", "score": 1, "replies": [{"body": "My problem with this thinking is that if there's only one underlying, delta, theta, and (adjusted) Vega are all additive so essentially you're just taking one position. I would assume the 5 strategies are not all deployed at the same time.\n\nNow if there are multiple stocks, say 5, of which 3 uses CSP and 2 uses PCS with same premium and therefore you are 60% in CSP and 40% in PCS. This 6:4 ratio carries no meaningful information on its own.\n\nI guess it's down to the motives, where you're just asking for people's current portfolio positions and I misunderstood as you're implying that there's some magic rule of nature in the ratio of option strategies.\n\nedit: man, now I just feel like a PITA. Your post is clearly of higher quality than most of the junks we had today and I should just be nice and participate in the convo.", "score": 3, "replies": [{"body": "That's ok man, no worries, I probably could have phrased the question better. \n\nI tend to utilise more strategies on the same stocks at the same time so my overall exposure changes. \n\nE.g. I would do CCs on a stock, and sell a PCS to get more theta and maybe a CCS to reduce overall delta exposure for example. Or if a stock I am long falls I might sell an OTM call to reduce delta. Or if my short strikes are under attack on a PCS I might buy some offsetting delta to be neutral and have a pure theta trade to give myself time to manage a position.\n\nIt seems I may be an outlier and more people may very well stick to simpler strategies with less cross over of positions (which is entirely understandable and far easier to manage).", "score": 1, "replies": []}]}]}]}, {"body": "I don't do PMCC. Currently 30% CC, 10% CSP and for the rest I do PCS on SPX 0-2 DTE and the occasional ICs also on SPX", "score": 2, "replies": [{"body": "How have your trades been on SPX with PCS? 0-2 DTE would be pretty volatile i imagine, are you closing at 50% or just letting them expire? I would be curious to know what your results are on those if you don't mind sharing.\n\nObviously the decay would be pretty quick but the rate of delta change would also be pretty nasty on your P/L at times.", "score": 2, "replies": [{"body": "Yes, I close them at 50%. I have a rule since yesterday: when fed speaks I don't do 0 day :))\nI survived, I had a 4225-4195 PCS and imagine when I looked and saw SPX at 4006 (STO for 3.4 premium on a 2700 max loss, p/l was mostly at around -1.4k) and I BTC 45 minutes before market closed for 1 for a total 2.4 return (or 8.89% on BPR). The put I sold was a 10 delta at the time of open so it looked pretty safe but I didn't check for events. It was an emotional rollercoaster for sure but I like to let the probabilities play and exit when I can't get no more. If I was letting that expire I would have eaten the max loss with SPX closing at 4223.70.\nSo, if I stick to 10-12 delta in a non-announcement day it's cool. Until now I only have profitable trades but I don't have a large enough sample size since I just moved to spreads from condors :)\nEdit: terminology", "score": 2, "replies": []}]}]}, {"body": "I do 8-10 put credit spreads at a time. Each position is a max of 5% of my account. I try to keep each spread in a different industry group (energy, tech, financials, healthcare, etc) so that if one sector is having a bad week I don't get wrecked. With that, I've got 40%-50% of my account tied up in the assumption that the market isn't going to have a severe dip.\n\n\nI try to keep 1-2 bearish positions for the same reason. Either selling call debit spreads or just buying a put on a stock that looks weak. If the whole market tanks then these should hopefully pay off  and help ease the loss from the credit spreads. Again, max loss is going to be 5% of my account per position.\n\n\nI usually don't, but will sometimes buy a call or bull call spread on a stock if I don't already have a credit spread in the same industry group.\n\n\nThat puts me anywhere from 45%-65% in play at any time, the rest in cash.", "score": 2, "replies": [{"body": "Have you considered doing PMCPs instead of straight puts? I imagine being able to offset the theta on the puts would be quite nice, but then again if the market really took a tumble it defeats the purpose a little bit to have a cap on your downside movement, unless you were selling pretty OTM puts.", "score": 1, "replies": []}]}, {"body": "70% cash, 30% strangles on high IVR/IVPercentile stocks.", "score": 2, "replies": []}]}
{"title": "Unusual activity $SPY. Mini market crash?", "selftext": "[removed]", "id": "o0s58f", "created_utc": 1623801993.0, "score": 4, "upvote_ratio": 0.61, "num_comments": 9, "comments": [{"body": "Jerome Powell will pump it. No worries.", "score": 12, "replies": []}, {"body": "Don’t fight the fed.", "score": 7, "replies": []}, {"body": "I noticed the same and jumped on board. The longer I do this the more I realize the market is rigged. Sometimes it is best to just follow those in charge.", "score": 3, "replies": []}, {"body": "Will depend on if the fed raises rates or not tomorrow.", "score": 2, "replies": []}, {"body": "I like a name like GSK in this environment. Value + healthy divi + catalysts (thanks Elliot). Seems to check the boxes to navigate the current index wide indigestion. Ohh, technicals look nice as well.", "score": 1, "replies": []}, {"body": "JPOW speaks tomorrow and has a press conference. If he says anything unfavorable or slips up during the Q and A it’ll probably be a rough week or two for the market. \n\nEven if you ignore that, the market has been seeing rapid growth. Reaching constant all time highs with little pull back. And even when there is pullback the market uses it to bounce back higher. Many people are seeing the CPI and things like sales and are worried about the economy. JPOW is in a rough spot but many people even without him speaking are worried.", "score": 1, "replies": []}]}
{"title": "$GOEV CANOO TO THE MOON! Make me a millionaire guys. 880k in the stock I wanna see this at 20+ I SURVIVED BEING DOWN -463k at one point. DIAMOND HANDS. IR DAY Thursday, Great EV Skateboard Platform, Apple Was Talking About Buying This Company Before, Very High Short Interest. SHORT SQUEEZE EM!!", "selftext": "", "id": "o0stfy", "created_utc": 1623804307.0, "score": 6, "upvote_ratio": 0.61, "num_comments": 11, "comments": [{"body": "The balls on this guy. I'll join you this Friday, good sir.", "score": 6, "replies": []}, {"body": "Oh my 💎🤲🏻", "score": 6, "replies": []}, {"body": "Tomorrow.", "score": 2, "replies": []}, {"body": "Heavy is the hand that holds the bag", "score": 4, "replies": []}, {"body": "Diamond hands? More like tied up hands in a margin situation.", "score": 1, "replies": []}, {"body": "Just read this post, is this guy ok?", "score": 0, "replies": []}]}
{"title": "AMD YOLO update", "selftext": "", "id": "o0teky", "created_utc": 1623806324.0, "score": 38, "upvote_ratio": 0.71, "num_comments": 13, "comments": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Man, I did, and I waited a month like you guys told me.", "score": 12, "replies": [{"body": "Mod: god damnit, i done told you once already boy!\n\nOp: i did what yall told me tos\n\nMod: fuckin sissy, just get of my lawn..GIT", "score": 3, "replies": []}]}, {"body": "[removed]", "score": 0, "replies": []}]}, {"body": "You spelled AMC WRONG. lol. But in all seriousness ive kicked myself on this one for a long time. Back in 2018 I read some reddit post from some dude that was predicting that it would hit $100 in a few years. This is when it was at like $18.", "score": 2, "replies": [{"body": "Yah I've been big on AMD since 2016. Made a bunch from it, but I sold too many times and missed out on plenty of gains. I think she still has legs tho.", "score": 2, "replies": [{"body": "I bought and traded it for a few months when it IPOd around $2 back in 2003ish. Cant one up that one fuckers", "score": 2, "replies": [{"body": "AMD IPO'd in 1979", "score": 1, "replies": [{"body": "They must have restructured then. Twas a while ago", "score": 1, "replies": []}]}]}]}]}, {"body": "[removed]", "score": -2, "replies": [{"body": "Serves me right for shitting on AMC last time", "score": 2, "replies": []}]}, {"body": "Damn :/", "score": 1, "replies": []}]}
{"title": "Here is a high percentage win, sleep well at night move $XOM -- I like this stock.", "selftext": "This one for you guys!\n\nHere is a high percentage win, sleep well at night move XOM -- I like this stock.\n\nIt's XOM for triple play:\n\n\\- XOM @ current price of $62 - $65 is still undervalue for the next 12 months outlook as the world is not even close to pre-pandemic return.\n\n\\- Engine no 1 case is heading toward a close.\n\n\\- Negative noises are heading out -- it actually created opportunities to buy.\n\n\\- XOM IV is still low for Option plays.\n\n\\- XOM with massive dividends for 12 months play.\n\n\\- Demand for oil is not slowing down as Crude Oil rise each week.\n\n\\- Iran deal seems to be priced in, even when it's still up in the air. An overreaction to the deal will create another buying opportunity.\n\n\\- Rising demand and producers hesitance to dive back in to put more oil in the market.\n\n\\- Crude oil has soared since the acceleration of Covid-19 vaccination programs\n\nand continues to move higher on more widespread vaccinations and inflationary pressures.\n\n\\- Global demand still rising and won't be returning to normal until the Q3 of 2022.\n\n\\- Money continues to rotate into the commodities sector.\n\n\\- Monthly survey of fund managers by Bank of America showed that bullish commodities bets had overtaken Cryptocurrency B trade as the most crowded trade in markets.\n\n\\-  XOM price target at $90 by Bank of America and they believe XOM has capacity to raise its dividend in 2021. \n\n&#x200B;\n\nOverall, XOM price actions combine with massive dividends and low IV options -- that's a triple play.", "id": "o0v4c3", "created_utc": 1623812298.0, "score": 3, "upvote_ratio": 0.53, "num_comments": 19, "comments": [{"body": "r/Investing is this way", "score": 11, "replies": [{"body": "tbf he did [call](https://www.markovchained.com/profiles/view/reddit:WallstreetBoom) NUE before it spiked by 60%", "score": 3, "replies": []}]}, {"body": "This isn't r/investing. This is r/Casinos", "score": 4, "replies": [{"body": "Didn't know Casinos can give such high dividends play.", "score": 2, "replies": []}]}, {"body": "Hell no. They will have to cut dividends.", "score": 4, "replies": [{"body": "They survived Crude Oil crash in Q1/Q2 2020, but they have to cut dividends now when Crude Oil have been heating up since Nov, 2020? hmmm", "score": 8, "replies": []}, {"body": "Why? What will make them reduce the dividend?", "score": 3, "replies": [{"body": "The dude didn't know what he is talking about. Bank of America said XOM has the capacity to raise its dividends this year.", "score": 2, "replies": [{"body": "Exactly that’s why I was asking", "score": 2, "replies": []}]}]}]}, {"body": "If inflation is transitory, this position may not prove favorable.", "score": 2, "replies": [{"body": "IF covid-19 2.0 hits, the market is not favorable and that is as good as if there's transitory inflation.", "score": 1, "replies": [{"body": "This is not financial advice, just my opinion.       \n\nIf Covid 2.0 hits we get reflation which means drop in interest rates which historically has pushed commodities down. If covid 2.0 hits, nobody will be driving because we will be in lockdown again. I also believe oil is something at a 5 year high. On top of that, as soon as Colorado and the Permian start pumping at max again, oil should drop down to sub $50 due to supply even with an import ban on oil. The only way I see oil going up from here is another war, or a steep jump in interest rates past 3.5% which is unlikely to happen.", "score": 1, "replies": [{"body": "Crude Oil has been going up since April of 2020, now - Rising demand and producers hesitance to dive back in to put more oil in the market. Crude Oil has continued to rise none-stop. Until then, hold and collect dividends and ride the wave for the next 12 months.", "score": 2, "replies": [{"body": "Lol… good luck with that!", "score": 2, "replies": []}]}]}]}]}]}
{"title": "$NIU YOUR two wheel Tesla", "selftext": "[removed]", "id": "o0vyf1", "created_utc": 1623815208.0, "score": 0, "upvote_ratio": 0.35, "num_comments": 10, "comments": [{"body": "OPs first post on Reddit.\n\nDo we kill?", "score": 1, "replies": [{"body": "definitely", "score": 3, "replies": []}]}, {"body": "🚩Profile is sus AF", "score": 14, "replies": []}, {"body": "instructions unclear.  Bought more AMC and GME", "score": 8, "replies": []}, {"body": "THANKS!! Just put on DO NOT BUY LIST now. Thanks again partna", "score": 3, "replies": [{"body": "i been playing these brand new accounts begging for buyers. buy puts. sept 17 30p 2x at $20. Itm under 27. I'm so negative delta because of the bio and fake meme pumps but this tested 40 and failed 3 times and is trending to 20 by sept. I like straight put vs put spread on this one because $10 is possible by then.", "score": 1, "replies": []}]}, {"body": "I’ve been getting into NIU. Nice to see someone notices it as well", "score": 0, "replies": []}, {"body": "Two wheel Tesla is Zero Motorcycles you fucking shill. Nobody gives a shit about your electric scooter. \n\nYou: I’m wondering how to let people know I like drinking my own jizz…\n\nThe guy jerking off on your face: You could get a Vespa!\n\nYou: No seriously. Like GALLONS of cum. In and on me. \n\nJerk off guy: Oh damn! You’re definitely going to need some ridiculous electric scooter. But also buy stock in it and then embarrass yourself by posting about it online.", "score": 0, "replies": []}]}
{"title": "RIG is looking good. High Short interest 6 days to cover improving fundamentals. I know oil is a dirty word anymore but this is a good play here.", "selftext": "   I believe that the energy sector is going to be smoking hot especially with inflation coming around the corner. I know a lot of the big names have moved up already but there are a ton of unloved energy plays that no-one is talking about.  \n\nEven though there is a big push for clean energy and green everything, you can't deny that we still rely heavily on oil and we will for a long time in the future. Whether you like it or not thats the reality. \n\n Shale oil is not going to grow like the past and there is a shift back toward deepwater drilling. Its happening right now. I think you should take a look at the biggest player in the offshore oil patch. \"RIG\" they are getting some momentum after years of underinvestment. The stock is super cheap right now and Im loaded up on shares before the big money starts flowing into the space again. Check it out and do your own DD.  This could be great squeeze play or atleast multi bagger from fundamental view.   Let me know what you think.", "id": "o14yzl", "created_utc": 1623850365.0, "score": 18, "upvote_ratio": 0.66, "num_comments": 18, "comments": [{"body": "Lost me when you said high short interest. No one gives a fuck. Find a stock that is actually worth buying options on and people will care. investing sub is easy for you to find.", "score": 7, "replies": [{"body": "Lol short interest and short squeeze is like a virus in investing right now… everywhere", "score": 3, "replies": []}]}, {"body": "Joined the RIG yolo... 🤞", "score": 4, "replies": []}, {"body": "positions or ban", "score": 4, "replies": []}, {"body": "I like RIG. I believe the future is looks good for them and is", "score": 4, "replies": []}, {"body": "RIG is a steal rn. If inflation drums beat louder coming up in the near term, that’s my play.", "score": 10, "replies": [{"body": "Did you make the move? Inflation much more than anticipated?", "score": 1, "replies": [{"body": "Not yet. What I want to see is that the markets, the people, and the central banks all recognize and accept that inflation is high and is not transitory. Just before that appears to be imminent, I jump in two feet.", "score": 1, "replies": []}]}]}, {"body": "Have some shares in $REI. It's up 15¢ today to $3.09.", "score": 2, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "o153cm", "created_utc": 1623850709.0, "score": 59, "upvote_ratio": 0.71, "num_comments": 29, "comments": [{"body": "ASO has pretty significant [short interest](https://www.plotlion.com/short-squeeze-indicator/) as well", "score": 22, "replies": [{"body": "Get the Reddit apes to jump on this one and they’ll see a short squeeze", "score": 4, "replies": []}]}, {"body": "ASO is so undervalued, see you boys at $55 a share! \n\nI have $2000 in shares", "score": 14, "replies": [{"body": "I hope your right I have a $75,000 profit on my 138 calls but at $55 my profit would be $300,000", "score": 5, "replies": []}]}, {"body": "Asooooo", "score": 9, "replies": []}, {"body": "good stonks", "score": 6, "replies": []}, {"body": "Every time VSTO goes big red and takes my account with it, I check WSB and find that someone posted about it the day before. I need to set up a bot to notify me about VSTO mentions on this sub, it’d be a great way to know when to sell my calls and flip some weekly puts.", "score": 4, "replies": []}, {"body": "Isn't part of the reason why they trade at low P/E's because it's very likely their earnings are near peaks? Why are outdoor goods stores suddenly more popular long term after the pandemic than before? The demand for their services will level off at some point....so could be that the market is pricing in over-earning at the moment.", "score": 3, "replies": [{"body": "I mean, that’s all I can think of. But they have big share buyback programs, have been paying off debt, and have growing cash on balance sheets. \n\nSo yes, absolutely. Maybe earnings go sideways. \n\nIn my opinion, youth sports is a different beast than it was 30 years ago when I was a sweaty-dollar bill in the  sock for ice cream after the game brat. \n\nNow it’s $1,000-$3,000 a season I spend on my kids for sports. Insane. But it is what it is. \n\nAnd Underarmor, Yeti, etc…can’t seem to sell merch fast enough.\n\nWhen I go downtown I don’t see hordes of 20-somethings getting shit-rocked hammered 7 days a week like 1997. I see seltzer water drinking goddamn models who belong to four gyms (a spin gym, yoga studio, high end gym, and CrossFit Box). \n\nWorking out and looking like a model is the new singles bar. \n\nI think these companies have a long way to go. \n\nBut I could be 100% wrong.", "score": 2, "replies": []}, {"body": "These businesses are cyclical, but that doesn’t mean we’re at the top of the cycle yet. VSTO in particular has their entire ammo production backlogged as far out as they’re willing to go, and they just acquired another ammo factory to increase production capacity. Assuming no huge changes that would invalidate my thesis, I’m riding this wave to at least the end of 2021, then I’ll plan a more specific exit strategy.", "score": 2, "replies": []}]}, {"body": "I agree, uwmc does need some volune", "score": 1, "replies": []}, {"body": "BNGO?25% short interest", "score": 1, "replies": []}]}
