{"title": "Microsoft is the stock to buy as it leads the AI arms race while Alphabet continues to play catchup with Bard, according to Wedbush", "selftext": "The battle in generative artificial intelligence is heating up following Alphabet's I/O conference on Wednesday, during which the Google parent announced updates to its Bard platform.\n\nBut according to Wedbush analyst Dan Ives, Microsoft remains the stock to buy as it maintains its lead in AI with its stake in ChatGPT and prepares to start monetizing the opportunity.\n\n\"The AI monetization opportunity makes us more bullish on \\[Microsoft\\],\" he said in a Thursday note. \"We believe that Microsoft is in a unique position to gain share in the cloud market while deploying additional AI capabilities that we estimate could expand Redmond's total addressable market around cloud by 35% to 40% over the coming years.\"\n\nThe company's strategic stake in ChatGPT, which was bolstered earlier this year with an additional $10 billion investment into OpenAI, could set Microsoft up for the opportunity to start taking share in the cloud space from Amazon's AWS offering. \n\nIves reiterated his \"Outperform\" rating on Microsoft and said it remains a \"best idea.\" Additionally, he increased his price target on Microsoft to $340 from $325, representing potential upside of 9% from current levels.\n\nWhile Alphabet continues to play catchup in the AI space, it is setting up to go head-to-head for market share against Microsoft, especially as the search company has indicated that it plans to incorporate AI capabilities into all aspects of its product suite, including the cloud. \n\nFull article: [https://markets.businessinsider.com/news/stocks/microsoft-stock-buy-leads-ai-arms-race-chatgpt-alphabet-bard-2023-5](https://markets.businessinsider.com/news/stocks/microsoft-stock-buy-leads-ai-arms-race-chatgpt-alphabet-bard-2023-5)\n\nWedbush analyst Dan Ives recommends buying Microsoft (MSFT) over Alphabet (GOOG) due to MSFT's lead in the generative AI space as the company already preparing to monetize its headstart in AI, while GOOG is still playing catch-up with its Bard offering. Do you agree that MSFT is a better buy over GOOG as this point?", "id": "13fjz0w", "created_utc": 1683895070.0, "score": 46, "upvote_ratio": 0.71, "num_comments": 86, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|1 year ago\n**Total Comments**|108|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: Yes, we believe that Microsoft is in a better position to gain market share in the cloud and AI spaces due to its strategic stake in ChatGPT and its ability to start monetizing AI capabilities.", "score": 1, "replies": []}, {"body": "Okey doke so puts on MSFT it is!", "score": 47, "replies": [{"body": "Adding to my collection…", "score": 4, "replies": []}, {"body": "That's what I gathered.\n\n&#x200B;\n\nInverse WSB and Cramer.\n\n???\n\nProfit.", "score": 5, "replies": []}]}, {"body": "MSFT? Yea good call it definitely isn’t bid up by every other investor under the sun!", "score": 15, "replies": [{"body": "Should have listened to me when I told you to buy at the start of the year ( ͡° ͜ʖ ͡°)", "score": 1, "replies": []}]}, {"body": "One thing to consider. Aside from operating systems Microsoft also has a super long history of dropping the ball when they are way ahead IE, Zune, Azure, Windows Phone, HD DVD for Xbox 360 etc etc", "score": 33, "replies": [{"body": "Motherfuckers had Skype for 20 years and the one time the entire human race needed its service it got btfo by zoom lmfao \n\nMsft is dogshit", "score": 8, "replies": []}, {"body": "I somewhat agree but you included some bad examples- was MS ever ahead with Zune, Azure?  \n\nAzure has always been catching up to AWS and doing a good job at that.  \n\nZune was released to catch up to iPods and failed spectacularly.", "score": 2, "replies": [{"body": "As someone who owned  a Zune and an iPod...Zune was so much better, ipod just had such a massive first mover advantage and was good enough to not really need too many improvements in the eye of the general public that it crushed", "score": 6, "replies": []}]}, {"body": "A lot of the ones you listed I would not claim they where ahead lol. HD DVD had very minimumal pick up, windows phones was never even in second place like ever, zune I remember as few people had, but most either iPods or other mp3 players. Sure on IE they had a lead but they where also huge for a long ass time, and isn’t Azure the web services that they make huge money from. Like isn’t google, Amazon, and Microsoft still the biggest players in the game today.", "score": 2, "replies": [{"body": "Zune was a way better MP3 player, I know because I still have one and use it all the time. Also the Windows Phone was really cool but way too different from what everyone was used to. \n\nAlso HD DVD was killed because porn chose blue-ray. They typically determine the final tech for most media. If they ever focus in on one VR company then that's the one to go with.", "score": 5, "replies": [{"body": "HD-DVD was killed once Warner dropped support of the format, siding with Blu-Ray as the PS3 began to pick up in sales. Soon after Warner left, NBC Universal, Toshiba, and Microsoft had to admit defeat.", "score": 2, "replies": []}, {"body": "I have to admit I had two Windows Phones in a row.  People always looked at me like I had hooves for feet when I showed it to them. I might as well have been in the carnival. But looking back on it....they were not good phones. I guess for the price point they were OK, but as someone who is solidly Android now it is night and day.", "score": 2, "replies": []}]}]}]}, {"body": "You believe wedbush it's on you.", "score": 7, "replies": []}, {"body": "i would never buy shares of MICRO-SOFT. Do you even know what the name means? Micro + Soft. Micro Soft Penis, i definitely do not have a micro soft penis therefore i won't be purchasing any Microsoft (penis).", "score": 19, "replies": [{"body": "read the first sentence and thought \"hmmm...i wonder what insights this person has to offer that i havent thought about\"", "score": 10, "replies": []}, {"body": "Yeah right. I was Micro-soft after I banged your momma and jumped in an ice bath.", "score": 2, "replies": []}, {"body": "But think of the logic... if you already had a car, you wouldn't need a car! So if you already had a micro-penis, you wouldn't need to get one! So you might in fact be in the situation of needing one. Thus, perhaps you should buy some MiRcOsOfT. Use your brain, my dude!", "score": 2, "replies": []}]}, {"body": "Bard is internet driven. MS is user input driven. Bard wins long term", "score": 16, "replies": [{"body": "Maybe but right now Bard is shit compared to GPT", "score": 6, "replies": [{"body": "It’s superior in many ways\n\nZoom was better for video until google meet", "score": -2, "replies": [{"body": "What ways exactly?\n\nBoth internally they call it \"trash\" and externally when I suggest they remove the \"r\" from their name I always get upvoted.", "score": 1, "replies": [{"body": "It has access to the internet and the rest of the google universe. You can give it links, ask it to crawl links, analyze images etc.  \n\n\nChatGPT is a \"chat bot\" and Bard is a \"Google Bot which can also chat\"   \n\n\nIf you just want language then ChatGPT as a edge maybe, but if you want to do work, Bard currently has more utility for anything other than \"chat\"", "score": 1, "replies": [{"body": "So does bing and GPT-4 (still in early release)\n\nI mean can I again emphasis the engineers at google call it 'trash'?", "score": 3, "replies": []}]}]}]}]}, {"body": "but if they can write code why cant they replace engineers, its not like their doing rocket science or something", "score": 2, "replies": [{"body": "The code is utter shit. Matlab can solve multiple dimensional transport equations for me but it has no idea what the number(s) it spits out means", "score": 5, "replies": [{"body": "so does msoffice?", "score": 0, "replies": []}]}, {"body": "Should be able to replace Rocket science too.. its just rocket science", "score": 6, "replies": []}, {"body": "Because it can't write code anymore than what you google on stackoverflow.", "score": 2, "replies": [{"body": "wat most engineers do today anwyay", "score": 2, "replies": [{"body": "No", "score": 1, "replies": []}]}]}]}]}, {"body": "My ass if it was so good why dont they replace they own high paid engineers with it?", "score": 8, "replies": [{"body": "Loyalty? Or perhaps because AI systems don't just turn themselves on and start working without human interaction maybe?", "score": 5, "replies": [{"body": "sure but if only interaction is required surely they could outsource", "score": 1, "replies": [{"body": "No offence but you clearly have no idea what you're talking about", "score": 1, "replies": []}]}]}, {"body": "Do you think they’re not working on that?!", "score": 1, "replies": []}]}, {"body": "WSB classic, buy high", "score": 2, "replies": []}, {"body": "AI is just the next \"metaverse\" buzzcrap designed to take gullible people's money. Invest in REAL THINGS.", "score": 2, "replies": []}, {"body": "AI bubble getting ready to pop", "score": 2, "replies": []}, {"body": "Microsoft and Apple will both continue to monopolize the S&P market cap. In 30 years Buy n Large will be formed out of Microsoft, Amazon, Apple, and Google.", "score": 1, "replies": [{"body": "MAGA", "score": 3, "replies": [{"body": "Oh shit! I knew Trump was a stooge for Big Tech. MAGA.", "score": 2, "replies": []}]}]}, {"body": "The thing is, google has GENERATIVE AI. Big difference buddy", "score": 1, "replies": []}, {"body": "Microsoft has done a much better job with marketing and communicating. ChatGPT isn't even theirs but they are slapping it on anything they possibly can. \n\nGoogle got caught with their pants down and are now trying to make up for the blunders. I would not count them out and right now, they look like the better investment given how expensive Microsoft is.", "score": 1, "replies": [{"body": "ChatGPT is basically theirs as the biggest investor", "score": 2, "replies": []}]}, {"body": "Lol chatgpt is glorified machine learning hyped for their valuation. Anyone who knows tech knows microsoft fucks everything up.\n\nChatgpt is not a moat, there are so many flavours hitting the market.", "score": 1, "replies": []}, {"body": "AI topic will fizzle out soon just like blockchain / metaverse did.", "score": -4, "replies": [{"body": "I'm glad I'm closer to retirement than the beginning for a career. I get that computers and robots have been taking our jobs for 50 years, but we seem to be at a point where they could just wipe out entire jobs or professions.", "score": 2, "replies": []}, {"body": "It may take a little longer due to the odd fear factor people have of it. A automated response system that confidently gives bad answers 20% of the time has some people quaking for fear it will take over every job next week. Mass hysteria in my opinion", "score": -1, "replies": [{"body": "Its passing the bar lol", "score": 10, "replies": []}, {"body": "I did not factor in fear nor do I fear AI I use it for coding on day to day basis. AI itself has been existent for decades, used in for of various automation. I am just pointing out the AI word being used by every other company for pumping the stocks. MSFT is pumped along with NVDA. I still prefer the vanilla prompt or openai interface any day over bing ai.", "score": 1, "replies": []}]}]}, {"body": ">I agree that Microsoft is a better buy than Alphabet at this point.Microsoft has a clear lead in the generative AI space, and is already preparing to monetize its headstart in AI. Meanwhile, Alphabet is still playing catch-up with its Bard offering.", "score": -3, "replies": [{"body": "I  don't know, they look the same to me but I trust google more for some reason", "score": 0, "replies": [{"body": "GOOGL is still google and has lowest PE of these too big to fail tech. If this fake rally continues then that’s a better bet", "score": 1, "replies": []}]}]}, {"body": "Check out MedPalm 2, Google has some stuff going for it.", "score": 0, "replies": []}, {"body": "Please no\n\nMicrosoft sucks, their products suck and their AI is regarded. The only way they're gonna be able to make this shit work is if they shift ALL their processing infrastructure to a Linux backend (which they are already kinda trying to do out-of-sight) which means any AI software generated by them will be from the same backend as everyone else's anyway. The real bets should be on what keeps those backends running. Microsoft will find a way to make whatever AI program they have suck, somehow", "score": 0, "replies": [{"body": "The MSFT stock trajectory over the past several years certainly does NOT suck", "score": 2, "replies": []}]}, {"body": "Are you shitting me ? MSFT is all display but google has the chops and the data. Google is winning this", "score": 0, "replies": []}, {"body": "U know nft.... AI is same.", "score": 0, "replies": []}, {"body": "Try BARD it’s completely stupid.  ChatGPT is Microsoft it’s awesome", "score": 0, "replies": []}, {"body": "You guys have to play data center players like Arista if you want some of that AI money now.", "score": 1, "replies": []}, {"body": "Annnd they just announced a freeze for all pay raises for 2023 - https://www.bloomberg.com/news/articles/2023-05-11/microsoft-freezes-salaries-to-navigate-economic-uncertainty", "score": 1, "replies": []}, {"body": "Funny how wedbush waited four months before they told people the obvious.", "score": 1, "replies": []}, {"body": "Wet bush", "score": 1, "replies": []}, {"body": "I’m shorting both, it is not going well", "score": 1, "replies": []}, {"body": "Who tf is Wedbush? And why should wsb degens listen to them. Puts on MSFT", "score": 1, "replies": []}, {"body": "You mean Palantir leads?", "score": 1, "replies": []}, {"body": "This is the same Dan Ives from Wedbush who predicted that Tesla would have 25% margins on the most recent earnings and rocket back to $220?", "score": 1, "replies": []}, {"body": "Bard is better .. Hotmail came first , got kicked in the balls by gmail.. ms has a history of fuck ups .. they can be first to any party and go home alone like a geek ( no offense to geeks) but google is the stud .. can be late but will get laid ..\n\nThe true answer here is time to short whoever owns Webusb- cause anyone publishing this garbage needs to be shorted .\n\nAnd Dan , please think about it for a sec.. had Ms been able to beat google at anything in the last decades ? Bing vs google search , hotmail vs gmail … \n\nWhat about all the hot stuff that ms acquired .. I used Skype for years was the top dog then ms brought it and fumbled it . \n\nIf it wasn’t for the monopoly laws in the USA google with have ms lunch in other areas of tech . \n\nCome on Bill , I know you are single now but stop chasing tail for a few minutes and give your boys down at the office some direction .", "score": 1, "replies": [{"body": "Microsoft beating Google handily in cloud services. GCP is a distant third.", "score": 1, "replies": [{"body": "Developers seem to love GCP, but AWS and MSFT seem to have a much better arsenal of tools for all enterprise functions.", "score": 1, "replies": []}]}]}, {"body": "Nice! Can’t wait to get in early on this “Microsoft” you’re talking about", "score": 1, "replies": []}, {"body": "Have you seen Redfall? AI race has already been decided", "score": 1, "replies": []}, {"body": "Got it. PUTS on $MSFT", "score": 1, "replies": []}, {"body": "AI is being overhyped right now.  The problem with AI is the resource cost to compute 1 query is costly at $0.25-$0.40 depending on how many billions of parameters are used.  AI is really a prediction bot algorithm.  Which was primarily used for stock investments.  If you do a chatgpt search fir a question versus a simple google search, they are both satisfactory.  But the difference is that the query only costs Google $0.006.  I predict that AI will be more useful to certain professions as a tool or verification step as this is where each query would be worth more than $0.50 per query.  AI can’t create original content.", "score": 1, "replies": []}, {"body": "My sept 100 calls I bought when google was 93 a share says otherwise I’m up 30k", "score": 1, "replies": []}]}
