{"title": "Lithium supply/demand madness, TSLA, GXY, ALB, FMC,SQM etc, what do you think", "selftext": "[deleted]", "id": "4dao81", "created_utc": 1459769685.0, "score": 20, "upvote_ratio": 0.92, "num_comments": 16, "comments": [{"body": "ALB, FMC, and SQM produce something like 90% of all the world's lithium, but lithium only makes up ~10-15% of their revenues. Which means those companies are much more likely to be affected by other commodity prices. Likewise, Panasonic (Tesla's main battery supplier) has been investigating using Chinese companies (which aren't publicly traded) as their primary source of lithium. To go further, and admittedly it's been a while since I've checked, as far as I'm aware you still can't trade the metal itself on commodity/futures markets. Which restricts you to companies themselves or a lithium ETF like NYSEARCA:LIT. The ETF itself has done very badly over the last 5 years despite the growing demand for lithium. As for the companies, like I touched on earlier, this means that you need to consider the company on the whole and not just lithium producing aspect of them before you consider investing. It's also entirely possible that a breakthrough in battery technology will happen which will make lithium-based batteries obsolete. There will certainly be some time for you to leave the market if/when that happens, but still something that needs to be considered given how quickly things are changing.", "score": 11, "replies": [{"body": "If an ETF focused on lithium can't get it right, what hope do I have as an idiot investor to pick the right company? Probably better I just stay away from it, even though it is a clear growth industry.", "score": 5, "replies": [{"body": "The industry might grow, but new mines are opened and the battery makers get better and better at getting more kWh out of the same amount of lithium. ", "score": 2, "replies": []}, {"body": "Your best bet would be to wait until lithium shows up on commodity/futures markets if you really want to invest in it. Otherwise you can try to find a company that has good fundamentals and has lithium mining as part of its portfolio.", "score": 2, "replies": []}, {"body": "I'm not sure Lithium is going to grow. Lithium batteries are dangerous and transporting them is becoming more regulated and more expensive every year so there's a huge incentive to develop an alternative battery technology. Once a viable alternative is available I wouldn't be surprised to see lithium batteries fall out of use overnight.", "score": 1, "replies": []}]}]}, {"body": "Lithium mining, as with any other commodity, is a cyclical business. Most commodities were in a massive slump in about December and have increased in prices, but not that much really.\n\nProblem with Lithium imo is that there are very big reserves for this metal, some say until the end of the century. Current Gold/Silver mines should however run out already in 10-15 years.", "score": 2, "replies": []}, {"body": "The M3 won't need batteries for awhile. There's time for the supply side to catch up ", "score": 1, "replies": []}, {"body": "any of you had change of heart on lithium yet? check out GXY on the ASX :) ", "score": 1, "replies": []}, {"body": "$LIX.V a Canadian pure play lithium company backed by some big players. (Lithium-X)", "score": 1, "replies": [{"body": "holy fuck is this about to take off or what", "score": 1, "replies": [{"body": "I doubt it.  Here's a summary of some reasons not to invest.\n\nI don't know about the source but I agree with the general thought.\nhttp://www.nanalyze.com/2015/08/dont-invest-in-lithium-mining-companies/", "score": 3, "replies": [{"body": "Check out the price", "score": 1, "replies": [{"body": "Nice.  I'm happy for you guys.  You gonna take your profits while you can?", "score": 1, "replies": []}]}]}, {"body": "Did you see it today?", "score": 1, "replies": [{"body": "No i completely forgot. I was riding up $efl. But might look into this  lix this wknd", "score": 1, "replies": []}]}]}, {"body": "Top holdings are FMC and ALB, so has same problem as underlying stocks, Li is only a minor contributor to revenues.", "score": 0, "replies": []}]}]}
{"title": "WFC, C, BAC", "selftext": "Warren Buffet just increased his stake to 10% of Wells Fargo just last week.\n\nhttp://www.marketwatch.com/story/warren-buffett-buys-more-wells-fargo-stock-on-a-dip-2016-03-29\n\nCitigroup and Bank of America are held in the millions by hedgefund manager Michael Burry, the hedge fund manager from \"The Big Short.\" *The man who yolo'd against these stocks in 2008 is yoloing for them now.*\n\nMy guess is they both expect them to beat EPS.", "id": "4dausv", "created_utc": 1459773121.0, "score": 1, "upvote_ratio": 1.0, "num_comments": 12, "comments": [{"body": "Wells Fargo is an excellent stock for a long investment.", "score": 3, "replies": [{"body": "It's at a huge discount right now. Buffet bought it too early, so you have the opportunity to buy it at a better time than a fucking hedge fund.\n\nIt gives dividends too, which is a privilege you don't get when you buy most shit that pops up on here.\n\nIt's just dropped down from up .3 an hour ago to yesterday's close now.", "score": 2, "replies": []}]}, {"body": "the FED has delayed rate increases the last 2 times. how many more times can they do this before they have to raise it. \n\ni could see BAC jumping from mid 13s to mid 15s in a month with this news being built up and released.\n\nlong term investment these are solid. calls are super cheap too.\n\nfor a yolo, idk about that. it will happen eventually but it might take a bit of time.", "score": 1, "replies": [{"body": "The guy who yolo'd against these stocks in 2008 is yoloing for them now. How could you possibly say that's not a YOLO?", "score": 1, "replies": [{"body": "because hes holding long term :)", "score": 2, "replies": [{"body": "Anything he holds, no matter how long it takes, is the ultimate yolo. Guy's a fucking legend.", "score": 1, "replies": [{"body": "haha\n\nim happy then cuz i own 420 shares of BAC.  \n\nsmoke yolo eeryday", "score": 2, "replies": []}]}]}]}, {"body": "Running $2k worth of calls for BAC, JPM, MS, WFC, and probably C. Most have ER in like a month at most, so I expect a run up leading to ER and a crushing ER for some....", "score": 1, "replies": [{"body": "yo fire. everyone got ER this month gonna be cray. i might do tech plays seems to be the only thing solid with momentum atm.\n\nfb nflx appl googl nvda are ones i am eyeing.", "score": 1, "replies": [{"body": "Running calls for all of those. Last GOOGL earnings, I bought shares at 2:59 and sold them 30 minutes past close. Bought at like 770 and dumped it at 815", "score": 1, "replies": []}]}]}]}, {"body": "I'm picking up calls for all the big banks. WFC, MS, JPM, and so on.", "score": 1, "replies": []}, {"body": "I would say they're only investing betting on low interest rates, but they've no doubt done valuations on them.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "4dbnr3", "created_utc": 1459785076.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 15, "comments": [{"body": "I'm no expert but I think you're late. So no. ", "score": 22, "replies": [{"body": "This is correct.", "score": 6, "replies": []}]}, {"body": "We're about to embark on a news draught for a hype stock, you fucking crazy? I'm looking to unload. Wait until we're getting rumors/articles about phase 2 (hud-google glass-senseye-bullshit-scifi-lidar-overlay?) to load up, but until then we're going down after wednesdays numbers are in.", "score": 7, "replies": [{"body": "It's put time.\n\nI pre-ordered but come on, this bitch is gonna tumble.  \n\nMost likely need to do an equity offering to meet production and this little tidbit:\n\nhttps://twitter.com/elonmusk/status/716709914911989760\n", "score": 1, "replies": []}]}, {"body": "ya were fools for not getting in at 160 in February. It's gonna fall, then I'll get in.", "score": 5, "replies": []}, {"body": "holding it!\nhttp://imgur.com/NUg6NAW", "score": 4, "replies": []}, {"body": "It costs $1,000 to preorder a model 3...I don't think that will transition into over 300k in actual orders and people will realize that soon", "score": 3, "replies": [{"body": "Its been 4 days. Reservations will keep going up. They can't deliver that many cars in one year, they'll be production constrained for years with this kind of interest, even if 50% cancel.", "score": 3, "replies": []}]}, {"body": "Odds are you'd be better off shorting it.  How much higher do you think it can go?", "score": 2, "replies": []}, {"body": "Currently have 80% of my savings in $tsla at 222. ", "score": 2, "replies": []}, {"body": "Id find a dip and invest then, its a good chance it'll pop in May", "score": 1, "replies": []}, {"body": "I'm about to get out at 255. I might see it go up to 260 but not much more. After that it will drop towards 210 in the next couple of months. So yeah, pour 2k into tesla, but make it 2k worth of put options.", "score": 1, "replies": [{"body": "but what reason is there for it to drop?", "score": 1, "replies": [{"body": "It's overvalued for quite some time now. The model 3 release is only pumping it up some more with people getting excited over the ~300.000 deposits and long lines everywhere. If all those deposits turn into orders (which they won't, but people love to drool over the fantasy) than that would mean some 12 billion in revenue for tesla. Tesla's market cap is 30 billion at this time. People are pissing their pants with excitement over that.\n\nThing is: at max capacity Tesla will be able to put out 500.000 cars per year. Definitely not the first year they start production (2017), so even though the demand is a bit inflated, tesla wouldn't be able to produce the cars even if they wanted to. The 300 million (from the deposits) they're getting now is a nice cash influx, but they still will need another round of funding to get the gigafactory up and running.\n\nSo soon everyone will realize they've gotten too excited and the stock is going to drop.\n\nIt will pick up again closer to the \"phase 2\" release of model 3 news, but that's not anytime soon.\n\nSo watch the stock drop. Get in closer to 210 (around summer) and ride the next wave up towards your yacht (around the end of the year). Enjoy.", "score": 1, "replies": [{"body": "Thank you. I think I might just leave my savings in an SPY trust or something till I find something viable to invest in then.", "score": 1, "replies": []}]}]}]}]}
