{"title": "Guys, stop thinking the market is simply a cpi derivative. That's regarded..", "selftext": "CPI is old news. Yes, it was the hot button metric the last couple years, but those days are long gone.\n\nNobody actually cares if the fed cuts or keeps rates flat (hint, they will not raise), they care about more important metrics:\n\nREVENUE GROWTH\n\nThis I'd probably thr number one figure in the market, and it is what everyone was looking at a few short years ago.\n\nSo in summary, tldr, buy calls, obviously. ", "id": "1c0mhig", "created_utc": 1712758098.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 78, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 1281 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Nah. Playing the Fed game has been the market meta for some time now. Fundamentals are a secondary concern.", "score": 51, "replies": [{"body": "Maybe playing the META of the market 🤔", "score": 1, "replies": []}, {"body": "Revenue growth will be solely  inflation driven. It can't even be accurate anyway", "score": 0, "replies": []}, {"body": "To an extent, but they won't raise again, bet anything on that", "score": -30, "replies": [{"body": "Okay, make a ban-bet.\n\n3 months ban if they raise rates before EOY.![gif](emote|free_emotes_pack|trollface)", "score": 27, "replies": []}, {"body": "I’d be surprised if they raised again, but we might see them hold steady for longer than expected. It’s a waiting game, and inflation isn’t the only indicator the Fed is looking at.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Exactly, and just their concern on losing credibility alone would stop that, lol.\n\n&#x200B;\n\nLast time I was right I was getting 60-100 downvotes per comment, and the time I was right before that it was in the mid 100's. Downvotes = good in regard land.", "score": -7, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Haha well the real logic is that upvotes or downvotes is not an indicator for being right whatsoever.", "score": 5, "replies": [{"body": "Just because they won't raise before the election does not mean they won't raise right after. The Fed is concerned about the election, but once it's decided they will do whatever they can to reign in the Bull!", "score": 1, "replies": [{"body": "You are close to right but you fail to see the other levers the fed has and will use way before they raise rates\n\n&#x200B;\n\nraising rates mean they were wrong. they will never admit they are wrong if they can avoid it. Took them two years to admit inflation wasn't transitory and even that they tried to save.\n\n&#x200B;\n\nOther methods:\n\n[https://fred.stlouisfed.org/series/WALCL](https://fred.stlouisfed.org/series/WALCL)\n\n&#x200B;\n\nthis is the method they will use. look at 2016 to 2020 how flat it was.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "CPI and the FED hugely influences the market especially for US stocks", "score": 14, "replies": []}, {"body": "It’s highly regarded!", "score": 11, "replies": [{"body": "![img](emote|t5_2th52|18632)", "score": -14, "replies": []}]}, {"body": "Interest rates rule the markets! Bond markets is bigger than stock market. Money flow or tightness is interest rate controlled mostly.", "score": 4, "replies": [{"body": "So if the huge bond market is selling off, all those released money have to go somewhere to beat inflation. Some will go into commodities, some will go into money market, and some will go into companies with high growth", "score": 4, "replies": [{"body": "Dude high rates is good for bond yields. Bonds keep losing value which means you buy fixed high interest rate at a discount.", "score": 2, "replies": [{"body": "Yields are going higher *because* people are selling treasuries. That's why dollar index is rising. Participants prefer to put money in money market with fed instead of bonds. Either way, at 1 bond auction. May be interesting. Watch IEF, TLT may bounce back", "score": 1, "replies": []}]}]}]}, {"body": "adobe had revenue growth. sold off 25%.", "score": 4, "replies": [{"body": "what was guidance?\n\n\nEdit: Lol bro... future revenue is revenue\nhttps://preview.redd.it/7kmcb6h3hotc1.jpeg?width=1080&format=pjpg&auto=webp&s=46de1b5725bf70d31733b4e00d2ca8bc370341d3", "score": 1, "replies": [{"body": "Lil bro did you not just say \n\n\"more important metrics: REVENUE GROWTH\"", "score": 2, "replies": [{"body": "Yes exactly, guidance is hand in hand with revenue...", "score": -2, "replies": [{"body": "Don’t waste your time arguing with morons adobe is a shit company and a lot of regards got sucked into calls for earnings and cried rigged when guidance was horrible.", "score": 3, "replies": [{"body": "Lmao sometimes it feels like I'm in the upside down world these days...", "score": 1, "replies": [{"body": "But in the end I think your wrong federal reserve rates are literally growth rate for the full economy. No matter how good a company is it’ll fall in contracting market.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "WOMP WOMP to your calls. You chose wrong and now want people to buy calls and bail you out. Lmao.", "score": 12, "replies": [{"body": "FYI one month everything is up, even considering the significant down day today. Thoughts?", "score": 1, "replies": [{"body": "My thoughts are that you're a geek for who cares too much about what people think about you on the web and holds a month-long grudge. Lol.\n\nMy other thought is that I don't care? I day trade, so my trades are based off technical analysis - that means that I go long and short. New concept for you?", "score": 2, "replies": [{"body": "No I did a remindme, so it just triggered today. Not gloating or anything. Genuinely curious on WHY you had so much conviction then vs your thoughts now.", "score": 0, "replies": [{"body": "Because I trade on the daily? And it happened to be that on that day, your calls went to the rock? I'm a day trader, dude.", "score": 1, "replies": [{"body": "I reject that characterization.. you said:\n\n\n\n \"WOMP WOMP to your calls. **You chose wrong** and now want people to buy calls and bail you out. Lmao.\"\n\n  \nI'm saying I was not wrong, but it seems you were applying an assumption I was talking about a one day timeframe?", "score": 0, "replies": []}]}]}]}]}, {"body": "!remindme 1 month\n\nWill you be willing to come back and give some statement on why you were so sure? I keep asking this and noone will :/", "score": -8, "replies": [{"body": "https://preview.redd.it/ttjxxu5qvntc1.jpeg?width=1080&format=pjpg&auto=webp&s=e09d65109479f8d4046895fa224fb56374796551\n\nI'll come back right now instead. Check it.", "score": 8, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "Hell yeah.", "score": 1, "replies": []}, {"body": "Finally someone with a bigger port. What side are you on, up or down in 1 month?", "score": -1, "replies": [{"body": "https://preview.redd.it/n6a216k4uotc1.jpeg?width=1080&format=pjpg&auto=webp&s=72a7faa27fda5276f07f2fd7f3f3128b9a74b308", "score": 2, "replies": [{"body": "Congrats :![gif](emote|free_emotes_pack|heart_eyes)", "score": 1, "replies": []}, {"body": "Now do 1 year", "score": 0, "replies": [{"body": "https://preview.redd.it/cn2q26v1rqtc1.jpeg?width=1080&format=pjpg&auto=webp&s=cda721cddf7eda6dd4e9d8e2f29d2bc6c2f32b70\n\nOk.", "score": 2, "replies": [{"body": "Thought I saw you in another thread say you were down 40% 😂😅", "score": 1, "replies": [{"body": "I thought so too. 😬", "score": 1, "replies": [{"body": "Lmao I promise that’s the only reason I said it, Bulls, Bears, I don’t have a side. I care about myself being green that’s it", "score": 1, "replies": []}]}, {"body": "Ask him to show 5yr then", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I will be messaging you in 1 month on [**2024-05-10 14:17:13 UTC**](http://www.wolframalpha.com/input/?i=2024-05-10%2014:17:13%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1c0mhig/guys_stop_thinking_the_market_is_simply_a_cpi/kyxajoh/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1c0mhig%2Fguys_stop_thinking_the_market_is_simply_a_cpi%2Fkyxajoh%2F%5D%0A%0ARemindMe%21%202024-05-10%2014%3A17%3A13%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201c0mhig)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "We need copium tank aid sent to bulls asap. Stop blocking the aid routes bears!!", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|27421)", "score": 1, "replies": []}]}, {"body": "It’s been a WTI derivative market for like 2 months now", "score": 3, "replies": []}, {"body": "saying regarded is regarded\n\nwe should go back  to the good old daze", "score": 4, "replies": [{"body": "I know it's not like they were ever offended", "score": 1, "replies": []}]}, {"body": "Of course market is not a CPI derivative, it should not be an AI derivative either. AI could drive the market up insanely, any reality punch would drive it down freely", "score": 2, "replies": [{"body": "To be fair the ai is delivering actual revenue", "score": 2, "replies": []}]}, {"body": "Fear and greed.  We barely hit neutral.  Give it 7 sessions", "score": 1, "replies": []}, {"body": "You my friend are wrong here. Bearish sentiment coming back now . Pullback has started your just in denial .", "score": 1, "replies": [{"body": "I always hear that, and sometimes it proves to be right. We will see!", "score": 2, "replies": []}]}, {"body": "This is a very regarded take. Institutional investors move money from equities to bonds if rates are raised or stay high, and visa versa if rates are cut.", "score": 1, "replies": [{"body": "WHEN is the key you are missing.", "score": 1, "replies": []}]}, {"body": "Well, buy calls if earnings continue to come in strong, that I agree with.", "score": 1, "replies": []}, {"body": "You think the Fed is smart, they will raise rates because they believe it will somehow lower rent and insurance (it won’t, high rates cause those to go up)", "score": 1, "replies": [{"body": "Willing to bet anything they won't raise", "score": 0, "replies": [{"body": "You think that the fed is smart, they have shown based on their commentary they are not, otherwise they would know what a simple regard like myself does, that the higher inflation is driven by their higher rates. Otherwise everything not interest rate related would be up, rather than the big drivers this time of insurance and rent.", "score": 1, "replies": []}]}]}, {"body": "Im buying into these dips. This bull isnt dead yet.", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4258)", "score": 1, "replies": []}]}, {"body": "Telling this sub to stop being regarded is like telling a fish to stop swimming.", "score": 1, "replies": []}, {"body": "Buying opportunities.", "score": 0, "replies": [{"body": "![img](emote|t5_2th52|33495)", "score": 2, "replies": []}]}, {"body": "When it's a bullish catalyst, care about it.\n\n\nWhen it's a bearish catalyst, don't care about it.\n\n\nHere's an idea, go stare at your losses and think about what you could of done differently and stop trying to tell us what to do.\n\n\nThe bullish thesis for the last year is that the fed will cut rates. It's WHY the market has been pushing higher. Now the data cones out against this and you want to shift ideas? You're regarded man. If there's no cuts, the market is going to be pissed. End of story.", "score": 0, "replies": [{"body": "https://preview.redd.it/ukp4wchquotc1.jpeg?width=1080&format=pjpg&auto=webp&s=e690556f4fc2d60186491a437a42a24608957bcd", "score": 0, "replies": [{"body": "That's great!\n\nYou got a photo of someone else's account! You should know better than the stupidity of what you're saying.\n\nRevenue growth? If revenue does grow, it'll be because prices are increasing, not because of increased demand. \n\nSo how can you say don't worry about inflation, revenue growth, and it's a proxy for inflation anyway ?\n\nThose numbers in that made up account are probably the number of people who paid you a dollar each to stfu 🤣", "score": 1, "replies": [{"body": ">So how can you say don't worry about inflation, revenue growth, and it's a proxy for inflation anyway ?\n\ntell me to put the line on a date and I will, lol, I can easily prove it is me\n\n&#x200B;\n\nboth would be upward pressure on revenue growth, so you are right you have to dissect why to know the right play", "score": 1, "replies": [{"body": "No, it's not the right play is the point.\n\n\nDaddy Powell also hasn't changed the markets yet, so the ppi tomorrow is the focus", "score": 1, "replies": [{"body": "So what do you think will happen tomorrow? EXACTLY what do you think? Lay out both scenarios if you want, I suspect you will have the wrong outcome with a given series of events.", "score": 1, "replies": [{"body": "That the ppi will come out hot as well. If that happens, the market will price in no june cut/ MAYBE 1 cut this year. If the number hits consensus, it's still not great as the pause will last.\n\nThen we have earnings season kicking off. I believe the numbers will be decent/good because inflation will make it appear better than what it is, but I'm looking forward to tge future guidance which I think many/most tech companies will give lower. Forget the banks, they'll likely show similar results at best .\n\nWhat absolute horse 💩 do you think is going to happen? With you looking at revenue growth, I think you'll get it, and the market will still likely trend lower.", "score": -1, "replies": []}]}]}]}]}]}]}, {"body": "Truly regarded taje", "score": -1, "replies": []}]}
