{"title": "\"Elon Musk Can’t Solve Tesla’s China Crisis With His Desperate Asia Visit\"", "selftext": "\"ELON MUSK WILL be pleased that his surprise jaunt to China on Sunday garnered many glowing headlines. The trip was undoubtedly equally a surprise to Indian prime minister Narendra Modi, who had been scheduled to offer Musk the red carpet on a long-arranged visit.\n\nThe billionaire blew off India at the last minute, citing “very heavy Tesla obligations.” Indeed, Tesla has had a tumultuous couple of weeks, with federal regulator slap-downs, halved profits, and price-cut rollouts. Yet, in a very public snub that Modi won’t quickly forget, the company CEO made time for Chinese premier Li Qiang.\"\n https://www.wired.com/story/elon-musk-cant-solve-teslas-china-crisis-with-his-desperate-asia-visit/", "id": "1cgvgqm", "created_utc": 1714490434.0, "score": 243, "upvote_ratio": 0.78, "num_comments": 78, "comments": [{"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "He's definitely my favorite Kardashian.....", "score": 86, "replies": [{"body": "I don’t like his derrière!", "score": 2, "replies": []}, {"body": "Both know how to make money and that’s all I care about.", "score": -6, "replies": [{"body": "If that's all you care about, you get what you deserve.", "score": 7, "replies": [{"body": "Get money you mean?", "score": 1, "replies": []}]}, {"body": "Pretty sad.", "score": 1, "replies": [{"body": "It’s sad that I’m making money in a subreddit called stocks? Are you serious? Lol", "score": 0, "replies": [{"body": "No, the sad thing is that it's all you care about. Money should be a means to live out interests and not be all you care about. That's a pretty sad view tbh.", "score": -2, "replies": [{"body": "Live out interest? You mean live off interest?interest is one way to make money so is going long or short. Clearly you don’t invest or trade if you assume I’m only going long.", "score": -4, "replies": []}]}]}]}]}]}, {"body": "History has shown being on the good side of CCP does wonder for the company. Apple plays the ball and it contributed 1 trillion dollars mcap to the stock", "score": 80, "replies": [{"body": "CCP's entire thesis is letting the tech leader into their market, using them as benchmark and stealing as much IP as possible. And then once they aren't useful anymore, throwing them away.\n\nApple luckily still has some value to squeeze out so their local competitors like Huawei and Xiaomi can take advantage of Apple's innovation as well as co-opting Apple's supply chain inside China.\n\nWe'll see how it goes with Tesla. I fully expect Baidu to try to suck Tesla's FSD IP as much as possible while they are \"partnered\" in China. China already sucked everything useful out of Tesla's physical Electric Vehicle architecture. Chinese companies like BYD can make EVs cheaper and more efficiently than Tesla. All that's left is FSD.\n\nEdit: This is in no way an investing suggestion to short Tesla stock. I don't have any position in Tesla. FSD news can be a positive catalyst short term. Just making a comment about the potential long term implication.", "score": 75, "replies": [{"body": ">can take advantage of Apple's innovation\n\nHonestly there aren't many these days. Apple's research is lagging behind other big techs.", "score": 25, "replies": [{"body": "Apple's processors are cutting edge. Will be interesting to see if they have an answer for on device AI at the conference.", "score": 9, "replies": [{"body": "lol 😂 cutting edge", "score": -15, "replies": [{"body": "Their m chips is cutting edge , da fuck you mean . 3nm chipset is literally the latest innovation of human history commercialized in the chip space at this human history moment \n\nAre you ignorant or just a poor troll contrarian ?\n\n/u/Maddog351_2023", "score": 10, "replies": [{"body": "that's TSMC's innovation, wtf?\n\nARM is ARM's.", "score": 3, "replies": []}]}, {"body": "No intel cpu comes close to Apple silicon.", "score": 1, "replies": [{"body": "lol 😂", "score": -2, "replies": []}]}]}]}]}, {"body": ">CCP's entire thesis is letting the tech leader into their market, using them as benchmark and stealing as much IP as possible. And then once they aren't useful anymore, throwing them away.\n\nHe only needs to make it to the vote. Elon Musk abandoned any semblance of long term thinking at least a year ago.", "score": 18, "replies": [{"body": "Baidu already had their own self driving program even before the Tesla \"partnership\" on FSD. A risky move for sure.", "score": 10, "replies": []}]}, {"body": "Apple today’s problem is Apple and not CCP/China issue.\n\nApple has no innovation and no new products - just an over priced product for what it is.\n\nAll for the share holders.", "score": 5, "replies": []}, {"body": ">like Huawei and Xiaomi can take advantage of Apple's innovation\n\nOh do tell us more. What \"innovation\" does Apple have and the Chinese want?", "score": 11, "replies": [{"body": "ARM Processor chip technology.", "score": 3, "replies": []}, {"body": "No one said the Chinese want it. The CCP wants it. U a racist", "score": -10, "replies": [{"body": "You’re getting downvoted, but it’s so true that people need to separate the CCP from the Chinese people.", "score": -1, "replies": [{"body": "They need to separate themselves first. They are a very nationalistic country. The people there believe that when you say something bad about the CCP your are saying it about China. They don't know how to separate the two. They're brainwashed and fucked.", "score": 1, "replies": [{"body": "Little pinks are a vocal minority. They are only strong because the government backs them. Every day more and more Chinese people rebel against their opressors. See Li Keqiangs grave, so many people leave flowers for him everyday since his death that the government has banned leaving flowers for him. All he did was say that change will come regardless of the red factions efforts and he was killed", "score": 1, "replies": [{"body": "The majority of the people I work with are young PRC and they are def pro PRC and not afraid to tell you. I don't know if they are the majority or minority but they are def not a small minority.", "score": 1, "replies": [{"body": "No one who has legally come outside of china since xi jinpings second term is anti-prc. The students and workers on visas are hand-picked to represent the party and are held accountable to party laws even overseas as part of his demented strategy. Beyond that they travel the world virtually for free. They are the direct beneficiaries of nepotism; they would never betray the ccp because they believe they are above their fellow constituent.", "score": 1, "replies": [{"body": "> are hand-picked\n\nI totally get what you're saying and I know that this is a common thought. But that's very hard to believe as a lot of them look to me like degenerates and imbeciles and would never be picked by anyone for anything, let alone a decent student or decent employee of any sort.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "lol. As u said if ccp is really that evil why don’t Tesla built a factory in the democratic country like India😂. The fact that musk choose shanghai tells anything", "score": 6, "replies": [{"body": "Maybe because the average person in the democratic country you’re talking about can barely afford a scooter\n\nAnd China is the leader of renewable supply chains\n\nObviously other reasons too. But India is not ready for Tesla yet outside of manufacturing, China is still the better hub. Especially if you go back to when Shanghai plant was built, if that was India instead Tesla never would’ve seen the numbers they did.", "score": 5, "replies": []}]}, {"body": "Don’t you think India has same motivations?", "score": 2, "replies": [{"body": "Maybe, maybe not. India definitely can't pull it off with a quarter of the thoroughness and competence that China could and does.\n\nAnd that is a good thing that will keep India in the running despite its many logistical problems.", "score": 3, "replies": []}, {"body": "Nah. I'm Indian and Indian governance is too focused on absolute asinine issues and staying in power vs establishing any form of technological edge against the global markets.", "score": 1, "replies": []}]}, {"body": "Let’s not pretend it’s anything other than a quid pro quo. Apple and other companies know full well the risks but they accept them in exchange for access to one of the largest consumption markets in the world.", "score": 1, "replies": []}, {"body": "He’s a good representative for them though, he’s attracted a following on the right and has complimented China on multiple occasions, it’s probably worth it for them to throw him a few bones to keep up the good PR since Chine is not popular with the right, moderates, or left in the US right now", "score": 1, "replies": []}]}, {"body": "> being on the good side of CCP does wonder for the compan\n\nAbsolutely, at least until they get what they want out of you. Probably not the smartest to piss off India in the process if you can help it though.", "score": 5, "replies": []}, {"body": "There isnt a chinese Apple. There is however a chinese version of Tesla. (Byd)", "score": -3, "replies": [{"body": "What do you call Huawei", "score": 16, "replies": [{"body": "That’s more like great value version of Samsung", "score": 2, "replies": []}, {"body": "He is being wilfully ignorant. Apple is there to create eco system that benefits the rest of the cell phone makers. Tesla will be kept there to force the innovation", "score": 2, "replies": []}]}, {"body": "Lol 😂 simple search will show how ignorant you are", "score": -5, "replies": [{"body": "> will show how ignorant \n\nOK Tesla Lord 69.", "score": 5, "replies": [{"body": "Ok wann_be", "score": -7, "replies": []}]}]}]}]}, {"body": "Those soon to be expire out of money Tesla puts bags must be heavy.\n\nThe IV gang is wining", "score": 57, "replies": [{"body": "Leaps gang totally ignoring short term pump aimed at the dumb money.", "score": 6, "replies": []}, {"body": "Tesla bag holders: \"No YOU'RE the bag holder\"", "score": 14, "replies": []}]}, {"body": "Pedo!", "score": 8, "replies": []}, {"body": "This is just Elons latest bullshit PR stunt to manipulate his crashed stock. Just like the Robo taxi. Elon is the the biggest bs artist out there", "score": 30, "replies": [{"body": "DJT leadership slithers out of the chat…", "score": 7, "replies": []}, {"body": "User is an active participant in r/ magacultcringe. I'm sure your opinion on tesla and Musk are in no way political 🙄", "score": -9, "replies": [{"body": "I bet your defense of Musk isn't either. I'm sure that's definitely not why you dug through their post history so you could make this comment.", "score": 8, "replies": [{"body": "Correct. But not being an idiot, I am able to see obvious patterns and call them out when appropriate ", "score": 0, "replies": []}]}]}]}, {"body": "Tesla may go up in the short-term, but the company has no future with Elon as CEO. He’s destroyed their consumer base and uses the company as his personal bank account.", "score": 3, "replies": [{"body": "> Tesla may go up in the short-term\n\nIt's THE worst performing stock in the S&P500 this year. The jump after his pump was just a blip.", "score": 2, "replies": []}]}, {"body": "I was shocked how dumb wall street rewarded a terrible Q for Tesla just b/c Elon was selling smoke n mirrors", "score": 6, "replies": []}, {"body": "« i’m the most knowledgeable about logistics, on the face of the earth right now » ———> 3 delays cybertruck….\n\n« We’ll be on mars next year » every year.\n\n« If I feel lonely, then everyone must feel lonely »\n\nThis delusional ass thought he could just fly over China and get his flicker sucked.", "score": 5, "replies": []}, {"body": "FSD isnt gonna save dwindling sales.", "score": 2, "replies": [{"body": "Low gas prices and high interest rates are the only thing that effect sales at this point", "score": 1, "replies": []}, {"body": "What’s the time horizon for FSD again? At this point, I’m a disbeliever. If it was solveable someone would’ve done it already, but it’s gone as far as current tech allows and became a pump n dump buzzword a long time ago. Elon etc peddling promises..", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "BYD is the best-selling car brand in China.\n\nBYD sold 219,500 vehicles between April 1 and 28.\n\nTesla’s total sales for the period between April 1 and 28 were 28,080 units.\n\nTesla market share went down from 10% to 6%.  Lost revenue and profit in China.\n\nBYD grew by 4% revenue and 10% profit.", "score": 9, "replies": []}, {"body": "lol what? Not even close. Tesla isn’t even in the top 10. \n\nTesla WAS at one brief point ranked high but ONLY IN THE EV category, but that was quickly overtaken by BYD again recently. \n\nIn overall car brands, BYD and Volkswagen are usually the top 2, BMW, Geeli, Toyota, etc dominate. \n\nThe best selling Tesla, the Model Y, is ranked 6th overall. \n\n2023:\nhttps://carnewschina.com/2024/01/12/top-selling-car-brands-in-2023-in-china-byd-surpassed-volkswagen-and-won-the-championship-for-the-first-time/\n\n2024: \n\nhttps://carnewschina.com/2024/02/08/top-selling-car-brands-in-january-2024-in-china-vw-overtook-byd-to-become-no-1/", "score": 4, "replies": []}, {"body": "https://en.wikipedia.org/wiki/List_of_best-selling_automobiles_in_China\n\nDoesn't appear to be even on the list of top sellers, even if you scroll down to only EVs.", "score": 1, "replies": []}, {"body": "Tesla's not a car company dummy it's a self driving software company. And America won't allow that on public roads in the next decade so he needs someone to ~~steal~~ permit a large scale deployment of the technology ", "score": -9, "replies": [{"body": "> Tesla's not a car company dummy it's a self driving software company\n\nNo no, it's an AI robot company - just search for \"Elon Musk unveils plan for 'Tesla Bot' with man dancing in a bodysuit\" on YouTube (r/stocks doesn't like YT links)", "score": 8, "replies": []}, {"body": "[deleted]", "score": -5, "replies": [{"body": "\"Full\" \"self\" driving", "score": 2, "replies": []}]}]}]}, {"body": "You simply can't spin this as bad news, OP. It's why the stock jumped up 15% in one day, not the other way around.", "score": -5, "replies": [{"body": "r/stocks anti Musk bias based purely on politics is hilarious at this point. Idiots need to go buy Biden Bonds or something. ", "score": -2, "replies": [{"body": "Musk has a ton of straight business-based reasons to not like him.", "score": 3, "replies": [{"body": "That's weird, because I never hear them. It's just endless comments about not wanting a tesla because Musk vocally supports meritocracy and border enforcement and sacrificed 44 billion to pull back the curtain a bit on left wing censorship at Twitter. ", "score": 1, "replies": [{"body": "FSD this year bro. I promise bro.", "score": 1, "replies": []}]}]}]}]}, {"body": "Shorts crying up a storm after this week. Things not going to plan eh!???", "score": -11, "replies": []}, {"body": "Bahahaha shorts kill me. These FUD opinion pieces are hilarious. LOOOK GUYS “QUOTES”", "score": -12, "replies": []}, {"body": "It seems like many American top officials have been going to China with hat in hand lately😂", "score": -4, "replies": []}, {"body": "Chinese customers have more money this isn't a mystery", "score": 0, "replies": []}]}
{"title": "Bears Only-please don’t bother us here Bulls", "selftext": "[deleted]", "id": "1ch4vs6", "created_utc": 1714513738.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 78, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 1841 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1c8y5gy/its_time_to_short_blackrock_blk/) \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "https://preview.redd.it/xki8kvootoxc1.png?width=1275&format=png&auto=webp&s=0743cb6a164cbcc6df6b273b31965e9ebd5156f0\n\nSPX 1872-2024\n\nStudy.", "score": 3, "replies": []}]}, {"body": "[removed]", "score": 24, "replies": [{"body": "Don’t sell a single share of your stock. Keep it all in the market.", "score": -12, "replies": [{"body": "Why is this downvoted? Take the advice if you’re a permabull.", "score": -2, "replies": []}]}, {"body": "Tell me. What were the statistical odds on a rolling 1-year basis that SPY would be at $524 on March 28th, 2024?", "score": -8, "replies": [{"body": "That's the thing though. The market is irrational. No matter what your \"Algo\" says, chances are it's wrong. In fact it's probably wrong *because* it's right lol.", "score": 4, "replies": [{"body": "Sure I get your point. But algos trade based on probability and statistics, combined with search engines that pick up keywords to trigger buy and sell orders.", "score": 0, "replies": []}]}]}]}, {"body": "Technically: I’ll post the chart below\n\nwhere's the chart you goddamn regard", "score": 6, "replies": [{"body": "I posted it in the comments", "score": 2, "replies": [{"body": "Um, no, you didn't. But realistically, this probably works more in your favor", "score": 2, "replies": [{"body": "I give technicals little weight.\n\nhttps://preview.redd.it/tn3stbpb9pxc1.png?width=1275&format=png&auto=webp&s=c20390e0a29f9013c709242f1f52819edfb0982f", "score": 1, "replies": [{"body": "But there is a clear retracement  of the ‘08 low hitting the middle line, and the 00 and 22 highs hitting the top line.\n\nBlack Monday even settles at the middle line.", "score": 2, "replies": []}]}]}]}]}, {"body": "Unbelievable this market, amzn, SMCI and AMD, all 3 gave good reports and all 3 stock down heavily. My calls are fucked", "score": 4, "replies": [{"body": "Same here only 1 call for SmCI with 4 weeks of life but it’ll be killed half way from the Theta cancer", "score": 3, "replies": []}, {"body": "Brother, the macroeconomic events are rewarding bond holders and killing stockholders right now. What was once thought to be 7 cuts from the Fed is down to maybe none and that is the anchor which had attached itself to the current stock market. This won’t fix itself quickly but tomorrow Powell may telegraph in a nuanced way his plans for the rest of the year. Until a clear picture is made clear it’s gonna be ugly.", "score": 3, "replies": []}, {"body": "Amazon guidance for next quarter is shit. Earnings moves aren’t about last quarter so much as about guidance. That’s why Amazon is down.", "score": 2, "replies": [{"body": "100% this is not an Amazon issue it’s a macro issue", "score": 3, "replies": []}]}, {"body": "I don’t think we’re retesting highs from here.\n\nI think this was it…for about the next 40 years.\n\nMake money on the way down, if you can. I suggest using multiple brokerages, because some will go under (especially Hood lol)", "score": -6, "replies": []}]}, {"body": "RemindMe! 3 months", "score": 4, "replies": [{"body": "I will be messaging you in 3 months on [**2024-07-30 22:01:50 UTC**](http://www.wolframalpha.com/input/?i=2024-07-30%2022:01:50%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1ch4vs6/bears_onlyplease_dont_bother_us_here_bulls/l20758c/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1ch4vs6%2Fbears_onlyplease_dont_bother_us_here_bulls%2Fl20758c%2F%5D%0A%0ARemindMe%21%202024-07-30%2022%3A01%3A50%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201ch4vs6)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "bump... ya me too   50% is a bit much.... maybe 25%  and we go sideways for the next 10 years,   either way the 'empire' is bust and the glory days of being a super power are over for USA", "score": 0, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}]}, {"body": "Following the old formula on my spreadsheet: market crash, then a war, THEN lambo.", "score": 3, "replies": []}, {"body": "I think seeing SBUX lose today was a big indicator that the recession is here.  Working class joes and shmoes never wanna stop drinking their caramel frappes unless they absolutely have to.  Retail is feeling the heat of Biden’s regime.", "score": 6, "replies": [{"body": "People getting pissed off and not buying Starbucks because they jacked all their prices through the fucking roof is not a recession indicator. Unemployment is.", "score": 5, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Inflation went up because of printing.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I wasn't arguing that. Spending has not gone down. It's gone up. Massively. Spending has gone down on frivolous bullshit like sugarcoffee.", "score": 1, "replies": []}]}]}]}]}, {"body": "Nah that’s shit has too much sugar, and is overpriced most of the drinks you can make at home with better ingredients. It’s not that deep I don’t think, chipotle is doing well which is why I think this", "score": 1, "replies": []}]}, {"body": "Wen homie ?", "score": 2, "replies": [{"body": "Velocity is difficult to predict. \n\nThat’s why I will continue to inject $850 a month into the BKNG trade alone.", "score": 1, "replies": [{"body": "I’m def buying PTON calls then", "score": 2, "replies": []}]}]}, {"body": "Nah everything is gonna be fine in the next 3 months. No geopolitical boiling over causing a banking cataclysm expected here.. \n\n(Currently holding cheep deep puts on spy and multiple banks for June/July 🥸)", "score": 2, "replies": [{"body": "Check out BKNG. They’re my bankruptcy special.\n\nNegative 7 billion dollar book value\n\n120 billion market cap\n\nOver 30 P/E\n\nSeptember puts at 1600 were about $100 a pop, with a 1600 bagger potential.\n\nThat is, $100—> $160,000", "score": 2, "replies": [{"body": "explain why they would be bankrupt when they are generating $7 billion in EBITDA", "score": 2, "replies": [{"body": "Because the consumer is cashed out, and when they go to raise capital, the banks are going to laugh them out of their office.\n\nLiquidity crunches = less easy money being divvied out.", "score": 0, "replies": []}]}, {"body": "!remindme 2w", "score": 1, "replies": []}]}]}, {"body": "RemindMe! 3 months\n\nHoly shit this guy is delusional spy $250 in 3 months?! I cant wait to come back here in 3 months to laugh at this regarded 🌈🐻", "score": 3, "replies": [{"body": "I said no bulls.\n\nMove along.", "score": 6, "replies": [{"body": "So we breaking all time highs, when are we seeing $250? Id love to buy @ $250", "score": 1, "replies": []}]}, {"body": "Cause we’ve NEVER seen it drop 50% in three months…\n\nNever 😂😂😂", "score": 3, "replies": []}]}, {"body": "Is that like a pattern reading algorithm?", "score": 1, "replies": [{"body": "It’s mainly Frequency Distributions of all ranges, along with volume comparisons—-the data is better in recent years, because it’s overlaid with VIX functions. However, I have the ability to isolate VIX functions as well to the very day. \n\nThe days at the peak that were happening had approximately a 0.2% chance of happening (their ranges were so low)…and the fact that we were at 524 on SPY had a 0.32% chance of happening. All signals pointed to a combination of currency hyperinflation and consumer buying elation. \n\nI also hit a 20 bagger on TSLA. That’s the only stock I picked upside on, and I won. I sold last Friday though, could’ve hit a 100 bagger.", "score": 2, "replies": [{"body": "Would love to have a try on that prog. What’s it called ?", "score": 1, "replies": [{"body": "Not to sound like a boomer, but I did it the dumbass way using Excel functions. I find it easier to read the output.\n\nNot a professional programmer.", "score": 3, "replies": [{"body": "That’s dope.. we use excel at work.. is it like a pivot table ? We use those a lot.. not very accurate thou", "score": 1, "replies": [{"body": "So when I started, I didn’t know how to use pivot tables. I learned them later in my Econ courses.\n\nI carry the belief that while the market is driven by buying and selling, the algos use statistics to determine their entries and exits…so why not me too?", "score": 1, "replies": [{"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}]}]}]}]}]}, {"body": "So what, I have like 10 algorithms and they're all super cool", "score": 1, "replies": [{"body": "Where can I acquire a copy of?", "score": 1, "replies": []}]}, {"body": "A banbet is nice but how about some positions? Come on, put some money on it if your algorithm is some magic formula.", "score": 1, "replies": [{"body": "Puts on HYG a couple days ago. Bought the $75 strike puts for May 24th for like $2 apiece.\n\nSo I’m short corporate bonds, treasuries, indexes, and a litany of shitty stocks. BUT I’m not all-in. I was faked out in December of 2022 bigtime, so I do consider we could see another fakeout.\n\nEither way, it seems that the Media is finally starting to change their narrative. Heck, even Stephan A started changing his narrative.", "score": -2, "replies": [{"body": "So when you say short treasuries. Ex. Short TLT?", "score": 1, "replies": [{"body": "Shorts. Meaning, I own puts.\n\nI won’t do margin, because margin opens me up to infinite risk.\n\nPuts however, I can only lose what I paid for them.", "score": 1, "replies": []}]}]}]}, {"body": "I’m sorry but it doesn’t make sense American companies are still doing very well", "score": 1, "replies": [{"body": "That is because the American Consumer is stupid, and maxes out their credit cards.\n\nThe fact that Starbucks is down…it’s over.\n\nThat means the white girls stopped getting their overpriced coffee, and that means their cards are maxed out.", "score": 4, "replies": [{"body": "They’re still overpaying for lukewarm Chipotle burritos though. Everywhere I go is packed with people spending money. K shaped recovery and puts on stuff poor people buy like McDonald’s, dollar stores, etc.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "No, not end.\n\nBut I absolutely consider a vast amount of unrest if the market tanks, and it’s important to be prepared.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}]}, {"body": "Remindme! 3 months", "score": 1, "replies": []}, {"body": "u/[BAGross85](https://www.reddit.com/user/BAGross85/)\n\nHave you considered structural breaks in your time series? Which is due to structural breaks in the economy and consumer behavior where it's really NOT possible to go back to a state we exited in the past?\n\nI think you should shorten horizon and your current midpoint to top line should be total width and then derive a midpoint line from there.\n\nI'm not saying couldn't be right but the drop is unrealistic. However I do keep rolling 100 VIX calls every quarter to the next quarter.", "score": 1, "replies": [{"body": "Well, we would’ve thought that when we had automobiles…and yet, still had the Great Depression", "score": 1, "replies": [{"body": "Automobiles are one thing but the sum of changes recently or at the rate new things were invented surpassed the period before it. \n\nSince you have everything ready why not for shits and giggles draw up the lines like I mentioned above and show us what it looks like. Please regard!!!", "score": 1, "replies": []}]}]}, {"body": "Care to share your algorithm?  I'd love to see it.", "score": 1, "replies": []}, {"body": "You'll see ww3 before you see a crash like that", "score": 1, "replies": []}, {"body": "!remindme 2w", "score": 1, "replies": []}, {"body": "Don’t worry about the haters..I don’t have a fancy algorithm, but the crap is crashing before end of year.  I’m just a noob at all this puts and calls bs, but writing is on the wall for the market, any tips for a guy wanting to short the market", "score": 1, "replies": [{"body": "Bankruptcy specials pay out the most on Puts. The price of the options do not reflect the event that it goes to zero, rather it looks back in history at the moves the option has made at the current IV levels.", "score": 3, "replies": []}]}, {"body": "![img](emote|t5_2th52|51295)", "score": 1, "replies": []}, {"body": "He said no Bulls, and the Bulls are downvoting this.\n\nBulls, leave.", "score": 1, "replies": [{"body": "The bulls have been gored.", "score": 3, "replies": []}]}, {"body": "I’ll buy your special ed helmet", "score": 0, "replies": [{"body": "!remindme 12 months", "score": 1, "replies": []}]}]}
