{"title": "Why Tesla's market share in China will go to zero - their brand image has been destroyed", "selftext": "", "id": "1cbxgf6", "created_utc": 1713963309.0, "score": 35, "upvote_ratio": 0.68, "num_comments": 75, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 4 days ago\n**Total Comments** | 9 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Chinese here. \n\nI'm not sure Tesla's Brand Image is \"destroyed\", diluted is a better term. \nI still know people who'd buy an Tesla. But Tesla is nothing special anymore. One electric car company among others. And the brand is nothing special either. \n\nWhy buy a Tesla if you could get BYD, Nio, Porsche, VW? \n\nSome simply prefer Chinese cars (due to price, better localization or patriotic reasons).\nThose who want a luxury foreign car can simply go for Porsche or Mercedes. \nWhat niche does Tesla fill? \n\nI live in Europe and drive a Tesla, but honestly I don't see how in todays marketTesla has a superior product. It's good, but others are good too. I think my next car might very likely not be a Tesla.", "score": 80, "replies": [{"body": "Sorry, hold my hand up, it was just clickbait title.  Exaggerated but the point is not untrue.\n\nRight, Tesla fills no market segment.  They are no longer luxury and can't compete on price.  Still quite a lot of Musk fanboys in China.  Maybe that is it.", "score": 3, "replies": [{"body": "So what you are saying is musk himself is reason for his company’s downfall? Because of his stupid antics?", "score": 2, "replies": [{"body": "The company didn't fall. It just did not (yet) reach those crazy expectations (delusional). \n\nThe idea that all other car companies (with backing from countries) will leave the whole cake to Tesla was IMHO just not realistic", "score": 2, "replies": []}]}, {"body": "I think it's sort of false to say Tesla was every a luxury brand. \n\nIf anything, it was the first to mass market evs at a rate viable to the upper middle class. \n\nCompare a Tesla S to a BMW 5 or Mercedes E class or Lexus LS. \n\nAll of them are just better places to sit in. Tesla does compete with its domestic counterparts like Ford, Chevy, and GM when it comes to fit and finish. \n\nTesla does still have an advantage with its charging network, highway assist, and mobile app support. Plus it's great in 0 to 60, but that novelty wears out quick for the most part. \n\nOnce the Koreans and Germans get EV factories in America, Tesla will have an even MORE difficult time to convince consumers to choose their brand over the other guys. \n\nOh and Elon Musk is an absolute deranged man at this point.", "score": 0, "replies": []}]}, {"body": "You don’t have FSD v12. I only drive 1% of the time now.", "score": 1, "replies": [{"body": "Lot of companies have similar level of autopilot now.", "score": 1, "replies": [{"body": "Like who?", "score": 1, "replies": [{"body": "From my own experience:\nIn China Huawei does well now. \nIn Europe Mercedes etc.\n\nIn NA I never drove. \nForm what I heard companies have different strength.", "score": 2, "replies": []}]}]}, {"body": "Why own a car then?", "score": -5, "replies": [{"body": "Really? Your IQ is that low, huh? lmao", "score": 0, "replies": [{"body": "Why own a car you dont want to drive then? Answer the question dont be a coward.", "score": 0, "replies": [{"body": "Convenience? Long commute times? Traffic? Seek medical attention. lmao", "score": 1, "replies": []}]}]}]}]}, {"body": "We have to think. What other car brand has both luxury and economic vehicles? None.", "score": -9, "replies": [{"body": "And they are not the best at either. Plus, if you're a luxury brand you don't want to have cheap models as that dilutes the value of the luxury brand.\n\nTesla was a great thing when it came out, it was way ahead of competition and they pretty much alone are responsible for the push towards electric in the last decade (whether that is good or bad is irrelevant).\n\nBut today major manufacturers have mostly caught up, and Tesla really doesn't have much that makes it stand out no matter what parameter we look at. It's not a luxury brand as Mercedes, BMW etc.. offer more luxurious EVs. It's not a cheap brand as chinese companies offer cheap EVs, along with traditional manufacturers like Renault. It's not marked with the best quality of assembly either.. and really, it's hard to say \"I want Tesla because it's better at \\_\\_\\_\\_\\_\\_ than anyone\".", "score": 10, "replies": [{"body": "Yeah exactly. Diluting your brand is a killer. Look at the big fashion brands for recent repeat examples.", "score": 2, "replies": []}]}, {"body": "All of them. Proper luxury car brands like Mercedes, BMW and Audi have a €250,000 price difference between their most expensive car and their cheapest.", "score": 2, "replies": [{"body": "Price gap isn’t indicative of mass market economic vehicle.", "score": 0, "replies": [{"body": "Each of these brands sell 20x Tesla across all price points. Stop talking gibberish.", "score": 1, "replies": [{"body": "Volume of sales is not relevant to this topic.", "score": 0, "replies": [{"body": "Then go look up what mass market means", "score": 1, "replies": [{"body": "I think you are lost. The original comment was: \n\n\n> We have to think. What other car brand has both luxury and economic vehicles? None.", "score": 0, "replies": [{"body": "This is a ridiculous statement. There are dozens of brands that make luxury and economic.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "It’s quite simple:\n\n- welcome Tesla in to build factories\n\n- learn as much as you can about their assembly and technology\n\n- copy it\n\n- slowly (or quickly) cast them aside\n\nIn China it’s Communism 1st, Capitalism 2nd (or later).\n\nNever will the PRC allow Tesla to be big there. Uno reverse card still yet to be played", "score": 46, "replies": [{"body": "Yeah, not sure why Elon thought this was ever going to be a good idea.", "score": 10, "replies": [{"body": "Because the Shanghai factory saved Tesla.  They gave them loads of incentives to set up there.", "score": 9, "replies": [{"body": "Was a double edged knife for sure.", "score": 3, "replies": []}, {"body": "Was the margin on Shanghai production much higher than Fremont?", "score": 1, "replies": [{"body": "Read the new York Times article A Pivot to China Saved Elon Musk. It Also Binds Him to Beijing. By mara hvistendahl, Jack Ewing and John liu", "score": 1, "replies": [{"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Elon will be fine. I'm more worried about the peasants stealing my toilet paper.", "score": 1, "replies": [{"body": "Yes 55 billion more fine whilst his shareholders get rinsed. Lol.", "score": 1, "replies": []}]}]}]}]}, {"body": "Tesla being a hit in china was the catalyst which drove its share price to rocket to moon", "score": 3, "replies": [{"body": "I’m pretty sure it sky rocketed before Shanghai.", "score": 1, "replies": [{"body": "No. It wasnt doing as good as it was doing. When news came out about tesla being a massive hit in china with their sales was when it started ramping up like crazy", "score": 1, "replies": [{"body": "Well, I suppose it's a good thing *someone's* wealthy, though I doubt those gains will stick.", "score": 1, "replies": []}]}]}]}, {"body": "95% of all iPhone, iPad, earbuds etc. are made in China. Has been that way for a very long time and Apple is still king of that market", "score": 6, "replies": [{"body": "Refer to point 4 of the above comment. Huawei and Xaomi have been slowly stealing Chinese market share for a while.", "score": 3, "replies": []}, {"body": "On reddit you generally tend to criticize china and call them thieves. Please stick to the propaganda. Dont make common sense points pls", "score": 5, "replies": []}, {"body": "They’re not tho. Most, definitely not every single.", "score": 1, "replies": []}, {"body": "Not indefinitely given the -15-20% demand drop we just saw due to clones.", "score": 1, "replies": []}]}]}, {"body": "bewildered edge market political amusing roof sparkle yam terrific punch", "score": 3, "replies": []}, {"body": "But in America people praise overseas and drop dhit on made in US products.", "score": 1, "replies": []}, {"body": "Tesla has been quite self-destructive, though. Especially with an unstable CEO at the helm who alienated half of his user base.", "score": 1, "replies": []}, {"body": "Unfortunately that’s China’s modus operandi. Then they cry when they get 10 percent of the backlash.\n\nOne of the reasons I just don’t want to invest there.", "score": -2, "replies": [{"body": "I’m sure the chinese economy will cripple without your investment", "score": 3, "replies": []}]}]}, {"body": "Does that mean stonk go up?", "score": 5, "replies": []}, {"body": "I never would’ve expected that the analyst from China market research group isn’t bullish on American EV’s", "score": 3, "replies": [{"body": "Well, I mean, who is bullish on Tesla?  Tesla's market share has dropped in every region.  EU, US, and China.\n\nTesla's market share in China has dropped from 10% to 6%.  This month sold barely any cars in China.\n\nThe video explains it well.  Tesla was seen as a status car.  When you drop your price like that, you destroy your brand image.\n\nThe Chinese love status goods.  When you make it cheap, you lost your market.  They can't compete on price either, so what does Telsa have left?", "score": 4, "replies": [{"body": "Market share isn't the proper stat you want to look at when Tesla was the only player. Obviously theyre going to lose market share.\n\nYou're either not smart or trying to be manipulative", "score": 1, "replies": [{"body": "Apple didn't lose market share.  They absolutely dominated in China until this quarter.\n\nThe EV market has grown in China. Tesla is selling less cars in China.  BYD is selling more.  It is not just their market share is shrink but they are actually selling less cars in a growing market.  That is why their earnings report was so horrible.  The next one will be worse, and you will see it is not a blip.  They are in terminal decline.", "score": 1, "replies": []}]}]}]}, {"body": "https://preview.redd.it/dyyfe5i3vfwc1.jpeg?width=1170&format=pjpg&auto=webp&s=596c367d6af26fd39f3987f0a769b7d6486d1d87\n\n“Why are ya ghey?”", "score": 1, "replies": []}, {"body": "This should pump Tesla to a 300 PE ratio", "score": 1, "replies": [{"body": "Put your money where your mouth is and show us your trade.  Haha.", "score": 1, "replies": [{"body": "lol I don’t trade meme stocks. Not my forte", "score": 1, "replies": [{"body": "Yes, Tesla is a meme stock.  In the long run, which to be fair could be very long, it will go to its true valuation and it's not going to be PE300 lol", "score": 1, "replies": []}]}]}]}, {"body": "Even if the brand image wasn't tanking, eventually China is going to recognize the risk of foreign tech. Because you know, that's what they've been doing.\n\nXi doesn't want a million teslas on the road, all with wireless capabilities and self driving features, if they got into a war where the US might want to take advantage. \n\nObviously there's a larger gap between the US govt. and corporations than there is in China. But it's still a potentially huge security risk. To be clear, I don't think Tesla/Musk would ever allow the US govt. to use its fleet in a foreign country as a weapon, but it's not technically impossible.", "score": 1, "replies": [{"body": "That and if they can't sell china car here, why are teslas there?", "score": 5, "replies": [{"body": "Is there a ban on Chinese vehicles in the US? All ive heard is they are throwaway garbage/imitation vehicles. Not like they would be able to compete if true.", "score": -1, "replies": [{"body": "There is no ban but a 27.5% tariff on Chinese EVs", "score": 3, "replies": []}]}]}, {"body": "Correct.  There is a concerted effort in China to destroy tesla brand image and make it look like consumers simply prefer BYD.   It’s over for Tesla in China.  They had a nice run.", "score": 2, "replies": [{"body": "If you position your car as upmarket, you destroyed brand image by lowering your prices.  BYD was never a status brand.", "score": 2, "replies": []}]}, {"body": "It isnt true.  There are lots of jobs that will be lost in the Shanghai factory.  \n\nNot only that they would also want to continue to have access to Tesla tech.  When you are in China, you give up your tech.  There won't be any risk because the Chinese government would have access.  Lol.", "score": 1, "replies": [{"body": "The gigapress company, supposedly from Italy, is actually owned by a Chinese entity. \n\nBYD is a battery supplier (mainly) like CATL. As an engineering director, I’ve been using li ion batteries for at least 20 years which were sourced from China rather than Japan when Sony batteries started catching fire (anyone not born yesterday will remember those incidents). \n\nThe bottom line is that if you want top quality batteries today, you source them from China. From a safety perspective, their lower density lithium phosphate batteries are actually a game changer (and Tesla uses them as well). And now, they (BYD) are working on sodium batteries which will NOT require blood minerals anymore.\n\nAnd, let’s face it: EV’s are basically batteries on wheels (although some people claim they’re computers on wheels).\n\nIf you focus on “batteries on wheels”, you get affordable electric cars (like BYD’s Sewgull). Unfortunately, Tesla is focusing on the “computer on wheels” idea and that’s not what the market needs. \n\nMost people use the computer that they carry (cell phones) in cars for navigation and music and it’s a matter of time before manufacturers link up the car’s parameters from the CAN bus to display things like tire pressure, climate settings etc on to the phone.", "score": 2, "replies": [{"body": "Well, I, for one, would NEVER hope you get hit by a bus.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Thank you, this is the main reason why BYD is so cheap.  They used to be a battery manufacturer.  Their progress in battery tech is advancing so rapidly. It is only now Tesla is trying to bring battery in-house, but they should have done that ages ago.", "score": 1, "replies": []}]}]}, {"body": "Thinking musk have anything to say if a full scale war breaks out 😆", "score": 1, "replies": []}]}, {"body": "Not that important", "score": 0, "replies": [{"body": "Yeah, Tesla only generates 33% of its revenue from China.  Who cares.  It's just worth 3 pay packet for Musk.", "score": 2, "replies": []}]}, {"body": "What bullshit is this. Some segment of the Chinese market worship western/American brands. Tesla will\nGive thought competition to Chinese producers. Not everyone is after pricepoint advantage", "score": -2, "replies": [{"body": "That has been changing for a while now.  It is also why Apple isn't doing well in China either.\n\nThat is the thing.  The best thing for Tesla to do was not to lower prices and play the status card in China.  Once Tesla start lowering their prices, they lost since they can't compete on price.", "score": 2, "replies": [{"body": "Come on Apple will always hold like 5% market share in China. This is sufficient and present opportunity to grow.", "score": 2, "replies": [{"body": "Apple is very popular in China.  But this Q1 Apple shipment in China has dropped 19%.  It is now neck and neck with Huawei when Huawei was barely a mobile company once it got sanctioned.", "score": 1, "replies": []}]}]}]}, {"body": "$path Uipath good entry UiPath, Inc. is an enterprise automation and artificial intelligence (AI) software company. The Company is principally focused on building and managing automations and developing computer vision technology.", "score": -1, "replies": []}]}
{"title": "Meta short ", "selftext": "This is what I'm seeing. We have a large gap to fill from 452 to 407. I don't see meta putting up expectated numbers. We could use a healthy 17% pull back to fill that gap before continuing up. \n\nPosition: 50 contracts for April 26th 400P for 0.37 a contract. \n\nI hope this prints. Lost lots on meta previously and I had a massive flood in my house today. Praying to the stock gods today. \n", "id": "1cc2mbl", "created_utc": 1713976124.0, "score": 57, "upvote_ratio": 0.87, "num_comments": 88, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 20 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Congrats, enjoy the new house and fuck you", "score": 33, "replies": [{"body": "Those puts will be worth $0.00 Friday 4pm.", "score": 0, "replies": []}]}, {"body": "Buy closer to the money to at least give yourself a chance.", "score": 20, "replies": [{"body": "400p is crazy lmao, with a 2dte", "score": 12, "replies": [{"body": "holy fuck, he was right", "score": 18, "replies": [{"body": "That is crazy bro AHHAHA IT WAS on point", "score": 8, "replies": []}, {"body": "would have made more money with 420p or 440p", "score": 6, "replies": [{"body": "true but profit is profit, whoever, if anyone bought 420/440p hopefully they post tomorrow, gonna be nutty gains", "score": 6, "replies": [{"body": "I have a 440p. Playd 550c and 440p strangle ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Praying to the gods, are you? My advice: sell your house and buy a tent.", "score": 48, "replies": [{"body": "Based. EMBRACE HOMELESSNESS!", "score": 7, "replies": []}, {"body": "Seconding VM here.", "score": 1, "replies": []}]}, {"body": "Big red candle!", "score": 13, "replies": [{"body": "You are still gonna lose money from IV crush.\n\nI guess this is a good lesson on how not to play earnings.", "score": 9, "replies": [{"body": "How would you have done it? Different expiry?", "score": 1, "replies": [{"body": "Yes, with that strike price\n\nBut you may still be ok if the PCE data on Friday Is not good", "score": 2, "replies": [{"body": "I plan on closing tomorrow morning", "score": 1, "replies": [{"body": "I don't think you will lose money OP. B/E Price is like 20c less than strike. If it opens at 400 expect gains", "score": 1, "replies": []}, {"body": "I bet each option will be $2-$3 at open tomorrow despite a huge IV crush. still a 10-bagger.", "score": 1, "replies": []}, {"body": "Absolutely close tomorrow morn, no later than 10am.", "score": 1, "replies": [{"body": "Yeah the crush will kill it. Thank you", "score": 2, "replies": [{"body": "How much you make?", "score": 1, "replies": [{"body": "8k, 17.5k over two accounts. I had 100 contracts over accounts. I'll take it. Wasn't what I was expecting. I was hoping for 40k. But I made a couple of errors to learn from.", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "Options market expecting +/- 50 move by Friday…. Even with IV crush you’ll be fine", "score": 1, "replies": []}]}, {"body": "You positions are too small, I have 600 contracts waiting to print", "score": 9, "replies": [{"body": "Dude, how are you feeling?", "score": 6, "replies": []}, {"body": "Just testing it out. First time playing earnings.", "score": 3, "replies": [{"body": "You realize for that your position to come to fruition Iran would have to attack multiple Meta datacenters right?", "score": 8, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)", "score": 3, "replies": []}]}]}, {"body": "Think we good? I'm not sure what iv or theta will do to me", "score": 4, "replies": [{"body": "400 +/- 5% and you’ll have some time value left. Outside that range and it’ll basically be all intrinsic value.", "score": 2, "replies": []}]}]}, {"body": "Aged like fine wine", "score": 8, "replies": [{"body": "I just hope I have some money left after IV and theta.", "score": 4, "replies": [{"body": "15% drop and implied earnings move was 7%. You should be good", "score": 1, "replies": []}]}]}, {"body": "Legendary, stuff like this is why I follow WSB", "score": 8, "replies": []}, {"body": "Hope you realize you are basically putting $3000 on a single number of the roulette wheel…", "score": 5, "replies": [{"body": "Forget about a number, 400p is $50 OTM. This drooler put $150 on the casino getting shot up while he spins the wheel", "score": 4, "replies": [{"body": "He’s half way to in the money and the conference call hasn’t started…I’m rooting for him.", "score": 1, "replies": []}]}]}, {"body": "How did you arrive at \" large gap to fill from 452 to 407. \"?", "score": 3, "replies": [{"body": "From the daily chart", "score": 3, "replies": []}]}, {"body": "congrats", "score": 3, "replies": []}, {"body": "dude your put will be in the money if meta keeps drilling", "score": 3, "replies": []}, {"body": "# Well played sir.", "score": 3, "replies": []}, {"body": "https://preview.redd.it/63vaf5m6fiwc1.png?width=215&format=png&auto=webp&s=95ce0e4af76911c5c877a14ce1e30e696c21d4f5\n\nYou're looking at anywhere from $23,000+ - $44,000 on your $1,500 yolo play on META sir.  \nWell played and hope you get to fix your house (:\n\nP.S. DO NOT BE REGARDED AND SELL ASAP at open...", "score": 3, "replies": [{"body": "Thank you", "score": 2, "replies": []}]}, {"body": "3.5% profit probability![img](emote|t5_2th52|51295)", "score": 2, "replies": [{"body": "So you are saying there is a chance?", "score": 2, "replies": []}]}, {"body": "$META #earnings after close, the expectation from the WhisperNumber community is $4.34, 29c ahead of analyst estimates. Earnings came in $0.32 ahead of the whisper last quarter. 66% beat rate. Implied movement +/-8.0%.", "score": 2, "replies": [{"body": "Updated whisper number now $4.59", "score": 1, "replies": []}]}, {"body": "I’m just trying to make sure everyone here is going Puts so I can buy Calls with confidence.", "score": 2, "replies": []}, {"body": "let 'em cook![img](emote|t5_2th52|29637)", "score": 2, "replies": []}, {"body": "Shouldn’t have bought so OTM. So pointless. Could’ve had some good gains without the effects of theta and IV.", "score": 2, "replies": [{"body": "Sounds like a loser.", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}]}, {"body": "Closed them out this morning. Profit of 8k. Not the 50k I was expecting, but I'll take it.", "score": 2, "replies": [{"body": "still nice, kind of surreal how on point you were though...\n\nnext position youre eyeing? ;)", "score": 1, "replies": [{"body": "I'm seeing a possible PayPal call for earnings at a 70 strike and amd 175 for may 3rd.\n\nI'm not as confident in them as meta. PayPal has a gap to fill on the daily from 68.23-72.43. Is a small gap. I may just wait for the next opportunity.\n\nGoing forward with gaps, I won't pick the extreme, I'd pick a strike about 2/3rd through the gap if that makes sense.", "score": 2, "replies": [{"body": "Honestly. The gap is too small. I'm sitting on my hands", "score": 2, "replies": []}, {"body": "Honestly. The gap is too small. I'm sitting on my hands", "score": 1, "replies": []}]}, {"body": "Honestly, the gap play is too small. I'm sitting on my hands", "score": 1, "replies": []}, {"body": "I might take 5 contacts of amd 170 call today for earnings.", "score": 1, "replies": [{"body": "bought 2 calls for the same, would buy more but put a bunch into aapl thank you bro", "score": 1, "replies": [{"body": "Not looking good.", "score": 2, "replies": [{"body": "The market is on fire…. Damn.", "score": 1, "replies": []}]}, {"body": "I'm going to wait til about 3:55pm to put them in. Picked a strike closer to the money. Learned from last time. I can see amd moving up though.", "score": 1, "replies": [{"body": "can i get your opinion on aapl earnings?", "score": 1, "replies": [{"body": "I got nothing. No idea", "score": 2, "replies": [{"body": "Wish me luck, 5/10 exp 175c &\nMight be putting some puts into UPS, insanely cheap and I feel earnings are going to be bad", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Buy the real time market data🙄", "score": 1, "replies": []}, {"body": "Meta dropping down to 400 in 2 days is wild ![img](emote|t5_2th52|4267)", "score": 1, "replies": []}, {"body": "Taking a 2nd look at this. On one hand, last earnings there was a 20% increase in price following Q4 call, near $100 increase in price. Earnings have to be really bad for it to go down that much but seeing as how NFLX tanked....\n\nOn the other, META could announce that they intend to pursue TikTok purchase from ByteDance...", "score": 1, "replies": [{"body": "lol gg", "score": 3, "replies": []}]}, {"body": "as long as meta stay below 455 you are guaranteed in profits yeah whoever sold you that option now they know what is picking pennies in front of a steamroller![img](emote|t5_2th52|4267)", "score": 1, "replies": []}, {"body": "That 17% correction prediction is spot on but to make it profitable the strike price would have had to be a bit further out.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267) congratulations and fuck you", "score": 1, "replies": []}, {"body": "400?? it got to 405ish, but damn you got everything right except the strike price.  Don't sleep in tomorrow!  Good luck, as these can still print.", "score": 1, "replies": [{"body": "I think it bounced off of 400. Big support zone.", "score": 2, "replies": []}]}, {"body": "Nice you made at least 20-25k.", "score": 1, "replies": []}, {"body": "Zero", "score": 1, "replies": []}, {"body": "Sir this is a wendys", "score": 0, "replies": []}, {"body": "Gonna expire worthless, and that app UI is dog shit terrible.", "score": 0, "replies": []}]}
