{"title": "(Reuter; Caliber study) Would-be Tesla buyers snub company as Musk's reputation dips. Tesla's stock dipped 6% after missing deliveries by 70k.", "selftext": "", "id": "1bu5dxl", "created_utc": 1712080839.0, "score": 232, "upvote_ratio": 0.86, "num_comments": 86, "comments": [{"body": "Turns out alienating your primary consumer base has consequences?\n\nHmm 🤔 \n\nLooking into this 🧐", "score": 86, "replies": [{"body": "Concerning…", "score": 17, "replies": []}, {"body": "You know free speech vs free will.   I wouldn’t drive one of the Elon Nazimobiles either.", "score": 0, "replies": []}, {"body": "teslas sales have zero to do with elon.  as much as you all want it to be so.  this title is porn for the elon hate.  it’s bc china, europe, and us are buying less vehicles.\n\nthis is only making tesla stronger.  you see everyone else will go bankrupt, while tesla has the strongest balance sheet in the world behind only google.  so they will take market share in huge amounts whenever these economies rebound.  \n\ntitles went from evs blow up, to tesla loses money for every car, to tesla is dropping prices constantly, elon hurting tesla sales, then tesla needs to be broken up bc theyre a monopoly.\n\nbut im glad you think this article is a true reflection of tesla and has zero to do with the auto industry", "score": -2, "replies": [{"body": "Spot on spot on", "score": 2, "replies": []}, {"body": "That balance sheet isn’t nearly as strong as you think and inventory inhaled cash this Q", "score": 2, "replies": [{"body": "lol you think 1 quarter breaks a balance sheet.  we arent talking about your tough night at a casino", "score": 1, "replies": [{"body": "They haven’t generated positive cash flow from operations in consecutive quarters now. They will be burning thru the shit coin reserves now. Not broken. Bleeding", "score": 1, "replies": []}]}]}]}]}, {"body": "How fucked am I holding tesla?", "score": 46, "replies": [{"body": "The board of directors is aware of Elon’s mouth. They are obligated to address it, or resign", "score": 20, "replies": []}, {"body": "Yes", "score": 36, "replies": [{"body": "Yes", "score": 4, "replies": []}]}, {"body": "As long as you believe the stock will always go up!", "score": 3, "replies": [{"body": "And remember, stocks can go up a million percent or more. But they can only fall 100%", "score": 13, "replies": []}]}, {"body": "at least 2", "score": 3, "replies": []}, {"body": "concerning...", "score": 6, "replies": []}, {"body": "It will go back to its all time highs in 15-20 years or so.  \n\nUntil then enjoy!", "score": 4, "replies": [{"body": "Well thats not reassuring at all", "score": 4, "replies": []}]}, {"body": "Sell….", "score": 5, "replies": []}, {"body": "Not at all. If you've been holding for any real amount of time,  you should know that this isn't even the top 10 worst times for this stock.", "score": 3, "replies": [{"body": "Toyota has outperformed TSLA for three years now and it’s the worst in the S&P 500", "score": 2, "replies": [{"body": "Why stop at 3 years? Check 5 years. Check 10 years.  Tesla IPO'D at $1.2 about 15 years ago. It's $165 now.", "score": 0, "replies": [{"body": "Because the free money days are long gone for Tesla. Hasn’t grown now in years and is active tanking. Hasn’t come close to the all time high in 2021 meanwhile the competition has out performed like BYD.", "score": 3, "replies": []}]}]}]}, {"body": "Pretty fucked. TSLAs run is over and the only way it can go up is more members of the quickly shrinking cult", "score": 1, "replies": []}, {"body": "There's meme aspects to this stock. It's still a great company though. Question, is it a tech company? 2024 will be bad for Tesla, 2025 might be different?", "score": 1, "replies": []}, {"body": "We’re in a period of fear regarding Tesla right now. You could succumb to it and sell if you really believe the fear is warranted, or you could note that when others are fearful, it may be the best time to be greedy. Up to you, really. Do you still believe in the thesis of Tesla, i.e. FSD and autonomous robotics? If so, this fear based on missing car sale expectations is likely temporary FUD. If not, get out!", "score": -2, "replies": []}, {"body": "All in puts!", "score": -1, "replies": []}]}, {"body": "The other issues is even without Musk. It’s not as he puts it … the best car.\n\nThere’s way too many people showing off horrible defects and stupid issues that makes the cars look cheap and unreliable.\n\nWhich has tarnished the image the company has as a luxury brand.", "score": 35, "replies": [{"body": "There are half a dozen multi-trillion dollar industries that Tesla is shaking up. \n\nOf course they are going to astroturf out “opposition”.\n\nIn real life I only know one person who has ever switched away from Tesla after owning one.", "score": -19, "replies": [{"body": "In real life I don’t know a single person who has ever owned one.", "score": -1, "replies": [{"body": "I know 12 personally. 1 had to sell due to financial reasons (I don’t count that) and 1 sold to get a Jeep for off-roading, I do count that.", "score": -1, "replies": [{"body": "I don’t believe you. Tesla fan boys are so weird. He’s not gonna let you smash bro.", "score": 1, "replies": []}]}]}]}]}, {"body": "I have two friends that did buy other EV because of his shit", "score": 36, "replies": [{"body": "A Jewish friend of mine also switched from (leased) Tesla to another EV due to Elon's anti-Semitic remarks.", "score": 1, "replies": [{"body": "I buy Chinese EVs due to their exemplary human rights record", "score": 5, "replies": []}]}]}, {"body": "In my opinion Musk is as much asociated with Tesla, as Jobs was asociated with Apple. And Musk becoming right wing nut is directly effing buyer base of Tesla.", "score": 44, "replies": [{"body": "I’d say Musk more so. Also, the political environment wasn’t nearly as toxic when Jobs was around. There were issues, sure. But most people weren’t nearly as political or passionate as they are today.", "score": 18, "replies": []}]}, {"body": "Honestly it’s insane that the company hasn’t pivoted to a full time CEO. At the project / fund building stage Elon was perfect. But it’s about time somebody ran the company as a full time job.", "score": 9, "replies": []}, {"body": "I don't know why any company would choose to play in the dirt; get into politics. Other companies seem to be dragged into it by their employees, but with Tesla it's the CEO needlessly, aimlessly and directionlessly doing it.", "score": 15, "replies": [{"body": "Elon viewed it as the right wasn’t buying EVs so maybe that would change if he joined that side.", "score": 1, "replies": []}]}, {"body": "I'm very solidly in that category of buyers that would likely get a Tesla if Musk weren't profiting from it", "score": 28, "replies": [{"body": "oh im sure you would", "score": -7, "replies": []}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "what's your thesis? that's a massive drop! is it that Tesla should get a car company's multiple? I don't think it will ever do. But it's not a tech company either, at least for now.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "How many Rivians were sold last quarter?\n\nI think you’re just seeing the same one driving in a circle. \n\nTeslas margins are still very high. They are setting a trap for the competition. Tesla can be profitable at $35k while the other lose money priced at $45k.", "score": 1, "replies": []}]}]}, {"body": "Me too. I'm biding my time. Once at 60, I'll be going in.", "score": -3, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Ev competition in China and Europe, definitely. The USA, not as clear yet. The traditional automakers said they were going to go all in on electric over the last few years but it appears they have dialed back that message. As for the Chinese EV cars, not sure how much of a market penetration they will get if allowed to enter the American Market as Chinese Goods are perceived to be cheap and unreliable. That being said, we are still in the early adoption curve on EVs and anything can happen.", "score": 3, "replies": []}]}, {"body": "It’s not easy to turn around and have a second go at things.\n\nThe only example I can think of is Apple. And that was because of the iPod. \n\nAnd it’s easier to make a comeback when your product has a large target audience due to the price of the device\n\nTesla sells very expensive cars and I’d think people would be less likely to change their mind about them.\n\nTesla’s issues aren’t just the brand damage done by musk…\n\nBut, also widespread reports of quality issues and issues with customer service.\n\nEven if they had a new CEO due to the issues I hear of people having with quality and bad quality control… I likely wouldn’t consider one.", "score": 1, "replies": [{"body": "the brand has high loyalty as the article points out. But I see your point. It's mostly a dip in demand regardless of Musk, but Tesla had its watershed moment already, I wouldn't bet against Tesla long term. It's a great company.", "score": 1, "replies": []}]}]}, {"body": "Tesla will always be here.  Don't fret.  \n\nYour valuation seems very plausible and I would argue, quite probable.", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I agree.\n\nMost of the hype was based around AI nonsense and the man with no muzzle out and said that he couldn't work with Tesla with AI.  \n\nTheres nothing here but a car company.  And their cyber trucks are a huge flop and terrible.  \n\nTesla is going nowhere.  The stop price I think will continue to fall.", "score": 0, "replies": []}]}]}]}, {"body": "A lot of people assume that he’d appeal to right leaning folks.\n\nThat’s not necessarily true either.\n\n\nFirst off, not all republicans want to wear and advertise their politics.\n\nSecondly, I’d argue that he represents controversy and instability.\n\nBecause he’s not right leaning but bonkers.\nHe told a room full of his former supporters and people he needs to make his business thrive to go fuck themselves.\n\nAnd he’s a laughing stock for having promised so much vapourware that it’s laughable. \n\nHis brand is compulsive liar who can’t help but want to be edgy.\n\nHe acts like a giant man child.\n\nEven if I agreed with some of what he says. It wouldn’t be worth advertising that to the world that I bought one of his products.\n\nIt definitely doesn’t appeal to that many rich conservatives to associate with controversy.", "score": 6, "replies": []}, {"body": "[removed]", "score": 7, "replies": [{"body": "I got out before Christmas. Trust me life is so much better not having to worry about Elons mood swings.", "score": 9, "replies": [{"body": "Fuck me good call. Wish I did the same", "score": 1, "replies": [{"body": "Better late than never. Unless they sack Elon tomorrow I only see it going one way.", "score": 2, "replies": []}]}]}]}, {"body": "yep, as a current modely owner (great car) i'm going back to volvo as my next car eventually.", "score": 2, "replies": []}, {"body": "The other issues is even without Musk. It’s not as he puts it … the best car.\n\nThere’s way too many people showing off horrible defects and stupid issues that makes the cars look cheap and unreliable.\n\nWhich has tarnished the image the company has as a luxury brand.", "score": 3, "replies": [{"body": "I've to disagree on this one. Among EVs, Tesla is king.", "score": -3, "replies": [{"body": "Even if that’s your personal experience there are a crazy number of videos making fun of the quality out there. A well respected review recently said the gaps on the cybertruck were the worst he’d ever scene on a car.\n\nI’ve heard enough horror stories to make me stay away from the brand.", "score": 5, "replies": []}, {"body": "https://www.reddit.com/r/TeslaLounge/s/4auiTwBw1A\n\nA thread in a pro Tesla sub amazed at how bad FSD is.\n\nMost companies wouldn’t be so brazen in claiming things like Elon has about FSD.\n\nThe dude has said it’s just a legal issue that it requires someone.\n\nWhen I hear that… and then these reviews… why would I trust my safety to a company who obviously doesn’t have that as a priority.", "score": -1, "replies": []}]}]}, {"body": "I cancelled my order mainly because of this A hole. Also because of poor assembly quality", "score": 5, "replies": []}, {"body": "Count me in. I would have bought a Tesla already and haven’t, and won’t, because specifically because of Musk.\n\nAnd to him I say (as he said) “go fuck yourself”.", "score": 2, "replies": []}, {"body": "Musk politics aside i just dont trust the build quality nor do i trust the software reliability.", "score": 2, "replies": []}, {"body": "Shorting the hell out of tesla right now, I wonder if it will dip below 150", "score": 2, "replies": [{"body": "When it goes below 150 look out below.", "score": 1, "replies": []}]}, {"body": "I honestly can’t believe it only dipped 6% on those terrible earnings and outlook", "score": 2, "replies": []}, {"body": "As it turns out, being a fucking weird dude and firing your PR team in 2020 is not the wisest of choices after all", "score": 2, "replies": []}, {"body": "And the number of people interested in buying Teslas in the future is 50% less than it was a year ago.", "score": 1, "replies": []}, {"body": "It will go back up, as usual.  Just wait for the next short squeeze.", "score": 1, "replies": []}, {"body": "messiah complex", "score": 1, "replies": []}, {"body": "This goose is cooked.", "score": 1, "replies": []}, {"body": "Thanks for the discount... buying more 😎", "score": 2, "replies": [{"body": "If you're a longterm investor, that's smart. Strip away all the noise and it's a great company. But 2024 will be a tough year, that's their guidance, or their semblance of one, Musk needs to man up in his earning calls, don't let speculators take over, own it. Uncertainty kills me.", "score": 2, "replies": [{"body": "I feel like all car sales will be taking a hit after the tax refund buying spree. It's still cheaper to buy new than used right now, but a lot of people won't have the disposable income they had, and $5,000 A to B cars will be what they want later in the year. To me, Tesla still has the most competitive price for EV, and even the Elon haters want to save money. 😆", "score": 0, "replies": []}]}]}, {"body": "It's crazy how much the reputation of Elon Musk and Tesla has fallen in such a short amount of time. People were all Tesla this, Tesla that a few years ago.", "score": 0, "replies": [{"body": "yep. shows how much power the media has. which is probably why he was so passionate about getting their influence out of twitter", "score": 1, "replies": []}]}, {"body": "Before 2020, a Tesla was my dream car.  Couldn't wait for the day when I could afford to buy one. Now, I can afford it but there's not a chance I will buy one.  And Elon Musk behaving like a jackass is the reason why.", "score": 1, "replies": []}, {"body": "Lol buy a fisker", "score": 1, "replies": []}, {"body": "I am exactly the type of buyer suited for Tesla, and instead I have two EVs from another maker.\n\nWhilst Elon owns any part of Tesla, I cannot own one.", "score": 1, "replies": []}, {"body": "So they’re not moving the random parking lots full of dead teslas I’ve been seeing", "score": 0, "replies": []}, {"body": "A friend of mine commented the other day that part of the issue is that Tesla has \"become\" a car company. For years it's been viewed as a tech firm that made cars but now that the metrics applied to other auto manufacturers are being applied to Tesla it's affecting the stock price.\n\nThe stock price has dipped because institutional investors lost confidence in the stock (for a whole host of reasons) not because or Joe or Jane down the street don't like Elon anymore (even though that's one of the host of reasons mentioned previously).", "score": 0, "replies": []}, {"body": "You cannot trust Reuter, they lied so much and continue to lie so much it’s crazy. They twist everything and slander who they want to slander.", "score": 0, "replies": []}, {"body": "[removed]", "score": -9, "replies": []}]}
{"title": "(Reuters) the two biggest Disney shareholders, Vanguard w/ 8.2% & BlackRock w/ 6% voted for Iger making proxy contest unwinnable for Peltz.", "selftext": "***Source***: *https://www.reuters.com/business/media-telecom/norges-bank-investment-management-backs-disney-board-room-fight-with-hedge-funds-2024-04-02/*\n\nNEW YORK, April 2 (Reuters) - Walt Disney's (DIS.N), opens new tab largest investor, Vanguard Group, on Tuesday voted to elect the entertainment giant's incumbent directors, allowing the company to pull further ahead in a bitter boardroom fight with two hedge funds, sources told Reuters.\r  \nThe decision by Vanguard, which owned an 8.2% stake in the home of Mickey Mouse at the end of last year, comes just hours before the deadline for a shareholder vote that will guide the future of one of the world's largest entertainment companies. Vanguard was not immediately available for comment.\n\nEarlier on Tuesday Norges Bank Investment Management, said it had voted to re-elect 11 of the entertainment company's 12 directors.\r  \nThese key endorsements added to Disney's momentum before a Tuesday night deadline for shareholders to decide whether to back Chief Executive Bob Iger's slate of current directors or five alternative candidates proposed by hedge funds Trian Fund Management and Blackwells Capital.\n\nThe contest is the most closely watched boardroom clash in the United States this year, serving as a referendum on the future of the century-old Mouse House as it navigates the entertainment industry's shift to streaming.\r  \nNBIM, which manages the Norwegian Government Pension Fund and owned a 1.2% stake in Disney at the end of last year, said it had voted to re-elect nearly all company directors but withheld its vote for Mark Parker, chairman of Disney's board.\n\nIt did not vote for any candidates proposed by Trian or Blackwells.\r  \nDisney did not immediately respond to a request for comment on the vote tally.\r  \nWhile many of the outstanding votes have been cast, people familiar with the tallies said there were still some investors who had not voted but that there was still time before results are announced at the company's annual shareholder meeting on Wednesday, which will stream live at 1 p.m. EDT (1700 GMT).", "id": "1budscf", "created_utc": 1712101420.0, "score": 580, "upvote_ratio": 0.95, "num_comments": 79, "comments": [{"body": "Peltz serves himself and no one else. Disney has had issues but Peltz won't solve them.", "score": 322, "replies": [{"body": "No doubt. I was at dupont when he gave them a hard go. Things pretty much got worse due to his involvement. Thanks Nelson.", "score": 74, "replies": []}, {"body": "Peltz serves himself, Ike Perlmutter and his untalented kids.", "score": 45, "replies": [{"body": "David Beckham’s son’s wife checking in", "score": 19, "replies": [{"body": "he took his wife's last name too!", "score": 11, "replies": []}]}]}]}, {"body": "Great. Boo Peltz. He fundamentally does not understand the company.", "score": 172, "replies": [{"body": "He thinks woke is a problem. That all you really need to know about how much of a moron this dude is on trying to solve actual problems within Disney. Dude would want Disney to cut things that have already been cut far too much. He is even worse than the current board. These short term gain pieces of shit suck if you are a long term fan of anything.", "score": 112, "replies": [{"body": "Absolutely. They’re trading the health of the Disney brand for short term gain.", "score": 41, "replies": [{"body": "It just amazes me how short term gains have actually encouraged these morons to raise prices instead of expanding when actual demand for their product in parks and experiences are so high, which are the cash cow of the company. They take 5 years to build a ride because they have all sorts of construction inefficiencies, some of which are intentional.\n\nWhen you raise prices so much you are just going to give away marketshare to competitors. It might be not easy to see on paper as someone decides to take an alternate vacation. It might show up on paper as your main competitor building a whole new park because you are greedy fucks.\n\nSeriously universal  was going to put Nintendo world in one of the existing Orlando parks. Plans changed fast when they decided Disney was fucking up so much on expansion and cost they had the confidence to build an entire new park themselves.\n\nDisney stans tell me that disney will still be fine and will still make tons of money and of course they will, but if I am a long term investor I am going to be pretty pissed off about the cash cow of the company even allowing their main competitor to build a new park because they didn't want to expand.\n\nNot to mention the smaller park universal is building in Texas and Halloween area in Vegas. If not a minor profit these with push people towards the larger parks and more expansion.\n\nThis is a high margin industry for premium vacations at this point. Imagine if you told investors you would rather cede demand to another high margin competitor than build out a high margin product. These people are some of the dumbest fucking people when you look at it in simple terms. \n\nAs a long term investor you need real growth in actual product available at some point. I think now the rumored park expansion plans are because they know Disney plus is limited at least in the next few years on price raises to account for what they are spending even with cuts.", "score": 37, "replies": [{"body": "Having spent time talking with some senior imagineers about what goes into a ride in the park, 5 years is a fast turn around.  They are generally inviting new tech for new rides, they have ridiculous safety standards, and since each ride is a full experience and not just a line to a coaster, all of that experience had to be curated.  And then you run into interesting issues about build into and around existing  spaces.  The one that stuck out to me the most was on seven dwarfs mine train, the they had a lot of changes going back and forth in the track design becuase they had sidewalk width constraints. They would havr issue where they needs half a foot more space 1 direction to accommodate the drop and it wouldn't fit so they changed the peak or location of the start of the drop which ripples back through the whole design.  And finally you have a design that hits all your elements that fits exactly in your space, then you have to construct it with minimal interference to the attraction around it.  WDW is a collection of engineering marvels.", "score": 1, "replies": []}]}, {"body": "Health of the Disney brand? Have you seen Disney recently its sentiment is at all time lows. Under Iger it’s not healthy at all", "score": 12, "replies": [{"body": "Which is what I just said in agreement about the current board. But Peltz is not the answer.", "score": 18, "replies": []}]}]}, {"body": "Woke is not a problem, but its an issue that creates problems for Disney", "score": 2, "replies": [{"body": "You contradicted yourself.", "score": 5, "replies": [{"body": "No i didnt", "score": 1, "replies": []}]}, {"body": "Woke isn't a thing, it's a mental ghost created to cater to the incels and other fragile rightwing losers. It's a catch all phrase that can mean litterary *anything but a straight, white, racist American male*. Everything else from cars to colours can be \"woke\", it is  idiotic", "score": 0, "replies": []}]}, {"body": ">He thinks woke is a problem.\n\nSounds like he knows exactly what's the problem with entertainment industry.\n\nESG funds have abysmal return which should tells you everything.", "score": 1, "replies": [{"body": "Lmao. Disney is not an esg fund. There is a reason South park made fun of the mouse as a soulless piece of shit.", "score": 7, "replies": [{"body": "Do you even know what an ESG fund is lol. It's a private equity investment index fund which invest in project by evaluating ESG rating as a primary investment thesis. They fund everything from carbon capture company to entertainment company. Basically soulness company go woke to access these cheap investment and fucked up their short term revenue in the process. This happened across every industry so ESG fund has abysmal ROI.\n\nSo yes wokeness is the problem.", "score": -3, "replies": [{"body": "No, being soulless is the problem, like you just argued. Wokeness for capitalism sake is just a symptom.", "score": 3, "replies": [{"body": "Expecting publicly traded company to be anything but soulless is naive lol\n\nEven if they wanted to do the right thing they can be sued by other investors.", "score": 2, "replies": []}]}]}]}]}, {"body": "Woke IS a problem. It might not be THE problem. But it's still a problem. Making sure you give the upward middle finger to half the population in every movie and streaming show you create is not good business.", "score": -9, "replies": [{"body": "The fact you think a Disney movie that doesn’t have a straight white protagonist is somehow a middle finger to you IS exactly why those “woke” movies need to exist.", "score": -6, "replies": [{"body": "Because Disney was designed to promote cultural change? It seems to me its purpose is to entertain. And make money. And it damages both of those purposes when it puts out multiple movies without 'straight white protagonists'. The ridiculousness of putting out a string of marvel and disney movies and streaming shows with unattractive female protagonists when your audience is known to be 75% male is beyond my understanding.", "score": 2, "replies": []}]}]}, {"body": "Dude isn't actually that dumb. He's taking that stance publicly to sway shareholders to his side. It's a tactic....a pathetic one, but don't let what he says influence you into believing it's what he believes", "score": -4, "replies": []}]}, {"body": "Peltz is the eldest boy!", "score": 9, "replies": []}]}, {"body": "Dang I really wanted a crotchety 81 year old boomer with no entertainment or movie experience controlling the creative vision of Disney.\n\n“Restore the magic” my ass.", "score": 118, "replies": []}, {"body": "I think Iger is the better choice but it is concerning that ETF and mutual fund managers don't allow their customers some means of voting on the companies in their funds", "score": 50, "replies": [{"body": "For larger institutional mandates (which is the bulk of the money they manage), some asset managers do allow the investors to vote\n\nhttps://www.blackrock.com/corporate/about-us/investment-stewardship/blackrock-voting-choice\n\nhttps://investors.statestreet.com/investor-news-events/press-releases/news-details/2023/State-Street-Global-Advisors-to-Extend-Proxy-Voting-Choice-to-ETFs-and-Mutual-Funds/default.aspx", "score": 20, "replies": [{"body": "Looks like it’s only eligible on wrap funds right now. Very interesting though.", "score": 1, "replies": []}]}, {"body": "It is a huge problem in the corporate world as well as the political world.", "score": 2, "replies": []}, {"body": "The goal of an ETF is to invest without having to think about your investment. If someone wants to \"participate\" (let's be honest, retail investors do not participate in any of the decisions), then you can buy the stock. The whole point of an ETF is to pay someone else (management fee) to grow your investment.", "score": 1, "replies": []}]}, {"body": "As someone who genuinely enjoys what the company does, I’m all for someone to challenge the status quo to continue to help things improve. Just not a nematode like Peltz.", "score": 59, "replies": [{"body": "Absolutely. I love Disney. It deserves better than Peltz.", "score": 20, "replies": []}]}, {"body": "I thought they only handled investor funds. All the investors voted I guess", "score": 25, "replies": [{"body": "Thats one of the side effects of ETF investors. All the votes are used by the etf provider giving them incredible power.\n\nPeople need to invest directly to be able to vote", "score": 50, "replies": [{"body": "As a boring normie ETF investor, I trust Vanguard to generally make better and more informed decisions on votes than I ever would.", "score": 5, "replies": []}]}, {"body": "Work different with ETFs. That's why people say that the largest ETF providers like Vanguard and Blackrock run the world. Obviously they don't, but they wield enormous power.", "score": 24, "replies": [{"body": "The people that say black rock and vanguard own the world think that their AUM is actually their money.", "score": 4, "replies": [{"body": "I facepalm everytime someone thinks they have trillions of dollars. IIRC apple has more cash than blackrocks market cap lol.", "score": 4, "replies": []}]}, {"body": "How do they not, if they wield this enormous power?", "score": -1, "replies": [{"body": "You can wield enormous power and not own the world. Is that not obvious?", "score": 0, "replies": []}]}]}, {"body": "gotta protect the investment aka capital preservation", "score": 3, "replies": []}]}, {"body": ">Walt Disney's (DIS.N), opens new tab largest investor\n\nWhat does \"new tab largest investor\" mean?", "score": 4, "replies": [{"body": "Googling it leads back to this topic.  \n\nProbably bad ai wrote the article.", "score": 1, "replies": [{"body": "Lol what if it's voice to text. The writer asks Alexa or whatever to open a new tab, goes back to dictating the article, and then never proofreads it.", "score": 2, "replies": []}]}]}, {"body": "Good. Fuck peltz\n\nHaven’t a useful sentence from the man as to what he wants to do\n\nIt’s just negativity about the current board and some quasi political rant ab woke politics etc \n\nThis whole thing is just political bs", "score": 44, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "You’re on Reddit and you’re surprised they’re backing the man who gave you gay Buzz Lightyear?", "score": 3, "replies": []}, {"body": "I think most here will agree that change is needed. But Peltz will not bring that change.", "score": 1, "replies": []}]}, {"body": "Good on Vanguard.  Considering a ton of the shares they own are my dollars, I was going to pivot to Blackrock if they fucked this up and fell victim of the Peltz (and company, he’s being put up to this) massive troll job.\n\nStill want a word with CalPERS.  WTF?", "score": 4, "replies": []}, {"body": "Good. Peltz is useless", "score": 3, "replies": []}, {"body": "Igor should be the CEO and anyone that thinks otherwise is not a savory person.", "score": 4, "replies": []}, {"body": "It's disgusting that some people here defend the indefensible - that Blackrock and Vanguard should play activist investors WITH OTHER PEOPLE'S MONEY.\n\nThe right move for Blackrock and Vanguard was to abstain. Or ask their investors.", "score": 5, "replies": [{"body": "I’m pretty sure ETF people do ETFs so that we don’t have to play with our money?", "score": 3, "replies": []}, {"body": "As a Boglehead, this was my knee-jerk reaction as well. \n\nCan someone help me understand why abstaining is NOT the right move for Vanguard here? \n\nThe whole point of Boglehead investing is that we don't try to predict the performance of individual companies. Voting on a decision that impacts the future of a company essentially requires predicting that that decision is better for the company long term.", "score": 3, "replies": []}, {"body": "You invest with these company's funds because you believe that they're capable of managing your money. Even within a broad based index fund, someone is managing the portfolio. Why wouldn't you by extention believe they're capable of making the best decision for your portfolio? If you don't believe it, don't put your money in their ETFs/Mutual Funds etc.", "score": 6, "replies": [{"body": "But their mandate is LITERALLY to maximize your (shareholder) profits, not to play activist investor ... as in, I invested in sp500 ETF because I believe in general american economy - NOT that I believe in push for certain political/ethical direction in biggest 500 companies in US.\n\nIf Blackrock want to do that, okay sure, but they should fairly call their sp500 ETF \"progressive activism sp500 ETF\" or something else indicating the bias, so that buyer knows what he's buying with his money.", "score": -3, "replies": [{"body": "Sometimes, those two things are going to overlap. Sometimes, they won't. As you said, it's whatever makes sense for the portfolio. Clearly they felt that their pick for CEO was in the best interest of profits. You don't like their decisions? Don't invest. Ez.", "score": 2, "replies": [{"body": "That's what I did, been divesting from their ETF and more into stock picking. \n\nI'm just saying advertising it as a passive ETF is dishonest, if it's active one and not exactly oriented on profit. As you said, *sometimes* these will overlap - but last few years it consistently did not, and their investors paid the price.", "score": 2, "replies": [{"body": "I would disagree, personally. But to each their own.", "score": 1, "replies": []}]}]}]}]}, {"body": "This is one major reason for people wanting to do stock picking. When you are doing ETFS/mutual funds, you have no choice to what companies your money goes to. It will often go to companies that you are completely against on a philosophical level.", "score": 1, "replies": []}]}, {"body": "Wow. Can’t believe Blackrock didn’t vote for Peltz.", "score": 2, "replies": []}, {"body": "Since Peltz started fighting, Disney stock went from 80 to 120. I really think he has accomplished his number one goal. After the proxy fight, Peltz still owns stock and has a large microphone the yell into it whenever he wants.\n\nI hope for all the DIS stock lovers in the thread, the stock continues to rise.", "score": 1, "replies": []}, {"body": "Vanguard and Blackrock do not own those shares. They manage them. Big difference and it’s funny/embarrassing Reuters would get this wrong", "score": 1, "replies": []}, {"body": "According to these replies, Peltz just serves himself and will not solve Disney's issues", "score": -1, "replies": []}, {"body": "[removed]", "score": -24, "replies": [{"body": "I’m glad we’re finally at the point when most people realize that whoever says “go woke go broke” is not a serious person", "score": 9, "replies": [{"body": "[removed]", "score": -14, "replies": [{"body": "Honestly, whatever you’re against I’m hoping gets exponentially worse for you.", "score": 14, "replies": []}, {"body": "Ok grandpa, try watching some news that isn't Fox (or anything else owned by Murdoch. Aka Fox News wearing a Scooby Doo villain mask)", "score": 5, "replies": [{"body": "I listen to Joe Rogan and TimcastIRL", "score": -7, "replies": [{"body": "Not exactly, the greatest sources", "score": 3, "replies": []}]}]}, {"body": "Hahaha.   Naw, tiny cocked \"men\" like you thinking you should get a say in the big boy conversations is what is destroying our country.   You job is to drive the truck boy.  Number 1 job for uneducated males in this country for a reason.  We keep you on the road and out of the way of real people.", "score": -7, "replies": []}]}]}, {"body": "Ironic from a guy that uploads wiener pics on Reddit to try to find a girlfriend. Time to shut down the laptop grandpa", "score": 15, "replies": [{"body": "I thought this was just a joke, but it soon turned into a horror movie 🤢", "score": 2, "replies": []}, {"body": "I wasn't sure I believed you but sure enough, he's looking for feeeeeemale and I can't unhear the ferrengi voice.  \n\nI think all of his dingaling pics got deleted by the mods, must not have been gucci.", "score": 4, "replies": []}]}]}, {"body": "Train called me about my shares, very nice people. What they said made sense. I’m disappointed in Vanguard, especially having some VOO.", "score": -7, "replies": []}, {"body": "Wonder why n I’m voted against Mark Parker.", "score": -7, "replies": []}]}
{"title": "BYD may hand back top EV seller title to Tesla after Q1 sales decline", "selftext": "", "id": "1btsy4a", "created_utc": 1712044072.0, "score": 19, "upvote_ratio": 0.74, "num_comments": 79, "comments": [{"body": "Figure are out in hours", "score": 2, "replies": [{"body": "I thought Tesla numbers come Wednesday?", "score": 1, "replies": [{"body": "I do not know the exact time, but there really isn't much point speculating when we'll have the real answer within a day(ish)", "score": 1, "replies": [{"body": "That’s investing for you. If you think good news is ahead, buy more:", "score": 3, "replies": []}]}]}]}, {"body": "BYD will overtake everyone else, not just Tesla.", "score": 4, "replies": [{"body": "😂”BYD will over take Tesla” . Like Chinese films overtook Hollywood, vaguely with confusing subtitles and subject matter, possible containing CCCP’s subliminal messaging. Meanwhile, BYD announced they WILL NEVER sell stateside. So you can put that notion aside in the west.", "score": 1, "replies": [{"body": "> Many Western carmakers are concerned about how they will compete with BYD and other Chinese companies building EVs. RBC Capital Markets lead equity analyst Tom Narayan believes BYD’s cost advantage totals roughly 40% when compared to Stellantis, thanks in part to the vertical integration of its business and the fact that 75% of parts and components it uses are manufactured in-house.\n“The Chinese are the major threat right now because they are the only guys that can sell [battery-electric vehicles] at the price of ICE [vehicles],” Stellantis boss Carlos Tavares said.\n\nAll I can say is that BYD is playing the long game, they will sell to all of South America, Africa, Asia, and half of Europe. I hope the US wake up fast.", "score": 1, "replies": [{"body": "Flooding the market with trash when there is a demand isn’t exactly cornering the market. It’s just a quick sell. People that can afford better will buy better. Buyers remorse, having more money, it will obviously drive people back to the better brands when they become available. Those Chinese cars, they won’t past a lot of first world regulations. Quick moneys grabs, or for people that won’t ever be able to afford better, it’ll be a compromise.", "score": 1, "replies": [{"body": "Who ever buys this junk is wacko crazy! https://nypost.com/2024/04/08/business/teslas-cybertrucks-were-rushed-out-are-malfunctioning-at-astounding-rate/", "score": 1, "replies": []}]}]}]}, {"body": "Until the world goes autonomous self driving tomorrow, then no one will ever want BYB. Death trap with no customer service.", "score": 0, "replies": [{"body": "LIES. BYD has top rating with EUROCAP. But dont let facts get in the way of your Tesla FUD.", "score": 1, "replies": [{"body": "what evs do they sell in europe?!  show us the ev ratings please.  no gas, no hybrid", "score": -1, "replies": [{"body": "Atto 3 on Eurocap dot com. 5 stars.", "score": 1, "replies": [{"body": "how many they sell this year?", "score": 1, "replies": [{"body": "12k last year.  why are you even talking about them like they are mass market?", "score": 2, "replies": [{"body": "So first you say they are a death trap, then when someone says they get high ratings you ask what ev do they sell in Europe as if they don't sell EVs in Europe. When they told you the EV they sell in Europe, you have now gone to how many have they sold in Europe. If I didn't know what deflection is now I do. Just keep moving that goal post.", "score": 0, "replies": [{"body": "i didnt say they were a death trap someone else did.  i did say mass sales, the car you mention doesnt sell enough to qualify in the league we’re talking.  compare it to a nissan leaf", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Oh but we just started with FSD last week. Never seen a BYD in my life, probably never will. It’s a unicorn to most people that speak English.", "score": -1, "replies": [{"body": "Ah, so short sighted. North America is the only market.....to you.", "score": 2, "replies": [{"body": "Ah, once we dominate in NA, the rest will come :) just like all American brands #1 worldwide. Apple, coke, Disney, etc etc, no substitute for maximum quality :)", "score": 1, "replies": [{"body": "You realize Tesla market share is decreasing, RIGHT?", "score": 1, "replies": [{"body": "Uh no, the EV market share is exploding. 4-14% in 3 years. Once we complete eradicate the gas combustion polluting fossils. Tesla is easily selling 4x-5x more cars a year. Tesla is growing, LOVE .", "score": 0, "replies": [{"body": "AHAH you don't even understand what market share is. Why would anyone listen to a thing you have to say? Tesla market share is decreasing and nothing you say will change that. Elon blew their lead. Time for a new CEO.", "score": 1, "replies": [{"body": "Tesla goal is to end gas. They help other companies switch off fossil fuels, shares patents designs, NACS licenses, charging networks. And eventually they’ll all licence tesla FSD too. It’s beautiful. The wealthy will always go for the best. Tesla.", "score": -1, "replies": [{"body": "Best how? Not range, not tech, not full scam driving, or should I call it \"supervised\" now since they have failed so many times.", "score": 1, "replies": []}]}]}, {"body": "Tesla is growing and just had a YoY decline? Do you know what growth is?", "score": 1, "replies": []}]}]}, {"body": "Globally Android had \\~70% market share in 2023\n\nMost people can't afford an iPhone, same as most people can't afford a Tesla", "score": 1, "replies": [{"body": "Apple is one company, andriod is not, FYI.", "score": 1, "replies": [{"body": "Everyone knows that. What's your point?\n\n\nMine was that the dominant smartphone system isn't Apple, but the one with a wider range of products at various price points, and this is what BYD and others are going for\n\n\nMeanwhile, Tesla isn't really the luxury/iPhone end of the market, due to quality control issues.\n\n\nL4 or 5 FSD is the \"killer app\", but that seems as far off as it's been since 2017 or so - i.e. \"later this year, early next.\"\n\n\nTesla stock was down 4.9% today, BYD (on Frankfurt exchange, where I hold it) up 2.2%", "score": 1, "replies": [{"body": ">Ah, once we dominate in NA, the rest will come :) just like all American brands #1 worldwide. Apple,\n\nThis is what you replied to. You used an OS \"system\" to rebut that Apple is the #1 brand in the world. Apples to oranges. \n\nI'm not even talking about Tesla. Just wanted to make clear that Android and Apple aren't really comparable.", "score": 1, "replies": [{"body": "Yes, I replied to \"Ah, once we dominate in NA, the rest will come :) just like all American brands #1 worldwide. Apple...\"\n\nMy point being that \"the rest\" clearly haven't come for Apple - if they had the market share would be well above 30%", "score": 1, "replies": []}]}]}]}, {"body": "Yes, some can’t afford it. But those that can? They make the better choice. That’s the beauty of having competing companies, some opt for quality, some opt for putting tech in the market for the masses. Tesla is no different", "score": -1, "replies": [{"body": "What category does Tesla fall? Its not quality and its not tech, mass production?", "score": 1, "replies": []}, {"body": "Tesla isn't exactly known for Rolls-Royce levels of quality, is it?\n\n\nThere's a reason \"within spec\" is a joke", "score": 1, "replies": []}]}]}, {"body": "Toyota is an american brand? Interesting", "score": 1, "replies": []}]}]}, {"body": "To people who only speak English, maybe, but there's a big world out there and most are looking for a vehicle that costs $20k or less", "score": 1, "replies": [{"body": "Most people need cheap android phones. Yet Apple is apple still. Some human beings understand life is short, and opt for quality, when it’s a choice. Having no choice, isn’t a choice kiddo.", "score": -3, "replies": [{"body": "LOL at thinking iPHones are peak quality (just like a Tesla). You need to get out and experience the world instead of hiding in your parents house.", "score": 3, "replies": [{"body": "Ah, your second or third account. Full retard eh after blocking. So pathetic LOL. Buy buy buying more Elon LOVE. In your brain till you’re dead! every day forever. Was it talking about your dead mother that made you block me. Bhahahhaha I hurt you!", "score": -2, "replies": [{"body": "Wow you sound deranged. Looked at your profile and you spend your entire life obsessing over anything ELon related. That is not healthy.", "score": 2, "replies": [{"body": "Dead mother talk got mr obsessooo to block and pick up other account LOL. Rent free in your mind forever. But YIKES! LOL creating accounts is you SUPER POWRR bahahjajaja. So few shorts alive, you trying to compensate", "score": -1, "replies": [{"body": "You sound manic, please seek help. Your obsession with Musk is not healthy. Your life is dedicated to white knighting him online.", "score": 3, "replies": [{"body": "You need a doctor dude. I mean… we both know this. Psychologist maybe. Elon really did a number on you mentally.", "score": -2, "replies": []}]}, {"body": "I think the bot glitched lolol", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm sure there are some things the latest iPhone can do a Samsung can't, but the average user - myself included - just needs internet access, a day-long battery and a decent camera.\n\n\nLife's too short to worry if your phone's a few years out of date, or you drive a Tesla instead of a Porsche", "score": 1, "replies": []}]}]}]}]}]}, {"body": "byd expert clearly.  name a country other than china they are leader", "score": -2, "replies": [{"body": "BYD has already cars the equivalent of Toyota Corolla in EV cars. They have solid products for the right price. So why buy an expensive product (like Tesla) if you can find similar quality and cheaper? I am American BTW", "score": 3, "replies": [{"body": "no they dont.  tell me where you can buy them outside china?  where do they sell their mass evs?", "score": 0, "replies": [{"body": "If this article doesn't scare you, I don't know what will scare you.\n\n> In February, the Alliance for American Manufacturing released a report warning that low-cost Chinese imports could be an “extinction-level event for the U.S. auto sector” and called on Washington to prematurely block imports from Mexico.\n\n https://www.cnbc.com/2024/03/19/tesla-rival-byd-pushes-into-emerging-markets-amid-western-uncertainty.html", "score": 1, "replies": [{"body": "ive been investing in tesla since 2013.  there is less competition now than there was then", "score": 1, "replies": [{"body": "The only thing they have going is the charging stations network in the US, not much advantage once you remove that part.", "score": 1, "replies": [{"body": "that is incorrect.  charging is one of many moats that create tesla’s growing monopoly.  they build infrastructure (like charging), and over many years the leads widen.  you’ll get it when it’s way late and that is no problem of mine", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Choina too, and Cheena. All three of those countries big BYD love love time.", "score": 2, "replies": []}, {"body": "BYD is the leading EV retailer in many countries all over the world. Brazil, Israel, Thailand, New Zealand, etc.\n\nBYD’s export share of their Chinese production has grown to 15%. And they’ve huge overseas production capacity coming online initially in Thailand, Brazil and Hungary. \n\nBYD will be the world’s largest car company overtaking VW and Toyota in units. So much is obvious.", "score": 1, "replies": [{"body": "how many evs did they sell outside of china last year?  why did their numbers dropoff worse than tesla?  why are you some byd stan when you know nothing about the company?  bc you just want to be cynical on tesla bc you cannot think for yourself", "score": 0, "replies": []}]}, {"body": "Choina", "score": 1, "replies": [{"body": "Sure bubs, while Tesla just got obliterated this quarter while sitting on 50,000 unsold cars. Gigantic demand issue. Not got to have 20% drop in sales QoQ. Big oof.", "score": 2, "replies": [{"body": "Nah Elon’s got it. Just like Starship reached outer space, just like the Neuralink patient is playing chess and has gained his life back. Just like he promised Cybertruck and we can buy one now. Just like FSD is starting to take off this month. Time kiddo, all it takes is some time. We patient :)", "score": 1, "replies": [{"body": "Um, this is TSLA or did you forget that.\n\nDemand slumping, margins slumping, stock slumping for several years and now 50,000 unsold cars. Ooooooof.", "score": 1, "replies": [{"body": "Sister companies super important, next gen roadster was announced, lots of SpaceX tech will be implemented. Mostly going to be for the higher end super cutting edge tech user, LIKE ME. LOVE. Will buy at any price!\n\nFed just needs to drop rates, it’s macro economics kiddo! We all exist together.", "score": 0, "replies": [{"body": "Yeah like 9 years ago. Tesla has been keeping those deposits for nearly a decade. \n\nIF the roadster is ever built it won't meet the specs. Sub 1 second to 60 with 600 mile range. Not a chance. Its called physics, maybe Elon should read up.", "score": 1, "replies": [{"body": "FYI here’s some DD for ya to understand the auto winter sales slump. LOVE\n\n\"The EV slowdown is shaping up to be a Tesla slowdown,\" Cox analyst Stephanie Valdez Streaty said during a conference call Thursday.\n\nBYD down 43% QoQ\n\nXPeng down 64% QoQ\n\nNio down 40% QoQ\n\nLi Auto down 39% QoQ\n\nFord shuts down 2/3rd of its F-150 Lightning production…\n\nRivian, at low volume, guided for no growth.\n\nVW is potentially having its worst BEV quarter ever in Europe.\n\nBut let’s call it a Tesla slowdown, even if QoQ they will do better than all the ones listed above.", "score": -1, "replies": [{"body": "Time for Tesla to get a new CEO. Majority agree these days. His days are limited.", "score": 1, "replies": [{"body": "But we have the best CEO that is the most active CEO in world history. Why give up the best thing ever to become, nameless faceless scary family killing BYG NIOO unknown communist spyware LOL", "score": 1, "replies": [{"body": "What has Musk done in the last several years for Tesla? Please, tell me.", "score": 1, "replies": [{"body": "He is the CEO of tesla. CEO work.", "score": 1, "replies": [{"body": "What value has Elon brought to Tesla in the last 4 years? You can't even name 3 things.", "score": 1, "replies": [{"body": "6 million cars milestone last week. Excellence. Love!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "obliterated? haha.  qoq matters?  hows byd qoq?  you are a troll.  first quarter always down from prior q", "score": -1, "replies": [{"body": "Show me where Tesla is down 20% QoQ or since quarter the year prior. Show me where Tesla ever sat of 50,000 cars. Yeah, they blew this quarter.", "score": 2, "replies": [{"body": "Calm down buddy boy, winter auto sales for the world are always down. That’s what spring is for! Just need to learn patience! Rewards will be had then!", "score": 1, "replies": [{"body": "Down 80,000 from predictions! This isn't a winter slump, its a HUGE miss with Tesla. Time for a new CEO.", "score": 1, "replies": [{"body": "The predictions were outdated, and FED hasn’t delivered on then promised rate cuts, everyone waiting to pull trigger on a shiny new Tesla the second they can secure that rate cut loan. You need to go back to school kiddo, or watch more news!", "score": 0, "replies": [{"body": "And that wouldn't explain why Tesla is sitting on 50,000 cars they can't sell. \n\n  \nUse some common sense OMG.", "score": 1, "replies": [{"body": "Selling just started kiddo, the snow is still melting in winter countries. People want test drives yknow? Spring is perfect, combined with the FED interest rate drop, ALL car sales will EXPLODE! Just look it up, been that way for decades. 3-4 massive catalysts for Q2", "score": 1, "replies": [{"body": "Sure sure...and down for same quarter last year. Sales slumped, margins slumped, stock is in the sh1tter, just like twitter. New CEO time.", "score": 1, "replies": [{"body": "6 million car milestone last week, just need to zoom out kiddo. The EV king can have a slow winter like every car company has ever had since cars were invented, patience. Love", "score": 0, "replies": [{"body": "That doesn't address QoQ slump from last year and the decreasing marketshare.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}
