{"title": "Microsoft and OpenAI are Building a $115 Billion Stargate Datacenter Project by 2028", "selftext": "TLDR:\n\nMicrosoft and OpenAI are making good on that $7 Trillion dollar investment by putting 1.64% down on a new project called Stargate.\n\nThis will be powered by nuclear and have data centers built out in Mount Pleasant Wisconsin.\n\nThe project is expected to be complete by 2028 a lightning fast completion time compared to Amazon's 15 year project.\n\n[https://www.datacenterdynamics.com/en/news/microsoft-openai-consider-100bn-5gw-stargate-ai-data-center-report/](https://www.datacenterdynamics.com/en/news/microsoft-openai-consider-100bn-5gw-stargate-ai-data-center-report/)", "id": "1bt6w4n", "created_utc": 1711985746.0, "score": 404, "upvote_ratio": 0.92, "num_comments": 75, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 6 months ago\n**Total Comments** | 1874 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "These April Fool jokes are getting out of hand and out of this world.", "score": 207, "replies": [{"body": "As long as Sam Carter runs it and it's televised, I have no problems with this plan.", "score": 37, "replies": []}, {"body": "lol We are heading to other dimensions you can't deny it", "score": 13, "replies": [{"body": "Stargates don't go to other dimensions, they go to other worlds within our dimension.", "score": 22, "replies": [{"body": "School those nerds who dont understand 3d vs 4d", "score": 18, "replies": []}, {"body": "Well, untill you hit some funky solar flares appearantly. Then everything goes.", "score": 7, "replies": []}, {"body": "\"indeed\" - in teal'c", "score": 8, "replies": []}, {"body": "Ya you'd need a quantum mirror for that", "score": 3, "replies": []}, {"body": "*Kurt Russell approves*", "score": 3, "replies": []}, {"body": "you are correct. but the reference was more about spatial dimensions to tie it to levels of compute and data center investment needed", "score": -1, "replies": []}]}]}]}, {"body": "30 years and they still haven’t been able to fix start menu search.", "score": 93, "replies": [{"body": "They don't know where to start...", "score": 33, "replies": []}, {"body": "Yesterday I could not open the volume button on windows until I restarted my pc. We truly are in the future", "score": 13, "replies": []}, {"body": "The fact that it’s 2024 and I have to download an application to search my own computer is fucking ridiculous.", "score": 21, "replies": [{"body": "Which one do you use?", "score": 4, "replies": [{"body": "“Everything”\n\nLink: https://www . voidtools . com/", "score": 9, "replies": [{"body": "Thanks", "score": 5, "replies": []}]}]}]}]}, {"body": "Still easier than Stargate in gregtech new horizons", "score": 16, "replies": [{"body": "What is a margin call and how do I get rid of it", "score": 5, "replies": []}]}, {"body": "Under no circumstances go to P4C-970", "score": 13, "replies": []}, {"body": "Microsoft is going all in on AI, this site is being streamlined considering they just bought the land last year.", "score": 8, "replies": []}, {"body": "https://preview.redd.it/xim6062ahwrc1.jpeg?width=1170&format=pjpg&auto=webp&s=834bf119105761776d765ca82b4480ff65530cea\n\nDid you know that the median revenue per employee in the software industry is around $352k?", "score": 22, "replies": [{"body": "Missing one company... admittedly mostly hardware, which is even more astonishing.\n\nhttps://preview.redd.it/cq0vl7jxlwrc1.png?width=1023&format=png&auto=webp&s=9c8c7df385f4661b04c400ee81feacb4a10d3800", "score": 19, "replies": [{"body": "Indeed hardware but legendary thanks for sharing", "score": 7, "replies": [{"body": "Nvidia does a LOT with their software, but it's all in support of the core business, the hardware. It certainly does not exist without massive investments in software though.", "score": 5, "replies": [{"body": "That’s correct however I used pure software companies so that the benchmark makes more sense", "score": 3, "replies": []}]}]}]}, {"body": "[removed]", "score": 33, "replies": [{"body": "Good god.", "score": 6, "replies": []}]}, {"body": "Matches pretty close to cost per employee. Tech industry is Robinhood", "score": 1, "replies": []}, {"body": "does that include mark zuckerberg and elon's 56 billion?", "score": 1, "replies": [{"body": "Pretty sure how much people make has nothing to do with revenue per employee.", "score": 5, "replies": [{"body": "Well damn. Thank you. Yea because I was like that seems outrageous.", "score": 0, "replies": []}]}, {"body": "The median is more reflective of the reality of the situation than the average ;) so no it doesn’t take it into account", "score": 1, "replies": [{"body": "that can't possibly be true. lol - the average is not that without considering some high rollers.", "score": -2, "replies": [{"body": "outliers have no effect on the median (but do significantly affect the average).", "score": 7, "replies": [{"body": "Words of wisdom !", "score": 1, "replies": []}]}, {"body": "That’s correct the average is probably higher. I’m talking about the median only :)", "score": 2, "replies": []}]}]}]}]}, {"body": "When the real shit comes up, there won't be any cool names left", "score": 7, "replies": []}, {"body": "Powered by nuclear.....", "score": 5, "replies": [{"body": "Probably Okta’s nuclear generators. Sam Altman’s SPAC is merging with them", "score": 5, "replies": []}]}, {"body": "I keep getting ads for Bill Gates on my instagram. Something about new Power technology in texas or something. where buy calls", "score": 3, "replies": [{"body": "Terra power probably", "score": 1, "replies": []}]}, {"body": "What even is Apple doing compute wise for AI training? Did they bite the bullet and buy Nvidia H100s/B100s yet?", "score": 4, "replies": [{"body": "one just doesn't buy gpu's and then an LLM pops out. It's getting far beyond that.", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "damn what did he say", "score": 2, "replies": []}]}]}]}, {"body": "Mark my words and quote me 10 years from now but I'm betting that Apple during their in-house silicon design for the M1 chips was designing their own parallel work load chips as evidenced by their neural engine components of the A17 Pro chip/SOC. Yeah sure it may not have the same raw throughput compute right now as the H100s BUT Apple understands it's not the data-center level AI that will change the world, it's the pocket/individual level of AI compute is the future for individual consumer products. Sure they probably have data-center level research racks at Cupertino training Siri but at the end of the day they're not AWS & Azure nor do they \\[Apple\\] care to fight in that space so buying warehouse of Nvidia chips doesn't make sense for Apple.", "score": 2, "replies": [{"body": "They've already been deploying the *inferencing* portion for local compute in your pocket in neural engines for years.  \n\nWhat I'm wondering about is the *training* portion, which companies like Meta which also have no AWS or Azure component are still buying ungodly amounts of H100s/B100s etc for, because CUDA already has extensive ML libraries built out for it so as they're all racing to train their own AI models, not using Nvidia is just too much of a leg down, hence why they have almost all the profit share in this space right now. \n \nInferencing accelerators like the neural engine aren't doing training. To make new LLMs or other AI tools to go with those local inferencing accelerators takes big generalized training GPUs.", "score": 3, "replies": [{"body": "\"...AI tools to go with those local inferencing accelerators takes big generalized training GPUs.\"\n\n  \nYou are absolutely correct, hence why everyone is buying Nvidia chips right now, especially after they showed off that they \\[$NVDA\\] finally have their own ARM CPUs to pair seamlessly with their data center Lovelace/Grace Hopper racks. Apple for sure has large compute capacity working on Siri's training but what exactly are they using? I don't know, and those who do have probably signed the strongest NDAs since the establishment of the Dutch East India Company.\n\n  \nWhat I can say is that Apple didn't just commit the R&D team to only design the Mac Book Air M1 chips... That kind of R&D project has 20 year projected returns, and killing the \"iCar\" right after the rollout wasn't a total loss, they \\[$APPL\\] looked at $TSLA and let them have their market share while focusing on their own market of individual portable devices hence why the Vision Pro exist, right now AR/VR is where the OG HDD spinning disk iPod was at it's introduction in the early 00's but Apple sees the LiDar writing on the wall.", "score": 1, "replies": []}]}]}]}, {"body": "Does anyone here really believe that our earth could really stop the Goa’uld?", "score": 3, "replies": []}, {"body": "It will be outdated as soon as it gets completed.", "score": 2, "replies": []}, {"body": "Oh shit - MSFT and a press release before they actually do anything. Where have I seen this before.", "score": 2, "replies": [{"body": "Apple?", "score": 1, "replies": []}]}, {"body": "Its a pretty cool place has lots of statues of the governator! They have not got his accent quite right yet but we are happy to announce their fusion gun prototype is ready! VIVA LA SKYNET!/s", "score": 1, "replies": []}, {"body": "5GW? That's a lot of watts. Like 5 giga worth.", "score": 1, "replies": []}, {"body": "Chevron 1 encoded...", "score": 1, "replies": []}, {"body": "Except the crazy $7 trillion dollar figure, this isn't precisely crazy or anything lol", "score": 1, "replies": []}, {"body": "CIA funded Microsoft and open ai are building a data center! Hurrah", "score": 1, "replies": []}, {"body": "Just a bunch of fluff, let’s see how it all shakes out once the AI hype dies off.", "score": -5, "replies": [{"body": "Depends, ai can have real uses, unlike bitcoin or nfts. A bubble like the internet one can append though", "score": 9, "replies": [{"body": "I didn’t say it has no practical use, I think it’s overhyped and most of the companies are riding the hype train with high spending and no revenue in near sight to back it up. Mark my words, the segment will deflate at some point in the next few years. ", "score": 6, "replies": [{"body": "It may be the case, I won't try to predict if it will fail or not, but imo it's not doomed to crash", "score": 3, "replies": [{"body": "all the meanwhile we are talking about nuclear powered data centers worth 100's of billions. But yea it's gonna crash like tomorrow.", "score": 2, "replies": [{"body": "Ngl this project has a non null chance of being an engineering failure", "score": 0, "replies": [{"body": "Sheesh as an engineer I would hope it doesn’t. I am sure Microsoft knows what they’re doing", "score": 5, "replies": []}]}]}]}, {"body": "because more intelligence isn’t the key to success?", "score": 1, "replies": []}]}]}, {"body": "not fluff, even if it doesn’t focus on AI this supercomputer will be able to perform some crazy shit with how big it is", "score": 3, "replies": [{"body": "Ok Einstein ", "score": -1, "replies": [{"body": "tell me you don't know anything about quantum computing capabilities without actually telling me.,.....", "score": 2, "replies": []}]}]}, {"body": "I hold my hands on my face when i hear people say that. Where do you think AI is going? away? \n\n![gif](emote|free_emotes_pack|facepalm)", "score": 2, "replies": []}, {"body": "lol", "score": 2, "replies": []}, {"body": "Is the nuclear already in place? If not, there’s no shot it’ll be done by 2028", "score": 2, "replies": [{"body": "More than likely Okta. They have a link with Sam Altman and he is also linked to OpenAI", "score": 1, "replies": []}]}]}]}
{"title": "U.S. Oil Primed for Decade of Life — Midstream’s to benefit the most ", "selftext": "Alright, first post fellow regards! My first DD is on Plains All American Pipeline, L.P. (PAA). Strap in and tuck in those Wendy’s napkins cause this baby is about to get wet 💦\n\nThere are only two key ingredients that are going into this centuries-old Dutch recipe. \n\n1. A gobsmackingly undervalued midstream oil company\n\n2. The best strategic tailwinds in the U.S. oil market since 1945\n\nCompany: TLDR: PAA is a midstream provider that transports and stores crude, natural gas, and other refined oil products. They make money primarily from the Frac Spread which presents a golden opportunity to dive in now. \n\n(more on this later)\n\nFinancials: Three points:\n\n1. Consistent revenue growth over the past three years, with total revenues increasing from $29.28 billion in 2021 to $33.14 billion in 2023, representing a compound annual growth rate (CAGR) of 6.1%.\n\n2. PAA has maintained strong profitability margins, with a gross margin of 17.8% and an operating margin of 9.6% in 2023. Through a complex macro-environment for midstream players \n\n3. Balance sheet has total assets of $34.72 billion and total liabilities of $21.84 billion as of December 31, 2023. The company’s debt-to-equity ratio stands at 1.08, indicating a reasonable level of leverage, especially given capital intensive Midstream business model.\n\nU.S. oil is about to have the decade of its life\n\n1. U.S. oil production is at record highs, due embargoes on Russian oil, and sanctions enacted by the Biden administration.\n\n2. Biden has his hands tied because in order to reduce inflation (fed looks at core) he needs to continue drilling— which will further position the U.S. to become a crucial and reliable supplier given extremely high geopolitical tensions.\n\n3. Trump re-election is seen as a potential wildcard, with expectations of heightened demand for oil and increased premiums, prompting strategic longterm investment to capitalize on market dynamics\n\nThe kicker (frac spread)\n1. Currently, oversupply in NG depresses its prices, while NGLs maintain better demand and higher prices. PAA benefits from this spread by purchasing NG-based NGLs at lower prices and selling them at higher NGL rates. The wider the spread, the greater PAA’s profit margin, making its operations more lucrative. Factors affecting the spread’s future include NG pipeline capacity and LNG export capacity. The ‘fatness’ of the frac spread depends on whether natural gas pipeline capacity can keep up with demand growth (IT CAN’T)\n\n1. My plan is to ride this up all year with weeklies and transition to synthetic calls once valuation becomes more rich. That said, calls are essentially FREE at current prices (especially further out you go) I’m deep in with April 19th calls @17.50 for 20c apiece \n \n ", "id": "1btb5wc", "created_utc": 1711995413.0, "score": 159, "upvote_ratio": 0.94, "num_comments": 95, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 0 | **First Seen In WSB** | 3 minutes ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Another Guy posted about mid streams last week and those call premiums are up 150% already.\n\nThe other guy mentioned several other midstreams and I suggest you all take a look too.\n\nOther plays that haven't popped off:\n\nET 20 dollar call 1/17/25 @ 8 cents\n\nEPD 30 dollar call 6/27/24 @ 32 cents (stock is currently at 29.43 with analyst target of 33 by mid year)\n\nEPD 35 dollar call 1/17/25 @ 7 cents", "score": 41, "replies": [{"body": "I think ET looks good to rise alongside", "score": 7, "replies": []}, {"body": "Hell yeah - drew some inspiration from that post as I was looking at midstream players as well but PAA really pops off the page. Will take a look at some of these other plays as well. That ET $20 @0.08c contract looks juicyyy", "score": 15, "replies": [{"body": "With you 100%. I'm in all 3 and excited to see the run up", "score": 6, "replies": [{"body": "In as well, bought 17.5C for 5/10", "score": 2, "replies": []}]}, {"body": "How much are you up? it seems the jan 17/2025 are 0.50 already, did it go from 0.08 to 0.50 already?", "score": 2, "replies": []}]}, {"body": "Any chance you still have that post as a link?", "score": 1, "replies": [{"body": "[here you go ](https://www.reddit.com/r/wallstreetbets/s/BngPb458xq)", "score": 5, "replies": [{"body": "Bless you 🫶", "score": 1, "replies": []}]}]}, {"body": "RemindMe! 16 hours", "score": 1, "replies": [{"body": "I will be messaging you in 16 hours on [**2024-04-02 14:14:50 UTC**](http://www.wolframalpha.com/input/?i=2024-04-02%2014:14:50%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1btb5wc/us_oil_primed_for_decade_of_life_midstreams_to/kxm069e/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1btb5wc%2Fus_oil_primed_for_decade_of_life_midstreams_to%2Fkxm069e%2F%5D%0A%0ARemindMe%21%202024-04-02%2014%3A14%3A50%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201btb5wc)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "Leaps are dirt cheap as well and already printing free money.\n\nJan 27, 2025 $20 Calls\n\nJan 16, 2026 $22 Calls\n\nThese are potential 20 baggers.", "score": 44, "replies": [{"body": "what does 20 baggers mean?", "score": 3, "replies": [{"body": "20 baggers means you 20x your money. So if you put in $100 it turns into $2,000.", "score": 5, "replies": [{"body": "Thank you, appreciate it", "score": 1, "replies": []}]}]}, {"body": "aren't there some catches with calls and dividend stonks?", "score": 2, "replies": []}, {"body": "Newbie here, so please forgive any ignorance. Why not buy the $25, $27, or $30 calls for half or a fourth of the price? What is the main distinction between them leading you to pay more for the $20 and $22 calls?", "score": 3, "replies": [{"body": "The trick is to get as many contracts as you can for the lowest dollar amount. I’m on Jan 2026 $25 calls. I was able to buy hundreds of contracts and ultimately that is what will make this a money bagger. Having as many contracts as possible. I wouldn’t go above $25 tho. \n\nExample if you had $200 that’ll buy you like 2 $20 2026 calls. \n\nWith that $200 you could have also bought 6 $25 2026 calls. \n\nLet’s say in a year from now it’s at $23. You’ll have more money in the second scenario then you would have from the first.", "score": 13, "replies": [{"body": "How do the Greeks factor in then? Also, it doesn’t make sense why the 2026 $20 call is .95, the $25 call is .30 and the 2026 $27 call is .80.", "score": 0, "replies": [{"body": "I don’t know Greek. \n\nAnd your second question. You were most likely looking at the end of day prices. Some dumb fuck bought a 2026 $20 call for .95 when they could have bought a $25 call for .30. Since this stock has low volume trades like that can skew the price but regardless you would want to stay true to the philosophy. Buy low, sell high. Buy as many contracts as possible via a ticker that is close to the current strike. \n\nExample during the SPY dip today i loaded up on $523 calls instead of something closer like $518 calls. Why? i was able to get more contracts with my money. i just need spy to go up tomorrow or the next day. Does not need to hit $23 to make a profit since SPY has so much IV you can make money off focusing on buying a lot of contracts at a low dollar amount and selling them again when demand is up", "score": 3, "replies": [{"body": "aren't there some catches with calls and dividend stonks?", "score": 2, "replies": []}, {"body": "By Greeks they mean the Greeks underlying options such as the theta (how much the option value decays every day), delta (how much your option value increases relative to movement in the stock) and others. Not Greek the language haha", "score": 1, "replies": []}]}]}]}]}]}, {"body": "contract price doubled in the weekend", "score": 18, "replies": [{"body": "Still insanely cheap for 20 and 22 strike LEAPS ngl", "score": 14, "replies": [{"body": "Yea i loaded up some calls 20$ 01-17-2025", "score": 5, "replies": [{"body": "same, too cheap to not participate.", "score": 2, "replies": []}, {"body": "how much you get it for?", "score": 2, "replies": []}]}]}, {"body": "Volume spike on Jan 2025 $PAA calls on Thursday the 28th because of a post on here titled Drill Baby Drill -", "score": 13, "replies": []}]}, {"body": "Finally some good fucking DD. I have so much money rotting in renewables. Gas seems like a good bet in the next few years.", "score": 11, "replies": [{"body": "Why are you bullish on gas \"the next few yearz?\"", "score": 1, "replies": []}]}, {"body": "Fuck it calls it is", "score": 10, "replies": []}, {"body": "https://preview.redd.it/bwtb1q4bywrc1.jpeg?width=828&format=pjpg&auto=webp&s=c90cc6bad7b307ac278e2563b75403cb0f493791\n\nWhat happened on the 20th?", "score": 10, "replies": [{"body": "Wtf", "score": 1, "replies": []}]}, {"body": " https://www.nasdaq.com/articles/the-math-is-mathing-for-plains-all-american-pipeline-paa", "score": 9, "replies": []}, {"body": "Picked up 15 of the Jan 25 $20 calls and a couple hundred shares last week after the last post about this and I'm up quite a bit already.", "score": 8, "replies": []}, {"body": "The PAA 1/25 leaps are a crazy value. 20, 22, 25 strikes are not far fetched nor are they stacked with IV. Good bet. im in count me 50 contracts at each", "score": 6, "replies": []}, {"body": "One thing you shouldn’t do is buy partner shares because you don’t want the stupid k-1 to include on your taxes that you need to wait until March to get", "score": 5, "replies": [{"body": "What difference does that make?", "score": 1, "replies": []}]}, {"body": "This was great. Thank you. Calls it is.", "score": 5, "replies": []}, {"body": "I’m in with those leaps! \n\nJan’25 20c x50\nJan’26 22c x25\n\nOil aside, this is a solid company and I’d expect these to be well ITM even if oil doesn’t go crazy. I don’t really see a downside for long term plays. Adding a few shares as well.", "score": 4, "replies": []}, {"body": "I’ve been all over this", "score": 5, "replies": []}, {"body": "Bought my leaps last week - game on lol", "score": 3, "replies": []}, {"body": "Great read. I'd been picking up potential M&A targets like Comstock and Permian recently so this might be a nice addition to the play.", "score": 5, "replies": [{"body": "That’s awesome - do share. Would love to follow you on some good plays there.", "score": 3, "replies": [{"body": "No options moves to report on those two, I've been picking up shares in both progressively with the thought that this may be a good year for oil+gas M&As. Looking at the Chevron purchase of Hess, Exxon purchase of Pioneer, and the Chesapeake/Southwestern merger as the basis for that call. US oil and gas is having a great time right now and it looks like the biggest players are looking to bulk up their operations.   \n\n\nCRK is my LNG play since it has a long established record of stability and ok dividends. The gamble is smaller LNG companies will get the itch to follow Chesapeake and start a round of mergers. PR is a play in the Permian Basin assuming that since the largest targets have already been eaten up, anyone looking to expand in that field will naturally have to choose smaller companies. PR is a decent target given that it too has completed a major $4.5 billion acquisition just last year and has managed to keep a solid balance sheet beyond it. Your write up makes me think that this may be a good option play to compliment my equity purchasing. I'm new to options, but this seems like less regarded analysis than you see here.", "score": 2, "replies": []}]}]}, {"body": "Why April 19 ? Earnings seem to be in May.", "score": 3, "replies": [{"body": "Great q. I will probably load up once I close out current for April. Though am trying to avoid holding contracts through May 15th which is when dividend is paid to not have the impact of dividend affect options contract", "score": 6, "replies": [{"body": "It was priced in already.  They declared the amount in Feb and reaffirmed it yesterday for the year at .31 cents per unit.", "score": 1, "replies": []}]}]}, {"body": "I also saw that other post \n\nBought PAA calls today", "score": 3, "replies": []}, {"body": "Coming back to this. Thanks for the 100% returns. Wondering if I should hold through earnings.", "score": 3, "replies": []}, {"body": "Great Job OP! The charts are aligned with your DD. I have also placed an order for a LEAP of PAA $27.5 C Jan25. May the Odds forever be in our favour.", "score": 3, "replies": []}, {"body": "What positions yall taking?", "score": 2, "replies": [{"body": "The ones where I lose money.", "score": 16, "replies": []}, {"body": "Buying leaps. Prices are so low. With consistent growth these should be well ITM \n\nJan’25 20c\nJan’26 22c", "score": 6, "replies": []}, {"body": "Since the last guy posted the contracts went up a lot so I just decided to buy ET 20 calls for Jan 25 since they’re still very cheap compared to these. But both will likely print imo it’s just by how much", "score": 6, "replies": [{"body": "ET will not print ", "score": -2, "replies": [{"body": "Just because I bought a bunch?", "score": 3, "replies": [{"body": "No, ET is like Nokia. ", "score": -3, "replies": []}]}, {"body": "How so", "score": 1, "replies": []}]}]}, {"body": "Reverse inverted flying Doggystyle", "score": 1, "replies": []}]}, {"body": "Yes great opportunity here . I got in on a January 2025 call , strike $20 @.20 at the end of January.", "score": 2, "replies": []}, {"body": "Just wanted to come back and say thanks for the extensive DD on this. Can’t wait to see where this ends up. Hope to see you post more ideas.", "score": 2, "replies": []}, {"body": "PAA is ok... mostly crude, limited NGLs. Honestly $OKE is better positioned with substantial basin takeaway for NG, NGLS, and crude. Plus there's overlapping refined product system. Largest in the middle US. Much more dynamic and diverse.", "score": 3, "replies": [{"body": "Positions ?", "score": 4, "replies": [{"body": "2,959 shares 💕", "score": 2, "replies": [{"body": "My jigga you got 200k+ $ in shares ? Can you adopt me.", "score": 7, "replies": [{"body": "You don’t need that much money to buy options", "score": 2, "replies": []}]}]}]}, {"body": "I was just looking at OKE's and MPLX's revenue growth and profit margin numbers against ET. I know little beyond what I just looked at as far as OKE goes, but I know MPLX fairly well. MPLX mostly sits in the Utica wet gas and oil window and is responsible for taking away a ton of production in that area. E&P's in that area are starting to poke holes in Noble County and I think there's going to be a rush to grab acreage soon which will bring MPLX through with pipelines and fractionation plants. You have an opinion on that?", "score": 2, "replies": []}]}, {"body": "Stock is 29% down in 5 years", "score": 3, "replies": [{"body": "Take a look at the year. 5 year is useless to look at these days.", "score": 5, "replies": [{"body": "Yeah but aren’t all these mid stream stocks less volatile and just stable dividend paying stocks. I doubt huge upside potential but it might happen with Biden unlocking more reserves", "score": 2, "replies": [{"body": "The price is currently $17.72\n\n1 month return: 6.6%\n3 month return: 16.9%\n1 year return: 36.9%\n\nBuying leaps for 20c & 22c seems more than reasonable to print. Stocks don’t need to be volatile to make money when their growth is consistent.", "score": 3, "replies": [{"body": "Convinced me I’m going into EPD 5 contracts", "score": 4, "replies": [{"body": "Hell yeah.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "hell yeah", "score": 2, "replies": []}, {"body": "Is this still a play?", "score": 2, "replies": []}, {"body": "in this as well. Jan 2025 20, 22, and 25 calls. this is a great play", "score": 1, "replies": []}, {"body": "I’m in", "score": 1, "replies": []}, {"body": "Fuck it we Call", "score": 1, "replies": []}, {"body": "Is there reason why Jan. 27 calls are not being displayed on RH?", "score": 1, "replies": []}, {"body": "Bought 15 contracts for 2026\n\n\nThis thing die?", "score": 1, "replies": []}, {"body": "You son of a bitch, I’m in. ![img](emote|t5_2th52|8882)", "score": 1, "replies": []}, {"body": "Re: dividend\n\"$0.61524 per Series A Preferred Unit (approximately $2.46 per unit on an annualized basis).\"\n\nIs PAA really doing well or what?!", "score": 1, "replies": []}, {"body": "It is too late? It’s 1.95 and those LEAPS aren’t cheap anymore", "score": 1, "replies": []}, {"body": "sick", "score": 1, "replies": []}, {"body": "Do the inverse. A slowdown/recession is coming. Oil demand will go down. Prices of oil will go down.", "score": -9, "replies": [{"body": "What you aren’t factoring is global insecurity. Right now the only places you can reliably get oil is North America and the baltics. Russian oil is a risk due to sanctions, the Middle East is a risk because they’re doing what they usually do, Venezuela is sanctioned and looking to maybe invade their neighbour. \n\nNot to mention the world seems to be preparing for a conflict, all these big machines need oil, and people will pay a premium to ensure they remain running.", "score": 4, "replies": []}]}, {"body": "I heard this story before in 2014", "score": -5, "replies": []}, {"body": "This is good DD but the audience ain't interested... unfortunately.", "score": -7, "replies": [{"body": "What are you takking about? every single one of these contracts are up currently. Id say mainly due to these posts. do your research before you spew nonsense. makes you look stupid", "score": 5, "replies": [{"body": "Yeah, that was a really dumb comment. The stock volume has been above average the last few days and not to mention the volume on all call options have gone parabolic", "score": 2, "replies": []}]}]}]}
{"title": "Alright regards, how will they bid up TSLA tomorrow?", "selftext": "We all know delivery numbers are going to be dogshit. Probably a YoY decline and WS is still calling for 430k deliveries. That being said, “analysts” have been tripping over themselves to talk up/hype FSD. So how will they justify pumping TSLA higher tomorrow after numbers come out? Off the 5,000 cyber trucks delivered?\n\nI bought puts, so looking forward to getting screwed!", "id": "1btd3e5", "created_utc": 1711999789.0, "score": 11, "upvote_ratio": 0.63, "num_comments": 77, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 6 months ago\n**Total Comments** | 43 | **Previous Best DD** | \n**Account Age** | 6 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "What time will they announce the numbers ?", "score": 1, "replies": []}]}, {"body": "Tesla going to be up 0.40% tomorrow to fuck with both calls and puts", "score": 11, "replies": [{"body": "https://ca.investing.com/news/stock-market-news/teslas-chinamade-ev-sales-edge-up-02-yy-in-march-3330341", "score": 1, "replies": []}]}, {"body": "Sell at open or close to it becusse that will he as good as it gets. That’s my strategy NywY", "score": 8, "replies": [{"body": "Deliveries will be around open. I'm not playing chicken with these numbers. Get out now.", "score": 1, "replies": []}]}, {"body": "Bought a couple 185c right before that closing run. Let’s see if inverse WSB is a legit thing", "score": 5, "replies": [{"body": "Can almost guarantee you’re good because I bought puts.", "score": 14, "replies": [{"body": "Sideways it is.", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}, {"body": "Hoping one of us get a 10 bagger 🙏", "score": 5, "replies": [{"body": "I like how divided WSB is on this one", "score": 5, "replies": [{"body": "Thetagang thanks you for your sacrifice", "score": 2, "replies": [{"body": "Maybe not... It's probably going to move one way... So half of theta gang gets crushed too", "score": 1, "replies": []}]}]}]}, {"body": "Congratulations u/skaw3334", "score": 2, "replies": [{"body": "First time hitting with options. Feels good", "score": 3, "replies": [{"body": "Seriously congrats. How much did you make out with?", "score": 1, "replies": [{"body": "100% or 500$", "score": 2, "replies": [{"body": "100% win is always fantastic", "score": 1, "replies": []}]}]}]}]}]}, {"body": "RIP your calls", "score": 2, "replies": []}, {"body": "Rip to your calls", "score": 1, "replies": [{"body": "💀", "score": 2, "replies": []}]}]}, {"body": "I think everyone knows already the sales volume is down. Probably more important how tomorrow impacts sentiment looking forward.", "score": 4, "replies": [{"body": "I’m sure that’s why elon has been talking FSD nonstop", "score": 8, "replies": [{"body": "Fair take... but he has been promoting FSD for years and it is only now with v12 that it seems they have it figured out and now just need iterative training and updates to get it to the finish line.", "score": 5, "replies": []}]}]}, {"body": "It was Cathie Woods! We going to 160 tomorrow!!\n\nhttps://www.benzinga.com/markets/cryptocurrency/24/04/38038248/cathie-woods-ark-amasses-nearly-15m-tesla-shares-ahead-of-crucial-q1-deliveries-report-con", "score": 5, "replies": []}, {"body": "Also holding puts love that random pump in the last 10 minutes today", "score": 6, "replies": [{"body": "Yeah what the hell was that about.", "score": 4, "replies": []}, {"body": "Kind of makes me nervous for my puts tomorrow like someone knows something we don’t", "score": 3, "replies": [{"body": "Think they are going to raise it up more in pre-market so when it does fall it doesn’t drop enough to allow most puts to be ITM", "score": 2, "replies": [{"body": "Damn it all. I just put down what I lost in Vegas last weekend. It was double or nothing. And it is starting to feel like it is \"nothing\"", "score": 1, "replies": []}]}]}]}, {"body": "What time is the report coming out?", "score": 3, "replies": [{"body": "8:30AM or 9AM EST", "score": 2, "replies": []}]}, {"body": "Ur puts will print fam, fuck Tesla with donkey dildo.", "score": 3, "replies": []}, {"body": "https://preview.redd.it/v2a2vc5sfzrc1.jpeg?width=1290&format=pjpg&auto=webp&s=d6eacc0d3f22f8a7d9138034b24d8cce4b88ddbd\n\nIs we respect this trend 166.50 is on the menu tomorrow", "score": 7, "replies": []}, {"body": "What time is news expected to drop?", "score": 2, "replies": []}, {"body": "We did it Joe!", "score": 2, "replies": [{"body": "386k deliveries 🤮🤮🤮", "score": 1, "replies": []}]}, {"body": "FSD is a scam. Always has been. People paying Tesla to beta test", "score": 8, "replies": [{"body": "Idk how dumb you’ve gotta be to PAY elon $2400 per year to train his models for him lol", "score": 5, "replies": [{"body": "The subscription is crap, 100% agree.  I have FSD, but I bought it outright on my first Tesla (for like $5,000, not the insane $15,000 they charge now) and I had it included on my used X purchase.  After using it and dealing with the bugs and idiosyncrasies for years, I can unequivocally state that it is not worth $15,000, or $199 a month, for a glorified cruise control.", "score": 1, "replies": [{"body": "And I still fail to see how it is a long term revenue generator as a subscription. Eventually it will become like cruise control, which used to be a premium upgrade in cars and is now standard. No one is going to pay $2400 a year for the life of their Tesla for it.", "score": 2, "replies": [{"body": "I already hate paying $100 a year to have my car connected to the internet, but it’s practically mandatory with how the car gets crippled without internet.", "score": 1, "replies": []}]}]}]}, {"body": "For people with money, it's awesome. It's like magic.", "score": 2, "replies": []}, {"body": "💯 ", "score": 1, "replies": []}]}, {"body": "I've got 170 puts for 4/5 so I'm expecting poor delivery numbers but will likely see good guidance. We'll see how it plays.\n\nIt's ran a downtrend last couple delivery calls so fingers crossed.", "score": 2, "replies": [{"body": "I don’t believe they offer guidance during the delivery number releases.", "score": 6, "replies": [{"body": "Exactly. Guidance will come with earnings  in a week or two. I believe tomorrow is just a very small amount you raw data", "score": 3, "replies": []}, {"body": "They've provided reason commentary in this report in the past. \n\nhttps://ir.tesla.com/press-release/tesla-vehicle-production-deliveries-and-date-financial-results-webcast-third-quarter-2023\n\nGuidance can also come in the form of an Elon tweet ;)", "score": 1, "replies": []}]}]}, {"body": "Why not just wait for the number?", "score": 1, "replies": [{"body": "The majority of movement will be made in premarket. Just like CPI data and all big data. So you have to be positioned beforehand.", "score": 2, "replies": [{"body": "Good luck broski, but pray that you just didn’t short into support for a face ripper rally tomorrow.", "score": 1, "replies": []}]}]}, {"body": "I believe it’s buy using tremendous capital to go against retail, blow their stops for a quick bump of volume at an artificial top and then a slower distribution of their position as people on wsb attempt to buy the dip?", "score": 1, "replies": []}, {"body": "Idk but every time it drops to 170 Cathie buys more.", "score": 1, "replies": []}, {"body": "https://ca.investing.com/news/stock-market-news/teslas-chinamade-ev-sales-edge-up-02-yy-in-march-3330341", "score": 1, "replies": []}, {"body": "Can’t wait to short earnings too", "score": 1, "replies": [{"body": "Turns out it is just a car company", "score": 1, "replies": [{"body": "😂🤣🤣", "score": 1, "replies": []}]}]}, {"body": "Congrats OP", "score": 1, "replies": []}, {"body": "You know they announced 6M production on the morning of 03/29, right? I'll let you do the math.", "score": 0, "replies": [{"body": "Right - the Tesla prediction guy came up with production of just under 430k based on this information", "score": 5, "replies": [{"body": "Do you not believe that Tesla can produce 6,000 cars in two days? edit: the median production within a day is 5500 according to Q4'23", "score": 0, "replies": [{"body": "Production is different from deliveries my guy", "score": 11, "replies": [{"body": "He’s not your guy, pal", "score": 10, "replies": [{"body": "I’m not your pal, buddy", "score": 5, "replies": [{"body": "I’m not your buddy, friend", "score": 4, "replies": [{"body": "He’s not your friend, chief", "score": 1, "replies": [{"body": "He's not your chief, not your", "score": 1, "replies": []}]}]}, {"body": "Ima fuck your butt, buddy.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Bag holder detected. You require more vespene gas.", "score": 8, "replies": []}, {"body": "Welfare check. Are you ok? I heard Cathie Wood and Dan Ives are currently offering a trauma bonding support group, free krispy kreme and coffee!", "score": 1, "replies": []}]}, {"body": "I’ve got a 150P hoping to just catch alittle momentum and make acouple dollars", "score": 0, "replies": []}, {"body": "Deliveries will come in higher than expected, stock will moon", "score": 0, "replies": []}]}
