{"title": "Prediction: This Move From Nvidia in the Second Half Will Be Much Bigger Than the Stock Split", "selftext": "Blackwell is the key. ", "id": "1drf1s8", "created_utc": 1719678557.0, "score": 105, "upvote_ratio": 0.92, "num_comments": 38, "comments": [{"body": "Maybe when shit starts picking up, using them, and showing results.", "score": 11, "replies": [{"body": "I think 3rd and 4th qtr are going to be huge.", "score": 22, "replies": [{"body": "It all depends on what Microsoft says about adoption of copilot. If people aren’t scrambling to use it, it’s going to cause the reverse of OPs prediction.", "score": 3, "replies": [{"body": "It doesn’t matter.  Copilot and text based AI are a drop in the computational bucket compared to video and the future of media.\n\nJust go look at any file on your computer.  Document 10kb image 100kb movie 1 gb.  The bottleneck for everything right now is still compute and while the text based bottleneck might be solved the minimum required for video is 1000x bigger.\n\nWith more compute we will just end up finding more ways to use it.", "score": 1, "replies": [{"body": "This. People think AI is gonna be revolutionary for productivity. The biggest ROI on productivity gains are not coming from someone being able to summarize meeting notes or documents faster. AI will change marketing, advertising, design industries (it already is). Anything with a recommendation engine that has a sale waiting at the other end will become much more efficient (ad targeting, search- again, it already is).", "score": 3, "replies": []}]}]}]}, {"body": "Ye and that’s a big if. First movers in tech are rarely market leaders a decade down the track", "score": -1, "replies": [{"body": "they really let anyone make an account", "score": 2, "replies": []}]}]}, {"body": "Statistically, (last 15/20 years of S&P data) this isn't how stock splits play out.", "score": 7, "replies": [{"body": "How does it play out? Curious", "score": 1, "replies": [{"body": "https://youtu.be/qmI6JEC2SJA?si=n6gmlXxhe4ysfzX0", "score": 1, "replies": []}]}, {"body": "most of the studies i've seen on this topic conclude that short and medium time the corelation between split and returns were neutral to slighlty negative relative to baseline, longer term (at 12 months) returns were higher than projected baseline and higher than the benchmark index", "score": 1, "replies": []}]}, {"body": "Does anyone see the similarities in the recent downtrend to what happened in late April this year.  Nvidia lost 15 to 18 dollars worth of share price. In just two weeks.  That was before the huge earnings, stock split, and the announcement of blackwell and rubin.  Then in May and June, Nvidia  climbed very quickly.  If you look between January and late March, Nvidia climbed very quickly also, then in the beginning of April the stock started to level off and drop slowly at first then quickly at the end of the month.  It seems like a normal correction after running up for two to three months.  It seems a large reason is that share holders with large positions take large profits in a pattern after extended run ups.  I am hoping that process has finished and Nvidia is ready to run for a couple of months again. I hope this pattern continues for three to five years.  In the process Nvidia will become a 10 trillion company, Jensen will become a trillionaire, and many millionaires and billionaires will be made from the company.  Both through employment and stock ownership.  Remember during this downturn none of the basics have changed so far.  Nvidia has great leadership, current industry leader in GPU and AI chips, Great software, Even better products in the near future, fantastic sales, great financial records. Let's go Nvidia!", "score": 14, "replies": [{"body": "Nvda $3000 lfg", "score": 2, "replies": []}, {"body": "🚀", "score": 1, "replies": []}]}, {"body": "I see 400 by year’s end.", "score": 2, "replies": []}, {"body": "Very good news !!!", "score": 1, "replies": []}, {"body": "Yes, because Wells Fargo, citi constantly reiterating NViDIA as overweight so huge upside potential is still due in upcoming weeks. I think Once it cross 130 then it might stop at 150.", "score": 1, "replies": []}, {"body": "Right now we’re going through one of those slumps where it has made a big move, it’s resting, a bunch of more good news is coming out but the stock isn’t responding because bulls are tired. Gonna need to be patient and wait for the next wave of data for the bulls to start pushing it higher again", "score": 1, "replies": [{"body": "Y not just call them what they are! Simps!!", "score": 1, "replies": []}]}, {"body": "TBH predictions make me bearish!", "score": 1, "replies": []}, {"body": "What happens when Trump becomes president of again ?", "score": 1, "replies": [{"body": "If Ukraine falls that could jeopardize Taiwan. This is a concern. Chips are made there. That supply needs to be stable.", "score": 8, "replies": [{"body": "i think trump plays putin each way; he cant go against the cia - cia is the real govt and over rides the president; we will keep supplying ukraine for next 10-20 years; it will turn into vietnam. putin controls trump, but trump plays putin making him think he will do what he wants but doesnt fully do it.", "score": -2, "replies": []}]}, {"body": "The market predicted Biden winning already. It’s got some ridiculously high accuracy rate as well", "score": 1, "replies": [{"body": "Hm, but after-hours numbers now suggest Kanye. Fudge, I called wrong.", "score": 2, "replies": []}]}, {"body": "I dont like him but markets wise he’s supposed to be better. Now for the rest I dunno. He’s a felon for starter. That is not a good example, a criminal president could do bad things, no? There are 34 reasons for that to continue.", "score": -7, "replies": [{"body": "Kind of agree on the economic front, provided geopolitics don’t go haywire. With Putin having a ball playing warlord, Xi Jinping waiting for his turn, and Europe steadily forgetting what fascism really means, I'm becoming increasingly worried. After watching part of the surreal debate, it feels like unleashing a mad dog to play with the pack to a blood feast", "score": 0, "replies": [{"body": "Greed is good!", "score": 0, "replies": [{"body": "Is it really, if not for the mind, nor for the body nor the stock market, then for what?", "score": 1, "replies": [{"body": "It’s not that it’s good or bad in the Biblical  sense, but it’s the ultimate engine for doing things, the ultimate motivation, without any feelings.", "score": 0, "replies": [{"body": "Why 'greed' specifically, since it is inherently excessive? Greed is blind, infatuated, and reckless—an untamed desire that ultimately destroys itself through its lack of restraint. It’s not a true motivation, but a wildfire that consumes not only the means for it to grow but also its own source. Far from being devoid of feelings, it’s a tangle of self-centered emotions blinded by the illusion that others' needs are merely obstacles.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Prediction: I need tp for my bunghole", "score": -11, "replies": [{"body": "As you command Cornholio", "score": -1, "replies": []}]}, {"body": "This is Enron 2.0. I made a whole explanation but it isn't worth sharing because you can't change peoples minds once they've decided. It's called bias. Don't say i didnt warn u (not financial advice)", "score": -9, "replies": [{"body": "Made a whole ass explanation and comment but “not worth sharing” but also not financial advice. Okay dude", "score": 2, "replies": [{"body": "Not worth sharing because nobody will belive it anyways. Because everyone here is BIAS. PPL LIKE U ARE WHY I DIDNT SAG IT ok dont be mad when it crashes after the sec investigates", "score": 1, "replies": [{"body": "I’d like to get the gist of it.  Having more info and inputs are always welcome by me :)", "score": 1, "replies": [{"body": "Nothing in his comment history about it. The explanation must of went to a different school, do we don’t know it.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1drbn5q", "created_utc": 1719669032.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 38, "comments": [{"body": "[removed]", "score": 42, "replies": [{"body": "Fuck private airplanes. A yacht is the ultimate way of telling the world you are doing good.", "score": 10, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Smartest thing youve said all day", "score": 11, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "What do you know about that brokie🤣", "score": 2, "replies": []}]}]}]}]}, {"body": "Tax deductible too! And let the kids sell instead to lock in that new cost basis ![img](emote|t5_2th52|8882)", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "His own private one?", "score": 3, "replies": []}]}, {"body": "Unless they feel the stock is overvalued. Then they sell to capture gains and pay off the previous debt.", "score": 0, "replies": []}]}]}, {"body": "https://preview.redd.it/llyx2x93ri9d1.jpeg?width=1164&format=pjpg&auto=webp&s=53f3e87d43dbfb420c46f876b4eb5b62dd253ad5\n\nPrices at the night market went up.", "score": 15, "replies": []}, {"body": "What else would he sell. Google?", "score": 25, "replies": [{"body": "Signatures on boobies", "score": 7, "replies": [{"body": "Alpha CHAD", "score": 1, "replies": []}]}]}, {"body": "CEOs are allowed to take profit. It's when they do it frequently and in large sums that you have to be concerned.", "score": 6, "replies": []}, {"body": "Yh it means he is dumping and will let nvidia burn /s\n\nWhat do you think? The guy who loves working in his own business selling 0.01% of his shares means he is gonna leave the company? 😭", "score": 12, "replies": [{"body": "[deleted]", "score": -20, "replies": [{"body": "How many puts did you buy?", "score": 10, "replies": [{"body": "[deleted]", "score": -12, "replies": [{"body": "If you work in it then surely you realize the megascale datacenters coming online over the next 5 years that are going to be full of NVIDIA hardware no?", "score": 4, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Cool but in the mean time they are printing money and the contracts on hardware are already signed.", "score": 3, "replies": []}, {"body": "In 5 years", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "He’s scheduled to sell more this week. He’s been selling 120k shares everyday for 11 days so far. He going to sell more this week. Hold on your nut sack boys!", "score": 5, "replies": []}, {"body": "He is simply realizing those 100,000%+ gains", "score": 3, "replies": [{"body": "Good enough to screenshot, good enough to sell, must have finally taken a screenshot", "score": 1, "replies": []}]}, {"body": "It means he's smarter than us... He takes his gains when they're on the table", "score": 2, "replies": []}, {"body": "There's many reasons for insiders to sell, only one reason fot insiders to buy.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Says the IRS when loans are tax free, and when taking profits require people to pay taxes.", "score": 2, "replies": []}]}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Why wouldn't he sell? He would be an idiot to not sell after the company ran up this much.", "score": 1, "replies": []}, {"body": "The boobies marking the top would be so ironic", "score": 1, "replies": []}, {"body": "Go back to working for Wendy's. I want my quarter pounder", "score": 1, "replies": []}, {"body": "Yea it means we wants to buy a 250 million dollar NYC penthouse", "score": 0, "replies": []}, {"body": "He did not believe in nvda anymore!!!", "score": 0, "replies": []}]}
{"title": "😈", "selftext": "[removed]", "id": "1drf9h7", "created_utc": 1719679135.0, "score": 168, "upvote_ratio": 0.93, "num_comments": 37, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 4 weeks ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 8 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Not sure the bank will miss my $3.50.", "score": 71, "replies": [{"body": "yeah but imagine how pissed you'll be when they say they don't have it..", "score": 30, "replies": [{"body": "aaaaaaand it's gone.", "score": 7, "replies": []}]}, {"body": "Tree fiddy!? Damnit monster!", "score": 6, "replies": []}, {"body": "God damn Lochness monster", "score": 4, "replies": []}, {"body": "Ironically, 100 people all pulling out 5 bucks would probably do it.", "score": 1, "replies": []}, {"body": "You mean 3.50 contract!!!", "score": 1, "replies": []}]}, {"body": "Joke's on you. I'm doing it a day early so I know I get mine out.", "score": 14, "replies": []}, {"body": "Bro forgor he posted on WSB - The land of the broke ![img](emote|t5_2th52|4271)", "score": 10, "replies": [{"body": "Idk...I see quite a few millionaires here...", "score": 2, "replies": [{"body": "We haven't seen their full history in trading though ![img](emote|t5_2th52|4275)", "score": 3, "replies": []}, {"body": "the minority tho", "score": 2, "replies": []}, {"body": "Yeah, in JPY or ZWL", "score": 1, "replies": []}]}]}, {"body": "Damn that could cause like a $1 loss", "score": 10, "replies": []}, {"body": "Sweet Jesus ![img](emote|t5_2th52|4640)", "score": 7, "replies": []}, {"body": "Causing this to happen would be a bank run and cause the same issues as the last time it happened.  Banks don’t have alot of cash so it would cause issues.  My wife and I tried to withdraw 15k for some furniture and they refused because they said they had a 5k max I was livid and after they looked I. Our account they made the exception but I I also threatened to close my account that day as well.  We had over 150k in the account.", "score": 9, "replies": [{"body": "At smaller branches you’re supposed to let them know in advance so they can order it. It’s risky to keep lots of cash on hand.", "score": 8, "replies": [{"body": "We were trying to do a debit purchase but the bank kept denying it even when we called to tell them we were trying to make the purchase.  It was a frustrating day to say the least.", "score": 1, "replies": []}]}, {"body": "Thats seems like we all can fuck up the bank, and if they dont let us, thousands of lawsuits coming in", "score": -1, "replies": [{"body": "That’s not how any of this works\n\nYou’d get your cash once they bring it to your local bank\n\nYou can’t file a lawsuit just because you didn’t wanna call ahead and now you gotta wait a day", "score": 2, "replies": []}, {"body": "Maybe it’s a fight for sure.", "score": 0, "replies": []}]}]}, {"body": "I’m in!", "score": 2, "replies": []}, {"body": "Ya'll got monies to withdraw?", "score": 2, "replies": []}, {"body": "Withdrew 45k and had no issues", "score": 2, "replies": []}, {"body": "ive done it now im a rebel", "score": 1, "replies": []}, {"body": "Chill bro I have leaps", "score": 1, "replies": []}, {"body": "Prisoner’s dilemma", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4259)", "score": 1, "replies": []}, {"body": "Totally in!!!", "score": 1, "replies": []}, {"body": "So I have to pay my past due balance to zero out ![img](emote|t5_2th52|52627)", "score": 1, "replies": []}, {"body": "What if I don’t have enough in the bank to even cover the atm fee though? ☹️", "score": 1, "replies": []}, {"body": "National day in France why not...🤣😂🤣", "score": 1, "replies": []}, {"body": "instruction unclear, I seem to have pulled out their money", "score": 1, "replies": []}, {"body": "Bank : “no”", "score": 1, "replies": []}, {"body": "Yeah, no.", "score": 1, "replies": []}]}
{"title": "Calls on INTC & Puts on NVDA", "selftext": "INTC will replace TSMC when China invades Taiwan. Intel is the only company which would be allowed to be a part of the merger conversation. Intel's P/E ratio is insanely low. Insiders are bullish. They still have the same revenue as NVDA. AI computers.\n\nNVDA has run up way too much 3.5 trillion valuation for a company that makes 60B in revenue? AI still hasn't generated a penny of revenue. House of cards will coming fall down hard quick.", "id": "1drle90", "created_utc": 1719696158.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 41, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 5 months ago\n**Total Comments** | 82 | **Previous Best DD** | \n**Account Age** | 6 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "China Invades Taiwan and the whole market will be on sale.  Economies will dump, it will be a complete reshaping of the world economy.  I don't know how it ends, whose on top, who gets crushed, but it will not be pretty.", "score": 40, "replies": [{"body": "China invades Taiwan prior to the TSM USA factory being up and running and it’s basically war. Would we do a direct open confrontation? Maybe not. But there will be covert US military support like subs sinking Chinese ships. We would ship Taiwan modern, current generation weapons and systems. Ukraine got plastic tinker toys in comparison to the support Taiwan would get. \n\nAlso OP you are like 5+ years behind in information and also misinformed. AI has already been useful and profitable. Ever heard of generative design? Nvm probably not, they don’t usually discuss engineering on the fry line in Wendy’s.\n\nI say this as someone who is long INTC", "score": 11, "replies": [{"body": "Thats the conventional wisdom and one I tend to believe, but then again,  don't underestimate the power of greed. I'm sure there are  powerful  people who would say, sucks for Taiwan, but would see if they could make a deal.", "score": 1, "replies": [{"body": "Allowing, effectively, control and hardware access to US military tech (TSM makes chips powering pretty much all US tech from Nuclear Carriers to guided missiles) is a non-option for the USA. I think that’s the part that people gloss over.\n\nThere is no conceivable deal that the US comes out on top of in that situation.\n\nYou are talking about a deal that would compromise the entirety of US military assets.", "score": 3, "replies": []}]}]}]}, {"body": "Some strong cope in the air this weekend.\n\nNVDA would never buy a foundry.  Ever.\n\nThey make enough money WITHOUT having to spend over 25B a year building new fabs to master the most difficult manufacturing process on earth.\n\nAlso if Taiwan was invaded tomorrow Intel would lose their entire new laptop chip production since TSMC manufactures all of the compute tiles on the Lunar Lake SoC.", "score": 20, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 2, "replies": []}]}, {"body": "I actually like INTC on a fundy standpoint. But I think they are gonna take hits every time NVDA takes hits and they don't see the upside. I think the price will be fairly horizontal until the bubble pops and then I might buy.", "score": 6, "replies": [{"body": "insurance vegetable yam retire hateful hat deserted foolish scandalous lush", "score": 10, "replies": [{"body": "I agree.", "score": 3, "replies": []}]}]}, {"body": "Lol this guy must be holding intel bag for the last 20years. ![img](emote|t5_2th52|4271)", "score": 11, "replies": []}, {"body": "intc is an attractive m&a target.\n\nnvda buyouts intc; a win-win for all 🤷‍♂️", "score": 8, "replies": [{"body": "But who would be allowed to buy them?\n\nNVDA wasn't even allowed to buy arm.", "score": 1, "replies": [{"body": "why not?  current sentiment believes intc is no longer a dominant or relevant player in the chip sector.  \n\non the ther hand, licenseea of arms were against nvda/arm merger.", "score": 1, "replies": [{"body": ">intc is no longer a dominant or relevant player in the chip sector\n\nThe biggest/second biggest shipper of chips is not relevant anymore?\n\nwhat?", "score": 1, "replies": [{"body": "stock price certainly doesn't reflect that 🤷‍♂️", "score": 0, "replies": [{"body": "ok?", "score": 1, "replies": [{"body": "🤷‍♂️", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "INTC 25 for earnings then it will start making it's way towards 50 in the coming quarters... It's got one more tank in the tank before it goes uppies.", "score": 5, "replies": []}, {"body": "Oh wow let's see how this plays out", "score": 3, "replies": []}, {"body": "If China invades Taiwan, there'll be no Asus, Gigabyte, MSI etc etc. There'll be almost no motherboard manufacturers to pit Intel's shit into.", "score": 3, "replies": []}, {"body": "Calls on Lockheed Martin![img](emote|t5_2th52|8882)", "score": 3, "replies": []}, {"body": "https://www.tomshardware.com/news/intel-to-spend-dollar97-billion-on-tsmc-outsourcing-in-2025-goldman-sachs", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Fellow bag holder spotted.", "score": 2, "replies": []}, {"body": "China invading Taiwan would start WW3.", "score": 2, "replies": []}, {"body": "You do realize even though china is ramping up show of force exercises they’re just full of hat air right now they are so far behind US in military technology and vehicles but are catching up. The problem is the only thing they’re beating the US in is soldiers. China is too big to actually invade and Taiwan is too small to send excessive numbers of ground troops though. Yes they can overwhelm Taiwan but the US has so many troops positioned in striking distance they would be sitting ducks. Japan also has/ will have 100s of f35s. You do realize the US has 120k+ troops in Japan, we have air bases in Okinawa. Our planes are 20 minutes away in .86 Mach. And have enough fuel. Same with Philippines. Since Russia didn’t overwhelm and succeed in Ukraine the door way closed for china to do this anytime soon. Also what would happen is china would be in a war with the US India Japan Philippines Australia South Korea. They will be so busy fighting everyone Russia will literally put of a fence where ever they want and there is nothing china can do about it. It’s not happening anytime soon. Smoke and mirrors. I think you guys forget the US is the only country with more than 2 aircraft carriers.. and they have 11 carriers groups.. 3 more being made as as we speak. China can have its way with Taiwan, but they are not ready or prepared for taking on the war after. Their balls won’t drop until at least 2030.", "score": 2, "replies": []}, {"body": "Aite... here is my opinion as an engineer who works in this field.\n\nThe name intel used to mean something. Maybe 10 years ago. But then it slowly and slowly became a second tier company to work for. Why? Because it does not pay its engineers a competitive salary.\n\nWhenever you see a tech company not pay its engineers  competitive salaries, it's almost guaranteed that the company will fall behind in a few years. The management may like saving whatever dollars they can so their numbers would look great, but innovation comes from engineers, and there are just way too many jobs out there that engineers can go take if they feel like they aren't fairly compensated.\n\nIntel has definitely become a second tier place to work for. It's been like that for at least 5 years now. It's gotten much worse, and I doubt they can recover their reputation as now they are in no position to offer competitive salary as they make no money. A huge blunder and honestly their c suites should all be fired.\n\nAnyway, nvidia has a great leadership, pays very well, attracts all the top talents. So long as this doesn't change, nvda will be doing very well.\n\nThere are few other companies I also wanna mention but maybe for some other times. Just look at levels.fyi and check out engineer compensation. Companies will do as well as how they pay their engineers.", "score": 2, "replies": []}, {"body": "OP, did you not know TSMC has a factory being built in AZ?", "score": 1, "replies": [{"body": "Which won't produce cutting-edge chips.", "score": 1, "replies": []}]}, {"body": "thanks for the good laugh.", "score": 1, "replies": []}, {"body": "Facts… going be printing cash very soon", "score": 1, "replies": []}, {"body": "So true..", "score": -1, "replies": []}, {"body": "wholesale intc baggie spotted", "score": 0, "replies": []}]}
