{"title": "[deleted by user]", "selftext": "[removed]", "id": "1d6rbcz", "created_utc": 1717373263.0, "score": 28, "upvote_ratio": 0.72, "num_comments": 31, "comments": [{"body": "puts on SPY", "score": 26, "replies": [{"body": "puts on Earth", "score": 5, "replies": []}, {"body": "I invested some money in a Vanguard ETF that tracks the S&P500 earlier. \n\nThe title along made me write that money off as gone.", "score": 1, "replies": []}, {"body": "Golden age for those buying puts on SPY, that is", "score": 1, "replies": []}]}, {"body": "Is the golden age in the room with us ?", "score": 13, "replies": []}, {"body": "TLDR I’m regarded", "score": 23, "replies": [{"body": "You’re gonna do 80 hours work a week for a robot so that a different robot will suck your dick after work.", "score": 13, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Not a bad deal.  I’m in.", "score": 2, "replies": []}]}]}, {"body": "Pass the bong mate. I want a hit of that shit.", "score": 9, "replies": []}, {"body": " supercycle top confirmed,  the Great Great Depression incoming.", "score": 14, "replies": [{"body": "The Greatest Depression.   \nYuge.", "score": 1, "replies": []}]}, {"body": ">No matter where you are now, you are reading this on a digital forum on a super computer. Try explaining this to someone even 30 years go, let alone 300.\n\nI, Robot was published in 1950.", "score": 5, "replies": []}, {"body": "https://preview.redd.it/0ej7spoa494d1.jpeg?width=852&format=pjpg&auto=webp&s=8780dcb5057d6ccab006a54fd2d551b67d27329f\n\nAnd yup. I fixed some spelling in the original.", "score": 6, "replies": []}, {"body": "I come here for bad investing pieces not bad motivational pieces.", "score": 8, "replies": [{"body": "Us bag-holders can't differentiate", "score": 2, "replies": []}]}, {"body": "So buy NVDA?", "score": 3, "replies": []}, {"body": "I firmly believe that the world we are all currently experiencing, are the last days of the old world. Ai and eventually AGI will be the next step in human evolution. And it’s going to happen faster than we expect.", "score": 6, "replies": [{"body": "Unless it starts tomorrow, it's not happening fast enough", "score": 3, "replies": []}]}, {"body": "PARADIGM SHIFT // THIS TIME ITS DIFFERENT???", "score": 2, "replies": []}, {"body": "Nvidia calls.", "score": 2, "replies": []}, {"body": "we're on the brink of climate disaster.  we're close but we might miss the bext step by a mile if we continue on this path. AI needs to speed up so we can solve our problems", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 2025 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "Not true boss. The bers been posting up a storm about the economy is fucked and the real estate market is tanking and inflation is gonna bankrupt everybody and leave retail stranded. I mean those same bers been saying this for a couple years now but I bet this time they finally right. So anyways tough break", "score": 1, "replies": []}, {"body": "I like the response this is stirring up, I enjoy a good laugh", "score": 1, "replies": []}, {"body": "So many signs point to a bubble. Which, there’s nothing that says a bubble needs to pop imminently. Maybe it’s another 1, 2, 3 years, but we’re going to have a crash event.", "score": 1, "replies": []}, {"body": "blah blah blah no positions\n\nnostradumbus", "score": 1, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/da7fdbp7894d1.jpeg?width=228&format=pjpg&auto=webp&s=654b42990c83729f50a58d24f803a8cc66b1bb04", "score": 1, "replies": []}]}
{"title": "$GRAB: the Asian Uber poised for growth", "selftext": "If you've ever ridden in a tuktuk, you probably know what Grab is. It's essentially the Uber of Asia, extremely commonly used throughout the region. They posted their first profitable quarter earlier this year. Revenue in 2023 was $2.48B, up from $1.43B and $0.67B in 2022 and 2021, respectively. This company is growing, fast.\n\nIt's very clear that this stock is still in the very earliest stages of growth. Banks including JPM, Citi, and HSBC all have price targets above the current stock price, and every rating is a buy or strong buy.\n\nAs a regular Grab customer, I can safely say that nearly every rideshare driver uses the platform in my area. It can also be used to deliver food, or even as a courier service if you want anything delivered from a particular business or person. I will be buying in the coming days, but wanted to seek fellow regards' opinions and have a bit of discussion beforehand.\n\nI'd love to hear your thoughts.", "id": "1d6zqm0", "created_utc": 1717404155.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 38, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 3 months ago\n**Total Comments** | 246 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Bagholder shilling ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)", "score": 11, "replies": []}, {"body": "Three days ago, I ordered a pizza via Grab. Said it would be here in an hour at 10pm. But every few minutes they'd push back the delivery time by 20-30 minutes. The delivery time changed at least 4 times. The final one was like 11:30, but at around 11:15, they canceled the order.\n\nThe entire time, there was no way for me to cancel. Tapping cancel would just tell me that I can't because the order was already in the kitchen.\n\nBullshit. They didn't make a pizza and then cancel me. No way.\n\nGrab is a shitty company. The upside is that it's pretty much the only game in town for all of SEA, so they \\*should\\* see a lot of growth. Question is, are they going to grow the company properly or mismanage themselves into bankruptcy?\n\nEdit: it's not because they canceled that I think they suck. It's because they gave me no option to cancel even though they hadn't started cooking my food, and they hadn't even found a driver the entire time! That really pissed me off. And then after waiting almost two hours they cancel and that's that?? Fuck these guys I hope they fail. Food panda is the only one in the running though.", "score": 15, "replies": [{"body": "Same shit happened to me. Sat in my hotel for like 3 hours starving till I just said fuck it and ordered some shitty hotel food.", "score": 2, "replies": []}, {"body": "Yeah the app has some pretty annoying issues, like when you’re getting a ride somewhere and realise you’re going to the wrong place because the search function on maps is awful, then try and change the destination or cancel the ride and it’s literally impossible.", "score": 1, "replies": []}, {"body": "Sorry you had that kind of experience. One thing you should consider though is that this is anecdotal evidence only. I've also used Grab, many times, without a single issue. There will always be failures on the part of a restaurant or deliverer. Same in Uber, DoorDash, Instacart. However, it's the ratio of those occurrences that really matters, not the simple fact that they do occur. I agree that they should see a lot of growth, and I think they will.", "score": -11, "replies": [{"body": "One thing you should consider is your evidence is anecdotal only. So your ratio is 50/50", "score": 5, "replies": []}]}]}, {"body": "I fell for the \"this will be just like amazon\" trap with coupang and bought it at its high of around 45. I have been bag holding ever since and its around 20 something right now.", "score": 7, "replies": []}, {"body": "I am very intrigued in this one. I traveled to Thailand and Grab was very prevalent pretty much everywhere.  \n\nI’m an accountant (CPA) and I took a look at their 10k (whoops it’s a 20F I guess, not 10k) and honestly their core financial statements look fairly solid. Net loss overall but positive growth year over year, strong cash on hand, and positive cash flows from operations. However, their equity stuff in particular is crazy confusing for me to really nail down.  \n\nI’m going to spend some more time researching the company to see if I can make sense of it all, but they have a lot of confusing shit going on equity wise (to me at least lol)  \n\nEdit: upon closer review it looks like the positive cash from operations is largely attributable to deposits from customers in banking operations so that’s less of a selling point IMO, but I guess the expansion into banking could be interesting as that looks to be something heavily entered into in 2023", "score": 12, "replies": [{"body": "Thanks, that helps.", "score": 2, "replies": [{"body": "No problem, take my thoughts with a grain of salt. Analyzing public companies isn’t really something I do often nor do I think I’m that great at it. I mostly invest in index funds lol", "score": 3, "replies": []}]}]}, {"body": "Agree. \n\nTotally undervalued.\n\nWhat's your thoughts on a target? Anywhere near double figures?", "score": 3, "replies": []}, {"body": "My brother lives in Malaysia and that’s all they use for all kind of deliveries from food to groceries and he rides Grab car everywhere", "score": 4, "replies": []}, {"body": "You posted the exact same thing 18h ago. Whats your position?", "score": 3, "replies": []}, {"body": "I usually only trade us markets \n\nI use grab every single day to order food \n\nWhere can I buy it?\n\nI definitely want to own stock in this", "score": 8, "replies": [{"body": "It's on the NASDAQ!", "score": 2, "replies": []}]}, {"body": "I just remember the old .38 Special song \"hold on loosely, but don't let go\" going through my head as we careened through Bangkok traffic on the back of a motorcycle as I listened to the high-pitched sing-song voice of the young guy actually in control of the bike hollering at me that I must \"hold on me tighter!!\"\n\nMixed emotions, for sure.\n\nBut, I do like this stock.\n\nEDIT: **They NEVER had a helmet that actually fit my generously endowed cranium. Take that for what it's worth when evaluating this stock.**", "score": 3, "replies": []}, {"body": "I have a lot of $GRAB in my retirement account. Give it some time", "score": 3, "replies": []}, {"body": "[removed]", "score": 6, "replies": [{"body": "Grab has far lower variable costs bc drivers are paid FAR less in Asia than in the US and western nations.", "score": 6, "replies": []}]}, {"body": "Lolol third world Uber", "score": 2, "replies": []}, {"body": "I have about 9 long term options and constantly looking to double down anytime it’s low. \n\nI’ve traveled personally to Malaysia, Thailand, Indonesia, and Singapore, and I used it in all those area. Wife also lived in Malaysia for 3 months and used it multiple times to travel and order food.", "score": 2, "replies": []}, {"body": "Here's the problem with GRAB, if you've ever used it in Asia, people use it to quote a price and then you pay your cab directly. They have no moat for this.", "score": 3, "replies": [{"body": "I live in Asia and don't really know anyone who has ever did this.  You are talking out of your ass", "score": 2, "replies": [{"body": "I'm definitely not - I've been to Thailand and this is exactly how their cabs operated - you would show them your phone and they would agree to that price. Meeting others in hostels they said this is how it worked in many other places too.", "score": 1, "replies": []}]}]}, {"body": "I’ve been on the fence on this one awhile. Feet on the ground reports are what made me hold back, actually. I’d read negatives. I did start a tracking position before last earnings and just a few calls. The uptick on earnings was smaller than I anticipated, and no steady rise after. It’s difficult for me to assess their business with so many different aspects. So far, I’ve held back scaling in and sold all but one call at 10% up and am keeping the shares to track. It’s confusing to me, though the comment above clarifies a bit with regard to banking. Increasing profits are encouraging, which is my go to…", "score": 1, "replies": []}, {"body": "Ah yes the fantastic app where the driver cancels after making you wait for 20 mins , with another one after who does the same or worse, doesn’t show up.", "score": 1, "replies": []}, {"body": "I specifically want to know what will make them different than e.g. Uber in your opinion. All these rideshare companies, I don't believe in their business model.", "score": 1, "replies": [{"body": "Grab is a super app essentially, where you can order all kinds of things. There are a plethora of drivers around cities in SEA, so service is prompt. Drivers use motos, for the most part, making them more mobile than cars throughout the city, resulting in faster delivery. Concentration on Asia results in lower variable costs, due to far lower independent contractor wages. These together make it a good business.", "score": 2, "replies": []}, {"body": "Grab is fantastic imo. I've never enjoyed using Uber.\nGrab just has a lot more on the app and is more enjoyable to use and relatively cheap. There have been cheaper alternatives to Grab, but I think they didn’t take off due to worse user experience", "score": 2, "replies": []}]}]}
{"title": "Is this the end?", "selftext": "This year I have blown my entire account on 0dtes. I remember the exact moment I discovered 0dtes. I was trading MSTR on my phone on the bus going to my class and I saw a gain of $100 in about 5 seconds. But did I sell? No. That moment is where everything was over. I continued to try and win big using 0dtes on QQQ, AAPL, MSTR, telling myself if I just got that one big play I could dig myself out of this hole. Of course, I was gambling. By the end I knew I was gambling but I didn’t care. Once a position went red I couldn’t get myself to sell. I remember one time I was hanging out with my girlfriend and I noticed that I had just gotten another daytrade available, so I instantly looked for a reason to use it on 0dtes. The position went red quickly and I turned off my phone and fell asleep, telling myself the position would be green in no time. I lost 1.5k that day, about one third of my account. This was money I had saved my whole life, money that gave me freedom to have fun. I should probably delete robinhood, but next paycheck I get I’m using for 0dtes because I can never give up, my dream is to go viral on wallstreetbets for gaining back all my losses using 0dtes, and I know I that this is just one obstacle. Hopefully this post makes someone feel better about themselves, because I have now made my life considerably worse for at least the next few days.", "id": "1d78sms", "created_utc": 1717432415.0, "score": 3, "upvote_ratio": 0.53, "num_comments": 42, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 2 weeks ago\n**Total Comments** | 3 | **Previous Best DD** | \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Yeah its the end.... If you quit like a bitch", "score": 24, "replies": []}, {"body": "You got this dude.", "score": 8, "replies": [{"body": "He can turn $700 into $2,000+ by EOW… just need to get lucky on NVDA 0DTE.", "score": 7, "replies": []}]}, {"body": "> my dream is to go viral on wallstreetbets for gaining back all my losses using 0dtes\n \nYou'll need more losses then, $5k gains never go viral.", "score": 16, "replies": [{"body": "You’re right man, I guess my journey has just begun", "score": 1, "replies": [{"body": "journey to hell", "score": 7, "replies": []}, {"body": "Yup. Keep losing money then try that", "score": 3, "replies": []}, {"body": "journey to homelessness", "score": 3, "replies": []}]}]}, {"body": "Not yet, $786.37 to go! Godspeed you, friend!", "score": 2, "replies": []}, {"body": "Or a new beginning…", "score": 2, "replies": []}, {"body": "ok gay boy ... happy pride month get out there and dont be ashamed !!!! NOTHING to be ashamed of :) ! WE support you <3", "score": 2, "replies": []}, {"body": "That’s just the tuition for learning to trade", "score": 2, "replies": []}, {"body": "This is only the beginning.", "score": 1, "replies": []}, {"body": "Consider this the beginning, a new beginning with a new, better strategy after leaning from experience", "score": 1, "replies": []}, {"body": "Robinhood gold could’ve earned you 5.5%", "score": 1, "replies": []}, {"body": "The remaining 700 you have you can use for an option play. I trade SPX 0DTE. Here’s the proof. You got this.\n\nhttps://preview.redd.it/5i4g8xwc5e4d1.jpeg?width=1170&format=pjpg&auto=webp&s=43eeb29c3ca86ba5a8f75ac11dd12073e1441939", "score": 1, "replies": [{"body": "When did you buy this?", "score": 1, "replies": [{"body": "This was Friday", "score": 1, "replies": [{"body": "You got lucky as the crazy last 30 minute pump on Friday doesn't happen often, IMO.", "score": 1, "replies": [{"body": "Call it what you want but I’ve been profitable. These past months. So sure it’s luck.", "score": 1, "replies": []}]}]}]}]}, {"body": "Until -99% almost there", "score": 1, "replies": []}, {"body": "Did you hear a bell?!?!?!", "score": 1, "replies": []}, {"body": "https://preview.redd.it/ton21nnzkf4d1.jpeg?width=1911&format=pjpg&auto=webp&s=b240b2165a5cf03e2e2b6d59c1c84c2d8565f881", "score": 1, "replies": []}, {"body": "\"You are just being tested \" - Don't quit now", "score": 1, "replies": []}, {"body": "No, you will continue gambling", "score": 1, "replies": []}, {"body": "Finish the job.", "score": 1, "replies": []}, {"body": "You have a gambling addiction, seek help now while it’s only claimed a relatively small amount of your money", "score": 1, "replies": []}, {"body": "Even close to the end. I’ve been down to 400 two separate times. Back to to 4K now and risking less on trades", "score": 1, "replies": []}, {"body": "At least you have the gold perks!", "score": 1, "replies": []}, {"body": "ur gf has a new BF now!!!", "score": 1, "replies": []}, {"body": "Spy puts have hit 4/4 times now $650 Ina Week small gains but I’m just getting into 0dte", "score": 1, "replies": []}, {"body": "Uninstall the game.", "score": 1, "replies": []}, {"body": "No commrade premier, it is only the begin.", "score": 1, "replies": []}, {"body": "No, you keep until you make it!", "score": 1, "replies": []}, {"body": "You know what always helps me is when I lose 5K some one on Reddit has lost 500k makes it easier", "score": 1, "replies": []}, {"body": "AAPL CALLS GOGOGOGOGOGO", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4258)", "score": 1, "replies": []}, {"body": "You lose it at the Moment you sell", "score": 1, "replies": []}, {"body": "Please don’t post anything with less than five digits", "score": -1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1d7g1qg", "created_utc": 1717449903.0, "score": 7, "upvote_ratio": 0.59, "num_comments": 36, "comments": [{"body": "That's a whole lotta words too bad I'm not reading them ![img](emote|t5_2th52|4271)", "score": 66, "replies": []}, {"body": "My DD: LNTH has been around 68 years and has a $5.7 billion market cap.", "score": 12, "replies": [{"body": "What was the other stock he mentioned? LNTH and what?", "score": 1, "replies": []}, {"body": "[deleted]", "score": -7, "replies": [{"body": "No, never heard of it until now.", "score": 11, "replies": [{"body": "Idk why this was so fucking funny", "score": 3, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "Honestly I have brought on and did some projects at a health system on some of their products. \n\nThought of investing in them once or twice but it's pretty niche in imaging.", "score": 1, "replies": []}]}]}]}]}, {"body": "I tried to read that novel but got bored.  Learn to add a TLDR at the top plz", "score": 9, "replies": [{"body": "Novel 😂🦧", "score": 1, "replies": []}]}, {"body": "Your model doesn't work. If the company you are investing doesn't say AI at least 100 times on each earnings call then is trash.\n\nInstead of looking at P/E or PEG or P/S indicators look at AI/EC (AImentions/EarningsCall) .. NVDIA has more than 200 of that indicator.", "score": 9, "replies": [{"body": "#AI", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Only mentions AI 2 times, needs 50x", "score": 8, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Bullish!!", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "…uck your mom.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "That's a lot of words to just say you screened for companies with good net earnings growth and sales growth. Correlation does NOT imply causation.\n\n> It is not AI, or whatever the current BS reason mass media is giving you for the increased sales and earnings. None of that matters.  \n  \nI'm gonna have to disagree with that. AI is a huge factor in NVIDIA's success and the increased sales and earnings.", "score": 8, "replies": []}, {"body": "Hmmmmm, thanks, I’ll stick with nvda ![img](emote|t5_2th52|4275)\n\n(I didn’t bother reading all that btw!)", "score": 7, "replies": []}, {"body": "Maybe start w NVDA customers?", "score": 2, "replies": [{"body": "faulty dolls wasteful air offend wipe water abundant zesty paint", "score": 1, "replies": [{"body": "Already in", "score": 1, "replies": [{"body": "innate husky humorous dinosaurs escape memory sparkle concerned crawl lavish", "score": 1, "replies": []}]}]}]}, {"body": "Several of my screeners focus on growth metrics, which I personally consider fundamental vs quantitative. The name of the company looked familiar, and as it turns out I’d looked into it recently. That I didn’t watchlist it isn’t a negative, as I simply have far too many tickers I am tracking. And I do look into other fundamentals and management in depth. Anyway, looked again this evening and it looks promising in some ways. The only concern I foresee is growth leveling off. It’s on my biopharma list now, for further DD, thanks. And good luck!", "score": 2, "replies": []}, {"body": "Nvidia is the next Nvidia", "score": 2, "replies": []}, {"body": "No pictures ? Lame.", "score": 2, "replies": []}, {"body": "no", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 698 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "the next NVDA is NVDA in 5 years", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "I think I’m in lol will decide if I’m going full crayon eating mode by the time i get home. You seem like you know what you’re talking about.", "score": 1, "replies": []}, {"body": "Fuck it. I'll throw a few bucks at it.", "score": 1, "replies": [{"body": "What was the other stock he mentioned?  LNTH and what?", "score": 1, "replies": []}]}, {"body": "lol nice write up OP fk it I’m in", "score": 1, "replies": []}, {"body": "So much words for NOTHING", "score": 1, "replies": [{"body": "Do you know about the word 'many'?", "score": 1, "replies": []}]}, {"body": "Just ask chat got what to buy ffs", "score": 1, "replies": []}, {"body": "why dont you back test it", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "ok but your \"model\" is a bullshit metric right now, what if you took financial figures from back in the day to \"find\" the next big thing(apple, microsoft)", "score": 3, "replies": []}]}]}]}
