{"title": "I did a comprehensive prediction of NVDA stock prices by 2025 using Monte Carlo, ARIMA, and LSTM models in Python. Shall we see :D", "selftext": "", "id": "1dhlbtm", "created_utc": 1718583662.0, "score": 35, "upvote_ratio": 0.79, "num_comments": 36, "comments": [{"body": "This is a subreddit dedicated to building a professional environment to analyze NVDA stock. Posts without descriptive analysis will not be tolerated unless it is an article or video sharing informative information.\n\nFor posts like this please add them in the Daily Discussion thread pinned at the top of the subreddit each day. Thanks!", "score": 1, "replies": [{"body": "Yea because every single post in this \"hello i bought nvda\" subreddit is top quality and very professional... Bye", "score": 1, "replies": []}]}, {"body": "Seems legit 👍", "score": 28, "replies": [{"body": "I'm a quant. Seems legit to me too", "score": 10, "replies": []}]}, {"body": "Let’s just add another 0 to the end of that and I’ll happily retire before I turn 40.", "score": 10, "replies": []}, {"body": "I’m not greedy.. 200 in 2025 is enough to make me happy.", "score": 8, "replies": [{"body": "I am waiting for 294 :)", "score": 1, "replies": []}]}, {"body": "What’s with all these simulation posts recently. This is literally just using historical returns to simulate possible outcomes in the future. What do they say about past performance in every fund advertisement?", "score": 16, "replies": [{"body": "They contradict themselves in every advertisement, guide, forum post, talk and then put on the clown makeup. It’s “past performance doesn’t predict the future performance” and ends in “invest in an index fund because average past performance has been +x% per year so you should be good”. Just the same bullshit but wishing for lower risk. Hedging and using option for risk management isn’t really in the realm of average people investment compared to “number goes up, green good”, too complex or unaffordable. Most financial institution docs I’ve seen use some form of extrapolation based on past data. Makes no sense, but here we are. Probably because it’s something they can do and something they can show to customers (and perhaps out of touch management and boards) who only want some sense of perceived security, no matter how wrong it is. Pretty sure most nvda investors’ effective strategy is thoughts and prayers, no matter what they call what they’re doing.\n\nOpen for enlightenment if my perception of this is wrong.", "score": 4, "replies": []}]}, {"body": "To infinity and beyond, I like your simulaltion", "score": 6, "replies": []}, {"body": "Wouldn’t be surprised if it’s sooner. The stock has incredible momentum.", "score": 3, "replies": [{"body": "The momentum is mostly over though. The big momentum drivers were 1000$ barrier and surpassing apple.", "score": 1, "replies": [{"body": "Some say with the data centers it has just begun", "score": 2, "replies": []}, {"body": "What makes you so sure?", "score": 1, "replies": [{"body": "Simply put, the higher the numbers, the less room to grow. There is a point, where the smart money jumps to sth, which has more room to grow. The average investor is late to the party. \nThere will be growth for Nvidia, I don't doubt that, but the strong momentum was already there.\nYou often see people say sth like \"it went from 500 to 1000$ after former splits, so it will do it again\". They just ignore the fact, that Nvidia wasn't valued 3T at that time, so it had more room to grow.", "score": 1, "replies": []}]}]}]}, {"body": "Shit is steep! Let it come true lol", "score": 5, "replies": []}, {"body": "line goes up", "score": 2, "replies": []}, {"body": "You forgot to include MS Paint in the list of tools and models you used in producing your incredibly scientific analysis. 😁", "score": 2, "replies": []}, {"body": "You would get a more accurate prediction drawing a line in MSPaint rather than using actual mathematical modelling.", "score": 2, "replies": []}, {"body": "So over $200 by 2026?", "score": 3, "replies": []}, {"body": "Nature abhors a straight line projection. I think it will continue upward but will slow, the numbers are getting too big.", "score": 2, "replies": [{"body": "A probabilistic prediction is often represented as a straight line because it reflects the best estimate of future development based on current and historic data. Linear models are simple, easy to understand, and calculate, serving as basic tools for trend analysis and forecasting. They provide consistent trend extrapolation, offer average predictions that minimize errors and deviations, and act as a reasonable starting point when complex patterns in data are not well understood. However, real-world processes are often more complex and may require advanced models for more accurate predictions.", "score": 1, "replies": [{"body": "No advanced model from 5 or 2 years or even 1 year ago could have predicted  where Nvidia would be today. The same goes for the future.", "score": 4, "replies": [{"body": "agreed, to check the correct prediciton we can just put the data till 2022 here. Would it have predicted the same NVIDIA it is now? idts", "score": 2, "replies": []}, {"body": "Let me ask you... Do you even know how the probability based prediction works?", "score": 1, "replies": [{"body": "I studied statistics while getting my MBA. Yes.", "score": 2, "replies": []}, {"body": "I think he means that these forecasts are not very reliable because anything could happen tomorrow that could cause the price to drop permanently.", "score": 0, "replies": []}]}]}]}]}, {"body": "Is Monte Carlo just doubling down on a loss till you win?", "score": 1, "replies": []}, {"body": "well now we know.  so good job with that.", "score": 1, "replies": []}, {"body": "Legit", "score": 1, "replies": []}, {"body": "Just LOG the graph and it’s straight", "score": 1, "replies": []}, {"body": "Looks a bit conservative to me. We should be at least $300 one year from now.", "score": 1, "replies": []}]}
{"title": "DCA since last year ", "selftext": "My strategy has been to DCA NVDA since early last year. These are results of pretty much consistently buying $300 of $NVDA every day since about Feb of last year. \n\nWhat has been others strategies? Lumpsum buys? Profit skimming every quarter? Would love to learn some other perspectives. \n\n", "id": "1dhmu3v", "created_utc": 1718588631.0, "score": 68, "upvote_ratio": 0.96, "num_comments": 38, "comments": [{"body": "Jesus", "score": 8, "replies": []}, {"body": "No shit I thought my 270/week was bonkers..wow", "score": 4, "replies": [{"body": "I thought my £100 on the rare occasion I can afford it was ostentatious!", "score": 6, "replies": []}]}, {"body": "And I thought my $2200/ month is somewhat high lol 😬", "score": 6, "replies": [{"body": "High is relative... I pumped 20k USD into it today.", "score": 1, "replies": []}]}, {"body": "Must be nice", "score": 7, "replies": [{"body": "The guy is already rich lol.\n\nI have doctors in my family - between their mortgage, student loans from medical school, kids, and taxes, dumping $300 every day is not possible.", "score": 12, "replies": [{"body": "It’s always possible. You set your lifestyle accordingly. If you make double than what you do now, you will be like ohh wow, I have so much money first 2 months but I am sure you will end up spending a lot more and you will still be saying dumping $300 every day is not possible.", "score": 4, "replies": [{"body": "Dumping 300 per day requires a 9K of disposable income. Even if I make double of what I do now, that still would not allow me to put in 300 per day.", "score": 4, "replies": []}, {"body": "I’m already retired, so I don’t understand your bootstraps rhetoric. Your taxes pay for my military retirement and healthcare.", "score": 1, "replies": [{"body": "Doesn't matter if you are retired or not. You spend as you earn. Simple. It’s not bootstraps rhetoric, it is a fact.", "score": -1, "replies": [{"body": "It is bootstraps, you’re just an idiot without acknowledging how someone can invest $9k per month and still pay the bills. \n\nHell, I’m more frugal than you and can only do ~$4k per month, which is a lot more than most Americans can. This dude doubles me, so he’s a high earner with no kids according to his post history.", "score": 5, "replies": []}]}]}, {"body": "Believe it or not, not actually rich. I cashed out positions on AAPL and started DCAing into NVDA, while having the cash parked in HYSA.", "score": 1, "replies": []}]}, {"body": "Wow I put $1400 every day into NVIDIA, and I’m just a level 1 senior engineer. I still pay my mortgage and cars, max out 401(k) to the $69k per year, and Roth IRA.", "score": 1, "replies": []}]}]}, {"body": "I'm truly inspired by this post. \n\nThank you, and good luck with your investment! \n\n👈😎👈", "score": 2, "replies": []}, {"body": "I’m doing 10 bucks a day and thought that was great.\nNow I just feel like stopping my recurring payments 🫠", "score": 2, "replies": []}, {"body": "This is the way it's done.\n\nGreat job and results.", "score": 2, "replies": [{"body": "Thank you 🙏🏽 I’ve never DCAed any other stock ever so it’s been a good exercise in learning patience, discipline etc.", "score": 2, "replies": []}]}, {"body": "Oh boy the D day will be fun", "score": 1, "replies": [{"body": "How does one prepare for this?", "score": 1, "replies": []}]}, {"body": "How can you find this out", "score": 1, "replies": [{"body": "This is Robinhood", "score": 1, "replies": [{"body": "How do you find this out lol", "score": 1, "replies": []}]}]}, {"body": "I’m thinking about just a lump 15k purchase into my account. I did 3k at open today.", "score": 1, "replies": [{"body": "How’s it looking now?", "score": 1, "replies": [{"body": "My 3,000 is now 2,954. I panicked and sold. (Jk)", "score": 1, "replies": []}]}, {"body": "Don't buy at market open! Wait until 10-11 when there's a dip", "score": 1, "replies": [{"body": "Totally right", "score": 1, "replies": []}]}]}, {"body": "Is a daily buy *really* dollar cost averaging?", "score": 0, "replies": [{"body": "Curious why not? I’m not a DCA expert by any means, just looking to learn about strategies that work.", "score": 2, "replies": [{"body": "In theory, the price wouldn't have changed enough day-to-day to really reap the benefits. It would be better to just throw it all in that point.\n\nBut, I guess with the high volatility that NVDA has been having, daily works.", "score": 1, "replies": [{"body": "Yeah thanks, that’s what I figured too.", "score": 1, "replies": []}, {"body": "Yeah I'm pretty sure there was a smarter way to do this than buying literally every day.", "score": 1, "replies": [{"body": "Why are you saying this when his return is literally over 100%? There’s nothing dumb about it, he took advantage of the daily volatility. This stock had days where it would go up or down by 5% or more, this isn’t TSLA or S&P500", "score": 2, "replies": []}, {"body": "What’s so dumb about it?", "score": 1, "replies": []}]}]}]}]}]}
{"title": "✅ Daily Chat Thread and Discussion ✅", "selftext": "Please use this thread to discuss what's on your mind, news/rumors on NVIDIA, related industries (but  not limited to) semiconductor, gaming, etc if it's relevant to NVIDIA!", "id": "1dhp8si", "created_utc": 1718596854.0, "score": 10, "upvote_ratio": 0.86, "num_comments": 40, "comments": [{"body": "What is this color on my screen?", "score": 13, "replies": []}, {"body": "Consolidation is necessary", "score": 13, "replies": []}, {"body": "Finally a red day! Good for longs.", "score": 9, "replies": [{"body": "Definitely more healthy", "score": 1, "replies": []}, {"body": "My July calls dumped 6k today - fun times......", "score": 0, "replies": []}]}, {"body": "Buy the dip", "score": 8, "replies": []}, {"body": "Portfolio rebalancing incoming since Nvidia usurped Apple. https://www.cnbc.com/2024/06/17/nvidia-to-get-20percent-weighting-and-billions-in-investor-demand-while-apple-demoted-in-major-tech-fund.html", "score": 8, "replies": [{"body": "Yet NVDA goes red", "score": -2, "replies": []}]}, {"body": "Let the v begin", "score": 6, "replies": []}, {"body": "Nvidia's $NVDA desktop GPU market share is estimated to have reached its highest level in more than 10 years at 88%, while AMD’s $AMD share dipped to the lowest level in 5 quarters at 12%.", "score": 3, "replies": [{"body": "Don't focus on what you see at retail.  Desktop GPUs account for less than 20% of NVDA's revenue.  Their major source of revenue and growth is data center.\n\nThe man behind the curtain is doing the heavy lifting...", "score": 1, "replies": [{"body": "I’m well aware", "score": 2, "replies": []}]}]}, {"body": "Today's movement is barely a rounding error for NVDA.", "score": 3, "replies": []}, {"body": "Tsm, avgo strong over night", "score": 2, "replies": []}, {"body": "Love the xlk news, rob Tim to pay us.", "score": 2, "replies": []}, {"body": "What an odd day.", "score": 2, "replies": []}, {"body": "Regretfully bought more shares only for there to be an even bigger dip. Down the hole we go.", "score": 4, "replies": [{"body": "There's been a dip about 1h into trading every day for the last couple of days, I wouldn't worry too much.", "score": 9, "replies": []}, {"body": "In the long run, it will be okay, but damn I hate when that happens - it's so annoying.", "score": 6, "replies": []}, {"body": "I bought 5,000 worth of shares @ 133 this morning scared that it would jump 3$ lol it dipped 3 instead lol holding on for the long run tho", "score": 3, "replies": []}]}, {"body": "Why stonk red? Why stonk no green?", "score": 2, "replies": [{"body": "Retail data coming tomorrow.  Maybe after that news....", "score": 2, "replies": []}]}, {"body": "135🚀🚀", "score": 1, "replies": []}, {"body": "140 eow possible?", "score": 1, "replies": []}, {"body": "Let’s go Omniverse!!!!!", "score": 1, "replies": []}, {"body": "Well, I guess NVDA can not just go up everyday :)", "score": 1, "replies": []}, {"body": "It's kinda scary now even grandma in the coffee shop are talking about NVDA and usually this is a very bad sign but who knows", "score": 1, "replies": [{"body": "\"Buy Apple\" has been in movies/tv-series and all kinds of media, and everyone and their grandmas has said it at some point - still it's a decent buy without any significant long-term dips on record.", "score": 8, "replies": [{"body": "Well everyone uses phones but not everyone uses graphic cards", "score": -8, "replies": [{"body": "Everyone will use AI in the near (and far) future (it's more than just a chat bot you know), and that requires chips.", "score": 7, "replies": [{"body": "yes, but there comes a time, when you dont need the A+++ chip and the good enough chip will do", "score": 1, "replies": []}]}, {"body": "Yes but phones use graphic cards", "score": 6, "replies": []}]}]}]}, {"body": "Buy premarket or wait to see how it opens?\n\nEdit: is this the right place for this question? I don't want to make a post that just clogs up the sub.", "score": 1, "replies": [{"body": "It’s way to hard to time anything. Maybe buy some now? Buy rest at open?  Either way, just get in!", "score": 4, "replies": [{"body": "I fell asleep, the order filled 😎", "score": 1, "replies": []}]}, {"body": "Nobody knows this stuff", "score": 4, "replies": []}, {"body": "Personally, I am waiting for the dip, but this sub consensus seem to buy outright and hold X years, becuase It's hard to time NVDA and the dip may never come.", "score": 1, "replies": []}]}, {"body": "Is it worth investing 10k into Nvidia now or say next 6 months? Arent the prices too high to make any big return on only 10k? Also, I'm not sure, but aren't the coming years a bit risky for a company that is highly dependent on Taiwan???", "score": 0, "replies": [{"body": "To your Taiwan point, who knows?  But if China invades, the whole stock market probably goes down.  \n\nTo your first point:  there are probably 10's of thousands of people who 6 months ago asked, \"Is it too late to get in?\"  And now they wish they had.  Don't be afraid to buy a stock just because it's high.  I'm all in with both feet, borrowing money from my 401(k).  \n \nAnd if you want better returns on your 10k, buy one of the 2x-leveraged ETFs:  NVDX or NVDL.  \nAnd if you want even more return, buy ITM Calls on them.  I'm doing 20%/wk on Nvidia and other tech since the Monday of Pre-Split Week.  \nBest of luck.", "score": 1, "replies": []}]}]}
{"title": "NVDA is the only stock you should be buying today! Over the next few months this stock will rise another 100% to $260", "selftext": "[removed]", "id": "1dhw3u0", "created_utc": 1718624854.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 33, "comments": [{"body": "This is a subreddit dedicated to building a professional environment to analyze NVDA stock. Posts without descriptive analysis will not be tolerated unless it is an article or video sharing informative information.\n\nFor posts like this please add them in the Daily Discussion thread pinned at the top of the subreddit each day. Thanks!", "score": 1, "replies": []}, {"body": "Seriously, the quality of posts on this subreddit has declined tremendously since NVIDIA became mainstream. It’s almost disheartening to share this space with people reminiscent of crypto bros and memestock regards. \n\n“Cheap post split price”, I mean come on… there should be some kind of entry test before you’re allowed to open a brokerage account to weed these morons out.", "score": 37, "replies": [{"body": "Agree. A bunch of noobs thinking nvda will 10x their investment. I miss the OGs :(", "score": 6, "replies": []}, {"body": ">“Cheap post split price”, I mean come on… there should be some kind of entry test before you’re allowed to open a brokerage account to weed these morons out.\n\n\nHear me out: I couldn't afford one OTM weekly call contract pre-split but now I can!", "score": 1, "replies": []}]}, {"body": "It was cheaper pre split, you know that, right?", "score": 16, "replies": [{"body": "Narrator: He did not, in fact, know that.", "score": 18, "replies": []}]}, {"body": "I won't mind if that happens, but no, this is not an analysis. More like a wish or a prayer.", "score": 7, "replies": []}, {"body": "Those who call it cheap and claim it will exceed $200 in a few months or years are often the first to sell when the stock drops by even 10%", "score": 5, "replies": []}, {"body": "How is this analysis? I don't nessisarily disagree with you, but $260 a share would mean the rest of the economy would have to crash and funnel everything into NVDA. Also mean Nvidia would be well over 6 trillion market cap, which i don't see happening for atleast another 2 years", "score": 7, "replies": [{"body": "Don't worry it's too complicated for you to grasp it.", "score": -29, "replies": [{"body": "Explain then, and give us your due diligence.   \nYou're asking us to drop all our portfolio into one stock without explaining why, with some number you pulled out of your ass.", "score": 7, "replies": []}, {"body": "Try me 🙂", "score": 7, "replies": []}]}, {"body": "The same morons said that at $500 ....you can join them.", "score": -22, "replies": [{"body": "It wasn't valued 3T at 500$ though?", "score": 4, "replies": [{"body": "I dunno, I’d rather ignore market cap and listen to Mr. Nvidia is going to be worth more than the entire western world in 6 months over there!", "score": 5, "replies": [{"body": "I know u are joking, but judging by all the ppl and to the moon threads which this rally brought in recently, there will be a lot of ppl who will take your post as great analysis.", "score": 0, "replies": []}]}]}, {"body": "Don't let emotions dictate your trades.", "score": 1, "replies": []}]}]}, {"body": "Micron broadcom amd as well but yea prioritize nvidia", "score": 2, "replies": []}, {"body": "Is this the top?", "score": 2, "replies": []}, {"body": "Bro what😭no way it will go to 260 soon lol it’s going to have a pullback real soon too", "score": 4, "replies": [{"body": "What is a pullback? Like under 50? Im new", "score": 1, "replies": []}]}, {"body": "[I'll allow it](https://tenor.com/vVz9.gif)", "score": 1, "replies": []}, {"body": "Based on?", "score": 1, "replies": [{"body": "If you need me to tell you, then you don't know what you are doing", "score": -7, "replies": [{"body": "Said every other guy that pulled numbers out of his ass. Go back to WSB", "score": 3, "replies": []}, {"body": "That's unfortunate. I have come to the point on Reddit that i just block people that add nothing to the conversation.", "score": 1, "replies": []}, {"body": "I need you to tell me, tell me now.", "score": 1, "replies": []}]}]}, {"body": "another 100% is a bold claim. im not sure you understand how stocks work", "score": 1, "replies": []}, {"body": "Awe, I knew it was too complicated for you", "score": -2, "replies": []}, {"body": "Nvidia will be the first 10T company.  if history has taught us anything it is that anything is possible.\n\nArm is also the next hot stock... it is a Rockstar climbing faster then Nvidia", "score": -2, "replies": []}]}
{"title": "new to trading NVDA, what we think about $137 call 6/21??", "selftext": "[removed]", "id": "1di0c59", "created_utc": 1718636813.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 38, "comments": [{"body": "Risky. Could go go zero or make bank. Don't bet what you can't afford to lose.", "score": 22, "replies": []}, {"body": "Sure. Show us the loss porn when you're done.", "score": 16, "replies": []}, {"body": "Go to r/wallstreetbets", "score": 10, "replies": []}, {"body": "You are not investing, you are gambling.", "score": 22, "replies": [{"body": "thanks smart guy", "score": -29, "replies": [{"body": "You're on the wrong sub, post this in WSB and get a hundred comments telling you to send it. All you're looking for is confirmation bias.", "score": 16, "replies": [{"body": "i was more just looking for others opinions… this is my first option trade in NVDA and i jus wanted to see other peoples input and knowledge with options trading NVDA… didnt expect so much ppl to be worried about my %10 portfolio loss if anythibg", "score": -4, "replies": [{"body": "Forgot that I had an order I set Friday but just missed close, so I'm in for 133c 6/21 lol", "score": 1, "replies": [{"body": "hey at least u got a better chance at profits 😂 all i can do is hope im one of gods favorites", "score": 0, "replies": [{"body": "😁👍🏻👍🏻", "score": 1, "replies": []}]}]}]}]}, {"body": "Call him smart guy all u want but hes not wrong…. So i saw u commented an insult.. yes u made money today.. i look forward to the day u post saying how u got wiped out .. good luck.. fyi.. im making money to but i play in the money.. also well aware that what im doing is still gambling..", "score": 2, "replies": []}]}]}, {"body": "I wouldn't. Not much time left on the call. If the stock doesn't move your way, right away, you will lose.", "score": 6, "replies": []}, {"body": "I doubled my account in the past 6 months by not doing 1 week OTM calls.", "score": 4, "replies": []}, {"body": "This is why I've been telling people to go FAR dated contracts. It's safer and you won't lose your pants in a day", "score": 3, "replies": []}, {"body": "I much prefer LEAPs, long term. June 2025 I can be much more confident we'll be over $137 than June 2024. Plus as it gets closer you get time to make any moves you want. But I'm sure someone on here plays the short term stuff and can help", "score": 3, "replies": []}, {"body": "Go to r/wallstreetbets", "score": 5, "replies": []}, {"body": "You are not new to trading, you are a new gambler and you will blow your account in a week.", "score": 2, "replies": [{"body": "i have other investments pal , there’s less than 10% of my portfolio in this call . bought what i could afford that’s why i said im fine w taking the risk", "score": -2, "replies": [{"body": "You’re not new to options trading but you don’t know how to read the Greeks?", "score": 3, "replies": [{"body": "i’ve watched videos on greeks , i’m not deeply educated on them but i know the basics. i’ll take a peek but it isn’t what i base my calls off of. i’ve been trying to learn more but i wouldnt say im particularly knowledgeable in that area", "score": 1, "replies": [{"body": "I know it’s a slog but getting all that knowledge under your belt where you can do your own DD and trust it makes the high risk trades even more fun.", "score": 2, "replies": []}]}]}]}]}, {"body": "I’m buying leaps at discounts every dip", "score": 2, "replies": []}, {"body": "You are going on social media asking for investment advice. If you take it you are a dumb ass! Of coarse everyone on here loves Nvda. Do research and consult an investment guy( or girl). \nWhile you are at it you might want to ask for NBA finals prediction so you can make a few grand on that.", "score": 2, "replies": []}, {"body": "Feel like that’s a stretch buddy. But tf do I know.", "score": 1, "replies": []}, {"body": "Hope i don't lose my 25$ dollar call.", "score": 1, "replies": []}, {"body": "Could someone explain this to me? I’m new to reading.", "score": 1, "replies": []}, {"body": "This week only has 4 trading days. If you want to gamble, do it on 6/28 to give it more time.", "score": 1, "replies": []}, {"body": "It is possible, but that is a big move in a short time. I like to look at the PE ratio (past/trailing PE ratio) because it seems like the price will shoot up to about 75-80 trailing PE ratio after earnings.\n\nEarnings with the new quarter's EPS have typically brought the PE ratio back down from 75-80 back down to the 50s, then people start buying again and price pushes up to somewhere between 75-80 trailing PE ratio  - Once it hits 75-80 PE ratio it usually bounces sideways - a little up, and a little down - until next earnings. Right now the PE ratio is at 77 ... maybe because of split it will get higher than normal, but I'm not gonna bet a short term option on it.\n\nYou could buy a $137 call for 2-3 weeks after next earnings (in August) and I think that would be a much more reasonable bet IMO.", "score": 1, "replies": []}, {"body": "Just own shares and sell calls when it finally slows down (like today)", "score": 1, "replies": []}, {"body": "I wouldn’t ..too close to expiry", "score": 1, "replies": []}, {"body": "Get the $129 call for the 7/5 and save yourself some heartache", "score": 1, "replies": []}, {"body": "Maybe ask r/options or r/smallstreetbets", "score": 1, "replies": []}, {"body": "I think 135 is reasonable. Not 137. I have 135 calls for 6/21", "score": 1, "replies": []}, {"body": "Look at the Greeks. How likely is that to happen", "score": -5, "replies": [{"body": "dk how to read greeks🤷🏻‍♂️ usually jus watch a chart for weeks then start option trading but w NVDA im willing to take a risk", "score": -8, "replies": [{"body": "If you cannot read the Greeks, this is undeniably gambling. If you're okay with that, feel free to send it. But you are making an uninformed bet on the future.", "score": 4, "replies": [{"body": "🤷🏻‍♂️ that’s alr i’ll put more effort into the next call i make", "score": 2, "replies": [{"body": "It's your decision. If you're okay with gambling the money you put in, then feel free to send it! This bet has a reasonable chance of hitting, so there's a good chance you profit off of it tbh. Good luck if you decide to go for it!", "score": 3, "replies": []}]}]}]}]}]}
{"title": "140 here we come!!", "selftext": "[removed]", "id": "1di4avx", "created_utc": 1718646700.0, "score": 51, "upvote_ratio": 0.91, "num_comments": 46, "comments": [{"body": "Let’s be honest when was the last time Apple had any sort of meaningful innovation after Steve Jobs passing?  They’ve been riding the hype that jobs created, and haven’t done much since. Every iPhone literally looks the same, maybe different camera positioning, an added notch, some plugs removed added, different materials, and slightly better hardware, but the overall look and design of the phones have remained the same for the past 10 years….", "score": 21, "replies": [{"body": "True but they have a billion devices in peoples hands. The new devices will be huge down the road. I dumped over 200k in apple stock last fall as it seemed to me they were not going anywhere.", "score": 5, "replies": [{"body": "I was in on Apple since 2015 I was a huge Apple loyalist but it became hugely stagnant after covid run up….  I switched to nvda and it’s been amazing, still up over where I would’ve been had I stayed with Apple…", "score": 5, "replies": []}]}, {"body": "They’ve produced their own chips which had a HUGE impact on prices.  Macs are now more affordable and powerful.  Vision Pro will be part of the AI platform.", "score": 2, "replies": [{"body": "They need to figure out how to make Vision Pro more accessible to the masses instead of trying to market it as a luxury exclusive product…", "score": 3, "replies": []}]}, {"body": "Exactly", "score": 2, "replies": [{"body": "And this is coming from a hardcore Apple fan… I just care more about money than I do loyalty to applr", "score": 2, "replies": []}]}, {"body": "Air pods", "score": 1, "replies": [{"body": "Actually the first wireless earbuds were created by a Japanese company.  Apple took it and refined it. \n\nApple doesn’t innovate anymore they just take existing tech and refine it to fit Apple culture", "score": 1, "replies": [{"body": "There’s no doubt Tim apple is no Steve jobs. What a shame they even had to use chatgpt.", "score": 1, "replies": [{"body": "You know Steve Jobs would’ve had his own Ai a long time ago…. Maybe he even would’ve bought nvidia along the way…", "score": 2, "replies": [{"body": "Exactly, would have been the first. The world is filled with incompetent second fiddles moonlighting as CEOs.", "score": 1, "replies": [{"body": "At least Jensen Huang is a proper ceo, he has one of those weird “how I got started stories”…", "score": 1, "replies": []}]}]}]}]}]}, {"body": "When was the last time cars changed from four wheels to something else ?", "score": 1, "replies": [{"body": "That’s different lmao it’s a car.  Besides it still doesn’t  change the fact that Apple is not an innovator they just recreate what’s already been innovated by someone else…", "score": 1, "replies": []}]}, {"body": "Many innovate products have come after Jobs. Apple watch (best selling watch), airpods, M series silicon(which pretty much changed the industry), Apple services(2nd most revenue source after the iPhone), and we are yet to see what they can do with the vision pro. You can't deny that these are great products.", "score": 1, "replies": [{"body": "Steve Jobs envisioned the future Apple Watch as a groundbreaking wearable that would bring the power of the iPhone right to your wrist. He saw its potential long before it became a reality.\n\nAll those other innovations are just a testament to Apple's approach since Steve Jobs passed. They let other companies pioneer something novel, then Apple refines it, enhances its user-friendliness, and proudly stamps the Apple logo on it.\n\nApple currently lacks a true innovator with the influence to bring groundbreaking ideas to life.", "score": 2, "replies": []}]}]}, {"body": "So wait, you’re saying AAPL run is over and NVDA is next. \n\nAlso, I have a question, this $130 now isn’t cheap it’s basically the $1300, the split doesn’t change fundamentals. And even if it goes down to $100 that’s still $1000 back then. It’s not like a $100 now means NVDA is dying. \n\nSo why wouldn’t it go down till $120-$110 then move back up. I was going to buy calls today but then I realized the $130 isn’t like cheap, it’s priced in. I am now not sure the $160 is coming, $140 maybe.", "score": 15, "replies": [{"body": "You buy 1 share now, and if it dips to $110 you buy 2 shares more. Long-term the most likely direction is up anyway.", "score": 9, "replies": [{"body": "I laughed so hard cause damn this is a FACT. Like buy NVDA and shut up", "score": 9, "replies": []}]}]}, {"body": "If you are going to pluck a random figure why not pick a higher one. €1,900 here we come!!!", "score": 2, "replies": [{"body": "[removed]", "score": 8, "replies": [{"body": "Fair enough. That’s good", "score": 4, "replies": []}]}]}, {"body": "This aged well", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "That’s old news. It didn’t help the stock move today", "score": -22, "replies": [{"body": "[removed]", "score": 20, "replies": [{"body": "Why the 21st? ", "score": 5, "replies": [{"body": "[removed]", "score": 16, "replies": [{"body": "what does this mean in english", "score": 3, "replies": []}, {"body": "So everyone will be pumping aapl till then to sell at higher price?", "score": 1, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "But they didn't buy NVDA stocks yet and didn't sell their aapl ones or?", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "What I meant. So don't understand the downvotes\n\nAAPL will get a pump so if the fund is forced to sell, they sell at a decent price. Same for NVDA for the reasons they are forced to buy and hedges can sell on a good price.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Tbh. From what I have seen, locally AI is extremely limited. Almost anything required going to the cloud and anything more complex requires chatgpt. Just an example.", "score": 0, "replies": []}]}]}, {"body": "They rebalanced and hedged their position way before then.", "score": 0, "replies": []}]}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1dicvon", "created_utc": 1718668634.0, "score": 22, "upvote_ratio": 0.96, "num_comments": 30, "comments": [{"body": "The answer is always yes.", "score": 21, "replies": [{"body": "Already spent every penny I have to spare.", "score": 1, "replies": []}]}, {"body": "How do you but more? Sounds kinky.", "score": 9, "replies": [{"body": "Stop gap = plug your losses.", "score": 1, "replies": []}]}, {"body": "Nvidia will hit $1k price again in a few years. Try to load up as much as possible when the price is under $150.", "score": 13, "replies": [{"body": "Yeah it’s teetering right now, but people don’t realize that recovery is inevitable, it’s followed the same pattern for the past 20 years, and in a year or two, it’ll be back up to who knows where, and we’ll go through this whole thing again", "score": 1, "replies": [{"body": "It’s teetering?? You have an odd definition of teeter. It’s exploded.", "score": 4, "replies": [{"body": "When I look at how much weight I should give the opinions of reddit whilst making investment decisions, I always remember that people with this level of knowledge are contributing with absolute confidence", "score": 1, "replies": []}]}]}]}, {"body": "Look, if you can afford it, I would.\nPut it like this. Crumple up a $20 bill. Can you throw it away in the garbage with no regrets? Yes? Put $20 in stock. No? Then don't. Go up until you can't afford to throw money away, and then, if you feel lucky, invest that.\nBECAUSE, be sure it will eventually drop,  and you don't want to cry over a big drop.\nGood luck 👍", "score": 5, "replies": []}, {"body": "it’s like asking a car salesman if you need another car.", "score": 5, "replies": []}, {"body": "Look for a red day, followed by a green day. \n\nYou will feel like a stock broker right out the box. \n\nGl", "score": 2, "replies": []}, {"body": "Don’t know. Do you think the price today is the highest that it’ll ever be?", "score": 2, "replies": []}, {"body": "Did you really come to the Nvidia stock and expect us to say to not buy", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Sure. In that time you’ll become a millionaire", "score": 1, "replies": []}]}, {"body": "Ohhhhhhhhh yeah", "score": 1, "replies": []}, {"body": "Why not?", "score": 1, "replies": []}, {"body": "NVDA would’ve been easily 2k if the split would’ve happened way later than 6/7 it will hit 200 before end of the year", "score": 1, "replies": []}, {"body": "Yes butt more", "score": 1, "replies": []}, {"body": "This dead cat bounce since April of 2022 will peter out someday and then I can get in /s", "score": 1, "replies": []}, {"body": "I would honestly rather buy MU at the moment", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "Always 🤑", "score": 1, "replies": []}, {"body": "Is it low effort post when the op misspells buy?", "score": 1, "replies": []}, {"body": "yes 😋❤️", "score": 1, "replies": []}, {"body": "Anyone who already owns it will want you to buy more. That’s how the market works, right?", "score": 1, "replies": []}, {"body": "Sure, but don't buy a falling knife tomorrow morning.", "score": 0, "replies": [{"body": "When is the best time to buy?", "score": 1, "replies": [{"body": "In the past.", "score": 14, "replies": []}, {"body": "There are no certainties, only probabilities. I don't like to just buy at random times, so right now since there is a possibility of it falling to the next support level at like $125-$126, then about there and then.\n\n$129-130 was a support level so you could've bought there too, but too late now. $127 last Thursday. $124 last Wednesday.\n\nBut it also could just go up tomorrow, so that's what I mean by there are no certainties.", "score": -1, "replies": [{"body": "Thank you for the advice", "score": 2, "replies": []}]}]}]}]}
{"title": "Lead up to August 21 Nvidia earnings?", "selftext": "what’s the smart play now to take advantage of the rising implied volatility regarding options contracts for Nvidia when they announce their earnings on August 21 of this year?", "id": "1di9vgd", "created_utc": 1718660549.0, "score": 18, "upvote_ratio": 0.82, "num_comments": 28, "comments": [{"body": "I’m holding $145 Sept 20 calls.  My feeling is that if the stock price gets to $160, I’m selling them. Whether that occurs tomorrow or in Sept, that’s kind of my plan. \n\nI did the same thing with July $1050 calls (which turned into x10 $105 calls). I decided I’d exit as soon as the stock price hit $125 - which I did. I’m playing SMCI and AVGO the same way.", "score": 25, "replies": [{"body": "What are your price targets for SMCI and AVGO?", "score": 6, "replies": [{"body": "SMCI is $1000, but that one I’m being kind of holding on for earnings because I think they’ll do the 10:1 split trend. So in those cases I try to have calls that easily divide by 10. That way, you’re not possibly holding some irregular strike (my reasoning for the $1050 NVDA calls). \n\nAVGO, I 100% think the market wants to get to $2k so that it splits to $200. I felt that number was $120 for NVDA and I was pretty close with that (it went over $1200 before pulling back). \n\nKeep in mind, I’m going by instinct more than anything. I don’t know shit about technicals.", "score": 12, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "You are pretty deep in the money on that NVDA - that looks like something you must’ve opened right around their last earnings?", "score": 2, "replies": []}, {"body": "How long are you holding those LEAPS for?", "score": 1, "replies": []}]}, {"body": "Hmm 🤔 how do you learn these things?", "score": 1, "replies": [{"body": "I’ve been trading options since 2010, and it’s always been mostly by just following a company close enough to get a feel for it. Like; I don’t think NVDA is going to $300 or anything. It would have something like a $8 trillion market cap or some absurd number like that. That’s why after $160, it’s getting a little too bubbly for me. \n\nAlso, keep in mind - lots of people make money from bubbles. But I’m not greedy. I won’t be greedy.", "score": 2, "replies": [{"body": "I also had the same calls as you which I FOMO’d into this morning.  Kept telling myself to wait for the red, but the way price action was going, felt like I’d be missing on gains.  Hoping that the dips mid and end of day are just that, dips and not the beginnings of a major correction.\n\nI like your target of $160.  I honestly had the top at around $1100 which it kind of blew past.  I actually made a killing going from $680 to $930 on calls early in the year then rode $850 July calls all the way to $1050.  Sold them the week prior to split.  I’d been gun shy after taking a few losses during the March April period of corrections so I took profit.  Hopefully I’m not getting back in at the top.", "score": 4, "replies": [{"body": "Here’s hoping for more gains to you!", "score": 2, "replies": []}]}, {"body": "But then how far out would you go for strike date?", "score": 1, "replies": [{"body": "For these, I went out to September so that I could capture the next earnings. Usually want between 45 and 90 days depending on how far out of the money you are. Theta becomes a concern inside of 30 days.", "score": 1, "replies": []}]}]}]}, {"body": "Why 120 for NVDA?", "score": 1, "replies": [{"body": "Because I kept watching the price push up and then pull back. It had that big jump after earnings, and $1200 felt like the psychological number. At these valuations, fundamentals aren’t as big as sentiment, I feel. \n\nI’m currently trying to get familiar enough with SPX  to get an idea of where it wants to be. I was trying with NDX, but like most traders will tell you, it’s so easy to get lost in the “NAS-crack”!!  NDX is fucking hard!", "score": 2, "replies": [{"body": "commenting for later", "score": 1, "replies": []}]}]}, {"body": "Sold avgo too early. I will be playing smci.", "score": 1, "replies": []}, {"body": "Thanks for this discussion, I learned a lot. I have dm'd you to ask some questions, hope you don't mind 🙂", "score": 1, "replies": []}]}, {"body": "Commenting for later", "score": 1, "replies": []}]}, {"body": "What’s your call for smci and avgo?", "score": 2, "replies": [{"body": "All are Sept 20 exp. SMCI I have at 900. AVGO I have at 1900. \n\nI also have shares of AVGO and covered calls on it.", "score": 2, "replies": [{"body": "Thanks for the discussion. The contract prices have gone up significantly though, not sure now would be a right time to enter.", "score": 1, "replies": []}]}]}]}, {"body": "Long call spreads or selling puts, but be cautious of those analyst expectations", "score": 7, "replies": [{"body": "sure, but the goal is just to ride the increased IV and take profit before earnings are released, correct?", "score": 6, "replies": [{"body": "Price is key. Yea, IV can increase but if price doesn’t hold or move up you can still lose", "score": 2, "replies": [{"body": "In fact IV is all but guaranteed to increase as you get closer to ER due to the dynamics with theta and the pricing reflecting the ER IV instead of the weekly IV. However as you say the prices of options across the chain can go down.", "score": 2, "replies": []}]}]}]}, {"body": "I’m thinking about this also. I usually don’t like holding options through earnings but with NVDA’s track record it feels like free money holding calls. Which means it probably won’t be.. hard to say. I’m looking at 150 strike, not sure what expiry yet.", "score": 4, "replies": []}, {"body": "Holding October calls way OTM. Hoping for $170-$180 after earnings and my position to be pleasantly up. Currently up 50%", "score": 2, "replies": []}, {"body": "Selling straddles could capture the volatility premium.", "score": 1, "replies": []}, {"body": "holding 80 90 and 100 puts expiring sep oct and nov.  I'm wondering if it makes sense to hold through earnings.  Any thoughts?", "score": 1, "replies": []}]}
{"title": "SPY soon to have NVDA as its largest holding by weight, surpassing MSFT.", "selftext": "This is interesting and food for thought. I’m not sure how I feel about SPY lifting NVIDA to its number 1 position given how little diversified the company is at this point. I would not put all my eggs in one basket and as of yesterday NVDA is 7.12% of SPY by weight, trailing close behind MSFT which leads at 7.19%. For those of you not following SPY, this is a BIG jump over the past few months. For some of us holding SPY long-term I’m not exactly sure if this is good news. I was happy with NVDA being number 4 or 5 months ago, behind behemoths more diversified like Apple or Google. Thoughts? Is every long-term SPY holder happy about this? \n\nClarification- I know exactly how ETFs like SPY operate and how we got here.", "id": "1di1r6r", "created_utc": 1718640326.0, "score": 113, "upvote_ratio": 0.88, "num_comments": 40, "comments": [{"body": "Waiting for Nvidia to replace Intel in the DOW personally.", "score": 98, "replies": [{"body": "That's when we'll know their run is over. Whenever a company goes in the dow, it underperforms. It's like a badge of disgust.", "score": 61, "replies": [{"body": "Why is that? ", "score": 3, "replies": [{"body": "It's like when Boomers finally start using GenZ memes. Once it gets to the old institutions, it means the hype has peaked. From there, it's all downhill.", "score": 23, "replies": [{"body": "Microsoft, Apple, JPM, Visa and Walmart are all in the Dow", "score": 25, "replies": [{"body": "For every Microsoft, there's a Honeywell and a Boeing. Underperformance is the name of the game for the DOW, and they're generally very slow to adapt. Hell, they got lucky with a lot of these picks. Yeah, they have JPM, but they also had Citi, GE, GM, and Bank of America in 2008, all of which had major issues and required massive bailouts. They've generally added stocks at their peak, like how they added SBC, Intel, and Microsoft in 1999, just a year before the dotcom crash, and just a few years earlier had added HP in. That's not even mentioning the underperformance of the stocks you mentioned after being added to the dow. Microsoft and Walmart both underperformed for 15 years, going flat from 1999 to 2014 after being added.", "score": 9, "replies": [{"body": "As both S&P 500 and Dow are managed by S&P global I assume they just deliberately want both to have differences. It’s not like the banks were not in other indices during the housing bubble.\n\n>“A stock is typically added only if the company has an excellent reputation, demonstrates sustained growth and is of interest to a large number of investors.”", "score": 2, "replies": [{"body": "They're both managed, yes, but the S&P has way more companies and a clear strict guideline on how to get in, which is not true for the DOW, which is why the S&P moves around a lot more.", "score": 1, "replies": []}]}]}, {"body": "And they're all boring, IMO. Except for MSFT, maybe.", "score": 3, "replies": [{"body": "I guess most people are looking for decent reliable returns and not excitement in the stock market.", "score": 8, "replies": [{"body": "Yeah, IDK what people care about with \"exciting\" companies. Exciting means hype. Substance comes from solid financials. Boring is better.", "score": 2, "replies": []}, {"body": "So I'm a pretty active investor and this is my first time peeking into this sub. Coming into this sub and seeing people seriously offer advice as analogies of companies to memes, valuing excitement over ROI, and not much actual analysis beyond 'so and so is selling shovels' .. this sub feels like WSB with more words.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "XLK was rumored to be increasing NVDIA to 20% of holdings, downgrading Apple to 5% iirc \n\nPuts on Apple into next month", "score": 30, "replies": [{"body": "Then I’m gonna buy Apple. Always do the opposite of what Reddit says.", "score": 9, "replies": []}, {"body": "Are you guys actually buying puts on aapl?", "score": 11, "replies": []}, {"body": "Aged like milk.", "score": 1, "replies": []}]}, {"body": "It's true, NVDA's climb in SPY has been meteoric.  Concentration risk is definitely something to consider. Might be worth checking out equal-weighted S\\&P 500 ETFs if you're uncomfortable with this trend.", "score": 23, "replies": [{"body": "Have you seen equal weighted s and p performance before?", "score": 15, "replies": []}]}, {"body": "I agree. It's like either hold S&P or NVDA. But together it puts you in a very over weighted position.", "score": 16, "replies": []}, {"body": "Exxon was the world’s largest company in 2013. I’ve heard it said semiconductors are the new oil. Food for thought.", "score": 20, "replies": [{"body": "We definitely defend them like we do oil", "score": 2, "replies": []}]}, {"body": "Personally I prefer the best stocks to have the highest weighting. I don’t see where al the fear of Nvidia comes from. Sure the stock ran up a lot but it’s based on their record year over year sales growth, margins and almost untouchable moat", "score": 11, "replies": []}, {"body": "Just buy everything", "score": 5, "replies": []}, {"body": "Market sentiment and investment trends also affect Nvidia’s holdings in SPY. Investors are looking for companies with high growth potential, and Nvidia fits this need, so its stock is sought after.", "score": 5, "replies": []}, {"body": "It doesn't really matter how anyone feels it's based off of performance.", "score": 5, "replies": []}, {"body": "Hmmm... Not a good sign imo. ", "score": 16, "replies": [{"body": "you’re getting downvoted but i’d like a conversation \n\nwhy do you think it’s not a good sign?", "score": 1, "replies": []}]}, {"body": "Won't it rebalance this Friday?", "score": 2, "replies": []}, {"body": "Switch to SPXT? Might be worth DCA down.", "score": 2, "replies": []}, {"body": "Here is the good news. If NVDIA goes down by 50% from here then you only lost 3.5% on your SPY investment.\n\nIn the context of SP500, that's barely a blip in the overall noise. Some years are up 30% and some are down 30% and NVDIA won't make or break anything. \n\nYou will still be averaging 10% a year or so.", "score": 2, "replies": []}, {"body": "Well deserved. Nvidia is the hyper growth behemoth. I will add more to be my largest holding.", "score": 3, "replies": []}, {"body": "This is how the market crashes", "score": 2, "replies": []}, {"body": "Where did you hear this? At least post an article link or something", "score": 0, "replies": [{"body": "It’s public on SPY’s management website\n\nhttps://www.ssga.com/us/en/intermediary/etfs/funds/spdr-sp-500-etf-trust-spy#holdings", "score": 5, "replies": [{"body": "Thanks", "score": 2, "replies": []}]}]}]}
{"title": "The Dow Jones will eclipse 100,000 on a 'turbo booster' combo of earnings growth and Fed rate cuts", "selftext": "That's according to Main Street Research chief investment officer James Demmert, who outlined a seven- to nine-year timeline for his uber-bullish stock market call.\n\n\"Our main message to investors is to stay focused on the fact that earnings and Fed policy drive stocks and both are extremely favorable as stock valuations are cheap relative to forward earnings. Investors should be fully invested up to their highest need for stock allocation so that they can leverage the early phase of this new and powerful bull market.\" \n\n  \nThe Federal Reserve is expected to cut interest rates one to two times this year, with the market currently expecting the first rate cut to occur in September.\n\nAnd if the Fed doesn't cut interest rates this year, that won't derail Demmert's bullish forecast because earnings growth remains strong and resilient.\n\n  \nAdditionally, Demmert highlighted that trillions of dollars of cash on the sidelines should make its way into the stock market over the next six months as interest rates drop and some investors start to feel \"FOMO\" after missing out on the stock market's ongoing march to record highs.\n\nWe believe we have entered a new AI and tech-led business cycle and bull market so it's essential that investors position themselves to be overweight in technology and telecom stocks.\"\n\n[Full Article](https://www.msn.com/en-us/money/markets/the-dow-jones-will-eclipse-100-000-on-a-turbo-booster-combo-of-earnings-growth-and-fed-rate-cuts-wall-street-cio-says/ar-BB1onG7H?ocid=hpmsn&cvid=35df0d25ee874738b2c239cdad70d576&ei=54)", "id": "1di2b44", "created_utc": 1718641698.0, "score": 91, "upvote_ratio": 0.84, "num_comments": 43, "comments": [{"body": "Good lord. Stocks are “cheaper” relative to forward earnings, but I don’t know in what universe they’re objectively cheap. And that’s if the consumer remains resilient. Corps have already raised prices and are laying off workers to keep those earnings high. As soon as people stop spending, the whole edifice will crumble", "score": 101, "replies": [{"body": "Exactly. The average price to earnings ratio is currently 25 to 1. In order for this guy's prediction to come true, either earnings would have to triple, or the PE ratio would have to rise above 70. The first scenario is absurd, the second would indicate the mother of all bubbles.", "score": 16, "replies": [{"body": "I just like the stock", "score": 1, "replies": [{"body": "Yes, and that stock is grossly overvalued. There's a massive AI bubble which is driven by irrational exuberance.", "score": 1, "replies": [{"body": "I just like the stock", "score": 1, "replies": []}]}]}]}, {"body": "The earnings may drop, but the passive investors will keep pouring paychecks into the stocks.", "score": 26, "replies": [{"body": "…until they lose confidence in the stock market, as they did after 1999 and the GFC. Most Redditors think that markets only go up and no price for the S&P 500 is too expensive with a long enough timeline. What if that common knowledge suddenly changes?\n\nTo be clear I’m not making a market prediction. But I do think people are way way too flippant about risk at the moment.", "score": 43, "replies": [{"body": "If this does happen, anyone with a spine and a long horizon would profit greatly when eventually confidence returns, that’s how investor sentiment works. To me, all the passive investors will just make the crashes and rebounds a lot more drastic, due to the common investing mistakes. Also, I think that when looking to profit off individual companies, it may be best to avoid the major indexes.", "score": 13, "replies": [{"body": "I’m waiting impatiently for the crash.", "score": 4, "replies": [{"body": "You literally just had one 2 years ago. Are you a toddler?", "score": 8, "replies": []}]}]}, {"body": "What risks? Stocks only go up right? All in voo or whatever and never look back", "score": 16, "replies": []}]}, {"body": "That's assuming they'll still be getting paychecks", "score": 2, "replies": []}]}, {"body": "Show me one time since WW2 when the US consumer stopped spending and caused the crash rather than stopped spending because of the crash.\n\nI'll wait.", "score": 13, "replies": [{"body": "Consumers have been complaining about prices for a solid year and yet still continue to spend and most companies earnings have yet to see a decline. There’s a good chance this continues on", "score": 11, "replies": [{"body": "Agreed", "score": 2, "replies": []}, {"body": "And they still aren’t yet putting much pressure on the current administration to stop printing even more money. ", "score": 1, "replies": []}]}, {"body": "“past performance is not indicative of future results”", "score": 1, "replies": [{"body": "\"It's different this time\".\n\nTrite bromides are pretty easy.", "score": 12, "replies": [{"body": "The “it’s different this time” crowd thinks stocks are underpriced right now. Because, uh, AI", "score": 6, "replies": []}]}]}]}, {"body": "Not all clearly, but some of them are less overpriced than others…", "score": 3, "replies": []}, {"body": "as long as I have my job I’m maxing my IRAs. As long as it keeps going up I’ll be spending", "score": 2, "replies": []}]}, {"body": ">trillions of dollars of cash on the sidelines\n\nGod I hate that so much. What does it mean? How do we know? Why does this mean that this money will be invested in the near future?\n\nDoesn't help that I feel like I've been hearing that for years at this point.", "score": 41, "replies": [{"body": "To me- that means trillions of dollars are waiting on an inevitable pullback.", "score": 28, "replies": [{"body": "Bingo. That money ain't gonna FOMO in. It waits for a good enough dip.", "score": 14, "replies": [{"body": "The amount of money on the sidelines is the highest in history that's why it could produce a catalyst up once rates come down and treasuries etc are not as appealing", "score": 15, "replies": []}, {"body": "Calling it FOMO is a little silly when people have been calling for a big dip since 2022. Do we really think we're headed back to 4,000? Because that's what a lot of people were holding off waiting for. \n\nThere is significant risk in waiting for a dip that does not come", "score": 9, "replies": []}, {"body": "yes, and for now they can still get 5% risk free.  Once that starts to change...", "score": 13, "replies": [{"body": "You can lock in 5.6% for a year right now", "score": 9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You can shop for CDs through most brokerages. I’m seeing one right now from Wells Fargo for example.", "score": 5, "replies": []}]}]}]}, {"body": "No it is waiting for interest rates to drop, which makes those Investments less attractive then that money flows into the stock market", "score": 5, "replies": []}]}, {"body": "Or the trillions of dollars on the sideline are the trillions of dollars in Boomer's retirement accounts which have rotated to lower risk money markets / bonds per a typical age based reallocation, as they live out the rest of their lives on fixed income.", "score": 3, "replies": [{"body": "Most definitely a valid thought.", "score": 2, "replies": []}]}, {"body": "How much of that is by people who will just keep waiting though?", "score": 0, "replies": []}]}, {"body": "They are talking about the trillions in Money Market Funds and probably short term bonds. Instead of rerolling, they could use that principal to buy equities.", "score": 3, "replies": []}, {"body": "That money lives in money market funds and is not meant for the equity market. It could be retirement funds or T-Bills that can be turned into cash quickly (Berkshire). This saying is like when real estate agents say now has never been a better time to buy.", "score": 3, "replies": []}, {"body": "This one is easy, look at this graph : [https://fred.stlouisfed.org/series/PSAVERT](https://fred.stlouisfed.org/series/PSAVERT) \n\nSee that spike after covid? Well some people think that it stayed a flat line in the last four years and that everyone has a ton of cash everywhere waiting to be spent. And by some people, I mean the \"special\" people.", "score": 2, "replies": [{"body": "That’s showing a percentage of disposable income being saved per household. Not total cash on the sidelines. When people cite the “trillions of cash on the sidelines” metric, they aren’t talking about the average American family saving 5% of their income lol.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Is nine posts of the same comment enough? 😂", "score": 2, "replies": [{"body": "Apologies. There was some kind of network issue and I kept pushing send. sorry.", "score": 1, "replies": []}]}]}]}, {"body": "Dca none of us on reddit can predict anything", "score": 9, "replies": []}, {"body": "I expect my 2 Dow Jones shares to make me a billionaire soon. Then I will buy the Earf and make them work on mechanical bees.", "score": 11, "replies": []}, {"body": "This is the market trying to reclaim the money they have lost.", "score": 4, "replies": []}, {"body": "Hyperbolic curve - check. \"It's different this time\" - check. Hyperbolic projections - check. \"We need broader participation in the market\" - still waiting for that.", "score": 2, "replies": []}, {"body": "7 to 9 years Hahahah", "score": 1, "replies": []}, {"body": "!remindme 7 years “DOW > 100,000?”", "score": 1, "replies": [{"body": "I will be messaging you in 7 years on [**2031-06-18 16:29:20 UTC**](http://www.wolframalpha.com/input/?i=2031-06-18%2016:29:20%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1di2b44/the_dow_jones_will_eclipse_100000_on_a_turbo/l96bown/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1di2b44%2Fthe_dow_jones_will_eclipse_100000_on_a_turbo%2Fl96bown%2F%5D%0A%0ARemindMe%21%202031-06-18%2016%3A29%3A20%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201di2b44)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Honestly I think this is the new normal and long term stocks only go up.", "score": 1, "replies": []}, {"body": "7-9 years is not super bullish … should be 80,000 in 7 years anyways ….", "score": 1, "replies": []}, {"body": "ahhh yes.....the good old 7-10 year.......lets look at 2014 and see how his last 10 year call went.", "score": 1, "replies": []}, {"body": "The destruction of fiat, happens every time. Looking forward to paying $100 for a jug of milk.", "score": -15, "replies": [{"body": "This is why you adjust for inflation. Nominal prices tell you nothing. Telling someone in 1930 that milk would cost 100¢ would elicit the same horror you feel now, and it would be just as ignorant. Wages and income usually at an all time high because raises exceed inflation. Stop being a fear mongering fool.\n\nhttps://fred.stlouisfed.org/series/MEFAINUSA672N", "score": -1, "replies": [{"body": "![img](avatar_exp|98552453|clown)\n\nBagholder spotted. Just inflate it away!", "score": -9, "replies": [{"body": "Inflation has been good to me. My lenders lost a lot of value from the inflation of the past few years. My wages kept up. I now how more disposable income than ever. What exactly am I bag holding?\n\nI must admit, I wouldn't mind another round of inflation.", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Another six?", "score": 2, "replies": []}]}]}
{"title": "I think $Amzn breaks $200", "selftext": "The earning aren’t far away and it’s lagging other mega cap tech, I think it busts through $200 before August. It had to clear and hold 188.35 but then it breaks out. \n\n Do you agree? Time will tell! Posted 6/17/24 ", "id": "1dhs352", "created_utc": 1718608172.0, "score": 102, "upvote_ratio": 0.77, "num_comments": 34, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 36 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "What do the red and green legos mean?", "score": 108, "replies": [{"body": "I think it will go to $2000 or it will be delisted, it's not clear...", "score": 37, "replies": []}, {"body": "it shows volume, red means closed lower than previous candle green opposite", "score": 2, "replies": []}]}, {"body": "If Amazon did a 2-1 reverse split, they’d bust through $200 overnight!", "score": 81, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 9, "replies": []}]}, {"body": "No way. You’re crazy. There’s no possible way any stock is capable of moving 8% in a month and a half. Simply not possible. \n\nMy guy you’re on WSB talking about single digit returns. ", "score": 66, "replies": [{"body": "It has never happened before im buying puts", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 21, "replies": [{"body": "As long as it waits until my CC's expire this Friday. ", "score": 2, "replies": []}]}, {"body": "It does appear to be making the elusive third breast. Typically, that means the stock will continue to sell at a price for some amount of time.", "score": 17, "replies": [{"body": "Ah. The rare total recall indicator. ", "score": 9, "replies": []}]}, {"body": "I just bought some garlic powder I am doing my part", "score": 7, "replies": []}, {"body": "wont buy more until price dips back down.", "score": 5, "replies": []}, {"body": "I think you are right. \nJust bought some more", "score": 3, "replies": [{"body": "My rsus thank you ![img](emote|t5_2th52|18632)", "score": 10, "replies": []}]}, {"body": "It will I’m bullish", "score": 3, "replies": []}, {"body": "They called you a mad man brother!!!!!!!!! Took some calls because of this post.", "score": 3, "replies": [{"body": "7/2/24 $200 a share.", "score": 1, "replies": []}]}, {"body": "Agreed - lfg", "score": 2, "replies": []}, {"body": "Tits", "score": 2, "replies": []}, {"body": "It feels like it will.  They are the juggernaut, as much at Walmart is trying to make a dent.", "score": 1, "replies": []}, {"body": "Mom! Bring out my tarot cards!", "score": 1, "replies": []}, {"body": "Only a question of when", "score": 1, "replies": []}, {"body": "head and shoulders formation, so no", "score": 0, "replies": []}, {"body": "I see it hitting mid 170s then I would buy for earnings related move but 200 not until Oct", "score": 0, "replies": []}, {"body": "Amazon just doesn’t have good products. It’s PUTS for me.", "score": 0, "replies": [{"body": "What’s AWS?", "score": 1, "replies": []}]}, {"body": "Why they are shorting today Amazon? Have I missed any news or just another market manipulation?", "score": -2, "replies": [{"body": "That's typical for a holiday week and lots of options expired Friday this week. Let's see if it hits the next support line. If it does, short!", "score": 1, "replies": []}]}, {"body": "Amazon stock STINKS", "score": -13, "replies": []}]}
{"title": "It’s Hard to Stay Risk Averse (ASTS)", "selftext": "Closed out my NVDA July calls this morning and moved some of the gains into ASTS after doing some DD this weekend. With increasing telecoms partnerships ($100 million commitment from Verizon on top of earlier partnerships), an uptrend in EPS, potential index inclusion (Russell 2000), the possibility of a short squeeze (25% short interest), a small market cap with lots of room for growth ($2B) and launch of their first batch of Bluebird satellites in a few months, I expected that ASTS would start to rocket later this year and bought January calls.\n\nI’m kicking myself for not putting more in/wishing I got an earlier expiration to get higher % gains in retrospect, but you gotta stick with your investment philosophy if you want to want to continually beat the market long-term. ", "id": "1di21r2", "created_utc": 1718641047.0, "score": 134, "upvote_ratio": 0.89, "num_comments": 32, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 months ago\n**Total Comments** | 144 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Yes! We’ve been saying ASTS for months… got in when it was in the $2 and kicking myself for not buying more. Holding $10 and $20 calls for 2025 that I’m going to convert to shares. This is a beautiful stock to hold long term.\n\nEdit: corrected year.", "score": 42, "replies": [{"body": "Holding 7.5 JAN 2025 calls up 480%", "score": 14, "replies": [{"body": "Wow nice! Given the return, I imagine you opened those a few weeks ago??", "score": 4, "replies": [{"body": "3 months ago I think I bought 10 sold 5 and let the other 5 ride", "score": 2, "replies": []}]}]}, {"body": "I’m holding those calls as well with my 10k shares. Will exercise those as well.", "score": 3, "replies": []}, {"body": "I’m excited to see where this will go! How do you think revenue will be impacted with the new BlueBird sats?", "score": 1, "replies": [{"body": "You should connect with r/ASTSpaceMobile for some good, realistic insights! I, for one, think it's going to be massive... next couple years and you're going to wish you were holding more.", "score": 6, "replies": [{"body": "Yeah great point, I joined them and found way more info than I had through my Google research, thank you!! Now I’m hoping ASTS dips a bit so that I can pile way more into it 😂 if the BB1s and BB2s go well, with such a large potential market and NVDA level margins, I think ASTS could hit $100 easily in the new couple years!", "score": 3, "replies": [{"body": "This is the dip! Hah and think $100 is within 12-months.", "score": 3, "replies": [{"body": "Yeah in the long run, even if I buy more at a relative peak right now, it’ll pay off!! Even if Deutsch Bank is only 50% right with their price target, that’s some MASSIVE upside!!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Holding almost 4k shares at @4.80 average", "score": 15, "replies": [{"body": "Damn almost 20k nice", "score": 6, "replies": []}]}, {"body": "Holding about 500 shares worth. Going for a ride", "score": 6, "replies": [{"body": "Those shares could be worth $250K by 2030!!", "score": 3, "replies": [{"body": "Or 0 by next year 🤡", "score": 0, "replies": []}]}]}, {"body": "I think I read they will be able to launch by August, but would still need to schedule a launch window, which could be an unknown amount of time.", "score": 3, "replies": [{"body": "They have a launch window (contractual) . They don't have the exact launch date yet", "score": 1, "replies": [{"body": "That's probably what I read.", "score": 2, "replies": []}]}, {"body": "I thought the stock would have not popped till closer to the launch. Maybe it still will. How many satellites are planned for launch for the remainder of the year?", "score": 1, "replies": [{"body": "Just the 5 BB1 which are smaller than initially planned.\n\nReal coverage comes late next year best case.   \nBut the first 5 should generate some revenue and convince doubters of the technology", "score": 0, "replies": []}]}]}, {"body": "Surely itll keep going up forever after the 120% move", "score": -4, "replies": [{"body": "400% if you look as far back as May 😉. I appreciate the sarcasm but I’m not expecting this to always ride. I actually expect a bit of profit taking/a dip in the near term, hence the LEAPs. This stock’s potential depends on the success of its BlueBird sats launching later this year but if they’re successful, they will have so much growth potential because they’re filling a gap in the largest broadband market in the world", "score": 13, "replies": [{"body": "when is the launch?", "score": 1, "replies": [{"body": "Scheduled between July and August! There’s potential for delays though, they’ve had some delays already. I’m betting on no further delays however, they seem to be on schedule", "score": 9, "replies": [{"body": "Just for clarity, AST has been verrrrrry careful in their wording, to say that they will \"ship the satellites to the launch facility\" (aka Cape Canaveral) in July/Aug, or something to that effect. They do not say they will LAUNCH by then. There will be weeks of integration, testing, other prep etc between getting to the launch base and actual launch. It's very possible everything goes perfectly smoothly according to plan and they dont launch until Sept or Oct. I'm just waiting for everyone who keeps reading \"we will ship to the alunch facility by July or august\" and seemingly hearing \"we will launch in July\" to start having panic and freakouts and claminings its a launch delay or that theyve been lied to when it doesn't go up until moths later lol.", "score": 2, "replies": []}]}]}, {"body": "When you say leaps you talking Jan 25?", "score": 0, "replies": [{"body": "Yeah, I know LEAPs are officially supposed to be 1+ years but in the WSB land of 0DTEs, I just use LEAP as a shorthand for my 6+ months positions lol", "score": 3, "replies": [{"body": "\"officially\" leaps are 6+ months, so you're good.", "score": 1, "replies": [{"body": "Cool! Regardless, I should get some 2026 calls bought as well so that I don’t have to pay short term capital gains on the crazy valuation growth we’ll get once the five sats this summer start generating meaningful revenue!", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Look I had to sell. I made $50 which I then lost $40 of it to a penny stock play", "score": 0, "replies": []}]}
{"title": "AAPL vs NVDA", "selftext": "What are yalls thoughts about AAPL and NVDA  for the next couple weeks? One of them is bound to be overtake MSFT but do you think they'll just keep fighting each other for that or do you think one or both of them will eventually fall out of the race?", "id": "1di5795", "created_utc": 1718648935.0, "score": 16, "upvote_ratio": 0.71, "num_comments": 31, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "AAPL up 3.8% NVDA up 8.6% ( next couple weeks as you say)", "score": 20, "replies": [{"body": "I expect at least one more significant figure out of you. Confidence intervals and P values as well, please. Thanks 🙏", "score": 6, "replies": [{"body": "Thank you: confidence 96% \\\\P” value 7%;  thanks 🙏", "score": 8, "replies": []}]}]}, {"body": "It's a triple threat match and everyone is focused on APPL and NVDA.  Without a doubt MSFT is going to hit an RKO out of no where and retain.", "score": 12, "replies": []}, {"body": "Just ride both", "score": 10, "replies": []}, {"body": "Never bet against nvda.", "score": 19, "replies": []}, {"body": "Never bet against Apple", "score": 7, "replies": []}, {"body": "I think the XLK shuffle will be a significant short-term shake up.  I also think Blackwell has very strong potential.  The further we go without NVDA having an earnings guidance pullback, the more will be at stake.", "score": 4, "replies": []}, {"body": "There can be only one", "score": 5, "replies": []}, {"body": "obviously AAPL wins long term but we ride the unstoppable bullet train that is NVDA until earnings", "score": 21, "replies": [{"body": "Why's that obvious? Past returns are not indicative of future performance.", "score": 0, "replies": [{"body": "Exactly, you hit the nail on the head with your last sentence. NVIDIA is selling shovels to fake gold. It's less about AAPL (although I am a fan) but more because I'd pick almost any other megacap over NVIDIA right now, both from a value investing and a degen perspective.", "score": -5, "replies": [{"body": "Why fake gold?", "score": 4, "replies": [{"body": "I think their analogy is more like NVDA is selling shovels to prospectors who don't know where to dig or what real gold even looks like. And as time goes on those shovel buyers will quickly die off or abandon digging altogether.  I took \"fake gold\" to mean engaging in AI just for the sake of it does not mean extra revenue or profit will be generated from it.", "score": 5, "replies": []}]}]}]}, {"body": "so true", "score": 1, "replies": []}]}, {"body": "I have a couple of shares of both...\n\nBeen in apple since 2011, nvda since April.  LOL", "score": 3, "replies": []}, {"body": "Let me ask you and everybody else that asks questions about Nvidia: have you listened to any of their speeches and ready any of their financial statements?", "score": 2, "replies": [{"body": "You think ppl here can read?", "score": 2, "replies": []}]}, {"body": "I’m invested in both so I don’t really care which one wins.", "score": 1, "replies": []}, {"body": "Why not both?", "score": 0, "replies": []}, {"body": "Long Term probably Apple, Microsoft doesn't have good will anywhere. That much is evident following the backlash from Recall", "score": -1, "replies": []}, {"body": "The first rule of Fight Club is, you don't talk about Fight Club...", "score": 0, "replies": []}, {"body": "Nvidia lacks mainstream ready to use devices and a massive digital front store with 30% cuts", "score": -13, "replies": [{"body": "you may not be familiar but NVDA's business isn't making phones and laptops and such.", "score": 7, "replies": []}, {"body": "Yeah they also lack access to grocery stores and fresh produce.", "score": 5, "replies": []}, {"body": "I don’t think you understand what NVDA actually does", "score": 4, "replies": []}, {"body": "Moron", "score": 2, "replies": []}, {"body": "There's also the Nintendo Switch", "score": 1, "replies": []}]}]}
