{"title": "$AAL - The American Airlines Degenerate Gamble - AAL Trade Thesis", "selftext": "What’s poppin’ fellas, hope you’re all doing well. I’ve got a short little trade thesis that I can’t get out of my mind due to how odd it is, and was looking for some second opinions on it. Reposting this due to it getting removed yesterday.\n\n&nbsp;\n\nIn my spare time, I’ve been working on a few tools to help me with my trades. I’ve been working on a program similar to CheddarFlow, which analyzes a shitload of options data, performs various forms of analysis on it, and then alerts me if there’s anything funky going on which could help net me some easy cash. Earlier today, my program notified me of [this order](https://cdn.discordapp.com/attachments/809296545936965642/826183106280554556/e436fbf7bcda456a57af24d40e19487d.png), which I found really odd, due to the entire nature of it. $50,000 worth of 0.04 cent AAL options hitting the wire expiring this Thursday. This trade alone isn’t that crazy since it could’ve been made due to a multitude of different reasons, but shortly after the order was caught, I got alerted that [government officials](https://cdn.discordapp.com/attachments/794766298373423136/826220503492067368/5c6356221adb7155516c01780601cb6f.png) were also picking up shares of various airlines.\n\n&nbsp;\n\nSo now, things are interesting. We got crazy volume on an obscenely stupid OTM AAL call option expiring this Thursday, alongside government officials swallowing shares of various airline companies. What do we make of this? Does somebody know something? I’m not entirely convinced that this isn’t a crazy coincidence, but the contracts are literally the same price as a scratch ticket coming in at 4$ a pop, so it’s not like the overhead cost to play is that high.\n\n&nbsp;\n\nI initially thought that this play may have been a hedge for an insanely large short position, but the stock volume, combined with the insanely short date on the purchased options says otherwise. I also thought that it could be part of a janky ass multi-legged options strategy, but my program already checks for that, and upon manual inspection of the data, I also couldn’t find anything. What the fuck is going on? **If anyone has any ideas, theories or relevant helpful information on the topic, please share!**\n\n&nbsp;\n\n**I’m not trying to bullshit anyone, this trade is likely gonna go straight to 0 well before Thursday rolls around.** That being said, coincidence or not, the circumstances surrounding it are quite enticing. To those traders who are addicted to FDs, or have cash burning a hole in their pocket and want to YOLO on something, I feel like this trade is the one to go with. For the same price as a scratch ticket, this trade provides us with comparable odds.\n\n&nbsp;\n\nTLDR : **$AAL 2021-04-01 C $26**", "id": "mgh8kt", "created_utc": 1617114323.0, "score": 136, "upvote_ratio": 0.82, "num_comments": 94, "comments": [{"body": "Member when it was $17/share...\nPepperidge Farms remembers...", "score": 43, "replies": [{"body": "'member when they were about to go bankrupt in 2011?", "score": 26, "replies": []}, {"body": "lmao i bought in at 15/sh then sold at 22. got bored mostly", "score": 2, "replies": []}]}, {"body": "Well shit - I literally accidentally bought 10 contracts. I was looking at it and dropped my phone - when I picked it up I learned that I was the proud owner of 10 contracts.\n\n10 $26c @ 0.07", "score": 37, "replies": [{"body": "Sounds like some RH shit lol", "score": 3, "replies": []}]}, {"body": "Not sure what the news could be from DC - but there is this:  \n\n\n[https://twitter.com/petemuntean/status/1376593621177266178](https://twitter.com/petemuntean/status/1376593621177266178)", "score": 20, "replies": [{"body": "oh shit", "score": 3, "replies": []}]}, {"body": "Bought 10 calls  you crazy turd", "score": 26, "replies": [{"body": "WSB must make it compulsory for every DD to have a bear case argument.\n\nYou retards get convinced easily without a bear case.", "score": 20, "replies": [{"body": "Please by all means bear away! My point is sir....this is a casino", "score": 21, "replies": [{"body": "I thought this was a Wendy’s?", "score": 15, "replies": []}]}, {"body": ">WSB must make it compulsory for every DD to have a bear case argument.\n\nBear case:  *Could* possibly go tits up.", "score": 8, "replies": []}]}]}, {"body": "I am now one of those people whose pants are burning \n\n25 AAL $26 2021-04-21 C\n\nEdit: spelling, ape dumb", "score": 12, "replies": []}, {"body": "To be honest this seems like it’s probably a coincidence or even just people being dumbasses in sync.\n\nThat said, it’s not about GME and for that alone I’m in", "score": 46, "replies": [{"body": "I'm leaning towards being people dumbasses in sync, or a big April Fools prank, but regardless, it's accidentally printing so I'm happy", "score": 18, "replies": []}]}, {"body": "fuck it i’m in", "score": 11, "replies": []}, {"body": "Fuck it I’m in 20 $AAL 4/1 $25.5c\n\nAll I needed was that TLDR", "score": 16, "replies": [{"body": "If he’s in, I’m in", "score": 9, "replies": [{"body": "If you’re in, then I’m in", "score": 6, "replies": [{"body": "I hate it when you ask if I’m in", "score": 2, "replies": []}]}]}]}, {"body": "This is exactly the kind of thing that gets me to YOLO 10 percent of my account", "score": 15, "replies": []}, {"body": "Where can I sign up for Hungry Bot?  I have been looking for a tool like this.", "score": 5, "replies": []}, {"body": "Last year a month before the cares act “961322” was gifted to the board", "score": 5, "replies": []}, {"body": "TD is trying to charge me 20$ commision on 60$ worth of calls. Since when is it not a 10$ flat fee per trade?", "score": 4, "replies": [{"body": "Don’t they charge per contract", "score": 6, "replies": []}]}, {"body": "Fuck it, im in there at 5 $AAL 4/1 $26c", "score": 7, "replies": [{"body": "Same!", "score": 2, "replies": []}]}, {"body": "This was also posted yesterday. It's much more likely to be simply covered calls than a YOLO with insider information.", "score": 8, "replies": [{"body": "Synthetic puts imho.", "score": 2, "replies": []}, {"body": "Nobody is gonna buy covered calls on a short week with 3 days left on expiration, on a strike so stupidly far OTM", "score": 6, "replies": [{"body": "/r/thetagang", "score": 6, "replies": [{"body": "Theta gang sells covered calls", "score": 5, "replies": [{"body": "That's what I'm referring to in this discussion", "score": 2, "replies": [{"body": "Op is talking of BUYING covered calls.", "score": 1, "replies": [{"body": "OP was talking about someone buying naked calls. My point was that it was probably someone selling covered calls for a few pennies.", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "I bought 980 AAL May21 $26calls this morning, and sold 980 $28 calls expiring thursday.", "score": 6, "replies": []}, {"body": "https://mobile.reuters.com/article/amp/idUSKBN27Q1Z8 38.5M shares offerd up in Nov 20\n\nhttps://www.thestreet.com/investing/american-airlines-to-offer-up-to-1point1-billion-of-stock up to $1.1 billion in stock to be sold Jan 21\n\nhttps://www.sharesoutstandinghistory.com/aal/\n\nJan 2018 high $58.48 473M shares outstanding \n\nJan 2020 Precovid crash $29.65 426M shares outstanding \n\nMar 2021 approx $24.  641M shares outstanding \n\nThere is your bear case. Stock is trading at 81% of precovid levels with 150% of the shares outstanding. So before you think the stock has $5 in it to reach precrash, realize its actually $9.17 above that level", "score": 3, "replies": []}, {"body": "Fuck it, I’m in. 10 contracts. To cheap to not throw $70 at it.", "score": 6, "replies": []}, {"body": "Is your bot just a personal bot or is there somewhere we can add it to our own discords?", "score": 2, "replies": [{"body": "You can find more info about the bot in my Discord! Links can be found on my profile.", "score": 2, "replies": []}]}, {"body": "Looks like we have some insider trading on our hands. Or a luggage boy who overheard somethin and is leveraged to the tits", "score": 2, "replies": [{"body": "Calls on luggage boy", "score": 3, "replies": []}]}, {"body": "Couldn't this be a bearish position via synthetic put? Rather than the bullish position that it appears to be, someone could be going way short on AAL and purchased a shit ton of calls as cheap insurance.\n\nGiven how AAL is performing today, I'm inclined to think this is the case.\n\nWhat's more likely? AAL up past 26 and rising by over $2billion in market cap? Or falling below yesterday's high by a buck and losing about $600mil in market cap. \n\nThe stock purchases by house congress members and the options purchase may not be remotely related.", "score": 2, "replies": []}, {"body": "I put a little bit of money in AAL and UAL.  It is not a crazy GME play to the moon sort of thing.  But, I think it is solid money they will come up at some point.  I mean it is the Airlines.  Just because people are not traveling that much now doesn't mean they will never travel again.  In all honesty if it did get to that point I do not think people would be worrying about stock anymore.  But, that is my opinion do your own DD.  But, keep in mind it is not a 2 week play or a 2 month play....more like a 6 month to 6 year play.", "score": 4, "replies": [{"body": "OP is talking about options expiring Thursday, not a 6 month to 6 year play...", "score": 15, "replies": [{"body": "I am just saying I have money in AAL.  Don't look to far into it.", "score": 6, "replies": []}]}, {"body": "I'm with you, I also put some money into longer aal and ual options. Not relating exactly to OP post, but I  don't see how airlines don't come screaming back to their pre pandemic levels of travel opens up. GME for days, but I like the slow growers too", "score": 5, "replies": []}, {"body": "AAL is almost back to pre pandemic levels. I've been playing this stock from $10 to $17 last 12 months.  Wish I kept with it, now its at $24.", "score": 1, "replies": []}]}, {"body": "I’m in too! Thanks for the DD", "score": 2, "replies": []}, {"body": "Went in for 1 25.5 call and its already up by the time I got out of the buy screen.", "score": 4, "replies": []}, {"body": "I bought a few of the same calls for fun.  Let's see where this goes.", "score": 5, "replies": []}, {"body": "TDA won’t let me buy the options. Says my funds haven’t cleared. But had no problem buy GME today. I’m cleared for option trading. WTF?", "score": 1, "replies": [{"body": "Tda only lets you buy options with settled funds.  You can buy stock with unsettled though.", "score": 3, "replies": [{"body": "Okay good to know. I thought some fuckery was afoot. 👀 *takes tinfoil hat off*", "score": 2, "replies": []}]}]}, {"body": "Remember this is the little airline that has pulled 2 airlines out of the mud . One us airways from America west airlines shares down to 0.10 and “bill franky “ buys all the shares back .  some reservation agent is now the ceo \nOf us airways with one world code share . This is some what of a short squeeze", "score": 2, "replies": []}, {"body": "I see lot of people are in, therefore IM MOTHERFUCKING IN", "score": 2, "replies": []}, {"body": "I read the DD, but since I'm retard, should I buy the stock?", "score": 2, "replies": []}, {"body": "First time I've tried options. But I bought 2 AAL $26c 4/1", "score": 2, "replies": []}, {"body": "10 shares!", "score": 1, "replies": []}, {"body": "Fuck it. I’m sold.", "score": 1, "replies": []}, {"body": "Fuck it. iam in", "score": 1, "replies": []}, {"body": "You son of a bitch, I'm in.", "score": 1, "replies": []}, {"body": "Sign me up", "score": 1, "replies": []}, {"body": "Smooth enough & cheap enough to get me to pick up some of those calls. I like to gamble!", "score": 1, "replies": []}, {"body": "Fuck it, I’m in", "score": 1, "replies": []}, {"body": "Okay I’m in with these lottos", "score": 1, "replies": []}, {"body": "Call me retard, I also bought 10 contracts. GL to all.", "score": 1, "replies": []}, {"body": "You sumbich I'm in!!", "score": 1, "replies": []}, {"body": "Just saw ibd article that's its the number 1 most overvalued stock in the s and p.  I was actually considering a long dated short position...especially if It goes up short term", "score": 0, "replies": []}, {"body": "Another large option block went through for AAL 04/09 25.5C   \nSomeone knows something.", "score": 0, "replies": []}, {"body": "This is the greatest American Reopening Ticker that has so far to go.  I’ve been meaning to post this solid DD on AAL but haven’t finished it yet. AAL is so far from its highs while DAL LUV and other airlines have pushed so far up in comparison.", "score": 1, "replies": []}, {"body": "No OI on puts... idk wtf is happening but gives me somethin to do. *im in*", "score": 1, "replies": []}, {"body": "TDLR:  $24c and $25c", "score": 1, "replies": []}, {"body": "Hmmm price from ord to hou $947.. doesn’t look like COVID pricing to me", "score": 1, "replies": []}]}
