{"title": "Bought last night on close AAPL 121 CALL", "selftext": "[removed]", "id": "mh6f1z", "created_utc": 1617198288.0, "score": 119, "upvote_ratio": 0.86, "num_comments": 88, "comments": [{"body": "**Removed for RULE: Not a trading journal: strategy and other details required.**\n\nLists of trades, or accounts statements are not a strategy. Tell us the trade details, the strategy, and why you chose it.", "score": 1, "replies": []}, {"body": "You get one free one to hook you", "score": 207, "replies": [{"body": "My first two cost me $200. Where’s my free one? (Imma bad trader)", "score": 47, "replies": [{"body": "You either get one for free or your entry fee is due immediately, lol.  You don't get to chose which.\n\nFor me, my entry fee came swiftly and it was expensive.", "score": 17, "replies": [{"body": "My very first one I made $60, the second one I lost $700 lol", "score": 6, "replies": [{"body": "This is the way.", "score": 6, "replies": []}]}, {"body": "Lmaoooo we are very bad at this game.", "score": 1, "replies": []}, {"body": "I appear to have been billed multiple times for my entry fee, where do I go to get reimbursed?", "score": 1, "replies": [{"body": "with Gamestop", "score": 1, "replies": [{"body": "Gamestop CSPs made me more money in a month than I did all last year, thetagang is what reimbursed my initial mistakes... can't touch it directly though, I gotta sleep at night.", "score": 1, "replies": [{"body": "That shit was wild wasn't it?  I sold an 8DTE $800C for $9000 lol", "score": 1, "replies": [{"body": "My favorite was the first time around when the July $0.50P got up to 0.08-09 (breakeven of $0.42-41) and the stock was trading at $300-400.  I've never put so much collateral into selling so much of a single option, but it didn't get much more free money than that.\n\nI wish GME would get that volatile again, the 2nd wave hasn't had anything as good as that was.", "score": 1, "replies": [{"body": "16%?  Holy cow.  How far out was the exp?", "score": 1, "replies": [{"body": "July, went back to 0.02 or 0.03 the next week.  I put all of my spare collateral into those super OTM puts, and bought back all of it at 0.01.", "score": 1, "replies": [{"body": "That's killer.  Nice work.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Don’t worry. My first one cost me $1200.", "score": 5, "replies": [{"body": "OOF. If you ever wanna give $1200 away again, I’ll trade you $200 😅😂", "score": 4, "replies": [{"body": "Hey, in my defense that was last year in March, when News of shutdown happened and panic selling ensued.", "score": 2, "replies": [{"body": "I have no defense for mine except I bet on meme stocks. 🙃", "score": 1, "replies": []}]}]}, {"body": "Same. On a 2k account x.x", "score": 1, "replies": []}]}]}, {"body": "My first option trade made me 3X money. Well  nothing worked after that..", "score": 4, "replies": []}]}, {"body": "[removed]", "score": 55, "replies": [{"body": "What does FD stand for? And why are they called that?", "score": 7, "replies": [{"body": "Fiduciary Duty. \n\n/s", "score": 52, "replies": []}, {"body": "F*ggot’s Delight, they’re far OTM options (usually calls) that are really only suitable for gambling.", "score": 34, "replies": [{"body": "If you're going to gamble, I can't think of a better way than to buy options tbh. Lotto tickets have basically zero chance of paying off. There are only 4500ish symbols with options, so you have a significantly higher chance of picking a winner  than picking the right lotto numbers.\n\nI think far OTM options are pretty good roi compared to scratch cards / lotto.   BB Apr 16 2021 11.5 Call is only 10$ right now and I'd say has a pretty damn good chance of being profitable (0.112 delta) considering it WAS trading way higher a month ago. It can get there, it probably won't, but neither is winning a scratch-off.", "score": 25, "replies": [{"body": "BB210416C11.5 has a 93% chance to be OTM. I wouldn't call that a good chance.", "score": 12, "replies": [{"body": "And to a gambler that's a 7% chance of making money which is pretty good odds for a casino. I don't know the math behind it--but 7% is just making any money, I'd wager that in the 7% profitable portion that 80% of the time it would barely be profitable. It can/has gone up to $20+ in recent history which would be a 1000$ profit on 10$ bet.\n\nI agree with you its not a good chance, but logic doesn't apply to wsb.", "score": 4, "replies": [{"body": "Alright, fine, if you are straight gambling, options are better than lotto tickets. \n\nI don't wanna do the math, but I'd guess that you'd have a better chance getting lucky playing some blackjack than profiting off a .1 delta call on BB.", "score": 11, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I like those odds! I've closed all my positions and am moving to Vegas!", "score": 3, "replies": []}]}]}, {"body": "With even basic skills, the probability of winning at blackjack is around 46%.", "score": 1, "replies": []}]}, {"body": "Still 980,000 times more likely than winning the lotto.\n\n1/14,000,000 is a lot different than 7/100.", "score": 0, "replies": [{"body": "You’re on an investment sub comparing terrible investments to lottery tickets to justify their legitimacy. I’m just pointing this out, nothing more.", "score": 8, "replies": [{"body": "I didn't make that original comparison, just did the math.\n\nEvery so often I burn some profit on a stupid option in my sandbox account. A few times it's worked out well. My dad's been buying tickets his whole life and has never won.", "score": 0, "replies": [{"body": "There you go again....", "score": 0, "replies": []}]}]}, {"body": "Yes, but it is something like 6.99/100 you'd profit a few dollars from this trade and 0.01/100 that you'd profit a significant amount.", "score": 1, "replies": [{"body": "Nobody is arguing it's a big number, or a smart bet, or will ever produce profits, but 1/10,000 is still a lot bigger than 1/14,000,000.\n\nThe point is some people buy stupid options for the same reason others buy lotto tickets. Both are realistically planning on losing the money, but only one of them has any tangible chance of winning once in a while.", "score": 2, "replies": [{"body": "But, 1/14,000,000 is the chance to hit on all your numbers. The chance to hit a few numbers and collect a few dollars is quite a bit higher. I don't wanna crunch the numbers, but it may actually be more likely to win a few bucks on a lotto ticket versus this hypothetical call on BB.", "score": 1, "replies": [{"body": "Well I wasn't buying that particular option lol but you're right, that certainly does do something to even the odds depending on how much of a degenerate the player is.", "score": 2, "replies": [{"body": "Well, we can agree that buying OTM calls on BB is pretty dumb, and possibly only slightly favorable to buying a lotto ticket.", "score": 1, "replies": [{"body": "Yessir.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": ">Still learning about options myself, what are you using for percentages to estimate OTM? Because the Delta is so close to zero?", "score": 1, "replies": [{"body": "Personally, I use thinkorswim which is TDA desktop trading application. It is pretty great, FYI. But, most (all?) trading apps will tell you the percent chance an option expires OTM.\n\nYou can also use delta to give you a rough estimate of the percentage chance OTM, but, remember, delta is measuring how much the price of the contract will move in response to a 1 dollar move in the underlying and does not exactly correlate to probability OTM.\n\nAnyway, there is a bunch of fancy math that uses the price history of the underlying to calculate probability OTM. However, be aware, the variables used in this calculation can change very quickly, and 93% OTM isn't a certain as it seems.", "score": 2, "replies": [{"body": "Thanks for your detailed response! I've been paper trading thinkorswim but am still learning my Greeks and reading before using real currency. Well noted on those percentages being (albeit very well-calculated) chances.", "score": 2, "replies": []}]}]}]}, {"body": "Don’t kid yourself too much about FD’s being a smart play, though, even as a gamble – you’re going up against sophisticated traders with more information and experience, _and_ you’re crossing the bid-ask spread, so you’re probably overpaying twice anytime you buy one. If you want to gamble, learn how to play poker and go to a casino. There’s no house edge or cut, and you might even get some free drinks.", "score": 2, "replies": []}]}, {"body": "Actually they are very suitable for generating income as long as you are selling them...", "score": 5, "replies": [{"body": "Sure, I'd sell a 0.1 delta option on BB, if I was willing hold BB at all.", "score": 2, "replies": []}]}, {"body": "I explained this to somebody once and got a 1 week site-wide ban for saying the F word -_-", "score": 1, "replies": [{"body": "\"Jew\"?\n\n\n-with apologies to Eric Cartman", "score": 1, "replies": []}]}, {"body": "They are OTM weeklies with the shortest expiry", "score": 1, "replies": []}]}, {"body": " It's a derogatory term that we don't support on this sub.", "score": 2, "replies": []}]}]}, {"body": "Congrats on winning your coin flip!  If you're new to trading (my ball-park meaning of less than several years experience) please be careful with those extreme short term options.", "score": 47, "replies": [{"body": "You could just say \"congrats\" in the future. The condescension in this sub is sad.", "score": -71, "replies": [{"body": "The worst thing that can happen top an option noob is winning right out of the gate.  That conveys the easy money thoughts and after committing more money, one day they end up wondering, \"Where did it go?\"  Poof!", "score": 34, "replies": [{"body": "Grew up in Vegas. There is a reason they call it beginners luck. It has a strong correlation with survivorship bias.\n\nIf you win on your first outing, you are much more likely to become a gambler (or in this case, an options trader). If you lose on your first outing, you may decide that this isn't for you and never get in all the way.", "score": 14, "replies": []}]}, {"body": "*looks out for fellow trader*\n\n\"Bro stop being condescending\"", "score": 19, "replies": []}, {"body": "Actual useful advice is not being condescending you twat.", "score": 6, "replies": [{"body": "You should actually look up what condescension means, dickhead, since you obviously don't know shit about the term.\n\n*See, that's me being condescending to you, instead of just saying \"I recommend you look up what it means as you can be condescending while still giving advice.\"*\n\n*;-)*", "score": -5, "replies": [{"body": "I know more about the term than you do about trading salty boy.\n\nAnyways make sure to post your lost porn. We’re looking forward to it.", "score": 3, "replies": [{"body": " You're *that* affected by my response that you have to bring up shit unrelated to the conversation?\n\nLMAO, stop it.", "score": -4, "replies": [{"body": "Its not unrelated. If you think we should blindly congrats no DD (and even with DD) extremely risky plays...\n\nThen you’re also an idiot. An idiot with delicious loss porn.\n\nEdit: *italics make me look intelligent*", "score": 2, "replies": []}]}]}]}]}, {"body": "That was pretty condescending.", "score": -11, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Lol damn bro, who hurt you?\n\nShow me where the *in depth discussion*  occurred or the *educational* piece in the original comment I responded to?\n\nAlso, I prefer r/thetagang to WSB but as you were.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I agree with your last statement for sure. The OP post wasn't needed.\n\nI also think that the trauma caused by WSB to a lot of the other stock/trading subs is real too, making discourse more toxic than usual.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Wow, talk about straight-up rollin' the 🎲🎲.\n\nConsider yourself lucky AF. Take the proceeds and buy a lotto ticket with that luck.", "score": 8, "replies": [{"body": "Lol, perhaps I will. It sure done well that's for sure", "score": 1, "replies": []}]}, {"body": "First one is free.", "score": 7, "replies": [{"body": "Lol", "score": -3, "replies": []}]}, {"body": "Someone took the bait.", "score": 4, "replies": []}, {"body": "How many contracts did you buy?", "score": 4, "replies": [{"body": "Only the One, just dabble now, don't need the stress, used to trade a lot years ago and make a few quid\n\nNot doing to bad at the minute, but obviously that could change", "score": 4, "replies": []}]}, {"body": "Good for you", "score": 3, "replies": []}, {"body": "Wow! Very lucky play there.", "score": 3, "replies": []}, {"body": "im pretty New to options. however appl calls for Jan 2022 for a $140 call is only like $500, doesnt that feel like free money. I mean apple will for sure go up $20 in the next 9 months! right?", "score": 3, "replies": [{"body": "It looks like there's about 20% chance it goes up by approximately 20% by then. Don't forget to include the premium in your break even.", "score": 2, "replies": []}, {"body": "140 is a long ways up but if you’re going to buy options out of the money, LEAPs are where it’s at; there’s a reason thetagang doesn’t sell those.", "score": 2, "replies": []}, {"body": "It could do, then again it may not, that is the nature of the beast. Research AAPL to help with your appraisal. I cannot give you advise myself sorry", "score": 1, "replies": []}, {"body": "it would need to go to 145 for you to breakeven on expiration date", "score": 1, "replies": []}]}, {"body": "I’m trying to get out of my appl call for January 2022. Paid $2000 for it.", "score": 2, "replies": [{"body": "Am so sorry but am not in a position to advise you. Why don't you post the details of your trade and see what others may say\n\nTheir are some very experienced options traders on here who could give you some ideas as to how to salvage your position\n\nGood luck, hope it all gets sorted", "score": 0, "replies": []}]}, {"body": "Cool", "score": 2, "replies": []}, {"body": "Well done. I sold April 9 117 cash secured puts. I  will buy them back tomorrow, long calls have no margin requirement so you buy more with less money. Congrats on the gains!", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "If you think AAPL is manipulated- you’re too far gone to save", "score": 1, "replies": []}]}, {"body": "I'm becoming a big fan of buying ITM short term calls on a red day - usually see a decent correction and a return.  Worst case I can close out with some intrinsic value - congrats on the solid trade", "score": 1, "replies": []}, {"body": "What was plan B? And what made you choose plan A?", "score": 1, "replies": [{"body": "Sit and watch my monitors whilst wondering what to do lol", "score": 1, "replies": []}]}, {"body": "That’s how we do it!!!", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "mgvfqj", "created_utc": 1617155460.0, "score": 8, "upvote_ratio": 0.7, "num_comments": 92, "comments": [{"body": "Most of them, on a longer timeline.", "score": 37, "replies": [{"body": "actually most companies at a longer timescale will devalue at some point. This is why you have to buy indices for long investments - the companies that go bad gets swapped out. By the way, none of the initial companies in the DJIA made it to today. The only one added before 1970s is P&G", "score": 1, "replies": []}]}, {"body": "Mining stocks are beaten up right now", "score": 8, "replies": [{"body": "I'm struggling to cut through the BS on rare Earth plays like MP and UUUU.", "score": 1, "replies": [{"body": "I have 2 mining stock and they are crushing me right now", "score": 1, "replies": []}, {"body": "Come check out /r/bullreetard! That's all we talk about lol", "score": 1, "replies": []}]}]}, {"body": "PFE is going to be making bank and has created partnerships and processes that will last far beyond the pandemic. People smarter than me have said the stock could go to 50 by the end of the year. \n\nLDI - folks overreacting to rising mortgage rates while allowing this stock to somehow trade at a 1.2 P/E ratio. Their business should at least be valued reasonably close to RKT. \n\nMO- one of the best speculative weed plays out there that actually pays you 6.58% to wait for legalization. \n\nCVS- P/E under 14 for one of the largest health insurers in the U.S. and a vertically integrated healthcare play. Peer UNH valued at 23 P/E\n\nEBAY - P/E under 13 for a U.S. based e-commerce play integrated with Google shopping? What am I missing here?\n\nOthers worth noting:\nSAGE\nVTRS\nBABA\nBIDU", "score": 7, "replies": []}, {"body": "Amd", "score": 10, "replies": []}, {"body": "RKT. Their PE is half of what it should be https://youtu.be/sO0MRjEYTzg", "score": 12, "replies": [{"body": "Why though? I've been trying to figure this out.", "score": 2, "replies": [{"body": "Watch the video?", "score": 4, "replies": [{"body": "LoL link didn't show up", "score": 3, "replies": []}]}]}, {"body": "Thanks, very interesting", "score": 2, "replies": []}, {"body": "you're willing to wait 2 quarters until this is fully adjusted?", "score": 2, "replies": []}, {"body": "3 directors sold a lot of stocks (half billion $ worth each) at the end of march for 24.75 :/", "score": 2, "replies": []}, {"body": "Are you expecting much movement with such low volume? it's at 9% of the 30 day avg?", "score": 2, "replies": []}, {"body": "Just watched the video you shared. All it’s saying is that some websites are displaying Rocket’s P/E ratio incorrectly. That doesn’t necessarily mean the company is undervalued, just that many investors may be mislead to believe Rocket is overvalued.\n\nThis is a compelling reason to buy but I’m not convinced Rocket is undervalued based on this video alone.\n\nDo you have an argument for why Rocket’s P/E should be higher than 7?", "score": 1, "replies": [{"body": "?? Why would he have an argument for a higher P/E than 7 if he is saying rocket is undervalued?\n\nThe video explains that it should be 7 and 7 is good. Very good. Average for s&p is 13-15, and the lower p/e the more undervalued the company is.\n\nThe video explained that they do the math wrong because rocket is public only since like august. Instead using all quarters from last year they use only the last two.\n\nIf you use lower value of historical p/e average of s&p (13) and multiply that by eps from all 4 quarters (3.39) you get fair price of 44.07. And that is only the previous year. This year the housing market is on the rise.", "score": 1, "replies": []}]}]}, {"body": "Anyone know a sure way to double your Money?", "score": 14, "replies": [{"body": "1. Start with amount $X.\n2. Go to work\n3. Collect paycheck until you reach amount of $X.", "score": 23, "replies": [{"body": "Until you reach amount of $2X*", "score": 15, "replies": []}]}, {"body": "Go to a casino", "score": 8, "replies": [{"body": "If he wanted to gamble with his money, he could just put it into the stock market.  No need to go to a casino.", "score": 2, "replies": []}]}, {"body": "Cut it in half", "score": 3, "replies": []}, {"body": "Put it all on RIDE.", "score": 1, "replies": [{"body": "Gonna be rough in September when they don’t deliver and the stock takes another leg down. Gonna be even rougher in December when tax loss harvesting comes and the stock goes to the low single digits.", "score": 2, "replies": [{"body": "I didn't say I did it. The dude asked for \"a sure fire way to double his money\". Dumb question gets a dumb answer. Thanks for the down vote. My real answer would be there is no sure fire way.", "score": 1, "replies": [{"body": "Dude I was joking about What OP was asking. Didn’t think I needed the /s on that one", "score": 1, "replies": []}]}]}]}, {"body": "Save double the money.", "score": 0, "replies": []}, {"body": "I guess you don't know what value investing is?", "score": -2, "replies": []}, {"body": "Based on this week buy any penny china stock. They getting pumped so hard.  Exit is key though.", "score": 1, "replies": []}, {"body": "No doubling but research USOI.  Your are welcome.", "score": 1, "replies": []}]}, {"body": "T, GIK, TSM, NSPR, CRMD, RYCEY", "score": 7, "replies": [{"body": "RYCEY!", "score": 4, "replies": []}]}, {"body": "CVS", "score": 3, "replies": []}, {"body": "It’s kind of has a meme stock reputation, and gets a lot of hate but personally I think $FUBO is undervalued and oversold.", "score": 5, "replies": [{"body": "I have FUBO. I'm excited about their sports book/ online betting.\n\nBut this class action suit is dragging it down", "score": 2, "replies": []}]}, {"body": "Boeing", "score": 2, "replies": []}, {"body": "*cough* GOEV \n\n<runs away>", "score": 2, "replies": []}, {"body": "Very very few value deals right now in the world but especially the US. \n\nI think LMT is undervalued and is probably my highest conviction from a value perspective. \n\nI think you can make a decent case for some pharma and biotech companies that they are a good risk/reward- Merck, Regeneron, Vertex, Pfizer, Abbvie, Bristol Myers. These are harder to pick winners and losers because of drug pipeline and would buy a basket of them (this is exactly what Buffett did).\n\nOthers are higher risk but I still think are undervalued - Prudential, CI Financial. I see Aflac, and other insurance/reinsurance as good values, it’s just a sector I don’t invest in.\n\nPersonally I like BABA and JD and feel the reward outweighs the risk but understand the sentiment toward Chinese internet companies right now.\n\nI think Tobacco, specifically BTI and to a less extent MO are undervalued.\n\nI’ve parked a lot in a 4.5% bond called Verizon and waiting for a correction to buy more equities. Lots of great companies but not a lot of great valuations out there right now. \n\nMy risk-on is EM value stocks (EYLD), probably the best deal globally - granted we have to get past a strong dollar/high 10 year US yield hump first which will be rocky for EM.", "score": 2, "replies": []}, {"body": "RYCEY", "score": 2, "replies": []}, {"body": "ROLLS ROYCE", "score": 2, "replies": []}, {"body": "VRTX, BMRN, FB. coincidentally first two are pharma-related, but core business values are either current share price or slightly higher. Basically a binary bet 0 or 1 that their pipeline (which will have data coming soon, for both names), will have positive results and if the prospect of negative news was already baked in when they dropped hard, then it’s an asymmetric opportunity. FB just because of regulatory overhang and their general reputation, but they make a ton of money and ad spending is supposed to have accelerated already.", "score": 1, "replies": [{"body": "I personally think FB is fucked long term with the shift to less data driven add targeting.", "score": 5, "replies": [{"body": "Yeah that looks to be a headwind but I think it’s transient and short term. If FB can move more people into its “walled garden” ecosystem through FB marketplace and Instagram-related e-commerce then it doesn’t need to track people’s activity in other places. I agree with your sentiment though for now.", "score": 1, "replies": []}]}, {"body": "I'm big on biomarin at these prices.", "score": 1, "replies": []}]}, {"body": "SUMO look at their cash, YOY growth, beating estimates, and huge future ahead being a cloud, security, devops, data solution.", "score": 1, "replies": []}, {"body": "EEENF", "score": 0, "replies": [{"body": "Yes.  I love this company 88 Energy so far this month.  Planning to double my money again.  Hope they have a couple more big updates soon.", "score": 1, "replies": []}]}, {"body": "$RIG , it’s assets and all make it worth 18.53 a share and it’s currently under $4. It has good contracts that let them get paid 75% of the contract if someone cancels. It’s the only offshore driller that hasn’t filed bankruptcy and restructured. It’s sitting nice. Do your own research though.", "score": 1, "replies": []}, {"body": "$CRSR all day", "score": 1, "replies": []}, {"body": "Possibly FLGT, VIAC, FB I hear, POSH is getting there", "score": 1, "replies": [{"body": "VIACA or VIAC?", "score": 2, "replies": [{"body": ">VIACA\n\nVIACA has 1/100th the volume of VIAC, so I went with VIAC.", "score": 3, "replies": [{"body": "Yeah I got VIAC too but VIACA gained $2.29 compared to $1.6 for VIAC yesterday. Just wondering if I bought the wrong shares.", "score": 1, "replies": []}]}, {"body": "ViacomCBS (VIAC)", "score": 1, "replies": []}]}]}, {"body": "Disney & ZOOM", "score": 0, "replies": [{"body": "Dip recently on DIS I bought.  So much upside is nuts.", "score": 3, "replies": [{"body": "I’m holding @ 190 I can’t believe Disney isn’t way up with the parks re-opening", "score": 1, "replies": [{"body": "You do realize 190 is like 25% over where it was pre Covid right?\n\nDon’t get me wrong. I love Disney. One of the strongest brands in the world with a streaming platform going bonkers. But...the parks and studio were a money sink this year, so 25% up in a year is pretty good", "score": 6, "replies": [{"body": "Disney+ is an absolute behemoth. Worth that 25% all by itself.", "score": 3, "replies": []}, {"body": "Careful friend, I tried telling people Disney was overvalued a few days ago and created a lot of anger amongst the Disney investment crowd. I also said it was a great company.", "score": 2, "replies": [{"body": "Disney is extremely overvalued right now. Company is great will do fine long term, but will it beat the index short term? Not so sure due to its valuation.", "score": 3, "replies": [{"body": "Agree 100%, the valuation is extreme, but man, it has a vehement following.", "score": 2, "replies": []}]}, {"body": "I’m invested in it too!  I keep waiting for a drop to  add more but but doesn’t happen. \n\nI LOVE it, the brand is incredible. And they\nWill overtake Netflix in 5 years. However, if covid doesn’t get figured out, they have a lot of travel related losses coming. \n\nWill see!", "score": 2, "replies": []}]}]}]}]}]}, {"body": "USOI\n\nPLANT $, collect dividends.  Solid cash earner.  Prove me wrong.", "score": 0, "replies": [{"body": "It’s a good yield, but taxes can be mess with this one as it’s not divy but coupon payments. It also doesn’t hold the underlying, and is classified as an etn. \n\nCurrently hold 3% of my portfolio here", "score": 2, "replies": []}]}, {"body": "I'm thinking VIAC is at least 1 or 2% undervalued now.\n\nCPNG is probably undervalued, but they're too new in the market to really say. If you believe that they're really \"the Korean amazon\" then they're undervalued. If they're not, then they're not. In a year, you'll be able to talk about fundamentals.\n\nGSK has a P/E of 12 and P/B of 5.\n\nXEL has a P/E of 24.1 and a P/B of 2.57\n\nI own all these.\n\nA month ago, there were more things overpriced than now, but perhaps also more things underpriced. But I bought those, and sold them again already when they went up. The list above is pretty weak; questionable picks. I'm out of value plays, I'm back to being focused on speculative plays now.👼", "score": 0, "replies": []}, {"body": "Check my list\n\nAll shorted\n\nEpic short squeeze coming \n\nEspecially in $ALYA and $SINO", "score": -8, "replies": [{"body": "Shorted does not mean that it should be higher ... just a heads up some companies are shorted ... because ... well they are going to fail ...", "score": 4, "replies": [{"body": "I wish", "score": -1, "replies": []}]}]}, {"body": "$FTI, way undervalued.", "score": 1, "replies": []}, {"body": "BGFV", "score": 1, "replies": []}, {"body": "Gazprom", "score": 1, "replies": []}, {"body": "NEPT will be at 6 within the year...  mark it.  Set a reminder below.", "score": 1, "replies": [{"body": "Why", "score": 1, "replies": []}]}, {"body": "SPWR, a P/E of 12 is much too low for their growth prospects.", "score": 1, "replies": []}, {"body": "UNM BMY MRK LMT ( kinda ) VRTX BABA ( compared to the other e commerce giants ) BTI MMP EPD", "score": 1, "replies": []}, {"body": "Gold miners", "score": 1, "replies": []}, {"body": "Every chinese stock. China and the us are currently fighting over who will be number one and as things go in atleast 20 years china will be up in the top.\n\nEurope basically only has a stuck in between function.", "score": 1, "replies": []}, {"body": "DKNG", "score": 1, "replies": []}, {"body": "Altria", "score": 1, "replies": []}, {"body": "ALVR", "score": 1, "replies": []}]}
{"title": "$PSFE (Paysafe) the most undervalued fintech play on the market. Popular analyst Steve Grasso has been calling for it to triple.", "selftext": "Using the lower end of  Paysafe’s forecasted EBITDA ($500M), $1.5B revenue, an EV adjusted for  $1.8B debt, and applying the post-merger pro forma 720M outstanding  shares, here are Paysafe’s potential share prices based solely on sector  peer **EV/EBITDA ratios:**\n\n⁃ PayPal : $269B EV/ $4.47B EBITDA\n\n    \t= 60.2x &amp;gt;&amp;gt;&amp;gt; Paysafe $28.2B EV / SP: $39.28   \n\n⁃ Repay : $2.2B EV/ $30M EBITDA\n\n    \t = 73.3x &amp;gt;&amp;gt;&amp;gt; Paysafe $34.8B EV / SP: $48.43   \n\n⁃ Shift 4 : $7.7B EV/ $90M EBITDA\n\n    \t= 85x &amp;gt;&amp;gt;&amp;gt; Paysafe $41B EV / SP: $56.91   \n\n⁃ Nuvei : $15B EV/ $171M EBITDA\n\n    \t= 87.7x &amp;gt;&amp;gt;&amp;gt; Paysafe $42B EV / SP: $58.40   \n\n⁃ Adyen : $56B EV/ $273M EBITDA\n\n    \t= 205x &amp;gt;&amp;gt;&amp;gt; Paysafe $101B EV / SP: $139   \n\n⁃ Square : $107B EV/ $357M EBITDA\n\n    \t= 299.7x &amp;gt;&amp;gt;&amp;gt; Paysafe $148B EV / SP: $205.64   \n\n⁃ [Bill.com](https://bill.com/) : $13.2B EV/ -$15.6M EBITDA\n\n    \t= 308x &amp;gt;&amp;gt;&amp;gt; Paysafe $152B EV / SP: $211.39   \n\n⁃ Affirm: $21.6B EV/ -$68M EBITDA\n\n    \t= 317x &amp;gt;&amp;gt;&amp;gt; Paysafe $156.7B EV /SP: $217.64   \n\nEV/Revenue ratio , non-public company’s with estimated revenue per recent funding rounds:\n\n⁃ Stripe : $95B EV/ $1.8B est. rev\n\n    \t= 52.8x &amp;gt;&amp;gt;&amp;gt; Paysafe $77.3B EV / SP: $107.44   \n\n⁃ Chime : $30B EV/ $600M est. rev\n\n    \t= 50x &amp;gt;&amp;gt;&amp;gt; Paysafe $73.2B EV /SP: $101.67   \n\n⁃ Checkout : $15B EV/ $100M est. rev\n\n    \t= 150x &amp;gt;&amp;gt;&amp;gt; Paysafe $223.2B EV / SP: $310   \n\nNote: Most of these companies have negative earnings and smaller margins than Paysafe.\n\nI’m  not suggesting it’s worth this much, but for reference, averaging the  above multiples would put BFT/Paysafe’s share price at $135.98\n\nMore realistically, taking the average from the lowest four puts the share price at $50.75.\n\nPaysafe is the number 1 digital wallet in Igaming, Draftkings uses them, and most recently they just partnered with Coinbase. As all SPACs do now, it sold off big today with the ticker change so there has never been a better time to buy than now! \n\nNote : I’m long PSFE with 3,350 shares @15.47\n\nCredit all the numbers to u/greensymbiote", "id": "mhgcil", "created_utc": 1617226510.0, "score": 237, "upvote_ratio": 0.96, "num_comments": 99, "comments": [{"body": "I like this stock also. Building a position as opposed to taking an outright huge positions given where the overall market is. Good analysis. Just remember there is more than numbers. Partnerships, Mgmt, business sectors, etc. it’s not all apples to apples", "score": 47, "replies": [{"body": "Good points. Partnerships: Draftkings, Roblox, Spotify, eToro,  Fortnight, Coinbase, Amazon,  Twitch, EA, 888, ApplePay, Youtube, Visa, Microsoft, Xbox, Amelco,  William Hill, Ceasar's, Betfair, Pokerstars, PayLease, ESL Gaming,  Luckbox, bet365, Lotto etc. etc.\n\nPaysafe's newly announced Board of Directors includes a former Morgan  Stanley CEO, a former Chairman of the American Gaming Association and  CEO of MGM Resorts International, a legal and regulatory expert in the  multi-jurisdictional online and retail gambling industries, two senior  Managing Directors from Blackstone, two from CVC, the CEO of Dun &  Bradstreet and CEO of Black Knight, and the Chairman of the Board of  Fidelity, Bill Foley, who, in just the last five years, grew Ceridian  3.3X ($4.2B to $14B), Dun & Bradstreet 5.6X ($2B to $11.3B), Black  Knight 8.7X ($1.6B to $14B) etc. etc.", "score": 41, "replies": [{"body": "Holy fuck, daddy likey", "score": 22, "replies": []}, {"body": "Wowowow, if RKT gets and ER pop I may roll it here....what are earnings expectations? Thanks for all the info🤝", "score": 3, "replies": [{"body": "You can find earnings guidance and other new info here:\nhttps://www.reddit.com/r/SPACs/comments/mw9loa/reviewing_the_bear_case_on_paysafe_psfe/", "score": 2, "replies": [{"body": "Awesome, appreciate the info man 💪", "score": 2, "replies": []}]}]}]}]}, {"body": "This better get me a Big house in front of Pacific Water in British Columbia.", "score": 38, "replies": [{"body": "Get us 🥳", "score": 5, "replies": [{"body": "Lets make it a compound.", "score": 5, "replies": []}]}]}, {"body": "And they're down today??? I'm buying more tmr if its down more.", "score": 20, "replies": [{"body": "Yeah bit disappointed at the moment holding shares from BFT at 14 for months now.\n\nI still have a price target of double that for the EOY.", "score": 5, "replies": []}, {"body": "Yea I want shares around $11", "score": 3, "replies": [{"body": "It won’t get that low unless the market shiet itself again", "score": 13, "replies": []}]}]}, {"body": "I like your thinking although paysafe's margins are lower and the margin for growth is also lower. But even with that taken into account and with a greater possible TAM ( so more growth as projected hopefully ), and revenue projection outperformances. I have a pt of 25-30 for this stock by the end of **2022 (** with an outperformance target of 40 dollars if the sports betting legalisation is accelerated across the  US )", "score": 12, "replies": []}, {"body": "Watch Bill Foley’s interview on mad money from Monday and you can see they have massive plans here. Already hugely established in I-gaming, gambling (including draft kings), and cryp-to (including coinbase). And planning to expand with Foley in Vegas to “cashless casinos.” Their partnerships are legit and they are announcing new ones weekly it seems like, big revenue ($1.5 billion) and great margins, the board is highly credible with heavy hitters, and Foley mentioned that they are now deleveraged and have some nice deals they are far along in working out. This is my number 1 play for 2021 and I’m loaded big. I really cannot see any major downside from current price in my opinion. If this went IPO instead of s-pac route, this would have been listed over $50 and likely soared over $100 immediately (as all these ridiculous IPOs seem to do). It’s criminal how undervalued this is right now in my opinion.", "score": 22, "replies": [{"body": "Yeah Cramer was wetting his pants over this. He said, \"There is something about Paysafe that may be the ultimate stock for this moment.”", "score": 19, "replies": [{"body": "If Cramer likes it...it makes me cautious. \n\nWhat are we missing?", "score": 9, "replies": [{"body": "lol, true enough. I typically do the opposite of Cramer. He's usually late to the party and creates bag holders. This is a rare moment when I agree with him and his timing is right. Dumb luck.", "score": 4, "replies": [{"body": "Broken clock is right twice a day.\n\nBut yes, if someone made an ETF shorting stocks that Cramer endorses...sign me up.", "score": 7, "replies": [{"body": "Brilliant idea.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "They project only 10 % revenue growth which is the slowest of all of these but i dont hate it.", "score": 21, "replies": [{"body": "This is not entirely correct. They said they are projecting 11% based on the entire fintech market at large.  They said they are doing this to be conservative, excluding M&A plans and iGaming growth potential in the US.  Also, other fintechs that have much higher multiples, have slower or similar growth.  For example, Shift4 reported only 4% y-o-y grwoth, Fiserv projects only 5% CAGR going forward while GPN's growth projection is on par with  Paysafe's. Meanwhle Paysafe's margins are growth faster than competitors like PayPal.", "score": 18, "replies": [{"body": "I think we finally have a SPAC that is underpromising and will over deliver instead of over promising and under delivering", "score": 28, "replies": [{"body": "That's Bill Foley's style.  He knows how to work the analysts to always beat expectations.", "score": 20, "replies": []}, {"body": "Agreed.", "score": 6, "replies": []}, {"body": "> based on the entire fintech market at large.  They said they are doing this to be conservative, excluding M&A plans and iGaming growth potential in the US.  Also, other fintechs that have much higher multiples, have slower or similar growth.  For example, Shift4 reported only 4% y-o-y grwoth, Fiserv projects only 5% CAGR going forw\n\nWhich is very rare", "score": 3, "replies": []}]}]}]}, {"body": "What are people's thoughts on SoFi once it goes public?", "score": 9, "replies": [{"body": "I haven’t looked into any actual DD on them but I do use SOFI and I quite enjoy the app", "score": 5, "replies": [{"body": "I like the app as well, it's lacking in some areas but I  see it changing and updating everyday. Can't wait till they add options and stop losses for their invest platform. They're also getting a lot of exposure hosting the super bowl in their brand new stadium.", "score": 5, "replies": []}]}]}, {"body": "Fidelity \"can't find\" PSFE 😞", "score": 9, "replies": [{"body": "Just listed on New York stock exchange today. If you do advanced search for “PSFE” on fidelity it will come up right now. Will be on their quick access search tomorrow and will be easier to find. Fidelity is terrible with ticker changes and it takes a day to work out the kinks.", "score": 9, "replies": [{"body": "Thanks ☺", "score": 3, "replies": []}]}, {"body": "It’s crashing the iOS stocks app. I can search for it and it shows up, but every time I click on it the app crashes. I can find it on TDAmeritrade though.", "score": 3, "replies": []}]}, {"body": "Shoutout to E\\*Trade who knew this was the merger date for weeks but somehow still couldn't get options trade to accept an order under the new ticker symbol for an hour this morning!", "score": 16, "replies": [{"body": "Ally still hasn't figured it out. Had some CC's I'd like to close. Maybe tomorrow.", "score": 2, "replies": []}]}, {"body": "$39 EOY. Count on it.", "score": 13, "replies": [{"body": "!remindme 6 months", "score": 3, "replies": [{"body": "I will be messaging you in 6 months on [**2021-10-01 02:31:29 UTC**](http://www.wolframalpha.com/input/?i=2021-10-01%2002:31:29%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/mhgcil/psfe_paysafe_the_most_undervalued_fintech_play_on/gszjvcy/?context=3)\n\n[**10 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fmhgcil%2Fpsfe_paysafe_the_most_undervalued_fintech_play_on%2Fgszjvcy%2F%5D%0A%0ARemindMe%21%202021-10-01%2002%3A31%3A29%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20mhgcil)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "Does anyone know the exact date (not days from merger) of the lockup expiration?", "score": 6, "replies": [{"body": "If I’m doing my math correctly, June 28th is the soonest it can be. That assumes the price stays above $12 for the next 19 trading days in which case lockup is shortened to 60 additional days.\n\nEdit: I put 20, but today counted, so 19", "score": 9, "replies": [{"body": "should we be concerned that when the lockup periods ends that the stock price will likely drop due to sell offs? Or not necessarily the case", "score": 2, "replies": [{"body": "I think it’s a pretty safe bet that it will sell off hard at that point. How many buyers are there to soften the blow remains to be seen. That’s just the truth, and I’m a proud Paysafe holder. Honestly, my thought on PSFE is that it’s a great long term hold, and a potentially great short term play, but it will most likely be an awful mid term play when those lockups end. \n\nI could be wrong, but my plan was to hold up until lockup and sell, and then buy back in on the crash. If it doesn’t pump enough before then to warrant selling then I’ll just hold it and weather the lockup expiration.", "score": 3, "replies": [{"body": "The price is quite low tho, people locked in don’t have much profits to be made. Do you think there still would be a huge sell off?\nI want to get it but looking for an entry point", "score": 3, "replies": [{"body": "For both CVC and Blackstone, they simply aren’t in the business of holding public companies, and with their amount of shares, they are at a massive profit already. They will almost certainly sell if it’s above $10. As for the other PE investors, you never know. \n\nAgain, best case scenario, by the time lockup ends, there’s enough buyers there to buy up any dip. It’ll be a massive number of shares, but if it’s trading at say $40-50 and the lockup drops it to $20, hopefully the sentiment is strong enough to see that as an ultra buying opportunity.", "score": 1, "replies": [{"body": "Their profit isn't actually that big. They paid $3.9B in 2017 and or now getting around $5.5B in cash and shares.  It's something like a 45% gain over 4 years even though they've spent a billion in M&A and nearly doubled revenue in that time.  From recent quotes, I'm inclined to believe that they'll want to see what the \"Foley network\" can do to share value.", "score": 3, "replies": []}]}]}, {"body": "yea I figured along the same lines. might go in tomorrow if I can snag it under $14.50 or so. do you have a price target if you’re looking to sell at before lockup ends? thinking to maybe play it short term myself, and then get back in after seeing what price action looks like later this year", "score": 2, "replies": [{"body": "I mean in all honesty, I think this thing is conservatively worth somewhere in the 25-35 range as is. If it shakes the spac curse and gets some love in the near term, I wouldn’t be surprised to see it basically following the draftkings trajectory and settling in around the $50+ range, but I’ve also been expecting that run for awhile now. In my opinion, anything under $20 is a steal, though, as with everything, the lower you can buy, the better. Current price is crazy cheap, but that doesn’t mean it can’t go lower. I would think the PIPE investors would want it to stay above 12 though as their shortened lockup depends on it. \n\nIt would take a more sizeable run from here for me to consider cashing out and buying lower, but I imagine we’ll have a lot better idea on public sentiment the closer we get to that lockup.", "score": 5, "replies": []}]}, {"body": "I'm not anticipating a sell off based on recent signals:  Eli Nagler, a Senior Managing Director at Blackstone, just said:  “Today is a significant milestone for Paysafe and a testament to the  excellent work of their world-class management team over several years.  We believe Paysafe has a long runway for further growth and look forward  to remaining part of the team and seeing their continued success as a  public company.” Regarding Blackstone and CVC, who now have four senior  managing directors on Paysafe’s Board, Foley said, “They rolled a  significant amount of their investment which is a confidence builder.  They didn’t take all their money off the table… All of these things put  together really created the confidence among the investor base to invest  in the PIPE and then support the stock.” Also, the PIPE investors are  primarily insurance companies known for long term hold strategies and  they are closely associated with Bill Foley. As Foley recently said,  “Having a large PIPE basically validates the transaction.… The companies  that I’m affiliated with actually invested roughly a billion dollars in  the PIPE and forward purchase agreements so Paysafe was always a really  protected asset, besides the fact that it’s a great asset.”", "score": 2, "replies": []}]}]}]}]}, {"body": "Just bought a few dozen shares. Not much, but I'm not working with a large portfolio", "score": 5, "replies": []}, {"body": "Act like the selloff was a big short on WSB and it'll hit 300", "score": 6, "replies": []}, {"body": "Can you still buy PSFE warrants?", "score": 4, "replies": [{"body": "Yes, PSFEWS (on most brokers). Warrants are a great play here in my opinion. I have 10k of them in addition to my commons.", "score": 4, "replies": [{"body": "Just used my last dry powder for RSVAW😂 thx anyway... didnt know how warrants work post ticker change...", "score": 2, "replies": []}]}, {"body": "What are those?", "score": 1, "replies": [{"body": "call options on 11.5 wiht 5y maturity. But they can be called away by company...", "score": 3, "replies": [{"body": "When you say \"called away\" does that mean they do a cashless transaction and convert your warrants to shares or fractions?", "score": 1, "replies": []}]}]}]}, {"body": "1 x Bill Foley", "score": 5, "replies": []}, {"body": "Fantastic stuff", "score": 5, "replies": []}, {"body": "By the way, I suggest you cross post this over to wallstreetbets if you want a little more traffic and exposure. Have not seen anything posted over there on PSFE, which is shocking considering it has all the hallmarks of a great tech play with meme potential. Would love to see it start to get a little more mainstream traction! Those guys over there are idiots, but I’ll be damned if they don’t do a good job spreading the word out.", "score": 4, "replies": [{"body": "Nevermind it just went through lol", "score": 3, "replies": [{"body": "Nice! Just saw it.", "score": 1, "replies": []}]}]}, {"body": "My first spac that went public. ouchy  ouch first day ;(\n\nbut Looking good +3% pre market\n\nI'm holding long term\n\nVery Surprised how little financial institutions it was shown on first day.", "score": 3, "replies": []}, {"body": "How we think it does next week?", "score": 3, "replies": [{"body": "I think it’s going to start it’s uptrend now", "score": 9, "replies": []}]}, {"body": "Interesting! Are you going to do a full DD on it at some point?", "score": 6, "replies": [{"body": "Doubt it, they posted cause it is being sold off and their bags are getting heavy.", "score": -16, "replies": [{"body": "I’m holding this for years I’m not worried about my $2 a share bag right now", "score": 11, "replies": [{"body": "Your comment history from spacs makes that sound unlikely, but if you do then good on you. Long term PSFE might be good, but right now it's selling off so I'm not suprised you're holding.", "score": -5, "replies": []}]}]}]}, {"body": "PE ratios won't stay this high forever. Be careful out there", "score": 2, "replies": []}, {"body": "It's being sold off right now.", "score": -6, "replies": []}, {"body": "Okay so why in the blue hell did we hit low 13s today", "score": -6, "replies": []}, {"body": "[deleted]", "score": -23, "replies": [{"body": "Yeah, shady companies like Draftkings, Roblox, Spotify, eToro,  Fortnight, Coinbase, Amazon,  Twitch, EA, ApplePay, Youtube, Visa, Microsoft, Xbox, Amelco,  PayLease, ESL Gaming,  Luckbox, Lotto", "score": 20, "replies": [{"body": "[deleted]", "score": -8, "replies": [{"body": "Really? Small subsidiary like XBox?  Why so negative?\n\nPaysafe enables online cash payments for Microsoft customers\n\n[https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-enables-online-cash-payments-for-microsoft-customers/](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-enables-online-cash-payments-for-microsoft-customers/)\n\nMicrosoft will offer paysafecard as a payment option in Microsoft Store in 22 countries\n\n[https://mspoweruser.com/microsoft-paysafecard-payment-option/](https://mspoweruser.com/microsoft-paysafecard-payment-option/)\n\nTop up your amazon account with Paysafe\n\n[https://www.paysafecash.com/en-gb/landingpages/pay-cash-amazon/](https://www.paysafecash.com/en-gb/landingpages/pay-cash-amazon/)", "score": 9, "replies": []}]}]}, {"body": "like draftkings and twitch?", "score": 7, "replies": [{"body": "[deleted]", "score": -8, "replies": [{"body": "Yeah no doubt anecdotal:\n\nPaysafe provides new payment options for DraftKings in Europe\n\n[https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-provides-new-payment-options-for-draftkings-in-europe/](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-provides-new-payment-options-for-draftkings-in-europe/)", "score": 9, "replies": []}, {"body": "It's an international company.\n\nEvery scammy site also accepts visa and mastercard. Doesn't make them bad companies to invest in as long as good companies use them too, which PSFE has an abundance of.", "score": 3, "replies": []}]}]}]}, {"body": "Any thoughts on why it sold off today? Growth stocks had a good day too, but psfe couldn’t catch a bid.", "score": 1, "replies": [{"body": "Very common for SPACs to have terrible days when they change tickers. I’m not exactly sure what causes it but I definitely think many brokerages not letting you trade it on day 1 is a big factor", "score": 5, "replies": [{"body": "The symbol change mainly impacted retail traders, not institutional money. \n\nAh well, hope this dip weeded out the weak hands.", "score": 3, "replies": []}]}, {"body": "I’d wait until lockout period is over. 90 days, I think.", "score": 1, "replies": [{"body": "If it drops below $13 it's a decent opportunity to buy.", "score": 2, "replies": []}]}, {"body": "Most likely because I’m holding. Sorry folks!", "score": 1, "replies": []}, {"body": "There were a lot of reports of brokers suddenly changing margin requirements without prior notice (25% to 100%) which forced people to sell.", "score": 1, "replies": []}]}, {"body": "There is a little confusion right now as to whether or not the PIPE and private equity are unlocked.  Do you have any insight on that?", "score": 1, "replies": [{"body": "The Pipe is locked for the shorter of 270 days or 150 days if trades above $12 for 20 days in a 30 day period. So minimum 150 days I believe but don’t quote me because their wording isn’t exactly crystal clear in that document", "score": 4, "replies": [{"body": "https://twitter.com/mrdarkghost/status/1377297106390589441?s=21\n\nThanks for the reply and for your DD. Paysafe is my second largest position. Today was frustrating to say the least.", "score": 5, "replies": []}]}]}, {"body": "Trying to buy some during Pre-Market and my order won't get filled lol. Annoying af", "score": 1, "replies": []}, {"body": "Checking in with 500 @ 14.39. Also 250 PLTR @ 31. That's all the cash and margin I have. These 2 damn companies have made me a \"long term investor (aka bag holder). Down 70% ytd.", "score": 1, "replies": []}, {"body": ".................. I hate you", "score": 1, "replies": []}]}
{"title": "BB BlackBerry earnings/call were actually bullish ✅", "selftext": "I see **many** paper-handed individuals dumping their shares for cheap because OMG BB has missed its revenue expectations for Q4. *(for reference $8.50 -8.7% 31st March 2021)*\n\nCan we please dig a little bit deeper? Thank you.\n\n*During the quarter BlackBerry entered into an exclusive negotiation with a North American entity for the potential sale of part of the patent portfolio relating primarily to **mobile devices, messaging and wireless networking.** The Company has limited its patent monetization activities due to the ongoing negotiations. If the Company had not been in negotiations during the quarter, we believe that Licensing revenue would have been higher.*\n\n**Boom** pure and simple explanation for why the revenue missed. It’s not on weaker demand. It’s only because they are about to sell their side business and consequently they had to significantly cut that stream of revenue. Which also means that negotiations are advanced.\n\n**What will happen then they sell?** they will receive a big fat cheque (don’t quote me on this but I imagine north of $500m if not a billion+ ; pure speculation) + according to the CEO they will collect royalties for 7 years. And they get to focus on their core businesses: cybersecurity, EV software, internet of things.\n\nIs this good strategy-wise? Absolutely. Focus on your top projects with higher gross margins. Let go of the past and embrace the future. \n\n**any analyst reaction? Yes indeed Canaccord upgraded the stock to Hold** from Sell this morning.\n\n**Canaccord sees 'building blocks coming together'**\n\n*Seeing the business \"turning the corner towards stronger trends”. The firm notes BB's weaker than expected Q4 results driven by licensing headwinds due to sales negotiations for part of its mobile patent portfolio.*\n\n*Canaccord says BlackBerry management has \"created a cogent long-term strategy,\" but the firm is on the sidelines waiting for more evidence of product roadmap execution and emerging cross-selling opportunities.*\n\n*The firm says a deal to sell the licensing business would \"unlock value and provide a capital infusion to drive accelerated software and services growth.\"*\n\nSo even boomers traditionally late to the technology party are starting to see the whole BlackBerry’s strategy aligning. But these guys stay on the sideline because they don’t like early tendies. They lack the vision to say it’s an actual Buy especially at these levels. They will probably wait that a bigger broker moves first. And they will. \n\n**a quick look at the numbers** BlackBerry has a $5bn market cap with $1bn+ yearly revenue and $800m in cash. I imagine investors can put 2 and 2 together. What do you think will happen to their balance sheet when they cash in the incoming sale of their portfolio. Way more cash to execute their plans and potential M&A if needed and no need for new shares issuance as confirmed by the CEO (no dilution in sight ; enough money in the bank). We could be in the coming weeks in a situation where BB has in cash the equivalent of 25%+ of their market cap...\n\n**how about their core strategy?** \n*QNX now has design wins with 23 of the world's top 25 electric vehicle OEMs and remains on course to return to a normal revenue run rate by mid-fiscal 2022. BlackBerry IVY also made encouraging progress, with positive engagement from a number of leading automakers and the launch of our BlackBerry IVY Innovation Fund.* \n\nIn just one quarter they added 4 more EV OEMs with QNX (from 19 to 23 now). \n\nThey are well positioned to be involved in autonomous driving: *BlackBerry expands its partnership with Baidu to power next generation autonomous driving technology.* and *BlackBerry QNX Black Channel Communications to be used in Motional's driverless platform.* These are weeks-old news but it’s funny how it seems to go under the radar when it comes to price the company. Correct me if I’m wrong but Baidu could be the first and/or major player in autonomous driving in Asia. \n\nQNX is still in SpaceX rockets. And I start to hear rumors that Tesla could consider using it too (very speculative but at least you’ve heard it).\n\nAnd for the people who have ended up here randomly BlackBerry [IVY](https://blackberry.qnx.com/en/aws) is a joint venture with Amazon AWS for intelligent vehicle data platform. When the IVY deal was released BB shot past $9. AWS boss/founder at the time is now Amazon CEO. \n\nSo yea the revenue has missed by a few millions for an one-off reason. Have the fundamentals changed? Actually yes they have improved as they are well on track to pursue their strategic goals.\n\nThe question you should ask yourself is whether you are pricing BlackBerry based on their FY2020 or on what they are about to become? (hint: strong presence in EV software worldwide + autonomous driving + efficient cybersecurity product)\n\nBefore you ask me in the comments: shares are safe, calls good luck timing them although I probably bought more June calls together with some shares (don’t do this at home ; go cash gang ; save your money). Disclosure: long shares and June 20C.\n\n*Definitely not a recommendation to buy, hold, sell any security. Besides I have no knowledge in IoT, programming, software etc. I can only read.*\n\n**TLDR** why are you selling BB? if that’s because the revenue has slightly missed because they are selling a big chunk of their unneeded business for big money then you should ask yourself why you are in this ship in the first place. Even boomers analysts upgraded the stock this morning: they are starting to see BlackBerry business model happening.\n\nBonus: when will the sale happen? 🔮 crystal ball said before the next ER so in a few weeks (totally random and speculative).", "id": "mhhxq0", "created_utc": 1617231453.0, "score": 320, "upvote_ratio": 0.87, "num_comments": 94, "comments": [{"body": "Fuck it, I'll take any confirmation bias", "score": 79, "replies": [{"body": "can you pass some CB this way??", "score": 8, "replies": []}]}, {"body": "BB holder here, my only concern is how they plan on monetizing QNX/IVY.. we’ve heard no plans on the business model of IVY", "score": 16, "replies": [{"body": "Everyone thought mobile apps were dumb and the app store was a joke. Joke was on them. Same will be with the vehicular app ecosystem if it is nurtured wisely (e.g. the Innovation fund)", "score": 12, "replies": []}, {"body": "Its subscription based, as claimed from numerous webinars that happened in the past couple months.", "score": 3, "replies": [{"body": "Not QNX, it's a single fee for each device.", "score": 1, "replies": [{"body": "I'm talking about ivy only", "score": 1, "replies": []}]}]}, {"body": "agreed. I think it might be coming sooner rather than later though, since we were anticipating a beta version of Ivy early next year and it now appears that they're ready to roll it out in Feb 22. So now that they are confident of the product, I would think a monetization strategy can be finalized and published.", "score": 1, "replies": []}]}, {"body": "I agree the market was just looking for a reason to take a shot at BB and lower it. Wouldn’t be surprised to see institutional ownership increase by next quarters reports.", "score": 57, "replies": []}, {"body": "So much negativity here. What's wrong with you people? OP presented a decent opinion with facts explaining why he thinks what he thinks. If you disagree, move on instead of replying with \"lol bagholders\", or provide a legitimate rebuttal.\n\nDisclosure: I got in BB pre-peak but still higher than I'd like, but this was a play till end of 2022 before I reevaluated. Am I salty that my CB is high? Yes. Am I salty I got into BB in the first place? Absolutely not. I'm looking at this as a tech growth play and it can be risky, but it also has the ability to skyrocket within 3 years.", "score": 129, "replies": [{"body": "I am only salty the options game is weakening. I don't mind holding... I mind not making much off of it while I hold it...", "score": 18, "replies": [{"body": "Good point, I just got into options for this same purpose. Since I'm holding anyway, I was going to sell weekly calls just to lower CB.\n\nI have to make sure that the brokerage allows naked calls though, since my shares are held in a different brokerage that doesn't support options trading.", "score": 5, "replies": []}]}, {"body": "I think people are salty because there was a huge pump and dump and they got caught at the high and that is understandable.  I’m at around 12 I thought the stock had stabilized then continued to fall.  I’ll hold if they can deliver revenue growth if not I’m not holding for the hell of it.  It’s alittle concerning but I’ll hold through next earnings.  This deal should settle and the chip shortage should be in the past by then.  Time will tell", "score": 3, "replies": [{"body": "So the question is why did people buy in the first place. If the theory was future growth, nothing has changed. Would have been nice to have more shares for your money, but you should still be able to walk away with profits.", "score": 10, "replies": [{"body": "The problem was the growth wasn’t there, it went down if anything", "score": 2, "replies": [{"body": "According to the numbers, absolutely.\n\nAre you banking on current growth (from their security stuff for instance), or potential FUTURE growth (from IVY)? I am in the latter, I think IVY is where it's at, and is primarily why I invested. But like I said, it would have been nice to have gotten in at a lower cost since I'd have more shares for the money. Too late now, I can only average down or just hold and wait till this plays out.", "score": 5, "replies": []}]}]}]}]}, {"body": "Upvoted for early April Fools joke.", "score": 67, "replies": []}, {"body": "pov: you're holding the bag", "score": 99, "replies": [{"body": "I might lose on calls but my average is so low on the shares that I should be fine and end up with a good profit 😄", "score": 39, "replies": [{"body": "you can't book profit if you don't sell...", "score": 13, "replies": []}]}]}, {"body": "Uh isnt it actually bad that qnx is already in most of the big auto producers? If they barely make any money off of it now, how much more can it grow?", "score": 5, "replies": []}, {"body": "Psyop:  make everyone think it's bearish", "score": 3, "replies": []}, {"body": "Can we also suggest that its a Canadian company WITH usd options?", "score": 3, "replies": []}, {"body": "Look at all the coping", "score": 14, "replies": []}, {"body": "APRIL FOOLS!", "score": 6, "replies": []}, {"body": "My biggest concern is why they aren’t generating more revenue from cybersecurity.\n\nWhat are your thoughts there?", "score": 2, "replies": [{"body": "1. Building a strong portfolio of cybersecurity software and that includes external growth through acquisitions \n\n2. Penetrating the market and increasing market share (same process about QNX)\n\n3. Monetization (same process when customers jump from QNX to IVY - which btw will come sooner than expected)", "score": 1, "replies": [{"body": "Don’t they have existing products? Why haven’t they added clients, especially given COVID tech acceleration and Crowdstrike fumbles.\n\nYou think they have a sales team issue!", "score": 1, "replies": [{"body": "Again. $1bn+ yearly revenue for a $5bn mkt company. And they are just at the starting phase. \n\nMain product is developed together with Amazon.\n\nThey are about to sit on near $2bn in cash.", "score": 3, "replies": [{"body": "Weird that you’re not answering a simple question...\n\nNot a big deal but for someone that had so many answers to not have a theory for WHY the cyber security side is less than...\n\nIVY isn’t their Main product? It didn’t even exist 6 months ago. It won’t generate revenue till 2023.", "score": 2, "replies": [{"body": "Are you kidding me??? Look at the number of comments and questions I get over 2 subs. I’ve replied to you **more than enough**. Now move on with your life and do your own research.", "score": 1, "replies": [{"body": "It’s be better to not respond at all to any of my questions rather than copying and pasting some irrelevant answer.\n\nOr even better: “I don’t know why the Cylance acquisition hasn’t produced immediate boosts in revenue as many expected. What do you think.”\n\nI’ve done my research. I’m long on BB. I still ask questions when numbers don’t land where I thought they were going to. I sometimes ask other people. Sorry I made you feel the need to get defensive. It was strange to ask a question to someone presenting themselves as qualified to publish a bull case and have them give a non-answer to a polite basic question.\n\nGeez...\n\nHave a great holiday weekend...", "score": 1, "replies": [{"body": "You are a very dishonest Redditor.\n\n1. I have formulated my own answers.\n\n2. You have edited some of your replies.\n\n3. Your behavior is a waste of time on top of being toxic.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Do we really need daily posts on B B", "score": 12, "replies": [{"body": "[deleted]", "score": 39, "replies": [{"body": "Thanks 😊", "score": 3, "replies": []}]}, {"body": "Yes", "score": 39, "replies": []}]}, {"body": "Got it. Red it is.", "score": 5, "replies": []}, {"body": "Well the market doesn’t agree with you", "score": -6, "replies": [{"body": "give it some time", "score": 35, "replies": [{"body": "GME tanked the day after quarter reports came in, give it a few days. Don’t be too worried, those who still believe in the company will come back, and the fomo’s too. \n\nI have a few BB and it’ll bounce. \n\nPatience is worth it in the long run, and if your calls are close, sell them and try to make a profit, if you have time hold them, but don’t wait too long or you’ll lose value. \n\nGood luck and best.", "score": 18, "replies": [{"body": "I wrote in the OP June 20C. Some time but far OTM but hey let’s see what happens when the sale is confirmed.", "score": 4, "replies": []}, {"body": "GME got shorted on earnings call. It missed EPS by 1 cent, while reporting 175% increase in online sales. Fun thing is that media outlets ofc focused on Gamestop missing expectations. Such a shitshow", "score": 2, "replies": []}]}]}, {"body": "bad earnings does not a company make.\n\nYou either believe they are on track to great development and believe in long term or you shouldnt even be in this stock AT ALL. Staying in BB for the short term is just plain ridiculous, except if you are just gambling perhaps.", "score": 4, "replies": []}, {"body": "Yes, in fact this is the reason he made the post lmao", "score": 1, "replies": []}]}, {"body": "Proper shill from bag holder incoming... oh wait", "score": -4, "replies": []}, {"body": "This post is straight up delusional", "score": -5, "replies": []}, {"body": "Stages of grief can be rough. Current stage, denial. Sorry for your loss", "score": -7, "replies": [{"body": "The internet is so short-sighted", "score": 10, "replies": []}]}, {"body": "Ah, nothing like some good ole wsb \"paper handing\" bullying language to sucker some people into a pump and dump right? SMH.", "score": -3, "replies": [{"body": "Clicked your profile >> most active sub= WSB. Can’t be bothered.", "score": 6, "replies": [{"body": "You're aware that's not what that means right? Those also display in order of popularity of the sub... I got in wsb for just a couple of days to see what the craze was about before I decided it wasn't for me. You should know, it shows up first for you as well. So with that logic...", "score": 2, "replies": [{"body": "because I am indeed mainly active in SPACs and WSB. And proud.", "score": 1, "replies": []}]}]}]}, {"body": "Earnings expectations are supposed to be a soft lob so companies can look good, it's not a good signal when a company misses like that", "score": -16, "replies": [{"body": "After reading your comment I am really left wondering whether you read the OP or not. \n\nI have explained the simple reason for the miss.\n\nCanaccord has explained the simple reason for the miss on their own terms and subsequently upgraded the stock. \n\nMaybe you are trolling me or testing me or else you have no idea what you are talking about. I will just try to move on.\n\n😥", "score": 11, "replies": [{"body": "Ok just realize this thing is going to $6, hope you keep your faith.", "score": -28, "replies": [{"body": "It’s a little unrelated. I was discussing/highlighting why the revenue has missed on an one-off factor.", "score": 8, "replies": []}, {"body": "If it goes to 6 im buying all the shares. All of them.", "score": 7, "replies": []}]}]}]}, {"body": "[deleted]", "score": -25, "replies": [{"body": "How new are you? Earnings nearly always cause a dip no matter the company", "score": 22, "replies": [{"body": "Yeah earnings are really weird... So many earnings I've seen that are amazing reports and the stock tanks.  And then visa versa many times as well.", "score": 9, "replies": [{"body": "Many such cases!", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -9, "replies": [{"body": "Yeah ima just guess you're new since you're acting like you know it all.", "score": 12, "replies": []}, {"body": "You seem very new", "score": 2, "replies": []}]}]}, {"body": "It's my opinion that stock price often dips unless earnings are thoroughly smashed. I think the drop in IV effects market sentiment the same way it does option prices.", "score": 2, "replies": []}, {"body": "by your logic why did the analyst upgraded the stock this morning?", "score": 3, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "One could argue that market is always wrong. That’s why prices move all the time.\n\nAlso taking this occasion to end this conversation.", "score": 2, "replies": [{"body": "I read the whole post.  It's not killing me to hold my BB, but I don't buy a stock unless I like it and go long.  If folks are adverse to BB, just move on to something else.", "score": 3, "replies": []}]}]}]}]}, {"body": "HAHAHAHAHAHAHAHHAAH 300 MILLION LOSS and you pumpers still dont want to give it a break?", "score": -3, "replies": []}, {"body": " No offense, but you can view anything as “bullish” or “bearish”. Glass half empty/half full situation", "score": -12, "replies": [{"body": "Mind blown!\n\n/s", "score": 1, "replies": []}]}, {"body": "earnings had nothing to do with its downtrend, it started 13 days ago and bearish trend confirmed when it broke below 11.25.", "score": -24, "replies": [{"body": "ok... 👀", "score": 5, "replies": []}, {"body": "I say the real resistance was more around 10, but don't try and teach these fools technical analysis they won't get it", "score": -16, "replies": [{"body": "I saw 10 as final support, most of reddit would rather bet on DD than use tech analysis to help them minimize losses, that's the only thing these fools can control yet they don't/refuse to.", "score": -14, "replies": [{"body": "TA barely matters when it's a long term investment lol.... Any amateur investor should know this.", "score": 10, "replies": [{"body": "you can literally accumulate the stock if you use TA, but most amateur investors wouldn't know how to apply that tactical plan.", "score": -6, "replies": [{"body": "Are you even aware that zero professional uses TA? \n\nThat’s not even a thing in IB/HF.\n\nThat’s not even taught at school. It’s just a hobby for retail investors who have low/none financial education. \n\nAlthough I slightly exaggerate because it has *some* value on very liquid futures such as ES and FESX but how would you even know as an amateur?", "score": 6, "replies": [{"body": "\n\nare you aware of all daily trading in institutions of all sizes are algo based which all involves price action, patterns and technical analysis. I worked for one of those institutions and trading and long positions are all done automated.", "score": -2, "replies": [{"body": "No you did not.", "score": 7, "replies": [{"body": "keep believing you actually have an edge", "score": -1, "replies": []}]}]}]}]}]}, {"body": "What indicators u use to find the support and resistance?\nWhere is the next support level now?", "score": 1, "replies": [{"body": "the only indicator that matters is price - that's the leading indicator vs all indicators. \n\nwhen you're looking at a chart, look left and see where price has been. BB specifically has had multi year resistance at 12.50 on monthly basis since 2013, it's no accident that it keeps on getting rejected there recently.", "score": 0, "replies": []}]}]}]}, {"body": "It’s almost as if there was an earnings whisper!", "score": 1, "replies": [{"body": "someone always knows ahead of everyone else.", "score": 1, "replies": []}]}]}, {"body": "I needed this. Thanks", "score": 1, "replies": []}, {"body": "My poor ass got 5 shares that I’m holding", "score": 1, "replies": []}, {"body": "I bought at the $8.50.  Looking forward 'till next week!", "score": 1, "replies": []}, {"body": "I bought some more. Bullish long term. I can hold as long as it takes. 10, 20, 30 years. Doesnt matter.", "score": 1, "replies": []}, {"body": "Hope you're still holding it'll b $4 by the end of the year", "score": 1, "replies": []}]}
