{"title": "Past S&P 500 chart tells a different story then the narrative that we hear today", "selftext": "I know there are some people here that have been around (investing) a lot longer than I have. I have only been heavily following the stock market since 2008. In the last 10 or so years I have constantly heard the narrative \"stocks only go up.\" I have people around me that pull up the 10 year S&P 500 chart to prove how it is a no brainer to leave your money in the stock market. The media continually tells you active traders fail and index funds are a much better bet. The problem I see is that those statistics are all within the last 10 years typically. I also would like to point out that in the past there have been ACTUAL bear markets where your money did not move like it has in the last 10 years. Here are some interesting time spans going from the dot com bubble (yes I know how unique the dot com bubble was) to the following 12 years:\n\n1/1/2000 to 1/1/2007 - $10,000 became $10,782.77 - Roughly 1% annual return over 7 years\n\n1/1/2007 to 1/1/2012 - $10,000 became $9,912.96 - Roughly -.1% annual return over 5 years\n\nHad you \"bought and held\" from 1/1/2000 to 1/1/2012 your .5% annual return would have left a bit to be desired.\n\nHere is another interesting one. Let's say you bought at the bottom of the dot com bust in 2003 only to watch it all go away in 2009.\n\n1/1/2003 to 1/1/2009 - $10,000 became $10,483.04 - Roughly .75% annual return in 6 years.\n\nI realize those are some \"worst case\" scenarios but we don't even realize this as a possibility in \"investment circles\" today. Anyone talking about stocks and investments reference the last 10 years and it is always something positive (or flat). Maybe you have the people who pulled out at the bottom of the covid plunge but most people were wired to \"ride it out\" already and had a fairly large savings account. 401k plans didn't empty out like they thought it would. Today it is just a matter of \"when\" the stock price increases not a matter of \"if\" the stock price increases. Some will argue if you \"bought an held\" from 1/1/2000 to 1/1/2021 you would have $35,714.74 dollars. A roughly 6 percent yearly return. Though I would argue if you had bought in 2012 you would have same the returns as the guy who started investing in the 99-00s. This makes those 10 year investors extra bullish. It actually looks like this:\n\n1/1/2012 to 1/1/2021 - $10,000 became $33,412.88 - Roughly 14% annual return over 9 years\n\nMy point is that humans forget very quickly. The people who have gotten involved in the stock market in the last 10 years have had a completely different perspective. They have seen double digit returns and never experienced a year over year loss of any real significance (2018 is about as bad as it got at a 4% loss). The traders that just set up an account in the last 12 months are even more jaded. The stock market recovered from a total shut down of the economy to provide a 17% gain on the S&P for the year of 2020.\n\nIf you are with me this far hoping for some interesting conclusion I don't have one. I don't know what the future brings. Timing the market is impossible. I am not saying we are doomed. I do think we are incredibly dependent and aware of the stock market moves nowadays. A year or two of actually bleeding losses in a bear market would be more devastating than it was in the past. Having all your losses occur in 60 days (Covid Crash) is not the same as buying dip after dip for 24 months only to have it move down further a week later. After 2020 people may even believe that if the stock market were to crash the government will always fix it. Even 2008 set the stage for that.\n\nI will say a big help to the stock market is every retail investor that has come into the market in the last few years. More money in makes prices go up whether the company is worth more or not. Though those retail investors will leave a lot quicker than the retirement plans that typically made up the common persons stock market dollars in the past.\n\nTL;DR Stocks don't always go up. Even if you wait an entire year.  \n\n\nEdit: Yes given enough time stocks will go up. Inflation alone increases the dollar valuation of a company. This post is intended for those getting into the market over the last year or even couple of years. Believing that you will have the returns you have seen the last couple of years is not a good picture of the long term market. Even if you were in an index like the S&P 500. You may check your balance in 2024 and see the same balance you see today.", "id": "m3neuu", "created_utc": 1615572643.0, "score": 60, "upvote_ratio": 0.79, "num_comments": 95, "comments": [{"body": "I became an adivsor in  1982 so I've been around for  a while.  My perspective comes from the Dow's close on  my first day....1005.\n\nWhen I joined the business, there were old  guys there that described what the 73-74 bear market was like.    They would come to  work and bet on how much the market would  fall that day.  There were no bets on it possibly going up.\n\nGetting in the business 8 years after that, it  was sometimes a struggle to get clients and to get them to invest.  They remember the 73-74 market.  But as time went on, it became easier as memories of that  bear market began to fade.  We talked about an 8% historical annual return on the Dow/S&P.\n\nThen came the 1987 crass where the market fell 22% in one day on October 19, 1987.  It never saw that low again afterwards.\n\nAs time when on the markets dutifully churned out 8% returns on average.  Then came the  Asian Contagion in the 1990's. \n\nBut by the late 1990's, the dot com bubble began to form.  If you were  not making clients 20% per  year, you were spurned.  Of course that ended in 2000 and we fell to the 2003 lows.  Clients no longer expected 20% per year.  \n\nThen 2008 happened.  The market bottomed on March 9, 2008  But from  the high on the Dow in October 2007 at over 14,000 it fell to less than 6500.  It fell over 50%. It's also one thing to see it on  a chart and  another thing to live it for 18 months.\n\nThen the market recovered from  2009 until today.  With the Tech boom investors now think 20% per year is a waste of time.\n\nHaving lived all of these gyrations, I had to figure out a way to see the long term picture.  So after much effort, I came up with a simple moving average cross for the Long  Term Trend.  I wasn't  interested in predicting this sell off or the one  in March of 2020.  I wanted to see the long term trends.\n\nI use a moving average cross of the 220 day moving average over the 440 day. moving average.  As  there are on average 22 trading  days in a year, that works out roughly to a ten month over a 20 month moving average.  \n\nThis is for  long  term secular bull and  bear markets.  As with all moving average systems, you get a cross somewhat  after the fact, but to call turns in  the really long term, they work well enough.  We all know no one can call tops or bottoms, but this approach gets close enough.\n\nI use it to know if I am in a secular bull market or a secular bear market.  That does not mean we can't  have a cyclical bear during a secular bull market.   March 2020 was a cyclical bear market in the middle  of a secular bull market.  \n\nTry this for yourself.  Find a charting website that lets you look at 20 years or  more on the chart and  put the 220 day moving average on it along  with the 440 day moving average.  It doesn't really matter if you use simple moving averages or exponential moving averages.  \n\nIf you want to shorten or lengthen the moving averages, that works too.  But don't shorten them too much.\n\nTake a look, see what you think.  If you do this you will soon realize that yes, the market ALWAYS makes a new high after every correction.  It may take decades as it did after the Great Depression.  But as years have passed and communications have gotten faster (Ie. the internet) the time to recover has become shorter and shorter.\n\n\"Since 1792, when brokers gathered under a Buttonwood tree in lower manhattan, there has never been a sell off, correction, or  even crash that did not ultimately result in a new all time high in the market. The only question was how long it took.\"  (me)", "score": 68, "replies": [{"body": "This was a fun read. Thank you for sharing. I always believe the market will recover. As you said, it is just a matter of when. The main point of my original post was just stating that putting money in today may not turn into a 10% profit for years. The erroneous perception is that 8-10% a year is a minimum expectation. I like how you pointed out the dot com bubble when everyone expected a minimum of 20%. Sounds a lot like what we hear lately. I will put your moving averages on a chart and check it out.", "score": 12, "replies": []}, {"body": "> Try this for yourself. Find a charting website that lets you look at 20 years or more on the chart and put the 220 day moving average on it along with the 440 day moving average. It doesn't really matter if you use simple moving averages or exponential moving averages\n\nHey, very young and inexperienced investor here. So I don't get how this is useful. When I look at the S&P500 with 220 and 440 SMA the lines are very similar, and when the 220 does drop below the 440 SMA the price had already basically recovered at that point. Aren't the intersections supposed to indicate times to buy and sell?", "score": 2, "replies": [{"body": "Roughly you should see long term bull market from 1982 to 2002, bear from 2002 to 2013, and bull from 2013 to 2018 and bear from 2018 to 2020 and back in bull now.", "score": 3, "replies": []}, {"body": "When the 220 crosses up over the 440, you are in a bullish market and you buy.  When it crosses down you sell.\n\nIt may become clearer if you can do a m40 year chart that covers the 1980s", "score": 0, "replies": [{"body": "Can you post a screenshot of these crossing lines?", "score": 1, "replies": [{"body": "Images are not allowed on this reddit. \n\nGo see my website:  [DowGoldStrategy.com](https://DowGoldStrategy.com)\n\nThere are lots of charts and explanations.  It's all free.", "score": 4, "replies": []}, {"body": "I have a publicly viewable set of charts here\"\n\n https://stockcharts.com/public/1554954 \n\nYou may have to copy and paste the link to get it to work", "score": 1, "replies": []}, {"body": "Just go on Tradingview and look up SPX and put the indicators up yourself. Don't make someone else do this easy work for you.", "score": 1, "replies": []}]}]}]}]}, {"body": "Had you invested 1420$ in the SP500 RIGHT before the 2000 crash, today you would have almost tripled your money. And that's assuming you invested at one of the worst possible time in history. If you invested in 1995 instead, then its more like 6x your money.\n\n\nSo as long as you are there for the long run, there isn't much worry to have imo.\n\n\nAlso something people sometimes forget is that if you had invested right before the 2000 crash, you would probably have kept pumping in money once it crashed, therefore reducing your average price... :)", "score": 86, "replies": [{"body": "Even if you only invested right before the crashes and then held, you'd still be up: https://awealthofcommonsense.com/2014/02/worlds-worst-market-timer/", "score": 3, "replies": []}, {"body": "Yup I agree in general.\n\nHowever some companies never recover. Some still haven't recovered since 2000, and some failed.\n\nOf course for people who index they don't have to worry about that so much.", "score": 9, "replies": [{"body": "Well this OP was about the SP500 so i was referring to that.", "score": 30, "replies": []}, {"body": "It took the japanese stock market like 21 years to recover from the 2000's crash. \n\nTime in the market beats timing the markets is cool and all, but multiple decades just to get out of red doesnt attract mee too much", "score": 5, "replies": []}, {"body": "Well unless you live under a rock and don’t look into your account for years, those companies that underperform you can sell", "score": 5, "replies": [{"body": "Yes.\n\nHowever the mantra on reddit is that stocks only go up and will eventually recover if they dip.", "score": -2, "replies": [{"body": "Every time I’ve seen someone say stocks only go up it’s been an obvious joke", "score": 9, "replies": [{"body": "Erm, yes. But the general sentiment on here indeed, for most people, is that stocks only go up.\n\nLet's be honest, most people on here started last March/april.\n\nAnd almost everyone on here started post 2009. It's been a non stop party, why would people on here think otherwise?", "score": 1, "replies": []}]}]}]}]}, {"body": "Good point about the average price over time (putting money into the market). I was more so referring to the people who have entered the market in the last year or two. Their money could stay flat for the next 3 to 5 years and it wouldn't be \"unheard of.\" Also the returns people expect nowadays seem to be double digit at minimum. Thanks for your thoughts.", "score": 3, "replies": [{"body": "Also not factoring in dividends. For example, SPY even averages a 1.6% dividend yield.", "score": 12, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Honestly reddit has gotten really unreasonable expectations since the whole GME situation. I've seen people who got upset and thought they were bad at investing because they \"only\" got a 20% return on their portfolio last year. That's an incredibly good return in a year, more than double the 140-year market average.", "score": 5, "replies": [{"body": "That you can make 10-20%/year without really risking much with index funds is honestly a modern miracle.", "score": 2, "replies": []}]}, {"body": "> Savings accounts will be guaranteed to stay flat in that time\n\nBut they're guaranteed to not drop by half.", "score": 5, "replies": [{"body": "If it drops in half you add more simple.", "score": 1, "replies": []}]}, {"body": "“Not too unsurprising.”", "score": 2, "replies": []}]}]}]}, {"body": "Every decent investor knows about \"the lost decade\" and if you look at markets outside the U.S, like Japan, you can see similar scenarios. But the flaw in your analysis is that most investors don't just dump their money into an index fund on one day, at the exact peak of the market, and never invest again. That's just not typical. If you're investing on a regular basis, your returns will even out over time. \n\nSecondly, you don't account for dividends, which would provide added return even for those imaginary people who invested one time the day before one of the largest stock market crashes in history. Third, we're in a much different economic environment than back in 2000. The Fed interest rate was 6-7% in 2000. It's 0-0.25% now.\n\nStocks do not always go up. But historically the market does. Unless you're an incredibly special soul who invests once during the absolute worst moment and never invests again. Even then, you end up ahead.\n\nNo one is guaranteeing anything. Investing is a risk. But if you saw evidence that a blackjack table at a casino paid out 9 times out of 10, you'd put some chips in no?", "score": 63, "replies": [{"body": "This is the correct answer. Dollar cost averaging and portfolio rebalancing are key to successful investing.", "score": 26, "replies": []}, {"body": "Furthermore, this is why you diversify across countries. Sure, the US did terribly from 2000-2010, but Canada and emerging markets boomed. \n\nVT or VTI and VXUS and be done with it", "score": 12, "replies": []}, {"body": "The issue with your argument is that it assumes young people are the only people investing. That is far from the case. Twenty years is a long time. If you're in the market now at 20, sure, ride it out - you got time. But if you're in at 40, 20 years is retirement. \n\nThe recent bull market has people who are within a decade or two of their planned retirement counting on an income from stocks. They might think they're safe buying the index, but they're not. They might think they're safe buying \"value\" stocks like Johnson Johnson and CVS and Verizon, but they're not. Nearly all stocks dropped by an average of 50% or more during the crashes of 2000 and 2008 and did not recover until 5 to 10 years later. For most people, there's no back up because they've relied on FIRE calculations that are average rather than worst case.\n\nThis really has more to do with the sorry state of the US's social safety net, than anything else. Social security is in ruins. Pensions are a concept of the past. 401k relies on the market for inflation correction because bond yields are crap. More than half of Americans live from pay check to pay check. People are desperate for anything that'll give them solid returns.\n\nIt's a damned if you do, damned if you don't scenario - if you don't invest in the market, your savings aren't enough for you to live off of because of **** wages and high taxes. But if you do invest in the market, your retirement plans can be destroyed in one red moment. With an over heated property market, stocks are the last refuge of the American middle class. If it collapses like in 2000 or 2008, many, many people are going to have to work through retirement, but how long do you figure that can last? 65? 70? Who's going to hire a 70 year old?\n\nI hate to say it but I think we're about one or two big sustained market crashes away from the end of the US as we know it. Even if the economy keeps on growing, if 80% of Americans are faced with bankruptcy during retirement, this system is going to collapse.", "score": 7, "replies": [{"body": "Completely agree on the sorry state of the US social safety net. Social Security could be so easily fixed--or at least largely addressed--by raising the cap (maximum taxable amount) and reducing benefits for well-off retirees that don't need them. Meanwhile, we're all hostage to Wall Street.\n\nThat said, even if you have 20 years to retirement, now is not the time to go conservative. The experts say you should shift to bonds, cash, possibly fixed indexed annuities the closer you get to retirement, to protect yourself against a crash. I think that's right. The other thing you need to consider is that even if the market crashes right as you're retiring, you still probably have a decade or a few to live, so going completely out of the market isn't wise-- you'll still need retirement income. At 40, using the 120-your age rule of thumb, you should be 80% equity, 20% bonds. If you're more conservative, rule of thumb is 60-40. Again, its not like you're just investing before the crash and then stopping. If you add to positions over the next 20 years, you'll come out ahead.\n\nYes, the market could crash right before retirement, but if you've shifted to at least 60% bonds or more by that time, like you're supposed to, the impact will be muted.\n\nI don't share your pessimism about the end of the United States. I guess if that's your view, you really shouldn't be in stocks at all.", "score": 3, "replies": [{"body": "US is rotten but still shows... infinite potential.\n\nWho'd want to live 50 years ago? 40 years ago? 30?", "score": 1, "replies": [{"body": "30 years ago was a nice sweet spot actually. There were some good years there in the 90s.", "score": 3, "replies": [{"body": "We'll have to exclude Biggie Smalls for the sake of argument", "score": 2, "replies": []}]}]}]}]}, {"body": "Agree agree agree.\n\nBUT no period in history has seen such a one way direction of interest rates over the last 40 years.  Obviously that has affected market returns as things are simply priced much much higher for the same amount of earnings.  Given as you point out that we are near zero...we won’t replicate that.  So even if we stay at zero, future returns are probably pricing in a 4-6% overall return at most now.  Vastly different.  \n\nI do say this though as someone who is near fully invested and is not a bear, I just expect long term returns to be 5% or less average for 20 years because of this", "score": 2, "replies": []}]}, {"body": ">The media continually tells you active traders fail\n\nit's not just the media. academic research from all over the world tends to show that (a) day traders lose money more often than not; (b) most active traders/managers/stock-pickers will tend to underperform the averages; (d) momentum/growth investing tends to work for shorter periods of 2-4 years, but fails after that, and (d) value investing of some form or another will tend to out-perform the averages over long periods of 10+ years.  the data is absolutely overwhelming on these points. there is quibbling about some of the details but nobody seriously rejects these core ideas, not in the academic finance world or professional community of investors. Dimensional Fund Advisors, a top-10 US investing firm by size of assets, was founded by a bunch of University of Chicago grads to apply their findings about small cap stocks and value stocks; they were one of the earliest index fund companies and practice an index/value hybrid that's been extremely successful over the long-haul. \n\n> we don't even realize this as a possibility in \"investment circles\" today. Anyone talking about stocks and investments reference the last 10 years and it is always something positive (or flat).\n\nI don't know what sources you're watching, but long-term investors and anyone who studies this stuff seriously is aware that there have been periods of under-performance. for any 5 year period, the market increases about 90% of the time, and it's close to 97% for any 10 year periods. but there are exceptions, as you noted. the US market, as whole, was also negative from 1968 to 1982. but this was a dreamtime for serious value investors like Buffett and Walter Schloss. \n\nthe Japanse Nikkei index only recently recovered its high from 30 years ago, after a massive bubble.", "score": 9, "replies": [{"body": "The nikkei hasn't recovered yet and likely never will.", "score": 3, "replies": [{"body": "Japan been declining though. US isn’t.", "score": 2, "replies": []}]}, {"body": "Good feedback. Searching Dimensional Fund Advisors. \"Investment circles\" meaning those in their 20s or 30s that talk stocks. Not those who are actually in investments for a living. \n\nTodays investing strategies are setting many up for failure. This post was intended to speak to those that haven't looked back beyond 10 years.\n\nYou definitely have more knowledge on the topic then I do! Thank you for the info.", "score": 0, "replies": []}, {"body": "No argument on active trading drawbacks. Dimensional Funds makes me wonder about paradigm shifts over the last 40 years. Last time I looked they were falling short against benchmarks across nearly their entire fund lineup for every timeframe.", "score": 1, "replies": []}, {"body": "> (d) value investing of some form or another will tend to out-perform the averages over long periods of 10+ years\n\nI had not heard that before. I've always been told it's hard to beat the market over long periods of time. Not that I don't believe you but do you have a source?", "score": 1, "replies": []}]}, {"body": "There are other ways to make money in a flat or even bear market. To name a couple: premiums from the sale of options and dividends (for tickers who offer it). These are nice ways to either turn a loss into a profit or at least ride through the bumpy periods with reduced losses.", "score": 6, "replies": [{"body": "I completely agree and have been shifting my focus to this specifically for when that time comes. The \"wheel\" strategy in general is really neat.", "score": 2, "replies": []}, {"body": "I find swing trading easiest when the market is trading sideways. Pretty easy to buy low and sell high in that case.👼", "score": 1, "replies": []}]}, {"body": "I am a bear but this bubble is diffrent than the others because the government is the cause of the bubble, this does not mean this will end differently however, low intrest rates feul this bubble and as long as they don't rise I don't see it popping, I always say this but this is a japan style bubble not dot com or great depression style in my opinion.", "score": 10, "replies": [{"body": "If you got the time, give me the TL;DR version of the \"japan style bubble.\"\n\nI believe the fed has shot every bullet and is out of ammo. There really isn't a way to push stocks higher artificially any longer. It'll be up to the market.", "score": 1, "replies": [{"body": "What happened in Japan was they had a recession in 1985-1987 and the boj slashed rates, this caused a borrowing frenzy, people and corporations rushed out to get a loan and bought real estate and stocks, this went on for 5 years and the nikkei touched 40,000 and the imperial palace in Tokyo was worth as much as all of California, things got so expensive the boj was forced to raise intrest rates in order to pop the bubble, and it worked, the nikkei and Japan's real estate market have never recovered since 1990, now if we go through a similar burst we will most likely recover due to our high birth rate and imagration but we will most certainly have a burst, the fed and government can't alow asset prices to get so expensive so it prices out young people and imagrants so they will be forced to pop the bubble eventually.", "score": 8, "replies": [{"body": "1.Japanese yen isnt a world currency like usd 2. Accessibility to invest rn will always attract lots of retail investors into stocks, pushing them that way. Im not an expert but i doubt we will see a such crazy burst in the near future", "score": 2, "replies": [{"body": "You are right that the yen isn't a reserve currency but that will only help in the recovery it does absolutely zero for preventing the burst. And retail may have impacts on small stocks like gamestop but they have almost 0 impact on the broader market as a whole. I just don't know how people don't see a bubble when wages are stagnant yet house prices are soaring amd stocks are in an  insane volatility environment along side very pricey valuation.", "score": 1, "replies": [{"body": "Im pretty sure we will have a pretty good correction after covid bc there will be no reason for fed to pump it. But i doubt it will be a complete crash with a following recession lasting 1-2 years. I mean despite of covid many companies had their best year so far. But maybe its my dumb bullish opinion. (And house prices are falling in big cities so you could see it as a rotation on the house market)", "score": 1, "replies": [{"body": "House prices are really only falling in one place, new york, where I live in the bay area where there has been s supposed exodus house prices are going parabolic, Seattle as well. I know it seems unlikely for a crash ro happen but they always happen at the most bullish point, a false narrative is that bubbles pop when there is an economic crisis or some horrible event, but in actuality bubbles pop at by far the most bullish point in their cycle.", "score": 1, "replies": [{"body": "Prices within NY suburbs are going up. Manhattan seems to be affected the most.", "score": 1, "replies": []}]}]}, {"body": "If it’s by housing affordability, then US will have another historic bull run before it pops lol, Canada has far higher housing prices, basically every part of their country is very expensive and their real estate is still going very strong after 20 year bull run, Only drop is 3.6% in 2009 in Canada. US housing is actually relative chap compared to many major economies in the world. UK also had some of the worst recession and their housing prices is still going up and more unaffordable compared to US related to wages. Same goes for Australia, New Zealand, China. All even more explosive real estate market and have not popped yet.", "score": 1, "replies": []}]}]}, {"body": "Thank you. Great summary. The housing prices and free money are what makes me nervous at this moment. I agree with your comparison to that event but also agree that the US economy is a much different animal.", "score": 1, "replies": []}, {"body": "We don't have a nationwide real estate bubble, though, just a stock bubble, and household savings are way up at the same time.\n\nThe bubble pops, the real economy is fine. Very different than Japan. The bear is going to eat lots of pork, and smart traders will do well. Individual bubble stocks might not recover for a long time, but overall the bull will return fairly quickly.👼", "score": 1, "replies": [{"body": "I disagree I do think there is a nationwide housing bubble, just some areas like Florida, California, Seattle, teaxas and New York suburbs are more impacted than others, Tokyo was way worse than many other areas on the japan bubble, I agree that as of right now the bubble pop will not be damaging but the longer this goes on the more deadly the pop will be.", "score": 1, "replies": [{"body": "There isn't even an argument that we're in a bubble of the type Japan was in.\n\nCan you use the word bubble? Of course, if you think the word applies, use the word. But in context, there isn't any case to be made for it.", "score": 1, "replies": [{"body": "Of course we are no where near japan levels obviously, but if we do nothing then in time it will get there", "score": 2, "replies": [{"body": "Yeah, but we're only going to have low rates until the recovery is going good.\n\nBank of Japan tried to boost their real economy by using these techniques in normal times. That doesn't work, but nobody had really tried it so people made that case that it would work out, and it didn't.\n\nHere, the real economy is actually still pretty solid, and there is no desire at all to try to create a post-covid boom, the target is only normalcy. We also still have solid bond demand, even during all this spending, the openness and longterm stability of our economy puts us in a different situation.\n\nAnother difference is that in Japan, the government had a minimal willingness to force the losers to take their losses, they tried to prop everything up which extended the post-bubble recession. Here, strategic industries will get a bailout, and the market will be allowed to correct in a more natural way.", "score": 2, "replies": [{"body": "My fear is that the fed will be too scared ro raise rates and inevitable pop the bubble, look at 2018 when they raised rates a little and the stock market went on strike and they backed down, the longer the hold of the inevitable the worse it will be.", "score": 1, "replies": [{"body": "This administration doesn't care about the market, there is no ambiguity in that. They care about the real economy.", "score": 2, "replies": [{"body": "I think you're wrong. With everyone's 401Ks invested in the market, the government cannot afford the stock market to burst like nky did.", "score": 1, "replies": [{"body": "That's long term, it recovers, doesn't matter, nobody cares. And... \"like nky did\"? You're ignoring almost everything I said. That isn't in the cards when the bubble bursts. Look to past US bubbles for what happens here.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Just look up the inflation adjusted chart going back to the early 1900s https://www.wsj.com/articles/SB10001424052748703991304574621903850508632, you'll see that large drops do in fact have the capacity to erase essentially all previous gains. Only the last couple decades has the NYSE seen a greater tendency for continual gains with less impact by crashes, but even then you could expect a crash to potentially set you back up to 2 decades of growth. This change towards a bull trend is probably mostly due to a more protective government financial policy, essentially limitless government debt, and some influence of rising rates of reliance on investing in stocks along with a larger economy and population size.", "score": 3, "replies": []}, {"body": "First, fantastic write up. You deserve awards.\n\nSecond, I would cream my Jeans for a 3 year bear market. I would actually increase my yearly budget for investment and just continue buying my watch list", "score": 3, "replies": []}, {"body": "The sentiment about the stock market between now and say 10 years ago is night and day. In 2010, half of everyone wouldn't touch stocks with a 20ft pole. For the reason you pointed out, no gains in 10 years. But the people who DCAed from 2000-2010, we'll they're the ones cashing out and retired now.", "score": 2, "replies": []}, {"body": "The problem is we have never printed money like we are today. Do you think the spigots will stop? Then yeah stocks are in for a rough patch. I’m generally bearish, but I think our leaders care more about keeping the money flowing and stocks rising than inflation. At least for the foreseeable future", "score": 2, "replies": []}, {"body": "Doesn't mean we shouldn't take advantage of it while it's here. I've went from $1300 to $25K since December but am I quitting my day job? Absolutely the fuck not! 😂 I'm happy with any extra money I get to pay off a house and if the market becomes bearish then I'm done with it.", "score": 2, "replies": [{"body": "what did ypu invest in?", "score": 2, "replies": []}]}, {"body": "Stocks don't always go up except... They do. You just have to wait. Sometimes for ten years. If you're old, don't buy stocks. If you're young, no worries.", "score": 3, "replies": []}, {"body": "The world is completely different now.\nOnce to buy you had to call banks and do all on paper. Stocks were like for 1% of people.\n\nNow with apps like robinhood and etoro, investing is for everyone.\nThis is the only real reason of why the market has gone up 11 years in a row, and it can keep this uptrend basically as long as people join investing.\n\nDon't forget that stocks are the deepest true ponzi scheme. You make money only if people enter after you at a higher price and you make money only selling to those who have entered after and paid more than you.", "score": 3, "replies": [{"body": ">Don't forget that stocks are the deepest true ponzi scheme. You make money only if people enter after you at a higher price and you make money only selling to those who have entered after and paid more than you.\n\nI agree completely.  I also like to remind myself when a person buys a share they believe the price will go up while the sellers believe the price will go down (most of the time).\n\nYou are completely right. The more people putting money into the stock market the better it does. There really is no where else to go right now.", "score": 3, "replies": []}, {"body": "They are not a ponzi scheme lol.\n\nCan't vote on the board of directors on a fucking ponzi scheme.", "score": 1, "replies": [{"body": "? your vote count less than 0 if you are not a whale with tens of millions", "score": 1, "replies": [{"body": "Regardless it still counts in aggregate. And you have a legal claim to the assets if liquidated, although common comes in last.\n\nPonzi schemes don't pay profits to every participant either so dividend stocks of which there are thousands are nothing at all like a scheme. Costco is not a damn ponzi scheme lol", "score": 1, "replies": []}]}]}]}, {"body": "StOcKS onLY gO Up\n\nTeSLA tO tHe MoOn\n\nI OnLY InVeST iN TEch\n\nVaLUE InVeSTinG iS DeAd\n\nArK aRk ArK\n\nAunT CaTHie\n\nI hear these same things over and over and similar and honestly it's all very concerning. People who disagree or have contrary thoughts get downvoted to oblivion. The tesla and ark and tech worshippers on here is incredible.\n\nMeanwhile almost all of them have only been in the market for a year and think they know it all.\n\nI don't know what the future holds. Maybe they'll be fine. But history tells us at some point the party will stop, and retail basically always gets to hold the bag when it does.", "score": 6, "replies": [{"body": ">I hear these same things over and over and similar and honestly it's all very concerning. People who disagree or have contrary thoughts get downvoted to oblivion. The tesla and ark and tech worshippers on here is incredible.\n\n>Meanwhile almost all of them have only been in the market for a year and think they know it all.\n\n>I don't know what the future holds. Maybe they'll be fine. But history tells us at some point the party will stop, and retail basically always gets to hold the bag when it does.\n\nInvesting-related subs, specially r/Stocks and r/wallstreetbets, have become echo chambers since March 2020. It's basically a place where people gather to ask rhetorical questions that confirms their own confirmation bias. \n\nLike how many times people keep posting that TeCH is ThE FuTuRE! Tech has been the future literally since the beginning of humanity when Neandarthals made fire with 2 rocks. Tech was the future in the 1850s with something called the \"Industrial Revolution\" and the steam engine. Cramming 200+ people into a metalic cylinder and sending them from New York to London in less than 6 hours flying seems pretty techy to me. \"Disruptive technology\" is nothing new and has always underperformed traditional, obsolete industries, even when they are on decline.\n\nAnd don't even get me started on the conspiracy theorists and arm-chair economists that believe the Fed are the root cause of all problems and haven't even opened an Econ 101 textbook...", "score": 11, "replies": [{"body": ">And don't even get me started on the conspiracy theorists and arm-chair economists that believe the Fed are the root cause of all problems\n\nI have not found these people yet. I'd like to hear their argument.", "score": 1, "replies": [{"body": "Sounds like you need to brush up on new world orders, reptilians, illuminati, removal of fiat currency, etc.\n\nGood luck!", "score": 4, "replies": []}, {"body": "They're everywhere.\n\nBRrRrrR\n\nCPI iS WoRThLeSs mY bAnaNas nOw cOst $0.50 MoRe SinCe laSt WeEk!\n\nInFLaTiOn!\n\nAnd the list goes on.", "score": 2, "replies": []}]}, {"body": "Tech means information right now lol so what are you talking about", "score": 1, "replies": [{"body": "Tech has always been about information. Ever heard of telegraphy, telephones, or television? On July 20, 1969, NASA broadcasted the first moon landing to billions of people around the globe. Such feat was unthinkable in the prior decade. As a matter of fact, the first televised US presidential debate was on 1960 between John F. Kennedy and Richard Nixon. Telecommunication companies underperformed energy companies from the 1960s until 2000, despite cars being more fuel-efficient and Telecommunication increasing it's market share.", "score": 2, "replies": [{"body": "Well i dont know if you can see but people are merging their bodies with technology at a pretty fast pace in 5 years some of the devices wont be removable from peoples bodies its pretty clear where this is heading. Also cars and industry energy consumption is moving towards renewable energy its also pretty clear.", "score": 0, "replies": [{"body": "Haven't we had devices that can't be removed (pacemakers, etc) since like the 50s? Medical implants are nothing new.\n\nUnless you're claiming that we'll be merging with our smartphones in five years, in which case LOL no.", "score": 4, "replies": []}]}]}]}]}]}, {"body": "It's important to keep in mind that the S&P index is not static.  Investment analysts at Standard & Poor's Global are reallocating the mix, adding or subtracting securities, over time.  And so any short term performance you can point to is already reflected in the S&P as the more influential movers from the Industrial Age to the information age and beyond have been added or subtracted to the index.   The S&P returns are a function of the broader market, not the other way around... but their analysts have been proven shrewder than most over extremely long time horizons.\n\nI tend to recommend looking at time horizons of two decades or longer, preferably four... because that'll represent the majority of your working life and it'll take you through several adverse events.\n\nThe 50 year (1970-2020) CAGR of the S&P (10.76%) is almost the same as the 25 year (1995-2020) CAGR (10.54%) and stays above 10 percent if you keep adding on decades all the way back to 1930, or more than your expected lifetime.\n\nIf you look only at the tech sector thinking \"I can get 30-40-50% returns in a single year!\"  Well that's probably true... but you're going to find over time that without sector diversification you're also exposing yourself to significant downturns.\n\nThe main takeaways here are:\n\n1. Your chances of beating the S&P may be great in the near term (>= 10 yrs) but decline considerably in the long term.\n2. Normal, not excessive, rates of return compounded over long periods of time beat volatility in most cases because the likelihood of always calling the perfect trades, i.e. timing the market, is very low.\n3. If you cannot consistently beat the S&P CAGR, then it's perhaps time to either re-evaluate your portfolio strategy, asset mix, sector mix, etc., or just focus entirely on index funds.", "score": 1, "replies": [{"body": "On point 2, are you suggestign that over a long time horizon, say 100 years (so you have a nice average of rates), interest via a saving account is basically ON AVERAGE compunding as well as same-sized, same-time-horizon index fund ?", "score": 1, "replies": []}]}, {"body": "Can’t tell if people are telling you something dumb or you’re so dumb that when smart people talk your brain makes it stupid.", "score": 1, "replies": []}, {"body": "You can and should diversify out of S&P and american markets", "score": 1, "replies": []}, {"body": "Index funds are for continual investing. Two down years don't matter, you still buy a quilt of equity at a discount.\n\nSome p/es were at like 5 during these downturns. \n\nI don't index myself but I don't see anything wrong with it.", "score": 1, "replies": []}, {"body": "Zzzzzz.  The stock market is risky.  What else is new.  You can get hit by a car crossing the street or die in your sleep.  You get what the market giveth!", "score": 1, "replies": []}, {"body": "if you’re buying the exact ATH and then doing absolutely nothing to average down, for 10 years, what in the flying fuck are you doing. \n\nNow do the same thing but this time the guy who bought the top also does monthly contributions alllllll the way down and up from the bottom. \n\nHe still wins. Over almost any extended time frame you can imagine at any point in history.", "score": 1, "replies": []}, {"body": "You can cherry-pick dates all you like, but stretch that time out further and yes, you see that the market always goes up.", "score": 1, "replies": []}, {"body": "Fuck this turned me into a bear", "score": 1, "replies": []}]}
{"title": "For those who think “Oil is Dead”...RBC Capital Markets (& JPM, Goldman, Bank of America) Summer oil and gas forecasts \"most bullish in nearly a decade\"", "selftext": "", "id": "m37ll7", "created_utc": 1615516747.0, "score": 60, "upvote_ratio": 0.75, "num_comments": 95, "comments": [{"body": "I mean, it’s easy to be bullish when the nation with a monopoly says they’re going to do things that will drive up the price of oil.", "score": 37, "replies": [{"body": "Or you're OPEC and you just cut production anytime you need prices to go up, and then refuse to turn the tap back on when demand climbs again.", "score": 14, "replies": [{"body": "This. Even if we stop using oil for cars we will still use it for plastic though so bullish either way in my smooth brain opinion", "score": 10, "replies": []}]}]}, {"body": "Enbridge pays me more dividend than I pay them for gas bills, and I'm up 14%", "score": 15, "replies": [{"body": "They better leave that damn line 5 alone! I've leaked more on my undies after using a urinal than that line has leaked into the river. Also WTF, how do you say we need propane while also telling the suppliers of said propane that you want their supply to be cut off?", "score": 1, "replies": []}]}, {"body": "Everyone’s gunna wanna travel after being cooped up", "score": 12, "replies": []}, {"body": "$KOS🔥🤫", "score": 8, "replies": [{"body": "What are your thoughts on $KOS in the next month or so?", "score": 2, "replies": [{"body": "8-14$", "score": 3, "replies": [{"body": "Not bad at all", "score": 1, "replies": []}]}]}]}, {"body": "Loaded up on $VET in the $4-5. $NRGU @$83.", "score": 8, "replies": [{"body": "Wowzer NRGU now compared to pre-pandemic! \nBargain", "score": 2, "replies": [{"body": "Holy shit. I feel like that’s almost a too obvious play, shit is going to reopen and summer travel is going to be a huge thing..... NRGU looks like can’t go tits up play even at $175ish.... what am I missing", "score": 2, "replies": [{"body": "NOTHING...it's straight up 3x leverage of XOM, CVX, VLO, PXD, EOG, MPC, OXY, PSX, COP... 10% each. I was in it at like $3 post crash...Rode it to $6 on the glory day June 9..and then it was a long hard summer...Got out when it reverse split 1:20...got back in as soon as Diamond Joe was anointed winner. I knew they would drive oil through the roof. Shares at $83...Been gold since then.\n\nIt's also a GREAT day play...If it opens up it usually dips and then recovers so I you don't mind missing a few bets you can win big.\n\nThere is an opposite fund $NRGD that's the inverse I was flipping back and forth over the summer...don't touch it now.", "score": 2, "replies": [{"body": "Yeah I’m just annoyed I didn’t think of this one sooner lol. Going to do a little more homework but probably plunking some cash here in the next day or two", "score": 2, "replies": [{"body": "It likes to dump like 10% when oil futures dip after hours...Best bet is buy on a oil down day, about 15-20 min in when it finishes it's sell off...It's pretty damn predictable...Crude is red right now so if it's $NRGU is red pre-market  pop open a chart with the 10 underlying assets...watch what they are doing and plan your entry...", "score": 2, "replies": [{"body": "Much appreciated advice, seems like this makes for a great swing trade. Going to do some more DD on how nuts oil is going to get this summer.... hopefully this works out a little better than Tanker Gang\n\nI’ll look it up for myself tomorrow but I assume like most of the 3x leveraged ETFs that this rebalances nightly, i.e. not true options Thera decay per se, but your money will rot if you hold this for longer time periods?", "score": 2, "replies": [{"body": "Technically speaking yes but this is not trading sideways so you’re not losing anything to the mild fractional percentage decay because it’s just been so bullish. The price has doubled since early February. There is no amount of decay that is going to hurt those returns. With the way it’s performing right now I have no problem holding.", "score": 1, "replies": []}]}]}, {"body": "Buy $PAA", "score": 1, "replies": []}]}]}, {"body": "Buy $PAA", "score": 1, "replies": []}]}]}]}, {"body": "$4.00 per gallon by easter", "score": 6, "replies": [{"body": "I had July 4 for my state. CA is already $4.", "score": 2, "replies": []}]}, {"body": "I picked up some BP and SU a couple weeks ago in anticipation of warm weather + post-covid demand. Both are still trading below their pre-covid crash prices and I’m considering picking up more SU. \n\nSU should pay off when the earnings run up starts. \n\nBP is working through a rough patch. The covid losses hit them hard while they were pushing into renewables. They’re still recovering, but I’m bullish for a 6 month timeframe and felt they were still at a good discount. They also might turn out to be a good renewable play in another year or two.", "score": 6, "replies": [{"body": "Buy $PAA", "score": 1, "replies": []}]}, {"body": "There has been large under-investment in the oil and gas sector due to relatively low price over the last 6 years. We have enjoyed low gas prices thanks to the supply glut  caused by unconventional oil and gas wells (horizontals/ fracking). For some prospective the US was producing 6 million barrels per day (MMbbl/d) in 2010 and 13 MMbbl/d) by January 2020. Today we're around 10.5 MMbbl/d. US Oil production is unlikely to go back to 13Mbbl due to unconventionals not being economic, and that the shale sweet spots have been drilled up.\n\nOPEC is currently playing a game to re-balance the markets. They don't want oil prices too high or unconventionals will become economic thus adding oil to the market, but they don't want prices too low or they can't fund their governments. As global inventories draw down and demand increases OPEC will add more oil to the market until they're producing at full capacity. We should continue to see $50-$60 WTI in the near term. Once OPEC is at full capacity oil should go up significantly and we can all hate having to fill up at $4-$5/gallon.", "score": 5, "replies": []}, {"body": "Yes, let's believe in a bank that's deep in oil assets. I trust in this sub more than any manipulate banks.", "score": 12, "replies": [{"body": "No why not do some research instead of throwing away ideas that don’t affirm your own bias.", "score": -2, "replies": [{"body": "If you look at oil. It's the inverse of tech. Last month while investors were in the red, big oil and banks were green. Now since tech is up again. Oil will go straight down. Plus, I don't like polluting the planet.", "score": -6, "replies": [{"body": "Tech will go down. It’s trading well above the historic mean valuation for the sector. It’s not different this time...just because it’s your first bubble doesn’t make it different.\n\nWhen tech declines to reasonable valuations inline with the mean, I’m a buyer, but not until. In the meantime, if you’re not into value — you’re better off in cash.\n\nIf you don’t like oil — fine — you’ll miss out on a profitable trade, but tech is way too overpriced and no it’s not different this time.", "score": 10, "replies": []}, {"body": "Bro. If you drive, have synthetic clothing, have plastics in your home, heat your home and use electricity you are actively using oil to pollute the planet. I'm all for a greener future but too many people overlook just how much oil has accelerated the quality of our lives.", "score": 2, "replies": []}, {"body": "Lol you should thank oil for enabling you to live such a comfortable life", "score": 7, "replies": []}, {"body": "I’m in oil and I’ve been in the green all week", "score": 1, "replies": []}]}]}]}, {"body": "I have HAL and BP calls, and COP shares. Oil is the jam this summer.", "score": 4, "replies": [{"body": "Buy $PAA", "score": 1, "replies": []}]}, {"body": "No, oil is not dead. It's boomer shit but it's here for a long time. Asphalt? Yea, that's bottom of the barrel diesel (basically) plastic and so on. Govt is spending on infrastructure sooo yeah, oil will go up. It'll be a long time or never if we ever see $1.20 a gallon again. If every news source is pointing in the same direction and there is no other side of the story, something is up. Fur shirts.", "score": 9, "replies": [{"body": "I don’t care if it’s boomer shit or not...I just wanna make money. I’d rather be rich in oil than poor holding other popular shit.", "score": 9, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Reddit has a new paid team called **Anti-Evil Operations** which goes around permanently banning accounts for saying bad words. We made automod block them so you don't lose your account for saying a word and getting reported. It's not our rule, it's the entire website now, we're just trying to look out for our people. Sorry.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}, {"body": "It isn’t boomer shit. It’s up a lot more than tech this year. Shit. You’d have made several hundred percent since last year.", "score": 2, "replies": [{"body": "That depends, exploration, service, water, delivery or a million other things. Look, its boomer shit like it or not I never said it's a shit industry. I worked for HAL for years. Goddamn it's been around d for over 120 years. ITS BOOMER SHIT you don't have to like that. Fucking dumbasses around here, im going to take a shower now and wash all the fucking stupid off me, maybe finish it off with a 9mm facial. Goddamn the posts here are getting unbearable.", "score": 2, "replies": [{"body": "You’re a complete idiot. It’s a commodity. Amazon wasn’t boomer shit in 2000 but you would have been underwater for a decade. Apple wasn’t boomer shit but you would have been under water for a decade there too. Boomer stocks are like utilities. You buy them because they’re reliable and they pay some marginal dividend which is slightly better than the risk-free rate because they have equity risk.\n\nFuck off. This place is worlds smarter while your ass is away in the shower", "score": 2, "replies": []}]}]}]}, {"body": "Bought some tiny 4-16 call today, canadian company.", "score": 2, "replies": [{"body": "Buy $PAA", "score": 1, "replies": []}]}, {"body": "CPE and CDEV 🔥", "score": 2, "replies": [{"body": "They've had a damn good year.", "score": 1, "replies": []}]}, {"body": "i expect a lot more driving soon....\n\n&#x200B;\n\nthis is not an educated statement", "score": 2, "replies": []}, {"body": "I'll always be long on oil. There's a finite supply, the markets are carefully managed, govverents give subsidies to fossil fuel companies to keep them competitive with cheap labor in foreign countries whose eventide economies are built on the price of oil. \n\nAnd oil isn't going away, either. Democrats hate oil and want to kill it but they can't. They can't make their solar panels without a shit load of it. They shut down a pipeline and just end up using more oil to transport it via rail and truck. 90% of packaging in the world is now plastic....guess where plastic comes from? lmao\n\nOil is a great investment!", "score": 2, "replies": []}, {"body": "Oil and gas have been the shits for a decade...", "score": 4, "replies": [{"body": "If you like money, do your research and dig for yourself. The oil industry is currently the most cash flow positive Industry in the US markets. It will become historic in Q2.", "score": 8, "replies": [{"body": "Yeah, ill just keep my money out of industries literally lobbying to destroy the planet.  Thanks Bro", "score": -19, "replies": [{"body": "Do you buy plastics? Drive on roads? Drive at all? Wear synthetic fabric clothes? Source all your manufactured goods to ensure that the machinery used is not gas powered? Enjoy your cities buildings having heat and electricity? Purchase packaged goods etc. You use and pay the oil companies regularly. This is not changing any time soon.", "score": 3, "replies": []}, {"body": "Hey dumbass, you’re not giving them any money when you buy their stock.", "score": 4, "replies": []}, {"body": "It’s your money but your narrative is false. OXY has the worlds leading carbon capture technology and ships carbon neutral oil. People just read headlines and don’t think critically anymore. They look for news that affirms their own bias. \n\nIt’s a shame. Largely driven by internet algorithms unfortunately but a shame nonetheless", "score": 6, "replies": [{"body": "The world's largest carbon capture facility is in my home town..  people make shit up on the internet to prove their point when they're talking out their butholes.", "score": 0, "replies": [{"body": "I agree you are taking out of your butthole- https://www.oxylowcarbon.com/carbon-capture-technology/projects", "score": 8, "replies": [{"body": "The largest functioning carbon capture facility is in my home town...", "score": -2, "replies": []}]}]}]}]}]}]}, {"body": "When bank tell you to buy... You know it's time to short the fuck out of this.\n\nedit: Especially JPM and Goldman", "score": 4, "replies": [{"body": "Lol — go for it. Not a wise move. I’d suggest some deep digging. I’ll gladly take your money when you cover.", "score": 6, "replies": [{"body": "I've been doing plenty of research already.\n\nThe M2 velocity is super fucked and we're still in a dollar shortage. When banks aren't lending and they do more QE, it sucks USD out of the economy. Hence out super low M2 velocity. \n\n[https://fred.stlouisfed.org/series/M2V](https://fred.stlouisfed.org/series/M2V)\n\nIf banks are hoarding cash, it means they're naturally short commodities. How can they make money on all that cash? Oh, we can sell Silver and oil FD's to WSB retards!\n\nYou can tell we're having liquidity issues within the banks and the economy when the repo market is bone dry\n\n[https://www.cnn.com/2021/03/04/investing/wall-street-repo-market-fed/index.html](https://www.cnn.com/2021/03/04/investing/wall-street-repo-market-fed/index.html)\n\nSo in short, I'm long bonds and long therefore long the USD. \n\n8 TLT $200 01/22 @ 7 shares of TLT", "score": 2, "replies": [{"body": "The ten year treasury disagrees with your assessment", "score": 1, "replies": [{"body": "Does it though? If you understood what's happening in the Repo market, you'd realize that the speculators (instituions and retailers) are Melvin & Citadel, while the banks and JPow are us apes. You can bet your ass JPow and the banks have deeper pockets.\nWe've already seen this hyper-inflation narrative play out before in 2008 and 2011, but interest rates went down? Banks are shills and they're playing into this media hype when they know how the game will play out.", "score": 2, "replies": [{"body": "I understand REPOs. I’m an MBA in Finance. Look at commodities after stimulus events...I would call $150 oil inflationary. The stimulus and Fed window this go around make 2008 look like my AMEX account.", "score": 3, "replies": [{"body": "Interesting, well I'm certainly not as well versed in Finance, but it looks like we have our bets!", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "\"most bullish in nearly a decade\" is sort of like me saying \"most miles I've ran in nearly a decade\".  Sure it sounds like a lot, but when you hear my previous record was 10' from the couch to the shitter, it's a lot less impressive.", "score": 2, "replies": [{"body": "In the last 15 years XLE has ranged from $30-$120 based on the oil price. It’s poised to go to the top end. I’d call that impressive.", "score": 5, "replies": [{"body": "I grabbed that early this week, I was kinda worried I got in to late but I keep hearing not with XLE.", "score": 1, "replies": []}]}]}, {"body": "Most leverage and upside is Canada , Meg and Ath", "score": 1, "replies": []}, {"body": "I personally have some bets placed on KMI they are mostly in the pipeline industry and stand to gain from oil / natural gas (look into Amazon buying natural gas engines for trucks) market cap is currently about half its long term value", "score": 0, "replies": []}, {"body": "Sell-side oil desks can be shit just because the sector is always under such pressure.\n\nMy concern would just be multiples. Look at oil under Obama and you combine that with the Saudi supply cuts, and you’re looking at a lot of bullish catalyst priced in.\n\nThat being said, Zoomers are in for a bad bad year. They’re going to learn there’s no such thing as a “boomer stock” and that you can have a growing company lose you a shit ton of money on a downward re-rating. My biggest bet is financials, but I’m looking at energy too, just worried I missed the boat.\n\nOP, what do you use to get these? CapIQ?", "score": 0, "replies": [{"body": "E-trade and Twitter #OOTT. I bought in October and am up 10x on my calls. Expect to sell in August after Q2 earnings for 15x return.", "score": 2, "replies": [{"body": "So if I was a dumb ape about to get a stimulus check, what tickers would I throw my bananas at?", "score": 3, "replies": []}]}]}, {"body": "ITs not that we are unaware its taht we see a future without it and they cant see a present, moment, or second, without it...", "score": 0, "replies": [{"body": "Ok in 50 years it’s a bad investment", "score": 2, "replies": []}]}, {"body": "This was an interesting counter argument: https://www.vice.com/en/article/qjpqyw/fossil-fuels-are-wildly-more-expensive-than-previously-thought-study-says", "score": 0, "replies": []}, {"body": "If opec cuts supply u know ppl will be forced to buy ev vehicles. Thus oil supply gonna drop alot faster.", "score": -3, "replies": []}, {"body": "What ya Think about, GTE stock??", "score": 1, "replies": [{"body": "It’s a gamble. I’ve got some of the August calls because those are the furthest out you can buy I’m hoping it recovers to close to two dollars so I can make some money. It looked like it was going to pop recently but then it flattened out again", "score": 1, "replies": []}]}, {"body": "[https://fintel.io/macro](https://fintel.io/macro) Highest insider selling in that sector for atleast 6 years. Data doesn´t go back further", "score": 1, "replies": []}, {"body": "Just wait for tensions in the middle east and watch the oil price skyrocket.", "score": 1, "replies": []}, {"body": "Thanks for sharing 260 XOM calls for june", "score": 1, "replies": []}]}
