{"title": "Beyond gaming - Nvidia's Omniverse makes BMW's plants 30% more efficient", "selftext": "There's a lot of hype around Nvidia's role in gaming, crypto, and self driving. But often overlooked is how their Omniverse and AI can help companies build virtual factories and identify optimal paths to production.\n\nThis is a [great video](https://www.youtube.com/watch?v=6-DaWgg4zF8) showcasing what they've done to help BMW's factories become 30% more efficient. \n\n[Jensen said](https://www.cnbc.com/2021/11/19/nvidia-ceo-says-the-metaverse-could-save-companies-billions.html): \n\n>We want to simulate **all factories** in metaverses, in this omniverse. We want to simulate plants in omniverse. We want to simulate the world’s power grids in the omniverse.... By doing that, we could decrease the amount of waste, and that’s the reason why the economics are so good for companies,” he continued. “They’re willing to invest a small amount of money to buy into this artificial intelligence capability but what they save is hopefully hundreds and hundreds and **hundreds of billions of dollars**.”\n\nI think this explains why Nvidia's valuation is skyrocketing. This line of business is not reliant on securing chips. This is a subscription based software model -- and right now no one else is close to doing anything like this except for Nvidia. Their combination of Omniverse + AI seems like an unassailable moat.", "id": "qxtndn", "created_utc": 1637368651.0, "score": 156, "upvote_ratio": 0.95, "num_comments": 48, "comments": [{"body": "I’m such a fucking jackass. 200 - 300 in one week. Should have bought calls", "score": 34, "replies": [{"body": "Anyone who told you they could've predicted that confidently is probably lying.", "score": 36, "replies": [{"body": "Or insider info.", "score": 3, "replies": []}]}, {"body": "A month", "score": 7, "replies": []}, {"body": "its more technical than fundamental. note that bmw video was from April, nvidia was relatively flat. nobody could have predicted that an annoucement of stock split would drive the stock up like crazy. the market is a reflection of peak clown world where there's lack of logics everywhere", "score": 3, "replies": [{"body": "The stock was sent up initially when they revised their guidance for the upcoming quarter, then they had a great ER along with good news on the arm deal and the stock split. The split was a pretty big part but it wasn’t the initial or only catalyst.", "score": 2, "replies": []}, {"body": "Almost all stocks go up after a split. Bc retail investor see a lower price (forgetting that thier getting half of what they used for each share) and thinks it's better/more affordable entry point. It's literally the only reason companies do stock splits... to increase the volume of trading and open it up to a larger pool of investors", "score": 1, "replies": [{"body": "and smartasses here always love to say that retails dont move the market..........", "score": 1, "replies": []}]}]}, {"body": "Don’t worry. I had 210 and 215 calls NOV17 expiry. Sold after NVDA hit 220 and I made 30% profit. Then I gave it back with a 240 PYPL call right before earnings.", "score": 2, "replies": [{"body": "I’m still bleeding out the ass from a NIO call from January… 🤕", "score": 1, "replies": []}]}, {"body": "This seems like it was old news. But doing some research on NVDA and found this report: https://spear-invest.com/nvidia-the-one-stop-ai-shop/\n\nThis Omniverse could be pretty interesting", "score": 1, "replies": []}]}, {"body": "If Tesla used the Omniverse they might not have finished next to last on the Consumer Reports [reliability rankings](https://www.sfgate.com/tech/article/Tesla-ranks-almost-dead-last-Consumer-Reports-16632996.php).", "score": 16, "replies": [{"body": "Hmm interesting the article mentioned it Tesla is last in reliability but top in owner satisfaction.\n\n>The issue, Consumer Reports’ Fisher told CNBC, is that the company has the tendency to “add so much tech that is not necessary.” \n\nMusk is looking to make produciton as cheap as possible. I hope he will look at what people don't need and just eliminate those extra features.", "score": 7, "replies": [{"body": "Tesla is a *lifestyle brand* like Apple. Their customers don't care if another product is better, smarter, more efficient. They care about the brand and if they get the brand they're happy, even if the quality happens to be bad. They don't think about any other competitors", "score": 5, "replies": []}]}, {"body": "LOL", "score": 1, "replies": []}]}, {"body": "Found that video really interesting - thanks for posting!", "score": 3, "replies": []}, {"body": "> This line of business is not reliant on securing chips. This is a subscription based software model\n\nWhat do you think the subscribed software runs on? Potatoes?", "score": 7, "replies": [{"body": "Yeah, but nvidia can sell this software to people using non-nvidia chips, and they can consistently reap subscription costs over and over whereas chips are only profitable for initial purchase and upgrades every few years.\n\nThe tech is reliant on chips to operate, yes, but the income is not reliant on chip sales. Will probably boost them though", "score": 2, "replies": []}]}, {"body": "30% more efficient planning processes is what I heard in the video and that's what the closed caption heard as well. Did I hear the guy wrong or did you misquote him?", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Well the average American is not invested in the stock market though. And most of the stock pumping is institutional investors so not an unwise theory", "score": 14, "replies": []}]}, {"body": "I love Nvidia… but I feel that modeling out everything with process flow diagrams and having long discussions with the domain experts at each step in the process would have been a shorter path to achieve the same result?", "score": 1, "replies": [{"body": "I think they probably do both. The benefit of having the omniverse model is that they can actually see the process \"in action\" with realistic physics.", "score": 11, "replies": [{"body": "Idk I’m not convinced it is more than a meme… robotics simulation software is standard for industrial robotics… not sure what more value NVidia adds, but could be convinced with more details", "score": 6, "replies": [{"body": "We are at meme level “verse” now. We passed ai and a bunch of others, they needed a new buzz word so cnbc jackasses could keep telling everyone to pump money into overvalued stocks.", "score": 5, "replies": []}, {"body": "Fair enough. So if this is not what you like about Nvidia, what is the specific area you feel is getting you excited about them?", "score": 1, "replies": [{"body": "I am much more excited about their traditional business of making excellent GPU products with robust low level development tools (CUDA). This is a moat in itself because of the libraries/ecosystem they have built up supporting their architectures. I would much prefer if they stayed out of trying to enter the application layers and stick to this core competency.", "score": 2, "replies": [{"body": "Do you think AMD or Intel can ever make any significant inroads in GPU space?", "score": 1, "replies": [{"body": "Hardware architecture is never a moat- a competitor is always one generation/architecture change away from outperforming you. The question really is in software support- I am inclined to think that the others will catch up. The biggest corporate consumers of Nvidia cards (Microsoft, Google, Amazon) don’t want to allow a monopoly to form and give natural pricing power to Nvidia, so they will continue to support efforts from other manufacturers at least as they pertain to cloud computing type GPU applications (I.e. ML training/inference)", "score": 1, "replies": []}]}]}]}, {"body": "The key note speech had lots of cool things about the omniverse I suggest watching it if you have the time.", "score": 1, "replies": []}]}, {"body": "No, the benefit is that by realistically simulating the environment, you can train more robust agents that can then be deployed efficiently in these factories. By closing the domain gap between virtual and real, the trained robots can better adapt in the wild because the conditions in which they were trained are similar to those in which they are tested. This is where the efficiency gain comes from.\n\nHere’s one example: suppose you train a robot to pick up a box and place it somewhere. But every once in a while, the box is slightly misplaced and the robot arm has trouble gripping it. By enforcing physics into the simulation, the agent can learn how to correctly push this box in some way so that it returns in a state that the robot understands to continue its job. Now imagine these robots also have cameras and uses some computer vision algorithm to identify and sort boxes by appearance. If your simulation does not account for different materials (e.g. wood, plastic, metal), your robot will only be able to understand the types of box it has seen during its training. In other words, it won’t generalize well: give it a weird mirror-like box and your robot will entirely fail in real life. It may confuse the box for something else due to reflections unless it directly models how light interacts with surfaces using physics-based materials. \n\nOf course it takes time to model an entire BMW factory down to an inch, but if your end goal is a complete and robust automation of your production pipeline, this is your best bet. Photorealistic visualization is great, but it’s just eye candy and no one really cares in practice.\n\nSource: I’ve interned at NVIDIA last year and also worked on Omniverse.", "score": 3, "replies": [{"body": "Wow very cool! Thank you for sharing your insight. So what is your take on Nvidia stock? Are people over or under valuing how much the omniverse could be worth in the next 3-5 years?", "score": 1, "replies": [{"body": "Hard to tell but I'm quite bullish. I think Omniverse is a fantastic product with great potential. As far as I can tell, NVIDIA's vision on the metaverse is more focused on content creation and automation than virtual business and telepresence (even though they do have projects like Maxine). In terms of \"simulate your environment to improve automation\", NVIDIA is uniquely positioned and this could very well become a core component of their business in the near future. Omniverse is also poised to revolutionize how 3D artists contribute and collaborate on projects. The metaverse will naturally engender millions, if not billions, of 3D assets and being an integral part of this creation process is crucial.\n\nJensen has proven uncountably many times that this company can adapt and seize opportunities when they come by, and Omniverse is no different. Having seen how well NVIDIA performs both internally and externally, I don't think it is overvalued right now.", "score": 2, "replies": []}]}]}]}, {"body": "I'm not suggesting I know what exactly happened here, but NN/DL has shown the capabilities to pattern match effectively and find trends in big data that are overlooked both by people and search algorithms.\n\nWe're already seeing this pop up in disease diagnosis using AI assistance. I wouldn't be surprised if that's the advantage AI brings tot the table that can't be replicated by an industrial engineer.", "score": 2, "replies": []}, {"body": "I think the issue with stuff like this is that, as you say, having experts look at it will probably reveal most issues.\n\nIn this case, people were modeling the process to use their tool on them. When you model something like this, you take a detailed look at it, and you start to see some issues with the process.\n\nI worked on some industry projects, and it's always appalling how many low-hanging fruit there are if you just take a proper look at it.\n\nThe main culprits:\n1. It's hard for one person or even a small team of people to know everything about the domains they're working in. E.g. software, mechanics, thermodynamics, control engineering, system modeling, etc.\n2. The bigger the company is, the less one person knows, or can change, often the employees will know  what's wrong with the process, and can't change it, and after running against corporate walls will cease to try to change it. The other effect is that nobody understands the system as a whole, so any optimization that touches at least two domains is unlikely to happen.\n\n1 and 2 make it fairly easy for someone from outside to find optimization potential.", "score": 2, "replies": []}, {"body": "Yeah and the main improvement they show is getting a taller trolley. That can easily be done after launch and it feels like complete overkill to put a guy in a virtual reality simulation for him to just say \"do you see how far I have to bend?\"", "score": 2, "replies": []}]}, {"body": "Is it only me or the army of masked digital slaves is dystopian? Why would you put a mask on avatars?", "score": 1, "replies": [{"body": "Don't worry, they put those human workers in there for PR reasons. I'm sure BMW is actually focusing on how to cut as many humans out of the process as possible.", "score": 6, "replies": []}, {"body": "Neither a mask nor a job makes you a slave", "score": 0, "replies": []}]}, {"body": "Marketing... 30% improvement in planning process? High tech robot to transfer Wooden Euro pallet? \n😂", "score": 1, "replies": []}]}
{"title": "What would you do with Boeing stock?", "selftext": "I’m at a $175 cost average and the hope was it will approach $300 as the Max issues get put behind them and travel picks up, but it seems they can’t get out of their own way. Curious what others would do with this stock?", "id": "qy6471", "created_utc": 1637416680.0, "score": 20, "upvote_ratio": 0.88, "num_comments": 43, "comments": [{"body": "There is only one other company that does what they do and demand for planes will continue to increase as people fly more. Stay long.", "score": 28, "replies": [{"body": "Why not buy the stock of the competitor, which seems to have a much better product portfolio with the A320 more successful than the 737 Max and the A220 with great potential, especially once they launch a A220-500? Boeing has a strategic problem in that field. The 737 is simply the older frame and launching a new program will cost $15 billion up. \n\nIn the wide-body space the 787 still has production issues after what looks like trying to cut too many corners to get cost down. I always found Programm Accounting weird and they still have to make [$17 billion ](https://www.boeing.com/investors/accounting-considerations.page) in money just to amortize the money they already booked as loan against the future. That bet puts a lot of pressure on them to deliver savings in production costs, which will make it more likely that they’ll cut corners again.\n\n777X doesn’t look like it is selling much and now Airbus attacks them on the freighter side with the A350F. \n\nBoeing for me is one of the cases of a great US company which fumbled its future by overly focusing on delivering short to medium term cash flow instead of investing in long term future. I hope they’ll turn it around, but that won’t happen in one or two years.", "score": 15, "replies": [{"body": "I went with Airbus too but skipped over all the research. I just like $32 more than I like $200", "score": 2, "replies": []}]}, {"body": "That is my reason to hold BA too", "score": 2, "replies": []}]}, {"body": "Boeing can’t seem to do anything right; from the MAX problems to all issues building 787s and delay after delay for the 777X.\n\nThey are too big to fail and the US taxpayer will always bail them out, but I get nervous investing in such poorly managed companies.", "score": 11, "replies": []}, {"body": "Hold", "score": 6, "replies": []}, {"body": "Hold - it will get to 300", "score": 10, "replies": []}, {"body": "The US govt won't let boeing collapse for national defense reasons, long hold", "score": 8, "replies": [{"body": "However, DOD does not GAF what the stock price is doing.", "score": 3, "replies": [{"body": "No, but eventually they'll get a trillion dollar contract for the next gen fighter/bomber/cargo/space thing ect...", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Ha, that’s what I always think, “that’s got to be the last of the bad news, smooth sailing from here”.  And then the next month, another story.", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Honestly, it’s only positive from here. Their entire commercial plane business could shit the bed and they would only lose a quarter of its value at this point. They haven’t delivered shit for planes over the past three years. It really can’t get much worse than this for them. \n\nNow, if congress gets serious about the military budget then Boeing would be in some big trouble.", "score": 1, "replies": []}]}]}]}, {"body": "I own some BA. This is a long term hold.", "score": 7, "replies": []}, {"body": "I had only a little amount (<50 shares) when I got out of BA luckily before the Max issues.  I always fear China cancelling order as they progress with building their own via [COMAC](http://english.comac.cc).  \n\nHere is an [old posting](https://www.reddit.com/r/stocks/comments/ologri/how_do_you_think_comac_will_affect_aircraft/) on COMAC.  There should be more if you do a search.   The moment they start  canceling orders it will have a ripple effect on the US economy.", "score": 3, "replies": [{"body": "China is about to approve the max again.  You got really old news", "score": 2, "replies": [{"body": "Yes, they will approve the Max as they need planes but they will and are making their own that will impact BA.", "score": 0, "replies": [{"body": "Lol you see their plane? Its not even close to being usable.  You cant just copy paste a commercial aircraft like you can with other tech data.  China doesnt have the ability", "score": 1, "replies": [{"body": "You should read a little two of their model has already been approved.\n\n.On May 5th 2017, C919 made the first test flight. A total of 815 orders have been obtained from 28 customers.\n\nARJ21-700 aircraft have been entered into route operation formally. The market operation and sales status is good. A total of 616 orders have been obtained from 23 customers.", "score": -1, "replies": [{"body": "You understand thats a small jet?  It doesnt touch the max.  It cant even fly more than 4000km.  Its more of a competitor for airbus a220 which can fly over 6000km. Lol \nAlso the max can seat more than double that china jet.  \n\nLike I said, China is not close and does not have the ability to enter the market", "score": 1, "replies": [{"body": "Yes, they are working on the larger planes.  Time will tell.  Just waiting for the cancelled orders in 1-2 yeas.\n\nThe baseline version is named as CR929-600, with range of 12,000 km and seats for 280 passengers. There will also be a \"junior version\" named as CR929-500, and a \"senior version\" named as CR929-700.", "score": -1, "replies": [{"body": "Time will tell", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Just hold. Stocks only go up long term…", "score": 3, "replies": []}, {"body": "I got into Boeing around 200 because of how resilient the stock is. The entire 737MAX project being grounded wasn't enough to kill this, which is amazing imo. It forms a duopoly with Airbus in the commercial aircraft space and I think we are far from China manufacturing its own planes. India and China will need a lot of planes as their economies grow, which will provide a strong tailwind for manufacturers. \n\nObviously this will play out over a longer term than the next six months.", "score": 5, "replies": []}, {"body": "I had Airbus - maybe some potential left but I made my 100% and decided to move on. To be honest, too cyclical for me, low or no div and I don't expect them to become a real growth stock  much beyong pre-pandemic levels.\nBut this is only me.", "score": 4, "replies": []}, {"body": "31 shares with a $136 average. Obviously it will be a different answer for everyone given the need for funds, how long you wanna have money locked in one stock etc. but Boeing will bounce back 100%. They are apart of the Dow, are part of a Duopoly, have strong ties with U.S. government (lots of contracts), and will eventually move past all of the recent, albeit lengthy delays and issue they’ve encountered in due time. \n\nThey obviously can’t afford to rush back to commercializing the MAX or move past the other software issues some of its wide body jets have had without cooperation with regulators and of course the eventual go-ahead once said software/overall issues are eradicated. Boeing will see $300-$350 a share again within the next 1-2 years.\n\nLong/Hold.", "score": 2, "replies": [{"body": "400 shares 135 average. Holding til this hits 400. It's a duopologly and people's planes are old and being replaced. Boeing has a massive backlog that will last them for years. Yes it shrunk recently but imo these are just customers trying to squeeze Boeing for a better price.", "score": 2, "replies": []}]}, {"body": "Just hold", "score": 4, "replies": []}, {"body": "Another issue Boeing has that won’t go away is that they went from 0 contest on spacecraft to it being a really crowded field. I’m not even sure they’re the best company in the space anymore.", "score": 1, "replies": []}, {"body": "I sold. Too much risk when one crash can kill hundreds of people and wipe out the price.", "score": -1, "replies": []}, {"body": "Boeing will benefit from the next war. The US is about to be invade East Africa.\n\nDo you still believe in the company?", "score": -8, "replies": [{"body": "Not really. I did, but negative reports on quality and management keep coming. There’s promise if they can work through and get to the other side, but thinking why wait.", "score": 5, "replies": [{"body": "Well, remember, real gains made over they long term. Every stock in your portfolio can't be green all the time. (Although in this market, who knows!) I think before liquidating, you should know what you're going to do with the money and your tax implications. I just went through this this week. Good luck figuring it out.", "score": 2, "replies": []}]}, {"body": "why would you think we are going to invade east africa?", "score": 3, "replies": [{"body": "Lots of political activity/instability in Ethiopia. The stage for a multinational proxy war is being set. US is sanctioning a democratically elected government. That democratically elected government recently made peace with a dictatorship (Eritrea). Chinese investment in East Africa is huge, too. And then there's Egypt and the Nile River--which Ethiopia dammed. Add cultural strife, conditions for religious extremism... It's not looking good. But hey, war stocks... Thanks for engaging, can't believe folks downvoted me..", "score": 2, "replies": [{"body": "People are downvoting you because the odds of Joe Biden in any way shape or form getting the mandate to start a war in Africa is non-existent. Add the Afghanistan withdrawal and it’s even less likely.", "score": 5, "replies": [{"body": "For the sake of hundreds of millions of people, I hope you're right. But the conditions are there.", "score": 0, "replies": [{"body": "US has maintained a presence in East Africa for some time. A small Army of drones and a small CIA contingent will continue to provide the US with all it needs - just enough to pluck the biggest threats and to provide inside access if any situation gets too big to handle. \n\nStatus quo will win out. Worst-case scenario is another short-lived Blackhawk Down-style crisis.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Just hold till the cows come home.", "score": 1, "replies": []}, {"body": "There are two plane companies in the world . Just think about that", "score": 1, "replies": []}]}
{"title": "Tesla's submitted 5 filings with the Texas Department of Licensing & Regulation", "selftext": "", "id": "qy2o50", "created_utc": 1637403077.0, "score": 114, "upvote_ratio": 0.95, "num_comments": 43, "comments": [{"body": "BREAKING: Tesla's submitted 5 filings with the Texas Department of Licensing & Regulation. Tesla seems to be seeking approval for start of production. \n\nFilings\n\n• Body In White (Cost: $182M)\n\n• Stamping ($150M)\n\n• Casting ($109M)\n\n• Paint ($126M)\n\n• GA ($493M)\n\n\nTotal Cost: $1.06B", "score": 58, "replies": [{"body": "In 2020, GM spent 2.2 billion in the US alone on...\n\n\nAdvertising.", "score": 72, "replies": [{"body": "Does someone really see a car ad and go oooh that’s the one I didn’t know I wanted…", "score": 26, "replies": [{"body": ">Does someone really see a car ad and go oooh that’s the one I didn’t know I wanted…\n\nAds absolutely work if competitors offer similar products with only superficial differentiation.\n\nIn that case GM is in a zero-sum game: the customer who doesn't buy GM will buy Ford or Toyota.\n\nEnter Tesla, who offers a one-of-a-kind product with no genuine substitute. 90% of customers who buy a Tesla don't buy anything else anymore.\n\nNo advertisements needed, the product sells itself.", "score": 57, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "I would also add that there is not way to explain this to someone until they sit in the drivers seat and experience it for themselves. Most car buyers are conditioned to expect this barely differentiated product and ask “How much better could a Tesla be really?” And they have no idea.", "score": 13, "replies": []}]}, {"body": "Exactly.\n\nAnd to the point of being annoying and redundant, LICE OEMs are now officially building obsolete products . This is not my take or personal opinion but the definition of obsolescence in industry. The pandemic, with the cut of the orders for automotive chips, caused the fabs to ditch the whole 100n plus tech, triggering the obsolescence waterfall.", "score": 10, "replies": []}, {"body": "…with a few clicks of a mouse.", "score": 2, "replies": []}, {"body": "I think we have all noticed how most new non Tesla EVs copy some design elements of Tesla.  Biden may not be able to nod in Teslas direction, but all the designers are.", "score": 1, "replies": [{"body": "Rivian and Lucid?  Staffing management/design/engineering with ex-Tesla employees might be contributing to that too", "score": 2, "replies": []}]}, {"body": "And pretty much no analysts mention this huge advantage", "score": 1, "replies": []}]}, {"body": "I hate advertisements with every fiber of my being and have taken every action possible to shield myself from such idiocy, so I might not be the best person to ask.", "score": 21, "replies": [{"body": "right there with you brother\n\nhttps://m.youtube.com/watch?v=tHEOGrkhDp0", "score": 5, "replies": [{"body": "Damn, long time since I watched Bill. Wife's out for the night... Evening plans secured.", "score": 1, "replies": []}]}]}, {"body": "It doesn't normally work in one hit. It's the persistent shoving of a product or brand in your face over a long period of time that keeps the brand front and centre in your mind, so when you do intend to buy, you think of them. If most people were more impulsive they would only have to spend a fraction of what they do currently.", "score": 7, "replies": [{"body": "There’s an opposite reaction too for this persistent harassment. All these Volvo, Cadillac, Google Fi, etc ads become an absolute pain and each time you see/hear them they elicit and engrain a negative sentiment to the brand. This is further aggregated when the advertising is structured to be deceptive in an effort to try and catch people’s attention, such as formatting advertisements on Reddit to look like genuine posts. The more you shove this in people’s face, the more resentment they develop towards the particular brand.", "score": 4, "replies": [{"body": "I hear ya. It's why I'll never subscribe to Audible.", "score": 3, "replies": []}]}]}, {"body": "If advertising weren't effective, it wouldn't be a multi billion dollar industry.", "score": 6, "replies": [{"body": "I don’t know if homeopathy proves or disproves your assertion. It isn’t effective… but it’s a billion dollar industry.", "score": 4, "replies": [{"body": "Ineffective at being medicine, but quite effective at getting people to spend money", "score": 5, "replies": []}]}]}, {"body": "If ads didn't work, they wouldn't spend money on them. Data analytics makes it really easy to find out how effective they are and they are clearly more effective than salesmen in dealerships. If people didn't absolutely need to buy a car when they walked into a dealership, it would be a miracle if the average dealership clown sold a single one. The least trusted professional in America by polling data is the car salesman.", "score": 3, "replies": []}, {"body": "Did you really just ask if advertising worked?  The Tesla circlejerk has reached a new level.", "score": -1, "replies": [{"body": "I think ads work for discovery but cars are pretty publicly shown products meaning you see them on the street and usually your eyes will draw to what you’re interested from there.  Like for toothpaste I kind of get you don’t know what everyone else is using but cars and their drivers are pretty obvious.", "score": 1, "replies": []}]}, {"body": "I think what we're seeing is that there is a whole advertising ecosystem.  It's not just the television, print, billboard, radio, and mass market ads. Not just social media. But it includes awards like JD Power, Etc. Plus mentions on news shows, morning shows, etc. And even down to information presented to you much more subtly such as within news aggregators inside your brokerage. It's really insidious and pervasive. So normally that kind of pressure is stifling, but somehow word of mouth, brand projection, visual appeal, and the sheer awe of Tesla's share price overcomes all of that!", "score": 1, "replies": []}]}, {"body": "And GM ads are stupid AF", "score": 6, "replies": []}, {"body": "I don't know about GM, but Tesla seems to be hell-bent on designing the new factories for minimizing transport distance and manual re-packaging/transporting between processing steps. Vertical integration makes this possible, but it still takes afford to design the layout of factories so that this can be taken advantage of. I think a 1.06B Tesla factory can run a lot more efficient than a 1.06B GM factory, even if both where build in 2021. For a start, unions would put hard limits on how efficient a factory is allowed to be, create more jobs and influence.", "score": 3, "replies": []}, {"body": "They have to convince people not to buy a Tesla🤣", "score": 2, "replies": []}, {"body": "I mean I search Tesla on google and the first thing I see is a cadillac  lyriq ad", "score": 2, "replies": []}, {"body": "Electrifying the ad budget one disgrace at a time!", "score": 1, "replies": []}]}, {"body": "Someone correct me if I am wrong, but I am assuming these are the costs of the buildings and groundwork and do not include the costs of all the machinery (robots, factory-lines, stamping presses and casting machines). Still seem low costs for such a gigantic project to a layman like myself.\n\nDoes anyone cast any insights on this?\n\nedit: I am having second thoughts about this. The costs for each section does not correlate well to size, so maybe they include machinery after all.", "score": 9, "replies": []}, {"body": "Will that kill 4q earnings or will it be written off as a one time expense?", "score": 1, "replies": [{"body": "I think construction costs have been in the numbers the whole time.", "score": 7, "replies": [{"body": "Yup. This is the billions they've been spending on capital.", "score": 1, "replies": []}]}, {"body": "capital expenditures don't hit the income statement. Think of it like this - the income statement is like your paycheck. You see the total amount of your paycheck (this is revenue), the various line items like insurance and taxes being taken out (this is operating expenses etc), and the net amount deposited in your bank account (this is net income).\n\nThe cashflow statements are like your home budget - they focus on what happens to the net income once it arrives in your bank account. This is where you find capital expenditures like building new factories.\n\nThe balance sheet is where you list assets, like completed factories you own. The factory is depreciated over a fixed lifespan, so your balance sheet assets lose value at a known rate each year.\n\nIt's not a perfect analogy (for instance the cash flow statements add some things back in from your income statement) but I think it helps visualizing how it all works together.\n\nThe cashflow statement begins where your income statement ends (with, as I said, a few things added in). Capital Expenditures are in the cashflow statement not the income statement and therefore don't affect the earnings per share etc.", "score": 4, "replies": []}, {"body": "They've been building for a year and a half.", "score": 1, "replies": []}]}, {"body": "Oh… booooring", "score": 0, "replies": []}]}, {"body": "What does this actually mean?", "score": 6, "replies": [{"body": "Modelbay production kicking off?  Or cybertruck I suppose", "score": 2, "replies": [{"body": ">• Paint ($126M)\n\n>Or cybertruck\n\nProbably not", "score": 9, "replies": [{"body": "Good call", "score": 2, "replies": []}]}]}]}, {"body": "It’s all happening!!", "score": 5, "replies": []}, {"body": "Only 1 Billion to build a factory? Tesla made 1.5 Billion in profit last Q. This factory will pay for itself in a year.", "score": 2, "replies": [{"body": "This won't be for the whole building I guess?", "score": 2, "replies": []}]}, {"body": "BREAKING", "score": 2, "replies": []}]}
{"title": "Read the emails Elon Musk sent Tesla employees about music on the job and following directions", "selftext": "", "id": "qycixs", "created_utc": 1637435629.0, "score": 51, "upvote_ratio": 0.83, "num_comments": 40, "comments": [{"body": "I love this and will use it. Explain why I’m wrong, ask for clarification, or execute.", "score": 27, "replies": [{"body": "Lead , Follow or get out of the way. Gen. George Patton", "score": 15, "replies": [{"body": "Joe Bauer: Gets out of the way.", "score": 1, "replies": []}]}, {"body": "I especially like \"explain why I'm wrong\". Elon doesn't let his ego get in the way of getting to the truth of things. Far too many people in positions of power struggle with accepting that they make mistakes.\n\nFar too many workplaces where explaining how your manager is wrong would get you fired cuz you hurt your manager's ego.", "score": 4, "replies": [{"body": "The main question is if you were wrong about why he was wrong do you still get fired…", "score": 1, "replies": [{"body": "No. The reason why he sent that particular email was because some managers were simply ignoring the instructions. The worse thing they can do.", "score": 1, "replies": []}]}]}]}, {"body": "If he had send the first email only to the managers, there would have been zero chance this would have been executed consistently across ~5 factories.\n\nWhat is the situation in other US car factories? Is this the kind of thing that unions fight for?", "score": 7, "replies": [{"body": "I really want to know if unions could push for specific verbiage or omitting requests such as these?", "score": 2, "replies": []}]}, {"body": "Who's hungry? I am. I could totally go for a nothingburger right about now.", "score": 14, "replies": []}, {"body": "This is a rare exception of us posting a Lora Kolodny article: but it's reasonably fair & objective, has no false narrative & quotes the entire emails.\n\nThe only bit missing is that the 'managers need to follow orders' email was apparently ***in response*** to the 'music on the job is allowed' email. (A fairly common-sense explanation would be that some managers continued to ban music on the job, and Elon got informed about this, and followed up with the second email.)", "score": 1, "replies": [{"body": ">The only bit missing is that the 'managers need to follow orders' email was apparently ***in response*** to the 'music on the job is allowed' email.\n\nWhat are you even basing this on?", "score": -1, "replies": [{"body": "The follow-up email about manager behavior was sent the day after the music email was sent.  \n\nYou obviously know this since you read the article.  Right?\n\nSo … \n\nAre you suggesting there could be a separate manager issue that coincidentally occurred at the same time?", "score": 11, "replies": [{"body": "Also, Elon isn't emailing to \"All\" all that often: once every couple of weeks AFAIK. So another email in a related topic on the next day is absolutely a follow-up.", "score": 3, "replies": []}]}]}]}, {"body": "> The second, harsher email reminded employees there are only three options when Musk sends directions: explain why he’s wrong, request further clarification, or execute.\n\nWhat's really \"harsh\" is management with their heads up their asses.  At least elon runs on logic, and can be convinced of new arguments with sufficient evidence.  In companies with toxic management, it's all about \"get in the inner circle & stay on my good side, then i won't yell at you for listening to music\".", "score": 6, "replies": []}, {"body": "The music one may seem trivial, but to me that really shows that Musk is in touch with what working one of these jobs is like. Something like music is massively important for job satisfaction, and most managers are too fucking stupid/out-of-touch to understand that this is a very simple thing to do *that costs them nothing* and improves job satisfaction *and* performance.", "score": 5, "replies": []}, {"body": "No jerk policy !", "score": 14, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Flat in the sense that employees can bypass the management hierarchy and contact Elon directly, if there's something important to communicate (a good suggestion or a significant problem).\n\nIn some organizations if you have something important to communicate you have to tell your supervisor, then if they think it's important they tell their boss, and so on up the organizational structure, and if any boss along the way thinks it's not important then the message never gets to the top.", "score": 3, "replies": [{"body": "Or the message gets transmitted as being their idea and the worker gets a big fuck you from them with no proof.", "score": 2, "replies": []}]}, {"body": "There are 70,000+ employees at Tesla and will grow to 100,000 soon.  There are managers for a workforce this large.", "score": 2, "replies": []}, {"body": "You bought 30k in Tesla shares because you thought they didn't have managers. You must really hate managers 🤣", "score": 2, "replies": []}]}, {"body": "The music one is very surprising, I've worked in probably 10 different warehouses and none of them allowed music, it's a safety hazard, anywhere a forklift is present.\n\nAnd I assume a car factory is far more dangerous than any of the warehouses I've worked in.", "score": 7, "replies": [{"body": "I worked in retail where we had pallet jacks (Electric and manual) walkie stackers, and various trollies. Were allowed to have music once the store was closed. Some managers even encourage it, since the PA Music is terrible.", "score": 6, "replies": []}, {"body": "That's why the rule is for having one earbud out. Music is less loud than audible alarms.", "score": 8, "replies": []}, {"body": "I can't imagine a brand new factory would have systems that relied on audible horns or alarms to keep people from getting run over. Material movers have had collision avoidance systems for years now.", "score": 8, "replies": []}, {"body": "Yes but also transparency is a thing on AirPods. And deaf employees as well. Let's not stay stuck in the pas century.", "score": 1, "replies": [{"body": "But what about the blind truck drivers!", "score": 1, "replies": [{"body": "Autopilot? Why are you even in this sub ;)", "score": 2, "replies": []}]}]}]}, {"body": "Those all seem very reasonable to me.", "score": 3, "replies": []}, {"body": "Fun, but assertive.", "score": 5, "replies": []}, {"body": "LOL I wonder what promoted that email", "score": 2, "replies": []}, {"body": "[removed]", "score": -41, "replies": [{"body": "He has paid more taxes than you will in 1,000 lifetimes.", "score": 23, "replies": [{"body": "I paid more taxes than him last year u idiot…", "score": -28, "replies": [{"body": "I dont know if your trolling or you just don’t know how his taxes work. He does not draw a salary from the company. So he does not pay taxes on money he does not receive. If you make 0 on income why pay taxes?  Now he is the owner of the company and thus has a shit ton of shares or stocks of Tesla. So if the company does good and thus the stock price goes up his overall net worth increases. Now it is normal for everyone who owns stock not to pay taxes on those shares till you sell them. This includes you and me. To pay for every day stuff he takes out a loan from the bank. Now since his net worth is so much more then you or me Elon can get a bigger loan at a lower rate. Now you may ask why is he finally paying taxes now? He had certain criteria that if he met yet got to buy shares from the company for cheap. He has to pay taxes on these since they are worth more then what he is buying them for. He is getting a lot of shares here so he will being paying a lot of taxes this year. That’s a lot with 9 zeros... (billions) So yes you paid thousands or hundreds in taxes last year I’m guessing. Elons paying billions in taxes this year.  To get to a billion you take your $1,000 and add 6 more zeros to get  $1,000,000,000. \n\nTLDR Why are you comparing your chump change from last year with his billions from this year?", "score": 10, "replies": []}, {"body": "Yeah, he's definitely the idiot in this equation", "score": 7, "replies": []}, {"body": "Yep and you still have a lot of catching up to do", "score": 1, "replies": []}]}]}, {"body": ">Dude wants his employees to work like a slave so his company and net worth can go higher…all while paying no taxes 🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️\n\nRule 5 violation: no trolling.\n\n> I paid more taxes than him last year u idiot…\n\nRule 6 violation.\n\nBanned.", "score": 17, "replies": []}, {"body": "Allowing employees to play music is a form of slavery. Got it.", "score": 15, "replies": []}, {"body": "His employees also get stocks.", "score": 9, "replies": []}, {"body": "You know what’s worse than one’s ignorance? Spouting your ignorance.", "score": 2, "replies": []}]}]}
{"title": "Thoughts on DIS", "selftext": "Hey gang,\n\n  Just looking for some opinions on this potential buying opportunity on Disney. I am seriously thinking about buying in at $153 if it drops a bit more next week. I do not have enough extra $ to buy 100 shares to turn around and sell calls against. With this stated, my initial plan would be to buy maybe 10-15 shares and wait to see if I can DCA downwards if it continues to dip. I was also thinking about using this as my first ever pmcc but having never done anything other than wheeling has me a bit nervous. Any/all advice and/or recommendations would be greatly appreciated.", "id": "qxtth9", "created_utc": 1637369213.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 43, "comments": [{"body": "What’s your price point to buy 100? Can you wheel in? Buy a 150 csp and then sell cc? DIS is a stock you can hold forever. Definitely a buying opportunity in my opinion, but I said the same thing at 170… 165… 160…", "score": 7, "replies": [{"body": "Hey, thanks for the response.\n\nRN, I would feel most comfortable buying in @ $135-$140. But, I get anxious, because I doubt it will reach that point and I fear I will miss out @ $154-$155 and see it rebound to $160-$170 in the next few weeks. I would love to wheel in, but I have a large portion of my $ in an etf that I really don't want to let go, so I don't have enough $ to sell a csp. DIS has been on my radar for awhile, but in the past I just couldn't buy @ $150 then $160 etc. Seeing it reach over $190 really tested my ability to block FOMO. \n\nAlso, I'm ngl, I'm a bit nervous in terms of the overall market going into next week and December. It's just a general feeling, but it just seems like a good time for a nice rug pull via the fed...and maybe some eoy selling. That's been causing me to hold off on buying anything for the last few weeks. But the DIS drop is pulling me in.", "score": 1, "replies": [{"body": "Buy a Jan 2023 or 2024 Leap at maybe a .65-.8 delta, whatever you can afford. The plan is to then sell short calls at maybe .3 to .18 delta.  Dis seems to be on sale to me also.  It is back to what it was before Covid at its peak.  I don't see it going much lower. There business has improved since then.  Strong resistance in the $140s.", "score": 4, "replies": [{"body": "This is another good option if you’re bullish long term but don’t have the funds to buy outright right now. However naked cc can be risky. I’d be tempted to just buy a leap to cap your losses at spent premium but have some sweet gains if/when Disney recovers.\n\nMy general feeling is a bounce back for dis in the coming weeks. Historically there is a rally leading up to Christmas and into Jan (Santa rally) which hopefully will see Disney profit, everybody loves Disney.\n\nWhat you might consider is a combination of buying a leap and buying a few shares now and building up your position", "score": 1, "replies": []}, {"body": "Hope so. I hope it bounces. I sold a Jan 150/145 PCS.", "score": 1, "replies": []}]}]}]}, {"body": "Think of a PMCC the same as the Wheel but at a slight discount vs. real shares.  If you do until Jan 2023, to give yourself a year for it to recover, you would be looking at the $140 or $135 call depending on where you decide to buy it.  At about $2500 in buying power left (equivalent to 15 shares at $150), you are going to get decently deep ITM at 0.7-0.75 delta.  However, just be aware, unlike shares these can and will go to zero if the price is below the long call strike at expiration ~13 months from now.\n\nOf course, this also gives you the chance to write weekly premium on DIS for 13 months as well to the tune of about $20-$35 a week depending on your risk appetite.  With that in mind and about 60 weeks until expiration, you could whittle your cost average down to about half by then if you average $20 a week in premium generated, not counting any appreciation of the long call.  \n\nWorst case scenario you are going to see about a $1500 loss if you stick to it and try to keep that $20+ goal in mind of premium per week.  Best case scenario, you ride DIS all the way up to new all-time-highs and rake in the premiums on the way up as well.", "score": 5, "replies": [{"body": "Thanks for the reply. I did look at a few deep itm calls expiring in Jan. of 23 and 24. My issue (other than never attempting one) honestly, is not knowing if Vanguard would let me use the strategy (I'm small time lvl 2.).", "score": 2, "replies": [{"body": "I know everyone hates RH but you could transfer the funds there just to do this.", "score": 0, "replies": [{"body": "I have a tasty trade account, but I've just been hesitant to transfer a decent chunk a change to them.", "score": 1, "replies": [{"body": "Tasty is good! I use it.", "score": 2, "replies": []}]}]}]}]}, {"body": "Never bet against the mouse…", "score": 4, "replies": []}, {"body": "Yolo the house on Mickey mouse", "score": 4, "replies": [{"body": "It would be a tiny 7.5k yolo...but depending on what it does next week, I may lol.", "score": 1, "replies": [{"body": "That was a joke by the way. but i'm interested in DIS at these prices too, but trend still seems to be down so i'd like to see some signs of life before opening anything.", "score": 2, "replies": [{"body": "Yep. I was kidding as well. Im heavily leaning towards slowly DCA into shares if it continues to slide.", "score": 1, "replies": [{"body": "Wait for a pivot point or a consolidation period. Disney won’t just shoot back up after this, it will stay in a range for a bit like SNAP before moving anywhere, that would be your time to get in or wait for a breakout for further verification. \n\nRSI is oversold, MACD is still widely diverged, Elliot Wave is showing continued strong selling pressure, and EMAs look like sh*t. I’d say it’s moving further down next week. This is all my opinion", "score": 3, "replies": [{"body": "Update: I greatly value your opinion good sir.", "score": 2, "replies": [{"body": "I got you bro! No problem, hope you have a good week. I’m kind of beating myself up. After telling you that, I should have bought a put or entered some sort of bearish position. lol", "score": 2, "replies": [{"body": "Same to you boss. Don't beat yourself up, your karma is in good standing. You'll get em next time.", "score": 2, "replies": []}]}]}, {"body": "Thanks for the input. I'm gonna take it slow and see if it slides further to a price I could be happy with before I dip my toe in. \n\nIn your opinion, do you think we will see pre-covid level prices ($110-$130) or is that a bit of a stretch?", "score": 1, "replies": [{"body": "In my opinion, I think $110 is a stretch. I see decent previous support levels around the $140-$130 range though. To be honest, I dipped my toe in buying a share at $160 because I saw Jimmy Cramer bought at $158 but man the volume of selling is insane right now so I sold at $155. I’m just like you, waiting for some consolidation. We’ll see what happens next week. \n\nBut I think a PMCC is a great call as long as the market doesn’t collapse hahah hopefully Disney is back to normal by summer 2022.", "score": 2, "replies": [{"body": "Gotcha. Thanks for the opinion man. Your input is much appreciated. Also, what website do you use to keep track of technicials etc.?", "score": 1, "replies": [{"body": "I’m not going to lie to you bro, I’m kind of unorganized so take what I say here with a grain of salt. I use Webull and have a watchlist of different companies I just monitor with the different types of technicals I use. I know more technicals equals more complications but I like the verification. I’ll watch the Bloomberg and msnbc highlights on YouTube and just see what others are doing on yahoo finance. I like the “most added to watchlists” watchlist.", "score": 2, "replies": [{"body": "Cool. I understand 100% I definitely appreciate your input man.", "score": 1, "replies": [{"body": "No problem bro, godspeed to you 🤘", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "I sold a 160p expired yesterday 11/19… was down about 600$. Right before close I rolled it a week out same strike for 25$ in credit. Will continue this strategy till we see some bounce back. Wouldn’t mind holding 100 shares at these levels", "score": 2, "replies": []}, {"body": "TA has been shown to not work. That being said there is a bullish divergence in the chart. Rsi is making higher lows and the price is making lower lows. For about 2 days. I certainly hope there is a turn around. We will see.\n\nEdit: I rolled some credit put spreads down to 145/150 in dec. I think I have a bunch like 30 or so, so butt hanging in the wind a little. If it drops I can add more capital and roll again for credit but don’t really want to.", "score": 2, "replies": []}, {"body": "Everything is so fucking overvalued it’s a crap shoot at this point", "score": 2, "replies": [{"body": "That's a solid point. I've been saying that for a while now, but the market just keeps climbing into ludicrous territory. So, I'm trying to play so I don't miss out on gains if it \"really is different this time\", but I'm trying to be as conservative as possible.", "score": 3, "replies": [{"body": "I get what ur saying I’m doing the same thing to but I’ve been a little stand offish cause of how ridiculous it is with the markets. And Disney is a good stock even when the market crashes. I think 153 is a good price point. Sell csps then wheel it see what happens", "score": 2, "replies": [{"body": "Yeah. My main concerns right now are eoy tax loss harvesting, profit taking, and Fed action in December. Any of those could cause a 10%-20% correction imo. But your right, as a company dis isn't going anywhere and will be a solid long term buy and hold.", "score": 1, "replies": []}]}]}]}, {"body": "I’m short a 155 P expiring next week and I hope to take assignment.", "score": 1, "replies": [{"body": "Thanks for the reply. So, you feel that at its current price its a solid buy? It's tempting rn, and I almost bought some shares when it hit $153 and some change today, but (probably poor) gut feeling told me to wait it out till next week.", "score": 1, "replies": [{"body": "I think it is. However I wish I had bought more back when I was buying (only a few shares at that time) in spring 2020 when it was $89.  So it could certainly go lower on crappy news, for sure. I think the reinstate dividend within a year or 18 months however and that’ll be a huge catalyst.", "score": 1, "replies": [{"body": "Ah. Yeah, hindsight is 20/20 bro. I feel that way about several of  my buy and holds. DIS would be my only individual stock position, but I like the company. I do think I will slowly DCA and just invest as I go, up until l accumulate 100 shares. That's my goal at least.", "score": 2, "replies": []}]}]}]}, {"body": "IV on disney isn't super great; if you are thinking covered calls, I'd suggest going elsewhere.\n\nIf you are thinking pmcc? I still think there are better options, like AAPL, AMD, NVDA.\n\nReally with Disney it should be a long-term buy-hold stock; I do like disney long term but it will be very hard to predict upswings based on fundamentals since they are facing a lot of near-term headwinds, but long term with both parks and D+/IP content they should be able to print money in a 5-10 year time frame.\n\nI've been a long-term DIS holder for about 4 years or so now, just my thoughts as a shareholder.", "score": 1, "replies": [{"body": "Thanks for the reply. \n\n I'm starting to lean towards waiting it out to see if it dips a bit more. I definitely thought about a pmcc on AAPL, but I'm a bit hesitant, as I've kind of been fixated on DIS and it's (potentially) oversold situation. I need to reevaluate and look into AAPL. The pmcc would at least enable me to deploy less capital.", "score": 2, "replies": [{"body": "I just feel like the IV on stocks like dis and aapl are not really worth doing #thetagang strategies on them.\n\nDIS is likely oversold in the short term but you can't just look at technicals if you are considering buying actual shares. Dollar cost averaging down would be good, but what I'm trying to impart here is that they are going to need 2-3 years to turn their headwinds into tailwinds, which means for right now there is definitely some downward pressure fundamentally and will be so for the short term future (hence the recommendation with the understanding that this needs to be a very long term hold for you to see a good return).", "score": 2, "replies": [{"body": "I get it. You've definitely made me reevaluate my perspective on my initial idea(s). My \"thing\" has been selling otm cc's on the etf I have on solid green days. It's worked well for me so far, but I do understand that things work until...they dont. With that said, none of my other holdings are in Disney's spot (seemingly oversold). I get really \"ancy\" when I see a drop in a company I want to buy and FOMO kicks in even though I personally think it's got a steeper slide ahead, at least in the short term. \n\nDCA downwards probably aligns with my style. It would (1) alleviate fomo in terms of missing out on the dip if it quickly rebounds and (2) enable me to start acquiring a company that I have wanted to build a position in for a long time. Again, I really appreciate your commentary. \n\nIf you were going to go long on DIS say next week, what would you do right now (wait it out, dca, etc.)? \n\nP.S. I got called in to the office this morning and am super groggy, so I apologize if my post quality is lacking.", "score": 2, "replies": []}]}]}]}, {"body": "This is not a thetagang thing but I bought some long dated itm DIS calls this week in my non-thetagang account . Currently down but I’m not worried (yet) hah.", "score": 1, "replies": [{"body": "Thanks for the reply.\n\n I have thought about doing the same thing. But, I researched my broker and from what I read, I need to be approved for lvl 3 trading. I'm gonna apply, and in the interim sit on the sidelines and watch what happens. I am leaning towards DCAing into a long position with shares, but I haven't ruled out a pmcc or leaps.", "score": 1, "replies": [{"body": "Level 3 trading just to buy calls with cash doesn't sound correct.", "score": 1, "replies": [{"body": "I am able to buy calls and puts as well as write csp's and covered calls @ lvl 2. I'm a bit concerned by the mechanics of the trade. If I own 100 shares, I write a call. There is my covered call. No issue cause Vanguard knows I have 100 shares of x. If I buy a long dated itm call and try to write a call against it, I'm nervous that they will reject the request because although it is a similarly long position, I do not have 100 shares in my account. I just synthetically controll 100 shares. \n\nLike I mentioned earlier, I have never honestly utilized a leaps or pmcc before, so I may be paranoid and/or overthinking it. I should just call them and ask if the trade I'm interested in can be placed with my current account restrictions etc.", "score": 1, "replies": []}]}]}]}]}
{"title": "Retailer Earnings Report next week:", "selftext": "[removed]", "id": "qy6yq4", "created_utc": 1637419386.0, "score": 33, "upvote_ratio": 0.87, "num_comments": 45, "comments": [{"body": "Dollar tree is now $2 Tree", "score": 26, "replies": []}, {"body": "Macys mooned", "score": 7, "replies": [{"body": "does this mean Burlington should also moon? I wanna buy some calls", "score": 1, "replies": [{"body": "I didn’t like the spread", "score": 1, "replies": []}]}]}, {"body": "OP, I like your thesis and DD here. Will be tagging plays in JWM on Monday and the options look extremely playable given the 7% drop. With you here. \n\nCouple of Q’s\n\n1) DLTR faces a lot of completion from other dollar stores what makes them the right choice here especially given the run up? Make no mistake, I think equity here makes sense but am worried about potential options.\n\n2) AEO also has significant China exposure. Wouldn’t supply chain issues globally hamper them?\n\n3) AEO and ANF are pairs in my mind. What give you the comfort that both will rise? \n\nI think your above points are salient, just wanted more information here while scrolling through the options chain.", "score": 7, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "You’re well researched and articulate. This is a lot to consider. I’ll post my positions in an edit tomorrow evening\n\n1) hmm lots to consider here. Based on run ups like NVDA a ATH stock can always pop more. \n\n2) Valid \n\n3) dude this is genius. Aerie will Carry!!!\n\nThanks for replying- will come back tomorrow evening. Hoping for a productive week.", "score": 5, "replies": []}]}, {"body": "Investors may not be particularly happy tomorrow about cali store being ransacked today.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "[removed]", "score": 3, "replies": []}]}, {"body": "Here we go boys. $JWN on tap for all", "score": 3, "replies": [{"body": "Guh", "score": 2, "replies": []}]}, {"body": "I thought the exact thing, played $ROST earnings and got rolled… I dont think “investors” are too found of the pessimistic forward guidance", "score": 2, "replies": []}, {"body": "Lmao my bbby calls are going to print bbrrrrrr. I just got hard. Look at macy, Target, Walmart, people are spending and i mean spending. Affrim, afterpay, new credit card offers, low interest rates, brooo. I'm 70% percent sure my calls will print.", "score": 3, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "Good morning. Are you bearish on GPS?", "score": 1, "replies": []}]}]}]}, {"body": "Thanks OP. Will likely be opening some $132 CSPs on TGT to capture vol and hold long if assigned.\n\nEdit: whoops, meant DLTR not TGT", "score": 0, "replies": []}, {"body": "Nordstrom calls up from early today", "score": 0, "replies": [{"body": "We ended up taking a bath today boys. Win some and lose some.", "score": 2, "replies": [{"body": "Sold before close for 40% profit", "score": 2, "replies": [{"body": "Godam weeklies we’re 50 cents for like 26 strikes too.", "score": 2, "replies": []}, {"body": "This is the way. I should have sold at a minor loss and opened up puts.", "score": 1, "replies": [{"body": "No way of knowing man", "score": 2, "replies": []}]}]}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|24|**First Seen In WSB**|1 month ago\n**Total Comments**|47|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/qr2i8y/beyond_meat_a_nothing_burger_that_costs_63b/) [x](https://www.reddit.com/r/wallstreetbets/comments/qvcfl1/tattooed_chef_tonights_tattoo_will_be_in_red_ink/) [x](https://www.reddit.com/r/wallstreetbets/comments/qvhd3v/a_letter_to_david_einhorn_regarding_sono_sonos_an/) [x](https://www.reddit.com/r/wallstreetbets/comments/qvihy1/sonos_an_oh_so_no_bueno_quarter/) [x](https://www.reddit.com/r/wallstreetbets/comments/qsm238/home_depot_a_house_of_pain/) [x](https://www.reddit.com/r/wallstreetbets/comments/qga1d5/pure_ev_investments_are_the_play_dont_be_fooled/) [x](https://www.reddit.com/r/wallstreetbets/comments/qga4zx/pure_ev_investments_are_the_play_dont_be_fooled/) [x](https://www.reddit.com/r/wallstreetbets/comments/qga8vz/pure_ev_investments_are_the_play_dont_be_fooled/) \n**Account Age**|2 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=qy6yq4)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=qy6yq4)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "If you don't mind me asking, what makes you confident that Nordstrom won't run into supply chain issues? I looked up their raw materials providers and many of them are from Hong Kong. They do, however, have a very diverse and long list of different suppliers similar to Nvidia. Is that what makes you more confident?", "score": 1, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "One more question if you don't mind me asking, why'd you choose to do a bull call spread? I understand from a risk perspective since it provides some premium Incase the trade doesn't go in your favor but wouldn't you normally want to avoid holding a contract for an earnings play since volatility will settle and thus result in your option being worth less? If that question looks wonky then I probably just don't know what I'm talking about and I apologize.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}, {"body": "I picked up a couple of JWN calls Friday morning, thought I'd buy the dip but it tanked even more. What are your thoughts now that it's continuing to tank today?", "score": 1, "replies": []}, {"body": "You’ve won 5/7 so I’ll trust you and get ANF and DLTR calls even tho I was thinking ANF puts", "score": 1, "replies": []}]}
