{"title": "The Bear Case for Paypal", "selftext": "I want to hear your bear case scenarios for PayPal: \n\nhttps://www.google.com/amp/s/m.investing.com/analysis/paypal-cautiously-optimistic-on-the-stock-ahead-of-earnings-200606945%3fampMode=1\n\n\nI'm considering going all in on this stock, all it's fundamentals seem good. P/E, valuation and institutional ownership all appear to be the same even though the stock is 40% short of it's ATH. Analyst price targets are high. PayPal itself has established a reliable history and has stronger fundamentals then competitors. \n\nI don't see how this stock won't be a winner in the future.", "id": "qknxjw", "created_utc": 1635801076.0, "score": 62, "upvote_ratio": 0.89, "num_comments": 47, "comments": [{"body": "Sorry, you won’t be hearing a bear case from me. It’s very strong fundamentally. ~20% YoY growth across all key metrics (revenue, TPV, net income, etc.) and a very skilled CEO to execute it all.\n\nPayPal has a lot of competitors as do all fintech companies, but their brand is well known and that works as a good moat against other fintech companies. \n\nThe upcoming Super App will be a flawless ecosystem that’s going to attract a lot of people on top of 400M+ accounts that they already have.", "score": 37, "replies": [{"body": "i have a paypal account but have zero in it. i dont trust my money to sit with them", "score": -16, "replies": [{"body": "They don't care, they don't want to *hold* your money. They want you to *use it* so they can get a certain percentage of each transaction. They want people to buy/sell/move, not hoard...", "score": 30, "replies": []}, {"body": "Venmo", "score": 12, "replies": []}, {"body": "That sounds like a you-problem and not a paypal-problem", "score": 3, "replies": []}]}, {"body": "> YoY growth across all key metrics (revenue, TPV, net income, etc.) and a very skilled CEO to execute it all.\n\nMay I request to list all the key metrics we should check before buying a stock?", "score": 1, "replies": []}, {"body": "Paypal is very convenient, is a safe wall against scams for customers so we trust them and Paypal has become whatsapp-like for sharing and repaying bills after meal", "score": 1, "replies": []}]}, {"body": "Same.   Just bought 4 shares.", "score": 15, "replies": []}, {"body": "PYPL is one of my biggest holdings but just be careful of momentum...I picked some more up today but there's a good chance it could keep falling for awhile.\n\nKeep some powder dry just in case. And always keep a long-term mindset.", "score": 15, "replies": [{"body": "Solid advice", "score": 4, "replies": []}, {"body": "Lmao. Good call. I'm still feeling good about Amazon announcement. Usage is just low because of the stimulus run off.", "score": 1, "replies": [{"body": "One of the main hits I think was from eBay dropping PayPal in favor of using their own internal payment system, which was 8% of PYPL's revenue.\n\nCEO already said previously that this was going to be reflected in Q3 earnings...Guidance was a little weaker than expected but I plan on holding for many years so I'm just treating the next year or two as loading up on shares.\n\nJust makes for a better earning surprise next time when guidance is weak!", "score": 2, "replies": [{"body": "I agree", "score": 1, "replies": []}]}]}]}, {"body": "40% from its ATH? It’s around 25%. Fairly distinct difference!", "score": 16, "replies": []}, {"body": "This is a good opportunity to load up, paypal is a top 10 holding for QQQ and a lot of growth funds. But I don't suggest you to go all in, it is better to diversify a little bit.", "score": 12, "replies": []}, {"body": "how is 55 a p/e ratio?", "score": 7, "replies": []}, {"body": "PayPal should buy Public and integrate its stock trading into Venmo and create a true FinTech social platform", "score": 6, "replies": [{"body": "Yeah I agree", "score": 2, "replies": []}]}, {"body": "I'm no expert on PYPL and not a \"growth\" investor either, so take it with a grain of salt, but:\nAnalyst price targets are more often than not wishful thinking and may very well be completely disconnected from reality - just look at the PT history of some companies that got destroyed over the last couple months/years or others that went bankrupt and you'll see what I mean. If the stock goes up they raise them, if it goes down they lower them, but pretty much everything is always a buy. Always has been, always will be.\nPYPL is still trading at a fwd P/E of 40 - that's not exactly cheap, by a long shot. Just because other stocks are even more overvalued and/or a stock was trading at an insane valuation in the past (GME, AMC, every other memestock lately) doesn't mean it will go back up to that price any time soon or even at all.\nPast performance doesn't guarantee future performance and P/E contraction is a thing.\nCan't say anything about the fundamentals of the business since I haven't looked at PYPL in any depth, but none of the megacap tech stocks are cheap right now. They could drop 50% by tomorrow and I wouldn't necessarily be a buyer.", "score": 11, "replies": []}, {"body": "I haven’t followed the company very closely but a short term headwind could be the reopening. It seems like PayPal is used mostly digitally. When i pay for stuff in person I use Visa or Mastercard (sometimes use a Square POS). I think there’s a big missed opportunity with a digital only (or mostly) platform. With that said, not an expert on the company so I could be wrong.", "score": 4, "replies": [{"body": "Paypal does have a debit and credit card I believe", "score": 2, "replies": []}]}, {"body": "Hey OP. I'm not sure whether you follow PayPal on twitter but they tweeted this just yesterday.\nI hope whatever it is, it will take it up to its ATH. 😜\nhttps://ibb.co/LNdnB0r", "score": 2, "replies": [{"body": "I don't follow them. Interesting. Yeah I'd even settle for getting up to 280s again. I wonder what their news is?", "score": 1, "replies": []}]}, {"body": "Pls go all in. My calls need all the help they can get", "score": 3, "replies": [{"body": "I give you credit for your honesty.", "score": 1, "replies": [{"body": "😂", "score": 1, "replies": []}]}]}, {"body": "Anecdotal/ personal input-- Paypal is great but I just wrote them a letter regarding their \"crypto\" sales they added to the platform. I told them that if they sold me BeeTeeCee coin then I should be able to send or receive it and see those transactions on an open ledger. Because I cannot, they literally did not sell me that asset. But there sits the name of it on the website. Here's the kicker, you can't sell it at market price, the sell price is an average between purchase price and market price. This will sound drastic, but I think it's accurate-  Its a scam. They are scamming people and they should not be allowed to use the name of the #1 crypto when it meets zero of the definition. To make matters worse, they ignored me when I attempted to discuss this with customer service.  Just my 2cents", "score": 2, "replies": [{"body": "While these are all valid concerns, I feel like the average consumer is going to gravitate more towards services that provides the most convenience or interest earnings. When I talk about this concept of \"true ownership\" to people in real life they give me blank stares.", "score": 4, "replies": [{"body": "Ya people are often lazy", "score": 3, "replies": []}]}]}, {"body": "SQ is much better", "score": 1, "replies": [{"body": "I own SQ too but not nearly as much I think SQ has more of an inflated price.", "score": 1, "replies": [{"body": "What makes you think this ?", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I'll look into stripe! Thanks for the lead.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Really? I've been looking for a good PayPal thread and everything I find is about Tesla 😅😂", "score": 2, "replies": [{"body": "Have you tried the search function tho? ;-)", "score": 0, "replies": [{"body": "I honestly hadn't. I usually just set the filter to recent posts and scroll back until they say one or two days old. I've seen some PayPal posts today but most are like \"why is this stock down\"", "score": 1, "replies": []}]}, {"body": "PayPal Dd on my profile", "score": 1, "replies": []}]}, {"body": "Whenever a stock drops a good bit, people on Reddit tend to think it will easily rebound back to highs. Just look at all the Intel posts lately. And how many people have pushed AT&T over the years.", "score": 1, "replies": [{"body": "john deere just went from 330 to 360 in a week\n\neveryone was talking about the end of times for JD", "score": 0, "replies": []}]}]}, {"body": "Like the company, hate the price.\n\nI’ll own it if it gets closer to 150$.", "score": 0, "replies": [{"body": "People tend to oscillate to one extreme or the other. Either people pay 0 attention to fundamentals and it's all news, and hearsay hype and gut feelings. Or it's 100% fundamentals and none of the other things I listed. In reality the stock market is the combination of all of those things because stocks l, more often than not, trade at what people are willing to buy and sell them for. Look at SQ or Tesla with an astronomically high PE. And they continue to make people money. Compare that with Intel. Intel has all the valuation and fundamentals, but at the end of the day people aren't willing to pay for their stock. Do what you like with your money, I just hate to see people pidgeon holed in a limited philosophy", "score": 2, "replies": []}, {"body": "I bet youre the same person who's waiting for Tesla to go down to 200 to buy in.", "score": 1, "replies": [{"body": "time to buy in lol", "score": 1, "replies": []}]}]}, {"body": "I hold some Paypal so you won't hear a huge bear case for me.\n\nBut going all in on this stock seems a bit drastic.", "score": 1, "replies": []}]}
{"title": "Non-Tesla Supercharger Pilot", "selftext": "", "id": "qkebgi", "created_utc": 1635774333.0, "score": 118, "upvote_ratio": 0.98, "num_comments": 46, "comments": [{"body": "People pay €0.57/kWh €0.24 like Tesla owners if they get a €13 subscription. There are some very sweet potential profits with this price structure.", "score": 52, "replies": [{"body": "NL Tesla owners only pay €0.24 per kWh? Cheap! That's what I pay at home lol", "score": 15, "replies": [{"body": "That's really cheap. Germans pay more than that at their homes.", "score": 11, "replies": [{"body": "I’m paying a night rate @ €0.068/KWh at home, saying that prices are going up. Might be nice if the brought in lower rated for off peek in the EU for Tesla drivers", "score": 0, "replies": []}]}, {"body": "Apparently, saw it in a print screen on Twitter, here a source with Tesla Supercharger prices in EU a few months ago:  \nhttps://tm3een.home.blog/2021/06/06/kwh-prices-at-european-tesla-superchargers-20210606/", "score": 4, "replies": [{"body": "Oh, prices went up a lot the past few months. It's now triple what I paid one year ago", "score": 2, "replies": []}]}, {"body": "I was paying around  €0.44 in France and Germany and Ireland last month, I would imagine  the cost should have gone up since. The Dutch were always good with windmills might be cheaper green energy.", "score": 2, "replies": []}]}, {"body": "Like u/Singuy888 said in a different topic, but with the released numbers and a bit more conservative:  \n13€ \\* 12 months \\* 12 years = 1872€   \nIf we assume all the cost of the subscription and charging are covered by the €/kWh cost (so break even), that means that Tesla makes \\~1550 profit (1872 is including VAT) on every EV that signs up for on average 12 years. \n\nThat means that Tesla makes the same amount of profit on the car after 12 years as the car maker with 7% profit margin and a sales price of 22K. (Or after 18 years with a sales price of 33K)\n\nThat's insane.", "score": 11, "replies": [{"body": ">That means that Tesla makes the same amount of profit on the car after 12 years as the car maker with 7% profit margin and a sales price of 22K.\n\nExcept Tesla is spending money building and expanding their supercharger network that other automakers aren't spending.\n\nThe cost of the network has been mentioned in the past as something they basically break-even on. So i imagine any profits they make will go back into more superchargers. Which is a good thing! Even if the network makes them no money it's a huge competitive advantage.\n\nThe caveat to the above is that subsidies would reduce the cost Tesla has to pay to expand the network and could potentially make this a profitable business, but again i think they'll take any profits and just use them to expand the network or add servies and features to make the charging experience more enjoyable (like free WiFi etc) with the end goal being to break-even.", "score": 7, "replies": [{"body": ">Except Tesla is spending money building and expanding their supercharger network that other automakers aren't spending.  \n>  \n>The cost of the network has been mentioned in the past as something they basically break-even on.\n\nThat was why I put this disclaimer in:  \n\"If we assume all the cost of the subscription and charging are covered by the €/kWh cost (so break even)\"\n\nBut it's not that farfetched. Other EV owners still pay every time they charge (the same amount as Tesla owners pay), so if they can break even with those payments (right now), the subscription fee is pure profits.\n\nDon't forget that opening up the super chargers will increase the utilization rate, which makes it way easier to become break even per station. They are also considerate with which stations they open for now, so they covered a lot of downside for Tesla owners as well. \n\nI am sure they will keep expanding the network at full speed, but that doesn't eat into profits too much (I am not an accountant but I believe those cost will be amortized over several years).", "score": 1, "replies": [{"body": "Also think about the point of charging imfrastucture saturation. This is when the profits start to explode.", "score": 1, "replies": []}]}]}, {"body": "It’s not even 12 years it’s a lifetime in 10years there will be no non EV Choice in new cars across the EU, and ICE will be disappearing. \n\nIt will make more since for an EV buyer to buy a Tesla from the start and save in 13€ per month surcharge for not buying a Tesla. Unbelievable that’s got the potential to be like the monopoly like John D Rockefeller had with standard oil back in the day. It’s not like they blocked competitors they just built better.", "score": 3, "replies": []}]}, {"body": "€13 per month for a subscriptoion? Or what?", "score": 1, "replies": [{"body": "Yes for 13€ per month you pay the same as Tesla owners, otherwise you pay the full price. There is an ‘or’ missing in the other post.", "score": 2, "replies": []}]}]}, {"body": "\"The per kWh price to charge can be lowered with a charging membership.\"\n\nTesla goes brrrrr!!!", "score": 58, "replies": [{"body": "If they're rolling out WIFI direct to vehicles you could either make that a separate upsell or simply tie it to the same subscription to make it more attractive.", "score": 4, "replies": [{"body": "But how could they get affordable, blazing fast internet out to every single supercharger station... hang on a tick!", "score": 6, "replies": []}]}, {"body": "DID SOMEONE SAY RECURRING REVENUE STREAM?", "score": 3, "replies": []}]}, {"body": "[Elon confirmation!](https://twitter.com/elonmusk/status/1455186850155479048?s=21), let’s go!", "score": 14, "replies": []}, {"body": "Only potential problem with the subscription plan is Tesla will attract more high usage non Tesla drivers.\n\nSo occasional users may pay the higher amount, but frequent users will buy a subscription and use the supercharger’s frequently causing Tesla to continue to overbuild.", "score": 4, "replies": [{"body": "I see it as a revenue stream that allows Tesla to continue to build out superchargers without concern for the low roic vs other possible investments. I think it also opens up many doors for them in getting local planning permission for supercharger sites... Much easier to approve when it is nominally available for all EVs. \n\nHaving taken a model Y on several cross country trips, the highway driving is absolutely easy, I don't even worry about it. However, spending a few weeks in the suburban wasteland of Chicago without being able to charge at my hotels beyond 110v really highlighted the issues faced by EV owners without garages. It wasn't the sitting at the supercharger (Tesla has solved that with apps and comfortable seats) but the superchargers were all quite far from where I was staying / visiting.", "score": 13, "replies": [{"body": "I agree with all that.\n\nMy thought is daily users are a net negative to Tesla.  That is because they extend wait times are cause Tesla to increase capacity.  Think Starbucks across from the Starbuck due to people using the locations as offices.\n\nI fear the subscription will attract most those customers.  Which will also feel obligated to use the Superchargers frequently because they are paying a monthly fee.\n\nThe fact that these cars are non Teslas also means that they’ll frequently have less range and possibly slower charge times.\n\nI think this could be a great thing was Tesla, but I’m trying to point out the pitfalls too.", "score": 1, "replies": [{"body": "The future is high demand for Tesla's superchargers. There's not nearly enough because there's not enough demand. Tesla wants all EV owners to demand Tesla chargers.\n\nWe need more chargers, not less users. Think towards growth.\n\nNorway is a great testing ground. They'll be able to determine if this increases car sales or decreases.", "score": 1, "replies": [{"body": "All I’m saying is I is not in Tesla’s best interest to pay for an extra million under utilized chargers.\n\nTesla doesn’t get paid more money if people charge for 2 hours vs 30 minutes.  Having everyone use their chargers is a good thing because they control the prices, but try he wrong customers aren’t create challenges.\n\nThe ideal state is 100% utilization, no/short waits, no required maintenance, and charging at max output.  Then as the waits increase Tesla adds more chargers and locations.\n\nThe worst case is high usage for a few peak times of the day/week/month/year and little usage outside that range.\n\nAll I’m saying is it is possible that this gets them closer to worst case rather the ideal case.", "score": 2, "replies": [{"body": "I expect that there will be a minimum charging capability required in order to get a supercharger membership... I doubt they will give access to anything that will take more than 45 minutes to fully charge.", "score": 1, "replies": []}, {"body": "Tesla has a broader view beyond penny pinching on charging stations.\nThey want Tesla brand to be ubiquitous. That means bringing other drivers into the ecosystem. \nTesla isn't trying to save money, they are trying to grow rapidly.", "score": 1, "replies": []}]}, {"body": "Are they testing in Norway too?", "score": 1, "replies": [{"body": "No I got my countries mixed up", "score": 1, "replies": []}]}]}]}]}, {"body": "It's like every subscription, people forget to unsuscribe and boom free money.", "score": 7, "replies": [{"body": "Agreed.  Only saying it would be ideal if non Tesla drivers happened to charge when the sites were mostly empty anyway.   That way Tesla was optimizing existing sites.\n\nObviously there drivers are normal people so that’s not going to happen.", "score": 1, "replies": [{"body": "\"Will more sites open to Non-Tesla vehicles?\nWe’re starting with a select number of sites so that we can review the experience, monitor congestion and assess feedback before expanding. Future sites will only be opened to Non-Tesla vehicles if there is available capacity. \"\n\nTesla is only opening locations with lower usage.", "score": 1, "replies": []}]}, {"body": "There will absolutely be months when even satisfied customers don't use the network.", "score": 1, "replies": []}]}, {"body": "If that proves to be a problem they can cancel the subscription option. Some customers would be disappointed but not terribly so.", "score": 1, "replies": [{"body": "I don’t think the fact that there’s a subscription is the problem.  I wonder if there’s a possible disincentive.\n\nInterested to see how this plays out glad they are going with a slow rollout.", "score": 1, "replies": [{"body": "I had thought you were saying that was the problem because it would attract heavy users. \n\nEven so, the whole program can be cancelled at any time if there's a problem.", "score": 1, "replies": [{"body": "Agreed, they can cancel, change, etc.  was hopeful they’d sprinkle some Tesla magic on this.\n\nIt’s okay,  but but seems like there’s a missed opportunity here.  Although I don’t know what the alternative would be.", "score": 1, "replies": []}]}]}]}, {"body": "You do have to remember Tesla is an energy company first and the EV business is simply a demonstration of their tech.", "score": 1, "replies": []}]}, {"body": "Nice. I like that they will only allow certain superchargers into the program. That makes a lot of sense... and I feel stupid for not assuming that earlier when the topic first came up.", "score": 2, "replies": []}, {"body": "And it some regions that means people have to buy an Tesla adapter! Which means even more possible revenue!! (Unless they buy a 3rd party adapter)\n\n![gif](giphy|YEe4Y10PuOTYI)\n\nExcellent move Tesla!", "score": 2, "replies": [{"body": "The super chargers in question have both a Tesla and a CCS cable, if you read the FAQ at the bottom.", "score": 3, "replies": [{"body": "Well darn, a man can dream though haha. I’m sure my little joke will apply in places like the USA where it’s mainly just Tesla’s port on the superchargers, if they expand it to the USA.", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "It's net negative for Tesla owners, and net positive for the environment.", "score": 2, "replies": [{"body": "No it will lead to constructing more supercharger stations leading to greater density of stations and ultimately greater convenience.", "score": 1, "replies": []}]}]}, {"body": "Does anyone have a picture of the Superchargers with two cables;  CCS and Tesla connector?", "score": 1, "replies": [{"body": "https://electrek.co/2018/12/12/tesla-dual-connector-ccs-supercharger/", "score": 2, "replies": []}]}, {"body": "Non investment related but there was a news that the BMW driver took out the charger that was charging a Tesla vehicle, so what's stopping these drivers from abusing the charger for their own car?", "score": 1, "replies": []}]}
{"title": "Tesla launches new solar roof tiles with more power, higher efficiency", "selftext": "", "id": "qkh9qj", "created_utc": 1635782854.0, "score": 300, "upvote_ratio": 1.0, "num_comments": 43, "comments": [{"body": "Definitely explains the insane price hikes in that sector. Glad to see in the article that Tesla seems to mention orders remained strong after the increase", "score": 36, "replies": []}, {"body": "The price is just too high for these things. The break even point for my house was like 19 years :(", "score": 42, "replies": [{"body": "Even when you discount the cost of a normal roof from that?", "score": 15, "replies": [{"body": "That comparison is only useful for replacing a PREMIUM roof like metal, clay shakes etc.. VS the very cheap, very common asphalt shingles it is WAY more expensive than just adding solar panels.", "score": 16, "replies": [{"body": "Thank you. We ended up with a metal roof plus panels. It looks like that was likely the best choice anyway.", "score": 10, "replies": [{"body": "Metal roofs are the shit", "score": 4, "replies": []}, {"body": "Panels and solid roof are still king IMO. More energy, lower price. Solar roof is nice if you care about the premium \"look\".", "score": 1, "replies": []}]}, {"body": "Yeah but dude, you’re getting a premium roof not an asphalt one. It’s actually not overpriced for what it is. Solar roof is superior even to premium roofs in its durability. \n\nI don’t think anyone thinks it makes sense to replace your roof unless it needs it. Solar roof makes most sense on new bulk builds anyway. That way Tesla can spread the cost of system design over more houses and get really fast at installing them. This will do a lot to make the price closer to asphalt + panels.", "score": 9, "replies": [{"body": "Point was more to call out the market for this as a premium product vs the panels.\n\nIt is as unrealistic to say everyone should have solar roof as it is to say everyone should drive the S and the X. It is a premium market solution.\n\nThat message gets lost a lot of the time and that is the only point I was going to make.\n\nA lot of people just say it is cheaper or costs the same without considering the current roof types.\n\nFunny thing is, that in many of the install videos I have seen for solar roof it was replacing asphalt, and it was only incentives / rebaits that pushed the owner all the way to solar roof over panels.", "score": 7, "replies": []}]}]}, {"body": "Agree. Also need to take into account electricity generated and sold/consumed.", "score": 2, "replies": []}, {"body": "‎ ‎ ‎ ‎‎ ‎ It no longer requires a new roof to be installed in order to install the solar roof. Even in the article listed, it states that.\n\n###Interestingly, the new tile datasheet also mentions that Tesla can install the solar tiles over existing roofs.\n\n###It specifies these two roof types:\n\n> + Three-tab composition shingle, single layer\n> + Architectural composition shingle, single layer\n\n*In addition, [this magazine](https://www.finehomebuilding.com/membership/pdf/5614/021214061.pdf) by Fine Home Building states nearly three-quarters of all asphalt roofing sales were composed of Architectural Shingles in 2010.*", "score": 2, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "That makes more sense, Thanks for the correction!", "score": 4, "replies": [{"body": "Sorry I should have been more clear. I asked the question as solar roof is not avaliable in my country yet ( My house build is nearly finished and I did enquire) and was interested to see how the price to building over there (building in New Zealand is a mess and as a result materials are very expensive) compared to nust putting on a solar roof.", "score": 2, "replies": []}]}]}, {"body": "Thank you for pointing this out. Someone thought your friendly update was worth a downvote. Strange behavior. There is potentially a lot of goodness in installation over existing roofs, including: less labor, less materials, less pollution, and - most importantly - lower costs and total price.", "score": 2, "replies": []}]}]}, {"body": "Solar roof is just a wealthy person's product at this point to allow them to produce clean energy, be off the grid and do it fashionably. \n\nIt will take quite a few years till costs come down for it to be economical.", "score": 29, "replies": [{"body": "I think they have to get big builders around the country to implement them in the design/building phase of development. Then it will be a winner. I think you can hide the cost of these really well in the total cost of a home right now. Some of this is happening right now in Austin. I think they should stay away from retail and focus on B2B.", "score": 18, "replies": [{"body": "A lot less hassle dealing with new construction too.", "score": 7, "replies": []}, {"body": "The metal roof my mom just put on was damn near $89k, it was a premium roof, but if Tesla shingles were an option it would have been considered. That same roof was like $20k just 12 years ago. \n\nSo compared to nice roofs, it's price competitive.\n\nThe key is like what you said, get it into the pipeline of new home builds. You already have a crew cost, installation, it can be designed to be easier (less roof protrusions) and it really just has a difference of material cost at that point.", "score": 1, "replies": []}]}, {"body": "Model S/X and Roadster were also that. Gotta start somewhere.", "score": 26, "replies": [{"body": "No complaints from me. Early adopters are the reason the rest of us get amazing tech at reasonable prices a few years later.", "score": 16, "replies": []}]}, {"body": "Tesla has  to hook up with builders.", "score": 2, "replies": []}, {"body": "It does fit into new home construction a little better.  With a drop back to the old pricing I would be interested.", "score": 2, "replies": []}]}, {"body": "Similar for me.  If I had the cash, it would make far more money in the stock market.  Now if you put in the money it would cost to go to a high end roof, it turns into 10 years which makes a little more sense.  I have an asphalt shingle roof now.", "score": 1, "replies": [{"body": "thats what i have on my house. I had a guy from a solar company explain to me that the \"money was not important\", we should install solar for the environment..blah blah... i told him to fuck off, and asked why the company wasnt installing them for free lol. Its stupid to install right now.", "score": 1, "replies": []}]}, {"body": "Wow that is a long payback time.  Also won't the tiles need replacing after around 25 years?", "score": 1, "replies": [{"body": "prob, and better tech will be out so now after it took 18-19 years to pay itself over you get the rewards of doing it all over again!! congrats !!", "score": 1, "replies": []}]}]}, {"body": "Doesn’t matter still can’t get a response about our solar design, with regular panels. I’m assuming I’m not the the only one. I’ve tried three times in the last couple weeks, nothing. Likely will go with SunPower.", "score": 3, "replies": []}, {"body": "Really this is the coolest product they make. If only it would make economical sense as well compared to regular solar. \n\nBut if I'm ever building a house, I'll definitely get these.", "score": 2, "replies": []}, {"body": "Eww.  Electrek.  Now I need to go wash my hands.", "score": -3, "replies": [{"body": "Are you blind?", "score": 4, "replies": [{"body": "Yes.  And literate.  You?", "score": 1, "replies": [{"body": "No. And not triggered.", "score": 2, "replies": [{"body": "I am confused.  The logo on the top right of the linked article is literally “electrek”, the author is butt hurt forever Fred.  What are we talking about again?", "score": -4, "replies": [{"body": "you seem pretty butthurt yourself", "score": 1, "replies": [{"body": "Oh yeah.  Still all sore from that time I badgered Elon into blocking me on Twitter.  Much burning.  So ache.", "score": 0, "replies": [{"body": "Are you a small child?", "score": 1, "replies": [{"body": "Come on, respond! I have to see who wins this Battle of Dweebs", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I think you missed the braille joke. You said you needed to wash your hands...", "score": 2, "replies": [{"body": "I thought everyone here browsed on phones.  Sometimes something icky gets on the screen.", "score": 1, "replies": []}]}]}]}]}, {"body": "Nice gains.", "score": 1, "replies": []}, {"body": "Reduce cost?", "score": 1, "replies": []}, {"body": "Nice", "score": 1, "replies": []}]}
{"title": "Ark Invest analyst says Tesla's robotaxi platforms could drive $9T revenue", "selftext": "", "id": "qknhvr", "created_utc": 1635799883.0, "score": 109, "upvote_ratio": 0.98, "num_comments": 45, "comments": [{"body": "“But the share price is not rising because of autonomy, it’s rising because of the Hertz order.” Actually, the Hertz CEO specifically mentions  autonomy when discussing the tesla deal so…", "score": 23, "replies": [{"body": "Also Elon confirmed the contract isnt signed", "score": 3, "replies": [{"body": "Why would Hertz sign a contract for no priority and no discounts?  Just order individually and keep the optionality", "score": 2, "replies": []}]}]}, {"body": "$3000 price target only includes 50% of FSD “likely“ being achieved", "score": 13, "replies": [{"body": "50% likelihood of FSD being achieved", "score": 7, "replies": []}, {"body": "A lot of price targets don't include energy, FSD, robots, machine-learning as a service, software revenue, charging revenue, HVAC, etc. I'm sure there are like 5 other things that I didn't mention, and if the ones I did, only HVAC is somewhat unlikely.\n\nBy 2030, I'd honestly be shocked if the stock wasn't at least 10K, if not higher than 20K. There's so much upside in the company that the upper bound is really difficult to guess.", "score": 2, "replies": []}, {"body": "If they fail fsd then market cap should go below 300 billion? Cause then they have millions of cars that can't compete with other self driving cars?", "score": -3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Waymo, cruise, argo, mobile eye", "score": -8, "replies": [{"body": "So none?", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I wouldn’t say it’s their main hype, but the belief is that they can achieve it at scale first, not first period.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It depends on who you ask. Some people do put a lot of weight on FSD, but due to the unknowns I choose not to put too any stake in it, as exciting of a possibility as it is. There are plenty of videos out there that I believe justify a bullish outlook on the company, even at the current price, even with no FSD. I would recommend the interview on hyperchange about return on invested capital.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "And I gave you an example. Return on invested capital. Here’s another one: gross margin. What about no competition? Operating leverage? Or by hype did you mean something for idiots that don’t know how investing works to get excited for?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">\tDo they have other invested capitals then crypto? Think i've missed that.\n\nTake the time to actually watch the video I suggested on the subject, since you clearly just have no idea what I’m talking about. Do you actually want to learn the answers to the questions you asked, or do you just want an excuse to do a cynical rant to an internet stranger?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I ignored everything else because it had nothing to do with what we were talking about. Be better at arguing.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I never said they did", "score": 1, "replies": []}]}]}, {"body": "Also, I didn’t direct you to that video because I didn’t want to bother explaining to you the dictionary definition of return on invested capital. The video goes in depth about the details of why this metric is important to Tesla, why Tesla is doing so well in this area, and how that alone justifies its valuation. Again, if you had come to this sub to learn like the rest of us you might have done so, but instead your objective is clearly just to pick an argument.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Exactly. The short term focus is so painful. \"Tesla shares went up today for no reason!\" . Seriously?\n\nThe stock market is so complex, and these talking heads are trying to convince us that 1+1=2? Absurd. Mass media has almost nothing to offer to its viewers.\n\nGreat commentary by Will though. Smart guy.", "score": 14, "replies": [{"body": "> are trying to convince us that 1+1=2?\n\nit does, except for very large values of 1.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "It's like they never studied math, come on they're analysts, wtf", "score": 1, "replies": []}]}]}]}, {"body": "Could anyone clarify what it means to \"drive 9T revenue\". Like I'm 100% certain that is not annual revenue so what is it suppose to be?", "score": 7, "replies": [{"body": "For comparison, the entire global tax cab market is valued at $68 billion. \n\nHe said $9 trillion within the next decade....\n\nDid he mean just from robotaxi fees? Or, is he including: subscriptions, insurance, fleets, etc. \n\nEither way, he wasn't very convincing and no one questioned him. Maybe you should get a job at CNBC since you asked the important question and they're apparently totally useless.", "score": 16, "replies": [{"body": "Yeah confused as well, global truck freight TAM is also projected to be like $3T in 2025, so I'm struggling to correlate that number with any annual revenue.", "score": 7, "replies": [{"body": "Good thing about Ark is, they publish all their research and papers free for anyone to see.", "score": 5, "replies": [{"body": "Can you point me to this? I did follow up on their website and could not find a detailed breakdown that wasn't in an article format with lots of fluff.", "score": 2, "replies": [{"body": "It's the long form equivalent to: \"just trust me bro\".\n\nhttps://ark-invest.com/articles/analyst-research/tesla-price-target-2/\n\nThough personally I do see global truck freight TAM increasing drastically if FSD is complete. Ultimately, there's market to take from train and ship as well. Also, if I could order an Uber Eats that costs ~$1/mile and I didn't have to tip, I would order from that app every day. So present day TAM and future FSD world TAM are two entirely different worlds.", "score": 1, "replies": []}]}]}]}, {"body": "Good thing about Ark is, they publish all their research and papers free for anyone to see.", "score": 2, "replies": []}, {"body": ">For comparison, the entire global tax cab market is valued at $68 billion.\n\nwrong market. Closer to a more expensive smart phone market.\nSub based, most passenger vehicle drivers will want FSD or will sell their car and use taxi service.", "score": 2, "replies": []}, {"body": "> For comparison, the entire global tax cab market is valued at $68 billion.\n\nDoes include all ride sharing, airport vans, etc? Or just \"taxis?\"", "score": 1, "replies": [{"body": "[Includes ridesharing](https://www.globenewswire.com/news-release/2021/06/28/2253982/0/en/Global-Taxi-Market-to-Garner-120-89-Billion-by-2027-Allied-Market-Research.html)", "score": 2, "replies": [{"body": "Yea so I'm not sure I see the massive windfall that robo taxis would allow, UNLESS- you see millions of people decide not to buy cars and just robo-taxi.  I can see that happening in large cities like Los Angeles, San Fran, and NY.", "score": 1, "replies": []}]}, {"body": "The logic here is that linear price decreases result in exponential demand increases. The idea is that if price drops by half and rides increase by 10x, then net the total revenue increases by 5x.\n\nIt’s not really clear what the demand curve is, but it could theoretically open up lots more travel. Just imagine if you could sleep in a robotaxi and wake up across the country. You could have a nice big bed, stop for sights, all without the trouble of boarding the place. Plenty of people would choose to make cross country trips if transport were close to free and you could relax instead of manually drive.\n\nThe other major idea is that with autonomous electric trucks, you drop the cost of fuel massively because electricity is cheaper than fuel, no human driver so less accident risk, don’t need to pay the human, no bathroom breaks.", "score": 1, "replies": []}]}]}, {"body": "Good thing about Ark is, they publish all their research and papers free for anyone to see.", "score": 2, "replies": []}, {"body": "I'll try\n\nThere are currently 8E9 of us.  In the future that will be 9E9.  \n\nSo $9E12 annual revenue / 9E9 people = $1000 USD/person/year spend on Tesla services.  \n\nThe average US household spends $9,000 to $12,000 on transportation.  So probably $3,000 to $5,000 average/ US person.  So $2000 on robotaxi outlay with 1/2 of that going to Tesla is the craziest 1st principle robotaxi forecast you can get.", "score": 2, "replies": [{"body": "Out of those 9 billion a few billion get less than $1000 in yearly income, and most of those 9 billion do not spend thousands of $ on transportation.\n\nSo you calculation makes absolutely no sense.\n\nMaybe if you take the richest 15% of the world, but then everyone of them would need to be spending $7-10k on Tesla robotaxis. Lol..", "score": 4, "replies": []}]}, {"body": "Sp500 annual revenue is around $15T.... Or it's just ARK being ARK, spitting out big numbers not backed by logical reasoning.", "score": 1, "replies": []}]}, {"body": "Any Waymo, Cruise and Uber who are geo-fencing cities and about to roll out city specific level 4/5 robo-taxis in 2022, are not going to compete....", "score": 3, "replies": [{"body": "lol Waymo is still manually building each car. breaking them down by hand and adding all the gear.\n\nSo they will either have to start building cars OR partner with an automaker and automatically lose their chance of becoming the Apple of self driving. (lose all their margin)", "score": 1, "replies": [{"body": "On the other hand they can change things faster. They don’t have a 100k legacy cars they need to support if they want to make some hardware changes. Waymos plan has always been to partner with manufacturers.", "score": 1, "replies": []}, {"body": "LOL.  You obviously haven't been paying attention.  They were aways going to partner.  Presently using Jaguar I-Pace cars in San Fran.", "score": 1, "replies": []}]}]}, {"body": "I am 100% sure ARK will increase the base price target from $3000 to $4000 next year after EV tax credit. Tesla's profit margin will be very close to Apple's in few years. Then, just the car business alone will be more than $3K. Robotaxi is mother of all profits, priceless.", "score": 2, "replies": []}, {"body": "These calls are idiotic. I’m bullish on Tesla in the next decade. I think total revenues reach around 6-800B by end of decade with an apple like price to sales ratio possible. But I think it’s too early/too unsolved to start working any autonomy into share price. I like to feel confident their approach to autonomy is what will yield results…but it’s still too unsolved to still at the moment to really say for sure. And with Anything so brand new and challenging it can be virtually impossible to put a reliable time table on. You just don’t know what you don’t know.", "score": 2, "replies": [{"body": "I agree ARK's numbers are pretty wacky, and there's no need to include FSD in the equation just yet when it's not done, but the right number is hopefully higher than 600B-800B. 20M vehicles with $30,000 ASP by itself is already $600B. Considering Tesla's other tangible businesses, my hope is that they're above $1T in sales. An Apple-like P/S ratio would put them somewhere at $3T to $9T in market cap, which is where I have them through other means (DCF).\n\nThis is why Tesla isn't so much a FSD story as it is a manufacturing execution story. I don't assign any value to FSD beyond simple slight boosts to ASP, but I do believe in their ability to reach their 20M/vehicle a year goal and their energy roll out. While FSD is nice, there's actually no point in projecting it. I believe it was Gene Munster who basically said that it's crazy that people are even trying to assign values to something that would be such an immeasurable paradigm shift. No one, bull or bear, can assign value to robotaxis. Additionally, it's completely impossible to know how close Tesla is to robotaxis at present. It's a complete pointless and futile exercise to assign some arbitrary value to that.", "score": 1, "replies": [{"body": "Yeah I was thinking 6-800B at 5 p/s so 3~4T market cap by 2030. So still a good return from now. \n\nI know it’s their goal, but I don’t think 20M vehicles is possible by 2030. Over the next 18 months, they’ll ramp 2 factories and add to current factories to bring their mfg capacity to around 2.5 million vehicles. That’s by mid 2023. That would mean they’ll have to add 15~30 brand new mfg plants in 7 years. That seems unlikely, nearly impossible. The demand may be there and they may get to 20M eventually, but it’ll certainly take longer. And with so much shake up coming to the auto industry in the next decade I think it’s not practical to look out much further than that.\n\nSo approx 10M vehicles makes more sense to me. 40k asp. So 400B from auto and my guess is 2~400B from energy + other business. Mostly energy.", "score": 1, "replies": [{"body": "Completely fair, though I disagree with the 15-30 plants to get to 20M. Given Tesla's stated plan to potentially produce up to 250GWh at Giga Berlin, I think the planned long term steady state per plant is somewhere around 2.5M vehicles/year. Obviously, Fremont will never get there. Therefore, I'm hoping they only need like 5 more Gigafactories and just scale from there. They'll have smaller plants here and there, like the \"Megafactory\" they set up.\n\nMy guess is that they will build another batch of ~3 factories (US East, Second China, UK/India?) almost concurrently within the next 4 years and then I have no idea from then on.", "score": 1, "replies": [{"body": "Yeah I mean it’s possible. I know their working hard on mfg and process. But as of right now,  the largest auto mfg plant in the world has annual output limit of ~815,000 vehicles. So Tesla would have bring online 5 factories each of them 3 times the size of the current largest in world. And basically do that concurrently. Like I said I think they’ll be very busy adding capacity but a 10m vehicle production rate by 2030 seems like an absolute ceiling from my perspective", "score": 1, "replies": []}]}]}]}]}]}
{"title": "This week's hot stocks, high IV list, top & worst performers of the week.", "selftext": "Hello fellow investors,\n\nI've been contributing weekly providing insights into tickers that are taking off and overly hyped or have some opportunities to buy the dip (or sell cash-secured-puts). Saw some good action this week in various names, lets take a look.\n\n&#x200B;\n\n# Too Hot To Touch\n\nA couple names come to mind this week after trading absolutely ridiculous ranges. These names are currently in my “too hot to touch” category even as enticing as all the screen-shotted gains popping up on Reddit and Twitter might be. The two tickers are Bakkt (BKKT) and Lucid Motors (LCID).\n\n&#x200B;\n\n**Bakkt (BKKT)**\n\nhttps://preview.redd.it/ta1ssmmlaww71.png?width=2556&format=png&auto=webp&s=f82f6881fd07439b7de6f5afd2b0630467ab895a\n\n&#x200B;\n\n**Lucid (LCID)**\n\nhttps://preview.redd.it/q1nybwufaww71.png?width=2554&format=png&auto=webp&s=c1c776987cb74b45ce8ab4ce6413ca8c57ad1ef5\n\nBoth of these names have entered into my signature “red zone” areas where stock price has appreciated over 50% in a short amount of time. BKKT is actually up roughly 300%, while LCID is up nearly 80%. Not to say these names aren’t going to be solid trades in the future, but my opinion, and what I am doing, is to let them cool off rather than FOMO at the top. Preservation of capital is the name of the game.\n\n&#x200B;\n\n# Best & Worst Performers Last Week\n\nhttps://preview.redd.it/s5gmeecmaww71.png?width=1232&format=png&auto=webp&s=a09687d9c4d917aa0b216b16221799e2bf098f9b\n\nhttps://preview.redd.it/o2ypximmaww71.png?width=1238&format=png&auto=webp&s=b6551e025b7dbab6dfc949e3cd7c1c2504f7c622\n\nHere’s a list of stocks that performed abnormally out of their 90-day trading range. The list includes my own personal list of “popular” stocks that are usually small cap or greater in size and more on the well-known side.\n\n&#x200B;\n\nI use this list to either:\n\n* Buy the dip (or sell CSPs) on stocks that have had an unusually bad performance.\n* Take some off the table from the top performers if I am already holding a position.\n\n&#x200B;\n\n&#x200B;\n\n# High IV List\n\nhttps://preview.redd.it/2m6gr3bnaww71.png?width=1162&format=png&auto=webp&s=8546bb8b203e5a693e6cf8e262c5881eaa1da271\n\nIn the following sheet of high IV stocks I included the Enterprise Value (EV) to Market Cap (MC) (in the “EV/MC” column) because it allows me to see how “risky” the play is. In short, Enterprise Value is a measure of a company’s total value and is used as a comprehensive alternative to market capitalization. The average is usually 1:1, but a higher EV/MC signifies the company’s health is OK.\n\n&#x200B;\n\nI’ve also included RSI to see overbought/oversold levels and the “ATM 30D IV” is the 30-day IV for the ticker, in percentage. The list is sorted from highest IV to lowest.\n\n&#x200B;\n\n&#x200B;\n\n**What do I like from this list?**\n\n* AMC: Earnings are coming up Tuesday after market close. Although the AMC share price has been in limbo for some months now IV is still very high (113%). The risk of poor earnings is always there, but the amount of premium to collect will off-set some losses should the stock tank. Nov 19, $31 strike puts still offer solid premium and provide cushion for over 20% decline from the current share price.\n* LILM:  Lilium is a transportation company that develops electric Vertical Takeoff and Landing (eVTOL) aircraft for use in high-speed air transport system for people and goods. This is somewhat of a new industry and a lot more can be said about the company instead of what I’ll write here in two sentences. I’m looking to build my position through CSPs and hold shares if assigned. After a recent dip IV has spiked and is sitting at 105%.\n* FVRR: Fiverr had a down week last week due to their competitor Upwork (UPWK) announcing poor earnings results. IMO this is a risky play, but FVRR is a leader for the gig economy industry and entering a starter position may not be a bad play. They will report earnings in two weeks time.\n* GLBE: Growth stock Global-E is trading back to June levels without much change in fundamentals. I will be using this dip to sell CSPs while IV is high. They report earnings in two weeks.\n\n&#x200B;\n\n# Hot Stocks Under-The-Radar\n\nA couple stocks were picking up momentum by means of social chatter this week. What I found were Revlon (REV) and Mountain Pass Materials (MP).\n\n&#x200B;\n\n**Revlon (REV)**\n\nhttps://preview.redd.it/uc2sodznaww71.png?width=2578&format=png&auto=webp&s=17b398a14097ab94b747d60a5a982c14f8fb1b84\n\nI caught a slight uptick in Revlon chatter this week. Nothing substantial, but when I looked at the chart I saw the consolidating base it formed on a decrease in trading volume. I wouldn’t bet anything big on this play as I haven’t done my DD on this company, but I might enter a starter position before they report earnings in two weeks.\n\n&#x200B;\n\n**Mountain Pass (MP)**\n\nhttps://preview.redd.it/pqv525goaww71.png?width=2578&format=png&auto=webp&s=1dfa1c9a411b81e338110ad16de0da8f3663341c\n\nMP dropped last week due to a short report released by Grizzly Research. I read the report and while they do offer some insight as to why they think this company is not what it seems, my opinion is that they are wrong. MP was down almost 20% at one point after the report was released, but has since made a recovery and ended the week -10%. Short interest for MP stands at 12% and has the potential for a short-squeeze should the company produce something substantial at earnings.", "id": "qk4g4m", "created_utc": 1635733745.0, "score": 194, "upvote_ratio": 0.94, "num_comments": 41, "comments": [{"body": "Great read", "score": 14, "replies": [{"body": "Thanks my friend", "score": 9, "replies": []}]}, {"body": "The goat. As always, good stuff dude", "score": 10, "replies": [{"body": "Thank you brother 👌🏻", "score": 5, "replies": []}]}, {"body": "Nice job! Been selling cc for a long time now, never better money…", "score": 16, "replies": [{"body": "What’s your favourite ticker? For selling CCs", "score": 9, "replies": [{"body": "Right now, amc….see my posts, 12-15k per week.", "score": 5, "replies": [{"body": "What strikes and how long out you doing?", "score": 3, "replies": [{"body": "Weekly…only say $3-$4 out depending on Greeks", "score": 1, "replies": []}]}]}]}]}, {"body": "Wouldn't touch Lilium with a barge pole. Only possible jurisdiction they'll get regulatory approval is Europe. Their tech is above acceptable noise thresholds and will never get regulatory approval in the U.S.  Basically, the design is fatally flawed.", "score": 6, "replies": []}, {"body": "WISH, FCEL & WKHS are my CSP-the-DIP plays.\n\nThanks for your posts! Look forward to moar!", "score": 3, "replies": []}, {"body": "Always look forward to these. Very brief and useful. I appreciate you taking the time to do a little research about the company and warn about earnings. Please never stop making posting", "score": 3, "replies": []}, {"body": "Amc and gme premiums are getting lower by the week. Been selling otm cc’s and otm puts weekly for 8-9 months. The volume and premiums are drying up and making it almost not worth the risk. Stocks are trading sideways or retreating and lower premiums are making me rethink holding as much of both stocks", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Count on the upcoming NFT announcement to do that for you bud. Personally think we'll get it before the weekend, possibly on Thursday after market close.", "score": 2, "replies": []}]}]}, {"body": "Would hate to end up owning most of these tickers! 🤣", "score": 2, "replies": []}, {"body": "Specifically, which assertion(s) in the Grizzly Research report do you believe are false, and what contradictory evidence do you base your opinion(s) on?", "score": 1, "replies": []}, {"body": "Some fairly solid stuff :)", "score": 1, "replies": []}, {"body": "AMC closed Friday at 35.37. A 20% decline would put you on the 11/19 28p with 1.06 ask premium. did you mean 10% to 31 or were you referring to 28p ? \n\nJust to clarify your research is fantastic and very insightful. No disrespect meant. I’m curious which put you’re thinking about.", "score": 1, "replies": [{"body": "He said 11/19 $31 P\nThat is currently going for $1.30. I’m assuming when the lost was written that allows for the price of the stock to go below 20% it’s current price before it was a “loser”. He was correct with post, but I believe it does have a shot to go low after a bad e/r", "score": 2, "replies": [{"body": "I understand what you’re saying. But the post states 20% decline from its current price which would be 28.30. The 31p with a 1.30 premium is 29.70. You’d be in the red, hence my assumption was the 28p which is where you’d need to be to protect against the 20% drop to 29.70. Ehh splitting hairs. We both understood it. Thanks for elucidating it better than I did 👍", "score": 1, "replies": []}]}]}, {"body": "Clearly you are doing a lot of work.\n\nOne thing.I find curious is that for posting in theta gang, pretty much most of this is.useless.\n\nYou're using social sentiment and lagging indicators to make options.plays? You're doing it the hard way. It's all about the Greeks and literally nothing else.\n\nI get that you talk about high IV but that almost seems like a side note to the other points.\n\nThis would be a lot more meaningful on other trading subs that were not focused on statistics as.detived by the Greeks\n\nNot that that's the ONLY way there is, it's just the ONLY thing that's necessary.\n\nAll this other TA and sentiment crap is definitely for people more interested in legendary holding. Which has its place.\n\nI almost feel bad about this, but you also started off by calling us investors. Which is also a.completely different topic that also doesn't land here well.", "score": -9, "replies": [{"body": "I appreciate your critique and feedback.\n\nOf course sentiment is a lagging indicator, however, I’m sure there are tons of guys selling options on the “too hot” stocks which is crazy risky. That’s why I highlight them.\n\nThe rest of the post is dedicated to high IV plays that might be at a favorable RSI or on a short-term dip.\n\nMost people here probably know the main Greeks with delta, Theta, and Vega, but from my own experience the more you calculate every single Greek on the trade the more you are prone to make a mistake.\n\nThe market isn’t about making the perfect play every single time, but more about managing risk to reward. In the case of this post, it’s guided towards “do the technicals look right? Is IV enough to collect premium? Do I like the stock if I need to hold for 6 months?” Which is all leaning toward the wheel strategy, rather than strictly theta gang.\n\nThanks for taking the time to make a thoughtful critique.", "score": 20, "replies": [{"body": "idk what's going on here, a lot going over my head. But I like it", "score": 2, "replies": []}, {"body": "Good stuff thanks for the response.\n\nI'm admittedly a little sensitive to a few things in theta gang.\n\nThe first being I'm blown away by the trades some people are taking and having no clear understanding of what they are doing. I realize this happens anyway, but when faced with many different subs to start in, r/options at least includes everything whereas around here its a narrower focus. I usually jump on things that fall outside that focus to drive home the difference. \n\nSecond is really emphasize the Greeks over everything else. Again, hyper on topic. There is so much misinformation here about how they work and interact and or people that don't really even know anything or much about them. Again, totally fine for r/options but seems completely out of place for this more narrow focused group.\n\nAll that being said....\n\nClearly there are many different ways to trade, how to get your DD, what you pay attention to etc...\n\nPersonally I think that what is so beautiful about options is that all the trash leave, is it going to moon, ohh look it's at a magic line and let's hope and pray bullshit that is almost required for anything other than buy and hold stocks, can completely be thrown out with options.\n\nI mean, you can still use options like you use stocks, and I have some holdings in options that might look more traditional, but TRADING options doesn't require any of it. \n\nWhere everyone else has to back up to TA and draw a bunch of complicated shit on their chart to have any idea, God has actually seen fit to endow us with the direct answers in the Greeks.\n\nThey literally contain all the risk/reward data and tell you exactly what is happening.\n\nI true to push them as hard as.possoble.\n\n(Also i suspect you are not learning anything new here and im really trying to illustrate the point for anyone else following along.)\n\nCheers.", "score": -1, "replies": [{"body": ">Where everyone else has to back up to TA and draw a bunch of complicated shit on their chart to have any idea, God has actually seen fit to endow us with the direct answers in the Greeks.\n\nbecause the geeks only take you so far as to offer you an increased buffer on riskier plays. You see, collecting more premium is fine but when your stock goes down 50% you can keep telling yourself you are fine with the 10% collected but we both know it's bs. TA at the minimum can tell you are going against trend and your risk is actually higher than what the market predicts.", "score": 2, "replies": []}]}, {"body": "IM there selling a 37 put on lucid lmao", "score": 1, "replies": [{"body": "37 is probably too high IMO, I think it will come back down to around 28-30. \n\nAlthough premarket right now it’s almost at 40.\n\n\nEdit: I’ll add I’m selling $28 puts", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Google.", "score": 3, "replies": []}, {"body": "indicator that sorta measures how over bought or over sold a stock is", "score": 1, "replies": []}]}, {"body": "fuck IV.  learn not to be the loser.  $coin $300 strike puts this week.  dont hold through earning, which is 11/9.  then reload.", "score": -3, "replies": []}, {"body": "CLNE on high IV list?? I’ve had this stock for a long time. I have 150 shares in a taxable accounts and 100 in my Roth. I sell monthly strangles because this thing does not move. If it goes above 10 I will be ecstatic.", "score": 1, "replies": []}, {"body": "I’m so glad I joined your mailing list 🙏🏼", "score": 1, "replies": [{"body": "Where's the link? Can I join?", "score": 1, "replies": [{"body": "I'm not sure if he posts it on here but look for Sizzling Stocks, that's where the content above has come from", "score": 1, "replies": []}]}]}, {"body": "Best morning post! Thank you", "score": 1, "replies": []}, {"body": "AMC issued a correction just now - they will report a/h next week on 11/8", "score": 1, "replies": []}, {"body": "Good work right here", "score": 1, "replies": []}, {"body": "“ Nov 19, $31 strike puts ”\n\nI’m on TD and I can only see a $33 strike…where is anyone seeing a $31 strike?", "score": 1, "replies": []}, {"body": "What is that volume indicator on the right?", "score": 1, "replies": []}, {"body": "How’s that MP short squeeze looking now?", "score": 1, "replies": []}, {"body": "PayPal owns Venemo and in 2022 Amazon will begin accepting Venemo as payment at checkout. Amazon the largest retailer in the world will begin accepting Venemo. PayPal stock is a bargain right now and set to soar. Don’t get caught waiting get it while it’s a bargain buy", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "qk6pya", "created_utc": 1635742265.0, "score": 13, "upvote_ratio": 0.85, "num_comments": 41, "comments": [{"body": "I Wheel about 40 to 60 stocks a week.  I try to get 0.5% a week.  I wheel mainly Dow Jones 30 Stocks and blue chip companies.   I feel the market is overvalued right now… rather have a smaller return but have safer stocks.  I get assigned about 10% of the stocks I selected. \n\nMy return including dividends has been 0.68% per week after 6 weeks.", "score": 8, "replies": [{"body": "Interesting plays. Managing that number of stocks is probably out of my *wheel*house (don't kill me pls), but your reasoning makes sense.", "score": 8, "replies": []}, {"body": "Would you mind sharing some knowledge? \nDTE, what are you looking at when setting puts/calls. Thnx", "score": 1, "replies": []}]}, {"body": "I’m the minority and wheel only one stock. It’s been going well.", "score": 11, "replies": [{"body": ">!GME!<", "score": 7, "replies": [{"body": "Bingo!", "score": 4, "replies": [{"body": "Do you wheel weekly or monthly? I like the idea of weekly because you have more flexibility to improve your position if things go against you and technically offers the highest rate of return (generally speaking), but I'm definitely watching tickers more than I'm used to doing weeklies and it's getting a little old.", "score": 1, "replies": [{"body": "Exactly. Only weekly.", "score": 2, "replies": []}]}]}]}, {"body": "Reading this thread I realize I also am in the minority in dealing with one stock, I figured most would be playing one stock/index at a time. My setups are particularly short lived (usually 0DTE, at max I only deal with 5DTE) so that makes it harder to be particularly diversified.", "score": 3, "replies": []}, {"body": "I wheel other stocks, but GME has been my bread and butter.", "score": 3, "replies": []}]}, {"body": "I have 5 stocks going right now. If I had more money I’d diversify further. I just treat it like diversifying normal stocks (20 is the goal). The stocks I pick are high implied volatility and are either flat or with an uptrend and will return at least 50% per year.  \n\nHalf of my portfolio is towards wheeling because so far it’s made me more money than just holding stocks but I do realize the stocks I wheel have a chance of going completely belly up.", "score": 5, "replies": [{"body": "Yeah, that makes sense. I just made a quick spreadsheet to see how much I would need to make per wheel (given no reassignment or just flat gains). What is your DTE like? Weeklies? 30days? 45days?", "score": 2, "replies": [{"body": "Mostly 30 days. Some weeklies.", "score": 1, "replies": []}]}, {"body": "5 is a great number. I would rather know 5 really well than 15-20 ok", "score": 1, "replies": []}]}, {"body": "I have UAA (doing terrible), MPW (doing ok), LCID (doing great), CLNE (extremely consistent, rather boring), and HUT (printing machine) \n\nApparel, REIT, EV, energy, Bitcoin miner \n\nIm watching CHPT; I was selling puts on it, but it was been doing well, steadily increasing. I should have gone ahead and bought instead of puts, but I didn’t. Instead I’m going to buy a LEAPS and try PMCC.\n\nEdit: my cost basis for above positions is about $10,000 out of my total $60,000. Everything else is VTI, VNQ, VYM, VYMI, a few Fidelity mutual funds, and some other random things.", "score": 3, "replies": [{"body": "Ahh, another UAA bag holder! You have good taste! Im in at $22.50 - CSP got assigned. It’s had a modest uptrend the last few days, and I’m hopeful earnings will pull it up enough that I can sell for a profit before the Fed speaks up (I am slightly bearish on the Fed announcement, but who knows what to expect in this market…).", "score": 2, "replies": [{"body": "My cost basis is $25.49, just terrible timing on my part. Absolutely terrible.  Covered calls have it down to $24 though. I’m also waiting out for earnings.", "score": 2, "replies": [{"body": "Well then! Glad we held to earnings! Good job to us :)", "score": 1, "replies": [{"body": "Lol, came here to say the same thing!", "score": 2, "replies": []}, {"body": "And it’s still running today. I have a $25 strike call exp 11/19 I’m going to either roll up a smidge if UAA is still trading above $25, or just let it go at $25. Either way, I’m going to part ways with it. \n\nAlso wanted to say I didn’t realize UAA also has UA? UAA is the Class A shares? Idk the difference between the two, or if it matters?", "score": 1, "replies": [{"body": "Well done! I paper-handed yesterday (my name does not check out…). :p\n\nMy understanding is that UAA allows voting rights, which is why it’s a little more expensive than UA. However, the options volume is much higher for UAA, so that’s preferable for options trading. The price movement is the same for both.", "score": 2, "replies": [{"body": "Great, thank you for clarification!  And congrats! If I did not have the call I probably would have also.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "I trade 20 to 30 stocks across most major sectors except pharma as it is unpredicvtable.\n\nThis link explains the sectors and you can look for the best or at least top ones from each to research.  It is pretty simple really . . . \n\n[https://learn.stash.com/the-stash-way-diversify-by-sector/](https://learn.stash.com/the-stash-way-diversify-by-sector/)", "score": 3, "replies": []}, {"body": "> I'm honestly getting exhausted trying to think about how to diversify\n\nSPY", "score": 2, "replies": [{"body": "> I've been mostly wheeling MARA and it's been working out pretty well so far, but it IS volatile and I rode those dips earlier this year. I'm also currently in a -50% wheel on RIOT,\n\nThose 2 companies are in the same sector.  If that's all you're running, that's terrible diversification.\n\nDisclosure: I'm long puts on MARA and RIOT.  Those have been part of my hedges.", "score": 2, "replies": [{"body": ">If that's all you're running, that's terrible diversification.\n\nyep i agree 😂. So i'm trying to expand my horizons so to speak.", "score": 1, "replies": []}]}]}, {"body": "I don't wheel, but I do use indexes as underlying to avoid the kind of losses you are taking on RIOT, for example.", "score": 2, "replies": []}, {"body": "I am wheeling five stocks right now. Four are information technology (AMD, APPS, TTD, NET) and one is retail (ASO). 🎡", "score": 1, "replies": []}, {"body": "I currently wheel three stocks at a time. Once I gain more capital I want to diversify even further. It is always good to not put all of your eggs into one basket in case the stock price becomes volatile because of news.", "score": 1, "replies": []}, {"body": "I got burned w EVs (held two diff positions) then airlines.  I’m aiming for more diversification and safer stocks now. Went w Snapchat which has done well all year for CSPs - only to watch it crash. I’m rethinking my theta activity now. Somehow I’m not good at it.", "score": 1, "replies": [{"body": "It's really just the positions you're choosing I think. EV's are hype/long term plays other than TSLA. Airlines are still suffering from covid. SNAP is like a baby social media platform in terms of fundamentals and long term stability. Just pick fundamentally good companies that did well before, during, and will continue to do well after the pandemic is \"over\"", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Still deciding. When the drop is so big it can take forever to recoup w CCs.  I may just cut my losses given I’ve gotten stuck w other stocks this way.", "score": 1, "replies": []}]}]}, {"body": "Look up how stock beta works and consider getting into two positions at the same time if you want to stay “neutral” to the market.", "score": 1, "replies": []}, {"body": "Two stocks", "score": 1, "replies": []}, {"body": "I have 4 right now, 3 big ones. I used to have one, trying to diversify more even though it’s been working great so far. Have never gotten assigned yet and would not sell CC’s unless they’re weeklies", "score": 1, "replies": []}, {"body": "Wheeling about 6, looking to maybe get to 10 by EOY", "score": 1, "replies": []}, {"body": "Just 2 stocks , 1 sell CC other for CSP.\n\nDoing it for few months, i can say its working after a successful year, but so far working fine.\n\nSold CC on SOFI and CSP on SAVA.\n\nI'm OK with 50%+ annual return, but so fay my return is about 100% but its just few months.", "score": 1, "replies": []}, {"body": "I'm wheeling about 4 stocks, selling weeklies.", "score": 1, "replies": []}, {"body": "1 oil and gas $RIG\n1 ev battery $MVST\n1 cybersecurity $BB\n1 retail $EXPR\n1 tech $ANY\n\nNo major indexes yet. Still growing the acct.", "score": 1, "replies": []}, {"body": "I wheel QQQ and SPY ,I assume is enough diversify. \nSometimes AAPL.", "score": 1, "replies": []}, {"body": "Learning how to diversify shouldn't exhaust you.  If you're going to play with options then you should have the time and energy to research and educate yourself.  If you can't, then maybe you should just put your money in the S and P 500 or hire a broker to invest for you.", "score": 1, "replies": []}]}
{"title": "I now have two accounts with 7 fig $TSLA gains 🚀🚀", "selftext": "", "id": "qkexqi", "created_utc": 1635776167.0, "score": 394, "upvote_ratio": 0.9, "num_comments": 44, "comments": [{"body": "I do not", "score": 130, "replies": [{"body": "Nice me too!", "score": 22, "replies": []}]}, {"body": "Good job and fck you. Not jelly.", "score": 37, "replies": []}, {"body": "based average cost 1.6m. and that just play money", "score": 34, "replies": [{"body": "Selling options -> buying more shares on dip fucks up my cost basis, unfortunately.", "score": 16, "replies": []}]}, {"body": "Congrats. Fuck you, but also, congrats", "score": 16, "replies": []}, {"body": "I too could become more rich if I were rich", "score": 15, "replies": []}, {"body": "Congrats and Fuck you\n\n\nCongrats and Fuck you", "score": 10, "replies": []}, {"body": "Motherfucker out here writing 17 CCs for 1.5k a week", "score": 7, "replies": []}, {"body": "Fuck you capitalist pig", "score": 27, "replies": []}, {"body": "Cash out and call it a retirement [yes I know we don’t do that here]", "score": 4, "replies": [{"body": "I really should, but I like my job. I'll do it and ride TSLA until I don't, I guess.", "score": 8, "replies": []}]}, {"body": "Congrats. I am almost there with my gains from $TSLA.", "score": 5, "replies": []}, {"body": "There is a bug in the UI. They have a “close position” and an “exit strategy” button.", "score": 3, "replies": [{"body": "Not sure what they do tbh", "score": 1, "replies": []}]}, {"body": "hey I have something to tell you\n\n\n\n\n\nfk u", "score": 2, "replies": []}, {"body": "This guy has so much money that he pays 260$ or something to buy 1100 calls. Hahahahahahahahaahha FOMo is real", "score": 2, "replies": [{"body": "Down 50% on them at some point", "score": 2, "replies": []}]}, {"body": "IRS be like \"Heeello friendo. I'll be here when ur ready!\" 😋", "score": 0, "replies": []}, {"body": "Alternate title: I owe 7 figures in capital gains to the IRS", "score": -2, "replies": []}, {"body": "Nobody likes a show off. Fuck you", "score": -3, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|1 year ago\n**Total Comments**|98|**Previous DD**|\n**Account Age**|7 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=qkexqi)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=qkexqi)", "score": 1, "replies": []}, {"body": "How is trading on the Chase app ? I have an account but never traded on it.", "score": 1, "replies": [{"body": "It’s pretty terrible. But IRA so it’s fine and it earns me private client privileges.", "score": 6, "replies": [{"body": "I’ve been debating moving mine to chase as welll…good to know", "score": 1, "replies": []}]}]}, {"body": "ahh so you're the reason I don't have a 7m tesla account, I see, I see....didn't you get the memo we are all suppose to have only one? hand it over now, mister.", "score": 1, "replies": []}, {"body": "Haha that second broker is such trash.", "score": 1, "replies": []}, {"body": "You beautiful son of a bitch", "score": 1, "replies": []}, {"body": "IBKR pro baller", "score": 1, "replies": []}, {"body": "I've got $137 so yesh", "score": 1, "replies": []}, {"body": "You’re doing it all wrong… your numbers aren’t in red", "score": 1, "replies": []}]}
{"title": "Elon Musk is my daddy $TSLA", "selftext": "", "id": "qknftf", "created_utc": 1635799724.0, "score": 357, "upvote_ratio": 0.92, "num_comments": 49, "comments": [{"body": "Hell of a cost average. Good work.", "score": 63, "replies": []}, {"body": "Congrats and a heart felt fuck you", "score": 38, "replies": []}, {"body": "Wow good for you…held it for 2 years! Well worth it!", "score": 21, "replies": [{"body": "Bought my first share in 2016. But guess what during March of 2020 during Covid crash tesla was equivalent to my average cost. That’s when I bought most of my position after seeing my gains go to almost negative.", "score": 31, "replies": []}]}, {"body": "Damn OP when did you buy this? Wish I had invested in my teens", "score": 12, "replies": []}, {"body": "You haven’t averaged up?!\n\nLOSER\n-\nYou’d be a millionaire already…\n\n*but seriously, fuck you and congrats* 😂", "score": 11, "replies": []}, {"body": "It was $80 March of last year smhh what a run", "score": 9, "replies": [{"body": "That’s depressing.  How sweet that would have been", "score": 3, "replies": []}, {"body": "It wasn't 80. It shows that cause of the split", "score": 1, "replies": [{"body": "It was the equivalent to $80. If we’re talking no split stock was around $300 and current price would be $6100", "score": 1, "replies": [{"body": "Yes, but ppl do not know that", "score": 1, "replies": []}]}]}]}, {"body": "I’ve never once fucked with tsla. I apparently hate money.", "score": 11, "replies": []}, {"body": "I got a wood from that ‘Avg cost’ 💦", "score": 7, "replies": []}, {"body": "Imagine if you bought calls with the 13k", "score": 10, "replies": [{"body": "I didn’t know what options were until September last year lol… and there’s no way in hell I would put 14k into options.", "score": 28, "replies": []}]}, {"body": "Usually I hate the people who use the term \"Daddy Elon\" and the like, but God dayum!  That's a low cost per share, nice job diamond handing.", "score": 6, "replies": []}, {"body": "I hope you're selling covered calls", "score": 3, "replies": [{"body": "I am not sir. Too risky I never want to lose my shares. And Tesla is too unpredictable at these levels and these monster runs", "score": 10, "replies": [{"body": "you can sell covered calls on a Friday at 3:58pm expiring the same day. At least take some premium home.", "score": 9, "replies": [{"body": "He’s up $170k on a $10k investment I don’t think he needs your retards advice", "score": 4, "replies": [{"body": "Retard, being up 170k on paper means nothing if he isn’t making deposits into his bank account from premiums.", "score": -2, "replies": [{"body": "Possibly the saltiest reply I’ve ever seen. Belongs on a coffee mug.", "score": 2, "replies": [{"body": "damn right", "score": 1, "replies": []}]}, {"body": "Appreciate the advice on cc. I make money by day trading options, I def withdraw that money to my acct haha! I’ve also sold 7 shares of Tesla and deposited that money, still holding bulk of my position :)", "score": 1, "replies": []}]}]}]}, {"body": "That’s Even more reason to sell covered calls", "score": 2, "replies": [{"body": "Amen.", "score": 1, "replies": []}]}]}]}, {"body": "I bought so long ago, also sitting at similar gains as OP, might cash in 20% tomorrow. Tell me what to do", "score": 3, "replies": [{"body": "I’ve sold 7 out of 160 shares, take some profit if you want bro! It’s nice to deposit some money into your account haha", "score": 1, "replies": [{"body": "I sold 10% of my shares! Good looking account balance. Wanted to sell 20% but panicked lol", "score": 1, "replies": []}]}, {"body": "💎🙌", "score": 1, "replies": []}, {"body": "Ever heard ‘The Gambler’ by the great Kenny Rogers?", "score": 1, "replies": []}]}, {"body": "At the time I was torn between apple and Tesla, put the big pile into apple. I'm still doing well, but Tesla was the play.", "score": 3, "replies": [{"body": "I have apple stock too at $51 and NVDA @ $37. Both great investments but The discrepancy betw the 5 year returns on AAPL and TSLA is pretty insane!", "score": 2, "replies": []}]}, {"body": "You earned it with that cost average fam. Enjoy the tendies and the 10% for the \"Big Guy\"", "score": 3, "replies": []}, {"body": "Forever and always.", "score": 2, "replies": []}, {"body": "that's a nice average cost..", "score": 2, "replies": []}, {"body": "Bless your heart.", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|3 weeks ago\n**Total Comments**|5|**Previous DD**|\n**Account Age**|6 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=qknftf)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=qknftf)", "score": 1, "replies": []}, {"body": "Aayyyyeeeee", "score": 1, "replies": []}, {"body": "💎 🙌", "score": 1, "replies": []}, {"body": "I’m going all in. It might be too late to see crazy gains. But I’m alll in when it corrects or splits", "score": 1, "replies": []}, {"body": "*pulls rug*", "score": 1, "replies": []}, {"body": "💰🖨️", "score": 1, "replies": []}]}
