{"title": "Slack aka WORK - Q3 earnings today, prepare for tendies takeoffs.", "selftext": "Slack keeps beating it's projections, and growing rapidly. In the long term Microsoft teams/Salesforce may absolutely destroy it, but in the mean time, it's functioning in a market niche that is growing, and there is room for more than a few players while it develops. They're going to crush their number, and sky.\n\n12/6, $24.00 Calls at $.85 cents. (3 quarters and a dime per option, dive into your piggy banks boys and austists).\n\nReserve your electric lego truck now.\n\n&#x200B;\n\nEDIT: the comments section thinks i'm retarded. Inverse me and buy puts, or inverse the collective mind of WSB and come take a ride aboard the tendie train.  chug-a-chug-a chug-a-chug-a  TENDIES.", "id": "e61vzu", "created_utc": 1575477721.0, "score": 10, "upvote_ratio": 0.79, "num_comments": 32, "comments": [{"body": "Pshhh", "score": 9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Pshhh", "score": 18, "replies": []}, {"body": "he means you're retarded/", "score": 7, "replies": [{"body": "Pshhh", "score": 2, "replies": [{"body": "Not on my worst day pal.", "score": 2, "replies": [{"body": "Pshhh", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Thank you for your payment towards my tendie fund.", "score": 7, "replies": []}, {"body": "Reversed you", "score": 8, "replies": []}, {"body": "I trade earnings for a living. I went short on WORK earlier this month. The problem with calls/puts with this stock is the high implied volatility, making them expensive.\n\n&#x200B;\n\nThat said, if you want to play WORK go with ATM Jan17 options.", "score": 7, "replies": []}, {"body": "all MSFT needs to do is say they have 30M Teams users and this crashes even more", "score": 7, "replies": [{"body": "Teams is garbo", "score": 0, "replies": []}]}, {"body": "Lmao (X) Doubt", "score": 11, "replies": []}, {"body": "inversed 🥴💕", "score": 5, "replies": []}, {"body": "Ouch this shit is tanking after hours.", "score": 3, "replies": []}, {"body": "Inversed and bought 12/6 $21.50 Puts", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Slack will continue to preform well in medium to small business, with Teams owning the enterprise space", "score": 2, "replies": [{"body": "IBM and Apple and Netflix all use slack exclusively", "score": 4, "replies": [{"body": "That’s because they don’t have Microsoft EA agreements. The large companies that do will get Teams for free.", "score": 2, "replies": []}]}, {"body": "And the majority of those size companies use the free version of Slack. Bad news in the long run I'd say", "score": -1, "replies": [{"body": "I’d slack your butt", "score": 1, "replies": [{"body": "Don't tempt me with a good time", "score": 1, "replies": []}]}]}]}, {"body": "weak guidance", "score": 1, "replies": []}, {"body": "hopefully someone unversed.", "score": 1, "replies": []}, {"body": "Thanks for making me money foo", "score": 1, "replies": []}, {"body": "Not to \"cold takes exposed\" you but my lord was this a bad take.", "score": 1, "replies": []}, {"body": "lmao the fuck happened. Shoot up and came crashing down and went back to the same damn price point.", "score": 1, "replies": []}, {"body": "I haven't used teams, but I cannot imagine a Microsoft product being better than Slack.", "score": -1, "replies": [{"body": "lol ok", "score": 2, "replies": [{"body": "Unpopular Opinion: Microsoft product design is weak and makes clunky software.", "score": 2, "replies": []}]}, {"body": "Teams was fun until my company disabled gifs 😤", "score": 1, "replies": []}, {"body": "I used it a couple of years ago. It definitely wasn't on par with slack, but it was close. I'm sure they've ironed out any of the kinks since then.", "score": 1, "replies": []}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Click here to find more YOLOs](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da). \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}
