{"title": "I am about to be called on 600 shares of Boeing at $340", "selftext": "As of right now it is at $325. Should i close out my options and take a loss or hold tight for a while and hope that it goes back up?\n\nI guess i can sell calls in the meantime and collect dividends. I'm just worried it'll go back down to $200\n\nWhat do you guys think?\nEdit. I sold 6 puts for boeing expiring friday at $340 strike price", "id": "ebpdjd", "created_utc": 1576549526.0, "score": 5, "upvote_ratio": 0.6, "num_comments": 38, "comments": [{"body": "It’s not going up anytime soon. Too much bad news", "score": 31, "replies": [{"body": "Do you think it'll hit $340 anytime soon like jan/feb", "score": -23, "replies": [{"body": "Did you read my reply?", "score": 20, "replies": [{"body": "Do you think it could go back to around the high 320s? I’m in a lot of margin debt for Boeing right now and I’m probably gonna get a margin call if it goes down much further.", "score": -1, "replies": [{"body": "Do you people read anything before replying? Why am I repeating myself a third time 🤦‍♂️. Betting on Boeing is incredibly dumb right now. Especially if it’s a short term play", "score": 12, "replies": [{"body": "Do you think Boeing is going to 420 anytime soon? I owe a lot of margin debt to my drug dealer.", "score": 8, "replies": [{"body": "Absolutely bro go all in", "score": 10, "replies": []}, {"body": "probably $420.69", "score": 1, "replies": []}]}, {"body": "How dumb do I look now. Just got out of all my debt thanks for the terrible advice", "score": -1, "replies": [{"body": "Pretty dumb if your debt depended on a $5 swing in a company going downhill fast.", "score": 3, "replies": []}]}]}]}]}, {"body": "Maybe", "score": 1, "replies": []}]}]}, {"body": "That's 200k. Baller!", "score": 4, "replies": []}, {"body": "Strike price next friday at $340", "score": 5, "replies": [{"body": "Not. Happening.", "score": 15, "replies": [{"body": "You're way to honest", "score": 3, "replies": []}]}, {"body": "Flip a coin. If it lands on the side, go all in on FD calls", "score": 7, "replies": []}]}, {"body": "I'm confused. If you own options you won't lose anything next Friday. Your option will simply expire and you're out whatever you paid for the contract, nothing more.\n\nIf you're about to margin called, I'm confused as to why. The price isn't significantly changed from $340 and volatility isn't high enough to warrant a margin call.", "score": 3, "replies": [{"body": "Sorry, I sold 6 puts for boeing at $340 strike price expiring friday. Sorry, i wasn't very specific in my original post, ill edit it now", "score": 6, "replies": [{"body": "I would look at the numbers for rolling the put out and down. Earnings are late January. \n\nHow much did you collect per contract?\n\nAt 327 BA is at or lower than it has been for 8 months. \n\nI think the news came out late today so tomorrow might be horrible. I certainly wouldn’t buy BA tomorrow. BA is 324 after hours.", "score": 1, "replies": [{"body": "You mean roll it out to lets say april for about $300 strike price if it should lessen the loss?", "score": 0, "replies": [{"body": "I think if you roll it out you will collect money. If you roll it down you pay money. If you roll it out and down it might cost 0. \n\nThink about that. Options pricing will change at the open tomorrow. \n\nYou would need to buy back the December 20 340 put for 14. Then sell the February 21 325 put for 15.45 and collect 1.45. Or sell the March 20 315 put for 13.75 and pay 0.25. Or May 15 300 put for 13.65 and pay 0.35.", "score": 1, "replies": [{"body": "This is great advice, Thank you!  \nI think i will roll it out and down to May at a $300 strike price and pay the difference depending on what the option prices are tomorrow morning", "score": 2, "replies": [{"body": "Obviously there is risk, but the May 300 gets you OTM.", "score": 1, "replies": []}]}]}]}]}, {"body": "I doubt it’s going back up for awhile. They have been taking a beating recently.", "score": 1, "replies": []}]}]}, {"body": "Buy shares", "score": 2, "replies": []}, {"body": "Could go up, could go down.", "score": 2, "replies": []}, {"body": "If BA falls below 250, i'm jumping in. Until then, i think the risk of it falling further outweighs the potential for gain.", "score": 2, "replies": []}, {"body": "Nothing but bad news on Boeing expect it to drop more.", "score": 4, "replies": []}, {"body": "It will not be that bad. A few days later it will go back up.", "score": 3, "replies": []}, {"body": "[$340 - $327 (current Boeing stock price) ]*600 = $7800\n\nSo... you're out $7800 currently? \n\nI'm new to option but what was your reasoning in selling puts? Did you thought it would not have gone down that bad?", "score": 1, "replies": [{"body": "You have to know how much premium he received initially to know how much he is down exactly", "score": 1, "replies": []}, {"body": "The news at the time was that the planes would be back in the skys in December so i wanted the premium from the puts. I had sold them a few months back. I had no idea it would be this bad. 99% of options expire worthless", "score": 1, "replies": [{"body": "How much was the premium?", "score": 1, "replies": []}, {"body": "> 99% of options expire worthless\n\nReally? Whoa I didn't know this. Do you have a source on this? I'm not trying to be confrontational just trying to learn more.\n\nThank you for your insight. I tried upvoting all my replies but someone is downvoting shrug.", "score": 1, "replies": []}]}]}, {"body": "Roll it to next month reduce the strike price", "score": 0, "replies": []}, {"body": "I'm confused by your post.  Who is calling you?  Margin call?\n\nAre you saying your strike price is $340?  What is your expiry?", "score": -3, "replies": [{"body": "I believe he sold 340 puts that expire on dec/27.  So he is about 9k in the whole", "score": 1, "replies": [{"body": "Yes that is right, Just trying to figure out if i should close out tomorrow before it gets worse or hold through", "score": 1, "replies": []}]}]}]}
{"title": "Southwest Airlines extends 737 Max cancellations until April", "selftext": "https://www.cnbc.com/2019/12/17/southwest-airlines-extends-boeing-737-max-cancellations-until-april.html\n\nSouthwest extended cancellations from the grounding through April 14.\n\nThe planes have been grounded since March 2019, after two crashes killed 346 people.\n\nBoeing is halting production of the planes next month because of the prolonged flight ban.", "id": "ebvmw4", "created_utc": 1576588375.0, "score": 184, "upvote_ratio": 0.95, "num_comments": 33, "comments": [{"body": "Shocked Boeing hasn’t been absolutely crushed by this debacle to the tune of 50%+.", "score": 37, "replies": [{"body": "[deleted]", "score": 29, "replies": [{"body": "That and the US government will not allow this company to fail. Bought some at $324.00", "score": 18, "replies": [{"body": "wE cAnT lEt AiRbUs WiN!!1!11", "score": 2, "replies": []}]}]}]}, {"body": "Loving this, hoping Boeing drops well below 300.", "score": 31, "replies": [{"body": "priced in already, today BA’s low tested 320", "score": 17, "replies": [{"body": "Low tested?", "score": 3, "replies": [{"body": "The low price per share for today was 320", "score": 2, "replies": []}]}]}, {"body": "Are you buying then?  Or do you have a shorts.", "score": 6, "replies": [{"body": "I’ll buy if it goes very low.", "score": 11, "replies": [{"body": "How low?", "score": 2, "replies": [{"body": "Below 290. Which I think is possible if this keeps snowballing.", "score": 5, "replies": []}]}]}]}, {"body": "I can't believe it hasn't already.\n\nI think the market has too much faith in Boeing, and thinks this will all blow over in a year or two. I don't think it will.\n\nThe next time a Boeing plane is involved in a crash, or mysteriously disappears like the Malaysia Flight 370, I think everyone is going to think back to the Boeing 737 Max fiasco and blame it on Boeing. Whereas if it was Airbus people wouldn't be so quick to point the finger at them.\n\nA Malaysia Flight 370 type disaster involving the 737 Max (once it's cleared to fly again), where no one can find the plane, would be an absolute nightmare for Boeing.", "score": 3, "replies": []}]}, {"body": "With all that bad publicity BA stock prices after the production shut down is higher 1st day than before the announcement.  It was $328.4 1.5 hour into session.", "score": 9, "replies": [{"body": "You have to compare that to the market I think", "score": 2, "replies": [{"body": "BA is supposed to the best stock to bet it will go down today with massive sells.  A 115,000,000 s order disappeared this AM suggesting institutional order was canceled.  You are right the market is hold up.", "score": 6, "replies": [{"body": "Right now BA is slightly up for the day", "score": 1, "replies": []}]}]}]}, {"body": "Yep, DAL mooning on this news.", "score": 3, "replies": []}, {"body": "Also, BA is crashing my portfolio when I got the \"brilliant\" idea to short this thing.", "score": 4, "replies": [{"body": "Lol, it would make sense but Wall Street doesn't care about dead people if they don't expect the company to be punished.", "score": 8, "replies": [{"body": "I would have assumed shutting down a production line that large would be a punishment.  Seems like their stock already had this event baked in a while ago.", "score": 4, "replies": [{"body": "True that, gut feeling told me it should plunge too. Tho I've refrained from expecting or betting against companies in legal troubles after seeing Equifax, Facebook and Johnson & Johnson stocks not give a fuck about their debacles which should have grilled their bottom line.", "score": 3, "replies": [{"body": "From an outsider, I've always wondered.  A company like Boeing isn't going anywhere, not in our lifetime.  So when bad news hits and the stock price dips, everyone everywhere knows it's going to go back up.  It just seems symbolic, almost meaningless for the stock price to bounce around.  It's not Peloton who could topple on their head and made me a cool $26 bucks off a short.  Just having fun trying to time the news on longs and shorts.  I have 400 bucks in Robinhood, won't add a penny more.  I don't gamble my retirement.", "score": 1, "replies": []}]}]}]}]}, {"body": "Freaking tested 320 twice and then I sold my puts.", "score": 2, "replies": []}, {"body": "Is this the so called turnaround stock Peter Lynch keeps talking about? Haha. I will buy if it goes below 300.", "score": 1, "replies": []}, {"body": "The most insane part about BA is that its 52 week low is one year ago, when it hit its then ATH--10 percent lower than its current price. That should tell us something about the market overall and what could happen to BA with just a little pop in the bubble.", "score": 1, "replies": []}, {"body": "I really wish someone at Boeing would just put me in charge of a team to fix this. It would cost a shit tonne. But not as much as what they’re losing now.", "score": 0, "replies": [{"body": ">loosing\n\nSounds like you'd fit right in with Boeing's 737 Max team.", "score": 1, "replies": [{"body": "Thanks for the catch bro. Glad I’m an engineer and not an English professor", "score": 1, "replies": []}]}]}, {"body": "Sheesh, Southwest has to be struggling. Every time I check flight prices with them they are hundreds of dollars more than alternative, and what I would consider premium airlines. I haven't flown southwest since before the maxes went out if service.", "score": -5, "replies": [{"body": "Hundreds? I just booked round trip airfare to San Diego from Baltimore for less than $400 on SWA.", "score": 3, "replies": [{"body": "Maybe it's just in and out of Dallas, but yes, it is consistently hundreds of dollars more to fly Southwest over American and Delta.", "score": 1, "replies": [{"body": "I just did another search and found some interested results for my area. Southwest's direct flights are cheaper, but their multi-leg flights are a bit more expensive. Not hundreds, but enough to make you shop around. Delta and American can't touch SWA for my direct cross country flights, but when there's no direct flights available the playing field gets leveled quite a bit.", "score": 1, "replies": []}]}]}, {"body": "i just flew halfway across the US roundtrip for under $200 via Southwest while no competitor could offer the same route for under $350", "score": 2, "replies": []}]}]}
{"title": "Here’s your coffee you filthy animals!", "selftext": "17th December 2019\n\nWelcome everyone, let’s have a good day, GL. \n\n\n#DOW\n\n\n**Cisco Systems (CSCO)** won a legal battle against counterfeit key networking equipment, securing an injunction that requires big online marketplaces, including **Amazon (AMZN) and Alibaba (BABA)** to halt the sale of some of the counterfeit goods. (WSJ)\n\n**Goldman Sachs Group (GS)** had its PT increased to USD 280 from USD 240 by Wells Fargo analyst, Mike Mayo. The analyst notes an improved outlook after a year of transition including new management, and earnings estimates above the consensus.\n\n**Johnson and Johnson (JNJ)** has had claims that the pharmaceutical giant’s talcum powder caused cancer rejected by a jury in California.\n\n**Microsoft Corp. (MSFT)** had its PT increased at Wedbush to USD 185 from USD 170, as it remains a top pick on its Best ideas list. Deutsche Bank also increased its PT for the tech giant to USD 175 from USD 160.\n\n**Pfizer Inc. (PFE)** announced with **Astellas Pharma (ALPMY)** that the FDA approved its supplemental New Drug Application for its XTANDI, a treatment for metastatic castration-sensitive prostate cancer, or mCSPC.\n\n#NASDAQ 100\n\n\n**Micron Technology (MU)** was upgraded at Wedbush to Outperform from Neutral, citing improved pricing environment for memory chips.\n\n**Netflix Inc. (NFLX)** Asia-Pac business had the largest gains over the past three years, where growth in Europe, Middle East and Africa also accelerated.\n\n#S & P 500\n\n\n**Best Buy Co. Inc.(BBY)** announced it is to restructure its leadership team where six senior members will be departing, including the Chief Merchandising Officer, Chief Marketing Officer, Chief Digital Officer, Chief Legal Officer &amp;amp;amp;amp; General Counsel, and Chief Administrative Officer. Plus the Chief Brand Officer who resigned last week. The CEO, Mark Tritton, announced interim leads have been appointed, they are now looking to fill the positions full time.\n\n**Lilly (Eli) &amp;amp;amp;amp; Co. (LLY)** (USD) Adj. EPS 6.70-6.80 (Exp. 6.63) FY19 Adj. EPS 5.75-5.85.\n\n**Newmont Goldcorp (NEM)** has reportedly agreed to sell its 50% stake in Kalgoorlie Consolidated Gold Mines for USD 800mln to Australia's Northern Star Resources Limited.\n\n**Procter &amp;amp;amp;amp; Gamble (PG)** – Anglo-Dutch competitor **Unilever (ULVR LN, UN, UL)** issued a sales warning, noting it is going to miss its 2019 sales growth guidance (lower end of 3-5% growth) slightly, RBC notes Unilever has put the blame on to the market, although the desk believes there is more to it. RBC believes Unilever needs to increase its investment levels, even if it is to impact margins.\n\n**Weyerhaeuser (WY)** is to sell its Montana Timberlands for USD 145mln cash to a private Timberland investment company.\n\n**Whirlpool Corp. (WHR)** announced half a million Hotpoint and Indesit washing machines are being recalled over a potential fire hazard. (Sky News)\n\n#OTHER\n\n\n**Alnylam (ALNY)** announced its ILLUMINATE-A phase 3 study of Lumasiran, an investigational RNAi therapeutic targeting glycolate oxidase, met its primary and secondary endpoints.\n\n**AMC Entertainment (AMC)** has lost its top spot for North America’s largest movie theatre operator as Britain’s Cineworld, who owns Regal, struck a deal to purchase Canada’s Cineplex for USD 1.65bln. (CNBC)\n\n**Fiat Chrysler (FCAU)** board is to meet with the board of **Peugeot (UG FP)** today to finalise the initial merger agreement, according to sources.\n\n**Jabil (JBL)**  Q1 19 (USD): Core EPS 1.05 (exp. 0.94), revenue 7.5bln (exp. 6.95bln), raised FY20 guidance to 26.7bln (Exp. 26.13bln), and FY20 EPS to 3.60 (exp. 3.44, prev. 3.45).\n\n**Navistar (NAV)** Q4 19 (USD): EPS 1.02 (exp. 0.96), revenue 2.78bln (exp. 2.8bln).\n\n**Pacific Gas and Electric (PCG)** announced it has entered into an amendment to the restructuring support agreement among the company and representatives of the wildfire victims to reaffirm the support of the USD 13.5bln settlement.\n\n**Roku (ROKU)** CFO, Steve Louden, is to step down but will remain until a successor is named.\n\n**Spark Therapeutics (ONCE)** and **Roche (ROGN SW)** received US antitrust approval for the proposed USD 4.3bln takeover of ONCE, which has now been completed.\n\n**Uber (UBER)** A California judge ruled that the co.’s drivers will not have to be reclassified.\n\n\n**Of note for Boeing Company (BA), Airlines (LUV, AAL, UAL) , and Suppliers (GE, SPR)** - Boeing confirms it is to halt production of its 737 Max in January. CNBC added the co. will not furlough or lay off about 12k employees amid the suspension of the production. Elsewhere, it declared a quarterly dividend of USD 2.055/Shr. Boeing did not provide a timeline for how long it expects to have production halted for; It currently produces at a rate of 42 per month, and some estimate its backlog will sit at 400 by the end of the year. **Southwest Airlines (LUV)** has stated it proactively removed the schedule through to April 13th next year, previously it expected to schedule the return in March. LUV announced it continues to see Q4 RASM flat to +2% from the previous year, although expects Q4 Y/Y ASMs -1% (Prev. guidance -0.5 to -1%). Further, congress reportedly plan to boost funding for aviation safety following the recent crashes.\n\n**Of note for Telecom’s (CTL, T)** Morgan Stanley analyst, Simon Flannery, has downgraded the Telecom Services forecast to Cautious from In-line, thus downgrading **Century Link (CTL)** to equal weight from Overweight, reducing the PT to USD 14.80 from USD 16, highlighting increased wireless competition, regulatory concerns and elevated leverage whilst also seeing secular headwinds in 2020.\n\n\n**Of note for Energy names (MPC, PSX, COM, VLO, CVX, COP**, Goldman Sachs (GS) updated a slew of price targets on the sector, cutting its target on MPC by USD 5 to USD 73, PSX cut to USD 128 from USD 131, XOM to USD 74 from USD 75. However, VLO was increased to USD 105 from USD 104, CVX to USD 138 from USD 137 and COP to USD 70 from USD 67.\n\n\n**Of note for Homebuilders (LEN, PHM, DHR, TOL)**, US Housing starts came in at 1.365mln above the expectations for 1.345mln and picking up from the previously revised higher 1.323mln. Building permits also firm at 1.482mln, above expectations from 1.41mln and above the prior 1.461mln.", "id": "ebwhfm", "created_utc": 1576593010.0, "score": 313, "upvote_ratio": 0.98, "num_comments": 32, "comments": [{"body": "thank for covfefe, mer chrimbus.", "score": 97, "replies": []}, {"body": "Summary: Some shit’s going up - Some shit’s going down.\n\nSummarized Summary: Literally can’t go tits up.", "score": 46, "replies": []}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 50, "replies": []}, {"body": "Feed me ticker, strike and expiry daddy", "score": 27, "replies": []}, {"body": "$CSCO is going to bounce back to normal levels, you should have bought calls last Friday.", "score": 8, "replies": []}, {"body": "Dayum, BBY’s making heads roll on their leadership team", "score": 12, "replies": [{"body": "This should be BBBY - Bed Bath and Beyond.", "score": 6, "replies": [{"body": "Blood Bath and Beyond", "score": 8, "replies": [{"body": "Underrated", "score": 1, "replies": []}]}, {"body": "that makes sense then. They made money with all the coupons and sales but loose to big timers on online sales.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "You should bet a lot of money, all of it if you’re not a pussy, into some trade options. Calls or puts, depending on the info above. If you think BBY dropping 6 of its main bois into the shitter is going to drop their stock price, you should buy puts. If you think this is a good direction for them and you think it will raises their price, by calls.\n\nPoint is to yolo all your money, lose it, then post it here for pointless karma. It is the way of the autist.\n\n(for real though - please don’t waste your money if you don’t know what you’re doing)", "score": 9, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Fuck yeah man. Theres occasionally helpful info here to guide that money burning a hole in your pocket, but do some reading.\n\nAMD calls baybeeeeeee", "score": 4, "replies": []}]}, {"body": ">(for real though - please don't waste your money if you don't know what you're doing)\n\nMade so much sense up until here and then you lost me", "score": 2, "replies": []}, {"body": ">all of it if you’re not a pussy\n\nFuuuuuuuck, you've got me cornered.", "score": 1, "replies": []}]}]}, {"body": "Tl:dr stocks only go up. America and globalization forever. Eat your crayons and keep spending.", "score": 5, "replies": []}, {"body": "Sir this is a Wendy's, we're only interested in tendies not word salads", "score": 5, "replies": []}, {"body": "This seems far too informative...", "score": 4, "replies": []}, {"body": "Thoughts on my HEXO calls 12/20?", "score": 1, "replies": []}, {"body": "Mark Tritton isnt the CEO of Best Buy, dude...", "score": 1, "replies": []}, {"body": "so now is the time to buy UBER, yeah? That worker reclassification was hanging over the stock for a long time now... so the business will continue to operate (and grow) as it is. IDK if it's a buy long term, but shouldn't it rally on this news?", "score": 1, "replies": []}, {"body": "Cisco is gonna crush in February", "score": 1, "replies": []}, {"body": "Thanks!", "score": 1, "replies": []}, {"body": "Tldr anyone", "score": 2, "replies": [{"body": "The entire thing is a tl;Dr bro", "score": 28, "replies": []}, {"body": "buy some calls. buy some puts. its a pickem.", "score": 3, "replies": [{"body": "Well I was going to go for a fortune wheel", "score": 1, "replies": [{"body": "Easy:\n\n1. Just throw a dart at the $SPY wheel. Odd number, its puts, even number, its calls.\n2. Then inverse yourself, cos wsb.\n3. Apply the Buffet principle: be bold where others are timid. Re-inverse.\n4. You're on WSB. Auto inverse whatever your net result is\n5. But, know that you're more autistic than everyone else here. Square that shit.\n6. Self recognition. You are far less talented than 99% of this sub. Root that shit. \n\nSo, TLDR? Its always calls.", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "But we're on WSB so reverse inverse.\n\nAlways calls baby.", "score": 1, "replies": []}]}]}]}]}, {"body": "Time to lose some money", "score": 2, "replies": []}, {"body": "Are you aut.....never mind!!!", "score": 2, "replies": []}]}, {"body": "This post, I like it.\n\nAnother!", "score": 1, "replies": []}]}
{"title": "A WSB Story we can all identify with", "selftext": "'If youre buying calls/puts youre being risky' they said, even if you take your profits early. Didn't believe them. I'll just takevmy profits quick. What wasn't known, it's easy to take gains when you see them but how about when you see that -5000? Probably more drawn to averaging down than taking your loss. What happens if it falls more? Too deep now to take an L. Maybe it'll come back. A little later: why am I down another 30% and the stock price didn't even change, maybe there's a bug, I'll call my broker. In the time you're on the phone the stock drops 1%, yeah only 1% and for some reason you're down 98%. But on the bright side to average down it's only .01 per contract, sounds like a deal.  Another 20k later you're confident in your position again. I mean with how much you averaged down it only needs to go up 0.5% for you to make bank... but for some reason it's just stalled out again, taunting you. Cruel stock this one. But you haven't seen anything yet. The stock spikes! Wow stock gains 10% in 3 seconds, tendies here you come. But before you can sell it plummets back to its original level. Now all you can think about is $ROPE and how it may be the best investment you'll ever make. Why didn't you have an auto limit sell? But just as you're about to jump from the stool, you see the stock inch upward. Could this be it... little by little a smile forms on your face; you just might make it out alive. Almost there! Almost back to break even! You tell yourself that after all this anguish you might as well make a little something. Once you see even one green dollar you'll take your money and go get some frozen tendies at the grocery store, who cares if it isn't really chicken, you've earned it. But as you stare at the white number, no gain, no loss, you feel a need to see green, so you wait. For a second you believe that maybe it was meant to be, and not only will you get a little green but you'll get a lot of green. You do the unthinkable, you buy more contracts because it couldn't possibly go down again after fighting its way back. Plus you \"feel\" something; your autist sense is tingling. And right after hitting that buy button, literally the second after, the stock price plummets. All hope isn't lost though, there's still time. You look at the time and realize there actually isn't. Somehow you lost track of it and market closes in 30 seconds, and you \"accidentally\" bought contracts expiring today. It's okay though, when you put it into perspective. It was basically free money from apple card cash advances, student loans, 5 personal loans, and a second mortgage.   And not to mention, \"you learned a lot, it was like buying education.\" Next time you'll buy 2 day expiring options.", "id": "ec471i", "created_utc": 1576626302.0, "score": 61, "upvote_ratio": 0.89, "num_comments": 35, "comments": [{"body": "Damn man this should be filed under non-fiction", "score": 24, "replies": []}, {"body": "Tear down that wall", "score": 14, "replies": [{"body": "Lol sry, was supposed to be stream of consciousness so thought it worked better as a wall", "score": 10, "replies": [{"body": "I really liked this short story. I think we’ve all been there.", "score": 6, "replies": []}]}, {"body": "And make Mexico pay 💰", "score": 1, "replies": []}]}, {"body": "r/oddlyspecific", "score": 10, "replies": [{"body": "Yup", "score": 1, "replies": []}]}, {"body": "I feel attacked", "score": 7, "replies": []}, {"body": "I’m gay", "score": 6, "replies": [{"body": "Trying to reap my karma. Pathetic. You'd be better reaping semen out of my dick into your mouth.\n\n(In a non gay way).", "score": 2, "replies": []}, {"body": "You a mod yet?", "score": 2, "replies": []}]}, {"body": "Got hit by the PTI train?", "score": 2, "replies": [{"body": "We collectively lost $300k today on PTI. But what is dead may never die. \n\nhttps://reddit.com/r/Biotechplays/comments/ebwfk2/pti_roundup_post_your_losses/", "score": 4, "replies": []}, {"body": "Haha no way. I don't trade bio", "score": 1, "replies": []}]}, {"body": "You should check the biotech sub, pretty sad day over there.", "score": 2, "replies": [{"body": "Might make you feel better lol", "score": 1, "replies": []}]}, {"body": "https://images.app.goo.gl/p3pztz2w52jc377W7", "score": 2, "replies": []}, {"body": "Ok people please use paragraphs it’s not that difficult, no one is reading a wall of text", "score": 2, "replies": [{"body": "It's stream of consciousness", "score": 6, "replies": [{"body": "I read it and enjoyed it, but it felt too real. I guess I'm glad I still have my meaningless desk job, since being a full time trader sounds pretty rough mentally.", "score": 3, "replies": []}]}]}, {"body": "Wired my brain refuses to start reading a huge wall of text with no paragraphs", "score": 1, "replies": [{"body": "Its stream.of consciousness, smh", "score": 2, "replies": []}]}, {"body": "It's like yesterday I bought SPY at the opening and  was up  11%. Said to meself its Spy the daughter of S&P500, it will go higher, after all phase one trade deal is sealed and big Papa is not going to stab himself in the foot with a baby tantrum tweet...so just hold. I watched it till the gains wiped out. Still hoped tomorrow we will be fine, all I needed is SPY stay above the 320 but still never happened today  and still waiting...\n\nmy story. signed.", "score": 1, "replies": []}, {"body": "5/7 Ted Talk here.", "score": 1, "replies": []}, {"body": "The incoherent ramblings of a fiend caught in the throes of soboxone  withdraws.", "score": 1, "replies": []}, {"body": "I miss cocaine.", "score": 1, "replies": [{"body": "Cocaine's a hellava drug", "score": 1, "replies": []}]}, {"body": "God dammit I said stop spying on me", "score": 1, "replies": []}, {"body": "Wishful thinking has risen 1000%", "score": 1, "replies": []}, {"body": "Stfu zoomer", "score": 1, "replies": []}, {"body": "Did you just write my own biography for me?", "score": 1, "replies": []}, {"body": "Tldr", "score": 1, "replies": []}, {"body": "“A Wendy’s this is, sir” - Yoda", "score": 1, "replies": []}, {"body": "i didnt even read any of this", "score": 0, "replies": []}]}
