{"title": "Could I get some opinions on some options ideas I have?", "selftext": "I wanted to share some technical analysis I have been working on for some options ideas. Let me know what you all think and also if anyone else has any ideas please share I would be very interested to hear it.  Here is the link: [https://imgur.com/a/kyogYnx](https://imgur.com/a/kyogYnx)\n\n1.) $DIS is in a trendline downtrend. When it goes up again and hits around the 92 level I would start loading puts.\n\n2.) $SIRI is in a uptrend. When it goes down to the 4.90 level I would start loading calls.\n\n3.) $ET is in an uptrend. When it goes down the 13.40 level could be a place to start loading calls.\n\n4.) $DKNG is in a downtrend. When it touches the white trendline again I would begin to load puts.\n\n5.) $BABA is in a downtrend. When it touches the white trendline again which will probably be 74.15 I would begin to load puts.\n\n6.) $OXY is in a downtrend. When it touches the white trendline again which will probably be 60.00 I would begin to load puts.", "id": "196fkv7", "created_utc": 1705237899.0, "score": 5, "upvote_ratio": 0.63, "num_comments": 30, "comments": [{"body": "These are all my opinions and criteria, not some objective truth. \n\n1. DIS is a bull flag, the channel also seems to be pretty tight.\n\n2-3. SIRI and ET look good imo but the options might not have enough volume, that's one to look out for\n\n4. DKNG looks like a pump and dump without much clear direction, I wouldn't touch it\n\n5-6. BABA and OXY broke the downtrend with a higher low", "score": 5, "replies": [{"body": ">[https://imgur.com/a/kyogYnx](https://imgur.com/a/kyogYnx)\n\nThanks Mark.\n\n1.) DIS has dipped twice since the bull flag formation. How many more dips would you need to see before you consider it not a bull flag? Do you think the next rise will break the trendline to the upside?\n\n2-3.) What minimum volume range do you like?\n\n4.) What indicates to you that it looks like a pump and dump?\n\n5-6.) Thanks will bear that in mind in future.\n\nAdditionally I wanted to ask you about a losing trade i recently had it was in $GOLD. I could see the upwards trend on it so I bought calls (30 day expiry) on the final candle you see here when it was around 17.25. The horizontal line you see here I decided would be my stop loss because that is the lowest it had previously went to a few days ago which was the 17.05 mark. It went below that level to 16.94 so I got out putting around -30% ish. Now in hindsight I obviously made the wrong decision because the following day it went up a to the 17.80s and would of put me in profit but do you think I made a sensible decision of the placement of where my stop loss price would be?\n\nThe final candle here is the day I got in for $GOLD so you can see (the horizontol line is my stoploss) : [https://imgur.com/a/ERwO99s](https://imgur.com/a/ERwO99s)\n\nThen here is the chart with the extra candle on friday just so you can see how the price reversed: [https://imgur.com/a/MgToWOh](https://imgur.com/a/MgToWOh)\n\nThanks", "score": 0, "replies": [{"body": "1.DIS: I don't think it will break the trendline, and I also don't think it won't - I just usually aim for high conviction trades with a clear direction, and for me, this doesn't cut it. The impulsive move upwards indicates a general bullish sentiment for me, and this current pullback is more of a 'lower-level move', if you get what I mean. There's also a strong support at 86 so I think the upside (or more like the downside) is kind of limited here for a put. Maybe a call credit spread could work?\n\n2.I usually look at the spreads, and SIRI options have absolutely crap spreads. Chances are high that you couldn't close your position efficiently, be it profit taking or SL. I trade channels like this as well and on less 'trendy' stocks I just buy shares.\n\n4. Impulsive move upwards that cannot hold, no clear direction here either.\n\nGOLD: You should have waited for confirmation on the trendline being broken. You see the candle where you sold has a pretty long wick, which means the price tested the trendline and it held due to buying pressure. You should have waited for a candle like [this](http://prntscr.com/sH3p8AqF-IJ6) to exit the trade. Try to trade the patterns and not individual price points, they don't really matter.\n\nAnother thing to note: you traded based on a shorter term pattern (new 7-day low by a couple cents) instead of the long term pattern (trendline that held 2-3 times before). Always focus on long-term, that's stronger.", "score": 0, "replies": [{"body": "Thank you. Just a few more things I would like to go over with GOLD. Even though the candle has a long wick and held it did still technically close below and broke the trendline. So exactly how do you make judgement in deciding to keep the trade going?  How many additional cents do you generally tolerate?\n\nAlso when I had exited GOLD the daily candle obviously hadn't fully formed so I wasn't aware it would finish with a long wick as we know. If the stock kept falling and falling would you still continue to hold until you see a fully formed candle to indicate the direction of the pattern as you mention no matter your loss?\n\nAdditionally, when I mentioned I had traded and create an exit stratergy based off a short term low it was decided in consideration with the longer term picture in mind. I have drawn horizontal lines here my reasoning behind it was because when the stock had previously gone to each of its previous two dips the second candle never dropped lower (if that makes sense?). Heres a picture with lines you can see: [https://imgur.com/a/IhDyds1](https://imgur.com/a/IhDyds1)\n\n&#x200B;\n\nThan", "score": 0, "replies": [{"body": "A support/trendline is never a line but an area, I think this is what you need to practice/understand. I wait for a full candle below the level, or a breakthrough and finish on really high volume.", "score": 1, "replies": [{"body": "Since you wait for a full candles and do not use stop losses does that mean as part of your stratergy you are taking 70%+ losses options trades on some occasions or if you havent yet had a trade go wrong hypothetically it could easily be something that happens to you?", "score": 1, "replies": [{"body": "I usually don't play ATM options or ones with really close expiry, so waiting for a confirmation candle doesn't affect the profit/loss % that much.", "score": 1, "replies": [{"body": "So you normally do ITM? Would it be possible to share some charts of what you're currently focusing on?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Getting back on this: Yesterday is a good demonstration on why I avoid charts like Disney.", "score": 1, "replies": [{"body": "Do you make a living from trading options?", "score": 1, "replies": [{"body": "It's just a side hustle for now, I enjoy my day job so I'm not that keen to give it up yet.\n\nI just like looking at charts. :p", "score": 1, "replies": []}]}]}]}]}, {"body": "Here’s my question. Why options? None of this is anything that couldn’t be done by simply trading the underlyings. By trading options you’re introducing many more variables than simply the direction you’re guessing in these predictions. You now have to deal with theta, liquidity, volatility etc. whereas if you just go long/short the underlying none of that is relevant. I guess simply stated, my question is why are options a better instrument for these trades than the underlying is?", "score": 4, "replies": [{"body": "I think if you look into day trading subreddit they are all tools to use in different scenarios and income levels risk for trade and returns… nothing more really… option trading is just another tool for profit when your prediction is correct… and it’s a more finer hone tool than just ohh I am going to short long this stock… you add a time component and you can cap loses/gains… get money from entering a trade and exiting a trade… to me options is a tool. How to use it? I dunno lol", "score": -1, "replies": [{"body": "I’m well aware of the possible benefits. I’m asking specifically in his case what makes options a better expression for the trade? Does he have a time prediction? Does he have a vol estimation? Is he simply trying to leverage his bets? If you’re simply trading direction with no other predictions then options are not necessarily the best way to do that.", "score": 1, "replies": []}]}, {"body": "Options increase (and decrease) way more then common stock more profit potential", "score": 1, "replies": [{"body": "So leverage.", "score": 2, "replies": []}, {"body": "Yes they’re levered. They also lose money every day your prediction doesn’t come true, or if implied volatility goes down. So make sure you have a good timeframe estimate as well as directional estimate and if you have no vol frame of reference I’d be buying deep in the moneys to minimize that aspect.", "score": 1, "replies": []}]}]}, {"body": "I don't believe in TA. I think it's astrology for the stock market. That said why buy puts or calls? Why not shares? And if you like options why not spreads? Why not ratios?", "score": 3, "replies": [{"body": "Came in to basically say this.  \nThe human mind tries/needs to fit everything into recognizable patterns, because we don't like uncertainty.  \n\nHere's how I read your candidates:  \n\n\"DIS is in a ... downtrend.\"  Me:  \"Okay, so sell a Call Credit Spread against it.\"  (Or whatever flavor of shorting you prefer.)  \n\n\"SIRI is in a uptrend.\"  \"Then sell a CSP or PCS against it.\"  \n\nI don't think it needs to be any harder than that.  Sell the Put now or the Call when it turns, it works out about the same, but you're in the market *now*, and kind of all the time if you do it that way.  \nBut best of luck either way.", "score": 1, "replies": []}]}, {"body": "I’ve got opinions, and that’s about all you can really count on around here.  #1, don’t move against Disney in the longer frame.  #2, OXY and SHEL are likely the two most volatile symbols in the strictly oil group.  I don’t think options there are wise, and I only spec trade small holdings of their stocks.  Not overly familiar with the rest.", "score": 1, "replies": [{"body": "Shel looks good for a 30 day expiry call option! I never checked that chart but I see now it looks good for that its had its 3rd dip now on the daily and due for a rise", "score": 1, "replies": [{"body": "Ok.  Short or long?", "score": 1, "replies": [{"body": "I just said call option doesnt that mean long?", "score": 1, "replies": [{"body": "No.  But I’m willing to explain that if you wish.", "score": 1, "replies": [{"body": ">r\n\nOk", "score": 1, "replies": [{"body": "There are two option types:  calls and puts.\n\nThere are two option strategies within each type:  long calls and long puts, short calls and short puts.\n\nIn either a long call or long put, you PAY premium, and the basic goal is to exceed the chosen strike by expiration.  This is called being In The Money (ITM).\n\nIn either a short call or short put, you Receive premium, and the basic goal is to Not exceed the chosen strike by expiration.  This is called being Out [of] The Money (OTM).  \n\nTo open a long option, you Buy To Open (BTO) and pay the premium.  If that option needs closing before expiration, you Sell To Close (STC).\n\nTo open a short option, you Sell To Open (STO) and receive the premium.  If that option needs closing before expiration, you Buy To Close (BTC).\n\nThis is the very very basics of options trading.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "I will reply more tomorrow when at my desk but Disney had a really nice Double Bottom break on I think the 1hr\nRetest would be $86 so I guess you can target there\nBut I also see a falling wedge playing out on the daily, not a downward channel", "score": 1, "replies": []}, {"body": "Do you really think drawing 2 lines and a square on a chart is a good way of guessing where a stock will move? People at hedge funds spend 12 hours a day crushing numbers to get a slight edge and still get it wrong much of the time. Why do you think you're so special? \n\n\n\nFor years people have told morons you like that TA doesn't work yet you guys still do it. If you want to gamble, go to Vegas.", "score": 0, "replies": []}, {"body": "You’ve simply chosen a direction on these underlyings.  The next step is to now choose your option strategy. Long options, spreads, short. Need to look at IV, choose your strikes, expiration, etc. You could nail your TA but if you don’t employ the right option strategy it won’t matter.", "score": 1, "replies": []}, {"body": "I think BABA has bottomed, but downtrend is not fully broken.  I picked up a CSP.\n\nET is great - I've been watching it for a long time.  Its an LP though, keep in mind for taxes. \n\nOXY is just Buffetts pet project and I never know what to think of it.", "score": 1, "replies": []}]}
{"title": "8% down on individual portfolio", "selftext": "[removed]", "id": "196bonf", "created_utc": 1705222745.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 21, "comments": [{"body": "Sorry -- we removed your message on /r/stocks because generic posts like \"I have $XXX to invest, what should I do,\" etc. because they are low-effort and asked on a daily basis in /r/stocks. Please do some basic research first and feel free to come back with any specific questions about a stock, company or market environment afterwards.\n\nIf you're just getting started, please check out our New Investor wiki: https://www.reddit.com/r/stocks/wiki/index\n\nThings you can do:\n\n1. Read the wiki which has tons of information, including reputable learning resources, broker information, and links to useful reddit posts (including old posts similar to yours)\n\n2. Search the subreddit history for similar information\n\n3. You can post questions like this as a comment on our [daily discussion stickied thread](https://www.reddit.com/r/stocks/search?q=%22r%2FStocks+Daily+Discussion%22&restrict_sr=on&include_over_18=on&sort=new&t=week)\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}, {"body": "Stop checking and worrying. Check every 6 months or so", "score": 14, "replies": []}, {"body": "long term. years. many years.", "score": 14, "replies": []}, {"body": "If you’re the sort of person that thinks these topics will get you anywhere, just stick to global ETFs.\n\nI’m not trying to be a jerk or anything, that’s just how it is.", "score": 33, "replies": [{"body": "I suppose but global ETF’s don’t make a lot of money.", "score": -41, "replies": [{"body": "Neither do you", "score": 70, "replies": [{"body": "Oooh get OP some aloe vera because that burns lol", "score": 14, "replies": []}]}, {"body": "This response is exactly why you should be putting your money in ETFs", "score": 20, "replies": []}, {"body": "Slow and steady wins the race. \n\nYou’re trying to make money out of individual stocks without putting in the effort to actually do your own DD on them. Asking about stuff online will get you nowhere, because if people can point you in a clear direction, that means the market already priced that in.\n\nWhoever tried or tries to convince you that the stock market is a get rich quick scheme where you can make a lot of money quickly without any risk or effort is trying to take advantage of you.\n\nSo, again, DCA monthly into global ETFs and in 10 or 20 years you will reliably have come up with a hefty sum. Or keep investing into stuff without knowing what you’re doing and losing money.", "score": 4, "replies": []}, {"body": "You are down 8%", "score": 1, "replies": []}]}]}, {"body": "You have plenty of time and opportunity. You're only 24 years old. Build a life for yourself. Most of the people here weren't investing in the stock market at your age.", "score": 3, "replies": []}, {"body": "8% isn't really a big pullback in stocks. If you're buying for long-term you will likely see many more such pullbacks. \n\nUnless you're the world's greatest market timer, you'll always be down on every position at some point.", "score": 3, "replies": []}, {"body": "This is the cost of your education.  Hopefully one day, you'll get it.  - Good luck.", "score": 2, "replies": []}, {"body": "If your positions were larger you could sell calls or something. With those holdings and that account size your best bet is just to bag hold IMO. It's not like Microsoft or Apple are likely to severely underperform the market, and they will likely eventually make new highs(may take years).", "score": 2, "replies": []}, {"body": "what you need is diversification and patience", "score": 2, "replies": []}, {"body": "Time in the market > timing the market", "score": 0, "replies": []}, {"body": "If you are only interested in the quick return, sell and buy lower price stocks. Otherwise, keep appl.", "score": 0, "replies": []}, {"body": "Literally blame your friend then say you have nobody to blame but yourself.", "score": 1, "replies": []}]}
{"title": "A little more story about the Hertz/Tesla news", "selftext": "The other morning when I woke up the news about Hertz dumping their Tesla cars popped up. I immediately looked for a model Y. I committed to a 2022 model for $34200. Filled out their application and their financing and awaited their response about finalizing the deal.  I get contacted back later to say that Y was no longer available and the next available Y is $36400. I said no. Went on their site and found the exact VIN had gone up in price. Last night I checked again and the same vin is still available for $36700. Bait and switch.", "id": "1964tu1", "created_utc": 1705198500.0, "score": 48, "upvote_ratio": 0.84, "num_comments": 22, "comments": [{"body": "I go for a brand new Model Y LR from tesla inventory for $40k after $7500 tax credit! We know how rentals are abused!", "score": 44, "replies": [{"body": "Exactly. This vehicle has 50k rental miles and is out of B2B warranty.", "score": 7, "replies": []}, {"body": "Not everyone can get the tax credit", "score": 1, "replies": [{"body": "weary party sense complete pie vanish bake spark depend voiceless\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 7, "replies": [{"body": "I would lease.", "score": 1, "replies": []}, {"body": "This", "score": 1, "replies": []}, {"body": "There are people below the limit. They're thinking about every last penny... still not a great deal from where I'm sitting, but still.", "score": 1, "replies": []}]}]}]}, {"body": "I rented a bunch of Teslas from Hertz, and there’s no way I’d buy one of them for that kind of price when the tax credit is now available at POS. All the ones I rented were stored outside and the trim was heavily discolored, all had severely dented rims and most had rattles and shakes that my new MY doesn’t have.", "score": 12, "replies": [{"body": "yup, put 5000 miles on rented Teslas over the past 2 years.\n\nThe 3s all smelled, hopefully just due to the piss-poor cabin air filter location (water off the windshield dumps right into it)", "score": 2, "replies": []}, {"body": "Storing a Tesla outside damages it that badly after two years!?!\n\nFuckin YIKES", "score": 1, "replies": [{"body": "Less than that. I noticed \tthe discoloration on cars that were less than a year old. Made me paranoid about parking mine in the garage as much as possible.", "score": 1, "replies": [{"body": "Why did they switch to white by default? Black is much better for hiding corrosion", "score": 1, "replies": []}]}]}, {"body": "I rented one with about 20k miles, and it felt new, apart from 3-wheels of minor curb rash. Was parked in the airport garage though, so not as bad.", "score": 1, "replies": []}]}, {"body": "I lol'd when I noticed the smog fee.", "score": 3, "replies": []}, {"body": "OP I’d say get a new one.  I rented one for a Tahoe trip and there was so much wear/tear.  Paint was completely swirled, deep scratches elsewhere, curbed wheels, steering wheel material wearing down in hold areas, and you must imagine it got charged to 100% A LOT.   Otherwise it’s fine but I wouldn’t go without warranty and prefer no abuse.", "score": 3, "replies": []}, {"body": "I can’t post more pics else I would post the screen shots of the increased price changes.", "score": 5, "replies": [{"body": "I don't think anyone doubts you.", "score": 1, "replies": []}]}, {"body": "Ugh a used rental from hertz sounds nasty", "score": 2, "replies": [{"body": "I was going to say sketchy, but your way works too.", "score": 1, "replies": []}]}, {"body": "There's an inventory MY LR w/ tow hook for $5000 off in Camarillo right now if you can get it, same price I paid last month.\n\nedit: it's gone now. Next lowest is $47,490, $2,500 more...", "score": 1, "replies": []}, {"body": "I don't doubt there is some bait and switch going on. But I think all the news coverage about Hertz selling cheap Teslas, caused mass interest and they moved up the price. The cheapest I found was 21.1k right when I first heard, now it's above 24.", "score": 1, "replies": []}]}
{"title": "The Drugs to Watch report 2024, by analytics company Clarivate, features advancements, including first RSV vaccines pioneering gene therapy", "selftext": "In the 2024 edition of the Drugs to Watch report by Clarivate (CLVT), significant medical advancements, such as the first RSV vaccines and groundbreaking gene therapy, are featured. The report identifies 13 recently launched or upcoming drugs with transformative potential, some expected to reach blockbuster status (generating over $1 billion in annual sales) within five years. Clarivate (CLVT) considered drugs launched early last year or undergoing Phase 2 and Phase 3 trials in the pre-registrational stage, excluding those launched before 2023.\n\nNoteworthy technologies anticipated to prove their worth in 2024 include CRISPR-Cas9 gene editing and artificial intelligence/machine learning tools in drug discovery, clinical development, and commercial launch, as highlighted by Henry Levy, the head of Clarivate's Life Sciences & Healthcare segment.\n\nRegeneron's (REGN) high-dose Eylea, a recently introduced therapy for eye diseases, takes the lead in the list. Clarivate (CLVT) emphasizes its efficacy and safety, projecting $1.77 billion in 2027 sales for Eylea HD from patients with wet age-related macular degeneration (AMD) in G7 countries alone.\n\nCalliditas Therapeutics' (CALT) Budesonide, a delayed-release corticosteroid approved for adults with immunoglobulin A nephropathy, secures the second position. Datopotamab deruxtecan, a cancer therapy from AstraZeneca (AZN) and Daiichi Sankyo (OTCPK:DSKYF), holds the third spot, projected to be the second to launch for both HR-positive/HER2-negative and triple-negative breast cancer after Trodelvy from Gilead (GILD).\n\nRoche (OTCQX:RHHBY) and Sobi's (OTCPK:BIOVF) Factor VIII replacement therapy, efanesoctocog alfa for hemophilia A, is fourth on the list, appealing for cases where novel treatments like gene therapies are unavailable. Verona Pharma's investigational therapy for COPD, ensifentrine, is also highlighted for its novelty.\n\nMonoclonal antibodies Omvoh and zolbetuximab, developed by Eli Lilly (LLY) and Astellas Pharma's (OTCPK:ALPMF), respectively, complete the list. Clarivate (CLVT) notes Omvoh, approved for ulcerative colitis in October, remains a drug to watch in 2024 due to a delayed U.S. launch due to manufacturing concerns.\n\nIn its 2023 list, Clarivate (CLVT) highlighted 14 treatments, with 12 receiving regulatory approval. The challenges of drug launches are exemplified by Donanemab, Eli Lilly's (LLY) Alzheimer's therapy, and Roctavian, BioMarin's (BMRN) gene therapy for hemophilia A, which faced hurdles in regulatory approval and initial market reception, illustrating the complexities of drug launches, according to Clarivate's (CLVT) Levy.", "id": "196u2m6", "created_utc": 1705275943.0, "score": 27, "upvote_ratio": 0.78, "num_comments": 27, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|8|**First Seen In WSB**|3 years ago\n**Total Comments**|275|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Wow I like drugs", "score": 13, "replies": []}, {"body": "AI! AI! AI! CRSP is going to shoot AI straight into our DNA, curing everything from childhood obesity to social media addiction to bearishness. and probably create anime catgirls. Calls on CRSP", "score": 5, "replies": []}, {"body": "Annual cash flow down for next 3 years is what it says in the same report", "score": 5, "replies": []}, {"body": "Is there something to discuss in here?", "score": 8, "replies": [{"body": "Regeneron maybe, looks straightforward, they are on constant upwards trajectory. But I don't see a anyone giving a strong buy rating and some of their metrics are really not great. Gurufocus gives it a GF value of $720 and that would be their historical P/Es (maybe $740). At $930 the stock seems expensive already and no analyst gives it much potential, worst case is even a $700 target.\n With that blockbuster coming I'd buy them on a major drawback, but seeing $795 is probably wishful thinking.", "score": 2, "replies": []}]}, {"body": "What happened to those 3 gene therapy stocks: CSPR, EDIT, NTLA (Cathie Wood used to hold?  Not sure about now)", "score": 4, "replies": [{"body": "CSPR is waiting for an European approval. The cure is priced too high, but they have an edge of the competition so still there may be some takers. These treatments need another 5 years to go mainstream, maybe 10.", "score": 2, "replies": []}]}, {"body": "Adjacent to topic, Just watched tonight's 60 Minutes and was very impressed by ongoing human clinical trials to abate (possibly) cure: Alzheimer's; Addiction; PTSD; Obesity - using targeted ultrasound.", "score": 3, "replies": [{"body": "Wait, really?", "score": 1, "replies": [{"body": "Yes, really", "score": 0, "replies": []}]}, {"body": "A cure for Alzheimer’s is big if true. The problem with AD is that any significantly effective treatment or cure would likely be preventative in nature. The reason that’s a problem is that you’d need to do 20-30 year long clinical trials.", "score": 1, "replies": [{"body": "My intent is to follow what they're doing (family afflicted, early onset). From what I saw they can use ultrasound to break up the plaque. Doesn't mean 'all' plaque. I'm sure some cases can't be helped by that procedure so the drugs will still be needed. The story and result for the patient interviewed was compelling.", "score": 2, "replies": [{"body": "That’s a cool approach to it! I am hopeful that some sort of breakthrough happens with AD.", "score": 2, "replies": []}]}]}]}, {"body": "Altimmune weight loss drug is better ", "score": 2, "replies": []}, {"body": "Now THIS is the type of post that once made this sub great.  Thank you.", "score": 3, "replies": [{"body": "Not really. As a pharmacist this is a trash post. \n\nMost of these are not “pivotal moments” and many are already approved drugs to pray sell more than analyst estimates. \n\n3/10 quality in my opinion. No opinion, no actual understanding, no true speculation, and just copy paste. \n\nIt’s ass. Period.", "score": 10, "replies": [{"body": "I didn’t see a baldness cure on the list so I agree, pure ass.", "score": 3, "replies": [{"body": "Try hair implants. My woman works for an office that does them. They cost a lot but work if the person doing it is good", "score": 2, "replies": [{"body": "For now I’m combing minoxidil and stabbing myself in the head with needles once per week.", "score": 1, "replies": [{"body": "Ya hit a lotto play and go get hair implants. That shit just doesn’t work like at all. Might prevent further loss but you won’t get hair back", "score": 1, "replies": []}]}]}]}, {"body": "Like I stated.  It's far better than the other tripe you see on this sub.  We can talk about products or about Wendy's and hand jobs. \n\nAs a pharmacist, what do you like in the industry?  What should I be looking into that's going to moon this year?", "score": 2, "replies": [{"body": "You’re late if you missed the KarXT drug from that clinical trial.", "score": 1, "replies": [{"body": "So what's the next one that we won't be late on?", "score": 3, "replies": []}]}]}]}, {"body": "Well they don’t make it great anymore", "score": 1, "replies": [{"body": "Wait.  The market will start moving this year, and the quality of post will improve.", "score": 1, "replies": []}]}]}, {"body": "Who’s got the clinical trial links to Clarivate?", "score": 1, "replies": []}]}
