{"title": "Elon Musk Officially Unveils The Tesla CyberTruck ⚡️", "selftext": "Source : Tesla Official Live Stream On X", "id": "187stxf", "created_utc": 1701377596.0, "score": 59, "upvote_ratio": 0.89, "num_comments": 14, "comments": [{"body": "60k, 80k, 100k. Not bad at all.", "score": 10, "replies": [{"body": "Eh, was underwhelmed. Too little range for the price IMO", "score": 7, "replies": [{"body": "More range than a Model 3 or Y with way more other features.", "score": 7, "replies": []}, {"body": "For the first year of production at low volumes the prices are fine and similar to other electric trucks in the market.\n\nBut I agree that overall the presentation was underwhelming. They didn’t talk about the range extending add on battery, V2L, V2H etc. How many amps for L2 charging? Is there a new wall charger for V2H? \n\nInstead they demonstrated that the windows are rubber ball proof. And did an electric power-towing competition that didn’t include the Hummer EV.", "score": 1, "replies": [{"body": "That was a baseball, not a rubber ball.", "score": 4, "replies": [{"body": "It bounced like rubber.", "score": 0, "replies": []}]}, {"body": "Who cares about a hummer EV?", "score": 3, "replies": [{"body": "I don’t give two shits about the Hummer but it has 1,000 hp and 350 miles of range and costs a little over $100k. It seems like the most direct competitor to the CyberBeast.", "score": 0, "replies": []}]}]}, {"body": "Yes yes, 2/10 would not bang", "score": 1, "replies": []}]}]}, {"body": "This isn’t a company trying to make an EV for a he first time. This is a Tesla, most people love their Teslas. This is just the super deluxe badass version.", "score": 2, "replies": []}, {"body": "Lame presentation beside the Porsche drag race. Severely lacking info. All the awesome news dropped after the fact on their website like range extender and black wrap. Truck will sell bananas.", "score": 0, "replies": [{"body": "I thought the presentation was fine. Let the product speak by itself has always been Tesla’s attitude and it paid off. Look at the awesome reviews we’ve got. The Hagerty and Top Gear reviews are awesome. Carwow and MKBHD aren’t bad either.", "score": 2, "replies": [{"body": "I see where you’re coming from but if that’s the argument, don’t stream the event at all. You have to admit the baseball was cringe. Also why didn’t they talk about the black wrap option? Huge missed opportunity to not talk about some of the awesome accessories that literally went up on the website right after the presentation.\n\nPeople expect events to show off the best of the product. If you exclude something cool, that’s just dumb.", "score": 2, "replies": []}]}]}, {"body": "I do think it’s Tesla’s boldest vehicle to date, design wise. Haven’t seen it in person yet, but the exterior of the vehicle is (Borat noises) to me", "score": -1, "replies": []}]}
{"title": "Glad I stumbled on thetagang sub", "selftext": "I had more or less come up with a variant of this strategy on my own without knowing any of the terms or theory. It has been really interesting to read through the wiki and other users posts and comments. \n\nIn my case I have been long NVDA and some other WINNERS for a while.  It occurred to me that I could write CCs against these with very little risk, so I am dipping my toe in.  I had to work with my broker to enable options trading.\n\nIt is interesting: there are multiple levels of option trading (at least at my broker - full disclosure: I use a full-service broker that is fee-based). Buying options is the first level, CCs is the next, etc. Full-service actually sounds kind of limiting for this type of trading, tho.\n\nMy first trade I sold some NVDA Mar 24 500 CCs for NVDA. I also hedged a bit by buying some cheap otm puts against the same shares (I know this is not theta - more like using theta proceeds to buy some long insurance in case the stock tanks).  Also: I don't mind if the shares get assigned at that price. \n\nI'm here to learn, and hopefully make a little extra $.", "id": "187lude", "created_utc": 1701359859.0, "score": 19, "upvote_ratio": 0.85, "num_comments": 11, "comments": [{"body": ">It is interesting: there are multiple levels of option trading (at least at my broker - full disclosure: I use a full-service broker that is fee-based).\n\nIt's interesting how the existence of \"free\" brokerages has resulted in a shift in how people use these terms.\n\nIn ancient times, before online brokerages, brokers (meaning real, live human beings) acted as financial advisors, actually telling you what investments to make.  To place a trade, you actually had to speak to this real, live human broker, who was \"your\" broker.  Thus, frequent trading for small-time retail investors was unheard of.  The commission for a trade cost a hundred dollars or more.\n\nThen, with the advent of home internet, online brokerages started up, allowing retail traders to place trades themselves, without speaking to a human being.  These online brokerages charged \"only,\" say, $10 per trade or something in that range in commissions.  Thus, they were dubbed \"discount brokerages,\" and the old style, financial-advising, talk-to-a-live-human brokerages were given the retronym \"full service brokerages.\"\n\n*All* the major online brokerages are discount brokerages.  Fidelity, E\\*Trade, Schwab/TD Ameritrade, etc.  Just because Robinhood and Webull are \"free\" doesn't make any non-free brokerage \"full-service.\"  Full service brokerages barely exist anymore.\n\n[https://www.investopedia.com/terms/f/fullservicebroker.asp](https://www.investopedia.com/terms/f/fullservicebroker.asp)", "score": 8, "replies": [{"body": "My broker is traditional full-service, there is no online trading with them.  I recognize that this lumps me in with the dinosaurs.  🦕  That being said, I like having someone knowledgeable to bounce ideas off.  Having a broker (that I trust), helps me steer clear of the turkeys. 🦃  I am mostly a long investor, but like this theta idea.", "score": 6, "replies": [{"body": "How can you trust a broker? I assume that 100% of them are scammers these days.", "score": 2, "replies": [{"body": "TLDR: Personal recommendation, and subsequent long relationship.\n\nFunny story:  early in my career, when I started to have a little money to invest, I got a called by one of those boiler room outfits. They almost reeled me in. This is before smart phones, and people used to answer their phones in those days.  I told my current broker about this experience. He said those guys would call 100 people, tell 50 of them to buy a stock, and 50 others to sell it.  Later, they would call the ones that made or would have made a profit - a technique to establish trust.  I really enjoyed \"Wolf of Wall Street\" and \"Boiler Room\" partly because I nearly got suckered. \n\nMy first real broker was a cold call, but it worked out.  I liked what he said, and he wasnt trying to sell me whole life insurance. Then, he went off to start his own boutique and I wasn't comfortable going with him. Got a solid recommendation from a friend and moved to current broker.", "score": 6, "replies": []}]}]}]}, {"body": "Did you sell them prior to earnings? The options were extra juiced before ER", "score": 3, "replies": [{"body": "No, I wrote them a while back, so missed out on that surge over 500.  The shares did not get called, so I still own the long position, and the CCs.  I have already learned a bunch, just reading this sub.  One of the first things I have learned here is that 6 months TE is too far out.  I’m just sitting on my hands rn.", "score": 3, "replies": [{"body": "Oh ok, I see. Yeah that is pretty far out.. if you wanted to you could probably buy them back as the stock dips and be money ahead (if you wanted to sell a shorter dte and/or different strike)", "score": 1, "replies": [{"body": "You are correct, I could sell to close today for example and make a small profit. My insurance puts are up also.", "score": 1, "replies": []}]}]}]}, {"body": "It’s good that you bought an insurance for put. That’s very smart move imo. That’s a collar strategy which I learned after I screwed up my account. Anyway, glad someone’s taking conservative approach. Rule#1 try to preserve as much cash as possible without losing then profits will follow. GL!", "score": 2, "replies": [{"body": "There are two rules to investing:\n\nRule 1: Don't lose money.\n\nRule 2: Lock in your profits.", "score": 1, "replies": []}]}, {"body": "The reason there are multiple levels, is when you start [naked or mis matched ratios] selling options, you have the potential to lose more than what you have in your account. You can’t do that buying options or selling covered calls. \n\nI think there are 4 or maybe even 5 levels of options approval by the time you get them all", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "18779ny", "created_utc": 1701311104.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 14, "comments": [{"body": "I’ve read a lot of stupid shit on Reddit. This might be the stupidest.", "score": 19, "replies": [{"body": "It's the same ole canned nonsense from the short-selling  club, or the radical political crew", "score": 1, "replies": []}, {"body": "Young grasshopper, you have much to discover", "score": 1, "replies": []}]}, {"body": "After today’s fiasco Tesla might be their only advertiser.", "score": 7, "replies": []}, {"body": "I definitely don't want to see Elon dump a bunch of Tesla shares on the open market so some advertising on X seems like a better option if it stops that.\n\nFor context Tesla is once again the most shorted stock. I would rather not see them enriched.", "score": 3, "replies": []}, {"body": "Should tesla advertise? Yes. \n\nShould they throw a life raft to twitter? No. \n\nThe right answer is somewhere inbetween\n\nIdk what you’re going on about tho.", "score": 3, "replies": []}, {"body": "Yes", "score": 2, "replies": []}, {"body": "In case you weren't aware Elon told X boycotters to \"go fuck yourselves. Repeatedly. It was epic.\n\n[https://www.youtube.com/watch?v=zlgBcyfybWI](https://www.youtube.com/watch?v=zlgBcyfybWI)", "score": 2, "replies": [{"body": "He might be the dumbest mofo on this planet.", "score": -1, "replies": [{"body": "Funny because he might actually be the smartest", "score": 1, "replies": []}]}]}, {"body": "Please no. Tesla is already low on cash might need to raise more money by issuing more shares. Elon needs to stop wasting time on X and work at Tesla full time. Tired of this guy not taking shareholders seriously. X is his company why should TSLA investors bail it out lol", "score": 0, "replies": []}, {"body": "Clearly a conflict of interest", "score": 0, "replies": []}, {"body": "\"FUD Filters | We need standards to crack down on spam.\n    If you have any suggestions, please reply here, and we can make sure others can view/agree/disagree and we do this right, together.\n\n  Creating post saying you sold shares\n  - If you're creating a post stating you sold shares at a loss, a screenshot of your sold position will be required, else it will be removed as spam.\n\n  Creating a post regarding a tweet\n  - If you're creating a post regarding a tweet, the original TWTR url must be linked on the post as well, else it will be removed as spam.\n  - Flair used must be TWTR\n\n  Creating a self-harm post\n  Creating a Poop Post or Low Effort Post\n  - Yes, these will automatically be removed.\"\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "FUD…. pile the strange on…. not going to stop today’s rocket.", "score": 1, "replies": []}]}
{"title": "Tesla to deliver Cybertrucks after Musk tempers expectations", "selftext": "", "id": "187pjfh", "created_utc": 1701369235.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 27, "comments": [{"body": "They will hand over 10 at the event, then the flood gates are open, 1 million will be delivered in a short course of time. Next years the ramp will reach 10 million delivered. The demand will not stop. Iteratively the next V2 and V3 cybertrucks in new colours and upgrade options will see unprecedented demand. Entire fleets of commercial vehicles, will be quickly swapped to modified cyber truck. And all the while, the model Y will continue to remain the most popular EV as it is this very moment. Sales of EV’s will soon eclipse ICE Dirty smelly pollutant spreeing Russian gas spewing dinosaur machines.", "score": 2, "replies": [{"body": "It'd be cool if this is some sleeper cell reddit account with insider knowledge. But 1 million in \"a short course of time\" sounds astronomical.   \n\n\nI think consumer demand will be high. But I think they're pricing the CT high right now to price some of the market out. Once they've made their money, they'll be able to reduce prices and THEN the flood gates will open... when middle America John Doe that makes $100K/year can finally afford to finance one.", "score": 3, "replies": [{"body": "The year isn’t done yet, they have sold almost 2 million EV’s of their older models. Demand is highest for a product on release. They will sell every single Cybertruck they produce. If they can make 1 million, 1 million will be delivered to willing buyers. They have 2 million paid preorders waiting. They increased the cost of preorder to $250, and they are being bought up as we speak. 1 million in a short period barring the limitations of physical reality in production, is not an unrealistic number given the above values.", "score": 2, "replies": [{"body": "Are you assuming a drastic price reduction when production fully ramps up?  I don’t think that kind of demand is there when base price is this high", "score": 1, "replies": [{"body": "It’s the beauty of giga casting and Tesla’s state of the art automation manufacturing. Combined with lithium from their own mine, and the goal of getting as many EV’s to replace gas cars. It’s almost definite, if shorts don’t sabotage them, in some ludicrous way.", "score": 1, "replies": [{"body": "So the answer to my question is yes?  By how much ?", "score": 1, "replies": [{"body": "40-50", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Are you trolling? Unprecedented demand? The cyber truck will NEVER even come close to selling as many models as the S X or Y, take your pick.", "score": 1, "replies": []}, {"body": "😂 love the optimism, go bulls", "score": 0, "replies": []}, {"body": "You might be right if you cut that to 100k delivered next year.  Maybe.", "score": 1, "replies": []}, {"body": "And then the acid you dropped will wear off.", "score": 1, "replies": [{"body": "What’s hard to believe? They didn’t believe we’d see a production Cybertruck this year. Those fools aren’t talking now. Or is it the 1.8 million EV’s sold this year that you can’t understand? Ah I got it! Its he part where you use numbers to predictively ‘guess’ what’s to come, thaaats the part that seems like mystical magic right? 🤡\n\nOh look a space rocket that lands itself, this acid trips keeps getting better, it’s mushrooms btw.\n\nhttps://x.com/elonmusk/status/1730784086392803656?s=46&t=ZnPtZ9FsMbXFVF0BEMqU2w", "score": 0, "replies": [{"body": "Wow, I actually stumbled across Elon’s burner account on Reddit. That’s just sad", "score": 1, "replies": [{"body": "Wow; not sure if this is supposed to be funny, it’s not.", "score": 0, "replies": []}]}, {"body": "No, the Cybertruck was announced in 2019, haters like me thought a 2023 release was a fair estimate based on his past track record", "score": 1, "replies": [{"body": "Yes, it was released in 2023. Solid work there buddy.", "score": 1, "replies": [{"body": "Yeah, after three years of missed deadlines when it was supposed to come out in 2021", "score": 1, "replies": [{"body": "Yes taking on an entire segment of vehicle class that has never been unseated, sometimes takes a couple extra days. LOL, he didn’t promise you anything 😂 and yet here we are, anyone who wants this awesome electric truck can have one. I CANT WAIT TO GET MINE 🤗. What are you looking forward to? New episodes of boys meet word?", "score": 1, "replies": [{"body": "The Ford F-150 Lightning was announced in 2021 and released in 2022", "score": 1, "replies": [{"body": "Wow. Such innovate! Much wow!", "score": 1, "replies": [{"body": "You're talking about \"innovation\" and referencing a meme from 2013", "score": 1, "replies": [{"body": "https://youtu.be/UMsFRhQfaLQ?si=Qbr3JblaTsmcDGU7", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Wooooow dude. Lmfao.", "score": 1, "replies": [{"body": "Wild ain’t it?! 😏", "score": 1, "replies": [{"body": "Yes, your delusion is wild lol.", "score": 1, "replies": [{"body": "So is 1.8 million EVs sold in a year! Impossible!", "score": 1, "replies": []}]}]}]}, {"body": "What’s your pusher’s number?", "score": 1, "replies": []}]}]}
{"title": "Short tesla", "selftext": "[removed]", "id": "187g1jn", "created_utc": 1701342307.0, "score": 2, "upvote_ratio": 0.55, "num_comments": 17, "comments": [{"body": "Thanks for your submission! \n\nr/WallStreetBets is known for making absurd but sometimes profitable trades that no one ever considered possible.\n\nTo keep making that possible, we need your help in keeping the feed of threads interesting and exciting.\n\nWe try to move all the short and basic questions, analysis, or jokes to the daily thread so that the best quality content can stick around and be more visible. \n\nThis is definitely a bit subjective, and there are no hard and fast rules, but a few indicators that your post should have really been a comment in the daily thread include:\n\n* Asking a question that is easily googleable or has likely been asked before. E.g. \"What app should I use?\", \"What should I invest in?\". \n\n* Beating a meme to death, like the 10 millionth, \"inverse cramer\" joke again. \n\n* Reposting jokes from the front page but slightly altered to be related to trading. \n\n---\n\nAll that being said, we are here to help. We want to make it as easy as possible for you to post to our community. We have to balance this with making the subreddit interesting for our readers. \n\nIf you need some guidance, don't hesitate to [reach out to modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets) and we'll give you some pointers!", "score": 1, "replies": []}, {"body": "Ketamine Karen lost it.", "score": 4, "replies": []}, {"body": "I’ve been out of TSLA for a month or so now, can’t support his wackadoo behavior", "score": 3, "replies": []}, {"body": "Never bet against Elon.  I learned the hard way.", "score": 5, "replies": [{"body": "That was then. This is now.", "score": 2, "replies": [{"body": "Let's see how earth responds to that", "score": 1, "replies": []}]}]}, {"body": "Calls it it, got it. ![img](emote|t5_2th52|29637)", "score": 3, "replies": []}, {"body": "Guy is losing it.", "score": 2, "replies": []}, {"body": "Best to just sell covered calls", "score": 4, "replies": [{"body": "Sure because I have 24k laying around.", "score": 1, "replies": [{"body": "Think bigger, think unsecured loans", "score": 1, "replies": []}]}]}, {"body": "Never short TSLA", "score": 3, "replies": []}, {"body": "I have about 2,000 shares. Gonna ride it out.", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|3 months ago\n**Total Comments**|1|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Sell the news and then buy calls.", "score": 1, "replies": []}, {"body": "R u kidding me...is the next best thing after Biden", "score": 1, "replies": []}]}
{"title": "But I thought we were gonna have \"Reverse stock market\" crash. (aka Meltup rally) So why is \"Wyckoff Distribution\" playing out? #SPX500", "selftext": "", "id": "187gpme", "created_utc": 1701344879.0, "score": 12, "upvote_ratio": 0.71, "num_comments": 14, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|4219|**Previous Best DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 19, "replies": [{"body": "Got him!", "score": 1, "replies": []}]}, {"body": "I can verify this, my tea leaves came out super bearish this morning. Market crash late Q1/early Q2, but let me know if you need me to shake the cup around tomorrow and I might be able to nudge the timing a bit.", "score": 16, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "Yo kremlinhelpdesk do you know where my weed is? I left the leaves next to the teapot.", "score": 2, "replies": [{"body": "I recommend trying the flowers next time, but maybe this explains my anxiety, usually bearish signals give me good tingles.", "score": 3, "replies": []}]}]}, {"body": "Wyckoff distribution happens when I browse too much pornhub.", "score": 9, "replies": [{"body": "I wyckoffed twice today", "score": 3, "replies": []}]}, {"body": "This only works when were not in phase V of the jakhof cycle. Which if you zoom out we are clearly not. Spy 690.", "score": 8, "replies": []}, {"body": "I predict that the S&P 500 will continue to rise in the short-term, but there is a chance of a correction in the longer-term.", "score": 5, "replies": []}, {"body": "What? Stonks are up?!\n\nhttps://preview.redd.it/5nuwepj2ch3c1.jpeg?width=615&format=pjpg&auto=webp&s=2085b982176dcdb842b262b21df3ba313d11ddde", "score": 3, "replies": []}, {"body": "Mind the gap...SPY looking to make some of that 440 steel...", "score": 1, "replies": []}, {"body": "Ugh. Wyckoff is my exgf’s last name. Every time I hear it I wanna kill someone. \n\nI’m 99% sure she’s related to him too.", "score": 1, "replies": []}, {"body": "Dang ol fartley pattern", "score": 1, "replies": []}]}
{"title": "Dividend Stock NVDA", "selftext": "Guys, I found this small company called NVIDIA (Ticker NVDA).  \nThey make potato chips or something.   \nAnd they pay a pretty good dividend of 0.16$/share and they payed it out for more than 10 years with consistent growth.  \nAnd allegedly you can receive your dividend also in leather jackets instead of cash if you like.\n\nTheir fundamentals look pretty juicy as well, a P/E ratio of only 64 and a P/B of 36.  \n\n\nWhat do you think, is this a good buy for my dividend portfolio?   \n", "id": "187j392", "created_utc": 1701352554.0, "score": 8, "upvote_ratio": 0.57, "num_comments": 18, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|1 month ago\n**Total Comments**|106|**Previous Best DD**|\n**Account Age**|8 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": ">This company does not look like a good investment at this time.", "score": 25, "replies": []}, {"body": "never heard of them...is it Swedish ?", "score": 11, "replies": [{"body": "No you're thinking of the Swedish House Mafia, this is the Taiwanese chip mafia.", "score": 2, "replies": [{"body": "You're thinking of the Swedish House Mafia, not the Taiwanese chip mafia.", "score": 4, "replies": [{"body": "Don't copy my post and take credit, bad bot.", "score": 2, "replies": []}]}]}]}, {"body": "r/dividends literally jerks themselves off calling MSFT and NVDA dividend stocks and that's why dividends are best.\n\nThe mods of that sub are straight up regarded", "score": 9, "replies": [{"body": "Maybe if you bought them in like 1990 lol", "score": 3, "replies": []}]}, {"body": "Holy shiiiit, what a steal brother. I'm going to pour my life savings into it now. Leverage my mortgage too.", "score": 3, "replies": []}, {"body": "10*470$=4700 $\n10*0,16¢=1,60$", "score": 3, "replies": []}, {"body": "DD is solid.", "score": 2, "replies": []}, {"body": "\"small company\" ![img](emote|t5_2th52|4275)\n\n&#x200B;\n\nis inflation so bad that 1T$ company is a small company now?", "score": -11, "replies": [{"body": "They must sell a lot of potato chips.", "score": 5, "replies": []}, {"body": "Inflation is so bad that this company is valued at $1T", "score": 1, "replies": []}]}, {"body": "its a buy and hold any chance you get.", "score": 1, "replies": []}, {"body": "Leverage up 100x", "score": 1, "replies": []}, {"body": "Ooh, can I get one of those Leon Musk bomber jackets for my dividend??", "score": 1, "replies": []}, {"body": "Sounds like a fucking bargain, fuck mortgage payments this is where your money should go", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "187lbw4", "created_utc": 1701358522.0, "score": 15, "upvote_ratio": 0.82, "num_comments": 9, "comments": [{"body": "Time for another BTC price hike", "score": 2, "replies": []}, {"body": "Can someone please explain this? How do you have an exchange traded fund that only focuses on one asset? That doesn't make sense.", "score": 1, "replies": [{"body": "No different than an ETF that tracks gold, uranium, or any other number of single assets. ETF doesn’t mean they have to have multiple holdings, it just means it’s a fund that trades on an exchange so that common investors, pension funds, etc can easily invest.", "score": 9, "replies": [{"body": "There is no difference between an ETF that tracks a single asset and one that tracks multiple assets. Both are investment vehicles that trade on exchanges and allow investors to easily invest in them.", "score": 1, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|2 months ago\n**Total Comments**|1|**Previous Best DD**|\n**Account Age**|2 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "I am happy to help those in need.", "score": 3, "replies": [{"body": "A friend in needs a friend indeed", "score": 1, "replies": []}]}]}]}
{"title": "Finviz PFE", "selftext": "u/PFE Why am I the only person looking at Pfizer and thinking it's one  of the best January effect plays in history? They have a weight loss  pill about to release huge data and almost zero insider sells in the  last year? Amazing chart.\n\n[PFE Monthly Right at 200 Day SMA](https://preview.redd.it/bdv8eb6tbi3c1.png?width=1000&format=png&auto=webp&s=973d04d5f7a600141cf44eb47111932732e49d44)\n\n&#x200B;\n\n[PFE insiders almost zero sales with tons of 30$ options exercise](https://preview.redd.it/hwfqmskxbi3c1.png?width=1408&format=png&auto=webp&s=a228bfbba9c080f3530388fa4d8ac0aba5a52b34)", "id": "187lsrz", "created_utc": 1701359740.0, "score": 11, "upvote_ratio": 0.92, "num_comments": 29, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|2 years ago\n**Total Comments**|19|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Why are people shilling Pfizer?", "score": 6, "replies": [{"body": "Lots of bagholders out here. Me included.", "score": 7, "replies": []}, {"body": "I think it just came down with the other vax stocks as the majority of their recent revenue was from Covid shots.", "score": 1, "replies": []}]}, {"body": ">Pfizer is definitely one of the best January effect plays out there. The data looks very promising and the insiders seem to be bullish on the stock.", "score": 5, "replies": []}, {"body": "I think a lot of pharm stocks will see a rebound with cold and flu season, however the negative sentiment on covid vaccinations is a huge risk. Pfizer is diversified enough product wise to possibly be worth it.", "score": 6, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": " The twice daily treatment danuglipron could be 8 Billion a year.  The therapy lotiglipron 2 pills a day was scrapped after patients who took the drug in clinical studies were shown to have elevated levels of liver enzymes.", "score": 1, "replies": [{"body": "And they’re massively involved in pneumonia - hello current situation in China.\n\nWent in on it yesterday so funny to see this today :)", "score": 1, "replies": [{"body": "https://youtu.be/_4UF2dBq45c?si=HzcQBJQeh7EqFmoj", "score": 1, "replies": [{"body": "We both saw this before mad money. Let’s hope Jimmy rocks this to the moon 🌙 ![gif](emote|free_emotes_pack|surprise)![gif](emote|free_emotes_pack|money_face)![gif](emote|free_emotes_pack|upvote)![gif](emote|free_emotes_pack|upvote)", "score": 1, "replies": [{"body": "Cramer kiss of death as usual, weight loss pill poor results won’t advance to phase 3.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I don’t think it’s time to catch the falling knife yet. Could be a good buy in Feb or March", "score": 3, "replies": []}, {"body": "100% a buy. just watch.", "score": 3, "replies": []}, {"body": "This didn't age well, at 29 now. Can go lower :/", "score": 3, "replies": []}, {"body": "I noticed some volume on the $40 March calls early last week and got interested. I’m loaded to the fuckin gills 🤷‍♂️ .04 average.", "score": 3, "replies": [{"body": "I'm looking into PFE as well. Thank you for mentioning this! What's your PT around that time? I was thinking it would bounce back to like 30$ but 40$ would be a stretch.. what you thinking? M do you think they will have positive earnings, maybe acquire a company through M/A, or get that 1 a day pill approved?", "score": 1, "replies": [{"body": "ASCO conference in May-June, this will pop heavy", "score": 2, "replies": [{"body": "sweet. thanks", "score": 1, "replies": []}]}]}]}, {"body": "My target is 36 and it always runs High of Month the last day of a month.", "score": 2, "replies": []}, {"body": "and IV is super low too. could be a great play", "score": 2, "replies": []}, {"body": "This aged well 🤣", "score": 2, "replies": [{"body": "Lol", "score": 1, "replies": []}]}, {"body": "FYI they just canceled Phase 3 studies on their weight loss drug.\n\nFail\n\nhttps://www.axios.com/2023/12/01/pfizer-obesity-weight-loss-side-effects", "score": 1, "replies": [{"body": "Yea that’s why it got hammered with that gap down today..", "score": 1, "replies": []}, {"body": "The once a day pill is still a go though..", "score": 1, "replies": [{"body": "Feels like ive aged 5 years in a day. They better report high double digit weight loss with little side effects", "score": 1, "replies": []}]}]}, {"body": "It will go much lower with the weight loss frug trials ending", "score": 1, "replies": [{"body": "The once a day pill still has promise. They have dissected the other weight loss types (Ozempics). Don’t underestimate their Engineers. Zero insider stock sales all year with 33k employees.", "score": 2, "replies": []}]}]}
{"title": "March 15th $520 Meta calls", "selftext": "[removed]", "id": "187mcru", "created_utc": 1701361132.0, "score": 4, "upvote_ratio": 0.62, "num_comments": 13, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "What is op smoking", "score": 7, "replies": [{"body": "Pure money moves baby", "score": 1, "replies": []}]}, {"body": "Wait until tomorrow", "score": 5, "replies": [{"body": "Going up baby!!!", "score": 1, "replies": []}]}, {"body": "We're going to need to see a little more proof for a first time poster dropping 7 figure plays.\n\nPost removed and reach out in mod mail for further verification steps.", "score": 2, "replies": [{"body": "Proof of what exactly? Either way 🚀🚀🚀🚀", "score": 1, "replies": []}]}, {"body": "Dude you won capitalism", "score": 0, "replies": []}, {"body": "Don't ever trade again in your life, just leave it all", "score": 1, "replies": [{"body": "I’ll cash app you 1k when it hits, if it doesn’t, well I’ll shoot you an invoice lmao", "score": 1, "replies": []}]}, {"body": "why is the green line going down tho ![img](emote|t5_2th52|4275)", "score": 1, "replies": [{"body": "Turn your phone sideways. There’s always a way to go up", "score": 1, "replies": []}, {"body": "Intrinsic value", "score": 1, "replies": []}]}]}
