{"title": "Is the stock market gonna crash on Monday or nah?", "selftext": "[removed]", "id": "7wuffl", "created_utc": 1518373012.0, "score": 0, "upvote_ratio": 0.34, "num_comments": 41, "comments": [{"body": "I'll tell you on Tuesday", "score": 57, "replies": []}, {"body": "I wish the mods wouldn't let low quality posts like this through", "score": 31, "replies": [{"body": "Check his username.", "score": 10, "replies": []}, {"body": "There's a report option for low quality/low effort, I use it.", "score": 3, "replies": []}, {"body": "Then there wouldn't be much left.", "score": 2, "replies": []}, {"body": "Do you expect more low quality posts on Monday or nah?", "score": 2, "replies": []}]}, {"body": "This correction has been the most exaggerated fearmongering ever OMG. The global economy is very strong and increasing interest rates by 0.5% is not gonna cause a freaking recession.", "score": 7, "replies": [{"body": "You delusional if you don't think the market behaves like a panicky little bitch", "score": 7, "replies": [{"body": "So basically, buy the dip", "score": 3, "replies": [{"body": "Yeah buy it when it happens ", "score": 3, "replies": []}]}]}, {"body": "https://northmantrader.com/2018/02/11/rising-debt-rising-rates/", "score": 1, "replies": [{"body": "This is nothing new. The US has had insane debt levels for literally 100+ years. The bear arguement for an eventual crash has always pointed to this, and rightfully so because the US is being too careless. However, in the medium term, the global economy looks strong and we can only hope that they actually start paying back their debts", "score": 1, "replies": []}, {"body": "This is nothing new. The US has had insane debt levels for literally 100+ years. The bear arguement for an eventual crash has always pointed to this, and rightfully so because the US is being too careless. However, in the medium term, the global economy looks strong and we can only hope that they actually start paying back their debts", "score": 1, "replies": [{"body": "> The US has had insane debt levels for literally 100+ years.\n\nThe article talks about recent fiscal changes.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "AH from Friday means jack shit. ", "score": 7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No he means the futures you just looked at is old information since it was traded off of Friday. futures truly open every Sunday 6 pm EST for Monday's open. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "https://www.ig.com/uk/weekend-trading\n\n\nIf you look here at ... Weekend FTSE 100, Weekend Germany 30 and especially the Weekend Wall Street. They are down alot, They hardly ever move at all. There is a strong indication that there will be a VERY big downward movement this week. \n\n", "score": 2, "replies": []}, {"body": "Thursday ", "score": 2, "replies": [{"body": "Wednesday ", "score": 1, "replies": []}]}, {"body": "Based on trend following principles, the market is already in a downtrend. The 5 day MA crossed down the 50 day MA. That's sell signal #1. The 10 day MA is close to crossing down the 100 MA, that would be sell signal #2. Volatility entered a bull market at the end of January and TBT, a way to bet that interest rates will rise, is in a bull market. So you have rising interest rates, rising volatility in a market that is trending down. But no, I don't expect a crash to happen Monday. CPI data is due Wednesday. If inflation is rising faster than expected then that will cause more panic selling. I expect the SP500 to hit 2400 by March if inflation is picking up. Not a time to sell everything yet, but definitely look at your portfolio and see if you're over-leveraged in any position as volatility makes stocks a riskier asset. ", "score": 2, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Any financial outlet should publish the numbers once they're out. I use https://www.dailyfx.com/calendar", "score": 1, "replies": []}, {"body": "I'm glad you are paying attention to what's important.", "score": 1, "replies": []}]}, {"body": "Most people that don't auto-rebalance are overleveraged. It is insane to be so stock-heavy, but maybe I'm just scared because unlike a lot of people here I remember 2008. Was 100% stocks until last month when I slowly shifted to some cash, finally sold last monday after that amazing run-up in january.", "score": 1, "replies": []}]}, {"body": "Ride through the storm. No, I don't think the market will \"crash\" on Monday but I do expect the market to end the day lower. ", "score": 2, "replies": [{"body": "exactly how i imagine monday is gonna be. Open green then falls to red during closing hours. This will probably continue for another month tbh. just speculations tho", "score": 1, "replies": []}]}, {"body": "I'd say that market direction will be more clear by the end of this month, or 2nd March. Either this, or volatility will continue and keep everyone questioning where we're going next. Interesting times! ", "score": 1, "replies": []}, {"body": "how bad was the crash of 08? will this repeat? and is inflation going to rise with cash being not an issue for the government after last week?", "score": 1, "replies": [{"body": "Depended on how one was positioned; maybe, but probably not just yet; I’m betting on it via long gold and short bonds. ", "score": 1, "replies": []}]}, {"body": "Nah", "score": 1, "replies": []}, {"body": "Removed, rule 3, low quality.", "score": 1, "replies": []}, {"body": "Depends on if the central bankers want to crash it or not. The price run up over the last few month and the liquidity numbers do remind me of 2007/early 2008 when the banks were dumping their toxic assets (rated AAA of course) and leaving average investors holding the bag.", "score": -1, "replies": []}, {"body": "We won't fully recover till the summer. Part of the speculation is just uncharted territory is what I think. I wouldn't sell everything because it is a little bit late on that.", "score": -1, "replies": [{"body": "lol. Was it a little bit late in 2008 to sell after dropping 10%? Monday will be very telling. It may be a minor correction, but if it's an actual bear market this is only the beginning. ", "score": 1, "replies": [{"body": "Yeah your right  though if it is just a small correction no need to sell off everything.", "score": 1, "replies": [{"body": "Right, and that lies the Q. If it's a small correction then keeping it in stocks is good. If it's a bear market selling now is good. Every bear market starts as a \"correction\". We'll see how this pans out. Next week will be telling.\n", "score": 1, "replies": [{"body": "If you’re a long term investor there’s little risk in holding through a bear market.", "score": 1, "replies": [{"body": "Right, unless you sell later...which a lot of people do. Lose your job? Need money in the downturn? Has to come from somewhere...", "score": 1, "replies": [{"body": "This is why you have an emergency fund that’s separate from your investments.", "score": 1, "replies": [{"body": "Right I'm sure every American has one of those. ", "score": 1, "replies": [{"body": "Last I heard the average emergency fund was under 500 bucks lol. ", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}
