{"title": "QQQ SIDEWAYS FOR FOUR(4) WEEKS ... TECHNICALS SUGGEST IT WILL ROLL OVER SOON", "selftext": "I have been selling overhead spreads in the QQQ for credits for what feels like forever. Making coin, but not a lot.  This week my mind has taken a shift toward more bearish bets.  10y yield is stubborn and at some point will pull money out of the market. Now we have a hedgie go under.  The market never reacts right away, that would be too easy. The sideways action has been milked I'm sure. We don't have to move out of the box. However, I'm starting to feel we will.\n\nMy target for the move is Prior to APRIL 6 ...\n\nCurrently I hold some Bearish Credit Call Spreads in RCL USO QQQ .. Today I added MTN in a bearish put spread to my existing play in RCL .. Both expire May 21 ... I have been strictly playing the QQQ and some carefully picked stocks on the weekly. Now I'm ready to take some bearish plays to May.\n\n&#x200B;\n\n[The first peak in QQQ September pushed above 70 rsi. The second peak in Feb failed at 70 rsi. This is not the first time I have seen this lead to a multi month sell off.  If you go back to March 2020 you can see the weekly went all the way to RSI 30 before bouncing](https://preview.redd.it/ou0gk5ywg9q61.png?width=724&format=png&auto=webp&s=8e213ccb467f05bd9982fa126bea61a6eca3cac9)\n\nLULU just posted decent earning and the stock is declining. Many on WSB were buying up BB prior to earnings and my charting points to $7.50 ... Get the feeling we are seeing the old \"unload on to retail\" trick here.  I'm not saying we crash. I'm just saying that my slightly bearish plays of selling Bearish Credit Call Spreads is now leaning to the purchase of some premium with Bearish Put Spreads. So, my plays are going to be more reliant on the QQQ falling to at least the $290 mark soon.\n\nUPDATE 03-31 7:45am .. 15 minute rule .. Got a Credit Spread that expires tomorrow for $75 credit in the 318-320 Bear Call.  Pretty nice risk reward.  Get $75 ,, Most I can lose is $125 if it hits $320 and the most I can gain is the $75-fees if it closes tomorrow Sub $318 .. MaxPain is 315-316 .. 8:00am got another at $93 credit. Bought a third contract at $105 credit. This is all I'm taking here. 75+93+105 = 276/3 = $92 average... Stop loss is $90 if it hits $1.22 credit I'm out. The only trade for today. --- GOT STOPPED OUT\n\nUPDATE 9:15 am ...  STOPPED OUT of this trade as it held $318.15 for too long and that was an area that I had for price rejection today. Get the feeling I got out when I should have got in :)  See what next week brings. Good luck all!\n\nUPDAT 9:33 am.. All I am keeping from this trade is ... 2x 319/320 Bearish Credit Call spreads that expire tomorrow and 1x 318/320 Bearish Credit Call Spreads. This for the QQQ .. Have other positions. The rest is off the table. One thing I really believe in and shorted AMZN @ 3115 is this bell curve would benefit sellers strongly at $3100 or below and especially at $3000 for tomorrow. Will AMZN gap down tomorrow?\n\nI SAY THE QQQ BREAKS 300 ON A WEEKLY CLOSE before APRIL 6th ... Best of luck all.\n\n&#x200B;\n\n04-01 ...  ABNB and MTN and RCL are my most bearish names... [https://bc.ctvnews.ca/covid-19-rules-cases-mean-early-end-to-ski-season-at-whistler-revelstoke-and-big-white-1.5370126](https://bc.ctvnews.ca/covid-19-rules-cases-mean-early-end-to-ski-season-at-whistler-revelstoke-and-big-white-1.5370126) ... [https://montreal.ctvnews.ca/three-quebec-cities-to-go-into-special-lockdown-with-four-regions-reversed-to-red-zones-1.5370263](https://montreal.ctvnews.ca/three-quebec-cities-to-go-into-special-lockdown-with-four-regions-reversed-to-red-zones-1.5370263) ... It ain't over yet. ", "id": "mgufqo", "created_utc": 1617152117.0, "score": 27, "upvote_ratio": 0.77, "num_comments": 78, "comments": [{"body": "Bearish divergence. We'll see if it plays out. I think it's going to be an interesting couple months.", "score": 15, "replies": [{"body": "Gave you silver award for being up at the top of my comment section. Market seems to be telling us, expect more of the same BS .. Violent moves higher, massive account changes in the blink of an eye. Make you believe it is going to rally to the moon and give up a lot of the gains at the end of the day. Look at RCL .. you'd think it was going to $90 the way it was moving. It even skipped over some prices at one point in the day. Gap up mid-day LOL .. Then, craps into the close. I did nothing with this position but watch as my gains vanished and then in the last half hour, reappeared.  After weeks of doing well, today I made the error of using a tighter stop. So, I booked a loss on what I closed. AMZN short looks solid as I did decide to close some options and short the shares @$3115 .. gap down tomorrow and return to $3050?", "score": 3, "replies": []}]}, {"body": "Isn't lulu an obvious pyramid scheme?", "score": 3, "replies": [{"body": "I believe you’re thinking about Lularoe not Lululemon ($LULU)", "score": 12, "replies": [{"body": "you're right i was, thank you", "score": 6, "replies": []}]}, {"body": "..and who even wears athletic wear anymore anyways. We are all indoors", "score": 1, "replies": []}]}, {"body": "It seems like when everyone thinks the same thing will happen things go the opposite direction. Never be sure of being sure. However, I have a qqq put for May 21st and don’t follow my own advice.", "score": 9, "replies": []}, {"body": " i see you used several different crayons for this picture, well done!\n\nI like the analysis. esp short term.\n\nbut in the long term, wtf are ppl going to hype if not new tech? and as long as big old tech keeps buying new tech..\n.. fuck i wish i could draw.\n\ni'd draw a group of investors that are late to the tech party, and, knowing they can't afford the entry fee, they start graverobbing dead stocks like GE and Ford and NCL then they show off they're tendies and diamond rings and pull Night at the Roxbury (the inside of the club is the outside!) and now the party is in the graveyard suddenly. But all these investors wanted to do was get into the tech club for cheaper cover, and all those people that followed the graverobbers into the graveyard are just left with dusty bones.", "score": 4, "replies": []}, {"body": "Historically april is a bullish month, so im excited to see what happens", "score": 4, "replies": [{"body": "I'm not saying we crash. Think it just goes down to 290 to trap a bunch of put buyers and then go back here and bore us to death for a few more weeks.", "score": 2, "replies": []}]}, {"body": "I tend to agree", "score": 7, "replies": [{"body": "Just looked at MONTHLY chart of ABNB .. oh my! Stock got an upgrade this morning.. Someone has a large block to sell?", "score": 7, "replies": []}, {"body": "Ya, I think we go back to test 300. Unfortunately, or fortunately depending on how you play it.", "score": 4, "replies": []}]}, {"body": "Calls are no longer my best friend. \n\n**Friendship over.**\n\nPuts are my new best friend. 🤝🤝🤝", "score": 8, "replies": [{"body": "Rip", "score": 4, "replies": [{"body": "I didn't make any moves but it seems like my calls ended our relationship without telling me anyway.", "score": 3, "replies": []}]}]}, {"body": "trading sideways cuz big money forsee impending margin calls...", "score": 6, "replies": [{"body": "I think selling options to people who think we are going up or down has been lucrative for weeks ... but, that is probably running out of steam. So, time to get rolling in some direction again. Those that can kill IV probably load up on options. Notice how GS came out unscathed on their client going belly up? They probably made money off it.", "score": 5, "replies": [{"body": "just wait!!!!  when shit hits the fan and it will, who comes out on top... competition is good, greed is the issue, and if gonkman is makin em work 100 hrs week, gotta ask yourself, why????  market isnt complicated, right???", "score": 1, "replies": []}]}]}, {"body": "I agree we’re in for a big move, but I get burned too much betting on puts. \n\nI’m throwing a few 100s of my call profits I’ve been eeking out this last month into some major OTM hedge puts, like May 320 level stuff, but other than that I’m not taking any risks \n\nThe fed has fucked my puts one too many times", "score": 3, "replies": [{"body": "This is why I have just been bored to death selling call premium and collecting a tiny cheque each week.  Maybe I should just keep doing that but the gambler in me wants a bigger return and feel the timing might be right. Sellers bail when the news gets good.. I'm not gonna go big for sure.", "score": 1, "replies": [{"body": "Nothing wrong with taking a big risk here and there, as long as you know you’re not a pure gambler haha.\n\nI went pretty all In for the COVID crash on the same gut feeling, and that paid out pretty well.\n\nOver all though puts are a losing play, which I’m sure you know.", "score": 4, "replies": []}]}]}, {"body": "Higher high on price, lower high on RSI. Bearish sentiment", "score": 5, "replies": []}, {"body": "What are your USO plays??", "score": 2, "replies": [{"body": "BEARISH CALL SPREAD that I entered when everyone got giddy about the canal blockage. USO just needs to stay under $42 before April 1 .. .Then, I think I will roll it over selling overhead spread into May.  I'm not so bearish on USO that I'm going to take puts.", "score": 7, "replies": [{"body": "What is an overhead spread?", "score": 1, "replies": [{"body": "Betting against up... Selling the QQQ 318 call and buying the 320 .. is one ... I'm in a few 319-320 that expires tomorrow ... So, a close under 319 and I keep all the premium of that spread. A close over 320 I lose $100 per contract less the premium I received selling the spread.", "score": 2, "replies": []}]}]}]}, {"body": "Invesco has been advertising all over March Madness. So, I would put expirations after the final.", "score": 2, "replies": []}, {"body": "So many tech stocks are so oversold right now I’m not too sure about this", "score": 2, "replies": [{"body": "On what metric? Most of big tech can take a 50% haircut and still be overvauled.", "score": 19, "replies": [{"body": "Exactly. So many people have different ideas of oversold. Look at a monthly chart of this one.. ABNB .. Is that oversold or overvalued or .. On the monthly chart of QQQ , you could say it is overbought.  All matters, what time frame.  I'm trading on a WEEKLY chart set up that I have seen before so I'm going for it. Never in a big way though. Never a yolo all in.", "score": 2, "replies": []}, {"body": "You’re not wrong, I’m just saying some of these super high growth companies have taken 40-50 percent haircuts, if people were willing to buy at twice as high of valuations a few months ago I’m assuming they will come back in to buy the dip pretty soon", "score": 1, "replies": [{"body": "Are those stocks in the N100? Only the top 100 matter. Lots of these small caps dropping like rocks are not in the QQQ .. Let's keep an eye on AMZN. TSLA is still bearish on the weekly. Maybe some good news will help it. However, we have seen lots of TSLA fluff and it keeps doing nothing. My game is APRIL 6th. We could float up here with end of quarter buying by funds and same at the beginning of next month. I'm not saying we go higher first but that is possible based on the funds balancing into stocks. However, I think they be balancing out.", "score": 5, "replies": [{"body": "AMZN has been trading in a tight range for a few weeks now. I’ve been selling naked puts on it and doing well but I’m looking at the daily and the weekly charts and I’m seeing those dojis followed by a low volume red day today also (weekly). Some serious consolidation and uncertainty. Earnings next month so I expect somewhat of a run up. I just don’t know if it’s before or after a leg down to 2800-2900 range.", "score": 1, "replies": []}]}]}, {"body": "That’s not a haircut; it’s decapitation.", "score": 1, "replies": []}]}, {"body": "I have calls onna bunch of tech stocks for this exact reason \n\nRotation back into growth all April", "score": 2, "replies": []}, {"body": "AMZN is a big weight in the QQQ and they are having labor issues... if she falls they all fall.  Keep an eye on this AMZN level ... $3050 .. If it parks at $3050 on Thursday or slightly lower I think the chances we head lower are very high.  If it stays at $3055 or higher by close on Thursday then we may just stay in this stupid range longer. Also, TSLA has still not grown into its value and it made a nice move today but the WEEKLY chart is still bearish. AMZN and TSLA are the QQQ bell weathers in my opinion.", "score": 3, "replies": [{"body": "I agree with you there except I think Amazon is about to breakout to the upside. Same with Tesla even though it is ridiculously over valued", "score": 1, "replies": [{"body": "Find out soon. AMZN sits just above the average price paid for the past year $2,990. So, will the average buyer want out at break even considering the labor issues? We find out in time if we see a waterfall effect or not. AMZN is cut throat. A union would make the competitive advantage somewhat go away. $2950 was the weekly break out point so if $3050 does not hold we need to see that level $2950 hold again. Have to wonder if some long time whales will want to trim position of have been doing so as it has been going sideways since JULY. In JULY the weekly close was $3,200!", "score": 5, "replies": [{"body": "Fair points but it has absolutely killed earnings and I don’t think it’s going away any time soon. If bezos didn’t step down I’d bet they’d be close to $4,000 right now", "score": 4, "replies": [{"body": "Somewhat agree that Bezos stepping down after the last earnings call have a little something to do with how it’s been trading. I don’t think it would be close to $4,000, but definitely not almost sub $3,000.", "score": 4, "replies": []}]}, {"body": "My 2 cents on the labor problems, they double the pay to all of their warehouse workers and it would be just the tiniest dent in their revenue. The bad news cycle though could create a dip due to investor nervousness. Earnings I think will be the thing to shake things out.", "score": 3, "replies": []}]}]}]}]}, {"body": "Bidens infrastructure bill also includes upgrading the country’s electric grid and cybersecurity. This inevitably means that tech companies will get massive funding. This dip is because the inside players want cheap stock.", "score": 1, "replies": []}, {"body": "My opinion, the biggest of the bear weeks are past us now. There has been some data that inflation is not yet out of control, prices are at a discount and have not been dropping off of a cliff. I think investors are nervous but the discount has buyers coming in. I think the discounted stocks will see some neutral to slightly bullish activity. Any notably gains probably will be scaled back quite quickly with profit taking. Anything not yet at a discount could see some more drops before it gets there. Overall I think most big moves, if any, are going to happen after the next set of jobs numbers.", "score": 1, "replies": []}, {"body": "Bruh.. I bought call forn315 April 16 so.. I wish you good luck with that 290$ put.\n\nUr comparing technicals from pandemic to post pandemic.. on the most bullish market of our history:\n\nCheerios,", "score": 0, "replies": [{"body": "Best of luck.  It is like a 65-35 bet here. I'm going to buy some more Credit Spread calls in the 318-320 range that pay out if we stay flat until end of day tomorrow. Then, come next week decide further. Not betting my house on this.", "score": 2, "replies": []}]}, {"body": "I’ve been selling covered calls on UVXY and decided it’s time to sell a covered PUT", "score": 1, "replies": [{"body": "As UVXY continues to depreciate, do you come out ahead on this strategy? Not criticism, genuine curiosity.\n\nI understand the mechanics behind the trade, if UVXY spikes your shares are sold at a profit and if it continues to drop you keep all premium. Is the premium enough to cover the losses on the underlying?", "score": 3, "replies": [{"body": "Not getting it either. If you’re lucky and time it right, a SVXY call LEAP and UVXY put LEAP can last a long time for diagonals, but unclear how UVXY premiums for call > underlying depreciation", "score": 1, "replies": []}, {"body": "I made money day one from premium I captured then every day since then I’ve been collecting theta decay. When my covered call fell 25% I bought back to close position. Now the covered put I sold is falling in price as well. Making money from the price level dips and peaks from theta and implied volatility", "score": 1, "replies": []}]}]}, {"body": "I've been theorizing a big rotation back into growth And out of the dollar in april after Q1 is over", "score": 1, "replies": []}, {"body": "!remindme 1week", "score": 1, "replies": [{"body": "I will be messaging you in 7 days on [**2021-04-07 03:56:14 UTC**](http://www.wolframalpha.com/input/?i=2021-04-07%2003:56:14%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/options/comments/mgufqo/qqq_sideways_for_four4_weeks_technicals_suggest/gsvoag7/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Foptions%2Fcomments%2Fmgufqo%2Fqqq_sideways_for_four4_weeks_technicals_suggest%2Fgsvoag7%2F%5D%0A%0ARemindMe%21%202021-04-07%2003%3A56%3A14%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20mgufqo)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Yea it’s been crazy. Microsoft, amazon, goog are all trading at big discounts right now, even Morningstar ( which does the most conservative fundamental analysis I’ve ever seen) has msft fair value at $263/share which implies a ev/sales of 12x and and adjusted p/e of 36 while still maintains 3% free cash flow yield. It will probably do much better than that. My solution has been leaps on these tech bellweathers bought during dips. If qqq drops to below 300 I’ll buy more. I also have sqqq calls I’m sitting on just in case.", "score": 1, "replies": []}, {"body": "I agree! Look at the options activity for 16 April for QQQ the open interest for the $300 puts is large. Even more, if you go to the $290 there is a slightly smaller but still large amount of open interest. Anyhow, are you thinking there will be a quick big spike sometime before then to let the big guys exit and attempt to trap retail?", "score": 1, "replies": [{"body": "A large open interest in PUTS would imply we continue to trade sideways.  This is why I'm not making a large bet on this. My main bet is more sideways. But, the probability of moving lower early April seems to be increasing based on the chart.", "score": 1, "replies": []}]}, {"body": "Is this TA on an index fund? That tracks the price of underlying equities? How is that possible lol", "score": 1, "replies": [{"body": "You know that TA was originally just done for indexes right? It’s actually less reliable for individual equities because idiosyncratic developments have a bigger impact on them than on the entire market.", "score": 1, "replies": []}]}, {"body": "Ahh I just bought and sold puts on QQQ! I have spreads on Chewy, Bidu, Nabors and puts on GME and QQQ. Let's see if they work out\nBoth Chewy and Bidu already hit, and Nabors is about to be in the money today looks like, at least within a dollar or 2. I need QQQ to drop to $300 to be ITM though", "score": 1, "replies": []}, {"body": "It just gapped up with infrastructure news so lets see how your theory plays out", "score": 1, "replies": [{"body": "Didn't keep much of this trade. Shorted AMZN at $3115 .. .looking for $3050 ... this should drag down QQQ from here.  Nobody knows anything for sure. I've been winning a lot for the past 2 weeks so maybe time for me to lose :)", "score": 5, "replies": []}, {"body": "I took $75 Credit spread 318/320 Bearish Call that expires tomorrow. Trading very small here.  Not doing anything else today.", "score": 1, "replies": []}]}, {"body": "The Qs are taking of this morning. Gonna make for a nice put entry!", "score": 1, "replies": []}, {"body": "Today looks like a potential breakout to the upside of a sideways wedge that began forming mid Feb.", "score": 1, "replies": [{"body": "I got stopped out of this QQQ trade.  FAIL .. $318.15 .. more than 3 15minute candles above on day I expected the price to stay under this level 100% .. So, emotions out and bailed.  SHORTED ABNB @ $191 .. chilling for the rest of today. That was wild.", "score": 1, "replies": []}]}, {"body": "Im curious as to why you're bearish on MTN. Im bullish on it as they just knocked 20% off pass prices for next year, I feel like with the major pullback its seen from recent highs, pass discounts, and pent up demand from people who didn't ski because of covid that next year could be a huge boom season for them... I don't see any bearish catalysts for them on the horizon but I'm interested to hear your take.", "score": 1, "replies": [{"body": "Increase in debt. This story just broke but did not make it on to any financial channels. https://www.cbc.ca/news/canada/british-columbia/whistler-blackcomb-says-it-will-remain-closed-until-may-21-1.5970626 .. Plus, analyst low price target. Crowded trade if any institution needs to rebalance it trades very light so it is subject to sudden gap downs and multi week drawdowns in the past. Plus, the discount on the passes will hurt profits and seem desperate.", "score": 1, "replies": [{"body": "This article is just about whistler? One of Vail's many resorts... also doesn't say anything about vail resorts debt? Another analyst just released price target for $350?", "score": 1, "replies": [{"body": "It's all cool. Just do your own research if you want to trade it. You can take the other side and it won't hurt my feelings :) I'm bearish for those reasons and I can see Covid making a come back in my area. Find out in a few weeks.", "score": 2, "replies": [{"body": "I had long calls that I was already up 40% on so I decided to take my profit and run tbh 👍🏼 time will tell if I should've held onto them but nobody ever went broke taking profit", "score": 2, "replies": []}]}, {"body": "Also, I just shorted AMZN at $3115 so I'm a bit of an idiot. Average analyst target is $4000 lol ... I just trade the charts really.  I have a stop at $3125 so if I hold overnight I better hope it does not gap over that.", "score": 2, "replies": []}]}]}]}, {"body": "What fundamentals is this based on? Just a 10 year yield? \n\nMarch is always traditionally very bearish because it's the end of the tax year, companies take profits and need money to pay off their corp tax bills. \n\nApril is always traditionally very bullish as the dust settles and investors come back in. \n\nCurrently I see no difference here. If I had a dollar for every time I seen a post for a 'stock market' crash I wouldn't need to trade.", "score": 1, "replies": [{"body": "GOT stopped out of the trade ... TSLA ABNB and ROKU are my shorts near the peaks today due to MaxPain", "score": 1, "replies": []}, {"body": "ABNB and MTN and RCL are my most bearish names... https://bc.ctvnews.ca/covid-19-rules-cases-mean-early-end-to-ski-season-at-whistler-revelstoke-and-big-white-1.5370126 ... https://montreal.ctvnews.ca/three-quebec-cities-to-go-into-special-lockdown-with-four-regions-reversed-to-red-zones-1.5370263 ... It ain't over yet.", "score": 1, "replies": []}]}, {"body": "Glad it’s not below 300... yet. 😣", "score": 1, "replies": [{"body": "Well, I got stopped out pretty quick on this idea.  Than sat in awe mostly.  Very small trading. Something very strange is going on.  I think that we are going to see a lot of QQQ calls finish in the money and those shares will be dumped on the lucky winner and then the market falls. Upgrade after upgrade on stock prices . RCL got one .. look at what it did today.  ASO killed it on earnings, look at it after hours. All that matters to keep this QQQ up is AMAZON FACEBOOK APPLE NETFLIX and GOOGLE .. The rest can just die I guess, including TSLA", "score": 2, "replies": [{"body": "I agree with you. I’m happy that it’s not tanking, but I’m skeptical of it’s current trend like you.", "score": 1, "replies": [{"body": "https://www.reddit.com/r/options/comments/mmu9u9/gme_weekly_chart_suggests_a_pull_back_next_week/", "score": 1, "replies": []}]}]}]}]}
{"title": "Tesla secures 320,000 square foot warehouse in San Bernardino, California", "selftext": "", "id": "mh7c5r", "created_utc": 1617200999.0, "score": 290, "upvote_ratio": 0.98, "num_comments": 72, "comments": [{"body": "Parts distribution makes sense. As Texas grows and take on more of the production, Fremont can be freed up to help supply more parts. Just a guess.", "score": 18, "replies": []}, {"body": "👀", "score": 34, "replies": [{"body": "Look, TSLAQ was always wondering where Tesla is hiding all those unsold cars.", "score": 74, "replies": [{"body": "😂🤣", "score": 19, "replies": []}, {"body": "Or cars sold to Tesla itself. Lol", "score": 8, "replies": [{"body": "I mean eventually they will be selling cars to themselves for their RoboTaxi fleet.", "score": 1, "replies": [{"body": "Looking forward to that day, when we all shall be much richer ...", "score": 1, "replies": []}]}]}, {"body": "That’s where they’re manufacturing and storing the new batch of short shorts.", "score": 2, "replies": []}, {"body": "Didn’t they claim Tesla was dumping them into the ocean? 🤣", "score": 1, "replies": []}]}]}, {"body": "How big is freemont?  \n\nEdit:  5.3M sq ft", "score": 33, "replies": [{"body": "Bear in mind that’s one of the worlds largest buildings", "score": 17, "replies": [{"body": ">Bear in mind\n\nWe don't do that here! Only bull in mind!", "score": 37, "replies": []}, {"body": "8th largest building in the world by footprint on the ground.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I never get it right, lol", "score": 1, "replies": []}]}]}, {"body": "Ideas on what this used for... go!", "score": 29, "replies": [{"body": "Rave parties", "score": 48, "replies": [{"body": "Porn shoots", "score": 13, "replies": [{"body": "So, they'll be keeping the new Roadsters with the SpaceX package here?", "score": 5, "replies": [{"body": "Package ( ͡° ͜ʖ ͡°)", "score": 2, "replies": []}]}]}, {"body": "Techno parties for the technoking!", "score": 4, "replies": []}]}, {"body": "Customer service training?", "score": 47, "replies": [{"body": "Lol too real", "score": 26, "replies": []}, {"body": "Creative space for making NFTs", "score": 5, "replies": []}, {"body": "just bought a tesla and the customer service has been phenomenal. I wonder if this is still a stigma and if its still bad.", "score": 13, "replies": [{"body": "I have mobile service today for my display screen. I’ll try to update on the experience.", "score": 11, "replies": [{"body": "yea I have a service scheduled for moisture in taillight that I noticed during delivery. The cool part is they come to me at my place of work during the work day. I wonder if they'll be able to just find my car using the location services.", "score": 6, "replies": []}]}, {"body": "Just to be clear: the people working at Tesla are awesome, and they really do their best to help you. Mobile service is great.\nBut it's just so damn hard to get in touch with an actual person. I waited almost half a year to have my faulty Tesla Wall Connector replaced (turns out i don't even need it because the mobile adapter was sufficient but still...).\n\nI love the company and the mission (and the stock) but i want to be able to speak to a god damned person IRL, lol.", "score": 9, "replies": [{"body": "weird whenever I called I got in touch with a person maybe thats because it was pre delivery and they wanted to close the sale. Don't you have a local tesla service rep?", "score": 1, "replies": [{"body": "It was 2 years ago now, in Western Europe, so hopefully they fixed that by now :)\n\nCouldn't be happier with the car, even after 3 years!", "score": 1, "replies": []}]}]}, {"body": "Same. Took a few tries to get my issue fixed, by the people were amazing", "score": 1, "replies": []}]}, {"body": "Only if you mean datacenters to train the AI that responds to in-app messages, or retraining of existing customer service phone bank workers into new, more productive roles 0\\_o", "score": 1, "replies": []}]}, {"body": "Who knows.\n\nWas thinking battery production, but didn’t realize how far that is from Fremont.", "score": 5, "replies": [{"body": "It makes no sense for them to lease a new warehouse and then transform it to a battery factory, or any factory.  Tesla is quite good at building their factories from scratch.  This will almost certainly be for parts / supplies / logistics / offices and other less technical operations.", "score": 5, "replies": [{"body": "I’d agree, but how far it is from Fremont and how close it is to the San Bernardino Airport (Boring Company Project) makes me think it’s assembly plant for shuttles.", "score": 3, "replies": [{"body": "It’s actually fairly close to the Ontario airport and freeways for trucking parts.  UPS has a large hub there.", "score": 1, "replies": [{"body": "That’s interesting too, and probably a better reason to have a large facility.", "score": 1, "replies": []}]}]}]}]}, {"body": "Tesla solar and home energy services.", "score": 3, "replies": []}, {"body": "It’s between LA and Vegas so I’m gonna say it’s related to vehicles for the boring tunnels in LV", "score": 4, "replies": [{"body": "Interesting observation 🤔", "score": 1, "replies": []}]}, {"body": "Storage and training facility for solar panels & Solar Roof", "score": 2, "replies": []}, {"body": "Probably battery 😍 ?", "score": 4, "replies": [{"body": "Zero chance.  Would be easier to build a battery factory from scratch than retrofit a warehouse.", "score": 5, "replies": []}]}, {"body": "Bitcoin storage!", "score": 1, "replies": []}, {"body": "Meme factory", "score": 1, "replies": []}, {"body": "Storage for cash. and EV credits.", "score": 1, "replies": []}]}, {"body": "Is it to store all of Elon’s money in cash?", "score": 47, "replies": [{"body": "Bitcoin farm.", "score": 12, "replies": [{"body": "Seriously though, if I were Elon I'd secretly be mining Bitcoin with all their Tesla's at night, no one's the wiser and Tesla covers the cost of electricity by giving back free supercharging miles...ok so maybe do disclose it then and offer incentive.", "score": 1, "replies": []}]}, {"body": "Yes all the money from robotaxi. We need a big store", "score": 22, "replies": []}, {"body": "It’s for his Scrooge McDuck money pit.", "score": 11, "replies": []}, {"body": "Or is this where the robotaxis will charge and do vehicle to grid.....?  \n\n\nTrolling. Maybe", "score": 8, "replies": []}]}, {"body": "Primarily office space but the property has 52 access draw doors and dedicated trailer parking space....so it can easily be converted to something service or logistics related", "score": 10, "replies": []}, {"body": "Robotaxi logistics incoming.", "score": 6, "replies": []}, {"body": "This is probably storage for service centers.  People tend to underestimate the population of the area because its next to LA county.  But theres 4.5 million people in san bernardio and riverside counties.  If the area were a state it would rank 26th in population.", "score": 6, "replies": []}, {"body": "Warehouse secured!\n\nAt 320k sq ft it is too small for gigabatteries or gigacars since giga is a lot bigger.", "score": 5, "replies": []}, {"body": "Wasn't there a bid for a boring tunnel in that area? From the Ontario Airport to Rancho Cucamonga. 👀", "score": 3, "replies": []}, {"body": "Is that big? Gf1 big?", "score": 2, "replies": [{"body": "No. GF1 is 5 million square feet. This is a kiddie pool.", "score": 6, "replies": []}]}, {"body": "what I think of when I see that headline\n\n>If you give the command \"SECURE THE BUILDING\", here is what the different services would do:\n\n>The NAVY would turn out the lights and lock the doors.\n\n>The ARMY would surround the building with defensive fortifications, tanks and concertina wire.\n\n>The MARINE CORPS would assault the building, using overlapping fields of fire from all appropriate points on the perimeter.\n\n>The AIR FORCE would take out a three-year lease with an option to buy the building.\n\nI guess Tesla took the Air Force option but with a much longer lease.", "score": 4, "replies": [{"body": "And San Bernardino is a shit hole.", "score": 1, "replies": []}]}, {"body": "Tesla needs to store all those cars that they are not selling, demand problem. /S", "score": 1, "replies": []}, {"body": "Reminds me of Kato road", "score": 0, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Wasn’t it leaving for the HQ only ?", "score": 1, "replies": [{"body": "Yes sorry, you are right. You managed to reply before!", "score": 1, "replies": []}]}]}, {"body": "I thought Tesla is fleeing California?", "score": 1, "replies": [{"body": "Only the HQ", "score": 2, "replies": []}]}, {"body": "2 miles from where I live. Gonna have to check it out and see what it will be used for.", "score": 1, "replies": []}, {"body": "Go $TSLA, GO ‼️I need to get my red model 3 soon. 😜", "score": 1, "replies": []}, {"body": "Warehouse for more tequilas and shorts short .", "score": 1, "replies": []}, {"body": "Wow, this is practically in my backyard!", "score": 1, "replies": []}, {"body": "Dojo big?", "score": 1, "replies": []}]}
