{"title": "Hims & Hers DD - The future of pharmacies and doctor’s visits", "selftext": "[deleted]", "id": "m9clng", "created_utc": 1616263768.0, "score": 102, "upvote_ratio": 0.82, "num_comments": 69, "comments": [{"body": "You had me at “their Twitter account posts memes”", "score": 37, "replies": []}, {"body": "Bought 100 shares at $20. Holding till my penis gets hard again.", "score": 30, "replies": [{"body": "Apparently Ms Wood is \"in\", does that help?", "score": 4, "replies": [{"body": "Cathie sold off  all her hims shares a week after buying!", "score": 5, "replies": [{"body": "Cool, only hers are left then if my math is correct. That's some kinky Cathie.", "score": 10, "replies": []}]}]}, {"body": "How much do you think it's going to go up to?", "score": 1, "replies": [{"body": "[Analysts](https://money.cnn.com/quote/forecast/forecast.html?symb=OAC) have street high of $20 (38% upside). The CEO has a long term goal of 20bn market cap which is ~$125/share.\n\nimo though there’s execution risk, these guys have potential to surprise to upside by expanding across services. If growth goes to 50% (management originally guided 30%), we could see re-rating and $30-$40 price targets. Obviously, if they don’t deliver stock price plummets, but keep in mind it’s only a 3 year old company and management expects $200M in revenue this year.... that’s pretty impressive and earns some trust with me in their ability to execute\n\nI’m very curious to see how Q1-Q2 play out now that they’re a bit more well known having gone public\n\nI bought the warrants (HIMSW)", "score": 2, "replies": [{"body": "The warrants are HIMS+", "score": 2, "replies": []}]}, {"body": "realistically $200 EOY", "score": -1, "replies": []}, {"body": "I think long term it‘s a $50/share business.", "score": 1, "replies": []}]}]}, {"body": "There’s a lot of competition beyond TDOC. There’s Roman, Keeps, Heal, Zocdoc, Amwell, the dozens of companies advertising millennial-friendly branded pills during reality shows...  still, I agree with the overall thesis.", "score": 37, "replies": [{"body": "Are these facebook/instagram advertised telehealth services just aimed at people who are too embarrassed to tell a real doctor that their hair is falling out or their dick doesn't work so good?  Or just people without insurance?  You can literally just get a prescription from your doctor and buy the same pills for 20-30% of what these places charge.", "score": 12, "replies": [{"body": "I think it’s catering to people who are too lazy to deal with insurance and scripts. They don’t want to go to Walgreens because they’d have to wait 40 seconds to get their pills and they don’t even take that long to cum.\n\nPlus, the branding matches their “I care about design” identity and makes them think they are solving a different problem. It’s only a pill because “my dick doesn’t work” when it’s in a orange bottle.", "score": 15, "replies": [{"body": "It's not really laziness or embarrassment that is going to be the major driver for this shift in primary health care.  The entire healthcare model is very outdated.  Where we are now is where the music and movie industry was in the early 2000s, with services like Napster and Hulu fighting against RIAA and other industry behemoths that wanted to uphold their outdated model.  The people that are utilizing these new medical services are the early adopters, primary medicine will look a lot different in the future.\n\nSpecifically what's driving the changes:\n\n1. People have access to vast amount of information and are more educated regarding health than anytime in the past.  This allows drug and medical companies to market directly to consumers that understand what their products are for.  The old view of medicine is top down model, younger people are more desirous of a consultant model where the patient is the driver of the medical care, not the doctor.\n2. Diagnostic errors are common in primary care settings leading to delay in diagnosis and often resulting in the need for many followup appointments before correct treatment is initiated.  Many patients with unexplained issues eventually chose to bypass primary care (gatekeepers) due to frustration and seek specialist care in a self-directed manner.  For some issues even AI is more skilled at diagnosis than general physicians.\n3. Chronic disease management is generally performed by data collection and following guidelines and flowcharts.  The standardization of the management of these issues really paves the path for automation as data collection can be done many times at home or other convenient locations (like a 3rd party lab or imaging center).  There is less need for primary general physicians when processes are standardized for common chronic illnesses.  Preventative treatments and testing are also very standardized which could be automated without the need for the educational level of a physician.  We are already moving towards this by employing NP and physician assistants to manage primary care.\n4. Primary health care is unnecessarily expensive as compared to other professional services that people utilize and that have better systems for automating standardized tasks (for example, if I own a company, I can hire a payroll service that specializes only in that service at lower cost than a in house accountant performing the same function).\n5. Primary care is unnecessarily cumbersome as a process due to lack of automation.  Spending time scheduling appointments, going to appointments, having to wait sometimes weeks to even be able to get an appointment, figuring out post-service billing and insurance issues, having gatekeepers block access to services that the patient desires, etc. are all time consuming and could be fixed with different models.\n6. Outcomes are better without physicians for primary care.  \\*\\*\\*This is really the kicker.  In a lot of studies of  the NP model of primary care (with standardization and provider as consultant) shows that outcomes for patients are better for patients who's primary providers are NPs rather than a physicians.\n\nThe AMA has been fighting hard against the changes (ie restricting telemedicine, restricting automation, restricting what other types of providers can do under their licenses, etc).  The future might not look exactly like Hims&Hers, but the fact is there that the top-down physician-as-authority model of primary medicine is not going to be the future either.", "score": 6, "replies": [{"body": "This is untrue.  Mid levels do not provide better care, and they utilize more resources and consult more, unnecessarily. \n\nYou can not put chronic care on a flow chart.  There are so many people that try algorithms and kill certain organs or don’t understand the pathophysiology of diseases and the pharmacology of medications and throw shit stupidly and harm their patients.  \n\nPlease don’t pretend like these are facts when they are absolutely falsehoods pushed by midlevel organizations and lay business folk who try to push these models.  Mid levels try to push their studies, but all their studies are mid levels that are supervised.   Not only that but mid levels have their mistakes caught by their supervised attendings, thus don’t count as a mistake.\n\nThat’s just dumb to think a nurse practitioner (many online programs don’t even require any nursing experience and require 500 hours of shadowing before they can practice, along with 4-5 science courses in 2 years).  I spent an extra 4 years in Med school after my bachelors/masters, and I had over 10000 hours of practice in residency along with 5000 hours of clinical practice in Med school.  I take care of the most complex cases in the hospital before I can practice independently.   \n\nYou are trying to compare that to mid levels who some barely do any procedures in their 2 extra years of “classes” and 500 hours of clinical (some of them have to find their own sites, and some just shadow and do clerical work at these sites) after their bachelors before they practice.\n\nHere are just some examples of studies:\n\nResident teams are economically more efficient than MLP teams and have higher patient satisfaction. [https://www.ncbi.nlm.nih.gov/m/pubmed/26217425/](https://www.ncbi.nlm.nih.gov/m/pubmed/26217425/)\n\nCompared with dermatologists, PAs performed more skin biopsies per case of skin cancer diagnosed and diagnosed fewer melanomas in situ, suggesting that the diagnostic accuracy of PAs may be lower than that of dermatologists. [https://www.ncbi.nlm.nih.gov/pubmed/29710082￼](https://www.ncbi.nlm.nih.gov/pubmed/29710082%EF%BF%BC)\n\nAdvanced practice clinicians are associated with more imaging services than PCPs for similar patients during E&M office visits. [https://jamanetwork.com/journals/jamainternalmedicine/fullarticle/1939374](https://jamanetwork.com/journals/jamainternalmedicine/fullarticle/1939374)\n\nNonphysician clinicians were more likely to prescribe antibiotics than practicing physicians in outpatient settings, and resident physicians were less likely to prescribe antibiotics. [https://www.ncbi.nlm.nih.gov/pubmed/15922696](https://www.ncbi.nlm.nih.gov/pubmed/15922696)\n\nThe quality of referrals to an academic medical center was higher for physicians than for NPs and PAs regarding the clarity of the referral question, understanding of pathophysiology, and adequate prereferral evaluation and documentation. [https://www.mayoclinicproceedings.org/article/S0025-6196(13)00732-5/abstract](https://www.mayoclinicproceedings.org/article/S0025-6196(13)00732-5/abstract)\n\nAntibiotics were more frequently prescribed during visits involving NP/PA visits compared with physician-only visits, including overall visits (17% vs 12%, P < .0001) and acute respiratory infection visits (61% vs 54%, P < .001). [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5047413/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5047413/)\n\nNPs, relative to physicians, have taken an increasing role in prescribing psychotropic medications for Medicaid-insured youths. The quality of NP prescribing practices deserves further attention. [https://www.ncbi.nlm.nih.gov/m/pubmed/29641238/](https://www.ncbi.nlm.nih.gov/m/pubmed/29641238/)\n\nNPs/PAs practicing in states with independent prescription authority were > 20 times more likely to overprescribe opioids than NPs/PAs in prescription-restricted states. [https://pubmed.ncbi.nlm.nih.gov/32333312/](https://pubmed.ncbi.nlm.nih.gov/32333312/)\n\nBoth 30-day mortality rate and mortality rate after complications (failure-to-rescue) were lower when anesthesiologists directed anesthesia care. [https://pubmed.ncbi.nlm.nih.gov/10861159/](https://pubmed.ncbi.nlm.nih.gov/10861159/)\n\nAdvanced practice clinicians and PCPs ordered imaging in 2.8% and 1.9% episodes of care, respectively. Advanced practice clinicians are associated with more imaging services than PCPs for similar patients during E&M office visits .While increased use of imaging appears modest for individual patients, this increase may have ramifications on care and overall costs at the population level. [https://jamanetwork.com/journals/jamainternalmedicine/fullarticle/1939374](https://jamanetwork.com/journals/jamainternalmedicine/fullarticle/1939374)\n\nAPP visits had lower RVUs/visit (2.8 vs. 3.7) and lower patients/hour (1.1 vs. 2.2) compared to physician visits. Higher APP coverage (by 10%) at the ED‐day level was associated with lower patients/clinician hour by 0.12 (95% confidence interval \\[CI\\] = −0.15 to −0.10) and lower RVUs/clinician hour by 0.4 (95% CI = −0.5 to −0.3). Increasing APP staffing may not lower staffing costs. [https://onlinelibrary.wiley.com/doi/full/10.1111/acem.14077](https://onlinelibrary.wiley.com/doi/full/10.1111/acem.14077)\n\nWhen caring for patients with DM, NPs were more likely to have consulted cardiologists (OR = 1.29, 95% CI = 1.21–1.37), endocrinologists (OR = 1.64, 95% CI = 1.48–1.82), and nephrologists (OR = 1.90, 95% CI = 1.67–2.17) and more likely to have prescribed PIMs (OR = 1.07, 95% CI = 1.01–1.12) [https://onlinelibrary.wiley.com/doi/10.1111/jgs.13662](https://onlinelibrary.wiley.com/doi/10.1111/jgs.13662)\n\nAmbulatory visits between 2006 and 2011 involving NPs and PAs more frequently resulted in an antibiotic prescription compared with physician-only visits (17% for visits involving NPs and PAs vs 12% for physician-only visits; *P* < .0001) [https://academic.oup.com/ofid/article/3/3/ofw168/2593319](https://academic.oup.com/ofid/article/3/3/ofw168/2593319)\n\nThere was a 50.9% increase in the proportion of psychotropic medications prescribed by psychiatric NPs (from 5.9% to 8.8%) and a 28.6% proportional increase by non-psychiatric NPs (from 4.9% to 6.3%). By contrast, the proportion of psychotropic medications prescribed by psychiatrists and by non-psychiatric physicians declined (56.9%-53.0% and 32.3%-31.8%, respectively) [https://pubmed.ncbi.nlm.nih.gov/29641238/](https://pubmed.ncbi.nlm.nih.gov/29641238/)", "score": 17, "replies": [{"body": "There are plenty of studies that indicate that NP and PA provide the same level of care with primary care and have comparable if not better outcomes.  I could provide a list as well, but it's not worth my time/no one will read anyhow - I'm sure if you are practicing, you are aware of them.  If the quality of care was extremely different, you would not see states (and medicare) pushing to increase access to these providers.  There is resistance from AMA and physicians as this encroaches into their turf and further decreases the need and pay for general practice.  **NP and PA cost half as much or less than a physician and provide a comparable level of primary care**.  Sorry if it hurts, but even if you don't believe this is true, this is the direction that healthcare is going, like it or not.  It's already started.", "score": 2, "replies": [{"body": "I don’t think you read my comment - those studies are flawed because of how they gathered data - these are NP’s and PA’s that are supervised and if they make mistakes, the primary will change and modify and these mistakes are not counted in any data set.  Please read the data carefully.  Many mid levels throw these poor low quality studies in journals with low impact factors.  Some journals will publish anything as long as their authors PAY them.  Just like you are seeing in main stream media, the quality of evidence is poor as long as you pay.  The AANP spends a lot of money pushing propaganda and not actual health care.  \n\nWhy do you think nurse practitioners spend over 1/3 of their education on public policy and not actual medicine?  Why do you think many of them can’t find jobs after they graduate?  They have poor educations and this push is because the schools want more money and they accept anyone with a pulse.  They don’t give a crap about providing quality care to patients.\n\nI’m practicing right now and I can easily tell the poor care.  If you are in the emergency room or taking care of a patient in the hospital, you see the poor care that many of these mid levels give and the ridiculous mediations they put their patients on.\n\nThe reason that CVS and Walgreens push mid level care is because they are cheap, not better.  They order a battery of tests and imaging which cost more for the patient and give unnecessary medications which cause more harm and side effects and refer patients unnecessarily to specialists.  The hidden cost for mid levels is more for the healthcare system than a physician, but for the company themselves, they incur less costs.\n\nAsk regular nurses who work regularly with mid levels or ask actual good doctors.  The problem with mid levels is due to boomer ass doctors who let it get this way because they don’t care about their patients and want more money because of greed and they want to retire with more yachts.", "score": 4, "replies": [{"body": "I did read your comment, and I disagree with you.  As much as the AANP is pushing for NP roles to be expanded, the AMA is pushing it's agenda as well because it hurts them in the pocket book.  The reality of it is that, as much as physicians and AMA don't like the shift, it's happening and it's about time.  The AMA has long been the gatekeepers of medical care and the cost associated with this harms patients.  It's simply not true that NP and PAs who provide primary care are more expensive (https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4946030/)  Medicare and other insurance companies employ huge actuarial teams and would not be promoting these providers if they did not provide economical care.  Fact of the matter is, even with insurance in the united states, even simple medical care is out of reach of many individuals. \n\nSorry if you think that NP education is unsatisfactory, but it's not.  For primary care, most of what is encountered is routine and governed by either system wide policies, professional recommendations, best practices guidelines, medicare guidelines, etc.  Physicians practice within this framework as well.  I'm not trying to discount the education and skill of physicians, but unfortunately, for routine care and preventative care, that level is unnecessary.  Our current medical model blocks a lot of people from receiving the care they need, and like it or not, agree with it or not, it's changing because customers want to see it change.   \n\nThe current trends in primary care utilization also don't bode well for the current model.  Younger people increasingly don't have any relationship with a primary care provider, less than past generations when they were at the same ages.  We have a whole generation that is not receiving preventative services and does not have a medical history on file.  In addition, overall utilization is decreasing while expenses increasing for all groups.  This is unsustainable as an industry.", "score": 1, "replies": [{"body": "Did you just read a single line in the abstract and post it?\n\n1) The study is limited by the fact that some NPs bill Medicare for their services “incident to” a physician. Under incident to billing the care provided by an NP is billed under a physician's NPI when certain conditions are met, including an initial encounter between the physician and patient and the presence of a physician in the office when the service is performed\n\n2) In addition to incident to billing, there are other reasons why services provided to beneficiaries by NPs may not be visible in Medicare administrative data. For example, NPs may not bill all or some of the services they provide under their own NPI number either due to supervision requirements within their organizations, employment arrangements, or state scope of practice requirements for diagnosing and prescribing.\n\n-NP's are not billing for certain procedures or examinations because it is beyond their scope.  They bill these under their supervising physician which cause the weighted average cost to be higher.  Also more complicated and sicker patients that are more complicated are being by their supervising physician instead of NP's.\n\nThe higher bills are happening because NP's are not equipped to handle more difficult cases so all the more expensive bills are billed under physicians which push the weighted average up.\n\nAnd again, many of these data points are nurse practioners that are being supervised, so the cost of these Nurse practioners includes the supervision of Physicians which is unlisted and they are not having independent practice in this study.  It does not tell you the performance, consult costs, medication and long term effects of management.\n\nWhile I don't agree with the quality of healthcare and these policies, I agree that many of these companies are pushing towards more mid-level care because it is cheaper for their bottom line.  They don't care about the increased imaging, tests or medications ordered  (which I cited) because they make more money when they are ordered.\n\nThere are various hospitals and healthcare systems that minimize the use of mid levels because it hurts their overall bottom line because they collect the insurance and patients who have worse chronic management become more costly in the future to their healthcare system (Kaiser Permanente).  \n\nCVS, Walgreens, etc. do not - they bill services to insurances and it benefits them to hire the cheapest labor they can and they push the cost to insurance and they don't care about long term cost.", "score": 5, "replies": []}]}]}]}]}, {"body": "[removed]", "score": 5, "replies": [{"body": "I work in healthcare, pretty familiar.  And there's plenty of studies that support what I said regarding lower level providers and quality of care.  Also, in most states, NPs don't have \"supervision\", they are licensed to practice independently with a consulting relationship with a physician if escalation of an issue is required.", "score": -2, "replies": []}]}]}]}, {"body": "Pm", "score": 4, "replies": []}, {"body": "There are a ton of uninsured people who can't afford to go to a doctor or don't have a pcp at all. It'll cost them at least $125 for an appointment plus the prescription if they don't qualify for low income pricing. Plus someone else mentioned they may be embarrassed, live in a rural area or be some teen that needs birth control.", "score": 2, "replies": []}]}, {"body": "If you look at its Instagram pages, HIMS has a larger following than than all of those names combined. It may not mean much but hey, online presence is important for an online focused business.\n\nTDOC isn't even on IG lol. But I don't see TDOC as a competition to HIMS just yet because of how niche the latter's business model is. And HIMS is way more consumer focused than TDOC.\n\nSince this is a consumer-focused, D2C, digitally native telehealth platform, you can tell how a brand is doing based on the number of followers on popular social media websites. Not the best yardstick but not the worst.\n\nLet's be real, brand power is going to be an important moat for a company that has no real one like HIMS. So it's good to know that HIMS is relatively popular at least.", "score": 3, "replies": []}, {"body": "Roman only focuses on men, and Keeps only focuses on hair loss for men. I agree definitely strong competition but they don’t have the wide range of services Hims and Hers has so I like the potential", "score": 1, "replies": []}]}, {"body": "Personally, I am not a fan of pure telemedicine and the decline of quality healthcare.  Especially for older patients and patients who have serious problems.  I’ve seen some of the terrible healthcare that mid levels have give and I feel that telemedicine may attempt to push that way to cut costs.  Ridiculously over ordering labs and imaging without taking a good history.  Sure these things will allow insurances to bill more at the cost to patients.\n\nTelemedicine can contribute to the health of a patient if they see someone and establish care with them first (I do a lot of telemedicine with my patients after I’ve seen them in person - I’m capitated so they don’t pay me extra).  But there are some issues that need to be dealt with in person.  But I’m mostly talking about this from the angle of better healthcare and not the business side of it.  It could expand, I haven’t looked into these companies in terms of the business side much.\n\nI don’t have any positions in any of these telemedicine companies.  I have to turn away new patients because I have so many, unfortunately I can’t take a lot of patients and people might have a hard time finding good providers and have to go on these platforms.\n\nNot investment advice, just personal anecdotal stories.", "score": 14, "replies": [{"body": "It doesn't have to be a zero-sum game between traditional healthcare and telemedicine/telehealth. There's a time and place for the both of them and in the end, accessibility to decent healthcare has to be improved and telemedicine can help with that to an extent. I'm bullish about telehealth but never once did I ever think that it will replace direct consultations. It just won't work especially when we're dealing with mental health. No way that can be done remotely all the time, if not most of the time. \n\nBut I think what telehealth offers is options. Options for people who are not getting the care they need due to the broken healthcare system. Options for better accessibility and cost savings. \n\nAnd for HIMS in particular, they're not really targeting customers with super complex issues with high age risk profiles (except maybe mental health). They're going for millennials with stigmatised issues like acne, ED, birth control, and hair loss. These issues aren't life threatening for the most part. And I say that because most of their customers (about 80%) are seeking treatment for their conditions for the first time using the platform. Which means that most of the time, they just never seek treatment for it. They dragged their feet around it when they should be getting the care they need due to various factors due to cost, accessibility and stigmatisation. So telehealth is offering them such options which is not a bad thing. \n\nWhatever that can be done online, can be done online. Not all health issues require direct consultations all the time. Like you said, you had to turn down quite a number of patients. Do you ever wonder what happens to them when they can't seek the treatment they need due to the inherent limitations of the current healthcare system? Don't you wish they have options at least? Can telehealth help with that in some way?", "score": 4, "replies": []}, {"body": "Dude nurse practitioners lmao", "score": 1, "replies": []}]}, {"body": "Hims has been been the biggest loss ive ever taken in my portfolio - bought at 22.75 and have been absolutely bleeding and it just wont stop", "score": 10, "replies": [{"body": "Welcome to the stock market.", "score": 1, "replies": [{"body": "Aint my first rodeo, just first time ive dropped \\~40% in 2 months on 0 news", "score": 1, "replies": []}]}, {"body": "I’ve been selling covered calls on my shares, but yeah still in the red over here as well.", "score": 1, "replies": []}]}, {"body": "I lierally didnt read this post at all, but im pretty sure hims is boner pills. Literally cant go tits up.", "score": 8, "replies": [{"body": "priced in", "score": 3, "replies": []}]}, {"body": "I love this stock", "score": 3, "replies": []}, {"body": "I have some shares and calls but GUUUHHHH what a piece of shit this stock has been.", "score": 3, "replies": []}, {"body": "Does it have a lockup period?", "score": 2, "replies": [{"body": "Lockup should end at least in mid July", "score": 2, "replies": []}]}, {"body": "Let’s not forget Cathie Wood is in. If she’s in, I’m in.", "score": 2, "replies": [{"body": "Unless I missed it and she hopped back in within the last week or so, she sold just just about her whole position a while back. Personally think she just saw some other favorites like TSLA and TDOC at lower prices and moved the money there and it’s still a good company.", "score": 2, "replies": [{"body": "Damn, I checked the emails sent out back to 2/26 and didn’t see any buys so maybe I’m retarded, sorry. They did sell a few shares, but it was like 110 and 4 so it’s negligible I think.", "score": 1, "replies": []}]}, {"body": "I follow her to tendie town", "score": 1, "replies": []}]}, {"body": "Hims and Hers will be catering to the hipster yuppie market .. not the 90 percent of regular folks", "score": 2, "replies": [{"body": "The branding is is more similar to companies like Macy's and A&F tbh, those companies have widespread appeal", "score": 1, "replies": []}]}, {"body": "Ark has invested a lot in this but they are down 50% from their all time highs. Might be a good price to get in.", "score": 2, "replies": [{"body": "You sure? I don’t see it in any of there holdings. I’m probably blind tho.", "score": 1, "replies": [{"body": "Did they sell their investment? I’m 110% sure they invested in this. That’s why I even came to know about this company.", "score": 2, "replies": [{"body": "She sold it about 2-3 weeks after buying.  Then continued to sell over the last month.", "score": 1, "replies": []}]}]}]}, {"body": "Interesting idea of online healthcare. My small town once had 2 pharmacy's, but now has 0. I can see this being helpful for people who live in rural areas or who are shopping around for deals on prescription medicines.", "score": 2, "replies": []}, {"body": "I'm not sure what to think. Covid is declining but I'm also thinking long term here. As my generation grows older(millennial), perhaps more people will use this in the future considering we're kind of the first gen of growing up into internet. Who knows, shit might come out like a BP monitor you plug into usb and stuff like that. We've already stopped a pretty big amount of in person shopping, even precovid. I could see telemedicine being a part of the future.", "score": 2, "replies": []}, {"body": "So one of 7 or 8 telehealth plays when almost every primary care physician and mid-level was forced to figure out how to do telehealth themselves within the last year \n\nThanks but no thanks", "score": 2, "replies": [{"body": "It's just a necessary evolution in the delivery of healthcare. Imagine if another pandemic hits and the lockdown prolongs. How long do you think they can stay away from telehealth? And with a new generation that grew up with an iPhone rather a teddy bear, demand for telehealth will only grow. \n\nAnd you're talking about 7 to 8 players that's trying to disrupt a multi trillion industry that's been outdated and inefficient in every way for so long. There's enough room for all the players to enjoy. There's no need for one particular player to dominate the whole thing to achieve multibagger returns.\n\nThink bigger.", "score": 3, "replies": []}]}, {"body": "While I appreciate DD that is well presented such as this one, there were absolutely no rocket emojis... \n\n*... and for this reason, I’m out.*", "score": 6, "replies": []}, {"body": "“Growth.” I see what you did there.", "score": 1, "replies": []}, {"body": "I also like the future potential of HIMS.  Revenue is rocketing up.  Looks great with cash on hand with no debt.  Forward looking statement isn’t cash positive yet next year, but getting closer to positive.  I have about 50 shares around $14.xx.  Will probably pick up more and hold long term.", "score": 1, "replies": []}, {"body": "Saturated market. Covid is about over too. People want to their their own physician.", "score": 1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "It's on the horizon.  The current healthcare model is going to die with the boomers.", "score": 1, "replies": []}]}, {"body": "Which market are you talking about? Hair loss? ED? Primary care? \n\nYou're talking about a company with a market cap of 2.74B and revenue of 148.8M as at FY2020, trying to disrupt a multi billion market that could go up to a trillion dollars worth of healthcare spending in the US alone. In its current business lines like hair loss and ED, yes the market is saturating but what about their recently launched business lines like anxiety, dermatology and primary care?\n\nAnxiety - 14B\nDermatology - 44B\nPrimary care - 280B\n\n\nCan you see where I'm going with this? The best part is that HIMS doesn't even need to dominate all those markets to be a 5x or 10x stock.\n\nAltogether, it would be a 345B opportunity and HIMS only achieved 148.8M in sales. Just achieving 1% of that market opportunity is already 27x its existing revenue. \n\nAnd I'm not saying that every consultation will be done online in the future but that's the beautiful thing about the opportunity at hand, it doesn't need to.", "score": 1, "replies": []}]}, {"body": "The recent price drop under $13 is a good entry point for this stock. \n\nlonger term people will pay extra to save time. Why travel to your doctor when you can catch up over zoom. They can prescribe medicine you are not comfortable talking about.\n\nIm also long Teledoc for a few years now. \n\nI think it’s a long long term play so stocks and warrants. I wouldn’t buy any calls in the next few months.", "score": 1, "replies": []}]}
