{"title": "✅ Daily Chat Thread and Discussion ✅", "selftext": "Please use this thread to discuss what's on your mind, news/rumors on NVIDIA, related industries (but  not limited to) semiconductor, gaming, etc if it's relevant to NVIDIA!", "id": "1cmvged", "created_utc": 1715140834.0, "score": 6, "upvote_ratio": 1.0, "num_comments": 23, "comments": [{"body": "think nvda will become number one stock making it 1250 in price", "score": 6, "replies": [{"body": "AVGO", "score": 1, "replies": [{"body": "You can't simply post a stock symbol and leave! \\~8D  Tell us why they are a contender.\n\nMy $0.02 is that AVGO is strong because they support RoCE in their high performance Ethernet segment.  Anyone doing high-performance AI needs fast interconnects like this. I believe META is using AVGO's solution in their clusters.\n\nNVDA solved this issue by developing their own switch. That was a heavy lift, but the solution kicks butt!", "score": 3, "replies": [{"body": "Not sure why AVGO is the reply to the number one stock comment, it's definitely not a bad pick though I don't know if it's the best as it's not an AI pureplay.", "score": 1, "replies": []}]}]}, {"body": "I don’t think it will hit 1250 as they should announce a 4:1 stock split when it hits 1k", "score": 1, "replies": []}]}, {"body": "TSLA developed its own chip for FSD in 2019, but continues to purchase more NVDA GPUs every year.", "score": 3, "replies": [{"body": "Training and Inference have distinct power & performance needs.", "score": 1, "replies": []}]}, {"body": "Two potential catalysts today: \n\n\n1. Jensen's keynote at the Servicenow event 9am PDT \n\n\n2. ARM earnings AH. \n\n\nHoping for a super green day! ", "score": 3, "replies": [{"body": "Arm gonna beat?", "score": 1, "replies": [{"body": "Double beat, but market didn't like guidance. Huge sell-off so far.", "score": 1, "replies": [{"body": "Trying to decide on an entry point for arm, or not. I think a big dip is coming. Maybe Nvidia down to $850 or less before earnings. You know because I’m psychic 😂", "score": 1, "replies": []}]}]}]}, {"body": "Looks weaker today. Back to 800s?", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It was there briefly.", "score": 2, "replies": []}]}]}, {"body": "Chances of green day?", "score": 1, "replies": []}, {"body": "Feels like another whale profit taking.", "score": 1, "replies": []}, {"body": "In addition to the cyclic need of refreshing the existing deployments, most companies also have organic increase in demands of their end products which in turn means an increase in their AI servers. This is basically what the AI boom is.", "score": 1, "replies": []}, {"body": "Im a noob. Why would big tech keep buying nvda gpu's after the first time?", "score": 0, "replies": [{"body": "I'm a Soft Eng.\n\nprice per performance gets cheaper.\n\nThe more GPU chips you add to a cluster, the better performance is. However, there's diminishing return when you add more GPU chips. So, if you want to build the best data center. It needs to have the best chips.\n\nlet's say 10 older GPU has same performance as 1 New GPU, but 10 New GPU can perform much better than 100 older GPU.\n\nBig tech doesn't have a choice but to buy NVIDIA to not be outcompeted by others", "score": 8, "replies": []}, {"body": "It's (should be) cheaper to buy more performabt gpus that need less watts per performance than to keep the old ones.", "score": 5, "replies": [{"body": "Makes sense, thanks", "score": 1, "replies": []}]}, {"body": "They are hard to make and what is the market efficiency of everyone investing in R&D to make the same kind of chip and only use them for themselves. It costs them millions if not hundreds of million just to design and actually produce the chips. For most of these companies chip design is not their core business, they would need to make chips that exceed the performance and power efficiency of Nvidia or AMD. AMD is having trouble just producing these chips at scale, do these big tech companies want to take on this risk?\n\nAlso these chips, they have value after their purchased. Lambda secured a 500 million loan with these chips as collateral. And then these companies can depreciate the cost of the chips as well.", "score": 3, "replies": []}, {"body": "That's a valid point, and it really aligns with how consumer behavior often mirrors corporate decisions in technology adoption. Let’s consider why we buy new smartphones—it’s typically because new technology has made previous models less efficient or desirable. This scenario is quite similar in the business context.\n\nFor companies, especially in sectors that are technology-dependent, staying updated is less about choice and more about necessity. Nvidia's continuous innovations in the semiconductor industry illustrate this well. As they push the boundaries of what their technology can achieve, businesses are compelled to upgrade their systems not just to compete but to simply keep up. \n\nDuring this AI surge, the need for more robust tech infrastructure is more pronounced than ever. Companies are not only replacing older equipment but are also scaling up significantly. Nvidia’s strategy of rolling out increasingly advanced and efficient chips ensures that they remain the go-to supplier in this escalating demand cycle.\n\nIn essence, as long as tech leaders like Nvidia keep advancing, other businesses have little choice but to invest in the latest technologies to maintain their competitive edge and operational efficiency.", "score": 2, "replies": []}, {"body": "Same reason people replace video cards in their computers.  Over time, even the best can't keep up with new software demands.", "score": 1, "replies": []}]}]}
{"title": "Self Driving News", "selftext": "Mobileye CTO claims cameras will not be sufficient for Level3  [https://twitter.com/shai\\_s\\_shwartz/status/1787881747184488768](https://twitter.com/shai_s_shwartz/status/1787881747184488768)\n\nAnd Tesla is being investigated by DOJ for fraud over self driving claims. [https://www.theverge.com/2024/5/8/24151881/tesla-justice-investigation-securities-wire-fraud-self-driving](https://www.theverge.com/2024/5/8/24151881/tesla-justice-investigation-securities-wire-fraud-self-driving) \n\nBad day for Elon ", "id": "1cnh4ex", "created_utc": 1715206609.0, "score": 14, "upvote_ratio": 0.79, "num_comments": 31, "comments": [{"body": "I still don't know why Elon is not in jail to be honest. He is always lying.", "score": 8, "replies": []}, {"body": "Tsla is in a world of pain this year.", "score": 3, "replies": [{"body": "Elons house of cars crashing down ", "score": 1, "replies": []}]}, {"body": "honestly, I’m certain that cars will share info between each other and external sensors in the future.  i’m having a hard time seeing independent self driving cars.", "score": 4, "replies": [{"body": "Car Trains in highway situations are inevitable. But they still have to be able to operate independently.", "score": 2, "replies": []}, {"body": "It's all political also if people need self driving car they shouldn't be behind the wheel period", "score": 2, "replies": []}]}, {"body": "If I didn't wanna drive I take the bus not alone pay for a car monthly that cost pretty much the same as a middle class family s mortgage rate .to top it off I would lose a large amount of value as soon as I drive out the dealership parking lot not only that if I'm the one that's gonna take the loss I would be the 1 driving not the car driving me", "score": 1, "replies": []}, {"body": "Another thing the doj needs to  learn  the definition of justice because all there doing is taking our justice and American ways from us and there doing there best to take down the powerful people that stands up to them first and the people who aren't so powerful that stand up to them are really fucked .all about power and control .where I live... my city  Chicago all over Chicago d.o.j. should come here and investigate real crime that really matters instead of wasting our tax dollars looking and trying there best to put people to jail out of spite all over this country there is plenty of real crime from real dangerous people to keep them busy wheres the justice for the people that are paying mortgage for squatter s to sleep in a bed that's not there's to top it off the home owner has an additional monthly bill going to a hotel ...where's the justice I'm not seeing it from doj ...fuck wouldn't surprise me if they be at the door at my house tomorrow get locked up and possibly come home to strangers eating my food watching baseball on my TV on my couch with my bathrobe and slippers on ....long story short doj is nonsense 3 letters that hides 3 words to hide what they are B.S...... Bullshit that's what they are it's true in my eyes that's all I see people starting to smell it lol", "score": 1, "replies": []}, {"body": "Yes current self driving \"AI\" is too stupid to actually drive, so more data to patch the holes the better I guess. But when it can actually drive based on actual understanding of its environment not just pattern matching then it won't need this much data.", "score": 1, "replies": [{"body": ">current self driving \"AI\" is too stupid to actually drive\n\nWaymo might have a bone to pick:\n\n  \n\"Waymo’s data was derived from crashes reported under NHTSA’s Standing General Order (SGO), over **7.14 million fully autonomous miles driven 24/7 through the end of October 2023 across Phoenix, San Francisco, and Los Angeles.** That data was then compared to relevant human crash rates resulting in police reports, injuries, and/or property damage.  \n  \nWhen considering all locations together, compared to the human benchmarks, the Waymo Driver demonstrated:  \n\n\n* An **85% reduction or 6.8 times lower** crash rate involving any injury, from minor to severe and fatal cases (0.41 incidence per million miles for the Waymo Driver vs 2.78 for the human benchmark)\n* A **57% reduction or 2.3 times lower** police-reported crash rate (2.1 incidence per million miles for the Waymo Driver vs. 4.85 for the human benchmark)\n\nThis means that over the 7.1 million miles Waymo drove, there were an estimated 17 fewer injuries and 20 fewer police-reported crashes compared to if human drivers with the benchmark crash rate would have driven the same distance in the areas we operate.\"  [https://waymo.com/blog/2023/12/waymo-significantly-outperforms-comparable-human-benchmarks-over-7-million/](https://waymo.com/blog/2023/12/waymo-significantly-outperforms-comparable-human-benchmarks-over-7-million/)\n\n  \nMy point was tesla is too hobbled to self drive today with crappy hardware and rushed out promises.", "score": 2, "replies": [{"body": "Absolutely, waymo has made huge strides and Tesla is crappy.\n\nBut this article here shows what they're doing. https://waymo.com/blog/2019/02/an-update-on-waymo-disengagements-in/\n\n> We believe the key to self-driving technology safely improving and scaling is through a robust breadth of experience and scenario testing\n\nUnfortunately, this is the exact wrong strategy which leaves them open to being leapfrogged by a competitor who's doing it the right way.", "score": 1, "replies": [{"body": "5 years is a long time for strategies to evolve.", "score": 1, "replies": []}]}]}]}, {"body": "12.3.x has proven him wrong.", "score": 1, "replies": []}, {"body": "I was working towards smart city concept for autonomous cars and using just the vision system is not sufficient. One of the core concept was to use game theory and on board machine learning solution with pub sub methods to tackle the challenge. You need to have a model to communicate with various bots to take into accounts the failure due to environment. The major challenge was to calculate all the result work with cloud and get everything working together. It's not yet complete and should take me 4 more years to resolve maybe 2-3 different problem in the same area. Don't know how Tesla fares with all these challenges.( Doubt how it handles everything) If the Algo comes out it would be great for learning and drawing inference from the same. If it was straight ahead lying then someone would be in big trouble.", "score": 1, "replies": []}, {"body": "Being investigated is just a political stunt.", "score": 1, "replies": []}, {"body": "You conveniently left out the fact that the CTO said, in the same post, that cameras and radar WILL be enough sometime in the future.", "score": 1, "replies": [{"body": "Elon killed radar too. \n\n\"Vision became so good that radar actually reduced SNR \\[signal to noise ratio\\], so radar was turned off,” said Musk in a tweet in October of 2021. “Humans drive with eyes & biological neural nets, so makes sense that cameras & silicon neural nets are only way to achieve generalized solution to self-driving.” [https://www.engineering.com/story/now-revealed-why-teslas-have-only-camera-based-vision](https://www.engineering.com/story/now-revealed-why-teslas-have-only-camera-based-vision)", "score": 2, "replies": [{"body": "radar was alledgedly un-killed a year or two ago\n\n/r/technology/comments/zvdygp/tesla_appears_to_be_turning_back_to_radar_for_its/", "score": 2, "replies": [{"body": "Ok, thanks, that slid under the radar.", "score": 3, "replies": []}]}]}, {"body": "Nothing about that is convenient. He’s referring to Elon saying cameras only is the way.", "score": 1, "replies": []}]}, {"body": "I believe Elon is correct that a vision-only approach is enough for autonomous driving.  It’s been shown in the latest versions of FSD in YouTube videos and customers who have tried it in their 1-month free trial.  However, as impressive as it is, it still makes mistakes, but not as bad as the earlier versions.\n\nAs for the self-driving claims, Elon doesn’t know when to shut-up.  If you’re going to make a public announcement whether it’s on stage or in a tweet, you better be able to back that up within a year.  He once said Tesla will eventually take you autonomously from LA to NY almost a decade ago with the MobilEye EyE3 infrastructure they were using at the time.  MobilEye wasn’t willing to support Tesla with their grandiose autonomous vision especially when their EyE3 solution was never designed to support it.", "score": 1, "replies": [{"body": "Fog or bad weather can defeat vision only solutions.   Sure if you never run in fog, you don't need to worry about it.", "score": 2, "replies": [{"body": "When there is heavy fog, most drivers would be smart enough to slow down or avoid traffic due to poor visibility.  Although, that's not always the case as we occasionally hear about poor human decisions causing pile-ups in heavy fog.  On the other hand, people can drive in rain, but rain and hail creates echo noise in lidar and lidar is inferior in that it can't see lane lines, traffic signals, read road signs/speed limits, certain road conditions, etc on roadways.  However, cameras can.  That's why I believe the vision-only approach is more than enough especially when other human drivers use only their eyes to make decisions on what to do on the road.  And we're already seeing that happen as you hear and watch videos of Tesla's avoiding accidents before the human driver can notice there was a problem.  \n\nVision is necessary but lidar is an unnecessary add-on that provides an extra level of precision.", "score": 0, "replies": [{"body": "We disagree.   Vision only has limitations beyond fog including heavy rain, snow and dust storms.   Ever pass a truck throwing water so fast your windshield wipers can't clear it?   A human feels blinded.  So whats the AV to do, slam on the brakes?\n\nWhen these systems are rolled out, we want them to default on the safe side of the equation not the risk side.   Elon has given autonomous driving enough of a black eye with his cross country by 2018 with no hands prediction.   I'm not sure what the right answer is at this point, but it's not vision only.", "score": 1, "replies": [{"body": "Even Jensen agrees with me.  No lidar mentioned [here](https://www.youtube.com/watch?v=ER7iqeYx9HU&t=614s).  😊", "score": 1, "replies": []}]}]}]}]}, {"body": "Investigation has been going on for years. If it’s not the SEC it’s the DOJ, FBI,…………… It would appear he is not liked by the deep state. I wonder why?", "score": -1, "replies": [{"body": "Also I would bet any body the reason y these self driving cars crashed every time they did is be cause every dumb ass that can't drive is to stupid to learn or just scared to drive a regular car I m pretty sure if some1 can't manage a normal car they definitely would have a harder time with a any car that advanced .", "score": 1, "replies": []}]}, {"body": "Tesla went from $140 per share to $205 within one week a few weeks ago.  I haven’t seen a 30% run up in one week since ever w this company or its relatives lol", "score": 0, "replies": [{"body": "back to 17x", "score": 1, "replies": []}]}, {"body": "don't believe the news", "score": -2, "replies": []}]}
{"title": "Tesla quietly took down all its open U.S. job postings", "selftext": "", "id": "1cn9hyx", "created_utc": 1715187371.0, "score": 151, "upvote_ratio": 0.82, "num_comments": 29, "comments": [{"body": "How do you do it loudly?", "score": 91, "replies": [{"body": "The layoffs announcement was too quiet", "score": 14, "replies": []}, {"body": "Yapping on Twitter by CEO.", "score": 6, "replies": []}, {"body": "😂", "score": 9, "replies": []}, {"body": "Press conference, Twitter announcement, website announcement, few friendly reporters, etc etc", "score": 3, "replies": []}, {"body": "Obviously Elon should have tweeted: \"WE ARE REMOVING ALL JOB POSTS FOR TESLA AND WILL CONTINUE CUTTING POSITIONS UNTIL WE GET OUR SHIT TOGETHER\"", "score": 5, "replies": [{"body": "🤣🤣🤣", "score": 2, "replies": []}]}]}, {"body": "This is so late. Their careers page has been like this from the first layoff wave.", "score": 30, "replies": [{"body": "If you read the article, this is the second time this happened. The first being April 16th. There were multiple job listings yesterday/earlier today (the article links to https://web.archive.org/web/20240508032150/https://www.tesla.com/careers/search/?site=US) but they're all gone now save for three \"Manufacturing Development Program\" listings.\n\nhttps://www.reddit.com/r/teslainvestorsclub/comments/1cn9hyx/tesla_quietly_took_down_all_its_open_us_job/l3886ws/", "score": 1, "replies": []}]}, {"body": "Not really \"quietly\"....  I have seen endless coverage of the layoffs at Tesla. they are restructuring the workforce. That comes with changing open positions too", "score": 49, "replies": []}, {"body": "I swear they only use the word quietly when they want to frame it a certain way. Did they not click the keyboard and mouse loud enough?", "score": 26, "replies": []}, {"body": "lol, my BIL was let go 2 weeks after being hired. His severance was 4x his one and only paycheck. Tesla doesn’t know how to handle staffing.", "score": 6, "replies": []}, {"body": "Because the robots are going to take those jobs", "score": 5, "replies": [{"body": "Confirmation of Optimus 2024?", "score": 4, "replies": []}]}, {"body": "If it was any other company than TESLA the word quietly would not have been used", "score": 6, "replies": []}, {"body": "This is old news. It's been for nearly a month already.", "score": 5, "replies": [{"body": "If you read the article, this is the second time this happened. The first being April 16th. There were multiple job listings yesterday/earlier today (the article links to https://web.archive.org/web/20240508032150/https://www.tesla.com/careers/search/?site=US) but they're all gone now save for three \"Manufacturing Development Program\" listings.", "score": 3, "replies": []}]}, {"body": "Can they restructure the requirements for their CEO to treat his bipolar with something other than Ketamine?", "score": 2, "replies": []}, {"body": "I graduate next spring in comp sci. Im terrified.", "score": 2, "replies": [{"body": "I think you will be good.  That is an awesome degree. You should be proud of yourself. I don't know how much the curriculum focuses on deep learning these days (I know there was little focus on it even a few years back), but definitely learn as much as you can about it. AI is going to change everything in ways most people (including industry heads) don't understand.", "score": 2, "replies": []}, {"body": "If you want any sort of stability you should look for the most boring job possible probably writing code for some finance company nobody has heard of.", "score": 2, "replies": []}]}, {"body": "Guess I will not applying jobs Elon is in", "score": 2, "replies": []}, {"body": "Probably fired to person responsible to take it down...", "score": 1, "replies": []}, {"body": "So are they not hiring for AI?", "score": 1, "replies": []}, {"body": "Yeah, you do that when you re-org.   You figure out who goes, who stays, what the new roles will be, get the change made, make the new leaders responsible for hiring new teams.   This is large corporate re-orgs as they happen today.   I don't think Mr Musk did anything special other than keep his large corporate investors happy for doing the same shit strategy as everyone else is taking.", "score": 0, "replies": []}, {"body": "Elon is a psycho.. tbh those employees are prob being saved some other ill fate at that sociopath’s hands", "score": -2, "replies": []}, {"body": "Tesla going with Chinese manufacturing has led to a huge downturn in quality, which has led to no one wanting to buy Tesla’s shitty cars.  LOL FUCK YOU ELON", "score": -6, "replies": [{"body": "In Europe the Teslas from China are said to have higher quality then the ones from the US.", "score": 1, "replies": []}]}, {"body": "\"Tesla is shit.\"  Yeah ok.", "score": -1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1cn6it9", "created_utc": 1715180014.0, "score": 8, "upvote_ratio": 0.9, "num_comments": 22, "comments": [{"body": "wow 23K in OTM with exp in 1 week with zero hedge", "score": 4, "replies": [{"body": "Who hedges in the casino ???", "score": 4, "replies": [{"body": "FR, we only edge here.", "score": 2, "replies": []}]}, {"body": "I have excellent DD tho", "score": 3, "replies": [{"body": "what is it?", "score": 1, "replies": [{"body": "It’s gonna go up because I can sense it", "score": 12, "replies": [{"body": "![img](emote|t5_2th52|4640)", "score": 1, "replies": []}, {"body": "Yeah just trust me bro!", "score": 1, "replies": []}]}]}]}]}, {"body": "Typical.", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|4258)", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Wrong", "score": 0, "replies": []}]}, {"body": "lol yolo on boring stock", "score": 1, "replies": [{"body": "Earnings are next week", "score": 1, "replies": [{"body": "Understood but you playing a YOLO with a stock that really isn’t that crazy with earnings.  I might inverse you just to keep track of this play.", "score": 2, "replies": [{"body": "Lol", "score": 5, "replies": [{"body": "lol need to have some fun myself", "score": 1, "replies": []}]}]}]}]}, {"body": "rip.", "score": 1, "replies": []}, {"body": "Been working at Walmart for a couple years and can tell you right now that we are not decreasing in theft. Actually increasing to the point that we’ve shut down self scan check out to evaluate", "score": 1, "replies": [{"body": "Precisely, therefore decreasing theft!", "score": 5, "replies": []}]}, {"body": "Walmarts is already overvalued,  this isnt gonna be a good earnings for them", "score": 1, "replies": []}, {"body": "i shall join the yolo once my hood calls print but everyone on here is bullish  ![img](emote|t5_2th52|18630)", "score": 1, "replies": []}]}
