{"title": "Options trading for 6 - 7 figure accounts", "selftext": "Does anyone have any experience with growing a 6 figure account using options?\n\nAre options generally liquid enough for strategies with an average position size of 100-200 vertical spreads and an average of 2 - 5 days hold time? Or do you find that there is too much slippage for that level of activity? Seems like apart from the most liquid names i.e SPY, AAPL etc, there is too little volume/OI for such sizes\n\n&#x200B;\n\nThanks.", "id": "do3c5f", "created_utc": 1572232466.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 24, "comments": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Cool. I guess spreading out across more tickers/trades is the way to go. What strategies do you trade mostly? Given my shorter time frames, I've found that theta decay has mostly been negligible for the debit verticals which usually have expiries set 2 - 3 weeks out.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "FOPs?", "score": 1, "replies": []}]}, {"body": "The way you’re phrasing your question and it sounds like you’ve never traded options and you should consider paper trading or doing some small guys for several months", "score": 7, "replies": [{"body": "Nah I’ve traded options for a while now and was just wondering if my strategy is scalable enough before I allocate even more capital to it.  Some of the tier 2 names have an OI only in the hundreds so they made not be able to easily handle such trade sizes", "score": 1, "replies": []}, {"body": "Nah I''ve traded for a whle now. Was just wondering if I should allocate more capital into this.\n\nIt seems the tier 2 names have an OI of only 100-200 so I'm not sure if they're able to handle position sizes of 100 - 200 contracts at a time", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks. The trades tend to be directional, with holding periods anywhere between 0 - 5 days so verticals seem to be the simplest way of balancing leverage and delta based returns. Using synthetic options positions seem to be much more difficult to manage in addition to having high theta exposure.", "score": 1, "replies": []}, {"body": ">Thanks. The trades are mostly directional with hold time from 0-5 days so vertical spreads seem to offer the best mix of simplicity, leverage and returns. Synthetic positions seem too difficult to manage in addition to having generally higher theta exposure", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Usually individual stocks and not indices. Trades are usually entered and exited in 1-2 tiers and should be filled quickly. I's mostly designed to capture quick swing moves within the week with limited downside exposure.", "score": 0, "replies": []}]}, {"body": "What are you referring to when you say synthetic positions?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I know that, I’m not sure that OP does..", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "None needed.", "score": 2, "replies": []}]}]}]}, {"body": "Was referring to things like covered calls", "score": 1, "replies": []}, {"body": "[https://www.investopedia.com/articles/optioninvestor/08/synthetic-options.asp](https://www.investopedia.com/articles/optioninvestor/08/synthetic-options.asp)  \n\n\n  \nI find Google to be a great asset. Dont you agree?", "score": 0, "replies": [{"body": "No, I was asking OP what they meant. I’m well aware of what a synthetic option is, however I’m fairly certain OP is mistaken given the fact that they think they are difficult to manage.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "2-5 days hold time? thats a bit towards the gambling territory. A general rule of thumb is to trade only 2-3% of your account on each given trade. Lets say you have 100k, so every trade (lets say SPY condor) only put in 2-3k. 2-3k is honestly not that much if you are hovering around the current stock price and not going too deep on either side. Then spread out your trade among different, very liquid securities like SPY, AAPL, OIL, GLD, QQQ, DIA, etc. that should occupy around 15-16% of your portfolio while the rest stays in cash/underlying securities.", "score": 2, "replies": []}, {"body": "If you're trading verticals and do them as a spread they are going to be sent to a complex order book where dealers will price them electronically. meaning the liquidity on screen for that is not what true liquidity is.", "score": 2, "replies": []}, {"body": "Ask a billionaire -  [https://www.gurufocus.com/news/256254/naked-short-put-options--warren-buffetts-little-secret](https://www.gurufocus.com/news/256254/naked-short-put-options--warren-buffetts-little-secret)", "score": 2, "replies": []}, {"body": "Yeah if you’re account is that large options are realistically unnecessary risk (IMO). Look up “the wheel”, or covered calls. Please don’t spent that much buying contracts outright", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Oversold as in over rated?", "score": 1, "replies": []}]}, {"body": "Recommending \"the wheel\" after mentioning realistically unnecessary risk? Just tell the man to buy and hold.", "score": 1, "replies": []}]}, {"body": "SPY should have the volume", "score": 1, "replies": []}, {"body": "SPX options are your friend. The contracts are 10x as big as SPY contracts, with no early exercise risk and better tax treatment.", "score": 1, "replies": [{"body": "The BPR is fucked up, with /ES above 3000 now.\n\nDue to efficiencies, only futures and FOPs, unfortunately.", "score": 1, "replies": []}]}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/wallstreet] [Options Trading for large accounts ($100k plus)?](https://www.reddit.com/r/wallstreet/comments/domugs/options_trading_for_large_accounts_100k_plus/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "score": 1, "replies": []}]}
{"title": "Yoloing $AMD", "selftext": "[removed]", "id": "do8sv7", "created_utc": 1572269128.0, "score": 7, "upvote_ratio": 0.74, "num_comments": 30, "comments": [{"body": "If you want max gain you should buy calls at higher strike prices", "score": 16, "replies": []}, {"body": "Honestly every fucking person on earth is bullish on AMD. I’m buying the $30 puts. Y’all must all be retarded. My theory has always been that a majority of humanity are just apes. So if the apes say calls then I will buy puts. If I fail then I will enjoy the burn of the fire  🔥 into the jaws of death, into the mouth of hell!", "score": 24, "replies": [{"body": "Sounds like you're having a rough Monday morning", "score": 18, "replies": [{"body": "Actually it’s pretty good, I made $1000 scalping Starbucks calls.", "score": 3, "replies": [{"body": "That's a lot of pumpkin lattes", "score": 2, "replies": []}]}]}, {"body": "same here, doing nothing but inversing this autistic sub", "score": 2, "replies": []}, {"body": "You have chosen..... Wisely", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "https://imgur.com/a/Wz90Lab\n\nMost used hardware survey. AMD over the years has actually been used less and less in gamers PCs", "score": -2, "replies": [{"body": "from the image, the video seems to only be talking about GPUs.  Amd really shined with their processors this year, especially the new-gen.", "score": 1, "replies": []}]}]}, {"body": "That's why I bought calls 3 weeks ago. I'll sell at open tomorrow, and then who cares up or down at earnings.", "score": 1, "replies": []}]}, {"body": "EPS would need to be $.30 to see any gains on that. $AMD should clear $.35 easily, buy now", "score": 3, "replies": [{"body": "What do you base this on", "score": 5, "replies": [{"body": "Hope and prayers", "score": 4, "replies": [{"body": "Can you add my 35c to your prayers", "score": 2, "replies": [{"body": "Will do, but we need mass prayers for more effectiveness", "score": 3, "replies": []}]}]}]}]}, {"body": "That close to expiration, meeting the strike price isn't enough.\n\nYou gotta be above it. So 37.50 imo", "score": 3, "replies": []}, {"body": "You should’ve just bought this. You would’ve doubled your money by now from the 1$ run up today (it went from 17-28/30c already \n\nI got some anyways just as upside protection in case my puts die worthless", "score": 3, "replies": []}, {"body": "I have AMD puts", "score": 2, "replies": [{"body": "Ty, my call is now secured", "score": 0, "replies": []}]}, {"body": "You are a little late to the party, look at the run up over the last week. Everyone expecting them to have a great quarter, not sure how much it can pop.", "score": 2, "replies": [{"body": "you never know that's call follow the trend", "score": 1, "replies": [{"body": "Buy $40 dollar calls on amd expiring 2 weeks from now, load up on $7000 dollars worth of it. You'll feel really really good for two weeks; well worth the money and of course all highs end with incredible lows... Aka me YOLOing $38 calls last earnings. It's just money. If amd moons you'll be a legend though.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Google an options calculator, calculate against Long Calls\n\nNovember 15th $40C x 420 = $7140 premium\n\n$40 by the 31st = $78450 profit", "score": 5, "replies": []}]}]}]}]}, {"body": "Buy them all", "score": 1, "replies": []}, {"body": "You will lose you ass on this one.", "score": 1, "replies": []}, {"body": "Do not buy calls on AMD", "score": 1, "replies": [{"body": "that's what people said last week and I yoloed and somehow made 30% today, but you're right, eventually calls won't print anymore", "score": 1, "replies": []}]}, {"body": "Picked up 200 contracts 32/Nov 1 calls back a few weeks ago when the price was sub 30.\n\nPaid 1.29 we are sitting at 2.55 right now.  98% profit.\n\nGoing to pull my money off the table and let the profits ride into earnings.", "score": 1, "replies": []}]}
{"title": "$DIS Earnings Release 11/7", "selftext": "Looking ahead to next week...  $DIS ER scheduled after close on Nov. 7. \n\n$DIS is down \\~10% from its July 29 high. Over last week and a half, support around 129.5 and resistance around 133.5, and its dropping again today.\n\nDisney+ is not available yet, but we should get some actual pre-sale numbers.\n\nI've got 30 11/8 135Cs, but am surprised there isn't more of a run up...\n\nthoughts?", "id": "dob5yo", "created_utc": 1572279928.0, "score": 27, "upvote_ratio": 0.91, "num_comments": 40, "comments": [{"body": "do not be a retard and buy calls expiring the day after earnings. I did that with microsoft and lost my entire portfolio so", "score": 58, "replies": [{"body": "Bruh, same. I had 35 $142 expire on Friday just in time to hear the JEDI announcement and watch it rise to $144 AH. Got cucked big time", "score": 14, "replies": []}, {"body": "Also Disney moves slower than most. If you make a play, consider buying stock because movement rarely lines up with option expiration dates.", "score": 7, "replies": []}, {"body": "F :(", "score": 3, "replies": []}, {"body": "i went even with my calls expiring last friday but i just made about $1050 with calls expiring this friday", "score": 3, "replies": []}]}, {"body": "I have 140 calls Jan. 2020 just waiting for this to print 🐃🐃🐃", "score": 9, "replies": [{"body": "I’m on the same boat but lost 40% so far. Hoping that by Jan would go at least $140", "score": 1, "replies": [{"body": "Yeah but theta can’t hurt us too far out. I can hold till January if I have to.", "score": 1, "replies": [{"body": "I’ve been holding for a month now and I am willing to continue to hold. Good luck,!", "score": 2, "replies": [{"body": " Tendies will be in our destiny.", "score": 3, "replies": []}]}]}]}]}, {"body": "I think earnings will be a priority for DIS because of how close it is to Disney + release. I’m guessing earnings will be positive. I’m no expert though lmao", "score": 9, "replies": [{"body": "I think that's why they ran that buy 2 years get 1 free promo on Labor Day weekend.\n\nIt allows them to show in Q3 how many people subscribed for a long term commitment. Without actually launching the service yet Disney got it's numbers into the previous quarter, they basically get two launches.\n\nPlus all that sweet, sweet unearned revenue.\n\nEdit: technically above should say Q4 because Disney has a shifted fiscal year but the rest of the comment is still accurate", "score": 10, "replies": [{"body": "Avengers End Game revenue is supposed to be on THIS earnings right?", "score": 1, "replies": [{"body": "Endgame came out in April so it'd be in the previous quarter.\n\nI also realize now that Disney has a shifted fiscal year so November is actually Q4/FY earnings", "score": 1, "replies": []}]}]}]}, {"body": "My calls are much further out. But I'm down around 60% on then. Im hoping for higher than expected presale numbers of D+ push the price up sharply. And then again at the next earnings call.", "score": 5, "replies": [{"body": "Most people I know have preordered a year or more of D+\n\nBut we all have kids...", "score": 2, "replies": [{"body": "I'm personally waiting on the bundle that they have said will be available on launch day. I imagine there are quite a few of us as well", "score": 2, "replies": []}, {"body": "No kids here. Three years preordered.", "score": 1, "replies": []}]}, {"body": "Same", "score": 1, "replies": []}]}, {"body": "11/15 $135 calls for me. (Lotta open interest on this one so you know the big dick firms are in on this strike)\n\nEarnings beat + Disney plus = hooker and blow money!", "score": 4, "replies": []}, {"body": "Im holding a lot of DIS but i am short term bearish now. DIS cant hold any rallys. Hopefully earnings changes that. Even if it misses at least it will give the stock some direction instead of fading every pop i think. We ahould  see some clarity on pre-orders and VZ impact. Also hoping park attendance and park revenues in general have picked up. Last Q was bad for attendance and increats costs around bringing up DIS+ infrastructure. Also hoping Fox is not going to drag earnings for this Q and most costs have already asorbed last Q.", "score": 3, "replies": [{"body": "VZ deal should give Disney plus 20-50mill users so I’m not sure why the thing isn’t rallying. Makes no sense.", "score": 2, "replies": [{"body": "$DIS is much bigger than streaming.", "score": 1, "replies": []}, {"body": "If you look at DIS earnings even when they beat the stock still drops so IDK. Somebody raping that mouse on purpose for sure.", "score": 1, "replies": []}]}]}, {"body": "Disney has one of the worst charts...BUT I'm still bullish :).  From the acquisition of Fox they had a 30% revenue increase last quarter (from 15B to 20B).  That's before Disney+.    \n[https://www.macrotrends.net/stocks/charts/DIS/disney/revenue](https://www.macrotrends.net/stocks/charts/DIS/disney/revenue)\n\nit didn't translate on earnings because they did some heavy investing in Disney+.  This will likely continue in this quarter as we see a huge ad/ua spend.    \n\n\nI'm  not sure if the stock falls back to 120 on earnings.  But either way, at some point over the next 2 years.  If revenues can continue through to 100B annually, we'll see a long slow road to $250.  The nice thing about this is that you can get in late.    \n\n\nDisney has too much liquidity to really pop (like it did in April).  So it'll be a long slow accumulation of millions of shares that will move it.  Those accumulations happen through institutional investment who generally hold for years.  \n\n\nDisney has projected 30m Disney+ subscribers by 2024.  I think that's pretty conservative.  If they end up with something crazy like 20m pre-orders then we might see some movement.", "score": 3, "replies": []}, {"body": "Disneys an ass man.. remember that.. raw , unlubricated , slow strokin ass man", "score": 3, "replies": []}, {"body": "lol", "score": 2, "replies": []}, {"body": "Do calls for 11/15 at the earliest, you fucking yourself I think", "score": 2, "replies": []}, {"body": "F. Exp day after earnings (speaking from experience) is a big no.", "score": 2, "replies": []}, {"body": "I bought 180 calls since they're like 1$ rn", "score": 2, "replies": []}, {"body": "It’s down on the day of ATH", "score": 1, "replies": [{"body": "Disney doesn't give a shit what spy does", "score": 1, "replies": []}]}, {"body": "I might buy January 2020 140 calls. In addition to Disney+, Star Wars coming out so Disney should be making bank for that time", "score": 1, "replies": [{"body": "I went in on June 2021 145 calls.", "score": 1, "replies": []}]}, {"body": "I hope so my friend. I been watching $DIS for quite a long time and honestly it’s disappointing. It dropped today as well when the whole market was up. I do think it will have a pre ER run up but as someone else said don’t buy 11/08 and go further out. \n\nI’m personally thinking to go all in 134c 11/15", "score": 1, "replies": [{"body": "hope you did", "score": 1, "replies": [{"body": "My paper hands sold all $DIS calls last week after ER. Honestly I didn’t think it could run up this much on the subscriber numbers. Guess I was wrong.", "score": 1, "replies": []}]}]}, {"body": "Parks will be way down. This summer was brutal in Anaheim. Hong Kong is closing parks early because of protests. Commitments predating Fox merger will drag on performance for a couple of years, and the lack of a tentpole Marvel saga going forward is another downer.", "score": 0, "replies": []}, {"body": "Fuck Disney...that is all", "score": -8, "replies": [{"body": "Yes but can we make money off em?", "score": 6, "replies": []}]}]}
{"title": "Team AMD; locked and loaded", "selftext": "", "id": "doc5s3", "created_utc": 1572284184.0, "score": 78, "upvote_ratio": 0.92, "num_comments": 36, "comments": [{"body": "wsb autist: \"and that's when I yoloed my life savings and then some on company that tricked rocks into doing math, what could possibly go wrong\"\n\nnarrator: \"and that ladies and gentlemen is the man who bought my gucci watch with all those dank AMD puts\"", "score": 53, "replies": []}, {"body": "I've got shares of AMD at a low entry point but even I'm starting to worry with how bullish all of WSB seems to be", "score": 22, "replies": [{"body": "I've got calls that I'm going to sell before earnings tomorrow, then buying puts for Thursday", "score": 4, "replies": []}, {"body": "i sold my shares today. It's going to crash. The pump in the past 2 weeks is gonna come crumbling down once ER hits.", "score": 3, "replies": []}]}, {"body": "I smell nothing but tendies 👀👀👀", "score": 11, "replies": []}, {"body": "You just bought shares now, not when it was lingering at $28 barely a few weeks ago? Hope you have money left to average down if it tanks", "score": 6, "replies": [{"body": "He should be selling covered calls .", "score": 3, "replies": []}]}, {"body": "Su Bae blesses you", "score": 3, "replies": []}, {"body": "love how \"woke\" RH is when they list this as \"women ceo stock\"\n\nRH plz start listing what pets the ceo owns. dis iz important too me", "score": 4, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "mod ceo", "score": 1, "replies": []}]}]}, {"body": "So excited for 1/3 of this sub to be rich and 1/3 of this sub to be $ROPE.\n\nOr I guess 2/3 rope and 1/3 theta gang", "score": 4, "replies": []}, {"body": "smh, even if it hits that's a big dice roll", "score": 2, "replies": [{"body": "F", "score": 1, "replies": []}]}, {"body": "Still dont get how a covered call works like so what you own the securities how does that help", "score": 2, "replies": [{"body": "get 100 shares, sell a call. Worst case 1, shares tank, you lose less money. Worst case 2, Shares soar, you win less money. Normal case you aim to get, shares go up but fon't get assigned, you win more money.", "score": 6, "replies": [{"body": "Also, can sell ITM calls if you expect a downturn.", "score": 1, "replies": []}, {"body": "Im guessing you cant sell a call using robinhood huh XD", "score": 1, "replies": [{"body": "Buy a call and u can sell one too", "score": 1, "replies": []}]}]}]}, {"body": "Let’s go", "score": 2, "replies": []}, {"body": "Already up 62% before earnings, my dude", "score": 2, "replies": []}, {"body": "Retard", "score": 2, "replies": [{"body": "It actually worked out pretty good :)", "score": 1, "replies": []}]}, {"body": "Why even bother owning shares if you’re buying calls anyway?", "score": 3, "replies": [{"body": "Shares only expire worthless if the company goes completely tits up. It's some r/investing adage called \"risk management\" or some pussy shit like that", "score": 13, "replies": [{"body": "Imagine owning financial instruments that only go up 1% if the stock goes up 1%\n\nI want immediate worthlessness or 100% gains if the stock moves in a certain direction for a couple minutes", "score": 11, "replies": []}]}]}, {"body": "Sell for profit while you can and buy puts", "score": 3, "replies": [{"body": "Why do you say this?", "score": 2, "replies": []}]}, {"body": "big AMD order AH $33.69\n\nhttps://imgur.com/a/Za5Lijv", "score": 2, "replies": []}, {"body": "\\*waits for PE to run up to 200\\* Buy signal activated!", "score": 1, "replies": []}, {"body": "INVERSE WSB", "score": 1, "replies": []}, {"body": "36 is a little high. Godspeed friend. I'm bullish too but I lose every time I buy way OTM. I'm taking small victories and building from that", "score": 1, "replies": [{"body": "I think this is honestly the best way to go. I won fucking huge on PYPL last week and went full retard on AMZN. I told myself over and over to sell for the profit before ER, but got greedy and lost 3k", "score": 2, "replies": []}]}, {"body": "Good luck. Hope you make some profit.", "score": 1, "replies": []}, {"body": "Ayy", "score": 1, "replies": []}]}
