{"title": "South Korea’s central bank raises base rate to 1% amid inflation concerns", "selftext": "", "id": "r1l9x9", "created_utc": 1637806055.0, "score": 192, "upvote_ratio": 0.96, "num_comments": 71, "comments": [{"body": "Coming to an America near you.", "score": 105, "replies": [{"body": "![img](emote|t5_2th52|4640)", "score": 45, "replies": []}, {"body": "![img](emote|t5_2th52|4641)", "score": 29, "replies": []}, {"body": "Can’t happen fast enough", "score": 5, "replies": []}, {"body": "I’m glad you recognize there are 2 different americas people live in. Thanksgiving with a few of my relatives proved that", "score": 1, "replies": []}]}, {"body": "Sounds like what a perfectly healthy  economy would do", "score": 70, "replies": []}, {"body": "It's a start in a good direction.", "score": 43, "replies": []}, {"body": "RIP fellow Asiatards\n\nOn-Margin was fun while it lasted ![img](emote|t5_2th52|4968)", "score": 57, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 8, "replies": []}]}, {"body": "Do they know that it’s transitory?", "score": 58, "replies": [{"body": "Damn somebody forgot to tell em", "score": 20, "replies": [{"body": "Yellen needs to say it more times.", "score": 8, "replies": [{"body": "I don’t know how much louder she could be, she was already Yellen", "score": 7, "replies": []}]}]}, {"body": "Better being proactive than months late. Going to be a laughing stock lol.", "score": 2, "replies": []}]}, {"body": "holy shit.  \nthis is the end, the thin end of the wedge", "score": 25, "replies": []}, {"body": "Lol. I'm glad we don't have this \"inflation\" in the west", "score": 63, "replies": []}, {"body": "[deleted]", "score": 54, "replies": [{"body": "You forgot to explain the Korean housing systems. Jeonse. More than the Jones. They get lump sums of money that they gamble with.", "score": 10, "replies": []}, {"body": "Dating is probably hell", "score": 13, "replies": [{"body": "Hot chicks tho", "score": 5, "replies": []}]}, {"body": "That's not even inflation that's just growth", "score": 3, "replies": []}, {"body": "Cant be more than Miami lol", "score": 2, "replies": []}, {"body": "How is losing over three percent of your money each year not noticeable?", "score": 2, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Interesting. I always assumed Korea was expensive", "score": 2, "replies": [{"body": "He's spewing a lot of inaccuracies, see my comment above. For [electricity costs](https://home.kepco.co.kr/kepco/EN/F/B/ENFBPP002.do?menuCd=EN060202)", "score": 1, "replies": [{"body": "> I'm not going to let this go.", "score": 1, "replies": [{"body": "What's your mother's market cap", "score": 1, "replies": []}]}]}]}, {"body": "This is a very inaccurate representation of the state of Korea. Prices are much lower for non real estate compared to North America but that's a very standard outcome of lower income per capita. Supply chain constraints are much more limited due to the distance between major Asia<>Asia hubs but inflation is much broader than that. Using ramen (huge staple) as an example [prices have rocketed upward](http://www.koreaherald.com/view.php?ud=20211107000158) which hasn't been seen since guess when.\n\nSongdo is you're referring to the area near Incheon is not even close to one of the more expensive areas. That's not even considered Seoul. It was a dead space that was developed in order to have commerce and life around the airport.\n\nElectricity is not pennies, it can be incredibly expensive. South Korea uses a tiered cost system where prices nearly triple for marginal utilization above 400kWh/month. The top marginal rate is \\~20 cents USD/kWh. If you're using air conditioning in the peak of summer where humidity is regularly >90% and temperatures above 30c with a large household, you'll be paying out the ass.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Ramen is a staple and obviously a very small component of how inflation is calculated. Regardless it is a signal of strong inflation when low cost+highly consumed goods begin to inflate well above historical norms. \n\nIf you trust government reported interest rates, I guess you don't know much about anything. \n\nOn the Songdo piece agreed you never said it was Seoul. Calling it a more expensive area is insincere at best regardless. I never said it's dilapidated as it's obviously newer construction. I said it's been developed recently for the sole purpose of bringing commerce in the Incheon area. \n\nYour response is sad because you are clearly trying so hard to be an expert in something you have no idea about. I'm no expert myself but I can spot a bullshitter like you a mile away. No response to the electricity point? I guess you pay pennies every month", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Songdo is an incredibly cheap area compared to Seoul. It's interesting how you have no idea about the history of the area you live in, but try to speak about it in any facet. I'm guessing you've never even seen the area pre-2010? Do yourself a favor and speak to a neighbor if you can't do your research online.\n\nYou keep parroting the 'two braincells' phrase but unsure why. I've already responded to both points.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Did I ever say real estate prices haven't gone up? Keep lying though, anyone with two braincells can research real estate prices and inflation", "score": 1, "replies": []}, {"body": "[https://land.naver.com/](https://land.naver.com/) Take a look through at some comps in the market", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You keep saying I'm lying, yet you can't even call out a single thing with data. Separate from all of this you need to let go of some ego. \n\nThe articles you post literally state the history of the city. Built from the sea very recently. Any thoughts on that now that you've finally done a little research?\n\n'Everything too expensive'.... 'for the elite wealthy'... this is literally conjecture. Read what I said again, I'm not saying that costs there are nominally incredibly cheap for a country with a per capita GDP of 30k and an average income lower than that. I wrote that compared to Seoul it is incredibly cheap. Real estate prices in Seoul have increased drastically even within the last two years and I'm sure that Songdo has likely seen even a greater increase due to the real estate investment craze in Korea. None of that invalidates what I've mentioned. \n\nSo what is it now? Songdo is an incredibly expensive area that prices out everyone? Or is it one of the more expensive areas in Korea but still super affordable where you pay pennies for electricity? You're crossing your narrative left and right. Mine is still the same: Korea is not cheap and your personal lifestyle in Songdo is a shit example to extrapolate from", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "'Spewing inaccuracies' doesn't mean I'm calling you a liar. Lying implies intent.\n\nRegardless sounds good I was done myself. You haven't proved anything and this isn't going anywhere given your lack of critical thinking and reasoning. Peace", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Wait to go squid game!", "score": 19, "replies": []}, {"body": "![img](emote|t5_2th52|4276)", "score": 14, "replies": []}, {"body": "oof 1%!!!", "score": 6, "replies": []}, {"body": "The economy fell into a hole with COVID-19 last year. Crawling out isn't runaway inflation it's a robust recovery but super low interest rates were never going to last forever.", "score": 4, "replies": []}, {"body": "Boom goes the dynamite.", "score": 3, "replies": []}, {"body": "and so it begins", "score": 3, "replies": []}, {"body": "INFLATION IS TRANSITORY. \n\nEverything is ok.", "score": 3, "replies": []}, {"body": "Does that mean my euros will have even more value there ?", "score": 4, "replies": [{"body": "Look what happened to the Turkish lira because they didn't raise rates", "score": 19, "replies": []}, {"body": "Nope. Their currency will be stronger relative to euros due to koreans raising their rates", "score": 14, "replies": [{"body": "Sad", "score": 4, "replies": []}]}, {"body": "If you want a cheap holiday, check out the big mac index by the economist. Just compare your currency to others. Sad part, most \"good value\" countries aren't that stable....", "score": 5, "replies": [{"body": "Spot on!\n\nI live in South Africa and its dirt cheap; I spend roughly a total of $300 monthly (including my mortgage in a middle class suburb) but have come to live with the expectation that all hell can break loose at any time (mass riots, communist revolution, government collapse etc)", "score": 3, "replies": [{"body": "Nothing has changed, I see.", "score": 2, "replies": []}]}, {"body": "Thanks ahaha that might be interesting. You're right, I might need to carry a piece if I go to some of these countries lol. I'd rather pay a bit more and stay in SK", "score": 2, "replies": []}]}, {"body": "Fx supply and demand based on trade and real interest.\n\nIf interest rates rise in one country, there's more demand for that currency.", "score": 2, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|16|**First Seen In WSB**|11 months ago\n**Total Comments**|107|**Previous DD**|\n**Account Age**|11 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=r1l9x9)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=r1l9x9)", "score": 1, "replies": []}, {"body": "It’s gonna hit every country. Even here", "score": 2, "replies": []}, {"body": "And so it has begun. It will spread from the east to the western kingdoms.", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4887)", "score": 2, "replies": []}, {"body": "WTF is inflation ?", "score": 2, "replies": [{"body": "Inflation is when stonks go up!", "score": 3, "replies": []}]}, {"body": "Korea is fucked.", "score": 3, "replies": []}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Buy bitc0in", "score": -1, "replies": []}, {"body": "Gold it is", "score": 0, "replies": [{"body": "Gold can be as volatile as anything else. Remember it only has value because we attribute value to it.", "score": 1, "replies": []}]}, {"body": "They one of the first to raise?", "score": 1, "replies": []}, {"body": "Glad I took majority of my money out of my brokerage for tax season. Let’s see where things end up in January. possibly be able to buy LEAPS and get rich off them.", "score": 1, "replies": []}, {"body": "It'll probably impact the value of those funny digital funny money tokens first.", "score": 1, "replies": []}, {"body": "The U.S. fed should do the same soon", "score": 1, "replies": []}, {"body": "OMG 1 whole percent.  The world will crumble.....", "score": 1, "replies": []}]}
{"title": "Many people think that meta verses will be a huge opportunity in the future….meanwhile I’m still not sure exactly what the hell it is but could be looking into.", "selftext": "", "id": "r1xq9k", "created_utc": 1637850461.0, "score": 41, "upvote_ratio": 0.77, "num_comments": 76, "comments": [{"body": "The metaverse is where real life NPCs get to pretend they are main characters.", "score": 102, "replies": [{"body": "That’s a bar!", "score": 15, "replies": [{"body": "We just say Bingo.", "score": 8, "replies": []}]}, {"body": "Shouldn’t you guys be at thanksgiving dinner? You can stop being a degenerate for a couple days out of the year..\n\nHappy Thanksgivings fellow degenerates!", "score": 15, "replies": [{"body": "Dirty American 🏈", "score": 3, "replies": []}]}, {"body": "That's just Facebook, Instagram or Twitter", "score": 2, "replies": []}]}, {"body": "Zucc with the 200 iq play. See losing market share and dwindling growth, \"invent\" second life with better graphics. Big multi-trillion idea yeah", "score": 36, "replies": [{"body": "And these glue sniffers doing the actual inventing of the product on reddit comments. Think we are some years away from some dystopian alternate world when some(like me) almost throw up in 30 sec from wearing the stupid vr goggles.", "score": 11, "replies": []}]}, {"body": "Ready Player One.", "score": 27, "replies": [{"body": "This. And [The Congress](https://m.youtube.com/watch?v=uBv9syFBpeA).", "score": 4, "replies": []}]}, {"body": "Everyone knows metaverse is another word for 3d porn. I'm bullish", "score": 18, "replies": [{"body": "Transform your date into 2007 Megan Fox for 19.99$ \nPeople also bought:", "score": 13, "replies": []}, {"body": "3D porn has been a thing for a while now in VR", "score": 2, "replies": []}]}, {"body": "It’s going to be the same few people living in their devices all day and night and buying up digital crap with no use in the real world", "score": 17, "replies": [{"body": "Well people do this in real life as well. ![img](emote|t5_2th52|4275)", "score": 14, "replies": []}]}, {"body": "The Metaverse basically gives ppl an opportunity to check out things they otherwise wouldn't be able to do in real life. \n\nLet's say you've always wanted to visit the Tombs in Egypt but you can't afford it...\n\nSooo...Some archeological team straps on a camera and goes to the Pyramids, the Sphinx, etc...Then uploads it to the Metaverse. \n\nNow Joe Autist can now login into his device, shell out some digital currency and see Egypt up close in a visual sense. Or check out that museum he's always wanted to go to...Or visit Yellowstone. Or climb Mount Everest. \n\nReal world applications in a digital world. Tourism, recreational sports, teaching tools, etc.", "score": 23, "replies": [{"body": "So a Documentary then.", "score": 25, "replies": [{"body": "So the matrix then.", "score": 11, "replies": [{"body": "Yes but which pill should i take? the blue or red???\n\n![gif](emote|free_emotes_pack|flushed)", "score": 2, "replies": [{"body": "Both💊💊💊", "score": 2, "replies": []}]}]}, {"body": "an interactive documentary", "score": 1, "replies": []}]}, {"body": "Does anyone without a flat brain, actually believe this? This is second life. This is a worse second life.\n\nCompany's/shills are trying to convince you that seeing a 3d picture of egypt, is as good or better then being there.", "score": 31, "replies": [{"body": "Cathie Wood said it was going to be huge and she’s never been wrong, so I’m sure it’s the next internet.", "score": 9, "replies": []}]}, {"body": "What Stocks are you expecting to benefit from this or play a part?", "score": 5, "replies": [{"body": "Roblox seems like one", "score": 12, "replies": []}, {"body": "COIN tsx", "score": 5, "replies": [{"body": "I watch that one already. As well as NVDA and AMD. Let’s see what happens", "score": 8, "replies": []}]}, {"body": "Alot of big companies are partnering with meta off rip Nike is what I know off the top of the list of companies I’ve read metaverse is just another way to make more money and tbh it’s still so early hopping in now would be a great choice in about a decade or less", "score": 3, "replies": [{"body": "I believe it. Which is why I’m trying to see what companies would benefit the most or likely to. But the way it seems, it’s a virtual world. Wouldn’t be surprised to see companies advertising in there. Partnerships of all kinds. Extra added revenue all around", "score": 2, "replies": []}]}, {"body": "Unity", "score": 2, "replies": []}]}, {"body": "Sounds cool. When a company NOT Facebook makes something like this I'll be interested.", "score": 4, "replies": [{"body": "Nvidia is making their own version they call omniverse.", "score": 2, "replies": []}]}, {"body": "That actually makes sense.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "In a sense you're correct. But it feels a bit different when you're experiencing it in first person. \n\nFor example..I love horror and sci fi movies. But when I strap on an Occulus and have a zombie sneak up on my 6, it feels a lot different than watching a zombie movie on YouTube.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Not sure why you're doing the Old Man Yelling at the Cloud my way. I was just explaining the applications of the Metaverse. I'm not defending it.", "score": 1, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "Tbh sitting in a plane for 15 hours straight is an overrated experience. Having lived in several countries I can say that part is missable.", "score": 2, "replies": []}]}]}, {"body": "You are going to hate the future so much", "score": 1, "replies": []}]}]}]}, {"body": "We have those, it's called \"VR Experiences\". You don't need a metaverse platform to drop in and explore.", "score": 1, "replies": []}, {"body": "Euclideon the company and their Unlimited Detail thing", "score": 1, "replies": []}, {"body": "We already have this. It's called VR.", "score": 1, "replies": []}]}, {"body": "Does this mean my wife is gonna get metaverse gangbanged? Am I gonna come home to her sprawled out on the dining room table with a goddamn headset on", "score": 4, "replies": [{"body": "What’s her gamertag?", "score": 5, "replies": [{"body": "MarriedSlut4Yew69", "score": 4, "replies": []}]}]}, {"body": "I’m a thousand years from now, all of humanity will probably  exist eternally in a digital environment. Think of this as the first step towards that future", "score": 8, "replies": [{"body": "Just like second life. Look forward to inviting ferriet to your wedding. To a vampire wedding happening next to your child's funeral. The future is is great.", "score": 3, "replies": []}, {"body": "who's to say we arent already existing in a digital environment...The simulation hypothesis is more and more likely true the better we make the meta verse....", "score": 2, "replies": []}]}, {"body": "Mega virtual reality world, not just games, but also zoom calls on steroids, being in places far away, with others there also, and really feeling like you are there….much like gaming….\n\nIm not a fan of all of this.\n\nJust because we can doesn’t mean we should, or should not, when it comes to technology.\n\nIt means we should really think about it, choose wisely.\n\nWe lose what we don’t use….\n\nAnd chunks and chunks of our humanity is already on its way to that graveyard.", "score": 2, "replies": [{"body": "I think we don't have the tech to do that decently, not yet at least.", "score": 1, "replies": []}]}, {"body": "Companies have run out of stuff to sell so now create a second life where they can sell you those same things, but digitally. I'm bullish RBLX, AMD, and NVDA btw. Lol", "score": 2, "replies": []}, {"body": "I could see the educational aspects of something like this being fuckin wild. I guess it’s just VR that I’m picturing but if it’s backed by this Meta bullshit then maybe it’ll take off. \n\nFor me personally, the whole work from home but still have meetings in the meta verse thing was fuckin stupid as hell, but then I realized that I work with people in their 20s and even 30s who already refuse to answer phone calls or meet in person or if they do they’re anxious as fuck. They want a text. Or zoom. That’s it.\n\nThese people are now raising kids. Imagine how thirsty people will be for this sort of disconnected connectivity (lol see what I did there) in 15-20 years. \n\nBut I watched Zucks YouTube intro to Meta and it was the most cringe fuckin thing ever just saying that guy is almost as bad at human interaction as…I don’t know. Finish with something clever in your own mind. A vacuum or something.", "score": 2, "replies": []}, {"body": "The comments are confusing.  Isn't this just a list of stocks to short?", "score": 4, "replies": [{"body": "Why would you short them? Stocks like Roblox are just getting started", "score": 2, "replies": [{"body": "Wrong thread.  Thought I was commenting in the China sticks to be delisted.", "score": 3, "replies": []}]}]}, {"body": "I think metaverse consists of augmented reality and virtual reality, seems like most of the people ITT are focusing on VR side of things, but I'm more excited about augmented reality and some of it's applications in medical, engineering world. Having said that I don't think metaverse will be as big as people are making of it. We will see.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "second life in VR with haptic feedback and \"accessories\" will be a little cooler", "score": 1, "replies": []}]}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|9 months ago\n**Total Comments**|9|**Previous DD**|\n**Account Age**|8 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=r1xq9k)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=r1xq9k)", "score": 1, "replies": []}, {"body": "Sounds like Everquest", "score": 1, "replies": []}, {"body": "meta has all chances to become successful alternative reality for snowflakes in attempt to live in the world where they’re worth anything… so, I’d invest a bit", "score": 1, "replies": []}, {"body": "Metaverse crashes faster than it takes off. \n\nMetaverse is all the shitty NFTs coming to life together  and having orgy.", "score": 1, "replies": []}, {"body": "I think the best description of the possibilities of the metaverse are from the book (fuck the movie that shit was wack) ready player one. Don’t know how long it’ll take to get to that point but you bet your ass it’ll get there", "score": 1, "replies": []}]}
