{"title": "Stock market at all time highs, housing market at all time highs", "selftext": "One must wonder why both the stock market and housing market are both at all time highs? The median price of a home sold in May was **$419,300** — an all-time record. As we know the stock market is at all time highs as well. Now lets look at what's driving the stock market to all time highs, not hard to figure it out its big tech. Wall St has a love fest with big tech right now. Just buy big tech and get rich right? Not so quick, those of you that remember the [dot.com](http://dot.com) bubble in the 90's remember how that ended. Between March 2000 and October 2002, the NASDAQ fell from 5,048 to 1,139, erasing nearly all of its gains during the dot-com bubble. By the end of 2001, most publicly traded dot-com companies had failed. I was a trader back then and bought many penny stocks that skyrocketed in price during the [dot.com](http://dot.com) boom. Lucky for me I cashed out around the highs before most of them went bankrupt. This brings me to the current AI-boom which I missed out on. I am not saying the AI-boom is not justified. However, the market has already deemed the new winners. Just like it was during the dotcom boom there were winners but many went bankrupt. We shall see how the AI boom evolves, but when a sector is only thing leading the market to new highs history tells us a crash will follow.\n\nNow lets look at housing. I lived through the first major correction in the housing market in 2008. I took my gains from the 90s dotcom boom and invested in real estate soon after. I got lucky and sold most of my real estate right before it crashed in 2008. The stock market and housing market crashes of 2008 trace their origins to the unprecedented growth of the subprime mortgage market that began in 1999. Could we have a repeat of previous events? Right now average people can not afford a home. Why is this? Could it be Wall St has become a major buyer of real estate remembering the government bailed them out last time, who knows. What I do know is what my ole grandpappy used to say, what goes up must come down. Baby boomers own most real estate and will soon be major sellers due to death or downsizing, this is just facts. Right now, boomers have a pretty large grip on the US housing market. The generation accounts for about 21% of the total US population, but they own 38% of American homes We shall see what happens in the future but history always repeats its self.\n\nCHEERS!!  \nMAV", "id": "1dr1pu4", "created_utc": 1719630883.0, "score": 191, "upvote_ratio": 0.81, "num_comments": 114, "comments": [{"body": "I’ve lost track of how many unsubstantiated points you tried to establish as patterns or rules", "score": 94, "replies": [{"body": "Yeah his “boomers will die and flood the housing market” point is particularly dubious considering the boomers are already dying and the biggest death rate spike for them happened during COVID.", "score": 31, "replies": [{"body": "This. My dad was a boomer. He died this past year. He had six children. None of whom profited enough off his 820k estate to buy a house outright with the proceeds. Who bought his house? Another boomer investor. When the boomers die, they’ll leave their estates to their heirs. If they have more than one it’s not going benefit the next generation enough to buy a house because they cost 400k on average now. I don’t see the boomer die off shaking up the status quo all that much, mind you this is from my own personal experience and not based on my knowledge of the housing market. My knowledge of real estate though would seem to indicate a further concentration of wealth and property to the already propertied class though. Remote work, Airbnb, secondary and tertiary markets blowing up, wholesale buying of single family homes by flippers, small time landlords, and real estate investors; if current trends continue, real estate is just going to keep becoming more scarce and more valuable. I hear a lot of people saying a correction is due, but the last two times a correction was due, people that already had a lot of investment capital profited from the crash. Not families looking to buy their first home.", "score": 10, "replies": [{"body": "It sucks…the average 3 bedroom house in my area is $800k it’s absolute madness and so sad to see for the younger generation", "score": 4, "replies": []}, {"body": "Sorry for your loss!", "score": 3, "replies": []}, {"body": "Black rock is buying all the houses", "score": 2, "replies": []}]}, {"body": "Not to mention wall street may just buy them up and make the next generation perpetual renters", "score": 2, "replies": []}, {"body": "Funny thing is the year 2020, despite all the calamity amd tragedy... was **actually a green year for markets**.\n\nRegulation works.  Active government does actually prevent crises, mass job loss, and needless suffering.\n\nWe are better capitalized and doomers keep moving the goalposts.\n\nIt's the truck hitting pole meme on loop at this point.", "score": 5, "replies": []}, {"body": "Yeah and who’s gonna buy their houses? Who’s got 2 million for a 3 bedroom", "score": 1, "replies": []}]}]}, {"body": "We’re probably mid cycle in a bull market. Too many people have doubts this can keep going up and to the right. Wait until everyone believes numba can only go up. Doesn’t feel like we’re there yet.", "score": 136, "replies": [{"body": "normies are selling and shorting? time to rekt them. there's absolutely no correlation between the state of the economy and the stock market", "score": 38, "replies": [{"body": ">no correlation between the state of the economy and the stock market\n\n\nStock market is forward looking and ahead of the economy but they are absolutely correlated.  Market is pricing in what has been an extremely resilient and thus far expectations that it will still keep growing.\n\n2Q looks even better than 1Q based on forecasts.\n\nThat said, I 100% agree and there is still **WAY too much worry** out there.\n\nCrashes don't happen when every retail investor is confident it's imminent.", "score": 3, "replies": []}]}, {"body": "We’re probably like only 20% into the ultra bull cycle IMHO", "score": 1, "replies": []}]}, {"body": "Probably has something to do with the constant 2 trillion dollar spending packages getting passed every year and debt monetization and the resulting inflation.", "score": 93, "replies": [{"body": "Simply the existence of inflation means that in general all the amounts should be at all time highs all the time.", "score": 23, "replies": [{"body": "Yes inflation is actually great for stocks.  It's a myth that inflation is bad for equities.\n\nNot only does rising price levels generally raise asset prices (look at Turkey's stock market right now), revenue and profits are not magically exempt from inflation.\n\nEPS of S&P 500 soared in the 70s.\n\nhttps://i.imgur.com/JvAcAUi.png", "score": 2, "replies": [{"body": "The only reason inflation is 'bad for stocks' is that its usually accompanied by higher interest rates and thus there is a point where guaranteed bond returns are worth more than projected stock returns and thus you risk outflows from the market into bond holdings which can devalue the overall market.", "score": 2, "replies": [{"body": "Yes correct but rates are not rising anymore, only going down.", "score": 1, "replies": [{"body": "I'm not sure I agree with that though.  Short-term rates are leaning down because they expect the fed to eventually start backing off the prior rate hikes.  But long-term rates (like the 10y) aren't shifting downwards.  And if the Fed continues to stall cuts to the Fed Funds rate, then the 10 yr will actually trend higher.  We have an inverted yield curve atm where the short term yield is higher than the long-term, which simply isn't sustainable.  And either short-term rates have to go down, or the long-term rate will eventually catch up.  Its inevitable.", "score": 0, "replies": [{"body": "Nah long term won't go much higher.\n\nWhether there's a delay here or there in cuts is totally irrelevant and a false narrative.\n\nOtherwise we wouldn't be ripping to ATHs when cut hopes nearly died for 2024 early this year.\n\nBottom line Fed will eventually get to 2.5% as their long term FFR and they will even correctly target higher inflation at 3% for a while if they feel they need to.\n\nSince we are very, very far from full employment.", "score": 1, "replies": []}, {"body": "Bottom line though inflation is generally extremely good for stocks and profits.", "score": 1, "replies": [{"body": "I agree with that.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "This 👆🏼more money in circulation equals inflated prices all around, for all markets. And, when the last two presidency’s, as was so kindly pointed out the other night, increase the deficit back to back by the two largest amounts on record… everything goes up in price.", "score": 22, "replies": []}]}, {"body": "Price of groceries is at an all time high, the price of everything is at an all time high ..so why wouldn't the stock market be the same? Its a global thing.", "score": 83, "replies": [{"body": "It will keep growing since inflation is included in the system. That's why we gotta invest our money instead of putting it under the pillow.", "score": 26, "replies": [{"body": "Invest in AI ..so when AI takes your job ..you no longer need the job :)", "score": 12, "replies": [{"body": "Ideally I just rent an apartment and I live in the countryside but not sure I can live with the 800 euro of rent money.. for now I am working to pay my mortgage and I'll see what to do after.", "score": 3, "replies": []}]}]}, {"body": "Everything is always priced at “all time highs”. That’s how our economy is intended to work - the alternative, a deflationary economy, is much worse as it incentivizes hoarding cash, not investing and low wages.", "score": 12, "replies": [{"body": "Which leads to job losses and general economic malaise.", "score": 1, "replies": []}]}, {"body": "Until very recently money printing was at the ultimate high, a very large reason everything is now at an all time high", "score": 3, "replies": []}]}, {"body": "What are you trying to say? Both real estate and equities should be at least somewhat correlated. Both are investment opportunities with somewhat similar risk profiles. It isn't that surprising that when one is at ATH, so is the other. They should be influenced by many of the same macroeconomic trends.", "score": 10, "replies": []}, {"body": "Op claims he sold his re holdings at the top of 2007 and was not affected by the market crash. He is trying to portray an image that he is smart. If he was smart he would tell during the 08-09 crash I loaded up on stocks and real estate and now living like the king of one of the Europoor countries. So as he is not that smart, he is only trying to project his own insecurities about the markets.\n\n\nOP’s post history also shows he is a Paramount stock bagholder. He is down 78% from his purchase 😂😂😂", "score": 13, "replies": [{"body": "Just got into para fingers crossed", "score": 1, "replies": []}]}, {"body": "The fed printed trillions of dollars and handed them out to everyone.  This caused massive inflation and so here we are.", "score": 32, "replies": [{"body": "Unfortunately, the majority of that money was funneled right to the top 1%.  The rest of us have seen our quality of life diminish in the blink of an eye.", "score": 30, "replies": []}, {"body": "I didn't get any money. Are you referring to the PPP?", "score": 6, "replies": [{"body": "https://en.m.wikipedia.org/wiki/CARES_Act#:~:text=The%20Coronavirus%20Aid%2C%20Relief%2C%20and,pandemic%20in%20the%20United%20States.", "score": 1, "replies": [{"body": "\"Most single adults\" receiving a check for $1,200 + the larger families' amounts checks in at $300B... not sure that alone is why inflation occurred but yeah, certainly didn't help.", "score": 2, "replies": []}]}]}, {"body": "You got free money?", "score": 2, "replies": [{"body": "Yes, I got thousands of dollars of \"free money\" as \"Covid relief\".  You did too and you already knew that.  Now we're paying the price of insane inflation.", "score": -2, "replies": [{"body": "Q: are you aware of what % of COVID relief $$$ came to regular folks and what % went to the top 1% ?", "score": 6, "replies": []}, {"body": "I didn't", "score": 1, "replies": []}]}]}]}, {"body": "it doesn’t help that roughly 20-25% of residential homes are investment homes.\n\nInvestors get richer while normal people get priced out of home buying.  This is the new american way.\n\nI am all for a hefty tax on investment home purchases", "score": 19, "replies": [{"body": "While we are at it, abolish capital gains tax for the billionaires.\n\nIt's stupid that the rich pay less % tax on new income when middle class pays more.\n\nTreat it like ordinary income at the marginal bracket you are at.\n\nThe game should get *harder* as you get bigger not easier.  It's like playing a video game and you level up faster, faster.  Makes no sense.", "score": 2, "replies": []}]}, {"body": "We have a trifecta here.  Population is at an all-time high.  When does your grandpappy think we get back to the population numbers of previous generations?", "score": 19, "replies": [{"body": "demographics say otherwise. birth rates are going down and so is life expectancy for most. housing highs are due to scarcity.", "score": 4, "replies": [{"body": "That isn't otherwise.\n\n[The Demographic Outlook: 2024 to 2054 | Congressional Budget Office (cbo.gov)](https://www.cbo.gov/publication/59697)", "score": 1, "replies": [{"body": "The first paragraph under the graphs states net immigration is increasingly driving growth and will they project accounts for all growth 2040 and on.", "score": 2, "replies": [{"body": "Ok", "score": 1, "replies": []}]}]}]}, {"body": "Soon I hope. Too many people. I often reflect on what catastrophic event will have to occur to cut humanity down to a reasonable number. It is inevitable. I understand I’m part of the problem.", "score": -15, "replies": [{"body": "That is what my ancestor from 5,000 BC used to say.", "score": 12, "replies": []}, {"body": "That’s pretty messed up you want millions to die. Are you going to volunteer yourself and your family to go first?", "score": 3, "replies": [{"body": "I often think about that. I think I would be willing. We are destroying so much life on this planet. There are far more important things than me and humanity. Of course, easy to say because I’ve already had a pretty full life. I don’t think I’m alone. There’s a reason Avengers: Infinity Game struck a chord. I would never wish ill on anyone but it’s plain at this rate we will destroy ourselves and will take a lot of innocent lives (animals, plants, ecosystems) and beauty along with us in the process. \n\nEvery organism follows a population graph of boom and bust and we are currently in boom period. I’m just saying, it’s only a matter of time before there’s a bust, but in the scale of things this could be 10’s of thousands of years from now. Who knows.", "score": -1, "replies": []}]}]}]}, {"body": "It's because your money is worth less as a result of QE", "score": 6, "replies": []}, {"body": "It’s important to account for inflation in those numbers. For example, the inflation adjusted S&P500 is just barely breaking new highs set back in late 2021. Similarly the average home price when adjusted for inflation is actually down from the highs set in 2022. \n\nSo while prices appear higher than ever, in reality that’s not exactly the case. Even though it feels that way and for many it really is the case.", "score": 3, "replies": [{"body": "Interesting. It's there anywhere else I can read about this?", "score": 1, "replies": [{"body": "Maybe. I was just looking at this S&P chart: https://www.gurufocus.com/economic_indicators/5860/inflation-adjusted-sp-500-index-price\n\nAnd this housing data chart: https://fred.stlouisfed.org/graph/?g=kYEb", "score": 2, "replies": []}]}]}, {"body": "When you print money like the fed it becomes hard for it to hold its values against assetts more money in the system that money becomes devalued. \nIs this not simply supply and demand, during covid lots of money but not enough goods so good prices were up. \nThe government relies on inflation to keep its debt rolling.\nCould this be why poor who have no assetts fall father behind. \nHome values going down, maybe a little or if there becomes a glut, but building and repairing homes has increased in costs, one could say as high if not higher than inflation. \nGood skilled workers become harder and harder to find.", "score": 2, "replies": []}, {"body": " When everything is at all time high, that's relative to money not to each other. So really not much has changed but the buying power of the currency because there is more of them around.", "score": 2, "replies": []}, {"body": "How can you downsize when a smaller house still costs a fortune and has way higher property  taxes on it?\n\nAnd when boomers die, their kids, who are most of them renting, are moving in.\n\nIn the US the only thing that can bring down the housing prices right now it's new vertical construction. Big apartment blocks with retail space below.", "score": 2, "replies": []}, {"body": "Print enough money and asset prices will keep climbing.", "score": 2, "replies": []}, {"body": "One difference between the current \"all-time high\" today and the \"all-time highs\" of 2001 is inflation.  Once you start adjusting for the cumulative effect of inflation over the past 3 years (20%+), then suddenly those 'all-time highs' of today just aren't.  Outside of big tech which is riding the AI boom (more on that in a sec) the rest of the market is relatively flat over the past 2 years when adjusted for 20% inflation.  \n\nAs for the AI boom, many compare it to the .com bubble of '01, but I would note that the .com bubble burst once you saw exuberant valuations applied to profitless companies.  But in the AI space, almost all the players that are roaring are large cap players that are already profitable.  If you rode those types of stocks in '01, then the .com bust was a short-term blip on a long-term growth trajectory.   \n\nIf you wanted a sector that, imo, more closely aligned to the bubble of 2001, I'd point you to EVs and Green Energy.  That's where you saw the multi-billion dollar valuations on companies who are no more than an idea and have minimal revenues and no profits.  And thus you've seen the Fiskars of the world go away.  RVN has had its stock hammered, and many of the solar plays are way underwater from their peaks.  When I start seeing those profitless AI companies start IPOing, then I'll start seriously hedging for a bubble in the AI space.", "score": 2, "replies": []}, {"body": "the market isn’t going to crash if that’s what you’re getting at.  If anything the AI boom is just getting started as we are potentially entering an era of increased productivity with AI and automation combined with rate cuts. The era you want to look at is the mid to late 90s because that’s when the internet first started to become mainstream and increased productivity combined with rate cuts. We’re on the cusp of a new bull market", "score": 9, "replies": [{"body": "The consumer is slowly dying, even Walmart has warned of this earlier in the week. Even with AI the stock market is doomed to fail, if people stop buying stuff they don't need.", "score": 11, "replies": [{"body": "You mean afford.", "score": 4, "replies": []}]}, {"body": "AI and automation has been increasing productivity for decades. \n\nShow me companies that have reduced headcount due to LLMs.\n\nTech companies buying up chips doesn’t mean we’re in a boom, it means they have FOMO and *maybe* there will be a boom. ", "score": 9, "replies": [{"body": "https://tech.co/news/companies-replace-workers-with-ai", "score": 1, "replies": []}, {"body": "Lol AI is coming for jobs, and is already taking jobs, albeit the current focus is on generative AI because it's the lowest hanging fruit", "score": -4, "replies": []}]}, {"body": "Cue the music...\nNext track:   \"1999\" by the Artist formerly known as Prince.", "score": 1, "replies": []}]}, {"body": "You've finally failed at timing the market. Congratulations. I'm sure you'll buy stocks when they are much higher in a few years time.", "score": 5, "replies": []}, {"body": "It’s fake😎 Watch it come crashing down after the elections. We don’t know when, but it will.", "score": 5, "replies": [{"body": "With the exception of the next 5 months, all of the remainder of recorded time will be after this election, so you have a very good chance of being right!", "score": 1, "replies": []}, {"body": "So should I sell all my VOO and QQQ around election time?", "score": -1, "replies": []}]}, {"body": "And yet most of my stocks are down 30-60 percent. It's only a few big companies doing really really well..", "score": 4, "replies": [{"body": "Are you familiar with ETFs that track the S&P 500? They were made for you.", "score": 4, "replies": [{"body": "Yes but there's just no fun in that.", "score": 1, "replies": [{"body": "Losing money is fun?", "score": 1, "replies": []}]}]}]}, {"body": "“I timed the market perfectly in 2000, I timed the housing market perfectly in 2008” you sound sus as f*#*", "score": 2, "replies": [{"body": "Yeah what a bullshitter, seriously", "score": 2, "replies": []}]}, {"body": "The historical patterns are definitely worth considering. However, the AI and tech sectors today have a lot of solid growth drivers. And while the housing market's future is uncertain, there are always opportunities for those who stay informed and adaptable.", "score": 2, "replies": []}, {"body": "Maybe it's a market leader but Austin's housing market peaked in Q2 2022.", "score": 1, "replies": []}, {"body": "Considering that inflation is a thing, numbers like average housing and the stock market should always be at an all time high.\n\nI mean, that’s understanding the world 101 stuff.  If you don’t get that, you need to go back to step 1 in your finance education.", "score": 1, "replies": []}, {"body": "Got in early on some wireless IPOs and it just skyrocketed from there", "score": 1, "replies": []}, {"body": "I feel bad for those constantly pumping diversity into international etfs and missing out on these gains", "score": 1, "replies": []}, {"body": "Good theories based on reasonable observations.  Guaranteed to be wrong or maybe you are lucky.  But you nor I know shit and the sooner you realize that and just ride with it the better for you.  And history never really repeats itself it just rhymes", "score": 1, "replies": []}, {"body": "Houses wil be to their heirs. No way it will be sold....", "score": 1, "replies": []}, {"body": "I don't think you guys need to worry at all. You can go check out other markets, like the Chinese stock market, which has been fluctuating around 3000 points.", "score": 1, "replies": []}, {"body": "Being at an all time high is NORMAL. Not indicative of a crash. No one knows if it crashes tomorrow or only in 10 years. \n\nIf all time highs were rare… then why invest? lol ", "score": 1, "replies": []}, {"body": "To everyone making fun of the OP I have 4 things to which I would like to hear your response too.\n\n1. Yield curve in the bond market is still inverted. History says that will be a big deal when it uninverts. No idea when it will happen but does that give you pause?\n\n2. Japanese carry trade is having problems. For those that don't. Know the Japanese bank have been borrowing yen and buying assets around the world for decades that yield a better rate of return. That was profitable and now appears to be a problem that is costing them money. To unwind the trade they have to sell stuff. A lot of stuff. Estimates are that the entire trade involves around $20 trillion in assets. If they dump a bunch of it then the supply of assets for sale goes up dramatically so prices probably go down. Any thoughts on that?\n\n3. Florida and California housing and insurance. The number of people using the state insurance of last resort has ballooned. That is a problem because the insurance of last resort doesn't have sufficient reserves to pay out large amounts of claims. I won't be surprised if a lot of turbulence in home demand occurs as people move due to this. My thinking is that prices there will collapse when the inventory of homes in those impacted markets start rising dramatically. On the other hand people have to live somewhere so a lot of those people are going to end up moving to other places and driving prices up there since demand will exceed supply for years. \n\n4. CRE office , bonds on them, and banks. It appears that much of the CRE office issues have been rolled over the past 18 months or so. No one wants to face the music. The few instances where it has gone to market the losses have been incredibly high. I saw the other day that a particular building sold so far below the previous price that all the related bonds below AAA went to zero and the AAA took a big loss. Maybe it's just me but that sounds like an issue where a bunch of big institutional investors are going to take major losses at some point. They haven't taken the losses yet, but it's going to be really ugly when they do. How do you think that will play out? Please keep in mind that many of these losses are going to hit a bunch of people with bonds in their retirement portfolios who likely don't realize how much exposure they have.", "score": 1, "replies": []}, {"body": "Greed at all time high.", "score": 1, "replies": []}, {"body": "Housing market has been drastically decreasing in price for a few months already. Some markets are down 14% from peak already. Housing is good", "score": 1, "replies": []}, {"body": "Lol In BC the median house price is literally double that", "score": 1, "replies": []}, {"body": "Amazon earns more just through their newest product division—AWS—than all of Coca Cola did last year. Tech valuations are justified.", "score": 1, "replies": []}, {"body": "Yes, were in a bubble but, I have no idea if it will pop and I definitely don't know when it will pop!", "score": 1, "replies": []}, {"body": "Unlike the majority of people commenting on this thread, I think you have some great points. A lot of people who say the housing market isn’t going to get better probably have a lot of skin in that market and are trying to screw people on rent.", "score": 1, "replies": []}, {"body": "Someone should let the magats know we ok we don’t need an incompetent criminal in the WH . He already has caused enough damage", "score": 1, "replies": []}, {"body": "We printed trillions of dollars and pumped it into the world. That money flowed into assets. Hard assets like real estate and also the stock market. \n\nThat is the reason.", "score": 1, "replies": []}, {"body": "Lots in this post doesn’t add up or make sense. You’ve used ‘I got lucky’ twice, so I call total BS.\n\nEnjoy continuing to live with your parents.", "score": 1, "replies": []}, {"body": "Iikkkkk", "score": 1, "replies": []}, {"body": "History doesn't repeat. It rhymes.", "score": 1, "replies": []}, {"body": "Housing market- low inventory keeps markets sustainable. Should only crash with great job loss or policy change on rentals.\n\nStock market- absurd rally, foreign markets are trash so they are flooding into ours, pensions are now 401k match. Difference is most gains are from mag 7 which continue to do buy backs and offer those compensations to employees. \n\nCatalysts- job loss, China wars, appealing foreign markets, policy shifts", "score": 1, "replies": []}, {"body": "Go check household incomes. They have only gone up. ", "score": 1, "replies": []}, {"body": "Uhhhh because they both rise with time.  Pretty simple.", "score": 1, "replies": []}, {"body": "Everything is artificially inflated. My neighbor lived in a 500k house sold it during Covid made only 89k on it, but…… got 350k in PPP loan money! Moved out of state bought a 800k house appreciated to 1.2 million sold it after 2 years and bought a 1.5 million dollar house. His 1.5 million dollar house is now worth 2.1 million dollars!!!! All this money dumped into the stock market is PPP loan money again artificially inflated!  What will push housing prices down will be a slow increase in inventory that accumulate over time. Look on Zillow inventory is going up, with more homes on the market sitting longer, will force people to drop their prices. This big correction won’t be seen until 2028 during the fall of the next Shemitah year!!!!", "score": 1, "replies": []}, {"body": "\"What goes up, must come down\" is never a good reason, as far as I'm concerned.  What goes up will keep going up until there is a reason for it to do something else.  We may indeed be headed for a crash but, if it triggered today, I can't see how it would be anything but minor.  It would have to build up a lot more from here to be as big as the dotcom crash.  So my money is on us building it up a lot more.", "score": 1, "replies": []}, {"body": "You are very good at timing. Tell us when will the bubble burst?", "score": 1, "replies": []}, {"body": "I learned that 1 in5 homes are bought by black rock or similar businesses", "score": 1, "replies": []}, {"body": "Imo inflation and debt won’t reach a tipping point until late 2020’s or early 2030’s. We will then see a financial crisis the likes of which this country has not seen since the Great Depression.", "score": 1, "replies": []}, {"body": "Your whole post can he summarized as “The value of the dollar is at an all time low”", "score": 0, "replies": [{"body": "You forgot the part where he is a market genius.", "score": 0, "replies": []}]}, {"body": "There is sooooo much money around you have no idea. I call it the liquidity put. Don't need a Fed put anymore.\nThe sheer amount of money people have is crazy.\nThere are more than 5 million households with at least a $5 million net worth.", "score": 0, "replies": []}, {"body": "Both are connected for some markets. If stock markets keeps hitting highs, housing market will be highs. This is based on my observation in seattle, average home is more than million $. Inventory is very low. The YoY prices have gone up 20% in my area. This is a techie town. \n\nAlso am i a realtor, usually i see buyers coming in with 20+% downpayment using stock options that they got from employers. they want to cash out. I feel, if stock market crashes, all that downpayment coming from  stocks might just evaporate and many buyers will not be able to afford at all. Which might reset the housing market.", "score": 0, "replies": []}]}
