{"title": "Just read this article on the wash sale rule and now I'm scared that i am n a similar position Day Trading options. Does the wash sale rule apply to my situation?", "selftext": "Just read this article: [https://www.forbes.com/sites/shaharziv/2021/03/26/robinhood-trader-may-face-800000-tax-bill/](https://www.forbes.com/sites/shaharziv/2021/03/26/robinhood-trader-may-face-800000-tax-bill/) and i am terrified. I've been day trading options since this February. I will often re-enter options for the same company and sometimes sell it for a loss, but then going back into it and selling for a gain. I was up $3000 at one point but i lost most of it and am now down $300 at the moment. Will i still owe taxes on that $3000 i made?\n\n&#x200B;\n\nFor example: Let's  say in February I purchased some TSLA calls and sold them for 1k profit. I then bought some more at a different strike (not sure if this matters) and lost 1.5k. Would the wash sale rule apply and I would still have to pay taxes on the 1k and i'm not allowed to factor in the 1.5k loss?\n\nI am in Canada btw.", "id": "mgxwjq", "created_utc": 1617164145.0, "score": 3, "upvote_ratio": 0.67, "num_comments": 40, "comments": [{"body": "This trader constantly traded the same stock over and over again and owned it going into the next year.. only the gains were tracked and the losses will now be tracked in the next year if ever realized", "score": 6, "replies": [{"body": "He owned it all the way into the following year? So we should sell before end of year to avoid this?", "score": 3, "replies": [{"body": "Yes, preferably in November and then do not do anything with that stock until January", "score": 5, "replies": []}]}]}, {"body": "Yes that would hit wash sale but as long as you exit by EOY and don't reenter for 30 days you'll be fine.", "score": 5, "replies": [{"body": "So if you sell most of it by the end of the year and don’t reenter or buy more, it’s okay? I tend to go in and out of the same stock the same day.", "score": 1, "replies": [{"body": "You don’t want to do this.  After a loss you should not buy that same stock or option until 31 days later.  I made the mistake a few times too.  Now I go to the stock page and check my history before buying or selling anything to make sure if I have a loss I waited.", "score": 2, "replies": [{"body": "Why?", "score": 1, "replies": [{"body": "So I don’t pay more in taxes than I actually made.", "score": 1, "replies": [{"body": "You wouldn't if you incur a wash sale, unless you don't sell it again before you declare your taxes.\n\nWash sale does not negate your losses, it simply defers them.", "score": 1, "replies": []}]}]}]}, {"body": "Yes, although I'd suggest changing 'most' to 'all'. If you need to only do 'most' for some reason, I'd consult with a tax advisor.", "score": 2, "replies": []}, {"body": "There are exceptions to the wash sale rule if you can prove you are a day trader AND show you are in and out of a security for quick micro gains.", "score": 1, "replies": [{"body": ">There are exceptions to the wash sale rule if you can prove you are a day trader AND show you are in and out of a security for quick micro gains.\n\nBut you have to make the proper 475 election with the IRS. If you do not file the proper form, then no bueno. Obviously consult your tax professional about make a proper 475 election.  [https://greentradertax.com/traders-should-consider-section-475-election-by-the-tax-deadline/](https://greentradertax.com/traders-should-consider-section-475-election-by-the-tax-deadline/)", "score": 2, "replies": []}]}]}]}, {"body": "thread tl;dr:\n\nDo not buy or sell for a loss securities during the final 30 days of the year.\n\nExit on black friday, buy some xmas presents and then re-enter in January.\n\nYou can ride the line better if you go and understand the tax rules, but generally they want to keep people using \"\"\"\"\"losses\"\"\"\"\" they got at end of year on their taxes as this can be gamed by poors to avoid tax liabilities and thats not allowed, only the rich are allowed to do that.", "score": 5, "replies": []}, {"body": "Your last sentence is the most important.  You’re in Canada.  So why are you looking and worrying about US tax laws?\nIn Canada add up your sales and subtract your purchases of options.  Claim a capital gain on the profit or a capital loss on the loss.  If you want you can claim it as business income or loss (this lets you write off the losses against employment income).  Don’t do that!  Claim it as capital gain or loss.  If you do this for any length of time you will be better off.", "score": 3, "replies": []}, {"body": "Ouch!!!!!", "score": 2, "replies": []}, {"body": "Commenting to post article about this in a second.  Brb\n\nEdit:\n\nArticle for Canadians\n\nhttps://www.tewealth.com/can-you-owe-800k-tax-on-a-profit-of-45k/", "score": 2, "replies": []}, {"body": "Lotta misinformation going around here. Actually read the article and do some research about washes. Don’t just stop trading and be blindly scared by this, for most it’s no biggie.", "score": 2, "replies": []}, {"body": "Most tax folks, including the form-fillers, consider options to be unique so long as they are a different strike/expiration. Basically the same as trading a different stock.\n\nOtherwise, consider that most brokerages allow you to \"roll\" an option, which is just taking a loss and opening a new position. If this were a wash, they'd probably have an obligation to tell you \"this is the fuck your taxes button.\"\n\nBut I'd get verification from your brokerage and a tax guy to be sure.", "score": 5, "replies": [{"body": "Im pretty sure in the trading application there was a paragraph that said... I understand stocks/options trading and the tax implications... or something like that.", "score": 5, "replies": [{"body": "Right, but that's just trading as a whole because of capital gains and what not. A device that specifically creates wash sales would be an entirely different animal.", "score": 0, "replies": []}]}, {"body": "That's not what this says:\nhttps://www.investopedia.com/terms/s/substantiallyidenticalsecurity.asp", "score": 1, "replies": [{"body": "If I recall from the last time I read that page, it acknowledges that there has been no definition of how \"substantially identical\" applies to options so it's up for interpretation. If's probably fair to err on the conservative side, but in practice they're usually considered unique.", "score": 1, "replies": [{"body": "One of the four bullet points in the article that triggers a wash sale: \"  Acquires a contract or option to buy substantially identical stock or securities, or\"\n\nThat's not terribly ambiguous. To your point though, it's just one definition. Investopedia is not the holy grail. :)", "score": 1, "replies": [{"body": "What that is saying is you can't take a loss on AAPL **shares** and then **buy a long call** on AAPL. Or vice versa. It's to close a loophole where you could use shares and long calls interchangeably to maintain the same effective position and to get around the wash sale rule. That language closes the loophole.", "score": 3, "replies": []}, {"body": "Yeah, the important bit there is that it's quoting the regulation, but it's leaving out an important line:\n\n>For purposes of this section, the term \"stock or securities\" shall ... include contracts or options to acquire or sell stock or securities.\n\nSo while the first bit may lead you to believe that \"substantially identical\" is about the underlying, the final line makes the option itself the subject. It's part of what's made the whole thing ambiguous (acquire an option to buy a substantially identical option?), but in the end, it comes down to how you'll defend it if you get audited by the IRS, because it's up to your own discretion how you identify it.", "score": 2, "replies": [{"body": "oof. thanks for pointing that out. Interesting.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Just don’t file problem solved", "score": 4, "replies": []}, {"body": "We are probably fucked. It’s best to check your 1099 or statements on your platform. It may shed some light.", "score": 1, "replies": []}, {"body": "As long as u sell before end of year it’s fine and you would only be effected if you still owned the same position at end of year and never waited the 30 days", "score": 1, "replies": []}, {"body": "Yes you will not be able to claim the loss if you repurchase same options before or after 30 days. And this wash sale loss rule not only cover the 30 days before or after it has other rules hard to explain. That's why!! try not to sell on red and if you do don't ever get back again at least after 35 or 40 days. And also don't sell if you bought a similar stock or options before 30 days.", "score": 0, "replies": []}, {"body": "I just don’t see how the wash sale rule really hurts you like this, because when you sell at a loss then buy back and gain, the initial loss is added to your cost basis for the gain, so in the end, your gain is counted correctly as if you hadn’t lost then gained. So how is this tax bill right?\n\nExample: buy X stock for $1000, sell at $800 for a $200 loss. Immediately buy back in and sell at $1200 for a $400 gain. My initial $200 loss is added to my new $800 cost basis to make my CB $1000, so in the IRS eyes, my gain ends up being only $200 in the end. Which is correct.", "score": 0, "replies": [{"body": "The problem is that he continued holding positions and creating more wash sales straight through December and in to January. So, he was never able to realize any of his losses. If he had sold all of his positions on December 31st and then waited 30 days to open any new positions, then he could have successfully harvested those losses for 2020 and only paid taxes on the 45k profit. Now he has an 800k tax Bill he can use to offset future profits, assuming that this situation doesn’t cripple him financially and keep him from trading in the future.", "score": 3, "replies": []}]}, {"body": "Not sure about Canada, but you can write off 3 grand of losses a year in America.\n\nEdit: so everyone should at least invest that every year, or they are wasting opportunities.", "score": -2, "replies": [{"body": "IRS prohibits writing off those losses if the stock is rebought within 30 days. Same applies for options if they are similar (IRS' vague wording, not mine)", "score": 2, "replies": [{"body": "Yes, and for US/IRS it’s actually 61 days I think...if you “re-buy” within a window 30 days before through 30 days after you sell for a loss. \n\nI’m not a tax accountant though, so do your own validation/ask your CPA", "score": 0, "replies": [{"body": "That’s true, before and after. Main thing is, if you want to have realized gains by year end, close your position and do not touch that stock for 30 days after closing it.", "score": 1, "replies": []}]}, {"body": "Yeah, I'm just saying his loss to gain ratio isn't really that much according to the post. I don't think his taxes will be impacted that much.\n\nYou're right though.", "score": 1, "replies": []}]}]}, {"body": "https://www.benzinga.com/money/day-trading-taxes/\nhttps://www.magnifymoney.com/blog/investing/day-trading-taxes/", "score": 1, "replies": []}, {"body": "I am looking at my TD 1099 for 2020 and even the positive trades have a W next to them.", "score": 1, "replies": []}, {"body": "Apparently it's called the \"superficial loss\" rule in Canada:\n\nhttps://www.canada.ca/en/revenue-agency/services/tax/individuals/topics/about-your-tax-return/tax-return/completing-a-tax-return/personal-income/line-127-capital-gains/capital-losses-deductions/what-a-superficial-loss.html\n\nLooks pretty much the same as the US rule.\n\n**Assuming it is the same as the US rule** (and you should verify that assumption), you don't have to worry about it. All it means is that the loss is deferred to the cost basis of the disqualifying trade. In other words, you still get the loss deduction. It's just moved from column A to column B in your accounting.\n\nWhere you need to worry is a disqualifying trade that straddles a tax year end, like you take a loss in December and buy a substantially identical asset in January. That means you can't deduct the loss in December and have to wait a whole year to get the benefit of the loss. The reverse can happen also. If you bought an asset in December and sold a substantially identical asset in January for a loss, the loss is washed until the tax year in which the December asset is sold. If you hold that asset for 5 years, you don't get the deduction for 5 years.", "score": 1, "replies": []}]}
{"title": "I built a program that spots buzzing stocks on Reddit. Here are the results.", "selftext": "Hey guys! I’ve built a python script that scrapes Reddit for stocks that are rapidly rising in chatter. **As you can see on my post history, my program picked up EEENF last week at $0.021. It’s now up +100%, trading at $0.045 🚀**\n\nhttps://preview.redd.it/kdfsdd52hdq61.jpg?width=2910&format=pjpg&auto=webp&s=7eb0107ada7734b274c169f195cd35cf52d3c1bb\n\nHere's how to interpret those figures:\n\n* **This graph outlines the stocks that had the biggest rise in chatter over the past 3 days** (March 29 to 31) on Reddit. This increase is shown in %, from 0 to 40 (with RXM reaching a high 32%). Company logos are on the left and their tickers are inside the bars.\n* **The colors represent the sentiment of the conversations around those stocks.** A deep green will indicate some highly positive chatter. A gradient green/orange will mean that the sentiment is mixed. Note: I’ve removed any stocks that had a disproportionate amount of negative sentiment. If that is something you’d like to see included in the future, please let me know.\n\n**🧐Highlights of the Hot Stocks Report**\n\n**💉Progressive Care (RXMD)** has its earnings call scheduled for today, which is likely why r/ pennystocks went crazy on it over the past couple of days. They are a Florida-based healthcare services company currently trading at just 1.8x their 2020 revenue ($68m market cap vs $40.6m revenue).\n\n**🚁The German eVTOL company, Lilium,** announced it will be going public through SPAC, with QELL. Reddit seems mixed about it, with the biggest bear argument being that they don’t have a functional product (fair enough 😁). Joby seems to be ahead of the race for now with its working prototype and test flights. It’s a very exciting space but still at an extremely early stage so be wary of high valuations.\n\n**☀️Ascent Solar Technologies, Inc. (ASTI),** a developer and manufacturer of lightweight and flexible thin-film photovoltaic (PV) solutions announced on Tuesday that the company could receive significant support as part of H.R. 133, the Coronavirus Response and Relief Supplemental Appropriations Act, specifically potential allocation of the Department of Energy (“DOE”) Research and Development (R&D) Funding for the type of innovative, US-made PV technology that Ascent manufactures for the Space, Aerospace, Defense, Disaster Recovery, and Transportation sectors.\n\nLet me know if this useful :)", "id": "mh73tj", "created_utc": 1617200324.0, "score": 56, "upvote_ratio": 0.91, "num_comments": 30, "comments": [{"body": "I just sold 70K shares of EEENF. Took me 6 weeks to figure it out but my buy in was so low I made a super profit.", "score": 7, "replies": [{"body": "You sold today? Wow. There's news coming Sunday, so hate to say it but likely will keep popping at least till EOD tomorrow.", "score": 2, "replies": [{"body": "Took my profit and ran. 😊", "score": 9, "replies": [{"body": "Ain't nothing wrong with that. Enjoy your tendies my man, you've earned it.", "score": 4, "replies": []}]}]}]}, {"body": "Start an email list or text blast list for this. I would be happy to pay.", "score": 6, "replies": [{"body": "I've got a newsletter but it's all free :) https://www.hotstocks.news/", "score": 11, "replies": [{"body": "Nice one, subscribing now. How often do you plan to send out updates?", "score": 5, "replies": []}, {"body": "Do you have a repo? Would like to learn the technical aspect of how the bot works", "score": 4, "replies": []}]}]}, {"body": "NMGRF deserves more chatter", "score": 4, "replies": [{"body": "well you just added 1 mention here 😉", "score": 6, "replies": []}]}, {"body": "How does one get access to this? Well done!", "score": 4, "replies": [{"body": "!remind me 2 weeks", "score": 1, "replies": [{"body": "I will be messaging you in 14 days on [**2021-04-15 11:56:09 UTC**](http://www.wolframalpha.com/input/?i=2021-04-15%2011:56:09%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/StockMarket/comments/mh73tj/i_built_a_program_that_spots_buzzing_stocks_on/gt0syg8/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2Fmh73tj%2Fi_built_a_program_that_spots_buzzing_stocks_on%2Fgt0syg8%2F%5D%0A%0ARemindMe%21%202021-04-15%2011%3A56%3A09%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20mh73tj)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "Hot_Stocks!!! You da man Lucacha.", "score": 5, "replies": []}, {"body": "Well done! this is very useful. I'll be following for more updates.", "score": 3, "replies": []}, {"body": "Great job", "score": 3, "replies": []}, {"body": "IMHO INTC has big upside!", "score": 0, "replies": []}, {"body": "by the time you see the hype and chatter you are getting dumped on lol.", "score": 0, "replies": []}, {"body": "Planning on open sourcing it ?", "score": 1, "replies": [{"body": "Definitely! Still tweaking it for now but will do :) Also, I share all the program's results for free so no worries about them being hidden behind a paywall or anything.", "score": 9, "replies": []}, {"body": "This is the way!", "score": 2, "replies": []}]}, {"body": "This is really cool.\n\nHow does it work? Is it just screening posts/comments for Symbols or is there more to it?", "score": 1, "replies": []}, {"body": "Amazing!", "score": 1, "replies": []}, {"body": "QELL (Lilium) 🚀💰🌙", "score": 1, "replies": []}, {"body": "Quick question about your implementation and what this data shows: Are you searching all of reddit for certain keywords/company ticker symbols? Or, have you limited your search to some subset of stock market related subreddits? \n\nIf the latter, how did you determine which subreddits to search through?", "score": 1, "replies": []}, {"body": "How do you get the company logos and adjust the color curves so the contrast is balanced?", "score": 1, "replies": []}, {"body": "Great program well done. Do you publish this daily or it is a subscription service? Looking forward to seeing your charts into the future. I am new to reddit and live in Australia so I don't have an international broker but hopefully I will see other Australian ASX stocks which are dual listed on here in time. I bought almost 20 Mil 88 Energy shares and sold just over half at great 6 figure profit and free carry the rest till Tuesday's announcement. Well done to those who have ridden the 88 Energy (EEENF) express train.", "score": 1, "replies": []}, {"body": "This is amazing!! Thank you!", "score": 1, "replies": []}, {"body": "Epic tool! Great job", "score": 1, "replies": []}, {"body": "ASTI is literally free money. Just hold for 6-12 months. Of course due your own DD", "score": 1, "replies": []}]}
{"title": "Is apple worth it?", "selftext": "[deleted]", "id": "mhbntb", "created_utc": 1617213172.0, "score": 0, "upvote_ratio": 0.31, "num_comments": 33, "comments": [{"body": "Apple is a great long term hold.", "score": 16, "replies": [{"body": "What do u think about discovery? I’m tempted to buy it but I should of done so in the pre market, right now It doesn’t make sense.", "score": -3, "replies": [{"body": "If you’re talking about DiSCB .... no you should not buy that. It’s being pumped really hard and you are bound to be bag holding of you buy in. Just my opinion", "score": 8, "replies": []}]}]}, {"body": "You held it for a month. That’s not long at all.", "score": 10, "replies": [{"body": "True", "score": 1, "replies": [{"body": "If you don’t have any convictions about them, sell it, otherwise you will always have an itch to sell when things aren’t on the up on up. \n\nI have my convictions about Tesla when they go down 10% or more I still sleep at night, despite what others tell me to think. Never buy stocks cause of what others say without your own conviction behind it, otherwise this will happen. \n\nI have Apple stock. My biggest holding. I bought Apple in combination of my own conviction, research and what others have said. With that I’m holding regardless of every blip.", "score": 3, "replies": []}]}]}, {"body": "I own a few hundred shares of Apple and it’s done nothing but trend downward over the last couple months. Nice up day today, which will hopefully get it going back up again.", "score": 6, "replies": [{"body": "Yes definetly i bought it for 123 and still didn’t get my return but fedex on the other hand is giving me big returns", "score": -3, "replies": []}]}, {"body": "Apple has such a good business model and financials, so I will hold it for a long time.", "score": 4, "replies": []}, {"body": "Last 2 months have been bad for tech impenetrable not just Apple. Long term they are going to be super solid. May buy another  couple shares while it's on sale.", "score": 3, "replies": []}, {"body": "They need something big to push their market cap higher", "score": 2, "replies": [{"body": "iPhone 13 but it’s in fall, so now I’m sitting here thinking should I sell them and buy fedex which seems very reliable lately or should I hold", "score": -1, "replies": [{"body": "I doubt the iPhone will push them to 3 trillion +\n\nUnless the numbers coming out of China/ India are unbelievably amazing", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "Wut?", "score": -1, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "Dude doesn’t matter now much he invested, the subreddit exists to discuss stocks. No one cares how much he has", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "It’s also fine if a/he is a child bro", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": -4, "replies": [{"body": "Dude,  he's got a point.", "score": 1, "replies": []}]}]}]}]}, {"body": "Sold mine today to break even and get my money back because the stock has been stale as of late. I think AAPL will stay at its current range until their next keynote presentation in June. Depending on where its stock is at in May, I may buy it back to get some profits from the pre-keynote pump up.", "score": -4, "replies": [{"body": "When did you first buy it?", "score": 1, "replies": [{"body": "End of last month when I thought it was done dipping, but it wasn't and has been stale since. I can put that $2k to better use day trading in the meantime.", "score": 0, "replies": [{"body": "Apple is not the stock to buy and sell in a month, its a long term hold.\n\nGood luck!", "score": 3, "replies": [{"body": "I know that. Yet I can make more profits using that money now and buy AAPL back if it is still in its current range in May before the June keynote. If it's not still in its current range by May, then at least I made way more profit in the meantime. Everyone invests differently.", "score": 1, "replies": [{"body": "Fair enough!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Overhyped In my opinion", "score": -6, "replies": [{"body": "It recently surpassed Aramco as the most profitable company on earth.", "score": 5, "replies": []}, {"body": "Tell that to the people who invested years ago...", "score": 2, "replies": [{"body": "My point is, the big gains/runs are over and done with. Much better opportunity else-where. I work in automotive and trust me making a car is no simple feat. Their ambitions are too high and money will fly out the window (no pun intended).", "score": -2, "replies": []}]}]}, {"body": "I mean, you’re the only one who can really answer your that question", "score": 1, "replies": []}, {"body": "What were your expected returns and exit strategy before entering the trade?", "score": 1, "replies": []}]}
{"title": "BA - Thoughts on Boeing?", "selftext": "What are your thoughts on Boeing? It seems to be slightly rising but I'm not sure how the reopening plays are going to keep rising. Boeing has risen a little but isn't near ATHs like other reopening plays. However Boeing seems like Chipotle after the ecoli scandal due to the two planes that crashes prior to COVID-19. Took awhile to rebound but it ultimately did. Southwest and Alaskan also just put some orders in so I assume others might follow suit.\n\nThe chart almost looks like a teacup forming.\n\n Thoughts?", "id": "mhfcy3", "created_utc": 1617223709.0, "score": 16, "upvote_ratio": 0.85, "num_comments": 39, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "They’re one of the largest players affecting our GDP for obvious reasons: Planes aren’t cheap. They LIKELY will not have issues with semiconductor shortages (planes are giant computers nowadays) because aviation regulation is so slow, they’ve likely bought a 50 year supply of 2005-era CPU’s for today’s production.This is what they did with the 777 during its production. They bought enough processors to last half a century and the tech was already outdated. \n\nAnother plane crash of significant caliber would likely damage Boeing a lot, but again, I’ve been in aviation for 20+ years and we all know the best time to buy airline stocks is right after a plane crash. Sick but true.\n\nGovernment contracts are the other boon to Boeing. \n\nI will say one thing I do not like about Boeing, and this is from a personal preference standpoint. I’ve worked on the 727, 757, 767, and 777. I’m not impressed by the engineering. I find a general lack of redundancy, poor follow through on design principles, a lack of technical information, and poor quality control on airplanes new from the factory. I don’t expect any of that to be worth anything regarding the stock price, but I feel like Airbus makes a superior product albeit generally more expensive.\n\nEdit: I should note that Boeing still puts out a safe product and I fly on them all the time. I’m just not impressed with their product.", "score": 30, "replies": []}, {"body": "boeing is a long term hold because ask yourself one question, despite their problems who is actually going to replace them? Nobody", "score": 13, "replies": [{"body": "Airbus", "score": 2, "replies": [{"body": "So buy Airbus too", "score": 8, "replies": []}, {"body": "while that is the logical answer to the question they cannot take on all of Boeing's business whilst maintaining their own too", "score": 5, "replies": []}]}]}, {"body": "Used to be run by engineers in Seattle where they make the planes, but now run by idiot finance guys in Chicago who have run the company into the ground. Still, they are responsible for more of our GDP than any other company, so they are literally too big to fail.", "score": 7, "replies": [{"body": "This. I know tons of old school and new school boeing people. They keep saying that it's losing it's innovative spirit and the culture is definitely less driven.", "score": 2, "replies": []}]}, {"body": "I ain't going if it ain't Boeing", "score": 6, "replies": [{"body": "I hold positions in BA but airbus makes a plane I will happily fly on, too.", "score": 3, "replies": []}]}, {"body": "Presuming you're investing, and not trading, I think BA is still a great long play.", "score": 4, "replies": []}, {"body": "Wish I woulda booth 10k when it was at 100 I’ll have to settle for my 3 shares", "score": 2, "replies": []}, {"body": "in my opinion depends on your time horizon.i think the airlines will do well in 2022, seeing a big influx of business travel to make up for large conventions and such that were missed out on.but then come 2023 i see business travel going down well below 2019 levels (i work in corporate finance for a large corporation and this is the consensus when it comes to budgeting travel expense in the future).business travel is really where the airlines make their money, with poor balance sheets and lower high margin volume in a couple years, i see new orders after 2022 dropping or at least not meeting what many expect right now", "score": 2, "replies": []}, {"body": "It's great. Consistently green since I bought it in January. :)", "score": 2, "replies": []}, {"body": "I think they make planes, you?", "score": 1, "replies": []}, {"body": "Why was the market solidly green today but Boeing went down?", "score": 1, "replies": []}, {"body": " I expect BA to do well", "score": 1, "replies": [{"body": "For what reasons?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Apologies, but your post is all speculation, based on how you think this industry works and not how it actually works.  The order book for planes are usually placed 8-10 years in advance (it takes that long to build an aircraft).  This industry is dominated by two and only two OEMs (airbus and Boeing), it is quite literally a duopoly.  Every single plane you’ll ever fly on is one or the other.\n\nIn fact after the two max crashes, Airbus could hardly gain off BA’s misfortune, because they already had orders at full capacity.  And within a year or two more, the public will completely forget about the max crashes that it wouldn’t hurt them in the long term in the least.  \n\nIMO Boeing’s stock will reach its peak within this next year or two.", "score": 15, "replies": []}, {"body": "“They have zero deliverables, plans...”\n\nActually LUV just ordered multiple planes from BA. And they have already “lifted off” no pun intended. \n\nPlease fact check before you post", "score": 4, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Not sure why you said lol. The company is doing great and their stock price is reflecting it. BA doesn’t have any competition. No I’m not invested, and your speculation is invalid.", "score": 4, "replies": []}, {"body": "The MAX isn't grounded anymore lol. Try again.", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "[Airlines are flying them](https://samchui.com/2021/02/15/which-airlines-are-currently-flying-the-boeing-737-max/#.YGVNUyU8LDs)", "score": 0, "replies": []}]}]}]}]}, {"body": "Lol I'm up over 100% on Boeing and it will continue to go up, probably mid 300s by end of year. All that matters right now is putting COVID behind us. When THAT is done they can worry about debt and other factors. \n\nAlso, funny you didn't even touch on their massive decade PLUS backorder of planes lol.", "score": 2, "replies": []}, {"body": "I would agree with you if they actually had some competition. I don’t think most airlines will just stop and make the switch to airbus. There is incentive to buy American. Customers will continue to take Boeing planes. No one is paying more for a plane ticket just to be on an airbus instead of a Boeing.\n\nBut yes, they have fat legal liability sitting on their books now.", "score": 2, "replies": [{"body": "I agree, but you also got to look at the lifecycle of a Boeing plane and the slow path to recovery. Boeing undergoes huge debt coming into each plane they build. \n\nHowever, the improvements on each new plane in recent years is extremely marginal, and their lifecycle is ~20-30 years. \n\nWith travel still low and expected to stay low, it’s a difficult hole to climb out of, especially when airliners already have Boeing and airbus planes and have little reasons to upgrade (only reason to upgrade is due to hitting the 30 year life cycle or their plane usage is so high that the economy of better gas mileage is more beneficial with a MAX plane). The MAX is also almost the same exact tech as the planes they delivered 20-30 years ago. Heavily invested startups are working on making hypersonic and electric planes. Boeing is not, and they don’t have the money to do so. Layoffs are high.\n\nTLDR: Boeing is not an airliner. They are in massive debt. They sell planes. Nobody needs planes, and they won’t for a while. They are only down 18% in share price on the two-year. They are overvalued.", "score": -2, "replies": []}]}, {"body": "Low interest rates debt is nothing. Wait til interest rates go megative. More\nDebt you have the better. Wouldn’t that be fun.", "score": 1, "replies": []}]}, {"body": "Don't think they'll tank anytime soon but much better places out there to put one's money!", "score": 1, "replies": []}, {"body": "I like $SPR in this space. They make parts for Boeing as well as airbus. They’ve had a decent run lately but definitely still have upside in my opinion. This is my exposure to the sector.", "score": 1, "replies": []}, {"body": "I’m long Boeing for sure. It’s down way on it’s pretty covid highs. \n\nLong term it’s a solid business that’s a staple in the us govt defense. \n\n\nIf the us spends more and more on space, and stupid stuff like space marines (won’t be called that but us govt defense will be heavily space oriented) then they will use companies like Boeing to get there. \n\nBoeing has some space contracts with nasa already and I think this is just the beginning. \n\nThey have debt. But interest rates are low enough that debt is nothing these days. \n\nLong Lmt, rtx, ba, hii Stable enough long term holds with dividend.", "score": 1, "replies": []}, {"body": "Plane mfg is a duopoly no? I think their financials are actually pretty good as well and they are poised for recovery. Bad news, semi shortage, inflation all may be some relevant current worries but it's a good value stock.", "score": 1, "replies": []}, {"body": "In medium-long term I think it's a great investment (2-3 years), not so great in short term and I would avoid holding it for more than 3 years. They are one of two big civilian plane manufacturers (other one is airbus), so there is no way US governmemt will allow it to go bankrupt. They also make military equipment and I personaly think drones that fly and work along side fighter pilots are the future, amd boeing is developing one (loyal wingman) so when they start selling it, it's going to be an instant hit.", "score": 1, "replies": []}, {"body": "Well I think buying a cloud computing ETF has generally lower risk, and higher profit potencial.\n\nWhat if the #traveladdict vibe will disappear?", "score": 1, "replies": []}, {"body": "If your thinking of Boeing you should also invest in Spirit Aero Systems! They make the parts and in the 737 case the whole darn fuselage! Not to mention parts for Airbus and Embraer.   I call it a Value double dip.", "score": 1, "replies": []}, {"body": "lol fuck BA,\n\nTrash company. Terrible valuation.", "score": 1, "replies": []}]}
