{"title": "Spaxx (sit in brokerage account) 4.75% interest or risk SCHD 3.80% dividend?", "selftext": "[deleted]", "id": "14g7uiv", "created_utc": 1687450776.0, "score": 34, "upvote_ratio": 0.81, "num_comments": 47, "comments": [{"body": "SPAXX won't always be 4.75%.  Keep an eye on it if you go that route.  I like having my cash in it as well as SCHD as part of my core holdings.", "score": 22, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "If the rate goes down to 3% it means that the market is recovering quickly and you may have already missed gains in equity.", "score": 13, "replies": [{"body": "This is the dagger comment to whatever anyone has to say lol. Enjoy the 4-5% while it lasts, but when everything clears..you will miss some growth with that money and chances are it was greater than whatever was earned in the meantime. \n\nSmart investors will tell you, why not both? Why not more diversified? Have a little cash, have some mm/tbill, grab your ass some SCHD for when the rest of the market rallies, qqqm for some heavy tech focus (kinda high, but why not higher), and some form of VOO or SPLG. Yeah there’s gonna be some overlap, but that’s Team USA right there.", "score": 4, "replies": []}, {"body": "That’s one scenario. We could wake up tomorrow to zero interest rates if the fed breaks the economy.", "score": 2, "replies": []}]}]}]}, {"body": "Keep in mind that you'll want to watch the yield on SPAXX but you can just roll into something else later on.", "score": 8, "replies": []}, {"body": "Yes. I use spaxx basically as a HYSA. It sits in there and if I see a stock that took a real dive I have money on the ready to buy in quick if I want", "score": 5, "replies": []}, {"body": "SPAXX and sell OTM cash secured puts on something you’d hold.\n\nEdit: read as this being a possibility to look into, not as guidance. Don’t mess with options without understanding them mechanically.", "score": 21, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Though I wouldn’t apply the word “safe” to equities, holding VTI and SCHD is a solid choice.", "score": 1, "replies": []}]}, {"body": "I have been doing this on FDRXX as leveraged margin on CBOE's cash settled SPX options.   It was better earlier this year since vol is crushed.", "score": 2, "replies": [{"body": "Next earnings cycle kicks off pretty shortly. Should see a little more then.", "score": 2, "replies": []}]}, {"body": "Does the collateral money used for the CSP still collect interest under SPAXX?", "score": 1, "replies": [{"body": "Yes.", "score": 3, "replies": []}, {"body": "Yup, it’s amazing", "score": 2, "replies": []}]}, {"body": "I've got Schwab, so I use SWVXX.  You have to hold cash there for 30 days for the funds to become marginable for options.  What you are suggesting is a pretty darn good strategy.  Not only do you get the premium from the CSP, but your cash earns 4.7-4.82% while you wait for the expiration date of the call.\n\nIf you do this with SPY, QQQ, XLF or XLE, the worst that can happen is (barring a nuclear holocaust) that you get into a strong ETF at a price you are comfortable with.", "score": 1, "replies": [{"body": "Tbills clear immediately.", "score": 2, "replies": [{"body": "This is the reason I enjoy Reddit!", "score": 2, "replies": [{"body": "I am selling SPY puts against my tbill holdings currently.  About 10 or less delta 45-180 days staggered expirations and my current return is 5% in addition to the Tbill's.  I am thinking of switching my short term bills into 20Y notes that are paying 4% now.  I will confirm with my advisor, but 8-9% on a portion of my investments seems pretty fricken nice during retirement.", "score": 2, "replies": [{"body": "Okay, so you are my hero for the year!!\n\nI'm starting today to do this in apprx 90 day increments until the FED cuts rates.  I'll push my premium amounts into SWVXX and use for quick strike funds in the case that we see a few dips.\n\nThis is absolutely awesome.  I wasn't using my whole brain thinking this through that you could sell puts against funds sitting in T-Bills and time the expiration date on the puts around the maturity dates of the bond.  \n\nReally, thanks for the push in the right direction!", "score": 2, "replies": [{"body": "We should form an ETF with this strategy.", "score": 2, "replies": [{"body": "Agreed:)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Yyyeeepppp.", "score": 1, "replies": []}]}, {"body": "Like SCHD.", "score": 1, "replies": [{"body": "That would be a top choice for me.", "score": 1, "replies": []}]}]}, {"body": "SPAXX, no questions asked.", "score": 8, "replies": []}, {"body": "  I’ll put it this way:  you could do a lot worse.   Maybe some in both ?", "score": 3, "replies": []}, {"body": "It certainly ups the ante in active trading and investments.\n\nI'm now scouring for plays that are better than 5% — or else just keep in MM funds. You can't beat the math. What else can you trade that yields better than 5%? Hard to find.", "score": 3, "replies": []}, {"body": "100% take the risk free rate. The premium just isn’t there to take risk.", "score": 2, "replies": []}, {"body": "I just bought a 1 Year Treasury for better yield than SPAXX, with the assumption (which I had for this year but was wrong) that we will be in a mild recession and by then I can redeem my principal and reinvest in equities at a greater return.", "score": 2, "replies": [{"body": "T bills are currently paying over 5%, can be bought in brokerage accounts, and you don't pay state or local tax on earnings only federal.", "score": 2, "replies": [{"body": "I can't figure out how to buy treasuries on fidelity, but I went through Treasury Direct.", "score": 1, "replies": []}]}]}, {"body": "what if you had your cash in SPAXX, and sold CSPs on SCHD\n\nSPAXX interest ✅ \nSCHD dividend if assigned ✅ \nCSPs premium ✅ \n\nAlthough i wouldn’t recommend selling options with low IV, and especially not on most dividend stocks. But if you’re a long term investor with a long time horizon, DCA and increasing income streams doesnt seem bad if you do it safely with proper risk management", "score": 2, "replies": [{"body": "Yes to this!\n\nAnd, you could also add selling OTM CCs on your SCHD shares to add a fourth income stream!", "score": 1, "replies": []}]}, {"body": "Spaxx for sure. It’s basically risk free (although FDIC doesn’t cover it)\n\nOnce spaxx no longer has that juicy interest, do JEPI", "score": 2, "replies": []}, {"body": "Because they are dumb", "score": 0, "replies": []}, {"body": "Jepi.  Low risk 10%", "score": 0, "replies": []}, {"body": "I have 1 account with a bunch in SPAXX let it sit and deploy when ready nearly 5% is not bad for short term and we just had a big run up so feel like it’s going to drop more over the summer Interest rates still going up", "score": 1, "replies": [{"body": "is this a fidelity account that you have spaxx with?", "score": 1, "replies": []}]}, {"body": "I do both with a ratio depending on market value (lower CAPE, more SCHD) Though instead of spaxx, I lock in the interest via tbill/CD ladders.", "score": 1, "replies": []}, {"body": "Discover saving account 4.15%\nCapital one 4.10%\nAlly 4% \nWhy invest in schd and have a chance of losing principal and only getting  3.80% dividend?", "score": 1, "replies": []}, {"body": "TLTW if you want 12% dividend yield on treasury bonds.", "score": 1, "replies": []}, {"body": "High yield dividend stocks typically don’t grow that much. Really depends on your view of the economy. If we get a soft landing you could see some growth and dividend raises. Recession you will lose a significant percent of your principle and many of those stocks will cut their dividends.", "score": 1, "replies": []}]}
