{"title": "Stop with the weekly calls on GME after a run", "selftext": " This is WSB & no one has time for DD. Let's talk $\n\nSkip the weekly calls. The only thing that seems to be overblown here is the short squeeze play. Guys there is no such thing as a SMALL short squeeze. Please don't mistake every 20%+ run as a squeeze. Please remember that GameStop is trading at a fraction of it's revenue and dare I say a fraction of it's potential so it makes sense that a run to $15 did not trigger a squeeze.\n\nWith that being said even after an incredible bull run the short interest has INCREASED from 136% to 141%. (As of 9/30 update)\n\nI believe GameStop was oversold Friday & Microsoft deal was underappreciated not overblown (Involves multi-year revenue sharing). The media has a way to turn positive news into a negative. Please don't fall for it. My confidence has grown in GME's management after recent STRATEGIC moves as well as their ability to turn the company around.\n\nLook for an entry around $10.50-$12.50 after Friday's sell off.\n\nI am team Reggie, Blurry, Cohen.\n\nPlays: Jan $13 Option Calls, April $15 Option Calls", "id": "j8lzy7", "created_utc": 1602342312.0, "score": 91, "upvote_ratio": 0.92, "num_comments": 89, "comments": [{"body": "I'm doing the same, I was getting the 20 and 30 strikes though.  I should prolly get the 13/15 as well during the dips next week.\n\n&#x200B;\n\nI don't get the hate for GME here, don't yall love huge risk/reward plays?  Listen to my 2 weeks of trading experience:  were in for a constant flow of good news, week after week and at first the shorts will hold, but I don't think for long term they can(I heard someone else say that).  And thats when the stock will pop in price and skyrocket for a day or two?  then settle someplace in between.", "score": 27, "replies": [{"body": "The negative sentiment is bit too much sometimes but it is also the reason why I was able to buy in at bankrupt prices. So I can't complain too much. I do hope the negative sentiment changes over time. Slowly but surely", "score": 5, "replies": [{"body": "40M shortsales on Thursday and Friday alone. Interactive brokers went from over 500k shares to borrow, down to 1k real quick. Rate is up 33%. They used up their ammo - Most of the bullets are already shot. We just have to stay bullish so the price doesn’t drop too far below 11$ otherwise a lot of SS’s will be able to close their positions. \nNow for the squeeze to happen... we need a catalyst. Some very very good news. I’m still optimistic", "score": 16, "replies": [{"body": "One very important thing to remember when looking at daily short volume: it includes algos and daytraders scalping. It is not purely long hold short positions. We don’t know the breakdowns of such. We also don’t know how many of the big shorts are still open. There was a metric fuck ton of volume the last 2 days. \n\nThat said I don’t think the real squeeze has happened yet, short interest is still MASSIVE. \n\nDon’t play it with FD’s because the MM’s will gladly take your money.", "score": 7, "replies": []}, {"body": "Most of the short shares were bought at 7 bucks and have been underwater for the past 2 months.", "score": 1, "replies": []}, {"body": "WTF are you talking about shares are like 2.7c to borrow cheap as hell.", "score": -4, "replies": []}]}]}, {"body": "All things considered the financials support going for long dated plays on this one, and nobody here does any DD at all on TSLA or PRPL (wtf mattress company?) but treat those as amazing plays. Insane. \n\nTSLA made me money too but it’s just gambling, same as what I’m doing with GME but GME has better odds and wsb don’t like that.", "score": 3, "replies": [{"body": "The DD on PRPL was excellent.  The problem with wsb is that people who didn’t do any DD write off good analysis if it doesn’t make 25% OTM calls print the next day.  PRPL has gone up since the DD and will likely show another good quarter.  GME has gone up and is still ticking like a time bomb on the shorts.\n\nEven Lumber Liquidators went up like 400% after everybody gave up on it.", "score": 8, "replies": [{"body": "Fair enough, I didn’t play PRPL or LL because i remember making a promise to myself to only play tech stonks. Don’t really stick to it these days.", "score": 1, "replies": []}, {"body": "stonks go up! just FD's you got to time it perfectly. Thats what WSB is looking for perfectly timed DD", "score": 1, "replies": []}]}]}, {"body": "They aren’t going up any time soon, if they doo it will be slow and over time \n\n\nhttps://www.google.com/amp/s/seekingalpha.com/amp/news/3621264-blockbuster-bull-vs-bear-battle-setting-up-on-gamestop", "score": -6, "replies": [{"body": "Reddit Inc. has banned Seeking Alpha articles because their payout model strongly encourages spam. \n\nTo get around this, please repost your comment/thread with the link removed. \n\nYou may wish to copy and paste the full article if it adds necessary context to your post. If so, please include the link with a space in the domain (e.g. \"seek ingalpha.com/...\")\n\nWe apologize for any inconvenience this may have caused.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}, {"body": "All this article says is that the trend is bullish and the statement is ambiguous.", "score": 2, "replies": []}, {"body": "if anything this is more like the TSLA short squeeze we all experienced recently.", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 23, "replies": [{"body": "[deleted]", "score": 12, "replies": []}, {"body": "I would kill myself", "score": 3, "replies": []}, {"body": "Not while Cohen is doing his thing", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Hope it hits itm Monday", "score": 1, "replies": []}, {"body": "guh for how much?", "score": 1, "replies": [{"body": "$0.53", "score": 1, "replies": [{"body": "not bad its almost itm. diamond handing it or taking profits lol?", "score": 1, "replies": []}]}]}]}, {"body": "$9 cost basis long 600 shares here. I honestly dno what I'm doing, I am thinking of taking profits on Monday because it's just so much opportunity in other sectors like EV and Solar atm, and I have no idea how to time this game stop shit", "score": 11, "replies": [{"body": "Gme just getting started", "score": 10, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Solar is SLV gang all over again. Trust me, I was SLV gang.. Right play but you gotta pick your battle so you don't get burned on your timing. Wait for the pullback on solar", "score": 6, "replies": [{"body": "thats what I am waiting for, god renewables are so hot right now lol", "score": 1, "replies": []}]}]}, {"body": "Sell some calls against your shares. IV is insane on GME might as well take advantage if youre not fully convinced on your position. You can also lower your cost basis more", "score": 1, "replies": []}, {"body": "50% wasn't enough for you? Good lord lol", "score": 1, "replies": []}]}, {"body": "Even of you just play on the Bulls side, GME is the perfect cash cow. If it goes upwards, don’t be greedy an take profits. Wait for a reversal and get in again and repeat $$$", "score": 9, "replies": [{"body": "That's where I'm at.  Cashed out yesterday, about midway through the drop, buy back in Monday, most likely.", "score": 4, "replies": []}, {"body": "Agreed", "score": 1, "replies": []}]}, {"body": "Someone here with 13-16 20NOV calls. Honestly I think that new platforms coming out will kill the shorts, strong good news of pre-orders could do it. Not only does that mean it gives a good ER around December but that GME can last a little bit longer to turn itself around.\n\nFor those I doubted along the way before me, I was blind but now I see.", "score": 9, "replies": [{"body": "I also believe November calls is a strong play. A bit riskier but I wouldn't mind owning a few", "score": 4, "replies": []}]}, {"body": "I’ve been in GME since August and still holding. I remember when I first bought I feared bankruptcy at any minute. That fear is gone I think shorts should fear possible buyouts and consistent news catalysts. Longs should fear Burry or Cohen selling on the run-up though unlikely that would unravel everything. Other than that in the short term the future looks great for longs bad for shorts.", "score": 6, "replies": []}, {"body": "Thats just like your opinion man", "score": 14, "replies": [{"body": "True", "score": 5, "replies": []}, {"body": "This is true, however game stop is sitting on a war chest of cash", "score": 5, "replies": [{"body": "I agree. But if they don't use it properly, then...it's just cash... They have to use that capital properly. I still think mgmt will use it well though. This ain't your spring mobile GME mgmt", "score": 1, "replies": []}]}]}, {"body": "What exactly is to love about gme? HOW does this deal with Microsoft even help their situation?", "score": 4, "replies": [{"body": "I think the key here is revenue sharing. Keep in mind Microsoft closed down their physical stores not too long ago. So Microsoft working through GameStop is big news. A relationship with the company that owns Xbox definitely doesn't hurt", "score": 2, "replies": [{"body": "Both Microsoft and Sony are making big push through digital game sales and cloud gaming. One can't ignore console hardware sales but again there are multiple avenues for physical distribution besides GameStop. So what's the value proposition for GameStop versus Microsoft selling in-house, through Amazon, Target, etc?\n\n Sure, you have some customers who are clueless about gaming and are buying gifts for family/friends, but that's not a considerable TAM (exclusive to GME) either.", "score": 5, "replies": [{"body": "I think the difference between GME and other retailers is that GME is niche focused on gaming. Because of this GME has been able to build a customer data list of millions of gamers through their rewards program. GME will be able to create a customer experience similar to Chewy which is why Cohen's involvement is so important\n\n\" GameStop will standardize the Company’s business operations on Microsoft’s cloud solutions and hardware products to deliver rich new digital experiences to customers, creating the “ultimate gaming destination” for gamers in its vision to be the premier omni-channel customer access point for video game products.\"\n\nAt the end of the day I think we can agree that consoles will sell out on all avenues. I'm willing to bet they will be on eBay for double the price on release date so I think all retailers will benefit from a console refresh", "score": 7, "replies": [{"body": ">GME will be able to create a customer experience similar to Chewy which is why Cohen's involvement is so important\n\nI think this is an interesting statement given that Chewy is an e-commerce model while Gamestop is heavily physical store. \n\nI've never found Gamesto's Rewards program to be a huge value, but then again I don't game much and YMMV.", "score": 1, "replies": [{"body": "GameStop has a physical and online presence. They are currently transitioning to e-commerce. Hence Cohen's 9.98% stake recently\n\nThe customer data list is the real value. Free marketing to millions of gamers which is where Microsoft saw value", "score": 4, "replies": [{"body": ">The customer data list is the real value. Free marketing to millions of gamers which is where Microsoft saw value\n\nThis point is one I find a little doubtful. Yes Gamestop has that list but at the same time Microsoft has its own list of Xbox (and some PC) gamers. It's almost certain that when it comes to Xbox usage Microsoft's own data is a lot more comprehensive than Gamestop's. You could argue that users != buyers, but at the end of the day it's still the end-users who are influencing/driving a lot of the purchasing decisions. \n\nSo if Xbox data is redundant then what else is useful from Gamestop's data? They'd primarily have Nintendo and Sony customer data but IMO those have less value. Microsoft could potentially convert some Nintendo and Sony users to Xbox, but console-loyalists usually stay on their own platform unless they find another console-exclusive really enticing. With cross-platform play and Microsoft's expansion into PC gaming that argument weakens. Microsoft's game studio acquisitions do allow them to pump out more exclusives but I highly doubt Gamestop plays a huge role/synergy with this either. \n\nAt the end of the day I see GME and MSFT as more akin to a Nikola-GM partnership. I don't disagree that Gamestop will benefit from Microsoft's help in modernization and cost-cutting, but I doubt that Gamestop will accomplish a hard pivot solely from it.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": ">My confidence has grown in GME's management after recent STRATEGIC moves as well as their ability to turn the company around.\n\nHow the fuck are they going to buy old games if the new platforms have no disk drive?  Their market is drying up.\n\n$20 Put 10/16", "score": 6, "replies": [{"body": "Are you asking me if ps5 and xbox series x have a disc drive?", "score": 1, "replies": [{"body": "No, I'm asking what do they plan on selling?\n\nWhen all the available gaming consoles from here on out will offer DTC downloads for future content. \n\nThey're a bound bookstore in a world with Amazon and Kindle.", "score": 3, "replies": [{"body": "I don't understand your timeline. If your thesis is 10 years from now why are you buying 10/16 puts. Also, my plays are next year so I'll be out by then\n\nGameStop will generate about 4 billion in revenue this year at the end of a console cycle. Profitability is the issue here which is why GameStop is lowering costs and transferring to e-commerce.\n\nWith ps5 and Xbox series x being backwards compatible GME's main focus is on the next generation of consoles. GameStop will be selling collectables, hardware, used games etc from the refresh. This will give them another 2-5 years to help pivot\n\nNow with a lifeline GameStop will have to add other streams of revenue. They will now have the time and cash to do so. I think they have plans to dive into esports, computer gaming etc. Yes, the world is shifting to digital but I'm willing to bet the next generation of consoles will have disc drives also.", "score": 4, "replies": [{"body": "All the bears saying \"no disc drives\" will probably all end up owning consoles with disc drives lol", "score": 1, "replies": [{"body": "Stadia, fam. \n\nLong $GOOGL forever and ever, amen.", "score": 0, "replies": []}]}, {"body": "I'm short, because that was a pump on a dead stock.  \n\nIt's still dead.  QED", "score": -1, "replies": []}]}]}]}]}, {"body": "I got 10C 10/16 Friday.", "score": 2, "replies": []}, {"body": "Tell that retard that lost 100k.", "score": 2, "replies": []}, {"body": "Or maybe stop playing with this shitty company at all lmaooo 🤣😆😆\n\n.\n \n \n \n \n\n\n\n*I’m bag-holding weeklies*", "score": 6, "replies": [{"body": "Maybe I'll stop playing after the squeeze. I'll give you the opportunity to buy my shares then", "score": 3, "replies": []}]}, {"body": "SMALL, INCREASED, STRATEGIC. \nThat all I read. I don’t get it. More details plz.", "score": 3, "replies": [{"body": "Mistaking 20%+ runs for a short squeeze\n\nincrease in short float \n\nstrategic moves prior to consoles release (increased cash, lowering sg&a, microsoft partnership)", "score": 7, "replies": [{"body": "Got it. I’m all in.", "score": 2, "replies": []}]}]}, {"body": "Dude GME has hedged every other retarded play I've made since the first DD was posted. Can't sleep on this shit", "score": 1, "replies": []}, {"body": "If anyone listens to this you are fucking retarded.  There are so many things in this post that only an idiot of epic proportions would say.", "score": 2, "replies": [{"body": "retarded & rich", "score": 5, "replies": [{"body": "Not being retarded pays pretty well too.\n\nhttps://www.dropbox.com/s/vtvez6kqfipg32i/portfolio.jpg?dl=0", "score": -2, "replies": [{"body": "Great maybe you should use it to short GME since you're so confident", "score": 3, "replies": []}]}]}]}, {"body": "I bought GME at 14.5. Am I fucked?", "score": 1, "replies": [{"body": "Depends on how long you'll hold. I have 1500 shares and I have no plans on selling before April when the first earnings with all the new sales will blow everyone away. $30/share minimum between now and then. Ryan Cohen will fix this.", "score": 6, "replies": []}, {"body": "Shares?", "score": 2, "replies": [{"body": "I never buy shares but on gme it’s been a huge winner. I am willing to let my cash sit in there. I’m out now as of Friday but will jump in at low 11s or mid 10s. They are going to PR this thing to the moon.", "score": 5, "replies": []}, {"body": "Yes", "score": 1, "replies": [{"body": "Just sell covered calls out at $17-18 in weekly or biweekly basis so the premiums from theta lower your cost of entry.", "score": 6, "replies": [{"body": "That's dumb. Shit's gonna open at $11 on monday\n \n\nSmarter would be sell puts at $10, CC's at 13 or 14", "score": 0, "replies": [{"body": "They bought at 14.5 selling cc at 13 is a guarantied loss", "score": 1, "replies": [{"body": "Ok? So what?", "score": 1, "replies": [{"body": "You belong here", "score": 1, "replies": [{"body": "He's already received a loss...the premiums on 50% OTM are hot dogshit lmao", "score": 1, "replies": [{"body": "You belong here", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Risk/reward is still on your side. I am personally aiming for triple digits. Sorry for your short term lost. I think you should wait until next year or after console release before you take a loss on GME shares", "score": 4, "replies": [{"body": "Triple digit share price? I think $30 or $40 is reasonable. I got in at 13.4 so while I am down I plan on holding for the next 6 months.", "score": 1, "replies": [{"body": "If it squeezes triple digits is a walk in the park. Even without the squeeze triple digit is closer then it sounds. Focus on marketcap and not the share price and you'll see what i mean. GameStop has low amount of shares available", "score": 1, "replies": []}]}]}, {"body": "My point is I think you should hold a little longer before making your decision to sell", "score": 2, "replies": [{"body": "Yeah I agree, tbh I bought because of FOMO, but I also think that the short squeeze never really happened, the short volume of this stock is still too much", "score": 3, "replies": []}]}, {"body": "Don’t sell covered calls because when this thing takes off, there’s no telling where it stops and the premium isn’t worth it. Sell put credit spreads if anything. I have 1500 shares and I did sell 3x $20 covered calls for 2023 for like $550/ea premium, but I’m letting the rest ride it out.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Anything people are doing with GME right now is strictly gambling", "score": -6, "replies": [{"body": "I've never entered a casino game with odds quite like GME. I'll take that bet any time of the day", "score": 6, "replies": []}]}, {"body": "I’m loading up on January 2021 puts bitches", "score": -1, "replies": []}, {"body": "Please get some help. GME is crap.", "score": -12, "replies": [{"body": "I actually won't need any help I'm an early bag holder", "score": 6, "replies": []}]}, {"body": "But bro you haven’t heard my ThEorY", "score": -1, "replies": []}]}
{"title": "Tesla calls bought me a tesla...", "selftext": "It was a cold January morning. Tesla was up about 15% in the past few days. I hadn’t bought the stock before, but was intrigued by the business model and being an investing rookie, I felt some FOMO. I bought 2 shares. A few weeks later I sold out at a $400 dollar profit. If only I had known them what I know now... little did I know, that this quick little stock flip would be the beginning of the next chapter of my life.\n\nI repeated the process a few times until the corona dip. At this point I had consistent $ coming in from an ECom business I was running. I put it ALL IN TESLA. The rest of my portfolio has tanked but when Tesla turned around, it brought the whole thing back upwards. I was hooked. Elon had won me over. I was officially a Tesla tard.\n\nThen, in June, I discovered options 😈. I made had a few losses and a few wins. Notably, a Spotify option play that made me around 15k. I made a mistake and sold a call on Tesla right before a run up. It was exercised. Even though I didn’t lose money, I was heartbroken. My position in Tesla was cut in half. \n\nWhile I could just buy back in at a higher price, I decided to make a BIG BET. I was confident on Tesla in the long term and I had about $97,000 in cash in my account from the call being exercised. I went ALL in on a Tesla 9/18 call. The very next day, the stock rifled up giving me a 50k profit on the day.\n\nIf investing into stocks was like cocaine, I had now found crack. And god I loved it. A few more large options plays later, and I decided to give a little bit back to the one responsible for my success. So, at the ripe old age of 18, I decided to buy a Tesla Model 3. Thanks Elon. Check out the vid below if you wanna see... https://youtu.be/Lc-28AwWujg", "id": "j8shnw", "created_utc": 1602364581.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 91, "comments": [{"body": "[deleted]", "score": 156, "replies": [{"body": "This kid is gonna go on to be a money messiah, with his incredible “works 50% of the time, every time” stock picking ability. Puts in him living in that Tesla by 21.  \n\nAnd congrats.", "score": 37, "replies": [{"body": "Bright future", "score": -21, "replies": [{"body": "Hold up... 18 and had $97K sitting in cash? What was your weekly allowance... fuC&$# $2,000 a week? Lol 😂", "score": 1, "replies": []}]}]}, {"body": "fuck him x2", "score": 14, "replies": [{"body": "Thanks bro", "score": -14, "replies": []}]}, {"body": "Fuck this shit. I’m ~~teaching~~telling my kid to trade. Wish him luck.\n\nEdit: my bad", "score": 3, "replies": []}]}, {"body": "fuck you and your youtube bullshit", "score": 65, "replies": [{"body": "Thanks bruddah!", "score": -41, "replies": [{"body": "Why the guck do you wear a backpack while sitting in your car", "score": 12, "replies": [{"body": "I was coming from work", "score": -6, "replies": []}]}]}]}, {"body": "Ban this retard for self promotion", "score": 37, "replies": [{"body": "Harsh 😢", "score": -16, "replies": []}]}, {"body": "Fuck you", "score": 31, "replies": [{"body": "Go with EXROF on the OTC. It's like a NVDIA chip that lets a two engine Tesla get rid of one engine and somehow become more powerful. \n\nTLDR; EXROF is up 1,000% in 6 months.", "score": 1, "replies": []}]}, {"body": "So I just actually watched part of it instead of skimming ... how does a family loan at 3% = you paying for it with your Tsla stock gains?", "score": 28, "replies": [{"body": "Good question, I’m still paying for the Tesla with Tesla stock option money. I chose to get a loan rather than paying for it all in cash for tax reasons as well as so I could reinvest that money. Hope that answers your question.", "score": -22, "replies": []}]}, {"body": "Congrats but those rims are ugly as fuck", "score": 25, "replies": [{"body": "Agreed, those are the ones it comes w tho 😬", "score": -4, "replies": [{"body": "on a different youtube, a tesla owner was able to \"pull off\" the aero hubcaps, and underneath the wheels look pretty good, the aero hubcaps are for efficiency not looks.", "score": 2, "replies": []}, {"body": "They’re hubcaps and come off to show a pretty nice rim.", "score": 2, "replies": []}]}]}, {"body": "So when do you anticipate selling it to pay the taxes on all your short term realized gains?", "score": 17, "replies": [{"body": "Haha, I had enough from the other option plays that I’ll be good.", "score": -3, "replies": [{"body": "Nice, enjoy homie!", "score": 7, "replies": [{"body": "Thank bro!", "score": -3, "replies": []}]}]}]}, {"body": "Privileged enough to start with 70k 😂 You ain’t shit kid", "score": 18, "replies": [{"body": "Lol Till you realize, I made the money I started with.", "score": -6, "replies": [{"body": "Say what you want, you lying to yourself", "score": 18, "replies": [{"body": "Hey he did the dishes for a week straight and took the trash out three whole times, he earned that shit fair and square buddy", "score": 15, "replies": [{"body": "Ah you’re right. My apologies.", "score": 3, "replies": []}, {"body": "E-commerce 🤫", "score": -5, "replies": [{"body": "Go push your shitty YouTube elsewhere, moneyfaggottim", "score": 10, "replies": [{"body": "😂", "score": -3, "replies": []}]}]}]}, {"body": "Whatever you say 👌", "score": -2, "replies": []}]}]}]}, {"body": "Nice, I wish I had 70k to invest with at 18. What color did you end up painting it?", "score": 9, "replies": [{"body": "Got the white one", "score": -9, "replies": [{"body": "Poor, boring, and completely tasteless. Go back to youtube, sir.", "score": 5, "replies": [{"body": "Thanks for watching", "score": -1, "replies": [{"body": "Wouldn't dream of it. Didn't even see the link. Your gay photo and title made it clear you are a vidtard. Enjoy your boring life", "score": 2, "replies": [{"body": "Someone’s salty 😬", "score": -1, "replies": []}]}]}]}]}]}, {"body": "ban for buying the tesla car with a bank loan trying to pay it monthly with tesla calls.", "score": 8, "replies": [{"body": "Not quite", "score": 0, "replies": []}]}, {"body": "Ban", "score": 17, "replies": [{"body": "Damn, why?", "score": -4, "replies": []}]}, {"body": "Lol gratz. I think I was nerd raging in war3 when I was 18", "score": 8, "replies": []}, {"body": "Congra-...fuck you", "score": 8, "replies": [{"body": "Thanks dog", "score": 0, "replies": []}]}, {"body": "This is fake commercial, BAN", "score": 9, "replies": [{"body": "Kinda hard to be a commercial if I’m not selling anything but aight lol", "score": -4, "replies": [{"body": "You are obviously selling your ytube", "score": 9, "replies": [{"body": "I linked it but I’m not selling it haha", "score": -7, "replies": []}]}]}]}, {"body": "Eat a shit covered dildo you tai Lopez wannabe", "score": 9, "replies": [{"body": "That made me laugh", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Nah dude, that’s still impressive. I j got lucky w the options plays!", "score": 5, "replies": []}]}, {"body": "Hope you saved 29% for the feds next year!!!", "score": 4, "replies": [{"body": "Yeeeaaaaahhh I got a CPA and got the savings.", "score": 0, "replies": []}]}, {"body": "congratulations and fuck you", "score": 6, "replies": [{"body": "Thanks dog", "score": 0, "replies": [{"body": "Will you buy me one too 🥺", "score": 1, "replies": [{"body": "I can show you how 👀", "score": 1, "replies": []}]}]}]}, {"body": "Congrats bro and fuck the haters here.\n\nFuck you, too.", "score": 7, "replies": [{"body": "Preciate ya, lots of fucks to go around", "score": 1, "replies": []}]}, {"body": "Wow this pandemic has created all sorts of retarded shit 🤦🏻‍♂️", "score": 6, "replies": []}, {"body": "Model 3 lmfaoooo . You are a trite little twat who thinks he's a big fish.", "score": 7, "replies": [{"body": "🦈🦈🦈", "score": 2, "replies": [{"body": "Homie I just wanna say thanks for all the laughs.\n\nThis thread is so full of jealous fucking 30 y/o’s with less than a grand in their accounts shitting on a kid for racking up some serious guala.\n\nCongrats bro, and fuck you", "score": 3, "replies": [{"body": "Haha Preciate it!", "score": 2, "replies": []}]}]}]}, {"body": "Trade more instead of bragging", "score": 5, "replies": [{"body": "Story time bro", "score": -2, "replies": []}]}, {"body": "Can i get a small donation of 10 mil?", "score": 2, "replies": [{"body": "If I had it", "score": 1, "replies": []}]}, {"body": "Tsla options stressed you out lol that’s a long looking 18yrs ... whispers * you can buy car mats \n\nCongrats though!", "score": 1, "replies": [{"body": "Golddigger detected!", "score": 3, "replies": [{"body": "Care to elaborate how me saying he looks old for 18 makes me a gold digger? Lol 😂 smh clown", "score": 2, "replies": [{"body": "I think he’s talkin bout the girl in the vid", "score": 1, "replies": []}, {"body": "Reaction is admission of guilt! Dig on 💎🤚🚘💍📿👑👠", "score": 1, "replies": [{"body": "I really hope you get laid one day", "score": 3, "replies": [{"body": "Do not try to dig on me 😘", "score": 2, "replies": [{"body": "Keep dreaming 🤡", "score": 3, "replies": []}]}]}]}]}, {"body": "Yeah she is", "score": 1, "replies": []}]}, {"body": "Damn, the beard makes a difference but thanks lol", "score": -1, "replies": [{"body": "You do look a bit younger in the indoor shots .. might have been the lighting", "score": 1, "replies": [{"body": "Possibly, stock options are fucking stressful tho. Especially after reading this sub 😬", "score": 1, "replies": []}]}]}]}, {"body": "Grats ‘tard.", "score": 1, "replies": []}, {"body": "Great job man. I too have made a good chunk timing tesla at the right times. Congrats on cashing out and treating yourself!", "score": 1, "replies": [{"body": "Thanks bro! Preciate the support and congrats on winning the Tesla lotto", "score": 2, "replies": []}, {"body": "he didn't cash out, just took a loan and paid the tesla that way. the money is still tied to the stock", "score": 3, "replies": [{"body": "Not quite. It was options so I did have to cash out.", "score": 1, "replies": []}]}]}, {"body": "You savage", "score": 0, "replies": [{"body": "😈", "score": 0, "replies": []}]}, {"body": "Me too!", "score": 0, "replies": []}, {"body": "Positions or ban. Gtfo", "score": -2, "replies": []}]}
