{"title": "All I can say is BUY! NIO", "selftext": "85% of your accounts are in the gutter right now and I am here to bring you back! Ask your mom, dad, grandma, wife’s boyfriend, sisters husbands girlfriend idc for a lil extra cash! Every option is gonna matter. NIO will begin it’s leap into the next era or the $25 range. Some of you might be saying well it already went up 20% well technically it was at $21 back in August so not much of a true leap just an upgrade from Duetche bank. The facts are NIO destroyed September numbers, opened up their headquarters yesterday, and officially bought part of Didi yesterday as well! Idk how much more good news can come out. We can see a great consolidation the last week as well as today being the lowest volume since June. In order for a bull flag to form the last day typically has the lowest volume followed by a high volume push. Resistance is at 21.75 and a strong one at 22.50 in which if it’s broken your already to late to buy. \nSome catalysts that can also come into play!\n-Goldman Sachs upgrade\n-stimmie\n-2 stimmies \n\nHow much am I in you ask?\n\n200 calls 10/16 $22 strike average\n\nGood luck Autists", "id": "j86hs8", "created_utc": 1602274744.0, "score": 86, "upvote_ratio": 0.9, "num_comments": 97, "comments": [{"body": "If you can't see long term play here with Nio in $25 01/21/2023 for $10.30 then you don't like money. GOing right direction, Chinese will PUMP it and 3 years is a long time. Get them while they cheap", "score": 32, "replies": [{"body": "I like the sound of that.", "score": 1, "replies": []}, {"body": "Damn I got 200 shares I could sell calls over that time to pay for 2 of those hmm...", "score": 1, "replies": []}, {"body": "Damn, that's a smart idea. Good looks", "score": 1, "replies": []}]}, {"body": "You had me at grandma. I’m all in", "score": 46, "replies": [{"body": "He had me at anal which is after grandma.", "score": -6, "replies": []}]}, {"body": "Market’s already closed you retard", "score": 38, "replies": [{"body": "Pumping the algos for AH/pre\n\nICLN $27 4/16/21", "score": 9, "replies": [{"body": "ICLN $25 4/16/21 checking in!", "score": 5, "replies": []}]}, {"body": "This you buy his calls for more next week!", "score": 7, "replies": []}]}, {"body": "So buy Tesla calls... got it!", "score": 22, "replies": []}, {"body": "I agree, It’s been coiling to break out", "score": 11, "replies": [{"body": "It consolidates for a week and everyone one on here is done with it. That’s when you know to go in. Next week I’m feelin it’ll be the most talked about stonk", "score": 11, "replies": []}]}, {"body": "“Priced in” is the most over used dumb fuck words on all these posts. Nothing is  priced in this year mofos", "score": 20, "replies": [{"body": "I know Everyone on here knows the exact market valuation of company based on sales and catalysts lol Thank you for helpin a brother out", "score": 5, "replies": []}]}, {"body": "you son of a bitch, i'm in", "score": 9, "replies": [{"body": "My name?\nIn, all in.", "score": 3, "replies": []}]}, {"body": "I've been holding 17c April 2023's for a month now. *Smiley face*", "score": 6, "replies": []}, {"body": "Already in thag train. Good luck.", "score": 5, "replies": []}, {"body": "NIO has gone from a 2B to a 26B company in 6 months. Can it grow to a 50B company in 2 years. Very likely. I'm gonna wait for a pullback under $20 for entry though once I have some liquidity.", "score": 4, "replies": []}, {"body": "I'm holding shares here, NIO is a long play for me. Will buy more if it dips.", "score": 5, "replies": []}, {"body": "CCP is literally giving money out to people in China to buy NIO cars and drive up sales. How long does that continue? What happens when that stops?", "score": 3, "replies": [{"body": "My play is for next week?? But to enlighten you all these companies are in the beginning of their time of growth. China wants to go full EV by 2060. They can only do that by providing help. Unlike other companies NIOs BaaS system still makes the company money every month. Also NIO is still in the works for building their own factory then the EV6 model can be mass produced unlike now. EV is the future whether you like it or not. The company cannot currently produce enough vehicles for the demand", "score": 5, "replies": [{"body": "Upping production so they becomes profitable is going to be the next big event for the stock.", "score": 3, "replies": []}]}, {"body": "how is that different than TSLA? Most of their revenue came from tax credits..", "score": 5, "replies": [{"body": "It seems that the CCP is putting price limits to exclude higher priced brands than NIO, like TSLA. See this article: https://electrek.co/2020/04/23/chinas-new-ev-subsidies-disqualify-luxury-models-from-tesla-bmw-and-daimler/\n\nIt looks worse for TSLA than NIO in China, and NIO has more competition in the international markets but I don't know enough about the bigger picture globally so that is why I asked.", "score": 2, "replies": [{"body": "Even if they never leave China, it’s a huge market and enough to grow NIO much bigger.", "score": 4, "replies": []}, {"body": "EVs that use the battery swap model still get the subsidies regardless of price, so Nio still gets them... in fact, Nio is currently the only high priced luxury brand that uses the battery swap model so the exception seems to have been tailor made for them.", "score": 1, "replies": []}, {"body": "That story is from April. Tesla Model 3 SR+ is now made almost of all Chinese supply chain and the price was cut to below the subsidy limit. Sales is booming and costs have come down a lot.", "score": 1, "replies": []}]}]}, {"body": "CCP is giving money to people to buy NIO cars? Source?", "score": 1, "replies": [{"body": "They are providing subsidies for EV cars below a certain price, which advantages NIO. Not directly for NIO cars, but specifically cars below prices of Teslas and which use the BAAS model. Look it up.", "score": 1, "replies": [{"body": "...lol that's a TAD different. Every government on this planet provides subsidies in literally every sector to encourage greater domestic economic activity. Your statement is misleading in that it implied direct government compensation to its citizens on condition they use it to purchase NIO vehicles which isn't true at all.  \n\n\nWhat, exactly, is unfair here anyway? China is not banning Tesla or anyone else for that matter attempting to break into the Chinese domestic EV market, either. They just made it clear their subsidies will only apply to companies that produce vehicles costing less than 300,000 yuan ($42,400). NIO is successfully producing popular EVs below that threshold meaning ANY OTHER COMPANY can do the same.   \n\n\nSo ultimately, this boils down to whining the Chinese government is providing added financial benefits to ANY company that can produce an affordable EV and that pooooor Tesla can't keep up by mass-producing something similar? Are we supposed to feel bad that their luxury cars won't get their free money?  \n\n\nSo tired of this NIO bashing bullshit on Reddit by Tesla fanboys.   \n\"Oooooh their financials are horrible!\"  \n\"CCP is helping them cook their books!\"  \n\"Why can't Tesla have access to free money, too??\"  \n\n\nTESLA, not NIO, is bullshit and everyone on this subreddit knows it. When your stock jumps 10% because Elon Musk tweeted his belief in Martian mind-control radiowaves or whatever stupid shit pops into his head then your company is day-traded, pumped up garbage.   \n\n\n$434 per share as of this writing. $434. Anyone on here that truly believes this represents the true value of their share price please DM me your address so I can mail you some glue to snack on.", "score": 3, "replies": [{"body": "Tesla Model 3 SR+ is priced well under the limit... sales are skyrocketing.\n\nNIO P/S is higher than TSLA’s.", "score": 1, "replies": []}]}]}]}]}, {"body": "i have 10/16 25c and it looks ugly", "score": 3, "replies": []}, {"body": "\"NIO??? Bluh that company is a scam!\"  \n\n\n\"Oh? Ok, can you explain why?\"  \n\n\n\"...CCP is evil!\"", "score": 3, "replies": []}, {"body": "Pics or ban", "score": 6, "replies": []}, {"body": "There is no spoon", "score": 2, "replies": []}, {"body": "tesla calls it is", "score": 2, "replies": []}, {"body": "Just got called out at 21 bought at 14.", "score": 2, "replies": []}, {"body": "I have three hundred shares.   Bought at $7.00ish.    I’ve been writing covered calls for the last four months.   I have an adjusted closet base of $2.20 now.   Hope to write some more far OTM and have them negative cost base by EOY.   NIO is the way...", "score": 2, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": "Thanks my guy! I did sell at the low but yes portfolio up big time. Means a lot you comin back to say congrats tho!!", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Thanks my guy!! Yeah I’ll write another post about how I’m gonna play the next wave. Maybe there will be less doubters next time lol", "score": 2, "replies": []}]}]}]}, {"body": "Congrats my man. Get out this morning", "score": 2, "replies": [{"body": "Just exited. Goin down 2k from a 10 cent drop hurts my eyes but yes up big time. NIO FOR THE WIN", "score": 2, "replies": []}]}, {"body": "You’re a fucking prophet", "score": 2, "replies": [{"body": "Lol. Educated guesses my man", "score": 1, "replies": [{"body": "Show profit", "score": 1, "replies": [{"body": "On my profile", "score": 1, "replies": []}]}]}]}, {"body": "Priced in", "score": 5, "replies": [{"body": "How?", "score": 1, "replies": [{"body": "Price increase", "score": 5, "replies": []}, {"body": "Well you see, the price is up because the market knows there’s good news. That’s why it’s “priced in”", "score": 2, "replies": [{"body": "He’s needs a slow explanation", "score": 1, "replies": []}]}]}]}, {"body": "My 30c 1/15/21s are taking a shit in my chest, down 40% still holding", "score": 3, "replies": [{"body": "Ok now I’m in too", "score": 3, "replies": []}, {"body": "you still got 3 months though", "score": 1, "replies": []}, {"body": "Sounds like the makings for a Cleveland Steamer, I’m in!", "score": 1, "replies": []}, {"body": "I got 1/15 25c. Down 21%", "score": 1, "replies": [{"body": "What are your future plans on those chief?", "score": 1, "replies": [{"body": "Might buy more at later exp date.", "score": 2, "replies": []}]}]}]}, {"body": "Chinese scam", "score": 3, "replies": [{"body": "Nkla", "score": 13, "replies": [{"body": "Yeah at least NIO actually has a product and selling it. And owns assets in other companies.", "score": 2, "replies": [{"body": "they say they're selling it. But they aren't.", "score": 1, "replies": []}]}, {"body": "You beat me to it bro", "score": 1, "replies": []}]}, {"body": "Yup", "score": -1, "replies": []}]}, {"body": "I was fingering these calls today, but something told me no, so I will watch from the sidelines and watch the show.", "score": 1, "replies": []}, {"body": "how could 85% of accounts be in the gutter? I’m up 87% ytd", "score": 1, "replies": []}, {"body": "Seems legit.. been bag holding my nio calls 1/21/21", "score": 1, "replies": []}, {"body": "In for 15 calendar spreads\n\nShort 10/16 $24c\n\nLong 1/20/21 $24c", "score": 1, "replies": []}, {"body": "Post screenshot of your position or GTFO", "score": 1, "replies": []}, {"body": "How did your OSTK predictions work out?", "score": 1, "replies": [{"body": "Made a quick play last week and took profit but holding out on a couple more options for the long haul. Are you being sarcastic tho? Haha", "score": 1, "replies": [{"body": "No sarcasm. Genuinely curious. Nio hasn't turned a profit yet so it seems pretty risky", "score": 1, "replies": []}]}]}, {"body": "My Guy !", "score": 1, "replies": [{"body": ":) block all the doubters out lol", "score": 3, "replies": [{"body": "I sold when it was up 15%. It's at 22% right now lol. All good", "score": 2, "replies": []}, {"body": "Do you think it’s gonna open green again tomorrow?", "score": 1, "replies": [{"body": "Hi Republic. So in my experience when a whole sector rises usually the uptrend can last 2-3 days like we saw with Draftkings and PENN. Usually if 1 stock in a certain sector rises alone then a sell off will proceed following day. Also the price target was for March so that also comes into play. My educated guess would be it touches 30$ tomorrow morning and then consolidates the rest of the day and next week. Hope this helps. Good luck", "score": 2, "replies": [{"body": "Thanks! And it does. Good luck to you too 💯", "score": 1, "replies": []}]}]}]}]}, {"body": "[Just paid my electric bill win NIO gaaainnnssss](https://ibb.co/DfJvjL8)", "score": 1, "replies": []}, {"body": "We get it you bought calls that aren’t printing and you want us to pump them up. HOW BOUT NOOO SCOTT?\n\nThe numbers have been released for weeks, the upgrades have been out for weeks. This thing will trade sideways between 20-22 for a few more weeks at least until possibly breaking out to its next plateau.", "score": 1, "replies": [{"body": "Lol didn’t age well", "score": 1, "replies": []}]}, {"body": "Proof mate", "score": 1, "replies": []}, {"body": "Priced in untill another catalist. Will be stuck 20 22ish untill then.", "score": 1, "replies": [{"body": "If your right you can see my loss porn next week", "score": 3, "replies": [{"body": "Hey how did you make out ???", "score": 1, "replies": [{"body": "50k profit", "score": 2, "replies": [{"body": "Nice", "score": 1, "replies": []}]}]}]}, {"body": "European import numbers", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -8, "replies": [{"body": "its almost like you hate profit", "score": 2, "replies": [{"body": "I don’t hate them they’re just allergic to me", "score": 1, "replies": []}, {"body": "Only crappy companies with suspect future!!", "score": 0, "replies": [{"body": "No risk no reward and NIO has made plenty of gains over past couple months man", "score": 1, "replies": []}]}]}]}]}
