{"title": "[SERIOUS] What companies do you think are undervalued and why?", "selftext": "O&G rally ended in 2018. Now we have the tech rally. Will the trend still continue in the future? MSFT, AMZN, AAPL, TSLA won't be going up forever right? But it seems to me that investing in these companies is a no-brainer. It is as easy as investing in an index fund. So, in your opinion, what would be the best risky plays (mostly long-term - the old buy and hold until the recovery)?", "id": "j50k4u", "created_utc": 1601824633.0, "score": 42, "upvote_ratio": 0.87, "num_comments": 95, "comments": [{"body": "RTX. They’re getting stupid big contracts with no end in sight.", "score": 8, "replies": []}, {"body": "SQ, in both their seller ecosystem and cash app ecosystem they have an incredible ability leveraging software to drive margins that has never been seen in the fintech/banking industry. Great examples of this are their ability to loan small amounts of money ~$10k to small businesses PROFITABILITY, banks have an average business loan size of ~$1M because they can’t offer smaller loans profitably. The other example is the amount of money spent to get a customer to make an account and use their services, Square wins vs the Big Banks here too, I don’t remember the exacts stats but I can find them later. These are some pretty clear example of how disruptive SQ is in their ability to leverage software to do things cheaper/more profitably than existing entities. Big things are in the pipeline for them as well.\n\nEdit: Also ARK just posted a valuation model and 2025 price target, very good read on their long term potential. https://ark-invest.com/analyst-research/square-valuation/", "score": 26, "replies": []}, {"body": "NET & SQ", "score": 39, "replies": [{"body": "NET seems like a home run long-term to me", "score": 21, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "How do you see them bringing in revenue, and ultimately income? They are carrying quite a bit of debt that is growing. We use their services, and they are solid, just unsure where the growth in revenue comes from. Genuine question.", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "How does NET compare to FSLY? I've noticed that as a stock, NET has relatively lower volume and its rallies are pretty muted even on market green days.", "score": 2, "replies": []}, {"body": "Over what time frame do you see them really ramping up? 5 years? I have a feeling they might get acquired before it happens.", "score": 1, "replies": []}]}]}, {"body": "Wouldn't say easily, depends on how Market reacts after the election", "score": 2, "replies": []}]}]}, {"body": "By what metrics do you consider these undervalued?", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Nothing against NET, and I do agree they are far from undervalued right now.  I think WCLD is a good choice too.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You should also look at LLNW.", "score": 0, "replies": [{"body": "LLNW is a legacy provider, growing at a very slow rate compared to its competition.", "score": 2, "replies": [{"body": "Its competition is severely overvalued and isn’t growing that much faster... LLNW’s forward p/e is 44 while, for instance, FSLY’s forward p/e is 2200.  Comparing price/sales is also pretty eye opening.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Data.", "score": 0, "replies": []}]}, {"body": "Undervalued? NET is overvalued.", "score": 4, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "cool ?", "score": 4, "replies": []}, {"body": "Comenting to read reply.", "score": -2, "replies": []}, {"body": "NET went up throughout all of September.", "score": -2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Homegrown weed.", "score": 4, "replies": []}]}]}]}]}, {"body": "As of right now? I think HYLN is a great EV stock buy. It's a SPAC that literally just \"IPO'd\" on Friday into one of the worst market opens in a while (with the covid news), so it's down a bit at $40.This makes it even more of a steal.\n\n Wholeheartedly believe it will be in the triple digits before year's end, and is a great long term hold. Their CEO will be ringing the NYSE bell tomorrow morning, and he also has a presentation on Fox at 3pm EST, so I think word will get out fast.\n\n[You can read about it here](https://www.reddit.com/r/stocks/comments/j3ydgg/electric_truck_player_hyln_ipo_and_dd/?utm_medium=android_app&utm_source=share)", "score": 70, "replies": [{"body": "[deleted]", "score": 25, "replies": [{"body": "Probably because for the last week a small group have been pushing HYLN hard here, although I’m yet to see anyone actually make a case against them. They’ve been getting a lot of good PR certainly, and it does sound like a reasonable answer to this post", "score": 25, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Why is it a steal at 40?", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "It was on a downtrend before the Trump stuff happened but it definitely didn't help.  I'm just trying to be impartial on a stock that I own.  I think it's fairly valued as a speculative stock without much revenue yet.", "score": 6, "replies": []}]}]}]}, {"body": "I'm in HYLN but have seen the cases against them; mostly being they haven't had mass production yet and competition.", "score": 2, "replies": [{"body": "The other thing is they aren’t selling the $60k truck, they’re a supplier.", "score": 1, "replies": []}]}]}, {"body": "Yea, and I think he's right.", "score": 5, "replies": []}, {"body": "its up 26 pts, relax", "score": 0, "replies": []}]}]}, {"body": "Sea limited", "score": 5, "replies": []}, {"body": "People saying SQ is undervalued, lol.", "score": 30, "replies": [{"body": "I know right? Everyone at ARK is sooo stupid. Terrible track record. Wait, remind me what you do for a living again??", "score": -6, "replies": [{"body": "It can be a good stock and overvalued.  Just cause the ARK team has it in their funds doesn't mean it's not overvalued.  Is Tesla undervalued?", "score": 16, "replies": [{"body": "How we doin today? Lol", "score": 1, "replies": [{"body": "Damn dude, it proves you're right.  Genius.", "score": 1, "replies": [{"body": "Just peanuts compared to the 90% I’m up since June. Have a great day!", "score": 0, "replies": [{"body": "Nobody cares", "score": 0, "replies": [{"body": "Lol you’re big mad", "score": -1, "replies": [{"body": "Says the dude who comes into a thread a day later to make replies that don't even prove a point.", "score": -1, "replies": [{"body": "Don’t forget to take your blood pressure medicine. Don’t want anything bad to happen to you while youre this mad.", "score": -1, "replies": [{"body": "You're*", "score": 0, "replies": [{"body": "I’ll take some grammar lessons with all my SQ gains. Gotta spend all this cash on something, right?\n\nAlso youre* isn’t even correct. Nice try though. Good to see you’re worse at grammar than you are at picking stocks.", "score": -1, "replies": [{"body": "Maybe take some lessons about how not to get butthurt over downvotes too :)", "score": 2, "replies": [{"body": "You’re = You are\nYour = shows possession \n\nYou’re dumb. Lol tries to correct my grammar, is wrong, and then disappears lol. What a clown.", "score": 0, "replies": [{"body": "Try reading the end of that sentence, Mr. Genius.  There you will notice your mistake.  Glad we had this lesson.", "score": 0, "replies": [{"body": "Have any more suggestions on what I should spend all my SQ gains on?", "score": 1, "replies": [{"body": "Whatever helps you not be salty about a day old thread to the point where you keep editing comments.   It's sad.  Have a good one, kid.", "score": 0, "replies": [{"body": "You may want to learn to read a little better. Might help you pick stocks in the future little guy. Just lmk if you need some tips! I’m always happy to help the less fortunate.", "score": 1, "replies": []}]}]}, {"body": "Lol sure bud whatever you say lol", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Wow, talk about talking in absolutes....", "score": 5, "replies": [{"body": "SQ terrible. Look at the huge sel..... oh wait.....", "score": -1, "replies": []}]}, {"body": "ARK actually sold sq by 12mils week ago...", "score": 1, "replies": []}]}]}, {"body": "TTD, will be 1k/share", "score": 4, "replies": [{"body": "Why?", "score": 1, "replies": [{"body": "They can't predict what it will be with certainty. That said, I bought it inay at $270/share and it's currently at $556/share. Wishing I'd bought more, of course.", "score": 1, "replies": []}]}, {"body": "Agreed. I work in the industry and TTD absolutely dominates when it comes to Smart TV and audio advertising (which are both continuing to grow). I can totally see it hitting $1k/share real soon.", "score": 1, "replies": []}]}, {"body": "RTX for sure. Should be in the $100's when corona slows down.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Yeah. Bank stocks seem to be undervalued rn. I think people are scared of them because of what happened in 08. However people forget that the rules changed and now the banks have much more cash on hand than they did before so it’s unlikely there will be a repeat of 08. People are scared though.", "score": 9, "replies": [{"body": "Don’t forget the FED announced interested rates will be kept to 0 for next years", "score": 8, "replies": [{"body": "Banks have proven they can be rapaciously profitably at low NIMs.  So that negative assumption about NIM might be countered, or perhaps more than countered, by the equity and credit inflation effects of zero interest rate policy.  \n\nThe big risk however, as I've stated previously, is that if we've permanently destroyed half our small business engine, what does that do to the economy and thus to banking?", "score": 2, "replies": []}]}, {"body": "People like me are waiting to move in to those because of the interest rate situation and it staying low for a few years", "score": 1, "replies": []}, {"body": "Everyone knows that, but the worry is that deep reserves are for recessional blips, not for apocalyptic job destruction and home equity immolation and the extermination of a huge chunk of all small businesses.  \n\nI have some large bank positions, but I am congnizant of the risk stated above.", "score": 1, "replies": []}]}, {"body": "no", "score": -1, "replies": []}]}, {"body": "BRK.B hasn’t gone up in 3 years, AAPL (45% of BRK.B‘s holdings) has gone up almost 200% in that time. The rest of BRK.B’s holding are not that bad to justify that, plus if you want some good investments in the event of a  bear market it’s not a bad choice.", "score": 3, "replies": [{"body": "Agreed. I hold BRB more as a safety net than for growth.", "score": 3, "replies": [{"body": "Same, it is for me a safe investment, which helps me to justify some more risky investments.", "score": 1, "replies": []}]}]}, {"body": "ASML = Fuck City", "score": 3, "replies": []}, {"body": "RKT. Highly profitable. Absolute marketing beast. Aggressively pursuing partnerships in the industry. \n\nThe one knock against them is that they are interest rate dependent. However,  this is always the case in housing and always will be. Quicken/Rocket been around since 1985 and just continue to grow. Long term I think its a solid buy.", "score": 3, "replies": []}, {"body": "$WMT gang, where ya at?", "score": 3, "replies": []}, {"body": "SBE, WMT", "score": 8, "replies": [{"body": "Why WMT?", "score": 3, "replies": [{"body": "It wants to be an e-commerce/tech company", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "> TWLO \nEven at these valuations?", "score": 5, "replies": []}]}, {"body": "I believe LMT is undervalued for sure. Current tech trends are ignoring that sector of the market.", "score": 2, "replies": []}, {"body": "AMD coming for everyone", "score": 3, "replies": []}, {"body": "Have my eye on EPD, ACI, AP-UN", "score": 1, "replies": []}, {"body": "DFS. Look at its chart.", "score": 1, "replies": []}, {"body": "STP", "score": 1, "replies": []}, {"body": "Wmt \nAnd \nSnv", "score": 1, "replies": []}, {"body": "PDX. CK3 sales will be a huge booster for their next earnings.", "score": 1, "replies": []}, {"body": "FTNT and KC.", "score": 1, "replies": []}, {"body": "None. The current prices are what the stocks are currently worth. The market is very efficient. When there is a hole in the sea, water rushes in. There are stocks that will gain value, but right now they are priced exactly as people believe they should be.", "score": 1, "replies": []}, {"body": "Oil stocks", "score": 0, "replies": []}, {"body": "Sq is obvious, but EXPI is one I really have my eye on. It’s been on a year and as cloud continues to steal marketshare from legacy systems, expi will probably continue on this exponential growth curve for at least a few years til a real bubble forms. It’s a tiny company ($2B marketcap), so it’s got plenty of easy room to grow ahead and no one even knows about it yet. Bright future for EXPI", "score": 1, "replies": [{"body": "SQ is obvious? Lol what???", "score": -1, "replies": [{"body": "Expi is what I was recommending. Sq is just a obvious hold regardless of whether it’s undervalued anymore or not. Even if sq us appropriately valued today it will still continue crushing it", "score": 1, "replies": []}]}]}, {"body": "I bought the dip on $SNE (Sony) on Friday. Got 50 shares at $74, which I thought was a steal.\n\nA price of $74 puts Sony at a valuation of around $94 billion, which is maddening in my eyes considering the fact that: (I will be converting some values to USD from Yen)\n\n1) As of last earnings they had cash equivalents at 15 billion.\n\n2) As of last earnings they had roughly 20 billion in gross revenue, with 2 billion net income.\n\n3) Are involved in 6 industries of which most (Games Publishing, Music, Camera Lenses, Electronics Manufacturing, Financial Services) have strong guidance to grow in the next quarters (even more so due to COVID).\n\n4) PS5 has seen strong hype and is expected to perform well, so this can't hurt.\n\nIt's already up 1.71% in Japan since my purchase on Friday. Planning to hold for a few years, but it's crazy to think that a company like Zoom, a video calling company, is 1.5x times more valuable than a titan like Sony...", "score": 1, "replies": []}, {"body": "Ford? New CEO and revamping the product line?", "score": -4, "replies": [{"body": "I agree. The Bronco could be very profitable for them.", "score": 1, "replies": []}]}, {"body": "I’m gonna toss one out that nobody will mention. Neurocrine Bioscience. I own this one and I think it’s undervalued right now because it has a great pipeline of drugs and just released a medicine to help fight Parkinson’s. Also it’s going for a price to sales ratio under 11.", "score": 0, "replies": [{"body": "Experimental pharma for brain diseases have such a low success rate.  When there is one that has a success for things like Parkinson's or Alzheimer's, it will be explosive.  But like I say, so many never pan out and it's so expensive to get to point of failing that it's almost like a lottery ticket.", "score": 4, "replies": []}]}, {"body": "I'm suspecting that WMT and GOOGL are both undervalued. \n\nWmt is gaining ecommerce market share and i see them continuing to chip at amzn.  They also have a large investment in JD which is Chinese ecommerce that's been booming as a stock. \n\nGOOGL has so many promising potential projects with self driving cars, AI, google cloud growth, but also health care and insurance etc that I think a 32 PE is actually insanely low.  Also they have their monster ad business which has yet to fully recover, so theres growth potential just from that.  Antitrust accusations are weighing on them i feel, but the downside is overstated.   Googl will just be fined or broken up into smaller successful businesses.", "score": 0, "replies": []}, {"body": "I think Tesla is super undervalued if you are investing long term 5~10 years from now.\nFAANG is priced fairly imo, only Netflix a bit overvalued.", "score": -7, "replies": []}, {"body": "Watch [this](https://youtu.be/foqswJT3Spc) kid", "score": -4, "replies": []}, {"body": "$LRN (K12) really really undervalued...", "score": -4, "replies": []}]}
{"title": "Tendiegenerator.java", "selftext": "    import java.util.ArrayList;\n    public class invest\n    {\n        public static void main(String args[])\n        {\n            ArrayList<String> stocks = new ArrayList<>();\n            \n    \tstocks.add(\"MMM\");\t\n    stocks.add(\"ABT\");\t\n    stocks.add(\"ABBV\");\t\n    stocks.add(\"ABMD\");\t\n    stocks.add(\"ACN\");\t\n    stocks.add(\"ATVI\");\t\n    stocks.add(\"ADBE\");\t\n    stocks.add(\"AAP\");\t\n    stocks.add(\"AMD\");\t\n    stocks.add(\"AFL\");\t\n    stocks.add(\"A\");\t\n    stocks.add(\"APD\");\t\n    stocks.add(\"AKAM\");\t\n    stocks.add(\"ALK\");\t\n    stocks.add(\"ALB\");\t\n    stocks.add(\"ARE\");\t\n    stocks.add(\"ALXN\");\t\n    stocks.add(\"ALGN\");\t\n    stocks.add(\"ALLE\");\t\n    stocks.add(\"LNT\");\t\n    stocks.add(\"GOOG\");\t\n    stocks.add(\"GOOGL\");\t\n    stocks.add(\"MO\");\t\n    stocks.add(\"AMZN\");\t\n    stocks.add(\"AMCR\");\t\n    stocks.add(\"AEE\");\t\n    stocks.add(\"AAL\");\t\n    stocks.add(\"AEP\");\t\n    stocks.add(\"AXP\");\t\n    stocks.add(\"AIG\");\t\n    stocks.add(\"AMT\");\t\n    stocks.add(\"AWK\");\t\n    stocks.add(\"AMP\");\t\n    stocks.add(\"ABC\");\n    stocks.add(\"AME\");\n    stocks.add(\"AMGN\");\t\n    stocks.add(\"APH\");\t\n    stocks.add(\"ADI\");\t\n    stocks.add(\"ANSS\");\t\n    stocks.add(\"ANTM\");\t\n    stocks.add(\"AON\");\t\n    stocks.add(\"AOS\");\t\n    stocks.add(\"APA\");\t\n    stocks.add(\"AIV\");\t\n    stocks.add(\"AAPL\");\t\n    stocks.add(\"AMAT\");\t\n    stocks.add(\"APTV\");\t\n    stocks.add(\"ADM\");\t\n    stocks.add(\"ANET\");\t\n    stocks.add(\"AJG\");\t\n    stocks.add(\"AIZ\");\t\n    stocks.add(\"ATO\");\t\n    stocks.add(\"T\");\t\n    stocks.add(\"ADSK\");\t\n    stocks.add(\"ADP\");\t\n    stocks.add(\"AZO\");\t\n    stocks.add(\"AVB\");\t\n    stocks.add(\"AVY\");\t\n    stocks.add(\"BKR\");\t\n    stocks.add(\"BLL\");\t\n    stocks.add(\"BAC\");\t\n    stocks.add(\"BAX\");\t\n    stocks.add(\"BDX\");\t\n    stocks.add(\"BRK.B\");\t\n    stocks.add(\"BBY\");\t\n    stocks.add(\"BIIB\");\t\n    stocks.add(\"BIO\");\t\n    stocks.add(\"BLK\");\t\n    stocks.add(\"BKNG\");\t\n    stocks.add(\"BWA\");\t\n    stocks.add(\"BXP\");\t\n    stocks.add(\"BSX\");\t\n    stocks.add(\"BMY\");\t\n    stocks.add(\"AVGO\");\t\n    stocks.add(\"BR\");\t\n    stocks.add(\"BR.B\");\t\n    stocks.add(\"COG\");\t\n    stocks.add(\"CDNS\");\t\n    stocks.add(\"CPB\");\t\n    stocks.add(\"COF\");\t\n    stocks.add(\"CAH\");\t\n    stocks.add(\"KMX\");\t\n    stocks.add(\"CCL\");\t\n    stocks.add(\"CARR\");\t\n    stocks.add(\"CAT\");\t\n    stocks.add(\"CBOE\");\t\n    stocks.add(\"CBRE\");\t\n    stocks.add(\"CDW\");\t\n    stocks.add(\"CE\");\t\n    stocks.add(\"CNC\");\t\n    stocks.add(\"CNP\");\t\n    stocks.add(\"LUMN\");\t\n    stocks.add(\"CERN\");\t\n    stocks.add(\"CF\");\t\n    stocks.add(\"CHTR\");\t\n    stocks.add(\"CVX\");\t\n    stocks.add(\"CMG\");\t\n    stocks.add(\"CHRW\");\t\n    stocks.add(\"CB\");\t\n    stocks.add(\"CHD\");\t\n    stocks.add(\"CI\");\t\n    stocks.add(\"CINF\");\t\n    stocks.add(\"CTAS\");\t\n    stocks.add(\"CSCO\");\t\n    stocks.add(\"C\");\t\n    stocks.add(\"CFG\");\t\n    stocks.add(\"CTXS\");\t\n    stocks.add(\"CME\");\t\n    stocks.add(\"CMS\");\t\n    stocks.add(\"CTSH\");\t\n    stocks.add(\"CL\");\t\n    stocks.add(\"CMCSA\");\t\n    stocks.add(\"CMA\");\t\n    stocks.add(\"CAG\");\t\n    stocks.add(\"CXO\");\t\n    stocks.add(\"COP\");\t\n    stocks.add(\"ED\");\t\n    stocks.add(\"STZ\");\t\n    stocks.add(\"CPRT\");\t\n    stocks.add(\"GLW\");\t\n    stocks.add(\"CTVA\");\t\n    stocks.add(\"COST\");\t\n    stocks.add(\"COTY\");\t\n    stocks.add(\"CCI\");\t\n    stocks.add(\"CSX\");\t\n    stocks.add(\"CMI\");\t\n    stocks.add(\"CVS\");\t\n    stocks.add(\"DHR\");\t\n    stocks.add(\"DRI\");\t\n    stocks.add(\"DVA\");\t\n    stocks.add(\"DE\");\t\n    stocks.add(\"DAL\");\t\n    stocks.add(\"XRAY\");\t\n    stocks.add(\"DVN\");\t\n    stocks.add(\"DXCM\");\t\n    stocks.add(\"FANG\");\t\n    stocks.add(\"DLR\");\t\n    stocks.add(\"DFS\");\t\n    stocks.add(\"DISCA\");\t\n    stocks.add(\"DISCK\");\t\n    stocks.add(\"DISH\");\t\n    stocks.add(\"DG\");\t\n    stocks.add(\"DLTR\");\t\n    stocks.add(\"D\");\t\n    stocks.add(\"DPZ\");\t\n    stocks.add(\"DOV\");\t\n    stocks.add(\"DOW\");\t\n    stocks.add(\"DHI\");\t\n    stocks.add(\"DTE\");\t\n    stocks.add(\"DUK\");\t\n    stocks.add(\"DRE\");\t\n    stocks.add(\"DD\");\t\n    stocks.add(\"DXC\");\t\n    stocks.add(\"EMN\");\t\n    stocks.add(\"ETN\");\t\n    stocks.add(\"EBAY\");\t\n    stocks.add(\"ECL\");\t\n    stocks.add(\"EIX\");\t\n    stocks.add(\"EW\");\t\n    stocks.add(\"EA\");\t\n    stocks.add(\"LLY\");\t\n    stocks.add(\"EMR\");\t\n    stocks.add(\"ETR\");\t\n    stocks.add(\"EOG\");\t\n    stocks.add(\"EFX\");\t\n    stocks.add(\"EQIX\");\t\n    stocks.add(\"EQR\");\t\n    stocks.add(\"ESS\");\t\n    stocks.add(\"ETFC\");\t\n    stocks.add(\"RE\");\t\n    stocks.add(\"EVRG\");\t\n    stocks.add(\"ES\");\t\n    stocks.add(\"EXC\");\t\n    stocks.add(\"EXPE\");\t\n    stocks.add(\"EXPD\");\t\n    stocks.add(\"EXR\");\t\n    stocks.add(\"XOM\");\t\n    stocks.add(\"FFIV\");\t\n    stocks.add(\"FB\");\t\n    stocks.add(\"FAST\");\t\n    stocks.add(\"FRT\");\t\n    stocks.add(\"FDX\");\t\n    stocks.add(\"FIS\");\n    stocks.add(\"FITB\");\t\n    stocks.add(\"FE\");\t\n    stocks.add(\"FRC\");\t\n    stocks.add(\"FISV\");\t\n    stocks.add(\"FLT\");\t\n    stocks.add(\"FLIR\");\t\n    stocks.add(\"FLS\");\t\n    stocks.add(\"FMS\");\t\n    stocks.add(\"F\");\t\n    stocks.add(\"FTNT\");\t\n    stocks.add(\"FTV\");\t\n    stocks.add(\"FBHS\");\t\n    stocks.add(\"FOXA\");\t\n    stocks.add(\"FOX\");\t\n    stocks.add(\"BEN\");\t\n    stocks.add(\"FCX\");\t\n    stocks.add(\"GRMN\");\t\n    stocks.add(\"IT\");\t\n    stocks.add(\"GD\");\t\n    stocks.add(\"GE\");\t\n    stocks.add(\"GIS\");\t\n    stocks.add(\"GM\");\t\n    stocks.add(\"GPC\");\t\n    stocks.add(\"GILD\");\t\n    stocks.add(\"GPN\");\t\n    stocks.add(\"GL\");\t\n    stocks.add(\"SCHW\");\t\n    stocks.add(\"CLX\");\t\n    stocks.add(\"KO\");\t\n    stocks.add(\"COO\");\t\n    stocks.add(\"EL\");\t\n    stocks.add(\"GPS\");\t\n    stocks.add(\"GS\");\t\n    stocks.add(\"HIG\");\t\n    stocks.add(\"HSY\");\t\n    stocks.add(\"HD\");\t\n    stocks.add(\"IPG\");\t\n    stocks.add(\"SJM\");\t\n    stocks.add(\"KHC\");\t\n    stocks.add(\"KR\");\t\n    stocks.add(\"MOS\");\t\n    stocks.add(\"PNC\");\t\n    stocks.add(\"PG\");\t\n    stocks.add(\"PGR\");\t\n    stocks.add(\"TMO\");\t\n    stocks.add(\"SHW\");\t\n    stocks.add(\"SO\");\t\n    stocks.add(\"TJX\");\t\n    stocks.add(\"TRV\");\t\n    stocks.add(\"DIS\");\t\n    stocks.add(\"WU\");\t\n    stocks.add(\"WMB\");\t\n    stocks.add(\"TIF\");\t\n    stocks.add(\"TMUS\");\t\n    stocks.add(\"TSCO\");\t\n    stocks.add(\"TT\");\t\n    stocks.add(\"TDG\");\t\n    stocks.add(\"TROW\");\t\n    stocks.add(\"TFC\");\t\n    stocks.add(\"TWTR\");\t\n    stocks.add(\"TYL\");\t\n    stocks.add(\"TSN\");\t\n    stocks.add(\"UDR\");\t\n    stocks.add(\"ULTA\");\t\n    stocks.add(\"UA\");\t\n    stocks.add(\"UAA\");\t\n    stocks.add(\"UNP\");\t\n    stocks.add(\"UAL\");\t\n    stocks.add(\"UNH\");\t\n    stocks.add(\"UPS\");\t\n    stocks.add(\"URI\");\t\n    stocks.add(\"UHS\");\t\n    stocks.add(\"UNM\");\t\n    stocks.add(\"USB\");\t\n    stocks.add(\"VLO\");\t\n    stocks.add(\"VAR\");\t\n    stocks.add(\"VTR\");\t\n    stocks.add(\"VRSN\");\t\n    stocks.add(\"VRSK\");\t\n    stocks.add(\"VZ\");\t\n    stocks.add(\"VRTX\");\t\n    stocks.add(\"VFC\");\t\n    stocks.add(\"VIAC\");\t\n    stocks.add(\"V\");\t\n    stocks.add(\"VNO\");\t\n    stocks.add(\"VMC\");\t\n    stocks.add(\"WAB\");\t\n    stocks.add(\"WBA\");\t\n    stocks.add(\"WMT\");\t\n    stocks.add(\"WM\");\t\n    stocks.add(\"WAT\");\t\n    stocks.add(\"WEC\");\t\n    stocks.add(\"WFC\");\t\n    stocks.add(\"WELL\");\t\n    stocks.add(\"WDC\");\t\n    stocks.add(\"WST\");\t\n    stocks.add(\"WRK\");\t\n    stocks.add(\"WY\");\t\n    stocks.add(\"WHR\");\t\n    stocks.add(\"WLTW\");\t\n    stocks.add(\"WRB\");\t\n    stocks.add(\"GWW\");\t\n    stocks.add(\"WYNN\");\t\n    stocks.add(\"XEL\");\t\n    stocks.add(\"XRX\");\t\n    stocks.add(\"XLNX\");\t\n    stocks.add(\"XYL\");\t\n    stocks.add(\"YUM\");\t\n    stocks.add(\"ZBRA\");\t\n    stocks.add(\"ZBH\");\t\n    stocks.add(\"ZION\");\t\n    stocks.add(\"ZTS\");\t\n    stocks.add(\"NVDA\");\t\n    stocks.add(\"TSLA\");\t\n    stocks.add(\"NKLA\");\t\n    \n    \n            int n = (int) (Math.random()*297);\n            \n           String Stock = stocks.get(n);\n          \n            \n            double per  = Math.random() + 0.5;\n           String bp = \"Call\";\n          if (per < 1)\n          {\n              bp = \"Put\";\n            }\n            int percent  = (int) (per*100);\n            int day = (int) (Math.random()*30 + 1);\n         \n            int month = (int) (Math.random()*12 +1);\n            String c = \"Go Bulls!\";\n             if (per < 1)\n          {\n              c = \"Go Bears!\";\n            }\n            \n            \n            System.out.println(\"Greetings investor! You shoud buy \" + bp + \"s on $\" + Stock + \" on \" + month + \"/\" + day + \" for \" + percent + \"% its current price! \" + c);\n           \n            \n            \n        }\n    }\n\nenjoy", "id": "j4v354", "created_utc": 1601796997.0, "score": 183, "upvote_ratio": 0.85, "num_comments": 97, "comments": [{"body": "This reeks of \"took 1 comp sci class\"", "score": 288, "replies": [{"body": "One example from learntocode.biz", "score": 47, "replies": []}, {"body": "This is such a shit code", "score": 54, "replies": [{"body": "I assumed it was meant to be meme quality code", "score": 14, "replies": [{"body": "looks like someone who just started learning coding in their cs101 course thought it was cool to write something like this and show off on his favorite subreddit. I am sad to see the quality of cs101 course going downhill a lot", "score": 13, "replies": []}]}]}, {"body": "Yeah whoever made this meme must be tremendously unfunny and cringe", "score": -3, "replies": []}]}, {"body": "This program randomly chooses a stock, randomly decides between call or put, and randomly chooses a strike date.\n\nIf that wasn't obvious.", "score": 248, "replies": [{"body": "Winning recipe", "score": 41, "replies": [{"body": "No autist would write such bad code. OP is retarded", "score": 21, "replies": []}]}, {"body": "Is it on par with the monkey?", "score": 19, "replies": []}, {"body": "Sort of, it's a little janky since he hard coded the number of stocks rather than pulling the count, as well as hard coding the number of days in each month the same, which should be determined from the month chosen instead.", "score": 35, "replies": [{"body": "Isn’t it just easier to create an array with all of the tickers in there, rather than just Stocks.add?", "score": 15, "replies": [{"body": "Haha true. Also, nit-pick: missing \"final\" everywhere ;)", "score": 13, "replies": []}, {"body": "The easiest would be to have a separate file with one ticker by line, this way you’d change it without caring about the logic", "score": 12, "replies": [{"body": "Funnily enough thats how i do it for my trade bot.\n\nYaml flatfile with a list of all the assets i want to invest in and any property data relevant to the trade strategy, assets are loaded into an array.\n\nAnd then anything that relies on the total number of assets just calls the length of that array.\n\nLiterally the only thing that should ever be hard coded are constants, if you have a piece of data that can and or will change you should be deriving the value from something else. (That's not to say data should be mutable, you still want to aim towards immutability, but if your data is mutable it should be derived rather than hard coded)\n\nLike op should be hooking into an api getting all the tickers, storing those tickers in an array, calling the length of that array for the part reliant on number of stocks.Bonus points if he takes an extra Ritalin unlocks 10% more brain power and realises since hes already hooking into an api he can get the current trading price for said stock and calculate the entry price and strike price automatically.\n\n&#x200B;\n\nuhhhhh i mean.\n\nCode should always output spy puts expiring tomorrow :)", "score": 3, "replies": [{"body": "Please fix op's code with your big brain (and cock)", "score": 2, "replies": [{"body": "Took alot of red bull and my manager yelled at me when i wasnt crunching but i got a substantial reduction in total lines of the code base by removing excess features\n\nNaturally as such a gigachad coder my editor is the reddit mobile app comments section\n\n\nIf __name__ == \"__main__\":\n    print(\"Buy 100% of your portfolio in spy \" + (\"puts\" if market.is_down == True else \"calls\") + \" expiring tomorrow, NOW!\")", "score": 2, "replies": []}]}]}]}, {"body": "Uhm....API and then not my problem.  F that noise of maintaining -- let a big house do it for you", "score": 2, "replies": []}]}, {"body": "I would suggest reading the list of stocks from a text file into a list, then using the length of that list as the count value", "score": 4, "replies": []}, {"body": "Yeah, hurt my eyes too. Probably doesn't really matter for such a retarded use tho", "score": 4, "replies": []}]}, {"body": "probably the best way to do it.", "score": 2, "replies": []}, {"body": "Is that not just investing?", "score": 2, "replies": []}, {"body": "Isnt that winning strat", "score": 2, "replies": []}, {"body": "Wait so we don't need the dog shitting in the backyard now???", "score": 2, "replies": []}, {"body": "More effective than anything else in this sub", "score": 2, "replies": []}, {"body": "Who the hell needs a program like that when I can keep letting my cat pound the keyboard for all my picks?", "score": 2, "replies": []}, {"body": "Better TA than anything else I've seen here.", "score": 2, "replies": []}]}, {"body": "Dude this is actually shit code lol", "score": 77, "replies": [{"body": "I would say it's pretty good given the sub we are in", "score": 21, "replies": []}, {"body": "Says the dude who DEFINITELY gets 50% or more of his plays RIGHT (this guarantees 50%)", "score": 3, "replies": []}, {"body": "Yeah it’s pretty awful code I agree", "score": 3, "replies": []}]}, {"body": "Why hard code the 297. Just use stocks.length", "score": 36, "replies": [{"body": "*size since it's an ArrayList", "score": 11, "replies": [{"body": "*size() cuz it's a method🤪", "score": 6, "replies": [{"body": "Nuh uh, my girlfriend said size doesn't matter.  She prefers not being woken up when I enter her", "score": 12, "replies": []}, {"body": "Thought that went without saying tbh", "score": 2, "replies": []}]}]}]}, {"body": "For the love of God, iterate through an array or vector.", "score": 47, "replies": [{"body": "No that would take away the whole retardedness of it all", "score": 16, "replies": []}, {"body": "Yes, lol, my eyes hurt from the stocks.add() copy-paste.", "score": 2, "replies": []}]}, {"body": "You really added tickers by hand, line by line? There has to be an API for that...", "score": 20, "replies": []}, {"body": "Is this the HTML 5 supercomputer that Milton is referring to?", "score": 18, "replies": [{"body": "Yes.\n\nThe gravity of it made my portfolio roll downhill.", "score": 7, "replies": []}]}, {"body": "Ban\n\nEDIT: No HTZ, Double Ban", "score": 12, "replies": []}, {"body": "I hope you make some money from this so that you can pay for some Codecademy courses goddamn", "score": 9, "replies": []}, {"body": "An algorithm created for retards by retards", "score": 7, "replies": [{"body": "made for a man, but Beavis likes it too", "score": 2, "replies": []}]}, {"body": "This just automates what I already do thank you", "score": 8, "replies": []}, {"body": "Wow! I Can See Stocks I Own From Here!", "score": 5, "replies": []}, {"body": "Fuck this guy for placing opening parentheses on their own lines", "score": 5, "replies": []}, {"body": "You need some error trapping for February.", "score": 3, "replies": []}, {"body": "They should implent this in robinhood", "score": 4, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "lel", "score": 2, "replies": []}]}]}, {"body": "**FUCKING NERD**", "score": 4, "replies": []}, {"body": "I'm almost tempted to backtest this.  I'm sure it will outperform 90% of our picks.", "score": 3, "replies": []}, {"body": "Ban for shit code alone", "score": 6, "replies": []}, {"body": "This is literally the kind of shit python is for, why use a bloated ass meme language?", "score": 3, "replies": []}, {"body": "marketGraph.redOctober.getBullTrap.execute()", "score": 2, "replies": []}, {"body": "0 tests written. Just like the jr engineers I work with", "score": 2, "replies": []}, {"body": "I only took comp sci for two years and the lack of array is irritating.", "score": 2, "replies": []}, {"body": "I pasted this on codepen, didn't work. Give us autists some direction on how to use this money generator", "score": 2, "replies": [{"body": "Download the  Oracle JDK and Eclipse IDE.", "score": 1, "replies": []}]}, {"body": "Ban.", "score": 3, "replies": []}, {"body": "Ban", "score": 1, "replies": []}, {"body": "Imagine still using Java when Python exists...", "score": 2, "replies": [{"body": "Imagine comparing programming with importing libraries.", "score": 12, "replies": []}, {"body": "Some say JavaScript is even better. Since it’s like Java but also has the addition of Script. 2 for 1. /s", "score": -1, "replies": []}]}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "No one is going to download this, compile it, and run it every day, just do that and tell us what to buy", "score": 1, "replies": [{"body": "I copied and compiled it. Doesn’t run well have me a bit of compilation errors", "score": 2, "replies": []}]}, {"body": "I hope this got you an A for ap compsci. I was in your position before", "score": 1, "replies": []}, {"body": "Greetings investor! You shoud buy Calls on $WELL on 2/15 for 106% its current price! Go Bulls!", "score": 1, "replies": [{"body": "For 2115?", "score": 1, "replies": []}]}, {"body": "In this dudes defense. A smaller percentage of the already small percentage of people on this sub would understand this if it weren't trash code.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "Jesus parse a csv file my dude.", "score": 1, "replies": []}, {"body": "The whitespace burns my eyes", "score": 1, "replies": []}, {"body": "What do I do if it gives February 30?", "score": 1, "replies": []}, {"body": "Should we take the opinion of r/Java folks?", "score": 1, "replies": []}, {"body": "Too big of class, no separation of concerns , refactor please", "score": 1, "replies": []}, {"body": "tldr", "score": 0, "replies": []}, {"body": "Really nice! How can I buy it?", "score": -2, "replies": []}, {"body": "OP, Are you new to programming? You program like you're new to it and Java is a language really only used by ppl in college or highschool learning programming.\n\n&#x200B;\n\nEdit: And Minecraft, ofc.", "score": -17, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Only in old ass companies. Its on its way out. Give it 20 years. Java will be like fortran", "score": 5, "replies": [{"body": "You’re legit wrong. It’s funny just how wrong you are.", "score": -1, "replies": [{"body": "Im a software engineer? Java is dead dude. Kotlin will eat whatevers left of it. Sell me calls!", "score": 1, "replies": [{"body": "I literally work at Google and you are wrong", "score": 1, "replies": [{"body": "1 year ago: \"im a freshman eecs major\"\n\n\nSit down son. Internship at a big 10 != full time. Also dont be the usual berk cs guy who comes crashing down to earth when they get bullied on their first code review\n\nAlso i came off a lil harsh. Yes java is big now (2nd and dropping fast) but pichai doesnt want any more legal battles with oracle. Kotlin it is. Plus the syntax is just cleaner. Your company shall make it so man. Any java youre doing there is probably from old ass projects like gmail or from an old ass architect on your team. Give it 20 years.", "score": 1, "replies": [{"body": "How does me having an internship at google discredit the fact that I know what projects and what codebases exist here? Didn’t say I was a good programmer or anything, yet you’re just going for an ad hominem attack.", "score": 0, "replies": [{"body": "Please refer to paragraph 2 of the above text good sir", "score": 1, "replies": [{"body": "Nah you’re just an asshole", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "But uncle bob told me the best language is clojure\n\nCan go from opening an editor to having a web server spun up in under 5 minutes with clojure, makes java look like 3 month old hot dog water (granted it already did but still)  \n\n\nIf you dont believe me just watch literally every single clojure talk ever  \n\n\n[https://www.youtube.com/watch?v=jlPaby7suOc](https://www.youtube.com/watch?v=jlPaby7suOc)", "score": 1, "replies": []}, {"body": "O V E R 4 B I L L I O N D E V I C E S\nBut fr like what? Apache commons?", "score": -7, "replies": []}]}]}, {"body": "Writing code is meta-autistic", "score": -4, "replies": []}]}
