{"title": "Commercial Real Estate, CMBS delinquency, and CRE crash", "selftext": "This is a bearish sentiment on the CRE market and why all signs point to their being a massive pullback, if not an outright crash in the CMBS market.\n\nLet's take a look at the numbers and what they mean:\n\n[The CMBS delinquency rate](https://info.trepp.com/trepptalk/cmbs-delinquency-rate-continues-retreat-from-near-all-time-high) was 9.02% in August. And many of the loans went to the reserves to bring them to current. A large swath of loans that would otherwise be delinquent or in forbearance are above water for ONE reason only, COVID relief. Without structural relief we would currently be seeing a higher delinquency rate.\n\nWhat is arguably even worse, is that the percentage of loans that were in delinquency for >90days rose 1.5x, from 2.65% in July to 4.02% in August.\n\nAccording to analysts in the CMBS market, they expect a decrease in delinquencies going forward. Yea they have zero stake in this game and aren't biased towards guiding sentiment towards a favorable outlook on CMBS. The delinquency rate in September was 8.92% and 9.2% in August. This decrease they see from August-September was .1%, we aren't seeing a drastic decrease in CMBS because, despite what these analysts say, the overwhelming sentiment is that the delinquency rate will increase, drastically.\n\nLong term? The CRE market is going to crash soon. $31.2B covering 800 loans are now [in forbearance.](https://info.trepp.com/trepptalk/monthly-snapshot-cre-cmbs-clo-lending-market-updates-september-2020)\n\nLet's talk about sentiment? Everyone in corporate America is working from home. Including myself. Guess what COVID told all of c-suite across the world? You DO NOT need office space anymore. Is WFH permanent? No, people will go back to the office. But every single one of the companies in the F500 and SP500 are reassessing their CRE needs to save on costs. Every single one of these companies now realizes their business model can largely be done outside of massive office space, and downsizing is imminent. Outside of office space, guess how many people want to spend money on hotels right now? Almost none. And with a second wave coming, we are going to see a ton of casualties.\n\nWe're seeing 2008-2011 levels for CMBS delinquency and overall performance. This time instead of residential real estate taking the brunt of the crash, this will be CRE.\n\nPuts on any index/etf that is invested in CRE. I kept this DD sorta short just to display the basic sentiment and raw numbers that highlight why this industry is in trouble. I can answer questions in the comments\n\nPositions: SCHH 04/16/21 34p, IYR 01/15/21 75p, XLRE 05/21/21 34p, RWR 04/16/2021 71p\n\nOther positions: GME 11/20 14c, ATSG 12/18 35c, FVAC 6/18/21 15c, SPWR -5 put 11/20 14.5, PSTH common, PLTR and the portfolio I care about boomah shit.", "id": "jifb8z", "created_utc": 1603721777.0, "score": 111, "upvote_ratio": 0.95, "num_comments": 90, "comments": [{"body": "This the type of DD we need more of", "score": 48, "replies": [{"body": "I'm glad to hear that", "score": 16, "replies": [{"body": "Take a look at the insurance industry too. AIG, Prudential, Metlife.\n\nMetLife has been giving out hundred million dollar loans to casinos (because that's what insurance companies do, right?).  Earnings were down 43% last report.  They own a stadium during a pandemic too.\n\nWhy did the Senate adjourn until Nov. 6th?  MetLife earnings are out on the 3rd, AIG on the 6th.  Bailouts are needed.", "score": 0, "replies": []}]}]}, {"body": "I said this months ago on wsb. CRE will crash and take down residential real estate. Reverse of 08 when residential crashed and by 2010, CRE was pretty much dead.", "score": 21, "replies": [{"body": "But residential RE is exploding. Why would this also take down residential if people are moving out of cities and into homes? \n\nSpoiler: it won’t\n\nEdit- I see what you and others mean. Yes the housing bubble will likely pop if there is a catalyst in CRE", "score": 21, "replies": [{"body": "Save this comment for when it does. The increasing prices are unsustainable.", "score": 26, "replies": [{"body": "Ah yes, true. There will be a pop. With nearly everything going for around 10% above ask, cash offers, etc. a bona fide frenzy for sure. I don’t see a crash, feels like demand is too strong. Feels like the environment will only shift when rates change or demand slows considerably", "score": 5, "replies": [{"body": "There's not enough inventory on the market. I seen over asking more than 10%. No inventory = higher prices for those seeking to buy a home at this time. When inventory comes back to normal levels, you'll start seeing the prices slide. If CRE tanks, That's mainly office and retail that are losing businesses. That in turn will flow back into residential as those people who had those offices and businesses leased don't have a job anymore.", "score": 6, "replies": [{"body": "Man, I was off. Right of course supply can balance to meet the demand. \n\nA very good point about the loss of jobs in conjunction with downsizing companies. You seem to have more a mind for the subject than I. \n\nSo, for sake of discourse: agreed on the retail and large corps cutting locations. But, wouldn’t this be a cost-saving move? Better for the bottom line ultimately.\n\nRegarding the housing inventory shortage: my estimation is that the shortage will continue to exist as long as rates are low; people are buying still, especially if we get more stimulus. \n\nResi home builders are spread too thin with all the new work, based on a few stories on r/homebuilders. There has been a quantifiable shortage of building materials namely lumber. “Pent up demand” may be a real thing in the housing industry, as it’s not quickly met by speed of construction. I see residential housing continuing this trend until some negative event we can’t predict. \n\nAs another user mentioned, commercial residential/urban rental properties are in dire straits, unlikely to change.", "score": 3, "replies": [{"body": "That’s a dead sub practically. I hope you aren’t actually using it as a barometer.", "score": 4, "replies": [{"body": "MY MAN KEN FOR THE WIN \n\nhttps://www.youtube.com/watch?v=8uwQC0lrnLA\n\nFor real though, I know several builders and some are not able to make the $$$ back right now on new builds. Currently, $150 per squ ft is the rate. At the absolute minimum with zero options (adequate, but much lower quality materials), it's $93 per squ ft. My uncle charges a mint as a general contractor, but he's not a newbie. He's been in the game for 30 years so he's still on pre-determined contracts. His brother does custom homes, and he's closed up shop for the winter. \n\nI just bought a burned out lot two days ago. Still has a storage shed, driveway, and a septic tank, so I've been trying to determine if I want to go stick-built or modular construction for a duplex (I'm going to rent this fucker out for 10 years, then sell ~~the problems~~ to someone else).", "score": 4, "replies": []}, {"body": "It’s not the only source, but I didn’t realize it was barren.", "score": 1, "replies": []}]}]}, {"body": "The owners who have office and commercial leases are mostly doing fine, unless they’re in retail/foods\n\nRecord high earnings for banking/tech companies and a bunch of other sectors\n\nThese are the main players who rent downtown offices", "score": 3, "replies": []}]}, {"body": "Low interest rates for the next 5 years will prevent a housing crash. Clearly this market is over inflated though.", "score": 3, "replies": []}]}, {"body": "Keep in mind rock bottom interest rates. We weren’t there in 2008.", "score": 2, "replies": []}]}, {"body": "The two are inextricably linked unfortunately. Doesn't have anything to do with supply/demand relationship, but the state of CMBS.", "score": 4, "replies": [{"body": "I see what you’re saying. Counterpoint, In this scenario with rates at lows for foreseeable future, and pure demand side push (ie. moving to suburbs) is certainly creating inflated prices, but I feel that residential demand has to slow considerably for prices to pop. Everything is being bought up. Check out real estate subreddits for a glimpse into the market. \n\nIf CRE suddenly crashes (again, what would the catalyst for this be, rising loan defaults? Covid relief funds drying up? Interest rates suddenly going back up?) I don’t think a sudden crash happens, but more of a slow decline as more buildings sit empty for longer. \n\nI guess this is to say, I don’t think corporations suddenly default and CMBS implodes like ‘08. Thoughts?", "score": 3, "replies": [{"body": "Good counter points but it's missing the major catalyst that has already occurred. Every major company realizes they can work from home and still make a profit. I know my company in the F50 is reevaluating their real estate needs. In fact, we've closed offices in major cities across the US and consolidated. The crash won't be sudden, it's been happening since last spring.\n\nSo would residential just be the innocent bystander that \"caught a hot one\" yea. They'd be a a collateral casualty in this instance.\n\nSo it's a two fold issue imo. You have defaults on loans, hotels, shit companies, etc that are closing and defaulting and you have successful companies shed their capital obligations on RE and reinvest that somewhere else within their org.\n\nAdditionally, we forget about the residential aspect of commercial real estate. NYC buildings are fucking empty, median rent is below/at 3k again for the first time in a while. So homes are doing well, but how is commercial real estate for residential leases? They're doing pretty poorly in major cities.\n\nGood points though, hopefully I made some sense.", "score": 6, "replies": [{"body": "Agreed on all accounts! Commercial RE is in a state of limbo if not decline. So, this pretty much confirms this is priced in already on the CRE side, if it’s been happening for the past few months. Otherwise long dated puts seem like the only play, but then you have sTiMULuS tAlKs to worry about, so entry becomes key. Buyer beware, Entry is not great today. \n\nRental units seem to be in a state of steady bleed. Leases end and people move out, no one moves in.  Still available room for price discovery here, I’d imagine, as property management firms report earnings. \n\nDowntown hi rise offices, retail, and rentals will continue to empty, no doubt. Is there still room for plays? Maybe, but it’s over a long time horizon. Might pick up leap puts on a really green bounce, not today though.\n\nGreat write up and discussion 👍", "score": 3, "replies": [{"body": "Good point. People need to keep in mind I’ve been in these for a while. So what may seem unrealistic for those seeing this now makes perfect sense to me.", "score": 3, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Yea no. That's a bad way to look at it.\n\nNew commercial builds are getting frozen. Last time delinquencies were this high was in the wake of 2008. Major companies are consolidating their RE needs and closing out redundant leases.\n\nWeight is being shed. Certain leases are going into default. Others are just getting force majeured out the ass. Others are just not renewing because they don't need the space.", "score": 3, "replies": []}]}]}]}, {"body": "As someone who works in a commercial construction office in a prominent growing city, I can confirm this. Many of our multi use office and hospitality projects are on hold indefinitely, most due to financing freezes. Some are having delays with material delivery. \n\nNot sure how long it will take for this to get priced accordingly. Could be a slow bleed, could already be priced in. I don’t know enough about financial markets to take a stance.", "score": 10, "replies": [{"body": "That's what I've been hearing from my friend that works at Moss. \n\nAlso what I've been hearing from my friends at Marcus and Millichap, CBRE, etc. In for a world of hurt.\n\nForce majeure clauses are getting triggered as well.", "score": 6, "replies": []}]}, {"body": "Ok puts", "score": 8, "replies": []}, {"body": "Any resources to look into ETF composition/exposure to CRE? Aren't the likes of VNQ and SSCH overall real estate ETFs, not necessarily CRE?", "score": 7, "replies": [{"body": "Good question. VNQ, SSCH, IYR, and XLRE all have exposure to CRE as well as residential. The two are relatively interconnected, that being said, if CRE gets destroyed (which is extremely likely), these will also take a major hit.\n\nAdded one I forgot I had. RWR 71p 04/21", "score": 4, "replies": [{"body": "Be careful, then. Residential is running red hot in the upper price brackets of some areas, and I'm not confident that residential <-> commercial aren't negatively correlated right now.\n\nThe counter-mechanism to a CRE collapse I see is this:\n\nIf you are able to WFH & have access to capital, you will move to a nicer residential place; esp. if RRE appears solid long-term while WFH allows you to move beyond prior geographic confines into undervalued markets. Moreover, being able *to* WFH and having access to capital is more positively correlated the more the crisis hits.\n\nI wouldn't even exclude large capital holders, be it investment banks or corporations, to move away from financialisation in the stock market and into real estate (+ other long-term investments such as arable land).\n\nAll of this doesn't mean an ETF cannot tank due to CRE, but unless you are aware of at least i) exposure to CRE vs. exposure to other types of real estate ii) how *those* types balance each other out, I'd say it's not that clear of a gamble.\n\n**tl;dr:** Sell your home and short CRE, no bollocks mate.", "score": 4, "replies": [{"body": "Agreed, but if CRE crashes, CMBS crashes, so RRE is hurt. Opposite of 2008.", "score": 2, "replies": [{"body": "I don't understand that, so I will have to read up on it. Thank you! I hope it works out for you.", "score": 2, "replies": []}, {"body": "Interesting. These two seem negatively correlated. What makes you think they will move in the same direction? RRE includes downtown condos and suburb houses. Are you specifically referring to condos?", "score": 1, "replies": [{"body": "Commercial Real Estate has a residential component of leasing units. Yea it's commercial but when that gets whopped (which it already is in large part, in NYC, SF, and LA), the damage will spread to the RRE industry in those large cities.\n\nSuburbs could be fine. Again it's the opposite situation of 2008, CRE then RRE, rather than the other way around", "score": 1, "replies": []}]}, {"body": "How is residential hurt if CMBS crashes?", "score": 1, "replies": []}]}]}]}, {"body": "Instructions unclear $CREE is now down 2.7% today. Fuck led lights", "score": 3, "replies": []}]}, {"body": "Is this priced in?\n\nYour Trepp blog link was posted Oct 7th, and the Monday after that, SCHH and XLRE started tanking. They've already dropped 5% throughout October. I'm no CRE expert, but I would assume that funds and institutions do have experts who keep an eye on this stuff, and they would for sure have discovered these numbers before you or I. In fact, they probably have more data that lets them better predict trends than this.\n\nAs for the anecdotes from people who work in the industry, I wouldn't count on that information unless it's from an actual executive, or someone in higher management. Regular employees at large companies usually have as much (market moving) insider knowledge as the general public, i.e. none. Unless large scale project freezing started happening only in the past 2 weeks, this would've already been priced in.\n\nNot trying to be a dick, just wanna test your thesis, mostly because I want it to be true so I can go in lol. The analysis is sound, but the question is always timing. E.g. I had QQQ puts and VIX calls last week, knowing a pullback was imminent, but got squeezed and stopped out on Friday, missing the red candles today. I was \"right\", but still lost money.", "score": 6, "replies": [{"body": "I would imagine to an extent there is this sentiment reflected in the charts of XLRE, SCHH, RWR. \n\nThe primary issue with commercial real estate is it's grasp on our institutions. Essentially our economy is tied to CMBS, if for example, we saw a total failure in the CMBS market, you'll probably be more concerned about the price of ammunition than the price of JNJ (hyperbole but you get the point).\n\nRegarding the extent to which this is priced in, I would say it barely is. Yes employees at large companies know nothing, but they also know what is capable of being done within the company outside of the office, and to us and the C-suite at every company. It's clear that office space, while it won't ever full go away, isn't needed. Consolidation of companies office space is beginning to ramp up. Major companies as well as middle market IB's are closing offices left and right.\n\nProject freezing has been very prevalent, large companies stopping their renovations on their leases. Why create a lounge, cafeteria, and brainstorming center if that can be done at home?\n\nI think you're right, the real question is timing. If these dates don't work, roll them further out. In 2008, residential got buttfucked and CMBS delinquency was highest in 2011. I think it will be the other way this time, CRE gets hit first with a delayed take down of RRE.\n\nThen again, I could be entirely wrong, but I don't think I am.", "score": 3, "replies": [{"body": "You're talking about a wider trend that doesn't speak to the kind of bucking spikes an options play would benefit from. Consolidation of office space will take years, if not a decade to finalize, what with long leases and the eventual (<5 years) return to the norm.\n\n> It's clear that office space, while it won't ever full go away, isn't needed.\n\nHard disagree. There are real, economically impactful benefits to working in offices. Under normal circumstances (i.e. no pandemic), a large company (the type whose behaviors affect market trends) that works primarily in offices will outcompete primarily remote companies, 9/10. IMHO, a more dramatic shift would require this to be _not_ true, and cause companies to re-evaluate their strategies for 5, 10 years out from now, which I don't think is happening. Anecdotally, myself and literally everyone I know are itching to get back to the office. I don't think it's necessarily right to apply that to everyone, but I also think it's dangerous to misinterpret coping behavior as long-term market trends.", "score": 2, "replies": [{"body": "Interesting. Yea I think the timing could be an issue, but I do think this is barely OTM, and could be realized fairly quickly. It's speculative for sure, that being said, regarding finalization, these large leases have force majeure clauses - A force outside of the control of anyone (like a pandemic), can trigger a force majeure and allow some companies an \"out\" of their lease.\n\nRegarding what you say about the office, I agree with you and disagree with you. I guarantee if you give people regular social interactions (ie, no COVID), but WFH, people would be very fine with that. I think WFH + limited social life makes people crave going back to the office.\n\nAdditionally, a return to the office will never be normal again. No one will be forced to be back in the office 5 days/wk and that has a profound impact on space required on those leases. These are long term market trends, unfortunately. But your points are extremely valid and I agree with your sentiment in many instances.", "score": 3, "replies": []}, {"body": "I think you are dramatically over estimating the usefulness of offices. You claim that in-office companies out compete, but there has never been a time in history where there were enough companies doing wfh for there to be the data to prove something like that. There also seems to be a huge generational component to this as well because I don’t know a single person under 40 who wants to go back to the office.", "score": 1, "replies": [{"body": "Agreed with you.\n\nI truly believe people are conflating going back to the office with getting social interaction. I believe if everyone could have regular social interaction and could WFH, no one would go back to the office. Especially those who have been in the workforce for a year or two. \n\nThere will always be offices, but they are getting downsized like fucking crazy. The work week will never be 5 days a week. And the reason? You can't, own a fundamental level, have people work from home from March '20 to March '21 (march '21 is now the earliest most companies will end WFH) and have employees WFH for a literal year, and then tell them how imperative it is for them to return to office. Frankly, if it goes longer than March, I doubt you can even begin to make the argument that working in the office is imperative. A 2-3 day work week will be the future and even then I think it will be flexed, theres no reason to be in an office 5 days a week. Ever.", "score": 2, "replies": []}]}]}]}]}, {"body": "I actually agree with OP's assessment. I keep on seeing articles on commercial landlords in NYC, San Francisco, Toronto, and any other major N.A city taking a massive dick up the ass right now due to vacancy and decreasing rent in downtown regions. Hell even in my city (with only 1million people) I am seeing A LOT of vacancy signs in downtown. \n\nIts gonna get real bad this winter.", "score": 6, "replies": [{"body": "Exactly. NYC has a record number of Condo's converting units into regular rentals. Which is not good news.", "score": 3, "replies": [{"body": "Yeah, it's happening all over the place. I think I read that rent in San Fran went down 31% YoY. I wouldn't be surprised if downtown real estate values crash, it can bring down suburban values as well.", "score": 2, "replies": []}]}]}, {"body": "I love how you've got the GME calls. Gives legitimacy to the whole DD.", "score": 5, "replies": [{"body": "Money", "score": 5, "replies": []}]}, {"body": "Would the fact that people are loading up on them due to interest rates matter? My friend and his company are up to their neck processing loans for people buying them up. They can't even keep up.", "score": 4, "replies": [{"body": "Residential or commercial loans?", "score": 1, "replies": [{"body": "He's doing both but I don't know the percentage. Because of the commerical being ditched due to people working at home and restaurantes and buissness closing. I do know he is finding the deals and slanging them to investors quite quickly for a few points.", "score": 2, "replies": []}]}]}, {"body": "I and some of the other guys from the discord were looking into this during the march crash. IIRC the CMBS market got hit but never truly crashed in '08 (nothing compared to RRE) and all of the problems were kicked down the road to be dealt with later.\n\nLooking at the [https://etfdb.com/etfdb-category/real-estate/](https://etfdb.com/etfdb-category/real-estate/) list it's already down -17% (from first page results) and $CMBS is neither optionable nor shortable (at least via ToS). As others have mentioned; this does seem priced in to a certain extent. Also many of these are cell towers- I don't think they would suffer from WFH or CRE failures beyond market beta. \n\nBXP, SLG, HPP, HIW, CLI all seem like companies with more relevant holdings but either have A. already dropped \\~30-50% or B. shit tier bid/ask spreads.\n\nFrom your first link it seemed more like the worst has already passed and things are beginning to rebound while the second made it seem like we're currently peaking. This might be too tough to call and too balanced: borrowers are beginning to get their feet under them again but future builds are being frozen/cancelled and it would be fucking stupid to have an office when you could just WFH. I could see more of a stagnant market than an actual crash. Something like a second lockdown would probably be the straw that breaks the camel's back but I doubt we'll have one given how bat-shit crazy people got during the first- no one would respect the lockdown 'fuck it' style.\n\nOP's opinions?", "score": 3, "replies": [{"body": "https://www.google.com/amp/s/www.cntraveler.com/story/european-countries-enter-second-lockdowns-as-cases-spike/amp\n\nLooks like Europe is locking down again \n\nhttps://www.thedailybeast.com/italy-burns-as-protesters-riot-against-second-covid-lockdown\n\nItalians are rioting because of lockdown rules.. \nWouldn’t be surprised if the US was to lock down soon.", "score": 1, "replies": [{"body": "I found some Google AMP links in your comment. Here are the normal links:\n\n - [https://www.cntraveler.com/story/european-countries-enter-second-lockdowns-as-cases-spike](https://www.cntraveler.com/story/european-countries-enter-second-lockdowns-as-cases-spike)\n\n Beep Boop, I'm a bot. If I made an error or if you have any questions, my [creator](https://np.reddit.com/u/6b86b3ac03c167320d93) might check my messages.  \n [Source Code](https://github.com/laurinneff/no-google-amp-bot) | [Issues](https://github.com/laurinneff/no-google-amp-bot/issues) | [FAQ](https://laurinneff.ch/2020/10/17/nogoogleampbot/)  \nWhy does this bot exist?  \nGoogle does a lot of tracking, which many people don't want, so they use alternatives to their services. Using AMP, they can track you even more, and they might even replace ads with their own, stealing ad revenue from the site's owners. Since there's no consistent way of finding the original links from an AMP link, I made this bot which automatically does it for you.", "score": 1, "replies": []}]}]}, {"body": "nice ill buy puts today", "score": 3, "replies": []}, {"body": "Where does this thesis go with a $2T stimulus package?\n\nBiden win likely, which makes fiscal stimulus likely.", "score": 4, "replies": [{"body": "Doesn't change the thesis. CRE damage is done imo", "score": 5, "replies": [{"body": "I agree damage is done, the question is how much damage is undone \n\nI was on the fence for this for a while and gave up this summer. I doubt it plays out the way you'd expect due to political actions.", "score": 3, "replies": []}]}]}, {"body": "Will SPY crash along with it", "score": 2, "replies": [{"body": "Who knows. I don't fuck with SPY", "score": 5, "replies": []}]}, {"body": "Any reason why you're holding PSTH and PLTR?", "score": 2, "replies": [{"body": "Fucking huge upside. Limited downside. PSTH is a pop and sell.\n\nPLTR is a buy and a half at this price.", "score": 2, "replies": [{"body": "By \"pop and sell,\" do you mean you would sell PSTH after it makes an acquisition or something? \n\nFor PLTR, isn't it highly reliant on US. government contracts? Seems like limited upside to me but maybe I'm missing something.", "score": 1, "replies": [{"body": "They’re so cheap the downside is almost nonexistent depending on portfolio size. \n\nPSTH, sure. Whatever floats your boat, or just sell shares when PSTH rips.\n\nPLTR is going to slowly go parabolic imo and at 10$/share basically the fact there is so little downside gives it upside, imo.", "score": 1, "replies": []}]}]}]}, {"body": "Alright, I have been trying to wrap my head around this recently, but still have a lot of research to do. What do you think the time frame would be like relative to '08? Just looking at IYR, peak-to-trough time back then was about 500 bars. Applying that to now would put us into early 2022. Clearly you seem to think that it will be a shorter time frame, but why? Is it down to a winter wave of covid, or are companies just more willing to bail on office space altogether now than in '08? \n\nI get that history won't repeat itself exactly, I just don't know enough about this yet to call a time frame.", "score": 2, "replies": []}, {"body": "Its important to recognize the composition of the CMBS delinquencies. The vast majority are Hotels, and to a lesser degree office, and then retail. However to say multifamily and industrial property will fall lock step with the rest of CRE is far from true. Regarding multifamily, October rent collections have been stronger across the board. Agency (Fannie and Freddie) MBS have robust DSC ratios, and there are more stringent UW standards for new originations (upfront loan reserves,  additional sponsor NW and liquidity requirements etc.)The worst is over for multi family, barring another nationwide shutdown (big if I realize). THAT BEING SAID, class A assets in 24 hour markets are going to experience the worst of the collections and concessions. If there were to be a sudden downturn in MF real estate equities, view it as a buying opportunity, since traditional property performance metrics will likely stay strong and get stronger", "score": 2, "replies": [{"body": "[https://www.pymnts.com/economy/2020/eu-second-wave-of-shutdowns-threatens-recovery/](https://www.pymnts.com/economy/2020/eu-second-wave-of-shutdowns-threatens-recovery/)\n\n&#x200B;\n\nEU was shutdown before us for the first wave.  If history repeats itself, we may have another shutdown soon.  I'm thinking after the election, there won't be a reason for either Trump or Biden to avoid a shutdown.  \n\n&#x200B;\n\nThoughts?", "score": 1, "replies": []}]}, {"body": "What kind of gay bear shit is this?", "score": 3, "replies": [{"body": "I'm bullish on just about everything. Being a 🌈 🐻  isn't sustainable. But imagine being bullish on residential real estate in the beginning of the 2008 crash.\n\nThis is a comparable CRE equivalent. Being anything but a bear on CRE is foolish right now. Will it be as bad as 2008? Maybe not. But it will be horrendous.", "score": 11, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/duckfishwave don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Not to be rude, but that's a horrifically bad take. A bailout helped in 2008 but it still fucked a lot up.\n\nUnfortunately for you, you might not realize this, but companies in the F50 are closing out leases like fucking wildfire.\n\nYou do not know what you are talking about. CRE will be fucked, it's a matter of the date. But it will get fucked.\n\nedit: Companies are now WFH until March at the earliest, most large city offices are June.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Unfortunately I do.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "We'll see. It's more likely I am right than you are. A bailout would stops the wound, but the wound still happened.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Happened in 2008. Happen with oil in the mid teens. Will happen again.\n\nCrashes happen. And if you don’t think CRE is about to get dog fucked you don’t know what you’re doing or talking about.\n\nFfs, the flatiron building offered free year in their bottom floor retail space and no one took them up on it, because they’d have to extend the contract. CRE is fucked", "score": 1, "replies": [{"body": "I see where you’re coming from.  Just wondering how we can know the timing on this?  Any indicators that we can relate from 2008 or oil crisis that would help predict?  I’ve purchased puts with same exp as you.  Just hoping they’re dated out far enough.  I’ll do some more DD tonight.", "score": 1, "replies": [{"body": "Timing is the biggest thing here. If it seems like it will take longer, then roll them out.\n\nI fundamentally think the spring will be rough given most companies are WFH until at least March.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "What are some other cheaper index/etf or even individual stocks under CRE?  Maybe lower than $10.", "score": 1, "replies": [{"body": "Mac", "score": 2, "replies": [{"body": "Nice, thanks!", "score": 2, "replies": []}]}, {"body": "You are better off elsewhere for that price honestly.", "score": 1, "replies": []}]}, {"body": "I would kinda trip on your puts not being far out enough, the election may have a good 6 month pop that would cover up this issue for a while. Not to mention the extreme lack of volume and spread.", "score": 1, "replies": [{"body": "Possible, but if that's the case I'll roll them out, I think the damage is done though. The F50 companies are WFH until at least March, most large city offices are until June.\n\nThat's the kicker.", "score": 1, "replies": [{"body": "Interesting", "score": 1, "replies": []}]}]}, {"body": "!remindme 50 days", "score": 1, "replies": [{"body": "I will be messaging you in 1 month on [**2020-12-15 18:28:19 UTC**](http://www.wolframalpha.com/input/?i=2020-12-15%2018:28:19%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/jifb8z/commercial_real_estate_cmbs_delinquency_and_cre/ga6wpkv/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fjifb8z%2Fcommercial_real_estate_cmbs_delinquency_and_cre%2Fga6wpkv%2F%5D%0A%0ARemindMe%21%202020-12-15%2018%3A28%3A19%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20jifb8z)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "wasn't there supposed to be a cre crash in September?", "score": 1, "replies": [{"body": "Not that I knew of. CRE is in for a world of hurt in the coming months. Extended WFH and defaults will continue.", "score": 1, "replies": []}]}, {"body": "Fed just needs to keep the money printer on for another year or so until the vaccine comes out and everyone is ok with that.", "score": 1, "replies": []}, {"body": "What about converting commercial buildings into housing.  Loft mania 2.0.", "score": 1, "replies": []}, {"body": "There was a Bloomberg article about this a few days ago, also interesting as there were a couple of DD's here right from the start of COVID with the CMBS put/short play. I have been following CMBS ETF and it has been fairly stable, even given delinquency rates, pretty much like the ETF's you have in your post. I'm thinking that it might be being propped up by bail-out loans right now - this is basically the only expense that a company can't avoid unless the landlord lets them, and they don't.", "score": 1, "replies": []}, {"body": "Some related info here\n\n&#x200B;\n\n[https://www.reddit.com/r/wallstreetbets/comments/j52m4n/bank\\_ozk\\_the\\_new\\_century\\_financial\\_of\\_the\\_current/](https://www.reddit.com/r/wallstreetbets/comments/j52m4n/bank_ozk_the_new_century_financial_of_the_current/)", "score": 1, "replies": []}, {"body": "Lot of implicit government support from hud, Fannie, Freddie, for Multifamily and residential financing. We don’t build enough doors to house our humans where they want to be, wfh helps but won’t cure.  Multifamily collections stayed in the low 90s high 80s with record unemployment nationwide. High end new build apartments could be in trouble but I don’t think that causes a landslide.  Bad retail is dead and deserves to die. Office will be a slow leak with more survivors than retail. Hard to onboard and create culture virtually despite how much I enjoy working from home. K shaped recovery in full effect, rents are going up asset owners going to grow richer.", "score": 1, "replies": []}, {"body": "I liked the post but like your positions even more so you win", "score": 1, "replies": []}, {"body": "The stocks you recommended are all very broad-based RE etfs, covering everything form cellphone towers to warehouses for Amazon fulfillment centers.     Wouldnt stocks of pure commercial office space holders be a better target for your thesis?", "score": 1, "replies": []}]}
