{"title": "r/Stocks Daily Discussion & Options Trading Thursday - Oct 01, 2020", "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme and/or [post your arguments against options here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&restrict_sr=on&include_over_18=on&sort=new&t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.", "id": "j34ghz", "created_utc": 1601539606.0, "score": 6, "upvote_ratio": 0.75, "num_comments": 96, "comments": [{"body": "Lol @ the boomers in this sub that shill oil stocks. Buy renewable energy stock or you will continue to lose money.", "score": 11, "replies": [{"body": "The time is coming where this will be true, but in the last 12 months (even with the Coronavirus) the United States Oil Fund indices grew 143%, and in the last 6 months it’s grown 528%. Probably two or three more years at least before Oil isn’t pretty valuable...", "score": 1, "replies": []}]}, {"body": "Passed the $25k minimum to day trade yet still getting day trade warnings on TD Ameritrade. Can anyone clarify the PDT rule for me?", "score": 5, "replies": [{"body": "...Not official answer, but I've been on TDA for about a decade...\n\nToS reports your PDT even if the account has million bucks.\n\nTDA applies higher margin requirement if both:\n\n- PDT counter reaches 0 from 3\n\n- have under 25k\n\nOtherwise it's just for your reference.", "score": 1, "replies": [{"body": "Does PDT rule only apply to margin accounts?", "score": 1, "replies": [{"body": "Think so.  If there's no margin, then no risk to the broker, so not there problem when account blown up.\n\nGranted day trading with non leveraged is questionable strategy.  There's not enough money to justify the risk.  \n\nWhen eg an ES future moves 1pts that's 50$.  That happens continuously. Meanwhile that same capital requirement in SPY (14k / 340$ share = 40 shares) might move 150$ per day.", "score": 2, "replies": []}]}]}]}, {"body": "Are there any undervalued stocks worth watching?", "score": 4, "replies": [{"body": "CRSR", "score": 4, "replies": []}, {"body": "IVR if you want something to change quickly. IVR is a real estate mortgage company thats 5 year average is somewhere around 13 dollars but due to covid it dropped significantly to 3$ a share. Tons of room for huge returns in the next two years.\n\nDIV if you want a safer ETF that pays high dividends. Same story.", "score": 2, "replies": [{"body": "Cheers, will need a different broker though if I want to invest", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Add whatever you can each month to a portfolio of mostly ETFs, with some playing money for stocks if you can afford/are interested in it.", "score": 4, "replies": [{"body": "Any Specific ETFs I should look into?", "score": 2, "replies": [{"body": "This is by far the most logical post on which ETFs to purchase and why. Follow this and you'll be in the best position to succeed. Good luck man!\n\nhttps://www.reddit.com/r/stocks/comments/j21rk1/investing_in_etfs", "score": 7, "replies": []}, {"body": "I just started investing a month ago (literally September 2nd, the day before the huge dip - today is my first green day) so I don't know enough to be comfortable giving you advice. Check out r/bogleheads. \n\nIn short, it seems like it does not matter so much which ETFs you pick as long as they are well-established and you hold long-term. I would also advise you to put money in industries you believe will boom long-term, such as solar energy, AI, or even r/shroomstocks.", "score": 2, "replies": []}, {"body": "VT", "score": 1, "replies": []}]}]}, {"body": "Buy safe. Stick to ETFs! VOO, VYM, VNQ, VYMI", "score": 4, "replies": []}, {"body": "Start out with established stocks.  \n  \nI'm talking high market cap companies that pay good dividends have been around for decades and aren't going anywhere anytime soon. MSFT, ORCL, VZ, T, JNJ, PFE, RDSA/B, BP just to name a few. You likely won't make bank but you likely won't go broke either.", "score": 2, "replies": []}]}, {"body": "How is Nikola up 10% when they've been caught in this much fraud?", "score": 4, "replies": [{"body": "What goes up must come down.\nThey’re up on the CEO announcing he’s “confident” on the deal with GM.\n\nI’m waiting for GM to demand a much larger stake and push NKLA away or for GM to come to their senses and back out of a deal with liars and cheaters.", "score": 1, "replies": [{"body": "It's absolutely bananas that they didn't immediately back out", "score": 1, "replies": [{"body": "Fraud can be an attractive business - it’s getting caught that sours people’s moods", "score": 1, "replies": []}]}, {"body": "NKLA, not NIO", "score": 1, "replies": [{"body": "Edited.", "score": 1, "replies": []}]}]}]}, {"body": "Somebody know a youtube channel or podcast that analyzes individual companies in depth?\n\nI am bored by stuff like wall street journal etc. talking about news and stuff but never get concrete.", "score": 3, "replies": [{"body": "Matthew Huo in youtube", "score": 5, "replies": []}, {"body": "Financial Education, he's a youtuber", "score": 1, "replies": []}]}, {"body": "Where do yall see Apple at by the end of the year?", "score": 3, "replies": [{"body": "maybe back at 130. It really depends how their iPhone sales are, which I expect to be strong.", "score": 6, "replies": [{"body": "Its funny how I used to hate apple for coming out with a new iPhone every year, but now I see it as a godsend", "score": 5, "replies": [{"body": "they have done an incredible job marketing those things. They make minimal changes to the phones, but people still go nuts over them. I’m still rocking my iPhone 8 and I don’t feel any reason to change. \n\nApparently with the 5g iphones they are way overhyped since 5g technology is still at its infancy stages. But they will sell incredibly well anyways.", "score": 3, "replies": [{"body": "I dont have an iPhone at the moment, but my old Samsung s9 will need to be upgraded soon. I'll probably go for another samsung device because I can't stand IOS", "score": 2, "replies": [{"body": "Wait....for all the reasons above.  I do tech care for one of the 5g carriers and every damn Samsung 5g phone is a burden on my soul", "score": 2, "replies": []}, {"body": "same", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I got 20 shares of Palantir (PLTR) at $9.81.  \n  \nLet's see how this goes.", "score": 3, "replies": [{"body": "I just made a comment about this looking for people's thoughts - what was the thesis here?", "score": 1, "replies": []}]}, {"body": "Everyone look quick Cloudflare is finally doing something!", "score": 3, "replies": [{"body": "first time I've broke even since I bought in.", "score": 2, "replies": []}]}, {"body": "Digital Turbine has been so good to me", "score": 3, "replies": []}, {"body": "Is it a good idea now to invest in the company that is in the later stages of developing a vaccine for covid-19? AstraZeneca", "score": 2, "replies": [{"body": "I wish I had bought Moderna at 59 every day", "score": 2, "replies": [{"body": "I’m new to stocks. Is this a yes?", "score": 3, "replies": [{"body": "If you like it, do it.  They're one of the four biggest pharmaceutical companies in the world.  Just know that they're hyped up for this vaccine.  It could launch, it could tank (very unlikely)", "score": 2, "replies": []}]}]}]}, {"body": "Possible short term stocks (April 2021) to invest in?", "score": 2, "replies": []}, {"body": "Anybody know what's driving $APPS price up?", "score": 2, "replies": []}, {"body": "Welp, so there's going to be no stimulus after all...what's next for the market given that the comments about stimulus combined with the housing market ended up cancelling what seemed like it was probably going to be a bad Thursday last week.", "score": 2, "replies": []}, {"body": "Hi, Im new to options. Can i lose money on a call i sell if it goes negative before it expires and the person who bought it excercises it?", "score": 1, "replies": [{"body": "Are you just buying the call, or did you write it ?\nIf you just bought it, the transaction is simple, buy low, sell higher, profit (or not). If you wrote it, the option might be exercised if close to be in the money, and extra transaction fees might make you lose money, yeah. It can be exercised at any time, ALWAYS have the stocks to cover, since you are new to options.", "score": 1, "replies": [{"body": "Just buying the call thanks", "score": 1, "replies": []}]}, {"body": "Selling a call means your obligated to provide stock at the request of the buyer.\n\nIf you already have that stock no big deal, give them those shares.  Otherwise gotta fetch from open market.\n\nIf you didn't have the shares and now short stock, above all else don't panic.  Just sell puts (think cov call for short).", "score": 1, "replies": [{"body": "Could u check the other reply because u seem to have a different answer", "score": 1, "replies": [{"body": "Your asking about selling a call above and below stating purchasing.\n\n- The buyer pays a debit and for the OPTION to purchase stock at a fixed price (the strike).\n\n- The seller receives a payment for the OBLIGATION to provide stock at a fixed price.\n\n- If the market price is cheaper than strike, it doesn't make sense to exercise the option and it EXPIRES worthless.\n\n- otherwise the seller MUST provide the shares either from inventory or the open market\n\n- since exercising the option is optional it CANNOT be negotiate and has minimum value of 0$", "score": 1, "replies": [{"body": "Ok thanks alot I've been wondering for a while now", "score": 1, "replies": []}]}]}]}]}, {"body": "Hello guys iam fairly new to stocks and i have one question. Lets say i want to buy apple stocks should i wait for it to drop couple of dollars or just buy at the price right now? like i hesitated at 105 dollars and now it is at 115 and now iam a bit angry at myself for hesitating. how do you guys handle things like this. i would love to read your insights because you probably have way more experience with this.", "score": 1, "replies": [{"body": "I’m new too, but from what I’ve gathered it doesn’t matter if you plan on holding the stock for a long time.\nBy buying now might lose money short term, but likewise you might miss out on a ride upwards. In the long term, you can be sure that Apple will go up, and a few dollars won’t matter.\n\nThat being said, Apple is in a dip right now, so now might actually be a good time to invest!", "score": 1, "replies": [{"body": ".... no it isn’t, it was literally 105 a week ago lol, it’s been rising for the last few days fairly consistently", "score": 1, "replies": [{"body": "Look a month back", "score": 1, "replies": [{"body": "Look a month back with quite a few stocks\n\nPost corona spike", "score": 1, "replies": [{"body": "And it has dipped from that spike, no?", "score": 1, "replies": [{"body": "Very little indication it won’t dip again", "score": 1, "replies": [{"body": "How do you know this?", "score": 1, "replies": [{"body": "The natural assumption is that stocks go up and down...", "score": 1, "replies": [{"body": "With that logic it is just as likely that the Apple stock will keep going up, though", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I’m trying to gradually take a large cash position and buy into QQQ and SPY. Had it all in my main IRA in a Fidelity Date fund but wanted to buy on the dips a few thousand dollars at a time. Watching from the sidelines as markets start to rise again makes me wish I had dumped it all in at once. Do you think there will be another downturn which will make my wait the right move?", "score": 1, "replies": [{"body": "Don't play the waiting game. Just do it now.", "score": 3, "replies": []}, {"body": "Sell cash secured puts in the monthly cycle at the strike closest to 32 delta that's evenly dividable by 2.50.\n\nEither your assigned \"on the dip\" or it expires worthless and you repeat.  Both cases pay you to wait.\n\nIf you want to reduce cash held up, then also buy a cheap put.. whatever makes sense and costs around 0.20c", "score": 1, "replies": [{"body": "I’ve got some learning to do.", "score": 3, "replies": [{"body": "https://www.coursera.org/learn/financial-markets-global", "score": 1, "replies": []}]}]}]}, {"body": "Anybody looking at RYCEY? for long term hold?", "score": 1, "replies": []}, {"body": "How do we feel about Draftkings? It just keeps going up.", "score": 1, "replies": [{"body": "I've said \"damn, I missed it\" like 4 times now with it, so if I stay out it'll keep climbing. Enjoy, everyone", "score": 9, "replies": [{"body": "I'll buy you lunch and kiss you on the forehead for this, thank you", "score": 1, "replies": []}]}]}, {"body": "Any advice for Asana? Bought at 29 and now it’s around 26.60.", "score": 1, "replies": [{"body": "The ipo was the other day right?  Don't ride a hype train", "score": 3, "replies": []}]}, {"body": "Can someone please explain to me why NIO is a better pick than either LI or BYD? I'm sure it's been said but I can't find it. The latter two also have strong sales and growth. Just trying to make sure I understand the full picture.", "score": 1, "replies": []}, {"body": "Is NKLA just spiking right now so it can crash harder when GE says no or demands a 25% stake?", "score": 1, "replies": []}, {"body": "I am trying to learn options trading but confused on one idea. Let’s say I bought a put option ($3), the maximum I can lose is the premium ($600). If that’s the case would it be wise to exercise the option if the underlying equity is $5? \nIf this question isn’t meant for this thread, please guide me.", "score": 1, "replies": []}, {"body": "I'm getting really damn tired of NVAX...", "score": 1, "replies": []}, {"body": "Thoughts on $PLTR?", "score": 1, "replies": []}, {"body": "It’s not too late to get aboard the solar 🚂", "score": 1, "replies": [{"body": "which ones you think? i have ICLN", "score": 3, "replies": [{"body": "SUN, TAN", "score": 2, "replies": [{"body": "or you mean sunrun?", "score": 2, "replies": []}, {"body": "why sun? hasnt had a big run like others have", "score": 1, "replies": []}]}, {"body": "I got ICLN too. I’m up 25% and it’s been steady. It’s broader and lower fees so that’s a win for me.", "score": 1, "replies": []}, {"body": "I'm up 25% on BEP in the last 30 days", "score": 1, "replies": []}]}]}, {"body": "Thoughts on NVO ?", "score": 1, "replies": []}, {"body": "i bought SQQQ exactly one week ago. you're welcome everyone.", "score": 1, "replies": []}, {"body": "I can here to shill ICLN and TAN because I just bought some more! At an all time high, too. However I see steady growth ahead...", "score": 1, "replies": []}, {"body": "Have got 23 shares in NIO bought at around €16 a share. Want to buy more, should I buy more straight away or wait for another dip? I am new to trading so go easy on me if this sounds like a really silly question! Want to learn!", "score": 1, "replies": []}, {"body": "Hello", "score": 1, "replies": []}, {"body": "How do you guys dump a penny stock? I have about 15,000 shares of a stock worth .0035 I've tried to sell it at the market price whatever it has been at for the last few days with no luck. It is a minor loss and I do not care about it and would prefer to get rid of it. I bought it about four or five years ago.\n\nAny info greatly appreciated.", "score": 1, "replies": [{"body": "The stock market revolves around buyers and sellers. Unless there is someone in the market who wants to buy your penny stock you are unfortunately stuck with it until someone would buy your position.\n\nThis is one of the reasons penny stocks are risky. You really need to look at the trading volatility in order to see if people are buying or not.", "score": 4, "replies": []}, {"body": "If you really want to get rid of then lower the price say .0034.", "score": 1, "replies": []}]}, {"body": "What stocks do you think with have the highest growth in 2021?", "score": 0, "replies": []}, {"body": "My ipo $POO launches in the morning please upvote for big bull gains with $POO", "score": -6, "replies": []}]}
