{"title": "Global stocks are surging on news that the US President Trump has asked US trade officials to begin drafting a trade agreement with China", "selftext": " \n\n### US Stocks\n\n&#x200B;\n\n* Global stocks are surging to end the week on hopes that US – China trade tensions are thawing \n* US index futures are point to a jump in US stocks on the NY open  with Dow Jones minis +1.20%, S&P500 minis +0.88% and Nasdaq 100  minis +0.18%\n* According to Bloomberg News, US President Trump has instructed US  trade officials to begin drafting a potential trade agreement following a  phone call between US President Donald Trump and Chinese President Xi  Jinping \n* Change in US Nonfarm Payrolls for October will be released later this morning at 8:30am \n* Disappointing new iPhone sales for **Apple (AAPL)** may put a cap on gains in the tech indices this morning – there may be an opportunity to buy **QQQ** this morning if there is a disconnect between the benchmark tech ETF and other major US stocks ETFs like SPY and IWM \n* The VIX is little changed this morning and is currently at 18.65 after closing at 19.34 yesterday\n* **FXI** December 21 OTM Calls, **SPY** November 2 OTM Puts, **EEM** December 21 OTM Calls & Puts, and **HYG** November 16 & January 2019 OTM Puts are the most actively traded options contracts in the US pre-market\n* US 10-Year Treasury Bonds are lower with yields up 3.24 basis points to 3.1627%\n* The US Treasury 2s-10s Spread has widened 0.61 basis points to 0.29%\n* WTI Crude is currently down -2.48% to USD$63.69/bbl with the Brent-WTI spread up USD$2.76 to USD$8.58/bbl\n* Gold is currently little changed 0.17% to USD$1235.48/oz\n\n### Stocks Trending in the News\n\nClick name for Q-Factor breakdown, latest price details, more financial info and sentiment data.  \n \n\n&#x200B;\n\n* **Alibaba Group Holding Limited (BABA)**  shares are trading higher after reporting earnings that largely beat  analyst expectations. Alibaba delivers FY2Q2019 adjusted EPS of  USD$1.40/share, beating consensus estimates of USD$1.06/share by 31%.  Alibaba’s top-line revenue fell just short of analyst forecasts with  FY2Q2019 revenue of USD$12.40bn while consensus forecasts called for  USD$12.45bn. Alibaba management also pulled-back FY2019 revenue growth  guidance by between 4% to 6%. Trump comments on a potential China-US  trade resolution has put a further bid into Chinese stocks. Alibaba is  rated “Neutral” in our China All-Cap Global Top Stock Ideas.\n* **Apple (AAPL)** reported  3Q results that beat expectations but guidance that disappointed.   Following the disappointing guidance, Apple declined more that 5%.   Apple reported 4Q revenue of USD$62.9 billion while 61.44 billion was  expected.  Apple’s 3Q EPS of USD$2.91 beat USD$2.78 expected.  Apple  sold 46.9mn iPhones, 48.4mn was expected.  Apple 4Q outlook, however,  has come at the low end of expectations.  Apple expects 4Q sales of  iPhones, which included the key holiday season, to be 46.9mn units while  the market is expecting 48.4mn.  Notably Apple announced that in the  future it will not report individual sales figures on iPhones, iPads and  iMac sales.  Apple is rated “Attractive” in both our US Large-Cap and  US Information Technology Global Top Stock Ideas.\n* **Caesars Entertainment (CZR)**  reported an unexpected profit of 14 cents per share.  Caesars  Entertainment was expected to report a 1 cent per share loss.  Caesars  Entertainment reported revenue of USD$2.19 billion, in line with  USD$2.21 billion expected.  Adjusted ebitdar was USD$600mn.  Caesars  Entertainment is rated “Unattractive” in both our US Large-Cap and US  Consumer Discretionary Global Top Stock ideas.\n* **CBS Corp. (CBS)**  reported 3Q profit of USD$1.24 excluding some items versus USD$1.22  expected.  CSB saw a 19% jump in tv-show licensing and as sales at its  entertainment unit.  CBS expects a surge in ad sales in the next quarter  with up to USD$250mn in additional ad sales.  CBS is rated is rated  “Unattractive” in our US Large-Cap Global Top Stock Ideas and  “Attractive” in our US Consumer Discretionary Global Top Stock ideas.\n* **Kraft Heinz (KHC)**  reported 3Q adjusted EPS that missed estimates.  Kraft Heinz reported  adjusted EPS of 78 cents while 81 cents was consensus.  Kraft Heinz net  sales came at USD$6.38 billion, consensus was USD$6.31 billion.  Kraft  Heinz saw higher costs weigh in results.  Kraft Heinz is rated is rated  “Attractive” in our US Large-Cap Global Top Stock Ideas and “Top Buy” in  our US Consumer Staples Global Top Stock ideas.\n* **Mahindra & Mahindra (MM IN)**  reported a 17% increase in tractor sales for October.  Mahindra &  Mahindra reported 47,376 units sold versus 39.516 a year ago.  Exports  were 2% of sales.  Mahindra & Mahindra said demand is strong as  festival season approaches.    Mahindra & Mahindra is rated  “Attractive” in our India All-Cap Global Top Stock Ideas.\n* **MGM China (2282 HK)**  surged on news Macau casino revenue rose 2.6%.  Total revenue hit a  record USD$3.38 billion and the sector is reacting positively.  MGM  China is rated “Neutral” in our china All-Cap Global Top Stock ideas.\n* **Mitsubishi Corp (8058 JP)**  increased net income guidance to 640 billion yen but still comes blow  average consensus of 654 billion yen.  Mitsubishi Corp booked a one-time  charge of 55 billion yen for losses related to Chiyoda Corp.   Mitsubishi Corp expects strong growth from its energy business.   Mitsubishi Corp is rated “Unattractive” in our Japan Large-cap Global  Top Stock Ideas.\n* **Rosneft (ROSN RS)** may invite **ExxonMobil (XOM)**  to participate in Far East project called Eastern Petrochemical  according to a report in the local Russian press.  The report outlines a  number of options, one of which is to offer ExxonMobil over 50% of the  project, having ExxonMobil control, to avoid US sanctions.   Blomberg  reports Russian officials mentioned in October that the 2 companies were  talking.  ExxonMobil is rated “Neutral” in our US Large-Cap Global Top  Stock Ideas, Rosneft is rated “Top Buy” in our European SMID-Cap Global  Top Stock Ideas.\n* **Starbucks (SBUX)** posted  results that beat sales expectations in the US.  Starbucks sales in the  Americas rose 4% versus 2.8% consensus.  Starbucks saw 1% growth in  China.  Starbucks reported 4Q EPS of 62 cents while 60 cents was  consensus.  Starbucks is rated “Attractive” in our US Large-Cap Global  Top Stock Ideas and “Top Buy” in our US Consumer Discretionary Global  Top Stock ideas.\n\n \n\n### European Stocks\n\n* **European stocks are advancing this AM** and poised to close the week with the biggest weekly advance since December 2016 \n* The Euro Stoxx 600 is currently up +1.04%, the FTSE 100 is higher  by +0.75%, the DAX has advanced +1.46%, and the CAC 40 has risen +1.3%\n* News that trade tensions between China and the US may be thawing is putting a bid into export-sensitive stocks \n* Eurozone manufacturing PMI dropped to 52.0 for the month of October (final amount) \n* Italian manufacturing shrank for most of October, the greatest negative move in 4 years\n* Investor sentiment for European stocks is positive with the advance/decline ratio for the Euro Stoxx 600 currently at 5.59x\n* Automobiles & Parts (+3.51%), Basic Resources (+2.91%), and  Technology (+2.05%) stocks are the top performers in the Euro Stoxx 600  today\n* Food & Beverage (-0.07%), Health Care (-0.06%), and Utilities  (+0.11%) stocks are the worst performers in the Euro Stoxx 600 today\n* 77 stocks in the Euro Stoxx 600 are at 4-week highs while 8 stocks are at 4-week lows\n* 6 stocks in the Euro Stoxx 600 are overbought while 16 stocks are oversold according to the 16-day RSI Measure\n* VSTOXX, the European stocks equivalent of the VIX, is little  changed this morning and is currently at 18.05 after closing at 19  yesterday\n* EUR€ is currently up +0.316% against the USD$ to 1.1444\n* GBP£ is currently little changed against the USD$ at 1.3029\n* CHF is currently up +0.471% against the USD$ to 1.0026\n* German 10-Year Bunds are lower with yields up 3.3 basis points to 0.432%\n* UK 10-Year GILTs are lower with yields up 3.3 basis points to 1.488%\n\n### Asian Stocks\n\n&#x200B;\n\n* **Asian stocks shot up overnight** following news that US President Donald Trump has asked US trade officials to draft a potential trade agreement\n* The Nikkei 225 finished up +2.56%, the Hang Seng ended up +4.21%,  the Hang Seng China Enterprise up +3.97%, and the CSI 300 was +3.56%\n* The 4%+ jump in the Hang Seng is the biggest one day for the index since CY2015\n* Investor sentiment for Japanese stocks finished positive with the advance/decline ratio for the Nikkei 225 closing at 2.95x\n* 10 stocks in the Nikkei 225 hit 4-week highs while 29 stocks reached 4-week lows\n* 0 stocks in the Nikkei 225 closed overbought while 22 stocks closed oversold according to the 16-day RSI Measure\n* 6 stocks in the Hang Seng hit 4-week highs while 1 stocks reached 4-week lows\n* 0 stocks in the Hang Seng closed overbought while 2 stocks closed oversold according to the 16-day RSI Measure\n* Japan 10-Year Government Bonds are lower with yields up 0.6 basis points to 0.129%\n* JGBs 2s-10s Spread has widened 1.1 basis points to 0.26%\n* JPY¥ is currently little changed against the USD$ at 112.85", "id": "9tjkh4", "created_utc": 1541161133.0, "score": 338, "upvote_ratio": 0.89, "num_comments": 48, "comments": [{"body": "Aaaaaaaaaand it's gone.", "score": 74, "replies": [{"body": "If a trade deal with China doesn't go through then expect prices of everything to go up. The cheap things you buy are pretty much all from China. To import it the importer will need to pay a tariff, and the importer will simply pass on the cost of consumers. This inflation will either force the Fed to increase interest rates (hurting borrowers) or if they don't then the inflation will just hit consumers and hurt their cash flow. Whether it is higher interest rates or inflation (or even worse, stagflation), pain is coming thanks to Donald Trump. ", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 60, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "I also do not think it is real", "score": 2, "replies": [{"body": "If the market is being blatantly driven by speculation than the real numbers are just a mystery. At some point people forgot home to truly evaluate a company from top to bottom. ", "score": 2, "replies": []}]}]}]}, {"body": "Lol this guy's posts tho. He's like 0 and 5. ", "score": 35, "replies": []}, {"body": "[deleted]", "score": 29, "replies": [{"body": "Psyche, actually a dumpster fire.", "score": 11, "replies": []}, {"body": "Think everyone was expecting the NASDAQ to open positive. Instead Apple dragged it down.", "score": 1, "replies": []}]}, {"body": "mmm this aged like a fine cancer", "score": 13, "replies": [{"body": "Kudos, I’m stealing this", "score": 3, "replies": []}]}, {"body": "How does this not count as blatant manipulation ", "score": 19, "replies": []}, {"body": "Nothing like a little market manipulation to help your chances in the elections?", "score": 46, "replies": [{"body": "\"USA makes biggest trade win in the history of the world. Nobody could've done this but me, believe me\".", "score": 28, "replies": [{"body": "\"It just came to me... the idea. I asked and people said...'wow, Mr. President, we didn't think of that, that is a great idea'. I'm surprised we didn't think of it sooner... a big trade deal with China... needed to happen. Great country China, the people are... and Frankly, I'm surprised we didn't come up with it sooner. I asked and everyone said we should have come up with it sooner... we should have come up with it... so that's something... big, big deal... does the stock market love me? Of course they do... I'm on the phone with the stock market and they are like 'save us Mr. President, save us'. But you wont hear that, it won't be reported on, you wont hear a report on that from the fake news media that the president got the deal done. But... Great year we've been having. record employment, stock market is doing so good, just so so good, believe me when you look back you'll be... Just great, great success. Making America great again.\" - Trump, probably", "score": 58, "replies": [{"body": "8.5/10\n\npretty damn solid", "score": 21, "replies": []}, {"body": "So accurate I read that in Trump’s voice, I low how widespread similar comments are.", "score": 7, "replies": []}, {"body": "+u/sodogetip 10 doge ", "score": 1, "replies": []}, {"body": "[deleted]", "score": -13, "replies": [{"body": "How do you feel about him lying to try and manipulate the market? His cabinet just came out and publicly announced Trump didn't ask for any drafts regarding this trade deal with China. ", "score": 8, "replies": [{"body": "[removed]", "score": -5, "replies": []}]}, {"body": "Please explain.", "score": 1, "replies": []}]}]}]}, {"body": "How much impact could this truly have though 4 days before the election.....I feel like people have made their minds now on if they are going to vote and who for.", "score": 8, "replies": [{"body": "Really? Why do you think they run ads the week before the election then? Could it not encourage people to get to the polls as well?", "score": 7, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "Is that why gains are back to square one for 2018?", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "He's referring to the SPX.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Market priced in his untruths.", "score": 3, "replies": []}, {"body": "Pretty much.", "score": 1, "replies": []}]}, {"body": "\"Surging\"... ", "score": 9, "replies": [{"body": "Cracks me up the diction these folks throw around - “surging” means up a little - “plummeting” means down a little - “outrageous” means barely disquieting - “attacking” means someone said something mildly disparaging.  Is it any wonder normal folks don’t believe much of anything reported these days?  \n\nI’m not one to throw around “fake news” except in an ironic way, like when I order my sandwich without mayo and it arrives with mayo and I look around the table and bellow “Faaaake News!”, but yeah, our skepticism on almost any subject is entirely unsurprising at this point.", "score": 3, "replies": []}]}, {"body": "If \"surging\" means \" not surging\" and \"drafting a trade agreement\" means \"returning to the status quo\" then yes, post title is correct.", "score": 9, "replies": [{"body": "I'm assuming it was \"Make a headline for people to use for election\" and nothing is actually happening. I've been trying to get some cheaper stocks o I guess I better start looking.", "score": 1, "replies": []}]}, {"body": "Don't believe it.", "score": 13, "replies": []}, {"body": "My portfolio is surging in the opposite direction.", "score": 2, "replies": []}, {"body": "For comments, please stay on topic (stocks).  If your comment is political then make sure it has to do with stocks, thank you.", "score": 1, "replies": []}, {"body": "Isn't there a 10% tax cut too?\n\nDon't hold your breath.", "score": 4, "replies": []}, {"body": "my SPX PUTs disagree's with this post", "score": 2, "replies": []}, {"body": "Good jobs report and this and strong earnings market still tanking.  He's just trying to do something to pump before election next week.  Clearly didn't work.  I don't think he can say he drove the market way up.  Almost all that has eroded in the last month after months of bull market.", "score": 2, "replies": [{"body": "Feds trying to slow it down - don’t think Trump understood just how little power the potus actually has before he took the job.  I give him points for implementing tax cuts before waging trade war with China (not that I wholly approve of either tactic) but he didn’t factor in them sneaky feds! ", "score": 1, "replies": [{"body": "The Feds are responsible for controlling inflation. Their job is inflation targeting. Trump's trade war will stop imports from coming in (or make it more expensive to come in) therefore raising the cost of everything. More inflation means the Fed must increase interest rates in order to control it. ", "score": 2, "replies": []}]}]}, {"body": "Mine arent. ", "score": 1, "replies": []}, {"body": "Pres day trading again", "score": 1, "replies": []}, {"body": "yeah no", "score": 1, "replies": []}, {"body": "Yep most don’t realize how little the president can actually change.", "score": 1, "replies": [{"body": "Very insightful point.  Not sure how many people realize that the Office of Presidency is really de-fanged.  Congress has much more power...admittedly, can't blame folks for not realizing that since over the past 10 years, very little has been done by Congress!", "score": 1, "replies": [{"body": "And that’s because it’s all the same people in there that have total job security because they can blame the president.  All the while they are being wined and dined by special interests.  Still for whom they are probably only going to make sure are not negatively impacted so they can keep getting the wining and dining.  If people really thought this country was going in such a bad direction the best thing everyone could do is drop party affiliations and vote out incumbents.  Bring some fresh faces to the table.  People in congress have been in there for decades.", "score": 1, "replies": []}]}]}, {"body": "What’s good with drafting a trade agreement when we know either party will sign it", "score": 1, "replies": []}]}
{"title": "AMD Next Horizon Event Scheduled for November 6. Here's a good chance AMD will discuss their upcoming Naples server CPUs and/or 7nm Vega.", "selftext": "[deleted]", "id": "9tkz7c", "created_utc": 1541171716.0, "score": 95, "upvote_ratio": 0.93, "num_comments": 48, "comments": [{"body": "[deleted]", "score": 42, "replies": [{"body": "Why would you be buying anything before the election? The best laid plans of man. ", "score": 14, "replies": [{"body": "Thanks for the crisis. ", "score": 4, "replies": []}]}, {"body": "Where were you yesterday? :(", "score": 3, "replies": []}, {"body": "Sell the news?", "score": 1, "replies": []}]}, {"body": "AMD back to $50", "score": 39, "replies": [{"body": "PLEASE be right!!!", "score": 10, "replies": [{"body": "SERIOUSLY PLEASE BE RIGHT", "score": 7, "replies": [{"body": "There won't be anything relevant on that event. People with money only look on their guidance. And as long as AMD doesn't up their guidance, we won't get close to 25$", "score": 4, "replies": []}]}, {"body": "Price is Right", "score": 1, "replies": []}]}]}, {"body": "The event where they announced Ryzen was called \"A New Horizon\", this one is \"The Next Horizon\" so it will almost certainly say something about Zen 2 in addition to their 7nm enterprise compute cards.\n\nI'm balls-deep in FDs and trying to make back everything I lost on earnings....sigh ", "score": 14, "replies": [{"body": "I'm disappointed that they didn't pun it up with A New HoRyzen or Next HoriZen...\n\n", "score": 4, "replies": [{"body": "That would have been nice but they aren't autistic.", "score": 10, "replies": [{"body": "That might be their problem.", "score": 3, "replies": []}]}, {"body": "Could have named it A New RyzenHo and use the event to announce a new CEO", "score": 1, "replies": []}]}]}, {"body": "Time to dust off that Su shrine", "score": 15, "replies": []}, {"body": "Holding 20 calls at $25.5 11/9. Give it to me baby.", "score": 10, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Strike price is $25.5, contracts were trading at .05.", "score": 8, "replies": [{"body": "When did you buy? How long ago?", "score": 3, "replies": [{"body": "Today at 3:35 PM. ", "score": 11, "replies": []}]}]}]}]}, {"body": "Or it'll be a sell the news event.  I was invested in early 2017 but got out around 13.5ish.  This stock whipsaws like no one's business.", "score": 7, "replies": [{"body": "> I was invested in early 2017 but got out around 13.5ish.\n\nFunny, I invested in early 2017, held through $15, $12, $14, $12, $9, $12, $16, $20, $24, $28, $30, $34, $30, $26 and then I got out.\n\nI doubt the event will be about 7nm (TSMC hasn't made much new noise about 7nm), but rather the 590/680 Polaris 2.0 that's launching. ", "score": 4, "replies": [{"body": ">the 590/680 Polaris 2.0 that's launching.\n\nUnlikely. Its just a dual-chip 580, like the 295 was. \n\nIts likely going to be about the chiplet architecture of Rome, since that is a massive fundamental change in how socketed CPUs are designed and built. We will also likely hear something about Navi as well.", "score": 2, "replies": []}]}]}, {"body": "I'm Jacked to the Naples", "score": 2, "replies": []}, {"body": "How do I profit off of this?", "score": 2, "replies": [{"body": "Buy a call", "score": 4, "replies": [{"body": "In the money? If it goes up, regardless of how expensive the premium is now, it will become more expensive to my advantage?\n\nThe flip side is if it drops out of the money I will lose in multitudes as well?", "score": 1, "replies": [{"body": "Google/YouTube is your friend", "score": 1, "replies": [{"body": "That friend doesn't necessarily tell me if I'm asking the right questions though", "score": 1, "replies": [{"body": "When you buy long call options you have a set risk & unlimited profit potential. This will break it down for you. 1 contract is 100 shares. I'm paying $34 for the contract. My max loss is $34. The shares are $20.30, I break even at $22.34. For every penny above $22.34, I make  dollar.\n\nhttp://imgur.com/fD6wCfq", "score": 4, "replies": [{"body": "Cool. I just bought 1 11/09 $19.50 call at $.59 this morning.", "score": 1, "replies": []}, {"body": "Is there a way to put a stop loss for this on robinhood? I am up 70% on today", "score": 1, "replies": [{"body": "Yes. See what the market price for your option is, say $1.00, then set a stop loss order @ $0.95ish", "score": 1, "replies": []}]}]}, {"body": "Seems like you want to know how options are priced. Maybe ask the Google machine that question", "score": 0, "replies": [{"body": "Yes. I can't place a logical reasoning to this. Is this what understanding the greeks are for?", "score": 1, "replies": [{"body": "Yessir. \n\nReally just need to know Delta, gamma and theta. Implied volatility is also very important for pricing.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Buy me a Ryzen 7", "score": 2, "replies": []}, {"body": "Buy a Money market fund ", "score": 1, "replies": []}]}, {"body": "Pamp it to damp it", "score": 1, "replies": []}, {"body": "HardOCP.\n\nNow there is a name I haven't seen in a while.", "score": 1, "replies": [{"body": "He was all over the news a few months ago for breaking the \"GeForce Partner Program\" story", "score": 2, "replies": []}]}, {"body": "AMD to $10 confirmed because they announce they still arent Intel so MMs wont care", "score": -14, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Probably because people are sniffing around that AMD will announce a 64 core/128 thread behemoth that, at 14nm, Intel simply won't be able to fabricate. And since AMD is basically at par with Intel for speed, and Intel has no 10nm process, and no 7nm process, and no UEV, and no CEO...", "score": 0, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Okee... you go buy that i9900 (passmark benchmark 20402) that you cannot get instead of the 2990wx (passmark benchmark 24049) and do your heavy lifting. What heavy lifting are you doing, btw? Genuinely curious.\n\nhttps://www.cpubenchmark.net/cpu.php?cpu=AMD+Ryzen+Threadripper+2990WX&id=3309\n\nhttps://www.cpubenchmark.net/cpu.php?cpu=Intel+Core+i9-9900K+%40+3.60GHz&id=3334", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Fucking druggie.", "score": -1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Let me slow this down for you: fuck. ing. drug. ie.", "score": 1, "replies": []}]}]}]}]}, {"body": "Ah come on, don't run away like a little bitch. Tell me all about your heavy lifting.", "score": 0, "replies": []}]}]}]}]}
{"title": "Finally had a good week. SPY plays + FB & AAPL earnings plays!", "selftext": "", "id": "9totvh", "created_utc": 1541197809.0, "score": 102, "upvote_ratio": 0.88, "num_comments": 52, "comments": [{"body": "Fuck you. Been day trading all week. Bull flags, ABCD patterns, reversals, bottoming tails - it's all crap. I just buy or short something and it goes the other way. ", "score": 22, "replies": [{"body": "Me too my dude. Still down 8k. But sometimes it gets better ", "score": 20, "replies": [{"body": "Over the last 2 years I'm down something like 10-12k. At one point I had 1500 shares of Canopy growth at $15. Sold at $12. It's now trading at $50. I'm so bad at this.", "score": 19, "replies": [{"body": "It’s really hard. If it makes you feel better I lost that 8 grand in 6 months... I only put like 10% into a trading account now ", "score": 8, "replies": [{"body": "It is. Every time I hear one of my millennial friends talk about how \"the 1%\" just park money in the stock market and steal everyone's lunch, I want to punch them in the face until they die. \n\nGood luck brother. Remember, a winner is just a loser that didn't give up. ", "score": 9, "replies": [{"body": "Yep. As long as you learn when you lose and don’t bet it all you can still win. Thanks. Right back at ya!", "score": 4, "replies": [{"body": "Is this some kind of pep rally", "score": 2, "replies": [{"body": "Trading is hard. Gotta keep up each other’s spirits!", "score": 8, "replies": [{"body": "You get an upvote ", "score": 3, "replies": []}]}]}]}]}, {"body": "Lol, I lost 8k in 2 days. T\\_T", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Marijuana stocks seem over the hill to me, but what the fuck do I know? That's what I would have told you back in 2017 when I sold 1500 shares of WEED for a loss.", "score": 1, "replies": []}]}]}]}, {"body": "sorry I’m a 19 year old hedge fund manager and have no fucking clue what those are", "score": 1, "replies": [{"body": "Lol how much is your firm even worth old man, i'm fucking 18 and have a $2 trillion valued investing firm.", "score": 1, "replies": []}]}]}, {"body": "pm me next time you buy something\n\n&#x200B;", "score": 38, "replies": [{"body": "I think you can follow accounts now? Maybe \n\nEdit: I meant on reddit.", "score": 7, "replies": [{"body": "[removed]", "score": 10, "replies": [{"body": "News to me as well.", "score": 2, "replies": []}]}, {"body": "I googled it and found nothing. This would be a killer feature. If you can, how?", "score": 2, "replies": [{"body": "agreed. Meant on reddit though.", "score": 1, "replies": []}]}]}, {"body": "Here's a detailed trade log for the week!  \n\n\n[https://docs.google.com/spreadsheets/d/10hqcz-fLSAGoyNlvTQekmkLRKWMRSrXT4BjnUMdwBXU/edit?usp=sharing](https://docs.google.com/spreadsheets/d/10hqcz-fLSAGoyNlvTQekmkLRKWMRSrXT4BjnUMdwBXU/edit?usp=sharing)", "score": 2, "replies": [{"body": "Nice! I was totally kidding but I appreciate the intel. Good luck!", "score": 1, "replies": []}]}]}, {"body": "Well done. Treat yourself to some tendies.", "score": 9, "replies": [{"body": "Going to donate like $100 to random twitch streamers. yolo", "score": 2, "replies": []}]}, {"body": "How do you get the green theme?", "score": 14, "replies": [{"body": "Don’t worry. If you zoom out it’s very, very red :) (down like 8.5k for the year)\n\nLoss pron. https://imgur.com/a/6mRXISJ\n\nAll my trading accounts are net +17k for the year ‘doh \n\nThose vertical cliffs are why amazon fds are not in fact FREE MONEY\n\nLesson learned this week is just do your fucking research and don’t buy OTM faggies", "score": 19, "replies": [{"body": "So....what do you buy", "score": 3, "replies": [{"body": "Dunno yet. The hard lesson I’ve learned is that most of trading is in the waiting and researching. I lost money when I tried to jump from one thing to the next like a machine gun. \n\nI put 10% into SPY puts this afternoon due to technicals and uncertainty due to midterm elections. We’ll see how that goes. ", "score": 3, "replies": [{"body": "VXX here. I’ve got a straddle for next week. Sold itm puts this morning took profit and bought calls. Sold at dip this afternoon and bought straddle for next week", "score": 1, "replies": []}]}]}, {"body": "But ATM faggies are still cool, right?", "score": 1, "replies": []}]}]}, {"body": "Did you short apple?", "score": 2, "replies": [{"body": "Yep. Went with the safer 11/16 215 P and sold at open today. (Only 50% of account on this trade)\n\nFB was one 134 11/2 C (so all in with the account after losing about $600 on OTM FDs that I swapped to ITM)", "score": 4, "replies": [{"body": "Shorters are scum. ", "score": 0, "replies": [{"body": "Investopedia short selling. It’s important to the market", "score": 3, "replies": [{"body": "You weren't short selling anything, you were buying puts. It's just that the dude on the other end of your contracts is a little less rich now.", "score": 1, "replies": [{"body": "I understand. Just explaining it regardless. ", "score": 2, "replies": []}, {"body": "I understand. Just explaining it regardless. ", "score": 1, "replies": []}]}]}, {"body": "Daddy Musk?  Is that you?", "score": 5, "replies": []}]}]}]}, {"body": "r/oddlysatisfying perfect straight lines and corners", "score": 2, "replies": []}, {"body": "My AAPL calls reduced me to $200 how do I come back to the living?  Is it even possible?", "score": 2, "replies": [{"body": "Sure. Make well researched plays on a broad index like SPY. I did that when I was down and it was easier to predict than individual companies. ", "score": 2, "replies": [{"body": "So, buy AMZN because it's the economy and diversified into every industry?", "score": 2, "replies": []}]}]}, {"body": "so thats where all my money went :(", "score": 2, "replies": []}, {"body": "[Click Here to Vote to Remove this Submission](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=9totvh&message=9totvh) if it breaks the rules, is spam, or ought to be a comment in the Daily Discussion thread.\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=9totvh)\n___\n ^comment ^will ^disappear ^--- ^143 ^shitposts ^removed ^this ^session ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "score": 1, "replies": []}, {"body": "Good job man. October almost killed us but we're still surviving. Hopefully, after the election, FOMC meeting, & G-20, we'll moon.", "score": 1, "replies": [{"body": "Thanks! Doesn’t matter which way the market goes as long as the volatility isn’t too random ", "score": 1, "replies": []}]}, {"body": "I lost around your entire portfolios worth today :,) ", "score": 1, "replies": [{"body": "I lost about 4K in two weeks a month ago. Just learn and keep trying. And maybe diversify :)\n\nBack a year ago at my peak I think I lost 30 grand in profits in a week", "score": 3, "replies": []}]}, {"body": "Up 1,800 for the week down 12k for the year. ", "score": 1, "replies": []}, {"body": "Good work! Keep us posted on your plays", "score": 1, "replies": []}, {"body": "God, I miss seeing green.", "score": 1, "replies": []}, {"body": "You better remind your friend quick otherwise you might lose those tendies", "score": -1, "replies": []}]}
