{"title": "Warren Buffett buys JPM and BAC.", "selftext": "As interest rates go up again next year, banks will be able to make more money. Their current PE and next year expected PE indicate they are undervalued.\n\n&#x200B;\n\n[https://finance.yahoo.com/news/warren-buffett-buys-jpmorgan-shares-ramps-bets-financials-212128233.html](https://finance.yahoo.com/news/warren-buffett-buys-jpmorgan-shares-ramps-bets-financials-212128233.html)", "id": "9x4yps", "created_utc": 1542234814.0, "score": 67, "upvote_ratio": 0.9, "num_comments": 55, "comments": [{"body": "More interesting fact is that he cashed out on Walmart!", "score": 46, "replies": [{"body": "why not? that's what he does. he takes profits and then dump them in beaten up stocks! rinse and repeat :)", "score": -7, "replies": [{"body": "No he doesn't. ", "score": 24, "replies": [{"body": "You’re telling me some reddit user hasn’t figured out Buffets strategy", "score": 10, "replies": []}, {"body": "agreed he doesn't do that with his coca cola stocks. That's one thing he will hold forever.", "score": 1, "replies": []}, {"body": "Oh he doesn’t? ORCL says hi... 👋🏼", "score": 1, "replies": []}]}]}]}, {"body": "AAPL and Oracle too for all you people who lost money in tech lol", "score": 22, "replies": [{"body": "I *knew* he'd get into Oracle sooner or later. It has all the checkmarks for an investment from buffett", "score": 11, "replies": [{"body": "Would you be able to elaborate? I was a bit surprised but I didn’t look go look at Oracles financials. I guess a lot of Java in tech, do they have a moat? \n\nPE ratio really high. ", "score": 2, "replies": [{"body": ">do they have a moat?\n\nOracle is the quintessential example of \"high switching costs.\" Meaning once a customer has an Oracle database, they're extremely unlikely to switch due to price increases. ", "score": 8, "replies": []}, {"body": "Eh it's only 17x. They have a dividend, competitive advantage etc... ", "score": 4, "replies": [{"body": "17 isn't high for a pe", "score": 3, "replies": []}, {"body": "My bad. I think I was looking at the wrong company on pe ", "score": 1, "replies": []}]}]}]}]}, {"body": "Disclaimer- these sales happened end of Sept- when the world was not on fire!", "score": 9, "replies": [{"body": "How is the world on fire now?", "score": 1, "replies": []}]}, {"body": "Interesting to see if he has any plans for his stakes in Wells Fargo. The stock has underperformed and been plagued with scandals, both things Buffett hates seeing amongst his businesses/holdings. I went to the most recent annual shareholder meeting last May and he sort of gave a cliche response when asked about Wells Fargo, saying he had faith in its leadership and that it was a good company from a business standpoint going through a tough time. He didn’t exactly seem energetic about it and was fairly short in his answer which is usually the opposite of what he does when he provides insight or answers questions. It reminded a lot of how a politician would answer a question which I didn’t like (this is coming from an absolute Buffett fan boy too).", "score": 7, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I was speaking on a more broader sense. WF is one of his largest holdings so was more curious if he makes any significant changes on that end to a greater extent. 2% is a relatively small move, even thought its still millions and millions of dollars in action. More curious if he’ll slowly sell off shares over the years, sell off in “bigger” chunks, or more or less stay put. He’s limited in how much he can sell between regulations and not tanking it if shareholders view it as a lack of confidence.", "score": 5, "replies": []}, {"body": "US regulations keep BRK from owning more than 10% of a bank before getting hit with some severe restrictions, so BRK is constantly shaving their WFC to keep it below 10%. \n\n(Share buybacks keep increasing BRK's % ownership.)", "score": 3, "replies": []}]}]}, {"body": "Is this good or bad for Citigroup? I mean it's in the sector so that's good, but he didn't put his money there so...", "score": 3, "replies": [{"body": "Buffet has never liked Citi. I’m not sure why. Maybe because they are a bit more global than the other banks, making them more exposed to risk. But if he is heavy in banks, i think it’s good for the sector as a whole. ", "score": 3, "replies": []}, {"body": "Not even sure if it’s good for JPM and BAC. ", "score": 0, "replies": []}]}, {"body": "He buys a lot of stocks that go down. He makes his money buying out companies, fully buying them, then running them cheap. ", "score": 10, "replies": [{"body": "This. ", "score": -3, "replies": []}]}, {"body": "was he required to announce ownership do to the % of shares?  if so, i would sell into any near-term strength.  i've lost a lot money on trades after he announced ownership.  not saying that will happen with jpm or bac, but it is something to keep in mind when trading berkshire/buffett stocks.", "score": 3, "replies": [{"body": "The announcement was a Regulation Fair Disclosure(Reg FD) requirement. But JPM is the best performing money center bank and BAC is not doing that bad in a time when money center banks have seen slowing loan growth. The loans have instead been going to direct lending for a while.", "score": 3, "replies": []}]}, {"body": "Buffett must expect the interest rates to continue to climb.... benefiting the banks just wonder how long the show will last.. ", "score": 1, "replies": []}, {"body": "remember before 08 when Buffett bought those Irish banks and then lost 89% on them? \n\nInterest rates are going lower not higher next year mark this post. Buffett has no idea what he is doing in the short term. ", "score": -12, "replies": [{"body": "If you're trying to judge someone's investment style, or create your own, don't use an extreme case like the 2008 housing crash as a data point. \n\nThere were houses being sold for esentially free after the crash but you don't see me telling that to my realtor when trying to buy a house. \n\nAlso, from what I know from Buffett's book, he like to invest long term and he gets in when he thinks it right and benefit in the long run. It all goes back to the fact that time in market is what gets you consistent results. \n\nSorry kid. On this sub, you won't get away with insulting a billionaire who made money from stocks.", "score": 8, "replies": [{"body": "Mark this post come talk to me about buffetts bet here on banks and Apple in 6 months.\n\nBuffett doesn’t get short term moves right. Growth is slowing in rate of change terms, the spread between 10’s and 2’s are tightening and banks saw profits increase on cost cutting (firing people and closing branches). \n\nJPM is a momentum stock so is Apple. These stocks will perform horribly as growth continues to slow in rate of change terms.\n\nAnd don’t call me kid. \n\n", "score": 0, "replies": [{"body": "I'll give you that I shouldn't have called you a kid. I have no idea how old you are.   \n\n\nYou said, \"Buffett doesn't get short term\\[*sic*\\] moves right.\" But that's the thing, he invests for the long term. His investment strategy is that he invests in \"good companies\" and only sells if he needs to or thinks buying back later would be a good idea. Growth slowing down doesn't matter to him. He is looking at the average rate of return over a long period of time. If he thinks JPM and Apple are going to last, he will buy them. It doesn't matter if they are going down in the short term(even though he could get a better deal he cares more about time in the market).  \n\n\nYou also said, \"banks saw profits increase on cost cutting.\" Think about that for a while. How else would businesses increase profit? There are only two ways: increase margins or cut costs. Let's say had an ice cream stand, and you hired your cousin to sell ice cream at a different location. If he costs about $100 per day but only makes about $50, you would make a profit by letting him go (very simplistic example but you get the point. Bad Store=Closed Store).   \n\n\nLook, I'm not saying you're wrong about Apple and JPM being momentum stocks. Frankly, I have no idea and I don't care either way. The fact of the matter is, that's not why Buffett is investing in them. And, using 2008 as an example for anything besides examples of what not to do, is just plain wrong. ", "score": 1, "replies": [{"body": "Did you read the post you are responding to. You just agreed with a lot of what I said. OP posted about what’s going to happen next year I was simply responding to OP about following Buffett for what’s going to happen next year is stupid and he will likely be wrong. People do this all the time they assume Buffett is always right and end up losing a ton of money because they don’t have the same time horizon and Buffett is horrible at short term and timing the market. ", "score": 0, "replies": []}]}, {"body": "Kid, 6 months is too short to judge", "score": 1, "replies": [{"body": "So judge me on it. Come back in 6 months. My point was simple Buffett is often wrong in the short term. He has been and will continue to be on his JPM trade ", "score": 1, "replies": []}]}]}]}, {"body": "You’re using buffets investments during a recession as evidence of his poor investing.  \n\nThat’s literally how and when he’s gotten rich. \n\nUsing his bull markets moves would be a better argument, but then your argument would be still absolutely wrong. ", "score": 2, "replies": [{"body": "No I’m using his investments before a recession. We aren’t in a recession now.", "score": 1, "replies": [{"body": "He’s made most of his money during recessions. ", "score": 1, "replies": [{"body": "We aren’t in a recession. I don’t get your point ", "score": 1, "replies": []}]}]}]}, {"body": "If this is true, why is it downvoted?  The oracle of Omaha obvisouly doesn’t bat 1000", "score": 0, "replies": [{"body": "No one does. \n\nNo, but keep telling yourself the best investor in American history doesn’t know what he’s doing. It is in fact YOU who has the proven track record....\n\nSome of these posters hubris is about to catch up with em and, personally, I can’t hardly wait. ", "score": 3, "replies": [{"body": "How about this.  He’s good simply because he’s so rich and can dictate the terms  of his investments.  \n\nI’m like 70% cash until the corrections occurs.  My hubris is going to let me continue buying shares on the cheap and making % gains it takes Warren will never hit. Yes I know it’s because he’s so large it’s almost impossible for him. ", "score": -1, "replies": [{"body": "There was a time he wasn’t a billionaire. He has a track record likely 3 times the span of your life to back up his dominance. \n", "score": 1, "replies": [{"body": "Buffets father was a businessman, investor and politician. He was trading stocks at like 14 and had every resource available for him to succeed.  I’m a son of a couple of broke immigrants who are lucky to not retire in poverty. Between the age of 31 and 34 turned 200 grand into 4 million. So you know what, stop worshipping someone who had a golden spoon shoved down his throat his whole life and go out and get yours. ", "score": 0, "replies": [{"body": "I’m not worshiping anyone. I’m stating factual points that you don’t seem to accept, but instead play the fake contrarian by “putting Warren in perspective”. \n\nHe is a better investor than you and is one of the best, if not the best, investor in American history.  He is also one of the richest people in human history from purely investing.  This is a very difficult feet. Take a look at the list of richest people, most, if not all, started a company that sold a “product”. To do what Warren has done, regardless of his starting position, is remarkable.  The fact that you want to couch his success into privileged is comical.  \n\nIf you want to get the yard stick out we can. I’ve done better than you with less and also come from an, very obviously, poorer immigrant father. \n\nYou’ve done real well man. Seriously. But that doesn’t mean Warren isn’t arguably one of the best investors of all time for real reasons. ", "score": 0, "replies": [{"body": "Go read the book “outliers” which will give you some perspective on why someone like buffet is successful. While yes he’s good, the defining factor of his success is being born in the right place at the right time and capitalizing on it.  Similarly to how Jobs or Gates were raised in Seattle at the beginning of the tech boom and they capitalized on it.  He has completely ignored  the single largest sector of growth of the last 25 years which is tech. Why? because he doesn’t understand it. This throws the theory that he’s the greatest investor ever seriously into question.  Apple at 90 was already a value play and the only reason he made a ton fuck of money it is because he put a ton fuck of money in it. After buying it he made some press releases about owning it which itself moves the stock.  You would really have to try hard to fail if you wield that much power and influence not succeed. \n\n", "score": 1, "replies": [{"body": "I’ve read the book.   You bringing it up shows the pseudo-intellectual contrarian you’re attempting to be. \n\nYou really just don’t understand it.  PLENTY of people were born in his situation. Plenty did very well, but nearly none are billionaires due to purely investing. \n\nNot plenty of people were born and had access to what Computers Gates had. \n\nYou blame too much on context. If he was relatively successful; a good lawyer, politician or just a wealthy guy, sure....it’s much to do with his privilege. \n\nHe is revered for a reason.  There’s a reason the US government came to him during 2008.  There’s a reason he’s the richest pure investor in world history. \n\nI’m not here circle jerking him,he has his faults and shouldn’t be listened to all the time as it depends on your priorities and values, but I’m certainly not going to be part of the new circle jerk that is overly contextualising everything widdeling everything down to nothing.  I get it, you know some things and think you can explain away why Warren is more successful in investing than any other human.  Congrats. \n\n", "score": 0, "replies": [{"body": "I don’t think we’re going to agree here.  Simply put, if WB was born today, or to a less affluent family do you think he would have the same success ?  I think the answer is no, you seem to think it’s yes.   \n\nThe example you give of the government coming to him for help, this gives him advantages you and I don’t have. He gets to set the conditions of the deal he makes.  It’s like being in a race where everyone is in a bicycle and you’re in a Ferrari. Its possible you crash and lose but 999 times out 1000 you’re going to come out ahead. \n\nBtw im enjoying this exchange, I’m not just disagreeing for the sake of being a contrarian. ", "score": 0, "replies": [{"body": "He was born when he was, along with millions of other people and into a family that was upper middle with some connections in NEBRASKA.  He’d likely be “less” successful today, as American is growing slower, but perhaps a buffet born in 2001 would be tech savvy and would debunk all your “context”. \n\nKeep telling yourself it has to do with Warrens timing, parents and legs up in life, basically his privilege.  Or, you know, you could try to deeply understand his values and priorities to see what insights you could gain to inform your investments.  \n\nIt’s like not respecting Gates because he had access to the computers he did and his parents were well off.  Or scapegoating Jobs to a rich kid who grew up in Silicon Valley before it was SILCON VALLEY. \n\nIt’s ok to admit some people are just extremely good and indeed better at things than others all while taking advantage of the situations they were in, regardless.  \n\nEdit:  that’s fair, and I am too. I like a real debate and actually appreciate the points your bringing up.  Know what the truth is?  Somewhere right in the middle of our two perspectives. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Ofcourse he get help from family but most of job he made this self 13 years old he was makeing more money like this teachers . Ofcourse he was able to buy stocks free with no fee charge by this father  but fact is he was working hard after school before school and was saveing every penny .  ", "score": 0, "replies": [{"body": "You’re naive if you actually believe that his early succes if from pinching pennies at the age of 12.  I bet you think he drinks a Coca Cola with every meal too. ", "score": 0, "replies": [{"body": "Age of 13 he was makeing more moeny like this teachers so he is very clever guy not like you or me , ", "score": 1, "replies": [{"body": "Because his father was an investments banker.  I think I’m pretty smart, don’t beat yourself up too much. ", "score": 1, "replies": [{"body": "Yes you right anyway buffet start investing in best time now days imposible to grow investment so fast :)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "It's a stupid comment really. It's like saying remember when Michael Jordan missed that one shot? Well who cares? He even outperformed sp500  during 2008, despite this one random misstep. I think the Irish banks were a really small percent of all his purchases that year, he spent around 200 million on them. He made a killing on his overall purchases of banks during that time.", "score": 1, "replies": [{"body": "No it’s using a macro overlay to predict a short term bad trade by Buffett which even Buffett would agree he doesn’t get the short term right. Problem is people assume because Buffett buys something it will only go up. He has a much longer time horizon than people here and a bigger risk tolerance. Blindly following him here is a fools game and will cause people to lose money. ", "score": 1, "replies": []}]}, {"body": "It is true. Buffett is horrible at the short term market timing. He also doesn’t do a good job predicting market corrections. \n\nThe reason I’m downvoted is because no one here understands the market and they see Buffett make a bone headed trade (in the short term) and assume he will be right, and they end up losing their ass if their time frame is different. \n\nhttps://www.cnbc.com/id/29441086", "score": 1, "replies": []}]}]}]}
{"title": "Daddy Buffets New Buys and Sells", "selftext": "**New Stakes**\n\nJPMorgan Chase & Co. (NYSE: JPM) new 35,664,767 share position\n\nOracle Corp. (NYSE: ORCL) new 41,404,791 share position\n\nPNC Financial Services (NYSE: PNC) new 6,087,319 share position\n\nThe Travelers Companies Inc. (NYSE: TRV) new 3,543,688 share position\n\n**Raised Stakes**\n\nApple Inc. (NASDAQ: AAPL) raised from 251,955,877 shares to 252,478,779 shares\n\nBank of America Corp (NYSE: BAC) raised from 679,000,000 shares to 877,248,600 shares\n\nBank of New York (NYSE: BK) raised from 64,800,376 shares to 77,849,476 shares\n\nDelta Air Lines (NYSE: DAL) raised from 63,665,840 shares to 65,535,000 shares\n\nGeneral Motors (NYSE: GM) raised from 51,393,611 shares to 52,461,411 shares\n\nGoldman Sachs Group (NYSE: GS) raised from 13,254,490 shares to 18,353,635 shares\n\nU.S. Bancorp (NYSE: USB) raised from 100,693,874 shares to 124,923,092 shares\n\n\n**Lowered Stakes**\n\nAMERICAN AIRLINES (NASDAQ: AAL) lowered from 44,700,000 shares to 43,700,000 shares\n\nCHARTER COMM-A (NASDAQ: CHTR) lowered from 7,504,185 shares to 7,340,985 shares\n\nLiberty Media Corporation (NASDAQ: LSXMA) lowered from 31,090,985 shares to 14,860,360 shares\n\nPhillips 66 (NYSE: PSX) lowered from 34,729,514 shares to 15,433,024 share\n\nSouthwest Airlines (NYSE: LUV) lowered from 56,547,399 shares to 56,047,399 shares\n\n\nUNITED CONTINENTAL HOLDINGS, Inc. (NASDAQ: UAL) lowered from 26,684,542 shares to 25,984,542 shares\n\nWells Fargo (NYSE: WFC) lowered from 452,013,758 shares to 442,361,700 shares\n\n\n\n**Liquidated Stakes**\n\nSANOFI (NYSE: SNY) liquidated\n\nWal-Mart Stores (NYSE: WMT) liquidated\n\n**Maintained Stakes**\n\nAmerican Express Co (NYSE: AXP) maintained 151,610,700 share stake\n\nAxalta Coating Systems (NYSE: AXTA) maintained 24,264,000 share stake\n\nThe Coca Cola Company (NYSE: KO) maintained 400,000,000 share stake\n\nCostco Co. (NASDAQ: COST) maintained 4,333,363 share stake\n\nDaVita Inc. (NYSE: DVA) maintained 38,565,570 share stake\n\nJohnson & Johnson (NYSE: JNJ) maintained 327,100 share stake\n\nKraft Heinz (NASDAQ: KHC) maintained 325,634,818 share stake\n\nLIBERTY GLOBAL -A- (NASDAQ: LBTYA) maintained 19,791,000 share stake\n\nLIBERTY GLOBAL -C- (NASDAQ: LBTYK) maintained 7,346,968 share stake\n\nLiberty LiLAC (NASDAQ: LILA) maintained 2,714,854 share stake\n\nLiberty Latin America (NASDAQ: LILAK) maintained 1,284,020 share stake\n\nLiberty Media Corporation (NASDAQ: LSXMA) maintained 31,090,985 share stake\n\nM&T Bank Corp. (NYSE: MTB) maintained 5,382,040 share stake\n\nMastercard Inc. (NYSE: MA) maintained 4,934,756 share stake\n\nMondelez International (NASDAQ: MDLZ) maintained 578,000 share stake\n\nMoody's Corp (NYSE: MCO) maintained 24,669,778 share stake\n\nProcter & Gamble (NYSE: PG) maintained 315,400 share stake\n\nRestaurant Brands (NYSE: QSR) maintained 8,438,225 share stake\n\nSIRIUS XM HLDGS (NASDAQ: SIRI) maintained 137,915,729 share stake\n\nSTORE Capital (NYSE: STOR) maintained 18,621,674 share stake\n\nSynchrony Financial (NYSE: SYF) maintained 20,803,000 share stake\n\nTEVA PHARMACEUTICAL INDUSTRIES (NYSE: TEVA) maintained 43,249,295 share stake\n\nTorchmark Corp. (NYSE: TMK) maintained 6,353,727 share stake\n\nUSG CORPORATION (NYSE: USG) maintained 39,002,016 share stake\n\nUnited Parcel Service (NYSE: UPS) maintained 59,400 share stake\n\nVerisign Inc. (NASDAQ: VRSN) maintained 12,952,745 share stake\n\nVerizon Communications (NYSE: VZ) maintained 928 share stake\n\nVisa Inc. (NYSE: V) maintained 10,562,460 share stake\n\nWed, 14 Nov 2018 16:13:00 -0500\n\nCopyright (c) 2018 StreetInsider.com", "id": "9x4cwx", "created_utc": 1542230873.0, "score": 100, "upvote_ratio": 0.97, "num_comments": 52, "comments": [{"body": "I want to see screenshots of his Robinhood account. ", "score": 139, "replies": [{"body": "Oh, what a wonderful morning. I got my coffee, just let my dog out. Let me just sit down here at my dining table and open up Robinhood and check my market open performance. Yep, looks good. Hmm, maybe I should adjust some of my positions based on this volitility.", "score": 25, "replies": [{"body": "He should post loss porn if he goes to -90%", "score": 10, "replies": []}]}]}, {"body": "[deleted]", "score": 56, "replies": [{"body": "Looks like dividend reinvestments to me. ", "score": 32, "replies": []}, {"body": "PAPA BLESS 😚🙇‍♂️🙏", "score": 16, "replies": []}]}, {"body": "God damn at the WMT liquidation, wonder if this becomes a headline tomorrow after their earnings..", "score": 25, "replies": [{"body": "Dude it's gg tomorrow for Walmart if they tank earnings too. Maybe 15-20%", "score": 23, "replies": [{"body": "At face-value interpretation of Black Friday ads, it looks like all retail and e-tail are racing each other to the bottom for Black Friday deals, opening earlier, lowering prices, and offering free 2-day shipping.\n\nI wonder if this has already been priced-in to their next quarter ER profits.", "score": 8, "replies": [{"body": "It probably has, but we'll see in their guidance and whether or not they mention tariffs. I have puts so hopefully they lower guidance and blame gyna. The Buffett liquidation is just icing on the cake.", "score": 4, "replies": []}, {"body": "This happens every year tho", "score": 1, "replies": []}]}, {"body": "I don’t think the market would like that too much... especially with NVDA being the last thing to prop it up before SPY $255 LOL", "score": 4, "replies": [{"body": "If spy hits 255... I might have to work from home because my erection will not dissipate.", "score": 8, "replies": [{"body": "I’m holding $265P faggies for next week.. trying to not hold onto next week... cmon fuckin NVDA and WMT, suck for me", "score": 3, "replies": []}]}, {"body": "Bringing back the slogan \"Always Low Prices\" haha", "score": 5, "replies": []}]}, {"body": "And brk will probably be buying at -20% ", "score": 2, "replies": []}]}, {"body": "Smells like puts is in the air", "score": 1, "replies": []}]}, {"body": "No MU?  Man if Papa B is avoiding it, maybe we should too ^(just kidding ha... maybe not)", "score": 20, "replies": []}, {"body": "Holy shit he went in on $JPM and $BAC", "score": 27, "replies": [{"body": "Anticipating sector rotation out of tech/retail into financials?\n\nEither way, shorting financials is a good position for Q3/Q4 2019 when corporate and consumer debt defaults like falling dominoes.\n\nEdit: I forgot, Buffet doesn't try to time the market, so his new/re-upped positions are for gains years down the road.", "score": 15, "replies": [{"body": "Yeah he’s all about long term and dividends. Banks don’t have insane growth but they are fairly steady and with the Fed allowing them to increase buybacks and dividends.", "score": 13, "replies": [{"body": "Until fucking Maxine Waters blows shit up.", "score": 0, "replies": [{"body": "IM🅱️EACH FAWTY FIVE", "score": 12, "replies": [{"body": "SHE HAD THE BRAIDS FROM ATLANTA\nSHAKIN HER HAS, HANNAH MONTANA!\nGUCCI GANG GUCCI ", "score": 1, "replies": []}]}, {"body": "That’s true, fuck that bitch.", "score": 5, "replies": []}, {"body": "Wtf cheapshot bro if you're gonna talk smack to the Water Attack at least have the CA-JONES to back that ass up ;) ", "score": -2, "replies": []}, {"body": "How much harm can she really do with a republican senate there to sink anything she proposes? ", "score": -3, "replies": [{"body": "She can do fuck all", "score": 1, "replies": []}]}]}]}, {"body": "Higher interest rates mean higher profits for banks. ", "score": 0, "replies": [{"body": "But less customers asking for loans broski", "score": 6, "replies": []}]}]}, {"body": "I remember back in 2008 he picked up a huge position in BAC when it was like $12 and everyone was wondering why buy banks during financial meltdown. BAC doubled in a few years", "score": 9, "replies": [{"body": "He pretty much saved them.  They created a special dividend for him and gave him a ton of preferred shares iirc.", "score": 7, "replies": []}]}]}, {"body": "Wow. This is cool", "score": 12, "replies": []}, {"body": "Great work op", "score": 8, "replies": []}, {"body": "Just for perspective:\n\nThat's $23,869,934,406.00 of BoA shares \n\nProducing dividends of: $526 million annually.\n\nWhat the fuck are we doing...", "score": 10, "replies": [{"body": "wtf. why even play stocks anymore just chill all day", "score": 6, "replies": [{"body": "It's just a game to him, a game he loves playing. There can be no other reason at this point. ", "score": 4, "replies": []}]}]}, {"body": "Nice. ", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "But Oracle???", "score": 2, "replies": []}]}, {"body": "Daddy Buffet buying bank stocks?\n\nThat sounds, dangerous.", "score": 4, "replies": [{"body": "Daddy Buffet bailed BOA out in 2009. This ain't the first time he's fucked with them.", "score": 6, "replies": [{"body": "He also invested in Wells Fargo when they were going through their scandal. He knows what happens during times of chaos; reform.", "score": 4, "replies": []}]}]}, {"body": "Where do you get this info?", "score": 2, "replies": [{"body": "13f filing through Edgar. \n\nhttps://www.sec.gov/Archives/edgar/data/1067983/000095012318011885/0000950123-18-011885-index.htm", "score": 2, "replies": [{"body": "How did he calculate those numbers? What form and row?\n\n&#x200B;", "score": 3, "replies": [{"body": "Sorry just saw this response. Here's the most recent filing (11/14):\nhttps://www.sec.gov/Archives/edgar/data/1067983/000095012318011885/xslForm13F_X01/form13fInfoTable.xml\n\nHere's the previous filing (8/14):\nhttps://www.sec.gov/Archives/edgar/data/1067983/000095012318008866/xslForm13F_X01/form13fInfoTable.xml\n\nDifferences are buys/sells. Hope this helps!", "score": 3, "replies": []}]}]}]}, {"body": "All in on FAS then... (3x leveraged finance ETF)", "score": 2, "replies": []}, {"body": "GM to the moon\\~ ", "score": 1, "replies": []}, {"body": "I really don’t think Warren is doing too much these days. I can’t imagine why he would ever invest in Oracle.", "score": 1, "replies": []}, {"body": "He's still holding KHC. Out with the old, in with the new", "score": 1, "replies": []}, {"body": "Papa wants to own every bank, insurance co, and airline", "score": 0, "replies": []}]}
