{"title": "$NVDA now down more than $MU", "selftext": "", "id": "9yu9ya", "created_utc": 1542735107.0, "score": 166, "upvote_ratio": 0.96, "num_comments": 54, "comments": [{"body": "Haha hey look it's my portfolio haha \n\n:-(", "score": 118, "replies": [{"body": "Hahaha. aHAhaha.\n\nHahah. Haha.\n\nHah. \n\nHa\n\nH\n\n---\n\non a side note i still have like 4k in MU $60 Jan Calls. those are still gonna happen right? they're just taking a break in the $0.01 land, nbd.", "score": 16, "replies": [{"body": "You should average down.", "score": 7, "replies": []}]}]}, {"body": "Fuck this gay earth.", "score": 63, "replies": [{"body": "It really do be like that tho", "score": 20, "replies": []}]}, {"body": "Sooo... Buy MU?", "score": 32, "replies": [{"body": "Lol hahaha hohohhoh\n\nNot options at least.", "score": 15, "replies": [{"body": "I wouldn't even touch shares. It seems likely that China is doing that to MU what it did to US soy farmers. The tariffs and the shit show with UMC/Fujian scream China backlash, which would be bad for MU. Also, that would explain SK Hynix's jump in DRAM and NAND sales in the face of declining prices and demand on both. And, Xi has been cozying up with S Korea to help make headway in N Korea. S. Korea doesn't really have bargaining chips, except chips and memory.      \n      \nEdit: so, I think G20 will fail, ***and*** I think MU's ER will be a bloodbath. ", "score": 19, "replies": [{"body": "Yeooop.  Most likely this.  Again and again so many retards have underestimated, through sheer ignorance, just how much the trade war will impact global growth, and in turn, demand for these products.  China has a massive consumer class now and any slowdown in that growth will clearly impact ALL demand for ALL products.  Trump's greatest error and lie was convincing his cult followers that \"globalism\" is some terrible entity set to destroy their way of life as if the USA exists in a vacuum. ", "score": 17, "replies": [{"body": "Donny also forgets that China doesn’t point knife to US companies to have their products manufactured there. This trade war is just another bullshit excuse. US thinks they are the most righteous country in fact not. Instead of slowing down the global growth as a whole, why not starting to make deals and making efforts to be less China dependent.\n\nIt seems China has been putting that effort to be less US dependent.", "score": 8, "replies": [{"body": "Agreed.  I mean....don't get me wrong, the USA is fucking awesome but at SOME POINT people have to just say \"well...this is capitalism and US companies are going to go where they can make the most profit even if it means selling your soul to the Communist devils\"\n\nFurthermore, people bitch and moan CONSTANTLY how other countries \"took our jerrrbbss\"  but won't dare buy anything made in America because it costs too much.  For 30 years we have been enjoying cheaply made goods that we know full well were made with slave labor in shithole countries.  We are ALL guilty of it.  No one should be surprised when it comes back to haunt us.  3 decades of throwing money to other countries and they finally developed their own consumer classes.  Who would have thought!?", "score": 11, "replies": [{"body": "Agreed man.. Idk wtf they were thinking either. IIRC Los Angeles Air Quality Index was never this good when US still have their products manufactured domestically. \n\nFuck these bitches and leeches don’t really understand capitalism. Nothing such as selling souls to devils. Fuck that mindset. Corporations will layoff these fuckers in a heartbeat once the CEO bonus and investors profits are on stack. ", "score": 5, "replies": []}, {"body": "Who cares where we get our shit? Our slave labor from China isn’t any better than ksa blood oil. At least china didn’t cause 9/11", "score": 2, "replies": []}]}, {"body": "No, China is much worst, they force a merger, which results in the blueprints being stolen after a few years. Like they did with wind energy IP.\n\n", "score": 8, "replies": [{"body": "Did you even read? No one is fucking forcing them where they should have the goods manufactured. ", "score": 2, "replies": [{"body": "Yes, it's retarded for companies to take that risk but in a sense they must outsource or else competitors will crush them. Best thing Trump could do is lower corporate tax down to 5%. Be the most competitive beast ever.\n\n\nChina also straight up blocks a lot of American websites, to push for its own chinese owned websites. So to say China doesn't hasn't been playing the trade war game is completely wrong. Chinas housing bubble gonna pop soon so none of anything will even matter when that happens  ", "score": 7, "replies": [{"body": "lowering corporate tax to 5% would just create a race to the bottom. Other countries would have to do the same to stay competitive and no one would benefit. ", "score": 2, "replies": []}, {"body": "The Chinese has been steering away from stock market investing mentality. Stock market to them is a Casino and has always been. Properties are the safe haven next to saving accounts per their beliefs. This is why you see the Chinese put their money mostly in properties (70%). The number is retarded. I can’t even afford a flat in Beijing. Not even 30 years loan.\n\nIf I were China, I would push domestic products as well. It’s the only chance to get out from modern slavery. Look at India or other SE Asia, they will remain as emerging markets (always someone’s bitches). No way they are gonna be on par soon to the top tier countries like US and Europe. \n\nIf I were US, I would push the deals more with Mexico or Canada. High volume manufacturing process these days can be done thru AI and Automation. Cheap and high labor intensive are a lot less required. This is the way to protect ur own IP.\n\nPush the IP even further to next generation and make the previous IP obsolete. Stop fucking milking IP like Intel. \n\nMU and AMD have been walking on that direction.", "score": 1, "replies": []}]}]}]}, {"body": "Wouldnt placing tariffs on Chinese goods force US businesses to be less dependent on China long term?", "score": 1, "replies": [{"body": "Current tariffs only last until the next president. Companies are doing predictions decades into the future.", "score": 1, "replies": []}]}]}]}, {"body": "All this political speculation in the market needs to relax. Like I get it house of cards sucks now but it's bullshit . Micron earned 14 Billion in 2018 that's more than all of these companies. More than NVIDIA AMD AVGO QCOM combined. At some point earnings are more important", "score": 4, "replies": [{"body": "Speculation is what brings the tendies. But, you're right that earnings are what matters, and that exactly why there would be a blood bath if China has been shitting MU out of China. Half their earnings are from China. That whole market could be closed off to them entirely. Have you not seen what happened to US soy farmers? ", "score": 1, "replies": [{"body": "Half of the earnings are from China but the amount that is  Chinese consumer must be far less than 50% if you consider the manufacturing in China is mostly exports. They would be cutting off supply chains and raising cost which is the only thing that pushes companies to manufacture in such a shit hole. ", "score": 5, "replies": [{"body": "That is true. I've never seen anything that specifies how much of MU's China sales come back to the US. But, it's also important to note that both DRAM and NAND are commodities, and most US companies won't necessarily care. For example, the same model of iPhone might have memory from any of the big three. Still, say China only cuts use of MU by ~50%. That means MU earnings drop ~25%, which would spur panic ***and*** initiate screams of ***cYCLiCaL!***. Lastly, MU's only saving grace in all this might be ramping up their elusive Xpoint products, which very likely won't be ready in 2019. Still, I could be wrong. Maybe Trump will cock slap Xi, and Xi will force China to use MU exclusively, or maybe AAPL will just buy them. But, my money is on low $30s. ", "score": 1, "replies": []}]}]}]}, {"body": "If China buys from SK instead of MU wouldn't that let MU pick up customers that SK can no longer sell to due to new demand from China? There is only so much supply, and demand hasnt changed. SK would focus sales to China since they would likely offer better prices, since they cannot consider US chips.  This is assuming semiconductors are a commodity.", "score": 2, "replies": [{"body": "That's the theory MartyMoho was pushing, but I disagree. SK Hynix and Samsung can ramp up production if they want to do so. I think they've been sandbagging production to artificially inflate prices and provide some semblance of stability to the memory markets. But, if China is willing to pay them a premium just so that they can not use MU, I think they would increase production to get that business and keep their current business -- leaving MU with their dick in their hand. ", "score": 3, "replies": [{"body": "I doubt they could ramp production fast enough to provide China with chips, along with continuing to provide their existing customers. And Samsung has stated they care more about retaining profits, not growing market share. They know exactly what  would kill their most profitable sector.", "score": 2, "replies": [{"body": "Samsung and SK could certainly ramp production to fill all of MU's market share in China. MU supplies ~25% of global DRAM, half of that is China. So, 7% of global DRAM is MU's in China. The two biggest players, who combined supply ~65% of global DRAM, could each ramp production by ~10-15%, to cover the 7% of global demand that MU supplies to China. But, again, you're correct that they probably wouldn't want to do that, and they've said as much. To that, I'd argue that China can be pretty convincing. And, they really don't need to take all of MU's China business to tank the stock, which would help China leverage Trump. Also, longterm, it's unlikely Trump will stop China from making all of their own DRAM and NAND, eventually. Trump (e: must) know that, which makes fighting over it less important; it's basically a bargaining chip for larger ends.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "For a trade, yes.", "score": 2, "replies": []}, {"body": "I’d rather buy TSLA at $420", "score": 2, "replies": []}, {"body": "Have u lost 3k this year yet?", "score": 2, "replies": []}]}, {"body": "Finally, value investing pays off\n\nMU shareholders entered the bear market before it was cool", "score": 18, "replies": []}, {"body": "This is good for MU!", "score": 10, "replies": []}, {"body": "Friendship with MU ended, NVDA my best friend now.", "score": 7, "replies": []}, {"body": "Don't touch Nvidia until end of day or a few days from now. It's not only being pumped/dumped by Citron but also the market pricing in what it needs to for taking your money.\n\nMove on to another opportunity. \n\n", "score": 29, "replies": [{"body": "so buy weekly calls and month puts?", "score": 3, "replies": [{"body": "Interesting idea, but you would need to buy them at the right times and close them quickly.", "score": 2, "replies": []}]}]}, {"body": "MU is hardy and strong!", "score": 5, "replies": []}, {"body": "Buy the fucking dip!!!", "score": 3, "replies": []}, {"body": "Time to buy!!", "score": 3, "replies": []}, {"body": "I'm buying $MU", "score": 5, "replies": []}, {"body": "Not only is it down more than MU but it did so in a much shorter time frame AND had 3x the market cap.  Impressive collapse really. ", "score": 2, "replies": []}, {"body": "Is this \"blood in the streets\"?", "score": 2, "replies": []}, {"body": "Still a close second GO TEAM $MU!", "score": 2, "replies": []}, {"body": ">September 28, 2018   Evercore ISI analyst C.J. Muse raised the price target on NVIDIA (NASDAQ: NVDA) to Street High $400.00 (from $300.00) while maintaining a Outperform rating.\n\nGood to know even the big guys are as brainless as we are", "score": 2, "replies": [{"body": "Yeah WTF is that shit?", "score": 2, "replies": []}]}, {"body": "See , so $MU is not as bad as we thought...", "score": 1, "replies": []}, {"body": "NVDA 90C?", "score": 1, "replies": []}, {"body": "Of course the 2 meme stocks of this sub get hit the hardest ", "score": 1, "replies": []}, {"body": "What’s the P/E now like .4?", "score": 1, "replies": []}, {"body": "Thank god the other half of my portfolio was in oil... this market is fake and gay", "score": 1, "replies": []}, {"body": "HAHA Jokes on you, AMD already crashed 95%. ", "score": 1, "replies": []}]}
