{"title": "Pandemic Savings Are Gone (SF Fed)", "selftext": "SF Fed published their study last Friday showing consumer excess savings have run out. This saving was the cushion that allowed consumers to continue spending in 2022, even when inflation was outpacing their wage growth up until a year ago. To continue spending, consumers chose to save less and deplete their excess savings, shown by the personal savings rate below.\n\n[https://www.frbsf.org/research-and-insights/blog/sf-fed-blog/2024/05/03/pandemic-savings-are-gone-whats-next-for-us-consumers/](https://www.frbsf.org/research-and-insights/blog/sf-fed-blog/2024/05/03/pandemic-savings-are-gone-whats-next-for-us-consumers/)\n\n[https://fred.stlouisfed.org/series/PSAVERT](https://fred.stlouisfed.org/series/PSAVERT)\n\nNow that the excess savings is gone, to continue spending, consumers will have to rely on further wage growth, credit card debt, or selling stocks/real estate.\n\n\"the depletion of these excess savings is unlikely to result in American households sharply cutting their spending levels as long as they are able to support their consumption habits through continuous employment or wage gains, other forms of wealth—including non-pandemic-related savings—and higher debt.\"\n\nConsumer spending is 70% of the US GDP, and it's likely to slow imminently. While this doesn't guarantee recession is around the corner, slower spending will lead to lower corporate sales, which might lead to layoffs to protect corporate margins, which lead to further less consumer spending.\n\nTherefore, the next 6-12 months will likely be a critical time for the US economy. The Fed will need to be nimble and ready to cut in response to a weakening economy, or they risk waiting too long and toppling the economy into a recession.\n\nEven if the economy seems strong now, nonfarm payroll can go from 250k to -100k in 2 months (2001), and the quarter before the 2008 recession had initial real GDP of almost 5%. (**not** saying 2008 will happen, but just saying don't be fooled by the strong economy because it tips over quick).\n\n[https://www.bls.gov/web/empsit/cesnaicsrev.htm#2007](https://www.bls.gov/web/empsit/cesnaicsrev.htm#2007)\n\n[https://www.bea.gov/news/2007/gross-domestic-product-and-corporate-profits-third-quarter-2007-final-estimates](https://www.bea.gov/news/2007/gross-domestic-product-and-corporate-profits-third-quarter-2007-final-estimates)", "id": "1cmrb2i", "created_utc": 1715128077.0, "score": 233, "upvote_ratio": 0.91, "num_comments": 93, "comments": [{"body": "So this the part where the music stops right?", "score": 110, "replies": [{"body": "This is the vulnerable period. There still needs to be an initial catalyst that tips over the domino. If layoff waves start happening, that would definitely be the catalyst. If consumer spending abruptly slows, that would be another catalyst. Outside those 2, a geopolitical shock might do it, but not guaranteed.\n\nThis is when the Fed relies on luck. Theoretically if no shock occurs during this vulnerable period and it passes after 12 months or so, then they could be out of the woods.", "score": 44, "replies": [{"body": "Start? Buddy, we’ve been in the layoff wave for over a year. That’s why we’re here now.", "score": 45, "replies": [{"body": "[https://fred.stlouisfed.org/series/JTSLDR](https://fred.stlouisfed.org/series/JTSLDR)\n\nlayoff rates lower than pre-pandemic level.\n\n[https://fred.stlouisfed.org/series/JTSHIR](https://fred.stlouisfed.org/series/JTSHIR)\n\nAt the same time, hires also lower than pre-pandemic. That means if you got a job, you'll likely keep your job. If you don't have a job, you likely won't find a job, unless if it's blue collar, or health care. Also means if layoffs start, you'll have a hard time finding a new job.", "score": 56, "replies": [{"body": "Yeah the second chart seems to indicate we are already in a hiring freeze or recession. The layoff indicator is very tight. Notice how that chart barely even moved during the financial collapse. I almost wonder if companies have a way of quantifying these firings in different ways that land outside of that chart.", "score": 20, "replies": [{"body": "Yes but a hiring freeze does not trigger a sharp pullback in consumer spending, which would start the domino. A hiring freeze might trigger a gradual pullback, but not sharp, and that's the difference between a soft landing and a recession.", "score": 6, "replies": [{"body": "I would argue that the recent layoffs have been effecting higher earning white collar positions at Mag 7 companies. I wonder if there is a tracker for that as well. And a tight labor market with consistent layoffs and slower hiring can certainly set the stage for a broader recession- especially in a high inflation environment like today.", "score": 12, "replies": [{"body": "while it's tempting to see the layoff headline from tech and extrapolate it, tech makes up  a small portion of the jobs in the US. We were adding 2.5 millions jobs a year. A tech company might layoff at most 5-10k. And if you look at the sectors in the job report, information tech has been net negative for 1-2 years now. It's mostly the government, health care, and service sectors that are adding jobs, probably 80-90% of them, and health care + government hiring are completely sheltered from Fed interest rate.\n\nSlower hiring certainly weakens the economy and make it prone to tip into a recession. Therefore, trivial shocks that normally would not affect the economy, can be catalyst for the recession. That's why recessions are never \"predictable\", because these shocks would be overlooked in normal economy.\n\nI do think the catalyst will likely be something from the financial market. Perhaps the bond market break due to US debt issuance. Oil prices has always been classic catalyst historically too. Or maybe it's the shadow banking that's completely invisible to the Fed, and has been picking up the baton from the Fed and continued loaning to businesses", "score": 9, "replies": [{"body": "Whatever the case, I still feel like we’re glossing over the larger bond issues with the inverted yield curve as well as the state of the US governments ability to repay its debts. If we have a massive Social Security default in 2035, we will see a huge shock then too. It will affect housing first, boomers without savings will have no choice but to unload property. I don’t think congress will garner much support to right that ship, even though it’s absolutely necessary.", "score": 5, "replies": []}]}]}]}]}, {"body": "Is this specific to the St Louis region?", "score": 1, "replies": [{"body": "No the data aggregation task is just done by the St Louis branch. The data they take is national, and recently some regional housing as well.", "score": 1, "replies": []}]}]}, {"body": "\"I work for a highly speculative tech company that sets money on fire, and I think all industries are like mine\"", "score": 1, "replies": [{"body": "I don’t work in tech.", "score": 1, "replies": []}]}]}, {"body": "There is still so much free money floating in the economy. Beyond just consumers. Businesses were able to take out billions in low/no interest debt. Companies anticipated the end of the free money era and adjusted. They are healthy. On the consumer front everyone who owns a house now has a sub 3% mortgage. They are doing well. It's a weird economy for sure, but there's a reason this train has been so hard to stop.", "score": 3, "replies": [{"body": "That's actually much more scary to me. Is the economy strong, or is everyone just sheltered from the current interest rate. And if the latter is true, that means there's a rock somewhere waiting to fall on us in the future, and no one will see it coming,  because at some point interest rate is gonna bite", "score": 4, "replies": [{"body": "If everyone used good quality debt to get themselves into a healthy spot it is going to stick for a while. When companies brace for recession they lean down, cut out the waste and reduce inventory, etc. I don't know why your thought process goes right to impending doom. If you compare now to any crash in the past it usually was a result of companies and consumers making terrible decisions (ie. The mortgage situation in 2008) until the system broke and sent all of the risk takers (and their employees) back to the stone age. I just don't see that now. Most consumers and companies are at a healthier spot with their debt and risk taking as compared to past recessions. Which is why I'm not sold it'll happen at all.", "score": 1, "replies": [{"body": "Companies have to refinance. The refinance wall is gonna start later this year we all know this. Homeowners have to move at some point, whether for familial reasons or for work, or even layoffs.\n\nIf everyone is sheltered from interest rate, who's to say they can handle 5.5% if they weren't sheltered? Who's to say it won't incentivize the fed to lean towards hiking more because clearly the interest rate isn't able to moderate demand and bring inflation down. \n\n2008 wasn't the only recession in history. Most recessions in history were caused by the fed fighting inflation. 2001, 1990, 1980s, 1970s.", "score": 1, "replies": [{"body": "My point is companies anticipated this, took advantage of good debt available at the time and made the cuts they needed to because they anticipated a rising rate environment and recession. When everyone preemptively predicts and braces for recession it tends to soften the recession, as a result of people making smart, risk adverse decisions. \n\nAlso, inflation numbers have been better. Down to 4% YoY. If inflation stays flat the fed won't have to do much more and will be able to slowly roll back over the next few years.", "score": 1, "replies": [{"body": "the \"good debt\" companies took will start expiring soon. Companies did not make the cuts for an imminent recession. If that was the case, labor hoarding wouldn't exist at the expense of margins. Most companies are thinking if any recession comes at all, it'd be short and shallow, regurgitated by every economist who predicted a recession in 2022. Since hiring those workers were difficult, they don't want to do that again for the inevitable expansion after the short/shallow recession.\n\n[https://www.reuters.com/markets/us/us-heading-into-shallow-recession-no-respite-rate-hikes-yet-2022-12-09/](https://www.reuters.com/markets/us/us-heading-into-shallow-recession-no-respite-rate-hikes-yet-2022-12-09/)\n\nAlso, no one braces for a recession anymore. Would consumers be drawing down excess savings if they think a recession was coming? They did saved more between June 2022 and April 2023, but after that they've on a spending spree again. Same for corporate with the AI investment. Very few of them are monetizing from AI right now, and yet they're spending a ton of capex on AI just because they don't want to be left behind.\n\nI'd also like to point out SP500 is very overvalued right now. Even the most bullish strategist admit that valuation is on the high side, but if everything is Goldilocks, then maybe it can persist. At the bottom of Oct 2022 low, before the recession even started, SP500 was trading at 15 forward PE. It's trading at 21 forward PE right now, and assuming a very strong 10% earnings growth.\n\nSo even in a mild recession where earnings growth is only -10% or -15%, which is very mild, and a generous 17 forward PE, it can drop down quite a lot. That's why even though the 2001 was extremely mild and short, SP500 dropped 55%, simply because of overvaluation going into it.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "BNPL + CRE debt wall will be the catalyst", "score": 1, "replies": []}]}, {"body": "Nah. This doom and gloom article stuff is posted weekly. They find the one graph and shows bad news and write an article around it. Doesn't mean anything.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "If they’ve been spending down savings to support their spending habits, they’ll have to find money somewhere to continue to spend at that pace", "score": 6, "replies": []}]}, {"body": "Nope I am dumping my ira lol.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 94, "replies": [{"body": "People lived off credit for decades before the pandemic. I don’t know how much the lack of savings will affect anything.", "score": 33, "replies": [{"body": "Pretty much. Never underestimate people’s lack of fucks to give.", "score": 18, "replies": [{"body": "If anything, the pandemic made people embrace the yolo lifestyle. Life is short and unexpected!", "score": 9, "replies": [{"body": "The government's constant handouts, bailouts, spending, and widened welfare net certainly doesn't hurt either.\n\nThe government picked winners during the GFC. Big banks and too big to fail corporations got the bailouts while main street went under and average joes lost their homes. 2020? Everyone got handouts: megacorps from restaurant franchises to airlines got bailouts, average worker got unemployment, low wage workers got added unemployment, PPP for biz big and small, EIDL loans for businesses that didn't qualify for PPP, free stimmy checks for everyone, and even for illegals or those on the streets: free school lunches, food programs, housing, healthcare, etcetctec.\n\nCompare that to China where the CCP basically told everyone to take care of themselves, cracked down on their corporations, and then held their covid-0 policy too long? They are in deflation, going through their own GFC style melt down, population in decline, youth unemployed, and their economy is having trouble growing despite massive government initiatives and programs. Reason why is because individual, corporate, public/private, and foreign/investor confidence have all been crushed by Xi and the CCP's poor policies, draconian policies, and random/unwarranted crackdowns.", "score": 2, "replies": []}]}]}]}]}, {"body": "How did a couple $1,000 checks last so long?", "score": 200, "replies": [{"body": "For me it was more. $40/wk in gas saved. No longer needing to update my wardrobe. I wore the same button down on every meeting for 2 years straight. I cooked 90% of my meals. No more $2.50 cafeteria coffee. Oil and tire changes decreased. A ton of money got saved by WFH folks", "score": 174, "replies": [{"body": "For everyone it was a lot more. For a variable length of time depending on where you lived and how you responded to the pandemic you spent less on travel, events (music/sports/movies/etc), you spent less on gas, you spent less on food, you spent less on childcare, you spent less on shopping…everything. Everyone saved. It’s not surprising that when things fully opened up inflation took off because on top of supply chain issues, people had so much savings and so much pent up desire to live again.", "score": 44, "replies": [{"body": "And then there's the other assists from government—deferred evictions, child tax credit, massive Medicaid expansion until... now, student loans deferred until... also now.", "score": 5, "replies": []}]}, {"body": "Dayumm that’s like another $1,000", "score": 11, "replies": [{"body": "If you ignore vehicle maintenance and work attire", "score": 2, "replies": [{"body": "Sorry. $1,500", "score": 2, "replies": []}]}]}, {"body": "The resulting inflation negated any of those gains. I saved $5,000 in 2020 but not grocery trip is $100 more than it used to be. Gas is $4.20 instead of $1.50. Interest rates went from 3% to 8%.", "score": 12, "replies": [{"body": "So would you say your pandemic savings are gone? (SF FED)", "score": 32, "replies": [{"body": "People who savings are gone wouldn't be on r/stocks. You are supposed to have savings before investing so if a bear market happens and you lose your job you dip into savings and not sell your stocks in that bear market/job loss situation.", "score": 11, "replies": []}, {"body": "Mine are not. My wife and I make over 200K a year and live frugally. But the average workers are getting destroyed.", "score": 6, "replies": []}]}, {"body": "I disagree. Inflation negated some of those gains, yes. But any/all... far from it. ", "score": 4, "replies": []}]}, {"body": "Where did you get 2.50$ coffee?", "score": 4, "replies": [{"body": "My former work cafeteria in 2019. I only drink a black drip coffee nothing fancy. Not sure what that costs today retail. You can get a bucket of Folgers for $8 to make at home instead.", "score": 7, "replies": [{"body": "PNW area, latte +tips goes for 7$ <smh>", "score": 5, "replies": [{"body": "Yeah, thats a latte. Sprinkles of sugar and milk double the price. Black drip coffee is usually still by far the cheapest on any cafe menu", "score": 3, "replies": []}]}]}]}]}, {"body": "Most of it was from the money save due to literally no doing anything outside, such as travel, eating out, booze, bars, kids classes, hobbies, shopping, etc. \n\nOnce things opened, all that pent up energy and money came out swinging, which contributed to inflation", "score": 22, "replies": []}, {"body": "It wasn’t just those checks, it was just savings in general from not spending as much. From the first few paragraphs of the article:\n\n> Where did the excess savings come from? \n\n> In a study last year (Abdelrahman and Oliveira 2023), we examined household saving patterns following the onset of the pandemic recession. Our study showed that households rapidly accumulated unprecedented levels of excess savings—defined as the difference between actual savings and the pre-recession trend—relative to previous recessions.", "score": 6, "replies": []}, {"body": "I expect it's more the \"you get state unemployment +$600 weekly for several months\" money. If you didn't get that, you've been raped as they harvested it from those who did.", "score": 32, "replies": [{"body": "Yep, they got me. Had friends doing jack shit making more than me working 40. “Essential”", "score": 34, "replies": [{"body": "If it’s any consolation, your bosses also got PPP business loans they didn’t have to pay back.", "score": 22, "replies": [{"body": "Yup, $50k. Mfs had the best year ever in growth, rev, across the board. Maybe 15 employees", "score": 7, "replies": []}]}, {"body": "Here's the problem. The corporate machine is slow and thoughtless enough to keep suckling even after that source is gone. It needs pushback, and America loves spending, so we basically have to crash and burn to reset the vacuum.\n\nMeanwhile, the vacuum lives off of the free PPP loans AND the bonus unemployment money, waiting for the little guy to get a buck.\n\nIf we had Japan's frugality, we'd be able to beat this, but, eh. All you need to do is look at all the trucks and beamers.", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "yup had a few friends with restaurants who got a dozen grands from small business check. Meanwhile, they sold more take-outs than pre-pandemic, hired less staff, and staff got more tips without even serving food. They were also \"working\" their day job while managing the restaurant all day. The restaurants who couldn't do take-out went out of business, but those who did made banks.", "score": 4, "replies": []}]}]}]}, {"body": "I was an essential worker at the time. We got a 20% pay cut for a few months. Those were not good times", "score": 2, "replies": []}]}, {"body": "Can’t believe no one mentioned the $1000+ a week people were making on unemployment plus the number of people who didn’t pay rent during the eviction moratoriums", "score": 9, "replies": []}, {"body": "They’re probably talking about PPP Loan savings", "score": 3, "replies": []}, {"body": "If you're smart, you pay down $1000 worth of debt and then have a couple $100 more to spend every month. There are lots of ways to spend an unexpected windfall such that you'll increase your income somewhat permanently (paying up-front cost for a small business, investing in stock, paying down debt)", "score": 2, "replies": []}]}, {"body": "Every few months theres a new thing like this that is for sure going to tank the economy.  When they stop the eviction mortatorium, when student loans have to start being paid again, when the rates went up, when inflation didn't go below 3%.\n\nIf you predict a recession every month you'll be right eventually.  But things we see coming don't cause market turbulance.  Its always something unexpected or its priced in.\n\n  \nAlso people spending tons of money doesn't slow the economy down FYI.", "score": 28, "replies": []}, {"body": "I also think all that stimulus gave people a false sense of safety. I own income property and I had this guy as a tenant. A super sweet human and honestly a good guy. But he was embarrassed to admit that he made more money not working and living off the extra $600 a week of unemployment money then when he was running his small catering business. he hated the fact that he was mooching, but money is money.", "score": 9, "replies": [{"body": "My mom was a crossing guard right before the pandemic and made a couple hundred bucks a week working part time.\n\nWith Covid unemployment, she made $700 a week for about 8 months.  Remodeled the kitchen with that $.  Boomers stay undefeated.", "score": 3, "replies": []}]}, {"body": "Good once people hit rock bottom inflation will go down", "score": 52, "replies": [{"body": "Or rents from overpriced housing and high rates will keep it elevated.", "score": 31, "replies": [{"body": "Overpriced housing and high rates that make new construction extremely difficult given those prices (leading to new permits plummeting the last two years). Supply is the issue and high rates exacerbate that. There’s nothing that’ll bring down the price of housing in any meaningful way in the short term, including higher rates.", "score": 6, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "lol good catch", "score": 2, "replies": []}]}]}]}]}, {"body": "I’ve been spending for the past 4 years on this whopping pandemic savings of a couple thousand dollars! Living the lavish life this whole time", "score": 34, "replies": [{"body": "pandemic savings refer to savings accumulated during the pandemic, not just stimulus checks.\n\nUnemployment money much higher than minimum wage, childcare credits, consumer locked down and unable to spend their salaries, small business checks, mortgage refinancing gives consumers thousands of extra money a month, job hopping giving employees 15-25% salaries boost, average joes doing 3-month coding bootcamp and landing 100k+ salary software engineering jobs because every tech company was hiring anyone breathing.", "score": 18, "replies": [{"body": "[deleted]", "score": -14, "replies": [{"body": "You can call it whatever you want. I didn't invent the term.\n\nWhat's important is consumers had a bunch of rainy day money saved up, used for spending, and now it's depleted. That was the cushion to keep them spending beyond their means during high inflation. How they saved up that money is not that important to the discussion, but it is there, shown by the data. You can also clearly hear about it if you listened to any Bank of America earnings call in the last 3 years.", "score": 13, "replies": []}, {"body": "Everything directly related to the pandemic and what went on during it, yes", "score": 0, "replies": []}]}]}]}, {"body": "well with those extra funds gone, consumers might have to tighten their belts or rely on other sources like wage growth or credit cards.", "score": 2, "replies": []}, {"body": " While it's true that excess savings are dwindling, consumers are resilient. Many have diversified income sources and aren't solely reliant on savings.", "score": 2, "replies": []}, {"body": "Personal savings RATE doesn’t mean what you think it means.", "score": 2, "replies": []}, {"body": "Savings is gone but the inflation it caused is here to stay", "score": 2, "replies": []}, {"body": "The title of the article is misleading. it does not mean people are going to not have any savings. It just meant the rate that people are saving money has gone back to pre pandemic levels.... no shit,  if you dont give people free money, then they wont be able to save that money.", "score": 5, "replies": [{"body": "Rate of savings hasn't gone back to pre-pandemic level since 2022. Pre-pandemic was around 6%, today around 3.2%, and still on a declining trend.", "score": 7, "replies": [{"body": "Prepandemic Fed rates were low and plenty of jobs. Now reversed…", "score": 0, "replies": []}]}]}, {"body": "The SF Fed just said consumer spending isn’t likely to slow, and you immediately follow that by saying it will slow imminently.\n\nIt’s enticing to be a prognosticator of doom, but almost all good investment advice will tell you not to try to predict economic cycles or time markets. Time IN the market matters more than timING the market. You’re just as likely to be right, a recession to occur and have the fed cut rates back to zero and the market skyrocket OR be right, a recession occurs, the fed bungles the response and markets crash OR be too early / mistimed - which is the same as being wrong.", "score": 2, "replies": [{"body": "SF Fed said \"unlikely to result in American households SHARPLY cutting their spending levels\", not that spending won't slow.\n\nEvery Fed officials, including Powell, thinks the economy will slow in the future, and that is likely required to bring inflation down from 3% to 2%. The economy is 70% consumer spending, so therefore consumer spending will slow in the future.\n\nAlso, I never predicted a recession here. I said the next 6-12 months will be a critical period for the US, and it requires nimbleness from the Fed.\n\nIf you think a recession will result in the stock market skyrocket, you're kinda delusional. Stock market is expecting 10% earnings growth this year. A mild recession will likely cause at least 10% earnings drop, so -20% from its current expectation. The 10 year rate dropping from the Fed cutting (which wouldn't be that abrupt in a mild recession scenario) isn't enough to offset that earnings drop. You can also check throughout history and see that once a recession occurred, stocks always dropped at least 20-25%.", "score": 7, "replies": []}]}, {"body": "It would have been unamerican for people to actually hold onto and/or invest their savings.\n\nThe said part about this is that out society will continue piling up debt to sustain and unsustainable standard of living. When the debt starts coming thru and people file bankruptcy, then we are in for on heck of a ride.", "score": 1, "replies": []}, {"body": "It baffles me that Americans rather touch their savings than just stop spending. It’s why EU inflation is coming down but US one not even though it started off earlier.", "score": 1, "replies": []}, {"body": "yeah that shit ran out 9 months after it was given, unless you are rich and didn't need it in the first place", "score": 1, "replies": []}, {"body": "What savings.All my pandemic moneys with into put options", "score": 1, "replies": []}, {"body": "I'm considering locking in 4.5% on a 5 year CD because I doubt we're going to see an average rate of 5% for the next 5 years.\n\nRight now I'm in a savings account and I think the only benefit is I get another 1/2 a percent APY. It seems really unlikely the fed hikes from here.", "score": 1, "replies": []}, {"body": "Everybody rationed their spending to deplete their savings on May 8, 2024?  \nWeird, I know people who can’t hold onto money more than a day, and others who have their first dollar.  I know people who suffered financially from the pandemic and didn’t recover, and I know others who have done extremely well.  \n\nThe model that everyone is in the same boat is total crap.  Fed has tried to manipulate the economy using interest rates and things have not responded as people thought they would.  If spending slows down interest rates will follow.", "score": 1, "replies": []}, {"body": "Will be nice if that actually stop people from spending so much and get that inflation down.", "score": 1, "replies": []}, {"body": "Here comes the recession everyone said wasn't gonna happen.......", "score": 2, "replies": []}, {"body": "Calls on banks and creditcards", "score": 1, "replies": []}, {"body": "But the govt will buy the votes, I mean bailout the taxpayers again", "score": 0, "replies": [{"body": "Didn’t work for Trump, even though he sent that personal letter acting like the money came from him", "score": 1, "replies": []}]}, {"body": "The. I guess we need to void all govt contracts and reduce spending by 80% \n\nWait", "score": 0, "replies": []}, {"body": "Brah what COVID cash? A few thousand dollars is shit. It’a been years now. You’d think they gave us all $50k or something (which they did to some with PPP in excess of $50k, maybe thats the cash they are talking about)", "score": 0, "replies": []}, {"body": "Consumers  are at the sweet spot where they are priced out of houses freeing up housing utility money to spend on discretionary things", "score": -1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "If you ever leave your mom’s basement. You’ll notice how packed the malls and restaurants are on the weekends, rents haven’t really increased since the covid hike, unlike mortgage rates.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You’re wrong \n\nhttps://www.reddit.com/r/povertyfinance/s/fgG90L7jmm", "score": 1, "replies": []}]}]}]}]}]}
