{"title": "Imminent market crash upcoming", "selftext": "META and AMZN gave weak guidance for the next quarter. Stagflation, high inflation. How many times do I have to tell you mfer regards CPI is going up. April's CPI is 3.5% forecast now, it might go up a bit by CPI and the last CPI prints came in .1% higher than the estimates. So April's CPI can come out to 3.6-3.7%. Gas prices will sky rocket in summer that will cause CPI to be close to 5% again. They'll have no option but to hike interest rates up again.\n\nStocks are gonna crash to 2022 level lows once again. I would hold SQQQ, SOXS, oil stocks or healthcare stocks like UNH or LLY until the lows are hit. Then invest in TQQQ or SOXL after we hit the lows. Or invest in SGOV when interest rates hit 6-7%.\n\n  \nIf you had bought SOXS or SQQQ when I suggested it early this month. You'd be up 28% on SOXS and 17% on SQQQ.", "id": "1chaxf8", "created_utc": 1714530166.0, "score": 0, "upvote_ratio": 0.35, "num_comments": 92, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 months ago\n**Total Comments** | 67 | **Previous Best DD** | \n**Account Age** | 4 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Once again, do yourself a favour and don’t check out this guys profile", "score": 154, "replies": [{"body": "I only look at people’s profiles when someone tells me not to. I regret my decision", "score": 52, "replies": [{"body": "Aaron needs a tranquilizer stat.", "score": 7, "replies": []}, {"body": "Would you suck it though?", "score": 13, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|27189)![img](emote|t5_2th52|12787)![img](emote|t5_2th52|12787)![img](emote|t5_2th52|8883)![img](emote|t5_2th52|8883)![img](emote|t5_2th52|8883)", "score": 1, "replies": []}, {"body": "🤐", "score": 1, "replies": []}]}, {"body": "I will learn from your mistake and remain ignorant of what is contained in this guy's profile", "score": 1, "replies": []}]}, {"body": "I dont know. He sounds bearish, but when I clicked his profile he looked pretty bullish.", "score": 13, "replies": []}, {"body": "Our resident bbc is back ![img](emote|t5_2th52|4260)", "score": 21, "replies": [{"body": "![img](emote|t5_2th52|51295)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}, {"body": "Goddamit. I couldn't not look once you said it. Also, I did not realize negative karma overall was a thing... learned me something today.", "score": 7, "replies": []}, {"body": "I did just because you said not to.![img](emote|t5_2th52|4276)", "score": 12, "replies": [{"body": "I should have listened", "score": 11, "replies": []}]}, {"body": "![img](emote|t5_2th52|4640)", "score": 8, "replies": []}, {"body": "Omg, thank god my door is closed.", "score": 5, "replies": []}, {"body": "Fock you", "score": 7, "replies": []}, {"body": "\"Adventurous Goods\" should have been a clear warning for tou smooth brained apes 😂", "score": 3, "replies": []}, {"body": "Geezeeee I should have listened", "score": 2, "replies": []}, {"body": "This time I’ll listen", "score": 2, "replies": []}, {"body": "First time i wish i listened to that random stranger on the internet...", "score": 2, "replies": []}, {"body": "How is this guy writing this drivel and getting upvoted\n\n![img](emote|t5_2th52|51295)", "score": 2, "replies": []}, {"body": "Lmao I shoulda listened to u", "score": 2, "replies": []}, {"body": "that is a big dick wtf lmao", "score": 2, "replies": []}, {"body": "I member...", "score": 1, "replies": []}, {"body": "Thank you I needed a laugh", "score": 1, "replies": []}, {"body": "The penis guy?", "score": 1, "replies": []}, {"body": "I was tempted from your comment but lucky my account has NSFW protection. Dodged a bullet", "score": 1, "replies": []}, {"body": "I trust you, and won't.", "score": 1, "replies": []}, {"body": "Her/she", "score": 1, "replies": []}]}, {"body": "You can post this every week and it still won’t come true ![img](emote|t5_2th52|4271)", "score": 28, "replies": [{"body": "Broken clock is right 2 times a day ..these type.of post are usually from person who are in losing position we must bias towards them to save ourself...", "score": 4, "replies": [{"body": "Same for every pumper who is saying how we’ll rocket and a stock is about to “take off”", "score": 2, "replies": [{"body": "If you take a net long position over a 1 month time horizon how many indices have gave a negative return ...I will wait ..ratio is not even  close brother...", "score": 1, "replies": []}]}]}]}, {"body": "Oh look it’s your weekly “Market is gonna crash” post where you repeat yourself over and over. Dude this is the same post from last week", "score": 20, "replies": []}, {"body": ". . . So we buy puts then?![img](emote|t5_2th52|8883)", "score": 13, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 3, "replies": [{"body": "Just bought PUTS for BOEING, knowing the Market and my luck . . . I’ll lose some money tomorrow ![img](emote|t5_2th52|4260)![img](emote|t5_2th52|4267)", "score": 2, "replies": [{"body": "I was thinking of this comment while holding my BA calls past two days (:", "score": 2, "replies": [{"body": "Naw I was smart enough not to believe I could get lucky twice, canceled my order before the market opened ![img](emote|t5_2th52|8883)", "score": 2, "replies": []}, {"body": "Ironically, my calls on Nvidia and SPY did lose me a bit of money doe :(", "score": 1, "replies": []}]}]}]}]}, {"body": "You forgot again to take your medicine", "score": 8, "replies": []}, {"body": "Better chance of you sucking your own dick.\n\nDo NOT look at his profile.", "score": 6, "replies": []}, {"body": "Weak guidance is just to cover the asses and make it easier for them to beat that guidance. These companies are still doing strong q/q and y/y growth. If high inflation and interest rates didnt stop them before what makes u think it will stop them now?\n\n This is some regarded DD.", "score": 20, "replies": []}, {"body": "Damn, I should have listened to you. It's purely my fault", "score": 5, "replies": []}, {"body": "🫵🤡 \n\nhttps://www.reddit.com/r/wallstreetbets/s/pPUyzH5osY", "score": 5, "replies": []}, {"body": "Oh it’s Mr. BD energy", "score": 5, "replies": []}, {"body": "Get a position or stfu nerd.", "score": 3, "replies": []}, {"body": "imo nasdaq gonna hit 20k first then whatever crash u wish upon would cum my guy", "score": 5, "replies": [{"body": "Thats a long way before a crash then idk about that", "score": 3, "replies": [{"body": "It's almost 20k now and no bigly crash so far. Broken clock sth sth", "score": 1, "replies": []}]}, {"body": "I'm bout to cum", "score": 3, "replies": []}, {"body": "DOW 40,000 by end of year.", "score": 3, "replies": []}]}, {"body": "Overreaction from you i understand we’re dropping right now but don’t give this oh it will happen later in the year, I get your a bear and data gets worse but dude no one knows what can happen ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Spy 480 puts September expiry", "score": 2, "replies": []}, {"body": "First timer. So, ah, what's a market?", "score": 2, "replies": []}, {"body": "People say that since 2023. How imminent can it be if it's been one year already? Or do you repeat until it does happen and claim knowledge?", "score": 2, "replies": [{"body": "That's good enough for religion, so how can it not be good enough for finance.", "score": 4, "replies": []}]}, {"body": "Silly ber", "score": 2, "replies": []}, {"body": "Didn't they guide $149 billion when the street was expecting $150?", "score": 2, "replies": []}, {"body": "Well by definition anything imminent *is* upcoming so I’m buying calls based solely on your poorly worded title", "score": 2, "replies": []}, {"body": "Imagine. Writing sentences this way.", "score": 2, "replies": [{"body": "I read that in William Shatner’s voice", "score": 2, "replies": []}]}, {"body": "So it does", "score": 2, "replies": []}, {"body": "Honestly. We won’t get a good event until the election, then we’ll have a black swan event. It’s an election year. Keep your pants on.", "score": 2, "replies": [{"body": "\nEveryone keeps saying election year but... It's Bidens election year", "score": 5, "replies": []}]}, {"body": "Uranium...... ![img](emote|t5_2th52|4258)", "score": 1, "replies": [{"body": "No. Ur a nium.", "score": 2, "replies": [{"body": "https://www.reddit.com/r/UraniumSqueeze/s/KKyWedayEW\n\n  \nhttps://www.reddit.com/r/UraniumStonks/s/PKKy4nG3yS", "score": 2, "replies": []}]}]}, {"body": "The end is near!", "score": 1, "replies": []}, {"body": "Gay bear in its natural habitat", "score": 1, "replies": []}, {"body": "Are you Ray Dalio's and Jeremy Grantham's lovechild by any chance?", "score": 1, "replies": []}, {"body": "How often do you post this?", "score": 1, "replies": []}, {"body": "If we had bought, yet you bought none  ![img](emote|t5_2th52|31226)", "score": 1, "replies": []}, {"body": "Ah yes the daily\" listen you gamblers you've been warned🫵🤡\" 🤣", "score": 1, "replies": []}, {"body": "Thank you for your analyses regard ! Didn’t read but I’ll see you at Wendy’s !", "score": 1, "replies": []}, {"body": "Weak guidance???", "score": 1, "replies": []}, {"body": "No kidding", "score": 1, "replies": []}, {"body": "Thepenismightier", "score": 1, "replies": []}, {"body": "If it does its good for crypto. Either way I win.", "score": 1, "replies": []}, {"body": "Speaking as a general bear, 1 rate hike doesnt mean market is about to crush now. Crush is coming, but i dont think its gonna be now, and i think we might even have umtil the end of 24", "score": 1, "replies": []}, {"body": "Only fans is going up?", "score": 1, "replies": []}, {"body": "The more I see of these posts the more I want to get Calls. Inverse WSB has a great record", "score": 1, "replies": []}, {"body": "Wow you must be super rich and having such a great life with all this knowledge of the future! Either that or just broke and posting nonsense on Reddit all the time", "score": 1, "replies": []}, {"body": "My eyes… 😵‍💫that’s enough internet for today. Don’t go to OP’s profile 🤮", "score": 1, "replies": []}, {"body": "Hey guys its me i know for 4 years now i been saying a crash is imminent but for reals this time", "score": 1, "replies": []}, {"body": "It’s too early to call a market crash just from a few indicators. Stay cautious, but don’t jump the gun based on short-term data.", "score": 1, "replies": []}, {"body": "Lol", "score": 0, "replies": []}, {"body": "Instructions unclear, bought puts on SQQQ", "score": 0, "replies": []}]}
{"title": "The FOMC meeting is priced in", "selftext": "It’s all priced in. Dumps happen before impending news. Not after. Once the news materializes, regardless of what it is, the market will stop caring and pump. \n\nIt’s why basically every single time the market expected a dump due to CPI or PPI or some other FOMC meeting that bears love to play with their dongs over, no crash happened. Just take a look at what happened during all of these events this year. The only time we crashed was because of Kashkari but that was because it was **unexpected**. Markets don’t crash on expected information. Instead, once the “negative” information comes out, a mega pump happens. \n\nNo you’re not the first person to have figured out that we might not get rate cuts. The market already did ages go. In fact, the moment a supermarket raises the price of any item, that information is feeded instantaneously and automatically to algorithmic trading bots of hedge funds. It’s always priced in. \n\nThe dump already happened yesterday. In fact, even a rate hike is already priced in by the futures markets. If news articles are talking about a potential rate hike, you think the markets haven’t taken it into account? Good night and see you tomorrow. I expect to wake up to many things rising \n\nSPY 510 C 5/10", "id": "1chcxb6", "created_utc": 1714536471.0, "score": 96, "upvote_ratio": 0.8, "num_comments": 81, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 months ago\n**Total Comments** | 2245 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1bl5hbm/coin_the_next_50x_play/) [x](https://www.reddit.com/r/wallstreetbets/comments/1btcnsb/zoetis_moonshot_update/) [x](https://www.reddit.com/r/wallstreetbets/comments/1bo4lcx/zoetia_the_next_moonshot/) \n**Account Age** | 2 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "The plebeians, always guessing, never winning.", "score": 134, "replies": [{"body": "SO TRUE", "score": 12, "replies": []}, {"body": "bwahaha VM you tell em", "score": 1, "replies": []}]}, {"body": "believe it or not this post is priced in too", "score": 102, "replies": [{"body": "Is my happiness priced in?", "score": 4, "replies": [{"body": "Priced in before birth", "score": 5, "replies": [{"body": "I mean, I’m not a starving orphan in a war torn country, so you’re not wrong", "score": 1, "replies": []}]}]}]}, {"body": "It being priced in is priced in, DN is also priced in.", "score": 35, "replies": [{"body": "WSB inversing is yet priced in ![img](emote|t5_2th52|51295)", "score": 15, "replies": []}, {"body": "Take DN in your mouth", "score": 6, "replies": [{"body": "SPY 510 is a decent play. But did you see the last 5 minutes of the market today... Massive dumps\n\nSell in May and go away motherfucker", "score": 3, "replies": [{"body": "Keep selling fear while I buy it today", "score": -1, "replies": [{"body": "Enjoy your ride into the 400’s Captain Price is Right", "score": 1, "replies": []}]}]}]}, {"body": "You too. Sorry man, I just priced you in", "score": 1, "replies": []}]}, {"body": "For my sake I hope you are right", "score": 10, "replies": []}, {"body": "We live in simulation everything is priced in.", "score": 12, "replies": []}, {"body": "This is a double reverse Uno situation so the correct play is to stay with puts", "score": 19, "replies": [{"body": "Just don’t land on community chest", "score": 5, "replies": []}]}, {"body": "https://preview.redd.it/g3i6epb7qrxc1.jpeg?width=1197&format=pjpg&auto=webp&s=4206d9db68023ccaccd441590d51caf0435254e2\n\n« even a rate hike is already priced in… ».\n\nI don’t agree, I would not call a 1.1% probability of rate hike « priced in ».", "score": 16, "replies": [{"body": "It’s an election year. The fed aint going to increase interest rates this year, not a chance\n\nAnd Powell is going to say fuck all to keep the circus going", "score": 12, "replies": [{"body": "I see this posted a lot, that the election year is somehow relevant. It’s not and this idea makes no sense. Remember that JPow is a Republican and was appointed by Trump. If he wanted the wield the Fed in a way that supports his party, he would be pushing to raise rates to fuck over Biden.\n\nJPow has been the Fed chair for SIX years now. In that time he’s done nothing to suggest he’s using the Fed for political purposes.", "score": 2, "replies": []}]}, {"body": "This means when there’s no hike, it’s actually a dovish outcome vs the 1% possibility of a hike, hence moon", "score": 6, "replies": [{"body": "higher for longer = dovish\nI knew it", "score": 1, "replies": [{"body": "When we go from 99% probability of no hike, to 100% probability of no hike, it’s indeed a dovish development. Marginal, but dovish.", "score": 2, "replies": []}]}]}]}, {"body": "That’s not how dumps happen. Dumps happen when news hits that disappoints expectations to the downside. \n\nPowell’s press conference isn’t priced in, because nobody knows what he’s going to say. \n\nFinally, sometimes markets tank after big run ups. 25% in 2022 and 10% in 2023.", "score": 11, "replies": [{"body": "The 2022 bear market was as a result of the Fed’s tightening cycle, not just a correction.", "score": 6, "replies": []}, {"body": "We know what he is going to say with 95% confidence. People get paid millions of dollars to try and predict what this guy says.", "score": 3, "replies": [{"body": "What is he going to say? And is it going to move the market in your opinion? Nfa", "score": 2, "replies": [{"body": "The consensus expectation is no rate change. \n\nHe will give typical guidance about inflation not being at target and he won’t rule out rate hikes or rate cuts in the future. \n\nThat is what the market expects. If he deviates at all from this script, the market will react accordingly.", "score": 1, "replies": []}]}]}]}, {"body": "how many contracts?", "score": 8, "replies": []}, {"body": "What’s not priced in rdy to fuk everyone is a rate hike", "score": 3, "replies": []}, {"body": "Well price these nuts when i buy puts.", "score": 4, "replies": []}, {"body": "Riced in ![img](emote|t5_2th52|31226)", "score": 7, "replies": [{"body": "iced in", "score": 5, "replies": [{"body": "Miced in 🐭", "score": 5, "replies": [{"body": "Thriced in", "score": 5, "replies": [{"body": "Liced in", "score": 2, "replies": [{"body": "Sliced in", "score": 2, "replies": []}]}]}]}]}]}, {"body": "No its not", "score": 6, "replies": []}, {"body": "How do I inverse this now?", "score": 3, "replies": [{"body": "By pricing it in obviously. Weren’t you listening?", "score": 18, "replies": [{"body": "That's already priced in", "score": 4, "replies": []}]}]}, {"body": "if it was priced in, it wouldn't move the market so much", "score": 3, "replies": []}, {"body": "Ever wondered if these FOMC meetings only cause daily fluctuations and not one of them matters in the long run? It is mostly irrelevant whether at this particular meeting the FED cuts 0.25% or hikes 0.25%. The QT programme, the reverse repo programme the long term inflation expectations, corporate earnings, unemployment, inflation matter much more than a quarter percentage change in the interest rate.", "score": 2, "replies": [{"body": "It’s not the .25 cut that matters, although it does a tiny bit due to cheaper money borrowing but IF they don’t cut rates that is telling us inflation is still out of control. I know people are sick of hearing about it but until it gets under control and the economy stops slowing (it pumped for 3 years with high inflation, now we are paying that price.", "score": 3, "replies": []}, {"body": "If you believe wsj they had something yesterday about cre having problems…..again.", "score": 2, "replies": []}]}, {"body": "You had me all the way to ‘feeded’ OP. Regarded", "score": 2, "replies": []}, {"body": "So a rate hike is happening because WSB says it’s not right? Am I getting this right?", "score": 2, "replies": []}, {"body": "Op doesn’t understand what priced in means", "score": 2, "replies": []}, {"body": "I'll just add that IF the market gets what it's expecting, then usually we see positive price action once the news is out. \n\n\nIf something unexpected happens here, then all bets are off. ", "score": 2, "replies": []}, {"body": "So….calls?", "score": 2, "replies": []}, {"body": "Jeromey is going to be more dovish than ppl think, we pump. Banking crisis, US debt + unemployment (it's being hidden) all solved through rate cuts. He can smell a recession, refuse to believe he will hike. Lastly, inflation headlines look worse than they seem, mostly being kept up by the slower moving, lagging parts like housing and rent (+ energy/oil).", "score": 3, "replies": []}, {"body": "Until Jpow speaks at the end and answers questions. And if one of his answers are that they probably aren't going to be able to cut rates 3x this year, watch the bottom fall out.", "score": 2, "replies": [{"body": "Market isn’t expecting 3 cuts, it’s expecting 2 or less", "score": 5, "replies": []}]}, {"body": "https://preview.redd.it/tl3pbwlmatxc1.png?width=484&format=png&auto=webp&s=8fc6662823c51133a45c9182a0759622f490fce4", "score": 2, "replies": []}, {"body": "Is this argument priced in yet?", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|18630)", "score": 1, "replies": []}, {"body": "This guy fk!", "score": 1, "replies": []}, {"body": "This Jesse Livermore?", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)You wish!", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|18630)", "score": 1, "replies": []}, {"body": "# ROPE", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|31224)", "score": 1, "replies": []}, {"body": "ahhhhh looks like a lower high is in and down we go. I'm banking on it.", "score": 1, "replies": []}, {"body": "Everything is priced in. Rate hike. Default. Civil war. WW3. Nuclear War. War with aliens. Stonks only go up till Armageddon. Oh Armageddon is priced in as well.", "score": 1, "replies": []}, {"body": "So higher for longer = priced in. Got it.", "score": 1, "replies": []}, {"body": "Dn is priced in, +10 5/17 QQQ 410p. Gl you regard", "score": 1, "replies": []}, {"body": "1/4 point cut incoming", "score": 1, "replies": []}, {"body": "Agree. Today's decision will be a nothing burger.", "score": 1, "replies": []}, {"body": "Market didn’t figure shit out “ages ago”. We went from potentially 3 to 4 cuts this year to 1-2 at best in a matter of months. If you followed the commodities prices since January the you could see what was coming, this is true. But markets have been stubbornly optimistic on cuts since we got to 5.25-5.50. Got a good sell off into market close yesterday, but the volatility associated with Papi Powell stepping up to the mic is gonna be real. Fucking Kashkari isn’t even a voting member and his shenanigans straight up shook the markets. What do you think will happen when the ole boy with his finger on the trigger gets up there?", "score": 1, "replies": []}, {"body": "The market is looking for assurance and stability.\n\nIf Powell gives a yes or raising rates or a yes to lowering them, it will pump because the future is no longer uncertain.", "score": 1, "replies": []}, {"body": "One interest rate cut is priced in. But what if Fed says they gonna increasing rate indefinitely for indefinitely period ?", "score": 1, "replies": []}, {"body": "Remind me in three hours about this tards post", "score": 1, "replies": []}, {"body": "!RemindMe 10 days", "score": 1, "replies": [{"body": "I will be messaging you in 10 days on [**2024-05-11 17:20:06 UTC**](http://www.wolframalpha.com/input/?i=2024-05-11%2017:20:06%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1chcxb6/the_fomc_meeting_is_priced_in/l24bwpf/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1chcxb6%2Fthe_fomc_meeting_is_priced_in%2Fl24bwpf%2F%5D%0A%0ARemindMe%21%202024-05-11%2017%3A20%3A06%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201chcxb6)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "Well, congrats and fuck you", "score": 1, "replies": []}]}, {"body": "The market is far larger than you can even imagine", "score": 1, "replies": []}, {"body": "Dude. It’s not that there won’t be rate cuts. It’s that there might be a rate *hike*.", "score": 1, "replies": [{"body": "Read again regard", "score": 2, "replies": []}, {"body": "-with regards\nRegard", "score": 1, "replies": []}]}]}
