{"title": "Nvidia stock pops 4% after earnings beat forecasts, announcing stock split and dividend hike", "selftext": "", "id": "1cyajxp", "created_utc": 1716410004.0, "score": 611, "upvote_ratio": 0.98, "num_comments": 52, "comments": [{"body": "[deleted]", "score": 131, "replies": [{"body": "Yup that was the play. Move hasn’t been big enough for long calls.", "score": 35, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "What were your positions?", "score": 3, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "[IMG-3456.jpg](https://postimg.cc/D4132cdH) This is my first double calendar. Didn’t close it, hope I’m not up a creek.", "score": 2, "replies": [{"body": "Can I ask what the goal is here.  Like, best case the price is in between your call and put?", "score": 1, "replies": []}]}]}]}]}, {"body": "I went 3 times leveraged,ade a whopping 16 percent.\n\nOn\n100 Dollar lol", "score": 1, "replies": []}, {"body": "Im at +100% not sure what you're on about...", "score": 0, "replies": []}]}, {"body": "Not those smart asses who sold covered calls. They will be posting tomorrow on how they can get out of it", "score": 2, "replies": []}, {"body": "Idk, my long calls are gonna print today. Also sold puts so collecting that premium.", "score": 1, "replies": []}]}, {"body": "Nvidia ([NVDA](https://finance.yahoo.com/quote/NVDA)) reported first quarter earnings after the bell on Wednesday that topped expectations while also announcing a 10-for-1 stock split and an increased dividend, following some of its Big Tech peers in doling out heftier quarterly payments to shareholders.\n\nThe company saw adjusted earnings per share (EPS) for the quarter of $6.12 on revenue of $26 billion, a jump of 461% and 262%, respectively, from a year ago.\n\nAnalysts were expecting Adj. EPS of $5.65 on revenue of $24.69 billion, according to data from Bloomberg. The company reported adjusted EPS of $1.09 on revenue of $7.19 billion in the same quarter last year.\n\nIn the current quarter, Nvidia expects revenue of $28 billion plus or minus 2% in the coming quarter. That’s better analysts had expected.", "score": 51, "replies": []}, {"body": "I just looked at the after hours quotes-1006.63/share.", "score": 35, "replies": []}, {"body": "Stock splits to 100 per share then runs up to 1000 per share again. Classic playbook", "score": 39, "replies": [{"body": "Worked for TSLA until it didn’t", "score": 8, "replies": [{"body": "Nvidia is not Tesla. Terrible comparison.", "score": 6, "replies": []}]}]}, {"body": "So is it a good idea to buy more before the split?", "score": 27, "replies": [{"body": "Buy before the split (before June 6) as the lower split price will become attractive to retail investors after the split, and the increased demand will drive the price up more.", "score": 69, "replies": [{"body": "It's my understanding that stocks usually go up after a split in part of this.", "score": 24, "replies": []}, {"body": "this is not true today. basically every broker allows you to buy fractional shares", "score": 6, "replies": [{"body": "Yeah, it's more of a psychological barrier that affects the average retail investor.", "score": 7, "replies": []}]}, {"body": "What happens with my long derivates after the split they dont get knockout am i right?", "score": 3, "replies": []}]}, {"body": "best buy before 2018 really", "score": 26, "replies": [{"body": "and don't sell your shares in 2022 when the market tanks....like i did. got back in way too late", "score": 19, "replies": [{"body": "you might still have came out ahead.. hopefully", "score": 9, "replies": [{"body": "oh I'm up 80% since I bought back in and I think 40% on my secondary account I gobbled up in the dip when it was below $800. But do I play coulda woulda shoulda all day? was up 144% back in 2021, I don't want to do the math on that now. Missed out on about 10x. that's the game.", "score": 11, "replies": [{"body": "you’re up, all that matters", "score": 12, "replies": [{"body": "Good takeaway, we are all millionaires when clicking on the 5y/max tab.", "score": 2, "replies": [{"body": "damn right", "score": 3, "replies": []}]}]}]}]}, {"body": "Happened to me. Bought after the 2021 split and then sold in 2022 at a loss. Kicking myself now sigh.", "score": 2, "replies": []}]}]}, {"body": "Unequivocally YES. I bought 225 shares prior to earnings release, i.e., it will  multiply X 10, i.e., 2250 shares on the 7th of June.", "score": 5, "replies": []}]}, {"body": "I sold 40 shares back in the 200s to break even (had a 300s cost basis originally but averaged down into the 200s) and initially hated myself, but have been buying a few shares ahead of each last earnings and feel at least a little better getting something out of NVDA - even if it’ll never be what it could’ve been. \n\nI hope it keeps going this way for awhile, planning to hold em all long this time", "score": 18, "replies": []}, {"body": "Yay I’ll have 10 shares soon!", "score": 35, "replies": []}, {"body": "does anyone know when the 10 for 1 stock split will actually happen?", "score": 41, "replies": [{"body": "7th June. https://www.cnbc.com/amp/2024/05/22/nvidia-announces-10-for-1-stock-split.html", "score": 38, "replies": [{"body": "Do i have to do anything? Bought 400 in 2021 and havent touched it since. Does my share number increase to 4000 by itself on the 7th then?", "score": 39, "replies": [{"body": "Yes, that’s how I understand it. The stock price will be adjusted and your shares will increase", "score": 36, "replies": [{"body": "Is correct.", "score": 13, "replies": []}]}, {"body": "No and yes. If you continue to own them on June 7th they’ll be distributed to you a few days later automatically. Essentially it’s the same thing but in practice it makes the stock more attractive and is usually positive as more people can purchase. I think there is an expectation that shares priced between 10-100 dollars get more trading volumes, leading to higher split adjusted prices. Historically NVDA like stock splits.", "score": 21, "replies": []}, {"body": "You’ll do well out of this put it that way.", "score": 6, "replies": []}, {"body": "The way its worked for me", "score": 1, "replies": []}, {"body": "Good move! Congrats on buying early.", "score": 1, "replies": []}]}]}]}, {"body": "Very bullish on NVDA but that dividend post split is literally going to be $0.01 per share lol.", "score": 12, "replies": [{"body": "The dividend is just so they can be included in the dividend based etfs.", "score": 7, "replies": []}]}, {"body": "Bought $20,000 worth right before the bell. Haha!", "score": 20, "replies": []}, {"body": "Did anyone else react, “is that it?” \n\nI mean, my $MSTR popped 10% Monday, 4% doesn’t seem impressive considering all the noise about NVDA. Don’t get me wrong, I own nvda and am happy to see it move more than usual. I just expected more.\n\nJust me?", "score": 5, "replies": [{"body": "It’s you. They’re the 3rd largest company in the S&P 500 now. Soon to overtake AAPL for spot #2.", "score": 26, "replies": [{"body": "Yes, and that’s awesome! But for all the hype you’d think they jumped 10% or something. That’s all I’m talking about. Trust me, I love the company and stock, been in it since $91. I heard the news driving home but when I finally looked … meh… felt underwhelmed is all.", "score": -1, "replies": [{"body": "Yeah fair enough. They had a 6.5% expected move priced in to their option chain before the binary event, and realized vol was less than iv this time.\n\nMaybe everyone was just really pumped given the post earnings price action last quarter.", "score": 3, "replies": [{"body": "I see it’s something like 6% afterhours which is encouraging. My day will be made if, tomorrow, Btc, and therefore Mstr pumps right along with Nvda and SMCI 🤞", "score": 1, "replies": []}]}]}]}]}, {"body": "Woke up to adding 45 new stocks to my portfolio lol damn", "score": 1, "replies": []}, {"body": "I love being a stock market investor.", "score": 1, "replies": []}, {"body": "That dividend is so silly, even after the 150% increase,lol", "score": 0, "replies": []}, {"body": "And yet, politicians are selling.", "score": 0, "replies": [{"body": "Pelosi still has her position up 2.5mil apparently. How do she know?!", "score": 2, "replies": []}]}]}
{"title": "NVDA Earnings Call", "selftext": "I listened to every minute and just wanted to get a chat going. I didnt understand everything that was discussed. I believe the Non GAAP margin was 78%. Revenue was 26B compared to predicted 24B. Demand for Hopper was greater than supply and plans for Blackwell rollout is projected for Q4 2024.  Spoke confidently about pace increasing. Can someone help me understand the faultering Jensen had when asked about China? He mentioned competition but didnt really understand. I tried to cover the major points but any extra input is welcomed!", "id": "1cycrb5", "created_utc": 1716415580.0, "score": 24, "upvote_ratio": 0.86, "num_comments": 67, "comments": [{"body": "Anyone else chicken out and cover their puts right before close?\n\nMade about 40%, but left all that sweet IV crush money on the table.  Looking forward to wheeling this for a lot cheaper in the near future.", "score": 21, "replies": [{"body": "Nope. Holding", "score": 6, "replies": [{"body": "How much BP did your position require?", "score": 2, "replies": [{"body": "13k. ATM put\n\nEdit: surprised that the margin requirement for IB is only 16%", "score": 3, "replies": [{"body": "Did you start out with a large BP?", "score": 2, "replies": [{"body": "No, same, why? It’s a $98k notional, 16% margin requirement (even if cash secured) is $15.6k", "score": 2, "replies": [{"body": "Jw how ppl get started trading options if they have large amounts of capital to begin with", "score": 2, "replies": [{"body": "You can do vertical spreads. That’s what I would do. I actually did that, with a calendar spread that reduced the BP by 30%", "score": 3, "replies": [{"body": "You did that starting out or this play?", "score": 2, "replies": [{"body": "Starting out, and still today. Teaches you risk management skills and good use of BP. I don’t use margin at all. Ever.", "score": 2, "replies": [{"body": "Yeah PCS is what I do. Thats smart. Do you do low iv plays? Seems hard to find good premiums sometimes outside of 5-10 tickers", "score": 1, "replies": [{"body": "I started on individual stocks cause IV is so low in SPY it gives me the chills to do strangles, for example. Other than PCS these days there isn’t much to do with indexes, maybe GLD. I did sell some CSPs atm on BMY that went well", "score": 1, "replies": [{"body": "You dont do individual stocks anymore?", "score": 1, "replies": [{"body": "I didn’t and now I do. That’s why I did NVDA", "score": 1, "replies": [{"body": "Gotcha this is my 1st NVDA play. Do you have favs you trade? How long have you been trading NVDA?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "What the hell is BP?", "score": 1, "replies": [{"body": "Buying power", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Me? Yeah but I want to avoid using margin", "score": 2, "replies": []}]}]}]}]}, {"body": "Same 😔", "score": 1, "replies": [{"body": "Gotta risk it for the bisquit", "score": 0, "replies": []}]}, {"body": "I figured the price would go up a considerable amount, but I hedged by opening a spread at 1000... I was expecting a 4-1 split, not a 10-1 split... right now, it seems to be holding at the 1003-1007 range, and I'm gonna hold for as long as I can, but I will probably end up collecting my profit and dipping before everyone jumps in.\n\n(That's what I get for opening a spread instead of just buying a call)", "score": 1, "replies": []}, {"body": "You will make way more in the long run by closing right before er", "score": 1, "replies": []}, {"body": "I had a naked strangle going in 30DTE, collected 29.22 originally 660/1030, rolled up the puts twice for 34.06 from 660 to 885 and then again to 900 for 5.50.  Still have an exit at 50% of the original target.\n\n  \nAll of that to say, I had a naked strangle open through last earnings and I had a natural close 2 seconds after opening bell for an additional $1000 on the position.  What would you anticipate the opening value after the IV crush comes in?  My exit is $54.17, but wondering if I should take that off and see if it dips or just let the MM's close it out below my number on opening.", "score": 1, "replies": [{"body": "Gotta say, I was a little worried on opening, but it hit my price target in the first minute, nice vol crush, but I was sweating the 1020 open with the 1030 call :)  Put made $2,543.61 and call lost $1,903.55.", "score": 1, "replies": []}]}]}, {"body": "My 4 CSPs 5/24 900 are now safer than yesterday. For those who sold CSPs and diamond-handed through ER, congrats! Let's go to the moon tomorrow together!", "score": 8, "replies": [{"body": "I got a 900/895p when are you closing?", "score": 1, "replies": [{"body": "I ride til the end for full premium I only has 1 leg 900.", "score": 1, "replies": [{"body": "Yeah i think im gonna try and let it expire", "score": 2, "replies": []}]}]}]}, {"body": "Huawei's Ascend line is the actual real competitor that Jensen has in mind. Because China is sanctioned, a lot of resources are being put into it as an alternative AI chip ecosystem, and performance wise they are about 1 generation behind. But again, because China's sanctioned, they are under pressure to push this technology as fast and as far forward as they can, leveraging a huge captive market for a very large ecosystem. Keep your eye on it, because Jensen sure is.\n\n[https://www.tomshardware.com/news/huaweis-gpu-reportedly-matches-nvidias-a100-report](https://www.tomshardware.com/news/huaweis-gpu-reportedly-matches-nvidias-a100-report)\n\nOther competitors, are just beginning to get off the ground by comparison.\n\nThat Jensen considers Huawei his real competition was something relayed to me last year by a guy I know in the semis industry stateside.", "score": 6, "replies": [{"body": "Looking forward to reading that later but wanted to reply in case in miss you as ive never seen you on here before. So China is dumping huge resources into the semi race? I know they are heavily investing in things like lithium. This is the kind of insight I was hoping for when I made my post so thanks! Other competitors like AMD? That reminded me Jensen said they are partnering with Intel. Do you follow Nvidia closely?", "score": 1, "replies": [{"body": "China is investing across the entire technology stack, but semiconductors are a core component of it, and an independent semis ecosystem is almost at the point of completion. The only thing left is EUV lithography, pretty much. The US's strategy has been to gimp the products it sells to the PRC, particular where AI is concerned, and that worked for a while, but it's getting to the point where the gimped gpus are no longer competitive with what they can produce domestically. Washington is very much behind the curve here, as the industry moves very fast.\n\nAs far as other competitors, AMD is an obvious one, but basically every one of the US megacaps has their own AI chip project. Jensen's approach towards getting customers is very much strong arming, and apple, meta, google, microsoft, amazon all want a way off Uncle Jensen's CUDA plantation. Expect at least a couple of these to pan out down the line.\n\n[https://www.reuters.com/technology/amazon-ai-startup-hugging-face-pair-use-amazon-chips-2024-05-23/](https://www.reuters.com/technology/amazon-ai-startup-hugging-face-pair-use-amazon-chips-2024-05-23/)\n\n[https://www.wsj.com/tech/ai/apple-is-developing-ai-chips-for-data-centers-seeking-edge-in-arms-race-0bedd2b2](https://www.wsj.com/tech/ai/apple-is-developing-ai-chips-for-data-centers-seeking-edge-in-arms-race-0bedd2b2)\n\n[https://www.reuters.com/technology/meta-debuts-new-generation-ai-chip-2024-04-10/](https://www.reuters.com/technology/meta-debuts-new-generation-ai-chip-2024-04-10/)", "score": 2, "replies": [{"body": "Would you mind providing clarity on one more thing??\n\nJensen mentioned in an interview after he finished ER that Nvidia isn't just making chips, they're making data centers (I believe he used that term??).  This was in response to the pundits question that was specific to chips.  \n\nMy question is, is Nvidia truly making everything soup to nuts or is he just increasing the size and scope of their product suite in a buzz word fashion?  I don't understand tech much but this ER call seemed to have a lot of buzz words, but I'm also invested in SMCI, for example, and I've always understood Nvidia as a maker of only certain components, not all of them.  I've also understood that they make the software to run their components too but I'm not sure if AMD/INTC do the same?\n\nThanks in advance if you're able to explain things to a commoner like me.", "score": 1, "replies": [{"body": "That Nvidia is making datacenters, he's talking about the blackwell-based server unit, motherboards and the rack itself.\n\nHGX B200 is a server board that links 8 blackwell GPUs\n\n[https://www.nvidia.com/en-us/data-center/hgx/](https://www.nvidia.com/en-us/data-center/hgx/)\n\nAnd these are combined in the GB200 server unit that links 72 blackwells\n\n[https://www.nvidia.com/en-us/data-center/gb200-nvl72/](https://www.nvidia.com/en-us/data-center/gb200-nvl72/)", "score": 1, "replies": [{"body": "So would the new Blackwell line decrease the need for SMCI’s rack products?", "score": 1, "replies": [{"body": "Supermicro is the main supplier for Nvidia branded racks.", "score": 2, "replies": [{"body": "Copy that.  Thank you for the answers and confirmation.  \n\nI find it difficult to understand much of the coverage out there because analysts either seem to know a lot and they use tech-speak or nothing and they're just as clueless as me as to what is *actually* going on.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[https://www.reuters.com/technology/nvidia-cuts-china-prices-huawei-chip-fight-sources-say-2024-05-24/](https://www.reuters.com/technology/nvidia-cuts-china-prices-huawei-chip-fight-sources-say-2024-05-24/)\n\nOnly one company is squeezing Nvidia's margins", "score": 1, "replies": [{"body": "Havent had much time to sit doen and read these articles yet but I will Sunday and will be getting back to you. Very intersted to get more of your insights", "score": 1, "replies": []}]}]}, {"body": "Hey so I went back and read all of the articles except the wsj bc im not subscribed. Basically all the big tech companies are developing chips. In the Huawei article it said they were about on par with Nvidia or am I wrong? Given the article was from last year im assuming that when you wrote you comment to me Nvidia had developed another chip that again had surpassed Huawei? Amazon seems to be developing a chip that can operate at cheaper rates than Nvidia. Why would META order Nvidia chips if they are developing their own \"MITA\" chip? Just to get legs they can use to get their project running? Also can you explain this quote by Kress to me? \"Our data centre revenue in China is down significantly from the level prior to the imposition of the new export control restrictions in China\" Are those the same restrictions that were mentioned in the Huawei article and if so, which way do those sanctions inpose their restrictions on, US cant export to China correct? Also, in the Meta article it says Taiwan semiconductor is making new chips are those for Meta exclusively?", "score": 1, "replies": [{"body": "The hyperscalers like meta and amazon are just beginning their projects, and their products are so low volume right now that they can't even supply their own needs for the next few years at least.  They rely on nvidia chips right now because their own products aren't as good and don't have the volume to replace nvidia gpus in their datacenters. These are just the baby steps to try to find a way out from Jensen's ecosystem.\n\nHuawei's Ascend is about 1-1.5 generations behind Nvidia, which given that Nvidia has to sell crippled GPUs to China by US trade law, makes them very competitive. Moreover a ton of Chinese companies have signed onto Huawei's ecosystem because it's the only credible player in China, and it can do it at some scale.\n\nMy friend whom I speak to about his industry thinks that Nvidia will enjoy another 2-3 years with their virtual monopoly.", "score": 1, "replies": [{"body": "Thats what I had figured their reliance was based on. So China is doing that so  they can remain competitive within their borders? Glad im not invested stock wise im too impatient for the buy and hold strategy. Since you are insightful into NVDA are you a shareholder? What is your typical investing/option strategy?", "score": 1, "replies": [{"body": "Buy and hold stock, sell options, scalp if I'm feeling it.\n\nThe most money in this market is made over longer timeframes.", "score": 1, "replies": [{"body": "Scalp as in daytrade?", "score": 1, "replies": [{"body": "I am one of the few here calling out scalps in the daily moves threads\n\n[https://www.reddit.com/r/thetagang/comments/1d36ua7/comment/l66al5y/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/thetagang/comments/1d36ua7/comment/l66al5y/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)", "score": 1, "replies": [{"body": "Nice. Yeah dont find many PA ppl here but thats ok. I call out PA but only on plays I am involved in. I made a good call on NVDA during earnings. Made a prediction on COIN not too long ago", "score": 1, "replies": [{"body": "Yeah, I post my daily moves here, mostly for entertainment.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "The market is largely responding to the split. The earnings were good, but they actually beat by the lowest amount since they missed awhile back. The split is getting people excited, because it will lure in dumb retail traders to buy the top and provide nice exit liquidity for hedge funds.", "score": 8, "replies": [{"body": "Does a larger ratio split fare better or worse for the markets? Do you think the Blackwell rollout helped any? Where do you think the top will be this week? Im guessing 1050. Always value your insight", "score": 1, "replies": [{"body": "It seems like they usually try to bring the share price down to around $100. I don’t think the ratio is important. Since the era of meme stocks, every time a big tech company has announced a split, the stock has rallied. It’s nonsense, but I think it’s retailers who don’t understand how stock splits work. \n\nI’m not going to put a price target in NVDA. I don’t follow it closely enough. I would guess the S&P won’t go much above 5500. I doubt NVDA would experience a correction outside of a larger market correction. At least not at this time. \n\nThere’s a chart that a famous analyst posted that I unfortunately can’t remember the name of. It shows how when there’s a new, big speculative technology in the market, it always goes through a cycle of being really overbought in the short term, followed by being really oversold in the mid term, before being more accurately priced in the long term. \n\nThe mid term oversold stage is when you want to buy, or buy back in if you took profits at the top. If that coincides with a bear market or broad sell off, NVDA will be the short of the century. People who got in early - 2022 or earlier will take profits because it’s had the biggest run up. Chumps who bought the top will panic and sell. \n\nLook at 2022, the most overbought stocks, the pandemic darlings, crashed the hardest. Don’t think everyone and their mother isn’t watching.", "score": 5, "replies": [{"body": "Wym share price down to $100? A $100 pullback? That money flow makes sense it seems based on trader psychology. Herd mentality follow by panic that weeds out the weaker hands. The reason I took this NVDA play was bc of historical beats and I saw remaining liquidity prior to earnings the PA looked primed", "score": 3, "replies": [{"body": "I really can’t comment on why anyone would do what they do when it comes to a split. It’s just an observation. \n\nIt seemed likely that NVDA would have a big move one way or another. I bought a couple OTM call spreads on a semi ETF and a couple OTM puts on SPY on the event that NVDA tanked the market. \n\nYou can’t trade a stock like NVDA through earnings with short premium imo. It’s 50/50 whether it exceeds the expected move but if it does and it’s against you, it’s asymmetric loss. At some point, it will drop 10% overnight and everyone who sold puts on a “sure thing” will be fucked.", "score": 3, "replies": [{"body": "Lets hope my short is far enough out", "score": 1, "replies": []}]}]}]}]}, {"body": "I don't think we're necessarily at the top until NVDA market cap is close to or even breaks Apple's market cap.\n\nIf NVDA market cap breaks 3T, thats probably the best moment to short it. Not because NVDA is a bad company by any means, but because eventually there will be a stalling in growth and a slowdown in AI demand.", "score": 1, "replies": [{"body": "Valuation yes, relation to apple is meaningless.\n\nI wouldn't short NVDA outside of a broader market sell off. It just won't go down until things turn. We're still in buy-everything mania. If we get another month like april with some follow through to the downside, it will be a great trade.", "score": 2, "replies": [{"body": "This. I want to see a larger sell off before i jump back in. Im hesistant of anything that looks like FSLR within a month. In all honesty I wouldnt of made that earnings play if I hadnt seen a strong position based on PA.", "score": 1, "replies": []}]}]}, {"body": "Yup, the split does nothing to help the company or change it's fundamentals.  It's all to get more retail investors to buy in.  Exact same playbook with Tesla and Apple near their highs and they haven't reached it again.", "score": 1, "replies": [{"body": "After doing some digging nvda isnt as attractive as it was at first glance they have some major competition in China and the big techs here are jumping in as well even if their tech isnt as good as nvda they will eat away at the market share", "score": 1, "replies": []}]}]}, {"body": "I bought more shares at exactly 1 min before market closed. Added 10% more shares to my positions already... $1337 coming EOM just like I predicted earlier this year.\n\n$2000 by EOY is already baked in. But come Feb/Mar 2025... all bets are off", "score": 3, "replies": [{"body": "$2000 share price by end of year? Is this a troll post lol", "score": 5, "replies": [{"body": "given that he siad 1337 this month, I would guess this is a troll post.", "score": 0, "replies": []}]}, {"body": "$1337 EOM share price?", "score": 3, "replies": []}, {"body": "you think this thing is going to fucking 1300 by end of the month??? bruh", "score": 2, "replies": [{"body": "Yeah i asked to confirm if thats what he meant bc...😳", "score": 1, "replies": []}]}]}, {"body": "-x6 5/24 855Ps @ 5.75.", "score": 2, "replies": []}, {"body": "Nvidia is a meme now; fundamentals don't apply anymore.  Even with the explosive growth, they would need to keep the same growth going for the next 5 years or so just to justify the current price.  The split was to get more retail to be bagholders.", "score": 2, "replies": []}, {"body": "Great sales. We can’t make enough chips. Q4 is going to be epic. This is the biggest thing ever since the wheel was invented. More stocks for everyone. Leather jackets for everyone.", "score": 1, "replies": [{"body": "Yeah its gonna be big hopefully i can get a large position built up before then", "score": 1, "replies": []}]}]}
{"title": "$15k NVDA earnings YOLO. Let's see if Jensen is gonna change the world!", "selftext": "", "id": "1cy5np8", "created_utc": 1716398077.0, "score": 80, "upvote_ratio": 0.89, "num_comments": 50, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 2821 | **Previous Best DD** | \n**Account Age** | 12 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Welcome to Wendy’s how may I help you", "score": 24, "replies": [{"body": "Need a reservation for the dumpster.", "score": 4, "replies": [{"body": "Looks like I can afford the upsize fries now!", "score": 2, "replies": [{"body": "Congrats!", "score": 1, "replies": []}]}]}]}, {"body": "Cramer is real quiet today", "score": 19, "replies": [{"body": "A jury never looks at someone they just sentenced to death.", "score": 7, "replies": [{"body": "Maybe he knew something and didn’t wanna get in trouble for insider trading", "score": 2, "replies": [{"body": "Tbh as much as everyone likes to hate on him, he's connected for sure. The dude prob contends with Nancy Polesi in returns.", "score": 3, "replies": []}]}]}, {"body": "He is not, he tweeted this:\n\"I know it is artifice but a ten for one split is good news for Nvidia\"", "score": 1, "replies": []}]}, {"body": "When are these bad boyz due?", "score": 5, "replies": [{"body": "Call just ended. My calls are gonna print!", "score": 3, "replies": [{"body": "want to see those gains", "score": 2, "replies": [{"body": "Here ya go. Not bad for an overnight trade.\n\nhttps://ibb.co/JHP2yVY", "score": 1, "replies": []}]}, {"body": "That’s fucking wild, Nvidia went nuts-o yesterday", "score": 2, "replies": []}]}]}, {"body": "NVDA above $1k after hours, I think this guy is going to be OK 👍  Don't forget to give an update #yolo", "score": 5, "replies": []}, {"body": "I got into NVDA in April. Sold Apple shares that I've been buying for the last decade.  Ended up with 52 shares", "score": 5, "replies": [{"body": "Both are safe bets! I'd play Russian roulette with those two all day. Dude you're safe", "score": 1, "replies": []}]}, {"body": "Might change your brokerage account ![img](emote|t5_2th52|4275)", "score": 3, "replies": [{"body": "Brokerage gonna be calling me for the VIP dinners after a call like that!", "score": 2, "replies": []}]}, {"body": "Nice bro congrats. How much you made?", "score": 3, "replies": []}, {"body": "gl boss", "score": 4, "replies": [{"body": "Your well wishes made it work! Thank you kind sir. Jensen for prez!", "score": 3, "replies": []}]}, {"body": "I’m sorry for your loss..", "score": 6, "replies": [{"body": "Looks like you're eating those words.", "score": 10, "replies": []}, {"body": "Hahahahahaha", "score": 2, "replies": []}]}, {"body": "Damn it I wish I understood calls. I have 6 whole shares lol up 5k but oh if it could be more . . .", "score": 2, "replies": [{"body": "Read up on it! It's essentially a contract that gives you the right to purchase 100 shares at a set price, but expires. This gives it a value that's either worth more or less than the current trading price.\n\nIt's a leveraged way to trade.", "score": 3, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "I have 3 contracts, calls for nvda @1000 with a may 24th strike. I got them yesterday (21st) for about 5.6k. How do you estimate their value for tomorrow?", "score": 1, "replies": [{"body": "What's the expiration?", "score": 0, "replies": [{"body": "Strike and expiration are different? IMay 24th is the only date I have.", "score": 1, "replies": [{"body": "Strike is price bet for the contract, you said $1000 he just didn't see. Expiry is the May 24th date", "score": 2, "replies": [{"body": "so do I get tendies tomorro?", "score": 2, "replies": []}]}]}]}]}, {"body": "He probably will change the world… you’re about to be a casualty in that process though.", "score": 1, "replies": []}, {"body": "IV is probably gonna fuck you. Hope your delta is good and you might make it out alive.", "score": 1, "replies": [{"body": "Dude this shit is gonna print hard. NVDA smashed it outta the park!", "score": 2, "replies": [{"body": "How the fuck do you figure? You only have $5900 as intrinsic value right now if delta is a 1.", "score": 6, "replies": [{"body": "With those shares, I am guessing around $1500 gain if it opens $1010 tomorrow. Not a homerun, but gain is a gain.", "score": 3, "replies": [{"body": ">Dude this shit is gonna print hard", "score": 1, "replies": [{"body": "Lol ok. Hard it is then", "score": 1, "replies": [{"body": "He's saying it's gonna print hard. It wont", "score": 2, "replies": [{"body": "Yea. Like I said, ~$1500 gain unless it opens 10%+. If OP think that is \"printing hard\" so be it. Lol. I am more curious about my spy and qqq calls tomorrow.", "score": 2, "replies": [{"body": "I think it’ll end up being like $6k? It’s not the standard  lambos people make on here but it’s not bad", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}
{"title": "SPY will moon ", "selftext": "Over the past couple of weeks we have seen multiple ATH skims around the same level. What we saw today is very bullish, there is an insane amount of pressure on the market right now. SPY has hit ATH and dropped into some big liquidity pools, if you know anything about trading this is a liquidity grab. Bears, you have bet on NVDA going down for months and how's that been? NVDA earnings will pump this to mars, try going green for once, I'm showing you ez gains. I also have a engulfing candle indicator which has shown to be very good to follow for bullish plays.  Positions in comments\n\nhttps://preview.redd.it/699s6qcvt02d1.png?width=1269&format=png&auto=webp&s=22e27e028acc5834e240cbb6e2c66ba59b81a3cc", "id": "1cy7h6p", "created_utc": 1716402485.0, "score": 21, "upvote_ratio": 0.61, "num_comments": 57, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 4 hours ago\n**Total Comments** | 10 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "how do you have -3 comment karma, inversing this", "score": 71, "replies": [{"body": "Dude has comments about donating plasma, I’m with you", "score": 16, "replies": []}]}, {"body": "QQQ holds more NVDA. Can’t wait for tomorrow’s rocket", "score": 32, "replies": [{"body": "regardless i think if nvidia does well, the market will, regardless of % of shares held", "score": 12, "replies": [{"body": "Absolutely agree! My position is calls on qqq. They hold more of NVDA. Everything will go up tomorrow", "score": 5, "replies": [{"body": "im looking at calls for qqq & spy, hopefully it falls a little more to get them cheaper at close", "score": 4, "replies": [{"body": "I, like an absolute dipshit, bought before the fed minutes were released. Enjoy your profits!", "score": 6, "replies": [{"body": "damn... yeah, i usually trade 0dte spy in the morning but decided not too till after fed minutes, worked out \n\n  \nwhats your exp? 5/23?", "score": 2, "replies": [{"body": "5/24 bought before minutes 😮‍💨", "score": 1, "replies": []}, {"body": "5/23 my exp. still excited even though its down 23% 😂😭", "score": 1, "replies": [{"body": "5/23 here as well and excited for AH", "score": 2, "replies": []}]}]}]}]}]}, {"body": "It seems like SPY isn’t reacting much as of rn 😩\nReally hoping there is a big upswing tomorrow (I have calls lol)", "score": 3, "replies": [{"body": "strike? 5/23 or 5/24?", "score": 1, "replies": [{"body": "Both $535 5/23 and $539 5/24", "score": 0, "replies": [{"body": "might be too far otm", "score": 1, "replies": []}]}]}]}, {"body": "I feel exactly the same!", "score": 1, "replies": []}]}]}, {"body": "“Positions in comments”\n\nIt’s been 3 hours. Ban.", "score": 9, "replies": []}, {"body": "Show positions", "score": 4, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}, {"body": "I also think this. June / July are going to be huge bullish months and I see this as the catalyst", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "How's that working out for you?", "score": 2, "replies": []}]}]}, {"body": "ive got a couple 555 calls expiring 6/21. praying for my port.", "score": 2, "replies": [{"body": "555 ??", "score": 2, "replies": [{"body": "$535 + 20", "score": 3, "replies": []}]}]}, {"body": "I hope so. I have 6 thousand reasons on it", "score": 2, "replies": []}, {"body": "Nvidia Goog Amzn Msft all to the moon confirmed, get in while you can. It’s your choice. Spy to 550+ by years end.", "score": 2, "replies": []}, {"body": "SPY 600 by end of year", "score": 2, "replies": [{"body": "637", "score": 1, "replies": []}]}, {"body": "lmao ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4275)", "score": 2, "replies": []}, {"body": "I believe tomorrow and perhaps rest of the week it will fush. Roast me but I'm swinging naked puts.", "score": 2, "replies": [{"body": "I’ll be exercising all my calls at open", "score": 2, "replies": []}]}, {"body": "SPY has gone up on negative divergence:\n\n[https://www.youtube.com/watch?v=w8bTc10g-8k](https://www.youtube.com/watch?v=w8bTc10g-8k)\n\nGood NVDA earnings will not push the market up all that much:\n\n[https://www.youtube.com/watch?v=MraQkqRJQFQ](https://www.youtube.com/watch?v=MraQkqRJQFQ)", "score": 2, "replies": []}, {"body": "Positions or ban :)", "score": 1, "replies": []}, {"body": "The US economy is eating the other economies of the worlds lunch", "score": 1, "replies": []}, {"body": "You speak all that analysis and you're depending on an indicator at last? 🫡", "score": 1, "replies": []}, {"body": "INCOMING MARKET CRASH INCOMING ![img](emote|t5_2th52|4640)![img](emote|t5_2th52|4640)![img](emote|t5_2th52|4640)", "score": 1, "replies": []}, {"body": "OP is tarded\n\nPuts ![img](emote|t5_2th52|18632)", "score": -1, "replies": []}, {"body": "NVDA will miss earnings. SPY and QQQ will -5% tomorrow.", "score": -7, "replies": [{"body": "I doubt it.", "score": 10, "replies": []}, {"body": "Ok so I might have been a little off", "score": 7, "replies": [{"body": "Finnally passed the 1k", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "We've all been there. We'll all be there again.", "score": 1, "replies": []}]}]}]}
