{"title": "Nvidia Expansion Plays - Intel Acquisition?", "selftext": "1. I recommend watching Jensen's interview with Patrick Collison at a recent Stripe Conference. Jensen forecasts the need to replace $2 Trillion worth of computers with GPUs.\n\nOptimistic forecast but I can see the need to move away from general compute. The concept of building A.I. factories is fascinating.\n\n2. Nvidia has a market cap of $2.6 Trillion. Intel \\~$130 Billion, or 5% of Nvidia. If the GPU compute demand is there, Nvidia will need to expand their manufacturing capabilities. Something Intel does well.\n\nEven at a 100% premium, an Intel acquisition would not dilute Nvidia shareholders by more than 10%.\n\nWhile I don't think this deal is likely (probably will get blocked), it's an interesting thought experiment. At what point will Nvidia manufacture more in-house vs outsourcing?\n\nLet me know what you think. Elliott announced an activist stake in Texas Instruments this morning too. It looks like more semiconductor deal-making will happen either way.", "id": "1d2otdc", "created_utc": 1716916642.0, "score": 0, "upvote_ratio": 0.32, "num_comments": 81, "comments": [{"body": "Even if for some bizarre reason they wanted to buy Intel, they wouldn't be allowed to by regulators", "score": 113, "replies": [{"body": "OP said as much", "score": 6, "replies": []}, {"body": "Why? Nvidia are chip designers. Intel has manufacturing. Intel is dying and Nvidia needs to start domestic chip production.", "score": 4, "replies": [{"body": "Intel is primarily also a chip designer, and one of the largest at that. \n\nNvidia's dominant position within the chip market also makes any large acquisition of another company in this sector much harder for them to do. We literally already saw this when the FTC blocked Nvidia's attempt at acquiring ARM", "score": 1, "replies": [{"body": "You’re basing this on old times. 1) Without acquisition INTEL could disappear. 2) the Gov sees domestic chip production for high end chips (Nvidia) as national security. They need to move production out of Taiwan. In the matter of national security monopoly’s don’t matter that much. It would be no different than if Nvidia started their own manufacturing facilities.", "score": 4, "replies": [{"body": "US govt wont allow Intel to be bought. Its in their security interest to have it remain here. Nvidia is a US company but they have a lot of roots in Taiwan. Additionally, because Intel creates both CPU and GPU now, if Nvidia buys up Intel, they instantly kill off the 3rd player in the GPU market, leaving GPU as a duopoly again", "score": 1, "replies": []}]}, {"body": "If trump is elected I could see a deal like that going through", "score": 2, "replies": []}]}]}, {"body": "They might be able to buy the foundry.", "score": 1, "replies": []}, {"body": "AMD managed to buy ATI, so in that sense there is a precedence, but yeah the regulators are more aggressive nowadays. It would help Nvidia build x86/X64 and do APU chips though but not sure about the advantages anymore, probably too small a business for them", "score": 1, "replies": []}, {"body": "agreed", "score": -17, "replies": []}]}, {"body": "Can I get what you're smoking?", "score": 38, "replies": [{"body": "Oxygen. I breathe high quality air from my data center room.", "score": -14, "replies": []}]}, {"body": "I wouldn't count Intel out on recovering and becoming a player once again. They have a large image problem they need to get over, but they are now sincere on fixing past issues of their world domination.   It will take time.", "score": 8, "replies": [{"body": "Agreed. Pat has been a good CEO so far working hard on the turnaround.", "score": 4, "replies": [{"body": "However, about the acquisition.   Nvidia tried to acquire a CPU company called Arm, and governments stood up and said it was anti-competitive and after almost 2 years it failed.  How would Intel be different?", "score": 4, "replies": [{"body": "I don't think it would be much different. Anti-competitive is a serious hurdle in a tight market like semiconductors.", "score": 1, "replies": []}, {"body": "That was very different since ARM licenses out their IP to hundreds of companies making processors. To have Nvida controlling that licensing would be problematic. A few companies have cross-licenses with Intel, but Intel doesn't provide them with designs.", "score": 1, "replies": []}]}]}, {"body": "Just seeing this thread now. How do you feel about Intel now?", "score": 1, "replies": [{"body": "They needed to cut due to week business.    Semiconductor industry is still trying to find footing for the next big take off.     The hype about AI was over done.   The street realizes AI is not going to be gigantic in 2025 but a slower increase through 2027.   The growth is still there.   Most computers out there are running Windows 10 which will likely be stopped support in 2025 so we have a huge wave of builds and replacements happening.    Consumers will need newer computers.", "score": 1, "replies": [{"body": "Interesting, I like it. Thanks!", "score": 1, "replies": []}]}]}]}, {"body": "Why don't they just buy AMD and get rid of competition once and for all?  Also reunites the family.  \n\n  \nJensen: Cousin, join me and together we will rule the universe!", "score": 49, "replies": [{"body": "Interestingly enough, AMD intended to acquire/merge w NVIDIA around 2005/6, but they ended buying up ATi instead.", "score": 17, "replies": []}, {"body": "Jensen is her uncle...but whatever", "score": 3, "replies": [{"body": "[https://www.cnn.com/2023/11/05/tech/nvidia-amd-ceos-taiwan-intl-hnk/index.html](https://www.cnn.com/2023/11/05/tech/nvidia-amd-ceos-taiwan-intl-hnk/index.html)", "score": 1, "replies": [{"body": ">Huang is Su’s “biao jiu,\"\n\n表舅 - is the Mother's Mother's older male uncle in Chinese.  It is basically the older Uncle on the mother's side relative to Su.  In Chinese those of that generation are given the Uncle title.\n\nBiao - in this case represents the female side family.\n\nJiu - is the Mother's Brother.", "score": 3, "replies": [{"body": "In the anglophone world, they are first cousins once removed.", "score": 1, "replies": []}]}]}]}, {"body": "lol might as well go big and go home", "score": -7, "replies": []}]}, {"body": "If Intel had the capability to make the chips Nvidia needs, they wouldn't be in their current situation.", "score": 8, "replies": [{"body": "nobody is competing with Nvidia today.", "score": 1, "replies": [{"body": "Huh?\n\nNvidia doesn't make their own chips.\n\nThey would hypothetically buy Intel to make their own chips.\n\nExcept intel doesn't have the ability to (only tsmc does).\n\nIf Intel could make chips at the level of tsmc, they wouldn't be having issues as a company.", "score": 6, "replies": []}]}]}, {"body": "First, even though Intel has a smaller market cap, they have similar revenue. Nvidia could never make an offer large enough without being all stock to buy them. It'd have to be mostly stock and some cash, and even then I doubt that they'd have enough.\n\nSecond, Huang has made it pretty clear that he doesn't have any interest in Intel's market. The culture of the 2 companies is so wildly different, and the way they run things(Nvidia more software, leaner ship, almost all in Cali vs Intel being mostly hardware, heavy fab filled ship, spread around the US) would cause major clashes and lead to terrible integration.\n\nThird, regulation. There's just no way that'd work out for Nvidia.\n\nFourth, why would Nvidia even want Intel? I mean, yeah, Intel is a massive company, but they operate in such different ways, and the future of the 2 companies is wildly different(Nvidia with Ai, Intel with fabs) It'd make so much more sense to buy an AMD, Qualcomm, or smaller chip company, or more likely a software company.", "score": 2, "replies": [{"body": "Very good points on 3 and 4. A smaller chip company would be the play. Not sure which EDA software provider but one of them is possible too.", "score": 1, "replies": []}, {"body": "Wouldn't be able to buy AMD, same issues as with ARM. With Intel though you grab lots of nice IP, manufacturing capabilities the ability to compete completely with AMD and smash out Strix Halo type products and compete in the console space as well. Might be a bit messy at first but honestly this is a no brainer for Nvidia at this point in the game.", "score": 1, "replies": []}]}, {"body": "Huang knows what he needs or doesn’t.", "score": 2, "replies": []}, {"body": "I think NVDA will buy MRVL, for Innovium, for Inphi, for its (Avera Semi) custom asic business, for its HSM business (security), leadership in SSD controllers, 5G customers at least, (even deals with Dell in the RAN space?).\n\nMRVL is number two to Broadcom in the high end custom asic market (think AI accelerators, complex DPUs even server SOCs, with a track record of delivering them).   It has some really big names as customers too.\n\nNVDA wants this business (all high end ASICs are now custom, thats what customers want, and its also incredibly expensive / technical to deliver these.  So expensive that the old model of building a complex DPU/NPU and then winning enough business to cover the costs, and make profit, is out the window, you can't afford to build something like this speculatively, then fail to win business, it just costs too much to \"fail\".\n\nWhy wait if you are NVDA, you can just buy your way into #2 by buying MRVL, then increase your market adding things like GPUs, etc.  Their stock is very high, take it out for a ride and buy MRVL, its just paper at this point.\n\nMRVL reduced from > 7500 employees to \\~6500 employees over the past year or so, I mean, thats not the sign of a company taking the world by storm *as it is* *shrinking*.\n\nOn the converse side, what is MRVL's long term story if it isn't an acquisition?", "score": 2, "replies": [{"body": "I like this scenario and think it is much better than the Intel play. Thanks for sharing the details.", "score": 1, "replies": []}]}, {"body": "Nvidia would be more likely to buy Intel Foundry Services, I suspect, with intel going fabless and being a big time customer. Intel Foundries could represent a growth opportunity or just a cost cutting measure. But they could probably get an x86 license out of the deal, if they wanted one. Actually it makes a lot of sense as a target for acquisition if the stock reverts to the mean but still ends up being worth a few hundred million. They would have a built in client in intel subsidizing it and the option to start broad foundry services (or probably not, honestly) or just control their own fabs. It has drawbacks and would be a big bet, but it might allow them to make silicon that can compete with Apple. That process node advantage they get is a touch nut to crack.", "score": 2, "replies": []}, {"body": "I've heard this before, and I don't see it happening. If it does, there is a ton of upside potential. I'm need more data to show its a sure thing. AFAIK NVIDIA is 'fabless', so expansion should mean more partnering with companies who can do it. Intel as a partner maybe, when they can deliver one of NVIDIAs newest products for data centers (Blackwell)", "score": 3, "replies": [{"body": "Agreed on the fabless part.\n\nI was thinking from the point of supply chain disruption. At their scale, it will cost billions if something happens at another manufacturing plant.", "score": 2, "replies": []}]}, {"body": "NVDA is acquiring a software company that they already use, think Synopsys, Cadence or similar. They would love to get ARM but that was blocked, likely to continue to up its stake in ARM though. \n\nIntel is a moneypit, pretty much worthless on many fronts, unless they get their foundry business up and going and that's debatable because they just don't have the right culture of human capital to make it a successful business.", "score": 4, "replies": [{"body": "who are they buying?", "score": 1, "replies": [{"body": "SNPS. It might not end up being true, but you heard it here first.", "score": 3, "replies": [{"body": "I thought SYNOPSYS was buying Ansys", "score": 1, "replies": [{"body": "That deal is already done. And had nothing to do with the other claim.", "score": 1, "replies": []}]}]}]}]}, {"body": "Now hear me out: merge all companies in the world into one single super corporation. No competition. Everybody wins.", "score": 3, "replies": [{"body": "sounds good to me. get it done", "score": 1, "replies": []}]}, {"body": "Market cap does not directly translate to cash. \n\nIntel is still a bigger organization; it did 2x revenue of NVDA last year. \n\n  \nThere is also little incentive for NVDA to purchase intel, their business models and cultures are too different.", "score": 3, "replies": [{"body": "Selling 5-10% of NVDA would generate significant cash. There is an incentive if you want to own your supply chain. It is accretive.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "That doesn't make any sense.", "score": 2, "replies": []}]}]}, {"body": "probably not possible due to regulators but maybe they will at least consider given how dogshit intel is now", "score": 1, "replies": [{"body": "😂", "score": 1, "replies": []}]}, {"body": "Intel and Nvidia sell to two totally different markets. Intel is almost exclusively x86, while Nvdia is RISC processors. Intel is a powerhouse in manufacturing. Nvidia has no manufacturing.\n\nSuch an acquisition would have little impact on competition.\n\nIt's hard to see Nvidia being interested in acquiring Intel. Pat Gelsinger has not been a great CEO. Intel's share price has declined by about 50% since Gelsinger took over, and that's not accounting for inflation, accounting for inflation, Intel shares have fallen by about 57%. Perhaps with proper management Intel could once again be a growing company. Does Nvidia really want to deal with owning fabs and the enormous costs of keeping those fabs up to date.", "score": 1, "replies": [{"body": "True and I agree. This argument is well supported now. Nvidia is crushing it on its own anyway.", "score": 1, "replies": [{"body": "But does it want to expand further?", "score": 1, "replies": [{"body": "every company wants to expand if its profitable", "score": 1, "replies": []}]}]}]}, {"body": "This is what may happen. Look at the Intel blood bath. Nvidia needs to buy domestic chip manufacturing.", "score": 1, "replies": [{"body": "probably too cyclical at this point. Elliott management is making an activist play on Texas Instruments and called out Nvidia's A.I. bubble today too.", "score": 1, "replies": []}]}, {"body": "@OP after today this is even more likely. If they do get bought out going long on intel the play or long on nvidia to profit the most from a merger? Still very new to stock. Which is better profit ratio? On the buyer stock or buyee stock?", "score": 1, "replies": [{"body": "unlikely given how cyclical the industry is right now. Nvidia had chip delays this because of a design issue", "score": 1, "replies": []}]}, {"body": "Jensen is my hero, the leader in the 4th industrial revolution 👍", "score": 1, "replies": []}, {"body": "There is also a chance that there is a usa/china military conflict in the future and everything that depends on TSM takes a dump and intel will buy nvidia's ip to keep everything in usa. \n\nsure it's farfetched, but crazier things have happened - for example nvidia buying up 3dfx back in the day.", "score": 1, "replies": [{"body": "the supply chain disruption is the only real trigger event I can see that will force Nvidia/Intel's hand", "score": 2, "replies": [{"body": "Guess we'll see. Interesting times we live in.", "score": 2, "replies": []}]}]}, {"body": "Never buy a sinking ship (Intel).", "score": 0, "replies": [{"body": "unless you have deep pockets? (pun intended)", "score": 1, "replies": []}]}, {"body": "Intel doesn't do manufacturing well. They are nowhere near top of the line. It would be a huge money pit to buy them and then overhaul all of their FABs.\n\nAlso, why does Nvidia need a FAB? They're making money hand over fist right now. Intel is unique in that they both design and build the chips themselves, and they are struggling. Hardly an endorsement of their business model.", "score": -1, "replies": []}, {"body": "INTC has only cost me money", "score": -1, "replies": []}, {"body": "For what purpose? Amd has been clowning on Intel for years. Intel doesn't even realistically compete with Nvidia outside of their very underwhelming gpus.", "score": -1, "replies": [{"body": "Access to manufacturing. In this case, they can buy instead of build to meet growing customer demand. It's an option.", "score": 1, "replies": []}]}, {"body": "Taiwan Semi Conductor is the major, and a better target Intel is a minor player", "score": -3, "replies": [{"body": "True but I don't know how well that plays with the CHIPs Act", "score": 0, "replies": [{"body": "F the chips act   Its monopoly laws that would mess with any acquisition NVDA makes. Since nobody else has their growth and margins, they are reinvesting not looking for acquisitions", "score": 2, "replies": []}]}]}]}
{"title": "Is it time to close NVDA calls yet?", "selftext": "I have a few NVDA options 850C, 860C expiring June 21st and 750C expiring Jan 15th. Doing well on the profits and am happy about it. Thetas are pretty low. With the split coming up, I was wondering when would be a good time to close them?\n\nI have already considered the following options:\n1. Closing the options after hitting a target profit.\n2. Rolling it out.\n\nI was wondering if you regards have any other suggestions for me?", "id": "1d28nup", "created_utc": 1716862508.0, "score": 17, "upvote_ratio": 0.67, "num_comments": 58, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 months ago\n**Total Comments** | 23 | **Previous Best DD** | \n**Account Age** | 3 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Just roll the strikes up to a delta you don't mind, take some profits and hold.\n\n  \ne.g. the Jan 15th, you can just roll up to something like 800/850/900c", "score": 9, "replies": [{"body": "Did that a couple of months ago resulting in 1000C with May 17th expiration which threw away a lot of money. I understand that is a matter of chance but not very excited about rolling it out as I am not sure I have gotten a hang of it.", "score": 4, "replies": [{"body": "1000C with may 17 expiration would have been far OTM if you did that 2 months ago. That’s a super risky roll. \n\nI’m saying you should consider rolling your Jan LEAPs to a delta that’s still far ITM. So probably around 0.7-0.8 delta. You can basically keep doing this - if it starts to go against you, roll the expiration out a bit. \n\nYou can even sell covered calls on these (look up PMCCs) to generate premium.", "score": 8, "replies": [{"body": "Two \"months\" ago not \"years\"", "score": -1, "replies": [{"body": "Yeah sorry I meant “months”", "score": 3, "replies": [{"body": "Hmm... I can better visualize things when the market is in session. Will definitely check out how they will fare if I roll them out according to your suggestions. Even though I am trying to maximize my profits there is definitely a minimum number I have to cover my already occurred losses. If rolling out doesn't meet that minimum number it makes my decision but easy.", "score": -2, "replies": []}]}]}]}, {"body": "You could also always start selling calls against your long calls.\n\nyou say you're holding june 21 calls, you could start selling say 1300 strike calls expiring in june to offset some of your cost.\n\nthe june 21 1300 strike call is selling for $1250 right now. if the stock pulls back, then those calls will get vaporized and you can keep the premium.", "score": 2, "replies": []}]}]}, {"body": "i'm letting my LEAPS ride until after June 7th. i'm betting on a small bump up in price after the split takes place", "score": 5, "replies": [{"body": "Do you know how contracts will be affected with the split? If I had 6 LEAPS, would i then have 60 post split?", "score": 2, "replies": [{"body": "Yup and obviously the price per contract will be divided by 10 as well", "score": 2, "replies": []}]}]}, {"body": "In theory after the split Nvidia should rally more, but who knows", "score": 5, "replies": []}, {"body": "Exercise them bad boys", "score": 18, "replies": [{"body": "Yeah OP set $1000/contract on fire", "score": 28, "replies": [{"body": "He can sell the contracts and then buy the shares, just like what I did.", "score": 14, "replies": [{"body": "Yeah that would be the smart way to convert calls to shares", "score": 8, "replies": []}, {"body": "I was hoping to do something like this. But the issue with this approach is a good time to buy the stocks logically would be pre split. Which means I will have to cash out of these options pre split which I am not sure is a good idea. Hence the discussion", "score": 4, "replies": []}, {"body": "Or sell the calls and buy puts 😉 😜", "score": -1, "replies": []}]}, {"body": "This.", "score": 4, "replies": []}]}, {"body": "I am not regarded enough to throw away $500-$1100 per share in extrinsic value. Not going to exercise.", "score": 6, "replies": [{"body": "I’m too regarded to understand what that means. But you in a good position either way you approach it 🚀", "score": -7, "replies": [{"body": "Here is the math as I understand it. My 750C was worth around 36,000 when NVDA was 1000. Every call has an intrinsic value and an extrinsic value associated with it. In the above case it's (1000-750)*100 ie 25000 is intrinsic value. So, the extrinsic value of the above call is 11000 which translates to 1100 per share.\n\nIf I exercise the call and immediately sell the shares, I will make the 25000 in profits but would lose the extra 11000 in extrinsic value. Which is why most people say not to exercise ITM options.", "score": 2, "replies": [{"body": "it's 110 extrinsic value per share. why would you even think that for such deep itm options the extrinsic value per share is higher than the share price?\n\nalso no one in the world can tell you if you should sell the options, let alone ppl in this forum.\nif you lack this much of a plan what to do when holding options I think you got the answer to your original question", "score": 3, "replies": [{"body": "Yea I’m not sure why he thought $1100 per share lol. But yes you do lose the premium on the contract. So you can alternatively add that into the calculation of exercising the calls. Which should be around $860 per share. Plus if you hold for a year you save on tax as well", "score": 1, "replies": []}]}, {"body": "That makes sense. I guess it depends if you want to hold onto the 100 shares at $860 adjusted per value. maybe save on taxes long term? I don’t know but good lucks, in a similar position 😃", "score": 0, "replies": []}]}]}]}]}, {"body": "Why not sell enough to take a small profit and let  the rest ride. Personally taking a profit is never a bad idea.  But since this is wsb let it buy more and right it until the wheels fall off.", "score": 3, "replies": [{"body": "I have done that with 950C I had expiring June 21", "score": 1, "replies": []}]}, {"body": "Those calls become less liquid post split if they behave like any other split I've seen. I wouldn't hold them thru a split and end up with adjusted options that nobody is buying personally", "score": 4, "replies": [{"body": "Valid concern. Will definitely think about this. \n\nAs per my reading, weirdness in options happens for unusual splits like 3:2 etc right? This one seems like a pretty straightforward split. WDYT?", "score": 2, "replies": [{"body": "Honestly NVDA may be different than lesser company splits I've followed.  But every time I've watched thru one.  Adjuated options volume falls off the face of the map. As the majority of buyers move to the new regular options.", "score": 2, "replies": [{"body": "Why do the calls become less liquid? I would think since the options would also become cheaper after the split, that they’d be easier to offload", "score": 2, "replies": []}]}]}, {"body": "Wouldn’t they just give him 10x the calls with a strike at 1/10 the current strike?", "score": 1, "replies": []}]}, {"body": "It’s ultimately up to you, but if I were in your position, I would try to make it free, sell some options to cover your initial investment and maybe some profit on top, and ride the rest of it out. \n\nIf you want to own NVDA if you don’t already own shares I would take the lowest strike option contract, and wait until it’s nearing its expiration and depending on the price exercise it and keep the shares at the lowest cost basis. This will help with taxes I think but I could be wrong. Consult a CPA about that but I think it will save you on paying taxes for your options.", "score": 4, "replies": [{"body": "Good advice. I not only have to cover initial investments but some losses I have taken also :-P like a rolled out 1000C with May 17th expiry. My math selling everything puts me at a good profit covering earlier losses too. So, was hoping to maximize the profit. Since theta is small I can hold on for some time. Just not sure pre or post split.\n\nI own shares already so exercising is out of question.", "score": 2, "replies": []}]}, {"body": "If you're happy about it, close it. Simple.", "score": 2, "replies": []}, {"body": "Let me know what you end up doing! I’m in the same boat. Holding onto June 21st calls that I’ve held since early March", "score": 2, "replies": []}, {"body": "Pretty simple, hold if you think Nvidia has more upside, sell if not", "score": 2, "replies": [{"body": "Disagree. Sell if you think going up and hold if you think it will crash. ", "score": 12, "replies": [{"body": "Solid advice", "score": 2, "replies": []}]}]}, {"body": "nope. id hold until after split", "score": 1, "replies": []}, {"body": "Take the profits, please!", "score": 1, "replies": [{"body": "Good advice... Didn't expect it from \"Born Wild\" though... ![gif](emote|free_emotes_pack|joy)", "score": 2, "replies": [{"body": "Trust me, I was to wild too many times 😅", "score": 3, "replies": []}]}]}, {"body": "Close them at open tomorrow fast.", "score": 1, "replies": []}, {"body": "If you had no positions would you buy the same positions you currently have? Ask yourself that question and you’ll get your answer", "score": 1, "replies": []}, {"body": "I'd close them before the split. Post-split options are a pain, even if they are profitable.", "score": 1, "replies": []}, {"body": "I would hold and exercise some of those June 21s after the split, if you think NVDA can keep it up. Makes exercising much more manageable with the 10-1 split.", "score": 1, "replies": []}, {"body": "If you are thinking about closing them now at least take advantage of the hype and just sell calls against your calls to lock in that money", "score": 1, "replies": [{"body": "Care to elaborate?", "score": 1, "replies": []}]}, {"body": "I'm in a similar situation, 565C for March 25. I'm going to wait for the split, after that we'll see", "score": 1, "replies": [{"body": "You’re full of 💩, there’s no $565 strike expiring 03/21/2025 so STFU", "score": 1, "replies": []}]}, {"body": "If you wanna stay poor sure.", "score": 0, "replies": []}, {"body": "Option (pun intended) #3: sell june 21 OTM calls to reduce cost.\n\nI have no idea what you paid for say the 06/21 850c, but lets say you paid $10K for it. Current price is around $29.7K.\n\nSell the 1300 call expiring the same day at 1300 for $1200. You can do this on all of your long calls and collect some premium. If it really actually goes up above 1300 by then, fair enough - you can just exercise your long calls and then get assigned on the short ones.\n\nIf it doesn't then you keep $1200 per contract and reduce your cost basis\n\nAdjust the short call strikes according to your prediction. If you think it keeps mooning then go farther OTM. If you think it pulls back or will start to flatline then go further towards the money", "score": 0, "replies": []}]}
{"title": "APPLE WILL SAY “AI” MULTIPLE TIMES VIA BROADCAST ON JUNE 10 REGARDS", "selftext": "I already called up the wife (yours) and let her know I’m accumulating some weekly and June 7/14 calls today to cover our summer vacation.", "id": "1d2kjci", "created_utc": 1716905767.0, "score": 280, "upvote_ratio": 0.95, "num_comments": 72, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 427 | **Previous Best DD** | \n**Account Age** | 5 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Update\n\nhttps://preview.redd.it/frhbwdv6y63d1.jpeg?width=1290&format=pjpg&auto=webp&s=2876ba49f176b25aea075325f4596c652d629a54", "score": 51, "replies": []}, {"body": "Capital gains for me, not you.", "score": 61, "replies": [{"body": "Well, that is only fair seeing as you’re driving this rally.", "score": 26, "replies": []}]}, {"body": "Update\n\nhttps://preview.redd.it/cyhtz1o0t63d1.jpeg?width=1290&format=pjpg&auto=webp&s=e183365a0244b3ce6e16b584b90711f77af4a8f4", "score": 21, "replies": []}, {"body": "WWDC is way over-hyped this year. Most of the big announcements have been leaked ahead already. And stuff like AI emojis doesn't materially change Apple's business. \n\nStill, I think it will run-up like MS' build conference. Debit spread strategy might be the most prudent. The stock isn't going to drop much going into WWDC.", "score": 16, "replies": [{"body": "I’ve closed out the May 31 calls for a loss but kept June 7, 14, 21 calls. Need between 195-200 to start closing", "score": 4, "replies": [{"body": "Good luck homie", "score": 5, "replies": []}]}, {"body": "Here, take my downvote. Worst comment on this post. Apple acquired 32 Ai companies in 2023, and potentially made a deal with Sam Altman. It is more than just emojis. We are talking about full integration of Ai and Siri. This could spark a massive tech refresh amongst their user base which is global and massive. Their future earnings reports are going to be $$$$$$. They haven't even talked about their hardware plans and rumor is that they are securing most of TSM's 2nm chips in the future. Something big is coming and Apple is doing what it does best, shutting its mouth.", "score": 2, "replies": []}]}, {"body": "jokes on you.  i have some of the same options so either we're all going to the same vacation spot or our wives will be hanging out with their boyfriends while we post memes on the internets.", "score": 15, "replies": []}, {"body": "Time to start an earnings call drinking game like we had in the dot-com boom with \"EBIDTA\", \"hockey stick\", etc.", "score": 25, "replies": [{"body": "I wasn’t on those calls. I was busy trying not to alert my parents with the dialup signal so I could get off to 3/5th of a photo of boobs", "score": 18, "replies": []}]}, {"body": "So Nvidia green some more?", "score": 5, "replies": [{"body": "Yea made 30k today on NVDA", "score": 4, "replies": []}]}, {"body": "F this I’m in", "score": 4, "replies": [{"body": "Welcome. We may be priced in, I’m just a dummy", "score": 5, "replies": [{"body": "It isn't priced in because everything coming out in the news is just rumors and assumptions. Sell the rumors and buy the news as you regards say.", "score": 1, "replies": []}]}]}, {"body": "AiPLE", "score": 5, "replies": [{"body": "Gonna be grAIt", "score": 3, "replies": []}, {"body": "OpenELM", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/5gloebo0jd3d1.jpeg?width=1290&format=pjpg&auto=webp&s=5d357bb95709c60655aa3f7535d36d7c4105f2ee\n\nUpdate. Don’t you quit on me, Tim Apple", "score": 4, "replies": []}, {"body": "They damn well better. NVDA is one good day away from overtaking them in market cap.", "score": 3, "replies": []}, {"body": "Thats all the DD i needed, joining you sir", "score": 3, "replies": []}, {"body": "I am in it with you, but different calls", "score": 2, "replies": [{"body": "Lfg TayTay 😎", "score": 2, "replies": []}]}, {"body": "What's the current Idiot Ratio of #-of-AI-mentions to Stock Increase?", "score": 2, "replies": [{"body": "Idk what that means bro I’m just pushing buttons here", "score": 1, "replies": []}]}, {"body": "Will Apple hit $200 after wwdc? What are your thoughts? I would like to know. It seemed to go to $194.5 ah last night, but went down today, but from what I understand wwdc should be a catalyst for it to go up. Just not sure how high?", "score": 2, "replies": [{"body": "No clue. I think it could be a catalyst, but this is a casino", "score": 3, "replies": [{"body": "That’s very much true ", "score": 2, "replies": []}]}, {"body": "Some perspective. \n\n**Apple (NASDAQ:AAPL)** is the least shorted stock, with 94.31M shares sold short or 0.62% of the shares float, followed by Microsoft (NASDAQ:MSFT) and Trimble (TRMB) with short interest of 0.68% and 0.72% respectively", "score": 2, "replies": []}]}, {"body": "https://preview.redd.it/l3iofgakdh4d1.jpeg?width=1290&format=pjpg&auto=webp&s=c98f9215928a312e4aa032d6214a00fe40f09c92\n\nUpdate. Next update will be post liquidating for better or worse", "score": 2, "replies": [{"body": "W", "score": 1, "replies": []}]}, {"body": "Searched for this post to say thank you. Bought my first options,  June 21 calls because of you. Just closed them for a 500% gain. Tim Apple, what a guy.", "score": 2, "replies": [{"body": "Hell yeah glad you got a play!", "score": 2, "replies": []}]}, {"body": "They also will probably say declining iPhone sales which is like their main business so I dunno about these calls chief\n\nRisky business", "score": 5, "replies": [{"body": "China sales are rebounding, and they’re hyping the 10th as most important announcement in a decade. Granted I am hoping for a $10 move on not much news.", "score": 10, "replies": [{"body": "Fair enough", "score": 1, "replies": []}]}, {"body": "WWDC is a software event. They don't talk about hardware sales.", "score": 5, "replies": [{"body": "Gotcha I thought it was their earnings report OP was talking about not some nerd conference", "score": 1, "replies": []}]}, {"body": "You clearly have no idea what happens in WWDC, right?", "score": 5, "replies": [{"body": "AI happens bro, AI happens", "score": 2, "replies": []}, {"body": "Nope I don’t follow every little nerd fest sorry boss\n\nWhen you get done polishing your Lego collection your gf and I need more condoms. Jk we don’t use any", "score": -11, "replies": [{"body": "I forgot about all you macho investors around here, I hope your dick is as big as your losses.", "score": 4, "replies": [{"body": "I am up all time muchacho. You wanna compare all time gains? 😘", "score": -5, "replies": [{"body": "Sure stranger, nothing would leave me more excited today, than accepting the invitation of an internet stranger to compare dick sizes.", "score": 5, "replies": [{"body": "I mean you’re the one who brought losses into this\n\nBut I get you don’t wanna show off that tiny portfolio. It’ll grow if you play your cards right and then she will finally love you 🥰  surely", "score": -5, "replies": [{"body": "You belong here regard. ![img](emote|t5_2th52|4271)\n\nBe careful about the whole thing about wife’s and their boyfriends.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Not gonna matter, they're now viewed as a laggard in the AI race.", "score": 4, "replies": [{"body": "This debauchery is brought to you by Nvidia calls earnings", "score": 4, "replies": [{"body": "Time to DCA.", "score": 2, "replies": []}]}, {"body": "Incorporating ChatGPT or something similar made by open AI only means Apple is really lagging behind, I don’t get the collective excitement", "score": 2, "replies": [{"body": "I don’t either, I just like to gamble", "score": 2, "replies": []}]}]}, {"body": "120 times? what’s the over/under?", "score": 1, "replies": []}, {"body": "Just sold half my 197.5c @192. holding the other half til WWDC![img](emote|t5_2th52|31224)", "score": 1, "replies": []}, {"body": "Had 300 $215 August calls and panic sold for $800 profit after being down $30k for months.  Got back in with 50 calls.  Ride or die.", "score": 1, "replies": []}, {"body": "crapple lol\n\n![img](emote|t5_2th52|4271)", "score": 1, "replies": [{"body": "Heheh", "score": 1, "replies": []}]}, {"body": "Following", "score": 1, "replies": []}, {"body": "Priced in dingus", "score": 1, "replies": [{"body": "Hehe could be right my brother in Christ", "score": 1, "replies": [{"body": "If Apple had AI hype priced in they would have tanked last earnings due to not revealing anything.", "score": 2, "replies": [{"body": "Foolish armies of the night are trying to lay siege to Apple. March onward.", "score": 2, "replies": [{"body": "That’s kinda scary bro", "score": 1, "replies": []}]}, {"body": "Yeah price targets upgrading to 230-250 range but only time will tell if I’ve jumped the gun on these. Has been pretty stagnant so far.", "score": 1, "replies": []}]}]}]}, {"body": "LMAO...RIP.", "score": 0, "replies": []}]}
{"title": "The Mexican snow monkeys are NVDA trouble!", "selftext": "", "id": "1d2thbx", "created_utc": 1716927718.0, "score": 512, "upvote_ratio": 0.95, "num_comments": 59, "comments": [{"body": "Thanks for your submission! \n\nr/WallStreetBets is known for making absurd but sometimes profitable trades that no one ever considered possible.\n\nTo keep making that possible, we need your help in keeping the feed of threads interesting and exciting.\n\nWe try to move all the short and basic questions, analysis, or jokes to the daily thread so that the best quality content can stick around and be more visible. \n\nThis is definitely a bit subjective, and there are no hard and fast rules, but a few indicators that your post should have really been a comment in the daily thread include:\n\n* Asking a question that is easily googleable or has likely been asked before. E.g. \"What app should I use?\", \"What should I invest in?\". \n\n* Beating a meme to death, like the 10 millionth, \"inverse cramer\" joke again. \n\n* Reposting jokes from the front page but slightly altered to be related to trading. \n\n---\n\nAll that being said, we are here to help. We want to make it as easy as possible for you to post to our community. We have to balance this with making the subreddit interesting for our readers. \n\nIf you need some guidance, don't hesitate to [reach out to modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets) and we'll give you some pointers!", "score": 1, "replies": []}, {"body": "Huh.\n\nTSX (Toronto Stock Exchange) is at C$3.55T which is $2.60T, so yes, this appears to be true.\n\nhttps://money.tmx.com/en/quote/%5ETSX/constituents", "score": 90, "replies": [{"body": "There are other stock markets. And not all of them are cross listed on the TSX.", "score": 20, "replies": []}, {"body": "So I could either own all of NVDA or own every company that trades on the TSX?", "score": 5, "replies": [{"body": "I'd still pick nvda", "score": 5, "replies": []}]}]}, {"body": "$2.72 trillion? That’s a lot of maple syrup.", "score": 59, "replies": [{"body": "Mac and Cheese too eh?", "score": 7, "replies": [{"body": "Don’t forget to the poutine too, buddy.", "score": 8, "replies": [{"body": "Don’t forget to the timbits too, guy.", "score": 3, "replies": [{"body": "timmies is american owned...soo.", "score": 3, "replies": [{"body": "Mostly Brazil actually 😵‍💫", "score": 4, "replies": [{"body": "oooo......my bad. really? interesting", "score": 2, "replies": [{"body": "We don't like to talk about that.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "It’s called Kraft Dinner you fraud", "score": 2, "replies": []}]}]}, {"body": "Are Mexican snow monkeys Canadians?", "score": 73, "replies": [{"body": "Sasquatch!!!  ![img](emote|t5_2th52|27421)", "score": 2, "replies": []}, {"body": "I don’t get it?", "score": 2, "replies": []}, {"body": "According to the all mighty Trump we are.", "score": -8, "replies": [{"body": "As a real mexican, mexican snow monkeys is a perfect name for you guys. God that trump is clever. Anyway have fun with your terrible economy and that “great healthcare” system you all have.", "score": 16, "replies": [{"body": "we just need a few million more Indians and i'm sure everything will be fine", "score": 22, "replies": []}, {"body": "hey, it's shit but still beats U.S. healthcare by a mile. No other country wastes even as close to as much money for so little.", "score": 4, "replies": [{"body": "Not if you have good health insurance from a good job brother. Have fun waiting in line at the hospital behind 1000’s of immigrants. ", "score": 2, "replies": [{"body": "Yeah, i just pay several thousand a year at my job for the privilege of waiting 8 hours in the ER waiting room instead of doing it for free :)", "score": 6, "replies": []}, {"body": "Regardless if YOU have it, as a taxpayer you're still flushing heaps of money down the toilet for basically nothing, so I guess that's worth being smug about? and hey, who cares about those that don't have it, especially in a nation that relies so heavily on poverty. \n\nMeh, I'm younger, I'm not concerned right now.", "score": 1, "replies": [{"body": "You pay heaps that go down the toilet. My company pays heaps to give me healthcare while paying me heaps. You just have a smug PM that laughs in your face while he gives your money to immigrants and puts their housing needs instead of every citizen in your country. ", "score": 3, "replies": [{"body": "oh dear. i guess you honestly don't understand. The American government spends heaps of money on healthcare, it's the least efficient spending in the developed world for healthcare. YOU are a taxpayer, so YOU are paying for those inefficiancies....my goodness. Your company pays for your healthcare, yup, but you pay for a shit system, the least efficient one in the developed world. You seem to have an issue with immigrants, good luck with that. sounds like a you issue. Every western country, russia, china, and japan are facing population decreases and it will be an economic concern, hence some countries have immigration. \n\nOh it's not handled well here, but don't type to me from that dumpster fire of a country and pretend like you got it all figured out champ. And if you want to talk about leaders, which of the incapable 90 year old dementia patients will you be voting for?\n\nI'm no fan of justin, but at least I'm confident he can lace up his shoes and read the instructions off the back of a pill bottle without adult help or supervision. jesus christ.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I mean, the same applies to MFST and AAPL....\n\nhttps://www.marketsmedia.com/ftse-russell-begins-annual-russell-us-indexes-reconstitution/", "score": 15, "replies": []}, {"body": "Canada has a stock market???", "score": 39, "replies": [{"body": "Did anyone tell them?", "score": 18, "replies": []}, {"body": "They trade maple syrup and Canadian bacon", "score": 7, "replies": []}, {"body": "Yup! It's been run by the McDonald family since the end of the Igloo wars way back in 1982. Shortly there after electricity was pumped in to most cities, and we needed a system to trade our vast wealth generated from Rush royalties and broken hockey sticks.", "score": 4, "replies": [{"body": "Calls on Canadian sense of humor! 🤣", "score": 1, "replies": []}]}]}, {"body": "Honestly can’t wait for the rugpull on Nvda the valuation is absurd even before the most recent run up", "score": 37, "replies": [{"body": "It’ll become more absurd before the rugpull.", "score": 13, "replies": []}, {"body": "After all this training ChatGPT can write fluent poetry but has only become marginally better at programming. What if all these companies get stuck with fancy poetry generators which can’t actually replace workforce. Only jobs that are replaced are in content generation\n\nRight now everyone is selling productivity tools and if all these models remain just that- then we would be hit with a blast bigger than that Beirut explosion when bubble pops.", "score": 2, "replies": []}, {"body": "They’re not, you’ve just never seen a company grow this quickly and profitably before.", "score": -10, "replies": [{"body": "When it requires them to sustain ridiculous profit margins and growth for 40 years in a tech company to justify valuation  that is a 0% chance of happening", "score": 2, "replies": []}]}]}, {"body": "Snow gringos\\*", "score": 4, "replies": []}, {"body": "canada should invest in NVDA....", "score": 3, "replies": []}, {"body": "Nvidia should buy canada", "score": 3, "replies": []}, {"body": "Poots on me ![img](emote|t5_2th52|4260)", "score": 2, "replies": []}, {"body": "honestly with how shit our economy is its a wonder why anyone wants to invest in Canada :/", "score": 3, "replies": [{"body": "You idiots keep voting for people that do this.", "score": 9, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "yeah, tick the same box for 60 years without being informed. our saviors!", "score": 5, "replies": []}]}]}, {"body": "depends on the sector. investing in canadian financial institutions, not a bad idea. ours held firm when yours shit the bed and nearly caused a global recession in 2008. Even your most recent round of bank collapses. We don't have that hear. \n\nOther sectors have good investment here, and it's a much less hostile and litigious to do business here than in the U.S. For that reasons some companies would rather invest here, mostly commonwealth ones. But we're much more heavily taxed, which drives away investment.", "score": 3, "replies": []}, {"body": "[deleted]", "score": -7, "replies": [{"body": "fucked the wording a bit I meant why would anyone want to invest in Canada. \n\nbut yeah true", "score": 2, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 168 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Wait. I can’t tell if this is really racist", "score": 1, "replies": []}, {"body": "Are you telling me I can buy Canada for only $2.7t?\n\nSounds like a bargain", "score": 1, "replies": []}, {"body": "Soon it will be all of the US stock market ![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)", "score": 1, "replies": []}, {"body": "Who cares about Canada eh", "score": -2, "replies": [{"body": "Take off, eh. Ya hoser", "score": 5, "replies": []}]}, {"body": "Loser canada,they live in igloos", "score": 0, "replies": []}]}
{"title": "Made $4k on NVDA Calls today, how tf do I do this every day...", "selftext": "[removed]", "id": "1d2tza2", "created_utc": 1716928910.0, "score": 4, "upvote_ratio": 0.57, "num_comments": 55, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "best advice would be to quit now", "score": 54, "replies": [{"body": "Way, way, underappreciated comment right here.", "score": 8, "replies": []}]}, {"body": "Just wait until you start going *down* 4k a day chasing the high you are feeling right now.", "score": 34, "replies": []}, {"body": "Short answer, you don't. You got lucky, be happy, celebrate if you want and don't expect it to happen again soon. Also post your loss porn when you don't listen.", "score": 13, "replies": []}, {"body": "[removed]", "score": 7, "replies": [{"body": "I was just wondering what percentage is a good goal for options trading? Or whether that depends on market conditions, or…?", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Yes, I have no idea how I’d manage in anything other than a raging bull market! For now, staying within expected moves or close and buying time…makes it seem easy. Ten percent of portfolio is about where I cap it intuitively. And typing that, I just realized that I need to learn better risk management and a more firm plan. I think for now, I keep it to where a total loss would be ok, as I expect a bearish time to come and bring that about. In fact, I realized I bought 25 more absolute hit or miss contracts last week, just today, and have to reduce the position.", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Risk management is for cowards. Embrace the volatility.", "score": 2, "replies": [{"body": "I heart volatility! Or hold through it, unafraid. But, Rule number one….", "score": 1, "replies": []}]}, {"body": "Sobering. So simply stick with what I do now? That’s simpler than what I was expecting to hear. At this point, with a time limit, I do expect total loss and am delighted by gain. \n\nI will still work to up my odds. Do you think that’s possible? Right now, buying with a bit of time is like buying the index to me, in shares, in a sense. Therefore skewed in favor of calls (I’ve only hedged or been silly in a very small way with puts.)\n\nBut basically, timing the market is a fool’s errand? Or a lottery ticket is what you’re saying? So only LEAPS make sense as far as capital allocation…?", "score": 1, "replies": [{"body": "This is my approach, in a sense. Toss money at better odds than the lottery, pick up gold when it’s coming and stop playing once the music stops. Though I thought that was due to my lack of education/experience. Underscores the importance of only risking what can absolutely be lost at a true downturn. Though I *was* hoping to learn how to succeed in other markets in time.", "score": 2, "replies": [{"body": "Sounds like a gamble, friend. High risk, high reward.", "score": 3, "replies": [{"body": "Acceptable risk only. Yup, regretting not selling yesterday. \n\nBecause I like the gains. Still within the ‘total loss’ allocation, but. I don’t like loss. With that, I won’t push quite so far into “all or nothing.” Thanks. You guys helped me out tonight.", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Thanks! This is on an overweight (for me) position in ASTS shares and calls, am happy with gains. Will sell half in the morning (sold the last round, but pure luck.) And, have a couple of catalysts upcoming that I can sell that 35%, but also bought time in case it’s only a delay vs a cut bait (I’m not sure I used that analogy correctly.) Which leaves a bit to ride into glory, but if no, lots gained, nothing lost. I know it’s uncomfortable to share insight, but I’ve learned a great deal and have found peace with that position. And will sleep on whether I’m *really* ok losing 10% on options. I think I am, at this point - the danger…\n\nJust realized, is what you e pointed out. Chasing it again. I appreciate you.", "score": 2, "replies": [{"body": "That is all of the options positions that I’ve opened. I have far far too many for my comfort, beyond ASTS.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Hahahaha. Do they have those? Shocker, I know, I won’t eat at Wendy’s until it’s all I can dodge out of the dumpster!", "score": 2, "replies": []}]}]}]}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "Like, the main, perhaps, only reason my portfolio is up, is that this market has been so amazingly strong. I started in a small way in 2020/21, made mistakes and only recently up on that. Then 2022 was absolute magic and…into now. I’ve bought very few puts, only on memes. My base is certainly shares. My success on those is big tech and Berkshire. And I just started trading options last year - but, to be very simplistic, if a good company, buying calls with a little time is profitable. The only strategy per se, is if I can’t afford 100 shares (within my allocation, anyway,) is to buy LEAPS if I believe a particular company will do well in the longterm. So basically like buying shares. I’ve been studying SPY, and, well, basically the same but with lessons on liquidity and the greeks - always successful. So. I expect at some point, the calls I buy will fail because an actual downturn starts and then I’ll stop. But…what to do then? How to add to the return in a down market? I mean, sideways, too in a sense, but the trend is up, hence index fund bogleheads. \n\nWould love advice?", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "I thought you much older! You write well and I appreciate your insights. I take all with the proverbial grain of salt, but your point certainly stands. I’m so happy for you that you’ve learned to trade and invest responsibility. The ‘loss porn’ breaks my heart at times. And, I thought the gambling joke just that, but it isn’t always, nor even usually. You came out of online education strongly - congrats on all of it. And tough as it was, I’m glad you took that loss, because you turned it around for your benefit. Are you homeschooling now? (Weird question, but you write like homeschooled people that I know.)", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Haha, you’re doing great. Fast typing on Reddit, I mean, I guess there are those police here. I’m more interested in the thoughts and r of others. Thanks, and hold your head high. \n\nI love that you guys walked away ok. And a buy and hold strategy, at your age? Pshwah, you’ll be a … whatever-naire!", "score": 1, "replies": []}]}]}, {"body": "Curious, what parameters do you follow, if you don’t mind sharing, to trade now? I’m always looking to learn.", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Just your margin of safety in trading vs investing?", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Fair enough. \n\nIt’s a red day during a raging bull. So, yay!!!!!", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "“Money cannot be made trading every day…it is a folly” Jesse Livermore", "score": 5, "replies": []}, {"body": "YouTube is your best friend. There are like a million different options strategies. Try them with a paper account. And use that to figure out what works for you.", "score": 3, "replies": []}, {"body": "You don't.", "score": 3, "replies": []}, {"body": "Nice I made about the same on the stock.", "score": 2, "replies": []}, {"body": "Read that one book, options for dummies. Learn about the Greeks. \nThen come on here, forget everything you learned and take advice for someone else.", "score": 2, "replies": []}, {"body": "Quit while you’re ahead. Go to the gym, read a book. Don’t forget taxes.", "score": 2, "replies": []}, {"body": "I copy what the whales are doing. Can find accounts on twitter that give these signals", "score": 1, "replies": []}, {"body": "Keep going. It’s a daily trend.", "score": 1, "replies": []}, {"body": "My favorite strategy is to buy calls just before a stock rises and buy puts just before a stock falls. If only I had a time machine I could apply this strategy more consistently.", "score": 1, "replies": []}, {"body": "It’s quite simple, become Barclays, and trade using other people’s millions. You’ll probably return half the market rate per year but you’ll take fat fees.", "score": 1, "replies": []}, {"body": "Yeah man. We ain’t stopping till we become the biggest stock in the world . And regards thought I was stupid for buying 1100 calls.", "score": 1, "replies": []}, {"body": "ez only buy 0DTE OTM options", "score": 1, "replies": []}]}
{"title": "ASTS YOLO", "selftext": "Holding 3.5k shares in Roth and a few other calls in another account. The position has grown beyond comfort given the nature of the play. So I will be selling off part of the position tomorrow - the contracts up over 20%. Plan to take park the gains, likely in more Nvidia. And perhaps load up again *when* the satellite launch is successful! ", "id": "1d2xgbd", "created_utc": 1716937687.0, "score": 48, "upvote_ratio": 0.91, "num_comments": 63, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 1651 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "The peasant got lucky once...but their revolution will be short-lived.", "score": 20, "replies": [{"body": "This aged well.", "score": 11, "replies": []}, {"body": "True! (Because I’ve sold older contracts and am selling a bunch of the newer ones tomorrow - too rich for my blood, or at least too foolish.)", "score": 5, "replies": []}, {"body": "Eh, live to fight another day. Viva la revolución!", "score": 2, "replies": []}]}, {"body": "Wow. This is the luckiest thing that has ever happened to me. If I didn’t need to think straight, I’d likely cry. Wow wow wow.", "score": 12, "replies": []}, {"body": "Positions:\n\nhttps://preview.redd.it/n3694ev5293d1.jpeg?width=1179&format=pjpg&auto=webp&s=f508ed414992c986567d97b699ad682c7d454f15", "score": 6, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I am long Rocketlab, too, but shares only. That one is tough because they are up and running. It basically taught me that space is still a black hole for money, largely. (Though that’s changing.) I like ASTS because it’s a solid business model, that will generate revenue if successful. It’s definitely risky, but the RR ratio was such that I was willing to make a smaller gamble on calls in January - after good news about a partnership hit, those were up 1-200%, which I couldn’t pass up. I feel risks are attenuated now, based on no further dilution this year, progress with regulatory bodies and proof of concept. So though it’s all-or-nothing (even the IP won’t remain if it’s a failure,) I went for it again this month. The launch has been postponed, but they’ve announced getting the satellites to the site this summer, to await window.", "score": 3, "replies": [{"body": "Speaking to your space is a black hole for money comment, I fear they are going to require more dillution before getting the required satellites up to start bringing in good revenue. I've been waiting to buy in until that happens, but that meant I missed out in the recent jump 🤷🏻‍♂️", "score": 3, "replies": [{"body": "Well, I was lucky in that I bought at $3, so the run up was a run up. Lots of people stuck with much higher cost basis. I know people don’t trust Abel (for good reason, in some senses.) *But*, I do think dilution is off the table for this year. That’s not saying much, granted, but with public acknowledgment of partnership and quasi-governmental funding on the table, it’s something. The hope being that successful launch leads to more investment and so on. All that said, I actually agree. Hence my decision to derisk. Taking a more reasonably sized long position, including LEAPS now. I got carried away with the excitement, but there are too many ‘ifs.’ It will be fun if they succeed and it’s a bumpy ride up from here, but I don’t need this much skin in the game. If/when they are profitable, or even steadily increasing negative earnings per share, I’ll retake the position. I’m not in it for the screenshots and buying in when at $10 per share and almost profitable, strikes me as wise. Buying in at a higher share price when profitable, will still be massively rewarding - an order of magnitude. So, a bit of fun, and now some sobriety. (I came into all of this as a value investor, who veered towards tech because growth is intrinsic to value, but still buy and hold through volatility, which requires what you mentioned!)", "score": 3, "replies": []}, {"body": "I just realized that I wish I saw more posts like this here - exciting at first, but then a self-protective response to the good fortune.", "score": 1, "replies": []}]}]}, {"body": "And thank you. Your comment helped me cement my thinking and resolve. My plan now is to sell half of these contracts tomorrow as well as some shares. I’m more comfortable with it in my Roth. (Will still add to Nvidia position with the gains, but also my boring ballast, which still leaves me a percentage of “can lose it all to options to play with.)\n\nI got *very* lucky here.", "score": 2, "replies": [{"body": "Excuse me, half of the position overall, leaving those that are down.", "score": 3, "replies": [{"body": "Get a job.", "score": 3, "replies": [{"body": "I’ve got a few gigs. They all inform one another and investing/trading. Thanks for the input! :)\n\nEdit a word", "score": 2, "replies": []}]}]}]}]}, {"body": "Way to go!", "score": 6, "replies": [{"body": "I’m no longer concerned about the taxes.", "score": 2, "replies": []}, {"body": "Thank you!", "score": 2, "replies": []}]}, {"body": "https://preview.redd.it/ko8w84n7293d1.jpeg?width=1179&format=pjpg&auto=webp&s=0d0250e89de0a7b4ec682f43efe33a7bcc059fdc", "score": 3, "replies": [{"body": "I missed a couple of screenshots, but am guessing this is sufficient. Apologies for double (I think.)", "score": 1, "replies": []}]}, {"body": "I am currently holding 5k shares and bought in at $4.50 average. Not sure what to think about it, has lots of potential but you are correct its a very risky play.\n\nIf the launch goes side ways will be bag holding for a looong time lol", "score": 3, "replies": [{"body": "Honestly, I think share price will get a boost in summer news. And I’m comfortable holding the same number of shares. I just took on a lot of risk. And that after selling off 100 calls! Very lucky, I was, probably my first and last freebie.", "score": 2, "replies": []}]}, {"body": "I bought poor mans calls just 3 with Jan expiry at $15 strike, when it was floating in the low ends im up 100% but kinda regret not buying more now lol", "score": 3, "replies": [{"body": "I’m so happy for you! That is GREAT. I mean, who’d have thought? Haha, congratulations. Also, my hands are actually shaking. I’ve learned important lessons: (i) no more options trading on Fidelity (ii) I have no idea what I’m doing. Well, that’s all, I suppose….", "score": 1, "replies": [{"body": "wait if you didn't expect this to happen, why did you do it in the first place? were you just diversifying?", "score": 3, "replies": [{"body": "I’m not sure I understand? I’ve followed ASTS for a few years. Thought it an amazing project (there are many like that though,) and Abel brilliant. I started buying shares last year and my very first calls were on ASTS then too. What I hoped would happen, but was never sure of, hasn’t yet. Though risks are falling away faster than I expected. Still don’t know if there will be further delays. And space is hard - no guarantees even now. I actually bought most of these contracts last week, after the previous run up. I’m certainly rooting for them. But, wasn’t diversifying. I was making a speculative gamble and felt I went too far. Then, as I was figuring out how to proceed, first adjusting risk and then taxes, had this run up. I’m incredibly happy, but was taken by surprise. I still think this is an all or nothing play, and was lucky as all get out to have a pretty big win on the shares and contracts. I still hold a bunch of both, but was super excited to take profits in my Roth especially. I hope this company truly succeeds and am comfortable with my level of risk now that I was able to take some of those gains. I’m not sure if I’ve understood you correctly? I wish I were prescient enough to call such things within days or a couple of weeks consistently. I’d be very wealthy were I able to do so. As it is, delighted to be along for the ride and hope this position brings us all lots more joy. This was a small but still a YOLO play for me originally and at current levels (about $55k still, all in.) Though I did diversify some into more Nvidia and ballast yesterday.", "score": 1, "replies": []}]}]}]}, {"body": "How much potential profit is that?", "score": 3, "replies": [{"body": "You can model it on options profit calculators free online with parameters you choose. What matters to me is my target percentage and my allocation, though.", "score": 3, "replies": [{"body": "RevolutionaryPhoto24 seems to know what they are doing.", "score": 5, "replies": [{"body": "‘Seems,’ being the operative word.", "score": 2, "replies": []}]}]}]}, {"body": "https://preview.redd.it/tx47tey8293d1.jpeg?width=1179&format=pjpg&auto=webp&s=b62f14df350c152e6c5f377f400bb8649276279f", "score": 2, "replies": []}, {"body": "I feel like doing the Stepford thing: “I’m a very lucky girl. I’m a very lucky girl. I’m a…”", "score": 2, "replies": [{"body": "Make sure to take some profits and enjoy yourself with it", "score": 2, "replies": [{"body": "Only the wolves prosper, not the sheep.", "score": 2, "replies": [{"body": "Disagree on that one, VMod. Upvote anyhow!", "score": 1, "replies": []}]}, {"body": "I took profit and…going to nap so I can think straight. I know I will remember this and it’s ridiculously happy! Thank you!", "score": 1, "replies": [{"body": "The poor always need a nap to think straight—because they’re usually too hungry to think at all.", "score": 2, "replies": [{"body": "Hm. I think *lots* -> I’m rich!", "score": 1, "replies": []}]}]}, {"body": "Kind of you. Looking back at posts referenced in another sub, just now (from *forever ago*,) and honestly, this is where I choose to put my “fun money.” (The markets, that is. I simply don’t need nor want to manage more shoes. And can also borrow them, you know?)", "score": 1, "replies": []}, {"body": "I did take some profits, though on a smaller account and my Roth. I did enjoy buying some favored companies in each!  (I have learned to take profit, overall, though. I am putting most of it into PG and BRKB.(", "score": 1, "replies": []}]}]}, {"body": "12k shares, in for the long haul. Please don't turn this into meme!", "score": 2, "replies": [{"body": "Eh, more the merrier, right? I do think it’s past meme though. As long as those satellites…", "score": 1, "replies": []}]}, {"body": "SSR couldn't lift it. Too much selling pressure. Should fade for days. Repeat offender. Big spikes but never fails to fall back into trend!\n\nhttps://preview.redd.it/k605ew5g9q3d1.png?width=1175&format=png&auto=webp&s=ad0e667535c9f3fba8a6b1d9e7b09d67c1ea17b6", "score": 2, "replies": [{"body": "Thanks, I appreciate this! :)", "score": 1, "replies": []}, {"body": "I wonder if the range will differ as I’d thought profit taking would settle by now. I did take some chips off the table myself, and I know there are many others who waited a long time. I’m unclear whether the shorts have capitulated some, but then, I didn’t realize the restriction was triggered. Looking at it closely right now.", "score": 1, "replies": []}, {"body": "Watching large sell orders come in just now…wonder if the range will hold.", "score": 1, "replies": []}]}, {"body": "Holy cow. Woke with a start. This is not a great strategy for taxes!!!! Will hold the shares here and sell in Roth. Exercise some contracts? I am delighted I must pay taxes. But I’ve made quite a mess this year…oh, dear.", "score": 1, "replies": [{"body": "Sounds like RevolutionaryPhoto24 is in for a rude awakening.", "score": 5, "replies": [{"body": "I literally *just* had one. \n\nBut, yeah.", "score": 1, "replies": [{"body": "Ohmygosh I hate me right now.", "score": 1, "replies": []}]}, {"body": "And now I’m laughing. Thanks!", "score": 1, "replies": []}]}]}, {"body": "Um.", "score": 1, "replies": [{"body": "checking on you now 15 mins later because...... !!!!!!!", "score": 2, "replies": [{"body": "Any thoughts Mister42 (love that handle)? I’ve sold off shares and contracts in baby account and Roth, but am quite nervous here. My best friend says to hold for up to the 3 days rule, but then had a patient. (Psychiatrist of all MD’s, even.)", "score": 1, "replies": [{"body": "it would be irresponsible of me to give any kind of recommendation as a total amateur myself but i have seen the long case for this stock and it's extremely appealing; i am invested to the tune of 733 shares at an avg cost basis of 4.83 (wish i had more, and will probably buy in again at some points) and am not interested in selling for the foreseeable future. i can't speak to short term moves but i feel like this has growth written all over it in the next 6 months and in the next 5 years.", "score": 2, "replies": [{"body": "Understood. And thanks, honestly, just chatting is helpful. I’m usually the girl people want in crisis. Truly. But this good thing is totally overwhelming.", "score": 1, "replies": []}]}]}]}]}, {"body": "Here’s an early update. I hold the remaining shares in my Roth and the original calls from last year in another account (3.5 & 12.5 2026 LEAPS.):\n\nhttps://preview.redd.it/1p1cmxksjy4d1.jpeg?width=1179&format=pjpg&auto=webp&s=d1a241bb63f299afc9518d26c2571861c4631523", "score": 1, "replies": []}, {"body": "Update:\n\nhttps://preview.redd.it/ilzru07y186d1.jpeg?width=1179&format=pjpg&auto=webp&s=aa2178890aa7d6e8ac0f24385408d879144041f7", "score": 1, "replies": [{"body": "Aged like fine wine. This may actually make you a millionaire", "score": 2, "replies": [{"body": "I didn’t have much of a plan going in, beyond holding most for a long while. Recently, I looked at an online calculator to see what is possible and…my hands were shaking. It may well be a winning lotto ticket if they succeed. (I now set the sell target when I open a trade for shorter term options, and most LEAPS.) My gosh, I hope so, but for now, I just don’t look :)", "score": 1, "replies": []}]}]}]}
