{"title": "Microsoft Pushes AI-Powered Tools for Telecoms. It’s Targeting Amazon.", "selftext": "https://www.barrons.com/articles/microsoft-amazon-ai-telecoms-stock-c07bdbdb\n\nMicrosoft latest drive in artificial intelligence is providing AI-powered services to help telecommunications companies manage their networks. It’s a move that takes aim at Amazon, as both technology companies look to gain from the telecom industry’s move toward cloud-computing platforms. \n\nMicrosoft is launching a new AI-enabled cloud platform for telecom companies, named Azure Operator Nexus. It has already been provided to AT&T, the company said late Sunday, just before the industry’s flagship show, the Mobile World Congress, began on Monday.\n\nMicrosoft acquired AT&T ’s cloud-platform technology in 2021, in the process landing one of the biggest clients in the sector.\n\n“Azure Operator Nexus has already been released to our flagship customer, AT&T, and the results have been incredibly positive. Now, we’re selectively working with operators for potential deployments around the world,” Yousef Khalidi, a corporate vice president at Microsoft, said in a blog post. \n\nThe launch comes as carriers such as AT&T and Verizon face pressure to show better returns on investments in 5G networks. Microsoft said that Nexus will make carriers’ networks more efficient through the use of AI and automation. \n\nMicrosoft is taking on Amazon Web Services as it looks to expand its market share in cloud-computing services for telecoms. Amazon last week announced the launch of its AWS Telco Network Builder, which it said would make it easier for telecom companies to build their operations in the cloud.\n\nGoogle’s parent, Alphabet is also seeking to attract telecoms companies, as it looks to catch up with Amazon and Microsoft in cloud revenue. On Monday, Google Cloud said it was launching three new products for telecom companies, including an AI-powered tool for analyzing subscriber behavior.", "id": "11dha3y", "created_utc": 1677518528.0, "score": 316, "upvote_ratio": 0.92, "num_comments": 17, "comments": [{"body": "This feels like a non-story. I think anything \"Microsoft and AI\" is a real click-driver right now, since the chatbots are so popular. AWS already has huge amounts of AI managing all network-related things. You'd kind of have to be an idiot to try and manage data flows at this scale without using AI, I guarantee even the oldschool telecoms are using AI to some degree. AI here definitely means some sort of basic forecasting model, it's not like ChatGPT is in the cloud dictating how the networks should perform.", "score": 99, "replies": [{"body": "Especially since none of these things are actually \"AI\". AI isn't a thing, there is no known artificial intelligence. AI is a marketing term used to repackage machine learning, which itself is a marketing term used to repackage the analysis of large data sets.", "score": 15, "replies": [{"body": "I'm also very bearish on the \"AI revolution,\" but I'm a Data Scientist who often does machine learning, and I don't completely agree.\n\nAI might not be a well-defined term, but I think it's generally understood as \"using machines to perform tasks that require intelligence.\" ML is a subset of AI, and ML goes farther than just doing analysis. Obviously an ML model doesn't \"think\" like we humans do, but the term learning is quite accurate. A lot of systems don't just memorize analysis, they show a remarkable propensity for absorbing information from data and using this information for other, new tasks.\n\nAI, as I've defined it, surely does exist. Most companies are exaggerating when they talk about their AI capabilities, but I've been working in the ML space for a while, and there are plenty of companies actually building real products and doing business by leveraging Machine Learning and AI.", "score": 4, "replies": [{"body": "Fair enough, but I don't think the term AI should be used at all as it is in this context. There needs to be better terminology for  the tools being developed that doesn't immediately insinuate artificial intelligence.\n\nEven if it is widely understood that this isn't real AI it still automatically inserts bias into any conversation.", "score": 4, "replies": []}]}, {"body": "Which, in itself, is a marketing of \"programs\" which is a packaging of algorithms.\n\nInterestingly, you can say this today and not get strung up.  Six months ago when I said AI is hype, my inbox was flooded with abuse including those \"someone is concerned about you\" harassment messages.\n\nChatGPT is an extension of google's search word pre-fill.  And the way it works is just going to amplify popular narratives with no ability to differentiate for accuracy.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "*Neither* can be trusted.  \n\nGoogle just returns the most popular linked link, which is often wrong.\n\nWorse, one bad source gets referenced somewhere, then other things reference that second bad source, and then 200 sites reference those first two, even though they're not actually two sources, they're twins of the first one, which was wrong.\n\nNext thing you know some wiener is telling me that they found hundreds of Google results of something I happen to know is wrong.  Wikipedia uses the same populism fallacy.  \n\nHundreds of \"news\" sites covered a pig that saved a drowning goat.  Then they covered a novel workout method that simulate lifting heavy moving boxes.  And so on.", "score": 1, "replies": []}]}]}]}, {"body": "especially since just 2 weeks ago Amazon partnered with an AI firm to do precisely this—offer AI services through AWS to cloud clients", "score": 6, "replies": []}, {"body": "Use the word AI a few more times and you’ll get bombarded with investment funding in your DM.", "score": 2, "replies": []}, {"body": "Yeah, it's called [Amazon Connect](https://aws.amazon.com/connect/)", "score": 2, "replies": []}, {"body": "Yes. AI has been a major buzz word in MarTech for the last 5 years.\n\nIf it make stock go up, it good.", "score": 1, "replies": []}, {"body": "Straight up AI mania rn", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 53, "replies": [{"body": "Exactly.  The concentration of power and control over global networks is not a good thing.", "score": 18, "replies": []}, {"body": "It wasn’t really a vulnerability, it was a straight up supply chain attack", "score": 2, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "[Has little to do with a supply chain in a materials sense.](https://en.wikipedia.org/wiki/Supply_chain_attack)", "score": 5, "replies": []}]}]}]}, {"body": "/r/nok", "score": 3, "replies": []}, {"body": "The AI chat is on fire!  Long MSFT.  Now SnapChat is getting in on the game!", "score": 2, "replies": []}, {"body": "Its like the .com but instead of com its AI. Stock AI to anything, and its all glory.\nI love how everyone is acting as if AI and machine learning haven’t been parts of our daily lives for the past decade or two. Nothing new", "score": 1, "replies": []}]}
{"title": "Tesla's German plant hits 4,000 cars a week ahead of schedule", "selftext": "", "id": "11d9l1i", "created_utc": 1677497180.0, "score": 146, "upvote_ratio": 0.98, "num_comments": 24, "comments": [{"body": "TL;DR Tesla's plant in Brandenburg near Berlin is now producing 4,000 cars per week, the company said on Monday, **three weeks ahead of schedule** according to a recent production plan reviewed by Reuters.\n\nTesla was planning to ramp up output from Brandenburg to 4,000 in the week of March 13 and to more than 5,000 by the end of June. It hit production of 2,000 units per week in October last year and 3,000 per week in December.", "score": 27, "replies": [{"body": "Four months to grow 25%? Seems very doable.", "score": 2, "replies": []}]}, {"body": "But I heard they could not find anybody to work there!  ^(/s)", "score": 17, "replies": []}, {"body": "every additional car that tesla can build in Germany is huge for tesla. That's one less car that needs to be put on a ship and cross the world from china. big transport savings and carbon reduction.", "score": 15, "replies": [{"body": "Also deleverages all of our exposure to China, which is a major issue with all of the geopolitics going on these days.\n\nDon't get me wrong, China exposure is still massive due to the whole rest of the supply chain, but chipping away at it is a positive imo.", "score": 1, "replies": []}]}, {"body": "Elon said on Twitter recently that Fremont will do 600k+ this year. \n\nIf we assume that Berlin and Texas each do 200k, which might be conservative given a 4k run rate for Berlin this early in the year, then that's 1m from Europe and the US.\n\nWe know that Shanghai can do 1.2m and is basically at capacity. So that's 2.2m.\n\nThe question is, was Elon sandbagging when he gave 1.8m guidance, with 2m as a best case? Seems to me 2.1m is plausible for production, unsure about deliveries given how the unwinding of the wave is playing out.", "score": 8, "replies": [{"body": "He was probably sandbagging, but there's also a risk that the Cybertruck ramp could impact the Model Y ramp at Austin somewhat. It's good to sandbag.", "score": 4, "replies": []}, {"body": "Capacity on Q4 earnings slides is >750k for Giga Shanghai. What sources are reporting 1.2m?", "score": 2, "replies": [{"body": "I found this that says 1m\n\nhttps://electrek.co/2023/02/01/tesla-plans-ramp-up-giga-shanghai-production-after-surge-orders-report/\n\nI'm not sure if we can expect further upgrades throughout the year. Maybe? I really don't know. But 1m for sure", "score": 3, "replies": []}]}, {"body": "Yeah he probably was. They've learned it way better to under promise and over deliver. Plus how many force majeure events have they had lately? Chip shortage, Covid shutdown in California and the Covid zero in Shanghai. Tesla has probably learned to expect the unexpected. Better to say 1.8, expect 2m and hope for 2.2 if the stars align", "score": 2, "replies": []}, {"body": "> We know that Shanghai can do 1.2m and is basically at capacity. So that's 2.2m.\n\nOnly problem is that Shanghai is shutting down regularly for \"upgrades\" or \"demand problems\" (depending on who you believe, probably a mix of both).\n\nChina has already scheduled/taken ~3 weeks of downtime in Q1 alone this year, so they are not going to hit 1.2 M, and the EOY number could be a lot less if they keep taking downtime in Q2-Q4 (my belief is that they won't because upgrades will allow them to lower costs, ASPs, and thus run at capacity, but we do have to acknowledge that the rate **today** isn't at 1.2 M pa.)", "score": 1, "replies": []}]}, {"body": "200,000+ annualized run-rate. They doubled weekly production from the autumn. Nice to see this steadily ramp.", "score": 13, "replies": []}, {"body": "It almost seems like a competition between Shanghai, Berlin and Austin. It will be interesting to see a few years from now.", "score": 4, "replies": [{"body": "No competition, quite frankly. Shanghai blows Berlin/Austin out of the water.", "score": 7, "replies": [{"body": "Of course it is no comparison as Austin and Berlin ramp up, but I was more thinking when they all reach their peak.", "score": 1, "replies": []}]}]}, {"body": "How’s the door gaps?", "score": 0, "replies": []}, {"body": "Tesla is a monster. Scary how good they get at pushing vehicles out the door. Quality management wise however... Not sure when that will catch up 🤣", "score": -6, "replies": [{"body": "You are repeating internet chatter without any personal experience. Quality may have been a problem in 2018-2019 when Model 3 was ramping. It is not an issue any more.", "score": 5, "replies": [{"body": "Really? Maybe you're the one repeating internet chatter?\n\nSo my 4 trips to the service center for myiple leak sources in the trunk is not real? The rattling in the front dash isn't real? The popping floor in the center row isn't real?\n\nAlmost everyone I know with a Tesla has build quality issues. And most of those vehicles are 2021 or newer. Mine is just half a year old.\n\n\"Not an issue anymore\" as of yesterday? Or the day before?\n\nTeslas are American vehicles. American vehicles have shitty quality control. It's just a fact. If you've ever driving a BM or Benz or even a Volvo as a matter of fact you'll know there is a huge build quality difference still", "score": 3, "replies": [{"body": "Your experience is unusual. My 2019 model 3 has been flawless, on par or better than every other car I have owned, including European brands. I know of 5 friends and work colleagues with model 3 and model Y, and no issues. \n\nMine was US built (2919), my friends are MIC. We are in Australia.", "score": 1, "replies": [{"body": "My experience is NOT unique, there are at least 6-7 Ys (all Fremont too) I know of that have some rattling or squeaking issues in the cabin. Hell I know one of the Tesla managers locally and he can confirm what I'm saying.\n\nI have to say though the loaner 3s I've driven have felt really solid, but a couple I drove were brand new or nearly brand new at the time, and the Ys that have had issues didn't have issues from the get go.\n\nIt is something during their manufacturering or assembly process, but for a 80k vehicle they should really not exist (even the Caddys or Lincolns are out together slightly better, and those are American vehicles)\n\nTeslas simply just need to step up their QC plain and simple. But at least I don't have a waterfall in my cabin 🤷🏻‍♂️", "score": 3, "replies": [{"body": "I’m not saying it’s unique, but it is unusual. US made cars may well be different quality to Berlin and Shanghai. \n\nAll I can comment on is that my experience is almost entirely positive, as is those of the 5 others i know of in Australia. They are selling like hotcakes here, with a very high satisfaction rates.", "score": 1, "replies": [{"body": "They're also selling like hot cakes here. Look, I'm not saying I hate my car, but Tesla CAN use better QC for sure. What I tell people when they ask what my thought is on them, I tell them when they buy a Tesla, there buying a computer on wheels. And from a vehicle perspective, your buying an American vehicle, so don't expect German finish quality if they've been driving BM or Benz only, but if they end up with a flawless one, then good for them", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Even as a Reddit WSB Ape, I’m Always optimistic about Tesla, I’m HODL’n my shares of Tesla for my Cybertruck preorder !", "score": 1, "replies": []}]}
{"title": "About this week's US stock market trend", "selftext": "[removed]", "id": "11da0pq", "created_utc": 1677498715.0, "score": 1, "upvote_ratio": 0.52, "num_comments": 32, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|2 weeks ago\n**Total Comments**|14|**Previous Best DD**|\n**Account Age**|3 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Read what you just posted. You wrote a lot of words without actually saying anything.", "score": 16, "replies": [{"body": "That's typical of posts written with ChatGPT", "score": 11, "replies": []}]}, {"body": "Take your profits and cut your losses… you’re saying get out of the market?", "score": 7, "replies": []}, {"body": "No", "score": 3, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "I like to lose money and sell low and buy high.. we just have different perspectives.. but your plan is probably good if you like to make money", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I am weird.. thats what all the girls say anyways when i show them my stock account on my iphone.. some people just dont appreciate losers.. i strive to change this In humanity.. i want everyone to be equal", "score": 3, "replies": []}]}]}]}]}, {"body": "Short term as in 0dte?", "score": 3, "replies": []}, {"body": "Zero days until expiration financial derivatives only", "score": 3, "replies": []}, {"body": "This post sounds like someone just threw a bunch of words into a hat and put on a blind fold and typed into reddit. What is the point of this?", "score": 3, "replies": [{"body": "generating more data via your responses", "score": 1, "replies": []}]}, {"body": "I made a short-term investment in 2021, and I am very fortunate that I changed my investment strategy. Otherwise I would have lost over 500K as far as TSLA is concerned", "score": 1, "replies": []}, {"body": "Shitpost.", "score": 1, "replies": [{"body": "no value", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "11df764", "created_utc": 1677513375.0, "score": 31, "upvote_ratio": 0.83, "num_comments": 27, "comments": [{"body": "I am with you, but the market is highly regarded.", "score": 11, "replies": []}, {"body": "These will PRINT, good luck bruv![img](emote|t5_2th52|18632)", "score": 9, "replies": [{"body": "Thanks mate", "score": 2, "replies": [{"body": "Gonna need an update post after today, should be a blood bath![img](emote|t5_2th52|4271)", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yup, just a waiting game at this point", "score": 2, "replies": []}]}]}]}]}, {"body": "This has been the same story for the past 6 months, and yet check the chart", "score": 4, "replies": [{"body": "That AI narrative pump last earnings was the telltale sign that the 6-month uptrend may be exhausted", "score": 10, "replies": [{"body": "Eh....  who even knows.  I've been baffled as to why it continues to surge.  I expected it had more to fall when it hit 110, so totally missed out on re-entering my sold position", "score": 4, "replies": []}]}]}, {"body": "Cramer has said pos things bout em . They toast.\n\nBe a man.", "score": 5, "replies": []}, {"body": "Rising wedge + spinning top + MACD, RSI, OBV, MOM and MFI bearish divergence = print\n\nhttps://preview.redd.it/y06h8d5piuka1.png?width=2880&format=png&auto=webp&s=e2e83780628e421bc3941d41a71ee2752c690674", "score": 2, "replies": []}, {"body": "Your risk is with every man and his dog announcing they are offering AI in their shitty products, which immediately translates to 'nvda profits' in all the brains of idiots because, of course, it means they will be spending yuuuuge money on nvda cards..\n\nThat's, unfortunately, how people think, and every time some Tom dick and Harry mentions AI nvda can run up.\n\nI do agree with you, just stating what can trip up the thesis.", "score": 2, "replies": [{"body": "Thanks man, the risk of this is actually embedded in my thesis. Every rips the AI news might cause must dump quickly or else market is really regardedly bullish and im wrong", "score": 1, "replies": []}]}, {"body": "Broke the downtrend on the yearly, it may come down a few points, but it's putting in a new baseline.", "score": -1, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "$11.5K worth of NVDA short (these are CFDs coz I'm from Asia). Dogshit earnings with catshit outlook won't thrive while the FED is tightening.", "score": 2, "replies": [{"body": "Ur gonna get wrecked by a soft landing", "score": 4, "replies": [{"body": "I'll take the risk", "score": 6, "replies": []}, {"body": "Fairytales are just stories, they can’t hurt us in real life.", "score": 1, "replies": []}]}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|126|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "What options did you buy tho?", "score": 1, "replies": []}, {"body": "I've never seen an actual \"short\" position posted here that's not puts (pretty sure that's what this is?). What platform are you using?", "score": 1, "replies": [{"body": "Yeah these are not options. They are actually CFDs, which tracks the price of underlying asset (NVDA).", "score": 1, "replies": []}, {"body": "shoulda bought some calls against it friday and covered some puts today early....pain could be up this week, however looking for a big move down subsequent. \n\n&#x200B;\n\nhttps://preview.redd.it/hnkttda8nxka1.png?width=750&format=png&auto=webp&s=34dd6f1566de5e70f2ebfaddf76cb2ea21c21181", "score": 1, "replies": []}]}, {"body": "Green goblins gaggle geese goggle grease", "score": 1, "replies": []}, {"body": "what is that stock? does your broker not give you strikes??", "score": 1, "replies": []}, {"body": "Why Nvidia and not Nasdaq 100? I.e. what's your specific thesis on NVDA doing worse than index?", "score": 1, "replies": []}, {"body": "with btc all but dead, and gamers now accustomed to \\*not\\* upgrading because it's too difficult, on top of being too expensive....welp....nvda gonna be hit hard for a few quarters.", "score": 1, "replies": []}]}
