{"title": "TakeTwo stock analysis and valuation - How Zynga distorts the financials", "selftext": "This post is a summary of my analysis of Take-Two (Ticker symbol: $TTWO). I hope you enjoy reading it and feel free to add your take and agree/disagree with what's mentioned below.\n\n&#x200B;\n\nThe article is divided into the following sections:\n\n* Introduction & Fundamental analysis of the business.\n* Historical financial performance\n* The Zynga acquisition\n* The balance sheet\n* Assumptions & valuation\n* Valuation based on assumptions different than mine\n\n&#x200B;\n\n**Introduction & Fundamental analysis of the business**\n\nTake-Two is a video game company that grows primarily through acquisitions. It owns well-positioned, well-known IPs, such as Grand Theft Auto, Red Dead Redemption, NBA 2K, Civilization, Mafia, Max Payne, and many more.\n\nIn 2022, the company acquired Zynga, a company that owned a significant number of top mobile games, which fits well into Take-Two's portfolio.\n\nObviously, one of the big risks that come with every gaming company is, what if the next sequel of a popular game disappoints? What if the next Civilization isn't a big hit, what if the next Grand Theft Auto fails to meet the expectations of the gamers? Although Take-Two isn't immune to this risk, owning a large number of popular games allows them to diversify this risk to a large extent. If we take a look at Activision for example, a giant in the industry, the conclusion would be different as 3 of the franchises (Call of Duty, World of Warcraft, and Candy Crush) bring roughly 3/4 of the total revenue. \n\n&#x200B;\n\n**Historical financial performance**\n\nBefore we move into the financials, it is important to note that the fiscal year of Take-two ends on March 31st. Hence, the fiscal year 2022 starts on April 1st, 2021, and ends on March 31st, 2022.\n\nAt the moment of this writing, the last publicly available report is as of December 31st, 2022, so LTM (last twelve months) is referring to the calendar year 2022.\n\nThe company's revenue grew 16% CAGR over the last 5 years, and a significant portion of this is coming from acquisitions. As Zynga was acquired in 2022, the full effect of its revenue isn't reflected in the financials yet. Its revenues for the LTM were $4,8 billion.\n\nThe gross margin has improved over the last 5 years from 43% to slightly over 50%. However, if we take all the operating expenses into account (Sales & Marketing, General & Administrative, Research & Development as well as Depreciation and amortization), it seems as if something is going wrong.\n\nThe operating margin was fluctuating between 8 and 19%, until the Zynga acquisition. Suddenly, the profitability is down to roughly 0%. To better understand this, we need to look into the Zynga acquisition.\n\n&#x200B;\n\n**The Zynga acquisition**\n\nThe consideration for this acquisition was $9,5 billion:\n\n\\- 46.3m shares of Take-Two ($5,4 billion)\n\n\\- Cash ($4 billion)\n\n\\- Equity awards ($0,1 billion)\n\n&#x200B;\n\nThe expected outcome of this acquisition by the management is as follows:\n\n1. Revenue synergies of over $500m\n\n2. Cost synergies of over $100m in the first 2 years\n\n3. 14% revenue growth in the next 3 years\n\n&#x200B;\n\nWhen there's an acquisition, the acquiring company doesn't just take over what's on the balance sheet of the acquiree. Instead, there's an entire valuation and purchase price allocation process that takes place.\n\nLet me elaborate: The accounting standards have very strict rules for recognizing (capitalizing) internally generated intangible assets (such as brands, trade names, etc.). The main reason is, if this is allowed, most companies would do that, which means instead of recognizing an expense, the capital used would be on the balance sheet (amortized over time), and the profitability of the business would be overstated, and would not reflect the actual performance.\n\nHowever, when an acquisition happens, that's when the intangible assets that have been generated in the past are valued and recognized.\n\nBecause of this acquisition, Take-Two recognized intangible assets of $5,5 billion, in addition to the goodwill of $6.2 billion.\n\nWhat this means is, all of these intangible assets (excl. the goodwill) will now be amortized and part of Take-Two's income statement, decreasing its operating profit by $700m per year and is the explanation for the significant decrease in the operating margin. However, this is a non-cash expense. Take-two has already paid for this in the past, so from a cash point of view, it doesn't exist. \n\n Let's take a look at how Take-Two (with and without Zynga) compares to the key competitors: \n\n&#x200B;\n\n|Company|Gross margin|S&M expenses|G&A expenses|R&D expenses|Total operating expenses|Operating margin|\n|:-|:-|:-|:-|:-|:-|:-|\n|Take-Two|55%|15%|15%|10%|40%|15%|\n|Zynga|64%|34%|7%|20%|61%|3%|\n|Take-Two (/w Zynga)|56%|23%|18%|15%|56%|0%|\n|Activision|71%|14%|10%|15%|39%|32%|\n|Nintendo|55%|7%|7%|6%|20%|35%|\n|EA Sports|74%|13%|11%|30%|54%|20%|\n\nThe explanation above also helps understand why Take-Two with Zynga has significantly worse margins than the two companies separately. \n\n \n\n**The balance sheet**\n\nLooking at the financial position, Take-Two has a fairly stable cash position of over $800m, but it rarely holds a significant amount of excess cash. After the acquisition of Zynga, the intangible assets make up roughly 3/4 of the entire balance sheet.\n\nOn the other side of the balance sheet, the company has a low level of debt ($1,7 billion, including leases) and it doesn't seem to be interested in increasing its financial leverage significantly.\n\n&#x200B;\n\n**Assumptions & Valuation**\n\n&#x200B;\n\nTo value Take-two, there are two main inputs required: Revenue growth over time & Operating margin. Here are my assumptions:\n\n**Revenue growth:** 25% in year 1 (mainly driven by the Zynga acquisition), followed by 8% until year 5 and a decrease to 3.5% by year 10, this represents revenue growth of 114% in the next decade.\n\n**Operating margin:** 16% for the next year, improving to 18% over time as synergies kick in.\n\n**Discount rate (WACC-based)**: 7.78% increasing to 8.02% by year 10 (approaching a beta of 1, vs. the beta of 0.9 today)\n\nHere's the outcome: The company's value is **$14.5b ($86/share).**\n\n \n\n**Valuation based on assumptions different than mine**\n\nIf you have different assumptions regarding the revenue 10 years from now, as well as the operating margin, I hope the table below helps in valuing Take-two as a whole.\n\n \n\n|Revenue / Op. margin|14%|18%|22%|26%|\n|:-|:-|:-|:-|:-|\n|100% ($9,7b)|$52.0|$79.6|$105.8|$128.0|\n|114% ($10,3b)|$56.6|$86.2|$114.2|$137.9|\n|150% ($12,1b)|$64.9|$98.9|$131.2|$159.0|\n|200% ($14,5b)|$76.2|$116.1|$154.4|$187.6|\n\nAs with any other company, there is a wide range of outcomes. Personally, I think the company is doing well and I'd love to own shares sometime in the future, but not at today's price.\n\nIf Take-two increases its margins significantly and moves closer to Activision/Nintendo, the company could be undervalued at today's price.\n\nOne important topic to mention is GTA6 as it is a game anticipated for quite a long period of time. Although its (lack of) success will have an impact on Take-two as a company, it is important to acknowledge that it is not the only game that's a cash cow, but it does represent a risk/opportunity in the short and medium-term.", "id": "117ibgr", "created_utc": 1676921918.0, "score": 77, "upvote_ratio": 0.89, "num_comments": 22, "comments": [{"body": "Good old Zynga. Best known for stealing ideas, barely tweaking it, and creating it under their brand (Mafia Wars). And then they somehow goof their games despite having a solid user base (Mafia Wars). I'm definitely not bitter about how Zynga runs their games. Especially Mafia Wars.\n\nGood write up by the way", "score": 26, "replies": [{"body": "has Zynga been profitable lately? I was quite shocked to see Take2 buying them a while back. I don't get why they bought the company at all considering none of their games seem to have taken off like other mobile games like Candy Crush, Pubg Mobile etc. \n\nI've heard about them when Facebook just took off globally with web browser games. From what I know they were known for Farm Ville and some Poker game at a time when free-to-play games were just starting to become the norm.\n\nZynga's major success imo was largely thanks to Facebook and now pretty much everything they make feels like a bootleg version of someone else's idea which isn't good for long term sustainability. Very often these companies also fail to scale very well. Other examples include Rovio, Gameloft, Zeptolabs. Any thoughts on this?", "score": 5, "replies": [{"body": "Zynga was basically breaking even at the time when Take-Two acquired it and had $2.8b in revenue.", "score": 3, "replies": [{"body": "Thanks for the update! I'm actually impressed, I expected them to be bleeding with losses. It would be interesting to see what Take2 manages to do with mobile. They have a couple of licensed, free-to-play sports titles under 2K NBA and WWE. \n\nIt's getting increasingly harder for game companies to make a successful mobile games now. Electronic Arts recently decided to shut down Apex Legends Mobile and unreleased Battlefield Mobile.", "score": 3, "replies": []}]}]}, {"body": "Thank you, I am glad you enjoyed the post.", "score": 1, "replies": []}]}, {"body": "Great write up - Thanks for sharing. \n\nDo you think video game operating margins will increase as they eliminate the supply chain component of shipping physical discs and the COGS associated with manufacturing the discs?\n\nI have no idea about game companies scaling, so I'm not sure what those discs + DVD container costs. Maybe a buck or two? Once again, awesome write up. Thank you", "score": 11, "replies": [{"body": "Those costs have evaporated a long time ago.", "score": 4, "replies": []}, {"body": "I am glad you liked the post. The question regarding the gross profit is definitely a fair one. I do expect a slight improvement in GP, but nothing too significant. I think the big winners in the gaming industry will be the ones that can sell more volume and not the ones that focus on cutting costs significantly.", "score": 3, "replies": []}, {"body": "Disks are only really a thing when they sell through retail, and in that case the share taken by the retailer is much more than the production cost of the disk. \n\nZynga does mobile games. They have never had disks. They pay a 30% fee to the platform (this is similar for most digital distribution platforms), but their main cost point is user acquisition. It can cost over $10 per install for some genres with heavy competition. That works for them because the average player in their games spends more than that in their lifetime. In very competitive genres, the UA cost will be close to the average player's lifetime value (LTV), with a very small profit margin. Anything that affects UA cost will affect these companies disproportionately. Apple cracking down on tracking / personalized ads was a large blow to the mobile games industry. Court cases and / or EU antitrust initiatives that might force Apple to allow alternative stores / payment methods might be a huge upwind.", "score": 3, "replies": []}]}, {"body": "Projecting a constant growth rate is not a good way to value TTWO because it is a hit driven business. Go look at the historical revenue charts surrounding the release of GTA5 and RDR3. There are large discontinuities in the first 2 quarters after each major release and a jump up in the base of recurring Rev + profits after each of these hit games came out. Acquiring Zynga will mute this effect somewhat, but it would not be surprising for annual revenue to double in the year GTA6 releases and the recurring revenue stream should be elevated if it is successful.", "score": 9, "replies": [{"body": "Although I am forecasting growth that declines over time, I am also including capex to achieve that growth. I do agree with you that it is a hit-driven business, but looking back in time, the revenue has grown every year since 2015 at a rate of around 20%. The analysts' expectations are that this growth continues for at least until 2025, which makes my assumptions fairly conservative.", "score": 1, "replies": []}]}, {"body": "Their most recent annual report mentions that \" We cannot publish our titles without the approval of hardware licensors that are also our competitors.\" Plus they rely on open-source software, they are extremely dependent on the success of GTA  \"Grand Theft Auto products contributed 30.9% of our net revenue for the fiscal year ended March 31, 2022,\" and it also says that \"Sales to our five largest customers during the fiscal year ended March 31,2022 accounted for 79.0% of our net revenue, with Sony and Microsoft each accounting for more than 10.0%.\" Speaking of gaming stocks the Saudi Wealth fund is continuing to increase its stakes in Take Two and in Nintendo.", "score": 4, "replies": [{"body": "Thank you for the addition, much appreciated!", "score": 2, "replies": [{"body": "You are very welcome", "score": 3, "replies": []}]}]}, {"body": "Nah, worst acquisition in the history in videogaming and if you’ve known the history, you know there were many, many, bad acquisitions over the years. I have my own theory for why they did it and it has nothing to do with synergies and cost savings.", "score": 4, "replies": [{"body": "What's the theory?", "score": 3, "replies": []}]}, {"body": "Nice analyses.  Just wondering about GP vs numbers of users", "score": 1, "replies": [{"body": "That's definitely a great question. Honestly, I try to focus a bit less on # of users as that puts all users in one bucket, which is a bit unfair as the value they bring depends on the game.", "score": 1, "replies": [{"body": "User number and retention are key to growth and why I like  Activision.   I am a believer in eyeballs win.", "score": 2, "replies": []}]}]}, {"body": "Check Ĥ ko j", "score": 1, "replies": []}]}
{"title": "Selling MSFT puts", "selftext": "such easy $ \n\nperfect mix of low volatility , good premium", "id": "11704uo", "created_utc": 1676876145.0, "score": 26, "upvote_ratio": 0.79, "num_comments": 28, "comments": [{"body": "I love this post, pats self on back…gets crushed.", "score": 71, "replies": [{"body": "Reminds me of Jerry from rick and morty", "score": 10, "replies": []}]}, {"body": "There is no such thing as low volatility and good premium.", "score": 23, "replies": [{"body": "Sure there is. Any time implied volatility is higher than realized volatility, that is a good time to collect premium. Even when IV is relatively low, you can make money consistently by doing this.\n\nHigh IV environments can be some of the worst times to sell options, actually. RV during these times tends to spike unpredictably above IV which makes positions difficult to handle and losses far more likely. RV during times of low volatility, on the other hand, tends to stay below IV much more consistently, which is ideal for premium collectors.\n\nIV being high or low is not that great an indicator on its own of whether you should be selling options or not. Just because it's high, it doesn't mean the option is more expensive than it should be. Just because it's low, it doesn't mean the option is as cheap as it should be.", "score": 0, "replies": [{"body": ">IV during times of low volatility, on the other hand, tends to stay below RV much more consistently  \n  \nI think you mean above", "score": 1, "replies": [{"body": "No, IV is still going to be above RV during times of low volatility. The market is still going to pay a premium during those times, which is something we can capitalize on.\n\n[This post](https://www.reddit.com/r/options/comments/qcxsmb/ultimate_guide_to_selling_options_profitably_part/) might help you out.", "score": 1, "replies": [{"body": "I'm well aware, I trade volatility regularly.  \n  \nRe-read your own comment, second paragraph - you said IV tends to stay BELOW RV. I was simply correcting you.", "score": 1, "replies": [{"body": "Oh yeah lol thanks", "score": 1, "replies": []}]}, {"body": "IV can be below RV. Options can be underpriced.", "score": 1, "replies": []}]}]}]}, {"body": "It can happen if implied volatility is high but actual movement is minimal, but that will quickly correct itself, so it won't hold for too long.", "score": 1, "replies": []}]}, {"body": "This was 220 a short time ago, it has a long ways to fall if the market turns. I like msft buts expensive for a mega", "score": 15, "replies": []}, {"body": "Someone exercised my 255 cc mid last week which expired on Friday. Turned around and sold CSP 252 and it's almost ITM. Not great premiums but will see how this week plays out", "score": 6, "replies": [{"body": "My 260cc also.", "score": 2, "replies": []}]}, {"body": "I’ve probably sold over 100 MSFT puts over the years and I was only assigned once. Got called out of the shares 2 weeks later. As long as you’re not greedy, it’s a pretty safe options play.", "score": 5, "replies": [{"body": "Do you roll to avoid assignment or picked a very low theta?\n\nEdit: delta", "score": 1, "replies": []}, {"body": "How much delta away? I suppose it would be OTM?", "score": 1, "replies": []}]}, {"body": "Its quite low premium considering the stock price, but a safe play", "score": 14, "replies": []}, {"body": "Low risk low profits. \n\nIt works though", "score": 8, "replies": []}, {"body": "0.3% premium @ 1 SD for 2/24 = roughly 15% per year,   okay I can see how someone would believe that is good premium", "score": 3, "replies": []}, {"body": "Premium too low, not as safe a a major etf like qqq or spy...if qqq falls msft sure af gonna follow anyways.", "score": 6, "replies": []}, {"body": "230s incometh", "score": 2, "replies": []}, {"body": "Wouldn’t sell puts till it hits 200", "score": 0, "replies": [{"body": "My target price is around 230", "score": 1, "replies": [{"body": "Look at the weekly/monthly moving averages and ask me if you’d feel comfortable bag holding Microsoft at a 20-30% decline.", "score": 0, "replies": []}]}]}, {"body": "Out of tsla+fanng , which one is more safe than msft? Hint: NoNE", "score": 1, "replies": []}, {"body": "works till it dont", "score": 1, "replies": []}, {"body": "Wouldn’t you want high IV if selling puts?", "score": 1, "replies": []}, {"body": "I like MSFT, although I took some lumps when it ran up to 270ish (was selling calls when news was poor, should have rolled and held strong).  I'm up $800.00 on my MSFT selling the past 6 months.  \n\nI do feel it fluctuates just enough that you have to monitor it and can't forget about them.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "116v5um", "created_utc": 1676859511.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|36 minutes ago\n**Total Comments**|0|**Previous Best DD**|\n**Account Age**|1 week|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "To paraphrase Buffett, if you want divvies, sell shares.", "score": 6, "replies": [{"body": "Doesn’t he also say don’t buy anything you don’t want to keep for at least 10 yrs?", "score": 1, "replies": [{"body": "He likes coke", "score": 2, "replies": []}, {"body": "That would explain those glasses.", "score": 1, "replies": [{"body": "🤣🤣🤣", "score": 1, "replies": []}]}]}]}, {"body": "Don’t get the itch to sell if it goes down. You will do well in 3-4 years.", "score": 2, "replies": []}, {"body": "You have a large account and lots of courage.\n\n\nI like goog at this price", "score": 0, "replies": [{"body": "Sounds like Cramer. RIP my boy", "score": 1, "replies": []}]}, {"body": "I bought a lot at  $99, $95 and $93.   we can swim in out profits together in 3 years when Google is raping everyone in AI.", "score": 0, "replies": [{"body": "Hahahaha.  We can only hope!", "score": 1, "replies": []}]}, {"body": "Keep an eye on the Supreme Court. If they go against them and section 230 you'll be in real trouble.", "score": 0, "replies": [{"body": "I wouldnt' personally worry too much about section 230, a bunch of major tech companies will probably lobby, bribe officials, and pull all kinds of shady BS to protect themselves(which I kind of want them to do because the court case is fucking stupid). The entire internet being drastically altered also probably wouldn't be too good for the economy.", "score": 2, "replies": [{"body": "It's a dividend government right now and you'd need 60 senators for a non-budget bill. I can't believe they could buy enough votes to get enough votes. There are a lot of pissed of politicians over the twitter files. Same with those judges in the case.", "score": 1, "replies": []}]}, {"body": "I’ll admit, the court case…… that’s my one concern.  I’m not worried about the AI debacle with BARD. I’m sure Googl is way ahead in AI, they just haven’t revealed everything yet.", "score": 1, "replies": []}]}, {"body": "Google will not exist in ten years", "score": 0, "replies": [{"body": "😳😳. Lol", "score": 2, "replies": []}]}, {"body": "#Submission Vote Removed\nThis submission was voted *spam* by the users of the voting system set up at [WSB Discord](http://discord.gg/wsbverse). If you disagree or want to be active in voting to help keep the subreddit clean, please join!\n##Reasons\n\nWasn't a Solid Discussion Starter\n\nMisuse of Discussion flair", "score": 0, "replies": []}, {"body": "Google is a strong company. I do expect it to reach the mid 80’s in the coming weeks/months …when it does, I’ll be buying", "score": 1, "replies": [{"body": "I’ll probably buy more if it hits mid 80’s", "score": 1, "replies": []}]}]}
