{"title": "[deleted by user]", "selftext": "[removed]", "id": "112dakn", "created_utc": 1676401465.0, "score": 21, "upvote_ratio": 0.96, "num_comments": 18, "comments": [{"body": "u/100_PERCENT_BRKB   If  it  hasn't  been  said  before,  let  me  be  the  first  to  say  that  i really love  you  putting  company  specific  art  for  threads  related  to  said  company.      The  Warcraft  art  here  is  especially  nice.    TU", "score": 21, "replies": [{"body": "I'm glad you enjoy it. You're welcome", "score": 15, "replies": [{"body": "We all love Deathwing", "score": 3, "replies": []}]}]}, {"body": "Keep up the Berkshire news. I always enjoy them.", "score": 8, "replies": []}, {"body": "Buffett's Berkshire reduces stake in Activision Blizzard\n\nNEW YORK/BANGALORE (Reuters) - Warren Buffett’s Berkshire Hathaway Inc reduced its stake in Activision Blizzard by 12.35% in the fourth quarter, to 52,717,075 shares, according to a regulatory filing on Tuesday.\n\nAfter this move, Berkshire holds a 6.7% passive stake in the “Call of Duty” maker.\n\n(END)", "score": 8, "replies": []}, {"body": "Interesting to see them start to sell off the ATVI since there was the initial ATVI position back in October and then later additional purchases for the arbitrage position , I wonder I’d they are only selling the initial position from the independent manager (I.e. not WB purchase). Or of course could just be selling the whole thing huh ?", "score": 2, "replies": [{"body": "I believe more than 15.6 million shares have been sold in Q3 and Q4, so we know Buffett is selling\n\nBut it's close (a million shares), so maybe this is Combs/Weschler?", "score": 2, "replies": []}]}, {"body": "Deathwing!? You didn't have to go this hard", "score": 2, "replies": []}, {"body": "You can't copy Berkshire Hathaway & become rich.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Wrong\n\nBuffett explained at the annual meeting that he had built a huge merger arbitrage position in ATVI (after Combs/Wescher made a smaller non-arbitrage purchase):\n\nhttps://www.cnbc.com/2022/04/30/buffett-berkshire-owns-9point5percent-of-activision-blizzard-shares-in-merger-arbitrage-bet.html\n\nThis is Buffett", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That's the smaller non-arbitrage purchase I mentioned\n\nBuffett then bought a lot more of ATVI as merger arbitrage", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Berkshire has now sold more than 22% of the huge ATVI position, 12% this quarter and 12% last quarter. Here is last quarter's selling:\n\nhttps://www.reddit.com/r/brkb/comments/yvclkw/berkshire_hathaway_q3_2022_changes_to_the_stock/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nI'm not going to explain this to you all day long\n\nAnd Buffett is spelled with two t's", "score": 0, "replies": []}]}, {"body": "I'm trying to follow based on the two links posted. Is this saying the original AVTI position was without knowledge of the proposed merger? And then purchase of additional shares was made as an arb?", "score": 1, "replies": [{"body": "Yes, that's correct\n\nCombs/Weschler were unaware of the merger at the time they invested. No merger existed. Buffett wrote an article explaining this:\n\nhttps://berkshirehathaway.com/activisionltr.pdf\n\nThen Buffett made a huge merger arb investment much later", "score": 1, "replies": [{"body": "Interesting. So one potential outcome might be the unwinding of the arbitration investment, while leaving the original stake from Ted and Todd intact.\n\nThis kind of cross-pollination between Warren and Ted and Todd makes following the play-by-play more complex.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Why don’t you like Snowflake?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "SNOW's IPO was priced at $120, right? So Berkshire is still in the money, if I'm not missing something.", "score": 2, "replies": []}]}]}]}, {"body": "am I crazy or didn't he actually increase the stake to like 20% through his other companies??\n\nhttp://archive.fast-edgar.com/20230214/A322J22CZW2RT2ZZ2H2I2WYM849MYZ22Z252/", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "112g3bv", "created_utc": 1676408605.0, "score": 24, "upvote_ratio": 0.96, "num_comments": 25, "comments": [{"body": "Previous quarter's changes to the stock portfolio:\n\nhttps://www.reddit.com/r/brkb/comments/yvclkw/berkshire_hathaway_q3_2022_changes_to_the_stock/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nBig flip-flop on Taiwan Semiconductor, buying $4 billion in Q3 and selling in Q4\n\n\"But, but, but... I heard Berkshire holds stocks forever! Warren Buffett would never trade in and out of a position!\"\n\nWrong\n\nBerkshire's median holding period is one year, with approximately 30% of stocks held for less than six months\n\nhttps://www.reddit.com/r/brkb/comments/pra9z9/observations_of_berkshires_behavior_how_does/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nWhy was the Apple buy so small?\n\nBerkshire wasn't buying Apple: The new shares were owned by Alleghany, which Berkshire acquired. Thanks u/Jabberwocky1988 !!", "score": 15, "replies": [{"body": "For any company that is also listed on a non-US exchange (Taiwan exchange, HKEX, lots of Euro exchanges), I remain very skeptical about holding information disclosed from 13F.\n\nTSM is mainly listed on taiwan exchange and NYSE is just ADR (not to mention the additional fees of ADR). It's 100% legal to journal those shares from NYSE to Taiwan exchange, and not to disclose those positions in 13F.\n\nPlenty examples like this BASF, BYD etc.", "score": 2, "replies": [{"body": "So you think Buffett converted 86% of the TSM shares and left 14% unconverted?\n\nProbably not. It's a sale. As usual, Berkshire is selling and and selling and selling", "score": 0, "replies": []}]}]}, {"body": "Interesting TSM action.", "score": 8, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Agreed, but it's a narrowing down to Bank of America and Citibank, while others are sold", "score": 1, "replies": []}]}, {"body": "Relatively little movement in terms of total dollars in the portfolio. My guess is some repurchase in October, not so much in November or December.", "score": 2, "replies": []}, {"body": "**Gregg Warren’s note on the recent 13f:**\n\nAnalyst Note | by Greggory Warren Updated Feb 15, 2023  \nWide-moat Berkshire Hathaway reported a relatively busy fourth quarter for its equity investment portfolio, with net sales (exclusive of purchases) coming in at an estimated $9.7 billion based on the insurer's 13-F filing (as well as a similar filing for New England Asset Management, which managed $5.4 billion of equities for Berkshire at the end of December).  \nThe biggest reductions on an absolute basis from the combined portfolios came from sales of Taiwan Semiconductor (with Berkshire eliminating 51.8 million shares, or 86% of its holdings, for an estimated $3.7 billion), U.S. Bancorp (86.1 million shares, or 91% of its holdings, for an estimated $3.6 billion), and Bank of New York Mellon (37.4 million shares, or 60% of its holdings, for an estimated $1.6 billion).  \nOther activity included the trimming of stakes in Activision Blizzard (7.4 million shares for an estimated $560 million), Chevron (2.4 million shares for an estimated $390 million), and McKesson (0.3 million shares for an estimated $120 million). Berkshire and NEAM raised another estimated $180 million reducing stakes in more than 40 smaller holdings, while the elimination of stakes in more than 60 other small holdings raised another $20 million.  \nMissing from the filings is Berkshire's sale of shares in BYD Company, the Chinese electric car maker. Since August of last year, the insurer has sold off more than one third of the 20.5% stake it has held since 2008, with the sale of another 4.2. million shares earlier this month, lowering its stake in BYD to around 12%.  \nAround $415 million of the proceeds generated during the fourth quarter were directed to stock purchases focused primarily on enhancing stakes in existing stock and ETF holdings. There were, however, three new money purchases during the period: KeyCorp (0.3 million shares for an estimated $5 million), AT&T (0.3 million shares for an estimated $5 million), and Alphabet Class A (17,100 shares for an estimated $1.6 million).", "score": 2, "replies": []}, {"body": "https://www.marketwatch.com/story/berkshire-hathaway-boosted-its-apple-stake-last-quarter-e0bbef05?siteid=yhoof2", "score": 1, "replies": [{"body": "No, see the pinned comment\n\nThe additional Apple comes from the Alleghany acquisition", "score": 5, "replies": [{"body": "How you explain 894m to 915m shares", "score": 1, "replies": [{"body": "u/jabberwocky1988 Please provide a link", "score": 3, "replies": [{"body": "Here is the Barron’s script:\n\nBerkshire’s largest holding, Apple (AAPL), was up by roughly 300,000 shares to 895.1 million shares, and likely reflected the inclusion of Apple stock held by Alleghany, the insurer that Berkshire bought in the fourth quarter.", "score": 3, "replies": [{"body": "And link:\n\nhttps://www.barrons.com/articles/berkshire-hathaway-warren-buffett-13f-c13790a5?mod=hp\\_LEAD\\_5", "score": 4, "replies": []}]}]}]}]}]}, {"body": "It’s weird, buffet buy 21M shares of apple in q4.", "score": -2, "replies": [{"body": "No, see the pinned comment\n\nThe additional Apple comes from the Alleghany acquisition", "score": 3, "replies": [{"body": "The link said that he bought 21M apple (increased from 894m to 915m)", "score": -1, "replies": [{"body": "u/jabberwocky1988 Please provide a link", "score": 1, "replies": [{"body": "I post it in my comment above", "score": 1, "replies": [{"body": "I'm asking Jabberwocky1988 to provide a Barron's link for you", "score": -1, "replies": []}]}]}]}]}]}, {"body": "Where is the addition of Occidental Petroleum here?", "score": 1, "replies": [{"body": "Also no mention of BYD?", "score": 1, "replies": [{"body": "BYD is foreign, so it's not not included in the 13-F here\n\nI haven't looked at the OXY filing. Maybe the warrants were misinterpreted by the reporter (counted as shares owned), somebody please verify", "score": 3, "replies": []}]}]}, {"body": "am i going crazy or did buffet increase his ATVI position hugely by buying through his subsidiaries???\n\nhttp://archive.fast-edgar.com/20230214/A322J22CZW2RT2ZZ2H2I2WYM849MYZ22Z252/", "score": 1, "replies": [{"body": "For tax and regulatory reasons, equity investments are typically held by Berkshires insurance subsidiaries. Those aren’t additional shares.", "score": 1, "replies": [{"body": "THANK YOU\n\nI thought so but was going crazy trying to confirm", "score": 1, "replies": []}]}]}]}
{"title": "What is the causal reason as to why a negative yield curve corresponds with a recession?", "selftext": "I get it, an inverted yield curve has preceded nearly every recession, but I don’t get why. On a micro level, my spending doesn’t change as a result of this, my contribution to GDP and virtually everyone I know doesn’t seem to change much. So why is it a good indicator or is it simply because it has worked previously?", "id": "111qnsd", "created_utc": 1676339609.0, "score": 39, "upvote_ratio": 0.93, "num_comments": 23, "comments": [{"body": "Tl;dr \r  \n•\tFalling capital investment is the most important part of equation for what causes a recession, which is an extended period of economic contraction \r  \n•\tMost capital investment is paid for with debt\r  \n•\tHigh debt costs cause investment to go down, which slows down the economy and in a negative feedback loop that will put you it into a recession \r  \n•\tIt is not the “yield inversion” that causes the recession, it’s simply high interest rates, and yield inversions are simply correlated with recessions because they occur when interest rates go up a lot. Eventually the high level of savings that occur right before a recession will also drop the interest rate back down so that it un-inverts once the recession begins\r  \n•\tNone of this post covers the implications for cashflow within the banking industry from changes in interest rates, which in and of itself may cause a recession because of fallout in bank bankruptcy and bank runs. This is more complicated. This is not actually how “normal” recessions happen, but what made 2008 worse than it otherwise needed to be.\n\n\rAn inverted yield curve means that short term debt costs more than long term debt. Now usually when the yields become inverted, it’s usually not because short term is high and long term is low, but because short term is very high, and long term is also high but still lower than short term.\n\n\rIe; It’s not like the short term rate is 2% and long term is 1% - the US 10 Year bond rate is still 3.7% whereas the US 2 Y Bond rate is 4.5%. This is important to understand, because if short term was high but long term was low, it would not pose a big of an issue. \n\n\rThe second thing to understand is that the underlying cause of most recessions is a drop in capital expenditure. It’s not the average consumer changing their short-term spending patterns that causes a recession, it’s businesses and governments changing their long-term capital investment programs that causes recessions. \n\n\rOf course, lower consumer spending also influences capital investment decisions so It’s not like these things don’t all interact with each other in an extremely complex web, and you can get into chicken vs egg scenarios when you try to imagine what causes what, but I am making the case that It is investment or capital expenditure that causes recessions. \n\n\rIf it was simply consumer spending dropping, you would not really experience a normal recession, you would experience a very quick correction, followed by life immediately returning to normal once people started spending again. Which, sans the public health issues, COVID was like that. Consumers immediately stopped spending, the Government put money in many people’s pockets, and then two months later everyone went back to spending and everything mooned in a V shaped recovery. \n\n\rWhat causes an extended multi-quarter long contracted in economic activity, and what causes businesses to go broke, and what causes people to lose their jobs, is a fall in capital expenditure. This is because capital expenditure is not only required for future growth, but also because capital expenditure represents mostly large projects from which a significant amount of businesses and people make their living (The construction & engineering industries are an easy visual for this, but all industries have different capital investments that affect different occupations in much the same way construction is impacted rises or falls in capital investment). \n\n\rHow the yield curve interacts with this is a significant amount (most) capital expenditure is funded with debt. The profitability / viability of the investment is dependent on how much more the returns on the investment outweigh the cost of the debt. Governments and businesses typically make the duration of their debt to match how long their investments will last, but also, they can massage the duration of their loans to get the best outcomes. For example, during COVID, when long term interest rates were very low a lot of companies and governments issued an absolute motza of long term debt to investors who (foolishly) bought up trillions in long term debt that had <1% interest rates. \n\n\rSay you’re a business and you’ve got a lot of debt that is currently on a 2% interest loan maturing, and you also have a list of investments you want to make at some point in the future so you can grow your business, but none of the projects will work if interest is above 5%. Now you look at what debt costs are now, and you see if you wanted to get a 2-3 year long or issue your own debt the interest cost would be 6.5%+, or you could issue a long term debt but the interest cost is still 5%+. \n\n\rYou don’t really want to lock yourself into a 10 year loan, and none of your investments pencil out with short term interest rates being above 5% so what do you do? \r  \nSimply not invest. Just hold your cash, go about your business as usual with the rest of your business and wait for interest rates to come down or market conditions to change so that your investments become more viable. \n\n\rBut what does that mean for the engineering company, and construction company that rely on your investment to provide the money that employs them? It means they have less money, and they decide they have to slow down their business too. \n\n\rAnd what does that mean for all the companies that exist to serve the household consumer? Well, the industries more sensitive to capital investment now have less money to employ people, and now households are spending less, so now consumer companies have less money, and suddenly everything slow down. Now the consumer is slowing down, and revenues are drying up and suddenly lots of companies looking at their capital programs now realise market conditions are even worse and more and more investments become unviable with revenue and cashflow expectations being worse than previously thought, so they defer investment. Now inflation turns to deflation as cashflow seizes up and heavily indebted households and businesses simply go broke as deflation makes debt service even harder, which further feeds into job losses and cashflow issues. \n\n\rNow you’re in a negative spiral and now you’re in recession. \n\n\rBecause no one is spending money or investment in new capital projects, lots of people are sitting on a lot of cash that isn’t doing anything, meaning the market for interest rates should respond by dropping interest, and eventually things will course correct once interest become cheap enough that companies start investing again and money starts moving again. \n\n\rThe original Keynesian case for government intervention in recessions specifically calls for Governments to engage in public capital expenditure during recessions. Governments can take a theoretically infinite time horizon to their investments and their size, scale and access to the cheapest debt means they still run very well during recessions.  If Governments increase their public capital expenditure in response to falling private capital expenditure, the economy will be less affected, optimism will be maintained, and private businesses will be more likely to return to market with investment plans in a quicker manner than would otherwise be the case if the market was left purely to its own devices. Keynes observation in the Depression was the negative feedback loop never corrected, but kept getting worse year on year, something Neo-classical economists said wouldn't happen, and that Keynes said required Gov intervention to break the negativity loop. \n\nIt is therefore more of a correlation that an inverted yield curve causes a recession, because it is a correlation that yield inversions occur right when interest rates are at their highest, which is what is the actual casual relationship between debt and recession. \n\nMany Economists (and central banks) do not predict recessions even though the yield curve is extremely negative precisely because they look at inflation, and they look at long term debt interest rates and realistically speaking, long term interest rates are still not very high!!", "score": 60, "replies": [{"body": "Excellent explanation; thank you", "score": 9, "replies": []}, {"body": "Should be mandatory reading for the sub.", "score": 8, "replies": []}, {"body": ">Ie; It’s not like the short term rate is 2% and long term is 1% - the US 10 Year bond rate is still 3.7% whereas the US 2 Y Bond rate is 4.5%. This is important to understand, because if short term was high but long term was low, it would not pose a big of an issue.\n\nFirstly, I'm not sure I entirely sure I understand what you mean by \"high\" or \"low\" yield as what a high or low yield is would be relative to inflation, debt and growth dynamics? Eg, a high yield in a low debt country like Russia might be 10%, while a high yield in a high debt country like Japan might be 0.5%.\n\nBut mort important, wouldn't long-term bonds yielding less than short-term bonds always be a warning sign? Doesn't that always suggest the market is expecting short-term yields to drop – something which would generally only happen if the market believes economic demand will weaken in the near-future?\n\nAlso, just a note, rates are things that are set, eg your bank might pay you a set interest rate on your savings with them. Bonds have a coupon rate which is set at issuance, but I think what you're referring to here is the yield which is based on the coupon rate / price you pay for the bond – it's a market price basically.", "score": 2, "replies": [{"body": "Yeah you're right it's all relative. Maybe I didn't word it very well. They're high now in the sense that the long term interest rates are the highest they've been in many years, but relative to inflation, they're not high at all, which is why lots of people don't expect recession - real interest rates are still negative/only mildly positive depending on duration. \n\nShort-term yielding less than long-term is a worry yes, because it does mean investors believe interest rates will come down and then you get into a self fulfilling prophecy. \n\nAnd yes I'm generally referring to the market price of interest, which will in turn affect what everyone else sets with their loans and issuances. Because talking about market interest rates is easier to imagine when you talk about macro theory like that, but in reality interest rates are usually incredibly sticky because the short end of the curve is controlled by central banks. \n\nPeople give \"bond investors\" great credence because they have a 'great track record' of predicating recessions, which comes down to the 10-2Y inversion, but I think people greatly overrate the importance of that metric in how good the 'bond market' is at predicting macro movements. The first issue is that investors are human and can't predict the future that well anyway, and secondly, the market for interest rates is almost entirely centrally controlled and manipulated. \n\nIf the 'bond market' is such a great tool for predicting macro movements long term interest rates would have never gone below 1% in 2020. All you can really say about the bond market is that it often front runs central banks, and when they run in the right direction people think they're geniuses, and when they run in the wrong direction, no one thinks anything of it and forgets about it. The 10Y-2Y is a very high accuracy metric that gets recorded when they front run in the right direction. The interest rate market has had a generally great record front running central banks the last 18 months - will the next 18 be as good?", "score": 2, "replies": [{"body": "I have a rule to remain sceptical of any simple and widely agreed upon economic theory / indicator which models complex economic data, regardless of its historical track record. The yield curve is one of those for me. The idea that something as simple as an inversion in market pricing of 2 year vs 10 year treasury bills can reliably predict recessions seems highly suspect to me.\n\nAnd in reality the yield curve kinda sucks as an indicator anyway because it's completely unactionable. If the yield curve inverts it tells you nothing about when the recession will happen, nor what the market reaction to the recession (should it happen) will be. And that's without even getting to what a recession is. I guarantee if we don't have a recession this time around everyone will point out that the yield curve still worked because it predicted the 2022 technical recession.\n\nPersonally I find the yield curve interesting in so far as it hints at what markets believe (often vs central bankers), but that's really about it. It's certainly not a crystal ball, and as you point out, it's often wrong.", "score": 0, "replies": []}]}]}]}, {"body": "It's mostly based on perception.\n\nThe debt markets think near term risk is higher than long term risk, so shorter term debt-based assets are purchased less than long term debt. \nLenders are also more reluctant to provide loans in the short term and thus demand a higher rate. This is what creates the negative yield curve. What often creates short term risk? Recessions, as this is when there is a relatively elevated risk of default.\n\nIt isn't causal per se; though an inverted yield curve does also make it harder for banks to create a profit. Additionally, just because there is an elevated risk of default in the short term doesn't necessitate a recession.", "score": 10, "replies": []}, {"body": "One thing not mentioned often is that if rates go down again, value of bonds with high coupons (i.e. emitted now) increase drastically. Rates from 5% -> 2.5% almost doubles the value for bonds with long time left and not so much for shorter bonds. For rates to go gown, there needs to be a reason: either some bad problem (war, financial crash, pandemic,...) or inflation below target rate.\n\nAlso if inflation does go to 2%, bonds yield a net positive rate again.\n\nSo buying long running bonds is: a) relatively safe to make a small profit and b) if rates go down you become rich", "score": 6, "replies": [{"body": "ETF tickers please?", "score": 1, "replies": [{"body": "sorry, don't know. Heard TLT but I don't like ETFs for bonds so didn't look into it", "score": 2, "replies": []}]}]}, {"body": "people be giving \"simple explanations\" and then write a whole page lol here's an ACTUAL \"simple\" explanation:\n\nnegative yield curve means bond investors are moving money out of short term bonds and into long term bonds, and idk if you know this but bond investors are some smart cookies, they know more about the economy then you or i ever will, so if they're no longer confident about growth in the near future then that obviously means there's something brewing under the surface, they know what that something is but you and i don't and won't until after it's already happened", "score": 1, "replies": []}, {"body": "Because when the FED raises rates at this high of a level to fight inflation, it leads to a slow down in the housing market. As we have seen in the past year the extensive rising rates slowing the housing market, allowing inflation to slow down as we trim jobs. In return, people are more reluctant to invest in the markets, putting their money into savings vs stocks because of the shanky economy. With all of this going on plus rising costs of producing and receiving products it is a perfect recipe for an inverted yield curve. I just made all of this up by the way but it sounded pretty good.", "score": -5, "replies": []}, {"body": "The bond market is viewed as being one of the most informed markets in the world and it makes predictions on where fed funds rates will be in the future and what will happen in the future. When the bond market is willing to accept a lower return for long term bonds vs. short term bonds they are saying that they expect short term rates to drop below that rate soon which is usually done due to a need for stimulus.", "score": 0, "replies": []}, {"body": "Absolutely nothing, is just an statistical signal from the bond market. And this \"signal\" is sketchy at best. \"6-12months\" means jack shit.", "score": 0, "replies": []}, {"body": "High cost of borrowing = no one is borrowing = businesses arent starting and people arent spending", "score": 0, "replies": []}, {"body": "An inverted yield curve means that older bonds have higher yield. \n\nMeaning more people are selling their longer maturity bonds, reason being they expect interest rates to rise sometime in the future. If interest rates rise it means that current yields are insufficient to protect purchasing power.", "score": -1, "replies": []}, {"body": "**Jobs**\n\nWhen people are out of work they begin looking more closely at their personal budgets.\n\nThis lowers demand, meaning businesses must look more closely at their budgets, which can lead to layoffs.\n\nCycle rinses and repeats until the fat is trimmed.\n\nThe widely held expectation was that raising interest rates from near zero to the lower end of normal was going to lead to massive layoffs. That has yet to materialize.", "score": -5, "replies": []}, {"body": "There is a lot of theory behind it. The scary thing is how often the 3mo/10y is right. It predicted the Corona virus recession months prior when there was no sign of a recession.", "score": -2, "replies": []}, {"body": "There are a lot of interpretations of an inverted yield curve. One of them is that the bond market doesn’t believe rates will stay higher for longer and will come down in the near future. So why would the rates come down? Because of slow growth and low inflation hence the market is betting that is the most probable outcome. The market is correct a high percent of time and that is why an inverted yield curve is a good leading indicator of a recession.", "score": 1, "replies": []}, {"body": "Normally, longer duration bonds will have higher yields because they are further out from expiry, and therefore you are taking on more risk (and opportunity cost) when you buy one. However, if the bond market expects interest rates to decline in the near future, bond investors will prefer longer duration bonds. If you think interest rates are going to zero would you rather lock your money up in a two-year treasury and then have nowhere to park your money when it expires, or a ten-year treasury that will continue to get decent coupon payments throughout the low interest rate period? When bond investors pile into longer duration bonds, the increased demand sends their prices upward which subsequently pushes down their yield.\n\nSo the question becomes, why would bond investors expect interest rates to drop in the near future? The two most obvious answers are that they expect a recession or they expect inflation to decline.", "score": 1, "replies": []}, {"body": "On a micro level, perhaps consider someone that matters.\n\nLike your employer.", "score": 1, "replies": []}, {"body": "Do you understand the dynamics between bond yields and economic growth? Because it kinda follows from that.\n\nIt takes a while for it to click, but I'll try to walk you through the basics:\n\nIf economic growth is strong, then inflationary pressures in the economy can generally be expected to be higher because there's more demand from consumers to buy things.\n\nCentral bankers have a duty to keep inflation in an economy at 2% a year, but when growth is strong it will typically want to run much hotter than that.\n\nTo bring down inflationary pressures the Fed raises the Fed funds rate (more on the why later). The Fed funds rate is basically the rate banks have to pay to borrow from each other overnight, and is a guaranteed rate backed by the central bank.\n\nThe fact it's an overnight rate and backed by the central bank means that Fed funds can be thought in essence as the lowest risk yield on deposits a bank has access to.\n\nHowever, when people talk about the \"yield curve\", they're generally talking about the difference in yield on US treasury bills. These are not directly linked to the Fed funds rate, which is a common misunderstanding.\n\nUS treasury bills are generally considered \"risk-free\" but, they still carry more risk than the overnight Fed funds rate. Why? Well, a treasury bill which yields 5% a year, over say a 10 year period requires you lock your cash up for that 10 year period to make that 5% a year return. In which time yields could drop (which would be good if you locked in at a 5% return), but yields could also move higher – in which case you're missing out as you're locked in at a lower rate.\n\nThis extra uncertainty associated with longer duration treasury bills generally requires investors be compensated for taking on that risk. For this reason with a normal yield curve you would expect to see shorter duration treasury bills (1 or 2 years, for example) yield less than longer duration treasury bills (10 or 20 years, for example).\n\nOkay, so given this, why would a yield curve ever invert, and why does this predict a recession?\n\nWell, I skipped over something important earlier... Why does the Fed raise the Fed fund rate to slow inflation? Well, as the Fed funds rate rises banks can make more (risk free) on their overnight deposits. If banks can make more money risk free then they might be nice and pass that on to you as a saver in the form of higher rates on your saving account. And if you're getting higher rates on your savings then you might put more money in the bank instead of spending it, where it would be fuelling demand, therefore fuelling inflation. See the relationship now?\n\nBut you might be a savvy investor... You know that investing your spare cash in a 2-year government treasury bill will give you a 3% yield vs your bank's crappy 1% interest rate on savings. Or even better, you could lock it up in a 10-year government treasury bill and make 4% a year.\n\nBut do you see the issue here?\n\nWhat if you lock up your cash in a 10-year treasury bill yielding 4% a year and the Fed decides to raise the Fed funds rate to 10%? Now maybe your bank will pay you 8% on savings and a 2-year government treasury bill will pay you 11%... Do you really want lock in your cash at current yields?\n\nIn an environment where you expect growth to remain strong and the Fed to continue to raise rates you will want the yield on those long-term treasury bills to be much higher to compensate your risk. This is why a steep yield curve is generally considered a positive sign for growth, because it means investors anticipate the Fed will be raising rates in the near-future.\n\nBut what if you think the economy is going to slow instead? Well in that case the Fed isn't going to want you to save your spare cash anymore, but spend it. And to achieve this they'll cut the Fed funds rate and then the opposite effect comes into play...\n\nSuddenly you'll now be incentivised to lock in a high yield for as long as possible before rates come down. Now you might even be happy with a lower yield on your 10-year treasury bill, because you think the 2-year treasury bill will yield less soon and you'll want to lock in the high yields you currently have access to for as long as possible with a 10 year bill. This is basically what causes the yield curve to invert – investors believing that rates will drop in the near future. And generally they believe this will happen because they anticipate the economy will weaken, demand will drop, and therefore inflationary pressures will be lower than the Fed's 2% target.\n\nI left so much out here, but I was trying to keep it as simple as possible while being as correct as possible about how everything works. But feel free to ask any questions if you're unclear about anything.", "score": 1, "replies": []}]}
{"title": "Soros Fund Management Boosted its Stake in Tesla (TSLA) by 270% in Q4 2022", "selftext": "", "id": "111pf2s", "created_utc": 1676336044.0, "score": 120, "upvote_ratio": 0.98, "num_comments": 24, "comments": [{"body": "Ahh, the person that cause my country(Malaysia) to crumble economically in the year [1997](https://www.wsj.com/articles/SB874869702799623500?mod=_newsreel_3) is in the same boat with me know, kinda love hate relation, just like my gf.", "score": 23, "replies": [{"body": "Soros were slammed by Tun Dr Mahatir ..", "score": 3, "replies": []}, {"body": "He didn’t cause any economy to crumble, that was done by governments choosing to peg currencies out of laziness instead of good economics.", "score": 1, "replies": []}]}, {"body": "It is a very small position. Seriously, the average local Tesla Owners Club would have more shares than Soros. Not worth any excitement.", "score": 3, "replies": [{"body": "Nit-picking, but 332,046 total shares is not \"very small\" and I doubt more than a few retail investors have this many shares ($66M at today's price).\n\nBut you're right, it's not a huge amount compared to other funds.", "score": 8, "replies": [{"body": "It’s Vanguard fifth largest holding.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Ah, sorry, I somewhat misread what you wrote. Thought you were talking about an \"average Tesla Owners Club **member**\". So yes, very much agree with you.", "score": 5, "replies": []}, {"body": "There’s a retail investor that owns billions of dollars of Tesla.", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": -4, "replies": [{"body": "[removed]", "score": 8, "replies": []}, {"body": "[removed]", "score": 5, "replies": [{"body": "[removed]", "score": -6, "replies": []}]}]}, {"body": "Just another member of the 1 percenters club. They're going to do what the want, when they want to, because they can.", "score": 1, "replies": [{"body": "You may be unaware, but judging a whole group of people is wrong.  Also, in this case, it makes you appear envious.  If that’s what you’re going for, then fine.", "score": 4, "replies": [{"body": "I am aware that the rich keep getting richer. I am sorry if you belong to the group of people that you think I am trying to judge and have offended \nyou in any way I was just  stating the obvious that I believed  to be true based on all the media that I have been exposed to. No I am not envious, just oblivious.\nWhen I see all the rich people of the world getting together and building new schools, hospitals, soup kitchens, and food banks at locations all over THIS planet then I will be inspired. \"It is easier for a camel to go through the eye of the needle than for a rich man to get into heaven.\" Have a blessed day.", "score": 1, "replies": [{"body": "If you think all the rich people in the world are “getting together”, that’s delusional.  I know quite a few, and that’s not the case.", "score": 2, "replies": []}, {"body": "Mr Beast gave eyesight back to 1,000 people. Twitter was NOT impressed. They dragged him for it.\n\nIf those sort of people have your ear, you should cut them loose.", "score": 1, "replies": []}]}]}]}, {"body": "Aaaahhhh and now they invite Elon to the White House? It all makes sense now.", "score": -5, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Can you provide a source? I tried googling but could not find it. I'm still under the assumption that Biden having the EV Summit day without inviting or meantioning Tesla was the trigger for Elon's antics against Biden.", "score": 2, "replies": [{"body": "How about when he gave Mary Barra credit for GM “electrifying the industry”", "score": 2, "replies": [{"body": "Correct. Government has been anti Tesla for a long time and now things begin to change following a George Soros investment. I know corruption when I see it.", "score": 0, "replies": []}]}]}]}]}, {"body": "![img](emote|t5_n9evv|3837)![img](emote|t5_n9evv|3837)![img](emote|t5_n9evv|3837)![img](emote|t5_n9evv|3990)", "score": 0, "replies": []}]}
{"title": "2023-02-14 Wrinkle-brain Plays (Mathematically derived options plays)", "selftext": "[removed]", "id": "111pf6h", "created_utc": 1676336053.0, "score": 25, "upvote_ratio": 0.87, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|2509|**Previous Best DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/ud1sj8/fb_earnings_are_today_after_market_close_place/) [x](https://www.reddit.com/r/wallstreetbets/comments/xqc5j2/gme_and_the_number_69_how_t69_could_be_the_secret/) [x](https://www.reddit.com/r/wallstreetbets/comments/10dyvdo/20230116_wrinklebrain_plays_mathematically/) \n**Account Age**|8 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: The plays and target entry prices given are calculated using a binomial option pricing model that reflect the expected size and duration of the reaction from gamma max or delta neutral. A lot of these plays are profitable by underlying moves in stock. The best plays benefit from the directional move as well as the increase in IV.", "score": 1, "replies": []}, {"body": "I tried one of your plays from two weeks ago. It started depreciating as soon as I purchased it and will expire worthless on Friday.", "score": 18, "replies": [{"body": "22-40% of these posted plays are expected to expire worthless. That's the nature of trading. And I'm very upfront about that. \n\nI don't know which 22-40% beforehand. \n\nOne way I try to mitigate that is setting a specific entry price. \n\nAnother way is by risking a small amount per trade.\n\nI think the people who have the most success with these plays use them in addition to other DD to assess whether or not to enter. \n\nUnfortunately I don't have much information to go on (which play? what price?) for your specific situation.", "score": 8, "replies": [{"body": "I'm not salty about it, I just never see any discussion on these posts other than thank you's. I only bought 1 contract, so I didn't risk much at all. It was the PFE 50C.", "score": 3, "replies": [{"body": "For reference: [https://options.hardyrekshin.com/#PFE](https://options.hardyrekshin.com/#PFE)\n\nShort answer is I got this one wrong. Was expecting a rebound similar to what happened October 6, 2022 and that didn't happen.", "score": 2, "replies": [{"body": "Question:  You say to exercise caution when the price has moved above entry, but the PFE call was the first time I was able to scoop one of these contracts below entry. Every other contract I've looked at is always above entry at market open. Is the idea to wait and see if it falls back below entry and buy then? Or wait for the next list of plays?", "score": 1, "replies": [{"body": "Wait for the price to move toward the entry--without blowing past it.  \n\n\nSo it seems in the case of the PFE 50C, the price blew past the entry price in premarket for a reason which invalidated the original thesis.   \n\n\nThe ideal entry is a contract where the price drifts slowly toward the target entry price, crosses the target entry price by a small amount, then reverses and moves in the target direction.   \n\n\nIt's fairly rare for the most profitable plays to be entered right at 9:30am. Most of them are usually entered between 11am and 2pm.", "score": 1, "replies": [{"body": "Gotcha. Yeah, I thought the PFE C was suspicious with that price action, which is why I only bought one contract.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Hardy’s plays consistently make me money, maybe that’s just my luck of the draw. Just pay attention to the strike price and date, if the price is different then the market conditions are different and that play might not be great anymore.", "score": 3, "replies": []}, {"body": "Did you buy it the day it was posted?", "score": 2, "replies": [{"body": "Impossible since they post these after market close, but purchased first thing the next morning.", "score": 3, "replies": [{"body": "Damn you picked an unlucky play, I guess. I’ve always done pretty well with these.", "score": 1, "replies": []}]}]}]}, {"body": ">No, I haven't back-tested this.", "score": 4, "replies": []}, {"body": "Okay I’m gonna test these tomorrow. Fingers crossed.", "score": 2, "replies": [{"body": "When should I exit?", "score": 1, "replies": []}]}, {"body": "I made ~50% on CVS today. Played another one last week and made 20% in an hour.\n\nI don't go all in on these, and I'm not looking to make 100% each time. A few percentage points each trade is good enough for me", "score": 2, "replies": []}, {"body": "I just use these to get in the right direction while I learn. These are a good educational tool for me to not instantly lose everything. I have made a few bucks as well. So thank you.", "score": 1, "replies": []}, {"body": "I watched TBT, TLT, MO and ATVI. MO and ATVI never went below the entries outlined above. TBT and and TLT  both dropped below their entries (kinda the same play). I entered about $.10 lower than above entries. They both climbed to about + 10% - 12% and then had sharp declines (no surprises since 20 yr treasuries are expected to go up). Right now I'm sitting at ~45% losses on each and will likely stop out at just over a 50% loss.", "score": 1, "replies": []}, {"body": "I took your CVS put play and now it's in the money. Any recommendation as to how far the price could drop?", "score": 1, "replies": [{"body": "Probably worth taking the profit. CVS is around delta neutral now.", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1126cuw", "created_utc": 1676384048.0, "score": 15, "upvote_ratio": 1.0, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|5 months ago\n**Total Comments**|283|**Previous Best DD**|\n**Account Age**|5 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "That’s not even an option yolo, gtfo", "score": 14, "replies": [{"body": "Let's see your position. I can't utilize options in this portfolio.", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|27189)", "score": 1, "replies": []}, {"body": "I'm looking confused at this lol", "score": 0, "replies": []}]}, {"body": "Bought 8k worth yesterday too. Only as a hedge against my longs though. Trend still favors the bulls", "score": 2, "replies": [{"body": "This is more of an in and out on bad CPI, but also a hedge.", "score": 1, "replies": []}]}, {"body": "If qqq falls 3% you will barely make 3k. Is this a long term position?", "score": 2, "replies": [{"body": "No, it's a short hedge because of bad CPI. I understand the overall trend is still bullish, but today isn't going to go well.", "score": 1, "replies": [{"body": "No I get that, I am saying even if qqq falls 3 % you will only make 10 percent I.e. 3k from this position. Is this what you wanted ? Seems like a lot of capital to risk for 3k. A Csp would have yielded better I think ?", "score": 1, "replies": [{"body": "Yeah.\n\n10% in a day.\n\nAlmost no chance to cause any window jumping.\n\nThus guy is clearly NOT regarded, and should gtfo.", "score": 1, "replies": [{"body": "There is always a cause for window jumping. Unless you are doing complex option strategies with multiple legs but even then you can still get screwed lol", "score": 1, "replies": [{"body": "What.\n\nOfc you can get screwed with multiple legs.\n\nIt's actually way harder (ikr, seems opposite) if you have *less* than multiple.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Sir, this is Wallstreet Bets, not Geriatric Investments.", "score": 2, "replies": []}, {"body": "Ultra pro “sht “ 💩", "score": 0, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I bought ProShares UltraPro Short QQQ (SQQQ) for $30,005.00 on 02/14/2023. The shares are currently worth $35.30 each, and I have 850 shares outstanding.", "score": 1, "replies": []}, {"body": "gl it was priced in to some extent", "score": 1, "replies": []}, {"body": "You copped at the bottom", "score": 1, "replies": []}, {"body": "Use a stop loss now that you’re in profit", "score": 1, "replies": []}]}
{"title": "UPST Upstart so bad they are not trading it after hours 15 minutes after earnings", "selftext": "Tue, February 14, 2023 at 2:05 PM MST\n\nFourth Quarter 2022 Financial Highlights\n\nRevenue. Total revenue was $147 million, a decrease of 52% from the fourth quarter of 2021. Total fee revenue was $156 million, a decrease of 46% year-over-year.\n\nTransaction Volume and Conversion Rate. Lending partners originated 154,478 loans, totaling $1.5 billion across our platform in the fourth quarter, down 62% from the same quarter of the prior year. Conversion on rate requests was 11% in the fourth quarter of 2022, down from 24% in the same quarter of the prior year.\n\nIncome (Loss) from Operations. Income (loss) from operations was ($58.5) million, down from $60.4 million the prior year.\n\nNet Income (Loss) and EPS. GAAP net income (loss) was ($55.3) million, down from $58.9 million in the fourth quarter of 2021. Adjusted net income (loss) was ($20.9) million, down from $87.0 million in the same quarter of the prior year. Accordingly, GAAP diluted earnings per share was ($0.67), and diluted adjusted earnings per share was ($0.25) based on the weighted-average common shares outstanding during the quarter.\n\nI only have one $14 put….but it is going to pay.", "id": "112gjs5", "created_utc": 1676409777.0, "score": 9, "upvote_ratio": 0.65, "num_comments": 25, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|1 year ago\n**Total Comments**|560|**Previous Best DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/pq6a5p/dnathe_new_mrna_stock/) \n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: LendingTree will report lower revenue, margins and profitability in 2022 as the company transitions to a new business model. LendingTree is not a growth stock and will likely trade sideways for the next few years.", "score": 1, "replies": []}, {"body": "You got crushed my friend...\nI sold strangles on this, 14p and 19c, so im a happy clam.", "score": 12, "replies": []}, {"body": "Insane that this company used to be 300+ a share.", "score": 6, "replies": [{"body": "This CNBC interview in october 2021 where the host asked what the company did was amazing. Pure comedy gold. Highest closing price was actually very near to $400.", "score": 7, "replies": []}]}, {"body": "Don’t look like it’s gonna hit 14 my boy", "score": 4, "replies": []}, {"body": "$UPST up 4% premarket", "score": 3, "replies": []}, {"body": ">I only have one $14 put….but it is going to pay.", "score": 4, "replies": [{"body": "Damn right it is", "score": 2, "replies": []}]}, {"body": "It did this last time too, it's too volatile and illiquid", "score": 2, "replies": []}, {"body": "[I’m rolling the dice on this one](https://www.the-random-investor.com/post/5-best-contrarian-stocks-to-buy-now-for-passive-upside-after-the-bear-market)", "score": 2, "replies": []}, {"body": "No, my put is fucked.", "score": 2, "replies": []}, {"body": "shortsqueeze", "score": 2, "replies": []}, {"body": "Upst up 25% on my screen", "score": 2, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": "Nope….this one sucked.  I hope it runs up a little more actually.  If we are going into a recession, companies giving out loans to lower credit buyers are going to suffer.  I’ll be looking at buying more puts on this, Affirm, etc….but for now I’ll stay away form this one until the IV drops.", "score": 1, "replies": []}]}, {"body": "The stock was trading between $100-160/share this time last year, its currently at $16.50/share, so comparing YoY changes without taking that into account is rather silly. \n\nThey smashed EPS estimates and beat Rev estimates. The potential saving grace for puts is the awful Q1 guidance.", "score": 4, "replies": []}, {"body": "Sentiment was already so low (and earning were above what we already knew was coming).. but given that its so oversold from all time high- the over 40% short interest/ 30M shares shorted).. is what will take UPST up.", "score": 2, "replies": [{"body": "yes not sure why downvoted", "score": 1, "replies": []}]}, {"body": "Halt my dick", "score": 2, "replies": []}, {"body": "Good one for short squeeze", "score": 2, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "Whelp….not looking good.  Luckily it was a spread and i sold the call for 60% up before the market close.  I’ll end up down probably unless I can get around 25% out of the put.  I just can’t get it right lately.  I sold my ABNB call for 100% but if I held through earnings I’d be up several hundred percent.  Whenever I don’t take a solid profit it tanks after earnings.  At least its just play money lately.", "score": 1, "replies": []}, {"body": "$UPST up 2% PREMARKET", "score": 1, "replies": []}, {"body": "$UPST 3% premarket", "score": 1, "replies": []}]}
{"title": "Never bet against Tesla", "selftext": "", "id": "112jxxu", "created_utc": 1676418618.0, "score": 336, "upvote_ratio": 0.91, "num_comments": 29, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|2 months ago\n**Total Comments**|583|**Previous Best DD**|\n**Account Age**|3 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Keep the change ya filthy animal", "score": 26, "replies": [{"body": "And a happy new year", "score": 8, "replies": []}]}, {"body": "Me who bought at 110 and exited at 190.. bliss", "score": 10, "replies": []}, {"body": "Lmfao", "score": 8, "replies": []}, {"body": "Looks like Elon just creampied the bears\n\n![img](emote|t5_2th52|4276)", "score": 6, "replies": []}, {"body": "BEAUTIFUL!!", "score": 7, "replies": []}, {"body": "“Harry! I’m comin’ up!”", "score": 4, "replies": []}, {"body": "You have to skate to where the puck is going to be", "score": 2, "replies": []}, {"body": "LOL What a Video LOL", "score": 2, "replies": []}, {"body": "Hahahah, You fucking assholes are awesome! Holy shitballs that scene is hilarious!", "score": 3, "replies": []}, {"body": "Never, there's a seemingly unlimited supply of idiots who keep buying no matter the price...", "score": 3, "replies": [{"body": "“Idiots” -I’m feeling like a pretty rich idiot rn", "score": 0, "replies": [{"body": "Only for as long as there’s a bigger idiot than you. That’s how inflated stocks work", "score": 1, "replies": []}]}]}, {"body": "I’d be happy to buy 180 puts 6 months out. May just do that soon. Once it hits 250", "score": 3, "replies": [{"body": "Looking forward to taking your money on the other side.", "score": 6, "replies": []}]}, {"body": "Nah tsla and Elon are trash but the media does love to pump it\n\nhttps://preview.redd.it/g2k346mkybia1.jpeg?width=716&format=pjpg&auto=webp&s=291519ee93bb8f0ca1de55708e91da1a0b1ce12e", "score": -11, "replies": []}, {"body": "u/savevideo", "score": 1, "replies": [{"body": "###[View link](https://rapidsave.com/info?url=/r/wallstreetbets/comments/112jxxu/never_bet_against_tesla/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/wallstreetbets/comments/112jxxu/never_bet_against_tesla/) &#32;|&#32; \n [^(reddit video downloader)](https://rapidsave.com) &#32;|&#32; [^(twitter video downloader)](https://twitsave.com)", "score": 1, "replies": []}]}, {"body": "Burry's puts printed.", "score": 1, "replies": []}, {"body": "But but isn't Tesla just a car company?", "score": 1, "replies": []}, {"body": "Never go against momentum.", "score": 1, "replies": []}, {"body": "funny because it is true.  I know, it happened to me...", "score": 1, "replies": []}, {"body": "Rejoice for those who bought at 350", "score": 1, "replies": []}, {"body": "u/savevideo", "score": 1, "replies": [{"body": "###[View link](https://rapidsave.com/info?url=/r/wallstreetbets/comments/112jxxu/never_bet_against_tesla/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/wallstreetbets/comments/112jxxu/never_bet_against_tesla/) &#32;|&#32; \n [^(reddit video downloader)](https://rapidsave.com) &#32;|&#32; [^(twitter video downloader)](https://twitsave.com)", "score": 1, "replies": []}]}]}
