{"title": "A little help for a fairly new investor?", "selftext": "[deleted]", "id": "1n5ivk", "created_utc": 1380165584.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 10, "comments": [{"body": "No way I'd invest in AMD. It's a company I root for but a horrible stock.\n\nThe first step in picking stocks correctly is not to buy stocks of companies you are cheering for but the one you'd bet your kidney on.\n\nI love tech and I started picking tech stocks based on how I felt about technology and innovation.  Huge mistake.   \n\nFirst you need to look at the sector. That is a huge portion of potential gains. Are chips where the smart money is or going to be?  Of the chips is AMD where the smart money is or going to be?\n\nAMD is a weak company in an industry that has seen its best growth days.", "score": 3, "replies": [{"body": "This is why I ask! Thanks a bunch. ", "score": 1, "replies": [{"body": "I'm new myself, but I think AMD still has potential for growth.\nFirst off they just released a brand new product line so that generates more interest towards them, but they have basically 100% market share of the next generation consoles chipset tech.", "score": 1, "replies": [{"body": "Playing Devils Advocate here:  So?\n\nHow big is that market? Is it expanding or contracting?  What is the future of video gaming? Is AMD going to command a larger share of a declining market?\n\nChip makers have cyclical runs. Where are we in the cycle?  Where is the smart money?  Who is shorting and how much?\n\nAdvanced Micro Devices Inc. (NYSE: AMD) saw short interest rise by 1.6% to 113.97 million shares, or 18.7% of the company’s total float.\n\nWhy does AMD have such high short interest relative to it's peers? What do the shorts (who have far more time and resources and industry knowledge)  know that we don't know?\n\nEven if they do have the console market wrapped up, how do you know that isn't already baked into the pricing?", "score": 1, "replies": [{"body": "So bottom line it's so much more then what is just on the surface. It's everything that is tied to the company and everything the company is tied to. ", "score": 1, "replies": [{"body": "Exactly.  Making it more complicated is the actual supply/demand of shares can move prices without regard to what happens with the company or it's products.\n\nBut every stock is either overvalued, fairly priced, or undervalued.\n\nOnce you see a company like AMD and you are excited about the products it's time to start step one and determine which category it's in.  Once there decide why that is the case and if there is reason to believe those circumstance will change.\n\nPicking stocks isn't just about being right, it's about being right at the right time.\n\nIf you decided that AAPLs fair value was 486.22 (todays close) and you shorted from $500-$700 you lost your shirt. \n\nThe time to make money is AMD was really when there was blood in the streets. Six months ago it could be had for $2.55 when you couldn't give it away.\n\nHaving worked in finance, I am convinced that the small investor can only be the big investors by playing the long game.  That is contrary to what the big investment houses are doing. They need to show quarterly and yearly gains.  \n\nYou can beat them, but you have to have the patience. Let their greed and impatience work for you. \n\nAlso, you are right to be interested in the console and AMD's position. The problem is you are 18 months too late.  Its like buying stock in TTWO because GTA was just released. Too late. It's baked into the price already.  Look at this chart of TTWO.\n\nhttp://finance.yahoo.com/echarts?s=TTWO+Interactive#symbol=ttwo;range=6m;compare=;indicator=volume;charttype=area;crosshair=on;ohlcvalues=0;logscale=off;source=undefined;\n\nYou can see when people started accumulating (and market run up)in anticipation. Then you can see where they dumped prior to release to capture those gains.  But if you did it too early (when it was announced in NOV of 2011) you paid more than you should have.\n\nIf you want an edge and your thing is tech you need to be looking at very early stuff before it hits major outlets. Then it's getting in early.  \"Buy the rumor, sell the news\" type stuff.  Or there can be money made when there are too many folks in too early.  Look at 3D printing. Pretty hefty valuations.  We could see a bubble burst.  Then again, I sold NFLX at $48 a share because I thought the run was over.\n\n\n\n\n", "score": 2, "replies": [{"body": "This is some of the best advice I have received to date. I like to think my schooling will give me some, even if only a little, help in the market (majoring in marketing). I suppose the thing I have trouble with is wrapping my head around timing. Buying before it's to late (breaking news) but not to early. Someone responded to this post with \"SGLB\" (Sigma labs).  I took a while to look into it and while the stock has had steady growth the past couple years it's nothing drastic. I would conclude that it's a bit iffy. To me it would seem like service industries are a little more unpredictable ( just what I would naturally deduce ). I could see getting in a couple hundred shares for cheap and getting out after a couple cent spike but I wouldn't feel comfortable putting any major dollar amounts into the company. Looking at the bigger picture sure they are a part of an ever expanding field and offer solutions in new technologies like 3d printing but who is to say that 3d printing will really become a common household event. Others have suggested ONVO (Organovo holdings). Another stock I see why people would invest in mostly because of pending deals they have with other companies to continue or stop using their product. I see potential in the product (artificial tissue growth that acts like regular tissue) in that it has a practical use that could save large companies billions on drug testing. Still research to be done there. Thanks again for the advice. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "SGLB", "score": 1, "replies": [{"body": "Sigma Labs?", "score": 1, "replies": [{"body": "Yes", "score": 2, "replies": []}]}]}]}
