{"title": "Why I'm buying SHOP(Shopify) ahead of earnings..", "selftext": "They have crushed earnings for the past five quarters and with the help of Amazon just throwing everything ecommerce their way, I don't see this SHOP train stopping.  They have no debt, which some people care a lot about, I don't that much.  I've heard from the ground as well as analysts enough to be a true believer in how big this company can get.  I'm cutting and pasting a Motley Fool Stock Advisor(that I pay for, but I owe you guys for NVDA 107%!!) write up below.  Do your own DD and would love to hear any feedback that anyone has..\n\nMotley Fool Stock Advisor...SHOP\n\nThose of you who have boxes of online purchases piling up on your doorsteps may be surprised to hear that e-commerce accounted for only 7.8% of total U.S. retail sales in the first quarter of 2016, according to the U.S. Census Bureau. But online sales growth is in the high teens year over year, even as the overall market increases. My team's recommendation this month, e-commerce platform provider Shopify  (NYSE: SHOP), allows merchants to capitalize on this trend by providing a one-stop shop for all aspects of a business's commerce operations — desktop, mobile, and social media storefronts, and even physical retail transactions — all for a low monthly fee. And it's been so successful that Amazon.com (NASDAQ: AMZN) bowed out of a similar line of business and instead formed a relationship with Shopify.\n\nFrom Snowboards to SaaS\n\nShopify was founded by snowboarder and programmer Tobias Lütke in 2004, when Lütke and a friend were trying to start an online business to sell high-end snowboards. But Lütke found that the available e-commerce software was useless, so he built his own. From that new software platform (with roots in an obscure Japanese programming language), Lütke created Shopify, which turned out to be a much better business than selling snowboards. He still owns more than 10% of common shares outstanding, aligning his interests with ours as shareholders.\n\nToday, Shopify provides the e-commerce backbone to 275,000 stores, fortified by more than 1,000 mostly third-party apps that let store managers customize the online experience they want their shoppers to have. It's an extremely flexible cloud-based platform, for which Shopify charges monthly subscription fees ranging from $9 to $299, plus a cut of the transactions. Shopify links social media to mobile and physical stores to provide a multichannel integrated solution.\n\nSmall businesses are Shopify's bread and butter, but the company also counts global brands like Google parent Alphabet  (NASDAQ: GOOG), Tesla Motors (NASDAQ: TSLA), and the L.A. Lakers among its clients through its Shopify Plus product (which runs up to $5,000 per month). Shopify CFO Norman Jones estimates the total addressable market to be even larger, at 46 million companies.\n\nShredding the Market\n\nThe adaptability of Shopify's software solutions has powered the company's explosive growth. Gross merchandise volume has increased from $1.6 billion (with 84,000 merchants) in 2013 to $3.8 billion (with 144,700 merchants) in 2014 to $7.7 billion (with 243,500 merchants) in 2015. If Shopify achieves the low end of management's full-year 2016 revenue guidance of $337 million, it will ring up a whopping 94% four-year CAGR.\n\nAlthough Shopify is generating a net loss, its $190 million in cash, no debt, and positive operating cash flow suggest that it's off to a great start. With a nearly 79% gross margin on its subscriptions revenue and about 25% gross margin (although highly variable) in Merchant Solutions — payments, shipping, and more — Shopify delivers positive operating cash flow with low capital needs. And we expect it to become more profitable as it grows. After all, the company will be able to spread its marketing and development costs across a larger group of customers. Rapid sales growth paired with margin improvement — a combo we love — has potential to catapult earnings and the stock price. \n\nRisks and When We'd Sell\n\nAnytime a new venture meets with success, competitors appear overnight. Shopify is no different, with BigCommerce, Woo, Wix, and others trying to elbow in on the fast-growing e-commerce market. But Shopify's products seem to win out, with rave reviews and consistent No. 1 ratings. The company's ability to attract merchants, keep its subscribers, and incrementally increase its relationships with its customers are key here, so if retention or Shopify's strong standing eroded, we might look elsewhere.\n\nThe market's valuation of Shopify bakes in high expectations for growth, and because the company is not yet profitable, this means investors need to be ready for a bumpy ride. With its leading position in a huge and growing industry, Shopify seems well able to continue meeting high expectations, but if any of its key metrics faltered, we'd consider emptying our carts.\n\nFinally, as with any software company that processes payments, potential security breaches pose a huge risk. If a software glitch or malicious attack disrupted business for Shopify's customers, they could leave the service or be hurt badly enough to be unable to stay in business. Shopify works hard to stay ahead of hackers and other security threats, but if the worst happens, we'd want to think carefully about whether to check out.\n\nThe Foolish Bottom Line\n\nShopify's business has been nearly doubling or more than doubling each year for the past few years, and with millions of merchants out there looking for better ways to manage their online business, the market opportunity is huge. With its founder-led culture, innovative and flexible product line, and market leadership, Shopify offers investors great potential bang for their buck. We recommend adding Shopify to your portfolio today.", "id": "4v222o", "created_utc": 1469728758.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 21, "comments": [{"body": "Nice call!!", "score": 2, "replies": []}, {"body": "wtf their net income has been negative since 2012 according to msn: http://www.msn.com/en-au/money/stockdetails/financials/fi-126.1.SHOP.NYS", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "LOL.  uuuuuuuuhhhhhhhh....Amazon??", "score": 3, "replies": [{"body": "Tesla???", "score": 2, "replies": [{"body": "Shopify is strictly online service based only. I use them myself. I have no idea how they aren't making money...\n\nAmazon makes small bank (with heaps of future investments) and tesla is a futuristic product based company. Their SP is understandable.", "score": 1, "replies": [{"body": "omg.  there are tons of companies out there that are not profitable and investors buy their stock based on the future growth of a company, is my point.  AMZN and TSLA are just two examples of hundreds that have flourished and SHOP has a same model where all revenues go into the company immediately.  They are investing in their future, infrastructure and research, if you care.\n\nBut we are all different investors, and if you don't buy companies that aren't profitable, yet, then I respect your investing decisions.", "score": 1, "replies": [{"body": "I said wtf in my first comment because i would have thought that SHOP was making decent profits every year. I was just amazed that they weren't, yet.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I bought last May at around 26...saw it drop all the way down to 18 early Feb and knew it was worth staying in.  I saw some article recently on Yahoo Finance that some analysts saw it going up around 40, which might not be that far away.", "score": 1, "replies": []}, {"body": "I sold at 40. I expected it to drop. Not because they'd do poor, but because the market is irrational. I'm kicking myself now. Will buy again if they drop below 40.\n\nFor what its worth, I sold them to buy NFI.", "score": 1, "replies": [{"body": "huh? It's hovering around $33 at the moment", "score": 1, "replies": [{"body": "Nyse", "score": 2, "replies": []}]}]}, {"body": "$SHOP Following through from breakout earlier this month. Could eventually lead to a test of ATH's above 40", "score": 1, "replies": []}, {"body": "Someone wise once said \"Always short stocks with elaborate write ups on Reddit.\" And usually intend to agree, but I like SHOP", "score": 1, "replies": []}, {"body": "It's crazy.  I think you can buy the Jan 30 calls for around $6.", "score": 1, "replies": []}, {"body": "Hey man nice call. Your post inspired me to take a look and I ended up picking up a few shares. ", "score": 1, "replies": []}, {"body": "Now when to sell? when it hits 40?", "score": 1, "replies": [{"body": "No.  You won't sell it, cos Google is going to buy it and drop another 25% in your portfolio.", "score": 1, "replies": [{"body": "What makes you think SHOP is in a position of a buyout? (Not saying in a rude way) Very curious. Why Google and not Amazon?\n\nI have purchased SHOP and am enjoying the earnings from the past couple of days.", "score": 1, "replies": []}, {"body": "So you are actually suggestion to pick up even more?", "score": 1, "replies": [{"body": "I did off it's support today.  I really don't see it going lower than $5.10, I'd be really, really surprised considering how undervalued it is.  After a bounce or two or three off support it will shoot back up.", "score": 1, "replies": []}]}]}]}, {"body": "Awesome write up!  Thank you man.", "score": 1, "replies": []}]}
{"title": "Earnings Plays for Thursday PM / Friday AM. Last one of the week! Results are getting better and better", "selftext": "[deleted]", "id": "4uzb8t", "created_utc": 1469687498.0, "score": 40, "upvote_ratio": 0.92, "num_comments": 17, "comments": [{"body": "Thanks u/JadenCallaway for putting these together. All these fuck bois need to be more appreciative. Keep up the good work!", "score": 17, "replies": [{"body": "Praise be to the most high faggot u/JadenCallaway", "score": 5, "replies": []}]}, {"body": "Results link sends me to the survey, might only be me tho", "score": 4, "replies": [{"body": "it's not just you... OP is dead drunk. Give him some time to fix.", "score": 3, "replies": []}]}, {"body": "To whom it may concern:\n\nWestern Digital has acquired Sandisk.  They'll hold out pretty well on computer storage.", "score": 4, "replies": []}, {"body": "Interesting to see bearish people on oil companies, oil was doing so good the past month or two until it took a shit.", "score": 2, "replies": [{"body": "Yeah... so this turn wont really have had time to hit their earnings, no? ", "score": 2, "replies": [{"body": "I don't think so. But who knows", "score": 1, "replies": [{"body": "I mean... just look at Shell", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "from previous reports it tends to move +/-$40-60", "score": 1, "replies": []}]}, {"body": "The 'Number of daily results' graph doesn't have it's axis's labelled. What is it even", "score": 1, "replies": []}, {"body": "Bullish on $SAVE got September calls for 50.00 and 57.50 planning on selling after beating earnings", "score": 1, "replies": []}, {"body": "In UPS with my fb gainz", "score": 1, "replies": []}, {"body": "Short MSTR", "score": 1, "replies": []}, {"body": "WDC might have a pretty good quarter. STX already pre announced positive results.", "score": 1, "replies": []}, {"body": "Bullish on Amazon => bullish on UPS", "score": 1, "replies": []}]}
{"title": "Nvidia to pay 30$ to 970 owners", "selftext": "", "id": "4v25up", "created_utc": 1469729945.0, "score": 10, "upvote_ratio": 0.76, "num_comments": 21, "comments": [{"body": "I bought one of those. Cool, I won't say no to free money to waste on stocks.", "score": 2, "replies": []}, {"body": "Doubt that many people would go through the trouble to claim that $30.", "score": 2, "replies": [{"body": "I have a 970m and I'm going to check if it's included. 30 dollars is enough for a 30 pack and some 40's :P\n", "score": 6, "replies": []}, {"body": "Probably still the most popular graphics card to date. Hopefully this doesn't shit on upcoming earnings release. \n\nhttp://wccftech.com/nvidia-geforce-gtx-970-steam-survey/", "score": 2, "replies": [{"body": "doubtful. It's not like they actually paid any of it out yet. ", "score": 1, "replies": [{"body": "True. Was thinking more so mindset of those in the long game. ", "score": 1, "replies": []}]}, {"body": "Doubt it will be even disclosed in Q2, as it was closed nearly a month ago.\n\nI don't think the settlement will have a material effect on the earnings and revenue.\n\nSeems like they haven't been accruing for this expense, so they will probably start in Q3 along with the disclosure.", "score": 1, "replies": [{"body": "I'd imagine they have a contingent liability based on IAS 37. A contingent liability doesn't need to be recognised in the financial statements however is should be disclosed.", "score": 1, "replies": []}]}]}, {"body": "My friend says that $30 is enough for 5 minute bj! I'll do the paperwork.", "score": 2, "replies": [{"body": "i got two tens and a five. can i get a 4 minute BJ and 30 seconds of your friends time so i can [introduce them to a promising investment opportunity in recycled catheters?](http://www.massdevice.com/stryker-recalls-select-reprocessed-angiodynamics-soft-vu-angio-caths/)", "score": 1, "replies": []}]}]}, {"body": "I jewed out and bought the 960 , god dammit leeroy", "score": 1, "replies": []}, {"body": "I thought it said Nvidia to pay 30$ to shareholders for a second and my hopes went up.\n\nGFY", "score": 1, "replies": []}, {"body": "Hell yeah. I have a 970.", "score": 1, "replies": []}, {"body": "stock will go up because of the ruling probably", "score": 0, "replies": [{"body": "Stock will go down because of the ruling probably.", "score": 0, "replies": [{"body": "Uncertainty being removed is always good for stock prices", "score": 1, "replies": [{"body": "Income being removed is always bad for stock prices.", "score": 0, "replies": [{"body": "You are just completely ignorant of how these things work out aren't you? Tell me, when bp was fined 23 billion do you think their stock price rose or fell?\n\n Also nvda is up 1.8 percent gfy", "score": 1, "replies": [{"body": "What the fuck are you smoking? From memory BP was trading around 60 before the oil spill in the gulf. It has not recovered since. Sure when the fine was announced the stock lifted a little. but can't compare a disaster like bp experienced o this event. Gfy harder.", "score": 0, "replies": [{"body": "Jesus fucking christ you brain dead piece of shit. Since when were we actually talking about the fucking disaster. We were talking about the fucking announcement of the settlement. When it was announced BP was going to pay 20 billion the stock *rose significantly*. How can you not parse this? GFY in the ass bitch. Also oh man these NVDA gains are giving me a boner. Sucks you missed out on it because you are such a fucking bitch.", "score": 0, "replies": [{"body": "I'll bet you think their p/e looks good too.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}
{"title": "YOU HAVE ONE HOUR TO GO LONG ON $AMZN", "selftext": "[deleted]", "id": "4v2g9y", "created_utc": 1469733365.0, "score": 17, "upvote_ratio": 0.8, "num_comments": 20, "comments": [{"body": "Crap! just what we needed.. Now AMZN is def gonna go down! Inverse WSB in effect.", "score": 11, "replies": [{"body": "Didn't you hear? Inverse WSB has been totally debunked by Inverse Inverse WSB. OP has a point. ", "score": 9, "replies": [{"body": "You've fucked us. WSB^-1^-1^-1\nit is", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "http://i.imgur.com/rxFI7wF.jpg     \nYour post has been automatically removed because of pedophilia. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}]}]}, {"body": "Why can't you just short and long at the same time?", "score": 1, "replies": [{"body": "You can with options. See Iron Condor / Strangle / Straddle spreads", "score": 1, "replies": [{"body": "I prefer the Golden Butterfly Strangle myself", "score": 1, "replies": []}]}]}]}]}, {"body": "Post pic or GFY", "score": 10, "replies": [{"body": "Nearly half a mil in AMZN requires proof", "score": 7, "replies": []}]}, {"body": "I'm not playing either way. If it goes down I'll buy some shares for my IRA. ", "score": 3, "replies": []}, {"body": "It's tanking", "score": 3, "replies": [{"body": "It went back up. ", "score": 1, "replies": []}]}, {"body": "It's up $12 now AH.\n\nEDIT: $15 now and going up.", "score": 3, "replies": [{"body": "So toss away stuff you don't need in the end  \n  \nBut keep what's important and know who's your friend", "score": 2, "replies": []}]}, {"body": "I'm going with an 800/805 bear call spread", "score": 2, "replies": []}, {"body": "YOLOing 3 shares. Gfy ", "score": 1, "replies": []}, {"body": "Short it\n\nEDIT: RIP me", "score": 1, "replies": []}, {"body": "Yeah I would just love to see your 500 shares which are doing alright now. ", "score": 1, "replies": []}]}
{"title": "If the few of you that somehow managed to save up more than 3 cents to your name are going to trade legit things like FB/AMZN/GOOG/etc. can you please research how they trade on earnings before posting or commenting?", "selftext": "[deleted]", "id": "4v2slq", "created_utc": 1469737615.0, "score": 27, "upvote_ratio": 0.78, "num_comments": 22, "comments": [{"body": "Because I have $$$\n\ngfy", "score": 38, "replies": [{"body": "Yeah, I know you only have 3 dollars", "score": 5, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "what in fuck's name am I reading. \n\"don't dick around on literal wallstreet bets\"?\n\nWhat the happened to WSB. Go fucking fuck yourself WSB is for losing money regardless of socioeconomic status*.", "score": 8, "replies": [{"body": "Ignore the literal dbag", "score": 3, "replies": []}]}, {"body": "/r/investing <- Click Here", "score": 2, "replies": []}]}]}, {"body": "Y is it droping if they beat estimates??\n\nFUKING RIGGED ALGOS", "score": 8, "replies": [{"body": "at least most people don't go full autist on here and talk about how they can use their own algos", "score": -1, "replies": [{"body": "I'm on an algo where it buys low sells lower and buys again high. ", "score": 19, "replies": []}]}]}, {"body": "Where's the DD? GFY", "score": 3, "replies": [{"body": "Every single AH and day after earnings in these stocks ever", "score": -3, "replies": [{"body": "would you rather this place be like r investing\n\n\"AMZN and GOOG Beat, Both are Scientifically and Mathematically Flat in After Hours\" (all information everyone already knows, stated blandly to try and sound factual\"\n\n\nGFY", "score": 9, "replies": [{"body": "If this were r/investing I would have phrased this post as \"FYI guys, when you trade things like GOOG/AMZN/FB they always trade wildly after hours and usually the day after earnings too so just settle in overnight and be ready to trade first thing if you're a big winner/loser or hold and risk the day trade\"\n\nThis is me trying to express to people to have some sense of what's going on in the things they're risking money on and chill before they all have aneurysms and it's just me left on this sub", "score": 0, "replies": [{"body": "> before they all have aneurysms and it's just me left on this sub\n\nmore yachts for you", "score": 2, "replies": []}]}]}]}]}, {"body": "Faggots this is why you buy straddles 3 weeks before earnings.", "score": 3, "replies": []}, {"body": "The odds of FB and AMZN trading sideways after a killing estimates is an outlier ", "score": 2, "replies": []}, {"body": "Shitty title\n\neven shittier post.\n\n... now GFY", "score": 4, "replies": []}, {"body": "uh, they both reacted just about how I'd imagine.", "score": 1, "replies": []}, {"body": "Unless you're playing options or a Robinhood fag, there's usually too much risk of potential profit loss if you hold next day (when everyone's usually profit taking). That's what I don't understand about this subreddit. Too many think they're YOLOing, but then when they can lock in profits, end up bagholding. What I do? Set a sell order A/H at a reasonable price. If it breaks above? oh well I made money. If I think it heads higher? Try to buy on a dip (almost always happens). \n\nNothing wrong with YOLOing, but ffs have an exit plan at-least. ", "score": 1, "replies": [{"body": "this, was in BIDU at 165, spiked to 171 and sat there.  looked at it like a pleb then said you know what? i should sell.  dropped to 164, got out with a loss", "score": 1, "replies": []}]}, {"body": "I agree, the new subscribers must have suffered a head wound.", "score": 1, "replies": []}, {"body": "learn how to write a tittle faggot, gfy now.", "score": 1, "replies": []}]}
{"title": "First Solar Earnings DD (FSLR)", "selftext": "The only solar company in the black has Earnings August 3rd AH at 4:30PM\n\nHere's what I have so far\n\n**Insiders**\nClose to 1,000,000 shares given in July 21 to high ranking officials. All apart of a Performance Plan that rewards Directors and officers for meeting corporate targets/goals\n\n**Historical Past Earnings**\nFSLR is the only solar company that is doing \"well\" financially wise. They have $1.8B on hand with a long term governmet loan of about $250M. They have also beat their last 5 out of their last 6 earnings\n\n**Market Reactions**\n(Quater, Met status, % pps change)\n\n* Q4 2014 Met +2.6%\n* Q1 2015 Missed -3.6%\n* Q2 2015 Met     +13%\n* Q3 2015 Met     +12%\n* Q4 2015 Met     +4%\n* Q1 2016 Met     -5%\n\nSomething to note about Q1 2016 and Q4 2015 is that the whole solar industry itself was down. As of today every solar company besides FSLR is in the red including Solar City. Ironically SUN bankruptcy rumors were highest a 3-4 days before FSLR's earnings. Every Solar stock dropped with FSLR being the least affected at 4.3%.  It also didnt help that they missed the top line by 13%.\n\n**Financials**\nCredits to /u/Stick_Stickly1\n\nhttps://gyazo.com/42e1e101f7952c59d30b69d694188ca9\n\"If I were to invest in a solar company, FSLR would be the one I would invest in.\nPositives\n It is one of the very few companies in the industry that has a positive net cash position, 3.6% of net sales goes into R&D which isn't too bad, growth isn't too aggressive or slow, the rest of the positives are included in the picture\nNegatives \nThere has been an earnings deficit within the past 10 years and it doesn't pay a dividend. Its also not trading near the grahams enterprising stock number but is trading under the book value.\"\n\n**Governments role**\nFSLR is 30% owned by the Waltons (walmart) who also has the government by the balls\nGovernment enforced tarrifs against china solar has made it lucrative for FSLR to operate with businesses getting essentially 30% off. But this is set to drop later next year so I assume FLSR has received an influx of orders for this year.\n\n**Red Flags**\nSome things to note\n\n* SUN has again created solar instability by filing for bankruptcy late april. Though this is hopeful.\nhttps://www.greenbiz.com/article/why-sunedisons-bankruptcy-wont-deflate-solar-boom\n\n* Their CEO is James Hughes, former President and CEO of Enron\n\n* The cost of solar modules have dropped. To compensate FSLR has worked hard to drop their operating costs but Im unsure if thats enough.\n\nThey also have a yieldco CAFD that pays a ~~13-15% dividend to those interested.~~ dividend growth is targeted at 13-15% \n\nPersonally Im $3k deep\n", "id": "4v34n7", "created_utc": 1469741717.0, "score": 17, "upvote_ratio": 0.85, "num_comments": 24, "comments": [{"body": "I understood some of those words. Fantastic DD. All. In. ", "score": 10, "replies": []}, {"body": "That is some good DD", "score": 9, "replies": []}, {"body": "> FSLR is 30% owned by the Waltons (walmart) \n\nNever knew this. Please post info like this , for each of your trades, if possible. \nLet us make this sub great again, and build a wall to stop the trolls. ", "score": 8, "replies": []}, {"body": "I see his Enron past as a Pro. ", "score": 15, "replies": [{"body": "So dank", "score": 3, "replies": [{"body": "Just make sure you're the smartest guy in the room.", "score": 3, "replies": []}]}]}, {"body": "Good stuff.  I sold around 65, waiting for re-entry.  Now you got me thinking about calls.  Plus holding bunch of TAN", "score": 2, "replies": [{"body": "Be careful with TAN... there are a ton of shit companies that get lumped into that fund.", "score": 2, "replies": [{"body": "Too late.  Already lost too much to sell. ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Is Scion still running? Thought they closed shop.", "score": 1, "replies": []}]}, {"body": "I bought 300 shares @ 49 two months ago. I'm convinced solar still has huge growth potential and as you said compared to FSLR all other solar companies are dumpster fires.", "score": 2, "replies": [{"body": "The biggest concern is that due to all the failed solar stocks FSLR is being held to a higher standard. Estimated revenue for Q1 was $862.7M. Actual was $848.5M this wasnt enough even with a beat EPS over 150%. Upcoming Q2 revenue estimate is $1.01B. Out of 20 earnings they've only done numbers like that 5 times. I'll say the odds are against us but im looking at a price of $57-$60 if they pull it off.", "score": 1, "replies": []}]}, {"body": "Ironically I bought shares of FSLR before you posted this, near its 52 week low, I believe it's a good entry point especially with earnings next week. Also bought some shares of Canadian solar to diverse my solar holdings haha. Great post", "score": 1, "replies": []}, {"body": "FYI their CEO is no longer James Hughes, it's now Mark Widmar (their old CFO). Also, I'm not sure where you're getting a 13-15% dividend from CAFD (https://www.google.com/finance?q=NASDAQ:CAFD)...\n", "score": 1, "replies": [{"body": "I'm sorry that's their target. Right now it's 5%?", "score": 2, "replies": [{"body": "From what I remember, their dividend growth is targeted at 13-15%, i.e. if they paid a dollar in dividends one year, next year they'd pay 1.15. That doesn't translate into a 13-15% total yield (I wish!).", "score": 1, "replies": [{"body": "Oh okay thaks", "score": 1, "replies": []}]}]}]}, {"body": "admire how hard you're plugging this. in for $1k as you know.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Lol if true. No one truly knows this is all a bet!", "score": 1, "replies": []}]}, {"body": "I'm invested in CAFD instead. Could someone convince me how/why FSLR is better? CAFD has a 5.6% dividend yield targetting sustainable dividend growth of 13-15% per year. They are a joint venture between Sunpower and First Solar, so you get a diversification of risk with the 2 industry leaders in solar. CAFD buys the projects Sunpower and First Solar create, profiting off those long term revenue streams. So i'm just curious what is the appeal in FSLR instead of immediately having a dividend rewarding you? I don't see FSLR growing it's stock price for than 6% for a while, it's just a difficult business model when do we really see the profit? \n\nWould love if someone could give an estimate of how many years it would take for FSLR to eclipse CAFD as an investment, because while you are waiting for it to grow you would be getting a div all the while. Solar is so difficult and I think CAFD is the better play as a result, the safest way to play solar IMO and get guaranteed value.\n\nPLUS: The dividends from CAFD are tax-free", "score": 1, "replies": [{"body": "I'm actually semi long CAFD. I'm just playing FSLR earnings.", "score": 1, "replies": []}, {"body": "Would it be feasible dividend scalp on this fund do you think?", "score": 1, "replies": []}]}, {"body": "8k deep. I held through earning during 2016 q1 expecting FSLR to beat earnings... still holding. ", "score": 1, "replies": []}, {"body": "I'm 1800 shares @$3.04/share into VSLR or else I might consider this.", "score": 1, "replies": []}]}
{"title": "UWTI yolo", "selftext": "Shit has dropped 20% this past week and 40% this past month. Oil shouldn't be able to drop much lower than it has this past week. I propose to look for an entry point tomorrow and hold over the weekend if you have big enough balls. Oil uptrend starts tmo and continues into next week. GFY's", "id": "4v3mhm", "created_utc": 1469748448.0, "score": 8, "upvote_ratio": 0.79, "num_comments": 24, "comments": [{"body": "Where is the guy who two weeks ago posted his 50k bet on UWTI", "score": 3, "replies": [{"body": "He cashed out for a 3% return believe it or not.", "score": 6, "replies": [{"body": "i've been throwing around 50k to make 5-10% lately.  3% is a juicy return and i would be content with that for a day of trading", "score": 1, "replies": []}]}, {"body": "I'm still in UWTI w my 50K bet. Holding this shit till it goes back up", "score": 2, "replies": [{"body": "What was your entry point? ", "score": 1, "replies": [{"body": "Avg $25.5", "score": 1, "replies": [{"body": "oh boy", "score": 2, "replies": []}]}]}]}]}, {"body": "u dont know shit, buy crc if you have any balls", "score": 4, "replies": []}, {"body": "ha, i thought that when we were at about 46 and that didn't work out well for me.", "score": 2, "replies": []}, {"body": "I'm with ya. UWTI under $20 today, thinking might be time to get in.", "score": 2, "replies": []}, {"body": "Rigs will be up. Oil to $39 by the end of next week. Schools start back up and gasoline demand goes down. Driving season is almost over.", "score": 2, "replies": [{"body": "Hop in Tuesday morning or Wednesday before the EIA report for the best return.", "score": 3, "replies": []}, {"body": "I am on this boat. Been holding dwti since Monday and oil broke below 41 tonight. It's going to 38 ", "score": 1, "replies": [{"body": "DWTI might be back in the upper 200's by October", "score": 1, "replies": []}]}]}, {"body": "Oil is going back down to its lows (~$25) as China comes online and Iran continues to ramp up production. Don't hold you breath. There's still huge over-supply in the market and its not going to change anytime soon. ", "score": 2, "replies": []}, {"body": "https://www.reddit.com/r/wallstreetbets/comments/4v37ub/dwti_into_the_weekend/", "score": 1, "replies": [{"body": "oil wont drop any further. My bet is that some oil producers can't keep producing at these price levels and have already stopped production. Oil rig count should decrease.", "score": 1, "replies": [{"body": "I think we're getting close, might be another week yet though before rig count starts dropping....\n\nI'm pretty much of the opinion that the current  market is going to be controled by frackers. Too much below 45 they start shutting down, 50 or above and they start cranking up wells...\n\n\nDisclaimer: barring any major geo political disruptions I.e. wars, Putin doing something crazier then normal, etc...", "score": 1, "replies": []}]}]}, {"body": "Bought 100 shares before close today... May be a longer term play if our entry point isn't right but believe production will curtail before too long. ", "score": 1, "replies": []}, {"body": "Don't be tarded. Wait for the inventory report and immediately buy the sentiment.", "score": 1, "replies": []}, {"body": "Oil is not going up anytime soon. You won't lose money on DWTI, I think it's on the way down to $35. Too bad it fell to 41 so fast, I have all my money in NVDA until earnings.", "score": 1, "replies": []}, {"body": "I've posted this before, but I guess I gotta do it again.  Let me show you what happened when I put 5K on UWTI last week...\n\nhttp://m.imgur.com/foA9b8D", "score": 1, "replies": [{"body": "<10% , could have been worse.", "score": 1, "replies": []}]}, {"body": "Down another 50 cents since yesterday close to $17.75. The two resistance points are $17.50 and $13. If it breaks through it could easily fall another 25%. ", "score": 1, "replies": []}]}
