{"title": "Fuck Hype: $MNKD Due Diligence and Analysis", "selftext": "[deleted]", "id": "4ao6y6", "created_utc": 1458140580.0, "score": 131, "upvote_ratio": 0.94, "num_comments": 127, "comments": [{"body": "Woah, an actual DD with logical explanations. I'm not sure I'm used to this, but nonetheless, good job and thanks for taking the time to write it out!", "score": 66, "replies": [{"body": "How the hell is this due diligence? Can you please explain what your definition of due diligence is? It is very different than mine.", "score": -9, "replies": [{"body": "Definition? Oh, I got it right here for you buddy.\n\nGo fuck yourself.\n\nIt's a pharma stock for Christ's sake, you expect a detailed review of financial ratios or discount future cash flow? Should we also hand-hold your dick when you pee as well?", "score": 24, "replies": []}, {"body": "1. reasonable steps taken by a person in order to satisfy a legal requirement, especially in buying or selling something.\n\n2. a comprehensive appraisal of a business undertaken by a prospective buyer, especially to establish its assets and liabilities and evaluate its commercial potential.\n\nThe problem is until mannkind actually has their product those numbers mean nothing. If you want me to follow up at that point, more than happy to brother.", "score": 7, "replies": []}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Fair and valid points. Senseless bashing is unwelcome, but you have my upvote.\n\nNothing is a sure thing in the market. Only further research will prove/disprove any potential risks of inhalable drugs.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "April-august are key to whether I hold. Either way I made money.", "score": 2, "replies": []}]}]}, {"body": "How do inhalers compare to injections in terms of price?  Based on his later post about possible B+M Gates funding, they could be eying this to be primarily distributed to people with limited money / access to doctors / sanitation / whatever else.", "score": 1, "replies": []}]}, {"body": "I was in MKND back when it was in the 3's and it's one of the few bio stocks I like. Your DD is on point. I would jump in if we got a pullback.", "score": 13, "replies": [{"body": "You should have jumped in at $1.20 yesterday at open, that would have been primo.", "score": 1, "replies": [{"body": "should have, could have, would have...\n\n", "score": 10, "replies": [{"body": "Yeah true, that's never a good way to think.\n\nWell if you think it's going to do what I think it's going to do in April, I think it's still a strong buy.", "score": 1, "replies": [{"body": "What are your conservative estimates in April?  And what is your red flag or green light as far as company plans go?  Thanks in advance OP, you've been incredibly insightful.", "score": 1, "replies": [{"body": "I see the stock climbing over $2/share when the transition begins on April 5. Green light is that they have a marketing plan, and a plan that I think is feasible and will work. Afrezza needs advertising, it needs TV spots. It's FDA approved, the hurdle is marketing. Potential catalysts could be the announcement of a settlement of Sanofi, which depending on the size could skyrocket the stock price, because it would increase cash and thus marketing power. That could come within the next two months.\n\nRed flag is if by April were not seeing major action in the way of marketing. If it's all rhetoric and conjecture at that point, I'll sell. I need to know that they will be as aggressive and relentless in marketing this drug as they need to be. No good news by the end of April, I'm out.", "score": 13, "replies": [{"body": "Again, OP, I appreciate your insight.", "score": 6, "replies": []}, {"body": "How's the rocket ship?", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Well, if their inhalable epinephrine product fares better than the insulin one, it could definitely take off. Apparently there was an order of like 38k $3 strike calls for November, so maybe someone knows something we don't.", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Thank you for posting, well, everything!", "score": 2, "replies": []}, {"body": "How are you feeling now?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "damn WSB, got me YOLOing on ARO and now MNKD.  in 2000 shares @ 1.50\n\nif it works out, thanks for the DD\n\nif not, thank you so very much for the DD and go fuck yourself", "score": 12, "replies": [{"body": "What he said. In with 4k shares. ", "score": 4, "replies": [{"body": "In with 1500 shares (my ass still hurts from tanking UBLO)", "score": 2, "replies": []}]}, {"body": "Also bought last night @ 1.50 :)", "score": 1, "replies": []}]}, {"body": "> inhabitable insulin", "score": 7, "replies": [{"body": "Lol, fixed.", "score": 1, "replies": []}]}, {"body": ">On April 5, Sanofi will hand back over 100% of the rights to Afrezza to MannKind.\n\n\nBetter hope the hype gets it to $2 before 3/31. ", "score": 5, "replies": [{"body": "On my last post \"end of the month\" more meant next 30 days, but it's all good dude this sub is moderated SO well so I understand if you would want to ban someone who contributes content and doesn't just post DWTI and shitty memes.\n\nAnd if it does hit $2, I get to jam my cock down your throat. Fair bet right?", "score": 14, "replies": [{"body": "Spoken like a true homo.  I'm guessing you're under 23 or so? Judging by how fucking delicate your are. Raised by a single mother, never played sports? ", "score": -7, "replies": [{"body": "Lmao shut your mouth pussy and leave the thread. If that was the best comeback you could post, you should literally bleed out in a bathtub.\n\nIt's pretty thick so if you pm me your address I can buy you some dialators to get ready for me. I hear putting salt on your tounge reduces the gag reflex, if you puke on me I'll beat the shit out of you.", "score": 14, "replies": [{"body": "Do you have your trouble ticket #?  I can get this routed for you ASAP. ", "score": -1, "replies": [{"body": "If I'm in trouble I just call mom it's ok", "score": 5, "replies": []}]}]}]}]}, {"body": "So do you expect it to go belly up on 4/5? Or do straight to the moon?", "score": 1, "replies": [{"body": "No clue- I know nothing about the stock itself. ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Yep, as he did with many other drugs. Afrezza was one of them. Afrezza has had big players working against it from the start.Why? It's a major threat from a small company. \n\n\nNow they've got it back, and they're pissed and ready to go.\n\n\nI hope I see some white lady toking on her afrezza in a garden on TV within the next few months, and that sexy mannkind logo at the bottom.", "score": 6, "replies": []}]}, {"body": "This isn't as simple as just grabbing an inhaler to solve all your insulin problems:\n\nFrom: http://www.nytimes.com/2016/01/06/business/sanofi-ends-marketing-deal-with-developer-of-inhaled-insulin.html?_r=0\n\n>But insurers have been reluctant to pay for Afrezza, which is more expensive than injectable insulins. There are also concerns over the safety of putting insulin into the lungs. The prescribing information for Afrezza calls for lung function to be tested before patients start on the drug and periodically thereafter.\n\nThe wholesale price is almost 2X as expensive as injectable insulin. You have to deal with coupon bullshit to bring the price down, and that only works temporarily.\n\nSo yeah, sounds great, but until insurance companies are willing to bring the price down, add additional lung screenings, and absorb the potential costs of lung problems later, this does face real hurdles.\n\nIf it can be shown that the inhaler increases adherence and thus reduces costly hypoglycemic events, and that ER/hospital avoidance benefit outweighs the costs of non-adherence, then that would be an argument worth making. But otherwise, why would an insurer cover Afrezza, when there is already an equivalent drug for half the price?", "score": 8, "replies": [{"body": "MannKind said in the conference call that they would be working on reducing the costs and working with insurers to get it covered.\n\n\nAs for the lung function test, it's a bullshit requirement to make sure you can inhale properly to absorb the drug. It's that little device they make you blow into when you have pneumonia and shit. Later trials should prove it unnecessary. It's safe, and they're also in the process if designing a long term safety study. Also a pediatric study.\n\n\nThe important thing to remember is it is FDA approved.\n\n\nI agree with your points. What you're saying is true. I wouldn't have posted this if I didn't think mannkind would be getting this covered by insurance.\n\n\nWhy cover it? It's an easier way to manage diabetes and you don't have to stick a needle in yourself. MannKind has to make doctors and patients demand it. This is 85% of the reason it didn't take off and MannKind knows it. They're not stupid.", "score": 3, "replies": [{"body": "Still too expensive. You think insurers give a shit about how painful your medication is?", "score": 3, "replies": [{"body": "There were plans to drop the price discussed on the conference call. Nothing definite.\n\nThey give a shit if it increases use and reduces hospital visits due to blood sugar episodes as well as other long term complications caused by non compliance.", "score": 2, "replies": []}, {"body": "here's the thing, it's as effective as a naturally functioning pancreas. it enters and leaves the blood stream just like insulin from a good pancreas does. so not only is compliance helped (inhalable vs injectables) but all the symptoms of diabetes are lessened due to the ease of uptake by your body. think long term health savings cost, when people AREN'T having their feet amputated, or visiting opthamologists, or neurologistics, or dermatologists or dealing with kidney failure. ", "score": 2, "replies": [{"body": "Insurers would need proof of compliance being so high compared to injectables that it offsets the hugely higher cost.", "score": 3, "replies": [{"body": "Let's hope they give it to them.", "score": 3, "replies": [{"body": "I can almost guarantee that they can't show that.", "score": 3, "replies": [{"body": "It would take a large scale study, but absolutely within the realm of possibility.", "score": 2, "replies": [{"body": "It's not going to happen. If it does, I hope you're ready to hold for the next two years minimum.", "score": 3, "replies": [{"body": "its not going to happen. Im a physician, this is not possible to show at least in a way that physicians will buy it. Still i believe not sticking yourself is a big sell and the absorption is an issue in novice users but doub that itself is a long term issue.", "score": 5, "replies": [{"body": "As a physician, with the data you have available to you, would you recommend this to your patients?", "score": 1, "replies": [{"body": "dont know enough yet, im also not that kind of physician. I think patient demand will be the big driver here", "score": 1, "replies": []}]}]}, {"body": "I am, pending the next 3 months.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Umm can you explain the dismal launch then? Only a couple million in revenue for this thing that was supposed to take in billions...", "score": 3, "replies": [{"body": "I thought I covered that.\n\nThey partnered with Sanofi to market, signed over the rights, and Sanofi intentionally sandbagged it.", "score": 0, "replies": [{"body": "> They've done it before\n\nNot really. Sanofi had a lot more to lose from not selling Afrezza properly since they dont exactly have an alternative. It doesnt make any sense, so why they would \"sandbag\" it", "score": 2, "replies": [{"body": "They did have an alternative. Two in fact. Afrezza would have competed directly with their insulin products.\n\n[You can read the full conspiracy theory here](http://www.afrezzajustbreathe.com/afrezza-was-sanofi-sandbagging-afrezza/)\n\nSanofi has done this to other companies. Sanofi has been sued for this. Other pharma giants have done this to emerging treatments, just bought them and shelved them because they were a threat. It's business.\n\n\nYou decide whether you want to believe the theory. I disclosed it was conjecture. I have no proof, just a motherload of circumstantial evidence, motive, and past behavior. It may be true, it may not be.\n\n\nI believe it is.", "score": 3, "replies": []}]}]}]}, {"body": "Type 1 Diabetic here (for 25 years this year) in medical school, have had a decently successful investing career (I mainly read this sub for the laughs, and sometimes I feel really bad for you)... you can check my post history, I started shorting MNKD as it spiked to $10 2 years ago. I closed my position a while ago too, though. Good times to be had for all.\n\nAfrezza is a piece of shit, and it will never work. Everything I've read about it, everything I've talked with physicians about it... it's never going to take off.\n\nIt's extremely prohibitively expensive compared to other insulins, everyone who already has T1D is fine with injecting after a while (or using insulin pumps), the amount that a Type 2 would have to take of Afrezza (the largest population of diabetics) makes it retarded to ever prescribe to them.\n\nI think barely any of the endos I know have even *remotely* considered prescribing a diabetic (recently diagnosed or long term), and I'm thinking there's a decent chance post-marketing research will show it increases the risk of lung disease and lung cancers. Boom, drug busts.\n\nI wouldn't go long MNKD even if you paid me to do it. If I could get the shares discounted by 50% and had to hold them for more than 5 years, I still probably wouldn't consider it.", "score": 3, "replies": [{"body": "You're one anecdotal negative in a sea of anecdotal positives, patients begging to keep afrezza on the market.\n\nNoted, but you personal experience means nothing to me.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Nah. What I will keep doing is making money. \n\nI have a few thousand shares at an average price of 1.19, and its 1.56 in ah and climbing. So I'm sorry if you had a bad week, but all my tickers are green, green, green as your envious face and they will stay that way.\n\nYou've made your point dude, don't buy and piss off. Idk what hanging around here hating in positive profits is doing for you. I hope your life gets better or whatever.\n\n", "score": 3, "replies": []}]}, {"body": "Have you ever been to an endocrinology conference regarding the medical management of diabetes, either as a patient, someone in the medical field, or both?\n\nI have. The reaction to Afrezza among the medical community is largely unfavourable. Insurance companies in the US aren't readily covering it, either.", "score": 1, "replies": []}]}]}, {"body": ">a rich Jew doctor\n\nDon't need more info, I'm in. ", "score": 5, "replies": []}, {"body": "LISTEN HERE FUCK BOYS: \nBoner faggot fuck is onto something... WHY u ask ? Because there is more to the DD.. From another perspective... \n\n\n1. - I am now a medical student who will be treating specially diabetics patients... and the biggest problem to treatment is COMPLIANCE ... .= It is easier to treat diabetes with an inhaler... than injection.... Patients with diabetes usually have other health conditions too.. Making them depression prove and feeling hopeless and eventually less likely to comply and more likely to just say \"screw it \" and not inject something into their body when this are bad... \nso = **compliance is a huge factor...**\n\n2.)   This is not meant to be a ... treat all diabetes drug.. Its meant for large meals... its meant to quickly control.. its meant for holidays.. its meant for at workplace..school... Imagine having the ability to **treat diabetes discretely** in a classroom, in a stadium.. or at the workplace... with laser glucose monitors on the way... THIS drug would be so much easier to u in front of ppl than A FUCKING NEEDLE ... and having to explain to ppl that u r diabetic... \n\n3.) http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.482.8148&rep=rep1&type=pdf  \n\n**Inhaled work just as well.. patients are more compliant.. and happier using it.. than injection..**\n\n4.) Sanofi did agree to market the drug... but they purposely did a bad job so their drug could get market share instead.... It is a well know tactic in pHarm to buy the competitors drugs under certain conditions and fuck it up... \n\n5.) \"Hypoglycemia in Afrezza-treated patients were significantly lower than rates reported in comparator groups receiving injectable insulin products.\"\n**Injectables .. overshoot the effect and would make patients hypo now... meaning low glucose in the body... BAD... Affrezza doesnot overshoot glucose controlling..**\n\n\"However, inhaled insulin was associated with less weight gain (net difference −1·1 kg, −2·1 to −1·6; three trials) and a smaller risk of severe hypoglycaemia (odds ratio 0·61, 95% CI 0·35–0·92; five trials). Incidence of mild transient cough was increased in people allocated to inhaled insulin (odds ratio 7·82, 6·14–10·15; seven trials) compared with those allocated to active comparator groups, as was the decrease in forced expiratory volume in 1 s (net difference −0·038 L, −0·049 to −0·026; five trials).\" \n\n6/) **LESS WEIGHT GAIN... U HERE THAT u FUCKS>>>  injectables make u fatter... vs inhaled that don't make u fat... obesity is  correlated with diabetes to begin with... DO U WANT TO TAKE A DRUG THAt COULD MAKE U FATTER ?.. no..**\n\n\n7). **It is more effective that other inhaled insulin drugs... HOW ?**\n\n\"\n**Technosphere** insulin is a dry-powder pulmonary insulin packaged in microparticles to which an absorption enhancer is added. The particles rapidly dissolve in the alveolar space to release insulin. The absorption of Technosphere insulin occurs faster and more efficiently than the other inhaled insulin products, with respect to time-to-peak insulin concentration (13 minutes), time-to- maximal effect (39 minutes), and bioavailability relative to subcutaneous (26%) and intravenous insulin (19%).28\"  \nhttp://njmonline.nl/getpdf.php?id=456\n\n8) Mankinds... **technospphere shit is not just for diabetes**... \nhttp://www.mannkindcorp.com/Collateral/Documents/English-US/TS%20licensing%20FAQ.pdf   it can be used for other problems too \"echnosphere technology is to be used as a vehicle to deliver regulated doses of a proprietary compound to treat a variety of medical conditions, including chronic pain, spasticity and inflammatory diseases such as rheumatoid arthritis.\" \n\n9). They already released their workflow projects/ development for the year... they want to work on aerosolized/inhale shit for hypertension... stop .. lung infections... ALL USING THER TECHNOSPEHERE INVENTIONS/ 200 patents .. \n\nhttp://www.mannkindcorp.com/Collateral/Documents/English-US/MNKD%20Investor%20Call%202%203%2016%20v9.pdf\n\n10). https://www.linkedin.com/in/michael-castagna-a15770 \n\nYes, he is a bad ass.. he sells.. he knows his shit and would not support it if he was gonna lose... he only goes into stuff he know he can win... he has and wants a successful track record.. \n\n11). **Martin Shkreli and Cheng Liang **were involved in hindering afreeza's initial release by 2 years.... NO one knows why... especially since FDA is not supposed to be listening to anyone else... when making decision... apparently .. couple emails from Shkreli.. made them postpone review.. and then hinder it more.. if after investigation ... they are found guilty of shit.... mankind.. could get a payout for hinder a potentially successful drug release to patients.. \nhttp://www.gurufocus.com/news/159641/mannkinds-afrezza-was-to-be-approved-what-happened-next-\n\n\nup vote if u think I'm gay ", "score": 5, "replies": []}, {"body": "I'm long 7.50 since last summer. I will get at least 5x my return someday. Just being a bagholder for now.", "score": 3, "replies": []}, {"body": "I love your bullshit why do I give this much of a shit response. You must be very good at job interviews. (I'm taking notes). \n\nAnyways, I rode MNKD from 5 ish to 10ish back mid 2014 for their fda approval. This was my first stock and I considered it holding until they were full fledged production and sales mode. But as their next step is actually the sales there's the question of how do they go about mass production of it and what are the side effects of inhaling this. I remember reading something that it harms the lungs in ways similar to cigarettes, I haven't done any research and not sure if they dismissed these claims or not. ", "score": 2, "replies": [{"body": "Do you think it would have current FDA approval and no warnings if that was the case?\n\nI assume it's possible, but it has no base. It's just conjecture that inhaling anything could be harmful.", "score": 2, "replies": [{"body": "Tru, which can be a problem considering there are people out there against vaccines", "score": 0, "replies": []}]}]}, {"body": "Are you pcx99?", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "It's been straight speculation until April 1 when they begin, you know, operating again.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "DTC advertising baby. I'm counting on it.", "score": 2, "replies": []}]}, {"body": "I bought MNKND about a week ago.  No regrATS!", "score": 2, "replies": []}, {"body": "RemindMe! March 31st, 2016", "score": 2, "replies": []}, {"body": "/u/xBonerDetective 126M assets with 477M debt. What am I missing here?", "score": 2, "replies": []}, {"body": "Fuck me, just bought another stock based on a completely random suggestion on WSB. Gold Plated Yacht or Bankruptcy, nothing in between!", "score": 5, "replies": [{"body": "People who do this make me sick ", "score": 2, "replies": []}, {"body": "Lol, I'd hope this qualifies as not completely random.", "score": 0, "replies": [{"body": "up almost 30% $458, my yacht or yours?\nhttp://i.imgur.com/JdptGXn.png\nedit - set 12% trailing stop.\n", "score": 1, "replies": []}]}]}, {"body": "I actually bought 10 Aug 1$ calls the last time you posted, up 60%.  Gracias.  If it dips a bit I'll buy more.", "score": 2, "replies": []}, {"body": "> 5. If you had diabetes, would you rather inject insulin, or use a product like Afrezza?\n\nYou're a fucking idiot if you keep touting this as one of the reasons why Afreeza will be successful. Inhaled insulin will never take off; it's had two chances already and a third one won't make a difference no matter how many marketing guys you throw at the problem. It's damaged goods. People would rather stick needles to their arms than inhale some shit compound that may or may not give them emphysema 20 years down the line. \n\nBut I guess YOLO and all that. Have fun losing your money.", "score": 3, "replies": [{"body": "Nice job not reading the post at all you failed abortion. You really think exubera was a competitor or comparable at all?\n\nAfrezza is the size of an inhaler.\n\nFor people with athsma, do you think if offered the chance to inject themselves when they had an episode or keep their inhaler. What would they pick?\n\nYou're a fucking moron and you can sit this one out.", "score": -1, "replies": [{"body": "A) not dissing your DD. This is better than idiots speculating on OPEC wrt $UWTI. \n\nB) I reached out to a friend who has type 1. She says she would not use an inhaler due to lung tissue damage issues.\n\n**Maybe** if MKND can get over the preconceived notion of inhaled insulin being bad for the lungs, it'll do well. \n\nThe lung issue seems like the biggest deal. People will pay more for drugs that improve quality of life.", "score": 3, "replies": [{"body": "> Maybe if MKND can get over the preconceived notion of inhaled insulin being bad for the lungs, it'll do well. \n\nIt's not a preconceived notion. You're inhaling one of the most anabolic hormones in the body, in a way it was never meant to be delivered.\n\nWe know what other hormones do to cancer rates (TRT, estrogen/OCPs) and those aren't anabolic in the same way insulin is... this is going to look real bad once post-marketing trials come out.", "score": 3, "replies": [{"body": "And how is injecting insulin any different vis a vis cancer risk. You're still introducing the hormone into your body, I don't fucking understand why you believe it to be carcinogenic when inhaled but benign when injected into the bloodstream.", "score": 0, "replies": [{"body": "Injectable insulin may have a modest increase in cancer incidence attributable to it, actually. There have been concerns regarding that and they've been monitored.\n\nThe mode of action of transmission is highly important.\n\nSubcutaneous injection means the insulin passes readily into the bloodstream and enters the bloodstream. W\n\nThe physiological means of insulin secretion in the periphery (the brain has it's own insulin centers) where the pancreas secretes insulin directly into the portal vein, it is taken up in the liver, and carries out it's actions.\n\nInsulin has localized effects in tissue. Subcutaenous insulin is known to induce lipohypertrophy, which is largely *cosmetic* in nature, but it can also induce localized insulin resistance in areas that repeatedly receive it. But the areas where it is injected commonly make use of the insulin regularly, too, just not to the same extent. Also because of the way the insulin is prepared and absorbed, the amount of local effect it has through injection is negligible.\n\nIn the lungs it's a very different story, and there are different mechanisms for absorption and distribution into the systemic circulation. Lungs absorbing insulin is different than skin absorbing insulin. Anyone with a decent understanding of the localized/systemic effects of insulin, and understanding of pharmacokinetics, volume of distribution, and all that other fun stuff (ie: endocrinology researchers, pharm researchers, and post-graduate level biochemists in the field) would be able to elicit the inherent differences in the absorption and distribution, and the potential for risk that this carries.\n\nThe lungs are used as a vector for transmission of several drug therapy regimens, but typically the response is desired *in the lungs* (acetylcysteine for CF, corticosteroids/beta-agonists for asthma/bronchospasm, nasal vaccines for IgA specific upregulation in lung tissue for immune function in certain very new vaccines). The response of insulin in the lungs would be an undesired/potentially adverse reaction to administration of insulin via these means.\n\n**TL;DR**: It *is* very different. You're very right in saying you don't understand why. If you had a graduate level pharm or biochem degree, and could better understand the mechanisms of action, maybe you would.", "score": 3, "replies": [{"body": "And if this is so obvious to anyone who has studied pharmacology, how does this drug have FDA approval?", "score": 1, "replies": [{"body": "Because it passed phase 3 trials which test for short term efficacy. [Post-marketing surveillance](https://en.wikipedia.org/wiki/Postmarketing_surveillance) is conducted to assess safety afterwards. This is typically when we start to discover a lot of the long term side effects and drugs are often taken off the market.\n\nWith Afrezza, very few large bodies (prescribing physicians, insurance companies) really want their patients to use Afrezza for a variety of reasons, this being one of the major hurdles (the other being the insane cost and non-superiority compared to current regimens), so it's unlikely to get prescribed by many physicians, covered by many insurance plans, and filled by many patients.\n\nWhat you have is the (current) low usage and low sales as has been witnessed since it came to the public.\n\nIf you're a type 2 diabetic (who doesn't have a history of asthma, allergies, nasal drip, COPD, are a never-smoker, don't have obstructive sleep apnea, aren't severely insulin resistant) requiring insulin therapy it's easier and *much* cheaper to inject yourself twice a day and take a few pills.\n\nIf you're a type 1 diabetic you started on a regimen of multiple daily injections. If you have coverage and/or are well off, you'll be on a pump which is *more* convenient, offers tighter and more predictable control, is covered by some drug companies, and all around better than having to take puffs of insulin before food.\n\nThe drug got approved because it's a novel model, it hasn't taken off in any shape or form because of the massive barriers to stuff. In a few years some of the long acting insulins are going generic (like Lantus/Levemir), and those will become covered in the US under medicare/medicaid, and when that happens Afrezza will likely get squeezed out even more.\n\nThings do not look good for this company and there's a reason it dropped in valuation so largely over the past ten years.", "score": 2, "replies": []}]}]}]}]}, {"body": "Absolutely. But how many diabetics have lung tissue damage? They would not be good candidates.\n\n\nHow many women smoke? They are not good candidates for birth control. \n\nI never said 100% of the population, but look up user reviews for afrezza.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Nothing is guaranteed. It's the market. This is my best educated analysis and prediction. If you don't like it or believe in it, don't buy. \n\nI think it can remove a lot of the stigma behind diabetes as well as other diseases. It's a novel delivery system. That's what I'm gambling on.\n\nI believe in it.", "score": 1, "replies": []}, {"body": "Look up user reviews of afrezza.", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "If it was such trash there wouldnt be entire websites created by patients dedicated to keeping it on the market.\n\nDon't buy, and don't worry about it. But add it to your watchlist so you can see how much money I make every single day you sat out.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Do you live in the US?\n\nI'm sorry but perhaps you live in another country where drugs aren't direct marketed to consumers.\n\nThat would be the only understandable reason for the complete fucking shit you keep posting.\n\nAnd secondly, I do think doctors will prescribe it. MannKind needs to and will market to physicians as well as DTC advertising. It's a two pronged spear.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Respect the DD but you gotta be careful with stocks on the [Threshold list] (http://www.nasdaqtrader.com/trader.aspx?id=RegSHOThreshold). It could be going up just cause shorts are having trouble getting shares to cover. \n\n\n", "score": 2, "replies": [{"body": "Great point, but this isn't a short term bet for me. I'm looking for what it does between April and August.\n\nBut yeah, we may see it drop prior to that, absolutely. And for other longs, maybe a great time to get in.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I understand that. I'll clarify.\n\nI am long MNKD pending the marketing strategy and direction the company takes between April and August, because very few exact details have been provided, just general goals. I have to see the plan. If I don't like it, I'll bail. If I do, I'll stay.", "score": 3, "replies": []}]}]}]}, {"body": "Bought 1500 shares of this at $1.05 after it gapped down a couple months ago. Good DD, thanks.\n\n", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Agreed.\n\nThe thing is THEY HAVENT BEEN SELLING. Sanofi has. That's the entire fucking point.\n\n\nWe'll see the sales strategy come April when, you know, they actually have rights to their own drug?\n\n\nI'm sorry you lost money but I feel like you went in blind and don't understand the dynamic at play.", "score": 2, "replies": []}]}, {"body": "Good shit post! Have a lovely fucking day!", "score": 2, "replies": [{"body": "I literally hope your first born child gets leukemia when he is 3.", "score": 3, "replies": []}]}, {"body": "So they have to go through a bunch of clinical trials to re-develop a non working drug? I'll pass. If you wanna wait 3 years on the 'possibility' of a successful redevelopment, go ahead. ", "score": 2, "replies": [{"body": "Where did you get that idea? There's no re development. It's FDA approved and ready to hit the market. It's on the market now...", "score": 1, "replies": []}]}, {"body": "It seems like there are mixed reactions with what MannKind is going to do. Some think that with gaining a new COO and having the rights to everything come April that they will have the ability to launch a new commercial campaign and can gain back some of the money they lost over the years from Sanofi. On the other side people are stating they will claim bankruptcy because they are only down to their last $50mil or so which will last till June/July. It seems like they are really banking on a big marketing campaign to save ship or this could be the last we see of them.\n\nEither way, great write up. I bought 200 shares as my first WSB purchase. Finally started my faggot residency with you nerds.", "score": 1, "replies": [{"body": "It's possible Sanofi could pay a handsome settlement to MannKind. That's my belief.", "score": 1, "replies": []}]}, {"body": "My robinhood account has some money left in it. Putting the rest of my money in this.", "score": 1, "replies": []}, {"body": "Damn... So I was actually planning on getting in at the 1.50 price but got bottle necked moving some money around. Now it's at 1.80... Still think it's worth it? Feel like I'd be buying at a high.", "score": 1, "replies": [{"body": "well it's at 2.11 as we speak....", "score": 1, "replies": [{"body": "Yeah, I bought in at 2 and am kicking myself over not getting in at 1.8", "score": 1, "replies": [{"body": "Hey still good so far, that means you're at a 8 percent increase just like that! ", "score": 1, "replies": []}]}]}]}, {"body": "Sanofi is going through a managerial transition itself, I would argue they are focusing on specific drugs. I'm concerned why they didn't market something with no competition and serious blockbuster potential, but whatever. That's an important point for you to know ", "score": 1, "replies": []}, {"body": "Hmmmm....\nhttp://seekingalpha.com/article/3966124-mannkind-bankruptcy", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "My erection", "score": 7, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "I've had this work and not work. The theta decay can eat up that strategy.  Not criticizing.  I may do the same but go out a bit further than April.  The decay really heats up the last 45 days. \n\n", "score": 0, "replies": []}]}]}]}, {"body": "Fantastic writeup. I'll definitely do some personal research on this one. Thanks for taking the time for us.", "score": 1, "replies": []}, {"body": "Great company DD, but investors need to buy and sell based on FS, which is emphasized by what you're showing. \n\nWhats their forward PE, Ebit margin? EBITDA multiple? What does MNKD say in their forward guidance in terms of profitability and revenue? If they don't have any earnings yet what's their PS? What about P/FCF? What is their FCF? \n\nIf you're planning on investing 2 quarters out, the fundamentals play a great role, because it more likely the fundamentals will show that far out; VRX is a perfect recent example of this.\n\nStill though you showed great economic moats for this company. You got me convinced to look this company up next time im at a Bloomberg Terminal.", "score": 1, "replies": [{"body": "I don't know nothin bout your fancy Bloomberg terminal, city boy. I've got good old fashioned gumption. You get back to me with that though.", "score": 3, "replies": [{"body": "Got fucked up insteqd, will check n3xt time", "score": 2, "replies": [{"body": "Drunk dial your doctor and ask them if Afrezza is right for you", "score": 3, "replies": []}]}]}]}, {"body": "OP I like your balls, I'm in", "score": 1, "replies": []}, {"body": "thank you breh", "score": 1, "replies": []}, {"body": "Cheers OP for this post. Bought some MNKD @ 1.50 and today we are trading up %13 I am going to buy some more later on", "score": 1, "replies": [{"body": "Same same. Bought in half blind from OP's DD", "score": 2, "replies": []}]}, {"body": "Pretty good DD but it's lacking in going into detail about MNKD's pipeline. I'd like to see much more information regarding Afrezza. ", "score": 0, "replies": [{"body": "Me too. I hope we get that information come April. They still don't have the drug under their control.", "score": 2, "replies": [{"body": "Fair enough. ", "score": 1, "replies": []}]}]}, {"body": "Thanks for the DD\n\nBy long on MNKD what do you mean? Long as in 1-2 years? 5+?\n\nI was thinking about picking up some call options 1 year out", "score": 0, "replies": [{"body": "Depends on what happens between April and August. I can't say right now.", "score": 1, "replies": []}]}, {"body": "Honest question, how does this kind of stuff come across your radar? Do you have certain sources that you use? I've always been impressed by people that do their due diligence rather than YOLO MOTHERFUCKERS! I suppose you have to be familiar with the industry, just like I'm very familiar with the tech industry. What are your sources, and how do you research? Is there a place where you come across good trades like this? Also, go fuck yourself.", "score": 0, "replies": [{"body": "SeekingAlpha articles. There's dozens of garbage that I come across before I find a stock that I actually personally believe in.", "score": 1, "replies": []}]}]}
