{"title": "Boeing plans safety ‘stand down’ as United reconsiders 737 MAX orders", "selftext": "By Lauren Rosenblatt \nSeattle Times staff reporter\n\nOn the same day United Airlines said it would consider alternatives to Boeing for its next airplane order, the manufacturer announced a one-day work pause at its Renton factory for employees to learn and focus on quality assurance. \n\nBoeing 737 MAX workers from the production, delivery and support teams in Renton will spend Thursday participating in working sessions, the company said on Tuesday. It is the first of many “Quality Stand Down” days Boeing will host over the next few weeks at its factories. \n\nEmployees will participate in “hands-on learning, reflection and collaboration,” Boeing wrote in a note sent to all commercial airplanes employees and posted on its website. The goal is to identify quality and compliance improvements and create actionable plans, according to the note.\n\nStan Deal, Boeing Commercial Airplanes chief executive officer, said in a statement the sessions will allow “all teammates who touch the airplane to pause, evaluate what we’re doing, how we’re doing it and make recommendations for improvement.” \n\nThe pause is part of a list of immediate actions Boeing plans to take following the Alaska Airlines Flight 1282 safety incident earlier this month when a panel blew off an 737 MAX 9 fuselage midflight. That panel was a door plug filling a space that some airlines use as an emergency exit. \n\nThe flight landed safely in Portland but the incident has heightened scrutiny of Boeing and Spirit AeroSystems, Boeing’s supplier that builds MAX fuselages.\n\nThe Federal Aviation Administration grounded the 737 MAX 9 planes that fill the open space with a door plug shortly after the incident. Those planes, flown by Alaska Airlines and United in the U.S., will remain grounded until they are inspected, following instructions from Boeing and the FAA.\n\nOn Sunday, the FAA recommended airlines also inspect another, older Boeing model — the 737-900ER — that has the same door plug design. \n\nSince the fuselage blowout, Boeing has said it will implement additional inspections as its planes are built, work alongside teams at Spirit to ensure door plugs are properly installed and open its factories to additional oversight. It also hired Admiral Kirkland Donald to lead a third-party review of Boeing’s quality management system. \n\n“We have taken important steps in recent years to strengthen our Quality Management System’s foundation and its layers of protection. But the AS1282 accident and recent customer findings make clear that we are not where we need to be,” Deal wrote in a message to employees last week. \n\nAlaska and United Airlines both found loose hardware related to the door plug as they began inspecting other planes in their fleets.\n\nOn Tuesday morning, United CEO Scott Kirby indicated the airline would consider options other than Boeing for its next airplane order. \n\nIn an interview with CNBC, Kirby said the airline was about five years behind its original order for Boeing’s MAX 10 plane. After the MAX 9 incident, United has begun crafting a new plan that doesn’t include Boeing’s MAX 10, he said.\n\n“I’m disappointed that the manufacturing challenges do keep happening at Boeing. This isn’t new,” Kirby said. “I think the MAX grounding is probably the straw that broke the camel’s back.”\n\nThe MAX 10, the largest of the four-model MAX line, and the MAX 7 have yet to receive FAA approval to carry passengers.\n\nAlaska Airlines CEO Ben Minicucci said in an NBC interview Tuesday afternoon he was “more than frustrated. … My demand on Boeing is, what are they going to do to improve their quality programs in-house?” \n\nMeanwhile, the union representing machinists and aerospace workers at Boeing said Tuesday it had delayed contract negotiations amid the fuselage blowout inspection. Both International Association of Machinists District 751 and Boeing are named as independent parties in the National Transportation Safety Board’s investigation into the incident. \n\nContract negotiations were supposed to begin in early February but are now delayed until early March.", "id": "19e8gap", "created_utc": 1706070030.0, "score": 207, "upvote_ratio": 0.95, "num_comments": 86, "comments": [{"body": "This will be a very good year for Airbus again.", "score": 107, "replies": [{"body": "Arent they already at sales capacity with a half decade wait list?", "score": 13, "replies": [{"body": "Doesn‘t mean they can‘t extent that wait list. I mean the chances of Boing getting their act together soon and winning back customer trust aren‘t too high anyway", "score": 15, "replies": []}]}, {"body": "Shame they can’t sell A330neos or A350-1000/F", "score": 2, "replies": []}]}, {"body": "It is management’s responsibility to set a high quality standard and ensure that it is met or exceeded, with no exceptions. To blame line employees is a huge red flag and prima fascia evidence that management is failing and is the root cause of poor quality. \n\nDownvote away.", "score": 366, "replies": [{"body": "No you're right.   Company culture comes from the top.  If the culture is safety, it's got to be management that makes that the case.", "score": 101, "replies": [{"body": "boeing *was* run by engineers in management. Now...professional executives.", "score": 2, "replies": []}]}, {"body": "> with no exceptions\n\nlol, and [Boeing is actively lobbying the FAA to receive safety exemptions for specific defects that currently exist in the MAX 7 and MAX 10 until 2026 so that the planes can be certified and start flying.](https://www.seattletimes.com/business/boeing-aerospace/boeing-wants-faa-to-exempt-max-7-from-safety-rules-to-get-it-in-the-air/)", "score": 83, "replies": [{"body": "Nothing says comfortable flight like 'be careful to not use your de-icing system too much so the inlet doesn't overheat and explode the engine!'  and it isn't like the 787 in a completely different plant hasn't also had known quality control issues.  This is definitely corporate culture at the top.  \n\nI have a flight next Thursday which United is still listing as a Max 9.  Wondering what I'll be actually flying on at this point.", "score": 3, "replies": []}]}, {"body": "I work in manufacturing and shit like safety and quality are hard to “mandate” the same ways as “make more shit” it’s easy to yell at people and notice output is down. \n\nObligatory duck Boeing I am in no way taking their side. But shutting down production like this is a huge deal internally and making the entire team talk about quality/safety in a quiet factory which normally is a mortal sin is how you try to show your team that leadership is prioritizing safety or quality. \n\nThat alone isn’t enough but yeah any time my plant has an accident we shut everything down group everyone up and talk about it. In no way are we blaming the workers by doing this.\n\nAgain quality is a little different than aftual osha safety and these events show probably every QA exec needs fired and their program completely rebuilt. I’m in food so I don’t really know what that would look like however.", "score": 22, "replies": [{"body": "> I work in manufacturing and shit like safety and quality are hard to “mandate” the same ways as “make more shit” it’s easy to yell at people and notice output is down. \n\nI've come to realize the same. You cannot mandate anything unless you have good management that can motivate the workers enough to do that themselves and good workers that can be motivated in the first place (assuming they are treated well). Mandates are just short-term band-aids.\n\nToday's case in point: https://www.espn.com/nba/story/_/id/39371240/sources-bucks-firing-first-year-head-coach-adrian-griffin. You fire the coach of the second team in your conference, wtf?! I'd almost bet my right pinky that some player did not want him there anymore. Those players have everything and nothing to lose by pushing their agenda. There's absolutely no manager in this world that can manage such people. No mandate would work.", "score": 8, "replies": [{"body": "meh I watched the manufacturing leader I respect most in my organization fire his production manager when he had just gotten the \"plant of the year\" award. \n\nGood top level leadership identifies opportunities even when things look \"great\"\n\nAgree on the motivation and leadership tho. My company has very little safety \"rules\" in place but we have a world class OSHA incident rate. I'm a right brained engineering guy and I've come to learn safety is theatrical. The floor will believe in prioritizing safety if they BELIEVE I care about it more than anything else. So doing things like shutting down production to discuss safety is the clearest way to do that. Also challenging team members to call out people above them for any safety infraction in a positive way helps build that culture as well.", "score": 5, "replies": []}]}, {"body": "Doing this isn't necessarily blaming employees but announcing it publicly in response to their issues kind of is.", "score": 3, "replies": [{"body": "How can you possibly figure that. That’s completely not true", "score": 7, "replies": [{"body": "Why publish an internal memo about retraining your workers publicly if not to signal to the public that the workers need retraining?", "score": 0, "replies": []}]}, {"body": "Yeah I would disagree with that. With internal OSHA safety that really just impacts the internal team and the company itself. \n\nQuality is very public facing so communicating it publically is a way for Boeing to communicate both internally and externally that they are \"committed\" to quality. Its performative which I honestly agree is an important component of responding to issues, but whether they actually take a deep dive on their processes or just make employees sign a bunch of training docs we will see.", "score": 2, "replies": [{"body": "Fair enough. I'm highly skeptical of Boeing executives/PR but this isn't the only thing they're doing, maybe they're well-intentioned.", "score": 1, "replies": [{"body": "Yeah I am skeptical as well. All I’m saying is that “stand downs” for quality and safety are a good thing. There’s a whole lot more that goes into changing a culture, process, or department behind just that (important) performative piece that I have zero faith Boeing is doing.", "score": 2, "replies": []}]}]}]}]}, {"body": "Spot on.", "score": 8, "replies": []}, {"body": "For sure management is part of the problem.  But there is zero chance that line workers (many unionized) and supervisors in a monopoly industry aren’t also part of the problem.  \n\nAt this point, Boeing needs to be broken up.  A lack of competition has bred this sick, complacent, and ultimately incompetent company.", "score": 26, "replies": []}, {"body": "Well, also independent regulation and oversight.", "score": 5, "replies": []}, {"body": "Boeing is what happens when you take an engineering company and replace all the engineers with MBAs, the employees turning the screwdrivers are not the problem", "score": 7, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Boeing was doing pretty allright before McDonnell Douglas' bean counters took over... and they weren't making incredibly boneheaded decisions like what they did to Bombardier which ended up backfiring spectacularly", "score": 4, "replies": []}, {"body": "Yes, but it is easier to find engineers that can manage than mbas that can manage when you are in a technical industry. MBAs are MBAs for one reason, because they are too dumb to do any of the real work. Just like people in sales and marketing. Of course there are some exceptions.", "score": 1, "replies": []}]}]}, {"body": "You are correct. I work in pharmaceutical manufacturing, making viral vectors for gene therapies.  Quality and compliance start with a policy created by executives, which is turned into procedures that are continually improved with executive oversight and operator input.  It never stops.  It’s taken very seriously because we’re making products that are used by very ill people.", "score": 2, "replies": []}, {"body": "They’re like an alcoholic blaming his fingers for grabbing the bottle", "score": 1, "replies": []}]}, {"body": "Obviously they were behind on delivering orders so they made crews work faster now planes are half assed. The door plug thing is probably good for boeing because people will forget that Boeing software killed 400 people. Was that in 2020?", "score": 73, "replies": [{"body": "Yup, they had to unleash Covid to make people forget.", "score": 3, "replies": []}]}, {"body": "Oh one whole day! This is supposed to inspire confidence?", "score": 21, "replies": [{"body": "They're claiming it won't be a one day thing, but point taken.", "score": 3, "replies": [{"body": "If they attach any amount of days to the word safety, they’re fucking idiots", "score": 0, "replies": [{"body": "They're just vaguely saying it will be an ongoing thing, part of the culture, blah blah blah.", "score": 2, "replies": [{"body": "The fact that BOEING has to say these things is so alarming", "score": 1, "replies": []}]}]}]}, {"body": "Yeah how about what processes are you going to put in place to actually fix the problem Boeing?", "score": 2, "replies": []}]}, {"body": "Rearranging the deck chairs on the Titanic is just going to cut it.\nNo concrete changes from Boeing so far.", "score": 13, "replies": []}, {"body": "The BOD needs to clean out the c-suite at Boeing. The safety culture is not going to change without changes in management.", "score": 15, "replies": [{"body": "BOD's hands are not clean.", "score": 8, "replies": []}]}, {"body": "People think deregulation is a good thing. Less government ‘interference’. But Boeing quality oversight has plummeted with deregulation. And we all fly on those planes. Regulation and safety go hand in hand. When a company ‘regulates itself’ there is no regulation. And safety checks take a back seat to profits. \n\nWhen I was a hiring manager in Seattle we would never hire anyone who had worked at Boeing. They were never the strongest candidate, with up-to-date skills. It was like they were institutionalized by the culture. In my opinion, the culture at Boeing isn’t one that encourages employees to raise their hands to build a better mousetrap or improve the product. Without a ‘see something say something’ culture, without fear of retribution, bad things can happen. And without oversight by outside, FAA government inspectors the risks are too high. People can be killed or injured. \n\nBoeing is just one example of how deregulation has hurt Americans. Dig in to how our food is (not) inspected these days because ‘the industry ‘regulates itself’. There are examples of it everywhere. This Boeing deal is no surprise.", "score": 38, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "Like most industries, government inspectors were replaced by ‘self inspectors’ and ‘voluntary reporting’ of issues. They are supposed to do it themselves. But we all know that self regulation means no regulation. Yes, in my opinion the MDD merger was a quality disaster. So was their breaking of the unions that protected whistleblowers and employees raising quality issues. Hence these one day weird team buildings they seem to be doing as a PR stunt. How can you fix your issues with one day rah rahs when they are deeper and more systemic than that.", "score": 7, "replies": []}]}, {"body": "The airline passenger industry was deregulated. The air craft manufactures supply that industry. You seem to be confusing the issue and terminology.   \n  \nThe manufacturing side did go through consolidation with Boeing snapping up McDonnell Douglas eventually but this is mostly a product of competition and Boeing having the better product. When Airbus came online it pretty much was the end of McDonnell Douglas for passenger planes.  \n\nBoeing is in a very heavily regulated industry and it is not an industry where regulation is failing but where Boeing is failing as their process has broken down. Given this door it means Seattle is the problem and not Spirit. Spirit has all its own problems but in all the videos I have seen this door is removed and installed again at the main Boeing plant.    \n  \nAnyway, deregulation of the airline industry, the people who fly us everywhere, has been one of the biggest boon to world travel ever.  Traveling is and transport is so cheap right now that nearly anyone who wants to go somewhere can.", "score": 7, "replies": [{"body": ">Boeing is in a very heavily regulated industry\n\nBut who actually enforces the regulations? That's right, Boeing itself. Boeing gets to \"self certify\" that it meets the requisite regulations. In other words, they effectively regulate themselves. \n\nThe self-certification process is less than two decades old. There used to be government employees which conducted the certification at every step, but no longer. So yes, deregulation is to blame.", "score": 10, "replies": [{"body": "The whole self-regulation thing is incredibly stupid and invalidates the whole point of regulations. The FAA have basically been gamling that Boeing will prioritise safety over profits, which has cost 346 lives. Not exactly \"heavily regulated\" when you can just check the boxes yourself", "score": 7, "replies": [{"body": "Exactly. It's a perfect example of why regulation is necessary. I'm sick and tired of people pretending that we don't need regulation, that the market will fix everything, etc. These people live in a fantasy land. Corporations do not value human life or the environment, and they will literally kill people if it helps their bottom line. Counting on them to do the right thing is like creating an authoritarian dictatorship and trusting the dictator to be a good man. It's pure foolishness. \n\nDeregulation kills, and it has no benefit. What great social benefit has been served by letting Boeing self-certify it's own parts and systems rather than having FAA employees and contractors do it? We saved a few pennies in tax dollars? Boeing's stock price went up for a few years, until the company needed billions of dollars in bailouts?", "score": 1, "replies": []}]}]}]}, {"body": "Deregulation still needs to be accompanied by a good legal system. United and Alaska airlines need to slap Boeing with a massive lawsuit, but my suspicion is that the US government will bend the laws/regulations to protect Boeing.", "score": 0, "replies": []}]}, {"body": "Bloomberg had a good podcast on this. \n\n[Odd Lots] The Moment That Boeing's Culture Started To Rot #oddLots \nhttps://podcastaddict.com/odd-lots/episode/170000697 via @PodcastAddict", "score": 4, "replies": []}, {"body": "Serious question: Is Boeing going to be nationalized (or semi-nationalized)?", "score": 7, "replies": [{"body": "With the move to DC, and the large amount of government contract revenue, it pretty much is.", "score": 17, "replies": [{"body": "That's called regulatory capture. Pretty much the opposite of nationalization.", "score": 1, "replies": []}]}, {"body": "Unfortunately not. It should be though, given how much taxpayer money has gone into bailing it out and how horribly the management has destroyed the company.", "score": 6, "replies": []}, {"body": "Subsidized", "score": 5, "replies": []}, {"body": "No, it's not.", "score": 4, "replies": []}, {"body": "America doesn't nationalize.", "score": 2, "replies": []}]}, {"body": "So Calls expiring in June? Or is that priced in", "score": 2, "replies": []}, {"body": "> the manufacturer announced a one-day work pause at its Renton factory for employees to learn and focus on quality assurance.\n\nThat ought to do it", "score": 2, "replies": []}, {"body": "Business schools will use Boeing as a case study for years on how to fail when you share a market with *one* competitor.", "score": 2, "replies": []}, {"body": "Right it’s employees fault, the management just needs to focus on that everything will be shiny again", "score": 2, "replies": []}, {"body": "I am not going to believe Boeing is serious about safety until executives start getting fired. And I think much of the public rightly remains skeptical as well", "score": 2, "replies": []}, {"body": "Imagine if Tesla made airplanes with their QC 😭", "score": 4, "replies": [{"body": "Do you mean spaceX ? Their rockets don't crash tho.\nNevermind.", "score": 6, "replies": [{"body": "Their rockets do explode at times, but it often only happens when they're testing something and think failure is at least a decent possibility. NASA themselves had a lot of failures with launching rockets throughout their history, especially when they were younger.\n\nThat said to be fair rockets are much more dangerous and have a much higher failure rate then things like planes and automobiles. They're also much more vulnerable to things like bad weather causing things to go wrong when launching.", "score": 3, "replies": [{"body": "You can tell the guy you replied to is very young, naive, and ignorant. ", "score": 4, "replies": []}]}]}, {"body": "This is something that still surprises me. I know people own Tesla’s for a multitude of reasons, environmental, loving technology in general, or simply as a flex. \n\nI hear nothing but horror stories about how awful they are to own, constantly dealing with mechanical or technological issues.", "score": 3, "replies": [{"body": "Just go to the relevant sections of Reddit and you will find out a bunch of stories about how people have not encountered any problems with Teslas for many years.", "score": 9, "replies": [{"body": "I mean I would hope the amount of people not having issues was more than those who did …. Doesn’t mean way too many owners do have issues for it to not be a problem", "score": 5, "replies": [{"body": "A very small fraction of people who don't have a problem say, a very large fraction of people who do have a problem say. \r  \nIt's a common social media problem. All the bad things are very amplified, all the good things are glossed over.\r  \n\r  \nThe story where everything is good is just boring and doesn't get a response.", "score": 3, "replies": []}]}]}]}]}, {"body": "This is a master class in how capitalist companies DO NOT self regulate.\n\nLook at how the unregulated US company (Boeing) fares compared to the unionized and regulated European company (Airbus).", "score": 2, "replies": []}, {"body": "Yeah, blaming the blue color workers and engineers while the c-suite “leaders” decided to go full Fight Club to decide whether profits prioritizes safety. As a United member, very happy about getting Boeing to get their shit together.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -9, "replies": [{"body": "I'm a WoC who has spent my career working to limit affirmative action.  However even I wouldn't criticize it as dishonestly as your statement above.  \n\nStandards have not and will not be lowered for certain people.\n\nI suspect you got this from [Musk's false and racist troll storm of two weeks ago.](https://liveandletsfly.com/united-airlines-dei/)", "score": 3, "replies": []}]}, {"body": "Off-topic\n\nStock AVT-B\n\nThey build software in planes to fly efficiently.\n\nYou can check it.", "score": 1, "replies": []}, {"body": "The only thing that captures company's attention is a threat to earnings.", "score": 1, "replies": []}, {"body": "If there’s such a widespread ‘boots on the ground’ issue I assume they are terminating a certain # of the worst performers as well? ", "score": 1, "replies": []}, {"body": "Sounds like they need to make some serious changes at Boeing.", "score": 1, "replies": []}, {"body": "wow. this isn't good for America's sweetheart.", "score": 1, "replies": []}, {"body": "One day does not a dynasty fix.", "score": 1, "replies": []}, {"body": "I’m sure they can fix the issues caused by the management’s greed in one day.", "score": 1, "replies": []}, {"body": "I feel like if you are the kind of employee that needs to reflect on not installing bolts and whatnot, maybe there are deeper HR issues.", "score": 1, "replies": []}, {"body": "Alright technicians, repeat after me: Righty tighty, lefty loosey...Righty tighty, lefty loosey...", "score": 1, "replies": []}, {"body": "Damn, is Boeing nosediving?", "score": 1, "replies": []}, {"body": "This company needs new management and a complete restructure.", "score": 1, "replies": []}, {"body": "the solution is more management, and outsource", "score": 1, "replies": []}, {"body": "Boeing is broken.  Forgot their engineering roots.", "score": 1, "replies": []}, {"body": "Blame the employees…. This is absolutely due to management.", "score": 1, "replies": []}]}
{"title": "Tesla Reports Earnings Wednesday And There's A Lot Of Negative Noise", "selftext": "", "id": "19ej8n6", "created_utc": 1706108963.0, "score": 14, "upvote_ratio": 0.66, "num_comments": 81, "comments": [{"body": "Going down 📈!!", "score": 7, "replies": []}, {"body": "Looks like the noise was real!", "score": 6, "replies": []}, {"body": "The shorts are losing the minds because the stock isn’t plummeting based on the news that Elon wants more directive voting power to guide Tesla into the future. They bought a ton of puts and realized they will be worthless, so quick compensating by FUD exploding\n\nIt’s takes a lot of effort to rebut 1.8 million vehicles delivered, 2.5 million cybertrucks preordered and multiple sites for new gigafactories initiated \n\nWith\n\nBuh Buh Elon does drugs,\nElon is unhinged antisemit\nElon is unraveling and wants everyone’s money….\n\n\nGotta run with what you can I suppose 😂", "score": 9, "replies": [{"body": "My Feb $240 PUTS have been up over 75%, Elon opening his mouth with more promises than  deliveries can only help", "score": 13, "replies": [{"body": "Making money trading options isn’t positively correlated with being a good trader or even having a sound investment thesis. FYI.", "score": 3, "replies": [{"body": "I agree but this was low hanging fruit", "score": 2, "replies": []}]}, {"body": "Oh! You must be one of the smarter shorts that didn’t contribute to the $10 billion shorts lost on Tesla last year. Or one of the most intelligent shorts that didn’t lost $140 billion across the market in 2023. No sir you are the clear genius lazer precise shorts. Much smarter and richer than Elon who doesn’t deserve to open his mouth. All hail labordog. 🤣. Tell us more about your intelligence skill gift.", "score": -7, "replies": [{"body": "Sounds like youre bitter all your calls gonna expire worthless because TSLA heading down the shitter. Sub-200 here we gooooooo", "score": 9, "replies": []}, {"body": "You really are either a 13 year old or are extremely stunted, mentally. Either way good luck in life!", "score": 5, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Just bought more. Any jackass can buy when it’s going up. I love me a good discount. Will raise my average up quite a bit, but as you can see, the swings are massive 😘", "score": 0, "replies": []}]}, {"body": "How you feeling lil fella? Have you looked at the after hours ticker?\n\nKeep believing all the lies, papa needs rubes like you to stay the wealthiest man in the world…", "score": 3, "replies": [{"body": "Feel great muchacho, been holding for 5 years now, doubled my position when it dropped to 120 last year. We good kiddo. Holding for 10 years, should add more tomorrow. More more more, will buy more more more🤑", "score": -1, "replies": [{"body": "Sure thing champ. ", "score": 2, "replies": [{"body": "https://youtu.be/Czi-frl9kqk?si=q8JOh1ZGFJPG3cGI 🥱", "score": 0, "replies": [{"body": "You really are the epitome of a sad little brain dead simp. Musk’s favorite kind. ", "score": 3, "replies": [{"body": "Oooh, time to buy more on the dip. Tech industry money baby 😉. You obsessed with us!", "score": -1, "replies": []}]}]}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Image/Link submissions are manually reviewed due to spam control. -1B\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "U mad bro?", "score": 3, "replies": [{"body": "https://youtu.be/Czi-frl9kqk?si=q8JOh1ZGFJPG3cGI 😏 stocks go down, stocks go uppppp", "score": 0, "replies": []}]}, {"body": "This is advanced bootlicking", "score": 3, "replies": []}, {"body": "You bet bro. I only trade options when their is free money on the table", "score": 2, "replies": [{"body": "Bhahahaha. Sure pal 🥴", "score": -3, "replies": [{"body": "Good news! More PUT opportunities in store for Q2!", "score": 2, "replies": [{"body": "Adding more shares, averaging up 🥰. When you work in Tech, you often have fuck you money.", "score": 0, "replies": [{"body": "\"Fuck you money\" doesn't leave $400 headphones on a shelf at home because you're afraid of breaking them.\n\nJust say you're balls deep in the cult, at least you'd be honest with yourself then", "score": 2, "replies": [{"body": "Oooh you obsessed with tesla and me! Just because I get myself big money, doesn’t mean I’m smashing headphones into pieces 😂😂😂😂. It’s because I’m careful that I got all the fk you money! Just averaged up a bit! Bought me some sweets at $180! Will buy even more at $170/$190. All the while green and calm ☺️", "score": 0, "replies": [{"body": "Fuck you money doesn't worry about $400 headphones.\n\nKeep trying though. My puts printed plenty today though, sold too early though", "score": 2, "replies": [{"body": "Hahah I’m also waiting on my Apple Vision Pro kiddo, just because I baby it( a habit I’ve had since I got my first gameboy) doesn’t mean I can’t take your mom out to caviar and crab cakes. You gaboonder. 🤣. It sounds like you jelly I have $400 XM5’s", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Sounds more like you’re bitter your shares went down, i made a killing on this latest Tesla decline. It’s currently down nearly 25% in the last month lol\n\nOne doesn’t have to spend long looking through your post history to see you’re another musk simp", "score": 2, "replies": [{"body": "History, been holding for over 5 years, doubled up at $120, we are making money, we have patience, will be adding more. Tech money baby, is disposable 😌. Whachagonnado?", "score": -2, "replies": [{"body": "I’ll keep taking profits on the way down, i learned to separate emotions from my trades a long time ago. You would be wise to do the same or you won’t have that “tech money” for long", "score": 1, "replies": [{"body": "Some people just buy and buy more kiddo. We aren’t anally staring at tickers and charts. We see promise and buy. My tech money isn’t from investments. It just goes into good investments when pussies run away at every scare. Same thing happened with Meta, Nvidia, MS. We good 😊. As long as it’s green know what I mean? I can tell money struggles is your entire life, you give it off in your persona.", "score": 0, "replies": []}]}]}]}, {"body": "I know, people are literally getting into arguments on these subs in all out name-calling, pissing matches. You're gonna bet a bunch of money on a stock falling, and then attack people online when your \"investment\" isn't panning out. Keep up the great work hahaha, that's a real healthy lifestyle.", "score": 2, "replies": [{"body": "They are more obsessed with Elon and Tesla than the longs. And spend infinitely more time wasted away, watching price actions. Yet they somehow call longs ‘fanboys’ when they are closer to OCD about their ‘put’ ‘investment’", "score": 1, "replies": [{"body": "The toxicity comes from time horizons. Tesla stock must fall x by x date, or my put is worthless. Ppl who are long on the stock and in the money don't have a time horizon(they got in between 2012-2019) they can sell when their luck favours them. They have no problem waiting for years, decades even for a nice return. Time is not nice to short sellers, it will always be a larger gamble no matter the stock.", "score": -1, "replies": []}]}]}, {"body": "agreed…. tsla is so good…. MMs need it cheaper as well", "score": 0, "replies": []}]}, {"body": "RemindMe! Tomorrow “reply to this thread”", "score": 2, "replies": [{"body": "friendly reminder", "score": 1, "replies": []}]}, {"body": "So… are you predicting tomorrow TSLA will make a comeback?", "score": 2, "replies": []}, {"body": "Yeah the goose is cooked. No demand. Price cuts to create demand but demand remains flat. Less profits. Elon leaving. \n\nShows over.", "score": 4, "replies": [{"body": "1.8 Mil cars and the most popular car sold in 2023. Yeah no demand haha", "score": 2, "replies": [{"body": "Dude it's over. The most popular car is the corolla. Tesla only slightly better because they give out free money so the gullible buy in. \n\nEveryone is ditching it. Its a pyramid scheme. \n\nhttps://www.cnbc.com/2024/01/24/tesla-tsla-earnings-q4-2023.html", "score": 1, "replies": [{"body": "lol!! Good luck with your Puts/Shorts", "score": 1, "replies": [{"body": "Already printing :)", "score": 3, "replies": [{"body": "I just dropped 11K for July 19 $205 Calls 😬", "score": 1, "replies": [{"body": "Good luck. It's gonna hurt man.", "score": 1, "replies": [{"body": "Meh I make enough, this is play money.  I’ve been watching TSLA price action closely for years.  This is just another standard market overreaction. People expect 30% margins and 50% gains YoY and those days are gone. 2mil+ cars in 24 combined w/ “hopefully” a Fed rate drop or 2?   I like my chances for a 2X here.  I have been selling LOTS of Calls too against my shares successfully but that’s over now too (I’m betting) this is the bottom for 24 unless we have some unforeseen global crazy event again of course.  It IS an election year and the Dems are desperate to stay in power. War w/ China is an ever increasing likelihood. If that happens tho it’s goodbye to all stocks and all economies for years. You’re right tho, buying TSLA calls today is gambling for sure.", "score": 0, "replies": [{"body": "It's a meme stock. Has no fundamentals and now what fundamentals it did have are cut in half. \n\nYour losing money. This is the part where you have accepted your fate but are trying to justify it. \n\nKeep buying man. Lol. Falling knife.\n\nToyota can't keep hybrids in stock. Interest rates be damned. Meanwhile tesla still has new 2023s lol.", "score": 1, "replies": [{"body": "Why are you downvoting my replies? Not that I care I think that’s a stupid feature of reddit, who cares. I’m with you bro!, I’m not pro Tesla or pro EVs, I think they are all fkn stupid, I’m pro money. There are so many green libtard morons out there gobbling these things up and I intend to and have been for years making money on their stupidity. I’ll NEVER own a Tesla. I will however continue to profit owning their shares. Full disclosure time what is your exposure to them? Shorting? Selling how many PUT contracts?", "score": 0, "replies": [{"body": "I'm not downvoting anything man I'm just replying.  Those guys gobbling them up are wising up to the unreliable junk being sold by a nazi to them. \n\nMusky PR is losing sales too. Dudes a self proclaimed right winger now.", "score": 1, "replies": [{"body": "Good I’m a Conservative too, the direction of the U.S. these last 3 years is a disaster. Glad he bought Twitter and exposed them and the Dems for exactly what they are.", "score": 0, "replies": [{"body": "Idk about that. Twitter being bought by musky shows that's he is the idiot we all knew he was all along. \n\nI don't think it's shown us anything. The last 3 years have been fine.", "score": 1, "replies": [{"body": "Clearly you don’t live in America", "score": 0, "replies": [{"body": "Yeah I have. What's wrong? Record wages. Record profits. Record unemployment. Chips act. Infrastructure act. \n\nWhat's messing you up ?", "score": 1, "replies": [{"body": "Record inflation, 8T in money printing, 150Bil to Ukraine, 10Mil illegals crossed the southern border, the disaster that was his Afghan pullout then Biden checking his watch after each of my brothers & sister were carried off the plane like he had something better to do, Joe & Hunter taking millions from Ukraine when VP, the Pro Woke culture, Biden Admin silencing people on Twitter/FB, my wife a Dr being fired for refusing his MANDATORY forced untested vaccine. The made up fake charges against his top political rival to keep him off the ballet and magically call that “democracy” Biden forcing businesses to close then taking credit for “creating jobs” he created 0.0 jobs. His claims Bidenomics are working when we all know the Nat Debt at 34T is a ticking time bomb, his incessant attempts to pay off college loans of idiots that agreed to these loans when well over half of us didn’t even go to college…I can go on for another hour if you choose.\n\nSorry I forgot my FAV, the Inflation Reduction Act that actually added to inflation & included the hiring of 87,000 new and fully armed/weaponized IRS agents. Guy can’t walk or talk, has no clue what he’s doing or even where he is, he easily could have stopped the Russia/Ukraine war and did nothing. Israel now China/Taiwan.  He is a joke, to the world America is a joke. We are a ship w/ no Captain. Instead we have a corrupt empty suit dead guy that sniffs little kids. Mind blown 81Mil id10ts voted for him and the man campaigned TWICE, both times in empty HS gyms.  Clearly a stolen election tho apparently we can’t prove that.", "score": 0, "replies": [{"body": "Oh shit. Yeah many of those points are right wing talking points..lol. \n\nThe afghan pull out was messy he shouldn't have followed thru with trumps mess on that one. I blame Trump for cutting out the ANA and negotiating with the taliban. Biden should have scrapped that. \n\nTrump spent tons too. Biden spending was much more responsible. Checking his watch? Really ? I can't take you seriously after you made that point lol. \n\nI like hunter Biden. He is a addict sure but he has stayed out of politics unlike the nepotism that Trump brought into play. Funny you bring that up. Can't take you seriously about that. \n\nIt was trumps vaccine remember ? Plenty of jobs require mandatory vaccines remember ? Biden didn't fire your doctor friend. Lol..\n\nNo one made any charges against Trump. You realize it's a grand jury ? You know what that is,? Are they paid and bought ? Lol \n\nStudent loans were only railroaded because of a false case. Supreme Court set up a bad precedent. If you argue that it's bad why not speak up when the banks got bailed out? Or the corrupted cluster fuck that the PPP loans were? Lol \n\nTrump could have stopped russia by giving Ukraine the weapons they wanted before they rolled in but he didn't. CuZ he likes.putin lol. \n\nIrs creates more money by catching tax cheats. Why does that worry you ? Cheating? Lol \n\nWhy is Israel his fault? Israel failed there. \n\nChina and Taiwan? Nothing is happening there lol. That's a war cry of nothing..\n\nHe sniffs kids ? Trump was friends with epstein and said he would bang his own daughter lol. \n\nYou think the election was stolen? So he's stupid old and ineffective yet he managed the greatest conspiracy in history with no.evidence? So is he a master mind ? Hahahahahahhahahaah your lost..\n\nDid you storm the capital ? Lol", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Money is printing.", "score": 2, "replies": [{"body": "I still say the Model Y was the most popular car sold in 23.   Look it up", "score": 0, "replies": [{"body": "You mean the most heavily subsidized car in history barley outsold the corolla who doesn't rely on free money to sell? \n\nTesla also is now less profitable than Toyota and on par with gm and the rest so that's gone too. \n\nTheir stock price will plummet to show them where they are supposed to be as opposed to the stupid valuation they have had based on lies and feelings.", "score": 1, "replies": [{"body": "I’m reading the Corolla will do just over a million in global sales while the Model Y should break 1.25 Mil units sold. The Corolla is a reliable affordable but super basic car, the Model Y is vastly superior in luxury amenities and overall performance. Would I buy one? No fkn way, EV’s are ghey. I do like those 0-60 times tho.", "score": 0, "replies": [{"body": "The corolla is not super basic. What option does tesla have that a corolla doesn't?", "score": 0, "replies": []}]}]}]}]}, {"body": "just 5x'd my 1/26 202.5 puts. How's your day going?!?", "score": 2, "replies": [{"body": "It's raining cash over here. It will keep pushing down. Right now you have a bunch of cultists buying below 200 as they think it's a good deal. Once that buying power taps out its free falling", "score": 2, "replies": [{"body": "Tsla has a support level at $175, I’m guessing that’s the true bottom.  Then the realization that this was a classic market overreaction will hit people next week and the price will start to recover. Tesla has 30Bil cash on hand in reserves.  Still makes positive earnings.  Billions per qtr.  Set to produce 2 mil+ cars in 2024, they are getting ready to ramp cyber truck even tho margins are 0 there for now. They have that huge solar business tho that’s Interest Rate sensitive like the cars are. Fed rate drops in March? Tesla robots that no one’s talking about, those are gonna make them a TON as much as I hate them. They will sell. The new under 30K EV is coming soon AND that project RedWood, we know nothing about.  Could be huge? Lotsa upside to them.   “When everyone is fearful (today) that’s when you should be greedy.  When mahfuckahs be greedy, get the fuck out.” - Warren Buffet", "score": 0, "replies": [{"body": "Yeah man. You don't get it. You didn't read the deets. \n\nThey are less profitable then toyota and on par with gm or Ford. \n\nThey can't sell products without price cuts. \nCybercuck was supposed to be cutting edge but it's worst in class except speed. \n\nThey won't go bankrupt but it will trade around 75ish$\n\nRobot isn't shit.  Just marketing gimmick. \n\nBut you do you.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "I wouldn't expect you too. \n\nhttps://fortune.com/2023/11/26/elon-musk-hybrid-vehicles-toyota-tesla-electric-vehicles/", "score": 4, "replies": [{"body": "Stock price could still go up with earnings. But I’m thinking puts \nIt’s probably dropping from here", "score": 1, "replies": []}]}]}]}, {"body": "The Tesla hype is over. It's just another automotive company with barely any profit.", "score": 1, "replies": [{"body": "“barely any profit” lmao", "score": 1, "replies": [{"body": "Now u can continue laughing while the stock just plunged by 12%, down 25% YTD", "score": 1, "replies": []}]}]}, {"body": "Good Elon has been failing and it needs to be shown to the world. Here it is.", "score": 1, "replies": [{"body": "Not meeting outrageous short term expectations doesn’t mean the company is failing. They still made a shit ton of money last year and have lots of promising products down the road.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Lots of rumors that Elon wants out of TSLA due to disagreements with the board. Hope it’s not true", "score": 1, "replies": [{"body": "He’s the one who picked the board LMAO", "score": 2, "replies": []}]}]}
