{"title": "I think tesla will reach an honest evaluation", "selftext": "Recently, I've been getting ads from tesla, and not just like, \"we're in your area\" but shitty (insert useless feature no one cares about) ads. I believe this is a bad sign for tesla long-term as they have basically reverted to old big auto tactics. At least in pre-covid, tesla was extremely hyped. My uncles bought teslas, and they previously were BMW stick shift and big diesel guys. Now, this post isnt to say that tesla will be worth 0 since it is set up to continue to dominate much of the EV market, just that the EV market seems more like the luxury car market than the mass car market. I still think the hype and Elon d\\*\\*\\*\\*\\*\\*\\*\\*r's may prevent a total collapse of the stock within the next year, just that the companies already know flaws and the new ad campaign seems like a signal of bad health.", "id": "19141jz", "created_utc": 1704665151.0, "score": 0, "upvote_ratio": 0.34, "num_comments": 77, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous Best DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Until a legacy car company grows balls and puts a majority of their resources to go full EV Tesla’s value will remain sky high . \n\nThey are slow playing on the side lines exactly like Walmart and all the other retailers watching Amazon rape the e-commerce market share for 15 years before saying “shit we should probably try a little harder now “", "score": 32, "replies": [{"body": "Only non-Chinese ones that are close are Hyundai/Kia, Volkswagen, and Volvo. GM tried but Ultium had a lot of issues. Ford Blue is hamstrung by dealers.", "score": 5, "replies": [{"body": "You’re forgetting BMW. They grew BEV sales by 80% YoY in Q3 and will sell around 400k BEVs globally in 2023. Their BEVs are getting great reviews people really like them. The i4, iX, i5. Oh and their CEO is on record saying their BEVs are just as profitable as their ICE vehicles.\n\nhttps://amp.dw.com/en/bmw-says-electric-cars-as-profitable-as-petrol-diesel-cars/a-66703975", "score": 6, "replies": [{"body": "Yeah them too. I guess I don't think about them as much since they're not as mainstream. I'd imagine they would be since their customers are ok with paying higher prices in general.", "score": 0, "replies": [{"body": "BMW is more mainstream than Volvo. They have 3-4x the sales volume. Very popular vehicles in Europe and China much more so than the US.", "score": 1, "replies": [{"body": "And they save money on not installing turn signal lights because the BMW drivers never use them anyway", "score": 3, "replies": []}, {"body": "Thanks for the tip", "score": 1, "replies": []}]}]}]}]}]}, {"body": "One thing that I believe can be a big catalyst for Tesla is their charging network. They have over 50K superchargers currently, making them the largest global charging network. \n\nA lot of companies are switching/utilizing Tesla’s charging port, including GM, Ford, Mercedes, Nissan, Honda, BMW, Kia, Hyundai, Toyota, Subaru, Volkswagen and more. This will benefit Tesla’s bottom line and can grow to become a substantial portion of revenue in the future.", "score": 14, "replies": [{"body": "EV charging is not a very profitable business. There’s a reason there isn’t a lot of quality competition in the space. The biggest players have horrendous gross margins. EVGo 3% gross margin. ChargePoint 7% gross margin. Tesla reports their charging gross margins as part of “Services” segment in their quarterly report. Their gross margin on services is single digits. You’re essentially a middle man between the consumer and utility company. Oh and 80-90% of EV charging is done at home unlike ICE vehicle who rely on gas stations for all fueling. It doesn’t move the needle for an 800B market cap.", "score": 13, "replies": [{"body": "Yeah, but there are a lot of government incentives for charging right now, where the real money is.", "score": 1, "replies": [{"body": "That's the only reason Tesla has opened up their charging network. The government is subsidizing installation. This is only in the US and this doesn't change the fact that margins on being a middle man between electric utility and consumer are very low. Certainly not high enough to move the needle on an 800B market cap.", "score": 2, "replies": []}]}]}, {"body": "Other companies using their plug style has NOTHING to do with helping tesla. Id argue it does the opposite by making it easy for third parties to manufacture it and set up charging centers.", "score": 2, "replies": []}, {"body": "People who make this argument don’t seem to understand that as soon as these are profitable the energy supplier will just bogart them from Tesla", "score": 2, "replies": [{"body": "The energy supplier that is Tesla or buying Tesla mega packs? That energy supplier?", "score": 2, "replies": [{"body": "Ya know where the electricity comes from", "score": 0, "replies": [{"body": "Increasingly the huge ball of fire in the sky and eventually cold fusion. The UK fossil fuel usage has dropped precipitously over the past several years and continues to do so. It is evolution.", "score": 2, "replies": []}]}]}]}, {"body": "This super charger network is a distraction and a nothing burger.   I also doubt all those 50k superchargers are tesla owned.   It's not going to generate any serious revenue.   Just look at the existing players in the charging space.  Then you have the existing big players in ICE world who have committed to adding super chargers at each of their locations.  Pilot, TCA, Loves etc all are adding superchargers.  Are you going to charge at these locations or some remote area Tesla charging site. \n\nImo. The tesla owned network is a diminishing asset that tesla will try to offload before it becomes a huge liability on balance sheet.", "score": -9, "replies": [{"body": "I am so glad there are stupid bears like you Still around. Remindme! 2 years", "score": 9, "replies": [{"body": "I will be messaging you in 2 years on [**2026-01-08 00:07:29 UTC**](http://www.wolframalpha.com/input/?i=2026-01-08%2000:07:29%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/19141jz/i_think_tesla_will_reach_an_honest_evaluation/kgt8wq4/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F19141jz%2Fi_think_tesla_will_reach_an_honest_evaluation%2Fkgt8wq4%2F%5D%0A%0ARemindMe%21%202026-01-08%2000%3A07%3A29%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2019141jz)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}, {"body": "Is Samsung raking in the money from Blu-ray because they won the format war against HD DVD? \n\nTesla won a charging format war. That's it. Other companies can make Tesla chargers now.", "score": 0, "replies": [{"body": "“Can” is doing a lot of work in your little argument", "score": 2, "replies": [{"body": "Can means that if there's money in it, they'll do it.", "score": 1, "replies": []}]}, {"body": "The charging network is more than just a connector type. It's more seamless, reliable and easier to use use than other networks. Their cost to install a new supercharger is considerably lower than it is for competitors also.", "score": 2, "replies": []}, {"body": "I love me a false equivalency.", "score": 1, "replies": []}]}]}]}]}, {"body": "I honestly don't know how anybody continues to believe TSLA is a winner. I sold off a long time ago, and as far as I can tell, every red flag you could possibly imagine, is out there. And who among you has actually seen that CT... omg, what a little POS Tonka-toy that is.... plus, we're getting indications they've cooked the safety books, and more. Not to mention, Leon has not exactly done them any favors with his antics, and word on the street is that talent is starting to leak from the company. You can rest assured this boy will not be posting his TSLA calls anytime soon.", "score": 5, "replies": []}, {"body": "The tesla supercharger network is a unicorn that is worth billions because no one else is capable of wasting so much money, and that is why all the other manufacturers are going to use their specific plugs, until the next better thing happens", "score": 5, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "You've got it all backwards. Tesla only charged luxury prices for their Model S and Model X. The Model 3 and Y are much more affordable. There are no better EVs for less money from other OEMs. Every better model costs more money. Tesla still has better margins than anyone so its b.s. to say they can't cut prices.", "score": 10, "replies": [{"body": "My IONIQ 6 SEL, with an MSRP of 49k, was significantly cheaper than a Model 3 (and is generally considered a better car).  Both were $400/month with tax - but Tesla wanted 7.5k down, the 6 was only 2k down, with 2 years free charging at Electrify America, a free L2 charger with a $600 install credit. And Tesla wanted $750 extra for an L1 charger! (Included with the 6).", "score": 1, "replies": [{"body": "The SEL is not generally considered a better car than the Model 3. I assume you bought the AWD version? The range is 80 miles less than the Model 3 LR and it has roughly half the power. Oh and the Model 3 LR starts at $44k which is $4k less than your car AND it qualifies for the $7500 federal tax credit which brings the price difference up to $11k LESS for the Tesla. I'm not sure what charger they offered you but I paid less than that for a Level 2 charger and installed it myself.", "score": 4, "replies": [{"body": "https://www.caranddriver.com/ev-of-the-year/", "score": 0, "replies": [{"body": "Even if you agree with their opinion it still costs $11k more....", "score": 3, "replies": [{"body": "Like I said it cost me 5k less to lease it than an M3, plus got goodies.", "score": -4, "replies": [{"body": "Thats a lease deal not a purchase. Are the mileage limits and residual payoffs even the same?", "score": 4, "replies": []}]}]}]}]}, {"body": "Oof.\n\nIf cost was truly a concern for your EV purchase, you should have researched just a little bit more on how much a Model 3 costs.", "score": 1, "replies": []}]}]}, {"body": "I don't know what you define as Luxury but from my understanding of \"Luxury\" in the car world, Tesla is FAR from charging luxury prices. Tesla's EVs are literally on par if not the cheapest EVs on the market for what they come with in terms of range and features.", "score": 10, "replies": []}, {"body": "I don’t know where you get your statistics, but it’s not in any universe even tangentially related to ours. Just spitballing?", "score": 2, "replies": []}, {"body": "Tesla also makes like 4x more profit per vehicle than every other automaker (believe I saw like 30%). They can afford to cut prices, as can every other automaker. Don’t be a sheep", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They are at 12% currently and that’s only because of the commodity shock. They’ll be back to 18% which is almost triple the industry standard. \n\nWhy do people say stupid shit on reddit", "score": 7, "replies": [{"body": "Because people are stupid and Reddit is a great place for stupid people to discuss their ideas with becoming known as stupid people in their communities.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "That’s not how economies of scale work. If they have fewer parts in their cars and are vertically integrated the reverse is true.", "score": 2, "replies": []}, {"body": "Remindme! 2 years “are Tesla’s profit margins above 9%?”", "score": 3, "replies": []}]}]}, {"body": "The only car company with a heigher net profit margin than Tesla is Mercedes and they sell 98% gas vehicles for double the price.\n\nWhen compared to ONLY EV sales net profit margins, Tesla is MILES ahead of its competition. Most brands cant even sell their EVs with a profit at all.", "score": 7, "replies": [{"body": "[deleted]", "score": -9, "replies": [{"body": "lmao", "score": 2, "replies": []}, {"body": "You’re clearly not following Tesla manufacturing practices to claim that their cost base is increasing. Like you have absolute no idea how manufacturing works but like to give us your opinion anyhow. \n\n👏", "score": 2, "replies": []}]}]}]}, {"body": "Tesla no longer has the best gross profit margins in the auto industry.", "score": 0, "replies": [{"body": "They do for EVs, however, and the EV market will eventually equal 100% of the auto market.", "score": 0, "replies": [{"body": "Do they though? BYD's gross margin in Q3 was 22.1%. Tesla's was 17.9%. BYD sold 431k all electric vehicles in Q3 and 393k hybrid vehicles. So roughly 50% of their vehicle sales were BEVs. It's certainly possible that the hybrids brought up their gross margin as a business but even if gross margins on hybrids were 26% then gross margins on BEVs would be around 18% and they are at parity with Tesla. We don't have definitive data to break out BYD's gross margin on BEV only so you really can't make a claim one way or the other.\n\n[https://www.reuters.com/article/byd-results/update-1-china-ev-maker-byd-reports-record-quarterly-profit-of-1-42-bln-in-q3-idUSL1N3C00QY/](https://www.reuters.com/article/byd-results/update-1-china-ev-maker-byd-reports-record-quarterly-profit-of-1-42-bln-in-q3-idUSL1N3C00QY/)\n\nAlso, the CEO of BMW is on record saying their EVs are just as profitable as their ICE vehicles. BMW had a gross margin of 18% in Q3.\n\n[https://www.dw.com/en/bmw-says-electric-cars-as-profitable-as-petrol-diesel-cars/a-66703975](https://www.dw.com/en/bmw-says-electric-cars-as-profitable-as-petrol-diesel-cars/a-66703975)\n\nI really wouldn't be surprised to see other auto makers achieve manufacturing cost parity with Tesla as they scale up. The main cost component is the battery and Tesla is entirely reliant on the same battery suppliers as the rest of the autos. They can barely scale their 4680 to support Cybertruck production let alone millions of vehicles per year. This includes CATL, BYD, LG, Panasonic.", "score": 1, "replies": []}]}]}]}, {"body": "They charge luxury prices, and everyone and their mom have flexed the shit out of their teslas. It was the Hypebeast car. People had millions of dollars, could buy lambos, and bought teslas. To me, Tesla is the supreme(the boring red and white logo, the guys who’s sold a brick, and a crowbar) of car companies. They are only big because of hype. And even then, the majority of people don’t fall for it. I’m not saying they are going to 0, just that they will be priced more accurately. I’m sure they will still be an expensive stock and among the most valuable car companies (unless their old models start blowing up again). But I simply can’t see them maintaining a price more than double Toyota. I’m sure people who are holding long term puts on Tesla(Michael Burry) see it the same, and I know I’m not the first person to bring this up, but the fact that they are advertising now is scary(for all the bulls)", "score": -1, "replies": [{"body": "Michael Burry responded to my craigslist ad looking for someone to mow my lawn. \"$30 is $30\", he said as he continued to mow what was clearly the wrong yard. My neighbor and I shouted at him but he was already wearing muffs. Focused dude. He attached a phone mount onto the handle of his push mower. I was able to sneak a peek and he was browsing Zillow listings in central Wyoming. He wouldn't stop cackling.\n\nThat is to say, Burry has his fingers in a lot of pies. He makes sure his name is in all the conversations.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 8, "replies": [{"body": "good bot", "score": 2, "replies": []}]}, {"body": "I’m a bull and it’s not scary. I add every week. I had a buddy in the military a few years back, he had an hour commute to base. Bought a Tesla and has saved about $10k on gas. Car has never been in the shop. It’s as good as it was first day. \n\nIf you know anything about the military, they don’t make a lot of money so the claim that it’s a luxury item is completely false when you have regular people buying pick up trucks for $70-80k with $1000 monthly payments. \n\nI’m not saying regular people are super smart for doing so, but they  are not luxury items.", "score": 6, "replies": []}, {"body": "Luxury prices for you != luxury prices for the average American. For you, Wendy's probably charges luxury prices.", "score": 1, "replies": []}]}]}, {"body": "Ppl realizing resale value of ev is shit when considering battery replacement costs", "score": 4, "replies": [{"body": "I’ve been wondering why no US firms have yet made the hot-swappable batteries like Chinese car company NIO. I think a lot of peoples annoyance with EVs is the lack of a fast turnaround time, especially since “superchargers/fast-chargers” just destroy batteries. Idk. We have yet to see.", "score": -5, "replies": [{"body": "\"especially since “superchargers/fast-chargers” just destroy batteries. Idk. We have yet to see. \"\n\nLiterally fake news. This has been debunked and tested like a houndred times already. It barely makes any difference if you use superchargers or slow charging.\n\nThere are tons of people on the tesla subs posting their battery states after ONLY supercharging for 100k miles and those you dont supercharge at all. There is barely any difference at all. The battery cooling systems are just good enough now so that the battery doesnt reach damaging temps anymore during charging.", "score": 8, "replies": []}, {"body": "That’s gonna be a hard business model to make work. They give out a good battery for one that could be bad. What happens when they get a bad battery that’s worthless and they just gave out a 20k$ battery.", "score": 2, "replies": []}]}]}, {"body": "They even start to fly in China. At least 5 meters in the air", "score": 1, "replies": []}, {"body": "If they don't fix the experience at r/TeslaServiceCenter when customers bring in the car for issues... what are the odds of the customers actually buying another one 🤷🏽‍♂️", "score": 1, "replies": []}, {"body": "Tsla is not that overvalued anymore compared to many big tech.", "score": -3, "replies": [{"body": "They’re not a tech company. They’re a high volume manufacturing company. Thats why Microsoft has 4x the gross profit margins of Tesla. They don’t deserve a tech multiple. Tech companies generally have scalable computing related business models.", "score": 10, "replies": [{"body": "Is Apple a tech company or a high volume manufacturing company?\nWhat Tesla is doing isn't that different from what Apple was doing 15 years ago, they're filling the market with their hardware to sell their software subscription down the line. If they ever crack it, that is.", "score": 4, "replies": [{"body": "Apple has a massive software ecosystem they use to rake in money despite flat iPhone unit sales the last 9 years. App Store alone generated 85B in revenue in 2022 lol. Thats why they have a much higher multiple now than they did historically. Back during their hyper growth iPhone sales explosion 10-15 years ago they had a PE multiple in the 10-15x range precisely because all their revenue came from hardware. IF Tesla can ever demonstrate that kind of software sales then it should be rewarded just like Apple was AFTER they proved it. Not purely based off speculation.", "score": 6, "replies": [{"body": "The market valued Apple in the 10-15x range because it had no idea of what was coming and how loyal the customer base would be despite the price. Apple practically invented the walled garden, so the market had no idea how to value that. But now it does, and that's why we see such rich valuations for Tesla. Don't get me wrong, I don't agree with Tesla's present valuation as a whole lot of perfection is baked in. If they cracked FSD I'd say they're even cheap right now. But I don't see that happening this decade so the stock price has some falling to do.", "score": 1, "replies": [{"body": "Frankly I don't see any parallels between Apple and Tesla on their product offering or walled garden. Tesla doesn't have a walled garden. There's no software ecosystem. There's no app developer community. There's no integration with every aspect of your digital life. There's no recurring software revenue. \n\nOne may have argued the charging network was a walled garden of sorts but the Tesla charging network is opening up to all automakers moving forward and the charging connector is an open source standard so any other company can make chargers that work with Tesla and all other EVs using NACS. Also gross margins on charging are single digit percentages and 80-90% of charging is done at home so it's a much smaller opportunity than gas station refueling. Energy is a commodity and it's a race to the bottom on connecting the consumer with the electric utility. As far as FSD goes they haven't shown that they will ever be able to achieve fully autonomous robotaxi levels. Right now FSD is a driver assistance package with a very low take rate.", "score": 2, "replies": [{"body": "Not yet, which was my point, but there's room for it. Not exactly like Apple's model, I mostly used Apple as an example of how the market sometimes can't envision the roadmap ahead, and how some developments can lead to further possibilities that weren't previously apparent. \nTesla is making inroads into the energy sector and one can never tell how that's going to influence the picture. Apple's gardens weren't always walled, they invited everyone in before closing it off, metaphorically speaking.\nI agree with you that it's mostly hopium, I'm just stating some points that led to such a valuation.", "score": 1, "replies": [{"body": "Apple’s garden was always walled. They introduced App Store in 2008 with the 30% fee on all app and in app purchases. \n\nAs for static grid energy. This will be another low margin high volume manufacturing business at maturity. It will be dominated by the players who own the main cost component (battery cell production). This is CATL, BYD, LG, Panasonic, SK, Samsung. In fact there is already immense competition in this space with Megapack competitors winning billions in contracts around the world. CATL a 1.2B contract with Primergy energy in Nevada. BYD will power Vegas’s new BESS storage facilities. It will be a race to the bottom on profits as static battery packs are commoditized like any other electronic. And the biggest players in cells can simply undercut Tesla who will be reliant on them as they can’t produce anywhere near enough of their own cells to make their products. This is not a tech business. It’s another manufacturing business.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "&#x200B;\n\nFor me, it's about one thing only: \n\nTsla has to figure out how to plug your car in your garage and it is fully charged in the morning. If you have that, then most people will love EV.\n\nNone of this charging station nonsense.", "score": -4, "replies": [{"body": "They can install those to your house. They even have battery pack options so you can have a fully off the grid house, equipped with solar. Not that anyone cares.", "score": 8, "replies": []}, {"body": "Already a thing, look up level 2 charging.", "score": 4, "replies": []}, {"body": "Are you being serious? That’s possible since day 1.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "That’s crazy bc everytime they miss on earnings and deliveries the stock takes a shit", "score": 6, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "“Go fuck yourself”", "score": 3, "replies": []}]}]}]}, {"body": "I’m honestly not sure 🤔", "score": 1, "replies": []}, {"body": "Your anecdotal mindset is stopping you from seeing clearly. Zoom out", "score": 1, "replies": []}, {"body": "If you said this about stocks at the beginning of the dot com bubble you would have made $0 so pop off", "score": 1, "replies": []}]}
