{"title": "Apple can legally sell redesigned watches after blood-oxygen detection disaster", "selftext": "", "id": "197pmkq", "created_utc": 1705366865.0, "score": 1450, "upvote_ratio": 0.96, "num_comments": 86, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|3 days ago\n**Total Comments**|0|**Previous Best DD**|\n**Account Age**|5 days|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "_\"One day later, the U.S Court of Appeals ruled Apple could sell its Apple Watch Ultra 2 and the Apple Watch Series 9 after Apple argued it would “suffer continuing irreparable harm to its reputation and goodwill” if it was not allowed to sell Apple Watches with the technology.\"_\n\nI had no idea this was a legit legal argument.\n\n_\"I need this! All my bros are watching man! They'll call me a regard forever if you don't let me have this!\"_", "score": 1704, "replies": [{"body": "they’re redesigned, the USITC order would still prevent the nonredesigned ones from being sold in the US\n\nApple just need the court to differentiate because the USITC would not be able to operate with that level of nuance", "score": 373, "replies": [{"body": "Technically I think the original USITC order only bars them from importing more of them, but they can sell the ones that are already here.", "score": 69, "replies": []}]}, {"body": "its apple… they probably own the judge", "score": 75, "replies": [{"body": "Apple has the US by the balls. If they don't own the judge, they certainly own the jury.\n\nSomeone posts about apple being sued and people act like they're the ones on trial.\n\n\nTo me that's the equivalent of falling in love with a twitch streamer. Apple sees it as transactional, but some people convinced themselves it's love.", "score": 30, "replies": []}, {"body": "Another ‘muh corps run the world!’\n\nAt least it’s not a ‘muh military industrial complex!’", "score": -82, "replies": [{"body": "I can't wait until you find out corps are also involved in the military industrial complex", "score": 41, "replies": [{"body": "Wait until they find out Corps are people without a pulse…", "score": 17, "replies": [{"body": "You mean a corpse? /s", "score": 11, "replies": []}]}, {"body": "…yeah who do you think makes the software? The steel? The chemicals? The fabrics? \n\nHoly shit it’s like the process is integrated", "score": -2, "replies": [{"body": "Right, it's literally the same thing...so why do you seem to favor one more than the other?", "score": 0, "replies": [{"body": "I think both statements are fucking nonsensical, made by people who want a fairy tale to explain the problems in the world", "score": 0, "replies": [{"body": "That's fair. Your original reply made it seem like you didn't think both of those statements were equal", "score": 1, "replies": []}]}]}]}]}, {"body": "Apple is valued at more than 1/10th of the total yearly GDP of the USA (probably closer to 1/7-1/8, but I'm too lazy to check exact #s) ...if they didn't have some sway in how things work, then it'd almost be *weird*", "score": 0, "replies": [{"body": "So what’s the arbitrary size required to ‘have sway’?", "score": 1, "replies": []}]}]}, {"body": "What is good for apple is good for america", "score": 1, "replies": []}]}]}, {"body": "Can I sell my ultra with blood oxygen level sensor on eBay for a lot of money?", "score": 219, "replies": [{"body": "Just sell your blood oxygen. The market’s hot right now", "score": 220, "replies": [{"body": "If only we had some way to gauge its saturation", "score": 20, "replies": [{"body": "It goes red in the presence of oxygen", "score": 5, "replies": [{"body": "Wow. What a cool feature. Color coding. Someone should patent and market that.", "score": 2, "replies": []}]}]}, {"body": "Hot blooded!\n\nCheck it and see\n\nHot blooded!", "score": 1, "replies": []}, {"body": "Can I sell it used? I'll even throw in an extra carbon for free!", "score": 1, "replies": []}]}, {"body": "The BO sensor has been in since the 6, so there are a ton of them floating around out there.", "score": 8, "replies": [{"body": "Wait the Apple Watch knows if I smell?", "score": 16, "replies": [{"body": "We all do", "score": 27, "replies": []}]}, {"body": "Man, a BO sensor would completely revolutionize conventions.", "score": 10, "replies": [{"body": "I don't think an alarm going off constantly would be that useful.", "score": 11, "replies": []}]}]}, {"body": "I would hold on to it. It will be rare if you keep good care of it.", "score": 1, "replies": []}]}, {"body": "I mean did anyone actually think that Apple would lose out on this? They either redesign or pay the license.", "score": 376, "replies": [{"body": "Some linux running freak who uses neo office probably thought that is their demise", "score": 257, "replies": [{"body": "r/rareinsults", "score": 57, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "What’s the definition of redesign?", "score": 1, "replies": []}]}, {"body": "I mean the case is still with all the existing Apple Watch that uses the patent technology that is in questions. So some sort of deal would have to be made for the existing and already sold hardware and software. \n\nIf Apple lose the case.", "score": 4, "replies": []}, {"body": "Fighting the lawsuit is probably Apple’s way of negotiating a lower price for buying the other company.", "score": 2, "replies": []}]}, {"body": "Does the redesign still track blood-oxygen level?", "score": 87, "replies": [{"body": "Legally no they can't. However, Apple has rebranded blood to iGlobin and the watch now tracks your iGlobin-oxygen levels.", "score": 312, "replies": [{"body": "I read that as iGoblin perfect name for Apple", "score": 149, "replies": [{"body": "iGoblin deez nuts\n\nwait", "score": 163, "replies": [{"body": "😂", "score": 13, "replies": []}, {"body": "ayo", "score": 9, "replies": [{"body": "Better than naming it ftxGoblin...", "score": 5, "replies": []}]}, {"body": "WYD later?", "score": 2, "replies": []}]}]}, {"body": "Awesome! How much is the charging cable for my iGlobin?", "score": 15, "replies": []}, {"body": "Inject the iGlobin straight into my veins Tim", "score": 14, "replies": []}, {"body": "iRon.", "score": 3, "replies": []}, {"body": "It's not iGlobin it's Apple Globin", "score": 3, "replies": []}]}]}, {"body": "Why would I want one if it doesn’t have an oximeter", "score": 101, "replies": [{"body": "[removed]", "score": 21, "replies": [{"body": "Like for example, tracking the time", "score": 36, "replies": [{"body": "pfft, my $10 Casio with a 10 year battery does that", "score": 14, "replies": []}]}]}, {"body": "Still has ECG for example", "score": 2, "replies": []}]}, {"body": "“good artists borrow, great artists steal.”", "score": 87, "replies": []}, {"body": "For those of you commenting that Apple probably owns the judges, you may be right in this instance. But I can tell you, there is one court district in the US that Apple is absolutely terrified of, the Eastern District of Texas. They're so scared, that Apple closed every single store operating in this district in 2019. Not because those stores weren't making money,  some were huge money makers in bougie, affluent North Dallas suburbs.\n\nI won't get into a deep dive here, but a Supreme Court ruling said patent cases could only be tried in the district where you do business, and Apple noped right the fuck outta that district and shuttered all retail sales there after that ruling. Eastern District of Texas used to be where nearly every US patent case was tried, down in small town Tyler, TX. They were incredibly rigged in favor of patent trolls. So no stores there means no patent troll lawsuits there.", "score": 33, "replies": [{"body": "North Dallas still has Apple stores,The Galleria store is still there.", "score": 2, "replies": [{"body": "Plano and Frisco stores closed as well as any others in the Eastern District of Texas. The Knox Street, North Park, and Galleria locations that are still open are in the Northern District of Texas circuit. Forgive me for not being clear as Plano and Frisco are sometimes referred to as North Dallas even though they are not even in Dallas county or the same court district.\n\nTldr: Overlay a map of the Eastern District of Texas and Apple store locations. Notice there are no Apple stores there after the 2017 Supreme Court case TC Heartland v. Kraft Foods. They all went bye bye. Why do you think that happened?", "score": 17, "replies": []}, {"body": "Shhh, facts bah!", "score": 0, "replies": [{"body": "The open Galleria Apple store he is referring to is NOT in the Eastern District of Texas. It is in the Northern District of Texas.", "score": 5, "replies": []}]}]}]}, {"body": "Priced in ![img](emote|t5_2th52|4275)", "score": 48, "replies": []}, {"body": "Less features same price", "score": 53, "replies": [{"body": "Fewer", "score": 73, "replies": [{"body": "Thank you for this. \n\nFewer when quantifiable. \n\nLess when unquantifiable.", "score": 58, "replies": [{"body": "TIL, English is my second language and i had no idea about this, so thanks", "score": 13, "replies": [{"body": "Most native English speakers don't know this either. Until Game of Thrones taught them.", "score": 7, "replies": []}]}]}, {"body": "Less fewer same price", "score": 20, "replies": [{"body": "~~Less~~ More fewer same price", "score": 7, "replies": [{"body": "more less fewer price same", "score": 7, "replies": []}]}]}]}]}, {"body": "Sooo calls?", "score": 6, "replies": []}, {"body": "knee glorious bike murky office attractive mighty unused busy nine", "score": -8, "replies": []}, {"body": "Imagine thinking you were bigger than federal law that regulates medical devices and their approval to be sold in the market … 🤡🤡🤡", "score": -49, "replies": [{"body": "I mean, they kinda were let off the hook with a slap on the wrist.  Lol.", "score": 39, "replies": [{"body": "Watch on the wrist now available to cover any marks from the slap", "score": 4, "replies": []}]}]}, {"body": "So will this drop Apple price or no? Bad news but not unsalvageable", "score": -10, "replies": [{"body": "Priced in", "score": 15, "replies": []}]}, {"body": "What happene?", "score": 1, "replies": []}, {"body": " ‘Ñ", "score": 1, "replies": []}, {"body": "Are they gonna drop the price?", "score": 1, "replies": []}, {"body": "I need my new apple watch finally couldn't wait anymore to post on IG", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1986afb", "created_utc": 1705420881.0, "score": 72, "upvote_ratio": 0.83, "num_comments": 98, "comments": [{"body": "So either that 120k AMD guy is the luckiest person of the year or he knew that the upgrades were coming.", "score": 17, "replies": [{"body": "his shit expired like 2 days before amd started skyrocketing ![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}, {"body": "No matter what happens good or bad NVDA always goes up . I stopped trying to understand why at 350.", "score": 72, "replies": [{"body": "It’s fairly easy to understand.", "score": 14, "replies": [{"body": "Feel free to enlighten me.", "score": 6, "replies": [{"body": "It’s trading cheaper than when it was $300 based on their growth. Check their revenue from year’s past and projected revenue. The stock is technically cheap.", "score": -9, "replies": [{"body": "Yeah you talking about Forward P/E which are usually either projected earnings for the upcoming 12 months or the next full fiscal year.\n\nSo basically, optimistic investors can always push hope for next quarter if the company has bad news.\n\nIt works as long as the narrative maintain.\n\nSo it's a great price to buy now till the market deems it's not or till the future doesn't look bright anymore and the narrative changes. Consecutive bad quarter might do that or only one .It will depend on how the  narrative is viewed by investors.\n\n\nNVDA has had great earnings. Right now, it seems, the future it's very bright. And if it's not, maybe the next quarter will bring hope.\n\nMaybe I do understand.", "score": 2, "replies": [{"body": "what do you think, how long will Nvidia continue going up 🤔", "score": 1, "replies": [{"body": "It will grow as long as their guidance and earnings are good to justify it. One bad earnings, thing can shit very quick", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Somehow TSM is flat today. Not sure if this theory passes the sniff test.", "score": 13, "replies": [{"body": "You're most probably right.\n\nInstead of writing the explanation here, I updated the post above.\n\nSorry for the inconvenience.", "score": 2, "replies": []}]}, {"body": "how does Su Bae get more and more good looking every time I see her?", "score": 19, "replies": [{"body": "Looking through the lenses of the sweet $$$ tinted glasses", "score": 4, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|315|**Previous Best DD**|\n**Account Age**|6 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 7, "replies": []}, {"body": "AMD with a PE of 1,115.  What could go wrong?", "score": 10, "replies": [{"body": "I will be buying puts at the end of the month and into February. Super long dates and way OTM … let’s see if I get a pay day on delta + Vega come summer time", "score": 2, "replies": []}, {"body": "This isn't their true PE ratio. It's complicated because of its acquisiton of xlinix. Their real PE is is like low 50", "score": -1, "replies": [{"body": "50?  How did you come up with that?  Curious.", "score": 1, "replies": [{"body": "I was way off.\n\n77.4\n\nhttps://www.macrotrends.net/stocks/charts/AMD/amd/pe-ratio", "score": 11, "replies": [{"body": "Which is pretty close to NVDA's PE", "score": 2, "replies": []}]}]}]}]}, {"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": [{"body": "Thank you, kind sir.  \nThat explains why my original comment was downvoted.", "score": 14, "replies": [{"body": "Do you know what 5th percentile is … have you ever taken a test scored in percentiles???\n\n95th percentile means you’re in the top 5… better than 95% but not better than 5%\n\n5th percentile means you lick doorknobs and drool on yourself ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 12, "replies": [{"body": "🤣\n\nTrue.  \nRealizing this made me laugh, and I feel even prouder about it.\n\nI do belong within the 5th percentile.\n\nThank you.", "score": 3, "replies": []}]}, {"body": "u/AutoModerator If I made a very nice pile of money with this play based on the setup alone, but the reason I found *after* entering the play was not the actual catalyst moving the stock... does that make me less intelligent or more?", "score": 1, "replies": []}]}]}, {"body": "Why AMD goes up 8% while NVDA up just 3% today?", "score": 6, "replies": [{"body": "You should consider what those percentages represent in capitalization terms.", "score": 16, "replies": []}, {"body": "amd had an analyst upgrade.  op is supremely regarded.", "score": 3, "replies": [{"body": ">amd had an analyst upgrade.  op is supremely regarded.\n\nI already schooled you on your mistake that what you call an 'analyst upgrade' is not an analyst upgrade but a price target increase.\n\nEither learn to be humble and more respectful, or at least get the terminology right if you're going to attempt to act like a Mr. Know-It-All.\n\n\\-----\n\nAs for anyone else reading this comment:\n\nYeah, it is true that AMD received three price target increases today.  \nAnd I agree that those will greatly influence the action today.", "score": 3, "replies": [{"body": "> I already schooled you\n\nyou really didn't.  you got caught making absurd conclusion jumps and then ludicrously tried to split hairs... but still fucked that up by having to use synonyms for upgrade, yourself.\n\n>Yeah, it is true that AMD received three price target increases today.\n>And I agree that those will greatly influence the action today.\n\n...imagine claiming you schooled me and then closing by conceding the actual point.", "score": 6, "replies": [{"body": "ROFL op got OWNED ROFL", "score": 2, "replies": []}, {"body": "You keep being unable to understand.\n\nI didn't argue about the importance of the price target increases. Sure, if it makes you feel better, I can say I've conceded.  \nI never argued about that in the first place, and I've already updated the post and the original comment to address the facts.  \nI'm not arguing against the facts.\n\nLikewise, it's a fact that a price target increase is different than an analyst upgrade. It could be as easy as you saying, \"Ok, I called it an analyst upgrade, but I meant a price target increase. Whatever, the point is that's what moved AMD today, not what you wrote.\"  \nAnd then I would say, \"Yeah, I know. That's why I updated the post.\"\n\nYet you keep arguing that. And now you're arguing about the impact of the actual bill with someone else, too.\n\nBut you know what, here's the bottom line:\n\nUnlike you, my priority isn't to win arguments against internet strangers. I don't even care about being right about the post. I don't feel bad, knowing I had to update it and correct my initial thoughts. Because my priority is to make money, and I made a good bunch today.\n\nI would advise you to use that approach as well.  \nDid you make money off AMD today, too? That's the important thing. That's what you should care about.\n\nAnd I know you'll probably go into defensive mode and try to impress me and keep arguing because you feel it's a competition somehow.\n\nTake a step back, relax, and focus on how you can use your ability to make money, not on how you can \"win\" arguments against internet strangers.", "score": -1, "replies": [{"body": ">Take a step back, relax, and focus on how you can use your ability to make money, not on how you can \"win\" arguments against internet strangers.\n\n...you made this thread because your comment was downvoted, you were butthurt about it, and you apparently wanted to \"win arguments\" on reddit.\n\nsurprise, you were wrong.  it wasn't about the bill.  which you claim you didn't argue, but there are ~10 posts that explicitly state otherwise.\n\nffs, you're still trying to claim some win of... semantics (upgrade).  but you even fucked that up, too.", "score": 2, "replies": [{"body": "I made this thread because I thought I was helping others realize an unknown catalyst.\n\nGranted, I made a snarky remark about how my original comment was downvoted, but that's because it amazes me how people downvote comments based on their length, not the actual content.  \nYou could say that the content, in the end, proved to be worth those downvotes. Fine, the snarky remark backfired on me.\n\nNow, yes, indeed, the catalyst that fueled AMD's move was not the one I wrote about. And therefore, yes, I was misguided.  \nI could argue that the catalyst I mentioned is still valid, but I agree that the reason behind today's move was the price target increases. And NOT the one I wrote about--or at least not directly.\n\nYou keep believing I'm arguing that situation--even though I updated the post AND the original comment hours ago. I'm not debating that. I never did.\n\n&#x200B;\n\nFrom the first moment, what I told you was there weren't any analyst upgrades on AMD today. There were three price target increases.\n\nI admit my original answer about that was not ideal, but it was a knee-jerk reaction to your attitude. You're simply not likable.  \nAnd I'm still right about *that*.\n\nWhy? Because if you're unwilling to understand there's a difference between an analyst upgrade (outperform, buy, overweight, etc.) and a price target (they have a $ as in $200), and you believe those are semantics or they are the same thing... well, I give up.\n\n&#x200B;\n\nFinally...\n\n>still trying to claim some win\n\nIn the end, my win was the fact that I made money playing AMD.  \nDid you make money, too? I hope so.  \nOtherwise, are you able to understand that I prefer to be the guy who made money today instead of being the guy who won an argument with an internet stranger?\n\nI already won. I made money that will last way more than tonight--which is how much it'll take me to forget you exist. Can I suggest and advise you to do the same? Forget about me, man. Move on.\n\nFocus on making money, not debating and attempting to ridicule strangers.  \nWinning this argument--which you keep arguing, even though I conceded hours ago--doesn't make you money. Focus on making money.\n\nHave a great day.", "score": 0, "replies": [{"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "Exquisite timing. I'll ride with my AMD cash into the sunset.  \nThank you again.", "score": 3, "replies": []}]}, {"body": "yeah, no one's reading all this.", "score": 1, "replies": []}]}]}]}]}, {"body": "These folks in the comments are regarded as fuck, analyst prob rose price target on the same news youre sharing... \n\nGood share OP, I didn't realize how many implications that 2024 bill has. I was already reading up on the changes to 401k catch up contributions", "score": 2, "replies": [{"body": "> These folks in the comments are regarded as fuck, analyst prob rose price target on the same news youre sharing... \n\n...yes, keybanc thinks that amd should be trading at 195, gaining ~$100B in cap, because of possibly paying less in taxes for a small percentage of their workers.\n\nseems plausible!", "score": 2, "replies": [{"body": "https://preview.redd.it/iqgwk67prucc1.png?width=1440&format=pjpg&auto=webp&s=f0283aa6e959f9313610dd024b9829b3bf4bd740\n\nDid you read this part on R&D expensing, fixed asset expensing, and the less tax to the business itself or are you just being a willfully ignorant dumbass?\n\nDon't know if you know how basic cash flows works, but all that would make amd cash flow go up. Up is good for you regarded folks.", "score": 2, "replies": [{"body": "tell me you know nothing about amd without literally telling me.  exactly which parts of this are worth ~$100B?  oh, right.  none.  ffs, amd has ~zero debt and ~$6B r&d/year.  you don't know shit.\n\nffs, even op admitted it was the analyst upgrades and not this shit.  he already conceded, but keep on fellating.", "score": 0, "replies": [{"body": "Read all my posts. I never argued that the price target increases were not the main reason AMD was moving *today*.\n\nI taught you that what you call 'analyst upgrades' are actually called price target increases. There's a difference.  \nAnd if you're playing the role of the Mr. Know-It-All who wants to make fun of everyone else's intelligence, it should benefit you to use the proper terminology.\n\nAs far as your debate with u/Ramkanttt, he knows what he's talking about. This bill--which you call a useless nothingburger--can potentially become a catalyst. If it hasn't worked as one already.", "score": 2, "replies": [{"body": "> . I never argued that the price target increases were not the main reason AMD was moving today.\n\nhence, you conceding, since it's contrary to this dumb thread, where you claimed it was the bill.\n\n\n>As far as your debate with u/Ramkanttt, he knows what he's talking about. This bill--which you call a useless nothingburger--can potentially become a catalyst. If it hasn't worked as one already.\n\nffs, you guys are so eager to receive priase that you immediately grab pom-poms.  just as he fucked up by e-felllating your wrong point, you're now e-fellating him for being wrong.  and he already conceded it and joked about it.  \n\nlolz @ being so desperate to get praise/prove me wrong that you double-down on idiocy and champion a point that was already btfo.\n\n50 minutes prior:\n\n>I mean the tax benefit on $6b in R&D is $2b and that's just 1 year. You realize AMD is trading on a 1200 PE multiple right? Is it that crazy to assume that cash flow benefit at a 50x multiple? 😂", "score": 0, "replies": [{"body": "Alright. The market has closed. I didn't mind talking with you while babysitting my positions, but I certainly won't waste my afternoon debating with you.\n\nSo, here you go: You've 100% absolutely won, you're great, you probably even made a gazillion dollars.\n\nI, on the other hand, am 100% wrong, I've conceded, I was wrong on all possible accounts, and I made money today but you should've been the one earning all the profits, so I should thank you.\n\nHere, here, I proclaim u/robmafia as the absolute winner of this thread.  \nEveryone should carry him on their shoulders as the victor, while I'll go home, crying with the stack of bills I shouldn't have made because I was 100% wrong. In fact, people should point at me and say, \"LMFAO!\"\n\nYou won the internet today; congratulations. You're a hero.", "score": 2, "replies": [{"body": "show me on the doll where i touched you... apparently, deeply.", "score": 0, "replies": [{"body": "No, you did. It made me realize I could've avoided all this if I had decided against sharing the news I found about AMD.\n\nI would've still made my money. I would've used this time elsewhere.  \nYeah... I'm going to configure my Mac to block me from Reddit if I'm here more than the couple of minutes needed to place my ban bets.\n\nThank you. I mean it, this will help me going forward.  \nThanks.", "score": 1, "replies": [{"body": "> It made me realize I could've avoided all this if I had decided against sharing the news I found about AMD.\n\nbut you never had any news about amd, regard.", "score": 1, "replies": []}]}]}]}, {"body": "*actually!", "score": 1, "replies": []}]}]}, {"body": "I mean the tax benefit on $6b in R&D is $2b and that's just 1 year. You realize AMD is trading on a 1200 PE multiple right? Is it that crazy to assume that cash flow benefit at a 50x multiple? 😂 Kidding but I would def think some of the price upgrade is due to better cash flow projections coming from this bill potentially", "score": 1, "replies": []}, {"body": "*actually!", "score": 1, "replies": []}]}, {"body": "Yep, I could tell you're actually smart, u/Ramkanttt.\n\nHe's been debating with me about workers, but the way I originally saw it is that the U.S. might be moving this bill to curtail China's semiconductor power or help 🇺🇸 in that sector—or both.\n\nTherefore, the ramifications should go deeper than what u/robmafia can grasp to understand.", "score": 1, "replies": [{"body": ">Therefore, the ramifications should go deeper than what u/robmafia can grasp to understand.\n\nlolz @ tagging me in every post after getting rekt and already conceding.  that must be some serious butthurt you have.", "score": 0, "replies": []}]}]}, {"body": "Why do you keep talking about workers?  \nDo you even understand the reach of the bill?", "score": 1, "replies": [{"body": ">Do you even understand the reach of the bill?\n\n...what is this, a 720?  and after i post, you'll be doing a tony hawk impression with a 900?\n\nyou didn't understand it and made this thread.  you even conceded... and then moronically kept arguing.  now you're flailing at a sarcastic comment i made?", "score": 0, "replies": []}]}]}, {"body": "To be fair, I'm a short-term swing trader that hunts early breakouts, and I jumped on AMD based on my setup without considering or even being aware of the price target increases or the bill.\n\nNow, when she started soaring, I researched if there was any news, and I found this bill.\n\nI was quick to share it, which is what eventually triggered this post.\n\nYes, you're right, perhaps the analysts tracking AMD or the sector were fully aware of the ongoing discussions that led to the bill and increased their price targets based on that imminent catalyst.  \nThat's why I decided to keep the post up since it could be helpful for longer-term trades.\n\nBut I'll be honest. I'm not going to argue with u/robmafia about it because as a short-term swing trader, I got in, made bank, and my priority is to make money--whatever the catalyst.  \nWhile his priority is to feel as if he knows more than everyone else, whether he makes money off that knowledge or not.\n\nI'm just letting you know because he's the kind of Redditor who will argue for the sake of arguing, and you, on the other hand, sound much smarter.", "score": 1, "replies": [{"body": "and yet, you just tagged me in to talk shit, anyway.\n\n*hypocrisy intensifies*", "score": 1, "replies": []}]}]}]}]}, {"body": "amd is worth 250b, nvda is worth ~1400b.\n\nnvda only sells twice as much as amd.\n\nassuming similar levels of profitability are technically possible, amd has MILES of runway to catch up.\n\nnvda looks good still but you do have to eventually question how far it can run. bigger than amzn? bigger than goog?", "score": 2, "replies": [{"body": "> nvda only sells twice as much as amd.\n\nyour math is way off.", "score": 1, "replies": [{"body": "im seeing TTM revenue of 44b for nvda, 22b for amd. finviz.\n\nis that wrong?", "score": 1, "replies": [{"body": ">22b for amd\n\nnvda is doing roughly that this quarter.", "score": 2, "replies": []}]}, {"body": "*actually!", "score": 1, "replies": []}]}]}]}, {"body": "The news is irrelevant, NVDA goes up everyday as regarded put buyers keep buying puts.\n\nEverything else is noise and just buy any strike call for any expiration and you win.", "score": 6, "replies": [{"body": "Ehhhh I agree but at these price levels I think way OTM long dated puts might be on the table. \n\nFed liquidity programs start ending late March and corporate real estate defaults are gonna start to mount as people can’t refinance at higher interest rates. \n\nWe still haven’t seen the true impact of rate increases yet. Once debt needs rolled and serviced we’re in for some wild times.", "score": 2, "replies": [{"body": "What does corporate real estate have to do with nvda? The stock is Teflon to any drops in the market right now. Just buy calls", "score": 1, "replies": [{"body": "The entire market will get sold off in a leveraged margin call of over exposure banks to CRE\n\nSame as 2008-2009", "score": 1, "replies": [{"body": "I really don't think we ever see a 08 crash again", "score": 1, "replies": [{"body": "We will. They’re doing the same shit as 08 just in a different sector that didn’t get more regulations … corporate real estate which is a bigger market and more losses will be taken on", "score": 1, "replies": [{"body": "And you expect this in march?", "score": 1, "replies": [{"body": "Sometime between now and earnings reports for Q1 so March / April we should start seeing realized losses on defaulted CRE loans that would crumble CMBS and CRE valuations. \n\nMost of that debt needs rolled 4-5 years at new interest rates. People went bananas 2019-2021… just depends how much work from home hurts them and when loans go into default / can’t be refinanced", "score": 2, "replies": [{"body": "Interesting take for sure. Will keep this on the back of my mind", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "this has literally nothing to do with it.\n\namd got an analyst upgrade this morning.", "score": 3, "replies": [{"body": "🙄 *Sigh...*\n\nOk, so who's the wunderkind analyst whose upgrade makes AMD go up 8% from her open? The last analyst upgrade I have is BofA Securities on Dec 15 and Melius on Jan 8.\n\nWho made the upgrade this morning?", "score": 4, "replies": [{"body": "From IBKR news:\n\nKeyblanc $195\n\nBarclays $200\n\nSusquehanna $170", "score": 3, "replies": [{"body": "Yeah, but he said 'analyst upgrade.'\n\nThose three are reiterated actions.  \nThose three changed the price target, yes, but they didn't upgrade.", "score": -2, "replies": [{"body": "...the one who thinks this bill moves amd 8%, because whatever additional taxes associated with taiwan surely would be worth ~$35B to amd,  amirite?", "score": 3, "replies": []}]}]}, {"body": "keybanc, regard.  this morning.\n\ngood lord, you suck at this.  did you even look?  it's not like this was hidden, it's been posted ~everywhere.  ffs, it's right in the tos newsfeed for amd\n\nand there have been WAY MORE than that since 12/15.  are you TRYING to be this terribad?", "score": -1, "replies": [{"body": ">good lord, you suck at this. did you even look?\n\nThose weren't analyst upgrades.  \nThose were price target increases.\n\nDid they influence? Sure.\n\nBut you said:\n\n>amd got an analyst upgrade this morning.\n\nWho did the upgrade?", "score": 0, "replies": [{"body": "> Those weren't analyst upgrades.\n> \n> Those were price target increases.\n\nit was already overweight, regard.\n\nwhat are they supposed to do, make up a new category?  superduperweight?  \n\nbut right, it's probably about some \"main street\" bill.  and because amd has just so many employees in taiwan.  /s \n\n ffs, if amd had enough employees in taiwan to jump 8% from this, they'd be better off being based in taiwan.", "score": 2, "replies": [{"body": "Hence my 🙄 *Sigh...*\n\nYou said all of this was because of an analyst upgrade this morning.  \nBut there's none.\n\nHere's the thing. You think you're a hot shot, but you clearly misinterpreted a price target increase with an analyst upgrade.  \nYou did, those are facts.\n\nNow, do I accept that three price target increases influenced AMD's move? Sure. I'm not debating that.\n\nDo I still think the news I shared is a catalyst? Yes.\n\nBut you came in swinging, saying it was an analyst upgrade.  \nThat didn't happen.\n\n**You confused an analyst upgrade with price target increases.**\n\nAnd I'm taking you down a notch to let you know you're not as smart as you think.", "score": -2, "replies": [{"body": "imagine trying to split hairs while you didn't even know this happened (or you would have brought it up in the first post, captain verbose) and made a slew of jump to conclusions.\n\nbtw, i didn't confuse shit.  it's a pt upgrade, arrogant regard.\n\n>And I'm taking you down a notch to let you know you're not as smart as you think.\n\n...says the one who thought this was due to some nothingburger bill that's completely irrelevant, made a post about it, got butthurt about its feedback, and then made this dumb thread about it?  ffs, do you think amd is 90% taiwan?  in what universe would that bill move amd 8%?", "score": 1, "replies": []}]}, {"body": "*actually!", "score": 1, "replies": []}]}]}, {"body": "*actually!", "score": 1, "replies": []}]}]}, {"body": "*actually!", "score": 1, "replies": []}]}, {"body": "Theres a lot of misinformation going on about AMD on the net, thats why the stock goes up.\n\nThere's a cold shower waiting for them in 2025 though.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "...the usa wants them here.  the usa has to incentivize it.  otherwise, tsmc has no reason to be here.  it sure as shit isn't cheaper for them and it's a massive conflict of interest (weakens silicon shield).  \n\nand that's before pipe fitters decided that they know more about building cutting edge fabs than the company with cutting edge fabs.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "> based on how secretly complicit TSMC is with violating the semi trade embargo, will probably never happen. \n\noh, please.\n\nyour tin foil hat is on fire.  stop smoking meth with it.", "score": 2, "replies": []}]}]}]}, {"body": "This doesnt explain why MSFT is up today.\n\nI just think people are still excited about AI and are pre-positioning before tech earnings next week.", "score": -2, "replies": [{"body": "Yeah, it also doesn't explain why a biotech like CORT is up 9%.  \nIt also doesn't explain why a coal company like METC is down -12%.", "score": 0, "replies": [{"body": "You would think TSM would be up big today if this is a catalyst.  TSM would be the biggest beneficiary for this tax change.  Instead, it is barely up today.", "score": 1, "replies": []}]}]}, {"body": "Congratulations or sorry this happened to you.  I’m kidding, I read it.  I love when politicians have to tell you that whatever scheme they are hatching is “common sense”", "score": 1, "replies": []}, {"body": "Dont forget about Nividia's half a billion dollar AI GPU order they secured. That dont effect AMD though", "score": 1, "replies": []}, {"body": " \n\n* **Help families get back on their feet** with disaster tax relief covering recent hurricanes, flooding, wildfires, and the Ohio rail disaster**.**\n\n**I still don't understand how the bill aims to help those who got hit by disasters. Do you look at this gov blog everyday?**", "score": 1, "replies": []}, {"body": "I sold nvda at 456…. Im an idiot", "score": 1, "replies": []}]}
