{"title": "Time to dump NVDA?", "selftext": "Another 52 week high, reading lots of hate, should I sell and reinvest to something with more growth or just leave it to fester?  Taking all suggestions but I lied when I told the app “oh yeah options I totally understand the risks”", "id": "199rhdt", "created_utc": 1705588404.0, "score": 151, "upvote_ratio": 0.87, "num_comments": 94, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|2 years ago\n**Total Comments**|47|**Previous Best DD**|\n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "I’ll just say this…. It depends but don’t ever feel bad about taking profits\n\nYou can never time it at the top any if you made good money don’t be afraid to take your gains", "score": 125, "replies": [{"body": "sanest wsb comment i‘ve read today", "score": 6, "replies": []}]}, {"body": "time to buy 30 more shares and sell covered calls", "score": 62, "replies": [{"body": "Dream ", "score": 3, "replies": []}, {"body": "Covered calls are a bastard. It seems like such a no brainer racket but can get your ass absolutely handed to you.", "score": 3, "replies": [{"body": "Not if you’re selling atm already in profit, or otm where you would have profit. If you get assigned you make money. If you don’t you make money. Unless the underlying just tanks or your selling deep itm you make money?", "score": 13, "replies": []}]}, {"body": "Yes , sell covered calls on a stock that only goes up , you will lose all the profits for some cheap premium and then enter at higher price and cry .", "score": -13, "replies": []}]}, {"body": "First off all you invested 10k sell 20k and keep the rest", "score": 55, "replies": [{"body": "Facts. Make a profit, continue investment.", "score": 26, "replies": [{"body": "That would be the less stressful way and thats exactly why we invest in the first place.", "score": 8, "replies": [{"body": "Lmao i’m convinced a majority of this page invests strictly to troll or meme on people.", "score": 11, "replies": [{"body": "Greed fuels a lot of WSB", "score": 7, "replies": []}]}]}, {"body": "You could even invest in NVIDIA!", "score": 1, "replies": []}]}]}, {"body": "IMO at least take out initial investment", "score": 17, "replies": []}, {"body": "paper hands make bands", "score": 42, "replies": [{"body": "I put an 8% trailing stop on mine and that’s what I’m going to roll with. I’ll take it as long as I get my 10% minimum profit.", "score": 6, "replies": []}]}, {"body": "Sell then play NVDA options like a man", "score": 8, "replies": [{"body": "I’m down…..how would I do that", "score": -6, "replies": [{"body": "Downvoted for being right smh", "score": 2, "replies": []}]}]}, {"body": "Zuckerman just announced the purchase of billions of dollars worth of their AI chips", "score": 9, "replies": []}, {"body": "Good enough to screenshot good enough to sell. $40,000 lesson here on $500", "score": 17, "replies": []}, {"body": "Take your original investment amount out. And the rest is yolo money in NVDA.", "score": 12, "replies": []}, {"body": "Wait till after earnings", "score": 4, "replies": []}, {"body": "Nope.  Hold on bud.  Msft reports at end of month.  This will fly with it...", "score": 8, "replies": [{"body": "Ok you sound like you know what you’re doing, should I do like 10k worth of calls? Is it too late to do that?\n\nWith what amounts to my initial investment", "score": -11, "replies": [{"body": "Yeah he clearly know what he's doing. \n\nWendy's or Tendies. \n\nTake out the biggest loan you can.", "score": 3, "replies": []}]}]}, {"body": "Dump 1/4 and hedge against the fall oh wait this is WSB hold until millionaire", "score": 3, "replies": []}, {"body": "Something with more growth??? Like what?? NVDA is just growing", "score": 7, "replies": [{"body": "I figure something else is gonna do a 300% run while Nvidia runs out of steam \n\nApparently nothing Chinese, that shit ain’t working out", "score": 8, "replies": [{"body": "And we all know which stock it's gonna be. And none of us are gonna tell you.", "score": 2, "replies": [{"body": "But which one though, there are so many", "score": 2, "replies": [{"body": "Every but one you hold", "score": 1, "replies": []}, {"body": "Intel", "score": 0, "replies": []}]}]}]}]}, {"body": "I honestly wouldn’t man, I work in the industry but I’m only new so I’m not expert by any means but I work closely with people who genuinely are and the only way is up for NVDA", "score": 4, "replies": [{"body": "This is how you know the price is at a premium though, everyone knows it's a sure thing which has jacked the price up.\n\n\nI have little doubt NVidia will continue to grow, but their growth will level off, and it's an open question whether the market will punish them for a mere 20% growth or whatever it settles at.", "score": 2, "replies": []}]}, {"body": "Can’t lose", "score": 2, "replies": []}, {"body": "yeah man, thats money on the table all for you... You better take it all right now!", "score": 2, "replies": []}, {"body": "Don’t short accelerated compute, coming from engineer in semiconductor industry. Investment in the space is massive. Also my grandma yoloed 300k into Nvidia awhile again and now her position is worth 1.4M. Love that lady!", "score": 2, "replies": []}, {"body": "Yes", "score": 3, "replies": []}, {"body": "Yes", "score": 2, "replies": []}, {"body": "Nvda is the one. I think it doubles atleast.", "score": 3, "replies": []}, {"body": "I won’t sell, because then, what other stock would I buy with it?", "score": 3, "replies": [{"body": "Why not sell 20k thats 100% return lol. He could keep the remaining", "score": 11, "replies": [{"body": "What's he gonna do with 20k though buy a boat?", "score": 0, "replies": []}]}, {"body": "This is my problem", "score": 2, "replies": [{"body": "It’s had such a run up, that maybe a 15% trailing sell of part of our investment, might be the way to go.", "score": 2, "replies": []}]}, {"body": "SCHD", "score": 0, "replies": [{"body": "Or SPHD", "score": 0, "replies": []}]}]}, {"body": "Time to dump your wife.", "score": 2, "replies": [{"body": "Woa, gun to a knife fight….Jesus", "score": 5, "replies": []}]}, {"body": "N'obtint to add more it's going 1k", "score": 1, "replies": []}, {"body": "sell half at most", "score": 1, "replies": []}, {"body": "lol I’d cash 60 stocks out or something like that", "score": 0, "replies": []}, {"body": "Take out what you invested originally if you really want to and let the rest ride", "score": 1, "replies": []}, {"body": "How long have you held those shares? I would wait until you clear enough time for capital gains", "score": 1, "replies": [{"body": "How long is that? A year? I’m well clear of that", "score": 1, "replies": [{"body": "Yes. \n\nThen it’s a-ok to sell whatever you want. But theoretically, you shouldn’t unless you are bearish on the stock going forward. Because the core principle of compounding interest is that you want as much money as possible exposed to the market for as long as possible. But I’d sell a nice chunk and diversify more.", "score": 1, "replies": []}]}]}, {"body": "I would protect myself to the downside with puts or unload and diversify. \n\nPersonally I’d sell here in chunks over the course of 1-2 weeks in case it has any more leg up. \n\nThen figure out the next play", "score": 1, "replies": []}, {"body": "Damn you gotta get the next 30 shares and buy atm put to lock in gains. The covered call central baby! Congrats", "score": 1, "replies": []}, {"body": "Pigs do get slaughtered", "score": 1, "replies": []}, {"body": "Nvda has a good 5-10 year horizon on their AI chip strategy. However it might have reaped the AI bump for the short term and as AI based valuations come back to reality it makes sense to take some profit now while things are still high.  I'd want to keep half that in play in case AI expansion is bigger than we expected and their piece of the pie grows.\n\nCongrats on capturing a good sized lot at a great price.", "score": 1, "replies": []}, {"body": "Sell", "score": 1, "replies": []}, {"body": "Take some gains", "score": 1, "replies": []}, {"body": "SELL", "score": 1, "replies": []}, {"body": "If you think people all over the world, are going to suddenly stop using computers. Sell, if not though, pump, pump, pump it up. IMO 🦍", "score": 1, "replies": []}, {"body": "If NVDA makes a correction below $545 I would dump it, otherwise it has room to grow the same amount it gained recently after the correction is made assuming it never goes below $545 soon", "score": 1, "replies": []}, {"body": "Leave 50 shares when it splits you will more than you started with", "score": 1, "replies": []}, {"body": "Sell CCs", "score": 1, "replies": []}, {"body": "are ou insane? it's only up 300%, still plenty of room ro run", "score": 1, "replies": []}, {"body": "Sell calls forever", "score": 1, "replies": []}, {"body": "Rookies.", "score": 1, "replies": []}, {"body": "Same here lol reverse hs accumulation. I have a little over 1,000 managing. I’d sell some before eom FOMC and grab a few 100 b mining risk rewards oversolds, maybe some cancer cures, but not completely close out. It’s a meme now. Ya never know peak, offering, or short news ya know. Maybe tsla dip even..may see 100s soon or promo to 400s", "score": 1, "replies": []}, {"body": "If I were you I probably would have sold a while ago lol. You got very lucky. I’d take ur gains man, at least sell the original 10K and let the rest ride. But for the love of god please take some profit", "score": 1, "replies": []}, {"body": "Sell and buy AMD. Team red burning rocket fuel", "score": 1, "replies": []}, {"body": "Get off of Reddit, it’s amazing you made it this far.", "score": 1, "replies": [{"body": "I have other cool stuff", "score": 0, "replies": [{"body": "Whatever that means lol. Stop looking for investment advice on r/wallstreetbets", "score": 1, "replies": [{"body": "But you do have something right? Like as opposed to someone with nothing giving out advice?", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I have no idea what any of that means but I’ll do it if you walk me through what buttons to press on robinhood", "score": 2, "replies": []}]}, {"body": "No don’t ever sell that you’ll never get that cost basis ever again", "score": 1, "replies": []}, {"body": "Market can continue going up but at this point it would be speculation given valuations are getting really expensive. Since you originally bought as an investment then it would be wise to take at least half and keep the other half if you still feel like keeping a position for the likes of more growth. The question you must ask yourself , how much more till I’m satisfied ? If you don’t trade for speculation, you should invest in another business with sustainability, that you can collect some dividends.", "score": 1, "replies": []}, {"body": "I had plug bought at 2$ and it went up to 61$ . I was in 17k profit. I kept holding while it steadily dropped. Now its back to 2. I would say book profit and invest in etf or mutual funds.", "score": 1, "replies": []}, {"body": "No!! Hold _ meta potentially buying 350k of there super chips … that’s one company in an ocean of other companies drafting contracts … 2024 … I would try to hold at least 90percent of that screen shot till  2027 Dec.wk4 2028 Jan.wk4 … haters probably have sensible reasons question is will it perform… do you think there going to advance on high performance track for another two decades ? Even with the heat there getting I think there going to be there with a 2031 moon landing … up to you dude … I would buy it today if I could at 600 a share just saying", "score": 1, "replies": []}, {"body": "How can you not dump it?  \n\nThere so many better deals out there compared to NVDA.  \n\nGreat company, but it is priced for absurd levels of performance.  It could happen, but I prefer setting the bar lower and buying quality companies that are priced for poor future performance.\n\nCompanies like VFC, AAP, KD, and CPS are all quality businesses that happen to be priced incredibly harshly.  Even PYPL and MMM seem like reasonable bets right now to me.", "score": 1, "replies": []}, {"body": "Well, after less than 3 weeks...    The in-your-head math is pretty simple. Let's see 70 shares times about 100 dollars is about $7000 profit. Taxed at 24% for short gain so $240 per thousand...  might as well call it $250 to ballpark...   4 250s is $1000 and the other 3 250s is $750 so $1750 to savings to pay the federal tax, no state tax in WA. Call it $2000 because it never hurts to put aside a little more and it makes the math super easy. So $7000 minus $2000 is an even $5000. I'd say it was worth holding. If you are really concerned, how about a stop loss order? Maybe if it falls 10-15%? BTW, looking at your screen, Most of us would really like to have your problem! I should put a stop loss in place for my NVDA and for my gobs of LLY. I almost never buy AAPL but I had to with the drop to $180 or so. Dragged my feet and had to pay $185 by the time I had decided. Dumped it in my kid's (18 y/o) college fund like a turd! He hates AAPL on philosophical grounds because it is a walled-garden. I cringe to think that I was just as bad, as idealistic, at his age, but I know I was. Seems the Apple doesn't fall far from the tree?  I told him iPhone users like myself and his mom would as soon change cars as operating environments. Mazda and Subaru for us and we love them! Apple has a moat. It has a safety net. It won't drop like crypto—it will drop like a slow feather if it drops at all.", "score": 1, "replies": []}, {"body": "He was asked’how did you get rich in the stock market?’\nHe replied ‘ I always sold too soon. ‘", "score": 1, "replies": [{"body": "That’s smart but I’m also holding for an arbitrary 50k out  and missed the 830 bump. Currently at 45k @786", "score": 1, "replies": []}]}]}
