{"title": "talk me out of it.. please (looking for advice)", "selftext": "i am sick of earning less than 1%.\n\ni have a savings account ( for a house someday ), and i am sick of earning $27 on a $27000 balance. what if I sold a put to make a possible 25% return on my money ? \n\nidea is to sell the AAPL jan 2017, $150 put for a 38.70 credit. \n\ntotal premium is 3870. \ncash secured, so balance required  = $15,000.\n\nif it is exercised, i will own appl at 150-38 = $112.\n\nif it expires worthless, i would make 3870/15000 * 100 = 25.8% return on my money. \n\ni am not playing with all our savings. one small account and that too only $15k worth. \n\nam i being greedy \n\nps: looking for honest advice. this is not a yolo trade. thanks in advance   ", "id": "2vi3fz", "created_utc": 1423628888.0, "score": 6, "upvote_ratio": 0.88, "num_comments": 15, "comments": [{"body": "Honest advice? Run away from the trading screen when you get these kind of thoughts. While Apple and the market are doing great at the moment, that is almost certain to change before 2017. I've been around the markets a long time, and this is the kind of thinking that occurs at major market tops, at a major top in a big name stock.\n\nAt market tops, conservative investors with money in the bank, all of the sudden feel like they are missing out and jump into the market or a particular stock at all time highs. The usual result is a big loss for the novice. The particular fundamentals may not even matter. It is what tends to happen at tops.\n\nWhat if there is a market correction (hasn't been one in six years)? Apple goes down 20%. What is your plan then? What if there is a bear market and Apple gets cut in half and your $15k becomes $10k? What is your plan then? To tell your spouse that you are a stupid idiot and to ask forgiveness? Are you willing to risk that for a max possible 13% per year upside? If not, you aren't ready for this trade.\n\nAgain, my advice for novices is to trade small, and keep it simple. Dumping so much capital into a 2-year play is neither of those.\n\n/edited for math error, with a 50% decline in AAPL, the put seller would have $10k left. The $6200 value of 100 shares, plus the original put premium (which was around $3800 before today's bump higher).\n", "score": 10, "replies": [{"body": "> At market tops, conservative investors with money in the bank, all of the sudden feel like they are missing out and jump into the market or a particular stock at all time highs.\n\nVery astute point.  Thanks for the perspective and reminder.", "score": 2, "replies": []}, {"body": "Nicely put.", "score": 1, "replies": []}, {"body": "thank you for your reply. and i really appreciate your advice. just frustrating earning next to nothing with savings account. \n\nwhile i am still learning (there is so much to learn), i am not a noob either. just that i have always played it safe (defined risk)  within my IRAs. as some have mentioned elsewhere on this sub-reddit, dough.com's first trade is selling a naked put.... which doesnt make sense. \n\n", "score": 1, "replies": [{"body": "As much as you want to get more yield, I highly advise you to stay away from the type of thinking above.\n\nI don't want to discourage you from investigating these strategies, as everyone starts somewhere.  And most of us lose a lot of money learning our lessons, so the key is to keep things VERY small to start out with.\n\nAlso, I don't think there is much further of a jump you could go from than from savings account to options.  I mean if you want to look at a return and are bullish appl, it was 90 dollars in octoberish of last year, so you could have made 50% just outright owning some of the stock.... I would also advise you to diversify.  Even sure things can behave irrationally.  At least with stocks you can just hold on to them a while, with options you feel that dread approaching.  I mean aapl has had a history, despite great results of dropping huge amounts.  I remember when it was 600 thinking 500 looked like a pretty good buying opportunity, and wham, it drops below 400.  Obviously it came back up, and would be 889 today, if not for the split, but if you had 600 leaps, I'm not sure it would have recovered in time, certainly not enough to make back your premium... (though the put strategy likely would have been ok in that instance...)\n\nAlso, if you want to make a directional bet out that long, why not look at a spread of some sort.  If you think it is going to close that high, why not look at a bull call spread instead, or even a covered call.  Essentially buy the stock today at 125-127ish, sell the jan 17 150 for 12, and you don't need to worry about your margin requirements, and worst case you are holding appl stock at a price around 113-115 (pretty similar to your put example).  You also get to participate in any dividends aapl decides, if any.  \n\nI always think of a collegues brother who got hooked on put writing after making millions in the last 90's.  He fell much faster than he rose.  It is very hard, especially after initial success to keep going slowly with options.  And even if this trade makes money, it will probably give you the false confidence to risk more next time, and wipe out all the gains + potentially other money.\n\nThe other issue I have with this strategy, is the spreads on the bid and ask going out 2 years.  They are quite wide, so that means that buying as the price goes up you are hurting yourself, and same goes for exiting a position on the way down when you decide you really don't want to buy aapl stock at 150 when it is valued at 100 (assuming it goes against you).\n\nCould it work?  Ya.  But this sort of trade certainly isn't appropriate for someone coming from investing in a savings account.\n\n\n", "score": 3, "replies": []}]}]}, {"body": "The probability of expiring worthless is pretty low.  And even if it does, your returns are over two years.  Anualized, it is only around 13%.", "score": 2, "replies": [{"body": "i know dough.com has a way to calculate probability. is there another way to know? thanks for your reply.", "score": 1, "replies": [{"body": "I used the delta as a proxy for probability.  Those numbers aren't the best two years out, bit it is the best we've got.  BTW, that position is synthetically the same as a covered call at the 150 strike.  If our going to cash secure the position, you might be better off with the covered call as you'll collect a dividend on the long stick position.", "score": 2, "replies": [{"body": "> position is synthetically the same as a covered call at the 150 strike.\n\nbut if i write the $150 call the premium is $10.00 vs $38.xx for the put. \nmax profit would be $150 - $122 = $28+$10 + dividents .. \n\nmakes sense now :)\n ", "score": 2, "replies": [{"body": "Selling an itm put also gives you the dividend : it's priced in.\n\nThis whole thing makes no sense. Basically, it has got nothing to do with options, just investing in Apple. Fine if you want to invest 15k in AAPL, but don't compare it with saving.\n\n", "score": 2, "replies": []}]}]}]}]}, {"body": "As others have said, options probably aren't where you want to look.\n\nIf I were you, (I'm not telling you what to do, just what I would do in your position) I would look at an ETF like AOA, which is an aggressive, yet diversified, allocation, that includes S&P 500 (AAPL exposure) as well as bonds for security. There's also AOR (Growth), AOM (Moderate), and AOK (conservative), if you wish to tweak your risk.", "score": 2, "replies": []}, {"body": "Unless you are technically strong, you will almost always lose money trading options in the long run. You may see it as just a single trade, that will probably pay off. But its establishing the bad habit of speculating without a developed strategy. Your brain power and focus will all of a sudden be completely occupied by your trade. Might even affect your sleep. Are you prepared to accept the consequences of becoming a speculator? I am ;)", "score": 2, "replies": []}, {"body": "Hi friend, I want to keep this short in hopes you will actually read this. I know exactly how you feel. The frustration, the impatience, the envy, the regret at inaction and action alike. Please take the advice of the people in this thread. It may not be obvious to you now, but it will be unbelievably clear in the future, regardless of whether or not you are ultimately proven right or wrong.\n\nWith a ton of empathy and sincerity, SZ", "score": 2, "replies": [{"body": "Thanks so much", "score": 1, "replies": []}]}, {"body": "i'm not too familiar with leaps but after running sims on shorting itm, atm, and otm options, itm usually underperforms.  selling a deep itm option is roughly equiv. to leveraging a long or short position.  leverage is great but the downside to this is that there is something of a headwind if things move in your favor.  the closer the market gets to your strike the more your option will gain in extrinsic time value.", "score": 1, "replies": []}]}
{"title": "Tim Cook's big day: Apple hits $700 billion", "selftext": "", "id": "2vhg39", "created_utc": 1423617454.0, "score": 38, "upvote_ratio": 0.91, "num_comments": 10, "comments": [{"body": "Could APPL be the first Trillion Dollar company???", "score": 3, "replies": [{"body": "I take this back. I'd say it would be the first Trillion Dollar company in the US stock market. I just recently found out Saudi Aramco is worth almost double of APPL. Somewhere in the tens of trillions with combined assets. ", "score": 3, "replies": []}, {"body": "That is the odds favorite right now.  ", "score": 2, "replies": []}]}, {"body": "But yet they can't afford to manufacture in the States", "score": 0, "replies": []}, {"body": "I bet all those AAPL shareholders are excited about the dividends! Oh wait...\n\nEdit: I'm an idiot. AAPL pays dividends. Carry on.", "score": -8, "replies": [{"body": "I don't follow.   AAPL has a dividend.", "score": 6, "replies": [{"body": "You're right! I stand corrected.", "score": 2, "replies": []}, {"body": "Yeah. I got really excited when I saw the dividend and cheered, \"Woohoo! I'm going to make\" (pulls out calculator ...) $18! Woo?\n\nIt's not even enough to reinvest, so I'll go get myself lunch or something. ", "score": 1, "replies": []}]}, {"body": "Dividends aren't the only means of rewarding shareholders. Berkshire Hathaway famously never offers dividends and still manages to consistently increase shareholder value through buybacks.", "score": 2, "replies": [{"body": "Indeed, to be honest I'm more about the cap gains. Yet dividends also carry a symbolic value, it's an indication of the company's profitability and it's willingness to reward it's shareholders", "score": 1, "replies": []}]}]}]}
{"title": "PSA: TSLA Earnings pushed back.", "selftext": "[deleted]", "id": "2vi2zb", "created_utc": 1423628635.0, "score": 13, "upvote_ratio": 0.84, "num_comments": 18, "comments": [{"body": "FYI: This is because an important SpaceX launch is scheduled for 6:03 pm EST and Elon Musk will be in attendance. \n\nThe launch was supposed to take place Sunday (scrubbed due to Air Force radar problem) and then yesterday (scrubbed due to wind) and is now coincidently scheduled for the same afternoon as TSLA's earning release. \n\nAnd earnings may come out earlier, as usual. It's specifically the conference call that has been rescheduled from 4:30 pm to 7:30 pm. ", "score": 9, "replies": [{"body": "Thank you.  That's important info.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Don't buy options pre-ER implied vol is thru the roof.  Use a vertical spread to limit your risk", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "If you sell calls then sell a strangle with 2 SD otm", "score": 1, "replies": []}]}]}]}, {"body": "Well, there goes my $1,000 in options.\n\nFuck.\n\nEDIT: Im on the long side, but im covering ASAP.", "score": 1, "replies": [{"body": "How many times have you blown out an account using this sell OTM put strategy? Be honest.", "score": 1, "replies": [{"body": "Usernames very similar?  Hmm.  ", "score": 1, "replies": []}]}]}, {"body": "I love that everyone is talking about TSLA in this sub, it is one of my favorite tech companies, but we need to remember that they haven't made any money since the beginning.  Plus they just released yesterday that they didn't sell as much as they had anticipated in China. ", "score": 1, "replies": [{"body": "Specifically they haven't had an annual GAAP profit. They report earnings in non-GAAP however, which do show a profit. TSLA has been non-GAAP profitable since early 2013.\n\nRegardless, the reason for the GAAP losses are mostly R&D and expansion. If the company wasn't expanding, and was sticking with the status quo, they would indeed be profitable.\n\nBut going from 30k per year production last year to 500k by 2020 is not going to be cheap. That's why investors shouldn't expect annual GAAP profits until after 2020.\n\nAnd the China point is irrelevant if the sales were made up elsewhere (the news came out Jan 13, not yesterday btw). Considering Tesla has been supply constrained since the Model S debut, the sales were *definitely* made up elsewhere.\n\nTesla's earnings aren't about how many cars consumers bought, they're about how many cars Tesla was able to deliver.", "score": 1, "replies": [{"body": "My mistake I didn't even look at the non GAAP. I know they are going to have a ton of R&D in the future with the giga factory and finding reduced costs. Don't get me wrong I love TSLA as a company there has just been a ton of post about their earnings coming out today and was just stating what I've seen on their I/S. IMO its a company people want to hang on to for a few years.", "score": 2, "replies": [{"body": "Yeah, I agree, there isn't much to be said about the short term outlook of the company. Tesla clearly got over the \"this company might fail\" hump in 2013, which was a catalyst for its metric stock rise. Now it's on the slow 5 year track to proving its current share value. If they beat expectations, sure, we'll see higher short term prices, but the real test (Model 3 release) is still a few years away.", "score": 1, "replies": [{"body": "Yeah once that Model 3 is released it can only go up from there. They are down $12 in the after hours for losing $108 million, but they normally go up to about $220 and go back down. TSLA will always be a luxury buy for traders.", "score": 1, "replies": []}]}]}]}]}, {"body": "Hopefully SpaceX-related and not \"apologizing for the disastrous sales\" -related? Either way, I'm long and holding for years.", "score": 1, "replies": [{"body": "It's 100% SpaceX related. SpaceX launch is at 6:03 pm today. Movement of TSLA earnings call came after the SpaceX launch was rescheduled to this evening.", "score": 2, "replies": []}]}, {"body": "Delaying the cliff-dive lol ", "score": 0, "replies": []}, {"body": "Wow. \n\nSo this just sends the red light up on the \"I'm either dropping a bomb or we fucked up\"\n\nLet's see what that wily bastard has to say.  My assumption is that this is positive only because it's too obviously negative.  ", "score": -3, "replies": [{"body": "Or earnings release isn't pushed back and it's only the conference call that's delayed, due to a SpaceX launch apparently, and not bombs and fucks.", "score": 6, "replies": [{"body": "Well, that's not what the title said, is it? :)", "score": 1, "replies": []}]}]}]}
{"title": "What are your thoughts on BAC?", "selftext": "", "id": "2vizzl", "created_utc": 1423655301.0, "score": 2, "upvote_ratio": 0.6, "num_comments": 13, "comments": [{"body": "I hear you shouldn't drive with a BAC of .01", "score": 3, "replies": []}, {"body": "I plan on buying more", "score": 2, "replies": []}, {"body": "Buy the preferreds.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Interesting opinion. I think it will certainly go up. But that high? Why do you say so?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Interesting ideas. Thank you! I'll look into that, just bought 20 shares before the market opened today. I might look into buying more", "score": 1, "replies": []}]}]}]}, {"body": "I am bearish BAC. Those long term technicals show me there is much pain to come. Seriously, look at the max BAC chart. Awful descent off of 2008 highs and a brutal long term double top around $18 since.", "score": 1, "replies": [{"body": "What long term technicals are you looking at? BAC has just passed above the 200 DMA recently.\n\nBAC has just put in a bottom IMO.", "score": 3, "replies": [{"body": "Much longer term than that\n\n\"Awful descent off of 2008 highs and a brutal long term double top around $18 since.\"\n\nThe double top was over a span of 5 years. ", "score": 1, "replies": [{"body": "What tops are you looking at when you're calling this?...If you're talking about the March and December highs, then I wouldn't say that's a double top.\n\nAlso, the farther you get away from price action, the less importance it holds. You're talking about price action that happened 7 years ago. Hardly holds any relevance now.\n\nAnyways, BAC should get a nice move upwards tomorrow IMO.", "score": 1, "replies": []}, {"body": "I wish I could keep a track record of my calls and have it next to my name on reddit. That'd be nice.", "score": 1, "replies": []}]}]}, {"body": "However, you're leaving out the part where they almost went bankrupt in 2012 and Warren Buffet bought $5 billion or so of their shares. This is also the same time that they completely transformed their company. They are eliminating unnecessary branches and cutting out the bottom line. They're also focusing on customer service to a high degree.\n\nI say all this because I bought them at about $7.00 and have watched their every move since. Needless to say, I'm still bullish and holding onto my shares and plan on buying more ", "score": 2, "replies": []}, {"body": "Stock price in the past has almost no relation to stock prices in the future. This becomes exponentially true the farther back you look.\r\rTldr just because company X peaked in 2009 doesn't mean it won't peak again in 2015.", "score": 1, "replies": [{"body": "> Stock price in the past has almost no relation to stock prices in the future.\n\nThat's your opinion. Fair enough.", "score": 1, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "2vkkkt", "created_utc": 1423685192.0, "score": 2, "upvote_ratio": 0.63, "num_comments": 15, "comments": [{"body": "Bear, because of poor execution into China which will impact how well they do there in the future. ", "score": 1, "replies": [{"body": "Agreed. they operate on saying what they will do based on what they have done technologically. Just an hour and a half ago Elon musk in light of recent accounts of internal emails between him and his Asian staff has released that they have been developing a battery for your home.. Have they been doing it and is it trendy? Yes. But is it profitable to let a Nikola Tesla run around in this modern age", "score": 1, "replies": []}]}, {"body": "Bear, and here is why. They have a history of not making any money, they are continuing a trend of basically getting closer to splitting even. Now a big thing you have to keep in mind is, **gas is so cheap right now, that no one will want an electric car**. The main reason anyone would want an electric car is for expensive gas prices. If the price of gas is cheap then their is no reason to get an electric car. You also have to take into account how many cars they actually would have sold in fall. Assuming that everyone will want a 2015 car in fall, their is no chance for a 2014 Tesla model to even get close to any of the other car companies. Plus they flopped in sales in China selling only 100 cars or something like that. I honestly can't see a way for this company to actually gain in the 4th quarter.", "score": -1, "replies": [{"body": "> gas is so cheap right now, that no one will want an electric car\n\nThat's not necessarily true. I'm sure some have that mindset but buying a Tesla doesn't save you money. I wouldn't get rid of my current car and buy a $40K Tesla to save $15 a week in gas. Monthly payments and insurance would defeat any savings.", "score": 5, "replies": [{"body": "The people buying Tesla cars are not really worried about gas cost.  It's a tech, hippie thing.  If they wanted a cheap car to drive they'd buy a 4 banger that get 38 miles to the gallon or a Toyota hybrid.", "score": 1, "replies": [{"body": "I actually disagree. I think the gas savings factor, while not a practical or rational concern for someone buying a Tesla, probably does have a psychological factor in making the decision. As in, \"sure I'm spending close to a hundred grand on this car, but it's not actually that bad because I get to save on gas!\" So they view the price as lower than it actually is, and see it as one of the cheaper \"cool cars\" you can buy (when compared to porsches etc.)", "score": 1, "replies": [{"body": "Look there a difference between buying a cheap running cat because you have to and laying down 65-90k on a car.  Nobody is buying Tesla to save money.  They are buying them to appear enviroment ally conciois/they are cool/their friends think they are cool/they are tech early adopters etc.  It's the difference between truth, belief, and bullshit...concious or not.", "score": 1, "replies": []}]}]}, {"body": "You also have to plan around stations where you have to recharge your tesla. It really isn't worth it imo", "score": -1, "replies": [{"body": "With a range around 200 mikes, finding a charger isn't really difficult, unless you are taking a trip where you would use an entire tank of gas without stopping. It can happen but unlikely. You can charge a Tesla just about anywhere and easily overnight. Now for instance a Nissan leaf or something that gets 30 to 80 miles can be a little more tricky.", "score": 3, "replies": []}]}]}, {"body": "Great points. Thanks for sharing. Tesla can't survive on trendiness.", "score": -1, "replies": []}]}, {"body": "I plan on shorting TSLA tomorrow if the earnings are bad.\n\nIf I had to guess today, I'd say bear because they didn't do as well as they planned in China.", "score": -1, "replies": [{"body": "It could fall a ton in the pre-aftermarket, so you might be shorting into a rebound lol", "score": 1, "replies": [{"body": "I know haha I've been watching that. BIDU too. That's why I was going to wait until the market opens (and earnings) and ride the momentum at the expense of more profits. ", "score": 1, "replies": [{"body": "BIDU getting crushed now. If you're a big picture player, this isn't a huge deal though. Same with TSLA. ", "score": 1, "replies": [{"body": "Yeah, that's why I figure it'll be big movements tomorrow if it's bad news and I can short it. ", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Buy AAPL now or wait?", "selftext": "Need help I missed the good ol window to get in", "id": "2vktm6", "created_utc": 1423689072.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 17, "comments": [{"body": "How long are you going to hold it?  Forever?  Buy now.  Five minutes?  Wait.", "score": 4, "replies": [{"body": "3-4 years for college", "score": -1, "replies": [{"body": "If your investment horizon is 3-4 years, I think now's as good a time as any. \n\nI got in at 101-ish, it dropped to 96-ish immediately after and stayed there for... 2-3 weeks? But look at the little guy go now :)\n\ntl;dr: Time, not timing, is key to investment success. ", "score": 2, "replies": []}, {"body": "Wait.", "score": -2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I'd wait on 3-4 years.\n\n", "score": -2, "replies": []}]}, {"body": "did you just contradict your own damn self?", "score": 2, "replies": [{"body": "3-4 years is closer to 5 minutes than forever.  \n\nWait.", "score": -2, "replies": []}]}]}]}]}, {"body": "i bought 10 shares at $116 and im planning to hold for as long as i can (maybe forever?) but ill continue to buy in more if it dips, but now ive built myself a pretty good cushion already", "score": 1, "replies": []}, {"body": "If you're a trader you don't buy now.  It's on day 3 of the rally out of its base...in other words, it's extended and the risk is too high.   If you're an investor...idk. ", "score": 1, "replies": []}, {"body": "I kinda regret selling my shares at $118.", "score": 1, "replies": []}, {"body": "Right now is a great window to get in if you think the price will rise even higher.", "score": 1, "replies": [{"body": "This can be said for any stock at any time ever.", "score": 1, "replies": [{"body": "That's my whole point.", "score": 1, "replies": [{"body": "Lol. That seems awfully unhelpful.", "score": 1, "replies": [{"body": "It is, and it's because no one truly knows if it's a good time to buy or not.  Especially asking Reddit, no one here knows whether or not it'll go up.", "score": 1, "replies": [{"body": "Absolutely, but solid research and solid points would certainly influence one's decision to buy. We can't be certain of anything, but we can do the research and see what is a better buy.\n\nIf we accept the idea that no one truly knows anything and that's it, then what's to stop me from buying something like SDRL? I bought it right as people were short covering and sold at $14. Now that that's done, I don't consider it a good buy anymore.", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "How can apple be worth over 700 billion?", "selftext": "I know it sounds stupid but it shocks me that Apple can raise amazingly high in the market after their sale of the iPhone. What patent do they hold that makes their cap so high? Or is it really just in their sales of iPhone? Also, I know that Microsoft is more prominent in the technology industry. Except maybe for make the electronic arts or digital art.", "id": "2vlbre", "created_utc": 1423697273.0, "score": 3, "upvote_ratio": 0.66, "num_comments": 11, "comments": [{"body": "In addition to the below, don't forget that Apple has over $160 BILLION sitting in the bank", "score": 10, "replies": []}, {"body": "When you sell 200 billion in products in a year, 700 billion seems like a reasonable mkt cap", "score": 3, "replies": [{"body": "Not to mention they are a HW company with margins of a SW company. And given size, they will continue to have pricing power over their suppliers.", "score": 3, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "What is this, a school for ants?\n\n>$200 billion in products.", "score": 12, "replies": []}, {"body": "Or every person gives $20. Or some people give $100. Or some $1000.", "score": 4, "replies": []}]}]}, {"body": "I live in South Korea.  I go to China and Japan all the time.\n\nThis shit is selling like hotcakes.\n\nMy buddy just last week got his iphone 6 plus 64 gb he paid about 800 on a 1 year contract.  Hes been waiting since September.\n\nJapan every mother fucker has an Iphone.\n\nIn China everyone is poor but everyone wants to appear rich.  The easiest way to do that is by holding a luxury iphone 6 plus.\n\nNo joke man.  Apple is a status symbol in all of Asia.  Even when I went to Thailand all the high class prosties are flaunting their iphones.\n\nYou gotta remember.  These people watch American movies and dramas and all that shit.  Watch sports, everyones got a macbook, ipad or iphone.  \n\nYou gotta remember too a lot of rich people in tier one cities in China who make good coin dont usually buy a car.  Public transportation is the only way to get anywhere on time.  How else cna they show their elitism.\n\nNo one talks about this one news.  Go to Asia. See for yourself.  You'd be crazy not to hold AAPL.", "score": 3, "replies": []}, {"body": "Because they sold $75 billion this QUARTER? Because Apple pay could make even bigger profits. Because they are still growing at 35%? Because they have pricing power? Because the have ridiculous margins?", "score": 2, "replies": []}, {"body": "Apple is just doing a great job, which is recognized by many analyst who are raising their price targets continually. It might be interesting to read some of their comments  http://www.smarteranalyst.com/2015/02/11/apple-price-target-raised-jpmorgan-stock-rises/", "score": 1, "replies": []}, {"body": "They sell outside the US. People buy their product worldwide. It isnt just the sale of the iphone", "score": 1, "replies": []}, {"body": "iPhone = god's last gift to manking.", "score": -1, "replies": []}, {"body": "Goodwill. ", "score": 0, "replies": []}]}
