{"title": "Averaging doesn't increase risk-adjusted returns; it increases your chances of breaking even but increases your losses if you don't.", "selftext": "I repeatedly see people on this sub saying that one should keep buying in order to average down when they've experienced losses.  Sometimes this is good advice, but it all depends on the merits of the stock itself.  *A priori*, however, it doesn't do what many people think it does.\n\nAveraging down increases your chances of breaking even by lowering the price at which you break even.  That's simple enough, and that's why people advise doing it.\n\nHowever, it also increases the stakes.  It ups the ante.  If you don't end up breaking even, you are now on the hook for bigger losses because you've pushed more chips to the table.\n\nThis is a variation of a Martingale strategy, which offers zero risk-adjusted returns.  In a Martingale, you simply double down on your bet until you win.  If you are betting that a coin flip will come up tails, you double your bet with each heads.  The reasoning for this is that the odds of continued losses are slim.  After all, the odds that a coin flip comes up heads six times in a row are just 1.5%.  By committing to this strategy in advance, you have a 98.5% chance of winning if you're willing to go six flips deep.\n\nHowever, your potential losses scale in accordance with your increased odds of winning.  On that sixth coin flip, you are now wagering a very large amount in exchange for a small potential gain (presumably a 32:1, or 2\\^5, disparity).  There's no risk-adjusted return here.\n\nIn a nutshell, averaging down does exactly this.  If it's a great stock and a great buy, sure.  But don't average down because you think it's some free math hack.  You aren't getting risk-adjusted returns simply by doing this.  You're just increasing your odds of winning while simeultaneously increasing your losses if you lose.", "id": "x1m64a", "created_utc": 1661873658.0, "score": 181, "upvote_ratio": 0.9, "num_comments": 68, "comments": [{"body": "Everyone thinks its a great stock when they buy it. Then 5 years roll by and you accept it wasn’t", "score": 55, "replies": [{"body": "Ya if I think it's a great stock at 150 a share then I am even more excited if I can get it for 75 lol. Problem is with the post is you're wrong either way but don't actually know it 😂", "score": 17, "replies": [{"body": "So true", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "And after 15 years the stock is most likely either delisted or has fallen from glory. The longer the time span, the fewer \"old\" companies remain. Look at the top 10 companies in $SPY 1990, 2000, 2010, 2020and you'll see", "score": 5, "replies": [{"body": "Those companies were delisted?\n\nI know the 1980s was the decade of forced buyouts and mergers which isn't the same thing as being delisted.\n\nI think most of the top ten from the 90s are still trading.", "score": 3, "replies": []}, {"body": "How many companies from the top 10 has delisted since 1990? There’s been some companies that have stagnated (Nokia, Intel, etc) and others that have excelled (Microsoft, Walmart, Coke, etc)", "score": 1, "replies": []}]}]}]}, {"body": "I learned this the hard way at a casino when I kept betting black as red repeatedly came up. I lost all my money after about 9 spins in a row of that happening lol.", "score": 31, "replies": [{"body": "That's the casino story equivalent to the \"marketing can stay irrational longer than you can stay solvent\", eh? 😊", "score": 16, "replies": []}, {"body": "did you then do red and then lost that too?", "score": 4, "replies": [{"body": "If I had more money I probably would have", "score": 4, "replies": []}]}, {"body": "At a casino you have to have funds to never give up or never start this strategy.", "score": 2, "replies": [{"body": "True plus they also have max bets so the strategy fails in the long run.", "score": 7, "replies": []}]}]}, {"body": "Averaging down on an individual stock is not a great strategy, except if you believe the market is misjudging the chance of success for the company.\n\nAveraging down on an index or diversified fund is a great strategy, because if you're wrong, you're screwed anyway, so you might as well bet on eventual success.", "score": 88, "replies": [{"body": "Exactly what I was going to say.", "score": 5, "replies": []}, {"body": "Averaging down on indicies is a good practice solely because inidicies have a very high chance of eventually moving higher.  The act of averaging down itself isn't the motivator there; it's the merits of the underlying investment.", "score": 25, "replies": [{"body": "Then why doesn’t your post title say that instead 😞", "score": 24, "replies": [{"body": "A title is just a title, and the title isn't in conflict with that.  Did you not read the entire post?  I was very clear about this: *Sometimes this is good advice, but it all depends on the merits of the stock itself.*\n\nI didn't say averaging down is always a bad idea.  I said the act of averaging down itself doesn't change the risk-adjusted return profile.", "score": 2, "replies": []}]}, {"body": "That is the point.", "score": 1, "replies": []}]}, {"body": "If you believe the market is misjudging the chances, then either (1) you have some special inside information that few others have, or (2) you’re fooling yourself.", "score": 4, "replies": [{"body": "Yeah in most cases, especially for highly liquid stocks.", "score": 1, "replies": []}]}, {"body": "Yeah cuz if spy or spx go to 0 the world has bigger problems", "score": 2, "replies": []}]}, {"body": "I think if you do this with companies that you believe will have great success in the long term and your time horizon works with that, then you will come out way farther ahead when we enter the next bull market in X number of years. I.e. you bought at the top, but you also DCA at the bottom. When the price goes back up to the previous top, you broke even on your first shares and made huge profits on your DCA shares. \n\nBut if you are continuously dumping money into dogshit companies with zero fundamentals then the best you could hope for is to break even", "score": 12, "replies": []}, {"body": "If I believe in my evaluation of a company & buy that stock at $100, you are damn right that I’ll buy more at $80, but I will reevaluate what I saw at $100 in case I missed something, but 9/10 times I’m buying more.  I’m an investor, not a trader, so my timeline is fairly long, I can wait", "score": 12, "replies": [{"body": "Sure.  I'm not arguing against that.", "score": 5, "replies": []}]}, {"body": "Great post", "score": 3, "replies": []}, {"body": "Because averaging down only works for stocks with strong financials getting hit by short-term market dynamics. If the company you are investing in is pure dog poop, it doesn't matter what you average down to. A lot of people seem to think market cap and the relative stock price defines a company's success when in reality, the stock price has nothing to do with the company's operations other than if you needed to raise $ through equity to fund operations. And that was glaringly bright when we saw evaluations of companies, such as SNAP or CARVANA, lose over $100 billion in market cap. The operations of the business will always prevail, all things being equal. The stock market has detached people from the real operations of how that company works.", "score": 3, "replies": []}, {"body": "This is under the assumption that you weren't going to wager or were going to do something else with your money. If your plan is to buy in at some point, then obviously buying in when it's below your avg price point is not bad and we're just differentiating between trying to time the market vs. averaging.", "score": 2, "replies": []}, {"body": "I feel like this is such a duh statement but of course it has to be said out loud.\n\nWHEN YOU PUT MORE MONEY INTO AN INVESTMENT, YOU CAN THEN LOSE THAT SAME AMOUNT OF MONEY.\n\nCalling it DCA, or whatever new marketing term you fell for, doesn't remove the simple fact that you are putting money into a stock, which inherently has risks...........", "score": 2, "replies": [{"body": "You are agreeing with me while acting like you are disagreeing.", "score": 2, "replies": []}]}, {"body": "Second this, DCA is an entry strategy, not an exit strategy.", "score": 1, "replies": []}, {"body": "I'm of the opinion that DCA is for amateurs who don't know where and when to put their money.\n\nIt's mostly supported by LT value investors who are overconfident and think they're Ray Dalio and Warren Buffet lol\n\nIMO DCA only works for Index Funds and even then I would only buy during a recovery at the end of a really bloody sell off when I see a large green volume spike.", "score": -5, "replies": [{"body": "DCA = Dollar Cost Average = spending the same amount of money every fixed-time-interval on an investment. This naturally makes you are buy more when prices are lower and less when prices are higher. This is how most people's 401k contributions work and it's a great long term investment strategy. Not what this post is about.\n\n \n\nAveraging down = buying more of a stock that has dropped in price to lower your average cost basis. OP is right that it is basically a fallacy. You should buy whatever stock you believe will give the best returns and sell whatever holdings you do not believe will perform as well a viable alternative. The price you paid for securities in the past really shouldn't enter into the equation unless it's for tax reasons.", "score": 12, "replies": []}, {"body": "If you are planning on making a sizable investment in a single stock, lots of investors tranche in even if they have the capital to open their full position up-front - this does not exclusively apply to long term value investors. \n\nDCA is for people who don't want to put all of their eggs in one basket (or for people who have an income stream and want to increase holdings over time).\n\nAlso, calling Buffett overconfident is an overconfident statement.", "score": 1, "replies": [{"body": "I didn't call Warren Buffet overconfident. You should learn how to read instead of being defensive.", "score": -1, "replies": []}]}]}, {"body": "I feel like this about Intel, $37.24 is my cost basis so far, down 12%. I feel between a rock and a hard place.", "score": 0, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Why did people sell IBM in the 2000s? It lost market share. Stopped innovating. Intel is the same way. It has f’d up and dummies are going to just buy it the whole way down because it is “cheap”. \n\nBy the time they start making chips to the level of Amd, Apple’s M1, nvidia, etc they’ll be another generation of chips ahead.", "score": 3, "replies": []}, {"body": "Personally I think the algorithm is against it now with so much bad news and AMD does look more attractive. Most of these trades are done by computer, they see a trend and they follow said trend.", "score": 1, "replies": [{"body": "ThE aLgOrItHm Is AgAiNsT iT", "score": 8, "replies": []}]}, {"body": "seniconductors will do poorly in inflationary times. idk why but they did poorly and fell out of favor in the dot com crash recovery. If we have global stagflation for a few years, even worse", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "I'm sorry your attention span is so short.  If reading is tough for you, investing isn't likely to go well.", "score": 5, "replies": []}]}, {"body": "I agree with OP. I was holding Intel for a while, decided not to average down and instead sold. On the other hand, I have MSFT with an average cost of 270, and to me, averaging down on that one makes a lot of sense. All of my positions are for long-term time horizons, but my cost basis in SOFI for example is 300 shares at 6.70, I don't really feel the need to average down much, I think that it can be worth at least 3-5 times that in a few years, so the extra dollar a share in cost basis is really not significant enough for me to justify deploying more capital into a speculative stock like that when companies like Lowe's, JPMorgan, and Google are going on sale.", "score": 0, "replies": []}, {"body": "DCA is a strategy intended for broad market index funds, not individual stocks.  DCA'ing on individual stocks is just gambling, just like buying those individual stocks in the first place was.", "score": -1, "replies": []}, {"body": "So the hack is. If you are losing average down then break even. Don’t be greedy. This sounds a bell as sometimes I have averaged down successfully and got to break even and did not take me investment just to lose if after.", "score": 1, "replies": []}, {"body": "This is exact how I win roulette", "score": 1, "replies": []}, {"body": "In summery .... buy good stocks and keep buying.\nDont buy bad ones, and definitely dont add more to shit companies with no future.", "score": 1, "replies": []}, {"body": "It absolutely works in a 10-15 year time frame.", "score": 1, "replies": [{"body": "Only if the stock goes up.  I was clear that buying more after a drop can make sense, but that depends on the merits of the stock.  Averaging down isn't giving you some sort of free risk-adjusted return in itself.  You should buy the best investment available to you.  The one you are down on doesn't get bonus points because you havet he opportunity to average down.", "score": 1, "replies": [{"body": "You are right. I just invest in etfs like SPY, QQQ, etc.\n\nFor individual companies, its not a good idea to invest more than 5% of portfolio and of course if their revenue is going to decline, just stop buying anymore.", "score": 1, "replies": []}]}]}, {"body": "My username does not endorse this topic.", "score": 1, "replies": []}, {"body": "Averaging down, averaging up. The point is I’m putting $X in every week, and adding to my positions. I’ll re-evaluate every year or so and make changes I feel are necessary. \n\nNever got into this thinking every one of my stocks picks would be a success, but I did my own research hoping they would be.\n\nOne has dropped about 50% since Feb. historically, that seems to happen every few years, then the high is larger than before. After 40+ years of that happening, I’m willing to bet it’ll happen again.", "score": 1, "replies": []}, {"body": "Mmmmmm nah don't buy it. It's not a coin flip. This is a market with a behavior to it. Are your losses technically infinite if you keep buying McDonald's when it's down? Yeah I suppose all McDonald's could close, actually no I cant suppose that, I literally can't visualize it.\n\nAssuming you made an informed decision when the stock goes down you have a discount. Not all stocks go up again but most do. Now this isn't factoring in opportunity cost which far too many people ignore but assume the market is down overall. This is when people advise it. It isn't some reduction it's just the sensible thing to do. If you assume the market bounces back, it's just upsides. That is the concept behind DCA regardless of up or down trends.\n\nNow some people really just need to reap their losses for the tax benefits and move on to a better stock but this isn't always as obvious as hindsight would have you believe. Who knew 5 years ago taking your 20k that turned into 10k in Intel and moving that into some no name company AMD would have let you buy a house off that choice.\n\nTLDR if the fundamentals don't change it's a discount and if you don't know what the fundamentals are just buy an index fund", "score": 1, "replies": [{"body": "You said you \"don't buy it\" but then wrote four paragraphs arguing against something I didn't say.  I never said you shouldn't buy more quality stocks when they get cheaper.  I said the act of averaging down itself doesn't imply free risk-adjusted returns.\n\nAnd I disagree with the \"fundamentals don't change, it's a discount\" line.  I see that constantly on this sub, but did it ever occur to anyone that maybe they were just wrong about the valuation before?  The fundamentals might not change, but that doesn't mean the valuation was right.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Where did you get that from my post?", "score": 1, "replies": []}]}, {"body": "If you know how to value a business and it’s undervalued you keep averaging down. If the stock is dropping because the company sucks and you fucked up in the first place you should sell.", "score": 1, "replies": [{"body": "As I said in the post, it all comes down to the merits of the stock.", "score": 1, "replies": []}]}, {"body": "tell that to r/Superstonk reddit top pages.  those nut jobs are future bag holders.\n\nthey are so easily rattled that a mention of bad news they call fud.\n\nThat group is like a Magna GOP rally..", "score": 1, "replies": [{"body": "I try not to say anything to those folks!", "score": 2, "replies": []}]}, {"body": "If the stock pays dividends then that is one more reason to buy more as it goes down in price. If the fundamentals haven't changed then you're fine.", "score": 1, "replies": [{"body": "Well, first, I was clear that there are many times you should buy on the way down.  It all comes down to the merits of the stock.  My only point was that averaging down itself doesn't ensure risk-adjusted returns.\n\nBut I disagree with \"if the fundamentals haven't changed, you're fine.\"  I see that a lot here.  It's possible I was just wrong about the valuation before.", "score": 1, "replies": []}]}, {"body": "Averaging down is the best simple strategy one can employ. Why is everyone assuming that people just hold trash stocks?\n\nDid you have a sudden surge in portfolio value this last month? Then it means that once a bull market returns, you are likely to see a good amount of gain if you continued to average down.", "score": 1, "replies": []}, {"body": "Markets are irrational in the short term, but in the long run they are rational. Averaging down on well-researched stocks with strong fundamentals will work out in the end. The trick is to not average down too fast so you can remain liquid until the stock price becomes rational.", "score": 1, "replies": [{"body": "Whether averaging down is a good idea or not depends entirely on whether the stock is a good buy or not.  That was my point -- the merits of the stock are what matters.  Averaging down itself doesn't offer risk-adjusted returns.", "score": 1, "replies": []}]}]}
{"title": "How to Not Lose Money on BBBY", "selftext": "[deleted]", "id": "x1nbjd", "created_utc": 1661876394.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 43, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x1nbjd)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x1nbjd)", "score": 1, "replies": []}, {"body": "\" I admittedly suck at trading. Now listen to my trading advice.\" \n\nBoy what the fuck?", "score": 37, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "I’m really good at trading and I tell you tomorrow it’s going to be fire 🔥🚀. Prepare for bankruptcy shorty ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You say shit![img](emote|t5_2th52|4271) you know what’s coming ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|8883)", "score": 1, "replies": []}]}]}]}]}, {"body": "Positions?", "score": 8, "replies": [{"body": "Rather ban - ![img](emote|t5_2th52|4263)", "score": 9, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Use imgr to make a link. Also I just wanna see future loss porn. My cost avg is $10 so I am banking on you being wrong but best of luck to either of us😉", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yessir! Also [to post a pic](https://imgur.com/a/wnQthzV) go to imgr, upload photo and then copy link of image made. I post the image using Reddit’s chain and you can title your link whatever you want in blue how I did above😉 for future posts if you gonna talk smack post a position or get ready to get position or banned to death😘", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yessir, I’m down rn but I’m waiting on any of the next 3 days to just have a mega open spike. Then sell options and get more shares;)", "score": 2, "replies": []}]}]}]}]}, {"body": "Take my words back. You have few. Maybe more than 2.", "score": 2, "replies": []}, {"body": "It's been 26 minutes", "score": 1, "replies": []}]}]}, {"body": "Lul 2 comment karma. Suuuuure", "score": 13, "replies": []}, {"body": "According to your logic, we should do the opposite of what you do. You’re a losing player friend. Quit stock market", "score": 20, "replies": []}, {"body": "Proof of loses, show 'em! I wanna see the lost millions in opportunities and hundreds of thousands in cash and then I'll read the rest of the post.\n\nWithout that I can't believe your post. \n\nBUY BBBY! BUY THE DIP! HOLD TO THE FUCKING MOON!", "score": 12, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 2, "replies": []}]}, {"body": "Looking like a scarecrow with all that straw.", "score": 3, "replies": []}, {"body": "First seen in WSB just now lol", "score": 5, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "Troll", "score": 4, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Losses are wins if you know how to use them", "score": 1, "replies": []}]}, {"body": "what does it mean to buy with or against momentum?", "score": 2, "replies": []}, {"body": "Genius", "score": 2, "replies": []}, {"body": "He was spot on", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4641)I know how to not lose money on bbby... dont buy it at all ![img](emote|t5_2th52|8883)", "score": 2, "replies": []}, {"body": "You lost money because you got in too late. Right now it’s early and your on the wrong side of the trade buying puts.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You need Thinkorswim, best app for options and day trading. Trade the news, the news come in the app as it is published, the tech analysis will also show. People lose money because they don’t have the right tools.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Wait for the news on BBBY tomorrow, basically if it’s amazing, and bankruptcy is out of the picture, it will squeeze. If the news is lame it will tank. The key is to sell Buy Buy Baby. Without the sale of Buy Buy Baby, no amount of loan is gonna save them. Right now is now is a good time to day trade, or play options, because market is too volatile.  Just mitigate you risk. Thinkorswim classes are also free, it will improve your skill and earnings by like 10 fold. You’ll make all of your money back and plus more.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "BBBY is NOT a fundamental play. It’s a play on the shorts. To short BBBY the interest rates are expensive. The buyers have the upper hand. Eventually if it pushes high enough, it won’t be profitable for the shorts. We will then see a Gamma Squeeze. But the success depends if the hedgies jump in with the Apes. We don’t have Billions to invest we only have in the 100’s of millions. We need about $1 billion dollars more to push the price up to $40. Only the hedgies have that kind of money.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "$BBBY heading to less than $5 congrats 👍. News is lame. They won’t make it. Glad I sold yesterday for a decent profit.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "post or ban !", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "free pass this time ![gif](emote|free_emotes_pack|thumbs_up)", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "its just who I am ,ps please tell my wife lmao", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "so she is paying you![gif](emote|free_emotes_pack|money_face)", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "lol have a good evening see ya in the cartoons tomorrow, good luck", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "You are right in most aspects but you say you bought with momentum as an error. Yet here you are betting with the shorts that the price will drop by running puts. How is being bearish better than being bullish when it comes to this meme stock in particular?", "score": 1, "replies": []}, {"body": "I turned 2k into 17k with AMC last year. 850% gain. \nBut….  I should listen to you because you lose money? Lmfao!", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "So that means you fucking suck you greedy jabroni.\nDon’t tell people how to invest when you are obviously terrible. \n1000 % gain is what people look for over 20 years of investing… you didn’t sell because you listened to experienced traders tell you it’s going to the moon. Lmfao!! \nGood luck with your puts.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Re read your title. \n“If you want to make money, do the opposite of of all the points above”\n“Buy puts I you have the balls. According to my calculations, we’ll be back at 6-7 dollars in no time. 10 to be safe”\n\nSounds an awful lot like advice…. Lol", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "PUT YOUR HANDS UP Anxious-Ad-7039!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}]}]}]}
