{"title": "Who the hell is buying?", "selftext": "I’m so confused, everywhere I turn it’s bull trap this and bull trap that. Don’t buy, because we are about to collapse. We are about to crash soon. I’m pretty sure retail has already been demolished with 90% of retail stocks still down from highs. So they can’t be fueling this rally, they don’t have that type of money. With inflation, recession, wars, China, monkey pox, etc… you name it why buy here, when you could have bought a couple months ago. We already witness how scary things can turn in a flip. Even if the crash happens within a year, wouldn’t it be best to wait, cause that could be 10%+ you are leaving on the table. Yes, you lot say don’t time the market, but I can’t turn anywhere where the sentiment is still bearish.", "id": "wpj0tm", "created_utc": 1660619002.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 74, "comments": [{"body": "[deleted]", "score": 63, "replies": [{"body": "Just bought mining stock today, the oversell on China fear is ridiculous.", "score": 13, "replies": [{"body": "Watch out there.. if you are buying in US Markets, if US were to put sanctions on China for some reason for Taiwan naval war, supporting Russian proxy war via secondary sanction etc. your stocks become unsellable till that sanctions get lifted. I had some bit of YNDX that is unsellable because it’s a Russian company. FWIW.", "score": 3, "replies": [{"body": "I hear that.  I don't buy Chinese stocks.  But the Chinese economy determines the price of ore currently.", "score": 2, "replies": []}, {"body": "I bought some Vale directly in BRA.", "score": 2, "replies": []}]}]}, {"body": "Not true. The price of gas is falling and I'm letting my tank get to E before I fill it again to give it the best chance to fall farther.", "score": 3, "replies": []}]}, {"body": "Despite the \"bull trap\" fears, tomorrow morning, about 110,000,000 people are going to get up and work at private sector firms producing goods and services at a profit for their companies. \n\nI'd rather own more pieces of these companies than fewer.", "score": 67, "replies": []}, {"body": "One of the biggest steps forward you can have as an investor, is not relying on others/media sources to tell you when you should and shouldn't be buying.\n\nYou will see tremendous returns when you stop listening to others, and put forward critical thinking skills to develop you're own hypotheses", "score": 45, "replies": []}, {"body": "Smart investors DCA all the way through as I have. We see ath great we see another crash I’ll continue to DCA into my favorite stocks. People who waste time trying to time the bottom are the ones who miss out on huge gains. The stock market whether it’s now or years from now will recover. Historically it’s known to always go up. So I’ve been throwing 2 grand a month since Covid idc how low things go more shares for me and I won’t regret it in 10 years", "score": 37, "replies": [{"body": "Been DCAing since fall 2012", "score": 5, "replies": []}, {"body": "What if it doesn't bounce back in ten years?", "score": -5, "replies": [{"body": "You'll have been DCA into underpriced stocks for 10 years.", "score": 14, "replies": []}, {"body": "What else were you going to do with the money?", "score": 6, "replies": []}]}]}, {"body": "I’m buying now. When it goes down I’ll also be buying. And then when it’s flat I’ll also be buying.", "score": 8, "replies": []}, {"body": "Who is buying is irrelevant.\n\nWhy they're buying is irrelevant.\n\nThe charts are telling you stocks are being bought.  That is all that matters.\n\nStop listening to others.\n\nDo your own work.\n\nGood luck.", "score": 11, "replies": [{"body": "pure", "score": 2, "replies": []}]}, {"body": "Michael Burry is quite sure the end of the world is this week. If not then....definitely next week.", "score": 8, "replies": [{"body": "Why in the world do people repeat this? He's saying the market can go a lot lower. Not that the world is going to end.\n\nHe sold a lot of his positions the end of last year.", "score": 5, "replies": [{"body": "He lives rent free in permabull heads", "score": 5, "replies": []}, {"body": "Lots of people are sour that Burry knows more than them and much richer than them but he is a permabear who keeps telling the truth.  His predictions could be right or wrong depending on fed's decision.  But he knows what he is talking about.  He always tells people the reason why he thinks something will happen.  Most of time it makes sense.", "score": 2, "replies": [{"body": "Not sour about it all. Just amusing that the sky is literally always falling.", "score": 2, "replies": []}]}, {"body": "He also decided he was an expert on military strategy earlier this year and was weighing in on that. So go ahead and STFU, 🤡.", "score": 1, "replies": []}]}]}, {"body": "Trust your own data and judgement.", "score": 3, "replies": []}, {"body": "I am", "score": 5, "replies": [{"body": "Me too even thought I previously told myself I wouldn't buy more stocks.", "score": 2, "replies": []}]}, {"body": "> I’m pretty sure retail has already been demolished with 90% of retail stocks still down from highs.\n\nLook at the meme stocks. $bbby up 257% in a month. GME bought at any of the “anti-speculation lows” is up around 60-80%. AMC +60% in about two weeks. \n\nI’m cautious about this market as long as I still see the dumb garbage pumping.\n\nI was buying at the lows and I’m still buying via my automatic 401k but I’m still cautious as well. I do have a bigger than normal cash stash, as dumb as it usually is to try to time the market. It is hard to trust this when none of the issues that caused the pain in the first half of the year have been solved(though oil prices have fallen).", "score": 8, "replies": [{"body": "It’s great that you noticed the same culprits are acting irrational again. When you see this, it is 100% sure the market is making new lows. Market will not be done selling until all of these people are washed out. The big boys are preparing retail to hold the bag again just like they did last sell off and provide liquidity for them when they come back from vacation in September", "score": 3, "replies": []}]}, {"body": "Volumes compared to early in the year are lower.\n\nPeople who are in it are trading each other up.\n\nIf they don't time it right they'll be burning themselves down.", "score": 4, "replies": []}, {"body": "You can automate your mutual fund / index investing on a DCA strategy and tune out of financial news and go follow wholesome feel good news instead. There's ALWAYS Bearish sentiment. There's ALWAYS pump and dump hype. There's ALWAYS something to get FOMO over.  If you don't want to be stressed out pick 3-5 funds and just put money in on a schedule.", "score": 4, "replies": []}, {"body": "It's hard to time the market. You don't know if the market will go up another 30% before there's a pullback. Better to just be invested if your time horizon is long.", "score": 2, "replies": []}, {"body": "households are 50%+ of the investments right now and they aren't selling right now and keep buying. They mostly buy on steady bi-weekly chunks from 401ks and IRAs  and mutual funds so that is one section. \n\nThe next section are the people who decided we'd hit an \"investable bottom\" meaning even if we go on and see a new low, it'll likely only be 5-10% lower than the previous low. There is a lot of cash on the sidelines that was just waiting to be put back to work and people decided this was a good enough bottom. \n\nAnd then finally you have the shorts taking profits like any good trader with more coming out as the profits dried up and they decided to go \"might as well take 50% of the profit I was previously offered. \n\nThe swing is also getting pushed up a bunch because volumes are super low. Today QQQ saw a volume of 38M compared to a YTD average of 74M and a 6m average of 71M. SPY saw 54M today compared to 100M and 95M respectively. When volume is half normal even a small increase in the number of buyers over sellers can produce a large movement. I was buying a bit ago, but I'm selling calls right now and won't really trust the growth until we see volumes closer to 70-80M on QQQ and 100-110M on SPY", "score": 3, "replies": []}, {"body": "That's why I already have my portfolio of stocks selected and just DCA into whatever is down the most that day and underweighted.", "score": 2, "replies": []}, {"body": "AAPL just released: \"About 100 contract recruiters were let go in a rare move for the world’s most valuable company, said the people, who asked not to be identified because the situation is private. The recruiters were responsible for hiring new employees for Apple, and the cuts underscore that a slowdown is underway at the company.\"\n\nLet's see how people could possibly put a positive spin on this.", "score": 2, "replies": [{"body": "Very easy, it means the FED will pivot", "score": -1, "replies": [{"body": "You do realize that at some point bad news is truly bad, esp for a stock trading near ATH and at 24x 2024 earnings. But in case you don't, thanks in advance for your donation.", "score": 4, "replies": [{"body": "I don’t like Apple stock, just saying that a Fed pivot compensate a mild recession", "score": 2, "replies": [{"body": "The easing argument won't work forever, esp if assets continue to inflate. Easing means commodities go right back up and so does inflation. Fed is really screwed here. \n\nProblem w Apple is that it isn't just an ordinary stock now.  It's so massive that it has almost become the market. When there's a blip it will get read through to all kinds of sectors. It's the tip of the iceberg.", "score": 1, "replies": []}]}]}]}]}, {"body": "I have limit orders set on stocks I've been eyeing in case of another pullback. If it comes, great, I've snagged some deals. Otherwise, I'm breathing slightly easier seeing some recovery in my portfolio.", "score": 1, "replies": []}, {"body": "Wall Street is the one buying. Wall Street manipulates the market to compel dumb people to panic sell so that they could buy at lower prices. They come on TV with their fancy titles like Chief Investment officer at Morgan Stanley and achievements and use scare tactics that we all know is bullshit. It’s how they make money. Never trust Wall Street. Do you own research. If you do your own research, you will know the difference between bullshit and truth.", "score": 0, "replies": []}, {"body": "My account auto buys every two weeks regardless.\n\nHave you ever read this? [How to Perfectly Time The Market](https://www.personalfinanceclub.com/how-to-perfectly-time-the-market/)", "score": 0, "replies": [{"body": "That was a nice eye opener", "score": 2, "replies": []}]}, {"body": "We are buying $BBBY !!! 🚀", "score": -12, "replies": [{"body": "You’ll get downvoted for any mention of that in this thread 😂", "score": -5, "replies": []}]}, {"body": "   We buy a few shares of JEPI almost every week.  As long as it keeps giving us money, we don’t give a shit about the rest of the rumors and worries.", "score": 0, "replies": []}, {"body": "I read a few of the comments and nobody is giving you a straight answer, so I will:\n\n&#x200B;\n\nThe FED is not fighting inflation the way they are claiming. Their actions clearly show they want inflation to remain high to destroy the $USD. \n\nReal rates are still negative and their balance sheet is barely shrinking. Its all smokes and mirrors. They still bought some mortgage backed securities for july month that says alot about the truth about whats going.\n\n&#x200B;\n\nThe truth: They purposely want inflation to make everything go up. Stocks/real estate/government revenue/taxes etc. \n\n&#x200B;\n\nSmart money and big money knows this, and they think they are 1 step ahead of the FED. So, the people who are buying are the ones who think 10 steps ahead. It seems the FED is not raising interest rates fast enough to combat inflation, instead they used it as a tool like controlled demolition of the value of the $USD.  That means stock prices go up permanently, real estate goes up permanently and so does...your wages and grocery prices (but nobody cares about main street anyway).   The best part : Revenue goes up permanently too. **All numbers get bigger and that includes the $SPY.**", "score": -6, "replies": [{"body": "I really like that conspiracy theory", "score": 1, "replies": [{"body": "What exactly is conspiratorial about it?", "score": 1, "replies": []}, {"body": "Bro, how is it a conspiracy theory. Please explain? Do you not see the \"bear market rally\" happening as we speak? I am simply helping people to understand its not a bear market rally, its the FED failing to fight high inflation. Fed fund rate is at 2.5% while inflation is at \\_\\_\\_\\_%? Fill in the blank and you will understand my point.\n\n&#x200B;\n\nP.S: For all of you reading this. Ask yourself this question, do you **REALLY** think the fed wants to crash the stock market for you?", "score": -1, "replies": [{"body": "I believe your scenario is most likely true, and I like it a lot. But you gotta admit it does sounds a but conspiracy to the normies", "score": -1, "replies": []}, {"body": "Aren’t you the guys that said the FED trying to kill the USD so it can cancel its huge debt ?", "score": 1, "replies": []}]}]}, {"body": "Gave you an upvote to offset your nonsensical downvotes. But to be fair, this is a prediction. A rational one that deserves consideration. I have spoken to very smart people who work in high levels of finance and they believe that what you explained has very real potential. I don’t agree, I believe rates are going to increase, unemployment will follow and we will see a real recession with cheap stock prices. As bad as it sounds, it would be the responsible route. The fact is, there aren’t too many ways that this can play out, none of which are good.", "score": 0, "replies": []}, {"body": "I think FED is going slow because they know on March 23, YoY inflation will be lower, since the first spike was in March 22. But like you said, if they really wanted to fight inflation, they would have increased the rates faster, higher. Wages are high, therefore demand is high which is why prices are high. They need to cause unemployment and restart the economy to go back to norma levels, otherwise these current prices will be the new normal just like you said. But also, I am not an economist and slightly ignorant in finances so my whole theory can be trash.", "score": 1, "replies": []}, {"body": "Lol, stop drinking the kool-aid, it is melting your brain.", "score": 1, "replies": []}]}, {"body": "it’s covering shorts by hedge funds. Retail doesn’t have enough power to move the market like this.", "score": -3, "replies": []}, {"body": "If OPs mom wasn't giving it away for cheap then we wouldn't be having this conversation", "score": -2, "replies": []}, {"body": "MOST OF THE TIME 90% of stocks are down from their highs, though.\n\nBecause - despite claims made in another sub - stocks do NOT only go up.\n\nNow, wouldn’t it be nice if prices would simply ratchet up every day in a bull market! Every single day new highs!\n\nWould be trivial to pick the top. That’s the day before the day that stocks close down from their ATH.", "score": 1, "replies": [{"body": "I mean that’s kinda obvious and they’re learning their lessons. You just have to see an all time chart and it doesn’t look pretty.", "score": -1, "replies": []}]}, {"body": "Follow MM’s. Not r/stocks.", "score": 1, "replies": []}, {"body": "Checking in with another, “I’m always buying.”", "score": 1, "replies": []}, {"body": "Peace sells but...", "score": 1, "replies": []}, {"body": "Timing the market < Time in the market 😎", "score": 1, "replies": []}, {"body": "Anyone who matters is buying\n\nRetail is usually the last to know.", "score": 1, "replies": []}, {"body": "This rally actually have some legs. Oil prices are way down, other commodities are also way down and these were the things that caused a spike in inflation for the most part. The FED is about to slow down the rates hike and they won't stay high for long because the US debt is so high that keeping interest rates high for long make it impossible to service the debt. \n\nMoreover we saw that the food crisis improved because Russia let Ukrainian wheat to be exported lowering prices and the potential social crisis in Africa, we now know that NATO won't intervene in Ukraine so a potential WW3 is excluded and the recession in the US will be mild. \n\nChina lowering interest rates is also a good thing for the world economy because their economy is huge. The main problem I see is Europe which will have a very big recession this coming winter. I hope wisdom will prevail there and they'll remove the oil sanctioned they imposed on Russia (tbh this was an auto-sanction because Russia just moved their export to China and India and is not impacted whatsoever by the oil boycott from Europe so it's truly a suicide move by the EU). If they remove that sanction their inflation will go down too and the ECB won't have to tight that much. \n\nWe will see but I do believe there are reasons to be optimistic about the future", "score": 1, "replies": []}, {"body": "*\"Even if the crash happens within a year\"* \\- how do you know that there will be a crash in the near future?\n\nI mean the Wikipedia definition of a crash, not a 10-15% correction:  \n*A stock market crash is a sudden dramatic decline of stock prices across a major cross-section of a stock market, resulting in a significant loss of paper wealth. Crashes are driven by panic selling and underlying economic factors.*", "score": 1, "replies": []}, {"body": "Be greedy when others are fearful", "score": 1, "replies": []}, {"body": "People who wanted out and sold already sold 3 months ago.\n\nQuestion is more : who is selling now (and haven’t already sold) ?\n\nThere is constantly money going into markets from pension funds and automated savings…\n\nFor markets to go down, you need more sellers than buyers. But there is a constant flow of money in which means you need lots of sellers to outnumber money in.\n\nThat might explain why all last dips were very short ones (Dec 2018, Mar 2020, this one…)\n\nOf course that doesn’t mean it can’t go down again.\nBut the natural flow of market if going up.", "score": 1, "replies": []}, {"body": "It is panic buying. Most of hedge funds and retails realized that they missed the bottom and started chasing the rally. It looks like sentiment is now good in the near term, at least until September. I think market will continue to pump or consolidate until September, then we might pullback but it is unlikely to revisit the June lows without recession.", "score": 1, "replies": []}, {"body": "Me", "score": 1, "replies": []}, {"body": "Me, every payday.", "score": 1, "replies": []}, {"body": "NGL. Kinda confused myself…but I’m a trader. Monkey see buy signal, monkey buy. Monkey will continue buying until monkey see short signal 🤷🏻‍♂️", "score": 1, "replies": []}, {"body": "How do people not realize by now that everytime the market starts turning around for real there’s always going to be people crying bull trap. We bottomed out a few months ago it’s over this is the beginning of a new bull cycle so start buying or miss out, your choice. You’ve already missed out quite a bit if you didn’t buy before.", "score": 1, "replies": []}]}
{"title": "Home Depot posts record revenue and profit, beating Q2 expectations and sticking to guidance; stock up 5%", "selftext": "[Home Depot](https://www.cnbc.com/quotes/HD) on Tuesday reported higher second-quarter earnings and revenue that beat analysts’ expectations as the company cited continued strength in demand for home improvement projects.\n\nThe Atlanta-based company stood by its forecast for total and comparable sales to grow about 3% for the year, with comparable sales to be slower in the second half of the year. \n\nSame store sales rose 5.8% in the quarter, topping analyst expectations for growth of 4.9%, according to FactSet. Home Depot said transactions slipped during the period, while the average ticket rose, primarily as a result of inflation.\n\n&#x200B;\n\n* Earnings per share: $5.05 vs. $4.94 expected\n* Revenue: $43.79 billion vs. $43.36 billion expected\n\nHome Depot continued its streak of beating analyst forecasts with record quarterly results for Q2. The home improvement retailer has topped quarterly earnings estimates since the first quarter of 2020, and hasn't missed revenue predictions since Q3 2019. Home Depot stock is down about 25% for the year, and its shares are up about 5% in morning trading.\n\nThe second quarter is seasonally the strongest for wholesale building retailers as home projects pick up in the summer months. Wall Street predicts moderate earnings growth for the two companies. But analysts note concerns over a weakening macro backdrop, slowing \"do-it-yourself\" demand and general retail weakness.", "id": "wpyunx", "created_utc": 1660667602.0, "score": 296, "upvote_ratio": 0.94, "num_comments": 76, "comments": [{"body": "All those $9 2x4's...", "score": 78, "replies": []}, {"body": "It’s obviously because it’s 12ft skeleton season", "score": 26, "replies": []}, {"body": "They fired a fuck load of people to hit profitability but cool, good for them.", "score": 23, "replies": []}, {"body": "It’s all me guys, I bought a 6’ piece of PEX and a couple Sharkbite connectors there this quarter, came out to a little over 43 billion…", "score": 27, "replies": [{"body": "Props to you over a billion lmao.\n\nThat would genuinely not surprise me in 369 years", "score": 4, "replies": []}]}, {"body": "Pizza party here we come, says every manager 🎉= give raise instead, says every employee", "score": 10, "replies": []}, {"body": "Bears: \"This is bad for economy\"", "score": 58, "replies": [{"body": "Uhh it is.  Read the earnings report.  They sold less items... for more money.\n\nThis is inflation and its not going anywhere.  It doesn't matter if lumber goes down, HD is still going to charge more for it.", "score": 50, "replies": [{"body": "So I work on the sales floor of HD and it's is noticeable how much it's slowed. Transactions are down 5%~ but tickets are up. Less DIYers but the same pros. Even some smaller pros have fallen to the wayside being priced out.", "score": 5, "replies": [{"body": "Appreciate the insight!", "score": 3, "replies": []}, {"body": "Is the demand from Pros sustainable? Or are they simply living off back log of work from the pandemic and once that's done work will really slow down?", "score": 1, "replies": []}]}]}, {"body": "Serious question tho, can you maintain economic growth alongside high inflation and declning GDP? \n\nPart of meeting revenue estimates is the inflation cost. I am not in the doom and gloom camp, but I also don't think it is rainbows and butteflies.", "score": 15, "replies": [{"body": "The inflation is high partly because people CAN afford it. Consumer buying habits are still booming, and slight GDP decline can be chalked up to the peak of the inflation shock in ~March. \n\nSo many people halted their spending for a bit anticipating the US to become Venezuela ( you can even see evidence of this on this sub around that time ).", "score": 10, "replies": [{"body": "Have you checked credit card debt?  It is ATH.  People can't afford things they just swipe", "score": 12, "replies": [{"body": "It’s been hitting ATHs for years now.   Same with basically every other kind of debt", "score": 4, "replies": []}, {"body": "1. U.S. population isn't declining.\n2. Do you expect Americans to become more fiscally responsible? \n\nMy point is that CC debt is *probably* never going down until 1 or 2 change, holding prices constant.", "score": 1, "replies": []}]}, {"body": "You ignoring the massive raise in credit cards debt tho.\nI am personally doubling down on banks lately, but I think a lot of these numbers are misleading when everyone is getting more deep into debt to afford inflation. \n\nI probably can spend some time researching it, but I don’t think the stock market scream buy. I do still buy, but I am not going all way in since it doesn’t feel right. But who knows? Maybe I am wrong", "score": 13, "replies": [{"body": "this is a big thing nobody is talking about. Consumers are running out of cash but want to maintain their spending habits by subsidizing their spending through debt in a rising rate environment. This is making inflation worse and will make the downturn worse because this is not sustainable. Current earnings reports are just to soon to see the effect of what the Fed is doing. It will take another 1-2 quarters for it to permeate through the market. This is why bears think we have not seen the lows yet, because everyone got bullish really fast. You know the old saying, \"too soon junior\"", "score": 9, "replies": [{"body": "just one or two more quarters !\n\n!RemindMe 6 months", "score": 3, "replies": [{"body": "I will be messaging you in 6 months on [**2023-02-17 00:08:44 UTC**](http://www.wolframalpha.com/input/?i=2023-02-17%2000:08:44%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/wpyunx/home_depot_posts_record_revenue_and_profit/iklax3g/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fwpyunx%2Fhome_depot_posts_record_revenue_and_profit%2Fiklax3g%2F%5D%0A%0ARemindMe%21%202023-02-17%2000%3A08%3A44%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20wpyunx)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}, {"body": "Cleveland fed estimates 12 month forward CPI is expected to only be 3%", "score": 1, "replies": [{"body": "i only believe this number if were in a huge recession... if theyre predicting 3% theyre predicting markets crashing but just not saying it lol", "score": 2, "replies": [{"body": "Well rhe money printers have been dialed down and supply chains are way better then they were at the beginning of the year. My question is, where is the additional imbalance originating from?", "score": 2, "replies": []}]}, {"body": "Do you believe that estimate?", "score": 1, "replies": [{"body": "I trust the source over any redditor", "score": 8, "replies": [{"body": "\"Transitory\"?", "score": 1, "replies": []}, {"body": "funny... redditors were saying inflation would go this high and the FED was wrong... tough hill to die on when your siding with the people who have been wrong the whole time", "score": 0, "replies": [{"body": "The cleveland fed has been pretty close to the mark the whole time", "score": 2, "replies": [{"body": "source? their inflation forecasts have been off by a mile from what Ive seen and theyve had to constantly revise... im not sure where youre getting this info from", "score": 1, "replies": [{"body": "I said Cleveland fed..not jpow", "score": 2, "replies": [{"body": "i know... source? send source for the inflation expectations vs real... pretty sure they were off by 5% which is like massive", "score": 1, "replies": [{"body": "https://www.clevelandfed.org/our-research/indicators-and-data/inflation-nowcasting.aspx\n\n9 years worth of predictions", "score": 1, "replies": [{"body": "this is just the reports on CPI not their predicted rate... id like to see what they predicted in q2 of 2021 vs what was the actual in q2 2022 for example... thats a year out...then youre statement about them being accurate would make sense", "score": 2, "replies": []}]}]}]}]}]}, {"body": ">chooses one example where some Redditors may have said something\n\n\n>describes Redditors as not the ones who have been \"wrong the whole time\"\n\nLol", "score": 2, "replies": []}]}]}, {"body": "Transitory", "score": -3, "replies": []}]}]}, {"body": "> can you maintain economic growth alongside high inflation and declning GDP?\n\nYou just answered your own question. \n\nEconomic growth implies period-over-period increases to GDP (unless deflation is involved, which isn't an issue for nation-states not on the gold standard)", "score": 1, "replies": []}]}, {"body": "Can't even believe how stupid people are...  People spent more,  made less transaction so basically HD just charged more for the same product. Spend at least a min or two to read the  earning report before comment here.  They expect 3% growth when inflation is at 8.5%..", "score": 4, "replies": []}, {"body": "This is just further evidence of the bifurcation in the economy at this point in time. People who can afford to renovate their homes are still doing so, while lower income people are struggling to buy necessities. Given the risk of a full blown recession in the near future, I wouldn't buy these companies at these levels.", "score": 3, "replies": []}, {"body": "Adjusted for inflation it's a *decline*.\n\nBut tell me more about how decreasing real income is good for the market.", "score": 3, "replies": []}]}, {"body": "Have you gotten a landscaping or any other home-related work quote recently? Labor is so expensive that everyone is resorting to DIY", "score": 3, "replies": []}, {"body": "Their return policy makes it so easy to just buy stuff there over Lowes, Menards, Amazon or Ace.", "score": 9, "replies": [{"body": "Lowes is simple also. Pros shop at HD is the difference. They carry Milwaukee husky’s etc. We look at lowes brands as DIY shit. Lowes is for DIY customers because they also have aesthetically better looking home stuff.", "score": 0, "replies": [{"body": "Lowes was like 30 days and with receipt. HD is 90 days and no receipt if paid with card. No hassle to find the receipt and generous return window gave me less to worry about.", "score": 1, "replies": []}]}]}, {"body": "Home Depot has gotten worse and worse the last several years. Very little is in stock. Almost every appliance, flooring or tool is special order. It’s become an in person mail order catalog.", "score": 13, "replies": [{"body": "The largest home goods/home improvement warehouse in the world..", "score": 17, "replies": [{"body": "The building is large. No doubt. So is the company. They just don’t have anything I need from them in stock, like, ever.", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Lowes , Sams, Bestbuy, Bed Barh Beyond, Target and Walmart all seem to have everything I expect them to. They are, you know, major retailers who deal with “supply and demand” as well. \n \nLowes had 4 high end dishwashers in stock on that occasion. We just don’t bother with HD for that kind of thing anymore. It’s more hassle than it’s worth.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I hope so. It’s a business model evolution from straight retailer to store front intermediary on a larger number of goods and services. Perhaps they still need to work out the kinks but only in my area.", "score": 1, "replies": []}]}]}]}, {"body": "I understand, but their metrics are constantly upward", "score": 3, "replies": [{"body": "If I was an analyst I’d be impressed. \n\nAs a customer and I am constantly frustrated and disappointed. \n\nSounds like they have plenty of money to improve the customer experience now though.", "score": 3, "replies": [{"body": "That’s generally how it works lol, better the stock does, the worse it is for the consumer.", "score": 5, "replies": []}, {"body": "I’m also a customer, and I’ve had no complaints. To each their own", "score": 1, "replies": []}]}]}, {"body": "really? I just bought some drywall and it was in stock..", "score": 2, "replies": [{"body": "They have orange Powerade too. Everything is fine.", "score": 0, "replies": [{"body": "Indeed it is, good sir!", "score": 1, "replies": []}]}]}, {"body": "Lowes > Home Depot", "score": 1, "replies": [{"body": "Depends. I have a couple of them both within 30-45 minute radius of my house. \n\nThese are the qualities they share in my area.\n\nLowes pros:\n\nLighting\n\nAppliances (could just be my luck)\n\nFlooring\n\nMillworks\n\nLumber \n\nGarden\n\nCustomer service at stores near me.\n\nSpecial order system works well.\n\nLowes cons:\n\nOutdoor power sucks\n\nTools are strictly consumer grade\n\n\nHD pros:\n\nTools\n\nOutdoor power\n\nPaint\n\nHD cons:\n\nGarden\n\nLighting\n\nCustomer service is slipping\n\nSpecial order everything\n\nMore of a project management mindset than a hardware retailer with too many third and fourth party contractors handling off site warehousing and logistics. Means that when you have to order something (because they stopped carrying inventory for a ton of stuff) and the system fails, as it often does, it takes about 4 hours on the phone getting transferred all over creation to figure out where it broke and how to make it work. This inevitably falls on the customers shoulders.", "score": 1, "replies": []}]}, {"body": "On the flip side, I’m able to find what I need. You know you can search availability of stores online?", "score": 1, "replies": [{"body": "„¿ǝuıluo sǝɹoʇs ɟo ʎʇılıqɐlıɐʌɐ ɥɔɹɐǝs uɐɔ noʎ ʍouʞ no⅄ ˙pǝǝu I ʇɐɥʍ puıɟ oʇ ǝlqɐ ɯ,I 'ǝpıs dılɟ ǝɥʇ uO„", "score": 3, "replies": []}, {"body": "Same and The app is fantastic, so is curbside pickup.", "score": 1, "replies": []}, {"body": "I can do that with Amazon in my underwear on the couch. I expect to wait 2-3 days on stuff from Amazon. I go to the Home Depot store to buy stuff I need or want RIGHT NOW with my hands and leave with it. \n\nHD shouldn’t try to do what Amazon does. HD should do what it’s always done well.", "score": 1, "replies": []}]}]}]}, {"body": "Guess it depends on the store. The two I live by are huge and always have everything", "score": 3, "replies": [{"body": "You are very lucky. It used to be that way around here. \n\nAn example: we wanted a dishwasher. Went in and NOTHING we wanted was in stock. They had two dishwashers. Both were low end and black. Same with stoves and fridges. In fact, on several occasions the selection of scratch and dent was better than brand new items. Seriously. \n\nAnyway, I’m glad the stock is rewarding investors and some folks are having a better customer experience than me. I hope this continues and my experience isn’t indicative of widespread problems coming to roost soon.", "score": 0, "replies": []}]}, {"body": "Also like no people working there. They need double people on the floor than they do. Luckily you can locate what row items are in on their website. I guess that's what they are banking on. \n\n&#x200B;\n\nAnyways, this was the most obvious beat yet. The couple calls I bought Monday paid for my next ten HD trips. I go to HD consistently 70x a year and it's never been busier and prices are up. I was very confident in a beat but figured on single digit price movement or little movement. The calls seemed to have high premium so I played it pretty safe.", "score": 2, "replies": []}, {"body": "Similar but different in Bunnings here in Oz.  The shelves are full, just not of the specific items you want.", "score": 2, "replies": []}]}, {"body": "They didn’t necessarily have more volume , it’s just stuff cost more… they’re price gouging", "score": 2, "replies": []}, {"body": "Home Depot has better prices than Lowes in my experience, but Lowes seems to have a stable group of employees who know what they're talking about. \n\nI just bought 14 windows at HD and the old fart helping me was about as feeble minded as one can get.. nice guy though. He got one window wrong, fortunately I don't have to eat the price.. Lowes was quite a bit more even with the bid room pricing", "score": 1, "replies": []}, {"body": "Stop stop the bears are already dead!", "score": 0, "replies": []}, {"body": "most data is indicating low income people are almost maxed on credit... higher income consumers are moving to lower priced retailers... walmart saw an uptick in household who make 100k a year... this is all very bad because inflation outside of food and gas wont go negative and will remain sticky for another year or more... were about to plunge come end of year as consumers have little to no credit to keep up with price increases and discretionary spending will hit the breaks come fall... summer is over and winter is coming unfortunately... not to mention most peoples rents are rising as leases continue renewals.... and student loans will kick back in in the coming weeks... dems may postpose the recession to avoid midterm loses and extend student loan forbearance... people are confusing seasonality highs and earning beats on inflation driven prices for bullishness... the silliness in the markets is going to boil over soon... were getting closer to the tipping point", "score": 0, "replies": []}, {"body": "We really are never going to have another recession in our lifetimes are we", "score": -1, "replies": [{"body": "Deja Vu\nhttps://en.m.wikipedia.org/wiki/Great_Moderation", "score": 1, "replies": []}]}, {"body": "Har har munch on periodic puts on unsuspecting stocks that never saw it coming *wink*\n\nBut wait, he goes on SPY and tell it go drown in a pool of red for over a century, because... *roar*\n\nO lord he is just mauling billionaires by shaking their fat rockets with bolts...and money?\n\nNot surprising,  but what will ha-\n\nLOL\n\nA dummy wake up hoping the legit confusing times was all true.\n\nWhat a fool this person was.\n\nLaugh at the bear 🐻 \n\nO you want to join? Hold on let me get my shotgun.\n\nPump and aim\n\nReady?\n\n(What happens next? Find out \"Ya stupid delusional retail investor\". Only on CNBC *wink* )", "score": -5, "replies": []}, {"body": "Shoulda posted this 2 days ago", "score": 1, "replies": []}, {"body": "Sound like a solid hedjy", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "wq2ut2", "created_utc": 1660677234.0, "score": 56, "upvote_ratio": 0.83, "num_comments": 78, "comments": [{"body": "If you already sold and recognized 10k in losses, then you don’t pay GAIN taxes.  3k can be used to deduct from your income - the rest 7k carry over to future years.\n\nEdit:  this scenario only applies if your net loss at the end of the year is -10k.\n\n\nAlso it’s a bit early in the year to consider tax loss harvesting?", "score": 82, "replies": [{"body": "It's always a good time to be strategizing for tax loss harvesting.  If I have short term gains, I prefer to sell some of my short term losses before they change into long term losses - otherwise I'll need to pay the government more.\nBesides, OP is probably better off selling AMZN then immediately buying AAPL. Wait 30+ days until the wash sale rule passes, then sell some AAPL, buy back AMZN.  \nIf a stock drops 20% then it needs to gain 25% in order to just break even, and OP could be underwater for years with dead money. Heh. I have 10 shares of Ford that are still underwater that I bought as a teenager - I keep them as a reminder.  \n*Edit* I periodically review my TDA account for short term losses. The Gain/Loss tab has a column that says \"Long\" or \"Short.\"  Why let my short term losses convert into long term losses?  If I have short term gains, I want to offset those with short term losses. Not doing so wastes the opportunity to capture the maximum tax benefit from a short term loss.", "score": 7, "replies": [{"body": "Can you explain why long term losses are worse than short term losses? Is it only for this specific scenario that you have short term gains, and short term losses can cancel it out but long term losses will only cancel out long term gains, but normally a long term loss is better for us than short term loss? Thanks.", "score": 2, "replies": [{"body": "A longer-term loss indicates you've held the loss for over a year. True, you could've held the stock for a year and it was a gain, then it plummets.  \nThe overall point was: if you have short-term gains, those are taxed at a higher rate, so just off-set with short term losses (if you have them.)  \nBrokerages are now required to split out short term gains and short term losses. In general, it is best to get your gains to be as little as possible, otherwise you're going to need to write a check to the government. If you can push that check back for 1 more year, then you essentially have a higher net worth for 1 more year and more money to invest.", "score": 2, "replies": []}]}]}, {"body": "Ahhh ... That's not true.  If you have $10k in losses and $10k in short-term gains in the same year they cancel our and there would be zero tax liability.", "score": 5, "replies": [{"body": "I felt it was obvious my post was explaining why he didn’t need to sell.   Yes, capital gains tax applies to your NET gain/less at the end of the year. I edited for clarification.", "score": 9, "replies": []}, {"body": "OP wasn't clear on whether his losses were long term or short term.  Short term losses can offset short term gains or ordinary income, assuming OP has a job.  But long term capital losses come with the $3,000 limitation for offset against current year income.  The other $7K would carry forward indefinitely.", "score": 2, "replies": [{"body": "Hmmm ... I would think a loss is a loss.  Your comment has triggered me to understand more.  I'll be speaking with Dr Google today.", "score": 2, "replies": [{"body": "Otherwise people would simply hang on to losing capital assets indefinitely to offset ordinary income.  Dry oil wells used to be a popular tax dodge.", "score": 1, "replies": []}, {"body": "What JMLobo83 said:\nOP wasn't clear on whether his losses were long term or short term. Short term losses can offset short term gains or ordinary income, assuming OP has a job. But long term capital losses come with the $3,000 limitation for offset against current year income. The other $7K would carry forward indefinitely.\n\n----\n\nWhat he said is dead wrong.  If you have 100k long-term capital gain and 100k short-term capital loss then your tax liability is zero.\n\nShort term capital loss also has a 3k limit against ordinary (W2) income.", "score": 1, "replies": []}]}, {"body": "This article seems to say different.  Would like your thoughts.\n\n\"According to the tax code, short- and long-term losses must be used first to offset gains of the same type. But if your losses of one type exceed your gains of the same type, then you can apply the excess to the other type. For example, if you were to sell a long-term investment at a $15,000 loss but had only $5,000 in long-term gains for the year, you could apply the remaining $10,000 excess to any short-term gains.\"\n\n\n\nhttps://www.fidelity.com/viewpoints/personal-finance/tax-loss-harvesting", "score": 1, "replies": [{"body": "Google IRS capital loss deduction limits.  The correct answer pops up.\n\nAgain, we need to distinguish between long term and short term loss.  Long term loss deduction (for assets held longer than one year) is limited to capital gains recognized plus $3,000 deduction against ordinary income.  Ordinary income can be income from employment, rents, short term capital gains, etc.\n\nShort term capital loss (i.e. losses realized and recognized on assets held less than a year) can be deducted against ordinary income without limitation, other than the amount of ordinary income.\n\nFor example, I've foolishly bagheld TDOC for more than a year.  If I come to my senses and sell now, I will book greater than $3,000 loss for tax purposes.  Since I can only deduct $3,000 against ordinary income (my job), I can either sell some MSFT which I've also held for more than a year to zero out the capital loss deduction, or I can carry forward the TDOC capital loss to next year.", "score": 1, "replies": []}, {"body": "See also IRS publication Topic No. 409, Capital Gains and Losses", "score": 1, "replies": []}]}]}]}, {"body": "> the rest 7k carry over to future years.\n\nDoes that only applied to earned income or can it be carry over for next yr realized capital gain too?", "score": 1, "replies": [{"body": "Also,  do the losses automatically get carried over? Or is that optional when doing taxes, and if I didn't specify it last year, did it not carry over?", "score": 1, "replies": []}]}]}, {"body": "You can also rollover your losses to next year.", "score": 9, "replies": []}, {"body": "Sell stock, book $10k gains, rebuy stock, pay no taxes", "score": 25, "replies": [{"body": "Wouldn’t this get you no actual gains but also cost you a tax deduction?", "score": 12, "replies": [{"body": "Yes. It would eliminate taxes on $10k of future capital gains, however. Personally, I wouldn't sell as I'd rather have the income tax deduction from the losses, even if spread over multiple years, than the capital gains tax reduction. But the OP's scenario was what to do if he sold.", "score": 6, "replies": [{"body": "Selling would be not smart", "score": 1, "replies": []}]}]}, {"body": "Be mindful of the wash sale rule", "score": 15, "replies": [{"body": "Wash sale only applies when you sell for a loss and then re-buy within 30 days. No problem in selling for a profit and then buying it again the next trading session.", "score": 18, "replies": [{"body": "Selling gains is never a wash sales.", "score": 0, "replies": []}]}]}, {"body": "That rule is crazy lol", "score": -5, "replies": [{"body": "What rule?", "score": 1, "replies": []}, {"body": "I mean the rule makes sense", "score": 1, "replies": []}]}]}, {"body": "Do you want to exit those positions? What is your motivation to realize gains now? \n\nWhat’s the motivation to pull $X out, only to reinvest $X in the same stock?", "score": 4, "replies": [{"body": "I think he's thinking, \n\nBe has losses now,  why not cash out the gains and use the gains against the losses so he won't have to pay tax on the gains later. \n\nBut you can just roll your losses every year so this really isn't needed", "score": 1, "replies": []}]}, {"body": "Can't you sell and then re-buy again? The only thing you'd be losing is a fraction of the cost, but you'd be rid of your tax liability.", "score": 6, "replies": [{"body": "The topic creater would have to wait 31 days.  A lot can happen in 31 days and thats a big risk that he/she is gonna have to rebuy higher then sold.", "score": -11, "replies": [{"body": "He’s selling gains, so he doesn’t have to wait 31 days for the wash rule.", "score": 19, "replies": []}]}]}, {"body": "Hold", "score": 4, "replies": []}, {"body": "You can roll loses over to next year and I’m no expert but I thought only 3k were deductible a year anyway?", "score": 3, "replies": [{"body": "3k loss. 10k gain - 10k loss = $0 as outcome.", "score": 1, "replies": []}]}, {"body": "Take the tax lose at 3K for the next 3 years. Don’t sell your gains to finish even.", "score": 3, "replies": []}, {"body": "You are being poorly advised, and I would be very careful who you take advice from with the IRS ramping up big time.", "score": 7, "replies": []}, {"body": "sad pika face, i had to sell bunch at losses this year to pay gains for last year tax... overall suck.  good idea asking for advice.", "score": 2, "replies": []}, {"body": "Your family member gives bad advice.  You can carry your losses indefinitely and deduct 3k per year.  Generally, you want to avoid taxable events, and realize as few gains as you possibly can.", "score": 2, "replies": []}, {"body": "You really think selling your biggest winners is the best idea?", "score": 2, "replies": []}, {"body": "You can’t sell winners that won’t last to break even \n\nOr\n\nYou can hold winners expecting them to run more and carry over $7k in losses to the future while claiming the max or $3k this year \n\nOnly you know which is better, but don’t forget Sept is a Bitch & Biden lied about the economy last week when he said it’s awesome", "score": 1, "replies": []}, {"body": "Tax harvest/adjust in December, not in August when the markets are still down 10%", "score": 1, "replies": [{"body": "good point", "score": 2, "replies": [{"body": "It's not a good point. $10,000 in gains now are no different than $10,000 gains in December (assuming the gains are both long term or short term)", "score": 2, "replies": [{"body": "It’s worse than that. If you sell now and rebuy your taxes are zero, and you start accumulating gains in August instead of December. So when you cash out in October 2023 it will be long term gains at 15% instead of normal income tax rate. \nOnce you go under 3k of losses it always makes sense to sell for short term gains and rebuy.", "score": 3, "replies": []}, {"body": "Unless they are 20k in gains", "score": 1, "replies": [{"body": "Your comment makes no sense. If I sell enough stock in one or more companies to net $10,000 now or some other combination of stock later in the year to net $10,000 gain it's the same amount of money gained either way.", "score": 1, "replies": [{"body": "If you have 20k worth of tesla and sell 10k now, you now have 10k tesla. If tesla doubles by year end u now have 20k....instead of 40k. You missed out", "score": 1, "replies": [{"body": "There is no missing out. None. You sell enough stock to net $10k gains and then promptly rebuy it. Count the gain against your losses and pay no taxes.", "score": 6, "replies": [{"body": "Capital losses carry over in full if used against capital gains - no 3k limit. So it doesn’t matter. What can play a role is the holding period, but without any portfolio left to make short term call gains to make the most of the 10k losses…pretty much all strategies OP does, including nothing, are equivalent", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Why not just sell or hedge with covered calls? If you have the shares and want to keep them, then just sells calls. The other thing you should realize is that being breakeven and freeing up cash is never ever a bad thing. In that case, start selling puts. Basically wheel the stocks", "score": 0, "replies": []}, {"body": "Sell stocks, buy etf", "score": 0, "replies": []}, {"body": "You don’t sell for tax purposes. Only if you want to sell, wait 31 days and repurchase the stock you sold. Here are the rules for offsetting losses. It’s called the wash sale rules. Take a quick look at this in Google. \n\nNet all long term gains and losses. \nNet all short term gains and losses. \nIf one is a gain and the other is a loss, net again\n\nIf they are the same, (Both gains or both are losses) the retain their own character.", "score": -2, "replies": []}, {"body": "What about the reverse situation, you want to sell but have 100k in gains? You sell and now have a cap gains issue..", "score": 1, "replies": [{"body": "Then the gov't is gonna be getting a nice, fat check on tax day..", "score": 3, "replies": [{"body": "May sell other stock at loss to offset the gain?", "score": 1, "replies": []}]}]}, {"body": "I am down $40k on a stock. So theoretically I can go trade and make $40k in gainz, sell my loser stock which is down $40k, and not pay any taxes? Or is the max you can write off is $3,000? So I would be getting $3000 off my taxes for the next 13 years?", "score": 1, "replies": [{"body": "You can deduct capital losses up to the amount if capital gains.  If your losses exceed the gains you can use up to $3000 to deduct against income.  If you have lost more than the gains + $3k income deduction, the rest if the amount rolls to the following year.  Same ruies.\n\nExample: $50k gain in APPL, $20k loss in AMZN, $100k w-2 income\nDeduct losses from gain $50k -$20k, pay tax on $30k gain.\n\nExample: $50k LOSS in APPL, $20k gain in AMZN, $100k w-2 income\nDeduct $20k from $50k loss (zero tax liability) deduct $3k from regular income.  Next year, deduction Ny losses +$30k rollover (up to the amount of gains) +$3k for regular income.  Keep rolling forward what’s left of the withdrawal until it’s exhausted.", "score": 2, "replies": []}]}, {"body": "Your ordinary marginal interest rate is surely higher than the long term capital gains rate (15%). It would be smarter to deduct the $3k against that for a few years than waste the privileged cap gain rate for nothing.", "score": 1, "replies": []}, {"body": "I would just realize 3k every every year until you get it back.", "score": 1, "replies": [{"body": "what if I just keep losing money next year too then?", "score": 0, "replies": [{"body": "We’ll time in market beats timing the market. So like many have said, pick a good fund like vti or schd and make it 60-70% of your portfolio and never touch it. The rest you can bet on individual long term stuff if you want. \n\nFor me I like SCHD and I’m riding Amazon, Tesla, and Google. Power house companies that are going nowhere but up over time.", "score": 2, "replies": []}]}]}, {"body": "Slowly increase 75$ a paycheck makes a small difference . Many stocks good price .", "score": 1, "replies": []}, {"body": "Hold! Epic rally leading into October here", "score": 1, "replies": []}, {"body": "You are being way too dramatic.  You act like this move is the de facto end of your entire investing career.\n\nBuy it back in one month, just don't do it sooner due to wash sale rule.\n\nOr, park it in index funds for now.", "score": 1, "replies": []}, {"body": "Sell tomorrow, buy $BBBY and use the tax loss to offset your future gain.", "score": 1, "replies": []}, {"body": "That is a terrifying predicament to be in\n\nBest of luck to you either way", "score": 1, "replies": []}, {"body": "Cash is a position", "score": 1, "replies": []}, {"body": "I have $13k loss on crypto, the market will go up again for sure, maybe not tomorrow, maybe not next month but within some months YES. \nDon’t sell, and don’t tell the IRS about you holding stocks lmao.", "score": 1, "replies": []}, {"body": "That seems like bad advise to me.  You can carry losses over, nothing says you have to sell winners that could potentially continue to win just to zero out your losses.    \nMaybe I'm misunderstanding, I did read it fast.  lol.", "score": 1, "replies": []}, {"body": "Let’s just be honest your family member is clueless", "score": 1, "replies": []}, {"body": "I am holding on to my AMZN. I think it is going to be much higher after October earnings.", "score": 1, "replies": []}]}
