{"title": "Best stocks to buy for long term (10+ years) investment", "selftext": "I am considering investing $400 in the S&P 500 or Dow Jones Industrial Average. Anyone have any other recommendations? (This subreddit asked me to add more words so these words you’re reading are those.)", "id": "wuz2uw", "created_utc": 1661187810.0, "score": 27, "upvote_ratio": 0.75, "num_comments": 79, "comments": [{"body": "[deleted]", "score": 47, "replies": [{"body": "Why not VOO?", "score": 4, "replies": [{"body": "::groan::", "score": 8, "replies": []}]}, {"body": "Why would you recommend VTI over a less diversified stock such as S&P 500?", "score": 0, "replies": [{"body": "VTI and SP500 has close enough past performance that either is a tossup. Look at the top holdings and you’ll see how similar they are.", "score": 11, "replies": []}, {"body": "VTI is actually more diverse with 4000 companies vs 500", "score": 1, "replies": [{"body": "That’s what OP implied", "score": 9, "replies": []}]}, {"body": "You don’t have much equity, consider website that allows partials etfs, or a mutual fund like SWPPX. SP and Total market will always have similar performance. It really doesn’t matter", "score": 1, "replies": []}, {"body": "Because then you're placing bets on large cap outperforming. \n\nVTI = VOO + Medium & Small cap stocks. \n\nMight as well take the diversification and not guess who will outperform.", "score": 1, "replies": []}]}, {"body": "Agree,  except if I had only $400 I would buy the mutual fund version of VTI so you can purchase fractional shares and get every penny of that $400 invested. The mutual fund version of VTI is called VTSAX.\n\nVTI is trading at 207.xx right now, so OP can only get 1 share with $400.", "score": 1, "replies": []}]}, {"body": "MSFT", "score": 12, "replies": [{"body": "MSFT is a tough one for me. I like the money they make. And then I go to work and pull my hair out being forced to use their software.", "score": 16, "replies": [{"body": "Microsoft for me feels like and old company, but then i go to work and realise they still have a massive market to serve simply because i work for google and the SHIT chromebooks dont work so they switched to apple macbooks which interfere with every bit of infrastructure and after talking to techstop i go home thinking its a good time to invest in msft", "score": 6, "replies": [{"body": "That's good to hear that there are out there that appreciate their work. It might help to calm me in my next microsoft-fuelled rage at work. \"I hate it but they can't be *completely* incompetent because Dakana11 sees their value.\"", "score": 0, "replies": []}, {"body": "I don't own any MSFT but if I was just getting going and worried about 400 dollars, then MSFT is an excellent place to start. Decent dividend, product is everywhere, well ran business, huge growth potential...", "score": 1, "replies": []}]}]}]}, {"body": "Any of the beaten down big tech companies. We will always need more and more tech, so once everything goes back up they should be flying.", "score": 8, "replies": [{"body": "For real. \n\n&#x200B;\n\nIf anything one should be looking for tech companies that are enduring and aren't selling off in this bear market. Those will emerge as market-leading stocks when the bull market inevitably starts.", "score": 3, "replies": []}, {"body": "Marketing will take a big hit.  We've been in a bubble for a long time now, since QE was done, which really mispriced things.  People now rely heavily on real estate for their retirement, so if that crashes peoples spending will dry up.  Marketing is very cyclical, this is why.", "score": 1, "replies": []}]}, {"body": "Id say my highest conviction long stocks are:\n\nAAPL.  NVDA.  Goog.  MSFT. COST. UNH. AMZN. F. NKE.", "score": 13, "replies": [{"body": "That’s right, fuck Nike", "score": 28, "replies": [{"body": "Damn homey.  What nke do to you? Lol", "score": 2, "replies": [{"body": "Just how I read your list, lol", "score": 8, "replies": []}]}]}, {"body": "Except Ford i got every one of these", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "Intels got existing revenue and they are releasing a GPU as well, and Mobileye.\n\nFor some reason they are being given billions of dollars from governments as well.  They have more money than Nvidia, much larger revenue streams, I'd assume they can compete.", "score": 1, "replies": []}]}, {"body": "Apple Inc. (NASDAQ: AAPL)\r  \nAlphabet Inc. (NASDAQ: GOOG) (NASDAQ: GOOGL)\r  \nQUALCOMM Incorporated (NASDAQ: QCOM)\r  \nShopify Inc. (NYSE: SHOP)\r  \nAdvanced Micro Devices, Inc. (NASDAQ: AMD)\r  \nSoFi Technologies, Inc. ...\r  \nThe Walt Disney Company (NYSE: DIS)\r  \nCrowdStrike Holdings, Inc.", "score": 18, "replies": [{"body": "Sofi? Lol really", "score": 3, "replies": []}, {"body": "SHOP really? 😆", "score": 2, "replies": []}, {"body": "Sofi? Lol really", "score": 0, "replies": [{"body": "yes", "score": 8, "replies": []}]}, {"body": "Isn't this basically the same as investing in SPY or VOO lol", "score": 0, "replies": []}, {"body": "I don’t get the appeal with Sofi. What do they have that other banks don’t? Doesn’t all banks operate online these days?", "score": -1, "replies": [{"body": "This argument could be made about many successful company.  All phones are pretty much the same, all cars are pretty much the same, all retail stores are pretty much the same.  \n\nWe will just have to see if their product is differentiated enough.", "score": 1, "replies": []}]}, {"body": "Where’s Amazon?", "score": 1, "replies": [{"body": "Not on this list because its online service dept will not be leader and someone will surpass it. AWS alone is not enough.  Company needs to break it up by then.", "score": -1, "replies": []}]}]}, {"body": "NVDA", "score": 5, "replies": []}, {"body": "invesco solar energy etf, currently going down a bit after a big run, certainly a solid long term hold. The big caps should all be safe bets for many years, some lithium plays, rare earths.", "score": 2, "replies": []}, {"body": "ASTS - Starlink for Smartphones, no expensive equipment,1.8 billion potential customers lined up, impossibly deep moat, big industry partners/customers, 100x potential.", "score": 2, "replies": []}, {"body": "Probably $BLK", "score": 2, "replies": []}, {"body": "iShares Genomics Immunology and Healthcare ETF", "score": 3, "replies": [{"body": "I hate this space because it’s so speculative but if it tracks like the XBI I’d be a buyer - just too beaten up and there will be big winners.", "score": 1, "replies": [{"body": "Yeah this is a far in the future etf and i dont know wich one is gonna be the biggest. So i just buy the etf.", "score": 1, "replies": [{"body": "from what I understand, picking in this sector is the way to go but I think the ETFs are looking mighty attractive at these levels.", "score": 2, "replies": []}]}]}]}, {"body": "Investing in individual companies means constant monitoring of the market and knowing if something is changing with your assumption of the companies.  Instead, invest in the overall market and forget about it.  VOO and VGT", "score": 3, "replies": []}, {"body": "Tough to say.. with $400 I'd probably get a few nice massages", "score": 2, "replies": [{"body": "You can get 2.5 shares if you get a happy ending", "score": 3, "replies": []}]}, {"body": "Gold and silver miners (GDX,GDXJ), uranium miners (URA,URNM), coal (BTU), agriculture (DBA), natural gas (FCG), oil (XLE,XOP). In that order. Love the last 2 nat gas and oil but they've already run far whereas the others are just getting going with the exception being gold and silver miners are not even out the starting gate.  They're all ETF's except for BTU (there's no coal ETF) so you'll own a bunch of companies. DBA is different than the rest because it just tracks the price of agriculture commodities, there are no companies in that ETF. \n\nMost of these were up today or flat while the markets got crushed. Commodities haven't been this cheap relative to the market since the year 2000. That year the dot com bubble burst and commodities went on a multi year bull run outperforming the stock market. Right now the S&P 500 is too heavily weighted with overvalued tech stocks that I think are going to continue to have some bad years ahead. The index will readjust over time but in the mean time it will languish. I could of course be wrong.\n\nThis is a stock sub so I recommended stocks. But if I had $400 to invest I would buy a 1/10th ounce gold coin and about 6 or 7 ounces of silver from your local coin shop and keep them in your possession.", "score": 2, "replies": []}, {"body": "Lol people acting like META won’t be around 10 years from now. They will be monetizing some sort of avenue(s) of their VR/AR development. Their social media might not be as popular, but I doubt it’s existence will be erased like MySpace.\n\nRemindMe! 8 years", "score": 1, "replies": [{"body": "Instagram.com is still a thing", "score": 1, "replies": []}]}, {"body": "Your better off putting your money in an index fund or a mutual fund.\n\n&#x200B;\n\nYou get the same results without any of the stress", "score": -1, "replies": [{"body": "You won’t get the same results as a highly concentrated portfolio, but definitely less stress if you’re prone to that.", "score": 6, "replies": []}]}, {"body": "10 years buy BRK", "score": 0, "replies": []}, {"body": "I would stick to ETFs or mutual funds if your risk tolerance isn't super high. VOO and VYM are good. \n\nIf your risk tolerance is super high I would recommend INTC but it is risky. In 10 years they will either dominate in the semiconductor space or they will collapse under their own weight. Another one would be MU, this one is a bit safer as a semiconductor stock than INTC but still a fair amount of risk.", "score": -2, "replies": []}, {"body": "TSLA", "score": -9, "replies": []}, {"body": "INTC", "score": -1, "replies": []}, {"body": "with 400 I'd build a business like an affiliate marketing website -- build that up for 2 years then invest \n\nwordpress", "score": -1, "replies": []}, {"body": "$GME is the only choice, just DRS and forget about it", "score": -11, "replies": []}, {"body": "PLTR. Ignore all the fud. It will be $50-75 in 5 -7 years and over $100 in 10-12", "score": -16, "replies": [{"body": "😹", "score": 11, "replies": []}, {"body": "If you do this, make it a small % of your portfolio please", "score": 0, "replies": []}]}, {"body": "GCT and VIZIO", "score": 1, "replies": []}, {"body": "Rycey", "score": 1, "replies": []}, {"body": "Schw, ssnc, lvmuy, seic.", "score": 1, "replies": []}, {"body": "It’s 400 bucks just pick any well known stock or etf", "score": 1, "replies": []}, {"body": "Buy a single call LEAPS in SPY", "score": 1, "replies": []}, {"body": "Schd. Add every paycheck.  Retire well off", "score": 1, "replies": []}, {"body": "Snowflake, crowdstrike, iron mountain, google, UBER, charge point, and adobe.", "score": 1, "replies": []}]}
{"title": "BBBY super bull thesis", "selftext": "Before I get comments calling me a bot, ive been a lurker for a year so not much karma but ive been holding a humble position of just 478 shares at 10.68..\n\ngonna start off with saying yeah i do regret not selling at the top as im sure alot of you do as well as much as youd not like to admit that, but assuming just like i you didnt expect it to peak at 30. and my fellow apes who will have to forfeit their wives to their respective boyfriends due to selling at a loss i do sympathize with you but this is where legends are made, right? or legendary autists on the contrary..\n\nbtw i have no evidence/TA for this thesis its just a working thesis, im sure there are apes here that are better qualified for the technicals behind this thesis if there are any..\n\nenough words i guess here goes..\n\nDespite MSM fud, BBBY does not announce bankruptcy and perhaps the announcement ends up being a positive one at that, retail starts fomoing in like clockwork, which drives the price up, at this point squeeze has potential, but imagine if and this is pure speculation here, Elon jumps in with a sizeable position, shorts r fuk?? \n\nnow you might be wondering why for the love of god would elon jump in? and that would be a very valid question. IF he did, the simple reason would be because he hates hedgies that short companies to death with naked shorts just as much as RC and us apes, and there is already some evidence of a connection between RC and elon, so just a plausible theory imo. \n\nTLDR; im a bagholding regard and just speculating for hopium but feel free to throw salt on my wounds if youre a gay bear\n\ntried posting this on the BBBY sub but wouldnt let me, apologies as i know alot of yall here are tired of this stock or have moved on\n\nedit: im fairly confident elon hates hedgies bcz i know hes had issues with aggressive unreasonable shorts on tesla for no reason because retail loves the stock", "id": "wufskx", "created_utc": 1661130538.0, "score": 9, "upvote_ratio": 0.52, "num_comments": 71, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous DD**|\n**Account Age**|9 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wufskx)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wufskx)", "score": 1, "replies": []}, {"body": "[ Removed by Reddit ]", "score": 59, "replies": [{"body": "my parents are 1st cousins so its a very high possibility", "score": 55, "replies": [{"body": "It's starting to make sense.", "score": 9, "replies": [{"body": "I’m feeling a lil retarded too actuallly. Might be those crayons. YOLOOOOO", "score": 10, "replies": [{"body": "Bro share some of that shit.", "score": 5, "replies": [{"body": "Are we yolo’inf or no?", "score": 7, "replies": [{"body": "I got some NyQuil bro so that 9:30 comes faster.", "score": 2, "replies": [{"body": "Does that shit actually work? I tried melatonin gummies and pills and swear I stayed up all night like nothing happened, the gummies were worse cuz sugar made me more awake", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}]}]}, {"body": "Bama baby.", "score": 0, "replies": []}, {"body": "Even higher chance if your grandparents were relat…. Ohh nvm.", "score": 1, "replies": []}]}, {"body": "After reading the post I may now also be", "score": 3, "replies": []}]}, {"body": "There’s no need to speculate on hopium when there’s the buy buy baby & Regsho DD.", "score": 36, "replies": [{"body": "![img](emote|t5_2th52|8883)Who is regsho DD? Sorry I’m a newb here ![img](emote|t5_2th52|8883)", "score": 5, "replies": [{"body": "Reg Sho means the shorts are required to cover. Ryan Cohen bought his shares 4 months ago and had nothing to do with this squeeze. The Hedgefunds just want you to think it is over. WSJ posted an article over the weekend confirming the shorts are down hundreds of millions right now because of us.", "score": 4, "replies": []}]}]}, {"body": "Sounds pretty cool to me. We ride at dawn!!", "score": 14, "replies": []}, {"body": "I think I got more regarded reading this, thanks.", "score": 9, "replies": [{"body": "Then that’s it? Ride or no riding the dawnish hour?!! YOLOOOOO", "score": 3, "replies": []}]}, {"body": "all we need is for BBBY to go viral on other platforms like twitter or tiktok and we will be set. a tweet from elon will definitely gather the attention.", "score": 8, "replies": [{"body": "this is why andrew Tate was banned he would have pushed this shit so far", "score": 2, "replies": []}]}, {"body": "What you guys think about homedepot and lowes stock? They are always full when I go there for materials!", "score": 5, "replies": [{"body": "Depends, does SpaceX need building supplies?..../s", "score": 4, "replies": [{"body": "they do to build in Mars lol", "score": 2, "replies": []}]}]}, {"body": "Things that make you go hmmmm.", "score": 4, "replies": []}, {"body": "Believe in me I believe in you", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|4887)", "score": 4, "replies": []}]}, {"body": "Elon is totally going to fomo in", "score": 5, "replies": [{"body": "This is why tesla sold all its bitcon? Full corn position into $BBBY? I bet he sells half at $69 and half at $420.", "score": 6, "replies": []}, {"body": "Maybe or maybe not. I’m curious for sure. Seems like his type of play", "score": 3, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|12787)", "score": 2, "replies": []}]}, {"body": "What is your thesis ?", "score": 3, "replies": [{"body": "his dad just had a baby?? mf idk it clearly says this is speculative place your bets and go", "score": 1, "replies": [{"body": "Your headline states super bull theses .\nMaybe I need to look up the definition of bull ?", "score": 2, "replies": [{"body": "headline? sir this is a casino not a news agency", "score": 3, "replies": [{"body": "I'm not the one writing a \" super bull theses \" with no reasons to be bullish . All I asked is what is your thesis ? \nNo need to overthink this", "score": 1, "replies": [{"body": "seems youre more regarded than i am, im bullish on the announcement which im speculating could trigger a squeeze as shorts have clearly been doubling down for the past week as per AH massacre. bulls would have to regain control to trigger it which is where my thesis comes in but it would be similar if not more explosive than GME squeeze, assuming bulls can regain control of volume", "score": 1, "replies": [{"body": "Have you considered that when the stock ran up into the high 20's that the shorts realized they screwed up and now double downed in an attempt to get their money back ? And now the shorts are just looking to exit .\nI'm under the impression that the company will be making an announcement of some sort near or at the end of the month .\nI will assume that regardless ( or retradless if you like ) of the news the stock will then run back to the upside .\nI suppose the news story will be some BS like bbby announces ( what ever story ) and the market likes it . But in truth it's just going to be short covering . \nThat implies a positive September for the stock and is pure speculation on my part .\nAnyone can go long a stock but it takes more skills to successfully trade to the downside . Nobody holds short forever .\nJust my thought obviously none of what I wrote implies that the bulls gain control at all.", "score": 2, "replies": [{"body": "The shorts didn't lose anything because they didn't cover their short position. They just made all the paperhands sell to drive the price down. The stock is more short than ever.", "score": 1, "replies": [{"body": "If you think so yet that wasn't my point .\nHere is a link for some reading material for you to choose from .\nhttps://www.investopedia.com/articles/active-trading/041515/worlds-10-most-famous-traders-all-time.asp", "score": 1, "replies": []}, {"body": "If you think so yet that wasn't my point .\nHere is a link for some reading material for you to choose from .\n..\nhttps://www.investopedia.com/articles/active-trading/041515/worlds-10-most-famous-traders-all-time.asp", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Not as much as I regret buying at the top. But hey, it was a small position and there are some good reasons to believe this might not be over yet.", "score": 3, "replies": [{"body": "its no easy task to time the top perfectly, my utmost respect to you sir", "score": 3, "replies": []}]}, {"body": "Tesla could buy BBBY and use the stores as a dealership for their vehicles. Because Tesla currently doesn’t have dealership infrastructure", "score": 3, "replies": []}, {"body": "I’m hoping any announcement is AH so I can buy more cheap shares during regular hours.", "score": 3, "replies": []}, {"body": "Do you remember Elons tweet about buying Manchester United? Guess who said he was gonna buy Manchester City? Kenny hedgecuck Griffin. City and United are the biggest rivals. Also Elon has like 12000 kids so he would probably be interested. You might be onto something OP. \n\nAll in Monday 🚀", "score": 2, "replies": []}, {"body": "I wanted to read the post but just couldn't, sorry.", "score": 2, "replies": [{"body": "It’s ok, words are tough when you’re out here having some 🍉👀👍", "score": 3, "replies": []}]}, {"body": "With the logic demonstrated here, I don't think being a \"gay bear\" is the limiting criteria of those to *'throwing salt on your wounds'...*\n\nI'm thinking mere high school graduates or people born in months that have A's or R's in them are pretty much warranted in taking their clean shots at you...\n\n&#x200B;\n\n&#x200B;\n\n*\"tried posting this on the BBBY sub but wouldnt let me, apologies as i know alot of yall here are tired of this stock or have moved on\"......* that didn't make you reread this?", "score": 2, "replies": [{"body": "Like i said this is pure speculation, just as you are doing right now.. warrant it for what reason? why is your/their speculation better than mine? you got any evidence to back your clearly opposite thesis? exactly so youre just as likely to be right as I", "score": 1, "replies": [{"body": "so just post random shit?\n\nevidence? clearly back my opposite thesis?\n\nObserve:\n\n*Don't call it a comeback, I been here for years, rockin my peers puttin' suckas in fear. Get your hands out my pocket!!! Can you fuck it? Boom goes the dynamite. Deeeeeeez nuts. Welcome to firehouse.  ooga booga.*\n\nYes, you are 100% correct, my speculation, is exactly equal in value to yours.... \n\n....apologies", "score": 1, "replies": []}]}]}, {"body": "Lomo did giveaway a tesla to a lucky winner earlier this year 🤷‍♀️", "score": 1, "replies": []}, {"body": "I'll  ask Elon and give y'all the answer.", "score": 1, "replies": []}, {"body": "I rolled very slowly into the comment section, with only one eye open.", "score": 1, "replies": [{"body": "good call, better to only go half regard rather than full", "score": 1, "replies": []}]}, {"body": "Elonbathcoin", "score": 1, "replies": []}, {"body": "Stop praying for rich people to pay your broke ass", "score": 1, "replies": [{"body": "LMAO unless you were born into wealth, were both praying for someone rich to pay us. thats just how the world works my friend. the only difference here is that im praying to get paid handsomely without having to do any actual work, which i would argue doesnt make me much different from an ape like you wandering this sub🧐", "score": 1, "replies": [{"body": "Na, fam. I work my ass off. Difference is I love what I do, I know my work pays and my investments will make for nice little cherries on top. But it's the journey, not the destination.", "score": 1, "replies": [{"body": "fair enough and more power to you, i do appreciate your opinion and maybe some day i will become as passionate as you are about trading my time for money however that day is not today lmao but im okay with being broke until then i guess, unless i hit it big then you better hide your wife", "score": 1, "replies": [{"body": "Sheeeeit, I'm gonna die alone whether you sleep with my wife or a watermelon. But I respect your joie de vivre.", "score": 1, "replies": []}]}]}]}]}, {"body": "Hahahahaha since when was thesis a synonym to wishful thinking", "score": 1, "replies": []}]}
{"title": "I yolo'd a lot of my budget for the next 3 months on food for BBBY for a quick flip and didnt expect the crash but at least I'm still eating gourmet every night", "selftext": "", "id": "wv8luu", "created_utc": 1661210721.0, "score": 110, "upvote_ratio": 0.88, "num_comments": 70, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|19|**First Seen In WSB**|3 months ago\n**Total Comments**|12|**Previous DD**|\n**Account Age**|5 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wv8luu)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wv8luu)", "score": 1, "replies": []}, {"body": "Be patient young Padawan, an announcement is coming soon.", "score": 28, "replies": [{"body": "\"Everyone we have an exciting announcement! We're going bankrupt!\"\n\n\nI'd be laughing my ass off while I roped.", "score": 15, "replies": []}, {"body": "*crashing intensifies*", "score": 6, "replies": []}, {"body": "Yes an announcement of delisting …. The cosmic ballet goes on …. I’ll have another can and a nice powers whiskey chaser…. I care less about a loss each one I pour 👍🏻", "score": 2, "replies": []}]}, {"body": "You got any to spare? I’m pretty hungry. Will be until bbby comes through.", "score": 11, "replies": []}, {"body": "Fancy! Dino nugs in a frying pan. Puts on $AIR FRYER", "score": 8, "replies": []}, {"body": "Who cooks their Dino nuggets like this?", "score": 8, "replies": [{"body": "Better than the oven or microwave for sure.  Just a bit more work.", "score": 7, "replies": [{"body": "Two words for you\n\nAir Fryer", "score": 5, "replies": [{"body": "Maybe he can use a 20% coupon…", "score": 2, "replies": [{"body": "If not Costco has a really good one with two drawers so you can cook two things at once. Pretty inexpensive as well. Plus you get a bonus hotdog", "score": 2, "replies": []}]}, {"body": "Air fryer is just cheap Chinese convenience machine for lazy, taste bud lacking, neverchefs", "score": -2, "replies": [{"body": "Not really....it's literally a compact, counter-top convection oven. Pretty sure that those are used in famous kitchens around the globe.", "score": 2, "replies": []}, {"body": "It's a tiny oven my guy. You can have great meals out of it if you know how to season. Sorry you're too regarded to know anything.", "score": 1, "replies": [{"body": "It causes higher risk of cancer my dude. Sorry your envisions of convenience block the truth about the harmful effects of using such Products", "score": -3, "replies": [{"body": "People say that about everything. Source my guy", "score": 1, "replies": [{"body": "Dyor, you want Shit handed to you without putting in the work. I’m not a air fryer. Not here for your convenience . Believe or don’t  I don’t care.", "score": -1, "replies": [{"body": "The multiple posts regarding what people use to cook with proves otherwise smooth brain. Gfym", "score": 1, "replies": [{"body": "No you gfym in fact I will do it for you", "score": -1, "replies": [{"body": "You couldn't handle my mom. Have fun trying though. Don't cry to me when she knocks your lights out. \n\nThe fact you won't post a source only tells me you have nothing. \n\nPeople have said that about everything. Get over yourself.\n\nYour name still checks out.", "score": 1, "replies": [{"body": "Lol I can’t even call it cooking keep whatever air frying your foods allowing chemicals to leech into your foods weirdo", "score": 0, "replies": [{"body": "You're the one with a hate boner for how people cook their food and I'm the weirdo? \n\nCan you speed up the rate to when you're perma banned. Right now would be pretty dope.\n\nGo hug a tree hippie", "score": 1, "replies": [{"body": "Lol What upset you? The lack of taste buds comment or the neverchefs?", "score": 0, "replies": [{"body": "Says the guy who is offended by a kitchen appliance", "score": 1, "replies": []}]}, {"body": "Sorry your parents never taught you how to cook using an stovetop or oven…. Always had to use the microwave toaster ovens and instant pots ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 0, "replies": [{"body": "$20 says I can out cook you.", "score": 1, "replies": []}]}]}]}, {"body": "Relax this account will be permaban in a week", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Nevermind, name checks out", "score": 0, "replies": []}, {"body": "Higher risk of cancer vs what? Eating raw vegatables?", "score": 1, "replies": [{"body": "Vs using other cooking methods regard", "score": 2, "replies": [{"body": "So an air fryer, which is just an oven with circulating air, has a better chance of giving you cancer vs an oven without circulating air?", "score": 1, "replies": [{"body": "Dyor I’m not here to convince you for one or the other. Keep using cancer oven idc", "score": 1, "replies": [{"body": "Lol got it. Learn how to critically think before going around calling people \"regards\". Obviously air fryers are more likely to give someone cancer if they're constantly using it to cook crappy, highly processed foods. Correlation doesn't equal causation", "score": 1, "replies": [{"body": "Yea just keep defending using cancer causing products…. \nLike I said I don’t care. You are the typical American regard who choose convenience over safety", "score": 1, "replies": [{"body": "🦅🦅🦅", "score": 1, "replies": [{"body": "There is literally nothing American to be proud of…. The military is worlds largest criminal terrorist organization. The politics are a joke. Infrastructure is Shit. Indoctrination centers can’t even teach the basics.", "score": 1, "replies": [{"body": "Sorry I can't hear you over the sound of my air fryer. It sounds and smells like freedom 🦅🇺🇲", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)\n\nThat’s not freedom it’s propaganda.", "score": 1, "replies": [{"body": "I honestly feel bad about using the word \"regard\" around you. The US government isn't using air fryers for propaganda.\n\n  \n\n\nSure, military funding Hollywood movies or doing those Jet flyovers at sporting events can be considered propaganda. But air fryers are not propaganda.", "score": 1, "replies": [{"body": "Idk who is more regarded you or I…. Holy shiet", "score": 1, "replies": [{"body": "Haha finally something we can agree on. Have a good day man.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "And I already have one.  How have I been missing out?  My kid is gonna be happy next time.  13 still loves em.", "score": 1, "replies": [{"body": "I rarely use my oven since I bought the air fryer. It's a magical device", "score": 2, "replies": [{"body": "Iike the sous vide as well.  Hope I spelled that right.", "score": 1, "replies": [{"body": "I've sous vide a few things for work, but I don't have a home unit. I would love one though. You can make some rad meals with that", "score": 2, "replies": [{"body": "Buddy at work turned me onto it.  He went full out when they were still kind of new.  I couldn't justify what he spent but for a cheaper version later on.  Cool steak in a bag in water....no way.  Then he had me try a strip he did.  I couldn't wrap my head around it at first.  Still grill, but that thing is amazing.", "score": 1, "replies": [{"body": "Phthalates will leech into your foods cooks sous vide. \n\nPhthalates will run the risk of your future children being impotent or reproductive issues including gender identity.", "score": 0, "replies": [{"body": "You just have a hate boner for all modern cooking methods hey?\n\nAnd I'm there weirdo right?\n\nLoser", "score": 1, "replies": [{"body": "Okay", "score": 0, "replies": [{"body": "Alright it's settled, if I ever get wishes, could be 1 could be 3 I don't care, I'm wishing to know your location the moment you get cancer so I can come to you and laugh in your face for tip toeing around it and getting it anyways", "score": 1, "replies": [{"body": "Just laugh at me now. I’m likely to die of some heart disease. You can just send me a video. Link it to me and I’ll play it when I’m too late diagnosted and have 90% of dying", "score": 1, "replies": [{"body": "Nah man, I really want to savour the moment. Just be thankful I'm not using 1 of those 3 to give it to you then coming to laugh at you, because honestly I wouldn't wish that on anyone. Cancer sucks bruh.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Be nice, he only has a propane camp stove. Can’t be turning on a whole ass oven in this economy.", "score": 1, "replies": []}]}, {"body": "look at them tendies", "score": 3, "replies": [{"body": "They ain't Wendy's but time are tough for bbby crew", "score": 1, "replies": []}]}, {"body": "Trying to actually fry precooked dinosaur nuggets is the saddest thing I’ve seen on this sub. Get a grip.", "score": 3, "replies": []}, {"body": "Dinosaur chicken is the shit", "score": 2, "replies": []}, {"body": "If you sell that gourmet Teflon pan, you might be able to upgrade your diet to some beef ramen for a week or two. Imagine", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Those aren't even the good dino nuggies, I'm so sorry.", "score": 1, "replies": []}, {"body": "Better save the oil friendo", "score": 1, "replies": []}, {"body": "Love it!", "score": 1, "replies": []}, {"body": "Pro tip. Go work as dishwasher in some restaurant, free proper nutritious food.", "score": 1, "replies": []}, {"body": "Seriously can’t find Dino tendies anywhere, been trying", "score": 1, "replies": []}, {"body": "한국 사람이닷 ㅋㅋ", "score": 1, "replies": []}, {"body": "Not even the name brand Dino nuggets", "score": 1, "replies": []}]}
