{"title": "Curious why is everyone so bearish in TSLA?", "selftext": "[deleted]", "id": "bdn23u", "created_utc": 1555372070.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 83, "comments": [{"body": "because it has tons and tons of growth priced in and an uncertain path towards realizing that growth", "score": 13, "replies": [{"body": "I mean compared to all the unicorns that produce nothing it’s fares pretty well. At least it produces cars people drive not clicks on photos like Facebook", "score": 5, "replies": [{"body": "TSLA's revenue was ~$21.5B last year.     \n     \nFB's revenue was ~$17B last quarter.    \n      \nMarket cap is $50B vs $500B, respectively.     \n     \nI like tangible products, too, but TSLA is a gamble while FB prints money.    \n    \nE: ffs. Obvious troll is obvious, and I was too dumb to read his other comments. Fucking idiot.", "score": 3, "replies": [{"body": "“They trust me. Dumb fucks. “ his words not mine. \n\nFacebook made up numbers go as far as zuckerbergs history of trust. \n\nHows their Bangladeshi click farm going these days?", "score": 1, "replies": [{"body": "Facebook brings in 1/5 of all digital ad revenue.  FB and Google are actually responsible for disrupting the ad universe--total digital ad spending is \\~$120B in the USA...print is now down to \\~$90B.  This is why FB is worth far far more than TSLA...oh, they also make a profit, something TSLA certainly doesn't do..", "score": 1, "replies": []}]}]}]}]}, {"body": "Cool business != financially sound business", "score": 7, "replies": [{"body": "Is Facebook or Snapchat financially sound? What do they actually produce?", "score": 1, "replies": [{"body": "Fucking gobs of user data and revenue. Fb is overwhelmingly in a better financial spot than Snapchat", "score": 5, "replies": [{"body": "But what does fb produce that people can use in their lives ?", "score": -3, "replies": [{"body": "Is that your definition for a good business idea, or are you asking for a different reason? 2019 business theory is not 1969 business theory.\n\nIt produces things that other companies, not individual people, will pay lots and lots of money for.", "score": 8, "replies": [{"body": "You make absolutely zero sense in your reply. Please try again.", "score": -12, "replies": [{"body": "Are you familiar with what user data is? I can explain if you’d like!", "score": 5, "replies": [{"body": "I know but that’s not called production it’s just  old media with a new spin.", "score": -4, "replies": [{"body": "Well whatever you want to call it, other companies paid 55 billion for it in 2018! Sooooo old media with a new spin seems to work very well for them", "score": 3, "replies": [{"body": "Facebook has been caught using click farms in Bangladesh and charging its advertisers. \n\nMany companies also pulled their ad budget because all they got from fb ads was spam traffic not any actual sales or leads.", "score": 1, "replies": [{"body": "And when you’re the biggest treasure trove of user data in the world, such issues don’t really get in the way no matter how fraudulent they are. I mean, are you up to speed on all the privacy issues Facebook has? Yet people keep using them, which means the money will keep flowing.", "score": 1, "replies": [{"body": "Not my problem that ppl are stupid and use fb. But anyways", "score": 1, "replies": [{"body": "Bottom line: Facebook has 1.8 billion active users, doesn’t care what you think, and sells all their data menacingly for billions each year. Moral? Of course not. Great business model? Indeed.", "score": 1, "replies": [{"body": "When you pull your nose from Zuckerberg’s and Facebook’s ass let me know cause I could give two shits about a company who makes their living from stealing personal data and selling it to the highest bidder that does doesn’t even exist in Bangladesh.", "score": 1, "replies": [{"body": "Lol wait why should I let you know what happens then", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Facebook produces profits, they have actual earnings.  They sell ads, and have enough eyeballs on the site that people pay a lot of money.  Its not a tangible or durable good, but that doesn't change the fact that they are profitable.  Tesla makes nice things, but they don't make money...", "score": 2, "replies": [{"body": "Their long term vision is to get enough cars on the road and then make money off software, like FSD.  If you believe that they can do it, they too, will be printing money, at a much larger scale than other tech companies.  If you don't, stay away from the stock.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Because I have shares, obviously", "score": 5, "replies": []}, {"body": "why are you so bullish?", "score": 4, "replies": [{"body": "I’m not just curious", "score": 3, "replies": [{"body": "He’s bull curious", "score": 11, "replies": [{"body": "[tobias killin it ](https://m.youtube.com/watch?v=J0PiYS7yUyU)", "score": 4, "replies": []}]}]}]}, {"body": "Tesla hasn't been profitable, and hasn't hit their own targets.  If they can have success in the tighter margins of the commuter/family car segment they could become huge, but their price already reflects that.  As people are questioning if they can, and when they will be able to do this they are starting to think that Tesla is overpriced.  There are also a lot of concerns about their financials/books.  Sometime in the last week or so someone posted some dd on some red flags associated with Tesla's financials.", "score": 2, "replies": [{"body": "But Facebook is correct?", "score": 1, "replies": [{"body": "I think FB has been making money for the last 3 years...  They are profitable and so they are much less of a risk right now.  I don't care for FB as I think their product is probably worse for society than cigarettes and I hope they collapse spectacularly at some point in the future, but from a business/financial perspective they are much more sound, and they control almost the entire social media market as pertains to ad revenue, giving them a pretty sizable portion of the overall internet ad market.    \nTesla does not control very much automotive market share.  I think they have like 80% of the EV market share in the US, but less than 2 percent of the total automotive market share.  As the big automakers begin to produce competing vehicles they can afford more losses on their EV models as they are offset by the rest of their vehicle sales.  This will make it nearly impossible to compete on price so Tesla will have to rely on branding and R&D/features to try and maintain their market share in EV, something that seems like a risky bet.    \nWho knows, maybe they beat everyone to market with self driving software by a wide margin,  that would mean way more to me as a consumer than how I power my car... but that is speculation at this point.", "score": 1, "replies": [{"body": "Geez I didn’t know Facebook had so many paid troll on reddit.", "score": 1, "replies": []}]}]}]}, {"body": "Because every other vehicle manufacturer is 20x cheaper", "score": 2, "replies": [{"body": "Other electric car manufacturers???? Which ones?", "score": 1, "replies": [{"body": "Quite a few are beginning to produce electric cars, not in the same capacity as Tesla I’ll give you that. It all come down to what kind of premium the market is willing to give Tesla for its growth prosepects. We’re quite far from nationwide adoption of these types of vehicles.", "score": 2, "replies": [{"body": "But you said other manufacturers make it 20x cheaper. So now you saying they are not electric car manufacturers I’m confused", "score": 0, "replies": [{"body": "I said other car manufactures are 20x cheaper. Meaning their stock price and valuation. Jeez you’ve got your panties up in a twist tonite don’t you sport ?", "score": 3, "replies": [{"body": "Let’s compare apples to apples.", "score": 1, "replies": []}]}]}]}, {"body": "Also I think it’s because of how volatile Elon Musk has been acting in the past year. Guaranteed the market discounts Tesla based on the risk associated with him at the helm.", "score": 2, "replies": [{"body": "You are worried about the behavior of a guy who founded PayPal, spacex and Tesla and happens to be a billionaire. I think he’d be ok", "score": 0, "replies": [{"body": "There’s been multitudes of times where he’s hurt his own company through his actions. I personally like the guy but to pretend he hasn’t been a negative factor is beyond naive.", "score": 2, "replies": [{"body": "Dude you are clueless. Money talks and buys you everything you want or need in this life.", "score": 1, "replies": [{"body": "Lol that statement shows that you have no idea what having money is like. Your a waste of breath and won’t listen to the evidence so I’m not gonna waste my time.", "score": 1, "replies": [{"body": "Nobody asked you to comment on here. Hold on I’m about to take a big dump now on the toilet and will be right back.", "score": 1, "replies": []}]}]}]}, {"body": "Jeez your retarded. The guy almost lost control of his own company. He’s still pending charges and is under investigation from the SEC.", "score": 2, "replies": [{"body": "And yet nothing happened to him and still tweeting like never before. What does that tell you ?", "score": 1, "replies": [{"body": "He's almost as retarded as you", "score": 3, "replies": [{"body": "Eat shit", "score": -1, "replies": []}]}]}]}]}]}]}, {"body": "You're assuming Tesla will only be reliant on vehicle sales and margins in the future.", "score": 1, "replies": []}]}, {"body": "Y’all see Elon tweet about putting cameras in Tesla’s “fleet models” so they can compete with Uber/Lyft. But the real purpose is mad insurance company tendies \nSelling otm puts tomorrow", "score": 2, "replies": []}, {"body": "See r/Teslamotors", "score": 2, "replies": [{"body": "Yeah I mean I posted here not there for a reason.", "score": -1, "replies": []}]}, {"body": "Pretty easy--\n\nUsing every single metric for valuing a company it is clear that the current stock price is significantly overvaluing the company.  The company loses approximately $1B per year, has almost $10B in debt, and is showing little ability to build and sell cars at a profit, yet has a market cap similar to other car makers who not only know how to make a profit while selling cars, but get this, also are working on electric cars that will most likely actually be sold in quantity and make money...\n\n&#x200B;\n\nWhy is the stock so overvalued?  Lots of people seem to think Elon Musk is some kind of genius...Um yea...  I question how long he is going to be CEO of this company to be honest....  The stock is pricing in some kind of exponential growth over the next several years, and it's super clear that this company is going to struggle to stay out of bankruptcy going forward.  How much more demand is there for their cars?  Especially now that many subsidies to buy electric cars are being ended, and the fact that you can't get your Tesla fixed if something were to go wrong with it...but that's right the Tesla build quality is so good, nothing goes wrong with the cars..hahah", "score": 2, "replies": [{"body": "Using every single metric valuation metric....goes on to list not a single one of those methods. So it's overvalued, ok, by how much? What do you value it at? Why?", "score": 1, "replies": []}, {"body": ">Lots of people seem to think Elon Musk is some kind of genius...Um yea...\n\nDude just landed 3 rockets backwards.....", "score": 1, "replies": []}, {"body": "Dude dont try to impress people with your long ass useless analysis of nothing. \n\nI don’t care about the stock. Why do media and everyone out there keep bashing Tesla?", "score": 0, "replies": [{"body": "wtf are you doing here if you don't care about the stock", "score": 6, "replies": [{"body": "No one asked you to reply so buzz off mister", "score": -2, "replies": [{"body": "Choke on a dick, retard", "score": 2, "replies": []}]}]}, {"body": "Because they're clearly a gong-show as a company and its easy to get clicks  re: a trainwreck in process...", "score": 3, "replies": []}]}]}, {"body": "Because people think it's either going to do great or it's going to fail. So they choose the side with less risk.", "score": 1, "replies": [{"body": "But I mean everyone and their mother are bashing it and it just seems odd to a degree.", "score": 1, "replies": []}]}, {"body": "Because the stock price is going down", "score": 1, "replies": []}, {"body": "Because it's a dumpster fire fundementally. If you do a modicum of research you could have found that out.", "score": 2, "replies": [{"body": "Just echoing clueless analysts.  Smh", "score": 1, "replies": []}, {"body": "Right but it’s not anymore dangerous than a car filled with gasoline", "score": -3, "replies": []}]}, {"body": "You’re right, let’s all just face the slickness. Good enough for me. Buy buy buy!", "score": 1, "replies": [{"body": "It just makes you wonder why so much hate. Is it fabricated to push the price down or up?", "score": 0, "replies": [{"body": "Lots of people hate it because they’ve lost money on it, and now they want it to fail so they can feel validated.", "score": 3, "replies": [{"body": "That’s the most accurate comment so far lol.", "score": 0, "replies": [{"body": "The all time Tesla chart screams BUY right now, but I’m still sitting on my hands because, admittedly, I’ve been burned by it before. \n\n\nAn interesting study would be a count of negative Tesla articles in each of its major price troughs over the past 5 years. There have been 6 troughs, including the current one. This current one might be the most obvious one for calling the bottom. \n\n\nMaybe I’ll get in. I always make money when I absolutely hate what I’m doing.", "score": 3, "replies": [{"body": "And when these negative articles don’t seem to reach enough people they throw personal attacks at Musk which seems even more bizarre given the guy created PayPal and Tesla.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I wouldn't bet against Elon Musk, but Tesla is a highly volatile stock. Lots of up an down swings. I personally am bullish. In 2011 Tesla produced 0 cars, in 2019 they are on track to produce close to 500k with a market cap the same as GM. I think their charging station network and the fact that they make a kick-ass product I want, will set them apart in the long term. Tesla too the Moon.", "score": 1, "replies": [{"body": "But it’s not even the stock. People are saying Tesla cars are horrible and suck.\n\nI’ve only see wealthy people driving them. seems that wealthy people are very dumb then lol", "score": 1, "replies": [{"body": "People are saying..... What people? Tesla owners love their cars and recommend them to everyone. I hear more positive reviews then anything.", "score": 5, "replies": [{"body": "who? i own one. three friends of mine own. two coworkers own... we all love them. literally amazing creation.", "score": 1, "replies": []}, {"body": "Where lol? All I see is negative news and Musk is the worse person in the world.", "score": 0, "replies": [{"body": "you only see negative news articles. But people that are buying Tesla and own stock are really passionate about it.", "score": 2, "replies": []}, {"body": "Have you been to the Tesla sub? It’s chock full of raving lunatic fan bois that will shank you if you say anything negative about it", "score": 4, "replies": [{"body": "I'm getting my shanks ready right now", "score": 1, "replies": []}, {"body": "I was just curious about the negative publicity it gets more than anything else.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Google “OpenPilot”\n\nOpenPilot + everyone making an EV = Tesla no longer has a competitive advantage IMO.", "score": 1, "replies": [{"body": "But it’s not even about that. It seems that everywhere I turn I see Tesla hate but yet wealthy people keep buying Tesla’s and flaunting them everywhere.", "score": 0, "replies": [{"body": "I wouldn't worry about the hate.  It's going to be quite clear Elon knew what he was doing all along in the next 3-5 years.", "score": 1, "replies": []}]}]}]}
