{"title": "Apple stock spikes after reporting strong guidance and earnings beat", "selftext": "https://www.cnbc.com/2019/04/30/apple-earnings-q2-2019.html\n\nEPS: $2.46 vs. $2.36 forecast by Refinitiv consensus estimates\n\nRevenue: $58.02 billion vs. $57.37 billion forecast by Refinitiv consensus estimates\n\nQ2 iPhone revenue: $31.05 billion vs. $31.03 billion, forecast by Refinitiv consensus estimates\n\nQ2 services revenue: $11.45 billion vs. $11.37 billion, forecast by Refinitiv consensus estimates\n\nProjected Q3 revenue: $52.5 to $54.5 billion vs. $51.94 billion forecast by Refinitiv consensus estimates", "id": "bj8fxi", "created_utc": 1556657417.0, "score": 255, "upvote_ratio": 0.93, "num_comments": 78, "comments": [{"body": "[removed]", "score": 193, "replies": []}, {"body": "[deleted]", "score": 54, "replies": [{"body": "assuming mostly air pods. Those things became the hottest trend", "score": 57, "replies": [{"body": "Honestly watches are extremely popular as well. They have definitely spiked in popularity since the release of the series 4. They are extremely popular among the younger professional crowd", "score": 48, "replies": [{"body": "This is why all the Apple haters get shut up, I remember when the watch came out “they’re late to the party, blah blah blah it’s square” \nNow the only smart watches I see 99% are Apple watches on people. They were late but they did it right", "score": 37, "replies": [{"body": "I'm part of the \"love the stock, hate the products\" crowd, but even I have to say that the Apple Watch is beautifully designed. No other watch compares. I'd buy an iPhone just for the watch, but iOS would frustrate me instantly.", "score": 8, "replies": [{"body": "> but iOS would frustrate me instantly.\n\nI thought that at one point.  Happily inside the walled garden now, never looked back", "score": 9, "replies": [{"body": "Stare at the flowers.", "score": 1, "replies": []}]}, {"body": "Just curious why would it frustrate you?", "score": 2, "replies": [{"body": "I'm just used to Android. In iOS, I won't be able to replicate the dozens of shortcuts I've added via Nova Launcher. In iOS, you have to live with the shortcuts Apple provides.", "score": 2, "replies": []}]}]}, {"body": "Honest question, have $400 watches ever been popular?", "score": -16, "replies": [{"body": "Yes you fn geek damn", "score": 24, "replies": [{"body": "It's not a crazy question.  It sounds like people spend $2000 per year on Apple products if you believed some people.", "score": -8, "replies": [{"body": "Don’t need to buy a watch every year. And plenty of people have expensive watches that only tell time.", "score": 1, "replies": []}]}]}, {"body": "Honestly $400 is cheap for a watch, look at how many people spend thousands of dollars on watches", "score": 9, "replies": [{"body": "I'm talking about the general population, you're talking about different tiers of the upper class.", "score": 5, "replies": [{"body": "My coworkers are all very much middle class, and over half have apple watches. Yeah, it’s a tech company and the workforce is mostly people under 40, but you don’t have to be upper class to buy a $400 watch.", "score": 1, "replies": []}]}, {"body": "Watches that are timeless, these have a life of a few years max.", "score": 9, "replies": []}]}, {"body": "A lot of the department store watches are in the $500 range. Nicer seikos, Bvlgari, those kinds. Apple Watch is kind of taking that market for much cheaper while also taking high end Rolex, low end Swatch, and mid range sports watches.", "score": 4, "replies": []}, {"body": "Bro, you’re gonna get skewered for this question lol.", "score": 3, "replies": [{"body": "As he should", "score": 5, "replies": []}]}]}]}, {"body": "It also helps that the Series 3 got super cheap for a little bit.", "score": 6, "replies": [{"body": "Still is. I replaced my wife’s series 0 with a series 3 for $200 from Walmart last week.", "score": 1, "replies": [{"body": "I think I saw new around 175 at one point and used at 150. \n\nI could be wrong though.", "score": 2, "replies": [{"body": "Walmart has refurbished for $180", "score": 1, "replies": []}]}]}]}, {"body": "I see them everywhere especially on young professionals like nurses, pharmacists, bankers etc.  I don't own one but I like that a lot of other people do.\n\nUp 5% in after hours trading.", "score": 4, "replies": []}]}]}, {"body": "Look at a google trends for airpods. They sold a shitload in late March. Might not sell as many this quarter.", "score": -1, "replies": [{"body": "Don't think so, they're still backordered even on Amazon. Apple is still struggling to keep up with demand, they're selling a ton of them.", "score": 7, "replies": []}, {"body": "By that logic, they also might sell twice as much this quarter", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 64, "replies": [{"body": "YEET 👊", "score": 5, "replies": []}, {"body": "Earnings beat on declining sales yay?", "score": -17, "replies": [{"body": "Sales < services & gear sales and thankfully those two went up.", "score": 7, "replies": []}]}]}, {"body": ">Reflecting the approved increase, Apple’s board of directors has declared a cash dividend of $0.77 per share of the Company’s common stock, an increase of 5 percent.", "score": 24, "replies": [{"body": "Thank you based Apple", "score": 7, "replies": []}]}, {"body": "Shoutout to younger me for selling my $95 shares around the stock split because I wanted to buy some rims.", "score": 64, "replies": [{"body": "Yeah but I bet those rims have appreciated nicely.", "score": 44, "replies": []}, {"body": "Oof", "score": 11, "replies": []}, {"body": "Did they get the girlz tho", "score": 8, "replies": [{"body": "Worth it", "score": 2, "replies": []}]}, {"body": "Dude When I was like 16 I invested $1000 before the iTunes Store and iPod were released. \n\nI sold a few years later for maybe $3000 to move in with my lame ass ex girlfriend. \n\nWhen I last calculated I think it was worth somewhere around $180k if I had held...", "score": 3, "replies": [{"body": "Wtf", "score": 2, "replies": []}, {"body": "if you didn't sell at $3000, you would have sold it all at $5000, and so on. Very few people have iron hands to hodl forever.", "score": 2, "replies": []}]}, {"body": "Sold $10,000 worth pre-split to help me buy a car. At the time the shares were worth about $300 each. I still have some but man I should have bought a cheaper car.", "score": 2, "replies": []}, {"body": "I sold Amazon at $400 and Apple pre-split around $400 too.  Those were some of the first stocks I ever bought but I was too impatient.  They were small positions.", "score": 1, "replies": []}, {"body": "What were you thinking!?!?!!?!", "score": 0, "replies": [{"body": "Probably something along the lines of, \"boy those rims are sweet\"", "score": 1, "replies": []}]}]}, {"body": "Bought at 143, that turned out well", "score": 7, "replies": []}, {"body": "Never bet against Apple", "score": 23, "replies": [{"body": "Was free money in October", "score": 22, "replies": [{"body": "and now rookies chase", "score": 6, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Free money is often very expensive", "score": 1, "replies": []}]}]}, {"body": "Sales are still down..?", "score": -5, "replies": []}]}, {"body": "Sell then wait for the media to beat them up over something stupid?", "score": 11, "replies": [{"body": "“Apple’s doomed! Tim Cook is the stupidest person ever! Warren Buffet lost his entire fortune because of iCrap!” The media makes so much money off Apple doom articles every season.", "score": 9, "replies": [{"body": "Reddit hates apple as much as it loves Elon musk.  \n\nIf you want a stock to trade, apple is good. Ie buy on dips selling pops. For a stock so big, it has fair volatility. But if you get caught owning it on significant downs, you get good dividends and a company that, thus far, always turns around eventually", "score": 10, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Doing that with DIS right now", "score": 2, "replies": []}]}]}, {"body": "They already pounded apple. That ended in January. It was so obvious to see.", "score": 3, "replies": []}, {"body": "People gave shit to buffet for his. Investment. But he still made billions on apple. And then never lost money on a stock except Berkshire hathaway.", "score": 2, "replies": []}]}, {"body": "Let us know how that works out for you.", "score": 1, "replies": []}, {"body": "Their top product is declining and they've been very late to diversify or innovate as much as rivals.  They have been iterating since Steve Jobs.  There's no need to try and beat them up, the story writes itself.", "score": -2, "replies": [{"body": "There's nothing wrong with riding along the success of a product which people love with limited innovation. I think they're spending a lot of their time working on AR behind the scenes. Tim Cook has done a fantastic job monetizing the iPhone and shifting them over to services which will be the future of Apple. It's really hard to innovate like Steve Jobs had, there's no doubt, but just because they aren't doesn't mean they aren't a fantastic company with a future with huge potential.\n\n&#x200B;\n\nTBH you just sound like a bear who is upset they didn't make money off their short/put.", "score": 10, "replies": [{"body": "Innovation and novelty mean fat profits, commodity services means slim profits.  They have a huge war chest but are so late to them game they'll be battling everyone else that have major head starts.  They are overdue for a pre-cloud MSFT style lull for the next few years.", "score": 3, "replies": [{"body": "Commodity services mean slim profits? Listen for a sec, their services have roughly a 50% margin if you look at their recent quarter. And as a business, they have a MASSIVE amount of active installed users, 1.4B who they can capitalize on. Because of their infrastructure and model, they can drive large margins with ease. On top of that, here’s something that I haven’t seen anyone consider really; people today are addicted to their phones, and they will pay for services due to the ease and mindlessness behind most transactions. These machines are built by psychologists to be addicting, so you can also see that not only are services fantastic as a product, but they are ADDICTING, driving more sales in the future.", "score": 2, "replies": [{"body": "You realize their commodity services are built on Microsoft Cloud?  How many of your friends in the past year switched to an Android phone because Apple keeps raising phone and tablet prices due to sales dropping?\nDividends are nice, but are they hiding decreasing stock value?  If they dont innovate, they'll stumble and eventually die.", "score": 2, "replies": [{"body": "This is of course anecdotal but I don’t know a single person that went iOS to Android. I know a couple that went Android to iOS. Is there data showing that people are switching to Android lately?", "score": 2, "replies": []}, {"body": "First of all, them hosting their services on Microsoft Cloud is 1. irrelevant and 2. was a rumor that came out 8 years ago which was partially true however Apple then moved away from Azure so not really. But decreasing stock value? Their growth is phenomenal and they will continue to drive it with their increasing active installed base of users. Apple pay is by far the largest mobile pay platform in the world, and they only introduced it a few years ago! As of this quarter, they TRIPLED the amount of transactions of their platform compared to last quarter and are still expecting more rapid growth. That is innovation. Their airpods are a completely new product which have already become a massive trend amongst people and are still growing... the features which differentiated it have not been seen with other headphone makers; that is innovation. I've actually had friends only switch from Samsung to Apple however I like in a fairly affluent area so my experience is probably not representative of what most Americans use. \n\n&#x200B;\n\nHere's the thing I've learned with investing in companies; management is one of the most important parts of all. Apple realized that their sales were dropping as they raised their prices, SO they combated that with focusing on services to continue to grow! If they were a bunch of blundering idiots like you suggest who couldn't forecast future demand, they would probably sit on their asses and pull in as much money as possible before the company died eventually (although that wouldn't happen for a long time). The fact that Apple's management has been so keen and realized this trend early on and are already driving new areas of growth IS innovation, not for consumers, but for shareholders. Also keep in mind that they have a LOT of secret projects in the works that just simply aren't ready to be talked about yet... it'll come, just not yet.", "score": 0, "replies": [{"body": "Bluetooth headphones and tap to pay are 2 of Apples latest and largest innovations, got it.", "score": 5, "replies": []}]}]}]}]}]}, {"body": "This is an Internet popular meme that proved untrue at least 6 quarters ago. You’re either parroting what you read or heard some time ago or you’re not seriously following the stock. The whole Steve Jobs as god mantra was written by Steve Jobs and was a fallacy as much as saying Disney is nothing without Michael Eisner or uncle Walt. \n\nWall Street is in love with CEO myths. I think it helps justify their absurd pay packages. But it’s also easier to blame and favor one person and humans love celebrities and chieftains. But the best CEOs merely nod their heads at the geniuses who fill out the company while tapping the rudder here and there. At least at huge companies.\n\nIf Tim Cook is the greatest CEO that ever existed and all the tens of thousands of employees are merely average, then sell apple now and never look back—you won’t regret it. That goes for any sizable company.", "score": 2, "replies": [{"body": "They've missed the boat on so many industries when they are flush with cash.  That amounts to a failure in execution at the C-suite.  There is less faith after the crash..  rightly so.", "score": 3, "replies": []}, {"body": "Tim cook is your average good ceo he's no Steve Jobs or Elon Musk. They capitalized on everything their company could. And apple failed in cloud for the same reason IBM did which Tim is to blame for.\nAfter Walt Disney died Disney almost went bankrupt for example. Because they didn't have good leadership.", "score": -1, "replies": []}]}, {"body": "People like you constantly say this shit as the stock keeps going higher.  Sucks to suck.", "score": 0, "replies": []}]}]}, {"body": "Damn should have bought more a few months ago when it was less than 170.", "score": 2, "replies": []}, {"body": "Why the fuck are people surprised the stock is up despite lower YoY revenue? Last years Q1 came after the launch of the X which was a super cycle. They beat earnings expectations significantly and announced a massive buyback and dividend raise. This stock is going to $250 by end of summer GUARANTEED", "score": 2, "replies": [{"body": "Literally can’t go tits up 🤦‍♂️", "score": 10, "replies": []}, {"body": "Earnings vs guidance, not earnings vs YoY. The stock was pricing in guidance and got a handy beat there.", "score": 3, "replies": []}, {"body": "Sell in May and go away. I’m an Apple bull. For a stock that large to rise that much in the sleepy summer when there is markedly less activity is difficult but not impossible. However, I would never say XXXX guaranteed. All caps. Need to cover a position? Say no to stock hype in /r/stocks", "score": 2, "replies": []}, {"body": "Call it then", "score": 1, "replies": []}]}, {"body": "I was not tempted to sell it when it was down....", "score": 1, "replies": []}]}
