{"title": "Are option strategies like iron condor/eagle effective?", "selftext": "I just finished watching tastytrades videos and I feel they have done a good job in explaining options trading.\n\nLike to know in reality, if people do find using the option strategies effective or staying simple will be good enough as well. (seen many \"unreal\" option gains from even simple strategies e.g. in TSLA)", "id": "kkiqmd", "created_utc": 1608990001.0, "score": 20, "upvote_ratio": 0.8, "num_comments": 34, "comments": [{"body": "It depends on what you are looking for.  You won't see the gains you can see trading straight options, especially on a Tesla or other MEME stock, but it is a \"safer\" play.  \n\nIf you take an established stock, i.e. Apple, and play a condor within a range, your returns won't be overwhelming but will slowly over time increase your account holdings or provided additional cash revenue.", "score": 24, "replies": [{"body": "Makes a ton of sense. Thanks for sharing.", "score": 5, "replies": [{"body": "That might be why reading the techniques might be better than viewing some videos.\nIron condor if when you expect a small mouvement.\nYou definitely can't do it on something you are very bullish or bearish.", "score": 3, "replies": [{"body": "Agree. Nothing beats getting your hands dirty and learning what happens in the battlefield.", "score": 3, "replies": []}]}]}, {"body": "Agreed - I’ve been selling iron condors for the past 2+ months, and it’s been my most consistent money-maker. It doesn’t have the potential to blow up & win big, but they do have the potential to blow up & cause pain, so have a plan for how & when you’ll adjust (or close). \n\nThat being said - I’ve also been really lucky - AMZN has been my main underlying and they’ve been in a nice channel during this time. At some point they will break out of that channel, and that has the potential to cause me pain if I don’t catch it promptly & adjust.", "score": 6, "replies": [{"body": "for ICs, what's the RoI/risk-reward for management required? do you have to watch your screen closely?", "score": 1, "replies": [{"body": "Definitely depends on your style. \n\nPersonally, I'm selling 4 DTE (open weeklies IC on Monday to close/expire by Friday), so yeah, I'm watching daily, and I'll sometimes close out as early as Tues/Wed if I've gained a significant chunk (50%+) of the max value by then.\n\nI do this mostly because I've got my trading screen open on the side (while I work my regular currently-WFH job) so I can keep tabs on things.  Of course, having my screen open & charts up all the time definitely leads me to \"over-trading\", and causes me stress when I'm watching a big move unfolding real-time and trying to decide how/if I should react to it.\n\nThe more \"traditional\" approach is to sell 30-45 DTE and aim to close at 50% max profit. That certainly wouldn't require (and would probably benefit from) NOT having your charts open all day, and maybe just using alerts and/or limit orders to monitor your position.", "score": 3, "replies": []}]}, {"body": "How much capital do you need to do IC? Does it lock you out as much as it does for selling puts for example", "score": 1, "replies": [{"body": "It's the width of the spread. So for example, if you sell an AMZN iron condor with $10 wide spreads, (let's say the put leg is 3170/3160 and the call leg is 3370/3380), then your total buying power reduction is $10 (width of spread) x 100 (shares/contract) = $1000 per contract (MINUS the premium received).\n\nSo if your account has $10,000 cash and $10,000 options buying power, and you sell the above IC for $200, then you will have $10,200 cash and $9,200 buying power.\n\nNote this only works (at least for me, on TDA/TOS), if you sell-to-open the entire IC as one order, AND the spread width is the same for the call leg & put leg. If you try to leg into it (eg sell the call leg as a vertical spread order first, then later sell the put leg as a separate vertical spread order), OR if you have different spread widths (eg $10 put leg but $20 call leg), then TOS doesn't consider it an IC and will calculate the buying power reduction of each spread separately.\n\nNote that TOS does let me close each spread separately - I'll usually set my buy-to-close limit orders separately on the call vertical and the put vertical, but of course that buying power isn't freed up until both legs are closed.", "score": 2, "replies": [{"body": "Sounds great! I have webull and they seem to be able to do it all at once. This is very helpful, thank you", "score": 1, "replies": [{"body": "Glad I could help! Good luck and trade smartly :)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 24, "replies": [{"body": "if i refer to your \"less volatile\" as \"low implied volatility\" then shouldn't  buying calls be better than selling puts because premium would be cheaper? sorry i just picked up from tastytrades that using selling is better at high implied volatility and the reverse for buying due to positive correlation to premium prices.", "score": 2, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "how do you predict volatility? where to do see volatility trends to \"predict\"?\n\nyes, i get your point about shorting options before volatility gets low.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Got it. Thanks!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Yes. An iron condor on Tesla for the inclusion was a smart play. We saw a run up to almost 700 on the Friday before the date followed by a  dip afterwards. Speculators were pricing in a selloff but there was still serious volatility leading up to the event. So if you had a condor with the short legs at around 750-800 and 550-500 you would have made great money from IV crush while not establishing a directional opinion, but a magnitude based one.", "score": 5, "replies": []}, {"body": "All strategies are effective under certain (ideal) circumstances and are not good when those circumstances change. You have to pair the strategy with what you thing the underlying will do. If you are correct, then the strategy works. If you are incorrect, then the strategy does not work.\n\nFor example, if you think there will be no volatility, then selling strangles and straddles work. If volatility expands, then you are wrong and your position will lose.", "score": 3, "replies": []}, {"body": "Condors are directionally neutral and theta positive. Potential gain relative to risk is pretty limited in my opinion, especially considering the put leg of the condor will usually outperform the call leg", "score": 2, "replies": []}, {"body": "The hardest part about condors is managing them. The wider the condor i.e., the range of profitable prices, the greater your risk should the trade move against you. Knowing how to manage condors is critical.\n\nIf your put side is challenged half way through your trade, do you roll it out?  Do you close the call side because it’s “job it’s done”? Do you hold tight and do nothing?  These are the decisions you’ll need to make to manage condors. Best to start small and try it out a few times. Learning and then doing -safely- is the best, most rewarding part!", "score": 2, "replies": [{"body": "I’ll also add that, after years of focusing on verticals, I’ve recently discovered a love for horizontals or calendar spreads. For example, I generally prefer a long calendar spread(s) now to a condor. \n\nThat said, I still use bear call and bull put spreads most.", "score": 1, "replies": []}]}, {"body": "Just curious, what is iron eagle? I tried googling it, but getting results about iron condors instead...", "score": 4, "replies": [{"body": "Iron Eagle is a 1986 military action film directed by Sidney J. Furie, co-written by Kevin Alyn Elders and starring Jason Gedrick and Louis Gossett Jr. While it received mixed reviews, being unfavorably compared to the similarly-themed Top Gun released the same year, the film earned $24,159,872 at the U.S. box office.", "score": 34, "replies": [{"body": "Damn they made $24m on an iron eagle option.", "score": 4, "replies": []}]}, {"body": "my bad, condor != eagle... lol", "score": 3, "replies": []}, {"body": "funny thing despite this embarrassing miss, this post's gotten quite some attention. worse, reddit doesn't allow me to edit the title :p", "score": 1, "replies": []}, {"body": "I've never heard of it either. I've heard of iron condors and iron butterflies. \n\nNever iron eagle. I assume it's similar strategy ie limit risk  while hoping the stock trades sideways.", "score": 1, "replies": []}, {"body": "op corrected saying he meant condors, but maybe if you make the wings wider strike dif, it just may become an eagle... one can only imagine the freedom you have with this trade *cries in bravery*", "score": 1, "replies": []}]}, {"body": "I've been trading ICs due the past 8 months now ad has been very consistent. Having an original account of $1000ish limits plays to defined plays. I got lucky with some verticals but was available biter. I was just ding 7/10 ics getting .30 every 21 days till t boke threw. Luckily I changed the past 2 mo to a jade lizards. May want to look into that.", "score": 1, "replies": []}, {"body": "Echoing the others here - look at the rule of 72. You won't see 1000% gains, but averaging a 10% gain per month safely is doable. \n\nRule of 72 says 72/10 is about 7...so if you gain 10% per month you'll double your money in 7 months.\n\nAveraging 5% per month is easily doable with condors once you get going. You double in 14 months. Not too shabby.", "score": -5, "replies": [{"body": ">a 10% gain per month safely is doable.\n\n What the ever living fuck.", "score": 6, "replies": []}, {"body": "Going by your mindset of every play has 0 risk, he should rather play some roulette. Bet, win, repeat. I can’t believe people think, that ROI (especially long-term) is decoupled from risk or chance. And giving such advice to others is even more worrying.", "score": 2, "replies": [{"body": "Not zero risk...but if you look at the TS videos you usually aim for 60 to 80% probability of winning. Then you split your portfolio and invest about 3-5% in each play. Even if you are playing spy you can build a condor for a couple hundred bucks.\n\n If you sell condors you should invest about 30pct of your total portfolio.\n\nSo suppose your portfolio is 10k. You invest about 3k(30%) of that portfolio, selling ten 49 day expiry condors worth about 300 each. Your max win is going to be about 800 or so if you win all of them and hold them to expiry.\n\nBut TS tells you to close at 50% profit, and you won't win all of them. If you manage your losers properly then, you can expect about a $400 gain per month.\n\nThat's the textbook tastytrade method.", "score": 1, "replies": [{"body": "At what delta do one sell the inner calls/puts and what delta the long calls/puts?", "score": 1, "replies": [{"body": "It depends on IVR. What I usually do is use my tool (described at /r/ricinfo) to take a look at the stock. This tool tells you how an IC would have performed depending on the width of the strikes. Red means that short IC would have been profitable, green means that long IC would have been profitable. \n\nSo I find a stock where it looks like a 'deal'. That is, where the market is giving me better terms than the history is. For example, if I get a near 1:1 profit loss ratio(100 max loss, 100 max gain) but the tool tells me that in the last couple months there would have been a high probability of success then it's a deal.\n\nTake a look at the tool. DM me with questions.", "score": 1, "replies": []}]}]}]}]}, {"body": "I started selling Iron condors a couple of years ago.  My account was small and the IC does not use much buying power.  My account has gotten a lot larger since then and now I mainly sell strangles.  I find the strangles are more manageable than the Iron condors.  \n\nYou really have to pay attention to Implied Volatility to max your gains.  Also set profit targets.  I strive for 20% return within 5 days and 50% return by expiration.  \n\nYou do need to be approved by your brokerage to trade these strategies.  Tastytrade has one of the easiest and quickest approval applications.  I also have a TD account and they require a lot more information.", "score": 1, "replies": []}]}
{"title": "Fedex - open post-mortem", "selftext": "I'm trying to deepen my knowledge when it comes to trading and I'm hoping this sub can help me figure out where I went wrong with a recent trade. I fully understand that, on a balanced scorecard, the market is unpredictable and that even the best analysis can steer you wrong. That said, I do think I made some mistakes and I'm hoping this sub can help identify them :). \n\n1 -  On Dec 15th (a few days before earnings) I bought 1 FDX $290 call ($11.70) set to expire on Dec 24th. The stock was trading in the mid 280s so I figured it was relatively safe bet. \n\nReasoning: Fedex has seen incredible growth this year due to covid, and with e-commerce sales this holiday year doing more than the [last decade combined](https://blog.adobe.com/en/2020/12/01/cyber-week-online-shopping.html#gs.oh659f) (all those packages had to get delivered somehow). That coupled with the fact that they would be one of the primary vaccine delivery companies, all signs pointed that earnings would be strong, and the market would react well. Man, was I wrong.  \n\n\n2 - Fedex announced their earnings [which were stellar](https://s21.q4cdn.com/665674268/files/doc_financials/2021/q2/FedEx-Q2-FY21-Earnings-Release.pdf)\n\n* Quarterly revenue hit an all-time high (20B)\n* Adjusted earnings were $4.83 when estimate s were $4.01.  \n\n\n3 - Stock sank like a stone (is now $268)\n\nHere's what I don't understand... They beat earnings by a lot, hit record sales, and things for them aren't going to slow down anytime soon as long as covid is still around. \n\n\nEven removing macro events  (stimulus talks, new strain of covid, etc.) from the situation, this doesn't make sense.  \n\nSo experts, what did I miss? What should I have done different? Or is this just another one of \"those things\" where the market had its own plans? In other words school me \n\n(On mobile so please forgive any formatting issues)", "id": "kkmqpr", "created_utc": 1609005666.0, "score": 23, "upvote_ratio": 0.84, "num_comments": 38, "comments": [{"body": "So if it has not been said you paid 11.70 for a 290 call while underlying was at 280. You had 9 DTE and a breakeven price of 301.70. You basically needed a 10% gain in 9 days and incur the loss of IV after earnings. Id say this trade had a less than great shot at even breaking even much less profiting", "score": 23, "replies": [{"body": "This response is sobering to say the least (as is many of the other comments). This is the kinda straight thinking I'm trying to get better at. Need to learn to ignore that other voice that says \"it has to go up...\" \n\nMy foolish self thought covid was a once in century thing and has basically been an accelerant for some companies (fedex being 1)", "score": 1, "replies": [{"body": "Truth be told friend you are not wrong about the prospects for companies like UPS or FDX. I bought UPS calls the week before FDX reported to more or less play FDX earnings without as much risk of IV contracting. My time horizon tho was APR and my strike was slightly ITM. I have been burned too many times playing shorter dated options that I decided for myself it made more sense to pay more per contract to buy some time. This decision for me was more about anxiety management than math. I play earnings every season on several companies. The only 2 I held thru earnings were NKE and TGT and thats only because they had both crushed and given guidance during the height of pandemic. Otherwise I sell earnings plays leading up to report regardless of being up or down.", "score": 4, "replies": []}]}]}, {"body": "In my experience the best ROI can be made by buying calls and selling in the run up to earnings. Many stocks that I’m in (not in calls, just shares) I see a dip even on great earnings, what people are doing are buying into the pre-earnings hype and then they dump before or at earnings and take profit. I would recommend using a paper trading platform to test some options trades during run up to earnings and see how it plays out, the great thing is that you can do this using historical data and use that to dial in your strategy.", "score": 14, "replies": [{"body": ">I see a dip even on great earnings, what people are doing are buying into the pre-earnings hype and then they dump before or at earnings and take profit\n\nThis concept 100%.  Earnings are oftentimes a \"sell the news\" type of event.  Once the great earnings are in, the news is over and everyone takes their profits.  \n\nAlso, FedEx may very well continue to make excellent returns, but is Q1 the season of shipping?  Not really, that's usually Q4.  Remember that investors are always looking forward to the next quarter and traders are looking to allocate capital to their best idea.\n\nLastly, is there a vaccine on the horizon that might reduce the need for people to buy things online?", "score": 7, "replies": []}]}, {"body": "Holding through earnings is very risky. I personally haven’t studied this stock, but here are a few possibilities.  \n\n1) Everyone expected the earnings to be good, so the news was already “priced in” prior to the report. With no more demand for the stock, the price falls. \n\n2) Everyone anticipated that the earnings per share would be higher than what was reported, even though it was above the original estimate. Investors respond by selling. \n\n3) Like #2, perhaps there was an unwritten EPS that investors had come up with while doing their own analysis (the “whisper number”), and the report fell short of that. Then selling ensues, and other investors follow the trend.", "score": 9, "replies": []}, {"body": "A good rule of thumb that I play by with earnings is if it had a pop last time when it reported don’t expect that to happen again. Market makers usually are betting that people know that the earnings are good and usually hedge by buying puts when there’s a heavy flow of calls", "score": 4, "replies": []}, {"body": "It was likely priced in.\n\nEspecially in the lead up to earnings, a somewhat obvious thesis (\"people are ordering more because of the pandemic. FedEx is making more money.\") is bought by a lot of people.\n\nThe expectation was that FDX would beat earnings by more than the analysts estimated. Look at how far the stock has run up this year. \n\nA company can exceed earnings estimates but still miss expectations. Sometimes everyone expected the analyst estimates would be wrong. Sometimes the real disappointment is in future guidance offered on the earnings call, such as \"we did well this quarter but expect revenue to return to normal levels next quarter\". \n\nTL;DR don't hold options through earnings unless the expirations are far enough in the future that you can survive a short-term dip.", "score": 3, "replies": []}, {"body": "2 weeks to expiration + Right before earning = Not safe imo.", "score": 3, "replies": [{"body": "Lesson learned 😅", "score": 1, "replies": []}]}, {"body": "It’s because their operating margins were lower and also they provided no guidance. The stock is an absolute steal under $270. One thing I have learned is that you NEVER try to time an option, especially with earnings. I always buy at least 6 months out or LEAPs to give plenty of time for my theory to play out and the viability of dollar cost averaging. Thus if you have a slight pull back you can recapture that with new momentum. Stock will be back at $300 in no time, last quarter didn’t include Black Friday or cyber Monday shipping. Holiday season for shipping is usually until Jan 1 but this year is Jan 19. They also just teamed up with Walmart to handle all their returns and will have revenue for vaccine shipment. \n\nI’m aggressively long June 320c and June 300c to the tune of $75k. Very confident these will print, we saw same thing a month or two ago when the stock went to 259 before moving to $300. IV on 6 month options have significantly come in, good buy here.", "score": 3, "replies": []}, {"body": "Lots of profit taking?", "score": 4, "replies": []}, {"body": "FedEx didn’t give future guidance on their company. That’s why it dropped. Apple didn’t give future guidance and they dropped. Never play earnings", "score": 4, "replies": [{"body": "> Never play earnings\n\nNever play earnings *long*. A CSP would be a great move here, as a 270 woulda paid about $11, and if caught, it's the type of silly drop that gets erased in 3-5 sessions.", "score": 5, "replies": [{"body": "You can play earnings long with success. Long straddles, if you buy them early in the run up of volatility, can be very profitable in both the volatility run up or the stock gapping in either direction.", "score": 2, "replies": [{"body": ">Never play earnings \n>Never play earnings *long*\n>You can play earnings long with success\n\nYou taking notes, OP?", "score": 1, "replies": [{"body": "Already trying to program them in 😀. Lots of great info here! And I'm gonna share this thread with some buddies who I've been trading with. Thanks a ton everyone!", "score": 2, "replies": []}]}]}]}]}, {"body": "Unfortunately the only feedback you are going to get is that the earnings beat was priced in", "score": 2, "replies": []}, {"body": "It’s always priced in.", "score": 2, "replies": []}, {"body": "I've been looking at how my holdings respond to earnings and just about all of them run up to earnings and then sell off after.  So I applied this logic to Chewy recently and sold the day of earnings. What a friggen mistake. I'm convinced I will never get this right.", "score": 2, "replies": []}, {"body": "Hi there! I just read a book on options trading that I would like to recommend it for you:\n Get rich with options, Lee Lowell\n\nSorry, but you did mistakes , especially buying a call out of the money with the expiration date knocking on the door.\n\nAll the best and good trades for you.", "score": 2, "replies": [{"body": "I'll check it out, Thanks! I'm trying to read as much as I can these days. But I'll be honest, books with that kind of title - \"get rich\" - usually send up big red flags when I'm scrolling through titles for that next book. Is it more fundamentals based or is it a \"their secret strategy revealed\" kinda book?", "score": 1, "replies": [{"body": "Hi, in my opinion, the title was a marketing \"mistake\". There are not any bullet proof strategies, but simple and safer ones with a simple and good explanation on the theory. \n\nTake care,", "score": 1, "replies": []}]}]}, {"body": ">They beat earnings by a lot\n\nThey didn't beat it by as much as people expected.", "score": 2, "replies": []}, {"body": "The sooner you learn that you can't reliably predict 10% price moves within 1 week the better of you will.", "score": 2, "replies": []}, {"body": "Not sure if you're a believer in technical analysis, but post mortem the stock didn't have a great chart for going long at that point.\n\n[https://www.tradingview.com/x/L3Uotxeo/](https://www.tradingview.com/x/L3Uotxeo/)   You went long around the yellow arrow.\n\nPrice appeared to be in the middle of a price channel it had been following since March. Would be better to go long off the bottom on the channel not the middle. At least if you're wrong you know where to set a stop loss.\n\nThere is a Bearish RSI divergence. A lower high Made from the RSI peak in Oct to Dec (has now made a lower low)  RSI as well on the weekly chart was fairly overbought.\n\nMACD had a shrinking bullish Histogram and the lines had crossed the week before. Pretty far extended above the zero line.\n\nTA does have it's uses especially for picking an entry for a short term trade.", "score": 2, "replies": []}, {"body": "With FDX there is one crucial data point that made it drop, despite a solid report. Last quarter, they beat analysts expectations by 75%. This time however, expectations where beat by only 13%, which to analysts, indicates slower growth compared to the previous quarter. When you check ER expectations for a play, look at the last report and try to compare if it can be beat similarly this time around. A company beating earnings does not necessarily indicate growth.", "score": 2, "replies": []}, {"body": "My best guess is that this was so completely obvious that the pros thought of it weeks (months) before you did and used earnings liquidity to exit not enter.", "score": 1, "replies": []}, {"body": "If you bought the call close to earnings, you likely overpaid with inflated IV, and lost a good chunk of it post-earnings from IV crush. \n\nIt’s normal for prices to fall after beating earnings estimates. The inflated IV before earnings accounts for the uncertainty of the event. There were expectations, and if results do not significantly beat estimates, price will fall (even beating by 10% isn’t good enough). \n\nWhat’s important is actually guidance. You’ll see prices tank after hours after earnings is released, but start rising again after good guidance. \n\nAlways treat earnings as a gamble. You didn’t really do anything wrong; you just weren’t familiar with how prices usually play out during earnings", "score": 1, "replies": []}, {"body": "Sort of same boat.  I jumped in the morning it tanked thinking it dropped too far and would recover. Bought some Jan 15 calls. \nThen bought some feb 19 calls the next day when it dropped. And again the next day that it dropped. And loaded up this last Thursday at the bottom.  \n\nNow I just hope finally it bounces with all the analyst upgrades and price raises.", "score": 1, "replies": [{"body": "Good luck to you. Hopefully you caught it at the right time.", "score": 2, "replies": []}]}, {"body": "Don't buy weekly's. Theta is against you. Don't buy options around earnings. Options are overvalued around earnings. And the moment the earnings call happens the value of the options drops dramatically. Sell weekly's around earnings. You will get a good credit. And they will depreciate quickly. (Wich is a good thing when selling options) fundamentals are important. But price action is better in my opinion. If you can find the story of price on a chart. You are better off than just expecting good news in fundamentals to assist you. I like to use both fundamentals and technical analysis. But mastering price action is key.", "score": 1, "replies": []}, {"body": "You could know the exact earnings of the company before they report it and still be wrong on what happens over half the time. A lot of times companies runup into earnings because of reasons you just explained which is just commonly referred to as being “priced in”", "score": 1, "replies": []}, {"body": "I sold a strangle in FDX a week before earnings.  Don't remember the exact strikes but I put on a delta neutral position in the Monthly expiration.  I took that position off the day before earnings for a 30% gain.  FDX has had some big moves at earning over the past year so I did not want to hold through earnings as the price would blow through my strikes.  \n\nI try not to trade directional  around earnings.", "score": 1, "replies": []}, {"body": "Buy the dip with some longer term options. I bought mine before earnings but for a DTE in April so IV crush didn’t matter much just the delta itself", "score": 1, "replies": []}, {"body": "The issue I think is that a lot of equities are Already way overvalued and institutions are already invested into the companies and pretty early on... so if you think about it.. the time to of gotten into FedEx was March. When it was on Super Sale. Now, the company has done what all investors expected and the big boys are taking their profit and driving the price back to what it should of been", "score": 1, "replies": []}, {"body": "I don’t get it either. I was so confident and even bought what I thought was the dip, only to be disappointed. Twice. Thinking about selling now", "score": 1, "replies": []}]}
{"title": "Investing on margin", "selftext": "Hey, I’m 18 and have been investing for about a year. I opened my robinhood account in July and have done nicely with 50% growth. When I heard the news of robinhood cutting its margin interest from 5 to 2.5% I became interested in using margin. I realize that margin can be risky and I will probably get shut down in the comments but I am trying to use a safer strategy. I’m using the $1000 of interest free money to invest in high yielding monthly dividend stocks to cover the $5 monthly fee plus I get a few extra dollars on top $AGNC $PSEC. My plan is to not use any more margin unless there is a nice dip in the market. What do you think of my strategy? Also my portfolio consists of $SQ $NET $WMT $MSFT $DKNG $ARKG $NEE $NERD $LUV $CCL", "id": "kkkax9", "created_utc": 1608996756.0, "score": 11, "upvote_ratio": 0.66, "num_comments": 34, "comments": [{"body": "margin isn't wise for long term trades. correction comes and you don't have stop losses in place and you could get a margin call easily.", "score": 16, "replies": [{"body": "The point for me to use margin is to use it on the corrections you’re speaking of. I definitely don’t plan on using significant margin at this point in the market.", "score": 3, "replies": [{"body": "Imo, you should only use margin if stocks have fallen more than 25% and you believe the upward potential could be huge. But your still 18, so taking a little risk shouldn't end your life", "score": 1, "replies": []}, {"body": "Buy long calls instead of using margin. If we see a 20% dip buy a call a year out to help offset the loss. That will limit further loss if you're wrong and the market goes down further and stays down. If you use margin and you're wrong you're fucked.", "score": 1, "replies": []}]}]}, {"body": "Please don’t do this. \n\nBy starting to invest at 18, you are way ahead of the game. Do your research and never invest money that you cannot afford to lose. We’ve been living through an incredible bull market this year, but we’re still in a trade war with China, US unemployment is through the roof and the fed is printing money at mind boggling rates. Don’t ruin recent success by aggressively investing borrowed money.", "score": 5, "replies": []}, {"body": "Selling put options may get you a better gain than dividends and less risk then margin", "score": 4, "replies": []}, {"body": "Good resources to learn about using margin are on the Bogleheads forum. \n\nFirst you should read the market timer thread. Market timer was a young economics PhD student that got himself $200k in debt using margin during the great financial crisis.\n\nThere is the Hedgefundie thread that tries leveraging a balanced portfolio for better risk adjusted return than leveraging only equities. They end up using leveraged ETFs but it’s possible to do something similar with margin, options or futures.\n\nThen there is the “leveraging while young”/“lifecycle investing” type threads that address using leverage over your lifetime to improve lifetime risk adjusted return. Essentially you try to spread your equity exposure more evenly across your life, using margin when you are young and reducing your equity allocation in retirement. Like a lifecycle fund but based on theory not a rule of thumb.\n\nI’d suggest looking into NTSX, it’s a 60/40 balanced fund leveraged 1.5x.", "score": 3, "replies": []}, {"body": "Use your own fund for long term and margin for day trades...  gain or loss clear the day trading inventory everyday ... if you can do it ... use the margin otherwise stay away ...", "score": 3, "replies": []}, {"body": "I’m shocked there isn’t a single comment that says it’s okay to do this. \n\nI would say it’s fine under certain circumstances. It depends how risky the rest of your portfolio is. If it’s risky, I would suggest keeping margin at 10% of total purchases. If it’s not risky, 20% should be fine. Risky is generally more cyclical or higher PE stocks. Not risky includes dividend payers and low beta stocks. Generally, you’ll be fine. \n\nBasically, I would say there’s a time to run (aka take on margin) and a time to walk. Right now is a time to run in reopening stocks. Green light go. Once we’ve leveled off, I would suggest dropping it to 10% margin, and then you can take it back up to 20% margin on the next 10% dip, and then take it back down again when we hit a new high. Generally, this is a safe strategy that will perform slightly above average. \n\nI say all this without knowing your tax situation. If you are in a higher tax bracket, margin makes less sense. Short term gains are almost 50% between federal, state, niit, and maybe city taxes. It doesn’t really make sense to take margin up and down to pay 50% in taxes. The additional returns from margining are minimal over long terms. If your tax rate are low though,  then it’s a better scenario in which to take on margin. \n\nAnd as someone else suggested, consider just selling puts on stocks you like, or way out of the money near term calls on the stocks you own. You’ll be paying up to 50% again, but it accomplishes a similar low risk, low return goal. \n\nOverall, if you are going to get a 10% return, and you can margin up to 11%, you need to ask yourself if it’s worth doing at all and have to worry about it. Personally, I only use margins on big dips. I have margined maybe a total of 30 months in the last decade. Has worked well for me.\n\nBut it is potentially risky if you don’t know the risks.", "score": 3, "replies": [{"body": "I’m 18 so my tax bracket is the bottom of the barrel 😂. The IRS doesn’t care much about me.", "score": 1, "replies": []}]}, {"body": "Haha, never use margin. Go make the money elsewhere and invest, NEVER invest with someone elses money. It often does NOT end well.", "score": 1, "replies": [{"body": "My buddy made 24k this year with options and he’s new to investing.. my dad made 100k in a year lol. Just don’t be stupid and play with what you’re willing to lose.", "score": -8, "replies": []}]}, {"body": "Lol", "score": 0, "replies": [{"body": "Lol indeed", "score": 1, "replies": []}]}, {"body": "I would put all that margin in arkg and arkw and just forget about it. Long term you can’t lose", "score": -4, "replies": []}, {"body": "One of the Robinhood lot ey? \n\nYou've got a lot to learn yet brother!", "score": -13, "replies": [{"body": "That’s why I posted this...", "score": 15, "replies": []}, {"body": "*eh", "score": 1, "replies": [{"body": "Google \"Ey\"....Then come back. Fool.", "score": -1, "replies": [{"body": "It’s been cool to meet a modern day pirate", "score": 3, "replies": [{"body": "A'hargh, Pleasures all mine me fair wench.", "score": 1, "replies": []}]}, {"body": "What were you hoping I'd find? Proof that you're right and I'm wrong and 'ey' is the correct spelling?", "score": 1, "replies": [{"body": "Actually, YES, that was the whole purpose of asking you to Google the differences...because you thought you were a smart arse trying to correct my grammar.", "score": 0, "replies": [{"body": "Grammar is how words are put together. The question here isn't grammatical, it's orthographic. It's about spelling. Also, have you Googled it yourself? You seem to be quite confident for someone who's wrong. 'Ey' is not a word. Although, I don't actually care if you accept that or not, since you seem like a dick. Kiss kiss", "score": 1, "replies": [{"body": "Spelling is part of grammar you moron, nice try at attempting to appear intelligent, but as is evident above, you aren't too adept at Google, are you?\n\nEy is a word, its also a geographically aligned slang term, which again is a grammatical topic, again - Google it. \n\nI wouldn't imagine you to care either darling, and rest assured the feeling is mutual; your lack of intelligence is neither my problem or concern, its yours, as is your loose grasp of grammar, vocabulary and the English language in general. \n\n\"Kiss kiss\"", "score": 1, "replies": [{"body": "“You’ve got a lot to learn yet” about English grammar", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Grammar is the way language is used and the rules that dictate its correct usage. Spelling is the process of forming words using alphabets, to communicate in LANGUAGE, there by making spelling, an extension(a part of) of grammar....\n\nRead a book you dumb fuck.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Is that seriously the best you do?!\n\nSick burn dude, pass me the aloe Vera! 🤣", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Going from hero to zero can happen quickly when the tide turns, especially if you’re leveraging (margin, options, futures). The key is to have a sound strategy and stay disciplined. \n\nI certainly didn’t understand what discipline meant until later on. But I hope you act smarter than I was, and best of luck!", "score": 1, "replies": []}, {"body": "If you’re profitable as is, you do not need a loan", "score": 1, "replies": []}, {"body": "Everyone is saying it but for Christ sake do not invest on margin. I’m 38 and I’m gonna go dad for a minute. Debt is the devil no matter the medium.", "score": 1, "replies": []}, {"body": "I mean if you think about it a margin rate of 2.5% spent on buying some quality dividend stocks above 3% is literally free money just be careful not to have too much margin taken out", "score": 1, "replies": []}, {"body": "I wouldn’t", "score": 1, "replies": []}]}
{"title": "What are some insights on a company that you've researched that you think most people might not be aware of?", "selftext": "Examples:\n\nPalantir supposedly has one of the toughest interview processes out of all the tech companies, including Google, Amazon, Facebook, Netflix and so on. Even though software engineering is a field where it's notoriously hard to determine who is actually a skilled engineer, there is the possibility that PLTR has the best and brightest software engineers out of most tech companies.\n\nUnity software isn't just for video games. But it has potential to be extended to creating all manner of interactive 3D software in general. For example doing VR training simulation for jobs, or VR education (traveling back to ancient Rome in a history class). The bull case would be that Unity eventually becomes the Adobe for 3D interactive content.\n\nLemonade plans on releasing new insurance products every 6-8 months. Their software is designed in such a way that it is easy to do this. A lot of people who've done preliminary research on Lemonade, believes that they just do renter's insurance and are sticking with that. But 3 months ago they've released pet insurance. They're planning on releasing life insurance next month, and then there's the possibility of car insurance afterwards. The CEO has also stated that he understands the importance of intersecting humanity's (art/design) with tech, and that this is a valuable way to capture one of the most scarce commodities, mindshare. Which is why the \"Lemonade app's workflow looks and feels a lot better than going on Geico, Statefarm, Allstate, etc...\" (CFO's words, not mine).\n\nYeah a lot of people may be aware of these facts, but I think most investors *might* not be aware of them. Also I was just trying to give examples.", "id": "kkd97n", "created_utc": 1608960225.0, "score": 46, "upvote_ratio": 0.87, "num_comments": 32, "comments": [{"body": "I bought Unity based on the fact that it was the only program used in my ex-girlfriend’s Interactive Media graduate program. Even though the knowledge is probably transferable to other platforms, the main skill set they gained was using Unity software. I interpreted this as Unity having strong horizontal integration.", "score": 11, "replies": []}, {"body": "Having a tough interview process is not a positive imo, being able to reach recognise talent goes further than having people who interview well", "score": 38, "replies": [{"body": "He read Cracking the Coding Interview intro chapters as DD lol", "score": 18, "replies": []}, {"body": "You should look into it. I'd personally sing Palantir's praises for other reasons but the guy isn't wrong, their interview isn't simple question and answer, it can be quite technical and involved.", "score": 6, "replies": []}, {"body": "Coding interviews are meant to function like a stand-in IQ test (I don't necessarily agree with this, but it's the way the industry works these days). People study for months to pass these interviews.", "score": 1, "replies": []}]}, {"body": "NET \n\nhttps://hhhypergrowth.com/flare-ups/amp/#click=https://t.co/GSohvQzCOg", "score": 15, "replies": [{"body": "This is an unbelievable summary. Holy shit.", "score": 7, "replies": []}, {"body": "So I have 25 shares in net. Besides some other things I also have like six grand in amazon. Would it be worth it to trim some amazon and throw it into net?", "score": 2, "replies": [{"body": "You should trim it and add to TDOC you will thank me later", "score": 1, "replies": [{"body": "That does look good thanks", "score": 2, "replies": []}, {"body": "I think I might actually get rid of amazon for this. Tons of potential and with health care costs skyrocketing every year this could def be huge. Thanks again", "score": 2, "replies": [{"body": "Yes its definitely has a lot of growth, but you should also keep some money in AMZN imo", "score": 1, "replies": []}]}]}]}, {"body": "Isn't cloud flair the company that got hacked?", "score": 0, "replies": [{"body": "https://www.cnbc.com/2020/12/18/cloudflare-ceo-says-zero-trust-structure-is-answer-to-government-hack.html", "score": 2, "replies": []}]}, {"body": "Check @hhhypergrowth on twitter good dude 🤑", "score": 1, "replies": []}]}, {"body": "In the past 3 months, Unity is up 75% and Lemonade is up 139%. I wonder if there is more to go", "score": 8, "replies": [{"body": "That s what people dont understand and jump on the FOMO bandwagon..these stocks are already priced according to a good scenario", "score": 8, "replies": [{"body": "The info about Lemonade I found out when it was still around $60. As that’s what my average cost basis is for the stock. I’m assuming the run-up is due to Motley Fool publishing an article on the stock and making that info more widespread.", "score": 3, "replies": [{"body": "Wish i could have gotten in with you!", "score": 1, "replies": []}]}]}]}, {"body": "Inseego. 5g WiFi in your home, in Starbucks, in every commercial business", "score": 2, "replies": []}, {"body": "XL  \n\n\nThe EV scene is going to be massive in the future but not everyone can afford to drop $50K + on a new car, especially companies with fleets. These guys are electrifying commercial vehicles and have partnerships with blue chip OEM manufacturers like Ford, GM etc.   \n\n\nAlready selling their Electrification as a Service as well, unlike some EV manufacturers who have yet to sell a car, or more than a few.", "score": 4, "replies": [{"body": "But, Citron recommended them. They're just pumping them up so they can pull the rug out from under you with a research paper saying how they're over valued.  They'll no doubt have taken a short position at that time. \n\nI say this in partial jest.", "score": 3, "replies": []}]}, {"body": "FOUR \n\nhttps://valueofgrowth.com/posts/f/deep-dive---fair-value-of-shift4-nyse-four", "score": 2, "replies": []}, {"body": "XPEV; while other similar EV companies are trying to expand out of their own home market; XPEV just nailed it by utilizing existing infrastructure for sales and service, started selling EVs in Norway as a pilot market earlier this year and already have delivered cars to Norwegian customers. Xpev made another great decision; have no dependency on proprietary charging network as a USP or strategic asset since it’s going to be commodity in the future anyway. \n\nChwy, Musti etc; \nThe amount of pets being bought has exploded during Corona. And - you cannot “undo” getting a pet that easy. This combined with a macro trend in the western world where more people are postponing getting a child and rather have a pet + the recurring need for stocking up inventory for pets in a household is going to make these companies large money machines. \n\nMA/V: the switch to account-to-account based payments from card scheme based payments combined with regulatory access to infrastructure which enables these kinds of transactions is going to hit these companies hard! However - both are positioned for taking large shares of these markets.\n\nIPV/Aeva: Ex-Apple employees working with Lidar. Might be a good match for iCar (speculation level 💯😆)", "score": 1, "replies": []}, {"body": "$BIDU -- I have only been watching Baidu since ARKK started investing on it. Many know Baidu as \"Google\" of China for the search engine. Baidu is leading AI / Clouding / Autonomous in China. Baidu has already been running RoboTaxi (autonomous ride-hailing Taxi) in China.   \nI don't like China and I try to stay away from Chinese stocks the best I can but it seems too cheap compared to other Chinese stocks like BABA and TCHEY.", "score": 1, "replies": []}, {"body": "ICON - so mindlessly undervalued and a likely acquisition target in 2021. If not acquired, they will refinance their debt, and either way, there is a potential for a 50-fold gain there.", "score": -8, "replies": [{"body": "I thought pumping up garbage Penny Stocks wasn't allowed on this sub.\n\nLiterally gives no information other than saying it is undervalued and saying they think there will be an outrageously large gain.", "score": 7, "replies": [{"body": "They didn't ask for a thorough DD. I will give it to you though.\n\nThe company's intangible assets are worth significantly more than their book shows. Over the years, as their brands shifted from Direct-to-Retail licenses to Wholesale, they were able to reduce the book value of these brands for tax purposes. To give you an idea, this year they sold only the Chinese segment of a brand, Umbro, for 62.5 mil, the Chinese segment of Starter for 16 mil, 10% of the Chinese stake in Danskin for 1.6 mil. Managing China was very difficult for them, and this was a great move. Most of these Chinese segments were not even generating revenue at the time of sale. Meanwhile, the majority of the revenue of these brands are coming from Europe and North America. This has proven that Umbro is easily worth 400-500 mil, Starter and Danskin 100 mil each. This is not showing on their balance sheet, due to the impairments they did. Then they have 25 other brands. They have close to 100 mil cash on hand, and about 500 mil debt. Do the math, and you will see this company should be worth several hundred million dollars. Its market cap is less than 15 mil now, because of their enormous debt collecting interest at more than 10%. As they improved their balance sheet this year, they can either refinance that debt, or sell the whole company. If they refinance, they will be cash flow positive again. And if they sell the whole company, it will go for more than 100 mil, in my opinion.", "score": 0, "replies": []}]}, {"body": "Any good reason why the CEO is getting paid 2.4 million a year?", "score": 1, "replies": [{"body": "Their contracts were signed when the company was worth significantly more. I am not happy that the CEO didn't take a pay-cut with COVID, but to be honest, they have been doing a good job. I didn't think they could survive the pandemic, but they made some sales at incredible multiples to get them through.", "score": 1, "replies": []}]}]}]}
{"title": "Why is Amazon performing so poorly ?", "selftext": "[removed]", "id": "kkqzym", "created_utc": 1609020408.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 38, "comments": [{"body": "[deleted]", "score": 25, "replies": [{"body": "People like OP are going to get absolutely butt raped when we return to normal markets and they just jump from stock to stock expecting 20% a week. Worryingly, I have a feeling there are millions of people like OP.", "score": 10, "replies": [{"body": "If millions are doing that, wouldn’t that mean we will always have a volatile market from now on?", "score": 1, "replies": [{"body": "No becuase millions are doing it with small portfolios which mean nothing to the market but lots to the individual.", "score": 1, "replies": []}]}]}, {"body": "Lol so true", "score": 2, "replies": []}, {"body": "Of all the things that stocks can do, sideways is the worst IMO. Calls for going up, puts for going down. But sideways? Sit there and twiddle your thumb and jerk off until it does something.", "score": 2, "replies": [{"body": "Sell puts in a sideways market.", "score": 1, "replies": [{"body": "You're assuming I have the money to sell a call/put...", "score": 1, "replies": []}]}]}, {"body": "Next you're going to tell me most companies don't see 700% increases in a single year like Tesla. How the fuck am I supposed to buy that lambo for my 5 year HS reunion?", "score": 2, "replies": []}]}, {"body": "Buy 4K calls for next summer trust me I’ve been watching trading videos on YouTube for 3 months now", "score": 14, "replies": [{"body": "Username checks out.", "score": 2, "replies": []}]}, {"body": "The stock is up a stupid amount.  I think it was at 1300 in march....2400 in June, now 3200.", "score": 6, "replies": [{"body": "Yeah but so is every other tech stock. Do you think it will fall other continue its side movement ?", "score": -7, "replies": []}]}, {"body": "wonder how new traders will react when the market loses its volatility?", "score": 6, "replies": [{"body": "Gotta build up a good amount of capital during this volatility so you can theta-gang later", "score": 3, "replies": []}]}, {"body": "Honestly, I'd say buy GME anyways. It's riskier but the upside is massive. Enough DD out there for you to ger started", "score": 6, "replies": []}, {"body": "I would by a dildo and send it to your.mom if I were u", "score": 13, "replies": [{"body": "Nice comment, you totally don't sound like a 14 year old kid. Fucking retard", "score": -13, "replies": [{"body": "Get off this sub if you can’t handle some stupid fucking comments", "score": 8, "replies": [{"body": "I can handle it, but it's going too far when I call this dude a retard? Alright then retard", "score": -3, "replies": [{"body": "No but it is too far when you sound butt hurt over reddit", "score": 1, "replies": [{"body": "To me it's no big deal, he was sounding hostile so I reacted accordingly", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Poorly? Stock is at incredible levels and has risen phenomenally over this year. The fact that you even created this post should be making you question your understanding of the fundamentals of global equity markets.", "score": 4, "replies": [{"body": "It has been working out pretty well for me until now 🙄", "score": -6, "replies": []}]}, {"body": "Nobody tell him. Amzn to 4k in 2021 though", "score": 5, "replies": []}, {"body": "My thought is that state attorney generals are going after Google, so it’s a matter of time for AMZN and a subsequent split into AWS and AMZN wholesale.", "score": 4, "replies": []}, {"body": "Mackenzie Bezos has been selling her stock for a while, which is likey part of it.", "score": 2, "replies": []}, {"body": "Shit’s consolidating on the daily chart. Might rip on holiday revenue news.", "score": 2, "replies": [{"body": "Delayed stimulus might hold the rocket down though", "score": 1, "replies": []}]}, {"body": "Up 76% over the past year. “Sideways for 1 month wtf mate”. You belong here", "score": 2, "replies": [{"body": "It is an honour to belong here.", "score": 1, "replies": []}]}, {"body": "So you just learned how the market works and you're asking why Amazon hasn't done better? You have no regard for fundamentals, you use your gut, so you belong here.", "score": 2, "replies": [{"body": "Exactly", "score": 1, "replies": []}]}, {"body": "Damn chill, I just asked about a fucking stock because I'm new to the stock market. Why is everyone trying to mock me (not even in a funny way as usual in wsb) like they are smarter or something. \n\nI only lost all of my portfolio in 10 days come on now guys.", "score": 0, "replies": [{"body": "It’s cause you don’t try to do any research at all. Zoom out on any graph. Parabolic movement like this isn’t normal. A 1 trillion dollar company isn’t going to move like a penny stock forever. If you’re new to the stock market you should be trying to learn about it other than “stocks only go up”.", "score": 1, "replies": [{"body": "I think people don't understand that I'm not looking for a massive spike. 10% a month would be extremely good for me but Amazon isn't even remotely close to that.", "score": 1, "replies": [{"body": "Look at what even a couple percent move per month would do to Amazon’s market cap. Then look at how much revenue they generate. Do the research do the math. People are nice and fun here but to be blunt. Nobody’s gonna fucking hold your hand", "score": 1, "replies": []}]}]}]}, {"body": "Yeah, I've had 10 shares at 3.2k since fall. It will happen", "score": 1, "replies": []}, {"body": "Spotify is eating their lunch, cloud is slowing down", "score": 1, "replies": []}]}
