{"title": "Saudi Arabia expects to get access to Nvidia's high performance chips 'within the next year'", "selftext": "Saudi Arabia is optimistic about gaining access to U.S. chipmaker Nvidia's high-performance chips, which would enable it to develop and operate the most advanced artificial intelligence models.\n\nSpeaking to CNBC on Thursday, a top official at the Saudi Data and AI Authority, Abdulrahman Tariq Habib, said the kingdom expected to make such a stride in the next year.\n\n\n\"I think within the next year,\" Habib, Deputy CEO of SDAIA's strategy management office, told CNBC's Dan Murphy after being asked about a potential timeline. It's a significant expectation given that the United States' strict export controls have thus far prevented the chips' export to the kingdom. Habib made the comments on the sidelines of GAIN, Saudi Arabia's international AI summit, which took place in Riyadh this week.\n\nIt \"will mean a lot\" for Saudi Arabia to have access to the chips, Habib said — in this case, the Nvidia H200s, the firm's most powerful chips, which are used in OpenAI's GPT-4o.\n\n\"It will ease business between Saudi and U.S.,\" he said. \"It will also open a lot of doors for building the capability, the computational capabilities, in the kingdom. But most importantly, it's not only the computational capability that's important. We worked hard in the past three years in building capacity, in human capacity, we also build data capacity as well. So we are working and collaborating with all [of the] international community and contributing [to] be one of the top active countries in data analysis.\"\n\n\nSaudi Arabia is pouring considerable investment into developing a robust AI ecosystem in the kingdom, disclosing in a report by SDAIA that it aims to have AI make up 12% of its gross domestic product by 2030. According to the report, published on Sept. 9, the kingdom's $925 billion Public Investment Fund will lead the investment.\n\nSource: CNBC\n\nhttps://www.cnbc.com/amp/2024/09/13/saudi-arabia-expects-to-get-advanced-nvidia-chips-within-next-year.html", "id": "1fg0vya", "created_utc": 1726249732.0, "score": 305, "upvote_ratio": 0.96, "num_comments": 100, "comments": [{"body": "Wow they want AI to make up 12% of their GDP within the next five or so years? That's a pretty hefty number. Big spending incoming I suppose, but all of that depends on whether or not they're allowed access.", "score": 126, "replies": [{"body": "They're throwing money around hand over fist to try and diversify away from oil", "score": 42, "replies": [{"body": "They've been doing this for a good three years now, still highly dependent on oil ", "score": 2, "replies": [{"body": "Three years is a minuscule amount to undergo an entire paradigm shift", "score": 14, "replies": []}, {"body": "Three years? More like decades \n\nDiversification has been a goal since the previous generation of Saudi Rulers", "score": 2, "replies": []}]}]}, {"body": "MBS says all these progressive things from time to time just to make the young saudis happy. They revert to baseline after a while", "score": 40, "replies": [{"body": "MBS?", "score": 2, "replies": [{"body": "The crown prince of Saudi Arabia, also their political leader.", "score": 3, "replies": [{"body": "He's Crown Prince and Prime Minister.", "score": 4, "replies": []}]}]}]}, {"body": "They're desperate. All their money is going to overpaid American golfers on the liv tour", "score": 2, "replies": [{"body": "😂 Rahm is not American", "score": 1, "replies": []}]}]}, {"body": "Saudi dudes name is Habibi!", "score": 97, "replies": [{"body": "I have a picture of his house", "score": 13, "replies": [{"body": "You gonna have to figure out what this means.", "score": 9, "replies": []}]}]}, {"body": "Price of the chips is gonna skyrocket.  Hard to compete against Saudi for chips….", "score": 36, "replies": [{"body": "They're just middle men, selling them to China. But still, price will shoot up. Pelosi effect in plain sight!", "score": 14, "replies": [{"body": "Pelosi effect?", "score": 4, "replies": [{"body": "She buys Call option on a company, and then magically legislation changes in favor of the company's business. \n\n\nBut to make it not so obvious, there's often a step backward in short term, before a big leap", "score": 4, "replies": []}]}]}]}, {"body": "Do they even have a tech industry?", "score": 19, "replies": [{"body": "No, but they will force an industry like they try to do with everything else they throw money at!", "score": 35, "replies": [{"body": "if I only knew people to get a job in Saudi... working just few years is enough to be set for life.", "score": 9, "replies": [{"body": "Saudi posts jobs online like everybody else. They pay very well, but usually have high standards. I know a few guys who worked there. With that said, you won't earn enough in a few years to be set for life. It's more akin to getting a job at Netflix or something. Industry leading pay but not totally out of this world.", "score": 8, "replies": [{"body": "Netflix pays like 500k full cash. If i had that for 4 years without tax id definitely be set for life", "score": -1, "replies": [{"body": "Depends on the job.", "score": 3, "replies": []}]}]}, {"body": "People will sell their soul to the devil for enough money.", "score": 7, "replies": [{"body": "People will sell their soul to the devil for lies and hope with nothing gained and treated as trash.", "score": 5, "replies": []}]}]}, {"body": "So... investing? Like everyone else does?", "score": 4, "replies": []}]}, {"body": "Doesn't take a tech industry to build server farms. Energy is cheap in Saudi so this is how big tech makes AI cost effective.", "score": 3, "replies": []}, {"body": "Larry Ellison said this last week on the Oracle earnings report that companies are building ai infrastructure near existing energy infrastructure. I bet this is that type of play to increase energy efficiencies.", "score": 4, "replies": []}]}, {"body": "Will be interesting when governments have an arms race for computing, space and war lol.", "score": 36, "replies": [{"body": "Isn't that now?", "score": 19, "replies": [{"body": "It is, although it could always get more interesting, with drone wars, AI drone wars, virtual war simulations instead of physical wars, and much else upcoming. Stay tuned.", "score": 8, "replies": [{"body": "The 90's movies were to warn us ..instead they've been taken as inspiration. ..were fucked.", "score": 4, "replies": [{"body": "\"we've created the torment Nexus\" ass moment", "score": 2, "replies": []}, {"body": "It was just always bound to happen. Just enjoy being drilled. My therapist calls it \"radical acceptance\". And I pay a lot for those sessions.", "score": 3, "replies": []}]}, {"body": "[removed]", "score": 4, "replies": [{"body": "K so no shit I've been watching videos of Ukraine and drone war is fucking bullshit. I refuse. I will not have my last moments to be chased down by a $200 drone with a grenade strapped to it.", "score": 5, "replies": [{"body": "so it's not just me...I see that and I'm absolutely horrified. not from how gruesome it is, but from the juxtaposition of the banal and the deadly\n\nit's hard to even imagine something as \"harmless\" as a whizzing drone carrying deadly consequences. i can't square the two in my mind\n\nand the powerlessness of it coming in slow enough to see it....and honestly, the \\*embarrassment\\* of dying to something like that. there's no heroic blaze of gunfire, no jumping on a grenade... you're getting blown to bots by children's toys\n\nI see the videos, and watch them try to run, and it fills me with a deep sadness, but I never cry. it's such an alien emotion, my brain literally can't even comprehend it. this kind of suffering CAN'T be the future.", "score": 3, "replies": [{"body": "It absolutely is the future. F16s have had drone swarm capabilities for almost 10 years now or so, and that tech has only grown in capability and will continue to.\n\nI'm sorry. I am a patriot and I love my country, but until the boots are on American soil, I absolutely wholeheartedly refuse combat. The only drone I'll be unable to outrun will be in my own backyard.", "score": 2, "replies": [{"body": "yeah, imagine if they pair facial recognition software with uniform recognition and AI for self-flight\n\n  \nthey could crank out literally thousands of drones in a swarm. if they can just figure out the battery issue, they could literally have giant swarms like starlings, just patrolling and having a few peel off to destruct against any enemy combatant\n\nJesus, that's scary. I feel like we'll see EMP technology return if that's the case though. we already have some great drone guns iirc", "score": 2, "replies": [{"body": "Some compelling evidence for the advancement of netgun technology.", "score": 2, "replies": []}]}]}, {"body": "I mean Palestinians already associate that drone whirr with panoptican overlords preparing their destruction. Israelis use drones to let them know they're being watched and also to plan strikes.", "score": 1, "replies": []}]}]}, {"body": "Isn't that before?", "score": 1, "replies": [{"body": "Isn't that after?", "score": 1, "replies": []}]}, {"body": "It's just a small percentage of what is yet to come. Like I said, stay tuned. It's still in its early days.", "score": 1, "replies": []}]}, {"body": "It's already a drone war man. Ukraine and Russia are having major drone arms races. Same with Iran/Yemen using drones. Yemen succeeded in getting to an American ship using some cheap off the shelf drones. Same with Iran getting past the iron dome. They did it by using like a thousand cheap kids drones. \n\nRussia has found an effective way to counter that supposedly, via signal jamming (I don't know the correct term). But they basically prevent the drone from hearing its instructions from the pilot.\n\nSo now the race is to get self piloted but still cheap drones.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "It would make war weirdly fun actually since you are removing much of the human suffering caused by wars, and it's like countries playing video games against each other.", "score": -7, "replies": [{"body": "> removing much of the human suffering caused by wars\n\nWhile the combatants might be drones, the targets are still schools and hospitals my guy.", "score": 15, "replies": [{"body": "The idea is that both sides would be fighting with their machinery until one is destroyed, but of course, if a country (Russia) won't let it go willing to sacrifice human life like nothing, then it wouldn't work, and it would be what it is. They will get destroyed by software joined with hardware like they deserve for what they are allowing exist right now.", "score": -5, "replies": []}]}]}]}]}, {"body": "\"Data is the new oil\"", "score": 9, "replies": [{"body": "Right, so let's treat it how they treat oil, right?", "score": 5, "replies": []}]}, {"body": "Ah so that's why the price of oil has been stable lately.", "score": 7, "replies": []}, {"body": "None for China, just the country we have had 30 years of constant conflict with? \n\nWe are really that desperate to keep this machine going", "score": 37, "replies": [{"body": "Oh no— they’re our ally … really!", "score": 17, "replies": [{"body": "Man… last time these “allies” tried to help 9/11 happened…", "score": 13, "replies": [{"body": "This chain reads like a Reddit conspiracy mad libs. What exactly are any of you saying", "score": -5, "replies": [{"body": "No idea lol, but SA with super computer isn’t beneficial lol", "score": 3, "replies": [{"body": "MBS very clearly cares more about keeping power and modernizing than entertaining religious extremism. Today's SA is much different than 24 years ago.", "score": 1, "replies": [{"body": "Didn't they butcher a journalist", "score": 5, "replies": [{"body": "I never said he wasn't an authoritarian asshole, he's just the secular kind you can do business with. \n\nYou know, in direct response to a comment chain acting like SA is secretly plotting another 9/11.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "The US has been buttering up the Saudi's for 30 years ..not conflicting with them. That sweet sweet oil..", "score": 10, "replies": []}, {"body": "watch, what goes to Saudi goes to China.", "score": 17, "replies": [{"body": "China can already buy the lower performance chips that work just as well for most capabilities and are building their own capacity. NYTimes The Daily just had a good podcast episode about it a week or two ago.", "score": 5, "replies": [{"body": "Yea, to be honest the lower performance chips is good enough if you expand the supercomputer array at few more stacks at the cost of footprint and electricity. \n\nBanning China from getting the latest and greatest cpu and gpu isnt going to do squat given its the whole array output that matters, not the individual piece in question.", "score": 4, "replies": [{"body": "I think it is a good thing that China can somewhat catchup with their own homegrown tech. Because if it couldn't, then it would be logical for them to start actual wars before the technological gap gets too big.", "score": 0, "replies": []}, {"body": "Also if the goal was to stop them reverse engineering the chips that isn't going to work either, the lesser chips are just the full power chip with parts physically disabled.", "score": -1, "replies": []}]}]}, {"body": "As if Saudi needs the money to make it worth risking access to the chips by selling to China", "score": 0, "replies": [{"body": "Yea they dont need the money, but they need the relationship and things that china makes, being they know once Oil is out of the picture they will go on US's shit list. \n\nHell them making their own golf tourney already shown the anti-saudi mindset the west has as a whole, most of the golf players were very damn open on their thoughts, same with online comments. They can see all that shit, and hear it all (~85% of their pop KNOWS english)", "score": 6, "replies": [{"body": "What things from China do they need more than advanced western chips and weaponry? Nothing. I don't see selling chips to Saudi Arabia as an issue", "score": -1, "replies": []}]}, {"body": "The gov doesn't ..but some bloke who can pocket a chip and put it in an envelope to China for mass production may.", "score": 0, "replies": [{"body": "But everyone can do that including Americans", "score": 2, "replies": []}]}]}]}, {"body": "Gotta find those 9/11 funders somehow", "score": 6, "replies": []}, {"body": "What conflict have we had with Saudi in the past 30 years?", "score": 2, "replies": []}, {"body": "We have not been in 30 years of conflict with SA. The US relationship is their most important international relationship by far.", "score": 4, "replies": []}]}, {"body": "..China on the phone to the Saudi's to secure the good stuff.", "score": 4, "replies": []}, {"body": "It looks like OP posted an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.cnbc.com/2024/09/13/saudi-arabia-expects-to-get-advanced-nvidia-chips-within-next-year.html](https://www.cnbc.com/2024/09/13/saudi-arabia-expects-to-get-advanced-nvidia-chips-within-next-year.html)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)", "score": 5, "replies": []}, {"body": "If US approves this it’ll be a huge tailwind for Nvidia. Then you’re gonna have Qatar and UAE to want in plus other copy cat nations. Can balance out sales for Nvidia if the hyperscalers cut capex", "score": 4, "replies": [{"body": "UAE has G42 since 2018", "score": 2, "replies": []}]}, {"body": "10,000 chips sitting in a shipping container in the middle of the desert", "score": 4, "replies": [{"body": "Better than it being ice cream.", "score": 4, "replies": []}]}, {"body": "Well, wait for the oil price to stay below 70$ for a couple of months and see them react", "score": 2, "replies": []}, {"body": "They are also signijg similar deals with GPU manufacturers. They are going full speed ahead and I have the feeling that US Government will slow them down. Let's see.", "score": 1, "replies": []}, {"body": "They’re buying gas turbines also to power it.  \nhttps://www.powermag.com/siemens-energy-ge-vernova-each-will-build-two-2-gw-gas-fired-power-stations-in-saudi-arabia/", "score": 1, "replies": []}, {"body": "It's not enough to just have a bunch of chips.  You need to have all the people and infrastructure.  I don't care how much money the Saudis have, I don't think they can buy an entire AI industry overnight.", "score": 1, "replies": []}, {"body": "What are the saudis gonna do w it lol, ask it how to survive once oil dies?", "score": 1, "replies": [{"body": "They are using it for oil, you need a lot of computing power to model oil reservoirs", "score": 2, "replies": []}]}, {"body": "The only thing rich arab countries can do outside of oil is real estate", "score": 1, "replies": []}, {"body": "Well thats terrifying", "score": 1, "replies": []}, {"body": "So is Saudi planning to replace all the migrant workers they import with AI? lol", "score": 0, "replies": []}, {"body": "Nah ban them", "score": 0, "replies": []}]}
{"title": "What’s the exit plan, boys? ", "selftext": "With Fed Rates coming and a potential recession following soon thereafter (or not) will you be transferring out of the market or staying all in? Or perhaps Gold/Bonds? ", "id": "1fg7zw3", "created_utc": 1726268305.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 95, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 24 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Misunderstood and bought 5k worth of medicated foot powder.", "score": 54, "replies": [{"body": "An honest mistake leading to a sound investment.", "score": 15, "replies": [{"body": "Should do better than micron the last 90 days…", "score": 1, "replies": []}]}, {"body": "Works on your undercarriage also", "score": 8, "replies": [{"body": "Refreshing", "score": 3, "replies": []}]}, {"body": "Came here for replies like this, was not disappointed 🫡", "score": 7, "replies": [{"body": "🫡 if we can’t laugh then what are we doing here?", "score": 1, "replies": []}]}]}, {"body": "IMO, it depends on your time horizon with your investments.\n\nLong term/retirement money? History says to let that shit ride and don’t try to time the market\n\nShort term? If you anticipate a bear market or correction coming up, may be a good time to reallocate", "score": 13, "replies": [{"body": "I'm investing <1k trying to make a little more money for the holidays. I made $50 last week so I might be done until that recession comes (maybe)", "score": 2, "replies": [{"body": "That is great that you made some money! While historically the market generally goes up over time, there can be major short term losses. \n\nFor money that you need for the holidays, be careful with how you are allocating it!", "score": 7, "replies": []}]}, {"body": "I’ve been thinking it’s going to be a bear market since Covid. 😭", "score": 2, "replies": [{"body": "Fun fact: the SP500 is positive in any given calendar year about 75% of the time", "score": 2, "replies": []}]}]}, {"body": "SPY put leap.", "score": 11, "replies": [{"body": "Seems explorable . 🤔", "score": 2, "replies": [{"body": "Exploring this the way I have explored my gender.", "score": 8, "replies": [{"body": "I’ll explore something alright… 😏 starts with ay", "score": -2, "replies": [{"body": "It’s giving horny and desperate🥲", "score": 7, "replies": [{"body": "I’ll show you desperate", "score": 0, "replies": [{"body": "……. Waiting …… do I have to wait until the fed rate cut? Or what’s your timeline bruh…", "score": 5, "replies": [{"body": "Deep search", "score": 0, "replies": []}, {"body": "Tn", "score": -1, "replies": [{"body": "Should we play footsie about it first? Or do you just want me to top you now?", "score": 5, "replies": [{"body": "🤤 fawwwwwwk pm me rn", "score": 1, "replies": [{"body": "Level 1000 gooner", "score": 4, "replies": [{"body": "🤤🤤🤤🤤", "score": 1, "replies": []}]}]}]}]}, {"body": "Rn", "score": -1, "replies": [{"body": "Absolutely not", "score": 2, "replies": [{"body": "Cmon stop being shy", "score": 1, "replies": [{"body": "Not shy, just not desperate✨ plus, the planet fitness closes at 9PM and you do NOT want a T-boy on hormones to miss his nightly pump. That would certainly cause a recession.", "score": 2, "replies": [{"body": "🫠🤤", "score": 1, "replies": [{"body": "lol dude, do NOT call a trans dude “girl.” I hope your long position go to 0 ✨", "score": 1, "replies": [{"body": "🙃 not literally bro .. it’s a joke silly", "score": 1, "replies": [{"body": "Gotcha! Usually jokes don’t teeter on the edge of transphobia, but ce la vie✨", "score": 1, "replies": []}]}, {"body": "Figure of speech", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "https://preview.redd.it/mfp01lonw9pd1.jpeg?width=360&format=pjpg&auto=webp&s=7518685e7cf3f94ae3dd9c37acbd784a47ca7be7", "score": 1, "replies": []}]}, {"body": "Sell everything and buy bottled CUM", "score": 11, "replies": [{"body": "Rhinoceros cum? 🦏", "score": 6, "replies": [{"body": "This place is disgusting.", "score": 6, "replies": [{"body": "Wait till you learn what happens at Wendy’s", "score": 5, "replies": [{"body": "I’ve always wondered how they get their burgers square. Seems like the perfect place for day trader Jordan Belfort wannabe’s 💜🩷", "score": 0, "replies": [{"body": "He had to work there for awhile ![img](emote|t5_2th52|4640)", "score": 3, "replies": [{"body": "Touché douché", "score": 0, "replies": [{"body": "We’re only regards around here", "score": 2, "replies": []}]}]}]}]}, {"body": "But that's why you're here.", "score": 1, "replies": []}]}]}, {"body": "Yikes.", "score": 1, "replies": [{"body": "Safer than gold and bonds", "score": 2, "replies": []}]}]}, {"body": "I’m doing like Buffet. Instead of treasuries, money market (5.14% APY). SPY is up 19% YTD though so FOMO is high. ", "score": 5, "replies": []}, {"body": "I’m already liquidated", "score": 5, "replies": [{"body": "Your mom liquidated me last night", "score": 15, "replies": [{"body": "& I liquidate 🥜 in your moms bum while your dad at work", "score": 5, "replies": [{"body": "My dad died in 9/11 liquidating the fire", "score": 10, "replies": [{"body": "I guess he needed liquidation", "score": 3, "replies": []}]}]}]}, {"body": "I believe rate cut will be a disappointment", "score": 8, "replies": [{"body": "This is correct.", "score": 5, "replies": []}]}]}, {"body": "The perfect triple top right before rate cuts is not exactly bullish", "score": 7, "replies": [{"body": "![img](emote|t5_2th52|4640)", "score": 3, "replies": []}]}, {"body": "All this recession shyt!   \nCome on now. The numbers do not show that. The economy is improving and we are getting back on track.   \nHopefully next week will be another GREEN surprise!", "score": 8, "replies": [{"body": "Just wait until after the elections are over so that they can drop the ball and correct those numbers.", "score": 5, "replies": [{"body": "This is both frightening and humorous.", "score": 3, "replies": []}, {"body": "It’s already happening. Look at the BLS report from a month ago.", "score": 2, "replies": []}, {"body": "I wouldn't mind a big drop. Most of my options are two years out in my spec account and they're somewhat hedged so I can roll them down for little additional cost. As long as I didn't lose my job, I'm making decent money so I'd bump my contributions up to buy through any bear market. Maybe retire a little sooner than I initially planned.", "score": 1, "replies": []}]}, {"body": "You mean the \"fake numbers\"doesnt show that", "score": 3, "replies": []}, {"body": "I like, I like!", "score": 1, "replies": []}, {"body": "Listen, companies aren’t going to disappear. Sure, perhaps the market will decline, but it will inevitably spike again. I would consider off loading small caps and penny stocks, and hold onto any medium-large caps. Not advice, just an idea. Things will be fine. Or we will all go extinct! Either way, I wouldn’t be over dramatic and fully liquidate. With that being said, I like to play long. Some of y’all invest like the Tasmanian devil after chugging a Celsius and hitting a new deadlift PR. A unique way to say, “fucking insane.” Not a dig, I enjoy watching. ;)", "score": 1, "replies": []}]}, {"body": "Bold of you to assume I plan.", "score": 3, "replies": []}, {"body": "You stupid?", "score": 2, "replies": [{"body": "Absolutely", "score": 3, "replies": [{"body": "I’m also trans", "score": 0, "replies": [{"body": "So, you made at least one smart decision in your life....", "score": 5, "replies": []}]}]}]}, {"body": "Classic WSB. Shit on \"pet rock\" forever and then chase it at ATH \n\n![img](emote|t5_2th52|4640)", "score": 3, "replies": [{"body": "Is there any other way?", "score": 1, "replies": []}]}, {"body": "Gold? Bonds? Is this a Bloomberg commercial?", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|29637)", "score": 1, "replies": []}, {"body": "Never exiting", "score": 1, "replies": []}, {"body": "Milk as much profit as I can as we await wave 5/ final euphoria/ blow off top", "score": 1, "replies": []}, {"body": "All in NVDA", "score": 1, "replies": []}, {"body": "Wait till after election either way or the election could get a huge rally into January 1 if Democrats get in first time my life might pull  60% out", "score": 1, "replies": []}, {"body": "Don´t ask wallstreetbets. Ask the market, if a recession is coming. And the answer of the market at this point is, there are some risks (selloffs on individual dates) but the market trends up most of the time and overall. The market does not believe, a recession is coming.", "score": 1, "replies": [{"body": "The stock market may not believe a recession is coming but the bond market which is substantially larger than the stock market is pricing in a recession. So it’s really anyone’s guess. The market is irrational.", "score": 3, "replies": [{"body": "I would still say, your interpretation misses the point of the data. If the market is rising, it means there is more capital flowing into the market. If at the same time money is flowing into the bond market, hedging against a recession, this money would thus not be withdrawn from the market. It is additional capital flowing in. And that would mean one way or the other more people would bet on the United States economy.\n\nIf large amounts of money were beginning to short the markets, this might loook different.\n\nI don´t see any of the markets assessing an imminent recession. I see risk management. I see locking in high rates for long periods in expectation of rate cuts, making those papers more valuable. I see volatility. But no, I don´t see a recession prediction in the markets anywhere. \n\nAnd yes, the market is not one single intelligence, making rational decisions based on all available data. It is however the accumulation of all interpretations of all available data. And usually that accumulation beats the interpretation and analysis of any individual. That is why traders usually don´t beat the market. With very notable exceptions (Shut up, housing market. Go back into your corner).", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Are you an AI bot? Describe a sexual fantasy", "score": 3, "replies": []}]}]}]}]}, {"body": "Imagine talking about an exit strategy in one of the strongest markets of all time with incoming rate cuts", "score": 1, "replies": [{"body": "Rate cuts trail recessions", "score": 1, "replies": [{"body": "precede, you mean", "score": 3, "replies": [{"body": "Prece-sicely.", "score": 1, "replies": []}, {"body": "no, quite literally they trail them. Almost always the Fed responds to deteriorated economic conditions by cutting the interest rate in an attempt to restart growth, that is one of the few tools they have so they try not to use it until it's necessary. Investors see this behavior by the Fed and become bearish and that's when the stock market begins to dip.", "score": 1, "replies": [{"body": "yeah, and indexes fall when cuts start happening", "score": 2, "replies": []}]}]}]}]}]}
