{"title": "Why does the stock price drop when dividends are paid? ", "selftext": "[deleted]", "id": "1fliv2h", "created_utc": 1726856595.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 92, "comments": [{"body": "When the dividend is paid out the company is worth less hence the stock price drops", "score": 61, "replies": [{"body": "I enjoy spending time with my friends.", "score": 18, "replies": [{"body": "And dividends are taxed as income which is not ideal", "score": 6, "replies": [{"body": "Not if they are qualified dividends.", "score": 0, "replies": []}]}, {"body": "Yep they think they are getting free money", "score": 0, "replies": []}, {"body": "Or...people...sell? After div sell stock and get out?\n\nStock fal", "score": -11, "replies": []}]}, {"body": "Yeah but that theory is based on the stock price accurately representing the company which we know is rarely the case IRL (aka we have overvalued and undervalued stocks). If the company is priced due to other factors why is the div accurately priced all the time thats what didnt make sense to me.", "score": -24, "replies": [{"body": "Of course the dividend is not accurately priced to the decimal on the day of dividend payout. If a hypothetical 10$ per share stock pays $1 dividend the price will roughly decrease to 9$, but due to the usual fluctuation, news, market sentiment etc. the price might be 8.85$ or 9.07$.\n\nBut of course it will be somehow closer to 9$. Before the payout had 1$ cash per stock on their balance sheet, that one dollar of cash per stock just disappeared and the company is worth 1$ less per share. \n\nYou are losing yourself a bit in the theory I believe. The theory is absolutely fine to explain market effects and the effect of cash outflow being represented in the valuation. But alle market theories underlying assumptions regarding liquid markets, full transparency - like often in science it’s just fictional, but the model still works to explain effects, even though not to the last decimal.", "score": 11, "replies": [{"body": "Are you sure about that first paragraph? Everything I've read says the price drops by exactly the dividend.", "score": -20, "replies": [{"body": "The price does drop by exactly the dividend amount, all else equal. Of course, there are usual market fluctuations that will cause actual closing prices to differ, which is what they are getting at.\n\n\n\nBut look at returns/closing prices adjusted for dividends vs unadjusted. You'll find they differ by exactly the dividend amount.", "score": 6, "replies": []}, {"body": "He is right about the first paragraph.\n\nLet's instead say the company is private, not public. Then company's value will drop by exact amount of the dividend. The dividend is money the company has in its bank account, and it pays that amount to its owners. The value of the company drops by the exact amount of the dividend.\n\nEdit: To be clear, changing from public to private is meant to illustrate what happens when you remove the randomness of all the entities/people that are active in the market.", "score": 8, "replies": []}, {"body": "If stock prices move exactly as per \" theory \" wouldn't be any uncertainty, right?\n\nWhile doubts are good, please broaden your horizons to include reality, human irrationality and market movements.", "score": 2, "replies": [{"body": "??? But's that exactly my point given everything you said I was wondering why the stocks price drops EXACTLY as per the dividend. If you look at investopedia it also says the same thing the stock price drops exactly by the dividend:\n\nhttps://www.investopedia.com/articles/investing/091015/how-dividends-affect-stock-prices.asp#:\\~:text=After%20a%20stock%20goes%20ex,prices%20in%20the%20short%20term.", "score": -5, "replies": [{"body": "Investopedia:  \"After the ex-dividend date, the share price of a stock **usually** drops by the amount of the dividend.\" (emphasis mine).\n\nStocks only drop by *exactly* the dividend on the ex-date when they are mostly price stable (staying at a level price or on a slow, steady trajectory) *and* most of the trading is institutional. \n\nA stock's price is determined by people making buy and sell offers and meeting in the middle, so anything that changes perception of the stock's value will change those offers, which will change the price.\n\nWhen a stock is highly volatile to begin with, the price will move for other reasons at the same time, which makes the dividend drop inaccurate because it's hard to calculate where the price 'should' be. \n\nAlso volatile stocks are often heavily traded, and short-term traders will buy and sell just *because* there is a sudden shift in the price which can cause the price to move in either direction for no reason connected to the fundamental value of the company.\n\nAlso,  when a stock is heavily traded by retail (even by retail 'investors' as opposed to retail 'traders'), there will be many market participants who do not understand the significance of a dividend ex-date and will not factor it in at all, or will mistakenly factor it in on the distribution date instead of the ex-date. \n\nWhat *does* drop by exactly the dividend amount on the ex-date is the underlying *value* of each share. But nothing forces a stock's price to match its actual value. It gets close only when a company is well understood and most market participants agree on how that value can be calculated.", "score": 2, "replies": [{"body": "ok thanks a lot for the clarification.", "score": 1, "replies": [{"body": "The bids and asks from the previous days close are adjusted down by the exact amount of the dividend.  These adjusted bids and asks are used to start the day at the open on ex-div.  Since they are bids and asks, bidding starts and the actual open price will vary some since its not set until the first trade is made.", "score": 1, "replies": []}]}]}]}]}, {"body": "It does. Also, unrelated to the dividend, other factors lead to price volatility. What you observe is the sum of all things which affect prices. You don't necessarily see a change in price equal to the dividend because dividends are not the only thing affecting prices. The impact of the divident is the amount of the dividend. The change in the stock price depends on more influences than only the dividend.", "score": 2, "replies": [{"body": "Actually you should see the price drop equal to the dividend given based on my research because the stock brokers or whoever artificially lower the price by the dividend given out.", "score": -1, "replies": [{"body": ">Actually you should see the price drop equal to the dividend given\n\nYes. That's what I said. I'm glad you understand.\n\n>stock brokers or whoever artificially lower the price by the dividend given out.\n\nNo. The market makers lower their bid and ask prices because their whole business is providing liquidity in order to attract arbitrage for themselves, not giving away arbitrage to other market participants. They lower their bid and ask prices because lowering their prices is correct. There is nothing artificial about this.", "score": 3, "replies": []}]}]}, {"body": "Exact amount, plus other market forces. If it didn’t then hedge funds could just buy stocks on leverage before ex div date, sell next day, and make infinite profits from divvies.", "score": 1, "replies": []}, {"body": "It does, dividends come directly out of the stock price. If the stock fluctuates that day to than it can be more or less.", "score": 1, "replies": []}]}]}, {"body": "There are many factors that determine a stocks price that are maybe intangible but dividends being paid out seems like a tangible factor. the company is giving out/lose XX.XX total because of dividends", "score": 0, "replies": [{"body": "Yeah but if you think about it say a stock price is 90% intangible/Hype and only 10% assets (like say Tesla), if Tesla gives out a dividend the price drop should only be 10% of the dividend as well since the asset value only accounts for 10% of the total price. \n\nAlso youd have to think some people dont give a crap the company just gave out dividends, they still buy Tesla at a high price cuz they buy into the hype. So in reality you should have cases where the stock rises in price after dividend as some enthusiastic buyers still buy at a higher price.", "score": -1, "replies": [{"body": "If Tesla (1 trillion) is 900bn hype and 100bn cash, and pays out 10bn dividends, the company is now 900bn hype and 90bn cash, giving 990bn new market cap and 1% drop.", "score": 2, "replies": []}, {"body": "Then let’s make a fictional example: let’s say we are talking about a real Tesla car, having its market value. In addition 50,000$ cash laying on the seat. \n\nYou bid to buy the full car including everything inside. You make an assumption about the car residual value, battery or whatever. If you made your assumptions you add 50,000$ to represent the cash. That is what you bid for the whole thing.\n\nIf the seller now removes the 50,000$, or just 25,000$, you would of course reduce your bid price by this amount. It’s quite simple, if you get 50,000$ less cash you pays 50,000$ less.\n\nThat’s exactly the effect. Cash is the simpelst of all valuation factors. Whatever you factor in the stock price, if the company pays dividend x, the valuation / price has to decrease by x. In the same day of course the Tesla car itself could slightly increase or decrease in price, which could affect the overall price.", "score": 2, "replies": []}]}]}, {"body": "When a company gives away assets, the company is worth less, and the perception of people is now, the company is worth less.", "score": -1, "replies": [{"body": "Sure but my question is the price drops exactly by the dividend when the price isnt based solely on the company assets", "score": -5, "replies": [{"body": "You said you already read the answer and disagree with others responses.", "score": 6, "replies": []}]}]}]}]}, {"body": "A simple way to understand it is to look at a purely cash ETF\n\nLet's use HISU.U, it's an ETF that is 100% cash (so no extrinsic value, so all things stay equal with the only difference is the accrued daily interest paid as dividend monthky)\n\nIt is worth $100 on day 1, but everyday, the price is higher by a few cents, to represent the accrued interest, and on the ex-div date, it \"resets\" to $100\n\nWhy does it reset? Because the person buying it on the day after the ex div date will not receive the distribution, so for him, it is only worth $100. Why would he pay 100.45 or 100.12? So the market adjusts itself, and the price goes back to $100 like magic! \n\nSo let's say there's a company with a worth $100M and you know that on September 30th that company will issue $1M in dividend, then you know that on the 30th, the company will no longer be worth 100M but only 99M. Why would you pay more for something that is worth less. So the share price will drop by the same % as what it paid in dividend. That is of course, all things being equal. \n\nThe more players you have in the market, the more efficient the market becomes. \n\nObviously,  like you mentioned,  there is also supply/demand that drives the price of the asset, so even if a company spends money on dividends the price could go up despite the dividend.", "score": 7, "replies": [{"body": "Best answer here by far", "score": 3, "replies": []}, {"body": "Actually based on investopedia the price always goes down exactly by the dividend price, mainly because it is artificially manipulated by the stock brokers. There's no market forces at play the stock brokers just reduce the price that's why it drops exactly by the dividend paid every single time. \n\nhttps://www.investopedia.com/articles/investing/091015/how-dividends-affect-stock-prices.asp#:\\~:text=After%20a%20stock%20goes%20ex,prices%20in%20the%20short%20term.", "score": -2, "replies": [{"body": "Did you read what you posted? It says the opposite of what you wrote and supports my simplified explanation. \n\n\n\n>On the ex-date, investors may drive down the stock price by the amount of the dividend to account for the fact that new investors are not eligible to receive dividends and are therefore unwilling to pay a premium.\n\n>[...] the actual price change is based on market activity and not determined by any governing entity.", "score": 3, "replies": []}]}]}, {"body": "the other two comments are not very helpful imo.\n\ntheoretically, since the market obviously knows when the dividend will be paid out and how much will be paid out, the event should be priced in and the stock unmoving.\n\nthe reason why the stock drops by a bit every time divs are paid out is because most people who were intending to sell the stock some months prior, held off from it until they recieved their dividend. those people are artificially lowering the price of the stock. that is also the reason why it usually rebounds back pretty quick.", "score": 20, "replies": [{"body": "It being priced in is exactly why the price changes on the ex dividend date by the amount of the dividend. If the dividend payout did not drop the price of the stock, there would be an exploitable arbitrage in buying right before and selling right after the timing of the dividend to capture the dividend basically for free. The price drops by the amount of the dividend because doing anything else would be inefficient.", "score": 4, "replies": [{"body": "i dont get this line of thinking. if the market is able to forsee by how much the company will be devalued from the dividend payout, why would it react only after the fact?", "score": 1, "replies": [{"body": "The value of receiving the dividend is equal to the value lost by the company. The value of receiving the dividend is also priced into the stock, not only the value lost by the company upon paying that dividend.\n\nOnce the dividend is assigned to the people holding stock, that event has occurred. Those people receive dollars and the dividend that has already been paid is no longer priced into the stock because it happened already. That is why the price changes on the ex dividend date by the amount of the dividend and not before that point.", "score": 3, "replies": []}]}]}, {"body": "For that you would just need to hold it until the ex date and not necessarily wait for the payout day.", "score": 1, "replies": [{"body": "The price drops I’ve encountered are the ex-date not the payout date.", "score": 4, "replies": [{"body": "The drop happens between the close of the day before ex-div and the open on the ex-div.", "score": 2, "replies": []}]}]}]}, {"body": "Look up the dividend capture strategy.\n\nBottom line is it doesn’t usually work, except sometimes it does. If you can figure out where the sometimes is, you can make money (in either direction).", "score": 5, "replies": []}, {"body": "You can make more if you buy before dividends are announced and then sell the spike. Everybody dumps once they have held long enough to earn dividend if thats what they want but most buy for the spike then sell while high", "score": 2, "replies": [{"body": "Hey, don’t reveal the dividend arbitrage glitch, man.  We have enough billionaires as it is.", "score": 0, "replies": [{"body": "Im honestly about to give up nobody listens or thinks im regarded so it dont matter anyway it wont stick 😂😂", "score": 1, "replies": []}]}]}, {"body": "If a company has 100 dollars in cash, then only has 75 dollars of cash. Is the company worth less money if you were to buy it?\n\n\n\n\nYou could try shorting it but every know it's going to go down so the premium for that contract is going to have that factored in.", "score": 5, "replies": [{"body": "Except when to short the stock you actually owe the dividend", "score": 9, "replies": []}, {"body": "Your first statement only applies if the Stock market price accurately values the company right? \n\nLike say the company is only worth 100 usd and it is priced at 100 usd, then yes if it gives 25 usd the price should also be 75 usd. \n\nBut what we know in real life is stocks can be overvalued or undervalued, nobody really knows the true value of a company and the price is based on supply and demand rather than the actual worth of that company. Like when Gamestop pump happened, it pumped by the hate for hedgefunds movement or w/e more than the actual assets of the company. So what we can see is the stock price is based on more than what the company is worth on paper, a lot of other factors affect the stock price like future prospects, company perception, any possible threats etc\n\nSo just following that line of logic with everything being so muddled its weird to me the stock price drops by the dividend every single time so accurately unless it is artificially done.", "score": 3, "replies": [{"body": "The reason why this action is \"priced\" explicitly based on the value of the company is because real money is changing hands. The company is giving you an amount of money. That amount of money tangibly exists, and must be accounted for as far as the institutions are concerned. It has to fit within their quarterly and yearly reports in a real way that is tied to genuine numbers.\n\nI think that's where you're confused. Stock prices are speculative and \"made up\". Once you buy 1 share of a company for $3.50, you no longer have $3.50. $3.50 is not in the picture anymore. You have 1 share of a company, with a variable value. It might be worth $0.35 or $350.00 within the next 8 seconds, so your original $3.50 only exists hypothetically. The fixed value of that is \"1\". 1 share. You will need to sell the share at an amount that covers taxes in order for that $3.50 to ever exist again. If you never do that, it's permanently metamorphosized into a new value: 1 share of a company, period. In a world where you never sell that share, your $3.50 is not \"real\" anymore, and it will never exist again. Until something else happens, in units it's not 3.5 anymore, it's 1.\n\nIf you receive a $0.50 dividend while holding the share, that $0.50 *truly exists* at the exact monetary value it has, at the exact moment it is paid out. It's not speculative, it's not variable, holding it as it is does nothing to it. It is a legitimate amount of real money, subject only to inflation, taxes, and the interest rate of the account where it lands. No one in the world can \"move\" the price of this dividend without first transforming it into shares of a company, it's just flat out money being handed to you. Therefore, it is handled as such and doesn't fall under the same logic as the \"made up\" stock price.\n\nI hope that makes sense. TLDR you're using the kind of logic reserved for hypothetical numbers on real numbers.", "score": 2, "replies": [{"body": "But if that's your logic why is it when companies put out earnings report why doesn't their price increase by exactly the profit increase? That's real money the company earned and is now in their deposit accounts but the price doesn't increase by the corresponding amount either. But when they give out dividends the share price drops because the cash left the company? \n\nIt's just not consistent any way you look at it.", "score": 1, "replies": [{"body": ">earnings report why doesn't their price increase by exactly the profit increase?\n\nBecause the market has made predictions about that information and priced according to those expectations. If the market's expectations are exactly right, then the price doesn't move at all upon learning that information because that information was already present in prices.", "score": 2, "replies": [{"body": "So price increase is just based on prediction and information but the dividend decrease is based on the actual amount of cash that left the company? \n\nThats not consistent.", "score": -1, "replies": [{"body": "Because dividends does not affect the price in advance. If the company is worth 100 dollar before dividend and they give 20 dollar dividend it will be worth 80 dollar + 20 dollar cash after. You still have 100 dollar. If they give 30 dollar the same principle holds. 70 + 30 is still 100. It does not affect the value of your stock pre dividend. No matter how much they give you cash its still worth 100 dollar before.", "score": 1, "replies": [{"body": "uh ok? Im talking Bout after the dividend is given not before. \n\nIf you give the dividend the price decreases but when earnings are published the price may or may not increase.", "score": -3, "replies": []}]}, {"body": "It's not inconsistent at all.\n\nThe market has perfect information about the dividend.\n\nThe company's value will decrease by x dollars on some date. Everyone is aware of that.\n\nEveryone who owns the company on that date will get a proportional share of rhat same $x.\n\nUntil that date, the perfect knowledge of receiving a share of that $x perfectly cancels the known drop in the value of the company on the date of the dividend.\n\nAfter that date, the company's value has decreased as expected but the deadline to own the stock in order to receive payment for the dividend has passed and therefore this is no longer canceling out the decreased value of the company.\n\nThe stock price does not drop early for the simple reason that there is a payment at a specified date for having ownership equal to the drop in value. The market has perfect information about this ***and*** it is correct for the price not to decrease early. It makes sense in theory and it applies in practice.\n\nYou're free to ask questions, but please stop pretending you're right and know everything.", "score": 0, "replies": []}]}]}]}]}, {"body": "Yes, stocks are over- and undervalued and some are priced to absolute perfection onto the cent. The reason for this is manifold, too big and complex to discuss here.\n\nBut when the dividend is paid, the market knows exactly the amount by which the company *value* decreases. Hence, the price is going to decrease by a very similar margin because it is *known*. The stock price is to a large degree based on unknowns, that's why companies rarely are priced similar to their actual value. Unless, of course, a company would make zero profits tomorrow forever, then it is going to be priced based on the actual cash + equity - debt they have. And if they pay a dividend, some of that cash is reduced, which reduces the value because it is a very simple equation. Of course, there is rarely a company that will make zero profits in the future, so there are unkowns that also contribute to potential value, which is were we get closer to the stock price. But again, a dividend is a known decrease in value, hence the stock price, which is a function of a company's kown and unkown profits, is going to decrease in a way that is reflective of that. For a company, where unkown profits contribute a lot to the stock price e.g. Tesla, such a dividend payout will only marginally decrease the stock price. For a company where known profits or cash contribute a lot to stock price e.g. Alibaba ($200b market cap, $55b cash on hand) a dividend payout likely has a bigger impact on stock price.", "score": 1, "replies": [{"body": "\"such a dividend pay out will only marginally decrease the stock price\"\n\n  \nActually you are wrong the price always drops EXACTLY as per the dividend. There's no marginally or extreme impact on stock price it is exactly as per the dividend price every time. That's why I was hella confused but it turns out it is artificially done by the brokers that's why the price is reduced exactly as per the dividend. \n\n  \nhttps://www.investopedia.com/articles/investing/091015/how-dividends-affect-stock-prices.asp#:\\~:text=After%20a%20stock%20goes%20ex,prices%20in%20the%20short%20term.", "score": 0, "replies": []}]}, {"body": "Instead of a company imagine if it was a box that makes money every quarter with $100 in it that you believe is worth $125. Someone else takes $50 from the box (a dividend). Would you still pay that $125 one second afterwards?", "score": 1, "replies": []}]}]}, {"body": ">not really the actual assets of the company\n\nCorrect, but if the market values a company at, say $50/share, and there is a $1 dividend with an ex-date in the next day or so, then the market will set a price of $51 on the stock - $50 for the inherent value of the stock, and $1 for the dividend that holders will be entitled to in the next few days. \n\n>Like if the price is 60 usd, and then they're gonna give a 1 usd dividend, then now you know the price will be 59 after the ex dividend rate right? Couldnt you then short it on the ex dividend date since you know the price will go down?\n\nBecause you won't gain anything, because you will owe the dividend.  If the stock is at $60 and you sell it short on the day before ex-date, you are borrowing that share from a shareholder.  On ex-date, the stock will go down to $59, but you will owe the $1 dividend to the shareholder you borrowed it from.  So, if let's say you then cover the short at $59.  You got $60 in proceeds from shorting the stock, you spend $59 to buy back the stock, and you spend $1 to pay the dividend on the borrowed share - for a net gain of $0.", "score": 3, "replies": [{"body": "Stocks arent inherently valued IRL though right, thats why we always have overvalued and undervalued stocks. The market doesnt price the stock correctly all the time but they know to discount the dividend exactly from the stock price every time?", "score": 1, "replies": [{"body": "Yes because we know there will be a dividend. That is a fact that can be reflected in the price. \n\n\nThe price of a stock reflects the expected future cash flow. If we know with 100% certainty that the company will distribute $1/share on X date, then the stock price will reflect that drop in cash on that date when it is paid out.", "score": 3, "replies": []}, {"body": "Stocks aren't perfectly valued, but the market tries to perfectly value them. Imperfect information / disagreements about how lead to fluctuations and over/under valued stocks. Just because there are fluctuations doesn't mean the market has given up on valuations. \n\nHowever, we can perfectly evaluate dividend payouts , so it is reflected accordingly.", "score": 2, "replies": []}]}]}, {"body": "because dividend payout reduces the book value of the company.", "score": 5, "replies": []}, {"body": "The price of the share right before the dividend reflects the fact that you will immediately earn $1 by holding the share, so the share is worth $1 plus whatever it would have been worth otherwise. Nobody is going to loan you shares or sell you a put without factoring in the $1 dividend, so you aren't going to get free money that way, just like you aren't going to get free money buy buying before the dividend and selling immediately after. It's totally priced in on both sides because otherwise it would be free infinite money for everyone.\n\nThe price of a share is based on what people are willing to pay for it. There are no real movements or artificial movements. What people are willing to pay for it may or may not be based on the underlying value of the company.", "score": 1, "replies": []}, {"body": "Your question seems to be more about the market structure than dividends. If a dividend is paid out, but market sentiment is good, why  should the stock price go down when everyone thinks it's just going to gain it back tomorrow? This is why the price decreases less during a bull market. \n\n\nSimilarly, if a dividend is paid in a bear market, why should anyone buy that stock today? They've got, minimum, a month (if it's $O) to 3 months to get back in and let price fall some more. \n\n\nSentiment is important here, and today is a weird day for sentiment being that the S&P is testing new highs. That's my take.", "score": 1, "replies": []}, {"body": "Because a portion of the company is being paid out to investors. A company that has profits (cash) is valued with all assets priced. If paid out that is subtracted.", "score": 1, "replies": [{"body": "But if they gain profits (cash) the price doesnt rise accordingly even if they gained cash.", "score": 0, "replies": [{"body": ">the price doesnt rise accordingly even if they gained cash\n\nWhy do you think that? This is not true, but seems to form the foundation of your misunderstanding. Perhaps if we deconstruct this idea you can come to understand what's happening.", "score": 1, "replies": [{"body": "What do you mean? Companies release their earnings every quarter. Stock prices rise and fall on the news but never is the price rise exactly the same as the quarter earnings unlike when the price falls when the stock releases dividends.", "score": 0, "replies": [{"body": ">>earnings report why doesn't their price increase by exactly the profit increase?\n\n>Because the market has made predictions about that information and priced according to those expectations. If the market's expectations are exactly right, then the price doesn't move at all upon learning that information because that information was already present in prices.\n\nGuy already explained that. Also said earnings and dividends arent the same. Lots already told you price drop from dividend payout isnt exact, but close", "score": 2, "replies": []}, {"body": "Cash is added to the company irrespective of announcing earnings. Cash was already there by the time it was announced to be there. People in the market estimated already how much the business earned and that estimate was priced into the stock already.\n\nEarnings announcements are not like dividends at all, I don't know why you keep trying to compare them. Earnings announcements are a source of information. Dividends are distributions of cash.\n\nAre you asking other people questions just to attract an audience to argue with, or are you trying to learn? If you're asking people qustions to learn, maybe tone down your assumptions that you're always right about things and actually read people's explanations of why you're wrong, and actually read people's explanations of why things are happening.\n\nMy first paragraphs are a copy paste of a different answer I gave you, clearly you didn't read it. Try again.", "score": 1, "replies": []}]}]}]}]}, {"body": "That’s because the dividend paid to you was taken from the stock price and paid to you !  Let’s say the dividend was .25 per share. The price before the dividend was $10 per share. The new price per share is now $9.75. Really a wash !", "score": 1, "replies": [{"body": "But when earnings are declared the price doesnt always go up even when cash is added to the company. \n\nThe share price is 10 USD. The company declares their earnings to be 1 EPS. The price doesnt always increase by 1 usd especially if the earnings are below forecast it may even drop even if the company still earned cash due to operations.", "score": -1, "replies": [{"body": "Yep , the price may never get back to $10 or it moves forward like most good companies do.", "score": 1, "replies": []}, {"body": "Cash is added to the company irrespective of announcing earnings. Cash was already there by the time it was announced to be there. People in the market estimated already how much the business earned and that estimate was priced into the stock already.\n\nEarnings announcements are not like dividends at all, I don't know why you keep trying to compare them. Earnings announcements are a source of information. Dividends are distributions of cash.", "score": 1, "replies": []}]}]}, {"body": "When would you buy a stock if it was worth the same amount of money before and after the dividend is paid? Of course before the dividend because really the only difference is do you want extra money or no extra money. If it didn't drop then people could just buy the stock just before the dividend and sell afterwards for low risk huge profit relative to the time one held the stock. And some people do sell their shares if they determine that the stock will keep dropping more from the current price and that drops the price.", "score": 1, "replies": []}, {"body": "It doesn't necessarily drop by dividend. If stock is growing or in demand it will drop less or not much at all.", "score": 1, "replies": []}, {"body": "Allegedly, stock prices should be based on balance sheets, forecasts and psychology aside.  When dividends are paid  out, you can see where this would change the balance sheets.  Also, it's generally priced in, 99.9% of dividend payments are predicted.", "score": 1, "replies": []}, {"body": "A company is like a swimming pool with water (money) flowing in and draining out. The goal of management is to give as much water as possible to shareholders. When a dividend is paid, it’s like some water being splashed out to current investors. This is good for the people who got that payout, but there’s less water in the pool, making it less valuable to anyone considering buying.", "score": 1, "replies": [{"body": "Yeah but again like I said in my op the stock price doesnt accurately capture the amount of water (money) in the pool. A lot of things factor into the price rather than just the money in the pool just look at Tesla.", "score": 1, "replies": [{"body": "True. Stock values are based on expected future value. Once a dividend has been paid, the expected future value is the same, minus the dividend payment.", "score": 1, "replies": [{"body": "Why should the future return be the same if the company lost money? They dont need money to make money anymore?", "score": 1, "replies": [{"body": "Well companies give out dividends when they have excess cash flow, and don’t think they would get a higher return by reinvesting in the business. Implicit in the dividend is the assumption that the company has more than enough capital to get the returns their business model is designed for, and that they would be wasting some of the shareholders time value of money by holding onto it and not putting it to productive use.", "score": 1, "replies": []}]}]}]}]}, {"body": "[https://www.investopedia.com/articles/stocks/11/dividend-capture-strategy.asp](https://www.investopedia.com/articles/stocks/11/dividend-capture-strategy.asp)", "score": 1, "replies": [{"body": "thanks bro", "score": 1, "replies": []}]}, {"body": "People cash out", "score": -1, "replies": []}, {"body": "Because they are paying out assets which decrease worth. Usually doesn’t happen except with income oriented stocks or etfs", "score": 0, "replies": []}, {"body": "yes it's an artificial drop\n\nthe market typically moves unpredictably as always, so even if you short it, it's still a gamble if it'll work in your favor", "score": -2, "replies": [{"body": "Thanks. I was really confused for a while there how it could happen. It also seemed bad to me but then I read somewhere it is done so you dont get taxed for a dividend you didnt get if you bought it past the ex div date.", "score": 0, "replies": [{"body": "yeah, it's a market regulation. The brokers manually adjust the prices of all open orders", "score": 0, "replies": []}]}]}, {"body": "Its because  cash isnsmaller which means the total assets is smaller which means the company should be valued less. Its pretty srtificial and in theory the company price should get back to its price.\nIf u short u have to pay back dividend, so its not a genius tactic.", "score": -1, "replies": []}]}
{"title": "$TSLA Super Chill Weekend Thread September 21-22, 2024", "selftext": "No comments constitute financial or investment advice.\n\n 🛫  ⛵  🏍️  🏄 \n\n[I want more chill](https://www.youtube.com/watch?v=ZablHuqE4WU)", "id": "1fll7jd", "created_utc": 1726862709.0, "score": 15, "upvote_ratio": 0.78, "num_comments": 175, "comments": [{"body": "https://preview.redd.it/mumjbo01v0qd1.jpeg?width=4096&format=pjpg&auto=webp&s=e215e20117d80ddbd9b6c649fa5d6aef18d739ff\n\nOh just have to show you guys this. Like I mentioned before my workplace just got a MY which replaced 1 of 3 hyundai kona's.\n\nThere are now literally daily arguments over who gets the Tesla 😂 the clients want it for the superior soundsystem, and the staff prefer it mostly b/c its the safest choice. The konas have gotten two phantom braking mishaps which could've gone horribly. And nota bene I did not make that custom logo, but a staff member not affiliated with the brand did.", "score": 14, "replies": []}, {"body": "https://preview.redd.it/gjxqc1nd07qd1.jpeg?width=3024&format=pjpg&auto=webp&s=c21ecc2cb02b0a1ab493106b4ffe6fbc54518b49\n\nTook a day trip to Monaco.\n\nWhere I would move to, had tsla tripled in 2022 /s", "score": 10, "replies": [{"body": "500k gives you residence.\n\nBut no double taxation treaties and doubt you want to live there for an extended period.\n\nBut I havent checked what triggers tax residency, so might be attractive.", "score": 1, "replies": [{"body": "I’m gonna be honest, I just wrote the post for the meme, haven’t actually looked into moving there, but the rich part of the city is well maintained. Wealth inequality is enormous though", "score": 2, "replies": [{"body": "Interestingly there is a Espresso Machine maker producing in Monaco. \n\nCalled “Mypresso”", "score": 1, "replies": []}]}, {"body": "Monaco has 183 days rules apparently.", "score": 1, "replies": []}]}]}, {"body": "Put another 3 offers in for houses today \n\nEventually one will stick", "score": 8, "replies": [{"body": "Are there bidding wars or what's going on?", "score": 2, "replies": [{"body": "Houses get listed with a price range. I'll offer above the top of the range, but someone will have offered higher \n\nNot auction. Just house offers", "score": 1, "replies": []}]}, {"body": "👍", "score": 1, "replies": []}, {"body": "Good luck", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/ldn7v4ncj2qd1.jpeg?width=3670&format=pjpg&auto=webp&s=eae9703b4b1e9d477d68de73d0c6ccff3e9a68a4", "score": 8, "replies": []}, {"body": "[https://www.youtube.com/watch?v=IMnFVbUMxvc](https://www.youtube.com/watch?v=IMnFVbUMxvc)\n\nI teared up a little, NGL. Proud papa moment for me", "score": 8, "replies": [{"body": "Hawaii being the example for the mainland states. When energy distribution can be volatile, Tesla is the answer. This is awesome.", "score": 3, "replies": []}]}, {"body": "Y'all got any more of that <feverish speculation about delivery numbers leading into end of quarter>?\n\n\n/scratches neck", "score": 7, "replies": [{"body": "Strong beat thanks to China, then the mother of all pumps from 02/10 to 10/10 🚀💥👊", "score": 8, "replies": [{"body": "![gif](giphy|Q2LRWdJDq9xy8)", "score": 7, "replies": []}]}, {"body": "We are ready to get disappointed.", "score": 2, "replies": []}]}, {"body": "I feel like tera simp Omar whenever I talk to someone about my experience with FSD with hardware 4. I basically don't drive anymore. It's crazy to me. It's crazy to see new cars drive down the road that can't do this. $35k model 3 is peak value.", "score": 10, "replies": [{"body": "Even without fsd", "score": 8, "replies": []}]}, {"body": "https://x.com/elonmusk/status/1837506412357824960?s=46&t=mG-wx8ewMg03AyZIsmD4-g\n\n10-hour podcast galore incoming", "score": 4, "replies": []}, {"body": "Rings of Power is total garbage, what a shame.  Had to stop watching.", "score": 3, "replies": [{"body": "that was clear halfway through s1e1", "score": 2, "replies": []}, {"body": "I could take it anymore after the first episode of season one. I couldn't believe what I was seeing. What a farce.", "score": 1, "replies": []}, {"body": "the part this season where sauron died and then leaked into basement and ate the rats and stuff and grew back was pretty cool though\n\ni don’t see what all the fuss is about this sauron fellow he seems like a straight shooter to me. im voting for him", "score": 0, "replies": []}]}, {"body": "Wife had to drive a non-EV on a business trip. She's traumatized.", "score": 8, "replies": [{"body": "Thots and prayers 🙏🏼", "score": 5, "replies": []}, {"body": "I, I, had to... use a... gas station! <shudder>", "score": 3, "replies": []}, {"body": "Sounds like a lawsuit to me.", "score": 4, "replies": []}]}, {"body": "up at 4:00 for some stoopid reason so thot I’d share. I simply cannot overstate the state of FSD\n\nFriday had to pick up wife from work and head to fargo (\\~70mi) for a birthday dinner w stops at fancy cupcake place, ulta store, and then longhorns. plugged it all in ahead of time in the app.\n\ndrove end to end, thru town, spaghetti 2 interstate exchange ramps, and rush hour traffic, etc\n\nwhile on FSD these days I am never more present. no texting and have never just taken in my environment more. engaged the wife in real conversations. just at peace. was **present**. no time to be outraged by watever the outrage or *injustice* of the day are. might even go so far as to say it is life changing. hit the sunset omw back home and it was actually therapeutic\n\nsometimes we lose the forest thru the trees\n\nit has become one of my favorite things to do.\n\nthat is my lived experience and could not be mor grateful for it\n\n![gif](giphy|CHtrnUAF1GcDHM4CvY|downsized)", "score": 13, "replies": [{"body": "As a European i would love to try FSD first hand.", "score": 5, "replies": [{"body": "If all continues as planned it sounds like that will be in under 6 months.", "score": 5, "replies": [{"body": "I don't doupt Tesla on this, i do doubt the EU.", "score": 2, "replies": []}, {"body": "[X] doubt", "score": 1, "replies": []}]}]}, {"body": ">engaged the wife in real conversations.\n\nReal ones!?", "score": 5, "replies": [{"body": "listened+processed then responded anyway 🤡", "score": 2, "replies": []}]}, {"body": "It's a beautiful thing. You can barely explain it to non-Tesla drivers. They resist the idea that it's even possible until you put their butt in the seat.", "score": 7, "replies": [{"body": "And to us Europoors (i am not actually an euro poor, rathere a CHF rich. But you lnow what i mean).", "score": 2, "replies": [{"body": "https://preview.redd.it/ujqu73kredqd1.jpeg?width=961&format=pjpg&auto=webp&s=c9a49896e5e7e943fc59f9517c4582c366718968", "score": 3, "replies": [{"body": "As a swiss, i say no more:\nhttps://www.reddit.com/r/meme/s/UdNp15YJZn", "score": 2, "replies": [{"body": "nice\n\nuniversal one as well\n\nhttps://preview.redd.it/xpguupkgndqd1.jpeg?width=959&format=pjpg&auto=webp&s=97c97c2e330df891421dc2fe8629f318a3bd4d87", "score": 2, "replies": [{"body": "hehe", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I had it go screaming towards a red light with a sudden burst of acceleration a couple days ago. Haven't turned it on since. \n\nDifferent strokes...", "score": 5, "replies": [{"body": "yep, just going w my lived experience and choosing happiness is all", "score": 6, "replies": [{"body": "Had great drives on 12.3.6 before I got pushed to 12.4.3. This one is genuinely unsafe and frustrating. It's not a matter of 'choosing' happiness or whatnot, it's that it's unusable for any kind of normal use case. Would love to get updated to 12.5 but still waiting on that front. I'd genuinely love to get back to a build that I can count on and enjoy again.", "score": 1, "replies": [{"body": "here is to that happening in short order ☕️☕️", "score": 3, "replies": []}]}]}]}, {"body": "I've come to the conclusion I'm still gonna have to teach my daughter how to drive.  Currently she is 11.  \n\nDon't think we are going to have a full revolution by the time she's 16.\n\nHappy to be wrong.", "score": 2, "replies": [{"body": "could be scotto\n\nI will just enjoy mine until such time", "score": 3, "replies": []}, {"body": "Dude by then we'll have Optimus driving the car.", "score": 2, "replies": []}]}]}, {"body": "Going on a hike today then playing poker with the boys.  A busy day tomorrow with family as well. Enjoy the weekend my friends. Let the excitement for 10/10 build!", "score": 7, "replies": [{"body": "![gif](giphy|sBlmCCYAuAcNSq6yA6)", "score": 2, "replies": []}]}, {"body": "Waymo partnering with Uber and expanding to Atlanta and Austin: [https://www.forbes.com/sites/bradtempleton/2024/09/20/waymo-to-launch-in-atlanta-and-austin-with-uber-for-hails-and-depots/](https://www.forbes.com/sites/bradtempleton/2024/09/20/waymo-to-launch-in-atlanta-and-austin-with-uber-for-hails-and-depots/)\n\nPretty spicy that they're expanding into Austin, which is now Tesla's headquarters. I still hope that Tesla will announce geo-fenced robotaxi service with models optimized for certain cities. That way, they can learn what it's like to operate and maintain a robotaxi fleet before rolling it out nationwide.", "score": 5, "replies": [{"body": "Let's see if such things become clear on 10/10", "score": 3, "replies": []}, {"body": "shilled $uber here in the high $20s\n\nthey are hitting on several fronts rn, profitable w growing cash flows, and strong leadership team\n\ntook profits on half to buy mor $hood I think it was, so running just 220 🪑 for basically free\n\n![gif](giphy|26xBL2hh3nkgPEt8I)", "score": 3, "replies": []}]}, {"body": "![gif](giphy|fw2caEoXBisMJwksAu|downsized)", "score": 3, "replies": []}, {"body": "Weekend yes", "score": 3, "replies": []}, {"body": "Just started satisfactory.. damn that's a nice game!", "score": 3, "replies": [{"body": "Just crossed 120 hours myself, it’s an addiction.", "score": 2, "replies": [{"body": "Just arrived at coal power and it's a bit disappointing how weak it is. I had 9 bio fuel generators before and replaced with 8 coal power plants.. and it barely doubled my output. I was expecting it to last quite a while but I guess I'll gonna quickly need another set of 4 or 8. At least it's automatic and doesn't need tending all the time..", "score": 2, "replies": [{"body": "Yea but you can build large arrays of them quickly once you know what you’re doing. Same with Oil once you get there.", "score": 1, "replies": []}]}]}]}, {"body": "Any thoughts on the 4680 ramp ? Upvotemeok used to say we either need 4680 or fsd to moon.", "score": 6, "replies": [{"body": "It's encouraging to see signs of 4680 finally ramping before Tesla announces their most mass-market car to date.", "score": 8, "replies": []}, {"body": "upvoteme said a lot of things...", "score": 7, "replies": [{"body": "Wasn't wrong about most things.", "score": 17, "replies": [{"body": "He made good money.", "score": 3, "replies": []}]}]}, {"body": "The cybertruck itself is indication that ramp is going \"well\" now.\n\nBut still far from their 100GW/a goals and not game changing at the moment.\n\nAt least they will get a lot more IRA credits thanks to this. Wich our CEO is currently...\n\nGood night.", "score": 3, "replies": [{"body": "Well, depending on what the current run rate is, they're making significant progress. Cern seems to believe the current run rate is between 900k-1m cells a day. \n\n\nIf this is correct and we assume each cell is 90wh, then we're at 90Mwh a day, which is just shy of 33Gwh a year. It could be slightly higher as the capacity of the 4680 has risen slightly in the newer generation of cells.\n\n\nAJ seems to think the run rate could be as high as 1.5m cells a day, in which case we'd be at ~ 50Gwh a year.\n\n\nThe expansion in manufacturing indicates that they have solved most of the engineering challenges and now it's just a matter of outfitting more lines. I think we'll be at 100Gwh by Q3 2025 at the latest.", "score": 6, "replies": [{"body": "I mean that would be kind of game changeing.\n\nThey would need to increase production of cars rapidly to make use of all these cells if true.", "score": 1, "replies": []}, {"body": "I just wonder, is that with the full dry process and selfmade annode and catodes or are they still buying these?\n\nIf they are ramping full inhouse dry process, this is big, but i doubt it.", "score": 1, "replies": [{"body": "These are produced batteries, not bought batteries. It seems not all of them are full dry process. Given that the dry battery electrode process improves production time and manufacturing space I'd guess that recent ramp improvements are utilizing this.\n\nTesla stated they produced 50% more cells in Q2 than Q1. Still ramping. This is big imo.", "score": 1, "replies": [{"body": "It's more complicated than that. Yes they produce their own batteries. However in Q2 they stated that they have to buy the catode material form external supply. \n\nThey did however produce their first full dry batteries (assuming full inhouse) Cybertruck.  \nBut i doubt they are already ramping that at scale now. They mentioned they will start the ramp in Q4.\n\n[https://www.youtube.com/watch?v=s1XWNPgYOKs](https://www.youtube.com/watch?v=s1XWNPgYOKs)", "score": 1, "replies": [{"body": "I gotcha. I imagine they will have needs to buy cathodes for some time. The cathode factory in Austin is not in full production. In April, Tesla laid off Anthony Thurston, Senior Manager of Cathode Materials & Manufacturing for what appears to be due to many delays in the project.\n\nI'm not so sure that's a bottleneck of production though, moreso an opportunity to reduce costs once fully realized.", "score": 2, "replies": [{"body": "Yea impossible to know. \n\nBut i would guess that they don't want to fully ramp 4680 without the fully dry process. Probably just enough to support their product lineup (CTRK and Semi) with some cells to spare for downtime.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "With their reflexes cats would win all boxing matches", "score": 3, "replies": [{"body": "no they would win because they practice sitting in boxes all the time which makes them boxing experts", "score": 4, "replies": [{"body": "gold", "score": 2, "replies": []}, {"body": "Boxing matches is not an easy task.", "score": 1, "replies": []}]}, {"body": "Not very powerful punches though. Even a lion punch seems like it’s be weak. I’d go with orangutans 🦧 and their long arms throwing haymakers from across the room. They probably have glass jaws though ", "score": 1, "replies": [{"body": "Kangaroos probably have something to say about that.", "score": 2, "replies": []}]}]}, {"body": "Pretty amazing that the best journalism is being done by a few guys in their 20's that look like they just crawled out of a salvation army dumpster. They go out and actually talk to people, get a feel for what's going on, find out what the motives for stories are and paint a complete picture. The news is absolute garbage and watching it makes you dumber. [https://youtu.be/Mg9WWZTXKuE?si=dBxwIgDXaVRel6Nt](https://youtu.be/Mg9WWZTXKuE?si=dBxwIgDXaVRel6Nt)", "score": 4, "replies": [{"body": "Loved the conclusion flashed across the screen. It is possible for two things to be true at the same time", "score": 2, "replies": [{"body": "Yeah me too. It's the nuance that's desperately missing from the partisan news media", "score": 2, "replies": []}]}, {"body": "Channel 5 has always been superior journalism mostly because he (Andrew) doesn't answer to anyone. When he did that partnership with his previous channel All Gas No Brakes, well, you can see how long that lasted and turned out. \n\nPretty hard to get that with a big media company with multiple agendas and a corporate structure.", "score": 2, "replies": []}, {"body": "that was excellent ", "score": 1, "replies": [{"body": "They all are ", "score": 3, "replies": []}]}]}, {"body": "[lol what happens when you even suggest test driving a Tesla](https://www.reddit.com/r/Costco/s/1UoNPP72T3)", "score": 4, "replies": [{"body": "I get what you’re saying, but I’ve been seeing a lot more of this sentiment lately and I think there’s a little more nuance than just, “stupid person doesn’t want what’s best for them”…\n\nIt points to a greater problem of damage to the brand in general. Sure, there will always be people who are anti-EV, but Elon being a shit-for-brains in the past few years has turned a lot of people against Tesla. The fact that people are willing to make decisions against their own interest because of the perception of the brand is problematic.", "score": 9, "replies": []}, {"body": "Nothing you said was wrong but the unfortunate reality is that there has been brand damage of some degree, and it’s especially amplified on this site, as the demographic skews towards anti-Tesla. Reddit in general hates Tesla and Elon. You’re more likely to find genuinely curious and receptive people IRL who aren’t terminally online or consuming news 24/7. You also have to consider those commenting may also be virtue signaling for upvotes.", "score": 8, "replies": []}, {"body": "I went and upvoted what I could lol", "score": 8, "replies": [{"body": "![gif](giphy|1jCs6Doz3WRtOPl6bq)", "score": 5, "replies": []}]}, {"body": "this sentiment issue is almost entirely on Tesla for not managing its brand, especially with 20b in cash.", "score": 3, "replies": [{"body": "Eh, you can spend like $1b in ads and people would still hate Elon.", "score": 2, "replies": [{"body": "This is what happens every election. No amount of money spent is going to sway a certain percentage of the other side or vice versa. They’re simply in too deep in their beliefs. Same can be said of Tesla advertising right now trying to fix any damage that has been done.", "score": 3, "replies": []}]}]}, {"body": "Keep fighting the good fight", "score": 7, "replies": []}]}, {"body": "Rivian down 11% on Friday, ouch", "score": 5, "replies": [{"body": "Have they ever guided toward profitability? It reminds me of how clear Elon was back in the day, and because I believed him, I’m minted.", "score": 6, "replies": [{"body": "I think it was AJ on x that was saying the absolute best case scenario is profitability in no sooner than 2.5 years, but likely much longer. The question is, how do they stay solvent in that time without raising capital, which would dilute shareholder value.", "score": 1, "replies": [{"body": "It will be interesting to pay attention and see when that happens then. I'm not invested in them, but it's an intriguing EV story.", "score": 1, "replies": []}]}]}, {"body": "![gif](giphy|3o84sv2u7KSHKbwPza|downsized)", "score": 2, "replies": []}, {"body": "Damn, ceo must be racist", "score": 3, "replies": []}]}, {"body": "🚀", "score": 4, "replies": [{"body": "🤡🤡", "score": 0, "replies": []}]}, {"body": "Been driving in Europe last couple weeks. Autopilot has been really bad, with lots of phantom breaking and aborted steering. In the UK I’ve not had a phantom break for like a year and it steers around any corner without issue.\n\nIs it just a calibration issue (because RHD) or are all European teslas limited with AP?", "score": 3, "replies": [{"body": "I've had limited experience with autopilot (only rented a Tesla twice) and that was pretty terrible. Had about five phantom breaks in ~300 km\n\n\nEdit: in the Netherlands, on excellent highways", "score": 1, "replies": [{"body": "I use it every day on the same roads and I can't live without it. Phantom braking is exceptionally rare. Once every 7000km maybe. I'm on HW 2.5", "score": 2, "replies": [{"body": "What might cause that difference? Could it be calibration or something else that the rentals do 'wrong'?", "score": 1, "replies": [{"body": "Maybe newer hardware is trying to do \"too much\"? Maybe my area (Brabant/Utrecht/Gelderland) has less specific areas/ overpasses that are prone to phantom braking?  I honestly don't know.", "score": 1, "replies": []}]}]}, {"body": "Very interesting.", "score": 1, "replies": []}]}]}, {"body": "I think glibgloby might be Gus Fring.", "score": 3, "replies": [{"body": "😂 * adjusts tie *", "score": 5, "replies": [{"body": "Too many “coincidences”", "score": 2, "replies": []}]}, {"body": "hows that? im so confused", "score": 0, "replies": [{"body": "“Mexican pantry”. Cartel ties for sure.", "score": 3, "replies": [{"body": "![gif](giphy|d3MMcCKoCmPN9yve|downsized)", "score": 1, "replies": [{"body": "Ding ding ding ding ding 💥!!", "score": 1, "replies": []}]}]}]}]}, {"body": "missed delivery of my iPhone 16 pro max and now I have to live with old mobile technology for the next 2 days. Don’t know how I’m going to do it. This is the first time I don’t have the latest and greatest on launch day. I am a failure.\n\n  Edit - they delivered it today (Saturday) and I ripped the box open within minutes. It’s so nice. And shiny. ✨ ", "score": 3, "replies": [{"body": "I got sick of waiting every year. Apple Store pickup from now on. Upgrade to the beta ios 18.1 once you get it. I’m using it now, it’s stable, and you get to use some of the Apple Intelligence features.", "score": 2, "replies": [{"body": "They delivered it today!!  And thank you for the tips. ", "score": 0, "replies": [{"body": "Welcome! Remember to “apply” for Apple Intelligence, it takes a few hours to download in the background once you apply for it in the settings after updating to the 18.1 beta. Everyone gets in just takes a second.", "score": 0, "replies": []}]}]}, {"body": "Shiiiiiiiii", "score": 2, "replies": [{"body": "Dude - they delivered it today and it’s gorgeous!! ;) ", "score": 0, "replies": []}]}, {"body": "Excruciating", "score": 1, "replies": []}]}, {"body": "Lisan al musk will lead us to the land of yachts and tendies", "score": 3, "replies": []}, {"body": "First!!", "score": 2, "replies": [{"body": "You the man ⛹️‍♀️", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "https://preview.redd.it/99nntumft3qd1.jpeg?width=4032&format=pjpg&auto=webp&s=98c9196aae97b9d5069b8b64c2fd05b3f71d69d5\n\nI like the bike colour", "score": 1, "replies": []}]}, {"body": "Waiting by my door for UPS delivery of new iPhones 🤣", "score": 2, "replies": [{"body": "I missed my delivery and now have to wait until Monday 😭😭😭", "score": 1, "replies": []}, {"body": "The camera control is a win!", "score": 1, "replies": []}]}, {"body": "Musk would punt on oct 10 if it wasn’t material. He knows there’s been too much “wait for march of 9s”\n\nI think he’ll show a data proven roadmap for commercialization", "score": 2, "replies": [{"body": "Waymo has already paved the way for robotaxi in terms of what regulators will approve. Tesla needs to show a path to FSD disengagements reaching and surpassing that level. Then they need to show how the app and user experience will work. Will they need to hire remote operators for disengagements in the early years? They will need to describe for investors the costs and potential revenue for a system approved in all US states.\n\nIdeally V13 will be released sometime around 10/10 to mark the moment.", "score": 5, "replies": [{"body": "NHTSA can say X miles per intervention  minimum or lidar required\n\nThey can easily do this", "score": 1, "replies": [{"body": "there’s no way they dictate technology  ", "score": 3, "replies": [{"body": "They can dictate Miles per intervention though", "score": 0, "replies": [{"body": "That's a safety metric, not a tech requirement", "score": 4, "replies": [{"body": "Doesn’t matter, regulators can absolutely use that as a bar", "score": 0, "replies": []}]}]}]}]}, {"body": "Does waymo have a sustainable path to get rid of the clunky hardware on it?", "score": 0, "replies": [{"body": "They do not. Current Waymo hardware including the vehicle is ~$300k. Their cost for a ride is approximately on par with Uber.", "score": 2, "replies": []}, {"body": "Does it really need to? A robotaxis that costs 100k is better than no robotaxi", "score": 0, "replies": [{"body": "If it's not cheaper than a human what's the point exactly?", "score": 1, "replies": [{"body": "It will be cheaper than a human, even if the car costs 100k. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Hahaha", "score": 1, "replies": []}, {"body": "https://preview.redd.it/zzg3l86m6fqd1.jpeg?width=942&format=pjpg&auto=webp&s=1f49973c0340eb89f05892da98cf08a789b667fc", "score": 1, "replies": []}, {"body": "nah", "score": -1, "replies": [{"body": "yah", "score": 0, "replies": [{"body": "hah", "score": 1, "replies": []}]}]}]}, {"body": "Bout to dump tsla and go all in on this new world libery financial crypto. Looking for outsized gains with low risk here. The sky is the limit with this one and the most I can lose is 100% but gains are unlimited if I get in early = yuge payout . ", "score": 3, "replies": [{"body": "![gif](giphy|3oriO5t2QB4IPKgxHi)", "score": 9, "replies": []}, {"body": "Don't go half tard. Get the sneakers, too.", "score": 5, "replies": [{"body": "Not a sneakerhead. I got the nft . Super rare so it’ll probably pay for my lambo after the kraken drops ", "score": 1, "replies": []}]}, {"body": "I think it’s some sort of coinbase competitor? Or is it a shitcoin", "score": 1, "replies": [{"body": "Yes", "score": 2, "replies": []}]}]}, {"body": "Was about to put 10k down for M3LR but now girlfriend wants to go in on a house. Rip.", "score": 2, "replies": [{"body": "I feel you! The wife said no to me getting a MY until I’m above water on this stonk. I had the best 30 mins of my life in the test drive though 😂", "score": 5, "replies": [{"body": "got to take a refreshed m3p for an hour test drive while my mylr was getting tires rotated…\n\njfc it was awesome ", "score": 4, "replies": [{"body": "Yes!! I test drove one last week. You tried insane mode right? RIGHT!??!?!", "score": 5, "replies": [{"body": "actually i didn’t even think of it 😂", "score": 2, "replies": []}]}]}, {"body": "Maybe I just need to get her in the car for a test drive to change her mind 🤔", "score": 2, "replies": []}]}, {"body": "Don’t buy a house with someone you’re not married to.", "score": 11, "replies": [{"body": "I would usually agree with that statement for most couples. We've been together for 5 years and she'd rather have a house than a ceremony. Will probably just go to the court house lmao.", "score": 4, "replies": []}, {"body": "Why?", "score": 2, "replies": [{"body": "There are a few reasons why buying a house with a partner might not be a good idea, including: \n \nBreakups\nBuying a house together can be complicated if the relationship ends, especially if there isn’t a legal agreement in place. You might need to sell the house, or one of you might buy out the other. \n \nCredit\nIf both names are on the mortgage application and title, your credit will be affected by your partner’s actions. For example, if your partner doesn’t make a payment, your credit will be affected as well. \n \nDeath\nIf your partner dies unexpectedly, you could end up in a legal battle with their family to determine who gets the house. If your name isn’t on the title, you might be forced out of your home. \n\nRelationship dynamics\nBuying a house together can change the dynamic of the relationship. \n \nFinancial loss\nThere are no laws in place to protect the financial well-being of unmarried couples who buy a home together.\n\n—-\n\nThis was an ai summary. It can work out but things are a lot more complicated and needs a lot more preparation and planning than a married couple. If two people are about to make one of the biggest financial and impactful decisions of their lives, why don’t they just get married first.", "score": 7, "replies": [{"body": "You don't need to get married to stay together forever. This might be a my-bubble-thing, but no-one around me is getting married anymore but they are all starting a family and buying a house. Marriage is just a very expensive party and some paperwork", "score": 1, "replies": [{"body": "Doesn’t have to be a party. Just legal paperwork and some protections/expectations. You can get the same protections with additional paperwork and contracts but being married is simpler.\n\nBut yeah, marriage isn’t always necessary for everyone. The original comment is a blanket statement recommendation for the general population. Kinda like the recommendation how everyone should just be invested in index funds.", "score": 1, "replies": []}]}]}, {"body": "Put simply, 15-30 year decisions with major financial implications for any potential change, should only be made with life partners. Also, legal life partners (marriage), make this a much cleaner process.", "score": 5, "replies": []}, {"body": "Hell hath no fury, etc.", "score": 2, "replies": [{"body": "For sure", "score": 1, "replies": []}]}]}]}]}, {"body": "I waddled into a Rivian store while we were just meandering around a mall, I asked out of curiosity how much one of the cars, the 270 mile ranged three row vehicle started at 78,000.\n\nHonestly it might be worth just buying a bankruptcy put just for fun. There is no way this company is going anywhere. Shit is crazy.", "score": 2, "replies": [{"body": "if you think they are bad, just imagine how fukking bad and desperate VW is partnering with them for $5bn\n\nno worries tho, Ross gonna save that RIVN situation single handedly", "score": 0, "replies": []}]}, {"body": "all movies now suck so I’m watching hereditary for the 3rd time ", "score": 1, "replies": [{"body": "Tonight I watched mad max: furiosa again. We do like a good horror movie, I'll have to watch that one.", "score": 2, "replies": []}, {"body": "Went in blind on The Substance. A slow burn that goes from candle to supernova on the topic of beauty and addiction. Excellent cinematography and sound. Nothing held back or compromised. Haven't left the cinema so anxious since Beau is Afraid.\n\n\nHeads up: Lots, lots, lots of TnA.", "score": 1, "replies": [{"body": "( ͡° ͜ʖ ͡°) ", "score": -1, "replies": []}]}]}, {"body": "Mary Barra has the balls to reiterate GM's big EV aspirations. It's easier prognosticate now that GM just gained access to Tesla chargers. \n\nhttps://www.cbsnews.com/news/gm-ceo-mary-barra-on-general-motors-electric-vehicles-and-ev-future/", "score": 1, "replies": [{"body": "what happened to the EV1 mary?", "score": 1, "replies": []}]}]}
{"title": "Grandma Strikes Back? Intel Shares pop on report Qualcomm has approached it about takeover", "selftext": "", "id": "1flkrmk", "created_utc": 1726861566.0, "score": 1075, "upvote_ratio": 0.97, "num_comments": 95, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 11 | **Previous Best DD** | \n**Account Age** | 12 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Intel is a vital company to the United States. It will not be allowed to fail.", "score": 650, "replies": [{"body": "Grandma is too big to fail.", "score": 34, "replies": []}, {"body": "This.", "score": 101, "replies": [{"body": "This. This", "score": 39, "replies": []}, {"body": "That", "score": 18, "replies": [{"body": "Thas", "score": 7, "replies": [{"body": "Das?", "score": 8, "replies": [{"body": "Des", "score": 5, "replies": [{"body": "Deez", "score": 8, "replies": [{"body": "Dessen?", "score": 5, "replies": [{"body": "Was are du sinking about?", "score": 5, "replies": []}, {"body": "Dose", "score": 1, "replies": [{"body": "Doserrrrr", "score": 1, "replies": []}]}]}, {"body": "Bro, we were on our way to build the German articles... you broke the chain ![img](emote|t5_2th52|52627)", "score": 3, "replies": [{"body": "My bad don't know german", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Getting acquired is not falling, especially when QCOM is a US company. Bigger problem here is there's no point acquiring Intel when the x86 license is not transferrable, majority of the IP would be worthless without the license to make them.\n\nIf Intel's management wants the company to remain independent, they are going to leverage the x86 license like a carrot so Uncle Sam have no choice but to help Gelsinger with his brain dead fab plan that'll burn money they no longer even have in hopes they'll survive till it's profitable. US is better off suing both Intel and AMD on grounds that the x86 licensing condition violates antitrust and force them to open up slots to let other ₐₘₑᵣᵢ𝒸ₐₙ companies apply for license.", "score": 92, "replies": [{"body": "If they buy the whole of Intel, it's up to them whether the x86 licences are transferable or not, unlike when AMD just buys the licences.\n\n\nWhy do you say Intel's fabs are brain dead?\n\n\nBut I do support your idea of an antitrust suit. Fans of tech stocks tend not to like what you have to say though.", "score": 15, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "is the licensing/cross licensing agreement available for public reading? 🤔🤷‍♂️", "score": 4, "replies": []}, {"body": "Amd licenses x86 from intel, intel licenses x86-64 from amd", "score": 3, "replies": [{"body": "And not just amd64 instructions.  At one point (and possibly still) the processor interconnect tech patents and possibly other stuff were cross licensed from AMD to Intel.", "score": 1, "replies": []}]}]}, {"body": "if to many other companies are making them they can't guarantee back doors.", "score": 1, "replies": []}]}, {"body": "It's gonna crab around $20-$22 per share, way below grandson's cost basis for a very long time.", "score": 46, "replies": [{"body": "a few weeks ago, the majority sentiment was 15 or less.  🤷‍♂️", "score": 8, "replies": []}, {"body": "Nah $30 would be like the minimum that Intel would even consider it.", "score": -2, "replies": [{"body": "25", "score": 2, "replies": []}]}]}, {"body": "Shareholders will lose out if they bankrupt, but the government will prop them up", "score": 6, "replies": []}, {"body": "Yup that's what I tell myself when I look at my Boeing \"investment\"", "score": 10, "replies": []}, {"body": "\\*Looks at General Motors delisted from stock market THEN bought and revived by state, because it's \"too vital\"\\*\n\nyeah, so Intel will survive, but that might be still terrible for investors", "score": 3, "replies": []}, {"body": "But it will also not thrive, the US will treat it like a slave.", "score": 1, "replies": []}, {"body": "And so was Kodak.", "score": 1, "replies": []}, {"body": "Someone say Boeing?", "score": 0, "replies": []}, {"body": "https://preview.redd.it/5ki4sk9dj2qd1.png?width=1792&format=png&auto=webp&s=db99d0b69bd572ccd5dc9dff208eac7d7b08a7ab", "score": -6, "replies": []}]}, {"body": "Aaand its going back down", "score": 148, "replies": [{"body": "They \"popped\" to where they were on Tuesday.", "score": 34, "replies": [{"body": "Yeah. Look at the 3-month chart. This thing is a turd (and I'm allowed to say that, because I own a decent bit at $21).", "score": 13, "replies": [{"body": "Forget 3 months, look at ytd. It’s down more than 100%", "score": -12, "replies": [{"body": "It’s down 37%. Down over 100% and the share price would be negative.", "score": 18, "replies": [{"body": "And this isn’t even the dumbest thing I’ve seen on wsb", "score": 25, "replies": []}]}]}]}]}]}, {"body": "I’m with nana", "score": 59, "replies": [{"body": "I also choose this guy’s dead nana", "score": 14, "replies": []}, {"body": "Can someone send me a link to learn about the legend of Nana?", "score": 3, "replies": [{"body": "It’s on wsb look for nana in the last month or so, Aug 2 time frame. But basically some guy gets an inheritance and drops 90% of it into Intc and then it gets downgraded next day losing 10 per share on a 700k bet. This video sums it up well\n\nhttps://www.reddit.com/r/wallstreetbets/s/c972rcYbQF", "score": 3, "replies": []}]}]}, {"body": "Nana Strikes Back\n\nhttps://preview.redd.it/m2vrh4des0qd1.jpeg?width=1024&format=pjpg&auto=webp&s=bf020fbfe156b3a7557dce98383eb5934352e874", "score": 126, "replies": [{"body": "Gunmen are behind him and Grandma is scared. So puts right?", "score": 8, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Virgo: Latin for \"virgin\" or \"maiden\"", "score": 2, "replies": []}, {"body": "Happy birthday king!", "score": 0, "replies": []}]}, {"body": "We're buying? Missed the 17.80 a few days ago...", "score": 43, "replies": [{"body": "I'm thinking about just putting like 1k down and see how it goes. US Gov won't let intel fail and might force other us companies to use intel over tsmc. But I aint putting 700k into it", "score": 23, "replies": []}, {"body": "I locked in at $19.50. It's not going to $50 again any time soon, but I'd argue $25 is reasonable given their \"too big to fail\" status.", "score": 8, "replies": [{"body": "I think it will reach 25-30 as well.\nToo big to fail and renewed interest in the fabs.", "score": 7, "replies": []}]}, {"body": "Didn't buy shit. Got lucky", "score": 6, "replies": []}, {"body": "That be such a good buy, you'd double your money in 6 months.", "score": 2, "replies": []}]}, {"body": "one time machine ticket please", "score": 15, "replies": []}, {"body": "Someone repost nana for lub points", "score": 12, "replies": [{"body": "https://preview.redd.it/w79ffmv8l1qd1.jpeg?width=2160&format=pjpg&auto=webp&s=b3421b48e86fddb33c42aaa116d35880c4e0b745", "score": 46, "replies": []}]}, {"body": "Who would buy whom?", "score": 10, "replies": [{"body": "Intel grandma guy is now a majority stakeholder so it's up to him.", "score": 60, "replies": [{"body": "Dude needs to spend some of that money on a ouja board so Nana can give him some financial advice.", "score": 4, "replies": []}]}, {"body": "how can the FTC allow a buy from Qualcomm ? that doesn't make any sense ,, OP talking out the ss", "score": 3, "replies": []}]}, {"body": "Isn’t Qualcomm barely hanging on now? Dying companies buying each other the new rage?", "score": 13, "replies": [{"body": "QCOM is far from “barely hanging on”. I’m very bullish. PE is low because they’re a “mobile focused” company, which is currently true but they are (successfully imo) expanding into auto, IoT and most recently laptops and eventually more.", "score": 13, "replies": []}, {"body": "I don't think for a second QCOM is actually going to be able to buy INTC, but I am pretty sure they have been doing much better than INTC in the past few years.  Their market cap is nearly double that of INTC's right now.", "score": 8, "replies": [{"body": "qcom wants to break into the pc market to diversify its revenue and improve the growth.  \n\nintc isn't go to sell its cash cow design group.  there is no value in it for intc.  its a snake trying to eat an elephant; just isn't going to happen.  \n\nintc quarterly rev in its slump is still higher than qcom in its good quarter.  the same can be said for intc margin, high 30s to qcom's low 20 \n\nif the buyout offer is valid, i see at the minimum a 29/share offer, which i'm still doubtful the board will accept.", "score": 4, "replies": []}, {"body": "A share swap merger is sufficient. This effectively feeds Intel's fabs with QCOM's cash flow.", "score": 2, "replies": []}]}, {"body": "Helps ease bankruptcy court. Only one case instead of two.", "score": 8, "replies": [{"body": "QCOM and Intel's free cash flow combined is almost exactly 0, which means that the two can merge just in time to avoid bankruptcy.", "score": 1, "replies": []}]}, {"body": "This could be fake news …. Am sure TSM already looked at buying them, along with others, and dont want to touch it", "score": 1, "replies": []}]}, {"body": "Could be fake news???", "score": 3, "replies": [{"body": "It was flashed on our terminals around 315 yesterday and TMT Research teams held investor calls at 4pm on a Friday afternoon... they don't do that if the information isn't legit. MDs want to be gone by 4pm on a Friday", "score": 1, "replies": [{"body": "Seems like lots of hyping.\n\nNow, dont you think other, more financially stable companies already looked at Intel, and decided the offer to not be compelling of their time to pursue further?", "score": 1, "replies": []}]}]}, {"body": "I guarantee that whatever her grandson’s buy price was just before the big drop, the buyout offer will be exactly 1 penny less. Just watch, you’ll see.", "score": 3, "replies": []}, {"body": "For a brief moment I thought cnbc actually used this exact headline lol", "score": 3, "replies": []}, {"body": "Grandma’s just looking to take more people down", "score": 6, "replies": []}, {"body": "Nah, Nana would have Qualcomm as breakfast", "score": 2, "replies": []}, {"body": "Intel employees be like “oh thank god”", "score": 2, "replies": []}, {"body": "[25 dollars by monday](https://old.reddit.com/r/wallstreetbets/comments/1fhi4n9/intel_is_a_good_buy/lnuno1l/)", "score": 2, "replies": []}, {"body": "How shit to digress to a $90B mc in this massive chip break out.  But Imo the market is also unfair to them, it’s gotten the shit kicked out of it, i thought $30s would be a bottom.  \n\nThey still make good revenue ($55/year like double AMD) even if it’s declining. Costs went up and im not sure why they were spending so much past years so ni and fcf was negative. But there’s plenty of low growth industrial stocks the market will still pump it just hates Intel.", "score": 2, "replies": []}, {"body": "It’d be funny AF if Elon wanted to buy Intel, I can totally see this happening: \n1. Tesla is an American company and is not within the same sector as Intel so there is a better chance regulators will allow it.\n2. Financially Tesla can afford to buy Intel if they offer with shares. Their cap is 10x of Intel. Intel is very cheap now.\n3. Elon is an attention seeking whore. He bought fucking Twitter for $44B. If he could get the fab businesses, he’ll be at the center of American chips, especially if Taiwan supply is affected by China. He also has a desire to build out xAI and likes to yap about tech. Having one of the very few American chip maker is his backpocket is extreme leverage and suckers will look at him like he’s IRL Tony Stark which is exactly what he wants.", "score": 1, "replies": [{"body": "he could buy my shares @ 69 ![img](emote|t5_2th52|4258)", "score": 2, "replies": []}]}, {"body": "QCOM has that kind of money", "score": 1, "replies": []}, {"body": "Let’s go INTC!! Make Grandma proud and get that degen his inheritance back!", "score": 1, "replies": []}, {"body": "$2 dollars 🤣🤣", "score": 1, "replies": []}, {"body": "Clearly grandma is domin the devil ", "score": 1, "replies": []}, {"body": "Intel is too way behind in the game for this to be impactful. Ultimately, demand is dictated by market forces- What goes up must come down.", "score": 1, "replies": []}, {"body": "Nana is doing the forbidden dance in heaven. Shake dem hips girl", "score": 1, "replies": []}, {"body": "lowball offer  ![img](emote|t5_2th52|4259)", "score": 1, "replies": []}, {"body": "IMHO, this smells like classic market manipulation, just like Cramer described in this video below. If you're long and you need to pump your stock, you call up WSJ and tell them Intel might be bought up.  Suddenly you're in the money. \n\n[(1594) Jim Cramer explaining the basics of stock market manipulation #JimCramer #Manipulation #market - YouTube](https://www.youtube.com/watch?v=8DJlogbrDcA)\n\nThere were already rumors of Qualcomm expressing interest in Intel going back a ways. It was old news. I think someone wanted to use this rumor to move the stock price. Maybe they were loaded up on 9/20 calls.", "score": 1, "replies": [{"body": "now 'n days you just create a few new alt accounts on reddit, and post doubt when a stock moves suddenly against *your* position.", "score": 1, "replies": []}]}, {"body": "If wendys and intel had a baby it would be named bbby", "score": 1, "replies": []}, {"body": "Wasn’t a pop. Tiny little piece of lint fall is more like it.", "score": 1, "replies": []}]}
