{"title": "Long 150 AAL MAY 60 Calls $50k bet", "selftext": "http://gyazo.com/66af28c6f0693a9f4f7a3ca7e0fc1ef9\n\nthrowaway account. Anyone else long this name? Blowout earnings are expected, but industry P/Es are so low still.\n\nEdit1: Jeez. Got banned, showed proof to mods, now unbanned. I shoulda pointed out, this position was done over two days. 120 contracts on the 21st, then 30 contracts yesterday. Notice the screenshot shows profit? It's because position wasn't opened today. ", "id": "2tfysy", "created_utc": 1422046772.0, "score": 5, "upvote_ratio": 0.61, "num_comments": 16, "comments": [{"body": "I love the conviction but I personally think AAL is cooked... The stock should be priced for business trends improving so we'd need oil to stay depressed for a good period of time for these to run more.  Again, I could be wrong, I'm more so just saying I don't know how the story gets better from here.  Everyone knows their business is going to flourish in the coming years.", "score": 2, "replies": []}, {"body": "Was banned then unbanned after showing proof to mod. I dunno why people are so aggressive here. ", "score": 4, "replies": [{"body": "\\#YOLO", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "My options don't expire till May and I plan to keep at least half of them till near expiration. I say we jump on earnings, but not nearly as much as some people think. It'll be a modest 6% or so jump, then we climb steadily.\n\nAAL going to $75 IMO, which I think is conservative. If this goes mania, it'll hit $90-$100. I don't plan on trading out of my position right away regardless. This isn't a one week trade. \n\nMy only short term trade right now is long OCN 4k shares. Got extremely lucky to buy 2.5K @ 5.95~ today. Bought the other 1.5 closer to 7.5. Plan on selling next week (OCN jumped to $8 AH today, but not selling. Think it'll run to $10 next week when this news is digested). Day traded and lost $5k on it earlier, so going to get it back here.", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 4, "replies": []}]}]}, {"body": "Hells yes! I love these sort of bets on this sub.", "score": 1, "replies": []}, {"body": "AAL is probably going to be a sweet play next week.\n\nI'm going long on MSFT and AAL for the earnings.  Work fucked me today so I couldn't place my orders, I'll have to hope monday isn't volatility hell.", "score": 1, "replies": []}, {"body": "#YOLO!\nWhat prices did you get on your contracts?", "score": 1, "replies": [{"body": "60 calls @ 2.20, 60 calls @ 2.25 and 30 calls @ 3.30. 120 bought on jan 21 and the 30 bought jan 23", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I expect to sell half if it runs to say $65 or so. Then let the rest run. I typically bottomfish in my speculative bets, but all the stars seem to be aligning for American. Even if the good times from low oil don't last too long, 6-12 months of this will vastly improve their balance sheet.\n\nEarnings are expected to be superb for sure and most of it is probably priced in, unless we get blowout numbers. Seems like everyone is bullish though. Anyone NOT like AA at these prices?", "score": 1, "replies": []}]}, {"body": "Since this is verified to be real (I have some doubts), good luck! ", "score": 0, "replies": [{"body": "I've had much more reckelss yolos, I've been playing it safe lately with 90%+ of my portfolio. \n\nThanks! I have some time for the calls to play out too.", "score": 1, "replies": []}]}, {"body": "Delete this", "score": 0, "replies": []}]}
