{"title": "How to actually make decent profits off of natural occurrences with little to no risks.", "selftext": "TL;DR: Use Google Trends in order to know about events before the market picks up.\n\n-----\n\nBe resourceful. There's this tool called [Google Trends](https://www.google.com/trends/). With it, you can see the number of times something is searched on google.\n\nOne reliable way of being ahead of the market, is for you to use Google trends, and find the stories before they surface.\n\nLook at Mr. Matthew for example, the first news stories about it were in September 18th [Here](http://www.accuweather.com/en/weather-news/tropical-depression-12-karl-atlantic-caribbean/60111529) Maybe even before actually. \n\nHow could anyone have actually read some random obscure weather news website in the 18th for no reason whatsoever? No one is expected to do it, which is why ~~we~~ I use Google Trends.\n\nIf you search for \"Hurricane\" in trends, then limit your search to the US, and on a time-frame of just the 30 most recent days, you will realize that Google Trends picked up on Mr Matthew on the 29th, by increasing the \"Search Score\" for \"Hurricane\" from 2 to 6. The \"Normal\"/Default \"Search Score\" should be 2-4. Anything above that means that it's being picked up by the media, hence calling people's attention on Google.\n\nIf we look at a any Insurer, we can see that on the 28th their stock started to go down, then more on the 29th, then even more on the 30th, etc. If you had used google trends, seen the Search Score increasing from 2 to 6, then looked into it, you'd know that a storm being called \"One of the strongest hurricanes to possibly hit the US in years\" was possibly coming to the US.[Here](http://www.dailymail.co.uk/wires/ap/article-3815223/The-Latest-Hurricane-Matthew-grows-Category-2-storm.html), [Here](http://gazette.com/matthew-strengthens-into-category-5-hurricane-in-caribbean/article/feed/404326), etc. you can see many places calling it one of the possibly most devastating hurricanes in the last decade. \n\nIf you'd seen that there was a level 5 Hurricane coming to the US on the 28th, your profit would've been more than 20% On stocks (Assuming you shorted $UVE) , and MUCH more on options. Just by checking for \"Hurricane\" on Google Trends. \n\nIn case it had dispersed, you'd have lost close to nothing, since the market never priced it in on the 30th (Which is when the trend score went from 2 to 12). the 30th was also this company's highest point in quite a while, making it a somewhat-safe short even though it's kind of a gamble (As seen that the hurricane could take a completely different direction)\n\nTo add, you can do this with other countries as well, and with other subjects. EG: School Shooting, and keep the trend timescale on 4Hours. If you see a spike, buy SWHC, etc. Some fag on /r/algotrading can probably code something that warns you of this kind of things daily, and maybe even executes trades for you. Just don't forget, if you code something that does this, PM it to me. Thanks.\n----\n\nI won't lie, I never kept track of this, but I definitely will start checking on for \"Hurricane\", \"Earthquake\" and \"Natural Disaster\" from now on. A safe 20% position doesn't come by too often.\n\nGodspeed.", "id": "569juq", "created_utc": 1475812572.0, "score": 225, "upvote_ratio": 0.95, "num_comments": 71, "comments": [{"body": "This is actually informative and helpful. Today OP was not a faggot.", "score": 87, "replies": [{"body": "Thank you.\n\nGoogle Trends is actually quite ingenious now that I think of it.\n\nI can definitely use it to search for \"Yoga\" or \"Pilates\" and get a gym membership whenever it goes up, just for the booties. \n\nOn a more serious note, this might be a reliable way of knowing whether a company will do well on its earnings. Example: Look for \"Lululemon\", if there are a shit ton of searches, it probably means they had a shit ton of sales. \"Wallmart\", \"JCPenny\", etc. I'd think this wouldn't work for some sectors, like Natural Resources (Oil, Metals), Maybe Banking, Maybe not as well with Pharma, and it would definitely work best for places with physical or online stores, service/goods selling companies.\n\nMaybe see how often people search \"<Company> near me\", Which would mean that they are actually going to the place? This tool has a lot of unexplored potential. I'd have to simulate a portfolio, but it might just work.\n\nI will do some research, and report back in a couple of days.", "score": 40, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Obviously, it won't contribute to 100% of the movement, but it will definitely contribute a bit. \n\nThank you for the other two ones, I will look into them.", "score": 4, "replies": []}]}, {"body": "I did this and found out that I missed out on a huge 30% sale at Lululemon. </3 ", "score": 5, "replies": [{"body": "RIP You", "score": 5, "replies": [{"body": "tru", "score": 3, "replies": []}]}]}]}, {"body": "When one provides such informative and helpful information, others begs to know -- what is this non-faggot doing on our subreddit", "score": 3, "replies": []}]}, {"body": "Profiting off of school shootings to buy a yacht is like the perfect culmination of this sub.  The SS Columbine ", "score": 109, "replies": [{"body": "You got here after Orlando didn't you?", "score": 12, "replies": []}, {"body": "I prefer SS Orlando. More of a tropical vibe. ", "score": 7, "replies": [{"body": "HMS Pulse", "score": 8, "replies": []}]}, {"body": "I like it.", "score": 3, "replies": []}, {"body": "Only made enough to buy gun, next time I'll try harder.", "score": 1, "replies": []}]}, {"body": "A for effort OP but this is some bible codes sort of shit.\n\n\n\n", "score": 28, "replies": [{"body": "My conclusion is that this is possibly the safest way to make money. The information is there but there's a 2-day delay on the market. It's like knowing the future. Just throwing this out here for anyone wanting to make money by using the safest possible method. Also in case someone codes an algorithm to automate this, which would be absolutely awesome.", "score": 8, "replies": [{"body": "Except you have to know what to be looking for. \n\nYou are saying this works because a hurricane rolled up and insurance companies shit the bed.\n\nUsing google trends is a good idea, no doubt. My 2 cents is that I think you are over estimating how \"safe\" this analysis will make \nyour trades.\n\nBest of luck though.", "score": 23, "replies": [{"body": "Totally safe, MLB playoffs is trending YOLO Spalding Sports Equipment ($BRK/A). Now I just need $215,923.00 to buy one share...", "score": 6, "replies": [{"body": "Buy options.", "score": 2, "replies": []}]}, {"body": "I checked for the Hermine Hurricane (I think that's its name), and it would've worked then as well. Which is why I'm saying it's fairly safe.", "score": 4, "replies": [{"body": "I mean yeah if it would have worked twice it's probably safe.", "score": 9, "replies": [{"body": "Lmao, if you think it isn't safe, don't use it and miss out on gains everytime there's a natural disaster. You don't need to come to the comments and get all pissy. Move on.", "score": 0, "replies": [{"body": "I'm sincerely doubting you've bet on any natural disaster whatsoever, let alone more than one because I know pothead ideas when I see one.", "score": 5, "replies": [{"body": "I don't do weed, I'd rather not get dementia. This is data, while you're using some random shitty argument. Good job.", "score": -1, "replies": [{"body": "never underestimate the power of random shitty arguement, it distracts you as people are stealing your ideas.\n\nMore so, weed doesn't cause dementia, it treats dementia and alzheimers. That's data, AND science behind it, not a baba vaga prediction. Look it up with that wizardly gadget of yours.", "score": 5, "replies": [{"body": "Productivity at all time lows in every state that legalized it, which will cause a larger wage gap, and a higher unemployment rate, as well as companies pulling their assess off the least-productive states. Fatal Car accidents soaring in every state that legalized it. THC Impairs memory, and lowers cognitive skills. And obviously there are many more effects that are seen as negatives.\n\nI support legalizing it, but saying it doesn't cause problems is retarded. Also, the long-term issues that it causes definitely outweigh the 2-Hour high is gives you.", "score": 3, "replies": [{"body": "Many good points, and valid statistics, and I would never claim there are no side effects to Marijuana. There are side effects to most things we consume, and that which hasn't shown itself to be adverse in the immediate future, can turn out to be adverse in the long run. I don't know anything for sure. I grew up at a time when Pluto was a fully fledged planet, and now it's a dwarf planet. Everything is subject to change based on newest data.", "score": 3, "replies": [{"body": "what the fuck did I just read?", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "your right his dumbass response didn't lack sense but it's still a wtf comment. the gist of it is basically that facts change \"inserted shitty example of a fact that changed\" therefore  wouldn't adhere very strongly to what is currently considered established knowledge.", "score": 1, "replies": []}, {"body": "Hm. You said that no one in this thread is respecting me. But mods came here and respectfully told me that my Strategy has been tested by Financial Companies and it works just to an extent. Literally no one but 2 or 3 people aren't being \"Respectful\". \n\nI'm guessing you're a pothead who thinks Weed has no side effects?", "score": -1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Lol. The safest way to make money, is by betting on weather predictions. This is definetly WSB.", "score": 3, "replies": []}]}]}, {"body": "Pretty sure there are tons of almost hurricanes that had news stories and never happened", "score": 18, "replies": [{"body": "Yeah but news is what makes the insurance stock drop. Not the Hurricane itself. Obviously because Matthew wasn't near as devastating as the news was saying.", "score": 3, "replies": [{"body": "So you're saying short the news??", "score": 4, "replies": [{"body": "Or auto tune it", "score": 6, "replies": [{"body": "Sen Junkie Einstein 2016", "score": 1, "replies": []}]}]}]}, {"body": "Not really, or at least it wasn't picked up by Google Trends, which means this strategy would be unaffected. Just look at the long term graphs for Google Trends, the only spikes are on actual hurricanes, and it isn't instantly, it builds up to the spike. If you find a news story that is still building up, you literally know of the future when it comes to the market.", "score": 0, "replies": []}]}, {"body": "I'm not trying to be a dbag, but there is more to this short. I looked at this risk early because I owned $UVE, so this was on my radar. I sold at 23$. Not the best exit, but certainly better than bag holding. One issue is with $UVE's exposure, almost all Florida. That's the easy part. The difficult part is identifying their risk after reinsurance. Every insurance company that has a book value under 50B reinsure's risk for catastrophe. $UVE insures 110B in assets. Now about 30B is in risk territory due to Matthew. Then looking at reinsurance, they take an initial 5-35M$ in initial losses followed by 2.4B in coverage losses for a single event. So if 2.4B is exceeded, $UVE will take the hit on the books. $UVE has 300M in book value. Therefore, if the losses on the 30B in exposure exceed 2.7B, the company will be insolvent. Now if they do not exceed 2.4B, the company may be a good buy, albeit the 30m and expenses for claim processing(might be under insurance tho). So shorting this means substantial risk, if losses do not exceed 2.4B. Residential insurers in Louisiana lost 8B in Katrina aftermath. So it's possible, but not likely(imo) that $UVE alone will incur over 2.4B at current path. That would require almost 10% in damages on exposed residences. I think buying some puts early wouldn't be a bad idea, but that beta kicks up real quick. Shorting could be a really shitty idea though. BTW, $UVE's plans are substantially cheaper than competitors. That was a big red flag to me, if it helps.", "score": 9, "replies": [{"body": "Does it cover Volcano insurance?", "score": 4, "replies": []}, {"body": "I understand a part of what you're saying. I just don't get it where are you taking the 2.4B? Is it an estimate?", "score": 1, "replies": [{"body": "They purchase reinsurance from catastrophe insurers. So $UVE pays the reinsurance company x money to receive up to y dollars if losses from one event exceeding initial losses z. In this case, $UVE will take up to 35 million (the z) in losses from this hurricane, before reinsurance begins to cover losses. However, if the losses exceed 2.4 billion (the reinsurance coverage or y found in their financial statements), then $UVE will have to pay out those loses using their own funds or else enter bankruptcy. $UVE uses a fairly accepted risk model, 1 event exceeding reinsurance coverage every 100 years or so. If the risk model is accurate, than you have to ask yourself if the hurricane is the 1 in 100 that would exceed the company's preparations. The answer this time is a near certain no, which is why the price is back up. Now some short equity funds have been questioning whether $UVE's book and reinsurance can actually survive even a category 3 if it is a direct hit to Florida(South to North). This will be the question going forward.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Only WSB would buy insurance stocks right before a devastating hurricane hits. I love you guys", "score": 20, "replies": []}, {"body": "up 15% today. I salute you.", "score": 5, "replies": []}]}, {"body": "Why don't you tell us what you did again\n\n>One reliable way of being ahead of the market, is for you to use Google trends, and find the stories before they surface.\n\n>No one is expected to do it, which is why we I use Google Trends.\n\n> Just by checking for \"Hurricane\" on Google Trends.\n\n> but I definitely will start checking on for \"Hurricane\", \"Earthquake\" and \"Natural Disaster\" from now on.", "score": 8, "replies": [{"body": "what?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "hang out at /r/conspiracy to predict school shooting, terrorist attacks, earthquakes...etc \n\nbe a conspiracy faggots and swap your yacht for a bunker\n\n911 was a Zionist inside job", "score": 11, "replies": []}, {"body": "Google Trends just shows how much it's being searched. To see the news stories you search the same terms on google, change it to news, filter date to \"Last week\" or a custom range, then profit.", "score": 2, "replies": []}, {"body": "There is often a build up of smaller earthquakes to when the big one happens.  Not a great indicator, just as often it can be a minor releasing of pressure.  Just wanted to point out in case somebody stumbled upon information about it and thought they found something new.", "score": 2, "replies": []}]}, {"body": ">If you search for \"Hurricane\" in trends, then limit your search to the US, and on a time-frame of just the 30 most recent days, you will realize that Google Trends picked up on Mr Matthew on the 29th, by increasing the \"Search Score\" for \"Hurricane\" from 2 to 6. The \"Normal\"/Default \"Search Score\" should be 2-4. Anything above that means that it's being picked up by the media, hence calling people's attention on Google.\n\n>If we look at a any Insurer, we can see that on the 28th their stock started to go down, then more on the 29th, then even more on the 30th, etc. If you had used google trends, seen the Search Score increasing from 2 to 6, then looked into it, you'd know that a storm being called \"One of the strongest hurricanes to possibly hit the US in years\" was possibly coming to the US.Here, Here, etc. you can see many places calling it one of the possibly most devastating hurricanes in the last decade. \n\n28th -http://www.nhc.noaa.gov/archive/2016/al14/al142016.public.001.shtml?\n\n29th -http://www.nhc.noaa.gov/archive/2016/al14/al142016.public.007.shtml? (HURRICANE CONFIRMED)\n\nContinue at your leisure - http://www.nhc.noaa.gov/archive/2016/refresh/MATTHEW+shtml/150403.shtml? -- feel free to dig thru the archives, IBs have this in their algos and retrieve this data and begin pricing adjustments immediately. \n\nJust FYI if anyone takes this too seriously and starts trading using Google Trends. \n\nGoogle Trends is lagging indicator shows you a trend, like a stock, and you can jump on a trend like a stock. Best case use for natural predictable storms (hurricanes, blizzards, etc. not EQs) and Google Trends is a lagging indicator (shootings searches results + gun stocks) not leading. WSB, I personally, and many other companies in the past have tried to use this tool. It doesn't work most of the time due to it being a lagging indicator (instead of leading indicator) and gambling on MSM to pick it up (intentionally or they suck).  You need to find a leading indicator and for this case its NOAA. If storm deviates this NOAA will release it first, then local media picks it up, google trends, then MSM.  So its like this:\n\nNOAA --> Stock pricing --> Local Media Blogs etc --> Trends --> More stock movement --> MSM overhyping for ad revenue --> stock pricing based on supply & demand factors from buy (Bid ask size and spread). \n\nSo always use the primary source if you want the extra gain (or losses) during predictable storms. Google Trends is ok but you can miss out good movement if you follow this only. \n\nAlso here are other ways to money on Hurricanes: https://www.thestreet.com/story/13315759/1/buy-these-3-stocks-before-the-next-hurricane-hits.html\n\nPersonally In going in on Nat Gas & Oil cause this my hurricane chart: http://imgur.com/a/wC21d --should fuck them refineries in the gulf after It gains strength making the loop.\n\n----\n\nEDIT:\n\n#BONUS: http://imgur.com/a/69Kkn WARNING HIGH AUTISTIC SCENARIO. \n", "score": 5, "replies": [{"body": "I see, so Google Trends is a lagging indicator. But there still is potential for profits, it's still a somewhat acceptable tool. Considering that Google Trends picked this one up on September 30th, and the market went up from the day before, there was a possible 22.5% profit to be made from shorting it, I'd say that's pretty good for a lagging indicator, though I agree that the NOAA would be the best source, I wouldn't completely disregard Trends.", "score": -1, "replies": [{"body": "I didn't say I would completely disregard it, but you will miss out on some movement if you only use this. I would use this with other tools not just it by it self to maximize returns (losses).", "score": 1, "replies": [{"body": "Hah, I see. Thanks for the feedback. Always good to have someone knowledgeable chip in :)", "score": 1, "replies": []}]}]}]}, {"body": "Great post. This is why I come here.", "score": 5, "replies": []}, {"body": "Op - I used the Google Trends and the like 200th top trending thing was this:  \n\nhttp://wwlp.com/2016/10/06/mbta-poised-to-award-cash-management-contract-to-brinks/\n\nYOLO on BCO for an easy 10-15% technical breakout.\n\n", "score": 2, "replies": [{"body": "Right idea but that deal isn't big enough to move the needle on brinks. ", "score": 3, "replies": []}, {"body": "No clue what that is, or if it affects their stock in any way.", "score": 1, "replies": []}]}, {"body": "tl;dr media does an amazing job at sensationalizing and driving fear into consumers; ride media hype on current events.\n\nI agree wholeheartedly.", "score": 2, "replies": [{"body": "You nailed it.", "score": 2, "replies": []}]}, {"body": "Where are you seeing the \"search score\"?", "score": 1, "replies": [{"body": "On the graph that shows up.", "score": 0, "replies": []}]}, {"body": "Definitely going to use this on UA new product line when it's released. ", "score": 1, "replies": [{"body": "It might just work, but I don't think so. Since UA would probably release it in their website first, which is where the investors take their info from.", "score": 0, "replies": [{"body": "True, but I believe they have a different website for this line of clothes. Any difference?", "score": 1, "replies": []}]}]}, {"body": "Buy burial plots at your local cemeteries. It is a big market and you can pay monthly, and they usually command 500%+ in 10 years or so, after all the plots are bought up.", "score": 1, "replies": []}, {"body": "Would a school shooting cause a spike or a dip in gun stocks?", "score": 1, "replies": [{"body": "spike", "score": 1, "replies": []}]}, {"body": "... And here's how algos can go very, very wrong. Thank you, 13 year old kids in New Zealand. \n\nhttp://jalopnik.com/how-a-lorde-song-screwed-up-an-algorithm-and-screwed-ma-1577005926", "score": 1, "replies": [{"body": "lol. That's actually VERY funny. And also the tragic reason why I don't like algos.", "score": 2, "replies": []}]}, {"body": ">Anything above that means that it's being picked up by the media\n\nlet me get this straight. your idea of being first is after the news has been picked up by the media?", "score": 1, "replies": [{"body": "Yes, because it hasn't been picked up  by the mainstream media (CNN, Fox, Weather Channel, etc), it's just being picked up by indie media outlets that no one reads.", "score": 0, "replies": []}]}]}
