{"title": "What's the most retarded stock I can buy with $300", "selftext": "give me your most casino-like stock  \nrules :  \nno penny stock  \nno jnug,aapl,twtr,ay emm dee stock  \nwill post proof after, give me your worst  \nEDIT: I'll look through the most upvoted comments tomorrow and pick one, gonna buy on or around market open  \nEDIT : bought more AMD because /u/InsaneWhiteKid is just so convincing, fuck the rules https://puu.sh/rV9MJ/a26e125224.png", "id": "598k63", "created_utc": 1477360705.0, "score": 35, "upvote_ratio": 0.89, "num_comments": 72, "comments": [{"body": "You asked for a stock that has huge upside potential with very little downside risk, sound familiar Boelens? Well the reason for the post today is something just came across my desk, Boelens. It is perhaps the best thing I’ve seen in the last six months. The name of the company, Advanced Microsystems, Inc., it is a cutting edge high tech firm out of the West Coast. Now, right now, Boelens, the stock trades at seven dollars a share. And by the way, Boelens, our analyst indicate it could go a heck of a lot higher than that. Your profit, on a mere three hundered dollar investment would be upwards of thirty thousand dollars.", "score": 58, "replies": [{"body": "Took me a second to get past my autism and realise why this sounded familiar ", "score": 14, "replies": []}, {"body": "The only thing you'll regret is that you didn't buy more. ", "score": 11, "replies": [{"body": "Sound fair enough?", "score": 4, "replies": []}]}, {"body": "https://puu.sh/rV9MJ/a26e125224.png", "score": 4, "replies": []}, {"body": "already have 1k in AMD lul, got in at 5", "score": 1, "replies": []}, {"body": "haha oh my god", "score": 1, "replies": []}]}, {"body": "SUNEQ, the shits been up over 50 percent three times now within 2 weeks and everytime I kick myself in the ass for not owning a little even though I don't touch shit like that with a 10 foot pole.\nIt's technically a penny stock but it didn't used to be just went bankrupt. If all you got is $300 you might as well go YOLO.", "score": 17, "replies": [{"body": "Ever wanted to buy 10000 shares of something and not losing out of the kind of money that buys you a car?\n\nWith SUNEQ, you get to do both!", "score": 6, "replies": []}, {"body": "And robinhood doesn't allow to trade this.", "score": 2, "replies": [{"body": "Robinhood is nice as a second option but if this is your only platform you're nothing but an amateur.", "score": 1, "replies": []}]}, {"body": "not worth it, barely ever goes up or down more than a few cents, which, with $300, doesnt even earn me more than the tx fee ", "score": 2, "replies": [{"body": "Are you this dumb bro last time it was up just mere pennies it was up 70% do you actually understand what that means?!", "score": 2, "replies": [{"body": "shit son I didnt think of that, I reconsidered and put my life savings in", "score": 1, "replies": [{"body": "Good job make sure to bring me along on your Yacht when the time comes", "score": 1, "replies": []}]}]}]}]}, {"body": "You just said no penny stocks... ", "score": 23, "replies": [{"body": "eh, no garbage stocks. aslong as it's not a stock that is literally a penny or a few cents it's fine, must have some volume ", "score": 7, "replies": [{"body": "$WM", "score": 13, "replies": [{"body": "ayy", "score": 2, "replies": []}]}, {"body": "man, garbage is the future!", "score": 3, "replies": [{"body": "so you're saying i should buy Landfill futures?", "score": 1, "replies": []}]}, {"body": "$MJNA. consistently up all month. started at .04 around week 1, its sitting at .10-.11", "score": 1, "replies": []}]}]}, {"body": "$HALO. It's named after the video game which makes this stock super retarded. Stock is completely oversold right now with no negative news. Anything under 9.50 is a fucking steal. This will hit $12 again easily after ER Nov 7. Personally I would bag hold until pdufa for their drug pegph20.", "score": 15, "replies": []}, {"body": "VRX", "score": 7, "replies": []}, {"body": "BRK/A", "score": 6, "replies": []}, {"body": "BANC", "score": 4, "replies": []}, {"body": "Is mcafee's company still listed?\n\nIf not, BBW.", "score": 4, "replies": [{"body": ">mcafee\n\nYou can buy it OTC as MGTI", "score": 2, "replies": []}]}, {"body": "T", "score": 3, "replies": []}, {"body": "Here's one. Go on stocktwats find the first board with 100% bullish sentiment (fucking all of them) and buy it. You'll fit right in there. ", "score": 6, "replies": []}, {"body": "KEP - KOREA ELECTRIC POWER CORPORATION", "score": 2, "replies": []}, {"body": "CLMT", "score": 2, "replies": []}, {"body": "Volkswagen", "score": 3, "replies": []}, {"body": "Canopy growth", "score": 2, "replies": []}, {"body": "NPH on TSX.V, it's Canadian so that $300 is like $400 CAD & it's pretty close to an all time low @ $0.19", "score": 1, "replies": [{"body": "If it's at an all time low right now what's to say it doesn't sink into oblivion and the company goes bankrupt lol ", "score": 0, "replies": [{"body": "OP asked for a retarded stock. That's what he was provided.", "score": 9, "replies": [{"body": "Makes sense lol ", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "disagree with this as it isnt retarded", "score": 1, "replies": []}]}, {"body": "GPRO or ANF", "score": 1, "replies": []}, {"body": "CNSX:BE", "score": 1, "replies": []}, {"body": "Air france as it has PE of 2.5", "score": 1, "replies": []}, {"body": "General Electric", "score": 1, "replies": []}, {"body": "Tesla weekly puts at 197.5", "score": 1, "replies": []}, {"body": "JDST seems like a strong buy in my opinion. I wouldn't put it as full fledged retarded. Just following yearly trends.", "score": 1, "replies": []}, {"body": "$FOGO - because meat sweats", "score": 1, "replies": []}, {"body": "Options:\n\nShort URI, ANGI or buy BAC calls", "score": 1, "replies": []}, {"body": "Biib", "score": 1, "replies": []}, {"body": "Time the CWEI roller coaster", "score": 1, "replies": []}, {"body": "F", "score": 0, "replies": []}, {"body": "Thanks for narrowing it down to nothing", "score": -3, "replies": []}]}
