{"title": "[deleted by user]", "selftext": "[removed]", "id": "59jry6", "created_utc": 1477512667.0, "score": 173, "upvote_ratio": 0.97, "num_comments": 74, "comments": [{"body": "LOOKS LIKE MEAT'S BACK ON THE MENU BOYS", "score": 101, "replies": []}, {"body": "I've been telling you faggots. Do. Not. Bet. Against. Musk.\n\nHe's still underrated.", "score": 78, "replies": [{"body": "I know it'll dip tomorrow as there's some pullback, but I'm not even selling.\n\nTalk to me in 10 years when it is 10x the size, and one of the biggest companies in the world.", "score": 39, "replies": [{"body": "I'm selling all my TSLA tomorrow morning and buying the inevitable pullback dip. TSLA is going to be the next giant, I'm talking Rockefeller big. TSLA isn't a car company. It's an energy and tech company. TSLA made a one of the best cars every produced and made it electric to force other companies to make good electric cars, or risk losing market share.\n\nYou know what electric cars need? Batteries. You know what is the bottleneck for wind, solar and all renewable energy? Storage, aka batteries. Elon created electric cars to drive up the demand for batteries, batteries he's making. \n\nCars aren't even his goal, they are step one. ", "score": 56, "replies": [{"body": "Egg-freaking-zactly.\n\nTesla is an energy company. Taking over Detroit is just step one.", "score": 19, "replies": [{"body": "I've been waiting for some billionaire to come in and just level half of that condemned city and build the city of the future. It's a dying city, low growth, high rate of migration out of the urban areas, the jobs few jobs that remain are drying up. Detroit is going through what Milwaukee went through in the 70's.", "score": 12, "replies": [{"body": "Government regulations stop it.\n\nI have seem people seriously complain about gentrification whenever someone tries to make a part of Detroit less shitty.", "score": 3, "replies": []}, {"body": "Poor Milwaukee in the 70s. I had no idea.", "score": 1, "replies": [{"body": "I live in MKE, we saw somewhere around 60% of the manufacturing jobs lost in a single year in the early 70's.", "score": 3, "replies": []}]}, {"body": "All of that happened to Detroit in the 70's not 2007.", "score": 1, "replies": [{"body": "Who said anything about 2007?", "score": 2, "replies": []}]}, {"body": "How often do you go there? There's been a migration IN to the city in the past few years. Yeah, the loss of the big three manufacturing jobs took its toll but the place is really coming about. It's never going to be what it once was but the city itself is getting to a size that's sustainable for what Detroit is now. \n\nBeautiful city. ", "score": 1, "replies": []}]}]}, {"body": "It's up less than 4% right now, why so sure of a pullback? Not following too close, but when I saw the news on the beat, and good guidance I expected it to pop to $230+. ", "score": 6, "replies": [{"body": "> I expected it to pop to $230+.\n\nSo are a lot of people. Some of the Elon skeptics will see TSLA beating earnings and think, \"Okay they can be profitable\" and jump in morning tomorrow anticipating a run up, just like you.\n\n You're not probably not wrong, but before it runs up there will be a lot of people who bought in < $200 and will want to secure their profits. They are going to sell, causing a short dip. \n\nSo I'm predicting a brief gap up, some type of dip and then a continued run up. That, or to the moon. It'll be a gametime decision, but it's good to go in with some semblance of a plan.", "score": 8, "replies": []}, {"body": "Basically the assumption is that they pumped numbers and robbed peter to pay paul, and that they'll get slammed Q4.\n\nAlso still skepticism they'll hit Q4 manufacturing numbers.\n\nOn the other hand, apparently they're launching a new product on Friday now.", "score": 6, "replies": []}]}, {"body": "I'm buying dip tomorrow boyssss ", "score": 2, "replies": []}, {"body": "Why not just say 'fuck it' with the cars and focus on the batteries? It's where the hold their competitive advantage ", "score": 1, "replies": [{"body": "Car companies wouldn't push electric cars if they didn't have to. Electric cars could have been mass produced in the year 2000. The big car manufacturers don't want to spend extra money on RnD for electric. By making competitive electric cars it forces competitors to do the same or lose market share to Tesla.\n\nIf tesla never existed, the Chevy bolt, BMW's electric car, and the other ones that are in production wouldn't exist for at least another 10 years.", "score": 1, "replies": []}]}]}]}, {"body": "A buddy of mine bet against musk once...", "score": 16, "replies": [{"body": "RIP", "score": 11, "replies": []}]}, {"body": "Chanos disagrees. He always shits on that company.", "score": 3, "replies": [{"body": "I would too if I were neck deep in a short", "score": 3, "replies": [{"body": "Tru, but he's been right more than he's been wrong. And people buy that stock because they think they're helping build a Mars colony. ", "score": 2, "replies": []}]}]}, {"body": "You can't #fuskthemusk", "score": 5, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "He tried.", "score": 6, "replies": []}]}]}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "don't get too excited yet bud.  gains are fading and IV crush will make your butt hurt tomorrow", "score": 7, "replies": [{"body": "> IV crush\n\npls explain", "score": 0, "replies": [{"body": "the IV peaks before earnings. once the event takes place the IV contracts significantly and options lose extrinsic value.  ", "score": 2, "replies": [{"body": "what does IV mean ?", "score": 0, "replies": [{"body": "if you really care to know head over to investopedia and read the basics.  IV is in there", "score": 4, "replies": []}, {"body": "TastyTrade has a good video series explaining options. It's free on YouTube.", "score": 1, "replies": []}]}]}]}]}, {"body": "wow congrats!", "score": 4, "replies": []}, {"body": "I'll be your personal chef on your yacht. Tendies erry day.", "score": 2, "replies": []}, {"body": "That IV tho\n", "score": 1, "replies": [{"body": "Thankfully they're not 28th expiry, they're for next Friday. It won't be asssss bad, but yeah. ", "score": 1, "replies": []}]}, {"body": "I still don't understand the damn IV crush all I know is that it's evil. So evil it made me quit options for a while ", "score": 1, "replies": [{"body": "people pay more for options when an event is coming up. after the event, they pay less. boom.", "score": 1, "replies": []}, {"body": "you can sell options and benefit from the evil IV crush", "score": 1, "replies": []}]}, {"body": "You paid out the asshole for those options on what's possibly the worst and most expensive stock to buy near ITM options for. ", "score": 1, "replies": []}]}, {"body": "and i sold my 195 calls two weeks ago.  fml", "score": 11, "replies": [{"body": "you the dude that made a milli off cpxx? ", "score": 10, "replies": [{"body": "That he was. He's a legend around here, earned more money than 100 of us put together. ", "score": 10, "replies": [{"body": "Well, that's a given, one of almost anyone makes more money than 100 of us put together.", "score": 18, "replies": [{"body": "Anyone who doesn't lose money makes more than 100 of us put together", "score": 11, "replies": [{"body": "Nah, even one person who loses money makes more than 100 of us put together.", "score": 2, "replies": [{"body": "Exactly, when we are all negative, one negative is more positive than 100 negatives", "score": 1, "replies": []}, {"body": "100 people who lose money make more money than 100 of us put together.", "score": 1, "replies": []}]}]}]}, {"body": "[i played this on repeat for the duration of my sky yacht flight today](https://www.youtube.com/watch?v=O8Uhn-dU3Gg)\n\nbtw that flight sucked ass.  icing.  icing is a motherfucker.  i feared for my life for the first time ever, even with the built-in parachute.\n\n", "score": 5, "replies": [{"body": ".", "score": 2, "replies": [{"body": "I have an SR22, they are not designed to fly into known icing conditions.  I was flying IFR climbing to FL21 and I noticed ice build up on the windows.  I turned on the deicer, and radioed for conditions.  Everyone said it was better at FL15.  I didn't want to fly that low, but I started descending.  Dropping at a comfy 500fpm AND THE WINGS START BUFFETTING.  I pitched down at 1500fpm and the plane started rocking more *as I flew into a god damned cloud layer*.  Full IMC, had to radio for help because I had no clue of the terrain around me.  Luckily nothing was around and I came out into a nice warm updraft.  ^(It was my fault because I wasn't watching my expensive ass weather radar)\n\nSuch a nice plane but starting to think I should have bought a piper or something that doesn't have such a high stall speed\n", "score": 1, "replies": [{"body": ".", "score": 1, "replies": []}]}]}]}]}]}, {"body": "did that with netflix...", "score": 1, "replies": []}]}, {"body": "Elon really pulled that one out of his ass didn't he. ", "score": 24, "replies": [{"body": "I could kiss that ass right now", "score": 6, "replies": []}, {"body": "Where \"one\" is profitability, yes. He did.\n\nAt this point it's not rational to bet against Musk.", "score": 19, "replies": []}]}, {"body": "My score was wrong but as always, Tesla is the right team to pick.\n\nHoldin since $30. Leveraging til death. \n\nAlso good news for SCTY holders. Seems to be up the equivalent as of now.\n", "score": 19, "replies": [{"body": "> Also good news for SCTY holders. Seems to be up the equivalent as of now.\n\nAcquisition is assured now. Its a done deal.", "score": 11, "replies": [{"body": "SCTY was the easiest buy ever after the merger announcement.  Bought at $18 a few years ago, very luckily forced to sell at $67 per share when I had to pay for med school.  I've been dying to get back in since.  It would have crept back up on it's own from the recent lows, the deal just makes a profit certain.  I will mention though, SunEdison's situation has scared the shit out of me.", "score": 7, "replies": [{"body": "Except for the fact that SunEdison had some of the seediest management I've seen from a large compnay.", "score": 1, "replies": [{"body": "Haha, I totally agree.  Just the company evaporated so quickly.  Same shit happened to Rite Aid a 15 years ago.", "score": 2, "replies": [{"body": "They simply got out competed.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": ">[**Longest Yeah Boy Ever (Bombs Away Remix) [3:31]**](http://youtu.be/u2LLYbwaCfw)\n\n>>► You're now listening to : \n\n> [*^Trap ^Bomb*](https://www.youtube.com/channel/UCBCcKn-DMBkMU4vFfaxl4rg) ^in ^Music\n\n>*^27,577 ^views ^since ^Sep ^2016*\n\n[^bot ^info](http://www.reddit.com/r/youtubefactsbot/wiki/index)", "score": 2, "replies": []}]}, {"body": "YES MF I HELD ON", "score": 6, "replies": []}, {"body": "If you aren't already long you're too late. You're better off buying puts on the pop", "score": 5, "replies": []}, {"body": "Horrible low estimates by the street.", "score": 6, "replies": []}, {"body": "Second time being profitable actually they were once in 2013.", "score": 2, "replies": [{"body": "\"profitable\"", "score": 1, "replies": []}]}, {"body": "i would not bet on that, they did a lot of a rather questionable shit to get to that point, ", "score": 2, "replies": [{"body": ",\n\n?", "score": 3, "replies": []}, {"body": "Yep, their earnings release is a complete turd. They only managed to get cash flow positive by deferring capex (to next quarter) and selling all of their carbon credits. Q4 earnings will be terrible. But apparently people are really this stupid and are ready to accept anything from L'Elon. ", "score": 3, "replies": []}]}, {"body": "ITM calls on the pullback? What yall think", "score": 1, "replies": []}, {"body": "You guys better start buying, cause TSLA is selling off big time and now I'm in the hole.", "score": 1, "replies": []}, {"body": "FANG....should be TANG\ni'm going to jerk off so bad when the model 3's come out", "score": 1, "replies": []}]}
