{"title": "help beginner...smart to buy for just a year?", "selftext": "[deleted]", "id": "3ejmqy", "created_utc": 1437816064.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 10, "comments": [{"body": "If you are saving for a house DO NOT RISK it. Especially with that short a time horizon.", "score": 8, "replies": [{"body": "Ya it wouldn't be all my savings at all just a little on the side I figured even then it's not like theirs much chance I just lose most of it with safer stocks", "score": 1, "replies": [{"body": "You figured wrong. A novice investor with a short time horizon is at a large risk.", "score": 2, "replies": [{"body": "Can you explain? Maybe I just got lucky but like I said little over a year ago I bought stock in about 10 different companies and gained over 40% total and only had 2 that lost money (only about 10%). \nI know I could lose money but if it was a lot I would just not sell and have a little less for a down payment and if I made any money it would be more than it sitting in a bank account ", "score": 1, "replies": [{"body": "Either you need the money for a down payment on a house or you dont. You have to figure that out. If you need it, dont gamble it. If you dont need it, then set it aside for years and invest it.\n\nYes, your 40% return was just luck. Unless youre the next Warren Buffett.", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm using the stock market to help earn some money towards a house, but I'm not looking for big gains. My situation allows me to save up all my money for the next 2.5 years before I need to look.\n\nMost of my stocks are stable and pay decent dividends,  the downside is that I need about 8 months to pull my money back out of them without suffering any losses.\n\nI'm also not putting all my savings into stocks so I may not even need the money I'm putting in when the time comes.\n\nWith a 1 year window I wouldn't do it.", "score": 2, "replies": [{"body": "Ya I won't necessarily need it in a year it's not all my savings I just figured a little more in stocks and not sittings in savings could help. Even if I lose 20% or whatever it wouldn't break me while making 20% would be a nice help but ya I get what u guys are saying 1 year isn't very long. Thanks ", "score": 1, "replies": []}]}, {"body": "if Apple is so good to you, then why dont u just keep solely investing more into it? why risk it in another stock. ", "score": 2, "replies": [{"body": "I considered it I just meant buying more stock in general. Although with the 40% gain in just over a year I would be shocked if it happened again. But then again I no very little about stocks and like someone else said I probably should of checked the other subreddits ", "score": 1, "replies": []}]}, {"body": "I don't think this is the sub for you. Try /r/investing or /r/personalfinance ", "score": 2, "replies": []}]}
{"title": "Just throwing out a friendly chirp for all you 'AMD to the moon' jokers", "selftext": "I notice I'm not seeing too many of those posts anymore!  \n\nAMD is a dying animal... Chart not looking so nice... Hopefully you were able to correct your terrible sense of judgement and ditched this loser before it went below $2", "id": "3ek9fr", "created_utc": 1437835177.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 17, "comments": [{"body": "OK someone has to say it... In my opinion, Intel will not let AMD die. I bet Intel will let them win the POS market (aka eMachine), while Intel rules the high end (server market).  \n\nI think it's a safe bet to invest in AMD once they prove a little sign of life. It's a true yolo right now. \n\nThe company I work for is a pure Intel house because AMD can not compete.  We have looked in to them, but it's might and day for what we do. \n\nThat being said, if they go to $1.50 range they will be getting my cash. ", "score": 4, "replies": []}, {"body": "But what about AMDA?", "score": 3, "replies": [{"body": "Another Money Destroying Asset", "score": 8, "replies": [{"body": "Sure if you bought in at 70. Chasing trends will always leave you burned. Got to get in early.", "score": 2, "replies": [{"body": "Unless it's $ITEK lol. 2 day runner", "score": 1, "replies": []}]}]}, {"body": "...what about AMDA? Has anyone lost money on AMDA? I know I've squeezed a 100% gain out of it already, and am up 20% on my current position right now... How's your AMD? =)", "score": 1, "replies": []}]}, {"body": "AMD is the Greece of semiconductors. Interpret that how you like.", "score": 3, "replies": []}, {"body": "No space yacht for you.", "score": 2, "replies": [{"body": "Lol keep dumping your cash into AMD I'm sure you'll get your space yacht in no time", "score": 1, "replies": [{"body": "Jokes on you bro.", "score": 0, "replies": []}]}]}, {"body": "Zen is going to revolutionize the world", "score": 2, "replies": [{"body": "No... no it's not.\n\nAMD is devoid of any kind of MID CPU planning.\n\nSome might argue that AMD could fit in with Apple's acquisition of  P.A. Semi, Intrinsity, Passif, PrimeSense, Anobit and others, but the unfortunate reality is that x86 is in the process of becoming unentrenched and AMD's value is rapidly dwindling because of that.\n\nIt's pretty bad when even the Chinese realize that Micron is a better acquisition target.", "score": 2, "replies": []}]}, {"body": "They are joking most the time I think lol. Also you aren't confusing amda with amd right? ", "score": 1, "replies": [{"body": "No definitely taking AMD.. Real world example I just built a new computer and went Intel.. Just like most of the consumers out there.. Not basing this off of charts alone but also real world experience, no one buys AMD anything anymore", "score": -4, "replies": [{"body": "I do. And my 2ish year old computer can still handles current games on high settings, software (unity 5, Photoshop, etc), insane amounts of porn, and whatever else I throw at it (usually semen) with no problems.", "score": 2, "replies": [{"body": "I sometimes masturbate also.  ", "score": 3, "replies": []}]}]}]}, {"body": "...bu... but didn't you hear?\n\nApple is going to buy AMD at Microsoft's and Intel's behest.\n\nThe deal is going to go down for $5 a share.\n\n<as a side note, one of the fundamental ways that you can know that AMD is in trouble is when their share price suffers a hit when some completely unrelated foundry in China, Taiwan, Korea or Malaysia catches on fire> ", "score": -1, "replies": []}]}
{"title": "Amzn-ing options", "selftext": "", "id": "3el6f2", "created_utc": 1437852942.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 9, "comments": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I could have done the same thing for goog, appl, and nflx this quarter. Thinking about doing it for tsla next week. ", "score": 1, "replies": [{"body": "So what exactly are you doing here?  Just shorting premium?", "score": 1, "replies": [{"body": "Buying slightly itm calls and puts while hoping for a big enough move to get one to triple while the other goes to zero. Itm costs more but the return is bigger. When you buy otm, you have a greater time premium that you're paying for. ", "score": 2, "replies": [{"body": "This is brilliant--if nothing else, in it's simplicity.  How long have you been doing this?  Overall results?  \nEarnings are such a mother.  I've thought about waiting for the reaction, then going long on the contrarian move, i.e. AAPL call buying after the bloodbath, etc.", "score": 2, "replies": [{"body": "Well I first did it maybe 6 years ago with goog. And appl. I don't do it every quarter. I do not day trade. I back tested whether you should buy otm but it means less money up front but less profit as well. \n\nThe biggest thing is that both can lose value if the stock does not move as much as expected. I was worried with amzn this quarter because just otm calls were 20$ meaning I needed a 40$ movement to break even. If I could sell options after hours, I could have sold my call at 100 at least since amzn touched 585 after hours but opened lowered and fell from there. If I was in front of a screen all day, I would have bought out of the money puts by 10am and watched them triple in a matter of hours. ", "score": 2, "replies": [{"body": "\"watched them triple in a matter of hours.\"\n\nExactly.  The contrarian move seems to be a far better play; you have much more information.  Why don't more people do that?  Gambler's mentality?  ", "score": 1, "replies": [{"body": "Sure but it's a lot easier to swim downstream. ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Are these all straight long calls and puts?", "score": 2, "replies": [{"body": "Yes. ", "score": 2, "replies": []}]}]}
