{"title": "Partially invested, not sure where to go from here", "selftext": "Hey folks, I'm 28 and until recently, all the money I would earn would sit in my checking account, doing nothing. I figured I should invest in the stock market, so I opened a Scottrade account and deposited $10,000. \n\nI currently have half of it invested in Apple, Disney, Starbucks and SunPower, but I'm not sure what I should be looking at for the rest. I have been trying to diversify. The four companies I have already invested in seem to be somewhat safe bets. \n\nI guess what I'm asking is, if anyone has any advice to help steer me in the right direction, I'm all ears.", "id": "3cziqu", "created_utc": 1436677393.0, "score": 3, "upvote_ratio": 0.72, "num_comments": 13, "comments": [{"body": "You trying to establish a set and forget type portfolio, or plan to be hands on? That's key for knowing, but anyways some general answers to your question:\n\n1. Guess I'll be the only one to say it...Open a savings account. Checking accounts are for your day to day/emergency funds, not to hold your net worth. At least with savings acct you could have gained some interest all these years.\n\n2. Don't diversify too much, with $10,000 I personally would probably only do 5 stocks max. $1,250 a pop doesn't leave too much room for potential gains, dividends, or commission off-setting. If you said you only had $1,250 to invest I'd sing a different tune, but you don't, so no need to put close to the bare minimum on each investment. \n\n3. Have strong long-term winners be your main core (PG, Disney, etc so you're on the right track). And 10-20% tops be your speculative/short-term plays (assuming you at least want some hands-on trading with your portfolio). The 10-20% is up to personal risk interpretation, but main key is make your spec plays not destroy your portfolio should they blow up in your face.\n\n4. Throw some $$ into bank stocks. Even the safe stocks mentioned above will take a hit in coming months, but banks will just prosper more.\n\n5. Learn to keep some cash sitting on the sidelines, ready for deployment. There will always be discounts presented in the market, and you don't want to be missing out waiting on funds to transfer.  ", "score": 2, "replies": [{"body": "I want much of what I invest to be long term investments that I don't touch much after buying, but like you said, having a small portion to actively buy and sell short term with is also something I like the sound of. I will, of course, be adding money into my Scottrade account as I have the funds to do so, so I can continue to invest more.", "score": 1, "replies": []}]}, {"body": "I would suggest a mutual fund to be honest with you. If you plan on not touching the money, there are tons of excellent mutual funds out there that can cater to almost exactly what you're looking for. Plus, you can set it up so capital gains and dividends are immediately rolled back into your fund. Money works for you. \n\nIndex funds are also an excellent idea. XLF, XLK are two of my favorites. Although, personal preference will determine what you choose to get into. \n\nPersonally, I own shares in mutual fund BIGRX (although, it hasn't done the best recently, I'm still looking for new ones to get into all of the time) index funds like XLK (tech) and XLF (financials). Also, and this opinion might be bombarded for stupidity, but oil! Oil stocks are very cheap right now, and although the world is leaning towards clean renewable energy, oil will still hold ground for a while. I've been looking into LPI and APC (they seem like potential buy out targets).\n\nHope this helped a bit. Best of luck to you!", "score": 2, "replies": []}, {"body": "Unless youre willing to put in the countless hours of dedication, then Id recommend against individual stock picks.", "score": 1, "replies": [{"body": "Except if a couple more hours would result in thousands more dollars, in which case that would be the smart thing to do. ", "score": 1, "replies": [{"body": "Just a couple more hours would probably result in substanial loses. Most actively managed accounts cannot beat the SP500. That includes professionals. By actively managing your account, youre saying to yourself that you can choose stocks better than the people working on Wallstreet.\n\nI believe I can. Do you?", "score": 1, "replies": [{"body": "No I cannot. Still have a lot of learning to do.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Isn't there a saying about putting all of your eggs in one basket?", "score": 2, "replies": [{"body": "Index fund would be a good idea, but if you're dead set on individual stocks I'd check out PG, JNJ, or KO, but I'd really recommend the index fund. Vanguard is a good company. Any advice you get here is likely to be very speculative in nature. People really love to be on this board and that's why I come here, but I'm unwilling to do that with money. If you're investing for retirement I'd stress being careful and educating yourself. A good book is the Boglehead's guide to investment. Anything Warren Buffet has written or anything by Jack Bogle. Some psychological books that would probably help are Your Money or Your Life and The Millionaire Next Door. 7% per year is nothing to scoff at with low fees. If you really want to take a small gamble I'd just set aside  a small amount of money and pick stocks, a lot of people do that. It's a humbling exercise to see that you can't predict markets based on whatever analysis you've come up with. Good books for this include Security Analysis and anything Warren Buffet has written as well.", "score": 5, "replies": []}, {"body": "dont listen to that guy. disney has been a rockstar on my portfolio. go do a ton of research, this is money you worked hard for, go learn the best ways to grow it.", "score": 4, "replies": []}, {"body": "Don't listen to this guy, but \n\n\"Keep all your eggs in one basket, but watch that basket closely.\" - Warren Buffett", "score": 2, "replies": []}]}, {"body": "dont listen to this guy", "score": 2, "replies": []}]}]}
