{"title": "upside risks of the wheel?", "selftext": "Assuming that the choice of underlying is sound (i.e. the underlying doesn't keep dropping), seems that there's significant risk for the wheel to miss out on the upside?\n\nIf the underlying goes up in general, it almost certainly will experience sharp run ups during which:\n\nThe underlying can and will be called away in the 2nd phase, and the cash secured puts in the 1st phase aren't gonna help either.\n\nEven if the underlying trades sideways in general: \n\nAs long as it doesn't do so in a tightly bounded box (i.e. basically the puts need to be OTM), anyone in a wheel strategy would still be liable for holding the bag on any sharp drop (in both phases), and at the same time highly likely to miss any sharp rise (that pulls the underlying itself back to 'sideways')\n\nJust another proof of 'no free lunch' or I missed something important?", "id": "gf0lyh", "created_utc": 1588829486.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 14, "comments": [{"body": "No, you're right. One thing you can do is sell higher delta puts than the calls you sell, but that's still just a trade-off. No free lunch, as you say.", "score": 4, "replies": [{"body": "thanks! \n\nIf I understand correctly, higher delta puts means puts should be further OTM than calls? I see that certainly helps mitigating the risk of bag holding but doesn't seem to really help with the upside risk though?\n\nWas hoping I found out a free lunch theta gang way, but I guess thus is life :(", "score": 3, "replies": [{"body": "Higher delta is closer to the money or in the money.  You can sell those puts for more money than further otm puts.  If the stock goes up, you then make more money than if you’d sold a cheaper otm put.", "score": 3, "replies": [{"body": "thanks for the correction.\n\nI read up more and noticed that the 2nd phase is actually a covered-strangle: https://www.optionseducation.org/strategies/all-strategies/covered-strangle-covered-combination\n\nIt indeed seem like a hassle/annoyance to be assigned on either of them even with cover on both ends, maybe I should just 'play it safe' and always open with a big range (for a small premium, of course)?", "score": 2, "replies": [{"body": "In the wheel strategy, you sell a put.  If you get assigned, then you sell a call (but you no longer are short the put - you are long stock).  This creates a covered call.  If you get assigned on the call, you start selling puts again.  This is different than a covered strangle.  A covered strangle would give you twice the notional risk when compared to the wheel.  Ie, if the stock tanks, you lose on the short put and the long stock with a covered strangle. With the wheel you only lose on either a short put or long stock.", "score": 1, "replies": [{"body": "hmm, could you give a bit more detail?\n\nin the 2nd phase of the wheel, there's 1 short OTM put, 1 short OTM call, and 1 long underlying position right? how is this different from covered strangle?", "score": 1, "replies": [{"body": "There’s no short put in the second phase.  You reach the second phase by getting assigned on your short put.  That results in (only) a long stock position. Then you sell a call against the stock.", "score": 1, "replies": [{"body": "interesting that's different from what I read here: https://optionstradingiq.com/the-wheel-strategy/ where the 2nd phase has a short put position as well\n\nMaybe the 'wheel' is not defined the same by everyone.", "score": 1, "replies": [{"body": "I’ve never heard it described that way, but you can do that.  You’re kind of doubling down.  You increase your risk / position size when the stock drops and you sell the second put.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I meant the opposite: sell nearer ATM puts, and further OTM calls. Shifting some risk of assignment to the put side.", "score": 2, "replies": [{"body": "that makes sense, thanks for correcting me", "score": 1, "replies": []}]}]}]}, {"body": "That's why I like it as an add on to a long-term buy and hold strategy. If there's a big run up in the markets then my long equity positions will benefit. And either way I can still keep collecting premium from the wheel in my trading account.", "score": 1, "replies": [{"body": "have you considered merging that 'trading account' into your normal long holdings to enjoy the upsides and more time for all other important things in life?", "score": 1, "replies": [{"body": "Yes", "score": 1, "replies": []}]}]}]}
{"title": "AAL advice", "selftext": "So stupidly a few weeks ago I sold a put on AAL at a strike of 13 for a DTE 06/19. Since then BAM announced they have basically dropped all their airlines and airline stocks have been tanking.\n\nWhat do people think I do?\n\nHold out and hope the bulls come back in at some point? I have quite a long left on the DTE but my concern is a further drop is also possible.\n\nSell at a loss now?\n\nRoll out and down?\n\nAny advice much appreciated", "id": "gf5min", "created_utc": 1588854594.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 18, "comments": [{"body": "Sell calls above it?", "score": 2, "replies": [{"body": "Tempting but it's about to reach a new low inclusive of it's coronavirus hit. One good bit of news related to airlines and I feel it could pick up, or it could just pick up anyway as general supply and demand etc.", "score": 2, "replies": []}, {"body": "Or even below! Inverted strangles are a pretty powerful loss-reduction strategy.", "score": 2, "replies": []}]}, {"body": "I mean you have time. There is probably very low chance of new news being bad.\n\nBuffet sold\n\nER reported\n\nPeople know you can't fly\n\nBailout\n\nStill time for it to go up. Making your put worth something.", "score": 2, "replies": [{"body": "Thanks.", "score": 1, "replies": []}]}, {"body": "If you can roll for credit, do it. Otherwise, just take assignment - there isn't that much more to lose. We will reopen eventually, and with summer around the corner, people will start flying again.", "score": 2, "replies": []}, {"body": "Go inverted. Sell weekly calls close to atm. Your goal is to reduce your cost basis and collect as much premium as possible. If the stock goes between your strikes close the position and move on.", "score": 1, "replies": [{"body": "And if the stock rises ITM on the call side? Roll it or close it at a loss?", "score": 1, "replies": [{"body": "That’s what you want. You can keep the trade on if you think the stock price will stay between your strikes. Or you can close the trade.", "score": 1, "replies": []}]}]}, {"body": "It’s ONE put that you sold right?\n\nI’d not worry too much, the expiry is a little away, there’s chance that with the opening of the community and economy, people start flying more.", "score": 0, "replies": [{"body": "yes I sold it, so if it's expires I will own the shares. Which in the situation I don't particularly want anyway.\n\nAnd my concern is even if the economy opens, airlines likely won't or they may but not enough people will be flying.", "score": 1, "replies": [{"body": "If u dont want to risk it just look for an exit", "score": 3, "replies": []}, {"body": "I think it's clear the price of AAL and everything else is looking to the future, not the present. The PR/Trump speech once airlines resume normal operations will likely be enough to make it spike some.", "score": 2, "replies": [{"body": "Fair point, I guess the question is when, that could be 6 months or more...", "score": 1, "replies": [{"body": "That's a totally different gamble. Good luck predicting that part. FWIW, I have family in Europe and they are slowly opening things back up. Organized gatherings (clubs, schools, dance lessons, etc.) are becoming normal again. Just read the bundesliga is resuming play in May (don't know about spectators). All positive signs. Trump has been eager to resume as well. I can't see it lasting for another month.\n\nEdit: Bought AAL at $9.40 a few days ago because of this reasoning myself.", "score": 2, "replies": [{"body": "Sounds promising. Thanks for the advice", "score": 1, "replies": [{"body": "NP. Just don't pin it on me if it doesn't pan out. My trading history is along the lines of 3 steps forward, 2 steps back. to early to tell where this one will fall.", "score": 2, "replies": [{"body": "Ha fair enough. I think the general opinion though was to hold as time and theta is on my side. If it does go down further and get worse though I'll likely hedge it by selling a call and close it out at a loss.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}
{"title": "Whos playing Tesla today?", "selftext": "Looks like Elon is going to be on the Joe Rogan Experience at 12 est today. I see on r/wsb most people looking at puts. If i learned anything its inverse wsb lol. 830c 5/15", "id": "gf73rl", "created_utc": 1588860127.0, "score": 68, "upvote_ratio": 1.0, "num_comments": 15, "comments": [{"body": "My first instinct was buy puts. So calls would probably be better.", "score": 60, "replies": [{"body": "Why not both lol", "score": 2, "replies": []}]}, {"body": "Def buy calls, Tesla halted production in China and all anyone is talking about is the podcast.", "score": 17, "replies": []}, {"body": "Sideways gang wins", "score": 12, "replies": [{"body": "Fuck yea. Im going to hold and see whats in store for tomorrow but down 20% wasnt the look i thought i was going to get", "score": 4, "replies": []}]}, {"body": "Well shit. Who won? Not calls or puts lmao", "score": 7, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "I thought a calm elon would cause the stock to move in my favor. I was wrong lol", "score": 4, "replies": []}]}]}, {"body": "I bought an atm put, probably gunna regret it", "score": 11, "replies": [{"body": "I did the same thing, Already regret it", "score": 9, "replies": []}]}, {"body": "The correct question is who will Tesla be playing today", "score": 5, "replies": []}, {"body": "I have a feeling that he’s going to say something stupid- he’s gone insane tweeting, who knows what’ll happen here", "score": 3, "replies": []}, {"body": "I've got 65 shares in and I'm good for the long haul", "score": 2, "replies": [{"body": "Add 35 more and you can churn some premium by selling calls to us dumb asses", "score": 3, "replies": [{"body": "I just might, I'm just learning about covered puts. But that's in my retirement account and I'm nervous about messing with that account too crazy.", "score": 2, "replies": []}]}]}, {"body": "Buy high sell low", "score": 2, "replies": []}]}
{"title": "Stock watch list May 7, 2020", "selftext": "Good morning, here's the watch list\n\nGap Ups: ANGI, FSLY, FTNT, LVGO, MRNA, NET, PTON, PYPL, ROKU, TEVA, TWLO, VIAC, ZM\n\nGap Downs: SAVE\n\nSPY grinding along in between moving averages kind of riding the 20 daily moving average which is first short term support, next support at 50 DMA which is around the 272 level with room to move up to the 200 which is at 300.  Very good earnings plays recently, today there is some decent gaps, I will be concentrating on earnings plays, following price action. Good luck today", "id": "gf5uct", "created_utc": 1588855456.0, "score": 17, "upvote_ratio": 1.0, "num_comments": 13, "comments": [{"body": "That FTNT could be very good if it holds and runs above that 52week of 120. Breakout alert if that happens", "score": 5, "replies": [{"body": "Nice second move happening on this up now.", "score": 2, "replies": []}]}, {"body": "That SAVE gap down was a nice call gz on that .Best of luck!!", "score": 2, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}, {"body": "Curious; how does one discover the names likely to show these material gap ups at opening ahead of market close?  Simply interested in where / how to begin doing my own due diligence.  Thanks!", "score": 2, "replies": [{"body": "I scan pre market for stocks over $5 and create a watchlist then narrow it down using technical analysis", "score": 4, "replies": [{"body": "Thank you; very helpful!  My question is, what is the best way to determine a gap up ahead of the prior close (to take advantage of the gap up at open vs. continued momentum during the trading session)?  Thanks!", "score": 1, "replies": [{"body": "You can't.  The stock gaps because of after hours and pre market trading. You can look for earnings reports and movement but no one knows if the stock will gap up, down, or even at all due to the reaction from the reports being released.", "score": 4, "replies": [{"body": "Makes complete sense.  Thank you!", "score": 1, "replies": []}]}]}]}]}, {"body": "Is $SDC good buy now?", "score": 1, "replies": [{"body": "won't know til open and reaction in my opinion", "score": 1, "replies": []}]}, {"body": "I really want to sell my MRNA since I got into it at the 30s but since they are starting phase 2 of vaccines i wonder if itll go up more", "score": 1, "replies": []}, {"body": "ergh I should've dropped 10k into MRNA before close yesterday, there's no way it WASNT going to blow up after hours. Interested to watch where it goes on open.", "score": -1, "replies": []}]}
{"title": "What do people here think of TSLA stock ??", "selftext": "Should one keep it in ones portfolio ? Is it overpriced right now ?? Will it fall ??", "id": "gewi21", "created_utc": 1588812506.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 13, "comments": [{"body": "Too high in Musk's opinion", "score": 17, "replies": []}, {"body": "Too high imo", "score": 13, "replies": []}, {"body": "its too risky", "score": 6, "replies": []}, {"body": "It is a good stock for the long run but it’s clearly overpriced right now. People really haven’t learned from the first hype run.", "score": 7, "replies": []}, {"body": "High risk and high reward.  At the prices now, its more high risk.  Wait for it to drop down to $650 range before investing.", "score": 3, "replies": [{"body": "Thnx. \n \nactually I don’t live in US but have opened a brokerage account with webull just to invest in TSLA , when I was initially making the transfers the Prince was around 450 but it climbed by the time I was able to send all funds to the brokerage account.  Now waiting for the price to come back to 400 to 500 range.  Just waiting on the sidelines right now.", "score": 1, "replies": []}]}, {"body": "How big are your balls?", "score": 3, "replies": []}, {"body": "Meme stock", "score": 3, "replies": []}, {"body": "I'm up 150% so I just rebalanced my portfolio.", "score": 2, "replies": []}, {"body": "too low imo lol", "score": 3, "replies": []}, {"body": "If you're in QQQ, you're got some TESLA. Like it or not.", "score": 1, "replies": []}, {"body": "I'm holding long term. Short term is too high imo.", "score": 1, "replies": []}, {"body": "Just right", "score": 0, "replies": []}]}
{"title": "Overvalued Tesla Bubble", "selftext": "I think it’s safe to say most rational investors can agree that Tesla is way overvalued. What’s a fair market value? I mean it’s anyone’s guess but I think we can agree that it is a definitely overvalued. Despite even Elon Musk claiming price is too high it continues to rise everyday.  Fremont plant is set to partially reopen soon and Tesla just hit $100b market cap so i’m sure stock will continue rise even further. I want to hop on the train but i can’t justify the price. Any thoughts on Tesla?", "id": "gewv4v", "created_utc": 1588813815.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 10, "comments": [{"body": "$420", "score": 10, "replies": [{"body": "Nice", "score": 1, "replies": [{"body": "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/RepliesNice` at **7141 nices**\n\n**2.** `u/spiro29` at **6246 nices**\n\n**3.** `u/GreenAppleCZ` at **5081 nices**\n\n**...**\n\n**270154.** `u/kubiak69` at **1 nice**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)", "score": 1, "replies": []}]}, {"body": "Haha. Very specific.", "score": -1, "replies": [{"body": "His original idea was to go private at 420", "score": 1, "replies": []}]}]}, {"body": "Well Battery Day coming up, ride it while you can.", "score": 4, "replies": []}, {"body": "Factories are opening up and battery day. Still got more upside. It’ll stay there until market crashes", "score": 2, "replies": []}, {"body": "Elon on Joe Rogan Tomorrow!", "score": 2, "replies": []}, {"body": "That stock has daddy Elon's alpha energy... Literally cant match it", "score": 2, "replies": []}, {"body": "Looking for panic sellers to buy in", "score": 1, "replies": []}]}
{"title": "Isn’t it time to cash in the profit?", "selftext": "  If I bought a stock for $50 and say it’s currently $100 and is expected to hit $150 in 1 years time. I’ll be up $100.\n\nHowever, if I sold the current stock and re-bought when there is a correction (say stock falls to $75) due to the economic mess we are in, then I’ll be making ($50 + $75 = $125). \n\nSo if everyone knows the markets are going to crash then why aren’t more people selling and cashing in on their profits. Who the heck is buying stocks right now?", "id": "gf0wdv", "created_utc": 1588830900.0, "score": 0, "upvote_ratio": 0.13, "num_comments": 10, "comments": [{"body": "Lol wut. Nobody knows if it will crash or not.", "score": 8, "replies": []}, {"body": "Because people don't know if there is gonna be crash or not. If you are so certain you can short it", "score": 4, "replies": []}, {"body": "The majority of people and institutions are bullish or long, not everyone thinks the market is going to crash. I'm buying but I have a plan if there is a crash which won't happen in my opinion but i'm setting aside half of my $ to average down, ill only use it to average down and not up by the end of the year, BAC is my biggest holding ATM", "score": 2, "replies": []}, {"body": "\n>So if everyone knows the markets are going to crash then why aren’t more people selling and cashing in on their profits. Who the heck is buying stocks right now?\n\nUh? Have you looked at a 3 or 5 month chart of VTI?\n\nAlso, if everyone knew something and it was that easy, don't you think we'd all be millionaires? Of course converting securities to cash is safe in uncertain times, but a lot of strong companies are coming out of this even stronger. Would suck to sell out and not have another crash come. \n\nSorry dude but did you put any thought into this whatsoever", "score": 2, "replies": []}, {"body": "I sure as fuck did. Not everything. But a decent amount.", "score": 2, "replies": []}, {"body": "You realize that majority of transactions are done by computers and algorithms. That we the retail traders barely make an impact on the direction of the market in the big picture. But there are so many buying opportunities going on right now. The market isn’t black and white. It’s not hold sell or buy. It’s dynamic and changes by the ticker. Hard times for one company directly means good times for an other.", "score": 2, "replies": []}, {"body": "loads of people are buying stocks right now, there's a tonne which are still discounted and even the ones which aren't discounted are still good buys", "score": 1, "replies": []}, {"body": "To answer your question, a lot of people.", "score": 1, "replies": []}, {"body": "When to buy. When to sell. When to let a winner run. Great questions. Complicated. It is best to develop plans before buying, while remaining cognizant of the fluidity of the market.", "score": 1, "replies": []}, {"body": "preemptive F", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "gf2in8", "created_utc": 1588839215.0, "score": 27, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "Almost every tanker is oversold on RSI + they are at strong support levels.\nAaand they reported very good earnings.\nToday, it will break out from downtrend", "score": 17, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Holy fucking dividend", "score": 2, "replies": []}]}, {"body": "I heard of this obscure stock called \"NAT\" which is also into tankers - anybody heard of it? Seems worth checking out!   \n\n\n:)", "score": 6, "replies": []}, {"body": "Watch everything go up in flames again after open", "score": 5, "replies": [{"body": "My 5/15 EURN $10c are screwed.", "score": 3, "replies": []}, {"body": "Aaaand STNG just went negative, EURN gave back almost 70% with the rest undoubtedly soon to follow", "score": 1, "replies": [{"body": "And then back positive. Wondering what the huge sell off was for?", "score": 1, "replies": [{"body": "People thinking it’s going to drop and selling high, most likely. If you’re just hoping things could go green so you can recoup, that’d look like a good spot to do it", "score": 1, "replies": []}]}]}]}, {"body": "If EURN shoots up after earnings after DHT collapsed despite earnings I'm gonna be so salty as I put all my money on DHT lool.", "score": 3, "replies": []}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/stonkfeed] [Tanker rollercoaster - EURN up after earnings](https://www.reddit.com/r/StonkFeed/comments/gf4ihe/tanker_rollercoaster_eurn_up_after_earnings/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "score": 1, "replies": []}, {"body": "sold mine at 7% profit", "score": 1, "replies": []}]}
{"title": "Is the market currently in a bubble and about to burst??", "selftext": "So I’m generally new to the stock market and wanted to get other people’s opinions on a view that I had. With the pandemic stopping most business’ bringing in revenue, most of their Earnings this quarter have been below expected and I assume for the next quarter they will be even worse, that alongside the ever growing unemployment rate you would of thought that stock prices would be plummeting, yet due to investors believing we are through the worst of the pandemic they are bidding the prices up and in some cases even causing rally’s to break out, what I was thinking is that it’s all well and good investors backing the stock market and the government pumping money in to try and help the market stay up but surely that creates a kind of bubble, as the prices of stocks are still rising yet the companies earnings are not and a lot of them are even taking on huge chunks of debt to stay afloat, so surely as soon as smarter investors begin to calculate companies real intrinsic value through analysis such as working out their EPS (Earnings Per Share) and P/E ratio (Price To Earnings Ratio) amongst other forms of analysis they will begin to realise companies are overpriced and the bubble will burst bringing companies stock prices crashing down?", "id": "gf4wux", "created_utc": 1588851545.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 19, "comments": [{"body": "How, how do so many people recent to the market think they somehow figured out something the professionals who are in charge of billions upon billions of powerful people’s money have not already figured out weeks ago. They have the experience, the tools, the insider knowledge, connections to world class experts from any field, etc, etc..\n\nNever, ever, ever think you’ve outsmarted the market.. If you ever find yourself feeling that way, sit out. You make money by riding the coattails of people who are better at this then you, not by thinking you’re one step ahead of them, in fact that’s how you lose money.\n\nThis may get downvoted by self-indulged keyboard warriors who are down money despite a month long historic rally, however heed this warning - the market is smarter than you. Play the trends, risk only what you’re willing to lose, and never try to predict a trend reversal, over time it’s a losing game.", "score": 19, "replies": [{"body": "Lol guy.   If 2008 taught us anything it's that everyone is f****** winging it.", "score": 6, "replies": []}, {"body": "The market is in a huge bubble but when it pops nobody knows and even if it does pop the fed will patch it and blow it back up bigger which is what is currently happening. The question becomes at what point are the feds same old tools going to stop working, cause once that happens we’re left with a burst bubble on top of the damage they’ve already cause the last 11 years. \n\nBut like I said they’ve been blowing a bubble for the last decade can they keep blowing for another decade, maybe. The stock market is basically a government tool at this point the fed has control 100% if they lose that control then stand the F by.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I just realized this hahah", "score": 3, "replies": []}]}, {"body": "I only have a handful of brain cells and an IQ of about 55 but I think the expected decrease in Q1 to Q3 earnings are priced in at this point. I could see SPY trading between 250 to 300 for the next year without a real crash like half of reddit is expecting. But who knows.", "score": 1, "replies": [{"body": "Lol you mean the CEOs who have no idea what earnings are, no viable analyst estimates yet somehow its priced in. Priced in is a bullshit concept that makes people stop thinking critically about the value of a stock.", "score": 2, "replies": []}, {"body": "If that’s so I don’t understand how with massively lower expected earnings the stock prices are stilly rallying to new highs", "score": 1, "replies": [{"body": "Cheap debt, expected growth, and fed backing of corporate bonds all help push P/E ratios higher. I do think the current 285-295 SPY is trading towards the upper limit of where we “should be” (subjective of course). The market is obviously expecting these earnings to come roaring back. If they don’t, then it’s anyone’s guess.", "score": 1, "replies": []}]}, {"body": "The issue is whether the expectations that are priced in are wrong. (They are.)", "score": 1, "replies": [{"body": "So you would speculate a crash in the future?", "score": 1, "replies": [{"body": "No, because I don’t know when it will happen and the prices of the puts id want aren’t great. I just anticipate it.", "score": 1, "replies": []}, {"body": "We already had a crash. What just happened in March was nothing negligible and was a great buying opportunity. If you’re trying to wait until the next crash to invest, you’re going to miss out. It could be a while.", "score": 1, "replies": [{"body": "The heir to Warren who manages 100% of Mungers money (Li Lu) all agree on Ted Williams, highest batting avg all time. Wait for the perfect pitch before swinging, in the stock market there is no such thing as a strike if you dont invest. So why not wait for a good pitch. Risk/reward ratio sucks right now.", "score": 2, "replies": [{"body": "Maybe now it’s not great, but what about a month ago? That was a great buying opportunity. If someone didn’t buy then, what would make them buy during the next crash?", "score": 1, "replies": [{"body": "Seth klarman and warren buffett werent buying at those levels in 2019 before the economy went to shit.", "score": 1, "replies": [{"body": "So what would SPY need to be at in order for you to say that it is a good time to buy?", "score": 1, "replies": []}]}]}]}, {"body": "RemindMe! 6 months", "score": 1, "replies": [{"body": "I will be messaging you in 6 months on [**2020-11-07 12:28:11 UTC**](http://www.wolframalpha.com/input/?i=2020-11-07%2012:28:11%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/gf4wux/is_the_market_currently_in_a_bubble_and_about_to/fprhshe/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fgf4wux%2Fis_the_market_currently_in_a_bubble_and_about_to%2Ffprhshe%2F%5D%0A%0ARemindMe%21%202020-11-07%2012%3A28%3A11%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20gf4wux)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Alot of money is flipping over into the hands of more stable companies that are still built for growth. That's why I don't think we'll see an overall drastic decline. There will be many bankruptcies but the overall market will keep pumping untill a big player shows signs of failure.", "score": 1, "replies": []}]}
{"title": "Considering selling NVDA", "selftext": "I have been holding onto NVDA on the principle that despite of the high multiples, GPUs have plenty of runway left and NVidia has a type of a monopoly on this (competition has been discussed several times on this sub).\n\nHowever, it looks like their revenues are more or less flat since 2018. What do you guys think about their long-term revenue growth prospects?", "id": "gf75fd", "created_utc": 1588860280.0, "score": 7, "upvote_ratio": 0.78, "num_comments": 12, "comments": [{"body": "NVDA is in on data processing, owning data centers, developing AI etc. \n\nGreat outlook for the future imo", "score": 10, "replies": []}, {"body": "I've been holding since it was 11. I can't sell now as I'll owe too much on taxes.", "score": 4, "replies": [{"body": "F", "score": 2, "replies": []}]}, {"body": "I have no opinion or position one way or the other, but I will note that this is a sector subject to very sudden demand spikes.  There are a lot of traditional sectors that still have catching up to do on the automation / AI / ML front.  Heck, I live a short bike ride from some of the most influential minds on the planet in AI and our government has only recently started talking openly about our expertise in this area.", "score": 2, "replies": []}, {"body": "I thought Nvidia only had a monopoly on overpriced cards? Like Intel.", "score": 2, "replies": []}, {"body": "NVDA has no real competition  in the GPU market. AMD makes GPUs but they can't seem to catch up to the NVDA performance. People are trying to make parellels between NVDA and INTC  vs AMD but NVDA is in another class of their own. They've been innovating this entire time and will remain a market leader in this segment for a long time", "score": 2, "replies": []}, {"body": "Thanks for the comments. Playing my own devil's advocate, I have been thinking that I could stomach a 50% drawdown on the stock, which would bring the multiples (P/E, EBIT/TEV) to a more \"normal\" 25-30. Given historical volatility, -50% is definitely a possibility and I would probably buy more at that point, unless something fundamentally changed. So I don't know if it's fair to say it's \"expensive\" at this point and so I probably won't sell.\n\nI appreciate the insight on the sector demand moving in spikes, revenues did almost double from 2016 to 2018.\n\nAs for cards being overpriced, maybe, but people who work on this stuff have told me there aren't any very good alternatives (unless you're a company that has the resources to make their own SoCs and can invest in the SW stack). In my line of work, we don't use GPUs but we use FPGAs and it's interesting how there are really only two companies that make FPGA chips and tools (Altera, which is now Intel and Xilinx). If FPGAs could experience similar scale demand as GPUs, I would definitely invest in Xilinx, but I think GPUs and FPGAs are night and day when it comes to ease of use, SW readiness etc.", "score": 1, "replies": []}, {"body": "I have similar thoughts as you. Also game streaming is becoming a thing at least in countries with good infrastructure. I think there is still good room for growth for the next 5 years though. Their consumer products are great and they can sell them for a good price.", "score": 1, "replies": []}, {"body": "Semiconductors are cyclical stocks. If you look at the price history you'll see them going up and down. Right NVDA is at the top of the cycle and extremely overpriced. \n\nExpecting 50% drop is very reasonable, though it could be even bigger at the bottom.\n\nI'd sell while you're ahead and then buy back in a year or so.", "score": 1, "replies": []}, {"body": "They ran off the runway in 2018 with lower than expected sales and poor guidance, not to mention late 2018 hosted a big tech sell-off. However, they have a huge future ahead of them. They make the best GPUs in the game. They are expanding into making datacenter hardware that can use AI to optimize computing, and using the GPU concept. They will be pivotal in mass-producing self-driving cars because their components will be the best in utilizing low-latency 5G. They are cyclical, so trimming and building positions isn’t a terrible idea, but they are at an inflection point IMO where they can make great strides in lots of different fast-growing fields.", "score": 1, "replies": []}, {"body": "Well they are near ATH. Also considering AMD is gaining market share, might be a good idea.", "score": 1, "replies": []}]}
{"title": "How often do you actually exercise a long term option?", "selftext": "I know most people sell contracts or let it expire.\n\nHowever,\n\nLet's say I wanted to exercise a contract for 100 shares of MSFT or RTX.\n\nand prices are good right now. \n\n&#x200B;\n\nOk, I want to purchase 100 shares of MSFT at their current price (around 180) a year from now, whatever price that would be.\n\nSounds like a good deal to me? Unless the premium is just ridiculously high.\n\n&#x200B;\n\nWhat am I missing here? I am a novice.", "id": "gfa488", "created_utc": 1588869893.0, "score": 7, "upvote_ratio": 0.69, "num_comments": 16, "comments": [{"body": "I have a few times, but didn't plan to in advance.  If I planned to in advance I would just buy the shares.  But I have purchased a few OTM calls that have performed quite well and become in the money by a fair margin.  When that happens, the extrinsic value in the contract approaches zero, so I've set aside cash to exercise at expiration taking on the shares. I've done this for stocks that I'm bullish on long term to delay the tax implications of the gains.", "score": 5, "replies": [{"body": "What are the tax implications of selling highly profitable long term options.  I'm up 150% on some Jan 2022 calls on gold mining stocks.  What can I expect?", "score": 1, "replies": [{"body": "any realized gains from any positions held for less than a year in any non-retirement account (IRA, 401k) are taxed as income.", "score": 1, "replies": [{"body": "I can hold them over a year.  Are they considered capital gains tax?  Because I read somewhere else that options are special.", "score": 1, "replies": []}]}]}]}, {"body": "you're betting against the time value at that point.  buying a year of time value isnt cheap.", "score": 7, "replies": []}, {"body": "Buy a $180 call for whatever date you want", "score": 2, "replies": []}, {"body": "Not that this answers your question. But I had a 320 call for TSLA on 1/17/2020 I sold on 10/24/19 after Q3 earnings jump. I made great profits but one can only imagine what I would’ve made if I kept it. The key thing is to remember options can be so extreme day in and out.", "score": 1, "replies": []}, {"body": "If your option still has a lot of time left, that time has some value.  Sell the option and buy the stock seperately.  The value of the option probably never falls below the difference between the option price and the stock price.", "score": 1, "replies": []}, {"body": "I think it depends on risk tolerance, I can just say for me personally, I think this is actually the worse time to do options, unless you're truly going for high risk, only because of how unstable the market is right now, constantly fluctuating up and down. \n\nThe only time I'd go into options is if I truly believe confidently it will swing one way, so for instance if I knew back in February, corona would come and hit the US as hard, and it would be the perfect time to buy puts seeing an almost definite stocks in like tourism would plummet, or if it was back in the mid 2010s, knowing how many tech stocks were on the rise. Granted I only got into investing mid/late 2010s, so didn't fully understand options back then, and it was probably for good reason. Long-term contracts are also generally much more expensive, making the risk even higher than already mentioned.", "score": 1, "replies": []}, {"body": "Depends on the broker. \n\nBut generally you'd be better off just selling the option if it's in the money instead of trying to actually execute it early", "score": 1, "replies": [{"body": "Mmm I'm looking to simply accumulate shares.\n\nI thought this would be a good idea to buy share at the current price in the future?", "score": -1, "replies": [{"body": "I mean, if you want to get shares at the current price... just buy the shares now and hold them...", "score": 12, "replies": [{"body": "This. If you buy a call option at $180 for next year and at expiration it’s at $175 you just pissed away whatever you paid for it when if you would have just bought them at $180 you’d be down $5 a share. \n\nNow if you bought the call option assuming the price goes to $200 by next year and it’s sitting at $225 at expire then you would want to sell the option bc you would have made some nice returns. \n\nYou can use [Options Profit Calculator](optionsprofitcalculator.com) to calculate the profit or loss at different prices of the stock at different times.", "score": 1, "replies": []}]}, {"body": "If you want to try to buy the shares anyway, sell puts.  I'm not suggesting naked puts, so this is assuming you have enough cash to buy the shares when they get assigned.\n\nIf the put is ITM, you'll get assigned, but if the stock had gone a lot lower, you'll be at a loss, but still better than buying the shares today (because of the premium you got paid).  If the put is OTM (stock went up), you keep the premium, now rinse and repeat.  But of course you wouldn't have made as much as buying the shares outright, especially if the stock went up a lot.\n\nIf there's significant movement in the stock, you could also just buy back the puts (it'll cost you less than the premium you got paid) and sell more puts for a later expiration at a higher price.", "score": 2, "replies": []}]}]}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/stonkfeed] [How often do you actually exercise a long term option?](https://www.reddit.com/r/StonkFeed/comments/gfcx2m/how_often_do_you_actually_exercise_a_long_term/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "score": 0, "replies": []}, {"body": "You got $2,700 to trade with someone? That is the premium you need to pay.", "score": 0, "replies": []}]}
{"title": "Now a Good Time to Sell Paypal?", "selftext": "What do you guys think? A huge surge in the stock today. Hard to imagine it'll keep surging after today though. Especially since I have the cheaper Square stock too, it might be a good idea to walk away with the profit, but I'm not sure what their future in the near-term looks like, based on the momentary good news...", "id": "gfbje2", "created_utc": 1588874110.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 18, "comments": [{"body": "They're good for the future, but I sold today. Buying back in once it corrects a little.", "score": 3, "replies": [{"body": "Yeah, that's what I'm thinking. Or maybe I should sell Square right now, given that it probably has the more uncertain and complicated future...", "score": 1, "replies": []}, {"body": "What price point are you looking to repurchase at?", "score": 1, "replies": [{"body": "135, but now I'm not sure we'll hit it.", "score": 1, "replies": [{"body": "Why not? Tomorrow's guaranteed to be a red day, no?", "score": 1, "replies": [{"body": "That's what I'm thinking, but the companies that have had good ERs have held up much better this cycle. I'm just going to set the limit buy and forget about it.", "score": 1, "replies": [{"body": "Yeah, I'm just thinking of surges to decent stocks like Tesla. It doesn't necessarily mean the next day is going to be red, and I can't imagine that it's going to dramatically plunge based on the recent news.", "score": 1, "replies": [{"body": "Setting a good limit order is much less to worry about too.", "score": 1, "replies": []}, {"body": "Just an update. I'm going to DCA. 25% at 143, 25% at 140, 50% at 135.", "score": 1, "replies": [{"body": "Looks like I made a mistake by holding on. Square and PayPal are hurting my return today...", "score": 1, "replies": [{"body": "Dude, don't worry about that. There's always a short drop after large gains from people taking profits. They're both good companies, especially PYPL, so they'll grow more long term.", "score": 1, "replies": [{"body": "Oh, I know that. They're great long-term investments, but I was only talking short-term.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Paypal is synonymous with E-commerce. If you believe E-commerce grows, then Paypal grows.", "score": 1, "replies": [{"body": "Oh, it's definitely a great stock long-term. I was thinking of selling it and buying it back at a lower price. Should'e made that clearer in the OP. I'm just not sure if it's going to steeply drop soon.", "score": 1, "replies": []}]}, {"body": "i've always sold tech only to see it keep climbing, and struggle to find an entry point again. I'm holding paypal and all my other tech plays 5-10 years minimum from now on. just my opinion.", "score": 1, "replies": [{"body": "Yeah, that's what had me hesitating too. Ultimately, I didn't end up selling it. Fingers crossed for tomorrow to not be a plunging red day.", "score": 1, "replies": []}]}, {"body": "Sell right before Q2 results and avoid a 30% drop", "score": 1, "replies": []}, {"body": "Basically guaranteed a few red days in the future to kick it down.", "score": 0, "replies": []}]}
{"title": "WHY $FLIR ISNT ON EVERYBODY’s watch list right now", "selftext": "1- FLIR is the global leader in thermal cameras \n\n2- It is gathering some massive coverage as it landed big contracts with GM, Amazon and many more to implement technologies to rapidly spot fever, major symptom of COVID.\n3- Big fast growing market. Could help boost market cap by at least 20% by end year. Already widely used in Asian countries. \n4- Might become the new norms for industries and retail short term. \n5- Steady cash flow with lots of ground breaking new technologies used by the US army. \n\nSo all in all very bright future ahead for this business. Short term, should recover to pre-covid level fast and lots of room to grow in the next 3 quarters. \n\nI know, its already up 17% in 24h but it really is booming right now and its only the start. \n\nDisclaimer : Im long into $FLIR", "id": "gfcf9s", "created_utc": 1588876854.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 13, "comments": [{"body": "Good call. I rode 1000sh from $30 to $40 and sold. It’s hitting a pretty serious long term average so might wanna watch it.", "score": 2, "replies": []}, {"body": "Had this on my watch list since March. Disappointed I didn't have a closer eye on it\n\nFigure it's too late now for me", "score": 2, "replies": []}, {"body": "They do have a solid competitor in Hikvision but it is a surveillance company owned by the state council of china and I highly doubt that they will be successful in the Western Hemisphere", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Mind giving some examples ?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah but you got some names publicly traded? Cause as far as my research went FLIR is the global leader.", "score": 1, "replies": [{"body": "no. FLIR is the only one thats publicly traded as far as i know. i know the product we're using isnt.", "score": 1, "replies": []}]}]}]}]}, {"body": "FLIR has been my biggest gainer, up 63% since I bought in at $29.80 a month ago......I think im' going to stay in through Q2 and then bounce", "score": 1, "replies": [{"body": "Solid play buddy, I got in a little later but still making some juicy gains 💪 \n\nCheers", "score": 1, "replies": []}]}, {"body": "Did someone say mvis?", "score": 1, "replies": []}, {"body": "Hey its a small cap business with lots of potential. Even a 20 millions contract will have a good impact on stock price as you can see thursday when the news broke that they won a contract with the US army for hornets drone", "score": 1, "replies": []}, {"body": "FLIR isn’t really a covid play.  1) Fevers occur in only 40% of infected people.  2) Ppl can be covid positive and asymptomatic. 3) Cameras have trouble reading temperatures accurately when >6 inches away (temp of the room, etc. - lots of factors that create inaccuracies).\n\nSource - I spoke to a FLIR distributor and they were upfront about the limitations.\n\nGM and Amazon are playing the same game as the TSA - they don’t have covid testing, so they are providing the illusion of protecting their workers.  They aren’t spending big on this and it won’t last.", "score": 0, "replies": [{"body": "Take a look at their earnings. The focus is all on those thermal systems. Huge demands. Might not be 100% effective but you can be sure they are gonna sold out every damn unit they can produce.", "score": 1, "replies": [{"body": "Their high end “elevated body temperature” camera system costs between 10-20k depending on the selected features.  10 Amazons buying 200 each doesn’t move the needle on revenue or earnings.\n\nI agree it’s a good story - I just don’t happen to think it will move earnings.  The stock on the other hand could still continue to work.  Either way, good luck!", "score": 1, "replies": []}]}]}]}
{"title": "AMD", "selftext": "[removed]", "id": "gfd5vo", "created_utc": 1588879149.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 11, "comments": [{"body": "First, you need to decide what your goals are. AMD is a long term play and if you believe in a company enough to invest in it, then you don’t sell because it drops 1%. If you want to day trade stocks you should look at r/pennystocks or r/options. There is a big difference in investing and trading. You need to decide where you want to be.", "score": 3, "replies": [{"body": "[removed]", "score": -6, "replies": [{"body": "Definitely check out the two subs I mentioned above. What you are trying to do is more in line with gambling than investing. Keep in mind the vast majority (something like 90%) lose money doing this.", "score": 1, "replies": []}]}]}, {"body": "Don't worry it happens to all of us when we buy into anything.", "score": 3, "replies": []}, {"body": "Do some research before you start investing", "score": 2, "replies": []}, {"body": "I would get out at break even and invest in something else if you want to swing trade. $AMD is seen as a long term investment and it hasn't moved much in the past month.", "score": 1, "replies": []}, {"body": "It’s not a loss till you sell", "score": 1, "replies": []}, {"body": "How the hell do you just invest blindly? Do some research.. You could’ve easily answered your own questions by doing a simple google search and watching videos on the market..", "score": 1, "replies": []}, {"body": "Yeah you didn't buy AMD for $22 a couple of days ago.", "score": 1, "replies": []}, {"body": "If you're trying to swing trade do yourself a favor and sell your AMD shares and use that money to buy some swing trading and technical analysis books. Jumping in and getting your feet wet is not the way to learn. You can paper trade on ThinkorSwim and learn that way. No sense in using actual capital.", "score": 1, "replies": []}]}
{"title": "Boeing?", "selftext": "Ever since their disaster with the Boeing 737 max, they've been down, would it be wise to invest in Boeing now, assuming they will recover? Because Boeing seems like they will eventually recover...", "id": "gfgxt7", "created_utc": 1588891256.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 18, "comments": [{"body": "I just bought a large stake in Boeing. Very confident they will come back. In fact this is almost good for them as it gives them time to refocus their efforts on fixing their planes while not having to worry about any breaking down cause none are in use", "score": 5, "replies": []}, {"body": "Look into UBS group. A Swiss bank who eventually did recover but the stock never did and likely won’t for 50 years to come. Just because Boeing the company recovers, does not necessarily mean the stock price will....", "score": 8, "replies": [{"body": "With all this Boeing talk it wouldn't surprise me the stock recovers faster than the actual company", "score": 7, "replies": [{"body": "Possibly, but what about 2 years from now or 4 years from now? There are companies whose stock price percentage decline is similar to Boeing’s and yet have good earnings and a much better business outlook. So why go for Boeing when there are so many other opportunities out there with lower risks attached and similar potential profitability from a recovery?", "score": 2, "replies": [{"body": "Which companies are you referring to that have had similar losses but a much better business outlook?", "score": 2, "replies": [{"body": "One of the many stocks I decided to buy up in the recent crash was Devon Energy. Good earnings, and enough liquidity to ride this panic out. You want to look for companies that have enough liquidity to ride this out. These are generally seen as less risky long term but there are more factors to consider. There are a lot more potential stock picks though if you take the time to look around. I think Boeing can be traded, but I question the long term outlook of the stock price if their debt is going to continually increase throughout 2020 and 2021, on top of that they will have to be making regular payments to the holders of those bonds they’ve been issuing if they want to keep them on board and not ending defaulting on those very bonds that were meant to save them in the first place. If you think this is panic, just wait till Boeing are unable to keep up with those bond payments which is almost inevitability.", "score": 1, "replies": []}]}]}]}]}, {"body": "Who knows , it will either go up or down", "score": 2, "replies": [{"body": "I mean it could go sideways", "score": 1, "replies": [{"body": "What does going sideways mean?", "score": 1, "replies": [{"body": "Ya know just bouncing between 120 and 140 for years like it was before it was pumped to oblivion by the government", "score": 3, "replies": []}]}]}]}, {"body": "The problem is BOEing wasn’t going up for a long time. It wasn’t until they started share buybacks in 2016 did it start getting love. \n\nI have no doubt Boeing will survive but will the price go back to where it was ? I’m not so sure. Especially without the MAX or buy backs.", "score": 2, "replies": []}, {"body": "I thought they hit rock bottom at 141 and look where we are now", "score": 1, "replies": []}, {"body": "$121 yesterday was a good chance", "score": 1, "replies": []}, {"body": "They should recover cause it's really just them and airbus making planes. Boeing canceled their deal to buy part of 3rd place Embraer. There are lot of other companies for cruiselines, airlines, banks, cars, but who else are you really going to buy a plane from?", "score": 1, "replies": []}, {"body": "I decided on Raytheon (RTX) as my defense/offense aerospace company stock. I like their specialty in missiles/radars/missiles launching platforms/ electronics etc... After the merger they've got plenty of commercial too with Pratt and Whitney + Rockwell.\n\nI believe they also currently hold the bid for a high value land based long range nuclear capable missile contact from the US airforce. Missiles/space/ anti missile/drones will be if not already are the future of warfare in my opinion. Currently claims 4% of my portfolio.\n\nI'm staying away from Boeing & Lockheed altogether.", "score": 1, "replies": []}, {"body": "Word of caution (I learned this only recently). With a government bailout, they may reset and restart their stock to BA 2.0. Which means all existing investors will lose everything.\n\nLook at GM. Very possible.", "score": 2, "replies": [{"body": "BA just raised $25 billion in bond sale because they did not want a bailout.", "score": 2, "replies": [{"body": "Yes but that’s the same thing essentially as a government bailout. The only difference is to who they owe money to now on top of who they owed previously. It actually doesn’t change much.....", "score": 1, "replies": []}]}]}]}
{"title": "Tesla said to be gearing up to restart Fremont car manufacturing, in possible shelter-in-place violation", "selftext": "", "id": "geww0o", "created_utc": 1588813911.0, "score": 3, "upvote_ratio": 0.55, "num_comments": 15, "comments": [{"body": "Its likely their safety team that needs to input the policies and procedures for staff in returning safely. Companies can still plan and strategize during the shelter in place order.", "score": 25, "replies": []}, {"body": "Phase 2 opening wud commence next week. A plant needs to gear up for production if it needs to reopen. It is not a corner shop where you can open the shutter and you are good to go. \nThe are also preping it for covid ( mentioned in another news article) \nimo, the headline is deceptive...", "score": 12, "replies": [{"body": "> imo, the headline is deceptive...\n\nNot deceptive, completely incorrect. The editorialized headline reflects the opposite of what's written in the article.\n\n> The person said that only a handful of employees have returned to the factory floor for now to prepare, and that additional safety measures have been put in place at the factory to guard against coronavirus transmission.\n\nSo the factory is prepping for reopening and implementing safety measures.\n\n> A spokeswoman for the Fremont Police Department, which is responsible for the area that includes the plant, said there were no plans to visit the site when informed by The Chronicle of reports of the partial return to work.\n\nLocal authorities don't see any issue.\n\n> “We’re all sort of in a little bit of a gray area,” said department spokeswoman Geneva Bosques, referring to Gov. Gavin Newsom’s announcement this week that some retail, manufacturing, and logistics businesses would soon be allowed to operate on a limited basis if they take safety measures and local authorities approve.\n\n> Bosques acknowledged that under the current Alameda County health order, Tesla cannot operate its manufacturing line but added that “having a small team of people in there (who) are social distancing may not violate the health order.”\n\nSo local authorities confirm Tesla's actions as following guidelines.\n\n> Tesla was not cited for violations, Bosques said.\n\nIn other words, a non-story.\n\nHot take: textbook example of yellow journalism of reporting an anonymous tip, only to be disappointed when alerted authorities respond that no scandal occurred. SF Chronical decided to run with story anyway with fabricated headline to generate clicks.", "score": 13, "replies": []}]}, {"body": "Green tomorrow", "score": 6, "replies": []}, {"body": "Seems like a poor headline.  Why assume that it is against the state orders when we know CA is loosening restriction on “manufacturing”.   It’s not like companies don’t talk and it’s not like Tesla isn’t one of the highest, if not the highest, profile company in CA, especially after his comments.   \n\nIt doesn’t seem like coincidence that Musk goes off and then a couple days later the Gov comes out saying it will be loosened.", "score": 6, "replies": [{"body": "The conflict is that it's been announced that the governor's orders will not prevent counties from having stricter orders, and Alameda county's current order is in effect until the end of May.", "score": -1, "replies": [{"body": "Except they make exceptions for certain bus types. One being manufacturing.", "score": 1, "replies": [{"body": "The county doesn't make an exemption for automotive manufacturing", "score": 1, "replies": []}]}]}]}, {"body": "Paywall site sorry so don’t have more detail to share. If anyone has access would be great to get a synopsis.", "score": 1, "replies": [{"body": "Without paywall. Add a period after the .com https://www.sfchronicle.com./business/article/Tesla-gearing-up-to-restart-Fremont-car-15251763.php", "score": 4, "replies": [{"body": "Wow that just renders a subscription worthless,  great programming sf.", "score": 3, "replies": []}, {"body": "Neat trick, thanks!", "score": 1, "replies": []}, {"body": "Good posters post with period in place", "score": -4, "replies": [{"body": "You say that when OP didn't even know about the trick. Should I hold you to standards of things of which you aren't aware?", "score": 3, "replies": []}]}]}]}, {"body": "I hope they're allowed to open-like yesterday. I hope they implement good mitigation procedures. But I really, really hope Tesla kisses the People's Republic of Kalifornia goodbye forever, and soon.", "score": 1, "replies": []}]}
{"title": "Elon discussing Robotaxis - analysis of items people missed from Tesla's Q1 2020 earnings call", "selftext": "", "id": "gf9lbp", "created_utc": 1588868284.0, "score": 15, "upvote_ratio": 0.9, "num_comments": 12, "comments": [{"body": "I think its helpful to hear Elon's exact words - rather than written summaries.  I believe a lot of important items were overshadowed in the earnings call.  This is a clip of Elon's exact words on robotaxis, followed by my analysis.  Hopefully it's helpful.  Thanks.", "score": 8, "replies": []}, {"body": "[deleted]", "score": -7, "replies": [{"body": "[deleted]", "score": 2, "replies": []}, {"body": ">Blackberry still may be a market leader again!\n\nNo, it won't.\n\nThe \"anything can happen so nothing like this statement matters\" argument is, and has always been bullshit.\n\nThe model 3 is the even more affordable car, the model S is the affordable car.  Note the over 1 million sales total so far - it's affordable to plenty even if not to you, and his other statements about them highlighted the prices and goals, all of which were hit and for sale.\n\nAre you new here? You seem to not know much about Tesla's history to be criticizing completed tasks as if they are not delivered.  Either that or intentionally misrepresenting (robotaxis comment, since it's not accurate, the quote was 1m cars capable of being robotaxis, pending regulatory approval)?", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Yah I never understood why people thought the model 3 was cheap. It’s actually pretty expensive... at least here in Canada. For a small sized sedan it’s like $65k CAD BASE.", "score": 4, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Removed for ad-hominem. Discuss without insults.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Sigh. You're exhausting. The car is affordable, relative to the sports car. That is the S. More affordable than that- that is the 3. \n\nThere's no point in arguing with someone who ignores facts.", "score": 1, "replies": []}]}]}, {"body": "> TIL that there are people who actually think a $40k car is an “even more affordable car” and that a $90k car, the “affordable car”.\n\nWhen compared to the price of the roadster, which is the context of the quote, yeah.\n\nYou are new to Tesla and don't know context.  Stop, learn, then come back and chat.\n\nMy \"lame spin\" was a direct quote.  Go learn. Come back. Try again.", "score": 1, "replies": [{"body": "I do find it amusing when people claim “context” when the wording is very clear\n\nAs I said to the other person whose comment was removed, and oddly coincidently almost exactly like what you just said:\n\nThe actual wording is very clear, the next step after the sports car is:  \"Use that money to build an affordable car\".    That is an absolute term, not relative to the pricing of the sports car.  The step after that is: \"Use *that* money to build an even more affordable car\".   That is a relative term - relative to the \"affordable car\",  not the Roadster.\n\nThe context of the quote, the entire plan and the entire reason for Tesla to exist was that they were bringing EV to the masses, mass market appeal, changing transportation - e.g. an affordable car.  Not a car that is just less expensive than the first Roadster.\n\nedit:  My \"lame spin\" was a direct quote\n\nAs I said, Less than a month ago, he said robotaxi functionally still looking good to be ready this year. To be functionally ready, it would need the software. The software is not coming in 2020. Whether you created that lame spin or are just parroting someone else's lame spin doesn't matter.  in fact, it is probably worse that you are perpetuating the spin rather than looking at what was said since then.", "score": 1, "replies": [{"body": "\"Elon Musk July 20, 2016\nThe first master plan that I wrote 10 years ago is now in the final stages of completion.\"\n\nYour opinions on settled matters are not relevant.  You don't know what you are talking about, and that's fine.  You lack context because you weren't here and don't care to learn the history of the company.\n\nYour posts are downvoted to oblivion over and over because of that.  You are like a college freshman arguing philosophy.  Bad arguments that miss the point.  The silly semantics arguments you make help the downvote total happen.\n\nIt doesn't matter if 40k is not even more affordable to you, its 25% the price of the roadster - that's even more affordable - and it's clearly been affordable to ~400k people.  Go ask for a raise?", "score": 1, "replies": [{"body": "Nice quote!  From the same guy who said around the same time that there will be a coast to coast FSD trip by the end of 2017.  \n\nStill unclear how long that “final stage of completion” for FSD is either”. Lol. \n\nSomeone claiming a plan is in a “final stage of completion” is not a “settled matter” that it has happened.  \n\nAs far as learning the history of the company, the msrp of the roadster was 109k, so which car has Tesla produced with a msrp of 25% of that?", "score": 1, "replies": []}]}]}]}, {"body": "Out of curiosity I had to look up Ferraris - they cost roughly a quarter million dollars (or 6x Model 3).\n\nhttps://www.motor1.com/features/345015/how-much-is-a-ferrari/\n\nI think everyone on this sub (including me) is happy to look past missed timeframes, and is happy that Elon is upending the auto industry.", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Good call! Tesla should make used cars, like Ferrari does!\n\nHow did they not think of this already? Paging u/ElonMusk /s", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "Tesla Insurance Will NOT Make Billions (here's why) Financial Analysis and Projections", "selftext": "", "id": "gfap2t", "created_utc": 1588871617.0, "score": 6, "upvote_ratio": 0.61, "num_comments": 13, "comments": [{"body": "So many of these same type of channels popping up using Tesla stock video and voice overlays. Feels repetitive", "score": 14, "replies": [{"body": "Sorry, Tesla has always been on of my top interests and I try to make my videos different from the rest. A lot of these 'stock' channels simply spew out what everyone else is saying. I'm an accountant so I try to put a different perspective on things.", "score": 2, "replies": []}]}, {"body": "- You seem to assume that Steven Mark Ryan speaks for many of us. I think that most of us are aware that (as you say the primary reason for Tesla insurance is to make it more attractive to own Tesla vehicles (whether the insurance is through Tesla or through competitors who are pressured to lower their premiums). Tesla Insurance doesn't have to make a huge amount of money as a stand-alone business to benefit Tesla as a whole (and its customers).\n\n- The cricket noises in the video imply nothing from Tesla on insurance, yet you note that Tesla insurance must be approved on a state by state basis. Tesla does indeed occasionally mention that they are pursuing regulatory approval in states other than California, and occasionally they give a target date for some particular state. \n\n- Not convinced that working with an existing insurance company (at least to start out) is necessarily a bad thing. You point out the need for expertise in the field and the challenge in ramping up such expertise.\n\n- I don't regard the bugs in quotes during the first 24 hours of operation as a threat to long-term success of Tesla insurance.\n\n- So if FSD isn't fully operational yet, then that part of the coverage is for later. In the meantime, improved performance of autopilot should give Tesla an increasing advantage on insurance.", "score": 7, "replies": []}, {"body": "I was an insurance agent for 10 years so I will give you my perspective. The biggest benefit from owning your own insurance company is the float, especially for a company like Tesla who wants to innovate and invest that money. You might not believe it, most car insurers actually run at underwriting losses all the time (paying out more money in claims and fixed cost than premium collected). During the 10 years I was in the industry, I think I’ve only seen underwriting profitability maybe 3 quarters lol. The best part about it is if they have a bad year in terms of underwriting loss, they can just raise rates next year. It’s basically interest free loan that keeps getting carried forward. \n\nImagine I borrow $100 from you today and promise to pay you back $100 in six month. Unfortunately after six months I have lost $5 and only have $95. No worries, this time I will just borrow $105 from you and pay back $100. As a lender you know you are being screwed, but as a insurance customer you don’t know and have no choice to pay. It’s the second best business - just after banking! If a customer asks you why the rates are going up... so many reasons: inflation, cost of labor up, cost of parts up, more accidents, you name it. \n\nHaving that much money coming in upfront lets you invest and this is also why Warren Buffet likes insurance companies. For Tesla and Elon in the short term, having this war chest can be a great lifeline during crisis and expansion.\n\nI think Tesla insurance will be very profitable 5-10 years from now when there are 5x or 10x more Tesla’s on the road, because that will drive down all the costs associated with insurance: staffing, underwriting, cost of repair (economies of scales on parts and increased service center/approved shops).", "score": 8, "replies": []}, {"body": "This is so off base. I’m an insurance guy and have studied this closely. \n\nTesla is NOT starting an insurance company in any way shape or form at the moment. They’re an MGA. State National Insurance is taking on all of the risk and liability.  \n\nAn MGA is a managing general agent. An MGA is responsible for distribution, policy management, and the claim process. They have zero financial liability in this other than the costs to get this all off the ground. \n\nThe reason Tesla started an insurance company is because carriers couldn’t insure them at a reasonable rate due to 1) high cost and availability of replacement parts. and 2) rental car reimbursement costs are higher for Tesla owners / accidents. I truly believe they started this not for the financial interest, but for the convenience of owners and the hassle of finding a reasonably priced policy. \n\nTo explain - replacement parts on Tesla’s are notoriously expensive and only available through Tesla. Since Tesla is able to provide the parts, they’re not paying the marked up costs. They also know that the policyholder isn’t going to go anywhere other than a Tesla service station to get the work done as well. \n\nRental car reimbursement is high because Tesla has always had a shortage of availability of parts. The longer it takes to repair your car, the more time you and a rental car that the insurance company needs to pay for. Since Tesla can now control wait times (artificially I suppose) they can drive costs down. \n\nTesla insurance is not a thing. It never (in my opinion) will be a thing either. Tesla would fail miserably at the insurance game if they truly were to become an insurance carrier. They have no risk stratification.", "score": 3, "replies": []}, {"body": "nice video. ignore the haters o this sub that downvotes anything negative without actually providing critique.  I'm short term bearish on tesla due to economy; but long term super bull.\n\nIMO tesla insurance will be their highest profit margin and least competitive business.  Automobiles are a hyper competitive world product outside of trucks with razor thin margins..  Trucks get a chicken tax import tariff and thats why they are by far the biggest profit centers for US auto manufacturers.  auto companies don't make money on the sale, they make money on financing and parts.\n\nInsurance is not in the same league as the above.\n\ni think the valid criticism is that tesla insurance will only insure teslas.  this won't allow customers to get group discoutns insuring all their assets in one place.\n\nyou say insurance companys require regulation as a bear case.   do you really think this regulatory framework is harder to navigate than automobile manufacturing?\n\nyou imply that tesla won't be able to use  invidivual data in the futre due to regulations.  Do you have any evidence to that?  You think the ggovernment won't allow customers to opt in to data collection for cheaper insurance? \n\nYou say other companies are already doing it which contradicts the previous point.  Who is doing it?  I've never had data collection when pricing out my insurance.  The only data they might have is gps data which is big, but i doubt they ahve the software and stat people to actually make a meaningful effect.  thats kind of like thinking the yellowpages have their own data collection vs Googles or yelps.  \n\nthe point is of a typical tesla lease, the insurance is 33% of the cost.  thats a lot of money for a relatively easy job.  For the rich with big umbrellas insurance who buy tesla cash, tesla insurance not a big deal.  for most buyers financing/leasing teslas, it's a huge deal.\n\ngetting capital float for insuring cars is not hard for tesla.  there is a reason buffet doesn't like it, it's a huge threat to his 3rd party business of geico insurance.\n\nthe other thing is it gives the ultimate feedback loop for tesla.  they've already starting enginerring cars that are easier to repair, what huge problem tesla have.  tesla makes it, sells it, insures it,and repairs it.  vs automobiles where thats done by 4 companies.  there is a lot of benefit to have the 4 things integrated.\n\nhow many times has a tech software company entered a space and not completely changed it?  eg uber, airbnb, expedia, google, yelp, amazon, tesla, cameras, phones, watches.   the track record is clear on this.", "score": 4, "replies": [{"body": "Many good points here. I also believe it will be their highest profit margin (30%+) but least in terms of contribution to net profit.\n\nMy evidence for the information sharing was through CNBC. So whether or not you believe they are legitimate is up to you. Here is the link: https://www.cnbc.com/2019/09/18/tesla-wants-your-car-insurance-business-it-may-not-save-you-money.html\n\nCurrent insurance companies aggregate data depending on the vehicle. So if you drive a Lexus your insurance policy will be different than a Honda. It isn't necessarily the price or potential payout of the vehicle that makes the policy, but also the aggregated data of all Lexus/Honda drivers that insurers currently use. \n\nI'm not saying that Tesla Insurance is bad, just that it will take a while for them to make $1Bn, something many people currently think will happen immediately. It definitely makes sense to grow Tesla Insurance outside of California, especially when the start introducing robotaxis. I mention I am long-term bull on their insurance later in the video.\n\nThanks for the feedback!", "score": 1, "replies": []}]}, {"body": "Couldn't watch more than 3 minutes as the content and information comes out slower than a leaky faucet.\n\n\nBut from what I did hear he was simply stating information and not providing any real reasons why they could not be successful.\n\n\nBasically Tesla has advantages but can't use them becuase of regulation and the compition already uses it anyways....  \n\n\nYah I'll pass on this video.", "score": 3, "replies": [{"body": "If you had the wherewithal to watch later into the video you would see a complete financial breakdown of why they cannot make 1Bn. Seeing Tesla stock from a one-sided perspective is dangerous my friend. Information sharing and privacy will always be regulated, how can you expect Tesla to have an advantage?", "score": 3, "replies": [{"body": "I don't mind criticism of Tesla but the format is not my taste. I only have so much time and if it's in a video format it needs to be of value due to taking a lot longer to get to the point. I didn't see the value in the video.", "score": 1, "replies": [{"body": "Ok mate I’ll try better next time. Hopefully you understand what Tesla Insurance actually is a little better because of this video.", "score": 2, "replies": []}]}]}]}, {"body": "I felt the tone was a bit negative and pessimistic, which came off as weird, as it’s a smart play from Tesla:\n- it increases competition and drives down total cost of ownership right now.\n- revenue will tend towards billions over time and any additional uplift to EPS is welcome\n\nSome points:\n- with all the cameras on the car this will likely help claim and payout validation which reduces costs beyond usual\n- agree that regulation is hard to get into but the data they’re collecting is pertinent to pricing insurance and it should not be excessively hard to convince the regulator of this as time goes by\n- yes capital reserving and reinsurance is more difficult but they’re outsourcing this at the moment. As time passes and as the wider company earns more money they can bring it in house with more resources available. Not an insurmountable problem. They could potentially secure much lower reinsurance premiums as FSD progresses.\n- margin including SGA was a bit generous but unlikely to outweigh other prudence\n- 33% market penetration right now seems fair but this could tend to 100% with robotaxi’s and subscription based driving. Yeah it might be 5 years away but that’s a highly sensitive assumption as it could increase your numbers up to a factor of three, so I’m surprised you didn’t mention it.\n- potential to expand product lines into home insurance if they ramp up solar roof/power wall installations and do combined product discounts\n- 50% annualised car growth seemed sensible but would have been good to see a range on that number, I personally think 50% will be at the lower end of the range \n\nYou do a load of analysis to come up with a revenue figure but it would have been good to go one step further and compare how that revenue would impact the stock price with/without insurance arm. If someone’s watching a Tesla video, ultimately that’s probably their key concern.", "score": 2, "replies": [{"body": "Thanks for the feedback! Will keep that in mind for future videos. About 20 P/E ratio multiplied by the net profit margin would be the impact on market cap when earnings announcement is made I believe.", "score": 2, "replies": []}]}]}
{"title": "How do your definition of success change during times like these and how should I feel about my performance? [My specific gain/loss discussed]", "selftext": "For obvious reasons, the market has been pretty wild the last 3 months.\n\nI originally bought 200 shares of MSFT on February 11th at $189.75.  I decided to buy in to start rather than selling puts because I was quite bullish at the time and wanted to sell very deep OTM calls figuring I would be making money hand-over-fist between stock movement and premium collected (That was a REALLY BAD way to play it and REALLY BAD timing, especially if you look at the MSFT chart.  Wow, that's horrible.)  Anyway, I've spent 3 months since then doing the wheel and that has gone well - I really felt like I could make money trading MSFT, which is why I'm doing this despite my idiotic start.\n \nOverall, between the loss on the stock and the gain on the premium, I'm up $2,238 on this particular strategy.\n\nThat means in 3 months I made $2,238 on my original $37,950 of stock, including the dividend I collected.  I made 5.90% overall or 1.97% per month.  This is all after commissions but before tax. \n Should I feel good or bad about this?\n\nPROS (what I did good):\n\n- The stock moved against in me in an unprecedented way but I managed it.\n\n- I made money despite my starting mistake so in theory, I should be able to do better going forward.\n\n- I  outperformed the market and a buy-and-hold strategy on the same stock during this time.\n\n - EDIT:  I picked a stock I thought would hold up in a bad situation.  It seems like I was right.\n\nCONS (what I did bad):\n\n- I committed a horrible sin to begin with\n\n- I was selling options with insanely high IV so it made recouping the money easier (while you can argue the high IV is the result of operating in an environment with higher risk, I think this is still a net negative for my performance).  Would I have made money during normal times with lower premiums?\n\n- I played a stock that got hurt badly which makes you question my ability to pick a stock to begin with or understand the market in general since I picked a horrible starting time.\n\nOverall, should I feel good or bad about this?  Should we be making more money or less money in times like these?  Is the only thing that matters making money compared to the benchmark you want to outperform?  \n\nEDIT:  Between this experience and spending the time at home reading all of _Options as a Strategic Investment_, I feel like I'm much more knowledgeable than I was just 3 months ago.  Not an expert but improving.  I originally studied up on the wheel and MSFT but probably not to the level I should have before starting.\n\nEDIT 2:  Part of the reason I picked MSFT is because I thought it would hold up better than most during a challenging time.  I wanted a strong balance sheet and cash flow and obviously, high volume for trading this in general.", "id": "gf5k9h", "created_utc": 1588854332.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 10, "comments": [{"body": "Personally just the lessons learned and how you wrote this should be a success - I am currently on a very similar journey. I lost nearly half of my initial money and am currently improving and count the decrease in my portfolios value as “tuition fee”.\nI also use the lost amount as motivation to get better.", "score": 13, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "IMO it takes at least 6-12 months to be unemotional about it. I’m currently managing a very unfortunate lyft 29/32 credit spread. Before I’d have taken my loss, now I saw the price action, closed the short leg, rode the long leg and cut my loss in half. No substitute for learning certainly when you’re getting paid for it like OP :)\n\nManaging a position that's going your way is easy, managing one that moves against you is both critical to maximizing your returns, and also super hard.", "score": 3, "replies": []}]}]}, {"body": "I measure success year over year to maintain or improve each year.  The first year+ was still a learning curve and until I stopped making so many mistakes and dialed in my trade plan.\n\nYou are doing well and have a great start!  The question is if you have a good trade plan so you can continue this performance year after year during different market conditions.\n\nDon't be too hard on yourself for the next year or so as you get things dialed in.  Best of luck!", "score": 7, "replies": []}, {"body": "if you're up over the past 3 months, you're doing fine.  you learned stuff, you made money.  cheaper than college, right?", "score": 5, "replies": []}, {"body": "Focus on system / process / plan and not outcome -- atleast when you're starting off", "score": 5, "replies": [{"body": "I agree but should I feel like the system I am using is working given these results?  I need to be able to measure my success to determine if it needs some revision.", "score": 1, "replies": []}]}, {"body": "At close on Feb 11th, the S&P was at 3352 and Microsoft closed at 184. So at the time of this writing S&P is down \\~14% and MSFT is flat - you're currently up +5%. \n\nSeems fine to me.", "score": 4, "replies": []}, {"body": "Thank you! I learned a lot", "score": 2, "replies": []}, {"body": "The fact that you are learning from your mistakes is the #1 performance measure.  Beyond that, nobody should ever be upset about averaging almost 2% per month in return on capital. \n\nFor comparison, the CBOE did a long-term analysis where they took a fixed amount, sold monthly puts on SPY, and invested the income in t-bills.  Rinse and repeat for decades.  Over a period of 25 years, the put-write strategy returned 10.4% annually, vs 9.14% for buy-write, and 9.03% for the S&P.  Thats a fantastic benchmark to use for lower-risk/lower-return strategies.   If you can beat that, you can be confident you are at least doing something right.  \n\nAnd iirc the buy-write strategy returned 1.8% monthly in passive income, if that’s the kind of benchmark you are interested in. \n\nEdit: you can go to cboe.com/PUT to read up on it.", "score": 2, "replies": []}, {"body": "How did you make so much money back wheeling when the stock was down? Did you have extra cash for puts? Strike/expo of calls sold?", "score": 1, "replies": []}]}
{"title": "A painful lesson in selling covered calls: Featuring PYPL", "selftext": "[deleted]", "id": "gf7fof", "created_utc": 1588861263.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 18, "comments": [{"body": "1) Buy calls to hedge against FOMO if PYPL keeps mooning?\n\n2) Why not just have let the shares get called away and then re initiate a new CC position immediately?\n\nBeing forced to take profits isn’t the worst thing in the world ;)", "score": 19, "replies": [{"body": "is there any downsides for 2)?\n\nfor long term, it seems equivalent even when factor in tax?  unless one plans to hold the stock till they retire (and potentially be in lower bucket).", "score": 1, "replies": [{"body": "Downside to CC is that you miss out on additional gains if the underlying blows past the strike price. \n\nKeeping it simple, CC premiums are short term capital gains if they expire worthless or if you buy back the position. If you get assigned, standard 1 year rule applies when determining short vs long term capital gains.", "score": 1, "replies": [{"body": "thanks! so I should probably not bother selling CC for stocks that I don't want to sell outright then? Have been checking strikes further away (like 1SD away) and the premium is usually just pennies for calls that expire in 3 or 4 weeks", "score": 1, "replies": [{"body": ">so I should probably not bother selling CC for stocks that I don't want to sell outright then\n\nYes, don't sell calls for stocks you want to hold long term.", "score": 3, "replies": [{"body": "thanks!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I mean, isn't this the point of hedging? I remember in one of my finance classes the professor told us it's impossible to hedge and to keep all of the upside. You can limit your risk or expose yourself to both the upside and the downside, but you can't do both.", "score": 6, "replies": [{"body": "Yup. No such thing as riskless profits.", "score": 3, "replies": []}]}, {"body": "You would have sold another covered call at 100 if you had rebought the 120. Consider yourself lucky.", "score": 4, "replies": []}, {"body": "“Painful”? Come on now, this is absurd. Your shares would’ve been called away at a nice profit for you, its not like your account was about to be blown.", "score": 3, "replies": [{"body": "Knowing you missed out on $2k of profit is painful. At least, I think it is. But it’s not as bad as blowing 2k for a loss either.", "score": 1, "replies": []}]}, {"body": "So what you’re saying is, you could have had profit when your shares got called away, but instead you rolled up and out, taking a loss in the process?", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}, {"body": "Have you considered a GTC order at a certain level of profit?", "score": 1, "replies": []}, {"body": "I bought puts and am negative. You're not so bad off. This is a blip anyway based on people isolating for the majority of the 2nd quarter. Will probably retrace to 120come Fall.", "score": 1, "replies": []}, {"body": "Man. That’s rough bro. A painful lesson we all learn at some point in time. It’s ALWAYS worth it to close those trades on the cheap when we can. \n\nI’m curious, why’d you go out that far? Was there nothing a little closer that you could have rolled to and maybe got out on a pullback?", "score": 1, "replies": []}, {"body": "If you have additional capital - have you considered selling puts on the opposing side and moving the calls further out in strike using the credit?\n\nThis will widen the gap to profit but you need to be ready to accept the puts if assigned", "score": 1, "replies": []}, {"body": "Assignment is your best case scenario using this strategy. You should be happy", "score": 1, "replies": []}]}
{"title": "TSLA DD: Elon boutta get lit", "selftext": "Fellow autists please see within this Instagram caption some big news.\n\nLast time Elon was on the JRE Podcast he smoked a big doobie and caused a steep drop in TSLA stock price. Now see that I saw this post at 4:20pm and Elon just had a child and might as well of called it R2-D2, the stars have aligned and TSLA is going straight to $420.\n\nThank you for listening to my TED talk.\n\n&#x200B;\n\nTL:DR $TSLA 420p 5/7\n\nhttps://preview.redd.it/p6znx4sodax41.png?width=750&format=png&auto=webp&s=379b9eb39af352ed8210d273578905a3227c78f3", "id": "gf1b58", "created_utc": 1588832947.0, "score": 46, "upvote_ratio": 0.86, "num_comments": 10, "comments": [{"body": "Nah he’ll probably get stoned and announce Tesla’s transition to a defense sector company producing battery powered robot soldiers aka $TSLA 4200c", "score": 56, "replies": [{"body": "You spelled $42,069 wrong.", "score": 13, "replies": []}, {"body": "My TSLA puts say that this is likely.", "score": 5, "replies": []}]}, {"body": "No position in TSLA atm. I could see that, as they get lit, Joe bringing up Elon's huge windfall from TSLA performance, he reiterates his, just money, money is worthless, TSLA way to high schtick. Personally cant wait to hear/then watch.\n\nEdit: Also his grip is incorrect.", "score": 11, "replies": [{"body": "While you were wanking Elon studied the blade, Mr. Expert on Gripping", "score": 2, "replies": [{"body": "Once again, his grip incorrect. My grip while wanking correct.", "score": 1, "replies": []}]}]}, {"body": "And stock drops at 12pm EST :P", "score": 7, "replies": []}, {"body": "600p", "score": 4, "replies": []}, {"body": "[deleted]", "score": -10, "replies": [{"body": "> market cares about child abuse", "score": 11, "replies": [{"body": "If the market hears about child abuse it might be TSLA straight to $1000", "score": 8, "replies": []}]}]}]}
{"title": "Papa Musk on Joe Rogan again, premiering in about 12 hours. We all remember what happened last time. TSLA is about to drop.", "selftext": "[removed]", "id": "gf1dl9", "created_utc": 1588833279.0, "score": 28, "upvote_ratio": 0.97, "num_comments": 10, "comments": [{"body": "This time he does DMT with Joe.", "score": 6, "replies": []}, {"body": "Hope he explains the name of his kid", "score": 7, "replies": [{"body": "I just want to hear how he pronounces it", "score": 6, "replies": [{"body": "It’s easy. It’s pronounced just how it’s spelled. XÆA-12", "score": 4, "replies": []}]}, {"body": "Grimes already did on her Twitter. It’s fucking insane", "score": 2, "replies": []}]}, {"body": "Elon and Alex Jones on the same podcast would break the universe.", "score": 5, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "BRACE FOR FUCKING IMPACT", "score": 1, "replies": []}, {"body": "This post has been vote removed.\n\n___\n\nIf you think this was an error you can vote to restore this thread and punish the volunteer moderators responsible in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}, {"body": "This didn’t age well", "score": 1, "replies": []}]}
{"title": "Short tf outta TSLA", "selftext": "[removed]", "id": "gf1n6p", "created_utc": 1588834651.0, "score": 8, "upvote_ratio": 0.9, "num_comments": 11, "comments": [{"body": "Inverse this for tendies", "score": 5, "replies": [{"body": "Inverse this for tendies", "score": 3, "replies": []}]}, {"body": "Rip dipshit. Good luck.", "score": 1, "replies": []}, {"body": "He won't make the same mistake twice\n\nTSLA will MOON after this.", "score": 1, "replies": []}, {"body": "This post has been vote removed.\n\n___\n\nIf you think this was an error you can vote to restore this thread and punish the volunteer moderators responsible in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}, {"body": "When is he appearing ?", "score": 0, "replies": [{"body": "9am tomorrow", "score": 1, "replies": []}]}, {"body": "Priced in", "score": -2, "replies": [{"body": "Autist", "score": 1, "replies": [{"body": "Thank you 🙏", "score": 2, "replies": []}]}]}]}
{"title": "Are these PYPL calls a no-brainer?", "selftext": "[removed]", "id": "gf1tbk", "created_utc": 1588835514.0, "score": 3, "upvote_ratio": 0.72, "num_comments": 12, "comments": [{"body": "You’re a bit late bud", "score": 14, "replies": [{"body": "a lot late", "score": 3, "replies": []}]}, {"body": "They gone be 3 times as high in the morning", "score": 4, "replies": []}, {"body": "lol, nice one. Check back in when the market is open.", "score": 6, "replies": []}, {"body": "You seem to have it all figured out so go ahead", "score": 8, "replies": []}, {"body": "Green means go", "score": 3, "replies": []}, {"body": "Why people post option prices and actions after hours?  All of this is bull crap while the market is closed\n\nEdit: I forgot... we are in WSB", "score": 1, "replies": []}, {"body": "I think its overvalued. How do they even make money? Its just a way for people to transfer money", "score": -8, "replies": [{"body": "Revenue is 4 billion something u retard they make money", "score": 2, "replies": [{"body": "4 billion yet they’re valued at 170 bil. Hm yea that makes sense", "score": 0, "replies": [{"body": "U just don’t get it do ya pal", "score": 1, "replies": []}]}]}, {"body": "they charge transaction fees to the seller, whether on eBay or any other vendor.", "score": 1, "replies": []}]}]}
{"title": "Dow rises 200 points as investors bet on an economic rebound - everyone is betting on V shape while unemployment keep going up.", "selftext": "", "id": "gf6m6a", "created_utc": 1588858385.0, "score": 16, "upvote_ratio": 1.0, "num_comments": 10, "comments": [{"body": "Wow, trump successfully fought off a pandemic and recession with just his twitter account", "score": 36, "replies": [{"body": "Don't forget the printer", "score": 6, "replies": [{"body": "\"the printer\" has a anus hole 3\" in diameter after \"the president\" called him into the oval office for a 1 on 1 in march", "score": 5, "replies": []}]}, {"body": "SPY 400 EOY confirmed! Mission accomplished! 🇺🇸 🇺🇸 🇺🇸!!!", "score": 2, "replies": []}, {"body": "Modern wars call for modern solutions", "score": 2, "replies": []}]}, {"body": "Also UK markets expecting good news this Sunday from PM but yeah mostly America", "score": 3, "replies": []}, {"body": "This shit will crash hard soon. \n\nExponential growth of the infection while he screams at China in the white house as the empire in his mind crumbles away, with hope of anyone but die hard republicans voting for him.\n\nHis idiocy will be so self evident that even the stupid will see it.\n\nThose jobs aren't coming back. The dead will pile up (sadly, it really fucking sucks) and there will be a second enforced shutdown as the US will become the macabre laughing stock of the world, while Europe and the rest of the proper democracies worldwide fight off covid much more effectively. Only by listening to scientists a bit more and erring on the side of caution.\n\nI feel bad for the 90% (probably more) of the US that do the right thing and don't deserve this, and am thankful that I'm not there.\n\nI'm just holding short SPY futures for the next few weeks or month until it heads down again. If it doesn't, well too bad, I'll take the L. But I think the US is too far gone to do the right thing anymore. Admission of making mistakes isn't a Republican strong point, and this is gonna be the biggest one yet!\n\nThere's probably even a small chance that he makes good on cancelling some Chinese treasuries. \n\nLooking forward to when figures are no longer reported, Trump vanishes, and victory is declared while it's completely ignored and denied. Can't wait to see how they do it!\n\nImagine if there really actually is a second wave after this first one dies down, lol.\n\nI guess this is what you get when capitalism gets to run wild. It's horrendous. Human nature is pretty horrible at the end of the day.", "score": 0, "replies": [{"body": "*yawn* nobody cares about the flu anymore. The new news cycle will shift towards something else, like guidance on future tax rates.", "score": 2, "replies": [{"body": "I've been having a look at the NBC nightly report on youtube every day and it all seems to be corona. I'm not in the US though, so maybe you're right.", "score": 0, "replies": []}]}]}]}
{"title": "Reminder that SeaWorld earnings will be posted Friday before market open (SEAS)", "selftext": "This is a pretty cheap play for my fellow bears out there. Pick up some puts against a company which was dying before the commie cough. Unlike other companies being pumped through bad earnings, millennials don't like SeaWorld and the outlook even in a recovery isn't good.\n\nSEAS $13.5P 05/08", "id": "gf7vsi", "created_utc": 1588862840.0, "score": 1, "upvote_ratio": 0.54, "num_comments": 16, "comments": [{"body": "IV over 200%.  Do not buy these.", "score": 19, "replies": [{"body": "Of course the IV is high. It's an earnings play. IV is always higher before earnings, especially when big swings are anticipated, especially in this market and on a company like SEAS. High IV is great for selling, and also profitable when buying if the IV goes up further after you buy.\n\nLurk more. Your entire post history around here is expert banter.", "score": 1, "replies": [{"body": "Big swings? It’s down 60% since February.  You really think there’s more blood to squeeze out of this? I’m betting you’re wrong.  The couple points this drops isn’t going to make up for the corresponding drop in IV.\n\nHigh IV is great for selling.  Your post proposed buying.  Further, IV isn’t going anywhere but down - unless we’re talking over the next few hours.  Obviously this matters even more when we’re talking an earnings play.\n\nReddit cred isn’t something I’m overly concerned about, but nice flex bro.", "score": 2, "replies": [{"body": ">Big swings? It’s down 60% since February.  You really think there’s more blood to squeeze out of this? I’m betting you’re wrong.  The couple points this drops isn’t going to make up for the corresponding drop in IV.\n\nEverything is down since February. SeaWorld bottomed around $7.35 in March. It's doubled since then.\n\nAnd yes big swings. That's why IV is high in the first place. Premiums are high because the downside risk to sellers is tremendous. That's what you're paying for.\n\nI'm not saying to buy a bunch of $10 FDs and YOLO your entire account. But put spreads can work well here. I've made good money on spreads through earnings the past couple of weeks with small positions.\n\n>High IV is great for selling.  Your post proposed buying.  Further, IV isn’t going anywhere but down - unless we’re talking over the next few hours.  Obviously this matters even more when we’re talking an earnings play.\n\nIV crush isn't really an issue with a short term expiring contract like this, especially with a spread, and especially if you have a sell limit in place. And it's still not the biggest factor. The biggest factor is whether or not the stock actually moves down.\n\n>Reddit cred isn’t something I’m overly concerned about, but nice flex bro.\n\nIt's not about reddit cred. It's about contributing more to threads than posting IV levels as if that alone determines the worthiness of a position, and not armchair quarterbacking. You may be wrong, I may be wrong. And I'm fine blowing $50 on a SEAS bet.", "score": 2, "replies": [{"body": "I mostly agree with you, and I appreciate that you took the time to write a substantive response to this.\n\nTrust me, the whole “you’re gonna get crushed” sentiment on here, when usually without understanding, has always bugged me.  Words are repeated without comprehending what they actually mean.  Perhaps you feel similarly and that’s why you jumped on my comment.\n\nFair point on the armchair quarterbacking.   Guilty.", "score": 2, "replies": [{"body": "Well you may be right and IV shouldn't be ignored altogether. I actually appreciate this back and forth as hopefully others here can learn from it.", "score": 2, "replies": []}]}]}, {"body": "Listen to this. IV killed my grub calls. \n\nIf you didn't buy into this last week, don't waste your time.", "score": 1, "replies": [{"body": "GRUB is down $7 in a week. Of course you lost money on calls. Or am I missing something here?", "score": 1, "replies": []}]}]}]}]}, {"body": "Got it, buy calls.", "score": 5, "replies": []}, {"body": "I thought it was already dead and shuttered. I mean is it just a public pool now?", "score": 3, "replies": [{"body": "*public latrine", "score": 3, "replies": [{"body": "Tilikum’s piss is still mixed in the water today from the rumors.", "score": 2, "replies": []}]}]}, {"body": "Given how Disney did I expect this to go up", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Pretty bold to assume that he hasn't done this already and is trying to yolo his settlement.", "score": 1, "replies": []}]}, {"body": "Lol buy calls! Obviously SeaWorld stock SHOULD drop SO BUY CALLS. Inverse any logic in this current market. Just bought calls and they're rising!", "score": 2, "replies": []}, {"body": "IV high= sell call spreads for bearish look. But that’s no fun, and I love sea world and I’m a millennial and for those reasons I’m out...", "score": 1, "replies": []}]}
{"title": "I shall build my church upon these TSLA gains today...", "selftext": "", "id": "gf7y0k", "created_utc": 1588863056.0, "score": 77, "upvote_ratio": 0.91, "num_comments": 20, "comments": [{"body": "they'll soon breakeven fellow TSLA put-holder, this is the way", "score": 14, "replies": [{"body": "Even halting of their global production today didn't make it drop. This ticker has retard strength built upon the tears of us PUT holders.  \n  \nhttps://www.bloomberg.com/news/articles/2020-05-07/tesla-abruptly-suspends-car-production-at-chinese-factory", "score": 4, "replies": []}]}, {"body": "Y’all must be new here, never bet against Elon. Thank you for yalls donations", "score": 16, "replies": [{"body": "Bulls and bears eat shit at elons whim. Just roll with it and hope it isn't your turn", "score": 4, "replies": []}]}, {"body": "be interesting to see how the jre podcast that's dropping in a hour effects the share price", "score": 3, "replies": [{"body": "Given that it's pre-recorded, I am not so sure if anything that's negative of TSLA will drop. Surely it went through a team of lawyers, right?  \n  \nAll he has to do is utter, \"Tesla stock price too high imo\". A man can only dream!", "score": 1, "replies": [{"body": "I would be dumbfounded if it didn't get board approval before being released after his Twitter meltdown", "score": 1, "replies": []}]}]}, {"body": "You realize that battery investor day is soon right?", "score": 3, "replies": []}, {"body": "Nice", "score": 1, "replies": []}, {"body": "Then your church will go up and down. \n\nI don’t know why peeps hate Tesla, I have a murdered out Tesla and it’s amazing. \n\nJust sell before it goes down", "score": 1, "replies": []}, {"body": "How long you holding for", "score": 1, "replies": [{"body": "Since Monday, when TSLA crossed $750. How the stock price came back to the pre-\"Tesla stock price is too high imo\" tweet levels beats me. I underestimated this cult, bigly.", "score": 1, "replies": []}]}, {"body": "Never bet against Elon Musk. 🌈 🐻", "score": 1, "replies": []}, {"body": "Always make money. Even if it’s only 1 cent. That means you did it right.", "score": 1, "replies": []}, {"body": "GUH", "score": 1, "replies": []}, {"body": "RIP", "score": 1, "replies": []}, {"body": "Upvoted so that your embarrassment can be seen by even more people", "score": 1, "replies": []}, {"body": "Elon hurts me when I buy puts. I switched to calls today. Though I hope at least one of us sees 500%+", "score": 1, "replies": []}, {"body": "Bet against Elon? Remember \"Tesla stock price too high imo\"? Stock went down for 1 day. Not even Elon can keep it down!", "score": 1, "replies": []}, {"body": "The Lord taketh away", "score": 1, "replies": []}]}
{"title": "If you're holding shares or calls in Tesla, sell them. There is a 0% chance that this will go well.", "selftext": "", "id": "gf86dx", "created_utc": 1588863800.0, "score": 3, "upvote_ratio": 0.58, "num_comments": 20, "comments": [{"body": "0% so your saying their is still a chance?", "score": 30, "replies": [{"body": "As much chance as you getting grammar correct.", "score": 3, "replies": []}, {"body": "Sqrt(-1)% so yes", "score": 1, "replies": []}]}, {"body": "Everyone is saying sell/puts. Which means it's the perfect time to buy calls.", "score": 19, "replies": [{"body": "Why not sell short puts and use the profits to buy long calls?", "score": 1, "replies": []}, {"body": "announced less than 24 hours ago, u think this ends up well in any scenario? you're an idiot enjoy your pretend losses since I'm sure you aren't making any plays", "score": -1, "replies": []}]}, {"body": "My cost basis is 312/sh. Time to abandon ship!", "score": 4, "replies": []}, {"body": "so far seems to be going pretty good. THe podcast is over and the stock actually shot higher from this morning's lows....", "score": 3, "replies": []}, {"body": "I’m buying calls", "score": 2, "replies": []}, {"body": "This really makes me want to yolooooooo", "score": 1, "replies": []}, {"body": "I’m definitely buying some TSLA lottery tickets at close. Cheapest puts and calls.", "score": 1, "replies": []}, {"body": "Is this pre-recorded?", "score": 1, "replies": [{"body": "Yes", "score": 3, "replies": [{"body": "Well, in that case I'm sure their PR staff have asked for some editorial control. But may buy a few puts just in case.", "score": 1, "replies": [{"body": "Just venmo me the money instead that'd be less of a waste", "score": 2, "replies": []}]}]}]}, {"body": "Roganbros running to buy stock. Will fuck up and get old Tesla cds trying to buy stock on amazon", "score": 1, "replies": []}, {"body": "Elon going to court with California, stonks go up", "score": 1, "replies": []}, {"body": "Aged like milk", "score": 1, "replies": []}]}
{"title": "$AMZN Yolo", "selftext": "[deleted]", "id": "gf88l6", "created_utc": 1588864003.0, "score": 1, "upvote_ratio": 0.55, "num_comments": 14, "comments": [{"body": "So much free money for that writer. It’s already gone man, sell.", "score": 9, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "now you people tell me this smh guess i’m selling", "score": 1, "replies": [{"body": "Do you have 230,000 to write this?", "score": 1, "replies": [{"body": "hold on let me ask chase bank", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Jokes", "score": 1, "replies": []}, {"body": "The spreads are not worth it. It doesn't make sense risking 7k for 2k.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Broke college student just yoloed all my money into an amzn call hoping daddy bezos will buy me a new car.... or just pay off this semster. well see how it goes", "score": 5, "replies": [{"body": "You have one post and view the Christianity sub. I have faith in you", "score": 1, "replies": [{"body": "shhhh new account gotta make it look good lmaoo", "score": 2, "replies": []}]}]}, {"body": "Lol how much do you really hope to profit from one short term, not that far OTM contract? Risking $2500 for maybe $200 gain if it goes your way is pretty lols.", "score": 2, "replies": []}, {"body": "Spending your last $2500 like this? \n\nShit man, you should have bought 5/29 $T calls, thats how you double your money.", "score": 2, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. Find more YOLOs here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da. \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "You flexing? That's 2x my net worth: 1200 (stimulus check).", "score": 1, "replies": []}, {"body": "Lol, did you really on a 5/15 call after what just happened at earnings?", "score": 1, "replies": []}]}
{"title": "TSLA Pod Cast Live Thread", "selftext": "[deleted]", "id": "gf8sau", "created_utc": 1588865789.0, "score": 8, "upvote_ratio": 0.73, "num_comments": 19, "comments": [{"body": "Puts. If TSLA doesn’t drop to 600 by the end of next week, I’ll buy a red dildo and ram it in my ass", "score": 30, "replies": [{"body": "[removed]", "score": 24, "replies": []}, {"body": "MODS!", "score": 7, "replies": []}]}, {"body": "800c 5/8 let's go", "score": 5, "replies": [{"body": "I got 700p.\n\nI spent 70 bucks, you spent ~800 per contract.\n\nLet's see what happens.", "score": 3, "replies": [{"body": "Tbh nothing tesla related will come of this and the stock will just do its thing", "score": 2, "replies": [{"body": "looks like a nothingburger to me", "score": 2, "replies": []}, {"body": "possibly something Musk related though\n\nBut yeah, lottery ticket.", "score": 1, "replies": []}]}]}]}, {"body": "Has the video been leaked? Looks like some already have access to it", "score": 3, "replies": [{"body": "Just search for joe rogan on youtube, it's on his channel", "score": 1, "replies": []}]}, {"body": "So far the clips I've seen are Elon explaining his child's name and why he's selling physical possessions. There were 2 other videos about Elon saying we need more info on Covid deaths and Neuralink. So far it doesn't look like anything worth shorting.", "score": 3, "replies": []}, {"body": "Yeah, fetal.", "score": 2, "replies": []}, {"body": "Around 1:51, he starts talking about TSLA. No big news or anything crazy. This was a pretty docile podcast. Cybertruck doesn't seem to be a priority seems to be the only info he gives up. They are also tinkering with some specs on the Modell S. Rogan loves his Tesla. Musk is hyped about the Roadster. The end.", "score": 2, "replies": []}, {"body": "Tesla closed all of its plants today.", "score": 3, "replies": []}, {"body": "What time is it", "score": 1, "replies": []}, {"body": "He's talking about brain upgrades and the stock is rising", "score": 1, "replies": []}, {"body": "Bought 10 740p at 11:59AM for $340/contract. \nSold them 7 minutes later for $220/contract. Lost $1200 in 7 minutes. Thanks y’all!", "score": 1, "replies": []}, {"body": "58:44 \"I kinda saw this whole thing play out in China before it played out in the US. So, it's kinda like watching the same movie a-GAIN, but in English. So, yeah. I ttttthink the mortality rate is much less than what is, then say, what the WHO says it was, like at least an order of magnitude less.\"\n\nOh yeah, I remember when the US government forcibly bared everyone from leaving the entire state of New York, and welded apartment doors shut if people violated stay-at-home measures. Those protests of Chinese people not wearing masks and begging to go back to work were wild. Remember when Xi Jinping told everyone it would magically disappear in the summer heat?\n\nIs Musk self-deluded or just downright stupid?", "score": 1, "replies": []}, {"body": "5/8 1000c lotto time. Let's turn $16 into $16,00.000", "score": 0, "replies": []}]}
{"title": "Musk joining Rogan again for another Podcast - Long Puts", "selftext": "[deleted]", "id": "gf97ml", "created_utc": 1588867151.0, "score": 8, "upvote_ratio": 0.75, "num_comments": 17, "comments": [{"body": "Or, since everyone is expecting what you're expecting, Papa Elon inverses you all and shoots the stonk through the roof by announcing some crazy shit.", "score": 6, "replies": [{"body": "Yea I just got calls...", "score": 2, "replies": []}]}, {"body": "Musk being a meme is priced in, its a different atmosphere than the first podcast. Calls are the way to go on this one imo", "score": 3, "replies": []}, {"body": "Gonna be good!!!", "score": 2, "replies": []}, {"body": "When is it?", "score": 2, "replies": []}, {"body": "Good ducking god", "score": 2, "replies": []}, {"body": "*Elon Musk wants to know your location*", "score": 2, "replies": []}, {"body": "Idk tard, I see what you're saying but what if he does a surprise reveal of some crazy new Tesla gadgetry that 10 million people see at once, it's moderately priced for the tech and now all these people can and will buy w that new stim money. Rambling but what if", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "It’s on the information super highway I believe", "score": 5, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "that’s like 15 minutes out of 2 fucking hours.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Idk I watched all of it, Mr skippy.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}
{"title": "Stock Market Today With Jim Cramer: Buy Tesla Stock Now $TSLA", "selftext": "[deleted]", "id": "gfaagz", "created_utc": 1588870424.0, "score": 9, "upvote_ratio": 0.84, "num_comments": 12, "comments": [{"body": "So puts?", "score": 26, "replies": []}, {"body": "Im starting to think Jim cramer is not incompetent, but actually malicious.", "score": 13, "replies": [{"body": "Starting?", "score": 5, "replies": []}]}, {"body": "Tesla stock just sucks money away like a vacuum", "score": 8, "replies": []}, {"body": "Remember when Cramer said to buy more bank positions in 07? I’d rather trust a rock than him", "score": 6, "replies": [{"body": "He’s also constantly flopping between hating Wells Fargo, usually when they get caught doing something bad and praising them, usually while mentioning he spent last weekend with so-and-so from Wells Fargo and “they are just the smartest, savvy investors, really smart guys there” \n\nCramer’s a tool. I just can’t figure out if he’s smart enough to realize it or if he’s drinking his own lemonade.", "score": 1, "replies": []}]}, {"body": "Got it so puts", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Lol at living long enough to see that", "score": 1, "replies": []}]}, {"body": "I've just thrown the Tesla Hail Mary. Could not think of a more illogical position than Tesla calls so I went with it. Will either be a hollow victory or a fitting defeat.", "score": 1, "replies": []}, {"body": "That's the top, Tesla going bankrupt.", "score": 1, "replies": []}, {"body": "Did he say this when tesla was 400? lol", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah but it sounds retarded to me to wait for Tesla to go from 400 - 800, then at 800 to say is time to buy.", "score": 0, "replies": []}]}]}]}
{"title": "UBER is the new TSLA?", "selftext": "", "id": "gfewld", "created_utc": 1588884575.0, "score": 15, "upvote_ratio": 0.78, "num_comments": 12, "comments": [{"body": "Uber stock is too high imo.", "score": 11, "replies": []}, {"body": "This is opposite month.", "score": 9, "replies": [{"body": "I thought that ended last month.", "score": 2, "replies": []}]}, {"body": "If AH price holds tomorrow, Uber will be off only ~15% its pre-coronavirus high. It's higher than it was January. Yes the market thinks Uber's prospects are better than they were on January 1st.\n\nYahoo Finance message boards have an explanation: \"Everyone's going to take Ubers to work instead of public transit!\"", "score": 5, "replies": []}, {"body": "Looks like shorts are covering now...", "score": 2, "replies": []}, {"body": "Just calls every big company, 2/3 times you ll be right", "score": 1, "replies": []}, {"body": "As if such a shit-eating company could compete with our lord and savior(apologies for the sacrilege, Mr. Shkreli) and his quest to create the world's first real AI company", "score": 1, "replies": []}, {"body": "Wow, I can't wait to short the shit out of this company.", "score": -1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Agreed. In my experience, take whatever you think should happen and do the opposite. It's a fool proof strategy.", "score": 4, "replies": [{"body": "shorted at $31.8, covered $29.7. Back in again at $33.15 and it goes above $34 lol....  \n\n\nJust trying to cover my nearly 10k loss on lyft from today. Got margin call right when it was trading 33.5 in the day, only to go down 31.5 few minutes after closing the position....", "score": 3, "replies": [{"body": "F", "score": 2, "replies": []}]}]}]}]}, {"body": "Big surprise a company that lets its customers assault employees turned out to be a pump and dump", "score": -2, "replies": []}]}
{"title": "AMD Calls", "selftext": "[removed]", "id": "gfgdjr", "created_utc": 1588889329.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 18, "comments": [{"body": "I love AMD one of the few companies I actually hold a long position in fuck Intel they are ripe to be fucked on. 2021 they also come out with their data center gpus that rival the NVDA titan class gpu at 30% less wattage.", "score": 6, "replies": []}, {"body": "Just buy shares like you’re not a retard and hold your ankles.", "score": 4, "replies": []}, {"body": "Down 45% on 5/22 calls . prob good time to get some.", "score": 2, "replies": [{"body": "what was the strike price and cost for each contract?", "score": 1, "replies": [{"body": "1.33c 55/59 debit spread", "score": 1, "replies": []}]}]}, {"body": "I’m long on AMD but it looks like [competition is going to ramp up](https://www.google.com/amp/s/www.techradar.com/amp/news/nvidias-reportedly-readying-5nm-graphics-cards-for-2021-in-an-effort-to-crush-amd)", "score": 2, "replies": [{"body": "Nvidia has been crushing amd gpu for a while. Bullish", "score": 3, "replies": []}]}, {"body": "I always have a few amd calls and I moved all but 60c July amd into Uber today. Thinking amd is pretty much the low and good to move into", "score": 1, "replies": [{"body": "$52 is the low? I’ll remind you that when it’s $30 again", "score": 2, "replies": [{"body": "You think it will drop that low again? I can wait! In relative terms, amd has been frustrating me. $60 just can’t be had atm", "score": 1, "replies": []}, {"body": "I hope you’re right\n\nedit: fuck", "score": 1, "replies": []}]}]}, {"body": "Just jump in on the trend. When AMD crosses above their 10 day MA, buy calls. When it crosses below buy puts. For whatever reason AMD tends to trend a lot more than the typical stock.", "score": 1, "replies": [{"body": "Its been magnetized to 52 recently", "score": 1, "replies": []}]}, {"body": "Bro amd only goes up", "score": 1, "replies": []}, {"body": "Traded in my amd calls for PayPal calls yesterday", "score": 1, "replies": []}, {"body": "Run the wheel on AMD it works pretty well", "score": 1, "replies": []}, {"body": "Why calls. Looks like it has boom and bust cycles on a regular basis. Why would it even stay up?", "score": 1, "replies": []}, {"body": "bagholding $51c", "score": 1, "replies": []}]}
{"title": "Why TODAY is the SELL day in spy / dow / nasdaq", "selftext": "[deleted]", "id": "gfhyqn", "created_utc": 1588894820.0, "score": 4, "upvote_ratio": 0.7, "num_comments": 12, "comments": [{"body": "[deleted]", "score": 17, "replies": [{"body": "😂", "score": 0, "replies": []}]}, {"body": "Mate we need more info. Over here it is still yesterday for you.", "score": 9, "replies": []}, {"body": "Futures are green...I hope you got that fork ready tomorrow", "score": 7, "replies": []}, {"body": "Everyone is 100% in on the bull market. \n\nI think all the WSB vets know what that means.\n\n🏳️‍🌈🐻", "score": 3, "replies": []}, {"body": "Screen grabbed", "score": 2, "replies": []}, {"body": "grab the fork", "score": 2, "replies": []}, {"body": "J pow disagrees", "score": 1, "replies": []}, {"body": "You're right but people here don't want to hear it", "score": 1, "replies": []}, {"body": "Ban", "score": 0, "replies": []}, {"body": "The dollaroo has 0 effect on spy sorry to tell you", "score": 0, "replies": []}]}
