{"title": "Risk Free Butterfly Option For AAPL? Displayed on TOS Analysis", "selftext": "I'm trying to understand why TOS is showing this too good to be true analysis of this setup. What am I not seeing here? The current AAPL share is $120 so entering into this trade would guarantee the upside without the risk? How is that possible?\n\nI got this by adjusting a butterfly call. Buy 2 ATM calls ($120 strike) and sell 1 near ATM OTM call ($124).\n\nhttps://preview.redd.it/5dfkfpcwpml51.png?width=2615&format=png&auto=webp&s=aa32e5b39ea30d11e3ffb871d13de44f33ba3b70\n\nWhat's the actual risk of owning this trade?", "id": "inyfl2", "created_utc": 1599442701.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 12, "comments": [{"body": "Was this done after hours? You're most likely going to struggle to get a fill on this during market hours. After hours options prices aren't always accurate.", "score": 2, "replies": [{"body": "Thank you, why is it that after hours has this effect?", "score": 1, "replies": [{"body": "I think it has something to do with the bid and the ask being offset, I'm not exactly sure why. Also most tickers continue to move during afterhours and the options prices don't change with them since options trading is closed for the day.\n\nThe prices are usually still fairly close as long as the underlying hasn't moved but they will be off by a couple dollars one way or the other. When you take that couple dollars and multiply by 4 legs on a strategy that is usually a fairly low debit I could see it saying its free or even offering a credit. Its still ok to look at different trades just remember they won't be exact numbers.", "score": 0, "replies": []}, {"body": "I always assumed it was good for day orders expiring, leaving a weird spread.", "score": 0, "replies": []}]}]}, {"body": "So you have +2 at 120 and -2 at 123.75? So your buying 2 debit spreads. I don't see how this is a butterfly.", "score": 1, "replies": [{"body": "You're right. It should be 2 debit spreads but the way TOS shows price locked made it seem to a noob like me that it isn't hahaha", "score": 1, "replies": [{"body": "All good govna. All good.", "score": 1, "replies": []}]}]}, {"body": "After markets closes the spreads on options widen to the point where you can find plenty of risk free trades but once option pricing updates on market open either the opportunity will cease to exist or you simply won’t get filled.", "score": 1, "replies": [{"body": "Ah I see! Thanks a lot! Yes this was done after market. I knew it was too good to be true. Why is that the price changes after market?", "score": 0, "replies": []}]}, {"body": "Lol. Click on the lock button next to the price on the simulated trade. That’s the first thing I check when I see something “too good to be true.”\n\nEdit: By the way, this isn’t a butterfly. Both of your long strikes are at 120. This trade is two debit call spreads with a limit price set at a credit.", "score": 1, "replies": [{"body": "Thanks for the call out! Hahahaha I was like what lock, then found it and was like yup too good to be true..", "score": 1, "replies": [{"body": "No problem! Mystery solved ;)", "score": 1, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "inzgls", "created_utc": 1599447083.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "Buying airline calls for 9/11. How ironic.", "score": 11, "replies": [{"body": "I know the irony hurts. But premiums are less than $100 and less than 2% OTM", "score": 2, "replies": []}]}, {"body": "What’s the Friday news", "score": 2, "replies": [{"body": "Highest travel numbers since March, and pending bail outs for the industry. Another stimulus check and more efficient COVID testing could be bullish for airlines.", "score": 2, "replies": [{"body": "I think you forgot an airline related event on Friday", "score": 1, "replies": []}]}]}, {"body": "Buy $SABR long", "score": 1, "replies": []}, {"body": "Will not happen in 2020 or even early part of 2021. Sorry.", "score": 0, "replies": [{"body": "It’s already tested the price multiple times in the last few months lol", "score": 1, "replies": [{"body": "Same here. Timing can be wrong but stats on travelling passengers is provided from SFO airport on weekly basis.", "score": 1, "replies": []}]}]}, {"body": "AAL getting headlines with the whole BLM pins thing, I would stick with LUV", "score": 0, "replies": []}, {"body": "Long term I’m assuming bullish for AAL but I’m seeing a descending triangle on the 4 hr chart", "score": -1, "replies": []}]}
{"title": "GameStop Earnings Call?", "selftext": "I’m new to trading it’s been about a week, went in on apple and lost all profit and debits on two calls i made during their crazy surge to 120s. Made profit on Gamestop put a few days after but webull screwed me over and i couldn’t sell but anyways their earnings are coming up very soon and they’ve been at their highest stock price this september so what do you think will happen once earnings release?", "id": "io5grt", "created_utc": 1599476570.0, "score": 4, "upvote_ratio": 0.63, "num_comments": 12, "comments": [{"body": "cancelled my sell put. Didn’t realize earning was this week", "score": 5, "replies": []}, {"body": "gamestop is unpredictable.  everyone knows this company is on it's way out the door.  but its also reflected in it's insanely low stock price.  theres not much more room for it to fall short of bankruptcy.  I personally they'll survive this Q due to a boom in gaming.", "score": 2, "replies": [{"body": "surely", "score": 1, "replies": []}]}, {"body": "It will fall and hard", "score": 3, "replies": []}, {"body": "This post didn't age well", "score": 1, "replies": [{"body": "STOP.", "score": 1, "replies": [{"body": "Lol.", "score": 3, "replies": [{"body": ">price\n\nLol.", "score": 1, "replies": []}]}]}]}, {"body": "$5 put too low?", "score": 0, "replies": [{"body": "i’m looking for it and i’m honestly tempted but last month they were averaging $4 and september started they skyrocketed to 7 and held since so it’s not too far off.", "score": 2, "replies": []}]}, {"body": "IV crush?", "score": 0, "replies": [{"body": "yeah", "score": 1, "replies": []}]}]}
{"title": "VIX options risk", "selftext": "[deleted]", "id": "ioct20", "created_utc": 1599502625.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 11, "comments": [{"body": ">  since you can't cash out prior to expiration  \n\nYou can't exercise early, but you can definitely sell to close and cash out.\n\n>  however they trade cheaper (realtively) as a result ? \n\nThis is true in theory, but in practice, the ability to exercise early doesn't add much advantage to the long holder where there is no dividend involved, hence European style options are priced similarly to American style options. As far as I know B-S model actually prices European style options, and is used as a good approximation of American style options as well.\n\n&#x200B;\n\nVIX options are different than most other options, **because they're not priced based on the VIX's current price**. **They're prices based on the /VX futures contract value that expires right after the Options expiration date**. This is because the VIX value is expected to be trading at the /VX value by the expiration date.\n\nAn example: In November 18th, the ATM VIX option (where the price of the call \\~ price of the put) is between 32.5 and 35.00 while VIX is trading at $30.75. This is because the November /VX futures (/VXX20) are trading at 33.72 and this is the number November VIX options are priced based on. **This is also why you can't do calendar spreads on VIX**. Since the front and back expiration are priced based on different products.", "score": 5, "replies": [{"body": "Potentially splitting hairs here - but one can sell an option in VIX (say an October Call) and buy an option in VIX (say a November Call), which is \\*similar\\* to a calendar.  As you mention, though, they are on different futures.  They are also quite margin-intensive and while I wouldn't recommend them for everyone, can be a good way to play the VIX futures curve.", "score": 2, "replies": [{"body": "That's correct if you're approved for selling naked. However, this is not recognized as a calendar spread by your broker and doesn't have the same P/L characteristics as a calendar spread either. It might be similar in some situations, but the risk is huge if we have a sudden crash like in March 2020. Front month VIX went to the moon, while back months stayed low.\n\nFor example, on March 24th /VXH20 (march expiration) was trading around 82, while /VXJ20 (April expiration) was at around 47, then the /VXX20 (November expiration) was just above 25. That's why the risk profile is not technically a calendar-like. It can blow up when unprecedented events happen.", "score": 2, "replies": [{"body": "Agreed. While I haven't gone through my entire trade history to back this up quantitatively, I expect I've done more long front, short back month trades in VIX than the opposite, given the way the futures tend to move.", "score": 1, "replies": []}]}, {"body": "The reverse calendar spread (long front month put, short second month put) is covered quite extensively in Rhoads \"Trading VIX derivatives\". I believe there is a new edition coming out very soon.", "score": 1, "replies": [{"body": "Listened to Mr. Rhoads quite a bit on his podcast appearances of Volatility views, but haven't (yet) read this book by him... Worth the read?", "score": 2, "replies": [{"body": "I benefited from the book but it's material is fairly basic for someone who understands that VIX options are priced according to the futures and understands futures and basic options strategies. The various techniques he presents for exploiting the tendency of the front month future to decline as it approaches expiry through the use of futures spreads, reverse calendars and mixed futures and options are an interesting addition. There's a new edition of the book out soon which apparently will have some significant additions.", "score": 2, "replies": [{"body": "Excellent, thanks for the thoughtful review/response!", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I can't answer that. No one knows which will turn out to be better at the end. Volatility is inversely correlated to the market, this is generally true. However, there are periods of time where volatility expands when markets are going up (the last two weeks for example). So there is no guarantee. Volatility products can be used to hedge against a major drop (December 2018, March 2020 like drops) where drops are accompanied by fear which is in turn reflected in volatility going up.\n\nIf you want to straight up bet against the s&p 500 then shorting /ES or /MES are your straight forward products. You just need to be mindful of the large notional value you're controlling (/ES is 50SPX or around $175,000 and /MES is 1/10th of that). You can also buy puts SPY or SPX.\n\n \n\n>I've been reading some articles saying vix calls can still be profitable even if the market goes up cause the markers are expected to be very volatile leading up to the election\n\nDifferent people expect different things. The markets are expected to be volatile going into election, that makes sense but this expectation is reflected in /VX already. The question is will the markets be more volatile than expected?\n\nMy conclusion here is I don't know, and probably no one knows what's exactly going to happen. I, and everyone else, can answer questions on how different products work, and you can translate that into positions based on your thesis about market condition.", "score": 3, "replies": []}]}]}, {"body": "You can sell the options at any time.", "score": 4, "replies": []}, {"body": "This may be helpful:\n\n\nhttps://www.reddit.com/r/options/comments/ikocya/vxx_options_vs_vix_options/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 1, "replies": []}]}
{"title": "Stock Market Rotation", "selftext": "What are people’s thoughts on a rotation out of tech into other sectors, like financials? It seems like it could be happening now, but I also could be a head fake too.\n\nI have exposure to tech and Covid recovery plays, but feel like I’m missing the financial sector a bit, and it seems promising, though a recession will likely hurt the financial sector. I’m a bit torn and would love outside perspective!", "id": "io9gju", "created_utc": 1599492449.0, "score": 10, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "You could buy some jpm share, the trading revenue help a bit.", "score": 2, "replies": []}, {"body": "Apparel retail. I recommend JWN and RL. Solid companies with healthy balance sheets.", "score": 2, "replies": [{"body": "You're not worried about competition from direct-to-consumer brands that offer superior quality and fairer prices?", "score": 1, "replies": [{"body": "RL is just that so I assume you’re talking about JWN. JWN is all about convenience. It’s easier to go to one place that has the best of many different quality brands rather than visit 7-8 stores each of which only sell their own brand", "score": 1, "replies": []}]}]}, {"body": "You realize that every major financial ticker depends on tech one way or another..... being more realistic would be to make a statement saying that wealth will shift to commodities as the rise for resources is always grow. But once again tech comes into play with innovative and “green” ways to obtain reusable resources..... FYI tech isn’t going anywhere but up", "score": 3, "replies": [{"body": "I’m not fully understanding this comment, but i would like to! Can you elaborate on how the way financials use tech isn’t already priced in? Is there more growth for tech in the financial sector? I appreciate the response!", "score": 3, "replies": []}, {"body": "lol....\n\nThe critical part of investing you're failing to grasp is valuations.  Tech financially will keep growing, but because it's gotten so stretched by it's valuations it very well could plummet.", "score": 3, "replies": []}]}, {"body": "Yes, while everyone else is chasing tech, I think the more traditional sectors are where the money is at right now.  Tech is great right now if you are trading, but if you're looking to stake out long term positions, I'd avoid the big hyped tech names, although there are a few names in tech that I think are really undervalued, it's just they've avoided the hype train.\n\nThe thing I worry about with financials is just people's inability to pay mortgages during this, and businesses going belly up.", "score": 1, "replies": [{"body": "I actually forgot Warren Buffet was selling some of his financial stocks, and he did start a small position (for him) in a gold minor (GOLD). I’m not loving that sign for the economy. But I have to think tech cannot keep rising like crazy. I know people say that it can, because they’re the safe stocks and there is no where else to put your money...but there kind of is, if you’re worried about a crash. It’s call gold and silver, haha.", "score": 0, "replies": [{"body": "Some of it was redistribution, he seems to like BAC way more than the other banks.  The gold miner was interesting.  People talked it up as a bet on inflation, but he sold way more stuff to move into cash.  \n\nBuffett also sold some Apple in Q1, and it wouldn't surprise me if he is selling more now.  \n\nI disagree with the entire notion about tech stocks being safe.  We've proven in 2000 and 2008 that people will bid them up over and over to insane levels, \"because they are the future\", and then when the correction hits they get hit hard.", "score": 1, "replies": []}]}]}, {"body": "Airlines, cruise ships?", "score": 1, "replies": []}]}
{"title": "Tech vs brick and mortar", "selftext": "One is expensive and at risk of crashing. The other is cheap and has already crashed. Sure, five or ten years from now tech stocks will probably have gained more than brick and mortar stocks. But what about one or two years from now? We’re looking at a vaccine coming.. people are longing to go back to pre-Covid lives.. that includes going shopping at malls. Yeah, malls were slowly dying before the pandemic began but the way I see it the storm will was away poorly operating malls while resistant, well running malls will survive. They don’t need to grow in order to see stocks recovering.. they just need to approach normal levels of revenue. What happens when shoppers have been locked up for a year and suddenly are allowed to roam free? They go nuts. They shop like never before. \n\nI’ve recently sold everything AMZN, APPL, AMD, TSLA, MFST and bought JWN, KSS, M, DDS. Am I a fool? You tell me.", "id": "iofrlc", "created_utc": 1599511662.0, "score": 2, "upvote_ratio": 0.67, "num_comments": 16, "comments": [{"body": "You’re assuming everything will go back to the way it was. Never underestimate your lack of ability to see the future properly. That’s not a knock on you but a knock on speculation in general.\n\nNothing wrong with taking profits but I’m not sure I would’ve shifted out entirely out of tech to go into retail. Retail has been dying for years, long before COVID. Now, a couple of those might be fine but I’d lay even money at either Macy’s or Nordstrom’s file for bankruptcy if we go through another holiday season without any vaccine in sight.\n\nMy 2 cents.", "score": 6, "replies": [{"body": "Agreed. Online businesses have seen widespread adoption and it’s going to be hard to reverse that once we have a vaccine. Furthermore, due to constant innovation in tech there’s really no reason to sell off an entire position.", "score": 1, "replies": []}, {"body": "There will be a shift, but I'm not always certain that it will be as big as people want to believe.  There will be a massive shift where some businesses are out, and some news ones are still opening, but the constant is human nature.\n\nZoom is nice and all, but it's not going to replace face to face contact, people are social creatures, and are sick of being stuck home.  They yearn for things to go back to the way they were.", "score": 1, "replies": []}]}, {"body": "One is expensive becuase the companies print money, the other is cheap becuase the companies are going bankrupt.", "score": 2, "replies": [{"body": "I bet you said that in 2008 too. Look at what happened back then to RL, HM, JWN etc", "score": -1, "replies": [{"body": "There isn't going to be a cycle away from tech as an industry. Technology is in every single sector, its the companies within each sector that adopt the tech which are the winners. Is RL comes back again it will be becuase they adopt ecommerce and technology to do so. \n\nWe aren't going to cycle back around and suddenly everyone wants tobacco and oil again.", "score": 2, "replies": [{"body": "RL digital sales surge year by year. Of course they’re adapting.", "score": 1, "replies": []}, {"body": "Tech will grow it's earnings, but fundamentally it's gotten massively overpriced.  People are surging after Apple like it's some massively growing company, but it's only averaged 5% yearly revenue growth over the past 3 years.  That's really quite disappointing, tons of sectors are outperforming Apple's growth, and have 1/4 of the PE.", "score": 1, "replies": [{"body": "I don't disagree with any of that. My point is people need to understand why companies are highly-priced and that just because a company has a low PE doesn't mean its better value, it could just easily mean it's simply a struggling business.\n\n&#x200B;\n\nSony has a PE of 17 compared to Apple at 35. I still know where id rather put my money.", "score": 1, "replies": [{"body": "They get overpriced because people have hyped them up to insane levels.  Look at all these new investors, the first thing they buy is Apple and Tesla.  They are helping bid up the stocks to insane levels.  And with Apple's massive runup it's going to fall hard.  It's already down 15% from it's ATH earlier this month.", "score": 1, "replies": []}]}]}]}, {"body": "Nordstrom and HM has been in decline for half a decade. RL has been in decline since 2013. Not helping your case.", "score": 1, "replies": []}]}]}, {"body": "People like to think in black and white terms and act like it's going to be one or the other. It's not and most stores have an e commerce aspect.  Both will exist and the remaining brick and mortar stores will flourish and adapt, a lot of the crappy ones will die off. Invest in good companies, both online and brick and mortar.", "score": 1, "replies": []}, {"body": "Brick and mortar retail? Ew.", "score": 1, "replies": []}, {"body": "I think getting out of the big tech names though is good, because I'd feel pretty confident with saying they'll probably be lower in 2 years.  \n\nI think there are better places to put your money though than trying to bottomfeed on a brick and mortal retail rebound.  It could happen, or it could be brutal.  IMO, the better play is to flip to more traditional sectors, but ones that are making money, Financials/ Healthcare/ Industrials.  Many of them are still financially strong enough to still pay dividends, and will return to stock buybacks while the brick and mortal will still be busy trying to dig itself out from it's debt.", "score": 1, "replies": []}, {"body": "you’ve just bet on the past and thrown the future away!! 🤨", "score": 1, "replies": []}, {"body": "Brick and mortar stocks? Is that a thing you just made up? Because it doesn't really make sense. Any company can sell their products online.", "score": 1, "replies": []}]}
{"title": "Market Recap for Monday Sept 7 2020. PLEASE ENJOY!", "selftext": "**Psycho Market Recap - Monday, September 7, 2020**\n\n**Summary**\n\nToday the markets are closed in observance of labour day.\n\nSince the close of the markets on Friday, there was a discussion that brewed up on Wall Street about a whale that had made a huge options play in the realm of $4 Billion across the last months in popular big tech stocks according to the Financial Times. However, all this news didn’t seem to impress investors as Softbank stock has slid 7% since the news broke.\n\nThis news about Softbanks options purchases has sparked further reports about a stock market rally in big tech stocks that has been caused by a surge in options buying from retail traders according to Benn Eifert, chief investment officer of hedge fund QVR Advisors as written in a Bloomberg article. The same articles goes on to cite that retail traders, in comparison to Soft Bank’s $4 Billion purchases, retail traders have poured an incredible $40 Billion in Option trades across the same period of Late June to end of August on the same type of stocks. The hypothesis is that with such a large percentage of these calls expiring in weeks, the writers had to buy the stock in order to cover themselves which caused the rally.\n\nAnother big news that broke over the weekend was that Tesla Inc. ($TSLA) was not included in the S&P500. Three companies were added: Etsy ($ETSY), Catalent ($CTLT) and Teradyne ($TER) to the S&P500 index. The ones that were taken out are: H&R Block ($HRB), Coty ($COTY) and Kohl’s ($KSS).\n\nOn other news, there are alarming reports coming out of India that Coronavirus cases are rising out of control reaching 4.2 Million, with many expecting it to overtake the U.S. as the global epicenter which is currently sitting at 6.3 Million cases.\n\nLastly, China export numbers for the month of August beat expectations rising 9.5% from a year ago, which is the largest increase in 18 months according to Reuters.\n\nStimulus talks continue to develop at a slow pace, and the election is moving forward as planned.\n\nThoughts of a Psycho Trader….", "id": "iogc5r", "created_utc": 1599513372.0, "score": 93, "upvote_ratio": 0.96, "num_comments": 15, "comments": [{"body": "Man, I really thought the content of this post was gonna be \"lol jk the market's closed you dummies\"\n\nI'm kinda disappointed, but also kinda not. Lol", "score": 44, "replies": [{"body": "Hahaha", "score": 7, "replies": []}]}, {"body": "Actually good info, thanks!", "score": 16, "replies": [{"body": "Thank you for the feedback", "score": 4, "replies": []}]}, {"body": "Stonks go up", "score": 8, "replies": [{"body": "Yeahhh! #bullish at least on the long term", "score": 7, "replies": []}, {"body": "This didn’t age well", "score": 1, "replies": []}]}, {"body": "Loved this, thank you for sharing :)", "score": 4, "replies": [{"body": "Thank you for the feedback!", "score": 3, "replies": []}]}, {"body": "Great info, thank you!!", "score": 2, "replies": []}, {"body": "Who cares if the cases go up?  Talk about moving the goal posts.  Mortality rate is still going lower and lower.  Not even a 1% mortality rate, so I guess you gotta make a big deal about the cases count now.", "score": 2, "replies": [{"body": "I mean, they are important because the case count is what has been prompting economies to shut down which is, imo, where the real damage has been done. I agree mortality rate is pretty low and getting better.", "score": 2, "replies": []}]}, {"body": "$EVFM!", "score": 1, "replies": []}, {"body": "Come on PTON and CHWY!", "score": 1, "replies": []}, {"body": "Thanks for posting!", "score": 1, "replies": []}]}
{"title": "What would you do with 20k?", "selftext": "Hey guys I’m 23 and have all my money in QQQ besides a couple shares of Apple and AMD.\n\nWould it be a good idea to just pump money into QQQ while I’m young then once I get older switch over to VTI+VXUS to play a safer route (40 years old).\n\nMixed answers a lot and not that QQQ dropped a bit, I have about 7k to dump in but I am interested in other opinions regarding diversity. Thanks guys and happy Labor Day.", "id": "io1llh", "created_utc": 1599456209.0, "score": 3, "upvote_ratio": 0.8, "num_comments": 12, "comments": [{"body": "I’d diversify out a bit. Not saying we are, but say we are in a bubble that somewhat mirrors the tech crash. It took like 15-16 years for Nasdaq to recover the highs of 2000. That’s a damn long time and probably part of the reason why QQQ has done so well. When you zoom out, it’s not as great. \n\nVTI is a solid choice for the remaining funds.", "score": 6, "replies": [{"body": "Since I am younger, I really don’t mind the risk. Have 10k in a HYSA for emergencies. I have 13k in QQQ and dumping 7k in on the next trading day. Willing to put an 70/30 split on QQQ/VTI. It’s what I had before, before I went all in QQQ.", "score": 1, "replies": [{"body": "Yea, 70/30 is better than 100%. And yea, you can def handle risk but at the same time, the goal is to make money. If you want to risk up, the goal should be relatively high beta, but still no reason to be so concentrated in one sector if there are growth opportunities elsewhere.", "score": 6, "replies": [{"body": "I love when level-headed, mature advice comes from someone who has a screen name that makes him seem 15 years old", "score": 3, "replies": [{"body": "Haha!", "score": 2, "replies": []}]}]}]}, {"body": "Most people miss the point and have such short horizons.", "score": 1, "replies": []}]}, {"body": "Fb, nvda", "score": 2, "replies": []}, {"body": "Ma aapl msft", "score": 2, "replies": []}, {"body": "I’d actually take on the risk while young and go with QQQ...then move on to VTI when you’re older and need to adjust risk tolerance", "score": 1, "replies": [{"body": "Yeah will most likely do this.", "score": 1, "replies": []}]}, {"body": "10K Bitcoin, 6K ETH, 4K Chainlink. Will be worth 500K on 3 years.", "score": -7, "replies": []}, {"body": "Put it all on Shopify. This stock will outperform almost everything else  at that valuation and above", "score": -9, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "io3n1l", "created_utc": 1599466528.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 11, "comments": [{"body": "Everything you know today about nvidia is already priced in.", "score": 11, "replies": []}, {"body": "If I knew I would go all in for a quick 10% swing.\n\nGood news usually means shit drops like with earnings", "score": 3, "replies": []}, {"body": "You bought 100 shares @ $10 each (putting in $1000).\nYou sell 10 shares @ $20 each (pulling out $200).\n\nYou'll get taxed on the profit on a per share basis, so, $200 -$100 = $100 profit.\n\nHowever, if you later sell 90 shares @ $9, then you get a profit of $810 - $900 = -$90 (ie, loss)\n\nSo come tax day, you'll owe taxes on $100 - $90 = $10\n\nSo you are taxed on your net profit across all trades on all stocks.\n\nP.S: watch out for wash sale rule.", "score": 3, "replies": [{"body": "Can you elaborate in wash sale rule?", "score": 1, "replies": [{"body": "https://www.investopedia.com/terms/w/washsalerule.asp", "score": 2, "replies": [{"body": "Cheers bro", "score": 1, "replies": []}]}]}]}, {"body": "You asked about taxes.  Until you sell something and realize a profit, there's nothing to tax.", "score": 3, "replies": []}, {"body": "Of course you’re going to get taxed", "score": 2, "replies": []}, {"body": "Stock price would only change if they sale much more than people anticipate. And they already expect good sales. It may go down if the cards are unexpectedly worse than they announced or have unexpected flaws", "score": 2, "replies": []}, {"body": "Is your pullout game strong though?", "score": 1, "replies": [{"body": "Classic Reddit answer would be: \"Ask your Mom.\"", "score": 1, "replies": []}]}]}
{"title": "CRM Long Term", "selftext": "[deleted]", "id": "ioatzr", "created_utc": 1599496620.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 15, "comments": [{"body": "I don't throw around the term \"sure thing\" very often but $CRM is just that for the long term. Easiest investing decision I ever made.", "score": 3, "replies": [{"body": "Yeah but what about todays evaluation. Its easy to say best investing decision I ever made 6 months ago, or a year ago.", "score": 1, "replies": []}]}, {"body": "At these levels, none of them.  CRM and SHOP are the obvious choices.  But these stocks are at least 30-40% overvalued in my opinion.  I will look to open a position in CRM around 190 and SHOP around 600.  I am ok if I miss out completely.  Plenty of fish in the sea which are much better valued and have significant upside.", "score": 3, "replies": []}, {"body": "I was thinking about investing in Salesforce but then researched CRM and realized that Microsoft lurks in that product category with their Dynamics product and decided to buy more Microsoft instead. Microsoft has the knack of rolling up a snowball of products and steamrolling smaller competitors (i.e. Netscape vs Internet Explorer, soon Microsoft Teams vs Slack and/or Zoom, and in my opinion Salesforce is in their crosshairs). Microsoft is the elephant in the room, always. \n\nI do have Shopify (SHOP) as a major position in my portfolio and don't think it will be steamrolled by Amazon. I would say choose SHOP over CRM.\n\n[MSFT Dynamics versus Salesforce ](https://www.akaes.com/blog/7-big-reasons-why-microsoft-dynamics-crm-beat-out-salesforce-as-the-enterprise-crm-suite-of-choice/)", "score": 2, "replies": [{"body": "It's been years since I last checked them out to be honest but Dynamics paled in comparison to Salesforce. It's not a current focus for them as well, so I can't see Microsoft heating things up much.", "score": 1, "replies": []}]}, {"body": "Awesome CEO, big time-game changing acquisitions, long term tail winds from coronavirus, great business model, and becoming more and more diversified every year.\n\nCRM is still a buy , and still has plenty of growth potential. I have been extremely bullish on them for the last 2-3 years, and have seen stunning returns.  I’m not taking any profit anytime soon.", "score": 3, "replies": [{"body": "Ive been doing research on them ever since I started using it at work.\n\nAt this point, it doesnt seem like there is another CRM out there that can even touch Salesforce. Is the moat too big at this point to even welcome healthy competition?\n\nAlso do you think their current eval makes sense? People seem pretty divided.", "score": 3, "replies": [{"body": "Never underestimate the big players like Microsoft Google etc. Anytime they sniff out a competitor, they are aggressive at stomping them out or acquiring them-or at the very least taking some market share in something that they could easily get into...\n\nThat being said, there will always be fierce competition-but I feel comfortable now. When I first invested in them a couple years ago, I was much less comfortable.  Now I feel extremely good about them.\n\nBut you’re right, I don’t see any immediate threats...but that’s usually how it happens haha", "score": 4, "replies": []}, {"body": "PS I honestly thought they would have been acquired by now when I first started investing in them.  It makes me wonder if someone is working on a competing platform, or if everyone was asleep...", "score": 3, "replies": [{"body": "Your first reply had me convinced CRM was the right addition to my portfolio, but now im not so sure!\n\nGoing to have to continue doing my DD, but I appreciate your responses!", "score": 2, "replies": [{"body": "That’s the way to be!  Take everything with a few grains of salt!", "score": 2, "replies": []}]}]}, {"body": "May be at a premium, but much of big tech is...How can you value something that is disruptive, acquiring new businesses hand over fist, and ever-evolving?  Of course there is risk in all these activities, but I see the reward being pretty well worth it...I have faith in Benioff as the CEO.\n\nIf you have a position in CRM, I would treat it as a ‘semi-speculative’position in regards to portfolio risk.  Balance accordingly.  If starting a position I would slowly limp into it, and not go guns blazing.", "score": 2, "replies": []}, {"body": "Hubspot is rising and a competitor, so is Zoho", "score": 2, "replies": []}]}]}, {"body": "I like CRM but as of right now it seems expensive and I think the price will hopefully drop during the week if the ‘bubble’ is popping.", "score": 1, "replies": []}, {"body": "Shop sells shopping carts to stay at home moms selling garbage to other stay at home moms. Big fucking deal. In the software world the barrier for entry for something like this is VERY small. Salesforce selling a platform for real businesses. They have 2 different platforms for shopping (demandware b2c and cloud craze b2b). And beyond that they’re acquiring software systems that will run the backbone of businesses - MuleSoft, tableu and my guess of Snowflake at some point). CRM is more akin to Microsoft and Oracle than it is to SHOP", "score": 1, "replies": []}]}
{"title": "This weeks time-in, is Tesla a good buy right now?", "selftext": "Considering the drops right now and tesla might getting into s&p 500 soon, also Giga Berlin it has the potential. But i could also still fall consedering the price is still pretty high compared to august. Well i guess it wouldnt be tesla if it would be easy to predict.", "id": "iob0vf", "created_utc": 1599497203.0, "score": 0, "upvote_ratio": 0.17, "num_comments": 15, "comments": [{"body": "I’m not one to bet against musk. I’m not that smart.", "score": 4, "replies": []}, {"body": "It should probably drop to $300 or less, but it's just as likely to go back up to $500 so your guess is just as good as anyone else's.", "score": 3, "replies": []}, {"body": "Telsa stock right now is probably significantly overvalued. I would recommend easing your way into the stock if you really want to buy in. And have a game plan if the stock were to drop. Average down or cut your loss. And a company getting into the S&P 500 doesn't mean the company will have success", "score": 2, "replies": []}, {"body": "If you think getting into the S&P500 is like a pouring gasoline on a stock, why aren’t you buying Etsy?", "score": 1, "replies": [{"body": "Thats not what I think tho.", "score": 1, "replies": [{"body": "> and tesla might getting into s&p 500 soon,\n\nYou just listed this as a reason why you would invest in a company but are now ruling out other companies that meet the exact same criteria because you have some kind of weird crush on Elon Musk and/or make you investment decisions more like a stan than an adult.", "score": 1, "replies": [{"body": "I just wouldnt call it \"pouring gasoline on a stock\", but rather giving another foundation on which the stock can grow, because the stocks in the s&p have a certain reputation.", "score": 0, "replies": [{"body": "Then I’m still asking my same question. Tesla wasn’t added to the S&P500 on Friday. Three other companies were. Why aren’t you asking about them?", "score": 1, "replies": [{"body": "Because we have seen a drastically higher growth potential in Tesla, kind of the best bang for your buck. On the other hand overvalued and risky investment choice.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "its so funny watching EVERYONE guess what tesla is gonna do..they seem super overvalued but undervalued at the same time....im staying away from that roulette of a stock and investing in cruises baby!", "score": 1, "replies": [{"body": "I have a stupid question, I saw this stock at 2000 dollar last week and now it's 400\n\nWtf happened", "score": 1, "replies": [{"body": "it spilt , if you owned one share (2000$) you got back 5 shares (400$) ...it did a 5-1split on  aug 31", "score": 2, "replies": [{"body": "Oh makes sense, thanks.\n\nI just got so confused, I thought I lost so much money and now I am relieved.\n\nThanks, i can breathe now.\n\nInvested back when it was 450-500.", "score": 1, "replies": []}]}]}]}, {"body": "Its questions like this that has made Tesla so over valued to start with agree with others if you care about s&p then what about others companies on the edge of being added or that were added recently.", "score": 0, "replies": [{"body": "Overvalued based on present fundamentals. But if you want to speculate and assume that Tesla will somehow incorporate all of Elon's other projects like SpaceX and Neuranet at some point, then it's probably undervalued assuming those projects will be profitable.", "score": 1, "replies": []}]}]}
{"title": "Donation for food", "selftext": "So last month I lost around $90.000 shorting gold. I saved this money for more than 8 years and I'm totally hopeless. I don't want to work anymore. I'm drunk and high af for 2 weeks but now I'm so broke I can't afford to order a pizza. I have $7 on my bank account. Looking for some donation to buy some food, before I prepare to be homeless. \n\n(Link to loss post : https://www.reddit.com/r/wallstreetbets/comments/hz5idt/the_comedy_how_i_lost_all_my_money_in_two_hours/?utm_medium=android_app&utm_source=share\n )\n\nI'm not expecting too much money, but if you have some spare coins, I leave here a link.\n\nIf you think it's a scam or you just want to write some humiliating post, that's alright. The last thing I want now is to fight with you.\n\nThank you\n\nhttps://www.paypal.com/biz/fund?id=XCYV4ENT3LBT4", "id": "iogisr", "created_utc": 1599513929.0, "score": 0, "upvote_ratio": 0.21, "num_comments": 13, "comments": [{"body": "You gambled all of your money away, spent the last bit on weed and alcohol, refuse to get a job and are asking strangers for money to support you?\n\nPick yourself up and get a job. You should have a new-found respect for hard earned money. This isn't the end of the world. You can make it through this, but you need to work for it", "score": 5, "replies": [{"body": "Well, you know things change when you lose 8 years of hard work in a single day.\nI wasn't negative and useless before. Now I just don't care", "score": 1, "replies": [{"body": "How the fck did u lose 90k in 1 day", "score": 1, "replies": []}]}]}, {"body": "Little caesars is $5 a pizza", "score": 5, "replies": []}, {"body": "This needs to be pinned for everyone who thinks they’re a whiz because they made 50%+ return in 6 months.", "score": 4, "replies": []}, {"body": "Why did you have all of your money in there anyway?", "score": 2, "replies": [{"body": "That comment is super counterproductive. It‘s like yelling to a kid who broke his arm playing in the backyard why it didn‘t pay attention.\nIt happened, now is the time to look forward to how he will be able to come out of this mess without killing himself.", "score": -1, "replies": [{"body": "It’s not the first time he’s done this and it’s clearly a fake post.", "score": 3, "replies": [{"body": "What are you talking about? I never asked any money from anywhere and I'm barely using Reddit. This is a true story and I thought maybe I can collect a few dollars. \nNevermind", "score": 1, "replies": [{"body": "It such an easy stunt to pull but nice try bro. Anyone would be a fool to donate money to a randomer online without a legitimate reason.", "score": 1, "replies": []}]}]}, {"body": "Thank you for understanding. \nThe perspectives change when you lost many years of hard work in a single day.\nI mean..8 years(!!) of heavy saving. Buying the cheapest things, saving every penny on food, always looking for price reduces! \nJust seems so surreal all gone. Possibly I'm depressed and I'm not the same person since", "score": 1, "replies": [{"body": "You will find a way to get it back eventually, and make more. Just don‘t give up pal", "score": 1, "replies": []}]}]}]}, {"body": "Classic small feet pets", "score": 1, "replies": []}]}
{"title": "Possibility of AMZN.B?", "selftext": "With all the recent hype of stock spilts, people are hoping for amazon to join the train. But I just don’t see Bezos doing a split. Shares outstanding is around 500M and I think Jeff wants to keep it in that range or lower. I think it’s more likely he would make a class B AMZN stock (similar to brk.b) thoughts?", "id": "iohu5c", "created_utc": 1599518472.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 10, "comments": [{"body": "I think the days of stock splits are coming to an end. Many brokers allow fractional share purchasing and the holdouts eventually will too or they will lose new customers. \n\nSo with that said Berkshire did a class b so the average investor could partake, but there is no need in 2020 for Amazon to do the same because fractional shares make it affordable to anyone.", "score": 6, "replies": [{"body": "I get that. However a lot of investors don’t like owning 15.9726 shares of a stock.", "score": 5, "replies": [{"body": "Most already do if you own an index fund", "score": 6, "replies": []}]}, {"body": "Genuine question because I never understood, what's the benefit of owning partial shares? Just being able to own something, even if it's partial?", "score": 2, "replies": [{"body": "The same benefits of holding 1 share at whatever fraction you hold. .5 shares = .5 of the dividend per share, growth per share, ect ect... it does compound growth faster, really, in the long term.", "score": 3, "replies": [{"body": "Thank you! I didn't realize fractional shares got all the same benefits as full shares", "score": 2, "replies": [{"body": "Sure! They certainly do! Minus voting rights, perhaps, but that wouldn't make a difference anyways.", "score": 3, "replies": []}]}]}]}, {"body": "Agreed, but splitting stock is good for options traders. Opens up the door for covered calls to earn some extra money while holding the stock. Doing covered calls on amazon at its current price would require about 350k for 100 shares.", "score": 1, "replies": []}]}, {"body": "Meh. I don’t see the need to let fickle investors in to make it more volatile. They can buy it through cheaper ETF shares if they want it.", "score": 1, "replies": []}]}
{"title": "Whats the deal with Marketwatch today?", "selftext": "Did anyone else see these articles from Marketwatch a few hours ago? They know the market isn't open today, correct? Makes me question if what I've read in the past from them holds any merit. Looks like they caught the mistake at least and took the articles down\n\nhttps://www.marketwatch.com/amp/story/tesla-inc-stock-rises-monday-outperforms-market-01599510323\n\nhttps://www.marketwatch.com/amp/story/netflix-inc-stock-falls-monday-underperforms-market-01599510328", "id": "ioidx8", "created_utc": 1599520530.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 12, "comments": [{"body": "more proof the stock market is just a myth", "score": 14, "replies": [{"body": "someone in publishing is pissed because some dumbass just sent to print next weeks news.", "score": 2, "replies": []}]}, {"body": "Sites like marketwatch and fool all have these daily auto generated “articles.”  “Stock A rose/dropped X amount Monday morning, is up/down over Y period against the S&P 500 blah blah blah. Here’s an advertisement.”", "score": 13, "replies": []}, {"body": "This is interesting because articles can be several days old by the time we read them", "score": 3, "replies": []}, {"body": "Those “articles” are just auto pushed. I assume they got pushed out at normal market close time even though it was closed. “Such and such underperforms market.” Thanks for the insight 🙄", "score": 5, "replies": [{"body": "I'll take that eye rolling face with a grain of salt... they don't get auto pushed on a Saturday or Sunday and I'm assuming ONE person over there is smart enough to know today was a holiday. Just thought it was interesting", "score": 0, "replies": [{"body": "Obviously they don’t get pushed on the weekend. Someone let them get pushed today and then the articles got deleted. They are absolutely just pushed with very slight variations.", "score": 1, "replies": []}]}]}, {"body": "They took the articles down.", "score": 1, "replies": []}, {"body": "Shows you how much value you should put in their publications!", "score": 1, "replies": [{"body": "My thoughts exactly!", "score": 1, "replies": []}, {"body": "I think this was a technical error, but still, these kinds of articles are pretty useless.", "score": 1, "replies": []}]}, {"body": "They're bot articles. They use the most recent data, so Friday, and create the article.", "score": 1, "replies": []}]}
{"title": "Amzn stock", "selftext": "[deleted]", "id": "ioiqa0", "created_utc": 1599521791.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 17, "comments": [{"body": "lol. if we knew what the stocks are going to do we would be rich!", "score": 16, "replies": [{"body": "Some of them would still fuck it up and end up broke", "score": 4, "replies": [{"body": "probably be me.", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 3, "replies": []}, {"body": "Amazon could be considered overvalued right now but if you’re gonna hold for years, wait and see if it continues going down tomorrow or not.", "score": 3, "replies": []}, {"body": "50/50 chance", "score": 2, "replies": []}, {"body": "Amazon or not, as long as you’ve done your due diligence and are willing to risk the sum of money by investing in a company Buy what you want & forget about it. \n\nDo not worry that much about the share price. Instead monitor the news regarding the company such as future growth plans, prospects etc. In the long run, the price and expectations should converge and follow the long term trend.", "score": 1, "replies": []}, {"body": "How long have you been waiting? The price it dropped to is what it was trading for two weeks ago.", "score": 1, "replies": []}, {"body": "Buy it, and hold it for as long as possible. In the next 15 years amazon has some incredible things planned.", "score": 1, "replies": []}, {"body": "It's always a good time to buy Amazon.", "score": 1, "replies": []}, {"body": "> Will it keep going up starting Tuesday or is it going to keep dropping for the next little bit\n\nWhat makes you think anyone can possibly answer this?", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Did they announce a split?", "score": -2, "replies": []}]}, {"body": "Wait 3 months. The whole market is gonna tank and not even amazon will be insulated. Look for mid 2ks or dca down slowlyyyy", "score": -6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well my magic 8 ball says the market is going to go up. Feel better?", "score": 4, "replies": [{"body": "If you think the Fed pumping trillions into the market, weakening the dollar to unprecedented levels, is going to fix the shitstorm upon us you’re fucking crazy. 50-100 million Americans are (or will be) cash strapped due to no new REAL Fed stimulus in sight. Don’t get me started on the election, protesting, ripple effect of hospitality/retail/COVID. Job market isn’t going to bounce back overnight and desperation is months if not weeks away. Once mortgagers start to fall, the US economy will (which in turn means the global house of cards should too). \n\nYou think once you’re facing a how-will-I-put-food-on-the-table crisis people will be concerned with discounts on shit they don’t NEED? ALL miscellaneous spending will stop. And amazons PE will suffer. I love me some amazon like anybody else. I’m just saying btfd and be cautious in these uncertain times.  If you don’t like that sentiment, by all means yolo that shit.  What’s the worst that could happen?", "score": -1, "replies": [{"body": "🌈🐻", "score": 2, "replies": []}, {"body": "That money has to end up in the hands of the public and circulate for it to affect inflation. Its not.", "score": 1, "replies": []}]}]}]}]}, {"body": "Depends what you're looking to do/how long you will hold.  The problem is that even with a small dips, the valuations are still way out of whack.  IMO if you are looking to trade it, buy whenever you see it going up.  If you're looking to hold for 20 years, there will be better buying opportunities.", "score": -2, "replies": []}]}
{"title": "First Tesla Model 3 to Journey to Mount Everest from Shenzhen China in Total of 5500km", "selftext": "", "id": "inzhss", "created_utc": 1599447210.0, "score": 43, "upvote_ratio": 0.97, "num_comments": 12, "comments": [{"body": "A traveler from China made a breathtaking journey, in which he climbed Mount Everest with his Tesla Model 3 Long Range. The traveler successfully covered 5,500 kilometers (3,418 miles) on Highway 318: Shenzhen-Chengdu-Lhasa-Mount Everest.", "score": 8, "replies": [{"body": "Awesome!", "score": 2, "replies": []}, {"body": "Did he reach the summit?", "score": 1, "replies": [{"body": "people have to ice climb, i dont think even helicopters can make it, hence why they leave dead bodies up there", "score": 1, "replies": []}]}]}, {"body": "Epic. I’d only be worried about getting altitude sickness. The car doesn’t need oxygen but I do. 🤪", "score": 3, "replies": [{"body": "Actually that's a good point! How well would an air-sucking ICE car fare under these hypoxic conditions, I wonder!", "score": 3, "replies": [{"body": "Horribly. Power drops off badly at altitude- non-issue for a Tesla. 😎🚀👍", "score": 5, "replies": [{"body": "but that cold tho", "score": 1, "replies": []}]}]}]}, {"body": "Omg the charging infrastructure must be horrible?!", "score": 2, "replies": [{"body": "Article mentions there were no issues charging and due to the mountains milage was actually higher than normal.", "score": 1, "replies": [{"body": "No issues yes, but i was thinking he had to wait a lot since there’s no superchargers?", "score": 1, "replies": []}]}]}, {"body": "There are CHAdeMOs all over there, and one less than 100 miles from Everest base camp. He also said he charged nightly at every hotel stop. This story is not all that crazy.", "score": 2, "replies": []}]}
{"title": "Tesla Joins Cobalt Group That Supports Artisanal Congo Miners", "selftext": "", "id": "io92fz", "created_utc": 1599491197.0, "score": 50, "upvote_ratio": 0.96, "num_comments": 11, "comments": [{"body": "artisanal mining?", "score": 18, "replies": [{"body": "Microbrew rare earth minerals. Free range cobalt.", "score": 22, "replies": []}, {"body": "Means you can change more.", "score": 1, "replies": []}]}, {"body": "But is it dolphin safe?", "score": 6, "replies": [{"body": "The Deep says no", "score": 5, "replies": []}]}, {"body": "GODDAMN ETSY! They have everything these days... S&P inclusion, Artisinal Congo miners...\n\nWell played", "score": 3, "replies": []}, {"body": "Well, it’s not the S&P500, but at least Tesla is joining something!", "score": 2, "replies": []}, {"body": "Lol their PR is trying really hard to make mining a good thing.", "score": 1, "replies": [{"body": "Its a tough one. Mining isnt just low skilled labour, miners have built artisinal mills so to speak for crushing ore and sorting into different grades. The machine works faster than a hundred people, provides skilled jobs and relatively high income. Mining managers have gotten rich.\n\nIf we just take the ban artisinal mining route it basically means the profits from mining go to international companies, mostly chinese, and locals get no slice of the pie. Local mining is a cash injection to the economy and has potential if managed correctly.\n\nOther side of the coin is 15 year old kids getting buried in pits that collapse and dying. Its a nuanced issue, not simple by any means, and very difficult to police.Over 100k cobalt miners alone, good luck stopping them.", "score": 3, "replies": [{"body": "Dude this is exactly what every stupid idiot that repeatedly spouts Tesla uses children Miners and slave labor like a retarded parakeet forgets which both are completely false. Tesla just buys the cobalt off anyone and if anything they’re helping these people advance they’re not building these huge factories in remote parts of the world near villages and capturing children and indigenous people from them and forcing them to work in their factories until they die like Nike Apple and basically every clothing and electronic brand that has factories in remote parts of the world", "score": 3, "replies": [{"body": "Oh for sure, I mean Tesla doesn't even buy from these miners. Tesla buys from a refiner, like Huayou Cobalt. Huayou claims all its cobalt is spurced ethically, but these operations are enormous, and its very easy for them to buy cheap cobalt on the open market from artisinal miners.\n\nIts literally impossible to police, the country is vast. So tech companies cant do anything, so this is a better outcome, try and improve artisinal mining instead of pretending it can be regulated out of existence.\n\nMedia outlets demonise it, as if the exact same thing didnt happen in the US and Europe. Developing economies have all used miners at some point, its very lucrative", "score": 1, "replies": []}]}]}]}]}
{"title": "CNBC: Tesla could be the most dangerous stock on Wall Street, investment researcher says", "selftext": "[deleted]", "id": "iogj5e", "created_utc": 1599513959.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 10, "comments": [{"body": "He’s right. Tesla stock has already caused shorts to lose billions/", "score": 31, "replies": []}, {"body": "Tesla is the most dangerous stock......for shorts.", "score": 12, "replies": []}, {"body": "Having 2018-2019 FUD flashbacks.", "score": 6, "replies": []}, {"body": "Just more clueless claptrap.", "score": 4, "replies": []}, {"body": "Awesome. Encouraging more people to short setting up more short squeezes to boost price even higher!", "score": 3, "replies": []}, {"body": "Tesla very dangerous. Gonna bury all the legacy autos.", "score": 2, "replies": []}, {"body": "Hyuck hyuck hyuck yeah ok", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "thanks", "score": 1, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "iocege", "created_utc": 1599501414.0, "score": 2, "upvote_ratio": 0.67, "num_comments": 10, "comments": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Got it boss", "score": 1, "replies": []}]}, {"body": "Very much considering this play", "score": 2, "replies": []}, {"body": "I sold more puts on VXX just before close; why do you choose UVXY over VXX?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Sounds a little risky I don't have slot of capital tho so I might do credit spreads 25% under", "score": 1, "replies": []}]}, {"body": "Would you take assignment? Then hold? Or sell covered calls? Or would you just roll?", "score": 1, "replies": [{"body": "I'd take assignment and sell right after", "score": 1, "replies": [{"body": "I wouldn't take assignment of a leveraged ticker", "score": 1, "replies": []}]}]}, {"body": "You could do it but think of it as a hedge toward your long positions in the portfolio and not necessarily as a great trade idea in itself. Meaning, we assume that over the longer term volatility will continue to decline and market will continue to rise. So if you’re selling puts on UVXY or any other volatility product, you’re essentially signing up for a significant chance of the trade going against you. But, if the trade goes against you, then presumably there should be other (long) positions in your account which you are making profit on, so that profit should more than offset the loss on the UVXY/VXX type trades.\n\nAnd if something like last week happens, then your long positions in the portfolio may go red, but the UVXY position will go green, helping cushion the blow from the red day(s) in the market.\n\nIn the end, we should enter any trade with UVXY and similar products presuming that it is going to zero, and plan our risk and position size accordingly. So if UVXY is currently $25 and you sell a $20 put on it for $1, for example, you should do it with the full presumption that you may be assigned these shares at a cost basis for $19 and then lose that entire $1900 when UVXY goes to zero. But, again, as I explained above, if UVXY went to zero, then it would generally be because of bullish sentiment and some sort of stability coming into the markets, so in that case hopefully you made more than $1900 on your long positions than the $1900 you lose with UVXY. And yes, if after you’re assigned the shares at $19 in this example, and there happens to be some big market downturn and volatility spike and now all of the sudden UVXY is going for $100+ like it was during March crash, then you just made that bank.\n\nSo you have to keep all of these factors in mind when considering this sort of a position. You can also consider just buying some otm longer dated UVXY calls as a hedge instead to keep things simpler. They don’t have to go itm to pay, just look at some of the options’ price history and you’ll see the way otm calls on it get inflated by multiple times in many cases during a pullback and volatility spike... and you could sell for profit at those times. Otherwise, same as my above scenario, you expect them to go to zero and in that time the other positions in your account should make you more profit than what you lost on these calls going to zero.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> There is so much wrong with this\n\nLike now, 151 days later, or just in general from the beginning?", "score": 1, "replies": []}, {"body": "u/No-Proposal-2145 are you there? I hope you’re not going to make me wait another one-hundred and fifty-one days again :(", "score": 1, "replies": []}]}]}]}
{"title": "Undeniable evidence TSLA only goes up", "selftext": "", "id": "inyt1n", "created_utc": 1599444278.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 15, "comments": [{"body": "This is by far the gayest shit I’ve ever seen", "score": 13, "replies": []}, {"body": "I only trust DD from the Simpson’s", "score": 7, "replies": []}, {"body": "This is the dumbest crap I’ve ever seen", "score": 5, "replies": []}, {"body": "I don’t listen to people...\n\nWho pour water **from a water bottle** into a glass.", "score": 3, "replies": []}, {"body": "Ewww I fucking hate ticktock", "score": 2, "replies": []}, {"body": "I want my last few minutes back.", "score": 2, "replies": []}, {"body": "Tiktok.\nBan", "score": 2, "replies": []}, {"body": "TikTok, insta-ban pls mods", "score": 2, "replies": []}, {"body": "Gay Ban OP", "score": 3, "replies": [{"body": "he says as he buys tesla calls out the ass everyday going forward", "score": 1, "replies": [{"body": "I didn’t watch your gay video. MODS!", "score": 5, "replies": []}]}]}, {"body": "GAY! AND BAN!", "score": 1, "replies": []}, {"body": "Did that guy just wake up from a comma or is he having a stroke?", "score": 1, "replies": [{"body": "Both", "score": 1, "replies": []}, {"body": "Lel... \"Wake up from a comma\"\n\nEdit: must have been a hard PERIOD of time for him", "score": 1, "replies": []}]}]}
{"title": "For spanish speakers - Acciones de EEUU: colapso inminente", "selftext": "[removed]", "id": "ioahwb", "created_utc": 1599495644.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 10, "comments": [{"body": "Build the fucking wall and ban this cunt", "score": 11, "replies": [{"body": "After im done shorting, Ill fly business over your shitty wall", "score": 7, "replies": [{"body": "lmao", "score": 1, "replies": []}, {"body": "That's a good reply bro.", "score": 1, "replies": []}]}]}, {"body": "Baxter, you know I don't speak Spanish.", "score": 2, "replies": []}, {"body": "Any hot senoritas", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Don't matter as long they real and you must really happy there lol", "score": 1, "replies": []}]}]}, {"body": "We Habla Espanol", "score": 1, "replies": []}, {"body": "Acciones solo van arriba", "score": 1, "replies": []}, {"body": "This is the original English article: [https://www.bloomberg.com/news/articles/2020-09-06/the-bro-trader-options-enhanced-stock-money-machine-goes-global](https://www.bloomberg.com/news/articles/2020-09-06/the-bro-trader-options-enhanced-stock-money-machine-goes-global)", "score": 1, "replies": []}]}
{"title": "Tesla stocks: Did I miss something?", "selftext": "[deleted]", "id": "iobafd", "created_utc": 1599498036.0, "score": 0, "upvote_ratio": 0.35, "num_comments": 20, "comments": [{"body": "elon took them from u while u were sleeping 😴", "score": 48, "replies": [{"body": "That sonofabitch", "score": 7, "replies": []}]}, {"body": "Elon decided to give 1 Tesla car for every 8 shares you hold. So make space for extra car in your garage.", "score": 25, "replies": [{"body": "How nice of him! Such a generous guy.", "score": 4, "replies": []}]}, {"body": "Oh damn, thats why i got 8 more shares lmao. Sorry", "score": 10, "replies": [{"body": "Understandable, have a great day!", "score": 5, "replies": [{"body": "Same to you!", "score": 3, "replies": []}]}]}, {"body": "call customer service for your broker. they should be able to fix it.", "score": 7, "replies": [{"body": "yeah, just wanted to make sure that I didn't miss something", "score": 1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "just wanted to make sure that I didn’t miss any news", "score": 3, "replies": [{"body": "Any news? You really think they would split and then reverse split a week later? Hahaha", "score": 5, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I know, I thought that I just wait a day then it should be fixed, but I still only have 2 shares", "score": 1, "replies": []}]}]}]}, {"body": "Ah, the stock thief strikes again. Most people just account for the stock thief in their percentages. Sorry bud", "score": 9, "replies": []}, {"body": "You should be glad you got your refund, shit is going down hard", "score": 2, "replies": []}, {"body": "Sir this is Tesla", "score": 2, "replies": []}, {"body": "This is why you should trade on acorns", "score": 2, "replies": []}, {"body": "Sir this is Wendy's", "score": 2, "replies": []}, {"body": "Probably a glitch, give it a day before you cry about it on WSB lol jesus christ fucking hell use google.", "score": 1, "replies": [{"body": "Jesus Christ fucking who now?", "score": 3, "replies": []}]}, {"body": "Look at it this way, now you'll have 5 times as many going down.  No wait....", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "iobxh4", "created_utc": 1599499979.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 13, "comments": [{"body": "Shouldve cut your  losses on Friday\nU fukd", "score": 5, "replies": []}, {"body": "Friday SPY bounced perfectly off of the support line from mid May, unless we open below it sell ur poots ASAP", "score": 4, "replies": []}, {"body": "you are fucked", "score": 3, "replies": []}, {"body": "There’s no way it crashes Tuesday lol. Going UP UP UP", "score": 3, "replies": []}, {"body": "3 heavy days of a selling historically it’s unlikely but you never know. European markets looked good today recovering from some of that sell off last week.", "score": 3, "replies": []}, {"body": "yer boned", "score": 2, "replies": []}, {"body": "How is praying for green going to help ? Jinxing ?", "score": 2, "replies": []}, {"body": "DM Oprah, she'll know what to do.", "score": 2, "replies": []}, {"body": "🌈🐻", "score": 1, "replies": []}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**MSFT**|**$205**|**BUY PUT**|**2020-09-11**|**$1.79**|**$214.25**|**2883**|**3866**\n|**UBER**|**$31**|**BUY PUT**|**2020-09-11**|**$0.22**|**$33.24**|**764**|**698**\n|**AAPL**|**$112.5**|**BUY PUT**|**2020-09-11**|**$1.05**|**$120.96**|**5983**|**17699**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckest8pv1d1wh0740d49b4ejb) | [Track Record](https://www.pickmojo.com/user/Yogi_1800/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "You are the best fucking retard", "score": 1, "replies": []}, {"body": "Big brain time", "score": 1, "replies": []}]}
{"title": "PSTHU & CVAC will likely outperform tomorrow regardless of the overall market environment", "selftext": "&#x200B;\n\n* **PSTHU -** This is a share play on Bill Ackman’s newest SPAC that recently received new media attention [as he confirmed to have held preliminary talks with AirBnB and a number of other private growth companies. ](https://www.bloomberg.com/amp/news/articles/2020-09-03/ackman-says-he-held-early-talks-to-take-airbnb-stripe-public?srnd=deals)Regardless of what company is eventually chosen, it is likely that the stock will experience a > +10% move on the announcement. PSTHU isn't available on Robinhood yet :) \n* **CVAC** is receiving new media attention as well after the initial IPO spike. “CureVac is currently running a large-scale effort to develop a vaccine for the COVID-19 virus for the market in about two years. By then, the biotech company expects to have the capability to deliver billions of doses of vaccines for those in need. Elon Musk visited CureVac on his trip to Germany last week. \\[…\\] Local reports indicate that the internal visit was aimed at discussing cooperation between the biotech company and Tesla subsidiary Grohmann Automation for the production of RNA mini-factories that could be used for the development of vaccine” \\[teslarati\\]. I am looking at short-term OTM call options expecting a further run-up over the course of this week fueled by US retail investors. CUREVAC N.V. O.N. shares were up +4.94% today (German market).\n\nAll my updates here: [https://options.substack.com/p/tuesday-9820-psth-and-pton-fdx-again](https://options.substack.com/p/tuesday-9820-psth-and-pton-fdx-again) ...it's a daily email newsletter...if you're interested in my thoughts", "id": "iod21j", "created_utc": 1599503393.0, "score": 9, "upvote_ratio": 0.69, "num_comments": 14, "comments": [{"body": "People flocked to PSTHU because it doesn't have much downside even in a bear market, if the market goes back up, they will sell their units because it hasn't even been 2 months since the SPAC went public and it could be a long time before they pick a private company and make an announcement, after all Ackmam does have another 22 months and has very specific requirement on kind of company he is looking for.", "score": 9, "replies": [{"body": "PSTH has held up well in the past month, I'm continuing to hold until merger target announcement. If it's a company I like, I'll buy more warrants. Units auto split is happening 9/11 FYI", "score": 5, "replies": [{"body": "I like it too, I just don't know if buying it 22 is a good move, we'd be overvaluing cash by 10%. 21 was great, 21.5 was okay, I feel like I can get a price than 22 if I just wait.", "score": 5, "replies": [{"body": "I bought day 1, flipped when it first hit $22 and rebought avg $21.1. I'll probably buy more leading up to the split.", "score": 1, "replies": []}]}]}]}, {"body": "AirBnB is out", "score": 5, "replies": []}, {"body": "I could be just more retarded but I believe they walked away from the deal regarding the former.", "score": 3, "replies": [{"body": "If u watch the Bloomberg interview, Ackman is basically leaving the door open for Airbnb and dropping hints to the other prospective companies that he wants to move quickly. I'm buying more units tomorrow.", "score": 1, "replies": []}]}, {"body": "Funny how SPAC’s are all the rage lately, I’m not sure why. Because a couple of them recently produced homeruns?", "score": 2, "replies": [{"body": "Relatively low float, easy to pump hopes and dreams pre-ticker change = good profit for those who sell at the right time.", "score": 3, "replies": []}]}, {"body": "Fuck you", "score": 1, "replies": []}, {"body": "Got 200 shares of cvac at $56 🙏", "score": 1, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Its blank check company and Ackman isn't collecting fees, what earnings would they report?", "score": 3, "replies": []}, {"body": "You trolling?", "score": 2, "replies": []}, {"body": "PSTH.U", "score": 1, "replies": []}]}]}
{"title": "My TA of TSLA for 12/19 - 12/20, guaranteed to make you 1000x returns 🤑", "selftext": "[removed]", "id": "ioeoc1", "created_utc": 1599508351.0, "score": 7, "upvote_ratio": 0.66, "num_comments": 13, "comments": [{"body": "Is this part of the WSB coloring book?", "score": 9, "replies": [{"body": "Books are for nerds sorry", "score": -1, "replies": []}]}, {"body": "i’d rather yolo puts on spy in the greatest bull market of all time than to have to read this post again. ban", "score": 8, "replies": [{"body": "Thanks, don't forget to subscribe to my blog here:\n\n&#x200B;\n\nP.S. can you share more of your red/green vote posts, as it's real quality content I've been missing.", "score": -4, "replies": []}]}, {"body": "Illuminati", "score": 2, "replies": []}, {"body": "Where is the Power Hour Octagon, you cant summon Cthulhu to multiply your gains without it.", "score": 2, "replies": [{"body": "Everyone knows Cthulhu is a 🌈🐻 it's why he can only exist once every so often 😂", "score": -1, "replies": []}]}, {"body": "Downvoted because I don’t understand what the fuck this means", "score": 1, "replies": [{"body": "Knowledge is power 🤑💲🤑💰", "score": 1, "replies": []}]}, {"body": "I dunno dude that MACPenguin is awful close to the Bermuda triangle.", "score": 1, "replies": []}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}, {"body": "This guy fucks", "score": 0, "replies": []}, {"body": "fucking brilliant\n\n\\*tips top hat\\*", "score": 0, "replies": []}]}
{"title": "QCOM QUEEFS", "selftext": "Many people are stuck on just AAPL and their upcoming 5g iPhones. However, people are forgetting who will be the supplier. That sexy supplier being QCOM. I know many are playing the AAPL event and in general just weeklies. This is my virgin, smart play going long on QCOM despite how boring and gey it makes me. If you like missionary and boring ur wife constantly. I guess take QCOM 130c 10/16.", "id": "iog3fq", "created_utc": 1599512662.0, "score": 23, "upvote_ratio": 0.78, "num_comments": 17, "comments": [{"body": "It’s not only QCOM. \n\nSWKS makes a lot of the things that make other things work, the guts, so to speak. Approx 40-50% of their revenue comes from iPhones. Think they’re having a good quarter?", "score": 7, "replies": []}, {"body": "[deleted]", "score": 11, "replies": [{"body": "QCOM is getting a percentage of the total price of the phone", "score": 1, "replies": []}, {"body": "sorry OP 😞", "score": 0, "replies": []}]}, {"body": "QCOM is an amazing investment. I think your calls will print, excercise and hold if it's close to B/E, but leaps on leaps is where it's at.", "score": 3, "replies": [{"body": "Are you concerned about LEAPS at this point? I want to buy into LEAPS for QCOM but I feel that eventually a correction will come and I can’t guarantee it won’t be in over a year? Are you just making sure theta doesn’t eat your asshole? Or are you continuously setting stop losses in case anything bad happens? How are you playing it?", "score": 1, "replies": [{"body": "I should have sold all my jan '21 calls and rebought. I sold some for profit (60% less than if I did earlier in the day). But I bought some stock at 110 and bought a couple heavy otm april calls. \n\nI really wasn't trying to paper hand them but going from 250% up to 30% i realized they were holding my portfolio up after taking major total losses elsewhere i couldn't risk losing it all. \n\nI'm very bullish on qcom - self driving isn't happening for years as no one can answer who takes liability for fatal car accidents, passenger or machine?  But driver assistance is very real and that's what QCOM is positioned for and will realize gains well before nvidia's ai is needed for total automous vehicles.\n\nSeeing auto manufacturers get attention and with apple breaking the real 5G smartphone ice soon, I think qcom will rebound and go at its own pacer, faster than 5G telecoms. \n\nAm I worried about missing out on another 1k of profits and buying potentially less valuable spring calls? If i want to look at my portfolio in rhe next month, yes, but other than that, no.\n\nI'm waiting on more capital and prices to drop on qcom leaps but I'll get a longer leg into the 2022's for sure. I'll probably exit them this summer or whenever qcom reaches 180 and hold mostly shares. \n\nHope you didn't bleed to death today.", "score": 2, "replies": [{"body": "I’m in all cash atm. I only had one call on TMO and got stopped out on Thursday to break even. Things looked fucky so I was cautious. I’m also waiting for price drops atm.", "score": 2, "replies": [{"body": "Very glad to hear that. I dont think QCOM will stay down long. If you don't have a stock position with them I'd look into it this week. The premiums of sensible calls finally got lowered after 3 days of selloff, which may continue all week. \n\nIt really feels like the stock wants to be 130 now, and investors want in before that. I (obviously) have no idea of the timeframe for when it will gap upwards of that but I'd say either by elections or, should trump not bother furthering any 5g dev, in late winter/by early spring - that's my projection the first 5G US govt contracts start showing up (which secondarily [majorly] affect QCOM). With any luck, qualcomm's worth and sooner to realize future profitability than other chip makers catering to the auto (NVDA) and 5g marketplace. Obviously QCOM isn't a new kid on the block nor is it an all in one. US(/China spyware free [western]) doesn't have a huawei (nor eligible equivalent) so will have to contract multiple avenues of suppliers to fulfill its 5G desires*. QCOM owns the IPs to so much that virtually everyone will have to pay QCOM at one point, regardless of whether or not they even use their chips (look no further than apples failed attempt to fight them in court).\n\nThis company is arguably integral to the foreseeable future of tech in america. I want to be well positioned before that's undeniable. imo they downplayed their outlook. \n\nThe timing of the tech selloff and 'doubt' and caution surrounding ATH'ers makes this look like a nice entry but im absolutely not qualified to say any of this as advice and no reason to doubt it wont get yanked down with further tech selloff. Win win \n\nI still think OP's calls will print but not my approach to getting in bed with them.", "score": 1, "replies": []}]}]}]}, {"body": "🥺💜", "score": 0, "replies": []}]}, {"body": "Yum yum", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/AutistLeader don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**QCOM**|**$130**|**BUY CALL**|**2020-10-16**|**$2.14**|**$115.97**|**7556**|**649**\n\n[Realtime ROI](https://www.pickmojo.com/pick/cket0qranfzhh074066xze23q) | [Track Record](https://www.pickmojo.com/user/AutistLeader/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "NOKIA ! NOKIA! NOKIA! (Full disclosure, my retarded ass has 450 calls for 6/18 5.00)", "score": 1, "replies": []}, {"body": "Qualcomm's profit margin per iphone sold will be about 4-6% on just the value of the chip. Apple's will be 30-55% on the phone, plus all of the revenue it generates through the app store.\n\nNah. This is just another run of the mill contract for Qualcomm.", "score": 1, "replies": [{"body": "Its apples first 5g phone....with Qualcomm their supporter", "score": 2, "replies": [{"body": "Qualcomm is so much more than apple.... verizon to tesla (who do think makes the 5g chips their self driving cars will rely on?). Automakers be pissed they locked in crazy agreements. Settled with hauwei and have patents worth so much. Biden or Trump, 5G investment will soar over the next few years, sooner rather than later. Look at ERIC and NOK too.\n\nThrow in QuickCharge 5 charges smartphones 0-50% in 5min and they're worth the premium. Too much major long term growth to go all in on short dated calls tbh", "score": 2, "replies": []}]}]}, {"body": "They are both around 120... yeah i think im sticking with apple", "score": 0, "replies": []}]}
