{"title": "[deleted by user]", "selftext": "[removed]", "id": "gzww74", "created_utc": 1591738762.0, "score": 304, "upvote_ratio": 0.97, "num_comments": 35, "comments": [{"body": "Thanks for putting this together. Bookmarked.\n\nI have calls on EVRI (6/19) so any confirmation bias I can get helps with holding.", "score": 41, "replies": [{"body": "Got those 7/17 @ 10 hoping for it to pull through big", "score": 7, "replies": []}, {"body": "Same", "score": 1, "replies": []}]}, {"body": "I'm no genius and just started options trading, but I think the CNHI option activity is more related to the NKLA explosion. My amateur research led me to believe they will have some part in the production of the Nikola Badger truck. Nikola/IVECO/CNHI are in business together, so just my 2¢", "score": 25, "replies": [{"body": "I believe CHNI will be doing the manufacturing", "score": 2, "replies": [{"body": "Yes me too and I hope #NikolaWorld2020 in Sept 2020 will make it skyrocket \n\nYOLO CNHI $20 c 9/18", "score": 1, "replies": [{"body": "Maybe I’ll ride with you, only reason I’m in this thread is for CHNI info.\n\nEvery time I tell someone they like to live on the edge when they get a call for double the price, they get rich. \n\nYou sir, like to live on the edge.", "score": 1, "replies": []}]}]}]}, {"body": "I have profited from several of your UOA posts.  Found FEYE on barchart earlier today and got in on some calls.  It is reassuring to see you highlighting them here.  I also could not find any news to justify the green on a red day, but took it as a positive signal to get in.\n\nLooking forward to seeing what happens tomorrow, and your next UOA post!", "score": 8, "replies": [{"body": "Do you just follow what everyone else is doing to profit? And do you chose the one with the most open interest", "score": 4, "replies": []}, {"body": "I think today was just a day where technology and \"corona safe \" stocks were up. \n\nQQQ was up today.\n\nHence the green", "score": 3, "replies": []}]}, {"body": "Intrigued by your methodology...seeing any action on PFE?", "score": 5, "replies": []}, {"body": "FEYE is probably related to the ongoing Honda ransomware attack. It's been awhile since a large corp has had a major cyber attack of this sort, and FEYE may be cashing in a on a rush to shore up IT security.", "score": 4, "replies": []}, {"body": "CNHI is a NKLA sympathy play. Maybe it will get a boost but the news on their joint venture is already out so...", "score": 3, "replies": []}, {"body": "What’s the move for tomorrow boys?", "score": 5, "replies": [{"body": "Cash gang. If ur itchy go smalllll. I made 130 yesterday, 30 today. Both small plays cuz I was bored af.", "score": 2, "replies": [{"body": "Lost big on mgm. We doing puts from now on I guess", "score": 1, "replies": []}]}]}, {"body": "Hey, really appreciate these posts. I’m new to this and this is the type of DD I’d like to do myself just as a learning process. For FEYE when you say you’ll be watching for an entry point in the morning are you willing to share what your process is for this (what indicators are you looking for etc...) appreciate any feedback you may have. Thanks again", "score": 10, "replies": []}, {"body": "I'm also holding EVRI and FTCH still -- thanks for sharing your thoughts on the limits (take profit / stop loss) on them.", "score": 3, "replies": []}, {"body": "This is golden. Your service to this subreddit will not go unnoticed!", "score": 3, "replies": []}, {"body": "FEYE play must be an acquisition rumor", "score": 3, "replies": []}, {"body": "SONO?", "score": 3, "replies": []}, {"body": "This is extremely informative, this is what reddit is for. Thanks for taking the time to put this together and share.", "score": 3, "replies": []}, {"body": "FEYE is an acquisition play, there were rumors a while back. Target price was over $16 if I remember correctly, not sure if that would still be the case after covid.", "score": 3, "replies": []}, {"body": "How about data for CNO and SONO? Thank you for taking the time to provide analysis", "score": 2, "replies": []}, {"body": "Hey man, this is really great information! Will definitely be reading in the future. How often do you do these posts?", "score": 2, "replies": []}, {"body": "Thank you kind sir", "score": 2, "replies": []}, {"body": "CNHI also owns over 7% in NKLA which I think people assumed it would increase in value as NKLA skyrocketed yesterday.", "score": 2, "replies": []}, {"body": "Thank you so much for your option articles. I’m new to trading. Reading your articles help me understand the trading terminology and processes. Great job! Thanks for sharing!", "score": 2, "replies": []}, {"body": "As someone who works in the IT security realm, FEYE is shit.\n\nSo many other products do what they did cheaper and a lot of times better.\n\nThe only reason why FEYE did so well years ago is they were first to the game. Once everyone else caught up, they were no longer the only player in town when it came to intrusion detection systems and other security appliances.\n\nI wouldn't buy puts, I wouldn't buy calls. I'd just leave it alone as I don't see them doing anything impressive.", "score": 5, "replies": [{"body": "Couple of people saying there’s acquisition rumors.", "score": 1, "replies": [{"body": "My understanding is that they have been letting people off the past few months too.", "score": 1, "replies": []}]}]}, {"body": "I wouldn't touch EVRI. My brother worked for them, sold at $7. Not a lot of juice left in that play.", "score": 4, "replies": [{"body": "Hoping this is not true 😢", "score": 3, "replies": []}]}, {"body": "Most I ever lost in the market was following one of these posts.", "score": 0, "replies": [{"body": "If you have made profits you probably wouldn’t be giving this guy credit anyways", "score": 1, "replies": []}]}]}
{"title": "AMD, whats your thoughts?", "selftext": "[deleted]", "id": "gzcamx", "created_utc": 1591663410.0, "score": 13, "upvote_ratio": 0.79, "num_comments": 36, "comments": [{"body": "I hold a few shares of AMD. Don’t have too much information about them from the business side but from the technological side they are blowing competitors out of the water. Great innovation and R&D. Woulden’t be surprised if everything was AMD few years from now. Phenomenal engineers", "score": 10, "replies": [{"body": "business side, they have one of the best CEOs in the world.", "score": 15, "replies": [{"body": "I'm curious, how do you go about rating a CEO. I like the idea of judging a company based on its leadership but I wouldn't know where to start.", "score": 3, "replies": [{"body": "She was just the first women to be the worlds highest paid CEO.  She brought AMD from the brink of bankruptcy, and turned around the company.  On top of that shes a genius computer engineer, so she is the CEO of a company that does what she does best.  She changed the way AMD operated, and changed the way they thought about architecture. \n\nTheres an endless list of why shes amazing.  I could go on, but do yourself a favor and listen to her talk about engineering and her transition of the business side of AMD.", "score": 14, "replies": [{"body": "Sold. Thanks!", "score": 1, "replies": []}]}]}]}]}, {"body": "If you want to try and capitalize on this rare bull market with the risk of getting burned, look elsewhere. \n\nIf you want a safe, buy and forget about stock, AMD is the way to go.", "score": 7, "replies": []}, {"body": "If I knew, I would be a very rich man. \n\nBut there are so many stocks that are seeing crazy gains. \n\nAAL has posted double digit increases for almost a week now. Hard to tell when it’ll all come crashing down.", "score": 3, "replies": [{"body": "Today", "score": 1, "replies": []}]}, {"body": "Also a long term holder here but I'm concerned that it has not moved one bit in over two months now", "score": 2, "replies": []}, {"body": "It can go to hell. I sold NKLA at 38 to load up on AMD Friday. Better long term buy but I aint going up 100% for AMD in a day.\n\nBut for real. Great long term stock. It's been overvalued. It should run up into earnings and based on growth be at a much better valuation since it's been fairly flat since the last earnings.", "score": 2, "replies": [{"body": ">NKLA \n\nI did the same, sold NKLA and put more in AMD. long term i think it will work out.", "score": 1, "replies": []}]}, {"body": "The Ps5 is gonna whoop the new xbox", "score": 6, "replies": [{"body": "AMD supplies chips for both", "score": 9, "replies": []}, {"body": "Also think that, but still, don't you think this is a better choice instead Sony ?", "score": 2, "replies": [{"body": "Xbox and PlayStation are such small parts of Sony and Microsoft's revenue that I doubt the consoles affect their stock prices much. If you want exposure to the 'console war', then AMD for sure.", "score": 7, "replies": [{"body": "They generally sell the consoles at a loss. They make real bank from the services and distribution royalties.", "score": 6, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Well yeah no shit", "score": 1, "replies": []}]}, {"body": "> They generally sell the consoles at a loss. \n\nthat was true originally, but hasn't been true in decades. the x1 and ps4 were both sold at a profit on day one (as were their upgraded models, the ps4p and x1x) the era of subsidized hardware is likely gone for good, and we'll likely see the ps5 and xsx selling for a profit right out of the gates, especially with the pricepoints that are being rumored.", "score": 1, "replies": [{"body": "Perhaps. I’m not pouring over the numbers so you are probably right. I just see so much green for MSFT when the 12 year olds are racking up microtransactions and MSFT gets a cut of every transaction.", "score": 1, "replies": []}]}]}]}, {"body": "I dont think so. Sony playstation always outperforming the xbox. So i see Sony stocks going up in long term.", "score": -1, "replies": [{"body": "It's not completely true.  \nYes, original PS4 had the lead, before Microsoft blew Sony out of the water with One X ( 6TF 12gb gddr5 Xbox vs 4.2TF 8gb gddr5 PS4).  \nThis generation it seems XSX will have a lead in performance on the launch:  [https://i.redd.it/d9voy59xjgn41.jpg](https://i.redd.it/d9voy59xjgn41.jpg)\n\nGames are real deciding factor and in that regard Sony has a lead.", "score": 4, "replies": [{"body": "But the new Halo game will be coming out for xbox. It apparently will be one of the most expensive games ever made. This game alone could win microsoft the console war.", "score": 1, "replies": [{"body": "Well it will not be console exclusive, it will be available on PC too.   \nSo its questionable how much impact this one can have in console wars.", "score": 2, "replies": []}, {"body": "> But the new Halo game will be coming out for xbox.\n\nif it ends up being anything like the dumpster fire that was halo 5, they can keep it.\n\nif it ends up actually being good, it's going to be on pc anyways so it won't be a system seller.", "score": 1, "replies": []}]}, {"body": "was he talking about sales performance or specs?\n\nbecause as far as sales go, he hit the nail on the head. playstation outsells xbox every generation. the only question is how close it gets.\n\nps2 crushed ox\n\nps3 slightly beat x360\n\nps4 demolished x1\n\nas a day one x360 and x1 adopter (and year 1 original xbox, day one xbox live that was held until this year), i see nothing exciting in ms's future. it's a classic case of \"all dressed up and nowhere to go\". with no exclusives, they are in for another flop.\n\nit also doesn't help that ms treats xbox owners as second class citizens, paywalling them behind xbl gold for games that pc players play for free (including ms's own first party titles). they are also much more aggressive than sony with the paywalls, putting f2p games behind them while people can play for free on playstation.\n\nms looks pretty determined to make xbox the next zune.", "score": 1, "replies": []}]}, {"body": "People generally upgrade their existing console brand because they're heavily invested in the ecosystem.\n\nShort of a \"n64 vs ps1 scenario\" where nothing available at Xmas -- it's too expensive to switch.", "score": 1, "replies": [{"body": "> People generally upgrade their existing console brand because they're heavily invested in the ecosystem.\n> \n> \n> \n> Short of a \"n64 vs ps1 scenario\" where nothing available at Xmas -- it's too expensive to switch.\n\nhistorically, that makes no sense (though it's a relevant concern today).\n\nduring that \"n64 vs ps1\" generation there had literally never been a console that had ANY kind of interaction with the prior generation, rendering that investment irrelevant.\n\neven today though, the investment is still pretty minimal. you're not going to be able to use your existing controllers/accessories on the new system, and as far as backwards compatibility goes you already have the old systems (so you're not losing anything by switching on that front).\n\noff the top of my head, there has been exactly 1 case ever where staying with the same company was relevant (rockband 4)", "score": 1, "replies": []}]}]}]}, {"body": "yes and it will not be close, just like every year.", "score": 2, "replies": []}, {"body": "Well, not by performance: new Xbox will have better CPU, GPU and RAM.   \nPS5 will lead only in SSD performance:  [https://i.redd.it/d9voy59xjgn41.jpg](https://i.redd.it/d9voy59xjgn41.jpg)", "score": 1, "replies": [{"body": "I think most of the existing ps4 players doesnt really care about the performance difference between the new xbox and ps5.", "score": 1, "replies": [{"body": "Yes, of course and it seems Xbox exclusivity is getting weaker over years and its a main factor.  \nBut the whooping part is not so granted at the moment.", "score": 3, "replies": []}]}]}]}, {"body": "they also just got an order into TSMC for 5nm(GPUs) that is LARGER than their last order for 7nm, due to huawei absence.  They are a solid play longterm.", "score": 1, "replies": []}, {"body": "i've been hearing \"amd is going to explode any day now\" for 3 months. from what i've seen people saying over that stretch, it sounds like this \"any day now\" speculation has been going on for  years. AMD is basically the little engine that couldn't.\n\nyou're also vastly overestimating the significance of the ps5/x1x launches. don't forget, the ps4 and x1 both use amd chips too.", "score": 1, "replies": []}, {"body": "AMD is literally a 50/50 right now. People who say its going to go up or down are all just guessing because they bought in that position and hope it goes their way.", "score": -4, "replies": [{"body": "wrong.", "score": 3, "replies": []}]}]}
{"title": "Alphabet Amazon, AMD, Apple, Microsoft, Netflix, Nvidia and Zoom - if you had to buy/avoid at todays price, which one would you buy/avoid and why?", "selftext": "[deleted]", "id": "gzxwdg", "created_utc": 1591741756.0, "score": 6, "upvote_ratio": 0.88, "num_comments": 28, "comments": [{"body": "Buy  AAPL and MSFT, avoid rest for now and avoid zoom forever.", "score": 9, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Theyre Fine. Id avond Nvidia and zoom", "score": 1, "replies": []}]}, {"body": "Aged poorly", "score": 1, "replies": [{"body": "Reddit investors judging investments over 4 month periods... Come back to me in 2 years, or 10 if you're smart.", "score": 1, "replies": [{"body": "Just admit you don’t understand Zoom as a company. I’m happy with my 400% returns though...", "score": 1, "replies": [{"body": "Yea they've done well, whats that got to do with my own long term view on an investment?\n\n I just looked at your post history and its laughable, its just you going to through months-old posts commenting in hindsight trying to look smart? \n\nDo you ever contribute your own thoughts ahead of time?", "score": 1, "replies": [{"body": "I have and my portfolio returns are proof of that. Do you want me to screenshot that here?", "score": 1, "replies": [{"body": "Yeah go on. Link me to your posts about ZM before it's climb too. \n\nIf you're going to endlessly going through old topics replying \"this aged well\" you better have your own input on the other side to back it up, otherwise you just look like a cretin.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "ok still waiting on those screens", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "LOL", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Don’t buy zoom lol", "score": 9, "replies": [{"body": "How this aged poorly...", "score": 1, "replies": []}]}, {"body": "MSFT is a solid company which has a great subscription model for both corporate, home and gamer clients\n\nNew Xbox is coming soon too \n\nThe stock price has beeb strong and covid-19 resistant. \n\nMSFT is a buy imho but I am not qualified to give financial advice etc (I have had shares since April and v happy with the medium risk return even though I got in late)", "score": 4, "replies": []}, {"body": "I'm short ZOOM.  I'm not a fan of all their bs nor am I fan of their PE ratio.", "score": 1, "replies": [{"body": "Aged poorly", "score": 1, "replies": [{"body": "I was only short for a day or two to be fair.  lol", "score": 1, "replies": [{"body": "Still proof that reddit is the most useless place for investing advice. If you don’t understand Zoom as a company don’t comment on it. Growing at 400%, but you think it’s worth shorting loool.", "score": 1, "replies": [{"body": "One of the key rules when trading:  Own your own trades.  That is, never look to others or group think for advice or it will only lower your profits.\n\nIf you must look to others for advice, which is a bad idea, only follow posts that state their time frame.  Eg, are they scalping or investing?  Bought X or sold X type comments mean nothing if they don't say, \"Bought X, plan on holding for 90 days.\"", "score": 1, "replies": [{"body": "I don’t get why you’re trying to give me a lecture about Not copying others. That doesn’t cover the fact that you went short on one of the best performing stock in the last few months...", "score": 1, "replies": [{"body": "I don't get why you're trying to troll me, but hey?  lol", "score": 1, "replies": [{"body": "Not trolling, you simply aren’t just owning up to your mistakes. Says a lot about you as an individual.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Why is a shit company like Zoom in the same conversation as the others??", "score": 1, "replies": [{"body": "Aged poorly", "score": 1, "replies": [{"body": "Still a trash company regardless of its price. Its just benefiting from covid. It’s product is easily replicable by its competitors", "score": 1, "replies": [{"body": "Trash company yet they managed to create a product that surpasses any product FAANG could make and marketed and distributed it better during a time of crisis. They have been increasing their TAM with Zoom APIs and OnZoom. \n\nJust admit you are a shit investor and don’t understand the company. Imagine being so stupid to call a company growing at 400% a trash company...", "score": 1, "replies": []}]}]}]}, {"body": "I would avoid Amazon and Netflix.\n\nI think Amazon will struggle to compete against national and regional economies that have developed.\n\nNetflix will also see pretty robust competition.\n\n\n\nI'm not considering zoom in this space.", "score": 1, "replies": []}, {"body": "You don’t have to buy or avoid anything. It’s not a zero sum game. \n\nIn my opinion, stay away from this market. It won’t be pretty when hell breaks out", "score": -9, "replies": [{"body": "This is the last advice you should listen to.", "score": 9, "replies": []}]}]}
