{"title": "Netflix offered $2.7B for Cineworld, why not $3B for $AMC?", "selftext": "[deleted]", "id": "hheih1", "created_utc": 1593351513.0, "score": 25, "upvote_ratio": 0.81, "num_comments": 30, "comments": [{"body": "$AMC has bad management and a poor public image right now. On the surface $AMC might look like an opportunity, but I suspect that underneath there is a lot of rot.", "score": 49, "replies": [{"body": "That would be a good reason for the likes of Netflix to take over. Put better management. The finanicals are almost identical between Cineworld and AMC. ONly difference is AMC has a lot more theatres in Prime markets and major capitals around the world.", "score": 6, "replies": [{"body": "Right so if they have more of the market and their financials are identical then they’re doing a bad job", "score": 8, "replies": [{"body": "I won't disagree of the overextention of the company. What I'm saying is for a little more, Netflix or Amazon could buy up a huge portion of market share of the theatre going experience. Undercutting Disney and Universial because they aren't allowed to buy cause of the Paramount ruling. That ruling will be overturned soon, so if they buy now they can control the vertical stream and pressure Disney/Universial and other studios into submission.", "score": 3, "replies": [{"body": "Actually AMC has some of the best operations management in the business. It's just a bad business.", "score": 3, "replies": []}]}]}, {"body": "So I can go to the theatre to watch Netflix.", "score": 3, "replies": [{"body": "Same as going to Whole Foods and seeing Amazon products.", "score": 1, "replies": []}]}]}]}, {"body": "I think you misread the article.  Netflix offered to buy Regal Cinemas.  But Cineworld bought it for $2.7B.  Cineworld is currently backing out on a signed deal with Cineplex for a merger.  So I suspect the cinema market is just not hot right now and represents a lot of liability for investors.", "score": 8, "replies": []}, {"body": "Probably waiting for them to go bankrupt and then get them for a steal", "score": 6, "replies": []}, {"body": "$3B? \nAMC will be lucky if they were offered a fifth of that (given they're 3100% debt to market cap)", "score": 9, "replies": [{"body": "If you look at Cineworld debt it's comparable", "score": 3, "replies": [{"body": "Yeah but cineworld was bought in 2017 when it was much more valuable", "score": 4, "replies": [{"body": "I would say the value of AMC is its foothold in multiple countries and mjor capitals. That's a high value target for Netflix, as well as Amazon.", "score": 2, "replies": [{"body": "What’s to stop Netflix from making their own theaters for $3 billion? I’m assuming Netflix would acquire all the debt that AMC had so the price tag of $3 billion probably isn’t the total investment Netflix would need to make. Just make new theaters or buy the old ones from AMC without needing to have additional liabilities", "score": 5, "replies": [{"body": "The cost of building it outweighs the cost of buying prefixed ones and at prime locations. Plus the connections with studios is an added plus.", "score": 1, "replies": [{"body": "I’ll agree with the first one but do you honestly think that Netflix can’t get the attention of the studios?", "score": 3, "replies": [{"body": "They will control the stream for movies, that way they can add pressure to studios to sumbit to demands.", "score": 1, "replies": []}]}]}]}, {"body": "Appearantly not", "score": 1, "replies": [{"body": "I wouldn't be surprised if ongoing behind closed doors negotiations are happening right now. Huge players like Silver Lake and Blackrock are invested, as well as Wanda Group.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It wouldn’t surprise me if AMC is bought out by Disney, Apple, Amazon or Microsoft in near future.", "score": 2, "replies": [{"body": "I didn't think of that, Apple could be a potential buyer. Kinda like how Amazon bought Whole Foods.", "score": 2, "replies": [{"body": "It’s inevitable there is no way AMC survives on its own with almost 4 months of zero revenue", "score": 1, "replies": [{"body": "They did shore up cash for the rest of the year and reduced/delayed rent, but yeah I wouldn't be surprised if talks are happening now. Probably in third quater. Wanda Group probably would be fine with break even, which would be around $16-$18 per share.", "score": 1, "replies": []}]}]}]}, {"body": "Theaters are not going to recover until there's a vaccine or good first line treatment for COVID. Buy a chain now and it has to be mothballed for a year plus or run at a deficit for unknown period.", "score": 2, "replies": [{"body": "Thats would only make it a reason to buy it up now before the overturning of the Paramount ruling. Which would make the likes of Disney or Universial be able to buy major movie chains. Its about controlling the revenue stream before the other guys does.", "score": 1, "replies": [{"body": "I see three issues with what you said:\n\n1.  You're predicating this on the predicted outcome of some future change in legal regulations, which is probably not a given\n2. That denying Disney or Universal the ownership of AMC will be important to Netflix and/or a 'best use of capital'\n3. That Netflix will profitably run a physical movie theater chain", "score": 1, "replies": [{"body": "The DOJ practially said its gonna get overturned. Netflix or Amazon could do that cause it would pressure the studios and they have control. That's worth a bit. Neflix already bought the Egyptian in Cali, seems they are interested in physical movie theatres.", "score": 0, "replies": [{"body": "I'm pretty sure the Egyptian purchase was to ensure the eligibility of some Netflix films for Oscar nomination -- there's some requirement about being screened in a public/paid-for-tickets theater in California that's needed for nomination. \n\nAs for the rest of what you said, it all seems pretty vague and I don't see any numbers.", "score": 1, "replies": []}]}]}]}]}, {"body": "Nflx does not have the cash? The have billions in negative free cash flow every year. How do they pay for this you ask? They Ponzi their bond payments by issuing more bonds. Capitalism at its finest. If the credit  market dries up nflx is bankrupt.", "score": 1, "replies": []}, {"body": "Because debt", "score": 1, "replies": []}]}
{"title": "$AMD and $NVDA divergence", "selftext": "AMD and NVDA have had a correlation coefficient of about 90% over the past 12 months, but there's been a recent divergence. The coefficient is down in the 60-70% range in the past 3 - 6 months.\n\nI'm looking at selling puts on AMD and call credit spreads on NVDA. Anyone else doing any theta strategies here?\n\nPost other divergences you've noted in highly correlated underlyings.", "id": "hhlk6m", "created_utc": 1593375392.0, "score": 67, "upvote_ratio": 0.96, "num_comments": 36, "comments": [{"body": "I'm selling puts on nvda and calls on amd", "score": 24, "replies": [{"body": "[removed]", "score": 9, "replies": [{"body": "I’m selling nvda on puts and amd on calls", "score": 1, "replies": []}, {"body": "what strike price percentages below current stock price do you usually target and how far out on expirations?", "score": 1, "replies": []}]}, {"body": "I’ve put a collar on AMD.  I’ve been selling the 1/15/2021 $55 strike on the covered call leg.  If the stock keeps moving down I might just close out of the call for a nice profit.", "score": 3, "replies": []}]}, {"body": "my 46/50 AMD credit spread has gotten fucked lately", "score": 6, "replies": []}, {"body": "In su bae we trust", "score": 15, "replies": []}, {"body": "short strangle on AMD 45/64 (31st Jul), put credit spread on NVDA 337.5/345 (10th Jul) . both looking a bit pressured by end of last week, if the market takes a big drop this week which seems likely, then I will have to consider whether to roll out or in the case of pcs turn it into something else or just bail.\n\nhoping for the \"printer brrr\" or \"hey we have a vaccine!\" effect to pull us out of this nose dive at some point soon, which seems to have worked since March....\n\nor...\n\nI need to also consider the worst case scenario which is - we may finally be seeing a reality check. This, I think, is the biggest question in general at the moment.\n\nMy money is on the former being the case and trickery to bring the markets back up will be employed at some point in the next week or two. I am leaning this way, at least for now, because I think elections dictate that Trump cannot risk crashing the economy yet.", "score": 5, "replies": [{"body": "At some point people are going to quit falling for the vaccine news until there's an actual vaccine.\n\nI'm being a little more cautious with put credit spreads next week.", "score": 5, "replies": [{"body": "I think my biggest lesson from 2020 has been to never under-estimate the power of the herd to believe in the most asinine crapola for indefinite periods of time. its more about what they WANT to believe.\n\nhaving said that, I think eventually reality has to dawn even if just a little bit, and the economy is not going up, the markets have been. there has to be a re-calibration at some point I absolutely have no doubt.\n\nthis move down is hurting me more in my put credit spreads than anything else as they seem difficult to roll and manage for value. I may not do one again until things look more normal. might turn my current one into an IC but not sure, will try to survive the short trade week without doing too much if I can help it.", "score": 1, "replies": []}, {"body": "> At some point people are going to quit falling for the vaccine news until there's an actual vaccine.\n\nPeople love asserting opinions like this which such surety.  Meanwhile, I'm about as sure as you are that you are wrong.", "score": 1, "replies": []}]}, {"body": "May I ask about the 64C on your strangle. Is that an earning play? ATH is $59.27. I believe in seeing $60s for AMD, question is when. Do you think the late July earnings will be enough of a catalyst, or is the 64C OTM far enough to not be tested. \n\nHighest I've sold CCs on AMD was a 57 Strike, still think 60 is a bit high at the moment as premiums for that are low. \n\n(Too lazy to look at the moment, will look in the morning) I believe the 45P and 60C are popular for the 07/17 expiration or the Aug expiration.", "score": 3, "replies": [{"body": "some background:\n\nI am new to short strangles and only three months into options trading, and my first short strangle on XOM moved rapidly up without warning and I panicked then had to close out a lot of trades to cover it. It then moved down and I would have been in profit. doh! I have also watched endless videos from TastyWorks (highly recommended!) who are avid Short Stranglers, but I think you need a big capital to do them. I currently do only 1 at a time, as I dont need two short strangles going against me in the short call leg ever again. short calls are where the demons exist, imo.\n\nyour questions:\n\nno, I dont really bother with earnings yet, but I do check the movement of any stock during its previous earnings using TradingView dot com charts that show it, and then try to place my expirations to avoid the bump.\n\nI place my short call further out than necessary for safety based on my risk aversion and the current habit of stock to do the unexpected. I prefer to be safe than make extra bucks, also, like with this trade and how TW guys do it, I could now move the short call leg in (same expiry) and increase my credit by doing so, but I probably wont just yet because it also reduces the profit of the strangle overall when you do, and I am not sure I want to keep it on at all yet due to the COVID re-emergence issue, depends on market behaviour on monday tbh.\n\nI also have a habit from my Forex trading days to put my stops beyond where the herd are likely to have theirs. so if I see resistance line at 60, but can afford 64, I am putting it at 64 because otherwise you get stop-hunted. I dont know yet if Options function like this, I think not, but even so, old habits in trading tend to stick.\n\nI also would not put a strangle short put leg on at a price I was not able to afford assignment. I am still learning about risks of early assignment in short calls and puts, and seeing some horror stories, esp trades like NKLA that could ruin your profits for a long time if it happened that your short call in a mixed leg trade suddenly got exercised early and you are left holding a big bill. This seems to happen randomly in illiquid or meme stock. AMD seems pretty liquid, but there is also no real protection if your broker randomly assigns your short call and they have contractual allowance to do it for no reason at all. something to consider.\n\nbasically I am covering as many bases as possible, while learning more about short strangle play in game I am not yet fully familiar with. AMD and the strikes I used, all fit my criteria and hopefully that explains my choices some. good luck! err on the side of caution until you know 100% what the game is.\n\n:)", "score": 1, "replies": [{"body": "Thanks for the response. I see the caution on placing the strikes where they are and checking the stock movement. The 64 strike is above where everyone else would be, but if everyone sells at 60, it will need help getting past it. \n\nI'm not sure if options have the ability to be stop-hunted. I guess you could put a stop-loss on a CSP, but why, when theta decay will help.\n\nSounds like you have a plan based on experience.", "score": 2, "replies": []}]}]}]}, {"body": "Currently NVDA is Buy-and-Hold in my long-term account. AMD is selling Covered Calls weekly and adjusting Strike Price as it goes. \n\nI can't answer the Call Spread part. \n\nI've watched the AMD NVDA correlation for a long while. It seems less linked together now. NVDA moves either way and AMD will drop. AMD goes up and gets sold off and NVDA keeps going. Even a partnership between NVDA and AMD benefitted NVDA stock more as AMD saw a one day spike and drop.\n\nWith AMD at $50 and the Covid levels in the high $30s, this may be a spot for CSPs. Monday/Tuesday will tell if buyers are swarming in or waiting. \n\nI can see this correlation as DD. Stocks rarely go solo with nothing outside of the company affecting it. Take the Airlines as a group, cruises as a group, oil as a group. One has bad news, they are tend to follow. So AMD, NVDA, MU, INTC, TSEM, etc may influence each other and having sector knowledge is good DD as well.", "score": 5, "replies": []}, {"body": "Are they diverging enough to trade profitably as pairs?", "score": 3, "replies": []}, {"body": "Do these correlation coefficients have any real meaning? \n\nI can see this working to some degree for currencies, commodities, or treasuries...but for stocks?\n\nIs there really a \"mean reversion\" element to this where divergence re-converges? \n\nHas anybody really made any money consistently with this? \n\n(Honest question)", "score": 3, "replies": [{"body": "I've done a good bit of research on pairs trading e.g. long IBM short AMD) and correlations aren't generally expected to be stable (beyond just the intuitive links of sector/industry). Many many papers use cointegration instead, but in recent years that has begun to break down as well.", "score": 2, "replies": [{"body": "TBH, it sounds like a glorified form of witchcraft.", "score": -1, "replies": [{"body": "To the extent that matrix algebra is witchcraft, sure.", "score": 3, "replies": [{"body": "No disrespect to your craft bro.\n\nIt's just that I believe that Fed liquidity has decimated all forms of traditional price discovery.\n\nIf you're making money with this, more power to you.", "score": 2, "replies": []}, {"body": "This notion is that one can use simple or compounded matrix algebra to predict future equity values is absurd.\n\nDivergence is because NVDA has opened up more revenue streams.", "score": 1, "replies": [{"body": "Again I don't use this myself. But the goal isn't to predict future equity values. It's to find good candidates for pairs/basket trading.", "score": 2, "replies": [{"body": "Check Betting Against beta [Betting against Beta ](http://pages.stern.nyu.edu/~lpederse/papers/BettingAgainstBeta.pdf) \n\nBut why use this strategy on equities in general. How much confidence can you be putting into this analysis.", "score": 1, "replies": [{"body": "Beta measures correlation, not cointegration.\n\nI don't know why you're arguing with me about a strategy that I don't use and that generally doesn't work anymore. \n\nPairs trading worked for many years. Tartaglia and Morgan Stanley made millions with it. Read the academic papers and you'll see its profitability began to break down around 2005-2007.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Ya been selling puts on AMD for the past month or so. Currently holding the July 24 47p. I may roll out and down. Have to see where buyers step in.", "score": 5, "replies": [{"body": "I bought calls a few months back and doubled up nicely. I also got a Microsoft call that’s quadrupled now.", "score": 3, "replies": []}, {"body": "I’m holding 7/31 50p. Rolling out and down may not be a bad idea.", "score": 2, "replies": [{"body": "Same, strongly considering it", "score": 1, "replies": []}]}]}, {"body": "AMD has whooped on me so far. I’m feeling the strangle to see how it plays but I’ve also added shares as AMD progressively lowered to $50. If it gets anywhere close to $40...gonna have to go straight calls!", "score": 2, "replies": []}, {"body": "I has a nightmare last night my July 2 $350 puts on NVDA got assigned and it dropped to $300. Let’s hope next week goes smooth it’s only 15 points or so from $350 suddenly.", "score": 2, "replies": []}, {"body": "I’m holding several 7/17 49p for AMD and 1 7/17 340p for NVDA. I was thinking of maybe rolling out AMD to 8/21 45p and riding out NVDA. Thoughts?", "score": 2, "replies": [{"body": "I think allot of traders are in the same predicament..", "score": 1, "replies": []}, {"body": "ouch. Something like that happened to me with an AAL strangle. I was down 400% of max profit overnight. I rolled from June to July and ended up in the green, but that was very lucky. With how strong tech has been, you might want to just take the assignment on the AMD put if it happens (assuming you have the capital). Sell covered calls on the shares.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Relevant strength is indeed relevant when disparities arise", "score": 5, "replies": []}, {"body": "thetagang, thetagang questions? OP could be a strictly TA trader, or working to IV maybe and not necessarily directional trading. nothing wrong with that if you believe in it. also could have already done his DD. not sure I understand this comment tbh.", "score": 2, "replies": []}]}]}
{"title": "DD for why the market is never going to crash", "selftext": "[removed]", "id": "hhkhhq", "created_utc": 1593371870.0, "score": 14, "upvote_ratio": 0.67, "num_comments": 32, "comments": [{"body": "How is this a YOLO?", "score": 19, "replies": [{"body": "because my 401k is in spy calls", "score": 20, "replies": [{"body": "Top confirmed", "score": 32, "replies": [{"body": "I think he’s more of a contrarian at this point. I’m expecting a red month with the coming headlines. With that said I hope you don’t lose your retirement OP", "score": 3, "replies": [{"body": "He’s not a sophisticated investor if he thinks an IRA is the same as a k so it’s likely.", "score": 2, "replies": []}]}]}, {"body": "Pics or gtfo?", "score": 1, "replies": []}]}]}, {"body": "Never going to crash... lol", "score": 7, "replies": [{"body": "Why would the fed spend all this time and money in propping the economy up to all of a sudden let the market crash?", "score": 8, "replies": [{"body": "[Rick Astley - Never Gonna Give you up](https://www.lynalden.com/fixing-the-debt-problem/ )", "score": 3, "replies": []}, {"body": "Well, they tried that in Japan and it still crashed and can't recover after 30 years, so here goes your assumption that it can't crash.", "score": 1, "replies": []}, {"body": "No you're right, never gonna crash /s", "score": 1, "replies": []}]}]}, {"body": "Saw the title.. Instant upvote. Didnt even read", "score": 8, "replies": [{"body": "Probably cant read anyways", "score": -13, "replies": [{"body": "Hey be respectful fuckface", "score": 7, "replies": []}]}]}, {"body": "Or just have it both ways with spy 310 7/17 calls and spy 290 7/17 calls. Can't both go tits up.", "score": 5, "replies": []}, {"body": "Market will never crash until it does.", "score": 2, "replies": []}, {"body": "My life savings are in TSLA 1010calls right now. The market won’t crash", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I sold my calls now at 85% gain.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I was exaggerating a little. I put in 10k. Not all my life savings, but still a lot of money for me. I think a 85% gain was worth it. But that’s how i see it.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Thank you! I would never do an all in on ANY option by the way. I have lost too much in the past just by bad risk management. I usually stick to 5-20% max on my trades nowadays.", "score": 1, "replies": []}, {"body": "If i would have kept them till todays high i would have made over 1300%. I’m a fucking jackass. Can’t forgive myself for selling. My life could have been very different today.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "TSLA In my mind and in my car. We can't rewind we've gone too far.", "score": 0, "replies": []}]}, {"body": "All in on a W shaped recovery.", "score": 1, "replies": []}, {"body": "Lets be rational for a sec and think about this shit. Yeah dont fight the fed blah blah blah, but can the fed keep pouring a trillion dollars a month till there is a vaccine and everything returns to normal?, uhhh i dont think so, things are starting to look gloomy mthfukas", "score": 1, "replies": []}, {"body": "I like this play because i too have calls", "score": 1, "replies": []}, {"body": "mmhmm I am sorry for your portfolio but Trump will change the strategy if he does not want to lose the elections. He is already fucked but he will try anyway. \n\nNext stimulus will go directly to mainstreet and normal people does not invest in stocks. Republicans needs to show that they do not care about big corporates and stocks now. \n\nBulls are done, tech stocks will go down before and after the Q2 earnings releases, SPY 280 confirmed in 2 weeks. And we start tomorrow. \n\nI know it is difficult for you. Fuck you.", "score": 1, "replies": [{"body": ">Republicans needs to show that they do not care about big corporates and stocks now.\n\nI’ll take “Things that will never happen” for $1000, Alex", "score": 6, "replies": [{"body": "Thank you, I am not europoor anymore then lol.\n\nhttps://m.youtube.com/watch?v=PQWTLC65Gao\n\nSee 15:50, the miracle happened.\nBe ready to see trump wearing a fucking mask this week.", "score": 1, "replies": []}, {"body": "I’ll take the daily double", "score": 1, "replies": []}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/ianhurst11 don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "Upvote bc I have the same calls", "score": 0, "replies": []}]}
