{"title": "Betting against ridiculous valuations -", "selftext": "Disclaimer: I do, at times, take small short positions for the purpose of hedging.\n\n  \nA little over a year ago, I chose to short TSLA. The stock was trading at $220. The company was facing liquidity issues, their CEO was making PR mistake after PR mistake, and they were very consistent in missing their production goals - usually to a considerable degree.\n\nWith the fundamental information I had, I was right. The company and its leadership were so hyped...it was practically a cult. The stock would eventually be properly valued, and I would profit.\n\nFast-forward and the stock is currently trading in the $1,000 range. Is the company worth $180bn? Absolutely not. Are they currently worth the $40bn valuation to which I originally balked? Probably.\n\nThe point here is:  \nIf enough people are optimistic about a company for all of the wrong reasons until they're, at least where eventual gains are concerned (all that matters), right...it can buy the stock time to earn its valuation. Where does that leave the short-seller? In the red. You can lose to unwarranted optimism. It happens all of the time (Ackman was \"right\" about HLF).\n\nToday, beaten down airlines and hospitality stocks are VERY popular...and they are trading at levels where they \"should not be\" considering all of the uncertainty in the air along with hurdles that are certain. Any recoveries of these stocks should have been slow, but the recoveries are coming quickly. You are smarter than these investors. You know that the rebound has been too early, too strong, and earnings announcements will cause a drop in these companies' evaluations. You're going to short. I'm telling you that the bullishness of these investors can (and likely will) beat you. They can keep these stocks near a premature ATH as long as it takes for these stocks to earn their value again.\n\nI am not suggesting joining the \"bulls\". I only suggest not to bet on the outcome of a fight against them, unless being right and broke is your thing.", "id": "h9mlhd", "created_utc": 1592247917.0, "score": 32, "upvote_ratio": 0.83, "num_comments": 38, "comments": [{"body": "\"In the short run, the market is a voting machine but in the long run, it is a weighing machine.\"\n\nAlso,\n\n\"Markets can stay irrational longer than you can stay solvent.\"", "score": 37, "replies": [{"body": "The real tldr is always in the comments", "score": 2, "replies": []}]}, {"body": "Lol I would avoid assuming directionality of this market.  Strong forces in both directions means volatility, which means up and down vigorously.  The Fed and the unemployed are an example of two strong opposing forces.  Tesla making profits when its questionable how they are even producing the product is another.  Lots of nasdaq stocks are doing amazing while bluechip stocks are buoyed by the Fed.  \n\nAvoid thinking of a crash, just buy low and sell high and you’ll be half way there.", "score": 6, "replies": []}, {"body": "If Tesla crashed a few days after your put expired you would be right but have the timing wrong. You were wrong on Tesla. Company has a very unique product that will give them a competitive advantage. \n\nA mania first takes out those who bet against it and then those who bet with it. I agree that Bears should tread carefully on this. Prob best wait until Fall and then bet the house on June 2021 puts.", "score": 4, "replies": [{"body": "It wasn't the product I thought to be overvalued; it was the company's inability to properly set goals and meet them. I assumed that investors would lose faith in Tesla's ability to execute. That didn't happen. I was definitely wrong as investors were very forgiving. I was wrong in thinking that another company - with more experience in production - would step up and give Tesla a run for their money, taking away their edge. That also didn't happen.\n\nPS. I thought the same might happen to BYND after TSN pulled their investment to compete. Nope!", "score": 1, "replies": []}]}, {"body": "Look, the market is only partially a popularity contest. The other part is mostly driven by two forces only: fear and greed. Right now, what is driving the market? Fear. This seems counterintuitive because people associate fear with selloffs, but let me explain. \n\nThe FED just printed $7 trillion new dollars out of thin air. While they aren't going to wall street and buying blocks of stock outright, they are buying bonds. What does this accomplish? It frees up debt obligations from funds that can offload bonds back onto the FED. Why would these funds want to do that? Because of inflation. Bonds are returning next to nothing right now, in fact the interest rate is 0% on treasuries. AND the FED printed $7 trillion new dollars....so you put these two pieces of information together and you see that investors, especially funds and the super wealthy, are scared that their cash is going to become less and less valuable over time. They speculate that the new money printed will flow into equity markets, because investors looking for a return on investment have literally almost nowhere else to look right now....this will drive equities higher and perpetuate the mentality of inflation causing dead cash to fall behind, and that record sidelined cash will get put to work as well. \n\nThis bubble is just getting started.", "score": 3, "replies": [{"body": "I found it:\n\n[https://www.reddit.com/r/stocks/comments/guqlgw/this\\_is\\_why\\_stocks\\_are\\_going\\_up/](https://www.reddit.com/r/stocks/comments/guqlgw/this_is_why_stocks_are_going_up/)", "score": 2, "replies": []}, {"body": "I agree that fear, in this case, means buying shares. A reddit user wrote a really great piece a few weeks ago on the inflation of assets.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yes, I personally think we're in BTD territory until further notice at this point.", "score": 2, "replies": []}]}]}, {"body": "Your mistake with TSLA was not understanding that the share float is small, with the majority of shares being held by insiders and a dozen institutional accounts...leaving less than 20 million shares out there in the wild.  It's a massive rolling short squeeze.\n\nCheck out www.whalewisdom.com\n\nYour fundamental analysis is correct, however, until you get institutions to get off the position en masse, the shares just keep moving higher with every incremental long buyer.\n\nThe same issue arises with stocks like NFLX, LULU, SHOP, NVDA etc.\n\nSmall float stocks where large percentage held by big institutions, easy to squeeze it higher and crush short sellers.", "score": 4, "replies": [{"body": "So, this is now rather funny to me. I've made, what I consider, two great mistakes with shorts. TSLA, as mentioned was the first. My second was actually LULU. Fortunately, I broke even on LULU but only by the skin of my teeth. The experience was not pleasant.\n\nI'm going to spend some time with this site. Thanks for the link and the explanation.", "score": 1, "replies": [{"body": "Remember : The market can remain irrational longer than you can stay solvent. (JM Keynes).", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "It would be more accurate to say that you were in fact wrong (without quotes).  \nI've been \"wrong\" and made a lot of money. :)", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "We've discussed this before, and I agree - the problem is exacerbated with a fundamentals-only approach. On that note:  \n\\-There's little perceived value in shorting unless you're betting against institutions and believe a stock will be right-sized. If shorting after it's been made clear institutions have lost faith, many will find that the shares are unavailable to short.  \n\\-A fundamentals-only approach doesn't have very much risk with buying long, particularly if healthy dividends are involved. It's not the best way to invest, but it's hardly dangerous.", "score": 2, "replies": []}]}, {"body": "Most people are buying these stocks because they are at a low enough price that they are comfortable with buying in and sitting on it for a year. I don’t think anyone that buys these type of stocks think that they are going to pass all time highs or get close anytime time soon.", "score": 1, "replies": [{"body": "The short interest on AAL and SAVE are sitting around 30%.", "score": 1, "replies": [{"body": "Good, much more long interest.", "score": 1, "replies": []}]}]}, {"body": "Yup. And most of all, do not bet against the fed either.", "score": 1, "replies": [{"body": "No joke!", "score": 1, "replies": []}]}, {"body": "Even if we could completely eradicate covid-19 at this point, there would still be long term negative effects.  For example, we are going to be more prepared for the next pandemic, many people have permanently lost their job and business, dozens of large corporations have filed for bankruptcy, government's around the world have created huge amounts of liquidity that mostly need to be paid back, there are massive protests around the world to fight oppression, and supply chains are devestated and restocking inventory is taking a lot longer than usual.\n\nSo with all of that, if the last 4 months didn't happen, are we in a better position moving forward than we were in January/February?", "score": 1, "replies": []}, {"body": "Buy stocks that are rising.  and sell stocks that are falling.  Anything else is second-guessing the market.", "score": 1, "replies": [{"body": "Depending on how exactly you mean what you just said, that could be one of the most incredibly foolish things anyone has ever uttered. It's that kind of 2 dimensional outlook, like everything is just Black or White, you have to be a Democrat otherwise you're a Republican, for or against immigration, buy when they go up, sell when they go down, that is the reason why so many people are failing in life.", "score": 1, "replies": []}]}, {"body": "At some point the valuations will drop, but nobody knows when.   I really hate betting against the big names, because they will still have a glow even after a reversal and people will want to buy in.  It's easy to misjudge the depth of bullish sentiment.\n\nMaybe an alternative would be to find a second-rate company which has unfairly profited from the rally and is overvalued as a result.   One that no one's talking about.", "score": 1, "replies": []}, {"body": "I feel like it's a whole new paradigm of investing. For me, it used to be researching to find companies with good balance sheets, consistent profitability, uninterrupted dividends, etc. Now it seems to be a complete crap shoot. I'll still buy and hold good stocks, but I've lost a lot of faith in the market (and my fellow humans, to be honest).", "score": 1, "replies": [{"body": "It's like farm analogy Buffet always uses. If that's your approach stick to it and believe in it. It's proven to work and will likely continue to, even if in the short term some other momentum based approach is superior.", "score": 1, "replies": []}]}, {"body": "Same thing with ZM and all of the overvalued SaaS stocks. Are they overvalued? Absolutely. Would I bet that they decrease in value? Absolutely not.", "score": 1, "replies": [{"body": "They will decrease in value if they are unable to deliver the numbers people are expecting and the reason why people are ploughing into them so fiercely now. The earnings and growth with be the true yard stick. It's another dot com bubble, just not yet on that epic scale. The same phenomenon is playing out.", "score": 1, "replies": [{"body": "Possibly. But there are some who believe, including myself to a degree, that this is not a bubble so much as a digital transformation. We will likely see drawbacks, but every company, even those in no way related to tech, are being forced to modernize. There's no alternative anymore. Every company needs back end visibility (DDOG). Every company needs security (CRWD). Every website needs a CDN (FSLY or NET). Every company needs a video conferencing solution. Every company needs data analytics (AYX). Of course there are exceptions. But these aren't companies with no clear path to profitability like so many in the dot com bubble, many of these are already profitable or could be if they weren't spending so much on growth. Anyway, I'm heavily biased, as I love tech/growth/SaaS. But I don't see this as a bubble. I see it as an incredibly investment opportunity with bumps along the way.", "score": 1, "replies": [{"body": "A transformation is exactly what the dot com bubble was. New technology (the internet) was going to be huge, and everyone knew it, but everyone got too excited too early and ploughed into unprofitable companies purely on the basis that they were internet based. Out of that came the giants that dominate corporate culture today, but look how many never made it on huge promise. It's the same story with Blockchain and the initial crypto bubble that burst to devastating effect. I'm not deying that the Cloud and the AI revolution isn't going to change the world, it will, but this is too early and too many companies are using it as way to attract investors without having a useful function. I too love some of the stocks but many are going to get slaughtered as time goes on and people discover that their offerings are hollow. Atlassian is a personal favourite!", "score": 1, "replies": [{"body": "I agree, mostly. I think the difference is that the sales execution and profitability with many of these companies is superior to many of the players in the dot com bubble. The issue is the valuations are out of control. Time will tell.", "score": 2, "replies": []}]}]}]}]}, {"body": "Tesla will be 5000 in 5 years. Not a joke, people are just short sighted how how brilliant Elon is.", "score": 1, "replies": []}, {"body": "Agree that in many ways, in the short term, you are betting against the psychology of other investors which can very often be a bad vote on the future. But, ultimately, the earnings and other similar metrics will vindicate your position and bare out the truth. Disagree with your point about Tesla. They have some massive advantages against their nearest compeititors. They are lightyears ahead in so many ways. They are also so much more than a car manufacturer. So many other avenues  are going to open up in the future. Not to mention they have one of the most innovative leaders the modern world has ever seen.", "score": 1, "replies": []}, {"body": "If you stand for nothing you'll fall for anything, or something like that.\n\nFundamentals are all that matter. If you're not investing based on fundamentals, then you're just speculating based on the greater idiot law. Both have their place, just be honest about which position you're taking.", "score": 0, "replies": [{"body": "That said, I'm not criticising your advice to people who should at least give some consideration to fundamentals before they faceplant the keyboard and put their entire net worth in a donkey stock that's moving vertically up. Most of the people on here should stay well away from stocks and even computers for that matter.", "score": 2, "replies": []}, {"body": "You can speculate based on future growth if you have confidence in it. Look at Facebooks historical PE multiples. By your theory you'd have never invested in Facebook because their fundamentals were unsound. There are other ways to invest that are more speculative in nature than pure value investing, but require a different set of skills that won't be learned at the Buffet school.", "score": 0, "replies": []}]}, {"body": "Never bet against Elon, he's master manipulator, and will get things done.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "No. The purpose of the post is to share my experience with any who don't have the benefit of a similar experience.", "score": 4, "replies": []}]}]}
{"title": "Tomorrow", "selftext": "So I heard that Dow futures dropped 3 hundred points today and I'm wondering, are we going to have a really shit day or somewhat shit day. Thoughts ???", "id": "h96l6a", "created_utc": 1592185789.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 30, "comments": [{"body": "That's 1%. The media is just trying to spread fear. Buy the dips, have cash for deals that present themselves.", "score": 20, "replies": [{"body": "Always use the bigger number to scare people.", "score": 6, "replies": [{"body": "“Biggest drop in Dow history!” When in reality it was only 4% lol gotta love the media am I right?", "score": 3, "replies": [{"body": "sorry your right I need to do more research then just reading articles, sadly I believe the young investors like me will still fall for this.", "score": 1, "replies": []}, {"body": "To be fair 4% is weeks of price action in a normal simulation, but we glitching and we forgot about it lol", "score": 1, "replies": [{"body": "True. It was up 20% in a week at one point if I remember correctly. That’s a few years worth lol but the fact remains that when they say “largest point drop” it’s not really in relation to percentage, which is the important part.", "score": 1, "replies": [{"body": "Yeah im not sure why im loosing my time on such a beta post lol", "score": 1, "replies": []}]}]}]}]}, {"body": "its down almost 900 now 3%", "score": 1, "replies": []}]}, {"body": "Media trying to cause a quick sell off in the AM. Whales swoop in to buy bulk shares for cheap... leaving the rest to FOMO and buy back in at a higher price point...", "score": 13, "replies": [{"body": "This.", "score": 0, "replies": [{"body": "This!", "score": 1, "replies": []}]}]}, {"body": "I think the whole week will end flat.", "score": 9, "replies": [{"body": "I call it an okie doke.", "score": 2, "replies": []}, {"body": "Because the market just wants to see me rip my hair out at this point", "score": 1, "replies": []}]}, {"body": "I hope it tanks another 6%, honestly. This little reality check on Friday restored some of my faith in a return to rationality.", "score": 10, "replies": [{"body": "not sure if 6% is enough tho. It rallied way too quickly from the bottom.", "score": 0, "replies": [{"body": "You could use the counter argument that it rallied appropriately in terms of how quickly it dropped.", "score": 2, "replies": [{"body": "It rallied only bc FED pumped it though...", "score": 1, "replies": [{"body": "That’s only part of the equation.", "score": 2, "replies": [{"body": "The other part is people on their phones investing with pennies. The hardship is just beginning", "score": 1, "replies": []}]}]}]}, {"body": "Agreed, but it's likely not gonna retest that bottom at the same speed as the crash in March. But a consistent decline back down, and a slower more rational climb back up would give me the confidence to get back into the market.", "score": 1, "replies": [{"body": "yea i also doubt it will go more than 15% this time. We wont close the economy again, so yea.. but this volatility will last for a long time.", "score": 2, "replies": []}]}]}]}, {"body": "i dont understand why people are so angry when ever someone mention that the stock might crash or drop. I get fed is printing money, but for those of you young investor with mindset that the stock market will never drop again, you guys are shooting yourself in the foot. look at it from both sides and dont refute other peoples claim just because it doesnt allign with what you think. if you only think you are right you are gona get burned hard. Its like people investing in Hertz. what are you people even thinking? gambling your money in a game of musical chairs?", "score": 3, "replies": [{"body": "Hertz is a total pump from big money to suck in inexperienced investors whom will get burned. Same for NKLA", "score": 2, "replies": [{"body": "NKLA basically spent the whole week at 60 or above. Personally, I sold my initial investment and I’m holding some shares with house money now. I don’t know what to think of it at this point honestly—I certainly agree it makes no sense. But I don’t think it’s a P&D in the traditional sense?", "score": 1, "replies": []}]}, {"body": "I learned in past few months that we are dealing with so many rookies who poured in and are mirroring recommendations, completely blindly. \n\nWe are in for a drop to make all drops this week. \n\nOh yeah, and then add all the bearish technicals! Yummy!\n\nSpy puts, Vix calls.", "score": 1, "replies": []}]}, {"body": "I'm going to be taking a shit that day regardless. Maybe it'll be a good one or explosive diarrhea.", "score": 2, "replies": []}, {"body": "buy dem dips!", "score": 0, "replies": []}]}
{"title": "Ahahaha Dow down 900 points.", "selftext": "Looks like a very interesting week. Remember calm down and buy cheap stocks. Good luck to yall fellas.", "id": "h9add6", "created_utc": 1592201606.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 40, "comments": [{"body": "Reminder to people: don’t panic and sell. You don’t lose until you sell.", "score": 11, "replies": [{"body": "Correct! It just means you'll be bag holding for a few more years", "score": 10, "replies": []}, {"body": "I panic and sold, but I actually gained?\n\nLocking in profits is a much better strategy than \"staying the course\"", "score": 1, "replies": []}, {"body": "[deleted]", "score": -5, "replies": [{"body": "Please dont swear, im a christian", "score": 2, "replies": [{"body": "This. (I am Jewish but also do not swear.)", "score": 2, "replies": []}, {"body": "My apologies.", "score": 1, "replies": [{"body": "🤣", "score": 1, "replies": []}]}]}]}]}, {"body": "Dont be fools guys... the big boys just try to scalp all those retail investor who will panick sell fearing for their investment.", "score": 2, "replies": []}, {"body": "Is there any specific reason why", "score": 1, "replies": [{"body": "Look at Beijings respike and Irans cases rising again- all propagating the threat of a second wave", "score": 3, "replies": [{"body": "Bruh, we didn't even leave the 1st wave yet.", "score": 1, "replies": [{"body": "The USA hasn't but I'm pretty sure China has left the 'first wave'", "score": 1, "replies": []}]}]}, {"body": "I have no idea but I'm guessing is because of the recent covid-19 spoke thru out the United States.", "score": 1, "replies": []}, {"body": "Don't panic tho. If you can buy cheap stocks do. Unfortunately I can't bc I'm maxed out already. Good luck you my friend. It was a rough last week but we can still hold on. Hold on a bit longer and it will pay off believe me.", "score": 1, "replies": []}]}, {"body": "Time to start doing option puts or get into some short stocks and put a limit sell at double the price. And then wait for the market to turn around. This bottom is going to be steep.", "score": 1, "replies": [{"body": "How do options work and puts ?", "score": 0, "replies": [{"body": "Calls are betting the market goes up within a given amount of time and puts are betting the market will be going down. This is a very simple term for them. There is also volatility that is put into how much they go for. Just some heads up from my past mistakes NEVER buy a call or put that is only a week or even a month out. Always buy them for at least 6 months out or a year. Yes they are more expensive but it allows you time to ride the wave. Always sell your options before they expire or you will lose out on money. You can also get into short stocks like the sdow. It's about $25 a share but the stock hit a high of $90 back in March. Buy it and put a limit sell for double the price and then never buy back in.", "score": 2, "replies": [{"body": "I get it now. But aren't they more risky ?", "score": 1, "replies": [{"body": "Yup because the market over the majority of the time has always gone up. But now that we are in a recession they are not as risky. But like every investor you need to pull out while you are ahead.", "score": 1, "replies": [{"body": "I lost over 4k already but I'm still holding on dearly to my stocks. They will pay off in the long run.", "score": 2, "replies": [{"body": "I was up about 100% before last week and I sold off everything for a 50% profit I saw this pattern in March and I learned my lesson. Im in some short stocks but only like $100 the rest is cash. I'll be making some small $s tomorrow.", "score": 1, "replies": [{"body": "Good luck to you my friend. Godspeed.", "score": 2, "replies": [{"body": "Same to you my friend", "score": 1, "replies": [{"body": "Thank you.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I still don’t understand why 90% of this sub won’t learn to use options.\n\nWhatever, thanks for the liquidity either way.", "score": 2, "replies": [{"body": "Go visit /investing...some trader 20 years old committed suicide, lost 700k using options", "score": 9, "replies": [{"body": "That sounds scary.", "score": 3, "replies": []}, {"body": "Same with driving cars, so what?\n\nThat trader took too much risk.\n\nWhatever man, stay scared. Enjoy the bull trap and do what you can with your limited skills in riding red days.", "score": -5, "replies": []}]}, {"body": "Please, enlighten us.", "score": 2, "replies": [{"body": "Let’s say it’s a big day, 2-4% moves down. \n\nWhat do you do without options or futures?\n\nSell and go to cash? Buy inverse ETFs? Anything else? Shorting is lunacy so let’s cross that off right away. \n\n\nLet’s say the market is stagnant and sideways, what do you do? Especially if the underlying asset has no dividends?\n\n\nOptions fixes all those problems and by default, is a defined risk trade for debit positions. It’s the different between investing with insurance and without. I for one, like having a condom on my portfolio.\n\nPlus, I can hedge the entire portfolio in about 30 seconds with beta-weighting against SPY, SPX or the ES futures. \n\n\nOptions and futures aren’t risky, only investors are.\n\nIt’s the same fundamentals of position sizing and money management no matter what you’re doing, plus the rules of your trading plan.\n\nOptions just give you...so many more options and tools in your arsenal. \n\nWhy not get educated?", "score": -4, "replies": [{"body": ">\n>Why not get educated? \n\nOptions seem to be a topic where there are so many \"educators\" out there that either dont really understand the subject matter, or are really poor at explaining it.", "score": 4, "replies": [{"body": "Exactly this. Ask these educators how to sell your options, and how does volume play a role? Oh, what about theta? How do you calculate your delta?", "score": 2, "replies": []}, {"body": "Ugh, do whatever man. \n\nI don’t care.", "score": -11, "replies": [{"body": "You care enough to brag in front of random Internet strangers you sausage", "score": 9, "replies": []}]}]}]}]}, {"body": "Won't learn? Would love to, but my broker won't let me trade options. Their reason being that I would BE TOO GOOD AND MAKE BANK.", "score": 1, "replies": [{"body": "Get a new broker.", "score": 4, "replies": []}]}]}, {"body": "I feel lucky as hell, I sold everything (not much lol) just before the end of the rally last week.", "score": 0, "replies": [{"body": "Good timing!", "score": 0, "replies": [{"body": "well in reality my biggest position just keeps getting higher and higher :p", "score": 1, "replies": [{"body": "Respect! Remember not to be greedy and sell for gains. 👍", "score": 1, "replies": []}]}]}]}]}
{"title": "Worth selling at a loss and buying again?", "selftext": "Since everything is looking bad due to 2nd wave fears is it worth if I sell my current stocks MSFT which I bought at 191 and UK bank Lloyd’s at 0.34p and buy when they have dropped a little more", "id": "h9c6dm", "created_utc": 1592210037.0, "score": 12, "upvote_ratio": 0.69, "num_comments": 34, "comments": [{"body": "Total fear amongst investors today, headlines are overly panicky. With a stock like MSFT don't sell for a loss. Solid business & the wheels will keep turning, virus will pass. Anyway they sell more digital games when people are locked down, more Skype users, more home office users, more requirement for cloud services.\n\nPlus when Bill Gates successfully uses the covid vaccine to implant microchips in all of us, the stock will skyrocket.", "score": 49, "replies": [{"body": "F u billi boi!", "score": 2, "replies": []}, {"body": "😂😂 forgot about that, definitely a solid long term investment then", "score": 5, "replies": []}]}, {"body": "In order to do that, you have to be right twice. You have to sell and buy at the price to avoid spending more than you paid for.  If you wanted to sell, you should have done it last Wednesday.", "score": 9, "replies": []}, {"body": "I don’t think you’ll be selling MSFT at 191 for a while anyhow.. I also think that if we’re in for a major decline , indices may test new lows overall, but specific stocks e.g. MSFT may not get close to testing their new lows as more is known about the pandemic and consequences a 2nd wave might bring, that’s just my 2 cents!", "score": 5, "replies": [{"body": "Are you saying you dont think MSFT will hit 191 for a while?", "score": 1, "replies": []}, {"body": "My bad lol I meant I bought MSFT at 191", "score": -2, "replies": [{"body": "That is also what he is commenting on...", "score": 2, "replies": []}]}]}, {"body": "Don't lock in a loss if you don't need the money, I'd just avg down with MSFT honestly", "score": 4, "replies": [{"body": "Yeah, why sell unless you think we falling past March lows?", "score": 4, "replies": [{"body": "Yeah true I feel as if I’m scared I’m going to lose out on gains made elsewhere in stock market. I think I’m gonna keep hold of it, I mean I don’t make a loss until I sell.", "score": 0, "replies": [{"body": "Unless you need the capital to make those plays nothings stopping you from doing so. If anything you’ll end up more diversified.", "score": 1, "replies": []}]}]}, {"body": "> Don't lock in a loss if you don't need the money, \n\nthat being said, there are exceptions where it can make sense to do this.\n\none of the youtubers i follow did a video where he explained that he owned equal shares in delta and simon property. when they were  both down, he realized that they had been tracking EXACTLY the same for quite some time. he sold his delta (getting a big loss), put all the money into simon, then they continued to track and he went into profit territory.\n\nthe end result is that he had  the same stock value as if he had done nothing, but he harvested a big loss that he can use when filing his taxes to minimize his taxes due.\n\n[link](https://www.youtube.com/watch?v=WiDPMZuxUqY) to video, relevant part starts at 3:45\n\nthis is obviously a gamble and is effectively using the loss as a way of investing. probably not relevant in satou's case, but just providing an example where selling at a loss can be a net gain.\n\nthe other exception to \"don't lock in a loss\" would be if you aren't confident the company will continue to exist and will eventually go into bankruptcy. taking a loss in jcp or hertz a month or two ago would have been better than waiting. (again, probably not relevant to his specific case since ms isn't going bankrupt any time soon, but in terms of blanket rules, there definitely are times to sell at a loss)", "score": 2, "replies": [{"body": "While this is great advice, I think in the context of MSFT, it can be simplified to \"don't take a loss if you don't need the cash\"", "score": 2, "replies": [{"body": "> While this is great advice, I think in the context of MSFT, it can be simplified to \"don't take a loss if you don't need the cash\"\n\nabsolutely. in this case, don't take the loss. like i said, that was more a commentary on treating \"don't take a loss if you don't need the money\" as a general and universal rule.", "score": 2, "replies": []}]}]}]}, {"body": "Depends on how low it drops. You gotta do the math.", "score": 1, "replies": []}, {"body": "If you know that it’s going to drop more, then sure. But that isn’t something that you know for sure", "score": 1, "replies": []}, {"body": "Sell covered calls if you think the price is going down.", "score": 1, "replies": [{"body": "Sure but I have a feeling someone making a post asking about if they should time the price of MSFT does not have 100 shares of MSFT to be able to sell a covered call...thats like $18k worth of equity.", "score": 4, "replies": []}]}, {"body": "When selling and buying back you need to factor in the broker fees and exchange rate fees when selling and buying same stock again. May be better to just leave it to grow its way out of this minor scare", "score": 1, "replies": []}, {"body": "If you have a good feeling the stock will go down, look into selling covered calls.", "score": 1, "replies": []}, {"body": "msft imo will have reduced downside than other stocks in this environment\n\nwidespread selling would depress the price as all things become effected and all i would do is add more to your position if possible if you see lower prices", "score": 1, "replies": []}, {"body": "Better sell at 185 than at 150 in my opinion", "score": 1, "replies": []}, {"body": "Wash sale alert", "score": 1, "replies": []}, {"body": "I actually did that with MSFT, bought in February at $186 with all the hype about the $200 calls going around here lol. And got out before the crash at $180. It worked out then as I invested 5k  and was able to get back in when it was $144. \n\nBut who knows", "score": 1, "replies": []}, {"body": "no one ever got poorer by taking a turn, that's what i learned.\n\nBy the way, it's a pleasure to see my fellow investor in UK. \n\nI'm bearish lloyds actually, i think the best bank in UK to own today is still Barclays, least exposure to NII / NIM and you have an thriving investment bank which has been severely underappreciated by the market.", "score": 1, "replies": [{"body": "I was torn between Lloyd’s and Barclays only had 5 to invest so went with Lloyd’s and MSFT", "score": 1, "replies": []}]}, {"body": "Never be afraid of cutting losers early, its the best.\n\n\nSell half and rebuy cheaper", "score": 1, "replies": []}, {"body": "I don't think so it is that easy. I sold AAPL at $310 with the similar thinking. Forget about buying at low again, I am waiting for it to come down to $310 to buy back my shares.", "score": 1, "replies": []}, {"body": "If you sell Microsoft now and recognize loss and repurchase the share within 30 days, your losses will be washed. I would buy more to average it them down.", "score": 1, "replies": []}, {"body": "Since buying shares transaction cost is free. Buy small amounts so you have cash around to swing. Microsoft is a long term play. It's very good company.", "score": 1, "replies": []}, {"body": "I think its a good idea to sell today and buy back in a couple of weeks. Honestly, this drop is as predictable as the first one was. Jest get out now, the market will go down south from here short to mid term", "score": 1, "replies": []}, {"body": "If you have 100 shares sell calls on it. MSFT is one of the few safe havens left don't sell got nothing else better to buy.", "score": 0, "replies": []}, {"body": "You're going to be a loser in the stock market if you're already thinking of panic-selling MSFT of all stocks...", "score": 0, "replies": []}]}
{"title": "“History Doesn't Repeat Itself, but It Often Rhymes”", "selftext": "Here's the daily SPY chart for the past six months:\n\nhttps://i.redd.it/go0u4fg420551.png\n\nOf note:\n\n1. Euphoric peak with low volume\n2. Sudden gap down off extreme highs\n3. Large intraday moves with increasing volume\n5. MACD crossover\n\nAlso, you could argue the past 3 months are another '3 peaks and a domed house' formation (a smaller version of the one that preceded the March crash)", "id": "h98u3y", "created_utc": 1592194934.0, "score": 76, "upvote_ratio": 0.88, "num_comments": 32, "comments": [{"body": "[deleted]", "score": 166, "replies": [{"body": "[deleted]", "score": 35, "replies": [{"body": "Sounds like you just want to look at his dick 🤔\n🌈🐻", "score": 22, "replies": []}, {"body": "Yep just like this champ Todd Carney (Kang Gang will know him, he is an Australian \"bad boy\" rugby league player).\n\nhttp://i.imgur.com/luwXSfb.jpg\nhttps://www.reddit.com/r/australia/comments/29bygi/todd_carney_taking_the_piss_literally_nsfw", "score": 3, "replies": []}]}, {"body": "MODS. ITS HAPPENING AGAIN. THE ONLY PLACE ON EARTH THIS WOULD HAPPEN TWICE", "score": 60, "replies": [{"body": "Sometimes I can't tell whether this is a trading subreddit, a (hopefully)  niche fetish subreddit, or an online asylum for the \"mentally challenged\".", "score": 10, "replies": [{"body": "Sir, this is a meme factory.", "score": 6, "replies": []}, {"body": "The answer is Yes", "score": 2, "replies": []}]}]}, {"body": "So wait, all I have to do to get my YOLOs to print is promise to drink my own piss the following day if the market moves in my direction?\n\nWow, I think I've finally figured out trading", "score": 7, "replies": [{"body": "Its called a hedge. Its basic trading strategy, smh.", "score": 6, "replies": [{"body": "It’s a yolo retard everything all in is not a hedge", "score": -1, "replies": []}]}]}, {"body": "RemindMe! 1 day", "score": 3, "replies": []}, {"body": "!remindme 14 hours", "score": 2, "replies": [{"body": "!remindme 14 hours", "score": 1, "replies": []}]}, {"body": "Chug chug chug", "score": 2, "replies": []}, {"body": "Dude, i thought about making one of these bets praying to lose.", "score": 1, "replies": []}, {"body": "!remindme 6 hours", "score": 1, "replies": []}, {"body": "Video or lifetime ban!!!!!!!!", "score": 1, "replies": []}, {"body": "How did it taste?", "score": 1, "replies": []}, {"body": "Unless somehow this dude was smart enough to cash out in the first hour, he's still living that piss-free, money-free life.", "score": 1, "replies": []}]}, {"body": "Looks like a flaccid dick formation.", "score": 22, "replies": []}, {"body": "If the information used to justify future price movements is too obvious, the market usually does the exact opposite.", "score": 30, "replies": [{"body": "Yup", "score": 10, "replies": []}, {"body": "Plus they've literally said 'we gon print infinite money' how many times now?  \n\nWe're all either floating on funny money that will fuck us all or just coasting by on borrowed time and either crash will stagnate for years to come, save for a few exceptional stocks like amazon and tesla.", "score": 4, "replies": []}, {"body": "Damn so puts bad?", "score": 1, "replies": []}]}, {"body": "That looks like my wife's Vagina", "score": 4, "replies": [{"body": "Her boyfriend must be taking her to Pound Town frequently.", "score": 5, "replies": []}, {"body": "Those are the ovaries up there.", "score": 1, "replies": []}]}, {"body": "So you’re telling me different series of green and red dildos predict the future?", "score": 4, "replies": []}, {"body": "Pandemic Announcement vs Months old gay covid news? Sorry bears...", "score": 1, "replies": [{"body": "Ya wtf, says low volume before crash. There was low volume for like a year straight", "score": 2, "replies": []}]}, {"body": "\" '3 peaks and a domed house' formation\"... You've been eating too many of your crayons", "score": 0, "replies": [{"body": "Anyone that comes up with any of those formations is definitely eating something much stronger than crayons", "score": 1, "replies": []}]}]}
{"title": "SPY 3/31 21' 350C - loading", "selftext": " [https://www.bloomberg.com/news/articles/2020-06-15/morgan-stanley-economists-double-down-on-v-shape-global-recovery](https://www.bloomberg.com/news/articles/2020-06-15/morgan-stanley-economists-double-down-on-v-shape-global-recovery)", "id": "h9e7xm", "created_utc": 1592219413.0, "score": 20, "upvote_ratio": 0.71, "num_comments": 31, "comments": [{"body": "[removed]", "score": 36, "replies": [{"body": "If you want to be poor...", "score": 11, "replies": [{"body": "as long as it’s in your risk management", "score": 1, "replies": []}]}, {"body": "Guys sorry for endless retardness, but im here to learn a bit from you pros. What does exact 350 7/06 mean? Long option for 350$ expires on 6th July?", "score": -25, "replies": [{"body": "A) don't come here to try to learn anything except how to lose money\n\nB) yes", "score": 48, "replies": [{"body": "Those are the types of questions right before a market crash.", "score": 11, "replies": [{"body": "I’ve had multiple friends who work in blue collar jobs start asking me about the markets for first time ever.\n\nI’m all about people getting involved in the markets and investing regardless of their job but there is no doubt so irrational exuberance going on right now.", "score": 4, "replies": [{"body": "Same. Most people that don’t invest see the crazy yolo option plays on here and think that’s a normal way to manage risk.", "score": 4, "replies": []}]}]}]}, {"body": "Correct.  Based upon the price they are giving, this person thinks the SPY etf tracking the S&P is going to 350 by July 6th.  \n\nTechnically it should be written : Spy 350c 7/06.  \nAs opposed to what is actually happening this morning so far:  Spy 290p 6/19.", "score": 6, "replies": [{"body": "Could’ve meant July 2021", "score": 2, "replies": []}, {"body": "Understood! Thanks for the help ♥ no 🌈", "score": 1, "replies": [{"body": "I was just trying to explain correct formatting to someone new.  Yeah the title suggests a cal for next year.   This seems ludicrous as we have 26trillion in debt.   If Donnie wins, he no longer needs to pump the market.   If Biden wins, the market will drop after a month of mild optimism.  \n\n\nEither way, we are very screwed by next March.", "score": 2, "replies": []}, {"body": "hey, around here it's full homo or get out.", "score": 2, "replies": []}]}]}]}]}, {"body": "No one knows shit about shit.", "score": 24, "replies": [{"body": "gastroenterologists know a lot about shit.", "score": 29, "replies": [{"body": "You got me there.", "score": 3, "replies": []}]}]}, {"body": "We’re dumping immediately after the elections. Trump is going to pump that shit as much as he can", "score": 8, "replies": []}, {"body": "Tell Morgan Stanley positions or ban", "score": 3, "replies": []}, {"body": "MS has been bullish since the March drop    They haven’t been wrong", "score": 2, "replies": []}, {"body": "That didn’t age well", "score": 4, "replies": [{"body": "That didn’t age well either. Kang gang!", "score": 4, "replies": [{"body": "Lol damn, unreal.  I’ll check back before close", "score": 2, "replies": [{"body": "Check before open", "score": 1, "replies": [{"body": "And it’s up bigly", "score": 1, "replies": [{"body": "Embrace the almighty Powell", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/itsonlyfiat the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "420.69", "score": 14, "replies": [{"body": "The DD I needed.", "score": 1, "replies": []}]}]}, {"body": "I was confused why it was 3/31 and thought you misstyped or some shit but nope this retard holds shit for almost a whole fucking year... What the fuck is wrong with you? Your wife's boyfriend pussy hands are gonna sell it for you once the market drops 1% on any day", "score": 1, "replies": [{"body": "Delta > Theta. I’m actually holding 12/16 22’ 400C.\n\nI’m gonna jizz all over that ugly face once it prints", "score": 2, "replies": []}]}, {"body": "😂😂", "score": 1, "replies": []}]}
{"title": "That REAL TA: What Goes Up, Must Come Down", "selftext": "I'm no chart analyst, because all those guys are fucking broke. But here's what I'm going to do for all your clowns to make sure you get a clear picture of how this next crash is going to look so that you don't cash out your measly profits when shit doesn't go your way for a little while. And if you're reading this and you don't think it's going down--oh, yes it fucking is. It's going down harder than the WSB mods' moms on Warren Buffet's wizened cock. \n\nThis is a picture of the absolutely absurd rally in SPY we just experienced since we bottomed out in march:\n\n[I know, It Doesn't Make Any Goddamned Sense](https://preview.redd.it/tto5r5ngp2551.png?width=2380&format=png&auto=webp&s=6d3981a2d9039f56beb2caff97ada7de1d12be76)\n\nHere's a picture of that rally flipped upside down and haphazardly glued on as a future projection:\n\n&#x200B;\n\n[If You Know Anything about TA, This is the Fucking Gospel](https://preview.redd.it/6zqcsd6wp2551.png?width=1952&format=png&auto=webp&s=290e58fe1dccc430824143e70401d3e4e53a402c)\n\nAs you can clearly see from how it fits the current drop so far, this is exactly what's going to happen. So in the next day or two we're going to drop down to the low 290's to touch the 50 SMA but then bounce idiotically upward, conceivably all the way back to the 310's. You might want to close out your puts early in the week to look for better prices on that bounce, because after that (probably next week) it's going to dump spectacularly, noodle around in an annoying range for a few weeks and then dump again. \n\nSPY 8/21 270p\n\nYou're welcome, idiots.", "id": "h9g6f5", "created_utc": 1592227070.0, "score": 75, "upvote_ratio": 0.83, "num_comments": 38, "comments": [{"body": "All i know is stonks go up", "score": 63, "replies": [{"body": "STINKS", "score": -2, "replies": []}]}, {"body": "This time is different", "score": 32, "replies": []}, {"body": "Beautiful. All in puts", "score": 20, "replies": []}, {"body": "Ok but why didnt you warn me I bought calls at the top", "score": 8, "replies": [{"body": "The real problem with WSB posts", "score": 6, "replies": []}]}, {"body": "What goes down, must come back up", "score": 15, "replies": [{"body": "Higher than ever too. Ready to make those previous ATH look like ant gains", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": []}, {"body": "\"So in the next day or two we're going to drop down to the low 290's to touch the 50 SMA but then bounce idiotically upward, conceivably all the way back to the 310's\"\n\nWho would have thought this would all happen in a single day?", "score": 6, "replies": []}, {"body": "fake bear", "score": 3, "replies": []}, {"body": "It’s going to go down because everyone and their mamas will be selling at opening bell. Fear, uncertainty, doubt is in the air fellas.", "score": 6, "replies": [{"body": "It's gonna go down because this picture I made, duh", "score": 28, "replies": [{"body": "Godspeed soldier", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Almost every time in the past month we've had a down morning (not talking pre-market, talking during open hours) not only has it recovered it's gone higher. Check the charts, practically every time it goes down in the first two hours or so it's recovered hard. Jun 1st, 8th, 9th and 10th for a few recent examples. It hasn't ALWAYS happened, but it's happened more than it hasn't recently. It's been a pretty reliable strategy as of late, just set a stop loss to save yourself from the losses on the days it doesn't\n\n\n\n\n\n\n\n\nPeople panic in the morning, then it starts going up again and doesn't slow down", "score": 2, "replies": []}]}]}, {"body": "Change your handle to WSB Picasso", "score": 2, "replies": []}, {"body": "Remindme! 1 month, what's your wager?", "score": 2, "replies": []}, {"body": "big fucking yikes. didnt realize someone could fuck up in 4 hours.", "score": 2, "replies": [{"body": "seems like it's following my trajectory quite nicely, actually, just on a faster timetable than expected.", "score": 5, "replies": [{"body": "we are simply see-sawing because the market is so uncertain people are desperate to make the right call and time the market.\n\nAlso I think we have uncertainty with people's genuine concerns with covid19.\n\nIf states and governments are not going to stop people from going out and spending money, people are absolutely not going to stop themselves.", "score": 1, "replies": []}]}]}, {"body": "u see the past 10 min green fuking candle?", "score": 2, "replies": []}, {"body": "Your like “there’s this angle and this angle now pick which one to be terrified of” 🌈🐻 bet we still rally later, a 5% dip is more of a temp correction than the big sell I think, total guess but if we go up shorts will cover driving price up more. Or it could drop another 15% 😂  no clue but volatility is the market currently", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Imagine thinking high volatility isn’t the easiest way to make money...", "score": 0, "replies": []}]}, {"body": "I would rather sacrifice to iblis than use technicals in this volatile times.", "score": 3, "replies": [{"body": "Well then this analysis is perfect for you", "score": 4, "replies": []}]}, {"body": "Can’t fight a crooked government", "score": 1, "replies": []}, {"body": "Instructions unclear, actually made profits.", "score": 1, "replies": []}, {"body": "But don’t stocks only go up?", "score": 1, "replies": []}, {"body": "I do this when I have down days.. just flip the chart and call it a win.  I like what you did here.  Keep hustlin cuzzin", "score": 1, "replies": []}, {"body": ">your clowns\n\nLeave my clowns out of this, you fuck!", "score": 1, "replies": []}, {"body": "gg", "score": 1, "replies": []}, {"body": "Is this authorised by jpow?", "score": 1, "replies": []}, {"body": "You put a captain on your image. I'm inclined to trust you. Mostly because your analysis provides a false sense of security for my portfolio.", "score": 1, "replies": []}, {"body": "What goes down must go up. This is America we are here to win", "score": 1, "replies": []}, {"body": "Titled \"REAL TA\"\n\n&#x200B;\n\nUses TD9.\n\n&#x200B;\n\nChecks out.", "score": 0, "replies": [{"body": "This, um, post is satire bro.", "score": 1, "replies": [{"body": "mspaint is a legitimate TA tool", "score": 1, "replies": []}, {"body": "I don't read", "score": 1, "replies": []}]}]}]}
{"title": "A few names I am buying", "selftext": "[deleted]", "id": "h9nkk5", "created_utc": 1592250959.0, "score": 7, "upvote_ratio": 0.62, "num_comments": 32, "comments": [{"body": ">CAKE  \n>  \n>This company makes more money per square foot than any company in their industry.\n\nI haven't looked, but this is A) Cheesecake Factory B) Actually true? wtf?", "score": 15, "replies": [{"body": "I haven't looked either, but at the price I pay for things when I go, they better.\n\nIt's cool, but gets old after a birthday or two there.\n\nTeen kids and rich moms love it though.", "score": 4, "replies": []}, {"body": "Lol helps that they didn’t pay rent for April", "score": 3, "replies": []}, {"body": "False. This is APPL.", "score": 2, "replies": []}]}, {"body": "Levi's seems like a good value play too. We are inevitably opening up, and there is on chance americans go back into lock down now.   \n\n\nThere are two buyers of pants as things open back up. With gyms closed people gained a few inches around the mid section, they will need new pants. Young people who haven't banged it out on a while are going to want to look good as bars open back up. Nothing to boost that confidence like a new pair on jeans.   \n\n\nInterestingly, regardless of the economic direction of the country, most people will continue to wear pants.", "score": 8, "replies": [{"body": "Fuck, I really need a new pair for my fat ass", "score": 8, "replies": []}]}, {"body": "Bargain hunting with hopes and dreams.", "score": 5, "replies": [{"body": "right... hospitality is fucked and people are eating local like never before, corp restaurants are fucked\n\n&#x200B;\n\nsource: me in the industry", "score": 1, "replies": []}]}, {"body": "Cake going back to precovid pricing?  They were the first to say they werent paying rent.  If they stay in business it may hit $40 in two years.", "score": 4, "replies": []}, {"body": "Agree on RTX. Bought shares though. They just anounced a 40+ cent dividend and a contract to support the f15. Shares are the better choice if you have the money IMO.", "score": 2, "replies": [{"body": "Agreed. I’m in shares on all these, except CAKE. That’s a synthetic expiring in January.", "score": 1, "replies": []}]}, {"body": "You forgot HERTZ", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/Wanderer1066 don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Just got in STZ too. On-premise is gone, but off-premise only needs to be up 15-20% to breakeven. Q1 results come out July 1.", "score": 1, "replies": []}, {"body": "RTX and STZ are my favorite.", "score": 1, "replies": []}, {"body": "LUV and RTX are excellent plays. LUV is the best run, best value, best flight attendants and brand, still havent fired anyone in a long time, plenty of room to grow, I could go on and on. \n\nWar is inevitable. Even if it isn't we will see an arms race, and India is gonna join the party.", "score": 1, "replies": []}, {"body": "Y cake over dri?", "score": 1, "replies": [{"body": "That’s not a bad play, but look at the chart. CAKE is down more than DRI, and I like that CAKE has 1 name, and as a consequence better brand loyalty, in my opinion.", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/Wanderer1066 don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "UAL > LUV", "score": 1, "replies": [{"body": "How much international air traffic do you expect in the next year?", "score": 1, "replies": [{"body": "More than March/April lows", "score": 1, "replies": []}]}]}, {"body": "Add PLAY to that list", "score": 0, "replies": [{"body": "FUCK PLAY NEVER AGAIN", "score": 3, "replies": [{"body": "Why what did Dave ever do to you?", "score": 1, "replies": [{"body": "I bought it in the 40s. One of my worst trades. Toxic waste dump of a company, but I learned a valuable lesson. Some things are cheap, because they are a piece of shit.", "score": 3, "replies": [{"body": "Lol damn son I think it's a good price right now for a quick flip if whole market doesn't tank again.", "score": 1, "replies": [{"body": "There are better places to put your money.", "score": 1, "replies": [{"body": "I like cake too but I'm already long July calls on play. It's got some room to run", "score": 1, "replies": []}]}, {"body": "I think PLAY’s whole business model is f’d in this post coronavirus world, and that’s reflected in the price.", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "Anyone else got technicals pointing to a near term pullback.", "selftext": "The KST is one of my favorites, it’s so reliable in the right stocks. The stocks that defy that lately have been a sure thing, PayPal for one as well as most the Covid-19 trades, datadog fasterly and zoom, etc.\n\nMACD is pointing down. RSI is not oversold one bit. \n\nIf you look at bollinger bands though it could be seen as a buying opportunity. The SPY is dead center on that and hasn’t went lower then that since March. The bottom range lines up almost perfect with the 50 day moving average in the 287-291 range, about a 3-4% pullback. \n\nSome of the faster movers shouldn’t be messed with but some puts should def be bought tomorrow afternoon if the markets are up. Maybe spy285s 2 weeks out...to hold over the weekend. \n\nEither way I’m about 70% cash right now so that says a lot. If I don’t see a pullback and buying opportunity I will buy a few puts bc the market has enough to deal with and adding to technical selling pressure doesn’t help.", "id": "h9pfbw", "created_utc": 1592256897.0, "score": 32, "upvote_ratio": 0.86, "num_comments": 39, "comments": [{"body": "JPow is going to take your technicals and shove it into the printer to BRRR cash with", "score": 76, "replies": [{"body": "Lmao, so did I....yeahhhhh I totally forgot about that dickhead Wednesday", "score": 10, "replies": []}, {"body": "V, MasterCard, google, Netflix, fb, Uber, interactive Brokers, Salesforce, Home Depot, all have broken 3 month trend lines...since the bottom. If those names are weakening it could be a short pullback no matter what the fed says bc they are so far off trend it would take a ginormous move to get back. \n\nFor any one reading this. Apple, Microsoft, Tesla, PayPal, square and nividia all are above trend but not by much. Still very bullish!’", "score": 8, "replies": [{"body": "Many stocks are in the same technical setup. Watch the big FAAMGs, they break, the market breaks.", "score": 2, "replies": []}]}, {"body": "After last time he talked and what happened I bet he got a good old kick to the head, or maybe somewhere a suit will cover up. Haha", "score": 3, "replies": []}, {"body": "Oh yeah and cruise lines, airlines, and financials are above trend", "score": 3, "replies": []}, {"body": "I laughed so hard on this", "score": 7, "replies": []}, {"body": "I still think we go wayyy up after July jobs but the two weeks til then....just be nice to slow down so the pop is bigger in July...come on rising Covid cases! Easy to figure out when and where they are coming...about two weeks after reopening so before June is over ...", "score": 2, "replies": []}]}, {"body": "I got a couple of SPY 285 JUL 17 PUTs, I recon they are going to print tomorrow. Probably not going ITM this week. Might move them further out, as the next drop might come in August or even September, not sure if we see SPX 3300  before 2800, but am pretty sure we are going to see SPX 2800 this year.", "score": 12, "replies": [{"body": "Just wrote...12-24 days after reopening cases are spiking then rising daily. We could see a pullback bc in all the states that opened like last week will be rising before the July jobs report that will send us higher regardless of Covid...I think we get to record highs before the election...prolly before September when a second wave is bound to hit...just like in 1919, not hard to see that. So October should be a ruff one for the standing president in an election year...not a conspiracy theorist but Jesus, if there was a definitive way to get trump out this would be it.", "score": 5, "replies": []}]}, {"body": "Yea technical analysis pointing to a downturn is all over the place.  Every youtube-ing trader made a video on it this weekend.", "score": 11, "replies": [{"body": "Mighta been the buying opportunity of the summer today", "score": 3, "replies": [{"body": "as in buying puts?", "score": 3, "replies": [{"body": "Nah...if everyone is buying puts its cuz they are wrong. With the things like financials and airlines not breaking the three month trend last week it could be a sign of a leg higher with the markets kinda evening out but slowly higher. \n\nNetflix fb google visa and MasterCard all have broken trend.", "score": 0, "replies": []}]}]}, {"body": "Great...that’ll raise premiums", "score": 1, "replies": []}]}, {"body": "There are a ton of macro and government resources in the tools references and resources link of [this thread. ](https://www.reddit.com/r/pennystocks/comments/gwqv7g/for_new_and_inexperienced_traders_please_read/?utm_source=share&utm_medium=ios_app&utm_name=iossmf). Ignore the title. I think we are due for some massive additional hurt in the future!", "score": 4, "replies": [{"body": "Fucking crook, go away", "score": -2, "replies": [{"body": "Really? : /\n\n&#x200B;\n\n[U.S. Government References and Indicators:](https://www.tradinganalysisresources.com/2020/05/free-references-and-resources.html)\n\n1. Federal Reserve Events: \n2. Federal Reserve Economic Data:\n3. Department of Labor News Releases: \n4. FDA Calendar: \n5. Clinical Trials: \n6. U.S. Patent and Trademark Office: \n7. COVID-19 Stats: \n8. Department of Agriculture Calendar: \n9. U.S. Energy Information Administration:\n10. TSA Clearance Data: \n11. Bureau of Transportation Statistics: \n12. U.S. Import/Export Trade & Tarrif Data:\n13. U.S. Bureau of Economic Analysis: \n14. U.S. Housing Market: \n15. Income & Consumption: \n16. Yield Curve: \n17. GDP: \n18. S&P 500 Valuation Ratio/Yields etc:\n19. Consumer Confidence:", "score": 3, "replies": [{"body": "Yeah your a crook, gonna end up somewhere something asks for money. That isn’t even about the stock market...it’s about the economy. Bc stock earnings day might be a good indicator...", "score": -2, "replies": [{"body": "Asking for money? No adds not monetized. 😑", "score": 1, "replies": []}]}]}]}]}, {"body": "Thoughts on zoom ? When is that shit going down", "score": 4, "replies": [{"body": "Secrets out on it though and the implied volatility has premiums on options ridiculous so I don’t see a reasonable play.", "score": 4, "replies": [{"body": "I’m balls deep in credit call spread rn so I just need someone else’s validation. Ty sir", "score": 2, "replies": [{"body": "Nice to do business witcha", "score": 2, "replies": []}]}, {"body": "what secret in zoom? its sky rocketing", "score": 1, "replies": []}, {"body": "Besides selling premium way the fuck out.", "score": 1, "replies": []}]}, {"body": "Don’t know don’t care lol ...I’d rather be in tesla. I tried shorting zoom once and that was it. I actually have met three people in my life using it....so it’s definitely growing. It’ll go down once the market returns to normal but that could be 18-24 months. You gotta think about that quarterly. Zoom in that respect could go up to 1000. Especially if a second wave hits in September...but in 2023 it could be 50$ or 3000$.", "score": 3, "replies": []}]}, {"body": "“Near term” as in (maybe) the fall? The S&P will break its personal record before summer’s end. At least that’s what my technicals show, and by “technicals”...my positions.", "score": 6, "replies": [{"body": "Kinda a two week breakdown and July jobs will take it to record highs before the September wave drops it quite a bit then back up lol...volatile", "score": 3, "replies": []}, {"body": "APPL MSFT pypl TSLA square nvda mro aal Boeing are my longs", "score": 2, "replies": []}, {"body": "And Disney roku and Enphase lol", "score": 2, "replies": [{"body": "Roku 120C 6/26", "score": 1, "replies": [{"body": "That’s prolly treating you nice right about now", "score": 2, "replies": []}]}]}]}, {"body": "The only technical I pay real attention to is spy 300. 300 is tough support, and once it's broken it later turns into tough resistance. Honestly aside from that....just save us all a headache and eat your crayons instead of coming here", "score": 3, "replies": []}, {"body": "What is KST?", "score": 1, "replies": [{"body": "The ST is “sure thing” I think it’s KnowSureThing but the K might be the last name of the guy that created it. \n\nOn Yahoo Finance advanced chart it is in the lower indicators as “Pring’s know sure thing” they are in alphabetical order. \n\nIt does a ten day ....period. But I like to cut all the variables in half and by 75% and it really points to direction of the underlying more times then not.", "score": 1, "replies": []}]}, {"body": "I don't know anything about these \"technicals\" you are speaking of but I did throw some chicken entrails into a pan and the pattern they formed looked like a kangaroo, so expect a big movement in *some* direction.", "score": 1, "replies": [{"body": "Why pay attention to technicals? Bc a lot of people use them. That’s it", "score": 1, "replies": [{"body": "Technicals are silly in the best of times, but there's very little they can do to predict what crazy shit J-Pow and Mnuchin will dream up any given week to score more crack rocks for this market to smoke.", "score": 1, "replies": []}]}]}]}
