{"title": "Let's talk about overvaluation", "selftext": "We've been seeing many occurances of stocks with overblown P/E ratios *start* to return to earth recently, with Roku being the latest example.\n\nWith the current state of macroeconomic factors(inflation, impending raises in interest rates, supply chain issues) coupled with the recent political climate(possible war between Ukraine and Russia, people running out of unemployment and stimulus checks no longer being handed out): the average person is being hit with the realization that we at best are due for a correction and are at worst heading toward a recession.\n\nThere is a lot of money to be made on the way down just as there was on the way up. We are heading into a time where even if a company has a great earnings report, they are still hit with the reality that the growth of the market the last couple years is unsustainable and their share price subsequently will also take a big hit.\n\nWe are going to continue to systematically see companies return to fair value, those with the highest P/E ratios being the biggest victims.\n\nWhich companies and sectors do you guys see being next to fall or continue to fall?", "id": "sxebr3", "created_utc": 1645399031.0, "score": 8, "upvote_ratio": 0.6, "num_comments": 53, "comments": [{"body": "Honestly , i think TSLA is  a  bloated dog", "score": 47, "replies": [{"body": "The only way Tesla looks overvalued is if you’re looking at the rear view mirror rather than out the front windshield. \n\nTSLA is trading at a forward P/E of only 65 ($856 share price divided by estimated earnings of $13 in 2022) for 3 year compound annual earnings growth rate of around 72% (growing from $4.90 earnings per share in 2021 to $25 in 2024). That’s price to earnings growth <1, which is undervalued", "score": -8, "replies": [{"body": "That's insane, you're saying that Tesla will eclipse the earnings of Toyota by 2024 by a whooping USD 10b?", "score": 13, "replies": [{"body": "I’m actually saying they’ll match Toyota’s current profit in 3 years. Go back 3 years and I’m sure no one thought Tesla would exceed GM profit in Q4 2021, and almost certainly will exceed both GM and F in 2022. Tesla has been chronically underestimated by everyone and that’s why the stock mooned.\n\nWhat are your estimates for Tesla units, revenue, and net income for 2024? I project $198B in revenue, 75% of which comes from sales of 2.933 million cars and a net income of $30B.\n\nRemindMe! 3 years", "score": -6, "replies": [{"body": "Are there enough people able to pay that much to purchase a Tesla though? They need a mass market car to be able to sell to the mass market…", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "They’ve grown revenue an average of >50% for the last 5 years (from $7B to nearly $54B). \n\nWhat are your estimates for Tesla units, revenue, and net income for 2024? I project $198B in revenue, 75% of which comes from sales of 2.933 million cars and a net income of $30B.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> Its 52% for the last 5 years. But 48% for the last 7 and 37% for the last 3 years. And it isn't anywhere close to a 70% average across any of them timeframes. Your estimates are going to be completely incorrect as a result.\n\nUm no. You aren’t doing math properly and totally misunderstanding what I’m saying. In 2014, Tesla revenue was $3.2 billion which means they grew at a compound average growth rate of 50% over 7 years to $53.8B in 2021. \n\nMy estimate is for **earnings growth** of 72%, not revenue growth. Earnings grows faster than revenues due to operating leverage and economies of scale. We have seen this through Tesla’s expanding gross margins and operating expenses growing at a much slower rate than revenue for years.\n\n> I honestly don't know what tesla's 2024 numbers are going to be.\n\n> However neither do you. And giving exact numbers like you have is incredibly stupid as there are many factors that are impossible to predict.\n\nI have done enough research to feel pretty confident in my projection. It won’t be exactly right, but I’m confident it will be directionally correct. I have bearish and more bullish scenarios as well. How do you propose to value a growth company without projecting its future and determining whether it is trading at a discount to that future?", "score": 0, "replies": []}]}]}]}]}, {"body": "Your wrong.  Tsla is undervalued", "score": -17, "replies": [{"body": "By what metric? LoL!", "score": 10, "replies": [{"body": "He took the current share price and then multiplied it by the return needed to retire at age 35 and added some Hopium and got the result that it is critically undervalued", "score": 28, "replies": [{"body": "I see penny stocks,odte options  and  shitcoins  do that  daily..  its  called  a  parabolic move and  99% of the  time they  end in flames..\n\nBear in mind Elon just sold  billions worth of TSLA stock, aaaaand  QQQ heading for  bear market.", "score": 4, "replies": []}]}, {"body": "TSLA is trading at a forward P/E of only 65 ($856 share price divided by earnings of $13 in 2022) for 3 year compound annual earnings growth rate of around 72% (growing from $4.90 earnings per share in 2021 to $25 in 2024). That’s price to earnings growth <1, which is undervalued", "score": 0, "replies": [{"body": "I think there is no way tsla can estimate their revenue for 2022. Rising rates, and so much competition coming in, theres just no way they will be able to predict more than one quarter ahead. \n\nLets assume your bullshit pe is actually worth anything, a \"PE of only 65\" is super duper expensive! S&p multi year average is like 17. For a growth company that will be like 30,35? \nPe of 65 prices in that they are the only EV maker in the world, they will take over the market completely, and government carbon credits will continue forever.\n\nAlso your model is super simplistic, who said valuation should remain the same as the company grows? It is pretty clear that when they had 4.9$ earnings, the market priced in their potential to grow to 25$, dont you think? Also, it is by far easier to grow 100k deliveries to 200k than 500k to 1million.", "score": 3, "replies": [{"body": "> I think there is no way tsla can estimate their revenue for 2022. Rising rates, and so much competition coming in, theres just no way they will be able to predict more than one quarter ahead.\n\nTesla has a one quarter backlog for their cars and coming off of large price increases recently. They can simply lower prices back to where they were if they need to or release the cheaper trim of the Model Y that tons of people want. Competition isn’t really relevant, the real competition is EVs replacing ICE cars. More EVs does not equal less Teslas, it just equals less ICE cars.\n\n> Lets assume your bullshit pe is actually worth anything, a \"PE of only 65\" is super duper expensive! S&p multi year average is like 17. For a growth company that will be like 30,35? Pe of 65 prices in that they are the only EV maker in the world, they will take over the market completely, and government carbon credits will continue forever.\n\n>Also your model is super simplistic, who said valuation should remain the same as the company grows? It is pretty clear that when they had 4.9$ earnings, the market priced in their potential to grow to 25$, dont you think? Also, it is by far easier to grow 100k deliveries to 200k than 500k to 1million.\n\nIn a much higher interest rate environment, famed investor Peter Lynch said that price to earnings growth ratio should be 1 at fair value. 65 P/E is fair price for 72% earnings growth. Amazon is trading for such a multiple with 1/3 the growth.\n\nMarket is currently pricing in much slower earnings than I suggested, hence I believe Tesla is undervalued\n\nBy the way Tesla sold 936k cars in 2021 after doing 500k in 2020 and will do >1.5 million in 2022\n\n!RemindMe 1 year", "score": 1, "replies": [{"body": "Time will tell :) good luck", "score": 1, "replies": []}]}]}, {"body": "Don’t use the word “forward” here. Most here are only reactive.", "score": 0, "replies": []}]}]}, {"body": "*You’re", "score": 1, "replies": []}, {"body": "I upvoted because that is a fucking hilarious hot take.", "score": 0, "replies": []}]}]}, {"body": "Check out:\n https://www.reddit.com/r/options/comments/sw9z64/most_anticipated_earnings_releases_for_the_week/?utm_medium=android_app&utm_source=share\n\nI forsee many of these companies with upcoming earnings dipping hard even if they beat estimates, especially if their pe ratios are above the market average of 15. If Nvidia can do well on their earnings report and still see a price decline, what's going to happen to the rest of the market? Also yeah roku was just another domino in the line of the falling house of cards. We're just starting to see prices correcting and a lot of people are going to make a lot of money shorting companies and buying puts", "score": 4, "replies": []}, {"body": "Maybe the better strategy is to try and think about which companies or sectors will succeed, rather than fail", "score": 3, "replies": [{"body": "Good hedges are undervalued on this sub.\n\nHell, hedging in general is.", "score": 3, "replies": [{"body": "So very true.", "score": 1, "replies": []}]}, {"body": "That depends on if you're trying to invest long-term or if you're trying to make money no matter which way the market goes in the short-term. Many companies still have a long way to fall and I'd argue we have quite a correction ahead of us in many securities before anyone would do well buying the dip", "score": 0, "replies": [{"body": "That’s fair. I see the extremely likely long term gains as more attractive than the much riskier and labor intensive short term gains. Betting on which companies will suffer in the near term is a risky gambit", "score": 2, "replies": [{"body": "Not to mention you have to outperform the difference in short vs long term capital gains.", "score": 2, "replies": []}, {"body": "Its higher risk, but massively more profitable. 1 win can make up for 5 losses if you're running puts. The issue I struggle with it, is that so many have dropped so far, it's hard to tell what is still overvalued enough to play", "score": 1, "replies": [{"body": "It’s massively more profitable if you are consistently successful, which is extremely hard to do", "score": 1, "replies": []}, {"body": "Learn TA for short term moves.", "score": 1, "replies": []}]}, {"body": "> Betting on which companies will suffer in the near term is a risky gambit\n\nNot really. Because you want to win by the law of large numbers. Therefore you must make a large number of small bets. Buying and holding is comparatively risky because you are exposed 100% of the time.", "score": 1, "replies": [{"body": "That’s not really true. If you have a long time horizon and are buying and holding you are or exposed the whole time. None of the short term fluctuations matter because you aren’t trying to time tops and bottoms. Which is exactly what a short term trader is doing. It sounds like you are picking a huge basket of short term positions and trying to time you exit from them which is very very difficult to get right", "score": 1, "replies": [{"body": "> None of the short term fluctuations matter because you aren’t trying to time tops and bottoms.\n\nCorrect, but the long-term fluctuations do matter and they matter a lot.\n\n> It sounds like you are picking a huge basket of short term positions\n\nInaccurate. I am trading a small number of short-term positions sequentially.\n\n> trying to time you exit from them which is very very difficult to get right\n\nNo, the edge is statistical. It does not rely on \"timing.\"\n\nYou haven't thought about this nearly as much as me. Consider how a casino makes money.", "score": 1, "replies": [{"body": "Ok bud. Good luck to you", "score": 1, "replies": [{"body": "I don't need luck because I have a statistical edge:\n\n1) Identify a trade and prove it has a statistical edge\n2) Execute the trade as many times as possible while controlling for risk", "score": 1, "replies": [{"body": "Ok bud well get that money then", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "\"Time the market\"", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Probably about a 50% chance that the silliness you mentioned will continue.\n\nGoogle lost its relative strength compared to SPX in the September dip and just gets shoved around by the Nasdaq for the most part, if the Nasdaq is trading 11.5k soon, I don't think there's much way that Google doesn't see at least 2200 again, and perhaps even 2000 (some even say that the Nasdaq has seen another generational top and Google can round trip all the way back to pre-COVID).", "score": 0, "replies": []}]}, {"body": "ABNB is trading at nearly 600 times forward PE. It also has twice the market cap of Marriott Hotels which brings in considerably more profits.", "score": 3, "replies": [{"body": "Great find! Mercado Libre(ticker MELI) also has an almost 600 P/E which is absurd and it has earnings on Tuesday aftermarket close. Big red candles incoming", "score": -1, "replies": [{"body": "I agree.", "score": 2, "replies": []}, {"body": "Meli is a great company, they have reinvesting a lot so P/E is not a great indicator for a still high growth company. Having said that... considering the recent selloff and compairing to other similar (not quite the same, like SHOP or SEA) i think a correction might be  coming soon (i think they are presenting earningsthis month) \n\nI sold at  around 1500, would buy them again if they reach 750/650.", "score": 1, "replies": []}]}]}, {"body": "if real bear is coming, no one will stand, next would very possibly be aapl, msft, google, amazon, brk, tesla or whoever is still standing. It has nothing to do with valuation anymore. Bear only check who is standing and beat those down. All you need a weak guidance as excuse, bear don’t check earnings, bear check excuse, metamate? what the heck of this word? Thats all bear need to beat you.", "score": 4, "replies": []}, {"body": "I read that as: Lets Talk About Ovulation", "score": 1, "replies": []}, {"body": "No such thing as overvalued in my opinion. The value is what people are willing to pay, ie whatever the market currently says.", "score": -1, "replies": [{"body": "GME above 300 was perfectly fine.", "score": 2, "replies": [{"body": "Yes, it was. Short sellers got caught with their pants down. It was that valuable because they needed to cover or lose more.", "score": 3, "replies": []}]}]}, {"body": "For a second there I thought you said ovulation", "score": 1, "replies": []}, {"body": "$RSX puts once the sanctions finally come. I doubt the west and Europe will let Putin off that easy. There needs to be consequences for dictatorships bringing the threat of war as they please.", "score": 1, "replies": []}, {"body": "Sounds like a solid game plan for failure. It would be better to see which sectors are gonna succeed and start putting your money into them.", "score": 1, "replies": [{"body": "Except for those of us that have been doing this for months are making some of the best returns we ever have. Not exactly a path to failure. Only when too many people start doing it.", "score": 2, "replies": []}]}, {"body": "I think the worst is a depression, not a recession.", "score": 1, "replies": []}, {"body": "These are the first to die when they raise rates.   So they won’t keep raising.    So check the playbook.  You know what we need?    A good reason to fire up the military industrial complex.", "score": 1, "replies": []}, {"body": "Haha ok it’s official we’re near bottom folks", "score": 1, "replies": []}]}
{"title": "its getting preeeeeeeeeety gay around here", "selftext": "nows about the time for the gREEEEEEEEEEEnest opener you ever done seen. \n\nall ya rainbow flag flyers that danced on the graves of what they though was a crash and the incoming \"crash\" on top of that\n\nbig companies were overvalued and shed appropriately. dog shit companies did  dog shit company shit and shed appropriately\n\nit feels UBER variation separatist circa the olden days of april2020 when the market ripped as the bear porn flowed through wsb. its time again.\n\nneed more crayons, this took two weeks to properly put together and its pointless. except for the fact that your puts will burn in seconds come Tuesday mernin. ill be happy for you all to set remindmes and screech your brains out\n\naigh going back to my slave labor job of walking dogs and banning people on reddit for being against the CCP\n\nfuck im retarded", "id": "sxcnzk", "created_utc": 1645394544.0, "score": 29, "upvote_ratio": 0.65, "num_comments": 55, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|4 weeks ago\n**Total Comments**|26|**Previous DD**|\n**Account Age**|1 month|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sxcnzk)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sxcnzk)", "score": 1, "replies": []}, {"body": "i ain’t reading all that\n                                                                 \ni’m happy for you tho\n\nor sorry that happened", "score": 22, "replies": []}, {"body": "r/ambien", "score": 18, "replies": [{"body": "r/tardadderal", "score": 4, "replies": []}]}, {"body": "🌈🐻 are out to do some damage\nGotta admit their hibernation did last longest this time", "score": 8, "replies": []}, {"body": "Interest rates going up doesn’t matter now? Not that I care, I’m deep in double diag’s. The volatility isn’t going anywhere.", "score": 5, "replies": [{"body": "This - Jesus read the room, VIX trying to establish a new base above 24.50", "score": -1, "replies": [{"body": ">Jesus read the room, VIX trying to establish a new base above 24.50\n\nLOL WHAT", "score": 3, "replies": []}]}, {"body": "Priced in,just look at bonds", "score": 1, "replies": []}]}, {"body": "You turning gay because I keep clapping your wife’s cheeks and you keep putting your pp inside your guy friend", "score": 9, "replies": [{"body": "you can clap them cheeks till the cows come home. ill never be ghey", "score": 3, "replies": [{"body": "Maybe not ghey, but you are certainly gay.", "score": 5, "replies": [{"body": "i own nothing but calls. so no i am not", "score": 5, "replies": [{"body": "Yeah you probably have calls on inverse ETF’s, ya gay wad", "score": 5, "replies": [{"body": "only spy and qqq as i have for the last three years. got boned one month and then a clear sailing the rest of the way", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "wow i feel so epicly burned. youre in another echelon of humans calling someone retarded from your aspee play pen with that helmet on. big yikes for little tikes\n\nAND NOTICE that i literally called myself retarded in the comments. youre taking an insult i hand crafted for you", "score": -1, "replies": [{"body": "![img](emote|t5_2th52|4270)", "score": 1, "replies": [{"body": "damn bruh, them bags must be heavy. you need some help?", "score": 1, "replies": [{"body": "Did you even see my bags?  Check again ![img](emote|t5_2th52|4641)\n\n[https://www.reddit.com/r/wallstreetbets/comments/leg7eu/thank\\_you\\_wsb\\_28\\_and\\_debt\\_free\\_tsla\\_5k\\_19k\\_gme/?utm\\_source=share&utm\\_medium=ios\\_app&utm\\_name=iossmf](https://www.reddit.com/r/wallstreetbets/comments/leg7eu/thank_you_wsb_28_and_debt_free_tsla_5k_19k_gme/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "score": 2, "replies": [{"body": "you linking a robinhood from a year ago. talking bout spy calls...\n\n&#x200B;\n\nBIIIIIIIG yikes for little tikes pt2", "score": 1, "replies": [{"body": "I’m not sure how to respond anymore.  You write a really terribly written and incohesive post mis-labeled as ‘technical analysis’ so I come and troll you too but you’re getting butt hurt and reporting to Reddit that I’m suicidal.  \n\nYou really are gay…", "score": 2, "replies": [{"body": "> so I come and troll you too but you’re getting butt hurt and reporting to Reddit that I’m suicidal.\n\nyoure getting dragged and youre thinking youre getting me. this shit is EAAAAASSY", "score": 1, "replies": [{"body": "Ok retard, whatever you say.", "score": 2, "replies": [{"body": ">retard\n\nbruh be original. i literally say this. im glad you realized it though, draggin people is easy as fuuuk", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4270)", "score": 2, "replies": []}]}]}]}, {"body": ">reporting to Reddit that I’m suicidal.\n\ni didnt do any of that shit btw, preeeeety solid how you did tho hahahahahhaha get DRRRRAAAAAAGGGED", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4266)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Which calls do you have? Your post smells like a nice loss porn in formation 🚨🚨🚨 please post that porn", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4267)", "score": 2, "replies": []}, {"body": "You must not have seen futures yet", "score": 3, "replies": [{"body": "Obviously this retard doesn’t even know what futures are", "score": 4, "replies": [{"body": "i do, and there is no market tommorow. red futures at night are easy green am.\n\nand futures are just about to go green, bears never know when to shut up huh?\n\nyou must be new", "score": 3, "replies": [{"body": "Thanks for buying all my calls this year.#theta always wins", "score": 1, "replies": [{"body": "lol i dont buy youre dumbass shit. theta didnt win shit in 2021 nor in 2020. yall got hosed hahah", "score": 0, "replies": [{"body": "Lol wtf?  Theta literally Always wins…. You must be new.", "score": 1, "replies": [{"body": "not when youre selling weeklys against a massive market rip like 2020-2021\n\ntheta doesnt ALWAYs win, they win often but get fucking hosed on any rip day\n\n&#x200B;\n\nbeen there done that. youre just continuing to fish for shit, you need help bruh", "score": 0, "replies": [{"body": "Sounds like you don’t know what gamma is nor how to avoid it nor what selling a put means", "score": 1, "replies": [{"body": "bro, if theta gang was fullproof every hedge fund would be dick riding it. truth is you can loose your shirt way fucking faster", "score": 2, "replies": [{"body": "Pretty sure every hedge fund does sell options", "score": 1, "replies": []}]}]}, {"body": "Dude, theta wins every week when literally every single fucking strike Above Or Below the price expire worthless, how retarded are you????", "score": 1, "replies": [{"body": ">theta wins every week when literally every single fucking strike Above Or Below the price expire worthless\n\nif they are owned and sold sure. thats not always winning, plenty to get crushed in between", "score": 1, "replies": [{"body": "Lol Jesus fucking Christ ![img](emote|t5_2th52|4271)\n\nDo you know what market makers do?  And yes, anything getting crushed when you sell an option is good and winning.  Theta gang always wins retard.", "score": 2, "replies": []}]}]}]}]}, {"body": "You do realize selling to open options can be puts or calls right?", "score": 1, "replies": [{"body": "yes of course. but theta operates in the middle , any large move is fucking destroying", "score": 1, "replies": []}]}]}]}]}, {"body": "how bout them futures", "score": 1, "replies": []}, {"body": "how the futures doing?", "score": 1, "replies": [{"body": "Ouch", "score": 1, "replies": [{"body": "you waited 21 hours LOL. keep going. AM is upon us.\n\n&#x200B;\n\npoor little bear", "score": 1, "replies": []}]}]}]}, {"body": "green .23% CURRENTLY AT 810 ET", "score": 2, "replies": []}]}, {"body": "Think the smart retards found discords. LOL", "score": 1, "replies": [{"body": "Or a discord full of retards,", "score": 4, "replies": []}]}, {"body": "futures are up lol", "score": 1, "replies": []}, {"body": "“Dog shit companies did what dog shit companies do” - Kathy ark.", "score": 1, "replies": []}, {"body": "We use the word rainbowy", "score": 1, "replies": []}]}
