{"title": "Expected moves this week. Palantir, Shopify, Nvidia, Roku, Draftkings and more.", "selftext": "### The Broader Markets\n\n**Last Week –** **SPY** was lower by about 2% last week, in line with the 2% move options were pricing. Implied volatility closed higher on the week.\n\n**This Week – SPY** options are pricing about a 2.5% move this week (about $11 in either direction).\n\n**Implied Volatility** **/ VIX** – The VIX closed last week above 27, up from 23 the week before. The majority of that move higher was on Friday. Mid-week the VIX got as low as 20 as the SPY topped out near $457 before its intra-week decline of almost 4%.\n\n**Expected Moves for This Week** (via Options AI)\n\n* SPY **2.5%** (about $11)\n* QQQ **3.3%** (about $12)\n* IWM **3.3%** (about $7)\n* DIA **2.2%** (about $8)\n\n### In the News\n\nInflation, the Federal Reserve, and Russia/Ukraine headlines continue to cause day-to-day sentiment shifts in the market. When uncertainty reigns, implied volatility tends to make large moves as well. Last week was a prime example as the VIX saw both 20 and 30 within a few days of each other. Traders should be aware of the implied volatility backdrop when entering new positions as that can help inform strategy.\n\nUsing SPY as an example, at its peak last week near $457, the VIX was 20. A bearish position placed on that day could take the form of a put spread purchase, or a call spread sale. In the case of the credit call spread sale, the timing would have worked from a delta perspective as the markets reversed lower, but implied volatility spiked significantly with that move lower, adding a drag on potential gains of those short deltas.\n\nConversely, following a decline and a VIX above 30, a trader can choose between a call/call spread purchase or a credit put/put spread sale to position for a rally. In the case of the put spread sale, on a market rally implied volatility will decline, adding vega profits to delta profits. Conversely, a debit call spread will see delta gains on a rally, but be negatively affected by sharply declining IV.\n\nThis is much more of a factor when implied volatility is seeing large swings (as it is now), affecting near-term options in an atypical manner.\n\n## Earnings\n\n*Links* go to the Options AI calendar where you can see the other companies each day and click through to see charts (free to use). Recent earnings moves (actual) start with the most recent:\n\n[*Tuesday*](https://tools.optionsai.com/earnings-calendar/2022-02-14?day=2022-02-15)\n\n**Roblox** RBLX / **Expected Move: 15.9%** / Recent moves: +42%, -1%, +21%\n\n**Airbnb** ABNB / **Expected Move: 8.5%** / Recent moves: +13%, +1%, +4%\n\n**Wynn** WYNN / **Expected Move: 6.2%** / Recent moves: -2%, +8%, -1%\n\n**Upstart** UPST / **Expected Move: 21%** / Recent moves: -18%, +26%, +3%\n\n[*Wednesday*](https://tools.optionsai.com/earnings-calendar/2022-02-14?day=2022-02-16)\n\n**Shopify** SHOP / **Expected Move: 10.5%** / Recent moves: +7%, -1%, +11%\n\n**Nvidia** NVDA / **Expected Move: 9.3%** / Recent moves: +8%, +4%, -1%\n\n**Applied Materials** AMAT / **Expected Move: 6.4%** / Recent moves: -5%, -2%, -1%\n\n**Cisco** CSCO / **Expected Move: 5.3%** / Recent moves: -5%, +4%, +1%\n\n[*Thursday*](https://tools.optionsai.com/earnings-calendar/2022-02-14?day=2022-02-17)\n\n**Palantir** PLTR / **Expected Move: 11.5%** / Recent moves: -9%, +11%, +9%\n\n**Walmart** WMT / **Expected Move: 3.8%** / Recent moves: -2%, 0%, +2%\n\n**Roku** ROKU / **Expected Move: 13.2%** / Recent moves: -8%, -4%, +12%\n\n**Fiverr** FIVR / **Expected Move: 15.6%** / Recent moves: +10%, -24%, -2%\n\n[*Friday*](https://tools.optionsai.com/earnings-calendar/2022-02-14?day=2022-02-18)\n\n**Draftkings** DKNG / **Expected Move: 12.5%** / Recent moves: -2%, +2%, -7%\n\n**John Deere** DE / **Expected Move: 4.9%** / Recent moves: +5%, -2%, +1%", "id": "srrmud", "created_utc": 1644782839.0, "score": 138, "upvote_ratio": 0.94, "num_comments": 48, "comments": [{"body": "[deleted]", "score": 36, "replies": [{"body": "PLTR be like we signed deal with Russian military.", "score": 18, "replies": [{"body": "They would never do that.", "score": 1, "replies": []}]}, {"body": "PLTR's gonna hurt you again.", "score": 36, "replies": [{"body": "PLTR, I got my lube ready.", "score": 16, "replies": [{"body": "PLTR will keep porking me for years to come.", "score": 5, "replies": [{"body": "Same. Might not ever see $25 again", "score": 4, "replies": [{"body": "Sooner than you think. Doesn’t take much.", "score": 1, "replies": []}]}]}]}]}, {"body": ">xpected Move: 11.5%\n\nPLTR... bought for Long Term Hold... not going to worry about a single quarterly report.  Short term, It'll go up... Short term, It'll down down.... 5 years from now... it'll be a great investment.  All these short term drama statements are just tiresome and not particularly useful.", "score": 9, "replies": [{"body": "RemindMe! 5 years \"Am I still a PLTR bagholder\"", "score": 11, "replies": [{"body": "I will be messaging you in 5 years on [**2027-02-14 07:09:28 UTC**](http://www.wolframalpha.com/input/?i=2027-02-14%2007:09:28%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/options/comments/srrmud/expected_moves_this_week_palantir_shopify_nvidia/hwvt4hu/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Foptions%2Fcomments%2Fsrrmud%2Fexpected_moves_this_week_palantir_shopify_nvidia%2Fhwvt4hu%2F%5D%0A%0ARemindMe%21%202027-02-14%2007%3A09%3A28%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20srrmud)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 5, "replies": []}]}]}, {"body": "Still bag holding my 2023 $30 leaps *crosses fingers", "score": 2, "replies": []}, {"body": "PLTR will hurt you again. I finally let go of my bags except for a couple leaps I bought when it was closer to $25 that I refuse to sell", "score": 1, "replies": []}, {"body": "The thing about my portfolio is that there's always something in there that will hurt me, even when others are bringing me joy.", "score": 1, "replies": []}]}, {"body": "Wednesday is gonna be weird, gl everyone.", "score": 21, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "You're a goddamn genius.", "score": 7, "replies": []}]}, {"body": "Come on RBLX I bought because Pelosi bought, dumb, hopefully sentiment is good on Tuesday AH", "score": 7, "replies": [{"body": "That’s what you get for blind investing", "score": 2, "replies": [{"body": "I sold out of my calls mid day lol", "score": 1, "replies": []}, {"body": "Dickhead lol", "score": 1, "replies": [{"body": "The truth can hurt! You bought a stock because a politician did. Not the best strategy there pal.", "score": 1, "replies": [{"body": "Sold out before earnings!", "score": 2, "replies": []}]}]}]}, {"body": "Lol, everyone has been screaming that she had some kind of super secret inside stock tips, but every single one of her plays is underwater. GOOGL, DIS, RBLX, CRM are all down from when her husband bought those calls.", "score": 3, "replies": [{"body": "I mean almost every stock period is down from when they bought those calls. They are long dated", "score": 8, "replies": []}, {"body": "CPI and Russia wrecked what would have been big post ER bounces for many of those stocks.", "score": 1, "replies": [{"body": "Right, so where is this so-called \"insider trading\" that she was supposedly doing? That's my point.", "score": 2, "replies": []}]}]}]}, {"body": "RIP Ark", "score": 6, "replies": [{"body": "Bullish on SARK", "score": 6, "replies": []}, {"body": "Rip in peace.", "score": 1, "replies": []}]}, {"body": "PLTR will go up after ER, its already been beaten down enough, more upside than downside for a price jump. After that, who knows...", "score": 3, "replies": [{"body": "So why do people think PLTR is actually going to rally? What value does it bring? I'm very unfamiliar with it, beyond it's basically meme level of loyalty", "score": 5, "replies": [{"body": "Listen, I’m just talking about ER reaction, based off what I saw with these other beaten down stocks after their ERs. I could care less after.", "score": 1, "replies": []}, {"body": "They are a data company in a data world. As soon as they start getting more commercial biz through their new startup portal they will be a juggernaut. I’m Long 1k shares at an average of $19.", "score": 1, "replies": [{"body": "> As soon as they start getting more commercial biz\n\nDo they have plans for that? I'm skeptical by nature, but that sounds a lot like hopium. Whenever you find yourself saying \"As soon as\" or \"When they get...\" it's not actually indicating any real evidence, it's just hope and that needs to be checked.\n\nWhat makes their portal better that will draw commercial business away from their competitors? \n\nAs we move forward, data is going to continue to be an even more profitable field. So there will be more companies that come into play. Meaning more and more opponents. If they haven't managed to attract commercial business in their first couple years, who is to say they ever will?", "score": 2, "replies": [{"body": "yes they absolutely have plans.  Here’s the thing.  their Foundry products versatility is where this company shines and that versatility  isn’t available anywhere else commercially as far as I can tell.  If you can spot any competitors for foundry whose software can be quickly pivot to things like blockchain analysis  I’d be happy to invest in them too. I think they are an xtremely forward thinking company led by an exceptional CEO.  Example of the things they are getting into… https://www.palantir.com/offerings/crypto/", "score": 2, "replies": []}]}]}]}]}, {"body": "In the past, how has the spectre of armed conflict (Ukraine) affected the stock and option markets?", "score": 2, "replies": []}, {"body": "Are these all positive gains?  What about adi", "score": 1, "replies": [{"body": "On the earrings the expected move is in either direction.", "score": 18, "replies": [{"body": "I see.", "score": 2, "replies": []}]}]}, {"body": "Thank you for this :)", "score": 1, "replies": []}, {"body": "Thinking the same…? But I’m gonna say that this ambiguity is intentional, could go either way?", "score": -7, "replies": [{"body": "They always go either way. These are never directional", "score": 13, "replies": [{"body": "So true!", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Is there a sub for that ?", "score": 3, "replies": []}]}]}, {"body": "Thanks for posting this.", "score": 1, "replies": []}, {"body": "Just learning about how to pick a strategy for options trading. For one of these big-moving stocks, would a strangle/ straddle be the right call? If earnings is this week am I too late to make a move? Is it better to put on a position like that when the earnings date is a little further out?", "score": 1, "replies": [{"body": "Earnings dates have higher volatility, better premium prices. Writing > Buying.\n\nLet people pay you for a chance to be greedy 🤷", "score": 3, "replies": []}]}, {"body": "Appreciate how thorough this was, especially the inclusion of how the various options strategies can be used in these scenarios. Well done!", "score": 1, "replies": []}, {"body": "Curious about ABNB. No P/E, 102 fair value, current price 170. Interest rates going up, Covid winding down ( work from anywhere going away). Russia /Ukraine stuff , inflation. Not sure whether calls are in order or puts ?", "score": 1, "replies": []}]}
{"title": "Long Term Investing - Blue Chips (AAPL, MSFT, GOOG) vs Index's VOO and SPY", "selftext": "[deleted]", "id": "srj04z", "created_utc": 1644760130.0, "score": 14, "upvote_ratio": 0.7, "num_comments": 54, "comments": [{"body": "It's ez looking backwards , tell me the 10 baggers for the future .....", "score": 50, "replies": [{"body": "Ex.. Google, MSFT, AAPL", "score": 9, "replies": []}, {"body": "Blue chips like UNH TMO SHW ODFL GOOGL NVDA.  Those will easily and always do beat the sp500.", "score": 5, "replies": [{"body": "No one beats Jack Bogle , facts", "score": 3, "replies": [{"body": "He's dead unfortunately.", "score": 6, "replies": []}]}]}, {"body": "1. GOOG\n2. MSFT\n3. NVDA\n4. AMD\n5. ADBE\n6. FB\n7. INTU\n8. AAPL\n9. TSM\n10. ASML", "score": 1, "replies": [{"body": "So you are saying AAPL will worth 30 trillion dollars in ten years , interesting .... Buying first thing in the morning 👌", "score": 14, "replies": []}, {"body": "Thank you for your option. Down voters can suck it.", "score": 1, "replies": []}]}]}, {"body": "This is exactly the kinda of post the people who owned stock in the companies that GOOG, MSFT, AAPL put out of business would post and the people that owned XEROX,KODAk and PAN AMERICAN would agree with.", "score": 28, "replies": [{"body": "There was a time when Motorola was super popular. I loved my razor flip phone back in 2004", "score": 14, "replies": [{"body": "Such a good phone!", "score": 3, "replies": []}]}, {"body": "So which companies are going to put AAPL, MSFT, GOOG/GOOGL out of business. Id love to hear them if this is something that would happen in the next 1-3 years. It would probably effect the index funds as well since they are the same stocks holding up the indexes.", "score": 7, "replies": [{"body": "I'd ask you the same of the Motorola, blackberry, and Nokia of the past. Who would put those companies out of business? I mean, they are monsters. Are they relevant today? Barely. So 10 years from now, there is no way to know if Google becomes Netscape, or if Apple becomes blackberry, we just don't know.", "score": 7, "replies": [{"body": "Did those 3 companies evolve and branch into other billion dollar ideas\n\n\nNope", "score": 0, "replies": [{"body": "They might have, just like Apple may not have. Again, looking forward is hard to predict... if Google is 80% ad rev right now, they don't sound very diversified. If ad rev goes poof... Google vanishes. Will that happen? I don't believe so, but it can happen.", "score": 2, "replies": []}]}, {"body": "Dude, I owned Nokia in the late 90's. They were not \"monsters\". They wouldn't have been ranked in the Top 10. Nokia in the late 90's was the equivalent of Qualcomm today. How often do you hear Qualcomm's name mentioned among the 10 best growth stocks to own in 2022/2023? Probably not that often. That was what Nokia was like in the late 90's. A wonderful stock to have at that time, but not a Top 10 play.", "score": 1, "replies": [{"body": "I'm pretty sure they were the biggest name in cellular phones... hence why I being it up. Today it would be apple for the iPhone, back then, the Nokia name was nearly ubiquitous with cell phones, that's why I selected it for my analogy. Probably not monster's on the sp500 as a whole, no.", "score": 1, "replies": [{"body": "Yeah, but Apple is like the largest weighted ticker on the entire S&P500 though right? Or at least top 3. That's why I think the comparison doesn't really fly. Nokia may have been one of the largest and most influential cell phone companies at the time, but cell phones were nowhere near as ubiquitous", "score": 1, "replies": [{"body": "But they were growing... they were clearly going to become something everyone would own, and nokia seemed poised to become/remain a leader in that sector. They didn't though, had you asked any investor in the 90s though, there was no doubt.", "score": 1, "replies": [{"body": "Nokia is a great example of a Top 50 company that has fallen dramatically from grace. Not a Top 10 or Top 5. That's the only point I'm trying to make.", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "I think its a risk tolerance question, etfs are safer but lower returns.  If you have high conviction i agree with piling in blue chip companies", "score": 7, "replies": []}, {"body": "2 years ago you’d probably ask the same questions but maybe have FB or AMZN in there: anyone of those stocks couple drop 25 percent over night. SPY can’t and if it did get a gun and hide.", "score": 12, "replies": []}, {"body": "Cherry picking some data (why not)\n2010-2022\nQQQ 19.84% CAGR, Google 19.71%.\nSo, in a raging bull market, you took on individual stock risk with Google and weren’t really rewarded.\nMicrosoft 23.81%. Better, but is your timing going to be right?  Is MS gonna keep growing at the same rates forever? Only you can decide if that’s a risk you want.  To me, it seems like you better hope the stars line up…\nSure, Apple was 31.4%, but I personally don’t think they will grow at the same rates 5 yrs from now.  Not to mention, apple had over double Qqq’s max drawdown.\nI think many are not seeing underlying regulation risks that might develop and hinder their businesses at some point.  Lastly, things that outperform for 5 yrs, often underperform the next 5 yrs.", "score": 5, "replies": []}, {"body": "For a while I was doing pretty much exclusively VTI and letting it ride but after seeing big tech earnings, specifically GOOGL’s I said screw it and bought AAPL, GOOGL and MSFT. I think I’m gonna keep it to just those three with a slightly heavier GOOGL position. Giving the profits and revenue each of these companies post every quarter I doubt they’ll fade out like a 2000 yahoo. They’ll probably shift more into dividends stocks as innovation in the space eases but I’m a buyer here.", "score": 9, "replies": [{"body": "Strongly agree with these three due to their cloud technology dominance. Major companies navigating from self maintained servers, and a majority of everyday people having their entire lives on iCloud is sticking power… bullish on blue chips (just DCA)\nGoogle: 5 shares \nApple: 100 shares", "score": 2, "replies": []}]}, {"body": "I don't buy the S&P500 because Tesla is a larger holding in it and it is the king Meme stock and a ticking time bomb.", "score": 7, "replies": [{"body": "Agreed. I’ve always been a VTI and let it ride guy but now I realized Schwab allows me to buy fractional shares of more than one company at a time so I’ve created a super mini ETF of only AAPL, GOOGL, and MSFT. I avoid the expense ratio of QQQ and avoid all the BS bubbles like TSLA and stupid high multiple crap like NVDA that are in QQQ.", "score": 6, "replies": [{"body": "This is pretty good advice.", "score": 3, "replies": [{"body": "It’s terrible advice watch NVDA P/E now and then Thursday. It’s bad to bet against NVDA ... & TSLA ... wait for their international plant numbers to begin posting ...", "score": 2, "replies": [{"body": "Thinking you absolutely need to be invested in TSLA and NVDA in order to get a good return is actually terrible advice. You will do well if all you had was AAPL, GOOGL, MSFT.", "score": 1, "replies": []}]}]}]}, {"body": "I agree with this. Better to make your own ETF. Just pick 30 stocks that you really like and understand from the Nasdaq 100", "score": 2, "replies": []}]}, {"body": "Except the big funds are now heavy in Energy , Materials & Banks, because the economy is going to be a mess for some time.\n\nI’d suggest an etf like $GUNR that’s commodity focused on Materials, Energy, and Agriculture", "score": 3, "replies": []}, {"body": "It’s going to take a company inventing conscious super intelligence machines to get ahead of Apple’s grip as the leading company. They move so much products, their consumers are addicted, they have a shit ton of cash, and have a roadmap for all the next huge products - AR, VR, and an Apple grade car. \n\nI’m putting essentially all my money on them", "score": 1, "replies": [{"body": "> It’s going to take a company inventing conscious super intelligence machines to get ahead of Apple’s grip as the leading company.\n\nYou mean a company like DeepMind? I totally agree with you. So, I suppose we should buy stock in DeepMind. \n\nOnly one problem. They were acquired by GOOG in 2014. Check Mate.", "score": 2, "replies": [{"body": "I think Google’s current products are loosing their once massive competitive advantage, despite their huge market share and advertising income. And that they are really banking on big breakthroughs with deep mind or quantum computing to keep them selves out front.", "score": 0, "replies": []}]}]}, {"body": " if Washington ever decided the companies are to big they could get the same or similar treatment standard oil got long ago and be forced to divide the companies into 12 smaller companies. However there's not even a word of anything like that happening anytime soon and the companies will likely continue to grow", "score": 1, "replies": [{"body": "Corporate lobbyists weren't nearly this powerful at least since 1920s", "score": 3, "replies": []}, {"body": "Our legislatures such as NASDAQ Nancy are too balls deep in call options for that too happen imo.", "score": 2, "replies": [{"body": "Yep, it's all posturing", "score": 1, "replies": []}]}]}, {"body": "I worry about Google long term. Something like 80% of their revenue was ads. Ugh", "score": 1, "replies": [{"body": "Why? Are ads coming to an end sometime soon? Apple's privacy policy doesn't really impact Google (they have an abundance of search data).", "score": 1, "replies": []}, {"body": "I imagine 80 percent of their revenue will come from A.I. in 2035.", "score": 1, "replies": []}]}, {"body": "RemindMe! 10 years", "score": 1, "replies": []}, {"body": "Google apple and msft are fucking risky investments.", "score": -6, "replies": [{"body": "lol", "score": 3, "replies": [{"body": "Im hoping that was a joke that went over my head lol", "score": 4, "replies": []}]}]}, {"body": "If you assume past history is a guidance (not guarantee) future success, you can consider AAPL, MSFT, GOOG, AMZN, NVDA, NFLX, FB, TSLA, BRK-B...like top 10-15 S&P companies.\n\nIf you need simple ETF, look for MGK which has all these top 25 companies. Always better to buy/DCA at deep dip than normal times.\n\nSee [Aswath Review Today](https://aswathdamodaran.blogspot.com/2022/02/back-to-earth-or-temporary-setback.html) for top 6 stocks.", "score": 0, "replies": []}, {"body": "When aapl msft goog are valued in the trillions there is less profit to be made going forward.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "These 3 stocks are most likely at their top.\nMore likely to go down that up from their current prices. Doubt they they will double from here.", "score": 1, "replies": []}]}]}, {"body": "Do a little of each.  Also I add things like HD UNH SHW that aren't tech but have had very good returns over the last 20 years also.\n\nThey've beat the sp500.", "score": 1, "replies": []}, {"body": "Ask GE and GM shareholders how they doing if you think leaders can’t fail \n\nEnergy used to be dominant sector , now it’s like 3% sp500", "score": 1, "replies": []}, {"body": "This is such a stupid post.... Buying amazon apple 12 years ago is equivalent of buying some microcap today. Do you know how many companies that had the same market cap as those companies back 12 years ago have gone bankrupt?\n\nIf you bought Cisco (which was in the top 3 market caps back then) 12 years ago, you would still be in the red today.", "score": 1, "replies": []}]}
{"title": "Who will have the BEST earnings calls this week?", "selftext": "It seems due to the market bear nature and uncertainty any good earnings results in a large after hour/pre market pop and any week earnings results in a big loss. This week I have my eye on Roblox and NVDIDA. I know Nvidia is making money but is Roblox?", "id": "srudyw", "created_utc": 1644790034.0, "score": 39, "upvote_ratio": 0.8, "num_comments": 56, "comments": [{"body": "NVDA\n\nAlways beat, always.", "score": 43, "replies": [{"body": "Bro. Don't jinx it like that", "score": 14, "replies": [{"body": "We good. \n\nIn JenSung We Trust !", "score": 0, "replies": [{"body": "No doubt. My cost basis is 10$/share. I wish I had bought more back then", "score": 2, "replies": [{"body": "What? Are you kidding that’s amazing.", "score": 3, "replies": [{"body": "Yah. It's my best performing asset. Second is AMD at 4$ ea and AAPL at 23$ ea", "score": -1, "replies": [{"body": "Holy cow", "score": 3, "replies": [{"body": "Trust him bro", "score": 17, "replies": []}]}, {"body": "Tell me what you’ve bought recently please", "score": 1, "replies": [{"body": "I bought a lot of GOOGL, AAPL, MSFT, AMD, NVDA.\n\nI also bought more TQQQ, UPRO, SOXL and TMF. Leveraged ETFs (will probably get downvoted but I am up ~300% since I opened my position)", "score": 2, "replies": []}]}]}]}, {"body": "Depends on how much of it you own.  If you like 100 shares, that's really cool man, good money.\n\nIf you own 5000 shares, are you interested in adopting me?", "score": 1, "replies": [{"body": "I wish I had 5K shares. I'm at 50 shares and growing.", "score": 1, "replies": []}]}]}]}]}, {"body": "We are green, and very, very mean!", "score": 1, "replies": []}, {"body": "Don't say that.\n\nDon't give me hope.\n\nPS: in all seriousness, there has got to be a point where the estimate gets too aggressive and the earnings barely match it.  It's great, just the estimate being greedy.  NV just hasn't come to that point yet.", "score": 1, "replies": [{"body": "Hey... If not... Buy more. \n\nWin win !", "score": 1, "replies": []}]}]}, {"body": "The better question is what will Wall street think of the earnings calls?  I've seen too many companies crush earnings and get a 20-30% drop that I think there's a bigger problem here.  Crushing earnings no loner matters", "score": 26, "replies": [{"body": "Crushing earnings tells a lot about what could possibly come for the company in the future.", "score": 6, "replies": []}, {"body": "Its all about the forward guidance and projected growth for any of these growth companies. Thats what actually moves the price. As we approach rate hikes it'll be like this consistently. \n\nEvery value name has traded pretty much according to their earnings since the compression began late last year.", "score": 5, "replies": []}, {"body": "Crushing earnings no longer matters?  Are you thick?", "score": 1, "replies": [{"body": "It’s def not a Garanteed bump anymore.", "score": 5, "replies": [{"body": "Uhhh, yeah it is.  What company “crushed earnings” and went down?  Answer: none.  If you have shitty guidance, that is not crushing earnings.", "score": -9, "replies": [{"body": "NVDA crushed earnings and then fell about 12% and that was before the bloodbath that started late December/early January.", "score": 7, "replies": []}]}]}]}]}, {"body": "PLTR 🤣", "score": 22, "replies": [{"body": "The way palantire is structured with contracts and bonuses it’s gives its employees I’m pretty sure it won’t ever be profitable unless it stops growth.", "score": 3, "replies": []}]}, {"body": "Me", "score": 14, "replies": [{"body": "Nice. Congrats.", "score": 6, "replies": []}]}, {"body": "As far as earnings I am keeping my eye on that dumpster fire OPEN / open door technologies. \n\nCould be poised for a hop and I fully intend to take advantage.", "score": 4, "replies": []}, {"body": "HIMX", "score": 4, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Yea me too I think Roku got dragged down because the ARKK etf but it’s a great stock.", "score": 3, "replies": []}]}, {"body": "BABA", "score": 8, "replies": []}, {"body": "Nvda", "score": 3, "replies": []}, {"body": "RBLX will probably do well sometime this year. Doesn't Pelosi have calls expiring in Jan 2023?", "score": 9, "replies": [{"body": "Rumor: META is buying RBLX , so yeah Pelosi calls", "score": 9, "replies": [{"body": "Roblox Or Unity, however I will go with Pelosi 😆", "score": 1, "replies": []}, {"body": "RemindMe! 1 year", "score": 1, "replies": []}]}]}, {"body": "SHOP please - my shares & calls desperately need it", "score": 2, "replies": []}, {"body": "Russia.", "score": 2, "replies": []}, {"body": "Upstart kills it every earnings, can’t wait for the 15th", "score": 3, "replies": [{"body": "Yes.  \n\n\nLast earning it killed me.", "score": 5, "replies": []}, {"body": "Last time that happened it dropped like $40 after crushing ER. It’s down from $400 to $100. Look at affirm and PayPal. Fintechs been dropping hard. We’ll see, it’s risky.", "score": 3, "replies": [{"body": "I’m a rich man.", "score": 1, "replies": [{"body": "So am I brotha. I had calls. I love that company.", "score": 2, "replies": [{"body": "Did you get happen to get fucked as well lol", "score": 1, "replies": []}]}]}]}]}, {"body": "POWW", "score": 1, "replies": []}, {"body": "$KO and $SBUX will have a rich year. Growth wise, $PLUG, $FCEL and $NXHSF will see year over year increases in their market caps as hydrogen transportation in the large vehicle and aircraft industry increases.", "score": 1, "replies": []}, {"body": "VIAC. Everyone is bearish on this stock so it won't take much to send them up after earnings, but they've been growing paramount+ a TON", "score": 0, "replies": []}, {"body": "[removed]", "score": -35, "replies": [{"body": "I have tried to do fucking research but I struggle to get human test subjects.  I am currently only dealing with cloth or soft paper in my research.", "score": 13, "replies": []}, {"body": "👆🏼needs a tranquilliser", "score": 8, "replies": [{"body": "More like needs to be tranquilized, lol.", "score": 4, "replies": []}]}, {"body": "Yo dude, chill out.", "score": 9, "replies": []}]}, {"body": "14th $CAR, \n15th $ZST, \n16th $NTR, $NVDA, \n17th $MATX, \n18th $DE, just a short list of the ones that caught my eye for the coming week", "score": 1, "replies": [{"body": "Good call on $CAR!", "score": 2, "replies": []}]}, {"body": "probably not the best but I am hoping $VIAC", "score": 1, "replies": []}, {"body": "$ROKU", "score": 1, "replies": []}]}
