{"title": "Apple options", "selftext": "[removed]", "id": "m4agca", "created_utc": 1615655204.0, "score": 6, "upvote_ratio": 0.63, "num_comments": 57, "comments": [{"body": "Please post basic questions at the Options Questions Safe Haven weekly thread, and read the many links there.  \n\nhttps://www.reddit.com/r/options/wiki/faq/subreddit_resources\n\nTitle your posts with particulars.   Posts come down for vague and meaningless titles. \n\nYour topic is actually:  \n\nConsidering AAPL $120 call exp. 03/2023 $15.93  \n\nYou need to define \"better\", and that requires having a strategy to measure what better is.  Without your intention, no answer can be made.", "score": 1, "replies": []}, {"body": "Hey my man. I wasn’t gonna write anything, but after seeing some of your responses, it’s clear to me that you should buy shares or nothing at all. Before buying options, watch a few hours worth of YouTube tutorials first. I recommend InTheMoney.", "score": 69, "replies": [{"body": "This", "score": 11, "replies": []}, {"body": "Agreed.", "score": 8, "replies": []}, {"body": "Inthemoney has great videos for learning options, helped me out a ton.", "score": 7, "replies": []}, {"body": "Agree watching the videos first", "score": 1, "replies": []}]}, {"body": "What is your goal here? Are you simply buying options instead of the underlying so you get the leverage of your dollars to control more shares? Are you buying the long-dated options so that you can sell short-dated calls against them? Without knowing what your strategy here is it's hard to say that one is better than the other in my opinion.", "score": 15, "replies": [{"body": "What is the purpose of buying long term calls and selling short term calls against them? Aren't long terms more expensive, so you'll just lose in comission? Sorry, I'm only learning.", "score": 3, "replies": [{"body": "It is called a poor man's covered call. I mistakenly thought that's what you were alluding to above as I thought I saw you have a date on the contract you were considering of 2023 but I wasn't sure. \n\nYou buy calls that are much further out and typically in the money. Then you sell shorter-term calls against that repeating the process over and over again collecting premium. The key is to be able to sell the short-term calls at a price that is higher than your break even on the long-term. That way if you do get the shares called away from you you can use the long-term call to fulfill that obligation ultimately with a lot less cash tied up than it would take to have a traditional covered call. If the shares do not get called away from you then you will have collected premium multiple times to offset your cost on your long-dated call.", "score": 16, "replies": [{"body": "I'm not topic starter :) But thanks for explanation.", "score": 6, "replies": [{"body": "No problem. I have not super experienced at this and if it was not for some very kind people who coached me along the way I would have lost a lot of my money. Therefore, if there's anything I can do to help someone else it is my karmic Duty", "score": 13, "replies": [{"body": "Have my karmic upvote", "score": 3, "replies": []}]}]}, {"body": "I'm a newbie here, and that was a very useful explanation. Thank you", "score": 4, "replies": []}, {"body": "Would you be willing to talk with me or point to Who could I talk to about this?  I bought AAPL $105c for 10/21 and I’m solidly ITM. I would love to start selling covered calls on this option but I would like to understand better before I do this.", "score": 5, "replies": [{"body": "That’s a great option, I’d sell the contract for profit and then invest it into more calls, or, buy shares with it and then cover calls with your shares", "score": 3, "replies": [{"body": "Just remember, that you truly only get half the premium that you collect. That is assuming you follow the rules of 50% gain and then close the position to avoid craziness at the expiration", "score": 2, "replies": []}]}, {"body": "Look up poor man covered call on youtube", "score": 1, "replies": []}, {"body": "Here is a video on it. If you have more questions feel free to message me, but I am far from an expert.\n\n[PMCC tutorial video](https://youtu.be/LmqbVg9zqjQ)", "score": 1, "replies": []}]}]}, {"body": "May be what you try to is a cover call", "score": 2, "replies": [{"body": "Yes", "score": 1, "replies": []}]}]}, {"body": "Instead of shares i was just going to buy an option (I’m still learning). I was just thinking wouldn’t it make sense to buy further out?", "score": 2, "replies": [{"body": "If you are optimistic on the price of the stock going up there is 100% nothing wrong with that strategy. But there are risks associated with that strategy that are greater that if you bought the stock outright. If you bought shares of Apple it's virtually impossible they would go to zero. If the price of Apple stock goes below your strike price it's a certainty that the value of your option contract will go to zero. Therefore you have to make the value judgment of whether the additional leverage you get from buying the option contract and holding it is worth the additional risk that you have versus buying the underlying. That is just my two cents and I am often wrong :-)", "score": 9, "replies": [{"body": "This is by far the hardest lesson that new options traders [myself 2 weeks ago]. I also was very optimistic about buying calls in Apple. What could possibly happen to apple..... I lost a good chunk of money and could have instead had a couple shares to ride out long term", "score": 5, "replies": []}, {"body": "Ok ya because apple was trading around 140 in January su was thinking it would be back up there towards the end of the year.", "score": -4, "replies": [{"body": "With options you miss out on dividends and there is no garuntee apple hits 140 again anytime soon.", "score": 3, "replies": []}]}]}, {"body": "Hello what's the difference between a share and an option", "score": 1, "replies": []}]}]}, {"body": "For that to beat the share price higher.  You need the stock to hit $150 right.  Buying the shares at $120 and hitting $135 gains you $1500 ... Hitting $136 with your options loses $1593 so you need an additional gain of $1500 to do as well as buying the shares. Do you have a catalyst for a huge move higher but can't afford to buy the shares?", "score": 5, "replies": [{"body": "if he sells a years worth of monthly covered calls, if the price stays flat at 120 then it's a free investment.  Assuming Apple rises, even a small amount would provide a tidy profit for minimal capital.  \n\n&#x200B;\n\nThe real risk in this investment is if apple drops 30-50%.", "score": 5, "replies": [{"body": "This comment is not accurate.  If Apple drops $2 per share from current price of $121.03 over the course of the option term it will be at less than $120 and the option will expire worthless.  It doesn’t require a 30-50 percent drop.  Also, you don’t know what the price will be for covered calls in the future—especially going out to 2023–so it’s not possible to know the economics for selling covered calls.  It’s not a good idea to refer to any investment activity that involves the future as a “free investment” by predicting the future.  The notion that Apple might “stays flat at $120” until 2023 is silly.  Just take a look at Apple stock over the years and the stock is never “flat”.  In fact, on Monday just check Yahoo Finance or any other source of real-time market data and you will see that the price of Apple is never “flat”.  Better to not suggest to a novice who is trying to learn that investing is simple and formulaic and that there are “free” investments out there.  Indeed, it’s better not to rely on Reddit when in most cases one has no idea the value of what gets offered up as “advice” since many people are clearly not well informed and the information offered is out and out dangerous.", "score": 2, "replies": [{"body": "I understand your point, but what I am saying is a 2023 contract has 22 months until expiration.  A 70-120 tech stock will achieve a $1.00 PMCC per month at a .3 delta.  Apple Options will always be coveted enough that even in a non high-IV market, the value will be there.\n\nIf it does drop below $120 by expiration, yes, worthless, but with 22 months of time, there i plenty of capital that will be collected b/w now and then.  Also, who is saying this will be held until that date?", "score": 1, "replies": [{"body": "At what strike price would he sell monthly covered calls given his break-even point?  Something over $145 or so?  The “shares” (assuming he will only have a long-option position) could be called away at any time (in his case forcing his own exercise of the long 120 options).  How much will be generated by a monthly covered call sale at an$145 strike?  25 cents per share?  I guess when selling a monthly one might choose a lower strike but that increases the potential for the “shares” to be called away at a loss.  I just don’t think it’s a sound strategy to assume the shares will remain flat at $120–especially for a novice who is obviously eager to make money despite not having done the requisite homework.  There are lottery tickets for that.", "score": 1, "replies": [{"body": "could easily sell monthly's +$10 - +$15 of current stock price for $1.00 premium.  If it gets called away, thats fine.   Either purchase the 100 shares with the collateral given +the difference, or sell the 2023 option for the profit, which, due to delta is going to be greater then the called away option loss.", "score": 0, "replies": []}]}]}]}]}, {"body": "Not disagreeing with the general sentiment on shares vs options but in this scenario you are assuming OP has 12k to invest and looking at $135 to profit a little over 10%. Now if OP is only looking at spending around 1600 he is looking at 13-14 shares of purchase power so might be looking at the 175-200 profit range if 135 is projected mark. My guess is like all of us with options OP is hoping for a larger return. But as others have said look at all of that data when looking at options...I am pretty sure all of us have taken a big L on an option before and still aren't even close toperfect.\n\nWith that said if you were looking at a 1-23 $120c it looks like breakeven on that is $143. Which I believe is at the upper limit of Apples all time high. Yes it will more than likely continue to go up but how fast and if there will be any large dips you don't know. So with all of that rambling and saying what others have said in a different way you need to decide what your risk level is and what your goals are. $1600 isn't a cheap call so if that is a sum of money that is of any significance to you I would be careful before jumping in.\n\n Don't get that FOMO especially with a company like Apple as I would guess the needle will not move much on that option if you take an extra day or two to decide.\nThat kind of call is definitely a high risk high reward bet but be ready to hold onto it for a long period of time. If that is not your style I would say look at some smaller companies and calls. Apple is kind of one of those safety net companies you could even buy shares and watch them for a few days/weeks/months whatever it might be and then make a descion.\n\nBut that's just thoughts of another dummy still learning. I am not against options but have changed my plan quite a bit. I'm sure when I first started my portfolio was running in the 80% options because I thought the same way....why buy 10 when I can have 100 (hopefully). But nowadays I would say I only have around 20% of my portfolio in options. Much bigger fan of owning the shares when possible. Then as others discussed that also leaves me up to more investment options such as selling a short call while picking up a long to cover or if I think there will be decent decay I will sell the call long like 2022 or 2023 and if I do really like the stock I will try to buy it back at a lower premium effectively taking that profit and lowering my overall cost per. It's harder to \"lose\" when you sell a call although not impossible. Your loss is more likely to be just the loss of additional potential profit you had....so is a bird in the hand better than 2 in the bush? That's why we say it's like a casino. \nExample I have one stock that my average cost per is about 1.97 but that does not take into account premiums I have bought and sold back with it so it is closer to 1.25 per share. I currently have them sold on a $2 strike and the premium was close to .70...now my cost basis is more like .55 per real share. It is currently trading ITM barely but has floated just below it for awhile. At this point I am keeping an eye on it and if the call cost goes down (my pick will be if the premium gets down to about .35 ) I plan to buy the shares back unless there is any changes or reasons for me to doubt the stock and company longer term. So I the end if the option is picked up I should make about 1.40 per share or it goes tatas up and I at least got my shares down to .55 at least and this companyhas had a 52 ( all time low) of 1.28 I believe so that's just an example of another way to use options. \"Experts \" please feel free to pick it apart but just a dummy trying to share his knowledge in the couple brain cells. Not an Expert here.", "score": 2, "replies": []}, {"body": "Why would hitting $136 lose money, also to make 1500 it would have to hit $145 at least", "score": -2, "replies": [{"body": "This comment says you don’t know enough about options to be trading them. I would suggest as many have in this thread that you read further and watch YouTube videos to gain more knowledge about reading them.", "score": 5, "replies": []}, {"body": "The cost of the calls get deducted from the gains made.", "score": 3, "replies": []}]}, {"body": "The problem with this strategy for a lot of newer investors,  myself included,  is to buy the underlying and net the 1500 profit in your scenario,  you'd need 12000 dollars.  I buy options in the hope of growing my trading account to the point where that might not only be feasible, but not tie up all my capital in a long-term play.  Guys like me are starting out with a thousand dollars because that's all we have.  Options are the only way to grow the account. Or washout completely.", "score": 1, "replies": []}]}, {"body": "Nobody can tell you what’s “better” because that’s a function of your investment goals, risk tolerance, liquidity, etc.", "score": 4, "replies": []}, {"body": "Going to say something that may have already been said here but (especially if you’re new to options) keep in mind that the value of an option decays much faster in the last 30-45 prior to execution. If you’re super confident that the stock will go up, options are great! But you also need to be super confident that it will go up dramatically and quickly. Shares or much longer dated (like july or october) options may serve you better if you aren’t confident about both the magnitude and the timing of the price change.\n\nEdit: looks like you said march 2023 and I actually just can’t read. Still worth thinking about why you want to buy an option and not the stock itself, though - options are better if you’re looking to leverage yourself to take advantage of large price movements. Maybe also look at spreads - in general you don’t want to enter an options position without a clear thesis and spreads may help you get there. Happy trading!", "score": 3, "replies": []}, {"body": "I did vertical spreads 6 months out. 120 long and 140 short. Much less risk and better odds. It's been a long time I did simple options, and I can't say this enough they are often a losing proposition. Bet with the casino not against it. Because the casino always ....!", "score": 3, "replies": [{"body": "This isn’t necessarily true. If you think buying options is betting against the casino then just sell some puts. It basically comes down to IV on which strategy to choose.", "score": 2, "replies": [{"body": "I wasn't saying buying simple options is always a losing proposition, but the odds are not in one's favor. There is a lot of research confirming my point, not just anecdotal experience. \n\nOne buys vertical/calendar spreads mainly because a) time is your friend b) large funds are writers of calls/puts not buyers. They push shares down to max pain and repeat. c) Spreads reduce one's entry point. d) You get an automatic hedge. \n\nIn my experience it's just difficult to get the timing and price movement exactly so with simple options. If I am very bullish, I just enter a wider vertical spread. If the stock falls I sometimes buy back the upper short and make money both ways. My experience is consistency in profits. One may not get the limitless upside of single options, but you do get 2x, 3x or higher returns more consistently. That's a good enough trade off. Many traders hopelessly watch as premiums decay and spreads are a good way of lessening that impact. \n\nSelling puts or writing calls are income strategies, they do not give you the kind of leverage and upside that the OP wants on AAPL. \n\nJust my opinion, not financial advice. To each his own.", "score": 4, "replies": []}]}]}, {"body": "How about a synthetic long instead?", "score": 2, "replies": []}, {"body": "understand that your investment is going to zero while you wait for the underlying to crest, maybe plan to sell at a profit when a target is reached", "score": 2, "replies": []}, {"body": "Buy in the money leaps for a higher delta", "score": 2, "replies": [{"body": "Could you explain a little more", "score": 1, "replies": [{"body": "If you just want to hold it for a long time buy a lower strike so that the contract will increase in value more for every dollar it goes up.  Buy the 120 or 115, not the 130", "score": 3, "replies": [{"body": "But should I go all the way out to 2023 or stay in 2022", "score": 1, "replies": [{"body": "Honestly the cost difference isn’t that much so I’d go with a contract expiring in 2023.  Either one should be good tho", "score": 1, "replies": []}]}]}]}]}, {"body": "What if I just want to make fast money like a gamble with cheap calls?", "score": 1, "replies": [{"body": "Aapl 135 expiring 4/1, buy 100 contracts (little over $4k)\n\nApple goes to $140 you make $50k+ good luck", "score": 3, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Of course it is, but he wants to make fast money with cheap calls. I think any scenario is gonna be pretty unlikely.", "score": 12, "replies": []}]}]}]}, {"body": "I say go ahead and do it . you have little to lose and so much to gain.", "score": 0, "replies": []}, {"body": "Buying further out offers more flexibility and time to recover if Apple doesn’t move the way you want it to at first. It costs an extra 500 bucks (roughly), but could be worth it if you have the funds. \n\nI hope you know these prices you’re looking at won’t be the same when the market opens on Monday though.", "score": 1, "replies": []}, {"body": "Too far out in time gamma moves slow.", "score": 1, "replies": []}, {"body": "Sell a cash secured put at $115 and if it covers you buy it at that level", "score": 1, "replies": []}, {"body": "Don’t forget tax considerations.  Buying and holding for a long time allows your investment to grow without taxes (the dividends are taxed as ordinary income).  If you sell your appreciated call at the end then you will pay tax on the gain.  No one here can advise on what that means for you and even you may not know what the future tax consequences for you will be as your overall circumstances may not be predictable (will you have other gains, losses, etc.?).  Having said that, you should nonetheless think about potential future tax consequences and develop your strategies accordingly.", "score": 1, "replies": []}]}
{"title": "Short-term Yield Curve vs Indices ( $SPX AND $NDX )...I am not saying we are going to crash, but the last two times this curve spiked the way it is currently (2000-2002 and 2007-2008) the SP500 and Nasdaq had major corrections. What do you, fellow traders, think?", "selftext": "", "id": "m4f9lg", "created_utc": 1615669113.0, "score": 61, "upvote_ratio": 0.9, "num_comments": 51, "comments": [{"body": "Eight ball size.....uncertain. \n\nThe one thing I’ve learned over the years of trading and investing is to let the market come to you. So if it’s going up, buy good stocks, if it’s going down buy good contra’s. Put in your stop limits and don’t regret taking profits. \n\nLook at me sounding like I know what the hell I’m doing.", "score": 42, "replies": [{"body": "I agree, that's what I (as well as most successful traders I know) usually do; however, a rug pull here and there comes with the territory of playing the price reaction game. The rug pull won't take out all of the wise price-reacting trader's profits, but it does give a decent sting. My goal with posting this chart was to simply provoke some thoughts about whether or not the current treasury yield move should cause an increase in caution (whether through more modest than usual position-sizing or greater than usual hedging) due to an increase in the possibility of a potential rug-pull.", "score": 6, "replies": []}, {"body": "what is a contra's", "score": 1, "replies": [{"body": "Contra meaning the inverse of the market. If the market goes down they go up. See https://money.usnews.com/investing/funds/slideshows/inverse-etfs-to-buy as an example.", "score": 1, "replies": []}, {"body": "The video game from the early 90’s", "score": 1, "replies": []}]}]}, {"body": "I love corrections.  I'm a dumpster diver.  If there's a crash, I'll be like a seagull at a landfill :)", "score": 21, "replies": [{"body": "Always a good idea.  Assuming you have something with which you can still pick up the garbage.\n\n\"Garbage is free for the taking, yet I have no hands.\"", "score": 8, "replies": [{"body": "Very true.   I try to never have all my eggs in the market basket.", "score": 2, "replies": [{"body": "Yes, even in a bullish cycle it is nevertheless wise to diversify due to rotational movements to maintain bullish direction in the general markets while allowing for consolidation in individual tickers.", "score": 2, "replies": [{"body": "Indeed.  Thank you for your comment", "score": 1, "replies": []}]}]}]}]}, {"body": "QE started after 2008. Changes everything", "score": 17, "replies": [{"body": "That's actually my thinking as well. I infer that due to the aggressively Keynesian and seemingly endless quantitative easing (QE) that went in effect following the 2008 recessionary move is a primary catalyst for a paradigm shift--in other words, QE is a game changer. We have shifted from Miltonian Economics to Keynesian, and now we are in uncharted territory, where bubbles are not only supported but encouraged. \n\nAs I said in another comment, my goal with posting this chart was to simply provoke some thoughts about whether or not the current treasury yield move should cause an increase in caution (whether through more modest than usual position-sizing or greater than usual hedging) due to an increase in the possibility of a potential rug-pull. Covertly, I was looking to see if others would also post about the paradigm shift QE has caused, as you did. So there may be hope for me after all, in that I may not be delving into a psychosis, haha.", "score": 8, "replies": [{"body": "Oh, good then we are on the same page.\n\nSo, I think there is one major difference : the spikes you see in 2000 and 2008 were caused by the Fed lowering the rates, which pulled the short-term rates low. They would have done it in reaction to the poor economic outlook, which is reflected by the stock market going down.\n\nThis time is different : it's the 10y yield rising, while the 2y is flat (fed has the short-term rates pinned near zero). So I wouldn't expect the same to repeat.\n\nI am admittedly jittery with the sharp rates in yields and it's outsized effect on stocks, but I am convinced the fed will not only keep the fed funds rate ultra-low but also won't allow the 10y to rise much further. So I am expecting a volatile market but not a crash. At least not yet.", "score": 11, "replies": [{"body": "Awesome input, thank you. I find your reasoning for the 2000 and 2008 reactions compelling and not necessarily incompatible with my own view. I'm also expecting greater volatility in the near to intermediate terms, not solely due to the yield move, but also due to its confluence with the need for consolidation of the massive recent gains. With that being said, I am also seeing a lot of bullish drivers, such as the strong uptrend in copper (which was recently tested via 20-day MA and came out positive) that is a solid indicator of economic outlook due to its many commercial and industrial applications. Henceforth, I also expect some choppiness and rotational movement. I know a lot of my colleagues who use Elliot Wave Principle quite baffled due to the inability (or indecisiveness, rather) in distinguishing between primary and secondary possibilities in various tickers. Again, thank you for your solid contributions to this discussion.", "score": 2, "replies": [{"body": "This would also be the reason that in mid-2013 a similar rise didn't affect the market. Investors are used to watching for these indicators, but after 2008 this isn't as much a predictor as it used to be pre-2008 QE. Same reason the usual growth/value rotation doesn't happen like it used to.", "score": 1, "replies": [{"body": "Can you explain this is layman’s terms please", "score": 1, "replies": [{"body": "The Federal Funds borrowing rate, which is what businesses and banks can get money at, usually fluctuates every few years, which you can see on the [historic graph](https://www.macrotrends.net/2015/fed-funds-rate-historical-chart). Usually when there is a recession the rate comes down. This affects everything from what you can get for a home loan to what your savings account pays you. You can see that in 2009 this dropped to under 0.15%, and didn't come back up until gradually starting in 2016. That 7 year time is far longer than usual, and lower than usual. Even after that, the rate really didn't get to the point where it was above what normal inflation rates would be near 2%. When the rate is lower, \"growth\" stocks usually thrive, where \"value\" stocks that don't need to borrow as much money to get going underperform in comparison. This is why there is such concern right now about the Fed potentially raising the rate, because it would signal a switch in what stocks would be successful, and cause existing bond fund investments to be undesirable. Who wants to get a 5% return when you could borrow at 1% to invest and get a 10% return? We may get a shift later, but everything seems to indicate that the Fed won't move til next year at the earliest to let the economy recover from the COVID restrictions.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I don’t know what will happen for sure. But I expect there first will be a boom with economies opening up again. This boom will be exaggerated (its already started), and then markets will correct. But I have the feeling the real exaggeration still has to come as all catalysts are not in place yet. But we will see. Make sure your investments are future themes so even if they correct, you know they will come back when actual value matters again.", "score": 12, "replies": [{"body": "Thanks for your input.\n\nWhat captured my interest was when you stated, \"all catalysts are not in place yet.\" Could you please elaborate? For instance, do you mean that the market has not priced in all catalysts? And if so, to which catalysts, in particular, do you allude? \n\nI look forward to hearing your response.", "score": 2, "replies": [{"body": "First of, this is my perspective. I could be wrong, as no one knows what the market has or hasn’t “actually” priced in. The way I see it, the opening of economy is the big catalyst, but you can divide this into several smaller catalyst. Like oil demand for example. Price is going up, but I see the oil tanking prices not going up yet.. again this can have multiple reasons, but I see this as a sign oil demand is not where it was pre covid. When this picks up it will be another sign economy is going where it was before, therefore a catalyst not in place yet. In general USA and Europe are just not where Asia is, they dealt with much more discipline fighting covid, EU and USA are too easy imo, which shows in several places still in lockdown.. once we see the vaccin actually showing in numbers that we “are really beating” covid, markets will “forget” any negative lockdown impacts.. I feel like this is in the markets already but not fully.. a third believe I have is that humans in general will go crazy when total freedom is back. People will consume like there is no tomorrow. This will be the highlight and the top exaggeration reflecting in the market, and then comes reality.. some sectors will flourish (clean energy, EV, everything to do with the big green shift the world has to make)\nThat’s how I see it anyway, got money in oil, clean energy and EV, because of my view. \nBut who am I 😉 make your own mind about the future and place your bets accordingly mate 😉", "score": 4, "replies": []}]}]}, {"body": "I won't mind a fire sale", "score": 9, "replies": []}, {"body": "What about that 2013-2014 part? You just don't know if you're coming off the real bottom. Those two prior periods also bounced off of significant inversions rather than the 1 bp inversion we had last year.", "score": 4, "replies": []}, {"body": "Wasn't 2000-2002 due to the dotcom bust and 2007-2008 due to subprime loans? What is the similar anti-catalyst now? There isn't any!", "score": 6, "replies": [{"body": "That’s exactly what I was thinking...", "score": 1, "replies": []}, {"body": "Inflation?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "So u rlly think markets would go up / profit if an inflation of the dollar would happen? Are u serious?", "score": 1, "replies": [{"body": "I took a little time to think about it. If the inflation index went up too much, at first the whole stock market would raise a stink. If this led to the Fed's interest rates increasing, then the overall stock market, but not SPY or QQQ associated stocks, could go down a lot. If however inflation increased a lot, then the markets would go way up because all other investments would be worthless in comparison.", "score": 1, "replies": []}]}]}]}]}, {"body": "I have no clue what I am talking about here but in 2012-2016  we had stability in an uptrend  when yields were high I see no reason for it to keep bringing down the market if yields were that high and we were bull we ant even at those levels yet granted we are touching bottoms now there's still room to grow. S&P on the other hand can be argued that a rug pull can happen in addition to the damage 2020 had we can see the repercussion soon.", "score": 2, "replies": [{"body": "The significance of the charts/illustrations I posted is not so much about the 'level' of the yields, but rather, it is moreso regarding the 'intensity' of the spike upwards; in other words, the markets would saw major corrections the last two times we had a major 'spike' upwards of the nature that we are seeing currently. Again, I personally am not saying the markets are about to see a major recessionary correction, as they did the last two times with such violently upward moves in yields. Instead, I am merely contributing these illustrations as a vehicle for thought-provocation. If you happened to have read my comments in the discussion, I myself am leaning towards the view that history will not repeat due to the paradigm shift of the aggressive and the incessant quantitative easing (QE) that has shifted the macroeconomics of our current times from Miltonian towards a more Keynesian nature, thereby placing a 'safety net' of capital injection that 'comforts' the markets, if you will so indulge me to say so. In other words, since the 2008 debacle, the Federal Reserve has 'vaccinated' the markets from contracting an immensely volatile and recessionary contraction (pun intended, haha) caused by the same catalysts in the past, with violently rising yield moves possibly being one of such catalysts.", "score": 2, "replies": [{"body": "Very well said, great explanation and I totally agree with you. We are also in a newer age of trading as well compared to the previous markets which to me means every dip will be bought and so on and just as fast because you don’t need to call some gimp to trade and everybody is downloading interactive broker to get there feet wet.", "score": 1, "replies": []}]}]}, {"body": "Fubo t.v = sports bets from ur TV = lazy Americans hungry = 🚀 and 🚀= attend off gme and amc= melvy wants to make up for losses this yr at same time he gets attention off of losses = win", "score": 2, "replies": []}, {"body": "I would think you need more data than the last 20 years to make any determination about a connection", "score": 3, "replies": []}, {"body": "Hold amc/gme and don’t worry", "score": 2, "replies": [{"body": "Haha, I bet you'll get the most upvotes out of all the comments, even more than the original post, being that we're on Reddit after all. What about $BB, by the way? Did it stop getting the WallStBets love already? Of the three, I personally think $BB is most valuable, due to its transition from cell phones to cyber security. Anyway, thanks for your input, haha.", "score": 4, "replies": [{"body": "Thank you! It is idea. People are holding the stock and when everything drops you are safer where people are holding. Check on volume indicator", "score": -1, "replies": []}]}]}, {"body": "I agree, the market will correct or crash very soon", "score": 2, "replies": [{"body": "I was never stating it will definitely crash soon. I have no way of knowing. To state that with confidence is, in my humble opinion, reckless.", "score": 7, "replies": [{"body": "I have been seeing this same sentiment a lot in recent weeks.\n\nI pulled back to 35% cash when T\\*\\*\\*p was on the way out, figuring he would shit on the dinner table as he was leaving the party.  I've been quite surprised that we haven't seen a spiteful rug pull since Biden came in.\n\nI've been filtering money back in to my ETFs and funds.  I do think I will start to go back to cash in some of the high performers. \n\nYet, with good vaccination and reopening news, there may be a surge in spending and consumer confidence for a bit.  Impossible to know.  Prepare for anything.", "score": 2, "replies": [{"body": "People are tired of the covid restrictions , people are going to spend like drunken sailors this summer . \n\nI have a fear people will use credit regardless so 18 months from now I predict a hangover from a summer of fun ..", "score": 5, "replies": [{"body": "I've been spending the COVID year like a drunken sailor.  My liver needs a break.\nIt's been 50% \"Three Sheets\" and 50% Emeril.", "score": 2, "replies": []}]}, {"body": "I would think the opposite, regarding your statement of being surprised from a lack of a \"spiteful rug pull since Biden came in.\" The reason being the simple fact that the Democrats were/are far more inclined towards increased stimulus and Keynesian (which is historically the liberal school of economics) than the Republicans, who are moreso anti-deficit (ironically too, considering the historical expansion of deficit under Reaganomics) and Miltonian (historically the conservative, \"laissez faire\" school of economics). The markets like capital injection, even at the expense of USD deterioration.", "score": 4, "replies": [{"body": "Not to mention the nearly four trillion dollars that the Republicans mobilized under Trump, to give away to the 1% and corporate interests.  The lack of fiscal integrity by self-styled \"Conservatives\" is laughable, if it weren't so misanthropic, greedy and anti-humanitarian.\n\nI decided to stop being a US homeowner, due to the elimination of the mortgage interest deduction.  That shifted the balance of value to renting, for me.  So fuck one of the peak engines of American economic, military and scientific achievement: the rise of the American homeowner. We're going to be Guatemala in 20 years, if Republicans are allowed to keep f*cking our people and our system.", "score": 2, "replies": [{"body": "Elimination of the mortgage interest deduction?  Source?", "score": 1, "replies": [{"body": "Trump.", "score": 1, "replies": []}]}]}]}, {"body": "Did you just blur out trump then write Biden lol", "score": 3, "replies": [{"body": "What?  \n\nGo home, you're drunk.", "score": 1, "replies": []}]}]}]}]}, {"body": "Just to reiterate, the significance of the charts/illustrations I posted is not so much about the 'level' of the yields, but rather, it is moreso regarding the 'intensity' of the spike upwards; in other words, when the markets saw major corrections the last two times we had a major 'spike' upwards in yields of the nature that we are seeing currently. Again, I personally am not saying the markets are about to see a major recessionary correction, as they did the last two times with such violently upward moves in yields. Instead, I am merely contributing these illustrations as a vehicle for thought-provocation. If you happened to have read my comments in the discussion, I myself am leaning towards the view that history will not repeat due to the paradigm shift of the aggressive and the incessant quantitative easing (QE) that has shifted the macroeconomics of our current times from Miltonian towards a more Keynesian nature, thereby placing a 'safety net' of capital injection that 'comforts' the markets, if you will so indulge me to say so. In other words, since the 2008 debacle, the Federal Reserve has 'vaccinated' the markets from contracting an immensely volatile and recessionary contraction (pun intended, haha) caused by the same catalysts in the past, with violently rising yield moves possibly being one of such catalysts. With that stated, as the markets venture into uncharted territory, there may be new unsuspected and problematic catalysts for a recessionary event; for now, such extrapolative pondering is boundless solely in the imaginative mind--good times for being a theoretical economist as I'm sure many are finding themselves as mercenaries in the comfortable offices of Goldman Sachs, Morgan Stanley, and the like.\n\nSidenote: As far as $SPX / $SPY is of concern, this upcoming week, triple / quadruple witching week as some refer to it, historically (1984 to present) has had a very profitable tilt, more so than any other monthly OPEX week, as can be viewed in the illustration I uploaded in this link: https://m.imgur.com/a/nldZCWi .", "score": 1, "replies": []}, {"body": "Terrible analysis.  What anoint the spike in ‘13?\n\nWhy is this one like the dumps you compare it to? HINT: it’s not", "score": 0, "replies": [{"body": "The post itself is not analysis...if it was analysis I would have posted it under the flare \"technical analysis.\" It's food for thought. If you read my comments in this discussion, you might see that my own personal perspectives actually contradict what you \"guess\" is my \"analysis.\" Good bye", "score": 1, "replies": []}]}, {"body": "It’s no secret there are tons of overvalued stocks in the market right now, or companies valued for a 2025 fair value. I’ve reduced my margin significantly and I’m stacking some cash so I’m ready for the next buying opportunity. Crashes/corrections are how you supercharge your portfolio!", "score": 1, "replies": []}, {"body": "All thing had change . Current is different", "score": 1, "replies": []}]}
{"title": "DD - FNKO Launching NFTs in 2021", "selftext": "FNKO ([Funko](https://www.cnbc.com/2021/03/11/funko-fnko-q4-2020-earnings.html))\n\nShare Price (3/12/21) : $17.77\n\nShare Price (09/16/19) : $27.86\n\nShort Interest (1/26/21) : 12%\n\nNext Earnings Release: May 2021\n\nUpdating two previous DD posts on Funko Toys with new information based on their latest conference call earlier this week ([DD1](https://www.reddit.com/r/smallstreetbets/comments/l8fems/dd_funko_toys/?utm_medium=android_app&utm_source=share), [DD2](https://www.reddit.com/r/smallstreetbets/comments/lgm5db/new_info_funko_toys_dd/)).\n\nFunko is well positioned for continued growth in 2021 with potential upside from entering the hot NFT market “fairly soon.”\n\n(TL;DR at the end)\n\n=====================================================================\n\nHere are some highlights from their Q4 earnings report (3/11), Q4 earnings call (3/11), and an interview with the CEO this morning (3/12) with additional information on each bullet further down in the post (For more context please review the prior DDs linked above):\n\n· Funko beat expectations with its second highest revenue quarter ever\n\n· Growth is expected continue in 2021; driven by Europe, Loungefly, and other initiatives\n\n· Operational responsiveness and flexibility has allowed Funko to thrive during the pandemic while providing a way to engage with fans in new and more creative ways\n\n· Multiple analysts increased their price targets on the stock after the earnings release\n\n· Funko’s CEO Brian Mariotti announced the day after earnings that Funko intends to move into the NFT (Non-Fungible Token) market “fairly soon”\n\n=====================================================================\n\nFUNKO BEATS EXPECTATIONS\n\n· Net Sales in Q4 2020 was up 6% vs Q4 2019 to $226 million\n\no This represented Funko’s second highest revenue quarter in its history\n\no Outperformance was driven by the US market which had its highest revenue quarter in history and grew 18% vs. Q4 2019\n\no International was constrained by lockdowns; but still grew 10% vs. Q3 2020\n\no Non-figure product revenue grew 30% in the quarter vs Q4 2019\n\n· Gross margins increased 37.2% in Q4 2020 vs. 29.2% in Q4 2019\n\n· SG&A decreased 6% to $53 million\n\n· Cash Flow From Operations increased 69% to $47 million\n\n· Funko’s direct-to-consumer sales nearly doubled compared to the prior year\n\nGROWTH EXPECTED TO CONTINUE IN 2021\n\n· Funko is forecasting 30% revenue growth in Q1 2021 (vs. Q1 2020)\n\n· Full year sales growth is forecasted at between 25-30%\n\n· Gross margin is expected to strengthen in 2021; driven by Funko’s direct-to-consumer initiative and from regional / distribution mix shifts\n\n· Full year adjusted EBITDA is expected to increase 120 to 170 basis points to between 13.5% and 14.0%\n\n· Many major Television, Film, and other properties held back because of the pandemic are expected to return as the economy opens up. This will create demand for new purchases.\n\no Marvel: It is expected that Marvel will be releasing about 5 new television shows on Disney + this year and another 5 films theatrically.\n\no Games: Several hot game properties will be releases later this year that will create more content from which to create Funko toys\n\no Other: Funko is always making deals for new IP licenses and expects to make a “major master toy announcement” fairly soon\n\n· Loungefly and Snapsies product lines continue to grow and provide additional avenues for Funko to drive more sales growth\n\nFUNKO THRIVES DURING THE PANDEMIC\n\n· Despite many major releases throughout the pandemic beyond The Mandalorian, Funko was still able to drive significant purchase activity of it’s brand and products\n\no Evergreen content represented 68% of sales. (Evergreen content is essentially licensed properties that don’t have a major release associated with them at the time. For example, Harry Potter and The Office would be examples of Evergreen Television properties sold last quarter.)\n\no As the economy opens up, Funko expects more properties to become available for licensing and product development\n\n· Funko was able to accelerate its move to create a direct-to-consumer website for Funko products in Europe ahead by two years ahead of schedule\n\no FunkoEurope.com was launched in Q4 2020 (October); allowing Funko grow its sales in Europe despite lockdowns\n\no Given that Funko’s direct-to-consumer site just launched, we can expect continued growth back to pre-pandemic levels in Europe over time as Funko drives traffic to its website and countries open back up from lockdown\n\no Five months ago, Funko started in three EMEA countries and has since expanded to eight countries in the region\n\n· Funko’s diversification into other products like Loungefly bags and board games help Funko maintain growth during the pandemic\n\no Non-figure products represented 23% of revenues\n\no Funko’s expanded games portfolio grew 50%\n\no Loungefly grew 55% in Q4\n\n\\-- Funko will be expanding its Loungefly relationship with Amazon this year\n\n\\-- Loungefly is seeing strong demand across EMEA and other regions\n\no In board games, Funko launched new titles like Marvel Battleworld, Godzilla, Tokyo Clash, and Back To The Future to name a few\n\n· Funko’s overall e-commerce and direct-to-consumer business continued to perform well, expanding on strong Q3 2020 performance\n\no Total direct-to-consumer sales were 8% of revenues in 2020 vs. 4% the prior year\n\no Global mass market and third party e-commerce helped drive growth in 2020 as it represented 35% of sales in 2020 vs. 28% in 2019\n\n· Funko adjusted by finding new ways to connect with fans during the pandemic as in-person events like San Diego Comicon were not possible\n\n\\-- “Virtual cons” in connection with Comicon in San Diego, New York, and Emerald City were successful in driving revenue increases\n\n\\-- Social media promotions helped drive increased engagement / awareness\n\n\\-- In lieu of attending New York Toy Fair, Funko decided to host its first ever virtual “Funko Fair” where they partnered with their licensors and retailers to engage fans and launch new offerings.\n\n· The event was a big success leading to nearly 1.5 million units being pre-sold to fans through retail partners. Many of those items sold are still six to nine months away from being released.\n\n· Funko launched “Funko Pop Albums” in 2020 where they release Pop! versions of classic album covers\n\no For example, the AC/DC’s classic “Black In Black” record was Funko’s top collectible item at one of their key mass market retailers\n\no Given the strong initial fan reaction, Funko plans to expand the concept across new genres including sports, trading cards, and comic book covers\n\nMULTIPLE ANALYSTS INCREASE THEIR PRICE TARGETS\n\n· Goldman Sachs analyst Michael Ng\n\no Raised the target price 130% to $15.30 (from $6.60)\n\no Q4 EBITDA beat expectations\n\no Impressed by Funko’s ability to pivot during the pandemic by leaning into e-commerce, games, and soft goods\n\n· DA Davidson analyst Lind Bolton Weiser\n\no Raised the target price 142% to $17.00 (from $7.00)\n\no Boosting their modeled multiple to 17-times earnings (from 9-times earnings)\n\no Believes the company is returning to growth while improving its fundamentals\n\n· Truist analyst Michael Swartz\n\no Raised the target price 38% to $18.00 (from $13.00)\n\no Funko reported a much better than anticipated Q4 and 2021 guidance\n\no Looks well positioned for the year ahead given the strong theatrical line-up, easy comps, product expansion initiatives, and the favorable impact of its high-growth DTC platform\n\n· Piper Sandler analyst Erinn Murphy\n\no Raised the target price 46% to $22.00 (from $15.00)\n\no Strong Q4 results\n\n===================================================================\n\n*(At this point my post moves away from more traditional fundamental analysis / information towards more speculative types of things. While I do not really understand the fascination with cryptos nor NFT’s themselves, I do recognize that valuations throughout financial markets have deviated significantly from how I might value them based on more traditional metrics like price-to-earnings ratios or discounted free-cash-flow. Obviously, Tesla, AMC, and GameStop are recent examples of this in the stock market. Crpytos, sports cards, and Pokemon cards are recent examples in other markets (where there isn’t really any cashflow or profit stream intrinsic to the underlying asset from which to determine value). So, if you decide to purchase the stock based on factors outside of fundamental analysis, like momentum and meme-ability, please make sure to position size and be careful. As they say, return-of-capital is just as important as return-on-capital. So, once you move away from fundamental analysis to determine entry and exit into a position, the decision becomes primarily one based on emotion and “gut feel.” Finally, here are two books that I recommend on understanding market bubbles.* [BOOK 1](https://www.amazon.com/Devil-Take-Hindmost-Financial-Speculation/dp/0452281806)*.* [BOOK 2](https://www.amazon.com/Manias-Panics-Crashes-History-Financial/dp/1137525754/ref=tmm_pap_swatch_0?_encoding=UTF8&qid=&sr=)*. That’s all for my PSA. I’ll get off my soapbox now and go back to the DD. Thank you for reading. Obviously, the news today that Funko plans to enter the NFT marketplace soon is an important announcement. So any DD without incorporating NFT’s into it would clearly be incomplete.)*\n\n===================================================================\n\nFUNKO MOVING INTO NFTs “FAIRLY SOON”\n\nThere aren’t many publicly traded companies that I can think of at this point playing in the NFT space. You have companies like Square and Paypal getting into cryptos from traditional fintech. You have companies with a core business outside of cryptos like MicroStrategy and Tesla buying Bitcoin for their treasury. Then you have others like Coinbase and Grayscale Bitcoin Trust who were born from the crypto world. But there none I can think of that are tied directly to NFT’s right now other than Funko.\n\n*(If you can think of any other publicly traded companies that have announced their intention to move into NFT’s, please post their names in the comments below. Thank you.)*\n\nAfter today’s [interview](https://finance.yahoo.com/video/funko-ceo-ability-disrupt-nft-151936943.html) with CEO Brian Mariotti (quote at the end of this section), Funko seems to have the NFT market clearly in its sights. As we have seen with many other crpyto-related stocks, a company’s share price can swing wildly on a small announcement and the volatility can be extreme. If Funko issues a press release or makes a formal announcement about a new NFT product, the share price could move quickly one way or the other. Because of this, there is clearly additional value beyond its core physical Pops and Loungefly businesses that could be added to Funko’s valuation.\n\nI don’t even know how to begin to estimate the potential value of NFT’s on Funko’s stock price. So instead of doing that, I will try to provide some information and research on recent activity in the NFT space. Hopefully this will be useful to you in deciding whether you would like to incorporate NFT’s in the estimate of what you think Funko is worth. \n\nHighlights of recent NFT milestones and news events:\n\n· Beeple is the poster child of NFT right now as he recently sold his NFT for $69 million ([Here](https://www.npr.org/2021/03/11/976141522/beeple-jpg-file-sells-for-69-million-setting-crypto-art-record))\n\n· NBA launches NBA Top Shots where people can buy NFTs highlights of basketball plays. This guy turned $175k into $20 million in value. ([Here](https://www.wsj.com/articles/nba-top-shot-nft-crypto-digital-collectibles-11615266042))\n\n· Goldin Auctions getting into NFTs after dominating physical sports card auctions\n\n· Elon Musk’s girlfriend Grimes (a singer) sold $5.8 million in NFT art in 20 minutes ([Here](https://www.businessinsider.com/grimes-nft-art-warnymph-sells-for-millions-20-minutes-2021-3))\n\n· Jack Dorsey is auctioning off the very first tweet as an NFT ([Here](https://www.theverge.com/2021/3/9/22321464/jack-dorsey-nft-tweet-auction-bitcoin-donate-charity))\n\n· Nyan cat sells for $600,000 ([Here](https://www.businessinsider.com/bad-luck-brian-meme-nft-crypto-art-blockchain-ethereum-foundation-2021-3))\n\n· Crypto Punks are sold for values from tens of thousands to millions of dollars ([Here](https://www.larvalabs.com/cryptopunks/topsales))\n\n· CryptoKitties can sell for thousands or more ([Here](https://www.cryptokitties.co/))\n\n· A start-up raises $5 million to create a fantasy-based NFT video game ([Here](https://venturebeat.com/2021/03/11/illuviam-raises-5-million-for-nft-based-fantasy-battle-game/))\n\n· Video game items and real estate being purchased as NFTs, potentially changing how games are developed and monetized ([Here](https://venturebeat.com/2021/02/26/the-deanbeat-how-non-fungible-tokens-nfts-will-change-games/))\n\n· Investment funds are being created to invest in NFTs ([Here](https://markets.businessinsider.com/currencies/news/what-are-risks-of-investing-in-nft-2021-3-1030187329))\n\n· DC Comics tells artists not to create NFTs based on their IP while it researches the space; suggesting that DC Comics may already have NFT deals pending announcement or in negotiations ([Here](https://io9.gizmodo.com/dc-comics-tells-artists-to-stay-out-of-nft-business-or-1846466427))\n\nCelebrities, famous people, and others talking about or playing in the NFT space:\n\n[Cathie Wood](https://www.businessinsider.com/post-selloff-investing-cathie-wood-nfts-trading-tips-insider-investing-2021-3)\n\n[Gary Vee](https://markets.businessinsider.com/currencies/news/gary-vaynerchuk-nfts-bitcoin-regulation-coinbase-cheddar-interview-2021-3-1030186922)\n\n[Rob Gronkowski](https://www.entrepreneur.com/article/367085)\n\n[William Shatner](https://www.prnewswire.com/news-releases/william-shatner-makes-history-on-the-wax-blockchain-301103510.html)\n\n[Mark Cuban](https://www.cnbc.com/2021/02/22/mark-cuban-the-business-id-start-now-would-center-around-blockchain.html)\n\n[Patrick Mahomes](https://www.cnbc.com/2021/03/12/patrick-mahomes-to-sell-nft-trading-cards.html)\n\n[Lindsey Lohan](https://www.forbes.com/sites/lawrencewintermeyer/2021/02/12/non-fungible-token-market-booms-as-big-names-join-cryptos-newest-craze/?sh=22ac801f460a)\n\nPotential impact of NFT’s on Funko’s go-to-market strategy (speculating on how Funko MIGHT implement NFT’s to expand and reinforce their business model):\n\n· Digital items have the ability to move globally in an instant; increasing the total addressable market. Both for Funko and for collectors.\n\no For Funko it allows them to sell into harder to reach markets like Latin America, Africa, and Asia. There are probably wealthy collectors in many countries that want to own Funko and Loungefly products, but don’t have immediate access.\n\no For collectors, it allows them to buy and sell digital items across the world instantly without having to wait on receiving a physical item. \n\n· All collectibles and art have concerns with fakes and counterfeits. By using blockchain technology and NFT’s, Funko can reduce the impact of counterfeiters on their business. When someone purchases a rare item, their NFT can serve as certification of its authenticity through the blockchain.\n\n· NFT’s allow Funko to move to blockchain based payment systems and tap wealthy investors looking to diversify out of their crypto coin holdings into physical and digital items.\n\no There are many wealthy crypto investors that are looking to park their money in other investments to diversify their portfolio.\n\no Additionally, there are other investors that are not currently investing in cryptos and blockchain that might be interesting in a solution that merges a rare physical item with a rare digital NFT.\n\n· NFT “artists” or “creators” can collect a piece of the revenue each time the specific digital asset turns over. For example, if Funko made an NFT and it was sold 20 times over the course of a year, a company Funko might collect a fee every time the NFT were sold (depending on how the system were structured).\n\no Funko NFTs could be sold directly to the consumer through Funko’s website or (what I think is more likely) through retail partners like GameStop, Target, Walmart, Hot Topic, and other retailers looking to get in on the NFT craze.\n\nQuote from Funko’s CEO [interview](https://finance.yahoo.com/video/funko-ceo-ability-disrupt-nft-151936943.html) about NFT’s:\n\n“We’re excited about it and we have a plan in place. We have some technology in place. We are going to be out in the market fairly soon. But we’re going to out in the market in a very different way. We have the ability to disrupt this space in a way that nobody else is doing right now. We can tie digital NFT’s to our fan base and link NFT’s with physical products. And that’s not happening right now. So, for example, if you had a pack of NFT’s. I won’t mention licenses. And there are a few rare ones. If you have those rare ones, we’re going to give you a free product that is tied to that rare NFT. Which means you have a super rare physical product that ties to your super rare NFT. That’s disruptive. That’s new. It’s different. It’s only what Funko can do. And we’re really excited about what the future of NFT’s are. We’re certainly all over this. And I think you’ll see fairly soon from Funko in the market.”\n\nTL;DR:\n\nAs expected, Funko had a strong Q4 2020, driven by continued strength in their core product line and e-commerce sales in the US market. Funko’s sales are expected to continue to grow in 2021 as the company builds upon its wins from the second half of 2020. Funko’s international business represents an area of additional opportunity as the company has not fully recovered from sales declines in the region yet. Continued development of Funko’s direct-to-consumer initiatives in Europe along with store reopenings after lockdowns should remedy this.\n\nWhile Funko has not formally announced their entry into the NFT market with a press release, thier CEO's interview with Yahoo Finance suggests that the company soon will. Funko announcing their entry into NFT’s would probably drive more attention to the stock and more investors to Funko products. At that point Funko would become more than just a “toy company.” They would become a collectibles company making products for the NFT marketplace. Many products made by Funko already command a significant premium in the secondary market. (Some examples: [Disney Bag 1](https://www.ebay.com/itm/Disney-Cast-Member-Exclusive-LE-600-Mickey-90th-Anniversary-Loungefly-Backpack/353336689947?hash=item524482051b:g:hj4AAOSwTu9fyDep), [Disney Bag 2](https://www.ebay.com/itm/NWT-Disney-Loungefly-Sleeping-Beauty-DEC-Employee-Backpack/373488324364?hash=item56f5a38f0c:g:eWIAAOSw3qVgRW30), [Funko 1](https://www.ebay.com/itm/Funko-Freddy-Bloody-leatherface-POP-Exclusive-12-PIECES-EXTREMELY-RARE/143968624938?hash=item218532e12a:g:RgIAAOSwEiNgQco-), [Funko 2](https://www.ebay.com/itm/FUNKO-Pop-Games-Fortnite-VALOR-463-Vinyl-Figure-NIB/392842180285?epid=15027456221&hash=item5b7737f6bd:g:wRMAAOSwc7Ve6lE9), [Funko 3](https://www.ebay.com/itm/Funko-POP-Star-Wars-Holographic-Darth-Maul-SDCC-480pcs/133480926875?hash=item1f14154e9b:g:JjMAAOSwfYpfJMGL)). Imagine what could happen to prices if those same products were combined with accompanying NFTs. This new opportunity with NFT’s provides optionality on an already stable core business of collectible toys, games, and merchandise.\n\nPositions: Long Shares & Calls\n\nDisclosure: I am long FNKO. This is not investment advice. I reserve the right to buy or sell FNKO without updating this thread. Do your own research and share (or not share) with the community in this thread. Thank you to the others on Reddit that shared this idea earlier.\n\nFeedback: If you have any additional information, ideas, or critiques please make sure to comment. It is great to get the perspective of others when making an investment.\n\nPrevious DD:\n\n[FNKO 1](https://www.reddit.com/r/smallstreetbets/comments/l8fems/dd_funko_toys/)\n\n[FNKO 2](https://www.reddit.com/r/smallstreetbets/comments/lgm5db/new_info_funko_toys_dd/)\n\n[Herman Miller](https://www.reddit.com/r/smallstreetbets/comments/hdllcr/herman_miller_mlhr_work_from_home_in_your_new/)", "id": "m4fb1a", "created_utc": 1615669224.0, "score": 86, "upvote_ratio": 0.92, "num_comments": 59, "comments": [{"body": "entered at 12, sold at 18. i expect it to drop to 14/15, if it does, i'll jump back in.\n\nNFT is getting hyped a LOT by the crypto-community", "score": 24, "replies": [{"body": "69 million dollar NFT has a lot of people talking", "score": 19, "replies": []}, {"body": "Same so I thank OP for convincing me to make the jump but when it drops back down I’ll go back in", "score": 2, "replies": []}]}, {"body": "To me Funko is a clear consumer discretionary play, and that category seems to be strong given higher savings and stimulus", "score": 16, "replies": [{"body": "I'd think you'd be right if covid lockdowns were here to stay. People are gonna be out partying, traveling, and actually spending their money in the near future- not saving and being bored at home lol", "score": 2, "replies": [{"body": "I don't think that stereotypical consumers of their dolls are party-goers with wild travel spending habits lol", "score": 3, "replies": [{"body": "Do they go on trips to see friends and family though?", "score": 2, "replies": []}]}]}]}, {"body": "Not sure why ppl are doubting on NFT's. I think that business will grow astronomically. My two cents 🤔", "score": 13, "replies": [{"body": "People dislike what they don’t understand. I should know, I disliked Bitcoin when I first heard about it. I didn’t understand the value proposition or the network affect or the problem that it was solving. To me it was just some weird internet thing that people were hyping or was a very complex Ponzi scheme. I guess Ponzi schemes are just that until they become normalized. Anyways, I have done some research on NFT’s with a mindset that compensated for the mindset I lacked back in the day with Bitcoin and crypto. Now I see the value proposition and what it could mean for market disruption. Most likely, this will change collectibles as we know it forever.", "score": 3, "replies": []}]}, {"body": "CNBC was talking about this so I'll pass.", "score": 21, "replies": [{"body": "If you don't like CNBC, where do you get your ideas?", "score": 2, "replies": [{"body": "WSB obviously", "score": 32, "replies": [{"body": "What's WSB? Hahahaha!", "score": 5, "replies": [{"body": "you got aut1st in ur name bro, wallstreetbets", "score": 8, "replies": [{"body": "Yeah. Sorry, the sarcasm wasn't obvious I guess.", "score": 19, "replies": []}]}]}]}]}]}, {"body": "Fantastic DD!\nI’ve also been long Funko for quite a while.\nAt ~17x 21earnings, it feels like such a no brainer.", "score": 9, "replies": [{"body": "What kind of PE are you expecting?", "score": 3, "replies": []}]}, {"body": "Terrific DD", "score": 7, "replies": [{"body": "Thanks", "score": 6, "replies": []}]}, {"body": "I just learned about NFTs a few days ago and it’s one of the most retarded concepts I’ve heard about in a while. But then again people are pretty fucking retarded in general so who knows what will happen. I definitely don’t want any part of it though.", "score": 18, "replies": [{"body": "Just looked it up. Huh. \n\nSometimes I wonder if I'm from the same species as people that waste money on things like funko pops. And nfts are just digital files. It.... Doesn't make any sense", "score": 5, "replies": [{"body": "Think of it as a digital certificate of authenticity", "score": 6, "replies": [{"body": "I thought it was also dumb when I first read into it, but then again, I also thought Bitcoin was a dumb investment. Then I realized it could be used to verify the authenticity of the item and that’s when I realized it will forever revolutionize the trading/collecting space.", "score": 3, "replies": [{"body": "NFT is dumb, but ya its a digital certificate of authenticity and it shows past owners of it so has a few things going for it. Should NFT's be selling for 60million OH HELL NO but there are lot of dumb people out there.", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Digital artwork that no one can steal or copy bought with crypto", "score": 4, "replies": [{"body": "You can steal/copy it. But you won't have the original. Such as I copy an artist's digital art and use it as my wallpaper.", "score": 14, "replies": [{"body": "Which is kind of weird, because all you get from buying an NFT is the ability to say \"I have the original png file\", which sounds an incredibly dumb thing to spend money on.", "score": 10, "replies": [{"body": "I don't think it's weird at all. It's like owning a Picasso. There are a lot of fakes but someone owns the original and they can say \"I have the original painting (file)\". This might be the future, I don't know. It's very interesting though.", "score": 4, "replies": [{"body": "You can't create a million identical copies of a Picasso instantly. Of course one can debate the value of original artworks ad nauseam, but NFTs push it to an extreme, where the only noteworthy thing about them is that the process is kind of new. That being said, there's a lot of money in it, so some companies could make a killing from them.", "score": 3, "replies": []}]}]}]}]}, {"body": "Think NTF as a digital certificate of authenticity that uses blockchain so no fakes", "score": 3, "replies": []}]}, {"body": "I like the NFT play. Higher oil prices might hurt the rest of the company. I’m hoping for a nice dip to get in on Funko.", "score": 3, "replies": []}, {"body": "Some funkos are worth a lot. I wouldn’t be surprised if these took off", "score": 3, "replies": [{"body": "I think same and I think people underestimate what NFTs can be for both digital and physical commodities. If it wasn't worth getting into, companies like Funko, Origin, Brave, MerchDAO wouldn't get into it.", "score": 1, "replies": []}]}, {"body": "This is going to short squeeze, people don’t seem to look at the massive institutional ownership making the shorts compete with a very limited pool of retail investors compared to the total shares outstanding. With the possibility to the NFT rocket ship going on this will squeeze HARD.", "score": 3, "replies": []}, {"body": "Good DD! I think it's a bit over valued atm, maybe not at the time you posted, but here 5 days later it looks like the NFT hype is priced in. oh well. I'll do my homework and consider this one if I see a good entry price in the future", "score": 2, "replies": [{"body": "Thanks for the feedback!", "score": 1, "replies": []}]}, {"body": "My day job is in selling toys, and I am very bullish on Funko. The NFT thing is a perfect pairing as they are planning to back it with a physical product, so that is going to give people a way to collect a physical item as well as the NFT. I could see people having virtual Pop Walls they can share with other collector's online. It also helps address issues of authenticity, as the very rarest pops become targets of counterfeiting. Already in their physical products they have Chases, which are rare special editions that are intermixed in with common versions of a pop. These are much more valuable on the resale market. But the biggest thing about NFT's is the digital royalty that allows the creator Funko to capture resale value. Right now Pops have a MSRP of 10-45 depending on size and exclusivity. But anything rare is go for 2-20x that in it's lifespan on the secondary market. That's a lot of margin they could tap into. \n\nBesides this NFT play as someone who retails their products I have noticed a lot of smart decisions. They have been rereleasing stuff that has done very well on the secondary market to give more people a chance to collect at MSRP. They have done collaborations with Youtubers to get fan input on new lines. They have been branching out into the board game market using their top IP like Harry Potter, Golden Girls, Five Nights at Freddy's, etc. Board games are a huge market, and games related to IP are very collectible in themselves. They also came out with a surprise toy called Snapsies. Surprise ball toys have just been dominating the girls toy industry for the past 3 years. The biggest names are LOL, Hatchimals, and Mini Brands but those have all had their peak Q4. That's not to say they aren't still doing very well but they have all gone through a year where they couldn't keep them on the shelves and now supply matches demand. I noticed on Amazon, that Snapsies are now on the first page of results if you search for surprise toys. Their ranking just broke the top 2,000 in toys in the past few weeks, which is a great place for any toy to be although for comparison LOL toys are pretty consistently in the sub 500 group or even sub 100. It may not be what I would call a run away hit, but it looks like it's going to be successful foray into the 3-8 year old toy market. That line is inhouse IP so maximum margins. If it takes off they are poised to create a full line of plush, Pops, tshirts, etc.", "score": 2, "replies": [{"body": "Thanks for the feedback and additional information!\n\nIt seems to me that you should be writing the DD. :)", "score": 3, "replies": []}]}, {"body": "HYPEBEAST: Rob Gronkowski's Debut NFT Card Collection Rakes in Over $1.2 Million USD.\nhttps://hypebeast.com/2021/3/rob-gronkowski-debut-nft-card-collection-over-one-million-usd-announcement", "score": 1, "replies": []}, {"body": "Topps had revenue of $567 million in 2020\n\nhttps://finance.yahoo.com/news/this-major-investor-invested-100-million-of-his-winnings-from-the-game-stop-trading-frenzy-into-baseball-trading-cards-161804171.html", "score": 1, "replies": []}, {"body": "CNN : NBA Top Shot customers can't get their money out. Experts are confounded.\nhttp://rss.cnn.com/~r/rss/cnn_us/~3/BNfLWwflskU/index.html", "score": 1, "replies": []}, {"body": "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: Devil Take the Hindmost: A History of Financial Speculation \n\n>**Company**: Edward Chancellor\n\n>**Amazon Product Rating**: 4.5 \n\n>**Fakespot Reviews Grade**: A\n\n>**Adjusted Fakespot Rating**: 4.5\n\n>**Analysis Performed at**: 02-07-2021 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/devil-take-the-hindmost-a-history-of-financial-speculation) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*", "score": -1, "replies": [{"body": "Yes. It's the realest of books.", "score": 2, "replies": [{"body": "Great DD, super weird bot interaction", "score": 5, "replies": [{"body": "Thanks", "score": 2, "replies": []}]}]}]}, {"body": "Great DD. Do you have a price target?", "score": 1, "replies": []}, {"body": "do we get in now or wait for more dips, i dont want any part in a 7 layer dip. Got enough of that with sklz", "score": 1, "replies": []}, {"body": "Great DD - thanks!", "score": 1, "replies": [{"body": "You're welcome.\n\nHopefully you made some $$.", "score": 1, "replies": []}]}]}
{"title": "Out of VIAC. Now in GNOG, SRPT, and GD.", "selftext": "[removed]", "id": "m43z1z", "created_utc": 1615632412.0, "score": 122, "upvote_ratio": 0.84, "num_comments": 52, "comments": [{"body": "I like GNOG it’s so cheap too", "score": 23, "replies": []}, {"body": "5 other comments here and all hidden lol.\n\nGood DD, I've been looking into an oil company going green and BP stood out to me too.", "score": 16, "replies": []}, {"body": "Your viac dd was so good. It closed at 95 today. Do you think the run is over? P/e is \"only\" at 22 right now.", "score": 13, "replies": []}, {"body": "I’d appreciate a GNOG write up. Looks like it could definitely have a crazy run up.", "score": 11, "replies": []}, {"body": "Thanks for the write up. Worked for LMT for 10 yrs. Amazing company but why swing on LMT and GD on the basis of Space growth? That’s not happening in 6 mo.", "score": 8, "replies": []}, {"body": "I have been in GNOG for awhile, they are beating expectations. What am I missing here? Why the dips?", "score": 6, "replies": []}, {"body": "This is some fresh water; good agua!", "score": 5, "replies": []}, {"body": "Thanks for the insights. GNOG fan here as well. I am curious as to your thoughts on the industry. It seems like Draftkings and other bigger names are pretty damn inflated considering the revenue totals for the sports betting market as a whole and wonder if that can hurt this.", "score": 4, "replies": []}, {"body": "GNOG Fertitta has crazy funds after selling UFC. To the moon.", "score": 4, "replies": []}, {"body": "I like BP clean transition, but I have so much money parked in vanguard funds, I'm assuming they have a shit ton of BP right ? \n\nEitherway;  I'm afraid so much money has gone into energy and clean energy in particular in the last few months ..", "score": 3, "replies": []}, {"body": "is it still worth getting into  **SRPT** ? it dropped down a lot lately", "score": 3, "replies": []}, {"body": "Its refreshing to see actual DD. Thank you for your efforts.", "score": 5, "replies": [{"body": "OP has a decent track [record](https://www.markovchained.com/profiles/view/reddit:Bulky-Mountain8854) too", "score": 1, "replies": []}]}, {"body": "I had viac early this week sold my calls the night before they crashed was going to reinvest my original in calls again but lost track of time and missed it.", "score": 2, "replies": []}, {"body": "Thoughts on Criteo (CRTO) and Mohawk Group Holdings (MWK)? Both heavily undervalued IMO.", "score": 2, "replies": []}, {"body": "Upvote for LMT confirmation bias 🚀 4/16 390Cs (I know lol) going to be picking up some longer term calls soon", "score": 2, "replies": []}, {"body": "GNOG warrants aren’t mostly expired, they’re ALL expired and have been since March 5th.", "score": 2, "replies": []}, {"body": "GNOG is Fertitta run. That guys an idiot.", "score": 2, "replies": []}, {"body": "I’ve been in SRPT since the s drop and it’s been trash wish it would just hit its target or sell the company I heard somewhere an unnamed nasdaq company was pulling up cash to buy it", "score": 1, "replies": []}, {"body": "yeah what’s up with that?", "score": 1, "replies": []}, {"body": "Nice write-up, it's great seeing things that aren't just emoji spam and yet another post about the single most talked-about stock on the board. I think Ill be moving some money around on Monday haha. \n\nIt looks like SRPT got absolutely slaughtered at year-end earnings, but it made some big moves in mid 2018 and mid 2019. Do you have any insight into what went on at some of these major swing-points?", "score": 1, "replies": []}, {"body": "Great DD, I have not seen any news about SRPT getting any traction. Have I missed something? Is there an ETA on when they should have more clear FDA approvals?", "score": 1, "replies": []}, {"body": "Don't agree on Sarepta and curious why you didn't mention the ~50% drop it took in January due to the \"failed\" test results for one of its new drugs?  (I say \"failed\" because it was a short term test for a long-term solution)", "score": 1, "replies": [{"body": "I don't know much about investing in biotech but from what I hear it's just super volatile because of \"failed\" tests like you're saying. That's why I bought in some weeks ago lol, I really haven't done enough research lmfao but figuring they recover it's just a perfect time to buy", "score": 1, "replies": []}]}, {"body": "The boomer Im becoming drawing me closer to BP. Boomer divvie, household name with the gas stations in the US.", "score": 1, "replies": []}, {"body": "My friend works for BP, they have used COVID to get rid of a lot of expenses and middle management. They will rip for the next few years IMO.\n\nI’m long DG and reckon this is a safe play for the next few years. \nLots of good DD on here about it.", "score": 1, "replies": []}, {"body": "What changed your outlook on VIAC? I saw your post a couple of months ago liking it at $70...", "score": 1, "replies": [{"body": "Nope when I made that post, VIAC was trading at around 30+. Definitely not 70.", "score": 1, "replies": []}]}, {"body": "LMFAO way to know when to exit a trade, this post aged like fucking wine.", "score": 1, "replies": []}, {"body": "Srpt to the moon 🚀🚀🚀🚀🚀", "score": 1, "replies": []}]}
